{"App Title": "2MD: VR Football Unleashed", "App description": "2MD is a groundbreaking motion-controlled VR football game. Draw the plays, call the shots, and throw, hand-off, or run the ball before the clock runs out!\n\n Throw like a pro with realistic motion controls in a room-scale quarterback experience.\n Draw plays and hone your strategy: customize up to 8 offensive plays in VR before taking the field.\n Featuring 8 unique teams. Customize colors, QB voice, route color, and more.\n Includes 8 immersive stadiums filled with thousands of screaming fans.\n Featuring the voice talents of Xander Mobus, SungWon Cho, David Wald, and more.\n Exciting arcade presentation with a 7-round heat and rapid-fire bonus rounds.\n Spectacular replay-ability, challenging AI, achievements, leader-boards and a virtual trophy case.\n Oculus Rift Cross-Buy Enabled.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Simulation, Sports", "Languages": "English", "Version + Release Notes": "1.0", "Developer": "Truant Pixel, LLC", "Publisher": "Truant Pixel, LLC", "Website": "http://2mdvr.com/", "Release Date": "January 9, 2020", "Developer Privacy Policy": "None", "Space Required": "774.0 MB"}



["5 stars\n56%\n4 stars\n29%\n3 stars\n7%\n2 stars\n1%\n1 star\n6%", "Mattplus096 days ago\nDone Buying Quest Software\n\nI'm glad I also have this on PSVR because it's alot of fun. However...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 5", "jfmanJun 28 at 4:10 PM\n2 MD Vr football unleashed\n\nI really like this game as i am a huge football fan. The only thing that does aggravate me is when the throwing hand sometimes either doesn't release the ball correctly or the hand starts floating in space. I don't know if this is due to the game or maybe i need better rechargeable batteries. When everything works right i really enjoy playing it.\n\nHelpful | 23", "Tacoma197510 days ago\nGreat game ... more Please!\n\nIf you like football, you already own this. Its not Madden yet with that kind of realism or players you know... but with that said, the mechanics and being inside the game makes this and VR so cool. Pick your colors, your plays, go pass some completions. Score some TDs and win the Championship! If you got enough room, you can QB sneak in the TD. Yes you can! Fun game for anyone. Heres my message to developers: When will you add more sports? VR is a game changer. No pun intended. I had a dream about playing HORSE in VR. Why no basketball games, hockey, more tennis options, more golf options, volleyball, racquet ball?! The list goes on and on. You make these? I guarantee people buy them instantly! Oculus Quest needs way more Sports games. Sports Scramble is not enough! Buy this game. Even if youve never played football, being a QB is cool.\n\nHelpful | 4", "ChrisX3619 days ago\nTecmo Bowl, VR Style!\n\nThe title states what this pretty much is. You have 8 plays you can modify (anyway that you wish to) and then choose from.\n\nThe tracking of the throw gets quirky of you have a prolonged windup. You must shorten your throwing motion to get a more accurate pass. That is my only real issue wiyh the game, since I have a longer delivery.\n\nHelpful | 2", "K-oticJul 27 at 7:20 AM\nThe best Football Game on Quest\n\nAlso, the only football game on quest at this point. So, if youre a football fan, and would like to play football in vr, this is the only option you got, so buy it. Itll scratch that itch good enough, but keep your expectations very low. This is a mini game, two minute drill, where you play QB only. If you throw an INT, you just go back to where you started and get your downs back until time runs out. No defense.\n\nIf you have a Link cable and a good pc, I would highly recommend VR Sports challenge over this game for a much better football experience, but I like this game enough to have bought it on multiple platforms. Hopefully the updated version, 2MD VR football Evolution makes it onto the quest.\n\nHelpful | 2", "SliableJul 12 at 1:52 AM\nGreat concept; lackluster execution\n\nThere is something genuinely satisfying about being in the pocket of this game. The idea and the pocket feel are great. However, the graphics are bad, the throwing calibration is poor, and the general process of gameplay is so limited. Its really a VR Nintendo NES game. For what is generally true of the Quest - it is really just mini games vs full video games - 2MD is this in extreme. Where other games such as The Thrill of the Fight or Eleven Table Tennis make up for this with excellent execution of game mechanics, 2MD fails to deliver. While it is unique, either a massive update or a better executed option should be considered before paying full price for this.\n\nHelpful | 2", "chinolam17 days ago\nWay better on the Quest than the Steam v\n\nI bought this on Steam a long time ago. I played it with the Rift CV1 and Samsung Odyssey. The throwing controls were terrible for me. Could not throw ball well. So glad I took a chance on the Quest version. Throwing controls are way better. It's not a polished game at all. But it's the main thing I play now in VR.\n\nHelpful | 0", "EtrninjaJul 23 at 10:00 AM\nWorth every penny\n\nI never thought that I could have so much fun playing a game. It just feels like your in the moment, with the clock running down as you throw the ball down the field. The only thing that I would change is when you scramble, the stick that you dont use to run could be a juke button or maybe just a truck button to get through more players. 5 stars all the way. The throwing controls when you let go of the ball can be weird though, sometimes it just goes strait down or strait up\n\nHelpful | 1", "SuperCarter3Jul 9 at 12:26 PM\nGreat game, but imperfect\n\nThe game itself is super fun, and feels like the actual thrill of playing a football game. However, anytime you bring your hand behind your head to throw, tracking stops, and youre at the games mercy as to where your throw goes. The only way to fix this is to sidearm your throw\n\nHelpful | 2\nDeveloper ResponseJul 12 at 7:22 AM\n\nThanks for the kind review! To clarify, you absolutely can throw by bringing your hand behind your head - the issue is only if you *hold* your hand behind your head for more than 1 second, the Quest's tracking persistence falls off. Thus, recommend that you avoid prolonged wind-ups when throwing. Do this, and you can throw more naturally without needing to side-arm.", "PhaQJul 25 at 2:40 PM\n\nThis is a great game love the way you can make plays and the flow of the game. When you can play defense and make it a complete game I'll give 5 stars . But all in all it is a fun game!!!\n\nHelpful | 0", "foxtrottitsJul 12 at 10:35 AM\nFantastic football game\n\nLove this game. It's really exciting, and connecting with receivers is very satisfying. It's easy to get into the game, I find myself yelling at my team the entire time I'm playing, you really feel like a field general.\n\nWhile I feel they do a great job of making you feel like you're on a football field, the immersion is broken when I can't feel the taut backside of my center. Please add this as a multiplayer feature.\n\nHelpful | 0", "Sir_SleezyApr 26 at 7:01 PM\nOculus Quest's 1st Top-Notch Sports Game\n\nDon't let the \"simple\" graphics fool you. This 2 Minute Drill(2MD) football game and motion throwing simulator is the 1st unforgettable sports experience in VR. You'd be a fool to overlook it.\n2MD Football Unleashed at its core is an arcade football simulation that puts you in the role of QB as you lead your team on a game winning drive with 2 minutes left on the clock. There are 7 teams to defeat, with the difficulty and the amount of points you need to score increasing as you stack up wins.\nThere are 8 teams to choose from, each with their own home stadium and marching song(although I recommend playing with music off). Your team colors are fully customizable with sliders for Red, Green,and Blue.\nUpon loading into your locker room, you are presented with a whiteboard, where you can design up to 8 plays that are mapped to your left and right controllers. Each play can be mirrored by a double press of your play selection, essentially giving you 16 plays to choose from.\nThere is a practice field you can use to practice your throwing skills. Here you can adjust your Throw Power and Release Point, so that you can play the game with the most natural throwing motion possible(I recommend spending a bit of time fine tuning these settings).The experience can feel quite special when your throwing motion meshes with the action in your headset, and the game can feel funky if you don't set it to your comforts.\nAll in all, this game is a must purchase experience for any fan of sports games. While this game doesn't have the team management aspects or deep franchise/season modes of sports sims on consoles, it houses what could be the best emulation of what it feels like to play football.\nI grew up playing sports and always regretted giving up football after my freshman year of high school. Madden has always been fun, and the 1st person mode in NFL 2k5 was the closest a game ever got to replicating that on-field feeling. Until now.\nFrom the Friday Night Lights feel of the Truant's home field to the shower of lights in the Pixel Dome, each team's stadium is awe-inspiring(along with the touchdown celebrations designed for each stadium). It feels like youre there on the biggest stage possible. Throwing passes around the field to receivers that are running routes you drew up. It's wild. Even the weight of the headset on your head begins to feel like you're wearing a football helmet, complete with a face mask framing your vision.\nAlong with being untethered to a gaming rig, allowing you to take snaps and drop back, it creates one of the most immersive and interesting VR experiences I have had thus far. It's amazing to me that a team of 3 or 4 people pulled off a project like this.\nI love that when you finally beat that final team, you get to wear a championship ring on your finger from then on. I just wish that the rings would stack up on the rest of your fingers when you win more championships! It would be so cool being blinged out with rings while tossing hotstreak TDs to that open receiver downfield. Hopefully that's something thats possible in an update!\nI loved the multiplayer experience thats possible on PSVR, but totally understand how tough it would be to make possible on the Quest. I currently play my friend by live streaming a campaign in a Facebook group and then comparing scores after we each play. Maybe it would be possible to have an NCAA style OT situation where teams take turns on the 20 yrd line and have to score in 4 downs, and you watch the other team play from the sidelines when its their turn to try, possibly even trying from further and further away with each successful series? In truth, I dont know what's possible. A fan can only dream.\nHaving those 8 teams to choose from is great, but I would certainly pay for a dlc pack of new teams and stadiums. Hopefully that's something that can come in the future!\nIf you've read this far, I hope you make the smart choice and give this game a shot. At the very least, you can say you played the og game that brought true virtual football when everyone is marvelling at whatever nuts stuff Madden 2030 is dishing out in the future.\n\nHelpful | 41", "TomambroJul 28 at 3:04 PM\nVery fun but........\n\nThis game is very fun but its just a qb mini game. This wouldnt even be a bad thing if they had a option to play a full game. Idk why they cant have an offensive only game where you just see clips of the defense or just have a voice say they scored or something. This would lead to longer play sessions as the current version gets repetitive quickly.\n\nBottom line if you see it on sale or apart of a bundle grab it.\n\nHelpful | 0", "Poff053Jul 25 at 6:51 PM\nGreat game\n\nGreat game and fun to play. Unfortunately there is no height adjustment option which would come really handy since I broke my leg and cant stand.\n\nHelpful | 0", "cjkorek2Jul 1 at 4:25 PM\nSuper fun sports game\n\nI have most of the games on the quest. This one is in the rotation of games i play every day. It does not have madden graphics at all. But what it does have is the ability to make you feel like a real qb. Its fun to draw up your own plays and see how the defense reacts. Also what I appreciate about the game is that its challenging. Once you get to the rounds where you need 2 scores to go to the next round it gets harder.\n\nOnly thing i would really like that they would add is like a qb challenge game.\n\nOverall its a lot of fun to play this game. Esp if you love football.\n\nHelpful | 1", "Exodus077Apr 24 at 8:16 AM\nGreat, ton of fun Have some ideas\n\nI'll start by saying this game is fun and well done. Love the feeling of being a QB and scoring a TD. If you like football, get this game.\n\nHey devs, how about a simple multiplayer option similar to TecmoBowl. In multiplayer mode your plays aren't custom but rather 4 set plays to choose from. Offense chooses their play, defense tries to guess which play was chosen which will make them have lock down defense and increase interception chances. Players go back and forth until one gets two scores above the other. Controlling a Safety or Cornerback would be awesome too (giving each user one player to control QB/DB) but now I may be asking too much.\n\nAlso, this should be easy, level select rather than having to start from the bottom and progress. Sometimes I only have time to play one or two matches and would like to play the more difficult championship game. So Campaign option (like it is now) or level select option.\n\nThanks for the great game, you guys are awesome\n\nHelpful | 9", "bryce.bishop23 days ago\nFun game\n\nNot perfect but excellent entertainment\n\nHelpful | 0", "GreyGazelleJun 21 at 10:03 AM\nReally fun game but can add some modes\n\nThis game is really fun believe me. But I wished they added like a defense mode where you play as the cornerback. Or a wide receiver mode where you play as the wide receiver. And also the controls are weird. So lets say you look left and you press up on the thumb stick you go towards the offensive line rather than going the direction your looking at\n\nHelpful | 1", "ewoswald9 days ago\nVery fun\n\nReally fun game to play!\n\nHelpful | 0", "briantullyJul 7 at 4:50 PM\nGood, but buggy enough to drive you mad\n\nI really wanted to love this game. Despite the stylized graphics, it's actually quite an immersive experience. However the throwing/tracking is just way too buggy for prime time, which is very frustrating. There's no consistency. Sometimes I'll throw a bullet/bomb where other times the ball just flops without any distance/velocity --- whereas my arm motion was identical. I first thought it had to do with bad lighting or low controller batteries so the last few times I've played I've made sure to be in a very bright room with fresh batteries installed in the controllers. Sadly that didn't make much of a difference. When it's working as expected, the game is brilliant and really fun. But it only takes one wonky throw due to bad tracking to make you want to kick the virtual Gatorade cooler over. I do hope they plan on releasing newer versions that address/fix the bad tracking.\nP.S. the description above says that you can handoff, but nowhere in the game or on the developer website does it say anything on HOW to do a handoff.\n\nHelpful | 1\nDeveloper ResponseJul 8 at 9:21 AM\n\nhey there. sorry you had a bad experiencethe game has gone through vigorous testing to ensure smooth performance. despite these efforts, the quality of the tracking is subject to several environmental variables (some of which you astutely noted) however you missed a big one: if, when winding up to throw, your controller goes behind your head for more than a second, this will decrease the quality the tracking data and result in the unpredictable results you highlighted. Now as a developer this is completely out of our control, so the best advice we can give (and this is stated on the chalkboard in the practice area of the game as well) is to avoid holding your throw behind your head or out of the cameras tracking area for more than one second. I am confident that, you may have noticed from the majority of positive reviews we are getting, that this is not a prolific issue, but it has impacted some folks experience. It doesnt diminish your experience, however, though we feel that you should take this into consideration, and this will hopefully improve your play. lastly, handing off the ball is fairly simple: you reach out, and when the receiver makes contact with the ball, you let go. Just like in real life. :) if this rectifies your issue, please feel free to update your review with the results. Otherwise, you can reach out to us on Twitter (@truantpixel) if you need further assistance.", "VirtInsanityJun 5 at 6:26 AM\nA great start!\n\nI am really enjoying this game. Drawing up your own plays on the whiteboard and then seeing how they work out is awesome! Graphics are simplistic but it doesn't detract at all from the immersion and fun of this game. What I would like to see added are difficulty levels for different player levels. Also can be really frustrating when you whistle a really nice pass by your players ear hole but because they have no hands the pass is incomplete OR intercepted. Maybe come up with a way the receivers can jump just a little? Last can we go to the practice field and run our plays without a defense instead of just throwing at targets? Just some small improvements really could make this a stellar game even without all the career mode stuff. As it is a really fun game, worth the purchase if you are a sports fan.\n\nHelpful | 0", "Marcocolo387Jul 24 at 1:11 PM\nMultiplayer\n\nI love it now update it dam it lol\n\nHelpful | 0", "OlanderssonJun 15 at 12:25 PM\nFriday night lights\n\nTo start this review off, its two minute drill football. You gotta find ways to score fast against more and more challenging defenses as you go. The game lets you customize your playbook, draw up your own plays. It lets you choose a number of cosmetic details for your team. It lets you practice in a few different ways. In the end, it prepares you for the challenges.\n\nPros\n+Realistic throwing mechanics\n+Lets you get creative\n+Replay value because of how it lets you change things up\n\nCons\n-the rungame is non-existent, running as a Qb is really slow\n-If you know football it can be easy to outsmart the AI\n-visuals are simplistic\n\nAll in all, for its price? Well worth it if you like sports. I keep on coming back to play it just to try new wacky plays and to stand in my playspace and scream \"OMAHA\" like Peyton Manning. Its just pure and simple fun.\n\nHelpful | 1", "Drythos02Jul 14 at 3:57 AM\nawesome game\n\ngreat game, i have always been a lineman and its awesome being able to play as the qb, but when i pump fake (out of habit) i usually end up throwing the ball to the sides or behind me. it is not the developers fault, but the oculus quest tracking just does not track 360. if you can get out of the habit of bringing your hand behind or close to behind your head when you throw then you will have an amazing time\n\nHelpful | 0\nDeveloper ResponseJul 17 at 10:15 AM\n\nGlad you enjoyed it! from our testing it seems you can have your hand behind your head for up to 1 second before the tracking is lost, so as long as your hand isn't occluded for that long it SHOULD be able to keep track of your throws. Controller battery % and lighting can also affect tracking quality, so it's probably important that those are ideal as well.", "charmander1317Jun 27 at 2:32 PM\nIt's good\n\nI'd say if the dummy's could jump, came back or tried to get open instead of just running to the endzone and had a bit wider range to catch it'd be a five star\n\nHelpful | 1", "BigChungus215 days ago\nSo fun\n\nMyst have game\n\nHelpful | 0", "ViniatiJun 21 at 6:43 PM\nSimply amazing!\n\nIf Madden football is listening, take note that this is the starting point of a fresh new take on football. Ea would be smart to buy this tech so we can get NFL teams!!\n\nHelpful | 2", "Familyquest11May 24 at 1:07 PM\nLotsa fun\n\nI really enjoy playing this game. Once you get the hang of release point for the ball x angle of the joystick, things get really fun. Plus you can add a running game, which adds to your choices. But I've noticed that once I get to round 6, everything changes. I expect the defense to play better and anticipate more, but why do my receivers lose their speed, agility and catching ability? What makes it worse is that the 2 minutes are actually no longer 2 minutes of time. I've watched the clock jump 9 seconds at a clip, justifying what I could only swear I'd been experiencing. This happens consistently at that level. I don't mind losing, but it's like the whole game changes at that point, so an improvement could be made because I doubt the time is supposed to jump like that. Other than that, it's a fun game that you'll want to play over and over again to try and better your score.\n\nHelpful | 1", "JuNo223Mar 24 at 2:10 PM\nAdd multiplayer\n\nThis game is so fun but it kinda gets repetitive, can you add multiplayer where you can challenge real people and also add wr so you can be a wr. Make it so you can ready up a get Put on a team so its many real people vs other real people. Like teams of 5. If you need inspiration get ROBLOX and find the game football fusion. Thanks Please add it would make this game sooo much more popular and fun!\n\nHelpful | 36\nDeveloper ResponseMar 24 at 5:09 PM\n\nHi JuNo223. Adding multiplayer (I assume you mean online multi) would require completely rebuilding the game from scratch, as it would fundamentally change how the football and player AI operate to allow them to function over a network. It would also require creating a working virtual defender interface for the person playing against you -- which would need to be just as fun and addictive as playing QB! That kind of development is no small feat; it takes a great deal of time and, of course, money. Suffice it to say, if we see the kind of response we are humbly hoping for (and folks continue supporting / spreading the word about our game), we wouldn't rule out the possibility of ... something :)", "YungTweakJun 4 at 9:26 PM\nThe first game I play every day\n\nThis is the perfect mix of gameplay, immersion and physical effort. While pistol whip and thrill of the fight are sweatier and require a ton of work, this game is more chill and will have you lost in the fun. This is my first game every time I put on the headset because its a great warm up. I dont think this football sim will ever get old!\n\nHelpful | 1", "DeadpooolllloJul 12 at 7:56 PM\nGood game\n\nIt really just needs an scrambleing\n\nHelpful | 0", "SchieveJun 22 at 12:01 PM\nNeeds a little work\n\nSometimes throwing gets off and wish there were some different modes like full 4 quarter campaign and multiplayer but overall pretty great game\n\nHelpful | 0", "ribeye07Jul 23 at 8:40 PM\nIn practice mode\n\nEverytime in practice mode the screen pops out and waves. Both times Ive tried the game. Cant stop it and it is an instant dizzy.\nHave to pull off headset fast before I fall.\nIs there a patch?\n\nHelpful | 0", "Amart_98Jul 12 at 10:28 PM\nAmazing!!!\n\nOnce you get used to throwing in this game then it will be hours and hours of fun!!!\n\nHelpful | 0", "vik.sharma.12Jun 11 at 2:38 PM\nAwesome!\n\nGot this on sale and it was so worth it! Love how you can draw up your own plays and the throwing mechanic works great! Plus this game is so addictive and you just want keep playing to beat all the teams (and your high score).\n\nHelpful | 0", "Morpheus2199May 12 at 6:28 AM\nA Great Start\n\nThis game is insanely fun and I love the customization of uniforms, plays, and your throwing style. However, there is only one game mode so that makes me deduct a star. There should be a way to play full games, not just one or two drives. Overall this game is extremely fun, but your not gonna play it for more than 15-20 mins at a time until they add full 4 quarter game modes.\n\nHelpful | 0", "Scruff_CPacMay 25 at 5:26 PM\nThrough A QBs Eyes...\n\nThis is an amazingly fun, and quite frankly, accurate football game. This legitimately gives you a real taste of what its like to line up under Center and play Quarterback. At first it may seem like a generic Arcade game, but you quickly realize that you can actually read Defenses and can/need to go through your progressions to find the open Receiver. Bottom line, if youre a Football fan just go ahead and buy this. Its a blast. The idea of this becoming a more sophisticated multiplayer experience in the future is salivating. Great game. Thank you, Developers!\n\nHelpful | 1", "ZekeDelfourJun 28 at 6:12 PM\nEasily one of my favorite games\n\nI wish there were more sports games like this. This puts you in at QB and you really feel like you are in the game. Very fun.\n\nHelpful | 1", "ryan.koggeJul 5 at 9:28 PM\nGreat game loads of fun\n\nNever gets old\n\nHelpful | 2", "dancejohndanceJun 28 at 9:01 PM\nThis game rocks\n\nNothing to complain about here. I love football and I love this game. I probably play it the most of any title on my quest.\n\nHelpful | 1", "DineyVR-11Apr 22 at 9:27 PM\nThe bomb\n\nThis game was the best games Ive installed on my Oculus quest it put so much effort into me playing football and practicing and since I miss football since its Quarantine I can be able to enjoy the memories by playing it on my headset Ill read really give us a five out of five stars because this is really good and its probably the best game in my headset\n\nHelpful | 4", "Mrjb521May 14 at 4:09 PM\nGood but not great\n\nThe general game is very good but the game is quite limited to a 2 minutes drive on offense as a QB . No defense, no run after catch or actually catching of the ball..... The game is fun but gets old quick as its basically the same thing over and over ... Add a defensive experience , some special teams and then you have a football game\n\nHelpful | 3", "MandelnacciJun 9 at 8:11 AM\nAddictive\n\nLuke many arcade games of the past this on field experience is worth the hours you will most certainly spend playing. Unlike any other game in the catalog for quest. Also a good shoulder arm workout .\n\nHelpful | 0", "jcrowzer10May 15 at 10:09 PM\nGameplay functionality is very realistic\n\nThis is my favorite game I own on the quest. Ive always enjoyed sports games more than shooting games and this is the first real step towards a live action vr sports game (thats not tennis). The physics feel so real. The game really captures if you throw the ball hard or soft and the trajectory of the ball almost always comes out the way I anticipated. The graphics could be more realistic which probably comes with time and optimizations but the gameplay itself is amazing.\n\nTo the developers, it would be cool if you could break tackles with stiff arms. If that was the case, it would also be cool if you could create blocking schemes for running plays and be the running back for those plays.\n\nIf you wanted to make money, you would give these players names and ratings and make people earn (and/or pay) for upgrades for things like speed, catching ability, break tackle, blocking, etc.\n\nHelpful | 0", "ABucketMay 14 at 1:37 PM\nA lot of customization options!\n\nThat was one thing that really stood out. Youre able to change the uniform colours, voices, emblem (out of 8 choices), and the biggest one, DESIGN YOUR OWN PLAYS! Such a cool design choices. My brother is not big into sports, but he drew up a wild play and was having fun using it in the game and seeing it work!\n\nIts pretty easy the first game, but then the defence gets better every match. Ive only made it to round 5 and I feel Ive played it a decent amount!\n\nThe thing thatll take getting used to is the throwing. At first I tried to throw like I would a real football, but that can be very inconsistent. Once you use more of a flicking methods youll make a lot more progress.\n\nGreat job devs! Id love to see more team options, or maybe new football designs! And know that if you ever make a wide receiver game, Id buy it in a heartbeat :)\n\nHelpful | 1", "m.cody.simsMar 20 at 11:07 AM\nVery addicting\n\nWas looking for something to tide me over during the Great Sports Blackout of 2020 and almost passed on this title because of the simple graphics. Very glad that I audibles and purchased. This game was very addicting! I really like it. It is accessible but challenging. I think you would enjoy it.\n\nHelpful | 6", "srodd316Apr 4 at 1:53 PM\nAwesome\n\nFirst off this game is more of a 10/5 but it wont let me rate the game that so I will include it here. I am going to list 5 great things about 2MD VR football unleashed.\n1. Everything is customizable\nYou can customize: The team, the stadium, the colors of the logo, the home team music, and the plays ( more on that later)\n2. The customizable plays\nIts just the way that you customize it is amazing. First you drag the player to where you want them to start. Then draw a line to route where they go. BOOM that easy.\n3. The gameplay\nI like how it is a championship and your goal is to win its great.\n4. The AI\nThe AI can be annoying at times but the opposing team AI is what I am talking about right now. They are very easy at first then once you make it to the teams that have scored two points it gets hard and it is a big challenge.\n5. The detail\nThis is where many people complain but I like the detail In the fields you dont pay attention but if you do you can find Easter eggs. Like in the shirt stadium it says  The skins suck which I found pretty funny.\n6. BONUS reason: The mini cutscenes is what I will call them\nIn certain stadiums there are mascots that pop up or an event happens but I want you to discover them yourself.\nAll in all this is a great game worth every cent so get it.\n\nHelpful | 6", "PlamplaplamJun 2 at 5:58 PM\nLove this game, only one thing missing!\n\nMultiplayer. I love this game but man a multiplayer mode would bring it from a 4 to a 5.\n\nHelpful | 1", "FatDoodleMay 13 at 4:27 PM\nVery good sports game!\n\nI have played football for my whole life and must say this game didnt disappoint. The throwing mechanic takes time to get used to but is great when you are used to it. As well as jt gradually gets more difficult as you go, I didnt want a game that was too easy.\n\nHelpful | 0", "trenix10Jun 9 at 12:01 AM\n\nLive the mechanics\nWish there were seasons tho.\n\nHelpful | 0", "potusbjbMay 3 at 12:22 AM\nGreat game please update this\n\nHello\nWould I would like to say is I played football so I really enjoyed this game can not stop\nPlaying but it would be nice maybe have some receiver ratings to know which to\nThrow to or even how about some type of special\nPlay after every 3 attempts either super long shot down field or rushing ability to try and run with the ball also a good feature that should be added is maybe being a blocker downfield and have controller vibrate as you hand off ball you can now block for your team\n\nHelpful | 1", "raab27May 1 at 9:29 AM\nOnly game I play everyday\n\nConsidering madden was my #1 game on Xbox. I had to get some sort of football game. This is definitely an arcade game and does get a bit repetitive. However, this game is a little tough and take some getting used to. Throwing is pretty accurate but keep in mind your WR are dog Sh!t at catching. I play this everyday and still dont find it actually boring. As most people complaint I wish there was a little more to it than just a 2 min drill but I understand. Definitely worth every penny if you are a football fan!\n\nDevelopers: I know asking for more in this game is a lot but if there was a way you could spin or juke defenders during a QB sneak would be awesome\n\nHelpful | 1", "DeezzeSkeezzeMay 27 at 7:10 PM\nFun game\n\nWorth the money. There will always be ways to make it more fun but I have no complaints about this game.\n\nHelpful | 0", "thedonutlord87Apr 14 at 6:26 PM\nSo much fun\n\nThis game, while having very basic graphics, is simply great if you're any level of a football fan. It makes you feel like you're standing in the pocket trying to make a play. There's a bit of a learning curve to the throwing mechanics. I don't think there's any tech that's quite there yet on simulating throwing a football but this game isn't hindered by that. Design your routes, move in the pocket, and hit your receiver deep for a TD. Don't forget to hold that trophy at the end.\n\nHelpful | 2", "Tremaine251Apr 29 at 1:20 AM\nFinally, a sports game for the Quest\n\nThis game is amazing and fun. I really get into the game, I sometimes feel like Tom Brady with 2 minutes to go in the 4th. The graphics are decent too, don't expect 4k visuals if you decide to buy this. While it is entertaining, it does get a bit repetitive and difficult. Maybe add adjustable difficulty levels so some people can actually play against all the teams. Highest team I beat are the Princesses and I struggle against them most of the time. I'd like to see other teams and their fields as well. Overall it's a great, fun game and it gets you moving. Looking forward to updates and maybe a basketball game from the devs \n\nHelpful | 1", "FizzWrenchMay 5 at 5:37 PM\nLot of fun\n\nReally fun, has its problems but worth 15 bucks if you're a huge football fan. Wish they would add more to it than just two min drills but I have high hopes for the 2nd one coming out.\n\nHelpful | 0", "BenUSA1May 8 at 8:25 PM\nThrow, Run, Handoff, 2 min\n\nNot bad, but I am sure they can add bit more to the game. Option wo 2 min and simple Defense against AI or online PVP. If that happens definitely can go up to $25 game.\n\nHelpful | 0", "Dunn_Boys_RockMay 13 at 5:57 PM\nGood Start\n\nIts a fun game for a session or two but the replay factor is low. All it is is a two minute drill over and over again. Yes its a tournament setting where you play the next team of you beat the first one but after 2-3 times it gets boring. I like it and it has promise it just needs more depth.\n\nHelpful | 0", "Fraz6847Jul 9 at 4:04 PM\n\nCrashes a lot\n\nHelpful | 0\nDeveloper ResponseJul 11 at 3:22 AM\n\nhey Fraz  if youre experiencing any kind of program instability, the issue is not likely coming from the game itself, but a corrupted download. I recommend doing a full power cycle of the headset, and for good measure delete and redownload the game. you should not be experiencing any crashing for the most part, and if you are still having issues please reach out to us on twitter @truantpixel.", "etom1999Jun 11 at 9:21 AM\nLove it!\n\nI can't think of one reason any football fan wouldn't love this game.\n\nHelpful | 0", "cynocephalusJul 12 at 4:47 PM\nFun customizing and executing routes\n\nFun experience from a QBs perspective. Really puts you into the game and makes you look at the defense against your routes. Since gameplay is limited to throwing the football, can get repetitive. Release of the football can sometimes be a bit wonky too but overall the experience is fun. Just because I love football so much, I tend to start my gaming session with a round of this then move on to beat saber or something.\n\nHelpful | 0", "alexthelegend44Jul 11 at 6:37 AM\nA good VR football game\n\nI am a huge fan of football and am a huge madden player. Although this game is nothing compared to Madden, it is a fun football game and an excellent VR game. The game has a few glitches but it is still a very enjoyable experience. 15 USD is a bit expensive, but if you want a fun football game for the Oculus quest, this is definitely the way to go.\n\nHelpful | 0", "BMFSHOWJan 9 at 10:08 AM\nSimple But Oh So Fun\n\nLet me preface this review with two things. First of all I'm a massive football fan and second I was given an early copy to play by the devs. I very rarely leave a review here in the Quest store but I felt like with this one I had to. 2MD VR Football Unleashed is an absolute blast. Yes the graphics are simple but the gameplay is just stellar. You feel like you are really throwing a football down the field and I love that it's not just an aim and throw game but you have to adjust your throw power in real life for a very realistic feel and you have to aim where you want the ball to go. If you like football at all then you have to give this a shot.\n\nHelpful | 288", "knighttime79Apr 6 at 10:58 AM\nAddictive and fun\n\nA lot of fun. The only thing is s I wish the practice rounds were more realistic. Youre throwing at A target which is hovering in the air but that doesnt really help you with placing the ball to a receiver on the ground. Like others though I wish there was a multiplayer.\n\nHelpful | 1\nDeveloper ResponseApr 6 at 9:21 PM\n\nhey knighttime, thanks for the kind words. if youre looking for ground targets in the practice area, just turn around! weve put a bunch of them in various areas downfield for you to practice your accuracy.", "Cowboy_KenApr 16 at 7:00 PM\nI love this game!\n\nThis is a really fun arcade football game! Shoutout to the developers for making a fun and balanced game! I love that you can make your own routes and run the ball. If you like football you will definitely enjoy this game!\n\nLike many others, I would love to see multiplayer added in the future. I look forward to seeing what the developers are able to do with this game in the future! I would definitely recommend this to anyone that is on the fence!\n\nHelpful | 1", "Get_To_Da_Choppa_VRJan 9 at 8:59 AM\nHIKE!!!\n\nLet me start off saying I have no knowledge or understanding of American Football but I was curious about this title and was provided early access by the devs and despite not knowing the sport or what was going on at the start , I absolutely loved playing this!\n\nThe gameplay is super simple with their being only really 3 components to it, that being move your character, decide the play (which you can customise) and throw the ball. It is super straight forward but oh so much fun and the simplicity makes it a great game to pick up and play and to share with others. The graphics are basic but clear and the cartoony aspect adds to the charm.\n\nThe game plays out with you alweys playing offence and in the last 2 minutes of a game and you need to score a single touchdown to win, this sounds easy enough but with the AI adapting to where you look and how you play, it will get progressively more difficult the more you play, but this is counteracted by you improving your skills.\n\nOverall a really fun game but just go in knowing this is more of an arcade type experience than full on Football game.\n\nHelpful | 52", "garygag56Jun 1 at 11:08 AM\nGood game\n\nGraphics are not the best but still very cool concept and fun.\n\nHelpful | 0", "lemaire214Apr 9 at 12:57 PM\nAmazingly Addicting!\n\nIts way more then it appears to be...dont let the simplistic graphics fool you. The mechanics and game physics of throwing the football in this game are so accurate and feels like you are actually throwing a football in your own backyard!\n\nHelpful | 2", "BigfisherringApr 14 at 8:52 PM\nSolid football fun\n\nIf you like sports - buy this game.\n\nI played football through college and have loved the sport since I was 7. Im 41 now and this game has given me the thrill of football, that my body cant handle anymore.\n\nValue. At $15 (I think?) Ive got at least 4 hours of fun out of this. After about 2-3 hours my mechanics started to lock in and thats where the fun really starts.\n\nIts a riot to race and manage the clock, drop bombs, sneak for a goal line score, throw darts across the middle, pitch it to the RB, etc etc. So. Much. Fun.\n\nIt is simple and quick to learn and it works well. With that, Id be lying if I said I didnt want more. A season, multiplayer, league etc.\n\n2md football gets me excited about the future of VR football. I hope the team that put this together builds on it and develops a VR-madden type experience. Ill eagerly look forward to that purchase. Please!\n\nFinally, Thanks for making this game! Ive enjoyed it thoroughly!\n\nHelpful | 1", "MrTAteMyBallsJan 23 at 8:19 AM\nFun but with some aggravation\n\nFirst I want to talk about the gameplay. It's really quick and fun. The throwing physics are surprisingly great. I can loft it, lead the receiver, or throw a laser. And it's accurate. The look and feel of the game are worth the money.\n\nThe things that need to improve are:\n1. SAVE POINTS!!!!! Having to start over at 1 each time you lose a match is ridiculously frustrating. I can't get past level 6 so I keep playing 1-5 over and over just to get back there. And occasionally I lose game 4 or 5 so it's back to the start several times just to get back to match 6. This must be addressed in an update if I am going to continue playing this game.\n\n2. This is more of a wish than a need. Level up. The points earned in the bonus round can be spent to upgrade attributes of players. like speed or catching ability or whatever. After match 4, the computer AI seems to have much faster player a who can catch much better. it would be nice to have a levelled up player or 2 who has a better chance to make a play.\n3. Running mechanics/AI is pretty bad. Trying to run up the middle is a non starter. Even runs out to the flanks are tough. The running back will run right into the back of his own player, get stuck there and tackled for a loss. perhaps just being able to assign blocking schemes for the linemen would help.\n4. Being able to create more than 8 plays and load them up however you like before each match. so i could create 20 plays and choose 8 to run during the match.\n\nOk that's all really. I know it seems like I have a lot of negative points but really except for being able to save your game and they're very small things that would improve the experience. As is the game is super fun and plays really well. It just needs a few tweaks to make it to 5 stars, IMO.\n\nHelpful | 21", "colton.dobbsMar 29 at 10:58 AM\nFun, but a little broken\n\nThis is a really exciting glimpse into the future of football in VR, but the AI is some of the worst Ive seen. Theyll give up on their routes Galway through and if they ever come into contact with a defender, they usually end up just stopping. They also tend to not be able to find their way under the ball on long passes. Passing takes a little getting used to, not only to find the right motion for the headset to track, but also because youll have to learn to slightly underthrow most of your passes due to the receivers having no hands. Still fun in short bursts though. Id love to see a more fleshed out version.\n\nHelpful | 0\nDeveloper ResponseMar 29 at 11:35 AM\n\nHi Colton. Firstly, thanks for the kind words! To address your criticisms: The receiver AI is dictated, in part, in how you set up your plays -- when they reach the end of their route, they will run straight for the endzone. If they aren't being blocked by a defender they'll try to juke around them and complete their route--I actually recommend adding some arcs around the defenders when you draw their routes (rather than sticking to a straight line) as this will let them fake out the defender and likely mitigate that issue for you. We've actually made concessions for the receivers having no hands as they will actually dive for the ball and even catch it with their head or their feet (lol) so that doesn't really affect the outcome -- plus, their 'catch zone' extends a little beyond their physical body, which also makes up for them not having hands. the most important thing is that your pass is accurate and they aren't overwhelmingly covered by a defender. If you find you have to underthrow your passes, you should try decreasing your throw power or increasing the release height -- you're likely used to releasing later based on your arm-span. Really, we want you to tailor the game to YOUR needs, not the other way around :) . Have fun, and stay safe!", "SS.BuddyApr 12 at 2:00 PM\nBest by far, love it!\n\nNot sure how this game gets any bad reviews, its the only true sports game right now, and it is really fun. It is a glimpse of what VR can be as equipment improves. I cant wait for future versions. I have won the whole thing, and unlocked all the trophies, and still love to play it. Please disregard the complaints about no arms or legs on the players, that would really hurt the graphics and does nothing to hurt the gameplay.\n\nTips:\n- Design your own plays, only way to win. You get 8 and can flip them for 16. More than enough. I have about 4 go-to and another 4 for kicks.\n- Learn to scramble, so much more fun. First week I was unaware of that option, the game was infinitely better once I realized it.\n- People say rushing does not work, it does, just script in the receivers as blockers, or run yourself. Won the final game on a scramble with 10 seconds left and had to reach the ball across the goal line to get there. That was awesome.\n\nDevs:\n- Certainly time now for some updates. Nothing yet?\n- Next version, have a 2 min option for quick play, but a longer one as well where field position matters and you can grind out a win. And a save to bypass easy rounds at some point.\n- Agree with others that taking over receiver would be fun and would love to play some D.\n- Have a field goal? For full games at least. Throwing the trophy underhand through the uprights is gratifying, that motion works, add wind to make it tougher.\n- Put bonus round in the practice zone. Gets old really fast.\n\nThanks for the great game. Makes stay in place more bearable!!!\n\nHelpful | 1", "Dbix11Jun 7 at 9:08 PM\nUnable to refund\n\nI put in a refund request on the 14th of April and just found out it never got approved.\n\nOculus won't respond to me so maybe this will help resolve things.\n\nI apologize to the software company for having to do this\n\nHelpful | 1\nDeveloper ResponseJul 8 at 9:28 AM\n\nHey, were you able to get your refund? if not, please reach out to us @truantpixel on twitter and we'll see if we can help you out. if you were, please update your review :)", "FrutelupesMar 30 at 7:11 PM\nTerrible, don't waste your money.\n\nLet me start by saying that I got this game included as a duo pack deal with Creed, which is great. This game is 100% awful. You can only call 4 plays, the receivers don't have arms so you have to be right on with your throw, and can someone tell me why my quarterback throws backwards 3 of the 4 downs when I am very clearly throwing downfield? The mechanism that detects the throw is WAY OFF. Oh, and don't think about running the quarterback, because you can't. Devs put little to no effort into this one. What a piece of garbage. If I could give it a negative star review I would.\n\nHelpful | 7\nDeveloper ResponseMar 31 at 9:28 PM\n\nHi Frutelupes. Okay, Let me see if I can address your criticisms-- you have 8 customizable plays, not 4, and you can flip them so you have 16 options on the field. the receivers don't have arms, but their detection area for the ball extends to within an arm's length all around them, so no, rigid accuracy is not required (it's an arcade game, after all). Also, they will dive for the ball and make saving catches more often than not, so as long as your throws are within a reasonable distance you'll make the completion. If you're throwing backwards, it's because you're holding your hand behind your head for too long (the headset WILL lose tracking if your Touch is out of view for more than 1 second), you're getting interference from something in your environment (possibly lighting or IR interference), OR some issue with the headset itself is throwing off your tracking. I'd recommend deleting and reinstalling the game, doing a full system update and a full reboot to be sure, and making sure you're not playing near a sunlit window or something. You should realize that if you encounter a reproducible game-breaking bug that happens with high-frequency, something is amiss because our QA, and Oculus QA, would never allow something so egregious into the wild. You absolutely can run the ball as the quarterback, but you need to set up your play to do so. Just like in real life, a successful run requires the right circumstances and opportunity--don't think you can just push your way out of the pocket, because you will get tagged. Lastly, as you probably guessed, we read every review. We're secure in the knowledge that you absolutely can't please everyone, and if you don't like our game, we understand, and value your opinion -- but don't presume 'no effort' went into it. If you still have any interest in troubleshooting the issue, feel free to reach out to us via the email provided in the support link for the game. Otherwise, I recommend contacting Oculus support for a full refund.", "nick2killersApr 24 at 5:46 AM\nfun but\n\nso fun to play the only problem is that i dont like the way you have to throw as the qb i think that should make it better but overal a fun game :)\n\nHelpful | 0", "izaiahvyoFeb 3 at 5:36 PM\nAmazing would have given five star\n\nProbably the only reason that I didnt give a five star is it I think it would be pretty cool to play as A wide receiver or maybe any of the other positions on offense and try to catch the ball that would be cool but if I added that I would have a five star all across-the-board and maybe some defense like maybe make a different game but its about defense other than that it is a great game 10 out of 10 Game if you love playing football\n\nHelpful | 12", "backstugusonMay 9 at 11:10 AM\nLimited but good fun\n\nGood casual fun.\nBut please let me start a new game right away with a press of a button after a game over. I hate waiting what feels like a minute watching my silly team of cones jumping up and down. I just want to play again.\n\nHelpful | 0", "DavidMG3May 3 at 6:24 PM\nSuper fun\n\nNeeds to get a season mode with playoffs and a championship and it would be way more fun\n\nHelpful | 0", "lakers23manJul 12 at 7:51 PM\nGreat game but....\n\nThrowing mechanics is amazing! But on the quest tracking can get weird since you wanna throw regularly and it cant track behind your head. Imagine if they could make this multiplayer somehow... it would be an amazing experience\n\nHelpful | 0", "GerrisonMachApr 22 at 12:47 PM\nNeeds Work\n\nMy expectations were very high with this game after seeing countless reviews and video on it. I played it and soon realized it gets boring really fast, the mechanics are overall horrible, and it is repetitive and very hard to learn and play. I found this to be an overall bad game.\n\nHelpful | 2\nDeveloper ResponseApr 23 at 7:40 AM\n\nHi Gerrison, sorry our game didnt meet your expectations. Its sad to see you think its a bad game. Weve done our best to ensure the game is easy to pick up and play, even for folks with a cursory understanding of American football. Still, we acknowledge you cant please everyone. please be sure to request a refund.", "iseeufosJul 23 at 11:36 PM\nSo fun! 4.5 stars out of 5!\n\nLove this game. Super fun! Maybe 1 out of 10 times the ball seems like it doesnt go exactly where I threw it, but other than that its super fun. Easy to get into.\n\nHelpful | 0", "ThreeRoots9 days ago\nFun!\n\nVery easy to pick up and play. Fun to tweak passing routes and see what works. Great replay value. Football fan? Worth it!\n\nHelpful | 0", "RossTrex1Mar 23 at 5:41 PM\nVery good game\n\nI really like this game. The most addictive part of this game is the ability to design a play and then try it out. As I keep playing I find better and better designs that allow me and the virtual team to progress. Lots of fun and great job with this VR game Truant Pixel!\n\nHelpful | 1", "Alex128803Mar 26 at 2:06 PM\nGreat game but...\n\nIts an amazing game. Ive been a football fan my entire life. I just think this game needs some multiplayer and/or co-op. They could add it were one player could be QB and the other could be a WR or HB. Also they really need to add defense!!!!\n\nHelpful | 0", "BWhite77Mar 29 at 10:45 AM\nPretty solid\n\nThe gameplay is fantastic and feels very real even though the graphics are arcade like. I wish the playbook was a little easier to see like a playbook on your wrist(a la a true QB) and be able to see the plays and adjustments easier.\n\nHelpful | 1", "Mr.cake25Jun 21 at 11:53 AM\nFake\n\nIt teaches you to use horrible techniques and is total f#cking bull s#it\n\nHelpful | 0\nDeveloper ResponseJul 8 at 9:28 AM\n\nTo be fair, this isn't really positioned as a training tool, Mr.cake25. The goal here is a fun arcade experience. That said, Sorry you didn't dig it.", "Zapp_Brannigan1Apr 29 at 5:42 PM\nAwesome.. but..\n\nI wish there was more to it. Get in real situations where the game is simulated between your offense tries, make a career mode etc. So much potential\n\nHelpful | 1", "znanneyMar 14 at 6:58 PM\nGreat pickup game!\n\nI absolutely love this first person view playing QB. The passing is so accurate and natural feeling. The ability to customize plays and jerseys is a nice touch. This is such a great proof of concept, I'd love to see a full football game on the Quest, this absolutely needs to happen, and these developers need to be behind it. If you are remotely interested in American football this game is a must have.\n\nHelpful | 2", "King_Kanu25Apr 13 at 2:01 PM\nLove it!\n\nFirst review I e ever done and been meaning to for a while. Massively underrated in my opinion. I cant stop playing it and wish there were more sports games like this. It does crash sometimes but 100% worth a purchase if you like sports games! Hopefully get some more soon!\n\nWorth adding, dont listen to negative reviews as Ive had my quest for nearly a year now and play this the most. Im from the UK so never played football but this feels pretty real. Hopefully some updates soon!\n\nHelpful | 1", "jimbizzyboyfoxybizzMay 15 at 11:17 AM\nFootball \n\nThis game is pretty cool not to slow to keep it at a fun pace\n\nHelpful | 0", "TheDiamondSportJul 27 at 4:13 PM\nBest football game on the quest\n\nHonestly they should add to where you can do different positions, that would be way more fun. But overall good game\n\nHelpful | 0", "That_Band_NerdMar 24 at 6:53 PM\nMaybe new roles?\n\nI love this game and its been absolutely amazing and the mechanics of it are just awesome! Its great for long gameplay.... or even short as well. Maybe to possibly expand the horizons a little more we could add a wide receiver role... or maybe even be on defense and be able to play the line as well. But that is nothing but a suggestion. In all great gameplay and a great time!\n\nHelpful | 1", "RollTideTurnerMar 31 at 2:07 PM\nFun fun fun\n\nBought this game with very little expectations since it isn't a full game. BUT the 2 minute drill type game is lots of fun. You are down by different scores and try to make a come back in the closing minutes. Could it be better sure, but for what it is I am not disappointed at all.\n\nHelpful | 1", "chase.overmireMar 7 at 6:56 PM\nExpand on this!\n\nSo much YES about this game. It's a FUN game. It's simple but it does it oh so well. I'd love to see this expanded, seasons, stats, etc. Easily one of my fav VR games to date. It feels good to throw the ball but it doesn't end there. You can block, and even juke the CPU if you have solid control.\n\nHelpful | 1", "Tucker2020Apr 9 at 6:17 PM\nWould be cool...\n\nIf the add a campaign and/or humanoid players it would be 100% better , instead of a one and done !! Also, saving more than one play....\n\nHelpful | 1", "freddiebaruchJun 12 at 10:54 AM\nGreat potential\n\nThis game is already very good, if they put work in for a big update and change a few things this will be one of the best games on the quest. One thing I find really irritating is that the other players on your team are just dummies, it looks bad and Ive been playing almost perfect passes which have been a few inches away from the dummy, if they used humans they could reach out and get it. Also Im not a huge fan of the structure where you just keep playing a knock out tournament where you could get really far and just one misplaced pass could send you back to the start. I think they should make something similar to a career mode where you play for a team in a league table and play every game which would be about 8-10 mins per game. Overall I would recommend this game for the price but I just beg that the developers improve this as it has such potential.\n\nHelpful | 0", "brenden200412 days ago\nAmazing game\n\nI can tell work has been put in on this game keep up the great work.\n\nHelpful | 0", "phillyg2020Mar 19 at 2:18 PM\nFun Fun Fun\n\nIt's alot of fun, and drawing my own plays makes it even more interesting! I beat the game today and had a great time trying out all my own routes. I ended up leaning on 1 play that I had many options and if no one was open, I could pick up at least 5 yards and a QB run!!! Yes there is a problem of tracking when I try and throw over my head, but keeping the ball in front helps alot! Great job devs!!!\n\nHelpful | 1", "cmay555Apr 4 at 11:45 PM\n2MD Football\n\nVery fun game , I don't know what I thought when I started playing but I've racked a bunch of hours playing. For the price it's great and again Im entertained over and over. Add the Dallas cheerleaders , just a thought.\n\nHelpful | 1", "sergedmdJan 10 at 5:24 PM\nI love it!! Needs one improvement\n\nEverything is great. Could not stop until my headset died. I would like to ask to add a save point. I got to round 5 and my head set battery died had to start from round one again . If possible can the devs add a save point so lets say if you get to round 6... you can quit and start up where you left. Thanks\n\nHelpful | 14", "YungJackieChanJul 14 at 12:16 AM\nCool game\n\nCool game to throw things in for a few minutes just to get your legs under you before you jump into a much more in depth experience\n\nHelpful | 0", "XxDarkexX10 days ago\nNot fun and the macanics aren't good\n\nThe Nov in your team don't know how to catch or gaurd, the other team is overpowered, and they are faster than you, the only training there is, is throwing training smh would NOT recommend\n\nHelpful | 0", "ZeroCool28Apr 2 at 10:52 PM\nReally fun with a lot of potential just.\n\nIts a super fun game, but if you lose thats it start again and hope you dont lose, and after the newness wears off often dont want to play again after a loss. Here are some suggestions.\n\n- League Play\n- Ability to play defense would be fun\n- Full game with other players\n- If you get so many points on the bonus after a win then you should be able to earn an extra life.\n- More things to do in the practice mode like a skills challenge.\n\nHelpful | 0", "CannarWilmFeb 14 at 6:42 PM\nNot a touchdown but a solid field goal.\n\nI don't care that much about fancy graphics if the game play is great. And the game play here is great if it takes a little getting used to. Firstly, it takes a little time to work out how to throw the ball. But once you've got it, it comes as second nature.\n\nHow could the game be better?\n\nChoose which level to play against - having to play the easy teams each time is annoying. I'd like to jump straight in with a challenge.\n\nBetter practice options - if like a was l way to practice the plays so I can home them better.\n\nMore modes of play - Enable me to play a timed game somehow.\n\nHelpful | 2", "KaidenKramerMar 30 at 11:13 AM\nLove the game!!\n\nThis is overall a great game and very interactive but I wish it was a two player game, also I wish that you could run the ball more realistically\n\nHelpful | 1", "MasterDyneFeb 28 at 3:42 PM\nHate giving four stars!\n\nLet me say first, the only reason this is given four stars is because of the the throwing glitches. Even still, this is an amazing game!! Definitely worth the purchase. Got to make the throwing more accurate but how!? Its really tough but I will say this game is worth it but I cant give it 5 stars because its just not perfect.\n\nHelpful | 1", "BigB33fApr 26 at 10:45 PM\nFun!\n\nSo much fun. Cant get past when Im down two scores. Will have to practice more\n\nHelpful | 1", "wberryman1975Apr 19 at 2:10 PM\nHas potential\n\nRoom for improvement. Add full game mode, run plays, qb sneak. Mascots realistic crowds, college team logos, ... still cool.\n\nHelpful | 2\nDeveloper ResponseApr 21 at 7:28 AM\n\nHey there. glad to see you feel the game has potential! you can already make run plays, and you can already QB sneak (theres even an achievement for it!). there is also already a mascot on the sideline. You get an achievement for hitting them with the ball :) as far as adding stuff: well, keep in mind that game development takes resources, and takes money. Adding all those things would be a much larger cost, and we are but a small, three person indie team. 2MD is first and foremost and arcade game: an experience focused on a very specific gameplay loop. We would love to make a much bigger game incorporating a fully realized football experience, so for now we can only hope we see enough success with this humble arcade game, as that would be the way to make that happen.", "TK-here-to-playApr 18 at 5:35 PM\nJust a fun time!!\n\nSimply a fun game where you feel the highs of winning and the lows of running out of time at 4 th and goal on the one! !!\n\nHelpful | 1", "sundrytimesMar 28 at 9:14 PM\nImmediately became my favorite game!\n\nIf you are a football fan or fancy yourself an athlete, this game is a dream come true. I turned it on to give it a try and didnt want to put it down. The perfect game for arm chair quarterbacks. Design your plays and take them to the field.\n\nHelpful | 1", "andybutler99Mar 12 at 10:50 AM\nThis is ace\n\nIm not a massive fan of American football, but I understand the rules...which helps...but anyway this game is really great...the throwing mechanics work really well...and when you get it right its so satisfying...I think its got real replay appeal as well as ever play is slightly different leaving you to work out how to score. If I have one Criticism it would be that you should be able to swap to the middle finger button from the trigger button ...it would feel better I think...but I cant recommend this game enough...and I look forward to the future when things get even better.\n\nHelpful | 1", "SoulcuneJan 9 at 4:55 PM\nFun missing something.\n\n2MD VR Football is a very addicting game with fun arcadey gameplay! But that is basically all this is! There is no season, its just create plays and throw the football.\nIf this may be all youre wanting than this game is worth it fully! But, if youre like me and would like to do more than maybe pass until future update. Now I will state something that Im my opinion would improve the game!\n\nBEING ABLE TO PLAY DEFENSE - I think that defense is almost as important as offense, and intercepting a pass or sacking the QB would be awesome!\n\nSEASON MODE - I believe that the arcade mode of the game is fun but I want to be able to be at 1 minute left and whoever wins goes to the playoffs! Just a season mode would be awesome!\n\nIMPROVE THROWING BUGS - Now this doesnt happen a lot to me but man is it annoying when it happens. Of course Im talking about when you throw the football and for some reason the football either goes the other way or just chucks the football at the ground! Please fix this as it is very irritating!\n\nFULL GAMES - Full games would be awesome! Instead of just 2 minutes left fourth quarter, it should be 4 quarters, 2 minutes each quarter. The opponents points would progress during the game, but this is when my DEFENSE request would be in play.\n\nThose prompts are what I think would improve the game, so if the developers see this, please consider because this could be way more then just a arcade game!\n\nHelpful | 39\nDeveloper ResponseJan 9 at 6:50 PM\n\nHi Soulcune, Thanks for the feedback - We definitely would love to be able to add alot of the features you mentioned, though it's probably important to stress that 2MD was always designed as a quick, pick-up-and-play arcade game, so keeping that focus helped us maximize the accuracy of the mechanics (and by extension, the fun). We wanted to stick to creating the best performing experience with the processing power available. With regards to the throwing issue you've had - we've found the only thing you need to really avoid doing is holding your hand behind your head too long for a pass. This is the only time the headset can lose track of the exact position of the controller (we've got a custom motion tracking setup that allows you to have truly accurate throws in the game, so that data is very important). I've found that so long as your wind up isn't more than under a second, your passes should be true pretty much every time. Again, thanks for your feedback, and I hope you have fun with our little game!", "Warriorrex3523 days ago\nIt is really goid\n\nGreat game\n\nHelpful | 0", "Alex808levonApr 19 at 1:08 AM\n\nThis game is fun but has many bugs with throwing the ball. Many times I try throw it deep and it goes straight down.\n\nHelpful | 2\nDeveloper ResponseApr 19 at 3:28 AM\n\nHi Alex, if youre experiencing this issue its not a bug with the game, most likely your controllers are losing tracking. the culprit is either low batteries, or youre possibly holding them out of view of (behind) your headset for too long prior to or during your throw. So long as you avoid that, your throws will be true every time. Take care.", "cam.fos.1Feb 20 at 11:24 AM\nReally Nicely Built\n\nVery good first fball ve game. Be a QB write up plays. Would be good if developer introduced a snapping mode. Where the center snaps the ball and you have to catch it in order to properly play the snap. Would be also a very good development to change the stick characters with real and actual football like players. Overall a great game and fun to play\n\nHelpful | 2", "VengeVegaMar 26 at 8:10 PM\nCrashes\n\nI really enjoy the game and play it on a regular basis but it does crash sometimes. I'd say about a third of the time the screen freezes up and when I move my head the whole screen moves. Once I go out to the home screen and go back it restarts. I had this problem in the past when it first came out and I thought it went away(after reboot) but that is not the case. It's been a few months now so a patch would be nice.\n\nHelpful | 0\nDeveloper ResponseMar 27 at 3:43 PM\n\nHey VengeVega. I'm sorry to see you're running into that issue. I wouldn't wait for a patch, as this is not a bug we identified during development, QA, or in the last 2+ months so far since launch -- As some devs will tell you, the testing process for Oculus Quest games is extremely rigorous, and errors such as the kind you're seeing at the frequency you're seeing (1/3rd the time) definitely would've popped up and the game would not have passed muster. I've pulled up the error analytics, and we've had 0 overheat failures, so that's not the likely culprit. If you're experiencing intermittent freezes + crashes, though, my first suspicion would be a corrupted install. I'd delete the game, redownload it, then do a full reboot of the headset. Also ensure your oculus software is up to date. If the issue starts to happen again, try to determine if there is any sequence of events that you're doing that we could try to reproduce on our end to identify the problem, and drop us a line on twitter @truantpixel or over email at contact(at)truantpixel.com. Looking at it another way, the fact that it resolved for a while after a reboot of the headset leads me to believe it may actually be an issue either with the Quest itself (which I'd only expect if other games were exhibiting similar issues) or some other piece of system software, since nothing the game is doing would persist in memory after you close the software. Good luck, and please let us know if that works!", "VRSantaFeb 8 at 9:28 AM\nFun\n\nThis is a fun game, I do wish there was more in variety, but that being said, it hard not to like being the quarterback with 2 minutes on the clock to win the game. I go back to it over and over again, so it is fun without a doubt. But I will not complain if they update with new content down the line.\n\nHelpful | 2", "ryanscookApr 10 at 8:16 PM\nPractice mode great game mode unplayable\n\nPlayed the practice mode and even drew up a couple of plays and could get like 30 in a row right through the target, went to the game mode and it would not throw the ball at all, it was right at my feet, or would go maybe 5 yards completely inaccurate, one of the most frustrating experiences I've ever had in VR really hope I can get my money back, I kept trying and adjusting settings and my throwing motions for a while but never could get to work.\n\nHelpful | 1\nDeveloper ResponseApr 11 at 8:23 PM\n\nHey, sorry to see you had issues, but thats definitely not a known bug in the game. Oculus QA is incredibly rigorous, and such game breaking errors would have prevented release. Most likely you have a corrupted download, so you need to delete, reinstall, and reboot your Quest.", "lj.proctor2May 4 at 8:59 PM\nI love it its alot of fun\n\nLove it\n\nHelpful | 1", "antelo493Feb 18 at 4:59 AM\nVery fun yet glitchy\n\nIm a huge football fan and let me tell you, this game makes you feel like a pro QB. The game is a blast, the only reason as to why I do not give it 5 stars is due to the fact that every time Im about to beat the round I can never pass, the game crashes which results in me having to close the game and start all over again from the beginning which is very annoying. If that were to be fixed, it would be amazing!! Still highly recommend for football fans.\n\nHelpful | 1\nDeveloper ResponseFeb 20 at 9:15 AM\n\nHey antelo493! sorry to hear about the issues you seem to be having. This is not a known glitch / bug in the software (we ironed all of those out weeks before sending the game off for approval), so its likely your download is corrupted. I recommend deleting and reinstalling the game. I also recommend making sure your quest firmware is up to date, and fully restarting it for good measure. reach out to us on twitter @truantpixel if these do not resolve the issue.", "imdippyfreshMar 24 at 11:52 AM\nSpectacular\n\nI love the game, I definitely recommend this. The only thing is I wish there were other positions you could play like wide receiver or be a linebacker. Otherwise it is so fun but gets difficult around round 5.\n\nHelpful | 0", "StoltzbroMar 4 at 12:02 AM\nWow. Really wow\n\nWhen I bought this game, I had my doubts. But for $15 I was only expecting a retro bowl type game... I got way more. This game is difficult, I've never been to the championship and my highscore is ranked #215 in the world. Ive been playing for 4 days straight, one of my broadcast videos got 115 views today (robertstoltz.com), my arms g9ne from being crappy to its former high school pitching days. 10/10 stars!!!\n\nHelpful | 1", "TheShort0neMar 4 at 4:47 PM\nGreat except for one part\n\nI would like to be able to play as a rb or wr. Maybe if possible add multiplayer. Other than that, great game.\n\nHelpful | 3", "samacornApr 1 at 9:45 PM\nVery amazing\n\nI missed playing football because of the quarantine and loved this game, but as requested from others, it would be nice to be able to play as each position\n\nHelpful | 1", "TheAtomicStoneFeb 17 at 7:16 PM\nReally fun, albeit limited, game.\n\nFirst off, let me just say Ive spent thousands of hours on 2D football games over the years. Until now, Ive always been a 3rd party operating in a coach like God mode. In this game you ARE the QB! Its an amazing feeling, and a very fun experience.\n\nNow for the limitations:\n\nYou are always on offense\nGames are two minute drills\nYou cant hand-off or shuttle pass\nYou cant move in the pocket, or run the ball\n\nYou CAN come up with your own pass plays, and that is pretty fun. Definitely worth the price!\n\nHelpful | 0\nDeveloper ResponseFeb 17 at 7:34 PM\n\nHi TheAtomicStone. Firstly, thanks for the kind words! We did want to clarify a couple of things - you absolutely can hand-off or shuttle/shovel-pass, you'll have to draw up a play that brings your runningback or receiver close enough to do so. To hand off, all you have to do is reach out with the ball as they are running by--when they make contact, you can let go and they'll take off (One of the default plays does this, and we included some examples in the trailer too). Also, you actually can move in the pocket, simply use the analogue sticks (the very same ones you used before the snap to select your play) to run in any direction AFTER you've snapped the ball. You can run the ball yourself, however it is more difficult than passing so you really have to set up the opportunity (again, with a carefully crafted play to ensure you have an opening so you won't get tagged)! It's really meant for those 4th and goal moments when you're just a few steps away from a touch down, but its actually possible to get more than 10 yards or so if the defenders are occupied.", "VOROKUSFeb 17 at 7:51 PM\nReally addicting but may get tiring.\n\nThe game is actually extremely fun. You create strategies to help get your team to score a touchdown and win the game. There is one problem, however, you might get tired. The game is a workout but what I mean is that it can get boring because its a game in which you want to get the high score. Its the same thing over and over but when you create new plays makes the game very interesting.\n\nHelpful | 0", "thomas.hauryJan 23 at 10:54 PM\nBest vr game so far\n\nThis game is so fun. I have bought all the big titles and I like this game the most. I will admit that I love football so I might be biased. Obviously this game could be way better if it was multiplayer and if it looked better and a lot of things... but still it is so fun i love playing it. This guy did so much with so little and I think thats what vr is all about. There are so many games that look great and are just a big yawn. This games throwing mechanics are that perfect mix of works great and is super challenging. Great job guys you made something awesome please make an online multiplayer and I would love you guys so much. Thank you again awesome job :)\n\nHelpful | 6\nDeveloper ResponseJan 25 at 3:28 PM\n\nHi thomas.haury. Thanks so much for the kind words - we actually read every review and it's really great to see someone having a good time with something we worked on and worried over for so long!", "EC4Mar 10 at 4:19 PM\nGreat simple game\n\nSo very simple. Draw plays, (as QB) run said plays in 2 minute drill, Do a passing through hoops bonus round. But its really fun and shows the capability of growing this into better and better football and sports games in general. Great party type game IMO\n\nHelpful | 1", "fabian.bailesFeb 28 at 3:46 PM\nOne of the best vr games I have played!\n\nIf you are a big football fan like me you will fall in love with this game and yea you only get two minutes but it is plenty enough time to get a Touchdown so if you are looking for a game to buy and you like football then this is your game and if you get bored from the same thing every game then you can switch the plays by moving your team mates so great job developers\n\nHelpful | 1", "NateKelly107Feb 27 at 1:48 PM\nAddicted\n\nThis game is my favorite by far of many on my device. I have beat the game, but find myself turning it on to play some more. The throwing dynamic is top notch, ball goes exactly where you think it will go. Must buy if you're into sports!\n\nHelpful | 2", "MaynardthecatFeb 11 at 1:24 AM\nfun but with a caveat\n\nLots of fun but if you want to compete for a top spot on the leader board the hoop mini game ruins it. Once you beat every team there isn't anything to do but compete for the high score which is fine but you have to suffer through an awful mini game where you throw a football through hoops to add to your score. After every single match this mini game occurs. You can skip it but you aren't going to have a competitive score by the time the game is over. On many occasions you are going to spend more time playing the mini game then playing the actual football portion of the game during the first few rounds. Its a timed mini game so you have to go as fast as you can and since this mini game occurs after every single round its going to hurt your arm/wirst. Also, the ai acts weird sometimes when you are throwing the ball to one of the players. Sometimes your player will slow to a crawl after you throw the ball and other times they will turn in to sonic and salvage a bad pass. They also get away with some insane pass interference. Despite these issues the game is still a lot of fun and if you don't care about competing for a highscore you can skip the hoop mini game and just stick with the football portion.\n\nHelpful | 2", "6aboutMar 23 at 8:22 AM\neasy but fun\n\ni love the game but i wish when you throw the ball you switch to the reciever and you have to catch it\n\nHelpful | 0", "Blitz_kriegFeb 4 at 4:57 PM\nArcade Masterpiece\n\nI walked into this game with low expectations and came out surprised at how much fun I could have with such a basic game.\nWhen I first played I was thinking of refunding it, but then I started playing more and more and just had an absolute blast.\n\nI absolutely love football and this game is perfect for it. The perfect price.\n\nISSUES\nMy only issues would be that it is to basic there should be more maps.\nAnother thing is they should let you play other positions other than quarterback.\n\nOther than that it is a really good VR title. If you got some money sitting around and are looking for hours of fun, this is the game for you.\n\nHelpful | 4", "aaron.sommers.1253Jul 11 at 8:43 PM\n2MD Football \n\nGreat game,a lot of fun to play.\n\nHelpful | 0", "gbanningerApr 3 at 1:14 PM\nAwesome\n\nThis game is so cool. I feel like a QB playing it. Not sure why there is a lack of sports games available\n\nHelpful | 1", "evan.simonsApr 1 at 3:00 PM\nA blast for $15\n\nExtremely immersive arcade style football experience. Just wish the throwing mechanics were tuned slightly better.\n\nHelpful | 1", "jewwy5Feb 19 at 12:24 PM\nGood Fun\n\nWasnt sure about this game with how it looked at first but its a lot of fun. There are some frustrating parts to it but they are overcome by the feeling of being on the field. The throwing motion isnt perfect but you can adjust it as best you can. My biggest issue is that its really, really hard to throw the deep ball. The players dont have hands so you have to physically hit the receiver for the catch to be made. There have been a decent amount of throws that could have easily been caught if they had arms which can be frustrating in the moment but also keeps you coming back for more. Overall, lots of fun but you really do have to be pinpoint accurate.\n\nHelpful | 2", "NoahT343524 days ago\nIt will only get better\n\nI enjoy this football be game..You feel emerge in it..I see where it is going.\n\nHelpful | 0", "sbskoonJan 18 at 9:13 AM\nWell worth the price, could be better\n\nFirst of, this game is great! The physics feel really tight, and Im glad you guys nailed that because in a sports game, that is most important. I am a huge football fan, and Ive been waiting for a game like Th is for a long time. This game is well worth the price, and is really fun! My arm is super sore but it was worth the pain haha!\n\nThis game could be a lot better though. For starters, it feels very limited in the gameplay. You draw your plays, Throw the ball, rinse and repeat. While this is a fun time, it isnt always super engaging when you star to think about how much more you wish you could do. One glaring issue I seem to have is that I get no production on running plays. The defense seems to swallow up the running back, and I think the running Back needs more speed. It seems like everyone is set at the same speed, when that doesnt make sense in a football game.\n\nBelow is a list of things I think would be great additions to the game!\n\n1. Sprint button with stamina bar for QB sneaks, so you can run quicker for a short amount of time to evade blockers\n\n2. Stiff arm, spins, jukes, etc. maybe when youre in a large enough play area, you can actually do this motions (spinning, juking, stick out arm for stiff arm) and the game will register that and let you break some tackles while running upfield\n\n3. Teleport to receiver mode: when you complete a pass, maybe it would be cool if like in madden games you take control of the receiver upon catching the ball, then you can be in control of how he runs the route after the catch. This paired with a sprint button, and the moves I laid out in no. 2., would be a really fun gameplay addition\n\n4. Defense mode: this would be a long shot but might be worth looking into, basically you get to be a corner back, you follow the receiver, when the ball gets to you you raise your hands up and press the trigger at the right time to intercept the ball. Just a thought I had, this may not work that well in VR\n\n5. Mini-Game mode: basically it is a smaller team, five on five maybe, one linebacker, two receivers, a tight end and a running back, then mirror that for the defense. Its a faster paced, big play mode similar to NBA jam/NFL blitz where its hectic, crazy, the ball gets lit on fire, you can truck people and flip them, etc. think NFL Blitz\n\nHelpful | 10", "Slingginfatties7Apr 4 at 1:50 PM\nFavorite Game So Far\n\nWhat an amazing game. You guys did such a good job. My favorite game on the VR platforms!\n\nHelpful | 1", "hellalyfeFeb 6 at 6:19 PM\n4 star game\n\nFor the detail oriented fans of football; you might not like the mechanics but nevertheless, this is still a solid game. Drawing up the plays is easy and fun, almost as fun as watching the dummies run the routes you drew up and the satisfaction of completing a pass that goes for big chunks of yards is awesome. I recommend playing a while in the practice mode before drawing up any plays or doing any real games, getting a feel for release timing and power in your throws is key and you can adjust those elements in the practice mode. All in all I enjoy the title.\n\nHelpful | 0", "ScottandEmmaMar 11 at 9:18 PM\n\nPlay this more than any game on the Quest. Love it so much. Wish there were upgrades you could make (make QB faster), wish there was NFL licensing, I'm not nitpicking. Awesome arcade game. Dream come true\n\nHelpful | 1", "Daktari.Peace.2Feb 18 at 6:43 PM\nGreat! Can't wait for the next version\n\nI would love to play a full season with football statistics. Also, I would love to earn points to edit my roster. This is a fun game and should evolve substantially in the future and I am looking forward to it! Lots of fun!! Great exercise too. The following game features will take this game to the next level: different game modes, better graphics, human bodies, full season options, roster management, stadium selection, juke moves, play defense as a safety, etc...\n\nHelpful | 1", "DrewsterEllisFeb 17 at 3:15 PM\nTwo minute drill at its finest\n\nThe game is simple yet great! If you like football youll definitely love this title. Youre allowed to draw up to 8 plays for yourself including passes and even handoffs if youd like. There are 8 rounds as if youre in a playoff bracket. If you lose, you restart. The throwing mechanics are surprisingly good especially after getting used to them.\n\nOverall a fantastic experience!! 10/10 would recommend\n\nHelpful | 1", "liam.kammermanJul 11 at 11:12 AM\nBest FootBall VR game I have ever played\n\nThe reason is because not many football be games exist so this is one of a kind\n\nHelpful | 0", "Luke-and-noah-0416Apr 17 at 5:33 PM\nGucci\n\nThis was a Gucci app\n\nHelpful | 1", "gabriel.aragon.023Feb 2 at 10:41 AM\n4th level\n\nOn the fourth level I've noticed tracking becomes glitchty when attempting the long bomb. Other than that, good times. The end around works. It takes maybe one round to understand handoff technique VS. A. I.\nI recommend for this a kid/fam game when it's last call, and you refuse to play a shooting game.\n\nHelpful | 0\nDeveloper ResponseFeb 2 at 11:24 AM\n\nHi Gabriel. Thanks for the kind words! regarding the 4th round, That seems to be a unique issue, the only difference in the 4th round is the AI difficulty. Reach out to us at contact(at)truantpixel or @truantpixel and we'll help troubleshoot. also, always recommend checking controller battery level, especially after a long session :)", "yannidendrinosJan 31 at 6:21 PM\nWow, surprisingly great.\n\nthis is a great game with easy and fun throwing mechanics. a few things they could improve (especially different game modes [a game mode where you can play a full 4 quarter game?], ability to have more than eight plays, practice with the moveable players). but a very addicting and fun game!\n\nHelpful | 1", "westonw7Feb 11 at 1:45 PM\nGreat game\n\nI didnt know what to expect when I got this but I was surprised. The mechanics and gameplay are superb. I would like to give my suggestions to make this a better game. First, I actually like to play this game sitting down. I basically have to because otherwise Im too tall and my hand hits stuff. It would be cool if there was a built in short mode to make it more accessible for people, although the game already functions well that way anyhow. Next, as others have stated it would be amazing if you could play multiple positions and full games. Or a season mode, with more customizable teams. Lastly, the running mechanics could be better. It seems like youre always slower than the defenders, and handoffs are impossible. Having a solid running option would be sweet.\n\nOverall, solid game that is easily worth the price. One of the best games Ive seen on quest so far. Thank you devs!\n\nHelpful | 2", "highwayonemanMar 1 at 10:02 PM\nSo good!\n\nGreat game. Super fun, very addictive. I do agree with some other comments that the lack of hands is frustrating - a lot of throws that felt like they should be catches arent. But kudos, super fun!\n\nHelpful | 1", "shadow7209Feb 4 at 1:56 PM\nBetter than PSVR\n\nI owned it on psvr and Oculus is miles better, being able to move and run easily is great, only thing i could ask for is seeing if its possible to allow you to stiff arm defenders while running? And maybe add a quick match type that just chooses random teams to play a round against\n\nHelpful | 6", "andyhoffmann1975Mar 25 at 10:21 AM\n2 MD Football\n\nGreat game. Lots of fun and pretty challenging. Puts you right in the quarterbacks helmet.\n\nHelpful | 1", "PapaBurgundy35May 21 at 12:30 PM\nLove this game! Hoping for more!\n\nThis is my third time buying this game - first time was for PSVR (its the only game Ive gotten platinum on), second time was on Steam so I could try the new version (Evolution) using the Steam Link on my Quest, and now I bought it in the Quest store so I can take it wherever wirelessly. Lots of fun, especially when you design a play that takes you to the championship!\n\nHelpful | 0", "Husker1224Jan 25 at 7:20 PM\nVery fun, but only can get so far\n\nIf you like football, college or NFL, you will enjoy this game. Very fun and realistic despite it being more cartoonish. I actually feel like a qb. The only draw back I have is the time limit and difficulty spike in the game. The best I can do is 4th place on a good run. I wish as you progress and have to score multiple touchdowns to win, your time limit also increased, as you must be extremely lucky to score 2 touchdowns in less than 2 minutes, especially when the opposing team is more likely to pick the ball off. Honestly that is my only gripe, is that I cant do better than 4th and go to championship. Hopefully an update can adjust.\n\nHelpful | 1\nDeveloper ResponseJan 25 at 9:15 PM\n\nHi Husker1224! First of all glad to know you like the game! We agree the difficulty definitely ramps up around the 4th round - the key is, you can't win via passing alone, and the AI (especially round 4 and 5) will get incredibly good at grabbing those lobs out of the air, and that's all by design (the difficulty balance is actually taken from previous versions of the game, so we've had time to perfect it). The key is the whiteboard: You want to change up your strategy in order to outsmart the AI and get that championship ring (Yep, there IS a championship ring that you earn for beating the final round ). We've even seen some folks figure out ways to beat round 7 by running the ball (which ain't easy). So remember, the key to the championship isn't a strong arm, it's a skilled...uh...marker...hand...:D. Good luck!", "supersam84Mar 10 at 1:25 PM\nSimple and fun.\n\nSpend a good amount of time learning to throw the ball. Otherwise it can be frustrating at first. Very fun. Exciting to play. Hard to get bored of this game.\n\nHelpful | 1", "sean.carrillo19Jan 9 at 6:41 PM\nGreat Game - but takes getting used to\n\nI LOVE this game. Huge fan of the old online 2MD games so this was an automatic buy. Its so much fun to play and very easy to understand. The only thing I would say is that throwing takes getting used to in the sense of the button used to grab. Normally in the games I play the grab button is the middle button on the controller. This game has you grab using the trigger button. Its not a huge deal but it takes patience if you are really used to other layouts. A setting to change this would be cool.\n\nHelpful | 16", "MnPePeApr 9 at 12:30 AM\nIts honestly good but sometimes isnt\n\nThe space is kinda an issue and the little side effects are sometimes a mess up\n\nHelpful | 0", "BeerAndRamenApr 3 at 8:40 AM\nAs a former footballer\n\nI really enjoy playing this game!\n\nHelpful | 1", "onabat75Feb 5 at 9:41 PM\nLove it\n\nHuge football fan and love the game. But sometimes the ball releases late and the ball will either get spiked or go backwards,it would be a nice feature that if the ball is a little bit away from the player above or next to them that they jump/dive\n\nHelpful | 0", "TrevorkianFeb 29 at 11:34 PM\nThis is a 2 minute drill\n\nI love this game I have it for Steam and for the Oculus it's not a football game it's a 2-minute drill the physics are fairly accurate brings me a lot of pleasure that's why I bought it twice\n\nHelpful | 1", "dgoBitesJun 19 at 8:22 PM\nGreat game\n\nMy one wish is that I can change the throw button to the grip button, instead of the trigger. But overall this game is fantastic. Love the simplicity of it.\n\nEdit: Will the quest get the Evolution update? Love the game!\n\nHelpful | 4\nDeveloper ResponseJan 9 at 8:00 PM\n\nHi DGO_Bot Believe it or not we wrestled with this question a few times, as the grip button is usually used for holding things in VR. At the end of the day, we had to opt for the trigger, because it became too easy to actually throw your controller if you were releasing the grip button at the end of a powerful throw - which was potentially dangerous and damaging, even if you're wearing the wrist strap, and we definitely didn't want to risk a safety issue. That said, thank you for the kind review, and we hope you continue to enjoy the game!", "WittyB14Jun 9 at 9:27 PM\nOne of the Quests best games\n\nThis game is absolutely phenomenal. The mechanics are simple and throwing (or running for) a touchdown is extremely satisfying. This is my go-to for introducing my sporty friends to VR and it gets great reactions every time.\n\nHelpful | 0", "GotPalmerJan 17 at 11:30 AM\nFOOOOOTBALLL IS HERE!\n\nFirst of all, I am hardcore football fan! I was so thrilled to hear that football is coming on VR! This game is impressive - i never thought I really feel realistic with throwing mechanics, YES - you have to be careful with throwing behind your head because the sensors are on front of the headset but its not the big problem... Only issue I ran with.. ROUTES RUNNING... not all receivers running right / polished routes which costed me a throw. lol cant be perfect but could polish them up a little bit with their route runnings. Be sure that they all follow their routes.\n\nand any chances we can have real legs instead \"sled legs\" - bothering me a little bit.\n\nHelpful | 2", "bretto97Mar 8 at 8:45 PM\nA surprizing hit\n\nI wasn't expecting much from this title but it is actually really fun. I'm a Browns fan. I feel like I am Baker Mayfield!\n\nHelpful | 1", "mr57wrightFeb 6 at 8:36 PM\nAwesome baaic football game\n\nThis game is really fun if you like football! I think that it will only get better if the developers add longer modes and better AI. Id love to be able to play a full game instead of only the last 2 minutes. Id also like to be able to play on the defensive side in some way.\n\nHelpful | 3", "K1ngVSJan 28 at 5:36 PM\nOh man what a game\n\nThis game is so much fun, I would say its the best VR sports game thus far did quest. Cant just play one game, I end up playing for hours.. would like to see the possibility to modify routes during the game and to add motion...\n\nHelpful | 2", "peter_garciaMar 27 at 6:37 AM\nGet it\n\nUnderrated.... get it now\n\nHelpful | 1", "pgc77Feb 20 at 10:45 AM\nPlay it every morning!\n\nI am a huge football fan. Until they release a full on football game with realistic players this is as close to the real deal as its going to get. I love this game even though it is simple. It is especially fun when you can run around in a large space. I take it with me to the gym. The only issue I have is with the tracking when you move your arm back. It loses the ball most of the time so I have to modify my throwing position and mechanics in order to have it work by always keeping my arm in front of me. If they could fix this issue I would give it 5 stars.\n*Update : Maybe I am just throwing faster, but my issue seems to be fixed. This is the one game I playe every day. Love it!\n\nHelpful | 2\nDeveloper ResponseJan 28 at 10:38 AM\n\nHi pgc77! Firstly thanks for the kind words. It's actually pretty cool to hear someone taking it to a large space to play, that's something we had a lot of fun testing on our end too. You can even do jump-passes and jukes if you have enough space and you've made sure it's completely clear of people and obstacles. With regards to your throws, you CAN reach your arm behind you when you throw, the important thing to remember is you can't keep it out of view of the headset for more than a second because the Quest will lose accurate positional tracking -- it's not really an issue with the game, per se, more a limitation of the current inside-out tracking implementation the HMD uses, so it's not something we can really fix. But, if you don't keep your hand out of sight before initiating your throw, then make sure you're not holding it back before actually swinging your arm, you should be set!", "WakkinatorJan 15 at 10:25 AM\nProbably one of my favorite experiences\n\nThis game has what Ive been wanting from VR for a while now. Theres not nearly enough sports games out for Quest currently, and this is definitely a trailblazer for more sports games to come. Although its simple, its challenging and very fun. My only complaint at this point in the game is handoffs/running with the QB. I understand that it could be too easy if you could run with the QB every time, but giving a little more speed would make it a lot better. Ive been trying to run read options and I think the game would be a lot more fluent if handoffs to running backs actually gained some yards and if you could keep the ball yourself and at least gain some yards running around the line. I cant wait for updates, totally worth the purchase!!\n\nHelpful | 1", "jcarvara11Mar 2 at 5:19 PM\nDefinitely worth the money loads of fun\n\nSimple and tons of fun worth the buy. The whole fam can enjoy it. Throwing mechanics make this game great and writing up your own routes.\n\nHelpful | 1", "Dmengel40Jan 13 at 5:40 AM\nOmaha!\n\nThis is so fun and so well priced! If you love football this is the game to get. Being able to design plays is such an amazing option! Throwing the ball is easier then any other game on the Quest. Really impressed with the IQ of the computer players thats what s brings this to 5 stars. Best purchase for the price on the store!\n\nHelpful | 11", "vrnoxboxJan 29 at 2:18 PM\nAmazing if football fan\n\nEven if your not a football game its still great Ive only played it for a hour and I love it one of the best games ever probably the best on the oculus in my opinion its a little hard at first to get used to trowing but its not that hard if you play for like 30 min and if your a football fan I would get it it would become one of your favorite games\n\nHelpful | 1", "BLZDPraetorianJan 15 at 6:30 PM\nQB Simulator! WE FINNALY MADE IT\n\nYa we finally made it, you create it.\nLook to yo right nobody there look to yo left!\n\nI am not a huge football fan. But i do like strategy games. With this i am able to practice my own plays and dictate the game. I love how you can run it in yourself. And it makes me want a more full version football game. Where its offense AND defense. And throw in multiplayer, whew! That would make this a 5 star title easily!! Its low price and nice mechanics make it a great game tho. I deff suggest getting even if your not a football fan!\n-Cody\n\nHelpful | 3", "The_Ace_8Jan 14 at 6:20 PM\nThrowing motion\n\nI love the game, the concept, and the gameplay, I just think the throwing motion is the only thing that needs improving. I play QB and I wish maybe there was a more advanced motion option and a more basic option. Its just I feel like I let go too soon but I guess its just a learning curve. I dont know, this might just be me.\n\nHelpful | 1\nDeveloper ResponseJan 14 at 7:10 PM\n\nHi ChaseTheAce8. Firstly, thank you for the kind feedback! If there's one thing we've learned, it's that there's probably more than one \"right\" way to throw a football, and certainly different players will have different form based on a number of factors. We recommend hitting the practice field and adjusting the \"release height\" slider, if you haven't tried this already - if you feel like you're releasing too soon, adjusting this will help you find that sweet-spot of maximum release power. There are targets floating in front of you that you can aim at for accuracy, and if you turn around and look behind you, we've placed standing targets downfield to help you work on your distance. Best of luck, and thanks for playing our game!", "Scarletwolf-77Feb 4 at 12:51 PM\nReally fun.\n\nI really enjoy the game. Let's start with that. It's a lot of fun changing the plays and seeing how the teams (mine and others) respond to the changes.\n\nIt appears though that running doesn't increase your score; only passing. While I certainly understand that the primary focus is as a passing game, there are times that when running is the right choice. I've run for a number of first downs or chunks of yards to reduce what I need on the next down. It should score just as a pass would.\n\nUpdated review: I'd like setting which allow a person to adjust the height that they are. I'd like the avatar for the quarterback to run faster. He shouldn't be able to be caught from behind and he should be able to run fast enough to take advantage of blocks the receivers are throwing up ahead.\n\nHelpful | 3", "ZektionJul 9 at 2:39 PM\nSo amazing\n\nLol I thought I was an nfl quarterback.\n\nHelpful | 1\nDeveloper ResponseMar 23 at 5:15 PM\n\nThat's what it's all about! :)", "schuhbox20Jan 16 at 3:42 PM\nGreat game but PLEASE grip button!\n\nGreat game but NEEDS custom button mapping! The fact that I can't release with my grip (middle) finger and instead have to use the trigger (index) is driving me CRAZY!!! If you change that one tiny thing you will have a stellar sports arcade game on your hands. Please for the love of god fix this!!\n\nHelpful | 0\nDeveloper ResponseJan 16 at 4:28 PM\n\nHey schuhbox20, we hear you loud and clear. 2MD has always used a trigger button (on every platform its been released on, in fact) and as we've mentioned it was a conscious decision to stick with that formula, in part for safety reasons (also as mentioned) as well as comfort. We're open to offering the option of custom mapping in the future, however.", "JamieTDangerFeb 11 at 5:12 PM\nGreat Football game\n\nThis is completely like standing on the field and throwing passes or handing off to your running back. You dont get to play defense. Thats my only negative about it. Lots of fun... throw your shoulder out but fun!\n\nHelpful | 2", "Ethanplayer1176Feb 8 at 3:30 PM\nGreat but could be better\n\nAmazing and fun but it would be cool to customize you position there should be defense you should have a better speed you should be able to jump and it is hard to hand off the ball\n\nHelpful | 0", "Capt_Quint620May 9 at 12:15 AM\n4.5/5 not near perfect but sets standard\n\nIt is to arcade-like to get overly attached to your team. Without a season or, at least, bracket tournament, it falls flat on feeling like a competitive football game.\n\nBut...the making your own plays is a lot of fun. And definitely most unique and different mechanic that offers some creativity and room to improve your plays.\n\nSince you aren't forced to stand still or just pass the ball (you can hand it off or run it yourself...or run and pass), it does emulate the QB experience very well. The stadiums are pretty cool, the driving down the field is satisfying...especially watching a player run the ball for 60 yards for a TD.\n\nI got it on sale, but I would venture it being worth its sticker price. It sets the standard for future VR real sports games. Eleven Table Tennis is the other. But still a lot of room for improvement.\n\nHelpful | 0", "ttharrellJan 15 at 12:02 PM\nCrashes every few games?\n\nWould have given this 5 star (by far the most fun Quest game in my opinion), but every 3-5 games, Ill be in the middle of a round and the screen will shake / stutter, freeze, and then force close itself. Not sure if this is game related or if my Oculus Quest is messed up.\n\nAny thoughts from the Devs?\n\nHelpful | 0\nDeveloper ResponseJan 15 at 12:26 PM\n\nHi ttharrell. We actually have very good error data for the last 28 days (which includes QA period and pre-release as well as launch.) thus far we've seen no system reports of crashing (this includes overheating due to the application itself, which is what the system error analytics tracks.). We also never had any hard crashes during testing or QA (this is considered a release-stopping issue, and we frankly wouldn't feel comfortable releasing anything that wasn't 100% stable). One other user reported a similar issue, and it was mitigated by deleting and reinstalling the game, and ensuring the Quest had the latest firmware and was fully charged. If these fixes don't resolve the issue completely for you, reach out to us at contact(at)truantpixel.com or on twitter @truantpixel, and we'll be happy to help you out.", "TheCookieJrJan 11 at 10:00 PM\nHigh Quality Game\n\nThis game is so addictive. Making your new plays and testing them out, customizing your uniform. The throwing mechanics are amazing! I am not even that good at football in real life but they sure make it a lot easier in here. But the best part, although it may be a small one, using the joy sticks you can run, when you are on a QB run and you push someone down with your arm it is the best feeling in the world. Although I do hope that in future updates they will add more positions to play than just QB, and more game-modes than just the one you cycle through 8 rounds of teams. Otherwise... Amazing all around game.\n\nHelpful | 2", "jaxon.clayton.908Jan 17 at 5:50 PM\nGreat great tiny flaws\n\nIn my opinion this game is on of the best vr games I had yet to try,and the reason is,this game is just so addicting but so simple,I have pretty much no problems with the app except once in a while the quest tracking goes wonkey but overall a great game would recommend\n\nHelpful | 2", "Mounties83May 20 at 11:59 AM\nAll around good game\n\nIt takes a little to learn the release and power but after that its all about strategy. Very competitive to play. I would give it 5 stars I could stuff arm lol\n\nHelpful | 0", "WayyCoolJrJan 14 at 7:14 AM\nLimited, but addicting..\n\n2MD Football is a blast. I think if you are a fan of football in any capacity, this game is for you. There are a couple of shortcomings or some small quality of life improvements I would like to see in this game, but I cant stop playing it right now. Check out my video review on my YouTube channel:\n\n2MD Football Unleashed - Oculus Quest Review https://youtu.be/Yx_RrOcufig\n\nHelpful | 0\nDeveloper ResponseJan 14 at 8:26 AM\n\nHi keithbelt721. Thanks for your feedback and the kind words, and we really enjoyed watching your video review! You make a lot of good points, and I think you hit the nail on the head with our intent to create something lighthearted and fun. We read and watch every review and we listen to every little bit of feedback, so its definitely appreciated! Thanks again, and enjoy 2MD!", "ConquerAll187Jan 17 at 7:55 PM\nHi!!\n\nthis game is very good in general, but it doesnt have a lot of features.In a year or two this game would be way better better just because there would be more in the game. The main part is that its simple,but needs to add more. I get that this game just came out but this is my honest opinion.\n\nHelpful | 2", "KingOfOWtlawsJan 26 at 11:42 AM\nFeel like the 90s Buffalo Bills\n\nThis game was a day 1 purchase for me because I am a HUGE football fan and it doesnt disappoint. Its a easy game to pick up, but very hard to master. Ive put countless hours into it and still have not won the championship. Ive made it multiple times but cannot beat it to save my life! And low key I kinda like that its so difficult because thats exactly how real football is. You have to be nearly perfect to win a football championship and thats how you gotta be in this game. This game reminds me so much of NFL 2k5 helmet mode and its awesome.\n\n\nThings I would like see improved\n1 - Guest mode, I hate letting my friends play and they end up changing my awesome plays and then I have to back and change them all back.\n\n2- I think it would be cool to have a QB wristband that shows a mini diagram of the current play or all of plays on that analog stick current analog stick.\n\n3 - I wish that the different teams or players had stats that we could see to use for our advantage. For example certain players might be faster than others or certain players better at breaking tackles and knowing these stats would allow to put those players in the best position on the whiteboard for our offense.\n\nThis game is hands down top 3 for my Quest. I play it everyday.\n\nHelpful | 1", "bradenf6Jan 24 at 5:00 PM\nSimple Gameplay, but amazing feeling\n\nI've never been that big of a fan with sports games other than possibly FIFA or Madden Mobile, but this game just take the cake with how fun it is. The game currently only contains a single position with limited teams and things to do on and off the field. But this game creates such an amazing atmosphere with just these few things and I'm excited for what other positions and things they'll do with it. If you are a huge fan of arcade style watered down games, this is for you. Throwing the football over and over on paper seems to get old after a while, but it hasn't. I still after having and playing the game for over a week still get the same rush of throwing the football down the field perfectly for a touch down. I highly recommend this game to all sports lovers and people who haven't even watched sports. It's simple, but oh so fun.\n\nHelpful | 2", "VTX_VoyagerMar 1 at 3:43 PM\nSome issues\n\nIve played this game for at least half an hour and I think its good although the throwing is off sometimes and its a little frustrating. I hope that you could fix that mistake sometime in the future. Thanks!\n\nHelpful | 1", "karlduignan96Jan 10 at 10:39 AM\nThe beginning of a fun game\n\nI only just purchased this game but its really fun! Very simple, but also has features with little more in depth such as making your own tactics and all! The throwing is very real but can also be hard to get a grip off with the trigger button! Will update when I play more!\n\nHelpful | 3", "obi2kenobiFeb 11 at 6:41 PM\nFalls short of greatness; extremely fun\n\nWell, I finally managed to beat the game, so I figured I'd update my review and share my experience.\n\nFirst of all, to the game's credit, until I beat all 7 rounds, this is the only game I played for several weeks (obviously I don't play as frequently as others, but that was still a nice size playtime).\n\nBasically if you like American football and want to try out being a QB this game is a must have. The immersion of scanning the defensive formation, trying to see where coverage is going to find an open man, all while ensuring you dont get sacked (on later levels anyway) is a whole lot of fun.\n\nThere are all kinds of situations that you always imagine yourself in if you've watched football as a fan - getting sacked on your blind side while trying to find a receiver, converting a 3rd and long, seeing lots of green in front of you and scrambling for a first down, threading the ball in a tight window you weren't sure was going to make it, hitting a hail mary, taking the easy \"check down,\" hitting a receiver in stride, scoring the winning touchdown as time expires, etc etc.\n\nIf you ever played ncaa games like madden or ncaa, this is nothing like that. Even with the dummy graphics the immersion is great. Somehow that 1st person qb experience makes you feel the pressure of each play in a way traditional football games could never do.\n\nNow that I've touted the games merit, I'll breakdown reasons it is a bummer at times\n1. The difficulty increase of each level is not linear at all. The first 4 levels are incredibly easy. Then suddenly at lv5 you have to score twice as much in the 2min period to win. Also defense starts intercepting and sacking way more.\n2. The entire game is 7 rounds of 2min drill. If you score a touchdown in 2 min you win (2 TDs needed for last 3 rounds). There is no defense, no 4 quarters, no seasons, etc.\n3. Although it is possible to hand off a ball for a run in the game, it is not a viable option. You can only pass or scramble if you want to gain yards.\n4. For the achievements section (trophy case), there is one trophy I won't even try to earn because it goes against the games limitations. There is a trophy awarded for 10 consecutive completions. In reality this is nearly impossible since you will likely score and win the round before ever completing 10 passes.\n\nNow for a tips section with my advice after hours and hours of playing:\n1. Most important part of the game - go to the practice field and adjust your release height until the throwing feels natural. Before when I did not do this, I kept throwing the ball in the dirt, getting frustrated, and I couldn't throw it far at all. This should be required to start the game imo but it is not.\n2. Google receiver routes if you don't know the basics. I didn't know anything and the game doesn't explain it. After I studied some I was able to make effective plays.\n3. Learn the difference between lofty passes and line drives. On the later levels if you loft balls high in the air its probably a guaranteed interception.\n4. On later levels you have to watch the linemen and linebackers as soon as you snap to see if you are about to be sacked. Running away from them can buy you some time. You may also want to leave a TE to block instead of putting everyone on routes\n5. Snapping the ball early before the defense is set seemed to help gain an advantage at times.\n6. Watch the corners and safeties and see what direction they move. If they move away from where your WR is going you can anticipate where he will be open and throw to that spot\n7. When you complete 3 passes in a row you get \"hot streak\" which means you can't be intercepted, and your guys move faster.\n8. Skip the carnival game between rounds, it just wears out your arm and you can't play the actual game as long.\n\nBug report: when i beat round 7 the message \"2nd place\" still displayed, even though I got the Champion trophy.\n\nHelpful | 1", "Larkis123Jan 16 at 1:51 AM\nMore than you can see at first glance\n\nSuperbowl 2016 Patriots vs Falcons 20- 28 and only a few minutes to go. A few minutes to cross the whole field and make a touchdown. a few minutes which decide everything. Now its up to Tom Brady to lead the Patriots to the win. Or its up to you! That is the scenario of the game in a nutshell. You have 2 Minutes on the Clock and you need ne cross the field to make a Touchdown.\n\nYou can create (or use premade) 9 tactics and decide the position and the running ways for every player and then go on the field and throw the ball.\n\nThe first experience is more ugly with the poor graphics and feels more like luck/unlucky ball throwing. But when you start to build own tactics and play on the clock it gets very fascinating and funny. Oh and i got my brady moment too. First Throw of the game, 20 yards on a free man and touchdown!.\n\nBut there are still some improvements i would like to see in the game.\n\n1. It get boring after throwing the ball and just watch the result. it would be cool if the camera moves with the ball and you could control the catching player like in madden and run the touchdown yourself. (and addition to that, let us control the running speed with our arms like in Creed: Rise of Glory so it turn into a real sportsgame. )\n2. The Playstation Version as an 1to1 multiplayer where one additional player coordinate the defence. Please add that to this version too!\n3. Let us play defence against ai and give us an additional mode with full length games.\n4. Instead of just playing one game after the others, give us a season mode or at least a playoff mode inclusive superbowl. :D\n\nFinally i give 5 Stars. I like the game. For the price its ok and it has a LOOOOOOT potential to grow.\n\nIs there a Discord from the developers to chat with them?\n\nHelpful | 5", "KingThomas33Jan 9 at 6:25 PM\nDefinite Buy For A Sports Gamer\n\nThis game has me super excited for the future of sports game on the quest. The graphics seem simple but the gameplay feels amazing.\n\nAnd if a developer sees this... I definitely suggest adding full games and some seasons. Updates to team colors, logos, names and eventually bodies instead of dummies. I know thats a lot to ask for but just a suggestion.\n\nAll in All 5 Stars!!\n\nHelpful | 8", "oozmaFeb 14 at 3:26 PM\nGreat game but...\n\nthis game is great But I feel like they could add upgrades to your player maybe its throwing strength, run speed and accuracy that would be super cool. like this if you agree\n\nHelpful | 2", "colourpixelsJan 12 at 11:39 PM\nPretty decent but not a long term play\n\nThis is a very fun game to kill a few hours with. I cant see it lasting too long though as there isnt a lot of depth, but it should be fun to pick up now and then and throw a few passes. It does however show that VR football has a tonne of potential. Maybe buy when its on sale.\n\nHelpful | 1", "ITWLMW_daddyFeb 10 at 7:58 PM\n\nOther than having a occasional release glitch it has a realistic feeling especially when leaving the pocket and waiting on routes to develop\n\nHelpful | 0", "NRG_LIQUID-Mar 5 at 4:31 AM\nGood game\n\nGet it\n\nHelpful | 1", "skinnyt695Jan 19 at 11:31 PM\nDon't Judge a Game by It's Cover\n\nWhen I first heard of the release of 2MD Football Unleashed from #BMFSHOW, #SteveKnows and #EricForPresident, I was sitting skeptical. I wanted to wait a little for the reviews to start rolling in to evaluate others experiences. Then told myself... \" I'll just Buy it!\" .. This is one of The BEST Games on the Quest! I Recommend that if you don't have it, Buy It! A Great work out and Super Fun!\n\nHelpful | 2", "Staybent20Feb 5 at 2:01 PM\nNothing but pure fun!!!\n\nThis game is for all those Madden lovers out there this game even makes me break a sweat I love to come home from school and play this game highly recommended it for any madden/football players or any one else\n\nHelpful | 2", "RhihanMay 16 at 10:23 AM\nIt's like a solid NFL tech demo\n\nThe interface is relatively polished, but throwing mechanics can be a bit wonky, even if you spend lots of time fine tuning throwing power and release point on the practice field. I've found that with practice, you can hit closer receivers relatively consistently but that deep routes are really hard to judge. I found myself over and under throwing deep routes a lot. Plus it's pretty repetitive. I guess it has an arcade feel to it, and I really love the concept, but it needs more variety. Also needs to have a running back option. Seems silly when you're 3rd and goal on the 1 and you have to pass the ball Seattle Seahawks style instead of pounding the rock. NFL franchises would also help, but it's OK without of we could add longer games, perhaps a season mode, and maybe even an opportunity to improve your team. At the end of the day, the passing mechanics are what hold it back though. Worth a look for NFL fans, but don't expect too much.\n\nHelpful | 0\nDeveloper ResponseMay 17 at 7:11 AM\n\nhi Rihan. 2MD is, at its core, a pick up and play arcade experience. The additional features that you mentioned in your review would certainly be nice, however youre talking about something with a vastly larger scope, as well as development cost probably 3-4x the original budget to add all the modes and features. Dont get me wrong, we would love to have those as well, but you have to start somewhere. The NFL license is not exactly something that you can pick up for cheap either ;). thats also why the game is priced relatively low, because its a focused arcade game, and its not trying to be madden, or a full blown NFL simulator. All that being said , if youre experiencing any inconsistency and throwing, that is not normal behavior for the game. We actually worked very hard to ensure a consistent and accurate throwing experience. What you may need to do, is ensure that, first your lighting conditions are suitable, second, your controller batteries are fully charged, third, it is sometimes a good idea to do a full reset of the headset after you have installed the game to make sure that there are no lingering errors either. If these do not remedy the issue, please reach out to us at contact(at)truantpixel.com, or on Twitter @truantpixel", "DrKotulakJan 17 at 5:09 AM\nSimple but fun\n\n4.5/5 - its a great game and is a lot of fun. It is only the winning play arcade style where you have 2 minutes to score that winning touchdown(s). Only offense which is fine and it does feel very good to throw a bomb and score In the last seconds. A few things I think could be improved is first off my skills, but I also felt like there were times the ball would maybe just fall or not release? Not sure if I was taking to much time and getting sacked or it more so felt that it kind of was losing some of my tracking since Id be throwing off to the side like I normally would, resulting in a hilariously bad throw. I think tho If I slow it down and perfect my form I can mitigate it happening majority of the time. Defiently a fun pick up and play game\n\nHelpful | 2\nDeveloper ResponseJan 17 at 6:51 AM\n\nHi DrKotulak! Thanks for the kind review, as you probably guessed we read them all. If you're having the ball fall short, it's because your controller has lost tracking. this can occur in 2 scenarios: 1) the battery is low. change it! or 2) If, in the process of winding up your throw, you hold your hand out of view of the Quest's cameras, it can lose precise data for where the controller is. This affects the calculated throw velocity and angle. My advice here is, make sure you're not holding your hand behind your head (or out of view of the HMD's side camera) for more than a second. Usually a normal wind-up and throw is much shorter than this, so it shouldn't be much of an adjustment! Anyway, hope that helps, thank you again for leaving your feedback, best of luck with the championship and thanks for playing our game!", "VRpickle87Jan 28 at 7:02 PM\nGreat game\n\nI love this game the only thing I would like is more options like uniforms, or the number on the uniform the color of the route your players run and more songs. Overall great game.\n\nHelpful | 1\nDeveloper ResponseJan 28 at 9:43 PM\n\nThanks for the kind words! In another version we gave folks the ability to change route color. Is this something that you'd like to see in Unleashed?", "DaggerSandwichMay 14 at 10:27 PM\nFun but needs so much more\n\nI was so excited to play this when I first discovered it exists. Its so much fun being able to throw TDs.\n\nBut I feel like the game itself is lacking so much more playability.\n\nThe uniform customization is too basic. It would be nice if we could change uniform design or helmet stripes instead of shooting 2 colors.\n\nI would love to be able to play a full game of football including defense and special teams. Just to be able to actually strategize and try to win on both sides of the ball instead of always having to be comeback QB.\n\nHelpful | 0", "Dynastybaseball2Feb 28 at 9:48 AM\nAmazing\n\nI was just wanting a cheap sports game then I found thins and it is amazing for the price\n\nHelpful | 1", "Coffeeblakk91Jan 14 at 8:10 AM\nSimple fun and AMAZING!!!\n\nAbsolutely love this game! I would play this all the time on PSVR but the cords and having to face toward camera all the time hindered it a bit. But with the quest there are no cords, with 6dof it makes throwing the ball easier. This game is a top 5 must have for the quest. If your even a little bit of a fan of American football get this game right here!!\n\nHelpful | 2\nDeveloper ResponseJan 14 at 8:31 AM\n\nHi Coffeeblakk91. Thanks for the kind feedback -- It's always great to see PSVR players picking up the game and being able to experience it without worrying about the cords or the camera! And on that note, we also truly appreciate everyone that already owns the game on other platforms who pick it up again on the Quest. We weren't expecting folks to grab it a second time, so it means alot to us and helps motivate us to keep improving the game in ways that give each version something unique to offer. Thanks again for your feedback, and of course we hope you continue to enjoy our little football game!", "jaydegeerJan 14 at 3:40 PM\nFun!!\n\nSo it started off slightly confusing because I thought I was playing a full game of football which wasnt the case but the concept of playing the game is super fun, I like how you guys did the point scoring system to compete with others online....I found myself playing until battery got low then I charged up and played as much as my throwing arm could handle before getting tired. Very fun game.\nWell priced, a must own.\n\nHelpful | 2", "jericho2005Apr 1 at 8:17 PM\nLove it, Im Russell Wilson\n\nEverything is fun about it. You get to make your own plays, pick your team, etc. But the part I love the most is that when your playing QB, it makes you feel like what a real NFL QB feels like in the backfield. If you can only get one game on Oculus, get this one.\n\nHelpful | 2", "ghost_shotgun12Jan 13 at 4:04 PM\nPlease read this devs\n\nWhat I like about it:\nThis game is awesome and has so much potential, I love the mechanics and I seriously think theyre spot on. The way you get into matches is a really cool idea of putting on the helmet.\nWhat they could add (key part):\nI would love them to incorporate skill moves such as stiff arms or trucks, along with that maybe designed run plays. The reason I would love skill moves to be added is mainly because I use the scrambling feature quite a lot and I feel kinda helpless the fact that I have to run into opponents and get tackled immediately, so I think it would be a great addition to be able to demolish defends with stuffs arms and skills like that, so basically make the ball carrying more physical. I would also really love the ability to maybe be able to play as a receiver\n\nOverall very good game, easy to play, the more you play the better you are, lots of praise for the devs for the mechanics, visuals (stadiums) and the AI. Definitely a but for ALL sports fans\n\nHelpful | 2\nDeveloper ResponseJan 13 at 6:02 PM\n\nHi ghost_shotgun12. First of all, thank you for the kind words. We read every single review, and we're glad you like the game! We definitely hear you with regards to adding more, we're closely watching the overall response to the game. You can stiff-arm opponents, but you basically have to get a good angle on them before they dive-tackle you. Still, we'll definitely keep suggestions like power-plays in mind if we get the opportunity! Thanks again for your feedback!", "SupercarXBOFeb 8 at 11:02 AM\nGreat but needs a season mode\n\nEverything about it is fun but a seasons mode is needed. The regular mode is repetitive and gets bland.\n\nHelpful | 1", "trappedrealityJan 31 at 5:27 PM\nFootball\n\nI have a lot of fun playing this. At round 6 the defense gets better and your receivers dont seem to try as hard to get the ball. Still fun.\n\nHelpful | 1", "TimDM11Jan 10 at 7:56 PM\nGreat game\n\nI love the throwing mechanics - it feels very realistic. I can play hours of this game. I wish there were more than eight plays you can use during a run OR you can modify plays between rounds. Looking forward to future updates.\n\nHelpful | 3", "ltshiznitskiMay 15 at 10:58 AM\nBetter than I expected\n\nSo I did what most people do and read the reviews before I purchased. I took a chance and I'm thankful I did. This game is so much fun! Bringing back my old QB days. Must get If you love football.\n\nHelpful | 0", "nate.g.blevinsJan 9 at 6:52 PM\nMust buy\n\nAwesome game! As a die hard football fan i didn't expect this game to be as good as it is. I know its a arcade style game buy it definitely could use more content buy overall a really good game and if you like football its a must have\n\nHelpful | 2", "AJayandChrisJul 5 at 3:56 PM\nThrowing is bad and the tackling weird\n\nIts a meh football game I recommend vr sports the game \n\nHelpful | 0\nDeveloper ResponseJul 8 at 9:25 AM\n\nhey there. Sorry you had a bad experience - I can assure you the game has gone through vigorous testing to ensure smooth performance and reliable tracking results. despite these efforts, the quality of the tracking is subject to several environmental variables: If your headset needs an update, if your controller batteries are low, if your lighting conditions are not ideal, this will affect the quality of the tracking data. Not every game demands the same level of position and physics data that 2MD does, so it may not be as easily apparent in other titles. Lastly if, when winding up to throw, your controller goes behind your head for more than a second, this will decrease the quality the tracking data and result in the unpredictable results. Now as a developer this is completely out of our control, so the best advice we can give (and this is stated on the chalkboard in the practice area of the game as well) is to avoid holding your throw behind your head or out of the cameras tracking area for more than one second. If you're able to make these adjustments, this will hopefully improve your play. If this rectifies your issue, please feel free to update your review with the results. Otherwise, you can reach out to us on Twitter (@truantpixel) if you need further assistance.", "Astronic_BunnyFeb 11 at 7:28 PM\nGame now works!\n\nThank you developers for helping me with the problem on my end it really helped! This is a great game and the developers are quick on responding!\n\nHelpful | 2\nDeveloper ResponseFeb 13 at 3:40 PM\n\nEdit: So glad it worked out! and thank you for the kind words! Hi Astronic. The game has had extensive QA testing and definitely doesn't exhibit the behavior you're describing. It sounds like you might have a corrupted download. In these circumstances, it's always best to delete the title and re-download it. Also make sure your headset has the latest firmware, is fully charged, and do a full shutdown and restart just for good measure. And it doesn't hurt to make sure your controller batteries are also fairly fresh too. If that fixes your issue, please let us know and update your review. If you are still running into problems, reach out to us at contact(at)truantpixel.com or on twitter @truantpixel and we'll help you sort it out.", "mr.memeskiFeb 15 at 9:15 AM\nGreat game overall\n\nIt is a great game but it needs multiplayer or defense\n\nHelpful | 1", "ClarkGriswold1357Feb 17 at 4:12 PM\nLots of fun\n\nIf its not football season and you want to play football or you just want to play for fun this is the game for you.\n\nHelpful | 1", "RocketrynoMay 14 at 12:31 PM\nSo much fun!\n\nBought on a whim. Can't stop playing. From designing own plays (also has standard ones for ease of use), to connecting on a hail Mary with the game on the line, heart pounding excitement!\n\nHelpful | 0", "DJPanda16Jan 28 at 9:38 PM\nI wish you could play wide receiver\n\nThis is so great and Im addicted but I wish there were more playing options maybe like a season or other positions like running back or wide receiver. Theyre probably working on it though. Cant wait\n\nHelpful | 2", "SloppyComic2523Feb 16 at 2:12 PM\nFun but a little hard\n\nThis game is really fun. But for me it is a little hard.\n\nHelpful | 0", "Jpag13Jan 11 at 3:22 PM\nBasic Yet Addicting\n\nI will START by saying $14.99. Secondly, it fills a Major Sports Void, Third, It is by far the best throwing mechanics on any game that requires you to throw. Your Can draw up your own play, dump off to the RB, Roll outside the pocket, pump fake, And when you HIT the Deep Ball it FEELS OH SO GOOD. The REPLAYABILITY is Definitely IN EFFECT. Add Leaderboards and you got a game you will PUT on when you want to get lost for 20 minutes or 2 hours. ENJOY\n\nHelpful | 1", "adumb69Jan 9 at 7:13 PM\nBest VR sports experience\n\nI am a huge football fan and would love to play it, but my lack of muscle is a pretty big problem in that. But this game felt like the real deal and is just amazing. I love the best selling VR games as much as the next guy, but I keep coming back to this one more than the others. It takes alittle bit to learn how to work but it really puts you in the seat of the QB and the coach at the same time. Arm Strength and accuracy is a big deal too, but managing your 2 minutes is the most important part. This is a must buy for football fans and just quest owners in general.\n\nHelpful | 2", "ShinyRainJan 15 at 4:29 PM\nReally good game\n\nOverall its a very good game. But if youre looking for realistic graphics, this isnt the game for that. But this is the best game Ive seen so far that has a good throwing mechanic. I think that a defence aspect would be cool. Thanks for the great game.\n\nHelpful | 2", "RobotScott33Jul 11 at 7:31 PM\nCan't throw\n\nThrowing mechanics are terrible.\n\nHelpful | 0\nDeveloper ResponseJul 11 at 8:21 PM\n\nsorry you had a bad experience, the throwing mechanics work very well for the vast majority of players; my guess is you probably have encountered an install bug or error somewhere that is compromising tracking. If youre interested in troubleshooting, Id make sure your headset is up-to-date, make sure your controller batteries are fully charged, and make sure that youre playing in ideal lighting conditions so that you can have optimal tracking. we realize you cant please everyone, but I cant help but think you did not experience the game as we intended.", "wolfieboy11Feb 16 at 1:34 PM\nPetty fun\n\nIts fun but there needs to be a season mode.\n\nHelpful | 0", "BimBackaFeb 15 at 1:08 PM\nAmazing\n\nHonestly my favorite game out right now for the quest, if you are a football fan this a must buy\n\nHelpful | 3", "frankasmith568Jan 29 at 8:38 AM\nGood Fun, but needs work\n\nNeed to have an adjustment for throwing angle and wrist position.\nSome may claim the angle is correct. That may be true with a real ball. But then that would be a real game of foot ball. This is n arcade type situation and it should provide what is comfortable for the user and comfort.\n\nHelpful | 1\nDeveloper ResponseJan 29 at 10:58 AM\n\nHey Frank-- You actually don't have to position your wrist in any particular way to get a good throw, the system is automatically adjusting for your velocity and release height, so you can throw as comfortably as you please (your wrist angle does not matter). So long as your point of release and velocity are consistent, your throws will be accurate. We also built in customization for power and release height that you can play with in the practice field until you find a configuration that suits you best.", "frank_allanMar 23 at 10:16 AM\n\nits cool but the throwing sucks I couldnt throw a ball it releases digger then other game\n\nHelpful | 1\nDeveloper ResponseMar 23 at 5:14 PM\n\nHi frank. Not entirely sure what the issue you're describing here is, if you're releasing the ball too late (hence the \"digger\") you either need to release it early, or go to the practice field and adjust your release height to tailor it to your throw. Throwing in 2MD is actually pretty fun, but since everyone throws a football differently you may have to tune it to your particular style to get the most out of it. Final thought? make sure your controller batteries aren't too low either, as poor tracking leads to poor throwing.", "Daz2k007Jan 12 at 2:39 PM\n\nPeople saying game is glitchy are lying probally just because they suck and can't throw the ball good game class when you do a hail Mary and throw like a 60yard throw for the touchdown don't know if it's just me but love throwing the trophy into the fans at the end\n\nHelpful | 4", "TheBoylingpotJan 14 at 6:17 PM\nGreat\n\nThe game is great so far I love it but I would love to see more than just the final two minutes of the game part like it would be so fun to be able to play a full game of football not just two minutes but the game play is smooth the controls are easy to pickup .\n\nHelpful | 1", "ryan.beadle.146Jan 19 at 7:58 AM\nNOT FUN\n\nI didn't have to play this game long before making this review. This thing is just no fun. It's just hard to simulate throwing a football when you have to keep hold of a controller. This could work okay with hand tracking. But I'm sick of all these vr games that dont play against human character A.I. instead were throwing footballs toward practice dummies. I've been disappointed with a lot of games on the quest lately.\n\nHelpful | 4\nDeveloper ResponseJan 19 at 8:47 AM\n\nHey ryan.beadle.146. Firstly, sorry to see you didn't have fun with the game. We read every review, so I suppose I should try to address your issues. Oculus hand-tracking is currently in beta. Regardless, since throwing a football would take your hands out of view (albeit briefly) of the Quest headset cameras, it would be extremely difficult nigh-impossible to maintain accurate position tracking in order to calculate the proper vector, velocity and finger orientation to determine the release point of the ball at the speed at which gameplay occurs. Secondly, though the players are indeed practice dummies, the game is driven by a complex and progressive AI that controls both the offensive and defensive lines: that's the whole basis of the whiteboard mechanic, as you're essentially reprogramming strategies for your team, and trying to outsmart the defending line. So while they don't 'look' like people, they actually do behave like them. I can't really speak to your disappointment for Quest games lately, I can only tell you that every pretty much every Quest developer (from the smallest indies like us to the larger studios) spend countless hours tirelessly trying to eek out the best performance out of the Quest HMD to create a fun, novel and immersive experience for you to enjoy, ourselves included. If our efforts are really worth only 1 star to you, then I suppose it's 1 star we're still extremely proud of. :) Still, if you decide to give 2MD another chance and need any help, feel free to reach out to us at contact(at)truantpixel.com or on twitter @truantpixel, and we'll do your best to help you get the most out of the game. Otherwise, here's hoping your next purchase is more in line with your expectations. Take care!", "Deadeye50Jan 11 at 9:59 AM\nLove the game\n\nLove this game, crazy fun and addictive. I hope in the future they somehow add multiplayer playing of some sort would make it 10 times better but other than that its a great game\n\nHelpful | 3", "Brady37984Feb 12 at 1:45 PM\n\nI love the game its amazing I recommend playing it but I have one request they should be people\n\nHelpful | 2", "AlexAudioJan 10 at 6:18 AM\nWorth the wait!\n\nI was waiting for this release for a couple months. Its great on so many levels. Immersive and Fun. Games are quick but you can also play for hours. I love this game. My shoulder hurts but thats not the developers fault . Well done! Love this game!\n\nHelpful | 2", "carterwake06Jan 11 at 8:21 PM\nOH MY GOSH!!!!\n\nThis is a really good game its a 5 out of 5 stars but the only problem I have with the game is you can throw the straightest throw ever and the receiver drop it. But if your looking for a really good sports game get this before you buy anything else\n\nHelpful | 1", "NtatuJan 25 at 10:23 AM\nGreat football game\n\nThis is my most played game by far. I have so much fun playing this. Its so simple but yet so fun. It just shows you what VR football/sports could be one day.\n\nHelpful | 3", "DezDelacroixMar 26 at 5:10 PM\nGreat Experience but fades quickly\n\nEven though the graphics are rudimentary at best, its more about the experience of having a thrilling 2 mins to march your team down the field and complete a chiefs like comeback in the 4Q\n\n+ Strong Competitive Feeling\n+ Good throwing and release mechanics\n+ Creative Playmaking Ability\n\n- Gets repetitive fast\n- fumbles, turnovers, and 4th down misses arent counted negatively\n- basic graphics\n\nHelpful | 0", "ken.hutchJan 29 at 2:16 PM\nNot football, but its ok\n\nI am redoing my review as I reinstalled the game and I do keep playing it.\n\nMy main issue is the apparent stat difference between the 4th and 5th round. I can, almost every time, beat round 1 through 4 with one play. Then, 5 through 7 are at a whole different level. They intercept at a maddening pace, push my receivers out of the way even. Run plays are impossible against 5, 6, and 7. So my experience right now is a repetitious demolishing of 4 teams, followed by 3 teams that are basically cheating and typically demolish me.\n\nThe devs have said each player on a team has stats....I would like to see those stats listed in the locker room instead of just hoping that over time I may see a pattern.\n\nAlso, I would like the option of clicking to throw instead of releasing to throw. Throwing a real football uses tension in your fingers to produce the roll that becomes the spiral motion. To release the ball we have to relax our index finger and that feels counterintuitive. Plus, I would like to have all fingers down when passing...one lifted makes me to cautious so I do not accidentally lose my controller.\n\nThough it is arcade style, I still think a season mode would be a good addition.\n\nHelpful | 3\nDeveloper ResponseJan 12 at 3:55 PM\n\nHi Ken.hutch. Sorry to see you didn't enjoy the game. We recognize that it's not possible to please everyone - It's not meant to be a point-for-point recreation of the kinematics used, but 2MD gets as close as you reasonably can to throwing an actual football given the variables of actually holding a motion controller and using it as a proxy for a standard grip, and the current limitations of visibility-based motion tracking. :) The bonus round does, in fact, affect your score - you can see it on the scoreboard as you hit the ring targets, which in turn is added to your rolling total. Hand-offs and scrambling are about opportunity. For them to be successful, you need to have opened enough of a hole in the defensive line to allow for yourself or your running back to get through. It's all part of the fun of the whiteboard, which is effectively a sandbox to try out ways to outsmart the AI. Your ability to complete passes depends not only on your skill, but the skill of your team. Every player in 2MD has different stats, and as you get to know your team, you'll start to figure out where their strengths lie, in terms of passing, hand-offs, defense, etc. Again, I'm sad to see you didn't have a good time. 2MD is, first and foremost, an over-the-top arcade experience, rather than a hardcore sim of the sport, but we like to think we've gotten pretty close for a first-effort in football in VR. Regardless, thank you for your feedback.", "Red_The_TardJan 13 at 3:07 PM\nEasy to enjoy\n\nIt's super enjoyable as a entirety but the only problem for me is run plays are super difficult to pull off and you often get stopped at the line\n\nHelpful | 2", "STOWYJan 13 at 10:18 AM\nPretty good game\n\nI wish the throwing mechanic was better but the general aspect of the game is fun. I wish there was more to do also but it just came out so Im chiling\n\nHelpful | 1", "humanpoopcanoeJan 31 at 10:31 AM\nThe first VR title...\n\n...where throwing is almost perfect. This game is very much gooder and a great first VR football game. The future of VR sports is bright.\n\nHelpful | 1", "tanner.maxfield.5Jan 25 at 6:17 PM\nLove it!\n\nI played so hard that I threw-out my arm and shoulder. It is simple and so fun! It is a very dynamic game that allows a versatile, highly custom experience every down.\n\nHelpful | 1", "TransJenderGalJan 17 at 8:18 AM\nMisses the playoffs\n\nOverall this game has potential, however even as an avid football fan chomping at the bits for a great and proper Football game NFL license or not, this is just not something that's gonna hold my attention.\nToo repetitive, too simple, too frustrating.\n\nWhat I liked:\n--Throwing is nice, but needs work.\n--Ability to draw your plays\n--Ability to customize your uniforms\n--Stadiums look nice despite their simplicity\n--Nice sound\n--endearing player models even if silly (its an arcade game, so this is good)\n--Ability to chase high scores(also a must in arcade games)\n\nWhat I did not like:\n--Annoying and repetitive intro, EVERY time you load the game it beats you over the head with the BORING tutorial..unless you endure it or click it off everytime.\n--No Defense\n--Receiver AI is stupid.\n--Receivers do Nothing too help, I dunno how many times i threw a great pass and the receivers do NOTHING to help. Partly cause training dummies cant use arms and grab a pass 2 inches over their head. They make NO adjustments. Nothing. At all. You either hit a perfect pass or its incomplete\n--SAME exact ladder to climb. Order of teams does not switch. at all. So literally the same experience Every time\n--Only way to stop drawing a play is to either draw the line to it's completion which doesnt always make sense OR drop the Marker/pen on the floor.\n--Only 2 modes. Practice and ladder\n--Your QB gets sacked WAY too easily. If they even look at you, it's a sack.\n--Impossible to EVER scramble for more than 9 or 10 yards. You will Never break a long run. Ever.\n\n\nConclusion- Fun for a few hours and then it gets very old, very fast. Most people will not play this much longer than 2-5 hours. I personally might come back to this on occasion, certainly if they actually listen to the community and address some of the short comings.\nI can Not recommend this to anyone for the Asking price of 15.00 which isnt a ton, but still too much for what most will get out of this. 9.99 or pass.\n\nHelpful | 1\nDeveloper ResponseJan 17 at 9:09 AM\n\nHey xNexJenx. It looks like you've missed a few key points that could otherwinse have enhanced your experience. You've given us alot to unpack, so here's the breakdown of your negative points: (1) The game keep presenting you the tutorial because you haven't completed it yet. play the tutorial fully, follow the instructions, and no only will Coach stop bugging you, you'll get an easy achievement and a trophy for your trophy case! (2) There absolutely are run plays, there are actually a couple on the board already. Just like in real life, if you want your RB to run the ball, put them near you or give them a path that takes them close enough to where you'll be so you can hand off the ball. After the snap, simply hold the ball out to them, and when they make contact, let go. Voila! (3) Dude, they are tackle dummies, not tackle geniuses! Just kidding :D. the Receiver AI is actually pretty smart, they'll go after your passes or look to where you are looking before you throw. They constantly are making adjustments for what you do, and will lunge for catches and even catch the ball with their feet right before it hits the dirt, which makes up for lack of hands. Maybe try a different team next time, as some have better receiver stats than others. (4) Can't argue with the difficulty ladder, but hey, it is an arcade game. youre totally mistaken about the ladder order however. the order of the teams is dictated by the team you choose to play as. (5) If you want to stop drawing a play, all you have to do is lift the marker off the board. You don't have to drop it (but we don't mind if you do) (6) Again, it's an arcade game with a deep AI sandbox (playbook) and natural throwing mechanics :) (7) You don't get sacked if they look at you, you get sacked if you leave the pocket and haven't set up a good defense. Really, take another look at those plays you're drawing--but really, if you don't leave the pocket, and you have enough defenders, you won't get sacked (8) We've definitely made the scramble difficult, but running the ball yourself is like running the ball in real life: it's about the opportunity and the setup. You need to design your plays in such a way that you'll give yourself enough of an opening to grab some yardage without being tackled. Trust us, the whiteboard is just ripe for setting up a 20 yard scramble (also in our trailer ;)) (9) I can understand you've got some frustrations, but you've made some pretty bold (and unfortunately erroneous) conclusions about the game without exploring just how deep it goes. It sounds like you really didnt delve very deeply into the experience before writing your review, which is likely why you missed quite a bit. If you're really curious, most average sessions tend to go almost 2 hours, and most people still haven't even beaten the last round and gotten the championship ring(!). Much of what you're playing in this version has benefited from 2 years of community feedback from other versions of the game, and of course we're always listening. If you're still having issues despite trying these things, reach out to us at contact(at)truantpixel.com or @truantpixel on twitter, and we'll try to get things sorted. I hope you will have the chance to give the game another try, and if the above tips enhance your experience, you'll feel inclined to come back and update your review!", "reg_sized_rudyJan 18 at 9:56 PM\nGreat start to getting full VR football\n\nThis game is pretty fantastic. Gives me hope that we can get a full football game that feels smooth and fun.\n\nWould love a mode where you can just run plays without there being a time limit.\n\nHelpful | 2", "KrabbyPatJan 9 at 3:32 PM\nOmg its the best\n\nI was wanting this game for 2 weeks and its insane its cool and hard so I recommend this to anyone\n\nHelpful | 4", "Hcaz.ZachJan 31 at 3:27 PM\nAmazing\n\nThis is by far the best game Ive played so far. My whole family loves it and I feel like its something new every time.\n\nHelpful | 2", "KilihadMar 23 at 4:33 PM\nI love it, and it is almost great\n\nI wanted to give this game a 5 so badly. Throwing is just a bit too wonky (I want to throw the ball, not just flick my wrist) and my receivers sometimes refuse to run the designed route (bubble screens in particular). Incredibly fun and exciting though. First time I played the game I killed my entire battery before I ever wanted to stop.\n\nHelpful | 0", "Elliot0611.MDJan 26 at 7:39 AM\nEasy to play. Hard to master\n\nVery basic looking game that you wont want to stop playing. I am 40 years old and I love it. My teenage son plays as much as I do. Its a great game.\n\nHelpful | 1", "matolcs2Feb 12 at 4:22 PM\nSo much fun\n\nIts so fun to just play a game then hand it to a freind\n\nHelpful | 2", "johnny.panjarjianJan 13 at 1:21 PM\nWhy not have real humans\n\nThis game would have been so awesome if you guys had humans running the routes instead of what ever you call those stick figure looking things.\n\nHelpful | 1\nDeveloper ResponseJan 13 at 6:05 PM\n\nHi johnny.panjarjian. They're tackle-dummies, my guy! Truth be told, the Quest uses a very efficient mobile chipset, so having fully rendered players, with all the kinematics and physics necessary to make them behave believably, is a bit too much for it to handle. The tackle-dummies allowed us to focus on the most important elements: fun, strategy, and the immersion VR gives you in the middle of a packed stadium. But thanks for your feedback, and I hope you enjoy the game!", "CCamboJan 14 at 8:31 PM\nGreat game for sports game lovers!\n\nIts a very simple easy to learn game, re-working your plays on the white board is a very cool feature. I suggest hitting up the practice arena so you can get your aim on point! Great cheap game, 100% recommend\n\nHelpful | 1", "Cajun_PilotMay 8 at 7:26 PM\nVery fun and addictive\n\nYes this game has simple graphics but the gameplay is so fun. The players remind me of the days of the old vibrating football field game.\n\nHelpful | 0", "Skinny_WeenisJan 10 at 4:40 PM\nFootball unleashed\n\nIt is very fun but you should add more. Like you should be able to change positions and upgrade people and there should be more teams. You should also be able to change peoples names and make your own person\n\nHelpful | 3", "KrymBaltimoreJan 10 at 5:03 PM\nI like it\n\nI like this game. I do. I like it. But I can't help but wish it was a full game with multiplayer, co-op, pvp, team play. Like madden. I mean...why not? I really enjoy it though now that that's behind us and it's actually a pretty good workout too. Caught myself sweating and breathing heavy. Hopefully there's a full on football game coming down the road. Even baseball and basketball team sports games I think would be awesome in vr and this game has proven it ....to me anyway. Get it if you're on the fence. It's good.\n\nHelpful | 2", "WrathMan47Jan 9 at 6:56 PM\nVery fun\n\nI only played 20 minutes of it before I ate dinner and it I really enjoy it. The throwing feels really good and to customize your plays feels great\n\nHelpful | 2", "Pedster9Jan 11 at 10:38 AM\nReally cool\n\nThis game is so much fun. I have this on the PSVR and really enjoyed it. So glad it has finally come to the Quest. Already spent a few hours playing this so just stopped to charge my quest and add this review.\n\nHelpful | 2", "gman0320Mar 21 at 4:33 PM\nAre you ready for some football?\n\nSpent the last couple of hours playing this game. My arm and shoulder are even bit sore! If you ever wanted to be QB1 this is your big shot. So cool to read defenses and try to find matchups. I even went in and created my own plays. Scored a TD on my second attempt!\n\nI can see it getting repetitive but for 15 bucks this is one of the best bangs for your buck on Oculus.\n\nEnjoy!\n\nHelpful | 1", "hollis.white.92Jan 26 at 5:31 AM\n\nVery fun better than I thought it would Be definitely recommended they do a lot more with this and vr sports\n\nHelpful | 2", "Hucada4862Jan 27 at 2:39 AM\nVR Football\n\nLove playing Quaterback and running the ball . Would like to be able to play Defense as well but it's a lot of Fun anyways\n\nHelpful | 2", "Ashton321Jan 23 at 6:21 PM\nI Luv This game\n\nThis game is so fun not only do you feel like your actually feel like your playing football but its challenging thats what I like about this game\n\nHelpful | 1", "MrBigBod69May 10 at 3:49 PM\nFantastic\n\nGoofy but entertaining play style, cool arenas, difficult gameplay. if youre into football, this is a must.\n\nHelpful | 0", "flojim1May 5 at 7:00 AM\nTouchdown\n\nLot of fun need maybe some dtails more but so far so good\n\nHelpful | 0", "Juice_McGyllahanJan 15 at 11:19 AM\nOnly the real thing compares\n\nIm a football nut n tho this game is so basic it embodies the sport n what it is to play QB dead n the middle of the action..........plz plz plz make more updates for this game\n\nHelpful | 1", "Fu5i0nJan 10 at 7:36 PM\nFun!\n\nGreat VR game . Simple throwing mechanics , easy to pick up tough to master . Fun and challenging, love designing my own plays standing in the pocket and letting it rip\n\nWell worth $15\n\nHelpful | 2", "TYMONKEYMANJan 19 at 5:03 PM\nVery fun and replayable\n\nThere isnt too much content in this game but it is very replayable. You can draw up your own plays which makes the possibilities endless!\n\nHelpful | 2", "Chili_PepperMar 15 at 2:24 PM\nVery simple football game\n\nThis is a pretty simple football game thats actually pretty fun. The game has a lot of potential. It is fun running the 4 plays and throwing the ball. Hopefully the devs keep up with new content. A career mode would be really good in this game where you can play a real season, run training drills to boost your players, and have the option for more plays. Great start to a game, its up to the devs to make it one of the best VR games.\n\nHelpful | 1", "TheGreenGardFeb 20 at 1:08 PM\nThe worst game ever\n\nGarbage game is played on the vr it didnt let me do whatever I want like run a touchdown or something\n\nHelpful | 1", "TwentyMF4Feb 5 at 9:51 AM\nUnreal\n\nThe best Football gaming experience that I have ever had!!!\n\nHelpful | 2", "Fullerton.CobieJan 9 at 2:18 PM\nGreat Game Amazing Throwing Mechanics\n\nGame works and looks great on the Quest. The throwing feels better than in any other game I have tried. If youre looking for a football game in VR 2MD is really your only choice, but it is a good one.\n\nHelpful | 2", "FGLS1992Jan 9 at 4:37 PM\nPure fun\n\nIt needs more content, but the core game is fantastic. Please, keep the support coming!\n\nHelpful | 4", "mako3434Jan 12 at 5:07 PM\nFun\n\nIts fun but the mechanics suck. Be cool to have like the ability to make qb faster or throw farther\n\nHelpful | 1", "wyeezyFeb 3 at 4:13 PM\nMy favorite game\n\nLove this game!! Must own if you are a football fan!!\n\nHelpful | 2", "camdiniJan 11 at 11:33 AM\nReally fun but tracking throws need work\n\nEvery game Ill have a throw or two that throws badly due a tracking mishap not a huge deal but still would like to see an update to improve this\n\nHelpful | 3", "Fads2Jan 12 at 4:38 PM\nPretty dope\n\nPretty dope once you get used to the throwing motion, and make sure you dont have low ceilings. Especially if youre an athlete of any type \n\nHelpful | 2", "E2_ERROR12Feb 5 at 8:21 PM\nAdd this\n\nPlease make it where you can actually play football instead of a enemy touching you then getting out it will make it a whole lot better\n\nHelpful | 0\nDeveloper ResponseFeb 5 at 9:31 PM\n\nHi Error. If you're getting sacked, my main advice would be not to run out of the pocket if you haven't set up your defenders properly. Running is all about opportunity, not just making a mad dash down the field - make sure you've selected the right play, and your linemen give you an opening -- you can't outrun the other team, so you have to outsmart them. If we made running easy, there'd really be no point in setting up the perfect pass ;) . If you still find you're having trouble, reach out to us at the support link and we'll be happy to give you additional tips to help get more out of the game.", "ryman647Jan 26 at 4:35 PM\nSPORRRRRRRRRRRRRRRRRTS\n\nAs a non sport kinda person, I found a spot of amusement from this nonetheless!\n\nHelpful | 2", "TreyTroy2Jan 11 at 8:44 AM\nAmazing\n\nIf u like football u will love this game, it is a very good game when u learn the mechanics and i hi would the game works. For $15 it is a very fun game.\n\nHelpful | 2", "ChadbaccaVRApr 1 at 8:47 AM\nGreat game! Love the improvements!\n\nThis is the start of real football in VR! Its a lot of fun and intuitive and the play design feature is really fun to game plan. I look forward to seeing this continue to expand and one day become a true multiplayer VR rival to the Big M game on platforms!!\n\nHelpful | 1", "Jdevlin-Jan 10 at 4:52 PM\nSo much fun\n\nGreat football games. The throwing mechanics are great its almost like throwing a real football.\n\nHelpful | 2", "ninja2006May 8 at 5:03 PM\n2mdvr\n\nWas having fun and beat the 1st 5 teams...but the video broke up badly. So from the other reviews...I'm going to uninstall the game and give it another shot.\n\nHelpful | 0\nDeveloper ResponseMay 8 at 7:27 PM\n\nSorry to see you ran into a problem! If you're having issues after reinstalling, please reach out to us at contact(at)truantpixel or on twitter (@truantpixel) and we'll help you out.", "seahawk223Jan 15 at 5:44 PM\nVery great\n\nAfter I saw the trailer I knew I would love it was amazing. When I got my game it was not a disappointment it was fantastic.\n\nHelpful | 2", "danofthepeopleJan 31 at 7:35 PM\nNo control of difficulty\n\nThere's absolutely no way to control the difficulty level in this game. That alone makes it subpar. I get the pass off. I see the past ceiling through the air. They tell me I was sacked. F*** you f*** you f*** you....\n\nEvery play is a hail Mary. You can't win the championship, if one exists.\n\nBased on your response I would say that you're living in a f****** dream world. The game is nothing but a crap shoot. I stopped playing it like anyone else who buys it.\n\nNo, my issues were never resolved. The game is the money pit.\n\nHelpful | 0\nDeveloper ResponseJan 31 at 8:57 PM\n\nPlease contact Oculus support for a refund request.", "Ronnie5901Jan 11 at 10:25 AM\nFun & challenging game!\n\nI was only going to play a short time, but ending playing until my shoulder hurt!!!! I am now on IR!!! .\n\nHelpful | 4", "fp_3urtonJan 9 at 8:58 PM\nGreat game VR for the price !\n\nI love this game\nI cant imagine future gaming how awesome it would be\n\nSimple game but worth th price !\n\nGo Raiders Go\n\nHelpful | 4", "jr117Jan 12 at 8:09 PM\nMy game in Vr\n\nMan this game is off the charts I really enjoy football ready for the Super Bowl and when I have my party were playing this game later\n\nHelpful | 1", "jay.ell.714May 10 at 7:48 AM\nFun Football VR arcade style\n\nPure fun. Two minute drill... Go win the game.\n\nHelpful | 0", "mrguy111Jan 23 at 2:31 PM\nItssssss soooo good\n\nIts fun but simple and its fun that u can chose your own play but some times it glitches but its still a good game 10/10\n^v^\n\nHelpful | 2", "Poppop1971Jan 20 at 2:21 PM\nFun\n\nPerfect quick fun\n\nHelpful | 2", "Isaiah11oJan 12 at 8:26 PM\n\nAmazing game but our we gonna be able to run as the qb??!\n\nHelpful | 1", "budhorihemant1Feb 26 at 11:26 PM\nFgcduinvdyiojvxdtgv\n\nCccdtingtuonbcxffnkgdxv\n\nHelpful | 0", "Coltonfrog12Feb 9 at 5:57 AM\nAccidental\n\nI accidentally purchased this horrible game and 30 minutes later I tried to refund it and it said I played it for 2 hours or it was 14 days after I bought it so now Im $15 down and stuck with a boring game.\n\nHelpful | 0\nDeveloper ResponseFeb 10 at 9:56 AM\n\nwhy dont you contact oculus support? they will be happy to help you out. We have no power to grant you a refund, unfortunately. sorry you didnt enjoy the game.", "DuAlBuLlS75Jan 10 at 6:30 AM\n\nI actually learned stuff about football I just wish you could be offensive or someone besides quarterback\n\nHelpful | 2", "Bmac2346Jan 11 at 6:20 PM\nFootball\n\nIt is a great game if u love football get it but the throwing is a little hard but I Love this game\n\nHelpful | 2", "IcebergJDJan 9 at 8:47 PM\nCrowd Pleaser\n\nIt reminds me of the flick iOS football games. Simple but addictive. For the price its well worth it.\n\nHelpful | 2", "TheJaymzDeenJan 18 at 2:09 PM\nA lot of fun!!\n\nMy son absolutely loves this game! Fun for football lovers\n\nHelpful | 2", "IAMGROOTIAGJan 11 at 3:49 PM\nFun\n\nMore fun\n\nHelpful | 3", "malcomXXJan 14 at 5:41 PM\nNice\n\nLove it.best game ever\n\nHelpful | 2", "JoJo_SarutobiJan 26 at 1:03 PM\nGreat\n\nGreat\n\nHelpful | 3", "Caden_HDFeb 11 at 4:05 AM\nAmazing\n\nOne of the best football games out there\n\nHelpful | 2", "KLX2020Jan 14 at 7:43 PM\nGreat game\n\nIf they could make this a multi player game this would be really cool. Great job either way!\n\nHelpful | 0", "shellcrusher77Jan 28 at 6:26 AM\n\nIt is so fun\n\nHelpful | 1", "neal.constanteJan 11 at 10:28 AM\nJust fun!\n\nIf youre a fan of American football you gotta give this game a shot. Simple yet fun.\n\nHelpful | 2", "swcceo15Jan 11 at 7:42 AM\nJust gor a quest and\n\nThis is th key first purchase and it's alot of fun\nSimple but entertaining.\n\nHelpful | 3", "UltimateCringeJan 11 at 5:49 AM\nGood game :)\n\nI am not a big fan of football, although I love this game.\n\nHelpful | 3", "VunyzumFeb 7 at 8:14 PM\nNot very good\n\nYou can barley throw the ball. The way you throw the ball is way to hard it should be wiser then people would play it\n\nHelpful | 0\nDeveloper ResponseFeb 8 at 3:42 AM\n\nit sounds like youre having way more trouble than you should, as throwing the ball is very, very easy! most folks average a minimum of 20 yards, and you can customize your throw to match your particular style and get some insane distance. Reach out to us on twitter @truantpixel or via email at contact(at)truantpixel.com and well help you out.", "sunandsnow24Mar 15 at 5:19 AM\nI underestimated this game\n\nI'm a big football fan. This looked fun to me but I didn't realize how much fun it is until I took a chance and bought it with a store credit. I love how you can design your plays. And scrambling for yards is a blast. This is my new favorite game.\n\nHelpful | 1", "Bigfoot496Mar 18 at 4:37 AM\nGood. No, amazing!\n\nThis game is awesome. It is good because you can be a quarter back and throw the ball. The only thing I would want to change is to be a different position.\n\nHelpful | 0", "jamallbrownnMar 19 at 2:06 PM\nGreat concept but..\n\nGreat concept and fun to play but can quickly become frustrating as the mechanics arent quite fluid. The throwing motion isnt natural as you would think since the tracking cant go above your head. Its more of a pong or dart throwing motion which is absolutely unnatural. I will continue to practice cause I love football and want to love this game.\n\nRandom ideas for devs:\n-WR mode (swing arms to run/both triggers to catch)\n-Advanced throwing customization (fixed release points low, medium, high)\n\nHelpful | 0\nDeveloper ResponseMar 22 at 7:38 AM\n\nHi Jamal, developer here. Im glad you dig the game, regarding the issue youre having you absolutely can throw above your head, the only thing you need to be aware of is you cant hold your hand *behind* your head for very long (Less than one second) because the quest will lose precise tracking if you do. Otherwise 2MD supports almost any throwing style. Thise are definitely some good suggestions for possible additions, though the height slider in the practice field will actually let you customize the release point height in your throw, based on a range rather than a single fixed point. Thanks for playing, and take care!", "AF07Jan 11 at 12:04 PM\nAwesome\n\nNothing else to say its a great game\n\nHelpful | 2", "austibotJan 10 at 6:03 PM\nBest game ever\n\nIts simple and sometimes hard but so fun\n\nHelpful | 2", "alexhage3Mar 24 at 1:35 AM\nAmazing absolutely Amazing!\n\nTo me honestly this is the best game on oculus I really hope to see more games from them! Id love a basketball one but this game is so amazing and perfectly created! Would highly recommend!\n\nHelpful | 1", "gunnar.brockwayJan 30 at 5:36 PM\nSh*t tracking\n\nThe most bulls*** excuse for a tracking system ive seen its so garbage unreliable and ruined my experience\n\nHelpful | 0\nDeveloper ResponseJan 30 at 8:09 PM\n\nSorry to see you had trouble - the tracking system is actually quite accurate, and uses the Quest's inside-out to the fullest degree, along with a custom protocol that determines your throw angle and velocity. Make sure you're playing in a well-lit area, and your controller batteries are reasonably charged. There are already countless gameplay videos that demonstrate the system is reliable and consistent, with less than 5% of throws having any issues. If you're running into problems, we'll help get it sorted out. Feel free to email us at contact(at)truantpixel.com or on twitter @truantpixel and we'll help you troubleshoot the issue.", "kingkermallyJan 11 at 5:47 PM\nGood game\n\nCan you change the camera angle? I cant see my players\n\nHelpful | 2", "SypiethebossJan 14 at 1:20 PM\nAmazing\n\nLit really great\n\nHelpful | 2", "TexantylerJan 10 at 12:56 PM\n\nFun and my arm hurts but worth it\n\nHelpful | 2", "Ghostwarrior814Jan 12 at 1:38 PM\nSuper glitchy\n\nI dont recommend buying it right now, its very glitchy as in it wont let me pass the ball past 2 yards, and no Im not bad. I let my friends use it and they still cant do it either.\n\nHelpful | 3\nDeveloper ResponseJan 12 at 2:51 PM\n\nHi Ghostwarrior814-- I'm sorry to see you're having difficulties, however I can promise you the game isn't glitchy. It went through 2 QA passes prior to release, and our analytics actually show no errors since launch. :) The problem most likely lies elsewhere - Did you play with the release and power settings in the practice field? I recommend trying them at the default first (hit the big red reset button) before adjusting the sliders. If that's not the issue, it's a good idea to make sure you've reinstalled the game and updated your Quest to the latest firmware, additionally make sure you're playing in a well lit area but not in direct sunlight. Lastly, I'd be sure your controller batteries are reasonably charged. If you continue to have problems, you can reach out to us at contact(at)truantpixel.com or on twitter @truantpixel. We stand behind the stability and quality of 2MD, and we're happy to make sure you have a good experience with our game.", "CALEBFALLOUTJan 19 at 2:18 PM\nCant even play\n\nEverytime i start up the game its fine through the loading screen but when i get to the start it is just a bunch of black boxes and like black textures in front of me so i cant even see anything and the textures just arent working and i have tried resetting my oculus but it didnt work\n\nHelpful | 0\nDeveloper ResponseJan 19 at 4:22 PM\n\nHi CALEBFALLOUT. Sorry to hear you're having issues. I can assure you it's not normal behavior for the game, but that should really be clear at this point--if you're running into a bug that won't even let you start the title, something is going on that isn't a simple technical glitch (all Quest software is thoroughly tested for stability and performance for weeks prior to release), rather it's likely you've had an installation failure or memory corruption. I see you said you 'reset your oculus,' but did you fully power cycle it? More importantly, Have you tried simply uninstalling and reinstalling the game, since your installation is likely just corrupted? Better yet, why don't you reach out to us at contact(at)truantpixel.com or @truantpixel so we can help you out?", "sonnysausageboyMar 29 at 10:06 AM\nToo easy\n\nThe point of oculus games is to stimulate your boredom. This game however, is too easy. I just throw it to the same receiver every time, and win. Please figure out something to do so it isnt as easy???\n\nHelpful | 0\nDeveloper ResponseMar 29 at 11:40 AM\n\nWell, 2MD has a leaderboard so you can tackle the rest of the world once you've had your fill of playing against the AI. Also, did you earn every trophy? There are quite a few to unlock and some of them are fairly brutal. Did you earn your championship ring? lastly, quick note: the AI in the game does actually get harder as you progress through the heat, predicting your strategy and utilizing man and zone defense, so throwing to the same receiver loses efficacy in the later rounds. :) Good luck!", "epicsquirrel123Mar 22 at 3:40 AM\n\n\nSo good I live in England  and dont play football  but because of this game I want to start.\n\nHelpful | 1", "GagemanwasMar 21 at 1:44 PM\n\nThis is amazing I love how you can make your own plays and it is in vr\n\nHelpful | 1", "HunterKiller13Mar 15 at 8:14 PM\nEnjoying this game\n\nThis is pretty fun, look forward to a golf game like this.\n\nHelpful | 1", "R2-Brady-12Mar 14 at 3:00 PM\nGreat\n\nI love football and this is so simple I love it.\n\nHelpful | 1", "GTHobbesJan 9 at 6:32 PM\nLove it\n\nSo glad to finally have this game on Quest after having it on PSVR. The throwing mechanic is spot on, so much fun.\n\nHelpful | 2"]