{"App Title": "A Fisherman's Tale", "App description": "Bend and twist reality in the VR Awards Game of the Year 2019. A Fisherman's Tale is a mind-bending VR adventure in which being turned upside down and inside out is not merely a play on words.\n\nPlaying as a tiny fisherman puppet, you live alone in your tiny cabin, oblivious to the world outside. When your radio broadcasts a storm alert, you have to climb the lighthouse to turn on the light! As you leave your cabin with the help of some uncanny sidekicks, you realize what's waiting outside is not at all what you expected\n\n\tBreak multiple laws of physics in mind-bending puzzles!\n\tClimb the lighthouse before The Big Storm, with the help of uncanny sidekicks\n\tToy around with your model lighthouse, inside a lighthouse, inside a... is that another lighthouse?\n\tUncover the truth behind an unusually tall fisherman's tale\n\nBrought to you by Vertigo Games, A Fisherman's Tale is developed by Innerspace, co-produced with ARTE France supported by CNC, Ville de Paris & BPI France.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Narrative, Puzzle", "Languages": "English, Chinese (China), French (France), German", "Version": "1.056", "Developer": "InnerspaceVR", "Publisher": "Vertigo Games", "Website": "http://afishermanstale-game.com/", "Release Date": "November 27, 2019", "Developer Privacy Policy": "Vertigo Games\nHome About Jobs Contact Press Kits EULA\n \nVertigo Games Privacy Policy\n\nJuly 13, 2016\n\n1. OUR COMMITMENT TO PRIVACY\n\nScope.Vertigo Games, B.V. a company formed under the laws of The Netherlands (Vertigo, we, our, or us) respects and protects your privacy. This privacy policy (Privacy Policy) discloses the information that is collected by Vertigo or its third parties, the ways in which Vertigo, or our third parties processes and, sometimes, shares such information, and your rights and options with respect to such information.\n\nServices.This Privacy Policy covers information collected from users of any of Vertigos websites, applications, online services and other interactive properties, including for example, World of Diving, Arizona Sunshine, and Skyworld, that links to this Privacy Policy and all features, content, and other services that we own, control and make available through such websites, applications, services and properties (each a Service and collectively, the Services). Before using or submitting information to the Services please review this Privacy Policy carefully, as well as the terms of use related to each of the specific Services, which governs your use of the Services. A specific Service may have additional terms and policies regarding privacy for that specific Service, so in that instance, those additional privacy terms and policies will also apply. Should there be a conflict between this Privacy Policy and those additional privacy terms and policies, then the additional privacy terms and policies will control.\n\nAdvertisements, Content, Promotions and Services.The Services may include, without limitation, advertisements and promotions, displayed on or through such Services (collectively, Advertisements), text, images, photos, audio, music, videos, materials, comments, or other content displayed on or shared through the Services, whether provided by or on behalf of Vertigo, or uploaded or posted by users (collectively, Content), and sweepstakes, contests, rewards programs, special offers or other promotions (collectively, Promotions).\n\nOther Websites and Mobile Applications.Except where otherwise expressly indicated herein or on the Services, this Privacy Policy applies only to information collected on the Services and does not apply to information collected outside of the Services by other websites or mobile applications or by other third parties for which you may have a contractual relationship. Before using or submitting information to other websites or mobile applications or such third parties, please review their privacy policies carefully.\n\nMembers.Certain areas of a Service contain information intended only for users who create an account, join or otherwise register to use these areas on such Service (Members) and Vertigo reserves the right to limit these areas to Members. This Privacy Policy addresses Vertigos privacy practices relating to general use of the Services, as well as use of the Services by Members.\n\n2. INFORMATION VERTIGO COLLECTS\n\nVertigo collects the following types of information from users of one or more of the Services:\n\nPersonal Information.Vertigo may collect and process any information that you choose to enter on a Service or provide to Vertigo in any other way that would allow Vertigo to identify you or contact you (collectively Personal Information). The Personal Information that you provide will be used by Vertigo only in accordance with this Privacy Policy. Examples of Personal Information Vertigo may collect from you and use are:\n\na. the information you provide to become a Member;\n\nb. the e-mail addresses of those who upload, post or share Content on a Service;\n\nc. the names and e-mail addresses of those who communicate with Vertigo by e-mail;\n\nd. information you provide to Vertigo in surveys and polls on a Service;\n\ne. information you provide to Vertigo in an entry form for some Promotions offered on a Service and information provided by winners or recipients of those Promotions for a required background check or for tax purposes;\n\nf. in certain circumstances, payment and identity verification information, such as credit card number or other payment information in connection with a purchase made through a Service; and\n\ng. information about other people that you provide in connection with your use of a Service or Services or sharing Content.\n\nYou can choose not to provide Vertigo with certain Personal Information, but then you may not be able to take advantage of many features of a Service, such as posting comments, uploading or sharing Content, registering to use certain restricted areas of a Service, participating in Vertigos online community, entering or participating in Promotions, or receiving e-mail alerts or newsletters.\n\nAutomatic Information.Vertigo may collect and process certain types of information whenever you interact with Vertigo through the Services. Vertigo automatically receives and records your browser information, gameplay activity, motion sensor information, motion tracker information, operating system information, IP address, device ID, type of virtual reality equipment used, specific virtual reality platform, cookie information and the page you requested. This information will not be stored in a manner that is personally identifiable with you.\n\nAggregate Information.In connection with your visit or use of the Services, Vertigo may automatically collect usage information, such as the numbers and frequency of users and their characteristics and information about similar groups of users, certain age groups or users that live in a particular geographical area. This data is only used in the aggregate as a statistical measure and not in a manner that would identify you personally. Aggregate information generally is collected through the use of cookies and Web Beacons as discussed below.\n\nE-mail, Sharing and Communications.When you send an e-mail to Vertigo, either through the button on a Service or otherwise, Vertigo may retain your e-mail address and the contents of the e-mail that you send. When you post, upload or share Content through the Services or communicate with other users through a Service, Vertigo may retain copies of your Content. If you want to keep the information in your e-mail(s), posting(s), upload(s), share(s) or communication(s), private or proprietary, please do not send, post, upload, share, or communicate, such information or Content to Vertigo or through any Service. To help Vertigo make its e-mails more interesting and helpful, Vertigo also may receive a confirmation when you open e-mail from Vertigo if your computer or device supports this type of program.\n\nPurchases.If you interact with a Service which allows for the purchase or goods or services, Vertigo may retain the information regarding your purchase, but Vertigo will not retain any credit card information (although such credit card information may be retained by a third party which processes transactions for Vertigo).\n\nSocial Network Profile Information.If you interact with Vertigo, a Service, Content, Promotions, through a social network or by connecting your Member account with your social network account, then you may be permitting Vertigo to access certain information from your social network profile (such as your name, e-mail address, your friend list, photos, age, gender, location, birthday, social networking ID, current city, or the people/sites you follow). If you dont want to allow a social network to share such information with\n\nVertigo and other third parties, please review the privacy settings and instructions of the applicable social network before you connect your Member account with your social network account.\n\n3. INFORMATION COLLECTED BY THIRD PARTIES\n\nVertigo may allow third parties to display or provide Advertisements, Content, Promotions or other services on or through a particular Service, such as, for example, our website. Vertigo, its partners and/or advertisers, or social networks, may use third party servers to serve or present the Advertisements, Content, Promotions or the Services and to conduct research about the Advertisements, Content, Promotions or Services. Any of these third party servers may collect non-personal information, such as your browser, operating system, date/time of viewing, IP address, device ID, or clickstream data. Vertigo cannot control the activities of such third parties, websites or social networks.\n\nFurthermore, Vertigo may use third party services to enable online purchasing or e-commerce functionality, which involves the sale of Vertigos or third party products and services. These third party services may provide credit card or other payment processing services where they collect Personal Information and other financial information from you.\n\nPLEASE NOTE THAT THIS POLICY DOES NOT COVER THE COLLECTION AND USE OF INFORMATION BY SUCH THIRD PARTY SERVICES, SERVERS OR SOCIAL NETWORKS. PLEASE REFER THE PRIVACY POLICIES OF EACH SUCH THIRD PARTY.\n\n4. TRACKING TECHNOLOGIES\n\nVertigo or its third parties may use tracking technologies, such as cookies and Web Beacons, to collect information about users who visit or use the Services and view or interact with Advertisements, Content, and Promotions.\n\nCookies.Vertigo uses cookies to help you access and navigate the Services more efficiently and to statistically monitor how many people are using a Service.\n\na. A cookie is a small file or tool stored on your computer or device containing information that allows Vertigo to deliver customized information to you. Vertigo uses both session and persistent cookies on the Services. Session cookies are temporary bits of information that are erased once you exit your web browser or turn off your computer or device. Persistent cookies are more permanent bits of information that are placed on the hard drive (or other storage media) of your computer or device and stay there unless you delete the cookie. Persistent cookies store information on your computer or device for a number of reasons, such as retrieving certain information you have previously provided (i.e., username and password), helping to determine what areas of a Service you find most valuable and customizing such Service based on your preferences on an ongoing basis.\n\nb. You may set your browser to notify you of or decline the receipt of cookies. Certain features of a Service, including certain Content, or Promotions, may not, however, function properly or be available if your browser is configured to disable cookies. Many companies offer programs that help you to visit websites or mobile versions of such sites anonymously. While Vertigo will not be able to provide you with a personalized experience if Vertigo cannot recognize you, Vertigo wants you to be aware that these programs are available.\n\nWeb Beacons.During your use of a Service, you may encounter Web Beacons, which may come from Vertigo or from third parties that display or provide Advertisements, Content, or Promotions or services on such Service.\n\na. A Web Beacon (sometimes also called a web bug or clear gif) is a small graphic image in a web page, a web-based document or an e-mail message that generally allows the party that set the Web Beacon to monitor certain information about the viewer of the web page, web-based document or e-mail message and may allow access to certain cookies. Web Beacons are usually invisible to the user because they are very small (generally 1-by-1 pixel). In general, however, any electronic image viewed as part of a web page, including an Advertisement or Content, can act as a Web Beacon.\n\nb. Web Beacons on the website typically collect the URL of the page from which the Web Beacon originates, the type of browser requesting the Web Beacon, the IP address of the computer or device ID of the device to which the Web Beacon is sent and the time that the Web Beacon was viewed.\n\nc. Certain Web Beacons used by third party advertisers, content providers or other service providers may collect information that allows such third parties to determine how many people are viewing and/or clicking on certain Advertisements or viewing certain Content, Promotions or Services for purposes of helping these parties serve and manage their Advertisements, Content, Promotions and Services. These Web Beacons do not collect or store Personal Information but they may, however, be used in conjunction with cookies to identify certain aggregate information about users.\n\nDO NOT TRACK DISCLOSURES\n\na. Vertigo or its third parties may also use tracking technologies to collect information about your visits over time and across third-party websites or other online services. The Network Advertising Initiative (NAI) is a cooperative group of ad serving providers. The NAI has developed a set of privacy principles to which its members adhere. The NAI is committed to providing consumers with clear explanations of Internet advertising practices and how they affect you and the Internet generally. For more information about the NAI, third party ad servers generally and the opt-out options offered through the NAI, visithttp://www.networkadvertising.org/index.asp.\n\nSimilarly, for residents of the European Union, Your Online Choices athttp://www.youronlinechoices.euis written and funded by the internet advertising industry and supports a pan-European industry initiative to enhance transparency and control for online behavioral advertising. Please visit the website and select the country option for which you are a resident to find out more information about your opt-out options.\n\nb. California Business & Professions Code Section 22575(b) (as amended effective January 1, 2014) provides that California residents are entitled to know how Vertigo responds to Do Not Track browser settings. Vertigo does not currently take actions to respond to Do Not Track signals because a uniform technological standard has not yet been developed. Vertigo continues to review new technologies and may adopt a standard once one is created.\n\n5. HOW VERTIGO USES INFORMATION\n\nWhen you provide Vertigo with your Personal Information, Vertigo may use it to manage Vertigos registry of Members, facilitate communication between Vertigo and you and/or between Members of a Service, notify you of features or special events and provide you with other information Vertigo feels may be of interest to you. Vertigo also uses information collected to customize, analyze, adjust and improve our Services, Content, and Promotions and to meet Vertigos users needs and expectations. Vertigo also may use the information to oversee adherence to Vertigos guidelines for user content which are provided in the terms of use for the Services to enforce Vertigos agreements with you, to prevent fraud and other prohibited or illegal activities and for other legally permissible purposes. These uses of your Personal Information may include, without limitation, the following:\n\nPublic Areas.A Service may feature groups, discussions, member profiles, comment areas, blogs and similar areas where users can share information about themselves and their opinions, as well as post questions and Content that may contain Personal Information (Public Areas). Other visitors to a Service may view information posted in Public Areas. Further, Vertigo may include all or a portion of the information posted in Public Areas in the newsletters described in this Privacy Policy. By using the Public Areas, you hereby acknowledge and agree that any information you share in a Public Area (including, without limitation, Personal Information) is available to the public. Information you post to a Public Area may be viewed, accessed, or collected by, or disclosed to, third parties and may be used by others in ways neither you nor Vertigo are able to control or predict, including, without limitation, to contact you for unauthorized purposes.\n\nEmail, Sharing and Communications.A Service may offer the ability to share Content or communicate directly with other users via e-mail and other communications. If you use e-mail or other communications, Vertigo will use the recipients e-mail address or other means of identification in order to send the Content and Vertigo will also ask for your e-mail address or other means of identification. Vertigo does not use the recipients e-mail address or other means of identification for any other purpose unless the recipient gives Vertigo permission to do so.\n\nMember Areas.If you have access to certain areas of a Service because you are a Member (Member Areas), the Member Areas may contain groups, discussions, member profiles, comment areas, blogs and similar areas where Members can share information about themselves and their opinions, as well as post or share Content. Personal Information or Content you post or share through a Member Area may be viewed, accessed, or collected by, or disclosed to, other Members and may be used by other Members in ways neither you nor Vertigo are able to control or predict, including, without limitation, disclosure of your Personal Information or Content to the public or to contact you for unauthorized purposes. Vertigo uses the Personal Information you provide when registering to become a Member to send you Vertigo publications, information about Member benefits and special offers, features included in the Member Areas and other information that Vertigo believes is relevant and useful to its Members. By using the Member Areas, you hereby acknowledge and agree that any information you share in a Member Area (including, without limitation, Personal Information) is available to other Members and to Vertigo for use as provided herein.\n\nProfiles.If you register to become a Member of a Service, the information that you provide to Vertigo may be associated with one or more profiles, which may be stored on our or third party servers. These profiles, or a portion thereof, may be viewed by other Users of a Service, including, but not limited to those who are not Members of such Service.\n\nE-Newsletters.If you register at a Service or subscribe to any features or services, you may choose to receive a newsletter via e-mail from Vertigo or other notifications via a mobile application which may include information such as highlights from different areas on a Service, and information about new features, Content, Promotions or other Services. You can unsubscribe from the newsletter at any time by clicking on the manage your preferences link at the bottom of any e-mail newsletter sent to you and following the instructions. You also may unsubscribe at any time by logging in to the applicable Service where you created your profile and changing your preferences. Furthermore, you may elect to turn off notifications in a mobile application.\n\nPromotions.Often times, Promotions offered on a Service are sponsored by unaffiliated third parties. Information that you provide as part of an entry into a Promotion sponsored by an unaffiliated third party will be shared with the sponsor if Vertigo advises you of such in the Promotions official rules. Some Promotions also may require consent to the release of information contained within the entry form for background check purposes or tax purposes if you become a winner. You should carefully review the official rules of each Promotion that you enter as they may contain additional important information about Vertigos or the sponsors use of your Personal Information.\n\nFeatures and Services.Vertigo may retain other third parties and individuals to provide features and Services consistent with Vertigos Privacy Policy on Vertigos behalf. Examples include customer support specialists, web hosting companies, fulfillment companies (e.g., companies that fill product orders or coordinate mailings), data analysis firms and e-mail service providers.\n\nEditorial.Vertigo also may use your Personal Information in response to a solicitation for editorial, online or for marketing and promotional purposes in connection with such solicitation. If such information is used online, on a mobile application or in a telecast, no Personal Information, other than name, city and state, will be disclosed without your consent.\n\nSocial Network Features. Vertigo and the Content, Promotions and Services, may include features that connect to social networks and allow you to share or like Content, Promotions or Services with your friends or other users of the social networks. These social networks may collect information, such as your IP address, which page you are visiting on a Service, the videos you viewed, or the Content, Promotions or Services that you shared, and may set a cookie to enable the features to function properly. The social network providing the features on a Service may be able to collect information about you, even if you dont use those features. To control this sharing of information, please review the privacy policy of the relevant social network.\n\nEcommerce and Subscriptions.Vertigo may also use cookies to enable you to use a shopping cart if you want to enroll in a subscription or purchase goods or services while on a Service, to store your preferences associated with purchased goods or services or other Content offered from a Service and to offer you products, programs, or Promotions based on purchases, subscriptions and Service usage behavior that you and/or other customers have exhibited. If you purchase a subscription or goods and services through a Service, your Personal Information and payment information (other than credit card or debit card information) will be collected and stored by us with your account.\n\nVideos. Certain cookies that are set when some video products are accessed on a Service, called local shared objects or Flash cookies, may not be managed using the settings in your web browser. If you set your browser options not to accept cookies or local shared objects, you may not be able to take advantage of certain ecommerce Services, videos on a Service. You agree that Vertigo may share your viewing of videos with, or obtain information about your viewing of videos from, analytics providers and advertising partners and third-party social media sites unless you withdraw your consent.\n\nReports.The aggregate information collected by Vertigo may also be used to create profiles of the audience for a Service that include anonymous statistical demographic information but no Personal Information. This aggregated information is used to, among other things, determine trends and needs and supply market research to potential advertisers and partners to help them understand our Services audiences. For example, Vertigo may create a report that tells advertisers that thirty percent of Vertigos Members are females under forty years, so that they can determine which of their Content, Promotions or Services are most appropriate for Vertigos Members.\n\nAdministration.From time to time, in Vertigo s sole discretion, Vertigo may use your Personal Information to send you important administrative information regarding the Services or changes to Vertigos terms and policies. Because this information may be important to your use of the Services, you may not opt out of receiving such communications.\n\n6. WITH WHOM VERTIGO SHARES INFORMATION\n\nVertigo may share your Personal Information with third parties, as follows:\n\nAdvertisers.If you opt in to receive information about identified advertisers or their services or products, Vertigo may share your Personal Information with them. If you have questions about how these companies use your Personal Information, Vertigo encourages you to review and understand their respective privacy policies. You may at any time opt out of having your Personal Information as part of Vertigos marketing mailing list or otherwise.\n\nYou can send an e-mail tolegal@vertigo-games.com; or you can send mail to the following postal address:\n\nVertigo Games B.V.\nWeena 723, 3013 AM Rotterdam\nNetherlands:\nAttention: Legal  Privacy\n\nAdvertising Partners.Advertisements appearing on a Service may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer or device each time they send you an online Advertisement to compile information about you or others who use your computer or device. This information allows ad networks to, among other things, deliver targeted Advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by the Services and does not cover the use of cookies by any advertisers, each of whom maintain their own privacy policy.\n\nService Providers.Vertigo engages service providers to perform functions and provide services to us or on our behalf, including Promotions, Advertisements, and other programs. Vertigo may share your Personal Information with such service providers subject to obligations consistent with this Privacy Policy and any other appropriate confidentiality and security measures, and on the condition that the third parties use your Personal Information only on our behalf and pursuant to our instructions.\n\nPayment Processors. Vertigo shares your payment information with payment services providers to:\n\na. process payments,\nb. prevent, detect and investigate fraud or other prohibited activities,\nc. facilitate dispute resolution such as chargebacks or refunds, and\nd. for other purposes associated with the acceptance of credit or debit cards.\n\nIf such information is stored with Vertigo, Vertigo may share your credit or debit card number with payment services providers or card networks to monitor card transactions at participating merchants and track redemption activity for the purposes of providing card-linked services.\n\nGovernment, Law Enforcement or Third Parties.Vertigo may disclose any information, including without limitation Personal Information that Vertigo deems necessary, in its sole discretion and without your prior permission, to comply with any applicable law, regulation, legal process or governmental request. Vertigo also may exchange information, including without limitation Personal Information, with other companies and organizations for credit fraud protection, risk reduction and related activities or to protect the rights, property of safety of Vertigo and its agents, employees or affiliates or others. Vertigo reserves the right to disclose a users Personal Information if Vertigo believes the user is in violation of Vertigos terms of use, even without a subpoena, warrant or other court order.\n\n7. SALE OR TRANSFER OF INFORMATION\n\nIn the event of a sale, merger, liquidation, dissolution or sale or transfer of substantially all of the assets or equity of Vertigo or the Services, Personal Information and/or other information collected about you from the Services may be sold, assigned or transferred to the party acquiring all or substantially all of the equity and/or assets of Vertigo or the Service(s) in order to permit the party to continue the operation of the applicable Service or Services. Subject to your ability to opt-out, you consent to the sale and transfer of your information as described in this paragraph.\n\n8. ACCESSING, CORRECTING OR REMOVING YOUR PERSONAL INFORMATION\nIf you are a Member and would like to review or update your profile, please log in to and select the profile in which you would like to review, modify or delete information (i.e., the Personal Information you have provided to us). If you would like to delete your profile, please contact us at legal@vertigo-games.com.\n\nChoice.Vertigo respects the privacy of your Personal Information. If you tell Vertigo that you do not wish to have this information used as a basis for further contact with you, Vertigo will respect your wishes. You also may choose not to provide Vertigo with certain information, but that may result in you being unable to use certain features of a Service. You may instruct Vertigo to stop sending you certain promotional materials (e.g., e-mail messages, newsletters, postcards and letters) by following the unsubscribe instructions provided in those materials or by turning of the notification feature on a mobile application. Vertigo may, however, continue to contact you to provide service to your account. Please note that if you use more than one name or e-mail address when communicating with Vertigo or participating on a Service, you may continue to receive communications from Vertigo to any name and/or e-mail address which you have not specified in your opt-out request.\n\nCorrecting or Removing Your Personal Information.For Personal Information Vertigo holds, you can request that we correct the data if it is inaccurate or remove the data if we are not required to retain it by law or for legitimate business purposes. For example, under the Data Protection Directive (European Union Directive 95/46/EC of October 24, 1995) you are entitled to obtain information (a) confirmation as to whether data relating to you is being processed and information as to the purposes of the processing, the categories of data, and the recipients to whom the data are disclosed; (b) communication of the data undergoing processing and of any available information as to their source; and (c) knowledge of the logic involved in any automatic processing of data concerning you.\n\nVertigo may decline to process requests that are frivolous/vexatious, jeopardize the privacy of others, are extremely impractical, or for which access is not otherwise required by local law. Under the Data\n\nProtection Directive, we may charge you a 5 fee to comply with your request.\n\nVertigo provides you with the following options for correcting or removing your Personal Information from Vertigos database for marketing purposes:\n\nYou can send an e-mail tolegal@vertigo-games.com; or you can send mail to the following postal address:\n\nVertigo Games B.V.\n\nWeena 723, 3013 AM Rotterdam\nNetherlands:\nAttention: Legal  Privacy\n\nCanceling Your Account or Subscription.To cancel your account or subscription, you can: (a) e-mailcustomer@vertigo-games.com, subject Cancel My Account or Cancel My Subscription and include the e-mail address that you registered your account or subscription with (if different from the e-mail address youre sending the e-mail from); or (b) via your online Member account page. Remember that even after you cancel your account, copies of some information from your account may remain visible in some circumstances  where, for example, you have shared information with a third-party application or website. Vertigo may also retain backup information related to your account on our servers for some time after cancellation for fraud detection or to comply with applicable law or our internal security policies. Because of the nature of caching technology, your account may not be instantly inaccessible to others, and there may be a delay in the removal of the content from elsewhere on the Internet and from search engines.\nData Retention. Vertigo will retain your information for the period necessary to fulfill the purposes outlined in this Privacy Policy unless a longer retention period is required or allowed by law or unless otherwise limited by law.\n\n9. IMPORTANT DISCLOSURES, PRACTICES AND CONTACT INFORMATION\n\nThird Party Links.The Services may contain links to third-party web sites. Please be aware that Vertigo cannot control and is not responsible for the information collection practices of such web sites, which may differ from those of Vertigo. Vertigo encourages you to review and understand the privacy policies of these websites before providing any information to them.\n\nData Security.Vertigo (either itself or through third party service providers) maintains a variety of commercially reasonable physical, electronic and procedural safeguards designed to protect your Personal Information from unauthorized access and disclosure. For example, Vertigo uses accepted tools and techniques to protect against unauthorized access to Vertigos systems. You should be aware that Vertigo has no control over the security of other sites on the Internet that you might visit or with which you might interact even when a link may appear to another site from one of the Services. Vertigo wants you to feel confident using the Services but no system can be completely secure. Therefore, although Vertigo takes steps to secure your information, Vertigo does not promise, and you should not expect, that your Personal Information, searches or other communications will always remain secure. In the event of a breach of the confidentiality or security of your information, including your Personal Information, Vertigo will notify you as necessary and if possible so you can take appropriate protective steps. Vertigo may notify you under such circumstances using the e-mail address(es) that Vertigo has on record for you and/or by regular mail (if available). You also should carefully handle and disclose your Personal Information.\n\nChildren.The Services are intended for general audiences and are not intended for children under thirteen (13) years of age. Vertigo requires that only persons thirteen (13) years of age or older use any of the Services. By using any Service, you hereby represent that you are at least thirteen (13) years old. Vertigo does not knowingly market to, solicit information, accept service or collect information from children under the age of thirteen (13). A Service may ask users for their birth dates to ensure that such Service is not collecting information from children under age thirteen (13) or to identify when additional steps may need to be taken in connection with information collected from children under age thirteen (13). When a Service has actual knowledge that it collects information from children or offers a service directed toward children, it will comply with applicable laws, including the U.S. Childrens Online Privacy Protection Act of 1998. In the event that Vertigo learns that we have collected Personal Information from a child under age thirteen (13) without parental consent, we will delete that information as quickly as possible. If you believe that we might have any Personal Information from or about a child under thirteen (13), please contact us at:legal@vertigo-games.com.\n\nCertain Minors in the Netherlands.If you are a resident of the Netherlands, and you are a minor under the age of sixteen (16), then the consent of your legal representative is required for this Privacy Policy. Therefore, if you are under the age of sixteen (16), you represent to Vertigo that by using any of the Services, your legal representative has agreed (on your behalf and on behalf of such representative) to be bound by the terms of use for our Services and also consents to this Privacy Policy. If Vertigo learns that we have collected Personal Information from a minor under age sixteen (16), who is also a resident of the Netherlands and your legal representative has not provided consent, we will delete that information as quickly as possible. If you are a legal representative of a minor under the age of sixteen (16), who is a resident of the Netherlands, and believe that we might have any Personal Information from or about such minor, please contact us at:legal@vertigo-games.com.\n\nChanges to this Privacy Policy.At any time without prior notice, Vertigo may update this Privacy Policy to reflect changes in Vertigos practices. When Vertigo posts changes to this Privacy Policy, Vertigo will revise the Last Updated date at the top of this page. Vertigo encourages you to bookmark this Privacy Policy and to periodically review it to inform yourself of changes to it or any of Vertigos other policies. Any changes to Vertigos Privacy Policy will become effective upon Vertigos posting of the updated policy.\n\nUse of any Service that inks to this Privacy Policy constitutes your acceptance of the terms of this Privacy Policy then in effect.\n\nCalifornia Privacy Rights.If you are a resident of the State of California, United States (California Users), in addition to the rights set forth in this Privacy Policy, you may have certain additional rights. You generally have the right to request information from Vertigo regarding the manner in which Vertigo shares certain categories of Personal Information with third parties for their direct marketing purposes. California Civil Code Section 1798.83 permits you to request information regarding the disclosure of your Personal Information by us to third parties for the third parties direct marketing purposes. Under the law, however, a business is not required to provide this information if it adopts and discloses to the public (in its privacy policy) a policy of not disclosing customers personal information to third parties for their direct marketing purposes unless the customer first affirmatively agrees to the disclosure, as long as the business maintains and discloses this policy. Rather, the business may comply with the law by notifying California Users of their rights to prevent disclosure of personal information and providing a cost free means to exercise that right.\n\nPlease note that whenever you opt in to receive future communications from a third party, your information will be subject to the third partys privacy policy. If you later decide that you do not want that third party to use your information, you will need to contact the third party directly, as Vertigo has no control over how third parties use information. You should always review the privacy policy of any party that collects your information to determine how it will handle your information.\n\nPlease note that Vertigo is only required to respond to one request per customer each year. Vertigo is not required to respond to requests made by means other than through this e-mail address:legal@vertigo-games.com.\n\nCalifornia residents who are minors under eighteen (18) years old may request the removal of any information that they posted to a Vertigo Service by contactinglegal@vertigo-games.com. Upon such request, Vertigo will anonymize or remove from public view any content posted by a minor to a Service, unless required by law to retain such content or information.\n\nUsers from Other Jurisdictions.By visiting a Service, submitting information or using any of Vertigos Content, Promotions or Services, you acknowledge that you accept the practices and policies outlined in this Privacy Policy and consent to having your data transferred to and processed on computers located outside of your state, province, country or other governmental jurisdiction where the data protection laws may differ from those in your jurisdiction. If you do not accept this Privacy Policy, please do not use the Services. The Services are controlled and operated by Vertigo from the Netherlands. If you are not a resident of the Netherlands or you are located outside the United States and choose to provide information to Vertigo, please note that Vertigo may transfer the information, including Personal Information, to the United States and process it there unless otherwise prohibited by law. Your acceptance of this Privacy Policy followed by your submission of such information represents your agreement and consent to that transfer. Vertigo does not represent or warrant that any Service, or any part thereof, are appropriate or available for use in any particular jurisdiction. Those who choose to access a Service do so on their own initiative and at their own risk, and are responsible for complying with all local laws, rules and regulations. Vertigo may limit the availability of the Content, Promotions or Services, in whole or in part, to any person, geographic area or jurisdiction that Vertigo chooses, at any time and in Vertigos sole discretion.\n\nNo Rights of Third Parties.This Privacy Policy does not create rights enforceable by third parties.\n\nContacting Vertigo.If you have any questions about this Privacy Policy, the practices of the Services or your dealings with us, please feel free to contact Vertigo at:\n\nVertigo Games B.V.\nWeena 723, 3013 AM Rotterdam\nNetherlands\nAttention: Legal  Privacy\nlegal@vertigo-games.com\n\nCopyright  2008  2018 | Vertigo Games B.V. & Vertigo Arcades B.V. All Rights Reserved | Privacy Policy\nHome\nAbout\nJobs\nContact\nPress Kits\nEULA\n Vertigo Games B.V. 2018", "Developer Terms of Service": "Vertigo Games\nHome About Jobs Contact Press Kits EULA\n \nEULA\n\nVERTIGO GAMES  END USER LICENSEAGREEMENT\n\nLast Updated: December 4, 2016\n\nBY ACCEPTING THIS END USER LICENSE AGREEMENT (EULA) OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THE EULA IN ITS ENTIRETY. IF YOU DO NOT AGREE TO THE EULA, DO NOT ACCESS OR USE OUR SERVICES.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THIS EULA. MAKE SURE TO REVIEW THIS EULA WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nVertigo Games, B.V. (Vertigo, we, us or our) is pleased to provide you access to, and use of software, websites, applications, and content (collectively, the Services). These EULA (Terms) apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with Vertigo for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nVertigo reserves the right to change or modify these Terms on a going forward basis at any time and in our sole discretion. If Vertigo makes changes to these Terms, we will provide notice of such changes as appropriate, such as providing notice through the Services and/or updating the Last Updated date at the top of these Terms. Your continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with theEnglish version, the English version controls.\n\nEligibility\n\nYou must be at least 13 years of age to access and use the Services. There is no exception to this requirement. Vertigo does not knowingly collect any personal information from children under the age of 13. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legal parental or guardian consent, and that you are fully able and competent to understand and accept this EULA as a binding contract and to abide by all Terms.\n\nSoftware Updates\n\nCertain software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our community standards, agreements, laws, regulations or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\nYour Use of Services\n\n3.1Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (Software and Content), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by Vertigo or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n3.2Availability. The Software and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n3.3Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\nPurchases\n\n4.1Account. You may be required to be a registered user in order to purchase some Services. You are responsible for all charges incurred in connection with your account. Vertigo may attempt to collect unpaid charges, including by attempting additional charges to your payment instrument, use of collections agencies and any other legal means. If you decide to cancel your account, Vertigo reserves the right, subject to any limitations under applicable laws, to collect fees, surcharges, or costs incurred before cancellation. Any delinquent or unpaid accounts must be settled before Vertigo will allow you to register again.\n\n4.2Virtual Items. Your purchase of a virtual item or in-game currency within the Services is a payment for a limited, non-assignable license to access and use such content or functionality in the Services. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Services can only be used in connection with the Services where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Services for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n4.3Pricing and Payment. We may accept various forms of payment, including credit and debit cards, and additional terms with your payment provider may apply. Prices are subject to change without notice. We reserve the right to refuse or cancel orders at any time and in our sole discretion.\n\n4.4Taxes. If your purchase or use of the Services is subject to any type of use or sales tax, duty or other governmental tax or fee (Taxes), then we may charge you for those Taxes. Applicable Taxes may be presented at checkout. You are responsible for any Taxes due with respect to your use of the Services.\n\n4.5Content Cancellations; Returns. All purchases of digital content are final except as required by law. Once you purchase Content, we encourage you to download, install and/or access it promptly.If you are located in the EU, you consent that the supply of the digital content may begin immediately following the completion of your purchase and you acknowledge that you therefore will lose any statutory rights you may have to withdraw and receive a refund. If you are unable to download, install or access purchased content, please contact us atsupport@vertigo-games.com.\n\nCode of Conduct\n\nYou agree to abide by this code of conduct during multiplayer or co-op gameplay sessions:\n\n(a) Do not use derogatory, demeaning, malicious, defamatory, abusive, offensive, hateful or discriminatory language.\n\n(b) Do not harass, bully, threaten, harm or cause discomfort for other users. For example:\n\nUse of hate speech or racial, ethnic, sexist, homophobic or religious slurs;\nHarassment of a specific person (repeated flaming or personal attacks); or\nDisclosing any personal or private information of another person, or any confidential information pertaining to a business, without consent.\n\n(c) Do not promote, plan, glorify or engage in any illegal activity or otherwise make available content that would encourage or provide instructions for an illegal activity. These topics include but are not limited to crimes relating to drugs, drug paraphernalia, rape, solicitation of a minor, computer hacking, counterfeiting and fraud.\n\n(d) Do not impersonate other persons, including fellow users or Vertigo staff or attempt to obtain sensitive information from other users. For example:\n\nFalsely claiming an official title or to hold position relating to Vertigo;\nFalsely claiming the representation of another business or websites;\nFalsely claiming to be a law enforcement officer; or\nSoliciting passwords or personal information from other users.\n\n(e) Do not engage another user under false pretenses or otherwise defraud another user.\n\nVertigo, at its sole discretion, may issue a warning or expel User from the Services for violations of the Code of Conduct.\n\nUser Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Services, you grant Vertigo a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Services. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Vertigo the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our community standards.\n\nVertigo does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Vertigo has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nServices Ownership and License\n\nUser acknowledges that Vertigo retains all right, title and interest to the Services, the Services design and documentation, and the intellectual property rights therein and thereto (including without limitation, all patent rights, design rights, copyrights and trade secret rights).\n\nUnless otherwise indicated, the Services are the property of Vertigo or our licensors and are protected by copyright, trademark and other laws of The Netherlands and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\nVertigo Games and the Vertigo logo (Vertigo Marks) are trademarks or registered trademarks of Vertigo Games, B.V. The Vertigo Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, including as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder.\n\nDisclaimer of Warranty\n\nYOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK. AS BETWEEN YOU AND VERTIGO, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN AS IS AND AS AVAILABLE BASIS AND VERTIGO EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, VERTIGO DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS; (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY VERTIGO WILL CREATE A WARRANTY.\n\nYOU FURTHER ACKNOWLEDGE AND AGREE THAT VERTIGO IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OR OFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL VERTIGO BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURY OR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATED CONTENT IN THE SERVICES OR TRANSMITTED TO ANOTHER USER, OR ANY TRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINE OR OFFLINE.\n\nTHE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\nIndemnification\n\nYou agree to defend, indemnify and hold harmless Vertigo and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, Vertigo Parties) from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Services; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Vertigo or a third party in relation to the Services, (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\nLimitation of Liability\n\nTHE VERTIGO PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SERVICES, EVEN IF AN VERTIGO PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE VERTIGO PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SERVICES. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU.\n\nPrivacy\n\nUser accepts and agrees to Vertigos Privacy Policy as found athttp://vertigo-games.com/vertigo-games-b-v-privacy-policy/\n\nNo Assignments\n\nUser may not assign or otherwise transfer any rights or obligations under this EULA.\n\nSeverability\n\nIf a court finds any provision of this EULA invalid or unenforceable, the remainder of this EULA shall not affect the validity and enforceability of any remaining provisions.\n\nNon-waiver\n\nThe failure to exercise any right provided in this EULA shall not be a waiver of prior or subsequent rights.\n\nGoverning Law\n\nThis EULA shall be governed in accordance with the laws of the country of The Netherlands. The parties consent to the exclusive jurisdiction and venue of the courts located inThe Netherlands in any action arising out of or relating to this EULA. The parties waive any other venue to which either party might be entitled by domicile or otherwise.\n\nAttorney Fees and Expenses\n\nIn a dispute arising out of or related to this EULA, the prevailing party shall have the right to collect from the other party its reasonable attorney fees and costs and necessary expenditures.\n\nModifications to the Services\n\nVertigo reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will Vertigo be liable for the removal of or disabling of access to any portion or feature of the Services.\n\nTermination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\nCopyright  2008  2018 | Vertigo Games B.V. & Vertigo Arcades B.V. All Rights Reserved | Privacy Policy\nHome\nAbout\nJobs\nContact\nPress Kits\nEULA\n Vertigo Games B.V. 2018", "Space Required": "2.03 GB"}



["5 stars\n76%\n4 stars\n17%\n3 stars\n4%\n2 stars\n1%\n1 star\n1%", "csonisJul 25 at 1:55 PM\nOut of the Box puzzler, but to short.\n\nI picked this up on a sale and it's definitely worth $10, but probably not $15. Simply because it's short (1 to 1.5 hrs maybe)\n\nThere are four chapters and the fourth chapter was the one that really had me boggled (and it will also confuse you as the walkthroughs online also has the players really confused too). Chapters 1 through 3 are not as tough but will certainly make you think outside the box.\n\nThe graphics are outstanding, and the effects in the game I think will really blow your mind.\n\nIt's definitely a great new spin on puzzle games that I have never seen before.\n\nI do highly recommend this game, those as U said above I would only pick it up on sale for $10 before I bought it for $15. Especially since there's no replay value in the adventure that I can see.\n\nHelpful | 15", "Christina_AlexisMay 21 at 9:06 PM\nLove this game!\n\nI purchased the Oculus Quest in order to play a different escape room type game. After I finished the other one, I was sad thinking there wouldnt be anything like it. And I came across this game! So delightful! The story, graphics, and puzzling out what to do next were all great and I loved it. Although it did take me a little while to solve, I do wish it was a bit longer and had more chapters! I want more games like this! A big thank you to the developers for putting the hard work into this. It was definitely noticed and appreciated.\n\nHelpful | 75", "gley_DJul 6 at 5:22 PM\nSuch a unique game\n\nI loved this game! I played it all the way through in 2 days. It's not very long, which I wish it was because I loved it so much! My favorite kinda games are puzzle games and story games, and this brings both together into one masterpiece. Makes you think and it's different in a way that other games haven't done this before. You have to think outside the box playing this game. You can play with hints or without hints which is nice that they give you a choice, because if kids are playing you can turn them on. Very entertaining, I would love another game like this from this company.\n\nHelpful | 9", "pheurum8 days ago\nWhat an amazing experience\n\nThis was for me more than just a game... yes, it's short but it's absolutely worthy. The main idea is absolutely brilliant: an infinity mirror. Love the graphics, love the story, love the music. When I play this kind of games in Oculus, I prefer to enjoy every little aspect of it. Try to explore everything and enjoy the whole experience, more than focus just in solving the puzzle.\n\nHelpful | 0", "dandybloomer15 days ago\nOne of the Most Charming Games\n\nThe first thing that caught my attention about this game was the art style. The wonderfully unique design really lends itself to the platform and suites the story and tone perfectly. This game picks up the slack that a lot of VR games leave in terms of narrative. The great voice acting, fun characters, and playful puzzles really make this a must play for anyone who enjoys puzzle games or creative challenges.\n\nIf youre looking for something with replay value or something arcade-like, you should look elsewhere. If you want a game with oodles of charm, delightfully fun puzzles, and a creative vision that delivers from start to finish, then this is for you. I just finished the game, and my face is sore from smiling the whole time I was playing it.\n\nHelpful | 0", "light60617 days ago\nUnique game & charming storytelling\n\nI really find the game to be captivating with how they are able to execute the same scene in miniature & giant all simultaneously. The way you can mix all 3 worlds together is so clever. And the narration was well done & very charming without being too extra.\n\nAlso I appreciated that when I got stuck it would offer tips after some time to help me through. Really enjoying it so far!\n\nHelpful | 0", "Hemo.liJul 20 at 1:11 AM\nBest unique and adventure game, but...\n\nComments for developers:\n\nThank you for such a unique experience and story we Loved every minute.\n\n1- We would love if the game was longer.\n\n2- Graphics at beginning is like a cartoon which is fair great. But at the end the graphics of the house completely much better but connot interfere with the environment.\n\nIf the whole game graphics was same as the house at the ending would be much better. Not sure If the quest can handle these graphics but if it can it would be a superb game.\n\n3- If there was more ideas and missions to do while driving the boat.\n\nMaybe like someone else was with you in the boat...fishing from the boat.. trying to save someone drowning.. driving to another bigger boat.\n\nOver all It is completely one of the best and unique adventure. You must try it because this game is very unique and you will enjoy it.\n\nThe puzzles are not very hard to solve like a real life problem which is actually great. Besides that if you spent more time not being able to discover the puzzles it will talk to you and gives you hints. Which is much better than other puzzles gaming. So dont worry you wont get bored and stucked in a level asking other people how to finish it.\n\nHelpful | 2", "GastercrafterWD22 days ago\nSome of the most fun Ive had in VR.\n\nThis game was very enjoyable bottom line. The atmosphere is really pretty, the visuals are great and I wasnt able to tell any downgrades that has to be made to make it run on quest, the puzzles were very fun tricky and a bit hard but despite that they were still extremely enjoyable. The characters were awesome additions and the narrator was overall my favorite part of the game. The story was simple yet very enjoyable, and it felt like I was really a marionette. The ending looked beautiful with its realistic scenery and I would definitely recommend this game to any of my friends that like puzzles and/or beautiful atmospheres. The concept of being a marionette controlling a marionette that also controls you was a great idea and was executed perfectly. The only downsides I had were that some of the instructions werent clear enough despite the hints and the claw was extremely buggy. Otherwise 10/10 game would play 100 times again. Thank you for this great game and I hope you bring more awesome games like this to the market soon!\n\nHelpful | 1", "Connacemox4 days ago\nUnique\n\nEnjoyable tale with nice characters. Twisting reality, it makes you think out of the box in order to solve it and had me thinking pretty hard in some chapters in order to find the solution. The music as well as the graphics are beautiful. Had a quite nice time.\n\nWould be a lot better if it was longer, since with these kind of puzzles it has so much more potential.\nThere is no replay value to it and it being quite short, it kind of dissapoints me on that matter.\n\nHelpful | 0", "awrooseveltMay 15 at 5:32 PM\nThis is what VR is all about!\n\nI love this game. Its like being in an episode of Twilight Zone. The presentation of the story is so well thought out. The moment, I start to wonder what should I do?, theres a clever bit of dialog that permeates the atmosphere. I really hope that the developers continue to make more games like this.\n\nHelpful | 21", "MaelwolfApr 19 at 10:43 PM\nA Masterpiece\n\nWhat an amazing experience! I cant say the puzzles were particularly challenging, and the game is very short, yet it remains 5 stars for me and is absolutely worth the purchase. It is just so interesting and unique, and talk about polished. This just blew me away. I hope someday we get some sort of sequel.\n\nHelpful | 69", "HafKastJul 15 at 11:23 AM\nFINCEPTION\n\nA mind-puzzling story that I already miss dearly. Wishing for more chapters, and yet Im still gratefully satisfied by The End. This was a tremendous step for virtual reality games in such a simple, yet complex way. It will go without saying that I look forward to the next title Innerspace VR has to offer.\n\nHelpful | 1", "Firefan26419 days ago\nAn amazing game, but not a puzzle game\n\nThere are 4 levels each with about one puzzle the reason I say its not a puzzle game is cus none of them had me stumped and it was very clear and obvious what to do, like there is a pipe puzzle but instead of figuring out where to put the puzzles it tells you, very annoying. However the story is amazing great themes and a very polished game, also a tad short but it still works\n\nHelpful | 0", "virtualmandala11 days ago\nLoved it until the final puzzle\n\nThe mechanics on the final puzzle are garbage and frustrating. Took me out of the story since I had to search online to figure it out. Apparently, a lot of people felt the same way. Other than that, excellent story and puzzles.\n\nHelpful | 0", "take2walt19 days ago\nFantastic experience\n\nGreat experience! I\n\nwanted to play a puzzle game\nthat uses such an illusion!\n\nIt's a short story,\nbut it will surely please you.\n\nThank you\n\nHelpful | 0", "Ekert91Jul 30 at 12:07 AM\nShort but amazing\n\nDon't rush it, disable the hints and you will have a fantastic time with this little puzzle game. It is rather short though.\n\nGoes on sale (-33%) regularly.\n\nHelpful | 1", "awarth2217 days ago\nSpoilers*50 year old & surprised!\n\nI hadnt bought this game because watching the trailer alone made me feel a little motion sick. But I just finished playing The Room and wanted something lighter. And what a wonderful find this was! The graphics are crisp (especially the waves), had no motion sickness at all, and a delightful story with genius triplication of your play area. It did get a little glitchy in last area lighting the lanterns but the fish ride made it all worth it! Thank you for taking the time on the details!\n\nHelpful | 1", "RollinVR23 days ago\nSuper!\n\nSuperb voice over, superb originality, superb characters.\nIt really makes you sit and think after you finish the game! Great! Get it!\n\nHelpful | 0", "Tomaris14 days ago\nNice but short\n\nIt was a nice but very short game. It was my first VR game and I love it.\n\nHelpful | 0", "Shib_bers7 days ago\nWorth $5\n\nThis game has some decent features of design and artistry. The game start to finish is probably 1.5-2 hours. Most of that time is spent listening to the story and not actually invested in solving puzzles. There are probably a total of 20 puzzles which doesnt make for much of quality game. I asked for a refund because there is no additional gameplay to come back through and do it multiple times. Very much a waste of money if you pay beyond $5.\n\nHelpful | 0", "Yajie25 days ago\nAmazing game concept!\n\nThat's the VR game I was looking for, the one that uses the 3d space as the core concept, the one that is beyond expectation!\n\nHelpful | 0", "AustinMLJun 27 at 9:59 AM\nGreat little puzzle game with charm\n\nAs others have said it's not terribly hard or long but it is very well done. I loved it from beginning to end and will revisit it periodically for sure. It's a great experience to show people new to VR if wave shooters or rythym games are \"too much\". Can't wait to see what they do next!\n\nHelpful | 1", "turbojwmJul 25 at 7:48 PM\nLove this game!\n\nI thought this game was a completely mind blowing concept. I am looking forward to playing it again and possible sequels.\n\nHelpful | 0", "SuperstinksJul 7 at 7:41 PM\nAmazing but really really short\n\nThis is a must play, but it's incredibly short, when it ended I was actually kinda mad because I was having such a good time and it was just over, not sure it even took me 2 hours. But it's a definite experience\n\nHelpful | 0", "wtfbroMay 27 at 10:15 AM\nA stunning work of art!\n\nDear whomever made A Fisherman's Tale:\n\nThank you SO MUCH for that sublime, incredible, beautiful experience.\n\nThis should win all the awards.\n\nI am simply dumbstruck with awe. At your imagination, your artistry, your technical genius.\n\nTHANK YOU SO MUCH.\n\nAn instant classic, gorgeously made.\n\nHelpful | 3", "igorfvieiraJul 4 at 10:08 PM\nBeautiful piece of art\n\nThe puzzles are not too complicated but I loved it anyway. The campaign has the right amount of time, it's beautiful and really fun.\n\nHelpful | 2", "BeldarakJun 8 at 3:51 PM\nNot perfect but not far\n\nGreat game. It's beautiful and very charming, the voice acting (played in FR) was nice and conveyed a lot of emotions. It's just great to move around that cozy little lighthouse (you really feel at home) and listening to its charming and weird characters. The mechanics are solid and every interactions works like it should in VR (pulling levers, grabbing things...), even tough the physics can sometimes be a little buggy.\n\nToo bad it's very short and the last puzzle was very frustrating (mainly due to physics issues), not even sure I completed it the way it's supposed to be done. One last flaw is the constant nagging of NPCs/narrator while you're trying to concentrate on the puzzles. If you played Ocarina of Time: we're at ten on the \"Hey-Listen\" ladder :D\n\nCan' wait to see those guys future projects :)\n\nHelpful | 4", "payam.pourghassemJul 19 at 1:53 PM\nAmazing game make more please!!\n\nGreat game overall I just wanted it to keep going. In my mind I think it was a little too short but otherwise amazing game.\n\nHelpful | 0", "kathryncrabtree1Jul 24 at 1:18 AM\nLove, love, love this game\n\nAmazing graphics and a lovely storyline. I was sad when it finished. I would definitely recommend.\n\nHelpful | 0", "ZliciousJul 14 at 1:29 PM\nFavorite\n\nThe graphics may be subpar, but the game is one of my favorites I've played in Oculus. Very creative and unique take on a problem solving game.\n\nHelpful | 0", "ZEBBO79Jul 2 at 8:24 AM\nA fishamans tale\n\nFantastic game loved it\nMy only problem was it ends very abruptly, it lets you know there is 5 chapters and when u finish the fourth thinking u have 1 more to go, NOPE ,EPALOG, THE END. \n\nHelpful | 0", "Tony.DiIuorioMar 14 at 1:17 PM\n5 certainly, but way too short!\n\nIt's over by the time you get going! This puzzle game based around a children's \"sea captain\" story is VERY cool: the main mechanic of the game revolves around the fact that you play a puppet in a scale model of a lighthouse.\n\nWhen you look inside the model on your table, you see a little version of your character inside it. And when you look out the window, you see a giant version of your character peering in!\n\nIt's mind-bending!\n\nWithout giving anything away, you use this infinite regression (models within models within models all the way down, or up) to shrink and grow objects for use by various versions of your Captain.\n\nThe \"tutorial\" is waking up in your lighthouse bed upon game-load while the narrator explains \"this day feels strange for some reason.\"\n\nIn case you get stuck there's a single option in settings: \"Hints on/off\" -- the hints are gentle nudges by the narrator, the longer you stumble around, the more specific his nudges become.\n\nNo wonder it won awards.\n\nAnd it's cheap which makes up for the few hours it takes start to finish. But such a cool few hours.\n\nHelpful | 70", "rkstagerJul 24 at 9:31 PM\n\nExcellent game!!! Would highly recommend!!! This is what VR was made for.\n\nHelpful | 1", "TheDrunkNorwegianJun 22 at 1:54 PM\nAmazing VR experience!\n\nI just got to say, this is more an experience than a game! The story and narration is amazing, the atmosphere is engaging and the controls are perfect! It just feels like your in there, and just keeps you engaded all along the story!\n\nHelpful | 0", "DroculahJun 28 at 10:09 PM\nExcellent, but Short\n\nLove the game. I'm not usually a huge puzzle game person, but these were fun. Not too hard, not too easy. The concept was really interesting. The setting and look is lovely. But, like many games on the Quest, it's short and overpriced. But...if you're going to deal with that for any game on the Quest, might as well be this one!\n\nHelpful | 0", "DefrostmodeJul 19 at 7:27 PM\nUnique and excellent puzzle game!\n\nSomething I haven't seen done before or since. Definitely worth the purchase!\n\nHelpful | 1", "Twissy-87Jun 24 at 12:39 PM\nA work of Art!!\n\nIt's not only outstandingly beautiful but the way it works and plays with dimensions and abstraction it's absolutely genious.\nIt's a little slow at times but the story needs it.\nTotally recommended!! \n\nHelpful | 1", "gabriel.rosalesApr 3 at 10:07 PM\nShort, but a must have on the quest\n\nIf you like solving puzzles, and unfolding creative stories youll love this game.\nIt is also very well put together with some of the nicest graphics Ive seen on the Quest.\n\nI loved it! I rarely write a review, but I liked it so much I felt compelled to.\n\nIt is short, and has low replay ability, so look elsewhere if thats what you are after.\n\nIt is also very reasonably priced, specially for one of the nicest games in the Quest, so I think it is fair, it is only it is such a fun well rounded and immersive tale, you are left wanting more of it.\n\nHelpful | 16", "grantdodgeJun 3 at 12:40 AM\nShort, but well worth the money\n\nThis game takes everything that is amazing in VR and puts you through a soothing and interesting story. It tests the brain a little bit, but not too tricky to figure out, just listen to the dialogue and it pretty much walks you through it. Great physics, amazing attention to detail, not too long but not too short. I strongly reccomend buying this game\n\nHelpful | 0", "AzbagJun 10 at 5:26 PM\nBeautiful\n\nWhat a beautiful little game! I got completely immersed into this story by both the game play (adventure/puzzle) and the narrative. If you are not into fishing don't be put off by the games title (as my wife was). Looking forward to more titles like this.\n\nHelpful | 1", "mcalo42Jun 12 at 8:20 PM\nFun and interactive\n\nInteresting, immersive and entertaining puzzle game. Its pretty short but well worth it. Some of the puzzles are challenging but intuitive. The hints were helpful but not necessarily giveaways or spoilers. A pleasant and fun VR game.\n\nHelpful | 1", "ryangubJul 16 at 4:14 PM\nLoved the story but one time play only\n\nGreat story. Fun puzzles and trippy VR. I would recommend trying it. But only giving it four because there is no reason to play it more than the one time. Tho the one time is great\n\nHelpful | 0", "The_CorpseJul 14 at 6:45 AM\nGreat. Must have.\n\nThis is an amazing game evne though it is relatively short it's so much fun and has some replayablitiy. It's great for showing off what vr can do to newcomers while still being fun for you.\n\nHelpful | 0", "salamo.hamad.35Jul 21 at 7:28 AM\nNice experience\n\nLove the voices and aesthetics of the game\n\nHelpful | 0", "PaulAshbyJul 21 at 12:27 PM\n\nGood fun game wish it was longer\n\nHelpful | 0", "Crawford_FamilyJul 20 at 10:27 PM\nInnovative, fun, and challenging\n\nGreat game. Escape room like.\n\nHelpful | 0", "simmyjellersJun 28 at 6:30 AM\nWonderful\n\nOf course I always wish everything was longer. But this is an amazing experience for VR and a truly unique and fun puzzle game. Thank you\n\nHelpful | 0", "andrea.hofiusJul 10 at 7:10 PM\nGreat but too short\n\nThe art style, story, and concept behind the puzzles are all unique and A+ level ideas. However, the game is too short and the puzzles too simplistic. I honestly thought I was wrapping up the tutorial when the game ended. The concept of the game is very charming but unfortunately the content is not on the same level. Great game for young kids though!\n\nHelpful | 0", "pittamanJul 22 at 11:18 PM\nClever game!\n\nThis game plays with scale in a fun way.\n4 stars only because I am tired of how short these games are for the price.\n\nHelpful | 1", "soulripper527Jul 13 at 8:37 PM\n\nA great puzzle game challenges are amazing\n\nHelpful | 0", "NickMajora23 days ago\nCharming story-puzzler\n\nPleasant game that lasts around an hour so make sure to get it at the right price for you. Controls are a little awkward especially without the option of smooth locomotion.\n\nHelpful | 0", "MrGoodBoy10 days ago\nSuper fun but way too short\n\nI found it pretty fun too play but my only complaint is that the game was way too short. I finished the game in around probably a hour and thirty minutes which I find is too short for a story game in my opinion\n\nHelpful | 0", "Bauer-MalanJun 14 at 2:27 PM\nBlown away\n\nHonestly the best VR game weve played. This was thought out so well! Challenging but fun. Hope they make more chapters or at least more games like this one. Very short but worth it.\n\nHelpful | 1", "highvoltagebeaverJun 22 at 2:53 PM\nVery original concept\n\nGreat puzzle game. Good for the kiddos, but the parents will also enjoy it. Such a fun story line. No functionality issues.\n\nHelpful | 0", "SnaXxXxJul 2 at 9:58 PM\nWayyy too short\n\nGood and bad review.\n\nSuch a cool concept! You will know what I mean when you play it. Really innovative VR game.\n\nI am not very good at puzzle games, even tho I love them. This game took me only 3-4 hours to beat. I can't believe it was so easy. I thought I was beating the first chapter when the game ended. The length made me feel ripped off... maybe it's just me... (BTW the game \"shadow point\" took me many many more hours and almost 2 weeks to complete, an hour or so a night).\n\nHelpful | 0", "PlushyCentaurJun 3 at 10:39 AM\nThis game is AWESOME!\n\nI absolutely LOVE this game, and completely recommend it. I played the entire thing almost the second I got it. The concept is cool and unique. The characters in each chapter are diverse, while still sticking to the overall theme. All of the puzzles are difficult enough to be fun, but not enough to be annoying. The hints are never too obvious, unless you wait around long enough. The graphics were nice. The audio was beautiful.\n\nI have 2 more reasons why you should get this game:\n\n1. You get to break the laws of physics.\n\n2. (I cant stress this enough) The credits. Were actually. REASONABLY SHORT!\n\nHelpful | 4", "justanothervrdeviceMay 23 at 12:42 AM\nA flawed jewel\n\nAn interesting concept that allows for creative puzzles let down by the physics system which while it has some entertaining moments can change a puzzle from being doable when you know what you are doing to preventing you from finishing without frustration and/or a restart.\n\nTwo examples which happen near the end:\n\nFishing for boat parts - one of then can get hooked fairly quickly while the other one (the cabin) seems more content to slide off the hook more often then not and that's if does not decide to pay a visit to the ceiling (only happened once)\n\nLighting the light house - the mechanics change to have the other doll mirror your actions (annoying but can be adapted to) plus you have to maneuver an item that is invisible in the hands of one doll to light the lamps but not before you manage to get the match lit (and re-lit since you will likely drop it multiple times - and that's my patience gone)\n\nworth a purchase and better value if you get it on sale just be ready to have to deal with some possible frustration late in the game - the first 80% or so is great.\n\nHelpful | 2", "philip.snow.330Jun 24 at 5:21 AM\nAmazing\n\nWas sceptical at first but when you delve into it it's very well thought out\nHighly recommended\n\nHelpful | 0", "designbyshashaMay 14 at 3:24 PM\nMust play!\n\nAn absolute gem! Gorgeous graphics, super unique idea, lovely story and some pretty challenging puzzles! There are 4 chapters so its not long but take your time to immerse yourself in the world and take your time to go with the story, will probably take you at least 2-3 hours. Wish there was a sequel/more games in the same style. Might try playing it again in a couple of month in a different language ;-) its great it has standing and seated modes, the game was so pretty I had to sit down after a while to just keep looking around. Well done Devs!\n\nHelpful | 1", "polka_pandaApr 26 at 12:04 PM\nMust-play, one caveat\n\nThis puzzle game is great, the mechanic of world within a world is very cool to experience. The puzzles are good though the hints come a bit too quickly for my taste.\n\nThe one thing that really bothers me is I can only save at predetermined points, not just anytime. So if life comes at you while youre playing, youll have to replay that part.\n\nSo I only play when I have some guaranteed interruption-free time... basically never.\n\nHelpful | 6", "Bhuc7Jun 18 at 8:10 AM\nAlot of fun\n\nFor a game that doesn't have a long story it was a fun and interesting puzzle experience and would recommend this game\n\nHelpful | 0", "tassoleoJun 22 at 1:01 AM\nNice story\n\nReally nice, mind bending story. Puzzles are ok,not too hard not too easy. Maybe a bit short\n\nHelpful | 0", "joefro92Jul 6 at 9:45 PM\nBeautiful game\n\nMind bending!\n\nHelpful | 0", "tanya.laushkinMay 10 at 5:49 AM\nGreat game\n\nThe storyline is amazing, I liked the concept very much.\nThe riddles are not that hard, but for an unexperienced mind it might take a while to solve (took me around 3.5 hours to finish the game).\nI felt that the length of the story and the game is good, but would not object for an extra chapter or two, to make the experience last longer.\nHoping there will be a sequel, or a different story with the same concept :)\n\nHelpful | 1", "butlerswaJul 6 at 10:21 AM\nFun and well done but short\n\nI enjoyed the game, one of the first I bought. It was a little short but reasonably challenging and the concept is great.\n\nHelpful | 0", "TVL1977May 10 at 2:37 PM\nBeautiful puzzle game!\n\nAlot has already been said and written about the game.... And yes it's kinda short, maybe the only flaw it really has, besides a tiny glitch here and there.\nBut storywise it's so well made, beautiful and it pulls you right in.\nI really enjoyed it alot..... I just wish the story continued. (hope to see a follow up)\nThe lighthouse in the lighthouse in the lighthouse,..... Just fascinating. Sometimes I was wondering where I was.\nGood work!\n\nHelpful | 0", "mjcukJun 27 at 9:51 AM\nGreat puzzle game\n\nIt really messed with my head and is very clever.\n\nHelpful | 0", "jbucky1092Jun 14 at 4:32 PM\nQuick, but beautiful\n\nCertainly not a long experience, nor a particularly challenging one, but a great little story beautifully told.\n\nHelpful | 0", "EdenworthMay 6 at 2:39 PM\nA wholesome experience\n\nThe concept for this game is wonderful. The puzzles aren't too challenging but are sometimes mind bending. The narrative is really sweet and the game really takes you on an emotional journey. Incredibly well written, the voice acting is outstanding. It feels like I'm inside Toy Story. Would recommend to anyone with the heart of an explorer and curiosity of a child.\n\nHelpful | 0", "hyperbunnyMay 27 at 2:15 PM\nAmazing use of VR and so intriguing\n\nThis is the first game I finished on my Quest. Such a fun puzzle game and really makes good use of the inter dimensional space. There is you, then little you and big you, and you(s) all need to work together. It's a few hours type of game which I spread over a few days.\n\nOne negative is I found it glitched quite a bit, I'd know what to do and how but would have difficulty executing it in VR.\n\nThe story is original, fun, captivating. Highly recommend, will keep you entertained and challenged. If you like puzzle types of games or Escape Rooms, you'll like this.\n\nI was happy finishing it, until I realized I finished it and there weren't more levels to play.\n\nI made a review here as well https://youtu.be/Sct42Vbh5cc\n\nHelpful | 1", "flicks2005May 3 at 10:18 AM\nAstoundingly brilliant in all ways\n\nThis game is so clever it's almost indescribable. You play the part of a puppet fisherman in a lighthouse who needs to get the lighthouse lamp lit to save a boat which has gone out in a storm.\n\nHe discovers that he has a small and a large copy of the same lighthouse with a smaller and larger version of himself inhabiting them, mirroring his every movement. The other lighthouses also have identical items of smaller and larger sizes.\n\nI won't give away any of the challenges, but it's fair to say they are increasingly challenging but never impossible.\n\nMost people say the game takes 2 to 3 hours to complete without hints but it took me longer.\n\nDon't worry about time just enjoy the challenges and the outstanding VR graphics. Shame it's over.\n\nHelpful | 1", "Zyzybalooba16 days ago\nA unique experience perfect for VR\n\nIf you like finding experiences that only VR can offer, this game is for you\n\nThe game is an interactive story and light puzzler. I was able to beat it in one sitting, with no external hints or walkthroughs. There were some puzzling moments, and some brain-bending scenes. The developers did a great job at keeping the concept fresh from chapter to chapter.\n\nThe graphics were great, especially for a Quest game, and it's obvious that the developers put a lot of attention to the art style. There were plenty of \"oh wow\" experiences as the game unfolded. There is a narrative that runs concurrently with the puppet narrative, that is cleverly woven in and out. It was, for a moment, creepy to see yourself as a puppet (as size feels way different in VR), but that instantly went away as the presentation became warm and entertaining.\n\nThe game took me a little over an hour to complete. I don't think the game needed to be any longer; the experience was complete from start to finish. If you don't like interactive VR experiences, it may not be worth it to you. But if this kind of thing is your jam, you couldn't go wrong.\n\nHelpful | 0", "MusicAndMemesMay 22 at 4:20 AM\nMust have! But... *contains spoilers*\n\nDefinitely a must have on any VR platform ever. One of the greatest VR games Ive ever played! But, and this is a small but, it could use some updates with some problems I had personally: KINDOF A SPOILER ALERT THIS IS FOR THE DEVELOPERS TO READ SO IF YOU HAVENT PLAYED DO NOT READ 1. the ladder on the mirror was a little tricky to get my teleportation beam onto. 2. The model ship was hard to move around once built and kept getting caught on doors and walls. 3. Items and objects in the crane puzzle are a little too difficult to hook onto. I wish I could give this game 4 and 9999999999999 out of 5 stars because it was such a great game but only had a TEENY TINY issue with it. Thanks!\n\nHelpful | 1", "Knarf76Jun 16 at 12:19 PM\nTriple A but short\n\nGreat game.\nVery well polished with great voice acting.\nOnly pretty short. And I did not really liked the last level. That was a little bit too much hassle too control.\n\nHelpful | 0", "PirateSpokesmanMay 2 at 4:38 PM\nWonderful game, over way too soon\n\nThis is one of those games that perfectly demonstrates what VR is capable of. Nice story, wonderful visuals, and clever puzzles designed with VR in mind. My only gripe is that its over way too soon, but the time you do spend playing is marvelous from start to end. Well worth the price, and a great starting point if youre new to VR.\n\nHelpful | 0", "pantherczJul 8 at 3:51 AM\nGood and short\n\nGood, but every short. Playing is less than one hour.\n\nHelpful | 0", "TanixKingtonJun 14 at 2:40 AM\nSimply amazing\n\nStop what you are doing. Play this game. Simply a masterpiece\n\nHelpful | 0", "Kobes89May 19 at 7:23 AM\nA heart-warming little puzzler\n\nI wasn't expecting much from this game - and it ended up completely surprising me. The puzzles are absolutely adorable (although some are a bit hard to execute correctly), the atmosphere is top notch, the tale (although there's not much of it) is told beautifully and has its emotional moments - and overall, it's a good VR experience, especially with the limitless freedom of movement the Quest provides.\n\nDon't miss this one out.\n\nHelpful | 0", "PTP400Jun 15 at 3:07 PM\nGreat game but......\n\nFantastic concept and great game if a little short. I think there is a frustrating bug in chapter 4, after trying for ages I had to restart the level to complete it.\n\nHelpful | 0", "MariPandaJun 20 at 6:07 PM\nGreat concept, but too short.\n\nI really liked the concept with the smaller and bigger lighthouse, the puzzles were fun and I liked the story. Just wish it was longer.\n\nHelpful | 0", "YT13324 days ago\nSuch a smart and beautiful game!\n\nDefinitely agree with other reviews who say the game is short and you should wait for the $10 promo if you want to save some. I love it regardless. Such a fun and creative way to spend a few hours.\n\nTo the developers, wonderful creation and can't wait for more games like this. Even if it's fisherman part II, I'd buy it. I literally cracked up at the narration, so hilarious. The interaction is responsive, the way the world is structured is just beyond impressive, especially for a new gamer like me. The puzzles are challenging but not discouraging.\n\nPlese create more!\n\nHelpful | 0", "kevink808May 25 at 9:38 PM\nVery clever! One of a kind experience.\n\nSuch a simple and charming use of VR. I really enjoyed this puzzle game. Its like a short story nautical version of the Movie Inception.\n\nHelpful | 0", "cliffmerrellMay 14 at 3:11 PM\nGreat puzzle game\n\nReally an interesting twist on a puzzle game. Doesnt take long to finish. Very enjoyable. Ive loved games like myst and am always looking for new games like that. Loved the room. This was fun.\n\nHelpful | 0", "VinnyRinner25 days ago\nA gateway drug\n\nDisclaimer: I did actually get this game for free because of a sale bringing it down to $10 and then some store credit of $10. I payed 71 cents (for tax)\n\nStory based games generally aren't my thing because of the inability to provide endless new experiences. This game ended up being pretty epic. It makes me want to get more into puzzle games like it. Like a gateway drug\n\nHelpful | 0", "kazzumisJun 4 at 4:17 AM\nLoved it.\n\nI really loved this game. Beautiful, tricky and so fun. A little bit short but worth it.\n\nHelpful | 0", "simchiJun 8 at 11:45 AM\nExhilarating fun however short\n\nGreat experience. Very smart with brilliant gameplay and graphics.\n\nHelpful | 0", "s3r1alJun 11 at 8:49 PM\nMust try\n\nInception but with puppets and light houses.\n\nHelpful | 0", "hunter331Jan 4 at 6:13 PM\nAmazing\n\nBorn 1953, no computers then, had things like a telephone with a cord. This means I have been here for the beginning, the first computer, the first 3d card, the first 3d game Quake by none other then John Carmack. Now VR, but this game is VR at its finest. This is a game in a game in a game, when you play it, you will understand. Get this one people, it will take you to a world that will twist your mind in ways that are awesome.\n\nHelpful | 129", "cornsnake55Jun 15 at 11:39 AM\nTrippy\n\nAnd very fun\n\nHelpful | 0", "FlorianSchaetzMay 4 at 12:28 AM\nGreat game - if only there was more of i\n\nAs many other reviewers already pointed out, it's a great game with a great feeling, albeit a bit on the short side. Still, totally worth it. The setting is very special and makes great use of the possibilities of VR.\n\nHelpful | 1", "XxdarkdeathxX21Jun 23 at 11:23 AM\nGreat\n\nGood story\n\nHelpful | 0", "ProlekultMay 7 at 7:17 PM\nClever but over too quickly...\n\nBought Fisherman's Tale in the recent sale for $9.99. I really enjoyed this game, ingenuous level design, an intriguing story and good.graphics. On the downside the puzzles are easy and I finished this in no time. It has no real replay value either, but I'm glad I tried it for the unique experience...\n\nHelpful | 0", "automan25Jun 20 at 11:09 PM\nNeat, But Short\n\nThis is a beautiful and clever game. I wanted to keep playing which is why I was disappointed that it is so short; Just four chapters. Total gameplay is about 1-2 hours if you really take your time.\n\nHelpful | 0", "StrayInsomniacMar 1 at 9:58 PM\nI cried actual tears\n\nThis game is one of the finest works of art to grace my face. All jokes aside, this story tells a great story with some real WHOA moments. I seriously recommend this to anyone looking for a quick little puzzler to share with friends. If I could rate this 6 stars I would.\n\nHelpful | 9", "equal2uMay 7 at 8:51 PM\nGame over ! , good game but too short\n\nI really liked this game and found it some what challenging, but it was over in a flash, I went back in to see if I had missed something. I will go as far as saying that this game was a rip-off because it is extremely short. If the price had been more I would be upset. Worth buying a way.\n\nHelpful | 0", "shawthingsApr 28 at 2:45 AM\nShort and sweet\n\nThis is a well made game that is fun to play. The lighthouse within a lighthouse is a clever idea and adds to the challenge.\n\nI think the game is quite short relative to what else is on the market. Consequently I don't think it's very good value for money.\n\nHelpful | 2", "rob.loweryJun 9 at 5:48 AM\n\nAwesome!!!!\n\nHelpful | 0", "Harlequin.DreamsMar 3 at 1:23 AM\nFantastic use of VR with good visuals\n\nSo this game is a blast to play, and just as fun to play a second time through. The graphics are great and go perfect with the kind of story line it has. The journey keeps you on your toes trying to figure out the next puzzle. Each level is more and more challenging , but the concept as a whole was amazing!\nOnly improvement that could of been made was the game from start to finish is EXTREMELY short. Like 2-4 hours Short. But it's none the less!\n\nHelpful | 6", "mpeppouMay 10 at 1:45 AM\nVery nice and clever\n\nAs many have said, this a a short story, but beautiful, and with some intriguing puzzles. Rather like jumping into a well illustrated children's book.\n\nHelpful | 0", "RemembericankissyouMay 12 at 6:01 AM\nNice plot and gaming experience \n\nI bought this game recently. Love playing it and suitable for all ages. Story is pretty short.. it will be better if it is longer. Overall it is a good game \n\nHelpful | 0", "FXLtdMay 10 at 8:52 PM\nPerfect game for beginners\n\nGreat game that really shows off the unique abilities of the headset. Very interesting and relaxing. Excellent work.\n\nHelpful | 0", "t.nicole18May 20 at 2:24 PM\nToo quick and easy\n\nThe graphics and concept of this game is really cool and unique but I found that it was fairly easy and soooooo short. I didnt time it, but it probably took barely an hour to do the whole thing and a lot of that time was spent watching or listening to something rather than actually solving puzzles. I was a bit underwhelmed.\n\nHelpful | 0", "eoinokApr 8 at 1:27 AM\nShort but great\n\nThis may not be the best puzzle game on the Quest but it does have some really clever puzzles. The vast majorty of VR puzzlers in my experience rely on find-the-blue-key-to-open-the-blue-door type gameplay, rather than asking players to think in a new way, and look at things from another perspective. This game is different and I personally found the puzzles here very satisfying. The dialog and voice acting are also superb - I laughed quite a bit. Decent graphics. Great story. Short but worth it.\n\nHelpful | 1", "IninjahoundJul 14 at 12:53 PM\nGreat game! but,\n\nThis is a Great game but, it's a short game and something I would love in this is a sandbox mode, when you finish the game it would unlock and you could go to every chapter and just play around you could also fly so you could see everything and how it was looks in more detail\n\nHelpful | 0", "cole945Jun 7 at 12:04 AM\nNo subtitle.\n\nReally interesting game play and nice voice acting, but for non natural speaker, without subtitle is painful to play the game :( I don't need translation, subtitle will be really nice to have.\n\nHelpful | 1", "Snoob76May 12 at 4:26 PM\nClever little game\n\nDefinitely worth the purchase. It wasnt a long game, but it was interesting and clever.\n\nHelpful | 0", "OtherbitsMar 22 at 10:18 PM\nFar too pushy\n\nThis is a game high on creativity and charm, and it deserves to be played slowly, with players taking in everything it has to offer.\n\nWhich is why it is a huge, huge disappointment that the game rushes the player at every possible moment. There is barely a pause between the narrator explaining the current situation, and the narrator chiming in again to remind the player of the current situation, or to remind them how urgent the situation is, or to hint at an answer. Even with hints turned off, the game seems to be trying constantly to speed-run the player through the experience, without ever a quiet pause for reflection. The entire game is just \"Hurry up, hurry up, go go go, move, move, hurry up, solve the puzzle, solve the puzzle, move, move, faster, faster!\". A puzzle game should NEVER do this. People solve puzzles at different speeds. Some like to just explore and take in everything around them before even trying to solve it. This is doubly important when the puzzle is so creative. I wanted to just admire that for a while, but was pushed repeatedly to get going. Early on I picked up an object on a whim and the narrator jumped to telling me it was just what I needed to solve a problem. I wasn't even thinking about solving a problem. I was just admiring the object. Several times while just trying to solve a puzzle as fast as I could, the narrator actually ran out of things to say and started repeating dialog. This was within minutes. I ended up moving so fast through the game to avoid this, I accidentally missed bits of dialog and sometimes solved other puzzles just by trying too many things at once.\n\nIts bizarre that a game this short would think time was of the essence. It really needs to slow down and relax.\n\nHelpful | 11", "x-Mimi-xJul 7 at 3:25 PM\nGood game!\n\nNot long enough \n\nHelpful | 0", "teaminsane415May 18 at 7:55 AM\nSooo short\n\nSuch a great concept and a great story but wayyyyy short. It's over before you get started. Wish there was more to do. But it's a great game regardless\n\nHelpful | 0", "SactoJoshApr 2 at 7:30 PM\nGreat story, fun game mechanics\n\nGreat story and really fun game mechanics make for super interesting puzzle solving. If youve ever wanted to be a puppet controlled by a huge version of yourself while also controlling a miniature version of yourself, this is the game for you! Its awesome!\n\nHelpful | 1", "Leogamerextra24 days ago\nGreat game but ... Italian!\n\nfantastic game but ... please ... do it also in italian !!! I don't give 4 stars because this is a really well done game but please ... add Italian too!\n\nHelpful | 0", "kernow76May 8 at 11:33 PM\nBrilliant game\n\nToo short but so so good. Well worth playing if you like puzzle games.\n\nHelpful | 0", "EminademFeb 29 at 2:00 PM\nMemorable Little Game\n\nThis game is some of the most fun Ive had in VR. It put its hooks in with its unique gameplay mechanics and doesnt let go till the end. I mostly played with tips and hints off which is how I recommend you play. Its not very long and you dont need the hints because they will just make you complete it faster. The fun is in the trial and error approach to solving puzzles and all the crazy things you can make happen. Its a crazy fun ride that I wont soon forget and will probably replay again from time to time. I would have loved it to have a few more levels but for the price I think its fair.\n\nHelpful | 3", "leefa25 days ago\nSo awesome\n\nthe graphics were great, the puzzles were pretty easy, but fun. just wish it was longer! no replayability. played the entire thing in about 2 hours\n\nHelpful | 0", "DunnoNaukerJun 30 at 6:58 PM\nMind. Blown.\n\nI've never been one to sensationalise VR or VR games, having always regarded them as nothing more than a mindless, albeit fun gimmick. This game has proved just how wrong I was.\n\nThis game boasts an incredible, unique story presented in an extraordinary way. This game takes full advantage of the capabilities of virtual reality, and accomplishes something that could only be experienced in VR. Never before have I been so upset a game wasn't longer.\n\nDoes it have its shortcomings? Of course, what game doesn't? The game overall is perhaps a tad short, and some of the puzzles can be quite simple, but everything else far outshines the negatives. The graphics and art style is beautiful, the narrative is engaging and satisfying, and the gameplay is utterly unique and fresh. The game manages to take a relatively simple concept, and weave depth into it with ease.\n\nI can't recommend this game enough, especially at this price point. Hell, I would have payed 60 quid for this game, because it's worth every pound.\n\nHelpful | 0", "dmagliolaJul 10 at 4:59 PM\nIncredibly well done\n\nThis has been one of the most joyful, delightful experiences I've ever had with a game.\nA simple, clever concept, executed to perfection, with some of the highest attention to detail I've ever seen.\nBest VR experience so far and that's a high bar.\n\nHelpful | 0", "MissDefyApr 26 at 6:56 PM\nFun game\n\nI enjoyed this game. The mechanics and puzzles are completely unlike anything I've seen before. It also has a touching story.\n\nHelpful | 1", "Mbull4156Jan 15 at 5:08 PM\nIf youve played The Room, Play this!\n\nAs someone who LOVES to figure out how to put things together and find objects to continue, this game was perfect! Its an amazing story as well, so immersive and mind bending! The first time I played it, I though it would be just another normal puzzle game, then chapter 1 happened and I was both startled and in absolute AWE with how creative and renovating this game is. Something that I have never seen before. Highly recommend this game!\n\nHelpful | 21", "Tacky_Jun 28 at 1:45 PM\nDeserving\n\nThis game totally deserved vr game of the year and it highlights what is so great about Vr. Its immersive, its adventurous, its humorous, its a perfect blend of amazing things that makes the game enjoyable. It is pretty short but overall worth it. Itll be hard finding a game that can top this.\n\nHelpful | 0", "RyanjrgongJul 13 at 9:19 PM\nGame is beyond emerys Ive, but short\n\nI loved this game. The puzzles are not to easy, some even taking a few minutes to figure out but the game is really short. I played through it in one go because it was so immersive. But really only about 2 hours long\n\nHelpful | 0", "SkiphopMay 6 at 11:42 AM\nAmazing\n\nWhat a brilliant game! The only negative is its too short.\n\nHelpful | 0", "MuddyBudMay 9 at 1:38 PM\nGreat game\n\nThis is a very fun game, but I beat it in about 2 hours. I was more expecting a longer game, but thats really my fault. Otherwise, a great experience!\n\nHelpful | 0", "MCProgramMar 27 at 8:33 PM\nNothing Like This\n\nMost unique experience I have played in VR. Great story, great style to the artwork, and simply not long enough. This is a short game but you will be wanting more and it is well worth the price to support this studio to create more excellent content.\n\nHelpful | 1", "daiwillyApr 11 at 9:48 AM\nQuality over quantity\n\nA really sweet experience, with the narrator's French accent adding to the sense of wonder as you trawl  through this adventure. Highly recommended but don't expect a long game.\n\nHelpful | 1", "becca.durhamJul 1 at 4:21 PM\nThe Best Game I Own\n\nI love this game! The concept is original. The graphics are well done. The puzzles arent super hard but they are fun to solve. The story is great. Its so interactive its fun to explore your surroundings. Its not a long game but it is 100% worth every penny.\n\nHelpful | 0", "MaasmanApr 24 at 1:06 PM\nGreat game\n\nVery fun game. I wish it was longer.\n\nHelpful | 2", "Virtual_DMay 19 at 9:02 PM\nGood fun but a bit short\n\nThe puzzles were fun and not too challenging. Just would have liked another level or two.\n\nHelpful | 0", "vickimacMar 27 at 12:14 PM\nToo short\n\nLoved this sort of puzzle game but its way too short. Its beautiful to look at. Took me a few minutes to get used to the controls but once I figure that out its relatively easy. I recommend for an afternoon of quarantine to pass the time.\n\nHelpful | 1", "zeke714May 6 at 8:25 PM\nIncredible\n\nJust get it. Its what makes VR magical.\n\nHelpful | 1", "rugglesenforcerApr 16 at 2:52 AM\n\nMy wife and I loved playing this game I hope they come out with an update soon its tricky but remember sometimes its right in front of you !\n\nHelpful | 1", "HappySliceApr 10 at 12:55 PM\nGreat Puzzles!\n\nI love the puzzles in this game. The story is cute but didnt really grab me personally. The art and lighting are great especially for Quest. Definitely worth the price\n\nHelpful | 1", "CyroX7325 days ago\nGreat game!!! :-)\n\nTo developer. Please, make your next games longer and be sure I'll buy it . Keep up the great work...\n\nHelpful | 0", "89BrownBearApr 18 at 12:53 AM\nSo creative\n\nGreat game. My only complaint: I wish it was longer.\n\nHelpful | 2", "Greekspartan121Jan 26 at 2:26 PM\nFinally bought it,what was I watng for.\n\nGreat game,a game within a game,within a game,lol.Just like the reviews said it it,great puzzle game and nice graphics.\nI started the game without hints as everyone saying it's too short.\nI'm on chapter Two and took me about 30mins to complete chapter One.Im stuck on Two,will continue tomorrow, can't wait.\nGreat for the cheaper price at the moment.\n\nHelpful | 9", "sonoslainMay 13 at 7:32 AM\nGreat game.\n\nIt's a wonderfull puzzle game.\n\nThe fishermans house is mindbending.\n\nToo short for 5 stars.\n\nHelpful | 0", "mopsigmorumJun 17 at 5:15 AM\nDelightful\n\nThis game is very short but I really enjoyed the concept and little adventure. I loved the puzzles and the way they played with the environment; I did have hints on and wonder if I should have turned them off to stretch it out a bit. Word of warning: if youre scared of open water like me brace yourself for just one or two short uncomfortable moments. This game in theory can be played sitting but I found it a bit hard to do that; standing made interacting and moving around a lot easier just because of the controls. Overall a brilliant game, just wish it was longer and took the concept a few steps further.\n\nHelpful | 0", "okeyoneApr 12 at 11:20 AM\nSo much Fun\n\nPeople say short? Maybe but so much fun. People say to costly. Maybe but so much fun.\nJust get it you'll soon be having so much fun.\n\nHelpful | 1", "MrMobbsJun 30 at 8:16 AM\nUnique\n\nOne chapter into the game & already very impressed. Something very different. Well done for developers thinking outside the box.\n\nOr inside the box looking inside the box? Or inside the box looking out at them looking in?? \n\nHelpful | 0", "CryptikBlissMar 14 at 9:36 AM\nGreat game, but very short.\n\nThe games we'll written narrative drives a nice experience while puzzling your way through the game.\n\nPuzzles are fairly easy and enjoyable. Some are a little more difficult than others, but don't take to long once you grasp the \"inception\" like mechanics.\n\nI wish there were more to it though as the game is very very short. Some added achievements and secret collectables would have made this much more fun as you would then have some replay factors to it.\n\nAll in all, I feel like the price tag was acceptable and the game was great.\n\nHelpful | 2", "linknzelda7Mar 12 at 5:33 PM\nAmazing\n\nThis has got to be the best escape room puzzler be game there is. I love the brand new idea for this game. The mechanics of the game are like nothing I have seen before. The colors are also beautifully done. I really hope they make a sequel or even a series for this game.\n\nHelpful | 1", "Vr_-_Ready.Apr 3 at 10:28 AM\nGreat puzzles, room scale\n\nGood visuals accompanied with omnidirectional sound creates for a great atmosphere while solving the puzzles.\nRuntime about 2-3 hours.\n5 stars for uniqueness.\n\nHelpful | 0", "dazltMar 21 at 10:03 AM\nGreat game\n\nIf you like a game you have to think about then this really is for you. The concept is genius and the visuals are amazing. Undoubtedly no wonder this is award winning. Hoping to see an expansion or part two in the future.\n\nHelpful | 1", "timmay71010Mar 24 at 2:42 PM\nExcellent game\n\nYes, the game is short but it is also awesome. If you pay $15 for a game, dont expect anything over 3 hours.\n\nI loved the game and have no complaints. Definitely worth the money. Great job Devs!\n\nHelpful | 1", "LW2024Mar 30 at 7:46 PM\n\nBravo bravo bravo!!! Charming! Clever! Beautiful! Funny ( \"Your mother is very disappointed in you. I'VE always been the supportive one\" ). Encore!!!!\n\nHelpful | 1", "LiquidRicJul 2 at 6:39 AM\nGood game! little short\n\nI had a blast playing this game! My only issue is that the gameplay isn't super long, I love the story and what they are doing graphically I wish there was more! Also (light spoiler) there is a part of the game where everything gets super bright, the transition is about 15 seconds, but fair warning if your eyes are sensitive to light I would recommend closing your eyes or lifting the headset off for just a second. Good game tho\n\nHelpful | 0", "sebastian.kurz.583Nov 30 at 3:34 AM\nPhantastic...\n\n... And now I have to get the smile out of my face again...:-)\n\nUPDATE: Many people aways complain about games being too short. But this here is highest VR quality. You pay for VR quality time which is perfectly fine, the same like you pay for cinema to have a great time. I would not like to play lower quality titles super long, why? Just that I play for a long amount of time? Thanks, but no thanks.\n\nI love the philosophy of a great title even when it is short that remains in your mind because it is so well crafted like Fishermans Tale:-)\n\nHelpful | 95", "HighMartinApr 1 at 7:57 AM\nOne of the best puzzle game here\n\nThis is really cool puzzle game, just finished it and my brain is hot :D the last chapter was the real challenge! Thank you for this masterpiece \n\nHelpful | 1", "CamodiusJun 30 at 1:19 PM\nShort but good\n\nI dont want to sound annoying but the game was (I think) too short, it had a great storyline and all but it just doesnt deserve to be priced at around 12, I love the idea of shrinking and growing things but I feel like the story shouldve shown more of that and been a lot longer. Personally Id like to see some sort of sequel or something but I dont think it would happen.\n\nHelpful | 0", "lukas.stoger.9Mar 22 at 7:08 PM\nA nice little Adventure\n\nGo get it while its hot!\nAnd by that I mean on sale because this really is a perfect 10 bucks game\nA few facts about my experience:\nIt took me just about an hour from Start to finish\nI found the riddles to be quite Fun but a bit too easy\nThe visuals are amazing though and I really Fell in Love with the used Art style. the Voice acting is awesome as well (at least the english one)\nThe Story is very simple, but engaging, emotional, nostalgic and just beautiful all at the same Time. I really got to Love the little wooden puppet and his small, big, inside out, upside down light house.\n\nAll together it is a Very Fun experience and I do recommend it, but because of its short length (there are only 4 levels) it is Not worth the original price of about 15$\n\nHelpful | 1", "LertosJun 14 at 12:27 PM\nSuch a Wondeful Experience\n\nDont hesitate. Buy this. The story is engaging, the gameplay is exactly what you bought a VR device for - well worth the price tag.\n\nThe core concept of this game was very well thought out. Goes to show you dont need to be a triple A company to produce bangers!\n\nHelpful | 0", "andythwJul 2 at 5:31 AM\nMind bending\n\nI bought this on sale. It takes some thinking to manipulate objects on one scale then hand then to another version of yourself. You really have to think 'outside the box'.\n\nHelpful | 0", "joseph_marieMar 26 at 9:52 PM\n\nIf I only new it was this good I would have buy it before. Great graphics , fun puzzles , nice story. One of does that should be part of your collection.\n\nHelpful | 1", "Krisp8922 days ago\nReally great\n\nVery clever VR puzzle with great visuals. Makes you think out of the box. Just wish it was a bit longer.\n\nHelpful | 0", "RobbDe12323 days ago\nGreat game...until the final \"Match\".\n\nGreat game...until that bugged-out MATCH fiasco at the end. Totally ruined the overall experience. Not sure what the Devs were thinking there.\nYup...this game went from 5 Stars down to 1 Star...because the Devs really dropped the Quest Ball on this one. GARBAGE.\n\nHelpful | 0", "aussieburgerVRMar 6 at 5:32 AM\nGreat little story based vr puzzle game\n\nIt is a little short but very clever use of scale in VR. I played through with hints turned off and the Puzzles were just challenging enough to make it feel not too easy while not being stuck on any one for long. Highly recommended!\n\nHelpful | 0", "TycoTechNov 21 at 2:31 PM\nFun and very clever use of VR space.\n\nThis is a gem of a little game. The graphics are good, voice acting well done, and the almost \"inception\" style of play is fantastic. It is a little short, took me just over an hour to complete (but I had tips on, I'd suggest you turn them off for a more challenging game). All-in-all I'd recommend the game for sure. You can see my video review of it on YouTube by searching \"Tyco Tech a Fisherman's Tale\".\n\nHelpful | 141", "redalert33Mar 6 at 12:14 PM\nGreat little puzzle story\n\nAs others have said, this game is pretty short, but it's a very well-crafted and polished story and puzzle game. The puzzles aren't too difficult (I only got a little stuck on one), and make good use of the accompanying story.\n\nHelpful | 0", "crtech21Mar 15 at 7:41 AM\nAmazing experience\n\nA really cool game, graphic style looks beautiful. The mechanics are really nice.\n\nOnly thing that could make it better is a more refined teleport/movement system and more puzzles.\n\nHelpful | 0", "BertHalfpintFeb 18 at 4:08 PM\nDo not hesitate, simply buy this and \n\nWhy oh why do I hesitate over things?\nNaturally cautious I guess \n\nI read the reviews and read them again wondering if it was going to live up to the hype ?\n\nFolks this is greater than the entire sum of all of the great reviews. If my headset had not just ran out of power I would still be there soaking up the sheer brilliance and immersive wonderment that is\nA Fishermans Tale.\n\nSo don't read the reviews , just believe , pay up and dive in \nSo much fun awaits you \n\nTo the developers I offer my heartiest thanks for showing us what VR is truly about.\n\nFabulous \n\nHelpful | 1", "nancytronvertJul 1 at 5:20 AM\nGreat !\n\nThe story and graphism are great ! I loved it ! I completely forgot my real life and when I put my Quest down it was very late at night\n\nHelpful | 0", "CHVRCHFeb 18 at 5:36 AM\nOriginal Gamer Review\n\nBeing involved in Games from day one, Ive seen a lot of different things. Most genres had limitations, shooters, racing, RPG even puzzle games.\n\nBut having the element of dimension involved in this story puzzle game is honestly the most incredible thing Ive experienced!\n\nI can believe I have the privilege of being involved in the beginning of VR!\n\nBUY THIS TITLE!\n\nHelpful | 1", "KwetlaMar 4 at 1:23 PM\nShort and sweet, but memorable\n\nIt only took me an hour or two to complete, and there isn't much replay value, but the experience is simply incredible. Mindbending puzzles and hilarious narration that sticks in your head long after you've finished playing.\n\nHelpful | 1", "iZappedJul 5 at 10:27 AM\nFantastic!\n\nVery fun! Great little puzzles and interesting concept! Artwork is fantastic and works very well on the quest!\n\nHelpful | 0", "TriangledFeb 16 at 4:36 PM\nAbsolutely Magical\n\nThe storyline quickly moves player beyond graphical limitations of Quest platform. Perhaps the best voice-acting Ive encountered in VR to date. Only a single narrative voice, but actor nailed it. Lighthearted puzzling is enrichingly counterbalanced against complicated father/son relationship backstory. Gives gameplay just a dose of meaningful tension. Puzzles are engaging with just the right amount of difficulty for a colorful and fairly casual experience. Perfect game to play to unwind after a tough work week. Very positive escapism.\n\nHope the developers continue along the lines of A Fishermans Tale. Id love a sequel, and would buy instantly. Absolutely magical, fairytale-esque VR experience. Love it!\n\nHelpful | 1", "Cryston5 days ago\nPassably bad\n\nIt's a super standard escape room with one cool premise and some of the most infuriating searches for items with useless hints.\n\nHelpful | 0", "jimbowie10Jun 26 at 9:56 AM\nTrippy and Brain bending puzzle game\n\nI like this game a lot. It uses what VR should be used for, there are 3 of you and seeing yourself in huge, normal, and tiny is vey trippy.\n\nHelpful | 0", "FraastVargMar 26 at 2:56 PM\nImaginitive\n\nAn incredible experience that was to far to short. Finished the game in one evening and replayability is very low. This makes the price to high. Could easily be a five bar with more content and/or adjusted price.\n\nHelpful | 3", "Conrad-RoqueMar 29 at 3:50 PM\nGood but short\n\nIt's a nice short story puzzle game. Before you play. I highly recommend you look at the settings. Two things, get rid of hints and I have not tried, but there is a setting to do it sitting down.\n\nHelpful | 0", "IancoJun 13 at 7:11 PM\nA testament to the greatness of VR\n\nHere you have it, a perfect example of what VR is capable of, and what possibilities this new medium opens. A masterpiece that will be remembered as one of the pillars of VR's greatness' foundations.\n\nHelpful | 0", "steven.hall.77Jun 30 at 12:22 PM\nShort, but good\n\nOn sale for 10$ makes the short length more tolerable. Finished it in under 2 hours. Not sure if much replay.\n\nHelpful | 0", "polfJun 11 at 1:31 PM\nBest Vr experience ever\n\nI've have a lot of vr headsets and played a lot of different games and this is without a doubt up there with the best. It is absolutely fantastic and well thought out. Just buy you won't be disappointed.\n\nHelpful | 0", "akginnyJul 15 at 8:17 AM\nSuper creative and engaging\n\nLove the premise and creativity!\n\nHelpful | 0", "jrrrrrApr 4 at 10:45 PM\nCharming Puzzler\n\nI want to spend more time in this world.\n\nHelpful | 0", "etheos_ultraMar 1 at 3:05 PM\nWhat a creative, unique game!!\n\nWe need more games like this on VR!! What an amazing, immersive adventure. You have to put a few clues together, but you dont get stuck. Well done, Ill be on the lookout for more from you!! \n\nHelpful | 1", "JacobOrowFeb 10 at 6:06 PM\nThe Greatest Catch\n\nWhen I first bought this game, I was thinking that it would be a short puzzle game, but it has a story that makes you want to beat every level to find out what happens next. I have never seen a game that had a concept like this one. It is fun to work with yourself to solve a problem. If I need a bigger pipe, I get it from the larger version of me, and if I need a smaller hat, I get it from the small version of me. My only complaint is that the game is kind of short, but I end up spending more time on puzzles, because each level gets harder.\n\n5 star\n\nHelpful | 1", "LeahEveMay 28 at 9:20 PM\n\nI wanted to play more! Too short!\n\nHelpful | 1", "MrPicklebushMar 1 at 8:47 PM\nWhat an incredible VR adventure\n\nSo original. So awesome. I was floored by this concept. In a world of reboots and a lack of originality. Im continually amazed by some VR GAMES and this is one of them ! Worth the cash\n\nHelpful | 1", "bdevineJan 24 at 10:49 AM\nFun and very unique game.\n\nI am so glad I purchased this game. I just love the ingenuity and thought that went into it. It really makes you think but doesn't leave you helpless if you get stuck.\nIt is also fun to play.\nIf I could ask for 1 thing it would be to be able to just walk instead of only being able to teleport. I found that while playing seated I had to do a lot of adjusting of my position in order to interact with items.\nI really hope more titles like this come out in the near future.\n\nHelpful | 9", "VRSugarBabyMar 14 at 12:50 PM\nGood game\n\nDifferent and unique game play and premise... Its like a cross between a puzzle game, an adventure game, an escape room game and a 3 dimensional find the item game... If you like any of these genres of game play you will most likely enjoy this game.\n\nHelpful | 0", "klyokMar 11 at 11:06 PM\nOne little puzzle that exploited VR well\n\nI would says it's not very long high quality narrative experience with a little of easy \"puzzles\" exploiting the same mechanics. And I say \"puzzles\" because essentialy, this game feels like _a_ puzzleyou're just putting some elements of the same simple physical puzzle in the course of a narrative story.\n\nA beatiful, fun, good written little puzzle that exploits VR very well. It's like if you a little child with a 10-piece puzzle, and while you are trying to solve it, your grandpa telling you a tale about every piece.\n\nAlso, it does feel like this mechanic has much more potential than developers managed to put in the game.\n\nSo, if you want more gaming (like me), you probably will not like this experience very much.\n\nHelpful | 2", "createsureFeb 8 at 7:31 AM\nBeautiful multi-layered game\n\nThis game is incredible, one of my favorite Quest games. It is essentially an escape room, but is unique in the best ways. It challenges your ability to think big--and small--and the visuals are beautiful. I played through the whole game in one go, but it took quite a while (my headset ran out of charge just as I finished actually) and it was more than worth the cost.\n\nHelpful | 1", "YakorpttamApr 25 at 9:00 PM\n\nNice relaxed and mind bending\n\nHelpful | 0", "Tummie555Apr 13 at 3:29 PM\nGreat game\n\nFound the controls a itty-bitty frustrating at times, but nice inovative puzzle game overal.\n\nHelpful | 1", "Rade0nFighterFeb 7 at 5:04 PM\nThinking outside the box\n\nA credit to the studio, great showcase piece for the potential variety that vr can offer.\n\nNot the type of game I would pick up on pc/console but probably one of my all time favourite games.\n\nA wonderful story intertwined with itself and well thought out.\n\nThe puzzles are brilliant as was the voice acting and aesthetic.\n\nHelpful | 1", "VKR.1.0Mar 23 at 4:51 AM\nCool game, but too short.\n\nI spent a great time playing it, ubtortunately it's very shot. Still 5 stars though.\n\nHelpful | 0", "hazyinseptemberJul 2 at 5:55 AM\nFun but sooooo short\n\nThis popped up on my radar during the duo pack special. So when it came on special by itself I grabbed it.\n\nFirstly its wonderful to look at, and the atmosphere is wonderful. Voice acting is great but can get a little repetitive if you get a little stuck on a puzzle and the same phrases repeat.\n\nSecondly its clever. Lots of little unique tricks that make it special and enjoyable.\n\nSadly, its super short. I think I finished it in 2-3 hours with hints turned off.... with that amount of content Im glad I got it on discount..\n\nHelpful | 0", "MrsCummingsMar 11 at 1:55 PM\nUnique, short and fun, if a bit queasy!\n\nThe only reason I docked a star is that several scenes made me feel queasy. Otherwise, an excellent little game, such a unique concept and beautifully presented. Not particularly taxing, but that doesn't matter. The controls are a little tricky too.\n\nHelpful | 1", "lucidmattFeb 10 at 11:56 AM\nWay above expectations\n\nI've tried dozens of interactive stories and puzzle games in vr and they've been cute, but worn out their stay pretty quickly.\n\nThis game continued to layer on surprise after surprise and did not rely on one overused gimmick. A genuine treat for a vr cynic like me. Very much recommended.\n\nHelpful | 1", "Gufa2528Feb 23 at 8:03 AM\nBrilliant Game\n\nVery nice game, the graphics are fantastic too. In addition, the story is very well done and very touching. However, the game can only be played once, because you already know everything after the first time.\n\nHelpful | 1", "ManveruJun 7 at 12:51 PM\nClever use of story and game space\n\nAs mentioned frequently, the game uses a model in a model concept that lends to some clever and fun problem solving. The last chapter, for me, was problematic and felt like I was fighting the game mechanics versus playing them. It is a very short guided story that was enjoyable, but I wonder what games some are playing to get such high praise in some reviews. I found the father in the story quite disturbing and moved it away from quirky and clever. Not in my list of top games. It was cute, short, a one off and done. Catch it on sale.\n\nHelpful | 0", "jazzertptMar 23 at 6:29 AM\n\nGreat puzzles, amazing art. Only complaints is that it is too short\n\nHelpful | 0", "RougeVengeanceFeb 3 at 3:36 AM\nShort but sweet\n\nI wasnt sure what to expect going into this, but I ended up really enjoying it. The game is puzzle centered, and without spoiling anything, has you working with bigger and smaller versions of yourself to help save a fisherman lost at sea. There are 4 main levels, with a prologue and epilogue to tie off the ends. For a 15$ price tag I would have hoped for an extra level maybe(3$ a level then), but I purchased it on sale for 10$ and because of that have no problem justifying my purchase.\n\nThe characters you meet are friendly and charming. The graphics are simple but polished. The mechanics will definitely twist your brain. And the story will leave you with a warm feeling inside.\n\nWait for a sale if you must. But definitely consider purchasing even at full price. Fun little adventure.\n\nHelpful | 1", "Angeldust420xFeb 27 at 10:34 PM\nHonestly Wow\n\nThis has one of the most unique gameplay Ive ever experienced definitely worth the buy. Would like to see some DLC to it but for a base game so worth it. Had a lot of fun.\n\nHelpful | 1", "WannabePilotFeb 1 at 9:32 PM\nLike no other\n\nUnique puzzle game in a world of me-too FPS. I loved it! My only negative was that the game play was a little wonky at the end - I kept dropping a very important item, so I had the good frustration of how do I solve this? and some bad frustration of why dont my hands work right? I recommend playing with hints off.\n\nHelpful | 1", "Deku93Feb 26 at 11:03 AM\nMind-bending but short experience\n\nThis is a really solid game. I have to agree to what most of the reviews say: good graphics, best I have experienced so far on the Quest, and the gameplay is just brilliant. It's not very difficult, and you can finish it in a couple of hours: the brevity truly is this game's worst enemy. Nonetheless, this is a must-have for every Quest owner!\n\nHelpful | 0", "svchellJan 31 at 3:43 PM\nThis is how you do VR!\n\nBeautifully made game! The method of navigation, the view of the game, the graphics, and the pace is brilliantly done. I've played games before that were considered AAA level and yet the VR aspects were treated like an afterthought. With this game, you can tell that every detail of the game, from the story, music, and graphics...were all carefully considered to create the best VR experience possible.\n\nHelpful | 1", "cran1umFeb 24 at 12:17 AM\nIncredible experience, but short\n\nEverything about it was excellent and the experience was well worth the cost, but one should be aware that it is about a 1-2 hour experience with limited replay value. I hope they can continue and expand. If you are on a tight budget, find a friend who has this and borrow their headset for an hour so that you can experience it.\n\nHelpful | 0", "ctrl-alt-dudeMar 8 at 1:53 PM\nLoved it!\n\nWhat an amazing game! Really loved it front to back. The puzzles are great. Storytelling is really good. Buy this game!!!\n\nHelpful | 0", "rzamsJun 8 at 11:15 AM\nFantastic\n\nAmazing game, fantastic story and great puzzles. The only bad part is dull ending but it in no way drags down the gameplay. 5/5 10/10 100/100 fantastic game\n\nHelpful | 0", "Detective_SuperheroFeb 29 at 6:46 PM\nFor fans of escape rooms\n\nWhat an amazing job they did with this game. The puzzles are fun and relevant. The mechanics are great. Highly recommended for escape room fans.\n\nHelpful | 1", "IIIOliverIIIMar 18 at 5:43 PM\nTo describe this game in a sentence\n\nThis is a mind bending piece of art that makes you happy to be alive.\n\nHelpful | 0", "ian.shaffettApr 18 at 11:26 AM\n\nShort but interesting\n\nHelpful | 0", "PuertoRicanGuyMay 9 at 12:40 AM\nUnique and Fun Experience\n\nMe and the wife tried this game out because we are into strategy/puzzle games. While its not the longest game, the story is very immersive and the concept of solving puzzles depending on what size the item is, is a concept I have never seen in any game before this. Great job to the developers. All for a very reasonable price. Keep it up and thank you for the hours of fun with my wife.\n\nHelpful | 0", "ookeesMar 7 at 2:36 PM\nBuggy\n\nThe collision mechanics are terrible in this game. I was getting by though. And it was fun for awhile. But once you get to Chapter IV everything is just broken. I can't complete the game. I don't want to spoil anything for those who are going to try it. Devs check my tweet and you'll see the description of my issue. Also the matchbox keeps getting stuck to the wall in Chapter IV. I bought this game from a recommendation from a friend but I'm regretting that, and won't play it until the bugs are fixed. I've never had so many buggy issues in a Quest title and that goes for sidequest games too. Just not as polished at I'd hope. Yet games like Crisis VRigade are not accepted to the store. Wonder who's making decisions at Facebook.\n\nHelpful | 2", "MYTHx88Feb 28 at 10:49 PM\nGreat game!\n\nThis was a wonderful experience, however I wish it couldve lasted a little longer. Id love to see more feature length games in vr\n\nHelpful | 1", "NickinadorJun 11 at 7:48 AM\nBeautiful interesting story, but SHORT\n\nI wish this was longer and a bit more challenging. Puzzles were very simple and story was far too short, maybe under an hour worth of game play? But the game is very beautiful, the story is very interesting. And I enjoyed every minute of it.\n\nHelpful | 0", "prickleypearJan 26 at 10:28 AM\nAwesome\n\nI have played through the first 3 chapters so far and am very impressed. The idea for this story/game is really cool and definitely over the top for VR. It makes you think a little bit and mind your surroundings.\n\nThe characters are also pretty neat. Each one is different and helps the story progress while telling their part of it through narration and their requests.\n\nI have heard people saying it is to Short, but for me, I only have short bursts of time to play games, so I enjoy how the game is broken into chapters with puzzles to solve before moving onto the next chapter, which is where the game saves. This works really well for me.\n\nDefinitely worth the price, especially when it is on sale (I bought it for $10)\n\nHelpful | 2", "quanster76Jan 28 at 8:58 AM\nGot lost in a beautifull game\n\nSimply wow! This was one of my first VR experiences and I must say Ive never been so immersed in a game. Because Im new I got to chapter three then felt a bit sick so had a break. It took me just under an hour to get there. Im not sure how many chapters there are but I dont want this game to end! Just my cup of tea\n\nHelpful | 1", "Lady_MelMay 10 at 7:35 AM\nWonderful game but too short\n\nWow. Loved the whole concept of this game. Really clever puzzles, intriguing surroundings, emotional story line. Even the voice acting was top notch. I thought the whole idea of the lighthouse within the lighthouse fascinating.\n\nThe only drawback was length of game. It was over before it began, and given the size of the surroundings and the amount of items you can interact with I expected a few more puzzles.\n\nStill, it's definitely one of the best VR games out right now.\n\nHelpful | 0", "SleepyKinggJan 26 at 8:48 PM\nWonderful experience! Read 4 info\n\nGreat game worth the 15$ Or unless you got it for 10$ like I did. None the less this game was absolutely amazing! I highly recommend it to people who are into puzzle games and like a challenging brain game. Great graphics great story, I hope there will be a part 2. But before you buy, this game doesnt have subtitles as I saw on another review and I also saw in the setting there wasnt any! But otherwise if you are new to vr or not and wont get frustrated easily, I highly recommended this game.\n\nHelpful | 1", "DeadLikeMeMay 21 at 3:21 PM\nDelightful puzzle, story, adventue\n\nThis game is amazingly put together. I loved the style of the story and animation. The puzzles although fairly easy are unique and interesting.\n\nI enjoyed roomVr but this is even better if less challenging. Highly recommended.\n\nHelpful | 0", "Hogan_ZerosJan 27 at 12:08 AM\nAmong the very best\n\nTurn off hints in the settings before you start. You will be stuck for a bit but so satisfied when you figure out each puzzle, while making the whole experience last longer. You won't want this game to end. When it does end, feel proud you bought your vr headset because there's nothing else like it! 5 stars\n\nHelpful | 1", "DansascityJan 25 at 7:28 PM\nPure magic\n\nI've played games my whole life and I've NEVER, EVER experienced anything like this game before.\n\nIt's admittedly short, but everything - from the artistic direction, to the story, to the satisfying puzzles - is so jarringly beautiful and thoughtful, that it ranks among the very best gaming experiences of my life.\n\nWhen I got an Oculus Quest, I had no idea the platform and the developers could create something like this.\n\nDefinitely a must play.\n\nHelpful | 1", "rp2020Jan 25 at 9:35 AM\nShort but awesome\n\nIts a short game but very well done. It has a really cool take on the puzzle genre, I have never played anything quite like this and I think everyone into VR should really try this clever implementation of what makes VR such an awesome experience. The price is fair for the quality of the game.\n\nHelpful | 2", "granuaile3Jan 27 at 6:04 PM\nShort but Very Well Done\n\nThis adorable puzzle game is 4 chapters long with a prologue and epilogue. Each chapter leverages different mechanics that build on the previous chapter. The puzzles themselves present a little bit of challenge but are by no means impossible. My only complaint is that the game was too short.\n\nHelpful | 1", "SixStringCreedJan 30 at 1:20 PM\nWhat a gem of a game!\n\nLoved every second of this. As others have said, it is a little on the short side but fun, engaging and so brilliantly unique!\n\nA great story and the developers have made a real treat of a game. Hope to see more like this or if were very lucky, maybe some more content \n\nHelpful | 1", "LordJack225PigJun 12 at 4:50 PM\nWow\n\nThis is what VR is all about. This fun idea would only work in a VR space. Its incredible, bravo to the devs\n\nHelpful | 0", "ThunderSun1972Jan 25 at 5:19 AM\nThe biggest and littlest of games\n\nLoved this game!!! Probably one of my favorites now. It's big on fun and little on time played. Played through no hints. Once I figured out the \"size\" of the game I was thrilled!! Didnt take long to get through it as I didnt stop playing it!!! I would recommend playing this game. Would like to see another like this one but longer play or maybe an update with a couple bonus chapters! Love the idea and concept of the game!!\n\nHelpful | 1", "kimbiecookieJan 24 at 10:28 PM\nA game within a game within a game...\n\nThe inception theme is quite imaginative. I love miniatures and love that this game incorporates miniatures but yet you are the miniature! It is little mind bending at first but then makes total sense. A wonderful, relaxing game if you like puzzles. I'll admit I had to turn the hints on mid game because some of the solutions require a bit of critical thinking. Highly recommended if you enjoy puzzle solving games.\n\nHelpful | 1", "Ajram1983Feb 7 at 1:42 PM\nA lovely little game\n\nI bought this game when it was in sale recently and finally got around to playing it. The only way I can describe it is lovely. A really nice story and some simple puzzling. It wont take long to complete but is worth the low price\n\nHelpful | 1", "tomsimmonsJan 26 at 1:30 PM\nMakes you think\n\nThe first game I have purchased and completed on the Quest. Liked the idea, was looking for something other than the inevitable shooter. Makes you think, graphics are good.\n\nMy only complaint would be that it's a little short, and once played there is nothing more to do.\n\nHelpful | 3", "CaminoDiabloFeb 5 at 5:48 PM\nAwesome VR experience\n\nIts short but very sweet. Trying to figure out what to make big and what to make small is something I have never encountered in a game. The game play is worth the money. Might only play it once but its something your going to remember.\n\nHelpful | 1", "OndrejicekFeb 25 at 10:23 PM\nMasterpiece\n\nBeautiful game with unique puzzle mechanism. Not too hard but very enjoyable. Feels very well-made and polished. Must have for all Oculus owners.\n\nHelpful | 1", "The_UntouchableMay 4 at 5:36 PM\nGreat puzzle game\n\nThe only thing I would change about this game is that it is a little longer, or have had the puzzles later a littler bit more challenging, but it is still well worth the money. I would recommend this too anyone who wants an interesting game and has an hour to spare. I love practically everything about it.\n\nHelpful | 0", "LadyCapt_JacksJan 23 at 8:08 PM\nImmersive and Unique experience\n\nEnter the world of a fisherman. At first, I thought it would be boring, but it started off quite peaceful, imaginative and simple - I'm on a boat, standing in front of a mirror brushing my teeth and then light a fire.\n\nAs the game progresses you start to see the world isn't so simple anymore. I did not read many reviews as this game was part of a sale, but this is a beautiful tale and clever use of VR. Time went by quickly and a lovely escape from modern life exploring this magical space. Puzzles are clever and the story is interesting. A worthy experience so far!\n\nHelpful | 1", "dreadpiratedustyJan 23 at 7:11 PM\nAn incredible experience!\n\nI have had my Oculus for a few weeks now and this game is the first time I have lost myself in the gameplay. I am not one for multiplayer and fast action, and this puzzle game is a blast! I love that scale and perspective is used to solve the puzzles and cannot wait to finish it! I hope this game grows with updates or similar games come out. This game is a blast!\n\nHelpful | 1", "romanzesMar 8 at 6:58 AM\nMasterpiece\n\nAn excellent, mind-bending VR adventure. Recommended for all fans of Escape Room genre.\n\nHelpful | 0", "Noor_AzzonyMar 17 at 12:53 PM\nShort but worth it!\n\nThis inception-style game is worth it. The creativity, the narrative, the graphics and gameplay is brilliant. Just wished I could enjoy playing it more.\n\nHelpful | 1", "devoramaFeb 16 at 9:11 AM\nA unique puzzler with great visuals\n\nIf you like puzzle games and more cerebral movies, this is the game for you. It's not a very long game, but it's one of the most high quality narratives I've seen in a game. Well worth it.\n\nHelpful | 1", "ElyrthalJan 29 at 1:41 AM\nSo short... but a real Masterpiece\n\nYou will complete it in less than 1hour if you have some imagination, but the realization on Quest is so polished and the experience itself so exceptional, that this tittle well worth being purchased and kept.\nDefinitely one to be shown to introduce people to VR.\n\nHelpful | 1", "scottish_mathetesFeb 14 at 9:35 AM\nGood game, but not satisfied\n\nThis game was difficult for me to rate. The game itself is well done, it provides a fresh way to solve puzzles with the inception-like gameplay, the graphics were ok, the narration was good, but in the end I just felt like I was left wanting more. The play time came in at about 2 hours, and when I finished the game I thought back on the entire story and kinda felt like, \"was that it?\" If I had spent five dollars on the game I would have felt very comfortable giving it 4 stars, but for the full price that I paid, personally, I don't feel that it was quite worth it. I mean no disrespect by that, plenty of people have loved this game, and that's awesome! For me though, I was just a little underwhelmed.\n\nHelpful | 3", "UnTaL3NT3DJan 15 at 9:52 AM\nA Beautiful Masterpiece\n\nThe meticulous detail implemented in this game leaves you both astonished and wanting more. The design and music were so captivating, I spent most of my time just wandering around inside the game appreciating my surroundings rather than continuing the storyline. The interactions with the objects and characters within the game felt so lifelike, with the soothing narrators voice creating different personalities, I felt like I was inside a novel. The concept is similar to the film, Inception. A truly beautiful experience, I wish it never ended.\n\nHelpful | 4", "gohan278Apr 11 at 10:26 AM\nB wry goood\n\nGod gme\n\nHelpful | 0", "videoalexFeb 17 at 5:39 PM\nAwesome\n\nThis is a veeeeeery clever game. Maybe you want a brain-bender. Maybe you want a game that isnt about shooting. I love it for the innovative idea at the heart.\n\nHelpful | 1", "BigelowedJan 13 at 10:30 PM\nShort but powerful\n\nIt's a short story more than a big tale, but that doesn't stop it from keeping your interest from the very start to the time you reach the end.\n\nI might even play it again, but it's worth full price for my solo play not just all the sharing with family and friends.\n\nHelpful | 2", "OrangeElementFeb 24 at 7:12 PM\nFisherman's Tale\n\nThis game is insane. It really is a mind-blowing game. I had a general idea getting into it but the introduction was spectacular.\n\nHelpful | 1", "EpsilonTurtleJun 6 at 8:48 PM\nVery good\n\nI got this on sale and thoroughly enjoyed it. A big mind-bender, however it was a little short. *spoiler* There are 6 parts but I was able to get through it in 3 hours. If you can get it on sale its worth it. 11$ game.\n\nHelpful | 0", "halfcentMar 6 at 1:38 PM\nBeautiful Game\n\nIntriguing reality-bending puzzles and an utterly charming storyline. I love this game.\n\nHelpful | 0", "jacobphilliJan 13 at 5:21 AM\nThe Standard for VR Story Telling\n\nA mixture of satisfyingly difficult puzzles with awesome voice acting and visuals made this a really immersive game to play. The story is unique and creative and easy to get in to and role play. It takes about an hour and a half and has options to toggle on or off hints if you want more of a challenge. It uses some clever things that can only really be done in VR, and when youre done you feel like you just woke up from a dream.\n\nThis was the first VR game my girlfriend has played all the way through. I feel like Im inside a story book.\n\nHelpful | 4", "XevinDFeb 5 at 7:58 PM\nShort but awesome!\n\nThink of this game more like a movie. It's only around 2 hours long, but it's awesome! The puzzles arent super hard, but they are engaging and fun. The story pulls you in and moves you by the end. Check it out!\n\nHelpful | 1", "diomarkMar 1 at 9:28 AM\nWow, just wow\n\nOnly about 30min in and I'm told it's a short game, but wow. Of you're on the fence, just grab it.\n\nHelpful | 1", "PunkyBrewsterMay 22 at 1:50 PM\nShould be a 5 star ... but short\n\nThis is a brilliant game. Very unique and I had a ton of fun. My only complaint is that its too short. Cant remember what I spent ... but if its more than $20 ... mmmm ... a little too short for that maybe.\n\nIf it was just another hour of fun packed in there it would have got 5 stars\n\nHelpful | 0", "GroeneDraekFeb 11 at 12:51 PM\nShort but nice story\n\nThis game is affordable but as you can expect also a bit short. Not difficult and playable with family. From start only 4 chapters. Could have been easy 5 star rating and would normally give 3 stars but because it is wel made and Dunn to play e well deserved 4 stars.\n\nOnly few bugs, when picking up items and walking, don't come to close the the books shelves, your items will be stuck there and you have to do over a few minutes gameplay because of this.\n\nHope the makers will update this game with 2 chapters to give this a 5 star rating.\n\nHelpful | 0", "Saboo27Feb 17 at 11:20 AM\nAwesome\n\nAll the good reviews I read were spot on. This game was very unique in its style and really fun. It was a simple story but very compelling.\n\nHelpful | 1", "DJ_GavinoJun 23 at 3:01 PM\nCool\n\nIt was cool\n\nHelpful | 0", "kristin.sherwood5Jan 11 at 7:17 PM\n\nJust, wow. This game is so immersive that it took me a few moments after taking off my headset to readjust to reality. Every chapter brought a new level of \"wow\". The puzzles were clever yet doable; the narrator would drop hints if he could sense I was stuck (ie, taking a long time). The entire story left me mesmerized. So glad I listened to the advice of reviewers and gave this game a try. As others have said, it is on the short side, but it's well worth the money.\n\nHelpful | 3", "BlueEyes300Dec 9 at 7:09 AM\n\nIm going to give it 2 stars however the graphics is just beautiful...I am Deaf and I have no idea what they are talking about ... need to add subtitles.... its the 20s. All game or app that has a narrative should have subtitles... I cant enjoy this game without the subtitles. I will raise the stars to 5 when this is added.\n\nHelpful | 117", "talktourselfFeb 9 at 1:14 AM\nGreat game\n\nThis is awesome. Good puzzles and interactive. Really original and cool concept. My kids like to watch via casting on the phone and help with the puzzles. Great experience.\n\nHelpful | 1", "BadLarryNYJan 28 at 2:16 PM\nTruly unique and original! Outstanding!\n\nTotally ignored this when it came out. Just bought it on sale and its shot right to the top of my list of greatest VR games. In a marketplace full of overpriced apps, this one actually feels comparatively underpriced. Dont miss out!!!\n\nHelpful | 0", "pieduke8Feb 23 at 10:42 AM\nWhat a beautiful and well executed story\n\nIncredible game mechanics that maximise the power of VR. A must try. The storytelling is also stellar!\n\nHelpful | 1", "FwakFeb 12 at 7:27 PM\nBeautiful game!\n\nEverything about this game is top quality. Interesting unique take on puzzles. A showcase for VR! Yes it is short, but the quality makes it a must buy\n\nHelpful | 1", "Kawaii_BroccoliJun 11 at 8:22 PM\nits really good\n\nthat's all I have get it if you can and like puzzles\n\nHelpful | 0", "IllbarrelFeb 6 at 6:29 PM\nBest game\n\nThe best game that I've played in VR, and short but very sweet story that doesn't drag on too long and is accompanied by great gameplay as well. Couldn't recommend to enough\n\nHelpful | 1", "Methodman19Jan 11 at 11:52 AM\nGreat story and game! Cant wait for more\n\nThis game was recommended to me from someone in the facebook Quest group. I bought it and now i see why he was raving about the game. I enjoyed the story, felt like an adult being a kid again. Very creative and didnt want the game to end. Looking forward to more games like this one!\n\nHelpful | 3", "purgeJun 11 at 2:33 PM\nLovely stuff\n\nNot my words Micheal, the words of shakin Stevens\n\nHelpful | 0", "dplace76Feb 7 at 9:26 PM\nA fun brain teaser\n\nNot very long but but it doesn't matter. What it packs in length it makes up for in creativity. It forces you to think outside the box and is family friendly.\n\nHelpful | 1", "ProvenITJan 11 at 12:04 PM\nFascinating concept and great puzzle\n\nGame is soothing. No pressure. You are free to explore and play with physics and scaling. Great for seated and standing play. Suitable for children who can solve puzzles. Had fun with a few quick play sessions and have sat down for an hour and played as well. It's not a huge game. Definitely worth $14.99.\n\nHelpful | 1", "lanmarkFeb 13 at 5:34 PM\nClever and fun\n\nVery clever game that is fun to play. No complaints really.. this is one of the games I show friends that haven't ever been on VR\n\nHelpful | 1", "tzoldFeb 2 at 9:37 PM\nA tale minus the pole and reel.\n\nDidnt know what to expect with this title going in so when i found myself within the walls of a model lighthouse i became giddy immediately. Its a title that doesnt allow you to overthink it and that is a simplistic pleasure here. I purchased for $10 on a flash sale and for the length of content it provides that really is a steal. Go ahead and pay the $15 asking price because it is worth it. Excellent use of puzzle solving and a narrative that is as elegant as it is intelligent. I hoped for just a tad more content for a perfect score. Please devs consider adding!!\n\nHelpful | 0", "JVDCFeb 3 at 12:10 PM\nVery cool\n\nI really like the story line and the visuals but its kind of easy to solve if you an adult. I was hoping the puzzles would be harder with less help from the game and that is with the hints turned off. The only other thing i did not like was that there are not enough chapters to complete. But overall, i recommend and like the game.\n\nHelpful | 0", "RenderArtist22 days ago\nHype.\n\nMy least favorite experience on the Quest so far.\n\nHelpful | 0", "KingBadger77Jun 24 at 1:01 AM\nBeautiful and surprising experience\n\nSuperb game, some minor technical issues but not enough to take away the enjoyment.\n\nHelpful | 0", "DallasCowboy93Jan 12 at 12:47 PM\nA Fisherman's Tale\n\nThis game is Very Different and Very Surprising in a Very Positive Way. Makes Great use of Spacial (Dementional) Exploration that's Unique in Quest so far, a Mysterious Story Line and some Highly Challenging Puzzles to Create a Really Fun and Original VR Experience.\n\nHelpful | 3", "MobileNPCDec 5 at 11:04 PM\nBuy it\n\nStop reading this review and go buy the game. Why are you still reading? Go. Go now. Really though, you're wasting time that you could be playing this game. Just stop reading and go buy the game already. Why are you still here? Do you have some odd addiction to reading reviews instead of playing the game? You odd, odd fellow. I'm done, move on to the next review; or you could just go buy the game. Do that instead. Stop reading the reviews you weirdo.\n\nHelpful | 20", "kem423Feb 2 at 12:38 PM\nGreat short experience\n\nThis was a great experience. Very visually appealing. Interesting story. Just very short. It ended and I was wanting more. If you get this game you should turn off the hints. The puzzles are pretty easy so take time to enjoy exploring the rooms by not using any hints. Some Easter eggs would have been nice. Maybe interactions with things that are just fun but arent necessary to the story. There was not a lot to do to solve each stage so more interesting item interactions would add some replay. As it is though for the sale of $9.99 it was a good experience. I would have a hard time spending more than that sale price with its limited content.\n\nHelpful | 0", "PDMarsayJan 25 at 8:38 AM\nBest use of VR yet\n\nTook a punt on this while on sale, and it's the best money I've spent on a Quest game yet. It is short, but top quality and one of the most immersive games available. Hope to see more from the developers soon!\n\nHelpful | 2", "vrabbitsNov 27 at 9:43 PM\nWow just wow.\n\nLove the game so much. It's great in every way. Only one complaint and this is just from a parent stand point. Id love a feature to get rid of the mild profanity. Its not very often but it's still there and I have a strict no profanity rule. If the devs are reading this please add this feature it would make the game 100% perfect. Theirs really no point in making a beautiful rated E game and then put mild language in it.\n\nCompleted the game and it's amazing. Yet short I highly recommend it.\n\nHelpful | 9", "biggspideyMay 16 at 4:00 AM\nExtremely Well Done\n\nFascinating engrossing gameplay, incredibly immaginative situations, consistantly awesome artwork/style, perfectly level of difficulty for me - highly recommended!\n\nHelpful | 0", "wquFeb 11 at 9:19 AM\nAmazing game but too short\n\nEvery level has something unexpected. The puzzles are very clever and fun to work with little self. I just wish there are more levels to play\n\nHelpful | 0", "GodOfSalt27Jan 18 at 7:32 AM\nLove this game!!!\n\nI bought this game because it was on sale and it looked like a lot of fun. When I started playing I didnt put down my oculus. I love the inception and the art style is really nice to look at. I think its worth every penny.\n\nHelpful | 3", "gelsen.puaMay 21 at 6:32 AM\nBrilliant VR experience!\n\nShort and simple but with a huge depth of experience.\nJust got a Quest? Get this game first! It will show you what's possible with VR.\n\nHelpful | 0", "CarpetScarfMay 9 at 3:27 AM\nAwesome game!\n\nThis game is pretty clever and fun to play. Yes its short, but its worth the money and so nicely polished. It has a nice story and I liked the narration. I would definitely recommend this.\n\nHelpful | 0", "AuldstockJan 25 at 6:14 PM\nWell worth it!!!\n\nExcellent experience, creative gameplay and overall outstanding quality. Some complain that it is short, but the detail gone into this game is amazing. Just get it, especially when it's on sale, it's a no brainer\n\nHelpful | 1", "signal9May 9 at 4:18 PM\nSo good I played till the end in one go!\n\nAmazing game that thoroughly enthralled me beginning to end. Forgot I was in VR is just enjoyed the game. It would be 5 stars if it weren't so dang short! There were a couple moments where I had no clue what to do or I had done the right thing but was still having trouble moving forward, but I got there eventually.\n\nHelpful | 0", "cameronmccartneyJan 29 at 6:53 AM\nShort but Sweet\n\nTrippy game, very enjoyable. Both my kids and I enjoyed playing it. The only downside is that you can complete it in 2h. Im used to PC games where I get hundreds of hours of gameplay for my money. Its a good thing that Oculus games cost less but its still disconcerting how short they are.\n\nHelpful | 1", "PunisherFeb 3 at 10:16 PM\nGreat little title\n\nI bought this on sale and it was great value. The game is not long but it's very polished. Loved the mechanics, the story and the visuals.\n\nI want more of this goodness!\n\nHelpful | 1", "chucklasFeb 27 at 3:14 AM\nGreat game. Not very long, but great.\n\nVery short, but what is there is fantastic.\n\nHelpful | 1", "KingDavid8May 28 at 11:39 AM\nBeautiful game\n\nI felt like a kid again when playing this beautiful game. Worth every penny I paid for it.\n\nHelpful | 0", "amanda.kassJan 19 at 5:04 PM\nImmersive and interesting\n\nIt took me around 2 hours to beat, but given that it was only $15, I thought it was money well spent. Very interesting concept, very immersive. Inception was a great comparison! 10/10 would reccomendation\n\nHelpful | 4", "ShaneDohertyFeb 4 at 11:11 PM\nFantastic immersive story experience\n\nGreat use of the VR tools to bring you into the story and engage in some fresh concepts. Really enjoyed this and hope the team are working on more.\n\nHelpful | 1", "yorkie21Jun 12 at 2:57 AM\nLost right hand?\n\nEnjoying this game but my right hand has gone? Turned the quest off and on put new batterys in the controller still no joy. Right controller working on other games anyone experiencing the same problems or any idea how I get it back?\n\nThanks\n\nHelpful | 0", "obi2kenobiJun 10 at 7:03 PM\nI followed the rave reviews here\n\nAnd Fisherman's tale did not disappoint. Easily one of the best VR experiences - every facet of the experience is beautifully polished (concept, graphics, audio, etc). The graphics are pretty incredible for Quest. Definitely the best water I have seen.\n\nThey really put the extra effort into the little details that make the world come to life-for example almost all objects or furniture can be interacted with and each makes unique sound effects (unlike other games where its the same sound effect between a cup and a book). The objects also all collide with one another unlike some other games where objects pass through each other freely, killing the immersion.\n\nThis really sets the bar for the quality we should expect from VR titles.\n\nI do think there needs to be a \"mercy rule\" where if you can't figure something out it tells you what to do after a set time. Ive gotten stuck multiple times and had to exit the game and search online. You get stuck for so long you sometimes forget what you were supposed to be doing to begin with and it never actually tells you, it just gives hints which are useless when you can't even tell what you're looking for. So minus a star for what I believe are at times poor prompts that get you stuck due to poor direction not lack of creative thinking. Also the final puzzle i found to be difficult to do with the controls, even though I knew exactly what I wanted to do and how to proceed.\n\nHelpful | 0", "meduzoJan 25 at 8:26 PM\nGet it on a sale\n\nThis game is awesome and if you have the money to spend on it right now, do it. That being said, I got it on sale and I think $10 is the perfect price for an experience this short.\n\nMechanics are amazing and they work as they should, story is quite nice too (and I'm not into story driven games in VR that much), so my only problem is that I expected more, more of it, the concept feels unexplored and begging for more content. I really hope they make some sort of part 2.\n\nHelpful | 1", "FrogAssasianFeb 9 at 4:43 PM\nOmg\n\nIt had me thinking\nReconsidering\nAnd on top of that the graphics were really good\nHope they make some more chapters\n\nHelpful | 1", "junehaoFeb 1 at 10:28 PM\nAwesome gaming experience\n\nThis game opens up our imagination of what we can do in VR. It totally release the power of VR by creating an unusual and superior spatial experience.\n\nHelpful | 1", "shdwlynx2Jan 27 at 8:34 AM\nExcellent brain bender, but a bit short\n\nIf you're familiar with the blockbuster movie, Inception, this is not like that at all, but there are similarities. Unlike Inception, where the characters each only exist in one dream level at a time, in Fisherman's Tale, you exist in multiple nesting Russian doll type \"realities\" simultaneously.\n\nIt is a very cute little game. Almost innocent in it's beauty. It almost seems simple, but it's not. It's wonderfully narrated (assuming you enjoy a clear and calming French accent). It's beautifully designed. If you liked old games like Myst, you'll like this.\n\nIt's smart and will test your wit. There is no time critical situations, so you can go as fast or slow as you like. The puzzles can only really be appreciated in VR. Execution of tasks in multiple realities at once is more satisfying than I had expected, and I had expected it to be quite interesting. It's incredibly immersive, and you won't want to quit until you complete it.\n\nAnd that's the only reason I didn't give Fisherman's Tale all 5 stars, because it's a little on the short side. I completed the game in one session. This is a common issue with all good VR games presently available. I loved Moss, too, but it was also short compared to similar games you'd play on PC or game console.\n\nSo even though it isn't as long as I'd like, I highly recommend buying this game and I look forward to the next title made by this developer. Good show, Old Chaps!\n\nHelpful | 0", "digiomegamonJan 26 at 7:35 PM\nA+ concept, A art but no replayability\n\nThe concept is crazy good. Really awakens your mind! Beautifully designed and their puzzles and gameplay are well thought out. A nice and well written story.\nUnfortunately, it is pretty short. My brother finished it under an hour, I took just under an hour and a half.\nIn addition to the disappointing length, gameplay is also pretty restricted. There aren't a lot of things you can do outside of picking items up and moving them. Because of the linear gameplay, there is absolutely no replayability.\nConclusion, I would recommend buying it if the price is worth an hour of your time.\n\nHelpful | 0", "Flashbang2411May 5 at 10:00 AM\nVery fun to play. Short and Sweet.\n\nBought this on sale for about 8, glad I got it. Although it's quite short it's a surprising and mind bending game, it wasn't easy but it was challenging enough to get you thinking. Graphics were impressive especially at the end of the game. The art style was also pleasant. All in all, a brilliant, if not slightly short (being about 1-2 hours long) game. Honestly anyone thinking about getting it, should. No wonder it got an award. The use of size and depth is a brilliant quality when it comes to VR and this game captures that beautifully.\n\nHelpful | 0", "eL.Dud3Jan 27 at 7:32 AM\nFantastic concept, just a little short\n\nThe immersion is great, voice acting is great, puzzles are not too hard (even without the hints).\n\nThere are some technical glitches, whereby the player teleports into the wall and items get clipped into the walls too.\n\nOverall, great game show off the quest. Although due to shortness of the game, replayability is pretty low.\n\nHelpful | 0", "cara_amiraJan 25 at 10:13 AM\nVery unique masterpiece\n\nThe game made me wonder, was I playing a dream someone once had and then made to live in this game. Otherwise I can't imagine anyone to come up such a unique idea which can be found in this lovely adventure. Afterwards I'm still thinking about somekind of an explanation to all this-have even come up with some sort of theory of what is this game all about. I guess you'll just have to buy it yourself to figure out your own truth ;)\n\nHelpful | 1", "mr_seeboJan 25 at 12:26 PM\nGreat puzzle game with a twist\n\nThis is a fun puzzle game and the use of a environment within an environment is quite unique. I have only played it for a couple hours so far. The hint system provides hints via dialogue so you need to listen at all times. The puzzles havent been impossible but I am just getting to chapter 4.\n\nThe use of getting things and switching them between the model and outside is really quite Fun. I have a couple of issues where items get stuck but there seems to be a reset function when needed items fall out of reach. I hope they deliver more games like this.\n\nHelpful | 1", "barrystoatFeb 12 at 3:48 AM\nAwesome\n\nThis is a great game, it really takes you somewhere else. One of the best VR experiences out there.\n\nHelpful | 1", "Dr_J_WalkerJan 26 at 6:16 AM\nWonderful crafted experience\n\nI had a blast playing this game! As other reviewers have said, this is an inception type of experience. It is a one of a kind experience that makes me glad to have purchased it.\n\nHelpful | 1", "NukemarineJan 26 at 5:02 AM\nBeautiful game, but it's very short\n\nExpect to finish this game in under an hour even without hints. While you might replay it there doesn't seem to be much to encourage it other than reliving the visuals. Make sure you weigh this prior to purchase.\n\nWith that out of the away, this game is pretty amazing due to its fantasy like story and creative perspective puzzles. This is a game made for room scale VR so try to move around as much as you can. The rating is due to the short play time compared to the price but you might find that a non-issue.\n\nHelpful | 0", "jebaloxMar 28 at 3:12 AM\nToo short\n\nThe story is nice and the game is beautiful but it is too short. If the price it is not a problem go for it.\n\nHelpful | 1", "RocketFamilyJun 3 at 8:10 AM\n\nThey need to give you 10 stars to rate\n\nHelpful | 0", "CarbonArkDec 24 at 4:15 PM\nExcellent but short\n\nA fantastic, fun, clever use of VR in a way that wouldn't be doable using any other format. A bit on the short side, especially if the puzzles don't stump you (which they shouldn't as they're straightforward once you accept the scenario) but worth every penny and left me wanting both more of this tale and more of this concept\n\nHelpful | 5", "Ommmm_2486Feb 2 at 5:00 PM\nOne of the best for VR storytelling\n\nThis makes the most of what VR has to offer and tells a great story. Very few experiences do both. Setting the path forward! Nice work!\n\nHelpful | 1", "makeuncgJan 25 at 10:24 PM\nThat was amazing\n\nI just bought this tonight and played the prologue and chapter 1. That might have been the most amazingly mind bending experience Ive ever had. I cant wait to keep playing.\n\nHelpful | 0", "axolotlPlayzFeb 10 at 8:04 AM\nFantastic fun\n\nMind bending, puzzle adventure. Lots of fun, really makes you think.\nI want more like this :)\n\nHelpful | 1", "mpeabodyJan 25 at 7:31 AM\nWell worth it\n\nI've played through it twice so far. It's an amazing experience. Unique gameplay, great story, and fantastic voice acting. I hope to see more from this developer.\n\nHelpful | 2", "FlipB414Feb 10 at 4:58 AM\nLoving it........ so far.\n\nNew to VR, only had my quest for about a month. Have not finished the game but this it the first game that I have not been able to put down. Battery was not fully charge so i had to stop playing to recharge. :-)\n\nHelpful | 0", "FotofantasiesJan 30 at 7:15 AM\nLoved it\n\nFrustrating at times but completely immersive. Long enough to get some value but short enough to want more. Messes with your mind until it hurts.\n\nHelpful | 1", "SchindigJan 25 at 7:07 PM\nNothing like it...\n\nThis game is a creative treasure. Its fun, imaginative, and a great game to show new ones how great VR can be. Definitely worth your hard-earned workin-stiff money.\n\nHelpful | 1", "DinoZhee918May 4 at 7:24 PM\nLoved it!\n\nEven though it can be a little perplexing at times. Its a great game, especially for beginners. And a fun game for those that arent looking for anything strenuous.\n\nHelpful | 0", "SamuelRowanJan 25 at 1:24 AM\nGreat but a bit short\n\nThere's no other way to say it. It is art. The length of it would normally be enough to knock a star off but, it is so well done it's more than earns back that star.\n\nHelpful | 1", "WubalubbadubdubMar 21 at 2:10 PM\nShort, but oh so very sweet.\n\nNot a very long game at all, but a unique and very very creative one.\n\nThe shortness of the game is the only thing that keeps this from a 5 star rating. I enjoyed every second of it, I just wish there was more.\n\nHelpful | 0", "ivoloshinFeb 5 at 7:43 PM\nFantastic!\n\nAwesome little game! A lot fun! The match thing at the end was very frustrating but overall I highly recommend it!\n\nHelpful | 0", "xBeastwoodxJan 23 at 5:42 PM\nNice story driven game\n\nCool concept.. Like a live action Babushka doll play.. Narration and art style remind me of Braid.. Got on sale for 10 dollars, definitely recommend at that price\n\nHelpful | 2", "ArntsonFeb 17 at 8:32 AM\nBeautiful\n\nWow didnt expect to like this so much.\n\nHelpful | 1", "MoonFetusFeb 22 at 3:08 PM\nGreat, but a little pricy at full price\n\nToo short for the price.\n\nHelpful | 0", "denytheman1Jan 28 at 12:19 AM\nEnjoyable but leaves a lot to be desired\n\nThis game is more like a narative with some player interaction. Only gives you about an hour or two of gameplay if you include the closing credits.\n\nOnce you figure out the first puzzle, all the rest follow the same concept. The most challenging part was to move an object through a tight space in vr. And the worst part is there are no challenges or achievements, no point of replaying.\n\nHelpful | 2", "Sweet_macB80Feb 10 at 2:19 PM\n\nI loved it story was unique and just really enjoyed the puzzles!!!\n\nHelpful | 1", "SankyuFeb 20 at 6:06 AM\nThe Game\n\nI like it \n\nHelpful | 1", "evil_weevil64Jan 28 at 4:51 AM\nDifferent but great!\n\nA very good puzzle-Game with a nice story and an extrordinary Setting.\nA musst-play imho.\nBut way too short....we want more....\n\nHelpful | 1", "jaytin69Feb 10 at 7:05 AM\nBit of a love/hate thing going here...\n\nFirstly, the concept was pretty awesome, I found the actual idea to be very novel and fun.\nSecondly, there were a few very frustrating moments.\nThirdly, the voice-over guy was just great, I really liked his voice!\nOverall it's a short (unless like me you get stuck a LOT) adventure in a crazy world. I did find a few parts really entertaining and they made me smile. Other parts drove me crazy as I just couldn't work them out or they didn't seem to work quite as intended. Near the end when the rules seemed to change I found that very confusing and it made me a little annoyed. Still a very interesting idea.\n\nHelpful | 1", "Jen441Jan 25 at 5:03 AM\nWell worth the great price!\n\nThis is such a fun and intriguing game! I do wish it were longer just because I want to play it more. I try to get everyone to play this one.\n\nHelpful | 1", "smithjl1982Feb 8 at 6:15 PM\nLove this game!\n\nI avidly love this game. It's beautiful, puzzling, and so imaginative.\n\nHelpful | 1", "Christoph2020Jan 23 at 11:11 AM\nWonderful game, but far too short\n\nI'd love to give this game 5 Stars, i really do! The concept of big and small, the lovely details, beauftifully fitting graphics and narration mak this game a gem. BUT: just when you start to really \"live\" and in that big small lighthouse, the game is over.\n\nHelpful | 1", "omer.ravivFeb 15 at 12:26 AM\nVery cute and charming\n\nNon frustrating brain twisters\n\nHelpful | 1", "dragonlover1122May 31 at 1:56 AM\nBest game ever\n\nYeah\n\nHelpful | 0", "espike1Dec 28 at 11:24 AM\nSo Trippy and Awesome!\n\nI am not a very \"clever\" person and I usually just like looking at the designs and what you can do. This game is TRIPPY! I love it. The first part with the Doll house, your house and the outer house is just great. I recommend this to anyone and everyone!\n\nHelpful | 2", "ussturnipNov 28 at 1:27 PM\nAstounding game\n\nI was not expecting that. I feel that I have had my mind altered (in a good way) by this game. Lovely visual design - which would appeal to child and adult alike, with a game design that would challenge a timelord. well done to the dev team and thank you!\n\nHelpful | 5", "mrandle122Feb 8 at 5:32 PM\nShort but sweet\n\nThis was a very good game, probably the best \"escape room\" type games on the quest so far. Only gripe I have is the game is very short and has not much in the way of replayability.\n\nHelpful | 0", "AlbertoCarlierDec 1 at 2:21 AM\nExactly what I expect from VR\n\nI totally loved this game. Could be a little bit longer and had more difficult puzzles, but the whole concept and mechanics are mind blowing. Is almost like if Christopher Nolan had made this game. Beautiful graphics as well. For me is one of the best experiences I've had in virtual reality.\n\nHelpful | 3", "GlassArtGirlJan 1 at 6:57 PM\nGreat Puzzle Game!\n\nI really enjoyed playing this game. The look of it was great. The puzzles were fun. It has an original concept. The only negative thing I have to say is that it wasnt long enough. I hope theyll consider updating it with more.\n\nHelpful | 2", "ParadiseDecayNov 23 at 10:59 AM\nExquisite and Superb on Quest!\n\nMy Quick Thoughts:\nThis is an Award Winning VR title and it shows.\nA mind bending puzzle adventure from the creators of Arizona Sunshine and it takes full advantage of what VR can offer. Simply Superb and just as good on the Quest as on PC.!\n\nExclusive Look Video (Contains Spoilers):\nhttps://www.youtube.com/watch?v=XMGob9RkI5g\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR A Fishermans tale')\n\nHelpful | 21", "oldeltaDec 7 at 1:53 PM\nImmersive & Memorable\n\nI really enjoyed playing this game...so much more than I originally thought. I didnt know what to expect at first, but once I dove into the narrative and puzzles I was completely hooked. This is the first game Ive actually finished on Quest. I usually start and stop games...sometimes I come back and sometimes I dont. But I couldnt stop coming back to this immersive puzzler. I loved the inception-like feel of worlds within worlds! The feeling of being on that boat in the storm was awesome too. So much fun! Even though it was short I still think its totally worth the purchase. And Im glad the puzzles werent too difficult. Sometimes I just want to chill and enjoy a good narrative adventure with some light puzzles, which is exactly what A Fishermans Tale delivers in excellent form. Buy it!\n\nHelpful | 10", "MalthalusMar 31 at 6:48 AM\nGorgeous but short\n\nThe art is stunning, and the world immersive, with reasonably simple gameplay. I enjoyed it a lot, but given the whole thing took just over an hour and the replay value is... Limited, it's more a great example of \"this is what VR can do\" experience than a full fledged game.\n\nThat said, no regrets in having paid for it. Look forward to more from this studio.\n\nHelpful | 0", "jvg312Jan 12 at 1:11 PM\nGreat game, a bit short\n\nFor anyone on the fence its definitely a game worth experiencing - I found myself really enjoying it the game and thinking about the world within a world challenges. Graphics are good enough on the Quest, not having the cable makes a world of difference in the standing experience.\n\nThe only complaint would be in the end there were only a handful of puzzles to solve.\n\nHelpful | 1", "colin.forney.984Jan 2 at 9:26 AM\nFantastic Game!\n\nIf I had to use one word to describe this game it would be magical. If you're looking for something that's challenging (but not too challenging) I would recommend it. It is a little short but overall the experience was fantastic\n\nHelpful | 2", "KatGnPJan 25 at 4:32 PM\nGreat VR game\n\nThis was a fantastic game and the graphics are great. It has a great story and is fun. I wish the game was longer. I hope they come out with another game. They should not default hints on. Definitely turn them off for more of a challenge.\n\nHelpful | 0", "matEhickeyJan 26 at 3:49 AM\nBest game, bought it twice\n\nI love this game.\nI already own it on pc-vr but this game is so worth showing to family that the quest version is a must have.\n\nHelpful | 1", "SimJooFeb 4 at 9:53 AM\nSmall and large\n\nThe world around me has never been so small and large at the same time.\n\nHelpful | 1", "martin.buglass.71Jun 9 at 10:35 AM\n\nWould of given 5 stars but the game needs to be longer\n\nHelpful | 0", "highjump1993Jan 31 at 11:20 AM\nFishermans tale\n\nTwists and turns and winding everywhere. Love this game. Only negative, it was over way to soon.\n\nHelpful | 0", "VertigeVMar 29 at 6:31 AM\nA MUST PLAY\n\nI can't say enough about this game. It's so beautiful and magical. The puzzles are smart and outside the box, the writing and VO is great, the art direction is amazing, etc... It's also super charming and at times, pretty funny. And oh, SO creative!\n\nPeople are complaining that's its short and yes, it's short. But hey, it's also only 15 bucks.. To me, it's much better value than paying 18 for a movie .. This is exactly the kind of content I want, highly polished, entertaining, and immersive.\n\nGreat job to the devs for a magical and polished experience. This will be my new \"go to\" to show off my Quest to new people.\n\nHelpful | 0", "MullenManJan 31 at 7:01 PM\nAmazing\n\nThe graphics and gameplay was amazing. It was short but worth it for the price!\n\nHelpful | 1", "VexallJan 29 at 10:34 AM\nBeautiful, but needs to be longer\n\nGreat game but ends far too soon.\n\nIf a normal desktop game provides 100s of hours of entertainment for $60 this game should be about $6.\n\nThis is a beautiful morsel that makes your tummy angry there isnt more.\n\nHelpful | 0", "hopinfoxJan 27 at 5:17 AM\nWonderfully inventive\n\nBeautiful graphics and a good story. Not that short or easy as some have said. One of my VR. favorites\n\nHelpful | 1", "vrbryan71Feb 12 at 3:04 PM\nFun puzzle gane\n\nVery original have play\n\nHelpful | 1", "Lumix_guyMay 17 at 12:08 PM\nFun little adventure\n\nA clever little puzzle game that I throughly enjoyed\n\nHelpful | 0", "StreetkidzJan 26 at 5:59 AM\nAmazing puzzle\n\nThere are ways which will twist your mind but it is awesome and how the game is played is a whole new world\n\nHelpful | 1", "Topher-dunlapJan 8 at 1:17 PM\nOne of the best games on quest\n\nTotally worth the purchase. The environment is amazing. The game play is fun and challenging. The story is well done. Ive beat this game but would and will definitely play this again and again.\n\nHelpful | 1", "vr-illusionJan 3 at 4:50 AM\nway, way, way too short.\n\nIts so short that it isn't even worth the $15 I paid when it was on sale. Developers had a nice idea for an inception style game, but the game needs more locations and puzzles. Just take the boat and go somewhere else would have been an option, but instead the game just ends.\n\nHelpful | 7", "zack.slotkowskiJan 27 at 5:47 PM\nChallenging\n\nI love me a challenge and this game has it for me! Super fun and graphics are amazing. Good job devs\n\nHelpful | 1", "Aro3891Jan 26 at 4:36 PM\nAmazing magical puzzle game\n\nGreat graphics, puzzles, one of the best experiences on quest...it feels like you are in a magical world\n\nHelpful | 1", "DonChangJun 11 at 12:51 AM\nFun but too short\n\nFor the price there isn't enough content, although it was very entertaining it was far too short for me to enjoy, it took me less than an hour to finish\n\nHelpful | 0", "shield_agentFeb 8 at 9:20 PM\nShort but sweet.\n\nFun, well crafted VR gem. Definitely a case of quality over quantity, but still a little shorter than expected. Great gameplay and it looks fantastic.\n\nHelpful | 0", "MrDonnieXMar 26 at 10:33 PM\nLove the game, but...\n\nLove the concept of this game! This would not be possible without VR. Keep making games like this. Love it! However, the game is way too short. Beat it within 30 min, first time play through. Needs to be longer, way longer. Luckily I bought it at a discount, I see why now. But if there's an update for the same type of game, I'd buy it.\n\nHelpful | 0", "stromer16Nov 28 at 7:30 PM\nAbsolutely Incredible\n\nI dont know what else to say besides this is an incredible game. The incredibly immersive atmosphere and puzzles of this game are very impressive, and the story keeps you wanting more.\n\nRight from the start your mind will be blow at the mechanics of this game. The puzzles, though not super difficult, really get you thinking and solving them comes with a little sense of pride. The narrating is impeccable, very intriguing with a little humour thrown in here and there.\n\nThis is by far my favourite game on the quest so far, and for that price it is a must have for anybodys library.\n\nHelpful | 10", "Chris_StaceyNov 27 at 12:20 PM\nPuppet Inception\n\nThis really is a charming game with a unique style of play. It's no surprise this title won 2019 VR Game of the Year.\nAs wooden puppet of a lighthouse keeper, you have to interact with smaller and larger versions of yourself and your environment to solve puzzles and get your lighthouse working again in a storm.\nSadly the game is quite short (when I started playing my Quest was at 88% power; by the time I'd completed it the battery was still at 50%) - about 1-2 hours in length. However, it really is fun and it's one to show friends - they should be able to complete it in an evening and still have time for a few rounds of Beat Saber!\nLots of fun and one I'm sure I'll play again. Worth a look, as long as you don't mind it's short length.\n\nHelpful | 22", "ChlasmaJan 28 at 4:49 AM\nUhm\n\nTo the devs: i dont have to tell you anythimg- you know what you did there.\nTo anyone else: yes.\n\nHelpful | 1", "smahaney6Mar 28 at 11:21 AM\nVery creative puzzle! Turn hints off\n\nIt seemed like this game may be geared more towards kids due to the animation, but I'm 23 and I really liked it. Yes it was a little bit short but it was very much a full fledged puzzle. Turn the hints off, I don't know what they were, but I always like figuring things out for myself better.\n\nHelpful | 0", "dolphineyeDec 14 at 10:15 AM\nBest Oculus Quest game played so far\n\nThis is one of the best Oculus Quest games I've played so far. And the second one I've completed after Vader Immortal Ep1.\n\nThe graphics are excellent, the interactions feel very natural, the story line is really good - and sad :'(.\n\nFor people complaining about the game being too short, honestly, I think the balance is quite reasonable.\n\nI would only recommend that the game includes subtitles, especially for disabled people.\n\nWell, this game is worth every penny!\n\nHelpful | 2", "Emily55555Feb 1 at 6:20 PM\nHow magical!\n\nI loved every second. A perfect mix of puzzles and fantasy. Please make more games like this.\n\nHelpful | 1", "johannes.roineApr 5 at 3:06 AM\nAbsolute beauty\n\nA fishermans tale is one of the best games i have played in vr. I hav eplayed superhot, robo recall, beatsaber, u name it. But this game is the first one to give me chills it is so good! If tyere is ever a fishermans tale 2 i will buy it 100%\n\nHelpful | 0", "DupesterMay 5 at 12:12 PM\nA Fisherman's Tale\n\nI have only played for about 45 mins, but so far am loving the game. Certainly takes some getting used to the way the physics side of it works.\n\nI will update my review when I've posted it a bit more.\n\nHelpful | 0", "MunschoploMar 24 at 3:55 PM\nGood game but...\n\nFirst off, this is one of the coolest puzzle games I have ever played. The mechanic of the models within models is awesome. The only downside of this game is that it only took me about 2 hours to complete it. I would really enjoy a sequel or other game with the same mechanics. I would definitely recommend this game.\n\nHelpful | 0", "TeamRichardFeb 12 at 3:40 AM\nLanguage\n\nFor some reason the language setting was changed and at the beginning of the game and Im given 3 choices of a language, none of them being English. So basically, I cant play it\n\nHelpful | 3", "BlackGreedyFoxMay 4 at 9:00 AM\nFantastic game.\n\nThe game and the concept is absolutely amazing. Only reason I put 4 stars is because of the very short gameplay. If you can add some more gameplay with a future update, it will be a 5 star for sure.\n\nHelpful | 0", "AlabasterSlimDec 4 at 6:47 AM\nPlay with Hints Off\n\nI played through this last night and absolutely loved it. Its beautiful, the voice acting is stellar and its just polished from start to end. I had hints off and didnt have any issues with the puzzles, I would suggest playing this way to get the satisfaction of figuring out everything yourself.\n\nI cant wait to see what this team makes next!\n\nHelpful | 5", "PerfoARMar 22 at 3:30 AM\nBlowing my mind!\n\nI thought I've seen enough already with my VR gaming experience but goddamn I wasn't ready for this. It's disturbing and in a good way, really mind blowing. Everyone should experience the little genius behind this game. On top of it charming story and characters, great visuals and music. It's even coming for a reduced price these days so do yourself a favor and buy it. Also can't wait to see what's next from this developer!\n\nHelpful | 0", "myversiteeDec 6 at 5:47 PM\nMUCH too short for the price\n\nI really enjoyed the experience. The concept of the game is so magic. You really need to think in multiple dimensions when solving certain puzzles. Also the ending was very surprising.\nSo, for the story itself, the gameplay and the special graphics, I really much would have given 5 stars.\nBut ... after just 40 minutes of gameplay I realized it is over.\nThere is no alternative ending or additional routes, nothing that makes it a replayable game.\nI would call that an experience. And for 15 in my case, I would at least have expected a longer play time, more puzzles or alternative endings to encourage me to ever play it again.\nAnd for a presentation to others, this is no 5 minute experience to quickly show other people. So sadly it feels like too much money spent on 40 minutes altogether. So sad, I liked playing it.\n\nHelpful | 15", "Rawr_HarleyFeb 3 at 10:50 PM\nSo much fun!\n\nI love this game so much!!\n\nHelpful | 1", "kurt.waggonerNov 27 at 2:26 PM\nFun while it lasted\n\nIt was having a great time playing it. Took a break and ran a few errands only to find that the game was removed from my quest and just says pre-ordered and I cant play it anymore\n\nHelpful | 19\nDeveloper ResponseNov 28 at 5:57 AM\n\nUnfortunately this seems to be a store issue. We are reaching out to Oculus to have this fixed as soon as possible. Please bare with us as it is Thanksgiving in the US and their response may be a bit delayed. Thanks for your support and understanding!", "wildBcatNov 28 at 2:06 PM\nEssential Game!\n\nSee my full video review here: https://youtu.be/rrBY-OWjA9g\nThis game has become my new favorite! There are many factors that determine how good a game is: graphics, storyline, physics, voice acting, range of audience, etc. This game is one of the few that hits all of the marks! It is engaging for child and adult alike, the storyline is powerful, and the puzzles engaging. I dont regret this purchase one bit! It takes about an hour to play, and I am not sure how engaging it will be to replay it multiple times. But I think the price is worth it, even if you only play it once.\n\nHelpful | 7", "MajinpootFeb 7 at 6:32 AM\nGreat experience but alittle short.\n\nThe story is very good. I loved it. Only thing is it is short. I'm still glad I got to play it tho and it was worth 10 bucks.\n\nHelpful | 0", "zephyurhound2000Jan 29 at 7:41 PM\nGreat game.\n\nSo far this is my favorite on Oculus Quest.\n\nHelpful | 1", "Jordy.WadeJan 26 at 12:58 PM\nMind blowing\n\nThis game is super unique. Inception in VR\n\nHelpful | 3", "IvanRPMay 4 at 5:54 AM\nBeautiful game, great experience, but ..\n\nI found the game really beautiful and a great experience. That being said, for me who speak Spanish and am able to write / read English, it is really difficult for me to understand spoken English. I understand that putting voices in Spanish (and any other language) is complicated, but at least some subtitles, even if they are in English ...\nI had to return it because it was frustrating that for not understand a few words, ends up walking around the room, without any sense.\nPerhaps, in the future, they will put at least subtitles, and give it a try again.\n\nHelpful | 0", "jestr999Feb 2 at 5:54 PM\nWow\n\nSo polished and fun. Great game!!!\n\nHelpful | 1", "HotgerbilFeb 2 at 2:53 PM\nVery fun\n\nI love to play this at any time\n\nHelpful | 0", "theoryofeverywhereJan 25 at 6:21 AM\nBrilliant but Incomplete and Short\n\nThis game is based on a great concept. Like it is really clever and interesting. But the puzzles are sooooo easy (hints turned off even) making the game take probably around an hour. This really feels like half a game. The complete lack of any challenging puzzles at all makes this really feel like a half baked idea. Glad I got it on sale\n\nHelpful | 1", "negrila.catalinDec 31 at 9:25 PM\nGreat game, not great gameplay\n\nThe game is great even though it is quite short.\nI played it with hints off, and it's not hard at all. I think with hints on you would finish it too fast and be disappointed about the game being too short.\n\nThe 4 stars are for the not so great (terrible) controls over the puppet. I mean it's actually not that intuitive as other game like this are.\n\nHelpful | 0", "BronzeFoxxy25Feb 21 at 3:02 PM\nFisherman Tale\n\nThought it would be longer or more difficult, was disappointed.\n\nGraphics were nice though, but other than that wish it was longer, more puzzles & harder.\n\nHelpful | 1", "CasparasMar 28 at 12:07 PM\nAmazing\n\nWow. Grabbed this game during a sale and must say that I was really impressed by it. While the game is rather short and puzzles can be solved quite quickly, I think everyone should give it a shot, especially since the price isn't that high.\n\nHelpful | 0", "JuuliusLukacsJan 22 at 9:44 PM\nHello\n\nThis is one of the best games I have played in a long time\n\nHelpful | 1", "dariuszdziewa1984Jan 26 at 3:23 AM\n\nThis game is amazing! But... Please add subtitles.\n\nHelpful | 0", "Crazy_SaneNov 29 at 6:17 AM\nSimply beautiful\n\nThis game is a work of art. It's an enchanting story coupled with highly polished graphics, audio and gameplay. It's game of the year status is well deserved, although it is relatively short.\n\nThe clever use of the medium and well thought out puzzles kept me intrigued from start to finish. I highly recommend this to everyone, whether you're 8 or 80, new to VR or a seasoned metanaut. If this game doesn't fill you with a child like sense of wonder, I'm afraid you don't have a soul.\n\nHelpful | 4", "DenL-VRNov 29 at 3:09 PM\nThe most creative puzzle game for VR\n\nReally amazing what these guys came up with this game. A puzzle like no other, until I play this I could not even imagine of a way to use VR for creating a multi dimensional puzzle style like this. Perfect platform for such a unique and amazing game. No wonder it was voted VR game of the year! Looking forward to seeing more titles that really create something different in VR like this.\n\nHelpful | 4", "Okra_SmugglerJan 25 at 5:52 PM\nAmazing!\n\nThis is the kind of mind-bending content I want in VR!\n\nHelpful | 1", "jobbie1kinobiNov 28 at 1:56 PM\nStunning!\n\nIf this were the only game on VR it would still be worthwhile. This is exactly what VR is all about, a fantastical, surreal, other worldly adventure on a massive (and tiny) scale. Its quite a short experience but its also pretty reasonably priced and definitely worth it. I hope theres more like this in the future.\n\nHelpful | 4", "IkkjuNov 30 at 12:47 PM\nAn immaculate port of an amazing game!\n\nIts rare in our emerging platform that a game is so excellent in every aspect. From the innovative puzzle concept to the heartwarming story and the execution with the flawless and sharp graphics and great voice acting - everything is top-notch here. A must have!\n\nDevelopers, thank you for this, hope to see more from you in the future!\n\nHelpful | 3", "questloverMar 13 at 1:20 AM\nIm literally 2 minutes into the prologue\n\nAnd I'm already crying. This game is absolutely wonderful and definitely worth the price tag. The narration beautiful and sometimes emotional as well the graphics are great as far as the quest goes and the gameplay is fantastic and for such a cheap price tag I think it's an absolute steal. A real hidden gem that deserved the 2019 game award it got, well done game developers\n\nHelpful | 0", "Henry_WDec 16 at 1:44 AM\nMy favourite experience on the Quest\n\nIve got a lot of games and this is my first review because this title totally deserves it. Its really a beautiful and creative use of VR and could only exist in this medium. This is what I bought the Quest for. Lovely.\n\nHelpful | 2", "yetlee12Feb 19 at 9:25 PM\n\nTop quality but short.\n\nHelpful | 0", "IamRistonJan 11 at 7:37 PM\nBrilliant\n\nBuy it now. Great game to help introduce VR to people its also a lot of fun and very clever.\n\nHelpful | 1", "buzzinjessJan 16 at 8:09 PM\nBest VR game!\n\nI loved the concept of this it was a real mind bender but fun to play\n\nHelpful | 1", "azlan.delaunayJan 30 at 3:32 PM\n10/10\n\n10/10 :)\n\nHelpful | 0", "D00GIENov 28 at 11:27 AM\nSo good\n\nThis game is pretty incredible. The story, graphics and puzzles are all really good and completely worth the price. The gameplay is truly original. The only downfall is that it is a shorter game. Make sure you turn the hints off to get the most out of this game.\n\nHelpful | 6", "svalurthorJan 24 at 9:15 AM\nVery fun but a little short\n\nThe game is split up in four levels and each is about 20 minutes long. I really recommend it for the experience but I'd wait for a sale.\n\nHelpful | 0", "THEORIGINALNUTNUTMay 8 at 1:37 AM\nToo short\n\nIt would be 5 stars but it is stupidly short, it will only take about and hour and half to finish if that\n\nHelpful | 0", "RubezhalDec 12 at 10:32 AM\nA must buy\n\nOkay I will admit it is a shorter experience but it will blow your mind. Very good story and mechanics I never knew could be so cool. I almost wish there was a free mode or DLC just to mess with the mechanics more.\n\nHelpful | 2", "PennychanbabeJan 9 at 8:25 PM\nNice visual but too short!\n\nI love the graphic visual and the creative ideas for the storyline. But very dissapointed with the number of levels. Too short! I can finished the game within 2 hrs. Gone my USD 15 ... and the hints are too obvious. It is too easy to pass thru level by level. I like to play escape and puzzle games where I have finished Moss, I Expect you to Die and Red Matter. Is there any good games that i can play?\n\nHelpful | 2", "awesome.lueFeb 9 at 1:03 PM\nA fisherman tale\n\nIt is pretty fun but I cant beat chapter two\n\nHelpful | 0", "aaron.aash.1Apr 19 at 3:30 AM\nExtremely impressed!!\n\nGreat story puzzler... the mechanics are fantastic!\n\nHighly recommended!!\n\nHelpful | 0", "jaguarofamazonApr 2 at 1:03 AM\nShort and Amazing !!\n\nAmazing game ! I prefer shirt and high quality game like this one could amores to long but crappy game. Get this game if you like a relaxing but engaging storyline !\n\nHelpful | 0", "CriptoNoobJan 6 at 2:59 PM\nimmersive experience\n\nAn immersive experience , base in the story of a fisherman , you going to solve a lot of puzzles , is not a 5 star game because it have a couple of bugs that make the experience a little bit frustrating\n\nHelpful | 1", "Studly_McSexfireDec 2 at 1:29 PM\nBeautiful game!\n\nOne of the most clever games Ive played yet. Really impressive. Im at the beginning of chapter 4 and Understand its the last chapter. That being said my only complaint is that its way too short. I hope we see more like it from the developer.\n\nHelpful | 2", "FawkesPhoenixMar 22 at 12:18 PM\nShort fun SO worth it!!\n\nThis is the perfect example of a game that thrives in VR! I was able to complete it in a few hours but thoroughly enjoyed every moment of it! Puzzles were challenging but not too hard. Loved the story as well.\n\nHelpful | 0", "ThinkerCMNov 29 at 3:40 PM\nFar Too Short\n\nThe concept of this game is fantastic, It's incredibly clever and the puzzles are fun to solve. I can see why it has won awards, the control mechanism is intuitive and the ability to stretch beyond your actual reach is very useful. It's just far too short, I think I completed it in about 90 minutes (I wasn't timing myself) with the hints turned off.\n\nIt has so much potential as a concept and there are so many items to move and manipulate, but I'd say 95% of them have no use in the game. The experience was fantastic, but with only 4 chapters that take about 20-25 minutes each to get through (Unless you really get stuck), it is all over far too soon.\n\nThere are games on the Quest for half the price that take 10 times as long to complete and also have replay value, which I wouldn't expect from a puzzle game anyway, but That's why it should last so much longer.\n\nHelpful | 7", "Gypsy_StarJan 4 at 8:00 PM\nvery imaginative\n\nreally enjoyed this game.... it was too short thought. still worth the money though.\n\nHelpful | 1", "ronnoc123Dec 28 at 7:50 AM\nGreat game\n\nI really like this game because it is very comfortable to play and a fun and calming game to play for a while 10/10\n\nHelpful | 2", "bflyrnMay 3 at 1:10 PM\nGood\n\nA fun smooth ride. delightful visuals. then I got to chapter 4. oh well. 3 out of four ain't bad.\n\nHelpful | 0", "cenoquestDec 14 at 11:33 AM\nShort and sweet\n\nThis games nails the core aspects of what makes a VR game great. Youll immediately notice that its gorgeous to look at. The textures are detailed and theres virtually no aliasing to speak of! Most importantly though, the writing and voice acting are great and the puzzle mechanic is ingenious and really\nengaging.\n\nThe only thing Id change is the press B to extend hand thing, which really doesnt follow Quest best practices. Its not a deal breaker in any way, it just doesnt make the experience as seamless as it could be, since you have to learn this bizarre control scheme just for this one game. Theres definitely room for custom control schemes when they add something to the game, but not something as basic as grabbing an object. Thats just reinventing the wheel!\n\nHelpful | 1", "cruddogDec 1 at 3:56 PM\nPreordered but cant play\n\nLike some others who commented about problems downloading this title, I too am affected by this issue. Reached out to Oculus who say they are trying to sort it out with the developer. Hope this is sorted soon, been waiting three days now, game has been paid for, and no show on delivery. Very disappointing preorder experience so far.\n\nUpdate, Dec 1st 2019: seems the issue is finally resolved and I could finally experience what others have been saying about this mind-bending title. Only 3 chapters in and loving the refreshing inception-esque puzzle solving, definitely not played anything like this before. Taking advice from other reviews, I turned off the hints right from the start, and have not had too much trouble with progressing whilst enjoying my time with the game.\n\nHelpful | 8", "Brit-Ton-NeeApr 19 at 12:18 PM\nAwesome game!\n\nI enjoyed playing it but wish it would have been longer!\n\nHelpful | 0", "TaylaWadMar 25 at 2:30 PM\nAwesome!\n\nThe puzzle aspect is really cool! Its such a well made game. Even though im affraid of the ocean and being underwater, it was super fun! I highly reccomend it. Such a great game\n\nHelpful | 0", "DeaconnfrostDec 18 at 5:48 PM\nReally great\n\nQuick but worth every minute. Great narration. Great artwork. Interesting world.\n\nWorth it!\n\nHelpful | 2", "KillCounter0505Jan 23 at 11:57 AM\n\nI loved the game it was short but still a good game. I would recommend it to anybody looking for a peaceful game to play.\n\nHelpful | 1", "john.hunt.10420321Nov 30 at 2:36 PM\ninteresting clever game\n\nthis is a gem, its a really clever use of VR space with interesting puzzles\n\nHelpful | 5", "VoidInOcculusJan 11 at 12:08 AM\nSuper game\n\nSuper game, mind bending puzzles\n\nHelpful | 1", "guy.talmorDec 21 at 10:05 AM\nShort but worth it!\n\nAlthough it took me about an hour to complete it was totally worth the price, one of the best experiences i had on the quest.\n\nHelpful | 2", "PedroGrewaBeardJan 18 at 12:31 AM\nit needs Subtitles\n\nconcept and visual is brilliant but i'm deaf and cant hear what is being said !!!\n\nHelpful | 4", "JimZMJan 31 at 11:15 AM\n\nGood but the physics is often buggy/finicky\n\nHelpful | 0", "PickleParty44Nov 28 at 1:51 PM\nVery unique game\n\nI love this game and the puzzles were challenging but very fun and the voice acting was great. They only thing I think this game should do to improve is make it longer because it felt too short.\n\nHelpful | 5", "cvteck1Dec 15 at 2:30 PM\nWow!!!\n\nI had fun playing this game and it had a good story as well...the puzzles was ok but a very cool experience with the vr headset. Great job and 5/5\n\nHelpful | 2", "Scout8107Jan 18 at 3:22 PM\nGreat game!!\n\nThis game has a lot of good puzzles, and is mind boggling with the puppet house.\n\nHelpful | 1", "bdialogDec 19 at 6:31 PM\nAmazing\n\nThis game is my favorite so far on the quest. It's so thought out and just amazing to play. I loved it!!\n\nHelpful | 2", "MeowformebabyDec 1 at 12:41 AM\nIve been smiling like a Cheshire Cat\n\nSince it began. I love the type of games that really make you feel like youre in the game.\nIt is really quite mind bending, like taking the roof off completely blew my mind. I love VR!\n\nHelpful | 3", "Roxtar73Dec 5 at 6:39 PM\nExcellent game mechanics A++\n\nThe excellent game mechanics and the well designed puzzles takes this game to a whole new level. This is one of those games that could only exist in VR and its amazing.\n\nHelpful | 2", "GirlGeek101Dec 25 at 5:52 PM\nFresh experience\n\nWonderful graphics, and fun puzzles. I hope they will do another soon!\n\nHelpful | 2", "jeepboypenningtonJan 26 at 9:55 AM\nGood but short\n\nIt was a good game but it was too short\n\nHelpful | 0", "milesrotaruDec 4 at 3:52 PM\nA great game with one major annoyance\n\nEven with hints turned off in settings, the characters beat you over the head with repetitive voice lines about what you're supposed to be doing what feels like every 30 seconds or so. It took away from the atmosphere somewhat and made me feel kind of dumb as they repeated themselves, seemingly growing tired of my slow pace.\n\nHelpful | 0", "will.pagetbrownApr 5 at 7:51 AM\nMesmerizing\n\nMind bending puzzles and a comical but gripping story. A must play.\n\nHelpful | 0", "ArgisHalevaakDec 25 at 1:19 PM\nGreat first game.\n\nMy first time on VR, and this game is mindblowing. Very fun.\n\nHelpful | 2", "MASCULONDec 18 at 3:32 PM\nSurreal puzzler\n\nThis is a unique, surreal puzzle/exploration game. Very enjoyable and fun for most ages.\n\nHelpful | 2", "SpilleroneDec 21 at 6:33 AM\nMasterpiece\n\nMagic! This is to VR what ICO was to the first Playstation.\n\nHelpful | 3", "KIILLERBunnyNov 28 at 6:21 AM\nGreat Game and Innovative Ideas\n\nI had a lot of fun in this game and the setting of the world is impressive. The way of interaction with items is innovative and feels great. Strongly recommended.\n\nHelpful | 4", "DrDualityDec 15 at 5:07 PM\nLoved it!\n\nSo many little fantastical surprises. Felt amazing solving the puzzles without hints on.\n\nHelpful | 2", "Double-O-JerryDec 3 at 8:40 AM\nvery 3d, very cool\n\nThis game was really cool, and quite trippy. I'd definitely recommend it to others. The 3d effect of looking into the model was really amazing.\n\nHelpful | 3", "StreetCoopsNov 27 at 9:44 PM\nAwesome game\n\nThis is a mind bending experience, and probably worth it even though it's only an hour or two of content. Would be nice if I had a bit more space to solve puzzles, instead of having the same voice lines repeating clues over and over.\n\nHelpful | 2", "zkrbrfsuxDec 4 at 2:18 PM\nI'm speechless\n\nThis is such a nice experience. Objects do get stuck sometimes that will force you to restart the chapter, but the game makes up for it.\n\nHelpful | 3", "dwsheltonJan 16 at 4:38 PM\nWould give five stars but very short\n\nOnly took and hour or so. Still pretty fun though.\n\nHelpful | 1", "FulfMay 17 at 4:51 PM\nInterest but very short\n\nAbout half an hour of gameplay otherwise rating would be higher\n\nHelpful | 0", "FerocDec 7 at 1:04 PM\nGreat experience, just a bit too short\n\nReally loved playing this. I liked the puzzles and it felt great walking around the lighthouse, especially if you have the room to actually walk.\n\nI just wish it were a bit longer.\n\nHelpful | 2", "leonardallen1May 4 at 3:42 PM\n4 stars because nothin in VR is perfect\n\nVery awesome graphics, story and puzzles ofcourse it's short that's why no 5 stars but hey just 15 bucks!\n\nHelpful | 0", "fluffynlDec 3 at 12:36 PM\nLike jumping into a pixar movie\n\nGraphics are great story telling and the feeling of scale is very well done.\n\nIt is a short (3hour) experience but well worth it\n\nHelpful | 3", "isaacnerdDec 23 at 12:35 PM\n\nIs fun ant amazing can put a new levels\n\nHelpful | 1", "greenfutureNov 30 at 7:01 AM\nWhat a beautiful experience\n\nFishermans tale is so nice <3 some of the experiences on the quest just stands out and give you goosebumps, fishermans tale is one of those!\n\nHelpful | 2", "MooseKnockerNov 30 at 11:21 AM\nGreat use of perspective\n\nA little short but an amazing use of perspective and changing the sizes of items to alternative uses. Would recommend.\n\nHelpful | 4", "FishinghawkMar 18 at 3:41 PM\nGreat Purchase\n\nVery engaging. Loved opening the window to the ocean and sticking my head out. Highly recommend this game.\n\nHelpful | 0", "s-ynthApr 13 at 9:13 AM\nGreat concept, too short\n\nThe game concept and narrative are great, but its hardly a demo, easy and short.\n\nHelpful | 0", "RandomLeeHDMar 26 at 11:50 AM\nBrilliant.\n\nThis puzzle game is just brilliant and well worth the price.\n\nHelpful | 0", "sunandsnow24Dec 10 at 9:35 PM\nFantastic!\n\nThis game is I want VR to be. Creative, fun, intelligent and full of Wow!\n\nHelpful | 2", "mkitchDec 14 at 6:30 AM\nFantastic experience!!\n\nLoved it! One of the best VR experiences out there.\n\nHelpful | 2", "arandomwallNov 27 at 1:14 PM\nVery good\n\nIf you have Ever played this, you don't even need an explanation of how good this mind bending vr puzzle game is\n\nHelpful | 4", "PiR8_BTYDec 15 at 1:18 AM\nMasterpiece\n\nFrom start to finish had a great time!\n\nHelpful | 2", "VondelmolDec 11 at 7:31 AM\nVery challenging\n\nWonderfully build wish there were more like these!!!!\n\nHelpful | 2", "krxskyMar 25 at 10:16 PM\nDecent puzzle game\n\nIt's a decent puzzle game with interesting concept. However, it's somewhat short and I found the fishing and passing part too tedious for my liking.\n\nHelpful | 0", "ilanit.ouzielDec 6 at 8:31 AM\nReally good but really short and easy\n\nThe game looks very nice, the story is good, there were some glitches but overall the gameplay was good. Its a really short and easy puzzle game but worth an hour+ experience\n\nHelpful | 2", "EvanGPNov 27 at 12:19 PM\nAmazing game!\n\nOne of if not the best game I've ever played in Vr\n\nHelpful | 7", "dani.dorfman.50Dec 7 at 9:41 AM\nAmazing\n\nAmazing inception experience. Wish it was longer\n\nHelpful | 2", "joekinney100May 6 at 1:55 PM\n\nI really didnt care for it. Its just not my type of game.\n\nHelpful | 0", "jadiaconuDec 14 at 6:12 AM\nA+\n\nA+\n\nHelpful | 2", "Ranien72Dec 4 at 2:41 AM\nFun and smart gameplay\n\nFun and smart game. Visually good. I recommend IT.\n\nHelpful | 2", "daniel.gould.50Dec 8 at 8:02 PM\n\nJust wish it were longer\n\nHelpful | 2", "BATTLEKOTDec 4 at 10:25 AM\nNice idea\n\nIm really enjoy your idea with interactive environment.\n\nHelpful | 1", "7eemooMar 20 at 6:46 AM\nAmazing game\n\nThe game is really good\n\nHelpful | 0", "SpyIsNotOurSpyMar 27 at 10:04 AM\nGood puzzle game but way too short\n\nCompleted in a couple of hours. Good concept but could have done with being longer for the price\n\nHelpful | 0", "xG.UNITxNov 28 at 11:29 PM\nDope game\n\nVery clever. So much fun.\n\nHelpful | 5", "ummwhatsureNov 29 at 4:33 PM\nStill not downloading\n\nI was hoping this would be available by now. I noticed from the reviews it seems like some ppl have been able to play it. For me it still just says preordered.\n\nHelpful | 3\nDeveloper ResponseNov 29 at 4:40 PM\n\nUnfortunately this seems to be a store issue. We are reaching out to Oculus to have this fixed as soon as possible. Please bare with us as it is Thanksgiving in the US and their response may be a bit delayed. Thanks for your support and understanding!", "PauldoggyNov 30 at 5:09 AM\nWont download\n\nWont download, trying to get a refund but cant because it never downloaded\n\nHelpful | 16\nDeveloper ResponseNov 28 at 5:57 AM\n\nUnfortunately this seems to be a store issue. We are reaching out to Oculus to have this fixed as soon as possible. Please bare with us as it is Thanksgiving in the US and their response may be a bit delayed. Thanks for your support and understanding!", "Denisio7Jan 16 at 6:42 PM\nCuando en espaol?\n\nGreat but when in Spanish?\n\nHelpful | 1", "r1chcruzNov 28 at 7:09 AM\nDisappointed\n\nI pre-purchased this title, it appears to have downloaded into my quest, but it's not showing up in my list of games. The game may be as good as other reviewers describe it, but this pre purchase experience has been a disaster.\n\nHelpful | 9\nDeveloper ResponseNov 28 at 7:55 AM\n\nUnfortunately this seems to be a store issue. We are reaching out to Oculus to have this fixed as soon as possible. Please bare with us as it is Thanksgiving in the US and their response may be a bit delayed. Thanks for your support and understanding!", "niglu100Nov 27 at 11:38 AM\nI was really exited\n\nI can play this game without any annyoing cables and i really immersed to game and really mindblowing experience\n\nHelpful | 4", "ZackydooDec 16 at 6:03 PM\nGreat!\n\nI loved it, but it needs more content.\n\nHelpful | 1", "midnight27123Dec 1 at 3:05 PM\nA fisherman's tale\n\nWas able to fix the problem Still can't download it\n\nHelpful | 14\nDeveloper ResponseNov 29 at 11:45 AM\n\nUnfortunately this seems to be a store issue. We are reaching out to Oculus to have this fixed as soon as possible. Please bare with us as it is Thanksgiving in the US and their response may be a bit delayed. Thanks for your support and understanding!"]