{"App Title": "Accounting+", "App description": "How long have these goggles been pressing into my flesh? What began as a small game jam between William Pugh (The Stanley Parable), Dominik Johann (Minit) and Justin Roiland (Rick and Morty) is nowtwo years lateran aberration of warped technology, weird worlds and strange, disturbing creatures. Since its debut, Accounting has tripled in size, mutated into an intricate labyrinth of forbidden virtual realities. With countless more secrets to discover if you have the stomach to brave the dangers of new characters brought to life by a cast of comedic legends (Rich Fulcher, Reggie Watts, and Justin Roiland). DANGERS - If you die in VR, you die in real life. - Do not play after midnight. - Achievements linked to unforgivable acts of human corruption. - A way better soundtrack than a VR game soundtrack has any right to be. - Subtitles and translations for 9 languages. Wow, internationally dangerous! - The vacuum of space. Yeah that dangerous. - And unfortunately: The Cops.", "Purchase section": "$11.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Narrative", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Russian, Spanish (Spain)", "Version": "1.24.35", "Developer": "Crows Crows Crows", "Publisher": "Crows Crows Crows", "Website": "http://accountingpl.us/", "Release Date": "July 3, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Back to the home page\n\n-\nCrows Crows Crows Privacy Policy\nLast updated: June 19, 2018\n-\n\nA quick summary: this document explains:\n\nwhat information we and our partners collect when you use Crows Crows Crowss games and services;\nwhere that information is stored and how it is protected;\nhow we use that information;\nhow long we retain that information; and\nyour rights in relation to that information.\n\nThis Privacy Policy explains to you how your personal information is collected and stored and what happens to it regarding the Crows Crows Crows Services. Because we know legal wording is not much fun, we have included a short and informal summary of each section (but the full version is the legally binding one). If you have any queries you can contact us at hello@crowscrowscrows.com.\n\nWHO WE ARE AND WHAT THIS PRIVACY POLICY GOVERNS\n\nThis Privacy Policy explains the different kinds of information Crows Crows Crows can collect from you when you're using the Crows Crows Crows Services. Legally, we cannot and will not collect personal information about children below 13 without parental/guardian involvement. We will comply with applicable privacy laws, including the EUs GDPR.\n\nAbout Us. We are Roberts & Co Bunsen Outlet Limited (incorporated and registered in the United Kingdom with company number 08787812) of 54 Middle Street, Sowerby Bridge, West Yorkshire, UK, HX6 3NX as well as the Roberts & Co Bunsen Outlet Limited group of companies (Crows Crows Crows).\n\nWhich services does this Privacy Policy apply to? All of our video games (e.g. Accounting+), our websites, user accounts, customer and technical support, official forums, wikis, blogs, social media services and other products and services - Crows Crows Crows Services for short.\n\nWhat information does this Privacy Policy apply to? Specifically, this Privacy Policy governs personal data (or, in the USA, personally identifiable information) and applicable non-personal information (or, in the USA, non-personally identifiable information), which we collect from you when you are using the Crows Crows Crows Services (\"personal data\" means information which, on its own or in combination with other information, can be used to identify you).\n\nWhat about children? We recognise we have a special obligation to protect personal information obtained from children. Legally you must be at least 13 years old to use the Crows Crows Crows Services (but this might be older depending on whether or not a particular Crows Crows Crows Service has a required minimum age rating) as per our User Agreement. We do not knowingly collect personal information from any child under the age of 13 without consent from their parent or guardian. If you are a parent or guardian and are concerned about the transfer of personal information about your child, please contact hello@crowscrowscrows.com.\n\nWhat about GDPR? We respect your right to privacy and will only process personal information in accordance with applicable legislation in the EU (which includes the General Data Protection Regulation (EU) 2016/679 or the GDPR as it is often referred to), the USA and elsewhere. For personal information contained in this Privacy Policy which is used by Crows Crows Crows in connection with the Crows Crows Crows Services, Crows Crows Crows is the data controller under EU data protection legislation.\n\nWHAT INFORMATION IS COVERED?\n\nWe may collect certain information when you use the Crows Crows Crows Services such as your name and email address (more information below). We do not receive or store your payment details.\n\nWhat information might we collect from you? When you sign up for, download, use or play the Crows Crows Crows Services then we will collect certain information from you. The information that we collect varies depending on the particular Crows Crows Crows Services used, but this may include:\n\nTechnical Details. When you use, play or access the Crows Crows Crows Services we or third parties on our behalf may collect technical details about the device you are using, including: internet and/or network connection (including IP address); MAC address, any console device identifier; your operating system, browser type or other software; and your hardware or other technical details.\nYour Activities. When you use, play or access the Crows Crows Crows Services we or third parties on our behalf may collect details of how you use our services, including: metrics information about when and how you use the services; traffic data; language preferences; achievements; gameplay statistics; time spent playing; and your geographical location data.\nYour Communications. If you contact us (e.g. via email or direct message) or post in chat sessions, forums or other areas of the Crows Crows Crows Services, we may collect and maintain a record of your contact details and the content of your communications.\nUser Accounts and Newsletters. To access certain Crows Crows Crows Services (e.g. games or chat server) you may need to create a user account. Or if you sign up to a newsletter, you will be asked to provide us with certain information. This will be displayed to you at the time you start to use the applicable Crows Crows Crows Services (e.g. when you sign up for a newsletter) and may include your name, username, age, birthdate, a photo or avatar, email address, country of residence and contact information.\n\nSome of the information types referred to above may be collected on an aggregated or anonymised (e.g. hashed) basis, or we may use it or share it in an aggregated or anonymised way, for research or analysis into the way our services operate and are used.\n\nWhat about the storage of payment details? The processing and storage of payment details is a matter for the relevant platform and the applicable payment methods/processors. Crows Crows Crows will not receive, process or store any of your payment details. This is because the payment transactions themselves are completed through the relevant platforms (e.g. Steam, Apples App Store or Google Play) via the user account you have associated with that platform account. If you make in-game purchases within a Crows Crows Crows game or product, we are notified by the payment processor once a transaction takes place but we will not receive any of your actual payment details.\n\nWHERE IS YOUR INFORMATION STORED?\n\nWe will store your information in Europe where possible. We will do our best to keep this information secure. No information security system is perfect so please remember to be careful.\n\nWhere will your information be stored? The information we hold will primarily be stored and processed in the EU, but there may be circumstances where we need to work with trusted third parties outside of the EU in order to provide the Crows Crows Crows Services to you. By submitting your personal information, you explicitly agree to such transfer, storing or processing of data outside the EU. We will take all steps reasonably necessary to ensure that this information is treated securely and in accordance with this Privacy Policy.\n\nAll information we hold is stored on our secure servers which we own or license from appropriate third parties. We use industry standard procedures and security standards to prevent unauthorised access to our servers, however no online service or website can be completely secure, so please protect the account information in your possession as well.\n\nHOW IS YOUR INFORMATION USED?\n\nWe will use your information to run, maintain and improve the Crows Crows Crows Services as well as to communicate with you (e.g. with newsletters or emails). Sometimes we may share information with partners in order to run our services.\n\nHow might your information be used? We may use the information above in order to (for example):\n\nPerform our agreement with you: provide the Crows Crows Crows Services to you, including: to carry out our obligations arising from any contracts between you and us; allow you to participate in interactive features of the Crows Crows Crows Services when you choose to do so; and provide you with chat functionality and other communication systems.\nFor our legitimate commercial interests: monitor the performance of the Crows Crows Crows Services; ensure that the Crows Crows Crows Services are presented in the most effective manner for you and your device(s); notify you about changes to the Crows Crows Crows Services; provide, maintain, protect and improve the Crows Crows Crows Services; and to protect Crows Crows Crows and Crows Crows Crows Services users.\nComply with our legal obligations: where we are required to do so by law; and comply with intellectual property protection obligations we have under applicable laws including the Digital Millennium Copyright Act and the E-Commerce Directive.\nBased on consent: provide you with marketing information about products or services that you request from us or which we feel may interest you where you have asked us to do so.\n\nWill we ever share any of your information with other parties?\n\nWe will never share your information with third parties for their own marketing purposes without first obtaining your consent.\n\nWe may engage third party service providers in the course of providing the Crows Crows Crows Services to you (e.g. data storage, server hosting, customer and technical support, game analytics, advertising, etc.) which may require them to access your information on our behalf. We will ensure there are appropriate contractual arrangements in place with any such third party service providers to protect your information. Those third parties may also collect some information directly from you (e.g. IP address, unique identifiers, etc.) subject to their own privacy policies.\n\nWe may work with third party service providers (e.g. ad network and measurement services) to display advertising on the Crows Crows Crows Services and to manage our ads on third party sites. You can choose to prevent your devices ad identifier being used for interest-based advertising by updating the settings on your device and you may be able to opt-out from the collection of information by some of our advertising partners.\n\nWe may share your information within the Crows Crows Crows company group for the purpose of providing the Crows Crows Crows Services.\n\nIn the unlikely event of a reorganisation or merger of Crows Crows Crows we may transfer personal information to an involved third party who will protect this to at least the same level as we do in this Privacy Policy.\n\nHOW YOU USE YOUR INFORMATION AND THIRD PARTIES?\n\nYou have the option to share your own personal information with other parties, in which case it will be governed by those parties own privacy policies  make sure to take a look at them.\n\nPlease remember that any communications you have via the Crows Crows Crows Services may reveal details about you. Also, any information you post publicly will be publicly available to other people. We are not responsible for your use of any otherwise private personal information which you make available, or the activities of other users or other third parties to whom you give or make available your information or content. The Crows Crows Crows Services may, from time to time, contain or connect you with third party content or services. Our Privacy Policy does not extend to external sites or companies, so please refer directly to their privacy policies.\n\nDATA RETENTION\n\nWe retain your information for as long as needed to provide the Crows Crows Crows Services to you or longer where permitted by law.\n\nHow long do we retain your data for? As long as necessary for the purpose for which the data was originally collected. As detailed below, depending on where you live you may have certain legal rights to object to our collection and use of your data, but this may mean some or all Crows Crows Crows Services become unavailable to you. We also reserve the right to retain your information as necessary to comply with our legal obligations, resolve disputes, maintain appropriate business records and enforce our agreements.\n\nYOUR RIGHTS\n\nYou have rights about how your personal information is used, which can vary depending on where you live. If you have any questions, please contact us at hello@crowscrowscrows.com.\n\nCan you ask us to stop processing your personal information? You have the right to ask us not to process your personal information for marketing purposes. You can change your email settings to unsubscribe from email communications.\n\nWhat are your rights? Depending on where you live, you may have additional privacy rights. For example, in the EU (particularly under the new GDPR) you have the right to access and obtain a copy of your personal data we possess; you have the legal right to ask us to rectify/correct your personal data; and you may have the legal right to contact us to request that we delete your personal data from our system. We will use commercially reasonable efforts to honour your request, but we may decline requests that are unreasonably repetitive, are disproportionate, infringe the privacy of others or as otherwise permitted by law. Please note though that by withdrawing your consent or otherwise objecting to certain processing of your information, certain Crows Crows Crows Services may no longer function properly or be completely unavailable to you.\n\nUnder California law, California residents who have an established business relationship with us have the right to request certain information with respect to the types of personal information we have shared with third parties for their direct marketing purposes, and the identities of those third parties, within the immediately preceding calendar year, subject to certain exceptions. All requests for such information must be in writing and sent to:Roberts & Co Bunsen Outlet Limited at 54 Middle Street, Sowerby Bridge, West Yorkshire, UK, HX6 3NX. This same California law permits us to provide you, in response to your written request, with a cost-free means to choose not to have your information shared rather than providing the above described information. You may exercise that choice by contacting us at the address above.\n\nWho should you contact if you would like to exercise these rights? If you would like to exercise any of these rights or have any queries regarding them, please contact: hello@crowscrowscrows.com.\n\nOTHER\n\nWe can change this Privacy Policy, but if we do we will put the changed version online and normally it will take effect 30 days afterwards. Please feel free to contact us if you have any questions with regards to the changes at hello@crowscrowscrows.com.\n\nWill we ever change this Privacy Policy? Possibly, but if we do we will make the changed Privacy Policy available online, make reasonable efforts to notify you of this and update the Last Updated date. Once we change the Privacy Policy, it will become legally binding on you as of the date of publication (i.e. the new Last Updated date). You are welcome to contact us if you have specific questions about the changes at hello@crowscrowscrows.com. If you do not agree to those changes, regardless of whether you email us then unfortunately you must cease using all Crows Crows Crows Services.", "Space Required": "1.93 GB"}



["5 stars\n67%\n4 stars\n18%\n3 stars\n7%\n2 stars\n4%\n1 star\n4%", "AdmirstJul 16 at 11:17 PM\nSo fun , but so short:(\n\nIf you actually read the dialogue and keep up with the story instead of rushing for the VR headsets, it should last about two hours including the elevator levels. If you speed run it, you could literally beat it in 10 minutes. While it is so funny and comical, they should add a few more levels as I think it would help the popularity and fun\n\nHelpful | 37", "NO-AJul 29 at 2:40 PM\nLearned a lot about Accounting\n\nFeeling like a better human being now. It helped me mature and understand the basics of the on the surface boring looking accounting world.\nI personally never had any accounting experience, beyond giving love to (profanity filter avoidance) a few secretaries of bank and hotel managers (and some wives, or secretary/wife).\n\nBut now I think I got a deeper insight, well maybe not deeper, but from different angles...or let's say it's different if You put Your head right in it...maybe not.\nLet's say it's the 2nd best kind of accounting experiences out there.\n\nPut the goggles on and try to find the secret zoo level. Put a frog on Your face, play them bones. And do it all a few times because the 2nd time isn't like the first time unlike the 1st most best accounting experience.\n\nThe zoo level exists!\n\nHelpful | 5", "MoonKittenA day ago\nI love this game but oh boy\n\nSo, i actually played this on PSVR ages ago and had very little idea about a bunch of stuff in it and then i started looking around that one room where you encounter the clown, and after and before work i have spent hours trying to hunt down the secret zoo level and ive found almost every other room except the zoo one and it is DRIVING ME CRAZY, i feel like the clown ive got a bunch of different tabs open on all my devices and crap trying to figure out how in the HECK i get to that zoo to no avail as of now. I will find that zoo even if it kills me. Btw fantastic game, fantastic graphics and its quirky and cool for all those edgy kids looking for something to do on a boring day. Definitely recommend it.\n\nHelpful | 0", "OnesieJun 6 at 4:08 AM\nVery weird\n\nI have to admit, I've never seen Rick and Morty. So I got this game based off the preview video being funny. It's VERY raunchy and at times pretty disturbing. I definitely couldn't play it with my wife or son in the room. It's pretty short but if you like the goofy commentary, it stretches the game out.\n\nTechnically, it seemed everything worked as it should. I didn't experience any crashes, lag, or glitches. The graphics are perfect for what the game is. The voiceovers are hilarious although at times super creepy.\n\nThe only issue I had with the entire game were the subtitles would pretty consistently shift in and out of focus. It was like they would jump from one eye to another. It was so distracting that I had to turn them off and I know I missed a few jokes because of all the arguments that go on through the game.\n\nI gave the game 4 of 5 stars because it definitely have me what I wanted when I bought it. A weird experience that would give me a break from all the serious or puzzle games I have in my library. I'd recommend this for adults or maybe an old teenager.\n\nHelpful | 23", "joet8ohMay 3 at 5:43 AM\nI found the zoo level...\n\nEntrance sign and the cartridge... this game is great. The only real issue is that it suffers from something that all vr games suffer from. I want more game. It feels just ever so slightly short. I do appreciate all the alternate paths and secrets. Though at the end of the day, it's still roughly about 2 hours to complete.\n\nHelpful | 89", "glfmoch9 days ago\nIts good but very short\n\nIm not sure if it was worth my money but it was fun, didnt last long though. its the kind of game you play once and play again once after a couple months.\n\nHelpful | 1", "RedsDogJul 19 at 1:18 PM\nWorth the price\n\nThis is a great game, it's vulgar humor and quick pace is engaging. The issue I have is that it's incredibly repititve and rather short, as you have to replay to unlock secret levels. I've found myself turning the volume off as the constant talking goes from funny to irritating by the third play.\n\nThose are the only cons I have though. Visuals are on point, it's funny and I would buy it again in a heartbeat.\n\nHelpful | 1", "Troney2322 days ago\nBest game\n\nThis game was so awesome  I wish it was longer. However, the game isn't over after you take the pill and do the research and it cuts to the credits, though. You can go back and take the other color pill and play through the game. Hope that helps \n\nHelpful | 0", "USSTritonJul 28 at 6:50 PM\nGreat game!\n\nThis is an awesome play! You get quite the experience playing, especially for Rick and Morty fans. I do wish they made it longer and youd think after 3 years since its release and multiple updates someone would have found the Secret Zoo Level!\n\nHelpful | 0", "spandinosaur639May 30 at 6:47 AM\nSo funny need more\n\nI literally need more we need a game called zoo level. But getting that one issue out the the way the game is funny, great and all out amazing. I just want more. But dont let that stop you from getting this game . For $12 it is worth it You get about 2 hours of content if your a normal player but if you like to dig deep there is a level just for that could last you forever. Honesty you 100% should get.\n\nHelpful | 10", "Izzy9pJul 14 at 5:24 PM\nA lot more than it seems. Worth the buy!\n\nWeird, vulgar, challenging, but good\nYou will read a lot of reviews about how short it is, but I guarantee the people writing those reviews haven't found all of the secrets or 100% of the achievements.\nI found 2 secret levels and just got 100% of the achievements. Has taken a lot of game play and attention to detail.\nIf you are one that watches utube vids on how to play the games then don't play it lol. I mean what's the point lol.\nI liked trover saves the universe better, but these are really different games from the same creator.\nWorth the money in my opinion.\n\nHelpful | 0", "rexosaurusrexJul 14 at 4:57 AM\nAwesome experience\n\nThe whole thing is awesome. They've mixed humor, mystery, exploration, some escape room elements, and it even has a deep story if you really think about the message. They have jokes in there too that I didn't get until after the whole experience. They literally got me laughing even after I took off the headset. I'd recommend this for anyone with a Quest.\n\nHelpful | 1", "kippieq3 days ago\nFirst Game\n\nThis is the first game I ever bought for VR and dang it was a great intro into the works of Oculus.\n\nHelpful | 0", "jacobglaab.1Jul 17 at 6:13 PM\nFantastic Game\n\nIf you like Rick and Morty or just dark humor in general then this is definitely the right game for you. Got the game as soon as i saw it because It has the same cast as Rick and Morty and I was not disappointed. I believe that the price is definitely more than reasonable for what you receive. Get it.\n\nHelpful | 0", "BigKingTJun 9 at 9:35 AM\nGame of games!\n\nAs far as VR games go, I think this is one of the best games ever made. It has quirky, sometimes disturbing humor that pokes at the mind while you travel through various crazy worlds. The writing is superb! It's fun to redo levels too and hear more of the dialogue than you would on just a quick playthrough. Overall 11/10 would buy another Squanch games product any day of the week!\n\nHelpful | 3", "firewing507Jul 27 at 1:07 PM\nGreat but short\n\nThis game is very funny but short, but their are some secret to find to make up for that. I cant wait to play Trover for the same type of jokes.\n\nHelpful | 0", "rockwithtime3 days ago\nGreat game\n\nI recommend this game. It was well worth it\n\nHelpful | 0", "MattoMcflyJul 26 at 7:28 PM\nMost fun yet\n\nFinishing the game I honestly the beginning. So many little cool moments and interactions to find in one of the mini-levels. Hope they keep adding to it.\nPS zoo level?\n\nHelpful | 0", "Lynnxxx20 days ago\nim confused\n\nok idk if ive completed the game or if i only got one ending please someone help it feels like a maze\n\nHelpful | 0", "PepeTheCactusJul 11 at 1:53 AM\nIts halairios and fun\n\nThis game is defenitly a buyer it made me laugh for two minutes straight, and with all the secrets it Will give you some great fun\nSorry for my bad spelling english is not my first language\n\nHelpful | 0", "DG107Jul 18 at 4:29 PM\nGood but short\n\nIt is very fun and funny but short there are many levels but there is not much to do in them\n\nHelpful | 0", "DefrostmodeJul 19 at 7:30 PM\nGreat, unique, fun, but also short\n\nIf you like the humor of things like Rick and Morty, you'll probably like this.\n\nHelpful | 0", "nappygJun 2 at 4:50 PM\nGreat, but short\n\nSo funny. Loved everything about it, just wish it was longer. Would love to see any kind of continuation of this hilarity!\n\nHelpful | 5", "Tony.DiIuorioMar 19 at 3:46 AM\nHave to judge Accounting+ not R&M\n\nI would usually give anything as squanchy as this higher stars! Plenty of squanchy laughs for Justin Roland fans... if you love Rick & Morty for the improvisational style then just buy this game!\n\nBut as I said I must judge the game as if it were any other game. And for that I must ask, why so short and why so little player interaction?\n\nGranted I've only played it through once - I'll set aside another 30 minutes to run through it again. It's that short.\n\nIt's more of an interactive Roiland cartoon than a game however I'm betting there's some Easter eggs to be found.\nBut this title is mostly about just hanging around listening to the gags, and killing the King of VR, being executed for it, and running from the law with a bunch of teenagers.\n\nEnjoy!\n\nHelpful | 38", "KingQuillenJun 7 at 4:22 AM\nThe family of Rick & Morty\n\nThis is like an extension of Rick and Mortys family. Youre taken by surprise by a variety of characters that interact with you and their funny in their own way. They even look funny.\n\nI love the randomness of this game and the different stories to it. Worth it.\n\nHelpful | 0", "Nightmare000rJun 17 at 6:48 PM\nWhat VR should be...\n\nThere are many paths to take and so much to see. The cartoonish graphics are very aesthetically pleasing and everything wrong with the game is what makes it special. Highly recommend\n\nHelpful | 0", "FunnyFireJun 11 at 5:14 AM\nI love this game\n\nThis game has dark humour and some other random stuff and I love it! Most of the voices are by Justin royland and He voices Rick and morty  is in total I give this a 5 star its really cheap and will offer you loads of fun!\n\nHelpful | 0", "Crumbles_24May 22 at 11:27 PM\nPros and Cons\n\nI found that the Game was really funny but shorter than you would want it to be. At times it can be unclear of what to do and that can be a bit frustrating. Also a note that I have is that the experience of the game can be ruined if youve already seen people play the Game.\n\nPros:\nFunny Game\n\nCons:\nUnclear objectives\nShort Game\n\nHelpful | 3", "reasonableturkeyJun 11 at 12:29 PM\nBrilliant!\n\nI can definitely rate this game a 5 star experience but its definitely not for the faint hearted. It is an incredible game offering lots of fun throughout! Cant wait to see what they come up with next.\n\nHelpful | 0", "YersawApr 13 at 10:00 PM\nAmazing but some changes\n\nI have never had a vr since recently and have always wanted this game but it is only 11$ good price but it has very or barely enough content to much to put multiple hours on but if you wanna watch your friends get freaked out or have a good laugh this is the game for you\n- a happy customer\n\nHelpful | 5", "wgdJun 6 at 9:52 PM\nA Lot of Fun\n\nThis game places you in the middle of a number of imaginative and hilarious situations. It is well crafted, fun, funny and one of the best games available for the Quest.\n\nHelpful | 0", "night8wolfgaJun 7 at 8:44 AM\nDisturbing\n\nIm not entirely sure what I expected from this when I saw m rated but it was pretty disturbing to say the least. I wasnt down to stab a guy in the chest, draw the knife down to cut him all the way open, and then have to wear his heart. Theres way too much bad language as well. Its a bit fun but Im embarrassed that I completed the main story line all the way and didnt stop after even the first level or two.\n\nHelpful | 0", "sejr.stokholm.96Jun 21 at 5:42 AM\nWhere is the zoo level\n\nCan someone please help me find it?! But this is a fantastic game and I recommend it to everyone\n\nHelpful | 0", "TanixKingtonJun 14 at 2:38 AM\nWhat a mindfck\n\nShort, intensive, funny as Hell. Amazing. Dont spoil yourself by looking at videos. Just play this. Like now...\n\nHelpful | 0", "fiene17Jun 13 at 10:07 AM\nTrover Saves the Universe in Store\n\nGreat game and has more to it.\nWe need Trover Saves the Universe as the bigger brother of accounting+ in the store!\n\nHelpful | 1", "SkwintJun 22 at 9:50 AM\nId pay for more\n\nI just sit and listen to the dialogue\n\nHelpful | 0", "DetectiveVegetaJun 8 at 1:06 PM\nWhat a Game!\n\nWell it was weird and funny, strange and familiar. Fantastic Game and experience! Wish they would do more!\n\nHelpful | 0", "sammcfaddenMar 8 at 9:26 AM\nThis was a fun experience!\n\nACCOUNTING+ is a very fun vr experience that has a lot of replay value secrets and laughable moments. The only reason that I will not be giving this a five star review is because of the length of the game you can finish this game very quickly and although it is fun to play eventually you will grow bored of it after playing 5 or 6 times through. The secrets make this game worth upcoming back for as there are many of them. Overall this experience has not failed to make me laugh and I hope to see more like this in the future!\n\nHelpful | 7", "jelwellMay 18 at 11:31 PM\nOMG that intro.\n\nJust so many laughs.\nover and over. I think I was stuck on the intro for like 30 minutes. Just goading the narrator into absolute horror as I refused to move.\n\nHelpful | 1", "HailDiscordoJan 6 at 2:42 PM\nI cut him open and there it was.\n\nI played this game the day I got the Quest, it was just after Christmas Day and everyone in the house was asleep. I crept downstairs and played in silence, alone as to not wake anyone up. I can safely say it was both a compelling and disturbing experience that I will not forget. The sound, art direction, narrative and script are all fantastic and although reasonably short it is well worth the price tag. I only realised how strange it truly was once I tried to explain what I had been through to my wife.\n\nHelpful | 86", "kidskilly9 days ago\nGood but so short and easily signposted\n\nI love a good puzzle and honestly thought this would be more like that. Extended levels with a variety of objectives within the level.\n\nThere was one short series of tasks every level to get to the headset.\n\nGood but needs either double the amount of levels or double the tasks...\n\nHelpful | 0", "XxdominicVRxXMay 26 at 9:19 AM\nPickel Rick\n\nLoved this game so fun and kinda scary but was funny and so nice\n\nHelpful | 0", "Bananamonkeyplayer17May 4 at 9:26 PM\nFun! But very short\n\nThe game itself was a blast, I had a fun time seeing all the different levels and interesting storyline. But I finished the whole game in about 2 hours.\n\nEach level was about like 10 minutes, not including some of the secret levels. I feel like the game would have been better if it had more levels, or if each level made you do more than just 1 thing.\n\nOverall, Funny and interesting story, But wasnt long enough in my opinion. I would recommend Virtual Virtual reality instead if you want a longer game with kinda the same concept\n\nHelpful | 1", "NobleEMRLDApr 15 at 6:06 PM\nNice but short\n\nYou can finish everything it has to offer within an hour which I don't think is a good thing. I prefer games that always have something different, this game is very limited, it's not bad for the price though!\n\nHelpful | 1", "stevostrifeMay 19 at 12:01 PM\nHilarious\n\nIf you enjoy Rick and Morty, you'll love this.\n\nHelpful | 1", "TheSlowSignApr 29 at 5:16 PM\nGreat experience\n\nVery enjoyable the first time round. A good one to show to VR first timers. Really funny from start to finish. Definitely worth the price!\n\nHelpful | 1", "IsayUheDedJul 7 at 7:51 PM\nCan't even play\n\nThe game freezes at the new game screen. I have tried everything even factory reset and still won't work. I really was looking forward to playing this game too\n\nHelpful | 1", "cudelApr 26 at 4:05 PM\nHilarious!\n\nI had so much fun playing this game, it is simple, and funny and just a blast to play through. I wish there were more games like this!\n\nHelpful | 1", "superfrog157Mar 30 at 8:03 AM\nGreat comedy game\n\nThe game is great and I have played it through around 10 times and found new things to interact with and even new levels the only thing wrong with this game is the secret zoo level haunts my dreams\n\nHelpful | 2", "CallmeDaisukeFeb 29 at 11:26 AM\nSuper funny some replay ablity\n\nI mean I love Rick and Morty so maybe this is a biased review? The game is short if you know what your doing. There are a few different scenario to play through which does let you replay it a few times but it's a fun game to get friends to play it if they like Rick and Morty.\n\nHelpful | 3", "Leepar179 days ago\nHilariously fun\n\nAwesome game so far lol thanks\n\nHelpful | 0", "MaelwolfApr 19 at 11:17 PM\nMeh\n\nPerhaps the humour just wasnt for me. I chuckled at a few moments, but it was rare that anything in this game was weird enough or clever enough to hook me in. Some stages lacked anything to really get involved in, while others overstay their welcome.\n\nHelpful | 1", "sam.fagerholmJul 15 at 2:52 PM\nFunny as hell\n\nLaughed myself to tears in this one. One of the funniest games I've ever played!\nNot much replayability though, expect a a few hours of gameplay and then you have heard and seen it all.\n\nHelpful | 0", "LollyGagMissJul 6 at 8:16 AM\nI love it! But its too short\n\nI love everything about this game. I was really enjoying the adult humour and Rick and morty feel of it but then it ended! Im disappointed that it was completed too easily and its far too short.\n\nHelpful | 0", "kimbiecookieJan 25 at 10:44 PM\nHilarious game!\n\nSuper fun game with a warped sense of humor. First I want to say that this game despite the cartoonish graphics, is definitely not for children or people who get offended by graphic language and adult situations. Although I love this game in all its hilarity, I was shocked at some of the graphic language myself and I'm not easily offended. You get to do some pretty nasty and funny things that you can only do in VR and you dont have any of the consequences! But be warned! It's pretty outrageous, naughty fun!\n\nHelpful | 9", "Ray_RomanoMay 9 at 2:52 PM\nFun, but short\n\nThis is a fun game, but it ends MUCH too quickly. There isn't a ton to do, so replaying it isn't super fun. However, it is reasonably cheap.\n\nHelpful | 1", "Machoman439Jun 11 at 5:13 PM\nGood but short\n\nThe game only lasted me a few hours but it was very enjoyable. I really liked this game I just wish that it had more gameplay because for the price it felt really short. The wiring in this game was amazing and I had a blast while I was playing. I would recommend this game to anyone who is fine with swearing and a little bit of blood, just know that it's kind of short.\n\nHelpful | 0", "nickmo123Apr 23 at 11:53 AM\nFunniest game\n\nI could not stop laughing at the humor of this game. It's the best.\n\nHelpful | 1", "LeahEveApr 26 at 8:20 PM\n\nFun and hilarious!\n\nHelpful | 1", "UsingAuto3112018 days ago\n\nFun game, enjoyed it a lot.\n\nHelpful | 0", "frankie37Apr 9 at 4:57 PM\nMoreeee\n\nIf you like Rick and morty this is a game for you\n\nHelpful | 2", "TucoeyesMay 5 at 5:52 AM\nNo fun, just boreing\n\nThis is the shortest and most dissapointing game to me.. i love Rick and morty but this is nothing like it. I want my money back!!\n\nHelpful | 2", "JoeXJoeMar 25 at 8:35 PM\nGreat intro game if you like absurdism.\n\nThis is a great starter game for someone that likes the humor. Less a game than an interactive show. Go to work, get things done, butts, killin', lots of killin'.\n\nHelpful | 0", "TelicZafApr 6 at 3:06 PM\nloved the game!\n\ni loved the game it has a funny/weird side to it i even found the narrator at the \"safe zone\" funny i highly recommend u try this.\n\nHelpful | 1", "ZollantMar 3 at 8:47 PM\nGreat experience!\n\nThis is a great VR game, and if crude humor fits your bill, I think it is an excellent staple in your library. The experience is a little short, but I think the price reflects that well for VR standards. There are secret rooms you can find to extend your personal playtime.\n\nWhat really shines about this game, for me, is watching others experience it for the first time, especially if they're a little under the influence. Hilarious for you, and outrageous to those watching who haven't played it themselves yet.\n\nHelpful | 1", "irrelevancedJul 15 at 9:19 AM\nJust get it\n\nWish there was more wacky games like this for VR its just funny and weird just how i like it.\n\nHelpful | 0", "FoxificationJan 17 at 1:28 PM\nDO YOU LIKE NUMBERS?\n\nDO YOU LIKE STAPLERS?\nSWEARING?\nSUMMONING THE DEVIL?\nCRYING INTO A SIGNED COPY OF BARRY MANILOW'S GREATEST HITS?\nBRICKS?\nWAVING YOUR ARMS AROUND IN A VAIN ATTEMPT TO BRING SOME SORT OF MEANING TO YOUR PITIFUL EXISTENCE?\n\nThen try this game.\n\nHelpful | 25", "Punisher3585Feb 10 at 9:54 PM\nNot what i was expecting\n\nI love Rick and Morty so it was a win-win to get this VR game. I expected it to be have some funny lines here and there but it was way more than that. Theres about 10 different levels you have to get though to get different endings or scenarios.\n\nHelpful | 2", "anniemack55Apr 18 at 10:53 AM\nFunny\n\nHehe\n\nHelpful | 1", "lukejf19May 5 at 11:09 AM\nAmazing; not enough content\n\nDoesnt feel like a fully completed game\n\nHelpful | 0", "JenjenniffJun 5 at 4:37 PM\nBrilliant Fun\n\nWasn't sure what to expect, but wow, I have never belly laughed at a VR game before! It's quite short, but I think the price reflects that and there's easily an hour's play. But worth double for the hilarity and chaos. Loved it.\n\nHelpful | 0", "Aaronb3434Mar 5 at 3:16 PM\nCrazy\n\nThis game is hilarious and kinda dark as well. just wish it was longer and more scenarios were added. a great gem to add to your quest library. i hope it gets updated with more content soon.\n\nHelpful | 0", "PyrtibunJun 27 at 12:23 AM\nMade me laugh but was super short\n\nOn par with other vr games with the time you get for the value but I do wish it was longer.\n\nHelpful | 0", "fer1960htxMar 11 at 7:10 PM\nNot for everyone\n\nIts a great game if you like finding secrets and like Rick and Morty humor.\nIf youre looking for a fast pace game, then this baby isnt for you.\n\nHelpful | 1", "Blancs3030Feb 20 at 10:26 PM\nWhat if I told you zoo level was a lie\n\nThe Zoo level is the biggest troll job ever, but hey your here reading this so you care about diving into the numbers. Thank you please thank you. If you like Rick and morty then this will be the best hour of your life. Really funny non sense here and for the price it was worth it. If your not a fan of this style of comedy, your taking life too seriously and won't enjoy this. Can't honest give it a 5 or 4 though, solid 3.\n\nHelpful | 2", "TheBunkFeb 9 at 2:41 PM\nPEGI 16?\n\nYoud have to be only 13 or younger to enjoy the comedic content.\nOr ya know.... an edgy basement man boy.\n\nNevertheless I am confident that if you like this sort of irreverent anarchic non mainstream yet entirely formulaic swearathon this game will deliver for you.\n\nThe game part isnt that bad really. Sure there isnt a lot of game and its not very deep. Were not catering to the worlds greatest intellects you should know. But what there is does work pretty well in its untaxing simplicity. And when youre kind of wondering whats next, well the game just kind of does it for you and gives you what you need.\n\nMy main gripe though, above all, was the abomination ripoff from Grim Fandango of the seed gun and its weak and completely out of context implementation in this game.\n\nIt is for this transgression I cannot find any redemption for the developers, may the fleas of a thousand camels infest their armpits forever.\n\nHelpful | 3", "RumpelforeskinMar 30 at 2:31 PM\nBest\n\nOne of the funniest games in the world\n\nHelpful | 0", "me0w.jpegJun 21 at 11:04 PM\nIts very funny but lacks content\n\nGood for its price but only expect 3 or 4 hours worth of gameplay\n\nHelpful | 0", "LilBerkyMar 25 at 10:17 PM\nFunny\n\nThis game will make you laugh your a$$ off\n\nHelpful | 1", "MageriMar 12 at 3:04 AM\nA wacky unpredictable adventure!\n\nIts impossible to summarise this game. If youre a fan of Rick and Morty style comedy you need this game.\n\nHelpful | 0", "CoolKid20Mar 26 at 4:05 PM\nGreat\n\nJust great.\n\nHelpful | 0", "mackenzie_brownMar 23 at 3:05 AM\nVery epic\n\nFunny and polished game\n\nHelpful | 0", "JogoLordMar 23 at 3:20 PM\nGood\n\nYeah its good\n\nHelpful | 1", "Protector78Jan 5 at 8:33 AM\nSo amazing, I just wish there was more.\n\nFantastic game and super funny. Just a little short, also noticed a glitch with the bone xylophone where the sound cuts out. Would buy again in a heartbeat. I really want someone to make a full game of the spaceship level that changes. Again super funny and fantastically. Not for children.\n\nHelpful | 9", "agitokazuJul 3, 2019 at 10:57 AM\nAmazing being able to explore\n\nAmazing being able to explore this world Without Wires this time around. :)\n\nAlso from the creator of the Stanley Parable?\nWhy isn't that game in VR!!!!!\n\nGet to it lol\n\nHelpful | 119", "disappointment1Jun 21 at 1:49 PM\nAWESOME\n\nThis game was sooooo funny and I would love to see more!!!!\n\nHelpful | 0", "atirathaNov 10 at 12:50 AM\nUnique and weird\n\nA bit shouty for my taste, but entirely in line with the wacky Rick and Morty humour. It's nice to replay a few times to discover hidden storylines, but somehow, that's it. You go through it (including tedious passages, just to make a different decision in the middle of the game) and then the replayability steeply falls. In this aspect, the game is more similar to a movie. Not a complaint, just statement. Had fun, explored a lot, will uninstall. If you think I complain and then rate 5 stars, it's because I genuinely enjoyed while it lasted.\n\nHelpful | 34", "turtletylerFeb 19 at 9:38 PM\nReally funny\n\nThis game is really funny, and pretty fun. The only thing that would make this game even better was if it was longer. That might be hard but it even better somehow.\n\nHelpful | 0", "Rade0nFighterFeb 7 at 4:55 PM\nShort but sweet\n\nNo doubt there will be a lot of things Ive missed, indeed we all have given the elusive Easter egg.\n\nAs someone else said if you like rick and morty its a no brainier.\n\nBrilliantly funny!\n\nHelpful | 0", "TheGildedDragonMar 6 at 1:32 PM\nFunny\n\nWish it lasted longer. Great story style game. Good to acclimate people to VR\n\nHelpful | 1", "avid_fireFeb 1 at 10:39 AM\nExcellent\n\nCaptivating and fun. Humorous. Definitely repayable. Infact, you may have to replay it to find all the levels. I'm still trying to find the secret zoo level. I'm beginning to think it doesn't exist and simultaneously losing my mind :D\n\nHelpful | 1", "TheBeefiestMar 16 at 6:05 PM\nTerrible\n\nThis is exactly whats wrong with VR. Took a whole lot of people to make this piece of garbage gimicky trash game... And I even liked house of cosbys....\n\nHelpful | 5", "itzafrancoFeb 10 at 6:49 PM\nInteresting concept\n\nI think this game is great but the concept of its is weird you supposed to be an accountant and then you get mixed in vr it weird but a great game though.\n\nHelpful | 0", "Justin1111089Mar 7 at 10:50 PM\nI love it\n\nVary fun one day someone will find the zoo ending\n\nHelpful | 0", "DudeurmyheroFeb 24 at 7:57 PM\nDoesn't work\n\nIt won't allow me to use my controller to move and I don't have a 30X30 room to play this game so I can't even play the GD thing. Waste of money.\n\nHelpful | 4", "Muff-HuckerMay 13 at 10:07 PM\nNot bad.\n\nWhile it is insanely short, it is also pretty hilarious for what it is.\nI beat it twice in less than an hour.\nFun for showing off to a friend or anyone who really loves R&M.\n\nHelpful | 0", "MrPicklebushFeb 27 at 1:34 PM\nBizarre AF!\n\nIts a race to the zoo level. Is it even real ??? Goodness I hope so ...\n\nHelpful | 1", "ElectrodomeFeb 23 at 1:25 PM\n\nRate five stars or gay and you cant say no homo\n\nHelpful | 2", "NOVAxWOLF41181Jun 8 at 9:26 AM\nAwesome\n\nGreat game! Just wish there was more.\n\nHelpful | 0", "RockoFlackoFeb 14 at 11:17 AM\n5\n\nThis game is really funny, fairly long, multiple choice game, at a low price. I personally would highly recommend this game.\n\nHelpful | 1", "templetonApr 2 at 4:55 AM\nI don't see the point\n\nI don't find that it was worth it, even for a Rick and Morty fan.\n\nHelpful | 0", "brittany.cain.Jun 6 at 5:35 PM\n\n\nThis game was funny as hell and crazy i love it\n\nHelpful | 0", "yeboi22Mar 7 at 1:11 PM\nYeah\n\nYuh it good\n\nHelpful | 1", "JAIRAFF204Jan 27 at 3:18 PM\nWas a lot better than I thought it was\n\nThis game is amazing the characters are super funny except the big fan and I wasnt a big fan of him XD he was a bit scary and the secret levels are amazing definitely didnt fall over \n\nHelpful | 1", "markandlindseyJan 17 at 9:51 AM\nBrilliant\n\nIf you love Rick and Morty then buy this. The humour is the same given its the same writers and actors.\nJust buy it. Unless you don't like Rick and Morty. Then don't buy it.\n\nHelpful | 2", "Davido26Feb 2 at 8:41 PM\nFamily Reactions\n\nPlayed with family and the laughs that we got from this game were amazing. From the start to the end the game kept us entertained and made family game night a blast.\n\nHelpful | 1", "CyrixBlackJun 5 at 5:54 AM\nZoo level rocks\n\nA 30min game, expensive for how short it is. Content is AAA grade but totally needs to be longer.\n\nHelpful | 2", "MrAasenFeb 16 at 3:01 AM\nLove it!\n\nPlayed it for about two hours and havnt gotten to all the endings yet, but great fun so far!\n\nHelpful | 0", "LiNX243Feb 10 at 12:45 PM\nBrilliant\n\nAmazing game that made me laugh to being scared. I love going back into the game for secrets and it never gets old. 5 stars\n\nHelpful | 0", "mark.burnett2Mar 7 at 4:02 AM\n\nNot bad, however game play is rather short. Completed it within a hour of purchase. However actual game play was good\n\nHelpful | 1", "123MicahJan 28 at 1:23 PM\nA bit too short\n\nAt my age I would not recommend peoples kids to play this as there is lots of swears and several other thing like blood and gore. I also had trouble getting the secondary gun and on sitting mode I couldnt get the seed gun. A few improvements could be made with the few glitches I experienced. The main issue is that short games arent my thing. Everything else is completely fine\n\nHelpful | 0", "BuddyshooterDec 30 at 6:21 AM\nIt doesn't work\n\nI got trough the turtorial just fine and was already enjoying the game, however the the game broke. There is a giant black blob in front of my view and i can't get rid of it. I tried unstalling it and re-instal it again but the same ''dead pixels where stil there. I don't know if this is a more common problem for others. I will buy it when it gets updated again but know it's unplayable.\n\nHelpful | 6", "MalibinoJan 23 at 1:27 PM\nWeird\n\nStrangest game Ive ever played. Has this rick and Mitty meets Monty python vibe. Ive beaten the game except for not yet finding all the hidden rooms.\n\nHelpful | 0", "AClockworkAaronFeb 7 at 10:36 AM\nHilarious.\n\nI had a blast playing this. It seems like a great thing to get non-gamers to try as an intro to VR as well.\n\nHelpful | 0", "uramerApr 1 at 1:58 PM\nI can see it being funny if you are 12\n\nOtherwise I don't recommend it\n\nHelpful | 0", "Sea_Crust56Jan 5 at 5:24 PM\nI bought on accident - Do not regret\n\nI was looking through random games and I saw this. I didn't know I had money on my card so I accidentally bought, but I figured I might as well try it. I do not regret it. It's a funny game. A little dark but hilarious. I would recommend. Just.... not for children.\n\nHelpful | 1", "maddoxdangerFeb 15 at 11:51 AM\nGreat but...\n\nDont get me wrong I love this game but the Zoo Level conspirisy is unsolvable and they know it too. The devs put us up to this with no way out. This is false avritising but still a decent game.\n\nHelpful | 0", "SweatyChickenNuggetFeb 18 at 1:18 PM\nSecret Zoo level\n\nYoure the clown for believing that it exists\n\nHelpful | 1", "direktareJan 10 at 5:35 PM\nEntertaining\n\nI enjoyed this game. Very funny and I would definitely go back and play again at random times. I wish there were more games like this out there. It was the first game I ever completed and glad that the game play was under an hour.\n\nHelpful | 0", "andrewjoseph716May 10 at 8:43 PM\nHilarious but short..still worth it\n\nWorth the 11 dollars. It was short fun and cheap. No complaints.\n\nHelpful | 0", "theoryofeverywhereJan 20 at 1:29 AM\nNot funny or interesting\n\nThis game takes like 15 minutes to go through. Yes I know I could try more things and get more commentary, but none of it is funny. Nice try, but this is easily the worst game I have seen so far for VR.\n\nHelpful | 7", "BarbersRusJan 28 at 8:43 AM\nAmazing BUT....\n\nI was having a great time until I ran into the number one fan. He's the scariest thing ive seen in vr.\n\nHelpful | 0", "Mewawva123May 18 at 2:03 PM\n\nJust amazing\n\nHelpful | 0", "Rdiaz559May 9 at 1:38 AM\nAmazing vr expierience\n\nIt is more entertaining instead of having a family friendly game like job simulator\n\nHelpful | 0", "LeostevMar 30 at 3:05 AM\nHilarious game but\n\nThis is probably the funniest VR game but I just wished they were a bit more levels or things to do because I completed the game in under half hour so its a great game and I would recommend this to everyone but just a few more levels would be good.\n\nHelpful | 0", "grieg.er.9Feb 1 at 7:52 AM\nFunniest thing ever!\n\nIt was hilarious, just like watching Rick and Morty but being apart of it!\n\nHelpful | 0", "savage765Feb 9 at 7:14 AM\nLoved it\n\nVery funny but also very short.\n\nHelpful | 0", "BtomaekFeb 7 at 9:22 AM\nIt good\n\nIts good\n\nThere is nothing more to say\n\nHelpful | 0", "dude_of_lifeJan 11 at 8:25 AM\nA lot of fun but short\n\nOnly for those with a dark sense of humor and prepared for twisted yet hilarious situations.\n\nA lot of fun, easy but very short. Worth it though.\n\nHelpful | 0", "morganman76Jan 3 at 6:25 PM\nGreat game with some replay ability\n\nWent thru the game a couple of times and found it fun. Lots of quirky humor thats fits Justin Rolands style. Wish it had a little more replay ability but thats a small thing compared to the laughs I got.\n\nHelpful | 0", "sarabeth123Jan 26 at 10:56 PM\nTop tier\n\nGreat game fun to watch your friends play will love more levels so I can play it even more\n\nHelpful | 0", "KRONthreeDec 13 at 1:43 PM\nHilarious and Wacky\n\nI will start by saying that this game should not be played by children. This game is absolutely hilarious. The dialogue is great and there is even a secret level in the game that no one has found yet. If you decide to join in on the hunt, find your way to the Crows Crows Crows Discord. If you like Rick and Morty then you will enjoy yourself. I hope they bring More Rick and Morty games to the Quest\n\nHelpful | 5", "zahdabDec 27 at 6:02 PM\nFun and Funny\n\nThe game writing is extremely funny and though probably not the most repayable game it's still pretty fun for what it is ... it's as cheap as a few rick and morty episodes and it will last a bit longer\n\nHelpful | 0", "austin.dietz.3Jan 15 at 11:03 PM\nGet this if a fan of Rick and Morty\n\nHilarious, crafty, and completely original. I downloaded this game, beat it in one session, charged my quest, and then beat it again.\n\nHelpful | 0", "liquidneckJan 21 at 4:57 PM\nDeeeeeep bro\n\nThis is the best stupid game on VR. It goes much deeper than you think.\n\nHelpful | 0", "ZiggyFluffDec 16 at 10:05 AM\nWow\n\nThis was one of the most mysterious games I have ever played. Would I recommend it to kids no. But for the adult mind this game will really twist your mentality. But its still an all around fun game. Theres really not much I can say except... lol.\n\nHelpful | 3", "Vr_-_Ready.Jan 2 at 2:10 AM\nGreat game, played though 5 times\n\nThe voice scripting is great in this game.\nI did actually play it a few times to get the end game content.\nGot it on the Christmas sales, Id say its worth full price even just for the acting.\n\nHelpful | 0", "CJ21123421Jan 18 at 5:17 PM\nVery fun but not enough achievements\n\nI enjoyed the time I played it and its worth the price\n\nHelpful | 1", "Spidey1212Dec 20 at 7:34 AM\n100% recommend\n\nThis game was incredibly fun, I love the ability to go back and replay levels and find even more levels. Though this game is short I can definitely see myself going back to it. Thanks developers for a great game!\n\nHelpful | 2", "jayisspillz94May 26 at 10:04 PM\nWheres the water park? This game rocks!\n\nSuper funny was one of my first games and i still haven't found the water park. Really devs does it even exist? Huh let me know please??\n\nHelpful | 0", "LB82Dec 30 at 3:52 PM\nWould be 5 stars if it was 5 quid\n\nI found this game very funny in places (courtroom Chicken noodle opening statement had me crying), but it only has a couple of hours of gameplay.\n\nHelpful | 0", "thomas-lambertJan 20 at 8:23 AM\nExtremely funny\n\nFunny from the moment I started playing it. Also I love the 4th wall breaks\n\nHelpful | 0", "XICheaterIXNov 19 at 4:11 PM\nGreat but limited\n\nI thoroughly enjoyed my experience with Accounting+, but I also feel it to be a bit lacking at a 15 dollar price point. I just started really liking it...and then it was done. I still cant wait to have friends and family try this game out. But if your looking for substantial content and replayability it just isnt here.\n\nHelpful | 5", "zsmackJan 14 at 12:52 PM\nGood game\n\nYou guys need to add trover save the universe to the oculus quest too.\n\nHelpful | 0", "mikedillonnzJan 22 at 5:46 AM\nI'm now an accountant\n\nGreat game with an odd sense of humor. So much fun!\n\nHelpful | 0", "cncn60Nov 29 at 2:11 AM\nVery replayable\n\nI saw a review saying it lacks replayability, which is just plain wrong. With the amount of secrets in the game you can pour hours into it trying to find them all, making it very replayable in my opinion. Maybe thats not for everyone but after your first play through the game is far from over, believe me. Youre just getting started.\n\nHelpful | 2", "GanjadoreJan 5 at 9:48 AM\nHilarious\n\nReally fun to explore..worth the money..so funny!..Wish it was longer..but not complaining at all..\n\nHelpful | 0", "EdGY_JAITSUJan 8 at 2:51 PM\nVery funny\n\nThis game amazing and will have you laughing all the way through my only complaint is that its too short\n\nHelpful | 0", "drhamburger120Dec 11 at 2:53 PM\nBest/Funniest Game Ever!\n\nThis was literally the funniest game I have ever played, and I literally just started VR and it's my new favourite game of all time! I highly recommend anybody who is new to VR to get this game to start your experience off right!\n\nHelpful | 1", "Seadog64Dec 26 at 2:20 PM\nZanny\n\nExcellent wacky fun. Wish it were longer but still long enough for the value. So glad I made the purchase. Hope to see more from the dev\n\nHelpful | 0", "jimmy.hall.121398Mar 22 at 1:35 PM\nHilarious\n\nIf you are patient enough to enjoy this game, you will absolutely adore it. If you rush through it you may not find it as enticing as waiting for the jokes from the funny little characters.\n\nHelpful | 0", "johnathon.cox.1253Jan 4 at 4:25 PM\nBetter then the first\n\nplease update the game once add more\n\nHelpful | 0", "PastRaptor07Jan 5 at 2:08 PM\nGood but...\n\nIt was fun but a bit too short\n\nHelpful | 0", "taybay240Apr 23 at 1:10 AM\nBoring and short\n\nI love Rick and Morty but there wasn't anything to really do in this game and I didn't find it all that funny, I wont even bother showing it to anyone because I wouldnt want to bore them.\n\nHelpful | 0", "FaceFace123Dec 24 at 1:58 PM\nFun game\n\nSimple but yet a fun short story that is easily completed in one short visit, great for the money \n\nHelpful | 1", "johnson_christopherJan 5 at 8:11 AM\nGreat\n\nNeed a zoo level update though\n\nHelpful | 0", "dlopes78Dec 13 at 5:32 AM\n\nVery interesting  different. I hear that there are hidden puzzles and games on each level when you play again, I will look for it next time. It is definitely out there.\n\nHelpful | 0", "jake12345678Jan 3 at 10:11 AM\n\nThe game is fun and even once you beat it there I still alot to do.\n\nHelpful | 0", "RomulonNov 1 at 1:00 AM\na good game/ puzzle\n\nif you want to laugh, be annoyed, and search for that hidden level (lol) as well as play a good VR title thats not all rainbows and make the player all happy then this is the game for you its mostly a puzzle/story if you cant figure things out its all trial and error till you get it.\n\np.s look around you might find a hidden room or two somewhere\n\nHelpful | 8", "OkurRoDec 22 at 6:52 AM\nOne of the best games I played\n\nThis game really was the best deal I got on my quest, story for hours, great physics and all that for this small price\n\nHelpful | 0", "KaytekatttDec 26 at 9:54 PM\nFunny Game  great content\n\nThis game is for anyone who needs a great laugh. I couldnt believe how funny this was!!\n\nHelpful | 0", "StoneSaksonNov 12 at 7:14 AM\npersonally i love it\n\nprobably one of the best experience games on the quest but thats only because this is my kind of humor. as i read the reviews everyone said it was very short but i played it for about an hour and a half and I am still not done with it. I think its worth the $12 but thats only if you like this kind of humor.\n\nHelpful | 1", "PeptoBismol_PapaDec 28 at 11:45 PM\n\nI just wish there were more levels/things to do because its really fun\n\nHelpful | 0", "thx1042Dec 31 at 4:24 PM\nWhat purplemikey said\n\nIf you like \"Rick and Morty,\" you will enjoy this game.\n\nHelpful | 0", "Dolphino_spagetJan 7 at 9:50 PM\n\nAmazing game 10/10\n\nHelpful | 0", "silver93crow22Jan 1 at 6:41 PM\nGreat\n\nLove the game great if u love rick and morty\n\nHelpful | 0", "jmprescott56Nov 30 at 1:37 PM\nHilarious\n\nVery much in the same vein as Rick and Morty. If youre in to that type of humor, youll like this game. My only complaint is the game is a little short. But I still think its well worth the money.\n\nHelpful | 0", "ahawksDec 2 at 12:11 PM\nHilarious and fun but painfully short\n\nThe title was off-putting. I was afraid it would be a Job Simulator knock off. It definitely IS NOT an office game sim.\n\nThis feels like a short episode of Rick and Morty. That you pay $10 for.\n\nHelpful | 0", "mercouhysDec 25 at 7:08 PM\nAwesome!\n\nGame is hilarious and fun to play! Loved the voice acting and humor!\n\nHelpful | 0", "hobblin_goblinNov 7 at 12:32 PM\nVery fun and engaging.\n\nThis is a good game, and has a decent amount of complexity and content, especially if you are willing to dive down the rabbit hole with all the secrets. That being said, this really does feel more like an experience than a game, and it is pretty short.\n\nHelpful | 3", "WEEBLVL999Jan 6 at 9:59 AM\nFunny\n\nFunny\nFunny\n\nHelpful | 0", "Okchild234Jan 2 at 4:03 PM\nVery nice\n\nFunny and exciting game.\n\nHelpful | 0", "Psycho_retros_2Mar 17 at 7:09 AM\nHilarious but short\n\nI absolutely love the comedy of this game. The writers really captured what they went for here. However, this is not a game. Its an interactive VR cartoon. The entire thing can be completed in about half an hour and there is no post-game. It is hilarious, but way too short.\n\nHelpful | 0", "SpringfieldM1ADec 18 at 5:59 PM\nFunny.\n\nGame is funny and has alot of secret levels. Just don't like the summon satan level.\n\nHelpful | 0", "Havok_007Jan 3 at 10:33 AM\nLove this game\n\nBest game ever\n\nHelpful | 0", "SolsolidoJan 1 at 11:51 AM\n\nZoo level was worth it\n\nHelpful | 1", "zack.slotkowskiDec 26 at 7:54 PM\nFunny as hell\n\nThis game is funny as hell! Love it so much.\n\nHelpful | 0", "PickleParty44Nov 28 at 2:04 PM\nVery very odd\n\nI think this a great game and is just lots of random different areas and very weird. Id say the only problem with this is the length of the game as its quite short\n\nHelpful | 0", "adramHereDec 28 at 7:13 AM\nGreat adventure game\n\nThis game is amazing. If you like Rick and Morty you will love this game. I have played through the game I am now going through it again and finding the secret rooms. Amazing.\n\nHelpful | 0", "l2KlDec 10 at 11:58 AM\nAbsolutely hilarious and fun gameplay\n\nFor the price, one of the best games to explore what VR has to offer, and hilarious voice acting to boot!\n\nHelpful | 0", "Memes_R_UsDec 10 at 2:42 PM\nNeed answers!!!!!!\n\nHOW DO YOU GET TO THE ZOO LEVEL!?!?!GAAAAAAAAAA!!!!! ITS JUST OUT OF REACH!!!!\n\nHelpful | 0", "vinylkiller1982Nov 4 at 4:22 PM\nFun and crazy shenanigans\n\nThink of all the best, funny and crude cartoons or animations and this is what this game reminds you of. Fun cool gameplay, hilarious jokes and sayings. Really cool graphic design, this is a really fun pick up and play game. Well worth a purchase.\n\nHelpful | 0", "Smol_ManNov 10 at 5:18 PM\nThis is an amazing game\n\nI love the game it's hilarious. I enjoy all except 2 parts of it which dont ruin the game at all. Th e puzzles are fairly simple and short. That's the only problem I have with the game.\n\nHelpful | 0", "wrigler31Dec 4 at 8:05 PM\nWeird, but perfect for VR\n\nWeird game, in Monty Python way, but I much enjoyed it. Not for everyone. Mature rated theme.\n\nHelpful | 0", "LethalGanksNov 28 at 10:47 PM\nA must have.\n\nHilarious game, if you can stand some dark humor and profanity you will have a blast playing this masterpiece.\n\nHelpful | 0", "HalesaiDec 13 at 10:40 AM\ni could have just enjoyed the safe area\n\ncant wait to explore it all\n\nHelpful | 0", "PurplemikeyJul 3, 2019 at 5:53 PM\nPeople are weird - game is hilarious\n\nGame review:\nI need to start this review by saying most of the low stars (day of release) are because Oculus servers were down and people couldn't download the game. Old rant against them under the game review.\n\nThis game is for people with a weird sense of humour. I do not think it is for every one but it was definitely for me!\nSome people like to compare it to virtual virtual reality. I can totally see the inspiration. But a lot weirder. There's not much I can say without spoiling you but I promise you I won't.\n\nIt took me 1h for my first playthrough and I know I missed some things here and there so I will do it again later today. The visuals are great. The gameplay is nothing innovative but I have to say that the characters react really well to what you do. It adds to the immersion. The sounds are really well done. Sometimes you have objects in your hands that does sounds and it use spacial sound so moving it around will move the sound in the 3D space too!\nThe price of the game is really good for what you get. Price of a meal at a fast food restaurant but so much better!\n\nMuch welcomed to my library of games.\n\nOld rant:\nRating of the game went low because of server issue.\nPeople down voting the game because of that should all be blocked from Oculus reviews because their opinion is Cleary not based on the games themselves but on their incapacity to understand what is happening.\n\nHelpful | 307", "UDontHaveMyNameNov 25 at 6:07 PM\nWacky and FUN\n\nYou dont want to miss this title! Its well worth the asking price and very memorable.\n\nHelpful | 0", "Quinn_e5Mar 10 at 3:23 PM\nGG\n\nIts like the whole game was written in an hour. Hilarious.\n\nHelpful | 0", "BitableFishNov 23 at 6:11 PM\nNot all that funny\n\nBought this and thought it would be all the reviews make it to be, but it really wasnt. I havent watched Ricky and morty so maybe that has to do with it. Played for an hour or two and gave up\n\nHelpful | 4", "Kev2020Nov 30 at 10:56 PM\n\nThis review would be a 5 if I could throw things without struggling. On the vive and psvr it works much better using the triggers. It took me 20 min to get the brick through the window in this version.\n\nHelpful | 1", "schilkeithNov 30 at 1:41 PM\nGood game for quest\n\nI think its a great game for the quest in my top 10\n\nHelpful | 1", "PocketSizedOct 31 at 8:56 AM\nToo short for that price tag...\n\nThe game is OK, no more. Justin Roland does his thing, no complaints there, but the game is way to short for that price tag. If you like Roland and happens to hate 15 of your dollars, you will have a great time. If you treasure both money and Roland, you will be\n\nHelpful | 2", "Dittoman17Dec 4 at 1:25 PM\nOof\n\nOof\n\nHelpful | 1", "RobustPaellaNov 30 at 10:18 AM\nFirst game way cool. This way better\n\nRoiland knows his things!\n\nHelpful | 0", "WOPOct 20 at 3:55 AM\nIt could be worse\n\nIt made me chuckle a couple of times. Definitely not the trickiest escape game, but worth the price. I wish you could explore the \"menu\" scene more :). Sound and visuals are great and just annoying enough. Short but \"sweet\".\n\nHelpful | 0", "ExaltedBlizzardOct 10 at 10:45 AM\nFunny experience\n\nMore than it is a game, it is a dark and humorous VR experience, like being part of an especially twisted Rick and Morty episode.\nWould definitely recommend for anyone who appreciates this brand of humor.\n\nHelpful | 4", "tyler.gulley.52Nov 16 at 6:39 AM\nOdd but Hilarious\n\nThis game keeps making me laugh each time i play it\n\nHelpful | 1", "JoseDylanLanaNov 21 at 5:59 AM\nLots of fun\n\nAnd just finding secret levels...\n\nHelpful | 0", "TheNeonDuckNov 24 at 2:00 PM\nFunny\n\nMe me love\n\nHelpful | 0", "BlackOps0422Oct 27 at 1:24 PM\nHilarious and Weird!\n\nIts a little short, but totally worth it. Lots of laughs with all my family members and friends. Love this game and Rick and Morty. Totally worth it!\n\nHelpful | 0", "GrassBlockYTOct 19 at 2:58 PM\nVery hilarious and fun!\n\nThis game may not be for everyone but if its for you, than it is one of the best games ever! Anyone who likes Rick and Morty will DEFINITELY love this game!!\n\nHelpful | 2", "ThatGreenGuySep 19, 2019 at 12:48 PM\nThe most fun i've ever had!\n\nI have never screamed of fear and laughed so hard at the same time. This game is truly a one-of-a-kind. I haven't got to playing the whole game yet but I think it is absolutely awesome! One of the best games out there, and also one of the cheapest. If you have 12 bucks do spend it on this instead of a Beat Saber song pack or a McDonald's menu.\n\nDefinitely the most fun 12 euro's can buy! :D\n...if you like Rick and Morty style humour. Not everyone does. ;)\n\nHelpful | 3", "Pman2234Oct 20 at 3:28 PM\nPure genius\n\nMust have for fans of rick and morty. This game will leave you with more questions than answers. Also the zoo level was brilliant, so many aminals \n\nHelpful | 1", "DeadlyDosage96Nov 9 at 9:47 AM\n\nPretty hilarious game.\n\nHelpful | 1", "JAM3XSep 22, 2019 at 5:23 PM\nAmazingly Short\n\nThis is a weird type of game with a strange sense of humor. It guides you through a crazy story where you do some Job Sim type interactions, but weird and funny. Only gripe is that it's pretty short. Try it if you like Rick and Morty... Definitely\n\nHelpful | 0", "brookeschaapJan 21 at 9:11 PM\nEh\n\nim a huge fan of rick and morty so i was really excited to buy this game. finally i got the money for it and i feel like i wasted my money. its great n all but its such a short game and to be totally honest im a little disappointed. hopefully they add more to the game if possible?\n\nHelpful | 0", "criminalmine62Mar 14 at 2:49 PM\nGood but not enough\n\nIts a little pricey for almost a half of an hour of play time\n\nHelpful | 0", "MoneybagvrNov 5 at 10:39 AM\nLol\n\nWtf come to mind buy love it replay it\n\nHelpful | 0", "thisisPrandallSep 26, 2019 at 8:38 AM\nHilariously strange\n\nThis game is too funny and visually stunning. Its so much fun to travel to the different areas and meet all the weird characters. If youre a fan of Rick and Morty, or just that style of humor then youll love this game.\n\nHelpful | 0", "dingoflingOct 29 at 5:34 AM\nReminds me of Konkers Bad Fur Day\n\nDoofy , funny, smart, fun game especially first time playing.\n\nHelpful | 0", "bamafragzOct 2 at 3:50 PM\nAbsolutely Hilarious\n\nPretty much anything that William Pugh releases is pure gold. Couple that with Justin Roliands contribution, and it instantly became one of my favorite games for the Quest.\n\nHelpful | 1", "V0L4T1LEOct 16 at 4:54 PM\nI loved it\n\nFirst, it's priced well. Unlike so many others.\n\nSecond, if you like Rick and Morty you will like this game.\n\nHelpful | 0", "josiahdmarrsOct 25 at 11:13 AM\nHilarious and fun\n\nIf you like Rick and Morty style humor, this is for you.\n\nHelpful | 0", "ryanmartin0022Oct 14 at 5:30 PM\nAmazing\n\nOk i'm overwhelmed by how funny this sh*t is i did not expect anything ive ran into so far i love it\n\nHelpful | 0", "JaylamarAug 30, 2019 at 3:31 PM\nMeh\n\nEven if you are a fan of R&M you might find the style of humor/narrative that is common in each of the different \"worlds\" a little tiring.\n\nThe first play through was shockingly short. Even if you end up finding extra worlds (on purpose or by accident) they're just more of the same.\n\nThe rating would be one star if it there wasn't a couple fun details and interactive scenarios that made me smile.\n\nBuy it and try it though, you might like it, if not, refund it. Two hours is more than enough time to play through once and decide if it's worth it.\n\nHelpful | 5", "sage.bond.2000Jul 4, 2019 at 12:46 PM\nBetter than Vader immortal\n\nThis game has more content than Vader immortal. It makes fun of you like no other VR game has before. It's far more of something you experience. It feels like it's in the same world as Rick and Morty so I think fans will like it. If you not a fan of the show this game will be one of the weirdest things you've ever played.\n\nHelpful | 29", "SwagcityUSAAug 28, 2019 at 5:42 AM\nStunning\n\nThis game is incredible, from its design to its nonsensical story line it caters to the weird to the normal looking for a peek into a creative mind of someone else. I personally got this game because I am into Rick and Morty and the creator was part of this project( which explains the games weird tendencies) its amazing and trippy you feel completely immersed. You could feeling fear from your surrounding but the hilarious dialogue just evens out every level and its and nonstop laugh factory, and 70% of the game is Easter eggs the game make you look for the content in the levels you love. In conclusion, I love it, its amazing, as close to perfect as they come\n\nHelpful | 1", "tzeentch9Oct 4 at 12:51 PM\nGreat app\n\nSupetb game, must have fo rick and morty fans. And the zoo level at the end was absolutely epic\n\nHelpful | 0", "omer.lara.58Oct 11 at 8:12 PM\n\nLove the game its grosome but I still like it\n\nHelpful | 0", "JuicyFruitSnackJan 23 at 12:37 PM\nFun\n\nIt's short but enjoyable\n\nHelpful | 0", "Earkneestew13Jul 4, 2019 at 1:15 PM\nWhat a trip!!!\n\nThis is my first review since I purchased my Quest. I have tried different titles ( Super hot, robo recall, Moss ...etc). But this is one of my favorites by far. I will say I'm a big \"Rick and Morty \" fan, so that might be one of the reasons why I enjoyed it so much. This is more of an experience with some play mechanics than an actual game. So don't expect much replay value. However... this is an amazing/hilarious experience that makes you feel like you dropped shrooms and are stuck in another dimension... ( vr pun intended) . So if you're into trippy experiences... this is definitely for you!\n\nHelpful | 9", "TheFinestEelOct 10 at 7:14 PM\nweird af but also funny af\n\nits funny af because its weird af\n\nHelpful | 0", "CorrixisOct 7 at 1:58 AM\nClassic\n\nGotta pick it up if you have VR. Must have experience\n\nHelpful | 0", "Ed.paulleyAug 15, 2019 at 7:22 AM\nHilarious\n\nThis game got me to buy the quest. Went over friends house he got me to play it. So funny! I was at a desk next thing you know I was in another world listing to this weird thing coming out tree saying get out of his world phone rang i picked it up listing to dude on phone while listing to weird thing out tree in other ear saying get out of his world put that down. Game well worth the price!\n\nHelpful | 1", "joshua.devine.1992Oct 4 at 6:17 PM\n\nThis game was amazing I loved every second of it\n\nHelpful | 0", "Animator52Oct 5 at 4:52 PM\nEntertaining AF!!\n\nThis game was such a good time.\n\nHelpful | 0", "Boltz_N_BulletzAug 8, 2019 at 1:12 AM\nThere is no Zoo level!\n\nThis game has definitely a Rick and Morty vibe goin! And that's a good thing! however, some people might find it too... immature and offensive? anyways, that's how the \"oldies\" in my family said. lol!\nIf you rush through it, easily completed within an hour... however, there's this rumor of a hidden Zoo level that no one in the net seems to have found! I think its just a hearsay made from the devs themselves to increase the game's re-playability. There is a lot of hidden stuff though! just no Zoo level.\n\nHelpful | 0", "VKGAMINGJul 3, 2019 at 1:24 PM\nNot able to download\n\nIm rating this 5 stars for its content as I already know how great the experience is. Unfortunately Im not able to download it on my headset. When I press download it cancels out each time.\n\nHelpful | 53", "21ThanosCar21Jul 5, 2019 at 9:06 PM\nWhere is the Zoo Level?????\n\nYou cannot download because of Facebook servers... why rate the game bad for no reason at all? Its just gonna push away customers. From what Ive seen, this game is great. Cant wait to get into it when the servers are back up!\n\nUpdate: After completing the game 3 times now, Im hooked. Very different and unique game with a lot of secrets and things yet to find. Its clear this game is very well thought out with its easter eggs and ARG. Looking for secrets and such and the zoo level has made it one of my most favourite experiences yet.\n\nHelpful | 23", "YUNGBUMOct 1 at 2:45 AM\nFun game to play and laugh at.\n\nGood\n\nHelpful | 0", "ken666Jul 3, 2019 at 2:10 PM\nBought but the download doesn't start\n\nAs I said in the title, there is a problem because it is impossible to download the game ! You might have a server issue. By the way, I am sure this game rocks because I am a huge fan of Rick & Morty ! The dialogues, the situations and the characters are just hilarious ! I put a 5 stars even if I have to wait to be able to play the game :)\n\nHelpful | 11", "GlowBoxAug 8, 2019 at 2:20 PM\nExcellent Adult game for the Quest!\n\nPerhaps don't share this one at the next family gathering! Extremely funny, dark and horrifying.\n\nIf you think you've completed the game in less than an hour, you're selling yourself short and missing a TON of content. It's a 3-4 hour experience for sure. It's similar to Virtual Virtual Reality, but a lot darker and Rick and Mortierer. 6 stars!\n\nHelpful | 1", "JustinsullivanSep 9, 2019 at 12:16 PM\nAmazing creative and Hilarious\n\nI love how much time they put into adding soooo many voice lines for every character. Well done, really well done\n\nHelpful | 2", "bmkippJul 3, 2019 at 7:40 PM\nAwesome crazy adult fun\n\nGreat experience full of laughs and secrets. Enjoyed it thoroughly and currently one of my favorites on the quest. Hopefully those who rated it bad during oculus downloading issues will come around. Definitely 5 stars here!\n\nHelpful | 9", "AlabasterSlimSep 9, 2019 at 11:31 AM\nTree guy sounds just like Rick & Morty!\n\nIt's so cool! It sounds just like Rick & Morty! And the secret zoo level was the best part!\n\nHelpful | 1", "G8ter65Sep 25, 2019 at 7:17 PM\n\nSo fu****g funny\n\nHelpful | 0", "livsonJul 3, 2019 at 7:30 PM\nCan't download, but I know its good!\n\nPeople who come here to give a bad review because Facebook servers are down need to chill the f out. Your inconvenience isn't so important that you should be able to damage a devs reputation and livelihood. Grow up! This game is hilarious and a trip. Get it.\n\nHelpful | 5", "spriterightsJul 29, 2019 at 8:43 AM\nHilarious\n\nThis game is like one big VR episode of the Rick and Morty ad-lib TV shows and it's amazing. Playing in a smaller space (less than 2x2m) felt pretty awkward and the restrictive movement zones didn't help, but there's no focus on quick or accurate movement so it's not too bad.\n\nHelpful | 0", "J3SS1CAK3SSep 15, 2019 at 2:10 PM\nACCOUNTING + MORE PLease\n\ni loved this !! i just wish it was longer :(\n\nHelpful | 1", "TobantaAug 25, 2019 at 8:24 AM\nFunny and Terrifying\n\nThis scared the crap out of me but also was hilarious. Would recommend but you will get more out of it if your not scared easily.\n\nHelpful | 1", "funkyteeSep 5, 2019 at 1:35 PM\nHillarious!\n\nnever laughed that much while being insulted! :-)\nMore like this please!\n\nHelpful | 1", "Nihat1984Jul 4, 2019 at 2:51 PM\n\nThank you to the devs for bringing it to the Quest at no additional cost. We need more of this to make the Quest library grow. As for the game its short and funny but worth it for any Rick and Morty fan. Hopefully we will also see Trover Saves The Universe ported over soon.\n\nHelpful | 3", "DiamondDutyJul 17, 2019 at 2:57 PM\nA tad buggy, but great!\n\nHad some bugs, like Im with the skeletons, if you play the music too frivolously the the audio will cut it mostly and be very quiet.\n\nI also ran into my screen turning black when returning to the burning tree world, but the game still made some noise. Had to restart.\n\nAll in all though, the bugs are few, but I am confident they will be addressed.\n\nThe game itself is amazing, very comical. The shine comes from the dialogue and voice actors. Great stuff.\n\nHelpful | 0", "Me_occidus_deisJul 4, 2019 at 1:54 AM\nSurprising\n\nIve seen the core game played before, but I did not know about the apple goggles until I played it last night. I wont give any spoilers, but it scared the crap out of me. The developers did such a fantastic job giving a loose fun tone the whole game. Then out of nowhere it flips the fun tone on its head making it that much more disturbing. Id give it a higher rating if I could, will definitely be keeping an eye out for more games by these devs.\n\nHelpful | 9", "infinityX223Jul 3, 2019 at 10:54 PM\nAwesome adult game.\n\nFirst things first...This game is for adults. That being said, I've been following Justin Roiland since the Channel 101 days and this game is a must have for anyone that is a fan of his humor. Also, if you love Rick and Morty then this is the game for you. It runs great on the quest and it's a must buy for sure. 5 stars.\n\nHelpful | 8", "GastonGordonJul 7, 2019 at 11:18 PM\nI hated it but I'm glad I got it\n\nEverything is fun and amazing until accidentally get into an alternative ending and you meet the \"VR biggest fan\". Oh \"*jeez* things got really creepy really fast after that. I had to take of my headset frequently to remember I was still safe in my house.\n\nFunny dialogue, interesting characters, deep philosophical questions and lots of emotions.\n\nThere is no challenging game mechanics it's more like a movie or theater play but with the infinite possibilities of VR\n\nIf you like \"Rick and Morty\" style of humour and don't mind being in super uncomfortable situations I would definitely recommend it\n\nHelpful | 5", "FreeBurgersJul 3, 2019 at 11:52 AM\nToo happy\n\nSo happy this came to the quest, gimme More I will give you all my money's! Virtual-rickality! More!\n\nHelpful | 27", "jake.steeleJul 4, 2019 at 11:15 AM\nNot bad, Short requires replayability\n\nNot a bad game, the first play through seemed short, beat it in under an hour waiting through most of the dialog. I noticed after that I missed some of the rooms, had to go online and figure out how to find the different rooms. Game has some funny humor however feels a bit tiring at times, lots of repeated dialog. Really feel like its 3 1/2 - 4 stars.\n\nHelpful | 3", "KittyDark81Aug 18, 2019 at 6:18 AM\nFunny but short\n\nIt is indeed funny and fun but its one of those short games that you play 2-3 times max just to see alternative endings and then forget all about it, no replay value here at all. Would love to see more things added to give it some replay value or a longer gameplay\n\nHelpful | 0", "JforssbladJul 5, 2019 at 3:25 PM\nBaffled!\n\nI... Hmm I would say... Wow! This is the most disturbing and crazy fun game I've ever played. Most of the time my mouth was open and I silently wondered hwo these people were that created the game. So twisted and out of bounds.\nIs there a hidden level?\n\nHelpful | 6", "Wraith2021Jul 4, 2019 at 9:44 AM\nFun, Short, But Not For Kids\n\nI really enjoyed this. It wasn't long, and i'm sure there are two levels I have not completed, which I will find out when I play it again, but was worth the cost. It is definitely not for kids. Also, makes sure there are no kids around when you play it, because it is littered with foul (but funny) language.\n\nHelpful | 4", "LIN3Jul 6, 2019 at 8:04 PM\nWow\n\nAccounting is a freaking work of art! My favorite game so far and I own most the quest library. This game is so future forward. My only gripe is that it was a little short. This is easily an instant cult classic. Accounting is my answer to what entertainment based off dreams would be like. I hope to see more developers take these kinds of creative risks! This outside the box gaming, surreal immersive madness. This is VR at its finest! Thank you!\n\nHelpful | 2", "mercilessqtipJul 9, 2019 at 2:13 PM\nNot really a game, but.... Still cool...\n\nI got this game to review for my Channel. I played originally on the Vive years ago. I would have to say that it was very funny then and still holds its wonder and excitement after all these years. Justin roiland is effin hilarious! I wouldnt say its a game, there are playable parts, but you can finish in one 20-30 minute session if you are uninterrupted! It is definitely not appropriate for kids but rather entertaining for adults. Lots of blood and foul language. Which doesn't bother me, but my kiddos ain't playing it! If you are looking for something different, that will entertain you and or other adults.. oh, and you like Rick and Morty.. then go ahead and get it! $11.99 ain't bad and your purchase will guarantee more VR games will get developed. Youtube.Com/user/ChrisBlakeShula\n\nHelpful | 1", "onefootfarinaAug 2, 2019 at 9:47 AM\ngood game but very quick\n\nvery good game I love the art work and as a fan of rick and morty the experience was very enjoyable and had fun doing it. With small simple puzzles in it, it goes by very quickly. the gameplay felt like not even a hour to me and I finished it in one session. I Would recommend this game if you have money to spend, but if ur limited on ur game options because of budget Id say keep looking\n\nHelpful | 2", "daniel_crkJul 6, 2019 at 8:18 AM\n\nExtremely funny dialog (especially if youre a R&M fan) and great voice acting, but really short. I realize this is a new platform and prices in the store are extremely over-inflated, but this strikes me more as a free promo for something bigger, rather than a commercial product.\n\nHelpful | 1", "Tekray187Jul 4, 2019 at 2:35 AM\nTwisted like a rollercoaster\n\nI own this title on PSVR. Bought this on Oculus to compare and contrast and Im not disappointed. Being untethered adds that extra little dimension the game was missing.\nIf youre a Rick and Morty fan youll enjoy this game. Justin Roiland is fast becoming the Tim Schafer of VR gaming.\nAnybody see any Power Babies? \n\nHelpful | 3", "Spamcan01Jul 3, 2019 at 10:11 PM\nA short but twisted experience\n\nIf you happen to be a fan of Rick & Morty or just like crap thats straight up WTF weird this is for you. Its fairly short but entertaining all the way through and has enough content thats easy to miss on your first few plays that you will want to experience it more then once.\n\nHelpful | 4", "KevcopoJul 8, 2019 at 5:44 PM\nIm absolutely impressed\n\nThis game is probably the best VR game I have played. Im so baffled that they have this at $11 when there is games for 25-30 that dont even come close to this. This game is absolutely hilarious, super clever, and just all around fun to just sit and listen to every word the countless characters say. There is multiple levels to explore (including this one really creepy timeline you can go to which freaked me out) but wow if you havent bought this game yet I dont know what youre waiting for.\n\nHelpful | 0", "dottrixJul 3, 2019 at 5:35 PM\nFirst time ever, and on Quest\n\nFirst time ever playing this game. Very funny, lots of LOL moments, especially if you are a fan of Rick and Morty. I played the first part, at least I hope it's the first part, but I'll be diving back in to play it again, and explore some more, and the other areas of the game.\n\nHelpful | 4", "MegaNarwhalBlastJul 25, 2019 at 7:29 AM\n THANK YOU \n\nAll day long, forever. All a hundred days. Accounting + forever 100 times. Over and over, accounting+adventures.com. All 100 years. Every minute, accounting+.com.\n\nHelpful | 4", "welshboy1971Jul 4, 2019 at 6:11 AM\nBrilliant\n\nAn amazing VR game/experience and well worth the money with multiple play through to find all endings. If you like Rick and Morty then this is a must buy.\nOh and please ignore any 1 star ratings or complaints about it not downloading ... It's not the game , there are issues with Facebook and it's servers right now which is effecting all store downloads.\n\nHelpful | 1", "CavmedicJul 10, 2019 at 7:51 PM\nGreat and Funny Game\n\nI bought this on PSVR, and immediately pulled the trigger when I saw it come out on the Quest. The humor is very similar to Rick and Morty. This game is better on the Quest than the PSVR. Ability to move freely within the Safe Space is a welcomed addition from the PSVR version. Hopefully they come out with Rick and Morty Virtual Rick-ality and Trover soon for the Quest. I absolutely love these titles!\n\nHelpful | 0", "ScoobyShmacksJul 15, 2019 at 4:13 PM\nGood game\n\nProbably one of the most fun/comedic games youll play, only problem is its short but there are a lot of Easter eggs to go back and see. Fosho a cop for any rick and Morty fan as well\n\nHelpful | 1", "ghindmanJul 16, 2019 at 4:44 PM\nWeirdest Thing In a Long Time\n\nWell conceived and designed. Got a wee bit repetitive, but overall great an hilarious. Some throwing required, which I find doesn't work great in Quest, but maybe that's just me.\n\nHelpful | 0", "EpicPeteJul 3, 2019 at 8:13 PM\n\nI first played this on steam using an HTC Vive and got so into it I accidentally yanked the cable out of the computer. Im so excited that this is on the Quest now! The freedom of movement and immersion is incredible!\n\nHelpful | 5", "morris.wolfe.14Aug 19, 2019 at 3:20 PM\nGreat\n\nGood Royale mode\n\nHelpful | 1", "WanderyJul 3, 2019 at 2:56 PM\nSo Funny!\n\nI love this game so much. Its from the same people who made The Stanley Parable and its equally as funny. Very happy its on the Quest now! We need more funny games like this!\n\nHelpful | 8", "Frolic_HazeJul 4, 2019 at 6:54 AM\nHumour is deciding factor\n\nTo each his own, but I find the humour in this game a little grating. Jokes are beaten to death, and the voices are shrill and annoying. It is just not very smart. But technically sound and not bad for the price. 3.5/5\n\nHelpful | 3", "AlmightyDerekJul 4, 2019 at 11:43 AM\n\nReally funny game. I had some issues with text losing focus in the beginning section and I wish you could walk with the analog stick instead of teleporting but still a cool experience for those of us with odd senses of humor.\n\nHelpful | 0", "JohnHFreemanJul 11, 2019 at 9:40 AM\nLove the game, but this port has issues.\n\nAccounting is a game that way back when it first released I'd always put my friends in when they first try VR. When I saw it coming to the quest, I bought it instantly! I don't regret it as the comedy is still there, but there are some problems that NEED to be fixed in future updates. I'll put them in a list in order I experienced them and also try to be spoiler free.\n\n-The subtitles are horrid. They move in and out and bend while you move your head causing massive eye strain as soon as the game starts. It's like going from looking straight to having to cross your eyes as hard as you can just because you tilted your head. This needs fixed asap.\n-In the tutorial it tells you to hold the Menu button to return there. There is no Menu button on the controllers so it's impossible.\n-While teleporting you can see outside the borders of the window. It looks bad and I thought it might just be in the first scene, but it looked the same for the rest of the game.\n-Scene 2 of the actual game looks bad. I know the Quest isn't super powerful and all, but that scene probably needs revised to match what the Quest can do. It really kills the mood of the scene because it lacks any type of graphic fidelity.\n-The scene after using a coin has major framerate issues. I've done it three times, twice after restarting the Quest to make sure it wasn't just a bug, but it still kept happening. It slows to a real chug and I imagine if I didn't have almost 3 years of VR experience I'd probably get really sick.\n-In Court, throwing LPDs seems to work 50% of the time. I've tried stopping my arm as soon as I release and while my arm is still moving and both ways lead to it just dropping half the time. I've theorized this may be a hardware issue with the quest as it may lose tracking behind the user and when it can see the controller again it just drops them. However other games do this fine so it might just need some tweaking.\n\nI still love this port, but the issues keep me from suggesting to other users and I can't really throw new people into VR on it because of some of these. It just needs some polish. Looking at the credits it looks like this was ported by tow guys which is impressive! Keep up the good work and looking forward to an update.\n\nHelpful | 5", "dale.thatcherJul 20, 2019 at 11:44 PM\nShort and not funny enough\n\nToo much dead time in a very short title and a large quantity of that is squandered with repetitive \"jokes\".\n\nNot worth spending your money on.\n\nHelpful | 10", "KristaalosJul 20, 2019 at 12:03 AM\nFunny & Entertaning\n\nIf it wasn't for a YouTube video I would have never given this game a chance. But I'm glad I did. Very entertaining. Clever writing! Make more games!!!\n\nHelpful | 0", "Pet_RoosterJul 7, 2019 at 9:03 AM\nI guess I just don't get it...\n\nHad a few chuckles for the first few minutes but I gave up on this app. Its cartoon characters yelling obscenities non stop or invisible people arguing. Dull and boring...\n\nHelpful | 12", "hypermatrixAug 27, 2019 at 1:06 AM\nDisappointing\n\nToo short. Also, I was expecting more, given it's from the same creators of Ricky and Morty. This should be a five dollar game.\n\nHelpful | 0", "KjellkviistJul 3, 2019 at 4:53 PM\nGreat game\n\nWas finally able to install this game and i must say that this game is AWESOME! One of the funniest games i ever played. A must have for the Quest and only 12 dollars, wow!\n\nHelpful | 5", "Kilocharlie10Aug 12, 2019 at 5:23 AM\nNot accounting, a masterpiece\n\nGreat game would recommend\n\nHelpful | 0", "Ihrie3 days ago\nNeat\n\nAn amusing if all be it a short experience. Could be higher rating or lower rating depending on your view of the humor.\n\nHelpful | 0", "OldowlJul 9, 2019 at 6:49 PM\nNot much replay value but...\n\nThe game as a whole is an amazing experience. Its kind of like being in a funny vr movie. There are two different story lines and maybe a hidden zoo level that no one has actually found?\n\nHelpful | 0", "andyphillips99Jul 5, 2019 at 12:47 AM\nMeh - kinda boring\n\nI like Rick and Morty, I get the humour - but thats basically all this game is. Its wacky random sketches with a lot of clumsy dialog thats occasionally pretty funny. For this to be worthwhile imo there should more gameplay, youre often just stood around watching some character babble on\n\nHelpful | 4", "acid360Jul 4, 2019 at 5:18 AM\nGreat price for a strong funny narrative\n\nFirst off Ignore all the negative reviews, most are based on game not installing which isnt the devs fault.\nThe game has great comedic timing and youre in for a treat If your a Rick and Morty fan.\n\nHelpful | 1", "andrewfilms515Jul 3, 2019 at 2:58 PM\nCan't wait!\n\nI have played the free version on PC and loved every minute!!! (Especially the tree guy!). Can't wait to play on quest and play the levels that aren't on the free PC version!\n\nHelpful | 4", "fernando.vazquezjrJul 5, 2019 at 8:23 PM\nAn amazing experience\n\nFunny crazy weird entertaining definitely a wonderful experience.. so far this would be the best game that I brought on here.. I'm going to enjoy letting my friends and family play this one..\n\nHelpful | 0", "Chris_StaceyJul 3, 2019 at 5:44 PM\nFirst VR game I've hurt myself laughing!\n\nOk, it's crude - great! It's not for kids - great! Fell over and punched multiple walls - great! Hungry for more - umm... great? Yes! Get it. Price is (you guessed it) - great!\n\nHelpful | 2", "TomanoleJul 5, 2019 at 8:52 PM\nHilarious, and gives you a little more\n\nThis game is super funny and entertaining. However, it was a little too short (like me). Leaves me wanting more scenes.\n\nRevised: Go back in. You'll find more stuff!\n\nHelpful | 2", "aPARTtimeASTRONAUTJul 11, 2019 at 11:10 PM\nZoo level\n\nI didnt know what I was signing up for with this one. If you look deeper and enjoy it for what it is,youll get what you seek\n\nHelpful | 2", "StillpointtJul 3, 2019 at 10:05 PM\nIts accounting plus.....on quest!\n\nYou can have all the laughs and find all the secrets now with no wires. And hey. Maybe youll find the zoo level along the way.\n\nHelpful | 3", "GeeseBeGoneJul 8, 2019 at 6:45 AM\nExcellent experience\n\nThoroughly enjoyed this VR comedic experience. Light adventure aspects with great writing. Its worth mentioning theres a fair amount of 4-letter words.\n\nHelpful | 1", "OrdinaryWorldJul 4, 2019 at 3:52 PM\nNot great. Not terrible\n\nYou know, I get it. It's more entertainment than a game. I like Rick and Morty. But even so, beyond being somewhat amusing, it's a bit dull and unimaginative in terms of gameplay. Overpriced for what is essentially a single mediocre episode of a TV show.\n\nHelpful | 5", "VRBikerJul 7, 2019 at 10:12 AM\nCrazy funny and immersive!\n\nEven though I never was really into Rick and Morty I really enjoyed this game. The graphics are great and the dialogue is hilarious. I love playing those bones!\n\nHelpful | 0", "cthulhu314Jul 5, 2019 at 12:46 PM\n\nNice concept and humour, but roomscaling works bad. It does not fit the walkable area into the guardian but just centers to where the player is standing, so half of the time I am busy with readjusting the view so that I can reach what I want to reach. Subtitle are also broken, they are so strangely placed that I cannot focus my eyes on them.\n\nHelpful | 0", "camwiebeJul 13, 2019 at 10:12 PM\n4/5 till I get more Zoo level hints\n\nNeeds more direction for the zoo level\n\nHelpful | 2", "QuaemixJul 20, 2019 at 2:03 PM\n\nThe game is very funny, especially if youre a rick and morty Fan, same humor\n\nHelpful | 1", "leaper1981Jul 7, 2019 at 5:20 AM\n\nplayed this on vive & enjoyed the humour and experience, unfortunately it's full of bugs on here (thus the score) from the court room scene onward it started to pixelate and break up, got to the chase scene with it still happening & it was impossible to put the vr glasses on, had to just quit the game. Please fix! Also centering, you want to look in the direction you want to center the view but it just centers to a random direction, ended up doing circles trying to get it in the direction I wanted it facing. Please can you look into these issues & I will rate it as the game should be (having played before)\n\nHelpful | 2", "RamenWater57Jul 13, 2019 at 7:10 PM\nAmazing\n\nprobably the best first vr experience i could have ever had nothing but crazy funny and weird stuff in this game\n\nHelpful | 0", "TrevkatJul 3, 2019 at 6:11 PM\n\nPEOPLE, do give a game one star because youre unable to download it. Its not the developers fault. Shame on you!\n\nHelpful | 8", "RealLifeKurtzJul 14, 2019 at 12:10 AM\nShort but sweet\n\nLaughed hard while playing this game, loved the humour. A bit short though\n\nHelpful | 0", "YMoosa17Jul 5, 2019 at 2:57 AM\nFun game, technical issues\n\nMy first playthrough of this game included several technical mishaps.\nFirstly, the subtitles seem to overlap and appear blurry, as if the IPD slider has not been configured correctly. I would recommend disabling these immediately, as I could not find a way to make them appear clearly. It feels like crossing your eyes to look at your nose.\nSecondly, there were major graphical issues. The entire screen appeared black, textures refused to load in, at one point there was a large black shape in front of me that followed me around. I also encountered a bug where objects from the previous level would be visible in the current one and the entire screen would flicker. I loaded into a completely black room at one point, left wondering how to progress. Restarting the game did not fix this, but turning my headset to sleep mode and back on seemed to clear everything up.\nFrom then on, I encountered no bugs. The actual game was quite enjoyable, if slightly obtuse. It's extremely short, even including extra levels that require multiple playthroughs to complete. The humour was pleasant and the gameplay was decent.\n\nHelpful | 2", "pekerthebossJul 4, 2019 at 6:34 AM\nAmazing\n\nThis game is amazing to simply play without wires to move you can still do it with the controllers to be able to sit done and play is amazing\n\nHelpful | 0", "OHUGITHOJul 4, 2019 at 1:59 PM\nGood voiceacting, great experience\n\nTitle says it all\n\nHelpful | 3", "DAX_QcAug 13, 2019 at 6:52 PM\nCrashed on me and short.\n\nHence 3*. Very very short. My kind of humour so I liked it.\n\nHelpful | 0", "DragonfireHD76Jul 7, 2019 at 11:52 PM\nWeirdly dark\n\nIts the perfect little game it makes you kinda laugh but also makes you wonder what's going on\n\nHelpful | 1", "Blazing_ThumbsJul 9, 2019 at 6:18 AM\nGame not as advertised!!\n\nTerrible gameplay! Do not recommend wasting your money because dont expect to get your refund because oculuss refund policy doesnt exist!\n\nHelpful | 9", "jorge.hurtado.9275Jul 3, 2019 at 5:04 PM\nGreat game!\n\nThanks for putting this game here, its very funny! Even at double price it is worth it!!\n\nHelpful | 3", "ARCHMOWiEJul 4, 2019 at 9:00 AM\nFun(ish)\n\nOk so maybe its because I hate Rick and Marty, but I find the characters in this game annoying. Sound like they were pretty much wasted the whole time making this game. I found the game has some fun moments, but seriously shut the characters up. Let them say a few things instead of just annoying you to point of shutting the game off.\n\nHelpful | 3", "RandomLCPJul 4, 2019 at 4:57 AM\nFun but short\n\nVery enjoyable game and good for laughs. Just wish it was a little longer.\n\nHelpful | 1", "Jorge_ClooneyJul 5, 2019 at 3:31 AM\nA lot of fun\n\nI was LOLing from the very start! The dialogue is brilliant and over all just a lot of fun to play.\n\nHelpful | 1", "darwins.lastJul 4, 2019 at 8:47 PM\nHilarious\n\nWeird and very funny. Nice to experience and different to say the least.\n\nHelpful | 2", "Killbot4of1Jul 10, 2019 at 6:01 PM\nGreat and Funny\n\nVery Funny. Lots of fun. A little short but worth the money.\n\nHelpful | 0", "KunerokoJul 3, 2019 at 3:09 PM\nAmazing\n\nAmazing game! Hope more games with justin roilands humor will be on quest.\n\nHelpful | 2", "SuperPukeJul 15, 2019 at 8:53 AM\nA must for Rick and Mortoy fans\n\nFunniest game out there. Not for kids\n\nHelpful | 0", "LookeStuffJul 4, 2019 at 1:10 PM\nJust buy it.\n\nAwesome experience, had me in stitches the entire experience. Scooter for ever!!!\n\nHelpful | 1", "sanchitcop19Jul 3, 2019 at 4:31 PM\nHoly mother of God\n\nWork of genius, I was giggling throughout lmao\n\nHelpful | 7", "sikkwidit2008Jul 4, 2019 at 2:36 PM\n\nPlay with them bones bro. I loved this game so much, so hilarious.\n\nHelpful | 2", "illogixJul 4, 2019 at 5:46 AM\nAs good as everyone says!\n\nGreat game, funny dialog, and fun scenes! Hope these guys continue to make VR games!\n\nHelpful | 1", "TheoRXJul 4, 2019 at 9:28 AM\nAmazing Adult Game\n\nLike Rick and Morty? This game is for uou.  from me.\n\nHelpful | 2", "DoctorBZUJul 7, 2019 at 4:18 AM\nHilarious\n\nExcellent fun. Short but excellent and totally hilarious.\n\nHelpful | 0", "colourpixelsJul 4, 2019 at 7:15 AM\nCrazy surreal game\n\nHad me laughing in first few seconds, only short but worth it.\n\nHelpful | 1", "Hotshot80sJul 3, 2019 at 6:46 PM\nOmg this game is sik\n\nJust buy it and enjoy.\nDon't need to review, because it's that awesome.\nGraphics really impressive, smooth textures and great 3d feel.\nAnd the audio work is first class.\n10/10\n\nHelpful | 4", "hankymanJul 9, 2019 at 3:50 AM\nDON'T BUY\n\nThis game is terrible. The only saving grace is that it's over in about 15 minutes.\n\nHelpful | 8", "turtlehead69Jul 11, 2019 at 12:29 AM\nAn experience more than a game\n\nIts fun, funny but very very short. A little too short for the price. Not a patch on Virtual Virtual Reality in my opinion.\n\nHelpful | 0", "betois3Jul 6, 2019 at 8:11 AM\nFun\n\nIt was fun\n\nHelpful | 1", "JohSm67Jul 4, 2019 at 11:49 PM\nSome fun parts!\n\nOk, maybe I don t get it or didnt spend enough time in it! Some parts are fun to listen to but your involvement in the scenes are minimal.\n\nHelpful | 1", "wint3rmuteJul 3, 2019 at 3:04 PM\nGreat Experience\n\nIve played this before so Im rating it on content rather than gameplay on the Quest currently as FaceBook is having a global issue with their download servers and the devs are getting bad reviews based on that.\n\nI hope Oculus will delete the unhelpful reviews once their issues are resolved.\n\nHelpful | 21", "wanderer1972Jul 7, 2019 at 12:13 PM\nThis is rubbish\n\nAm I missing something here? I spent my hard earned cash on this tripe?\n\nHelpful | 7", "TheScootJul 13, 2019 at 11:15 AM\nOffensive\n\nCould be a good game but the amount of swearing was totally unnecessary.\n\nHelpful | 8", "deadryJul 3, 2019 at 6:58 PM\nWhats going on with download?\n\nWhy is it not letting me download?\n\nHelpful | 1", "exjraordinaryJul 7, 2019 at 5:51 PM\nIncredible hilarious\n\nThis is from makers of rick and Morty and has more of that off beat humor. Great vr gameplay inventive and interactive environments the game is somewhat short probably two hours of gameplay but replay in seeing all dialogue and interacting with all elements. I love it I hope Trover and rick and Morty vr also come to quest.\n\nHelpful | 2", "punkgeekJul 3, 2019 at 6:31 PM\nCute but\n\nNot that funny\n\nHelpful | 3", "CaptainElkmanJul 5, 2019 at 1:39 AM\nGreat price for a great game\n\nNow that I was able to install the game I've found myself playing this game 2 times over to see other possibilities. Lots of fun and definitely reccomend playing this game if you havent seen it or played it yet.\n\nHelpful | 8\nDeveloper ResponseJul 5, 2019 at 2:26 AM\n\nThank you for updating the review :)  -Jan", "vgregory6Jul 4, 2019 at 11:20 AM\nAwesome game!\n\nWish I hadn't seen it played mostly theough in YouTube, when it originally came out. The new stuff is great. Cant wait to let my mom play this!\nP.s. that suuuuucks that oculus was down at the time of launch. I really hope that didn't hurt the game. I'd love to see more from you guys.\n\nHelpful | 13\nDeveloper ResponseJul 4, 2019 at 12:54 PM\n\nWe are good :) Thank you for updating the review.  -Jan", "Balisticgaming56Jul 12, 2019 at 11:52 AM\nHaven't played yet\n\nBut Ik its great\n\nHelpful | 0", "toeknee0126Jul 4, 2019 at 6:12 AM\n\nThank you for cross-buy!\n\nHelpful | 1", "BlazingAndrewJul 10, 2019 at 8:26 AM\nTerrible\n\nTheres nothing to this game other than cussing\n\nHelpful | 9", "CooperMan69Jul 5, 2019 at 3:28 AM\nNot Working\n\nAs per other reviews, this item will not download, I have also tried other apps and also same issue\n\nGame is now working, very weird game but so far enjoying it\n\nHelpful | 8", "aalvarez95Jul 3, 2019 at 3:30 PM\nWont download\n\nIt wont let me download it onto my quest\n\nHelpful | 3"]