{"App Title": "Adam Savage's Tested VR", "App description": "Inspired by Adam Savages Tested One Day Builds, Adam Savages Tested VR takes audiences on a journey inside the creative workspaces of incredible makers, bringing their processes to life, from ideation to creation. Featuring an eclectic roster of creators including a Broadway and TV puppeteer and a cosplay animatronic wings designer, Adam and the Tested team put viewers inside their workshops for an intimate look at their builds.\n \nAdam Savages Tested VR features 8 episodes filmed with 180-degree stereoscopic cameras that allow for an immersive look at the creative process like never before. Bonus footage includes Adam's \"Cave\" workshop tours.\n \nMakers include:\n- Adam Savage, Maker/TV Personality\n- Brett Foxwell, Machinist/Stop-Motion Animator\n- Rick Lyon, Puppeteer & Puppet Designer\n- Melissa Ng, Gothic Armor Designer\n- Andrew Freeman, Creature Mask Sculptor\n- Griffon Ramsey, Chainsaw Wood Sculptor\n- Alexis Noriega, Costume Wing Designer\n- Ryan Nagata, Spacesuit Replica Fabricator", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "360 Experience (non-game), Art/Creativity, Educational", "Languages": "English", "Version": "1.1.4", "Developer": "WHALEROCK", "Publisher": "Tested.com", "Website": "https://www.tested.com/", "Release Date": "September 12, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "FacebookTwitterYouTubeRSS\nA FAREWELL TO ARMS / WATCH ADAM DIRECT AND STAR IN A SHORT FILM!\nFACEBOOKTWITTERYOUTUBERSS\nEXPLOREVIDEOSPODCASTFORUMSPREMIUMSHOPSIGN UPLOG IN\nTESTED TERMS OF SERVICE\nLast Modified: January 11, 2016.\n\nThese Terms of Use (Terms) govern your (you or your) use of www.Tested.com website, software, applications, features, or functionality available on the Tested site (collectively, the Site), which is owned and operated by Web Property #5, LLC (Company, we, us, our). If you dont agree with these Terms, please do not use the Site.\n1. User Accounts. You must be over the age of 13 to register with the Site. You also agree to provide true, accurate and complete registration information when you create a user account.\n2. Changes to Terms. We may change the Terms from time to time. The most recent version of the Terms will be posted on the Site and replace any prior versions. Your continued use of the Site following the posting of these changes will constitute acceptance of such changes. We also reserve the right to modify the content or access to any feature of the Site at any time.\n3. Privacy. Your use of the Site is governed by Companys Privacy Policy, which is incorporated herein.\n4. Communication Preferences. If you register with the Site, you consent to receiving service messages relating to your account, such as payment confirmations, account verifications and transactional notices. You also consent to receiving other communications from us such as newsletters, special offers, announcements and surveys, which you may opt out of by clicking on the unsubscribe links contained therein.\n5. Geographic Restrictions. You may not be able to access all or some of the content and services of the Site outside of the United States and such access may not be legal by certain persons or in certain countries. If you access the Site from outside the United States, you are responsible for compliance with local laws. You represent and warrant that (i) you are not located in a country that is subject to a U.S. Government embargo, or that has been designated by the U.S. Government as a terrorist supporting country, and (ii) you are not listed on any U.S. Government watch list of prohibited or restricted parties, including the Specially Designated Nationals list published by the Office of Foreign Assets Control of the U.S. Treasury or the Denied Persons List published by the U.S. Department of Commerce.\n6. Subscription, Free Trial, Billing and Cancellation\nA. Free Access. You may access certain features of the Site free of charge. However, if you do not purchase a subscription, your access to the Site will be limited.\nB. Paid Subscription. You may access the subscription-only features of the Site by signing up for a paid subscription, which may start with a free trial. Only one person may use the user name and password associated with a subscription account. You may be required to provide a current, valid, accepted method of payment (Payment Method) to start your subscription or free trial. All subscriptions are renewed automatically on an annual basis. When we renew your subscription, we will bill your Payment Method for the subscription fee. You may not be notified in advance of each renewal.\nC. Free Trial. From time to time, we may offer free trials of the subscription service for a specified period of time. Company reserves the right, in its sole discretion, to determine your eligibility for a free trial, and to modify or withdraw a free trial at any time without notice or liability. We may require you to provide your Payment Method to start the free trial. On the first day after the free trial ends, we will begin billing your Payment Method for the subscription fee on a recurring basis, every year, unless you cancel prior to the end of the free trial period. However, we may authorize your Payment Method as soon as you register for a free trial. In some instances, your available balance or credit limit may be reduced to reflect the authorization during your free trial period. You may not receive notice from us that your free trial period has ended or that the paying period of your subscription has begun.\nD. Recurring Billing. By subscribing to the Site and providing your Payment Method, you authorize us to bill your Payment Method for the subscription fee at the then current rate, and any other charges you may incur in connection with your use of the Site. You acknowledge that the amount billed each applicable period may vary for reasons including promotional offers, gift card redemptions and adding subscriptions. You authorize us to bill your Payment Method for such varying amounts, which may be billed in one or more charges during the billing cycle.\nE. Billing Cycle. The subscription fee will be billed to your Payment Method at the start of the paying period of your subscription and every year (365 days) thereafter unless you cancel your subscription or we terminate it. You must cancel your subscription before it renews for the next yearly billing cycle in order to avoid payment of the next cycles subscription fee to your Payment Method. Subscription fees are fully earned upon payment. We automatically bill your Payment Method every year. We reserve the right to change the timing of our billing.\nF. Price Changes. We reserve the right to change pricing for subscriptions or any components thereof in any manner and at any time as we may determine in our sole discretion. Subject to these Terms, any price changes will take effect following email notice to you.\nG. No Refunds. PAYMENTS ARE NONREFUNDABLE AND NO REFUNDS OR CREDITS WILL BE GIVEN FOR PARTIAL OR INCOMPLETE USE. We reserve the right, in our sole discretion, to provide refunds, discounts or credits to subscribers on one or more instances without obligation to do so in the future. If any or all of the features of the Site are temporarily unavailable, you will not receive a refund.\nH. Cancellation. You can cancel your subscription at any time by logging into your account, selecting the 'subscription' tab in your profile and clicking the cancel' button.Cancellation will become effective at the end of your current billing period. You will not receive a refund or credit for your current billing period. You may continue to access the subscription-only features of the Site for the remainder of your current billing period.\n7. Third Party Materials. The Site may display, include or make available third-party content (including data, information, applications and other products services and/or materials) or provide links to third-party websites or services, including through third-party advertising (Third Party Materials). You acknowledge and agree that Company is not responsible for Third Party Materials, including their accuracy, completeness, timeliness, validity, copyright or trademark compliance, legality, decency, quality or any other aspect thereof. Company does not assume and will not have any liability or responsibility to you or any other person or entity for any Third Party Materials. Third Party Materials and links thereto are provided solely as a convenience to you and you access and use them at entirely at your own risk and subject to such third parties terms and conditions. Once you choose to link to another site, you should read and understand that sites privacy statement before disclosing any personal information.\n8. Your Use of the Site. All of our content available through the Site is owned by or licensed to us or our partners and/or users and is protected by copyright and/or trademark laws. You do not acquire ownership rights to any content viewed through the Site. Our posting of content on the Site does not constitute a waiver of any right in such content. You may not use, store, display, publish, transmit, distribute, modify, reproduce, create derivative works of or in any way exploit any of this content (other than your own content), in whole or in part, outside of the specific usage rights granted to you by Company in connection with this Site. All other copying in any format or other unauthorized use of the Site or its contents may constitute a breach of copyright, trademark and/or other intellectual property laws and/or other international laws and may subject you to criminal or civil charges and penalties. Company reserves all other rights not expressly granted hereunder. In no event may the Site be used in a manner that (a) harasses, abuses, threatens, defames or otherwise infringes or violates the rights of others; (b) is unlawful, fraudulent or deceptive; (c) uses technology or other means to access Companys proprietary information that is not authorized by Company; (d) uses or launches any automated system to access Companys website or computer systems; (e) attempts to introduce viruses, trojans, worms, malware, or any other malicious computer code that interrupts, destroys or limits the functionality of any computer software, hardware or telecommunications equipment; (f) attempts to gain unauthorized access to Companys computer network or user accounts; (g) encourages conduct that would constitute a criminal offense, or would give rise to civil liability; or, (h) violates these Terms. Company reserves the right, in its sole discretion, to terminate your user account.\n9. Information and Press Releases. The Site contains information and press releases in connection with its content. While this information was believed to be accurate as of the date prepared, Company disclaims any duty or obligation to update this information or any press releases. Information about companies other than ours contained in the press release or otherwise, should not be relied upon as being provided or endorsed by us.\n10. Content Posted on the Site. The Site may contain social networking components and interactive features (including but not limited to blogs, chat groups, bulletin boards, news groups, as well as, the display of content from linked third-party websites, which may allow you to submit, transmit or post information, including but not limited to audio recordings, video recordings, writings, and/or images.Company may monitor content posted on the Site, but Company is under no obligation to do so. You may be exposed to content on the Site that is inaccurate or deceptive, or that you find offensive or objectionable.\n11. Content You Post.\nA. Content you post via the Site may appear on other users devices. You are responsible for all content that you post through or download from the Site. You may not post content that:\nIs not your own original creation or that you do not have permission to use (keep in mind that just because something on the internet does not have a copyright notice on it doesnt mean you can use it without permission);\nInfringes the copyright, trademark, patent right, or other proprietary right of any person or that is used without the permission of the owner;\nYou know to be inaccurate;\nIs pornographic, sexually explicit, or obscene;\nExploits children or minors;\nViolates the rights of privacy or publicity of any person;\nIs harassing, libelous, slanderous, or defamatory;\nContains any personally identifying information about any person without their consent or about any person who is a minor;\nMay be deemed generally offensive to the community, including blatant expressions of bigotry, prejudice, racism, hatred, profanity or religious or political radicalism;\nIncludes advertisements, promotions, solicitations, spam, or offers to sell any goods or services for any commercial purpose;\nIs off topic;\nIs intended to provide professional advice, including but not limited to, the provision of medical treatment, or legal, financial or investment advice;\nIs intended to solicit, recommend, endorse, or offer to buy or sell any securities or other financial instruments, tout stocks, or recommend that any particular security, portfolio of securities, transaction, or investment strategy is suitable for you or any specific person;\nViolates any local, state, federal, and/or international laws or regulations;\nPromotes or provides instructional information about illegal or illicit activities;\nContains software viruses or any other computer code, files, or programs designed to destroy, interrupt, or otherwise limit the functionality of any computer software, computer hardware, or other equipment; or,\nIs intended to overwhelm, cause technical disruptions of or denial of service to Companys servers.\nA. Company may remove any content that violates these Terms or that Company determines is otherwise not appropriate in Companys sole discretion. Company may or may not exercise editorial control over content posted on the Site.\nB. By posting or transmitting content on or through the Site, you\nrepresent and warrant that you are the creator and owner of, or have the necessary licenses, rights, consents, and permissions to use and to authorize Company and other users to use and distribute your content as necessary to exercise the licenses granted by you in these Terms and in the manner contemplated by Company and these Terms;\nyou certify that you are (a) at least 18 years old, or (b) at least 13 years old and have obtained your parents or legal guardians express consent to submit content;\nagree to and do hereby grant Company and its affiliates and partners a nonexclusive, perpetual, irrevocable, worldwide, sublicensable, transferrable, royalty-free right and license to use, store, display, publish, transmit, transfer, distribute, reproduce, rearrange, edit, modify, aggregate, create derivative works of and publicly perform the content that you submit via the Site for any purpose, in any form, medium, or technology now known or later developed. You also acknowledge that (i) Company may have already created, or be in the process of creating, content that may be substantially similar to your ideas at the time you submit those ideas to us, and (ii) elements of your ideas may not be subject to protection under copyright laws. You also grant Company a license to use your user name in connection with Companys use of any content you provide to Company. You also consent to the display of advertising within or adjacent to any of your content. Any comments or materials you send to Company, including feedback data, such as questions, comments, suggestions and any other response shall be deemed to be nonconfidential.\n12. Limitation of Liability. TO THE FULLEST EXTENT ALLOWABLE UNDER APPLICABLE LAW, (A) IN NO EVENT SHALL COMPANY BE LIABLE TO YOU WITH RESPECT TO (1) USE OF THE SITE, CONTENT OR SERVICES OR (2) DIRECT DAMAGES IN AMOUNTS THAT IN THE AGGREGATE EXCEED THE GREATER OF THE AMOUNT ACTUALLY PAID BY YOU, IF ANY, FOR THE SUBSCRIPTION SERVICES OR US$100.00, AND (B) IN NO EVENT SHALL COMPANY BE LIABLE TO YOU FOR ANY INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF OR IN ANY WAY RELATING TO THESE TERMS OR THE USE OF OR INABILITY TO USE THE SITE, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOST PROFITS, LOSS OR CORRUPTION OF DATA, BREACH OF PRIVACY OR SECURITY, TRANSMISSION OF PERSONAL DATA OR FAILURE OR MALFUNCTION OF YOUR DEVICE. YOUR SOLE REMEDY UNDER THESE TERMS IS TO CEASE USE OF THE SITE.\n13. Warranty Disclaimer. EXCEPT AS EXPRESSLY SET FORTH IN THESE TERMS, COMPANY DOES NOT MAKE AND COMPANY HEREBY EXPRESSLY DISCLAIMS ALL WARRANTIES AND REPRESENTATIONS WITH RESPECT TO THE SITE, CONTENT, AND SERVICES PROVIDED HEREUNDER OR OTHERWISE REGARDING THESE TERMS, WHETHER ORAL OR WRITTEN, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, TITLE, NON-INFRINGEMENT, FREEDOM FROM COMPUTER VIRUSES OR MALWARE, AND WARRANTIES ARISING FROM COURSE OF DEALING, COURSE OF PERFORMANCE OR USAGE OF TRADE. COMPANY IS NOT RESPONSIBLE FOR THE ACTIONS OR INFORMATION OF THIRD PARTIES, AND YOU RELEASE COMPANY FROM ANY CLAIMS AND DAMAGES, KNOWN AND UNKNOWN, ARISING OUT OF OR IN ANY WAY CONNECTED WITH ANY CLAIM YOU HAVE AGAINST ANY SUCH THIRD PARTIES. SOME STATES AND COUNTRIES, INCLUDING MEMBER COUNTRIES OF THE EUROPEAN ECONOMIC AREA, DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO SOME OR ALL OF THE LIMITATIONS OR EXCLUSIONS ABOVE MAY NOT APPLY TO YOU. IF YOU ARE A CALIFORNIA RESIDENT, YOU WAIVE CALIFORNIA CIVIL CODE 1542, WHICH SAYS: A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS OR HER FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM OR HER MUST HAVE MATERIALLY AFFECTED HIS OR HER SETTLEMENT WITH THE DEBTOR.\n14. Limitation of Time to File Claims. ANY CAUSE OF ACTION OR CLAIM YOU MAY HAVE ARISING OUT OF OR RELATING TO THESE TERMS OR SITE MUST BE COMMENCED WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES, OTHERWISE, SUCH CAUSE OF ACTION OR CLAIM IS PERMANENTLY BARRED.\n15. Indemnification. You agree to defend, indemnify, and hold harmless Company and its employees, contractors, officers, directors and successors from any and all claims, suits, damages, costs, lawsuits, fines, penalties, liabilities, expenses (including attorneys fees and costs) that arise from your use or misuse of the Site, violation of these Terms or violation of any rights (including, but not limited to intellectual property rights, right of privacy, right of publicity, etc.) of a third party. Company reserves the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by you, in which event you will cooperate at your own expense in asserting any available defenses. The indemnification in this section extends to any allegations of copyright infringement, violation of the Digital Millennium Copyright Act or other law based on your importation, exportation, manipulation, modification, distribution, sale or other use of text, still images, or audio or video recordings.\n16. Contact Information. Should you wish to contact Company with any questions, complaints or claims with respect to the Site, email Company at privacy@tested.com.\n17. Third Party Agreements And Additional Terms. You agree to comply with all applicable third party terms of agreement when using the Site. There may be additional terms and conditions that apply to portions of the Site and to any purchases on the Site or services, including, without limitation, invitations, sweepstakes, contests and the like. All such additional terms and conditions shall be a part of these Terms and are incorporated by reference herein and you agree to be bound by such additional provisions. In the event of a conflict between these Terms and any additional terms and conditions applicable to any portion or offering on the Site, such additional terms and conditions with respect to that portion or offering shall control.\n18. Governing Law. These Terms are governed exclusively by the laws of the State of California, without giving effect to its conflict of law rules. These Terms are not governed by the United Nations Convention of Contracts for the International Sale of Goods, the application of which is expressly excluded. The parties further agree that the place of contract and performance of these Terms is Los Angeles, California, USA.\n19. Waiver/Severability. The failure of Company to exercise or enforce any right or provision of these Terms shall not constitute a waiver of such right or provision. If any provision of these Terms is for any reason held unenforceable or invalid, then these Terms shall be construed as if such provision were not contained in these Terms.\n20. Arbitration. Any dispute, claim or controversy arising out of or related to these Terms or the breach, termination, enforcement, interpretation or validity thereof, including the determination of the scope or applicability of this agreement to arbitrate, shall be resolved by binding non-appearance-based arbitration. Either party shall initiate arbitration before a single arbitrator through an established alternative dispute resolution (ADR) provider mutually agreed upon by the parties, or, if no agreement is reached within ten (10) days of a request for agreement, then according to the rules (Rules) of the American Arbitration Association. The ADR provider and the parties must comply with the following rules: (a) the arbitration shall be conducted by telephone, online and/or be solely based on written submissions, the specific manner shall be chosen by the party initiating the arbitration; (b) the arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise mutually agreed by the parties; and (c) any judgment on the award rendered by the arbitrator shall be final and may be entered in any court of competent jurisdiction. All aspects of the arbitration shall be treated as confidential, as provided in the Rules. Before making any disclosure permitted by the Rules, a party shall give written notice to the other party and afford such party a reasonable opportunity to protect its interests. You agree that the Federal Arbitration Act governs the interpretation and enforcement of this provision, and that you and Company are each waiving the right to a trial by jury and the right to participate in a class or representative action. YOU AND COMPANY AGREE THAT EACH MAY BRING CLAIMS ONLY IN YOUR OR ITS INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING. Further, the arbitrator may not consolidate more than one persons claims with your or Companys claims, and may not otherwise preside over any form of a class or representative proceeding.\n21. Entire Agreement; Modifications. These Terms comprise the entire agreement between you and Company, and supersede any other agreement or discussion, oral or written, with respect to the subject matter of these Terms, and may not be changed except by a written agreement signed in hardcopy form by both parties. There shall be no application of any rule of construction against the drafter as you have had an opportunity to have these Terms reviewed by your counsel.\n\n Web Property #5, LLC. All rights reserved. Tested and Tested.com are trademarks of Web Property #5, LLC\n\nTHE ESSENTIALS\nBEST OFMOST VIEWED\nAdam Savage's One Day Builds: No-Face...\nAdam Savage's One Day Builds: Workshop...\nAdam Savage's One Day Builds: Custom Beat...\nAdam Savage's One Day Builds: Snub-Nosed...\nAdam Savage's One Day Builds: Space Camera...\nAdam Savage's New Warcraft Armor!\nAdam Savage Tours North Bergen High...\nTested at the NASA InSight Rocket Launch...\nGallery: The Last Knight Exhibit at The MET\nAdam Savage Repairs Totoro Costume!\nHands-On: Haptic Gloves to Control a...\nComic-Con 2015\nTested Presents The Rancor Project!\nHands-On: Oculus Rift CV1 + Oculus Touch...\nTested Meets the New BattleBots!\nAnimating Robocop 2's Cain Robot with Phil...\nHow to Build a FPV Racing Quadcopter!\nAdam Savage's Hellboy Mecha-Glove Replica\nAdam Incognito at Comic-Con 2014: Alien...\nChris Hadfield and Chef Traci Des Jardins Make...\nThe Comic-Con 2014 Cosplay Gallery (750+...\nJamie's Racing Spiders, Episode 1: The Pitch\nOne Day Builds: Han Solo's DL-44 Blaster...\nHow To Build a Life-Size Dragon\nJamie Hyneman Tests the Oculus Rift Virtual...\nHow To Make a Giant Papercraft Head for...\nThe George Lucas Super Live Adventure\nInside Adam Savage's Cave: Adam's Blade...\nOne Day Builds: Adam Savage's Traveling...\nCooking Perfect Omelettes with Adam...\nAstronaut Chris Hadfield Tastes Our Gourmet Space Food!\nOur Privacy / Cookie Policy contains detailed information about the types of cookies & related technology on our site, and some ways to opt out. By using the site, you agree to the uses of cookies and other technology as outlined in our Policy, and to our Terms of Use\n\nClose\n\nVIDEOSPODCASTFORUMSABOUTCONTACT SUPPORT\nMost Popular\nAn Announcement Regarding Tested Premium Membership!\nRemembering Grant - Still Untitled: The Adam Savage Project - 7/14/20\nAdam Savage's One Day Builds: Refridgerated Cooling Suit!\nAdam's Finger Accident - Still Untitled: The Adam Savage Project - 3/31/20\nAdam Savage's One Day Builds: Gaslamp Lantern Prop!\nMost Recent\nAdam Savage's Miniature Model from A.I. Artificial Intelligence!\nScale Model Miniatures from Star Wars, Alien, and Star Trek!\nOriginal Costumes for Rocketeer, Pacific Rim, and V for Vendetta!\nAdam Savage's One Day Builds: Letter Stamp Holder!\nStop-Motion Puppets from Star Wars, RoboCop, and Jurassic Park!\nFollow Tested\nFind us on Google+\nUser AgreementMedia InquiriesPrivacy PolicyNotice of Collection", "Space Required": "969.4 MB"}



["5 stars\n57%\n4 stars\n11%\n3 stars\n9%\n2 stars\n8%\n1 star\n15%", "sicvr11 days ago\nStupid if you think it's a game\n\nSo many bad or low star reviews claim it's a bad he for not being interactive, I don't know how low intelligence you have to have to think it's a game when no where in the description says game. They clearly state you WATCH DIFFERENT craftsmen craft. Great videos great idea. Hope they can add more. Only down side for me I guess is that eqch episode is a separate download. 5 stars all they way because I never was stupid enough to think it's an interactive game.\n\nHelpful | 10", "Puddin101bushJun 22 at 7:17 AM\nGood game but not what people want \n\nI saw this game and wanted to be able to build cool projects this er inside of VR and use them but insted what I got was a lame non interactive he where all I do is watch people build if u want to make a he dont make is LAME make it interactive and actually fun that is what people want so because this game is not interactive and I can not build stuff only watch stuff 1 STAR ONLY AND ONLY 1 STAR!?!?!?!\n\nHelpful | 15", "661c.sanabria8 days ago\nAdam is there but\n\nAdam is there but for one video. He is the master and we want the master to make the videos. So if that happens my 4 star will go to 5. A good idea I have is be able to switch between camera angles like close ups. I think people will pay per season, I would. Now dont make it to expensive though \n\nFor the low IQ people that dont get it, THIS IS NOT A GAME, IT NEVER WAS MEANT TO, OR DOES IT STATE ITS A GAME. GOT IT DING DONGS?\n\nHelpful | 4", "BertHalfpintFeb 21 at 1:51 AM\nTime for some new content?\n\n\nI think this is fundamentally a different experience from watching traditional video ,as I guess the field of view and \" depth\" perception of VR is far more immersive ? I see myself here as an audience member in a TV studio rather than just sat on my sofa with my TV 15 feet away.\n\nThe clarity of each experience is superb and the feeling of being in the room is quite compelling. I think \" passive\" VR is just as acceptable as full on \" rapid teleporting mass combat\" . I personally can not find the stamina to run around dead-heading zombies 24/7 ( fun as this is ).\n\nThis is quite different from watching traditional TV , yes / no?\n\nI do agree that the current crop of videos could have been experienced in YouTube VR if the video quality was obtainable there?\nMy only reason for dropping a  is the wait for new content. I guess I believed it would be like a TV show with new episodes uploaded regularly. Or ..... is this it ? Then\nmaybe have to drop more s ?\n\nPerhaps other developers or TV studios will pick up from here and create a true VR show.\n\nThis is very good as a concept and the host presenter in the workshop is a delight and each video segment is delivered with care, attention to detail and good humour .\n\nAnd..... I have to have me a full set of Demon Wings .\n\n\n\nHelpful | 36", "mamolsJun 17 at 11:31 PM\n\nThis is my favorite game\n\nHelpful | 5", "dxs819Apr 4 at 10:22 AM\nWhy\n\nI guess the concept is cool, but I really wanted to interact with more stuff. They couldnt have added the things he made and let you mess with stuff? Wish it was more like a game or at least close.\n\nHelpful | 16", "LesterFreamon11 days ago\nJust stick these videos on YouTube\n\nThis is nothing more than 8 videos promoting the show. I appreciate that its there, and its free, but, its lame that the Oculus Quest store has so few titles, rejects developer content on the reg, but will feature something like this Adam savage app in their store.\n\nTo Oculus Quest: An experience is not downloading an app to watch branded promo videos.\n\nHelpful | 0", "Djtiny_beepiJan 19 at 6:17 PM\nCool idea but....\n\nThe lobby is cool and I like the card board art style but the videos are too long and boring. It would be cool if you unlocked the thing your video was about of if you could make the lobby customizable or at least move around. Maybe add more things to do in the lobby because thats like the only fun part. Soo yeah. Add that to your list of things to add developers.\n\nHelpful | 92", "Bam_Bam12345Mar 14 at 10:02 PM\nIt was so-so\n\nAn idea I have that yall might find interesting, is when you watch an episode, you get to mess around with the thing that Mr. Savage built. I personally think that would be awesome.\n\nHelpful | 8", "BenjiTEMJul 26 at 11:45 AM\nEhh\n\nAt first its cool[ish] but when I saw the trailer I thought I would I would makes stuff but I came to a, horrible realization that its just a video player. Later I thought Adam was showing me what to do, so I patiently waited for Adam to build a quiver for a sword. After it was over I spent like 3 minutes trying to find the way to build stuff but I never found anything.\n\nHelpful | 0", "Lilith_AstraeaJan 24 at 4:33 PM\nI really want to watch these\n\nI'm not sure if it's the static perspective or frame rate related (there was a weird flicker that felt like it was low fps) but this made me nauseous when nothing else I've played has managed to. That surprises me since it's video (the menu/lobby was perfectly fine). Barely 3 minutes after starting the first actual episode I had to pull the headset off and I'm still not feeling too well 20 minutes later. I'm still hoping they can update this and make the experience smoother/more comfortable.\n\nHelpful | 7", "Fallibleegg4397Mar 31 at 7:50 PM\nPlease add functionality/use\n\nLook I see this looks cool and it is as an idea, but please add some functionality or interaction to this app I see its potential and IT IS BIG!!! Here are some ideas\n\n\nLet us build the things\n\nLet us interact with things\nEtc\n\nHelpful | 4", "Applebottom569 days ago\nNot a game\n\nThis is for entertainment purposes only. Sometimes it's ok to view what others are doing. He never stated it is a game.\n\nHelpful | 0", "peter1014Apr 23 at 12:24 PM\nthe screen is not quite well defined\n\nthe screen is not quite well defined and low quality. I felt dizzy and unplayable so I stopped playing before even doing much. No not worth the time even if it is free.\n\nHelpful | 2", "tanner.vegetaMay 6 at 7:04 AM\nNo english Subtitle.\n\nThere is no English subtitle.\n\nHelpful | 2", "fire828cooldj12 days ago\nIts idk\n\nI Thot You Can Make Stuff but no dont get this Its a waste of storage space and a waste of time\n\nHelpful | 0", "Magic8Ball1089Mar 31 at 12:42 AM\nBoring\n\nThis is not what I was expecting\n\nHelpful | 3", "LQbanoMay 10 at 4:39 PM\nPointless\n\nIs just a video player for around 8 videos.\n\nHelpful | 1", "Widerneptune7Feb 28 at 6:26 AM\nWas not what I was expecting\n\nNow I was expecting you watch a video then you get to use the thing he created but still is pretty cool\n\nHelpful | 3", "maryjboyd46Feb 14 at 7:40 PM\nGood\n\nGood\n\nHelpful | 7", "jaden521Feb 11 at 6:25 PM\nNo\n\nI think it was a good idea but I wish that you could use the items in VR\n\nHelpful | 4", "pixxelpusherOct 28 at 3:15 AM\nGreat, but something is odd...\n\nI love watching these and the quality of the clips is excellent. However, about 5mins into watching one of the segments the 3D makes my eyes start to go funny. Sort of like I can't focus anymore or I'm going a bit cross-eyed. It also does it if I look around the room at objects in the corners of the clips. I basically have to take off the Quest and have a break for my eyes to feel normal again, and then continue. Not sure what's doing this or if others have experienced it.\n\nHelpful | 20", "Doo_Doo_FartJan 23 at 7:43 PM\n\nIf you start the download you can't cancel\n\nHelpful | 8", "i8cookieOct 24 at 6:15 AM\nGreat dip into Adams world\n\nI've been following tested for a while and i love that they're always trying me things and this is a great first foray into vr for them!\n\nI love the hub, great to see a cardboard represention of adams shop and fun to play with the bits and bobs there. Although disappointing i couldn't move far from the table, dying to look around properly. Wish there were more things to play with and more easter eggs.\n\nThe content itself is also great, the static 180 video i think it's a good choice. One thing i thought when i first started watching is although I'm interested in what Adam is talking about, this experience feels like I'm actually in his shop, i was desperate to get a tour as though i was a guest there, to get shown all the tools and other nick nacks i can see around me. I found myself just looking around at all the fun stuff rather than listening what he's actually taking about.\n\nAnother thing is having to download the videos rather than being able to stream them. I realise this is a technical thing and the videos are huge but it feels like a step back the age of streaming. Great stuff though can't wait for more!!\n\nHelpful | 4", "DK_VRSep 12, 2019 at 9:44 AM\nA fantastic experience for everyone\n\nI love Tested and I've loved Adam Savage since the Mythbuster days. This app is fantastic. The presentation is excellent and the video quality is some of the best 3d Stereo out right now. Period. I've always wanted to see Adam's shop in VR. I was just talking to someone about watching an Untitled podcast episode or a one day buil in VR and this comes out of nowhere. It's above and beyond what I wanted. There's so much to see. His shop is the perfect place for 3D video. There's so much to see and so many layers to his stuff that it gives off some of the best depth and I swear my eyes were playing tricks. I could sense the parallax in some shots.\n\nThe video files are really large, however, they download in a few minutes. It's all very impressive.\n\nThis should be in everyone's library even if you don't know what tested is. This is a glimpse into the future of how we can get involved in our favorite creator's lives. We can be there with them, work along side them. It's an intimacy like never before. It's exciting stuff.\n\nHelpful | 131", "blake.leonard.1675Jan 21 at 6:44 PM\nNot good\n\nBad\n\nHelpful | 6", "agitokazuDec 12 at 5:48 PM\nEh not worth the install space\n\nCould just watch it on YouTube instead\n\nHelpful | 16", "mygo73Sep 12, 2019 at 10:50 AM\nPerfect for people who want to learb\n\nIve always wanted to learn to make cool things, and part of that process is just watching other people tinker and make things. This app is PERFECT for someone who doesnt have the time to or maybe all the resources to make what they want, but it shows you how simply things can be made if hog just brake is down into its components. Adam Savage does a great job explaining what hes doing step by step and its so engaging to watch him build. Even though its a video I found myself moving around to try and get closer, move around the shop, etc... its super immersive and I cannot wait to see more content like this. Also love the main menu design, its like Honey I Shrunk the Kids! Thank you Adam! Mygo73@gmail.com\n\nHelpful | 23", "starship42Nov 10 at 12:52 PM\nVisually disappointing, but interesting.\n\nI have to confess I was a little underwhelmed and disappointed by the \"VR\" in this title which otherwise was interesting subject matter I'm sure for many. The VR pov for the observer is stationary, so if you try to look down or side to side the entire picture and everything in it shifts with you in each of the individual episodes. So you have to keep your head still and just watch as if you are watching in 2D. There was alot of wide angle distortion as well if you didn't look straight ahead, which in my view defeated the purpose of recording in a real workshop that you really couldn't look around in. The content was informative. The video format used not enjoyable imo.\n\nHelpful | 1", "HezzruNov 7 at 9:50 PM\nBoring and poor tracking\n\nApp has like eight 15-minute long videos. Kinda makes you sick watching them though. I hate how there isnt full 6 degree of freedom tracking. It makes it very unnerving. These should have just been 360 videos on YouTube.\n\nHelpful | 9", "Przemo-cOct 29 at 12:44 AM\nVery well done.\n\nSubject matter wasn't always that interesting to me but the variety of topics piqued my interest on couple things.\n\nQuality is pretty great. Apart from nearly poking my eye out with that sword ;] lighting, variety of the set, the closeups where pretty nice but I wish were 3d but i understand the choice made.\n\nThe only thing i will complain is the framerate. For far away stuff 30fps is ok-ish. But for close up stuff it's simply too low. I know now the cameras could handle more which was discussed in VR version of the podcast.\n\nOne more thing if possible it would be nice to have 180 video up front and static backdrop at the back so it wouldn't fade to black on the edges.\n\nI really hope more content will be made to that level of quality and from Tested.\n\nHelpful | 8", "napobonaDec 25 at 2:45 PM\nFeels like you are in the shop...\n\n... with Adam. Fantastic idea and lovely app.\n\nHelpful | 0", "JoeyZoeyNov 2 at 1:14 PM\nNice 3D Lobby, but the videos are awful\n\nNice 3D Lobby and idea, but the videos are awful, in that way that you can not move an inch before it gets sickening as you cant move around in the scene. The video/scene stays still while you move, and that is not good for inner ear balance/nausea. Unfortunately.\n\nHelpful | 5", "RagingCookie43Dec 25 at 1:19 AM\nJust wow\n\nWow\n\nHelpful | 0", "weirdmonkey2807Sep 16, 2019 at 9:46 PM\nReally love the idea and content\n\nThe issue with the videos is that they are technically flawed and presented at a very low frame rate. There is also quite a lot of stereoscopic misalignment which over a longer period of time is quite difficult to watch. Given the scope of this production I do not understand why this wasnt fixed in post before release. Dont look up, down, left or right, or it will break the illusion (180 only) and cause a headache. This is best enjoyed by sitting back in a chair and just looking straight which makes the whole experience just a slight bit better than watching a regular video but with a lot of weight attached to your head. I watched the first episode and my neck was already starting to hurt pretty badly. I dont think the hardware is ready yet for these longer videos to be consumed - at least not yet. Overall given that its free, its a no brainer!\n\nHelpful | 6", "TheMightyJYSep 13, 2019 at 10:53 AM\nGreat collection of 180VR content\n\nI really like Tested's video content and being able to watch builds in VR was a very cool experience. Not only do you get an episode in Adam Savage's \"cave\", they explore the spaces of many other makers. The two I've seen so far have been fantastic.\n\nI really like the zoomed in close ups they overlayed onto the VR footage in Adam's build. That would be something I'd like to see more of, and maybe down the road the ability to toggle a close up cam on and off while watching. Very cool stuff and worth the download.\n\nHelpful | 7", "tofuninja5489Sep 14, 2019 at 10:26 PM\nCompletely thought out VR content\n\nAlthough I haven't gotten to finish all the videos, I've been having a great time watching AND learning from all the various makers the Tested team has brought in. It's not just a half baked 180 video, the creators of this content have thought of everything to make the videos so much more engaging to learn. For instance, there's a lot of 'picture in picture' style pop up videos that get close up when a vr camera would not work. Or during Lumecluster's segment where they project the 3D model of the armor on the screen IN 3D as the person wearing said armor is walking around. That's something you can't do in any other medium right now and the fact that they have implemented it so well makes this a great watching experience. If you love watching makers make, this is your current deep dive into that world in VR\n\nHelpful | 6", "evandaganSep 22, 2019 at 8:36 PM\n3D video, but that's it.\n\nThis is not really VR - it's essentially a short 3D film series, best appreciated looking straight ahead. If you move side to side or even look around, the 3D effect \"breaks\" and it's really disorienting. I realize it's really difficult to record 360 video in 3D, and it shows - this is essentially a 3D video that tries to fake immersion..... No comment on the content, as I couldn't watch it long enough to judge.\n\nHelpful | 8", "nastypigOct 9 at 7:09 PM\nAnnoying\n\nI keep coming back to this app, and constantly annoyed that I have to keep downloading each episode again, and again and they take ages.\nfor some in godly reason the episodes don't get saved.\n\nHelpful | 4", "ScoutNov 12 at 11:04 AM\nReally clever\n\nThe presentation here is just fantastic. Its a great show and a wonderful use of the medium.\n\nHelpful | 1", "Pixel3DSep 13, 2019 at 5:49 PM\nThis feels so 2013 VR era\n\n2 stars for the effort. 180 3D videos are not immersive, and everything that's white flickers a lot due to 60hz. Was it really so difficult to upscale them to 72 fps?\n\nHelpful | 12", "PinkGreaseSep 17, 2019 at 11:22 AM\nJust one word STEREOSCOPIC!!!\n\nSo I am only mildly interested in the maker movent Tested is in the forefront of, but when I saw what kind of rig they had to shoot these film sequences I'm jumping for joy. It's not that crappy 360 camera everyone associates VR movies with now, but stereoscopic dual camera, that makes it feel like you're there. About time, it's the first time I've seen it in an app, essentially 3d Avatar style done right. YouTube, Melody, Samsung VR, take note, this is the future, if you can overcome the filesizes.\n\nHelpful | 5", "Dragonbreath271Sep 11, 2019 at 8:40 PM\nEpic\n\nThis game is really fun especially if you like the show\n\nHelpful | 17", "SirRealDealSep 13, 2019 at 7:12 AM\nSo Good I Would've Paid For It.\n\nVisually? The best 3D 180 video on Quest I've ever seen.\n\nContent? Read the app description above. If you're into this kinda stuff you'll be more than satisfied.\n\nThanks much for this awesome freebie, developers & Mr. Savage. Loaded with excellent content.\n\nHelpful | 7", "PBJ6357Sep 17, 2019 at 3:45 PM\nNot 360\n\nJust watch off your phone it's just 180\n\nHelpful | 5", "DAX_QcSep 14, 2019 at 8:28 AM\nVr menu + 180 videos thats it\n\nIts a youtube channel with a vr menu thats it.\n\nHelpful | 13", "BakedMinotaur29Sep 13, 2019 at 5:15 PM\nA masterpiece of makers\n\nAs someone who truly enjoys watching adam and his crew make things on tested, I found this to be really immersive and wonderful to play\n\nHelpful | 6", "bruceo2Oct 5 at 9:39 PM\nOutstanding\n\nJust great work and quality and looking forward to more content\n\nHelpful | 1", "sebrkSep 14, 2019 at 1:12 AM\nMesmerizing experience\n\nBeing there watching these amazing artists work is just mesmerizing. What a time to be alive.\n\nHelpful | 2", "SMODomiteSep 12, 2019 at 3:45 PM\nLoving it\n\nAlways loved watching Adam savages and r Ally cool to check out his studio, gunna learn more about some cool things watching this\n\nHelpful | 6", "EngelisterSep 15, 2019 at 7:07 AM\nVery good. But...\n\n...it's 180 videos. Not 360. Very sad. Still good and entertaining. More Videos with Adam please.\n\nHelpful | 4", "Coconut4MeSep 14, 2019 at 9:25 PM\nAmazing!\n\nMeet Adam in 3D! If you like to build things or create , then this is for you! Learn and discover! Great for anyone!\n\nHelpful | 3", "acedanger74Sep 16, 2019 at 12:01 PM\nLove tested but\n\nThis felt kinda cheap & flat.\n\nHelpful | 5", "CasualCheetahSep 12, 2019 at 5:23 PM\nSimple and entertaining\n\nJust a hub for a few videos 3D videos from Tested. Great if your a maker or fan of the show.\n\nHelpful | 6", "GuentherTheGeekOct 16 at 7:42 PM\nFrame rate is bad\n\nWait till they fix the frame rate problem\n\nHelpful | 0", "dillpickleJSep 11, 2019 at 8:56 PM\nAmazing\n\nPretty some for a learning app!\n\nHelpful | 7", "StrictAphid4882Sep 13, 2019 at 7:30 AM\nAmazing\n\nGreat experience\n\nHelpful | 3", "ItalianGuy81Sep 16, 2019 at 6:16 PM\nSuper cool!\n\nAwesome experience!\n\nHelpful | 1", "psingh01Sep 18, 2019 at 1:31 AM\nAbc\n\nAbcdefg\n\nHelpful | 12", "Okami_Es7Sep 12, 2019 at 9:19 AM\nWont work in Aus? 5 stars cause cool tho\n\nAllowed me to \"purchase\" download i assume anyway, but will not show up in my Oculus list and going back to oculus website says purchased but wont let me play\nEither does not work outside the US much like it would not let me stream the first episode of the new show or it is simply not working on the Rift S? - Why do you hate me :)\n\nHelpful | 2\nDeveloper ResponseSep 15, 2019 at 10:56 AM\n\nTested VR is currently only available for Oculus Go and Quest. We hope to expand support in the future!"]