{"App Title": "AFFECTED: The Manor", "App description": "The most popular haunted house in VR is now available on Quest!\n\nBE WARNED: This is not a game...but if you love to scare yourself witless, or just enjoy watching your friends and family freak out in VR, AFFECTED: The Manor is for you! With simple controls and no puzzles to solve or keys to find in order to progress, The Manor holds nothing but scares and screams for both experienced gamers and newcomers alike.\n\nBuilt from the ground up for Quest, we've added a new terrifying layer of immersion by allowing interactions with some of the environment in AFFECTED: The Manor for the very first time. Weve made sure we maintained the trademark length of the experience, so each route can be tackled in around 20 minutes by anyone brave enough to make it all the way, plenty of Nopers out there are still yet to reach the end at alllet alone make it in one go! \n\nWith a choice of 2 routes and alternate endings, theres reasons to return to The Manor...if youre a sucker for punishment of course.", "Purchase section": "$9.99Add to WishlistShareComfort: IntenseSupports QuestSupports Oculus TouchSupports Touch (as Gamepad)Internet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing", "Supported Controllers": "Oculus Touch, Touch (as Gamepad)", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Casual, Exploration, Horror", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Venezuela)", "Version + Release Notes": "1.24", "Developer": "Fallen Planet Studios", "Publisher": "Fallen Planet Studios", "Website": "https://www.fallenplanetstudios.com/", "Release Date": "December 12, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Home\nAbout\nPartners\nNews\nGames\nAFFECTED: The Manor\nInstallations\nSimulators\nTheme Parks\nContact\nArcades\n[us_page_title description=1 align=center]\nHomeTerms of Service\n\nFallen Planet Studios Terms of Service and Privacy Policy\n\n1. Terms\n\nBy accessing the web site at http://www.fallenplanetstuidos.com, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this web site are protected by applicable copyright and trademark law.\n\n2. Use License\n\nPermission is granted to temporarily download one copy of the materials (information or software) on Fallen Planet Studioss web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\nmodify or copy the materials;\nuse the materials for any commercial purpose, or for any public display (commercial or non-commercial);\nattempt to decompile or reverse engineer any software contained on Fallen Planet Studioss web site;\nremove any copyright or other proprietary notations from the materials; or\ntransfer the materials to another person or mirror the materials on any other server.\n\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by Fallen Planet Studios at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n\n3. Disclaimer\nThe materials on Fallen Planet Studioss web site are provided as is. Fallen Planet Studios makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, Fallen Planet Studios does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site.\n\n4. Limitations\n\nIn no event shall Fallen Planet Studios or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on Fallen Planet Studioss Internet site, even if Fallen Planet Studios or a Fallen Planet Studios authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\n\nThe materials appearing on Fallen Planet Studioss web site could include technical, typographical, or photographic errors. Fallen Planet Studios does not warrant that any of the materials on its web site are accurate, complete, or current. Fallen Planet Studios may make changes to the materials contained on its web site at any time without notice. Fallen Planet Studios does not, however, make any commitment to update the materials.\n\n6. Links\n\nFallen Planet Studios has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by Fallen Planet Studios of the site. Use of any such linked web site is at the users own risk.\n\n7. Site Terms of Use Modifications\n\nFallen Planet Studios may revise these terms of use for its web site at any time without notice. By using this web site you are agreeing to be bound by the then current version of these Terms and Conditions of Use.\n\n8. Governing Law\n\nAny claim relating to Fallen Planet Studioss web site shall be governed by the laws of United Kingdom without regard to its conflict of law provisions.\n\nGeneral Terms and Conditions applicable to Use of a Web Site.\n\nPrivacy Policy\n\nYour privacy is important to us, and it is Fallen Planet Studioss policy to respect your privacy regarding any information we may collect while operating our websites. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy.\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\nWe will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law.\nWe will only retain personal information as long as necessary for the fulfillment of those purposes.\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. Fallen Planet Studios may change its Privacy Policy from time to time, and at Fallen Planet Studioss sole discretion.\n\nSearch for:\nRecent Posts\nFallen Planet Studios Talks to VROne\nAFFECTED: The Manor on Oculus Quest\nFallen Planet Studios @ VR Days Europe\nHappy Halloween!\nAFFECTED: The Visit  giffgaff Halloween\nCategories\nAFFECTED\nINSTALLATIONS\nNEWS\nPARTNERSHIPS\n\nDisclaimer 2020 All Rights Reserved.\nFallen Planet Studios Ltd, United Kingdom.\n\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok", "Space Required": "1.16 GB"}



["5 stars\n54%\n4 stars\n21%\n3 stars\n10%\n2 stars\n7%\n1 star\n8%", "kiwisoupJul 10 at 8:11 AM\nHaunted House Simulator\n\nThis is one of a handful of games I use to show off the Oculus Quest to people for the first time and it's really entertaining in a group setting just to watch someone play and laugh at their reactions.\n\nThe setting is a classic victorian haunted house. Objects move on their own, doors open and slam behind you, ghosts make an appearance, etc. The graphics are quite good in terms of what the Quest is capable of. The visuals can look a bit muddy or grainy because of the dark setting, but the last update seems to have boosted the brightness and improved this substantially.\n\nIt's basically a haunted house simulator. It's not really a game as much as it is an experience. In terms of scariness, there were a few jump scares that got me but they are fairly spaced out. I would say they could have crammed more scares in but I've also seen many people refuse to play more than a few minutes.\n\nYou use the joysticks to move around and motion to aim the flashlight and open doors. This makes it very easy for a beginner to jump in, although the free locomotion may set off some people more sensitive to motion sickness. It is mostly linear except a couple points where the path branches. If you run through the game, it's about 15 minutes or so, but if you take every path that's 4 playthroughs.\n\nThat's not even counting the update that just came out with the new \"Gauntlet\" mode where you speedrun through a course while dodging objects that try and block your way. It takes about 3 or 4 minutes and it is not just running through the same pathways as the main game, this is a new environment with some new elements.\n\nAt 10 bucks it's worth it I would say. If you've played the game on other platforms, know that this version was built from the ground up for Quest and offers a different experience than the Go or PSVR/PC version.\n\nHelpful | 53", "BENZ121215 days ago\nGood experience, loads of potential\n\nI was looking for a haunted simulator and this is the only one I could truly find. I wanted the following\n1) easy to control for new people to VR\n2) simple to explain to people\n3) did not involve puzzles or long mazes that I had to explain\n4) would scare people\n\nThe experience delivered those. I do wish it was a little scarier and had the ability to increase or decrease jump scares.\n\nI hope the developers keep building of this experience and it keeps getting better.\n\nSome suggestions\n1) more jump scares\n2) make a room were you look down and its far up\n3) add feet if you look down\n4) more things thrown at you to surprise you.\n5) have things jump out of the walls randomly\n\nHelpful | 5", "ajaswinski17 days ago\nA SCARY TECH DEMO\n\nDefinitely worth price to scare the hell out of your friends and family. I also appreciated they had local motion instead of ridiculous teleport which takes one out of the experience. With that said I joined most of the reviewers in saying that it's an old fashioned haunted house simulation. Hey, that's a good thing.\n\nHelpful | 2", "kevin.allen.7355Jul 11 at 9:26 PM\nIs casting supported?\n\nI've attempted to cast to multiple devices to show off this game to family. If I start casting from the quest, it starts up just fine from the menu system. Once I start the game however, it will not load and just shows a black screen with no errors. I have to hold the power button and restart the quest. I can start the game with no problem if I don't cast.\n\nI don't know if this is a known issue or something that can be fixed.\n\nHelpful | 5\nDeveloper ResponseJul 12 at 7:25 AM\n\nHi there, thanks for your feedback. Casting should be supported, I have passed this on to the technical team and they are dealing with it as a priorirty. Please email info@fallenplanetstudios.com with your OculusID.", "PhilitoJul 10 at 3:03 AM\nPhilito\n\nI just tried 10minutes of the game and was terrified, great game to show your friends, one problem the original game had three different environments so I should imagine you will have to pay for the other two, but great game, well worth the money.New update 9/7/20 I installed the new update, the whole game is ruined, to gray and to bright the Manor is also ruined, it's to bright, when the game was dark it was scary, now the devs put in to many candles, very disappointing, I shall give this a miss for a while and wait for another update, oh yes the dlc the gauntlet is not scary and not dark enough\n\nHelpful | 12", "JohnPiperGhostHunter3 hours ago\nGOOD BUT CAN'T PLAY ORIGINAL VERSION NOW\n\nLOOK BEFRORE YOU LEAP! I want to be able to play the original version. IT IS MY PREFERED VERSION FIVE STARS ***** ..... I was not aware the update would wipe it out! Others have stated the same here. Is there a way to revert back to the previous version??? Have not been on Quest in quite awhile and saw updates for my games and just iupdated them without seeing what it is updated to? You should have had the original remain to play as an option along side this \"update.\" This is not an update it is a NEW game entirely. Thanks.\n\nHelpful | 0", "jayman5671Jul 5 at 6:12 PM\nDecent but under delivered.\n\nIts really well done but just dropping by to say Dread Halls is WAY better for the same price. I played through the whole thing in what felt like 15 min, and only a handful of good jump scares. Great hand tracking and amazing graphics, but nothing can harm you so theres no sense of danger. Dreadhalls is terrifying and monsters can make you start from the last check point so theres a real sense of urgency and anxiety. That game gave me serious chills. Way better use of $10 than this game in my opinion\n\nHelpful | 10", "KenswiftMay 27 at 9:36 AM\nKeeps getting better and better\n\nI have this on the quest and also had it on my Vive. The Vive graphics are better for sure- I mean crazy good and scary AF. That being said, they did a stellar job on the quest. They use the technique where whenever you focus, the resolution is dialed in and the rest is blurry, that way they can maximize the Quests abilities and it looks really good. Great atmosphere! Its not a game so much as a Haunted House you need to get through. Wonderful experience and I use it so scare the hell out of newbies to the quest. Get this if you like horror, its the best on the quest so far.\n\nHelpful | 46", "DragonWolfPTJul 29 at 8:12 AM\nToo short. No story.\n\nIts an imercive experience,yes, but it based a lot in jump sacares, I think they lost a golden opportunity to set the mood and tell a story. There's no story, at lest from what I could gather. I beat it under an 40 min or less. Feals like a lost opportunity to make a great horror experience. The house is great, but with some story it could increase the scary mood and give you the creepy scary vibes. It has the gauntlet for extra content.\n\nHelpful | 1\nDeveloper ResponseJul 25 at 6:56 AM\n\nThank you very much for your feedback. The Manor is aimed at being more of an immersive haunted house experience as opposed to a narrative driven story. We also added The Gauntlet to a recent update that is a spooky speed run against the clock where you can compete against your self and other Oculus users. We hope you like it!", "ConnacemoxJul 22 at 3:32 AM\nGreat experience.\n\nI like it very much and the new update is fun.\nReally immersive to the point I screamed couple of times, which is very rare for me. The thing is, there is no object interaction -except opening doors and holding a flashlight- or puzzles. It is great for what it already is, however I cannot help but notice how much more potential there is if we could be a part in it and race against time and fear to solve things.\n\nHelpful | 1", "Gamertag_VRJul 9 at 11:40 PM\nINTENSE HAUNTED HOUSE JUMP SCARE FEST\n\nFULL LIVESTREAM WALKTHROUGH & FEATURED THE GAUNTLET DLC BOTH AVAILABLE BY SEARCHING GAMERTAG VR ON ALL SOCIALS\n\nAffected: The Manor main game is a great haunted house experience that isnt cheesy and looks great in the headset. There is a couple of paths to choose from in the game & while its a short experience its full of intense jump scares! And now combined with the latest DLC called The Gauntlet I think the price for the bundle is excellent.\n\nHelpful | 2", "TVL1977Jul 15 at 3:57 PM\nDare to enter?......\n\nIt isn't designed to get lost in this game for days or even hours in search for clues or exploring the horror mansion, but instead it's an old school thrill ride horror mansion (like the ones on the fair) that delivers jump scares within a spooky atmosphere.\nThere are two paths to choose from, slightly different, although the scary kids voices are always present..... Scary! But nonetheless it does the trick on scaring you.\nIt's definitely an experience, rather than a real game , because there is hardly any interaction, besides sliding doors open or picking up a flashlight. Good to show your friends and see them get terrified and have a laugh about it.\nThe visuals are definitely ok considering it's on the quest, although when it's dark you get to see the blurry layers. But I do like all the details put into the house, makes it feel even more real.\nThe new update, it's fun, but it's definitely not the same as the mansion itself. Just a fast run on time without really being scary.... But it's a nice extra.\nHopefully they add another story layer to the mansion.... Love to see more.\n\nShort experience, low price but definitely impressed with it.\n\nHelpful | 0", "panthereyesJul 26 at 8:20 AM\nGreat but many things have to be fixed !\n\nLOVE it but at the same time I was a bit disapppointed. Let me explain. I'm a BIG fan of the first version of the game and I still love the atmosphere and design. It's a very fun and immersive experience. Not too scary but that's also why it's perfect for me. It's mostly like a ghost ride.\n\nThe problem is : it's too bright ! A bit darker would be more scary. Actually it's so bright that I could see kind of white fog in front of my eyes (aliasing?). Very annoying to play.\n\nAnother thing is : sickness. I didn't have the problem with the first version but now after playing only 5min I have serious nausea... So I know if I play this game I'll have to lay down for 2h right after... not fun.\n\nAnd the last thing is : bug. There is a HUGE bug with the elevator. After I went down I got stucked between the wall and the elevator and couldn't do anything. So I just gave up and closed the game... So frustrating.\n\nIt's a pity we can't play the first version as well because it was a different experience. For me it's not an update but a new game... :(\n\nI really really hope there will be update soon. It's a great experience but some important things have to be fixed to make it perfect (I'd love to give you 5 stars). Thank you !\n\nHelpful | 2", "Willow41Jun 16 at 2:32 PM\nGreat intro into VR horror\n\nIf you're a horror fan and have never experienced horror in VR then you'll probably like this.\nThis was an intro into VR horror for me. I felt uneasy and a little scared. I actually jumped a couple of times. And there was no gore, which I liked. After about 5-10 minutes I actually felt a little disturbed. If you've already experienced VR horror then this probably isn't going to do anything for you.\nAs in the description, this is not meant to be a game, it's meant to be a first time experience. The only interaction comes in sliding open doors and holding a flashlight through part of it.\n\nHelpful | 8", "Dave_TammyJul 16 at 8:40 AM\nNew Version is Awesome !\n\nI played the old version of the game. It was certainly a lot of fun to play. Not a \"game\" so much, as a walk through, an old haunted house.\n\nThe amount of \"SCARES\" they give you are about perfect. At least for me. The anticipation on your first walk through will keep you in suspense. My first time through I just wanted to get to the end without quitting! My second time, I chose a different door, and it was a totally new scene all together. Once again it was creepy!\n\nNow it's fun to go in and take my time looking around each room at all of the details. Best part is watching your friends and family try it for the first time. \"Who will make it to the end, or who will chicken out :)\"\n\nTrust me, lots have chickened out here. One didn't even make it to the front door of the house. SAD.\n\nFirst time I entered the Gauntlet on this new version. It just went black and nothing ever happened. The game would crash and I would have to re-install to get it to run again.\n\nI emailed the Developer and they responded very quickly. An Update for the game just came out July 15 and it now works PERFECTLY! You can cast to your chrome cast and play without issues.\n\nI'm very impressed how fast the Developer responded and got a fix for the game.\n\nWill enjoy watching my friends try it this weekend.\n\nWorth every penny!\n\nHelpful | 2", "Galapagos12Jul 13 at 10:19 AM\nJust What We Need\n\nThis game is not revolutionary. Heck, Im not even sure I can call this a game, as very fewif anychoices are involved. What it is is walking around a scary environment getting jumpscared time and time again. And that was exactly what we needed.\n\nId say theres nothing new in terms of horror or VR experiences, but what it is is perfect. As the Quest is still relatively new, we needed a good horror experience that could get us to jump, something we could interact with a little, and something we could show our friends. And thats what Fallen Planet gave us.\n\nIf youre looking for a fun horror experience, I would absolutely recommend it.\n\nHelpful | 2\nDeveloper ResponseJul 13 at 7:35 PM\n\nWe're really glad you enjoyed AFFECTED: The Manor, thank you so much for your kind words.", "Salaudo8 days ago\nDisappointing\n\nLet me just start by saying I don't ever leave reviews for games.. but this game was just god awful, the controls and speed of turning made me motion sick, and the game consists of a single jumpscare used constantly.. If a game can scare me other than relying on jumpscares let alone the same one over and over then it's a good game, that being said none of the \"scares\" worked and the only fun part of the game was the carnival, where you run to the end but even that was nearly poorly executed. Maybe make sure you have a good game before you market it as the scariest VR Haunted House.\n\nHelpful | 0", "steveortega19 days ago\nWorth the price\n\nI had purchased this experience and was going to score it lower. My apologies to the developers, I was impatient. I never gave it a fair chance. I played it all the way through and I now appreciate it. I hope that in the future more doors are added. The only problem is that after I describe it to others , they want no part of it and that's a compliment to the Manor\n\nHelpful | 1", "JioxxJul 21 at 4:11 PM\nThe Best VR Haunted House\n\nThis is the third platform I've experienced The Manor on, I also have it for Go and PlayStation VR. The fact that several other reviewers have purchased this multiple times should give you an indication of how highly it's regarded.\n\nAffected: The Manor is like owning your own Halloween attraction. It's a walk through a haunted mansion with multiple paths to the end, not a horror adventure game. How long each path takes depends on how long you spend cowering in the dimly lit corridors gathering the strength of will to slowly open the next door.\n\nI've only gone through one path so far but I can say that It's easily the best version I've played. Most of it was all new, and the situations that were familiar were so much better than in the Go or PSVR version. It's the best VR haunted house I've ever experienced. Unlike the Go and PSVR versions you can now interact with objects and open doors. (I hope the developers update this to use hand tracking. Maybe you could point with a finger to move forward?)\n\nThe art direction and design are top notch all the way through. As to be expected the limitations of the Quest's processing power can be seen but there are some areas that rival PlayStation VR quality. The developers are pushing the Quest hard.\n\nI'd like to address the complaint other reviewers have about the graphics smearing in dark areas. This seems to be a hardware issue and other games on the Quest with dark areas suffer from it. For example the dark areas in Star Wars Vader Immortal smear and blur as you look around. My guess is that the only thing the developers could do to address this would be to turn up the brightness, which would be a shame. Haunted mansions should be dimly lit.\n\nThe technical issue I hope the developers do look into is the movement. If you lean towards something to get a closer look it often knocks you back, breaking the immersion. The developers have already released a patch that addresses complaints about turning, so they're responsive to user feedback. (I just stand and turn around to navigate the Mansion. That's one of the perks of untethered VR, no smooth or click turning necessary.)\n\nAs much as I love VR horror, I would not recommend this or any other horror title for introducing people to VR for the first time. It would be the equivalent of introducing someone to hot sauces with a bottle of ghost pepper sauce. VR horror can be a very unpleasant experience for some people.\n\nFor anyone who has some experience with VR and is interested in horror, this is a must buy.\n\nAnd on the title page there's a \"Coming Soon\" notice. :)\n\nHelpful | 1", "ttvalmostspJul 9 at 1:54 PM\nBought it for wifes birthday today\n\nAnd apparently there's an update releasing the gauntlet. Well unfortunately the game is absolutely broken. I try that game mode or the usual one and it crashes hard. To the point where even after I force quit it will not start fresh without a full reinstall. Then the same thing happens again. I will change my review once this bug is fixed. Game breaking.\n\nHelpful | 4\nDeveloper ResponseJul 10 at 2:29 AM\n\nHi, I'm sorry you've had this issue so please email info@fallenplanetstudios.com so we can learn more about the problem and whether you're a Quest or Rift owner, we want to make sure your wife gets scared!. The Gauntlet update has rolled out and we've had a lot of reviews of people playing so I'm sure we can resolve this issue for you.", "kostaskoutastrJul 29 at 8:02 AM\nGreat Scary Experience\n\nI hate puzzle horror games because it's really hard to think while scared. This game is not anything like that. It's a scary experience i screamed and got really scared. And the audience of my channel loved it. Great game. Congrats to the Devs\n\nHelpful | 1", "amante63Jul 16 at 8:44 AM\nOutstanding, Amazing, Awesome Fun!!!\n\nUpdate, Now that the developers have pushed out a fix and no more crashes, this vr experience is outstanding! The amazing beginning title effects, has you feeling scared in the moment before you ever get to the choices of which experience you want to subject yourself into. Then there's the choice of doors, The Manor or The Gauntlet, either choice will give you frights, scares, and awesome fun!!! If there was more stars to give, this app/game would receive them all!!! You will be very happy with the money you spend on this one.\n\nUpdate, so in an email from the developers, they had mentioned something about the mic enabling was also causing issues with the casting, so I went back in my app settings and disabled the mic on this app did a restart on my Oculus device, denied mic when reopening app/game. I now can get onto all doors without being kicked out/app crashing, so until the new fix gets pushed out, try this if you are having issues with this game/app\n\nUpdate, raised the star level, not because the game/app is working for me, I'm am still not able to play at all/door issue, no I raised the star level from 1 to 3 because the developers are very quick to respond and help. They are saying that they have a fix for this and will be pushing it out as soon as testing is completed.\nCan not wait to give this another go!! :-\\\n\nWhat is wrong with this game, every door I touch kicks me out of the game! :-( The Tutorial door, after walking up to the Manor, the doors past the lions. Is there a way to fix this or do I have to get a refund? My opinion on this game right now is, it's the worst I've ever had on my Oculus Quest. Please Help!!!\n\nHelpful | 1", "pogleyJul 15 at 2:48 AM\nThe Gauntlet makes this SO FUN!\n\nI got this recently. The main game is really great and brings a little bit of replayability, but The Gauntlet is where its at! My kids and I love running through the halls to reach the end and its a great race.\n\nHowever, there was a casting bug. This blank screen crash was something that kinda ruined things when we were all trying to experience this together. I got straight onto the developer support and THEY FIXED IT IN 24 HOURS! Now thats great customer service, so its a whopping 5 stars from me. Great job Fallen Planet! If you are still experiencing this issue, delete and reinstall the game.\n\nHelpful | 0", "MaelwolfJul 18 at 9:29 PM\nDug up too soon.\n\nIts fine, but has too much time taken up with nothing happening to really get you on the edge of your seat. Thus, when a jump scare does occur, Im usually too glad something is happening to actually jump. The game really needs more eerie shadows and things moving just at the corner of your eye or quickly out of sight. It also needs at least some basic interactivity. You pass by so many blanket covered objects, but you cant even pull off the blankets. Overall it feels like the start of something that could be a lot of fun but just falls short.\n\nHelpful | 1\nDeveloper ResponseJul 19 at 4:31 AM\n\nHey Maelwolf, thank you so much for your feedback. The Manor does lean more towards building tension and use to many jump scares, however we have just pushed free DLC to the The Manor menu called The Gauntlet. This is a spooky speed run against the clock that is much more dynamic, check it out!", "JJMonk2007Jul 10 at 8:25 PM\nLoved It!\n\nI came into this thinking oh bad reviews not very long and its not very interactive. Boy was I in for a surprise. Now I am what we call a scaredy-cat I get scared at everything. This was the most scared Ive ever been. All of the jumpscares come out of no where! Everytime I would get jumpscared I would throw my hands up protecting my face and after start laughing. Its a very fun experience for a horror game. I recorded it and the footage was 20 minutes long so not a very long game. But it feels like your playing for an hour. The whole time I was wishing it was over but not because the game was bad. But because of how scared I was to go into the next room. This has become one of my favorite games on the quest! Its also really fun to get my friends and family to play it and see their reaction! This is a must have for any horror fan looking for a scary time!\n\nHelpful | 1\nDeveloper ResponseJul 11 at 3:27 AM\n\nWe're so glad you enjoyed it, thank you for your review. Although there are multiple routes and multiple endings, we deliberatley keep each run to around 20 minutes because we know that feels long enough in the headset. We have just pushed free DLC called The Gauntlet, a spooky speed run against, we hope you like that as well!", "PakioGaloreJul 16 at 4:58 PM\nGREAT CUSTOMER SERVICE!\n\nI haven't fully explored the game just yet but I look forward to it. I wanted to say that there were issues with the game when I try to cast.\nI was immediately contacted about it and the problem was fixed ASAP. Absolutely amazing customer service, thank you thank you\n\nHelpful | 1\nDeveloper ResponseJul 16 at 5:38 PM\n\nThank you!", "j_aem_13Jul 12 at 3:19 AM\nWorth it?\n\nAs the description states this is a walk through haunted house with very little interactivity. In addition, it has the usual quest problems of lower quality textures and some frame rate issues. The game also stuttered a few times for me in room transitions. But when it gets going, this very short experience is very immersive. The scares are well placed and ramp up from fairly tame to extreme. If like me you scare easily this is a riot to play and watch others playing. The asking price is steep considering the time for completion is 10-15 minutes, but it does its job well. Also the devs are working on a \"gauntlet\" mode to be added.\nOne thing - any time you see a set of double doors, grabbing and pulling both crashes the game for me. So hopefully the devs patch this.\nUpdate July 2020: the gauntlet mode has been added & is a literal heart attack risk! The audio permissions the he asks for are to register your screaming (or so it claims). No spoilers but it's a genuinely entertaining addition.\n\nHelpful | 1", "apvizionJul 12 at 11:36 AM\nDecent VR haunted house!\n\nNo combat, no keys, no puzzles. Just an awesome haunted house experience with two main paths to choose from. A good amount of jump scares, and a creepy atmosphere keep things interesting, without feeling too intense. The design of the mansion is fantastic, and I love how it's impossibly huge inside. The visuals look great, and I love all the attention to detail. I like to take my time, and admire all the creepy paintings throughout the mansion. I would really love to see an expansion, or some DLC at some point.\n\nTHE GAUNTLET UPDATE: I originally gave this app 5 stars, but I'm removing two due to \"The Gauntlet\" expansion. I was super excited when I heard there was an expansion, but couldn't be more disappointed with what they came up with. \"The Gauntlet\" has players slowing gaining speed as they move through a haunted hallway of constant \"jump scares\" consisting mostly of furniture jumping out to block your path, slowing your speed. You also frequently come to a complete stop to open doors, returning you to a painfully slow pace. This mode is not at all scary, in the same way that editing everything but the jump scares out of a horror film isn't. The creepy mood and atmosphere is gone, as is the slow pacing that builds suspense. This is literally a dodging couches running game. I found it really annoying and joyless to play, and having it as a main option right from the lobby really hurts the overall experience of the app. After playing the Gauntlet the main mansion experience isn't creepy anymore. If I would have played this mode first, I would have quickly requested a refund. Definitely do not play this expansion first if you want the main experience to be spooky.\n\nHelpful | 1\nDeveloper ResponseJul 12 at 10:01 AM\n\nThank you for your review. We value all criticism and are constantly looking to improve the content we offer based on the feedback of the Oculus community. I have passed on your review to the team and we will continue to update and expand The Manor in an effort to offer as much value as possible.", "BigRedDragon11 days ago\nWell done.\n\nGood game with good scares not super intense but scary enough to start my journey into scary games\n\nHelpful | 1", "Carl_Wheazer42025 days ago\nTerrifying\n\nEvery jump scare got me the atmosphere alone is creepy as heck and the graphics are amazing, really high quality and such a good introduction to vr horror. 10/10\n\nHelpful | 1\nDeveloper Response25 days ago\n\nThank you for your kind words!", "SiiGzagJul 28 at 10:48 PM\nNot worth it.\n\nI was expecting some level \"creepy\" but there was none of that. Everything is set on \"triggers\" meaning nothing will happen until the player steps into a certain zone.\n\nThis game has good potential, but its just poorly executed.\n\nHelpful | 1", "YaHomieOfficialJul 28 at 2:13 AM\nM\n\nI just came here to say that this is a brilliant horror game but if you could add a multiplayer mode, that would make it a lot better\n\nHelpful | 1", "marge36Jul 26 at 2:56 PM\n\nScary but could be longer\n\nHelpful | 1", "DingdongerJul 17 at 8:08 AM\nNot scary\n\nI didnt make a sound, it wasnt scary, and I knew everything coming ahead of time. From what I saw, there wasnt any punishment for doing anything wrong. If there were a health bar or something, and there were things chasing you, maybe it would help.\n\nHonestly, now Im kinda sorry.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 7:49 AM\n\nHi there, We're sorry The Manor didn't scare you, we try to be more spooky as opposed to gory or explicit.Thank you for your feedback though!", "NVRflameFeb 8 at 6:52 PM\nIgnore negative reviews\n\nAll the negative reviews are simple simons comparing the updates from the Go to this Quest version as opposed to rating the game itself.\n\nAlso it gets low stars because you cant do a lot in the game in way of puzzles, problem solving etc...\n\nBUT its an experience people!!!\n\nThe game is designed to give you a scary experience and so far no one does it better!\n\nSo give my review a thumbs up so people see the truth and can make an informed decision if they want to spend their money buying this game or not.\n\nAlso great game to have your friends and family play just to watch their reactions!\n\nHelpful | 385", "Tony.DiIuorioMar 14 at 11:12 PM\nA nice little demo that ought to be free\n\nI've only ever played Quest so to me it looks fantastic. But it's not a game. It's a 20 minute walk deeper into a haunted mansion. With plenty of little Japanese girls and possessed women walking like demons.\n\nIt's VERY creepy. The immersion is high, it feels like night within minutes, so stuff that scares you or makes you jump out of your skin is all there.\n\nYou just can't interact with anything but opening doors. There's no consequences, and the demonic apparitions cannot hurt you.\n\nI just use it to give new users something they can't \"lose\" while learning how the controllers work, and while getting some VR legs.\n\nHelpful | 27", "Jonnyrad1973May 19 at 6:48 AM\nWell I enjoyed it!!!\n\nFor what you get, its probably not worth the full asking price but I thoroughly enjoyed it on my first walkthrough. It definitely gave me chills and those jump scares made me yell out a couple of times. Five stars for the atmosphere and the laughs Ill get watching friends and family jumping out of their skin whilst experiencing it. Creepy fun!!\n\nHelpful | 3", "kevin.stallings.3Jul 16 at 5:38 PM\nAwful\n\nYou only run through the the manor. The jump scares are not scary at all. Can I get my money back? Definitely not worth 10$. It lasted maybe 5 minutes\n\nHelpful | 2\nDeveloper ResponseJul 17 at 5:29 AM\n\nHi there, The Manor is an experience, with a choice of routes and multiple endings. I'm sorry it wasn't scary enough for you but we try to be more spooky than any extreme horror. We also just pushed free DLC called The Gauntlet to all owners of The Manor. This additional content is a haunted speed run against the clock, with a global leaderboard so you can compete against other Oculus users. Give it a try!", "terry.reeceJul 28 at 10:23 PM\nCrashes all of the time\n\nI am barely able to get anywhere in to the manor. Everytime I use the grab to open a door or take something the game shuts down and takes me back to the Oculus menu.\n\nHelpful | 1", "Zzippy7722 days ago\nMust have\n\nGreat game worth the money\n\nHelpful | 1", "GIGE.1985Jul 16 at 7:12 AM\n\nNot bad\n\nHelpful | 1", "BlackDragon7643Jul 22 at 1:11 PM\nReally scary\n\nScariest game I have ever played. Lots of jump scares and irie feelings everywhere.\n\nHelpful | 1", "nishruu2Jul 27 at 4:12 AM\nyou will scream\n\ngreat but short haunted house and the gauntlet is fun too\n\nHelpful | 1", "FalafelPesto6 days ago\nInduced nausea\n\nI had to quit the game 5 minutes in.\n\nHelpful | 0", "brittany.cain.Jun 19 at 5:49 AM\nSuper scary\n\nThis game was scared it was like being in a real haunted house I wish that they had the options to invite your friends\n\nHelpful | 0", "JohnReeseEJul 19 at 6:30 AM\nPhenomenal\n\nPlease make more experiences like this\n\nHelpful | 1\nDeveloper ResponseJul 19 at 12:29 PM\n\nThank you!", "zickles500Jul 16 at 7:34 PM\nCool and scary experience\n\nThey got me a few times. Pretty cool.\n\nHelpful | 1", "Noah106Jul 13 at 1:25 PM\nAmazing\n\nSuper scary and super fun, its the best game ever\n\nHelpful | 0\nDeveloper ResponseJul 13 at 7:33 PM\n\nThanks for the great review!", "ElgueyJul 12 at 6:42 PM\nOverall good\n\nSimple to use the family liked it scary pop ups\n\nHelpful | 0", "edshigakiJul 9 at 6:40 PM\n$10 for a 20min game\n\nIt's not really scary and it's so short (20min, really!?) that it should be free.\n\nHelpful | 2\nDeveloper ResponseJul 10 at 2:36 AM\n\nHi there, on average each route in The Manor does take approximately 20 minutes to complete, however there are 2 different routes and each route has 2 different endings to offer variation. In addition to this we have just released free DLC inside AFFECTED: The Manor called The Gauntlet. This is a spooky speed run against the clock with a global leaderboard, some events are randomized and you can compare your times against other Oculus users. We do our best to offer as much value as possible with AFFECTED: The Manor and chose a relatively low price point on the store for our title. We're sorry it's not for you but thanks for your feedback!", "doriancrammJul 9 at 1:04 AM\nFeeling its age\n\nIt's alright. It's a little blurry due to the dimness but I'm sure you'll love it as a haunted house type of experience.\n\nHelpful | 0", "Scary_Clown5831Jul 15 at 7:15 AM\nProblem with grabbing things\n\nThis problem makes the game unplayable whenever I try to grab something I crash. Could you please help me?\n\nHelpful | 0\nDeveloper ResponseJul 15 at 7:38 AM\n\nHey there, sorry you have experienced this. We have now put out an update to fix this issue. Please reinstall it and email info@fallenplanetstudios.com", "ansonort9 days ago\nFirst impressions\n\nI have been a ghost tour guide for many years taking people around a rather spooky old Tudor house in the Midlands. I having been umming and ahhing about buying this for some time. My reasoning is that having guided people round dark winding narrow hallways for so long, could VR create the same kind of atmosphere? Thank goodness Ive taken the plunge! I havent really explored too much yet, but Affected has all the elements for a haunted house - and then some! The graphics and sound are excellent. The atmosphere is tense, but not overbearingly so, which I consider a plus. Its just a great old house to explore. The smooth movement actually enhances the experience a lot. It gives exploration a dream-like quality and a slightly discomforting sense of vertigo.\n\nOne thing to note so far. There are a lot of pictures on the wall. I wish some of them could alter themselves in subtle ways as I walk by. Another thing is peripheral vision - this is something that I emphasise time and time again on my own tours. Its not whats in front of you, its whats right at the edge of your vision, something you can feel rather than actually see. Id like to see some instances of this - after all, this is VR and the experience is 360 degrees.\n\nI congratulate the developers on creating something very atmospheric, spooky, unnerving. I do think some subtle enhancements would make this a top-notch experience.\n\nHelpful | 0", "sputukFeb 27 at 5:14 PM\nAmazing fun for a party\n\nI cant play this game - because it scares the bejebuz out of me, but at a recent get together, this game was very popular and led to much hilarity as people playing it were freaked out and screaming.\n\nIf you enjoy being made jump, and left gibbering in a corner, youll love this.\n\nMe? Im just going to keep the game to let others play it!\n\nHelpful | 22", "albert.elyseeJun 21 at 4:47 AM\nStarted glitching\n\nIt was amazing at first but all of a sudden it started to glitch and you couldn't really see a lot, it doesn't happen with any other game I have\n\nHelpful | 1\nDeveloper ResponseJul 14 at 5:31 PM\n\nHey there, there was an issue with the wireless casting but we have now pushed an update to fix this. Please reinstall AFFECTED: The Manor and let us know that it is working fine for you. Our email address is info@fallenplanetstudios.com Sorry for any inconvenience caused.", "YANDMANJul 14 at 2:48 PM\nFreakish Fun!\n\nJust got this on sale, although I'd say it's absolutely worth it at full price. I'm not the bravest person when it comes to spooky stuff, but this was just the right amount. If you enjoy the Ghost Train at the fair, definitely give this a go. If the developer somehow reads this, please please make this two player, thos would be incredible to experience with a friend. There is a new free update that adds a gauntlet run, you get scored on how quickly you make it through and how few times you scream. This is a perfect example of a V.R experience.\n\nHelpful | 1", "joro0414Apr 12 at 4:40 PM\nNot that scary at all\n\nIm someone who couldnt watch nightmare on elm street or Friday the 13th as a kid. I just never enjoyed scary movies. Scared easy, had nightmares. The Scream movies wasnt too bad, but kinda like comedy horror. Hell even Jaba the Hut scared me in the theater. Had to leave the theater until his scene was over in RotJ\nand go back to my seat.\nThis app has two problems. One, honestly its not scary, even the jump scares are weak. I got pretty far in on my first try and died which I didnt even know was possible. Two, you cant interact with anything but some doors and a flashlight from time to time. If you die you have to start from the beginning, no save points, so I guess three issues. Ill keep it, only $10, nice to have to see how my friends react to it. I will say at the bare minimum some of the scenery is somewhat eerie and has and evil feel to it. So 3s otherwise only 2s.\n\nHelpful | 2\nDeveloper ResponseJul 10 at 4:06 PM\n\nHi there, thank you for your feedback. The Manor is a walkthrough with 2 routes and alternate endings, it is definitely more of an experience, as opposed to a game that can be beat. We have just pushed an update with performance enhancements and free DLC called The Gauntlet, please check it out! It's a spooky speed run against the clock and the amount you scream is rated, even better for freaking out your loved ones!", "MR.KING.KJun 3 at 8:07 AM\nScared\n\nIm scared theyre scared we are all scared together \nGreat game \n\nHelpful | 1", "kiyana411Feb 22 at 8:52 AM\nI loved it \n\nI first played this a VR gaming spot and I never got to finish the game. I was really excited to buy this so I could finally finish the game. I love scary stuff even though it makes me scream. I loved the graphics and I was totally creeped out. I had to turn the volume down on my quest and turn my t.v. up just so I wouldnt scare myself while playing this at home in broad daylight, lol . I did end up screaming towards the end of the experience. I found it to be amazing. This is the closet I will get to starting in a horror movie. Ill have to try it again and see if I can play it with the music up. It was easier to get though the experience having the audio turned all the way down. Great game, you should really try this one out.\n\nHelpful | 12", "thaxton4Apr 22 at 6:02 AM\nAFFECTED The Manor\n\nI want the next add on when does it get released its been saying coming soon for awhile sp i was wondering when it will get released\n\nHelpful | 5", "GrimmcragFeb 13 at 3:48 AM\nGreat intro to VR\n\nThis is great if you are showing be to someone who's not really a gamer as it's not really a game but a haunted house walkthrough with some minor simple interactions. Does well to build a creeping atmosphere of dread and has some effective jumpscares. Not much replayability but its value is similar to Richie's plank experience, to get people into VR in a simple and fun way.\n\nHelpful | 6", "magnific007Mar 23 at 5:03 PM\nDon't ignore negative reviews\n\nSorry folks, this wasn't scary AT ALL! The house is pretty cool, but there aren't nearly enough things that try and scare you. A \"grudge\" looking little girl darts around occasionally. Flying furniture and books ( not scary at all). There is potential for the house, but far better and far more scary content is needed. I would've felt disappointed if I tried this for free. There is the refund policy, but I let the 2 weeks go by and lost my chance to return it\n\nHelpful | 9\nDeveloper ResponseJul 10 at 4:10 PM\n\nThanks for your feedback, sorry it wasn't for you. We have just pushed free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "ForgedDarknessJun 6 at 7:20 PM\n\nGame looks great but constantly crashes or closes and sends you back to oculus menu\n\nHelpful | 0\nDeveloper ResponseJul 14 at 5:32 PM\n\nHi there, we have just pushed an update with performance enhancements and free DLC called The Gauntlet, check it out! Please can you confirm that it is all working fine for you now?", "balavarshMay 23 at 9:11 PM\nGame broken\n\nEverytime I open the door on left (on initial scene) the game crashes and takes me to oculus home screen. Please put a fix for the same.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 5:33 PM\n\nHi there, we have just pushed an update with performance enhancements and free DLC called The Gauntlet, please check it out! Please can you confirm that it is all working fine for you now?", "CbrogamezJan 27 at 7:40 AM\nScary but Fun!\n\nThis game is so much fun. I love how intense some parts get and it gets really scary. Even though there are only two paths to take, I still get scared every time. I also like watching my friends and family play this game. The only thing the game doesnt have is a save point. If you die really close to the end, it makes you start from the beginning. Other than that, its a great game and I would recommend it to horror lovers!\n\nHelpful | 8", "Rj_dbarberJul 12 at 9:11 PM\nAwesome experience\n\nOnly thing that is happening and im sure it will get fixed is that casting it to the tv is having issues now, but i ignored that and went in and enjoyed the experience!!!! Its a great scare and the gauntlet is lots of fun!!!!!!!!\n\nHelpful | 0\nDeveloper ResponseJul 13 at 4:54 AM\n\nThank you for your great review and also for being so understanding. There are some issue with the wireless casting but this is getting worked on right now and I'm sure will be sorted soon.", "bill.mickle.5Feb 15 at 7:39 AM\nAffected: The Manor\n\nJust bought this game last night and tried it out. Quick download, easy to learn, but go through the tutorial as itll give you a basic flavor of whats to come in the game. Only played for about an hour, but thoroughly enjoyed it as did my wife since we were streaming it to our TV as well. So far it is great fun with good effects.\n\nHelpful | 5", "hpoint619Jun 16 at 7:15 PM\nUpdate?\n\nGame is great.but where is the comeing soon update ?\n\nHelpful | 2\nDeveloper ResponseJul 10 at 4:00 PM\n\nHey there, The Gauntlet is now live!", "ryan.beadle.146Dec 12 at 9:10 PM\nEpic VR horror experience!\n\nThis game is great. Very immersive, my favorite horror game for vr so far. Only played for just under 2 hours so far, so I might come back for a more in depth review later.\n\nThis will jump scare you. The graphics are good and the house is creepy as hell and detailed pretty well. There are no saves in this game (as far as I can tell yet). So far it seems like you go through this haunted house (getting the piss scared outta you along the way) and if you take a wrong turn in crucial areas then your apparently scared to death by a ghost and are sent back to the main menu. I haven't passed through the house yet but I'm guessing it's probably the only level.\n\nOnly negatives so far- the picture pushes back in a weird way if you get too close to certain objects/furniture. Also I wish there were more more objects you could interact with.\n\nFor the money this is a great horror experience. Is it a rich story? No. Is there a deep story? No. Will you get scared? You bet your gotdang bee hind young buck. What are you waiting for, go get this game you pizza faced little punk (yes you jimmy). Good luck with your life and all your endeavors.\n\nHelpful | 134", "agameoftwoJul 11 at 7:36 PM\nAm I supposed to be a giant?\n\nUpdated: fixed it by having to turn my Quest completely off (I was just resetting headset.\n\nNow game is making me pretty woozy. Grainy ghosting images when you move your head.\n\n2 stars for being charming and almost has it but too many weird problems and the ghosting is just too much.\n\nJust purchased this game. Would like to play it but menus and everything appear below me. When i get to the menu screen it feels like im floating above everything and the doors are small. When I start the game my head is hitting the tops of doors and I feel 7 feet tall.\n\nIt's almost like it's stuck in a sitting position but I am standing. Cannot fix or compensate it with a view reset.\n\nHelpful | 0\nDeveloper ResponseJul 11 at 7:50 AM\n\nHi there, that definitely sounds like something isn't right! Please try uninstalling/reinstalling to see if that helps as we have not had this issue reported to us before. Please email info@fallenplanetstudios.com if that does not resolve the issue.", "LilJayden10Apr 28 at 7:26 AM\nIts good\n\nGooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood\n\nHelpful | 0\nDeveloper ResponseMay 18 at 8:35 AM\n\nGreat review!", "tneig00Feb 23 at 12:13 PM\nOh yeah. Its better on Quest. Get it.\n\nHi, I didn't really want to buy this again since I own it on Occ VR version. Its basic on there and I could play it there if I wanted to. But then I went for it. Guess what. Its better. Of course it would be. I'm happy now to pay $10 for the redo and its like a new play.\n\nThe video Preview makes it seem dark and so do some comments. But I didn't find that the case once I bought it and played it. Oh, yeah, its better. Built on the same sort of theme but new entrance, better rooms, and the redo makes it seem new - and there are supposed to be new routes. So much easier with the controllers and more functions like opening sliding doors. I can't wait for the newer chapter as well. If you had it before its no shocking completely new difference but I'm happy about that. If you liked it you'll like this new build for Quest even better. $10 verses some much more expensive games I don't like, makes it feel like a decent deal for me. Thank you Developers!\n\nHelpful | 1", "LiquidRicJul 2 at 6:54 AM\nGood start, needs some work\n\nThis has the potential to be scary, however the emerson is broken then the camera stops whenever my head gets too close to an object, also not a whole lot of vr interactions, the only moment I felt truly emerged was pushing a button on the elevator, otherwise I walked in a dark house with a lil girl running around from time to time, and once you realize that nothing can hurt you the threat level goes down to almost none. Game devs, if you see this remember subtly is key when making something scary, relying on jump scares is a poor way of making a horror game, I should be getting scared putting the pieces together in my mind, not when a source engine module pops in my face and funny scream\n\nHelpful | 0", "Mourdeaje.EcooJul 11 at 8:28 PM\nEvery door would freeze the game\n\nMy oculus freezes when I try to open any door. I just see black. Seemed super fun and was into the beginning, but now I wanna get rid of it because it's so frustrating\n\nHelpful | 0\nDeveloper ResponseJul 12 at 9:56 AM\n\nHi there, we're so sorry you have experienced this, I have forwarded this on to our developers. Please email info@fallenplanetstudios.com and let us know if you were casting during the crash.", "lonks82May 17 at 6:47 AM\nSo funny to scare your kids with!\n\nMy 15yr old daughter came out and said she was bored, so i brought this \nIt was so funny to watch her and my 18yr old son along with his gf get the crap scared out of them. Well it was till it was my turn... I honestly went into it not worried but i was legit sweating by the time i was finished. I should also add i didn't get to complete it cause the battery died, thankfully!!!!\nDon't think about it like i did and just buy it, definitely worth the low price!\nCongratulations to the developers on creating such awesome content.\n\nHelpful | 0", "Deadpool2896Jul 11 at 12:56 PM\nHaunted simulation\n\nReally awesome simulation it definitely has some nice jump scares and the gauntlet mode is a great way to play more!!\n\nHelpful | 0", "jerseyhurricane7Mar 1 at 5:03 AM\nPretty fun experience\n\nDidn't scare me very much (I go into these games enjoying \"Paranormal activity\" type stuff... I thought the baby was adorable. But I could see where the atmosphere and jump scares could be frightening. Definitely worth the 10 bucks in my opinion\n\nHelpful | 1", "TASHA.SAKURAJul 11 at 10:59 AM\nCant play due to black screen\n\nI just purchased this game yesterday and I open it the title shows up. Then I get a black screen and cant play. My oculus quest is up to date. Not sure whats going on\n\nHelpful | 0\nDeveloper ResponseJul 14 at 5:30 PM\n\nHEy there, Hey Michael, there was an issue with the wireless casting but we have now pushed an update to fix this. Please reinstall AFFECTED: The Manor and let us know that it is working fine for you. Our email address is info@fallenplanetstudios.com Sorry for any inconvenience caused.", "valkarie42Feb 12 at 8:24 AM\nIs there a way out?\n\nThis is a great horror experience. The house is very creepy and things jump out at you to make it scarier. There are two paths to choose from. I chose the one on the left and it took me about 25 minutes before I died. I'm not sure there's a way out without dying but it's a lot of fun and the graphics are pretty good.\n\nHelpful | 3", "michael_zhangJul 11 at 8:20 PM\nblack screen with no response\n\nDownloaded today, after tutorial, game failed into black screen, quit and re enter does not help, I could only restart quest to re enter but still cannot play.\n\nHelpful | 0\nDeveloper ResponseJul 14 at 5:29 PM\n\nHey Michael, there was an issue with the wireless casting but we have now pushed an update to fix this. Please reinstall AFFECTED: The Manor and let us know that it is working fine for you. Our email address is info@fallenplanetstudios.com Sorry for any inconvenience caused.", "Boltz_N_BulletzDec 12 at 11:35 AM\nMy love for VR started here!\n\nGot this app waaay back since the oculus dk2 days! Affected was the experience that got me saying \"wow! VR is the entertainment of the future!\". This version has refined the experience and it is a great Demo for first VR users who got the balls for it! This will get your heart pounding!\n\nHelpful | 38", "shanandmegMar 14 at 11:06 AM\nLove this game\n\nI bought this game after reading the reviews and this game does not disappoint. Truly scary and everyone that has played cant even get halfway through.\n\nHelpful | 1", "llhughes41Mar 9 at 12:46 PM\nVery realistic and scary\n\nThis game had a lot of surprises and scary interaction in the game better than actually going to a haunted house this game gets 5+ stars and definitely dont recommend for someone with a bad heart.\n\nHelpful | 0", "THE1TariantJan 23 at 12:17 AM\nJump scares for days\n\nI bought this game in hope for something to give me a good scare but to also have some interactive gameplay, kind of like amnesia - there was some level of interaction but mostly it was just the jump scares that filled the game for me.\n\nHowever I really enjoyed the first playtrough as scary as it was at times and can't wait to play it again to see if there is a different outcome.\n\n4 stars for overall quality and one down for the interaction lack.\n\nHelpful | 0", "AnnoyedDragonJan 11 at 1:25 PM\nDisappointed I'm afraid\n\nEnjoyed this when tried on the Oculus Go, so was eager to see how it had been upgraded for the Quest.\n\nWhen I saw interaction in the controls, I immediately began grabbing at things, but found only specific pre-designated objects could be interacted with. No throwing picture frames around or anything like that. I leaned around to take advantage of the six degrees of freedom, but immersion was broken as I was pushed back by invisible walls pressing against my face.\n\nIt wasn't as atmospheric as the Go version because there was too much happening, it was too noisy with activity, so you didn't really get an immersive quiet cool down between jump scares. Then it just ended, which felt too short. What happened to the underground area or rotating rooms? It just feels like it is missing content the Go version had and needs refinement to stop immersion breaking quirks.\n\nIt was a bit too dark, which made everything look grainy and there was a lot of lens glare. The darkness didn't so much aid the atmosphere but made the visuals look lower quality.\n\nSupernatural events need to be more spread out so you can actually experience wandering around a spooky house, before the jump scare gets you.\n\nHelpful | 12", "zombiefishersJan 20 at 8:37 PM\nVery creepy\n\nLots of boo scares and some creative creepiness. not being able to interact with more of the environment was a little disappointing. There are multiple was to move through the house so you can definitely get a few plays out of it. Great way to introduce VR to someone on the fence. One of my friends played it and dang near jumped out of his skin a couple times. Lots of fun. HIGHLY suggest wearing earbuds while playing.\n\nHelpful | 0", "acoplFeb 12 at 4:25 PM\nMust Get!!\n\nMy 1st VR scare experience, and it is amazing! If you love this type of thing, you MUST, experience it!! (Was going to say try, but it is really an experience!). Trust me, you wont be disappointed!\nI keep playing it and STILL jump! Wife tried it for about a minute, said it was to intense! Would love to see more from these developers!\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 2:52 AM\n\nThank you for your kind words!", "Invader10Jul 9 at 7:22 PM\nGreat of entry level players\n\nThis is great if you are new to be horror\n\nHelpful | 0\nDeveloper ResponseJul 10 at 2:37 AM\n\nThanks for the review!", "lynnxfitnessFeb 29 at 2:02 AM\nIts more of a horror experience\n\nAnd less a game. You are walking in a haunted manor (you cant save progress) maybe because it is relatively short experience but i dont know because i felt so sick so i couldnt keep going. The graphics are amazing that i gotta say.\n\nHelpful | 0", "famkoMar 7 at 5:54 AM\nsolid scares\n\nFun game with some cool wrinkles. Jumped many times\n\nHelpful | 0", "DakkardJan 11 at 10:45 AM\nNot left the house yet...\n\nSo it's short, normally around 15 to 30 minutes but there are different routes to take, two main routes which are different enough so worthy to try both. It's a great game to show others with a quick easy tutorial.\n\nThink of it as a short but fun experience like a ghost Train but more enjoyable.\n\nHelpful | 2", "Wildcard999Mar 5 at 2:46 PM\nBest horror experience in VR\n\nThis is my go to for horror experiences. One of my favorites of all time. If you have not tried this then do yourself a favor and get it today. You wont regret it.\n\nHelpful | 0", "Bender_2112Feb 12 at 7:07 PM\nGreat for showing friends\n\nI wanted a simple walk thru experience that can scare a crap out of my friends. This app is perfect for that. I enjoyed watching them squirm with fear, not knowing whats right around the corner. Totally worth the $10.\n\nHelpful | 3", "jmxter144Jan 24 at 7:41 PM\nYour typical discount haunted house\n\nWalking simulator in an abandoned house with various scripted events. I was sold on \"multiple\" endings and \"pathway options\" but unfortunately these endings are, for the most part the same. Biggest difference is \"where\" you are when you get jumpscared. Ooo, scary.\nThe scripted events are amusing. Statues collapse. A dresser blocks the door so you can't leave! A baby doll crawls around the room. You take an elevator and you can see a ghost girl's dragging feet. But that's it. Totally scary, right?\nBut there were some disorienting, perspective challenging events with twisting walkways. These were actually fun but... not scary. At all.\nOn the other hand, this game was pretty free of bugs and glitches. Which is pretty amazing.\n\nHelpful | 2\nDeveloper ResponseJul 10 at 4:15 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "JackKehoe69Feb 7 at 11:16 AM\nSmall but scary\n\nThe game is very simplistic in a way as such that it feels like a walking simulator. The game doesnt have much-no interaction with the little amount being doors or torches etc.\nIt would be better if a little storyline was added through notes or book passages that you have to find in cupboards or different places.\nHowever if you love horror games and you want to play this game solely based on that aspect, then this is the game for you. With creepy atmosphere it creates tensions which is only relieved by the high amount of jumpscares in which most cases, are pretty good and not cheap. Overall 5/10\n\nHelpful | 0", "MarinoLVMar 9 at 9:29 AM\nJump scares\n\nIf your looking for a game with jump scares this is it. I really enjoy this game and the spooky mansion.\n\nHelpful | 0", "MaxPowerrJan 2 at 9:06 AM\nGreat emergence, but...\n\nThe environments are too dark which then causes any lighting from environment (lamps, candles, etc) to reflect off the stereoscoping lenses given off a fuzzy not clear view of the game. This game should take advise from Face your Fear 2 game where it too is a dark creepy environment but is lighted enough that you dont get the reflective fuzzy/hazy look. At first I thought my lenses where dirty or had condensation but nope it is the game being to dark, I even kept adjusting the lense distance adjuster because sometimes that can cause the blurry ness in VR but again nope! Too bad because it really is a great immersive game. Maybe the developers can adjust the lighting in the game with an update or Oculus can finally update the goggles so the user can adjust the lighting. I find that other games with a dark theme are often too dark and there is no way to adjust lighting like you can in traditional games.\n\nHelpful | 4\nDeveloper ResponseJul 10 at 4:17 PM\n\nHey there, we just pushed an update with enhanced lighting. We've also just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "adamkanderson03Jan 26 at 12:15 AM\nThrilling\n\nSuper fun and for those wondering it isnt a campaign you basically walk one path through the house encountering things along the way and there is two doors at the beginning so essentially two routes overall for the game. Worth the money and fun to put friends through it. It takes about 25 minutes each path to complete and great scares!!\n\nHelpful | 0", "stromer16Dec 12 at 2:25 PM\nIts great!\n\nAwesome game, the atmosphere is perfect. I would recommend for anybody who likes horror.\n\nFor the devs: there are a few instances where the game lags right before or during the jump scares, which kind of takes away the fear factor. Otherwise this game is awesome.\n\nHelpful | 20", "Fatwolf_ZJun 27 at 9:08 PM\nDisappointed\n\nIt shuts down and goes to the oculus menu everytime I go to own the first set if sliding door. How do I get a refund?\n\nHelpful | 0\nDeveloper ResponseJul 14 at 5:31 PM\n\nHey there, there was an issue with the wireless casting but we have now pushed an update to fix this. Please reinstall AFFECTED: The Manor and let us know that it is working fine for you. Our email address is info@fallenplanetstudios.com Sorry for any inconvenience caused.", "VRvinbeanselJan 10 at 8:00 PM\nGreat for newbies\n\nThis is excellent value and a great starting point for VR new comers . The fun is in seeing how long they dare keep headset on or can they get to the end !\n\nMultiple different playthroughs and cleaner looking that the PSVR version (which is different again ) with less screen door effect but there is some blur on movement and not being able to look close at objects spoils immersion too a little ( why not just go to back screen rather than force you back?)\n\nOverall a great cheap scary well made VR haunted house experience...would gladly pay for more content!\n\nHelpful | 2", "singer.vincentDec 30 at 5:13 AM\nShort lived\n\nThis was fun for a short time. I ran through all 4 routes in about an hour or so. I wish there was more to the experience, its very much on rails. Perhaps this will be 5 stars when the gauntlet mode comes out. Heres hoping. Its fun to show others.\n\nI think most importantly, there should be a successful route to escape to beat this game. All endings are very abrupt and just feel like you took a wrong path and died. This has some potential but I would really like to see a deeper experience. This feels like a polished tech demo. Given the low price and the eeriness of going through the first time, I would still recommend to those who enjoy horror experiences and jump scares.\n\nHelpful | 1\nDeveloper ResponseJul 10 at 4:28 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet! We hope you like it!", "korayikoJun 8 at 6:13 PM\nVery scary\n\nVery nice horror experience for the Quest. Had all my family scared as hell.\n\nHelpful | 0", "captainchazDec 15 at 5:54 PM\nA Slightly Muddy & Buggy Masterpiece\n\nI love Affected: The Manor and strongly recommend it!\n\nPros:\n\nI own this experience on Go and I've seen videos of the Rift version. I'm extremely impressed with how Fallen Planet redesigned the mansion's layout for each platform. The Quest version's graphical upgrade from the Go is stellar with regard to its realistic visuals, at times sincerely reminding me of Resident Evil 7. Being able to interact with doors and a few objects adds to the immersion, and the sound design and music remain as strong as ever. It also employs some nice dynamic lighting. Over all, the experience induces a sense of dread, builds suspense, and pays off with some good startles!\n\nCons:\n\nI unfortunately found the graphics muddy in a few of the darker scenes, sometimes to the point that the scenery as a whole not only blurred but even seemed to slightly shift from side to side when I moved my head. There was also some occasional stuttering and a few unmotivated or unintended lighting sources.\n\nI greatly admire Fallen Planet Studio's accomplishment, and suspect that after a couple more tweaks Affected: The Manor will be a strong five stars!\n\nHelpful | 5\nDeveloper ResponseJul 10 at 4:19 PM\n\nThank you so much for your detailed review, we've just pushed an update with enhanced lighting so hopefully you like it. We've also just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "merrissa.sorrentinoFeb 11 at 6:13 PM\nSuper scary!!!\n\nI stood in the fetal position the whole time I was playing this game. Great way to scare your friends and family and have fun watching them get jump scared!\n\nHelpful | 0", "tveithDec 14 at 9:25 AM\nGreat so far ... needs control options\n\n**EDIT: The developers added a snap rotation option, which now makes this a 5 star experience! Thanks so very much for how fast you responded to this review. Very, very happy with the game controls and looking forward to playing a few more rounds without puking! I also really like how you replaced the hand prints on interactive items with the star - looks much better graphically and more in line with the theme of the game!**\n\nFinally, we have the Manor! I played one round and really enjoyed the interactions (picking up items, opening doors, etc) and some of the surprises that I hadn't seen in other versions. I've owned this experience for the GearVR, Go, PSVR, Vive, and now Quest. The Manor doesn't disappoint. Now for some feedback: I prefer holding the trigger over the joystick for movement, it is much more comfortable. Also, having played this game on five different devices, I can say that I've never experienced motion sickness -- until now. Using the right joystick to turn is making me want to vomit! Can you please add an option for quick 45 degree snaps instead of fluid locomotion turning? OMG I feel so sick!! Allowing some options for the controls - use the left trigger instead of the left joystick and snap turns instead of fluid locomotion, would make this game so much more comfortable. Finally, I really wish you could optimize the game a little bit more for the loading sequences -- when something really BIG is going to happen (i.e. a good jump scare), the game pauses / skips momentarily. I'm assuming this happens because the game is loading a large amount of data for the \"big reveal\". The problem is that when the game pauses or hesitates, I know there is going to be a jump scare. This kills the surprise and kills the immersion, and it happens quite a few times. Other than controls and issues with game loading, you guys have done a phenomenal job on this new version of the Manor. I really hope you come out with some new experiences soon.\n\nHelpful | 4", "AidonRossDec 20 at 9:23 AM\nMissed Opportunity\n\nAlthough, I would say this is the best horror game on the Quest right now I am still a little let down. You have created an amazing atmosphere and yet there are so many mised opportunities to scare. With covered statues, narrow hallways and creepy rooms you would think more would jump out to scare you. Heck even having someone appear behind you all of the sudden only to scare the crap out of you when you look back. I don't know, I feel like I'm in a haunted house and half the staff took the day off. All that being said, I still would recommend this title because it will still scare the crap out of you. I just left wanting more. Update this game with more characters and jump scares and you'd hit a home run.\n\nHelpful | 1", "cashxxDec 17 at 5:41 PM\nWas ok, but I think it could be better!\n\nYou walk through a house and things jump out at you. I didn't think it was that scary. It got me on one part! But seemed short over all, but there are various paths to take and different endings that I haven't experienced yet from what I have read. At one point you get a flashlight and that makes it feel more life like. I can't get past the blurriness on the Oculus Quest and think it ruins the experience and not the games fault. One problem I had was using the right joystick to spin, it gets blurry and makes my head spin and makes me nauseous. I found it easier to stop and turn my whole body to where I wanted to go. But, it's good to see the game made for the quest though and see the support and is worth the price to help the platform and give friends a scare to try VR out!\n\nHelpful | 2", "JericholisDec 23 at 8:48 AM\nOnly The Strong Will Survive\n\nThis game is beautifully made as far as details. Myself being a haunted house expert know what to expect when it comes to haunted houses, therefore this title didn't do much for me. This game offers a lot of jump scares and change in music to scare you but unfortunately there was not enough. The only interaction you have within this game is opening doors.\nDuring the middle of this game I got extremely sick due to the movement and sat down to finish it out due to me wanting to see it through to the end.\nOverall this game is awesome if you scare easily or looking for a enjoyable walk through.\n\nHelpful | 0", "carl.price.188Mar 27 at 1:54 AM\n\nVery dull and boring not a game more like a video\n\nHelpful | 0\nDeveloper ResponseJul 14 at 5:35 PM\n\nHi there, we're sorry this experience wasn't for you but we do our best in the description to explain what AFFECTED: The Manor is. We also have an update coming soon with a new game mode that will add more content replay value. Did you check out the free DLC called The Gauntlet?", "TCtribeFeb 27 at 7:04 PM\nAMAZING!!!!!!!!!!!!!!!!\n\nThis app is scary but so much fun. The graphics are phenomenal.\n\nHelpful | 0", "aspen907Jan 23 at 5:42 PM\nAwesome\n\nOmg this is terrifying my friend came over and we did virtual reality and I did this one for the first time! I screamed like 40 times. This is so awesome!\nI would love it if you made more haunted houses, it would be great!\n\nHelpful | 0", "drew.dowdy50Apr 22 at 4:52 PM\nIts an ok haunted experience\n\nIm usually a whimp when it comes to anything scary and was expecting to be reduced to a quivering mess by this experience. Sadly however, it was mainly just some jump scares spaced oddly kinda far apart. The biggest issue to me felt like the pacing was off. Dont get me wrong its still a little scary but I guess I just had much higher expectations.\n\nHelpful | 0", "nayhkilasMay 23 at 2:46 PM\nScary!!!!!\n\nWhat an experience. Me and my wife had to hug and hold each other while other was going through a house. Very scary one!\n\nHelpful | 0", "MrGoodApeDec 27 at 4:34 PM\nI like the game, but...\n\nI would like if the game had things like keys or other things in order to progress in the game. Again I like the game, its still good but I would just like it more if there a bit more to it and I really enjoyed scaring the crap out of my friends\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:27 PM\n\nThanks your review. We've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet! It features a scream-o-meter that rates the amount you scream during each run...great for scaring friends and loved ones!", "boombuskerMar 14 at 1:59 PM\n\nNot enough interaction. Very few wow moments, not scarry.\n\nHelpful | 1\nDeveloper ResponseJul 10 at 4:11 PM\n\nHi, we've just pushed free DLC to all owners of AFFECTED: The Manor, it's called The Gauntlet!", "Ratcatcher36Feb 20 at 7:30 AM\nA good game but keeps freezing\n\nA good game and the kids love it but it keeps freezing ever 2nd or 3rd game! Not sure what to do! Only new to vr\n\nHelpful | 0\nDeveloper ResponseFeb 24 at 2:51 AM\n\nThank you for your feedback. We will look into this as a priority. Also, your kids sound very cool! We have new updates coming soon that we're sure they will also love!", "steveyorkshirelad84Dec 21 at 5:15 PM\nIts a great experience not a game !\n\nIt is a great experience not a game , particularly if you are just wanting to get scared or show off VR to sone friends or family members.\n\nIt is a very short game and all you do is walk through a haunted house, however there is a couple of routes you can take .\n\nIt certainly makes you jump and has the hairs on your body stand on end but if you like puzzles to solve etc this isnt the game for you , however if you want to be scared and want things to make you jump then this is the game for you ! For the low price it is you will definitely get Callie for money ! Im not sure it has great replay value with it being short but Im sure more updates will follow leaving us all ready for more !\n\nHelpful | 10", "giulytheboyDec 14 at 11:08 AM\nNot a port but a brand new version!\n\nThis is a completely new experience, different from the PC version and from the GO version. And it is cross-buy with the Rift platform! Simply amazing!\nIf you don't know what Affected is, I think I could describe it as a long Horror Theme Park \"Attraction\". Your job in this game is just walk through this huge manor, and let the game scare the s--t out of you. In this particular version the developers renewed the manor completely, with new rooms, new situations, new jump scares and new paths to choose. They have even improved a bit the gameplay. Now you have virtual hands, and you can use them to open doors, and pick up a few objects. If you just want to be scared, or if you want to scare your friends, this game is simply perfect. BUT if you are looking for an horror game with a full storyline, and more complex mechanics, this is not the case.\n\nHelpful | 3", "CrusageApr 8 at 10:08 AM\nMultiplayer?\n\nIts a really good game, but there is always this one thing that keeps me from giving horror games top score. And that is there is no coop option. It seems that no one realizes how fun it would be to have a horror vr coop game.\n\nHelpful | 0", "MisterNewYorkJan 3 at 7:02 PM\nAmazing... Again!\n\nThis walk through gets better and better, they consistently refine it! I have bought this on every platform and I do it knowing that they never let me down. Just finished both doors and two paths from one of the doors with friends and family and had a blast. I have played this on the PC back when it was a 3 part walk through and hope they bring that all here for the quest! Keep up the amazing work and please bring the asylum, etc... to the quest.\n\nHelpful | 1", "XxSkizzorsxXMay 19 at 8:34 AM\nPlease make more affected games\n\nPlease developers make more affected games for quest I loved these games ever since they were on the oculus rift dk2 and dk1\n\nHelpful | 1", "jake_daviJan 2 at 6:04 PM\nA Terrifying VR Experience! (Amazing!)\n\nThis was my first horror experience on the Oculus Quest and oh my! I completely felt like I was there. The graphics and movements are top notch. The atmosphere really gives off the creepy vibe the game and developers want you to feel.\n\nEach room is filled with creepy things and the jump scares aren't just over in a flash, they keep you in your place for a good 10 + seconds! It's fair to say I was totally freaked out and even felt myself shaking at one point. I love horror and thriller movies, but this was something else. I played for 30 minutes and only half explored one section of many. MUST BUY! Thank you for the experience!\n\nHelpful | 1", "slickwilly1021Dec 13 at 10:15 PM\nDecent haunted house sim.\n\nLove horror games and the Quest needs more .This is much better than the Gear / Go version. Graphics are a mixed bag , textures range from really good to barely any on certain objects . But all in all the game is pretty detailed for the Quest . I would say it's a little on the pricey side for being such a linear game . I think if it was priced at $ 5 this would be a no brainer . If horror games are your thing , you should give it a look .\n\nHelpful | 0", "stupidearthlingJan 18 at 6:29 AM\nMotion sickness\n\nI simply couldn't play this game for more than 30 seconds without getting motion sickness.\n\nHope for an update with a teleportation movement. Until then it has to be a one star.\n\nHelpful | 6", "TheRedSharkJan 15 at 9:46 PM\nNice experience\n\nI wish the quality would be better, but other than that it is a good horror experience,\nperfect for scared the friends and family.\n\nHelpful | 0", "daniel_crkDec 25 at 4:52 PM\nBest horror experience on the Quest\n\nLike the title says, this is the best horror experience on the Quest, hands down. Id also like to argue its one of the best looking games on the platform as well. The audio is great (which is probably the most important aspect when it comes to horror), with great moody music and superb sound effects. The slow piano music at times even gave me resident evil vibes, which was awesome.\n\nThe game has some minor performance issues and generally lacks interactivity (would be awesome if you could pick up and examine books and other objects), but none of that really detracts from the pure dread this game puts you through.\n\nI would just like more of it! Horror in VR is still so underappreciated and I wish there would be more and bigger/longer titles like this.\n\nHelpful | 4", "Prydain10Dec 29 at 4:07 PM\nCreepy and a great horror game\n\nPrimarily got it just due to loving the Haunted Mansion and was not disappointed. Great little party game as well to see reactions of friends and family as they slowly go through the manor!\n\nOnly suggestion to the devs Id give is to try and solve the muddy ness issue in certain dark spots as other reviewers mentioned. Its not a deal breaker but would love if it could be fixed. Also the movement seems jittery at times if you get too close to things or sometimes when turning which can confuse you or cause headaches in the case of my brother when he tried it.\n\nOverall though I recommend it 100% to fans of walkthrough Haunted Houses and people who want something interesting to bring to game night.\n\nHelpful | 2", "gameingwithrykFeb 13 at 5:52 AM\nThis game\n\nThis game is sooo good I recommend it to anyone who likes scary games I love it\n\nHelpful | 1", "AlldayJoshJan 20 at 6:37 PM\nAwesome scare\n\nDid a great job with this itll definitely make u jump for sure. Its also great casting to the tv and watching your friends go thru it. Cant wait for the expansion to come out. Definitely a must buy.\n\nHelpful | 0", "techieman75Jan 29 at 8:30 PM\nGreat scare!\n\nWas the 1st game we purchased and enjoyed!\n\nHelpful | 0", "Knocker360Feb 2 at 6:56 AM\nHad to take the helmet off\n\nGreat scares, really creepy with proper jump out of your skin scares. Haunted house experience no guns, no puzzles but hella spooky.\n\nHelpful | 0", "AwakeOneJan 17 at 12:27 PM\nHorrible HORROR game\n\nThis was a total waste of my time. No originality. Nothing scary about it. A little girl and doll jumping at you every so often. Floating objects. Not scary. Dont waste your money on this one. Dreadhalls is WAY better than this.\n\nHelpful | 1", "dariusmusicDec 25 at 3:32 PM\nShort and sweet...\n\nThis is the shortest VR game Ive ever played. I honestly should have been offered for free. BUT for only $9.99 USD its almost worth it due to the fact that its a really nice scary game to show first time users or for people who dont handle horror to well. Its a nice fast scary walkthrough if youre looking for 20 minutes of fun. Do NOT expect anything like resident evil 7 VR though. Absolutely 0 replay value by yourself. If youre someone who takes your Quest over to peoples houses and/or lets other people try your Quest often, this is for you!\n\nHelpful | 5\nDeveloper ResponseJul 10 at 4:26 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet! Hopefully it offers a bit more replay value. We're still not RE7 though!", "wagnerstechtalkDec 16 at 11:27 AM\nHoly crap, it's scary!\n\nOK, I just went through the experience, keep in mind this is not a game! It is an experience, similar I guess to paying $20+ to enter a Haunted House on Halloween. However, this is one you can go through over and over again and watch your friends experience it too. My wife tried it and released a video review of her playing on my Wagner's TechTalk YT channel (link here: https://youtu.be/K3lk0DYTd-A ) It scared me and scared her too. You're going to enjoy this too as long as you understand, it's not a puzzle, it is not a game, it IS an experience.\n\nHelpful | 8\nDeveloper ResponseDec 14 at 10:33 PM\n\nThanks for your amazing review! We try hard to make sure we communicate that The Manor is an experience as that's how it should be...'enjoyed'! If you are able to share a video make sure you post it on one of our FB/Twitter, using The Manor to scare your loved ones is the best!", "SeanCBFeb 2 at 12:52 PM\nTo tame, not that scary at all\n\nI love Horror but this lacks any real moments of fright. Over way to quick and once the girl jumps in your face at the end, it is over. Boring and a waste of money that could be spent on something more entertaining.\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:15 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "Showeryset0806May 4 at 7:30 PM\nTerrible honestly\n\nI got this game for the Quest I got more nauseous than scared, really I wasn't scared at all. Bad jump scares pretty much every door you go through. The jump scares are also way to easy to expect. Don't buy this game, its a waste of money\n\nHelpful | 1\nDeveloper ResponseJul 14 at 5:34 PM\n\nHi there, we have just pushed an update with performance enhancements and free DLC called The Gauntlet, please check it out! What did you think of the free DLC called The Gauntlet?", "karen.wilbur.31Jan 14 at 6:23 PM\nAffected The Manor\n\nCreepy game lots to explore. I would highly recommend to horror fans. Don't play alone!\n\nHelpful | 0", "martin.nucJan 22 at 3:23 AM\nWell done but too straightforward\n\nThis game is truly well made. Very nice graphics and environment. BUT its very straightforward. I would expect puzzles and decision forks. But basically you go from one room to other.\n\nHelpful | 0", "kcrikDec 27 at 3:17 PM\nUncomfortably fun but short\n\nI wanted to find a good horror game on the Quest. Having done RE7 on PSVR, I wanted to find something similar. Unfortunately it doesn't deliver much besides a 20min long experience and not a game. Couple of available routes...but still not worth the price. Sorry\n\nHelpful | 3\nDeveloper ResponseJul 10 at 4:18 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "ian.johnston.908132Jan 22 at 1:08 AM\nGood game\n\nI did enjoy this game but in my opinion it would be nice to be able to interact with more things around you and make it a bit longer far to short few better scare scenes.\n\nHelpful | 0", "DebbyHarasenMay 17 at 4:52 PM\nTerrifying !\n\nIts sooo scary, but I love it. \n\nHelpful | 0", "THESCOTTishGamerDec 14 at 1:51 AM\nFan scary tastic\n\nI have now played this game on just about all the platforms available and alway highly recommend this to friends and family but the quest version has stepped up a gear as you can tell the developer has spent a lot of time listening and tweeking the game to its highest potential. So would highly recommend getting this game on your head set.\n\nHelpful | 3", "Wakeup_SunshineDec 12 at 11:37 AM\nBeen waiting for this game!\n\nRuns perfectly. I'm excited to watch my family get scared to death when I show them this game. That's actually the main reason I got it, not for myself, but to watch others play it.\n\nHelpful | 15\nDeveloper ResponseDec 13 at 4:29 AM\n\nThanks for the great review. We love that people share The Manor experience with their family and friends, even if it is just to watch them freak out!", "DoomPhantomDec 17 at 4:59 PM\nSimple and awesome\n\nThis game has been one of my favorite VR experiences ever since I first played it on psvr. Revisiting the title with the updates made for the quest has only made me have a even better experience with the game. Can't wait to see more from the devs and hopefully make many more horror experiences for us to enjoy into the future.\n\nHelpful | 0", "shashking404Dec 15 at 9:45 AM\na few bad things CAN'T ruin this!\n\ni came here to write a few issues i had with the game presentation and mechanics but then i think this Horror experience doesn't need any nitpicks (mainly mine). i own Layers of fear game on PC and this is the first VR horror experience that finally impressed me.\nStill, here are some trifle things i will put it out there:\n1) the game needs color filters or different color tinted lighting so that each area looks different\n2) be more generous on the collider sizes of the object walls and furniture because i wanted to look at objects closely but the colliders pushed me back. - that was nauseating feeling. just reduce the size of furniture even smaller.\n3) i wish i could turn flashlight On and Off by pressing any button. this freedom will give more immersion.\n4) finally, i wish you could make a procedural generated mode with set pieces for randomness. after every door you open, a new area comes randomly.\n\nA BIG THANK YOU to you, FallenPlanetVR for making an experience where i am not forced to hide inside closets or under bed.\n\nHelpful | 1", "ssully40Feb 29 at 1:57 PM\n\nCorny, not worth the money.\n\nHelpful | 1", "kingtravisFeb 11 at 1:45 PM\nScared A lot\n\nNo words. Amazing\n\nHelpful | 0", "Karaste3Dec 13 at 3:21 PM\nThe ideal game 2 show friends what VR is\n\nI had it on PSVR but here it's other game. The visuals are sharp the movement is great and with its freedom you walk around a true haunted house. It's a quite small experience and it's ideal to creep your friends out. The best 10 euros I spent in my life. Totally worth it... Best regards from Greece\n\nHelpful | 1", "thines68Dec 18 at 10:47 AM\nNot very interactive\n\nWhile I was excited to get this game, it is not very interactive. You cant really run away from danger and the only thing the player really chooses is which door to open or which direction to walk. If you could interact with more objects or run away, it would be much more fun. I dont even feel like it is a game and wish I hadnt bought it.\n\nThe idea and artwork are great. I think this could be a great game if changes are made.\n\nHelpful | 1", "RyanBaiDec 31 at 1:15 PM\nPlease dont waste money!!!\n\nI wrote a refund for this game and it wasnt approved, the game itself is very boring and predictable and lasted me around 30 minutes, it is very boring for a horror game, I recommend dreadhalls a cheaper and far scarier game, I wish that I had read a review like this one before I purchased it as I was very disappointed, if the game was 4 or less I wouldnt have cared but 8 for something that is over so quick, not to mention NO replay value whatsoever, if you are considering buying this please be prepared for dissatisfaction\n\nHelpful | 5\nDeveloper ResponseJul 10 at 4:17 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "x.wesley.xMar 31 at 10:17 PM\nDisturbing, Freightning, Spine-Chilling!\n\nIf you are into horror experiences, this one is for you. Dive in a horror night you will never forget. Great experience. Stop thinking, and buy it now.\nThis experience is mandatory item to your horror collection.\nThe manor awaits you.\n\nHelpful | 0", "Aro3891Dec 12 at 3:02 PM\nWoooow what an amazing horror experience\n\nI am impressed with this horror house, graphics are almost like PCVR level, so many details in the house, very scary enviroment. Great app to show friends and see them scream like little girls :)))) those with heart problems should not watch this.\n\nHelpful | 4\nDeveloper ResponseDec 13 at 4:18 PM\n\nThanks for the great review, scaring loved ones is the best!", "LouisObviouslyDec 13 at 1:32 PM\nDecent\n\nHorror games in VR are my favourite so I was excited to see this on the store. It's pretty good! The graphics are decent everything's pretty dark so I don't think it's too much hard work. I just don't think it's that scary! A few average jump scares and that's it really. Maybe it's because I'm not really scared by moving objects and satanic babies haha! Would have been nice to have been chased my a deformed creature or something.\n\nI just want to be scared! :(\n\nBut it's probably good to show your friends or family! Give it a go.\n\nHelpful | 1", "zack.slotkowskiDec 21 at 11:53 PM\nAmazing experience!\n\nThe game looks beautiful and my fianc got so scared that the headset flew right off her head! The quest did not get damaged at all but it is an awesome experience to watch friends/familys reactions lol.\n\nHelpful | 2", "Muddygirl64Jan 26 at 9:58 AM\nAffected the manor\n\nLove this game. Scared the crap out of me.\n\nHelpful | 0", "Homicide2632Dec 26 at 6:09 PM\nAmazing\n\nFor the price of the content it's amazing graphics are on point and game is terrifying.. Just buy it if you're on the fence about it. If you like hounted houses you'll love this\n\nHelpful | 1", "nancib20Jan 7 at 1:49 AM\n\nGood game makes you jump\n\nHelpful | 0", "mysterio770Dec 12 at 12:09 PM\nDefinitely got me jumping!\n\nSo far this has been awesome . Im only leaving three stars at this point because I havent gotten a chance to spend a lot of time in the game and I really want to be thorough and fair with my review. Im loving the scares Ive experienced so far and look forward to the rest of the journey. I will update my review Soon. Thank you for this experience guys.\n\nHelpful | 7\nDeveloper ResponseJul 10 at 4:23 PM\n\nWe've also just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet! Time to update your review?!", "imkindanewtothisshitFeb 13 at 5:48 AM\nNot really good\n\nBecause the game wasint what i exsepected\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:13 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "L_etrangerDec 12 at 7:08 PM\nAlright but you can't take a closer look\n\nEvery time you lean on something to get a closer a look and investigate this beautiful manor, your body get pushed away. It brakes the immersion and make me feel sick.\n\nHelpful | 10\nDeveloper ResponseDec 13 at 4:43 PM\n\nThank you for the feedback. What you have described is largely due to how your VR 'body' works, it actually is more like a cylinder from the HMD down that doesn't bend, so even when you feel like you are leaning, you aren't! You are just moving your whole 'body' forward and back, so this system prevents you from walking through walls or falling out of the map, but it also kicks in if you try to lean over an object. I hope that makes some sense! I have shown your comments to the devs though and they have tweaked this now because we do want you to look at the pictures! This update will be live soon so you should see some improvements next time you play. Also thank you for saying how beautiful The Manor is :)", "ScreekidMar 31 at 9:50 PM\nFREAKING LOVE IT\n\nBro! This game provided me with many jumpscares and I love the different endings! My mom ended up yelling at me I screamed so loud. I love this game and probably will never get bored\n\nHelpful | 0", "ANGERSNIPERDec 14 at 2:35 PM\nWear a Nappy/Diaper while playing\n\nMajor jump scares. Comes with a health warning and rightly so.\nProb best 7.99 I have paid on Quest so far.\n\nOnly issue is the strange push/forcefield when you get too close to objects. Slightly nauseating.\n\nHelpful | 2\nDeveloper ResponseDec 14 at 10:23 PM\n\nThank you for your feedback, getting the price point right was very important to us so it's great to hear that we did.", "abdullgweaaJan 23 at 2:54 AM\nGear VR version better this this Quest\n\nits not scary and very bad , iplay it on Gear VR before and it was best VR horror games .\nso sad :(\nwhy you change the Girl scream\n\nHelpful | 1", "anthony.merchant.100Jan 5 at 7:41 AM\nIm a wimp\n\nThe immersive aspect is so good, that I honestly couldnt make it past 30 minutes of play time. Its so scary lol\n\nHelpful | 0", "friah.ogawa.5Jan 9 at 8:02 PM\nGreat experience\n\nThis isn't a game,, more like a Vr experience, great for a demo for friends and family\n\nHelpful | 0", "Aaronb3434Dec 13 at 4:34 PM\nGreat\n\nLiked it on the gear vr and love it on the quest. I look forward to cool updates and maybe more rooms and locations added to the manor. if possible add some monsters, ghosts or other creepy bumps in the night.\n\nHelpful | 1", "bocurJan 2 at 4:07 PM\n\\_ (   )_/\n\nVer scary and amazing looking environment! Are you gonna do the Hospital and Carnival? If so when?\n\nHelpful | 2", "OrdinaryWorldDec 14 at 8:52 PM\nA little buggy and perhaps not my thing\n\nA reasonable price but apart from the occassional jump scare, the whole thing was a little dull for my liking. Maybe I'm too old and cynical to get this experience. I'm sure my teenage daughter would spend half the time with her eyes closed and I can see how this title might appeal to some. However, for something that's more of an interactive experience rather than a game, I thought there were simply too many bugs. The first one was an apparent lock-up just watching the tutorial. I had to bail out of the game and come back in again. Once in the game, in dark rooms, the scenery often had a strange vague black/brown quality with no definition and broke any kind of immersion. The flashlight beam sometimes works but at other times it disappears and I had to check if it was still illuminated, which it was. Then in one room early in the game (and with the flashlight) there seemed no way forward, just that vague scenery I mentioned. Then suddenly I was in a corridor, like I'd walked through a wall? No idea what happened? I don't know how long this experience lasts but I couldn't find a way to save progress and when I dropped back to the main menu and went back into the game, I was back at the start. Frustrating!\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:22 PM\n\nThank you so much for your detailed review, we've just pushed an update with enhanced performance and lighting, so hopefully you like it. We've also just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "jesseman144Dec 23 at 1:48 AM\nGood game!\n\nThis game is realy a good horror game.\nIt has good and hard sounds what make,s it scary.\nAlso you feel like you realy in there!\nIts a little short but worth picking up!.\n\nHelpful | 0", "nillu445Dec 25 at 6:06 PM\nPretty creepy\n\nIt was pretty creepy and i loved it\n\nHelpful | 1", "soulripper1Dec 15 at 6:08 AM\nREALLY\n\nI just red someone's review and thay sed they played for 2h how I only got 15 mins that's all It took to walk round the house nothing happens a couple of jump scares they were ok but that's it I'll wait for next chapter and hope its longer\n\nHelpful | 1\nDeveloper ResponseJul 10 at 4:20 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "DuckyforuDec 27 at 7:53 PM\nSpooky\n\nMy so got this game for himself but we were all watching and screaming it was very scary.\n\nHelpful | 2", "TurfyseaDec 23 at 7:00 AM\nNot really that worth it\n\nAlright so I expected since this game is very highly rated I would have enjoyed it, I expected jump scares and did not jump once. Don't get me wrong this game looks great but if anything I would want my money back.\n\nHelpful | 1\nDeveloper ResponseJul 10 at 4:18 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "75haggisJan 3 at 12:07 PM\nAffected:The Manor\n\nAbsolutely brilliant...Scared the hell out of me\n\nHelpful | 1", "dave.jackson.505Dec 20 at 7:43 PM\n\nI love it !!\n\nHelpful | 0", "Lil_Forrest_PumpDec 20 at 2:56 PM\nThis is so much fun\n\nI have never heard my real scream before. I am 60 210lb guy and this game made me lose it\n\nHelpful | 2", "ComeWhatMay666Mar 13 at 6:26 AM\nAGGHHHH!!!\n\nVery eerie atmosphere from the start. Good graphics. Seriously enjoying this. Appreciate all the little details and from the cheap scares to the serious scares! Every horror fans dream.\n\nHelpful | 0", "sundrytimesMar 28 at 9:17 PM\nScary as hell!\n\nIts a scary experience! A great game to test the nerve of your friends. Especially as an intro to VR.\n\nHelpful | 0", "MikeHawkinbalzzJan 3 at 4:03 PM\nGood scare\n\nScary. Good effects. But needs more content. Alot more.\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:16 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!", "SnowUseDec 19 at 6:57 AM\nCross buy!\n\nA must have for the Quest. Great to show friends. And it has touch controls now.\n\nHelpful | 2", "buzzin247Apr 6 at 6:43 PM\nWhy\n\nI wish the game was 5 not 8 way to much for this experience\n\nYes its a bit scary and way too short\n\nWaste of money\n\nHelpful | 0\nDeveloper ResponseJul 10 at 4:07 PM\n\nHey there, we just pushed an update with free DLC called The Gauntlet! Please check it out, hopefully you feel like it offers more value now.", "CaptainCorbinDec 26 at 2:08 PM\nAwesome but limited replay ability\n\nGreat game, super jump scares. Great price and well worth the purchase\n\nHelpful | 2", "DeathToTheNWODec 18 at 5:44 AM\nReally good fun\n\nA great VR experience... just dont let your gran play it!\n\nHelpful | 2", "EthanrritchieDec 30 at 4:35 PM\nLit asf\n\nPUrTy sPoOkY\n\nHelpful | 1", "Stone100Apr 24 at 4:35 PM\nDont waste your money\n\nNot scary not good at all.\n\nHelpful | 0", "chipp624Dec 15 at 8:55 AM\nAmazing\n\nActually scary with good graphics\n\nHelpful | 4", "allenwrench59Dec 14 at 4:23 PM\nVery Scary!!\n\nHaven't tried a different ? path what I heard.... But maybe I won't :) LOL\n\nHelpful | 1", "red.beard259Dec 25 at 10:20 AM\nScary\n\nDon't play alone..\n\nHelpful | 0", "Erica2875tvMar 19 at 6:53 PM\nAwesome ,great ,Awesome !\n\nThe jump scares are soo intense. I rate it a 10!\n\nHelpful | 0", "SPENGADec 16 at 8:35 PM\nIts not that scary\n\nIts kinda like watching a cheesy horror movie. You always wish there was more\n\nHelpful | 2\nDeveloper ResponseJul 10 at 4:18 PM\n\nWe've just given free DLC to all owners of AFFECTED: The Manor, a spooky speed run called The Gauntlet!"]