{"App Title": "Alcove", "App description": "A virtual home filled with endless experiences to discover and explore, a place to connect with loved ones. Casual games, world travel, media customization, relaxation, and adventure.\n\n- Invite your friends and family, and play games, share photos, upload and watch your own videos - standard, and 360, and step into them together\n- Travel to new places together and see the world: take a city tour, a hot air balloon ride, or a back-country road trip\n- Explore the depth of the ocean - go diving in the Great Barrier Reef of Australia, or swim with dolphins in the Pacific Ocean\n- Relax on a beach practicing guided meditation\n- Listen to classical music\n- Play with your virtual pet\n- Change your perspective from ocean to green meadow, to snowy mountains\n\nAlcove has something for everyone, no matter your age. Download Alcove and start exploring today!\n\nNote: Alcove will keep growing with new immersive experiences and features. Please leave us a note to let us know what youd love to see next.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User, Multiplayer, Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch, Hand Tracking", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Exploration, Social, Travel", "Languages": "English", "Version + Release Notes": "1.84", "Developer": "AARP Innovation Labs", "Publisher": "AARP Innovation Labs", "Website": "https://alcovevr.com/", "Release Date": "August 20, 2020", "Developer Privacy Policy": "Skip to content\nMENU\nJoinRenewHelpMember Benefits\nAARP Rewards\nRegister | Login\nSearch\nJoin\nRenew\nCollapse\nABOUT AARP\nOur Privacy Policy, Your Privacy Rights\nBoard of Directors\n Executive Team\n History\n Innovation\n Volunteer\n Careers\n Press\n Policies\n\nEffective February 5, 2018\n\nLast updated January 1, 2020\n(Note: this policy was revised to reflect certain updates in accordance with the California Consumer Privacy Act as of January 1, 2020)\n\nEn espaol|AARP is committed to maintaining your trust by respecting and protecting your privacy. This Privacy Policy describes why and how we collect, use,share,and protect personal data collected from and about members, volunteers, donors, program participants, job applicants, and others  both online and offline. It also explains your choices regarding how we share your personal data and communicate with you, how you can request access to and correction of your personal data, and other important considerations.\n\nCollection and Use\n\nWe collect and use personal data from or about you to help us support our non-profit mission and serve our membership. We collect such data in various ways, including data you provide to us, data we collect by automated means, and data we collect from other sources.\n\nSharing\n\nExcept as described in this Privacy Policy, we do not share your personal data with unaffiliated entities without your consent. We do share personal data with a limited number of Licensed Service Providers, which are unaffiliated entities that make available AARP-branded products or services and/or discounts to AARP members. These Licensed Service Providers are required to use the personal data only to offer, provide, maintain, and analyze the contracted products, services, or discounts.You can obtain a list of these Licensed Service Providers here.\n\nWe also occasionally share personal data with select, unaffiliated non-profit organizations for use in their own social missions.\n\nWe share personal data with vendors and social media networks we hire to provide services or perform business functions on our behalf, but these vendors are contractually required to treat the personal data AARP provides as confidential, and to use the personal data only to provide the services AARP has requested they perform on our behalf.\n\nFinally, we may share personal data pursuant to legal requirements, as necessary to protect ourselves, our members or others, or in connection with adirect or indirect reorganization process, such as a sale, merger, consolidation or bankruptcy.\n\nSecurity\n\nWe use administrative, technical, and physical security measures designed to protect personal data against accidental, unlawful, or unauthorized destruction, loss, alteration, access, disclosure, or use.\n\nChoice\n\nWe strive to provide you reasonable choices regarding our collection, use, and sharing of your personal data. We provide you access to review and correct your personal data, provide you options regarding how we share personal data with third-parties including AARP Licensed Service Providers and unaffiliated non-profit organizations, and provide you control over how we communicate with you, among other choices.\n\nYou may contact us at any time regarding these choices as follows:\n\nMessage us\nCall us at 888-OUR-AARP (888-687-2277)\nWrite to us at AARP Membership Center, 3200 E. Carson St., Lakewood, CA 90712\nMore Information\n\nPlease review the full Privacy Policy below for more complete details on how we collect, use, share, and protect your personal data, as well as the choices you have regarding our use and sharing of your personal data, along with other important considerations.Click on each heading below for details on the subject.\n\nChoice\n\nWe strive to provide you reasonable choices regarding our collection, use, and sharing of your personal data. We provide you access to review and correct your personal data, provide you options regarding how we share personal data with AARP Licensed Service Providers and unaffiliated non-profit organizations, and provide you control over how we communicate with you, among other choices.\n\nYou may contact us at any time regarding these choices as follows:\n\nEmail us atmember@aarp.org\nCall us at 888-OUR-AARP (888-687-2277)\nWrite to us at AARP Membership Center, 3200 E. Carson St., Lakewood, CA 90712\nMore Information\n\nPlease review the full Privacy Policy below for more complete details on how we collect, use, share, and protect your personal data, as well as the choices you have regarding our use and sharing of your personal data, along with other important considerations.Click on each heading below for details on the subject.\n\nWhat This Privacy Policy Covers\nWhy We Collect and How We Use Personal Data\nHow We Collect Personal Data\n\nData You Provide\n\nData We Collect by Automated Means\n\nData We Collect From Other Sources\n\nData We Combine\n\nHow We Share Personal Data\nHow We Protect Personal Data\nYour Personal Data Choices\n\nPersonal Data Access\n\nPersonal Data Sharing\n\nAARP Communications\n\nManaging Cookies\n\nThird-Party Analytics\n\nTargeted Advertising\n\nLocation Data\n\nContact Us\n\nYour California Privacy Rights\nOther Important Considerations\n\nDo Not Track\n\nLinks to Other Websites\n\nSocial Media\n\nUS-Based Organization\n\nChildren\n\nUpdates\n\nAARP is a nonprofit, nonpartisan organization that empowers people to choose how they live as they age.\n\nAbout AARP\nAARP Press Center\nCareers at AARP\nMembership\nContact Us\nEn Espaol\nAARP \nVeterans Resources\nMy Community Page\nHelp\n\t\nThe Daily\n\nStart each day with news you can use. From health and money to politics and entertainment, this is your complete source to stay in the know.\n\nSUBSCRIBE\nView Sample NewsletterPrivacy Policy\nMEMBERSHIP\nJoin\nRenew\nMember Benefits\nPrint Your Card\nUpdate Your Info\nCancel\nMEMBER BENEFITS\nMember Benefits\nDownload PDF of Benefits\nAARP Auto Buying Program\nHot Deals\nDISRUPT AGING\nHome\nWhat We're About\nStories\nBook\nCOMMUNITIES\nAsian Community\nBlack Community\nHispanic Community\nLGBTQ Community\nNative American Community\nINFORMATION FOR YOU\nAARP In Your City\nAARP In Your State\nDriver Safety\nFighting For Your Health\nFraud Watch Network\nGovernment Watch\nTax Aide\nWhere AARP Stands\nAARP FOUNDATION\nDonate\nHousing\nHunger\nIncome\nIsolation\nLegal Advocacy\nPlanned Giving\nFOR PROFESSIONALS\nAARP International\nAARP Livable Communities\nAARP Services\nAdvertise with AARP\nNational Retired Teachers Association\nPress Center\nPublic Policy\nPublic Policy Institute\nResearch\nHEALTH & WELLNESS\nConditions & Treatments\nHealthy Living\nHealth Insurance\nStaying Sharp\nSOCIAL SECURITY & MEDICARE\nMedicare Resource Center\nMedicare Q&A\nSocial Security Benefits Calculator\nSocial Security Resource Center\nSocial Security Q&A\nFAMILY CAREGIVING\nLocal Resources and Solutions\nLong-Term Care Calculator\nCaregiving Q&A\nWORK & JOBS\nJob Searching Tips\nAARP Job Board\nWorking at 50+\nCareer Change\nStart a Business\nAARP Resume Advisor\nTAKE ACTION\nBe an E-Advocate\nCreate the Good\nDonate\nExperience Corps\nAARP Events\nTools\nVolunteer\nChapter Locator\nHAVE FUN\nEntertainment\nGames\nQuizzes\nSweepstakes\nTravel\nREAD, WATCH, LISTEN\nAARP Bookstore\nAARP Bulletin\nAARP The Magazine\nBlog\nEvents\nPodcasts\nVideos\nSitemap RSS Privacy Policy Terms of Service AARP Rewards Terms and Conditions Copyright Information Ad Choices Do Not Sell My Personal Information Your California Privacy Rights Sitemap", "Developer Terms of Service": "Skip to content\nMENU\nJoinRenewHelpMember Benefits\nAARP Rewards\nRegister | Login\nSearch\nJoin\nRenew\nABOUT AARP\nAARP Terms of Service\nBoard of Directors\n Executive Team\n History\n Innovation\n Volunteer\n Careers\n Press\n Policies\n1. General\n\nThis Web site or mobile application (referred to herein as the Site for ease of reference) is owned and operated by AARP or an AARP subsidiary or affiliate, collectively we, us, or AARP. Accessing the Site, in any manner, whether automated or otherwise, constitutes use of the Site, and your agreement to be bound by these Terms of Service. By using the Site, you agree to use the Site in accordance with these Terms of Service, our Privacy Policy, and any additional terms and conditions that may apply to specific sections of the Site or to products and services available on or through the Site.\n\nWe reserve the right to modify these Terms of Service at any time, in which case the revised Terms of Service will appear on the Site. Continued use of the Site after we post any such changes will constitute your acceptance of the Terms of Service, as modified.\n\n2. Intellectual Property Rights\n\n(A)AARPs Limited License to You. This Site and all the materials contained on it are our property and/or the property of our affiliates or licensors, and are protected by copyright, trademark, and other intellectual property laws. We provide the Site for personal noncommercial use only. You may only use this Site and the materials on it as authorized by us. You may not use this Site or the materials on it in any manner that violates the privacy rights, publicity rights, copyrights, trademark rights, patent rights, contract rights, or any other rights belonging to us or a third party. We reserve the right, at any time and without notice, to suspend, cancel, or terminate your right to use the Site (or any portion of the Site) for violation (whether repeated or not) of copyrights or any other rights belonging to us or a third party. Unless authorized in these Terms of Service or by the owner of the materials, you may not modify, copy, reproduce, republish, upload, post, transmit, translate, sell, create derivative works, exploit, or distribute in any manner or medium (including by e-mail or other electronic means) any material from the Site. Information about permission to reproduce or distribute materials from the Site can be obtained by completing this form.\n\n(B)Your License to AARP. By posting or submitting any material (including, without limitation, text, photos, and videos) to the Site, you represent and warrant: (i) that you are the owner of the material, or that the owner of the material has consented to your use; and (ii) that you are 13 years old or older. You will be solely responsible for any damages resulting from any infringement of copyrights, proprietary rights, or any other harm resulting from any uploading, posting, or submission.\n\nWhen you submit or post material, you grant to us the royalty-free, perpetual, irrevocable, non-exclusive right and license to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, perform, and display it (in whole or in part) worldwide and/or to incorporate it in other works in any form, media, or technology. This grant shall include the right to exploit any proprietary rights in any such material. You also grant us, and anyone authorized by us, the right to identify you as the author of any of your postings or submissions by name, e-mail address, or Member name, as we deem appropriate.\n\n(C)Notice of Copyright Infringement. If you are a copyright owner who believes your copyrighted material has been reproduced, posted, or distributed via the Site in a manner that constitutes copyright infringement, please report the violation to our designated copyright agent by sending written notice by U.S. Mail to AARP, 601 E Street, N.W., Washington, D.C. 20049, Attn: AARP Brand Protection, or by email toAARPBrandProtection@aarp.org.Please note that the contact information provided in this paragraph should only be used for reporting suspected copyright infringement. Contact information for other matters is provided elsewhere in these Terms of Service or on the Site.\n\nPlease include the following information in your written notice:\n(1) a detailed description of the copyrighted work that is allegedly infringed;\n(2) a description of the location of the allegedly infringing material on the Site;\n(3) your contact information, including your address, telephone number, and, if available, e-mail address;\n(4) your statement that you have a good-faith belief that the allegedly infringing use is not authorized by the copyright owner, its agent, or the law;\n(5) your statement, made under penalty of perjury, affirming that the information in your notice is accurate and that you are authorized to act on the copyright owners behalf; and\n(6) an electronic or physical signature of the copyright owner or someone authorized on the owners behalf to assert infringement of copyright and to submit the statement.\n\n(D)Restrictions on Linking and Framing. You may establish a hypertext link to the Site, provided that the link does not state or imply any sponsorship of your site by AARP. However, you may not frame or inline link to any of the content of the Site, or incorporate into another Web site or other service any of our material or intellectual property without the written permission of AARP.\n\n3. Message Boards and Other Interactive Features\n\nThis Site may include interactive features, including, but not limited to, message boards, web logs, e-mail services, and areas that allow uploading of user-generated content (the Interactive Features). You are responsible for any material that you post on message boards or provide through any other Interactive Features on the Site. We do not control the messages, information, or files that you or others may provide through the Site. This Site, including its Interactive Features, shall be used for lawful purposes only; you shall not:\n\nEngage in any conduct that, in our sole judgment, restricts or inhibits any other user from using or enjoying the Site.\n\nPost or transmit any material that violates our rights or the rights of others, including, without limitation, privacy rights, publicity rights, copyrights, trademark rights, patent rights, contract rights, or any other right.\n\nUse the Site to impersonate any person or entity, or falsely state or otherwise misrepresent your affiliation with a person or entity.\nInterfere with or disrupt any servers or networks used to provide the Site or its features, or disobey any requirements, procedures, policies, or regulations of the networks we use to provide the Site.\n\nUse the Site in an unlawful, threatening, or abusive manner, including without limitation, to promote racism, bigotry, hatred, or physical harm of any kind against any group or individual.\n\nGain unauthorized access to the Site, or any account, computer system, or network connected to this Site, by means such as hacking, password mining, or other illicit means.\n\nObtain or attempt to obtain any materials or information not intentionally made available through this Site.\n\nUse the Site to post or transmit any vulgar, obscene, or otherwise objectionable information of any kind, including without limitation, any transmissions that encourage conduct that would constitute a criminal offense, give rise to civil liability, or otherwise violate any law.\n\nUse the Site to post or transmit any information, software, or other material that contains a virus or other harmful component.\n\nUse the Site to post, transmit, or in any way exploit any information, software, or other material for commercial purposes, or that contains advertising.\n\nEngage in advertising or commercial solicitation of any product or service, or to solicit donations of any kind on the Site, without our written consent.\nGather for marketing purposes any e-mail addresses or other personal information that has been posted by other users of the Site.\n\nWe shall have the right, but no obligation, to monitor the content of the message boards or other Interactive Features to determine compliance with this Agreement and any other operating rules we establish. We shall have the right in our sole discretion to edit, refuse to post, or remove any material submitted to or posted on the message boards or other Interactive Features of the Site. Notwithstanding this right, users shall remain solely responsible for the content of their messages. We neither endorse nor are responsible for the accuracy or reliability of any opinion, advice, or statement on the message boards or other Interactive Features of the Site, whether it is provided by us, our employees, or a third party. Under no circumstances will we be liable for any loss or damage of any kind caused by reliance on information obtained through postings on the message boards or other Interactive Features of the Site. We are not responsible for any offensive, defamatory, or obscene posting made on the message boards or other Interactive Features of the Site. We reserve the right at all times to disclose any information we believe necessary to satisfy any law, regulation, or governmental request, or to refuse to post or to remove any information or materials, in whole or in part, that in our sole discretion are inappropriate, objectionable or in violation of these Terms of Service. We also reserve the right to deny access to the Site or any features of the Site to anyone who violates these Terms of Service, or who, in our sole judgment, interferes with the ability of others to enjoy our Web site or infringes the rights of others. Neither we nor any third-party content provider shall assume or have any liability for any action or inaction by us or any third-party content provider with respect to any conduct, communication, or posting on the message boards or other Interactive Features of the Site.\n\n4. Registration and Passwords\n\nTo access certain features of the Site, we may ask you to provide personally identifiable information such as your name, e-mail address, ZIP code, anddate of birth.You will provide true, accurate, current, and complete information about yourself for any registration form located on the Site. If we suspect that information you provide is untrue, inaccurate, or incomplete, we may, in our sole discretion, suspend or terminate your account and refuse all current or future use of the Site. Our use of any personally identifiable information you provide to us as part of the registration process is governed by the terms of our Privacy Policy.\n\nYou may need a username and password to use certain features of the Site. By registering on the Site, you agree that you will not (i) select or use a username or e-mail address of another person with the intent to impersonate that person; (ii) use a username or e-mail address subject to the rights of any person without authorization; (iii) use a username in violation of the intellectual property rights of any person; or (iv) use a username that we, in our sole discretion, deem inappropriate or offensive. You are responsible for maintaining the confidentiality of the password and account, and are responsible for all activities (whether by you or by others) that occur under your password or account. You will notify us immediately of any unauthorized use of your password or account or any other breach of security. We assume no liability for any loss or damage arising from any unauthorized use of your password or account by a third party.\n\nUse of Directories\n\nThe information contained in any directories that may be provided on the Site is provided for visitor information only and is not to be used for marketing or telemarketing applications. This information may not be copied or redistributed and is provided AS IS without warranty of any kind. Neither we, nor our suppliers, will be liable in any way with regard to such information.\n\n5. Disclaimers\n\nThe Site may provide links to Web sites maintained by third parties. Any information, products, software, or services provided on or through third-party sites are controlled by the operators of such sites and not by us or our subsidiary companies. When you access these third-party sites, you do so at your own risk.\n\nTHE INFORMATION, PRODUCTS AND SERVICES OFFERED ON OR THROUGH THE SITE ARE PROVIDED AS IS AND WITHOUT WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED. TO THE FULLEST EXTENT PERMISSIBLE PURSUANT TO APPLICABLE LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nWE DO NOT WARRANT THAT THE SITE OR ANY OF ITS FUNCTIONS WILL BE UNINTERRUPTED OR ERROR FREE, THAT DEFECTS WILL BE CORRECTED, OR THAT ANY PART OF THIS SITE, INCLUDING MESSAGE BOARDS, OR THE SERVERS THAT MAKE THE SITE AVAILABLE, ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. WE EXPRESSLY DISCLAIM LIABILITY FOR ANY DAMAGES OR INJURY CAUSED BY ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECT, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUS, COMMUNICATION LINE FAILURE, THEFT OR DESTRUCTION OR UNAUTHORIZED ACCESS TO, ALTERATION OF, OR USE OF RECORD, WHETHER FOR BREACH OF CONTRACT, TORTIOUS BEHAVIOR, NEGLIGENCE, OR UNDER ANY OTHER CAUSE OF ACTION. EACH USER SPECIFICALLY ACKNOWLEDGES THAT WE ARE NOT LIABLE FOR THE DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF OTHER THIRD PARTIES, SUBSCRIBERS, MEMBERS OR OTHER USERS OF THE MESSAGE BOARDS AND THAT THE RISK OF INJURY FROM THE FOREGOING RESTS ENTIRELY WITH EACH USER.\n\nWE DO NOT MAKE ANY REPRESENTATIONS OR WARRANTIES ABOUT THE CORRECTNESS, ACCURACY, TIMELINESS, OR RELIABILITY OF THIS SITE OR THIRD-PARTY SITES. USE OF ANY INFORMATION ON THE SITE OR THIRD-PARTY SITES IS AT THE USERS OWN RISK. UNDER NO CIRCUMSTANCES WILL WE BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY RELIANCE ON INFORMATION OBTAINED THROUGH THE SITE.\n\nYou must provide and are solely responsible for all hardware and/or software necessary to access the Site. You assume the entire cost of and responsibility for any damage to, and all necessary maintenance, repair or correction of, that hardware and/or software.\n\nAny financial information provided on the Site is for informational purposes only, and is not intended for trading or investing purposes, or for commercial use. The Site should not be used in any high-risk activities where damage or injury to persons, property, environment, finances, or business may result if an error occurs. You assume any and all risk for your use of financial information provided on the Site.\n\nNonpartisan Organization\n\nAARP is a nonprofit, nonpartisan organization that helps people 50+ have independence, choice, and control in ways that are beneficial and affordable to them and society as a whole. AARP does not endorse, support, or oppose political candidates or parties, and does not have a PAC.\n\n6. Third-Party Sites\n\nCertain sections of the Site may provide links to sites of third parties, where you may be able to purchase online many different types of products and services that are provided by third parties. We are not responsible for the quality, accuracy, timeliness, reliability, or any other aspect of any product or service offered or provided by a third party. If you make a purchase from a merchant on a site linked to by the Site, the information obtained during your visit to that merchants online store or site, and the information that you give as part of the transaction, such as your credit card number and contact information, may be collected by the merchant. A merchant that offers or sells products or services through the Site may have privacy and data collection practices that are different from ours. We have no responsibility or liability for these independent policies.For more information about a merchant, its online store, its privacy policies, and/or any additional terms and conditions that may apply, visit that merchants Web site and click on its information links or contact the merchant directly. You agree that neither we nor our affiliates are responsible for any damages that you incur, and you will not assert any claims against us or them, arising from your purchase or use of any products or services made available by third parties through the Site.\n\n7. Limitation of Liability\n\nUNDER NO CIRCUMSTANCES, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE, SHALL WE, OUR SUBSIDIARY COMPANIES, OR AFFILIATES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES THAT RESULT FROM THE USE OF, OR THE INABILITY TO USE, THE SITE, INCLUDING ITS MATERIALS, PRODUCTS, OR SERVICES, OR THIRD-PARTY MATERIALS, PRODUCTS, OR SERVICES MADE AVAILABLE THROUGH THE SITE, EVEN IF WE ARE ADVISED BEFOREHAND OF THE POSSIBILITY OF SUCH DAMAGES. (BECAUSE SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN CATEGORIES OF DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IN SUCH STATES, OUR LIABILITY AND THE LIABILITY OF OUR SUBSIDIARY COMPANIES OR AFFILIATES IS LIMITED TO THE GREATEST EXTENT THAT IT CAN BE LIMITED UNDER SUCH STATE LAW.)\n\nIN NO EVENT WILL WE OR ANY PERSON OR ENTITY INVOLVED IN CREATING, PRODUCING OR DISTRIBUTING THE SITE OR RELATED ONLINE SERVICES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF OR INABILITY TO USE THE MESSAGE BOARDS OR OTHER INTERACTIVE FEATURES, OR OUT OF THE BREACH OF ANY WARRANTY.\n\nIF YOU ARE DISSATISFIED WITH THE SITE, ANY MATERIALS, PRODUCTS, OR SERVICES ON THE SITE, OR WITH ANY OF THE SITES TERMS AND CONDITIONS, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE SITE.\n\nAARP is a nonprofit, nonpartisan organization that empowers people to choose how they live as they age.\n\nAbout AARP\nAARP Press Center\nCareers at AARP\nMembership\nContact Us\nEn Espaol\nAARP \nVeterans Resources\nMy Community Page\nHelp\n\t\nThe Daily\n\nStart each day with news you can use. From health and money to politics and entertainment, this is your complete source to stay in the know.\n\nSUBSCRIBE\nView Sample NewsletterPrivacy Policy\nMEMBERSHIP\nJoin\nRenew\nMember Benefits\nPrint Your Card\nUpdate Your Info\nCancel\nMEMBER BENEFITS\nMember Benefits\nDownload PDF of Benefits\nAARP Auto Buying Program\nHot Deals\nDISRUPT AGING\nHome\nWhat We're About\nStories\nBook\nCOMMUNITIES\nAsian Community\nBlack Community\nHispanic Community\nLGBTQ Community\nNative American Community\nINFORMATION FOR YOU\nAARP In Your City\nAARP In Your State\nDriver Safety\nFighting For Your Health\nFraud Watch Network\nGovernment Watch\nTax Aide\nWhere AARP Stands\nAARP FOUNDATION\nDonate\nHousing\nHunger\nIncome\nIsolation\nLegal Advocacy\nPlanned Giving\nFOR PROFESSIONALS\nAARP International\nAARP Livable Communities\nAARP Services\nAdvertise with AARP\nNational Retired Teachers Association\nPress Center\nPublic Policy\nPublic Policy Institute\nResearch\nHEALTH & WELLNESS\nConditions & Treatments\nHealthy Living\nHealth Insurance\nStaying Sharp\nSOCIAL SECURITY & MEDICARE\nMedicare Resource Center\nMedicare Q&A\nSocial Security Benefits Calculator\nSocial Security Resource Center\nSocial Security Q&A\nFAMILY CAREGIVING\nLocal Resources and Solutions\nLong-Term Care Calculator\nCaregiving Q&A\nWORK & JOBS\nJob Searching Tips\nAARP Job Board\nWorking at 50+\nCareer Change\nStart a Business\nAARP Resume Advisor\nTAKE ACTION\nBe an E-Advocate\nCreate the Good\nDonate\nExperience Corps\nAARP Events\nTools\nVolunteer\nChapter Locator\nHAVE FUN\nEntertainment\nGames\nQuizzes\nSweepstakes\nTravel\nREAD, WATCH, LISTEN\nAARP Bookstore\nAARP Bulletin\nAARP The Magazine\nBlog\nEvents\nPodcasts\nVideos\nSitemap RSS Privacy Policy Terms of Service AARP Rewards Terms and Conditions Copyright Information Ad Choices Do Not Sell My Personal Information Your California Privacy Rights Sitemap", "Space Required": "602.0 MB"}



["5 stars\n38%\n4 stars\n34%\n3 stars\n17%\n2 stars\n5%\n1 star\n6%", "Mr_Trinidad4 days ago\nWow!!!!\n\nJust had my mind blown by Alcove. It was really fun finding all the interactions and then learning that you can share most or if not all of them with multiple people in the same party. This was truly a special experience.\n\nI only have one issue with this game .... Why does everything seemed to be aimed at older people ? (AARP)\nThe workouts, the media on the television, the magazines......JUST LOL. Aside from that everything else is absolutely perfect and I really want to see YouTube/Netflix integration with that television in the living room.\nSeriously Devs. you have given us a very powerful and much needed tool.\n\n\nP.S. a stereo would be nice to set the mood \n\nHelpful | 48", "Ellzad4 days ago\nGreat start with upside potential\n\nReally liked this at first use. The travel room has some great stuff to work through. Hope content continually gets added. Downside is the lack of YouTube integration with the TV. Content is limited and without external feeds it will be almost useless and don't want to fool with uploading my own videos. Also would be nice to be able to play music so add a stereo or boombox connected to Pandora or Spotify. Finally, hoping some more locations like a pine tree forest are added. Nice start!\n\nHelpful | 12", "UrGamingTechie4 days ago\nTons of potential\n\nTons of potential in this, I really hope they keep adding fresh content. I think it severely needs better games to play with multiple people at the table, some more board games and card games would be great. Also some other ways to watch content on the tv.\n\nBe great if the tv continued playing while sitting at the table playing games to and still hear it.\n\nGreat quality and content on the bus and car expirrences in this app to work the 360 video.\n\nGreat potential with this I hope the devs keep adding more content.\n\nHelpful | 8", "Realm184 days ago\nSuggestions\n\nI'd really like a way to edit the rules of some of the games. Like checkers so the players could choose whether they had to make a capture or not.\nI'd also like a way to hide the buttons to change the environment as that would make the view much better.\nI dont know if its fully possible, but I would also like to walk around the enviornment. An option for standing or sitting would be good as well.\n\nHelpful | 4", "Congratulations3 days ago\nI can see why people like these apps.\n\nIts social network for you and family or friends, I like the idea you can add pictures or videos to this app tho Im not sure of privacy features. I can find a lot of ideas to add in the future etc.\n\n1) A canvas so I can or draw then add to pictures of the wall. Quick and easy like a art room to show your art?\n\n2) Travel why not add space exploration?\n\n3) A study when you can read books and learn. like you can pick a book from a library.\n\nThese are some suggestions.\n\nHelpful | 3\nDeveloper Response3 days ago\n\nThank you so much for the kind words and for the wonderful suggestions! Wrt pictures and videos you upload, please rest assured that your data and media assets are secure with us, governed by the Privacy Policy linked on the app page. When in VR, only you can see your own media in Alcove, as well as your guests - people that you invite to join you in Your Alcove. When you are invited to someone else's Alcove, you will see their photos and videos. As for the suggestions, we are adding them right away to our list for further development! Please keep us posted if there's anything else you'd love to see in Alcove. Very Best, Team Alcove", "Aaronb34344 days ago\nCool\n\nI love it! Is it possible to add a night city and suburban neighborhood environments? I was also thinking if possible too if a 2nd alcove home could be added like a luxury home or condo? maybe make more rooms accessable and a radio should be added for uploading music or a music service like SoundCloud or Spotify. YouTube etc intergration should be added as well. other than that it haves great promise.\n\nHelpful | 6", "RayAllenTaylor2 days ago\nGreat start, waiting for ...\n\n... even more !\nLove the Appartment.\nBut did you know? Most families only have one quest (if at all), and most quest people are single ...\nWhy not add a town hall or some kind of shared space for all alcove users ?\n\nMaking it my own space would be even more I retesting, if I could share it with others....\n\nAlso it would be nice to have the possibility to change the user hight. It seems that there is no hight ejustment if one is playing sitting.\n\nLooking forward to seeing where this is going \n\nHelpful | 5", "kristin.sherwood54 days ago\nGreat concept\n\nI've been enjoying exploring this space. I'm still waiting for family members to get a Quest so I haven't been able to try out the family features yet, but I love that aspect of it. One thing that I would like is the ability to adjust one's height - to specify if we're sitting or standing. Right now I can't see high enough to play checkers when I'm sitting down in real life. I'd also love to see some more interactive board games to play with friends and family.\n\nHelpful | 2", "samanthagwolfe4 days ago\nGreat app!\n\nFinally an intuitive experience for people who know VR and those who are just learning. Love the follow me option! Cant wait to see all the new experiences that are going to launch in Alcove!\n\nHelpful | 14", "Shamar204 days ago\nNice , much potential but glitchy for m\n\nVery nice. But the hour I spent exploring had several moments of weird glitches that were frustrating. The coral reef from the wall pictures all froze up on me after buffering a long time . I didnt see the dog someone referred to. Im sitting down and the table and checkers was impossible to play as they were way to high. I would have to be standing up to do that. Disappointed in that. The glowing globe was really glitching, like it was jittering and then took on a mind of its own and went crazy.\nI joined WANDER which was nice. The sights were nice. I feel once the glitches and bugs are gone it will be a pleasant experience. Ill try again later tonight. I have no clue what my avatar looks like.\n\nHelpful | 4", "jobbie1kinobi20 hours ago\nGreat app, hand tracking an issue though\n\nThis app is fantastic, I have it on both the Go and the Quest and its just a beautifully realised virtual space filled with lots of fun and absorbing content to enjoy on your own or share with others. The travel stuff in particular is excellent, particularly the virtual tour bus which is in full 360 3D as opposed to some of the other content which is disappointingly flat. However the one thing which really spoils the immersiveness is hand tracking. In theory hand tracking is a good thing but the way it is realised here is incredibly irritating. I havent been able to successfully complete anything without the hand tracking kicking in and exiting me out! The only way Ive found is to sit with your hands behind your back because as soon as the controllers go to sleep, the app sees your hands and brings up a pointer which exits the current video. Not an issue with the Go so I tend to just use this on the Go now as its annoying enough to render the Quest version unusable. Still a solid 4/5 app but the hand tracking needs looked at urgently.\n\nHelpful | 0", "The_Werdolf4 days ago\nVery well done and a lot of potential\n\nThis is amazing, I really love the 360 videos and the big flat screen in the living room. It would be great to have YouTube and a browser on it (giving you unlimited content), or imagine watching Netflix or Amazon Prime Video with your family and friends at the same time while hundreds of kilometers apart. Also an audio player for local stored mp3 would make it more complete. What about adding more environments? Don't get me wrong, it's a class of it's own and stand's out in many ways, but on the other hand I see it could be even better with more content from various sources\n\nHelpful | 1", "AngelSimmer644 days ago\nThis was so well thought out!\n\nYou can really see the care and detail in this game, honestly Im amazed! The meditation sessions on the beach really helped calm my anxiety which is hard to do with a disorder so that shows just how good this is! All the videos and games and just... this is amazing honestly I cant wait to see what you add to this because I am a very very happy player, honestly thank you for making such and amazing and calming app.\n\nHelpful | 3", "RogueWolfe4 days ago\nUnderwhelming\n\nI was very excited to try this, to have a customised home in VR.\nI spent minutes trying to put a picture on the wall, because I had to click a button in my peripheral vision, as the button moved with the frame if I tried to look at it.. Only to find out, I'd need to upload the pictures to a website first.\nSame with videos.. Instead of just having the ability to use YouTube or Twitch for media watching.\n\nThe allegedly voice controlled pet is apparently deaf, as it doesn't react to me at all.. (Must also be blind and unable to smell anything as I tried to feed it for half an hour)\n\n\nThere's a lot of potential here. It just isn't ready yet.\nI'll keep checking in over time because I want to like this.\n\nHelpful | 5\nDeveloper Response4 days ago\n\nRogueWolfe, We are glad to hear you were excited to try it out, and as we further evolve Alcove, we hope to meet your expectations. To upload pictures and videos you can visit alcove.rendever.com and link your Oculus account. We opted for this approach in order to allow for max flexibility in adding your own media files, but we are open to suggestions on how we could make the process easier for you. We will certainly add your feedback to our list for future development. Wrt to the pet bunny, sorry to hear you had issues it, and thanks for flagging. One question that comes to mind is - have you enabled the microphone at the app level? We will look into it either way, and we hope you can communicate well with it soon. If you'd like to connect further, you can reach out to us at feedback@alcovevr.com. In the meantime, we hope you enjoy some of the other content available in Alcove - like checkers, the other mini-games, the wellness room content, and virtual travel. Very best, Team Alcove", "msilent3 days ago\nThis is going to give Tough Competition\n\nAbsolutely amazing piece of work by the creators. i believe this app is going to beat the big screen due to the travelling and exploring the environment and interacting with objects while partying with other. I am sure developer must be working on the integration of youtube and video player, netflix other stuff like that.\n\nAlso i would love to see random people joining with us in our room instead of adding or inviting our friends.\n\nTravel the world and exploration area is also well created and loved to see the result of the videos already present there.\n\nOverall great job by the team.\n\n\n\nHelpful | 2\nDeveloper Response3 days ago\n\nThank you so much for the kind words, we are thrilled to hear that you are enjoying Alcove! Many others have asked about a YouTube integration, and while it might not happen very very soon, we will certainly add it to our list, along with all the other great ideas and suggestions! Definitely please stay tuned for updates. Very best, Team Alcove", "Bender_21127 hours ago\nMe likes it.\n\nIve spent a week using Alcove now and its really amazing. The travel room is cool being able to go all over the world via virtual bus, hot air ballon, car, etc. I particularly like the road trip experience in USA. It would be nice if the videos were longer though. My other fav is the meditation room where you can chill on the beach or Utah desert practicing my breathing. Hope to see more locations like Hawaii or Iceland. Again, a longer experience would be nice. Havent tried the social features yet but it looks promising.\n\nHelpful | 1", "jkaz043 days ago\nWow!\n\nThis game has a beautiful scenery and the ocean is my favorite one. The hand tracking is great but it still has some flaw. When they mean virtual home, they mean it. The activities keep closing on me when I select one and the games only work. When I am stress, this will calm me down. Good job at making this game.\n\nHelpful | 1\nDeveloper Response3 days ago\n\nWe are glad to hear you are enjoying Alcove, and thank you so much for the feedback! We are certainly continuing to work on improvements in general, as well as for the hand tracking feature. And we'd love to hear any specifics around experiences that are closing, as that doesn't sound right and we'd love to help! - if you have a moment, please connect with us at feedback@alcovevr.com Very Best, Team Alcove", "Yankee_wit_no_brim4 days ago\nHand tracking is amazing!\n\nThis game implements some amazing hand tracking. This is the type of VR game you would show to your friends who are first-timers. There are plenty of videos, experiences and games for you to try out. You can be taking a bus tour of Dubai at one stage and talking to a virtual rabbit another.\nSome amazing work produced here.\n\n-Finn\n\nHelpful | 1", "Zurena2 days ago\nFabulous All-In-One Experience\n\nSeems like everything is packed in here, and designed for more to come. My fav are the meditation apps and the hot air balloon experience in the Kenya game park. Great job.\n\nHelpful | 2", "DougyD794 days ago\nGood start, needs more.\n\nReally need to get YouTube integration on the media. I'd also love to have pets other than the rabbit, like virtual versions of my own pets. You're onto something great here if you continue to expand!\n\nHelpful | 1\nDeveloper Response4 days ago\n\nThank you so much for the great feedback and request! We've been hearing from other users who'd like to see YouTube integrated into Alcove, so it's definitely something we will consider adding to our list for further development. Meanwhile, we hope you will enjoy the existing library of content in Alcove today - including the games, wellness experiences, and the hundreds of Travel experiences! Very best, Team Alcove", "CaryMGVR4 days ago\n\"ALCOVE\" HAS LIMITLESS POTENTIAL!\n\nHoly cow, what dogcrap .... F-I-V-E times I tried to get this POS to run, and each time I get:\"NO INTERNET CONNECTION! ALCOVE NEEDS INTERNET TO WORK\". Well, since you're reading this OBVIOUSLY I HAVE AN INTERNET CONNECTION. And it's very fast, too. It's \"FiOS\", in fact. But \"Alcove\" doesn't want to acknowledge it's existance. No matter. INSTA-DELETE this garbage. Thank God it's free .... YECCH.\n\nEDIT:\nTwo hours have passed now and at the behest of the dev and after some futzing around on my part for a bit, \"Alcove\" has, in fact, connected online and is working perfectly now: time to talk about \"Alcove\"'s actual content! I like what I see so far very much! OK, so you gotta go to a seperate website [URL given in the intro panel] to upload your pictures & videos, but after that minor initial PITA, things look quite interesting .... As I'm sure many reviewers will say about \"Alcove\": \"There's a TON of potential here.\" So I will rename my review thusly and upgrade my score from 1-star to 4-stars. Have fun guys! \n\nHelpful | 10\nDeveloper Response5 days ago\n\nHi Cary. I definitely understand how it would be frustrating to be unable to get into the app. At startup the application performs a basic internet check. We'd love to help figure out how or why it could have failed as this is obviously something we want to fix if it isn't 100% reliable. We would really appreciate it if you could reach out to feedback@alcovevr.com", "perez674 days ago\nIt's got potential, but...\n\nFirst off KUDOS to the developers. I was surprised to learn this was developed by AARP. It is a good environment and it's got the potential to be great, but it's very limited. Unless YouTube is integrated you only get a few experiences and while cool, they will get boring quick. Also everything currently featured is AARP content, which makes sense, as they developed it, but I do hope they add more stuff. I like the ability to play together and I hope more games are added. The Wander app (which is an option to explore with friends, but you must already own it) did not work as smoothly with this app and I had to quit out of it to get back to Alcove (as opposed to the using the suggested back button). I like the program but I guess I set myself up for disappointment by thinking I could customize the home beyond images, but maybe that's down the road. VR Bus tour was my fave. Worth checking out.\n\nHelpful | 3", "jake.pechauer4 days ago\nWOW Alcove!\n\nWOW is the only reaction I can come up with after spending just a half hour within this new application. The ability to connect with my family and friends who live far away from me in a meaningful way while playing games and traveling together?! Now this is finally a solution to the pandemic we're experiencing. I've already uploaded all of my favorite pictures which is a great personal touch to feel surrounded by my loved ones in this new app. Props to the developers and AARP for recognizing social isolation and giving ALL ages a technology and space to enjoy together. I look forward to following this application's updates and spending time with my family inside my new virtual home :)\n\nHelpful | 9", "Jayman20184 days ago\nThe road trip across the USA\n\nWow! So amazing and relaxing ! I could watch this all day! I couldnt go on my vacation because a friend was ill and this has cheered me right up! Thanks for this! \n\nHelpful | 7\nDeveloper Response4 days ago\n\nJayman2018, we are very happy to hear you are enjoying Alcove! We hope you will find all the other travel content in it enjoyable, and that your friends will join you to travel together around the Globe, even if just virtually for now. We'd love to further hear from you if you have any other feedback or ideas on how we can make Alcove great for you, please don't hesitate to reach out to us anytime at feedback@alcovevr.com", "peterzuge2 days ago\nNice environment and interactions\n\nThis app isn't for people looking for hardcore gaming . It is focused on bringing family together (older or younger) inside VR, and I think it does a tremendous job at it. The environment is high quality, and the interactions are well thought out. The ability to share photos or play checkers will play well to the older crowd who care more about a shared experience with loved ones than \"saving the galaxy\". I hope the developers get the recognition they deserve, and I hope they continue to develop this app as it is tailored to a group often ignored. Social isolation of older folks is an unfortunate reality.\n\nYou can upload family photos and videos (even 360 videos) at https://alcove.rendever.com/, however I am hesitant to do this as I can't find a privacy or security statement anywhere. I _want_ to believe the best, but this requires assurance. Holding off on 1 star until this get clarified.\n\nAgain, nice job to the developers!\n\nHelpful | 2", "dylanzombie414 days ago\nGreat social experience!\n\nPlaying checkers with my friend and chilling out in the same space was really good fun. However I wished some of the other games was 2 player and I wish the media option had YouTube.\n\nHelpful | 4", "Guvner573 days ago\nHas Potential\n\nApp is very good but looks to have some flaws.\nI uploaded photos on the website as instructed but when I tried to view them on the Quest there were no thumbnails so I couldnt see the photos.\nThen instead of being able to chose a photo for a frame they all just appeared with some not fitting the frame size. Cannot see how to individually chose a photo for a frame.\nP.S. cannot see any chat feature on your website which you mentioned using.\nHelp needed please.\nOther than this problem I am finding the app to be very good.\n\nHelpful | 0\nDeveloper Response3 days ago\n\nThank you so much for the kind words and feedback. When clicking on a frame, the photo in it opens up and there is small menu in the lower right corner. When clicking on that, you can access your Gallery, where you can see all your albums, and can select any other picture from any album, to place in the frame. As for the live chat function, that is available on the website during US East Coast working hours, but you can always reach out to us via email at feedback@alcovevr.com and we will get back to you asap! Please keep us posted if this helps, and pls let us know how we can best support you. We're here for you! :) Very best, and thank you for enjoying Alcove!", "wuzpA day ago\nDid any seniors really beta test this\n\nMenus are suspended in my center-line of vision. I only see out of one eye, and cannot move menus off to one side, to see the entire thing.\n\nVolume of voice overs is so low, that I have to put on my hearing aid. In VR, I shouldn't have to wear my hearing aid, when I should just as easily be able to increase the headset volume.\n\nI should also be able to either get closer to an object, or pull it closer to me, in order to see it better.\n\nHelpful | 0", "achapweske4 days ago\nLove it!\n\nI cant believe this is free! Very impressive visuals with lots of good content. I almost want them to charge for it so that I can rest assured theyll continue developing it.\n\nThis sort of app is why I bought the quest. Its not a game, but an experience. An opportunity to get out of my apartment for a few minutes and enjoy a little time overlooking the ocean or just hang out in another living room and watch TV (I love the idea of the guided tours, the the few Ive tried so far were not super compelling). Looking forward to having my friends join so we can use this app together.\n\nHelpful | 1", "GoddessLaniakea4 days ago\nInteresting\n\nI was excited to try this out. Where is my avatar?\n\nWish the ocean was more realistic and there was more to explore behind the closed doors.\n\nAlso wish there was a way to manipulate other objects and go out onto the meadow...\n\nHelpful | 2", "MarkStirtonAberdeen4 days ago\nKinda buggy\n\nCrashed a few times, but more annoying was the system for watching the wall mounted content. When in the underwater one, hand tracking kicks in after a minute and that stops the video. Thus far I've not found it possible to get through a whole video without my real hands appearing and the video stopping. So much Oculus Quest material now arrives like this, buggy with the intention of fixing it later, which is fine, but really puts one off being an early adopter. I'll wait, like most apps on here, for version 2.\n\nHelpful | 1", "joshuajamesshrum4 days ago\nJust what we needed\n\nThe quest needed something like oculus homes for the go. Just feel like theres a lack of good board games to play. A great game overall otherwise.\n\nHelpful | 1\nDeveloper Response4 days ago\n\nJoshua, we're thrilled to hear you're enjoying it! Please let us know which board games you'd like to play in Alcove, and we will try adding them to our list for further development. You can reach out to us directly at feedback@alcovevr.com Best, Team Alcove", "AndrewVR552 days ago\nRift support\n\nThis is amazing. I would love to see rift support for in the future so i can play with my friend whos on rift and not quest\n\nHelpful | 1", "OculusQuestFun4 days ago\nFor VR Enthusiasts By VR Enthusiasts\n\nWow. Just wow. This is the experience that so many of us have been waiting for. The time and hard work that was put into making this shows and is greatly appreciated. And for FREE?!?! Christmas came early this year.\n\nHelpful | 0", "Wyck111 hours ago\nNice app so far\n\nGood app so far. Beautiful environment. If it were possible to watch movies (Netflix, ect.) with family / friends on the screen that would make this great. Other then that I really like it. great job!\n\nHelpful | 0", "BiggPoppaDoc3 days ago\nCant sign on from website\n\nHttp failure response for https://api.rendever.com/family/auth/sign_in: 401 OK Is all I get when I enter my email and password. If I go to the start page it says Email has been taken. And no confirmation email was sent waited and still waiting. For my Oculus Quest\n\nHelpful | 0\nDeveloper Response3 days ago\n\nHi, we can definitely help with that, there is a chat feature on the bottom right corner of the account website and we would be happy to assist from there! Update - Aug 21 - 8pm EST: The live chat function is available during East Coast working hours. Happy to also support you over email at feedback@alcovevr.com. Wrt to the issue mentioned above, it is certainly a bug and our team is actively on it working to fix it asap! Many apologies for the inconvenience, and Thank you so much for your patience as we grow! :) Very best, Team Alcove", "jumbli4 days ago\nA game for all ages\n\nGreat to see another Quest title that caters to all ages. VR is for everyone :)\n\nHelpful | 0", "nishruu23 days ago\nyour own VR space\n\ninteresting, many things to try\n\nHelpful | 0", "Denisio74 days ago\nYouTube\n\nYouTube please.\nCool app.\n\nHelpful | 0", "hellabella6664 days ago\nNeed link to register for account\n\nAm I blind?\n\nHelpful | 1\nDeveloper Response4 days ago\n\nHi, to create an account and add your photos and videos, you can visit alcove.rendever.com. There is a chat function there if you need any help getting set up!"]