{"App Title": "Anne Frank House VR", "App description": "In 1942, during the Second World War, Anne Frank, a thirteen-year-old Jewish girl and her family were forced to go into hiding to escape persecution from the Nazis. For more than two years, the Franks and 4 others would live in the Secret Annex of an old office building in Amsterdam, sharing the burden of living in hiding in confined quarters with the constant threat of discovery. Anne Frank House VR offers a unique and emotional insight into these two years. Experience the world-famous Secret Annex in a never before seen way. Travel back to the years of the Second World War and wander through the rooms of the Annex that housed the group of 8 Jewish people as they hid from the Nazis. Immerse yourself in Annes thoughts as you traverse each faithfully recreated room, thanks to the power of VR, and find out what happened to the Annex brave inhabitants.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Documentary & History, Educational, Movie", "Languages": "English, Dutch, French (France), German, Hebrew, Portuguese (Portugal), Spanish (Spain)", "Version": "1.0", "Developer": "Force Field", "Publisher": "Oculus Studios", "Website": "http://annefrankhousevr.com/", "Release Date": "June 26, 2019", "Developer Privacy Policy": "PROJECTS\nABOUT\nJOIN US\nNEWS\nCONTACT\n\nPRIVACY POLICY\n\nForce Field Holding B.V. and all its subsidiaries (Force Field B.V., Force Field Entertainment B.V., Force Field HBE Studio B.V., Force Field LBE Studio B.V. and Force Field Productions B.V.), hereafter: Force Field, is committed to maximizing your experience on its website and its products within a trusted environment and respect your privacy, in accordance with the General Data Protection Regulation (GDPR). This privacy policy explains how we collect, protect, use and share information we collect about you on our website and when using our products. We are confident that this disclosure will help increase your confidence in our website, our products and enhance your experience. Please note that this privacy policy applies only to information submitted and collected online at our website or in our products. It does not apply to any websites maintained by other companies or organizations to which we may provide links to their content. What types of personal data does Force Field collect and how will it be used? Force Field collects personal data when you use our website and our products. The information we collect is used exclusively for communication and marketing research purposes. We keep the data we collect to a minimum and only collect your data if we must do so depending on the service we provide or when this data is automatically collected when you use our products.\n\nOur website\n\nThe majority of content on our site is offered without us collecting any personally identifiable information from you. There are a few activities on our site where the collection of personal data is necessary. The data we collect in these cases concern; your name and email address and all the other information you provide us with in your contact with us. These activities include:  signing up for an email newsletter or other online information service we may offer,  entering a contest,  answering a survey*,  contacting us using a webform In all of those instances we will offer you channels to contact us in case you desire to delete the information we have of you and we only keep the data as long as needed for the purposes of use.\n\nSurveys are conducted strictly for internal profiling purposes and only keep track ofinformation you provide us with which can not be directly traced back to a person (e.g., age, games played, consoles owned).\n\nWe collect personal information contained in the email for the purpose of responding to a visitors questions and/or comments.\n\nJob applications\n\nFrom time to time, we may post on our website job openings at Force Field and provide an email address to which interested applicants can submit their resume. The data we collect solely for this purpose can consist of your first and last name, date of birth, gender, nationality, education, marital status and contact details such as your e-mail address, postal address and telephone number and all other personal details stated in your application. The information you provide us with for this purpose will be used solely for its intended purpose (i.e., to evaluate the applicants qualifications). We hold on to this information for one month. We keep this information for two years after you have applied in case a possible position becomes available, but only if you explicitly confirm to us that we are allowed to do so. You can also contact us to remove our records and personal information we have of you at any time.\n\nOur products\n\nOur digital products, which consist of our VR games and experiences*, collect anonymous data based on your experience and we will never store any personal identifiable information, strictly following the GDPR definition of such data, that includes your name, IP address, username, e-mail address and any other information related to you directly.\n\nConcerning third party sites where you can view, download and/or purchase our products we cannot guarantee that the privacy policies of these websites have the same policies as Force Field and we recommend that you read the privacy policy of the website in question before you submit any personal information.\n\nForce Field VR and associated companies (\"Force Field,\" \"we,\" \"us\"). We make virtual, mixed, and augmented reality products. This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services. We have arranged our service in such a way that we do not collect any personal information. For instance, we encrypt and anonymize all the data that relates to your VR experience before we can actually see the data in our log files. This means no information regarding your gamer profile, IP-address etc. reaches us.\n\nOn which legal grounds does Force Field collect your data? Force Field only collects data when there is a legal ground to do so. These legal grounds consist of:  In the performance of a contract  In case there is a legitimate interest: for example, when the processing enables us to enhance, modify, personalise or otherwise improve our services to the benefit of the websites users. Or, to enhance the security of our services and determine if our marketing is effective.  Based upon your consent: for example, when you subscribe to our newsletters\n\nWhat happens if I refuse to provide my personal information to Force Field? If you choose not to submit personally identifiable information when requested, you may not be able to access certain areas of our website or our products and you may considerably limit the services we can provide you. Still, we consistently ask for your permission whenever we need such information to be sent to us and provide you with the right information regarding the limitations and options you have to refuse or accept sending us such data.\n\nDoes Force Field use cookies or other means to collect information? A cookie is a small file or record-keeping device that websites often store on a users computer. (You can disable cookies or set your browser to alert you when cookies are being sent to your computer.). During your experience Force Field may use cookies to store options and decisions you might have made during your browsing experience, including your decision to consent to our privacy policy when requested. These cookies do not carry personal identifiable information of any kind.\n\nWith whom does Force Field share my personally identifiable information? From time to time, we may employ and share your personal information with vendors who use it solely to provide support for the internal operations of our website (e.g., technical support and network delivery) or social features of our products. These entities will not use your personally identifiable information for any other purpose, and have agreed to maintain the confidentiality, security, and integrity of the personal information they obtain from us. With these entities we have entered into a Processor Agreement. We dont (at this moment) share data with parties outside the EER. If we ever do so we will make sure to take additional measures, such as entering into an additional agreement with such party to ensure an adequate level of data protection for you.\n\nIt is our policy not to share, sell or rent your personal information to any company not directly related to the manufacture or publishing of Force Field products. We may disclose your personal information in the good faith belief that we are required to do so by law or to comply with legal processes, respond to any claims or protect the rights, property, or personal safety of Force Field or the public.\n\nYour rights regarding the information Force Field collects Under the GDPR, you as a subject have the following rights:\n\nThe right of inspection. This means that you can request access to the personal data we have collected from you. We will send you your data in a .csv-file.\nThe right to rectify your data if it is incorrect.\nThe right to delete your data, also known as the right to be forgotten.\nThe right to object to (future) processing of your data or to limit it, provided there is no legal bases that prevents this.\nThe right to revoke your consent to processing that you have issued. For instance, if you dont want to receive our newsletters anymore.\nThe right of data portability. This means that you can request us to hand you over the (digital) information we have collected from you (with your consent) so you can hand this over to another data controller.\nIf you want to make such a request please contact us, at any time, via email at privacy@ForceFieldVR.com. We will review and ask upon your request within one month and send you a confirmation.\n\nWhat is Force Fields policy regarding links to third party sites? You should be aware that while you are on a website operated by us, you may be directed to other sites that are beyond our control and for which we are not responsible. Because we cannot guarantee that the privacy policies of these websites meet our high standards, we recommend that you read the privacy policy of the website to which you link before you submit any personal information.\n\nWhat safeguards does Force Field use to protect my personally identifiable information? We maintain appropriate safeguards that ensure the security, integrity and privacy of the personally identifiable information we collect from all visitors. Personal information collected by us is stored in secure operating environments that are not available to the public and are only accessible by authorized employees. We also have security measures in place to protect the loss, misuse and alteration of the information under our control.\n\nHow do I ask a question or file a complaint? If you have any questions, complaints or comments regarding our privacy policy or practices, please contact us via email at privacy@ForceFieldVR.com. If you feel like having to you can also file a complaint at the Dutch Data Protection Authority in The Hague (https://autoriteitpersoonsgegevens.nl/).\n\nData Retention: Applications Applications and job position submissions are kept in our records for a maximum of one month (or two year after your explicit consent), and after this period all records, CVs and information is removed from our databases.\n\nData Retention: Products Our products do not store data that identifies you. During your time with one of products, we may collect information about your experience, such as progress, scores and unlocked content, but, using a one-way encryption system, we can guarantee that your data is anonymous when it reaches our databases. This means that all data collected within our products can never be used to identify you in any way.\n\nHow will we notify you of changes to this policy? If we make changes to this Privacy Policy that may impact you, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, and/or providing notice through the Services. If we make an administrative change, we may update the \"Last Updated\" date at the top of this Privacy Policy.\n\nThis site uses cookies including cookies from third-party services on pages with embedded content. Please read more about our privacy policy.\nACCEPT AND CONTINUE\nForce Field Entertainment\nWesterdoksdijk 421\n1013 AD Amsterdam\n020 707 68 42\ninfo@forcefieldxr.com\nForce Field Holding\nTorenlaan 9\n1261 GA Blaricum\n020 707 68 42\ninfo@forcefieldxr.com\nSocial\nFacebook\nTwitter\nLinkedIn\nInstagram\nSubscribe\nSEND\n 2019 Force Field Entertainment. All rights reserved.\nMember\nWeb by Wonderland.", "Developer Terms of Service": "PROJECTS\nABOUT\nJOIN US\nNEWS\nCONTACT\n\nTerms of Service For The United States\n\nTHIS TERMS OF SERVICE AGREEMENT APPLIES TO USERS WHO RESIDE IN ORACCESS THE SITE OR THE GAMES FROM A LOCATION WITHIN THE TERRITORY OFTHE UNITED STATES. IF YOU MEET THIS REQUIREMENT, YOU MUST AGREE TO THISTERMS OF SERVICE AGREEMENT BEFORE USING OUR WEBSITE AND/OR PLAYINGOUR GAMES. IF YOU RESIDE IN OR ACCESS THE SITE OR THE GAMES FROM ALOCATION OUTSIDE THE TERRITORY OF THE UNITED STATES, THE TERMS OFSERVICE FOR USERS OUTSIDE THE UNITED STATES, LINKED HERE, APPLIES TO YOU.\n\nThis Terms of Service Agreement for the United States (Agreement) informs you of the terms,conditions, disclaimers, notices and policies (collectively the Terms) that apply to your access anduse of the website of Force Field BV. (Force Field), located at the URL www.ForceFieldVR.com(Site) and any and all games and related products, including virtual goods, provided by ForceField (Games). Collectively, the Site and the Games are referred to as the Services in this Agreement. Many of these Games may be playable by one or more persons simultaneously (each aUser and collectively Users), and the conduct of all such Users while playing the Games orusing the Site is governed by this Agreement.\n\nThis Agreement is a binding contract between you and Force Field that provides for important rightsand obligations. By accessing, browsing, and/or using the Services and/or playing, downloading orbrowsing our Games you represent to Force Field that you have read, understood and agree to bebound by this Agreement and all applicable local, state, national and international laws andconventions, including without limitation all intellectual property laws. Force Field reserves theright, at its sole and absolute discretion, to deny any User access to the Services, without notice. Ifyou violate any of the Terms, we may, at our option, give you a warning notice of violation orterminate your account immediately for violation of the Terms.\n\nIF YOU DO NOT AGREE TO ALL OF THESE TERMS, YOU MUST NOT ACCESS OR USETHE SITE OR ACCESS OR USE OUR GAMES.\n\nTHIS AGREEMENT CONTAINS A BINDING INDIVIDUAL ARBITRATION AND CLASSACTION WAIVER PROVISION IN SECTION 19 THAT AFFECTS YOUR RIGHTSUNDER THIS AGREEMENT WITH RESPECT TO ANY \"DISPUTE\" (AS DEFINED INSECTION 19) BETWEEN YOU AND FORCE FIELD. YOU HAVE A RIGHT TO OPT OUTOF THE BINDING ARBITRATION AND CLASS ACTION WAIVER PROVISIONS ASDESCRIBED IN SECTION 19.\n\nELIGIBILITY TO ACCEPT AGREEMENT AND USE THE SITE\n\nYou must be at least 13 years of age and either reside in or access the Site or Games from a locationwithin the United States to access and use the Services. There is no exception to this requirement.Force Field does not knowingly collect any personal information from children under the age of 13that falls within the Childrens Online Privacy Protection Act and Rule. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legalparental or guardian consent, and that you are fully able and competent to understand and acceptthis Agreement as a binding contract and to abide by all Terms.\n\nFORCE FIELDS RIGHT TO MODIFY AGREEMENT\n\nForce Field may modify this Agreement at any time, with or without notice to you, by posting themodified Agreement on the Site. Your continued use of the Services after such modification shall bedeemed to be your acceptance of any such modification. Any such modification will only apply tomatters and events which occur following the date of modification. You may not modify thisAgreement without the prior written authorization of an officer of Force Field. It is yourresponsibility to check this Agreement regularly to determine whether the Agreement has beenmodified. IF YOU DO NOT AGREE TO ANY MODIFICATION OF THIS AGREEMENT YOUMUST IMMEDIATELY CEASE USE OF THE SITE AND UNINSTALL ANY GAMES YOUMAY HAVE INSTALLED ON YOUR COMPUTER OR OTHER INTERACTIVE DEVICE ORPLATFORM.\n\nPOLICY ON PRIVACY\n\nThe Services include the Privacy Policy relating to the collection, use and disclosure of your information. Please read the Privacy Policy carefully. By using the Services, you are consenting to the Privacy Policy.\n\nFORCE FIELDS OWNERSHIP OF THE SERVICES AND PROPRIETARY MATERIALS\n\nThe Services contain copyrighted material, technology, trademarks, service marks, trade secrets andother proprietary information, which may include computer code, text, data, video, images,illustrations, animations, sounds, musical compositions and recordings, audiovisual effects, colorschemes, business methods and methods of operation, concepts, ideas, know-how, moral rights, andany related documentation (collectively the Proprietary Material). All intellectual property rightsto the Proprietary Material, including patent, copyright, trademark and trade secret rights, are ownedor licensed by Force Field. You agree not to copy, download, reproduce, republish, upload, post,transmit, perform, display, distribute or sell, or in any other way exploit the Proprietary Material, orto participate with or to encourage others to engage in such acts, without the prior written consent ofForce Field. Moreover, you may not reverse engineer, disassemble, decompile, or translate anycomputer software programs that comprise Proprietary Material, or otherwise attempt to derive thesource code of such programs, except to the extent allowed under any applicable law. If applicablelaw permits such activities, any information so discovered must be promptly disclosed to ForceField and shall be deemed to be the confidential proprietary information of Force Field. Nor maythe Proprietary Material, or any portion thereof, be modified or used for any purpose other than asexpressly authorized in this Agreement. The Proprietary Material may include materials licensed byForce Field from third parties. The licensors of those materials are an intended beneficiary of thisAgreement and may enforce their rights in the event of any violation of this Agreement.\n\nALL RIGHTS NOT EXPRESSLY GRANTED TO YOU IN THIS AGREEMENT ARERESERVED BY FORCE FIELD AND ITS LICENSORS.\n\nOWNERSHIP OF IDEAS INVENTIONS AND USER SUBMISSIONS INCLUDING USER-GENERATED CONTENT\n\nThe Services provide you with access to a variety of resources, materials and downloads, and mayallow you access content made available by Force Field and other Users. Such content may include, without limitation, game levels, content creation tools, audio, video, film, music, text, communications, software, graphics, images, and information. All such content made available byyou or by other Users of the Services is referred to in this Agreement as User-Generated Content. As between Force Field and you, you own the copyright in any User-Generated Content that is exclusively created by you. You expressly acknowledge and agree that any User-Generated Content that you make available through the Services may be made freely available by Force Field to others, including without limitation for download by others.\n\nYou further acknowledge and agree that this permission is made and granted by you inconsideration of your use of the Services, and that this permission constitutes a world-wide, nonexclusive, perpetual, royalty-free, irrevocable and transferable license to Force Field to use, copy, perform, display and distribute such User-Generated Content, and to grant and authorize sublicenses of such User-Generated Content to others.\n\nAll comments, feedback, suggestions, gameplay features, level designs, and other submissions(User Ideas) disclosed, submitted, or offered to Force Field shall be the exclusive property ofForce Field. Unless otherwise prohibited by law, Force Field may use, sell, exploit, or createderivative works from these User Ideas and, further, Force Field may disclose these User Ideas tothird parties or the general public, without compensation to you.\n\nYou acknowledge that User Ideas and User-Generated Content are provided by you on a completelyvoluntary basis. Should you not wish to have your User Ideas or User-Generated Content incorporated into any game or website functions, you may choose not to share them with ForceField on the Site.\n\nTERMINATION OF GAMES OR SERVICE\n\nForce Field may terminate access to any or all Games and/or Services at any time by giving younotice of such termination within the time period specified when you consented to the Services, or ifno time period for notice of termination was specified, then no less than thirty (30) days of the datesuch notice is either provided to you, at Force Fields discretion, either by email or by posting onthe Site.\n\nPROHIBITED USER-GENERATED CONTENT\n\nYou are solely responsible and liable for any User-Generated Content that you upload, post, input,publish or otherwise distribute using the Services. As a condition of your use of the Services, youagree not to use the Services for any unlawful or prohibited purpose. User-Generated Contentprohibited from upload, display or posting on the Services includes, without limitation, any User-Generated Content that Force Field determines in its sole and absolute discretion to prohibit. Without limiting the scope of Force Fields discretion, prohibited User-Generated Contentspecifically includes anything that:\n\n(a) constitutes or includes any illegal or unauthorized copy, in whole or in part, of another personscopyrighted or copyrightable work, discloses trade secrets without authorization, or otherwiseviolates the proprietary rights of a third party;\n\n(b) misrepresents the source or identity of any material;\n\n(c) is unlawful, obscene, defamatory, libelous, threatening, abusive, harassing, promotes racism,bigotry, hatred or physical harm of any kind against any individual or group, or encourages anyother conduct that would be considered a criminal offense, creates civil liability, or is otherwiseoffensive to Users of the Services or is otherwise inappropriate;\n\n(d) violates the rights of privacy or publicity of any person;\n\n(e) is false or deceptive;\n\n(f) displays pornographic or sexually explicit material of any kind;\n\n(g) includes material that exploits people under the age of 18 in a sexual or violent manner;\n\n(h) is an advertisement or solicitation to sell a product or service to Users of the Site, or constitutesany other commercial use of the Site, without the prior written consent of Force Field;\n\n(i) is unlawful under the laws of the United States or any individual state or locality, the laws of anyforeign jurisdiction, or any international treaty or convention; or\n\n(j) interferes with the proper functioning of the Services or the Site, or violates any other of theTerms of this Agreement.\n\nYou should not post any User-Generated Content if you are in doubt about its legality or itsprohibition by the Terms.\n\nYou acknowledge that Force Field is a service provider that may allow Users to interact onlineregarding topics and content self-chosen by the Users. Force Field does not endorse any User-Generated Content or any opinion, recommendation or advice that may be expressed. Force Fieldgenerally does not regulate and shall have no obligation to monitor any User-Generated Content. Nonetheless, Force Field and its agents shall have and reserve the right to monitor any User-Generated Content from time to time for any lawful purpose. Force Field may, without notice to you, remove or block any User-Generated Content, including disabling access to such User-Generated Content. Force Field also may terminate your access to the Site and refer the User-Generated Content to law enforcement if it is in violation of any state, federal or local law.\n\nPROHIBITED USER CONDUCT\n\nSubject to the permitted use of the Services granted in this Agreement, you may not, in whole or inpart, copy, photocopy, reproduce, translate, reverse engineer, derive source code from, modify,disassemble, decompile, or create derivative works based on the Service, or remove any proprietarynotices or labels from the Service. Failure to comply with the restrictions and limitations containedin this Section 10 will result in the immediate, automatic termination of your access to the Servicesand may subject you to civil and/or criminal liability.\n\nYou further agree that you will not, under any circumstances:\n\n(a) frame or otherwise display any portion of the Services or its contents that is not your User-Generated Content without prior authorization;\n\n(b) sell, grant a security interest in, or transfer reproductions of all or any portion of the Services toother parties in any way not expressly authorized herein, nor shall you rent, lease or license all orany portion of the Services to others;\n\n(c) exploit the Services or any of its parts for any commercial purpose whatsoever without theexpress prior written authorization of Force Field;\n\n(d) host, provide or develop services for or using the Services, or intercept, emulate or redirect thecommunication protocols used by Force Field in any way, including without limitation throughprotocol emulation, tunneling, packet sniffing, modifying or adding components to the Services, useof a utility program or any other techniques now know or hereafter developed, for any purpose,including without limitation unauthorized access in any form over the Internet;\n\n(e) facilitate, create or maintain any unauthorized connection to the Services, or any portion thereof,including without limitation any connection to any unauthorized server that emulates, or attempts toemulate, the Services. All connections to the Services, or any portion thereof, may only be madethrough methods and means expressly approved by Force Field. Under no circumstances may youconnect, or create tools that allow you or others to connect to the Services, or any portion thereof,other than those expressly provided by Force Field;\n\n(f) to develop or allow any malware, adware, spyware, Trojan Horses, cancelbots, other automatedbots, auto players, cheat utilities, spoofers, keyloggers, or other circumvention devices to bepresent on any machine used to access the Services; and/or to attempt to upload/utilize such devicesagainst the Services;\n\n(g) use vulgar, obscene, pornographic language or other behavior while in the forums, chat rooms,or other public areas that will disrupt the User experience in those areas of the Site;\n\n(h) use the Services in connection with any contests, surveys, chain letters, pyramid schemes orother similar services, whether or not they are used for commercial gain;\n\n(i) collect, harvest, scrape or capture any User information, email addresses or other personal dataof the Users to send unsolicited emails or any other communication, whether this is done forcommercial gain; or|\n\n(j) use the Services in a manner prohibited by any applicable law or government regulation, or bythe Terms.\n\nForce Field expressly reserves the right to monitor any/all network traffic between the User(s) andthe Services to prevent the use of said means to compromise the Services\n\nUSER REGISTRATION AND ACCOUNT SECURITYAs a condition to using certain components of the Services, you may be required to register withForce Field and select a password and screen name (User ID) to obtain a personal account. Incases where you do not choose a user name/screen name, Force Field may automatically assign youa user ID to identify you to our servers.\n\nYou agree to provide Force Field with accurate, complete, and updated registration information.Failure to do so shall constitute a breach of the Terms, which may result in immediate, automatictermination of your access to the Services. You may not select or use as a User ID a name of anotherperson with the intent to impersonate that person; use as a User ID a name subject to any rights(including trademarks or copyrights) of a person other than you without appropriate authorization;or use as a User ID a name that is otherwise offensive, vulgar or obscene. Force Field reserves theright to refuse registration of, or to cancel, a User ID in its sole and absolute discretion.Notwithstanding the foregoing, you acknowledge that Force Field cannot guaranty the accuracy ofany information submitted by any User of the Services, nor any identifying information about anyUser.\n\nYou are solely responsible for the activity that occurs through your account. You shall be solelyresponsible for maintaining the confidentiality of your password. You may not share your accountwith a third party or use the account of a third-party. You agree to notify Force Field immediately inwriting of any unauthorized use of your account, or other account-related security breach of whichyou are aware. You may cancel your account at any time upon written notice to Force Field.\n\nPROMOTIONAL PROGRAMS\n\nForce Field may implement marketing and promotional programs in which Users are offeredbenefits or considerations based upon the performance of specified activities, the satisfaction ofspecified requirements, or other criteria. Any such program, including the eligibility and selection ofUsers, the award, compensation or other benefit to be granted Users, if any, and the duration, shallbe at the sole and absolute discretion of Force Field. You acquire no right or interest to participate insuch program or to the impartial implementation of the program and distribution of any awards,compensation or benefits. You hereby expressly waive and disclaim any such right or interest as amaterial Term of this Agreement. To the extent such program may involve one or more third parties,you further expressly waive and disclaim any such right or interest against such third party. ForceField may elect in its sole and absolute discretion to contact you with regard to a program. Youhereby expressly authorize Force Field to contact you by means of the contact information you haveprovided to Force Field.\n\nLINKS TO THIRD-PARTY WEBSITES\n\nSolely as a convenience to Users, Force Field may provide links on the Services to other websitesowned by third-parties. Unless otherwise expressly stated, Force Field does not endorse or controlthese third-party websites and assumes no responsibility for them or the content contained therein.\n\nGENERAL DISCLAIMERS\n\n(a) THE SERVICES AND ANY ACCOMPANYING DOCUMENTATION AND MATERIAL AREBEING PROVIDED TO YOU AS IS WITHOUT WARRANTY OF ANY KINDWHATSOEVER. WITHOUT LIMITING THE INTENDED GENERALITY OF THEPRECEDING SENTENCE, FORCE FIELD DOES NOT WARRANT THAT THE SERVICES ORANY PORTION THEREOF (i) WILL BE UNINTERRUPTED, SECURE OR ERROR FREE, ORTHAT DEFECTS WILL BE CORRECTED; (ii) IS COMPATIBLE WITH ANY SOFTWARE,INCLUDING WITHOUT LIMITATION INTERNET BROWSER SOFTWARE; (iii) IS FREE OFINFECTION BY VIRUSES, WORMS, TROJAN HORSES OR ANYTHING ELSEMANIFESTING CONTAMINATING OR DESTRUCTIVE PROPERTIES; OR (iv) IS FREE OFDEFAMATORY, DEROGATORY OR ADULT-ORIENTED MATERIAL, OR MATERIAL THATSOME INDIVIDUALS MAY DEEM OFFENSIVE OR OBJECTIONABLE. TO THE FULLESTEXTENT ALLOWED BY LAW, FORCE FIELD DISCLAIMS ALL WARRANTIES, WHETHEREXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY AND ALL IMPLIEDWARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE ORUSE.\n\n(b) FORCE FIELD IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OROFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL FORCEFIELD BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURYOR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATEDCONTENT POSTED ON THE SITE OR TRANSMITTED TO ANOTHER USER, OR ANYTRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINEOR OFFLINE.\n\n(c) THE SERVICES ARE CONTROLLED AND PROVIDED BY FORCE FIELD FROM ITSFACILITIES IN THE UNITED STATES OF AMERICA. FORCE FIELD MAKES NOREPRESENTATION THAT THE SITE OR THE SERVICES ARE APPROPRIATE ORAVAILABLE FOR USE IN OTHER LOCATIONS. IF YOU ACCESS OR USE THE SITE ORTHE SERVICES FROM OUTSIDE THE UNITED STATES, YOU DO SO VOLUNTARILY ANDARE RESPONSIBLE FOR COMPLIANCE WITH THE LAWS APPLICABLE TO YOURLOCATION.\n\nLIMITATION OF LIABILITY TO THE FULLEST EXTENT ALLOWED BY LAW\n\nTO THE FULLEST EXTENT ALLOWED BY LAW, FORCE FIELD, INCLUDING ITSOFFICERS, DIRECTORS, SHAREHOLDERS, EMPLOYEES AND AGENTS, SHALL NOT BELIABLE TO YOU FOR ANY DAMAGES OF ANY KIND, INCLUDING BUT NOT LIMITEDTO DIRECT, INDIRECT, COMPENSATORY, SPECIAL, INCIDENTAL OR CONSEQUENTIALDAMAGES ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF THE SERVICES, EVEN IF ADVISED OF THE POSSIBILITY OF SAME. YOU UNDERSTAND AND AGREETHAT FORCE FIELD CANNOT AND WILL NOT BE RESPONSIBLE FOR ANY LOSS OFYOUR USER GENERATED CONTENT OR ANY INTERRUPTIONS OF SERVICE,INCLUDING BUT NOT LIMITED TO ISP DISRUPTIONS, SOFTWARE OR HARDWAREFAILURES, OR ANY OTHER EVENT WHICH MAY RESULT IN A LOSS OF DATA OR ADISRUPTION OF SERVICE.\n\nINDEMNIFICATIONT\n\nTo the maximum extent permitted by law, you agree to defend, indemnify and hold harmless ForceField, its offers, directors, employees and agents, from and against all claims, damages, obligations,losses, liabilities, costs or debt, and expenses (including but not limited to attorney fees) arisingfrom your use of the Services, your violation of any of the Terms, your violation of any third-partyright, including without limitation any copyright, trade secret, privacy or property right, or anyclaim that your User-Generated Content caused damage to a third-party. This defense andindemnification obligation will survive this Agreement and your use of the Services.\n\nUSE OF THE SERVICES OUTSIDE OF THE UNITED STATES\n\nThe Services are controlled and operated by Force Field in the State of California, United States ofAmerica. Force Field makes no representations or warranties, either express or implied, thatServices and other materials available through the Services are appropriate, legally permissible oravailable for use in other locations. Those who choose to access the Service from other locations doso at their own risk and are responsible for compliance with all United States federal, state and locallaws.\n\nWhether or not you use the Services from a location within the United States of America, you agreeto abide by any applicable export control laws and not to transfer, by electronic transmission orotherwise, any User Generated Content, software or other materials subject to restrictions undersuch laws to a national destination prohibited by such laws, without first obtaining, and thencomplying with, any requisite government authorization. You further agree not to upload to theServices any data or software that cannot be exported without prior written governmentauthorization, including, but not limited to, certain types of encryption software.\n\nEQUITABLE REMEDIES\n\nYou acknowledge and agree that money damages would not be a sufficient remedy for any breachor threatened breach of this Agreement by you. Force Field shall be entitled to seek equitable relief,including a preliminary and final injunction and specific performance, as a remedy for any suchbreach. Such remedies shall not be the exclusive remedies for a breach by you, but shall be inaddition to all other remedies available to Force Field at law or in equity.\n\nBINDING INDIVIDUAL ARBITRATION\n\nThe term \"Dispute\" means any dispute, claim, or controversy between you and Force Fieldregarding any Games, Services or the provisions of these Terms, whether based in contract, statute, regulation, ordinance, tort (including, but not limited to, fraud, misrepresentation, fraudulentinducement, or negligence), or any other legal or equitable theory, and including the validity,enforceability or scope of this Section 18 (with the exception of the enforceability of the ClassAction Waiver clause below). Dispute is to be given the broadest possible meaning that will beenforced. If you have a Dispute with Force Field or Force Field's officers, directors, employees andagents that cannot be resolved through negotiation within the time frame described in the \"Notice ofDispute\" clause below, other than those matters listed in the Exclusions from Arbitration clause, youand Force Field agree to seek resolution of the Dispute only through binding arbitration of thatDispute in accordance with the terms of this Section 18, and not litigate any Dispute in court.Binding arbitration means that a neutral arbitrator instead of in a court by a judge or jury willresolve the Dispute.\n\nIF YOU DO NOT WISH TO BE BOUND BY THE BINDING ARBITRATION AND CLASSACTION WAIVER IN THIS SECTION 18, YOU MUST NOTIFY FORCE FIELD IN WRITINGWITHIN 30 DAYS OF THE DATE THAT YOU ACCEPT THIS AGREEMENT UNLESS ALONGER PERIOD IS REQUIRED BY APPLICABLE LAW. YOUR WRITTEN NOTIFICATIONMUST BE MAILED TO:\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands Legal@ForceFieldVR.com\n\nYOUR WRITTEN NOTIFICATION MUST INCLUDE: (1) YOUR NAME, (2) YOUR ADDRESS,AND (3) A CLEAR STATEMENT THAT YOU DO NOT WISH TO RESOLVE DISPUTES WITHFORCE FIELD THROUGH ARBITRATION.\n\nNotice of Dispute. IF YOU HAVE A DISPUTE WITH FORCE FIELD YOU MUST SENDWRITTEN NOTICE TO\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands Legal@ForceFieldVR.com\n\nTO GIVE FORCE FIELD THE OPPORTUNITY TO RESOLVE THE DISPUTE INFORMALLYTHROUGH NEGOTIATION. You agree to negotiate resolution of the Dispute in good faith for noless than 60 days after you provide notice of the Dispute. If Force Field does not resolve yourDispute within 60 days from receipt of notice of the Dispute, you or Force Field may pursue yourclaim in arbitration pursuant to the terms in this Section 19.\n\nClass Action Waiver. ANY DISPUTE RESOLUTION PROCEEDINGS, WHETHER INARBITRATION OR COURT, WILL BE CONDUCTED ONLY ON AN INDIVIDUAL BASIS AND NOT IN A CLASS OR REPRESENTATIVE ACTION OR AS A NAMED ORUNNAMED MEMBER IN A CLASS, CONSOLIDATED, REPRESENTATIVE OR PRIVATEATTORNEY GENERAL CTION, UNLESS BOTH YOU AND FORCE FIELDSPECIFICALLY AGREE TO DO SO IN WRITING FOLLOWING INITIATION OF THEARBITRATION. THIS PROVISION IS NOT APPLICABLE TO THE EXTENT SUCHWAIVER IS PROHIBITED BY LAW.\n\nInitiation of Arbitration Proceeding/Selection of Arbitrator. If you or Force Field elect toresolve your Dispute through binding arbitration, the party initiating the arbitration proceeding mayinitiate it with the American Arbitration Association (\"AAA\"), www.adr.org, or JAMS www.jamsadr.com. The terms of this Section 19 govern in the event they conflict with the rules ofthe arbitration organization selected by the parties.\n\nArbitration Procedures. Because the software and/or service provided to you by Force Fieldconcern interstate commerce, the Federal Arbitration Act (\"FAA\") governs the arbitrability of allDisputes. However, applicable federal or state law may also apply to the substance of any Disputes.For claims of less than $75,000, the AAA's Supplementary Procedures for Consumer-RelatedDisputes (\"Supplementary Procedures\") shall apply including the schedule of arbitration fees setforth in Section C-8 of the Supplementary Procedures; for claims over $75,000, the AAA'sCommercial Arbitration Rules and relevant fee schedules for non-class action proceedings shallapply. The AAA rules are available at www.adr.org or by calling 1-800-778-7879. Further, if yourclaims do not exceed $75,000 and you provided notice to and negotiated in good faith with ForceField as described above, if the arbitrator finds that you are the prevailing party in the arbitration,you will be entitled to recover reasonable attorneys' fees and costs as determined by the arbitrator,in addition to any rights to recover the same under controlling state or federal law afforded to ForceField or you. The arbitrator will make any award in writing but need not provide a statement ofreasons unless requested by a party. Such award will be binding and final, excerpt for any right ofappeal provided by the FAA, and may be entered in any court having jurisdiction over the partiesfor purposes of enforcement.\n\nLocation of Arbitration. You or Force Field may initiate arbitration in Los Angeles, California,USA.\n\nSeverability. If any clause within this Section 19 (other than the Class Action Waiver clause above)is found to be illegal or unenforceable, that clause will be severed from this Section 19, and theremainder of this Section 18 will be given full force and effect. If the Class Action Waiver clause isfound to be illegal or unenforceable, this entire Section 19 will be unenforceable, and the Disputewill be decided by a court and you and Force Field each agree to waive in that instance, to thefullest extent allowed by law, any trial by jury.\n\nSurvival. This Section 19 shall survive any termination of this Agreement.\n\nGENERAL PROVISIONS\n\nYou agree that the Services shall be deemed exclusively based in the State of California, USA, andthis Agreement shall be deemed to have been made and executed exclusively in the State ofCalifornia. Any dispute arising out of this Agreement shall be resolved in accordance with the lawsof the State of California without reference to its conflict of law provisions. You agree that anyclaim asserted in any legal proceeding by you or Force Field shall be commenced and maintained inany state or federal court located in Los Angeles County, State of California, USA, having subjectmatter jurisdiction with respect to such dispute. You and Force Field agree to submit to the personaljurisdiction of such court. The prevailing party in any such proceeding shall be entitled toreimbursement of court costs, including a reasonable attorney fee, in addition to any other remedyawarded. In the event any provision of this Agreement shall be held by a court or other tribunal ofcompetent jurisdiction to be unenforceable, such provision will be enforced to the maximum extendpermissible and the remaining portions of this Agreement shall remain in full force and effect. Youmay not transfer or assign any of your rights or obligations provided in this Agreement without theexpress prior written approval of Force Field; Force Field may assign this Agreement withoutrestriction of any kind. No failure on the part of Force Field to enforce any provision of thisAgreement shall be deemed a waiver or consent. This Agreement constitutes and contains the entireagreement and understanding between you and Force Field with respect to the subject matter hereofand supersedes any prior oral or written agreements or understandings.\n\nDIGITAL MILLENNIUM COPYRIGHT ACT NOTICE\n\nAs an online service provider, Force Field has adopted the following general policy regardingcopyright infringement in accord with the Digital Millennium Copyright Act, 17 U.S.C.  512(DMCA). The address of Force Field Designated Agent to Receive Notification of ClaimedInfringement (Designated Agent) is:\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands copyright@ForceFieldVR.com\n\nFor any notice of infringement to be effective, the notice must include:\n\na. A physical or electronic signature of a person authorized to act on behalf of the intellectualproperty owner of an exclusive right that is allegedly infringed;\n\nb. A description of the copyrighted work that you claim has been infringed upon;\n\nc. A description of where the material that you claim is infringing is located on this Sites and/or inthe Games;\n\nd. Information reasonably sufficient to permit the service provider to contact the complaining party,such as address, telephone number, and, if available, an e-mail address at which the complainingparty may be contacted;\n\ne. A statement by you that you have a good-faith belief that the disputed use is not authorized by thecopyright owner, its agent, or the law; and\n\nf. A statement that the information in the notification is accurate and under penalty of perjury, thatthe complaining party is authorized to act on behalf of the owner of an exclusive right that isallegedly infringed.\n\nIt is Force Fields policy to block access to or remove content that it believes in good faith to becopyrighted material that has been illegally copied and distributed by any User or other contentprovider. If you believe that User-Generated Content or other material residing on or accessiblethrough the Site infringes a copyright, please send a notice of copyright infringement to theDesignated Agent. The notice of infringement should conform to the elements of notificationprovided in the DMCA, Section 512(c)(3), including: (i) contact information and the physical orelectronic signature of a person authorized to act on behalf of the owner of the copyright allegedlyinfringed; (ii) identification of the copyrighted work or material infringed; (iii) identification andlocation the of the content claimed to be infringing so that it may be found and verified; (iv) astatement that the complaining party has a good faith belief that the use of the content in the mannercomplained of is not authorized; and (v) a statement, made under penalty of perjury, that allinformation in the notification is accurate and that the complaining party is authorized to act onbehalf of the owner of the copyright claimed to be infringed. Once proper infringement notificationis received by the Designated Agent, Force Field will remove or disable access to the claimedinfringing User-Generated Content or other material; notify the accused infringing party that it hasremoved or disabled access to the User-Generated Content or other material; and determineappropriate measures to prevent recurrence by the accused infringing party.\n\nThe DMCA requires a service provider to give prompt notification to the accused infringing party ofthe copyright claim and that the accused User-Generated Content or other material has beenremoval or access to it has been disabled. Section 512(g). The accused infringing party may thenissue a counter notification in the form provided in the DMCA, Section 512(g)(3). In such instance,Force Field shall follow the procedures and requirements of the DMCA calling for notification tothe complaining party and timely restoration of the User-Generated Content or other materialalleged to be infringing.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ IN ITS ENTIRETY AND UNDERSTANDTHE FOREGOING AGREEMENT. I AGREE THAT BY BROWSING, INSTALLING OR USINGTHE SERVICES I AM ACKNOWLEDGING MY AGREEMENT TO BE BOUND BY THETERMS AND CONDITIONS OF THIS AGREEMENT.\n\nModified February 11, 2017\n\nThis site uses cookies including cookies from third-party services on pages with embedded content. Please read more about our privacy policy.\nACCEPT AND CONTINUE\nForce Field Entertainment\nWesterdoksdijk 421\n1013 AD Amsterdam\n020 707 68 42\ninfo@forcefieldxr.com\nForce Field Holding\nTorenlaan 9\n1261 GA Blaricum\n020 707 68 42\ninfo@forcefieldxr.com\nSocial\nFacebook\nTwitter\nLinkedIn\nInstagram\nSubscribe\nSEND\n 2019 Force Field Entertainment. All rights reserved.\nMember\nWeb by Wonderland.", "Space Required": "780.3 MB"}



["5 stars\n82%\n4 stars\n9%\n3 stars\n2%\n2 stars\n2%\n1 star\n6%", "Sydney_RobsterJul 27 at 3:58 AM\nEmotional\n\nIt's an emotional experience visiting Ann Frank's house in Amsterdam. Being in the same place as her and reading the plaques which unfold her story. This app is excellent at conveying the same phyical presence, and even better at narrating her story. This app is an excellent educational medium for those who can't visit her house in person.\n\nHelpful | 8", "URBANOPATHY2 days ago\nMay we never forget\n\nThis was my first interaction with Oculus upon receiving my new Quest. I have been to Anne Frank's house in Amsterdam & although nothing ever replaces physically being there this conjured up many of the feelings I experienced all those years ago.\nAs an aside, how good would it be if developers were able to also incorporate the use of smell (musty, dampness, etc), which would totally give another dimension to a sense of being there.\nThis app does a wonderful job of recreating Anne's house & is a timely reminder of how important it is to rise up against cruel, inhumane & insane leaders.\nVery glad this was my 1st VR experience because with all that's going on in the world ...perspective is EVERYTHING.\n\nHelpful | 1", "SurrealSculptor65May 17 at 2:58 PM\nTears to my eyes.\n\nBeing an artist, sometimes, my imagination is not always a good thing. Actually sitting in those rooms, just for a moment, while the narration was going on, imagining myself in that scenario. Absolutely chilling, and the sad part is, it really happened. It wasn't fiction, it wasn't some horrific storyline. And a little girl no less. Well done and kudos to the team who put this together.\n\nHelpful | 37", "RoreoOreo10 days ago\nGreat if you love history\n\nWhen I first downloaded this I was learning about world war 2 and this was a very interesting way to learn more about it. Even though it was short I really liked this and would definitely recommend it\n\nHelpful | 0", "marcotheham321Jun 7 at 11:32 PM\nHelp\n\nMy quest glitched and now Im stuck in the attic for ever\n\nHelpful | 36\nDeveloper ResponseJun 8 at 3:00 AM\n\nIf you are having issues, please send an email directly to support@forcefieldxr.com", "AJwardaMar 17 at 6:46 PM\nA chilling and required experience.\n\nMy youngest niece just started learning about ww2. Shes yet to get to Anne Frank but saw that the diary was on her curriculum and saw this in my library. She started the experience only to be to frightened to enter the attic. She said nothing to me for days, until today. She asked Can I watch you play Anne Frank? I said Yes of course, but didnt you play it?\n\nShe said yes, but I got to the part where you have to go in the attic and I was too scared. Right there she stopped me dead in my tracks. She should be too scared, because everyone in that home was scared. I put on my quest and started the experience (my first time with it).\n\nNot only is the experience an incredible look into the future of education, but a chilling dive into one of humanities darkest eras. Needless to say by the end we were both brought to tears. My niece, effected by this harrowing tale of a girl her age in a time she can not fathom. The experience also brought me to tears and felt like relearning the Anne Frank/WW2 story. Upon reflection, I realized what really moved me emotionally was an experience I was able to share with my niece, one in which we both learned and cried. Please Oculus, I would love more historical experiences to share!\n\nHelpful | 116", "felixableJun 13 at 3:47 PM\nAstonishing experience\n\nThis was one of my first VR experience. The experience was simply astonishing. Great example of an educational and entertaining VR experience.\n\nHelpful | 2", "ChestnutzzJun 2 at 8:32 PM\nTears flowing\n\nMoved me to tears. Great experience and very inspirational. 5 stars! Thank you for such a great experience\n\nHelpful | 4", "djblondonApr 25 at 12:34 PM\nHeartbreaking but important\n\nThis is a truly heartbreaking but also very important experience. On a technical point this is made really well making the whole experience very immersive.\n\nHelpful | 3", "MecronightMay 5 at 8:21 PM\nStory? Nope.\n\nThe story is only rooms with texts or less than 3 objects that you can only pick up, open a door, or play a radio. There is no characters in this game that actually shows up and make it interesting, and all you hear is the girl, ambient sounds, and the radio. The story mode is pretty much the same as the adventure mode which is just wandering around.\n\nHelpful | 4", "pchorrorgamerFeb 17 at 5:08 AM\nEducational & Emotional\n\nDo not expect a game. It is an interactive educational experience of the house of Anne Frank. This was narrated well. I encourage others to experience and listen to her story. Her dreams did come true after all. Very emotional. Well done ..\n\nHelpful | 22", "mosofsky15 days ago\nCompare to COVID-19 quarantine...\n\nIn VR I just toured Anne Franks house. Very powerful to compare her sheltering in place to this days. We have it good comparatively.\n\nHelpful | 0", "LofusShrodingerApr 23 at 11:35 AM\nThis is the worst simulator ever\n\nI wanted to scream in the Secret Annex and stomp around and then watch Germans rush the building. This app promised me an experienced and didn't deliver in the least. Also you have to finish story mode to discover on your own. Basically you could get a better video tour of the house if you actually wanted a tour.\n\nHelpful | 16", "TAZ2020Jul 2 at 12:39 AM\nNot to be missed!!\n\nThe visuals in this experience are superb! And the whole experience is really beyond words to describe. Although Im sure Anne would have found the words! What an amazing insight into Annes life. It is incredible experiences like this that use the quest to leave an indelible impression on our lives!!\nThanks to all those involved in bringing this most moving experience to fruition!!\nOne of the best examples of how the Quest can be used.\n\nHelpful | 0", "donkey.xoteJul 11 at 5:48 PM\nA great immersive experience\n\nThis is a very well produced app (i refuse top use the word 'game'). Honestly, it's nicer and larger than my place but I don't have to share it with 7 other people. Try imagining living cramped up like that for years with the constant fear of being caught looming over everyone's heads.\nIt would be great if it remembered your progress. The first time i ran this, my battery died halfway through. The second time, a friend dropped by. Each time I resumed, I had to sit through the long intro before the interactive bit starts. Once in, i was able to skip certain monologues to get back to where i had left off.\nA couple silly things stuck with me:\n1: her bedroom was decorated just like any teenager would decorate their room today. Pictures of movie stars and role models were all over the walls.\n2: That toilet, man! There's more steel on that beast than my lawnmower!\n\nHelpful | 0", "SATactSKYPEtutorDec 29 at 6:35 PM\nbetter than any history book and museum!\n\ni couldn't remember any details about anne frank before this. Museums suck because im distracted by ppl watching and all the exhibits and items seem disconnected. having this curated with an introduction, and then excerpts from the book read aloud as you walk thru and tour thru the house, and then the epilogue shows how powerful vr education will be\n\nHelpful | 39", "charhashopeJan 25 at 12:26 PM\nIncredible\n\nI have always wanted to go to Annes home. However, Im wheelchair bound. I cant make it up the many stairs. This gave me a chance to really explore and feel like I was there. Annes voice actress was very compelling as well. I only wish it was more fleshed out.\n\nHelpful | 12", "MaestroKrisJun 22 at 7:35 AM\nA Beautfully Moving VR Experience\n\nFirst, it is incredible to experience this on the Quest and walk around in a very detailed rendering of Anne Franks hiding annex. If you have a substantial play-area you can walk around the entirety of each room. Second, the Story experience mode is so touching and moving that all I could do by the end was stand in the middle of my living room and weep. If I was a millionaire I would buy this for every high school English class to present reading Annes diary in a more meaningful and and engaging way than words alone ever could.\n\nHelpful | 1", "eli_seattleMar 21 at 7:49 PM\nSeems to require an American-sized room\n\nYou have to do the 'story mode' before it'll let you do the Tour mode.\n\nBut the Story mode constantly requires you to interact on objects that are beyond the Guardian space in my Dutch-sized apartment. I've tried pretty much every combination of buttons and gestures, and can't figure out how to access them.\n\nThere isn't any help or instructions in the app.\n\nErg vervelend!\n\nHelpful | 4\nDeveloper ResponseMar 24 at 3:41 AM\n\nHello there. Sorry to hear you are having troubles. You can 'navigate' by using the controllers to get you closer to objects. Look for the 'footprints' on the ground and then use the trigger on the controls to go there. Let me know if this helped!", "nottus12Mar 29 at 3:13 PM\nI love Jews there good with money\n\nI learned that on family guy\n\nHelpful | 9", "nizkaJun 21 at 7:28 PM\nGood experience\n\nI liked it, though, it is more of audiobook with some interaction. I really enjoyed the artistic side of the rooms - furniture, light, props, it gave this atmosphere of Second World War times. Some of the objects I recognized as seen in my granmda's house and her childhood photos. Really touchy. But, as a used, I wanted more interaction. Thank you very much, guys, for this app. I was impressed.\n\nHelpful | 1", "kimbiecookieJan 25 at 8:12 AM\nWonderful VR experience\n\nGreat experience! Just like if you were able to tour the Anne Frank house in Amsterdam. I love you can interact with certain objects while listening to the very well narrated quotes from her diary. I do wish it was a little smoother with the transition room to room instead of having to position your feet but it's free and well put together. The graphics are beautiful. The story is then told through pictures of Anne's family and of Nazi Germany. It was an emotional experience that had me tearing up at the end. Had to tale off my headset so I didnt get the lenses wet!\n\nHelpful | 5", "tompoesingJun 29 at 6:04 PM\nBest vr experience for educaton\n\nThe story its self was know to me, as i did a presentation on the supject. But the real eye opener was how real the whole experience feld. Like your realy in the room. That is amazing\n\nHelpful | 0", "GogebatJun 23 at 8:26 PM\nMoved\n\nI remember learning about this in school. Yet never in my life would I have found myself stepping outside my own world to experience another. A truly humbling realization that everyone should witness!\n\nHelpful | 0", "linkinprkmxFeb 4 at 4:40 AM\nI have mix feelings\n\nFor a part being a documentarist my self and developing VR stuff as we speak is super interesting to see stuff like this in the Oculus platforms, but this particular title seemed a little bit boring, the first and last parts are movie with stills documentary style then there is the interactive section that is brief, I saw all, I am guessing is a very short version or commercial for the book, so people who watch this might be interested on getting a copy of the book (the people who hasnt read the book), but I instead of wanting to grab a copy of the book, I was discouraged and I like war stories, just I think we have been over saturated of WWII stuff and this is just one more about it, and I get it, the remainder of the WWII is important for it so it doesnt happen again but I am not sure is intelligent to keep showing pity of this particular happening to the world.\n\nI am giving 4 stars because of that, It wasnt interactive enough it was more like a small audiobook of the happening that lets you walk around the really small house but just in the sections where the audio is happening, maybe if you could grab things or open and close doors it is just a documentary style summary of the book.\n\nHelpful | 3", "rp2020Jan 30 at 6:19 AM\nAmazing app\n\nThis is a must experience for everyone. Very well made, very emotional !\n\nHelpful | 8", "fotosaccion04Jan 13 at 3:46 AM\nBeautifully made and very insightfull\n\nBeautiful app!! I love how the story was told including items and allowing you to walk and feel the surroundings. I cannot imagine what they went through in those 2 years.\n\nHelpful | 5", "furtinDec 1 at 1:24 PM\nBreathtaking and heartbreaking\n\nThis is so very well made. The roomscale, the Interface, the various languages, everything is a perfect example of how history lessons should be nade available through VR.\n\nA big thank you to everyone who has worked on this historic experience!\n\nHelpful | 15", "joel.doniger.7Apr 19 at 2:13 PM\n\nIt is educational, but the experience for me isn't that good. get the book.\n\nHelpful | 1", "DrKotulakNov 17 at 4:40 AM\nEducational and well made\n\n5/5. Not only does this give you a dose of history and really made me feel as tho I was on some tour exploring her actual house - its also free! which makes its hard to have complaints. Graphics are great and Experience was smooth and very wel made. Definitely a title to check out you wouldnt be disappointed and have nothing to lose.\n\nHelpful | 12", "dz-uabFeb 6 at 12:49 AM\nGreat VR experience\n\nFor people who don't read books- this is the perfect experience to get to know the story of Anne Frank.\n\nHelpful | 2", "Kimosabe8Dec 25 at 10:49 PM\nIncredible!\n\nYou must experience this tour. Walking through all the rooms, picking up items and looking at all sides, listening to the stories. I can't say it enough, amazing!\n\nHelpful | 2", "hobblin_goblinNov 7 at 12:37 PM\nVery interesting and educational\n\nThis is a great, informative, educational experience. This is a fantastic way to learn about the struggle of the Franks, as it shows you around the Frank House and gives you facts as you move around the environment. Especially considering that this is a free title, I definitely recommend it.\n\nHelpful | 5", "chumblefishNov 19 at 12:51 AM\nA wonderful, moving experience\n\nThis is what makes VR worthwhile, an experience that transports you to a time and place that is real and moves you on a profound level. Thank you to the devs for making this.\n\nHelpful | 3", "Knarf76Mar 29 at 12:13 PM\nAmazing\n\nThis is better than any museum.\nI was very impressed and silent after this experience.\n\nHelpful | 0", "falocNov 30 at 9:38 AM\nVery buggy.\n\nThought this might be interesting but it was full of bugs. Went into a room, only to find I couldn't interact with anything and there was no way back out of the room. No icons appeared to move through doors etc.\n\nHelpful | 8\nDeveloper ResponseDec 2 at 6:14 AM\n\nSorry to hear you are having problems navigating. Send us an email at support@forcefieldxr.com and let's see if we can help you with some tips.", "keith.i.deeJan 4 at 10:36 AM\nDont download\n\nThis thing froze my Oculus. I want it fixed now\n\nHelpful | 3\nDeveloper ResponseJan 9 at 3:08 PM\n\nSorry to hear you are having issues. Please send us an email to support@forcefieldxr.com and let's see if we can fix the problem.", "lucy.langford.9699Jun 26, 2019 at 6:39 PM\nA Must Experience\n\nThis is an incredible piece of work. You are transported back in time to tour the Anne Frank house as it would have been. The detail is amazing. The textures, the lighting, the items recreated, are just wow. If you chose the story mode you will be guided through the home, and prompted to interact with various items in the home. You will then hear and can read excerpts from Anne Frank's diary.\n\nIt gives a real glimpse into what life for this family in hiding was like through her narration, and the recreation of the Annex, where they hid.\n\nIt's truly 360, but can be completed from a seated position, using the touch controls.\n\nOnce you've completed the story, you can then opt to tour the home. My only wish for this was that when the radio plays we could mute the narration to hear what was being announced on the radio.\n\nThis is a must for any history buff, and really in our current political and social climate for all.\n\nHelpful | 155", "PurplemikeyJun 26, 2019 at 6:52 PM\nOne of a kind - must have\n\nThis is an incredible experience that once again prove VR is a unique experience.\n\nStep in the life of a young child surviving the horrors of the Nazis. It is a disturbing, beautiful, terrorizing and horrible experience at the same time. At one moment I was smiling the other moment I was standing still... Terrorized by the dark side of mankind.\n\nThe visuals are outstanding. The sounds are perfect. The experience is one of the most rewarding I played in my life.\n\nVisiting this place in roomscale is something no other VR app can provide at the moment.\n\nGo try it!\n\nHelpful | 73", "bruceo2Oct 5 at 9:37 PM\nNeeds more content\n\nIt would be nice if the notes and articles were readable and just more content but untethered roomscale is very immersive and overall the quality is pretty amazing. So great effort for a free title and definitely demos the educational potential.\n\nHelpful | 1", "roulitopOct 1 at 6:44 AM\nThere was so much more to do...\n\nThis should have been treated with more care. Very long. Boring. I can picture the attempt but This kinda memory tour isnt making you feel anything about the depth of this tragedy. Anne Franck VR experience should have been treated by some people like Felix and paul because it is the sensitivity that must guide the development of such experiences. Too bad this is the experience that might be shown in school and educational courses...\n\nHelpful | 8", "8888George8888Nov 5 at 9:26 AM\nAn amazing experience\n\nIts amazing and emotional and free so I recommend\n\nHelpful | 1", "dantothefaceSep 29, 2019 at 1:51 AM\nA haunting must play\n\nAn incredible and important experience. I've been to the house in Amsterdam many years ago, and whilst this can't compare to that feeling, it's a great approximation. Compulsory content for any Oculus Quest owner.\n\nHelpful | 1", "adam.ruffSep 3, 2019 at 6:54 AM\nPowerful and moving\n\nI thought for sure that given the frivolity and novelty of VR something as profound and meaningful as the holocaust seen through the eyes of Anne Frank would be devalued. How wrong I was. VR made me feel the story and the real impact, the very humanness of the atrocities, and the resilience of the Jewish people more than ever. Who knew you could cry in a VR headset. Thank you to the creators, and may this serve as a template and lesson to all educators that VR has the capacity to be so much more than games.\n\nHelpful | 1", "Emmett1057Jun 26, 2019 at 10:08 PM\nReally amazing\n\nI dont know what I can say about this. Its an experience and I feel Ive enriched my life by taking the time to go through it. I learned about Anne Frank as a child, but hearing the quotes while seeing the space brings a new level of understanding to her words.\n\nIf you love history, youll love this. If youre human, youll benefit from it.\n\nHelpful | 35", "yungsheldonNov 16 at 8:02 PM\nThis is so boring\n\nThis was less fun than watching children grow old. Why did some developer slave away coding this boring game. If it were a book it would be two books. Would not recommend\n\nHelpful | 6", "evansgNov 24 at 2:27 PM\nDidnt like it\n\nIt always stucks when it is starting it quits the game\n\nHelpful | 2\nDeveloper ResponseNov 25 at 1:30 AM\n\nThat sounds frustrating! Might be an installation issue. Email us at support@forcefieldxr.com and lets see if we can help you figure out what is going wrong.", "Lord_18_RabbitAug 28, 2019 at 8:22 AM\nFirst time I cried in VR\n\nFirst time I cried during a VR experience. A beautiful remembrance of Anne Frank, the people living in hiding with her, and the people who protected her. Now that the world seems posed to re-experiment with fascism, this app is a good reminder to stand up to hatred, to combat darkness with love and kindness, and to live from the truth of our beings.\n\nHelpful | 2", "DeathCatOct 18 at 1:20 AM\ngood experience\n\nfull of education vr\n\nHelpful | 1", "TheSwirlingBrainJul 24, 2019 at 10:02 PM\nGreat Experience\n\nIf you know the story of Anne Frank, this app is a great tour through her hiding place. It's so sad to know and see what she went thru and you'll wish that sort of thing will never happen again. The graphics are pretty good and it gives nice info or a page from the diary short stories in some of the places. It seems it's a bit of advertising for the book, maybe that's why this app is free, but it's still worth checking out for sure and it does make you want to buy and read the book.\n\nHelpful | 2", "mythicalmoeAug 28, 2019 at 8:01 PM\nNot Working on Quest\n\nIt works great on the Go, but barely functions on the Quest. You are given two options in the Menu, a Story Mode and a Tour Mode. It will not even let me select the Tour Mode. I can select the Story Mode and skip over the story to get to the Tour but I can not interact with the environment or go in any rooms. I am just stuck in a hallway. The funny thing is there is a little demo on how to interact with the environment and I can go through the Demo, but nothing works for the actual Tour. I have tried uninstalling and reinstalling , rebooting, and a factory reset and nothing changes. I guess I will have to just use the app on the Go. I was really hoping it would work on the Quest because I figured it would be a better experience. I e-mailed support and am waiting for a reply. It is a free App so there is nothing to lose by trying it and it was a great experience on the Go for me.\n\nHelpful | 4\nDeveloper ResponseNov 25 at 1:35 AM\n\nSorry to hear you are having issues with the product. To get to the tour mode you must first play the story mode once. i hope you try it again! And if you are still having issues, please send an email to support@forcefieldxr.com.", "JattierAug 20, 2019 at 9:48 PM\nAmazing experience\n\nBeautiful presentation, stunning visuals. I felt I was in a museum. The voiceovers reminded me of similar real-life museums in the colonial states.\n\nIt also brought home how terrifying hiding there must have been.\n\nHelpful | 2", "SalikenJul 2, 2019 at 9:12 PM\nYou dont have to travel anymore!\n\nIt is like you are really in the attic that Anne Frank lived! Travel will become obsolete now. I gave a lot of credit to Anne Franks father who tried to keep them safe and did so for 2 years. It is a sad story but one that everyone should learn about and now they can actually see what it was like. Try it!\n\nHelpful | 5", "CasualCheetahSep 4, 2019 at 8:31 AM\n\nAn important story and beautiful museum piece set within an immersive roomscale experience. Thanks for making this narrated tour so accessible.\n\nHelpful | 0", "obi2kenobiJun 27, 2019 at 8:34 PM\nStirs some emotions...\n\nI didn't know anything about Anne Frank before this experience (not in any detail anyway).\n\nWalking around the rooms, listening to the narration of her diary excerpts, I almost felt a connection by the end and felt tremendously sad when her death was announced, even though this was all 70+ years ago. The excellent narration and beautifully rendered rooms make it feel that real.\n\nI am taking a star away because there are a lot of immersion breakers for me, like not being able to go up stairs and being able to point and click at obvious digital buttons on doors to open them instead of reaching for the knob.\n\nI really did enjoy the experience, and of course it is free, but there are a lot of things that could have made it more immersive like having the hands grab objects instead of your hand just becoming a book when you move near it, option to turn off the teleport footsteps, etc\n\nHelpful | 7", "sebastian.kurz.583Jun 28, 2019 at 12:56 PM\nPhantastic\n\nLike being there - really. This is VR. I really confused my appartement with the virtual one.\nVery well made and polished, you see the varnish on the wooden interior, close to photo realism.\nI love this development team which also brought the awesome National Geographics Explore VR.\n\nHelpful | 17", "JJZabaJun 27, 2019 at 11:49 AM\nAt last, VR experiences arrive\n\nAfter getting worried the Quest store would just be console style games, as fun as they are, it's great to finally see a quality VR experience appear. Graphics are impressive and it's like having a private tour of the house. Being able to move around really increases the immersion, recommend if you can doing this standing with enough room to walk around as it's an amazing experience. At one point I almost fell over as I reached out to grab the stair rails to look over the edge! Story takes around 30mins, then you can go back and explore the house and take your time. Don't miss out on this.\n\nHelpful | 12", "VertigeVJun 26, 2019 at 8:56 PM\nImpressed\n\nVery well done, clean and simple UI, gorgeous environment, very professional, and I learned a lot. I've heard the name before but I wasn't familiar with the details of her living conditions. Highly recommended experience.\n\nHelpful | 6", "TheRealGoldenNinja50Sep 8, 2019 at 8:06 PM\nGlitchy, confusing\n\nThis could have been so much better. Its slow moving, boring, nothing seems to work and you feel like your in a boring museum or history class without the freedom to explore the vr surroundings.\n\nHelpful | 2\nDeveloper ResponseNov 25 at 1:33 AM\n\nSorry to read that you are having issues. If you want to email us at support@forcefieldxr.com, maybe we can help figure out what is causing the glitchy-ness.", "Grimlock_ArtsJul 28, 2019 at 12:48 PM\nPlease add joystick locomotion\n\nGreat historical experience. I really hope more experiences like this one are in the future for the Quest. I do however really wish the developer would have included the ability to use locomotion to get around in the environments. Warping is really bad for immersion and while it is a good option to fall back on it takes a lot away from the experience. Locomotion really should be a default option for VR. I have yet to finish this experience in hopes that locomotion will be added in time. Walking around the environment didn't work well because it never seemed to align with my play space.\n\nHelpful | 1", "dannyjk360Aug 5, 2019 at 10:21 AM\nBrilliant\n\nWhat an amazing experience. What a gift that this is available in so many languages. Anne Frank's story is so important and this is a spectacular way to experience it. I recommend it to everyone.\n\nHelpful | 0", "DAX_QcSep 8, 2019 at 9:17 AM\nShort and to the point\n\nHuman insanity\n\nHelpful | 0", "PalomedesJul 18, 2019 at 2:10 AM\nVR at its best\n\nI have experienced this before on another headset but this app is so much better on the quest. This is a well thought out and put together experience that is as an emotional journey. I am so glad apps like this exist, to make sure this story is never forgotten.\n\nHelpful | 1", "Chris_StaceyJun 26, 2019 at 5:47 PM\nInspirational\n\nPlease, somebody put Donald Trump and Boris Johnson in this experience. Having to dry my headset from the tears. Give peace a chance. x\n\nHelpful | 27", "DrkzvoskyJun 27, 2019 at 6:46 AM\nGreat experience\n\nNew to Quest VR, but things like the Anne Frank House are one of the reasons I wanted to purchase the Oculus. It is a beautifully designed experience. Just note, you will need to stand and allow yourself some freedom of movement. I tried sitting down at first and it was difficult to interact with somethings, open doors, turn around, etc. But once standing the experience was one of the best I've had in VR so far.\n\nHelpful | 6", "radtekJul 1, 2019 at 4:03 PM\nGreat app. One problem\n\nThis is education at its best. There should be more apps like this. History, science and technology etc. The only issue I am having is the program will not play tour mode. It plays story mode just fine. Tour mode can't even be selected. Five stars if tour mode was working.\n\nHelpful | 3\nDeveloper ResponseJul 3, 2019 at 2:55 AM\n\nThank you for your review. Have you completed 'Story Mode'? If not then Tour Mode remains locked until you have played through it once. If you have played through Story Mode and Tour Mode is still locked, then please contact us at support@forcefieldxr.com and we can take a look at it further.", "drdoak2000Jun 29, 2019 at 6:51 PM\nExtremely well put together vignette\n\nThe environments are the most immersive I have seen on the Quest. The textures are good, on the Quest scale, but the small environments really shine in VR. It just feels so real. Not just \"I was distracted and tried to lean on a wall\" immersion, it feels real just standing there watching and listening. Far more than I would expect from a VR game normally.\n\nThe voice actress was fantastic. Full of hope and youth. She has a light accent that flavors the text perfectly.\n\nIt's a beautiful experience and sets the bar for future historic places/museum virtual recreations.\n\nHelpful | 4", "ByronFisk02Jul 14, 2019 at 4:48 PM\nEmotional/touching\n\nBefore I downloaded this app, I did not know alot about the ann family, but after this I know so much, It touched my heart and its so heart warming that I can go back to the stage this happened and see what It was really like, I recommend this to everyone!!\n\nHelpful | 0", "ray.bradshaw1Aug 25, 2019 at 3:21 AM\n\nExcellent graphics and very sad story .recommended\n\nHelpful | 1", "superboo07Jun 30, 2019 at 6:35 AM\nMust play\n\nA very thought provoking experience. I had originally tried this on the go and that was great. I would go back to the go version before the game released on quest, Im definitely going back to it again today and the next day. I loved the art style. The modeling is perfect. I just wish that you didnt have to walk on the two feet every time you went to a new room, I wish it would auto center you in the next room. Maybe you should add an option to do that. This game is what made me want to but the diary of a little girl. I havent bought it yet but Im definitely going to in the near future. If you havent played this game then what are you doing with your life, it will change you. The secound i saw it had been put on the oculus store I got it and played through the whole thing.\n\nHelpful | 1", "ThereIsNoGodJul 1, 2019 at 10:56 PM\nReality\n\nI first visited the Anne Frank house in 1978, so long ago I had forgotten most of what I had seen. This brings back memories and adds to them. 41 years ago we were not able to enter all areas, and were limited in time. This experience does not have those limitations, although I do wish we could view the tree outside and perhaps the sky as they saw it.\n\nThis experience is so very powerful. Back then I also visited Dachau, which really drove home what happened to these poor people. I wept then, and I weep now. Thank-you so very much to those that made this VR experience, and to those that care for the Anne Frank house. The hideousness that man is capable of must never be forgotten, and we must fight continually to prevent it.\n\nHelpful | 0", "ericbazingaJun 30, 2019 at 7:04 PM\nDang near cried\n\nVery well made reconstruction of the Annex, and the experience also includes a guided tour showing off every room of the Annex along with quotes from Anne's diary throughout. At the end I almost teared up a little, it just hurts that something so terrible happened to her (and to thousands of others) only because they were Jewish.\n\nTo the developers who made this, bravo. If you haven't tried this already, absolutely do so.\n\nHelpful | 0", "aikon82Jun 27, 2019 at 2:56 PM\nPowerful stuff, well worth a watch.\n\nFelt compelled to write a review for this, it's one thing hearing about this when I was at school but seeing the rooms in VR with quotes from the book is so much more immersive and as relevant today as it was back then. Takes around 20-30 mins to go through the story, very poignant.\n\nHelpful | 3", "ElyrthalJun 27, 2019 at 11:28 AM\nStunning immersion...\n\nLike most French kids of my generation (or is it still the case nowadays?), I read the book at school.\nSo finally discovering this place where Anne and hers were hiding is honestly moving, especially with an incredible feeling of being there thanks to a truly realistic modelisation and texturing, beyond what I believed the Quest to be able of.\nFor those who know the Rift version which is a simple 3DOF experience, the Quest is a full 6DOF environment: if you have enough space IRL, you can walk around to discover Annes apparement in all its details.\n\nWith many dubbed languages for Annes narration voice, this piece of Art & History cant be overlooked and must be shared among your relatives as a still too actual testimony of our dark past.\n\nHelpful | 3", "rmcmurrerJul 3, 2019 at 7:02 PM\nHistory Comes To Life\n\nI really enjoyed it. I tried the tour in story mode and it was like an interactive history lesson. I hope they make more apps like this with other places from different places in history.\n\nHelpful | 2", "ExcessPanacheJun 27, 2019 at 2:52 AM\nEssential\n\nNot a game but an interactive museum exhibit. Not too long, not too imposing for people new to VR, and despite a few lengthy loading spots its technically and visually impressive. And its free!\n\nHelpful | 8", "roseplateAug 19, 2019 at 5:57 PM\nSooooo goood\n\nFun\n\nHelpful | 0", "JAMs1969Jun 27, 2019 at 4:43 PM\nLove It!\n\nThis is a well made VR experience but a very sad story. I seen the movie and read the books but being able to walk thought the rooms that Ann and her family lived in for 2 years really brought this true story to life. Great Job!\n\nHelpful | 3", "daniel.a.doughertySep 19, 2019 at 2:41 PM\nLoading problems on Quest\n\nI've downloaded, uninstalled, and re-downloaded this on my Oculus Quest and no matter what I do, the experience will just not load up. I actually visited the historical site and toured the annex in Amsterdam last year. I look forward to this being fixed so I can experience the app update my review.\n\nHelpful | 0\nDeveloper ResponseJul 18, 2019 at 12:53 AM\n\nWe're sorry to hear this Daniel. Please contact us at support@forcefieldxr.com so we can help resolve this issue.", "dphahnJun 29, 2019 at 5:30 PM\nSomething everyone should see\n\nThis is a brief and wonderful glimpse into the Anne Frank house. What better way to spark one's interest in history then to immerse them in a virtual tour. I will make sure everyone in my family sees this.\n\nHelpful | 2", "Berzerker7777Jun 28, 2019 at 9:12 PM\nIncredibly humbling\n\nWhat a wonderful use of virtual reality. Its and incredibly humbling experience to see here and feel the scale of the living quarters and conditions. As a community we need many more of these experiences.\n\nHelpful | 0", "KrymBaltimoreJul 22, 2019 at 5:48 AM\nyawn\n\nboring. uninstalled after a few minutes. might be interesting to you. don't know. wasn't at all to me. i like history and i read often so i thought this would be something that held my interest but i was wrong.\n\nHelpful | 4", "theroundaboutJul 1, 2019 at 4:12 PM\nPuts things into perspective\n\nWhen life feels overwhelming this is a good reminder of how good we have it.\n\nI read her diary as a teenager but touring the hideaway made it feel so much more real.\n\nHelpful | 2", "michael.smith.7792Jul 18, 2019 at 8:36 AM\nExceptional!\n\nAnne Franks writings have always moved me. This brings that to an entirely new level.\n\nHelpful | 1", "Azazel08Jul 13, 2019 at 5:00 AM\nAn emotional masterpiece\n\nThis is a VR educational experience that can't be effectively recreated without VR. I wish everyone could experience this.\n\nHelpful | 0", "mcwhorterbryanJun 29, 2019 at 3:58 PM\nA must see\n\nThe blend of history, emotion and emersion create an amazing experience that is quite moving. This is a timely experience, with all that is happening in the world.\n\nHelpful | 2", "rocknrolzJul 4, 2019 at 7:42 AM\nLoved this!!!\n\nThank you so much for this. I feel there is no need to go on-site for an actual tour because of how real and incredible this felt. Amazing.\n\nHelpful | 2", "donthavetobecrazyJul 7, 2019 at 3:14 PM\nAn essential experience\n\nA relatively basic and quite short an experience, but this does not detract from the unique ability of VR to make it both impactful and \"enjoyable\".\n\nHelpful | 1", "kalsolarJul 1, 2019 at 1:20 PM\nJust Wow\n\nThis looks so good, so authentic, so detailed that I had to keep reminding myself that I couldn't actually sit on the furniture. Just amazing.\n\nHelpful | 1", "goastkillerJun 26, 2019 at 6:00 PM\nAmazing\n\nIf you are a history nut then you will be touched by this amazing experience if you are not you will be moved still.\n\nHelpful | 6", "RiftmasterTVJul 16, 2019 at 3:55 PM\nExtremely interesting\n\nI really enjoyed being able to be \"inside\" Anne Frank's diary\n\nHelpful | 1", "Aro3891Jun 27, 2019 at 2:40 PM\nGoing back in time\n\nThis is really good experience on quest, it transport you back in time during ww2 in a little girl hiding place....i recommend it\n\nHelpful | 2", "z_c00lJul 7, 2019 at 8:47 PM\nGreat work\n\nI visited Anne Frank house many years back. This experience really bring back memories. Thank you.\n\nHelpful | 1", "NVRflameJun 28, 2019 at 2:47 PM\nGreat its Free\n\nDefinitely worth trying as its free.\n\nI did feel bad for the girl it was about however the experience didnt really make me feel like I was there so very disappointing.\n\nTry it, just dont expect it to transport you to seeing through someone elses eyes like you know virtual reality will one day do.\n\nHelpful | 3", "TrickxusJul 6, 2019 at 8:01 PM\nIt's captivating\n\nSuch a beautiful and unique experience to have a glimpse into the history like this\n\nHelpful | 0", "davidro14Jul 2, 2019 at 7:12 AM\nIncredibly well done\n\nA really great app. Masterfully done, intelligent, beautiful, easy to use... And free!\n\nHelpful | 0", "VRvinbeanselJun 27, 2019 at 1:56 AM\nSuperb\n\nWow looks stunning for Quest and really interesting and all for free really worth trying\n\nHelpful | 2", "sarurururuJun 28, 2019 at 6:17 AM\nMy first tears in the quest\n\nThis is what immersion is about and a better museum is now at your home.\n\nHelpful | 3", "BossbeastJun 27, 2019 at 2:55 AM\nVery good\n\nEnjoyed this on Go and just as much on Quest but found the load times were very long between rooms.\n\nHelpful | 1", "ReactivePeakJul 1, 2019 at 12:03 AM\nIncredible, and FREE?\n\nI love how fun and educational this game is! And because is free, th\n\nHelpful | 1", "knuklesoboyJul 11, 2019 at 11:44 PM\nAmazing\n\nThis is a peace of art\n\nHelpful | 0", "top115Jun 28, 2019 at 5:01 PM\nTry it you miss out if not\n\nDont expect a game but a very deep experience\n\nHelpful | 1", "CanidooSep 16, 2019 at 4:07 PM\nBad\n\nAll u do is read, me is no read. ME IS FORTNITE\n\nHelpful | 13", "johngraffJun 27, 2019 at 11:43 PM\nMust experience\n\nNever forget\n\nHelpful | 2", "Tummie555Aug 24, 2019 at 2:37 AM\nThe whole museum to yourself.\n\nOnly VR can do this.\n\nHelpful | 0", "biggoose123Jun 27, 2019 at 7:40 AM\nOmg\n\nAnne frank is a girl i didnt know....\n\nHelpful | 3", "soundslikestevenJul 11, 2019 at 11:46 AM\nMostly reading\n\nNot much of an experience. Basically lots of reading and seeing a few static rooms. Underwhelming.\n\nHelpful | 1", "samuraidude2008Jul 30, 2019 at 5:37 AM\n\nAbsolutely hated it why play this game\n\nHelpful | 3", "RubberJohnny1Jul 17, 2019 at 8:32 PM\nCrashes\n\nInteresting, but it crashes often.\n\nHelpful | 1\nDeveloper ResponseJul 18, 2019 at 6:54 AM\n\nSorry to hear you are having problems. Please email us at support@forcefieldxr.com and lets see if we cab fix your problem.", "AvispinJun 28, 2019 at 8:28 AM\nBoring/aburrido.\n\nA 360 visit of some rooms.\n\nHelpful | 9", "ThinkintuitJun 29, 2019 at 9:42 AM\nAmazing, distressingly topical\n\nThis was a very moving experience; it was amazing to experience being in that space and hear selections from Anne's diary. It brought me back to reading her diary so many years ago, and added a whole new dimension to the experience. I only wish it was not so relevant to the current situation, with children suffering and being traumatized in US concentration camps -- but that makes it all the more important. Highly recommended!\n\nHelpful | 1", "CoaxJun 26, 2019 at 10:52 PM\nA truly unique experience\n\nI just have to say that this is one of the greatest, if not the best, experience on the Quest. VR enables an immersion that even literature cannot offer. Get this now. I mean it's free, what's stopping you?\n\nHelpful | 9"]