{"App Title": "Apex Construct", "App description": "Apex Construct is a story-driven, single player VR action/adventure. Wield an upgradable bow & shield combination to battle enemy robots while exploring and solving mysteries in a shattered world.\n\nEXPLORE A WORLD RIPPED APART\nStep into a beautiful yet perilous post-apocalyptic setting, where two powerful AIs are locked in a drawn-out conflict. As the only living human, you will uncover its many secret areas and solve intriguing puzzles\n\nMASTER A FLUID BOW & SHIELD COMBINATION\nUse a flexible weapons system with unparalleled precision to engage a wide array of artificial lifeforms created by a mysterious entity called Mothr\n\nDELVE INTO A LASTING EXPERIENCE\nReplay any mission from your customizable home base to uncover paths still hidden & spend acquired resources to upgrade your weapons and equipment\n\nCONQUER THE CYGNIA CUP CHALLENGE\nHit the targets, keep the combo meter up and maximize your score in the pre-apocalyptic arena to dominate the global leaderboards", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Shooter", "Languages": "English, English (US), English (UK), French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "39.0", "Developer": "Fast Travel Games", "Publisher": "Fast Travel Games", "Website": "https://www.fasttravelgames.com/apex-construct/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Fast Travel Games\nGames\nAbout\nPeople\nConnect\nFast Travel Game AB\nPrivacy Policy\nPrivacy Policy\n\nFast Travel Games AB, a Swedish corporation, with business offices at Hgbergsgatan 18, 11620, Stockholm, Sweden (FTG) respects your privacy and provides you with this Privacy Policy (Privacy Policy) so that you may understand the ways in which we do and do not use the information you transmit when accessing and playing our Games, accessing and using websites, platforms, software services and related services (hereinafter the Game). Please observe that your access and/or playing of the Game constitutes your acceptance of this Privacy Policy as well as our Terms of Use. \n\nIF YOU DO NOT AGREE WITH THIS PRIVACY POLICY PLEASE DO NOT ACCESS AND/OR PLAY THE GAME.\n\n\n\n1. Definitions\n\nApplicable Data Protection Legislation means any legislation in force from time to time which implements the European Union Directive 95/46/EC and Directive 2002/58/EC and the General Data Protection Regulation (GDPR) 2016/679 of April 27th, 2016 and is applicable to this Agreement and all other applicable laws and regulations that may apply to the transfer of Personal Data.\n\nPersonal Data shall mean any information relating to a Data subject; an identifiable person is one who can be defined, directly or indirectly, notably by reference to an identifier such as a name, an identification number, location data, an online identifier, or to one or more factors specific to his/her physical, physiological, genetic, mental, economic, cultural or social identity of that natural person. Contact data and Service Data are Personal Data.\n\nContact Data means any names, phone numbers, e-mail addresses and certain financial details held within commercial systems to conduct the Parties relationship management and billing transactions between the Parties;\n\nController, Data Subject, Personal Data, Process/Processing and Processor, shall have the same meaning as in the European Union Directive 95/46/EC or the General Data Protection Regulation 2016/679 of April 27th, 2016.\n\nService Data means any Partys Personal Data (that is not Contact Data) held within the Parties systems, applications or databases and that may be accessed, processed, used or stored as a consequence of performing the services under the Agreement.\n\nThird Country means a country that is: (i) outside of the European Economic Area; and (ii) not the subject of a formal decision by the European Commission, made pursuant to Section 25(6) of the European Union Directive 95/46/EC or under Article 45 (1) of the General Data Protection Regulation 2016/679, stating that that country ensures an adequate level of protection for personal Data.\n\n\n\n2. Collection of information\n\nInformation collected through the Game\n\nWhere applicable, access and playing of certain basic Game versions, experience of certain basic content and games features may not require registering of an account with applicable platform/service providers that are providing the Game etc. to you. However, in order to access and/or play the complete Game, access certain premium game functions, levels, content and features you must register an account with the platform/service providers that are providing the Game etc. to you. You must then create an account with the platform/service providers platforms that hosts the Game to access such premium game functions, levels and content etc. To create an account you are required to provide certain mandatory information such as your name, your email address, account login etc. which is mandatory in order to be able to establish an account. FTG and/or the platform/service providers (i.e. Steam, Google Play, PlayStation (PSVR), Xbox etc.) collects financial information on the terms and conditions set out in this Privacy Policy. FTG does not use financial information for any purpose other than processing payments. Further you may, but may not be required to, provide certain voluntary information such as date of birth, screen name, your personal profile in the Game, interests in and use of various games, products and services, and any other personal or preference information which you may choose to voluntarily provide.\n\nFTG may also collect and process other information when you interact with the Game online, such as the type of browser you are using, the type of operating system you are using; the IP address or other unique identifier such as a device identifier of any of your computer(s) or device(s) that you are used to access the Game. Such information will be collected and processed irrespective of whether you only access the Game or if you actually play the Game. FTG may also collect and process certain information when you as a user with a user account interact with the Game such as the information in your personal profile, the relationships you form in the Game, the messages you send, the teams you form, the events you set up, the applications you add and the information you transmit information through various channels.\n\nInformation collected through other sources\n\nFTG may also collect information about you from other sources, such as third party sites or platforms, newspapers, blogs, instant messaging services, and other End Users of the Game through the operation of the Game in order to provide you with more useful information and a more personalized experience.\n\n\n\n3. Cookies and logs etc.\n\nCookies\n\nA cookie is information a website places on your computers hard drive so that the website is able to remember your preferences and/or which pages you visited on the website and make your visit more efficient and enjoyable. FTG may use cookies to determine the number of unique players of the Game over a given period, or to remember user account details, etc. so that the need for multiple log-ins is eliminated. It may combine information collected through cookies to any Personal Data submitted online when using the Game to help personalize a users access to and playing of the Game. Cookies may be disabled on your computer by indicating this in the preferences or options menus in your browser.\n\nLogfiles\n\nLog files are files that log actions that have occurred on a website. FTG may collect data in the form of log files and may use such log files to gather statistics about End Users user habits and to assess overall Game activity, including how many hits a particular web page is getting and other navigational data. These entries are generated anonymously, and enable FTG to track interest in specific promotions, troubleshoot technical concerns, and provide End Users with content that may be of interest to them. Log files are used internally only, and are not associated with any particular user, computer, or browser.\n\nWeb beacons\n\nThe Game may use a variety of technical methods for tracking purposes, including Web beacons etc. Web beacons are small pieces of data that are embedded in images on the pages of the Game. We may also use these technical methods to analyze the traffic patterns in the Game such as the frequency with which End Users accesses various parts of the Game etc. These technical methods may involve the transmission of information either directly to us or to another party authorized by us to collect information on our behalf. The information from use of these technical methods may be collected in a form that is personally identifiable.\n\n\n\n4. Use of information  Purpose and legal basis\n\nFTG will use information about you for the following purposes in accordance with applicable laws:\n\nAge identification\n\nTo identify your age for data protection purposes, for example to determine the legal requirements for processing of Personal Data. We requests that anyone under the age of 18 not send any Personal Data about themselves over the Internet unless sent under the supervision of their parent or guardian. We do not knowingly collect Personal Data from children under 13 years old in the Game. We believe it is important to safeguard the privacy of children and encourage parents to regularly monitor their childrens use of online activities. If you believe your child under the age of 13 has accessed and/or played the Game and provided personally identifiable information to us, please contact us at privacy@fasttravelgames.comor the mailing address at the end of this Privacy Policy and we will work to delete that account and any such personally identifiable information. This in compliance with Article 6(1)(c) of the GDPR.\n\nInformation you provide or is collected from you in or in relation to the Game and information from other sources\n\nInformation is provided by you or collected in or in relation to the Game and/or collected from other sources in order to:\n\nprovide, operate, improve and maintain the Game, game experience and services, your account(s);\n\npersonalize the Game, content, loyalty programs and related services to you;\n\nsend technical notices, updates or security alerts,\n\nfor support and troubleshooting reasons;\n\nsend support and administrative messages\n\nprovide news and information about the Game about our games and products;\n\nmonitor the end users playing of the Game and activities in the Game;\n\nfacilitate sharing on social networks;\n\nprovide adults with advertising in accordance with given consent and/or permissible laws;\n\nprovide children reasonable contextual advertisements in the Game accordance with permissible laws;\n\nidentify, fix, and troubleshoot bugs and service errors, provide software updates etc;\n\nresolve disputes, investigate and help curb fraud and illegal behavior, comply with the law, and to enforce our agreements and policies;\n\nsurvey end-users opinions about the game and related matters through surveys;\n\ncommunication reasons related to the Game and related matters;\n\nmanage the Game and send you confirmations and important information about your account, products, purchases, subscriptions, and warranties;\n\npresent offers and/or information relating to the Games and other games that you might like;\n\nmake recommendations to you; and\n\npersonalize advertising for you and deliver targeted marketing, service updates and promotional offers.\n\nProcessing of this information is necessary for the purpose of performance of a contract to which you are party in order to support the operation of the Game facilitate the delivery of requested products and services and enable maintenance and update of the Game under Article 6(1)(b) of the GDPR and purposes is justified by our legitimate interests in providing advertisements and content of interest to you and improving our services in accordance with Article 6(1)(f) of the GDPR (the balancing-of-interest rule). Disclosure of your advertising ID to third parties for the purposes of behavioral advertising is based on your consent in accordance with Article 6(1)(a) of the GDPR. We only process information about you to the extent that is necessary to achieve the purposes for which the information has been collected.\n\n\n\n5. Storage of Personal data\n\nWith respect to processing of Personal Data FTG is Data Controller. FTG shall (i) Not keep the Personal Data for longer than is necessary for the purposes of performing the Agreement unless further storage is required in order to establish, exercise or defend a legal claim or to comply with applicable law, including accounting rules; (ii) Store, process and use the Personal Data for the sole purpose of performing the Agreement; and (iii) Ensure that their employees and employees of their affiliates and subcontractors involved in the performance of the Agreement comply with the provisions of this agreement (iv) Implement all reasonable technical and organizational measures to protect your Personal Data against any accidental or unlawful destruction, unauthorized alteration, accidental loss, communication or access, (v) Where applicable report to you, upon its occurrence, any unauthorized access, disclosure, use, modification or destruction of your Personal Data, (vi) Refrain from exporting or transferring your Personal Data to any Third Country, and from collecting, using or Processing Personal Data within any Third Country, unless prior to the transfer we have ensured that an adequate level of protection of the Personal Data has been implemented in accordance with the terms and conditions stated in section 9 of this Agreement (International Data Transfers). Personal Data are deleted or anonymized as soon as it no longer serves one of the above mentioned purposes and in any event no later than three (3) years after your interaction with us has ended.\n\n\n\n6. Information we share with third parties\n\nAs a general rule we will not share Personal Data that directly identifies you (such as your name, postal address or e-mail) with independent third parties without your consent, unless it is either required by law or we determine that disclosure is reasonably necessary to enforce our rights, property or operations or to protect our players or third parties. We may share anonymous or aggregated information, or other data that does not directly identify you, with third parties, for instance your persona on leaderboards or to show trends about use of our products.\n\nNotwithstanding the foregoing, we may share information about you with certain third parties based on the legal basis in Articles 6(1)(b), 6(1)(c) and 6(1)(f) of the GDPR as follows:\n\nThird Party Agents and Contractors\n\nWe may share information about you with third party agents and contractors in order to provide the Game to you, for ongoing development, for analytical purposes etc. We will only provide information to such third party agents and contractors for their performances of their specific assignments for us and consistent with this Privacy Policy, and for no other purposes and provided that such third party agents and contractors have ensured an adequate level of protection of the Personal Data in accordance with all Applicable Data Protection Legislation and/or though agreements with us.\n\nSocial networks\n\nWhere the Game and related services is accessed and/or provided through social networks.\n\nThird parties\n\nWhen required by applicable law, regulation, rule, legal process, in the process of negotiations of, any mergers and acquisitions, sale of any company assets, financing or acquisition of all or a portion of our business by another company where personally identifiable information submitted to us may be transferred to the acquiring entity.\n\nCourts, law enforcement agencies, legal authorities etc.\n\nWhen ordered or requested by courts, legal authorities etc. and required in order for us to abide by applicable laws, or to protect our rights, in defense in law suits, property or safety of FTG, the Game, end users etc.\n\nOther end users\n\nIn order to provide certain Game features.\n\nAdvertising networks\n\nFor advertising purposes. We may share your advertising ID with advertising in order to serving behavioral advertisements to you within the Game if you have given consent in accordance with Article 6(1)(a) of the GDPR.\n\nWhere applicable certain third parties use of Personal Data will not be covered by this Privacy Policy. In such instances you must review such third parties privacy policies.\n\n\n\n7. Payment information\n\nIn order to access the complete Game, certain premium game functions, levels, content and features etc. you are required to pay certain fees. When purchasing such features and functions etc. you may be asked by the platform/service providers to provide certain personally identifiable information, such as full name, billing address, email address, phone number and credit card number/expiration date etc. Please note that you must be the age of 18 or older to make purchases in the Game, however children over thirteen but under eighteen may access and play the game under the supervision of a legal guardian.\n\nOnce End Users have successfully entered valid credit card information etc. and completed the order process, a purchasing account will be created and maintained for them. The platform/service providers will use the information provided to process the End Users order and to send order confirmations via email, as well as to make future purchases easier for the End User. FTG does not sell, transfer or share customer information with third parties, except where applicable the information is transferred, disclosed and shared with its third-party agent(s) who uses the information solely to handle and deliver certain online activities necessary to operate FTG business (e.g. processing orders and payments).\n\n\n\n8. Security\n\nFTG has taken reasonable steps to ensure that the personally identifiable information it collects is secure and we have taken reasonable measures to protect the confidentiality, security, and integrity of the Personal Data collected from our Games End Users. Personal Data is stored in secure operating environments that are not available to the public and that are only accessible to authorized employees and contractors. We have security measures in place to protect the loss, misuse, and alteration of the information under our control. However, there is no such thing as perfect security. As a result, although we strive to protect personally identifying information, we cannot ensure or warrant the security of any information transmitted to us through or in connection with the Game, that we store on our systems or that is stored on our service providers systems.\n\nPlease note that FTG may provide links to other games and websites that are operated and hosted by third parties who may have their own information collection practices. Those other websites and games are governed by their own privacy policies, which may be substantially different from FTG policies. Visitors to other games and websites are encouraged to review the privacy policies and information collection practices of those websites.\n\nAny improper collection or misuse of User Content or information provided in the Game is a violation of the Terms of Use and should be reported to FTG at privacy@fasttravelgames.com. \n\n\n\n9. International Data Transfers\n\nWe may transfer and share your information to third parties (including service providers operating on our behalf) which may be located in countries outside the European Union (EU) and/or the European Economic Area (EEA) which may not have the same level of data protection laws as those in the country where you are located. Where your data is sent to a country outside the EU/EEA that is not subject to an adequacy decision by the EU Commission, the transfers will only occur based on the following safeguards: i) If the entity is certified to comply with the principles for data protection under the US-EU Privacy Shield Framework (Privacy Shield) (see Privacy Shield at www.privacyshield.gov), or ii) If we have entered into EU Commission approved standard contractual clauses with the entity, which is deemed to offer sufficient safeguards with respect to the protection of the privacy and fundamental rights and freedoms of individuals.\n\n\n\n10. Your Choices and Controls\n\nYou have the following rights regarding your Personal Data:\n\nThe right to request access\n\nIn accordance to Article 15 of the GDPR you may request access to processed Personal Data. This includes confirmation as to whether or not personal data concerning him or her are being processed, and, where that is the case, access to the personal data and the following information:\n\nthe purposes of the processing;\n\nthe categories of Personal Data concerned;\n\nthe recipients or categories of recipient to whom the Personal Data have been or will be disclosed, in particular recipients in third countries or international organizations;\n\nwhere possible, the envisaged period for which the personal data will be stored or, if not possible, the criteria used to determine that period;\n\nthe existence of the right to request from the controller rectification or erasure of personal data or restriction of processing of personal data concerning the data subject or to object to such processing;\n\nthe right to lodge a complaint with a supervisory authority;\n\nwhere the Personal Data are not collected from you, any available information as to the source;\n\nthe existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing for the data subject.\n\nWhere Personal Data are transferred to a third country or to an international organization, you have the right to be informed of the appropriate safeguards pursuant to Article 46 relating to the transfer.\n\nYou shall be provided a copy of the Personal Data undergoing processing. For any further copies requested, we may charge a reasonable fee based on administrative costs. Where you makes the request by electronic means, and unless otherwise requested by you, the information shall be provided in a commonly used electronic form. The right to obtain a copy shall not adversely affect the rights and freedoms of others. Please note that access may be restricted due to intellectual property or trade secrets.\n\nThe right to object\n\nYou have the right to object to the Personal Data processing on grounds relating to your particular situation when the data are processed based on the balancing-of-interest rule in Article 6(1)(f) of the GDPR, see Article 21 of the GDPR. In this case, we will cease the processing unless there are compelling legitimate grounds for the processing which override your interests, rights and freedoms or if the processing is necessary for the establishment, exercise or defense of legal claims. You have the right to object to our processing of your Personal Data for direct marketing purposes at any time. We will cease the processing of your Personal Data for this purpose after the objection. Please note that if you exercise this right, your user license to use the Game and related services will cease automatically.\n\nRight of correction and erasure\n\nYou have the right to have inaccurate Personal Data rectified, in accordance with Article 16 of the GDPR.\n\nYou have the right to have your Personal Data erased where one of the following grounds applies, see Article 17 of the GDPR:\n\nThe Personal data is no longer necessary in relation to the purposes for which it was collected or otherwise processed,\n\nif you have withdrawn your consent and there are no other legal grounds for the processing,\n\nif you have objected to the processing and there are no overriding legitimate grounds for the processing,\n\nthe personal data have to be erased for compliance with a legal obligation in Union or Member State law,\n\nthe personal data have been unlawfully processed or\n\nthe personal data have been collected in relation to the offer of information society services.\n\nPlease note that your right to erasure may be limited if the data are necessary for compliance with a legal obligation or for the establishment, exercise or defense of legal claims.\n\nThe right to restriction\n\nYou have the right to obtain restriction of processing in certain circumstances, in accordance with Article 18 of the GDPR. If you have the right to restriction, we will only process your Personal Data with your consent or for the establishment, exercise or defense of a legal claim or to protect a person or important grounds of public interest.\n\nThe right to withdraw consent\n\nIf we have asked for your consent to our processing of your Personal Data, you have the right to withdraw your consent at any time, in accordance with Article 7 of the GDPR. If you withdraw your consent, we will cease processing of the Personal Data for which you have withdrawn consent, unless we have legal obligation to keep some or parts of your data. Please note that if you withdraw your consent, your right to play the Game and related services will cease automatically. The withdrawal of your consent does not affect the lawfulness of processing based on your consent before its withdrawal.\n\nThe right to data portability\n\nYou have the right to receive your Personal Data that you have provided to us in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller without hindrance if the processing is based on consent or contract performance, in accordance with Article 20 of the GDPR.\n\nChanging or Removing Account Information\n\nAccess and control over most Personal Data in the Game is readily available through the profile editing tools on your account with the applicable platform/service provider that you are accessing the game through. End Users may modify or delete any or all of their profile information at any time by logging into their accounts. Information will be updated as soon as possible. End Users who wish to deactivate their Game account may do so in their accounts with the applicable platform/service provider that you are accessing the game through. Removed information may persist in backup copies for a reasonable period of time but will not be generally available to other End Users or visitors of the Game. You cannot however remove communications made in any communication features in the Game, which might have been shared with other End Users (for example sending personal messages to another End Users).\n\nIf you wish to invoke any of the rights described above, you may contact us at any time by emailing us at privacy@fasttravelgames.com. We will process and answer your requests without undue delay and in any event within one (1) month of our receipt of the request unless a longer period is required due to the complexity of the request. In this case, our response time can be up to three (3) months in total, as permitted by Article 12 of the GDPR.\n\n\n\n11. Disputes\n\nDisputes between you and FTG:\n\nOUR GOAL IS TO RESOLVE DISPUTES FAIRLY AND QUICKLY. FOR ALL DISPUTES AGAINST FTG, YOU AGREE TO FIRST CONTACT FTG AND TRY TO RESOLVE THE DISPUTE INFORMALLY BY SENDING A WRITTEN NOTICE OF THE CLAIM (NOTICE) TO FTG. THE NOTICE TO FTG MUST BE SENT VIA REGISTERED LETTER TO THE ADDRESS LISTED IN SECTION 17 BELOW OR BY EMAIL WITH A CONFIRMATION OF RECEIPT. THE NOTICE MUST (A) INCLUDE YOUR NAME, YOUR RESIDENTIAL ADDRESS AND E-MAIL ADDRESS AND / OR MOBILE PHONE NUMBER ASSOCIATED WITH YOUR ACCOUNT REGISTERED WITH FTG AND/OR THE PLATFORM/SERVICE PROVIDER; (B) DESCRIBE THE TYPE AND REASON FOR THE CLAIM; AND (C) SPECIFY THE SPECIFIC COMPENSATION SOUGHT, IF ANY. IF YOU AND FTG CANNOT AGREE ON A SOLUTION TO THE DISPUTE WITHIN 60 DAYS OF RECEIVING SUCH A NOTICE, EITHER PARTY MAY INITIATE LEGAL PROCEEDINGS IN ACCORDANCE WITH SECTIONS 12-15 BELOW.\n\nUser disputes\n\nYou are solely responsible for your interactions with other users of the Game. We reserve the right, but have no obligation, to monitor disputes between you and other users.\n\n\n\n12. Arbitration\n\nIf you are located within the United States of America, the following applies to you: Any claim (excluding claims for injunctive or other equitable relief) where the total amount of the award sought by either party is less than $10,000 shall be resolved via binding non-appearance-based arbitration initiated through the American Arbitration Association (AAA). The AAA Rules are available online at www.adr.orgor by calling the AAA at 1-800-778-7879. In any such arbitration, the parties and AAA must comply with the following rules: (a) the arbitration shall be conducted by telephone, online and/or be solely based on written submissions, the specific manner shall be chosen by the party initiating the arbitration; (b) the arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise mutually agreed by the parties; (c) the arbitrator may award injunctive or declaratory relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by that partys individual claim; and (d) any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. Nothing in this Agreement shall prevent either party from seeking remedies in small claims court of competent jurisdiction.\n\nThe right to refrain from arbitration. You may choose to waive this arbitration term. Then neither you nor FTG can demand that the other party take part in arbitration proceedings. In order to refrain, you must inform FTG in writing about this within 30 days of obtaining notice of this Arbitration section. You must provide the name and address, the e-mail address associated with your Game account (if you have one) and a clear wording that you want to waive the arbitration terms. All requests to refrain from arbitration must be sent to: Fast Travel Games, Hgbergsgatan 18, 116 20 Stockholm, Sweden and marked Waiver of Arbitration. If you do not waive this arbitration section it will continue to apply to you.\n\n\n\n13. Class action waiver\n\nYOU AGREE THAT ANY AND ALL CLAIMS MUST BE MADE IN YOUR INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING.\n\n\n\n14. Claims\n\nYOU AND FTG AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE TERMS OF USE OR THIS PRIVACY POLICY MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES. OTHERWISE, SUCH CAUSE OF ACTION IS PERMANENTLY BARRED.\n\n\n\n15. Governing law\n\n(a) If you are located outside of the United States of America this Agreement shall be governed by and construed in accordance with the laws of Sweden, without giving effect to any principles of conflicts of law, and the parties hereby consent to the sole and exclusive jurisdiction of the courts of Sweden, with the district court of Stockholm (Stockholms Tingsrtt) as first venue, to resolve any disputes arising out of or relating to this Agreement.\n\n(b) If you are located within the United States of America, and unless otherwise required by a mandatory law of any jurisdiction, this Agreement shall be governed by and construed in accordance with the laws of the state of New York, without giving effect to any principles of conflicts of law. You agree that any action arising out of or relating to these Terms of Use that is not subject to mandatory arbitration as set forth above in section 12 shall be filed only in the state or federal courts in and for New York County, New York and you hereby consent and submit to the personal jurisdiction of such courts for the purposes of litigating any such action.\n\n(c) Notwithstanding anything to the contrary, FTG may apply to any court of competent jurisdiction for injunctive or other equitable relief.\n\n\n\n16. Changes to our Privacy Policy\n\nThis Privacy Policy applies to all information collected by us or provided to us on and after the Effective Date. This Privacy Policy is subject to change and we may make any changes to this Privacy Policy as we see fit. FTG will notify you of material changes by posting them on applicable game/app stores, and/or on the websites etc. You are encouraged to check back and review this Privacy Policy from time to time so that you will always know what information is collected how it is used and to whom it is disclosed. Your continued use of our services and playing of the Game subject to this Privacy Policy will signify your acceptance of Privacy Policy changes.\n\n\n\n17. Contact\n\nIf you have any questions, complaints or comments regarding our Privacy Policy, please contact us at:\n\nFast Travel Games\nHgbergsgatan 18\n11620, Stockholm, Sweden\n\nEmail: privacy@fasttravelgames.com\n\nLast Updated: May 26, 2018\n\nLike what you see? Get the latest on our Facebook, Twitter and Youtube or join the mailing list.\n\nFast Travel Games AB\nHgbergsgatan 18\n116 20 Stockholm\nSweden\n\n\n\nPrivacy Notice\n\nGames\nAbout\nPeople\nConnect\nApex Construct\nThe Curious Tale of the Stolen Pets\nBudget Cuts 2: Mission Insolvency\nCareers", "Space Required": "1.35 GB"}



["5 stars\n49%\n4 stars\n29%\n3 stars\n12%\n2 stars\n6%\n1 star\n4%", "StingrayHero2Jun 28 at 1:31 PM\nWorth a buy, VR veteran approved.\n\n4 stars. I want a sequel. This is a good game if you really like dystopian settings and understand at least the very basics of VR; I wouldn't recommend this one as a starter game, but I recommend it if you know what you're doing. This game deserves the praise it's about to receive, but the nitpicks I have are there as well.\n\nI put way too much effort into this review.\n\n[Synopsis]\nAPEX construct is a lore and combat-dense adventure game which sees you taking out foes with a supercharged bow and arrow and trying to piece together what happened to the world around you. The game plays well and the graphics are adaquate. The combat is fun, fluid, and not too difficult; The puzzles are mostly simple with the difficulty at a low. The lore is dense and well-scattered. Secrets, in the form of both lore and collectibles, are a hilight- they're everywhere and very satisfying to gather. The plot is in-depth and meaty(....at least until the end. I'll touch on that below).\n\n[Things worth noting]\n-You're mostly independent and on your own in this game.\nThe tutorial is short and sweet, and after that it's pretty much working solo. It adds a level of freedom, yet sometimes you may feel slightly lost.\n\n-It's pretty linear, save secrets.\nHead to a location, do a thing, eliminate anything in your path. It works surprisingly well, though, because the game does a good job of keeping you on your toes.\n\n-The lore is an important part of the game.\nThis is one game where you sort of need to pay attention to the lore to understand it. Don't brush over something that looks important!\n\n[The big praises]\n1: The combat.\nIt's fun, fluid, and mostly straightforward while still keeping you on edge the whole time. It even changes sometimes to a defense-oriented, protect-the-tower battle, and for a bit you're even locked out of your bow, forcing you to use items to draw enemies away and stealthily slip past them. It's truly heart-pumping!\n\n2: The atmosphere.\nI don't know who to praise for this one, but the graphics are truly something to behold in almost every area. The art style is almost cartoons, yet not, and it's something I just love. In addition, in many of the levels there's always the feeling of needing to be on your guard, no matter how safe it seems. I love it!\n\n3: THE LORE AND COLLECTIBLES.\nThe lore, both secret and not, and the little secret items and trophies you can find, are all absolutely worth drooling over! The lore is just the right amount cryptic and creepy while still making sense, as long as you can piece it together. The secret trophies are just what this game needed; it feels good to find them, and they're silly and fun to collect and put in your base to display!\n\n4: The inventory system.\nYes, yes, and more yes. The inventory is minimally invasive and easy to use. I've seen people complain about how you have to open the inventory to change between your bow and regular hand, but for me it just made the experience more fun and a bit more integrated.\n\n[The two big nitpicks]\n\n1, the worst: The location revisits.\nI normally love it when games do this: You'll see something, often a collection of somethings, that you can't interact with, and you'll be excited to come back when you have the right gear. This game doesn't pull it off well for one simple reason: The later levels are just revisits to the same areas in the early levels, which means that there's only a total of about 6 unique areas you actually get to explore, which isn't very much...\n\n2: The Ending.\nThe final level, which just entails you visiting a locked area of the *first* level and unlocking it, sees you fighting off a fistful of enemies, wave-style, at first. Once you defeat them all, the final boss appears...\nOnly for it to be the exact same boss you already fought a few levels back. Once you defeat it, you're warped away with no real ending to the game at all; No extra dialogue, no closing anything. The end is dissatisfying and honestly not great from a player perspective.\n\n[In conclusion]\nThis game is fun and worth the buy. If you like finding lore, being constantly in the tick of battle, and always feeling on-edge, this game is wholly for you.\n\nOh, and yes, Fathr. I do like my new hand.\n\nHelpful | 119", "alextayloroculus19 days ago\nGreat game but...\n\nIt actually is a really great game. Very fun good length. Fun mix of puzzle and shooter. However numerous times that full screen glitch will occur where you cant see anything.. you have to exit the app and start a lot of stuff over and thats really annoying me and I might give up at this point\n\nHelpful | 6", "Dr_JeremyMay 23 at 2:23 PM\nA good game that lacks polish\n\nI really enjoyed my time with Apex Construct. It's the most expansive and lengthy VR experience I've had before and the game's core works really really well. The level design and lore are interesting and progressing through the game is a lot of fun. Unfortunately, it shows a strong lack of polish that likely comes from such an ambitious title being developed by a smaller team. There are lots of bugs that caused me to have to reload missions because a necessary trigger was never activated by the game for whatever reason. It also has a completely underwhelming ending that makes it feel like the true ending of the game was cut out. All in all, it's still very much worth playing, but be aware it's not always a smooth experience.\n\nHelpful | 93", "Midshipharpy92Jul 28 at 4:48 PM\nReally good game but has some bugs\n\nOverall this game is great and I highly recommend it. The only reason I rated it 4 stars instead of 5 is because I experienced many bugs including one bug with the visuals that made me turn off my oculus to fix it. This also made me have to redo almost the entire level.\n\nHelpful | 3", "MegablastUKJul 15 at 11:28 AM\nAmazing game, but some annoying bugs\n\nI picked up apex because it seemed interesting. I played through once and felt like the story didn't have a proper ending. Then I played through again on normal and discovered the bug that dropped this review to a four star, any levers on the game will get stuck if released before they hit the end position. This softlocked the level a few times, but it's fairly easy to overlook when bug testing. The game's combat system is fluid and keeps the player on their toes. Some of the fights could be a bit difficult for younger players, but a very great game overall!\n\nHelpful | 4", "PaleoFossil258 hours ago\nFun for a while\n\nThe scenery is beutiful, but after a few missions it kinda gets hard to find out what you need to do. The game just puts you in the level and lets you run around. Idk, I might just be an idiot but idk what to do at some parts.\n\nHelpful | 0", "Ihrie4 days ago\nVery well done quest port\n\nGreat game, though I do wish the end wasnt so abrupt feels unfinished.....But it is mostly wrap up the main story elements.\n\nI would love to see more, DLC or sequel, though I doubt that will ever happen. Even so the gameplay and archery combat were fantastic and the range/ranking adds some replay value.\n\nWould recommend.\n\nHelpful | 1", "FiascoTheAcidBikeJul 3 at 1:30 PM\nApex is what you make of it\n\nBefore I played the game, I read the reviews that sounded frustrated with the lack of story and lackluster ending (because you have to go looking for the story). With that in mind, I approached every level with a great deal of curiosity and had an incredibly immersive experience. It's a really cool that the story isn't 100% obvious and you have to put the pieces together on your own. It can be frustrating/confusing at times but if you've found all the terminals and hidden files then you should be good to go.\n\nI thought the lack of HUD made for a very realistic setting, one that I would love to see more of! I never thought I would have so much fun pawing through storage closets or offices looking for health cans or clipboards with clues/passcodes on them. It's an awesome experience, one worth trying. It reminded me a lot of Half Life/Portal in its setting. This game is worth your time and money!\n\nHelpful | 10", "VenlarkJul 16 at 6:19 AM\n<Title Here>\n\nReally great and definitely worth the cost compared to most games, felt like I got my monies worth. The game offers combat, puzzles and a story line so been enjoyable to play. I find myself wanting to keep playing to unlock everything. Only reason I did not give it 5 Stars is sometimes the movement, or placement of the characters makes it awkward to interact with objects. Found myself having to turn around and come back to a spot to get a better angle. You go to just out of reach to 2 inch in front of your face in a single movement.\n\nHelpful | 1", "instructorbk19 days ago\nNot great\n\nI went by some of the 4 or 5 star reviews, and they were too kind. The game play is okay. It's very repetitive in a lot of ways. There's a story in there, but it is not complete and seems to not go anywhere. The ending is so awful that I can't give this anything more than 1 star. It feels like a real waste of time after that ending and after the lack of completion to the story.\n\nHelpful | 3", "MylarMay 9 at 7:54 PM\nMore fun than I thought it would be!\n\nThis was really well-made! From the voice acting, to the graphics, albeit a little cartoony, but the immersion works well. Theres hidden diaries to find, various secrets, and something of a plot. Plus, shooting robots with a bow and arrow- I cant tell you how much fun that actually turned out to be. The story doesnt wrap it self up as nicely as I wouldve liked, and a lot of people on here mentioned the same thing. But if youre looking for a little more information, look into hacking the computer terminals that you find. Try to remember using DOS when you were a kid. This is a great buy, and I find myself going back to it to play levels just to search for secrets and just to kill more robots. Two thumbs up. I only wish it had a little bit more of a plot, as it brought me into this really neat world, and I was hoping for a more satisfying conclusion. Other than that, super fun game.\n\nHelpful | 19", "steve.fuller.716198 days ago\nLack of save points\n\nThis is the second time ive installed and played this game,first time it had a bug and kept sending me back to the start,this one is ok,after about an hour ive now got stuck on a level with tiny computer screens which i cannot read as i wear glasses and the quest doesnt allow for much adjustment,you can use glasses with the spacer but it doesnt realy work,shame as i dont think i will progress any further now,the gfx are realy nice and the gameplay is a bit samey but if your a bit short sighted i dont recommend also i had got through most of FRACTURED but when i returned to play it a couple of weeks later i had to start all over again and to be honest i cant be bothered\n\nHelpful | 0", "gsmith171819 days ago\nFrustrating...\n\nThis game suffers from the same problems some others do which make it very frustrating. Settings that have no explanation and little effect, purchasing (with points) gear upgrades that have no explanations as to relative advantage and no visible change in how they change things, and a \"companion game\" that is horribly limited and lacking in the MOST needed thing - moving targets. BUT more than that, game play that goes several levels with only a few opponents then suddenly a level where you are swamped to the point where it's impossible for an inexperienced player to proceed with no way to save and take a break. FRUSTRATING - absolutely ruins what could be a good game.\n\nHelpful | 0", "DanielBrammer959 days ago\nCool and good graphics\n\nVery nice game with a lot of stuff to do. It will need patience and good thinking at times\n\nHelpful | 0", "parixzJul 7 at 5:29 PM\nI expected more\n\nThe game was pretty good over all but there wasent really a challenge to it. Graphics could have bin a little better and clearer. I didn't get to the end but played enough to realize its kind of a waste of my time. every level is pretty repetitve and unclear on what to do. Super slow story as when. Not to mention that the amoumt of detail is pretty bad. could have been improved. maybe a 4 out of 5 for the Oculus rift but only 3 out of 5 for the quest. Not bad but defiantly not a game to remember.\n\nHelpful | 3", "Sydney_RobsterJun 20 at 6:11 AM\nNice combo of exploration and combat\n\nThe Good:\n- The crossbow (only weapon) is VERY satisying to use.\n- The environment design of a physically warped world is striking.\n- The story was interesting and I particularly liked the voice acting.\n- The puzzle difficulty was just right.\n- The spider bot combat was tense and their difficulty was also just right.\n\nI wish:\n- It had ppl interaction. It's another game where you are essentially exploring a lifeless environment (not including spider bots). I think it's a missed opportunity that Farthr and player don't message each other via the right hand inventory UI (perhaps the same simple message style that's used in Dance Central). Else Farthr is just talking at you.\n- The Cyngina Cup (archery course) has a bug and I'm ranked zero on the leader board each time, so there is no point in playing it (I will give 5 stars when fixed).\n\nHelpful | 2", "DankishmemeMar 13 at 6:40 PM\nDefinitely worth a buy\n\nThe game is absolutely fantastic except for just a few minor points, the campaign is fun and I didnt put it down until I finished, however there is only about 4 separate areas so it feels a bit repetitive and the ending leave a lot to be desired. Despite this its still a very fun experience with a good feeling bow. And it has a sudo wave shooter mode which will keep you coming back for a while. If youre on the fence just go for it and youll be able to tell if youre going to enjoy it or not within the first hour or so, so if you dont enjoy it just refund it.\n\nHelpful | 151", "lucasaqr16 days ago\nAMAZING game, underwhelming ending...\n\nLoves this game soooo much! Probably my fav. Great story and environments but a really disappointing ending to the story.... its not even an end... felt weird...\nStill my fav VR game tho\n100% recommend!\n\nHelpful | 0", "EnderAttack17 days ago\nOne of the first few games I bought.\n\nYall, this is such a good game, definitely buy.\n\nHelpful | 0", "john.longjohn.35May 7 at 5:08 PM\nAwesome\n\nHonestly the game I think is terrible as a stand still and teleport but the locomotive settings change the experience. I think you should list that as an option that will pop up at the start of the game cause it was quite hard to find since its not listed in the settings unless you slide the bar to the right which I think could be a downfall and lost some players that you could of had more of. I basically bought this game played it once and didnt touch it for ages today I picked it up again and gave it a go and got fed up with just teleporting around fiddled with the setting to stumble upon the locomotive setting which completely changes the game. I love it now went from hating and thinking Ive wasted my money to now enjoying a great game. Came close to a bad review due to not being easy to find in settings. Other then that Id say buy this game and enjoy it.\n\nHelpful | 27", "nightninja2819Jul 16 at 12:05 PM\nMy favorite VR game\n\nWho's singing looks nice it controls well and I have not found a bunch of bugs yet but one of them I have found you can skip an entire level The level it is on is pieces of the puzzle and when you get to the place that doesn't have power at the door you can go on top to a green spot and then you can teleport onto the building from there in multiple jumps but then you can go through one of the windows from there into the building grab the overcharger and leave without doing the entire level so letting this be known and hopefully it gets fixed here soon\n\nHelpful | 1", "fantombikerJul 16 at 5:38 PM\nLoved this game!!!\n\nI really got into this game!!!! The only thing I was a bit disappointed was with the ending. Left longing for more conclusion. But nevertheless I highly recommend it.\n\nHelpful | 0", "ajaswinskiJun 26 at 7:04 AM\nA SOLID 4 BUT NOT 5\n\nWith nods to Bioshock, Myst and Half Life, this intelligent game is both wonderful and flawed at the same time. The graphics are either absolutely striking or cheap, there is no middle ground. The vague VO of Bioshock and Half Life keeps you continually intrigued. The physics are a mixed bag. While the bow and arrow are very well done, I have no idea why devs didnt initiate a quick button. You have to sigh and press buttons. Of course you can keep it with you at all times, but that erases the immersion. This is good. Red Matter is excellent. I can't comment on Alyx because it is not available for Quest without tether. (Ok, I just did. It's the greatest VR immersion by far)\n\nHelpful | 1", "moises158722 days ago\nnot that good\n\ni mean i see what you tried to do and thats fine but this game is so silent not that much action and sometimes you barely even tried to load in empy walls like i was looking at a water and realized a huge piece of wall was missing\n\nHelpful | 1", "lewdoo19 days ago\nDated and poorly made\n\nPoorly put together environments (gaps between walls and floors showing into the infinite skybox) with samey combat, and dissatisfying archery mechanics.\n\nHelpful | 2", "HellzLordJul 27 at 10:38 AM\nGreat game to get your vr legs!\n\nBeing sorta new but never had motion sickness this a great game that would help with movement! Game is really good story and is a good challenge to play!\n\nHelpful | 1", "QDaBeatJul 22 at 12:22 PM\nAwesome game,wish it was longer\n\nHAVE MUCH VIDEO OF BEING ROOFTOP, DIDNT KNOW IF IT WAS A GLITCH, BUT Ive gained access to some rooms I wouldnt have otherwise so its pretty cool..\n\nGame Complete. Im Very satisfied. Well done.\n\nHelpful | 0", "XxdarkdeathxX21Jun 23 at 11:10 AM\nIts great\n\nThe only thing id like to see improve is just small features here and there like somewhere to put a keycard so u dont have to hold it the whole time. Overall its worth buying\n\nHelpful | 0", "KilihadMay 16 at 6:06 PM\nSouthpaw support\n\nImagine my chagrin two minutes into the game when I found that, as a lefty, Id have to spend all my time in the game using a right-handed bow. No developers thought to mirror it when you swap the handedness in the settings?\n\nSo Ive got to tilt the bow clockwise instead of the natural counter-clockwise to get a decent line-of-sight. Otherwise I get to play with a big block in my eye...\n\nSo weak guys.\n\nAm I the first southpaw to play this game?\n\nHelpful | 19", "LeAndrejosApr 8 at 4:43 AM\nUnderwhelming ending\n\nThe game is overall great, with fairly interesting plot (although you have to read through a ton of files on tiny laptops to really discover everything), but all that fades in comparison to the disappointment of the ending. It ends just like every other mission, except it's the end of the game. No explanation, no extra dialogue. It was very underwhelming.\n\nHelpful | 14", "takuta12May 11 at 8:01 PM\nIts good but there is one problem\n\nThe game is good but when you switch from snap turn to smooth turn there is a weird glitch that does a 180 snap turn at random and sometimes it will cause nausea and i couldnt find a way to fix it\n\nHelpful | 5", "Zenn69Jun 1 at 12:11 PM\nDefinitely worth the purchase\n\nThis game has pretty much everything I look for in a VR game. Its has good combination of puzzle solving and combat so your not just stuck doing one or the other. The combat is with a really cool bow, which is probably the best Weapon for the VR experience. The story is captivating and so is the amazing environment. Its one of the first quest games I purchased and I still keep going back to it.\n\nHelpful | 2", "DG107Jul 18 at 4:23 PM\nFun\n\nI like it but could be better\n\nHelpful | 0", "Tony.DiIuorioApr 1 at 9:46 PM\nCool environment, cool bow action\n\nThere's much good to say about this game. If you're thinking of buying it go for it. It's an arcade style bow shoot em up wrapped inside a deep dystopian backstory.\n\nIt's fairly linear for a \"solve the mystery\" game. But at the same time it's a bit confusing. The ending is so sudden and lowkey that Im not sure I'm finished!\n\nThat's the only bad there is to say: this game leads you around, but doesn't hold your hang. Quite the opposite actually, you're left to guess a lot in some not-so-obvious ways.\n\nBut very cool, very polished, a good VR title but not great.\n\nHelpful | 11", "CryptikWaveMay 7 at 6:33 PM\nBEST VR GAME IVE PLAYED\n\nThis game is almost scary because of the amazing graphics. The game has you locked in and your heart rate up. The amount of interaction with you and the virtual world is amzing. Almost everthing you can pick up and look at. 100% worth buying.\n\nHelpful | 9", "s-ynthJun 20 at 2:18 AM\nBuggy and not a great history\n\nIm surprised this game is so popular. It feels like its not finished (I dont mean the history, but the game itself). There are a lot of glitches, frame drops (so be prepare for motion sickness)... It really makes me think this game was released before it was finished. It can still be enjoyable but dont expect it to be a great game.\n\nHelpful | 1", "GlitchVertexJun 4 at 10:29 AM\nGood job!\n\nFun! That is what i have to say it is fun and get you thinking the bow and arrow are fun to use the puzzles are great but they can be too hard somethings there have been times I have had to search up guides of the levels\n\nHelpful | 1", "Z3R0PATI3NC3Jun 2 at 9:30 AM\nIts...fine\n\nI think I am probably.l biased because of half life Alyx and Asgards wrath and similar big budget experiences.\n\nThe graphics are okay and the bow is nice but overall like others have said it just lacks a lot of polish.\n\nHelpful | 4", "6ickcamApr 21 at 8:07 AM\nsaving\n\nthis is a fantastic game, just love it, however, I have yet seen how to save progress, im not going to start from scratch in a level everytime i have to leave the game\nTY for developer reply\nupon giving more time that I have now, this game is awesome, truly love the puzzles and visuals, storyline very adequate, really enjoy the cup play, wish there was a few more cup plays to choose\n\nHelpful | 4\nDeveloper ResponseApr 21 at 1:14 AM\n\nHi, thanks for sharing and happy to hear you liked it! The save system is by design built to be between levels, to add a risk/reward element with your Radiance Points you gather. We understand it might not be suited for everyone and if you want leave during a mission you will have restart from the start of that mission, but we also had this in mind when creating the actual missions which are usually 20-30 mins long.", "SkullyGaming4 days ago\nGreat game buuutt...\n\nOverall the game play was great and so was the mechanics. There was a couple times I had to restart the game because of the levers that would sometimes glitch out and make it so you can't pull them. The combat was fun though. No other problems other than the end, thus 4 stars. There was a constant build up with the lore and everything, but at the end it was just over. That's it. You do the final mission after all that building and that's all, no plot twists nothing. Kinda dissapointed\n\nHelpful | 0", "NimauraJun 6 at 4:25 PM\nSo Much Fun\n\nI was not expecting to like this as much as I did. I was worried there wouldn't be enough exploration but there's plenty! And the combat is such a blast! I only wish it were longer\n\nHelpful | 0", "WebSeeker1017 days ago\nAmazing\n\nOne of the absolute best vr games that I have so far! The graphics are stunning, the characters have good personalities, and the lore is actually fun to read! The only problem I have is that once you try to use the free locomotion, you'll have a type of tunnel vision that really ruins the free locomotion option (at least in my opinion). Once free locomotion is in use the tunnel vision makes it very hard to see what's around you, because, well... tunnel vision... Although that's really the only problem!\n\nHelpful | 0", "Strangeperson2007Jul 18 at 4:16 AM\nGreat game\n\nApex construct has a very Engaging story and awesome combat.\n\nHelpful | 0", "WavedingoMay 8 at 3:49 PM\nReally Fun, Weak Ending\n\nHad a great time playing this, easily my top 5 quest games. Wasnt sure that I had beaten the game though until I read online reviews. In spite of that, it was a great ride. Im also finding myself going back for the Cigna Cup which is a target practice challenge that ranks you vs online players.\n\nHelpful | 2", "paolokunMay 19 at 11:11 AM\nIn the end?\n\nI have really enjoyed this game and the plot in the background but the ending lacks of a resolution. Maybe a second chapter will be released?\n\nHelpful | 2", "OrcusMaximusJun 20 at 11:13 AM\nTedious exploration\n\nFairly tedious exploration trying to find where you have to go next. Interaction with your environment is minimal. Events don't trigger. I had to leave the game before reaching a save point, and couldn't muster the enthusiasm to restart from the beginning.\n\nHelpful | 1", "BHovaMay 29 at 6:29 PM\nCygnus Cup Issues\n\nSo, this game is great. The campaign is interesting and creepy. A bit repetitive, but enjoyable. The Cygnia Cup is where this game really shines. With the ability to Cast to a Living Room TV, it becomes a great group activity. The problem is how finicky it is. It freezes and doesnt keep track of your score some times. However the BIGGEST issue is that the time limit changes. This dramatically affects your score, as you get bonus points for leftover time. So you could have a perfect run and get 750,000 points, then do the exact same run and get 400,000 because you didnt get a time bonus. This can be really frustrating, especially as you get more enthusiastic and invested. Please find a way to fix this!\n\nHelpful | 1", "wolflake1016Jul 16 at 5:58 PM\nAwesome game\n\nAwesome game\n\nHelpful | 1", "TheCuCuChickenJul 16 at 2:07 PM\nI wish I could leave 0 stars\n\nThis game is the definition of steaming hot garbage\n\nHelpful | 2", "Dealz12Jul 19 at 3:42 AM\nApex construct\n\nThis game keeps crashing, I've tried the unload/reload method and restart system, to no avail, game is useless.\n\nHelpful | 0", "Dealz12Jul 19 at 3:42 AM\nApex construct\n\nThis game keeps crashing, I've tried the unload/reload method and restart system, to no avail, game is useless.\n\nHelpful | 0", "Rick_R-347Mar 24 at 10:44 AM\nGreat for the personal library.\n\nThe parts that get a bit glitchy end up just giving you a little freedom to explore. Great game, loved every second,never wanted to stop,but the only problem is i still haven't and idk if that matters. When you beat the final boss it kind of just leaves you hanging there half expecting anther level. Then you remember all those corpses that got lost in the caves and you think,maybe there is a way out? Maybe since Fathr won't take the initiative bringing back humanity i need to. If you're a real gamer like me you won't look it up. So I'll let you know when i find these last 4 or 5 seemingly innocuous possibly a compete dead end secrets.\nAs for wanting to get your friends into a storyline they don't have the attention span to empath with? Anime fans you hear me right? Tell then they're just mad Cause they'll never touch your cignia cup.\nCause they won't.\nAnd then you can tell them they just won't ever have that skill until they immerse themselves in a 4-7 hour dungeon crawleresque put down of the robot uprising.\nNot that i know if they're done uprising...\n\nHelpful | 4", "butterscottJun 28 at 9:02 AM\nNot enough robots\n\nMost of the game is just annoying puzzles, so maaaaaaaaybe not buy this game if you want to find a good action game\n\nHelpful | 1", "PineappleFrenchJul 11 at 1:14 PM\nLack luster.\n\nThe combat doesn't feel all that engaging and the exploration is basic if not tedious.\n\nHelpful | 1", "montyeloweJun 10 at 11:23 AM\nIts would be better with an assault rif\n\nYep I straight up just said that!\n\nHelpful | 0", "scorpion2071Jun 7 at 4:20 AM\napex construct\n\nGood game but it need more weapens\n\nHelpful | 1", "bucky5150Jun 17 at 7:40 AM\n\nGood game. Good game play. One of my first quest games . Love it\n\nHelpful | 0", "lawlesslassMay 23 at 3:35 PM\nSo far so good\n\nI like the story...Ive not gotten very far and am still learning but i like this game and games like this after I work out because theres still movement but nothing major\n\nHelpful | 0", "VirtualWaypointApr 6 at 2:18 AM\nGreat game, so far \n\nI'm writing this as a first impressions before finishing the game. I'm just at the beginning of the game. And so far i like it. The mechanics/interactions feel great. You can pick up most stuff/objects with your hands. And your hands Are physics objects themselves. I love the left hand inventory for picking your bow or storing/ removing items. Neatly designed IMO. Computers, is a big part of the seeking info/unlocking doors etc. And they feel great aswell some og them have very large buttons for passwords. And some og them have a full keyboard for you to type whatever you want  a cool addition i would say. Navigation is either free locomotion or teleporting or a mix og both. My only gripe is that ladders are traversed by teleport and not climbing. Not a big deal but. The Hub world impressed me alot aswell, with possibilites to upgrade your bow, it also have to floors som its kinda a little level within itself. Where you also have a shelf for storing secret collectibels found inn the main campaign. Bown and shield combo, is your primary weapon and they feel great. My minus star goes to the enemies. They bug out quite alot, get stuck in the ground and stuff like that. That said i would recommend this game, an immersive experience with VR hand interaction you expect from a modern VR title.\n\nHelpful | 1\nDeveloper ResponseApr 21 at 1:17 AM\n\nThanks for sharing such a detailed first impression!", "pigs_are_coolMay 11 at 8:34 PM\nGreat game!\n\nThis game is awesome for people who like action and puzzles it is definitely worth the money. The only thing is the levels are long which would be fine if you could save your spot besides that this game is great!\n\nHelpful | 1", "mcTunaMay 21 at 5:32 PM\nSolid game\n\nGame is fun but I feel it has some more potential\n\nHelpful | 1", "Eddyy95Apr 21 at 5:01 PM\nGreat Game! Makes you think\n\nDefinitely has a good storyline!\nCould use a little more customization.\nCould use more types of arrows.\nGraphics are decent foe the pixel count the unit has. Definitely keeps you on your toes!\n\nHelpful | 0", "Channel.XiroMay 27 at 8:01 PM\nFun game but the saved game got erased\n\nI was having fun playing until my save data disappeared. Too far in for me to want to start over right now, too fun for me to just give it up.\n\nHelpful | 1", "WILTAYApr 25 at 6:59 AM\nGreat adventure game\n\nThe best story-driven adventure game I've played on the quest. Love the bow and arrow combat and the simple puzzles. More of this type of thing please.\n\nHelpful | 1", "YamaGoon53Apr 24 at 6:07 PM\nMeh, Not Worth The Money\n\nStory is ok at best, boring at times. They do have the bow action down though. Final boss is the same as the mini boss but has two more hits. Ending is unsatisfying even if you get all the secret lore bits. Its not bug filled but expect objects falling through the world. On the first level I somehow got out of the world because of poor level design in that area. If all you care about is shooting robots with a bow then this is a good game for that, however you could probably side load a better game if you have a good enough computer. I wish I couldve gotten a refund for the money I spent on this game.\n\nHelpful | 0", "artownsendMay 17 at 12:56 PM\nFun, limited, linear\n\nMy back hurts from all the jump scares.\n\nHelpful | 0", "illuminaut45Jun 8 at 8:09 PM\nNot enough gameplay\n\nThere wasn't enough gameplay\nand the game the end left me hanging at the end and I wish and they were more levels\n\nHelpful | 1", "XardielJan 23 at 11:09 AM\nEnding?\n\nApex Construct is one of my favorite VR games on Quest and I'm huge fan of the story. Just one thing.. I don't want to use spoilers much, but what I was fighting for? Putting back world together again, bringing back humanity? I finished the game and nothing really happens. Make Father truly bad, make Mother well and alive, make something else except them, make sequel or one additional chapter, make anything, every ending would be better than no ending at all.\n\nHelpful | 16\nDeveloper ResponseJan 23 at 11:39 AM\n\nHappy to hear you like the game, apart from the ending of course. There are quite a lot of lore pieces to find around the world and in the terminals, some secret ones as well, that might help shed some light on the occurrences in the game. This is of course optional and not something you have to look for.", "Ajd.5683Apr 17 at 10:52 AM\npretty good\n\nthe game is really good, has decent graphics and has a lot of action. my only issue is that there were holes in the story that were never quite resolved.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:11 AM\n\nHi, thanks for sharing! There are pieces of the background story hidden in the secrets you can find as well, might be worth looking those up:-)", "hesspetApr 1 at 2:14 PM\nVery nice graphics, but no savepoints\n\nThis game is a time waster. The lack of in game save points was a very bad descicion of the developers. It doesn't make fun after a playtime of 30 minutes or more to loose you game settings of this round because the battery of the quest goes down, or other reasons. After each game restart you have to start the level again in full lenght. This is ridicoulus. After a while I deleted the game from the quest. Lost money.\n\nMay be, if we could have skill levels. Not every player has time to play hours and hours without breaks. And yes, energy is limited on the quest....\n\nAnd: Some people say that the bow shoots well. No, as a \"real world\" archerer this dirves me crazy: every archer draw the arrow to the side his face not between the eyes. This in not natural bowing. Many other bow games allow to set a hand offset for full draw. AC not. This is hard if you are a trained instictive shooter.\n\nBTW: The physics of the arrows are very well.\n\nHelpful | 2", "Kingsamurai321Apr 10 at 6:27 PM\nTerrible ending, but great buildup\n\nEverything about this game is great, from the voice acting to the gameplay. The ONLY bad thing is the ending, which confused wether or not I was actually done with the game.\n\nHelpful | 0", "bodiebobbobJul 19 at 3:12 AM\nAlmost perfect\n\nI ready love the level design combat en the puzzels in this game the voice acting is ok en the only Reading it doesent have 5 stars I because of the bugs\n\nHelpful | 0", "dr_sloomyMay 19 at 5:21 PM\nIs good\n\nAll-around a good game\nit is well worth the money\n\nHelpful | 1", "leonardallen1Apr 3 at 3:38 PM\nGood Game\n\n4 stars due to the fact that stairs are buggy and elevator when using free motion it was meant for teleporting so i can't really complain but the free motion is not that great\n\nHelpful | 0", "Kensho.FoxMar 9 at 5:26 PM\nGood game hears why\n\nSo I find it a good game because I love all the lore and secrets you can find but there is two problems for this game. So first on the quest it has lower graphics and the end is a little thats it? But otherwise it is one of my favorite games and if you revisit the levels and the training I think it is a more complete game. Matter how fast you go but the story took me about 9hours while actively trying to find secrets\n\nHelpful | 0", "mattjohnholmesJun 20 at 2:43 AM\nPoor\n\nNot good\n\nHelpful | 1", "JoefromthefutureMar 10 at 8:22 AM\nBeautiful.\n\nIt's a very beautiful game, I'm surprised there are so many low reviews for it. The graphics and textures are alot better than I expected, I haven't completed the game yet but it gives a nice Portal vibe. It has a few bugs here and there with Audio and Terrain rendering but nothing that makes it unplayable, it happens very rarely. If you have the money for it I would definitely recommend it.\n\nHelpful | 3", "pepeR0NiJul 26 at 11:53 AM\nMaybe?\n\nOne star for graphics and one for story. The story is nice and interesting and graphics are a good use of my quest. BUT.. controls are not comfortable, menu is horrible to use and where is my saves??? I passed the first mission almost till the end and I accidentally hit exit to menu(the menu not very friendly to use btw) and came back and boom at the \"home\" environment of the game. I wouldn't buy it without any sale or some bundle since its just not that good for spending 20$ but the design, and story is good so the game is not broken but just the lack of save points and poor menu design ruined my immersion.\nThanks and I hope I helped anyone.\n\nHelpful | 1", "ChatErrorMay 18 at 2:33 PM\nGreat graphics\n\nLove this have long play time, very smooth\n\nHelpful | 0", "czech050Apr 3 at 3:47 PM\nGood first introduction game to VR\n\nGood game, simple, but still fun. Ending could of been worked on as it was suddenly over. Overall game was enjoyable. Good game for beginners getting into VR.\n\nHelpful | 0", "chad.hertlerMay 20 at 7:18 PM\nReally hard, But fun.\n\nNuff said.\n\nHelpful | 0", "adele.mcintyre.9May 15 at 6:30 AM\nAmcinyre\n\nThis is a fab game would defo recommend.\n\nHelpful | 1", "Bwl12Jun 9 at 10:24 AM\nThe kind of VR game we want\n\nI agree with many of the comments about bugs. I had to restart a couple levels due to them and it is kind of annoying. But on the other hand, this game is what many people have been looking for: a story based VR game that isn't over in 40 minutes. It actually takes at least 4 or 5 hours to beat, and longer to get 100% completion. The game's story is a lot like Portal (though with less humor) and you really have to work to solve some of the puzzles. Plus, the bow is an awesome VR weapon. So while it is buggy at points, it's also one of the only VR games I've found that's attempted to create a full length game with multiple levels, an inventory, central hub for treasures, and a long interesting story. So something had to give, and it's worth the bugs. I'd reccomend that anyone looking for a decent length adventure give it a try.\n\nHelpful | 0", "Captain_Moose15 days ago\nI just want to play\n\nKeeps crashing on me whenever I load up a level from the map, and the bow feels like its bent upwards, so I have to bend my wrist awkwardly when aiming straight in front of me.\n\nHelpful | 0", "TheRocket117May 10 at 7:09 PM\nAmazing\n\nThis game is amazing the story is great\n\nHelpful | 0", "NinjaMonkeyMarkFeb 29 at 6:03 PM\nWell worth your time\n\nThis is what I want in VR. A full narrative driven story campaign to get lost in for a while. Good balance of exploration, environmental interaction and combat, with unlocks along the way as you progress. While the pay off at the end may not have been as grand or profound as I would have liked, I absolutely loved this game. Im very excited to see what the developer has in store for us next!\n\nHelpful | 1", "MartinChasakApr 5 at 1:19 PM\nFun\n\nIts god bow game its fun, mission are same time little long and unclear\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:17 AM\n\nThanks for sharing!", "timglarsonFeb 13 at 11:26 AM\nPretty good\n\nThe created virtual world was detailed and interesting . Importantly occasionally humorous too. The fighting aspect was entertaining and uses a bow/arrow and shield. The physics was pretty good. Occasionally you can wander to areas that are not really part of the game play - like the rooftop. Story pretty interesting. I have seen the Rift version and the details are so much better than the oculus. I was frustrated occasionally when a lever in the game did not work as it was supposed to (verified by watching youtube gameplay)\n\nHelpful | 0", "uhhhh_its_camFeb 10 at 9:11 PM\nGood game, bad ending\n\nI loved this game. I finished it as of the day I am writing this review. I even think that with some strong writing and designing, this could even get a sequel. I do share one problem that most reviews have as well. The ending was boring and didn't feel complete. The final boss was just a revised version of a previous boss, and even felt easier than the original fight. Other than that I loved the gameplay and story. I think it's worth the $20 I spent.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:03 AM\n\nMany thanks for sharing your impression!", "Uncle_RogerDec 7 at 4:59 PM\nI wish...\n\n...that I could give this game five stars, I really do. Unfortunately, my first major experience with VR (this game) left me with a bad taste in my mouth. The game is, at first, extremely fun and reminds you a lot of Half-Life with the puzzles and general vibe. I was bummed to realize that's where the similarities end. The story builds wonderfully, only to abruptly end with no explanation. There is all this foreshadowing for events that are supposed to play out, things that are supposed to be done, quests to be completed, and then it just stops and doesn't finish ANY of it. The climax during which you face the first \"boss\" is exhilarating, then the rest of the game is just recycled. There is very little depth beyond the first few chapters. There is no hint of a sequel, no epic ending, nothing...it's like the developers stopped halfway into the game and said \"meh,\" then put it on the market. I hate that I was disappointed by this game because the mechanics and environment are great. The story left me really unsatisfied, though. If a sequel is released in the future, I would be happy to update this review, but the impression I got was that this story is over.\n\nHelpful | 89", "Paul-DavidoffMar 18 at 7:52 AM\nGreat immersive gameplay\n\nAwesome experience, interesting story, tremendous fun getting those robots... but if you are thinking its gonna be easy peasy lemon squeezy, you are wrong! This is difficult difficult lemon difficult. Be advised!\n\nHelpful | 1", "ROGUE-ONE1Feb 1 at 9:48 AM\nFun Cyber-Adventure That Could Have Been\n\nGraphics : 4/5\nGameplay: 3/5\nNarrative : 3/5\n\nI enjoyed playing Apex as I felt it took advantage of the Oculus Quest. The graphics are crisp and resolution is good (not a muddy downgraded mess). The contact with the hands and environment was solid. The shooting was fun ... to the point where I sometimes felt like The Green Arrow/Hawkeye/Rambo. Quite a workout on the arms near the end. The puzzles were fun and the giant robots parts showed off lots of potential for the cyber-genre.\n\nSome of the things that I didnt enjoy was the irritable freestyle navigation. You constantly get stuck in steep stairs and moving platforms (forcing you to use teleport). While the physics engine is strong in this game, it can sometimes become very frustrating when keys hit a wall by accident and go flying out of the map. This will force you to restart the level. In shooting mechanics, I would have liked to have the option to override my pull & aim with the shield button (or at least a toggle).\n\nAs for the ending, I was definitely expecting more than what I got... Hahaha! It would have been nice to revisit the worlds (which were recycled heavily) without the narrative and an ultimate reward for collecting all the secrets.\n\nHelpful | 4\nDeveloper ResponseFeb 11 at 4:09 AM\n\nThanks for your review and for some nice input! We recently updated the game with improved interactions and more, so hopefully you will find the experience is even better now:-)", "MerlynmacFeb 5 at 4:53 PM\nUnexpectedly Exciting\n\nI have to admit, I'm not much of a puzzle guy. That said, I'm really enjoying this title. I find myself jumping around, dodging fire, ducking behind objects for protection.\n\nI'm not a fan of trying to find the computer codes to open some doors but that's really my only gripe.\n\nI haven't finished the game yet but I'm loving it so far.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:10 AM\n\nGreat to hear!!!", "DagamerboiApr 23 at 10:47 PM\nShort but sweet\n\nI wish the game was a little longer but it is definitely worth a buy\n\nHelpful | 0", "NeverWrongJan 5 at 4:19 PM\nBeautifully Nerve Wracking\n\nI found this game visually stunning. As a VERY inexperienced gamer, trying to figure out where to go in the game is sometimes a little tricky, but I am getting the hang of it. Also, it is so easy for me to get immersed in the world, I found myself scared of the robots at times. Lol! Im an old lady though, so....\n\nHelpful | 11", "obsouleteJan 31 at 7:31 PM\nGreat game for launch title\n\nWas a fun game and well done for a launch title, after seeing recent games just out now with the level of polish graphics. I feel this one was made one the cautious side of not knowing how far the hardware on the quest could be pushed. and with not attempts to improve visiuals. Story felt immersive and gameplay was undoubtfully smooth. I feel the ending left something to be expanded on with a sequel, one can hope at least, that I surely am awaiting.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:08 AM\n\nThanks for sharing! We would love to work with more Apex Construct games, time will tell if this will happen:-)", "balaji.santharamApr 21 at 1:24 AM\nRating refer below\n\nGameplay - 1 Star (Very slow)\nStory - 2 Star (Convincing, but short)\nGraphics - 4 Star (Good in Rift, Ok in Quest)\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:15 AM\n\nSorry you did not like the graphics, we usually get a lot of praise for those. But happy that you liked the story!:-)", "aaroninkatontmreeeeApr 12 at 6:59 PM\nAmazing\n\nThe best looking game one the quest worth the money\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:11 AM\n\nAmazing to hear, thanks for sharing!", "MC1125Feb 28 at 7:35 AM\nGreat game\n\nI havent quite finished the entire game yet but what I have played is AMAZING! All of the different levels have something different to do and some new place to find. If the devs did make a sequel (like the other responses are talking about) then I would definitely get it.\n\nHelpful | 0", "Frazzle402Jan 30 at 3:35 PM\nPretty Good\n\nFinally a game on the Quest that gives you a bit of freedom.\n\nNot quite open-world but a breath of fresh air from the arcade style games the Quest has to offer.\n\nPuzzles, upgrades, move back and forth between levels with some secrets and collectables.\n\nNot quite fully polished yet, some enemy's glitch out occasionally and I've had to restart a few times getting stuck somewhere I shouldn't be, but I might just be looking too hard for those secrets ;)\n\nWith more updates this could easily be in the top 5 for Quest\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:07 AM\n\nThanks for sharing your impressions, happy to hear you liked it! We recently updated the game with a new patch that improves interactions among other things, so hopefully this makes the experience even better!", "aidentatoDec 28 at 11:02 AM\nAlmost\n\nThe overall gameplay is very immersive and enjoyable and for the price you get tons of gameplay and missions. The graphics are an amazing achievement to say it is rendered with a mobile chipset and the mechanics of the bow are also very good. My only criticism is that sometimes it feels like it needs a little bit more direction as I have wandered aimlessly on some of the maps trying to figure out how to progress past a locked door or not quite seen a wall that needs to be blown up.\n\nHelpful | 5\nDeveloper ResponseJan 2 at 2:34 AM\n\nThank you for sharing, our tech team will be very happy to read this:-)", "allywally420Feb 20 at 7:35 AM\nGreat game, bad ending\n\nIt was a great game up until the end. I didnt even know I had finished it. Id give it five stars if it had an actual ending. I did still have fun right playing through it though.\n\nHelpful | 1", "MrMan0715Jun 20 at 9:21 PM\nVery good game\n\nWhen I first got this game I just thought this game would just be about killing robots but this game gave much more than that! It gave good gameplay, a good story, and ok graphics!\n\nHelpful | 0", "OlivierTofuJan 25 at 11:29 AM\nExcellent game\n\nThis game us a lot of fun. Even more since I like open worlds.\n\nOne has to get used to the controls, but it definitely has got a good story and a challenging gameplay. If you like sci fi games. You might like this. However the visuals are not as good as with other games, but that didn't keep me from having fun.\n\nHelpful | 2\nDeveloper ResponseFeb 11 at 4:03 AM\n\nThanks for sharing your experience, happy to hear you liked it!", "ray.bradshaw1Apr 9 at 10:38 AM\n\nGreat game good graphics and gameplay recomended\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:15 AM\n\nGreat to hear, thanks for sharing!", "im_watching_youJan 29 at 7:11 PM\nGame was great ending sucked\n\nThis game deserves five stars the action gameplay and puzzles were amazing the only reason I gave it four is because the ending sucked like it was trash I didnt even think it was the ending when it happened other than that this game is amazing and one of the\nbest I played on vr\n\nHelpful | 3\nDeveloper ResponseFeb 11 at 4:06 AM\n\nThank you for sharing, great to hear you liked the game (except from the ending then:-)", "RattleKatJan 25 at 11:28 AM\nVery Solid\n\nThis game plays very well. The bow mechanics are amazing and it's very smooth to play. The combat is excellent - dodging and blocking enemy shots whist lining up your own is very satisfying! The graphics are great interacting with objects is the best I've experienced on the quest. Has a great story and feels like a full game, instead of an experience. Highly recommended\n\nHelpful | 3\nDeveloper ResponseFeb 11 at 4:03 AM\n\nWow, this means a lot to us - thanks for sharing!", "Matthew140Apr 12 at 2:20 PM\nGood but buggy\n\nOnce I got this game on quest I found that the bow would disappear and not come back is this normal and how do I fix it\n\nHelpful | 1\nDeveloper ResponseApr 21 at 1:12 AM\n\nHi, this sounds really strange - could we ask that you send an email to support@fasttravelgames.com with details about your issue, and we will help you that way!", "superskull939Mar 8 at 12:03 PM\n\nFun game but needed a better ending or more content. Very disappointed on how it left you hanging\n\nHelpful | 0", "OSMONMar 23 at 8:02 PM\n\nFluid bow controls and being able to interact with a large array og objects makes this yhe bestgame on the quest\n\nHelpful | 1", "gravityandyJan 25 at 12:53 PM\nGood game for good boys review for AC\n\nIt is for good boys only it is good but the aim can be off cause,well,its a bow,it curves AKA your main weapon.Also hard isnt a challenge,well it is but it is like normal mode basically,and normal is easy and easy is negative something number so yah.i highly recommend this game if u like narrative,shooting and backtracking not to mention...THERES GRENADES!So yah.thats my review,also you teleport in this game. GOOD BOY GAME () ()\n\nU\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:04 AM\n\nHappy to hear, thanks for sharing!", "Drag01991Feb 9 at 12:09 PM\nIt's starts off well. But doesn't better\n\nThe game is amazing to look at the plot is kind of generic and game play is very simple . Add all of this together and it's boring....\nSimply boring there is no real excitement or tension in the missions. The enemies are simple and predictable the upgrade are pointless. And I guessed all the plot twists before I even got half way. You may like it but to me it's below average.\nDisappointing\n\nHelpful | 2\nDeveloper ResponseFeb 11 at 4:02 AM\n\nThanks for sharing your experience, sorry to hear it was not for you!", "Wknight76May 17 at 8:03 PM\nWorth it!\n\nThis is a great game! The only issue Ive come across is sometimes you get stuck needing a door code that you dont come across. I find myself looking at walkthroughs to find my answers. But it is a really good game!\n\nHelpful | 0", "Galapagos12Feb 13 at 8:03 AM\nFantastic Game!\n\nA lot of the negative reviews of this game are because the ending was inconclusive, and on the surface, it was. But there are so many more layers, levels to go back and visit, messages to review, secrets you can uncover after the final battle. Its fantastic storytelling, fantastic voice acting, fantastic graphics, and fantastic gameplay. All-in-all, a fantastic game.\n\nHelpful | 1", "AdamScuuteFeb 17 at 1:00 PM\n4.5\n\nI honestly thought it was a very cool game but a tip for if you decide to get it read almost everything all the notes and stuff I struggled my first day because I hadn't been reading most notes\n\nHelpful | 2", "exjraordinaryMay 30 at 8:25 PM\nexcellent title 2nd time buying\n\nI already played and beat this on my psvr, but I wanted to play wire free with much better tracking controls. This is pretty stunning for a quest title and great depth and replayability for tbe price. A sequel would be great, awesome developer.\n\nHelpful | 0", "HollisDJul 27 at 5:38 PM\nIt started over on me\n\nI got to the port to start the game and it started over  why ?\n\nHelpful | 0", "max090407Jan 14 at 12:24 AM\nAmazing\n\nGreat game, would Highly recommend it to anyone new it was a great starter off to the oculus quest. I would give this 5 stars but the challenges are very confusing and do not explain the puzzles very well, so I spent my all my time just sitting there not really sure what to do. So thats why I gave this 4 stars. I hope this review helps people and gets some more people to play this incredible game.\n\nHelpful | 1\nDeveloper ResponseJan 17 at 1:26 AM\n\nThanks for sharing your impressions, happy to hear you liked it (and fingers crossed you find your way forward:-)", "TeonisFeb 15 at 3:12 PM\nGreat!\n\nBefejezetlen, csak ennyi a panaszom. Nagy jtk, de a vge le van csapva.\n\nI wish there would be a satisfying ending. There are some glitches, like accidently teleporting through walls, but the gameplay is really cool.\n\nHelpful | 1", "Derpy_ManateeApr 18 at 8:02 AM\nIts pretty good\n\nWhen I bought this game, I thought that it would be more about fighting robots than solving puzzles. Most of the game doesnt tell you what to do and you are left walking around blind hoping you will find the answer. I have not finished the game yet but thats because I keep wasting 30 minutes each mission trying to find what Im supposed to do\n\nHelpful | 0", "CameraLenzMar 16 at 12:00 AM\nUnpolished, glitchy and dull\n\nThis game is no where close to a $20 purchase. Feels like an early sidequest game that is still being flushed out.\n\nHelpful | 1", "patcileinFeb 2 at 12:14 PM\nGreat Game!\n\nI haven't played it through yet but it was my first real VR game. Having this experience by loading the boxes alone was awesome, and how the enemies were approaching you, it was a strange but cool feeling. and now it is also with German subtitles! Thank you for the uptade! :)\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:09 AM\n\nYou are welcome, and thank you for sharing your impressions!", "Devistator92Jan 26 at 6:46 PM\nHighly Recommend!\n\nThis is a game you can hop into and your wanting to beat it same day! Nope cant stop here.... so I may just get this done real fast.... then cue SpongeBobs cut scene... two....hours.... later.... I can for see them making even more fun titles or even spin offs. It had me wanting to do so much more.\nAbsolutely worth my money.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:05 AM\n\nAwesome to hear, we got more games for the Quest coming up:-)", "VR_kyleFeb 18 at 1:20 PM\nNo joke dont waste ur time/money\n\nThis is the first game Ive hated in vr there are so many reasons why this game is bad but Ive already wasted enough energy with this game to write review on how bad it is. only reason I played it though cause oculus wouldnt refund me dont waste ur money wouldnt recommend this game even if it was free to play\n\nHelpful | 2\nDeveloper ResponseFeb 21 at 3:18 AM\n\nHi, We're sorry to hear that you don't enjoy the game. It would be really appreciated if you could give some examples of the things you didn't like. We really want to know!", "MisiuxxFeb 16 at 8:03 AM\nPretty good, but I swear the worst endin\n\nGame really good , but the ending (breath heavily out of nose) Ight imma head out.\n\nHelpful | 0", "lsutigers1Feb 23 at 1:04 PM\nCool\n\nGood story bad ending\n\nHelpful | 0", "ItzKalateralDec 27 at 7:00 AM\nMust have!\n\nI got the Oculus rift for Christmas this year and I also got a gift card for the store I bought this game because it said it was story driven and very immersive and had from what I saw beautiful graphics all of these are true this was a great first experience for VR I was learning a lot the shooting mechanics are fun I literally feel like I'm in a new world and I hate when I have to take the VR headset off\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:35 AM\n\nWow, thanks for sharing! And we agree, why do we need to take our headsets off at all???", "SenSSi_Jan 1 at 10:11 AM\n4/5 good buy\n\nGraphically good looking game with good story. I countered several bugs (picking stuff was buggy) little performance problems, but otherwise good buy \n\nHelpful | 3\nDeveloper ResponseJan 2 at 2:31 AM\n\nThanks for sharing! We are still working on improving the game, the next patch should not be far out:-)", "CrazyFinger4Jan 11 at 2:50 PM\nVery Solid Experience\n\nI waited until recently to finally try Apex and I must say I'm sorry I didn't try it much sooner. Everything about this game is great. The art style, the combat, the sound design. Buying upgrades from a vending machine with virtual currency is something I didn't even know I needed in my life. I didn't realize a fully fleshed out single player experience with great inventory management and an upgradable character was already here on my Quest this whole time! If you've been thinking of trying it...DO IT!\n\nHelpful | 2", "CortigiJan 6 at 7:26 PM\nA secret-filled campaign adventure\n\nI just finished the game, and I must say, it was a pleasant experience. Some of the levels proved to be difficult, but you have an arsenal of arrows and grenades to show the robots whos boss. The plot was intriguing and mysterious; you dont know whos the good guy and whos the bad one. Overall, Apex Construct is one of the better games on the Oculus. In my opinion, if you have time on your hands, definitely give this game a try.\n\nHelpful | 4", "drew.hyndsJan 9 at 3:11 PM\nOne of the best for quest\n\nAbsolutely love this game, the story was very intriguing, I loved exploring every part of each level looking for secrets and more points to upgrade my bows etc. This is a proper game that lasted me over 6 hours I'd say just on the story. Most games on quest seem to be arcadey type games that get boring fast, but this one kept me hooked til the end!\nAlso the price is perfect in my opinion, I'd say this game is far better than some of the more expensive quest games out there.\nI will definitely play this game again in future!\nPlease make more like this!!! :D\n\nHelpful | 2", "SchmebzJan 8 at 1:04 PM\nQuite disappointing\n\n(As of writing this I have not finished the game but I seem to have gotten very far into the game)\n\nThe voice actor of father isnt that good, his dialogue is so quiet that its so hard to hear him even when there is no other game audio interrupting him. The Twist that they seem to be doing is incredibly obvious the second you look around the hub area between levels. The levels are often on the same map and are very difficult to find where you are supposed to go. Anytime I wanted to hold the grip button to have my index finger out for typing, the game would automatically grab things for me when they werent that close. Grabbing things that were in tight spaces will almost always glitch into objects. The combat is very dull and the bow is somewhat difficult to aim well with and the aim assist that I have activated doesnt seem do do anything other than just say its activated.\nA game that seems to want to be about story is so difficult to get into the story if the Twist is very obvious and you cant even hear most of the dialogue.\n\nCant do half stars so 2 stars(would do 1.5 stars)\n\nHelpful | 3", "J03K3RJan 5 at 3:14 AM\nShockingly good\n\nThis game is definitely one to get if you want to experience the true potential of VR. A lot of games are similar to arcade games where you jump on and try to beat your score. That's ok, we are in the arcade area of VR. This game though takes you on an action packed, thrill filled mysterious journey.\n\nThe graphics are brilliant and demonstrates the true power of mobile gaming when done right. The level design is great but I will say that I'd you use free locomotion it be a bit of a hindrance when you have to teleport. Or you can just pretend it's one of your abilities and deal with it.\n\nThe combat has been executed perfectly. It's never too easy or too difficult. It's always challenging just enough. Archery is great in VR and this game delivers it flawlessly. The bow that you get just feels right.\n\nThe voice acting and story telling in this game is spot on. You know something suspicious is going on and the story telling and voice acting do a great job of leading you down the rabbit hole.\n\nThanks for the game\n\nHelpful | 3", "Icepick869May 11 at 4:32 AM\nAddictive story. I wasoccupied for hours\n\nI wasn't sure what to think when I went to start the game because I hadn't looked into the story. It's a mystery puzzle solving game with action thrown in. It does a good job with both.\n\nHelpful | 0", "mr.procasterFeb 6 at 7:50 PM\nAmazing Game!\n\nIve played this AMAZING game for a while now and I love it. Its a great Puzzle/Mystery game. It so AMAZING how much you can do in it. ITS ALL \n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:10 AM\n\nWow, thank you so much for taking the time to share your impressions, it means a lot to us!", "bigboy2006Jan 8 at 7:59 PM\nAbsolutely amazing\n\nThis is my first time on vr but this game just blows my mind, the entire plot and puzzles among the way are challenging but not to hard and the best part is the story in my opinion\n\nHelpful | 1", "Ich220106Jan 15 at 8:30 AM\nI wanted to give 5 stars\n\nI realy like the game and I wish I could give 5 Stars, but there is one major problem, I already teleported myself out of the world three times because I searched for money orbs . And after that I had to restart the whole levels what was realy anoying. :( But if you fix that I would give 5 Stars. :)\n\nHelpful | 0\nDeveloper ResponseJan 17 at 1:25 AM\n\nGreat to hear you like the game but sorry to hear about your issue. We will investigate this and hopefully find a fix for it in an upcoming patch!", "papyruswarriorMar 1 at 6:51 AM\nAmazing\n\nLike journey of the Gods but techno\n\nHelpful | 0", "kimsabaFeb 5 at 11:57 PM\nGood but\n\ncaption window is so small.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:02 AM\n\nThanks for sharing your experience, and for your input!", "CatMouse87Jan 23 at 11:02 PM\nOne of my Favorite games!\n\nThis game is so much fun, it took me awhile to figure it out. Once I got the controls down I felt like a super hero!! Haven't finished it yet but I'm sure I'm pretty close!! This is a must have!!\n\nHelpful | 0\nDeveloper ResponseJan 24 at 8:04 AM\n\nWow, thanks for sharing, this makes us so happy to hear!", "A_pug925Jan 25 at 8:13 AM\nIt's ok\n\nThe game to me was just bland and boring I haven't played it in a long time and I just don't really care about it so if you are a 1st time be player good place to start but if you play be a lot I do not recommended\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:01 AM\n\nThanks for sharing your experience!", "AnarchyFalloutJan 20 at 2:58 PM\n\nVery fun to play, got it as soon as I got my oculus, been playing it for a while.\n\nHelpful | 0\nDeveloper ResponseJan 23 at 11:26 AM\n\nHappy to hear!", "twasyesfirstDec 7 at 8:37 PM\nGood game, probably wont play again\n\nI was loving the game, amazing graphics, and the puzzles so far were fun and challenging! I was on a mission to get a key card or something, and I go up an elevator and then Im outside of the map... I replay, up to that point, try standing in the middle of the elevator, and Im outside of the map again... by that point the mission had gotten extremely tedious and I didnt have any other options so I havent touched the game since. That said, I think if it was working properly this would be a 5 star review. Sadly, I dont have the patience to try again and the experience I had so far wasnt worth the money I paid...\n\nHelpful | 4\nDeveloper ResponseDec 12 at 1:21 AM\n\nHi, sorry to hear about this issue. It's the first time we hear about it, so if you have the time we would appreciate if you could email support@fasttravelgames.com and we will investigate this at the studio.", "EyeballPrincessOct 18 at 9:15 AM\nSolid game\n\nThis game looks good and has fun puzzles and secrets to find. There is a story to it that is lacking in some other vr games I've tried. The archery mechanics are alot of fun to play with. There is occassional bugginess that causes your hands to disappear. I haven't figured out the cause yet. All in all it is a solid game.\n\nHelpful | 10", "Uno234May 22 at 8:05 PM\nIts amazing\n\nIts a cool game and the puzzles actually make u think.\n\nHelpful | 0", "VOIDWALKER117Apr 28 at 7:05 AM\nLove this game\n\nIt a great game fun and all but it would be cooler if it was multiplayer\n\nHelpful | 0", "Dazzed2Feb 2 at 4:22 PM\nAwesome game\n\nSo far it's a great game. Very I interactive. I'll update as I get further through the game.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:01 AM\n\nThanks for sharing your experience!", "kaumacDec 29 at 11:44 AM\nOne of the few great games on the Quest\n\nThis is one of the very few games that feel like an actual game and not just an experience. It feels like a game made by Valve like Half-life or Portal, it has all the ingredients: Great storytelling, good design and well thought experience. Worth every cent!\n\nHelpful | 1\nDeveloper ResponseJan 2 at 2:33 AM\n\nWow, thank you so much for sharing this, it makes us very happy to read!", "guthisindaheezyOct 22 at 7:04 AM\n\nCouldn't comprehend just how fun it would be to play a game you're totally immersed in until getting Oculus. So much fun. Even mundane tasks like opening doors, hitting switches, and reading clues is awesome. This game is pretty fun, love the fact that your weapon is a bow. Been playing for a few days now amd still haven't reached the end. Definitely worth the cost of the game.\n\nHelpful | 24\nDeveloper ResponseNov 6 at 12:28 AM\n\nThanks for sharing, so happy to hear you have found your way into the amazing world of VR!", "BrewbiaJan 29 at 12:57 AM\nReally nice Game\n\nWith multilanguage subtitles at the Quest now. Will there be multiple language subtitles on the Rift S?\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:05 AM\n\nIt has been updated on the Rift as well!", "Quicksand_GamingMay 11 at 6:56 PM\nWorth it\n\nThis game is very much worth the price and I would buy this over and over.\n\nHelpful | 0", "Nuffums117Nov 26 at 2:50 PM\nGreat game, Crap ending.\n\nI so desperately wanted to give this game 5 stars but with the ending the way it is, I just can't bring myself to do it. The ENTIRE game was great, great story, fun combat, decent puzzles and lots of nooks and crannies to find little secrets. But the one glaring issue with it all is the ending. If its ever patched or dlc comes out with a better ending, I will gladly add that last star and take back everything about the ending.\n\nHelpful | 0\nDeveloper ResponseNov 29 at 8:10 AM\n\nThanks for sharing, happy to hear you liked the game! Hopefully we are not done with the Apex Construct universe just yet, but time will tell!", "RealCosmicApr 19 at 12:42 PM\nGreat Looking game\n\nOkay so lets talk about the graphics they are amazing one of the best looking games Ive ever played if you love story driven games its definitely worth a buy \n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:10 AM\n\nWe are very happy to hear this, thanks for sharing!!!", "livescanDec 14 at 7:28 AM\nUnbelievable immersion\n\nI bought this game day one, with many others, of the release of the quest, but never tried it. Yesterday, I decided to give it a try and wound up playing for hours and absolutley loved it. I cant believe I passed on this immersive title for so long. The game story is great. The combat is awesome. The puzzle solving is very clever. I cant wait to get back in today! Great job!\n\nHelpful | 1", "FunkDaddy77Dec 28 at 3:56 PM\nDecent Bow mechanics, story is ok so far\n\nGame feels a little clunky with everything other than bow mechanics. Enemies feel pretty repetitive quickly. There are better stories on VR and better combat mechanics on VR to be found elsewhere. Worth it to wait for a sale here, it leaves more to be desired.\n\nHelpful | 2\nDeveloper ResponseJan 2 at 2:33 AM\n\nThanks for sharing!", "Kaliber_1Jan 12 at 8:37 AM\nVery immersive experience\n\nNot a fan of the bow gameplay. Not a fan of the esthetic. Not a fan of the ennemis nor the map. But Wow! 1rst game I play and feel being part of the world.\n\nHelpful | 0", "phil.wessonNov 8 at 5:06 AM\nGreat game, great concepts, bad ending\n\nIve been a gamer since the Atari 2600. If theres one thing that can make vr more widely used cuts great content that challenges and tells a great story.\n\nWe were really close with apex construct. Great visuals and voice acting which reminded me of system shock, but an ending so lacking in substance that it felt like a last minute edition.\n\nGet it if its on sale, but otherwise ignore.\n\nHelpful | 8", "CubegiantMay 14 at 4:30 PM\nEpic\n\nIt's a epic game\n\nHelpful | 0", "Dwalker1000Jan 12 at 12:20 PM\nApex Construct *must have\n\nAmazing game that utilizes the oculuss feature. This game has a great story line and I definitely wish I got it sooner than I did\n\nHelpful | 0\nDeveloper ResponseJan 17 at 1:26 AM\n\nAwesome to hear, thanks for sharing!", "DiversionwolfJan 4 at 4:03 PM\nJumpy\n\nI makes me constantly jump its terrifying and realistic\n\nHelpful | 0", "RestES6Nov 27 at 8:28 PM\nAlright Game; Lackluster Design\n\nThe game is, at time, an awesome example of what VR can do but occasional glitches, subpar level design, among other things left me wanting more.\n\nWould say it's a good game to pick up if you seem really interested but it's not a must buy for me.\n\nHelpful | 4", "jedfryDec 7 at 5:59 PM\nCan not find a SEC 3 card\n\nI love this game and the details are amazing but the game is wanting me to bring a SEC3 card with me and I can't find them anywhere , if your reading this devs PLZ just tell me were it is, I've googled it a thousand times but I still can't find it\nThanks for responding devs, I'll look there\nUpdate: I found it and was able to go further on in the story, thank you! Can't wait to see what will happen\n\nHelpful | 0\nDeveloper ResponseDec 7 at 1:18 PM\n\nHi! in the mission Into the Dark, you pick up a SEC-3 card to be able to leave the underground. After that it should be available in your safe house. If this doesnt happen, you might have run into a bug. Please let us know on support@fasttravelgames.com.", "Sonictheboss8472Jan 8 at 4:42 PM\nLoving every second of this experiance\n\nBad at reviews but trust me this game is worth the money and time. Has a good amount of playtime, and a lot of secrets to find.\n\nHelpful | 0", "richsandy48Dec 14 at 12:41 PM\nEnding?????\n\nGreat game all through the many levels ending was abrupt no explanation just ended the world didn't go back together\n\nHelpful | 8", "Mrsalt4503Jan 24 at 3:30 PM\nYeet\n\nThis game is very yeet\n\n\n\n;)\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:01 AM\n\nAwesome to hear!", "ahill426Jan 3 at 6:48 PM\nApex Construct\n\nMost fluid fighting game you'll find. If you like the series the maze or very intense puzzle thriller's this is it!!!!!!!!!\n\nHelpful | 0", "Irondragon82Jan 25 at 5:24 PM\n\nGreat game\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 4:04 AM\n\nThank you so much!", "Stampy2330Jan 20 at 12:51 PM\nCrap\n\nCrap cant get past mission 2 after you go in your base\n\nHelpful | 3\nDeveloper ResponseJan 23 at 2:10 AM\n\nHi! I'm sorry this has happened to you. Could you please send us an email to support@fasttravelgames.com and describe your problem so we can help you?", "JackpotsevensJan 3 at 6:38 PM\nGood puzzle game mixed with action\n\nGood game.\n\nHelpful | 0", "MaXiMuS.BrAmWeLl505Jan 9 at 10:17 AM\nVery disappointed\n\nIf you like horrible graphics and terrible controls then this is the game for u :/\n\nHelpful | 3", "MaXiMuS.BrAmWeLl505Jan 9 at 10:17 AM\nVery disappointed\n\nIf you like horrible graphics and terrible controls then this is the game for u :/\n\nHelpful | 3", "Dany.ChryApr 30 at 9:04 AM\nGlitches\n\nIs a funny and nice game but full of glitches everywhere!\n\nHelpful | 0", "ESC_STATICMar 31 at 7:48 PM\nGreat\n\nI already love this game and I just started! As dead as they are, I think there should be a BR mode in this cartoony design. Cant wait for a sequel?!\n\nHelpful | 0", "webmotionksNov 17 at 5:44 PM\nLove this game!\n\nI am a sci-fi fan of single first person shooter campaigns with puzzles to solve and Apex Construct delivers on those points. I will admit it gets a bit confusing sometimes but you only need to take a break from the game in order to regroup to realize what you need to do next. I am having a ton of fun with this game! I totally recommend it for people looking for a good sci-fi mystery to solve with some great aim and shoot enemies and and overall story arc that keeps you guessing \n\nHelpful | 3\nDeveloper ResponseNov 29 at 8:08 AM\n\nThank you for sharing, so happy to read this!", "GomaqNov 5 at 9:31 AM\nFull Immersion!\n\nWith room to play, this is stepping into a video game! Designs are gorgeous. Action is fun and exhausting. Sound design is top notch. Occasionally there is a clue thats a bit of a pain to find, it flows nicely for the most part. Will definitely play sequels!\n\nHelpful | 2\nDeveloper ResponseNov 6 at 12:25 AM\n\nGreat to hear, thanks for sharing!", "MickyQ0427Nov 8 at 11:14 AM\nKept me quiet for weeks\n\nThis game is fantastic. The levels and the difficulty are spot on. I was immersed from the beginning and now I think about it I still haven't finished the game yet. Good story. Controls are easy to get used to and become very intuitive. Looks great in the game and sounds amazing. More like this please.\n\nHelpful | 7\nDeveloper ResponseNov 29 at 8:11 AM\n\nWow, thank you so much for sharing!", "BrewDaddyDec 27 at 2:53 PM\nLocks up\n\nGame keeps locking up after I get the first core. I don't understand, rebooted turned oculus quest off and still not saving game after I finish quest.....\n\nHelpful | 1\nDeveloper ResponseJan 2 at 2:35 AM\n\nHi, sorry to hear about your issue - could we ask that you email support@fasttravelgames.com with some details on what you are experiencing, and we will try to help you there!", "jtiger01Oct 28 at 10:16 AM\nThis is a must have game!\n\nI am fairly new to vr and this was my second game I played on the Quest and let me tell you, I was AMAZED. The level design, the graphics, the story and the game mechanics are simply amazing. I wish there was a battle arena type mode where I could shoot up endless waves of these robots. I would also like to be able to revisit the early levels with all my load out. Replying the first level has you going through the tutorial again. However, that is just icing on the cake, cause this game is a work of VR art.\n\nHelpful | 10\nDeveloper ResponseNov 6 at 12:27 AM\n\nThank you so much for sharing this, so happy you enjoyed our game!", "Ballistic121Dec 9 at 6:10 PM\nAbsolute must have\n\nI saw this game and immediately fell in love. amazing story, combat, and sound design. Failing doesn't punish you beyond reason, but still gives a reason to try. Definitely buy this!\n\nHelpful | 0\nDeveloper ResponseDec 12 at 1:19 AM\n\nSo happy to hear you liked it!", "matthew.r.barretoDec 11 at 11:02 AM\nAwesome Game\n\nLove this game. The feel is immersive on the Quest and laden with emotion and hidden gems. The puzzle aspect is both complicated and still solvable.\n\nHelpful | 1\nDeveloper ResponseDec 12 at 1:18 AM\n\nFantastic to hear, thanks for sharing!", "Maura1129Nov 17 at 11:25 AM\nMore like this please!\n\nI am new to the VR world and this game has won me over. I wish there was more to it but since there isn't I am hoping there will be more games like this for Quest.\nI enjoyed using the bow & arrow as it made for a more immersive experience.\n\nHelpful | 3\nDeveloper ResponseNov 29 at 8:11 AM\n\nSo happy to hear you liked it, it means a lot to us!", "TheSage44Mar 28 at 1:54 PM\nWorth the money\n\nHas a few glitches they need to work on but it's really well put together game. Definitely worth the money\n\nHelpful | 0", "PaperFace224Dec 13 at 9:35 AM\nYou Van buy ist of you like Puzzlegames\n\nIts Good\n\nHelpful | 0", "CrownofthornsApr 1 at 7:38 PM\n\nWas good until the device mission, can't pull the switch at the top of the tower.\n\nHelpful | 0\nDeveloper ResponseApr 21 at 1:18 AM\n\nHi, this sounds strange - could we ask that you send an email to support@fasttravelgames.com with details about the issue you are experiencing, so we can investigate and help you that way?", "MiquickJan 17 at 3:21 AM\nNot a good buy\n\nSo far I can not see why this was a good buy. Maybe one day soon I could write a better review.\n\nHelpful | 1", "DavidHagerDec 16 at 2:10 PM\nGreat Game\n\nThis is by far the best game so far for the Quest. Not short like all the other games. I am disappointed that there aren't more games like this for the Quest. Great job and hope you have other games like this on the way.\n\nUpdate: In my opinion this is the best game for the quest, The rest are just like demos.\n\nNow if you could create a New Game - Tournament Paint Ball for the Quest and take advantage of being wireless, I believe it would be a big hit - Multiplayer, Team Play and Single Play Training\n\nHelpful | 5\nDeveloper ResponseNov 6 at 12:28 AM\n\nThank you so much for sharing, really happy to hear! We are absolutely focusing on the Quest for upcoming titles:-)", "libertyluberDec 22 at 12:39 PM\nCrazy awesome!\n\nThis is why I wanted to get into VR. Amazing!\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:38 AM\n\nThank you!!!", "H4LF-N3LS0NDec 18 at 7:25 PM\nWonderful mystery\n\nThis game has a thrilling story line and unmatched gameplay.\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:38 AM\n\nWow, thank you so much for sharing!", "LazyTurkey24Nov 29 at 8:43 AM\nWorth it?\n\nI personally dont think that the game was worth the money so if you are choosing between this super hot RoboRecall or another big title I would suggest looking around a bit before choosing this game.\n\nHelpful | 5", "Builderexpert07Nov 18 at 3:36 PM\nGood but...\n\nThe missions get a little repetitive after a few times. But over all a good game!\n\nHelpful | 2\nDeveloper ResponseNov 29 at 8:09 AM\n\nThanks for sharing, happy to hear you liked it!", "Gamerdragon7008Dec 8 at 6:19 AM\nFun and challenging\n\nI had fun doing the puzzles and defeating the increasingly difficult enemies. I loved it.\n\nHelpful | 1\nDeveloper ResponseDec 12 at 1:19 AM\n\nThank you so much, this makes us very happy to hear!", "SmoothChutoy963Dec 26 at 8:33 AM\nThe best\n\nThe best\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:36 AM\n\nThis review is pretty best as well, thanks for sharing!:-)", "Tr3yNy3Dec 2 at 4:05 AM\nGreat game\n\nOverall great game, but I think that it would be cool to be able to use different weapons, like sword or something.\n\nHelpful | 0", "JJSLAYERDec 9 at 1:22 PM\nMore than I hoped for\n\nThis game is amazing has great gameplay and amazing scenery\n\nHelpful | 0\nDeveloper ResponseDec 12 at 1:19 AM\n\nWow, thank you so much for sharing this!", "Pan79_8472Oct 23 at 9:58 AM\nA most EXCELLENT time!\n\nFun game. Puzzles arent too complicated. Its neat to peak around hallways to sneak attack enemies with your bow and arrow. Makes you feel like the Avenger Hawkeye in some spots! At times you need to be like Hawkeye. Hehe. You wont be disappointed!\n\nHelpful | 4\nDeveloper ResponseNov 6 at 12:29 AM\n\nHawkeye rocks. Thanks for sharing!", "kokujin620Oct 1 at 3:12 AM\nFinally A game, not a tech demo!\n\nI know there are many story driven games out there but this is the first one that I have finally felt like wasn't a tech demo. I traveled through many lands and saw so many things. The story has me hooked and im in love with my bow and arrow. Idk what it is but this game just feels like the reason I bought my quest!\n\nHelpful | 9\nDeveloper ResponseOct 14 at 5:42 AM\n\nSo great to hear, thanks for sharing!", "Dr_StormDec 7 at 4:14 PM\n!!!\n\nThis is such a great game 10/10 would recommend\n\nHelpful | 0", "deaddeer1372Nov 24 at 7:50 AM\nBest be experience\n\nI had not experienced anything like this game before. I recommend buying just for the nostalgic feeling.\n\nHelpful | 1\nDeveloper ResponseNov 29 at 8:09 AM\n\nThank you so much for sharing this!", "TNPantelopeOct 25 at 7:06 PM\nI aint vibing\n\nThe enemies get repetitive and I wish they had done more in terms of skills and weapons.\n\nIts also be nice if they gave you more choices.\n\nHard battles in this game is literal trash, the just take a bunch of easy enemies and throw them at you. So yeah.. I aint vibing\n\nHelpful | 2", "NickMajoraOct 19 at 12:50 AM\nToo buggy\n\nI believe there's a worthwhile game underneath but I can only end up teleporting outside of a level and having to restart so many times before I just give up.\n\nHelpful | 7", "keith.i.deeDec 6 at 6:06 PM\nLove it\n\nGreat game for VR experience\n\nHelpful | 0", "s3rgiVROct 12 at 3:16 AM\nI dont recomend it\n\nBuggy and unfinished game. The machine where you start the missions sometimes just disapear. The hitboxes of enemies are to small making it so hart to hit with your arrows.\nThe games is always the same, look for codes to open dors, kill the same enemies and come back to loby with some important item.\n\nHelpful | 13\nDeveloper ResponseOct 14 at 5:45 AM\n\nHi, thanks for sharing your review & sorry to hear you did not like the game. As for the disappearing mission selection screen, this is the first time we hear about it. Would you mind sending an an email to support@fasttravelgames.com with some details about your experience so we can investigate?", "sandman1978Nov 1 at 4:28 PM\n\nCool game but wish it was longer! Still great game!\n\nHelpful | 1\nDeveloper ResponseNov 6 at 12:26 AM\n\nThanks for sharing! Hopefully the Cygnia Cup Challenge game mode can keep you occupied after beating the main story:-)", "stuart.fisher.79Aug 27, 2019 at 11:57 PM\nSolid Full length adventure\n\n.. probably rushed out for its initial launch.\nHaving played lots of titles on the Quest (and gaming for decades) Apex Construct should be commended for being a full length adventure in VR. The combat mechanic works well, the environment and art style are excellent and the story is interesting enough to keep you moving through the levels - which do become slightly repetitive.\nThere are a few bugs and the ending reuses a mid game boss (and doesnt conclude well) which sounds like the symptoms of a rushed launch. However I dont think this distracts too much from what is a really good full length game - something VR is currently lacking.\n\nHelpful | 6\nDeveloper ResponseSep 25, 2019 at 12:07 AM\n\nThanks a lot for sharing your experience!", "jaylaa8Nov 21 at 1:48 PM\nGreat game\n\nI love this game so far\n\nHelpful | 1\nDeveloper ResponseNov 29 at 8:08 AM\n\nFantastic to hear!", "Der_MountainSep 26, 2019 at 12:13 PM\nGreat experience!\n\nI spent a lot of time in this game and I enjoyed it all the time.\nThe story telling is great and to shoot with a bow in VR is an awesome experience.\nI do not want to miss this experience.\n\nHelpful | 3\nDeveloper ResponseOct 14 at 5:41 AM\n\nThis makes us very happy to hear, thanks for sharing!", "jimmyjam5000Sep 22, 2019 at 5:32 PM\nSo far, pretty cool\n\nOkay, I can get down with this. The map definitely feels more-or-less open. The mechanics are solid. The ambiance is eerie which I like. I love that I can open so many file cabinets. I dont quite know what to do with the secrets.\n\nOverall, this not only passes my is it worth the money test, but I think this is absolutely a must-buy. I was skeptical at first, wasnt sure what to expect. But definitely worth it.\n\nHelpful | 0\nDeveloper ResponseSep 25, 2019 at 12:05 AM\n\nSo happy to hear you liked it, thanks for sharing!", "Infamous2ndSonOct 28 at 11:15 PM\nTedious\n\nNice art design. But the map / level design is confusing. Tedious having to backtrack soooo often. Very annoying. But the arrow & shield based combat is pretty cool.\n\nHelpful | 5", "Sn0wyNe0nNov 3 at 7:20 PM\n\nDont even need to say anything just look at it.\n\nHelpful | 2\nDeveloper ResponseNov 6 at 12:25 AM\n\nThis is an amazing review according to our art department!", "wasbieOct 14 at 4:45 PM\nPretty awesome\n\nThe game is great but the walking is kinda wonky\n\nHelpful | 1", "jacob.maguire.73Nov 6 at 5:29 PM\nAmazing\n\nI absolutely love this game !!!!\n\nHelpful | 1\nDeveloper ResponseNov 29 at 8:11 AM\n\nAwesome to hear!!!", "CaptainMcLemonSep 8, 2019 at 7:21 AM\nOne of my favorite titles on the Quest\n\nThis was one of the first games I got, so I didnt have much comparison, but this game is very good at basically everything its trying to do. The storyline and narrative are entertaining and engaging as you discover more to the new world you are thrust into, and the weapons system work better than any bow and arrow I have used in VR. Theres only one problem, sometimes grabbing an item will glitch out (no big deal) until on occasion things like clipboards will fall through the floor and every now and then dont respawn. Other than that, the game is great and if youre looking for an interactive story, this is the game for you.\n\nHelpful | 4\nDeveloper ResponseSep 25, 2019 at 12:05 AM\n\nMany thanks for sharing!", "MoneybagvrOct 14 at 12:22 PM\nWell\n\nMy girl likes it I dont play it not a fan of the bow\n\nHelpful | 0", "cylerlarocqueDec 23 at 8:54 PM\n\nPersonally, the game seems to get kind of old really quick. Ive had it for a month now and within the first week I kind of gave up on it. Its quite repetitive and doesnt quite add anything new frequently enough to make me enticed in the experience. The movement also gives me motion sickness (teleporting and locomotive), but that may be my personal body reacting to vr.\n\nHelpful | 8\nDeveloper ResponseJan 2 at 2:38 AM\n\nThanks for sharing, have you fiddled around with all the comfort settings in the Settings menu to see if adjusting these helps remove the motion sickness you are experiencing? There are multiple adjustments to make for speed, turning, vignettes etc.", "ArnookieMay 20, 2019 at 6:36 PM\nApex Construct A must have day 1 buy.\n\nApex construct is simply stunning. A definite day one buy. I highly recommend this to everyone.\nThe in game scenery and graphics are stunning. This is some amazing use of the Oculus Quest hardware.\nThe tracking is perfect and gave me no issues at all.\nVisually compared to the PC version it's hard to see the difference between them. Some places and areas a slight drop in detail is noticed but overall an excellent job has been done to make this look so good on the Oculus Quest. Scale and depth are perfect and leave you feeling like you really are in the Apex world.\nThe gameplay is fun and even relaxing at times a great mixture that would be suitable for most people new to VR.\nUsing contols and weapons is simple and effective and is very seamless with great tracking and using the crossbow is just bliss.\nOccasionally items seem to get stuck into the scenery but this is a very slight issue that isn't really a problem or something that causes issues with gameplay at all.\nSome areas walking seems to stick for a slight second but again not an issue that effects the overall gameplay of the game.\nI highly rate this and suggest everyone picks this up day one. Fast Travel Games has done an amazing job porting this to the Oculus Quest.\nA great fun and highly enjoyable game.\nMake sure you pick this one up. You really should not miss out.\nReviewed by ArnookieVR\nhttps://www.facebook.com/groups/390629631672716/\n\nHelpful | 354", "ChenteJOct 5 at 5:43 PM\nGood but a little buggy\n\nA good game with a nice story so far but sometimes the hands can be a little buggy\n\nHelpful | 0\nDeveloper ResponseOct 14 at 5:44 AM\n\nHi, thanks for sharing your review! If you have the time we would not mind if you sent an email to support@fasttravelgames.com with some details about your experience with these buggy hands so we can investigate:-)", "furtinMay 22, 2019 at 10:45 AM\ngreat gaming experience\n\nI had AC on my radar for the PSVR but due to the wireless roomscale and better tracking I decided to go for the Quest version, knowing the graphics might take a hit. But overall its a very satisfying game to play and not knowing how it looks like on the bigger systems, I must say that I find the graphics simple but beautiful.\n\nIm an older gamer though, so maybe I dont need the fanciest of graphics. The convenience of faster in and out into VR of the Quest, makes this and other titles my preferred VR console.\n\nHelpful | 176", "nwgsweetOct 17 at 7:29 PM\nMust have\n\nAmazing graphics and great game control system\n\nHelpful | 0", "JonnyQuest5Aug 25, 2019 at 7:56 AM\nQuest game I have enjoyed most so far\n\nOut of all the Quest games played so far I enjoy this one the most so far, Im not so sure about the choice for a \"cartoonish\" look but its ok, best part is in the settings you can just about set everything the way you want, I like how you can pick things up from the floor without a struggle but there are a few places you must use teleport to get to for no reason, switching to weapons is a bit of a issue one button would have been better, I really like that you have your own safe house apartment. Its not perfect but pretty close.\n\nHelpful | 0\nDeveloper ResponseSep 25, 2019 at 12:09 AM\n\nSo nice to hear you liked it, thanks for sharing!", "manxryanAug 14, 2019 at 1:56 AM\nAmazing but a bad initial experience\n\nI'm amazed by this game its exactly what I wanted in vr. Simply stunning and immersive. The gameplay was challenging at times but kept to the story.\nIts well worth checking all the computers and reading through to get an in depth story. I won't give to much away but it's well worth your money.\nMy initial bad experience was I lost my save points twice. I then went through the refund process which was declined and after re installing it never happened again. Possibly a glitch on my system so Im unsure but I said it never happened after reinstall of the game.\nI'm glad that I gave it another go and was able to complete the game although it must be said I was hoping for more of a climatic ending.\n\nHelpful | 4", "muzefulSep 7, 2019 at 7:11 PM\nFun story, but awful VR Sickness\n\nI love this game. But Im disappointed by how quickly Im nauseated when playing. Even with comfort settings. Im not easily sickened in VR, but this game really challenges my experience.\n\nOther than that, the world is cool. The story is interesting.\n\nHelpful | 0\nDeveloper ResponseSep 25, 2019 at 12:07 AM\n\nHi, sorry to hear about your nausea issues. Have you tried using Teleportation as movement? Or using HMD-driven locomotion? There are quite a few options to try. If the problem persists, we would be happy to try to help you out if you email support@fasttravelgames.com and give an explanation of your experience. Thanks!", "JrHexerJul 21, 2019 at 7:35 AM\nMini action RPG with an immersive story\n\nI am hungry for a real RPG on Quest, something like The Witcher 3, or Wasteland 2, and this is the closest (although much simpler) thing I found so far.\nThe graphics look great. The combat may be a bit repetitive, but I would not call it too easy, feels like the right balance for fun. The skill system is just linear weapon upgrades, but that is compensated by physically learning the skills of aiming a bow, dodging IRL (which feels awesome), using cover and shield, etc. Switching the arrow types felt annoying in the heat of a battle with no single button shortcut.\nThe story is linear but pretty well delivered. The immersion is great, the world feels consistent and whole. You can revisit the levels at will, although there is little point to that beyond finding secrets. Overall a very nice game to choose right now.\n\nHelpful | 4", "Az0thAug 16, 2019 at 7:46 AM\nThrilling sense of paranoia\n\nWhilst I have only played through the first mission (excluding the introductory level), I can certainly say that Apex Construct is very good at inducing a sense of paranoia: you constantly feel as though danger is waiting right around the next corner, or creeping up behind you. I found that I was on edge for a lot of the first mission and, as scary as it was, it was also very thrilling and ensured that the sections between combat held the same excitement.\n\nThe story, even this early on, is very interesting, and does a great job of making you want to play more and discover what is really going on here.\n\nHelpful | 0", "Lord_GeniusAug 9, 2019 at 4:57 AM\nPretty good game\n\nI have already played several games in Oculus Quest. This game is a full game you can enjoy for a long time and not like others games on Oculus Quest store (that are more like mini games you will spend 2 hours before finishing them). Bad points is that some times glitches occurred and you have to restart the game. Also you cant save the game in the middle of the level so sometimes you have to recharge your VR device when youre playing unless you will lost all your progress.\n\nHelpful | 2", "langdreamerAug 13, 2019 at 11:56 PM\nBoring, buggy\n\nI got it before the Quest even released, and I've been playing it since the first week, but I still haven't finished it. The whole thing feels like a chore. The gameplay is repetitive. You'll spend 70% of the time looking for password codes for the different doors. Gameplay is also quite boring. Additionally, the game is quite buggy. Whole areas not loading, doors not opening when they should, the game letting you teleport outside of the map and not letting you go back in, etc.\n\nHelpful | 8", "ted.sahlstromSep 29, 2019 at 7:15 AM\nAmazing\n\nIve tried many VR games but this is by far the best.\n\nHelpful | 0\nDeveloper ResponseOct 14 at 5:42 AM\n\nWow, thank you so much for sharing this, our devs are all smiles at the moment:-)", "BudapestiJul 16, 2019 at 6:14 PM\nDoes Your Mthr Know?\n\nIn a future Sweden, two warring AI battle for supremacy. Armed only with a bow & arrow, you're a kind of Super Trouper, who must take down an army of robots. As the Man in the Middle, you must uncover the game's central mystery - why are you Under Attack from these mechanical monsters?\nThe Day Before You Came to this mysterious, ruined city something big went down. The AI known as Fthr, sends out an S.O.S. Upon your Arrival, he claims 'I've Been Waiting For You, you're One of Us', and sets you off on a fairly lengthy action adventure. The female AI, Mthr, is all 'Don't Shut Me Down', but the mystery deepens as you play through the mission-based levels. The bow combat is a lot of fun, although having to open up a menu, select your arrow type (there are three), close the menu and then fire meant that I sometimes felt the bow Slipping Through My Fingers before I had a chance to attack.\nThe ending does happen suddenly and abruptly though, after about six hours of play, and The Name of the Game is never really explained. I Have a Dream that, perhaps, we'll get a sequel at some point. I certainly hope so, as I'd like some kind of resolution to this fun, but slightly flawed, experience.\nFor $15 though, I Do, I Do, I Do think it's worth the Money, Mone... okay, that's enough Abba references.\nWhen All is Said and Done, it's a good game for the price. Buy it.\n\nHelpful | 1", "pacohamJun 29, 2019 at 12:58 PM\nMixed bag\n\nThe game is a mixed bag. It's fun shooting robots and the world looks pretty but the movement is very clunky at times especially if you're using free locomotion.\nIt's also fairly easy to accidentally drop the security cards and have to backtrack to get another one. I liked reading the notes and terminals but I'm an average height guy and had to bend over uncomfortably in order to read the terminal screens. I was interested to see how the story developed but it just kinda ended abruptly.\n\nHelpful | 9", "amazinga23Aug 27, 2019 at 5:13 PM\nWOW!\n\nWhat a great game! Runs beautifully on this system and to me is one of the best looking titles. Bow handles great and super fun to use. 20 bucks well spent. Highly recommend\n\nHelpful | 0\nDeveloper ResponseSep 25, 2019 at 12:08 AM\n\nMany thanks for sharing your impressions, this makes us so happy to hear!", "GojiraCellSep 15, 2019 at 2:21 PM\nFun...at first\n\nIt gets repetitive pretty quickly, and the non-ending will leave you feeling pretty ripped off.\n\nHelpful | 2", "Jud_da_BotAug 22, 2019 at 6:05 AM\nGG, bots!\n\nAmazing game! Semi-difficult puzzles, amazing action, and great graphics! However, it is a bit creepy with different clicking and scraping sounds. but once you get used to it its amazing!!\n\nHelpful | 0", "TheSwirlingBrainJul 24, 2019 at 9:39 PM\nGreat Adventure Game\n\nThis was one of the first apps I bought. If you like adventure games, this one is OK. Play is mostly wandering looking for codes to enter into the computer or retrieving stuff. A bow and arrow with various tips will kill the bad robots trying to slow your progress. A few bosses or hard levels give your play a twist. Finally, the game ends but not very satisfyingly. Perhaps they will continue it and make a better ending. I really enjoyed this one and have gone through it twice just to see if I could find anything different. There's places you can transport to that I don't think you're supposed to be able to and you can get yourself way out in left field looking at missing objects, not that that's fun or gets you anything but it can be done. There's some mini arrow shooting games that can be played also which adds a little bit to the game but that gets old quickly and appears to just be an afterthought. Anyway, I'd highly recommend the game as it was a fun adventure.\n\nHelpful | 2", "HooverFlyJul 24, 2019 at 9:31 AM\nGreat adventure\n\nThis is what I want to see more of in VR. Games where you go on a journey.\n\nBe nice if they can halve the locomotion speed - made me motion sick and I rarely get that and turned it off. Prob due to strafing.\n\nHelpful | 1", "Grimlock_ArtsJul 28, 2019 at 1:15 PM\nGood experience, buggy level design\n\nI like it over all so far but... As a level designer myself I have to say this must have been hastily put together with minimal beta testing. I lost track of the number of times I was able to warp outside of the game play area and discover it was a one way trip and had to exit the level. Also I get that you all had to reduce the number of polygons rendered but dang, there's visible holes all over the environments, it kills immersion. Another issue that has been troublesome is the delayed rendering of objects in the distance. You come around a corner to what should be a breathtaking sight only for it to be bits and pieces of it forming in your view. Yes, I get it again, blame the processor right? Nope, that's just poor level design. If you need to render a bunch of stuff coming up then connect it to an area with very little to render to free up processing power... Honestly, I really like the story so far but the level design techniques that kill the experience are very amateur... I know you all probably rushed to release on the Quest release date but please now that it's out go back and fix everything and update it to something that you can be proud of that properly represents your design studio! Thanks , I really hope you all clean up the level design and update your game, I would have given 5 stars if these issues weren't there.\n\nHelpful | 11", "Crazy_SaneJul 11, 2019 at 7:08 AM\nMust Have Title\n\nThis is a great game. It feels polished and runs smoothly. Unlike some shorter experiences, this is a complete game that will keep you entertained for hours with lots of action and problem solving. The story is original and intriguing, and the target challenge mode is a nice touch. Well worth the price.\n\nHelpful | 5", "tim.cassidy.56Aug 20, 2019 at 9:51 PM\n\nThis was a great first experience in VR. The world was immersive and good looking. However, I did not bother to finish the game. The gameplay was tedious and the story didn't interest me.\n\nHelpful | 5", "SyrusVWolfAug 2, 2019 at 5:59 PM\nHelp Im stuck!\n\nIm currently on the mission where you need to build a force field around your base and you need three power cords Im at the part we need to get the last power core and I need to go to mothers domain I got stuck and I dont know where to go can someone please help me?\n\nHelpful | 0\nDeveloper ResponseAug 6, 2019 at 5:13 AM\n\nHi, if you send an email to support@fasttravelgames.com we can help you that way (so we don't display any spoilers here:-)", "danielbloomJun 19, 2019 at 1:15 PM\nGreat Game but needs work\n\nOverall, Apex Construct shows the potential of action adventure games in VR but is not perfect because it doesnt follow through with the storyline and has some frustrating bugs and collision problems. There were multiple times that I felt very immersed in the gameplay, but combat overall gets repetitive and could benefit from some more unique enemies and more reasons to use the shield function. I went through the entire game because I could strafe around enemy shots too easily and never used the shield once throughout the game. An enemy with a laser beam that couldnt be dodged and had to be shielded might be an interesting idea. Just an idea.\n\nThat said, the game is still worth buying for the price. I enjoyed the story and there were moments that I was very happy with the gameplay. Solid 4 stars.\n\nHelpful | 5\nDeveloper ResponseJun 26, 2019 at 7:16 AM\n\nThanks for your thorough review, we really appreciate your thoughts and suggestions - especially about improving the use of the shield:-) FYI we just released the first patch for the game and plan to keep improving it going forward.", "tobisluAug 8, 2019 at 5:24 PM\nWARNING: FAKE GAME\n\nThe final boss is a copy of the only other boss. Everything is low-quality, and I needed to use glitches to bypass inscrutable segments. The narrator is flat-out grating, and the world is empty; a series of copy-pasted rooms and a series of copy-pasted enemy waves.\n\nSpend your money on a real game. Sairento has better stealth and archery. This game has no place on this hyper-curated store.\n\nHelpful | 11\nDeveloper ResponseSep 25, 2019 at 12:16 AM\n\nSorry to hear you did not like the game and we appreciate your detailed feedback, but we strongly believe calling it a \"Fake game\" and saying \"everything is low-quality\" is unjust. Our devs put their hearts in this game, the first VR game they made. We are all for people sharing their impressions, both positive and negative ones, as long as they are fair in their reviews.", "mr.simon.john.greenJul 13, 2019 at 3:58 PM\n\nI read the reviews and was a little worried about the movement. I purchased regardless. After two hours of game play i can tell you this game is great. Its my sixth purchase and by far the best. Poking your head around pillars to shoot arrows at robots on route , then ducking back, is epic. It also has a decent story to keep you interested.\n\nHelpful | 1", "RiddonJun 20, 2019 at 3:21 AM\nGreat Game, Anticlimactic Ending\n\nThis game is great. The controls are tight, the environments are amazing, and the story is great (for the most part). The story is great. I was super interested the whole time playing, and I desperately wanted answers for all of the mysteries. My only problem with it is the ending.\nSPOILERS AHEAD\n\n\nThroughout the whole game, it becomes obvious that Fathr does not have your best interests at heart. When he starts laughing maniacally at the end, I was expecting for the (painfully obvious) plot twist to happen then. But no, it just ended, and nothing happened. I was extremely disappointed. That's it!?! Great story overall, but an ending that left me feeling dissatisfied. Looking forward to their next project.\n\nHelpful | 0", "sushihausJul 30, 2019 at 5:07 PM\nBuggy\n\nWanted to love it since its pretty to look at but not sure Im willing to redo levels. After I progressed, thru the story and locations and then had to go back to a previous location, everything was reset back to original and had to redo it. Strange because the screen that tracked all the terminal info was still correct for the places I already been to. Just cant waste more hours of my time redoing it. Also another time the floor disappeared and I fell into some weird space and was stuck. Had to reset and lost progress. Not sure what to do with this one! Maybe things will get fixed and patched and Ill try again someday.\n\nOkay tried the Cygnia Cup and it was fun. More arcade like but short.\n\nHelpful | 2", "TheoxyloJun 16, 2019 at 11:16 AM\nCool game but bugged\n\nI really like this game, especially the bow and arrow mechanics. The missions are somewhat simplistic but the world is well realized and fun to navigate. However, I have experienced several bugs. For example mission objects are often stuck in the floor where they disappear completely and the mission cannot be completed without restarting. I will update my rating to five stars if the game gets patched.\n\nHelpful | 1\nDeveloper ResponseJun 26, 2019 at 7:17 AM\n\nHi, we just released the first patch for Apex Construct which addresses some of the reported issues. Please have a look! We plan to keep improving it going forward as well.", "qvaLarssonMay 22, 2019 at 12:06 AM\n100% day one purchase, and heres why\n\nI thought I would have to compromise with poor visual fidelity for ease of use in a stand-alone HMD. However, Apex proved me wrong, gameplay is on par with the PC version, and the graphics is beautiful.\n\nIn addition to this, this Quest version includes all the fixes of the previous versions, and the the DLC which is a competitive sharpshooting mode with an online leaderboard.\n\n10/10, day one purchase\n\nHelpful | 23", "KaionfireAug 9, 2019 at 3:49 AM\nBest game I've played on the Quest\n\nAction, mystery, colorful graphics, just what I've been looking for in VR. This title is a must have. Really well done, thank you!\n\nHelpful | 0", "warplingJul 7, 2019 at 8:52 AM\nSpend your money elsewhere\n\nI was exited for this game but it feels hastily finished and poorly tested. While in theory the puzzle heavy shooter in room scale could be great the input methods are bad (A keyboard you have to finger type on? Was this playtested?), the English dialog and copy is thin, the hint system when youre stuck non-existent, the lack of a map in a spliced up world is disorienting, and finally the lack of game saves makes me wish I had spent my money elsewhere. I sincerely hope the team can polish some of this up because it feels like a promising game I would enjoy.\n\nHelpful | 3\nDeveloper ResponseJul 9, 2019 at 11:20 PM\n\nHi! We're sorry to hear you're not enjoying the game but appreciate the review. There is no need to type on the terminals unless you want to. There is a touch bar that lets you access files with a single click. There are also options to turn on a ray pointer in case you don't want to press the touch bar buttons with your fingers. The decision of not saving progress during missions is part of a greater risk/reward design used to incentive the player to upgrade the bow and its arrows and the shield. In most missions you have the option to abort at any time, using the menu in you inventory, to return home and spend RP earned during the mission. We understand and appreciate that not everyone agrees with this design, but this is why things work as they do.", "kfir_the_kingJul 11, 2019 at 11:54 AM\nGood game\n\nBut the game save disappear after i progressed on the game.I only have the option to start over from begining. So frustrating. I lost my will to play it.\n\nThe developer from Apex replied to me amd tryong to help. I hope they will managed.\n\nHelpful | 3\nDeveloper ResponseJul 12, 2019 at 3:59 AM\n\nHi! We're sorry to hear you lost your save. This shouldn't happen unless you uninstall/reinstall the game. If the save disappeared during normal play, can you reach out to info@fasttravelgames.com so we can follow up and try to find a fix for the issue? UPDATE: We just published a hot fix that should stop the issue from happening. Please note that it doesn't restore any lost data. We are looking into opportunities to restore or recreate the lost progress.", "steve13870Jul 2, 2019 at 1:29 AM\nSuperb\n\nFirst things first excellent game moody and atmospheric this is the second time I've purchased this game (psvr)so it must be doing something right .This game draws you in and I love the voiceover work .a great mixture of puzzle solving and combat with a great mode the cygnia cup.i can't wait for the next game by the development team .just a footnote when is the update coming out?...this is one of the best vr games I've played\n\nHelpful | 0", "Despa_and_CitoJul 25, 2019 at 3:20 AM\nA lot better than I expected\n\nI expected Apex Construct to be wave shooter like robo recall unplugged, but it actually has a good story with puzzles and action combined to make a 98% perfect game\n\nHelpful | 2", "Davepr79Jun 3, 2019 at 8:35 AM\n\nStunning game but seriously needs to allow instant save points. Having to restart a mission every time I turn off is a real pain. Any chance this will be implemented? Congratulations on the game all the same.\n\nUpdate - thank you for the response. I understand and appreciate what you are doing. I look forward to any future projects you have in the pipeline.\n\nHelpful | 5\nDeveloper ResponseJun 3, 2019 at 1:33 AM\n\nHi! The decision of not saving progress during missions is part of a greater risk/reward design used to incentive the player to upgrade the bow and its arrows. In most missions you have the option to abort at any time, using the menu in you inventory, to return home and spend RP earned during the mission. We understand and appreciate that not everyone agrees with this design, but this is why things work as they do.", "FredFredBurger27Jun 2, 2019 at 2:08 PM\nIts a great game with issues\n\nThis game was alright I guess... even though this may sound as negative review I still recommend this game to anyone that loves a good story. The way they portray the the story reminds me of fallout (the good ones). If you just want a basic story then the game will hand that out to you, but there will be some holes within the story. However if you look around the environment carefully you can find things that make the story far more complex.\n\nThen there is the gameplay. Using a bow with the quest can prove to be quite difficult since you have to have one hand close to your face. If you dont know already then when the controllers get too close to the headset they can lose tracking. This game handles this issue quite well, to fully draw the bow you do not need to pull the controller all the way to your face. The issue is objects that you have to pick up. I found it incredibly frustrating to pick things up because when you put your hand on the object and grab it, it will glitch out and often pin itself into the floor or table you grabbed it from. The breaking point for me was when I had to carry a clipboard and a power cell I picked them both off the ground and started to walk. When I got about 5 steps away they snapped out of my hand and launched into an area that was not accessible. After some time the power cell returned to the spot I found it but the clipboard with a password never came back. A smaller issue was that for an entire mission they want you to be stealthy and to do so you need to throw things to distract the enemies. However throwing things never works in your favor. To test how terrible throwing things was I grabbed a coffee mug and chucked it as hard as I can. It went only about 15 feet.\n\nEven though the physics is pretty bad I still recommend this game for its great story.\n\nHelpful | 1", "z0ninJun 22, 2019 at 5:50 PM\nGreat first VR experience\n\nPicked this up as my first full VR game. Played through the game on hard and it was definitely difficult AMD entertaining. Very immersive and the bow and arrow combat is pretty satisfying once you get the hang of it. The environments are pretty awesome to explore and the game is well optimized.\n\nHelpful | 1\nDeveloper ResponseJun 26, 2019 at 7:13 AM\n\nWe are so happy you enjoyed it, and as your first full VR game as well! Amazing to hear!", "DrachenherzMay 22, 2019 at 3:02 PM\nA Masterpiece\n\nGlad I refunded another Game and got Apex Construct instead.\n\nBeatiful stylized graphics, great and satisfying bow mechanics and an intriguing world to discover. This game is amazing on the Quest.\n\nHelpful | 11", "9KingsJul 13, 2019 at 4:08 PM\nBest game yet for Quest.\n\nThis is my favorite title so far for the Quest. Immersive gameplay as well as a good mix of action and puzzles. This is a game that will keep you playing for awhile. Loved this one.\n\nHelpful | 1", "enriquemerliMay 24, 2019 at 9:11 PM\n\nThis game won't start. I'll boot up the game, but it will just stay on the loading screen. Anyway to fix?\n\nUPDATE: to the developer who responded, I did try what you suggested and it worked. Had to do it a couple times, but worked nonetheless. Thanks!\n\nHelpful | 9\nDeveloper ResponseMay 25, 2019 at 11:07 AM\n\nHi, this is a known issue with Quest for many titles and for many users. Uninstall and re-install seems to fix the problem, so give that a try! UPDATE: Great to hear! Feel free to update the review score if this changes anything for you:-)", "JohannasonJun 27, 2019 at 5:11 PM\nMostly enjoyable, nagging bug\n\nMechanically solid, with a fascinating story (that I haven't yet finished).\nHowever am having an issue with the joystick turning. I can almost always click the joystick to turn right, but almost never left...\n[Update] The turning issue has been addressed!\n\nHelpful | 1\nDeveloper ResponseJul 1, 2019 at 12:05 AM\n\nHappy to hear the joystick turning feels good for you now!", "mvijfwinkelMay 30, 2019 at 12:14 PM\n\nThe room scale movement is the nice part if this game. If you have a big space it's very cool to walk around in the virtual world, walking up to doors and terminals.\n\nUnfortunately the gameplay and design is very rough:\n- I had to restart a level because an elevator was in the wrong position after a respawn.\n- in the mission \"Into the Dark\" a new gameplay method is needed to progress, something that you've never needed to do before in the game and it's not explained or telegraphed at all (I would have never found out if I didn't watch a walk through of a PSVR version of the game).\n- now I am stuck at a boss that pounds on the floor and always hits you. I have no idea what I should do to not get hit.\n- special arrows take a long time to recharge, and don't recharge if you have one left. Because apparently waiting is fun?\n\nI'd like to continue the game, but I am too frustrated at the moment.\n\nHelpful | 4\nDeveloper ResponseJun 4, 2019 at 11:56 PM\n\nHi, Thank you so much for letting us know about the respawn issue! We will take a look and include a fix in an upcoming patch. Regarding the boss fight, if you need help, please mail info@fasttravelgames.com and we'll help you and avoid posting any spoilers.", "steve.weave.56Jun 6, 2019 at 1:38 PM\n\nNot an outright shooter, more of a puzzle/adventure. The bow shooting is great at first, but gets old after a while. I played it for several hours then got bored, especially when you keep retracing your steps. I feel I definitely got my moneys worth however.\n\nHelpful | 0\nDeveloper ResponseJun 9, 2019 at 11:28 AM\n\nThanks for your honest review! Have you tried the Cygnia Cup Challenge game mode? Might be more up your alley:-)", "Hexagon-SunJun 15, 2019 at 1:57 PM\nShows the potential of Oculus Quest!\n\nI've only just scratched the surface with Apex Construct. Already, it's easy to see how amazing this game is. This is the kind of adventure I want to experience with the Quest. There's so much detail and nuance, that I spent a lot of time just exploring the home base. Picking up objects, opening drawers and doors, flushing the toilet. It's all so immersive. The bow and arrow combat works like a charm. If you're looking for a great single player experience, look no further.\n\nHelpful | 1\nDeveloper ResponseJun 18, 2019 at 5:50 AM\n\nThank you so much for sharing your impressions, we are delighted to hear how much you enjoy the game!", "FhoxhJun 8, 2019 at 6:52 PM\nImmersive, addictive and challenging\n\nThis game is perfectly executed. The gameplay is rich, the story is engaging, the atmospherics are deeply immersiveyou really can completely lose track of time in Apex Construct. The battle system is really well done. Your crossbow, shield and ammunition are all upgradable. The enemies are challenging, but not impossible. You explore and adventure in deeply varied and visually impressive environments, completing various objectives and missions. The soundtrack is well scored. There are occasional glitches, where you can go off the map, but sometimes that can be fun in and of itself ;-)\n\nHelpful | 4\nDeveloper ResponseJun 9, 2019 at 11:24 AM\n\nMany thanks for your review, extremely happy to hear you like the game so much!", "specops037Jul 6, 2019 at 10:09 PM\nGreat but\n\nFantastic game only issue is I lost all my data and I don't know why oh well though\n\nHelpful | 1\nDeveloper ResponseJul 12, 2019 at 4:00 AM\n\nHi! We're sorry to hear you lost your save. This shouldn't happen unless you uninstall/reinstall the game. If the save disappeared during normal play, can you reach out to info@fasttravelgames.com so we can follow up and try to find a fix for the issue? UPDATE: We just published a hot fix that should stop the issue from happening. Please note that it doesn't restore any lost data. We are looking into opportunities to restore or recreate the lost progress.", "PurplemikeyMay 26, 2019 at 4:54 PM\nMy favorite solo game\n\nThis review is a work in progress - still not finished the game.\n\nAll I can say right now is that I'm 8-10 missions in and I love this game more and more.\nThe story is very intriguing and the gameplay is one of the best and most interactive out there. You can play around with many objects around you, open pretty much everything, find trophies and hidden stuff.\n\nIt's a game that you can either rush, play without searching but still listen at the story elements or dive deep in. I played many hours... I could've finish it already I guess... But the story is really nice and makes me want to know more. The world is great and have something mysterious but still look like something that will make you feel it was a place that could've exist.\n\nThe fights are intense and makes you move a lot. You can stay still and use joystick but... You bought a Quest. Use it! Dodge with your head, step left, step right..!\n\nMy go to game when I feel for some solo play. And it makes me want to play solo a lot!\n\nHelpful | 10", "Rocky2234Jun 14, 2019 at 1:31 AM\nA must buy for every quest owner\n\nIve only played a few hours of the game so far but Im very impressed with it! it is very immersive and you can interact with almost everything in the game world, I found myself just exploring the rooms and interacting with the objects within each room just for fun and the best part is due to me having a large play space I can walk around the game world with no restrictions and that adds an extra layer of fun and I feel as if Im really in another world. I would also say that visually this is one of the better looking games on quest, its got a very nice fresh style that sucks you in and adds to its charm. I find the combat fun to and quite challenging admittedly I do need a bit more practice when it comes to aiming but Im sure Ill get there eventually. I dont have a bad word to say about the game performance wise it runs very smooth Ive not even noticed so much as a frame drop so far and it doesnt seem to be plagued by bugs or glitches and the sound quality is good to its certainly been one of my best purchases so far and a bargain for the price you can tell a lot of fine tuning and polish has went into this product and Im looking forward to playing through the rest of it soon.\n\nHelpful | 1", "DJDAWGJun 21, 2019 at 12:12 PM\nAdd more games like this\n\nI really love this game, I just wish that games on the rift like Gorn and wind lands could be compatible for the quest as well, Im sure the oculus company will make more amazing games but by far this is one of the best games on the oculus store. Defiantly worth it.\n\nHelpful | 0\nDeveloper ResponseJun 26, 2019 at 7:14 AM\n\nFantastic to hear, thanks for sharing your thoughts like this!", "HorkthaneMay 25, 2019 at 10:50 PM\nIt's ok I guess\n\nIt's a good enough looking game with an interesting broken world aesthetic. But I found the hit boxes of the enemies frustrating, and the bow and arrow gameplay tedious. It's not uncommon at all to swear you hit an enemy, only to see the arrow appear to pass right through an appendage or coif.\n\nThe story is once again, ok. It doesn't really come to any real or satisfying conclusion or reveal.\n\nIt's also a bit of a let down that you'll mostly revisit the same handful of maps across 12 missions. Altered by your previous missions there, granted. But still, the exploration was my favorite part of this game, and revisiting the same maps so often really put a crimp in it.\n\nIf this weren't a launch game, it's be utterly unremarkable. But since it's here, it's ok I guess.\n\nHelpful | 14", "mattman6886Jun 26, 2019 at 7:39 AM\nGreat Port of a Great Game!\n\nHad a small movement issue that the devs addressed in the latest patch, and now the game is perfect! Very immersive with great visuals, especially for the Quest. Good for those into puzzle, combat (bow and arrow), exploration type games.\n\nHelpful | 1\nDeveloper ResponseJul 1, 2019 at 12:04 AM\n\nHappy to hear our latest patch fixed the issue you were having!", "Azazel08Jun 13, 2019 at 6:26 AM\nOutstanding!\n\nThe visuals in this game are stunning. You feel like you are a part of this incredible world. The bow mechanics are top notch. The devs deserve exceptional awards for their inclusion of every movement type and comfort setting so that all players can find a way to enjoy this game. I wish all devs would allow this many options. The game is phenomal and I am very happy to have purchased it.\n\nHelpful | 1\nDeveloper ResponseJun 18, 2019 at 5:51 AM\n\nWe are so happy to hear this!", "brand019Jun 4, 2019 at 7:56 PM\nFun, but undercooked.\n\nI enjoyed the game quite a bit in my initial playthrough, but it never really came together like I hoped it would. The aesthetics are nice, but combat never really advances past your bow and shield, there isn't a lot of enemy variety, and the ending is anticlimactic. I felt like I missed a cutscene or two, even though I got all the secrets and searched for more. I hope the devs improve with their next project.\n\nHelpful | 8\nDeveloper ResponseJun 9, 2019 at 11:32 AM\n\nThanks for your honest review. This was our first VR game and we cannot wait to show you what we have lined up for the future:-)", "hsarkJul 15, 2019 at 8:25 AM\nIt's kinda fun\n\nIt's missing something\n\nHelpful | 0", "sinkkingJun 14, 2019 at 10:13 AM\nFun archery game, storyline is a joke\n\nThis one is all about the gameplay and the graphics. Playing in a wide open space with the gaurdian system turned off (search google) feels absolutely fantastic. The world is serene and very appealing.\n\nTo give it less than 5/5 is misleading to other customers.\n\nAlso the Cygnia Cup target practice sidegame is good for parties.\n\nHelpful | 0", "CliipJun 6, 2019 at 12:50 PM\nApex game on the Quest\n\nApex Construct is a great mix of bow combat, light puzzles and exploration. The game is visually impressive for the Quest. The experience has a compelling narrative of two competing artificial intelligences. The game uses a hub world to send you off on missions. You upgrade your armor, bow, and arrows using the in-game currency of radiance. The game cleverly has you repeating missions with new powers and access cards which opens new areas to explore.\n\nYou can interact with a ton of in-game objects. There are many audio and computer logs that reveal the lore/story. There are also hidden areas and trophies in every level that you can place around your base. For the price, this game has plenty of content, beating the game took 5 hours and repeating levels to find all the computer logs and secrets can easily take another 2 hours.\n\nIf I were to mention two negative, it would be the performance. It is more than playable but there can be frame drops. I can also see my hands dragging behind my controllers at times. However, this never impacted the combat. If I died in-game, it was my doing. Finally, a word about the story - no spoilers. It has a lot going for it. It seems to build up towards something and falls short. When the final mission is completed, you are thrown back in the hub world. The game should be clear that youve concluded the story. If I had a magic wand, Id post First ending on screen then credits before throwing the player back in the hub world. Then the user would be incentivized further to acquire all the collectibles to find a better more satisfying ending. After achieving this, completing the final mission yields a premium Second ending. Finally, this would unlock one last mission as a reward for exploring the game in-depth. This final mission would provide the true ending which has a proper resolution to the story.\n\nHelpful | 2\nDeveloper ResponseJun 9, 2019 at 11:29 AM\n\nThanks for your review and for your great input!", "Peaceful_MindMay 27, 2019 at 12:53 PM\nGreat game but\n\nInitial impression was a wonderful game with its textures and a lot of missions. However, it drains the battery very quickly reaching to zero charges in 45 minutes! and there is no autosave of progress which means I must charge and reopen again in trying to finish the mission before it ran off charge. Also, I think it is too much for the oculus quest processor to handle, a lot of glitches and turning dim with battery under 50%. If oculus manage to enable charging whilst playing it could solve the problem, also to add progress autosave\n\nHelpful | 20\nDeveloper ResponseMay 27, 2019 at 3:03 PM\n\nHi! We're really sorry to hear that you are having battery issues preventing you from enjoying the game! It is possible to play while charging but we are definitely expecting players to be able to play for longer sessions than 45 minutes. As this is the first time we hear about this particular issue, it would be a great help to us if you could send us an email on info@fasttravelgames.com and describe what levels you experience battery drain on and some more details around the glitches you encounter.", "nickguillolloMay 25, 2019 at 6:58 AM\nBeautiful but problem\n\nI started the game it s great but then I realised that I see white stripes in a kind of black room behind the game when I go forward.. why and how to change that? because I think I didnt have that in the first place plz help!\n\nHelpful | 4\nDeveloper ResponseMay 25, 2019 at 10:27 AM\n\nHi! This is because the Vignette is turned on, a comfort default setting. You can turn it off in the Settings menu:-) Please give that a go!", "Wraith2021Jun 6, 2019 at 2:24 PM\nOne Of The Reasons To Get A Quest\n\nI've not played Apex Construct, I don't own a PC and PSVR games only really work well if you don't need to move about a lot, so avoided getting it on that because I knew I was getting a Quest. I got my Quest for launch through the post, and this was the first game i bought.\n\nI have seen the PC graphics and comparisons, but man this game is just polished and awesome. I can't recommend it enough. I love the story, the voice acting, the environments and the backstory that unfolds as you play. It has everything a AAA title requires.\n\nIf you are in the fence, I insist you check it out.\n\nHelpful | 0\nDeveloper ResponseJun 9, 2019 at 11:27 AM\n\nWow, thanks for those kind words and great to hear you like it so much! This kind of appreciation is a real morale booster for our developers:-)", "TigtoneMay 21, 2019 at 11:03 PM\nMore options needed\n\nI would like my choice of bow-hand to be independent of how I move. I want to move in the \"standard\" way, but I am used to holding the bow in my right hand.\n\nHelpful | 24\nDeveloper ResponseJun 26, 2019 at 7:38 AM\n\nHi, we just released a patch including an update for the bow swapping/locomotion feature you mentioned so please give it a go now:-)", "philg7onr123Jun 4, 2019 at 10:24 PM\nVery impressed\n\nOne of the first titles I bought for my Quest, I was not disappointed.\nGraphics are amazing, the game runs as smooth as silk, absolutely no problems with the quest playing this game. Really enjoy the shooting and target experience as a side game.\nWell worth the money.\n\nHelpful | 1\nDeveloper ResponseJun 9, 2019 at 11:31 AM\n\nThanks for sharing your experience with our game in a review!", "CatsAndITJun 9, 2019 at 12:25 PM\nIncredibly unforgiving\n\nPurchased and have been playing off and on for a couple days. The story is engrossing, but the combat... I hope you enjoy dying. Combat is very unforgiving, and you can only survive a few hits before dying. When you die, you respawn near the same point, but with all of your banked RP (currency to upgrade bow/shield), representing all the RP you earned in the level so far gets wiped out. Additionally, if you happen to drop any critical items needed for progression (like a battery/power pack) into an inaccessible area, you get to start the level over as there is no way to get it back.\n\nSo if you enjoy exploration, punishing combat, and somewhat simple puzzles, definitely worth a purchase.\n\nHelpful | 5\nDeveloper ResponseJun 9, 2019 at 1:13 PM\n\nHi! We're sorry you don't enjoy the game, but we appreciate your review! Mission critical items should respawn at their initial location so you shouldn't have to restart a mission even though sometimes it can be a bit far away. The decision of not saving progress during missions and the sometimes rapid increase in difficulty is part of a greater risk/reward design used to incentive the player to upgrade the bow and its arrows and the shield. In most missions you have the option to abort at any time, using the menu in you inventory, to return home and spend RP earned during the mission. We understand and appreciate that not everyone agrees with this design, but this is why things work as they do.", "theGinger78Jun 4, 2019 at 10:22 AM\nNoice.\n\nHad a problem with loading, bit got a response from the devs, (oculus didn't give me an answer to any of my problems, so awesom job on the devs part!) Fixed it.\n\nThe game, is great. Awesome bow physics, and good progression pacing. Never was bored.\n\nHelpful | 2\nDeveloper ResponseJun 4, 2019 at 11:42 PM\n\nHi, we're sorry to hear you have problems launching the game, however this is a known issue with Quest for many titles and for many users. Uninstall and re-install seems to fix the problem, so give that a try! UPDATE: Fantastic news! Really happy you are enjoying the game too!", "Alex_VR_Jun 3, 2019 at 9:50 AM\nReally really good\n\nA great bang for your buck if you want a game you can sink your teeth into. I posted a video review on YouTube if you're interested.\n\nYouTube.com/AlexVR\n\nHelpful | 0\nDeveloper ResponseJun 9, 2019 at 11:33 AM\n\nThanks for your review and for playing a part in helping the VR industry grow!", "spudthepotatoMay 27, 2019 at 10:59 PM\nCool at first - boring after a while\n\nI was so pumped for this game when I first saw gameplay videos on the quest before it even came out. The first 15 minutes of the game are fun and the world is visually stunning (albeit it does suffer very noticeable fixed foveated rendering but Im willing to forgive that on the quest). I thought I was going to love this game because of how cool the world looks. Turns out - while the art style and visuals are amazing, the gameplay itself leaves a lot to be desired. You spend most of the game teleporting around a map entering passcodes into computer terminals and then shooting little robot things with a bow and arrow. The combat feels neither immersive nor challenging. I really wanted to like this game but it is unfortunately rather boring. Im also frustrated that there is no way to save your progress in a mission. I spent about half an hour on a mission one day and my quest was running low on battery so I quit out of the game. When I went back in, I realized all of my progress was gone.\n\nI cant say Id recommend this one unfortunately. Ill probably give it another shot at some point but for now, A solid two star game.\n\nHelpful | 8\nDeveloper ResponseMay 28, 2019 at 6:03 AM\n\nWe're sorry to hear you don't enjoy the game but we really appreciate your feedback! The decision of not saving progress during missions is part of a greater risk/reward design used to incentivise the player to upgrade the bow and its arrows. In most missions you have the option to abort at any time, using the menu in you inventory, to return home and spend RP earned during the mission. We understand and appreciate that not everyone agrees with this design, but this is why things work as they do.", "brAInjaxJun 4, 2019 at 8:34 AM\nNo cross-save\n\nIm really disappointed that there is no cross-save. Ive been playing on my rift but cant pick up where I left off on my quest. Which basically means I have no reason to play this game on my quest. What a missed opportunity.\n\nHelpful | 2\nDeveloper ResponseJun 4, 2019 at 11:50 PM\n\nHi, We agree it would be awesome to offer cross-save! But considering it's a rather big task including backends and updating all the platforms with cross-save support (and require Internet connection) we haven't done it. Without promising too much, we are however looking at the possibility to migrate save data between platforms and devices.", "savage765May 27, 2019 at 10:12 PM\nBad Performance\n\nThe Game Looks Good and is fun, but there are far too many frame drops. Hope an Update will fix that.\n\nUpdate: Gave 2 extra stars since the dev responded super fast!\n\nHelpful | 3\nDeveloper ResponseMay 27, 2019 at 11:52 AM\n\nHi, this is the first time we hear about frame drops in our game, and our stats does not show any bad frame rate. Could we please ask that you send an email to info@fasttravelgames.com with details on how/where these frame drops are occurring for you, preferably with video if you got the time, so we can have a look? We are eager to fix any issues we might find!", "therealarbeeMay 24, 2019 at 6:49 PM\nAwesome Full Game\n\nThis game has been an absolute blast so far! The feel of the game reminds me a lot of The Gallery on Vive, which was probably my favorite vr games to date. Less puzzles, more action and levels feel like actual full levels. This game is worth every penny!\n\nHelpful | 4", "wanderer1972Jun 10, 2019 at 7:51 AM\nHmmm\n\nLiked the look of the game so decided to buy it, made me feel unsteady so I tried getting my money back and I was refused, thanks for that. But I understand it isn't anything to do with the developers of the game it was Oculus customer support that let me down.\n\nHelpful | 3\nDeveloper ResponseJun 10, 2019 at 5:38 AM\n\nHi! Oculus are handling all the refund requests themselves, so we suggest you contact their customer support about this if you have not done this already. Hope that works out, sorry that you did not like the game.", "jason.pb.3Jul 11, 2019 at 11:32 PM\n\nOver the last 3 weeks I can no longer pick up objects with right hand ??\n\nHelpful | 0\nDeveloper ResponseJul 12, 2019 at 3:51 AM\n\nHi, This is the first time we hear about this. As far as we know it should work properly. Could you reach out to support@fasttravelgames.com so we can follow up more closely on your issue?", "CoachVRJun 14, 2019 at 12:39 PM\nImmersive, solid story\n\nJust started playing this one. So far immersive experience, easy controls, and an interesting story. Looking forward to playing some more.\n\nHelpful | 1", "tnsaidrJun 13, 2019 at 1:02 AM\nFun exploration but facing issues\n\nI have this issue where the game will get stuck at certain loading screens . Tried to delete and reinstall to no avail. However the game is pretty good with fun exploration and mechanics .\n\nHelpful | 1\nDeveloper ResponseJun 26, 2019 at 7:31 AM\n\nHi, sorry to hear about your issues - these does not seem to be very common. We just updated the game with a new patch however, care to give it a try and see if the issue has been fixed for you?", "PalomedesJun 11, 2019 at 1:44 PM\nGreat game\n\nI am seriously addicted to this game, from the moment I entered this world I was hooked. The developers have done a great job porting this game across.\n\nHelpful | 1\nDeveloper ResponseJun 12, 2019 at 12:37 PM\n\nFantastic to hear, this makes us so happy!", "MrRadonMay 26, 2019 at 7:14 AM\nSuch a great game\n\nIt took me roughly 12 hours to complete this gem. Fantastic game!\n\nHelpful | 4", "ReBenGeJul 7, 2019 at 4:27 AM\nBad collision system\n\nCollisions and physics do not work well. Free locomotion clogs a lot and can cause dizziness.\n\nHelpful | 3\nDeveloper ResponseJul 9, 2019 at 11:22 PM\n\nHi! We're sorry you're having issues with physics and locomotion. We would really like to learn what exactly you are having issues with so if you could summarize and send your thoughts to info@fasttravelgames.com that would be much appreciated!", "posthuman87Jun 11, 2019 at 8:51 PM\nFun game\n\nTons of fun and great world to explore with amazing environmental storytelling. Thank you for a wonderful game!\n\nHelpful | 1\nDeveloper ResponseJun 12, 2019 at 12:37 PM\n\nGreat to hear you are enjoying it!!!", "saberbatorJun 8, 2019 at 10:32 PM\nCool game\n\nThis game is fun. I found it to be slow on action, and wonky control when you need it. The story is cool and keeps you interested replay value is low.\n\nHelpful | 0\nDeveloper ResponseJun 9, 2019 at 11:23 AM\n\nThanks for posting a review! Have you tried all the different settings you get to choose from in the Settings menu? You can make a lot of tweaks to things like the turning speed, the free loco etc.", "jeffrey.jay.378May 24, 2019 at 11:59 AM\nA must buy\n\nWonderful game. The visuals were stunning, the storyline was great, and no problems with the tracking.\n\nHelpful | 6", "darwins.lastMay 28, 2019 at 6:27 PM\nFun Game\n\nBeautifully rendered, lots of action and adventure, and complete game. Very well done!\n\nHelpful | 2", "jblouirMay 26, 2019 at 11:31 AM\nVery good, well made.\n\nThe story and settings and mechanics are great, I like how the home keeps it's state between levels(so cool).\n\nHelpful | 1", "SoapySonMay 22, 2019 at 2:57 PM\nCreepy\n\nDigging it, cool graphics, fun combat, creepy story\n\nHelpful | 6", "ShadowbudsJun 8, 2019 at 3:29 PM\nSlow paced\n\nTitle sumd it up, good idea just not for me.\n\nHelpful | 0\nDeveloper ResponseJun 9, 2019 at 11:25 AM\n\nThanks for your review, not everyone has the same taste! Hopefully our next Quest title is more interesting for you:-)", "Charlie_LainezMay 27, 2019 at 4:33 AM\nEpic\n\nJust mind blowing\n\nHelpful | 4"]