{"App Title": "Apollo 11", "App description": "Apollo 11 is the story of the greatest journey ever taken by humankind. \n\nNow you get to experience this historic event through the eyes of those who lived through it. Using a mix of original archive audio and video together with accurate recreations of the spacecraft and locations, all set to inspirational music, get set for an experience that will not only educate you but will also leave a lasting impression and deep respect for the men and women who worked on the Apollo program during NASAs golden era. \n\nApollo 11 is a complete remake of the very popular Apollo 11 VR which was a launch title on the Oculus Rift. \n\nThis new version has all new assets, new textures, new animation, new lighting and revamped audio.", "Purchase section": "$9.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Documentary & History, Educational, Space/Universe", "Languages": "English, English (US)", "Version + Release Notes": "2.3", "Developer": "Immersive VR Education PLC", "Publisher": "Immersive VR Education PLC", "Website": "http://www.immersivevreducation.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Home\nAbout Us\nProducts\nNews\nInvestors\nContact Us\nAnnual Report 2019 now available  click here to download\nLearn through Experience\nImmersive VR Education is a virtual/augmented reality company dedicated to transforming how training and educational content is delivered and consumed globally.\nFIND OUT MORE\nOur Partners\nENGAGE is an advanced virtual reality education and training platform that makes it easy to collaborate and learn in VR. It enables educational institutes and businesses to host classes, conferences, private lessons and presentations with people from across the world in a safe & multi-user environment.\nFIND OUT MORE\nImmersive VR Education has gained a reputation for delivering outstanding virtual experiences over its short history such as Apollo 11 VR and Titanic VR. Since 2014, we have collaborated with well known organisations, including the BBC, creating memorable experiences. We believe that people learn through experiences and this is done by creating immersive, memorable moments.\nFIND OUT MORE\nOur Awards\n123456\nWhat is Virtual Reality?\n\nVirtual Reality is a simulated experience that places the user in virtual environment that they can interact with. It allows users to visit imaginary worlds or places that may be impossible to visit in real life. There are two key characteristics of virtual reality that make it different: the ability to experience and interact.\n\n\n\n\nThis gives the user a sense of complete immersion within the simulation as it involves the senses. It makes it more believable and engaging for the user. This considered, VR has been proven to a powerful resource that can aid conventional learning methods.\n\nVirtual Reality in Education & Training\n\nThe benefits of VR in education and training are being discovered. Humans learn by interacting. They derive and retain information from their environment. Virtual reality-based learning provides an immersive teaching method that allows users to interact with environments around them. Memory retention increases when learning through interactivity. Abstract concepts or situations that no longer exist can be experienced through VR, opening up many possibilities that did not previously exist.\n\nTestimonials\nENGAGE is going to move us so far beyond our brick and mortar here at Shenandoah. Were going to have the ability to help companies and entities nationally. Rapid training and retraining of individuals is becoming essential. Its important to be able to efficiently and cost-effectively train employees in the newest and best practices.\nExecutive Director and Associate Professor of Theatre J.J. Ruscella, M.F.A.\nSHENANDOAH CENTER FOR IMMERSIVE LEARNING (SCIL)\nThis is a remarkable #VR conferencing platform - Just had my first session in #Engage. Completely blown away! Truly the future of connectivity.\nR. Grossman, MD, FACS, 1st Google Glass Surgeon\nRafael Grossman - Surgeon, Educator, Healthcare Futurist\nIn June 2017 I made history by becoming the first teacher to ever deliver a professional development session for educators from inside virtual reality. The event was a huge success and I am now hosting sessions on a regular basis. So far educators from over 25 countries have attended the sessions and the numbers are growing fast. All sessions are free to attend and take place inside the ENGAGE platform from Immersive VR Education.\nSteve Bambury\nFOUNDER OF #CPDINVR AND HEAD OF DIGITAL LEARNING AND INNOVATION AT JESS DUBAI\nENGAGE is going to move us so far beyond our brick and mortar here at Shenandoah. Were going to have the ability to help companies and entities nationally. Rapid training and retraining of individuals is becoming essential. Its important to be able to efficiently and cost-effectively train employees in the newest and best practices.\nExecutive Director and Associate Professor of Theatre J.J. Ruscella, M.F.A.\nSHENANDOAH CENTER FOR IMMERSIVE LEARNING (SCIL)\nThis is a remarkable #VR conferencing platform - Just had my first session in #Engage. Completely blown away! Truly the future of connectivity.\nR. Grossman, MD, FACS, 1st Google Glass Surgeon\nRafael Grossman - Surgeon, Educator, Healthcare Futurist\nIn June 2017 I made history by becoming the first teacher to ever deliver a professional development session for educators from inside virtual reality. The event was a huge success and I am now hosting sessions on a regular basis. So far educators from over 25 countries have attended the sessions and the numbers are growing fast. All sessions are free to attend and take place inside the ENGAGE platform from Immersive VR Education.\nSteve Bambury\nFOUNDER OF #CPDINVR AND HEAD OF DIGITAL LEARNING AND INNOVATION AT JESS DUBAI\nENGAGE is going to move us so far beyond our brick and mortar here at Shenandoah. Were going to have the ability to help companies and entities nationally. Rapid training and retraining of individuals is becoming essential. Its important to be able to efficiently and cost-effectively train employees in the newest and best practices.\nExecutive Director and Associate Professor of Theatre J.J. Ruscella, M.F.A.\nSHENANDOAH CENTER FOR IMMERSIVE LEARNING (SCIL)\nEU Contact\nUnit 9 - Cleaboy Business Park\nCork Road\nWaterford City\nIreland\n+353 51-585-837\ninfo@immersivevreducation.com\nUK Contact\nFoundry Building\n2 Smiths Square\n77 Fulham Palace Road\nLondon W6 8AF\nUK\nCurrent Share Price\n\n 2020 Virtual Reality Education & Corporate Training. All Rights Reserved. VR Education Holdings PLC.\nPrivacy & Security\nThis website uses cookies in accordance with our Privacy Policy. By continuing, you agree to their use.\nI'm happy to continue", "Space Required": "1.78 GB"}



["5 stars\n43%\n4 stars\n21%\n3 stars\n10%\n2 stars\n12%\n1 star\n15%", "unonymusJun 24 at 3:10 PM\nIt does what it says beautifully.\n\nI really enjoyed this. I am a bit of a specie but and albeit the simulations aren't super accurate it still takes you for the ride and gers you involved in a way thtat you could experience aby other way... There are many things about this game that alone would make it worth the price of admission. It would be nice to be able to space walk more like in real life rather than the telepoering to points. And also to be on the capsule during takeoff off the surface of the moon. If I could give it 4 and a half stars I would for those reasons. I'll still give it five stars though. Great app!! Again.... Totally worth it!\n\nHelpful | 26", "lumakip25 days ago\nDisappointing\n\nIt has some wow that's cool moments but they are few and far between...the textures in this game are abysmal and take you completely out of the experience...and it's really not that interesting..sorry it could've been way better..\n\nHelpful | 2", "Sydney_RobsterJul 27 at 4:13 AM\nWorth it\n\nThis app breaks down the first moon landing into nice sized chapters recreating the take-off through to re-entry.\n\nMy favourits were landing the module, the iconic \"first step for mankind\" speech viewed from moon level outside the module, and being able to walk (teleport) around the moon surface.\n\nIt's an educational app with great production quality. The content can be a little dry so I think it's best suited for those really interested in this event, rather than somebody looking for casual entertainment.\n\nHelpful | 0", "PaulSArchibaldJun 22 at 1:13 PM\nNice App.\n\nI enjoyed this app, two modes cinematic and interactive.\n\nHelpful | 5", "MrDisneyland22 days ago\nIncredible\n\nA journey into history and space. I absolutely loved every second. So well done. I hope they make more like this! Wow. Goosebumps.\n\nHelpful | 1", "JoeWilly1Jun 5 at 1:11 PM\nIts just ok\n\nNo interaction at all, its just like watching a movie. I do not think it is worth it.\n\nHelpful | 13", "Bender_2112Apr 5 at 1:36 AM\nIf you liked the film First Man...\n\n...this is the game for you.\n\nThe audio is from recordings of the actual Apollo 11 crew which is cool. You feel like youre there in the capsule with Buzz and Neil.\n\nNot too much interactive play.\n\nThe music and sound fx are outstanding and epic.\n\nThe graphics are decent but seem dated by more recent apps.\n\nI only recommend this for people who can appreciate the Apollo 11 launch and moon landing. Luckily for me, I do. I was fortunate to have been to Kennedy Space Center in Florida.\n\nNot much replay ability unless you want to show friends. I knew that going in but it was only $8 so it worth it for me.\n\nHelpful | 13", "truslow3Jun 17 at 9:05 AM\nBest game\n\nI have nothing to say\n\nHelpful | 5", "sniper69714May 6 at 2:39 PM\nOk Visuals\n\nI wouldn't recommend it, you do learn a few things about the mission but the lander interaction does not work and it does need a lot of improvement\n\nHelpful | 7", "CharmobunnyJan 16 at 2:14 PM\nReally neat simulation!\n\nI knew that this is one of the first things I wanted to try on my new Quest, so I tried it directly after the tutorial! It is really neat and the level of detail is pretty cool as well! I set up a very small zone and played it mostly seated but there are a couple of opportunities to get up and walk around for a better view. I liked the chapter interface too. You could just do your favorite parts over again or let friends experience smaller clips. Pretty great overall!\n\nHelpful | 51", "G_NUTSFeb 10 at 12:12 PM\nAmazing!!! Good Graphics\n\nThis is a long but thorough review, make sure you read to the end. I would have given it 4 1/2 due to some imperfections, but since you cant give half stars, I will give 5 starts in order to boost its railings, because I dont feel like it deserves the 3.6 rating it is getting.\n\nGreat VR experience. Good graphics with a almost photo realistic ending. Keep reading to the end for more on that. Perfect for a show piece to friends and family. Not complicated to use, people dont need to learn controls, you can just give them the headset and enjoy.\n\nThere are 2 options of playing the game. One is a cinematic mode and the other is the interactive mode. Cinematic mode has no controls, so you just put on the headset and enjoy the experience. The interactive mode allows you to use controls and interact. You take control during docking, landing and moonwalk section.\n\nThe experience itself if very immersive. Its fun and really realistic. Makes you actually feel like you are part of the action. From the start you are sucked in by the Kennedy speech, when sitting in a room watching a projection video. The room is nice and very 3D and realistic. Then you get really exited at the part where you in elevator lift going up the shuttle with the astronauts omg! Then again you get exited when you get into the spaceship. The cockpit is so realistic. Blast off to space. At this point the game gets a little slow. After docking and undocking and shots of the earth etc.. it starts to feel a little slow and you think to yourself  oh well I seen it all, no more surprises, Im a little board! But omg just be patient. You will get a big surprise once you get onto the moon. So basically its starts of really good, then gets slow in the middle just for a bit, and gets crazy again in the end.\n\nNow for the GRAPHICS. This game has good graphics. They are clean, sharp and clear. A lot of quest games due to limitations suffer from blurry and jagged graphics, especially on the sides of the screen and your vision. But not this game. Its clear, clean and crisp almost all the way around. Textures are overall ok. But the best part of the graphics is the clearness and sharpness and crispness and 3D. But dont think the textures are bad, they are good, but maybe just not the best You have seen, depending on how many games for quest you have played. One exception to all of this is the surprise ending, keep reading. The models are also good and the character models of the astronauts are really good. Standing next to them is a treat. On a scale of <awful/very bad/bad/decent/good/very good/exceptional>, the graphics are good to sometimes very good, basically on a scale of 1 to 7 this would be a 5 maybe sometimes a 6 in some scenes. But overall a 5 is more of a realistic rating. You can tell that there was compromises to textures, but this was done to give a clean, clear, sharp look with good astronaut character models and good light rays coming from the sun. This score is based on overall quest game graphics rating, comparing released quest games not PC. A lot of detail was given to the cockpits, reading all the switches and the altitudes and stuff actually being live and showing numbers adapting and changing as you descend and maneuver. Overall the graphics in this game are good to sometimes very good but not exceptional, but with one exception the end of the game. Now once you approach the moon and start descending, the graphics of the lunar surface are ok, the closer you get you start seeing it get less good but please wait! Remember the surprise I told you about when you land on the moon? Once you land, the scene cuts and then loads a new scene and you actually get out of the ship, Well honestly, new moon textures are loaded and the moon textures amazingly improve to the point of OMG! Once you get off and set foot on the moon, you will be blown away. Its so realistic that you will say OMG. The textures of the moon are so sharp and realistic, almost photo realistic. Its weird, I wont say the textures are high detailed but more of high resolution or just very sharp. That whole scene almost looks photo realistic. The lighting and sharp textures and craters on the moon are probably one of if not the best visuals I have seen on quest. Its so real. I felt like I was really on the moon. Take your time and look around and walk. You will be amazed.\n\nHelpful | 37", "1IJDApr 12 at 12:52 PM\nVery boring.\n\nI was very disappointed by this presentation. Im trying to figure out how to return this and get my money back. Im new to VR and still learning.\n\nHelpful | 7", "Juan-117Mar 20 at 12:32 AM\nA Must Have!!!\n\nI love everything about Apollo 11 and this was the most immersive experience ever! It was like if I was there! Such a beautiful experience that I recommend to everyone! If you are a space enthusiast then this is the app to own!\n\nHelpful | 4", "hoefnixJul 21 at 3:18 PM\nRather dissapointing\n\nGraphics far from impressive. The view from the cockpit even if it gives you an immersive feel they surely did cut some huge corners. Outside the stars are blurry, surface of the moon is a stretched out low Rez surface picture.\n\nThe play, interactive mode ...non-existent. The controls completely dead, even a pauze is not possible.\n\nIt is fun to look at, a bit immersive even a few moments despite the graphics but it is seriously lacking quality. It is good I got it with a discount otherwise I would feel ripped off. Given the quality it should be free.\n\nHelpful | 0", "MegawattksJan 23 at 7:34 PM\nA really big upgrade from Oculus Go\n\nI've had Apollo 11 for the Go, and really enjoyed it. But with the Quest, it definitely takes it to a new level. Tonight I donned the Quest headset and used the Apollo 11 experience to land on the moon. I was in our basement, wearing the headset and walking around inside the LEM during landing. The LEM isn't very big, but being able to walk foward to the window, or to poke my head closer to the instrument panels was awesome. Looking out the window during altitude callouts, moving and seeing different views - exactly as it would be in a real experience (lower res of course - so be realistic in your expectations). Really amazing way to understand the LEM piloting experience. Well worth the price to upgrade from the version I was running on my Go !\n\nHelpful | 17", "hantlaJul 23 at 9:05 AM\nWonderful film!\n\nKnow that this is not a game, but it is an incredibly well done film to put you in the Apollo 11 mission to feel the adventure of mankinds first mission to the moon.\n\nHelpful | 0", "incongruent23 days ago\nToo simple for the price\n\nIts a basic experience. Well done, but an equivalent of a 360 youtube video. It should be like free or $2 per single play or something\n\nHelpful | 0", "tom.marchione.5Mar 27 at 11:11 AM\nVery educational!\n\nThis is a must view fir students or anyone with an interest the history of NASA. Very cool. Gives such amazing perspective.\n\nHelpful | 3", "Rgraff406Feb 5 at 7:40 AM\nApollo Mission\n\nIn 1969 the U.S finally launched the Apollo mission that put the first astronaut on the moon.\nThis app is amazing showing the JFK speech that ignited the desire to get to the moon and covers the launch and journey with actual radio transmissions to and from the capsule as they are happening visually.\nRide with the astronauts on the rocket inside the cockpit, look out the windows as the rocket enters space . See the earth, moon stars and sun that they saw them on their history making trip. Watch the separation of the Lem from the rocket and the journey to the moons surface. Stand on the moon to watch touchdown, look at earth from the moon , stand near craters and watch our first walk on the surface.\nWhat is really cool about this app is not only is it historically correct but its something you can just sit and watch so you can take in all the experience.\nIf you were around in 1969 its a nostalgic look back at history. If you werent then you need to watch this to get an appreciation of the danger, courage and wonder of our first trip to the moon.\nNice going developers.!! Its something we should never forget and its told beautifully.\n\nHelpful | 6", "michaelgh57Jan 28 at 9:54 PM\nBrings me back\n\nI lived this when I was a kid, so this brought it all back and more. The details showed me things I never knew or didn't pay attention to when I was 10. Too bad it's animated, but the old films just aren't of high enough quality to us in VR...\n\nHelpful | 2", "ututo01Jul 22 at 1:29 PM\nVery realistic\n\nGood application to know about this history moment.\n\nHelpful | 0", "belambaFeb 6 at 10:45 AM\nLove this\n\nWas given a go at this with a client who was beta testing the Vive. It blew me away. Was my first purchase on Oculus and all visitors are made to go too the moon and back!\nIts incredible and you really need to try it.\nCant praise it enough. Thanks devs!\n\nHelpful | 2", "billy.rockstar56Jan 20 at 2:22 PM\nApollo11\n\nLove this experience would like to see better grafix when landing the closer you get to the moon the better it should look also would like to see my hands and be able to flick switches and push buttons but still an awesome adventure to go on , great orbiting moon visuals feels like your there great work!\n\nHelpful | 3", "philg7onr123Jan 18 at 10:55 AM\nGood points\n\nFirst watched this on my GO so was pleased to see it migrate to the Quest, most of this experience is excellent with some improvements from the GO.\nSadly the scenery on approach when landing on the moon is flawed, spoiling the experience. There is a large dark patch of moon surface that looks out of place. This spoils an otherwise excellent app, well worth the money.\nUpdated to five stars, the lunar lander descent view much improved, an already excellent experience even better if you install the update !\nMany thanks for fixing the lunar surface, much better.\n\nHelpful | 3", "SkynyrdFPVFeb 3 at 2:56 PM\nAmazing\n\nI first experienced this a few years ago on the HTC Vive and was blown away, nothing has changed, this is a great app very well done, nice interactive sections in it too, great demo to show friends. For the money is a great one to have in your Library.\n\nHelpful | 2", "simhare6Dec 11 at 2:48 PM\nAwesome historic VR experience\n\nI purchased this game for my dad to experience VR, he kept me awake in 1969 to watch man take his first steps on the moon. 50 years later both me and my dad could experience the entire event and it did not disappoint. Wow I was blown away, the whole experience was beautifully designed and supported with the actual communication between the Apollo 11 team and NASA. If this piece of history means anything to you, I cannot recommend this simulation enough. I hope the creators produce similar historic simulations in the future. Well done to all involved and thank you.\n\nHelpful | 18", "shaun.walmsley1Jan 25 at 11:49 AM\nAwsomne!\n\nA great educational tool showing the 1st moon landing space journey on apollo 11 in vr .this app is just awsomne, 2 moments that stand out, when he says the eagle has landed and when the astronaught says one small step for man, one giant leap for mankind the orbit arond the earth and the moon and the moon landing are just breathtaking!\nThe beauty and the scale of the earth reminds me that we must take care of our planet as well, just saying5 stars, *****love it \nQuite possibly the best vr app i have bought, bought it on christmas eve , a lovely christmas present \nThank you to all the developers of the app \n\nHelpful | 2", "steveisuser12Feb 9 at 5:20 AM\nApollo 11 quest\n\nExcellent!\n3D and VR are very good. The ability to warp around on the surface of the moon (if you land safely) is an added plus. Highly recommended.\n\nHelpful | 2", "NarrabeenRickMar 2 at 9:15 PM\nFantastic fun\n\nAbsolutely amazing! Loved it. I really like the way you can watch or take the controls.\n\nHelpful | 1", "Lukasz_TMar 1 at 3:39 PM\nIt feels like you where actually there\n\nGraphics are amazing, and it feels like you where there\n\nHelpful | 1", "Snap_CountOct 18 at 9:06 PM\nLoved it!\n\nOne of my first Oculus purchases, just loved it. Hopefully in an update, that more HD texture can be used. It would be also more immersive if when in the LEM and command module that the dials relate to what the user is experiencing as well as the hand movements of the astronauts pressing those buttons. Just to make it more immersive \n\nHelpful | 11", "CommanderDawg95Dec 25 at 7:48 PM\nNice\n\nIts always been my dream to go to the moon, and I finally get to! I really enjoyed this game, and Im so glad I got to play it(although, Id like to have more interactive parts to tinker with).\n\nHelpful | 1", "MacPCWilliamsJan 31 at 4:13 PM\nFantastic\n\nI loved the whole thing. Well worth the $$$$ for the experience. Beautiful.\n\nHelpful | 2", "SoDamGuDDec 12 at 3:09 PM\n\nI am 68 years old and lived through the mission. This is the closest I will ever get to actually going to the moon.\n\nI am not a shooter up game but I am so impressed with this as a history/learning tool. I can not believe the potential here.\n\nHelpful | 4", "nathan.mccreary.0739Jan 19 at 4:43 PM\nWonderful experience\n\nI thoroughly enjoyed my trip on Apollo 11! Cant wait to share the experience with my children and family members.\n\nHelpful | 2", "ummwhatsureOct 4 at 11:23 AM\nThis version is not interactive.\n\nI should have read the reviews for this version specifically. This one not being interactive was a huge disappointment. Some aspects are kinda cool but just sitting there watching stuff happen is definitely not what I paid for. If an update changes this I will gladly change my rating but as of now you do not need to own this one.\n\nHelpful | 19", "Heapster1200Jan 17 at 2:12 PM\nI want to titanic game\n\nI want to titanic game\n\n\n\nHelpful | 4", "MichaelSanFranciscoNov 3 at 10:26 AM\nA Fantastic Sim, Because I Like Sims\n\nIf you like historical reenactments, history, or simulations, you will love this one. I was literally a student of history, so this \"historical simulation\" is fantastic. Note: this is not an interactive game; you're simply a witness to one of man's major accomplishments.\n\nWhen I was a little lad I recall going to the moon, well not me but the astronauts. Back then we had to be satisfied with photographs and film clips because that's all the technology we had back then. To be able to don a virtual reality headset and go along for this historical ride is nothing short of amazing.\n\nThis documentary or historical reenactment does not disappoint. I won't give away the climactic scenes and events, suffice it to say that going for a ride in the left seat of a space capsule, or being able to look out the window into space or at the moon is uber cool. This is similar to going on the best rides at Disneyland, with no lines and for as many times as I want.\n\nSo if you want to look out the window when landing on the moon or watch as man first steps on its surface, this sim is for you. Bonus comment, I especially enjoyed looking at our planet as the capsule returns to Earth. Absolutely spellbinding.\n\nThis sim is totally worth the money. However, if landing on the moon means nothing to you in regards to history or you're not wanting to see what all went on, this sim is not for you. Keep that in mind when deciding whether or not to purchase this historicl simulation.\n\nP.S. I hope developers come out with other historical simulations oh, perhaps the D-Day Landing or the US first orbit around the Earth.\n\nHelpful | 10", "x.wesley.xMar 24 at 8:40 PM\nWonderful Simulation!!\n\nFeel yourself making history!!! Great work! Marvelous simulation. Experience was recreated in every detail. Developers deserve a medal for this!\n\nHelpful | 4", "etsonicNov 24 at 2:23 AM\nGreat recreation\n\nIt sums up Apollo 11 perfectly, showing key elements in the flight as well as what its like to be one of the astronauts, docking with the Eagle and eventually landing it on the moon. This is an overall great experience!\n\nHelpful | 4", "andyphillips99Oct 16 at 12:45 PM\nGiving this a 5 because...\n\nFrom the other reviews and the screenshots I thought this was gonna be awful - but I decided to give it a go anyway out of love for the history.\n\nHonestly? Yeah the lack of interactivity and the weird texture overlap on the moon aren't ideal but otherwise this thing was incredible. Honestly so much better than I thought, a short movie worth of content - have a glass of wine, forget your surroundings and get a MUCH closer feeling to this mission than you ever could from 2D media.\n\nOn the fence? Just buy it\n\nHelpful | 11", "richard169Jan 26 at 1:39 AM\nGood experience\n\nReally good experience at a really good price. Please could you do some more fantasy games.\n\nHelpful | 0", "GamerBoi21Dec 26 at 8:58 PM\nOk\n\nIts okay\n\nHelpful | 1", "darran.wikeepaJan 17 at 12:09 AM\nBuzzing\n\nJust played it and loved it. Highly recommend it\n\nHelpful | 1", "Ry-Guy1Jan 1 at 1:25 PM\n\nYou dont get to do anything\n\nHelpful | 8", "Up_And_AtomOct 15 at 5:23 AM\nExcellent experience, but...\n\nIts great, dont get me wrong. But its a one time thing. Its great to show to friends how good VR is\n\nHelpful | 7", "bob.hillier.167Nov 17 at 6:14 AM\n\nIf you know the Apollo story then this is not very exciting. If Apollo is new to you then this is awe inspiring.\nFor me... having lived with this experience since 69... this was not exciting.\nYour mileage may vary.\n\nHelpful | 7", "TheSwirlingBrainJul 24, 2019 at 8:57 PM\nGreat Apollo 11 app but a one and done\n\nI had recently watched the Apollo 11 documentary/movie and so installed this app. This app is good and a great experience but it could be better. There's no info on the stuff left on the moon and the control panels don't really show the right data but it's still somewhat visually appealing. In many ways you feel like you were actually there even if some of the scenes are a bit cartoon like. Recently there was an update for interaction but to me it didn't seem realistic at all trying to land on the moon. You just try and fail a bunch and it doesn't really seem react right so it's not fun if you were looking for fun. There are some awe inspiring moments such as when you view the entire earth, that was awesome. I think some of the actual travel steps were left out that you'll miss especially if you've recently watched the Apollo 11 movie. There's no real landing back on earth, you just fall and then you're back. But, for the most part it was a nice experience. I sort of felt like it was over in about an hour so I'm not sure it was worth the money but maybe. There's not any real replay value so once and done for the most part since the interaction part was not really something that did much for me.\n\nHelpful | 11", "robashcorlettMay 28, 2019 at 3:42 AM\nInteractivity?\n\nPlayed this on the rift a while back and really enjoyed it. I am a child of the fifties and remember breathlessly watching the lunar landing on tv. This is a great implementation but I am disappointed that the interactive elements have not been included on the quest. I was looking forward to nailing the docking Mapuche!!! Perhaps this could be included in an update??\n\nHelpful | 112", "kemmelSep 4, 2019 at 10:15 AM\nDeception\n\nAlthough it was specified in the description, absolutely no interactivity at all in this app.\nPlus, on the approach of the moon, a big texture seam effect kill all the ambiance.\nIt's a shame, really, considering how the PC version was good.\nGreat potential, but poor realization.\nPS : the disky does not even throw the 1201 and 1202 errors on it's screen when they occur, could have been a lot more imersive.\n\nHelpful | 7", "drdoak2000May 23, 2019 at 4:04 PM\nInteresting but flawed\n\nI first played the original version of this back when Vive and Rift were just making their original releases. I loved that version, so this is more to help others compare the two. If you don't know anything about the original, then enjoy! If you do have a wired headset, maybe consider that version.\n\nThe Kennedy speech appears to have been expanded, which I really liked. I think there's more dialog in general. You still get a good sense of scale for the Saturn V.\n\nTextures are downgraded, though I would expect that, within reason, on this gen of mobile headset. Usually they're OK, but sometimes they fall behind what other Quest games offer. Seemed to be kind of a lot of aliasing.\n\nThere are many places where the space textures are... poorly optimized for the Quest, brightness wise. Particularly on approach to the moon. As the Eagle separates from Columbia it happens over a very cool looking giant looming moon. With a giant stitching seam right in front of you. Cinematic sequences are neat, but the camera movements can be a bit jerky when they start/stop movement. On the moon, they seem to have removed some of the LEM parts that exist when in space (some of the leg supports for instance).\n\nThe fixed foveated rendering on the Quest seems to stand out more on this than other games, though not sure why exactly.\n\nI may have missed something, but I could not figure out how to get it to switch over to interactive mode, which I really want back (again, I may have missed it). In the original, this allowed you to do stuff like rendezvous with the LEM and land on the moon.\n\nThis all sounds kind of negative, but I bought it anyway and just hope they restore some of the looks and experiences of the original. There's a lot of potential for adding an extra bit of wonderment.\n\nHelpful | 190", "Shilly-ShallyJul 15, 2019 at 9:12 AM\nVery good but needs interactive mode!\n\nI played Apollo 11 HD VR version via SteamVR on my Oculus Quest before buying it here.\nWhy? Because i saw it there first and wanted to try the interactive mode and it was very enjoyable.\nThe quest version does not have the interactive mode YET but the devs replied to my question via facebook and the interactive mode button is allready there but they are still working on it. Texture are a bit lower in resolution compared to the Steam version but it does not affect the immersion or experience overall for me. When interactive mode is ready - this game is easily a solid 5/5!\nWell worth the money!\n\nHelpful | 9", "brasiliansoxfanSep 30, 2019 at 12:07 AM\nShould Have Been Free\n\nNot worth $10, compared to the other excellent educational VR experiences on Quest this should have been free of charge\n\nHelpful | 10", "denodanJul 2, 2019 at 3:54 AM\nVery good\n\nWow this is great. Have bought it for my psvr, go and now the quest. Well worth buying again. Speech is extended. Astronauts have new animations and lips move like they are taking to NASA. Dont think the previous versions had that .\n\nThis is much clearer than the psvr version.\n\nIssues I find is a lot of simmer in parts due to this being the sharpest version I think, but this is still very amazing on the quest.\n\nWished it had the interactive features. The landing approach of the moon not as good as the psvr version and in the capsule and lunar lander while you see the other 2 astronauts but not yourself as an astronaut like you had on the psvr version.\n\nBut in reality there has been very little compromise with this version and still beautiful. Takes me back to when man landed on the moon and remember it like it was yesterday. The Saturn v looks amazing and being sharper on the quest looks even better.\n\nHelpful | 8", "Mikepro72Aug 26, 2019 at 3:12 PM\nREALLY COOL EXPERIENCE\n\nPlayed on interactive mode and all functions worked as they should. Detail is pretty good for this systems abilities! I've played it on the PSVR with a PS PRO and this version has much higher screen resolution (Sharper Image) but lacks the overall detail because of the limitations of it's processor. I didn't really care for the earth and moon orbit movie cut scenes. Kind of disorientates you. Would be better with a straight down distance view. GREAT JOB! LOVE IT!!!\n\nHelpful | 3", "ANGERSNIPERSep 14, 2019 at 10:42 AM\nGood experience but..\n\nWasn't overly impressed with the different colour patch while commencing the landing on the moon. A reminder it was all virtual\n\nHelpful | 1", "GaradurJul 15, 2019 at 7:56 PM\nFails completely as an Edutainment title\n\nThe scales are off, when your sitting, and you should sit with those camera movements. The interactive bits are either unresponsive or unclear what to do. The physics when undocking and dropping to the moon are completely off. And there is no commentary whatsoever.\nAnd to top it all it let's you listen to JFK's \"Not because it's easy\" speech for over 5 minutes, which is about 3 too long.\nNot recommended!\n\nHelpful | 14", "VictorWutJun 23, 2019 at 7:41 AM\nGreat potential but falls flat\n\nThe premise of this experience is fantastic, who wouldn't want to experience the Apollo 11 launch, landing and return? But the developers doesn't manage to do it justice. The switching between stationary and moving camera with no warning can feel a bit dizzying at times, the navigation of the menu system is awful, but the graphics is the worst thing about this experience. Not only are the textures incredibly low resolution which breaks the immersion and ruins any feeling of amazement you wished for, but the application also uses really hard fixed foveted rendering which becomes extremely noticable in the sparse environments. Don't buy this experience, just wait for something like Mission ISS to come to the Quest and hope they did a better job at optimizing it for the platform than these developers did with their application.\n\nHelpful | 10", "Hawat1Jun 14, 2019 at 8:40 AM\nShould have been better\n\nI first played the Apollo 11 Experience on the PSVR and I was very positively surprised how immersive the experience it was. The experience itself is written, directed and edited with a high standard and the same is true for the Quest version.\nUnfortunately the same can not be said for the quality of the graphics, sound and gameplay. The textures have been downgraded to the point where some of them just look cartoonish and downright ugly. (Spoiler Alert) For example, the camera flight from the top of the Saturn V rocket on the launchpad has virtually no detail left on the rocket body itself or the launch pad and tower to the point where it is simply no longer interesting to look at; it looks more like a story board drawing or a cell-shaded sketch then a 3D model of the Saturn V. Inside the spacecraft the detail is slightly better, but the aliasing is very apparent. Even on the moon surface the textures are so bad that the simulation just can not deliver an immersive experience. I believe this could have done a lot better; other VR experiences like Nature Treks VR for example show what can be done even with the limited power of the Snapdragon processor.\nAdd to this some flaws in the gameplay (the game can't really cope with the fact that you can move yourself in 6DOF without using their locomotion / teleport system) and the illusion is destroyed.\n\nSo the verdict is disappointing. The source material is great and remains great on the Quest. But the simulation would have needed much more polishing and optimization to deliver the best possible experience.\n\nHelpful | 10", "ItalianStallyonMay 25, 2019 at 9:44 PM\nGood but could have been more\n\nThis had potential to be a much better experience. First off there is no interaction with your environment. It's more IMAX style, which is ok, but I'm in a rocket and cant touch any buttons? Really? Then there's the loading screens. I don't understand why each scene takes so long to load - they're not even long! Overall cool experience, and great idea, but failed on execution imo.\n\nHelpful | 14", "jakebotJul 12, 2019 at 1:48 AM\ngood intentions but...\n\nlack of details took you out of the experience. I would look forward to a slightly more immersive version.\n\nHelpful | 8", "Chris_StaceyMay 26, 2019 at 8:08 AM\nWe choose to go to the moon...\n\nThis is the third time I've bought this experience - the first time was on the Vive, the second on the GearVR and now for the Quest. It's humanity's defining moment, and with the 50th anniversary this July 2019, it's an experience I love to share with people. This is a great version and definitely worth a third purchase. Hope we get to see their Titanic experience ported to the Quest.\n\nHelpful | 9", "mark.burton22Jul 1, 2019 at 11:29 AM\n\nExcellent experience\n\nHelpful | 4", "JAMs1969May 24, 2019 at 12:14 PM\nLove It!!\n\nThis is the closest I will ever get to space, let alone the moon. Thank you for make one of my dreams come true. I love this!!\n\nHelpful | 14", "Jon10McDAug 22, 2019 at 7:14 AM\n\nReally enjoyed it and love showing it to family and friends as a great example of what the Quest is used for.\n\nHelpful | 1", "wilberto.floresMay 21, 2019 at 8:06 PM\nFirst time VR experience\n\nI am into space exploration and watching Apollo 11 was awesome!\n\nHelpful | 16"]