{"App Title": "Audioshield", "App description": "Audioshield is the music game for your entire music collection. Just download your songs using the Quest's Browser, launch Audioshield, and play with your own music! It also comes with 20 great songs ready to go.\n\nExperience your entire music collection in VR. Audioshield puts you at the point of impact for every hit in your music. Beats glide in slowly for mellow parts of songs, then ramp up for intense parts of songs with cross-body, double-shield, and high-altitude hits.\n\nAudioshield uses an advanced version of Audiosurf's music analysis system to automatically sync with any song from your collection.\n\nEvery song has its own online leaderboard. Punch hard, but don't miss, to get the top scores.\n\n-- Update 4.30.2020 --\n- Transparent shields\n- Subfolder browsing (Music folder only)\n- New option: decrease distant orb height\n- New option: smooth incoming orb speed\n- New option: reverse colors\n- New option: hide purple shield", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Music", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Venezuela)", "Version": "118", "Developer": "Dylan Fitterer", "Publisher": "Audiosurf, LLC", "Website": "http://audio-shield.com/", "Release Date": "April 16, 2020", "Developer Privacy Policy": "None", "Space Required": "569.7 MB"}



["5 stars\n38%\n4 stars\n24%\n3 stars\n13%\n2 stars\n13%\n1 star\n12%", "Laz33Jul 25 at 6:08 PM\nUsing your own music is the best part\n\nTo be able to add your legally owned music easily makes this a worthwhile game. I love the fact that you can easily pick workout modes and locations; however, the game mechanics while in a match leave me wishing for a saber at times. Over all this game is well worth the purchase.\n\nHelpful | 9", "adamt0624 days ago\nSimple game but with your own music\n\nUsing your own music is a game changer (no pun intended), but this is the simplest game to make it useful. Still fun and makes you sweat though.\n\nA lot of people will be annoyed by the simple graphics or gameplay, but my only issue is the hardest level is still not that hard. It is good exercise but not really a challenge to do over 95%, and the game has no built in pass/fail limit, so only you can tell how well you did.\n\nI did hit a rendering bug and the developer responded quickly, so that's a great plus.\n\nIf you are strapped for cash you might find cheaper exercise games out there but if you want to use your favourite tracks or change them regularly for more variety, this is a good option.\n\nHelpful | 2", "AreEyeSeeKayWhyApr 16 at 3:40 PM\nAmazing to have your own music library\n\nThe animations are a little bit funky as you can see them slowly approaching in \"jumps\" due to them not being smooth then they speed up. Wish the motion was a little bit smoother so it would be easier to hit by throwing you off rhythm less often. Google drive music downloading works flawlessly! The idea I love most is that there are 3 normal fun modes and then 2 work out modes on every song, so that the game is extremely versatile!\n\nHelpful | 104", "Aaronb3434Apr 17 at 8:27 PM\nCool\n\nFirst I do like the fact you can play your own music which is awesome but please devs I think the shieds are to big and sometimes it's hard for me to see what am doing. and also the purple shied is in the way sometimes while using the other sheids to punch. if possible please add option to adjust shied size and fix that purple shied glitch etc. add more cool environments, features and SoundCloud integration if possible. and also maybe let users delete audio if necessary. look forward to cool updates and improvements, and yes this has the potential to be 5 star whorty.\n\nHelpful | 47", "CameraLenzApr 22 at 8:28 AM\nSolid core, needs more to be great\n\nDont get me wrong, despite several shortcomings this game is really awesome and unique. Having it intelligently create stages based off any song you feed it is a game changer. It takes some time to get comfortable with the mechanics but once you do, it is a blast. Makes you really sweat too! Id say as much of a workout as Box VR with the right songs and settings applied. I LOVE THE TRIANGLES, that is where the real workout kicks in, all the squats!!!\n\n****Ok, now for my wish list.\n\n1. A satisfying but subtle thud / hit sound to go with haptic feedback. It would make this game more immersive when hitting the orbs. And a level control for the sound to get the mix just right.\n\n2. In the favorites, be able to save not only a song as a favorite, but all the settings and environment as a package favorite. Some songs are perfect with just the right settings and I hate having to reprogram the same info each time.\n\n3. Smaller shield option or even fists / glove alternative setting.\n\n4. Remove thick black outlines on balls and make them more 3D (optional preference in case some prefer it as it is).\n\n5. Calorie count at end with stats.\n\n6. Ability to change color schemes for orbs and shields or at least reverse so red is left and blue is on the right (please please).\n\n7. More Purple orbs!!!! They are so rare lol\n\n8. When you make a fist that is holding in the trigger, the purple shield is ALWAYS THERE which is annoying. Also, you can hit every orb by just putting both hands together, red and blue always hit. Not sure how to remedy that.\n\n9. I touched on sound effects earlier in my list, stating that contact noise when you hit each orb would be more immersive. Also having some actual game sound effects happening over the music throughout would make you feel more connected to the game. Right now its sort of feels like you have the game on mute, and are just listening to music via a third-party app playing in the background. There needs to be some sort of connection between the game and the sounds .....beyond the music soundtrack.\n\nIve seen people complaining about the orbs being too high and too spread out. I personally prefer this. I like that the orbs go both high and low and spread out because they help you use more of your bodys range of motion. Going wide forces you to do a little stretching as well. Please dont change this.\n\nI know thats a lot of suggestions , but that list would give you a $30 game easily. And I hope this port isnt dead in the water as is. So much room to grow, and you can bet other rhythm games will copy your use your own music auto level making formula very soon. So get ahead of them and be the best!!!! Love this game, but I could love it so much more!!!\n\nHelpful | 31", "Mackem33Apr 16 at 12:28 PM\nNOT BAD...\n\nNearly refunded the game after 10 minutes but gave it another chance adding my own music and that changed the game for me playing trance and house tracks and playing on the fitness level gave a really good workout only 4 stars as there seems to be a issue with the orbs as sometimes they seem to slow but Im pretty sure that can be fixed.\n\nHelpful | 37", "ReviewsByJackie22 days ago\nI really enjoyed this app, but WOW, a\n\nwhole other level when we add our own music.\n\nI am having so much fun. I'm pretty much addicted. I actually love to exercise now. I didn't think I would EVER say this but I am actually going to get into the best shape of my life.\n\nEvery day I'm jammin' to my tunes, working up a sweat and really working my arm and leg muscles. I feel great and I may gain back all that muscle mass I've lost over the years, just from aging (currently 52)\n\nI'm lovin' my purchase. It's well worth the money I spent.\n\nHelpful | 1", "UrbanFae19 days ago\nOverall a great game and workout\n\nAweaome to play to your own music. I wish there were more environments and settings for shield size, and orb type.\n\nHelpful | 0", "trishypooJul 29 at 8:00 AM\nYour own music makes this awesome\n\nI am picky about music.i like funk cumbia ska dub happy house etc. I think this is the only excersize game that allows a simple transfer from drop box or google something. I play ever day and get sweaty. I cant compare to the the other similar games because I hate their music. If any other beat punching games come out that allow your own music I will try.\nSo if your picky and old school and know about drop box this is the excersize game for you.i love it. I play simple levels and have lots of fun. Fave song now is a extended swing version of tequila\n\nHelpful | 0", "PtdMtnJul 27 at 11:26 PM\nGreat game\n\nThis, after only one day, has become my go to fitness game. It is very cool to exercise to your own music. Audiosurf in VR, with a fitness kicker. You can select a less intense experience in the app if you so choose, and just want to relax with your music plus pleasing graphics. I will be playing this one for a long time.\n\nUpdate: After three months, this is still my go to fitness game. The new settings options the developers put in shortly after my initial review, were very helpful. Especially the one that smooths out the angle of the orbs. As others have said, using your own music basically sells this game. Some improvements would be helpful, but it is great as is.\n\nHelpful | 1", "GrumpyPanda4024 days ago\nI wish it was better\n\nThis game did lead the way for beat sabre and boxvr but there's a reason it fell short. You're probably thinking of buying this game for the ability to use your own songs and while this is a great feature the lack of feedback ruins the entire experience.\n\nThere's no vibration feedback - not even a subtle sound you've made contact.\nEvery hit feels empty and pointless, doesn't matter how much i like the song the lack of Feel, Connection... Something spoils it. had it not passed the 14 days i'd have requested a refund.\n\nIt is a great game but the best feature is let down by what is a minor issue making for a Meh gaming/fitness experience.\n\nI hope they change this in the future.\n\nHelpful | 0", "jackklineApr 16 at 5:45 PM\nA must have for fitness but..\n\nI really enjoyed playing my own music and I'm really impressed to see how great it is working in that game. That was a selling point to me, and I don't regret it.\nThat being said, some improvements need to be done to me to give 5 stars.\nFirst, the objects coming to you are too high, forcing you to still being looking up.\nSecond the shields should be made smaller for a better visibility.\nAnd third, I would have appreciated to be able to classify my own music in several sub directories under the main music directory, and visualize titles not only with thumbnail.\nHopefully the dev is listening to his users.\n\nHelpful | 39", "Mr_M0nster1966Apr 17 at 11:56 PM\nConcept is great, execution isnt there\n\nI was really look forward to this game, but until they make some changes it just isnt there.\nThe scope of the objects coming at you is both too high, which means you are always looking up, and too wide. Objects are coming at you from 45 degrees on both your left and right.\nThe arm shields are way to big, and would be much better if you could customize the size.\nThe streamers on the balls can also be an issue.\n\nThese are all personal observations, but I hope they are listening and at least make some of these as optional adjustments.\n\nOn a positive note, I love being able to plug in all my favorite music, that was definitely the selling point for me.\n\nHelpful | 37", "MoonUnit58Jun 3 at 7:12 PM\nImproved\n\nMuch better now that they've updated. Orbs no longer stutter and slow down just before reaching shields. It would be nice if they actually looked like round orbs instead of flat dots.\nSong menu system can be improved. Large icons unnecessary for each song. Try using similar system as Beat Saber and also provide file category options.\nI love this game but Audio Shield has to keep their game up now that Beat Sage (BMBF) can easily add custom songs to Beat Saber.\nI use wrist weights for this game and Beat Saber to get a pretty good work out.\n\nHelpful | 2", "ZedisnotdeadApr 17 at 2:54 PM\nEasy for custom songs\n\nThis really could be a game changer. So easy to load songs into drop box and then hit download right from the Oculus browser. Excellent idea!!! That being said......the game isn't without it's flaws. Like other people have mentioned ....the fluidity of the orbs coming at you really needs to be updated ....customization of the shields would be super helpful....this game has the potential to compete with beatsaber but it needs some work. If the devs update the game is response to the community I would certainly change my review from 4 to 5 stars. Alot of fun as is but can't help but want more\n\nHelpful | 10", "r00xApr 29 at 2:42 PM\n\nAs an Audioshield veteran since 2016 who still regularly uses it to this day, I insta-bought this the moment I knew it was on Quest!!\n\nFellow legacy players will be pleased to know it runs beautifully and plays just like the Audioshield we know and love. I'm not sure what others are talking about when they complain about the orbs stopping on occasion; they're supposed to, they slow right down when the music dies! That's Audioshield game mechanics, not a bug. Keeps you guessing about the timing!\n\nContrary to other reviews there is also no problem with shield dimensions vs the original game as far as I can tell, nor anything wrong with the orb angle; angle correlates to how busy and loud the music is and it all works exactly like the PC version as far as I can see.\n\nHowever, as a veteran, I'm also a little disappointed, hence only four stars for an otherwise fantastic port:\n\n- You can't pick shield types; you're stuck with the Gladiator shields. I want my Monarchs back!\n\n- You can't mod the difficulty (or if you can, I have yet to find out how from searching online); gonna have a riffle through the Quest drive later and see if we can edit any lua files or something. **This is a problem because the game is frankly far too easy**. Like, straight to the top of the leaderboard on any song you try on Elite difficulty.\n\nI really want to figure out how to mod difficult, because the beat matching when the difficulty is raised is *fantastic*. I like to play at difficulties that test the limits of how fast a human being can move their arm from one position to another. By comparison Elite difficulty feels like slow motion!\n\nHelpful | 5", "tveithApr 21 at 3:59 PM\nOutdated\n\nI owned AudioShield back when it first came out, when I bought the HTC Vive. I bought this program to support the developer, because it was one of my favourite games at that time. However, when you play it now, you truly see how outdated it is compared to Beat Saber. Even the stats when you finish a round are loaded into a box like an old text file. I really think the developer should have updated this program a little more than he did to modernize it for the quest. It is also difficult not to have a lot of customisation, such as being able to change what colour is on the left and what is on the right. You should also be able to change the shields, to other things, like boxing gloves for example. Not a lot of thought went in the translation and transition of this product. Hopefully, over time, the developer will make this better and modernize it. Using your own music is the only thing that sells this game in its current state.\n\nHelpful | 18", "StephenVApr 20 at 6:28 PM\nLackluster\n\nBackground - I've owned and played this game on PC for years.\n\nI was very excited to see this coming to the Quest. The price was surprising, but I figured that it must be a big step up to justify such a high tag. Unfortunately I was wrong. The Quest version is lacking features from the PC version, which would not be so much of a problem if the PC version wasn't already very barebones. The user interface is extremely simple. On higher difficulty the balls are at times too wide out and the Quest controller tracking results in missed hits. The balls come from a high angle so after a few songs you end up with a seriously stiff neck from looking up all the time.\n\nOn a positive note, the auto beatmap generation works well most of the time.\n\nThis is my first purchase on Quest that I'm refunding. I'll keep a close eye on it though, hoping the dev steps up and improves the game. If that happens I'll consider buying it again.\n\nHelpful | 13", "Berzerker7777Apr 17 at 10:50 PM\nOG Beat Saber with easy custom songs\n\nI was so excited seeing this in the store having played it years ago on other systems. But it feels like it needs some refinement as tracking is just overall glitchy. And its very confusing having the orbs come in at a slow pace kind of takes you out of the music but when it gets up to tempo its fantastic. I was also surprised with no sound affects for hits and no scoring. Surely this is something thats coming. One problem I found only after a few hours of playing is the triggers bring up the shield. But there is no way to turn that off. I think this might be adding to the glitches. As the shield is always on. The controllers are way too small to NOT hold all the buttons. so please enable a setting to disable triggers. More than happy to edit the review after the first update. The custom songs are brilliantly simple.\n\nHelpful | 15", "redseawolfApr 17 at 8:32 PM\nGood but not yet great\n\nI do enjoy this game and being able to use my own music us amazing but, as was mentioned in earlier reviews, the shield size needs to be customizable, and we should be able to reduce the amount of debris when the orbs explode because it is sometimes very hard to see the orbs behind the ones you are hitting until it's too late. If you could make these changes in the next couple updates I would change this to a 5 star review. Perhaps the angle of attack on the orbs could be adjusted so the upcoming notes aren't blocked from view by the shields or debris. Also, I was having a slight issue following when the orbs were located very far to the left or right intermittently because they would be out of my view so I would miss them. Maybe add some slight tracer lines leading to the next orbs or some kind of visual que that makes it easier to tell when you have notes coming in from the opposite side of where you are currently looking. All in all a good game though, great exercise  looking forward to future updates!\n\nHelpful | 8", "AneheimJul 10 at 5:51 PM\nPoor choice of music for a beat game\n\nI'm sorry but the game just doesn't compare to it's competitors such as beat saber, and for the price of this, it's just moving your hands around and crouching but in beat saber you get swords, it's super accurate and not very laggy, but this game glitches all over and sometimes just misses for no reason.\n\nHelpful | 1", "aehvenMay 21 at 6:45 PM\nGetting there ....\n\nNeeds documentation on how to add songs using file transfer because downloading one song at a time with the browser is unrealistic. And the file transfer method was non obvious to a newbie like me.\n\nNeeds a shuffle songs forever option because stopping the action after every 3 or 4 minute song and then having to pick a new one is a pain.\n\nGood game, though!\n\nHelpful | 1", "dariana.lorenteJun 20 at 3:21 PM\nFantastic mix of BSaber, Audica & VrBox\n\nThis is a must buy app for everybody who uses Oculus for fitness. You literally cant stop exercising listening to your favorite songs! Its incredible how accurate the maps are. And they are created within seconds after uploading any of your songs!\n\nAnother great feature is different play modes, you can dance, box , relax or even full workout ! This last mode is the best one for me, you really sweat and feel like after intensive full body exercise!!! The orbs are everywhere but its not difficult to destroy them, I think its a plus they they can fly wide, this way you have to move much wider range and make your muscles stretch!\n\nThe shields are ok for me, but if you could customize them or unlock different type of shields it would be a great plus!\n\nOne feature that also motivates me is the ability to show not only accuracy, but also your hit power and even your artistic performance !! The only thing is to improve visuals for this chart and leader board , add trophies and overall make it more visually appealing!\n\nAlso add possibilities to unlock new beautiful environments. And color schemes for orbs and particles (make it more visually appealing for example as in Audica)\n\nBut the game even in this first version is amazing and makes you loose pounds and adds motivation and good mood! Thank you for this one and keep growing and releasing add-ons and new versions!\n\nHelpful | 1", "DualRCP90sJul 12 at 9:04 PM\nWont play downloaded song\n\nSuper frustrating. It downloads from my google drive, but it wont load when I click on it. It shows the menu for 1/8 of a second, and goes back to the song menus. Will only load the menu for included songs. None of my downloads. 1/5\n\nHelpful | 1", "Antone80May 19 at 6:24 AM\nReally great to use as a workout warmup.\n\nI've really enjoyed uploading hundreds of tracks and it keeps the game fresh. If the developer continues to improve and support this title I will definitely keep using it.\nI own Supernatural but it becomes stale pretty fast and expensive. This title is exactly what I needed during this lockdown.\n\nHelpful | 0", "TheSwedishLordMay 1 at 11:15 PM\nAmazing fun but...\n\nDevs should fix the download method to look in Music folder, it's so easy to connect headset to a computer and put music files there so it should look in that folder too. It's not nice to keep music files in the download section... Other than that this game have potential to be a really good game. So next release please fix this and from me it will be a 5-star but for now it will be only a 4-star.\n\nMaybe smaller shields could be implemented, right now they are in the way when you try to shield on the oposite side etc.\n\nHelpful | 2", "Melanie.Andre8Apr 29 at 7:14 PM\nGood, not great\n\nIts a bit buggy. It stopped halfway through one of my songs. The shields are too big. The orbs sometimes come too close after another and I cant see it, so I miss it. The rhythm of the orbs are a bit off from the music. Its overall a decent game, but I hope they update for smoother gameplay and being able to change shields or sizes. I will add stars if they improve gameplay in time.\n\nHelpful | 4", "AviboyApr 17 at 5:53 AM\nFirst reaction ... Wow!\n\nThis game has great potential. I gave it a 4 as it lacks any user settings. I personally prefer Red on left and Blue on right as Im used to it in Beat Saber. Now having to get used to this other format completely distracts me. Hope developers can do something \n\nHelpful | 5", "FirecruxApr 20 at 2:04 AM\nGreat Concept. Gameplay isnt smooth\n\nafter playing this game for a while I realize the shield size for each arm is really big. and with no clear field of view notes don't feel like they flow with the songs at times. almost like some notes appear outside the Quests field of view. it doesn't feel like a finished product for some reason. The fact I can put custom songs is amazing, but the game-play feels off for some reason and I cant lay my finger on it quite well. I hope we get more updates.\n\nHelpful | 5", "BurtMacklin18Apr 16 at 8:13 PM\nPotential\n\nThe projectiles are a little glitchy, but its a great workout for quarantine. It may be something Im doing wrong but Im not sure. This is a VR classic. I think the ability to add your own songs natively is amazing!\n\nHelpful | 26", "XxdarkdeathxX21Jun 23 at 11:15 AM\nToo slow\n\nNeeds an option to make the songs faster i play beat saber so this game feels a little too slow for me but i like that u can add your own songs.\n\nHelpful | 1", "LeewingzzApr 16 at 9:33 PM\nWish some change\n\nTo whom it may concern,\n\nThings keep falling down from the top of my head and burst in front of my eyes.\nSo that I need to keep raise my heavy head.\nAnd also so many light enter into my eyes. So make my eye so >< \nWould you please regulate it.\nThank you\nKeep going\n\nHelpful | 7", "goldo72Apr 17 at 11:42 AM\ndisappointed\n\nI wanted to love this game because we can add our own music. But there game is too awkward. Doesn't matter if I can add my music, the notes still come in a weird beat.\nSometimes, the colors get inverted in a weird way that is hard to follow, even when the notes are slow coming.\nWe have to be looking to high too often. When trying the exercise mode, you have to look up while looking down at the same time to see the triangles (to bend down) coming.\nEven in the hardest exercise mode, I didn't feel I was doing any exercise. I felt I was just slowly moving my arms around.\n\nToo bad\n\nHelpful | 18", "ellyn.a.hooperJun 17 at 2:34 AM\n\nLiked the music and the challenge. More music options. I hope it keeps getting better. Friends like also\n\nHelpful | 0", "MykallCasiasJul 24 at 5:51 PM\n100%\n\nBeating Go Ninja Go on Elite is the stuff of legends.\n\nHelpful | 1", "Shiroq25 days ago\n\nMore Areas please!\n\nHelpful | 0", "Sense_FieldMay 27 at 10:59 PM\nLots of promise\n\nEDIT2: Everything in the rant below has been addressed by the developer. I bumped it up a star because its much better now. Still love that you can play your own songs.\n\nEDIT: After loading up 65+ songs...I can say that any song where the temp changes will create very weird jerky movement with the targets as they approach you. This needs to be fixed...it makes many songs awkward to play.\n\nThe dev needs to adjust space between targets when tempo changes instead of what amounts to pausing and unpausing the entire flow of targets toward the player to accommodate for changes in tempo.\n\nI dont feel ripped off, but it feels like this game falls sort of other similar games in a gameplay sense, but still overshadows them with its ability to play your own songs...but your mileage will vary depending on the song.\n\nThat said, I also think they need to decrease the width of the play space. Targets can approach out of the field of view on the quest.\n\nI also think there needs to be better separation of colors...more red on right and blue on left with some cross talk between the colors, but less than the current threshold.\n\nI also, like others...dont want to have to look up to see the targets approaching. Have them come more strait on.\n\nEnd edit \n\n\nI loaded up the new Tool album and a handful of other tracks and just smiled while I played some of my favorite songs.\n\nThe auto generation is pretty good...not perfect...but good enough for me.\n\nHelpful | 1", "mentalfengshuiApr 18 at 11:37 AM\nCustom songs won't work\n\nI was super excited for this, and couldn't wait to try it. After an hour of frustration with custom songs not showing up, I'm on the verge of refunding it.\n\nI tried directly putting songs on the Quest from my PC. Nothing. I tried uploading songs to Google Drive and downloading them onto the Quest through the game. Nothing. I tried different audio formats in case one wasn't compatible. Nothing.\n\nThe songs show up on my Quest, but won't show up in the game. What am I missing here? I want to love this game and give it 5 stars, but I literally can't do the one main thing I bought the game for in the first place :-(\n\nUpdate: So it seems to only work with MP3 files. Most of my music is in either WMA or M4A format, and it simply won't recognize these. This means that in order to use my own music in this game, I have to go through the extra step of converting every single track.\n\nI don't recall this limitation being disclosed ahead of time.\n\nHelpful | 11", "The_DobbosApr 18 at 8:21 AM\nMore user setting required\n\nIve just played it, I enjoyed it but disappointed in the lack of user settings, I would like to have reduced the size of the shields and the amount of smashed note flares (sorry cant think what they wouldbe called) as they obstruct my view.\n\nHowever being able to easily add own music is a game changer for me - Ive already added a few which is fantastic!\n\nFYI: Jamiroquai is awesome and contemporary worship music is an entirely new experience \n\nHelpful | 2", "motorheader1916Apr 18 at 10:55 AM\nNice to have your own music\n\nReally liking this so far. Most other games like this rely on a instalked music set, which i normally dont like. Being able to load my own is great. Some songs arent great, but ive found about 20 so far, and its easy to swap them out. The downside is, i dont have anyone to compare to. Yea! Im always on top of the leader board! As a note to developers, tge automatic shift to a purple shield is actually detrimental when i need to try for cross body blocks. Can this be changed so it just uses a trigger option wgen the controllers are close?\n\nHelpful | 2", "BurntSinaiJun 16 at 11:23 AM\nLags too much\n\nI will use this app for the fitness category, but for recreation it lags too much whether its my song or theirs. Cant beat Beat Saber.\n\nHelpful | 1", "GraphicsMonkeyApr 16 at 2:01 PM\nBe retro classic\n\nLoved this on the vive but the cable was a pain, now. I cable and adding my music is easy:)\n\nNeeds to have a multiplayer local option to have users so I can play against my wifey though.\n\nAlso what happened to different shields?\n\nCan you make the haptics configurable so we can have heavier feedback if wanted as the vive wands were intense and it helped.\n\nApart from the above (which are niggles) totally awesome to see this in the store and brought it within the first few seconds it showed up:)\n\n\nThink beatsaber but more relaxing\n\nHelpful | 8", "SojoAmMay 13 at 4:24 AM\nSo glad you can add your own music\n\nThe best feature is being able to add your own music. I tried and tried to do it with another app.. audio shield makes it easy. The fireballs hitting you in the face when you miss us the reason I didnt give it five stars.\n\nHelpful | 0", "IAmOnCloud9Apr 26 at 11:15 AM\nEnjoy playing your own MP3? Then get it\n\nDo you like playing your own songs without the hassle? You like rhythm games? If you answer yes to both, then just get this game, period.\n\nThe best feature about this game is playing your own music, & it's so very easy to transfer your songs, unlike (or lack of) like, Beast Saber, Box VR, OhShape, Pistol Whip (all games that I own). And this alone makes up for the inferior game play vs the mentioned games. Sure some of the randomized music stage may seem a bit off, as is somewhat of unpolished game play, but again it is definitely worth it if you value playing your own songs easily.\n\nHelpful | 1", "spookoApr 16 at 1:38 PM\nMagic!\n\nMight be a combo of Beatsaber and Synth Riders but this game is exactly what I've been looking for. Being able to use your own songs takes it into a whole new level. ( so easy to add with something like Google Drive as well! ) Can't believe how good the mapping is as the speed and patterns really seem to work with the music and it seems to calculate all this with hardly any waiting to start time. Get something you like with a good beat and you won't be disappointed and will come away with a sweat even from the regular mode. Just brilliant folks.!\n\nHelpful | 6", "RafaksoApr 16 at 1:54 PM\nMust buy for Rhythm and or Fitness fans!\n\nThis Game is in my opinion great to just relax or do some intense fitness. I really like the simplistic style it just fits right in and the custom song feature works surprisingly well and is a blast to play. I just love playing the fitness mode or just relax in the classic mode. All in all this is a must buy for Rhythm and or fitness fans.\n\nHelpful | 6", "mrddixonApr 28 at 5:50 PM\nOnly one reason to buy\n\nYou can add songs from your own collection. That's it. It's the only reason I didn't refund. Otherwise, it's just a Dance Collider clone with the worst graphics I've seen in VR. Tell me, Devs. Look at that selection screen and tell me it looks like it came from a game worth $20. Tell me you're proud. Other than adding my own songs, what does this pile of steaming, fetid, pixelated garbage offer that I can't get for the same price or less somewhere else? Nerds.\n\nHelpful | 4", "Mandy9654Apr 18 at 4:40 AM\nAudioshield\n\nI do love the game cos you can use your own music so that is a plus. But on the downside the shields are way way too big and the orbs are glitchy fix this and i will return with 5 stars\n\nHelpful | 6", "elgandinoApr 19 at 1:52 AM\nNot enough there\n\nIm going to return it. Its good that u can use your own music but for the price I would of expected more. No customisation. Nothing to work towards. 4 backgrounds. Shields get in the way alot u tend to look Into the sky for alot of it and fitness isn't just crouching. When u hit something the spray goes everywhere and u end up missing more hits. No scores no combos nothing. You need to do better. If it was in a sale maybe ill buy it again\n\nHelpful | 5", "s318830May 19 at 7:05 PM\nAwesome when you load your own MP3\n\nAs soon as I bought this game I downloaded all the fast-paced MP3s I owned (since I mostly stream that was only about 80). I never did play this with the provided songs, but my daughter did. She echoed many of the reviews here that the game isn't as fun with the stock music. But when you're playing to songs you love, it's great. Unlike some other games that allow you to play to your own music, AudioShield creates the play patterns straight from the music and it's ready to go as soon as you load it. The balls and actions are well-synchronized so it can feel like dancing. I pretty much always play it on the lower of the two exercise levels which involves ducking under triangles along with hitting the balls. I don't have any problems at all with the size of the shields or where the balls are coming from. This is actually one of my favorite games for exercise since every song I loaded is selectable.\n\nHelpful | 1", "theJAZzGeApr 17 at 12:06 PM\nVery clunky\n\nWhile fun to play your own songs, its kinda missing a good flow.\nThere are always multiple parts in a song where it feels like you are in superhot and the world only moves when you do, euch is really taking away from the experience.\nThe movements also dont really flow well into each other and the loading times arent the best either.\nIts okey, but I feel you get more for your money elsewhere.\nI hope this gets improved in the future or else thisll just feel like a big waste of money\n\nHelpful | 5", "jivemmMay 6 at 12:18 AM\nOwn Music Only Goes So Far\n\nI was so excited about the release of this one. And so disappointed when I played it. Even on the highest 'exercise' setting it doesn't work up a sweat like some other fitness titles. The coloured sequence is too extreme, having to hit a red ball at the extreme far left and then in the next half second extreme far right. This app has been around for years so by now should have been developed further to create a more fluid sequence of auto generated balls. It also isn't very smooth - it seems to try and start slow no matter what the tempo and then speed up but the slow movement is jaggered. The shields are too big and when balls are coming from a high angle can block the view of what is coming next. The angle of entry is too extreme to the far left and right. Playing this to your own music could be the best app for fitness on the Quest if they just\n\n1. reduce how wide some balls come in\n2. reduce the size of the hand shields or make them mostly transparent\n3. program the music generated sequence to never have same coloured ball generate at speed on opposite sides of player to the far left and then far right\n4. have barriers to side step left and right around rather than just hand movements and squatting under the triangles\n5. smooth the movement of the balls at lower tempos\n6. Upgrade the graphics in general\n\nI use the Quest as part of my workout routine every day. BoxVR, Beat Saber & Pistol Whip are the staples... I had hoped to add this to the list but after a few plays even to my own music I've found myself not returning to it. A shame.\n\nHelpful | 2", "ABucketMay 14 at 1:29 PM\nLove it!\n\nI tried this back when it YouTube integration. Loved that concept but was sad to see it removed. Fast forward a couple years, I remembered how much fun I had and decided to give it a shot using my own music. And now I cant stop playing it! On Elite difficulty, you have to a move a lot and its fun bobbing to my music. The smoothing feature has really helped it feel not so choppy and it seems like the dev is listening!\n\nNot sure if this is my own issue, but sometimes one of the shield loses tracking for a few seconds, itll appear behind the controller. Havent had issues in other games. Regardless, it doesnt ruin the fun at all :)\n\nOne thing Id love to see brought to this version is being able to change what shield youre using. I remember that from the older version and was a bit sad to not have that option.\n\nOverall, well-worth the price if you have a decent sized music collection!\n\nHelpful | 0", "jaskar01Apr 18 at 10:08 PM\nHeadache Galore\n\nIm still getting use to the game. But the looking up throughout majority of game starts hitting my neck, giving me a headache. But im hoping it'll go away the more i try the game\n\nHelpful | 4", "GeorgeOrr93Apr 16 at 7:33 PM\nYour own song library\n\nBeing able to play any song you own is for me a complete game changer. It's worlds better than only being able to play the few songs for which a developer has deals. The very fact that its my playlist keeps me working out much longer. Thanks for this game.\n\nHelpful | 5", "Pi3.14151926Apr 16 at 8:43 PM\nThe BEST GAME to own for fitness lovers\n\nThis is by far the best VR game for fitness lovers looking for high intensity VR workouts. Ive tried a lot of fitness VR games and none come close to the level of conditioning Audioshield has to offer. Play a high BPM song on the highest difficulty and you will be feeling the burn in your deltoids, quadriceps and forearms. The game forces you to keep your arms at shoulder level or higher in order to hit red and blue targets which gives your shoulders a great workout. The shields are large towards the top and therefore require you to constantly turn your forearm in order to see the targets and keep the large part of the shield pointed down. And the squats!!! Ive never squatted so much in one game before, especially with the right song playing. If you like strength training then try adding wrist weights, a weighted vest, or even just put on a heavy backpack, you will have one of the best high intensity workouts that you probably couldnt get anywhere else. The dev is a genius by adding the ability to procedurally generate levels allowing you to use any song in your music library. The menus are simple and easy to use plus the game is very quick to learn. Highly recommended for all you fitness enthusiasts out there!\n\nHelpful | 4", "KFoxOPMApr 16 at 6:27 PM\nNo Internet Required\n\nIt's refreshing that you can add your songs just by plugging in to USB and doing a file transfer to the Quest Music folder. No internet connection needed. So nice to go back to the basics great job!\n\nHelpful | 8", "LorettaMMay 10 at 3:58 PM\nShields missing\n\nIn the steam version you have more options for shields. Was totally disappointed that was gone. I will hold on to it in hopes that they add them in. Its not Box vr, but its a lot of fun and gets your heart rate up.\n\nHelpful | 1", "ASamLoomisGuyApr 17 at 4:18 PM\nAmazing!\n\nYou can add songs simply by dragging music to your music folder on your Quest.\n\nThis is probably most similar to Box VR. The round does not end no matter how many nodes you miss. That's a huge plus. If you play on hard you move the entire time.\n\nIf you play a long song (Mona Lisa Overdrive from The Matrix Reloaded for example), you work up a sweat. You could also splice songs together with a program like Audacity and use them to create custom cardio work outs.\n\nThis may be my favorite game for cardio right now.\n\nHelpful | 3", "DeepMellowMay 5 at 3:37 PM\nBasic and lacking\n\nIts a game where you can add your own music.. thats all it gets. Worth about $5. I only kept it because I can add my own music otherwise Id refund. Its shields and balls that once in a while match up to your music. The balls come sputtering at you in a laggy way and youre too busy looking upwards as they come at you. Graphics 1, Gameplay -1. If there were other games that you could easily add your own music this game would probably be $5 or a free.\n\nHelpful | 2", "ddominiqueMay 10 at 9:15 PM\nUPDATED - New Features, Please Read\n\nListen, a lot of the negative reviews were complaining about the bubbles/balls being too high up in the air and coming at you in a jerky fashion. Just today, as of May 2020, I saw that there is a little gear in the upper right corner that allows you (on the Quest at least) to check a box that lowers the level that the bubbles/balls come at you, AND another setting that smooths out their approach!\n\nThis essentially solves the major complaints I had in my prior review below, and most of the other complaints I've read in other reviews. You should try this game with \"Eye of the Tiger\" and \"Mr. Blue Sky\" and tell me if you don't finish them with a smile on your face and a great workout!\n\nOLD REVIEW:\nOwning a Quest and being new to VR, imagine my surprise to find out that this game is 4 years old. I had no idea that it has been available for other platforms for so long. The fact that I was able to get my own songs with such ease off of Google Drive inspired me to get custom songs on other favorite games of mine such as synth riders and beat saber. I wish the balls were not so high and they didn't stutter, but you can't have everything - it's still super fun!\n\nNow that I have all my own music on these three games, I admit that this one keeps drawing me back. The other two games are limited by what the content creators choose to map. But in this game, I can put any song in the world, and the game creates its own map. Some are better than others but there's no limit to the type or amount of music that I can use. That offers a sense of freedom that my other games don't have.\n\nOverall, I highly recommend this game if you are a fan of other rhythm music games. It's nice to just mix it up once in awhile and get some variation so you don't get too tired of your other games. It's easy to get burned out I have found where you close your eyes at night and you see the squares from beat saber coming at you!\n\nHelpful | 1", "jgstealthmomMay 10 at 1:08 PM\nJust get it\n\nAgreeing with other reviews- it is so cool to bring in your own music library- instead of having to pay for music packs like beat saber.... I actually tried AudioShield on an HTC Vive 2 years ago... and then bought PS4 because I wanted a similar game... when I realized it wasnt going to happen... I started looking for ways to play it.... and found the wireless Oculus Quest. So happy with this purchase, and with this game.\n\nHelpful | 0", "DJR2019Apr 20 at 2:16 AM\nMiddling\n\nWhile it is great to be able to put your own songs into the game, the process is awkward. The interface is dated and clunky, and the game lacks the depth of other rhythm games. I do not think it is worth the asking price\n\nHelpful | 6", "mentalcharismaMay 5 at 4:02 AM\nEnjoyable but get neck ache.\n\nI would of given it 5 stars but because you are constantly having to look up, I get neck ache.\nI love the game its very interactive and can work a sweat up.\n\nHelpful | 0", "APigInTheCityJul 27 at 5:31 PM\nNeeds variation...\n\nThe key to this game is the ability to easily import your own tracks and it does a pretty good job of it... perhaps because the mechanics are so limited, just 2 colors to punch basically... also unclear what methods might produce more points... I would recommend this on sale to users who just have to try their own music library for a VR spin... to everyone else, the are several better rhythm games...\n\nHelpful | 0", "ChillDocMay 7 at 9:41 PM\nGreat to have own music, updates\n\nThe ability to add your own music was intriguing, but I was somewhat off put by some of the reviews noting features that were lacking. I had hoped to see developer responses to their reviews. Then I added it to my wishlist waiting for it to be 'on sale'. Finally I took a chance, knowing that I could return it if it didn't meet up to expectations. I'm glad I did. After purchasing I noticed that the developer had added several of the requested options under the settings menu. (See the update notes from 4.30.20 above). These changes address many if not most of the issues that had been brought up in the reviews. Again, being able to workout with varying levels of difficulty synchronized to my choice of music is worth paying the full price of this app. Definitely recommend.\n\nHelpful | 0", "Fantasma_103Apr 17 at 3:51 PM\nGreat game\n\nThis is an awesome game! Ive ran into an issue after a day of playing, though. In front of my face the whole time, there is this glitchy pixel wall. Devs, please fix! It makes my experience unplayable. Otherwise really fun!!!\n\nHelpful | 1", "hankymanApr 27 at 11:43 AM\nVery underwhelming\n\nFeels old and, surprisingly for its age, unfinished. The front end is woefully inadequate and the gameplay is underwhelming. Playing this after Synth Riders feels like playing Moonrider.xyz after playing Beat Saber.\n\nBasically looks and plays like most WebVR 'experiences' I've tried. Not great. I'd give it 2/3 stars, but not at a 15 price tag.\n\nHelpful | 2", "simpliemetxMay 6 at 7:15 AM\nMy New Favorite Game!\n\nThis game is amazing! The environments are beautiful, there's practically no learning curve so you can jump right in and adding your own tunes is super simple. The mapping is so spot on that your songs just flow. A huge round of applause for the makers. I'm hooked!\n\nHelpful | 0", "HyperMushramboApr 17 at 9:43 PM\nSO MUCH FUN!\n\nMove over, Beat Saber! This game is such a good time. It does such a good job utilizing your own music. I wish it had better detection for crescendos and m4a compatibility but other than that it's an amazing and challenging experience!\n\nHelpful | 2", "johnson1506May 9 at 8:29 PM\nGreat idea but not worth it at the momen\n\nGreat concept bit at the moment feel tally cheap and unfinished worth 4.99 at most. Could be so much better with polished gui and if the orbs looked smoother like on other rhythm games. Feel a bit ripped off at the moment.\n\nHelpful | 2", "devinbrosephApr 28 at 5:21 PM\nMisunderstood\n\nThe game is phenomenal if you have your own music collection. It makes levels for whatever song you add which is a HUGE feature, that definitely gives it quite a head up over beat saber considering you dont need to make maps. The songs are actually mapped out really well for being procedurally generated. Its a great workout and like many games, people are quick to hate on it if they arent good at it. This is definitely a learn as you go kind of game. Theres a lot of pre installed music, a lot of which are actually really good. Overall if youre looking for a good music rhythm game thatll challenge you, here it is. 9/10 (p.s many people like to think the motion isnt smooth... it is, it just moves with the music i.e. a song goes silent between beats itll slow down)\n\nHelpful | 1", "gordoli20 days ago\nMove to your fav music\n\nNo other quest music game can play your own music. I've made a custom map in beatsaber before but it took a whole week, so if ur music isn't already mapped you're out of luck. Audioshield generates great maps in seconds.... Coming from beatsaber it's a breath of fresh air.\n\nIf you've a set of music you wanna play to and there's no custom maps for it in beatsaber, this is the game for you.\n\nI have a modded quest and I had no neck issues unlike the other reviewers. Also I only use the quest 0-10 hours a week so that may also contribute.\n\nHelpful | 0", "ecmotooApr 29 at 11:20 PM\nNot great\n\nThe hits dont match up with the beat of the music. It would probably be a fine exercise tool if you just turned off the sound and hit the colored blobs. But theres no rhythmic synchrony to the music.\n\nHelpful | 2", "Kentendo.RightbrightMay 4 at 4:49 PM\nMP3s only\n\nNot only this app make beat saber and Synth Riders even more worth the fun it this app just feels flat. Everyone out there just stick with Beat saber, Synth Riders and Pistol whip. Its so much better even though those apps dont have true custom songs.\n\nHelpful | 1", "Spunk_McKunkleJun 27 at 9:25 PM\nWell worth the price, with a few caveats\n\nMost of this is just reiterating what others have said. It's great to be able to play your own music, and having settings on every song meant just for exercise is a nice touch that gets at a large portion of the reason that I bought the Quest.\n\nOriginally I had a bit of a rant about the jittery movement of the orbs and the colors of the shields being inverted from Beat Saber, but there are settings in the menu in the top right corner that fix them. I think they should be on by default, but that's just me. And I'm not sure if this is part of the difficulty or just not good design, but there seems to be a point at least once a song where there's a wide \"swing\" of orbs, and then immediately after there's a different orb where you have no ability to see it coming.\n\nAll in all, great game. There are a few tweaks I would make, but nothing major.\n\nHelpful | 0", "el.zebubApr 17 at 3:37 PM\nI really didn't enjoy this\n\nVery clunky interface and graphics. You spend the entire game waving your arms slowly in the air. Even for the custom songs it's not worth it at all.\n\nHelpful | 8", "Aliasaustin6288Apr 18 at 1:59 AM\nSuper fun and great exercise!\n\nI love how this game has many different modes so you can get used to the blue and red targets, then speed it up and add more obstacles. My favorite part of the game however, is the fact you can upload your own music and workout to it. I tried the xtreme mode and found that it got my legs feeling like I just ran a marathon! The easier modes are definitely better for just wanting to have fun and listen to your favorite songs, but the exercise modes make sure you get a good workout! I would recommend this to everyone!\n\nUpdate: after playing just a couple of the extreme workouts, I woke up the next day feeling sore. This means the game definitely works for exercise!\n\nHelpful | 1", "robbieloseeApr 16 at 8:37 PM\nExcellent\n\nReally shines at creating levels on the fly for whatever song you throw at it, especially those with varied textures and tempos. The first bring-your-own song I loaded was Coldplays Paradise and playing it on Elite mode the algorithm totally nailed it, varying intensity with the music and even throwing the purple orbs on music cues that felt like it was handcrafted.\n\nHelpful | 1", "Nagalama24 days ago\nIncredible and very easy to add own song\n\nTo option to add your own MP3 files makes this game truly the best one of all the rythm challenges there is. For me it easily won the decision between this and Beat Saber because I can upload anything I want and play it in the matter of seconds.\n\nHelpful | 0", "RMajereApr 24 at 6:07 PM\nDon't feel the rhythm\n\nI couldn't get into it. Felt laggy and the pieces coming at you didn't seem to line up at with the songs that came preloaded.\n\nHelpful | 3", "zarumbaApr 24 at 7:20 AM\nPlay with your music!\n\nThere are several things that can be improved, but possibility to play your favorite songs overtake all the imperfections.\n\nI am curious... is it possible to add support for Spotify music? It will be game changer!\n\nHelpful | 0", "Jake.70Apr 28 at 6:58 PM\nAwsome active game\n\nThis game I 200% recommend one of the best games on the quest and they have an amazing customer service team. I cannot recommend you get this game enough. Its awsome just absolutely amazing\n\nHelpful | 1", "jamesl10029Apr 20 at 8:07 AM\nPerfect Cardio Workout\n\nI break a sweat after playing 2 songs. Work out mode does require you to squat and shift left and right to hit all the targets.\n\nHelpful | 1", "xRawBee8 days ago\nHelp\n\nI cNt seem to get my music on here, I've watched youtube after youtube video.\n\nHelpful | 0", "seguin418Jul 1 at 9:10 AM\nNice work out\n\nUse your own songs\n\nHelpful | 0", "taufirecApr 17 at 7:05 AM\nRhythm game I've been waiting for\n\nSince the release of the Quest I've been anxiously waiting for a rhythm game that actually let me use my own music. Box VR offers that on the PC version, but cut it out for the Quest version which killed the game for me, but Audio Shield rewarded me for my patience! The game may not be perfect, but with some optimization and QoL improvements this game stands to be a top competitor for VR rhythm games. Theres some lag on custom songs which can be awkward but the game itself is fun enough to make that a minor issue. The visuals are just ok and could use some improvement but otherwise work for the game. Overall the game is realistically a 3.5 or 4 out of 5 but I'm giving it a 5 because it actually has the one feature I've wanted from a VR game.\n\nHelpful | 2", "weejpApr 21 at 1:12 PM\nGame changer\n\nFinally a music game where I can add my own music easily and it automatically makes a map. I have a very unusual taste in music and This means I am more likely to play this than any other music game. Maybe the other rhythm games should take note. Seeing all the notes waiting on the horizon can be quite intimidating. It's a bit like space invaders.\n\nHelpful | 0", "justcallmezebApr 19 at 9:20 AM\nGreat game need a little more work thow\n\nThis game is fun to play and really easy to pick up and it really simple to get custom songs too but I wish you could make it more difficult then just elite but it's still a good game that I'd recommend to anyone\n\nHelpful | 0", "dneuvirthApr 20 at 4:07 AM\nWorks Great!\n\nworks great! my wife and I have odd music preferences and the ability to use both of our songs is great! Simple songs with one strong steady tempo work best!\n\nHelpful | 1", "SlimHaydyApr 18 at 7:34 AM\nAmazing fun\n\nMy new favourite game! Ability to use own library is a winner! Great to take it easy or ramp it up for fitness. Top marks for the Devs!\n\nHelpful | 1"]