{"App Title": "Audio Trip", "App description": "Audio Trip is a VR dance game where you catch gems, ride ribbons, smash drums, and dodge barriers as you dance your way through surreal environments specially crafted for each song.\n\nMake it your Audio Trip by using the in-VR level editor to create custom choreographies with your own unique dance moves, with the same tool used by the developers to create their choreography! Join in on our Choreography Contest to showcase your flair! [Discord http://audio.chat]\n\nMain Features\n Licensed music by top artists: Skrillex, Zedd, deadmau5, Lady Gaga, Tisto... and more coming soon!\n In-VR level editor (Choreographer tool) included.\n Full or Short Trip options for each song.\n Fully immersive hand-crafted environments for each song.\n Intuitive UI with a simple tutorial for your first time playing.\n Gameplay customization: Comfort, Dancer, No Fail, Color Swap.\n Global and Local (Party Mode) Leaderboards to challenge your friends!\n Many more features and content coming soon!", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Art/Creativity, Music, Sports", "Languages": "English", "Version + Release Notes": "1.0.2022\n(LIVE)", "Developer": "Kinemotik Studios", "Publisher": "Andromeda Entertainment", "Website": "http://audiotripvr.com/", "Release Date": "May 7, 2020", "Developer Privacy Policy": "None", "Developer Terms of Service": "HomeTitlesAbout UsEventsEnterpriseBlog\n0\nShop Now\n\n\nCan Virtual Reality be Psychedelic?\n\nEarly research suggests that virtual experiences like SoundSelf can produce similar states to those measured during Psychedelic experiences, benefitting player's overall sense of wellness.\n\nRead Study\n\nExplore Inner Dimensions\n\nNo drugs required. This digital meditative experience provides the benefits of a psychedelic journey without the associated anxiety.\n\nExplore\n\nTransformative Entertainment\n\nThe first publisher to super-serve the growing interest in mindfulness and wellness with transformative content and virtual entertainment experiences.\n\nNewsletter\n\nExperience Embodiment\n\nCatch gems, ride ribbons, find your dance flow in this energetic, super-challenging rhythm dance game.\n\nDance!\n\n\nCan Virtual Reality be Psychedelic?\n\nEarly research suggests that virtual experiences like SoundSelf can produce similar states to those measured during Psychedelic experiences, benefitting player's overall sense of wellness.\n\nRead Study\n\nExplore Inner Dimensions\n\nNo drugs required. This digital meditative experience provides the benefits of a psychedelic journey without the associated anxiety.\n\nExplore\n\nTransformative entertainment news\n\n\n\n\n\n\n\nVideo games can be a healthy social pastime during coronavirus pandemic\n\nUSA Today\n\nVideo games are being prescribed as a recommended treatment for our ongoing homebound existence, brought on by the coronavirus pandemic...\n\nRead More\n\nVirtual Reality Can Replicate Mystical Psychedelic Experiences, Study Says\n\nMerry Jane\n\n...Some computer scientists are trying to find ways to simulate the best parts of tripping without ever needing to dose anyone on anything. Read More\n\nWellness Travel Gets A High Tech Upgrade\n\nForbes\n\nVirtual reality spa treatments, ultrasound therapy, and data-driven wellness retreats are trending in Hawaii. Other destinations will soon follow. Read More\n\nDo You Honestly Find Spas Kind of Boring?\n\nNew York Times\n\nWith virtual reality headsets, some clients are now being not just pampered in place but transported.\n\nRead More\n\n\n\nJason Silva (video) on The Future of Medicine\n\nInstagram\n\nMedicine is becoming an information technology. Genetics is a language, and data analytics will give us unprecedented insights over our health. The future is healthy. Read More\n\nHow Virtual Reality Meditation Helps Me Control My Anxiety\n\nHealthline\n\nIf you had told me a year ago that my favorite relaxing activity would involve strapping a computer to my head to immerse myself in a virtual world, I never wouldve believed you.\n\nRead More\n\nOxford VR Picks up $12.5M in Funding for Its VR-based Therapy Platform\n\nRoad To VR\n\nVirtual reality therapy startup Oxford VR today announced its secured $12.5 million in Series A financing to further its research and development into VR-based therapy programs.. Read More\n\nPsychologists Are Using VR To Transform People Into Animals\n\nVR Scout\n\nPsychologists are working to understand how VR can be used to transport individuals into different bodies, and if it is possible to do so with animal avatars. Read More\n\nSee More News\nor\n\nVisit the Observatory\n\n(our curated news blog)\n\nTransformative games\n\nWe want you to know that games are good for you. You began life by discovery through play. Lets awaken the world to the understanding that games are the tools of mind-building and self-expression.\n\nTITLES\n\nIMMERSIVE experiences\n\nImmerse your patrons in wellness entertainment with our lounge designs for your event\n\nevents\n\nThe Observatory\n\nA bi-weekly look into the collision of technology and wellness, as well as news about Andromeda, our upcoming titles, announcements and events. [...still migrating...]\n\nBLOG\nJoin our newsletter\n\nA front row seat to the collision of wellness and entertainment, right in your inbox.\n\nSend it my way!\nPowered By ConvertKit\nBack To Top\n\nContact Us\n\nhello@enterandromeda.com\n\nPress\n\nAudrey Mann Cronin\n\nPress Kits\n\nInvest\n\nrobin@enterandromeda.com\n\nView Deck\n\n\n\n Andromeda Entertainment 2019\n\nPrivacy Policy\nCookie Use\nWe use cookies to ensure a smooth browsing experience. By continuing we assume you accept the use of cookies.Learn More\nAccept\nNo Thanks\nCookie Use\nWe use cookies to ensure a smooth browsing experience. By continuing we assume you accept the use of cookies.\nAccept\nLearn More", "Space Required": "1.10 GB"}



["5 stars\n77%\n4 stars\n15%\n3 stars\n3%\n2 stars\n3%\n1 star\n2%", "meg.goudy13 days ago\nFavorite new fun workout.\n\nI have the majority of rythm, dance, get sweaty type games and this one is by far my favorite. I like that there are so many options- like full song or condensed song versions as well as three levels of play- beginner through advanced. It's a super fun workout and although I'm not an EDM listener I am addicted to this playlist and the visuals are amazing. After I master the dozen or so songs available, I am going to upload my own music and make some challenging songs to play. Download Audio Trip and bust a move ;)\n\nHelpful | 7", "svish_11 days ago\nDance game for people who can't dance\n\nI've struggled with AvPD, anxiety and depression my whole life. Because of a super high level of self-consciousness and self-critics, I've been unable to move in any sort of way resembling dancing. Tried the Dance Central demo and my body basically shut down after like 5 seconds. \"Nope, not gonna happen, not doing this\".\n\nAudio Trip on the other hand makes it feel so natural. Never experienced anything like this before. First time I tried it, I just couldn't stop until I had been through every single song.\n\nI would say, for people like me, who can't dance, are super uncomfortable with their own bodies, and very \"locked down\" ... this game is really great. \n\nHelpful | 4", "tp4cornholio9 days ago\nSo addicting!!\n\nThis is such a great game. I have played pistol whip, beat saber, synth riders and while they are all great, nothing works me out quite like this game. I really get into the music and the movements and three songs in and i'm dripping . The music is super catchy and just when you think the workout is over it kicks in again and.pishes you more.\n\nThe only two things I think need improvement are:\n\n1. There are not enough songs. I heard you can upload and create you own Playlist but I have no idea how to do this and it may be above my technical ability.\n\n2. When you miss a note or run into a barrier it's way to loud and distracting. The misses should be more subtle as they really distract me and throw me.off my groove.\n\nOverall great and qould be near perfect with the above tweaks. Love it!!!!!\n\nHelpful | 3", "SubArtificialJul 1 at 3:08 AM\nMost intense Dance/Rhythm Workout\n\nI have played most of the dancing and rhythm games so far and in terms of calorie burning Audiotrip is the most intense sweat inducing game by far. The audio-visuals are impressive and you can really enjoy the immersion. After a few songs you will most likely feel why the game is named AudioTRIP.\n\n\nRight now, I believe there are only like a dozen tracks available which is the sole negative aspect. Players definitely want more tracks here and maybe more different music genres. However, you are free to create your own choreography for each of the available tracks and thus customize your experience. And afaik, the creators are already on their way of adding new songs. Can't wait for it. *thumbs up*\n\nHelpful | 18", "OonaLeFae15 days ago\nDance dance dance\n\nThis is soooo fun! I really love the music and the creative ways I can dance with it. I might like this better than Beat Saber if there is more music added. The music is great!...there just needs to be more. I don't know if I'll get into adding my own music and choreographing but I can see that being appealing to others. I'm hoping they'll continue to add music and new Trips regularly. Overall, it's a great workout if you make it one and it's really fun.\n\nHelpful | 2", "unq15 hours ago\nUnexpected good\n\nI bought it for workout, and it does its job well: you need to move whole body, songs are long and workout has good pacing. So if you are looking some workout motivation, Audio Trip did the trick for me. Because it's a good game. I have 3 other music based games, but I don't play them anymore. Songs are great, levels are challenging and graphic is just beautiful.\nThere is a bunch of features I don't rate, because I don't use: build-in editor, ghost (I turned in off), some fitness-band integration. Game is good without them.\n\ngameplay: 5/5,\ngraphics: 5/5\n\nHelpful | 0", "ansonort2 days ago\nLove it!\n\nI have Beat Sabre, I have Synth Riderz and I have this. Each has its own vibe and each requires a slightly different skill set, although all of them are about swiping out at objects flying towards you at high velocities. Of the three, Id say Audio Trip offers the best overall work-out experience. I like the holographic dancer in front of me (though Im not ready to pick out curtains yet!). This is quite a clever idea because it gives you an idea of what to do with your feet which is often a problem with shoulders-up VR games.\n\nYou do need a lot of lateral space to play Audio Trip. Not much front and back movement so make sure you clear the furniture and tripping hazards either side of you for at least four feet.\n\nOverall, great game and one that will become part of my Covid-19 indoor fitness regime along with FIT-XR.\n\nHelpful | 0", "Graham808May 28 at 7:54 AM\nGreat !\n\nSo far this is the best rhythm game I have played. It's extremely good exercise as you need to move \"dance\" and is very challenging. The graphics are fantastic from the menu system to the in game graphics very slick and polished. The menus are very intuitive and allow the configuration of the game to suit. Im surprised that Beat Sabre still gets such praise when there are just as good if not better games like this. I prefer the workout this gives in comparison with Beat Sabre however I still like Beat Sabre but come back to this game more. Basically you move your body and arms to touch and hit shapes heating towards you and duck and dodge out the way of walls. Yes sounds similar to beat sabre but it is different and requires much more movement these movements are very dance centric rather than holding swords and swiping. A great game very recommended\n\nHelpful | 43", "TVL19774 days ago\nDance workout!\n\nStarted of with Beat Saber... Over to Synth Riders.... And then this came along and I was wondering, do we need another rhythm game. But I was curious, and the price was ok.\nAnd I'm very surprised how good it actually is.\nVisuals are very nice, very futuristic, and on a fast pace. Also more sharp then in synth riders for example.\nNot a lot of songs for the moment (although more songs are on the way), but the quality of the songs are so much fun to dance and move to.\nFew songs in and I'm already getting into a sweat.....Total dance workout when you start to play with the regular levels. Will need more practice before I even try to get into expert.\nSo yes, I guess I might have a new winner on the rhythm games category.... And I hope they keep updating it with new stuff and songs.\nThe only negative is when the walls are rapidly following up on eachother, you don't really have the time to move or duck..... You almost have to make unsafe body moves.\n\nHelpful | 0", "DoktorDeathJun 25 at 11:05 PM\nI cant even dance and I love it!\n\nPossibly the best music rhythm game on the Quest. It makes your body move, your heartbeat fast, and you just rock out and enjoy the game. Im not a dancer but it feels like Im really dancing as I dodge, weave, punch and glide to avoid and or hit stuff in time with the music. Captivating graphics and music that takes you to another world. I love games like this where Im exercising without knowing Im exercising! Thanks for the YUR watch integration! Watch the calories burn. Almost a perfect game but really needs more songs as almost every review has said. I will not deduct a star for this as others have because the games is so amazingly good. Hoping for more songs in the future. Still a bargain without it. I recommend you buy this game now!!!\n\nHelpful | 8", "Batlin19 days ago\nRelaxing and energising\n\nWe play quite a lot of Beat Saber and BoxVR (now FitXR for some reason) here and I took a punt on Audio Trip without having high expectations. Before finishing the first track I knew it was a good decision. The fast-approaching objects and extended trails quickly pull you into a really fun and rewarding game that requires more dance-like movement than other games.\nThere aren't a huge number of tracks, but each one has three difficulty levels, and the hard ones are really challenging.\nApparently you can also add your own custom tracks, although I have no idea how the obstacles etc are laid out for those.\n\nIt's only been a few days of casual play but I'm definitely seeing this as my go-to rhythm / dance / light (aka sustainable) cardio game on the Quest.\n\nOne word of warning though: you really need a good bit of side to side space, maybe 2.5 metres. You'll have to frequently lean pretty far left and right to touch targets, and at speed it causes the Guardian grid to keep appearing (as it should when you rapidly approach the boundary). This can be off-putting and annoying, so make sure you have enough space.\n\nHelpful | 0\nDeveloper Response19 days ago\n\nBatlin, thank you so much for trying and playing our game! We're so glad to hear you're having fun!! Get ready for a new song about to drop very soon. We're putting the finishing touches on it now. And one note - when you install your own songs, you can create any choreography you like for them, or copy any moves out of the ones we've created in the game and paste them in your own songs if you need some ideas to start. Come chat with us and other Trippers / Choreographers more on our Discord if you like - http://audio.chat Happy dancing!", "rambo.karen10 days ago\nBetter move flow\n\nI love this game better than sythrider because the moves flow better and make more sense. They follow natural arm movements and the workout is amazing. I hope that they will add songs, I cannot plug my quest into a computer to download additional songs.\n\nHelpful | 1", "CaptainObv18 days ago\nOne of my favorites\n\nThis game has some of the best elements of of Beat Saber, Synth Rider, and Just Dance. All three are great games but for me this hits the sweet spot. Only had it for a couple of days and its already one of my favorites. So much fun.\n\nThis is one of the only rhythm games where I would hands-down no-doubt buy an expansion pack. Hopefully they add more for free but if not Ill buy to support these developers.\n\nGreat job, Devs! You nailed it.\n\nHelpful | 0", "ForbiddenWhidden24 days ago\nOh yes\n\nOmg yes this is the best workout ever! I have focusing issues so whenever I try to go to the gym I always dip out too soon because of my focus and lack of energy. But dancing my way to sweaty dripping weight loss is perfect for me! I love the drums. Also when is more track options coming out?! I cant wait for an update!!!! Ive been playing each song a thousand times! Also I must say the graphics are phenomenal!!! Beyond phenomenal like I cant even!\n\nHelpful | 0\nDeveloper Response24 days ago\n\nHey ForbiddenWhidden, were so happy that you are enjoying yourselves on your weight loss journey! We promise that new songs will be coming your way soon! Meanwhile you can join us in the Discord community server if youd like to engage with the community and keep up with our updates: http://audio.chat <3 Kinemotik", "kibermiafJul 30 at 10:37 AM\nFeel the joy of presence and spread it\n\nQuest has been my workout and dancing machine for a year now. I have done all tracks + bonus tracks in beat saber on expert. I've been in love and dissapointment and love again with Synth Riders, I'm in top 1k in every track of Pistol Whip. Audica.. let's not go there.\n\nBut this is it. A single track has brought tears of joy and laughter to my eyes. A feeling of ecstatic freedom that I've felt on big festivals. Music is my drug and this is hands down the best way to administer it.\n\nBtw, the track was Rafael Frost - Red. I bow down to the creators of the environments that appeared in the latest version. They have made it all click on a level I've never experienced before.\n\nTL;DR: If I lost my Quest, and suddenly this game (in its current iteration with unbelievable visual artwork that has been introduced recently) was the only game you could play - I would buy still buy the headset.\n\nHelpful | 1\nDeveloper Response24 days ago\n\nWow kibermiaf thank you so much! Rafael Frost's RED is very special to us - it's the song that inspired the whole game! We're so glad it brings you joy as well. Thank you for leaving your kind words and for your support. Glad to have you on this journey as we continue to develop the game! <3 Kinemotik", "BluahBluah25 days ago\nMost intense workout so far\n\nI've tried almost every rhythm/dance/workout type game and I would say this one has the most intense workout capability. In fact, as someone who is quite out of shape I don't end up playing it much right now because it is a bit too intense for my current fitness level. I'm still giving it 5 stars because when I do play it is very well made and fun. I plan to incorporate it more as I get more able to keep up physically. If you are in decent shape and some of the other workouts don't seem enough for you give this one a try.\n\nHelpful | 1", "jackie.hearts.travelJul 24 at 5:24 PM\nI love this game but it needs more songs\n\nThis is my fav of the rhythm games by far. Its so immersive and the moves have you really moving in fun patterns. Its just genuinely fun. But there arent enough songs. Ive read that you can download an ogg file and then set your own moves to it and Ive made a few maps for their songs which is fun,...but 1. This is a side hobby for me so, unless its in bmbf and involves a click download, Ill never figure out how to do it and its not for trying bc ive googled it and Im still coming up empty. 2. Even if I could download it, I want the professional maps they make for songs.\n\nIts a blast for a game. Worth the purchase if you like rhythm games for fitness or dancing. But the number of songs and speed then provide more is underwhelming to the extreme. Its kindof an anomaly. How can they not create more songs at a faster rate. They tweet about making one song every few months, it makes you wonder if they have a staff of one, who also works parttime...if only they had more songs it would be the best.\n\nHelpful | 2\nDeveloper Response24 days ago\n\nHey jackie! Were glad to hear that youve been enjoying the hard work weve put into the game so far! The two of us are working diligently every day to try and bring new content and especially new music to you. Right now, we are still in development, however, we are aiming to have at least 20 full tracks in total so we hope you stay tuned for that! If you need some help with custom songs, weve recently made it simpler for you to install, configure, and choreograph your own maps, all in VR! If you need more information, feel free to head on over to our Discord http://audio.chat and chat with the community! Thank you for your support and for playing our game! Keep dancing! <3 Kinemotik", "musogeekJun 27 at 4:58 PM\nGreat game, great workout!\n\nI spend about an hour a day playing this game, and it really gets me moving. The music and scenery are hypnotic and the experience is very absorbing. I sometimes get lost in the music and dance. There are a couple of ways you can approach this game. You can concentrate on accuracy and achieving a high score, or you can get your whole body moving to the music. The included music is great, and the development is active, so you can expect a lot more in the future. I would recommend this especially if you like rhythm/dance games.\n\nHelpful | 4", "Nano114425 days ago\nLOOOOOVVVVVVE!\n\nThis \"game\" is all dancing. Even if you can only do the side to side shuffle, just have a good time and let loose. The more techno-style tracks have me yearning for my old rave days. It's a really fun app!! (Also a good workout, but I'm trying to hide it from myself that I'm actually working out and not just having fun. Shhhhhh...).\n\nHelpful | 0", "SwanVRMay 7 at 10:30 AM\nMy Form of Ecstatic Dance\n\nEcstatic Dance is my form of self expression.\n\nUntil social distancing ecstatic dance can be a thing again, this has been my solution to get moving while in times of stillness.\n\nIve seen this game transform and improve with each update. The VR dance editor is amazing in terms of replay-ability. :)\n\nDisclaimer: I am working with the amazing team with a female founder\n\nHelpful | 52", "Max_SpeedoJul 25 at 6:27 PM\nBest VR rhythm game, needs more songs\n\nExcellent game and the best rhythm game I have played for VR. However, the sheer lack of songs and content really damages the replayability. I feel like something like Audica just because of the amount of songs would be better, despite that this game feels a lot better to play. I hope the developers add a large pack of games either as paid or free dlc. Additionally, it would be ideal to add a mix of stuff, because I personally only like the heavy edm tracks, because feel like they are the most exciting and fun to play like Bangarang. But others might not feel the same. I really like rhythm games for VR, however I find myself coming back to stuff like pistol whip more because even though they don't have tons of song the gameplay is pretty fresh and exciting. I think Audio Trip is an amazing game, but I think it really lacks in content as it currently is and as a dancing rhythm game I think it could be a strong contender if it only had more songs to play.\n\nHelpful | 1", "dilanshahJul 26 at 5:45 PM\nSuper Crisp & Great Cardio\n\nSatisfaction & Golden Pineapple are such vibes in this app.\n\nI love that you can tell that theres clear choreography behind every tracks map. I use this with YUR & in between resistance training sets for cardio.\n\nLove this app.\n\nHelpful | 0", "LuckyLucas20128 days ago\nVery good\n\nThis game is so great to keep fit too! You feel you have done a great work out. Only negative I have is wish there were more songs. But over all brilliant, worth it\n\nHelpful | 1", "geebeekayMay 7 at 11:08 PM\nDance, Burn and Have Fun\n\nI just got Audio Trip and I must say that I love it! I bought Supernatural recently too and I have been a bit disappointed by how fitness focused it was vs. actually fun. The fact that Audio trip focuses highly on dance and rhythm is a game changer for me. Plus I am a big fan of the digital landscape you are put into, it's like a journey into your own body expression led by a colourful targets. It's an easy game to dive into. Once you get familiar with the movements you can put your own spin on them and dance like no one's watching\n\nHelpful | 18", "girlfriendMDJul 19 at 10:44 AM\nNeed more songs!\n\nThis game has been tremendous fun to play, and it's quickly become one of my favorite rhythm games. Certainly, you can see the number of great reviews here as to why.\nHowever, it's limited to 10 songs, and, well, I have to admit, I need more songs!\n\nHelpful | 1", "NotSoSrsMay 24 at 2:38 PM\nA heckin good Trip\n\nIve played a ton of music and rhythm games, and this is the only one where Ive truly felt like Im dancing and flowing to the music itself! Its such an energizing, fun, and hypnotic experience. The visual cues are ingenious and the hologram dancer is a lovely touch in helping to convey how you need to move without losing your concentration or flow. A must have game for any VR user!\n\nHelpful | 8", "Smog_The_ThugMay 7 at 1:51 PM\nIf you like synth Rider then...\n\nYoull love this!!!\n\nGame made very well, smooth and fun. Very similar to synth Rider. Has a lot more trance and dance music which is great for me. On the other hand majority of the song are around 7mins long. Which is good and bad. Good you get along trip, bad you miss a note near the end then you score is blown (if you care about your score lol) and have to do a 7min song again compared to a 3min song. Cant wait for more music to come. Just recommend having shorter song.\n\nHelpful | 26", "SeventhRayMay 7 at 10:43 AM\nWorth the price\n\nI play a lot of rhythm games, and Audio Trip is definitely worth the price.\nThe in-VR level editor is very unique and basically lets you map while in headset.\nThis game is much better than other rhythm games at actually pulling me into a dance flow.\nI would recommend this game to anyone.\n\nHelpful | 20", "MeerkatStuntsMay 27 at 9:08 PM\nMy new favorite rhythm game hands down!\n\nBuy This game now!!! It easily has the best fun to workout ratio I've had on the quest. Not only is the music so much better than all the other rhythm games, but it really forces you to move your entire body. I consider myself an athlete and I am absolutely dripping with sweat after just a few songs. The screenshots might make this game look similar to Synth Riders but that truly doesn't do it justice. This is the most fun I've had while working out in a long time and it is keeping me in shape during this quarantine. Now for some constructive criticism... Obviously it needs more songs but apparently they're on the way. I find during very intense moments it gets a little bit choppy. Personally I think it could use an expert+ mode. I beat all the levels on expert on day 2 and now I just try for high scores. Expert+ would really help the replay value. Expert+ on beat saber often requires you to learn the song on slow and ramp up the speed as you memorize it. That would be an absolute blast on this game. I can't speak highly enough about Audio Trip. I think in time after some improvements it has the potential to be as good as Beat Saber.\n\nHelpful | 6", "magic_snjorJul 6 at 8:24 PM\nFavorite game in my quest !!!\n\nI absolutely love this game. I just got my quest not to long ago and already this is my go to game. It is great exercise as you really have to move around. I do hope they get more songs as I would gladly pay for more music.\n\nAlso, if you are looking at this as a replacement /cheeper option then beat sabor just do it! Its way better and harder !\n\nHelpful | 0", "LshadowsMay 20 at 8:22 AM\nWhat a surprise!\n\nYou can make this game whatever you want it to be, but I found it to be a great addition to my workout regimen. At first I simply found myself pleasantly moving to the music, but after learning all the moves I switched it up to the next level. There I started realizing that in order to actually hit all the targets while avoiding the walls, I had to engage my core, squat, side lunge, stretch, and use my brain to stay focused! I very quickly found myself sweating and feeling my heart rate go up. Most importantly, I have arthritis in my shoulder, neck and back from an old sports injury, and this workout fits right into my need for low impact exercise.\n\nAs other reviewers have said, the selection of music is fantastic but limited so far. I work out daily with most of the active music/rhythm based games available on the Quest; Box VR, Supernatural, Synth Riders, Beat Saber, Audica, Pistol Whip etc. So when I read the description for this game I thought it sounded too much like Synth Riders. However, thanks to the reviews I read from several people who were surprised that it wasnt, I decided to give it a try. Im so glad I did!!\n\nCant wait for more music!\n\nHelpful | 6", "EmpressbJul 17 at 12:51 PM\nIt's a fun workout\n\nThis is more fun and a better workout than my boxing tapes. Psychedelic I only wish they would let you switch out the music for different music so you don't have to play the same tunes over Andover\n\nHelpful | 0", "mvmike18 days ago\nChoreography needs work\n\nVisually beautiful and great (if super tiny) music selection.\n\nBut PLEASE find someone to give the choreography some groove. In Beat Saber, you feel like an actual dancer choreographed things, you can get into a groove, the moves feel clever and heighten the experience of the music. In AT, I havent once felt flow  If you overhaul this aspect with something fresh and fun, you can unseat BS.\n\nHelpful | 0", "arthurthegr8May 10 at 6:03 PM\nGreat Gameplay !! Great Soundtrack !!\n\n5STAR FUN!!!!\nOnce you let loose, youre hooked.\n\nImpressive & unique gameplay that really motivates you to groove. If youre like our family you will trip out that you are actually dancing =)\n\nBeen reading great reviews about AudioTrip for a minute. So glad its finally wireless on Quest!\n\nHelpful | 10", "ChillahGorillaMay 20 at 11:52 AM\nSo much fun!\n\nLove this game! I never thought I would ever get a dance game, but I love the rhythm games on the Quest and decided to try this one. I think most of the songs are Electronic and EDM style music. I think they are perfect, but if you are hoping for more variety you might want to try something else.\nThe visuals are absolutely beautiful, they add so much to the songs. They seem to pulse and flow with the music, and each one is unique. They are beautiful and immersive and I believe they need to be experienced in VR. It has that addictive \"just one more song\" quality.\n\nSuper fun and an easy 5 stars.\n\nHelpful | 5", "robbieloseeMay 14 at 7:54 AM\nReally great\n\nPros: solid gameplay, great workout and its just a blast to play. What really takes this rhythm game to the next level is the beautiful design of your surroundings. There is so much variety even within the same song, and each song has its own little world of design elements. I especially like Red and Anemone. The choice to make the dodge walls slices of hexagons really works well as you can do leaning dodges. Notes are placed so it feels like a dance as much as a game. Seriously its just fun.\n\n\nCons: May be bad for photosensitive players (especially Red song). Not a lot of songs yet but given the amount of work they put into each Id rather they maintain the quality.\n\nHelpful | 6", "tfh74May 11 at 7:43 AM\nIts ok for now\n\nCannot understand why developers bring out games with only 11 songs? Surely they must know that the songs will get stale quickly because the choices are very limited. So what will happen next I ask myself and it will either be free song content which should be the case, or will it be song packs we have to pay extra for which is not a good idea.\n\nThanks to the developer for your quick response and it is great that the content will be free. I have now upgraded your game to a 4 star and once more songs are added then this will be a 5 star game.\n\nHelpful | 10\nDeveloper ResponseMay 14 at 2:35 PM\n\nThanks so much! Looking forward to having you play the new songs we're working on - coming soon! <3", "tzvika770Jun 30 at 12:26 AM\nIt's one of the best sweating game\n\nI love the music. I love the graphics. But it's only few music tracks. How many times you can listen to the same music.\n\nAlso the triangles are not so clear we're I need to hit them.\n\nAlso I can't find my personal record for previous.\n\nThe watch I can't register. It's to complicated.\n\nOtherwise I will give it 5 stars easily.\n\nHelpful | 1\nDeveloper ResponseJul 1 at 12:51 AM\n\nHello tzvika770, thank you so much for your generous feedback and support! The two of us are hard at work developing the game everyday through its Early Access phase, creating more Trips with more music & fun features to come! We'll also be bringing modifiers to the game soon, such as a Practice Mode; but you can currently edit any of the songs to have a slower speed to help you practice in the meantime using our Custom tab. And for the YUR watch, you will need to set it up the first time you use it by gazing at the virtual face to receive your setup code, then entering that code at http://yur.watch on your desktop - then you'll be all set to play from then on! We hope this is helpful. Let us know if you still have any issues on here or in our discord: http://audio.chat.", "vanskeligJun 19 at 9:46 PM\nthe best dancing!\n\nI have played a lot of VR rhythm games. For me, this is the one which makes it the most fun to dance, move around, and get sweaty. Not only does the game look good, but it is evident that real thought and planning went into the maps, which makes it significantly different from all the other movement games I've played which are basically a series of mostly nonsensical \"okay now put your hands in this random position\" moment.\n\nMy current exercise regime is basically to play all of the OST songs on expert every morning and it's just about perfect. I expect things to get even better when the about-to-be-released update makes it easier to use custom songs.\n\nHelpful | 1", "SyddieJun 20 at 6:01 AM\nEstatic - a reason for living!\n\nI am absolutely addicted to this. I cant overstate how good I feel playing this. Beautiful clean graphics and this makes even clumsy old me feel like I can exercise and dance at the same time. I used to love Synth Riders but after this I cant go back to it. Three difficulty levels. Easy is only until you are used to it. I have been playing for weeks now and I still find regular enough and so exhilarating. I have all the Quests exercise games and this is THE BEST!!\n\nHelpful | 1", "edshigakiMay 9 at 9:24 AM\nYou really dance!\n\nI loved the way they mapped the songs, with a lot of barriers and you have to go to the ground, bend to the sides, great hand positions! It's nice to hear some famous songs (rare in other games) and I like the way we can see a dancer so we can predict some movements and add a good flow to the dance. It's a Synth Riders with good mapping songs.\n\nCons:\n- It's terrible that beat saber, audica, synth riders and audio trip uses diferent colors for right and left hands, it gets very confusing!\n- Very similar to Synth Riders\n- Few songs\n\nHelpful | 11", "Chris.Becca11May 14 at 11:35 PM\n\nLove this game.. love that when I play this I can dance how I want to. And have a blast and I love the songs.. I want more of the longs songs.. I love push my limits to a longer more challenging song.. I love the new update.. I live that you can choreograph your own dance moves.. they have a new challenge out, some one who comes up with a new dance choreograph, someone will win $1,785 dollars.. that is so awesome.. IAM going to do my best to keep practicing a dance and make sure I come close or the winner.. they will be coming out with more songs more theme and I can't wait.. IAM so excited.. this is my jam game.. everyone get this game. You will not be disappointed.. love it.. I can play this all day with out getting tired.. but also make sure you get in on this contest!!! Best of luck to who ever wins this contest.. please support this game it awesome.. sorry I can't say enough about this game.. you Rock Audio Trip.. thank you for making this game...\n\nHelpful | 5", "NinaKuhlJul 15 at 11:26 PM\nA work out!\n\nFun. Exertive! Have water near you!! Itll MAKE YOU SWEAT! Still wish Oculus with stop playing with us and start making the viewers so less bulky! You can do it!\n\nHelpful | 0", "greeunkMay 7 at 4:39 PM\nAll Around Best Beat Game*****\n\nVery rewarding and addictive! Who knew I would ever be caught dancing?! - Or how fun learning to would be!\n\nI was expecting another beat saber game, where I feel more like a lazy drummer. THIS is NOT that. AudioTrip forces you to move to get though.\n\nYoull know exactly what I mean, after you get over the embarrassment of moving your butt!\n\nLove It!!!\n\nHelpful | 7", "bassowJun 18 at 4:11 AM\nPublish DLC so I can throw money at you!\n\nI have written several reviews and I don't think I have ever given 5 stars before. I give this game 6. Better interface than Synth Riders (which I refunded), better dancing than Dance Central and better music than Beat Saber. The choreography is really pretty cool and if you like dancing, you will hit that flowing high. I absolutely adore this game and only wish there were more songs available (though quality over quantity is really true here: the music that is included is awesome).\n\nHelpful | 1", "flowseanMay 9 at 9:45 PM\nEpic mental and physical reset!\n\nIn just one short song I feel my heart pumping, biochemistry activating, and mood soaring. worth the cost of the oculus quest for this app alone!\nMy wife and I have very busy lives, we have almost no time for ourselves and when we do were too tired to do anything fulfilling. weve known for years that we need to incorporate some physical activity into our lives to improve our overall mood and energy levels, but cant seem to make the time. then we experienced audio trip, and fit at least a few songs in almost every day, its life changing. we've both played a lot of beat saber and some of the other dance and rhythm apps and Audio Trip is our favorite! and we love the choice of songs, visuals, and movement design.\n\nHelpful | 6", "andersonkodiMay 13 at 8:42 PM\nHolly Shhiii..t \n\nTook me forever to buy this game , Honestly, High commotion on a single game really puts me off , just sounds fake. Also, I've have them all (Box VR, Creed, Boxing whatever, Drunk fighting Bros, etc. ) and thought \"It was simply more of the same\" So, I Bought today, on my third song I was like \"FU... Ing YA!!\". My First VR game was a CardBoard very first week generation. Honestly, been bored about all the games similarities. If you like dancing or used to when your knees were not fcked up, or hidden in the showers pretending you're famous, go for this one. It's been a while since I had so much fun. Using our own songs one day, maybe ? Please Pretty please with sugar on top? Anyway, keep up the good work\n\nHelpful | 5\nDeveloper ResponseMay 14 at 2:18 PM\n\nHaha wow, thank you for the high praise! And we know about bad knees... One of the two developers and choreographer of the game has had three knee surgeries and is now dancing again for all of you! It can be done! Also - you can upload your own songs to the game now, and we are working on integrating more options for this in-game as well. Check out our discord (http://audio.chat) in our #about channel for more info. <3", "robertspannMay 9 at 9:58 AM\nIt will make you sweat, but smile more.\n\nAudio Trip has been a great experience. The music is engaging, the built in choreography for the songs is really fantastic, and it will absolutely get you moving. The User Interface is clean and easy to navigate, the dance queue visuals are easy to see and interpret, and the feeling of rhythm with all it tied together is really enjoyable. I don't know if it's the music or the choreography, but I found myself moving naturally in more of a \"dancing\" fashion than I would have initially thought - and I am not at all a natural dancing type.\n\nAfter about 30-45 minutes I have worked up a great sweat and heart rate. I can see how this game is recommended elsewhere as a good workout experience in VR.\n\nDefinitely worth the buy if you're at all interested in rhythm / dance games!\n\nHelpful | 6", "Verbalicious79Jun 15 at 12:51 PM\nGet ready to MOVE\n\nIf you want a rhythm game that really gets you moving and your heart pumping, this is it!\nThe game is a trip, with very cool environments and top notch songs to dance to. This game is not for the casual gamer though. You are going to be tested and challenged in speed and endurance. I am sweating bullets by my third dance, but I keep coming back for more.\nGreat job to the developers. Cant wait to see whats coming next.\n\nHelpful | 0", "KayewinJul 23 at 7:23 PM\nSuper Rad!!\n\nThis game is my all time favorite at the moment. Great songs and choreography! Such an awesome trippy workout!\n\nHelpful | 0", "BersteakJun 14 at 9:22 AM\nThe best for me\n\nThe game is well done, it makes you move as expected. (More than beat saber)\nThe big downside of the game is the lack of songs (only 11 right now...) but the mapping of the songs is good and makes you feel the music.\nToo few songs for now but more will be added (it is planned). I'm sure with the sucess the devs will added even more content.\n\nTo the devs : When i choose a songs, i'd like to see how many stars i have already earn.\n\nEdit : after playing a lot to synth riders, beat sabers and oh shape. Audio trip is my favourite. The mapping of the song are so smooth and make me feel so much the music... Please give me more songs !!!\n\nHelpful | 0", "cgisloveMay 7 at 10:34 AM\nOff the charts awesome! YES!\n\nThis team of developers gets it. Fast paced, great music and a beautiful interface make this a must have app! Grateful to have access to this app... Just a couple of songs and I'm in a sweat. It really gets the heart pumping! So good! YES! Thank you!\n\nHelpful | 9", "mogly.speixJul 17 at 12:34 PM\nXTRA\n\nMAGIC powerful motion trip\nINCREDIBLE game feel\n+ in-VR level edtor  GREAT!!!\n\nhand tracking & spin mode requested :-) \n\nHelpful | 0", "Skelly50May 27 at 12:09 PM\nLove it!!\n\nThis game is one of the best music, beat & dance games I own. I get a good aerobic workout playing this game. I have 2 issues with game. 1st is more songs needed desperately. 2nd is operational, since OS update to 17.xxx this game sometimes has video glitches. Some random patterns show up in the Quest lenses when I finish a song.\n\nHelpful | 2", "jramonromeo17Jun 28 at 9:47 PM\n\nAmazing best game I played I was very pleased with every aspect of the game. People that want to get in shape try this now!!!!!!!!!!!\n\nHelpful | 2", "LaggniapeJul 19 at 5:54 PM\nWay to Fast to be Enjoyable\n\nThere is a beginner button, but there is NO beginner mode. This game is so so fast. I tried many times to play and it gives me no opportunity to get used to it. I am new to this and I just worked my way up to normal on Beat Saber. At least it gave me the opportunity to work my way up. If your young and fast you will like it, The game play is pretty great, the graphics are great. It's good if you already have the skills to crossover with from other games. If your just starting motion/dance games I recommend you start somewhere else until you can transfer a developed ability, or until the developers add an additional slower level. This is unfortunate because it alienates a large demographic . I debated on returning the product and decided to keep it because it is a good game and concept, and I may develop better reflexes with Beat Saber and Oh Shape enough to come back and try again later.\n\nHelpful | 0\nDeveloper ResponseJul 22 at 7:41 PM\n\nHi Laggniape, thank you for your feedback! We are sorry to hear that you're having difficulty with the speed of the songs. Have you tried playing the songs with the No Fail option turned on yet? If you turn that on, you can play through the song without worrying about failing and it should give you a chance to practice or get used to the gem speed. If that is not what you're looking for, we also have a Custom tab where you can edit the gem speed of any song you want to play. Currently, we're also in the process of developing features that will enhance customization features and help make practicing songs easier for you in future updates. In the meantime, feel free to join our friendly community over at http://audio.chat - Come talk to us more about the game, ask for tips, or share your gameplay! Were always on there chatting with players as we develop the game. Thanks, and have fun dancing!", "ET3DJun 19 at 12:33 PM\nGuided free form dancing\n\nHaving strained my shoulder recently, I found OhShape, my favourite game, a little uncomfortable to play. I decided to try Audio Trip because it was less demanding.\n\nOhShape is like a martial arts kata or ballet, requiring accuracy and control. Audio Trip is more like free form dancing. Your hands are directed to touch specific points (luckily, at least for the levels I tried, most don't force movement direction), and there's a figure dancing on the screen, showing what is expected, but you're free to move your body freely as long as your hands are in the right place.\n\nThis freedom, the lack of hectic directional movement of the likes of Beat Saber, and the repetitive wave-like guiding of the hands do make me get into the rhythm and feel like I'm dancing. The music isn't really to my taste, and I think that highlights even more how well the game does getting me into the groove.\n\nIt's not a great workout, and the choreography is full of repetitive movements. I found it similar to Dance Central in this respect, although unlike that game I found Audio Trip fun. You just move side to side (and occasionally duck) and hands are mostly in front of you. There's nothing like the stress on the body that OhShape puts, and also the choreographies are a lot more basic.\n\nI don't think I'll play it a lot, but I decided not to refund it (which I did for Dance Central) because I feel that it does something nice.\n\nHelpful | 0", "DakkardJul 15 at 10:47 AM\nMore polished than Synth Riders but....\n\nThis game is excellent, the quality is is fantastic and it's really good workout but it really, really needs more songs!!\n\nHelpful | 0", "VlaadaJul 28 at 11:19 PM\nSorry... boring\n\nIt is almost unfair to write it, as I feel lots of care behind the app, but well, I found the concept itself very uninspiring and dull. The charm of beatsaber is not there - although you would say it is the same, it is not. The act of swinging of the sabre is much more satisfying - and creative. The variety of positions and moves that result in cutting a cube in two by the end of your sabre is just way higher and more interesting than the postions where you touch certain point or follow a line. Where BeatSaber is about intuition and fun, this is about drill and obeying exact instructions accurately. I was bored after two songs. I tried higher difficulty (helped a lot in case of Pistol Whip)... but then, AudioTruip was just more difficult and still boring. I am going to refund it, but as I have said, it is not completelly fair, as BeatSaber just put the bar too high for these games...\n\nHelpful | 0", "Aaronb3434May 7 at 9:47 PM\nAwesome\n\nWell to get straight to the point this is a really cool app so far and it haves a lot of potential. i like how each song haves its own ride and environment which is really cool and the option environment looks cool as well. anywho heres some suggestions for the devs\n1. let users upload audio\n2. Add a futuristic city environment with flying cars and a rollercoaster type environment.\n3. option to disable/enable those red obstacles.\nLook forward to awesome updates and improvements.\n\nHelpful | 4", "BrittaMcMorranJun 5 at 7:31 PM\nOutstanding\n\nA great game, fantastic execution and a really cleaver combination of already learned VR skills that adds something to the whole genera. This has become by go-to fitness game and as more tunes are added I can't see looking back.\n\nOne Specific bit of info about the game that might make a difference for you. The 'Dance' part of the game is minimal. Sometimes the way you have to move to hit beats and dodge barriers 'feels' like dancing a bit, esp when the movements are in easily discernible repeating patterns but i wouldn't call this a dance game really. I do think once you get to know the beat maps you could probably add a lot of your own dance movements but its not necessary to play well.\n\nThank you Devs for this. Its a great game and I look forward to playing this every day.\n\nHelpful | 0", "jiminyrizzlesMay 12 at 7:54 AM\nSuch a buzz!\n\nIf youre a fan of rhythm games and/or dancing or you just want another game that helps you be active in a fun way then you need to try this. It looks great and plays so well. The mapping for it is excellent and flows beautifully. Im a huge fan of vr rhythm games and play beat saber, synth riders etc a lot and this immediately jumped into my #1 spot. The devs have done a great job on this. If they are able to steadily add new songs this will be near perfect.\n\nHelpful | 3", "Flow_PoetJun 2 at 3:00 PM\nBeatsaber = Luke Audio Trip = Yoda\n\nAs a movement artist I was ecstatic to find Audiotrip. With the variety they included for different types of movement with their hits/drums/snakes etc. They have taken the musical movement and workout game genre to a whole new level!\n\nI used to play Box VR and Beatsaber every day for my workout and now I have a hard time choosing anything but Audiotrip.\n\nIt can be a little confusing when you first start playing because of the innovative design, stick with it! After you get the basic muscle memory down a whole world opens up.\n\nMy only constructive feedback is I want MORE levels!\n\nI love the challenge! I love the complexity! I love the cosmic background art! I love Audio trip!\n\nHelpful | 1", "mattboomMay 9 at 9:28 AM\nAnother Fun Rhythm Game\n\nThis is similar to Synth Riders but a bit harder. If you like rhythm games like Synth Riders and Beat Saber, youll like this one.\nI like this one better than those other two as far as getting a workout, as it has more walls to duck and move out of the way from.\n\nHelpful | 4", "pulseONEMay 10 at 5:17 PM\nGreat Up and Comer\n\nHaving played both this and Synth Riders I can say that I prefer the song choreography as well as the visuals and different kinds of movement you need to do in Audio Trip more.\n\nThat said, Synth Riders allows you to download and create new music into the game, giving it potentially far more content and variety on that front than Audio Trip. Although Audio Trip does allow you to create your own choreographies as well, you can only do it with the songs already included in the game.\n\nAdd in a level editor where people can import their own music and you guys will be golden\n\nI'm looking forward to any new songs either way (man imagine if you guys got a Noisia song... That'd be amazing!)\n\nHelpful | 4", "jesseytohJul 23 at 10:37 PM\nAudio trip\n\nNice game.\nReally sweat it out.\nThumbs up.\n\nHelpful | 0", "leah.wolfe.96May 25 at 4:13 AM\nSo Much Fun!\n\nI never write reviews for games because I'm not really a gamer, I just play as an escape after work, but this game is a blast! I have the other dance games and they don't even come close to being as challenging and as much fun as this one. I don't know about the workout part of it though because although it does raise my heart rate and make me sweat, I am at the age where just going for the mail does that! I did encounter one problem after the update though, it no longer shows my name on the leaderboards with my friends so I guess my trash talking days are over unless you guys can tell me how to fix that? Great game guys, I play it every day, thinking about getting rid of my furniture to make more room!\n\nHelpful | 1", "CameraLenzMay 8 at 10:33 PM\nSo fun, so sweaty lol\n\nIts so easy to sew now with this game. I love it. Is it perfect? No. But its very close. Id like to see a lot more music in the future, and more genres. This game feels like the cousin of Synthryders. But I love how much customization Synthryders has.\n\nWould love to be able to add custom songs and use the beat creator program it comes with to make my own experiences. But man, from the first song I had a blast! Would love to hear a bunch of Dub Step and also some metal or hard rock tracks in there eventually. Greya job Devs! DLC ME PLEASE!!!!\n\nHelpful | 2", "robashcorlettMay 8 at 10:48 PM\nA Good Variation on Rythm Games!\n\nWasnt really expecting much from this as I already have Synthriders. I was pleasantly surprised!! Although the premise is fundamentally the same there are some unique differences that make this a good purchase. The variation of hit strokes with direction and smash adds variety and the range and distance of the notes makes you really stretch. The option of the having the dancer in front of you flagging the moves is a nice touch. The environments are interesting a bit like being in a psychedelic disco! I havent tried the editor yet but that also seems to be an interesting way of adding variation. The only thing at the moment that lets it down is the limited amount of songs. The developers say they are working on more but it would be fantastic if you could add your own mp3 files and have them mapped in the game. You get a really good workout playing this and I look forward to the addition of more songs.\n\nHelpful | 3", "MadMax1998May 8 at 10:13 AM\nThe game to get you moving\n\nI've been playing Audio Trip for a while on PC and can say that the Quest version is superb in every way -- good resolution, nice graphics, solid tracking and the gameplay remains exactly the same. They've even made the leaderboards cross-platform so you can challenge your friends who play on PC!\n\nAudio Trip was my first rhythm game. I am NOT a dancer at all, rather I'm a drummer, so rhythm to me is important and the first and last thing Audio Trip does right is nailing the note timings! Kinemotik's Ashley, who is a professional dance choreographer, made sure the notes in this game's \"trips\" were on point and on the beat. You'll be able to really feel your way through the trips after you've had a few practice runs. The choreos are, for the most part, pretty intuitive and I do feel like I'm making stage dance moves with my arms from time to time. The tight timing of the notes amplifies this and makes you really feel the music and the beat!\n\nThe only criticism I can level at the game is that the jump from \"Beginner\" to \"Regular\" skill level is substantial and I still feel overwhelmed by some of the \"Regular\" choreographies. Some note placements might need adjustments too.\n\nConsidering that Audio Trip is made by two people, they've made good progress since the days of early access on PC, and they have big plans for the future of the game. They are receptive to suggestions and feedback on their Discord server. The (small) AT community seems very nice and communicative too, which is important since the game's new in-VR choreo tool will allow anyone to build new choreographies for existing songs (and new songs, later) and share those with others. This again sets Audio Trip apart from other rhythm games!\n\nIf you're looking for something that makes you move after a day at the office, get this.\n\nHelpful | 2", "ouimet.robertJul 16 at 9:34 AM\nGood application\n\nMusic should be better. When we do cardio in a gym is much better.\n\nHelpful | 0", "MakusheMay 14 at 5:15 AM\nFun Times!\n\nI wanted to keep playing again and again after a couple tries to get the hang of it. One star missing because Id like to be able to use my own music or simply have more variety.\n\nIm sensitive to motion but Im doing fine with this, even though the illusion of speeding forward is in effect. Theres a curtain feature to help alleviate the fly-by feeling but I prefer not to use it.\n\nI dont mind the sceneries but of course variety will keep the game fresh for people to continue coming back to.\n\nHelpful | 2\nDeveloper ResponseMay 14 at 2:25 PM\n\nHi there - Thanks for your feedback! There currently is a way to add your own songs to the game - see our discord (http://audio.chat) in the #about channel for more info. We're also diligently working on integrating this more smoothly into the game to do so in-headset, so that should be a much easier option too! We also have a whole channel dedicated to song suggestions and would love to hear your input as we continue to choreograph and create more levels for the game as we develop. Thanks so much, and so glad you're liking it so far!", "Bongman79May 12 at 9:50 AM\nGood game but needs more options\n\nI've had a few goes on this game and I do like it, however there are a lot of levels I cannot get to the end of because I'm a wheelchair user, it scales to my height ok but need the option to turn off the obstacles like in beat saber and Synth Riders which I can play fine, I can just about manage to move left and right a little to dodge the virtical ones but the horizontal obstacles you need to duck under is physically impossible for me... please developer add this option and the game will be more accessible for all and I will give the game more stars, thank you.\n\nHelpful | 9\nDeveloper ResponseMay 14 at 2:04 PM\n\nHi there - We hear you! Accessibility for as many players as possible is a high priority for us, and we are currently working on modifier options to release in the near future, including the ability to disable barriers. We love suggestions like these on how we can improve the game. And we cant wait to hear what you think once we drop the modifiers! Thanks so much for taking the time to leave your feedback. And were glad to hear you are liking Audio Trip so far!", "leogoldseedJul 11 at 7:57 PM\nAmazing fun trip and workout\n\nCan't get enough of this game\n\nHelpful | 0", "T1gerstyleMay 7 at 3:30 PM\nBest Rythm Game Yet!\n\nIntense and Fun. You really feel this one! Unlike beat saber and audica, you cant be lazy. You have to move it or lose it. All of it!!\n\nHelpful | 7", "hawkericsonMay 25 at 3:11 PM\nNeed more songs\n\nAbsolutley LOVE THIS GAME...just one isue ...can we get more songs soon please... I love the fact there is skrillex on this game ...and would love more from that artist AND genre\n\nHelpful | 2", "AviboyMay 21 at 10:49 PM\nA breath of fresh air. Im keeping it!\n\nBeautiful graphics, reminds me a bit of Thumper. Love the music especially the tracks that also appear in Beat Saber/Audica, but it needs more, hopefully they will come soon. Well done guys!!\n\nHelpful | 2", "GlitchMaster400May 10 at 7:59 AM\nGreat visuals highly recommend\n\nI like what I see so far . As noted definitely needs a lot more songs . Good to read that there is more to come . I see so many audio games and many times I came away thinking it had potential but did not go anywhere for my taste so will see how this goes .\nI am huge for sound effects and feel this could use more . I was hitting the normal notes . Next came notes I had to hit in a direction and no difference at all to hitting a normal note . Same for the notes you hit hard no difference at all .\nExample might me a small sound hitting normal notes . Hitting directional notes would be a bank or pop of sorts . Next the note you have to hit hard . Possibly a shattering and explosive sound for that . Just examples . Being a game of sounds . Extra effects can add that extra wow factor .\nI tried a couple songs and liked the grooving side so side , ducking down , and arm movements following the trails . What about an extra sound effect when you finish a trail successfully ? Or added sound effect as you follow the trail .\nAs you continue bringing out more music , yes you want to increase the difficulty but I would like to finish the song feeling it was difficult but I also want to finish having felt the music . When finished I want to feel alive and think wow that was cool .\nSo far a good start and I will keep it . Another thing . I had to delete 2 other music rhythm games as 1 had a background of partially nude lady . And both as they contained satanic music . Please do not even consider either one of these !!\nKeep it up . Really Like what I see so far . Will increase star rating in future as I see how this progresses .\n\nI have never come back to rate an oculus game above 3 stars this fast before . Stunning visuals . I have missed quite a few targets because of checking out the scenery. Normal mode is fun but rather easy. Tried expert mode and finally failed. Finally.\nYou have a great game here. I actually got tired enough to have to take a break after just a few songs.\nSome audio tweaks as mentioned above and more songs and easily will be 5 star.\n\nHelpful | 2", "magusxpMay 14 at 4:14 PM\nThis game is amazing\n\nI couldnt really get into beat saber, maybe its the songs or the melee part of it, it was fun but not my cup of tea. This game is not a beat saber clone, you do feel like you are actually dancing, at least for me a person without any rhythm whatsoever.\n\nA few notes,\n-the game seems to still be in early development yet whats available is fun and I think its worth the 20dlls\n-the playlist is short but the songs are good and the choreographies feel good.\n-you will sweat but you would have burned some calories and had fun at the same time\n\nHelpful | 1", "ThatOneGothJun 17 at 1:06 AM\nA fun work out\n\nI'm not a good dancer, and this is helping with that. Great music, fun maps and breathtaking scenery makes for a exciting workout\n\nHelpful | 0", "Gamer217May 12 at 9:16 PM\nSuper fun game!\n\nThis is a really fun app! The only bad thing I dont like about it ,when you put it on easy the beat still moves pretty fast! They need to slow it down a bit or put an option to slow down the temple the way you want the game to go. Other than that, really super fun game!\n\nHelpful | 2\nDeveloper ResponseMay 14 at 2:32 PM\n\nThank you so much! And - not sure if you saw already, but we do have options for changing the speed of the gameplay: You can currently use the 'Custom' menu to create your own copy of any song and difficulty at whatever speed you like (see this 2 min tutorial on how: https://www.youtube.com/watch?v=EPE4qCqzz88 ), and the option to do this in-headset will be in the next update. We're also diligently working on a list of modifiers, that will absolutely include gameplay speed. So, we hope that helps a bit. Thanks so much for playing and so glad you're liking it! <3", "simchiMay 23 at 7:46 PM\n\nNice game with cool songs. I hope to see more house/electric music in the future. btw the arrow heads kinda gets confusing. Not sure which direction I should hit it.\n\nHelpful | 2", "j70610May 7 at 10:57 AM\nBetter than beat saber\n\nI got beat saber as my first game and I found it a little overpriced and too easy this game I find just the right difficulty and it makes you move more than beat saber.\n\nHelpful | 6", "MindbendMay 11 at 1:28 PM\nElephant in the room\n\nOkay, so this review is going to compare this game to Synth Riders, because, let's face it: it's very similar.\nSynth Riders was kinda fun at first for me, but didn't hold my interest for very long.\nSo this game has some improvements over that game. Having not only targets to touch, but targets to swipe in a certain direction and targets that you hit like drum give this some more variation in movement. The only problem with these is that there doesn't seem to be any difference in how you interact with the directional and the drum target. At least the drum target is a little bit more obvious in what direction you are meant to move.\nAnd I find myself moving more in this game, which is a plus.\nBut I'd say that it's likely that it won't hold my interest for very long, if Synth Riders falling down amongst the unused apps is any indication (while Beat Saber is still on top after a year of nearly daily play.)\nAnd props to the devs for including the option to turn down the in-game sound fx, because they're terrible.  If that was not an option, I would have gotten a refund right away.\n\nHelpful | 5", "tica027May 7 at 10:00 PM\nExcellent!\n\nThis game is fabulous! I own all of the other rhythm games for the quest but this is easily hands down the best. More songs please! Popular music is the funnest to dance to. Nice job creators!\n\nHelpful | 3", "darceyderosaJun 5 at 6:01 PM\nGreat app\n\nThis is my new favorite! I am working on getting fut and this game is really amazing,fun, and exhausting! I am recovering from breast cancer and this truly helps my mood!\n\nHelpful | 0\nDeveloper ResponseJun 6 at 9:27 PM\n\nHi darceyderosa - That's so wonderful to hear! Comments like these and more are what fuel our development as the two of us put everything we have into this game. We're so glad you're loving it. Thanks for dancing with us!", "zharalimMay 10 at 1:32 AM\nFive stars for the potential\n\nAfter playing beat saber and synth riders this seems to be exactly what I'm looking for. This game makes you move with your whole body and I really like the idea of the virtual instructor showing the moves. The graphics are smooth and seem to have a bit more finess than in synth riders. Especially the two longer trance songs really took me on trip and were cool graphics-wise.\n\nAfter playing synth riders on expert difficulty audio trip's regular difficulty seemed to be a good level to start from.\n\nAt the moment there's only 11 songs and there's very few options to modify the game compared to other more mature games (excluding the in game editor of course!). They have promised to add more songs so I'm waiting eagerly :)\n\nHelpful | 1", "kree8tyve1Jun 11 at 6:08 PM\nWonderful, but short.\n\nThis game is like boxing, dancing and dodgeball riding a rollercoaster of music! There are only a few tracks right now, but if you have the time and patience, you can make your own.\n\nHelpful | 0", "LaPHtAMay 8 at 7:52 AM\nOne of my favorite games\n\nI primarily use the quest for exercise and this is easily one of my favorite games. Its fast and fun with a lot more movement than any of the other dance games that Ive tried.\n\nHelpful | 3", "wjknoblesMay 8 at 8:09 PM\nMovement at Home!!!\n\nGames do not have to be something that you enjoy sitting down, and Audio Trip is a great example of how movement can be brought into a game. Within minutes of installing the game we were happily dancing away to the music and challenging ourselves to do better. One of the best aspects of Audio Trip is that you lose yourself to the motion and music... and enter a flow state where your only focus is achieving a better score. The designers did a great job putting this together and we look forward to seeing what comes next!\n\nHelpful | 1", "Meche1965May 14 at 11:37 AM\nNot for me\n\nI don't like this. I have to be honest even beginner is impossible and its not the game as I love these type games - its just too fast too quickly and there are no slower songs to at least slow it a bit. I honestly thought it would be more of a dance game. I can't find how to request a refund.\n\nHelpful | 6\nDeveloper ResponseMay 14 at 2:13 PM\n\nHi Meche1965 - I'm one of the two developers, and hope I can provide some help: I'm not sure if you've seen this yet, but we have included an option for No Fail if you'd like to practice levels. And you can currently use the 'Custom' menu to edit any song, any level in the game to play at any speed as well. We are also about to update the game with the ability to create your own custom copy of any song and level with whatever speed you like, in-headset! (you can currently do this with the game now - see this 2 min video we made: https://youtu.be/EPE4qCqzz88 ) And lastly, we are currently developing a list of modifiers, which will include different speeds to play. So... I hope all of this will just get better and better as we continue to develop. Thanks so much for your feedback and trying out the game. I hope this helps! - Ashley", "debomaMay 7 at 5:00 PM\nlove it\n\nfeels very fast and fun. challenging and visually stunning. well worth the price. this one is gonna keep me busy for a while!\n\nHelpful | 5", "stevenT1116May 9 at 11:08 AM\nMy son loves this game!!!\n\nIt is fun and challenging for all age groups. My whole family tried it out and enjoyed it very much. My 8 year old son made it all the way through but I didnt. \n\nHelpful | 3", "erasmushurtMay 8 at 7:14 AM\n\nVery good. If you are burnt out on Beat Saber this is a good replacement. It's also a good passtime when eating edibles.\n\nHelpful | 4", "ParadiseDecayMay 13 at 10:49 AM\nAnother great rhythm Experience!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=e2i3wrLCUEw\n\nMy Initial Thoughts:\nAnother superb music rhythm game for VR, if you like games like Beat Saber, Synth Riders you'll really enjoy this one.\n\nHelpful | 1", "shaz05May 8 at 4:05 AM\nOMG...this what i need right now\n\nwow..this game really amaze me...thank you for including the comfort mode as options, because i have motion sickness. Waiting for great song options in future!\n\nHelpful | 2", "Puck_DavisMay 29 at 1:06 PM\nAmazing!\n\nPlease add more music!! Completely addicted \n\nHelpful | 2", "m4ndingoJun 2 at 10:35 AM\nGreat game\n\nLot of fun! A must buy\n\nHelpful | 2", "act10prideMay 22 at 2:07 PM\nAwesome\n\nEnergy, Electric, Exciting\n\nHelpful | 3", "Fuzzy_PickleJul 23 at 7:42 PM\nPerfect for Exercise\n\nWow, I was looking for something to spice up my routine. I typically bounce between beat Saber and Box VR, with a bit of TOFT and supernatural on occasion. I use Yur.fit to track calories. They have a page ranking VR games by calorie burn, I was surprised to see this game as 3rd on the list behind Toft and Beat Saber. That was enough for me, so I bought it. It's a lot of fun.\nIt has you psuedo dancing, but it's a lot of fun and really burns the calories. I was very happy to see that Yur is directly integrated and even has leader boards built in to challenge others on calorie burn.\nIn summary if, Like me, you're into VR mostly for exercise, get this game!\n\nHelpful | 0", "TuvivavalMay 9 at 8:03 AM\nExcellent\n\nReally nice game for working out! If you want to sweat, its a must for you!\n\nHelpful | 3", "DilligasJul 21 at 8:08 PM\nThe dance game we've been waiting for\n\nWhen I first heard about VR headsets, and playing rhythm dance games like beat saber (which I Love btw) what I felt was missing (but I thought was just outside the KnowledgeBase of the game designers) is what Audio Trip has done.\n\nThis game forces you to actually DANCE at the higher difficulties. You cannot just \"react\" to what you see. There is a fluidity of body movement required that forces the player into movements that stretch the limits of the hardware. I don't mean process power, I mean physical headset. After 3 attempts at a challenging song, I immediately knew that I was going to be first onboard for a sleeker VR design. Because there are dance moves that I cannot do smoothly with a 2 pound brick-goggle on my head. This game is going to force the hand of the next gen VR market.\n\nHelpful | 1\nDeveloper ResponseJul 22 at 9:51 PM\n\nWow Dilligas, thank you for your kind words! We love seeing how new designs in software push designs in hardware, and vice versa, to expand the boundaries of VR; And we're happy to be part of this ever-expanding immersive tech industry. :D We're so glad you enjoy playing Audio Trip so far - and we have so much more in store for you! Thanks for coming along with us on this journey. <3", "Tay-essMay 9 at 10:09 AM\nFirst impression: Not For Beginners\n\nIm new to VR but have been successfully doing some Beat Saber songs on hard. I really want to like Audio Trip, but am finding it frustratingly difficult, even at the Beginner level. First, the tutorial is too short and too fast-paced to help you learn the moves (particularly the swoops), so youre forced to jump right into the gameat full speedwithout sufficient target practice. Also, the shapes where your hands are are too small to see with your peripheral vision, so you dont always know if youve hit your target or, if you missed it, in which direction you need to adjust to correct your aim. You cant slow the song down to better learn the moves, so the best you can do is select beginner and no fail modes, and hope for the best. Then, to add insult to injury, when you do get through a song, it gives you snide comments like At least you tried, Mostly no shame, or Almost respectable.\n\nIll give it a couple more tries, but I suspect this will be the first game I seek a refund for.\n\nHelpful | 2\nDeveloper ResponseMay 11 at 7:27 AM\n\nHi! First of all, thank you so much. Your review helped us to find a bug ONLY affecting new players. The intended mechanic is for new players to start at Beginner speed and--with enough success and a high enough combo--the game will progress to Normal speed. What some players might have experienced, which it sounds like was your case, were both difficulties simultaneously playing! You are not bad, this is impossible! This was a huge deal, so the two of us stayed up ALL night as soon as we heard about it to work on a fix that is now live. Additionally, a specific Practice Mode just for slowing down certain parts of a song is on our road map! In the meantime, you can actually use the Choreography Tool to slow down beyond Beginner and practice sections that are giving you trouble. While its technically for choreographing your own Trips, its a bit of a multitool at the moment. Hope this tip helps! Again, thank you SO much for your review and helping us to find and splat this bug!", "DeepMellowJun 2 at 6:55 AM\nSame old limited rhythm game\n\nDont waste a refund on this one. Its the same as the million other rhythm games the quest puts out. This is a little better than audio shield but not much. Poor graphics, boring after 5 minutes. I thought the quest would have better games than this.\n\nHelpful | 0", "jujug420May 12 at 9:29 PM\nGreat music game\n\nA different style again to the genre kind of takes synth riders and a dance game in full force great game just want more songs\n\nHelpful | 1", "rolahamadehJul 23 at 2:11 PM\nTill now I love it\n\nI bought this yesterday I love it because it makes me sweat, I do cardio a lot I my life and its boring but with this game I feel happy doing cardio, may be if the oculus wasnt heavy in my head I would do it for hours\n\nHelpful | 0", "JustosMay 28 at 8:24 PM\nGreat gameplay, just a bit lacking\n\nNeeds more songs, but I enjoy the game.\n\nHelpful | 1", "Monique3311Jul 18 at 1:32 AM\nMan this is great!\n\nI played beat saver first and did not like it. Bought this and WOW! So much movement and worth every cent. Can't wait for more songs but the ones in here are definitely replayable.\n\nHelpful | 1", "Skyhawk613Jun 17 at 2:26 PM\nTruly amazing!\n\nGreat music, fantastic audio quality and brilliant graphics, amazing workout! This is a very polished title!\n\nIn my opinion this title is much much better than Synth Rder (without comparison) and takes the lead from Box VR when it comes to working up a sweat (Once you get the hang of it of course).\n\nIf you like being amazed and having lots of fun while working up a sweat, do yourself a favor, don't think, just buy it! You wont regret it.\n\nTo the developer: Thank you for an amazing title! Its my new 'go to app' for fun and a work out! Truly Amazing!\n\nHelpful | 0", "MisterfriteJun 18 at 5:58 AM\nGood music library\n\nThe only game where I found trance music it deserved 5 stars. Just not enough music right now but devs said they will add more so can't wait to see it keep up the good work guys!\n\nHelpful | 0", "ekollofJun 25 at 2:20 PM\nGreat title, needs more songs though.\n\nThis one really gets you moving. 4 stars because it really needs more music.\n\nSuggestion: Add a random song option (like Synth Rider), and if you shuffle songs, please show the song title somewhere.\n\nHelpful | 0", "TheDutchMan1443Jul 15 at 7:01 PM\n\nFun Rhythm game\n\nHelpful | 0", "JPinnapoleJun 4 at 10:41 AM\nMy new favorite!!\n\nI didnt have any high expectations when I first opened, but I was BLOWN AWAY!\n1 suggestion: PLEEAAAASSE add more songs WITH LYRICS! I have adhd and songs with lyrics help me get into a trance :)\n\nHelpful | 0\nDeveloper ResponseJun 6 at 9:26 PM\n\nHi! We actually already have lyric support built into the game, but now that we realize players like yourself would love to use it, we'll bump up the priority to having it available! And you can actually use this feature already with a custom song by adding a lyrics track into the custom songs file. We can give you more info if you're interested - check in with us on our discord: http://audio.chat - we're always on there chatting with players as we develop more. Thanks so much for playing, and for your kind words! ~Ashley", "scaryrobotJun 11 at 2:24 PM\nThe best workout in VR\n\nThis is a lot of fun. And its a seriously good workout if you play at the higher difficulties. Cant recommend enough!\n\nHelpful | 0", "nurse1981Jun 26 at 4:07 PM\n\nThis game is absolutely a blast to play, I'm just disappointed on the lack of songs there are to play, I really thought there was a wider variety, but still really fun to play.\n\nHelpful | 0\nDeveloper ResponseJun 28 at 1:01 AM\n\nHey nurse1981, thank you for your feedback and support! Since we are still in Early Access and the two of us (Brady & Ashley) are working tirelessly to release frequent updates for the game. This includes new songs, environments, and other new and exciting features within the game! Were happy that you had a blast and thank you for playing our game!"]