{"App Title": "B-Team", "App description": "The alien invasion is underway! The best and the brightest met the enemy head on, and got their butts kicked for the trouble. Now it is up to you and the members of the B-Team! Dodge to the left. Dodge to the right. Dodge to the left. No, thats your right. Speed down the path while dodging obstacles and overcoming deadly enemy traps! These aliens are carrying heavy firepower. Use the Teams special weapons to fight through wave after wave of determined enemies. We are facing an enemy that is truly mentally gifted. Their puzzles and defenses are like nothing you have seen on this planet, unless you have. Put your mind to the test with quick draw challenges! Time to prove you have what it takes to be the the last, 2nd best hope for the planet.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Arcade", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "20.03.19.356857", "Developer": "Twisted Pixel Games", "Publisher": "Oculus Studios", "Website": "http://twistedpixelgames.com/", "Release Date": "March 26, 2020", "Developer Privacy Policy": "HOMEABOUTGAMESCAREERSCONTACT\nPrivacy Policy\n\n(Last modified: February 7, 2017)\n\nTwisted Pixel Games LLC (Company or we, us or similar terms) respects your privacy and is committed to protecting it through our compliance with this Privacy Policy.\n\nHow This Privacy Policy Applies\n\nThis Privacy Policy describes the types of information we may collect from you, or that you may provide, in connection with your access to or use of (i) our website www.twistedpixelgames.com or any other websites operated by us or our affiliates that link to or otherwise reference that they are subject to this Privacy Policy (collectively, the Site), (ii) our branded video games and software applications (including mobile applications) that link to or otherwise reference that they are subject to this Privacy Policy (collectively, Applications) and (iii) any features, functionality, information or services (including content and material) made available by or on behalf of us through the Site and/or the Applications (clauses (i), (ii) and (iii), collectively, the Services), and our practices for collecting, using, maintaining, protecting and disclosing that information. Without limiting the foregoing, this Privacy Policy applies to information we collect through e-mail, text and other electronic communications between you and the Services.\n\nThe Services may offer links to third party websites and/or services, including, with respect to one of our video games, features and functionality that allow you to access services provided by the third party gaming platform on which our video game is intended to operate (collectively, Third Party Services). Such Third Party Services are not part of the Services and are not owned, controlled or operated by us. You acknowledge and agree that your access to and use of the Third Party Services are subject solely to the applicable terms and conditions of use (including, without limitation, privacy policies), if any, of the Third Party Services. This Privacy Policy does not apply to any information collected by or through any Third Party Services, and the collection and use of your information by or through any such Third Party Services are governed by the privacy policies, if any, of such third parties.\n\nPlease read this Privacy Policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use the Services. By accessing or using the Services, you agree to this Privacy Policy. This Privacy Policy may change from time to time (see Section 8 (Changes to our Privacy Policy)).\n\nInformation We Collect About You and How We Collect It\n\nWe collect several types of information from and about users of the Services, including information:\n\nby which you may be personally identified, such as name, postal address, e-mail address, telephone number or any other information that is defined as personal or personally identifiable information under applicable law (personal information);\nthat is about you but individually does not identify you, such as your interactions with the Services; and/or\nabout the device you use to access the Services and usage details.\n\nWe collect this information:\n\ndirectly from you when you provide it to us.\nautomatically as you interact with or otherwise use the Services (including usage details, IP addresses and information collected through cookies and other tracking technologies).\nfrom third parties, for example, (i) game platform providers, (iii) our service providers that furnish us with analytical information on users of the Services and (iii) social networking sites or services (such as Facebook, Twitter, and other social media providers) through which you may interact with the Services.\nInformation You Provide to Us. The information we collect on or through the Services may include:\ninformation that you provide by filling in forms on our Site. This includes information you may provide through any contact us or careers page on our Site. We also may ask you for information when you enter a contest or promotion sponsored by us, and when you report a problem with the Services.\nrecords and copies of your email, text and electronic communications, if you contact us.\nyour responses to surveys that we might ask you to complete for research purposes.\n\nYou also may provide information to be published or displayed (hereinafter, posted) on public areas of the Services, or transmitted to other users of the Services, or transmitted to other third parties, including, with respect to our video games, transmitted to or through services provided by third party gaming platforms (collectively, User Contributions). Please note that information (including personal information) that you choose to post, display or transmit as part of a User Contribution is by nature information that you have decided to make public and, therefore, is not subject to the restrictions on use or disclosure under this Privacy Policy. Your User Contributions are posted, displayed and transmitted to others at your own risk. We cannot control the actions of others with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons.\n\nPlease note that any suggestions, feedback or other information that you provide to us relating to our business, the Services or our other products, services and offerings (whether current or proposed) are provided to us on a non-confidential basis, and you grant to us a worldwide, royalty-free, irrevocable, perpetual, fully transferable and sublicensable (through multiple tiers) right and license to use and otherwise exploit such information (including any and all intellectual property rights with respect thereto) without restriction of any kind.\n\nInformation We Collect Through Automatic Data Collection Technologies.\n\nAs you interact with or otherwise use the Services, we may use automatic data collection technologies to collect certain information about your equipment, browsing actions and patterns, including details of your interactions with our Services (such as traffic data, logs and other communication data and the resources that you access and use).\n\nThe information we collect automatically does not include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to provide and improve the Services and to deliver a better and more personalized service, including by enabling us to:\n\nestimate our audience size and usage patterns.\nanalyze and monitor the use, relevancy and functionality of the Services.\nrecognize you when you return to the Services.\n\nSome of the technologies we use for this automatic data collection may include:\n\nCookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain features or functionality of the Services. Unless you have adjusted your browser setting so that it will refuse cookies, our system may issue cookies when you direct your browser to the Site or interact with the Services.\nWeb Beacons. Pages of the Site and our e-mails may contain small electronic files known as web beacons (also referred to as clear gifs. pixel tags and single-pixel gifs) that permit us, for example, to count users who have visited those pages or opened an e-mail and for other related website statistics (for example, recording the popularity of certain content and verifying system and server integrity).\n\nWe do not collect personal information through our automated data collection technologies, but we may tie this information to personal information about you that we collect from other sources or you provide to us.\n\nInformation Provided to Us by Third Parties\n\nWe may receive information about you from our business partners, including (i) with respect to our video games, gaming platforms and gaming hardware and software providers who may share information with us regarding you, your device and/or your unique identifiers, (ii) service providers that furnish us with analytical information (including geographic and demographic information) on users of the Site and (iii) social networking sites or services (such as Facebook, Twitter, and other social media providers) through which you may interact with via the Services. These third parties may use cookies alone or in conjunction with web beacons or other tracking technologies to collect information about you. We use the information provided to us by these third parties consistent with Section 3 (How We Use Your Information), and you hereby consent to our use of such information in such manner. We do not control how these third parties themselves use or disclose the information they collected from or about you, nor is any such third partys use or disclosure of such information subject to this Privacy Policy.\n\nIn particular, we use Google Analytics (a web analytics service provided by Google, Inc.). Google Analytics uses cookies to collect information such as URLs, Internet domain and host names, browser software, and the date and time that a webpage is visited. This information is used to monitor the effectiveness of the Services and to consider potential improvements to the Services. The information collected is non-personal information and is transmitted to and stored by Google on its servers. To opt out of Google Analytics data collection, read more about the Google Analytics opt-out browser add-on.\n\nHow We Use Your Information\n\nWe may use information that we collect about you or that you provide to us through your access to and use of the Services, including any personal information:\n\nto operate and provide the Services.\nto develop and improve the Services and our other products and services.\nto communicate with you, and provide additional information that may be of interest to you, about us (including the Services and our other products and services).\nto provide you with other information, products or services that you request from us.\nto provide you with customer support, technical support, administrative, account, and security notices, including notice of changes to our Privacy Policy or other legal documents or the products or services that we offer.\nto conduct our administrative and internal business operations.\nto fulfill any other purpose for which you provide it.\nto comply with our obligations, as determined by us in good faith, under applicable law.\nto carry out our obligations and enforce our rights arising from any contracts entered into between you and us.\nin any other way we may describe when you provide the information.\nfor any other purpose with your consent.\n\nWe may use your information to communicate with you (including via email, text or other electronic communications) about products, services or other offerings that may be of interest to you. If you do not want us to use your information for such promotional purposes, please see Section 5 (Choices About How We Use and Disclose Your Information) below.\n\nDisclosure of Your Information\n\nWe may disclose aggregated information about our users, and information that does not identify any individual, without restriction. Without limitation of the foregoing, we may disclose information relating to the performance, sales, downloads and installations of our video games on or with gaming platforms, hardware or software to gaming platforms and/or gaming hardware or software providers without restriction, as long as such information does not include your personal information.\n\nWe may disclose personal information that we collect or you provide as described in this Privacy Policy:\n\nto our subsidiaries and affiliates.\nto our contractors, service providers and other third parties we use to support our business and who are bound by applicable law and/or contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them.\nto a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of our assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about users of the Services is among the assets transferred.\nto fulfill the purpose for which you provide it.\nfor any other purpose disclosed by us when you provide the information.\nwith your consent.\n\nWe also may disclose your personal information:\n\nto comply with any court order, law or legal process, including to respond to any government or regulatory request.\nto enforce or apply our Privacy Policy or other legal documents.\nif we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, our customers or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection and credit risk reduction.\nChoices About How We Use and Disclose Your Information\n\nWe strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information:\n\nTracking Technologies. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. If you disable or refuse cookies, please note that some parts of the Services may then be in accessible or not function properly.\nPromotional Offers from the Company. If you do not wish to have your e-mail address/contact information used by the Company to promote our own or third parties products, services or other offerings, you can opt-out by (i) following the unsubscribe instructions provided in the communication sent by us or (ii) sending us an e-mail stating your request to privacy@twistedpixelgames.com. We will respond to your request within 30 days from the date you contact us. Please note that this opt-out does not apply to information provided to the Company as a result of a purchase, product service experience or other transaction.\nSocial Networks. If you register with us via a third party social networking platform (e.g., Facebook, etc.), you may be able to manage the information you share with us and the interactivity between the Services and your social networking account by using privacy settings and other tools that may be provided by the social networking platform that you are using. By registering with us through a social networking platform, you grant to us the right to collect and use the information that you have made available to be shared with us.\nAccessing and Correcting Your Information\n\nYou can request that we correct or delete your personal information by sending us an e-mail at privacy@twistedpixelgames.com. We may not accommodate a request to change information if we believe the change would violate any law or cause the information to be incorrect. We will respond to your request within 30 days from the date you contact us.\n\nData Security\n\nWe have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration and disclosure. We will comply with our obligations (including any disclosure and notice obligations) under applicable U.S. law relating any breach of the security, confidentiality or integrity of your personal information.\n\nUnfortunately, the transmission of information via the Internet is not completely secure and no security measures are perfect or impenetrable. Therefore, we cannot guarantee the security of your personal information transmitted to or stored by us, and we are not responsible for the circumvention of any privacy settings or security measures with respect to our Services or systems.\n\nChanges to Our Privacy Policy\n\nIt is our policy to post any changes we make to our Privacy Policy on this page with a notice that the Privacy Policy has been updated. The date this Privacy Policy was last revised is identified at the top of the page. You are responsible for periodically visiting this Privacy Policy to check for any changes. Your continued use of any of the Services after we make changes to this Privacy Policy is deemed to be acceptance of those changes.\n\nService-Specific Privacy Terms\n\nYour access to and use of certain of our Services may be subject to Service-specific terms and conditions (e.g., end user license agreements for our video games) which may contain additional provisions regarding our practices for collecting, using, maintaining, protecting and disclosing information that is collected by us, or provided by you to us, in connection with that particular Service.\n\nChildren Under the Age of 13\n\nOur Services are not directed toward or otherwise intended for children under 13 years of age. We do not knowingly collect personal information from children under 13 years of age. If you are under 13 years of age, do not use or provide any information to the Services or on or through any of its features, or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 years of age without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13 years of age, please contact us at privacy@twistedpixelgames.com.\n\nContact Information\n\nIf you have any questions or comments regarding this Privacy Policy or our privacy practices, please contact us: (i) by mail, at Twisted Pixel Games LLC, Attn: General Counsel  Arbitration, 3601 S. Congress, Suite B300, Austin, TX 78704; or (ii) by email, at privacy@twistedpixelgames.com.\n\n 2020 Twisted Pixel Games, LLC\nPrivacy PolicyLicense Agreement", "Developer Terms of Service": "HOMEABOUTGAMESCAREERSCONTACT\nEnd User License Agreement  VR Games\nTWISTED PIXEL GAMES\n\nEND USER LICENSE AGREEMENT\n\n(VR Games)\n\n(Last Modified: February 7, 2017)\n\nIMPORTANT  READ CAREFULLY. THIS END USER LICENSE AGREEMENT SETS FORTH THE LEGAL AGREEMENT BETWEEN YOU AND US RELATING TO THE GAME. IN PARTICULAR, THIS AGREEMENT REQUIRES THAT ANY DISPUTE BETWEEN YOU AND US MUST BE RESOLVED THROUGH THE DISPUTE RESOLUTION PROCESS DESCRIBED IN SECTION 13 BELOW WHICH INCLUDES BINDING ARBITRATION AND A CLASS ACTION.\n\nTHE GAME IS DESIGNED FOR USE ON A VIRTUAL REALITY PLATFORM. TO REDUCE THE RISKS OF PERSONAL INJURY, DISCOMFORT AND/OR PROPERTY DAMAGE, PLEASE MAKE SURE THAT YOU READ AND COMPLY WITH ALL WARNINGS, GUIDELINES AND INSTRUCTIONS ASSOCIATED WITH THE USE OF VIRTUAL REALITY PLATFORMS AND RELATED HARDWARE, SOFTWARE AND SERVICES, INCLUDING THOSE SET FORTH IN SECTION 9(B) OF THIS AGREEMENT.\n\nBY (A) DOWNLOADING, INSTALLING OR USING THE GAME OR (B) CLICKING TO ACCEPT OR AGREE TO, OR TAKING ANY OTHER ACTION TO AFFIRM, THIS AGREEMENT WHEN THE OPTION IS MADE AVAILABLE TO YOU, WHICHEVER IS FIRST TO OCCUR, YOU AGREE THAT YOU HAVE READ THIS AGREEMENT AND AGREE TO BE LEGALLY BOUND BY THIS AGREEMENT. IF YOU DO NOT AGREE TO THIS AGREEMENT, THEN YOU ARE NOT LICENSED OR OTHERWISE PERMITTED TO DOWNLOAD, INSTALL OR USE THE GAME AND YOU MUST NOT DOWNLOAD, INSTALL OR USE THE GAME IN ANY MANNER.\n\nGeneral. This End User License Agreement (VR Games) (this Agreement) sets forth the legal agreement between Twisted Pixel Games LLC (we, us or similar terms) and you with respect the Twisted Pixel Games-branded video game provided or otherwise made available to you by or on behalf of us for use on or with the Oculus virtual reality platform (such video game, in object code form, along with any related documentation provided, including any Updates (as defined below) to any of the foregoing, as may be made available by us to you from time to time, collectively, the Game). The Game is intended for use on and with the virtual reality platform made available by or on behalf of Oculus VR, LLC (Oculus) and you acknowledge that your access to and use of the Oculus virtual reality platform, including your access to and use of physical goods, platform services, software, websites, applications and content provided by or on behalf of Oculus (collectively, the Oculus Services), is subject to Oculus then-current terms of service. You represent and warrant that you are of legal age to form a binding contract with us, have read this Agreement, and agree to be legally bound by this Agreement.\nYour Right to Use the Game.\nLicense. Subject to the terms and conditions of this Agreement, we grant to you a limited, personal, non-exclusive, non-transferable, non-sublicensable license to download, install and use the Game on a single Game-compatible device (e.g., a computer, mobile device or gaming console for which the Game is designed for use) owned or controlled by you only for your personal, non-commercial use in accordance with this Agreement (collectively, the Permitted Use). The Game is licensed, and not sold, to you. \nAdditional Conditions and Restrictions. The license grant in Section 2(a) above does not authorize you to, and you will not (directly or indirectly): (i) use the Game for any purpose, commercial or otherwise, other than the Permitted Use; (ii) copy the Game (except to the extent otherwise expressly permitted under this Agreement, if at all); (iii) modify, adapt, alter, translate or create derivative works of the Game; (iv) reverse engineer, decompile, disassemble, decode or otherwise attempt to discover the source code, architecture, structure or underlying technology of the Game; (v) remove, delete, alter or obscure any trademarks or any copyright, trademark, patent or other intellectual property or proprietary rights notices from the Game; (vi) rent, lease, loan, sublicense, distribute, transfer or otherwise provide access to the Game to any other person (including at or through a gaming center or application service or on a network where it is capable of being accessed by more than one device at any time); (vii) use the Game for purposes of (A) engaging in any activities in violation of applicable law, (B) development of a competing product, service or offering, or (C) violating the Oculus terms of service; (viii) use the Game for any purpose (including on any device or platform) for which it was not designed or for which is it not compatible; or (ix) attempt to gain unauthorized access to, interfere with, remove, disable, circumvent, damage or disrupt any portions of the Game (including any copy protection, rights management, access control or security features with respect thereto) or the Oculus Services, including any servers, databases or accounts relating to any of the foregoing. We shall have the right (but not the obligation) to monitor your use of the Game to confirm your compliance with the terms of this Agreement. All rights in and to the Game not expressly granted to you in this Agreement are expressly reserved by us and our licensors.\nOwnership of Game. Except for the limited licenses expressly granted to you in Section 3(a) of this Agreement, nothing in this Agreement will be construed, either by implication, estoppel, or otherwise, as a grant to you of any right, title, license, or interest in the Game or any component of any of the foregoing (including any patent, copyright, trade secrets, or other intellectual property rights with respect to any of the foregoing). We and/or our licensors shall retain exclusive ownership and title (including all patent, copyright, trade secret, and other intellectual property rights) in and to the Game, including all titles, computer codes, audiovisual effects, themes, characters, character names, stories, dialog, settings, artwork, sounds effects, and musical works.\nSupport; Modifications; Updates. You may direct any requests for technical support with respect to the Game to us at support@twistedpixelgames.com. Any questions, comments or request regarding the Oculus Services or, if you purchased a license to the Game from Oculus, billing-related questions regarding your purchase, should be directed to Oculus. We may from time to time, in our sole discretion, develop and provide software updates to the Game, which may include upgrades, bug fixes, patches and other error corrections and/or new features (collectively, including related documentation, Updates). Updates may also modify or delete in their entirety certain features and functionality. You agree that we have no obligation to provide any Updates or to continue to provide or enable any particular features or functionality. Based on your device settings, when your device is connected to the Internet either: (a) the Game will automatically download and install all available Updates; or (b) you may receive notice of or be prompted to download and install available Updates. You shall promptly download and install all Updates and acknowledge and agree that the Game, the Oculus Services and/or portions any of the foregoing may not properly operate should you fail to do so.\nCollection of Information. You acknowledge that when you download, install or use the Game, we may use automatic means (including, for example, cookies and web beacons) to collect information about your device, the Game and your use of the Game. You also may be required to provide us with certain information about yourself as a condition to downloading, installing or using the Game or certain of its features or functionality. The Game may provide you with opportunities to share (including to or through the Oculus Services) information about yourself, your device and/or your use of the Game with others (including the public display of your data, such as identification of your user-created content or displaying your scores, ranking, achievements, and other gameplay data on websites and other platforms, and the sharing of your gameplay data with hardware manufacturers, and platform hosts). We may also receive information about you and your device from Oculus (including through your use of the Oculus Services). Any and all information we collect through or in connection with the Game is subject to our Privacy Policy, and you consent to all actions taken by us with respect to your information in compliance with our Privacy Policy. For the avoidance of doubt, any information you share to or through, or that is collected by, the Oculus Service is subject to the terms and conditions of Oculus then-current privacy policy.\nThird Party Materials. The Game may display, include or make available third-party content (including data, information, applications and other products, services and/or offerings) or provide links to third-party websites or services, including through third-party advertising (collectively, Third Party Materials). You acknowledge and agree that we are not responsible for Third Party Materials, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality or any other aspect thereof. We do not assume and will not have any liability or responsibility to you or any other person or entity for any Third Party Materials. Third Party Materials and links thereto are provided solely as a convenience to you and you access and use them at entirely at your own risk and subject to such third parties terms and conditions.\nTerm and Termination.\nTerm. The term of this Agreement will commence at the time of acceptance of this Agreement by you and will continue in effect until terminated in accordance with Section 7(b) below (such period, the Term).\nTermination. This Agreement will terminate automatically when you violate any of the terms or conditions set forth in this Agreement or when you uninstall and delete the Game (including any and all copies) from your device. This Agreement may be terminated by us immediately, with or without notice, in the event of our decision (which shall be in our sole discretion) to cease to support or provide the Game.\nEffect of Termination.\nUpon termination of this Agreement, all rights granted to you under this Agreement (including the license granted to you under Section 2) will terminate automatically and you will promptly uninstall, delete and cease further use of the Game (including any copies thereof) in your possession. We are under no obligation to store or make available (during or after the Term) any information created or associated with the Game for any particular period of time.\nNotwithstanding anything to the contrary in this Agreement, termination of this Agreement will not affect any of your obligations or our rights under this Agreement, all of which will survive any termination of this Agreement.\nCompliance with Laws. You agree to comply with all applicable laws (including regulations) relating to your access to and use of the Game and other performance of this Agreement. Without limiting the foregoing, you agree that that the Game and other technical data provided to you under this Agreement may be subject to the import/export control laws of the United States and other countries, and you will comply with any and all such applicable laws.\nDisclaimers; Health and Safety Warnings.\nYOU ACKNOWLEDGE AND AGREE THAT THE GAME IS PROVIDED ON AN AS IS, AS AVAILABLE BASIS. ANYTHING TO THE CONTRARY NOTWITHSTANDING, WE (INCLUDING, FOR PURPOSES OF THIS SECTION, OUR AFFILIATES AND LICENSORS) DO NOT MAKE ANY, AND HEREBY EXPRESSLY DISCLAIM ALL, WARRANTIES, WHETHER EXPRESSED OR IMPLIED, WITH RESPECT TO THE GAME, AND ANY OTHER PRODUCTS, SERVICES, OFFERINGS, INFORMATION OR ITEMS, PROVIDED, OR TO BE PROVIDED, TO YOU UNDER THIS AGREEMENT OR BY OR THROUGH THE USE OF THE GAME (COLLECTIVELY, THE OFFERINGS), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT OR ANY OTHER WARRANTIES THAT MAY ARISE FROM USAGE OF TRADE OR COURSE OF DEALING. WITHOUT LIMITING THE FOREGOING, WE DO NOT MAKE ANY, AND HEREBY EXPRESSLY DISCLAIM ALL, REPRESENTATIONS, WARRANTIES AND/OR GUARANTEES REGARDING (I) THE OFFERINGS (INCLUDING THE USE OF OR THE RESULTS OF THE OFFERINGS) IN TERMS OF CORRECTNESS, ACCURACY, RELIABILITY, TIMELINESS, AVAILABILITY, SECURITY, COMPLIANCE WITH APPLICABLE LAWS OR OTHERWISE, OR (II) WHETHER THE OPERATION OF THE OFFERINGS WILL BE UNINTERRUPTED OR ERROR FREE. YOUR USE OF THE OFFERINGS IS DONE SO AT YOUR OWN RISK.\nHEALTH AND SAFETY WARNINGS. YOU UNDERSTAND AND AGREE THAT THE GAME IS DESIGNED FOR USE ON A VIRTUAL REALITY PLATORM AND THAT THERE ARE INHERENT RISKS OF PERSONAL INJURY, DISCOMFORT AND/OR PROPERTY DAMAGE THAT ARE ASSOCIATED WITH VIRTUALTY REALITY PLATFORMS AND THE GAME. TO REDUCE THESE RISKS IT IS IMPORTANT THAT YOU READ, EVALUATE AND FOLLOW ALL HEALTH AND SAFETY WARNINGS, GUIDELINES AND/OR INSTRUCTIONS WITH RESPECT TO THE VIRTUAL REALITY PLATFORM (INCLUDING ALL RELATED HARDWARE, SOFTWARE AND SERVICES) THAT YOU ARE USING, INCLUDING THOSE WARNINGS, GUIDELINES AND INSTRUCTIONS PUBLISHED BY OCULUS WHICH ARE AVAILABLE AT https://www.oculus.com/legal/health-and-safety-warnings/. \n\nA COMFORTABLE VIRTUAL REALITY EXPERIENCE REQUIRES AN UNIMPAIRED SENSE OF MOTION AND BALANCE. DO NOTUSE THE GAME WHEN YOU ARE: TIRED; NEED SLEEP; UNDER THE INFLUENCE OF ALCOHOL OR DRUGS; HUNG-OVER; HAVE DIGESTIVE PROBLEMS; UNDER EMOTIONAL STRESS OR ANXIETY; SUFFERING FROM COLD, FLU, HEADACHES, MIGRAINES, OR EARACHES (AS THIS CAN INCREASE YOUR SUSCEPTIBILITY TO ADVERSE SYMPTOMS). IN PARTICULAR, IT IS RECOMMENDED THAT YOU SEE A DOCTOR BEFORE USING THE GAME IF YOU ARE: PREGNANT; ELDERLY; HAVE PRE-EXISTING BINOCULAR VISION ABNORMALITIES OR PSYCHIATRIC DISORDERS; OR SUFFER FROM A HEART CONDITION OR OTHER SERIOUS MEDICAL CONDITION.\n\nSOME PEOPLE MAY HAVE SEVERE DIZZINESS, SEIZURES, EYE OR MUSCLE TWITCHING OR BLACKOUTS TRIGGERED BY LIGHT FLASHES OR PATTERNS, AND THIS MAY OCCUR WHILE THEY ARE WATCHING TV, PLAYING VIDEO GAMES OR EXPERIENCING VIRTUAL REALITY  EVEN IF THEY HAVE NEVER HAD A SEIZURE OR BLACKOUT BEFORE OR HAVE NO HISTORY OF SEIZURES OR EPILEPSY. SUCH SEIZURES ARE MORE COMMON IN CHILDREN AND YOUNG PEOPLE UNDER THE AGE OF 20. ANYONE WHO EXPERIENCES ANY OF THESE SYMPTOMS SHOULD DISCONTINUE USE OF THE GAME AND SEE A DOCTOR. ANYONE WHO PREVIOUSLY HAS HAD A SEIZURE, LOSS OF AWARENESS, OR OTHER SYMPTOM LINKED TO AN EPILEPTIC CONDITION SHOULD SEE A DOCTOR BEFORE USING THE GAME.\n\nBY USING THE GAME, YOU REPRESENT AND WARRANT THAT YOU HAVE READ AND UNDERSTAND ALL SUCH WARNINGS, GUIDELINES AND INSTRUCTIONS. YOU ARE SOLELY RESPONSIBLE FOR YOUR USE OF THE GAME AND ASSUME ALL RISKS ASSOCIATED WITH YOUR USE OF THE GAME AND ACTIVITIES RELATING THERETO.\n\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF OR LIMITATIONS ON IMPLIED WARRANTIES OR THE LIMITATIONS ON THE APPLICABLE STATUTORY RIGHTS OF A CONSUMER, SO SOME OR ALL OF THE ABOVE EXCLUSIONS AND LIMITATIONS MAY NOT APPLY TO YOU.\n\nLimitation of Liability. IN NO EVENT SHALL WE (INCLUDING, FOR PURPOSES OF THIS SECTION, ITS AFFILIATES AND LICENSORS) BE LIABLE TO YOU OR ANY OTHER PERSON FOR ANY INDIRECT, CONSEQUENTIAL, INCIDENTAL, SPECIAL OR PUNITIVE DAMAGES, OR ANY DAMAGES FOR LOSS OF REVENUE OR PROFIT, LOSS OF DATA, OR LOSS OF TIME OR BUSINESS, ARISING OUT OF OR RELATING TO THIS AGREEMENT, WHETHER LIABILITY IS ASSERTED IN CONTRACT OR IN TORT (INCLUDING STRICT LIABILITY OR NEGLIGENCE) OR OTHERWISE, AND REGARDLESS OF WHETHER WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ANYTHING TO THE CONTRARY NOTWITHSTANDING, OUR TOTAL MAXIMUM LIABILITY FOR ANY AND ALL CLAIMS, DAMAGES AND LIABILITIES ARISING OUT OF OR RELATING TO THIS AGREEMENT, WHETHER LIABILITY IS ASSERTED IN CONTRACT OR IN TORT (INCLUDING STRICT LIABILITY OR NEGLIGENCE) OR OTHERWISE, WILL IN NO EVENT EXCEED THE GREATER OF (I) THE TOTAL RETAIL PRICE YOU PAID TO PURCHASE THE GAME AND (II) US$100. NO ACTION, SUIT OR PROCEEDING AGAINST US MAY BE BROUGHT MORE THAN ONE YEAR FOLLOWING THE DATE UPON WHICH THE CLAIM FIRST AROSE.\n\nSOME JURISDICTIONS DO NOT ALLOW CERTAIN LIMITATIONS OF LIABILITY SO SOME OR ALL OF THE ABOVE LIMITATIONS OF LIABILITY MAY NOT APPLY TO YOU.\n\nIndemnity. You agree to defend, indemnify and hold harmless us, our affiliates, licensors and service providers, and our and their respective officers, directors, employees, contractors, agents, licensors, suppliers, successors and assigns from and against any claims, liabilities, damages, judgments, awards, losses, costs, expenses or fees (including reasonable attorneys fees) arising out of or relating to (a) your breach of any provision of this Agreement or (b) your download, installation or use of the Game, including the results of your use thereof.\nGoverning Law; Venue. THIS AGREEMENT WILL BE GOVERNED BY AND CONSTRUED IN ACCORDANCE WITH THE INTERNAL LAWS OF THE STATE OF TEXAS, WITHOUT GIVING EFFECT TO ANY CHOICE OF LAW PROVISION OR RULE (WHETHER OF THE STATE OF TEXAS OR OTHERWISE). SUBJECT TO THE PROVISIONS OF SECTION 13 (BINDING ARBITRATION AND CLASS ACTION WAIVER) BELOW, ANY LEGAL SUIT, ACTION OR PROCEEDING ARISING OUT OF OR RELATED TO THIS AGREEMENT OR THE GAME SHALL BE INSTITUTED EXCLUSIVELY IN THE FEDERAL COURTS OF THE UNITED STATES OR THE COURTS OF THE STATE OF TEXAS, IN EACH CASE, LOCATED IN TRAVIS COUNTY, TEXAS, U.S.A. YOU WAIVE ANY AND ALL OBJECTIONS TO THE EXERCISE OF JURISDICTION OVER YOU BY SUCH COURTS AND TO VENUE IN SUCH COURTS.\nBinding Arbitration and Class Action Waiver.\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH US AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM US (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\nYou and we agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in Travis County, Texas or, if you reside in the U.S., in a small claims court in your county of residence. Dispute as used in this Section 13 means any dispute, cause of action, claim, or controversy arising out of or in any way related to us, this Agreement, the subject matter of this Agreement, or the Game, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties, except any dispute, cause of action, claim, or controversy relating to our intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). If the Dispute involves a claim by you against both Oculus and us relating to the Game, the Oculus virtual reality platform and/or services, or any trademarks, trade names, service marks, logos, designs, characters, artwork domain names or other distinctive brand features relating to our or Oculus products or services, then you and we further acknowledge and agree that if you are subject to an arbitration provision under Oculus terms of service, then, to the extent of a conflict between the arbitration provisions in Oculus terms of service and this Agreement, the arbitration provisions in Oculuss terms of service will take precedence. You and we empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of this Agreement, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable. \nYou and we agree that any Dispute is personal to you and us, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor we agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\nYou and we agree that this Agreement affects interstate commerce and that the enforceability of Section 13 shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (FAA) to the maximum extent permitted by applicable law.\nThe arbitrator, we, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the.\nOur goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against us, you agree to first contact us and attempt to resolve the claim informally by sending a written notice of your claim (Notice) to us. The Notice to us must be sent by certified mail addressed to: Twisted Pixel Games LLC, Attn: General Counsel  Arbitration, 3601 S. Congress, Suite B300, Austin, TX 78704. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and we cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 13, commence an arbitration proceeding or file a claim in court. You and we agree that any Dispute must be commenced or filed within one year after such claim arose; otherwise, the Dispute is permanently barred.\nIn the event that you and we cannot resolve a Dispute and you do not pursue your claims through small claims court, you or we shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (AAA). In the event AAA declines or is unable to administer the arbitration, you and we agree to use an arbitration forum or arbitrator that you and we mutually agree upon. If, after making a reasonable effort, you and we are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (AAA Rules) then in effect. The AAA Rules and other information about AAA and arbitration are readily available at http://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into this Agreement, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and we agree that this Agreement governs the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\nAs limited by the FAA, this Agreement, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by this Agreement (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, we will pay all filing, AAA, and arbitrators fees and expenses. If the arbitrator issues you an award that is greater than the value of our last written settlement offer made before an arbitrator was selected (or if we did not make a settlement offer before an arbitrator was selected), then we will pay you the amount of the award or US $5,000, whichever is greater, and pay your attorney, if any, the amount of attorneys fees incurred, and reimburse any expenses (including expert witness fees and costs) that you or your attorney reasonably accrue for investigating, preparing and pursuing your claim in arbitration. We waive any right to seek an award of attorneys fees and expenses in connection with any non-frivolous arbitration between you and us.\nYou may opt out of this agreement to arbitrate. If you do so, neither you nor we can require the other to participate in an arbitration proceeding pursuant to this Agreement (however, for the avoidance of doubt, this will not affect any obligations you may have under Oculus terms of service to arbitrate certain disputes). To opt out, you must notify us in writing within 30 days of the date that you first became subject to this arbitration provision, and must include your name, residence address, email address (including the email address you use for your Oculus account (if you have one)), and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: Twisted Pixel Games LLC, Attn: General Counsel  Arbitration, 3601 S. Congress, Suite B300, Austin, TX 78704. Unless you choose to opt out, this dispute resolution provision in Section 13 shall survive termination of this Agreement.\nSeverability. If an arbitrator or court of competent jurisdiction finds any provision of this Agreement to be unenforceable, that provision of the Agreement will be enforced to the maximum extent permissible so as to effect the intent of the parties, and the remainder of this Agreement will continue in full force and effect.\nNotices. Except as otherwise provided in the Agreement, any notice required or permitted to be given to a party under this Agreement shall be made (a) in the case of a notice to us, by mail to Twisted Pixel Games LLC, Attn: General Counsel  Arbitration, 3601 S. Congress, Suite B300, Austin, TX 78704 and (b) in the case of a notice to you, by mail or email, in each case to the address reflected in our records.\nAssignment. You may not assign or otherwise transfer this Agreement, or any of your rights or obligations hereunder, without our prior written consent. Any attempted assignment or transfer of this Agreement or any rights or obligations hereunder in violation of the preceding sentence will be void. We may freely assign or otherwise transfer this Agreement, or any of our rights or obligations hereunder, without notice to or consent from you. Subject to the foregoing, this Agreement will be binding on the parties and their respective successors and assigns.\nEach instance in this Agreement of the words include, includes, and including will be deemed to be followed by the words without limitation. As used in this Agreement, the term days means calendar days, not business days, unless otherwise specified. All headings or section divisions contained in this Agreement are for reference purposes only and will not be construed to affect the meaning or interpretation of this Agreement.\nForce Majeure. We will not be liable for any failure or delay in performance resulting from any event beyond its reasonable control, including due to fire, flood, action or decree of civil or military authority, insurrection, act of war, terrorism, denial of service attacks, labor disputes or shortages, material shortages, power outages, failure of internet connections, failure of suppliers, or embargo.\nWaiver; Amendments. No waiver of any provision of this Agreement will be effective against us unless made in writing and signed by an officer of our company. We shall have the right to change, modify or amend this Agreement, in whole or in part, at any time, on written notice to you, which notice may be provided by posting the amendment to the page of our website containing the then-current version of this End User License Agreement (or successor terms) and/or by sending you an email or other electronic alert that there has been an amendment. Your continued use of the Game following the publication of such amendment shall constitute your acceptance of the amended End User License Agreement.\nTrademarks. Twisted Pixel and Twisted Pixel Games and the Twisted Pixel logo are our trademarks or registered trademarks. You must not use such marks or any of our other trademarks, without our prior written permission. Oculus, Oculus VR, Rift and the Oculus logo are trademarks of Oculus VR, LLC. Other third party names, logos, product and service names, designs and slogans are the trademarks of their respective owners. The display of any third party names, logos, product or service names, designs or slogans on or through or in association with the Game does not necessarily indicate any endorsement of or affiliation with us.\nEntire Agreement. This Agreement constitutes the entire agreement between you and us with respect to the subject matter hereof and supersedes any and all prior representations, warranties, understandings or agreements (written or oral) between you and us with respect to the subject matter hereof.\n 2020 Twisted Pixel Games, LLC\nPrivacy PolicyLicense Agreement", "Space Required": "974.1 MB"}



["5 stars\n33%\n4 stars\n26%\n3 stars\n19%\n2 stars\n11%\n1 star\n11%", "samuelcaprisonJul 11 at 4:37 PM\nGreat game but one downside...\n\nFun game still on city bummer though you dont actually put your hands down to fly and stuff like that but still great game\n\nHelpful | 2", "TurboBoarMar 26 at 3:01 PM\n1st person TEMPLE RUN times 4 \n\nIf you enjoy 1st person rail games where you're pushed forward like on a conveyor belt without the ability to move freely, and you can lose life by simply avoiding sliding past a big rock, while constantly switching between four characters with different abilities to overcome obstacles in your way, then this may be the game for you.\n\nI gave it a go three times and quickly decided that this kids' game just didn't happen to appeal to my inner child, but I'm sure it'll find it's fan base.\n\nFast-paced and with very decent graphics but just not everyone's cup of tea \n\nHelpful | 250", "ZedisnotdeadApr 2 at 9:23 PM\nGood game\n\nI like this game. With the release of lies beneath, the room and down the rabbit hole all in the past week .....this game may start out as a temple run scenario but once you beat that you see that all the levels are diverse in there own way. This is a super fun arcade style shoot em up type of game and it is what it is.....alot of fun!\n\nHelpful | 11", "K9kingApr 8 at 6:36 AM\nStuff that can be fixed\n\nFor one thing let people aim with their hands not their heads. In the defensive game buff the leader and nerf the crazy soldier guy and make it two handed cause seeing a second hand out of nowhere is weird. Do that also with the run levels and if you can make more weapons for the characters like for the crazy guy give him a shotgun or give the commander some grenades. Other then that good game please listen to my suggestion cause if you do that it will make it a way better game\n\nHelpful | 5", "jaxdashboltMar 28 at 5:44 PM\nGave me a taste now Im addicted\n\nThis game shocked me to be honest, I wasnt expecting it to be this good. The trailer really doesnt give this game the justice it deserves, super fun, the commentary is really funny switching between characters on the fly is really sweet and there are more game modes than I expected especially for the cheap price.\nGreat job Devs this was a welcome new drug to my vr addiction \n\nHelpful | 26", "eric.sullivan.587268May 27 at 3:53 PM\nSucks\n\nThis game sucks to the point it should of been on apple stores not Android I played it for 5 mins and found out real fast it should get uninstalled very fast\nI'm not gonna do what other people do and ask for my money back because I do people somewhere in this game there might be a playable part but so far nothing seems good on it\n\nHelpful | 2", "AJ946Apr 2 at 3:40 PM\nThe B Plus Team\n\nOk if you are looking for a serious, action packed shooter game, this is not for you. It is a fast paced multi minigame cartoon mission completion game.\n\nThe quips and dialogue are funny and the gameplay is fast paced and full of fun challenges. Minigames include a stationed shooter with 5 lives, a temple run esc obstacle dodger, and a timed quick challenge run. All throughout there are four characters with unique abilities and weapons.\n\nAs for price, I think it should be 10 dollars but the price isnt unacceptable. Graphics are meh the cartoon style is pretty cool and the characters are ridiculous and hilarious. Overall would recommend to others. Have fun!\n\nHelpful | 3", "GavinstoneApr 3 at 6:11 AM\nGood until...\n\nI love this game but I was at the end of a level with 1 life left and then I hit a rock and it set me all the way back at the beginning.\n\nPls add checkpoints\n\nHelpful | 12", "DancesWithNoobsApr 26 at 8:42 AM\nLacking VR capabilities\n\nThis really doesnt take advantage of the VR platform. I like the TP teams wit... but their gameplay usually leaves me feeling bored and frustrated. Their humor and wacky concepts are on display again here... and theyre great... but as always is the case with their stuff, this feels like an uphill fight through a weak platformer with some mini games thrown in to break the frustrating monotony of the unidirectional push toward the other edge of the screen in order to unlock some jokes. You cant even physically side step to avoid obstacles... youre forced into using the joysticks. This feels like Comic Jumper was reskinned for VR, honestly. Given that I do like their quirky humor... I didnt request a refund and I gave more stars that I initially planned. Might be fun for some but Im exhausted with rail shooters and platform action games and dont feel like fighting through the unevenly accelerating difficulty they tend to spring in order to get a punchline.\n\nHelpful | 0", "Hermes_triApr 3 at 5:01 PM\nGreat arcade style game\n\nI was pleasantly surprised with the game, it's similar in its humour and setting to the Path of the Warrior and from the same devs. The game is divided in three parts, temple run style runner with 4 characters to swap on the go, arena style wave shooter with 4 characters and set of mini games. The game contains 3 worlds with 7 levels on each.\nPut all of these together, and you've got a great arcade game with a lot of variety!\n\nHelpful | 5", "Doc-RevelatorMay 16 at 11:02 AM\nAbysmal\n\nA badly made, badly conceived waste of time. Utterly without merit and a shocking misuse of VR. Avoid at all costs.\n\nHelpful | 1", "jswitch808Mar 31 at 8:50 PM\nBoss\n\nI love this game. Great variety of scenarios. Game gives you the tools to figure out how to proceed. Its way fun!\n\nHelpful | 4", "Okami77Apr 7 at 4:32 AM\nWelcome to the B-Team !\n\nSimple to play but fun and attractive.\n\nhttps://youtu.be/qaasEcb1o3A\n\nHelpful | 1", "PauldoggyApr 3 at 3:44 AM\nFun fun fun\n\nWish there were more arcade style games like this. Its fun arcade style is a break from all the cerebral title out there.\n\nHelpful | 2"]