{"App Title": "Bait!", "App description": "Join the more than 3 million players who already enjoy Bait! \n\nIts definitely the next game Im getting my mom to try. - The Verge\n\nIts amazing. Bait! had an almost instantaneous relaxation effect. Once you get started and cast your first line, everything else in life disappears and youre truly in the moment  I bet my pulse even went down. - Maarten Noyons, founder of IMGA \n\nBait! is one of those pleasant games for everyone. - VRScout\n\nYoure invited to Bait! Island to help your boss catch a rare fish, and thereby save the struggling aquarium where you work.\n\nDuring the game, you will catch a lot of different fish and make friends with the locals. But, will you be able to keep your loyalties both to your new friends and to your boss?\n\nGameplay spans four different lakes, each with a distinct style and its own unique set of fishes. Can you catch them all?", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Casual, Exploration", "Languages": "English, Chinese (China), French (Belgium), French (Canada), French (France), German, German (Switzerland), Italian, Japanese, Korean, Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Spain), Spanish (Venezuela)", "Version": "1.12.63217", "Developer": "Resolution Games", "Publisher": "Resolution Games", "Website": "http://www.resolutiongames.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "GAMES\nOverview\nAcron: Attack of the Squirrels!\nAngry Birds AR: Isle of Pigs\nAngry Birds VR: Isle of Pigs\nAngry Birds FPS: First Person Slingshot\nBait!\nBait! Arctic Open\nBlaston\nCook-Out: A Sandwich Tale\nGlimt: The Vanishing at the Grand Starlight Hotel\nNarrows\nSolitaire Jester\nWonderglade\nARCADES\nOverview\nAcron: Attack of the Squirrels! Arcade Edition\nAngry Birds VR: Isle of Pigs Arcade Edition\nJOBSPLAYTESTPRESSABOUTSUPPORTCONTACT\nPRIVACY POLICY\nResolution Games AB, a Swedish corporation, with registered and business offices at Sergels torg 12, 111 57, Stockholm, Sweden (Resolution Games) respects your privacy and provides you with this Privacy Policy (Privacy Policy) so that you may understand the ways in which we do and do not use the information you transmit when accessing and playing the Resolution Games Games, accessing and using websites, platforms, software services and related services (hereinafter the Game). Please note that your access and/or playing of the Game constitutes your acceptance of this Privacy Policy as well as our Terms of Use.\nIF YOU DO NOT AGREE WITH THIS PRIVACY POLICY PLEASE DO NOT ACCESS AND/OR PLAY THE GAME.\n\n\n\n1. Definitions \nApplicable Data Protection Legislation means any legislation in force from time to time which implements the European Union Directive 95/46/EC and Directive 2002/58/EC and the General Data Protection Regulation (GDPR) 2016/679 of April 27th, 2016 and is applicable to this Agreement and all other applicable laws and regulations that may apply to the transfer of Personal Data.\nPersonal Data shall mean any information relating to a Data subject; an identifiable person is one who can be defined, directly or indirectly, notably by reference to an identifier such as a name, an identification number, location data, an online identifier, or to one or more factors specific to his/her physical, physiological, genetic, mental, economic, cultural or social identity of that natural person. Contact data and Service Data are Personal Data.\nContact Data means any names, phone numbers, e-mail addresses and certain financial details held within commercial systems to conduct the Parties relationship management and billing transactions between the Parties;\nController, Data Subject, Personal Data, Process/Processing and Processor, shall have the same meaning as in the European Union Directive 95/46/EC or the General Data Protection Regulation 2016/679 of April 27th, 2016.\nService Data means any Partys Personal Data (that is not Contact Data) held within the Parties systems, applications or databases and that may be accessed, processed, used or stored as a consequence of performing the services under the Agreement.\nThird Country means a country that is: (i) outside of the European Economic Area; and (ii) not the subject of a formal decision by the European Commission, made pursuant to Section 25(6) of the European Union Directive 95/46/EC or under Article 45 (1) of the General Data Protection Regulation 2016/679, stating that that country ensures an adequate level of protection for personal Data.\n\n2. Collection of information\nInformation collected through the Game\nWhere applicable, access and playing of certain basic Game versions, experience of certain basic content and games features may not require registering of an account with applicable platform/service providers that are providing the Game etc. to you. However, in order to access and play the complete Game, access certain premium game functions, levels, content and features you must register an account with the platform/service providers that are providing the Game etc. to you.You must then create an account with the platform/service providers platforms that hosts the Game to access such premium game functions, levels, content and features etc. To create an account you are required to provide certain mandatory information such as your name, your email address, account login etc. which is mandatory in order to be able to establish an account. Resolution Games and/or the platform/service providers (i.e. Apple App Store, Google Play, PlayStation (PSVR), Xbox etc.) collects financial information on the terms and conditions set out in this Privacy Policy and/or the platform/service providers own Privacy Policies, which can be found on the respective platforms. Resolution Games does not use financial information for any purpose other than processing payments. Further you may, but may not be required to, provide certain voluntary information such as date of  birth, screen name, your personal profile in the Game, interests in and use of various games, products and services, and any other personal or preference information.\nResolution Games may also collect and process other information when you interact with the Game online, such as the type of browser you are using, the type of operating system you are using; the IP address or other unique identifier such as a device identifier of any of your computer(s) or device(s) that are used to access the Game. Such information will be collected and processed irrespective of whether you only access the Game or if you actually play the Game. Resolution Games may also collect and process certain information when you as a user with a user account interact with the Game such as the information in your personal profile, the relationships you form in the Game, the messages you send, the groups you form, the events you set up, the applications you add and the information you transmit information through various channels.\nInformation collected through other sources\n\nResolution Games may invite you share your email address with us for sales and marketing purposes. You may be invited to do this in the Game, related websites etc. as well as third party ad networks. By opting in to receive these emails on our website or from our ad partners, you are giving your consent to receive these types of sales and marketing emails, as well as us storing Personal Data related to such emails and related material in accordance with the terms and conditions of this agreement. \n\nIf you choose to use any invitation service to tell a friend about the Game, Resolution Games will ask you to provide Personal Data needed to send the invitation, such as your friend&#39;s email address etc. Resolution Games will send your friend a one-time email or instant message inviting him or her to visit the Game. Resolution Games stores this Personal Data to send this one-time invitation, to register a friend connection if your invitation is accepted, and to track the success of our referral program. Your friend may contact Resolution Games atprivacy@resolutiongames.com to request that Resolution Games remove this Personal Data from its database.\n\nResolution Games may also collect information about you from other sources, such as third party sites or platforms, newspapers, blogs, instant messaging services, and other End Users of the Game through the operation of the Game in order to provide you with more useful information and a more personalized experience.\n\n3. Cookies and logs etc.\nCookies. A cookie is information a website, app or platforms places on your computers hard drive or devices etc. so that the website, app or platform is able to remember your preferences and/or which pages you visited on the website/app/platform and make your visit more efficient and enjoyable. Resolution Games may use cookies to determine the number of unique players of the Game over a given period, or to remember user account details, etc. so that the need for multiple log-ins is eliminated. It may combine information collected through cookies to any Personal Data submitted online when using the Game to help personalize a users access to and playing of the Game. Cookies may be disabled on your computer by indicating this in the preferences or options menus in your browser.\nLogfiles. Log files are files that log actions that have occurred on a website, app or platform. Resolution Games may collect data in the form of log files and may use such log files to gather statistics about End Users user habits and to assess overall Game activity, including how many hits; a particular web page etc. is getting and other navigational data. These entries are generated anonymously, and enable Resolution Games and/or platforms to track interest in specific promotions, features, troubleshoot technical concerns, and provide End Users with content that may be of interest to them. Log files are used internally only, and are not associated with any particular user, computer, or browser.\nWeb beacons. The Game may use a variety of technical methods for tracking purposes, including Web beacons etc. Web beacons are small pieces of data that are embedded in images on the pages of the Game. We may also use these technical methods to analyze the traffic patterns in the Game such as the frequency with which End Users accesses various parts of the Game etc. These technical methods may involve the transmission of information either directly to us or to another party authorized by us to collect information on our behalf. The information from use of these technical methods may be collected in a form that is personally identifiable.\n\n4. Use of information  Purpose and legal basis \nResolution Games will use information about you for the following purposes in accordance with applicable laws:\nAge identification \nTo identify your age for data protection purposes, for example to determine the legal requirements for processing of Personal Data. We request that anyone under the age of 18 not send any Personal Data about themselves over the Internet unless sent under the supervision of their parent or guardian. We do not knowingly collect Personal Data from children under 13 years old in the Game. We believe it is important to safeguard the privacy of children and encourage parents to regularly monitor their childrens use of online activities. If you are a parent and believe that your child under the age of 13 has accessed and/or played the Game and provided personally identifiable information to us, please contact us at privacy@resolutiongames.com or the mailing address at the end of this Privacy Policy and we will work to delete that account and any such personally identifiable information. This in compliance with Article 6(1)(c) of the GDPR.\nInformation you provide or is collected from you in or in relation to the Game and information from other sources\nInformation is provided by you or collected in or in relation to the Game and/or collected from other sources in order to:\nprovide, operate, improve and maintain the Game, game experience and services, your account(s);\npersonalize the Game, content, loyalty programs and related services to you;\nsend technical notices, updates, security alerts,\nfor support and troubleshooting reasons;\nsend support and administrative messages\nprovide news and information about the Game and/or about our games and products;\nmonitor the end users playing of the Game and activities in the Game;\nfacilitate sharing on social networks;\nprovide adults with advertising in accordance with given consent and/or permissible laws;\nprovide children reasonable contextual advertisements in the Game accordance with permissible laws;\nidentify, fix, and troubleshoot bugs and service errors, provide software updates etc;\nresolve disputes, investigate and help curb fraud and illegal behavior, comply with the law, and to enforce our agreements and policies;\nsurvey end users opinions about the game and related matters through surveys or questionnaires;\ncommunication reasons related to the Game and related matters;\n\nto store, process and use User Created Content in accordance with our Terms of Use;\n\nto comply with applicable laws or respond to legal process (like requests from law enforcement or other public or government authorities); \n\nto administer, process and examine claims of copyright infringements, or other violations of our Terms of Use;\n\nmanage the Game and send you confirmations and important information about your account, products, purchases, subscriptions, and warranties;\npresent offers and/or information relating to the Games and other games that you might like;\nmake recommendations to you; and\npersonalize advertising for you and deliver targeted marketing, service updates and promotional offers.\nProcessing of this information is necessary for the purpose of performance of a contract to which you are a party, in order to support the operation of the Game, facilitate the delivery of requested products and services, enable maintenance and update of the Game under Article 6(1)(b) of the GDPR, and purposes justified by our legitimate interests in providing advertisements and content of interest to you and improving our services in accordance with Article 6(1)(f) of the GDPR (the balancing-of-interest rule). Disclosure of your advertising ID to third parties for the purposes of behavioral advertising is based on your consent in accordance with Article 6(1)(a) of the GDPR. We only process your information to the extent that is necessary to achieve the purposes for which the information has been collected.\n5. Storage of Personal data\nWith respect to processing of Personal Data Resolution Games is Data Controller. Resolution Games shall (i) Not keep the Personal Data for longer than is necessary for the purposes of performing the Agreement unless further storage is required in order to establish, exercise or defend a legal claim or to comply with applicable law, including accounting rules; (ii) Store, process and use the Personal Data for the sole purpose of performing the Agreement; and (iii) Ensure that their employees and employees of their affiliates and subcontractors involved in the performance of the Agreement comply with the provisions of this agreement (iv) Implement all reasonable technical and organizational measures to protect your Personal Data against any accidental or unlawful destruction, accidental loss, unauthorized alteration, communication or access, (v) Where applicable report to you, upon its occurrence, any unauthorized access, disclosure, use, modification or destruction of your Personal Data, (vi) Refrain from exporting or transferring your Personal Data to any Third Country, and from collecting, using or Processing Personal Data within any Third Country, unless prior to the transfer we have ensured that an adequate level of protection of the Personal Data has been implemented in accordance with the terms and conditions stated in section 9 of this Agreement (International Data Transfers). Personal Data are deleted or anonymized as soon as it no longer serves one of the above mentioned purposes and in any event no later than three (3) years after your interaction with us has ended.\n\n6. Information we share with third parties\nAs a general rule we will not share Personal Data that directly identifies you (such as your name, e-mail or postal address etc.) with independent third parties without your consent, unless it is either required by law or we determine that disclosure is reasonably necessary to enforce our rights, property or operations or to protect our players or third parties. We may share anonymous or aggregated information, or other data that does not directly identify you, with third parties, for instance your persona on leaderboards or to show trends about use of our products.\nNotwithstanding the forgoing, we may share information about you with certain third parties based on the legal basis in Articles 6(1)(b), 6(1)(c) and 6(1)(f) of the GDPR as follows:\nThird Party Agents and Contractors\nWe may share information about you with third party agents and contractors in order to provide the Game to you, for ongoing development, for analytical purposes etc. We will only provide information to such third party agents and contractors for their performances of their specific assignments for us and consistent with this Privacy Policy, and for no other purposes and provided that such third party agents and contractors have ensured an adequate level of protection of the Personal Data in accordance with all Applicable Data Protection Legislation and/or though agreements with us.\nSocial networks\nWhere the Game and related services are accessed and/or provided through social networks.\nThird parties \nWhen required by applicable law, rule, regulation, legal process, in the process of negotiations of, any mergers and acquisitions, sale of company assets, financing or acquisition of all or a portion of our business by another company where personally identifiable information submitted to us may be transferred to the acquiring entity.\nCourts, law enforcement agencies, legal authorities etc.\nWhen ordered or requested by courts, legal authorities etc. and required in order for us to abide by applicable laws, or to protect our rights, in defense in law suits, property or safety of Resolution Games, the Game, end users etc.\nOther end users\nIn order to provide certain Game features.\nAdvertising networks\nFor advertising purposes. We may share your advertising ID with advertising partners in order to serving behavioral advertisements to you within the Game if you have given consent in accordance with Article 6(1)(a) of the GDPR.\nWhere applicable certain third parties use of Personal Data will not be covered by this Privacy Policy. In such instances you must review such third parties privacy policies.\n\n7. Payment information\nIn order to access the complete Game, certain premium game functions, levels, content and features etc. you are required to pay certain fees. When purchasing such features and functions etc. you may be asked by the platform/service providers to provide certain personally identifiable information, such as full name, billing address, email address, phone number and credit card number/expiration date etc. Please note that you must be the age of 18 or older to make purchases in the Game, however children over thirteen but under eighteen may access and play the game under the supervision of a legal guardian.\nOnce End Users have successfully entered valid credit card information etc. and completed the order process, a purchasing account will be created and maintained for them. The platform/service providers will use the information provided to process the End Users order and to send order confirmations via email, as well as to make future purchases easier for the End User. Resolution Games does not sell, transfer or share customer information with third parties, except where applicable the information is transferred, disclosed and shared with its third-party agent(s) who uses the information solely to handle and deliver certain online activities necessary to operate Resolution Games business (e.g. processing orders and payments).\n\n8. Security\nResolution Games has taken reasonable steps to ensure that the personally identifiable information it collects is secure and we have taken reasonable measures to protect the confidentiality, security, and integrity of the Personal Data collected from our Games End Users. Personal Data is stored in secure operating environments that are not available to the public and that are only accessible to authorized employees and contractors. We also have security measures in place to protect the loss, misuse, and alteration of the information under our control. However, there is no such thing as perfect security. As a result, although we strive to protect personally identifying information, we cannot ensure or warrant the security of any information transmitted to us through or in connection with the Game, that we store on our systems or that is stored on our service providers' systems.\nPlease note that Resolution Games may provide links to other games and websites that are operated and hosted by third parties who may have their own information collection practices. Those other games and websites are governed by their own privacy policies, which may be substantially different from Resolution Games policies. Visitors to other games and websites are encouraged to review the privacy policies and information collection practices of those websites.\nAny improper collection or misuse of User Created Content or information provided in the Game is a violation of the Terms of Use and should be reported to Resolution Games at privacy@resolutiongames.com. \n\n9. International Data Transfers\nWe may transfer and share your information to third parties (including service providers operating on our behalf) which may be located in countries outside the European Union (EU) and/or the European Economic Area (EEA) which may not have the same level of data protection laws as those in the country where you are located. Where your data is sent to a country outside the EU/EEA that is not subject to an adequacy decision by the EU Commission, the transfers will only occur based on the following safeguards: i) If the entity is certified to comply with the principles for data protection under the US-EU Privacy Shield Framework (\"Privacy Shield\") (see Privacy Shield at www.privacyshield.gov), or ii) If we have entered into EU Commission approved standard contractual clauses with the entity, which is deemed to offer sufficient safeguards with respect to the protection of the privacy and fundamental rights and freedoms of individuals.\n\n10. Your Choices and Controls\nYou have the following rights regarding your Personal Data:\nThe right to request access\nIn accordance to Chapter III, Article 15 of the GDPR a Data Subject may request access to processed Personal Data. This includes confirmation as to whether or not personal data concerning him or her are being processed, and, where that is the case, access to the personal data and the following information:\nthe purposes of the processing;\nthe categories of Personal Data concerned;\nthe recipients or categories of recipient to whom the Personal Data have been or will be disclosed, in particular recipients in third countries or international organizations;\nwhere possible, the envisaged period for which the personal data will be stored or, if not possible, the criteria used to determine that period;\nthe existence of the right to request from the controller rectification or erasure of personal data or restriction of processing of personal data concerning the data subject or to object to such processing;\nthe right to lodge a complaint with a supervisory authority;\nwhere the Personal Data are not collected from you, any available information as to the source;\nthe existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing for the data subject.\nWhere Personal Data are transferred to a third country or to an international organization, you have the right to be informed of the appropriate safeguards pursuant to Article 46 relating to the transfer.\nYou shall be provided a copy of the Personal Data undergoing processing. For any further copies requested, we may charge a reasonable fee based on administrative costs. Where you make the request by electronic means, and unless otherwise requested by you, the information shall be provided in a commonly used electronic form. The right to obtain a copy shall not adversely affect the rights and freedoms of others. Please note that the access may be restricted due to intellectual property rights or trade secrets.\nThe right to object\nYou have the right to object to the Personal Data processing on grounds relating to your particular situation when the data are processed based on the balancing-of-interest rule in Article 6(1)(f) of the GDPR, see Article 21 of the GDPR. In this case, we will cease the processing unless there are compelling legitimate grounds for the processing which override your interests, rights and freedoms or if the processing is necessary for the establishment, exercise or defense of legal claims. You have the right to object to our processing of your Personal Data for direct marketing purposes at any time. We will cease the processing of your Personal Data for this purpose after the objection. Please note that if you exercise this right, your user license to use the Game and related services will cease automatically.\nRight of correction and erasure\nYou have the right to have inaccurate Personal Data rectified, in accordance with Article 16 of the GDPR.\nYou have the right to have your Personal Data erased where one of the following grounds applies, see Article 17 of the GDPR:\nThe Personal Data is no longer necessary in relation to the purposes for which it was collected or otherwise processed,\nif you have withdrawn your consent and there are no other legal grounds for the processing,\nif you have objected to the processing and there are no overriding legitimate grounds for the processing,\nthe Personal Data have to be erased for compliance with a legal obligation in Union or Member State law,\nthe Personal Data have been unlawfully processed or\nthe Personal Data have been collected in relation to the offer of information society services.\nPlease note that your right to erasure may be limited if the data are necessary for compliance with a legal obligation or for the establishment, exercise or defense of legal claims.\nThe right to restriction\nYou have the right to obtain restriction of processing in certain circumstances, in accordance with Article 18 of the GDPR. If you have the right to restriction, we will only process your Personal Data with your consent or for the establishment, exercise or defense of a legal claim or to protect a person or important grounds of public interest.\nThe right to withdraw consent \nIf we have asked for your consent to our processing of your Personal Data, you have the right to withdraw your consent at any time, in accordance with Article 7 of the GDPR. You may at any time opt out of and/or unsubscribe from emails from Resolution Games and our service providers, or withdraw consent to Personal Data storage, either via the unsubscribe link included in the emails, or by emailing privacy@resolutiongames.com. If you withdraw your consent, we will cease processing of the Personal Data for which you have withdrawn consent, unless we have a legal obligation to keep some or parts of your data. Please note that if you withdraw your consent, your right to play the Game and related services will cease automatically. The withdrawal of your consent does not affect the lawfulness of processing based on your consent before its withdrawal.\nThe right to data portability\nYou have the right to receive your Personal Data that you have provided to us in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller without hinderance if the processing is based on consent or contract performance, sin accordance with Article 20 of the GDPR.\nChanging or Removing Account Information\nAccess and control over most Personal Data in the Game is readily available through the profile editing tools on your account with the applicable platform/service provider that you are accessing the game through. End Users may modify or delete any or all of their profile information at any time by logging into their accounts. Information will be updated as soon as possible. End Users who wish to deactivate their Game account may do so in their accounts with the applicable platform/service provider that you are accessing the game through. Removed information may persist in backup copies for a reasonable period of time but will not be generally available to other End Users or visitors of the Game. You cannot however remove communications made in any communication features in the Game, which might have been shared with other End Users (for example sending personal messages to another End Users).\n\nIf you wish to invoke any of the rights described above, you may contact us at any time by emailing us at privacy@resolutiongames.com. We will process and answer your requests without undue delay and in any event within one month of our receipt of the request unless a longer period is required due to the complexity of the request. In this case, our response time can be up to three months in total as permitted by Article 12 of the GDPR.\n\n11. Disputes\nDisputes between you and Resolution Games\nOUR GOAL IS TO RESOLVE DISPUTES FAIRLY AND QUICKLY.FOR ALL DISPUTES AGAINST RESOLUTION GAMES, YOU AGREE TO FIRST CONTACT RESOLUTION GAMES AND TRY TO RESOLVE THE DISPUTE INFORMALLY BY SENDING A WRITTEN NOTICE OF THE CLAIM (\"NOTICE\") TO RESOLUTION GAMES.THE NOTICE TO RESOLUTION GAMES MUST BE SENT VIA REGISTERED LETTER TO THE ADDRESS LISTED IN SECTION 17 BELOW OR BY EMAIL WITH CONFIRMATION OF RECEIPT. THE NOTICE MUST (A) INCLUDE YOUR NAME, YOUR RESIDENTIAL ADDRESS AND E-MAIL ADDRESS AND / OR MOBILE PHONE NUMBER ASSOCIATED WITH YOUR ACCOUNT REGISTERED WITH RESOLUTION GAMES AND/OR THE PLATFORM/SERVICE PROVIDER;(B) DESCRIBE THE TYPE AND REASON FOR THE CLAIM;AND (C) SPECIFY THE SPECIFIC COMPENSATION SOUGHT, IF ANY.IF YOU AND RESOLUTION GAMES CANNOT AGREE ON A SOLUTION TO THE DISPUTE WITHIN 60 DAYS OF RECEIVING SUCH A NOTICE, EITHER PARTY MAY INITIATE LEGAL PROCEEDINGS IN ACCORDANCE WITH SECTIONS 12-15 BELOW.\nUser disputes\nYou are solely responsible for your interactions with other users of the Game. We reserve the right, but have no obligation, to monitor disputes between you and other users.\n\n12. Arbitration\nIf you are located within the United States of America, the following applies to you: Any claim (excluding claims for injunctive or other equitable relief) where the total amount of the award sought by either party is less than $10,000 shall be resolved via binding non-appearance-based arbitration initiated through the American Arbitration Association (AAA). The AAA Rules are available online at www.adr.org or by calling the AAA at 1-800-778-7879. In any such arbitration, the parties and AAA must comply with the following rules: (a) the arbitration shall be conducted by telephone, online and/or be solely based on written submissions, the specific manner shall be chosen by the party initiating the arbitration; (b) the arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise mutually agreed by the parties; (c) the arbitrator may award injunctive or declaratory relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by that partys individual claim; and (d) any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. Nothing in this Agreement shall prevent either party from seeking remedies in small claims court of competent jurisdiction.\nThe right to refrain from arbitration.You may choose to waive this arbitration term.Then neither you nor Resolution Games can demand that the other party take part in arbitration proceedings.In order to refrain, you must inform Resolution Games in writing about this within 30 days of obtaining notice of this Arbitration section.You must provide the name and address, the e-mail address associated with your Game account (if you have one) and a clear wording that you want to waive the arbitration terms.All requests to refrain from arbitration must be sent to: Resolution Games AB, Sergels torg 12, 111 57, Stockholm, Sweden and marked Waiver of Arbitration. If you do not waive this arbitration section it will continue to apply to you.\n\n13. Class action waiver\nYOU AGREE THAT ANY AND ALL CLAIMS MUST BE MADE IN YOUR INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING.\n\n14. Claims\nYOU AND RESOLUTION GAMES AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE TERMS OF USE OR THIS PRIVACY POLICY MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES. OTHERWISE, SUCH CAUSE OF ACTION IS PERMANENTLY BARRED.\n\n15. Governing law\n(a) If you are located outside of the United States of America this Agreement shall be governed by and construed in accordance with the laws of Sweden, without giving effect to any principles of conflicts of law, and the parties hereby consent to the sole and exclusive jurisdiction of the courts of Sweden, with the district court of Stockholm (Stockholms Tingsrtt) as first venue, to resolve any disputes arising out of or relating to this Agreement unless otherwise required by mandatory applicable laws.\n(b) If you are located within the United States of America, and unless otherwise required by a mandatory law of any jurisdiction, this Agreement shall be governed by and construed in accordance with the laws of the state of New York, without giving effect to any principles of conflicts of law. You agree that any action arising out of or relating to this Privacy Policy that is not subject to mandatory arbitration as set forth above in section 12 shall be filed only in the state or federal courts in and for New York County, New York and you hereby consent and submit to the personal jurisdiction of such courts for the purposes of litigating any such action.\n(c) Notwithstanding anything to the contrary, Resolution Games may apply to any court of competent jurisdiction for injunctive or other equitable relief or payment claims.\n\n16. Changes to our Privacy Policy\nThis Privacy Policy applies to all information collected by us or provided to us on and after the Effective Date. This Privacy Policy is subject to change and we may make any changes to this Privacy Policy as we see fit. Resolution Games will notify you of material changes by posting them on applicable game/app stores, and/or on the websites etc. You are encouraged to check back and review this Privacy Policy from time to time so that you will always know what information is collected how it is used and to whom it is disclosed. Your continued use of our services and playing of the Game subject to this Privacy Policy will signify your acceptance of Privacy Policy changes.\n\n17. Contact\nIf you have any questions, complaints or comments regarding our Privacy Policy, please contact Resolution Games at:\nResolution Games AB\nSergels torg 12\n111 57 Stockholm, Sweden\nEmail: privacy@resolutiongames.com\nYou may also contact the Swedish Data Protection Authority if you have any complaint regarding Resolution Games processing of your Personal Data. \nPhone: 08-657 61 00 \nMail: Datainspektionen \nBox 8114 \nSE-104 20 Stockholm, Sweden \nEmail: datainspektionen@datainspektionen.se\nLast Updated: June 2, 2020\n\nPrivacy Policy and Terms Of Use", "Developer Terms of Service": "This site uses cookies.\nWe use first and third party cookies to analyze our traffic, improve site functionality, provide you with a better browsing experience, and to advertise to you with a personalized content offer. By using this Site or clicking on \"Allow cookies\", you consent to the use of cookies.\nDecline\nAllow cookies\nGAMES\nOverview\nAcron: Attack of the Squirrels!\nAngry Birds AR: Isle of Pigs\nAngry Birds VR: Isle of Pigs\nAngry Birds FPS: First Person Slingshot\nBait!\nBait! Arctic Open\nBlaston\nCook-Out: A Sandwich Tale\nGlimt: The Vanishing at the Grand Starlight Hotel\nNarrows\nSolitaire Jester\nWonderglade\nARCADES\nOverview\nAcron: Attack of the Squirrels! Arcade Edition\nAngry Birds VR: Isle of Pigs Arcade Edition\nJOBSPLAYTESTPRESSABOUTSUPPORTCONTACT\nOUR GAMES\nTHIS IS RESOLUTION \nCOMING SOON: LEARN MORE!\nCOMING SOON: LEARN MORE!\n\nPrivacy Policy and Terms Of Use", "Space Required": "200.1 MB"}



["5 stars\n56%\n4 stars\n23%\n3 stars\n10%\n2 stars\n4%\n1 star\n7%", "Lady_MelMay 10 at 7:44 AM\nI can't believe this was free...\n\nA cute little game that involves completing fishing based tasks. It's good fun and is a great way to wind down a VR session. The surroundings are very relaxing and enjoyable to sit in. I would definitely buy any future DLC content of there was any available.\n\nMy only comment would be that as soon as you cast, a fish bites. Like... Immediately. It can be a little annoying if you just want to enjoy the moment.\n\nHelpful | 66\nDeveloper ResponseMay 11 at 5:13 AM\n\nThank you for the feedback! We'll take notes on this to keep in mind for the future. :)", "BluahBluah25 days ago\nA solid fun experience\n\nWill this game blow you away? Probably not. But I was pleasantly surprised and found it more fun than I expected from a free fishing game. I would say since it's free it's worth the time to try it out. Chill and relaxing game\n\nHelpful | 2", "bunini8 days ago\n\nThis was good game, very enjoyable and relaxing, until recently.....\nnow when I catch a fish I can't remove it from the line, making the game unplayable. I have now uninstalled and reinstalled the game and it's working now, only thing is I lost all my progress\n\nHelpful | 2\nDeveloper Response8 days ago\n\nHi, make sure you are using the grip button (middle finger) to unhook the fish and not the trigger button (index finger). Hope this helps! /Jim-Bob", "GR1F1THJun 7 at 7:42 AM\nA quick, enjoyable adventure.\n\nThis game started off strong. I loved the missions, silly characters, and zany fish. The game comes to an abrupt halt though and doesn't even reward you with the hardest end mission. The expansion does not have any new missions but the new fish and environment are nice. I play with the music off and just zone out to the ambiance. Please add \"Bait! Artic Open\" fish to the game, the fish tank from \"Bait! Under the Surface\", the starting dock as a fishing area, and more missions. I would pay for each of these and the content for most of these requests looks like it already exists. Is there a contract you'd violate for adding the preexisting content?\n\nHelpful | 5\nDeveloper ResponseJun 9 at 1:24 AM\n\nHi there! These are some great suggestions and we agree that it would make the game even better. No promises, but thank you for sharing your ideas  we've taken notes.", "udo.nink13 days ago\nBest of no cost\n\nVery nice story telling with a touch of adventure. Handling the fishing rod and the crank feels very vreal to me. I like it, I play it regularly, more of this please! Thank you so much.\n\nHelpful | 1", "RougeGoldJun 26 at 1:13 AM\nGood but can be better\n\nThe game overall is very enjoyable, with its calming presentation and environments. The fishing itself is a bit clunky and weird like the reel sometimes just not working, the fact you can get a fish bite very soon after casting and for some people the fish will scutter off almost all the time.\n\nI love the idea and respect it, and for a free game its impressive, but there is still room for improvement and we all would love to see where the devs take the game.\n\nHelpful | 2", "tonyryanJun 14 at 1:40 PM\nFor free, this is a no-brainer\n\nIf Id paid more than a few dollars then I would give it a 4 star rating as its quite basic. However, for free, this is a genuine game with a lot of peaceful fishing fun to be had.\n\nThe graphics are a bit basic and the mechanics are simple, but its relaxing and a great introduction to VR.\n\nHelpful | 4", "B_R_E_A_DJul 25 at 4:53 PM\nSpectacular\n\nFirst of all, this game is free! For literally nothing you get a fun filled cute and calming game to fish in a peaceful atmosphere. There is a variety of types to catch and a nice quest line to keep content coming. Would Reccomend.\n\nHelpful | 0", "RauelRualbeJul 17 at 8:56 PM\nMore fun than you'd think!\n\nGot this because a review convinced me it was worth downloading. It certainly is. Haven't played it much yet but it definitely is enjoyable and for a free game well???\n\nHelpful | 0", "ButterToes_YTJul 2 at 4:12 PM\nAmazing and relaxing experience!\n\nThis game is truly great! Ive spent hours playing this game and honestly there is nothing wrong with it and no reason not to get it. I would definitely recommend to anyone who likes relaxing vr games and just wants to try fishing out! If you have before irl then that would probably be a good option but this game is great for people new to fishing! Great job!\n\nHelpful | 1", "matthew.chan.71211 days ago\nIts free ,why not?\n\nIts a fun fishing game overall , and above that its free !!!\n\nHelpful | 0", "bassowApr 30 at 6:43 AM\nNot so much fishing as catching\n\nThe gameplay is kind of wonky, with line tension not quite working how you expect it to and fish following a predictable pattern of \"haha, not quite yet\" reeling in. And the music gets stale fast. But it doesn't take itself too seriously (you can catch banana fish) and the environments are kinda fun. I bought the DLC and would do so again if they came out with another one.\n\nHelpful | 6", "Drythos02Jul 14 at 4:04 AM\nvery addicting\n\nthis is a great game/experience, especially during quarantine when everyone is inside. even with some clunky controls and frustrating fish, its an awesome game to just sit down and have a good time\n\nHelpful | 1", "KBELITE5Jul 17 at 1:18 PM\nReally fun to just take a breake with\n\nI got this game cause it was free but it turned out to be a lot of fun. Whenever I get exhausted from beat saber or thrill of the fight Ill sit down and play this.\n\nHelpful | 0", "jmcgrade404015 days ago\nB\n\nThis game is super fun to play when I dont have Internet but sometimes it is kind of confusing\n\nHelpful | 0", "ryster2009Jul 26 at 10:50 AM\nIf you like fishing get this\n\nIts not realistic but you get the same gratification as if you cought a real fish great relaxing experiance\n\nHelpful | 0", "josephmckayyJul 21 at 10:38 PM\nGreat game\n\nLove how relaxing it is to go to all the different fishing spots and just chill. Its free too so why not try it?\n\nHelpful | 0", "Saint.MaximilianMar 14 at 2:33 AM\nYou guys are awesome\n\nOk so I never do reviews normally. But I just have to toot the horn for these guys a bit. I got my quest recently and bought a bunch of dumb stuff. Just been on a binge you know, vr and all. Im not a fisherman myself as I dont eat fish so it feels kinda cruel to fish for fun, but I thought hey vr is great, no one has to die for my amusement alone. I got bait as sort of a test run for the paid options out there and I have to say, bait is the only game I have ever bought that made me regret it being free. Its arcade-style yes, but the attention to detail and just care and love that have gone into this is incredible. I have the paid options now for the more real experience but bait was an absolute blast and at the free price with non-intrusive in game purchases I honestly wish there was dlc. These guys deserve my cash more than the apps I paid for.\n\nHelpful | 86\nDeveloper ResponseMar 17 at 2:20 AM\n\nThank you so much for the heart-warming words! It really means a lot to us. <3", "psychosurferJun 2 at 12:59 AM\nLoved it\n\nI loved this game the whole experience from start to finish just worked. A nice chilled game to sit and play. I wish this experience was longer I'd happily pay for a version consisting of more levels and upgrades. Great job just what a fun fishing vr experience should be. More please.\n\nHelpful | 2", "NkosahJul 26 at 12:47 PM\n\nGreat for when you want to relax with something simple. Nothing really bad to say about this free game. Just always room for improvement.\n\nHelpful | 0", "kimbiecookieMay 3 at 10:38 PM\nMy new addiction!\n\nI can't believe this game was free! Im totally addicted. Beautiful clear graphics, creatively named and designed fish and good game play. I sometimes like to sit and just chill in beautiful environments and listen to the surroundings. Truly immersive. It has a few in app purchases but its not necessary to play the game and have great fun.. You can purchase the expansion for only $3 in game which is totally worth it. It's like a relaxing vacation without leaving your room! I would love to see more expansions or maybe a Bait! 2 someday. Great job guys! See ya later! I've Gone Fishin' !\n\nHelpful | 6", "chuck.coristinJul 19 at 9:35 PM\nAlmost real\n\nNeed to track where my drink is during gameplay\n\nHelpful | 1", "SerenityOrionMay 23 at 5:17 PM\nWOW!\n\nOh my goodness, I cannot believe this game is free! The graphics are amazing, the fish are so imaginative and its so colourful and fun! I love it. I really hope there will be more scenes and fish to collect. Such a fun game and looking forward to more updates.\n\nHelpful | 2", "KieranCollinsMar 21 at 2:23 AM\nCute game\n\nIts a calming/cute looking game and its fun to play while relaxing on the couch. For example, I had a rough day at work, and when I came home, I grabbed a drink, and started to fish and it really did relax me. Im not of a fisher by any means havent since I was a kid as I felt too bad to hurt fish in real life, but I enjoyed fishing in this game. You dont need to like fishing in real life to enjoy this game in the VR if that makes any sense. Also, its free! Its a great game, great job guys.\n\nHelpful | 10", "TattleBros1Jul 1 at 5:52 PM\nThis is nice\n\nI had fun catching fish and sitting down\n\nHelpful | 1", "Sydney_RobsterJul 27 at 4:01 AM\n... hook, line or sinker? (the latter)\n\nIt looks good, but I got bored reel quick.\n\nHelpful | 0", "GARYVR50Jul 3 at 2:19 PM\n\nI really love fishing. I really enjoy the beautiful places to fish at\n\nHelpful | 0", "RobsatoApr 21 at 2:11 PM\n\nA nice an simple game to just relax a bit every now and then. It is even free without obnoxious pushing for the optional ingame purchases like some other games do (I did buy the additional lake, because I liked the game). What is there not to love.\n\nHelpful | 4", "jkaz04Jun 10 at 11:17 AM\nBest fishing game, beautiful scenery\n\nBait is so calming, the music is relaxing. I feel like I am there right now. I love this game. If you like fishing, this is for you.\n\nHelpful | 0", "Neon_DynamiteMay 3 at 4:33 AM\nAmazing Game But Multiplayer\n\nI want to be able to join my friends and fish side by side and brag about getting the better fish. Other than that though it's an amazing game that I love to sit down and enjoy.\n\nHelpful | 3\nDeveloper ResponseApr 21 at 5:37 AM\n\nThank you for sharing this suggestion. We agree that multiplayer would be a lot of fun. No promises right now, but we're saving this feedback for the future.", "SoonlarJun 28 at 12:45 PM\nBest Free game\n\nThis game is so much fun and its free!\n\nHelpful | 0", "simchiJun 6 at 7:58 AM\nNice free game\n\nChill game in between workout/active games\n\nHelpful | 0", "alkattafJun 15 at 2:07 AM\nRelaxing , fishing\n\nGood relaxing game , if love fishing and siting game for sure u will love it , its free\n\nHelpful | 0", "TorlorienJun 9 at 5:06 AM\nFun and relaxing\n\nLove it! The locations are varied and I enjoy the style and artistry that's gone into this game.\n\nHelpful | 0", "hrhsun3Jun 11 at 9:46 AM\nThis game sucks\n\nThe controller action is clunky. The platform is very juvenile. I WD request a refund if I could but found no way to. Skip this game - go right to realFishingVR instead\n\nHelpful | 2\nDeveloper ResponseJun 12 at 1:38 AM\n\nThank you for sharing your feedback! We will keep this in mind for the future. The reason for why you cannot request a refund is because the game is free to play.", "CryoDrakonMay 16 at 2:52 AM\nNot as good as I thought.\n\nWhen I first played it, it seem fun. But then I realized that catching the fish was way harder than I thought. You get little to no time to catch it and the fish always runs away when your too close. 2/5 wouldnt recommend this game to anyone.\n\nHelpful | 1", "SkylineGrandMay 23 at 5:57 PM\nBait\n\nYou guys should really make more add ons because i love the game and would definitely buy them!\n\nHelpful | 0", "gregnguyen24Mar 18 at 3:06 PM\nFun and Free\n\nSo I'm not a fishing kind of guy. I find it insanely boring and I have the hardest time catching fish lol but this game is too fun. I sat on my couch and got lost for a few hours playing. Now those complaining on how hard it is to reel in the fish, I didnt think it was that hard but there is an option for you to just click a button to reel it in too, sure it takes away the feel of real fishing but it's much easier. So far I unlocked 3 fishing areas, not sure how many there are yet but each area has different kind of fishes and some of these fishes are so cute and funny looking. All in all I found this game very entertaining and fun.\n\nHelpful | 3", "ozyconApr 13 at 5:09 PM\nDownload this game.\n\nI felt like I was on vacation, enjoying fishing in Hawaii.\nIt's probably the must have for VR devices, not to mention it is free!\nI liked the unique fishes available and the surprisingly catchy storyline.\nI played non-stop on my quest and I am very satisfied.\nDownload this game.\n\nHelpful | 1", "JCC08Apr 24 at 11:14 PM\nAwesome graphics, gameplay, relaxing!\n\nJust wish there were scary fish/creatures added like piranhas in the swamp, snakes, alligators, etc. Also maybe a bit more interaction with the environment. But for being free this game is a must-have on the Quest!\n\nHelpful | 1\nDeveloper ResponseApr 27 at 1:47 AM\n\nHi there! Thank you so much for the feedback. We'll definitely keep this in mind. :)", "Fletcher2020Jun 5 at 10:51 AM\nFor free very good\n\nGreat little game for free. Not a fan of fishing but still interesting\n\nHelpful | 0", "JasonChiefMay 15 at 5:24 PM\nThe simple things\n\nA great free addition to the library !\nSo simple yet so relaxing, a great change of pace when ending a session!\n\nHelpful | 0", "OnePoundFish94May 13 at 7:45 AM\nGreat game\n\nFor a free game the amount of play time you get is amazing and the different quirky fish are alot of fun too.\n\nHelpful | 0", "kphoenixMay 27 at 5:18 PM\nI was expecting better\n\nSadly I did not in joy it.\n\nThe controls are not great and it barely represents fishing I got in it quarantine to basically go outside and I was not impressed. I would not recommend.\n\nHelpful | 1", "jskcampMay 5 at 7:46 PM\nFUN & RELAXING\n\nI love this game!! One of my favs when I want to just unwind, fish and relax :-) I highly recommend this one. Very easy to play.\n\nHelpful | 0", "Coop25007May 29 at 3:07 PM\nAMAZING\n\nJUST AMAZING.\n\nHelpful | 0", "NanimeBerry2 days ago\nThis game is a masterpiece\n\nITS SO AMAZINGLY GOOD!!! Me and my little brother were playing for hours!\n\nHelpful | 0", "ftownheroMay 5 at 4:18 PM\nLove this game\n\nMe and my dad are hooked to this game because we love fishing in real life. My point? This game is awesome. Period.\n\nHelpful | 1", "UltimateRRC123May 12 at 11:07 PM\nAwesome\n\nI beat all quests its so relaxing wouldve payed for it.\n\nHelpful | 1", "GhengisFongJul 13 at 5:14 AM\nNothing wrong, just not 4me\n\nSo, I figured, what the heck, I like fishing, I need the relaxation, I will give it a try... As soon as I started playing it, or reminded me of another time, and another game, but I just couldn't place it... Wanted to think... SUPERNES, maybe? I think that this game would be, or actually, I think that it is great for pre-teens and younger, as a guess. It just isn't for me. It looks like they did what they did well, I just prefer a little more realism, and a more \"true to life\" gameplay, and feel. If you enjoy real fishing, then I don't think this is a game for you, but if you're younger Maybe, and have fished before, or if you've never fished before and may enjoy a more comic book like approach oh, this would be for you. I think you would enjoy it as well as it's not a bad game.\n\nHelpful | 0", "RobDoyle8Apr 29 at 10:55 AM\nGreat Free Game\n\nGood free game. Good way to start at VR\n\nHelpful | 1", "chad.hertlerMay 20 at 7:16 PM\nIf it was not free it would not be worth\n\nNuff said.\n\nHelpful | 0", "cotty01Mar 15 at 5:40 AM\nRelaxing\n\nGot this with my Quest not really into fishing but thought I'd give the a whirl. Tbh it fun, querky and the most very peaceful somewhere to escape for a while. Would like to see more maps maybe an online tournament or maybe a fishing boat so you can multiply.\n\nHelpful | 1\nDeveloper ResponseMar 17 at 2:21 AM\n\nGreat ideas. We've taken notes on your suggestions. Thank you for sharing!", "nishruu23 days ago\ngreat little free fishing game\n\neasy to play fishing game\n\nHelpful | 0", "Hank.PaulsonMar 30 at 9:06 AM\nGreat game\n\nI really enjoyed playing Bait and have gone back to it multiple times. It's a simple yet fun and relaxing gaming experience with really cool environments. Hope there's an expansion pack or part 2 coming!\n\nHelpful | 1", "SkidooshFTWMay 13 at 1:10 AM\nAwful\n\nThe line tension is terrible and really unrealistic. Takes forever to reel the fish in because of it.\n\nHelpful | 1", "FlamesmakerApr 4 at 10:11 PM\nMust Buy!\n\nIf youre looking for a free relaxing game this is a must buy. Its the felling of catching the fish that make it so much fun!\n\n\nMUST BUY!!!!\n\nHelpful | 1", "imxppMar 27 at 4:31 PM\nFun, relaxing\n\nIt's a fun and peaceful game you can relax while you play this and the nice thing is it's free and only one thing more maps would be great other wise I definitely recommend getting this\n\nHelpful | 0", "AvianFlamesMar 27 at 2:10 PM\nFirst game I tried\n\nMy family frequently finds me engrossed in fishing late into the night.\nWith imaginative fish and spots, I loose track of time.\nThe only thing I could ask for is more unlockables.\n\nHelpful | 0", "Lead_WolfDec 18 at 2:28 AM\nThank You!\n\nBait was the first free game I downloaded that allowed me to get immersed in the VR world and open my eyes to a sense of realism and fun. I love being able to fish from the comfort of my own home and enjoy a nice, relaxing yet challenging experience. The characters are cute and the visuals/audio are nice. I love the wide, creative variety of fish available and funny elements added into the game.\n\nHelpful | 40", "SwagStar59May 11 at 11:19 AM\n\nBad\n\nHelpful | 0", "QuestDog16Apr 26 at 6:02 PM\nWhat was I supposed to be doing?\n\nTried it and the game gave no instructions nor was it clear what I was supposed to do. Then again I think it may glitched.\n\nHelpful | 0\nDeveloper ResponseApr 27 at 1:53 AM\n\nHi there! When you start the game, your Fish-o-Matic can be found on your left side and will start ringing, instructions will be given once you've answered the call. Please send us an email at support@resolutiongames.com if you need more help to get started. We're happy to help!", "Black_NapalmJan 20 at 10:16 AM\nBest free game on Quest!\n\nGreat fun, lovely graphics and music, good controls and physics and its funny!\n\nOne of the first games I like to show new Questers, it always puts a smile on peoples faces.\n\nThe perfect stationary game to play while your Quest is plugged in and recharging.\n\nPaid the whopping $2:99 for the DLC just to say thanks to the developers.\n\nHelpful | 5", "missymomJan 23 at 1:22 PM\nLove this game!!\n\nFor a free game I am pleasantly surprised at how much it has to offer. Extremely relaxing and once I got the hang of casting I have now graduated to the Shady Swamp and I am currently testing a new reel for Joe Bob. I have to hurry now and finish my laundry so I can get back to my fishing! Give me more like this.\n\nHelpful | 4", "JettAEFeb 6 at 2:00 AM\nFun and relaxing free game!\n\nI adore this game. It was one of the first ones I wanted a Quest for, truly. It was easy, relaxing and fun. No hyperbole about \"real physics\" or any of that. It was a simple, straight forward game. I love the concept behind the fish and some of them are super fun to see. The way you upgrade throughout the game feels great and you never hit a point where catching all the fish becomes too easy. This is totally worth downloading and even spending the couple of bucks on the expansion. All that being said, I did experience a glitch with the dollar bait in game that was resolved but it was a headache.\nIn summary, absolutely download this and get the expansion, it's super fun and worth it if you love relaxing on the beach catching fish, or just wacky characters in general.\n\nHelpful | 25", "pith0leJun 27 at 1:11 PM\nGreat for free!!!\n\nYou couldnt ask for more from a free app! Fun fish & relaxing environments make this a no brainer addition to your oculus.\n\nHelpful | 0", "prickleypearJan 26 at 10:21 AM\nVery enjoyable, relaxing FREE have\n\nTo start, the game is free. I would encourage anyone to download and try it out, what have you got to lose?\n\nWith that being said, the game play is very simple. You cast your like and see what you catch. Every cast is the same, though certain fish are harder to catch and take more time/finesse.\n\nThere are different locales to see, I think I have unlocked 2 past the starting area. Each has a very different color scheme and backdrop to keep your visuals fresh.\n\nIn my opinion, if you like fishing games, or even just something different, that is very casual, this is a must play.\n\nHelpful | 2", "Rade0nFighterFeb 7 at 5:09 PM\nGreat way to unwind\n\nObviously not super realistic like the other fishing sims but a lovely world to relax in and hey its even got a plot!\n\nThe different scenes are all beautiful in their own way and what a great way to unwind.\n\nOnly wish there was more too it but then theres plenty of rarer fish to be had.\n\nHelpful | 1", "Keenan.ObyJan 7 at 5:43 PM\nA very relaxing and wonderful game.\n\nEnjoy all the different types of fish as well as the beautiful areas available to cast your rod! The game is definitely quirky but all the more enjoyable at the same time. The only issue I had was with reeling in with the hightest available fishing reel. All other reels flow and work smoothly without any issue, whereas the final reel seems to just release unwillingly while reeling. Have noticed reeling in reverse somewhat fixes this issues but still occurs then as well from time to time. Other than that one minor detail, this game has seen at least 5 hours of gameplay between friends, family, and I. Playable by first time fishers as well as those that have been doing it for years. Enjoy!\n\nHelpful | 4\nDeveloper ResponseJan 14 at 5:47 AM\n\nThank you for notifying us about this. We have noted down your feedback. :)", "bennybear201223 days ago\nBait\n\nThis game doesnt even work\n\nHelpful | 0", "DJaccountOculusJun 25 at 3:05 PM\nSweeeeeeeeeet\n\nThis game is awesome. The details and gameplay are next level. Now I need some audiobooks to go along with this game.\n\nHelpful | 0", "Knarf76May 24 at 11:00 AM\nVery well made, but very repetitive\n\nGame is free to install. So give it a go.\nNice graphics, good instructions, really well made.\n\nBut it is fishing. Throw in the line, wait, reel in the fish. I think that sums up the complete game. Just like real life fishing.\n\nI think of you are into real life fishing this game is really nice.\n\nJust give it a go.\n\nHelpful | 0", "VultureBitesApr 12 at 6:32 PM\nAMAZING !!\n\nI've never reviewed a game before but I HAD to review this. One day I was on my bed watching YouTube VR but I wanted to do something interactive while still sitting down so I looked for free games. I came upon this game so I downloaded it and after 10 minutes of fishing I was hooked. I've had no bugs and the environment is so relaxing and I just love it. Thank you Bait for being born !!\n\nHelpful | 0", "Craftymum66Feb 22 at 2:15 PM\nLove it\n\nLove playing this game and how relaxing it is. I've played it almost everyday since getting it on my Quest. I would love more locations to fish at and will be getting the tree house expansion.\n\nHelpful | 0", "omar.echchouini.3Jun 27 at 5:51 PM\nWoW\n\nAlli have to say is that THIS IS THE MOST RELAXING\n\nHelpful | 0", "sweetAB7Mar 14 at 11:29 AM\nUpdate please!\n\nGreat relaxing game! I need an update soon please.\n\nHelpful | 2", "RyanHamster666Feb 16 at 4:37 PM\nFun experience!\n\nI have played this game for not to long though I have found it so entertaining. I love all of the stories and puzzles throughout the game. I always loved fishing too! This is one of my favorite games on VR!\n\nHelpful | 0", "cara_amiraFeb 9 at 10:19 PM\nLiked a lot\n\nNice little adventure with beautifull fishing locations.\nOne request.. could you please remove those spooky voodoo-dolls from the swamp..? After realizing they we're there I just couldn't go back and now I can't finish the game.. :(\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 4:57 AM\n\nThank you for the review! We will unfortunately not remove it right now, but we're definitely keeping this in mind for the future. We really appreciate getting to know about this.", "sylnodelJan 22 at 10:31 AM\nFree and awesome\n\nI actualy really like this game. I had no expectations and it was a great surprise. The environments are nice and relaxing, there is a lot of different fishes to catch all more special than the other and the quests make it more entertaining and makes me want to play more. My favorite free game up to date!\n\nHelpful | 1", "DEH1971Feb 23 at 5:52 AM\nGood simple fun\n\nEasy enough to play, lovely settings to immerse yourself in.\n\nHelpful | 2", "TheBlondeBombshell14Dec 30 at 7:54 AM\namazing game for free!\n\none of the first games i downloaded when i got the quest,mainly as it was free. wasnt expecting much but what a fab little adventure game! nice game play, slightly fidgety controls at first but you pick it up, relaxing landscapes and easy to navigate maps. its a must download on the VR!\n\nHelpful | 3", "AmberGraceApr 6 at 11:20 AM\nIt was ok\n\nIt was ok but I didnt really know what to do\n\nHelpful | 0\nDeveloper ResponseApr 7 at 7:20 AM\n\nIf you need any help with how to play the game, please send us an email at support@resolutiongames.com and we will do our best to help you out!", "louisegardiner46Jan 30 at 2:55 PM\nNot bad I must say\n\nIt's pretty straight forward game, I enjoy playing on it when I just want to chill and relax sitting down it's very nice for a fishing game...would recommend\n\nHelpful | 1", "HI_5Mar 10 at 12:40 PM\nWoo hoo\n\nAwesome game made me love fishing in vr\n\nHelpful | 0", "NoobiusMaximiusJan 15 at 11:13 AM\nGreat game ! & FREE!\n\nI only wish their was more dlc, I love this game until I run out of variety of fish to catch or limited locations. DLC for more story , more variety of fish, and locations would be awesome! I got real fish VR thinking maybe itd be the same kinda experience but it seems boring. Please bring more DLC !\n\nHelpful | 1\nDeveloper ResponseJan 16 at 5:34 AM\n\nThank you for the kind words! Hopefully we can bring out more content in the future. :)", "Mark-BlissJan 26 at 8:47 AM\nCute\n\nThis game is very cute and the graphics in it are excellent. However I find myself bored very fast. But then in real life I find fishing boring. Theres no motion sickness to this game so if you just wanna sit back in a chair and be on the VR and have some fun its perfect. Very slow paced very relaxing and definitely worth the price.\n\nHelpful | 1", "michael.t.fannJan 27 at 6:23 PM\nFive stars, but it deserves ten!\n\nI love this game. It's my go-to for a good relaxing experience. My only complaint is that I enjoy it too much, it's so easy to loose track of time with this game...\n\nHelpful | 2", "jso1227Jan 27 at 12:59 PM\nVery entertaining !\n\nEven if I had to pay for this game it would be worth it! Great intro to VR fishing. I hope they continue with development.\n\nHelpful | 3", "noramar007Feb 13 at 2:50 PM\nAmazing!!!!!!\n\nLove it but the graphics could be a little better but its free\n\nHelpful | 0", "ben_in_dallasNov 29 at 8:18 PM\nBest. Game. EVER.\n\nThis is by far my favorite game on my oculus. I absolutely adore the game mechanics and how relaxing the settings are. I also enjoy the small little jokes they put around to kind of poke fun at southern people, such as naming the shop owner Jim-bob. It is less stressful than most games, which is healthy and lets you wind down a bit. The fact that its free is outstanding. I like it more than Beat Saber and Moss, which both cost $20+. I have read other comments saying that the reeling scratches the controllers, but no game is perfect. It is a great intro to fishing and can help you get started for real. So magnificent, its a crime.\n\nHelpful | 8", "0ops1eMay 20 at 8:31 PM\nMy gf loves it\n\nShe is loving this relaxing vr fun. First non video content she enjoyed. Should add a quest or something screeching in (kissing) your catch. ;)\n\nHelpful | 0", "YorkyTrevJan 18 at 7:10 AM\nGood introduction to fishing vr style\n\nIt's free, it's relaxing, you catch fish virtually so you can't cook em. But it's a light hearted intro to fishing. Go on dive in, it'll keep you entertained for a little while.\n\nHelpful | 0", "destro99Jan 19 at 4:05 AM\nAmazing !\n\nDown the years I've tried many different fishing games but never found one as fun as sega bass fishing ! We have a winner now , this game is great fun ! Great to look at ! A chill fest ! Well done to the development team ! Great job .\n\nHelpful | 1", "FwakDec 15 at 6:00 AM\nSurprisingly good!\n\nI thought fishing games sound like a boring concept, but this is actually really nice, relaxing and fun!\nAmazing graphics, very polished.\nYou get a lot of game for free before you have to decide if you want the paid DLC, by then you will know. Even without it its a good size game, and its free so why would you not!\n\nHelpful | 2", "hankster2112Dec 29 at 4:01 PM\nA great fishing simulator\n\nThis is a great free game I must play for everyone loads of fun the physics engine is really well done just like fishing you can do it in your living room awesome game I must try\n\nHelpful | 3", "JustaIndianDec 26 at 8:37 AM\nGreat bonus to have on your headset\n\nWhile the game may have simple graphics and a gameplay system that isnt too in depth, Ive had multiple hours of fun in this game whenever I just need to sit down and relax. Plus its free! Guaranteed must have.\n\nHelpful | 1", "jst65Dec 28 at 4:12 AM\nWhat about spinning reel instead?\n\nFive stars for free relax and fun. I love the fish descriptions, apparently humor didn't get lost in translation.\n\nI went fishing only once as a child, still the eyes facing up look weird to me.\n\nSpinning reel should be much better suited to the player, given he is a beginner.\nUsually spinning reel = eyes and reel facing down, baitcaster = up.\n\nHelpful | 1\nDeveloper ResponseJan 14 at 5:45 AM\n\nGreat suggestion, thank you for sharing it with us!", "godyuMay 17 at 5:18 PM\nlocal multiplayer\n\nThe game is great, I hope to increase the local multiplayer, play fishing with my family.\n\nHelpful | 0", "unionzApr 25 at 3:44 AM\nActually a good game\n\nGot it as a joke not seeing the appeal , never been fishing in my life , but actuly quite a sick and relaxing game\n\nHelpful | 0", "CokeHeadNov 5 at 8:08 AM\nRelaxing little fishing game\n\nI noticed this game was free the other day, so I said, why not?!\nThis game is great for what it is.\nBright and bold colors with great graphics.\nIt's cartoony, but that adds to the fun.\nIt's relaxing as well.\nI would give it five stars, but I cant seem to side throw (cast) my reel.\nOther than that, it's pretty flawless!\n\nI'd recommend people to try it!\n\nHelpful | 17", "Porkman202Jan 25 at 1:53 AM\n\nThis is so simple but fun. My mom likes to play it\n\nHelpful | 2", "Maxmk8May 22 at 3:58 PM\n\nGreat game fun and relaxing\n\nHelpful | 0", "bonbonkitty32Jan 3 at 3:06 PM\nBEST FREE GAME EVER\n\nIts amazing that you get to fish from your room\n\nHelpful | 4", "HardcoreHarlowDec 26 at 3:32 PM\nNice relaxing stationary game\n\nGrandma loves it! You catch fish, sell em, and upgrade gear. Rinse and repeat. Good for winding down at the end of the day.\n\nHelpful | 1", "icetraighJan 27 at 7:57 AM\nA lot of fishin' for free!\n\nHaving a lot of fun with this one\n\nHelpful | 1", "OldManFukUrPussJan 11 at 11:04 PM\nI love it\n\nI absolutely love this game I have genuinely never felt so calm and tranquil in my life\n\nHelpful | 2", "jjowyOct 23 at 12:53 AM\nEasy and relaxing game, but lacking\n\nThis is a very chill fishing game with a nonexistent learning curve. I had a lot of fun with it, but also some complaints.\n\nThe environments look great. The art direction was done very well. All the fish are made up with funny names with amazing models and textures. Looking and admiring them was half of the game for me.\n\nGameplay is very simple. There is no learning or skill curve. Once you catch your first fish, that's how you're gonna do it every time from then on. I really wish there were new mechanics later on or fish that required some skill to catch, but unfortunately there wasn't. Also would've been nice variation, if you could pick between a few fishing spots at every location. Catching fish gives you money, depending on the fish and it's star rating (1-3 stars). With the money, you can buy some new fishing rods, reels, bobbers and bait, which give you a small, behind the scenes benefit to something, like your fishline being more resistant to breaking.\n\nSound and music are spot on and complement the scenery well. Gets you to the right feeling and creates a chill atmosphere.\n\nStory, dialogue and voice acting are bad and very lazy, unfortunately. It does it's job to push you forward, going through every fishing spot. Other than that, it's just lackluster and awkward.\n\nThe expansion fishing spot is more of the same. Beautiful environment with cool new fish. The fish bait that you can buy with real money comes with only 20 uses. Having a consumable item behind a paywall is just scummy. Especially as I'm pretty sure the bait and the expansion fishing spot are required to finish the last mission, to catch every fish in the game. Buy these only if you want to support the developers (and I still think you should).\n\nI came across some visual bugs, as some fish had flipped normals. Also, after you beat the story, there is a story bug with your boss saying to you through the radio to \"Get back to fishing\", which is very weird. You'll know why once you finish the story.\n\nHelpful | 9\nDeveloper ResponseOct 23 at 4:24 AM\n\nThank you for the in-depth review! You have a lot of good ideas that would be cool to have in the game. We can't make any promises right now, but we really appreciate the feedback.", "tzoldOct 26 at 3:18 PM\nFishy find.\n\nA cartoon heavy fishing frenzy that delivers enjoyment for a one time play through and what a price!!? The devs could have charged a small amount for this one and I would still be happy. Has a small in game purchase that I was a little annoyed by but other than that hiccup it really was worth the time.\n\nHelpful | 7", "JudeOsborneNov 17 at 5:26 AM\nGreat\n\nFor a free game - its really well made with no bugs that I have seen. There arent many games you can play sat down while the headset is charging but this one is great. it is really relaxing and perfect for winding down at the end of the day\n\nHelpful | 0", "deadlyblow4kMar 30 at 8:48 PM\nCool game\n\nI saw Lachlan play this and thought this was pretty cool so I downloaded and Ive grinded and I love it more than rec room\n\nHelpful | 0", "hobblin_goblinNov 7 at 12:34 PM\nGood, free fun\n\nThis game is very relaxing, and it seems like it has a decent amount of content, especially for being free. It just lacks some polish in my opinion, but still, a solid title.\n\nHelpful | 1", "Samm33Sep 8, 2019 at 3:42 PM\nAwesome\n\nIf you have been fishing in real life, this was very close to the real thing. I do think there could be a couple things that could be improved. When I pulled up on the fishing pole while it was in the water, there was no movement of the pole bobbing up and down. The other thing is the release for the line should be the A button instead of the back button push area on the back of the controller just like a real fishing pole had the release in the front. If those two things were fixed, this would be so realistic. This game was really well done and have enjoyed playing it.\n\nHelpful | 16\nDeveloper ResponseSep 12, 2019 at 1:48 AM\n\nThanks a bunch for the feedback! We'll keep it in mind for the future.", "hightechfoolNov 24 at 12:33 AM\nRelaxing and fun!\n\nHonestly, I like this game more than some of the ones I've PURCHASED! It's relaxing, beautiful and quite fun. Easy to learn and just a great VR experience\n\nHelpful | 0", "Tyso3600Mar 31 at 12:50 PM\n\nSo relaxing\n\nHelpful | 0", "Kh3nazOct 6 at 11:13 PM\nSeems fun but isn't playable\n\nGame seems fun but isn't playable, when reeling, both controllers smash into each other, simple fix would be to place the holding hand lower or the reel higher, or make the reel longer, I'll come back to it eventually and see if this is fixed, unfortunately for now I cannot recommend it.\n\nHelpful | 11\nDeveloper ResponseOct 7 at 1:54 AM\n\nHello! Thank you for the feedback. We've received several reports on this and we're looking into it. For now, you can grab the reel and then move your hands apart a little to make sure there's enough room between the controllers. Hope that helps!", "tooshyforloveNov 23 at 12:34 PM\nNeed new updates\n\nI love it but there is nothing new when will this happen\n\nHelpful | 0\nDeveloper ResponseNov 25 at 5:56 AM\n\nWe're so glad you enjoy the game! At this point in time we haven't announced any new content, so we'll have to wait and see what happens in the future.", "Blakegame11Mar 16 at 7:33 PM\nKids love it\n\nMy kids and myself really enjoy this game!\n\nHelpful | 0", "UGDIdhanNov 15 at 11:26 PM\nBest free games on the oculus store\n\nI enjoyed this game more than the other free games on the quest store.if you want a free game to play this us the game you are looking for\n\nHelpful | 0", "invisibledig266Dec 4 at 6:13 PM\nSoo relaxing!\n\nI would gladly for 5 bucks for this game!\n\nHelpful | 0", "7KOct 14 at 4:00 PM\nGreat but one problem\n\nI really like playing it and is relaxing and fun. But the main problem is that when reeling in the controllers constantly hit each other. I dont want to give this game less than 5 stars just because of that but I (and others) would really appreciate it if it was fixed. Other than that, great game, especially with it being free!\n\nHelpful | 2\nDeveloper ResponseOct 18 at 1:29 AM\n\nThank you so much for the review! We're looking into the reeling since we've gotten a lot of feedback on this. As a work-around you can grab the reel and then move your hands apart a little to avoid the controllers colliding. Hope that helps!", "thisisPrandallSep 26, 2019 at 8:41 AM\nEnjoyable and relaxing\n\nIm not even an avid fisherman in real life, and who actually watches fishing on tv without falling asleep?\n\nBut this game is beautiful to look at and strangely addicting to play. Its super relaxing and laid back. The music is delightful and I love the different areas to fish.\n\nDefinitely grab this one if you want something to chill to play when you just feel like laying back and immersing in a calm VR experience\n\nHelpful | 0", "Roxtar73Oct 18 at 4:04 PM\nIts cartoon fishing UPDATED REVIEW\n\nUpdated review: My Quest crashed on me requiring a Factory Reset due to a corruption of the file SystemUX. Which is no fault of this game. However upon doing so I lost all my save progress on all my games, including bait. While it sucks its not that big a deal. However what is a big deal is I payed $1 for a container of the grub bait. Now its gone. Ive got the treehouse river dlc back back my bait is missing. This was the one game I wasnt worried about because it seemed like it cloud saved but I guess I was wrong. I had used maybe 2; in all honesty Im not sure I ever actually used any. I had lots of the other 5000 gold bait I was using and I had the upgraded free bait so I was waiting on using the Grub Bait. Anyhow if there is a way to return it to my tackle box that would be great and I could give back that star yall lost for not having cloud saves. Thank you. Also thank you for such a great game.\n\n\nI absolutely love this game. It feels like Im in a looney tunes cartoon and bugs bunny could show up any moment. The fishing is great and I prefer to use the trigger to reel as I imagine I would if that was an option in real life. The types of fish are ridiculously hilarious. Everything feels really good on this game and if your not looking for a real life sim but an arcade fishing game then this is for you. The fact its free and you can play the whole story without paying a dime is excellent but of course I but the expansion river. Its only one spot but its also only $2.99 so no complaints there. I would like to see a couple more fishing spots added and maybe even a paid storyline. If there were say a $4.99 expansion that added 2-3 new spots and more story that would be well worth the money to me. Love this game cant state enough how much fun Im having with it. The only real drawback is the lack of fish types in each spot. So it gets a bit repetitive but the fishing is spot on.\n\nEdit: This is mostly for the game devs. Two weeks on and this is still one of my top five games thus far. Space Pirate Trainer is my top pick but Bait is easily number two or three. I havent played Moss yet ;) so this is what I wanted to talk to the devs. The game is good but short, too short. Now dont misunderstand me its a free game so its ok that its short. That said I would gladly pay $15-$20 for a full game with like 5 worlds each world having 4-8 fishing holes. Perhaps less lakes in an area is compensated by more fish type per lake. There should be a minimum of 25 fishing holes across 5 areas or Worlds. Each of the current levels have a unique theme. Perhaps those themes could become overworked themes and each level would be decorated according to the world theme. Ie swamp world would have several different types of swamp locations. Each world would have their own unique gear and bait shop. This would add a lot of variety to the game. Also maybe adding different attributes that would change your fishing ability or make some fudge easier to catch while others become ha see to catch. Also could affect bite willingness of fish. This game has a lot of potential and I would pay good money to have a larger more fleshed out version of this game. But I want more. Lots more. I believe in you guys, your product is excellent and has a wonderful sense of humor in the fish design. More of this cant be bad.\n\nHelpful | 1\nDeveloper ResponseSep 23, 2019 at 2:07 AM\n\nWe really appreciate the feedback! Thank you for sharing this with us. It has not gone unnoticed and we'll keep it in mind in the future.", "StaticCloudNov 22 at 10:27 AM\nOK\n\nIt's what you'd expect. Just a lot of fishing and upgrades with a cozy cartoon style. Although the handle you use to reel in fish is incredibly small. Leaving me with a right controller with scratches from quickly turning the left controller next to it. Other than that, it's OK.\n\nAlso noticed a review having the same problem with the response \"we're looking into it\" Well I looked into it and please just make the handle longer. That's it. Make it longer for the love of god.\n\nHelpful | 1\nDeveloper ResponseOct 28 at 2:47 AM\n\nWe do apologize for any scratches this may have caused! We currently have to prioritize other tasks, but we're aware of the issue. To avoid this happening again, our best advice right now is to grab the reel and then move your hands apart a little to make sure that there's enough room between the controllers.", "Link29011Nov 29 at 5:05 PM\nIt is so good I almost feel asleep!\n\nIt... is... so... calming...\n\nHelpful | 0", "pjwhritNov 9 at 7:06 AM\n\nSuper fun to sit back and relax and enjoy the beautiful scenery while catching crazy fish. My sons go to game\n\nHelpful | 0", "OH_zkrNov 19 at 9:58 AM\n\nIts a nice and chill game AND its free!\n\nHelpful | 0", "shane.tietzJan 12 at 2:13 PM\nWorst game ever\n\nGABAGE\n\nHelpful | 4", "CasualCheetahSep 1, 2019 at 11:43 AM\nA Reel Catch for the Quest\n\nA glamorous price for a polished, relaxing, and compact game. Each location feels great to be in and the water looks real enough to dive into. Its nice to have access to another chill, sit-down VR game even though, like the ponds you fish in, the game gets predictably shallow. Outside of fish variety and a biting fish's persistence, your first cast will be no different than your last. Using two controllers for reeling is rough since they end up very close and bump into each other. Nonetheless, Bait is certainly worth downloading if you're in-between games.\n\nHelpful | 0", "ChavsniOct 20 at 11:43 AM\nCan't believe this is free.\n\nGreat game, relaxing and fun with very nice colorful graphics. I'm not even into fishing but I like to chill and go fishing for a bit.\n\nHelpful | 0", "Zog_OwONov 5 at 6:29 PM\nFish\n\nGame is Fish\n\nHelpful | 1", "KenyehWestOct 22 at 7:29 PM\nNot fun...\n\nIf youre coming into this expecting VR Red Dead Redemption 2 Fishing... youll be very disappointed.\n\nHelpful | 5", "jdpvoltzOct 21 at 2:24 PM\nFix the Reeling\n\nI dont like having my controller so close to my other controller. I have to pretty much scrape them together to get this to reel in the line. Give the user more space to reel.\n\nHelpful | 2\nDeveloper ResponseOct 22 at 2:21 AM\n\nWe've received several reports on this and we're looking into it. Thank you for the feedback! For now, the work-around is to grab the reel and then move your hands apart a little for more space in-between the controllers.", "muchacho123321Nov 4 at 2:30 PM\nGreat but\n\nIts a really good game but when you finish it it gets pretty boring\n\nHelpful | 0", "ZeffexAug 13, 2019 at 7:50 PM\nStrangely addictive\n\nI thought that I would play this game for a day and drop it as soon as I got another game. But the experience of catching odd creatures was very captivating. I completed the game and captured every fish but I needed to catch a single piece of garbage in order to 100% the game, and after 2 days of constant fishing I could not collect a pice of garbage because I was so high level. Honestly the garbage section should have either not expiate or just did not need to be collected to complete the game. I hopefully did not soft lock myself and can still 100% the game.\n\nHelpful | 10\nDeveloper ResponseAug 14, 2019 at 1:11 AM\n\nHi, garbage can sadly still be found after completing the game. I'd focus my search to Cherry Falls and Ocean Lake. Happy fishin' /Jim-Bob", "LanaDuncanOct 7 at 8:11 PM\n\nLove this game. I hope there is alot more expansions to go. I don't think anyone that plays would mind paying for more.\n\nHelpful | 0", "romansulima1608Oct 29 at 5:41 PM\nCool\n\nVery nice\n\nHelpful | 0", "TavoBenOct 20 at 6:00 PM\nHi\n\nIdk watch to write\n\nHelpful | 0", "FloppyMoppyAug 7, 2019 at 12:01 PM\nReally fun game!\n\nLike I said, this game is fun, but that doesnt mean that theres no problems with it. To start, reeling in fish is incredibly hard to do with the quest controller. I see them numbing and hitting in to each other a lot. The menus are also a little outdated, but thats far from ruining the game. Amazing game!\n\nHelpful | 0", "KubikerOct 6 at 4:30 AM\nWorthy!\n\nFree but well made game. Just wish more locations and shop items. Thank you a lot!\n\nHelpful | 0", "DJEmergencyAug 16, 2019 at 3:31 PM\nAwesome!\n\nThis game is relaxing! I wish there was multi player so I can fish with friends. Please add that to the next update.\n\nUPDATE: I decide to update my review to be a bit more thorough..\n\nBait! Is a great game to play when you just want to relax and fish. You would think since its free that you will have to pay to win, but thats far from the case. You can complete the game without adding money to it. Theres a total of 5 scenes to fish from with plenty of fish to catch. Each fish has a rating from 1-3 stars based on its weight. The more weight the higher star rank you get. You have two shops to purchase stuff, One to upgrade your equipment and another to buy bait from that will better your experience. The first time I completed the game it took me about three hours to complete. I purchased the scene they had for sale and the $.99 bait they had to offer. The second time I completed the game it took no less then an hour to complete. I havent finished catching all 3 star fish yet which will take me awhile to do.. So I dont know yet what happens when its done. As for some issues.. When the game was first launched I found it difficult to reel the fish in due to the hit box being so small, but later they provided an update that fixed it. The other thing is I had to get my Quest replaced and so the rest of my $.99 bait was gone with no chance of getting it back.\n\nAfter I get all 3 star fish I dont think there would be enough to continue to go back to it. I think a good way to keep people playing is to add a multiplayer option with more missions to do. Being able to hang out with friends while finishing would be a nice touch! Even though its few flaws I still rate it 5 stars, because it keeps to its promises while being fun. Make sure you give the developers some cash and buy that extra scene. Its well worth it!\n\nHelpful | 2", "spriterightsJul 29, 2019 at 8:36 AM\nAmazing Quest Title\n\nFirst played this on the Go which was very enjoyable, but playing on the Quest makes it so much better. Story is a little on the short side and I wish the expansion included some more quests but it's hard to ask for more when the game's free and the expansion is so cheap. Would gladly pay for more content in the future!\n\nHelpful | 7", "WILTAYJul 26, 2019 at 4:37 AM\nRelaxing and fun\n\nI've been playing this on and off for a week or so now and it's great.\nI don't get to spend as much time with the Quest as I'd like but this game is great if you only have time for ten minute spells. It's strangely relaxing just sitting there, fishing.\nOn top of all that, it's free.\nI haven't finished the main story yet but when I do I'll probably buy the add on.\n\nHelpful | 1", "LittleGideonSep 30, 2019 at 5:19 AM\nOne of the best free titles\n\nIts relaxing, addictive, and has great graphics\n\nHelpful | 0", "Capta1nHuxMay 23, 2019 at 2:55 PM\nFantastic Free Title!\n\nI expected a large pay to win aspect when I saw the pricetag (or lack of one) but quickly came to realise it was not the case. Yes the game does have IGPs but it's still perfectly playable without it! It's an easy to learn game and I would definitely recommend to all VR users\n\nHelpful | 171", "Susara86Sep 21, 2019 at 12:45 PM\nFantastic little free game!\n\nTook a bit to get the hang of the controls but its a lot of fun!\n\nHelpful | 0", "SirPandaNipzAug 8, 2019 at 7:04 PM\nJust WOW!\n\nHonestly guys and gals, pick up this free game! Itll keep you going for hours and its honestly so relaxing compared to other games. Just take a seat and enjoy a little bit of fishing. If only real life were this fun for fishing \n\nHelpful | 1", "vadim.gorodetskyAug 27, 2019 at 2:34 PM\nExcellent title for free!\n\nMy wife is addicted now. She says all is missing is beer.\n\nHelpful | 0", "Emanuel20Aug 2, 2019 at 11:16 AM\n\nFun free game. Just relax in your chair and catch some fish while enjoying the views. I think it would be nice if you could chat with other people while fishing (i.e., similar to rec room). Maybe add some multiplayer component to it? Or if you could walk around and explore your environment?\n\nHelpful | 2", "FinnyWiggenJun 13, 2019 at 2:25 PM\nMixed Feelings\n\nI have played this game a lot. Not because it is the most fun, but because it is one of the only casual games available, where I can sit and play without having to stand. The game itself is alright. It works, and I have had very few issues or bugs. I will say that the grammatical errors in the dialog are a bit too (not to) much for me. But that is okay.\n\nOver all, it is a good way to waste some time.\n\nHelpful | 3\nDeveloper ResponseJun 14, 2019 at 3:54 AM\n\nThank you for sharing your feedback with us! It has been passed on to the development team.", "eliasvwggJul 12, 2019 at 1:48 PM\nSo relaxing\n\nI really love this game, after some fast past games this is the perfect place to relax. I play it a lot right before i go to sleep and it really helps. I would love if there was a free roam version. I really hope some devs see this cuz this would be awsome in multiplayer. Just without earing money in it. Just 2 or more chairs next to eachother to see and talk to a friend next to you. Hopefully someone see this and tells me it's a good idea or maybe something already in progress.\nAgain, i love this game.\n\nHelpful | 4\nDeveloper ResponseJul 15, 2019 at 12:27 AM\n\nHey eliasvwgg! Thanks for the kind words and the idea. It is a great idea, although we can't make any promises of it happening right now. The developers have received your message.", "Rtrago89May 30, 2019 at 5:19 PM\nInstantly addicting\n\nThis was the first game my wife tried on our new VR. It instantly becomes addicting! She beat the initial story and purchased the add-on which is a new fishing location. Myself, our daughter, and our kid neighbor have all played it and never want to stop lol The graphics are slightly pixelated but still vibrant and beautiful. Its truly a peaceful relaxing game, if you like fishing youll love this fun game\n\nHelpful | 23", "Jenko4starJul 14, 2019 at 12:51 PM\nMAKE THE REEL HANDLE LONGER!\n\nThis game is absolutely brilliant but unfortunately the reel handle is so short you and other people are constantly smashing your very expensive remotes together whilst they reel in. I know there's the option for trigger reeling but it spoils the realism, so please make the reel handle longer then I will give 5 stars and make in app purchases.\n\nHelpful | 4\nDeveloper ResponseJul 15, 2019 at 12:39 AM\n\nYour feedback has been noted and sent to the developers. Thanks for taking your time to let us know what you think. We're seeing this feedack quite a bit and we're definitely aware of this wish from the community!", "BlindNinja24Dec 11 at 7:05 PM\nGreat\n\nIts great\n\nHelpful | 0", "jojasJun 21, 2019 at 9:30 AM\nReally Fun!\n\nI love this game! It is relaxing and fun seeing which colorful fish ( or piece of trash) you have caught. I would pay for more dlc, and hope more environments and different fish will be released soon! As a matter of fact, I would buy EVERY dlc they made available. It's that fun!\n\nHelpful | 3", "ray.bradshaw1Aug 28, 2019 at 1:20 PM\n\nGreat free game recomended\n\nHelpful | 1", "DDay619May 26, 2019 at 2:06 PM\nLoved it on GearVR, better on Quest\n\nThis game is really, really good for being free. I love all the whimsical fish types and the chill music setting the perfect vibe for each location. The menus and navigation are fantastic.\n\nIt's so nice to have a mellow seated experience once you're worn out from boxing and dodging bullets.\n\nConstructive criticism/feedback: Once or twice every minute or so I'll see the screen \"tear\". It's a quick horizontal strip running the whole width the of screens, mostly white or gray, just a few pixels tall.\n\nHelpful | 6\nDeveloper ResponseMay 27, 2019 at 4:44 AM\n\nHi! Thanks for sharing your feedback with us. We're currently not sure what may be causing the screen tear, but our dev team has been informed and will look into it.", "dietzt2008Jul 25, 2019 at 8:35 PM\nGreat way to kill time\n\nIts free and has good graphics. Very clear images and fun fishing physics.\n\nHelpful | 1", "JonOneUKAug 23, 2019 at 3:05 PM\nIt feels so reel\n\nIt reely does feel so reel\n\nHelpful | 0", "galvanizedgazelleJun 27, 2019 at 6:20 PM\nSuper cute!\n\nFirst of all, the environments look amazing. Something about the water just blows me away. The fish are also pretty cute and I enjoyed looking at their designs and descriptions (they arent based off real fish, but are punny or cartoonish instead). Isnt overly predatory with microtransactions. It's free, so I cant think of a reason why not to try it, lol\n\nHelpful | 1", "jdpruittMay 22, 2019 at 4:26 PM\nMost chill game ever on quest\n\nI spent over an hour just fishing and being completely relaxed in this game. I had a stressful previous few days and this game completely cleared my mind. Absolutely loved it\n\nHelpful | 17", "lostlivesMay 28, 2019 at 11:37 AM\nSell mechanics on Unity store!\n\nThis needs to be the standard for future MMO fishing experiences. I hated fishing on MMO's until I saw the potential or this in VR. Thank you for making this free but please sell this on the unity store including the beautiful nature assets. I am most definitely buying the expansion for your game\n\nHelpful | 4", "MEKABLUJul 28, 2019 at 11:32 AM\nLOVE IT\n\nIts very relaxing one of the best fishing VR games\n\nHelpful | 1", "itsDavidDugganJul 17, 2019 at 6:31 PM\nReally Enjoyable\n\nI haven't gotten to spend too much time in this game so far, although I would highly recommend it. The game looks fantastic and plays smoothly with the bonus of it being free! Must have for the Quest and I haven't run into any problems at all while playing.\n\nHelpful | 2", "SILENCE_NINJA_YTAug 10, 2019 at 11:17 AM\nAmazing free game\n\nWARNING hard to stop playing!\n\nHelpful | 2", "Freshjazz49Jun 5, 2019 at 1:31 PM\nJust love and relaxation\n\nThere are apps for relaxing on the marked, especially for the go and I'm sure there'll be some for the quest, too in the future... But this game is the definition of relaxation. It's slow paced and makes you calm down, while trying to catch some fish and enjoying the beautiful environment. A multiplayer is missing IMO\n\nHelpful | 2", "chubspud2803Jun 5, 2019 at 11:11 PM\nNot the best\n\nSo Bait! has quite good graphics and is a bit cheesy with Jim-Bob but the one thing that made me give this 2 stars is the fact that when I try winding up the reel it scratches my 2 controllers together. Please make the reel handle longer so I wont damage my controllers. Thanks.\n\nHelpful | 6\nDeveloper ResponseJun 7, 2019 at 6:14 AM\n\nWe really appreciate that you're sharing this feedback with us. We're looking into this right now. You can grab the reel and then move out your hand a little to make sure you get more space inbetween your controllers.", "just2jaysJun 1, 2019 at 1:48 PM\nGreat free game!\n\nThis is a great game for the price of free. Immersive and fun. The game plays at a nice pace with missions and tasks coming from the cartoony & playful characters. The rod controls are a bit tough, though it might depend on the hardware youre playing with. I found the reel very tiny, making reeling in a fish tougher than it should be. But thats my only gripe so far. If youre looking for a chill fishing game with a semi-realistic feel, you wont be disappointed here.\n\nHelpful | 0", "philg7onr123Jun 14, 2019 at 12:27 AM\nVery nice place to fish\n\nMuch better than expected, considering it's free. The lake and environment are really relaxing if you want to chill. I turn down the music, sometimes just sit and enjoy the ambience, the sounds of nature, lapping water, the scenery. Then maybe fish for a while.\nNice and relaxing.\nHave really got into fishing on Bait, find this very immersive, moved on to shady swamp which is a really good environment. Would welcome more of this type of game. The quality is excellent, graphics amazing, game play absorbing.\nExcellent game !\n\nHelpful | 2", "crazygirlie89Jun 22, 2019 at 5:09 AM\nStill no metric\n\nI played this game on my Gear VR last year and was told after my review that they would look into adding a metric option.\nI'm very disappointed to see that that English + metric is still not an option, even though that is exactly what is shown on the screenshots for both Gear VR and Quest!!!\nI'm sorry, but the imperial system really means nothing to me, and since the USA is pretty much the only country still using it I don't think I'm alone in this.\n\nHelpful | 0\nDeveloper ResponseJun 26, 2019 at 5:12 AM\n\nHello! The devs have been notified about this. Unfortunately we can't promise that this will be added right now, but hopefully it's something that can be done in the future.", "HotRust27May 25, 2019 at 8:42 AM\nBeautiful fishing game\n\nGreat game to chill in, graphics look super, the water effects is very realistic. Only small gripe is I found sitting in my virtual chair that I was super low for some reason. Perhaps a sitting height adjustment would be helpful for some?\n\nHelpful | 6\nDeveloper ResponseMay 27, 2019 at 4:39 AM\n\nThank you for the feedback, HotRust27! I've passed on your thoughts regarding the chair to our development team.", "del3dJul 23, 2019 at 10:46 AM\nCan't believe it's free!\n\nAwesome VR experience, fabulous graphics, audio, story and characters!\n\nHelpful | 1", "TinmaniaaJun 29, 2019 at 4:45 PM\nAlmost Unplayable Flaw\n\nLike the idea of the game and the physics seem good. But there is one heck of an annoying flaw. Its very difficult to reel in anything due to the fact that your hands need to be so close together, to the point of crashing the two controllers together. If you move away your hand falls off the reelyour fish gets away. Out in the real world (no pun) we arent holding a fishing rod with out bare hands: we are holding two rather bulky controllers. Its as if the designer is unaware of this or it was developed for a platform with smaller controllers. As it is I dont enjoy it. Too frustrating. Seems to me they could make the virtual reel handle longer so in the real world you arent hitting your controllers together. Guaranteed I would not mind that, even if it looks longer than a real reel.\n\nHelpful | 1\nDeveloper ResponseJul 1, 2019 at 1:28 AM\n\nThank you for taking your time to write down this feedback! We've made sure to pass on your message regarding the reeling handle to the development team.", "kem423Jun 2, 2019 at 5:55 PM\nGreat meditation and relaxation app\n\nI was not sure what to expect. This has been a great relaxation tool. I have taken it to work and after eating lunch I sit down for about 20 minutes and fish. The scenery and background music and sounds are so soothing. The fish are bizarre enough to make catching them interesting and funny. Get this app. Even if you dont like to fish you will enjoy this just for the zen like atmosphere.\n\nUpdate...I had my kids and wife play this and everyone enjoyed it. Laughed at the different fish and everyone trying to catch the biggest. We passed around the Quest while screen casting. The various areas to fish are all quite enjoyable. Some different fishing styles in an expansion or update would be awesome, fly fishing or stream fishing with lures. I agree with another review that said it would be nice to do more with the casting hand. I purchased the extra fishing area not so much for the extra area but just to support this company that has produced a great VR experience at a price for everyone. Game definitely doesnt need to be free. It is quality and you can see that effort and thought have gone into it. Thanks for the experience.\n\nHelpful | 2", "ChefschweisserJun 25, 2019 at 11:54 AM\nNice but lame\n\nNice animations nice fish but action..hm..its just reeling in..wait..reeling..kinda boring..they should have integrated more fun..for example left right forward or back or push a button when the fish is trying to push away..free...ok but no long time addiction.\n\nHelpful | 1", "GigaWightJun 11, 2019 at 10:17 AM\nSo relaxing but would love multiplayer\n\nA really great game to relax and immerse yourself in. If I could hang out with my VR friends on a virtual fishing trip then it would be an instant 5 star game for me. Keep up the good work!\n\nHelpful | 0\nDeveloper ResponseJun 13, 2019 at 6:43 AM\n\nThanks for the suggestion! We will keep it in mind.", "TwinTurbo74May 30, 2019 at 9:29 AM\nFix small reel\n\nLike others have mentioned, the reel is too small so reeling in a fish can be daunting....devs please make the reel bigger so that we dont have to hold controllers so close and hitting them while trying to reel in fish. Otherwise splendid game!\n\nHelpful | 0\nDeveloper ResponseMay 31, 2019 at 1:26 AM\n\nThanks a lot for the feedback! Our dev team is currently looking into this problem since it's been brought to our attention that players are often experiencing this. As of now, you can still grab the reel and then move your hand out to avoid that the controllers collide.", "chaypaltonMay 24, 2019 at 1:49 AM\nNice comfortable and fun game\n\nA game ideally suited to VR, and it has be extremely well design, so it actually plays great in VR. Visually very pleasing, with easy game controls that making it a excellent just pickup and play game. Great introduction to anyone new to VR, but still super fun for hardcore VR games.\n\nHelpful | 2", "DerivitivJun 15, 2019 at 9:00 PM\nGreat app for pooping!\n\nI installed the app and never thought I'd play it since it doesn't need room scale, but I found that its simple play design is perfect for when I am sitting on the can. I'll probably even pick up the extra content.\n\nHelpful | 3", "MASTBBBJun 7, 2019 at 2:15 PM\nI dont have money so I bot this\n\nIts a great free game that is really fun and challenging it really is worth it to get this game.it is a game I enjoy a lot and it is a good deal also this is a great game for people that are on a budget you should keep updating it and work on the game it has a big potential.\n\nHelpful | 1", "SpaceXvrMay 23, 2019 at 1:41 AM\nThank you\n\nEverything on my quest seems fine but for some reason im stuck not being able to accept the policy? Am i missing something?\n\nUpdated to 4 star thanks for the help however i have notice a fair amount of screen tearing maybe a quest issue however i have noticed it the most in bait\n\nHelpful | 0\nDeveloper ResponseMay 22, 2019 at 2:35 AM\n\nSorry to hear that you're experiencing this issue. Please follow the steps shown in this GIF: https://gph.is/g/E1GWnwD. If that doesn't work, please email us at support@resolutiongames.com and we will help you look into it.", "OctopusGardenJul 1, 2019 at 9:02 AM\nGreat Game\n\nIt maybe a bit cartoony, but you can see that before purchasing. It is loads of fun and all I can say to the developers is add more content please.\n\nHelpful | 1", "FunkyGamer101Jun 15, 2019 at 8:37 AM\nNice\n\nThe gameplay is very grabbing? And the graphics are just a bit pixelated although there are very serene places you can go to and the story is good as well\n\nHelpful | 0", "sinkkingJun 14, 2019 at 10:38 AM\nQuite relaxing but a bit silly.\n\nThis game is actually quite relaxing which makes me wish it wasnt so silly with it's silly fish types such as Parrot fish, skull fish, crocodile fish etc.\n\nHelpful | 0", "plo009Jun 4, 2019 at 6:47 PM\nGood for a free title\n\nNot bad for a free title, one problem is it's really easy to clash the 2 rings of the quest controllers together when rotating the reel, and having the controllers too far apart releases the reel.\n\nHelpful | 0", "BD4GSMay 27, 2019 at 10:28 PM\nGreat but controllers collide\n\nGreat game. Enjoyed this on the Go, and the second controller on the Quest adds to the immersion. However if I had to guess the developer used the CV1 touch controllers to develop the 6DoF and second controller. 30 seconds with the new touch controllers and you realize the reel is too small and the controllers bump\n\nHelpful | 1\nDeveloper ResponseMay 28, 2019 at 5:02 AM\n\nHi there! Thank you for the feedback. We've seen that several players seem to have this controller issue, and we're currently investigating it with the dev team. You can grip the reel and then move your hand out as much as you need to make sure the controllers don't collide. Feel free to try that out in the meanwhile.", "carlos_laMay 31, 2019 at 7:04 PM\nGo to settings and use Automatic mode\n\nA friend told me about automatic reel mode.. as soon as I found this the game changed and became super pleasurable, so I started getting expansions\n\nVery chill\n\n4 stars instead of 5 because it's not the default mode\n\nHelpful | 0\nDeveloper ResponseMay 29, 2019 at 1:56 AM\n\nSorry to hear that you're dealing with this problem! Our developers are currently looking into this issue. In the meanwhile, you can grab the reel and then move your hand out as much as you need to make sure the controllers don't collide.", "steve.weave.56Jun 9, 2019 at 8:22 AM\n\nDoes a great job of simulating how boring/relaxing (delete as appropriate) fishing is. You cant complain when it is free, and many people will enjoy it.\n\nHelpful | 1", "R3troC64Jun 27, 2019 at 1:15 PM\nExcellent free Game\n\nThis has to be one of the best free game, on the Quest. Im really enjoying it that much, Ive bought the dlc for it. Fantastic.\n\nHelpful | 1", "Willman21Jun 7, 2019 at 6:30 PM\nIm not into fishing but...\n\nIm not into fishing but this is a great relaxing get away from it all game. Really showcases vr. Its cartoony and really fun. Great for sitting on the couch and enjoying my new headset. Thank you for the game guys!\n\nHelpful | 2", "2wickyJun 16, 2019 at 9:53 PM\nAnother flawed fishing game\n\nIm always amazed at how badly scripted fishing game tutorials are and this one isnt an exception. I guarantee when the developers look at their analytics and see the drop off of users who just give up during the tutorial is astronomic. A shame with that photo realistic fishing game coming soon too, could have cemented a nice user base before a sleeker option comes along.\n\nHelpful | 1", "GabeNewelIMay 24, 2019 at 9:02 PM\nPretty, relaxing game, needs an update\n\nThis is a super chill fishing game. All of the fish are pretty detailed and unique looking. The gameplay is very simple, but it fits the chill vibe. I do wish the hand with the rod had something to do while reeling the fish in like increase/decrease the tension on the line. It would add a much more strategic element to the gameplay. Overall it seems like a pretty solid relaxation tool especially for the price.\n\nBUT the game definitely needs an update to increase the reel size. You have to hold your controllers so close together they knock against each other all the time. It's very annoying.\n\nHelpful | 6\nDeveloper ResponseMay 27, 2019 at 4:41 AM\n\nHello GabeNewell! Thank you for sharing your thoughts with us. We've noted them, and we are also looking into the problem with the colliding controllers.", "Peaceful_MindMay 29, 2019 at 5:55 AM\nRelaxing\n\nnice experience helps with taking your focus away to beautiful scenes. You will need to pay around 3 after finishing your initial missions in order to expand the map. If they could only make his friend be standing around or having other fishers around not to feel lonely\n\nHelpful | 1", "iamcruzJun 9, 2019 at 12:31 PM\nFix the reeling mechanic\n\nMake the reeling mechanic. Maybe have it lock so we can we can move the controller farther apart from the rod. Overall good free game. Love it!\n\nHelpful | 0\nDeveloper ResponseJun 10, 2019 at 1:47 AM\n\nThanks for the feedback! It's possible to grab the reel and then move your hand out a bit to increase the space between the controllers.", "ThuginomixMay 24, 2019 at 12:33 PM\nEasy Breezey VR\n\nThis has been one of my favorite VR experiences at the Quests launch. Its easy going, comfortable, and something you can spend a lot of time on and before you know it, an hour has passed. Its the next best thing to real fishing...and its free! No reason not to get this on your Quest!\n\nHelpful | 1", "Azazel08May 31, 2019 at 6:29 AM\nPeaceful and Relaxing\n\nThis free game is a perfect way to highlight the fantastic Quest screens. The colors and environment look vibrant and really pop. I thoroughly enjoyed the campaign and I am really excited to buy the 1 additional lake. This is the first time I have ever enjoyed fishing!\n\nHelpful | 1", "z_c00lJun 8, 2019 at 7:30 PM\nFun fishing\n\nGreat game of fishing. But I wish the rod reel had a bigger rotation. I can't reel it back properly with the small rotation I had to make.\n\nHelpful | 0", "missashley1234Jul 18, 2019 at 9:31 AM\nFishing\n\nGreat game but my reason for the 23 star is I am not able to purchase treehouse\n\nHelpful | 0\nDeveloper ResponseJul 19, 2019 at 12:58 AM\n\nHi missashley1234! Feel free to send us an email at support@resolutiongames.com and we'll help you look into what might be the cause of this problem.", "obi2kenobiJul 7, 2019 at 5:55 PM\nSeveral hours long, not a fishing sim\n\nThe movement of the fishing pole feels natural as i cast my hook.\n\nA lot of people complain about the controllers clacking but i just moved mine away from eachother and it works fine.\n\nMy one constructive criticism is one I saw in another review which is the fishing gameplay is a tad overly simplistic. Reel...wait...reel...wait. its still fun enough that i finished the main storyline and enjoyed it, but not fun enough that i want to come back and 3 star all the fish, etc, like how i wanted to play back through Vader Dojo levels to earn 3 stars...\n\nAs someone who has done at least some amount of real fishing, i would say the main piece that is missing is pole tension. In real life you pull the rod back and make them fight the tension of the rod instead of the cranking of your reel. Here there is no way to tire out the fish other than to reel in and wait over and over.\n\nOne more thing too add to realism would be adding fishing lures. Making your lure dance to attract fish can be one of the neater experiences in fishing.\n\nMaybe the game is simplistic on purpose because most people arent anglers IRL? Dunno. But the gameplay could definitely be more engaging. If they did add to the gameplay I think this would be a $10-$15 range title.\n\nSadly this is a longstanding free title that I doubt will get developed further. So devs, any interest in making an actual fishing sim? Nothing like that on the store. My brother and I used to have fun playing bass fishing games as kids, would be awesome in VR!\n\nTake it for what it is, a free and relaxing experience, if a bit shallow. i personally feel it is 3*, but for the non-fisher it may be right at 4*, and could improve to 5* with some deeper gameplay\n\nHelpful | 0\nDeveloper ResponseJul 8, 2019 at 2:42 AM\n\nThanks for all the in-depth input, obi2kenobi! We'll definitely keep this in mind for the future.", "mio1001May 27, 2019 at 3:51 AM\nControllers hitting needs a fix\n\nDuring the tutorial it tells you to reel it in using your other hand and you need your hand so close to the reel for it to work the controllers ended up hitting. You can turn this off and just hold a button to wind, but that completely defeats a good component of the game. Will give 4 or 5 stars if this is somehow fixed. Allow me to have my hands apart once i interact with the reel.\n\nHelpful | 2\nDeveloper ResponseMay 27, 2019 at 4:45 AM\n\nHello mio1001! Thank you for taking your time to inform us of this. We're currently looking into the issue with colliding controllers.", "ThatDidntWorkOutMay 25, 2019 at 8:21 AM\nReeling needs some tweaking\n\nI've actually enjoyed this title on the Go quite a lot so I was excited to try it out with 6DoF and two controllers. Unfortunately, it is really difficult to reel in fish due to the rings on the controllers smacking into each other all too easily and the effective area of usability being incredibly small due to this.\n\nHelpful | 3\nDeveloper ResponseMay 27, 2019 at 4:41 AM\n\nHey there! We really appreciate that you're sharing your feedback with us. Our dev team is currently looking into the issue with the controllers.", "KratsaroMay 21, 2019 at 5:10 PM\nGood game to pass some time\n\nOnly played it for about half an hour, but its very fun game to just kick back. Ive never gone fishing before, but this game makes me want to actually fish \n\nHelpful | 4", "r3idMay 22, 2019 at 5:28 PM\nFantastic game\n\nReally simple and easy to play game. Sit back go fishing and take part in side quests.\n\nGraphically looks fantastic on the Quest, and plays really well. Only issue I see is the touch controllers knock together easily as the ring is now on top.\n\nHelpful | 3\nDeveloper ResponseMay 23, 2019 at 1:40 AM\n\nHi there! Thanks for the feedback on the controllers. It's been passed on to the developers.", "FinsternJun 17, 2019 at 3:34 AM\nA great toilet game!\n\nCatch some fish while dropping the kids off at the pool!\n\nHelpful | 0", "HoldOn2YaButtsMay 29, 2019 at 11:41 AM\nRelaxation On the Lake\n\nA very relaxing and fun fishing game with cool fishing spots. For those who have issues as I do with clashing controllers, you can change a setting in options for this to be a button. Doesnt hamper the experience at all!\n\nHelpful | 1", "wildBcatMay 23, 2019 at 8:21 AM\nBetter than youd expect\n\nI got this game because it was free and thought Id only spend a few minutes on it before deleting. But now it is my top game! Although I dont care much for the story like fo the game (hunting elusive fish and trading favors with people)\n\nHelpful | 1", "bstenzel85Jun 14, 2019 at 9:17 AM\nFun and Relaxing!\n\nI've played this when I had a GO, and I love it even more on the Quest. Very fun, and very relaxing when I'm in a chair.\n\nHelpful | 1", "MarkEGJul 5, 2019 at 3:38 PM\nGreat Game\n\n5*'s!\n\nHelpful | 1", "ELECTRICT0MAT0Jul 28, 2019 at 9:28 AM\nBoring\n\nThat game is boring\n\nHelpful | 2", "BigHeyZuesMay 22, 2019 at 3:01 PM\nFirst time fishing !!\n\nMy brother is a big fisherman and I have never enjoyed it as much as him but this game is perfect for me I play it sitting down while charging my headset and relax before getting into more action pack games\n\nHelpful | 2", "ScurrydogJun 4, 2019 at 11:41 PM\nCasual fun\n\nMy wife loves this game. I just wish there was a rendered fishing line.\n\nHelpful | 0", "Spanky8237May 25, 2019 at 4:06 AM\nRelax and catch some fish\n\nThis is a great free game! Catch fish, use points to upgrade your gear. It's free... Stop reading this review and just get it.\n\nHelpful | 0", "YOUR-ARCH-ENEMYJun 28, 2019 at 11:51 PM\nFree addictive fishing game!\n\nThe title says it all!\n\nHelpful | 1", "SuperPukeJun 6, 2019 at 7:15 PM\nGood, but had limited replayability\n\nGreat the first time, but then its a little repetitive\n\nHelpful | 0", "diomarkMay 23, 2019 at 4:54 PM\nA bit glitchy\n\nIt's free, so no real reason not to install it, but it felt glitchy, and reeling in was annoying as I kept banging my controllers against each other.\n\nHelpful | 3\nDeveloper ResponseMay 27, 2019 at 4:35 AM\n\nThank you for sharing your feedback regarding the controllers. Our devs are currently looking into this issue.", "SupersonicblueMay 22, 2019 at 12:12 PM\nLove it on quest!!!\n\nThis game was a promising one on the Go however u can't do a good fishing game without 6dof, and boy it delivers on the quest this is free a must download for sure I've alrrady spent hours in it\n\nHelpful | 2", "YourPalPapyMay 25, 2019 at 8:53 AM\nOverall good\n\nIt is a great free game but I found that when reeling in the fish it made made my controllers rings hit each other\n\nHelpful | 0\nDeveloper ResponseMay 27, 2019 at 4:36 AM\n\nThat's really unfortunate! We're cunrrently looking into this problem together with the developers.", "Crazy_SaneJun 2, 2019 at 4:06 AM\nThe Relaxing Art Of VR Fishing\n\nFor a free title, this game is awesome. This is my go to when I'm over shooting things. A great atmosphere with fun gameplay. Download it already!\n\nHelpful | 1", "martinsen.jeffrey.lMay 31, 2019 at 7:58 PM\nBait\n\nControls dont work. I have to quit game and restart just to grab the pole then I cant real in the fish!!!!! What the heck ! Did not have these problems with GO... I want a dam refund\n\nHelpful | 5\nDeveloper ResponseJun 3, 2019 at 1:38 AM\n\nSorry to hear that you're experiencing this problem. Please send us an email at support@resolutiongames.com and we will take it from there.", "JTubbrittMay 25, 2019 at 10:04 AM\nOculug Go to Quest.\n\nExcellent, finished the entire game on my Oculus Go and I will enjoy doing this all over again on my Quest. The enhancements for the quest edition make an already enjoyable game even better.\n\nHelpful | 1", "Nostromo-MattMay 29, 2019 at 9:40 AM\nExcellent\n\nGreat mechanics, beautiful locations, a fun experience and all for free. Thank you!\n\nHelpful | 2", "vroomattMay 23, 2019 at 7:19 PM\nGood. Better on Go.\n\nI do really like this game, but the experience is overall more enjoyable on the Go.\n\nHelpful | 1", "polushkinJul 11, 2019 at 11:17 AM\nFishing game\n\nToo hard with controllers to play.\n\nHelpful | 2", "GameGrl83May 28, 2019 at 11:05 AM\nI actually really like this game!\n\nI'm was looking for a game to just sit back and relax this is surely it - looks amazing - great job! only wish I could choose my own music\n\nHelpful | 1", "Jacksonman1976May 27, 2019 at 3:26 PM\nCan't believe it's a free title.\n\nSuch a great way to relax. Definitely one of my favorite games on the Quest.\n\nHelpful | 2", "difioreJun 21, 2019 at 11:24 AM\nYeet\n\nSick\n\nHelpful | 2", "Erik_ElyMay 23, 2019 at 5:50 PM\nAddicting\n\nMy favorite game so far. Have no complaints. Will buy any expansions that they release.\n\nHelpful | 2", "aolshoveJun 3, 2019 at 7:57 AM\nNice title to relax with\n\nI really like the mindless relaxation at times. Just kick back on the couch and do some fishin'.\n\nHelpful | 1", "NoOneExistsMay 26, 2019 at 6:23 AM\nGreat free game!\n\nIt is an easy to learn fishing game. It is nice and relaxing and not too stressful.It also has good control with touch controllers.\n\nHelpful | 1", "shachuangegeMay 21, 2019 at 1:44 AM\n\nSofa. A good place to stay.\n\nHelpful | 5", "Fix_QUESTMay 26, 2019 at 6:50 AM\nRelaxing free title\n\nWay better than expected\n\nHelpful | 2", "Bigmike846Jun 14, 2019 at 9:44 AM\nstuck\n\nstuck at the Accept board\n\nHelpful | 0\nDeveloper ResponseJun 18, 2019 at 6:24 AM\n\nTry to follow the steps shown in this GIF: https://gph.is/g/E1GWnwD. Please send us an email at support@resolutiongames.com if that doesn't work.", "mrani01May 28, 2019 at 11:54 AM\n\nddvd f\n\nHelpful | 7"]