{"App Title": "Ballista", "App description": "Ballista is a completely immersive fantasy world with stunningly real physics and casual action adventure. In a realm under siege by destruction, tyranny, and even the occasional maleficent dragon, you must progress through five kingdoms to destroy the Bane Stones responsible for corrupting the very brick and mortar of the lands thirty strongholds, and vanquish the Great Evil for good. \n\nIn this first-person VR experience, you, the Hero, are aided by a wise Magic Mirror, a wand made of 100% unicorn horn, and a legendary sling. Face daunting foes, glorious victory, and the adoration of an entire realm of minions which you will use to catapult through the enemy defenses with sheer destructive panache. Thats right! The more adorable creatures you rescue and enlist to fight, the more ammunition you have to launch at your adversaries. Grab, throw, tickle, poke, and launch over 20 rescued minions, each with special abilities.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Casual, Puzzle", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "20.42", "Developer": "High Voltage Software, Inc.", "Publisher": "High Voltage Software, Inc.", "Website": "http://www.high-voltage.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "STUDIO GAMES CAREERS\nCONTACT US\nPRIVACY STATEMENT\n\nThis web site is committed to protecting your privacy. This Privacy Statement is intended to describe how your personal information is processed and used, and we will make every effort to ensure that our activities keep within the spirit of this Privacy Statement. Please note that by visiting and using this web site, or any other web site owned and operated by this web site owner, you are accepting the practices described in this Privacy Statement and all terms and conditions within ourLegal Notice.\n\nWhat Information is this web site gathering about its visitors and how is it being used?\n\nEvery computer connected to the Web is provided with a domain name (e.g. someispname.com) and an IP Address (e.g. 192.164.13.145). When a visitor requests a page from within this web site, our Web Servers automatically identify and log the HTTP request that is made to our Web Server. By itself, this information reveals nothing personal about you. The information that we usually gather and create a log of is as follows:\n\n The IP Address of the Site that may have Referred you.\n Your IP Address\n The Web Page that you may have linked to us from if any.\n The Product Identifier for Version and Make of Browser (e.g. Web Explorer)\n The Operating System platform that you may be running (e.g. Macintosh or Windows)\n Search Words or Terms that are passed from a Search Engine (e.g. Google or Yahoo!)\n Information readily available and stored in your Adobe Flash System.Capabilities Object.\n\nThere is absolutely nothing special about the information just described, and the practice of collecting this data has been generally standardized by most Web Servers and sites on the Web today.\n\nThe purpose of this information is actually two-fold. One, this web site has found it advantageous to examine visitor traffic in its aggregate, so that we can ensure maximum support and compatibility for the various Browsers and Operating Systems that visit our site. Additionally, as any business should attest, it is our desire to generate greater amounts of visitor traffic. By analyzing visitation patterns, referring URLs and Search Engine terms, we can strategically enhance our exposure on the Web.\n\nWhat about Cookies?\n\nCookies are small pieces of data that are transferred to your computers hard drive through your Web browser from a Web Server. A cookie cannot read data from your hard disk or read cookie files that may have been created from other sites. This web site may utilize cookies as a means of providing personalization features to our visitors. For example, we may utilize cookies as a convenience to remember settings (music preferences, colors, language settings, etc.) that you may have made at our web site.\n\nYou can choose whether to accept cookies by changing the settings of your browser. Typically, by accessing the browsers help feature you can obtain information on how to prevent your browser from accepting all cookies or to notify you when a cookie is being sent. If you choose not to accept these cookies, your experience on our web site and other websites may be diminished and some features may not work as intended. We generally give notice when cookies are required.\n\n\nWhat other information does this web site request?\n\nWe may request your e-mail address or mailing address for the purposes of conducting a survey, adding you to our mailing list, or by your request to have someone contact you for additional information. Whenever we request the identity of a visitor, we will clearly indicate the purpose of the inquiry before the information is requested. We maintain a strict, No Spam or UCE, a policy which means we do not intend to sell, rent, or otherwise give your e-mail address to a third-party, without your consent.\n\nIn addition, this web site will not send you e-mail that you have not agreed to receive. If you are a member of our Mailing List, you will be contacted with announcements, news, portfolio additions, and new products or services. You have the option of Unsubscribing from our Mailing List at any time, thereby disabling any further such e-mail communication from being sent to you. If you wish to have specific communications with a member of this web site staff, you will be required to provide specific information that will be routed to the appropriate contact within this web site.\n\nWhat information does this web site collect when I purchase something?\n\nIf you purchase something, such as a T-Shirt, for example, we need to obtain the appropriate information in order to complete the transaction. Depending upon the method of payment that you select and your location, the required information may vary. However, generally speaking, we will need specific information to protectively process such transactions. We generally use features that safeguard this information by using industry standard SSL (Secure Sockets Layer) encrypted servers. SSL encodes the information transferred between you and the server, rendering it unreadable to anyone trying to intercept the relay of that information.\n\n\nWill this web site disclose the information collected to Third Parties?\n\nThis web site will only disclose your personal information or any of its log file information when required by Law or in the good-faith belief that such actions are necessary to:\n\n Conform to the edicts of the law or comply with a legal process served on this web site.\n Protect and defend the rights or property of this web site, or visitors of this web site.\n Identify persons who may be violating the law, the legal notice, or the rights of third parties.\n Cooperate with the investigations of purported unlawful activities.\n\nThis web site uses reasonable precautions to keep the information disclosed to us secure. This web site reserves the right to transfer information in connection with the sale of all or part of this web site capital stock or assets to any third party. Furthermore, we are not responsible for any breach of security or for any actions of any third parties that receive the information. This web site also provides links to a wide variety of other websites on the Web. We are not responsible for their Privacy Statements or how those web sites manage information about their users. We strongly urge you to check with those websites to determine their terms and conditions.\n\nAny changes to this Privacy Statement will be posted on this page so that you are always aware of the information that we collect, how we use it, and under what circumstances we disclose it. This web site reserves the right to change the terms, conditions, and notices at any time, and such modifications shall be effective immediately upon posting of such changes. You are therefore responsible for regularly reviewing this document and additional terms or notices posted on this web site. Your continued access of this web site shall be deemed your conclusive acceptance of any modified agreement.\n\nlinkedin facebook youtube\nQUICK LINKS\nGames\nStudio\nCareers\nLocations\nLEGAL\nLegal Notice\nPrivacy Statement\nEnd User License Agreement\nCONTACT US\n2345 Pembroke Ave Hoffman Estates, IL 60169\n(847) 490-9567\ninfo@high-voltage.com\n\n 2019 High Voltage Software. All rights reserved. All product names, logos, and brands are the property of their respective owners.", "Developer Terms of Service": "STUDIO GAMES CAREERS\nCONTACT US\nEND USER LICENSE AGREEMENT\n\nThis End User License Agreement (Agreement) governs your download and installation of, and access to and use of, the virtual reality application (the Licensed Application) that is provided by High-Voltage Software, Inc. (HVS). This Agreement is a binding agreement between you and HVS, and not with Oculus VR, LLC. HVS, not Oculus VR, LLC, is solely responsible for the Licensed Application and the content thereof. As between you and HVS, this Agreement supersedes all end user license terms in any Oculus Terms of Service or terms of use.\n\nOwnership of the Licensed Application. The Licensed Application is the valuable property of HVS and our licensors and is protected by copyright and other intellectual property laws and treaties. HVS, and our licensors, own all right, title and interest in and to the Licensed Application, including all copyright and other intellectual property rights therein. HVS reserves all rights not expressly granted to you.\nScope of License to the Licensed Application. The Licensed Application is licensed, not sold, to you. Subject to the terms and conditions of this Agreement, HVS grants you a limited, non-exclusive, non-transferable license to download, install and use the Licensed Application on the Oculus Rift (the Device) that you own or control and as permitted in the Terms of Service provided by Oculus VR, LLC (the Usage Rules). The terms of this license will govern any upgrades provided by HVS that replace or supplement the original License Application, unless an upgrade is accompanied by a separate license in which case the terms of that separate license will govern.\nLicense Restrictions. The license granted to you in Section 2 does not allow you to do any of the following: (a) use the Licensed Application on any Device you do not own or control; (b) distribute, copy, license, rent, sell, publish, lease or otherwise transfer the Licensed Application (except as expressly permitted by this Agreement or the Usage Rules) or any proprietary materials of HVS to any third party; (c) reverse engineer, decompile, disassemble or attempt to discover any source code or trade secrets related to the Licensed Application or any proprietary materials of HVS; (d) modify, alter or create any derivative works of the Licensed Application or based on any proprietary materials of HVS; (e) remove, alter, or obscure any copyright, trademark or other proprietary rights notice on or in the Licensed Application; (f) work around any technical limitations in the Licensed Application; or (g) use the Licensed Application for purposes for which it was not designed. Unless explicitly stated herein or otherwise by HVS, nothing in this Agreement shall be construed as conferring any right or license to intellectual property rights, whether by estoppel, implication or otherwise. If you breach any of these restrictions, you may be subject to prosecution and damages.\nSupport Services. HVS will provide support for the Licensed Application. Support is available by emailing support@high-voltage.com. You may also visit contact for more information about support. If you have any questions regarding the Licensed Application, please contact us at Community@high-voltage.com. Other than billing inquiries, Oculus VR, LLC has no obligation whatsoever to furnish any support or maintenance services with respect to the Licensed Application.\nProduct Claims. Other than billing inquiries, HSV, not Oculus VR, LLC, is responsible for addressing any questions, comments or claims relating to the Licensed Application or your possession and use of the Licensed Application, including but not limited to: (a) product liability claims; (b) any claim that the Licensed Application fails to conform to the applicable legal or regulatory requirement; or (c) claims arising under consumer protection or similar legislation. If you have any questions or comments, please contact HVS at:\n\nHigh-Voltage Software, Inc.\nAttn: CFO\n2345 Pembroke Avenue\nHoffman Estates, IL 60169\nEmail: legal@high-voltage.com\n\nConsent to Collect and Use of Data; Privacy Policy. You agree that HVS may collect and use information about you, including but not limited to information about your use of the Licensed Application, Device, system and application software, and peripherals, that is gathered in connection with your use of the Licensed Application. For more information about how HVS collects, uses and shares information about you, please refer to HVSs Privacy Policy.\nServices; Additional Terms. The Licensed Application may enable access to services and websites provided by HVS and third parties (collectively and individually, the Services). Your use of the Services may require your acceptance of, and compliance with, additional terms provided by HVS or such third parties (collectively, Additional Terms).\nNo Warranty. YOU ACKNOWLEDGE AND AGREE THAT: (A) THE LICENSED APPLICATION AND SERVICES MAY CONTAIN BUGS, ERRORS, AND DEFECTS; (B) USE OF THE LICENSED APPLICATION AND SERVICES IS AT YOUR SOLE RISK; AND (C) THE ENTIRE RISK AS TO SATISFACTORY QUALITY, PERFORMANCE, ACCURACY AND EFFORT IS WITH YOU. ACCORDINGLY, THE LICENSED APPLICATION AND SERVICES ARE PROVIDED AS IS, AS AVAILABLE, WITH ALL FAULTS, DEFECTS AND ERRORS AND WITHOUT WARRANTY OF ANY KIND. HVS DISCLAIMS ALL WARRANTIES (EXPRESS AND IMPLIED AND ARISING BY LAW OR OTHERWISE) REGARDING THE LICENSED APPLICATION AND SERVICES AND THEIR PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY AND NON-INFRINGEMENT. HVS SHALL HAVE NO LIABILITY OF ANY KIND FOR THE USE OF, OR INABILITY TO USE, THE LICENSED APPLICATION, SERVICES OR ANY SERVICE THAT THE LICENSED APPLICATION IS INTENDED TO ACCESS OR FOR ANY LOSS OF DATA. HVS does not REPRESENT OR warrant that the Licensed Application or Services will be delivered free of any interruptions, delays, omissions or errors (Faults) or in a secure manner or that any Faults will be corrected. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY HVS OR ITS AUTHORIZED REPRESENTATIVES SHALL CREATE A WARRANTY. IN THE EVENT THAT THE LICENSED APPLICATION OR SERVICES PROVE DEFECTIVE, YOU ASSUME THE ENTIRE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\nOCULUS VR, LLC HAS NO WARRANTY OBLIGATION WHATSOEVER WITH RESPECT TO THE LICENSED APPLICATION OR SERVICES AND ANY OTHER CLAIMS, LOSSES, LIABILITIES, DAMAGES, COSTS OR EXPENSES ATTRIBUTABLE TO ANY FAILURE OF THE LICENSED APPLICATION.\n\nThe laws of some states or jurisdictions do not allow the exclusion of implied warranties. To the extent that those laws apply, the exclusions set forth above may not apply to you.\n\nIndemnification. To the fullest extent permitted by applicable law, you agree to defend, indemnify, and hold harmless HVS, its affiliates, independent contractors and service providers, and each of their respective members, shareholders, directors, offices, employees and agents (Representatives) from and against all claims, damages, costs, liabilities and expenses (including but not limited to reasonable attorneys fees) arising out of or related to your download or installation of and access to, or inability to download, install or access, the Licensed Application or the Services. In the event of any claim that the Licensed Application, or your possession or use thereof, or Services infringe any intellectual property rights of a third party, you agree to contact HVS directly, and Oculus VR, LLC will not be responsible for the investigation, defense, settlement and discharge of any such intellectual property infringement claim. HVS will, at its option and expense, terminate the license granted herein, settle or defend the claim.\nLimitation of Liability. To the fullest extent permitted by applicable law: (A) HVS AND ITS REPRESENTATIVES SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT, NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES SUSTAINED BY YOU ARISING FROM YOUR DOWNLOAD OR INSTALLATION OF, OR ACCESS TO, THE LICENSED APPLICATION OR SERVICES, INCLUDING WITHOUT LIMITATION ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR PUNITIVE DAMAGES OR LOSS OF DATA, EVEN IF HVS OR ITS REPRESENTATIVES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES; AND (B) YOU CAN RECOVER ONLY DIRECT DAMAGES FOR THE GREATER OF $10.00 AND THE AMOUNT YOU PAID FOR THE LICENSED APPLICATION.\nNo Export. You may not use or otherwise export or re-export the Licensed Application or any content contained therein, except as authorized by United States law and the laws of the jurisdiction in which the Licensed Application or any content was obtained. In particular, but without limitation, the Licensed Application and the content contained therein may not be exported or re-exported to (a)any U.S. embargoed countries, or (b)anyone on the U.S. Treasury Departments list of Specially Designated Nationals or the U.S. Department of Commerce Denied Persons List or Entity List.\nLegal Compliance. By downloading and installing the Licensed Application, you represent and warrant that: (a) you are not located in a country that is subject to a U.S. Government embargo, or that has been designated by the U.S. Government as a terrorist supporting country; and (b) you are not listed on any U.S. Government list of prohibited or restricted parties. You will comply with all applicable laws, rules and regulations, including but not limited to U.S. export control laws.\nCommercial Items. If acquired by any agency of the United States government, such agency acknowledges that: (a)the Licensed Application constitutes commercial computer software or commercial computer software documentation for purposes of 48 C.F.R. 12.212 and 48 C.F.R. 227.7202, as applicable and (b) such agencys rights are limited to those specifically granted under this Agreement.\nThird-Party Beneficiaries. Oculus VR, LLC is a third-party beneficiaries of this Agreement. Upon your acceptance of this Agreement, Oculus VR, LLC will have the right (and will be deemed to have accepted the right) to enforce this Agreement against you as a third-party beneficiary thereof.\nTermination. Any use of the Licensed Application or Services other than as specifically authorized under this Agreement or the Additional Terms, without the prior written permission of HVS, is strictly prohibited and will immediately terminate the license granted herein. Such unauthorized use may also violate applicable laws, including without limitation copyright and trademark laws and applicable communications regulations and statutes. You may terminate this Agreement at any time by (a) ceasing use of the Licensed Application and Services and (b) deleting all copies of the Licensed Application in your possession or control. HVS reserves the right to terminate this Agreement at any time, for any or no reason. In the event of termination, the license granted to you herein will automatically terminate and you must immediately cease all use of the Licensed Application and Services and destroy all copies of the Licensed Application within your possession or control.\nSurvival. Sections 1, 3, 5, 6, 8-14, 15 (last sentence only) and 16-21 of this Agreement shall survive any termination of this Agreement.\nModifications. HVS reserves the right to modify or discontinue, temporarily or permanently, the Licensed Application or Services (or any features or portions thereof) without prior notice. You agree that HVS will not be liable for any modification, suspension or discontinuance of the Licensed Application or Services (or any part thereof). HVS also may impose limits on the use of or access to certain Services, in any case and without notice or liability.\nDispute Resolution; Arbitration\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO ARBITRATE CERTAIN DISPUTES AND CLAIMS WITH HVS AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM US.\n\n18.1. Binding Arbitration. Except for disputes in which either party seeks to bring an individual action in small claims court or seeks injunctive or other equitable relief for the alleged unlawful use of copyrights, trademarks, trade names, logos, trade secrets or patents, you and HVS: (a) waive your right to have any and all disputes or Claims arising from this Agreement or the Services (collectively, Disputes) resolved in a court; and (b) waive your right to a jury trial. Instead, you and HVS will arbitrate Disputes through binding arbitration (which is the referral of a Dispute to one or more persons charged with reviewing the Dispute and making a final and binding determination to resolve it instead of having the Dispute decided by a judge or jury in court).\n\n18.2. No Class Arbitrations, Class Actions or Representative Actions. You and HVS agree that any Dispute is personal to you and HVS and that such Dispute will be resolved solely through individual arbitration and will not be brought as a class arbitration, class action or any other type of representative proceeding. Neither party agrees to class arbitration or to an arbitration in which an individual attempts to resolve a Dispute as a representative of another individual or group of individuals. Further, you and HVS agree that a Dispute cannot be brought as a class or other type of representative action, whether within or outside of arbitration, or on behalf of any other individual or group of individuals.\n\n18.3. Federal Arbitration Act. You and HVS agree that this Agreement affects interstate commerce and that the enforceability of this Section 18 shall be governed by, construed and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (the FAA) to the maximum extent permitted by applicable law.\n\n18.4. Process. You and HVS agree that you will notify each other in writing of any Dispute within thirty (30) days of when it arises so that we can attempt in good faith to resolve the Dispute informally. Notice to HVS shall be sent by certified mail or courier to: High-Voltage Software, Inc., Attn: CFO, 2345 Pembrooke Avenue, Hoffman Estates, IL, 60169. Your notice must include: (a) your name, postal address and the email address you use for your HVS account; (b) a description of the nature or basis of the Dispute; and (c) the specific relief that you are seeking. If you and HVS cannot agree how to resolve the Dispute within thirty (30) days after HVS receives your notice, either you or HVS may, as appropriate pursuant to this Section 18, commence an arbitration proceeding or file a claim in court. You and HVS agree that any arbitration or claim must be commenced or filed within one (1) year after the Dispute arose; otherwise, you and HVS agree that the claim is permanently barred (which means that you will no longer have the right to assert a claim regarding the Dispute). You and HVS agree that (i) any arbitration will occur in Cook County, Illinois, U.S.A.; (ii) arbitration will be conducted confidentially by a single arbitrator in accordance with the rules of JAMS; and (iii) that the state or federal courts in the State of Illinois have exclusive jurisdiction over any appeals and the enforcement of an arbitration award and over any Dispute between the parties that is not subject to arbitration.\n\n18.5. Authority of Arbitrator. As limited by the FAA, this Agreement and applicable JAMS rules, the arbitrator will have (a) the exclusive authority and jurisdiction to make all procedural and substantive decisions regarding a Dispute, and (b) the authority to grant any remedy that would otherwise be available in court. The arbitrator may conduct only an individual arbitration and may not consolidate more than one individuals claims, preside over any type of class or representative proceeding or preside over any proceeding involving more than one individual.\n\n18.6. Rules of JAMS. The rules of, and additional information about, JAMS are available on the JAMS website at http://www.jamsadr.com/, as may be updated from time to time. By agreeing to be bound by this Agreement, you either (a) acknowledge and agree that you have read and understand the rules of JAMS or (b) waive your opportunity to read the rules of JAMS and any claim that the rules of JAMS are unfair or should not apply for any reason. 18.7. Severability. If any provision of this Section 18 is held invalid or unenforceable, it will be so held to the minimum extent required by law and all other provisions will remain valid and enforceable. Further, the waivers set forth in Section 18.2 are severable from the other provisions of this Agreement and will remain valid and enforceable except as prohibited by applicable law.\n\nGoverning Law and Venue. This Agreement and your download and installation of, and access to, the Licensed Application and the Services will be governed and interpreted in accordance with the laws of the State of Illinois, without reference to its choice of law rules. Each party irrevocably consents to the jurisdiction and venue of the federal and state courts located in Cook County, Illinois, U.S.A., with respect to any Dispute between the parties that is not subject to arbitration under this Agreement.\nMiscellaneous. If any provision of this Agreement is found to be invalid or unenforceable, such provision will be deemed to be restated to reflect the original intention of the parties to the maximum extent possible and in accordance with applicable law, and the remaining provisions, terms, covenants, and restrictions of this Agreement will remain in full force and effect. You may not assign this Agreement or any of your rights under this Agreement without the prior written consent of HVS, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, this Agreement will be fully binding upon, inure to the benefit of, and be enforceable by HVS and our respective successors and assigns. Any failure by HVS to insist upon or enforce performance by you of any of the provisions of this Agreement or to exercise any rights or remedies under this Agreement or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and shall remain in full force and effect.\nDeveloper Name and Address. If you have any questions, complaints or claims with respect to the Licensed Application, please contact us at:\n\nHigh-Voltage Software, Inc.\nAttn: Community Manager\n2345 Pembroke Avenue\nHoffman Estates, IL 60169\nEmail: Community@high-voltage.com\n\nlinkedin facebook youtube\nQUICK LINKS\nGames\nStudio\nCareers\nLocations\nLEGAL\nLegal Notice\nPrivacy Statement\nEnd User License Agreement\nCONTACT US\n2345 Pembroke Ave Hoffman Estates, IL 60169\n(847) 490-9567\ninfo@high-voltage.com\n\n 2019 High Voltage Software. All rights reserved. All product names, logos, and brands are the property of their respective owners.", "Space Required": "1.89 GB"}



["5 stars\n54%\n4 stars\n17%\n3 stars\n21%\n2 stars\n3%\n1 star\n4%", "AndrewC85Apr 20 at 9:54 PM\nNo One Talks About This\n\nI agree with most of the 3-5 star reviews. However, one thing that no one seems to mention that ruined the experience for me is the fact that after the first map, every level thereafter is a race against time. Buildings can regenerate and I've found myself frantically looking for the right ammo and the correct target(s). You won't be able to take your time after what is essentially the tutorial. The amount of buildings that self repair can be numerous. They don't just repair either; they get reinforced. Just FYI.\n\nHelpful | 123", "coolcampfire17 days ago\nmust get\n\nbetter angry birds with new fun aspects\n\nHelpful | 0", "rooney224Apr 28 at 3:04 PM\nGrate game but...\n\nThis is a great game. Im about one third a way through the game and I love it but there was one thing that happens shortly after I unlocked the sea of grass. I think thats the name of it. After unlocking the sea of grass I played through the first level and decided to take a break. But the next I come on I come on to see the mirror playing the slideshow at the beginning of the game. So to say the least I was confused. Then I open up the map and there is NO PROGRESS! I had to start all the way form the beginning. Im not taking away a star because I think that this doesnt merit lose if a star but whoever made this game, please tell me what went wrong I just want to know. This is a great game that I definitely recommend playing.\n\nHelpful | 17", "TheDaddyToe12 days ago\nGreat game\n\nI am confused by the negative reviews. There is no significant race against time. There are no regenerating buildings. What are they talking about??? I have played over half of the game. Am I playing a different game? No. It is obvious that some players do not understand what they are playing. I think they are alluding to buildings becoming corrupted. Well it is very easy to destroy an entire corrupted building with a single well aimed or guided shot!! You cant do that with normal buildings. Very disappointing to read mistaken reviews. This is a well designed game with no bugs that I have encountered.\n\nHelpful | 7", "rajp13Jul 1 at 3:36 PM\nGood game\n\nSimilar to a angry birds\n\nHelpful | 2", "MenialKinsmenMar 15 at 3:34 AM\nAdvanced Angry Birds\n\nI love this game. From the graphics (popping colors) and character design to the gameplay...it's awesome. Like Angry Birds you need to fire characters at a structure to bring it down and kill the enemy. Angry Birds uses a slingshot. Ballista uses a catapult. Angry Birds has just a few characters to shoot through the air. Ballista, well... So far I've only played a few levels and I already have 7 or 8 different characters and some spells to choose from. On top of that you have a magic wand which appears in your hand when you stick your hand into the air and pull the trigger. A magic wand? Yes, or better yet: The horn of a unicorn to shoot down enemy projectiles. Again: I love this game.\n\nHelpful | 11", "dizziedMay 12 at 4:28 PM\nRuined by rushing\n\nThis is a great game, ruined by it's insistence on rushing the player with needless time limits and regeneration tropes. Ugh, you were so close to having a genuinely excellent game!\n\nAvoid!\n\nHelpful | 4", "jeff.wickliffeJan 9 at 8:23 AM\nA Better, more robust Angry Birds\n\nLove all the ammunition options and unlockable content, the addition of the wand to fend off attacks adds a layer of complexity which I dig. Only downfall I've felt where Angry Birds has this beat is the actual physics of the towers/walls when hit. I'd love to see more real world physics in toppling or setting up chain reactions.\nBut overall a solid game with a lot of replay factor if you dig this sort of game\n\nHelpful | 19", "damc34Dec 11 at 8:57 PM\nHarder than I expected\n\nI bought this game over the angry bird game on the quest. I've only put in about an hour and a half into it, but so far I'm liking it quite a bit. I need to learn what each goblin is best suited for... getting all the chest does get easier the more goblins you unlock... The wand mechanic is a nice way to add more to do while you line up your shots. I will update my review over I get deeper into the game\n\nHelpful | 20", "Mark-BlissFeb 3 at 5:55 PM\nFun for all ages\n\nThis is a cute game, a clean happy game for kids of all ages and Im sure many adults would enjoy it also. Its basically Angry birds leveled down. Graphics are good but not amazing, very cartoony. Angry birds graphics are much better and the comedy of the birds has a bigger smile factor. However the game is reasonably priced and great to let kids play.\n\nHelpful | 5", "VazzarothJan 3 at 11:10 AM\nWhy is all the UI so FAR away?!\n\nI am knocking a star off for the UI being SOOOO far from your body. This game is basically impossible to play sitting (And therefor not accessible by many people, including wheelchairs and those with limited mobility) because it puts all the stuff on your left and right super far away. I have about a 6ft wingspan, and I have to reach as far as I can to the side to grab it. I tried to play this in a limited space one time since I figured a simple slingshot game wouldn't take a large area, but I was wrong. I physically couldn't extend my arm far enough to grab ammo or I'd hit a wall in my house. I had to hold the realign button to spin the camera and put the ammo in front of me, then realign the quest again a 2nd time to replace the slingshot in front of me so I can grab it.\n\nWhy did they put everything to far apart, with almost no settings in the game at all?! It just seems bizarre. Game is pretty decent otherwise, I'd rate 4 if it was more accessible and contained more customizable settings. Or just put in the Jedi Force/Harry Potter Accio system lots of other games have, where you just reach and grab for something and you summon it to your hand!\n\nHelpful | 12", "Anorak86Jan 11 at 6:43 PM\nGreat game, some issues though\n\nTheres plenty of fun ammo and spells to unlock, but its a pain to play while sitting. Ammo is set up far from your spot and can be hard to reach. Using the wand to stop attacks is fun too.\n\nHelpful | 6", "cotheturtleJun 25 at 2:58 PM\nGood game\n\nFun but I wish there were more levels\n\nHelpful | 0", "invisibledig266Dec 4 at 6:10 PM\nOne of my favorites!\n\nTo people having a hard time. Go back to each level and get all treasure chests. Its a must!! I love this game so much I recommend it to everyone.\n\nHelpful | 7", "CloudTurtle27Dec 29 at 5:49 PM\nUnderated gem\n\nThis game is a quest essential. Buy it\n\nHelpful | 3", "Hunter121205Jan 8 at 2:17 PM\nGood Game\n\nVery unique game\n\nHelpful | 2", "anthonshOct 7 at 9:23 PM\nToo difficult\n\nRight after that return window is gone the game gets too hard. The game rewards full completion with items that should make it easier to finish the next levels. I'm not even half way done and so overwhelmed by everything that is going on that I have no hope of ever completing this game.\n\nHelpful | 24", "Blackhole777Oct 4 at 5:23 PM\nSuprisingly Deep Mechanics\n\nThere's quite a lot going on here. Lots of unique ammo types and special charms. Cute, colourful graphics. Good value. Hours of entertainment with Campaign and Challenges.\n\nHelpful | 3", "ChiefsmanEAAug 13, 2019 at 7:25 AM\nFavorite game in vr\n\nGreat game really fun creative ammo. Its a really addictive game. Hint if you are stuck on a level go back a level to get more chests they really help. Overall its a great game the graphics are only so so but I like it anyway.\n\nHelpful | 8", "ChlasmaJul 10, 2019 at 12:24 PM\nWay deeper than expected!!!\n\nTactic, aiming (slingshot), shooting (wand), lots loadout/ gear, bossbattles, nice graphics..... love it, more than worth the money. If you like job sinulator, but want a bit more challange, you will love this game.\nThanks high voltage :) (searching for conduit and the grinder easter eggs :P)\n\nHelpful | 13", "GeeseBeGoneJul 8, 2019 at 6:41 AM\nExcellent game that needs admin polish\n\nThe gameplay is excellent and the graphics are fun and the sense of scale is great standing behind the ballista. However the game needs profile support. My wife and I both want to play but its anticlimactic for one of us to simply replay a level when the treasure chests have already been opened.\n\nHelpful | 19", "smakalotMay 23, 2019 at 8:21 PM\nSuper fun and well made\n\nBallista is a \"Crush the Castle\" / \"Angry Birds\" type game, very well made and with enough twists in the game play and style to make it unique.\n\nLevels are well thought out, with a nice variety of difficulty. There are challenge levels, and multiple goals to achieve which gives more than enough content for your money.\n\nGraphics are cute with sharp textures and resolution. Sounds are fun and the voice acting is pretty good too. Minor frame rate issues (like all games I've played)\n\nWhen compared to Angry Birds VR, I would say Ballista is the better game.\n\nHelpful | 77", "rja8771May 26, 2019 at 5:50 AM\nBetter than Angry Birds\n\nNot super far into this, but so far the game is enjoyable and although it has similar play mechanics to angry birds, there is simply way more depth and strategy here, along with power up potions, a magic wand that adds another twist on gameplay and it's all wrapped up in charming fantasy theme. I purchased this and angry birds, if you have to choose between the two, this is a no brainier, simply way more for your money and it doesn't get stale 30 minutes in.\n\nHelpful | 16", "RaizingsunJun 18, 2019 at 6:43 PM\nA good game that needs standing support\n\nThe game seems very nice with a lot of different ammo types that open up and lot of ways to strategize. I agree with other reviewers who say they should be a way to skip dialogue (perhaps with a help menu where you could watch it later). Far more important for me is that the game requires too much space. It says it supports standing, but when I am standing in the middle of the stationary circular space, all of the ammo lies outside that space and I cannot reach all of it to grab it, and the ballista itself is also outside that space. This has already caused me to hit my hand into the wall several times while reaching for ammo. There should be an option to collect ammo by pressing a grab button and an option to make all the ammo a little closer to the ballista for those playing in a standing boundry and don't have a large space to play in. I will raise the number of stars if these options are added and change my review.\n\nHelpful | 19", "Gilagassi1Sep 12, 2019 at 5:27 PM\n\nA great 3d vr game. Highly recommended\n\nHelpful | 2", "MurxoMay 22, 2019 at 6:45 AM\nAwesome game\n\nThere is a lot of content and super cute graphics.\nThe monsters look really good and are perfectly animated.\nThere are a few minor framerate issues, but it did not influence the gameplay.\nI think this game deserves way more attention, because it delivers a lot for its price.\nEasily a 9 out of 10 for me!\n\nHelpful | 30", "xman7Jul 2, 2019 at 10:56 AM\nGreat\n\nVery good price for the quality and attention to detail that has been implemented in this game. It is sort of like angry birds but better.\n\nHelpful | 4", "SoakingRichMay 28, 2019 at 3:29 PM\n\nFar far too much handholding, waiting for npc's to finish talking, standing around doing nothing, with an very obnoxious companion just makes this whole game incredibly annoying. Game is far too simple and the whole experience draaaags.\n\nits hard to believe so much polish would go into a game so lacking.\n\nHelpful | 19", "greendizzleJul 28, 2019 at 4:42 PM\nEhhh\n\nHonestly good game to have for people to try on your quest but nothing I would just pickup and play\n\nRead my full review here: http://realitycheck.tech/index.php/2019/07/27/ballista-the-better-angry-birds-vr/?preview=true&_thumbnail_id=486\n\nHelpful | 2", "lefoulkrodJun 14, 2019 at 1:43 PM\nGood game with some issues\n\nThe game is fun but like another reviewer mentioned it can get annoying waiting for through the transitions. Would be nice to be able to skip them or speed them up.\n\nHelpful | 10", "Killbot4of1May 21, 2019 at 6:30 PM\nWorth The Price\n\nA story driven slingshot game with tons of ammo types and power ups. If you like slingshot puzzle games this is worth every penny. It looks great and gameplay is fluid. Haven't run into any bugs yet.\n\nHelpful | 18", "MikkoISJun 27, 2019 at 1:11 PM\nIt's great!\n\nFun game. Well made with great voice acting, good levels and funny creatures you use as ammo. Truly enjoyed this game. Angry birds has some similarities to ballista but make no mistake, ballista is superior in every way.\n\nHelpful | 7"]