{"App Title": "Beat Saber - Demo", "App description": "Beat Saber is a unique VR rhythm game where your goal is to slash the beats (represented by small cubes) as they are coming at you. Every beat indicates which saber you need to use and also the direction you need to match. All the music is composed to perfectly fit the handmade levels. Our goal is to make players almost dance while cutting the cubes and avoiding obstacles. Each cut is strongly supported by great sound and visual effects to emphasize the rhythm.", "Purchase section": "FreeView Full VersionAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade", "Languages": "English", "Version": "0.12.2", "Developer": "Beat Games", "Publisher": "Beat Games", "Website": "http://beatsaber.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "PERSONAL DATA PROCESSING POLICY\n\n1. Who are you?\n1.1. We are Beat Games s.r.o. with registered office in the Czech Republic, delivery address Mikovcova 548/5, 120 00 Praha 2, IN: 068 58325, entered in the Czech Commercial Register under reference C 290243 and because you play our game Beat Saber, we process your personal data as controllers under the European Union Data Protection Regulation.\n1.2. If you have problems understanding  anything in this document, do not be afraid to contact us at privacy@beat-games.com.\n2. What will I find in this document?\n2.1. Below you will learn why, to what extent, for what purpose and for how long we process your personal data. You will also learn who will have access to your personal data and what your rights in relation to the processing of the personal data are.\n2.2. We respect your right to privacy and despite the fact that we try to process as much information as possible as anonymized or pseudonymized data, we want you to know that your data is safe with us.\n3. What kind of personal data about me are you collecting and why?\n3.1. So that you can play Beat Saber and we are able to repair and improve the game, we collect the following data about you:\nidentification data (Avatar, nickname or UserID under which you are registered, etc.);\ntechnical data (data about your device etc.);\ndata concerning your use of Beat Saber (when and how and how successfully you play the game).\nWe only use these personal data for the two below-specified purposes:\nto enable the functioning of Beat Saber and\nto create statistics contributing to the improvement of the game.\n3.2. Firstly, we need your personal data described above (identification data, technical data and game use data) so that the game is functional, including leaderboards etc. The reason for such processing is based on the necessity to fulfil the agreement between you and us. \n3.3. Some of your personal data we need to process for our statistical purposes. These include either purely technical data (i.e. information not containing any personal data at all) or the other above-described data in pseudonymized form, that is, highly confidential data to which we assign a special number so that nobody except for us is able to match the data to the existing identifier using the given number. This processing is based on our legitimate interest which is the continuous improvement of the game. You have the right to object to this processing in the manner described below.\n4. How will you process my personal data?\n4.1. With regard to the above-mentioned purposes, it is apparent that we do not need your personal data in a form that enables your identification. For this reason, we are going to process the information (especially statistics) in aggregated (non-identifiable) form as much as possible and where this is not possible, we are going to process the information in pseudonymized form as much as possible.\n5. Do you need my consent for the processing?\n5.1. In fact, we do not need your consent because for all the forms of processing we have other legitimate reasons (because this is necessary for fulfilment of agreement or it is in our legitimate interest).\n6. For how long will you process my personal data?\n6.1. 6.1. Only for the time for which you play Beat Saber and at the maximum until you delete your account on any platform which you used to purchase our game (as per. Art. 8.2.) or until you ensure complete erasure of Beat Saber from your library on any given platform . However, most of the data is kept in the aggregate form only (when you cannot be identified) and only for as long as necessary.\n7. Do I have to give my personal data to you? Do you have to process them?\n7.1. If you want to play Beat Saber, we need the said personal data so that we can enable you to play. Unfortunately, this is not possible without your personal data.\n8. To whom do you transfer my personal data?\n8.1. We have the personal data in our possession for the whole time. To some partners, we only provide aggregated statistics (not personal data).\n8.2. Apart from us, however, your personal data are also processed by the platforms through which you have purchased our game:\n8.2.1. Playstation \n8.2.2. Steam \n8.2.3. Oculus.\n8.3. Your personal data are also processed by Unity, which ensures the creation and management of statistics concerning our game as mentioned above. (Privacy policy available at: https://unity3d.com/legal/privacy-policy)\n9. What rights do I have?\nContent of this section\n9.1. Having regard to the fact that Beat Games processes information concerning you, you may assert certain rights about which we want to inform you in this section. You may assert all the rights in writing at the above-given postal address or by e-mail at privacy@beat-games.com. \nRight to access\n9.2. You have the right to access the processed personal data concerning you. We will provide this data to you free of charge on the basis of your request sent to the above-given postal address or by e-mail to privacy@beat-games.com. Only where any costs arise in connection with your request, we will have to ask you to pay the necessary costs for their provision.\nRight to rectification\n9.3. We only need to process your accurate personal data. You have the right to the rectification of your personal data which are processed incorrectly.\nRight to erasure\n9.4. Under any circumstances you have the right to demand that we erase your personal data. However, this is not always possible. \n9.5. If you think that your personal data are no longer needed for the purpose for which they have been processed; if you believe that your personal data are processed by Beat Games illegally; or if Beat Games process personal data of a child without any parental consent given for such processing, you may demand that we erase your personal data.\n9.6. However, it is not always possible to erase the personal data provided by you for instance because of the fact that if we erased them, you would no longer be able to play Beat Saber.\nRight to data portability\n9.7. Another right you may assert is the right to data portability based on which we will hand over the personal data provided by you in a commonly used, structured and machine-readable format or if you require, we will transfer them to another controller of your own choice, where such transfer is technically feasible. \nRight to restriction of processing\n9.8. If you believe that your personal data processed by Beat Games are incorrect, you have the right to demand that we restrict the processing of your personal data for a period necessary to verify the accuracy of your personal data and to rectify them if needed. You also have this right if the processing of your personal data is illegal but you do not wish for your personal data to be erased; if Beat Games no longer needs your personal data for the above-specified processing purposes but you demand that your personal data are preserved for the purposes of the determination, exercise or defence of your legal claims; or if you have objected to the processing of your personal data on the basis of Beat Games legitimate interest.\nRight to object to processing on the basis of legitimate interest\n9.9. With regard to the fact that some of your personal data we process on the basis of our legitimate interest, you have the right to object to this processing. Based on the objection we will consider whether it really is in our interest to process your personal data for the given purpose. If we conclude that we do not have any significant legitimate reasons that prevail over your interests, rights or freedoms, we will terminate the processing of and destroy such personal data.\n9.10. However, it needs to be stressed that such objection should be well-founded. Therefore, we recommend you to firstly obtain all the necessary information at the above-mentioned email address. \nRight to complain\n9.11. If you find all the above-specified rights insufficient or if your opinion is that Beat Games in any way infringes upon your rights, you have the right to file a complaint with a supervisory body or a court.", "Space Required": "143.1 MB"}



["5 stars\n69%\n4 stars\n5%\n3 stars\n10%\n2 stars\n2%\n1 star\n14%", "TheBloxyGuardian15 days ago\nGreat demo\n\nIt's a pretty good demo, And even the one song I have to choose from is addictive.\n\nHelpful | 0", "LonerBoyMay 7 at 9:09 AM\ntoo short\n\ni liked the demo but its too short to really decide. by that being out of the way id really not think this was gonna be that much fun. i seen it on YT but did not believe it was that fun. now i know im wrong and im defentily gonna buy the full version sometime\n\nHelpful | 1", "QuestGeangerJan 20 at 10:22 AM\nHow should I decide with only one level?\n\nUnfortunately one level is not enough to make a decision to buy the game or not.\nI would rather unlock the full version for 30 minutes and then limit it to one level.\n\nHelpful | 24", "rpcmJan 9 at 12:31 PM\naddictive\n\nTried the demo, my children nagged me to get full version, and now I cant stop playing.\n\nHelpful | 7", "SymoneYeetDec 25 at 4:36 PM\nWhy I love this game\n\nI love this game so much. It brang joy to my mom, dad and cousin.\n\nHelpful | 8", "WilmatronDec 15 at 3:51 AM\nShort Demo\n\nIt's a superb game, but you don't get much in the demo. Just the one track. I'd have preferred a little more content to make an informed decision about whether to shell out for the full game.\n\nHelpful | 6", "CycleLockDec 27 at 12:06 PM\nPerfect!\n\nPerfect score for a perfect game.\n\nHelpful | 0", "Toby5672Oct 21 at 3:56 AM\nGood for a demo\n\nIts really good for a demo yes its one song but its good\n\nHelpful | 7", "ItsDazeNov 22 at 7:42 PM\nCan I Get This On The Rift S?\n\nI want to get this but I have the rift s is this possible?\n\nHelpful | 0", "X50pence777Jul 29, 2019 at 8:26 AM\nReally?\n\none song demo I agree with, but normal only? I have the rift cv1 and wanted to test the quest's inside out tracking before deciding if I was going to keep or return it... normal is useless to me... also no cross buy is a jerk move.\n\nHelpful | 12", "shashking404Jan 17 at 5:40 AM\nThe demo can't show it all\n\nBuy this game regardless\n\nHelpful | 1", "tanapholOct 8 at 8:59 AM\nBuy it now\n\nWow\n\nHelpful | 0", "RoeebyaAug 26, 2019 at 11:22 AM\nBest vr game\n\nThe best vr game i played\n\nHelpful | 1", "just.kamkMay 26, 2019 at 7:08 AM\nJust one level...\n\n...and you guys got me.\nHave to admit I never played this before, and after a few demo runs I had to buy the full version.\nYes, it's that good.\nI actually think the quest is a perfect fit for this game, with the freedom of movement, play anywhere if you feel like it, while high end PC graphics don't really matter.\nThe demo itself, as mentioned, is just one level and he Tutorial. Good enough to get a feel for the general gameplay. Repeatable as often as one likes.\n\nHelpful | 6", "404ErrMay 29, 2019 at 7:56 AM\nJust the taste I needed to purchase\n\nIf youre a fan of guitar hero or Dance dance revolution this is the next evolution. With the demo you get 1 song, its fun and what I expect from a demo. I purchased the full game and am glad I did. Songs are good too, they have playlists in Spotify if you want to hear them.\n\nHelpful | 5", "TopoSolitarioMay 31, 2019 at 12:48 AM\nDemo is too light to foresee the game\n\nDemo is way too simple and easy, you may find out the game is even a little boring as the song is at super-easy level, and results in a slow experience that may give you a wrong impression of the game.\nMy advice... demo should have the same song in hard dificulty to allow players a taste of what the game can be. And for players trying the demo... this is not the game! If you barely liked the demo GO FOR THE FULL ONE!\n\nHelpful | 2", "znanneyMay 21, 2019 at 11:19 PM\nGreat demo!\n\nGood demo with a great song. I knew I wanted beat saber before I played this demo, and the demo sealed it for me!\n\nHelpful | 7", "VenomousSVTMay 31, 2019 at 6:48 PM\nDefinitely had me wanting more!\n\nI played this one time and KNEW I was buying the full version.\n\nHelpful | 2", "Azz81May 22, 2019 at 3:00 PM\nOmg\n\nThis is mental and ive only tried the demo!\n\nHelpful | 2", "Despa_and_CitoMay 21, 2019 at 3:58 PM\nNice\n\nNice\n\nHelpful | 7", "StenorigMay 23, 2019 at 4:49 AM\nAmazing! (but...)\n\nGreat game but casting it's not supported... what a pity.\n\nHelpful | 2", "MrTiaxMay 21, 2019 at 3:08 PM\nAvoid, no custom tracks\n\nThe included tracks are all equally awful and you can't add any new ones on this version.\n\nHelpful | 1", "toafJul 6, 2019 at 2:26 AM\ni would have given them more stars if...\n\nthey had more heavy music. only really wanting to play 2 songs makes the game kinda lame.\none shouldn't have to cheat to get more songs....\n\nHelpful | 1", "VrBoi123Jul 12, 2019 at 1:14 AM\nhelp wanted\n\nwell where the hell i download it\n\nHelpful | 1"]