{"App Title": "Beat Saber", "App description": "Beat Saber is a unique VR rhythm game where your goal is to slash the beats (represented by small cubes) as they are coming at you. \n\nEvery beat indicates which saber you need to use and also the direction you need to match. All the music is composed to perfectly fit the handmade levels. \n\nOur goal is to make players almost dance while cutting the cubes and avoiding obstacles.\n\nEach cut is strongly supported by great sound and visual effects to emphasize the rhythm.", "Purchase section": "$29.99Add to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Casual, Music, Sports", "Languages": "English", "Version + Release Notes": "1.11.1", "Developer": "Beat Games", "Publisher": "Beat Games", "Website": "http://beatsaber.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "PERSONAL DATA PROCESSING POLICY\n\n1. Who are you?\n1.1. We are Beat Games s.r.o. with registered office in the Czech Republic, delivery address Mikovcova 548/5, 120 00 Praha 2, IN: 068 58325, entered in the Czech Commercial Register under reference C 290243 and because you play our game Beat Saber, we process your personal data as controllers under the European Union Data Protection Regulation.\n1.2. If you have problems understanding  anything in this document, do not be afraid to contact us at privacy@beat-games.com.\n2. What will I find in this document?\n2.1. Below you will learn why, to what extent, for what purpose and for how long we process your personal data. You will also learn who will have access to your personal data and what your rights in relation to the processing of the personal data are.\n2.2. We respect your right to privacy and despite the fact that we try to process as much information as possible as anonymized or pseudonymized data, we want you to know that your data is safe with us.\n3. What kind of personal data about me are you collecting and why?\n3.1. So that you can play Beat Saber and we are able to repair and improve the game, we collect the following data about you:\nidentification data (Avatar, nickname or UserID under which you are registered, etc.);\ntechnical data (data about your device etc.);\ndata concerning your use of Beat Saber (when and how and how successfully you play the game).\nWe only use these personal data for the two below-specified purposes:\nto enable the functioning of Beat Saber and\nto create statistics contributing to the improvement of the game.\n3.2. Firstly, we need your personal data described above (identification data, technical data and game use data) so that the game is functional, including leaderboards etc. The reason for such processing is based on the necessity to fulfil the agreement between you and us. \n3.3. Some of your personal data we need to process for our statistical purposes. These include either purely technical data (i.e. information not containing any personal data at all) or the other above-described data in pseudonymized form, that is, highly confidential data to which we assign a special number so that nobody except for us is able to match the data to the existing identifier using the given number. This processing is based on our legitimate interest which is the continuous improvement of the game. You have the right to object to this processing in the manner described below.\n4. How will you process my personal data?\n4.1. With regard to the above-mentioned purposes, it is apparent that we do not need your personal data in a form that enables your identification. For this reason, we are going to process the information (especially statistics) in aggregated (non-identifiable) form as much as possible and where this is not possible, we are going to process the information in pseudonymized form as much as possible.\n5. Do you need my consent for the processing?\n5.1. In fact, we do not need your consent because for all the forms of processing we have other legitimate reasons (because this is necessary for fulfilment of agreement or it is in our legitimate interest).\n6. For how long will you process my personal data?\n6.1. 6.1. Only for the time for which you play Beat Saber and at the maximum until you delete your account on any platform which you used to purchase our game (as per. Art. 8.2.) or until you ensure complete erasure of Beat Saber from your library on any given platform . However, most of the data is kept in the aggregate form only (when you cannot be identified) and only for as long as necessary.\n7. Do I have to give my personal data to you? Do you have to process them?\n7.1. If you want to play Beat Saber, we need the said personal data so that we can enable you to play. Unfortunately, this is not possible without your personal data.\n8. To whom do you transfer my personal data?\n8.1. We have the personal data in our possession for the whole time. To some partners, we only provide aggregated statistics (not personal data).\n8.2. Apart from us, however, your personal data are also processed by the platforms through which you have purchased our game:\n8.2.1. Playstation \n8.2.2. Steam \n8.2.3. Oculus.\n8.3. Your personal data are also processed by Unity, which ensures the creation and management of statistics concerning our game as mentioned above. (Privacy policy available at: https://unity3d.com/legal/privacy-policy)\n9. What rights do I have?\nContent of this section\n9.1. Having regard to the fact that Beat Games processes information concerning you, you may assert certain rights about which we want to inform you in this section. You may assert all the rights in writing at the above-given postal address or by e-mail at privacy@beat-games.com. \nRight to access\n9.2. You have the right to access the processed personal data concerning you. We will provide this data to you free of charge on the basis of your request sent to the above-given postal address or by e-mail to privacy@beat-games.com. Only where any costs arise in connection with your request, we will have to ask you to pay the necessary costs for their provision.\nRight to rectification\n9.3. We only need to process your accurate personal data. You have the right to the rectification of your personal data which are processed incorrectly.\nRight to erasure\n9.4. Under any circumstances you have the right to demand that we erase your personal data. However, this is not always possible. \n9.5. If you think that your personal data are no longer needed for the purpose for which they have been processed; if you believe that your personal data are processed by Beat Games illegally; or if Beat Games process personal data of a child without any parental consent given for such processing, you may demand that we erase your personal data.\n9.6. However, it is not always possible to erase the personal data provided by you for instance because of the fact that if we erased them, you would no longer be able to play Beat Saber.\nRight to data portability\n9.7. Another right you may assert is the right to data portability based on which we will hand over the personal data provided by you in a commonly used, structured and machine-readable format or if you require, we will transfer them to another controller of your own choice, where such transfer is technically feasible. \nRight to restriction of processing\n9.8. If you believe that your personal data processed by Beat Games are incorrect, you have the right to demand that we restrict the processing of your personal data for a period necessary to verify the accuracy of your personal data and to rectify them if needed. You also have this right if the processing of your personal data is illegal but you do not wish for your personal data to be erased; if Beat Games no longer needs your personal data for the above-specified processing purposes but you demand that your personal data are preserved for the purposes of the determination, exercise or defence of your legal claims; or if you have objected to the processing of your personal data on the basis of Beat Games legitimate interest.\nRight to object to processing on the basis of legitimate interest\n9.9. With regard to the fact that some of your personal data we process on the basis of our legitimate interest, you have the right to object to this processing. Based on the objection we will consider whether it really is in our interest to process your personal data for the given purpose. If we conclude that we do not have any significant legitimate reasons that prevail over your interests, rights or freedoms, we will terminate the processing of and destroy such personal data.\n9.10. However, it needs to be stressed that such objection should be well-founded. Therefore, we recommend you to firstly obtain all the necessary information at the above-mentioned email address. \nRight to complain\n9.11. If you find all the above-specified rights insufficient or if your opinion is that Beat Games in any way infringes upon your rights, you have the right to file a complaint with a supervisory body or a court.", "Developer Terms of Service": "End User License Agreement\n\nHello! We are glad you've decided to play the Beat Saber game. Before you go, please read the following legal rules. Don't worry! We want you primarily to enjoy the game, not to put up any obstacles against it. \n\n1. General\n1.1. This agreement is a contract between you and Beat Games s.r.o. (hereinafter \"Beat Games\"), governing your use of our Beat Saber game.\n1.2. For the purpose of this agreement, the term Beat Saber game includes the software of the videogame itself, all of its components (e.g., the source code) and content (e.g., graphical or musical content).\n1.3. This agreement applies to the Beat Saber game and all of its future updates and expansions, unless the expansion is governed by a separate agreement. If an expansion to the Beat Saber game is governed by a separate agreement, you will be explicitly asked to agree to the separate agreement.\n1.4. If you are a minor (below the legal age of majority in your country), please have the agreement reviewed and agreed to by your parent or legal guardian.\n2. Application of a distributor's terms and conditions\n2.1. We generally use the services of a distributor to market our Beat Saber game. The distributor usually has its own terms and conditions governing your use of its services and the distribution of software via its services to you. If there is anything in the distributor's terms and conditions that overlaps with the legal matters regulated in this agreement, the distributor's terms and conditions take precedence unless they provide that this agreement between you and Beat Games applies preferentially.\n3. Health and safety warning\n3.1. Due to its virtual-reality nature, the Beat Saber game can be physically challenging. Please consider your state of health before you start playing. If you have any doubts, consult a physician. Take breaks regularly and stay hydrated.\n3.2. Please be careful and mindful of your environment when playing the Beat Saber game. Always make sure there is enough space for you to play safely and that there are no obstacles or dangerous objects around you.\n3.3. If you are a minor (below the legal age of majority in your country), please have the health and safety concerns checked by your parent or another responsible adult person before you start to play the Beat Saber game.\n3.4. Please note that you bear responsibility for your actions while you play the Beat Saber game. We don't take responsibility for any injury or damage caused by your actions while playing the Beat Saber game.\n4. License terms and ownership\n4.1. We give you the right to use the Beat Saber game (a license) to the extent of downloading it, installing it, and playing it for your personal non-commercial enjoyment.\n4.2. You may not do the following with the Beat Saber game:\n4.2.1. use the Beat Saber game for commercial purpose (including e-sport and similar events) without our prior consent or unless specifically permitted in this Agreement;\n4.2.2. grant a sublicense to another person;\n4.2.3. copy the Beat Saber game, apart from creating copies necessary to run the Beat Saber game on your gaming device; \n4.2.4. sell, rent, lease or otherwise distribute the Beat Saber game;\n4.2.5. edit, merge, distribute, translate, reverse engineer, decompile, disassemble the Beat Saber game unless specifically permitted in this Agreement, by our prior consent, or by the mandatory rules of the applicable law;\n4.2.6. cheat, wilfully exploit bugs or glitches, wilfully harass or grief other players, or utilize any software or other means to do any of the aforementioned activities in the Beat Saber game;\n4.2.7. bypass or remove any measure preventing misuse of the Beat Saber game;\n4.2.8. misuse the Beat Saber game in any way contrary to the applicable law, including good morals rules.\n4.3. We retain all ownership rights to the Beat Saber game. No proprietary right is assigned to you via this agreement.\n4.4. We reserve the right to provide or unilaterally deploy patches, updates and other modifications to the Beat Saber game in order to remove or correct a bug, glitch or other issue, to prevent misuse of the game or breach of this agreement, or to enhance the gameplay (e.g., provide you with additional content).\n4.5. Be considerate and polite while using any online feature of the Beat Saber game, especially when communicating with other players. Don't choose a rude or offensive user-name or any user-name infringing rights of others, especially personal rights. If you do this, we reserve the right to take the appropriate measures, e.g., change your user-name, block your access to the online feature of the Beat Saber game, or suspend or block your access to the Beat Saber game.\n5. Liability\n5.1. We grant you all the rights under this agreement to the Beat Saber game \"as is\" and \"as available\". That means that we do not grant you any guarantee that the Beat Saber game works without any bugs, glitches, or other issues. In as much as the applicable law permits, we don't take any responsibility or liability for the Beat Saber game having any bugs, glitches, or other issues.\n5.2. We warrant to you that we have the right to conclude this agreement with you and that we have the right to grant you the rights under this agreement (namely the license to use the Beat Saber game). \n6. Termination\n6.1. If you materially breach this agreement, we have the right to terminate the agreement without any notice period. If it comes to this, you will lose all the rights granted by this agreement, namely the right to use the Beat Saber game, whereas we shall have no further obligations to you stemming from this agreement.\n7. Governing law and dispute resolution\n7.1. This agreement, your use of the Beat Saber game and all claims based on, arising from or related to this agreement or its execution, including rights and obligations regarding compensation of damages caused by a breach of this agreement or rights and obligations regarding any unjust enrichment incurred in relation to this agreement, shall be governed by and enforced in accordance with the law of the Czech Republic (excluding conflict-of-law rules), including its statutes of limitations.\n7.2. Any dispute pertaining to this agreement shall be judged and resolved exclusively by the courts of the Czech Republic. \n8. Changes and amendments\n8.1. We reserve the right to make changes to this agreement. In such case, we will post the changes and amended text of the agreement online and take reasonable steps to draw your attention to it.\n8.2. The changes shall come into effect (become legally binding) 30 days after we post the amended agreement online, unless a longer period is stipulated in the amendment. If you don't agree to the changes, you can terminate this agreement by simply ceasing to use the Beat Saber game (including deleting any copy installed on your gaming device). If you continue to use the Beat Saber game after the changes have come into effect, it shall be construed that you agree to the amended agreement in its entirety.\n9. Other legal matters\n9.1. You may not assign this agreement or any of the rights granted in the agreement to another person.\n9.2. In as much as the applicable law permits, the provisions of this agreement shall be interpreted to the fullest extent expressed in this agreement. If any of the provisions of this agreement is deemed to be void, inapplicable, or unenforceable, the remaining provisions shall not be affected.\n10. Contact\n10.1. If you have any questions, comments or feedback, you can contact us at contact@beat-games.com. Please contact us at this email address also in case you have any complaints in regard to our performance of this agreement.", "Space Required": "634.5 MB"}



["5 stars\n82%\n4 stars\n11%\n3 stars\n3%\n2 stars\n1%\n1 star\n2%", "choshenJul 3 at 9:47 AM\nJust buy it first, thank me later\n\nI'll admit it, I was sceptical at first. I watched the trailers, read reviews, and yet couldn't realize what all the fuss is about. To be honest- the only review anyone with doubts about purchasing this game needs to read is this:\n\nYOU CAN'T PUT INTO WORDS OR TRAILERS EVEN 10% OF THE REAL THING.\nYOU NEED THIS.\nYOU WANT THIS.\nYOU'LL BE GREATFUL FOR SPENDING THOSE 30$ ON THIS.\nIT'S 10 TIMES BETTER THAN WHAT YOU THINK.\nYOU DON'T KNOW VR UNTIL YOU PLAY BEATSABER.\nJUST GET IT ALREADY AND FIND OUT WHAT EVERYONE'S TALKING ABOUT.\nYOU. WON'T. REGRET.\n\nHelpful | 1037", "jay.sargent.50Jul 1 at 1:04 AM\nDon't get too attached.\n\nI got my oculus quest on monday morning anddd it's currently 4:02 on a wednesday. I'm literally 4 seconds away from beating an expert level. I haven't stopped and I haven't ate and I dont even feel hungry because the game is so addictive. My body is killing me. I'm deathly sore. I'm not saying it's a bad game but its 100% absolutely a time killer and its definitely one of the best/worst things that's happened to me. Happy swinging folks\n\nHelpful | 1176", "KalEl-ClarkJul 24 at 3:21 AM\nBest Game On Quest!\n\nI never write reviews so let me start by saying that this game is so good it has made me enjoy video games again. As a larger man who has always found it necessary to stay active in order to stay fit I found modern video games rather lacking in that they promoted more of a sedentary lifestyle. Now that works for many people who don't love to eat as much as I do but with beat Saber you get an extremely immersive and fun gaming experience that if played properly can be one heck of a workout. The Oculus quest and games like this have really excited me for virtual reality and what can be coming in the gaming industry for the future. I Absolutely love love love this game!!! My girlfriend loves to chuckle at me while I'm dancing all around the living room floor playing the 360 degree levels that they added. This game really gets you moving and it's fun and there's continually new challenges and ways to one up yourself. The customization allowing you to change the rules in the environment and the colors of your sabers and many other aspects of the game make the game have so much replay value it's ridiculous. Also all they have to do is release another music pack and they've got another $15 from me that I happily give them. the ability to take videos of me playing and uploading them has actually given me opportunities to show other people what playing on one of these sets is like and in turn three of my coworkers have already purchased occulus quests as well. I'm definitely giving it 5 stars for this reason but with that said here's some things that I truly feel would make a great thing even better.\n1: Include a multiplayer mode where you can play with friends online.\n2: More music, I mean lets be candid, I know you've got to make money and that's what selling these headsets and software is about so pump 'em out and charge away, Im buying.\n3: Add a custom track creator\n\nHelpful | 24", "Azu_rezJun 24 at 11:38 AM\nMUST have for quest users!\n\nso I got the quest and this game for christmas, 3 stars cause it was a bit repetitive\n6 months later....\ni finally get custom songs, sabers, hitsounds, now i would give it 6 stars\nhowever it took me 2 hours to figure out how to add custom songs so back to 5 stars, where we are now. also that was because the tutorial i used was super outdated\n\nHelpful | 117", "StammibenissimoJul 24 at 7:00 AM\nAlso good for lower limb amputees\n\nI am a transfemoral prosthesis user. I had felt a llitle sad that I cannot play a famous dancing game with competence like my friends because of my artificial leg, but now I won't care about it - I have now Beat Saber! Beat Saber gave me some upper body and trunk muscle strengh. I got some weight without much changing my body size much, which indicates some of my fat was replaced with muscle mass. My other recreation is hiking and trekking, so my exercise is now well-balanced. Great!\n\nHelpful | 18"]