{"App Title": "Bigscreen Beta", "App description": "Bigscreen is your VR movie theater.\n\nWATCH 3D movies with friends in a virtual theater. \nPLAY your favorite PC video games on a huge screen. \nHANG OUT in social VR chat rooms.\n\nWe also host events like weekly 3D movie nights and live streams of SpaceX launches! \n\n--- Features ---\n\nVIDEO PLAYER: play local video files stored on your VR headset. Supports 3D MOVIES in Side-by-Side 3D or Over-Under 3D.\n\nREMOTE DESKTOP STREAMING: stream your PC's screen into your VR headset. Wirelessly play your favorite PC games. Play a movie or video on your PC and watch it wirelessly in your VR headset in a virtual movie theater.\n\nTV Channels: watch movies, sports, comedy, and 50+ channels for free 24/7.\n\nCROSS PLATFORM VR headset support!\n\nPublic and Private social VR CHAT ROOMS with up to 12 people.\n\nChoose from a variety of environments like campfires and movie theaters.", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User, Multiplayer, Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Movie, Productivity, Social", "Languages": "English, English (UK), English (Australia), English (Canada), English (US), English (South Africa)", "Version + Release Notes": "0.103.0.775e18-beta-videoplayer-beta", "Developer": "Bigscreen, Inc.", "Publisher": "Bigscreen, Inc.", "Website": "http://bigscreenvr.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "events\nmovies\ntv\ndesktop\nabout\nlogin\nPrivacy Policy\nBIGSCREEN, INC.\nLast Modified: FEBRUARY 20, 2020\nBigscreen, Inc. (\"Bigscreen\") respects the privacy of its online visitors and users of its products and services. We recognize the importance of protecting information collected from our users and have adopted this privacy policy (Policy) to inform you about how we gather, store, and use information derived from your use of our products, services and online sites.\nYou should understand that when you use our online sites, products, view our content, attend our events, and contact our customer service (collectively, the \"Services\"), you agree that we may collect personally identifiable information for specific uses in the development and maintenance of the Bigscreen platform and to improve the experience for the platform's community of users.\nWe may change this Policy from time to time. When we make changes, we will revise the Last Modified date at the top of the Policy and, in some cases, will notify you through the Services, such as on our homepage, or via email or other communication.\nIf you are a California resident, in order to learn more about your California Privacy Rights, please see the CALIFORNIA CONSUMER PRIVACY ACT (CCPA) PRIVACY NOTICE section below. If you are a user in the European Economic Area, please see ADDITIONAL INFORMATION FOR EEA USERS section below.\nWHAT WE COLLECT\nWe collect information from and about you in connection with the Services and in a variety of ways. Some of this information may be considered personal information, meaning it identifies you or your device or it is reasonably associated with you (whether directly or indirectly), such as your first and last name, postal address, e-mail address and/or telephone number.\nInformation You Give Us\nWe collect information you provide to us directly when you use the Services. This includes, but not limited to:\n Account information. When you create an account, we log your username, provided email address, account creation date, the Steam/Oculus account youre using, the head-mounted display (HMD) youre using, and the Internet Protocol (IP) address from which you log in.\n Activity information. For each user session, we log a wide variety of user actions, such as the amount of time you spend in our app, the rooms or users you report, the date, time, and reason for contacting us, and other communications with us.\n Transactional information. If you purchase products or services from us (e.g. a movie ticket), whether on our sites or through our applications, we will collect certain information from you, including your name, address, email address, and information about the product or service you are purchasing. Payments are processed by third-party payment processors (e.g. Stripe), so please refer to the applicable processors terms and privacy policy for more information about how payment information is processed and stored.\n Other information. You may choose to provide other information directly to us. For example, we may collect information when you fill out a form, participate in events and promotions, apply for a job, request customer support or otherwise communicate with us. If you volunteer to serve as a beta participant for our pre-commercial content, we may track bug reports and individual system performance in an effort to test our technology rigorously before it is deployed.\nInformation We Collect Automatically\nWhen you access or use our Services, we may also automatically collect information about you. This includes:\n Log and usage data. We may log information when you access and use the Services. This may include your IP address, operating system, media access control (MAC) address, and other information about the devices and computers you use to access the Services.\n Location information. We may derive your approximate location from your IP address.\n Information collected from cookies and similar technologies. We may log information using \"cookies.\" Cookies are small data files that are commonly stored on your device when you browse and use websites and online services. Bigscreen uses cookies for you to access your account information online when you \"login\" to our website. We may use both session cookies (which expire once you close your web browser) and persistent cookies (which stay on your computer until you delete them) to provide you with a more personal and interactive experience using our Services.\nInformation We Get From Others\nWe may collect personal information about you from third-party services and other sources so we can better understand you and provide you with services that may be of interest to you. Specifically:\n User notifications: In the process of signing up for a Bigscreen account, users are asked to provide an email. If an email is provided, it is used to facilitate lost account retrieval, to send new users an orienting welcome message, and other transactional emails.\n Website behavior: Bigscreen uses Google Analytics to track user behavior on the company's website. Google has its own privacy policy and self-certifies compliance with the EU-U.S. Privacy Shield framework that the U.S. Department of Commerce developed in consultation with the European Commission to meet the European 'adequacy' standard for privacy protection. Google's privacy policy can be found here. You may opt out of the use of Google Analytics cookies by downloading and installing the Google Analytics Opt-Out Browser Add-On, found here.\n Analytics: Bigscreen stores some user and behavioral information with a service (e.g. Oculus) that aggregates user behavior to produce trends and community metrics. Oculus has its own privacy policy and can be found here.\n Third-party Platforms: We may automatically receive your personal information from the platform through which you downloaded and use our Services (e.g. Oculus and Steam). Personal information collected by the third-party platform that you use to access our Services is subject to the applicable third-party terms of use and/or privacy policy (for more information, please see the Oculus Privacy Policy or Steam Privacy Policy Agreement as applicable). For instance, when you first use our Services using the Oculus store, your Oculus ID will automatically be transmitted to us, with no action on your part. Our use of your personal information collected through our Services is limited to the purposes described in USE OF PERSONAL INFORMATION section below.\n Newsletter: Users that elect to sign up for the Bigscreen newsletter must agree to share an email address so that the newsletter can be delivered to them. The service we use (e.g. Revue) allows users to opt out of the newsletter after signing up.\nAdditionally there are a few special cases of information collection/retention to note:\n Job postings or unsolicited communications: Please note that information we receive in reference to a job posting or by unsolicited communications does not fall within the terms outlined in this Policy, however information from your resume will be used solely for the purpose of evaluating your candidacy for employment.\nUSE OF PERSONAL INFORMATION\nWe collect and use information about you for the following purposes, including to:\n Provide, maintain, and improve our Services;\n Create, manage, and authenticate your account;\n Conduct internal research and development;\n Respond to customer service requests;\n Debug the Services;\n Complete the transactions you request and perform our contractual obligations;\n Send you technical notices, updates, security alerts, invoices and other support and administrative messages;\n Communicate with you about products, services, offers, promotions, and events, and provide other news and information we think will be of interest to you (for information about how to opt out of these communications, see INFORMATION CHOICES AND CHANGES below);\n Monitor and analyze trends, usage, and activities in connection with our Services; and\n Protect the rights and property of Bigscreen, customers, and others and comply with our legal obligations and to enforce our agreements, policies, and terms of use.\nWe may use each of the categories of personal information we collect for all of the uses described above.\nSHARING OF PERSONAL INFORMATION\nWhen you use the Services, certain information may be shared with other users and the public. For example:\n With your consent. We may share information about you with your consent or at your direction with third parties when you ask us to do so or intentionally interact with a third party.\n To enforce our policies and rights. We may share information to protect the rights, property, and safety of Bigscreen, our agents, customers, and others. This includes enforcing our agreements, policies, and terms of use.\n In connection with a corporate transaction. We may share personal information when we do a business deal, or negotiate a business deal, involving the sale or transfer of all or a part of our business or assets. These deals can include any merger, financing, acquisition, or bankruptcy transaction or proceeding.\n With our professional advisors. We share personal information with our legal, financial, insurance and other advisors in connection with the corporate transactions described above or in connection with the management of our business and operations.\n With law enforcement authorities and individuals involved in legal proceedings. We share personal information when its necessary for us to comply with applicable law or legal process, to respond to legal claims, or to protect our rights, property or personal safety of our users, employees, or the public.\nWe do not sell your identifying information such as your name, email address, or postal address.\nOTHER INFORMATION\nData Security\nWe have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration, and disclosure. When you directly provide us with personal information, including through registration, we will encrypt that information using secure socket layer technology or similar technologies. We may retain data collected from you, including personal information, to support customer service inquiries and prevent repeated violations or suspected violations of the Terms of Use if your account has been banned or your access to the Services has been disabled for any reason. We may retain your information for as long as is necessary and relevant to your use of the Services and our operations, which may include retaining your information beyond the end of your use of the Services. To dispose of personal information, we may anonymize it, delete it, or take other measures we deem to be appropriate. Unfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted through the Services. Any transmission of personal information is at your own risk. We are not responsible for circumvention of any privacy settings or security measures used in the Services.\nINFORMATION CHOICES AND CHANGES\nAccount Information\nYou can access and change certain information through the Services. You may update, correct or delete information about you at any time by requesting such deletion at support@bigscreenvr.com.\nBefore we process a request from you about your personal information, we need to verify the request via your access to your Bigscreen account or to a verified email address associated with your Bigscreen account. Bigscreen does not discriminate against users for exercising their rights under data protection laws to make requests regarding their personal information.\nWe may retain certain information about you as required by law or for legitimate business purposes after you delete your account.\nPromotional Communications\nYou may opt out of receiving promotional emails from us by following the instructions in those emails. You can also adjust your communications preferences by adjusting the settings in your account. If you opt out, we will still send you non-promotional emails, technical messages, and other messages related to our ongoing business relations.\nControlling the Use of Cookies\nYou can configure your browser to accept all cookies, reject all cookies, or notify you when a cookie is set. Each browser is different, so consult the \"Help\" menu of your browser to learn how you change your cookie preferences. Please note that if you choose to remove or reject cookies, this could affect the availability and functionality of our Services.\nChanges to this Policy\nFrom time to time, we may change this Policy to accommodate new technologies, industry practices, regulatory requirements or for other purposes. If we decide to change our Policy, we will post those changes to this privacy statement, and other places we deem appropriate so that you are aware of what information we collect, how we use it, and under what circumstances, if any, we disclose it. We reserve the right to modify this privacy statement at any time, so please review it frequently. If we make material changes to this policy, we will notify you here, by email, or by means of a notice on our home page.\nCALIFORNIA CONSUMER PRIVACY ACT (CCPA) PRIVACY NOTICE\nThis Privacy Notice applies to California consumers and supplements the Privacy Statement. If you are a California resident, please review these additional privacy disclosures, which provide a summary of how we collect, use, and disclose personal information from you and also explains your rights under California law.\nCategories of Information We Collect, Use, and Disclose for Business Purposes\nWe collect the following categories of personal information as described in the WHAT WE COLLECT section. We collect this information from you, your devices, third parties, or as otherwise described in this Policy. We use these categories as described in the USE OF PERSONAL INFORMATION section above, and we disclose these categories of personal information for business purposes as described in the SHARING OF PERSONAL INFORMATION section above:\n Identifiers: Identifiers covers a broad range of information, including things like name, email address, postal address, and IP address. We collect some CCPA personal information that falls into this category. We collect IP addresses when you connect to our service online. These sorts of identifiers are connected to your Bigscreen account.\n Characteristics of protected classifications under California or federal law: This covers a broad range of information like race, sex, marital status, among other protected classes. We do not collect this information when you register for Bigscreen.\n Commercial information: This includes information about products or services considered, obtained or purchased.\n Internet or other electronic network activity information: Our services are online services, so we collect CCPA personal information in this category, like your interactions with our service, such as log data, and information about the devices and computers you use to access the Services.\n Geolocation data: We do not collect precise geolocation data from GPS sensors. However, we do collect IP addresses from which we can determine your general location.\n Inferences: We do not have a recommendation system to predict what youll be in the mood to watch or do when you log in. We also do not have a list that attaches socio-demographic information to you.\nYour Rights Under the CCPA\nUnder the California Consumer Privacy Protection Act (CCPA), California residents have the right to request access to or deletion of their personal information, to request additional details about our information practices, to opt out of the sale of their personal information, and to not be discriminated against for exercising these rights. Below we explain how you may exercise these rights. If you need further assistance regarding your rights, please contact us at support@bigscreenvr.com, and we will consider your request in accordance with applicable laws.\nAccess and Delete Request\nYou may review, modify, delete, and request access to your personal information by emailing us at support@bigscreenvr.com. Upon receipt of your request to exercise your rights to access and delete your personal information, we will verify your identity to protect your security and personal information. After submitting a request, please monitor your email for verification instructions. Note that even if we honor your request to delete your information, we may retain certain information as required or permitted by law.\nDo Not Sell My Personal Information\nAt Bigscreen, we will not sell your identifying information such as your name, email address, and phone number.\nADDITIONAL INFORMATION FOR EEA USERS\nUsers in the European Economic Area have the right to request access to access, the right to update (rectify), and the right to delete (erase) their personal data. There are certain circumstances where you have the right to object to, stop, or restrict processing of your personal information. You have the right to request a copy of your personal information and the right to complain to a data protection authority about our collection and use of your personal information. These rights can be exercised using the information provided under INFORMATION CHOICES AND CHANGES above or as described in the Data Subject and Consumer Information Requests section below.\nAs required by applicable law, we collect and process information about individuals in the EEA only where we have legal bases for doing so. Our legal bases depend on the Services you use and how you use them. We process your information on the following legal bases:\n You have consented for us to do so for a specific purpose;\n We need to process the information to provide you the Services, including to operate the Services, provide customer support and to protect the safety and security of the Services;\n It satisfies a legitimate interest (which is not overridden by your data protection interests), such as preventing fraud, ensuring network and information security, enforcing our rules and policies, protecting our legal rights and interests, research and development, and marketing and promoting the Services;\n We need to process your information to comply with our legal obligations.\nData Subject and Consumer Information Requests\nTo make requests, or if you have any other question regarding our privacy practices, please contact us at support@bigscreenvr.com from the email address that you have verified with your Bigscreen account.\nBefore we process a request from you about your personal information, we need to verify the request via your access to your Bigscreen account or to a verified email address associated with your Bigscreen account. Bigscreen does not discriminate against users for exercising their rights under data protection laws to make requests regarding their personal information.\nCONTACT INFORMATION\nIf you have a comment or question about this Privacy Policy, please send an email to support@bigscreenvr.com or mail us at:\nBigscreen, Inc. 340 S Lemon Ave #9667 Walnut, CA 91789-2706\nAbout\nblog\nnewsletter\nSupport\nsupport\nmy account\nFollow Us\n 2020 bigscreen, inc.\nterms of service\nprivacy", "Developer Terms of Service": "events\nmovies\ntv\ndesktop\nabout\nlogin\nTerms of Service\nBIGSCREEN, INC.\nLast Modified: FEBRUARY 20, 2020\nWhen we say \"our\", \"us\", or \"we\" or Bigscreen in these Terms of Use (these Terms), we mean Bigscreen, Inc. When we say \"Services\" or \"Site\" in these Terms, we mean websites operating under Bigscreen, as well as those of our applications, emails and other communications that link to or reference these Terms or other Terms and Policies, or the other services provided through any of these means. These Terms are subject to, and shall also include, the other Terms and Policies.\nThe website located at www.bigscreenvr.com (the Site) is a copyrighted work belonging to Bigscreen, Inc. (Company, us, our, and we). Certain features of the Site may be subject to additional guidelines, terms, or rules, which will be posted on the Site in connection with such features. All such additional terms, guidelines, and rules are incorporated by reference into these Terms.\nTHESE TERMS OF USE (THESE TERMS) SET FORTH THE LEGALLY BINDING TERMS AND CONDITIONS THAT GOVERN YOUR USE OF THE SITE. BY ACCESSING OR USING THE SITE, YOU ARE ACCEPTING THESE TERMS (ON BEHALF OF YOURSELF OR THE ENTITY THAT YOU REPRESENT), AND YOU REPRESENT AND WARRANT THAT YOU HAVE THE RIGHT, AUTHORITY, AND CAPACITY TO ENTER INTO THESE TERMS (ON BEHALF OF YOURSELF OR THE ENTITY THAT YOU REPRESENT). YOU MAY NOT ACCESS OR USE THE SITE OR ACCEPT THE TERMS IF YOU ARE NOT AT LEAST 18 YEARS OLD. IF YOU DO NOT AGREE WITH ALL OF THE PROVISIONS OF THESE TERMS, DO NOT ACCESS AND/OR USE THE SITE. THESE TERMS REQUIRE THE USE OF ARBITRATION (SECTION 10.2) ON AN INDIVIDUAL BASIS TO RESOLVE DISPUTES, RATHER THAN JURY TRIALS OR CLASS ACTIONS, AND ALSO LIMIT THE REMEDIES AVAILABLE TO YOU IN THE EVENT OF A DISPUTE.\n1. ACCOUNTS\n1.1 Account Creation. In order to use certain features of the Site, you must register for an account (Account) and provide certain information about yourself as prompted by the account registration form. You represent and warrant that: (a) all required registration information you submit is truthful and accurate; (b) you will maintain the accuracy of such information. You may delete your Account at any time, for any reason, by following the instructions on the Site. Company may suspend or terminate your Account in accordance with Section 8.\n1.2 Account Responsibilities. You are responsible for maintaining the confidentiality of your Account login information and are fully responsible for all activities that occur under your Account. You agree to immediately notify Company of any unauthorized use, or suspected unauthorized use of your Account or any other breach of security. Company cannot and will not be liable for any loss or damage arising from your failure to comply with the above requirements.\n2. ACCESS TO THE SITE\n2.1 License. Subject to these Terms, Company grants you a non-transferable, non-exclusive, revocable, limited license to use and access the Site solely for your own personal, noncommercial use.\n2.2 Certain Restrictions. The rights granted to you in these Terms are subject to the following restrictions: (a) you shall not license, sell, rent, lease, transfer, assign, distribute, host, or otherwise commercially exploit the Site, whether in whole or in part, or any content displayed on the Site; (b) you shall not modify, make derivative works of, disassemble, reverse compile or reverse engineer any part of the Site; (c) you shall not access the Site in order to build a similar or competitive website, product, or service; and (d) except as expressly stated herein, no part of the Site may be copied, reproduced, distributed, republished, downloaded, displayed, posted or transmitted in any form or by any means. Unless otherwise indicated, any future release, update, or other addition to functionality of the Site shall be subject to these Terms. All copyright and other proprietary notices on the Site (or on any content displayed on the Site) must be retained on all copies thereof.\n2.3 Modification. Company reserves the right, at any time, to modify, suspend, or discontinue the Site (in whole or in part) with or without notice to you. You agree that Company will not be liable to you or to any third party for any modification, suspension, or discontinuation of the Site or any part thereof.\n2.4 No Support or Maintenance. You acknowledge and agree that Company will have no obligation to provide you with any support or maintenance in connection with the Site.\n2.5 Ownership. Excluding any User Content that you may provide (defined below), you acknowledge that all the intellectual property rights, including copyrights, patents, trade marks, and trade secrets, in the Site and its content are owned by Company or Companys suppliers. Neither these Terms (nor your access to the Site) transfers to you or any third party any rights, title or interest in or to such intellectual property rights, except for the limited access rights expressly set forth in Section 2.1. Company and its suppliers reserve all rights not granted in these Terms. There are no implied licenses granted under these Terms.\n3. USER CONTENT\n3.1 User Content. User Content means any and all information and content that a user submits to, or uses with, the Site (e.g., content in the users profile or postings). You are solely responsible for your User Content. You assume all risks associated with use of your User Content, including any reliance on its accuracy, completeness or usefulness by others, or any disclosure of your User Content that personally identifies you or any third party. You hereby represent and warrant that your User Content does not violate our Acceptable Use Policy (defined in Section 3.3). You may not represent or imply to others that your User Content is in any way provided, sponsored or endorsed by Company. Because you alone are responsible for your User Content, you may expose yourself to liability if, for example, your User Content violates the Acceptable Use Policy. Company is not obligated to backup any User Content, and your User Content may be deleted at any time without prior notice. You are solely responsible for creating and maintaining your own backup copies of your User Content if you desire.\n3.2 License. You hereby grant (and you represent and warrant that you have the right to grant) to Company an irrevocable, nonexclusive, royalty-free and fully paid, worldwide license to reproduce, distribute, publicly display and perform, prepare derivative works of, incorporate into other works, and otherwise use and exploit your User Content, and to grant sublicenses of the foregoing rights, solely for the purposes of including your User Content in the Site. You hereby irrevocably waive (and agree to cause to be waived) any claims and assertions of moral rights or attribution with respect to your User Content.\n3.3 Acceptable Use Policy. The following terms constitute our Acceptable Use Policy:\n(a) You agree not to use the Site to collect, upload, transmit, display, or distribute any User Content (i) that violates any third-party right, including any copyright, trademark, patent, trade secret, moral right, privacy right, right of publicity, or any other intellectual property or proprietary right; (ii) that is unlawful, harassing, abusive, tortious, threatening, harmful, invasive of anothers privacy, vulgar, defamatory, false, intentionally misleading, trade libelous, pornographic, obscene, patently offensive, promotes racism, bigotry, hatred, or physical harm of any kind against any group or individual or is otherwise objectionable; (iii) that is harmful to minors in any way; or (iv) that is in violation of any law, regulation, or obligations or restrictions imposed by any third party.\n(b) In addition, you agree not to: (i) upload, transmit, or distribute to or through the Site any computer viruses, worms, or any software intended to damage or alter a computer system or data; (ii) send through the Site unsolicited or unauthorized advertising, promotional materials, junk mail, spam, chain letters, pyramid schemes, or any other form of duplicative or unsolicited messages, whether commercial or otherwise; (iii) use the Site to harvest, collect, gather or assemble information or data regarding other users, including e-mail addresses, without their consent; (iv) interfere with, disrupt, or create an undue burden on servers or networks connected to the Site, or violate the regulations, policies or procedures of such networks; (v) attempt to gain unauthorized access to the Site (or to other computer systems or networks connected to or used together with the Site), whether through password mining or any other means; (vi) harass or interfere with any other users use and enjoyment of the Site; or (vi) use software or automated agents or scripts to produce multiple accounts on the Site, or to generate automated searches, requests, or queries to (or to strip, scrape, or mine data from) the Site (provided, however, that we conditionally grant to the operators of public search engines revocable permission to use spiders to copy materials from the Site for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials, but not caches or archives of such materials, subject to the parameters set forth in our robots.txt file).\n3.4 Enforcement. We reserve the right (but have no obligation) to review any User Content, and to investigate and/or take appropriate action against you in our sole discretion if you violate the Acceptable Use Policy or any other provision of these Terms or otherwise create liability for us or any other person. Such action may include removing or modifying your User Content, terminating your Account in accordance with Section 8, and/or reporting you to law enforcement authorities.\n3.5 Feedback. If you provide Company with any feedback or suggestions regarding the Site (Feedback), you hereby assign to Company all rights in such Feedback and agree that Company shall have the right to use and fully exploit such Feedback and related information in any manner it deems appropriate. Company will treat any Feedback you provide to Company as non-confidential and non-proprietary. You agree that you will not submit to Company any information or ideas that you consider to be confidential or proprietary.\n4. INDEMNIFICATION.\nYou agree to indemnify and hold Company (and its officers, employees, and agents) harmless, including costs and attorneys fees, from any claim or demand made by any third party due to or arising out of (a) your use of the Site, (b) your violation of these Terms, (c) your violation of applicable laws or regulations or (d) your User Content. Company reserves the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate with our defense of these claims. You agree not to settle any matter without the prior written consent of Company. Company will use reasonable efforts to notify you of any such claim, action or proceeding upon becoming aware of it.\n5. THIRD-PARTY LINKS & ADS; OTHER USERS\n5.1 Third-Party Links & Ads. The Site may contain links to third-party websites and services, and/or display advertisements for third parties (collectively, Third-Party Links & Ads). Such Third-Party Links & Ads are not under the control of Company, and Company is not responsible for any Third-Party Links & Ads. Company provides access to these Third-Party Links & Ads only as a convenience to you, and does not review, approve, monitor, endorse, warrant, or make any representations with respect to Third-Party Links & Ads. You use all Third-Party Links & Ads at your own risk, and should apply a suitable level of caution and discretion in doing so. When you click on any of the Third-Party Links & Ads, the applicable third partys terms and policies apply, including the third partys privacy and data gathering practices. You should make whatever investigation you feel necessary or appropriate before proceeding with any transaction in connection with such Third-Party Links & Ads.\n5.2 Other Users. Each Site user is solely responsible for any and all of its own User Content. Because we do not control User Content, you acknowledge and agree that we are not responsible for any User Content, whether provided by you or by others. We make no guarantees regarding the accuracy, currency, suitability, or quality of any User Content. Your interactions with other Site users are solely between you and such users. You agree that Company will not be responsible for any loss or damage incurred as the result of any such interactions. If there is a dispute between you and any Site user, we are under no obligation to become involved.\n5.3 Release. You hereby release and forever discharge the Company (and our officers, employees, agents, successors, and assigns) from, and hereby waive and relinquish, each and every past, present and future dispute, claim, controversy, demand, right, obligation, liability, action and cause of action of every kind and nature (including personal injuries, death, and property damage), that has arisen or arises directly or indirectly out of, or that relates directly or indirectly to, the Site (including any interactions with, or act or omission of, other Site users or any Third-Party Links & Ads). IF YOU ARE A CALIFORNIA RESIDENT, YOU HEREBY WAIVE CALIFORNIA CIVIL CODE SECTION 1542 IN CONNECTION WITH THE FOREGOING, WHICH STATES: A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS OR HER FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM OR HER MUST HAVE MATERIALLY AFFECTED HIS OR HER SETTLEMENT WITH THE DEBTOR.\n6. DISCLAIMERS\nTHE SITE IS PROVIDED ON AN AS-IS AND AS AVAILABLE BASIS, AND COMPANY (AND OUR SUPPLIERS) EXPRESSLY DISCLAIM ANY AND ALL WARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING ALL WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUIET ENJOYMENT, ACCURACY, OR NON-INFRINGEMENT. WE (AND OUR SUPPLIERS) MAKE NO WARRANTY THAT THE SITE WILL MEET YOUR REQUIREMENTS, WILL BE AVAILABLE ON AN UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE BASIS, OR WILL BE ACCURATE, RELIABLE, FREE OF VIRUSES OR OTHER HARMFUL CODE, COMPLETE, LEGAL, OR SAFE. IF APPLICABLE LAW REQUIRES ANY WARRANTIES WITH RESPECT TO THE SITE, ALL SUCH WARRANTIES ARE LIMITED IN DURATION TO NINETY (90) DAYS FROM THE DATE OF FIRST USE.\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSION MAY NOT APPLY TO YOU. SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, SO THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n7. LIMITATION ON LIABILITY\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL COMPANY (OR OUR SUPPLIERS) BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY LOST PROFITS, LOST DATA, COSTS OF PROCUREMENT OF SUBSTITUTE PRODUCTS, OR ANY INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL OR PUNITIVE DAMAGES ARISING FROM OR RELATING TO THESE TERMS OR YOUR USE OF, OR INABILITY TO USE, THE SITE, EVEN IF COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ACCESS TO, AND USE OF, THE SITE IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR DEVICE OR COMPUTER SYSTEM, OR LOSS OF DATA RESULTING THEREFROM.\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY DAMAGES ARISING FROM OR RELATED TO THIS AGREEMENT (FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION), WILL AT ALL TIMES BE LIMITED TO A MAXIMUM OF FIFTY US DOLLARS (U.S. $50). THE EXISTENCE OF MORE THAN ONE CLAIM WILL NOT ENLARGE THIS LIMIT. YOU AGREE THAT OUR SUPPLIERS WILL HAVE NO LIABILITY OF ANY KIND ARISING FROM OR RELATING TO THIS AGREEMENT.\nSOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.\n8. TERM AND TERMINATION.\nSubject to this Section, these Terms will remain in full force and effect while you use the Site. We may suspend or terminate your rights to use the Site (including your Account) at any time for any reason at our sole discretion, including for any use of the Site in violation of these Terms. Upon termination of your rights under these Terms, your Account and right to access and use the Site will terminate immediately. You understand that any termination of your Account may involve deletion of your User Content associated with your Account from our live databases. Company will not have any liability whatsoever to you for any termination of your rights under these Terms, including for termination of your Account or deletion of your User Content. Even after your rights under these Terms are terminated, the following provisions of these Terms will remain in effect: Sections 2.2 through 2.5, Section 3 and Sections 4 through 10.\n9. COPYRIGHT POLICY.\nCompany respects the intellectual property of others and asks that users of our Site do the same. In connection with our Site, we have adopted and implemented a policy respecting copyright law that provides for the removal of any infringing materials and for the termination, in appropriate circumstances, of users of our online Site who are repeat infringers of intellectual property rights, including copyrights. If you believe that one of our users is, through the use of our Site, unlawfully infringing the copyright(s) in a work, and wish to have the allegedly infringing material removed, the following information in the form of a written notification (pursuant to 17 U.S.C.  512(c)) must be provided to our designated Copyright Agent:\n1. your physical or electronic signature;\n2. identification of the copyrighted work(s) that you claim to have been infringed;\n3. identification of the material on our services that you claim is infringing and that you request us to remove;\n4. sufficient information to permit us to locate such material;\n5. your address, telephone number, and e-mail address;\n6. a statement that you have a good faith belief that use of the objectionable material is not authorized by the copyright owner, its agent, or under the law; and\n7. a statement that the information in the notification is accurate, and under penalty of perjury, that you are either the owner of the copyright that has allegedly been infringed or that you are authorized to act on behalf of the copyright owner.\nPlease note that, pursuant to 17 U.S.C.  512(f), any misrepresentation of material fact (falsities) in a written notification automatically subjects the complaining party to liability for any damages, costs and attorneys fees incurred by us in connection with the written notification and allegation of copyright infringement.\nDesignated Agent\n340 S Lemon Ave #9667, Walnut, CA 91789-2706\nsupport@bigscreenvr.com\n10. GENERAL\n10.1 Changes. These Terms are subject to occasional revision, and if we make any substantial changes, we may notify you by sending you an e-mail to the last e-mail address you provided to us (if any), and/or by prominently posting notice of the changes on our Site. You are responsible for providing us with your most current e-mail address. In the event that the last e-mail address that you have provided us is not valid, or for any reason is not capable of delivering to you the notice described above, our dispatch of the e-mail containing such notice will nonetheless constitute effective notice of the changes described in the notice. Any changes to these Terms will be effective upon the earlier of thirty (30) calendar days following our dispatch of an e-mail notice to you (if applicable) or thirty (30) calendar days following our posting of notice of the changes on our Site. These changes will be effective immediately for new users of our Site. Continued use of our Site following notice of such changes shall indicate your acknowledgement of such changes and agreement to be bound by the terms and conditions of such changes.\n10.2 Dispute Resolution. Please read this Arbitration Agreement carefully. It is part of your contract with Company and affects your rights. It contains procedures for MANDATORY BINDING ARBITRATION AND A CLASS ACTION WAIVER.\n(a) Applicability of Arbitration Agreement. All claims and disputes (excluding claims for injunctive or other equitable relief as set forth below) in connection with the Terms or the use of any product or service provided by the Company that cannot be resolved informally or in small claims court shall be resolved by binding arbitration on an individual basis under the terms of this Arbitration Agreement. Unless otherwise agreed to, all arbitration proceedings shall be held in English. This Arbitration Agreement applies to you and the Company, and to any subsidiaries, affiliates, agents, employees, predecessors in interest, successors, and assigns, as well as all authorized or unauthorized users or beneficiaries of services or goods provided under the Terms.\n(b) Notice Requirement and Informal Dispute Resolution. Before either party may seek arbitration, the party must first send to the other party a written Notice of Dispute (Notice) describing the nature and basis of the claim or dispute, and the requested relief. A Notice to the Company should be sent to: 1920 Francisco St. #202, Berkeley, California 94709. After the Notice is received, you and the Company may attempt to resolve the claim or dispute informally. If you and the Company do not resolve the claim or dispute within thirty (30) days after the Notice is received, either party may begin an arbitration proceeding. The amount of any settlement offer made by any party may not be disclosed to the arbitrator until after the arbitrator has determined the amount of the award, if any, to which either party is entitled.\n(c) Arbitration Rules. Arbitration shall be initiated through the American Arbitration Association (AAA), an established alternative dispute resolution provider (ADR Provider) that offers arbitration as set forth in this section. If AAA is not available to arbitrate, the parties shall agree to select an alternative ADR Provider. The rules of the ADR Provider shall govern all aspects of the arbitration, including but not limited to the method of initiating and/or demanding arbitration, except to the extent such rules are in conflict with the Terms. The AAA Consumer Arbitration Rules (Arbitration Rules) governing the arbitration are available online at www.adr.org or by calling the AAA at 1-800-778-7879. The arbitration shall be conducted by a single, neutral arbitrator. Any claims or disputes where the total amount of the award sought is less than Ten Thousand U.S. Dollars (US $10,000.00) may be resolved through binding non-appearance-based arbitration, at the option of the party seeking relief. For claims or disputes where the total amount of the award sought is Ten Thousand U.S. Dollars (US $10,000.00) or more, the right to a hearing will be determined by the Arbitration Rules. Any hearing will be held in a location within 100 miles of your residence, unless you reside outside of the United States, and unless the parties agree otherwise. If you reside outside of the U.S., the arbitrator shall give the parties reasonable notice of the date, time and place of any oral hearings. Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. If the arbitrator grants you an award that is greater than the last settlement offer that the Company made to you prior to the initiation of arbitration, the Company will pay you the greater of the award or $2,500.00. Each party shall bear its own costs (including attorneys fees) and disbursements arising out of the arbitration and shall pay an equal share of the fees and costs of the ADR Provider.\n(d) Additional Rules for Non-Appearance Based Arbitration. If non-appearance based arbitration is elected, the arbitration shall be conducted by telephone, online and/or based solely on written submissions; the specific manner shall be chosen by the party initiating the arbitration. The arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise agreed by the parties.\n(e) Time Limits. If you or the Company pursue arbitration, the arbitration action must be initiated and/or demanded within the statute of limitations (i.e., the legal deadline for filing a claim) and within any deadline imposed under the AAA Rules for the pertinent claim.\n(f) Authority of Arbitrator. If arbitration is initiated, the arbitrator will decide the rights and liabilities, if any, of you and the Company, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim. The arbitrator shall have the authority to award monetary damages, and to grant any non-monetary remedy or relief available to an individual under applicable law, the AAA Rules, and the Terms. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and the Company.\n(g) Waiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration under this Arbitration Agreement. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in a court and are subject to very limited review by a court. In the event any litigation should arise between you and the Company in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND THE COMPANY WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge.\n(h) Waiver of Class or Consolidated Actions. ALL CLAIMS AND DISPUTES WITHIN THE SCOPE OF THIS ARBITRATION AGREEMENT MUST BE ARBITRATED OR LITIGATED ON AN INDIVIDUAL BASIS AND NOT ON A CLASS BASIS, AND CLAIMS OF MORE THAN ONE CUSTOMER OR USER CANNOT BE ARBITRATED OR LITIGATED JOINTLY OR CONSOLIDATED WITH THOSE OF ANY OTHER CUSTOMER OR USER.\n(i) Confidentiality. All aspects of the arbitration proceeding, including but not limited to the award of the arbitrator and compliance therewith, shall be strictly confidential. The parties agree to maintain confidentiality unless otherwise required by law. This paragraph shall not prevent a party from submitting to a court of law any information necessary to enforce this Agreement, to enforce an arbitration award, or to seek injunctive or equitable relief.\n(j) Severability. If any part or parts of this Arbitration Agreement are found under the law to be invalid or unenforceable by a court of competent jurisdiction, then such specific part or parts shall be of no force and effect and shall be severed and the remainder of the Agreement shall continue in full force and effect.\n(k) Right to Waive. Any or all of the rights and limitations set forth in this Arbitration Agreement may be waived by the party against whom the claim is asserted. Such waiver shall not waive or affect any other portion of this Arbitration Agreement.\n(l) Survival of Agreement. This Arbitration Agreement will survive the termination of your relationship with Company.\n(m) Small Claims Court. Notwithstanding the foregoing, either you or the Company may bring an individual action in small claims court.\n(n) Emergency Equitable Relief. Notwithstanding the foregoing, either party may seek emergency equitable relief before a state or federal court in order to maintain the status quo pending arbitration. A request for interim measures shall not be deemed a waiver of any other rights or obligations under this Arbitration Agreement.\n(o) Claims Not Subject to Arbitration. Notwithstanding the foregoing, claims of defamation, violation of the Computer Fraud and Abuse Act, and infringement or misappropriation of the other partys patent, copyright, trademark or trade secrets shall not be subject to this Arbitration Agreement.\n(p) Courts. In any circumstances where the foregoing Arbitration Agreement permits the parties to litigate in court, the parties hereby agree to submit to the personal jurisdiction of the courts located within Alameda County, California, for such purpose\n10.3 Export. The Site may be subject to U.S. export control laws and may be subject to export or import regulations in other countries. You agree not to export, reexport, or transfer, directly or indirectly, any U.S. technical data acquired from Company, or any products utilizing such data, in violation of the United States export laws or regulations.\n10.4 Disclosures. Company is located at the address in Section 10.8. If you are a California resident, you may report complaints to the Complaint Assistance Unit of the Division of Consumer Product of the California Department of Consumer Affairs by contacting them in writing at 400 R Street, Sacramento, CA 95814, or by telephone at (800) 952-5210.\n10.5 Electronic Communications. The communications between you and Company use electronic means, whether you use the Site or send us emails, or whether Company posts notices on the Site or communicates with you via email. For contractual purposes, you (a) consent to receive communications from Company in an electronic form; and (b) agree that all terms and conditions, agreements, notices, disclosures, and other communications that Company provides to you electronically satisfy any legal requirement that such communications would satisfy if it were be in a hardcopy writing. The foregoing does not affect your non-waivable rights.\n10.6 Entire Terms. These Terms constitute the entire agreement between you and us regarding the use of the Site. Our failure to exercise or enforce any right or provision of these Terms shall not operate as a waiver of such right or provision. The section titles in these Terms are for convenience only and have no legal or contractual effect. The word including means including without limitation. If any provision of these Terms is, for any reason, held to be invalid or unenforceable, the other provisions of these Terms will be unimpaired and the invalid or unenforceable provision will be deemed modified so that it is valid and enforceable to the maximum extent permitted by law. Your relationship to Company is that of an independent contractor, and neither party is an agent or partner of the other. These Terms, and your rights and obligations herein, may not be assigned, subcontracted, delegated, or otherwise transferred by you without Companys prior written consent, and any attempted assignment, subcontract, delegation, or transfer in violation of the foregoing will be null and void. Company may freely assign these Terms. The terms and conditions set forth in these Terms shall be binding upon assignees.\n10.7 Copyright/Trademark Information. Copyright  2014-2020 BigScreen, Inc. All rights reserved. All trademarks, logos and service marks (Marks) displayed on the Site are our property or the property of other third parties. You are not permitted to use these Marks without our prior written consent or the consent of such third party which may own the Marks.\n10.8 Contact Information:\nBigscreen, Inc. 340 S Lemon Ave #9667 Walnut, CA 91789-2706\nsupport@bigscreenvr.com\nAbout\nblog\nnewsletter\nSupport\nsupport\nmy account\nFollow Us\n 2020 bigscreen, inc.\nterms of service\nprivacy", "Space Required": "1.02 GB"}



["5 stars\n60%\n4 stars\n19%\n3 stars\n9%\n2 stars\n4%\n1 star\n8%", "EvlPeteJul 6 at 10:44 PM\ngreat app missing just one feature.\n\nthis app offers two things, a social environment and movie viewing.\n\nof all the social apps, I'm tending to like this one the most, mostly because of a smaller chat areas.\n\nfor movie viewing, it's nice being able to stream a movie in 3D.\n\nit's only shortcoming is that you can't screen position, that is there is no way to lean back or lie down and watch a movie.\nI find this to be a major shortcoming\n\nHelpful | 135", "david.deena.923 days ago\nGreat for watching local video files\n\nBeen playing this game for a while but the new videoplayer is a GAME CHANGER. Being able to watch movies upload on your headset is great, you dont have to be online and there is zero lag this way. Amazing for watching 3D movies just wish you could stream apps like YouTube or Netflix through this!\n\nHelpful | 13", "MiningMine09 days ago\nI live in UK, why can I only watch anime\n\nI don't know why but i thought living in the UK would allow me to watch the SpongeBob movie, apparently I can only see anime films. If the Devs read this could I get some kind of answer. There's also big issues with streaming content and you basically cannot watch videos with it. Overall I just like this because I can watch Bob Ross.\n\nHelpful | 3", "Grizzly_Studio09May 26 at 10:18 AM\nThings to consider.\n\nDont get me wrong this is a fantastic idea for a VR game and I love it! Most of the time its a great experience watching movies with people and an even better experience when youre on your own. I have been in quite a few rooms and a lot of them I couldnt stay in because of how laggy they can be. The owner of the room could have good internet connection, but whomever in there has the worst internet will slow everyone else down. It drags the quality of the movie and makes it stutter.\n\nThat said, the other times I dont have this issue its a pretty good idea of a game/app! Ive watched Doctor Strange 3D in an IMAX style theater, some other weird movies, and some shows. Its an overall great experience to watch movies and shows, especially during this time in quarantine.\n\nHelpful | 251", "hyperbunny10 days ago\nGreat social minus trolls, great movies\n\nLove coming here. Usually it's my last app of the night and I just hop from room to room like Netflix lol ended up watching a lot of great movies I wouldn't normally watch myself.\n\nMade a lot of VR friends in here. Wish is was easier to add friends. Also wished it was easier to block permanently trolls. There are some but the crowd is generally older. 20+\n\nWish there were environments too but for a free app, it's great. Crashes on quest here and there tho. Like 1 night out of 2. Sometimes a few times in a night. Sometimes none.\n\nHelpful | 2", "lynnxfitness18 days ago\na must!\n\nwell, aspecially during corona time, but really a must in anytime. movie theater in the woods, on space.... on private or public channels. movies. tv shows, sometimes it is ideal to be in and out of the house at the same time.\n\nHelpful | 5", "Ihrie4 days ago\nWould recommend\n\nI was actually thoroughly impressed with the movie playback, ticket prices were fairly reasonable as well. The 3-D movie experience wasnt too bad either.\n\nI havent had a chance to check out any of the other major features but it definitely looks like a useful application with some limited social features as well.\n\nOddly enough I had a better playback experience on big screen than I did through the actual fandango movie app.\n\nHelpful | 0", "GalaxyDogei13 days ago\nHelp! Was Great Until...\n\nIve been playing big screen for while now and ever since then I was having a blast, experiencing movies and tv shows was the best vr experience Ive ever had. One day while loading it up I was surprised to see that I was logged out (which is weird because its always logged in) and found out I was banned. \nI dont remember breaking code of conduct or any other rules and I was trying to reach out to them with no response, I was also trying to make a new account with a different email and it said couldnt create account something like that. Tried reinstalling it and nothing worked.\nIf I could get unbanned thatd be nice, I also dont know the reason why I was banned and had a pretty good rep until then. - GalaxyDogei\n\nHelpful | 3", "Patuber8 days ago\nVideoplayer\n\nNever had anything more worth to have in my library than this and echo vr. And another bonus for me which makes it better but also worse (thats why I didnt do 5 stars). I get of course that the videoplayer is in beta and development.(which is my bonus, i got acces to the early beta videoplayer update) but only this bothering me at all is that I couldnt play my english audio file thats encrypted on my movie (guardians of the galaxy) which had a hindi audio file and an English one. The English one didnt work, but I know that in the near or distant future it will work. Untill then it is the best app ever so you know what, imma still give it 5 stars\n\nHelpful | 0", "ImSoVry5 days ago\n** TWO STARS! ** NEEDS WORK.\n\nSince you literally can't choose anything but 5 stars in this store (Oculus, fix your review system!)...\n\nI love the idea of this app - being able to have a cool theater room to watch stuff in with my friends. Unfortunately the app is close to useless in practice. Here are the problems/issues for me:\n\n1. No DLNA support. I can't watch anything on my Plex media servers, nor can my friend. Thus it's completely useless to us.\n\n2. The \"channels\" available like 3d movie trailers and whatnot. We got excited about this, thinking we could sit in the room together, flip to a channel, and watch it. But NO! You LEAVE your room, bounce into a random public room with who-knows-who where stuff is playing, and now they can hear you (which is not obvious at first so you end up pissing people off until they block you) and you can hear them, etc. The last thing in the world I want is to randomly appear in a room full of people. The whole point to an app like Bigscreen should be to have a private invite-only room, where my friends and I can watch whatever we want whenever we want. If we want a room full of people we don't know, we'd leave it open. Why can't we just watch these channels IN OUR ROOM??\n\n3. If in party chat @ the Quest home before launching Bigscreen, audio won't work in the app and you must reboot. This is a known bug, it's in the help section, but it needs to get fixed, now.\n\n4. Joining a room is really, really awkward. You can't friend anyone or invite anyone, you have to give your friend a room code in the real world somehow (and you can't be talking to them in party chat, remember?) and they have to type it in to access your room. And if you decide to join a public room from there, when you leave you are NOT put back in the original room! You're separate again and have to re-join. This is horrible. Rooms should persist and be tied to YOU, and friends should be able to just join your room by name!\n\nI can't give this > 2 stars. I'm out of room now\n\nHelpful | 2", "Geographer_of_MarsJun 10 at 8:57 PM\nYeah baby!\n\nThis app is very switched on, yeah! Or, as my evil nemesis, Dr. Evil, would say, this app is better than \"frickin' sharks with frickin' laser beams attached to their heads!\"\n\nNow, if you could only get my movies on here so everyone can appreciate the power of my mojo that would be just psychedelic baby, yeah!\n\nHelpful | 18", "NurvisPurvis3 days ago\nI saw things\n\nI made the mistake of checking out this app at 2:00AM and I saw things I can never unsee. It's a cool app but there are some seriously f'd up people on there.\n\nHelpful | 1", "RoreoOreo10 days ago\nPretty good game but one major flaw\n\nI played this game quite a bit and I really enjoyed hanging out with people and watching tv shows and movies but the only problem I have with this is that I cant find anything to watch.\n\nHelpful | 0", "krakenJackMar 30 at 7:51 AM\n3/5 Worth having in the library... But.\n\nConsidering its free TV when you take into account the streamed Channels and hosting.\n\nHowever most of the films that are being sold via tickets aren't available in this region, not that you would be too fussed about this since the films on offer, you have probably seen on Netflix or Amazon prime for years now.\nSo, no chance I'm going to be playing almost 5 to watch an old film, if it was a movie fresh out of the cinema I would understand the price.\nBut apart from this it all works okay. And the little independent channels for specific shows (Bob Ross, Anime. Horror/Action ect.) is a nice touch and a great place to chill/chat.\n\nHelpful | 206", "HolierThanAllApr 27 at 4:12 PM\nShould be the new future of the movies!\n\nI thought this was a gimmicky idea at first, not gonna lie. But I was curious as to what a 3D movie looked like in VR. Paid like 5 bucks to see a 2 year old movie, but wow, it was worth it! This isn't something I'd pay for often, but if they could work out a deal with the movie distributors and get films that should be currently in theaters, then I would much rather do this than physically go to the movies. It really felt like I was watching the movie in a physical theater!\n\nBad side to this, and why I only rate 4 out of 5 stars, is that when you do rent an older movie for 5 dollars, if you want to share that movie with your spouse who has their own Quest too, then they have to pay 5 dollars as well. If I rented a 3D movie (yes I do have a 3D capable tv) my whole household could watch it for one price, multiple times if they'd like, in a 24-48 hour period. If they'd adopt this price model, 5 stars for sure.\n\nPS if you did get big, brand new movies to your platform, I'd have no problem paying twice for my wife and I to watch a movie, as we'd be doing the same in real life if we went to a physical theater.\n\nHelpful | 47", "jsalter_7 days ago\n\nGreat app with one missing feature.. being able to access network shares to use in big box would be amazing! Please add this feature in the future.\n\nHelpful | 1", "ToguyJun 18 at 2:18 PM\nUpdate\n\nToo many bugs, kept getting glitches. Also, could only have like only 12 people in any theater. But most restarted thing is you are not told when a host banned you from their theater. You instead get a stupid failed to join message, which is not specific. They also kick you out if you say certain words. Not to mention, in the latest update you can't simply rename your room, create it and invite others to just chat...\n\nUpdate:the bugs are less now, you can actually see the create your own room button,... They need to make a way you can add your favorite host like bookmarking it and like geeting a notice when they are on and what movie they are playing\n\nHelpful | 5", "SupervillainLairJun 4 at 7:38 PM\n3D movies\n\nI used this to watch Ghost in the Shell 3D with my Bose headphones for the sound, which was a wonderful experience. I hope that they add more 3D movies to their library. Personally I have no interest in the social aspect of this application, and I wish they would offer a mode where I dont have to be sat upright to watch a movie: Reclining or even lying down would be a great option.\n\nHelpful | 5", "tjgr17Jul 5 at 9:24 PM\nThis is great!\n\nThis is amazing. But I shouldn't need a PC for a system that is supposed to be stand alone. Once we get a media player for offline viewing, 5 stars all day long.\n*****Update****\": the description has said a video player is coming soon for almost 6 months. 6 months! \"Coming soon\" means a month, maybe 2. Anything after that is not soon. I'm taking another star away. I feel like this project is just stagnant. I'll give it 5 stars when things start happening again.\n*2nd update* Testing has started for the built in video player. I bumped the score up to 4 stars. Thanks to the dev for replying and providing an update. Much appreciated. Can't wait for the final result and to give Big screen the 5 stars it deserves with a local media player. ****Update****\n5 stars all day long! The new video player is great and I love all the environments! Thank you devs for coming through for us!\n\nHelpful | 5", "donkey.xoteJul 11 at 5:33 PM\nWatch films and TV with your friends\n\nThe public rooms can be a bit weird. I tried a few and couldn't really watch the shows while everyone in the theater was having political debates. You can, reduce audio and video distractions in the settings, though.\nPrivate rooms were a little tricky to get your friend into. It mutes party audio when you enter and once the room is created, you need to leave the app and type a long code for your friends to memorize so your friends can join you.\nIf you want to play a video with a group, everyone in the group needs the same video on their device.\nThe cost of renting movies seems steep and the selection is very limited, so i have not done that yet. If the cost i pay allows me to invite a group of friends to join me at no additional cost, then it's a good deal. If each of my friends has to pay the streaming fee, it's a bit of a Ripoff. I don't know which is the case so I'm not factoring that into my rating.\nI would really love to be able to just send my friends a link that they could join me, or see rooms that they are in. Memorizing room-xxxxxxxx is a total PITA.\nOverall, this is a terrific app. And it's still in beta, so it'll only get better!\n\nHelpful | 0", "ansonortJul 28 at 9:40 AM\nMassive disappointment - and offensive\n\nIm really sick of the PC-centric world that negates the Mac-users as second-rate or, conversely, elite and shuts them out. This has been the way since the 1990s. Remember going into a computer games store and finding the games for Mac on a low shelf in a corner - its still the way! This app presents great opportunities in the VR world, but it marginalises the minority, which is a shame.\n\nAnother thing that will have me delete this app as quickly as possible is the Lobby area. I couldnt believe the foul language I was hearing. Are children exposed to this? Its shocking and a sad reflection of this social-media world where theres so little protection for the vulnerable and impressionable.\n\nHaving now read a few more reviews about BigScreen my reservations about its premise is confirmed. Anything connected with social networking is wide open to invasion of privacy and what I can only describe as cyber-intimidation of the worst kind. With the likes of Twitter and Facebook now deactivating accounts when offensive or divisive material is evident there needs to be some form of constant monitoring of BigScreen.\n\nI wont be visiting again.\n\nHelpful | 3", "TweekCMJul 27 at 9:12 PM\nIt's a movie theater at home.\n\nThis app allows you to rent movies and watch them in a virtual movie theater. I rented a Star Trek movie and watched it in high quality 3d, inside of a spaceship/movie theater. The experience was incredible. If this sounds like a good time to you, then this app is for you.\n\nThis app also offers several TV channels to watch. I believe most come from Pluto TV. Don't expect anything to blow your mind there.\n\nIn addition to this, other users can host their rooms and allow other players to join. There they can all watch the same thing. This app also recently added a virtual desktop feature, which I have not tried yet but could be incredible for watching movies and videos at home.\n\nHelpful | 1", "33304Jul 10 at 10:35 PM\nNot safe and not professional\n\nI've had several occasions of pedophiles talking sexually to little girls. I've had groups of people talking about porn right next to kids, knowing well that they can make their own room to talk about that away from kids. I've witnessed things on Big screen that shook me to the core. This place has 0 moderation...there is NOBODY who polices the rooms in this app and anything and everything happens. I've witnessed people virtually raping little girls as they call her b@+*h and tell her to take it. The regular men on here all admit they want to find virtual girlfriends. If you speak to a child, people will talk badly about you and report you...yet the same people themselves will try and talk sexually to girls. Big screen contacted me saying that I've had many dozens of reports made against me and that they will not tolerate abuse and will ban me....I'm one of the nicest people on there, I've never had an argument or sworn and everyone likes me. I usually talk to regulars and just watch movies by myself...Yet according to Bigscreen I'm a monster on the verge of being suspended for no reason at all. Go ahead, ban me, I'll leave reviews everywhere and make videos on YouTube exposing your normalisation of pedophiles on VR.\n\nHelpful | 6", "moguildMay 11 at 12:12 AM\nA Good Experience!\n\nIts so different just vibing with other people and watching movies/tv and messing around. Worth having in your library for shre.\n\nPROS:\n- Great quality for official streams(user created streams can be a bit low quality.)\n- Avatar creation is simple but nice\n- Some toys like tomatoes and popcorn to throw, and drawing in the air.\n- Nice environments. The rooms look great and add a lot to the experience.\n\nCONS:\n- Occasional crashes. Sometimes high occupancy rooms or high quality videos can lag you out.\n- Needs more stuff to play with! Throwing tomatoes and drinks is fun for a bit, but some more things would be nice.\n- Be ready for many *many* kids to be in this app. Luckily you can mute people easily.\n\nHelpful | 14", "jrico1Jun 25 at 1:46 PM\nWow!!\n\nWith kids and now corona, I have not been to a movie theater in years. This is a wonderful experience that feels I would say better than being in a room full of noisy people.\nThe 3D Movies are amazing even if they are old... They some are new to me. Hopefully more content is added. I would definitely be skipping buying lattes and use that money into renting movies here. You get 48 hours of replay.\n\nHelpful | 4", "ReptileMkJun 16 at 8:19 PM\nThats all your getting\n\nSeriously I feel like you should answer this question.\n\nWhy release this in the U.K. to not give us any content other than the free tv shows? What an insult.\n\nIts fantastic reading all the reviews about how good it is to watch 3D movies in a VR cinema only to be told content not available In your country.\n\nWhy would you even do that? Is it kind of oh were from the states so well make sure we look after our own first? Everyone else can wait. If so. Get it off my store. Shouldnt be there if its half assed.\n\nHelpful | 16\nDeveloper ResponseJul 29 at 4:11 PM\n\nBigscreen initially released as a desktop screensharing app for many years to everyone around the world to use for free. We've added many features along the way, such as TV channels and videoplayer, that you are free to use. We've added our Movies feature near the end of 2019, but not all movies are available in all countries. Movie licensing restrictions are really out of our control as certain studios own rights to the movies in certain regions. We hope to work with more studios to expand our catalog and region availability, but it doesn't make sense to restrict our app's region availability just because one feature out of all our other free features cannot be accessed from our app.", "TheBoylingpot7 days ago\nGreat game\n\nReally great game fun way to meet people but they should add a friends system\n\nHelpful | 0", "Legend_Gamer780Jul 9 at 4:34 PM\nGreat app, but..\n\nI love this game and the comunitiy is great! I just wish it would connect to more stuff, ya know? Like, a google chrome book, or a phone, because some people cant afford a full on windows laptop or computer, so connecting it to a phone would be a major improvement!!\n\nHelpful | 1", "CMGrillo233 days ago\nAbsolutely Horrible!\n\nWhen I first read about this app I was super excited to watch some movies and when I saw that the Spongebob movie was in 3D I thought OMG my 5yr old is really going to enjoy this! The movie was to start today at 1PM so I wanted to make sure I gave myself enough time to set it up for her. I downloaded the app, installed it w/10 mins to go until the movie started. Logon to the BIGSCREEN server which seemed to take a little longer than a minute. Then took me to events which showed a gray rectangle and said starts at 1PM which mustve been a SpongeBob icon that did not populate off the server. So I clicked the gray box and it showed the green buffering/loading ring. Well that spun for several minutes. Now its 1PM the movie has started, but not for me still trying to load. I figured maybe everything got locked up so I exited the app, turned off the oculus turned it back on then clicked on the big screen app to reload it. Same thing! I exit the app it shows on the home screen Spongebob sponge out of water - so I click on it. Same, I try variations of trying my best to get this movie to start - NOTHING! Now its 1:25PM and I tell my daughter Ill try to find it on another one of our media outlets. Oculus HUGE FAIL here because Im the person who doesnt mind spending money renting movies online for my daughter. BIGSCREEN/OCULUS get your s**t together. I probably wont try this again for a month or two because Im so pissed off right now.\n\nHelpful | 0", "rbarnesdafneyJul 4 at 4:19 PM\nmovie tickets!\n\nThis would get five stars if it allowed for others to buy tickets for friends. We could meet in the lobby and go to the ticket book where we could buy them a ticket!\n\nHelpful | 3", "Que5tJul 16 at 5:36 PM\nHorrible friends interface\n\nFor some reason the app requires you to leave party audio when entering the game, making it nearly impossible to coordinate a viewing with friends... On top of that there is no way to invite friends to a room, they need a code which I cannot give them because they removed party audio!! Infuriating design.\n\nHelpful | 3", "misty3234Jul 17 at 5:02 PM\nExcellent\n\nAfter having my quest for a few days now ,, I've been in search for just a simple media player and have been disappointed until I came across this app. I must say I am in awe , it offers so so many options and room sceneries, screen setups. I haven't even begun to touch upon it all yet. I am truly overwhelmed by it. Thank you for creating this brilliant app. Thank you Aculas for making the quest. It is the most incredible thing I've ever seen in my senior lifetime. Love it.\n\nHelpful | 0", "narutoc5521 days ago\nA suggestion\n\nYou should have Movies anywhere company to join? I have a few 3-D movies which would be cool in those Auditoriums\n\nHelpful | 1", "Porterc76Jun 25 at 12:46 PM\nDumb\n\nFirst off 90% of the members are useless pre-pubescent children throwing tomatoes, throwing popcorn, and screaming into the mic being obnoxious. If that hasnt swayed you to stay away, how about the disgusting porn rooms, or the fact when u try to stream from ur PC it buffers, Lags, Freezes and everything in between. This would be. Good app if they actually didnt make the characters look like Wii characters. The rooms and environments are awesome, but people want a more realistic look in the members. So they look like real people not toons. They Lack Free tv ChAnnels, they have crappy movies u pay for. The app while the environments are good the rest is horrible.\n\nHelpful | 6", "Hamad86May 23 at 6:54 PM\nHighly recommended\n\nFirst of all i want to thank everyone who's works in this amazing app, i am new VR user and i tried this app and it makes me enjoy the VR experience..i want thanks the support team they works hard to solve me issue.. I highly recommend people to download it you definitely will like dont miss it...\n\nBest wishes for the developer\n\nHelpful | 9", "onemoredave3 days ago\nExcellent cross platform app\n\nExcellent content and controls for viewing and sharing media. Great mix of social features.\n\nHelpful | 0", "olienJul 12 at 1:07 PM\nCant use in Norway\n\nWhy cant see movie in norway and heard most buy too see a movie but cant even do that so and was young kid too was in lobby have same problem so tell why have program dont say need pay for movie and dont hope not cost too much since get on dvd/blu-ray\n\nHelpful | 2", "PentheusJun 30 at 9:08 AM\nBest of the Best\n\nThis is among the top two apps I spend the most time on my quest. I have wept watching heartbreaking movies till the tears fill up my headset, I have had amazing conversations with interesting people, I've laughed at weird horror films, I've sat alone and watched compelling documentaries, and so much more all thanks to this god-tier game. Whoever made this, thank you.\n\nHelpful | 0", "rahil535Jul 30 at 4:20 PM\nBest video player for oculus\n\nIn simple words its the best app to watch any movie. Specially movies that are 3D looks amazing.. all i can say is thank you for developing this app.\n\nHelpful | 1", "julian.johnson.72Jul 20 at 6:57 PM\nVery US centric unless you don't sleep!\n\nNice idea for an app but all the decent films that you can watch for free are shown at 3am UK time. So invisible that isn't going to happen for me. It would also be nice to have a channel guide so you know what is happening on the TV channels at what time.\n\nHelpful | 0", "bryan.heathcoteJul 25 at 6:33 PM\nEver wanted a theater in your bedroom?\n\nI this application for more than I thought I would. The clarity and quality is top notch and it really does give the feeling of being in a movie theater.\n\nHelpful | 0", "janet.woodvilleJul 2 at 7:19 PM\nBig screen\n\nNot sure what the problem might be but lately my marker bowl has had some glitches. The colors to pick from sometimes dont appear. Could you check and make sure that this isnt a glitch in BigScreens program? Thank you. Take care and be safe.\n\nHelpful | 0", "jelwellMay 18 at 11:28 PM\nGreat during lockdown!\n\nThis is a great way to \"get out\" and watch a movie with friends during the quarantine. Not going to lie, pre-covid this app just ranked as \"ok\". But now it's a lifesaver to be able to hear and interact with friends (and make new ones) while watching movies.\n\nI would like to see improvements for hosting your own content. The quality of the movie stream is much worse when I host (even with unlimited upload speed) compared to rented movies. Makes me think there is too much video processing required on hosted setups compared to your platform.\nMy Quest only supports 2 other friends (even though it's listed as 4, I'm one, my computer is 1, and then 2 friends). Would like to see this number increase.\n\nHelpful | 5", "Banja78Jun 3 at 1:56 PM\nGreat great potential\n\nThis is an amazing concept and a dream come true and does have great potential to be the main destination to watch a movie.\nNow it does not seem that there are enough rooms with movies running at the same time. Or rooms were full.\nAnd the networking aspect seems still a bit immature. People screaming to the whole audience or launching tomatoes at each others or talking while movie is running.\nI will keep check it on a regular basis as this has really an amazing potential.\nEventually this could lead some movie fans to host regular cin-club sessions. I would love to gather with movie fans from all around the world to watch old classics (not just last 30 years movies) and talk about them.\nAnd please manage the rights for Europe on recent movies too.\n\nHelpful | 0", "BCh1llyJun 3 at 6:17 PM\nGood concept, wrong execution\n\nI love the concept of a virtual movie theatre, dont get me wrong. However, paying for each individual movie with a ticket system is absurd to me. Why cant I just pay for the app then watch the rest for free? Or at least do something like Netflix and Hulu and pay for a membership.\n\nHelpful | 4", "ElbarkeroVRJun 6 at 4:14 AM\nGreat to chill and watch a film, but!!!\n\nThere is a couple of films per night to watch and the feature films are on at 3am uk time so we cant watch those. Crashed 5 times during one movie last night and I struggled to keep getting back in to watch it. Crashes quite regularly but I still use it because its decent.\n\nHelpful | 1", "tomihietalaJul 17 at 10:47 AM\nNo movies and no buddy up with Gear VR\n\nI was hoping to watch (rent) movies and use another headset to do it together with my gf. Nope, not a single movie available in Finland and no support (anymore) for Gear VR.\nI can only watch some TV channels and other free stuff. I'm glad didn't need to pay for the app.\n\nHelpful | 0", "joecotelleseJul 21 at 6:47 AM\nNeeds support for DNLA servers\n\nThere isn't enough paid or free content on here. Also, the public rooms are annoying since it's just a bunch of people talking over whatever is playing.\n\nAdd DLNA support please so I can stream off my own server.\n\nHelpful | 0", "JUANJESUSCHRISTMar 23 at 2:25 PM\nMy favorite thing on Oculus so far\n\nI've made some cool connections on here.\nLove the discussion rooms that people are setting up.\nIt's been great to interact with folks from all over the world especially now when we are stuck at home.\nMy favorite so far was a DJ dance party in an campsite environment.\nI think i\"ll be setting up one of my own.\n\nHelpful | 82", "MeatballmachineJun 16 at 9:22 AM\nWorse than real life theater\n\nHere is my experience so far. Idiots screaming during movie/tv, drawing obscene pictures in front of my face, climbing on me, performing simulated sex acts in my personal space...reporting these people does nothing. If you want to be sexually harassed, insulted, bullied and made fun of while trying to enjoy a movie without any ability to do anything about it, then this is the app for you. What were they thinking not putting a private viewing function or ability to block someone is beyond me. Poorly thought out, horrible experience. Also, what's the point of inviting friends to watch tv and both of your streams are completely off sync????\n\nHelpful | 3\nDeveloper ResponseJul 29 at 4:26 PM\n\nReport and Block features exist by tapping on the offending user's to open up this menu. User-hosted rooms need a strong internet connection and decent hardware in order to stream to a certain amount of users. Our movies and videoplayer features should have less syncing issues.", "JohSm67May 24 at 2:37 PM\nMaybe new Netflix/Prime Video\n\nGuys,\n\nYou are on to something!\nSocial Movie playback!\nFresh GUI and a nice experience.\n\nThere should be a subscription service like Netflix / Prime Video, but with a family (4-5) or a friend sharing possibility to make it easy to get together and watch Movies from a collection!\n\nAnd most important 3D movie content, that others are missing!\n\nMaybe a New kind of Spotify / Netflix subscription model....\n\nKeep up the good work!\n\nHelpful | 3", "Kadin2013May 20 at 11:30 AM\nthis is the best!\n\none of the ways to talk to people on with corona! vr is great and that goes with bigscreen! this game is great. would you agree?\n\nHelpful | 7", "Ernie.Alves11 days ago\nMovie selection\n\nIt's hard to keep the headset on for a whole movie. Gets uncomfortable. Needs better movie selection!\n\nHelpful | 0", "HeatWave2020May 11 at 3:11 AM\nA bit limited, but really awesome.\n\nIf youre afraid or unsure of more open chat settings such as in VR Chat or RecRoom, Bigscreen is a fantastic introduction to social VR. Hang out and watch TV while getting to know people. Because of the limited activities, it is a much more palatable experience than the chaos of other chat services. I love the tv shows, and I think its awesome that movies are becoming more available - especially during quarantine, I love being able to go to the movies with my close friends. It gives me a little bit of outside world experience while stuck inside.\n\nHelpful | 2", "LibraQueenJul 12 at 1:30 AM\nLibar Queen\n\nI really like the movies I was listening a lot of people talking about lotta things and stuff its like I keep going Ill back off or keep it in this black and then I come back in this black come back in but I have to come back and I dont know what the problem please help me give me a sign give me something but I really like it its nice in real cool thank you\n\n\nHelpful | 0", "inceptionalJul 5 at 9:52 AM\nIt's just not that great imo.\n\nSure, on paper it could be great for me because it lets me view my PC desktop in stereoscopic 3D mode, which means I can watch 3D movies and even play 3D games with a little bit of effort. But it's just a bit clumsy and clunky in practice: No matter what room I choose it seems the screen is a little too close, and the lighting in the rooms is really low quality and seems very compressed or something, especially in any of the cinemas. I wish the virtual hands would just go away. The avatars are fugly, and I can't seem to find a way to just hide everyone whenever I go into other rooms to watch a movie that's randomly playing or whatever. I want to love it but I just don't. Skybox VR Player is an order of magnitude better for simply watching my movies. It's just a shame that particular app doesn't let me view my PC screen in stereoscopic 3D mode. So, yeah, I'm not loving Bigscreen if I'm being honest.\n\nHelpful | 0", "spookyohJul 15 at 9:53 PM\nReally fun game\n\nalthough this does have some issues, it is still an extremely fun game. This and beat saber are my two favorite vr games\n\nHelpful | 1", "SouPNoTSeeJun 17 at 8:48 PM\nBad good app\n\nLove this app but....... It's crashes constantly on the quest.\nCan't adjust brightness of avatars.\nConstantly crashes on quest.\nNo premium servers.\nConstantly crashes on quest.\nDidI mention it CONSTANTLY CRASHES IF QUEST?\n\nHelpful | 3", "TywentghxstApr 14 at 9:21 AM\nADD FREE LOCOMOTIOM!!!\n\nI love it but needs the ability and freedom to move around, we have the joysticks, were not psvr, why is it only teleportation?\n\nWould go 5stars as soon as thats added\n\nHelpful | 29", "blackknight2020May 13 at 1:44 AM\nGreat but far too greedy ticket prices\n\nToo greedy for old movies\nI can buy the same movies for these prices they try to charge online.\ncant wait to get Netflix on vr subsciption ,be so much better on pricing\nNo cleaning,power,lighting,ticket selling ,toilets,insurance etc etc ....get a grip on reality with a fair price\n\nHelpful | 6", "hardrisk27dnJul 10 at 3:09 AM\nSrt still not support\n\nSrt file still not support, please fix this\n\nHelpful | 0", "GaminGodApr 18 at 4:24 PM\nGreat\n\nI love this app. It's my most used app on my oculus. But yall people saying \"they been saying video player coming soon for 6 months what a scam\".\n1. Its not a scam the f*cking app is free.\n2. It isn't easy programming sh*t for vr so shut up unless yall trying to program this app. I really want to see yall try.\n3. There has been games or other stuff that says \"coming soon\" but they weren't released until a year or more than 6 months. Stop being little b*tches and be patient.\n\nHelpful | 34", "MaxIRLJul 6 at 10:33 AM\nA must have\n\nGreat venues to watch films. A good replacement for cinema if you have nice headphones. Use this to watch films and TV with my father who lives in a different country and it's just perfect.\n\nHelpful | 0", "christophermcknightJul 24 at 6:22 AM\nBig screen beta\n\nThis needs work would like to stream movies that I have on my phone to the big screen vr that is the main reason I have this app very disappointed\n\nHelpful | 0", "1-VRJul 21 at 6:58 AM\nGreat\n\nReally cool, could easily replace my need for a tv\n\nHelpful | 0", "BeatzCreationsMay 13 at 1:29 PM\nHas So much potential!!!\n\nThis app at first was just insane and at times it still has that feeling..\n\nthe enviroments are amazing! The quality on the screen is amazing, audio is amazing.. interacting with other people in there is amazing\n\nBUT... the content for people in the uk is just so poor.. theres roughly 50 movies that you can buy tickets for and stream in private or join random people but the options for anyone in the uk its literally about 10.. some are animated dubbed films, theres a couple of random english ones that i have never heard of (and i think im quite a big movie fan) and then the odd 1 or 2 that im like \"ahh.. errm.. that one.. seen once .. not paying to watch it again\" :(\n\nAnd yep you can link your desktop to the screen and stream things yourself (not anything like Amazon or Netflix as it blacks the screen) but videos off your computer then invite friends / family in to watch which is AWESOME but on the Quest you have the option of addin 4 people max to a room which is more on the rift etc .\n\nIf the movie collection was massively updated for uk region and you could host even 6 instead of 4 is better! Then i would spend so much more time in this app.. ESPECIALLY during all this Corona Virus Lockdown!\n\nHelpful | 5", "miiisiiiMay 4 at 6:45 PM\nHappy sad\n\nAs much as I've loved to join some movies and communities i wasn't able to. The app is great and the idea of it is absolutely amazing, although this is when virtual reality is too close to REALITY with licencing issues and unfortunately becomes one of the examples of politics and media having control of VR and reality. Love the app don't like the influence.\n\nHelpful | 5", "dave.penney.56Jun 3 at 6:02 PM\nRound White Button between Couches?\n\nCould someone please tell me what the white round button with small arrow on it between the couches in my home room is and does it serve any function??...Its driving me crazy not knowing!! ....I did not see it when I first bought the headset..Quest...\nThanks, Dave\n\nHelpful | 1\nDeveloper ResponseJun 4 at 10:35 PM\n\nThat's our new light dimmer feature! As the host of the room, you can adjust the brightness of the room by turning the knob!", "c4rlos81Apr 17 at 2:20 PM\nI love this but...\n\n...there is sooo much room to improve, the concept is brilliant and I can't wait for what the future brings. My biggest gripes are the way the app needs me to use desktop vr to stream my pc as well as use bigscreen vr launched from within steam, it just seems so clunky, and when it is all working the latency is hurrendous. I'd like too see bigscreen support DLNA, like skybox does, I have loads of backed up movies on my nvidia shield TV and I installed a free DLNA server, skybox picks it up straight away and it just \"works\". It would be so much easier to do it this way\n\nHelpful | 13", "StephenGdBakerJul 29 at 6:15 PM\nNice idea\n\nI'm sure they'll make millions but the prices are a rip off. Very sad movie collection.\n\nHelpful | 0", "Grevius4 hours ago\nGreat time\n\nHonestly VR Chat isn't for me, But Bigscreen is.I just like going in-between Nickelodeon and Hells Kitchen taking to people with the show in the background. It's a great experience and I recommend it to anyone especially since it's free.\n\nHelpful | 0", "StaticCloudMay 9 at 3:03 AM\nUnavailable in your region.\n\nThought it would be cool to watch some 3D movies in VR but literally over half of them are unavailable and none are in 3D so at that point I might as well just watch them on another streaming site. The game runs fine, looks good, but with all the twitter posts and announcements for new films I can't see, it's just incredibly annoying. Don't bother if you aren't in America.\n\nHelpful | 4\nDeveloper ResponseJun 3 at 6:44 PM\n\nMovie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We have many free features that you can use without region restrictions like desktop sharing, certain TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned!", "FancyEeveeMay 10 at 1:07 AM\n\nThis is a great app not going to lie but for me, I'm not always going to be on my windows computer to be able to use remote desktop so Chromebook support for remote desktop would be nice I don't know if that is possible but it would be cool at least for me\n\nHelpful | 1", "BossLadyHMay 14 at 1:33 PM\nIt's ok!\n\nIt's ok for watching the odd thing but the quality of the screens is quite bad.\n\nI also haven't seen if the cinema you pay for is better because you can't buy the film's in the UK which is pretty gutting tbh. I think this is one of it downfalls.\n\nIt's great to chat and chill with mates too as well as watching films with everyone.\n\nYou can't add people as friends which is another downfall so the only way you add people to the same screen is by giving the code to the room. I wish you could add people and invite. Would make it so much easier.\n\nIf theses few things changed then it would deserve 5 stars.\n\nHelpful | 2\nDeveloper ResponseJun 3 at 1:45 PM\n\nQuality and performance may vary in user-hosted rooms as it depends on their connection quality and hardware specs. However, movies directly from Bigscreen should be higher quality and you can check out how they perform by watching the movie trailers. Movie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We do have several movies available in the UK - please browse through our Movies section. We have many free features that you can use without any region restrictions like desktop sharing, TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned! We are also definitely working on a Friends System, so please bear with us!", "SupacalypseMay 15 at 3:51 PM\nA must have\n\nIf you have a VR headset, then Bigscreen is a must. Movies, shows, hold talks, meeting anything on Bigscreen. Very straight forward to use and enjoyable. You will meet a lot of great folks here.\n\nHelpful | 3", "slamberhamJun 28 at 9:26 PM\nThank you for adding local 3D movie file\n\nThanks for adding local 3D movie files support. Last Jedi and Tron Legacy have never looked so good.\n\nHelpful | 1", "uktechnicsApr 15 at 11:03 AM\nThis is a scam, read why\n\nSo the developers of this App have been saying that local file playback will be available. They have been saying this for over 6 months. That's one scam of trying to get people to download this app. The scam they are trying to pull off is charging ridiculous amounts of money to watch movies that are years old, like Indiana Jones. I mean come on.. I wouldn't mind paying for recent releases, but the movie selection in the UK is a joke. So many people are anxiously waiting for local video file playback and it hasn't been made available. Why even mention it, if it's not available?\n\nHelpful | 16\nDeveloper ResponseJun 3 at 6:48 PM\n\nBigscreen is a free app for you to try out. We are not forcing you to purchase any movies. We have many free features that you can use without region restrictions like desktop sharing, certain TV channels, and social gatherings. Movie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. Our upcoming feature, video player, will allow you to watch your content directly from your headset. It's actually available to volunteers to try out right now.", "toriooJun 6 at 9:58 AM\n\n dont know what to do ! i have a stream and the bigscreen on it and i was connecting and launch my VR to it < now its wont be its says that i have to launch my VR !! its allready launched i dont know what to do else !!\n\nHelpful | 1", "PhiloVanceMay 27 at 1:33 PM\nInvasive permission requests\n\nIt requests permission for everything (files, photos, etc., AND microphone). And it wont even let you look at it without those permissions.\n\nNope. I cant believe anyone would grant that without a reasonable explanation of reason AND limitations. That is also inconsistent with Android developer recommendations.\n\nThe concept is kinda cool, but why do you need access to my photos, for example.\n\nHelpful | 7", "nononononokMay 16 at 11:32 PM\nSmall suggestion\n\nIt would be pretty cool if when it comes out you could link your Netflix, Prime Video, HBO etc. accounts to watch movies that arent available in the app itself\n\nHelpful | 4", "michael.laplante.90May 28 at 1:37 PM\nUnderwhelming social app\n\nThis gets mentioned often in Ouest reviews for 'must have' apps, but I do not get the appeal of it.\nThe environments are nice... I really like the outdoor drive-in one.\nBut, the streaming quality isn't very good. Some movies are completely unwatchable due to stuttering.\nAs a social app it's hit and miss... Sitting in a dark theatre with just one or two other silent avatars is creepy to me. A few times I've run into young kids in the lobby who are just annoying to listen to. Yes, you can mute people but it's too much work to figure out who is worth listening to and who isn't.\nThe commercial movies on offer are 'past their prime'. In some cases, way past their prime. Plus you're always on someone else's schedule when it comes to watching stuff that isn't yours.\nI haven't used this yet to stream my own stuff to my room so I may keep it for that reason. But as a social app, it's a miss for me...\n\nHelpful | 0\nDeveloper ResponseJun 3 at 1:38 PM\n\nThanks for the feedback! User-hosted rooms will vary in quality and performance as those rooms are running from their connection quality. We will continue to work with more studios to obtain more movies, and hopefully theatrical ones someday. Definitely try streaming your own content on your own time! We have a video player feature coming soon that allows you to play content you have from your headset. Stay tuned!", "Madzen1981May 21 at 10:00 PM\nYes just Yes!!!\n\nI love the social aspect of watching a movie in a theater with people from around the world fantastic!\n\nHelpful | 3", "Luimed787Jun 7 at 8:18 PM\n\nSucks I paid for a film thinking I could watch it when I get back from work and film aired without me and I couldn't even watch it they wanted me to pay all over again bigscreen u suck!!\n\nHelpful | 1\nDeveloper ResponseJun 11 at 8:12 PM\n\nSorry to hear that you were unable to make it to the event you paid for! Please email us at support@bigscreenvr.com for a refund. The on-demand movie section does not require you to watch the movie at a specific time.", "WellyeahMay 24 at 3:50 AM\nJames Camerons DeepSea Challenge 3D\n\nThis is my official request! I will pay dollars to see this movie in one of your theaters.\n\nDollars...\n\nHelpful | 4", "SojoAmMay 13 at 4:31 AM\nDo they EVER change the On Demand movies\n\nI was really excited to find that I could rent 3D movies. Choices werent great, but I thought thered be options every once in a while. They havent changed in weeks. There was a free 3D last night in a public room that I was really excited about, but someone very annoying sat next to me and I left. I tried to go back this morning and it wasnt playing. Ill pay for private if theyll just show a variety. If I cant find anything Im interested in to rent and people in the public room are annoying, whats the point of the app? I rated it a 3 because of hope.. there is potential.\n\nHelpful | 1\nDeveloper ResponseJun 3 at 6:41 PM\n\nWe will gradually add more on-demand movies for rent, but you should be able to create a public or private room. If you're referring to the Events, you definitely have the option to join a private screening instead if you join via the menu. You also have options to block other users, disable toys, and mute one person or everyone.", "thejuggsterApr 28 at 9:08 PM\nHome amc\n\nExcellent chill chat and just watch whatever, just finished watching ghost in the shell 3d for 5bux, well worth it if its 3d and a movie you havent seen in a while, wouldnt pay for movies you can find in a movie platform that you have access to already, but ghost in the shell 3d i have not seen anywhere even in theatres, atleast i dont recall it ever being shown in 3d\n\nGood quality movie when you pay, otherwise the p2p rooms depend on the host and connection\n\nMust have since its free, and a good spot to just cool off after too much intense gaming\n\nHelpful | 1", "JCC08May 14 at 6:19 AM\nLaggy\n\nThis is a great concept but every time I try to stream movies from my desktop the screen is either black, audio doesnt match up, or very slow. This doesnt happen with Skybox. Hope it can be fixed.\n\nHelpful | 2", "dogmom6May 30 at 12:41 PM\nPermissions\n\nI see no need in having access to my phones files, photos etc. Deleted the app off my Oculus.\n\nHelpful | 7", "Teddyvr12Mar 29 at 5:58 PM\nWhy don't they let Mac books?\n\nI like big screen and everything but what I don't like is why don't they let Mac book pros? I don't really think it is fair because other people just show off.\n\nHelpful | 7", "zaki92May 2 at 2:17 AM\nNo on-demand media\n\nNo on-demand media available for me due to region restriction. I think they need to put off this restriction so anybody in anywhere can enjoy the content.\n\nHelpful | 5\nDeveloper ResponseJun 3 at 6:45 PM\n\nMovie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We have many free features that you can use without region restrictions like desktop sharing, certain TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned!", "cybergazzMay 17 at 5:55 PM\nWhat's the point, no films in UK!\n\nNo idea what the experience might be like because of moronic regional restrictions. Apparently they don't want our money!\n\nHelpful | 3\nDeveloper ResponseJun 3 at 1:42 PM\n\nMovie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We do have several movies available in the UK - please browse through our Movies section. We have many free features that you can use without any region restrictions like desktop sharing, TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned!", "tullen.burnsMay 13 at 4:21 PM\nThe best home theatre\n\nI like the options of viewing environments and the ability to watch with friends. I also really appreciate that I can watch 3D titles. Plus the customer support is great. Shout out to David. Thanks!\n\nHelpful | 1", "ramm36077Jun 9 at 11:47 AM\nDont bother\n\nIf your in the UK this is a complete waste of time.\nEverything is unavailable.\n\nHelpful | 1\nDeveloper ResponseJun 11 at 8:10 PM\n\nMovie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We do have several movies available in the UK - please browse through our Movies section. We have many free features that you can use without any region restrictions like desktop sharing, TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned!", "Zane_DragonBornJan 17 at 12:37 PM\nIts a good game but needs more shows\n\nThe game has a lot of future but needs more tv channels like live tv has. There are only old shows playing. Also, I heard of a twitch streaming feature but have seen anything. Is there going to be a Twitch, YouTube, Netflix or other applications integrated into this game? I haven't had a reason to use this ever because the free shows are old and I could just go to a real cinema which I can watch the shows with better graphics. More media then itll be a great app.\n\nHelpful | 38", "0ops1eJun 7 at 8:31 PM\nOld movies for $6... Uh no\n\nEvent screenings are overpriced and the app serves little other purpose\n\nHelpful | 1", "nyra.raynMay 13 at 10:58 PM\nLacking Promised Features\n\nPlay files from files stored on your headset or mobile device, available 2027, maybe.\n\nHelpful | 4\nDeveloper ResponseJun 3 at 1:47 PM\n\nWe're working on a video player feature right now and it's available for alpha testing for volunteers. You can stream content directly from your headset. This feature will definitely be released this year. Be sure to sign up on our Discord if you want to try it out.", "duchesnedave14 days ago\nComplicated!\n\nLooks good, but I want to play my own stuff, which is possible only with Virtual Desktop VR, and this is where the mess kicks in: I followed the instructions, search the web, installed the Steamer, installed Bigscreen on my PC, after creating an account of course!! Nothing worked, no clear instructions anywhere, outdated youtube videos don't match what you see on screen, and when I've done everything that's said to do, and start my Virtual Desktop streamer, put on the Quest and open Virtual Desktop...nothing's changed, no Library tab to configure Bigscreen!\n\nHelpful | 0", "Beck9000May 1 at 8:43 PM\nVery good\n\nNice update more contents and much faster\n\nHelpful | 2", "raregamer123May 29 at 1:56 PM\nI CANT INSTALL THE DRIVER\n\ni would play this but I CANT INSTALL THE DRIVER AND WATCH NOTHING THEE SCREEN WILL BE BLACK I CANT HEAR NOTHING BUT i would play this game\n\nHelpful | 0\nDeveloper ResponseJun 3 at 1:34 PM\n\nPlease email us at support@bigscreenvr.com to assist you with installation instructions and to verify your computer has the right requirements.", "CaptainFroglegsJan 2 at 10:17 PM\nCool...yet weird\n\nGet on the app late night and find a bunch of weirdos. I guess I get the idea of the paying for tickets in a theater (especially in 3D), but I dont agree with it. Watched Ghost in the Shell and enjoyed it, but yea wtf devs let the people watch!\n\nAnyway peeps are weird but idea is cool.\n\nHelpful | 139", "antburtMay 7 at 12:04 PM\nAmazing!\n\nFirst off the prices on the movie tickets are reasonable especially the 3D movies but at night you can find some weird people overall this is a great app I recommend to everyone.\n\nHelpful | 1", "NotAvaliableJun 5 at 9:14 PM\nmissing required app permissions\n\nI wanna know how to fix this problem because i dont know what to do\n\nHelpful | 1\nDeveloper ResponseJun 11 at 8:16 PM\n\nFrom your library, please tap on the three vertical dots below our app image and select Permissions. Turn on the permissions! If you have any further questions, email us at support@bigscreenvr.com", "CongratulationsJan 20 at 1:05 PM\nNot all films in U.K. \n\nI find watching movies in VR good, i do like this app just not many movies you can watch in big-screen cinema in the UK, I hope people in U.K can watch more movies soon. Rather than that I cant wait to see VR take off and watch movies with me friends and family in VR. \n\nHelpful | 21", "GirlGeek101May 6 at 7:56 PM\nAMAZING experience already!\n\nI am very excited about this, its a big help for couples living Sleepless in Seattle every day! My favorites are 3D movies and desktop streaming!\n\nHelpful | 1", "rob.dee.1970May 31 at 5:25 AM\nNot for mac\n\nNeeds to be iOS compatible. Mac users mis out.\n\nHelpful | 1", "King_Of_EgyptMar 27 at 2:41 PM\nAmazing app\n\nIt's amazing and so funny app and very great\nBut I can't buy tickets from Egypt\nThe website says that it's not available on my country\nBut I still enjoy the free content\nThank you very much for this great job \n\nHelpful | 2", "BabrelApr 9 at 1:51 AM\nAmazing\n\nWell worth getting it. It's so much fun to watch movies with friends and the app runs flawlessly! No complaints.\n\nHelpful | 4", "Atrocitus01May 4 at 11:53 AM\nSo unhappy\n\nI cant even make a log in it keeps saying cant create account, and i tried to uninstall and reinstall and still, to bad\n\nHelpful | 2\nDeveloper ResponseJun 3 at 6:45 PM\n\nSorry to hear! Can you please email us at support@bigscreenvr.com for assistance?", "NinjaXMJan 25 at 8:53 AM\nIf only it had a browser for Netflix\n\nThe main reason I got a Quest and not a Rift is the ease of use and accessibility offered by the Quest. I dont want to turn on a computer every time, let alone install a client.\n\nIf I can watch Netflix on this Ill be in heaven. I know its tricky with copyright and all, but you could have different people in the room have their own separate browser. This should also get rid of any latency or lag issues.\n\nIf this happens I know what Im getting my GF for her birthday.\n\nStill giving it 5 stars because the environments are great, and I hate to take down the ratings just because Im lazy and dont want to use a computer.\n\nHelpful | 14", "spengelawoolferhans6 hours ago\nGarbage\n\nMessed up perfectly good Quest. All they want is to spy and gather data so they can sell it to third parties.\n\nHelpful | 0", "HylianLoserJun 24 at 11:38 AM\nGreat but missing one feature\n\nThis app is great but I wish it had hand tracking. Its very annoying when Im trying to do some really quick but I have to grab my controllers in the middle of a movie. Thats really it though, 10/10 otherwise.\n\nHelpful | 1", "GotPalmerMar 7 at 8:31 PM\nawesome\n\nthis is awesome idea and concepts of the app! I loved it but ive noticed few things that should be fixed asap! No subtitles or CC - that is not really accessible to everyone so please fix asap...\n\nHelpful | 4", "P828213 days ago\n\nThe best movie experience I have ever had\n\nHelpful | 0", "Mathurm2112Feb 29 at 12:44 PM\nOld titles\n\nThe concept is very cool. Watched top gun from 1987... felt like I was really in a theater. The 3D effect is amazing and its a fun way to watch a movie.\n\nI think i heard some Scottish guy with an open mic bumbling around his house washing dishes or taking a piss. Lots of weirdos late a night too...\n\nOnly reason I wouldnt give it a higher rating is that there arent new releases and like 4 movies to watch.\n\nI have misophonia and cant stand going to a theater. I would pay like $20-$30 to be able to watch a newly dropped movie the day it comes out instead of having to go sit around people slobbering all over their popcorn and such. I would hope this app gets to that point\n\nHelpful | 3", "gameking21May 2 at 3:38 PM\nGreat app\n\nIt was and still is the best app I have installed\n\nHelpful | 0", "gronchastJan 29 at 4:00 PM\nGood but disappointed\n\nI like most of what you can do with big screen but one of the main reasons I bought big screen was for the big screen cinema 3d movie showings but so far you can't watch them in the UK due to copyright issues I hope this will change in the future as 3d preview on big screens servers look brilliant.\n\nHelpful | 11", "CoolcatmanMay 8 at 11:07 AM\nGood\n\nThank\n\nHelpful | 1", "kodi.dolemanApr 22 at 8:26 AM\nMovies..\n\nWont even let watch a movie because its 'not available in your region$\n\nHelpful | 2\nDeveloper ResponseJun 3 at 6:46 PM\n\nMovie licensing is really out of our control, but we hope to work with more studios to expand our catalog and region availability. We have many free features that you can use without region restrictions like desktop sharing, certain TV channels, and social gatherings. Our upcoming feature, video player, will allow you to watch your content directly from your headset, so stay tuned!", "SimplymeApr 24 at 7:10 PM\nWTF\n\nThey charging to watch movies. Lololol\n\nHelpful | 4", "Senor_CerdoFeb 24 at 7:00 AM\nhow do i watch movies\n\ni want to watch the new star trek, ghost in the shell and interstellar but it seems none play in UK???? how do i change this? what's the point of having this app in the UK quest store if you can't watch any movies on it? 1 star until i hear some answers\n\nHelpful | 8\nDeveloper ResponseMar 27 at 7:25 PM\n\nUnfortunately, not all movies are available in all countries due to licensing. We hope to work with more movie studios to provide awesome movies to more people soon. We did own the rights to provide certain movies to the UK in the past, such as Shutter Island, Indiana Jones, Cloverfield, and etc. Be sure to check back on our website to see if more movies are available to you in the future.", "boroboymattDec 17 at 8:12 PM\nLoving the cinema\n\nOK, so I've had some really funny/interesting experiences but never stellar video/sound in the social rooms which I know many times has to do with the host's internet speeds/bandwidth, but just watched Ghost in the Shell on the new cinema and this really makes me hopeful that if it catches on, we may eventually start seeing first run and maybe even theater movies on the app. The 3D in VR is the best 3D I've experienced <3\n\nHelpful | 32", "Crazy_SaneNov 27 at 8:45 AM\nGreat Idea\n\nThis is a great app for watching movies with friends. And if you don't have a friend around, you can easily make new ones. It does feel a little glitchy, but with the bugs ironed out, this is sure to be popular.\n\n28/11/19 Update: why can't we stream media directly from the Quest? I heard months ago that this feature was coming. My PC isn't powerful enough to run bigscreen, hence why I got a Quest, so I can't run the software to stream anything. For that reason, and the fact that Pluto TV has way too many ads, I've gotten little use out of the app. That would change if I could stream local media. It would also be awesome if you could stream android games to the screen somehow, perhaps by casting your phones screen. Just some way to play games without a PC, particularly multiplayer games, would be next level.\n\nHelpful | 87", "SwthekingofgamesMar 15 at 7:22 PM\nNeed help to stream from cromebook\n\nTried to stream but could not do it on my Cromebook great other then that\n\nHelpful | 2", "JawlsDec 22 at 10:33 AM\nPotentially great, remote desktop buggy\n\nThe app itself I had no problems. It runs on the oculus quest without difficulty, I looked around other rooms and it was interesting to see them hosting videos.\nIts a bit strange feeling like I'm in a theater room and having random kids asking questions while I try to watch. Muting is an option but it doesn't stop popcorn bags from getting in my view or have them flying past me. There doesn't seem be any option shift seats or move rows. There also isn't an option to move to another instance of the same room.\n\nTrying out Remote desktop on steam was problematic. It requested I login to my account and refused to recognize my login. Attempting to logout and login on the website and headset works fine so I conclude its the steam app.\nIt has the potential to be great assuming they get some form of crowd control and as more people I know get into vr. Until then its nice to have an option to watch Pluto TV in a private room.\n\nHelpful | 10", "BitterMcLungieJan 12 at 1:27 PM\nbetter purchase options please\n\nit needs to have an option for automatic billing. the only way i understand to pay is to do it through a computer. I would like a way to do it without taking off my VR headset. I want to forget i live in a real world. if i have to take it off to go to my computer, i loose that VR feeling.\n\nHelpful | 15", "sponderbMay 15 at 5:16 PM\nunable to install\n\nhelp\n\nHelpful | 0\nDeveloper ResponseJun 3 at 1:43 PM\n\nPlease make sure you have a good internet connection to install our app and make sure the Oculus platform is up to date.", "ElgrebaJun 29 at 4:23 AM\nGet it!\n\nJust mind-blowing just get it! What a surreal feeling siting in a VR Cinema meeting people around the world at the same time or invite friends watching a movie together.\n\nHelpful | 0", "ken.hutchJan 13 at 7:17 PM\nWow, much much better!\n\nLast year I tried bigscreen with Windows 7 and my Go. Hosting did not work right, the stream did not look good, and the sound was odd. I gave bigscreen 1 star back then.\n\nThis year, I am using Windows 10 and my Quest. Hosting worked well, the stream is pretty decent quality, and the sound is great despite sometimes having a slight delay. If you use VLC media player on Windows, the J key and the K key can reduce or increase the audio delay, so delays are not a problem.\n\nThe rooms are cool, though it would be awesome to be able to adjust the lighting.\n\nIf there was some type of VNC hook to be able to control the desktop that would be amazing. Like a virtual desktop / bigscreen merger.\n\nWell done bigscreen! My wife and I can now watch shows I have downloaded in VR together. I have been waiting for this for years.\n\n***Its quite inception-y to be on my real couch with my wife both in VR sitting on a VR couch watching ourselves on our VR TV through a stream of my webcam of us sitting on our real couch...so crazy.\n\nHelpful | 7", "PartyKoala86Jun 26 at 4:13 PM\nI need help\n\nhow do i get to play something on my screen i couldn't figure that out\n\nHelpful | 0", "seedeeveeJan 27 at 7:20 PM\nMore Like Bigscreen Cash Grab\n\nWho doesn't like free?!? I sure do like free.\n\nWho likes getting woken up by text messages promising a nice 3d movie to watch later in the day? Free stuff, I like it.\n\nWait, what?!? $4.99 to watch your dumb movie I already watched 10 times on netflix/amazon prime? $4.99 after you made me sign up for ONE MORE MAILING LIST? $4.99 after you promise me free stuff but REQUIRE MY CREDIT CARD NUMBER AND OTHER PERSONAL INFORMATION?!?\n\nWho do you think you are - Apple?\n\nNFW\n\nHelpful | 17\nDeveloper ResponseMar 27 at 7:23 PM\n\nMajority of our app is free - you can stream your own content, pick from a variety of environments, and socialize with other users. You do not need to enter your credit card number and personal info. You only need to enter your credit card number if you want to purchase a movie. We don't require you to subscribe to our newsletters - if you signed up for them, you can unsubscribe from them.", "BANCO21Feb 21 at 4:12 PM\nInvasive Permissions\n\nI would have used the app and bought a movie to play in 3D but they dont need access to all my Storage and files. Relax permissions and increase my privacy and you would get a customer.\n\nHelpful | 9", "HardcoreHarlowJan 19 at 7:52 PM\nLets go to the movies!\n\nThe $5 3D movies are great and you get the option to watch them privately. The rest...just be prepared its mostly social. Still, this app is great! I sat in on someone streaming their latest Dr Who episode...they could have used a better upstream I think, but it was still fun and nice of them to do. The official movies are top notch quality.\n\nHelpful | 4", "Iko-ZuMar 19 at 8:22 PM\nGreat but...\n\nLove it. Love the environments. Love that you can invite friends in private but still lagging a lot when you host a movie so it's a big problem :(\n\nHelpful | 2", "BackflipNationJan 14 at 3:37 PM\nGood Stuff!\n\nMovies today are $5, but if you have no money, not to worry, there are public rooms that people play movies in, as well as a small variety of shows to watch. I forgot to mention that there is are free rooms that play movies. Tones of fun, and really amazing gameplay for a Betta app!\n\nHelpful | 7", "Alltimebest2009Apr 17 at 3:58 PM\nI cant connect the remote desktop\n\nHello! I am having probs with remote desktop I searched up all the ways and cant find anything.\n\nHelpful | 0\nDeveloper ResponseJun 3 at 6:46 PM\n\nPlease email us at support@bigscreenvr.com for assistance!", "cantennaFeb 15 at 1:41 AM\nIt's great! But...\n\nI think more can be done for Quest; needs a pc companion app that extends capabilities.\n\nHelpful | 3", "appleface57Feb 12 at 5:09 PM\nBoring and a salty community\n\nIts not that great, honestly. I was in this room and was like I want to throw a tomato and some dude in the back is like No ToMaToEs Or KiCk so then I keep trying to move around and open my menu and because Im not that great with the controls, the guy kicks me. He literally warned another guy for talking! And also, he didnt give a single crap about the warns. Just 2 earns while watching Knives Out... this game has a cool concept, but the god dang community just ruins it. And lets be honest, it gets boring after a little bit\nFinal Review, (From 1-10) 3-10.\n\nHelpful | 3", "jacobbbyFeb 7 at 4:00 AM\nGreat idea with pretty good execution\n\nI can't wait to see where this takes vr.\nI enjoy spending time in this app whether paying for a movie or just watching free stuff or even watching trailers is fun.\n\nHelpful | 2", "magicbandzMar 28 at 5:54 AM\nA great app to meet with friends.\n\nBigscreen has come a very long way and Im happy to see it improve more and more.\n\nHelpful | 0", "NoahGaming95May 30 at 4:10 PM\nAmazing!\n\nThis game is amazing! You can watch any show on the list, or watch movies/live shows. You can also choose to have VC on or off in the game, and you can interact with other players. You can also draw, or do other stuff. Best Free VR game I have ever played.\n\nHelpful | 0", "Trunkybum2020May 28 at 10:36 PM\nBreaking the law\n\nIve not got a headset yet but letting people watch stuff for free is wrong\n\nHelpful | 0", "roli_oliMar 27 at 9:34 PM\nSTUCK AT 55% FIXED\n\nStuck loading outside.\nEdit: Factory reset headset fixed this issue.\n\nHelpful | 1", "moocow359Mar 1 at 9:03 AM\nGutted\n\nI really think this could play a big part in driving the future of film and entertainment, but having got so excited about the films being shown, I realise now that most of them wont play in the UK. Sort this out please and this is a deffo 5 stars.. until then its not much use to me.\n2 stars to take into account some cool user added material.\n\nHelpful | 0\nDeveloper ResponseMar 27 at 7:37 PM\n\nUnfortunately, not all movies are available in all countries due to licensing restrictions. We hope to work with more movies studios to expand the range of movies we can offer. Stay tuned!", "FlaginGodMar 12 at 7:57 PM\nBest thing\n\nQuality isn't good but the app is great\n\nHelpful | 1", "debksurDec 14 at 8:54 AM\ngreat but ....\n\nI do like the way you can watch things on here but every time there is a good movie it is half way through.Is there anyway of knowing what times programs or films are on?\n\nHelpful | 18", "leo422436Mar 8 at 6:23 PM\nBig screen\n\nI like this game a lottttttttttttttttttttttttttttttttttttttttttttttttttttttt\n\nHelpful | 2", "samuel.piliourasMar 24 at 9:40 AM\nLocally?\n\nBeen waiting too long for the play local files.\nI'm usually not.by my PC . Love this but please hurry.\n\nHelpful | 1\nDeveloper ResponseJun 3 at 9:06 PM\n\nVideo player testing has commenced! Please sign up on our Discord to try it out now!", "pam_22Dec 30 at 8:17 PM\nProblem\n\nThe only problem I have right now on the quest... And I've had other people confirm this. When you enter a open party and there streaming somthing the stream s sooo laggy. Now one or 2 people its not bad but when you have a near full stream like 4 to 10 people the stream gets super laggy then frozen but the audio still plays. Please fix unless it's the quest at fault for not being a vr that runs off a high end computer\n\nHelpful | 2", "travelsterMar 27 at 6:44 PM\nVirtual Desktop very very hard to instal\n\nI installed it for the virtual desktop but getting that to work is a mess with very unclear instructions on what is needed on Windows.\n\nHelpful | 0\nDeveloper ResponseMar 27 at 7:12 PM\n\nSorry to hear that you had trouble using our Remote Desktop feature. Email us at support@bigscreenvr.com for us to help or check out this step-by-step guide on how to do so: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "ronnietuckerJan 22 at 9:04 AM\nGood idea, but badly flawed\n\nGood idea that you could, in theory, sit in a virtual theatre and watch a movie or three. Unfortunately, some movies are only available in some areas. Thankfully, there are free movies to watch. Unfortunately, you could end up (like I did) sitting next to some idiot who wants to annoy you with popcorn or scribble in your face (forcing you to move). Streaming movies from a PC only works from Windows. So if you use Mac/Linux (like I do) you're bang out of luck. Shame, as it could be a great app.\n\nHelpful | 3\nDeveloper ResponseMar 27 at 7:58 PM\n\nWe have various tools you can use to block disruptive users and mute anyone, or everyone. Mac is not support in Bigscreen, but we hope to do so in the future.", "miguelrc1392005Feb 8 at 7:55 PM\n\nI think this is a good idea but you need to add more channels like cartoonnetwork\n\nHelpful | 2", "hxrrison01Feb 19 at 8:30 AM\nhhtrhrg\n\nfhfgdfgfg\n\nHelpful | 7", "CoolDude212Jan 17 at 5:18 PM\nPretty good\n\nSo Ive played this before on my o rift but now Im playing it on my quest and its way cooler\n\nHelpful | 4", "posthuman87Dec 31 at 10:53 PM\nAmazing\n\nThe resolution on the 3D movies is GREAT. I love the feeling of sitting in a theatre, I actually forgot I was at home! Love the cinema update. Great work devs. Thank you so much.\n\nHelpful | 8", "billy.rockstar56Jan 23 at 10:20 PM\nAwesome\n\nLove watching the movies on the big screens and you can have a private showing also if you want , the movies are cheap compared to the theatre to be able to come back later if not finished is fantastic mute everyone what more do you want great job!\n\nHelpful | 2", "steve13870Jan 12 at 4:44 AM\nPotential\n\nThe uk has been left out in the cold. I was really looking forward to the cinema experience but the availability of films for the uk is virtuually non existent and the devs will say something like distribution rights in the uk but whatever the reasons bigscreen is missing out on a massive market ,me personally i would of watched at least one film a week ,very very disappointing\n\nHelpful | 3", "N16H7M4R3Apr 25 at 2:33 PM\nAmazing!\n\nIt actually feels like youre in a movie theater! The fact that you can buy a movie ticket and go to the theaters without having to leave your home is amazing! You can watch movies while hanging with your friends and thats not all. You can watch TV with your friends and go to chat rooms and meet people. Its similar to IMVU but better. \n\nHelpful | 0", "thornvrDec 22 at 2:57 AM\nCan't buy the movies in uk \n\nThis is brilliant one problem can't buy the movies to watch in the uk please fix this\n\nHelpful | 9", "guyver187Jan 26 at 12:16 PM\nRubbish\n\nGlitchy. Need a pc to invite friends for private viewings. Overpriced dvd bluray rentals you can buy for 1 and the free showings are half show half adverts. Oculus after 3months is becoming annoying. Sorry but that's been my XP on bigscreen.\n\nHelpful | 1", "LadyLynn04Dec 20 at 5:55 PM\nWould be great if it worked\n\nFollowed all the steps. In Steam I get a message that Bigscreen requirements are not met - no posted way to fix this under support resolutions or community chats. Also the app screen on my Quest has disappeared and I can't play any games. Not a black screen, just not there. This high dollar toy is worthless to me now. Anyone had this happen and found a solution???\n\nHelpful | 6\nDeveloper ResponseMar 27 at 8:00 PM\n\nSounds like step two was skipped if you're seeing the \"requirements are not met\" screen. Be sure to run Bigscreen in \"Remote Desktop Mode\" to work: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "CaffeinePoweredFrogSep 30, 2019 at 3:31 PM\nThe potential here is staggering\n\nTaken as a given that you understand this is a beta product there are some issues that need adressing but i have confidence they will all be fixed. This is a FREE virtual cinema setting with some simple social interactions. I got this on day one of getting my oculus quest and was blown away by the scle and vision this team has. I believe there are plans for paid cinema tickets for current movies and this would be AMAZING. i cant wait to watch a 3d movie in my own home and experience it like a cinema experience.\n\nAs someone who suffers from accute social anxiety, i struggle with large venues filled with strangers and a real world cinema visit can trigger severe social anxiety for me and this app is a solution to get the same experience without that anxiety threat. This app is a godsend for me and hands down my favourite experience type app i own on the quest. Please more content and movie showings even if i need to buy a virtual ticket. I want MORE please!!! oh and pass that popcorn \n\nHelpful | 140", "velserFeb 14 at 10:14 AM\nMovies not available for Central Europe\n\nOverall app is nice, but sadly no movies available in my country which is in central Europe :(\n\nHelpful | 2", "TCORONADO26Mar 22 at 9:03 PM\nMore Showtimes\n\nI enjoy using this app to watch movies, but wish there were more options. Currently its only 4 movies at a time. I dont mind paying the 5.00 dollars and love how I buy my ticket in VR. The popcorn and drinks adds that realistic element. The theaters are also very well done. Great escape from reality! Just wish people would stop throwing popcorn at the screen lol\n\nHelpful | 0", "DeepMellowFeb 17 at 4:58 PM\nFun\n\nLots of stuff to watch and people to interact with.\n\nHelpful | 2", "stephenharrisonJan 1 at 3:41 AM\nPlease help\n\nI can't seem to cast from my laptop onto my vr set. I have followed the process but I can't find the settings button next to the app where it says cast from PC or something like that. It doesn't come up with the three dots next to it. Please help. There's nothing wrong with the app. The app is perfect. It's just that I am bad at technology. Someone please reply asap\n\nHelpful | 0", "Princess12349Dec 3 at 9:22 AM\nOmg!!\n\nFirst of all I am so greatful that this wonderful creator of this app made it free! Xxx And this app is so awesome and it sso nice to just sit with others and watch a movie and I like doing it because I have anxiety so once again ty so much. Also excited for tomorrows ever x\n\nHelpful | 4", "SnuggGDec 26 at 3:52 PM\nHorrible\n\nHad to uninstall after my location was shared, was told they would get to the bottom of it as to why or how, but have yet to be contact by the support team\n\nHelpful | 14", "KirigayaMarcDec 22 at 10:24 PM\nReally Amazing\n\nThe Developers are always responsive and is amazing\n\nHelpful | 8", "cbain75Dec 16 at 2:32 PM\npretty fun\n\nthis is a fun experience but only if there is good stuff playing, but thankfully the new cinema mode is coming out today that lets you watch a bunch of cool movies. Overall it's good for free 9/10 but if it were to cost money, it wouldn't be worth it.\n\nHelpful | 6", "andri.b.jonssonDec 26 at 6:52 PM\nCan't even dowload the thing\n\nIt just says \"Purchased\" it's blue it light up when I hover my cursor over it and then when I click, nothing... There is not dowload button other than the \"Purchased\" button and clicking on it doesn't do anything\n\nHelpful | 3", "binkleymanDec 25 at 5:26 PM\n\nI give this a 3 because you cant watch movies that you have downloaded in the headset i would pay for that feature if i could watch movies that i download on to my headset\n\nHelpful | 3", "ToniCosnerFeb 21 at 5:18 PM\ndoes not work anymore..\n\nupdated, now it won't work on desktop with my quest...\n\nHelpful | 0\nDeveloper ResponseMar 27 at 7:48 PM\n\nPlease email us at support@bigscreenvr.com so that we can investigate the issue you're experiencing!", "noteasyearlDec 27 at 2:32 PM\nHas Some Streaming Issues\n\nHas some Streaming Isuues is more of a chat room . If you're there for films there are better options . Should be called cinema chat or something more apt .\n\nHelpful | 4", "thecobra666Dec 21 at 5:01 PM\nJoin lobby bug\n\nAfter the update it looks a better and works better, just missing an Quit/exit app button and would like to select videos from local storage\n\nHelpful | 1", "GuentherTheGeekDec 22 at 9:47 PM\nKeeps getting better\n\nIve been using this app since I started on vr. I love watching movies or shows with friends. Now I can watch stuff even better and even see movies and feels like Im at the movies.\n\nHelpful | 5", "aleale85Dec 22 at 4:34 PM\nDisappointed\n\nThe idea of an app allowing you to watch movies with distant friends was great. But you tried to turn it into yet another streaming service.\n\nHelpful | 9", "ODAWG_204Jan 18 at 1:10 PM\nIt froze my quest\n\nI cant do anything right now, not even turn it off. What the hell is happening\n\nHelpful | 3", "YourBoyVegaJan 18 at 9:17 AM\nOverall Amazing\n\nIt is a great application with many features and a very nice user interface.\n\nHelpful | 1", "codename_decadeJan 11 at 10:03 AM\nDoesnt work\n\nI try to do the steps for it to work but it says that it wont connect\n\nHelpful | 4", "mechwarrior1Jan 1 at 9:49 PM\nThe future is here!\n\nIncredible movie theater experience in your living room. Lots of free content to choose from. You can also join other people's hosted rooms.\n\nHelpful | 1", "l_6h0st3r_lDec 28 at 7:45 AM\n\nWhat the hell how do I stream vids without a computer\n\nHelpful | 9\nDeveloper ResponseMar 27 at 7:28 PM\n\nUnfortunately, Bigscreen does not have such a feature. You will need to use a computer to stream content to our rooms. We hope to work on such a feature in the future.", "redoctaneJan 2 at 6:40 PM\nNothing\n\nI want to give it five stars and say it's amazing but... It won't even download\n\nHelpful | 3", "sbquestJan 18 at 5:34 PM\nUseless instructions\n\nUseless instructions\n\nHelpful | 3", "corker2000Dec 17 at 10:31 PM\nBig screen cinema download\n\nUninstall big screen beta and reinstall big screen beta and cinema will install automatically....\n\nHelpful | 7", "khoilangDec 21 at 8:10 PM\nIts nice\n\nBut id be better if they paired up with a studio and instead let use pay for real movie tickets. Not some movie from1992 thay we've seen for 3.99\n\nHelpful | 5", "psully4114Dec 19 at 4:22 AM\nIts good. I like it a lot.\n\nMy only gripe is how frequently it logs me off and there is no keep me logged in or option to remember my name and password.\n\nHelpful | 4", "Oliverek13.10Jan 4 at 2:06 AM\nHow good\n\nAmazing\n\nHelpful | 6", "simonh1970Oct 20 at 6:08 PM\nPC support isnt for quest\n\nWanted to use pc streaming but after downloading the pc part it says use a different headset than the quest...\n\nHelpful | 9", "StsharkkeOct 26 at 5:01 PM\nOculus Quest - huge potiential BS to use\n\nBS to operate....I've been working for hours to get connected to a laptop, get files uploaded, find access with another app (better viewing screens) to view movies, like Bigscreen, but that has been completely frustrating and unsuccessful...to the point I am now wasting time writing a review about it...Quest is my first VR device to own but I've been tech connected since we were writing FORTRAN...this feels like it was rushed and not thought out for compatibility issues...it is an amazing powerful device and the potential I see is boundless...but this introduction has not been encouraging...it is my career to trouble shoot things of this nature so I will prevail short of writing my own platforms!!! I am also a little discouraged by the amount of accessible content for Quest...I know it has been released for connection to a GPC but then it may as well be a rift-s and then for that matter other manufactures, for more cost, produce top end gear....anyway...rant over...back to troubleshooting...where oh where oh frickin' where is the remote desk mode!!????\n\nHelpful | 6", "MightyQbertDec 16 at 5:13 PM\nVery impressed\n\nVery fun game and they respond to your questions and emails very quickly if you need help with something!\n\nHelpful | 4", "Aaronb3434Dec 3 at 9:49 PM\nGreat\n\nLove it! can users b able to upload video soon and select the lobby as a home environment? here's some suggestions, add a drive in cinema, IMAX and fancy cinema.\n\nHelpful | 4", "BrandnDec 24 at 4:04 PM\nEpic\n\nCant wait to watch a movie in big screen cinema\n\nHelpful | 4", "BuffyverseOct 24 at 1:28 PM\nUse it daily!\n\nI absolutely love this app! Never had any problems using it. I have made many friends and have had tons of laughs. Love how I feel like Im in a real movie theatre with friends. Also, I have the option to mute others if Im extremely interested in the movie!\n\nHelpful | 9", "lucas.king.353Dec 23 at 8:42 PM\n\nmm\n\nHelpful | 4", "oceanhiSep 1, 2019 at 7:54 AM\nKinda ruins bigdcreen\n\nEverything in the app is great. I love the features, the ability to stream movies from your computer to your vr. Being able to watch, and talk with friends or make new ones. The whole point of big screen is to watch movies, but all of the movies are super glitchy, the graphics suck, and the sound is the same way. You can't watch anything normally. I've ask other people in the game about this and they said it's not like that for them because they are not using quest. That kinda ruins bigscreen. It kinda takes away the whole point of using the app.\n\nHelpful | 8", "doinyamom989Oct 21 at 7:51 PM\nMovies\n\nI have seen so many movies for free with this app since people stream good stuff all the time, instead of going to the theatres why not just wait a couple of months until people are streaming the movie for free.\n\nHelpful | 11", "NotLilDvrkieDec 25 at 4:58 AM\nYeah\n\nF.Reality podcast\n\nHelpful | 3", "JackmcmacOct 17 at 9:11 AM\nPlease fix it\n\nOk, so honestly this doesn't work for me. Each time I try to play a movie from my desktop I just get black screen in VR. Would love this to get fixed though as the concept is great and so to help out I'll give it a 5 star\n\nHelpful | 8", "IeatwaspeggsNov 14 at 4:33 AM\nXbox support?\n\nPleaaase be the first devs on quest to do this. Im tryna play games in vr\n\nHelpful | 4", "steve-01351Sep 19, 2019 at 4:31 AM\nTHAT's a hell of a note.\n\nFollowing the directions given by Bigscreen Beta in the Quest, I try and run it on Steam and get told my system doesn't meet the minimum requirements. I try and download it from the Oculus store and there's no download link. It really doesn't seem like trying to share my movies with others should be this frustrating.\n\nHelpful | 16\nDeveloper ResponseMar 27 at 7:38 PM\n\nSorry for the frustrating experience. Email us at support@bigscreenvr.com for help or check out this step-by-step guide on how to run Remote Desktop mode: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "69AsparagusNov 28 at 12:55 PM\nGood\n\nI like it\n\nHelpful | 3", "glenkisselNov 14 at 7:02 PM\nThere is no link to download\n\nThere is no link to download like the app says there is in the oculus store. I'm not going to download Steam just to use this stupid app.\n\nHelpful | 4\nDeveloper ResponseMar 27 at 8:03 PM\n\nBigscreen is available in the Oculus Store. You should be able to download the app like you do with any other VR app in the Oculus Store. Email us at support@bigscreenvr.com for further assistance.", "MistaCrookOct 31 at 7:31 AM\nBig Screen\n\nReally like this idea & how much u can connect with people I'm new to the vr experience & this let me know I made the right decision\n\nHelpful | 4", "FatGuysWeinerJul 11, 2019 at 9:48 AM\nNeeds Improvement\n\nI see the potential here. I have an amazing internet connection. 1 gig down, and 70mb up. I'm a hosting BEAST. I have a huge 3d movie library, and an even bigger 2d movie library. That's why it's an absolute travesty that I can't host to more than 2 other people. The lobby counts my CPU as 1 person, me as another, and so for the max people available in ANY of the theaters (4) that leaves room for only 2 others. Great for those other 2 people, but everyone else is out of luck. This needs to be addressed as soon as possible. The second thing that I can't stand, is the glowing avatars in a dark theater. This also includes my own avatar. This is very distracting. There should definitely be a setting for this. There needs to be a way to turn the glow of avatars all the way off, or at least way down. I also think that the inferface needs a few major tweaks. I shouldn't have to leave my headset to open, close, play, pause, etc. files on my desktop. And also, one of the controllers should be able to handle everything. All of these things, make hosting, and setting up a movie a very frustrating experience, to the point that I have just stopped using this AP. Also, a bigger variety of environments needs to happen at some point, but the previously mentioned issues definitely need to be addressed first. Thanks for all your hard work on this port, so far to the development team, but you all still have a ways to go before this is a useable AP IMO.\n\nHelpful | 98", "berlintapesAug 31, 2019 at 9:13 PM\nBest social experience on Quest\n\nI didnt expect to love Big Screen as much as I have; it has become my go to social space. Other social apps try to do too much or are over run by children and crazies; Big Screen has a (generally) more mature and thoughtful population. If you want a space to meet people, share media and ideas, and most importantly be able to have good chats, check this app out.\n\nHelpful | 9", "conlieNov 25 at 12:44 PM\n\nI can't log into my account at all...\n\nHelpful | 3\nDeveloper ResponseMar 27 at 9:27 PM\n\nEmail us at support@bigscreenvr.com if you're still having trouble logging on to your account.", "jerseyhurricane7Sep 22, 2019 at 12:33 AM\nOne of my most used apps..\n\nThis is one of those games that does social interaction almost flawless. Most of my Oculus time gets spent in the social rooms watching a movie (sometimes in 3D) or having a pleasant conversation with other Oculus users.\nI want to get a PC so I can watch Netflix or Hulu in some of the best environments on vr\n\nHelpful | 3", "StuBroSep 6, 2019 at 2:26 AM\nShould be banned\n\nWould be good, except for one unacceptable flaw: it can totally bypass your volume setting. Sat in a quiet office, I was just going in to check out what films were on with the volume totally off to not disturb anyone, and somehow, the audio (both other peoples mics and audio stream of the movie) played at full volume. Simply unacceptable on a curated storefront, should not be allowed through with such a flaw. If I'm on my computer and turn the speaker knob to off I don't expect to hear any audio at all, why is it allowed with Quest?\n\nHelpful | 17", "SW4RDOct 29 at 9:14 PM\nI hope this will be more bigger\n\nIt's really good, I'm impressed, too bad that it is not better known and big\n\nHelpful | 1", "RobyPAOct 27 at 7:57 AM\nGreat APP\n\nGreat APP, met a lot of people from different countries but it keeps crashing on me is anyone having this problem?\n\nHelpful | 1", "WaywardAutarchAug 13, 2019 at 3:06 AM\nVoice chat audio needs work.\n\nI love it. It's fun. And I'm excited about what they have planned. Had enjoyable evening watching Pluto TV hosted Paranormal Activity 3 with a bunch of strangers. The voice audio really needs work. The whole having to press B every time I talk is annoying. There's also sometimes a latency between users, which can spoil a scary scene. I prefer how voice audio is done in Rec Room, where as you get closer to people you start hearing them talk like in reality. I think the randomize button on Avatars needs to be smaller, it's to easy to mistakenly press it and mess up the avatar. The moving around is annoying, it doesn't seem to work every time. In Rec Room you can teleport but I have mine set up to just walk around. I hope the arcade in the lobby eventually has playable games.\n\nHelpful | 6", "thegabeSep 15, 2019 at 7:18 AM\nGreat app\n\nI enjoy this app, I didn't use it much for now, I mostly play on the Quest. I tried launching a desktrop stream, it worked well, but I am waiting for a video player.\n\nPros:\n- looks great,\n- does what it has too\n\nCons:\n- missing video player feature\n\n9/10\n\nHelpful | 3", "jmalmstenSep 7, 2019 at 1:24 AM\nGiant empty rooms full of ads...\n\nI see most rooms have 5-10 users, I connect and it's completely empty.\n\nThe streams that are available are neat in thought, but the constant repeterive and frankly bizzarly condensending ads makes me just want to move somewhere else.\n\nAlso, there is some feature called \"video\". Is that an ability to look at my own content on a giant screen?\n\nAll in all, it feels like it has a huge potential for social vr. But if there is noone there no matter what the menu indicates then the giant spaces just makes it feel like empty dead ghost-towns.\n\n- Update -\nJust a thought:\nThe streamed movies are pretty much impossible to predict. There is no indication in the menus or in the rooms about what Is showing. Just maybe a vague genre. Heres a wild thought. Maybe use the big dead space of the lobby to be like... A Lobby? So that even if it's empty of users we can see ongoing and upcoming movies and shows, and when they start?\n\nAlso, why put the action film genre in a living room??\n\nAnd the 3D movie nights, when are they? Is there a website with these listings somewhere? And if there is, Why not put it inside the app?\n\nAgain huge potential here, but stuff just feel oddly left out for no good reason.\n\nAnd the ads. Holy crap. Those ads. I thought Verhoeven was joking in his films. But no. Wow. Those ads scare me if they honestly expect people to buy what they're selling...\n\nHelpful | 7", "jose.aguilar.444.444Sep 12, 2019 at 8:23 PM\nGreat way to meet friends\n\nThis is a great place for great people and Im glad this has a large community and I just wish to meet this people in real life because they seem happy to meet others so thank you to the community for making this an enjoyable experience\n\nHelpful | 3", "magicmurphieSep 7, 2019 at 7:05 AM\nPlease add mobile play\n\nI want to be able to play using my phone I bought the quest to not have to use a computer and then I saw this game thought that might be fun but no one has a computer so most of the time I just am able to talk to people. Please add a feature so mobile players can watch YouTube without having to join random lobbys hoping some one has a computer to watch YouTube\n\nHelpful | 2", "0alfred0Aug 21, 2019 at 9:07 AM\nChange Environment of my own room?\n\nHey,\nI like this app and it has a lot of potential but is it possible to change the environment of my own room? I am watching Dota 2 TI9 and I can change the room in the main menu. When I start watching Dota 2 it loads back up the standard room which, for my taste, is a little far away.\n\nHelpful | 0", "glenbolton22Oct 2 at 8:24 PM\nController problem\n\nWhen I am in bigscreen I can not minimize the dashboard, I click the minimize button and nothing happens, even pushing the left button that used to make it disappear does nothing now, can this be fixed??\n\nHelpful | 1", "KenosaJul 21, 2019 at 5:41 AM\nUpdate Changes the Game\n\nI've been a long time user since the first release a few years back. Since then many things have changed, facelifts, minor improvements, etc. This latest update brings improvements that welcome the rest of the VR world with open arms. With server based public rooms that don't solely rely on the content from a desktop. Huge events are now possible similar to Oculus Venues. Tons of new people have come in now and I've made some great friends. I'm also very eagerly anticipating the announced party system to make it way easier to join friends in a private room. Love the app, love the devs, great job guys.\n\nHelpful | 6", "WhyKlefMay 21, 2019 at 5:39 PM\nThey'll fix it, they always have.\n\nAs of the writing of this review, there are some launch glitches but I'll 5-star it regardless because I've used this app for so long (and for free even) it just is a given at this point that this will be fixed, the devs behind this app are so reliable. So don't let this app become dormant, it's a rich experience, especially if you have friends with VR. I couldn't describe this app better than by saying that this is like going to your friend's house, in the comfort of your living room. It's absolutely surreal.\n\nHelpful | 445", "mylescoxJul 25, 2019 at 12:16 PM\nRevolutionary.\n\nBigscreen has been a staple of my VR experience for a few years now and its quite incredible how much the devs care about the app/listen to feedback. Bigscreen is a godsend for someone like me who is in a long distance relationship, and each update just keeps getting better and better. For a free product, this is a no-brainer. Essential for anyone using VR.\n\nExcited for the ability to control my streamed desktop via the Quest! Keep crushing it folks.\n\nHelpful | 4", "akdenizsinanOct 17 at 4:30 PM\nThere is NO EXiT\n\nAfter watching movie or something I want to exit fro app BUT NO BUTTON\n\nHelpful | 3", "mewaters1Jul 21, 2019 at 6:11 AM\nKeeps getting better!\n\nLove BigScreen and with the new updates, it's even better! Great way to watch movies and the ability to \"mute all\" helps a lot, if you just want to watch, not chat. They've added a bunch of events and a better way to find the events, new rooms, and just better overall functionality. Once they add the ability to stream from a Mac, it will be perfect!\n\nHelpful | 3", "CreepConnorSep 10, 2019 at 8:32 AM\nWould be good, but\n\nAm I the only one experiencing this lag? It is so laggy and the resolution is terrible. Movies and shows are unwatchable and the controls suck at times. Fix these issues and its 5 stars.\n\nHelpful | 3", "z_c00lJul 7, 2019 at 8:38 PM\nBest place for social VR\n\nProbably the best place to hang out in VR. I never fail to always drop by to check out what movies are streaming. Popping in n out each room. I tried sharing screen but it lags pretty bad even with 100mbps line. Not sure why. Next update I would suggest to allow user to select screen to share....since I have 2 monitors. I would only wanna share the extended monitor while continue working on my main monitor.\n\nHelpful | 2", "PotatoAim2TheMaxSep 27, 2019 at 11:56 PM\nSpeaker not working?\n\nHaving trouble with speaker, nobody can seem to hear me while pressing B for speaker. Am I missin something?\n\nHelpful | 0\nDeveloper ResponseMar 27 at 9:31 PM\n\nYou should be able to use push-to-talk or mute/unmute your mic from Settings > Audio. Email us at support@bigscreenvr.com if you're still having trouble with your mic!", "potatocyhJul 21, 2019 at 11:06 PM\nBad for quest\n\nLow resNot alot of players and so much lag . The controls suck two. Movies are low resolution or frozen or you lag.\nYou can draw in this game but the tools suck and tool get stuck on your character s hand. Audio sucks and the list goes on.\n\nHelpful | 10", "RequiemieroJul 20, 2019 at 4:15 PM\nLoving the TV update, but needs a guide\n\nLike regular TV, if you could add a channel guide that explains what is playing at what time that would be amazing. As it is right now, I just pop into a channel without having any idea what is on the screen and I end up starting from the middle of a scene.\n\nHelpful | 4", "morrismossJul 31, 2019 at 3:44 PM\nWorth getting\n\nI decided to get this because I wanted more social apps and this seemed like the right one to get. Account set up is very easy and quick. When I got in to a game I was about 10 ft tall, but I think that that was a one in a million glitch. Over all is was a really good app apart from some bugs. Their 3D trailer section is worth going to because this one actually comes out of the screen unlike when its at the movies. Its free which is a plus for me. If you like movies and being social this is the app for you.\n\nHelpful | 2", "rionoirbleAug 16, 2019 at 2:42 PM\nNice improvements\n\nI dont use this app a lot but I give them credit for the improvements theyve made if youre looking for something similar to this.\n\nHelpful | 0", "trypnosJul 17, 2019 at 3:50 AM\nLove the update\n\nI thoroughly enjoy this experience. I love the variety of settings where I can watch movies and TV programmes. I am quite happy just to sit in different rooms even without any entertainment because the settings are so realistic and for me at least very calming. At the moment my only criticism is the fact that I cant access Sky News, at least not in my country which is the UK. This may be a teething issue which will be sorted soon?\n\nHelpful | 2", "EpicPinkCreeperJul 14, 2019 at 7:02 AM\n\nI like this but I think it would be great if we could do stuff like pause and unpause from within the headset. Also, it would be amazing if there was an app for a phone or tablet to stream from that like on the pc. Otherwise, this app is great especially for being free.\n\nHelpful | 1", "shannajo03Jul 20, 2019 at 10:47 PM\nAwesome!\n\nI love the format - watching movies in a theater without having to leave home. The visuals are great, there are lots of options for watching, and get to meet people with similar interests. Only drawback I encountered was that I couldnt friend the people I met to hang out with in the future (at least not that we could find). Thats the only improvement I could think of.\n\nHelpful | 4", "myshipmyrulesMay 25, 2019 at 4:01 PM\nCould use a mute all function\n\nI love the idea of having the option to interact with others, but sometimes I just want to sit and watch the movie without having people come in and talking to the entire room, unprompted. Would be great to have the ability to disable all incoming mic input so that Im only hearing the movie (without having to individually go through watch user and turning off their sound)\n\nHelpful | 21\nDeveloper ResponseMar 27 at 9:34 PM\n\nWe have a \"Mute All\" function! It is on the top right corner of the Social List.", "SnacksOKJul 26, 2019 at 9:48 PM\nAwesome, Fun, and Social\n\nThe newest update is amazing. There are dedicated rooms for movies, concerts and tv now, and 3D movie nights comings soon. It's fun to chat with people about what you're watching.\n\nHelpful | 1", "ervwalz6Sep 15, 2019 at 1:09 AM\nCant stream\n\nI cant stream at all\n\nHelpful | 2\nDeveloper ResponseMar 27 at 8:08 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "meishtifiedJul 17, 2019 at 8:07 AM\nA must have app\n\nI love this app! The new update is right up my street I really like it , I really feel like Im in that room chillin with my wee rumba vacuum,the new addition of the live channels & the 3D trailers is awesome they are actually 3D & not just depth like at the cinema \nI cannot wait until the paid 3D movie events start . There will be nothing like chilling like a villain in my quest with my munchies on my comfy sofa rather than my butt going numb on a cinema seat\nTop marks from me \n\nHelpful | 3", "jake7082Jul 13, 2019 at 4:02 PM\nbad\n\nI just got my oculus quest and this was one of the games I was looking forward too. I can go watch movies and stuff but I want to have a room to myself but you can't control the tv. so I assume that if I linked my laptop to the game I would be able to do that, but I have a MacBook Pro so I can't do that so I tried using my main desktop which Is windows but that didn't work either. this Is a 1 star review until you fix these problems\n\nHelpful | 4\nDeveloper ResponseMar 27 at 8:45 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "DontDropTheJuiceAug 29, 2019 at 5:52 AM\nIts free try it out!\n\nGreat place to hang with some friends, or make friends!\n\nHelpful | 4", "darwins.lastJul 15, 2019 at 9:25 AM\nFrom Good to Great\n\nWith the most recent update where you can watch TV with groups and friends, Bigscreen has drifted into the \"must have\" zone for me. Cant wait for 3d and premium movies to be there to watch with friends. Great job to the devs. Keeps getting better.\n\nHelpful | 6", "Brittato_Jul 12, 2019 at 5:07 AM\nI wish it were better...\n\nI would enjoy it more if I could actually go into a lobby and watch a movie without it freezing the picture as soon as I arrive (Having a steady 5GHz connection means nothing I guess). I can hear audio at least. But where is the fun in it if thats all I can experience? Its rendered useless for me other than going on to go chat with random people in the main lobby. Not to mention I cant even host a lobby of my own because I have windows 8.1, and it requires windows 10 (no point upgrading just for that). Major bummer because I really wanted to find some kind of enjoyment out of it somehow. \n\nHelpful | 2", "CAMasonMay 21, 2019 at 1:23 PM\nA bit buggy on Quest currently\n\nCompared to the Desktop version, this release has a few issues; It crashes quite frequently, particularly when trying to cast. There's a problem with audio feedback loops that results in screeching. Positional audio seems disabled. Audio levels of the screens are too low. But, a lot of promise! Looking forward to playing once these niggles are ironed out \n\nHelpful | 22", "rattleheadxyzJul 12, 2019 at 2:44 PM\nAfter the TV Update, Its Pretty Great!\n\nThis app used to be borderline unusable, but after the new TV update, everything works great! Video quality is usually great and the variety of options is greatly expanded now. Good stuff!\n\nHelpful | 1", "KMacPrimeJul 18, 2019 at 7:01 PM\n\nFirst off let me say I LOVE Bigscreen, it vision and the potential the platform brings. The new update with Bigscreen TV is incredible. It truly is the future and Ionia it will only get better. My low score is due to the lack of oversight. Not long after the last update they have been a few rooms promoting hate and conspiracy theories. And to make things worse, they are no age filters to keep young kids from this.\n\nI looks forward to the official movies but o cant see too many studios will to offer their movies to a platform that doesnt moderate to some extent.\n\nIts disappointing that already the filth of reality is planting seeds in VR but I guess its inevitable. Smh\n\nHelpful | 1", "DrCheeseHeadJul 24, 2019 at 4:15 PM\nFun and easy to use\n\nIt was nice meeting people and using the app. I had trouble moving, and some nice people in the room showed me how. It's fun! I just wanted to hang out there. Can't believe it's only beta!!\n\nHelpful | 2", "DJEmergencyJul 7, 2019 at 10:08 AM\nGreat app, but..\n\nThis app is really great, but it needs to be optimized better for the Quest.. I have posted in Discord about the issues I had and it seems like the developers don't even acknowledge the bug report. The controls aren't configured for the Quest properly. When trying to do a thumbs up it sometimes locks my hands in a fist and it's difficult to get out of it. I would suggest to make it more natural by using the touch input instead of pushing the trigger down..\n\nHelpful | 4", "abdullah2001ABTAug 25, 2019 at 4:41 AM\n\ncan we watch videos that are installed on the headset internal storage\n\nHelpful | 1", "leemichael13Jun 27, 2019 at 6:40 PM\nInfinitely good value for (no) money!!!\n\nWhenever the offer of something for nothing comes along in this capitalist euphoria of ours it doesn't exactly inspire us with enthusiastic expectation for said product. Even when its quality is seemingly apparent and full of promise it is hard to find any belief that its anything other than a microtransaction filled pile of rubbish. With this in mind I am so pleased to say that 'Bigscreen' is a rare exception to this rule. Without a single  or $ anywhere in sight this app is a real pleasure. It almost does everything right already, which is praise indeed considering its still only in beta. I think I speak for the entire community when I say that I appreciate the efforts and ethics involved in this excellent app.\n\nHelpful | 3", "WeebiBoiSep 1, 2019 at 6:28 AM\nHow do you actually host?\n\nI cant host because my oculus account nor my steam account will allow me to stream my desktop to the screens\n\nHelpful | 0\nDeveloper ResponseMar 27 at 8:42 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "XxPriMa_NoCtAxXJul 14, 2019 at 11:20 PM\nNew update\n\nI was about to delete this app but the new update charged everything, 50 plus free tv channels\n\nHelpful | 3", "aporwal01Sep 18, 2019 at 1:36 AM\nAbc\n\nAddgcfg\n\nHelpful | 3", "obi2kenobiJul 20, 2019 at 8:44 AM\nHow did they swing all the free channels\n\nI mean there are some legit channels in here. I will probably never have the need to watch TV in VR but if that's your thing this is definitely the best app for it.\n\nHelpful | 2", "JustosJun 21, 2019 at 6:02 AM\nAwesome, but flawed\n\nPlease fix casting from a device with interegrated graphics. I have a surface pro and can't cast on it even connected to ethernet. But my iMac over wifi does a better job. I have 150mb/s and it just can't keep up on the surface.\n\nHelpful | 1", "snazzyxpJun 20, 2019 at 5:08 PM\nGreat game!\n\nI love having the ability to join rooms and watch fun movies and shows with people all around the world. I havent had any bad experiences with people being mean or anything like that. I like how I can connect my computer to this and watch shows in a theatre whenever I want. Great game!\n\nHelpful | 3", "Ashman_RGBMay 27, 2019 at 3:07 AM\nPotential to be great - very buggy\n\nThis is an awesome idea in concept. A few nights ago I spent time watching some movies and chatting to people. Tonight I tried streaming content, it worked intermittently with the server constantly crashing. The app also closed down several times, taking me back to the oculus home screen. The most frustrating experience as my movies were streaming, but what ever I do - I had to re log back in about twice times every 3-4 minutes as the server kept failing. After entering my email and password for the 50th time I gave up. I hope theres an alternative to a much better, stable app - or, that the developers find a way to stabilise the Quest version of Bigscreen.\n\nAdditional notes: there is a bug in which the voice chat does not work, even though it displays as working. This might have presented itself after using a headset, and then removing it. The only fix I found was to uninstall the app and power off the headset, booting back up the issue was resolved. Another slight downside is you cant stream any purchased movies via iTunes - only the sound is streamed with the image remaining black. Your best bet is then using a streaming service.\n\nHelpful | 19", "IstopMay 26, 2019 at 9:39 PM\nInfinite loading screen\n\nIt does not work on my oculus quest, after launch the app all I see is a loading small panel in the lobby. I made sure I connected to the internet and I can play all others games. Netflix and YouTube. I can also buy other apps or games. I also tried to restart my headset more than once, still on the loading screen.\n\nUpdate: I found a fix to this problem by factory reset the oculus quest. Hope this helps\n\nHelpful | 4", "RocketshipDudeJun 4, 2019 at 1:14 AM\nAlmost perfect\n\nSkybox is better because i can load videos from internal storage. I watched Dredd 3D alone and I wish I could have invites friends.\n\nBigscreen is better because i could invite friends if I wanted but alas I can't load videos from internal storage. Once this is implemented (hopefully soon) I won't have a need for sky box.\n\nHelpful | 1", "SorCarstenJun 14, 2019 at 6:00 AM\nVery promising!\n\nThe concept is amazing, and once the kinks (its beta and yes, glitchy) have been ironed out it has the potential of being a killer app. Looking so much forward to the exclusive movie nights and everything else planned for the future.\n\nHelpful | 1", "SquidFurBrainsAug 10, 2019 at 4:41 PM\nIdk\n\nIts not done downloading it yet\n\nHelpful | 1", "RegentLawyer443May 26, 2019 at 8:09 AM\n\nbig screen is probably a pretty nice chap in my opinion the keyboards kind of touchy so be careful when you're entering your first email or password but for the most part it's still fron you I use steam to connect my computer to it and it works pretty well I think they should probably work on putting in a feature where the hands can control the computer and you can't because I've always had to use the keyboard on the actual computer but for the most part it's pretty good\n\nHelpful | 2", "gogo123456Jun 8, 2019 at 2:54 AM\nForced option.\n\nThe app itself is pretty cool .I dont like the fact that I couldnt enter it without excepting some terms and conditions that seemed a bit intrusive.. they literally wouldnt let you go past without a pop-up telling you you need to basically except permissions to invade your headset. Im sure there are some logistical reasons as to why ...but they should be right there! for me to understand...its creepy. so you get one star.\n\nHelpful | 6", "catfish78Jul 14, 2019 at 10:53 PM\nlove it\n\nI can go to cinima in my room \n\nHelpful | 3", "DGZzzJun 14, 2019 at 4:27 PM\nWheres Mac?\n\nThis game is pretty good but sometimes I just want to see my computer but I cant stream it because its Mac I hope theyll change it, but after all its a pretty good game.\n\nHelpful | 3", "HybridAlienJul 20, 2019 at 8:04 PM\nAmazing !\n\nWhat a amazing experience. Looking forward for upcoming updates and films. Get this now !!\n\nHelpful | 3", "adamjimenezukJun 6, 2019 at 7:15 AM\nKiller app\n\nIt's worth getting a quest just for this. Great for watching movies, playing games and hanging out with friendly people in VR.\nI'm looking forward to the planned update which will add some nice conveniences like a local media player and mouse support.\n\nHelpful | 9", "KipzyKipzJun 22, 2019 at 1:27 PM\nGreat.\n\nI've enjoyed this game so far. There are no issues so far and I am amazingly happy they made this. I would watch twitch and other things on my desktop to VR. Thanks for making bigscreen!\n\nHelpful | 2", "dugelasMay 24, 2019 at 3:58 PM\nStuck loading\n\nApp starts, on the red carpet and the menu stays spinning/loading. Ive logged in and out multiple times, un-installed, restarted Quest, and just say there for a good while...still nothing. Severely disappointing as this was one of the main apps I was looking forward to.\n\nHelpful | 10\nDeveloper ResponseMar 27 at 9:21 PM\n\nEmail us at support@bigscreenvr.com if you're still having issues loading into Bigscreen!", "YnGBL00DJul 14, 2019 at 6:12 PM\nUpdate\n\nI want to change this to 5 stars asap but I only downloaded because of the update but multiple channels don't work.\n\nHelpful | 2", "HAIRYMAN-13Jun 2, 2019 at 6:01 AM\noverheating\n\nAs i love the idea of watching movies in the virtual theatre i downloaded this for the Go... and it overheats insanely fast to almost a boiling point and the other day from a full charge in about 30 mins the battery was at 48 percent left and i had a\nTEMP warning come up on my screen and im pretty sure it might have damaged my battery somehow as now i get maybe a hour if i make it that far and now my fav app\nim to scared to use so for my new quest i will NOT BE INSTALLING ( )\ndevs ..?\n\nHelpful | 3\nDeveloper ResponseMar 27 at 9:15 PM\n\nThe Go is known to overheat due to its hardware. With the Quest, you should have a better experience. Please try it out before giving us a review on Quest.", "darkkobraMay 25, 2019 at 10:52 PM\nIts great app\n\nHavent installed in my quest yet but i use it on my vive everyday. Even if its glitchy or buggy on the quest it dosent take them long to tackle the issues. I like the previous version better just because i could just hide the keyboard without bringing up the other menus and i could take the headset off without bigscreen popping up. Even with that i still use it all the time\n\nHelpful | 1", "hookbeakMay 24, 2019 at 6:21 AM\nJust stuck on loading...\n\nThe app starts ok, i'm stood outside of a large cinema - but...that's it.\n\nA screen with \"loading\" on it is in front of me but that's all this does, literally nothing. I've reset my quest, and uninstalled and reinstalled the app a couple of times - but nope, it just doesn't work.\n\nHelpful | 6\nDeveloper ResponseMar 27 at 9:00 PM\n\nEmail us at support@bigscreenvr.com if you're still having issues loading into Bigscreen!", "RonnieFoxxxMay 23, 2019 at 11:03 PM\nGreat if you aren't doing the streaming.\n\nThis app is good. It's really good on the Quest. The remote server for your desktop? It doesn't work. Whenever I open the app on my PC to stream to BigScreen, it pays my computer so badly it's hardly even usable. A click can take 10 seconds to register.\n\nHelpful | 1", "Jd-Gamer65Sep 21, 2019 at 3:04 PM\nIts Great buttt\n\nI cant control my pc from my headset. Soo, basically you lied. I would give 5 stars if they fixed this issue on oculus rift, quest, go, and gear vr\n\nHelpful | 0", "LinopolisJul 5, 2019 at 12:22 PM\nNice while it worked..\n\nHaven't had any issues at all until the latest update I downloaded today, now it freezes as soon as it launches and I need to restart my headset, very annoying.\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:19 PM\n\nEmail us at support@bigscreenvr.com if you're still experiencing issues loading into Bigscreen!", "kbrowning555May 24, 2019 at 2:51 PM\n\nI got the oculus quest on Tuesday at Best Buy and when I joined a freinds room at tried to watch a movie the movie was glitchy to the point that j couldnt even see what was happening and I couldnt hear any noise\n\nHelpful | 8", "Capta1nHuxMay 23, 2019 at 2:46 PM\nLiterally a big screen, and it's cool!\n\nI had some launch issues which I found out required a factory reset but after that I was finally able to load the magic of this app. Requires a decent internet connection and a decent PC to stream from other than that it's pretty good\n\nHelpful | 1", "kuno1chiJun 2, 2019 at 10:54 AM\nScreen went gray after awhile\n\nLove the idea of this, and for the most part, it is working for me as a viewer. Of course, there can be many improvements made, but would rather have the bugs fixed first. One thing I noticed is that after maybe 45 mins of watching (and wearing the headset for over an hour), my whole view/screen turns into a huge block of gray. Changing my perspective does not work, although I still hear audio. I'm forced to quit the app (via Oculus home button) and restart the app. The heat issue is also a concern, but not sure of it's caused by this app or the quest itself. Another gripe I have is that it does not pick up where I left off once I take off the headset and eat a quick snack (3 ~ 5 mins); once I put it back on, I'm back in the lobby, and have to search for that room again. Lastly, there have been a couple of times when it suddenly quits on me and returns me to the lobby (again, a notice/descriptive error would be helpful so at least I know what just happened - is it my end or the host's or just the app itself?). Also, this may be out of the devs' control, but some streams are just too pixelated - and I avoid the 3D ones because they're just not that great to watch. Despite all these, this app has so much potential, and quite frankly, I prefer it over the other social apps. I'm sure the devs will continue to fix and improve bigscreen - and will then be deserving of a 5-star rating!\n\nHelpful | 4", "JujuPatinaJun 27, 2019 at 7:23 AM\nLoading forever\n\nThis review is for the O Q only = This beta version is useless. Loading in  60% code 117 forever . Maybe it will work one day in the future. For now it is just there .... Loading...\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:02 PM\n\nEmail us at support@bigscreenvr.com if you're still experiencing issues loading into Bigscreen!", "RynorakMay 26, 2019 at 10:39 AM\nGreat on the Go\n\nI love this app but unfortunately for me, it's not quite there yet for the Quest. I haven't been able to view anything and a few times I've not even been able to move around. I know it's beta still and the quest is new so I'm sure the Dev team are on it.\n\nHelpful | 4", "dragonlord18089Jun 9, 2019 at 6:02 AM\nwill not load\n\nI've been trying to play now for a few days and it stops loading at 55%. i still have over 100gb of memory left so i know it's not do to low memory. until this gets fixed I'm giving it 1 star.\n\nHelpful | 4\nDeveloper ResponseMar 27 at 9:01 PM\n\nEmail us at support@bigscreenvr.com if you're still having issues loading into Bigscreen!", "crisisaliveMay 22, 2019 at 11:12 PM\nBad control schemes and glitches hold it\n\nThe click turning is so bad i got some minor motion sickness, and so far thats twice now, neither one of those was locomotion based.\nThe teleportations also dumb, mostly because the button they chose is not a good choice for something so frequently used. On the glitches side my quest froze twice snd theres a really sharp feedback squeel that was killing my ears the first few minutes, not just me but lobby wide.\n\nHelpful | 2", "t3mr0iMay 20, 2019 at 11:01 AM\nAwesome\n\nOne of the best VR applications\n\nHelpful | 15", "snowdwellerMay 21, 2019 at 11:57 AM\n\nGreat app, even better if we can stream movies from our phone on the big screen... completely mobile.\n\nHelpful | 9", "FireIiteMay 29, 2019 at 7:34 AM\nGood but bugs\n\nThis app is a great experience if you want to meet people or watch a movie for fun. Ive met many different people and had great conversations with them. But, of course, bugs. I know some were fixed in a recent update, and i dont know if they already fixed them but from what Ive played, it just needs some work.\nSometimes, the sound wouldnt work and i had to keep pressing the volume button on my quest and then sound would pop into existence and i could hear everyone and everything and then it would not work and. I had to keep fidgeting with the volume to be able to hear whats going on. Also, when i join a movie/room, the volume would almost always be at max or close to it and i would have to go to the oculus home to turn it down. I cant turn down the volume in game. And crashes, its happened a lot less since the update but every now and then the screen would just go grey. I can still hear everything but it ruins the entire experience of youre watching a movie with friends and then you get a grey screen and have to reload the app.\nBasically, great app. Great people. But bugs\n\nHelpful | 2", "MagicJosh2212May 21, 2019 at 7:54 AM\nBrilliant!\n\nIncredible app! 100% recommended to get and try!\n\nHelpful | 10", "UserC2May 25, 2019 at 4:15 PM\nAwesome app, however very buggy.\n\nIt is a great app, if it worked. Currently, with many people's Quests, the app will launch but when you open the menu it loads indefinitely. This can be fixed if you perform a factory reset. I think if you setup your Quest after today it might work without a reset. If it works then it is a awesome experience.\n\nHelpful | 3", "Peaceful_MindMay 29, 2019 at 6:00 AM\nDifficult to stream good quality movies\n\nNice app, but I thought it can offer a wider degree when browsing your desktop. Also, all movies available by other members are 2d and nothing in VR. The streaming of most movies Inhabe seen was full of bugs. However, nice public place for chitchatting (better than Vtime) and having VR simple brush. I hope to offer free walking mode as an option. Thank you\n\nHelpful | 1", "Barryboi07Jul 3, 2019 at 2:05 PM\nGreat\n\nReally good fun to chill and talk to people a like it\n\nHelpful | 2", "KrazaelMay 27, 2019 at 7:08 AM\nCould be better\n\nThis app looks to have great potential... if I could get it to work. It tells me to link it to my desktop on my computer by downloading the app via steam/oculus page, but when I go to finish connecting my quest, it tells me bigscreen requirements not met and wont let me do anything. So I reall cant use it\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:20 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "ViieMay 25, 2019 at 2:57 PM\nConstant crashes\n\nI Cannot stay in the lobby for more than 10 minutes without it having to crash on me, its a shame because its actually quite a fun app to chill and mess about on. I hope they fix this soon.\n\nHelpful | 1", "jago25_98Jul 7, 2019 at 4:28 AM\n2GB and steam\n\nWould be great if the desktop client was simply available as a .exe from somewhere...\n\nHelpful | 1", "OKCSKYJul 8, 2019 at 1:15 PM\n\nAwesome!\n\nHelpful | 3", "Erik_ElyMay 23, 2019 at 5:48 PM\nSuper Cool!\n\nSocially addicting. Love watching movies with strangers. Its fun and worth the experience.\n\nHelpful | 5", "Silent-KnightMay 29, 2019 at 4:50 PM\n\nIts a blast in here and still looks way good! No real bugs or anything that Ive seen. My only complaint is idk if there is a way to stream from the phone to the app so I can just watch by myself. Still epic\n\nHelpful | 2", "DAX_QcJun 2, 2019 at 5:12 PM\nSuperb free app\n\nIv watch movie of all type since Quest is out. A 5* as soon they fix some crashes and the annoying grey screen bug.\n\nHelpful | 1", "dylan.mcfigginsJun 1, 2019 at 10:06 PM\n\nNow it is a lot of bugs. But it is still in Beta. But It is still vary cool And fun.\n\nHelpful | 1", "albeewJul 13, 2019 at 7:35 AM\n\nWhy no Mac support?\n\nHelpful | 1", "dahgreymanJun 1, 2019 at 7:39 AM\nDoes not work\n\nHello it does not work for me at l, remote viewing or the ability to join other people's rooms, it's super laggy. Skybox connects to my media server just fine\n\nHelpful | 2", "santorofloriano1Jun 9, 2019 at 4:53 AM\n\nGreat App - love it!!! But no Mac-Support? Really?!!!\n\nHelpful | 4", "poetic_is_hereMay 25, 2019 at 7:07 PM\nLatest update caused bugs\n\nPrior to the last update, app was fine. After the update, app constantly crashes in the lobby. I have to force shut down my Quest. 1 star until it is fixed.\n\nHelpful | 4\nDeveloper ResponseMar 27 at 9:11 PM\n\nEmail us at support@bigscreenvr.com if you're still having issues loading into Bigscreen!", "msutrevorMay 21, 2019 at 4:38 PM\nCrashing on the Quest\n\nIve loved Bigscreen for the Go so it was a must on my Quest. Currently though whenever trying to join certain rooms with a large number of people the app will crash completely. Im sure it will get fixed eventually, Ill gladly change my review when it does.\n\nHelpful | 4", "ACE787Jun 10, 2019 at 4:01 PM\nWE NEED A MAC OS PLATEFORM TO STREAM\n\nGood App but we need MAC OS compatibility for remote desktop. So far impossible\n\nHelpful | 2", "sincercowMay 28, 2019 at 4:39 PM\nNeed help plaz\n\nI giving this a three star because it keeps on crashing can you please fix this Im on the oculus quest. Also how do you stream from you pc on the quest to.\n\nHelpful | 2", "TrendfieldJun 15, 2019 at 9:02 AM\nKeep on loading\n\nScreen only keep on showing logging in 55%, nothing can do \n\nHelpful | 2\nDeveloper ResponseMar 27 at 9:03 PM\n\nEmail us at support@bigscreenvr.com if you're still experiencing issues loading into Bigscreen!", "Godislove4uJun 11, 2019 at 12:58 PM\nIt's free but good\n\nIt's very good.God is awesome.Jesus is mankind's sole hope.\n\nHelpful | 2", "Noemis78Jun 4, 2019 at 12:09 PM\nCan't open it\n\nKeeps stuck at 55% ..\n\nHelpful | 8\nDeveloper ResponseMar 27 at 8:59 PM\n\nEmail us at support@bigscreenvr.com if you're still having trouble loading Bigscreen!", "ProSemperMay 21, 2019 at 1:23 PM\nWorks great\n\nEasy tutorials if you have never used before. Great way to get with friends and watch sports or movies together. Highly recommended.\n\nHelpful | 4", "MemKem106May 22, 2019 at 9:22 AM\nNice\n\nAmazing\n\nHelpful | 5", "ShoreJakeJun 17, 2019 at 7:50 PM\nWont load past 55%\n\nI cant get past 55% logged in. Have not been able to use the app\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:19 PM\n\nEmail us at support@bigscreenvr.com if you're still experiencing issues loading into Bigscreen!", "balanceheartJun 1, 2019 at 1:48 PM\nI can't get this on my pc\n\nI can get into bigscreen but can't get it downloaded so it will allow me to use my remote into pc on oculus quest. Really annoyed.\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:20 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "Simon-FRJun 6, 2019 at 4:13 PM\nOnly for PC?\n\nCant seem to do anything without a computer... and only PC...\n\nHelpful | 3", "LofiLifeKaiMay 21, 2019 at 7:20 PM\nGreat\n\nBetter than Vr chat\n\nHelpful | 4", "emitsAug 29, 2019 at 10:08 PM\nLanguage\n\nMade Russian language and all language please :(\n\nHelpful | 2", "rizzlerixMay 22, 2019 at 10:45 PM\nFew bugs but still 5 stars\n\nFew bugs but thats expected from a new console, still deserves 5 stars as the whole concept is great\n\nHelpful | 2", "Emanuele_TritoneMay 23, 2019 at 4:06 AM\nMy heart is crying\n\nI've just bought the Quest for this app, but it crashes every time I try to do something. I really hope you'll fix this great app soon\n\nHelpful | 2\nDeveloper ResponseMar 27 at 9:19 PM\n\nEmail us at support@bigscreenvr.com if you're still experiencing issues loading into Bigscreen!", "LewkolosthismindMay 23, 2019 at 6:06 AM\nSo cool when it's working\n\nI really enjoyed this a lot but it keeps crashing. It's a beta though so I can't penalize for that\n\nHelpful | 2", "mongoose1790May 23, 2019 at 7:26 AM\nCan't even find the desktop version\n\nThe PC version of this, which is necessary to even run this on your Quest, is not posted on the Oculus website.\n\nHelpful | 1\nDeveloper ResponseMar 27 at 9:20 PM\n\nEmail us at support@bigscreenvr.com for help or check out this step-by-step guide: https://www.reddit.com/r/bigscreen/wiki/remotedesktop", "DavidHasanluMay 31, 2019 at 3:33 PM\nAwesome\n\nAwesome\n\nHelpful | 2", "amit.dutta.5055May 22, 2019 at 8:02 PM\nDont download\n\nThis app just hanged my vr quest... pathetic\n\nHelpful | 3\nDeveloper ResponseMar 27 at 9:24 PM\n\nEmail us at support@bigscreenvr.com if you're having issues loading into Bigscreen!", "Dead11SinMay 22, 2019 at 1:16 AM\nLove it!!\n\nGreat invention\n\nHelpful | 3", "jayden.kilgore9Aug 24, 2019 at 5:55 AM\nUse this if you don't have a big TV\n\nI haven't used it but I know it will be fun\n\nHelpful | 0", "galaftionMay 27, 2019 at 2:25 PM\nno support for MAC ..\n\nhope that MACs owners are not ignored.\n\nHelpful | 2", "NoxybuttMay 23, 2019 at 5:30 PM\nI dont like the avatars\n\nEverything other than the headline is fine, but the humour of being present with ugly characters my friends made wears off. Frankly considering that the oculus avatars are now cross platform, and look grossly more appealing, I kind of wished that they would embrace that.\n\nOther than this, application is fine. The biggest reason Im rating it like this is because I could simply use VR desktop if I wanted to be alone. But if I want to be social I want to have a character that fits me, and have other characters not look like the stuff of nightmares..\n\nHelpful | 6"]