{"App Title": "Bogo", "App description": "Come play with Bogo, your very own virtual pet! Bogo is a short Oculus Quest experience that features a scaling play area.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Casual, Narrative, Simulation", "Languages": "English", "Version": "1.0", "Developer": "Oculus", "Publisher": "Oculus", "Website": "http://www.oculus.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Privacy Policy\n\nLast Updated: December 27, 2019\n\nOculus is brought to you by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) (\"Oculus,\" \"we,\" \"us\") and is one of the Facebook Companies (https://www.facebook.com/help/111814505650678). We make virtual, mixed, and augmented reality (collectively, \"XR\") products and operate a platform where users can download, interact with, and submit content and obtain services related to our products. Collectively, we describe our products and servicesincluding our websites, mobile apps, platform, content, hardware and the services described further in our Terms of Service (https://www.oculus.com/legal/terms-of-service)as our \"Services.\" This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\n1. What kind of information do we collect?\n\nDepending on which Services you use, we must process different kinds of information from or about you. Heres how:\n\nInformation You (and others) Give Us. We collect the information you (and others) give us when using our Services. For example:\nWhen you register to use our Services, we ask for information such as your name, email address, and phone number.\nYou will have the ability to add information to your profile after registration.\nIf you buy something on or through our Services, we collect information about the transaction. This can include your payment information, purchase activity, and shipping and contact details.\nWe collect information about the people, content, and experiences you connect to and how you interact with them across our Services.\nWhen you post, share or communicate with us or other Oculus users on our Services, we receive and store those communications and information associated with them, such as the date a post was created.\nWhen you communicate with Oculus, you provide us with information like your email address.\nDepending on which Services you use, you have the option of submitting information about your physical features and dimensions.\nWe collect content and information about content you create using our Services, such as your avatar, a picture you post, or an object you sculpt.\nWe also collect content and information that other people provide when they use the Services. This can include information about you, like when they send us an abuse report that refers to or contains video of you.\nInformation Automatically Collected About You When You Use Our Services. We also collect information automatically when you are connected to our Services. Depending on how you access and use our Services, we collect information such as:\nInformation about your interactions with our Services, like information about the people, games, content, apps, features, or other experiences you interact with, including information collected through or from content provided by our third-party partners. For example, we may receive information about in-app purchases you have made in a game provided by a third-party developer;\nInformation collected in or through cookies, local storage, pixels, and similar technologies (additional information about these technologies is available at https://www.oculus.com/legal/cookies-pixels-and-other-technologies);\nInformation about how you access our Services, including information about the type of device you're using (such as a headset, PC, TV, mobile, or other connected device), its configuration (such as your operating system and graphics processing unit), your browser, Internet Protocol (\"IP\") address, and how your device is performing;\nInformation about the features you interact with on our Services. For example, when you use our voice-search features, we process your voice commands so we can deliver the content or feature youve requested;\nCertain identifiers that may be unique to you. These identifiers include device and other identifiers, such as those from games and apps you use;\nInformation about the games, content, or other apps installed on your device or provided through our Services, including from third parties;\nLocation-related information, which can be derived from information such as your devices IP address. If youre using a mobile device, some of our Services collect information about the devices precise location, which is derived from sources such as the devices GPS signal and information about nearby Wi-Fi networks and cell towers;\nInformation about your environment, physical movements, and dimensions when you use an XR device. For example, when you set up the Oculus Guardian System to alert you when you approach a boundary, we receive information about the play area that you have defined;\nInformation we receive through device settings you choose, such as your photos or audio content.\n\nThird parties may also collect information about you through the Services, as described below.\n\nRelated companies. Depending on which services you use, we receive information about you from other companies that are within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook, and combine that information with other information we collect about you. View a complete list of related companies at https://www.facebook.com/help/111814505650678.\nInformation from other sources. We also receive additional information about you from third parties, including partners that provide us information that is publicly or commercially available, and may combine that information with the other information we collect about you.\n\nYou can learn how to access and delete information we collect by visiting the Privacy Center (https://secure.oculus.com/my/privacy).\n\n2. How do we use information?\n\nWe use the information as set out below and to provide our Services to you and our partners. Heres how:\n\nTo provide and personalize our Services. We use the information we collect to provide you with our Services. For example, we use this information to:\nProvide you with hardware, content, games, apps, and other experiences;\nCreate accounts and user profiles;\nCommunicate with you about our Services;\nEnable user-to-user communications and other social services;\nProvide technical support;\nNotify you about updates to our Services; and\nCustomize your experiences based on your activities, including the content, games, apps, and other experiences you interact with, the other online services you use, and other information we collect. This allows us to make your experience unique and relevant to you, for example by showing you content that is most relevant to you.\nTo improve and develop your experience and our Services. We also use the information we collect to understand and improve our Services and to develop the XR ecosystem. For example, we use the information to:\nSolicit and analyze input and feedback about our Services;\nIdentify and address technical issues on our Services;\nConduct and learn from research about the ways in which people use our Services; and\nImprove services offered by others, such as third parties that offer content, games, apps and other experiences on our platform.\nTo market to you. We use the information we collect to send you promotional messages and content and otherwise market to you on and off our Services. We also use this information to measure how users respond to our marketing efforts. If you would like to opt out of receiving marketing emails, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\nTo promote safety and security. We use the information we collect to help promote safety and security on and off our Services, such as by investigating suspicious activity or violations of our terms or policies and protecting our or others rights or property.\n\n3. How is information shared?\n\nOur Services help you engage with the XR ecosystem and others that interact with it. To provide and support our Services, information we have about you is shared in certain circumstances. Here is who can see information about you when you and others use our Services.\n\nPeople and accounts you share and communicate with. When you share, interact, and communicate using our Services, you choose the audience for what you share. For example, when you post a photo on the wall in Oculus Rooms, other people who visit the room will be able see it.\nPublic Information. Certain information you post to your Oculus profile, such as your Oculus ID (also known as your Oculus Username), your system-generated user ID, and avatar, will be public and visible to people on and off our Services. Your Oculus ID is a unique identifier you choose to identify yourself on our Services. Your system-generated internal-ID is an opaque string of characters generated by the Oculus system that identifies your Oculus profile.\n\nInformation you post to public areas of our Services, such as a forum, blog, or other community tool, will also be visible to people on and off our Services. If you post information to these interactive features, it will be publicly available. Certain information associated with your public posts, such as the time of your post, may also be published and publicly available.\n\nContent others share about you. You should consider who you choose to share with, because people who are able to see your activity, content, or information on our Services may choose to share it with others on and off our Services. For example, when you interact with others in a multiplayer game, another player could choose to livestream that experience  including what you are doing in the game  to Facebook. People may also use our products to share content about you they have obtained from other sources. For example, people may share a photo of you with others in Oculus Rooms.\nApps, Developers, and Other Online Content Providers on our Services. You can interact with third-party content, games, apps, and other experiences through our Services. We may share information about you with these partners so they can provide you with the experiences you've requested, such as:\nInformation in your Oculus profile and about how you use our Services. For example, we may provide a third-party gaming experience with information about people you commonly interact with on our Services so they can offer to pair you in a social experience. We may also share information about individual abuse reports or abuse statistics on our Services, so we can help develop a safe and enjoyable XR ecosystem.\nInformation about your interaction with the third-party service, such as how long you have interacted with content or how far you have progressed in a game.\nAny other information you choose to share with the third party.\nThird-party content providers may also collect information from you directly through the experiences they provide. Please note that any information you share with these (or other) third parties will be subject to those third parties own privacy policies, not this one.\nSharing Within Related Companies. Depending on which services you use, we share information within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook. For a list of our related companies, please see https://www.facebook.com/help/111814505650678.\nService providers. We share the information we collect with vendors, service providers, researchers and other partners, who work at our direction to support the Services (such as hosting our Services, fulfilling orders, facilitating payments, analyzing the way people use our Services, processing credit card payments, providing customer service, or sending electronic communications for us).\nOther parties in connection with certain business transactions. In the event that the ownership of Oculus (or any portion of our assets) changes as a result of a merger, acquisition, or in the event of a bankruptcy, information from or about you or your device may be transferred to another company.\nPermission. We may share information about you for any other purpose you choose.\nLaw enforcement or legal requests. We share information with law enforcement or in response to legal requests in the circumstances outlined in Section 7 below.\n\nWe also share de-identified or aggregate data with others. De-identified data means information where we have removed your name and other data that could reasonably be used to identify you. Aggregate data is data that has been combined with other data so that it doesnt identify any specific person. For example, we provide developers with aggregated statistics about the number of people from a particular region that use our Services, so developers can create content tailored for people in that market.\n\n4. How the Facebook Companies work together\n\nOculus shares infrastructure, systems technology with other Facebook Companies (which include Facebook, Instagram, and WhatsApp) to provide an innovative, relevant, consistent and safe experience across all Facebook Company Products you use. We also process information about you across the Facebook Companies for these purposes, as permitted by applicable law and in accordance with their terms and policies. For example, we use information about bad actors on Oculus to fight spam or abuse on other Facebook Company Products like Instagram. We also work to understand how people use and interact with Facebook Company Products, like understanding the number of unique users on different Facebook Company Products.\n\nFacebook also powers social features on Oculus. If you choose to log into Facebook on Oculus, Facebook will use your Oculus account information and information about your use of Oculus products to provide, personalize and improve Facebook Company Products, including to personalize the ads you see on and off Facebook Company Products. You can control what data Facebook uses to show you ads on and off of Facebook Company Products in your Facebook Settings.\n\n5. Third Parties that Provide Content, Marketing, or Functionality on Our Services\n\nSome of the content, marketing, and functionality on our Services may be provided by third parties that are not affiliated with us. For example, we work with companies that help us understand how people use our Services.\n\nOther companies may collect information on or through our Services to market to you on or off of our Services. These and other third parties may collect information about your use of our Services, including through the use of cookies, device IDs, local storage, pixels and other technologies, and this information may be collected over time and combined with information collected on different websites and online services.\n\n6. Data retention and deletion\n\nWe store data that identifies you until it is no longer necessary to provide our Services or your account is deleted, whichever comes first. This is a case-by-case determination that depends on things like the nature of the data, why it is collected and processed, and relevant legal or operational retention needs. For example, we may retain certain purchase information for accounting and tax purposes even after you have deleted your account.\n\nWhen you delete your account, we delete things you have posted and information about apps and entitlements you have downloaded, and you will not be able to recover that information later. Information that others have shared about you is not part of your account and will not be deleted when you delete your account. To delete your account at any time, or to learn more about deleting your account, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\n\n7. How do we respond to legal requests and preventing harm?\n\nWe access, preserve and share information with regulators, law enforcement or others:\n\nIn response to a legal request (like a search warrant, court order or subpoena) if we have a good faith belief that the law requires us to do so. This may include responding to legal requests from jurisdictions outside of the United States where we have a good faith belief that the response is required by law in that jurisdiction, affects users in that jurisdiction, and is consistent with internationally recognized standards.\n\nInformation we receive about you, including financial transaction data related to purchases made on or through our Services, can be accessed, processed and retained for an extended period when it is the subject of a legal request or obligation, governmental investigation, or investigations concerning possible violations of our terms or policies, or otherwise to prevent harm. We also retain information from accounts disabled for violations of our terms for at least a year to prevent repeat abuse or other term violations.\n\n8. How we operate and transfer data as part of our global services\n\nWe share information globally, both internally within the Facebook Companies (https://www.facebook.com/help/111814505650678/), and externally with our partners and with those you connect and share with around the world. Your information may, for example, be transferred or transmitted to, or stored and processed in the United States or other countries outside of where you live for the purposes described in this policy.\n\n9. How will we notify you of changes to this policy?\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, and/or providing notice through the Services. If we make an administrative change, we may update the \"Last Updated\" date at the top of this Privacy Policy.\n\n10. Contacting Us\n\nIf you have questions about this Privacy Policy, please contact us at privacy@oculus.com.\n\n11. Privacy Notice for California Residents\n\nIf you are a California resident, you can learn more about your consumer privacy rights by reviewing the California Privacy Notice.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Developer Terms of Service": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Terms Of Service\n\nLast Updated: June 8, 2020\n\nBY ACCEPTING THESE TERMS OF SERVICE OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THESE TERMS OF SERVICE IN THEIR ENTIRETY. IF YOU DO NOT AGREE TO THESE TERMS OF SERVICE, DO NOT ACCESS OR USE OUR SERVICES.\n\nTHESE TERMS OF SERVICE CONTAIN IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SERVICES, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS. PLEASE READ THE \"DISPUTE RESOLUTION\" SECTION (SECTION 19) IN ITS ENTIRETY. IN ADDITION, CERTAIN TERMS AND CONDITIONS MAY BE APPLICABLE TO USERS THAT RESIDE OUTSIDE THE UNITED STATES. PLEASE REVIEW SECTION 27 TO DETERMINE WHETHER THESE TERMS AND CONDITIONS APPLY TO YOU.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THESE TERMS OF SERVICE. MAKE SURE TO REVIEW THESE TERMS OF SERVICE WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nOculus (\"Oculus,\" \"we,\" \"us\" or \"our\") is brought to you by Facebook Technologies Ireland Limited (formerly known as Oculus VR Ireland Limited) if you reside in the European Region (as defined at https://www.oculus.com/legal/territories) and by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) if you reside anywhere else.\n\nWe are pleased to provide you access to the services described below in Section 1 (collectively, our \"Services\"). These Terms of Service (\"Terms\") apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with Oculus for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nOculus reserves the right to change or modify these Terms on a going-forward basis at any time and in our sole discretion. If Oculus makes changes to these Terms, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided and/or notice through the Services. If we make an administrative change, we may provide notice by updating the \"Last Updated\" date at the top of these Terms.\n\nYour continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services and delete (https://secure.oculus.com/my/privacy) your account. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\n1. Oculus Products and Services\n\nOur mission is to enable people to have meaningful interactions regardless of physical distance. To help advance this mission, we provide the Services described below to you. In order to provide these Services, we must collect and use your personal data as described in our Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy.\n\nProvide innovative devices, content and systems. We offer a variety of physical goods, platform services, software, websites, applications, and content that allow you to access and immerse yourself in virtual, augmented, and mixed-reality (collectively, \"XR\") worlds and obtain services related to our products. We use the data we have to provide you with these products and to enhance the XR ecosystem.\nProvide a personalized experience for you. Your experience with Oculus is unlike anyone elses. For example, any Oculus user may be eligible to see thousands of unique pieces of content. We use the data we have  for example, information about the connections you make, the choices and controls you select, and the things you share and do  to personalize your experience.\nConnect you with people and experiences you care about. We help you find and connect with people, groups, events, and other experiences that matter to you across the Services you use. We use the data we have to make suggestions for you and others  for example, rooms to join, events to attend, and people you may want to become friends with. Stronger ties make for better communities, and we believe our Services are most useful when people are connected to people, groups, and experiences they care about.\nEmpower you to express yourself and communicate about what matters to you. There are many ways to express yourself on Oculus and to communicate with friends, family, and others  for example, sharing photos, creating or participating in events or multiplayer experiences, or adding content to a virtual environment. We also have developed, and continue to explore, new ways for people to use technology like augmented reality and 360 video to share more expressive and engaging content on or through Oculus.\nHelp you discover content, products and services that may interest you. We may provide you with offers and other promotions to help you discover content, products, and services that are offered by Oculus and the many businesses and organizations that use our Services.\nCombat harmful conduct and protect and support our community. People can only have meaningful interactions if they feel safe. We employ dedicated teams and develop advanced technical systems to detect misuse of our service, harmful conduct towards others, violations of our terms and policies, and situations where we may be able to help support or protect our community. If we learn of content or conduct that misuses our Service or violates our Terms and policies, we will take appropriate action  for example, removing content, blocking access to certain features, disabling an account, or contacting law enforcement. We share information with other Facebook Companies (https://www.facebook.com/help/111814505650678) when we detect misuse or harmful conduct by someone using one of our Services.\nUse and develop advanced technologies to provide functional services for everyone. We use and develop advanced technologies  like artificial intelligence and machine learning systems  to enable us to offer a better and more useful service to everyone who uses Oculus. For example, we use information we have to develop models that will surface content that is relevant to you. We also develop automated systems to improve our ability to detect and remove abusive and dangerous activity that may harm our community and the integrity of our Services.\nResearch new ways to make our services better. We engage in research and collaborate with others to improve our Services. One way we do this is by analyzing the data we have and understanding how people use our Services.\nProvide consistent and seamless experiences: Our products help you find and connect with people, groups, businesses, organizations, and others that are important to you. We design our systems so that your experience is consistent and seamless across the different Facebook Company Products (https://www.facebook.com/help/195227921252400) that you use. For example, some of our Services help you connect with your friends on Facebook.\nEnable global access to our services: To operate our global service, we need to store and distribute content and data in our data centers and systems around the world, including outside your country of residence. This infrastructure may be owned or operated by Facebook Technologies, LLC, Facebook Technologies Ireland Limited, Facebook Inc., Facebook Ireland Limited, or their affiliates.\n\n2. Eligibility; Registration and Account\n\nThe Services are intended solely for users who are 13 or older. Any registration for, or use of, the Services by anyone under the age of 13 is unauthorized, unlicensed and in violation of these Terms. You represent and warrant that you (a) are not identified on the Office of Foreign Assets Controls Specially Designated Nationals List (\"SDN List\"), (b) are not placed on the U.S. Department of Commerces Denied Persons List or Entity List or any other U.S. export control list, (c) will not use IP proxying or other methods to disguise the place of your residence, (d) will not use the Services if any applicable laws in your country prohibit you from doing so in accordance with these Terms and (e) have not previously had your right to use the Services suspended or terminated.\n\nTo access and use certain features of the Services, you may be required to register for an account. By creating an account, you agree to: (i) provide accurate, current and complete account information; (ii) maintain the security of your password, not share your password with any other person and accept all risks of unauthorized access to your account; and (iii) promptly provide notice at https://www.facebook.com/whitehat if you discover or otherwise suspect any security breaches related to the Services.\n\n3. Equipment; Software; and Updates\n\nCertain equipment and software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our Code of Conduct (https://support.oculus.com/1694069410806625), agreements, laws, regulations, or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\n4. Your Use of the Services and Content\n\n4.1 Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (\"Software and Content\"), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by Oculus or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n4.2 Oculus Runtime Software. Subject to these Terms, including the license provided in Section 4.1, you may access, install, and use the Oculus Runtime Software (\"Runtime\"). In order to maximize your enjoyment, safety, and overall experience through our Services, the Runtime may only be used with Oculus approved hardware devices and with software developed using the Oculus Rift Software Development Kit, as specified in the Oculus Rift Software Development Kit license agreement. We also require that you use only the then-current version of the Runtime. You acknowledge that the Runtime incorporates proprietary information, and that you will not disclose it to any other person or entity.\n\n4.3 Third Party Content. Your use of services, applications, or content provided by third parties (\"Third Party Content\") made available through the Services may be subject to additional end user agreements. In the event that these agreements conflict with the provisions of these Terms, these Terms will govern. Oculus has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Oculus be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Oculus) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n4.4 Trial Access to Services. We may offer free trials or other limited versions of Services so you can preview Services before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n4.5 Availability of Services after Purchase; Updates. Some Services may rely on services provided by third parties for some or all of its functionality. Such Services may not function properly or may become inoperable if these third parties discontinue their services.\n\n4.6 Support. Oculus will be responsible for all billing questions related to the purchase of Services and for support with respect to the Oculus platform. Oculus has no obligation to provide support for Third Party Content. Please contact us through the support portal at https://support.oculus.com for assistance.\n\n4.7 Availability. The Services and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n4.8 Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n5. Purchasing Services\n\n5.1 Purchasing Services from Oculus. You may only purchase Services for your personal use or to give as a gift unless otherwise expressly permitted in these Terms. You may not purchase Services from Oculus for commercial use or resale, although you may use the Services to develop and test content, software, or applications intended for distribution by Oculus.\n\nWhen placing an order or making a purchase, you will be required to provide us with information, such as your address and billing information. You represent and warrant that all such information is accurate, and you will ensure that such information is kept current. Oculus will have no responsibility or liability for inaccurate information or information that later becomes outdated, and Oculus will have no obligation to make efforts to determine the correct contact or shipping information. For most Services, you can manage your information within your account settings. For product purchases pending shipment, you can update your information at any time prior to shipment at https://shop.oculus.com/history. We will not take payment for product purchases until Order Acceptance (see below).\n\nAfter you place an order, you may receive a communication from us acknowledging that we have received your order (\"Order Acknowledgement\"). Please note that receiving the Order Acknowledgement does not mean that your order has been accepted. We will confirm our acceptance of your order by sending you a communication that confirms that the order has been processed or the goods have been shipped  when applicable (\"Order Acceptance\"). The contract between us in relation to the applicable Services will be formed when we send you the Order Acceptance.\n\nAny shipping dates or times provided by us (or a courier) are estimates only and are not guaranteed. The risk of loss in physical goods you purchase and the responsibility to insure the goods passes to you upon delivery of the goods to you.\n\nNothing in these Terms shall affect your statutory rights to reject physical goods that, when received by you, are damaged or defective.\n\n5.2 Pre-Orders. In advance of a new Service launch it may be possible to place pre-orders.\n\nThe price of the Service you pre-order will be as quoted to you at the time you submit your pre-order, and may include tax and shipping when applicable. Placing a pre-order does not guarantee delivery of a Service.\n\nWhen the pre-ordered Service is ready for shipping or delivery we will contact you to provide you with your purchase confirmation (including shipping costs and any taxes where applicable). This shall constitute the Order Acceptance.\n\n5.3 Our Right to Reject Your Order. At any time prior to Order Acceptance, we reserve the right to decline or reject your order. If this occurs, we will attempt to notify you. Some reasons for rejection can include: (a) we are unable to supply you with Service, for example because that item is no longer available or because of an error in the price at the point of sale; (b) you do not live in a country or region from which the Services may be purchased; or (c) you order more than the permitted maximum number of Services. If you have already paid, we will refund you the full amount including any delivery costs charged.\n\n5.4 Your Right to Cancel or Return Physical Goods. You may cancel your order or pre-order of physical goods at any time prior to shipping and Order Acceptance. After shipping the goods to you, you have the right, within 30 days from the date of your receipt of the goods, to cancel our contract with you and return the goods. This right does not apply to any goods that have been used, or are stated by us to be non-returnable, including any items or goods that have been personalized or modified in accordance with your instructions. The goods must be fully returned in the original packaging with the applicable proof of purchase and you will be responsible for the cost of returning the goods to us. If, on return to us, it is determined that the goods have been used, damaged, are missing components, or are not in resalable condition we may charge a 15% restocking fee, or otherwise reduce the amount of your refund to take account of this damage, use, or missing components.\n\nTo cancel your order or return your goods, you must inform us of your decision by following the instructions at https://support.oculus.com\n\n5.5 Content Transactions. You may have the ability to purchase digital content through the Services. You also may have the ability to purchase additional or enhanced functionality or media content within certain Services (collectively, \"In-App Purchases\"). Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content or In-App Purchases and assume no liability for Third Party Content or Third Party In-App Purchases that occur within Third Party Content.\n\n5.6 Errors. We attempt to be as accurate as possible and to eliminate errors in relation to our Services; however, we do not represent or warrant that any Service descriptions or pricing information are accurate, complete, reliable, current or error-free. In the event of an error, we reserve the right to correct such error and revise your order accordingly (which includes charging the correct price) or to cancel the order and refund any amount charged. If we discover a pricing or other material error related to a Service that has yet to be shipped or delivered, we will contact you to inform you of this error and give you the option of continuing to purchase at the correct price or cancelling your order. If we are unable to contact you using the contact details you provided during the order process, we will treat the order as cancelled.\n\n5.7 Account. You may be required to be a registered user in order to purchase some Services. You are responsible for all charges incurred in connection with your account. Oculus may attempt to collect unpaid charges, including by attempting additional charges to your payment instrument, use of collections agencies and any other legal means. If you decide to cancel your account, Oculus reserves the right, subject to any limitations under applicable laws, to collect fees, surcharges, or costs incurred before cancellation. Any delinquent or unpaid accounts must be settled before Oculus will allow you to register again.\n\n5.8 Virtual Items. Your purchase of a virtual item or in-game currency within the Services is a payment for a limited, non-assignable license to access and use such content or functionality in the Services. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Services can only be used in connection with the Services where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Services for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n5.9 Pricing and Payment. We may accept various forms of payment, including credit and debit cards, and payments made through PayPal and Facebook Payments. Additional terms with your payment provider may apply.\n\nBy submitting an order or pre-order, you acknowledge that you are authorized to use the designated payment method and you authorize us to charge your order to that payment method. When you provide your payment information, you authorize us (or a third party payment processor) to process and store your payment and related information. Depending on where you are located or ask to have Services shipped or delivered, Oculus may utilize an agent, subsidiary, or affiliate (including Facebook Technologies Ireland Limited for orders outside of the United States and Canada) to process payment and shipping. In the event the payment method you designate cannot be verified, is invalid, or is not otherwise acceptable, we may suspend or cancel your order. You are responsible for resolving any problems we encounter in order to proceed with your order.\n\nPrices are subject to change without notice. We reserve the right to refuse or cancel orders at any time and in our sole discretion.\n\n5.10 Taxes. If your purchase or use of the Services is subject to any type of use or sales tax, duty or other governmental tax or fee (\"Taxes\"), then we may charge you for those Taxes. Applicable Taxes may be presented at checkout. You are responsible for any Taxes due with respect to your use of the Services.\n\n5.11 Content Cancellations; Returns. All purchases of digital content are final except as required by law, or as described in our Mobile (https://www.oculus.com/legal/mobile-content-refund-policy) and Rift (https://www.oculus.com/legal/rift-content-refund-policy) Content Refund Policies. Once you purchase Content, we encourage you to download, install and/or access it promptly. You consent that the supply of the digital content may begin immediately following the completion of your purchase, and you acknowledge that you therefore will lose any statutory rights you may have to withdraw and receive a refund. If you are unable to download, install or access purchased content, please contact us through the support portal at https://support.oculus.com.\n\n6. Acceptable Use\n\nBy accessing or using the Services, you agree that you will not: (a) access or use the Services in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Services, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Services in any manner; (c) access or use the Services for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, Code of Conduct (https://support.oculus.com/1694069410806625), or any other terms or policies provided in connection with the Services; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Services; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Services or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Services, or third parties; or (h) infringe upon or violate the rights of Oculus, our users or any third party.\n\n7. User Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send, otherwise transmit, or interact with content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, \"User Content\"). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. If you use content covered by intellectual property rights that we have made available through our Services (for example, images, designs, videos, or sounds we provide that you add to content you create or share on Oculus), we retain all rights to that content (but not yours). By submitting User Content through the Services, you grant Oculus a worldwide, non-exclusive, transferable, royalty-free, and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform, and distribute such User Content in connection with the Facebook Company Products (https://www.facebook.com/help/195227921252400) (subject to applicable Privacy Settings (https://secure.oculus.com/my/privacy)). This right ends when you delete your User Content or your account unless your User Content has been shared with others, and they have not deleted it. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content. If User Content includes music, you agree to our Music Guidelines (https://www.oculus.com/legal/music-terms).\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Oculus the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our Code of Conduct (https://support.oculus.com/1694069410806625/).\n\nOculus does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Oculus has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nIn the event you are a developer who submits User Content to Oculus, you acknowledge and agree that our agreements with you as a developer may supersede this section of the Terms.\n\n8. Privacy Policy\n\nOur Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as developers of Third Party Content and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Services. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n9. Additional Terms\n\nThese Terms are in addition to, and do not replace or change, any other agreements you enter into with Oculus, which may include but are not limited to our developer agreements, special device terms of use, Code of Conduct (https://support.oculus.com/1694069410806625), and contest, competition, or promotion-related terms. In addition, if you purchase physical goods from Oculus, other terms of sale or promotion may apply from time to time.\n\nYour purchase and use of Third Party Content may be subject to additional terms, including but not limited to third-party end user agreements, and privacy policies. We encourage you to review any third-party agreements and policies carefully before accessing, downloading or using Third Party Content. You may also access services provided by other Facebook Company Products (https://www.facebook.com/help/195227921252400), which may be subject to additional terms.\n\n10. Ratings\n\nWe may display age, comfort, and content ratings for digital content that are based on information provided to us by the developers of such content. We cannot guarantee that digital content ratings will always be accurate, nor can we promise that you will not find some material harmful, offensive, indecent or objectionable.\n\n11. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Services are the property of Oculus or our licensors and are protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\nOculus, Oculus VR, Rift, Oculus Touch, Oculus Go, and the Oculus logo (\"Oculus Marks\") are trademarks or registered trademarks of Facebook Technologies, LLC. The Oculus Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, except as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder. For more information about our brand guidelines, visit our Brand Resource Center (https://oculusbrand.com).\n\n12. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials or other information about Oculus and our Services (collectively, \"Feedback\"). You agree that Oculus and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n13. Export Compliance and U.S. Government Rights\n\nYou will comply with all applicable export control laws of the United States and any other applicable governmental authority, including without limitation, the U.S. Export Administration Regulations (\"Export Laws\"). You will not, directly or indirectly, export, re-export or download any products, services or technology of Oculus, including, without limitation, the Services: (a) to any individual, entity or country prohibited by Export Laws, including by any U.S. sanctions program; (b) to anyone on the SDN List, the Denied Persons List or Entity List or other export control lists; or (c) for any purpose prohibited by Export Laws, including nuclear, chemical or biological weapons proliferation or development of missile technology. You further represent and warrant that no U.S. federal agency has suspended, revoked or denied your export privileges and you are not listed on the SDN List.\n\nThe Services, including all related software, technical data and documentation, are \"Commercial Items\" as that term is defined in 48 C.F.R. 2.101. We provide the Services for U.S. Government end use solely in accordance with the following: (a) the Services are licensed only as Commercial Items; and (b) the U.S. Government will have the same rights as all other end users pursuant to these Terms. This customary commercial license is provided in accordance with FAR 12.211 (Technical Data) and FAR 12.212 (Software) and, for U.S. Department of Defense transactions, DFARS 252.227-7015 (Technical Data  Commercial Items) and DFARS 227.7202-3 (Rights in Commercial Computer Software or Computer Software Documentation). If a U.S. Government agency has a need for any additional rights, it must negotiate directly with Oculus to determine if the parties can negotiate an acceptable license amendment that must be included in any applicable contract or agreement.\n\n14. Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (\"DMCA\") and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Services and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nIf you believe that anything on or available through the Services infringes upon any copyright which you own or control, you may file a notification of such infringement with our Designated Agent as set forth below:\n\nDesignated Agent\n\nFacebook Technologies, LLC\n\n1601 Willow Road\n\nMenlo Park, CA 94025\n\nPhone: (650) 543-4800\n\nEmail: IP@oculus.com\n\nPlease see 17 U.S.C. 512(c)(3) (available at http://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n15. Hyperlinks\n\nYou are granted a limited, non-exclusive right to create text hyperlinks to our websites for noncommercial purposes; however, you may not use our logos or other proprietary graphics to link to our sites without our express written permission.\n\nThe Services may contain links to third-party websites, applications or other third-party services, and you understand that by accessing third-party links, you may be exposed to content that is offensive, harmful, inaccurate or otherwise inappropriate. You understand and agree that we are not responsible or liable for the availability or accuracy of such third-party properties or the content, products or services made available through such properties. We do not endorse or control such third-party properties and we make no representations or warranties of any kind regarding such properties. If you access or use any third-party properties, you should also be aware that such third parties terms and policies will govern.\n\n16. Disclaimers\n\n16.1 THERE ARE IMPORTANT HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS THAT YOU MUST READ BEFORE USING THE SERVICES, WHICH ARE AVAILABLE AT https://www.oculus.com/legal/health-and-safety-warnings. BY USING THE SERVICES, YOU REPRESENT AND WARRANT THAT YOU HAVE READ AND UNDERSTAND THESE WARNINGS AND INSTRUCTIONS. WE MAY UPDATE OR REVISE THESE WARNINGS AND INSTRUCTIONS, SO PLEASE REVIEW THEM PERIODICALLY. ADDITIONAL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS MAY BE PROVIDED BY DEVELOPERS IN RELATION TO SPECIFIC THIRD PARTY CONTENT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS BEFORE USING THE SERVICES.\n\n16.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK. AS BETWEEN YOU AND OCULUS, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, AND OCULUS EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, OCULUS DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS, (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY OCULUS WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n17. Indemnification\n\nYou agree to defend, indemnify and hold harmless Oculus and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, \"Oculus Parties\") from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Services; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Oculus or a third party in relation to the Services; (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n18. Limitation of Liability\n\nTHE OCULUS PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SERVICES, EVEN IF AN OCULUS PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE OCULUS PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SERVICES. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n19. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH OCULUS AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM OCULUS (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n19.1 Binding Arbitration; Disputes; Small Claims. You and Oculus agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in San Mateo County, California, or, if you reside in the U.S., in a small claims court in your county of residence. \"Dispute\" as used in this Section 19 means any dispute, cause of action, claim, or controversy arising out of or in any way related to Oculus, these Terms, the subject matter of these Terms, or access to and use of the Services, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Oculuss intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Oculus empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n19.2 No Class Arbitrations, Class Actions or Representative Actions. You and Oculus agree that any Dispute is personal to you and Oculus, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Oculus agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n19.3 Federal Arbitration Act. You and Oculus agree that these Terms affect interstate commerce and that the enforceability of Section 19 shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (\"FAA\") to the maximum extent permitted by applicable law.\n\n19.4 Confidentiality. The arbitrator, Oculus, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n19.5 Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Oculus, you agree to first contact Oculus and attempt to resolve the claim informally by sending a written notice of your claim (\"Notice\") to Oculus. The Notice to Oculus must be sent by certified mail addressed to: General Counsel, Oculus, 1601 Willow Road, Menlo Park, CA 94025. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Oculus cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 19, commence an arbitration proceeding or file a claim in court. You and Oculus agree that any Dispute must be commenced or filed within one year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Oculus cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Oculus shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (\"AAA\"). In the event AAA declines or is unable to administer the arbitration, you and Oculus agree to use an arbitration forum or arbitrator that you and Oculus mutually agree upon. If, after making a reasonable effort, you and Oculus are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (\"AAA Rules\") then in effect. The AAA Rules and other information about AAA and arbitration are readily available at http://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Oculus agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, Oculus will pay all filing, AAA, and arbitrators fees and expenses. If the arbitrator issues you an award that is greater than the value of our last written settlement offer made before an arbitrator was selected (or if we did not make a settlement offer before an arbitrator was selected), then we will pay you the amount of the award or US $5,000, whichever is greater, and pay your attorney, if any, the amount of attorneys fees incurred, and reimburse any expenses (including expert witness fees and costs) that you or your attorney reasonably accrue for investigating, preparing and pursuing your claim in arbitration. We waive any right to seek an award of attorneys fees and expenses in connection with any non-frivolous arbitration between you and us.\n\n19.6 Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Oculus can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within 30 days of the date that you first became subject to this arbitration provision, and must include your name and residence address, the email address you use for your Oculus account (if you have one), and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: General Counsel, Oculus, 1601 Willow Rd., Menlo Park, CA 94025.\n\nIf a court or arbitrator decides that any of this section's limitations cannot be enforced as to a particular claim for relief, then that claim (and only that claim) must be severed from the arbitration and may be brought in court. Unless you choose to opt out, this dispute resolution provision in Section 19 shall survive termination of these Terms.\n\nThe courts in some countries may not permit you to consent to arbitration. If you reside in one of those countries, your countrys laws will apply.\n\n20. Governing Law\n\n20.1 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Services. Your access to and use of the Services may also be subject to other local, state, national or international laws.\n\n20.2 To the extent the provisions in Section 19 do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the United States District Court for the Northern District of California or a state court located in San Mateo County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims to the extent allowed by law. The courts in some countries may not apply California law to some types of disputes or allow you to consent to jurisdiction in California. If you reside in one of those countries, your country's laws will apply to such disputes related to the Services.\n\n21. Modifications to the Services\n\nOculus reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will Oculus be liable for the removal of or disabling of access to any portion or feature of the Services.\n\n22. Termination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n23. Severability\n\nIf any provision of these Terms is be deemed unlawful, void, or for any reason unenforceable, then that provision will be deemed severable from these Terms and will not affect the validity and enforceability of any remaining provisions.\n\n24. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Oculus, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n25. Nonwaiver\n\nAny failure by Oculus to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.\n\n26. Contact Us\n\nIf you have any questions or concerns regarding these Terms or our Services, please contact us through the support portal at https://support.oculus.com, email at contact@oculus.com.\n\n27. Special Provisions Applicable to Users Outside the United States\n\nCertain specific terms that apply only for German users are available at https://www.oculus.com/legal/terms-applicable-to-germany/. Please review these terms carefully if you reside in Germany.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Space Required": "441.0 MB"}



["5 stars\n67%\n4 stars\n17%\n3 stars\n9%\n2 stars\n2%\n1 star\n4%", "Banja7822 days ago\nGood for kids\n\nBogo is a 20 min interactive experience with a kind of dragon pet. You can feed it, cook and send stuff.\nThe more you interact, the more the environnement is changing.\n\nI was impressed to see how my Kids (8 and 10) and their friends love it and interact with it in a natural way. It is a good way to show them Virtual reality.\n\nHelpful | 13", "caffeinated_pedant10 days ago\nGreat for kids under 8 and guests\n\nIt's the only game in here my 5 y.o. can handle. It's so hard to open menus for her while casting with other games, but this is great because there are no menus, no constant \"play?\" confirmations, etc. Sometimes she makes me grab the apple off the tree for her (it's too tall) but it doesn't reset the ui each time we switch who is wearing the headset. There are only like 3 activities - cook (which changes the dragons color and is quite fun), a ball game, and fetch. If there's more, she hasn't discovered it. Of course, you can pet the dragon too. The graphics are quite nice. I wish it had more content and I'd very gladly pay for additional mini games.\n\nFor my family, this is 20 minutes of game play, repeatable daily.\n\nHelpful | 2", "Bgamer001May 6 at 9:48 AM\n/!\\ CONTAINS SPOILERS /!\\\n\nThe first time I saw the picture for this game I though \"What. Is. That. Thing!!!\" The monster was and is horrifically ugly, but that's, surprisingly, why I wanted to play it. The game was short, but I heard it's basically just a demo. The cooking mechanic is pretty fun and throwing the stick around is kinda cool. Watching the ruins pop up around you is immersive and so is the firework show. The mini-game where you have to keep the plants in the air is dangerous if you have a low ceiling. (I didn't do this on BOGO, but I had broken a light on a different game when I jumped.) You could try to jump or reach up fast and hit something. Overall, I really liked this game. You could probably add a ton more stuff. (Gardening, different ways to cook, more toys, more space and places to go, perhaps different pet options, more mini games, personalizable homes, give your pet a bath, treat pet sickness, etc.) I would hope the devs of this game would consider these options. That would make the game infinitely better. Thanks for all of those who read, I hope this helped you.\n\nHelpful | 86", "AlexDexter11 days ago\nA kerwhizz game\n\nWhat if oculus had a kerwhizz game\nEvery single race world kerwhizz every had from season 1 to 2\nEvery quiz from it as well\nAnd you can build your own pod\nWith body symbol and designs\nAnd colors \n\n\nWho wants that I do if you really want to make your s now\n\nHelpful | 0", "Discobear6405Jun 14 at 7:20 PM\nThis game is great!\n\nThis is a great game, super fun, and a nice game to have when showing off VR. Although it might not be what you are expecting, if your expecting a virtual pet like \"my pou\" or \"tamagotchi\" a pet that you have to take care of and check on day to day then you are not going to be super excited. This is not that, it is a story game, but still great!\n\nHelpful | 8", "kimbiecookieJul 11 at 12:23 AM\nCute Demo game for those new to VR\n\nReally cute little game to play especially for those new to VR or kids would enjoy it. It was fun to take care of the creature. He looks like a baby dragon. I live it when you pet him and you get purrs. Keep petting and see what happens! So cute!\n\nHelpful | 2", "Free_Range_ChristianJul 17 at 6:59 AM\nHey creator of game...\n\nThis game has my dog worried...\nSeriously the game is well made my only suggestion would be hand tracking and customization of bogo.\nI would like to see a bogo park like for dogs where people could watch other's bogo and sit and chat.\n\nHelpful | 2", "RoreoOreo10 days ago\n11/10\n\nI loved this game bogo is adorable and even though its short I loved this game and with it being free and having really good graphics I definitely recommend downloading this game\n\nHelpful | 0", "DrakshalaJun 27 at 10:13 AM\nGreat demo title.\n\n10-20 minutes of basic interaction and a few mini games. This is a perfect way to introduce new people to VR, especially the younger ones. My 7 year old niece fell in love with cooking and playing fetch, had to make her share the headset after 30 minutes lol.\n\nHelpful | 4", "Sydney_RobsterJul 27 at 4:18 AM\nBojo is soooop cute\n\nJust play this already. Lot's of different fun interactions to be had with Bojo. It's so uplifting. Also good as a short app for demonstrating VR to a frien.\n\nHelpful | 2", "BrilliantLadyJun 27 at 3:51 AM\nShort fun game for kids\n\nFor free, the price is right. There's about 10-20 minutes of game play here, looking after a virtual pet. The graphics are lovely, the game puzzles are simple to solve, and there's nothing here to scare anyone older than 3 years. Good short game to show off VR to young kids, or for a spot of relaxing fun. Not a lot of replay value, but enjoyable while it lasts.\n\nHelpful | 1", "No3vA9 days ago\nGood vr demo\n\nAnd freeeeeeee!\n\nHelpful | 0", "MinshsmithJun 21 at 2:51 AM\nCute fun little game\n\nOk so he scared me at first. But then you have to problem solve and feed the little guy and he is actually a cutie.\nIt could easily become a larger game but is great for a freebie as is.\n\nHelpful | 2", "jkaz04Jul 15 at 7:48 PM\nThe best demo experience EVER!\n\nWOW! Nothing can beat this amazing demo. Bogo is the most adorable virtual pet In VR. When I first played it it was fun. The ending made my jaw drop.\n\nHelpful | 1", "zacksta97Jun 11 at 1:16 AM\nIts good\n\nIt is good. Its exactly what it describes. But I just with you could move and spin with the controllers rather than turning fully in real life. I dont often have the room to play so I stay sat down but you can not turn around in game without doing so in real life too. Would be much better if I could turn with joystick.\n\nHelpful | 1", "ella.artisJul 14 at 12:55 AM\nWow!\n\nI love it when u can choose the color on him but... It's a little story and then u just play till Ur bored\n\n\nHelpful | 0", "HolierThanAllMay 22 at 12:49 AM\nWow, so wish there was more to it!\n\nThe title says it all. This experience (not a game) was absolutely amazing. I found myself playing with Bogo and actually talking out loud to him as if he were my real pet. It felt almost real when you reach down to pet him. Playing fetch with him was pretty neat. It feels like a real emotional connection with this fella, and my whole family wanted there to be more. Developers, please come out with a paid expansion for this. We will buy it for sure!\n\nHelpful | 2", "PadiwonApr 6 at 12:58 PM\nAmazing !!\n\nAbsolutely brilliant! The cutest creature experience... download for sure !! Great for kids!! Ps: I wish this was like a tamagotchi and I had to feed him so often and come around to play and stuff.. and save the game... See Bogo grow and change... The environment too.. beautiful \n\nHelpful | 14", "ConnacemoxJul 11 at 3:33 AM\nReally enjoyable\n\nIt is a cute free game which makes you feel good.\nThe ending is very wholesome.\n\nHelpful | 0", "MasterDecoySGJun 25 at 10:05 PM\nFun distraction\n\nPros:\nIt's free - the price is right\n\nWell animated - the creatures eyes and movements are very well done, it's face just oozes personality\n\nCons:\nIt's very short - there's about 20 minutes maximum worth of content, you're probably not going to replay this title after finishing either, nor will you probably show your friends.\n\nRedundant - It doesn't teach the player any new mechanics that first steps didn't already go over (with the exception of teleporting)\n\nOverall:\nLook, unless you're getting this for your kids (though how long it would hold their attention is anyone's guess) you'll install this, play and then uninstall.\n\nThere's nothing to lose from trying it except a minute amount of time.\n\nHelpful | 1", "TheSpyHunt3rMay 29 at 2:31 PM\nGreat Starter Experience for Kids\n\nThis is a short app, but as a free app, it is a great experience for first time Quest users, especially for younger ones! There are several fun things you can do while interacting with Bogo including some \"secret\" surprises to discover as you go along.\n\nHelpful | 1", "cuphead50kFeb 24 at 10:59 PM\nGreat pass time\n\nIf your like me, i get bored a lot, and quick. While browsing through the oculus store i saw this and said, ah, why not and installed it. Blown. Away. Graphics? Amazing. The experience is short, but a great pass time. Install now, save for a rainy day. If you dont enjoy it, its free, so, nothing lost nothing gained.\n\nHelpful | 50", "dnlmMay 25 at 12:27 PM\nMy daughter loves it :)\n\nGreat relaxing game/experience, my daughter really loves it. Are there any plans to implement hand tracking? That would make it so much more accessible for young/new vr players :)\n\nHelpful | 1", "sharon816May 3 at 11:14 AM\nPerfect for Newbies, Slowbies & Kids\n\nThis is super for little kids. Cutest little guy to help Newbies and Slowbies like me. Brand new and trying to learn what the buttons do. It's nice slow pace for me, my fingers don't always comply with what my brain tells them to do.\n\nHelpful | 2", "chuck.poistMay 17 at 1:50 PM\nAwesome\n\nAwesome game. Wish it was a little bit more to it though. My kids love it \n\nHelpful | 4", "elixirflaskJun 22 at 9:43 AM\nRefunds?!?\n\nI am disabled and thought this game would be a great way for me to get acclimated to the Quest I was last Christmas gifted, however IT IS NOT FUN, and there's very little longevity to playing this, as you soon run out of things to do, and there seems little point to doing the same few things over & over again, with nothing to really ever accomplish. It was a good way to show off what the Quest was capable of, but likewise, once you've done everything, what few things there are to do, it's just continued boredom with no longevity of interest. I'd like a refund, but can't seem to get one, and I'm pretty sure that I've not played this title for very long, or ever will, for that matter.\n\nDevs, or SOMEBODY at Oculus, please check my stats on this game and credit me back the purchase price, as it will be getting soon deleted, and never reinstalled again.\n\n\n\nHelpful | 1", "legitjr22Jun 9 at 9:19 PM\nGood but could be better\n\nWhen I got the quest I got this game at the begging it was boring when I got to the ending I regretted installing it not gonna lie it was fun\n\nHelpful | 2", "CoolcatmanJun 20 at 8:14 AM\nGood\n\nPet game\n\nHelpful | 0", "snowfaire22 days ago\nYour very own Stitch!\n\nIf youve ever wanted your own cute little alien dog to play with, like Stitch from Lilo and Stitch, this app is for you! Great value for free. Its good for kids, but Im a 31-year-old adult who likes horror games and I liked this (:\n\nHelpful | 0", "allfather666May 13 at 12:10 AM\nMy kids love it\n\nFive stars from my kids, they are in awe Everytime they play this game :)\n\nHelpful | 2", "GenPrincess883 days ago\nSuper cute, kid friendly\n\nI could play this all day. My 8 year old daughter loves it, she is too short to grab the apples but loves playing with the little dragon\n\nHelpful | 0", "JohnnycharrMay 7 at 6:59 PM\nNeat game!\n\nGreat for the kids and as a demo at parties!\n\nHelpful | 3", "virtuality2Jan 12 at 7:42 AM\nAdorable\n\nMy little girl absolutely loves bogo. Can hear her chatting away like it's a real pet. Graphics are great and mini games are entertaining. She just rushed into the kitchen and said \"dad quick come and look, I've just found a picture under the stove\". Very cool idea from the creators. I'm a carpenter and often sign my work in hard to find places.\n\nHelpful | 85", "Dinosnake7613 days ago\nSo much wasted potential\n\nThis game was something I found and thought was like an adventure game. You got to go on adventures with your pet and it followed you around. Nope... Its just a pet simulator... All the cool buildings and towers nearby would maybe make some cool lore for Bogo. I was disappointed to also see that the leave button resets your progress. Good for children, boring for older kids/adults.\n\nHelpful | 0", "Alexl342Apr 9 at 5:21 PM\nMeh\n\nThis is an alright game for anyone who doesnt have a pet. Its short, sweet, and to the point. But I have one problem with this game: the dinosaur is straight up ugly. I dont like to look at his face. We all have opinions and you may think hes cute. But to me, hes just hard to look at. This game is ok otherwise. Not much to do, I got bored a few minutes in. Great for anyone who cant have a pet.\n\nHelpful | 4", "HillFamily0511May 16 at 2:13 PM\nCute!\n\nThis is a cute game but to short, I would love to see more added to this game or possibly a upgrade for more gameplay passed what is already in the game. I would also love to see a possibly to save the game.\n\nHelpful | 1", "shin.zhangMay 26 at 8:56 PM\nmy no.1\n\nlove it\n\nHelpful | 0", "Garth80Mar 1 at 7:58 AM\nSuch a good game for my kids!\n\nIt's free too... My daughter played until the battery was dead. So emersive and entertaining.\nI hope they bring out more updates on this, maybe multiplayer option would be great for siblings to play together\n\nHelpful | 7", "peterxingMay 20 at 5:33 PM\nAmazing\n\nAnd soo cuute\n\nHelpful | 1", "JaimeVisserApr 9 at 4:29 AM\nGreat value!\n\nThis is a fun little VR tamagochi. Nice environment and interactions with the cute little dragon. Not a lot of replayability but I can imagine kids would really enjoy.\n\nHelpful | 1", "ajmurrayuk16 days ago\nGreat free pet game\n\nGreat intro to VR with mini games. Surprised it is free!\n\nHelpful | 0", "Mark-BlissJan 26 at 8:49 AM\nWonderful game\n\nThis game is at the highest level of cute. Its a great game to learn and master the controls of the quest controllers. Bogo is a very adorable little pet who you can throw sticks for and cook food and a little side games come up. Wonderful game for a little kids, adults and the elderly. Just sit down with Bogo and have a nice time. Definitely worth the download\n\nHelpful | 9", "atlas57Apr 11 at 11:33 AM\nGood game\n\nWish there was a way to save progress.\n\nHelpful | 2", "MasterGameGuy1Jul 11 at 9:59 PM\nMy sister will love this\n\nI have a young sister and a dog and I really want to teach her what treating a pet should be like. I dont have a quest yet but I hope this can help her!\n\nHelpful | 0", "KieranCollinsMar 21 at 2:27 AM\nCute\n\nIts a pretty cute game and I think it is great for first time VR users to help them into it to sort of learn the ropes. I personally havent finished it yet, I moved onto games I purchased, but from what I played it was pretty decent. I felt like I was playing a Nintendo DS pet game in real life. It was decent.\n\nHelpful | 2", "JacobyAZApr 24 at 10:29 PM\nCute for kids\n\nKiddos think its adorable.\n\nHelpful | 1", "BigJoeyJoeJan 29 at 8:29 AM\nCute experience especially for a child\n\nI downloaded this and played around with it for a bit. It isnt something Id play a lot but it was really fun. Like getting to be a little kid for a bit. If I had a child or young siblings, I think they would love this. My teen siblings thought it was cute too.\n\nHelpful | 2", "jeremy.ampeDec 26 at 9:14 AM\nHours of fun\n\nFrom the developers description I thought it would be a limited experience but there are a lot of mini games and my kids have been playing it for a long time. Maybe they just really want a dog?\n\nHelpful | 22", "TheLordtex20Jan 6 at 10:26 AM\nLoved it!!\n\nThe game was super fun and cute but quinda short and I was playing messing around and(this Might be a spoiler kinda I dunno)then I put my head were the brush and the stick and the coking pot was and I think its was a photo of the studio that made the game and I loved it,it had a little nice though\n\nHelpful | 5", "KawaiiShortcakeJan 29 at 10:57 PM\nGood For Kids!!\n\nThis game is so cute, so simple, and SO FREE!! It's the best way to introduce children to VR without overwhelming them with complicated controls and buttons. Even I (a childish adult) loved this game! It was so cute.\n\nHelpful | 3", "PorchyMar 8 at 9:30 AM\nDaughter loves it\n\nAnything that makes my daughter smile this much is a winner in my book.\nVery short but super cute\n\nHelpful | 1", "IronboynjFeb 19 at 3:48 PM\nOne time game\n\nYou can only play this game once and thats the first time you unlock everything, after that nothing is exciting and the mini games get really boring, but great graphics!\n\nHelpful | 6", "ethanthewizJul 24 at 6:06 PM\nCute\n\nIts a nice little experiment\n\nHelpful | 0", "amjad.barhoumehMar 20 at 5:36 AM\nAmazing for kids\n\nMy little girl loves it\n\nHelpful | 1", "MysonaaricMar 3 at 11:06 PM\nKid friendly\n\nI played cuz of boredom but wow. I was talking to it and scratching it. We had fun. My son gonna love this\n\nHelpful | 1", "kaos_nightmareJan 26 at 7:26 AM\nKids cant reach apples!\n\nSeems charming, but I was hoping my younger kids would be able to play this and theyre not able to reach up to the apples in the tree.\n\nHelpful | 4", "oliviaescobarMay 22 at 6:34 PM\nGreat for little ones\n\nMy 5 year old daughter absolutely loves this game wish the handles where made made her size so she can actually pic up the items. I had to help her on the hand part. Best part its free.\n\nHelpful | 0", "offaxis53Jan 20 at 12:34 AM\nPerfect for young kids!\n\nMy twin 5yo daughters love this so much. I was originally sceptical that they'd be able to use the quest at all, but - while they definitely need to be carefully supervised while using it - they took to Bogo like fish to water. Honestly, it was startling to see how quickly they were able to start using the interface: making food, for Bogo, throwing sticks for her, etc. If you do try this with a young child, I'd recommend solving the first puzzle yourself though, as it requires picking an apple from a tree that's too high for them to reach. Also, I suppose it's obvious, but casting to a phone/tv while they have the headset on is essential so that you can help out if necessary.\n\nAll in all, great fun. Awesome work!\n\nHelpful | 1", "TheThorpeFamDec 31 at 7:50 AM\nSuper cute\n\nThis is a super cute game. The graphics are great and both I and the kids were overcome by the cuteness of bogo. Super simple game for beginners or kids to be able to play. I wish you could go further into the world, but its still fun and cute to play.\n\nHelpful | 2", "925aonraOct 9 at 6:04 PM\nExcellent intro to VR / great for kids\n\nIt's a very sweet, easy to figure out experience. It has enough to keep most adults interested for about 30 minutes or so. My five year old on the other hand, absolutely loves it! He asks if he can \"play with his pet\". One tip for smaller ones (admittedly that doesn't work every time): Make sure Bogo is not running in the background (i.e. completely quit out of it). Sit down on the ground in the middle of the play area. Reset the Guardian, but keep the goggles as low as you can while you set the floor height and draw the boundaries. I've found that this often lowers the height of things in Bogo so that might five year old can reach them.\n\nHelpful | 55", "SynarchyJan 10 at 9:59 PM\nAmazing\n\nSo much fun gave friends who wee just starting VR this game as a recommended and they loved it the graphics are great and the ending is amazing\n\nHelpful | 2", "soulseeker13Jun 22 at 9:49 PM\n\ni have no idea how to move LOL\n\nHelpful | 0", "andrew1431Oct 13 at 6:48 PM\n\nMe as a boring adult male: Played for 2 minutes. This game sucks wtf is the point?\n\nMy friends 5 year old: Played for 4 hours cooking the same meal over and over, with a grin from ear to ear the entire time, petting, playing fetch. I would have paid money just to see how much joy it brought her. She got a little TOO attached to the animal though and is begging me every time I see them to pull out Pupppyyyyy\n\nGreat showcase of what the system can do. Super intuitive controls and I like that it scales to your play space so that you can physically walk around to interact with everything without fear that theyll leave the guardian zone!\n\nHelpful | 29", "rachel.bryan.370Dec 31 at 8:54 AM\n\nI made my little friend blue and called him Blu.\nI love things like this\nNeed a whole game like this please \n\nHelpful | 1", "paperzombiesMar 12 at 10:01 PM\nSO CUTE\n\nI loved the game hes just so cute but its a bit short for such a fun game\n\nHelpful | 0", "Gavitron675Jan 28 at 5:18 PM\n\nIt is so fun\n\nHelpful | 0", "ksenter4Dec 24 at 4:37 PM\nMy daughter loves it!!\n\nThis is so great! More and more content keep coming for the quest. My young daughter loves this! So nice to have free content like this.\n\nHelpful | 1", "themagillmedicsDec 25 at 10:13 AM\nBeware of the Beginning\n\nThe little monster at the beginning is quite startling. The scene starts out a bit dark and the monster thing comes out from around a corner. Do just assume it wont scare you child as I did.\n\nHelpful | 6", "Gypsy_StarJan 4 at 8:07 PM\nmake this longer\n\ni want this to be continious.... i have no pets but enjoy this little guy.. please make it into a game you can walk around in and continue bonding with bogo...\n\nHelpful | 1", "LEG4CYJan 17 at 5:26 PM\nHi Alina gg on the game\n\nGg Alina- is Conner\n\nHelpful | 1", "PeteyPakDec 16 at 3:23 AM\nExcellent intro piece\n\nEasily six stars out of five as a game/experience to show children and grandmothers. Like everyone else here the only thing to want is more!\n\nHelpful | 1", "TheBlondeBombshell14Nov 17 at 3:58 AM\nSuch a cute game, didn't stop smiling!\n\nGreat introduction to vr, detailed game, good graphics and bogo is the cutest little pet. Really need to create more games like this where you look after animals because it's so interesting. Just wish it was a bit longer but a must download for free!\n\nHelpful | 3", "Real_ConcraftNov 30 at 5:28 PM\nGreat But Short\n\nI really like the game. Like a lot. I can clearly tell it was just a sort of demo thing, but Id love for there to be a full version of this for us to play.\n\nHelpful | 3", "davidtshDec 19 at 11:17 PM\nVery cute\n\nGreat experience\n\nHelpful | 2", "OrcaLover217Dec 11 at 9:34 PM\nAMAZING!!!\n\nAfter a depressing day I love coming home and seeing my creature. They always cheer me up and all my worries and troubles seem to just melt away.\n\nHelpful | 0", "bubeezNov 26 at 11:15 PM\nSo cute!\n\nI plan on using Bogo to show others VR for the first time. My wife was concerned VR would trigger her vertigo or make her nauseous but neither of those things happened and she absolutely loved playing it with Bogo.\n\nHelpful | 0", "SpiralKingRyukApr 3 at 5:18 PM\nFirst\n\nThis was my first and favorite introduction to vr\n\nHelpful | 0", "VincentVelthuizenNov 21 at 3:12 PM\nGreat showcase\n\nThis is one of my go to showcases of the system. Not only is it a fun way to experience VR, sometimes for the first time. It is also great to watch someone go through it (while waiting for your turn...)!\n\nHelpful | 1", "HezzruNov 7 at 9:55 PM\nGreat for kids!\n\nCute game. Intuitive controls. Very great with kids! Could be fun for grandmas?? It doesnt have a lot of meat to it but I think the throwing fruit the hoops part is fun. You could also use this as an intro to VR for those that likes cute pets.\n\nHelpful | 0", "WudixiaoguaiNov 3 at 12:58 PM\nProgress not saved!!\n\nIs there any way to save progress? Every time I come back the poor little thing is back in the rain. I set permission to use storage already, I tried to quit from the game or oculus button, nothing works!\n\nHelpful | 12", "invisibledig266Dec 4 at 6:11 PM\nKids love it!\n\nIts more of a 15 minute tech demo, but cute none the less!\n\nHelpful | 1", "adam.wilson.5817Dec 1 at 12:39 PM\nKids love it!\n\nMy kids ages 7 and 5 love this game and it's easy for them to play on their own!\n\nHelpful | 1", "MoneybagvrNov 8 at 6:34 AM\nIts free\n\nIt's free and fun perfect for people just wanting to try vr\n\nHelpful | 3", "alsantourSep 1, 2019 at 1:05 AM\nMy niece LOVES it!!\n\nThis was one of my 10yo niece's very first VR experiences, and she loved it and played it for a couple of hours so far, although she has gone through the whole content of the game a few times over by now, she doesn't seem to mind and still asks me if she can play BOGO again! I personally wish there was a bit more content and hope there will be an update or expansion soon! Definitely a must try experience on the Quest especially for the younger audience!\n\nHelpful | 8", "CasualCheetahSep 3, 2019 at 9:20 AM\nAbsolutely Worthy Trying and Sharing \n\nAn adorable game that's perfect for sharing with friends and family. Its generously free and makes for a very comfortable extended introduction to VR. Having such a cute, approachable application to show people theres more to VR than the delightful yet short and gimmicky Quest tutorials is a much-appreciated addition. Bogo is wonderful to interact with and I'd love to see the concept of a VR pet-simulator taken further. Just imagine, all the fun of owning a dog without the smelly inconveniences.\n\n(Keep in mind that the game works best with a fairly large boundary. Those unfamiliar with VR can find teleportation jarring and room-repositioning disorienting.)\n\nHelpful | 21", "WVbrUNov 10 at 8:01 AM\nAwesome free experience!\n\nI showed this to a group of grade schoolers and they loved it! Cool idea, simple controls, and a cute dino thing makes it perfect for introducing kids to VR.\n\nHelpful | 1", "watermalone1Mar 17 at 10:35 AM\nYeet\n\nBogo is really cute\n\nHelpful | 0", "olivierccNov 17 at 4:50 PM\nCute\n\nVery cute. It's short, it will only entertain you for 10 minutes, but hey it's free, so can't complain\n\nHelpful | 0", "RexBladeJul 31, 2019 at 9:32 PM\n\nThis mini-game is a great example of what can be done with VR. My 4 year old loves it. HOWEVER, it could be so much more -- Hopefully, the developers are watching this page -- I was curious will there be a more complete \"Bogo\" game or update? I would like to move around more, have support for shorter children, and of course a few more activities with bogo.\n\nSo, just looking for updates on this game? Will there be any? Or is it dead code?\n\nHelpful | 22", "HavocfywMar 29 at 2:00 PM\nMy daughter loves it!\n\nIt's cute! It's easy! It's free! Perfect for kiddos and pet-lovers.\n\nHelpful | 0", "DiegoFox69Dec 26 at 10:09 AM\nbad and cute\n\nIts really cute but it doesnt save\n\nHelpful | 1", "Seniorgamer059Oct 23 at 8:16 PM\nSo cute\n\nVery good lifelike actions. Love being able to pet Bogo. Very sweet! Can play fetch, feed him and play games. Any child would love this! Even some grownups!\n\nHelpful | 3", "OculusQuestFunOct 28 at 5:57 PM\nThe Begginer Game\n\nI use this as THE introductory game for anyone I have try out my Quest. Great use of roomscale. Good tempo and just fun.\n\nHelpful | 2", "uzumki_kid_11Nov 6 at 5:59 PM\nVery fun\n\nThis game is good for all ages and its really fun to play with bogo hes super cute\n\nHelpful | 0", "VRLoungeAlamSuteraNov 5 at 7:56 AM\nNice!!!\n\nVery nice quick experience, this is especially usefull for those new in VR\n\nHelpful | 1", "QuakehunterOct 19 at 2:46 PM\nNot bad\n\nShort, Sweet, and best of all free! Pretty nice intro to VR with the mini games, Also I found the portrait Easter Egg.\n\nHelpful | 0", "meandrozJun 2, 2019 at 1:55 AM\nheight requirements are ridiculous\n\nIt's a wonderful introduction into vr. Officially suited from 3 yeas and on. However my kid can't play it because she can't reach all the places. She can't reach the apple. Nor can I let her draw a guardian. Casting does show the guardian. Nor can she read the messages. An age rating should include height requirements or allow adjustment.\n\nHelpful | 65", "xendarqSep 29, 2019 at 7:56 PM\nFun Demo\n\nCan't fault it in any way as a free demo. Really showcases the potential for emotional engagement in VR. I only wish there was more, as I'd love to explore this world.\n\nHelpful | 2", "Rocky2910Oct 4 at 8:34 AM\nAmazing\n\nI wish it was longer and more of a game than a demonstration\n\nHelpful | 2", "tiknat37Nov 9 at 8:59 PM\nTo bogos developer\n\nI can't download it by my phone, it's stuck\n\nHelpful | 2", "CptSedatNov 3 at 12:48 AM\nBogo not storable\n\nGame is nice. But you start everytime at begining. not storable. Thats Bad.\n\nHelpful | 0", "hannah.connell.5283Sep 29, 2019 at 7:56 PM\nLove wish there was more\n\nGreat game overall but wish I could do more and it had more things to do and explore\n\nHelpful | 0", "LittleGideonSep 30, 2019 at 5:13 AM\nADORABLE\n\nGreat starter game didnt want to leave little bogo when I finished the game\n\nHelpful | 0", "ray.bradshaw1Sep 29, 2019 at 2:19 PM\nGreat free game\n\nIf you have kids they will love this I am 65 and still Impressed\n\nHelpful | 0", "GollyPepSep 29, 2019 at 8:13 AM\nSo Cute\n\nWhatever the BoGo is he is so cute\n\nHelpful | 3", "PixaniJul 29, 2019 at 7:48 PM\nFree and fun starter game!\n\nFirst, I found this most fun when I had a lot of space to freely test walking around in virtual reality for the first time. I recommend playing it in an environment of at least 6x6 for a more immersive experience.\n\nBogo is an excellent test environment, so it was a fantastic idea to include it with the Quest starter lineup. It really helped show me what the Quest can do with freely walking, reaching and generally interacting with an artificial environment and AI in 3D for the first time.\n\nShout out to the team of Bogo for that awesome and touching easter egg, btw. I was just experimenting when it suddenly was discovered, and I actually wanted to sit there and study the proud faces of those who brought this idea and all its elements to reality. Thanks for helping me learn vr and the Quest in such an engaging way.\n\nIts a short but memorable experience and one I found myself coming back to despite Bogo not remembering me. I think if this was a full scale game where a creature and I explore the world and interact together in a similar fashion for a lasting experience the creature remembers, Im pretty sure Id have to buy that in a heartbeat!\n\nHoping to one day see a from the team who brought you Bogo ad for a full game.\n\nHelpful | 5", "Hawat1Aug 11, 2019 at 6:49 AM\nThank you Oculus Studios\n\nWhat an adorable game. It brings the inner child out of adults and children just love to interact with the little guy. All delivered in a very polished experience which actually makes you forget that you are in a virtual world. Well done Oculus. Thank you for this gift !!\n\nHelpful | 3", "ornerybuddhaAug 7, 2019 at 12:51 PM\nDelightful!\n\nI found this totally engaging. Bogo totally hooks you in and you'll find yourself trying to talk to it and seeing how many interactions you can have. To that end, it's not very long and I found myself wanting to play with the little creature longer than I expected. I felt a little sad to log out! It would be great to do an update and maybe increase the interactivity, have it respond to your voice, even if it's just tone, and things like that. This feels like an opportunity for some creative developer to come up with a persistent pet, maybe you get to pick it out at \"the pound\" periodic updates and such to keep it fresh. Like a virtual tomagachi!\n\nHelpful | 0", "kev.chase.94Aug 26, 2019 at 11:04 PM\nBogo\n\nI would like a bogo 2 vr game where you can move around more pick up bogo and hold him play more games and maybe draw or something.\n\nHelpful | 7", "bukketboiAug 28, 2019 at 3:32 PM\nAmazing!\n\nIt is so cute! I also helps with learning how to train a real pet. Bogo is probably the best pet out there. Love your game! Especially the free price for such a great game.\n\nHelpful | 1", "JusMonikaOct 3 at 6:47 AM\nIt's Good Fun But...\n\nI Can't Accuatally do anything because I don't have enough space to reach anything.\n\nHelpful | 5", "thegabeSep 15, 2019 at 7:19 AM\nI hope they add depth to this\n\nI know it's a demo, but the concept is great!\n\nHelpful | 2", "SoggySaussagesJul 10, 2019 at 9:14 PM\nHow is this free???\n\nThis game is absolutely adorable and strangely addicting! I find myself sitting in front of the cooker cooking snack after snack after snack, just for the sake of it. Great to brighten up any gloomy day or any already great day! I would happily pay $12 for this game, how is it free? This game is waaaaaay better than fruit ninja vr, AND its $16 cheaper! Love it!!!\n\nHelpful | 10", "Si_morrisAug 27, 2019 at 1:54 PM\nYes!\n\nMy girlfriend said no to playing this, she said it looked stupid...then she played it for an hour straight and loved it. Says it all.\n\nHelpful | 0", "vapor.wave.studioJul 27, 2019 at 4:49 AM\nTall problem with kids...\n\nChildren under 1.5m can not take the fruits to start the game and can not enjoy the full experience, please give more food options at the beginning so that they can start alone.\n\nHelpful | 16", "thisisatestkiddoAug 10, 2019 at 1:02 PM\nVR Tamagotchi\n\nThis is basically a VR Tamagotchi. I thought I would be bored within 5m, but something weird clicked in my reptilian brain when playing fetch, washing, or giving this figment of digital imagination a belly rub. It was like meditating in the park with a dog. After a while, I wasnt bored, so much as wishing there were more to this world. Perhaps an extension to this with more terrain to explore, or some kind of adventure...I would go on one with this little guy. Its adorable and perfectly suited for kids, or the kid in you.\n\nHelpful | 1", "WillowtheoverlordAug 9, 2019 at 4:04 PM\nReally cute!\n\nThis VR game is actually really fun! At first I thought this looks like sh*t but when I tried it I LOVED it! Definitely give it a shot if youre sceptical Im sure youll like it :)\n\nHelpful | 0", "GrrThorSep 14, 2019 at 1:20 PM\nYou get what you pay for\n\nIt is amusing for a few minutes, but quickly becomes boring. But since it is a free app, it is worth a try. Just don't plan on devoting much time to this one.\n\nHelpful | 1", "theroundaboutJul 1, 2019 at 3:48 PM\nI Love Thid\n\nThis was the first game I played when I got my new quest. It's a great way to learn how to use the controllers and get accustomed to VR.\n\nThe only problem that I have with this game is that it's too short. I really wanted to explore the environment. With more content this could easily be my favorite game.\n\nHelpful | 9", "Platonic_SpelunkerJun 27, 2019 at 4:46 AM\nA demo by any other name's just as sweet\n\nFirst off let me say that this was the First VR game I played on my new Quest (after the \"First Steps\" app, of course); I thoroughly enjoyed my first two playthroughs. The graphics are bright, cartoonish, and entirely serviceable given the hardware on the quest. The minigames are intuitive. The dessert cooker is a fun mechanic. The monster is energetic and cute. The problem is, those two playthroughs lasted all of an hour, combined:\n\nThis isn't actually a full game; it's a vertical slice demo for a Tamagotchi-type game akin to the Chao Garden levels from the Sonic Adventure games for the Dreamcast or the Monster Rancher series on the PS1 & PS2. The ideas are clearly there:\n\n- Attract various creatures with treats/food/toys\n- Care for their bodily needs as they grow/age\n- Train their stats by playing minigames\n- Complete cooperative skill challenges and tournaments\n-Repair ruins to unock additional altars/areas\n- Acquire raw ingredients to cook special desserts/potions\n- Change to diet changes attributes/size\n\nI'm giving this three stars because I was entertained for an hour for free, but don't be fooled into thinking there is anything here for you in the long run. That said, I want to end on a positive note:\n\nI really hope the developers finish this game. Once it's published, I'll definitely pick up a copy. Well done, people!\n\n3 stars, mostly for false advertising. This really should have been labeled as a demo.\n\nHelpful | 9", "obsouleteJul 16, 2019 at 9:06 AM\nGreat pet simulator experience\n\nWas quite entertaining for a free experience, and for the ones complai bgg ing that it's short and is not a game , but a demo. New flash they never said it was a game, as everybody else noticed it's a simulator experience. I would although like to see them expand this into a game or developer a simulator game with variety of pets and maps to build as you play with your pet in same manor as Bogo. Anyhow great work dev team keep st it!\n\nHelpful | 0", "chaypaltonMay 24, 2019 at 2:12 AM\nFun for all introduction\n\nA just play when you first get your Quest, super comfortable, graphic look great, the game unfolds as you play with your pet. Nice introduction to room scale VR. As you have a small area to roam in while interacting with you alien friend.\n\nHelpful | 17", "NightmareFuelMay 21, 2019 at 6:28 PM\nSuper adorable\n\nBasically, it's a VR tamagotchi. Hes super adorable! Feed him, play games (fetch, ring toss, keep the fruit balloons afloat), pet, and brush him. He loves belly rubs!!! Watch him grow (he gets big, fast).\n\nHelpful | 235", "Turmanader06Aug 13, 2019 at 7:32 PM\nLove it\n\nMe and friend shes 10 and she was having so much fun she played for 2 hours and wants to play again\n\nHelpful | 0", "joebetlacierdamutiaAug 22, 2019 at 5:12 AM\nSaving\n\nHow to save your progress with this game?\n\nHelpful | 1", "Ben_The_YoungerJul 2, 2019 at 10:35 PM\nCute free game\n\nI paid good money for Moss but I have played this free game much more, always with a big smile on my face! Go figure.\n\nEven though I'm not a pet lover, this creature is the epitomy of cute. And I don't even have to clean up after it.\n\nLovely VR experience. Congratulations to the development team. Impressive and enjoyable.\n\nHelpful | 0", "poe.conceptJul 1, 2019 at 4:35 PM\nMy sisters first in VR and a total riot\n\nAwesome short experience. Fantastic for a semi-gamers intro to VR. Theres a review on here talking about a 3 year olds inabikity to play the game, and the game advertising 3 and up. The reality of Virtual Reality is that it is verh clearly not recommended for individuals under 12 years of age. The headset box says so.\n\nHelpful | 2", "bigftamAug 22, 2019 at 7:40 AM\n\nvery funny!\n\nHelpful | 0", "davereynoldsJul 21, 2019 at 7:35 PM\nCute\n\nThis is a fun little game to play. Interacting with the little creature,which I named mine Draco, is a nice touch. It's free so go ahead and give it a try.\n\nHelpful | 1", "KreedumsJul 29, 2019 at 6:44 AM\nShort, but great freebie\n\nBetter than some games I paid for! Heart warming and fun experience. This is my go to for introducing others to Oculus.\n\nHelpful | 0", "Zeldon567Jul 27, 2019 at 6:38 PM\nAbsolutely charming\n\nBogo is a fantastic pet simulator that will make you feel like you're petting and playing with a real creature.\n\nHelpful | 2", "darwins.lastJul 21, 2019 at 9:53 AM\nFun for Kids and Adults\n\nMagical cute pet. Fun things to do together. Relaxing and makes you smile. Short but great. My kid loves it\n\nHelpful | 0", "DoomPhantomMay 25, 2019 at 12:50 PM\nAwesome world\n\nMy only gripes about this experience is that I find with too many games, lack of full locomotion and smooth turning. I understand wanting to show off room scaling, but for those of us with smaller gaming spaces it makes for a irritating experience. Other than that it was very fun to interact with bogo and see the beautiful environment. It would have been even better if you were able to explore the whole environment instead of being stuck to this small rectangle play space. Absolutely can't best it for the price and would love to see a full game in this world\n\nHelpful | 4", "gem2113May 28, 2019 at 1:34 PM\nSo cute!!!\n\nI love this little dude. Hes my new best friend. I feel really mean every time I leave him because he just looks at me with those big alien puppy eyes!!! Really cool and I would love to see a bigger version of this experience with more things to interact with and to see him grow. That would be amazing.\n\nHelpful | 4", "VR2050Jul 23, 2019 at 8:55 PM\nSo great!\n\nVery entertaining. I love all the animals reactions.\n\nHelpful | 0", "lexzzarre348Aug 21, 2019 at 5:13 PM\nOk\n\nIt okay, I'm probably not the targeted audience.\n\nHelpful | 0", "icmonstersJun 14, 2019 at 3:00 PM\nA wonderful world\n\nThis world that BOGO lives in is magnificent! I assume the devs are already expanding this world and its lore. This could be an amazing story or open world Ark type game. Simple answer, loved it and want more form BOGO world. Cheers\n\nHelpful | 0", "GarayurJun 1, 2019 at 9:48 PM\nAppeasing the Adorable Godbeast\n\nAs you feed, care, and play with this adorable creature he will shift the weather to display his mood, raise the ruins of once great civilizations, and make extremely cute eyes and noises at you. Whether you love him or fear him matters not so long as you serve him.\n\nHelpful | 3", "victor.delmastro.5Jun 27, 2019 at 4:41 PM\nEasy and cute!\n\nIt's a great way to orient yourself in the Oculus Quest VR world. However, I would have liked to have moved beyond the 'patio' area during gameplay. Nicely done.\n\nHelpful | 0", "R3DROOKMay 26, 2019 at 12:29 PM\nGreat Game\n\nThis is a great little game but I wish they had a \"full version\" of this game. The game gives you a short but sweet little experience which will having you begging for more. It would be awesome if they have a longer version where you have to go on little puzzle adventures play mini games and of course take care of you new found companion.\n\nHelpful | 2", "obi2kenobiJun 1, 2019 at 5:09 PM\nGreat to share with small children!\n\nThis is another great \"first steps\" type title that shows off the abilities of Quest while being friendly to newcomers-10/10 on immersion\n\nThis game is also very kid friendly! I let my 3 year old daughter play it and she absolutely loves it. Only problem is she can't reach some things so I use a spare controller and grab it for her using my phonecast as a viewer.\n\nMy one suggestion is add a high score board for the mini games! That would add to the replayability.\n\nI typically like playing the more hardcore game type stuff, but I find any truly immersive experience fun in VR. The scaling play area is well done and innovative - normally your playspace doesn't match the virtual space which can take away from the immersion a bit and be frustrating as the object of your desire is behind a physical wall in reality.\n\nI really liked this game because it took advantage of the roomscale and untethered aspects of Quest. Wish there were more titles like this.\n\nHelpful | 1", "mike.k.kohnkeMay 26, 2019 at 8:10 PM\nAn adorable game\n\nI love animals, so I really enjoyed interacting with this little guy. It's a quick play, but still a lot of detail for a free download. I'm look forward to an expanded version. Bonus tip for guys: If you want to impress a girl, have her play this. She'll be cooing over the baby dinosaur in no time.\n\nHelpful | 1", "Nevic_BorealisMay 27, 2019 at 2:19 PM\nCute\n\nVery adorable, just need to make sure you have to room. I'd give 5 stars if there was a sitting mode or a way to turn with the controller, I have limited space so a sitting mode would be perfect\n\nHelpful | 2", "Firefox187Jun 16, 2019 at 6:27 PM\nFun Game\n\nI like it, but there is a small problem I did not know ( Warning play this in a big area so you dont make a hole in your wall ) other then that graphics are amazing and runs really well\n\nHelpful | 0", "IRobot4EverJun 13, 2019 at 11:54 AM\nNo saving mode\n\nMissing a saving mode. Has a lot of potential\n\nHelpful | 4", "rservelloMay 21, 2019 at 9:10 PM\nA cool intro to room scale vr\n\nThere's no teleporting or floating here. It keeps the play area in your boundaries... You walk around to interact. A really cool intro to room scale VR.\n\nHelpful | 4", "bryce.krychowiakMay 23, 2019 at 11:59 PM\nNEED MORE\n\nHonestly, Bogo is the most enjoyment Ive gotten out of virtual reality so far. Hes an adorable little friend that can do many tricks. The only bad thing about this game is that it is just a tease. Its over before its even started. We need more Bogo and games like it!\n\nHelpful | 1", "Lunafox1Jun 22, 2019 at 8:47 AM\n\nhttps://youtu.be/MeZpqkk8fsE if you want to see the cuteness then here is my YouTube video. I absolutely loved this game. Hope it becomes something bigger\n\nHelpful | 0", "paul.strydomJul 13, 2019 at 2:07 PM\nMagical\n\nAbsolutely magical!\n\nHelpful | 1", "SteveikJun 9, 2019 at 6:06 PM\nGreat tech demo\n\nIt highlights the possibilities with the hardware very well. Grabbing, throwing things, cooking, and playing with your pet are all very satisfying. The night show is also very impressive.\n\nHelpful | 1", "JoshlingJun 1, 2019 at 5:24 PM\n\nThis was more fun than I expected and the creature was great to interact with. My daughter got in and played for quite a while and we had a mini competition going for high score on some parts of it. Worth a download!\n\nHelpful | 0", "polka_pandaJun 29, 2019 at 2:25 AM\nI love this game\n\nI love this games ideas! The pot, the fruit, the character.\n\nHelpful | 2", "SalikenJun 3, 2019 at 12:39 PM\nSo very cute and my husband played it!\n\nAt first I thought... no not for me... but it was for free. I played it and its so cute!!! I actually got my husband who isnt into VR to play it and he liked it! If you like animals install this game!!\n\nHelpful | 1", "argerichJun 19, 2019 at 11:58 PM\nEasy, Fun, and Free!!!\n\nTons of fun for being a free game. Definitely worth a download and great for kids and individuals with cognitive disabilities.\n\nHelpful | 0", "ManMythLegendMay 27, 2019 at 6:12 PM\nImpossible to dislike\n\nWho could hate this? You have an alien dog friend and play wacky space dog games with him. Im a grown man and would defend this tiny animal to the edges of the unnamed planet we coexist in. What are you waiting for??!\n\nHelpful | 2", "Darchangel3Jul 4, 2019 at 1:26 PM\nwhelp...maybe for the kidlets\n\nIf you're already somewhat versed in VR games, you might skip this one. It's perfectly ok, just not for me as it was very childlike. I'd say more for an intro to VR type for the young ones.\n\nHelpful | 0", "moregingerJun 30, 2019 at 6:41 AM\n\nLovely little demo. Well worth loading on, even though it is short.\n\nHelpful | 0", "BossbeastJun 11, 2019 at 12:19 PM\nGreat experience\n\nTip for the person who said his 3 year old couldnt reach the apples....lift her up.\n\nHelpful | 2", "Crazy_SaneJun 2, 2019 at 3:08 AM\nSuper Cute Virtual Pet\n\nThis is a really fun experience that's great for young and old alike. A great way to demonstrate the quest to new users. Lots of effort went into this title, and it's free! Need I say more?\n\nHelpful | 0", "Cathy845Jun 18, 2019 at 10:57 AM\nLOVED IT!\n\nAdorable, fun and easy. Please make more like this available. They are just what I'm looking for. thanks.\n\nHelpful | 0", "oculusnate12May 29, 2019 at 9:36 PM\nOmg adorable\n\nThis was such an amazing experience and I will be able to introduce people to vr with this, Its so adorable when bogo lest you rub his neck and roles on his back like  I want a belly rub.\n\nHelpful | 1", "BornToRollJun 12, 2019 at 6:25 AM\nWant to play in sit Position\n\nSeems so Adorable  but I wish it would be playable in Sit Position for Wheelchair user like me\n\nHelpful | 5", "LamestGamrJun 14, 2019 at 12:05 PM\nOMG Cute\n\nI have played this a few times and feel so emotionally attached to Bogo. It's a great introduction to VR for newbies.\n\nHelpful | 1", "robdoodMay 24, 2019 at 7:15 AM\nSo lovely!\n\nIt's very short. You don't do much in it. It's about petting a little Dino / alien thing. But it surprised me a few times, and is excellent for as a gentler experience for people's early forays to the world of VR.\n\nHelpful | 1", "unskilledjaredJun 9, 2019 at 10:53 AM\nVery fun for kids!\n\nThis game is perfect for kids around the age of 6 and up. My three year old can play this but she can't reach the fruit or read. Lol\n\nHelpful | 1", "Asamichi161Jul 3, 2019 at 5:02 PM\nGood\n\nLOVE it\n\nHelpful | 0", "nbhardwaj01Jun 28, 2019 at 5:00 AM\nGood\n\nGood\n\nHelpful | 2", "DDay619May 21, 2019 at 7:58 PM\nNeat, cute, short, free\n\nIt's free. It's short. It's pretty cool.\n\nHelpful | 4", "ThuginomixMay 24, 2019 at 12:36 PM\nGreat Intro to VR\n\nBogo is my go-to for the first VR experience I use to introduce someone who has no prior experience with Virtual Reality. Its easy, its fun, and highly interactive.\n\nHelpful | 2", "CurlyGirl67Jul 7, 2019 at 5:08 AM\nUhhh. Teleporting?\n\nThe teleportation only worked once for me. I dont know what to do. Apart from that its a great game\n\nHelpful | 0", "toeknee0126Jun 1, 2019 at 6:24 AM\nWhat?\n\nThis creature is cute? That might be a matter of taste. I find it creepy. So I didn't feel compelled to discover much of the game. Not with those eyes starting at me ;_;\n\nHelpful | 5", "troneyJun 23, 2019 at 5:08 PM\nCute\n\nDaughter loved it.\n\nHelpful | 0", "rob_CHJun 8, 2019 at 10:47 AM\nCute\n\nWe love it! Shows what we will hopefully see more of: good ideas, beautifully made.\n\nHelpful | 1", "Lamprey79Jun 13, 2019 at 6:29 AM\nCute, but boring\n\nYou have a virtual pet. You can pet it, scrub it, feed it, or throw it a stick to fetch.\n\nThat's it. Even my kid was bored after about 5 minutes.\n\nCool to try as a first VR experience, but that's basically it.\n\nHelpful | 0", "sfaxoJun 22, 2019 at 6:47 PM\nAdorable pet simulator\n\nHow is this free?!\n\nHelpful | 0", "furtinDec 16 at 12:41 PM\nReally Lovely\n\nGreat demo on how to use space, VR mechanics (like grabbing, throwing, belly rubbing ;-) audio, sense if scale etc.\n\nI like it very much and my wife just loved this!\nThank you!\n\nHelpful | 0", "cunningdaveMay 30, 2019 at 2:41 PM\nClever\n\nAdorable virtual pet. The experience isn't long, but the creature is very lifelike. Worth trying for free.\n\nHelpful | 0", "pyroth309May 27, 2019 at 7:11 PM\nNice little experience\n\nI enjoyed Bogo and it's a fun little experience that's great for showing off the capabilities of the Quest to friends and family.\n\nHelpful | 1", "Speizer1May 24, 2019 at 11:42 PM\nso much fun!\n\nBOGO is very cute and a very fun experience interacting with BOGO and the world. very immersive. Great for children and all ages.\n\nHelpful | 1", "CanidooSep 16, 2019 at 4:19 PM\nBOGO evil\n\nOMG BOGO will kill us at 3 am am, no joke..HELP ME DEFEAT HIM.\n\nHelpful | 44", "SuperBonJun 4, 2019 at 12:09 PM\nTeleport\n\nWhy the teleport not working anymore after I update my oculus app. Now I cant reach the item behind my physical wall\n\nHelpful | 5", "galvanizedgazelleMay 22, 2019 at 9:46 AM\nPerfect demo\n\nWe NEED a full virtual pet game on the quest, this made me SO happy\n\nHelpful | 7", "el_jergasMay 24, 2019 at 8:08 PM\nVery nice\n\nAfter the two introductory apps of Oculus (first steps and Oculus First Contact), this is the perfect next step.\n\nHelpful | 1", "davidro14Jul 2, 2019 at 7:13 AM\nFunny then boring\n\nFunny for about an hour, then repetitive and boring.\n\nHelpful | 2", "mhstnscMay 24, 2019 at 3:41 PM\nAnimal was scary for my kid\n\nMy kid is 10 but she could not take the game, IMO the animal is oversized and also alien. Can't we have some cute ones?\n\nHelpful | 6", "marcalangriffinMay 23, 2019 at 2:09 PM\nSimple, cute and fun\n\nYou will treat Bogo like your real life pet. Or else ;-)\n\nHelpful | 1", "Milk_BoiMay 29, 2019 at 10:58 AM\nAwesome\n\nLike having a really neopet\n\nHelpful | 1", "dariuszdziewa1984Jun 1, 2019 at 9:17 PM\n\nOne word... Wow !\n\nHelpful | 0", "zaignerAug 31, 2019 at 2:26 PM\nBruh\n\nBruh\n\nHelpful | 1", "poetic_is_hereJun 2, 2019 at 3:11 PM\nJust Ok.\n\nimpressive but just ok.\n\nHelpful | 1", "tgtv_fireJun 12, 2019 at 3:50 AM\nSuper cute\n\nIt's a alien acting like a dog its very cute I like it and the mini games it gives you\n\nHelpful | 3", "bo_yangJul 9, 2019 at 10:11 AM\n\nIn the game,I can not see my hand. Please tell me,why?\n\nHelpful | 1", "OKCSKYJul 8, 2019 at 1:07 PM\n\nCool game.\n\nHelpful | 2", "SikhnDestroyJun 18, 2019 at 8:19 PM\n\nCuter than Henry\n\nHelpful | 1"]