{"App Title": "Bonfire", "App description": "The latest animated short movie from the award-winning Baobab Studios.  In Bonfire, you play the lead role in an interactive narrative. As Space Scout 817, youre on a mission to discover a new home for the human race. Too bad your piloting skills lack precision. You crash-land at night on a mysterious unknown planet three-hundred light-years from Earth. Your only source of light is your makeshift bonfire. Beyond its glow everything falls to darkness. And what are those strange noises coming from the alien jungle?\n\nTo survive you only have your instincts and robot sidekick, Debbie, voiced by Ali Wong. Debbies companionship comes with a signature wariness. When a chance meeting with a local inhabitant further steers your mission off course, you learn that unexpected encounters just might result in lasting friendships. Youll have the opportunity to embrace, explore and influence the world around you. In the end, the choice is yours: Will you follow your captain or your conscience?", "Purchase section": "$4.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Casual, Movie, Narrative", "Languages": "English", "Version": "1.0.466", "Developer": "Baobab Studios, Inc.", "Publisher": "Baobab Studios, Inc.", "Website": "http://www.baobabstudios.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "current page:\nhome\nprojects\ncompany\nabout\ncareers\nnews\nstore\ncontact\nBaobab Studios is the leading Interactive animation studio. \n\nOur mission: Inspire you to dream by bringing out your sense of wonder. We make YOU matter. We will immerse you in fantastical worlds, introduce you to characters to fall in love with, and let you interact with these characters.\n\nPROJECTS\nThink of Baobab as the Pixar of VR.\n Business Insider\nAims to Combine Elements of Animation and Video Games to Create Interactive Stories\n The New York Times\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nBuilding the Next Generation of Narrative Movie Content\n TechCrunch\nNEWS\nApr 30, 2020\nExclusive: Baobab Studios and John Legend Release When You Can Fly Music Video\n \nJan 25, 2020\nAnnie Awards 2020 Winners\n \nJul 5, 2019\n2019 Daytime Emmys: Crow: The Legend Tops Animation Categories\n \nJan 1, 2019\nThe World's Most Innovative Company 2018\n \nApr 20, 2017\nIs VR Studio Baobab The Next Pixar?\n \nOct 18, 2016\n20th Century Fox Just Poured Big Money Into This Hot Virtual Reality Startup\n \nOct 18, 2016\nBaobab Studios Raises $25 Million to Back the Pixar of VR\n \nAug 15, 2016\nThis studio could be the Pixar of virtual reality\n\nContact  |  Careers  |  About  |  Store  |  Projects\nPrivacy Policy  |  Terms of Service\n\nContact us: media@baobabstudios.com\n\nSubscribe to our newsletter for the latest Baobab updates\n\n Subscribe\n\nBy using this website, you agree to our use of cookies. We use cookies to provide you with a great experience and to help our website run effectively.", "Developer Terms of Service": "current page:\nhome\nprojects\ncompany\nabout\ncareers\nnews\nstore\ncontact\nBaobab Studios is the leading Interactive animation studio. \n\nOur mission: Inspire you to dream by bringing out your sense of wonder. We make YOU matter. We will immerse you in fantastical worlds, introduce you to characters to fall in love with, and let you interact with these characters.\n\nPROJECTS\nThink of Baobab as the Pixar of VR.\n Business Insider\nAims to Combine Elements of Animation and Video Games to Create Interactive Stories\n The New York Times\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nView fullsize\nBuilding the Next Generation of Narrative Movie Content\n TechCrunch\nNEWS\nApr 30, 2020\nExclusive: Baobab Studios and John Legend Release When You Can Fly Music Video\n \nJan 25, 2020\nAnnie Awards 2020 Winners\n \nJul 5, 2019\n2019 Daytime Emmys: Crow: The Legend Tops Animation Categories\n \nJan 1, 2019\nThe World's Most Innovative Company 2018\n \nApr 20, 2017\nIs VR Studio Baobab The Next Pixar?\n \nOct 18, 2016\n20th Century Fox Just Poured Big Money Into This Hot Virtual Reality Startup\n \nOct 18, 2016\nBaobab Studios Raises $25 Million to Back the Pixar of VR\n \nAug 15, 2016\nThis studio could be the Pixar of virtual reality\n\nContact  |  Careers  |  About  |  Store  |  Projects\nPrivacy Policy  |  Terms of Service\n\nContact us: media@baobabstudios.com\n\nSubscribe to our newsletter for the latest Baobab updates\n\n Subscribe\n\nBy using this website, you agree to our use of cookies. We use cookies to provide you with a great experience and to help our website run effectively.", "Space Required": "1.24 GB"}



["5 stars\n48%\n4 stars\n24%\n3 stars\n14%\n2 stars\n8%\n1 star\n6%", "BuiIderbotJul 6 at 8:08 PM\nGood but short\n\nGood game but its short\n\nHelpful | 15", "spartanchick316Mar 28 at 1:00 PM\nVery cute and short\n\nI wish it was longer and had a little more interactivity. I can really tell this is an earlier game to VR and could use a refresh. I highly recommend this as an entry level game to VR or just for the short story experience. You'll only be disappointed by how short it is, but for the price it's at. It's fine.\n\nHelpful | 12", "LorimkJun 19 at 1:23 PM\nFun game\n\nNice little game not long but interested.\n\nHelpful | 2", "nishruu2Jun 10 at 8:48 PM\nreally cute but short\n\ni liked it. it is very short but good\n\nHelpful | 2", "LoraleiBApr 16 at 7:03 PM\nBetter than the last one!\n\nAfter playing (or in fact watching) Invasion, I was waiting for another game to come back. Came this game. More interactive! Also one question... Isnt it technically the captains fault that we crashed? ANYways the game is good and great. Im actually curious if you can add more endings? Like one of you save Porkbun, one if you save the Human Race, and one if you dont save ethier of them. I was wondering if you could do endings for each of those choices because each choice leads to the same ending. Love the game. More endings if you can?\n\nHelpful | 7", "BlackRacerQuilJun 10 at 6:57 PM\nPlease make more!\n\nI wish there were more story games like this.\n\nHelpful | 2", "MoreReesesPlsMay 22 at 5:51 PM\nOk\n\nIts an ok game its just so short i would rather save up the money i spent and buy a game like super hot\n\nHelpful | 2", "GamesCanBeFunYTFeb 29 at 9:52 AM\nvery good but...\n\nI love this game the story was great the was multiple choices. depended on what you did slightly altered what would happen next but it was way too short,I completed it very quickly and then completed it again but try different things to see what would happen so overall I would recommend getting this game\n\nHelpful | 6", "BrendanRoyMay 9 at 6:42 PM\nCute and fun\n\nTotally fun and lighthearted wish it was longer very cool.\n\nHelpful | 0", "CatGirlGamerJan 2 at 7:33 AM\nWant more please\n\nThis is a wonderfully quirky short story. I wish it were episodic as it leaves you wanting more at the end. Due to it's short play time I recommend that you buy it when it goes on sale. Great game for all ages and VR experience.\n\nHelpful | 23", "jelwellMay 18 at 11:29 PM\nShort but cute - buy it on sale\n\nMy kids an I enjoyed this. The whole game is less than 20 minutes or so.\n\nI would give this game 4 stars if it let you jump to some of the scenes, rather than forcing you to replay the entire game to hear different dialogue.\n\nSPOILER BELOW\n\nThe game gives you the impression that there are choices that make a difference in the storyline. In my limited testing that is not true. Dont replay the entire game with the assumption that you can get a different outcome at the critical choice presented. At best you will get different dialogue but essentially the same visuals and story outcome.\n\nHelpful | 2", "everettsmachineApr 26 at 4:26 PM\nCute,funny,MUST BUY\n\nSo funny and cool and cute\n\nHelpful | 1", "STuMPYFLiPJun 26 at 5:20 PM\nCute and great for kids.\n\nMy 9 year old loved it. Although short - cute story, nice experience.\n\nHelpful | 0", "maxwem02Feb 1 at 1:35 PM\nKids love it\n\nI got this one for my kids to play. They loved it. The only reason I give it 4 instead of 5 is because it is relatively short. My kids have also been asking about the other stories. They show videos of them but they can't actually choose them. How can my kids get those also on the Oculus Quest like they have Bonfire?\n\nHelpful | 1", "GIBLE_DIBLEApr 25 at 8:23 AM\nAll hale pork bun\n\nY e s\n\nHelpful | 0", "cloud.xsdMar 6 at 2:15 PM\nHad me smiling\n\nI've view most of this artist work but nothing that was interactive like this. It had me smiling after a long day. I really enjoyed this and looking forward on what the studio comes up with next\n\nHelpful | 0", "WATERBOIWAVEFeb 29 at 2:27 PM\nWish there was more\n\nSuch a cute little story. Left me wanting more. I developed a cute little bond with the mysterious creature and would love if additional episodes were introduced! 10/10 would recommend for a short 30-45 min experience.\n\nHelpful | 0", "King_Of_EgyptMar 27 at 2:28 PM\nGreat interacting movie\n\nGreat interacting movie\nSuper nice graphics\nThank you for the great job\n\nHelpful | 1", "RIZIN86Nov 19 at 6:33 AM\nShort and sweet\n\nI enjoyed my brief time with this experience. If I compare it to the crow I have to say i came away a bit disappointed. I feel like their were only 2 types of actual interactions that i did and it lasted maybe 5 minutes. That's my feeling when I think back on it I'm not sure what the facts are. The crow was a bit too long and this was too shirt. I'll be picking up everything from this developer as they move toward the sweet spot.\n\nHelpful | 15", "dani.dorfman.50Jan 28 at 5:55 AM\nVery cute, very short, very cheap\n\nHad a bit of bugs in the hand movement (hands graphics vibrated from side to side in order to lock on items which i did not point at)\n\nHelpful | 1", "olivertriezJan 5 at 5:17 PM\nI wish It was longer.\n\nThe only reason I didnt do 5 stars is because I wish it was longer and maybe if there were more ending and things like that. Is there was an actual survival mode, that would be really cool. Bye!\n\nHelpful | 7", "SankyuFeb 20 at 6:19 AM\nWay too short, want more!\n\nThis is the shortest game I've bought in the store here, but also one of my favorites. For those who have played it, you'll understand.\n\nHelpful | 0", "Rangernash61Feb 3 at 4:57 PM\nWAY TOO SHORT\n\nI thought the game was wrest but way too short and its not worth 5 bucks. For a game this short it should be free. Besides that the game was incredible and I had lots of fun playing it for 3 minutes\n\nHelpful | 1", "valkarie42Jan 27 at 4:48 AM\nNothing more than an intro\n\nThis was going great, I couldn't wait to see what would happen next in the game after making my 'choice', then the credits stated and it was over. The whole thing only lasted about 10 minutes and felt like the intro to the game. On the plus side, the graphics were great, the story line was fantastic and it was funny and interactive. I just wish it had gone on to be more.\n\nHelpful | 1", "ViruZAngelFeb 12 at 9:20 AM\nNice\n\nWould like more content,but still fun\n\nHelpful | 0", "telos81Jan 25 at 7:00 AM\nWorth $3!\n\nI grabbed this on sale - worth every penny! Its been played a number of times now! Its a super cute little experience. My kids love it and have played it through multiple times\n\nHelpful | 3", "PhenoramDec 10 at 6:55 PM\nWorth it\n\nIt's a good experience. I think you have to have the right expectations going in. It is pretty short (20 minutes ish) and there's not a lot of interaction. From that side, it's really best as a tutorial / intro to VR. Think of it mostly as a video short that has some audience participation. I think younger kids would like it too.\n\nHelpful | 0", "ChandlerTheYeetBoyJan 27 at 2:12 PM\nI love this game.\n\nI like this short game, I wish the game is more Ionger.\n\nHelpful | 0", "teddelerJan 3 at 3:33 PM\nThanks again, Baobab\n\nYes, it's short for the price but where else can you...\n[spoiler] there is a spoiler setting on this thing, isn't there? No? ahem... [/spoiler]\nLet's just say it's a great bit of fun and I love the humor.\nKeep it up, Baobab.\n\nHelpful | 6", "Ihrie4 days ago\nCute and short\n\nCute and short experience with a decision at the end thats mostly meaningless. Still fairly well done.\n\nSnag it if its on sale, but dont expect a whole lot.\n\nHelpful | 0", "Exhonorated999Feb 17 at 8:02 PM\nGreat\n\nExcellent story. I hope they make more experiences\n\nHelpful | 0", "usernameMutantJan 24 at 10:53 PM\nIt's decent but lacking in more content\n\nThis game is great and beautiful I had a blast playing it but it's like everyone says it's too short!!! Not really worth even 3 bucks on sale should definitely be a free game already included in the Oculus Quest\n\nHelpful | 2", "KlarissianDec 25 at 6:56 AM\nGood but really short\n\nIt's a nice story with some interaction but to short for the price. It took around 15 minutes.\nBut they also created 3 vr shortfilms which are great and free so all together it's OK.\n\nHelpful | 0", "theChrisAguirreMay 17 at 12:49 PM\nSuper cool!\n\nJust wish it was longer. Looking forward to more from Baobab Studios.\n\nHelpful | 0", "satishgodaJan 26 at 7:25 PM\nLovely and Delightful\n\nI really enjoyed the visuals, music, character and emotion in this one. Great job and Congratulations on winning the Annie Award 2020\n\nHelpful | 0", "littlenezzieFeb 1 at 10:24 AM\nFun and cute\n\nLoved it. Enjoyable. Only downside a little short but for that price it makes sense. Good buy.\n\nHelpful | 0", "Patr076Feb 6 at 3:46 AM\nBest short story Ive experienced\n\nReally an amazing world and story. The humor is fantastic. I want more!!\n\nHelpful | 0", "Zapper121Dec 2 at 10:08 AM\nBonfire\n\nGreat story and characters you get I do feel if this was pushed as a demo or trial as its shot abrupt finish was a shock however I never payed anything for this so I would say if youre little sister or brother COULD use this Id say it had an audience\n\nHelpful | 0", "williatDec 25 at 2:43 PM\nWonderful Experience\n\nIncredibly charming. Surprisingly immersive, especially the opening in the spaceship. I really hope other Baobab projects get ported to the Quest. Viewing just the 360 footage without interaction is not even close to the full experience.\n\nHelpful | 2", "DoctorNumberFourJan 24 at 2:03 PM\nshort but sweet\n\nshould cost less, but great for what it is. a nice story that is a bit too expensive.\n\nHelpful | 0", "alearajonesJan 31 at 12:50 PM\nLooks good\n\nGreat quality! Definitely would play again.\n\nHelpful | 0", "anhaagNov 29 at 3:38 PM\nCool experience\n\nIts a cool experience, but I wish there were a little more puzzle to it instead of directing you with exactly what to do. But really cool graphics!!\n\nHelpful | 7", "KillCounter0505Jan 26 at 6:01 PM\n\nIt is sort of fun but it is way to short\n\nHelpful | 0", "WookalarSF14Jan 14 at 8:06 AM\nThe experience is fun but very short\n\nThe game itself is fun. But the playtime is about 5-10 minutes. It is not worth its price. Despite this, the character are charming and fun.\n\nHelpful | 2", "GODHEDJan 2 at 1:24 AM\nNot worth the price\n\nIt is like a 5 minute experience and just overall isn't good enough for even it's cheap price\n\nHelpful | 3", "MightyKoloMar 17 at 2:55 PM\nFantastic!\n\nI know its short but its 4 POUNDS. That's nothing. I loved the voice acting and the cartoony style. To me, Disney should sweep this up and make a full-length film, I'd watch it! Overall great experience and I cant wait to show it to family.\n\nHelpful | 0", "DiJusefDec 7 at 7:53 PM\nFunny story, hope to see more\n\nFunny story, good graphics (quest) but a bit too short. Also the hands are buggy sometimes. Hope to see more!\n\nHelpful | 1", "BUTCHER.D.J.G.Dec 5 at 7:35 PM\nGreat short interactive story.\n\nThis would be a great way to introduce people to vr, you know over a generic oooooh ahhhh vr program. This guides you what to do, cute little story, and it's best played seated. Yes it is short but it's inexpensive and worth the cost of admission.\n\nHelpful | 0", "hollis.potterNov 23 at 7:13 AM\nQuality Experience\n\nI sat down on the floor with my coffee this morning to play this. It's exactly what I needed this weekend. High production value and wonderful interaction. Most importantly, it does not outstay it's welcome. Have the right expectation going in, and you'll be pleased the minute you give that alien puppers scritches.\n\nHelpful | 0", "bambihunter123Nov 10 at 11:18 AM\nNeat\n\nIt's definitely one of thos fun and we'll made intros into vr. It is short about 10-15 min but i think it's worth a run through\n\nHelpful | 6", "dingofoxvrfoxNov 22 at 1:04 AM\nThis is a free short film everywhere\n\nSo you understand this film interactive experience is a freebie on other platforms no way will I ever do this again\n\nHelpful | 7", "EdigsSep 8, 2019 at 1:39 AM\nGreat short\n\nI got this one on sale, but was fully prepared to return it if I wouldn't like it.\nIt turned out I do like it. It's beautifully animated and while the story is simple and nothing to write home about, those few interactions that are there (especially with the pink creature) elevate the experience from merely ok to delightful.\n\nIt ends after only 20 minutes or so, but honestly it feels just right for what it's trying to achieve. I'm actually glad devs didn't try to artificially extend its running time.\n\nHelpful | 8", "gtxlkNov 24 at 2:20 PM\nGreat Game\n\nThe game is short but the quality of the game is amazing just wish it was longer.\n\nHelpful | 0", "smilecolorsanDec 15 at 12:37 PM\nFun and has Room for More\n\nSuper cute story. Mild, but very smooth interaction. Nice graphics with art style\n\nHelpful | 0", "LilyFrazbearDec 21 at 10:38 AM\nSo funny!\n\nI found myself laughing again and again! Great job!\n\nHelpful | 0", "MoneybagvrNov 5 at 10:44 AM\nGood for beginners\n\nI love this because if u only have one quest and 3 kids play this game and it's 5$ I hope more and longer games come out soon and it looks great on the quest\n\nHelpful | 0", "RowdyRocketDec 11 at 6:17 PM\nNeed more!!!\n\nVery short. Kept me wanting more. Got it on sale, worth the price I paid.\n\nHelpful | 0", "mr.potato4808Oct 22 at 7:51 AM\nIt was really fun\n\nthis is a great game for all ages and I really recommend it. but the reason that I rated it 4 stars instead of 5 is because Im not sure its worth the price(its really short).\n\nHelpful | 0", "acc3dNov 9 at 10:52 AM\nExcellent animation & interactivity!\n\nExpect quality animation and storytelling from many former DreamWorks Animation artists. The characters are memorable and the interactivity is so cool. I definitely recommend this short animated experience.\n\nHelpful | 0", "DeatheaterplayzDec 2 at 2:59 AM\nGreat but to short for price\n\nThe game is $5 and when you play feels like 5 minutes. I'm not playing a game to pay a dollar a minute.\n\nHelpful | 1", "TomBombiOct 5 at 4:04 PM\nQuality over quantity\n\nThis little interactive short film style experience is phenomenally good. The craftsmanship that went in to this hilarious little adventure is second to none. The art is beautifully stylised and characters are compelling and fun. Its only short, but the quality of the content - particularly the animation- is the highest Ive seen on the Quest.\n\nHelpful | 6", "danielaidanerickonNov 7 at 7:50 PM\nLess than a half hour, no real choice\n\nThis team also did Invasian which you can find on Amazon VR. They do cute, cartoon experiences that are just as good not being interactive as there are no actual options to what you do and zero replay. Want a cute 25 minute cartoon? Heres one for $5.\n\nHelpful | 0", "wendy.douglas.1481Sep 28, 2019 at 7:11 PM\nA bit of Fun\n\nAs others have said, very short experience for the price, having said that, I also agree the story & graphics were well done. There appears to be 2 endings & I've only done the one so far. A nice effort from the Dev's regardless.\n\nHelpful | 2", "TsuyoiRaionMay 26, 2019 at 10:11 PM\nGreat but pricey\n\nSo this is an incredible short interactive story, everything is very well done from lighting, animations, sound effects, you name it, it's great!\n\nBuuut it did feel too short for the price, I mean as a developer myself I can see why the price would be that much but i'd personally only ask $5 due to the length. It's fun, cute and well done but lacking, with the ability to buy a game for the same price that would offer 40+ hours of gameplay, I can only hope that VR games in the future will offer the same.\n\nKeep making cool stuff!\n\nHelpful | 138", "Glenn-TidburyAug 26, 2019 at 11:05 AM\nFun, but short\n\nThis is a fun little story, and does have a few, albeit simple, interactive elements. As a first step into 6dof vr for this group, it was a welcome change.\n\nIt is quite a short experience though, especially for the original price. I grabbed it on sale for 4 quid odd though.\n\nThe main thing I'd like to see updated, is to link their other titles to the vr versions from within this one. At present, you can watch the other stories in 2d from within the virtual set.... but as the others are available in vr format, for free, it would be better to include the vr versions?\n\nIf you enjoyed the other titles (invasion, asteroids and crow), I'm sure you'll love this too. It's got all the same charm, cuteness and quality of the previous titles, with the added element of interaction. If they added the vr versions of the others, it would really make a nice little package.\n\nHelpful | 5", "uber2020Oct 26 at 8:13 PM\nGreat game to play every night\n\nEach night I play this and sometimes I dream about the different possibilitys in it too bad it ain't like that in the game.\n\nHelpful | 0", "higginlsAug 25, 2019 at 8:58 AM\nWHERES THE BEEF\n\nThe folks who created this product clearly have skills and a sense of humor. However, they appear to lack a sense of ethics. Basically, there is virtually no product here. Its seems to be a commercial to sell you more commercials, altho I havent (and wont be) viewing any of their other products to compare to this one. This product at least, is MASSIVELY over-priced and frankly should be free. Oculus should be embarrased for allowing this type of thing in the store. For my money its one notch short of a financial scam. Not even worth the wasted time it would take to get a refund.\n\nHelpful | 9", "ShemhamMay 26, 2019 at 7:54 AM\nCan't help but feel ripped off\n\nI'm sorry but this is a 1.99/2.99 game at best. The credits roll longer! I can't help but feel like I'm being ripped off for being an early adopter of the oculus quest. These \"games\" are tech demos at best! Very disappointing. I only gave it 3 stars because graphically it's beautiful and the game mechanics work very well.\n\nHelpful | 267", "LoonytoonyOct 21 at 1:56 PM\nWhy is it $5\n\nOk I get it's VR so it will cost more but for a 10 to 20 minute game really. At most make it $3.\n\nHelpful | 3", "Louies_DadOct 26 at 7:10 PM\nBonfire\n\nRip off. Way, way too short.\n\nHelpful | 4", "CynroxOct 28 at 4:50 PM\nGreat for introducing VR\n\nGreat for introducing VR to anyone, you get the replayability that way\n\nHelpful | 0", "FeedMeMemesPlzJul 22, 2019 at 10:43 AM\nAbsolutely amazing!\n\nI want to start off by saying the only negative thing about this is the price. For $10 this experience is just too short. It's an interactive story that you can knock out in less than fifteen minutes. Despite this, the experience is well worth it. The graphics are simple but paired with the lighting they are GORGEOUS! I actually spent a while looking at the port hole in the ship because it looked so tangible (too bad you can't physically walk around otherwise the experience pauses and asks you to recenter yourself). The story was also incredibly well done. It's full of humorous moments along with a few suspenseful and frightening ones. You can see how much care was put into this experience as everything is beautifully crafted and perfected. The characters feel alive and you find yourself growing attached to them and their little quirks. Can't wait to see what they make in the future!\n\nHelpful | 12", "CornyCobDec 25 at 10:47 AM\nShort but sweet!\n\nDefinitely the best graphics and UX game here, can not wait what the studio brings up next for the Quest :D\n\nHelpful | 0", "splaty2007Aug 26, 2019 at 6:00 PM\nGreat but short\n\nIt is an amazing game I just thought it was a bit short\n\nHelpful | 1", "zenmagnetsAug 11, 2019 at 9:34 PM\n$10 is too much\n\nThe experience lasts like 10 minutes. The appropriate amount to charge is $2.99\n\nHelpful | 5", "JWheezyJul 13, 2019 at 1:55 PM\nWay too long Needs Edits\n\n5 stars because it deserves it and I knew how long of an experience I was in for. I use Bonfire to show of the Quest to friends and family. After I scare them with Richies Plank Experience, I completely change the environment and send them through space to a fireside hangout. Its immersive, its fun and its the perfect length of time for someone new to wearing the headset. And you should be thanking your lucky stars the credits are substantial as you dance with your laser hands and the Polka bangs hard. Also love the ship. Would be sweet to watch a making of video in there. Great game (its a game. I experienced myself playing the game) thanks!\n\nHelpful | 2", "WhyKlefJun 8, 2019 at 2:59 PM\nGreat but extremely short.\n\nThis is about as short as Invasion, slightly more interactive with a good story overall but it's a very VERY short experience and it feels like it scratches the surface of what could be a unique to VR point-and-click type game, all while keeping a strong emphasis on the story. It's definitely a fun short story nonetheless.\n\nI gave it 4-stars as there is much better in the genre, free Henry on PCVR comes to mind. Or, free as well AND from the same developers, Crow: The Legend felt like a much more complete experience.\n\nHelpful | 4", "simon.milne2Jul 10, 2019 at 6:37 AM\nGreat experience\n\nGreat experience, though can't help but feel its a little overpriced for the length.\n\nHelpful | 1", "virtualprimateMay 25, 2019 at 11:15 PM\nToo short for the price\n\nThis is a very well made VR experience, but its extremely short (+-20 min). Boabab studios also made Crow which I found to be a better experience, you can see that for free in the Oculus video app. 4.99 would have been a fair price.\n\nHelpful | 21", "BobbiHereAug 2, 2019 at 3:37 PM\nFun.. Different !\n\nI enjoyed this game. It was different. Cant wait to try out some of the other stories.\n\nHelpful | 0", "Ommmm_2486Jun 28, 2019 at 11:37 AM\nBig Fan of Ali Wong  Not of Bonfire\n\nI think any sit-down game for the Quest is a lost opportunity. Make it an Ocukus Go game, then. Could have used more narrative development to care about the story. Graphics in the spaceship were blah. Sitting in one spot around the fire was boring. Enjoyed eating the marshmallows  that was fun. Liked using the interactive device to see elements of the environment. Otherwise, needed more to stay interested.\n\nHelpful | 2", "cenoquestJun 16, 2019 at 2:51 PM\nGreat narrative\n\nThis studio is like the Pixar of VR. Every element of this experience is excepcional - the writing, the voice acting, the animation, the art direction, the graphics, the audio.\n\nIm torn about the price - its probably reflective of how expensive the production was and how limited the audience is, but it does feel like too much money to shell out for something this short. Still - its a funny and heart warming experience Ive done a few times now and just took in more and more of the detail.\n\nHelpful | 8", "MonoidMay 25, 2019 at 5:43 PM\nToo short\n\nThis games is way too short (10 minutes) and way too overpriced. Don't buy this\n\nHelpful | 31", "argerichJun 19, 2019 at 11:37 PM\nShort but fun. Great for kids.\n\nMy wife and I both enjoyed this game very much. It is very simple and short enough to hold the attention span of a child or an individual with cognitive disabilities.\n\nHelpful | 0", "SurfheartJun 3, 2019 at 9:26 PM\nAbout $8 too expensive\n\nI was very suprised when this game ended after about 15 minutes. Super polished and charming but far too expensive for the content provided.\n\nHelpful | 11", "Studly_McSexfireMay 24, 2019 at 2:14 PM\nSo enjoyable\n\nVery cleverly done and the scenery is beautiful. I laughed throughout it. Wish it was longer and hope to see more like it.\n\nHelpful | 5", "NVRflameMay 23, 2019 at 11:49 PM\nWell Done\n\nReally well made, funny & entertaining! The kids will love it, almost as much as the parents will !\n\nHelpful | 6", "BitterMcLungieJun 25, 2019 at 6:50 PM\nWay toi short. It was almost a teaser\n\nToo short\n\nHelpful | 5", "uh_wtfMay 22, 2019 at 5:38 PM\nFantastic\n\nAwesome, funny, entertaining VR experience\n\nHelpful | 7", "greenmossMay 23, 2019 at 12:02 PM\nMy actions actually matter to narrative\n\nI actually feel like my actions and choices matter in this narrative. Usually narrative VR has interactivity as an afterthought. Most narrative VR straightjackets me, only letting me interact when they want me to (which makes no sense) or I ignore the story and just have fun interacting. This one let me interact the whole time and I actually cared about the story. I bonded with the other characters and they react realistically and with personality to everything I do. I can even annoy them if I keep throwing things at them. I'm amazed by how much detail they put into this, making sure the characters felt real. Amazing animation too. Ali Wong is hilarious.\n\nHelpful | 13", "leveluptimeMay 22, 2019 at 1:43 PM\nPleasant Surprise\n\nI like cartoons and space stuff, this looked like it was a match made in heaven. After crash landing on an alien world my robot and I had to learn about the environment. We made friends with a Pink Critter and enjoyed marshmallows. A fun time was had by all.\n\nHelpful | 14", "tonymeyersMay 23, 2019 at 12:10 PM\nBonfire takes VR to a whole new level\n\nI was completely blow away by Bonfire. The animation was charming and the graphics looking great on the Quest. But what took VR to the next level for me was getting to become friends with the little alien ball character. The interactivity was so seamless and well executed. A must have for the Quest!\n\nHelpful | 9", "swervinkervinMay 28, 2019 at 9:29 PM\nBest experience for this newbie!\n\nI took the plunge, and bought a Quest! I havent used or been in VR before, so I was really afraid that Id get sick or would be bored. I love movies and film in general and immediately looked at what was available in that section. I found Bonfire and decided, hey, TREAT YO SELF. Honestly, I wasnt sure if it would be worth $10, especially with some of the other reviews. But after playing it a few times, it definitely was!\n\nI didnt get sick at all, even with a space scene. I had fun exploring this new planet and meeting new characters (like a pink thing called Pork Bun)!\n\nThanks for a great introduction to VR! Cant wait to see whats more in store - literally!\n\nHelpful | 3", "hopepaigeMay 23, 2019 at 12:39 PM\nreally funny and clever\n\nBonfire starts with a bang. You get to navigate a space ship with literally a 1000 buttons and of course you crash land. Then you are all alone with your robot friend. You get to build a fire, eat marshmallows, and explore the environment. The best part is once the pink alien enters and you get to befriend her and play with her (I loved petting the alien). Great fun all around.\n\nHelpful | 4", "jdbox74May 21, 2019 at 10:18 AM\nFunny!\n\nI've really liked all of Baobab's VR experiences. If you are looking for a funny alien adventure (with super cute characters!) check this out. Great storytelling - worth the 10 bucks!\n\nHelpful | 15"]