{"App Title": "Cave Digger", "App description": "Features:\n-Explore the elevator shaft and four massive train levels full of mysteries, riches and strange happenings. Some fishy higher power seems to engulf the Frontier!\n\n-Build up the way to the mines by gearing up and upgrading your vehicle. But beware, the adventure can end in eight different ways depending on the actions and choices taken.\n\n-Meet a companion to help to carry the weight on your shoulders.\n\n-Go on a treasure hunt for hidden magical loot.\n\n-Item upgrades  technology advances in unimaginable ways, making mining more profitable!\n\n-28 achievements and more to come in free content updates.\n\nHow much riches will be enough? Will you be able to stop? What happens if you dont? The answers to these questions and more will be found as you dig deeper into the mines!", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Exploration", "Languages": "English", "Version + Release Notes": "2.07\n(LIVE)", "Developer": "Mekiwi", "Publisher": "Mekiwi", "Website": "https://vrkiwi.org/products/cave-digger-riches/", "Release Date": "September 19, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Home\n \nWho VR?\n \nServices\n \nPortfolio\n \nTeam\n \nContact us\n \nSubmit your game\nTerms of Use (aka. terms of service, terms & conditions)\n\n\n\nLast Updated: March 20, 2018\n\n\n\nIntroduction\n\nWe welcome you to use the services of Mekiwi Oy (also known as Mekiwi Ltd) and VrKiwi (Mekiwi Ltds publishing label) and its affiliates (VrKiwi, we, us, our). VrKiwi provides mobile and online services, including but not limited to VrKiwi game applications (the Game(s)), and the related website located at vr.mekiwi.org (the Site), (the Games, the Site and other online and mobile services provided by VrKiwi collectively, the Service).\n\nThese Terms of Use (collectively, the Terms) set forth the legally binding terms and conditions which are applicable to your use of the Service, however installed, accessed and/or used, whether via personal computers, consoles, mobile devices or otherwise. Please be reminded that the Terms constitute an agreement between you and us and define the rights and responsibilities that you have with respect to the Service. It is important that you read and understand the Terms. By downloading, installing, accessing or using the Service (including Games) you confirm that you have read and understood the Terms and any other documents referred to herein, including without limitation our Privacy Policy, and that you agree to be bound by this agreement. Consequently, if you do not accept or understand the Terms, please do not use, download, access or register with the Service. If you do not agree to these Terms, you are not entitled to use the Service and you must promptly uninstall and delete all copies of any Games.\n\nThe terms you and user shall refer to all individuals and entities that access the Service. You represent and warrant that you have the right, authority and capacity to accept these Terms and to abide by them and that you have fully read and understood the Terms.\n\nIn addition to these Terms, you agree to abide by any supplemental policies of the Service, such as policies related to specific services (including without limitation forums, chats, contests or sweepstakes) as well as all other operating rules, policies and procedures that may be published from time to time on the Service, each of which is incorporated herein by reference.\n\n\n\nModifications to these Terms of Use\n\nFrom time to time, we may modify or amend these Terms. If we do so, we will post any such modifications or changes in the Service. You can tell when changes have been made by referring to the Last Updated legend on top of this page. Please review these Terms regularly to ensure that you are aware of any changes.\n\nIf you continue to use the Service following such a posting of changes, you accept any such change or modification. If you have any questions about these Terms or our Privacy Policy, please see our contact information on the last page of these Terms.\n\n\n\nIII. Eligibility;\n\nUse of the Service is subject to your continued compliance with these Terms. The Service is intended solely for persons who are 13 years of age or older. Any access to or use of the Service by anyone under 13 is expressly prohibited. By accessing or using the Service you represent and warrant that you have reached the age of majority where you live and agree to be bound by these Terms, or, if you are still considered a minor, that you are at least 13 or older and have a parents or guardians permission to access and use the Service. If you are between the ages of 13 and 17, you represent that your legal guardian has reviewed and agreed to these Terms.\n\nThe Service is intended solely for your personal use. Moreover, you represent and warrant that you will use the Service in compliance with any and all applicable laws and regulations. Use of the Service is unauthorized in any jurisdiction where the Service or any part of it may violate any laws or regulations. You agree not to access or use the Service in such jurisdictions.\n\n\n\nFees; Purchases; Virtual Items\n\nCertain features of the Service may be subject to a fee. You may be required to pay for certain services, including an exchange for virtual currency, a purchase of certain virtual, in-game items, upgrades or participation in certain Game activities. Any applicable fees are displayed on the Service in connection with the respective feature of the Service. We may, from time to time, modify, amend, or supplement our fees and billing methods, and post those changes in these Terms or elsewhere on the Service.\n\nIn particular, VrKiwi may license to you virtual, game currency or certain virtual goods such as in-game items (collectively, Virtual Items) on a limited, personal, non-transferable, non-sublicensable and revocable basis and limited only for non-commercial use. You may purchase a limited, personal, non-transferable, non-sublicensable, revocable license to use Virtual Items from VrKiwi using actual monetary instruments or using virtual currency if you are a legal adult in your country of residence. Any Virtual Items are licensed, not sold to you. Virtual Items (including game currency) may never be redeemed for actual monetary instruments, goods or other items of monetary value from VrKiwi or any other party. Unless expressly authorized in the Service, you agree not to sell, redeem or otherwise transfer Virtual Items to any person or entity, including but not limited to another user or any third party.\n\nYou are responsible for all charges and usage on the Service and all purchases made by you or anyone that, with or without your consent, uses your licensed copies of the Games, including applicable taxes. You may pay using the methods available for the particular services, which may include credit card, debit card, PayPal, or other similar accounts, and you agree to the terms and conditions applicable to each payment method you choose, including any additional payment processing fees which may be applicable. By providing us with a payment method, you (i) represent that you are authorized to use the payment method that you provided and that any payment information you provide is true and accurate; and (ii) authorize us to charge you for the Service using your payment method. You must promptly update all billing information to keep it current, complete, and accurate (such as a change in billing address, credit card number, or credit card expiration date), and you must promptly notify us if your credit card is canceled, lost or stolen.\n\nWe may manage, regulate, modify, control or eliminate Virtual Items at any time in our sole discretion, with or without notice. If we exercise such rights, we will have no liability to you or any third party. Please note that Virtual Items are not transferable, and that we are not responsible for any Virtual Items that are lost, damaged, deleted or otherwise used inappropriately, or for game play interruptions or premature game termination, regardless of cause, that result in Virtual Items being spent.\n\nANY APPLICABLE FEES AND OTHER CHARGES ARE PAYABLE IN ADVANCE AND ARE NOT REFUNDABLE IN WHOLE OR IN PART. IN PARTICULAR, ANY PAYMENT FOR LICENSES FOR VIRTUAL ITEMS OR REDEMPTION OF THIRD PARTY VIRTUAL CURRENCY IS ALWAYS FINAL AND NON-REFUNDABLE.\n\nYou agree to pay all fees and applicable taxes incurred by you using the Service. We reserve the right to change the pricing for the goods and services offered through the Service, including the Virtual Items, at any time. SUBJECT TO MANDATORY LEGISLATION, YOU ACKNOWLEDGE THAT WE ARE NOT OBLIGATED TO PROVIDE ANY REFUNDS FOR ANY REASON. YOU ACKNOWLEDGE AND AGREE THAT YOU WILL NOT BE ENTITLED TO RECEIVE MONEY OR OTHER COMPENSATION FOR UNUSED VIRTUAL ITEMS WHEN AN ACCOUNT IS TERMINATED OR SUSPENDED FOR ANY REASON, REGARDLESS OF WHETHER SUCH TERMINATION OR SUSPENSION WAS VOLUNTARY OR INVOLUNTARY.\n\nYou are solely responsible for any costs you incur to access the Service through any Internet, wireless or other communication service, such as any fees for web browsing, messaging, and data usage on an Internet providers or wireless carriers network. Check with your carrier to determine the fees that apply.\n\n\n\nThird Party Material\n\nThe Service contains links to websites and content owned and/or operated by third parties. Such links are provided for informational purposes only. We are not responsible for any such third-party websites or content and do not have control over any materials made available therein. Our inclusion of a link to a third-party website or content in the Service does not in any way imply our endorsement, advertising, or promotion of such websites or content or any materials made available therein. By accessing a third-party website or content you accept that we do not exercise any control over such websites or content. We have no responsibility for such third-party websites or content. We encourage you to familiarize yourself with the terms of service applicable to any third-party website or content you may access.\n\nWe do not warrant or endorse and do not assume and will not have any liability or responsibility to you or any other person for any third-party products, services, materials or websites. Please note that the applicable third party is fully responsible for all goods and services it provides to you and for any and all damages, claims, liabilities and costs it may cause you to suffer, directly or indirectly, in full or in part.\n\n\n\nIntellectual Property\n\nThese Terms confer only the right to use the Service, while these Terms and the specified licenses are in effect, and they do not convey any rights of ownership in or to the Service. All right, title and interest, including without limitation any copyright, patent, trade secret or other intellectual property right in the Service will remain our sole property. VrKiwi retains all right, title and interest in and to the Service and any content available therein, including, but not limited to, any Games, titles, source and object codes, Game client and server software, other computer codes and software, themes, objects, characters and character likenesses, character names and character profile information, stories, dialogue, catch phrases, locations, artwork, animations, sounds, musical compositions, audio-visual effects, concepts and methods of operation, layout, text, data, files, images, graphics, the look and feel of the Service, documentation, gaming history and recording of game play, transcripts of any chat rooms, and moral rights, whether registered or not, and all applications thereof.\n\nNOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, YOU ACKNOWLEDGE AND AGREE THAT YOU HAVE NO RIGHT OR TITLE IN OR TO ANY CONTENT THAT APPEARS IN THE SERVICE, INCLUDING WITHOUT LIMITATION THE VIRTUAL ITEMS (INLCUDING CURRENCY) APPEARING OR ORIGINATING IN ANY VRKIWI GAME, WHETHER EARNED IN A GAME OR PURCHASED FROM VRKIWI, OR ANY OTHER ATTRIBUTES ASSOCIATED WITH USING THE SERVICE OR STORED ON THE SERVICE.\n\n\n\nVII. License Terms\n\nSubject to your compliance with these Terms and without prejudice to any other terms set forth in these Terms, we grant you a limited, non-exclusive, revocable and non-assignable license, without the right to sublicense, to access, download and use the Service on any authorized device you own and control, solely for your personal, non-commercial entertainment use. We reserve all rights in the Service not expressly granted to you in these Terms.\n\nThe Service is licensed, not sold, to you. You agree that we and our licensors own all right, title and interest in and to the Service, including all intellectual property rights therein, and that we retain ownership of the Service even after installation on your device. You agree not to delete or in any manner alter the copyright, trademark or other proprietary rights notices or markings which may appear on the Service.\n\nExcept as expressly specified in these Terms, you agree not to: (a) reproduce the Service or any part thereof in any form or by any means; (b) copy or modify, or create derivative works of the Service or any part thereof (including but not limited to any software that forms part of the Service), including, without limitation, make adaptations or modifications to the Service; (c) sell, rent, lease, distribute, transfer, license, sublicense, lend or otherwise assign any rights to, or any part of, the Service to any third party; (d) exploit the Service in any unauthorized way whatsoever, including without limitation, by trespass or burdening network capacity; (e) make the Service available to multiple users by any means, including without limitation by uploading the Service to a file-sharing service or other type of hosting service or by otherwise making the Service available over a network where it could be used by multiple devices at the same time; (f) disassemble, decompile, reverse engineer, or attempt to derive the source code of the Service, in whole or in part, or permit or authorize a third party to do so, except to the extent such activities are expressly permitted by law; (g) misrepresent the source of ownership of the Service; (h) scrape, build databases or otherwise create permanent copies of any content derived from the Service; (i) commercially exploit the Service; (j) use the Service or any content that appears in the Service in any manner to harass, abuse, stalk, threaten, defame or otherwise infringe or violate the rights of any other party; (k) use the Service or any content that appears in the Service to create within or outside the Service (e.g. in social media) abusive, obscene, profane, offensive, sexually oriented, threatening, harassing, racially offensive, or illegal material, or any material that infringes or violates another partys rights (including, but not limited to, intellectual property rights, or rights of privacy or publicity). You agree to comply with any technical restrictions in the Service that allow you to use the Service only in certain ways.\n\nWe are not obligated to maintain or support the Service, to provide all or any specific content through the Service, or to provide you with updates, upgrades or services related thereto. You acknowledge that we may from time to time in our sole discretion issue updates or upgrades to the Service, disable access to the Service for any period of time or permanently, and automatically update or upgrade the version of the Service that you are using on your device. You consent to such automatic updating or upgrading on your device, and agree that these Terms will apply to all such updates or upgrades, unless such upgrade is accompanied by a separate license in which case the terms of that license will govern. You acknowledge and agree that we shall have no liability to you arising out of any unavailability of the Service.\n\nThe license to use the Service granted under these Terms remains in effect until terminated by you or us. You may terminate the license at any time by destroying all copies of the Service in your possession or control. Without prejudice to any other terms set forth in these Terms, the license will automatically terminate without notice from us if you in any way breach any provision of these Terms. Upon termination in accordance with these Terms for any reason, you must cease all use of the Service and promptly delete and destroy all copies, full or partial, of the Service. Your termination of the license for any reason shall not release you from any liabilities or obligations set forth in these Terms which (a) have expressly been stated as surviving any such termination or expiration, or (b) remain to be performed, or by their nature would be intended to be applicable following any such termination or expiration.\n\nYou represent and warrant that you will not use or otherwise transport, export or re-export (directly or indirectly) the Service into any country forbidden to receive the Service by any U.S. or other jurisdictions export or technology laws or regulations or otherwise violate such laws or regulations, that may be amended from time to time. In particular, you represent and warrant that you will not use or otherwise transport, export or re-export the Service to a country that is subject to a U.S. Government embargo or to anyone on the U.S. Treasury Departments list of Specially Designated Nationals or the U.S. Department of Commerce Denied Persons List or Entity List. You also represent and warrant that you are not located in any such country or on any such list.\n\n\n\nVIII. User Content\n\n(i) Responsibility for User Content\n\nYou are solely responsible for any text, communications, images, and other data, information and content that you submit in the Service, or transmit to other users of the Service (collectively, User Content). You are responsible for complying with all laws applicable to your User Content. You agree not to submit to the Service, or transmit to other users of the Service, any defamatory, inaccurate, abusive, obscene, profane, offensive, sexually oriented, threatening, harassing, racially offensive, or illegal material, or any material that infringes or violates another partys rights (including, but not limited to, intellectual property rights, or rights of privacy or publicity). You will not provide inaccurate, misleading or false information to us or to any other user of the Service. If information provided to us, or another user of the Service, subsequently becomes inaccurate, misleading or false, you will promptly notify us of such change. We may, in our sole discretion and without notice, review and delete any User Content, but are under no obligation to do so.\n\n\n\n(ii) Content Screening\n\nWe have no responsibility for the conduct of any user in the Service, including any User Content submitted in the Service. We assume no responsibility for monitoring the Service for inappropriate content or conduct. We do not, and cannot, pre-screen or monitor all use of the Service or all User Content. Your use of the Service is at your own risk. By using the Service, you may be exposed to User Content that is offensive or inaccurate. At our discretion, we may, but we have no obligation to, engage in monitoring and/or recording of your use of the Service, including any communications such as forum posts or chat messages. By accepting these Terms, you provide your irrevocable consent to such monitoring and recording.\n\nYou acknowledge and agree that you have no expectation of privacy concerning the transmission of any User Content, including without limitation text or voice communications. For the avoidance of any doubt, regardless of whether we, in our sole discretion, choose to monitor the Service, we shall not be responsible for any User Content and assume no obligation to modify or remove any inappropriate User Content.\n\n\n\n(iii) Rights to User Content\n\nYou acknowledge and agree, and you hereby grant to us a perpetual, irrevocable, non-exclusive, worldwide, royalty-free license, with the right to sublicense, to use, track, store, copy, distribute, broadcast, transmit, publicly display and perform, reproduce, digitally perform, modify, create derivative works of, and otherwise use and commercially exploit: (i) your Game scores; (ii) your Game play sessions; (iii) your presence on the Service; (iv) the time that you spend on or within particular portions of the Service; (v) rankings, statistics, user profiles and avatars; (vi) any User Content that you may submit; and (vii) other Service usage information, in any media now existing or hereafter developed, including without limitation on websites, in audio format, and in any print media format. You further hereby grant to us the unconditional, irrevocable right to use and exploit your name, likeness and any other information or material included in any User Content and in connection with any User Content, without any obligation to you. Except as prohibited by law, you waive any rights of attribution and/or any moral rights you may have in your User Content, regardless of whether your User Content is altered or changed in any manner. You acknowledge and agree that all User Content whether publicly posted or privately transmitted to the Service is at your sole responsibility and risk. We disclaim any responsibility for the backup and/or retention of any User Content transmitted to the Service.\n\n\n\n(iv) Prohibited Content\n\nThe following types of User Content are examples of User Content that is prohibited in the Service:\n\nUser Content that promotes racism, bigotry, hatred or physical harm of any kind against any group or individual;\nHarassing User Content;\nJunk mail, chain letters, or spam;\nUser Content that promotes illegal activities or conduct that is abusive, threatening, obscene, defamatory or libelous; and\nUser Content of commercial nature without authorization from us.\n\n\n\nIf you see any material in the Service that in your good faith belief is offensive, hateful, harassing or that you otherwise think is prohibited, you may notify us by contacting us at info@vrkiwi.org\n\nFor instructions on how to report intellectual property issues, please see section XI (Copyright Infringement) below.\n\n\n\n(v) User Submissions\n\nYou acknowledge and agree that any questions, comments, suggestions, ideas, feedback, bug reports or other information about the Service (Submissions) provided by you are non-confidential and shall become our sole property and you assign all rights in these Submissions to VrKiwi. We shall own exclusive rights, including all intellectual property rights, and shall be entitled to the unrestricted use and dissemination of these Submissions for any purpose, commercial or otherwise, without acknowledgment or compensation to you.\n\n\n\n(vi) Interactions with Other Users\n\nWe wish to remind you that you are solely responsible for your interactions with other users of the Service and any other parties with whom you interact through the Service. If you have a dispute with one or more users, you release us (and our officers, directors, agents, subsidiaries, joint ventures and employees) from claims, demands and damages (actual and consequential) of every kind and nature, known and unknown, arising out of or in any way connected with such disputes. Without prejudice to the above, we reserve the right to become involved in any way with these disputes, but are in no obligation for doing so. You will fully cooperate with us to investigate any suspected unlawful, fraudulent or improper activity.\n\n\n\nProhibited Activities\n\nThe list below contains examples of behaviors that are prohibited in the Service:\n\nImpersonating another person or entity;\nAccessing or using the Service in an unlawful way or for any unlawful purpose;\nTransmission to or from the Service of any data, materials, content or information which is libelous, defamatory, obscene, fraudulent, false or contrary to the ownership or intellectual property rights of any other person, or otherwise unlawful;\nTransmission of viruses, malware, or other malicious code in the Service;\nModification, reverse-engineering, or other manipulation of the Service; and\nInterfering with, or disrupting, the Service.\n\nIn addition, you shall not access or use the Service if you are under the age of 13. If you are between the ages of 13 and 17, you represent that your legal guardian has reviewed and agreed to these Terms. You agree to deny access to children under the age of 13 to the Service and accept full responsibility for any unauthorized use of your licensed copies of the Games by minors. You are responsible for any use of your payment instruments (such as your credit card) by minors. You also acknowledge that some features of the Service, and some content available through the Service, may contain or expose users to material unsuitable for minors. You agree to supervise usage by minors whom you permit or enable to use the Service.\n\nIn order to ensure the integrity of the Service, we reserve the right at any time in our sole discretion to block users from certain IP addresses or with certain unique device identifiers from accessing the Service.\n\n\n\nCopyright Infringement\n\nWe respect the intellectual property rights of others. If you see any material on the Service that in your good faith belief may infringe someones copyright, you may notify us by e-mailing us at info@vrkiwi.org and by inserting Copyright in the subject line. In order for it to be effective, your notice, also known as a takedown notice, must include the following information:\n\nthe identity of the original copyrighted work that you claim is infringed or  if your notice covers multiple copyrighted works  you may provide a representative list of the copyrighted works that you claim have been infringed;\na sufficiently detailed description of the content on the Service that you claim infringes the copyrighted work;\nyour contact information, including your full name, mailing address, telephone number, and email address, if available;\na statement that you believe in good faith that the use of the allegedly infringing content on the Service is not authorized by the copyright owner, its agent, or the law; and\nthis statement: I swear, under penalty of perjury, that the information in this notification and complaint is accurate and that I am the copyright owner, or am authorized to act on behalf of the copyright owner of an exclusive right that is infringed; and\na physical or electronic signature of the copyright holder or a person authorized to act on their behalf.\n\n\n\nPrivacy and Security\n\nYour privacy and the protection of personal data about you are very important to us. For a detailed description of how we collect and use personal data about you, please see our Privacy Policy and familiarize yourself with the choices you can make about the way in which we collect and use personal data about you. By using the Service, you consent and agree to the collection and use of certain information about you and your use of the Service in accordance with our Privacy Policy and applicable laws and regulations related to personal data.\n\nThe Service may include social media functionalities and/or plug-ins that enable you to share certain content (such as scores or communications) with other people. Please be careful when sharing content that includes personal data generally in the Service and in particular with other users of the Service.\n\nIn addition to what is stated in the Privacy Policy, you agree to:\n\nRespect the privacy of other users;\nNot engage in unauthorized collection of users content or information, and/or not otherwise access the Service by automated means (including, but not limited to, so-called bots or scrapers) without an authorization from us;\nNot reveal any personal data related to another individual, including, but not limited to, a persons address, phone number, e-mail address, photograph, credit card number or any information that may otherwise be used to track, contact or impersonate another individual;\nNot utilize a username that is the name of another person and intending to impersonate that person; and\nNot provide any false personal data to us.\n\n\n\nXII. NO WARRANTY; LIMITATION OF LIABILITY\n\nYOUR ACCESS TO AND USE OF THE SERVICE IS AT YOUR OWN RISK. YOU UNDERSTAND AND AGREE THAT THE SERVICE IS PROVIDED TO YOU ON AN AS IS AND AS AVAILABLE BASIS. WE MAKE NO WARRANTY AND DISCLAIM ALL RESPONSIBILITY AND LIABILITY FOR THE COMPLETENESS, ACCURACY, AVAILABILITY, TIMELINESS, SECURITY OR RELIABILITY OF THE SERVICE OR ANY CONTENT THEREON. WE WILL NOT BE RESPONSIBLE OR LIABLE FOR ANY HARM TO YOUR COMPUTER SYSTEM, LOSS OF DATA, OR OTHER HARM THAT RESULTS FROM YOUR ACCESS TO OR USE OF THE SERVICE. MOREOVER, YOU AGREE THAT WE DO NOT HAVE RESPONSIBILITY OR LIABILITY FOR THE DELETION OF, OR THE FAILURE TO STORE OR TO TRANSMIT, ANY MATERIAL OR CONTENT AND OTHER COMMUNICATIONS MAINTAINED IN THE SERVICE. WE MAKE NO WARRANTY THAT THE SERVICE WILL MEET YOUR REQUIREMENTS OR BE AVAILABLE ON AN UNINTERRUPTED, SECURE, OR ERROR-FREE BASIS. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED FROM THE SERVICE OR OUR REPRESENTATIVES, WILL CREATE ANY WARRANTY NOT EXPRESSLY MADE HEREIN.\n\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, WE AND OUR SUBSIDIARIES, AFFILIATES, OFFICERS, EMPLOYEES, AGENTS, PARTNERS AND LICENSORS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING WITHOUT LIMITATION, LOSS OF DATA, LOSS OF USE, LOSS OF ANTICIPATED SAVINGS, ACCRUED BUT WASTED EXPENDITURE, COST OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, LOSS OF GOOD-WILL, OR OTHER INTANGIBLE LOSSES, RESULTING FROM (i) YOUR ACCESS TO OR USE OF OR INABILITY TO ACCESS OR USE THE SERVICE; (ii) ANY CONDUCT OR CONTENT OF ANY THIRD PARTY ON THE SERVICE, INCLUDING WITHOUT LIMITATION ANY CONTENT, PRODUCTS OR SERVICES PROVIDED BY ANY ADVERTISERS OR AFFILIATE ADVERTISING NETWORKS WE COOPERATE WITH, OR ANY OTHER USERS OF THE SERVICE; (iii) ANY CONTENT AND/OR INFORMATION OBTAINED FROM THE SERVICE OR RELIANCE UPON THE SERVICE OR ANY PART THEREOF; AND (iv) UNAUTHORIZED ACCESS, USE OR ALTERATION OF ANY MATERIAL OR CONTENT, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE) OR ANY OTHER LEGAL THEORY, WHETHER OR NOT WE KNEW OF OR OUGHT TO HAVE KNOWN OF THE POSSIBILITY OF SUCH DAMAGES. IN SOME JURISDICTIONS THE APPLICABLE LAW MAY NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY OR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU. IN SUCH CASES, OUR LIABILITY WILL BE LIMITED TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW. IN PARTICULAR, NOTHING IN THESE TERMS REMOVES OR SUPERSEDES YOUR RIGHTS AS A CONSUMER BASED ON MANDATORY PROVISIONS OF LAW.\n\nPLEASE BE REMINDED THAT WE ARE NOT UNDER ANY CIRCUMSTANCES LIABLE FOR ANY DAMAGES, CLAIMS, LIABILITIES OR COSTS THAT YOU MAY INCUR OR SUFFER IN CONNECTION WITH ANY CONTENT, PRODUCTS OR SERVICES OFFERED BY ANY THIRD PARTIES WE COOPERATE WITH. YOU WAIVE AND RELEASE VRKIWI AND ITS SUBSIDIARIES, AFFILIATES, PARTNERS, OFFICERS, DIRECTORS, EMPLOYEES AND AGENTS FROM ANY LIABILITIES ARISING FROM OR RELATED TO ANY ACT OR OMISSION OF SUCH THIRD PARTIES IN CONNECTION WITH YOUR USE OF THE SERVICE.\n\n\n\nXIII. Indemnity\n\nYou agree to indemnify and hold VrKiwi (and our subsidiaries, affiliates, partners, officers, directors, employees and agents) harmless from any claim or demand, including attorneys fees, made by any third party due to or arising out of your breach of these Terms, or your violation of any law or the rights of a third party. Nothing in these Terms shall be deemed to exclude or limit your liability in respect of any indemnity given by you under these Terms.\n\n\n\nXIV. Entire Agreement\n\nThese Terms, any applicable additional terms included in the Service, and any documents expressly incorporated by reference herein (including VrKiwi Privacy Policy), contain the entire understanding of you and VrKiwi, and supersede all prior understandings of the parties hereto relating to the subject matter hereof.\n\n\n\nWaiver and Severability\n\nOur failure to exercise any rights under these Terms shall not constitute or be deemed a waiver or forfeiture of such rights or a waiver or forfeiture of such rights in the future. In the event that any provision of these Terms is held to be invalid or unenforceable by a court or tribunal of competent jurisdiction for any reason, the remaining provisions of these Terms will remain in full force and effect.\n\n\n\nXVI. Governing Law and Resolution of Disputes\n\nThe laws of Finland, without regard to or application of its conflict of law provisions, will govern these Terms and any claim, cause of action or dispute arising out of or relating to these Terms will be brought solely in the courts of Finland. You hereby consent to the jurisdiction of and venue in such courts and waive any objection as to inconvenient forum. YOU AGREE THAT YOU MAY BRING CLAIMS AGAINST VRKIWI ONLY IN YOUR INDIVIDUAL CAPACITY AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING.\n\n\n\nXVII. Assignment\n\nWe may assign or delegate these Terms and/or our Privacy Policy, in whole or in part, to any person or entity at any time with or without your consent. You may not assign or delegate any rights or obligations under these Terms without our prior written consent, and any unauthorized assignment and delegation by you is ineffective.\n\n\n\nXVIII. Suspension of the Service; Termination\n\nWe reserve the right to discontinue offering the Service or any part thereof (such any particular Game) or to suspend, remove, modify or disable access to the Service at any time in our sole discretion and without notice. Notwithstanding anything contained in these Terms to the contrary, we may also, in our sole discretion, terminate or suspend your access to the Service at any time. In no event will we be liable for the removal of or disabling of access to the Service or any part thereof. We may also impose limits on the use of or access to the Service, in any case and without notice or liability. Upon termination of the Service or a part thereof, your license to use the Service or a part thereof will be automatically terminated. In such event, VrKiwi shall not be obligated to provide refunds or other compensation to users in connection with such discontinuation. Following termination, all such terms that by their nature may survive termination of these Terms shall be deemed to survive such termination. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING OR ANY OTHER REMEDIES AVAILABLE TO US, WE MAY LIMIT, SUSPEND, TERMINATE, MODIFY, OR DELETE YOUR ACCESS TO THE SERVICE IF YOU ARE, OR WE IN OUR SOLE DISCRETION SUSPECT THAT YOU ARE, FAILING TO COMPLY WITH ANY OF THE TERMS AND CONDITIONS INCLUDED IN THESE TERMS OR WITH ANY LAWS OR REGULATIONS, OR IN ANY OTHER WAY HAVE USED THE SERVICE UNLAWFULLY OR IMPROPERLY OR ACTED INCONSISTENTLY WITH THE LETTER OR SPIRIT OF THESE TERMS OR ANY VRKIWI POLICIES. YOU CAN LOSE YOUR USER NAME AND GAME PROFILE AS A RESULT OF SUCH TERMINATION OR SUSPENSION, AS WELL AS ANY VIRTUAL ITEMS OR BENEFITS OR PRIVILEGES. PLEASE NOTE THAT VRKIWI IS UNDER NO OBLIGATION TO COMPENSATE YOU FOR ANY SUCH LOSSES. WE RESERVE THE RIGHT TO TERMINATE ANY USER ACCOUNT THAT HAS BEEN INACTIVE FOR 100 DAYS.\n\n\n\nXIX. Contact\n\nThe Service is operated and provided by Mekiwi Oy. If you have any questions about these Terms, please contact us at info@vrkiwi.org\n\nPrivacy Policy\n\n\n\nLast Updated: March 20, 2018\n\nI. Introduction\n\n\n\nMekiwi Oy (also known as Mekiwi Ltd.) and Mekiwi Oys publishing label VrKiwi (VrKiwi, we, us) believes that your privacy is very important and therefore we are committed to protecting and respecting your privacy. We collect, store, use, and manage the information, including personal information, as a data controller in accordance with applicable laws and in order to provide and develop our game applications and websites (together Services).\n\nAll information collected within the Service is stored on public cloud servers like Amazon Web Services, Microsoft Azure and Google Cloud Platform located in the EU, United States or other countries and regions. In this regard, we take steps to ensure adequate safeguards are in place to enable transfer of information outside EU/EEA and the use and disclosure of information about you, including personal information, as described in this Privacy Policy.\n\nAll our Services are governed by this privacy policy (Privacy Policy) together with our Terms of Use and any other documents referred to in it. By using or accessing a Service you give consent to the processing, use and disclosure of your data. Please do not install, access or use the Services if you do not agree to this Privacy Policy.\n\nWe also reserve the right to modify this Privacy Policy. Your continued use of Services will signify your acceptance of the changes to this Privacy Policy.\n\nII. Information We May Collect From You\n\n\n\nInformation we may collect through your use of our Services include:\n\nSubscribing to our Mailing List: If you subscribe to our mailing list, we will collect your first name, last name and email address;\nPublicly Shared Information: Data that you share via the Service, such as postings in forums, chats, message boards and blogs, and other interactive features of the Service;\nSweepstakes/Promotions: Data that you may provide in order to participate in sweepstakes and promotions. We use this information to notify winners and award prizes, to monitor traffic or personalize the Service.\nGame data: As you use our Services, we collect data about all of your interactions with the Service and other users (such as other players inside the game).\nWhen you contact our support: If you contact us, we collect your name and email address. A record of your correspondence with us may also be kept.\nEmployment information: When you apply for a job, you may volunteer information such as resume, name, email address and phone number. We use this information to contact you regarding setting up an interview or to determine if you are qualified for the position in which you applied.\nGeneral Location data: We collect your location information for the purpose of providing you with the correct version of the application, geoblocking as necessary, fraud prevention and for targeted marketing. We collect this information each time you start using the Service (i.e. when you start a new session on our game) by looking at the information provided with the connection of the Service on your device.\nIII. Analytics, tracking and other Collection Practices\n\n\n\nOur Own Analytics\n\nVrKiwi uses your information to perform its own analytics and to enable analytics provided by third parties. We use analytical information for supporting business analysis and operations, business intelligence, product development, improving products and services, personalizing content, providing advertising, and making recommendations. We use technologies such as cookies, beacons, scripts, and tags to identify your device and to remember things about your visit, such as your preferences. Information stored in a cookie may be linked to your personal information, such as your user ID, for purposes such as improving the quality of our Services, tailoring recommendations to your interests, and making the Service easier to use. You can disable cookies at any time, although you may not be able to access or use features of the Service.\n\nThird Party Tracking and Analytics\n\nOur Services may contain third party tracking and data collection and analytics tools from our service providers, such as Unity, Adjust and Leanplum, which help us analyze and improve our Service. The data collected by data analytics service providers enables us to understand usage patterns of the Service. We may permit these service providers to use cookies and other technologies to perform their services for us. Usage information and personal data are stored by such service providers and are subject to their privacy policies. The current list of data analytics service providers we use in connection with the Service can be requested from us at any time by contacting us.\n\nThe privacy policies of our service providers may include additional terms and disclosures regarding their data collection and use practices and tracking technologies, and we encourage you to check those privacy policies to learn more about their data collection and use practices, use of cookies and other similar tracking technologies.\n\nOther Collection Practices\n\nOur Service includes social media features and widgets, such as the share this button or interactive mini-programs that run on our Service. These Features may collect your IP address, which page you are visiting on our Sites, and may set a cookie to enable the Feature to function properly. Social media features and widgets are either hosted by a third party or hosted directly on our Services. Your interactions with these features are governed by the privacy policy of the company providing it.\n\nIV. The Purposes for Which We Use Your Information\n\n\n\nWe use the personal data collected directly from you for the following purposes:\n\nTo set up and maintain your registration with the Service;\nTo communicate with you;\nTo prevent and investigate fraud and other misuses;\nTo protect our rights and/or our property;\nTo operate and improve our products and services;\nTo manage the Service;\nTo provide features available in the Service;\nTo develop, improve, and protect the Service;\nTo audit and analyze the Service;\nTo ensure the technical functionality and security of the Service.\nFor market research;\nFor electronic direct marketing, in accordance with applicable law;\nTo improve customer service;\nTo personalize user experience; and\nDeliver advertising and marketing and promotional information to you.\nV. Third Party Advertising\n\n\n\nWe may feature advertising within the Service, and may employ third party ad serving technologies to collect information in the Service. Advertising shown to users may be based on your user profile in order to provide personalized advertisements that may be of interest to you, and advertising in the Service may come from affiliate advertising networks.\n\nWe and/or the third parties operating the ad serving technology may use demographic and geo-location information and information collected from your device and/or hardware to ensure that the advertising you see in the Service is relevant to you. This data may include, without limitation, IP address, device ID, installed software, application usage data, hardware type, operating system information, browser information, browser cookies, flash cookies, and in-game information. This data may be used in accordance with this Privacy Policy and the privacy policy of the company providing the ad serving technology.\n\nIf you wish to opt out of certain targeted advertising, you can visit http://www.youradchoices.com and/or www.networkadvertising.org. Please note that the links above may not reach all of our advertising partners and certain targeted advertising may still be displayed to you. If you want to be sure that no targeted advertisements are displayed to you, please do not use or access the Service. In addition, please note that if you opt out of targeted advertising, you will still receive advertising, but it will not be personalized to you.\n\nVI. How We May Disclose and Transfer Your Information\n\n\n\nYour personal data may be disclosed to third parties including third parties located outside the EU/EEA in accordance with applicable legislation and this Privacy Policy. We may use third parties to collect and process personal data on our behalf and in according to our instructions. Nevertheless, we are not liable for the acts and omissions of these third parties, except as provided by mandatory law.\n\nWe may disclose to the following categories of third parties the personal data which you provide yourself to the Service or which we collect in the Service:\n\nService providers, such as data storage service providers, which enable us to provide the Service to you;\nOur advertising partners;\nPublic authorities, such as law enforcement, if we are legally required to do so or if we need to protect our rights or the rights of third parties; and\nOur subsidiaries and affiliates; or a subsequent owner, co-owner or operator of the Service and their advisors in connection with a corporate merger, consolidation, restructuring, the sale of substantially all of our stock and/or assets, or in connection with bankruptcy proceedings, or other corporate reorganization.\n\n\n\nMoreover, we may disclose information to third parties in an aggregate format that does not constitute personal data and does not allow identification of individual users.\n\nVII. What Rights You Have?\n\n\n\nYou have the following rights with respect to the personal data we hold about you:\n\nThe right to know what data we hold about you: If you would like to know what personal data we hold about you, please contact us. We seek to promptly respond to your inquiry.\nThe right to have incomplete, incorrect, outdated, or unnecessary personal data corrected, deleted, or updated. The easiest way to correct, delete, or update the personal data you have provided to the Service is to contact us. If you have additional questions regarding the correction, deletion, or updating of the personal data we hold about you, please contact us.\nThe right to opt out of receiving electronic direct marketing communications from us: all electronic direct marketing communications that you may receive from us, such as e-mail messages and SMS-messages, give you an option of not receiving such communications from us in the future. If you have any additional questions about electronic direct marketing received from us, please contact us.\n\n\n\nIn some cases, we may not be able to remove your personal information, in which case we will let you know if we are unable to do so and why. We will respond to your access request within a reasonable timeframe.\n\nWe only retain your information for as long as needed to provide you Services. Besides the foregoing, we will also retain and use your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements.\n\nVIII. Data Security\n\n\n\nThe security of personal data is important to us. We take reasonable measures to protect personal data related to you against unauthorized access, loss, misuse or alteration by third parties. Despite these efforts to store personal data collected in and through the Service in a secure operating environment that is not available to the public, we cannot guarantee the security of personal data during its transmission or its storage on our systems. Further, while we attempt to ensure the integrity and security of personal data, we cannot guarantee that our security measures will prevent third parties such as so-called hackers from illegally obtaining access to personal data. We do not warrant or represent that personal data about you will be protected against, loss, misuse, or alteration by third parties.\n\nIX. Third Party Terms and Conditions\n\n\n\nYour access to and use of the Services may be subject to certain third party terms and conditions. Please note that VrKiwi does not actually control third-party data collection and therefore is not liable for any such third parties use of your information.\n\nX. Childrens Privacy\n\n\n\nOur Services are not directed to children younger than thirteen (13) years of age. If you are under 13, please do not use the Service and do not send any information about yourself to us.\n\nWe do not knowingly collect any personal information from children under 13 or direct or target interest based advertising to anyone under the age of 13 or knowingly allow such persons to use our Services. In the event that we learn that we have collected personal information from a child under age 13, we will delete that information as quickly as possible. If you believe that we might have any information from or about a child under the age of 13, please contact us.\n\nUsers between the ages of 13 and 17 have given their consent, and they represent, that their legal guardian(s) have reviewed and agreed to our Terms of Service and Privacy Policy as described in our Terms of Service related to the use of Services.\n\nXI. Changes to the Privacy Policy\n\n\n\nFrom time to time we may change this Privacy Policy. You can tell when changes have been made to the Privacy Policy by referring to the Last Updated legend on top of this page. Please review this Privacy Policy regularly to ensure that you are aware of any changes. If we materially change the ways in which we use and disclose personal data, we will post a notice in the Service. Your continued use of the Service following any changes to this Privacy Policy constitutes your acceptance of any such changes made.\n\nXII. Questions or Concerns?\n\n\n\nShould you have any questions regarding this Privacy Policy, your privacy as it relates to the use of the Service, or the protection of the personal data we hold about you, please contact us via e-mail at info@vrkiwi.org\n\n\n\nVRKiwi  2019 MeKiwi.org\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.OkPrivacy policy", "Space Required": "325.8 MB"}



["5 stars\n47%\n4 stars\n25%\n3 stars\n15%\n2 stars\n7%\n1 star\n5%", "zsoccer_05Jul 6 at 12:20 PM\nCave Digger\n\nHi! I have had this game for close to a week now and I have been playing a decent amount during these times. This game has some pros and many cons.\n\nPROS\n\n- The one thing I absolutely LOVE about this game is the ability to upgrade your town. This adds so much to work up to in the game.\n\n- I also love the ability to drive/operate a train and go other places to mine.\n\n- The mining details and animations are on point.\n\n- I like that this game has a semi wide variety of items. Not much and not little, but is fine.\n\n- I also love the radio because it gives you some sort of purpose for why you need to mine .\n\nCONS\n\n- The cave details are not good. While the overall detail is a tiny bit below par for the city and elevator, the caves details are gross. All the walls not including the mineable rocks are just blobs of grey color.\n\n- Why is there a time limit on your mining? Although it is manageable mining with the infinity gauntlet, you have to swing your fist in the air so much. However when mining with the pickaxe you feel so rushed to be finished and throw everything in that little bucket thing in the center of the elevator.\n\n- Glitches. There is one glitch that I cant across MANY times which makes it basically impossible to proceed. When mining after finding four of the five diamond things to put on your fist. you come across a fifth. When the fifth is finally on your hand everything darkens out and you are supposed to smash the earth with that fist. This was all very random because when it is open it looks like the inside of a watermelon! Shortly after the screen darkens again then you go to some sort of end scene where there is an old radio saying a bunch of stuff like this is the end of the game and more. You stay there for around five minutes doing nothing then you finally get teleported back. I had to go through this countless times because when I was mining it keeps coming up.\n\n-There needs to be a bigger variety of pickaxes. The swinging pickaxe that you buy is actually not better than the one you start with.\n\n- The inventory system needs to change. Although I like the hooks to put stuff on, five slots is just not enough for the amount of things you can buy. Also with the inventory being five little circles on your waist, it takes at least 20 seconds to put something there. Once they are and you try to pick something up from the floor by bending down, you will grab one of the items in your inventory instead. This is pretty frustrating given that you are on a short time limit and your are panicking trying to get all the gold and whatever you mine into the bucket thing. Now talking about the hooks, they are pretty useful but sometimes a pain to hang stuff on.\n\n- Movement. I like that you can teleport around and walk around. But, the walking is just too fast. you touch the joystick slightly and you are at the other side of the elevator. It needs to be slower thats all.\n\nThank you for reading this far into my review and I hope to see at least some of these suggestions put into place! This game has a LOT of potential and I am really excited to see what will be done with it as time goes on.\n\n\nSide note, I will be updating this list soon once I am able to explore the other half of the game, like using the train to go to different locations.\n\nHelpful | 58", "xXAstroCatYTXxJul 16 at 8:21 PM\nAlmost Perfect!\n\nOmg I love this game SOO much, it is great, I love how many hours of gameplay it grants! The devs have obviously worked VERY hard to make this game and I LOVE it! I love the going on the train and flying through the tunnels, stopping at different places to mine and feed chompy. I think this might be my favorite VR game. I will say there are a few things they might want to work on though. The inventory definitely does need to be worked on, its a little hard to grab stuff off the ground in the elevator because you grab tools instead, and its a sometimes I grab the wrong tool, idk if the latter could be fixed so Im not gonna let it affect my rating but the inventory might need to be worked on a little. It is also a little hard to put stuff on the inventory belt thing. The other things may need to change is maybe just add a little more time to mine stuff in the elevator, I understand that thats probably what the train is for, so I dont have to race a clock and stuff, but maybe just add a little more time because I want to enjoy the mine a little bit more. One more thing is the pickaxes, not enough of them, the swinging motion on the second one doesnt really do anything, Im not sure if it does more damage to rocks or what idk. Those are they only things the devs needs to work on. If the inventory gets better and maybe a few more pickaxes are added I will 100% make this a 5 star review.\n\ntl;dr\nGreat game 9/10. Add more pickaxes, make it easier to pick up stuff without accidentally grabbing something from inventory, make it easier to put stuff in inventory, maybe give a little extra time in elevator. If more pickaxes are added and they make the inventory a little better Ill change this to a 5 star review.\n\nP.S. Sorry if there are any typos Im on phone and wrote this quick.\n\nP.P.S forgot one thing, please make it so instead of getting stuck inside of things like the bucket in the middle of the elevator please make it so it just teleports you out of the bucket instead.\n\nHelpful | 2", "PalmksJul 14 at 10:10 AM\nCrashed 2 times.\n\nI played it for almost 56hrs on the straight on the quest to gather items and achievements and money for purchases and it crashes like a video glitch. I like the game but it need more. Im quite upset.. I really like this game, maybe its the headset or maybe its the game not sure. Until its fixed I cant continue to play further it just seems like a waste of time..\nStill love the game just wish it was updated more often. It would be cool if there was a random miner in town every now and then to assist you when your near a goal or need help explaining something. Still love the game...\n\nHelpful | 1", "NoteElchApr 15 at 2:12 PM\nDiggy Diggy Hole by Yogscast\n\nBrothers of the mine rejoice!\nSwing, swing, swing with me\nRaise your pick and raise your voice!\nSing, sing, sing with me\nDown and down into the deep\nWho knows what we'll find beneath?\nDiamonds, rubies, gold and more\nHidden in the mountain store\nBorn underground, suckled from a teat of stone\nRaised in the dark, the safety of our mountain home\nSkin made of iron, steel in our bones\nTo dig and dig makes us free\nCome on brothers sing with me!\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, diggy, diggy hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, digging a hole\nThe sunlight will not reach this low\nDeep, deep in the mine\nNever seen the blue moon glow\nDwarves won't fly so high\nFill a glass and down some mead!\nStuff your bellies at the feast!\nStumble home and fall asleep\nDreaming in our mountain keep\nBorn underground, grown inside a rocky womb\nThe earth is our cradle; the mountain shall become our tomb\nFace us on the battlefield; you will meet your doom\nWe do not fear what lies beneath\nWe can never dig too deep\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, diggy, diggy hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, digging a hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, diggy, diggy hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, digging a hole\nBorn underground, suckled from a teat of stone\nRaised in the dark, the safety of our mountain home\nSkin made of iron, steel in our bones\nTo dig and dig makes us free\nCome on brothers sing with me!\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, diggy, diggy hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, digging a hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, diggy, diggy hole\nI am a dwarf and I'm digging a hole\nDiggy, diggy hole, digging a hole...\n\nHelpful | 81\nDeveloper ResponseApr 16 at 9:28 AM\n\nI am a dwarf and I'm digging a hole Diggy, diggy hole, diggy, diggy hole!", "Matt6611Jul 3 at 2:39 PM\nVery fun game\n\nThis is a very fun and addicting game. It does have its issues though.\n\nYou get caught on the mining cart you throw you gems into and can't move. You can't move on the train sometimes. But this can be solved by using the teleport movement.\n\nIt would be nice to have a pause menu (not just a useless picture when pressing pause) and also a quick reference sheet that shows how much each gem is worth.\n\nHaving said all that, its still a great game.\n\nHelpful | 1", "BwkeefeJun 25 at 6:25 AM\nFun gameplay bad graphics\n\nThe gameplay is satisfying and fun. However once you go by train into the caves its basically a stray blob. I expect a visual downgrade with quest games but this game is legit gross in the caves. The mine however and the the town all look beautiful.\n\nHelpful | 1", "NeverWrongMar 5 at 5:40 PM\nAddicting Fun, Unpolished, Potential\n\nUPDATE: I am adding a star to my initial review due to the developers response. I like that he or she took the time to respond and are actively checking their reviews for feedback. Additionally, I havent come across these other worlds yet, which is intriguing. I am no longer on the fence. I am keeping the game and look forward to exploring it further.\n\n\nOriginal review:\nI decided To get this game based on the many stellar reviews.\n\nAfter my son and I took turns playing for about an 1.5 hours, I am still on the fence on whether or not to keep it or return it.\n\nThe gameplay is addicting and there are little unique touches that are just really fun. Without giving anything away, I love the different endings and that you can keep going and not lose anything after the endings if you want to (at least for the two I experienced). The reason I am on the fence is 1. The graphics. When you are not in the elevator, they are just really bad on the quest. Its dark, dreary and hazy. When I ventured to the edge of the buildings in town, the lighting actually got brighter and it was a short lived delight. When you are used to playing so many games with crisp graphics on the Quest, the scenery makes you feel like you are playing a first draft of am amazing future release. I struggled to enjoy this game at times due to eye strain and the blurry setting during the train ride made me nauseous. Which brings me to the 2nd reason I am on the fence. Motion sickness. Although there is the ability to teleport, its not always consisted and when you are in the elevator, you instinctively end up using smooth movement because of the time limit.\n\nOverall, this game will hopefully be amazing one day. Like I said, it is super fun and incredibly addicting, even with its faults. The train is a fabulous touch, the decision to allow for the gameplay to keep going even after you reach one of the endings was a wonderful decision and the many tools and upgrades you can buy with your mined profits, keeps the player engaged. Its the unpolished scenery and movement controls which bring this game down. Its a shame since the talented developers really have something special here.\n\nPs. For those of you concerned over the games Teen rating for drug use. Nothing to be concerned about in my opinion. I am guessing this is related to the mushrooms. If you eat them, one of those little unique touches that are just really fun comes into play. My young son just took it as a funny Easter egg type thing and it is. So far the game is quite wholesome and once polished up for the Quest, I could see this as being a must have for the kids.\n\nHelpful | 34\nDeveloper ResponseMar 5 at 1:53 AM\n\nHi and thanks for your comprehensive review. We're happy that both you and your son are enjoying the game! We decided to offer both teleport and free moving so players can decide which to use. There are things we look to improve on the graphical side. On the eye strain, there are other worlds which are more brightly lit than the first one. Nice to hear your comment about the rating - we agree it's a non-issue. Also there might be something important in one of the mushroom Easter eggs :) Thanks again and happy digging!", "lettucegyyMay 6 at 11:40 AM\nSuper addictive\n\nIts a simple, mining game, except its not. It has TONS of things to do, like punching the world to bits to feeding your treasure chest pet. If you finish everything in the little space of your mining area, thats basically only 40% of the game done. Since recently I got this game, I play it super often and never get bored and Im still not done with the game. Its also got those creepy vibes to it, adding even more effect as if you were in a real mineshaft. Would recommend. Super fun.\n\nHelpful | 4", "burleighpJun 28 at 9:47 AM\nYes\n\nIt is very epic yes\n\nHelpful | 4", "TheAncientWarriorJul 6 at 8:50 PM\nI love it!\n\nThis game makes me feel like a real miner, I love it a lot!\n\nHelpful | 0", "squiddy5Jan 29 at 2:47 PM\nI am a dwarf and Im digging a hole\n\nBrothers of the mine rejoice swing swing swing with me! Raise your pick and raise your Voice! Down and down into the deep who knows what well find beneath? Diamonds Rubys gold and moar hidden in the mountain store.\n\nHelpful | 115", "jaxontoMay 8 at 7:29 AM\nGreat game but\n\nI love the game but when I purchased the first key I tried to put it in the vault in the mine shaft but I ran out of time and I was brung back up ok but the key was nowhere to be found and I am inshore what to do but over all except that and some times the speed of the game drops but is a great game\n\n\nI will ad another star if I can find what happens to the key. It took awhile nut the key reasoned in the dinamite box\n\nHelpful | 0", "THEVICMAN125Apr 14 at 5:26 AM\nFun game\n\nThis is an amazing game but with my quest it wont uninstall my left controller was being tracked but buttons did not work problom with controller not game so I went to another game tho to see if bbn it was the game but it was beat saber the game where you dont need to press buttons so I tried uninstalling it andnits stuck that's a problom with my quest not the game\n\nHelpful | 3", "SomewhataddictedJul 4 at 8:15 AM\nLost all progress\n\nI lost ALL of my in game progress for no reason! I put HOURS into the game and all of it's gone\n\nHelpful | 0\nDeveloper Response12 days ago\n\nSorry dude. I think it was some kind of file system corruption on Quest/Android. We have a backup save system in the next patch, should be up next week.", "JoshgregApr 3 at 1:27 AM\nIts a good game but movement gets stuck\n\nIts a good game it takes a few hours to beat it and its always fresh the idea of the game is to figure out how to get all the achevements its like a massive puzzle. You have to think outside the box to get all the game endings there should be some sort of award for getting all of the achevements. And exploration should be rewarded a bit more i kept going down a long cave right at the beginning thinking something would change but it nevet did now looking back that entire cave was a pointless long dead end. I had fun playing it for hours its the only vr game that i didnt beat the same day i bought it honestly it doesnt have much replay value but i had fun none the less. Its defenately worth buying more so then alot of other vr titles ive bought from the quest store. but there are a few issues its still playable but it can get annoying.\n\nSpoilers\n\nIn the cave you get a bud who collects stuff with you when you drill for oil your bud collects the oil that comes gushing out of the rock but he never stays under the stream he moves around and sometines never collects even a single drop of oil from the streams making the oil collecting just annoying and not worth it. He also runs into you when your smashing rocks tring to get the treasure thats falling out which isnt too bad but you can get stuck on him and not be able to move the solution is to make it so you can walk through him as if he werent there. Just a gripe but when i open a chest he swoops in and i dont even get to see what i found honestly it just feels rude lol.\n\nAnother issue is getting stuck when ever you move your arm or head like on the train ive gotten stuck on the train so many times just because i turned around or took a step back and then i cant move forward i have to clumsly teleport out of there. And when your i the cave walking and your trying to smash the rocks the same issues can happen in which you get stuck on all the propa and cant move (the moving buddy can make this even more annoying if hes also in the way)\n\nThe radio announcer just stopped talking i upgraded the radio and heard a bunch of news storys but when i hopped back on the radio was gone and i didnt hear the radio storys anymore or the voice of the radio man unless i get the special endings or buy an upgrade the music became kinda droneing on. My suggestion is a volume knob and buttons for different channels music radio man the news woman and a hints system where they tell storys on a talk show style station and the clues are hidden in the storys.\n\n\nOne last issue i have which is one which really ruins the game for me is the final achevement dimensional war ive watched walkthroughs on how to get it and seen videos of others getting the achevement. But when i attempt it i leave the item in the mine shaft and wait till i get back up to the saloon the item despawns from the mine shaft and is back in the saloon making it impossible to get the achevement as in needs to be activated while down in the mineshaft then another run needs to be made then you get the achevement. Its the only one i dont have and many people have the same issues i do because there are little to no people with the achevement online and so much misinformation on how to actually get it online people keep making up storys online just to brag and make people think they have the achevement.\n\n\nIf the developers can fix some of these issues then the game wouldnt have any issues the ones ive mentioned are simple annoyances\n\nBut the last one is a deal breaker for me it leaves the game uncompleteable\n\nHelpful | 4\nDeveloper ResponseApr 4 at 9:17 AM\n\nHi and thanks for the comments! In our level design we do try to reward exploring and there actually is a reward in the long dead end you mention. A hint is try to use the scanner and follow the beeps. There is lots of hidden stuff you can find. Chompy is sometimes a bit unpredictable I agree, but if she keeps failing you can catch the oil with the bucket. I hereby promise to code her oil catching better in the next patch! You should be able to change the train radio channel (ch1 is the soundtrack and ch2 is the story). Dimensional war is definitely achievable, but it is hard. Drop by our discord (https://discord.gg/TmcuAv) for help! Again thanks for playing the game and commenting, we look to improve some things still!", "nicolas.sank.314 days ago\nBUY NOW\n\nThe glitched stopped and I just got the train. Now that the square is gone the game is amazing *spoilers* I love when you destroy the world it is made out of watermelon. Looking forward to the rest of this amazing game\n\nHelpful | 0", "devilgloryFeb 27 at 8:37 AM\nBorn underground,\n\nSuckled from a teat of stone\nRaised in the dark, the safety of our mountain home\nSkin made of iron, steel in our bones\nTo dig and dig makes us free\nCome on brothers sing with me!\n\nHelpful | 10", "MISTEREPICMAN36910Apr 23 at 11:43 AM\nBEST GAME EVER but one thing\n\nThis is the best game ever made but one bug last time when I was in the train I lost battery then I lost the last key I had the last key to the safe I just want the last key of the game please\n\nHelpful | 3\nDeveloper ResponseApr 25 at 9:25 AM\n\nHi there and thanks for the comment! The keys you have found should spawn in the elevator. If there's one you haven't found, come to our discord for some tips! https://discord.gg/aGHj4W", "james.vanderburg.5Apr 7 at 4:39 PM\nGlitches and freezes\n\nHonestly I like the game, its a great concept the only issue I am having with it is e every time I play it the game either freezes or has some weird pixelated glitch across the screen. Please fix these performance.\n\nHelpful | 2\nDeveloper ResponseApr 16 at 9:34 AM\n\nHello and thanks for commenting! Could you please hit us up at support@mekiwi.org so we can try to sort out your problem?", "5tanFeb 17 at 5:50 PM\nThis is so good\n\nThis is simply the BEST VR GAME EVER i bought it thinking i would be sick of it in a day.. the game proved me otherwise its really simple to master theres alot of endings and upgrades and even aliens.! Yes!! You heard me aliens!!! This game would even be worth it if it was 40 euros i recommend this game to every quest and rift owner! I hope to see some future upgrades or maybe a new cave area to unlock and maybe something like a display to put the keys in and the goggles since they keep appearing even if you finished that ending but theres literally no other downside to this game.. Developers please keep evolving this game!!\n\nHelpful | 6", "SacktheKitsuneFeb 1 at 5:59 PM\nId like it more if this hadnt happened\n\nI unlocked the diamond dimension and a few minutes in everything started glitching out. Ive tried everything to fix it, but theres a black box in part of the screen and everything is pulsing and disappearing and reappearing and see through. I dont know what Ive done. I dont know how to fix it aside from restarting. Im a bit bummed out by this.\n\nHelpful | 12\nDeveloper ResponseFeb 19 at 11:16 AM\n\nHi! Sorry for the trouble you're having. Could you please take a screenshot/pic of the problem and email us at support@mekiwi.org? We haven't encountered this bug in our testing so any help sorting it out would really be appreciated!", "UncagedTigerMay 10 at 9:53 AM\nIncredible game\n\nOne of the best games on the quest. It is a bit motion sick on the train though\n\nHelpful | 1", "Chucklenuts8822Mar 10 at 2:09 PM\nLots of content but needs improvement\n\nThis gave has a lot to offer and can keep you entertained for quite a while. At times this game almost feels like a puzzle game trying to get all the achievements which keeps you interested. However, despite all this there are a few gross parts. The graphics leave something to be desired and a lot of the textures look kinda crusty. Also, grab a swatter, theres a lot of bugs. bugs ranging from objects just deciding to stop existing, to phasing out of bounds with the teleport function. The controls are also pretty clunky and can be frustrating at times. All of the mentioned problems can be immersion-breaking, but with so much content its hard for me to complain, and besides these mentioned problems, I had a lot of fun with this game. (Also, 3/5 not necessarily in a bad way, just kinda like a 7/10)\n\nHelpful | 2", "thewhatbroMar 1 at 2:14 PM\nDigging\n\nI liked it it was fun but I couldnt find any uses in the caves when you got on the train and the golden statue I was feeding just stopped I wish there was more to it but other than that it is a great game.\n\nHelpful | 2\nDeveloper ResponseMar 5 at 1:44 AM\n\nHi! Thanks for the comment. There are 3 golden statues and all must be fed. Also try getting the rail repair kit in order to progress to different worlds.", "brooksimusFeb 29 at 5:07 PM\nBlack box glitch\n\nI was mining and then a black box appeared in my screen, i left the game and joined back and to my surprise it was still there. Still is a very good game though.\n\nHelpful | 9", "CombyneJan 19 at 11:41 AM\nMining Simulator VR\n\nThis was one of the first paid games I played, and, honestly, I really like it. For its gameplay mechanics and graphic quality, its pretty good, especially now being able to travel to different areas to mine. Definitely recommend it.\n\nHelpful | 15", "RazorlornMar 13 at 11:01 AM\nFun\n\nMy kids loved it. They play minecraft alot so it's a perfect fit. Haven't tried myself but will update review when I do.\n\nHelpful | 1", "kreekidMar 24 at 7:09 PM\nGood\n\nIt is fun till you run out of things to buy\n\nHelpful | 0", "chaderrFeb 25 at 10:05 AM\nYou can literally be thanos.\n\nI was playing collecting the gems for the right hand and if you hold and punch rocks you destroy them\n\nHelpful | 6", "EssentiallyFalseFeb 4 at 10:01 PM\nGreat game, not so great bug.\n\nI played the beginning section and was pretty interested but I couldn't wait to unlock the train. Once I did unlock it and tried to drive it a flashing black rectangle appeared on my screen and made the game unplayable... I restarted my headset, reinstalled the game but nothing worked. Please fix this, I really don't want to keep repeating the same thing..\n\nHelpful | 4\nDeveloper ResponseFeb 19 at 11:12 AM\n\nHello and thanks for your comment! This problem sounds really weird. It would help us if you could take a screenshot/pic of the black rectangle and email us at support@mekiwi.org. Let's see if we can sort it out:)", "Lawolf-QuestFeb 1 at 7:15 AM\nNow this is under rated\n\nThis game is like if a mobile game had a baby with a Chinese sweat shop worker...\nand I mean that in the best way possible\nThis games upgrade system always keeps you coming back for more\nAnd it honestly would be a field day for speed runners!\n\nHelpful | 5", "htuckerxMar 15 at 12:48 PM\nI love it\n\nI love driving the train around town give u more play to it\n\nHelpful | 3", "MacnovaJun 28 at 5:48 PM\nWish it were coop\n\nThis game is freaking awesome but it would be a lot more fun if I could play with a friend especially once you get the train going\n\nHelpful | 0", "FunnyOreosJun 24 at 9:00 PM\nFunnyoreo\n\nYeah its pretty epic yes!\n\nHelpful | 0", "Raty460Mar 9 at 6:48 PM\nMy whole game is reset\n\nFirst off great game I played this game a ton and had a lot of fun in the process but my whole game reset and now I am back at nothing which sucks a lot for me because thats a lot of progress that went down the drain\n\nAlso quick suggestion I think you should make a button to skip the ending credits because it becomes a pain to go through them over and over\n\nHelpful | 4\nDeveloper ResponseJan 8 at 8:02 AM\n\nHi and thanks for the comment! Sorry for your troubles, could you please explain what happened to support@mekiwi.org so we can try to correct it? One star rating for a great game does sound weird so let us help you!", "Kings_CastleJan 13 at 2:40 PM\nOMG THAT'S COOL!\n\nI hate Tycoon games. And I always have. I don't know why exactly but there just not my type of game. BUTT! Cave Digger feels different... Again, idk what it is exactly, but there's something to it, that just makes you keep playing. My very first session where a whopping 3 hours until my Quest told me that it's battery was dying... And I still have fun! After completing the first section and buying some upgrades outdoors of the saloon, I still just sit down on my chair, hop onto the elevator and start mining some ores while relaxing!\n\nIn Conclusion: I totally recommend this Game to everyone. Newcomers who have trouble with motion sickness are just as well served like VR-veterans like myself. Go Buy it!\n\nHelpful | 2", "MadarasFeb 25 at 4:33 PM\nThe worst VR Sickness\n\nSo the game play isn't too bad, but I have not had this much VR sickness in a long time. I highly recommend not playing in stationary mode.\n\nHelpful | 2\nDeveloper ResponseApr 5 at 12:04 PM\n\nHi and thanks for commenting on our game! Could you please let me know what was causing the sickness? Based on our feedback it is very rare, so if it was free move, teleport or the train locomotion which was causing it, the info would be appreciated.", "Lil_TyrantJan 9 at 9:09 PM\nMore upgrades\n\nI wish there was more upgrades to buy but still a really fun game in general\n\nHelpful | 5", "virtual-twistFeb 24 at 8:32 AM\nOMG\n\nThis is the best game ever\n\nHelpful | 3", "isosamppaJan 3 at 4:26 PM\nFun to spend time in it\n\nI have followed the process of the game and finally had the chance to play it. I have experienced two different endings. I heard that there are like 8 of them. Still exploring, digging and shopping. Well done guys!\n\nHelpful | 4\nDeveloper ResponseJan 8 at 8:05 AM\n\nThanks isosamppa, have fun diggin' and discoverin' and join us at https://discord.gg/xP2QC5b !", "daydream9091Feb 15 at 12:54 PM\nBest game\n\nBest game ever really its worth a million dollars!!!!!!\n\nHelpful | 3", "Broken_LambchopSep 20, 2019 at 6:23 PM\nWhy time limit when you are mining\n\nUPDATE: Quick reply from Developer, thank you. Train mining has no time limit. No comment about no menu or settings.\nI wanted to love this game but, the time limit when you are mining makes you rush to get everything possible. It is not the relaxing experience I was hoping for. Please add option to mine without a time limit. No menu or settings? No instruction or description when looking at new tools. If you pick up a new tool, you bought it.\n\nHelpful | 103\nDeveloper ResponseSep 20, 2019 at 9:03 AM\n\nHi! Please do persevere and purchase the train activation lever. You won't have time limits in the train caves.", "hightechfoolDec 10 at 1:56 PM\nNot perfect..but very fun for the price\n\nThe actual 'mining' part in this game is VERY fun... but there aren't a whole lot of places to explore. You can unlock a cool train to take you places, that really adds alot. Other than that, that's about it though. Still lots of replayability and fun mining action\n\nHelpful | 9", "EEMMar 18 at 3:22 PM\nPoopy\n\nPoop\n\nHelpful | 3\nDeveloper ResponseApr 5 at 11:57 AM\n\nZooty Zoot", "ryman647Feb 2 at 9:44 PM\nYou can Chris Redfield stones\n\nYes\n\nHelpful | 5\nDeveloper ResponseFeb 19 at 11:24 AM\n\nYes", "matthewfrank49Jan 2 at 6:18 AM\nGood\n\nI like this game so far, but I wish I should be controlling the elevator and didnt have a timer on mining to go back up to the main floor to cash out and go back down\n\nHelpful | 4\nDeveloper ResponseJan 8 at 8:03 AM\n\nHi and thanks from the nice comment. The elevator is just the start, the train is where the real (non-timed) game is.", "psully4114Dec 11 at 10:38 AM\nI had a lot of fun with this\n\nThey update the game pretty regularly adding content and bug fixes periodically and its one of my favorite games. Theres still a fair amount of jank in here but its more than serviceable and theres a lot to keep you coming back if you don't mind a bit of a grind.\n\nHelpful | 5", "aaron.sommers.1253Mar 6 at 12:48 PM\nAlot of fun\n\n.\n\nHelpful | 1", "FloatLilGoatJan 12 at 1:21 AM\nDope.\n\nThis game is dope can't wait to see what the dev do :)\n\nHelpful | 2", "brent.ritenour.16Jan 19 at 4:31 PM\nVery boring\n\nI found myself bored of mining in 30 minutes when I got the train same thing definitely do not recommend and bad graphics\n\nHelpful | 5", "idontkn0wDec 27 at 1:48 PM\nAmazing\n\nGraphics are meh, gameplay is great, chaos gauntlet is op and overall it's just a pretty decent game 10/10\n\nBut it could be better if we had a menu or settings\n\nHelpful | 3", "Chad_CoolingtonDec 17 at 9:48 PM\nCave Digger is a spectacular game!\n\nCave Digger is one of the best vr games Ive ever played, it has countless achievements and endings ranging from easy to nearly impossible this game is one Ill be playing for a very long while.\n\nHelpful | 2", "PaulAshbyDec 15 at 3:44 PM\nWorse than ever now I get about 2 minute\n\nGood fun game but keep getting large black square appear in front of screen then have to switch game off. It doesn't happen in any other apps and it's happened since I purchased the game, shame because it spoils the fun when you are halfway through a game\n\nHelpful | 3\nDeveloper ResponseDec 26 at 5:56 AM\n\nThis is unfortunate, sorry for your bad experience. This hasn't happened in our internal or Oculus testing so very hard finding if it's us or the platform. It would help if you could send us a screenshot or an image of if at support@mekiwi.org though!", "thewilsonixJan 20 at 10:09 AM\n\nGood\n\nHelpful | 1", "HelloAlice2019Sep 19, 2019 at 5:17 PM\nFun game and cross-buy\n\nI bought Cave Diggers on Rift right before deciding to purchase Quest. So I wanted to say THANK YOU to developers for making this game cross-buy!\n\nThe gem/gold mining in this game is fun, addictive and gets the whole body moving (which is what makes VR gaming so much cooler than using keyboard, touch screen or Xbox controller)\n\nHelpful | 40", "JWheezySep 28, 2019 at 9:07 PM\nI went too far!\n\nPretty cool mix of addictive mini game action and a puzzle adventurer. Tons of upgrades for your equipment, town and ability to explore. The mine shaft play is a lot of fun and the various mining equipment and loot is beautifully detailed. Coming out of the mine at first is a little disappointing. A pretty bland room littered with unbreakable glass bottles. Why do these exist?! Once youre outside and unlock the train (can be done very quickly) things get exciting. This is the first time playing my Quest where I traveled too far away in the game from my home base and decided I better turn back and regroup. I know there are lots of mines and environments and equipment to unlock and I have no idea what that will be like.. and that is exciting!\n\nUPDATE: jumped back in the game after a few days and I could swear I heard some glass break. So straight to the bottles I went and.... yes they now break! What a time to be alive ladies and gentlemen and non-binary peoples!\n\nHelpful | 21\nDeveloper ResponseSep 29, 2019 at 11:01 AM\n\nThank you for noticing we react to comments! Some of the bottles were a bit over eager to break.", "brian.arrighettiOct 20 at 3:48 PM\nSeems like Ive got no choice...\n\nI blew past the Oculus time limit of 2 hrs, so no chance of a refund. Not that I would even consider it for this game.\nI got it because I wanted to treat myself, and BOY did I.\nI stumbled through a few levels before I realized that anything on the floor was lost once the elevator started to move, so I made sure to grab all gems as quickly as possible and throw them into the hopper. The short time limit in the first mine was acceptable, because I could go back down as often as I wanted. It also gave me multiple chances to try my tools and figure out how to work them.\nI finally got the bar to start the train (literally just before writing this review), so the adventure continues.\nMy only two complaints are that 1) its tough to play this sitting down because the top set of rocks are too high and 2) I need a larger play area than my kitchen, otherwise I keep running into things in the real world. That last one, however, is my problem, not the games.\nBottom Line: I would advise any of my friends to get this game. You set the pace and expand the world as slowly or as quickly as you want!\n\nHelpful | 6", "TropheusJayNov 18 at 6:54 PM\nFun but seems more like a demo\n\nI really enjoyed it but I have a few complaints:\n\nFirst, general complaints.\n1. The pause menu. Why is there an achievement menu but no pause menu? Why cant I see what the achievements are?\n2. The point on the screen where the quality drops off is extremely noticeable in well lit areas. I understand that its there because of limits of the quest but can there be a more gentle transition?\n3. The gauntlet. The whole charging up thing is annoying. Why does it light up even when I just grab something? Why cant I change which hand its on? (Pause menu would help with that) I still have no idea how the flying hand projectile is activated.\n4. The shop. I would like to know what Im buying before buying it. Otherwise, its fine.\n5. The belt thing. I always grab thing from it when I just want to pick up a loose gem. Maybe move it up a bit? The slots are too close together I think.\n6. The general store. Why would I want to buy those things? I bought the well upgrade and so far its been $5000 wasted. I understand some like the train lever and Im guessing the gas mask is important later on but why can I make the well well-er?\n7. The length. I got to the first ending about an hour and a half in which is my main reason for comparing this to a demo.\n\nI had few problems with the elevator section. One was the glow from the special gems that go on your hand. It blocks your view of the surroundings and is overall obnoxious and should be toned down.\n\nNow, the train. Here, most of my complaints are from the chest companion, but there are others too. First, why is it structured like a horror game? Long pathway with big open areas that you cant see the end of and branching, twisting paths. I found the holy hand grenade and had a mild panic attack when I saw the gravestone ignore that in quotes, I didnt know it was just random treasure loot. But still, why is there a gravestone? A nd now its time for the moment youve been waiting for: the mimic. I have no idea how it works. It sells things, I get that. But can I tell it where to go? What does it mean when it turns red? Why does it sometimes vomit? Im just so clueless. Also, THE PATHFINDING. It just lets oil spill everywhere while there is nothing else for it to do. Even when it acknowledged the oils existence it just stands NEXT to it while none gets collected and just has its mouth wide open.\n\nOverall, seems like the midpoint between a demo and full game currently. I did have a lot of fun and this should be taken constructively and not negatively. I hope there will continue to be updates.\n\nUpdate: I have discovered that for the post office at least, upgrading building unlocks new things. But this caused me to find something else. Why are the doorknobs so hard to use/useable at all? I havent been able to get and doors with interactive knobs to open even after struggling for 5 minutes.\n\nHelpful | 8\nDeveloper ResponseNov 24 at 1:36 AM\n\nHi and thanks for the feedback! Some of the endings are easily reachable and others can take 6-10 hours, depending on how thorough you are. As for the bugs, I can tell you that we are working on a new content patch which will be released in the next couple weeks. It's adding a new tool (the Magnetogun), a new ending scene, a loot display cabinet and new functions for the building upgrades. Stay tuned!", "mikedragonusaDec 28 at 11:05 AM\nTHIS GAME!!\n\nPerfect example of what the virtual Reality aspect has to offer!! Mine Away !!\n\nHelpful | 1", "NautilusMCSep 21, 2019 at 7:44 AM\n\nMy only issues with the game so far is that Everytime I use smooth movement in the elevator I get stuck on every object and have to teleport or walk irl to get out of it, and there's no labels or descriptions on the items in the shop so I don't know what they do and how they are better, but besides that I am really enjoying the peaceful and addictive gameplay! Hope those issues get fixed soon!\n\nHelpful | 20", "LilSpiderBoy7Dec 26 at 1:53 PM\nGood\n\nVery good\n\nHelpful | 2", "vr-master2020Nov 24 at 4:21 PM\nVery good game\n\nA incredible game one of my favorite but it will be cool if you can avoid the infinite gauntlet because I keep getting it and I will like to know when you get into the credit screen why are there 2 big lizards running in circles but even still a very good game\n\nHelpful | 1", "BlackLion31Jan 13 at 7:49 PM\n\nVery fun!!\n\nHelpful | 1", "xX-IceCubez-XxSep 21, 2019 at 5:45 PM\nMore than expected\n\nI got this game thinking it may be a waste of money, since it's simply a mining game. This game is far more and way better. I played from 100% battery to none just with this game. The graphics being terrible is really made up for with content. Only problem I've had were minor glitches such as giant versions of the bucket in the ground, and sometimes not being able to put items on my belt. Other than that's this is great.\n\nHelpful | 12", "toddjodiJan 13 at 8:28 PM\nVery tedious\n\nNot a bad game just repetitive,\nWould love to see no time limits.\n\nHelpful | 0\nDeveloper ResponseJan 14 at 12:57 PM\n\nHi there and thanks for the comment! The time limit is only in the \"starting area\" elevator, most of the game is free roam once you unlock the train. Persevere!", "Megabyte_gamerOct 30 at 10:21 PM\nAn honest review of my experience\n\nSo for starters, this review will contain spoilers for some of the endings in the game so be warned.\n\nCave digger is a good game to play. From the engaging mining experience that tests your swinging abilities to the many endings the game has to offer, this is a fun game to either play either by yourself to grind money or with your friends to see who can get the highest score. so far when it comes to endings, I've blown myself up with a nuke, blown the overworld up with a nuke just to return to an atomic wasteland, sent the elevator into space with a nuke, turned into the equivalent of thanos by collecting 5 infinity stones and destroying the earth, and put on a set of VR glasses and went to a retro version of the game. So what I'm trying to say is that it's a great game to play on any occasion.\n\nNow if you're wondering why I made this a 3 star review instead of a 5 star review, it's because of the huge bug that I discovered that caused me a lot of trouble. So when I got back into the game after the first nuke ending, there are supposed to be upgraded versions of the tools that you can buy after you bought the originals but they were nowhere to be found. The only thing that was left for purchase was a key that you would buy to help unlock a secret vault in the shafts. I remembered seeing the upgraded tools in the shop before I set off that nuke but now they just dissapeared. So I played some more and unlocked a few of the endings before the thought hit me that maybe if I reset the game, then the lost items would return. So after resetting the game, sure enough, when I waited to get the tools, the upgraded ones finally appeared. Now recently I left VR to do something and when I tried to reenter cave digger, the game wouldn't load. So now I've been forced to uninstall the game and then reinstall it to see if it's still broken. So if VR kiwi could patch these bugs out of the game, I would rate 5 stars in a heartbeat.\n\nOverall, this is a great game with a few major flaws that can easily be fixed. I would definitely recommend this game to you if you have the money to pay for it and the perseverance to get through any possible glitches.\n\nHelpful | 8\nDeveloper ResponseNov 24 at 1:38 AM\n\nHi, thanks for the nice review! We've included a fix for the missing shop items in the next patch. As for the loading problem, that one we've never encountered before. Hope you got it working, otherwise throw us a line at support@mekiwi.org.", "RequiemieroOct 4 at 6:13 AM\nFun, but buggy\n\nI really love games where you can buy upgrades to make things easier and that is a core part of the game play here which is great. But unfortunately after unlocking the train, the upgrades in the saloon for the tools that I still haven't gotten have completely disappeared except for the dynamite and the black key. I did not have the chance to get the second upgrades of the drill, bucket, sensor, or the artifact saw. This is putting a damper on my experience. Also, I am not sure how to control the infinity glove and it is annoying that it will randomly shoot off fists of light every few seconds. Plus, when using smooth locomotion, it is very easy to get stuck in walls, and the only way to get unstuck is to teleport out. All of that is annoying but manageable.\n\nBut the worst bug of all is that sometimes the game will start breaking up or glitching the screen with black boxes and I can barely see what's going on. It looks like static going in the middle of the screen, and it doesn't happen in any other game, and the only way to fix it is to restart my headset.\n\nUnlike some other people, I was able to figure things out without a separate tutorial because I personally think the glass pictures in the mine and the radio announcer's spiels are informative enough.\n\nOverall, I really like the train and the stuff you find in the caves. I am also excited to spruce up and upgrade the town. Mining is addicting and somewhat relaxing, minus the time limit in the first mine shaft. Please fix the bugs and I will rate 5 stars.\n\nHelpful | 5", "blairebear88Jan 2 at 5:47 PM\nNot super impressed\n\nIt was okay. Graphics were glitchy and basic. Just wasnt what I was looking for.\n\nHelpful | 0", "ThePhimotionOct 1 at 12:27 AM\nPretty fun game, not enough tutorial\n\nAll in all a pretty fun game, not very much when it comes to tutorials though. Lots of having to find how things go on my own and whatnot but I'm enjoying it. A tip though if you're a standing player like me: place something on the ground like a yoga mat or something so you know where to stay. I cannot tell you how many times I've smacked my walls while mining away.\n\nAlthough I wish it had more tutorials or at least some general info, it is a very enjoyable game and hardly triggers my motion sickness.\n\nHelpful | 6", "FeroxDrakenOct 5 at 11:11 PM\nFun but glove is OP\n\nI played for a bit and enjoyed the experience, then I got the glove. Suddenly the game became too easy as I realised how to find and acquire the power gems. Now I'm just waving my arm around smashing everything and I haven't even got to train mining or the outside! Finally, I can keep finding the last gem and keep destroying the world causing me to sit through an unskippable cut scene when I'm just looking for money to go outside... Please make the Glove gems harder to acquire and make it end game content and once I've seen the credits I don't need to see it again! It was only funny the first time...\n\nHelpful | 3\nDeveloper ResponseOct 8 at 5:06 AM\n\nHi and thanks for the feedback! In the latest released version we made it so that the final Chaos Gem isn't picked up automatically, you need to pick it up yourself. Also while the Glove is powerful, it destroys the Relics, where the real money is. Happy digging!", "michael.power.583Sep 19, 2019 at 3:19 PM\nADDICTIVE\n\nThis game is really fun. I played it originally on a rift and enjoyed it but having the wires took away from the full potential of the game. Now that it's on the Quest the game is perfect. Well done to the developers for this amazing fun and addictive game.\n\nHelpful | 13", "Pdro360Sep 20, 2019 at 4:15 AM\nCannot even open the game\n\nI would love to change my review but as of now I can't even open up my game. I am met by an \"update in progress\" screen constantly no matter how many times I uninstalled and reinstalled. I can load and play every other game in my library but the 1 I've been looking forward too is not letting me play. PLEASE I need a solution! If not I'm afraid I'll have to return the game.\n\n\nUPDATE!!\n\nAfter countless times of reinstalling and multiple downloads the game finally started working! An awesome experience and oddly enough an amazing time killer. Just played it for 2 hours and it has engulfed me and the looter in us all.\n\nHelpful | 9", "Illuminator4587Oct 19 at 10:57 AM\nGreat game!\n\nGreat game, saw youtubers playing it on other VR platforms and decided to try it out on the oculus quest, it had a ton of more options and was overall a really fun game to play, I would recommend!\n\nHelpful | 3", "ParadiseDecaySep 21, 2019 at 10:32 AM\nIt's better than the PC version!\n\nQuest impressions video with Commentary:\nhttps://www.youtube.com/watch?v=KCAvEtBuKqQ\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR Cave Digger')\n\nMy Quick Thoughts:\nI have featured the PC version 3 times now on my YouTube channel with each new DLC and Update.\nToday I got the chance to play the Quest version and to my delight all the DLC is unlocked and available to play right from the get go.\nAlso the Quest version has both smooth and teleport locomotion, on the PC you just get telepotation mode.\nI thought the graphics on the Quest version was almost identical to PC, but what stood out to me more on the Quest was the shear freedom to turn in any direction and mine. There is something really satisfying about smashing rocks with a pickaxe in VR.\nOn PC with the Oculus Rift S you would constantly get tangled in your cables due to the nature and mechanics of the game.\nThis is a fun little game with plenty of content and one of the few VR games I'm more than happy to keep jumping into.\nI REALLY hope the developers continue to add more content to this little gem! - Did you see what I did there? ;)\n\nHelpful | 10", "Assassin24Sep 23, 2019 at 1:57 PM\nIf Developers could reply\n\nI gave this 4 star because that one star is all the bugs one crashed my game that Made me mad since I got the last key I needed but I still got it also the chances of getting the next stone is so easy if you gotten the Easter egg then you stay with all the stones but one you should be able to keep the chaos stones all of them or you should be able to have a setting to turn off repeat Easter but if they are new they will still happen. If that is hard to code in you could do it based on if you have gotten the achievements I would like if you could fix some Bugs that crash the game and unplayable if you made a lot of progress some glitches that I have gone through did not save progress.DEVELOPERS PLEASE REPLY\n\nHelpful | 2\nDeveloper ResponseSep 23, 2019 at 11:52 PM\n\nThanks for commenting! We're releasing the first patch this week, which will fix the issue with the chaos gem ending.", "coleymoley67Nov 17 at 4:15 PM\nGood\n\nLove game game good am real human\n\nHelpful | 3", "EskilJessSep 25, 2019 at 2:05 PM\nFun game\n\nThis is an ok and fun game, but I wish some of the tools were explained a bit bett, specially the oil-thing, i filled several buckets, but never got paid for them? Just didnt get it. And there is literally no info about anything. And a lot of the tools stopped appearing in the table shop after the first iteration. Wanted to love it, but the lack of information kills the joy for me.\n\nHelpful | 0", "ham321Nov 29 at 8:04 AM\nI Love this game!\n\nEpic super fun!!\n\nHelpful | 2", "Sketchy_AnonOct 12 at 4:43 PM\nLittle buddy!\n\nI love this game already, but when I discovered that I could have a pet mimic that helps sell stuff for me, I lost it. I love my little buddy! I just wish I had some tips to take care of her...\n\nHelpful | 2", "ProtoJesterOct 31 at 7:59 PM\nMust buy game\n\nThis game is tons of fun\n\nHelpful | 5", "TheNumber37Oct 10 at 2:21 PM\nGreat game with little issue\n\nI love this game and the mechanics within. Three only issue I have is frequent freezes in game requiring the game to be restarted, if that were fixed I would give 5 starts across the board.\n\nHelpful | 0", "Wario_FartsSep 30 at 5:30 PM\nVery Good Game\n\nThis game is amazing I cant stop playing it. Its so cool to ride in the train and explore caves. (Have to buy lever for train). I like the aspect of mining for goods as quickly as possible, and buying new stuff to mine better.\n\nHelpful | 2", "HyperGamer209Sep 25, 2019 at 4:24 PM\nNice game needs touch ups\n\nI like it alot I would recomend it to my friends is they had a br heafwet but the thing I dislike aboyt it is there is no different load areas. What im saying is that you should have muiltiply loa ld options and not just load in on the same world repeating the same ending.\n\nHelpful | 0", "RagingWarrior14Sep 25, 2019 at 8:12 PM\nTHIS GAME IS AMAZING\n\nThis game is the best I have played yet and for me to be excited for an excelleration game to try and get everything in the game game is awesome. I hope this game makes lots of more updates and add some pretty sweet stuff\n\nHelpful | 3", "obi2kenobiOct 4 at 6:29 PM\nFun little game, but not the deepest\n\nThere are tools for mining, extracting artifacts, drilling for oil, and you can light and throw dynamite. For a mining game they really did cover all the bases. Its honestly way more than I expected from the title. Plus there are various items you can buy with all your loot. But at the end of the day, mining can only be so fun.\n\nBest part of this game is the elevator shaft is small enough that I can typically play with no artificial locomotion. That lets you get immersed in the game and I love that.\n\nThe train takes you to caves where I am forced to venture out via joystick. That part is fun too because you can just explore and take your time. More relaxing than the elevator. My only complaint on the train is it takes way too long to get out and get back.\n\nIn general I would recommend the game. It keeps me entertained in the same way realvr fishing does even though it is simple. Just a relaxing time, and a lot of the relics you find are goofy, plus there is a silly ending involving an \"infinity glove.\" However, I feel it fits in more with the $15 titles than $20, so I give it 3/5.\n\nHelpful | 4", "notarinezOct 1 at 3:58 PM\nGreat game, very fun and addictive\n\nStill begining with the game, but since I played the first time I feel sometimes a need to play and dig a bit :) very addictive and easy to play no matter if you dont have so much time. Congrats to the developer\n\nHelpful | 2", "CrazyDude1016Oct 12 at 10:47 AM\nFix this game, fast\n\nAlright, so...\n\n(Fixed) 1) This games movement system makes me extremely nauseous, I cant play the game for more than 30 minutes without my stomach wanting to combust.\n2) Glitches, a black box appeared on my screen and even if I shut down it wont go away. The textures vanished when this happened and I swear it could give someone a seizure without a warning.\n3) Getting stuck in things, it happens so often and makes me run into things and nearly break something. Literally takes 3 extra seconds to escape a glitch and get back on your way, only to get stuck again and again.\n4) The explanations, no tools or anything have any explanation to what they are until you buy them, at that point you finally can tell if what you got was worth the load of money you just worked hard for.\n5) Sit and play, it just cant happen, it doesnt work and Im generally someone who sits rather than stands when Im flailing my arms about.\n(My Fault) 6) Tool inefficiency, I literally broke things faster with the first pickax, rather than the second one, and I cant even get the first one back now.\n7) No menu or settings to customize the play style, guess we all need to play with a 20 turning system even if youd like to have smooth constant turning? Whats up with that?\n\nThats my input, take it or leave it. But until something changes, I dont expect to play this often or change my opinion or rating anytime soon.\n\nHelpful | 5\nDeveloper ResponseOct 14 at 7:09 AM\n\nHi and thanks for the valuable feedback. I will address your points: 1) you are using the left thumbstick for moving? If so, you are the second person to report sickness with it. We will try to see what we can do for it, in the meantime you can always use the right controller for teleporting 2) a screen capture for this would help immensely 3) will check, but should be improved with the latest patch 4) the Newscaster lines from the radio should help with this 5) could you specify please the trouble you're having with playing while sitting? 6) the Useless Techno Upgrades are all identical to the original ones, it's (supposed to be) satire 7) I guess you're using snap turn while seated? I agree we should have more options. Let's see what we come can up with.", "zz_platinumSep 21, 2019 at 3:27 PM\nGame wont launch !!!\n\nI uninstalled and reinstalled plenty of times still wont launch it says update in progress !!! Disappointment so far.\n\n(UPDATE WITH FIX) uninstall cave digger -\nPower down quest\nPower up quest\nReinstall & should work\n\nHelpful | 4", "michael.bourbon.923Oct 13 at 7:49 PM\nSo Fun!!\n\nNever expected a mining game would be one of my favorites! After receiving a key from the devs I have non stop been playing this game. Definetly recommend for everyone\n\nHelpful | 3", "CaveMasterSep 19, 2019 at 12:20 PM\nThe game is great!\n\nThe game is really good!! There are los of things to do when you are in the mines and a bunch of tools!!\n\nHelpful | 15", "InkyDeathSep 29, 2019 at 2:51 PM\nBug\n\nSo I bought the advanced saw and all the other advanced gear disappeared. I couldnt get the advanced bucket or drill. Please fix this. Other than that its a really fun game.\n\nHelpful | 1", "louis.anghilanteOct 13 at 3:23 PM\nGood not great\n\nThe initial mine is chaos no tutorial at all. When you get something no instructions as to where to put it was total trial and error. New tool have no instructions at all. I guess there are some pictures but not really instructive when you have to figure it out before time runs out. The movement gets stuck sometimes so you lose time that way. Not every hit is registered. I guess it could be summarized as needs a better tutorial! No instructions that are worth jack diddly as far as I am concerned. No way to restart from beginning either without uninstalling and reinstalling the game.\n\nHelpful | 0\nDeveloper ResponseOct 24 at 8:34 AM\n\nHello and thanks for commenting! As this is a much-requested feature, we will add an option for restarting the game in the next patch. UPDATE: In the latest patch we've added tutorials and a restart button in the saloon!", "Abomination_GamingSep 21, 2019 at 6:04 AM\n\nI like the game but its almost like they didnt test for bugs because I myself have ran into a lot of them and some will even crash the game\n\nHelpful | 9", "TidyWhiteeOct 12 at 7:36 PM\n\nKinda regrettable fun but no hope for fixes don't see much updates from these devs. It's about making it your own and u smoked Minecraft. Just fix up a few things and make a name for your company.\n\nHelpful | 1\nDeveloper ResponseOct 14 at 6:59 AM\n\nHi! Thanks for the feedback. We are currently developing the 3rd patch which will address much of the issues reported by you guys. Also we've got another content update coming soon!", "EnriqueHicksOct 12 at 10:20 AM\nMining is fun\n\nLol who doesnt want to go deep down in a cave and look for treasures.\n\nHelpful | 0", "TomTJSep 28, 2019 at 1:50 PM\nBug makes game unplayable\n\nI really enjoyed this game at first. **spoilers warning** About ~20 minutes in, I acquired the 5th gauntlet gem (the one which goes into your palm). I then went through the process of blowing up the world and going to the credits. Afterwards, I am teleported back to the salon with the 5th gem missing from my gauntlet. Any time I return into the mine, I re-acquire the 5th gem, blow up the world again, and am forced to rewatch the credits. I cannot break this cycle, no matter what I try. Not fun; definitely ruins the game.\n\nOther annoying (but not game breaking) I would like to see the developers fix: gems fall through floor too often. Cant switch which hand my gauntlet is in. Items have no description pre-purchase. I cant choose to remove items from my elevator (my elevator floor has been littered with dozens of dynamite sticks). No menu/options/settings. It would be nice to know the value of the objects I mine.\n\nI would give 4 stars if I could just mine without having to blow up the world every 2 minutes. DEVELOPERS PLEASE FIX THIS ISSUE.\n\nHelpful | 4\nDeveloper ResponseSep 29, 2019 at 11:02 AM\n\nHello! The latest patch should make it so that the 5th Chaos Gem must be picked up manually, preventing any accidental destructions of the Earth.", "Skus05Oct 13 at 4:58 AM\nHow do you restart\n\nI have no idea of how to restart the game\n\nHelpful | 1\nDeveloper ResponseOct 24 at 8:34 AM\n\nHello! We will add an option for restarting the game next patch. UPDATE: Now added!", "Adl0618Sep 28, 2019 at 9:41 PM\n\nIts good but some of the rocks disappear and I get stuck inside of the living chest and cant walk out\n\nHelpful | 1", "Coolcole8412Sep 26, 2019 at 2:40 PM\nGreat\n\nI have been playing this game for a while and I really enjoy playing it when I'm bored or when I really want to play it. It's a great game.\n\nHelpful | 2", "foxjazz2Sep 22, 2019 at 4:50 PM\nBuggy but fun.\n\nThere Is no way to save progress. And starting over seems to be a bit sad. But somewhat fun. I hope they fix this.\n\nHelpful | 2\nDeveloper ResponseSep 22, 2019 at 10:31 PM\n\nThanks for commenting! The game autosaves frequently. We're adding an icon to show it to the player.", "SwannyBenSep 29, 2019 at 12:15 AM\nThe VR Equivalent of a Flash Game\n\nDecent core mechanics, but the gameplay is much shallower than the description would have you believe. Also, activating the \"infinity gauntlet\" or whatever every time you hold any object once you've bought the gauntlet is very, very annoying.\n\nHelpful | 0\nDeveloper ResponseSep 29, 2019 at 11:04 AM\n\nHi! Thanks for commenting. You mean the charging punch when grabbing any tool I assume. It's a good point, we'll fix it in the next patch.", "joshua.reinoehl.9Oct 10 at 7:04 PM\nA bit glitchy on quest\n\nThe items in the store stoped showing randomly, and they will not come back. It randomly crashes every so often.\n\nHelpful | 0", "BossbeastOct 1 at 5:33 AM\na little gem of a game\n\nI find it quite relaxing mining away and my son who is a minecraft fan likes being able to mine rocks in VR. A nice game\n\nHelpful | 1", "Gameboss49Sep 30, 2019 at 4:55 PM\nGood\n\nId say its good. Id recommend it.\n\nHelpful | 2", "globefOct 15 at 5:15 AM\nBoring and regretful purchase\n\nUnfortunately it's too late to refund this game. Its awfully boring and maybe not my type of game. Wouldnt recommend\n\nHelpful | 0", "GiJackUsherOct 8 at 10:19 PM\nGreat game\n\nGood game but mining time to short\n\nHelpful | 0\nDeveloper ResponseOct 10 at 1:19 AM\n\nHi and thanks for commenting! If you want to mine without restrictions, buy the train lever from the general store, this allows you to enter the train caves.", "zagan15Sep 23, 2019 at 1:54 AM\nNeed morre\n\nI kinda finished almost all in 4 hours thought thered be more to do\n\nHelpful | 3", "Leo1928Oct 1 at 5:33 AM\nThe Game Looks very very nice\n\nNice Game\n\nHelpful | 3", "DAX_QcSep 23, 2019 at 4:38 PM\nNot worth the price.\n\nIt would be a 4 stars game at 5$. But i paid 25$ canadian for this. No way im keeping this. If one day on sale, maybe.\n\nHelpful | 1", "mlguentherOct 6 at 9:50 PM\nNot very fun\n\nNot much gameplay, and the gameplay they have is not very fun\n\nHelpful | 0"]