{"App Title": "Cirque du Soleil", "App description": "Enter the world of Cirque du Soleil for an up, close and intimate look at some of their most iconic shows. Swing into a Mexican daydream in THROUGH THE MASKS OF LUZIA, or dive into a hypnotic underwater universe in DREAMS OF O.  Challenge your perceptions in INSIDE THE BOX OF KURIOS and watch an epic battle unfold in the mythical world of K - THE BATTLE WITHIN. Cirque du Soleil VR brings these stunning experiences to life like never before.\n\nNEW EXPERIENCE - ALEGRA - A SPARK OF LIGHT is an incredible re-imagining of one of Cirque du Soleils most iconic productions. Alegra - A Spark of Light; a universal tale of change, renewal and enlightenment.", "Purchase section": "$6.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Movie, Music, Narrative", "Languages": "English", "Version": "1.01.13", "Developer": "Felix & Paul Studios", "Publisher": "Felix & Paul Studios", "Website": "https://www.felixandpaul.com/", "Release Date": "June 18, 2020", "Developer Privacy Policy": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\n\nCLICK TO EXPLORE\n\nIMMERSIVE ENTERTAINMENT\n \n \nEN \nFR", "Developer Terms of Service": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\n\nCLICK TO EXPLORE\n\nIMMERSIVE ENTERTAINMENT\n \n \nEN \nFR", "Space Required": "112.8 MB"}



["5 stars\n76%\n4 stars\n10%\n3 stars\n5%\n2 stars\n3%\n1 star\n5%", "derrick33333Jul 4 at 1:29 PM\nGreat for New Cirque Folks\n\nWhat I liked:\n- Great content - it puts you right at the center of the show at Cirque. Each video is ~10-13 minutes long, but only has one main act, and a small side act. It is like a teaser for each Cirque show that pulls you in for more. One hour of decent Cirque content pulls you into the show, making you want to watch the rest of it.\n- Short and sweet - 10-13 minutes each; one main/one side act. No fluff, no audience, and great visuals.\n- Decent price at $8. Quite honestly, it feels like a major \"promo\" for Cirque, so it should be free if they really want to pull people in as a marketing tool.\n\nCons:\n- The show makes you feel bad for the actors, who were all fired due to covid19 and the company filed bankruptcy, putting them all out of a job. The VR shows you how difficult most of their acts are, and how high risk they are at death if anything goes wrong. It paints a very poor picture for the billionaire owner of Cirque who fired everybody to bankrupt the company, while hoarding his billions.\n- While the content is great, it is just a stream of content from Cirque, advertising each show to draw you in to pay to watch the rest of them. I think they should have given this away for free as a marketing ploy, although I do understand that there are costs.\n\nOverall, for $8, it's not a lot, and the content is good. It just makes you bitter at the founder of Cirque who screwed all these hardworking people out of a job, who risk their lives to show a good act.\n\nHelpful | 59", "CameraLenzJun 25 at 4:10 PM\nOut of body experience!\n\nThis is art on a level Ive never experienced before. One of the most immersive experiences Ive ever had in the VR. I watched it all the way through, couldnt believe how long and amazing this experience is. Wish the video quality was a little better, but I understand there are limitations to putting something this unbelievable together. Dont let that stop you from experiencing this magical one-of-a-kind creation. Not to mention how incredibly moving and spiritual it all is. So much meaning and so many perspectives. You can watch this over and over again and see something new every time. I definitely want to see Cirque du Soleil live sometime after experiencing this. Please keep bringing more and more content like this to oculus! Blown away :-)\n\nHelpful | 56", "wgdJun 24 at 12:38 PM\nAmazing\n\nThis is the best value on the Quest. The 5 virtual shows are magical, and offer an even more intimate experience than the live performances. Although you can sit, standing and looking around at the performers allows you to take in more of each show. I recommend this as a must buy for all Quest owners.\n\nIn addition, readers may want to know that after viewing all five downloaded shows multiple times, I can confirm the software works perfectly on my relatively slow network. I say this as many of the low ratings refer to technical issues which have either been resolved or are not related to the product.\n\nHelpful | 17", "timglu27Jul 13 at 11:28 PM\nFirst review ever\n\nI love beat saber, shooting, and bow stuff...\n\nThis is the first title that really wowd me though. Was like seeing a premium vegas show in my room...and all around me.\n\nGive me better resolution- oculus. This is the future of entertainment. I only wish there was a lot more and it was a bit clearer....\n\nI only wish they had the absinthe vegas show on here but wow - this was great.\n\nIll buy any expansions you put out. And time for a new 4K headset oculus!\n\n\n\nHelpful | 5", "JTubbrittJun 21 at 5:47 AM\nGreat Experience but greedy developers\n\nGoing to rate this as a 3 star purely for the fact that the developers are being greedy. I bought this for the Oculus Go originally and now to get it on the Quest im expected to pay twice for almost zero effort from the developers. Same SDK guys, same android build platform. It takes almost zero effort to switch a video based app from the Go to Quest. Thankfully the actual talent performing are worth the money, so anyone reading this review, the acting, performances and entertainment value is first class.\n\nHelpful | 40", "belambaJul 29 at 4:36 AM\nSo enjoying this...\n\nIve never seen anything from this circus but the VR experience is awesome. Its so well done and I cant wait to show family and friends how amazing this is. Feel fully submerged in each video and will watch over and again. An extremely fair price for the content. Makes a change from battles and brain draining games! Just sit back and enjoy. Highly recommend!\n\nHelpful | 1", "johnboy262k1Jun 23 at 2:48 PM\nWONDERFUL!\n\nI was fooled into believing I was actually there and it was glorious! One of the best experiences that will stay with you. You will find yourself revisiting the same experience over and over again. A pure delight to behold and all performances were flawless. I definitely highly recommend everyone to experience this.\n\nHelpful | 4", "Bryce2879Jun 26 at 10:03 PM\nPhenomenal\n\nI've always been a huge fan of Cirque and make sure on my Vegas trips to see at least one. This experience brings the shows to an entirely new level. It's better than in person, you're right in the middle of it. You're able to see every detail, including the emotions they display on their faces.\n\nI HIGHLY recommend this! Not only is it amazing but priced great!\n\nHelpful | 3", "Wolfish80217 days ago\nStunning\n\nThis is a very cool and unique experience. There are five or six 10-15 minute shows. This is such a brilliant way to use VR - I really felt immersed into the odd circus worlds. Would recommend to a friend!\n\nHelpful | 1", "GaryAlfonsoJun 23 at 8:17 AM\nGreat content, flawed application\n\nHaving had the pleasure of experiencing several Cirque Du Soleil shows, I was intrigued when I saw this available for the Oculus Quest. I think the content here is mostly great. It's extremely immersive and the visual quality is outstanding. It really looks amazing. I can see myself watching these videos every now and then.\n\nThere's a surprising amount of content. There are 5 videos, and it seems that each one is at least 10 minutes long. Definitely seems like a fair price and the content provided is well worth it.\n\nThe biggest problem? The app requires an internet connection... I downloaded all 5 videos to my Oculus Quest, and then went over to visit my parents to show them this, and I was unable to show them all of the videos because I hadn't connected to their Wi-Fi. Yet, I had fully downloaded ALL of the videos the night before at my house....\n\nThis is extremely silly of the developers to make an internet connection required to watch a video that is downloaded to your hardware. DRM at its worst. If the devs update this, I think this easily deserves 5 stars. Until that online requirement is dropped, or you can view your downloaded videos consistently without being online... it'll be 3 stars. Fix it devs!\n\nHelpful | 16\nDeveloper ResponseJun 25 at 2:12 PM\n\nHello GaryAlfonso, once a content is downloaded you do not need WiFi anymore to view the content in the application. If you are encountering an issue preventing you from viewing the downloaded content while disconnected from WiFi, could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!", "wikksterJul 14 at 8:40 PM\nVery cool\n\nI love this. Very much worth the 6.99 imo. Having said that, it doesnt have the best resolution, so if your a resolution snob it isnt for you. What it does is give you is an in the act up, up close view of portions of the shows, about 10-15 minutes a piece. For me, I had so much fun watching and have already re-watched most of them. Btw, these play better if they are downloaded as opposed to streamed.\n\nHelpful | 1", "meduzoJul 25 at 4:52 PM\nArtifacts, weird angles & slow-motion\n\nThis is obviously my subjective opinion; While some of the angles and post effects work to \"tell the story\" some other takes you out from it completely.\n\n(Spoilers ahead)\n\n1. O - this was just artifact fest, as everything is really dark and video compression doesn't like dark colors you can see all the pixels dancing around more than the actual acrobats.\n\n2. Alegra - The scene with the hula acrobat has some weird bloom effect that takes you completely out of the experience... The slowing down to getting still effect works for the story's sake, but that bloom is just ugh... Awful. Later on, having the rope acrobats filmed and displayed upside down is mind boggling (not in a good way) it just messes with your head and you're trying to understand what you're watching.\n\n3. Luzia - While the filming angles work here (and the fast motion to slow motion kinda does too) the contortionist act while great, was not filmed at the better angle, I know that was on purpose but it didn't work for me. At the credits scene, there's this guy juggling awesomely, but you guys sped up his footage, which doesn't make any sense because his ability cannot be appreciated that way.\n\n-------\n\nI understand why this has a cost, and I am satisfied with how much I paid for what I got. I just couldn't help but think \"this will be the VHS aesthetic of the future, with weird angles, compression artifacts\"\n\nSorry to be this harsh but I want future Felix and Paul experiences to be as great as they can be.\n\nHelpful | 4", "LzzrdJun 23 at 2:22 PM\nAwesome!\n\nI visited Ka and Luzia in real life, and this experience brought me back and into the action!\n\nInstead of being a distant spectator, youre in the middle. You cannot walk, but the whole scene evolves around you and you can turn around.\n\nThe only reason I dont hand out 5 starts is that the quality is somewhat lacking. In Luzia (my favourite show) only the first scene is sharp but the other two are blurry and not smooth. Additionally, they have weird viewpoints: from above. And the selected scenes are not my best memories to the show. I hoped for a bit more..\n\nHelpful | 12", "tzvika77020 days ago\nAmazing. Full power\n\nThis is worth the $500+ that I paid to buy my Quest.\nYou sitting in VIP section and enjoying one of the best performance of Las Vegas.\n\nHelpful | 1", "FurlongWolf6 days ago\nBrilliant\n\nI just want more, would also love to see Moulin Rouge\n\nHelpful | 0", "miguel.dipp.14Jun 23 at 9:15 PM\nBAD HD\n\nToo bad this good idea is not accompanied by good video quality! I also don't understand how people say it looks good ?? video quality is very poor. It gives me a lot of anger! 7 dollars and not in HD. FOR MOMENTS PIXELA. DO THINGS WITH QUALITY FOR OCULUS QUEST !!!!!\n\nHelpful | 11\nDeveloper ResponseJul 13 at 11:05 AM\n\nHello miguel.dipp.14, Did you stream the experiences? Stream is lower quality in comparison to the download which is higher quality. Please download and see if this makes a difference. Thank you", "kimbiecookieJun 23 at 11:04 PM\nWonderful experience\n\nGreat up close and personal sampling of a few Cirque shows. Uniquely made for 360 VR viewing where you are in the center and feel like you are part of the show! This only reason I didnt give it 5 stars is because the video quality wasn't great in some scenes but the over all experience is amazing. I was absolutely mesmerized and sometimes a little creeped out but in a fun way. If you have never seen a Cirque Du Soliel performance this is a must see! Great price point for a great VR film experience!\n\nHelpful | 1", "DJandyrJun 26 at 2:27 PM\nAbsolute must buy!\n\nJust watched the KA video! Absolutely amazing and the best experience I have had in VR since owning the Oculus Quest. Need to download the videos instead of streaming to get the best quality\n\nHelpful | 2", "teziJun 23 at 7:27 AM\nGood when it works\n\nThought this was beautiful and worth the money until I got lots of unable to connect errors about 15 minutes after I purchased it, so when it works it's great when it doesn't it's frustrating.\n\nHelpful | 2", "virtualmandalaJul 9 at 9:41 PM\nMind Blowing Experience\n\nSo much thought was put into this. Takes advantage of VR technology and methodologies to deliver pure art. The first video brought tears to my eyes. Simply outstanding!\n\nHelpful | 1", "xxTOROxxJul 16 at 9:37 AM\nEncore Encore!!!\n\nHad a great time watching. My entire family had a go at it and we enjoyed it. We just wanted more more more...!!! Encore Encore\n\nHelpful | 1", "marniebrimhallJul 15 at 10:59 PM\nBeautiful!!!\n\nThis is truly an epic experience! I never wanted it to end. I'm proud of the entire team and Troup involved\n\nHelpful | 1", "volkan.babayigitJul 21 at 3:44 AM\nGreat overall experience\n\nGreat Perspective for viewers. NeXT step will be from players eye view.\n\nHelpful | 1", "SilentFox192Jul 13 at 3:42 PM\nStunning\n\nAn absolutely wonderful experience for the price. You get 5 different shows that are over 10 minutes long.\n\nHelpful | 1", "mjaramjaJun 21 at 8:23 PM\nGorgeous!!\n\nThis is an amazing, beautiful. surreal experience. Saw the O show in person once, this was by far a closer view and more dramatic.\n\nHelpful | 2", "briana.bennJul 4 at 8:45 PM\nUnbelievable\n\nYoure right there on stage as the performers perform for an audience of one- you! A breathtaking experience!\n\nHelpful | 1", "Kathmandu300Jul 22 at 10:38 PM\nExcellent\n\nIt is great\n\nHelpful | 1", "TiriathJul 20 at 2:38 AM\nReally nice show\n\nAbsolutely fantastic\n\nHelpful | 1", "Aldrich007Jun 27 at 3:43 AM\nDoesnt work!\n\nFor each experience the same error message is shown. No data on the server! Theres nothing to see because there is nothing on the servers\n\nHelpful | 6\nDeveloper ResponseJun 30 at 10:19 AM\n\nHello Aldrich007, Could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!", "PoisonDoorJun 21 at 5:28 PM\nIt doesn't work!!!\n\nI can't download the content. It always says, no Wifi conection.\n\nHelpful | 2\nDeveloper ResponseJun 25 at 2:00 PM\n\nHello, we'd like to help solve this issue. Could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!", "M_0509992914mJul 25 at 10:00 AM\nIt doesnt work\n\nWhy I cant see the show?? Or i think its not downloaded!! Thanks\n\nHelpful | 0\nDeveloper ResponseJul 27 at 11:40 AM\n\nHello M_0509992914m, Could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!"]