{"App Title": "Cloudlands 2", "App description": "Cloudlands 2 builds off of the fun of playing and building minigolf courses and adds the ability to play full sized golf courses.  Arm yourself with a putter, wedge, and driver and hit the links in the clouds.\n\n- 54-hole single player campaign takes you through the Green Glades, Magic Meadows, and Reaper Ruins.  Play 18 hole mixes of full sized golf and minigolf.\n\n- Level Editor with over 1000 pieces to build and make epic mini golf or full golf holes.  Create and upload your creations to allow other people to play.\n\n- Expect to find a nearly unlimited supply of amazing user created levels.  All existing Cloudlands 1 holes are available to play (2000+).\n\n- Online Multiplayer allows up to 4 players to play together.  Create a room, have your friends join, and off you go.\n\n- Local Multiplayer pass and play allows you and your friends to play together by passing one headset between you.\n\n- In-game voice chat and Oculus Avatars fully supported.", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer, Co-op", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Simulation, Social, Sports", "Languages": "English", "Version": "1.30", "Developer": "Futuretown", "Publisher": "Futuretown", "Website": "http://futuretown.io/", "Release Date": "August 27, 2019", "Developer Privacy Policy": "None", "Space Required": "652.2 MB"}



["5 stars\n37%\n4 stars\n24%\n3 stars\n11%\n2 stars\n15%\n1 star\n13%", "QDaBeatJul 6 at 2:07 PM\nSee bottom please\n\nIm not sure as far as what most other people, are saying,Although I feel bad that you guys are running into those problems Ive yet to encounter any of them despite what everyone was saying I went out and I downloaded this game and I am home having a blast. No problem with warping, or ball address, leave my club up to Avoid unwanted contact until ready to shoot, all play has been smooth and trouble free. I was really scared because a lot of poor negative ratings out there but not any of them match the experience that I am having. Theres zero discomfort as well, where I ran into in other apps.\n\nI am having slight difficulty getting an online match, Hope the developers can address that. Or anyone for that matter.\nThe graphics are as expected, the game play is as anticipated. With the create a hole alone, gives you endless replay value. And those being open to others. Means endless holes and courses.. like i said, that alone, puts this game in the daily play pile.\n\nThe only reason I wont go five star, is simply the lack of a full set of clubs, and the absence of some beautiful lynx , its very adolescent graphics, fun still but a five start golf game needs to awe, you with the nature.\n\n\nPLEASE PLEASE PLESSE vvvvvvvvvvvvv\nPs you should start weekly tournaments or monthly, with prizes such as oculus dollars etc,,\nWe could pay 2$ to enter. You guys ceate 4 rounds, with elimination in each.. very simple- And will definitely impact play of the game for current players and new users hopefully\n\nHelpful | 9", "kippieq3 days ago\nFun With Friends\n\nThis game is great as long as youre playing it with someone locally or online. I really wouldnt suggest playing this with just yourself unless you love trying to get the best score possible on the holes.\n\nHelpful | 0", "Mattplus097 days ago\nDone Buying Quest Software\n\nI won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\nReview:\nI'm a big fan of Everybody's Golf on PSVR since I've not been able to play golf for over 10 years now and it gives me many of the same feelings in a more arcade-y setting, but with an air of realism...this is different but no less awesome. In EG I'm concerned with birdies, but in Cloudlands 2, I just wanna get there :) That's not a bad thing. I love the \"golf and mini golf had a baby\" context...for me it really works and I know I'll be back over and over again to try something new.\n\nWhat I would love to see is a driving range and putting green so I can better figure out how to swing!!!!! I have no clue about the swing modifiers..stronger, weaker...how far anything goes...can go...seeing how far you can go against how far you went would help alot :) Thanks!\n\nHelpful | 0", "RattleKatJun 30 at 8:21 AM\nFar better than expected!\n\nI have put off buying this game because the reviews made it sound borderline unplayable. I am happy to say this is not the case at all. It seems at some point, many people were unable to position themselves correctly over the ball but this issue has since been addressed and it's now relatively easy. Simply press the trigger to bring yourself close to the ball, then rotate using the stick or turn your body. Yes, on occasion you have to shuffle around or teleport a little to get right where you want to be, and it can be fiddly, but it's far from game breaking when you'reused to it. Just ensure your guardian is well set up and occasionally use pass through as you will drift from your starting position.\n\nOnce you're used to setting up, the golf itself is quite simple but more than serviceable. PGA this isn't but with the right course, it's an excellent virtual pitch and putt. It's is a little jarring to have to set the ball spin before playing a shot rather than relying on actual club physics but again, not a deal breaker; making sure the weight and direction of your shot are accurate provides enough of a challenge to be immersive and engaging.\n\nThe mini golf is also well done but doesn't appeal to me as I like chipping and driving. Fortunately, with thousands of user made courses available, it's easy to download and save your favourites so I have plenty of par 2-5 holes to keep me busy. Plus, making your own courses is very simple and fun so you can never run out of new holes to play.\n\nIf, like me, you've been putting off buying this, give it a chance. I've been very pleased. All I do is pick 18 fairly grounded holes, turn the music off and enjoy my private pitch and putt course.\n\nIf you can handle a more simplistic approach to golf, you will likely enjoy this a lot.\n\nHelpful | 2", "loregnum11 days ago\nCompletely underrated\n\nSeeing the overall score and small number of reviews just blows my mind. This is a good game that I've owned since it was released and anyone that likes golf/mini golf is missing out on not buying this game. There's probably not another game on the Quest that is this \"criminally\" underrated and underappreciated.\n\nI just bought Pro Putt and while it is more polished and looks better, Cloudlands 2 has more content (having user created holes is so valuable for replay and longevity) and they feel close in the actual golf/swing aspect. I feel both games are definitely worth owning yet if having to pick just one golf game right now, Cloudlands 2 would be my pick because of all the extra content. If Pro Putt gets more content and/or a custom hole creator, I'd say that is the better choice.\n\nIm giving this game a 5/5 score to try and help the average go up. It's more somewhere in the mid 4 range for me.\n\nHelpful | 0", "wendlandJul 2 at 1:14 PM\nGood\n\nI think the game is pretty accurate for being on VR. The only thing I would change is being able to use two hands. Its kinda weird not being able to grab it with both hands. But overall a fun game.\n\nHelpful | 2", "Ender_BlackthorneApr 23 at 6:11 AM\nThis Is No Good!\n\nI like Golf and I think it is the kinda thing that should translate well to VR. I read the reviews on this game and decided that I didn't want to mess with it because it sounded like it was full of gamebreaking bugs. I kept my eyes on it, because I really wanted some VR Golf and one day the Developer posted responses to a lot of reviewers which gave me the idea that the bugs were all fixed, so I bought it.\n\nI am really sorry I did. This game is broken to a point that it is just not worth playing. The teleport to ball function puts you right on top of the ball and you can't hit the ball from the position you are put into and moving to a position that is the right distance from the ball is a time consuming hassle that will likely have you teleporting all over the place ......and will often cause contact with the ball that you didn't intend.....which means you lose a stroke AND have to fight with the teleportation again.\n\nI spent 10 minutes trying to get myself in a position where I could address the ball....... and then I realized that I'd rather be doing just about anything else. I doubt I will ever play this again.\n\nThis game is not fun at all, and the teleportation makes Cloudlands 2 an absolutely horrible experience. Most games make me feel good, this one just makes me feel stressed out, angry and frustrated. Really a remarkably bad game.\n\nHelpful | 107", "markeo4Jun 15 at 10:54 AM\nMultiplayer - Endless Fun!\n\nI have had some of the experiences others have on here with some bugs, but some of them are a bit overstated. I have played this game for months, oftem times once a night, and typically positioning issues are easily fixed by resetting your guardian outside of the app -- especially if you have not set your floor level in the guardian correctly. If you do this correctly, it is fine. I can't really confirm this, but I think lighting can play into it a bit as well, but ultimately that's all part of the oculus tracking as a concern, not the game.\n\nThe level builder is AWESOME. You have endless possibilities to build holes. If you have family that you want a fun game to play and to compete on your own holes or the hundreds of others that are built out there, it's a blast. My brother and I have created some insance holes that are fun to go back to over and over again.\n\nThere is a bug in the multiplayer loading screen that causes some crashes, but the developers know what it is and are working on the fix. Once that is resolved, I don't really care about the other minor playability items other people have talked about. I'm still rating it a 5 star because of the depth of play you get on being able to CREATE -- you don't have to get tired of the same holes over and over again, you make anything you want, any way you want them which is awesome.\n\nGood job dev team and thank you for always being responsive and listening to customers and actually working on the product. This is not a game that is being left to die by its devs, they are active and work the bugs which I appreciate.\n\nHelpful | 1", "LeeAndoMay 6 at 1:57 PM\nMeh\n\nIt's ok, but nothing compared to the PC VR minigolf game of the same name. I think a port of that would destroy this ratings wise, that was a cracking game for local multiplayer!\n\nHelpful | 3", "ButtBullyFeb 17 at 4:28 PM\nSo much potential\n\nThis game is fun, but has some serious mechanical issues.\n\n1) Teleporting is broken beyond belief! It teleports you right on top of your ball, so you have to walk around to get your stance right. It always results in accidental hits on your ball. A simple 1 foot buffer on teleport would fix this. If you play in a small space, teleporting and having to reset each shot will make this game unplayable.\n\n2) Theres nothing to tell you how far your ball is going to go! Theres no statistics on your clubs that say max yards 200 or anything. You just swing your club and see what happens. The iron is all over the place! Two swings on the same force will send the ball 100 feet over the hole first time, and 2 feet in front of you the other. It would be nice to have a statistic that says the max yards per club at full power, that way we could gauge our swings.\n\nThis game has so much potential if the actual mechanics of the game were fixed. Its a blast, but ultimately, I switch to something else before hope 9 because it feels like its still in beta with all the issues.\n\nHelpful | 48", "EC4May 22 at 9:03 AM\nGetting a refund\n\nControls are to weird and hard to be fun. Should be a great game and cant wait for the top golf version. To launch because this game is a waste of time and $$\n\nHelpful | 4", "CrangisMcBasketballApr 10 at 10:33 AM\nGreat game but...\n\nGreat game visuals are great and level builder is awesome but there are only 3 courses and multiplayer makes you wait for hours to find someone to play with.\n\nHelpful | 4", "thatwalshguy15 days ago\nA must-have Quest title\n\nIve been searching for a good game to play online with friends for a while, and am so glad we found this. Not just mini golf, cloudlands 2 offers a more traditional take on the sport. The courses are great- we never really felt like we ran out of things to do. The soundtrack was super chill, and paired with the visuals worked really nicely. Finally, the level editor was nuts. I made my own level in 5 mins (a pretty decent one, too). We downloaded a ton of levels offline to play in online multiplayer.\n\nIf youve got a Quest, I really cant recommend a better game. Who doesnt love mini golf? I came for that alone, but was surprised at how much I liked the real golf, and the level editor.\n\nDEVELOPERS! REQUEST!\n\nMy only request is multiplayer level creation! It would be awesome to chill and build with friends.\n\nHelpful | 0", "Jimmy_GreenMay 14 at 8:09 PM\nOk\n\nIts an ok game. Its not what I was expecting\n\nHelpful | 1", "jamesjteJun 10 at 6:00 PM\nCloud land 2\n\nThis game sucks I wouldnt recommend it to anyone dont waste your money\n\nHelpful | 1", "TheWinner11111May 8 at 8:41 AM\nWii golf mixed with super Mario maker\n\nOnce you get used too it, its great!\n\nHelpful | 3", "DancesWithNoobsJun 6 at 11:52 AM\nNah\n\nJust... nah. Good idea... but... nah.\n\nHelpful | 2", "KillOhmFeb 27 at 5:26 PM\nA bit sad really.\n\nFirstly, if youre looking for a putt putt or party game then Id say this is a probably good one.\n\nIf youre looking for something anywhere close to golf you need to look elsewhere. The swing mechanic is more like short chipping even for the driver. Even a long chip swing will result in the club head disappearing. I suspect this game evolved from a putt putt concept. There are three clubs (driver, iron, and putter) and even things like putting from the fringe of a green doesnt work.\n\nAs others have said, the movement mechanic is pretty broken. It just needs to use your handedness and the path to the hole to place you on the correct side of the ball facing the correct direction. It seems to often place you quite randomly.\n\nThe clubs weirdly shrink when addressing the ball - you cant use your club length to gauge your correct standing position. The club head disappears if you make a full swing with you not hitting the ball.\n\nIt doesnt use club face and swing path to determine ball path. Theres a strange hook and slice mechanic selected with the thumb stick instead.\n\nI can only hope that someone creates something like the VR version of the PSVR title Everybodys Golf, for the Quest. It ticks so many boxes.\n\nHelpful | 6", "berti18May 11 at 5:46 AM\nCloulands 2\n\nNothing to do with a real golf neither a ...minigolf ! Very bad.\n\nHelpful | 2", "WickedgardengtpFeb 27 at 5:59 PM\nGreat start!\n\nThe graphics could have a little bit more texture, even for the Quest. The physics seem a bit off, swing strength and aim seems cumbersome at times. Other than that, Im enjoying the game!\n\nHelpful | 2", "negativghostrdrFeb 6 at 12:11 PM\nWasn't for me.\n\nIt feels kind of unfinished. It seems to me like once I've established how tall I am and where I'm swinging from that the ball should always be-about there. I shouldn't be able to move to mid-air just because I pulled the trigger when the ball was there. The club shouldn't shrink because I'm leaning closer to the ball. As a golfer, I kind of rely on the length of the club to tell me where I have to stand so that the club head is aligned properly when I swing. I messed around with this for about a half hour and found myself whiffing a lot. Also, golfing is a two handed sport. This is set up for one hand-or really one controller that is a completely wrong shape for golf. I've tried Wii golf and really liked it. This felt very unnatural. Golf is ALL about feel. Pass.\n\nHelpful | 5", "stormshadow612Feb 13 at 9:54 PM\nGreat fantasy golf game.\n\nIts totally worth the price for the custom holes alone making it over 2000 holes And local multiplayer. Wish the shot line would disappear on your next shot theres literally no reason it should stick around on your next shot its little distracting to look at.\n\nHelpful | 3", "BrawlasaurApr 16 at 2:01 PM\nBad game\n\nI always miss the the ball and it is very annoying i want a refund\n\nHelpful | 1", "wozzer.jacksonDec 5 at 12:07 PM\nMajor bug in Quest\n\nI actually enjoyed playing Cloudlands 2 but can only give it a 2 as there is a fairly major bug that Quest owners should know about.\nMagic Meadow 14 cannot be finished! The hole appears to be embedded behind the rock face opposite the fans. You can even put your head 'through' the wall and see the hole on the other side. Sadly, the ball doesn't pass through, thus making this hole unfinishable. If playing the campaign it means you can progress no further.\nI've contacted the devs but have never received a reply so have now stopped playing until an update becomes available.\n\nHelpful | 69\nDeveloper ResponseJan 10 at 12:51 AM\n\nHi, our sincerest apologies on this bug. It shouldn't of gotten out of our hands but it did. This has been fixed. Thank you for your patience.", "steve13870Jan 20 at 4:38 AM\nGood ..but\n\nGreat game but am i missing something, i only have about 6ft by 5ft play space and unless i am doing something wrong i can't seem to be able to centre my shot in the middle of my play space,please help if there is a solution i will change to 5 stars because its a vibrant, and great game with plenty of content\n\nHelpful | 1", "endlesskiller432Dec 22 at 12:53 AM\nGood game but..\n\nSo jumping right into it I actually enjoy the game very much as far as golf games go on quest this is your best bet a lot of people rant on and on about the controls but honestly they arent as bad as youd think you pull the right trigger and your placed on top of your ball and you simply step back or teleport back and use the stick to rotate (sounds complicated its not) I had a lot of fun playing the courses and the mini golf courses would give five starts but unfortunately I ran into a hole that was unbeatable which has now been fixed I will be playing the rest of the game and if all goes well a six star review will be coming but in all honesty I believe it is overall its fun game and hitting in your first eagle or sinking that putt is very satisfying and fun so is driving the ball down range to land on the fairway and with the pass and play style of local multiplayer its definitely a game you can share I played with my dad and we had a blast only real complaint is sometimes the tracking freaks out if you swing too fast but thats on the oculus itself not the game so when all is said and done its a good game and its fun and if your\nlooking for a golf game this is it\n\nTLDR: game is fun controls arent that bad good purchase\n\nEdit: played the rest of the game and highly recommend its awesome\n\nHelpful | 21", "SemiPermeableDec 28 at 4:59 AM\nModerate improvement over the original\n\nId consider myself a fan of the Cloudlands series.\nI first played Cloudlands: VR Minigolf as an early build, on a pre-release Vive, in a cubicle with the developers, and it sold me entirely on the concept of VR. I spent a lot of time with this first iteration post-release, vibing out with my closest friends and showing newcomers the magic of VR. And now, they have made a sequel.\n\nCloudlands 2 expands on the formula of the original by adding larger courses and multiple clubs. Unfortunately, rather than make the game feel larger and more expansive this addition makes me more aware of the limitations of the game. Cloudlands 2 is not Golden Tee, as much as Id like to pretend otherwise. Where it shines is in its ease of use and magical, physics/budget defying minigolf courses. These are present at times, and the level editor will, of course, add more in time. But the focus on expansive levels where you cant judge the distance comfortably to the hole, and wouldnt have the clubs to really show off skills if you could, is just... a little disappointing.\n\nThat said, this is the best virtual home golf simulation experience out there right now. You owe that much to yourself for sure\n\nHelpful | 2", "jon.watkins.Jan 30 at 3:23 PM\nGeeat Goff and mini golf game\n\nI injoy playing this game for quick game of golf or mini golf and if thats what your looking for this game wood be the one to get. There are some issues with swing if i swing as hard as if i was at the golf course it well not Register but if you swing lightly it well that is the only bad thing i can say about this game overall you should buy it\n\nHelpful | 1", "stefanosvlahosMar 23 at 6:42 PM\n\nThis game is terrible it wont even let me return it when I played it for 5 minutes\n\nHelpful | 1", "planesRcoolJan 20 at 1:53 PM\nCloud lands 2 game revue\n\nAbsolutely amazing game, price is good and great value for money, just played the make you own map feature and it was really fun love playing it with the family and all round a great game to have!\n\nHelpful | 2", "Mjr-MunkfishAug 28, 2019 at 5:35 AM\nGreat game needs tweaking for 5 stars.\n\nGreat game. Only one gripe! Please set the player position ready for each shot. Literally every shot you are lined up on the ball. Meaning every shot you have to turn to your side (Like you were playing golf lol) then step back or teleport to line up. This takes up too much time and I can't see why the game can't position me better. I mean it knows I am right handed so why not set me up for a right handed swing. It may sound silly but doing this for every shot is the only thing that irritates me lol. It's such an easy thing to sort and it's a big time and energy waster. Hopefully you can update to make the control setup as great as the game. Literally every golf game I have played has been able to set up the next shot for you so can't see why this game is any different. The addition of a driving range to practise your swing would also be a great addition. If fixed I would happily turn my review to 5 stars but it's too much of a pain atm.\n\nHelpful | 145\nDeveloper ResponseJan 10 at 1:37 AM\n\nThank you for your honest feedback. The reason that we cannot predict the direction for the next shot is because of the user created holes. In a traditional game, the developers know the layout of the course and know the direction from the teebox, along the fairway, and to the hole. With user created holes, there is absolutely no way to predict the direction your next shot should take. If you use the snap rotation to rotate yourself left/right instantly, it makes lining up the next shot really easy (don't need to move your feet)", "bazzz3Aug 28, 2019 at 6:13 AM\nGreat Game, but needs control tweaks.\n\nI've played a few holes so far and like it in general. Bit like many others have said.... The positions you are left in when teleporting to the ball needs alot of work. It takes a few too many adjustments to get in the right position when driving, teeing off, putting, etc.\nThat would be my main complaint and hopefully will be sorted by the revs.\n\nHelpful | 61", "SimDragonDec 29 at 4:29 PM\nWay too buggy\n\nThis game is enjoyable but too many bugs to be exciting. The ball disappears in the ruff often and you have to resort to swinging the club until it pops out and is visible. Multiplayer online was annoying as we got disconnected at least a dozen times a piece. I hope they fix the issues as I think I would really enjoy this game.\n\nHelpful | 0", "HeddyMicrocheeseDec 27 at 7:50 AM\nHorrible game mechanics and movement!\n\nThis game has the worst player movement (locomotion) that I've ever encountered! Need to play sitting down or in a tight play space where you don't have much room to move? Fuhgettabout it! Moving to a suitable golf stance is utterly time consuming and ridiculous.\n\nThe golf club swing mechanics and ball travel (flying, bouncing, and rolling) also seem unrealistic, resulting in frustratingly short shots. Combined with the terrible graphics, I don't see much appeal to this game.\n\nRecommendation: skip this game.\n\nHelpful | 3\nDeveloper ResponseJan 10 at 12:50 AM\n\nHi. Thank you for the feedback. That's unfortunate you had trouble with the locomotion. There are several different types of locomotion options in the settings menu. By default, the ball is teleported to the defined center of your guardian area but you can also have it so that you are teleported to the center of your play area.", "srichards391Jan 9 at 12:49 PM\nIf you like golf, get this game!\n\nJust got my Oculus and my wife and I love the co-op multiplayer. Only tweak Id ask for is a way to setup a round of only full courses without mini golf. Other then that great game!!\n\nHelpful | 1", "TheMightyJYOct 25 at 10:55 AM\nOne of my favorite Quest games\n\nThis is just a super fun game. I played it solo for a while and had a blast, and then when a few of my friends got their Quests and we started playing together things got even better. It's just a great game to hang out in, especially in multiplayer. Plus the devs have fixed a small annoyance where teleporting to the ball would position you in an odd way. I fully recommend this game, especially if you've got some buddies to group up with.\n\nHelpful | 7", "HuntersImpala_93Jan 21 at 4:32 PM\nA true gem\n\nThis game was something Ive been missing in my life. BUY IT!\n\nHelpful | 0", "BimBackaDec 15 at 5:51 PM\nAmazing game to play\n\nThanks for listening and fixing that bug on the level, this game is one my favorite games on the oculus quest, very easy controls, awesome scenery. Recommend this to anyone who likes golf or mini golf you will have a blast\n\nHelpful | 2", "GuyHeroNov 24 at 5:26 PM\nNeeds actual mini golf maps\n\nWhen it said mini golf i expected putt putt mini golf. The only way to actually do that is to load a custom one which is just the 1 map and thats it. Im actually dissapointed it doesnt have already made maps. I was only gonna play this with my friend for the mini golf part. Not actual golf courses\n\nHelpful | 4\nDeveloper ResponseJan 10 at 12:53 AM\n\nHi, the game comes with about 18 mini golf holes but yes, they're spread across the different difficulties so if you want to play them as one long course, you will need to create your own custom playlist. All of the mini golf holes from Cloudlands 1 are included, as well as the 1000+ user created courses so there are definitely a lot of minigolf holes you can play.", "gregloryusSep 23, 2019 at 11:29 PM\nNot worth the money until its fixed\n\nIts a small flaw but a fatal one. I dont know if its lazy game design, thoughtlessness, or a bug. 99% of the game seems great, but the whole experience is ruined because it cant automatically place you where you need to stand and face to hit the ball. I have a very small apartment, so this literally makes it unplayable. Everyone in the reviews is saying the exact same thing. The developer needs to respond and let us know if theyre going to fix this or not. Until then, its not at all worth your money. Strongly recommend against buying.\n\nHelpful | 19", "BalianTheMightyMar 13 at 4:27 PM\nNot minigolf like the first one\n\nI guess that's what I get for not watching the trailer. Didn't really think I'd need to. I liked the first one, so I figured the second would be more of the same. It doesn't help that, to me, \"adds the ability to play full sized courses\" isn't the same as \"this only has full sized courses\". I was thinking they meant that they brought us more minigolf, in addition to full sized. The bad part is, I bought this before my quest died, and now it's been far too long to get a refund. What a waste of money. It wouldn't be so bad if the swing mechanics weren't garbage. It feels like they just reskinned a putter and then made some bigger courses, but couldn't be bothered to update the gameplay mechanics.\n\nHelpful | 0", "AmlbuzzerOct 29 at 1:05 AM\nShows be potential\n\nI am enjoying the pitch and putt style of half the holes but don't enjoy the crazy golf style of the rest , however this title does show the potential of a golf game in the future on the quest , although there are leaderboards for each hole I wish there were just pitch and putt only courses with stats and leaderboards.\n\nHelpful | 1", "heemdreamOct 28 at 3:52 PM\nFun Fun\n\nFun game. As other reviewers have stated a driving range and putting green would be great additions\n\nAs for the mini golf levels, not a fan of the course in the sky set up. That step into nothingness feeling can affect some users. But other than that fun fun game\n\nHelpful | 1", "ProsportDec 5 at 8:57 AM\nGood but could be better\n\nThere are still a lot of bugs in the game. There needs to be a driving range and some more normal courses.\n\nHelpful | 1", "tbisht01Jan 30 at 10:45 PM\n\nRcege\n\nHelpful | 0", "maessofNov 3 at 3:01 AM\nLevel editor bug.\n\nGreat game, Will be more than enough replayability.\nControls for movement need to be updated,\nWhat seems to work best for now is teleporting to ball using trigger, stepping off and using the analogue to change direction.\nI don't like the way the club changes in size, would like an option to turn that off.\n\nEdit: Spent hours creating a course, but there's a bug on level and it won't load again.\nThis has happened twice.\n\nEdit: Many months in, has not been fixed.\n\nHelpful | 4\nDeveloper ResponseJan 10 at 1:26 AM\n\nHi, our sincerest apologies. This issue has been fixed.", "gb.mettDec 23 at 9:50 AM\nDizzy\n\nIt makes you dizzy doing small circles to address the ball ..no need for the rest of its faults ive found so far . the first one is enough to put me off it\n\nHelpful | 0\nDeveloper ResponseJan 10 at 12:51 AM\n\nHi, I'd recommend if you're getting dizzy to use the analog stick to snap rotate yourself. I find this heavily reduces motion sickness induced by turning around to aim your next shot.", "one3rdnerdAug 27, 2019 at 10:24 PM\nGreat game, needs a few kinks ironing...\n\nThis game is a lot of fun and I can see it becoming one of the must-have titles on the Quest that fills a few voids in that it offers online multiplayer and local multiplayer and so offers a social VR experience too.\n\nMy issues I would like to see ironed out and with these changes it could be a 5 star review instead of 4.\n\n- Shadows - Better to not have them at all than immersion breaking random giant pixels. If it's too hard to optimize them to look semi-decent I'd like to see them ditched or at least a setting to turn off the 8bit-esque shadows. Ball shadow would be nice though instead but appreciate that might be more taxing on the hardware.\n\n- Option to go through quick play courses and choose \"mini golf only\" or \"full greens\". Sometimes I just want to have fun on the mini golf only and building a course is arduous when I want to jump in and play for 15 minutes.\n\n- Easier way to see the default Cloudlands 1 mini golf courses for creating a course.\n\n- Do wish it kept my distance from the ball when I used the trigger option to teleport to the ball so I was on the same side and the same distance from the ball so I'm not moving back each time I telport in the real world to adjust.\n\n- Manual teleport could use some improvement.\n\n- Some button choices are odd, I wish all games used the same button to start teleport, like the same way Rec Room do it with a button click. Flicking up on the joystick feels a bit clumsy.\n\nRegardless of these things I have had a lot of fun so far and can only imagine it will get better with more user feedback and testing now it's out in the wild. Good work devs!\n\nHelpful | 7", "NO5KNov 11 at 11:04 PM\nMay be fun some day.\n\nAs for now, movement is just to frustrating to play. It teleports you on top of the ball so you have to try and teleport away from the ball to get in position every time you hit the ball. And the teleport is very clunky. The rotation is based on where the ball is at and not where you are standing.\n\nHelpful | 1\nDeveloper ResponseJan 10 at 1:25 AM\n\nThanks for your feedback. Honestly, rotating around the ball is the better way. We've tested rotating from where you are, but it ends up putting your ball easily outside of your play area. Putting the ball at the center of your space will ensure that you can always hit it. As long as you don't stand in the center of your play area, you will not teleport on top of the ball.", "evertecAug 27, 2019 at 11:16 AM\nEndless replayability and fun\n\nThis game is absolutely fantastic and theres really something for everyone in it. Whether youre a regular golfer\" or have never played and just want to have fun with a crazy \"gnome map with blades of death trying to pulverize your ball,\" whether youre creative and want to craft new challenging maps or just want to discover the thousands of maps by others, whether you want to play a relaxing game by yourself or join a party, etc. there is so much content here and so much to do.\n\nThe games campaign does a great job on giving you an overview of many of the types of maps that are in the game, but even after finishing, youre barely getting your feet wet. The multiplayer support makes challenging friends or strangers a breeze and the custom content has a good Mario Maker type rating system to make finding the quality custom content easier.\n\nI played the original Cloudlands a while back. While it had all the core pieces in place, it very much felt like an indie title. Cloudlands 2 embraces its simple, but colorful polygon design (very Rec Roomish in style) and adds a level of polish over it all. This is the defining Cloudlands experience.\n\nHelpful | 19", "richoskiSep 12, 2019 at 9:12 AM\nGood game but need refinement...\n\nThis is a fun game, VR does golf like nothing else. Few suggestions...\n\nSo many VR games have haptic feedback for menus but not in the gameplay. VR Golf needs feedback like no other when the ball is struck to keep the immersion.\n\nSide spin is great but top and back spin would add control\n\nOption to replay good shots would be great.\n\nOption to look left and right fluidly rather than 45 degrees would be helpful.\n\nHope these are implemented to refine an already great game.\n\nHelpful | 2", "P-NuTTyOct 20 at 8:11 PM\nFantastic game!\n\nGreat game! I'm addicted to it!\nOnly thing keeping from 5 stars is that sometimes you'll swing and it'll go through the ball instead of hitting it. I've noticed it more on bigger swings. Once it's fixed I'll give it 5 stars. As others have said being aligned properly for the shot would be nice it would also mean you wouldn't need a big area to play in. A driving range and putting area to practice would be really cool to practice accuracy and spins you can add to the shots.\n\nEdit: update has improved positioning beside the ball and haven't had any swing and miss issues. Updated to 5 stars!\n\nHelpful | 4", "GamblinManCamSep 22, 2019 at 8:55 PM\nThe depth is there.. worth the buy!\n\nNegatives:\nThe course builder could be deeper.\nIt's very cookie cutter. I want to be able to manipulate down to the minutiae and change things while trying it out...\nYou cant pause or save a game.\nI recommend the devs either had a 3 Hole quick play for local multiplayer or let you save and pause 9 hole games..\nAlso in game avatars and multiple profiles would really flesh out local play.\nPositives:\nThis game is the best new game on quest bar none.\nBear saber and Cloudlands are easily the best experiences for new players and cloudlands has the competitive edge because it's a sports game\n\nHelpful | 1", "wackylolOct 20 at 12:25 PM\nAn great game to play together\n\nReally enjoyed playing this with a friend online. It does take time to set yourself up for the shot which is something that needs tweaking. However, the mini golf games are so much fun and we really enjoyed being able to watch each others shots. I cant wait to build and test my own course now!\n\nHelpful | 1", "aaron.sommers.1253Aug 27, 2019 at 10:51 AM\nCloudlands 2\n\nGreat mini golf game. Alot of things to keep you busy with this golf game. Make your own custom course, or play someone else's, also play on line with friends. I loved Cloudlands on the Go but this is the way to play. Thanks development :)\n\nHelpful | 20", "ItsJoeMotherOct 14 at 6:17 AM\nOverall just a disappointing game\n\nTheres no need for the second set of controls because you can switch between clubs in the menu of the first one. If it was only the second set we wouldnt have to sit and wait for them to change so we could go to the ball. Im really bad at the game but the most annoying part about it is that when I mess up a shot I have to wait 15 minutes to shoot again and if while readjusting myself I accidentally tap the ball i have to do it again. I do not recommend this game until the tweak all the bugs out of it. It has a lot of potential but the developers seem to not be paying any attention to it.\n\nHelpful | 1\nDeveloper ResponseJan 10 at 1:28 AM\n\nHi, I don't really understand your feedback about switching clubs and taking 15 minutes to shoot. You can easily switch your clubs and adjusting yourself to hit the ball again is the same as in real life. You simply move your body and hit the ball.", "VRmageddonSep 1, 2019 at 12:30 PM\nGreat game, some minor bugs\n\nHad the game for 3 days now & I'm loving it. The gameplay is fun, especially when playing with friends. Level editor is comprehensive, just takes a little while to get used to it.\nThe auto teleport is a bit off but you soon get used to manually teleporting to the correct position.\nMy only complaint is very occasionally the ball bounces off an invisible wall & comes back at you.\nNothing a quick restart won't fix though.\n\nHelpful | 3", "paulohotlineAug 27, 2019 at 11:41 AM\nFinally a Golf game for the Quest!\n\nThank you very much, I love playing golf and this will care for that itch when I cannot play the real thing. Can I ask that you add the ability to login into my Spotify account as I love to listen to classical music when I golf. Why devs don't this in every game is beyond me :) 5/5 Tigers Wood.\n\nHelpful | 7", "ParadiseDecayAug 31, 2019 at 2:04 PM\nPlaying VR on a real Golf Course!\n\nMy Initial Thoughts:\nProbably the best golfing game available on Quest. A mixture of 'Put & Pitch' and Crazy Golf!\nMy only gripe is the ball not starting in the right place, ready for you to swing, you have to mess around with teleport each time to stand in the right spot.\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=PZ8wMGDCy04\n(Please note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR Cloudlands 2')\n\nHelpful | 2", "ScottyDean77Oct 11 at 10:17 PM\nNoooo thanks\n\nI liked the first one on the Go but this one just isnt fun at all. The ball doesnt go where you aim it seems and its too expensive. I liked having the option to lock the direction and control the swing speed. If it was easy to get a refund I would. Its just sitting in my uninstalled library and thats where itll stay.\n\nHelpful | 1\nDeveloper ResponseJan 10 at 1:29 AM\n\nHi, this version utilizes the 6 degrees of freedom of the controller (full swing control). If you're looking for the simplified 3 degrees of freedom control you will need to stick with the version on the Go as that control type is not available on this version.", "snowyboy123Aug 27, 2019 at 1:44 PM\n\nGood game but I rather bought this game thinking Id be able to play mini golf course Im only able to play on a golf course and not mini golf?\n\nHelpful | 5", "NickMajoraSep 22, 2019 at 6:42 PM\nFun Game\n\nIt's a good, simple golf game with UX issues (I wouldn't recommend playing with less than a 2.5x2.5m space). The series has a lot of potential and I look forward to the next one.\n\nHelpful | 1", "stevejordan1stSep 28, 2019 at 5:56 PM\nOne of my favorite go-to games!\n\nAlways fun for a relaxing experience. I love everything about this game. Thousands of levels. I don't mind the player placement that other people are upset about. It's a relaxing golf game so I just take the extra second when needed to either step back from the ball or use the teleportation movement to move back just a little. Thanks for making this game available to the Quest!\n\nHelpful | 1", "supermitsubaAug 29, 2019 at 3:16 AM\nGolf game\n\nIts neat game. I like the mini golf and regular golf. While the review is three stars, the game has potential and is fun regardless.\n\nIssues are the following :\n1. recentering causes the positioning to get off making it hard to press trigger to teleport where the shot is.\n2. Would have been nice to keep the mini golf separate from the regular golf.\n3. How do i know how hard I'm hitting? The swinging is not predictable for me.\n\nDon't get me wrong, its a fun game, but there are some frustrations making the review wanting more.\n\nHelpful | 4", "LamestGamrAug 29, 2019 at 11:51 AM\nIRL Golfer Approves\n\nI have played most of the current VR golf games, and I prefer Cloudlands 2 to even The Golf Club VR. It may be very much an arcade experience but it captures the essence of what is fun about golf. I like the feel of the swinging and putting mechanics, which is essential for a VR golf game. I wish it would have leaderboards for playlists of holes. That would get my competitive juices going a lot more than just competing on single holes. It would also be cool to have ghost captures of other playthroughs and be able to play against the ghosts. The multiplayer is excellent but I haven't been able to get into many on-line matches. Hopefully that will change once more people buy this title.\n\nHelpful | 3\nDeveloper ResponseJan 10 at 1:32 AM\n\nWe love your feedback about the playlist leaderboards and ghosts. Thanks!", "Coconut4MeSep 14, 2019 at 9:48 PM\nHole in one!\n\nThis is a great VR game. You have to get acquainted with the controls but, after that you will be rolling. Using a club as if in RL is difficult as the controls bind together a little. Love the adjustable power options and ability to travel to your next shot. Overall, a must have !\n\nI would love to see more club options and a two handed swing option.\n\nHelpful | 1", "OrdinaryWorldAug 27, 2019 at 2:18 PM\nJust not that enjoyable\n\nI was happy to see a golf game appear on the Quest and so I bought this one within hours of launch. I played for a little over an hour (on easy, quick game) trying to get to grips with the physics and gameplay. I found the controls awkward and the physics inaccurate. In addition, when I teleport to the ball I'm in the wrong orientation and have to physically move so after several shots I'm invading the guardian or too close to the wall. I get that the graphics are designed to be clunky but so is the gameplay and the mini golf holes are not really well thought out. Maybe it gets better with more experience but I don't have the time to find out.\n\nHelpful | 11", "DAX_QcAug 27, 2019 at 12:06 PM\nNope\n\nPhysics sucks, controles sucks. Teleporting on the ball needing to replace yourself all the time. I get the graphics are basics but darn. This is a 5$ game not a 25$ one (canada). this is basic to the bone to the point of being boring to death. Multiplayer keep disconnecting me. Refund . 2* not 1* bc it has multiplayer.\n\nHelpful | 15", "TomanoleSep 1, 2019 at 11:23 AM\nNow 5 stars\n\nAs of last night, I was going to rate this game 4 stars. But, today I discovered two features that I am not sure were there yesterday that solved two major gripes.\n\n1) When you finish a shot, you only need to press the trigger and point down to be teleported to the ball location.\n\n2) When creating a hole, you can scale the entire hole for better perspective and to make longer holes.\n\nIf this was an update, thanks! You read my mind. If not, maybe it should have been more obvious (#1)\n\nMinor gripes/thoughts:\n\nIf you resize a green, it should not make the hole bigger.\n\nThere should be a way to indicate that you are ready to swing. Like gripping the controller should have done that, with club options on the a button.. This way you don't accidentally hit the ball.. In practice mode you could give an idea of swing strength.. If you have ever played Wii golf you will know what I mean.\n\nSettings button on the main menu, not hidden in game play menu.\n\nHelpful | 6", "SerpulaSep 6, 2019 at 10:12 PM\nIts like Wii Sports Golf but Im there!\n\nI really love this game. The mechanics are perfect, not too realistic (Ive never played golf so thats a good thing, it looks hard!) but enough to feel super satisfying when you sink a chip from outside of the green.\n\nThe multiplayer is totally solid. Being able to be present with my brother who lives 400 miles away is amazing. Theres so many levels to play this will last us a long time. Performance is spot on too - some have said it looks like Rec Room, which is true but the difference is a solid frame rate and higher resolution.\n\nUpdate: Lots of people are complaining about trouble lining up the ball but this is fixed in the most recent update. Now when you press the trigger, youre taken to the ball but it places it in the middle of your guardian... you just walk to the ball and youre in a safe place to swing. This is much more immersive as I can forget about smashing my TV and lose myself in the game.\n\nHelpful | 2", "Tyler_C-137Aug 29, 2019 at 6:20 AM\nGoing to say the same thing...\n\nSo I'm going to say the same thing that everybody else is saying. The game can definitely be fun, but it definitely needs some tweaking. The teleport 2 ball option and position it places you when teeing off are terrible. You basically have to teleport around multiple times just to get into the correct position to hit the ball. Either that or have a large enough of a play space, and even with that there's so much walking around you would have to do that you eventually you would walk into a wall or something around you. I'm giving two stars until this is updated, it could definitely be upgraded once they fix that.\n\nHelpful | 6\nDeveloper ResponseJan 10 at 1:33 AM\n\nHi. Thank you for your feedback. Is your basic complaint about the teleporting the fact that you have to move your body in real life to align your shot? The game is not designed to teleport you and align you to your next shot without you having to move. If you find you're stuck in a wall, you can simply rotate the world with the left/right analog and find yourself out of the wall.", "D00GIESep 5, 2019 at 5:31 PM\nAbsolutely worth it\n\nThis is the kind of game that keeps on giving. The gameplay is easy to get used to with very simplistic controls. The amount of courses or putt putt to play are virtually unlimited. I have not created any courses myself yet but I noticed that they give you a great variety to create whatever you want. Absolutely worth it for the price and replay ability.\n\nHelpful | 1", "Reborn409Aug 28, 2019 at 2:07 PM\n\nBe careful, take off your second controller when you play, game doesn't show second hand and you can easy destroy controller by hitting one with other.\n\nSecond thing, when you auto teleport, why all time need to adjust my position, why can't you remember position to ball and hole(so would be ready to hit in most cases), need to move all time around and care that i not reach a wall soon.\n\nAbout physics, why ball bounce so high, also when you play on mini golf courts, why it's so easy for ball to jump off map, when you hit wall with high speed.\n\nHelpful | 8\nDeveloper ResponseJan 10 at 1:35 AM\n\nHi, the reason we cannot align the next shot is because with user created holes, there is no way to accurately predict the direction your next shot should take. And if we always rotate the view to look at the direction of the hole, we may easily just have you aiming into a wall or the trees.", "CrustyPocketsAug 31, 2019 at 4:17 AM\nWhy the negativity?\n\nI almost didn't buy this because of the reviews that mentioned the awkward controls. Boy am I glad I took the plunge regardless! The teleporting function is fine and having to take a few steps to line up your shot is the whole point of golf! This is easily my best Quest purchase so far.\n\nHelpful | 2", "Zeno.OasisSep 28, 2019 at 12:45 AM\nGreat fun!\n\nSuper easy but also have competitive game play. This is the perfect game when I cant go out and play 18 due to rain. And even my wife enjoys it too!\n\nHelpful | 0", "SwagcityUSAAug 28, 2019 at 5:36 AM\nAmazing\n\nI got this game cause I play play golf from time to time and I was happily impressed, the community is great and the map making is simple but its easy to make these amazing scenery for you golf courses, the campaign has a mix of regular and mini golf, the possibilities are limitless and that makes for constant change which will keep many people interested in the game for a while. The only recommendation I have is possibly put in advanced clubs like a real club set for advanced players\n\nHelpful | 0", "Godislove4uAug 29, 2019 at 11:55 AM\nA great sequel and a bonus\n\nWas surprised but pleased to get a full huge explorable course.Not sure if it's no longer a mini golf  game or a full professional type now.It was one of the coolest vr sports games with the original but this is totally tailored for the quest.It's worth the twenty.Jesusavesouls !\n\nHelpful | 1", "StrangeghostSep 6, 2019 at 11:56 PM\nNice!\n\nThis game is tons of fun, especially the online multiplayer. I can see myself playing this more than almost any other game. No trouble at all lining up for shots here. Highly recommended. See you on the course!\n\nHelpful | 0", "Mr.TipsySep 3, 2019 at 5:52 AM\nGreat Game... but the physics\n\nPlease add more Friction to the Ball...\n\nHelpful | 2", "BoudeceaAug 27, 2019 at 12:32 PM\nWii Golf\n\nWow what a great game of golf love the mixture of fairway and mini golf and with a bit of practice you can start hitting some decent shots, Great fun\n\nHelpful | 6", "Jdevlin-Aug 29, 2019 at 4:23 AM\nGreat game\n\nGreat game! Hoped in a game with 3 other people online and we had a blast. Really fun worth it you like golf at all\n\nHelpful | 1", "Aracnareaper007Aug 30, 2019 at 11:17 PM\nFun golf game\n\nThis is a fun golf game. I play just as bad in this as I do in real life... who knew.\n\nHelpful | 2", "TuvivavalAug 27, 2019 at 5:24 PM\nSuper fun\n\nReally nice game! Oculus quest needed a nice golf game like this one!\n\nHelpful | 2"]