{"App Title": "Coaster Combat", "App description": "Theme park ride meets action game in Coaster Combat, the most enjoyable roller coaster experience ever! Its amazingly comfortable yet extremely exhilarating with fun shooting action, endless track combinations and beautiful environments that will keep you coming back for more. Share the fun with the whole family, create a profile for everyone and battle it out for a place at the top of the scoreboard - or compete online against your Oculus friends! Win all the golden medals to access 'Gold Rush', where your skills are truly tested and golden rewards waiting to be unlocked!", "Purchase section": "$9.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Casual, Roller Coaster", "Languages": "English", "Version": "1.0", "Developer": "Force Field Entertainment", "Publisher": "Force Field Entertainment", "Website": "https://coastercombatvr.com/", "Release Date": "July 16, 2020", "Developer Privacy Policy": "PROJECTS\nABOUT\nJOIN US\nNEWS\nCONTACT\n\nPRIVACY POLICY\n\nForce Field Holding B.V. and all its subsidiaries (Force Field B.V., Force Field Entertainment B.V., Force Field HBE Studio B.V., Force Field LBE Studio B.V. and Force Field Productions B.V.), hereafter: Force Field, is committed to maximizing your experience on its website and its products within a trusted environment and respect your privacy, in accordance with the General Data Protection Regulation (GDPR). This privacy policy explains how we collect, protect, use and share information we collect about you on our website and when using our products. We are confident that this disclosure will help increase your confidence in our website, our products and enhance your experience. Please note that this privacy policy applies only to information submitted and collected online at our website or in our products. It does not apply to any websites maintained by other companies or organizations to which we may provide links to their content. What types of personal data does Force Field collect and how will it be used? Force Field collects personal data when you use our website and our products. The information we collect is used exclusively for communication and marketing research purposes. We keep the data we collect to a minimum and only collect your data if we must do so depending on the service we provide or when this data is automatically collected when you use our products.\n\nOur website\n\nThe majority of content on our site is offered without us collecting any personally identifiable information from you. There are a few activities on our site where the collection of personal data is necessary. The data we collect in these cases concern; your name and email address and all the other information you provide us with in your contact with us. These activities include:  signing up for an email newsletter or other online information service we may offer,  entering a contest,  answering a survey*,  contacting us using a webform In all of those instances we will offer you channels to contact us in case you desire to delete the information we have of you and we only keep the data as long as needed for the purposes of use.\n\nSurveys are conducted strictly for internal profiling purposes and only keep track ofinformation you provide us with which can not be directly traced back to a person (e.g., age, games played, consoles owned).\n\nWe collect personal information contained in the email for the purpose of responding to a visitors questions and/or comments.\n\nJob applications\n\nFrom time to time, we may post on our website job openings at Force Field and provide an email address to which interested applicants can submit their resume. The data we collect solely for this purpose can consist of your first and last name, date of birth, gender, nationality, education, marital status and contact details such as your e-mail address, postal address and telephone number and all other personal details stated in your application. The information you provide us with for this purpose will be used solely for its intended purpose (i.e., to evaluate the applicants qualifications). We hold on to this information for one month. We keep this information for two years after you have applied in case a possible position becomes available, but only if you explicitly confirm to us that we are allowed to do so. You can also contact us to remove our records and personal information we have of you at any time.\n\nOur products\n\nOur digital products, which consist of our VR games and experiences*, collect anonymous data based on your experience and we will never store any personal identifiable information, strictly following the GDPR definition of such data, that includes your name, IP address, username, e-mail address and any other information related to you directly.\n\nConcerning third party sites where you can view, download and/or purchase our products we cannot guarantee that the privacy policies of these websites have the same policies as Force Field and we recommend that you read the privacy policy of the website in question before you submit any personal information.\n\nForce Field VR and associated companies (\"Force Field,\" \"we,\" \"us\"). We make virtual, mixed, and augmented reality products. This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services. We have arranged our service in such a way that we do not collect any personal information. For instance, we encrypt and anonymize all the data that relates to your VR experience before we can actually see the data in our log files. This means no information regarding your gamer profile, IP-address etc. reaches us.\n\nOn which legal grounds does Force Field collect your data? Force Field only collects data when there is a legal ground to do so. These legal grounds consist of:  In the performance of a contract  In case there is a legitimate interest: for example, when the processing enables us to enhance, modify, personalise or otherwise improve our services to the benefit of the websites users. Or, to enhance the security of our services and determine if our marketing is effective.  Based upon your consent: for example, when you subscribe to our newsletters\n\nWhat happens if I refuse to provide my personal information to Force Field? If you choose not to submit personally identifiable information when requested, you may not be able to access certain areas of our website or our products and you may considerably limit the services we can provide you. Still, we consistently ask for your permission whenever we need such information to be sent to us and provide you with the right information regarding the limitations and options you have to refuse or accept sending us such data.\n\nDoes Force Field use cookies or other means to collect information? A cookie is a small file or record-keeping device that websites often store on a users computer. (You can disable cookies or set your browser to alert you when cookies are being sent to your computer.). During your experience Force Field may use cookies to store options and decisions you might have made during your browsing experience, including your decision to consent to our privacy policy when requested. These cookies do not carry personal identifiable information of any kind.\n\nWith whom does Force Field share my personally identifiable information? From time to time, we may employ and share your personal information with vendors who use it solely to provide support for the internal operations of our website (e.g., technical support and network delivery) or social features of our products. These entities will not use your personally identifiable information for any other purpose, and have agreed to maintain the confidentiality, security, and integrity of the personal information they obtain from us. With these entities we have entered into a Processor Agreement. We dont (at this moment) share data with parties outside the EER. If we ever do so we will make sure to take additional measures, such as entering into an additional agreement with such party to ensure an adequate level of data protection for you.\n\nIt is our policy not to share, sell or rent your personal information to any company not directly related to the manufacture or publishing of Force Field products. We may disclose your personal information in the good faith belief that we are required to do so by law or to comply with legal processes, respond to any claims or protect the rights, property, or personal safety of Force Field or the public.\n\nYour rights regarding the information Force Field collects Under the GDPR, you as a subject have the following rights:\n\nThe right of inspection. This means that you can request access to the personal data we have collected from you. We will send you your data in a .csv-file.\nThe right to rectify your data if it is incorrect.\nThe right to delete your data, also known as the right to be forgotten.\nThe right to object to (future) processing of your data or to limit it, provided there is no legal bases that prevents this.\nThe right to revoke your consent to processing that you have issued. For instance, if you dont want to receive our newsletters anymore.\nThe right of data portability. This means that you can request us to hand you over the (digital) information we have collected from you (with your consent) so you can hand this over to another data controller.\nIf you want to make such a request please contact us, at any time, via email at privacy@ForceFieldVR.com. We will review and ask upon your request within one month and send you a confirmation.\n\nWhat is Force Fields policy regarding links to third party sites? You should be aware that while you are on a website operated by us, you may be directed to other sites that are beyond our control and for which we are not responsible. Because we cannot guarantee that the privacy policies of these websites meet our high standards, we recommend that you read the privacy policy of the website to which you link before you submit any personal information.\n\nWhat safeguards does Force Field use to protect my personally identifiable information? We maintain appropriate safeguards that ensure the security, integrity and privacy of the personally identifiable information we collect from all visitors. Personal information collected by us is stored in secure operating environments that are not available to the public and are only accessible by authorized employees. We also have security measures in place to protect the loss, misuse and alteration of the information under our control.\n\nHow do I ask a question or file a complaint? If you have any questions, complaints or comments regarding our privacy policy or practices, please contact us via email at privacy@ForceFieldVR.com. If you feel like having to you can also file a complaint at the Dutch Data Protection Authority in The Hague (https://autoriteitpersoonsgegevens.nl/).\n\nData Retention: Applications Applications and job position submissions are kept in our records for a maximum of one month (or two year after your explicit consent), and after this period all records, CVs and information is removed from our databases.\n\nData Retention: Products Our products do not store data that identifies you. During your time with one of products, we may collect information about your experience, such as progress, scores and unlocked content, but, using a one-way encryption system, we can guarantee that your data is anonymous when it reaches our databases. This means that all data collected within our products can never be used to identify you in any way.\n\nHow will we notify you of changes to this policy? If we make changes to this Privacy Policy that may impact you, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, and/or providing notice through the Services. If we make an administrative change, we may update the \"Last Updated\" date at the top of this Privacy Policy.\n\nThis site uses cookies including cookies from third-party services on pages with embedded content. Please read more about our privacy policy.\nACCEPT AND CONTINUE\nForce Field Entertainment\nWesterdoksdijk 421\n1013 AD Amsterdam\n020 707 68 42\ninfo@forcefieldxr.com\nForce Field Holding\nTorenlaan 9\n1261 GA Blaricum\n020 707 68 42\ninfo@forcefieldxr.com\nSocial\nFacebook\nTwitter\nLinkedIn\nInstagram\nSubscribe\nSEND\n 2019 Force Field Entertainment. All rights reserved.\nMember\nWeb by Wonderland.", "Developer Terms of Service": "PROJECTS\nABOUT\nJOIN US\nNEWS\nCONTACT\n\nTerms of Service For The United States\n\nTHIS TERMS OF SERVICE AGREEMENT APPLIES TO USERS WHO RESIDE IN ORACCESS THE SITE OR THE GAMES FROM A LOCATION WITHIN THE TERRITORY OFTHE UNITED STATES. IF YOU MEET THIS REQUIREMENT, YOU MUST AGREE TO THISTERMS OF SERVICE AGREEMENT BEFORE USING OUR WEBSITE AND/OR PLAYINGOUR GAMES. IF YOU RESIDE IN OR ACCESS THE SITE OR THE GAMES FROM ALOCATION OUTSIDE THE TERRITORY OF THE UNITED STATES, THE TERMS OFSERVICE FOR USERS OUTSIDE THE UNITED STATES, LINKED HERE, APPLIES TO YOU.\n\nThis Terms of Service Agreement for the United States (Agreement) informs you of the terms,conditions, disclaimers, notices and policies (collectively the Terms) that apply to your access anduse of the website of Force Field BV. (Force Field), located at the URL www.ForceFieldVR.com(Site) and any and all games and related products, including virtual goods, provided by ForceField (Games). Collectively, the Site and the Games are referred to as the Services in this Agreement. Many of these Games may be playable by one or more persons simultaneously (each aUser and collectively Users), and the conduct of all such Users while playing the Games orusing the Site is governed by this Agreement.\n\nThis Agreement is a binding contract between you and Force Field that provides for important rightsand obligations. By accessing, browsing, and/or using the Services and/or playing, downloading orbrowsing our Games you represent to Force Field that you have read, understood and agree to bebound by this Agreement and all applicable local, state, national and international laws andconventions, including without limitation all intellectual property laws. Force Field reserves theright, at its sole and absolute discretion, to deny any User access to the Services, without notice. Ifyou violate any of the Terms, we may, at our option, give you a warning notice of violation orterminate your account immediately for violation of the Terms.\n\nIF YOU DO NOT AGREE TO ALL OF THESE TERMS, YOU MUST NOT ACCESS OR USETHE SITE OR ACCESS OR USE OUR GAMES.\n\nTHIS AGREEMENT CONTAINS A BINDING INDIVIDUAL ARBITRATION AND CLASSACTION WAIVER PROVISION IN SECTION 19 THAT AFFECTS YOUR RIGHTSUNDER THIS AGREEMENT WITH RESPECT TO ANY \"DISPUTE\" (AS DEFINED INSECTION 19) BETWEEN YOU AND FORCE FIELD. YOU HAVE A RIGHT TO OPT OUTOF THE BINDING ARBITRATION AND CLASS ACTION WAIVER PROVISIONS ASDESCRIBED IN SECTION 19.\n\nELIGIBILITY TO ACCEPT AGREEMENT AND USE THE SITE\n\nYou must be at least 13 years of age and either reside in or access the Site or Games from a locationwithin the United States to access and use the Services. There is no exception to this requirement.Force Field does not knowingly collect any personal information from children under the age of 13that falls within the Childrens Online Privacy Protection Act and Rule. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legalparental or guardian consent, and that you are fully able and competent to understand and acceptthis Agreement as a binding contract and to abide by all Terms.\n\nFORCE FIELDS RIGHT TO MODIFY AGREEMENT\n\nForce Field may modify this Agreement at any time, with or without notice to you, by posting themodified Agreement on the Site. Your continued use of the Services after such modification shall bedeemed to be your acceptance of any such modification. Any such modification will only apply tomatters and events which occur following the date of modification. You may not modify thisAgreement without the prior written authorization of an officer of Force Field. It is yourresponsibility to check this Agreement regularly to determine whether the Agreement has beenmodified. IF YOU DO NOT AGREE TO ANY MODIFICATION OF THIS AGREEMENT YOUMUST IMMEDIATELY CEASE USE OF THE SITE AND UNINSTALL ANY GAMES YOUMAY HAVE INSTALLED ON YOUR COMPUTER OR OTHER INTERACTIVE DEVICE ORPLATFORM.\n\nPOLICY ON PRIVACY\n\nThe Services include the Privacy Policy relating to the collection, use and disclosure of your information. Please read the Privacy Policy carefully. By using the Services, you are consenting to the Privacy Policy.\n\nFORCE FIELDS OWNERSHIP OF THE SERVICES AND PROPRIETARY MATERIALS\n\nThe Services contain copyrighted material, technology, trademarks, service marks, trade secrets andother proprietary information, which may include computer code, text, data, video, images,illustrations, animations, sounds, musical compositions and recordings, audiovisual effects, colorschemes, business methods and methods of operation, concepts, ideas, know-how, moral rights, andany related documentation (collectively the Proprietary Material). All intellectual property rightsto the Proprietary Material, including patent, copyright, trademark and trade secret rights, are ownedor licensed by Force Field. You agree not to copy, download, reproduce, republish, upload, post,transmit, perform, display, distribute or sell, or in any other way exploit the Proprietary Material, orto participate with or to encourage others to engage in such acts, without the prior written consent ofForce Field. Moreover, you may not reverse engineer, disassemble, decompile, or translate anycomputer software programs that comprise Proprietary Material, or otherwise attempt to derive thesource code of such programs, except to the extent allowed under any applicable law. If applicablelaw permits such activities, any information so discovered must be promptly disclosed to ForceField and shall be deemed to be the confidential proprietary information of Force Field. Nor maythe Proprietary Material, or any portion thereof, be modified or used for any purpose other than asexpressly authorized in this Agreement. The Proprietary Material may include materials licensed byForce Field from third parties. The licensors of those materials are an intended beneficiary of thisAgreement and may enforce their rights in the event of any violation of this Agreement.\n\nALL RIGHTS NOT EXPRESSLY GRANTED TO YOU IN THIS AGREEMENT ARERESERVED BY FORCE FIELD AND ITS LICENSORS.\n\nOWNERSHIP OF IDEAS INVENTIONS AND USER SUBMISSIONS INCLUDING USER-GENERATED CONTENT\n\nThe Services provide you with access to a variety of resources, materials and downloads, and mayallow you access content made available by Force Field and other Users. Such content may include, without limitation, game levels, content creation tools, audio, video, film, music, text, communications, software, graphics, images, and information. All such content made available byyou or by other Users of the Services is referred to in this Agreement as User-Generated Content. As between Force Field and you, you own the copyright in any User-Generated Content that is exclusively created by you. You expressly acknowledge and agree that any User-Generated Content that you make available through the Services may be made freely available by Force Field to others, including without limitation for download by others.\n\nYou further acknowledge and agree that this permission is made and granted by you inconsideration of your use of the Services, and that this permission constitutes a world-wide, nonexclusive, perpetual, royalty-free, irrevocable and transferable license to Force Field to use, copy, perform, display and distribute such User-Generated Content, and to grant and authorize sublicenses of such User-Generated Content to others.\n\nAll comments, feedback, suggestions, gameplay features, level designs, and other submissions(User Ideas) disclosed, submitted, or offered to Force Field shall be the exclusive property ofForce Field. Unless otherwise prohibited by law, Force Field may use, sell, exploit, or createderivative works from these User Ideas and, further, Force Field may disclose these User Ideas tothird parties or the general public, without compensation to you.\n\nYou acknowledge that User Ideas and User-Generated Content are provided by you on a completelyvoluntary basis. Should you not wish to have your User Ideas or User-Generated Content incorporated into any game or website functions, you may choose not to share them with ForceField on the Site.\n\nTERMINATION OF GAMES OR SERVICE\n\nForce Field may terminate access to any or all Games and/or Services at any time by giving younotice of such termination within the time period specified when you consented to the Services, or ifno time period for notice of termination was specified, then no less than thirty (30) days of the datesuch notice is either provided to you, at Force Fields discretion, either by email or by posting onthe Site.\n\nPROHIBITED USER-GENERATED CONTENT\n\nYou are solely responsible and liable for any User-Generated Content that you upload, post, input,publish or otherwise distribute using the Services. As a condition of your use of the Services, youagree not to use the Services for any unlawful or prohibited purpose. User-Generated Contentprohibited from upload, display or posting on the Services includes, without limitation, any User-Generated Content that Force Field determines in its sole and absolute discretion to prohibit. Without limiting the scope of Force Fields discretion, prohibited User-Generated Contentspecifically includes anything that:\n\n(a) constitutes or includes any illegal or unauthorized copy, in whole or in part, of another personscopyrighted or copyrightable work, discloses trade secrets without authorization, or otherwiseviolates the proprietary rights of a third party;\n\n(b) misrepresents the source or identity of any material;\n\n(c) is unlawful, obscene, defamatory, libelous, threatening, abusive, harassing, promotes racism,bigotry, hatred or physical harm of any kind against any individual or group, or encourages anyother conduct that would be considered a criminal offense, creates civil liability, or is otherwiseoffensive to Users of the Services or is otherwise inappropriate;\n\n(d) violates the rights of privacy or publicity of any person;\n\n(e) is false or deceptive;\n\n(f) displays pornographic or sexually explicit material of any kind;\n\n(g) includes material that exploits people under the age of 18 in a sexual or violent manner;\n\n(h) is an advertisement or solicitation to sell a product or service to Users of the Site, or constitutesany other commercial use of the Site, without the prior written consent of Force Field;\n\n(i) is unlawful under the laws of the United States or any individual state or locality, the laws of anyforeign jurisdiction, or any international treaty or convention; or\n\n(j) interferes with the proper functioning of the Services or the Site, or violates any other of theTerms of this Agreement.\n\nYou should not post any User-Generated Content if you are in doubt about its legality or itsprohibition by the Terms.\n\nYou acknowledge that Force Field is a service provider that may allow Users to interact onlineregarding topics and content self-chosen by the Users. Force Field does not endorse any User-Generated Content or any opinion, recommendation or advice that may be expressed. Force Fieldgenerally does not regulate and shall have no obligation to monitor any User-Generated Content. Nonetheless, Force Field and its agents shall have and reserve the right to monitor any User-Generated Content from time to time for any lawful purpose. Force Field may, without notice to you, remove or block any User-Generated Content, including disabling access to such User-Generated Content. Force Field also may terminate your access to the Site and refer the User-Generated Content to law enforcement if it is in violation of any state, federal or local law.\n\nPROHIBITED USER CONDUCT\n\nSubject to the permitted use of the Services granted in this Agreement, you may not, in whole or inpart, copy, photocopy, reproduce, translate, reverse engineer, derive source code from, modify,disassemble, decompile, or create derivative works based on the Service, or remove any proprietarynotices or labels from the Service. Failure to comply with the restrictions and limitations containedin this Section 10 will result in the immediate, automatic termination of your access to the Servicesand may subject you to civil and/or criminal liability.\n\nYou further agree that you will not, under any circumstances:\n\n(a) frame or otherwise display any portion of the Services or its contents that is not your User-Generated Content without prior authorization;\n\n(b) sell, grant a security interest in, or transfer reproductions of all or any portion of the Services toother parties in any way not expressly authorized herein, nor shall you rent, lease or license all orany portion of the Services to others;\n\n(c) exploit the Services or any of its parts for any commercial purpose whatsoever without theexpress prior written authorization of Force Field;\n\n(d) host, provide or develop services for or using the Services, or intercept, emulate or redirect thecommunication protocols used by Force Field in any way, including without limitation throughprotocol emulation, tunneling, packet sniffing, modifying or adding components to the Services, useof a utility program or any other techniques now know or hereafter developed, for any purpose,including without limitation unauthorized access in any form over the Internet;\n\n(e) facilitate, create or maintain any unauthorized connection to the Services, or any portion thereof,including without limitation any connection to any unauthorized server that emulates, or attempts toemulate, the Services. All connections to the Services, or any portion thereof, may only be madethrough methods and means expressly approved by Force Field. Under no circumstances may youconnect, or create tools that allow you or others to connect to the Services, or any portion thereof,other than those expressly provided by Force Field;\n\n(f) to develop or allow any malware, adware, spyware, Trojan Horses, cancelbots, other automatedbots, auto players, cheat utilities, spoofers, keyloggers, or other circumvention devices to bepresent on any machine used to access the Services; and/or to attempt to upload/utilize such devicesagainst the Services;\n\n(g) use vulgar, obscene, pornographic language or other behavior while in the forums, chat rooms,or other public areas that will disrupt the User experience in those areas of the Site;\n\n(h) use the Services in connection with any contests, surveys, chain letters, pyramid schemes orother similar services, whether or not they are used for commercial gain;\n\n(i) collect, harvest, scrape or capture any User information, email addresses or other personal dataof the Users to send unsolicited emails or any other communication, whether this is done forcommercial gain; or|\n\n(j) use the Services in a manner prohibited by any applicable law or government regulation, or bythe Terms.\n\nForce Field expressly reserves the right to monitor any/all network traffic between the User(s) andthe Services to prevent the use of said means to compromise the Services\n\nUSER REGISTRATION AND ACCOUNT SECURITYAs a condition to using certain components of the Services, you may be required to register withForce Field and select a password and screen name (User ID) to obtain a personal account. Incases where you do not choose a user name/screen name, Force Field may automatically assign youa user ID to identify you to our servers.\n\nYou agree to provide Force Field with accurate, complete, and updated registration information.Failure to do so shall constitute a breach of the Terms, which may result in immediate, automatictermination of your access to the Services. You may not select or use as a User ID a name of anotherperson with the intent to impersonate that person; use as a User ID a name subject to any rights(including trademarks or copyrights) of a person other than you without appropriate authorization;or use as a User ID a name that is otherwise offensive, vulgar or obscene. Force Field reserves theright to refuse registration of, or to cancel, a User ID in its sole and absolute discretion.Notwithstanding the foregoing, you acknowledge that Force Field cannot guaranty the accuracy ofany information submitted by any User of the Services, nor any identifying information about anyUser.\n\nYou are solely responsible for the activity that occurs through your account. You shall be solelyresponsible for maintaining the confidentiality of your password. You may not share your accountwith a third party or use the account of a third-party. You agree to notify Force Field immediately inwriting of any unauthorized use of your account, or other account-related security breach of whichyou are aware. You may cancel your account at any time upon written notice to Force Field.\n\nPROMOTIONAL PROGRAMS\n\nForce Field may implement marketing and promotional programs in which Users are offeredbenefits or considerations based upon the performance of specified activities, the satisfaction ofspecified requirements, or other criteria. Any such program, including the eligibility and selection ofUsers, the award, compensation or other benefit to be granted Users, if any, and the duration, shallbe at the sole and absolute discretion of Force Field. You acquire no right or interest to participate insuch program or to the impartial implementation of the program and distribution of any awards,compensation or benefits. You hereby expressly waive and disclaim any such right or interest as amaterial Term of this Agreement. To the extent such program may involve one or more third parties,you further expressly waive and disclaim any such right or interest against such third party. ForceField may elect in its sole and absolute discretion to contact you with regard to a program. Youhereby expressly authorize Force Field to contact you by means of the contact information you haveprovided to Force Field.\n\nLINKS TO THIRD-PARTY WEBSITES\n\nSolely as a convenience to Users, Force Field may provide links on the Services to other websitesowned by third-parties. Unless otherwise expressly stated, Force Field does not endorse or controlthese third-party websites and assumes no responsibility for them or the content contained therein.\n\nGENERAL DISCLAIMERS\n\n(a) THE SERVICES AND ANY ACCOMPANYING DOCUMENTATION AND MATERIAL AREBEING PROVIDED TO YOU AS IS WITHOUT WARRANTY OF ANY KINDWHATSOEVER. WITHOUT LIMITING THE INTENDED GENERALITY OF THEPRECEDING SENTENCE, FORCE FIELD DOES NOT WARRANT THAT THE SERVICES ORANY PORTION THEREOF (i) WILL BE UNINTERRUPTED, SECURE OR ERROR FREE, ORTHAT DEFECTS WILL BE CORRECTED; (ii) IS COMPATIBLE WITH ANY SOFTWARE,INCLUDING WITHOUT LIMITATION INTERNET BROWSER SOFTWARE; (iii) IS FREE OFINFECTION BY VIRUSES, WORMS, TROJAN HORSES OR ANYTHING ELSEMANIFESTING CONTAMINATING OR DESTRUCTIVE PROPERTIES; OR (iv) IS FREE OFDEFAMATORY, DEROGATORY OR ADULT-ORIENTED MATERIAL, OR MATERIAL THATSOME INDIVIDUALS MAY DEEM OFFENSIVE OR OBJECTIONABLE. TO THE FULLESTEXTENT ALLOWED BY LAW, FORCE FIELD DISCLAIMS ALL WARRANTIES, WHETHEREXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY AND ALL IMPLIEDWARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE ORUSE.\n\n(b) FORCE FIELD IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OROFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL FORCEFIELD BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURYOR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATEDCONTENT POSTED ON THE SITE OR TRANSMITTED TO ANOTHER USER, OR ANYTRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINEOR OFFLINE.\n\n(c) THE SERVICES ARE CONTROLLED AND PROVIDED BY FORCE FIELD FROM ITSFACILITIES IN THE UNITED STATES OF AMERICA. FORCE FIELD MAKES NOREPRESENTATION THAT THE SITE OR THE SERVICES ARE APPROPRIATE ORAVAILABLE FOR USE IN OTHER LOCATIONS. IF YOU ACCESS OR USE THE SITE ORTHE SERVICES FROM OUTSIDE THE UNITED STATES, YOU DO SO VOLUNTARILY ANDARE RESPONSIBLE FOR COMPLIANCE WITH THE LAWS APPLICABLE TO YOURLOCATION.\n\nLIMITATION OF LIABILITY TO THE FULLEST EXTENT ALLOWED BY LAW\n\nTO THE FULLEST EXTENT ALLOWED BY LAW, FORCE FIELD, INCLUDING ITSOFFICERS, DIRECTORS, SHAREHOLDERS, EMPLOYEES AND AGENTS, SHALL NOT BELIABLE TO YOU FOR ANY DAMAGES OF ANY KIND, INCLUDING BUT NOT LIMITEDTO DIRECT, INDIRECT, COMPENSATORY, SPECIAL, INCIDENTAL OR CONSEQUENTIALDAMAGES ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF THE SERVICES, EVEN IF ADVISED OF THE POSSIBILITY OF SAME. YOU UNDERSTAND AND AGREETHAT FORCE FIELD CANNOT AND WILL NOT BE RESPONSIBLE FOR ANY LOSS OFYOUR USER GENERATED CONTENT OR ANY INTERRUPTIONS OF SERVICE,INCLUDING BUT NOT LIMITED TO ISP DISRUPTIONS, SOFTWARE OR HARDWAREFAILURES, OR ANY OTHER EVENT WHICH MAY RESULT IN A LOSS OF DATA OR ADISRUPTION OF SERVICE.\n\nINDEMNIFICATIONT\n\nTo the maximum extent permitted by law, you agree to defend, indemnify and hold harmless ForceField, its offers, directors, employees and agents, from and against all claims, damages, obligations,losses, liabilities, costs or debt, and expenses (including but not limited to attorney fees) arisingfrom your use of the Services, your violation of any of the Terms, your violation of any third-partyright, including without limitation any copyright, trade secret, privacy or property right, or anyclaim that your User-Generated Content caused damage to a third-party. This defense andindemnification obligation will survive this Agreement and your use of the Services.\n\nUSE OF THE SERVICES OUTSIDE OF THE UNITED STATES\n\nThe Services are controlled and operated by Force Field in the State of California, United States ofAmerica. Force Field makes no representations or warranties, either express or implied, thatServices and other materials available through the Services are appropriate, legally permissible oravailable for use in other locations. Those who choose to access the Service from other locations doso at their own risk and are responsible for compliance with all United States federal, state and locallaws.\n\nWhether or not you use the Services from a location within the United States of America, you agreeto abide by any applicable export control laws and not to transfer, by electronic transmission orotherwise, any User Generated Content, software or other materials subject to restrictions undersuch laws to a national destination prohibited by such laws, without first obtaining, and thencomplying with, any requisite government authorization. You further agree not to upload to theServices any data or software that cannot be exported without prior written governmentauthorization, including, but not limited to, certain types of encryption software.\n\nEQUITABLE REMEDIES\n\nYou acknowledge and agree that money damages would not be a sufficient remedy for any breachor threatened breach of this Agreement by you. Force Field shall be entitled to seek equitable relief,including a preliminary and final injunction and specific performance, as a remedy for any suchbreach. Such remedies shall not be the exclusive remedies for a breach by you, but shall be inaddition to all other remedies available to Force Field at law or in equity.\n\nBINDING INDIVIDUAL ARBITRATION\n\nThe term \"Dispute\" means any dispute, claim, or controversy between you and Force Fieldregarding any Games, Services or the provisions of these Terms, whether based in contract, statute, regulation, ordinance, tort (including, but not limited to, fraud, misrepresentation, fraudulentinducement, or negligence), or any other legal or equitable theory, and including the validity,enforceability or scope of this Section 18 (with the exception of the enforceability of the ClassAction Waiver clause below). Dispute is to be given the broadest possible meaning that will beenforced. If you have a Dispute with Force Field or Force Field's officers, directors, employees andagents that cannot be resolved through negotiation within the time frame described in the \"Notice ofDispute\" clause below, other than those matters listed in the Exclusions from Arbitration clause, youand Force Field agree to seek resolution of the Dispute only through binding arbitration of thatDispute in accordance with the terms of this Section 18, and not litigate any Dispute in court.Binding arbitration means that a neutral arbitrator instead of in a court by a judge or jury willresolve the Dispute.\n\nIF YOU DO NOT WISH TO BE BOUND BY THE BINDING ARBITRATION AND CLASSACTION WAIVER IN THIS SECTION 18, YOU MUST NOTIFY FORCE FIELD IN WRITINGWITHIN 30 DAYS OF THE DATE THAT YOU ACCEPT THIS AGREEMENT UNLESS ALONGER PERIOD IS REQUIRED BY APPLICABLE LAW. YOUR WRITTEN NOTIFICATIONMUST BE MAILED TO:\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands Legal@ForceFieldVR.com\n\nYOUR WRITTEN NOTIFICATION MUST INCLUDE: (1) YOUR NAME, (2) YOUR ADDRESS,AND (3) A CLEAR STATEMENT THAT YOU DO NOT WISH TO RESOLVE DISPUTES WITHFORCE FIELD THROUGH ARBITRATION.\n\nNotice of Dispute. IF YOU HAVE A DISPUTE WITH FORCE FIELD YOU MUST SENDWRITTEN NOTICE TO\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands Legal@ForceFieldVR.com\n\nTO GIVE FORCE FIELD THE OPPORTUNITY TO RESOLVE THE DISPUTE INFORMALLYTHROUGH NEGOTIATION. You agree to negotiate resolution of the Dispute in good faith for noless than 60 days after you provide notice of the Dispute. If Force Field does not resolve yourDispute within 60 days from receipt of notice of the Dispute, you or Force Field may pursue yourclaim in arbitration pursuant to the terms in this Section 19.\n\nClass Action Waiver. ANY DISPUTE RESOLUTION PROCEEDINGS, WHETHER INARBITRATION OR COURT, WILL BE CONDUCTED ONLY ON AN INDIVIDUAL BASIS AND NOT IN A CLASS OR REPRESENTATIVE ACTION OR AS A NAMED ORUNNAMED MEMBER IN A CLASS, CONSOLIDATED, REPRESENTATIVE OR PRIVATEATTORNEY GENERAL CTION, UNLESS BOTH YOU AND FORCE FIELDSPECIFICALLY AGREE TO DO SO IN WRITING FOLLOWING INITIATION OF THEARBITRATION. THIS PROVISION IS NOT APPLICABLE TO THE EXTENT SUCHWAIVER IS PROHIBITED BY LAW.\n\nInitiation of Arbitration Proceeding/Selection of Arbitrator. If you or Force Field elect toresolve your Dispute through binding arbitration, the party initiating the arbitration proceeding mayinitiate it with the American Arbitration Association (\"AAA\"), www.adr.org, or JAMS www.jamsadr.com. The terms of this Section 19 govern in the event they conflict with the rules ofthe arbitration organization selected by the parties.\n\nArbitration Procedures. Because the software and/or service provided to you by Force Fieldconcern interstate commerce, the Federal Arbitration Act (\"FAA\") governs the arbitrability of allDisputes. However, applicable federal or state law may also apply to the substance of any Disputes.For claims of less than $75,000, the AAA's Supplementary Procedures for Consumer-RelatedDisputes (\"Supplementary Procedures\") shall apply including the schedule of arbitration fees setforth in Section C-8 of the Supplementary Procedures; for claims over $75,000, the AAA'sCommercial Arbitration Rules and relevant fee schedules for non-class action proceedings shallapply. The AAA rules are available at www.adr.org or by calling 1-800-778-7879. Further, if yourclaims do not exceed $75,000 and you provided notice to and negotiated in good faith with ForceField as described above, if the arbitrator finds that you are the prevailing party in the arbitration,you will be entitled to recover reasonable attorneys' fees and costs as determined by the arbitrator,in addition to any rights to recover the same under controlling state or federal law afforded to ForceField or you. The arbitrator will make any award in writing but need not provide a statement ofreasons unless requested by a party. Such award will be binding and final, excerpt for any right ofappeal provided by the FAA, and may be entered in any court having jurisdiction over the partiesfor purposes of enforcement.\n\nLocation of Arbitration. You or Force Field may initiate arbitration in Los Angeles, California,USA.\n\nSeverability. If any clause within this Section 19 (other than the Class Action Waiver clause above)is found to be illegal or unenforceable, that clause will be severed from this Section 19, and theremainder of this Section 18 will be given full force and effect. If the Class Action Waiver clause isfound to be illegal or unenforceable, this entire Section 19 will be unenforceable, and the Disputewill be decided by a court and you and Force Field each agree to waive in that instance, to thefullest extent allowed by law, any trial by jury.\n\nSurvival. This Section 19 shall survive any termination of this Agreement.\n\nGENERAL PROVISIONS\n\nYou agree that the Services shall be deemed exclusively based in the State of California, USA, andthis Agreement shall be deemed to have been made and executed exclusively in the State ofCalifornia. Any dispute arising out of this Agreement shall be resolved in accordance with the lawsof the State of California without reference to its conflict of law provisions. You agree that anyclaim asserted in any legal proceeding by you or Force Field shall be commenced and maintained inany state or federal court located in Los Angeles County, State of California, USA, having subjectmatter jurisdiction with respect to such dispute. You and Force Field agree to submit to the personaljurisdiction of such court. The prevailing party in any such proceeding shall be entitled toreimbursement of court costs, including a reasonable attorney fee, in addition to any other remedyawarded. In the event any provision of this Agreement shall be held by a court or other tribunal ofcompetent jurisdiction to be unenforceable, such provision will be enforced to the maximum extendpermissible and the remaining portions of this Agreement shall remain in full force and effect. Youmay not transfer or assign any of your rights or obligations provided in this Agreement without theexpress prior written approval of Force Field; Force Field may assign this Agreement withoutrestriction of any kind. No failure on the part of Force Field to enforce any provision of thisAgreement shall be deemed a waiver or consent. This Agreement constitutes and contains the entireagreement and understanding between you and Force Field with respect to the subject matter hereofand supersedes any prior oral or written agreements or understandings.\n\nDIGITAL MILLENNIUM COPYRIGHT ACT NOTICE\n\nAs an online service provider, Force Field has adopted the following general policy regardingcopyright infringement in accord with the Digital Millennium Copyright Act, 17 U.S.C.  512(DMCA). The address of Force Field Designated Agent to Receive Notification of ClaimedInfringement (Designated Agent) is:\n\nForce Field BV Westerdoksdijk 421 1013AD Amsterdam, Netherlands copyright@ForceFieldVR.com\n\nFor any notice of infringement to be effective, the notice must include:\n\na. A physical or electronic signature of a person authorized to act on behalf of the intellectualproperty owner of an exclusive right that is allegedly infringed;\n\nb. A description of the copyrighted work that you claim has been infringed upon;\n\nc. A description of where the material that you claim is infringing is located on this Sites and/or inthe Games;\n\nd. Information reasonably sufficient to permit the service provider to contact the complaining party,such as address, telephone number, and, if available, an e-mail address at which the complainingparty may be contacted;\n\ne. A statement by you that you have a good-faith belief that the disputed use is not authorized by thecopyright owner, its agent, or the law; and\n\nf. A statement that the information in the notification is accurate and under penalty of perjury, thatthe complaining party is authorized to act on behalf of the owner of an exclusive right that isallegedly infringed.\n\nIt is Force Fields policy to block access to or remove content that it believes in good faith to becopyrighted material that has been illegally copied and distributed by any User or other contentprovider. If you believe that User-Generated Content or other material residing on or accessiblethrough the Site infringes a copyright, please send a notice of copyright infringement to theDesignated Agent. The notice of infringement should conform to the elements of notificationprovided in the DMCA, Section 512(c)(3), including: (i) contact information and the physical orelectronic signature of a person authorized to act on behalf of the owner of the copyright allegedlyinfringed; (ii) identification of the copyrighted work or material infringed; (iii) identification andlocation the of the content claimed to be infringing so that it may be found and verified; (iv) astatement that the complaining party has a good faith belief that the use of the content in the mannercomplained of is not authorized; and (v) a statement, made under penalty of perjury, that allinformation in the notification is accurate and that the complaining party is authorized to act onbehalf of the owner of the copyright claimed to be infringed. Once proper infringement notificationis received by the Designated Agent, Force Field will remove or disable access to the claimedinfringing User-Generated Content or other material; notify the accused infringing party that it hasremoved or disabled access to the User-Generated Content or other material; and determineappropriate measures to prevent recurrence by the accused infringing party.\n\nThe DMCA requires a service provider to give prompt notification to the accused infringing party ofthe copyright claim and that the accused User-Generated Content or other material has beenremoval or access to it has been disabled. Section 512(g). The accused infringing party may thenissue a counter notification in the form provided in the DMCA, Section 512(g)(3). In such instance,Force Field shall follow the procedures and requirements of the DMCA calling for notification tothe complaining party and timely restoration of the User-Generated Content or other materialalleged to be infringing.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ IN ITS ENTIRETY AND UNDERSTANDTHE FOREGOING AGREEMENT. I AGREE THAT BY BROWSING, INSTALLING OR USINGTHE SERVICES I AM ACKNOWLEDGING MY AGREEMENT TO BE BOUND BY THETERMS AND CONDITIONS OF THIS AGREEMENT.\n\nModified February 11, 2017\n\nThis site uses cookies including cookies from third-party services on pages with embedded content. Please read more about our privacy policy.\nACCEPT AND CONTINUE\nForce Field Entertainment\nWesterdoksdijk 421\n1013 AD Amsterdam\n020 707 68 42\ninfo@forcefieldxr.com\nForce Field Holding\nTorenlaan 9\n1261 GA Blaricum\n020 707 68 42\ninfo@forcefieldxr.com\nSocial\nFacebook\nTwitter\nLinkedIn\nInstagram\nSubscribe\nSEND\n 2019 Force Field Entertainment. All rights reserved.\nMember\nWeb by Wonderland.", "Space Required": "1.13 GB"}



["5 stars\n75%\n4 stars\n16%\n3 stars\n5%\n2 stars\n1%\n1 star\n3%", "EispfogelJul 18 at 12:47 AM\nThis is how you do a Quest Port!\n\nI loved this game on the Go, but i am not using it that much anymore and was sad, that this game wasn't available on Quest.\nWell...this is no problem anymore ^^\n\nThey updated the graphics and sound, but what's more important - this game seems to run at 72Hz at ALL times. This is so incredible buttery smooth and i haven't seen games like this before on the Quest. There is not a single stutter and i salute the devs for achieving this! This is a perfect optimization job!\n\nThis game is only 10 bucks, so you can't go wrong with it i say.\n\nYeah it is on the short side and there are only 5 environments(one more than on the Go), but you will have a great time and the Leaderboards will get you back in the game from time to time.\n\nI had a bad case of motion sickness whenever something moved in VR - this game(among some others) helped me with that! Yeah other Coasters might make you sick, but it's a different story with Coaster Combat. The Camera basically never moves and so you will have a stable forward motion without turning. This helps avoiding motion sickness and this also helps to train your brain to accept artificial movement.\n\nAfter Coaster Combat i could play Quake and Serious Sam in VR without issues -Thank's for that ^^\n\nThe Good and the Bad\n\nGood:\n- This game is a looker! Detailed environments, great lighting and shadows and everything runs at a flawless framerate without any stutter!\n- Motivating Leaderboard. It is fun to try your best and beat the score of your friends ^^ And you can always improve!\n- Just sit down and play - the game is simple, so everyone is able to play it\n- Not Motionsickness inducing! In fact - this game helps your brain to accept artifical movement faster.\n- Multiple Accounts!\n\nBad:\n- only 5 short environments :/\n- only 2 gameplay modes(easy and hard)\n- no global leaderboard - just you and your friends(which is ok, but a global leaderboard would be even better ^^\n- Weapons feel weak - there is no feedback.\n\nHelpful | 38", "phillyg2020Jul 16 at 12:03 PM\nJust like the real thing except....\n\nI live in Florida and just because Disney opened back up, there is no way I will be attending any amusement park anytime soon. This game gives a great feeling of being on a roller coaster without the long lines, sweltering heat, and you know, Covid-19.\n\nHelpful | 66", "christinamarybrownJul 16 at 12:40 PM\nPERFECTION!\n\nI was a HUGE fan of Coaster Combat on Go. It was hands down my favorite GO game ever. I have been wishing and hoping for it to come to Quest and now my wish came true! IT IS SO AWESOME on the Quest! The graphics are amazing, and two guns is amazing. THe new track is OUT OF THIS WORLD...fun. It might become my favorite over Himalayan Heights and I didn't think that was possible. THank you so much for knocking it out of the park! I am tickled PINK!\n\nHelpful | 17", "ParadiseDecayJul 18 at 5:02 AM\nBEST Roller Coaster on QUEST!\n\nQuest Gameplay with Commentary:\nhttps://www.youtube.com/watch?v=5SM9bNi7Oio\n\nMy Initial Thoughts:\nCoaster Combat was my FAVOURITE game on the Oculus GO, it's now on the Quest with BONUS tracks and it's just as good as I remembered.\nAlso probably the best Roller Coaster in VR!\n\nHad the game got a multiplayer/co-op Battlemode Feature I would have given this 5 stars, hopefully Coaster Combat 2 could have this!\n\nHelpful | 19", "JATTACKPOHLJul 29 at 7:38 AM\nFun title from the Go comes to Quest\n\nFor $10 this game is easily worth the purchase. I had this game on the Go and loved it. The Quest version takes a little getting used to, but once you get the timing of the firing rate its a blast. New track, new unlockables and duel weapons! Old and new players alike should definitely give this coaster shooter a try!\n\nHelpful | 3", "ActorDMDJul 19 at 3:41 PM\nTop Tier in Fun for Gamers ans Casuals\n\nPros: I love VR and there are few games that i can replay endlessly because the concept is done so well. That game is Coaster Combat. Its a game that shows off beautiful vr environments effortlessly while at the same time rekindles a bit of joy found in rail shooters of old like time crisis. Best of all is a roller coaster ride for the ages. Full immersion as you ride shooting random objects for score. It makes me smile, makes my wife scream, and my kids giggle (not really intended for kids). Its one of my favorite VR games both mobile and pc. Thank you for the quest port. As an arcade racing game guy I love this game.\n\nCons: Could use more levels. Your mind makes it feel like a real coaster so if you are prone to vertigo or motion sickness this may not be for you.\n\nNote: Other games you may like: pistol whip\n\nHelpful | 4", "GirstyJul 17 at 11:34 PM\nGREAT ROLLER COASTER GAME!!\n\nI was scared to try this game because of how much motion sickness I got from Epic Roller Coasters and let me just say Im hap I gave this game a shot.\n\nThis game doesnt have loops like Epic Roller Coasters, its mainly got hills and slopes with some slight turns which youd expect from a roller coaster game. What really makes it fun is the shooting element.\n\nI love how well each weapon appropriately ties into the theme of each map, from wants in a spooky mansion to pistols in a mine, the guns feels right for each map. The point system makes me want to play each map over and over again just to do better in each map than I did the previous time I played.\n\nI would love to see some DLC for this game for additional maps but outside of that I LOVE this game and recommend it to anyone whos looking for a roller coaster game.\n\nHelpful | 4", "kimbiecookieJul 21 at 12:44 PM\nFun but needs some tweaks!\n\nI love vr Roller coasters. I need the helmet in Epic Rollercoasters but the motion is different in this one so you don't need any adjustments. I think you are too busy shooting the targets that your mind doesn't focus too much on the movement. I found the motion bothered me slightly in \"ride only\" mode whereas it didn't at all in game mode.\nWarning: for those more sensitive to motion , Himalayan Heights is a bit more intense.\nGreat for first time VR coaster riders.\n\nI like how the targets are related to the theme of the game instead of just boring little targets in uh hemm.... other roller coaster games. I also love the main menu where it looks as though your at a little theme park ready to go on the rides! Such a nice touch. The rides are a good two minutes long which is just perfect. I like that you can switch tracks for a bit of a change up.\n\nThe reason I couldn't give it more stars is because the guns are very slow firing and there is no haptic feedback. The hard levels are just about impossible to get a gold medal on because of this especially on the faster coasters like Volcano, Neon, and Himalayan Heights.\n\nPlease devs put out an update for faster firing guns and some haptic feedback so its at least possible to unlock Gold Rush. Whatever it is. Is it a new coaster? Golden shooters? Even faster than hard mode? The world may never know.\n\nHelpful | 7", "MichaelSanFranciscoJul 25 at 8:17 AM\nThe Disneyland Experience On Steroids\n\nI don't like reviews that talk about frame rates, pixels, and other gobbledygook. What I want to know is if a game is fun, and why the reviewer feels that way.\n\nBottom line: this game is a blast. It's challenging enough to keep me motivated, and above all else, each time I play a level I'm having fun, and lots of it.\n\nAnd YES, this game's ride themes are similar in concept to the best rides at a a Disney park: the Haunted Mansion, Pirates of the Caribbean, The Matterhorn, Indiana Jones, and Thunder Mountain, it's all similar and dam* good!\n\nI won't repeat what others have said. Suffice it to say, I agree the graphics are superb, the game is intuitive, the challenges are just enough to keep me interested and motivated.\n\nAnd there's a big bonus, I can choose \"ride\" mode, put away the guns, and enjoy the scenery. Man, this game was well thought out.\n\nI dunno who designed this game, but he, she, or they deserve to be awarded 24kt solid gold medals. The final design of this game evidences the Devs care about us and strived to put smiles on our faces.\n\nI guess people are polling which is their favorite coaster experience. I love em all, but if I had to pick, it would be the Disney style haunted mansion challenge. In fact, after having rode Disneyland's Haunted Mansion ride perhaps 150 times over the years I can attest this coaster ride is the same as mounting guns on the Disney Haunted Mansion cars.\n\nGet this game guys, you will love it.\n\nBonus Tips & Warning\n\n- Your aim does not have to be precise. Shoot quickly and in the general direction, you will score hits.\n\n- Machine gun: what works for me is to always be pulling my controller triggers as if shooting a machine gun. IMO that's the only way I'm to gonna win the levels. When in game I'm pulling the triggers as fast as my fingers are able.\n\n- Shoot \"targets\" on the horizon, NOT directly in front of your coaster car. (You can't react or shoot fast enough if all your shots are concentrated on closer targets. Additionally, this horizon technique gives you a second chance to hit objects you missed.)\n\n- When shooting don't worry about your overall score, nor misses. Stay focused on each target. Hitting each target is the goal, not thinking about how you are doing overall.\n\nYou'll win gold medals if you concentrate on developing then maintaining a firing technique that works for you.\n\n- Be patient and think positive. Don't get discouraged. Yeah, ten-year-olds are going to finish this game in one hour. But who cares; all that matters is that YOU are having fun.\n\nNote: The game is NOT designed to be difficult to win gold medals. But it's enough of a challenge to keep you interested, motivated, and entertained.\nMoreover, you feel a sense of accomplishment each time you medal.\n\nWARNING - MOTION SICKNESS\n\nYes, like other ride, race, boating (kayak) or heavy motion games, this game too may cause you motion sickness.\n\nYouTube has lots of videos on how to fix your VR motion sickness problem. What works for me:\n\nI take a motion sickness pill (CVS; Walgreens),\n\nI place Sea Band brand motion sickness bands on my wrists. (CVS; Walgreens).\n\nI eat Trader Joes \"Ginger Chew\" candies., which has long been recognized as a natural treatment to PREVENT motion sickness.\n\nI have a small fan blowing on me.\n\nMy pre-game regimen = end of my sea sickness problem.\n\nHelpful | 3", "DiscoDavey15 days ago\nGood but needs tweaks\n\nHaving owned epic rollercoaster I was looking forward to this game as I really enjoyed the shooting option in Epic. It didn't disappoint and speed and variety of tracks are great. Shooting is accurate and I like the easy and hard options on each track and yes they do make a difference to gameplay. This game however needs a few minor tweaks to really elevate it.\n1. The weapons need to sound stronger and louder ie. When I'm firing the guns on the pirate level they need to sound powerful and certainly louder than they currently do so it feels more satisfying. Maybe even some vibration from the controller each time too. It could be part of an option menu for people. I have pistol whip and the feel of the gunshot is really engaging.\n2. I love the little in game moments like trying to shoot the \"bad guys\" whilst on track and would be great to have other little moments such as hitting a target to drop a trap to hit them or a bomb to hit to explode a part of the track.\n3. The sensation of speed could be increased by having some sound or vibration from the cart or track as you glide along. Maybe a \"clicking\" feeling which increases as you speed up just like a real roller coaster as it travels over its metal or wooden track.\n\nI really look forward to any improvements made and additional tracks would of course be welcomed.\n\nOverall well done developers and I can certainly recommend this as I feel the price for what you get is spot on\nThank you\n\nHelpful | 6", "darwins.lastJul 18 at 5:04 PM\nAwesome Game - No Nausea\n\nPeople who play this will be surprised... Graphics are exceptional. New coaster track everytime. Music great. Shooting dynamics are awesome. This is a great game and DEFINITELY worth the money. Thanks devs!\n\nHelpful | 7", "EdmCaper22 days ago\nBest roller coaster so far\n\nThis is definitely a fun ride. When the kids play we put a fan in front of them to make it feel more real. Even adjusting the speeds of the fan with a remote based on if they are going fast or slow on the coaster. Was kind of hoping there would be some water in with some splashes so we could use a mist spray along with the fan, but beggars can't be choosers.\nI agree with the review from kimbiecookie... The guns have some lag between firing them so it makes it quite difficult to shoot all the targets in hard mode. It quite frustrating in some of the faster coasters like neon. Neon is just hard in general to get a gold in hard mode . But faster guns would help. It took a lot of determination and about two hours to get the 10 medals I needed to unlock gold rush. I don't want to add spoilers to what it unlocks, but will say that once you do unlock it, it gives incentives to play gold rush, and rewards consistent high scores.\nCertainly well worth the low cost .\nEdit: now that I logged many hours into this, I still love it for what it is. Kids love it and great for company. I'm up to about 29 wins in gold rush, and still going. I've unlocked everything and still enjoy just making my gold streak go longer . But definitely with more practice now, I don't find it hard to get a gold medal on any rides, which contradicts my first review. Still 5 stars and still love it for what it is. Would love to see some more tracks .\n\nHelpful | 2", "sh0ck3r3419 days ago\nReally like it\n\nJust wanna say I know alot of people tend to get motion sick on vr coasters I don't but for others that have come and tried this game u will not feel motion sick the developers have done a great job  I must say I enjoy it and hope you guys make more tracks like a dlc pack I will definitely purchase besides that this works flawless.. hopefully we can see online multiplayer combat that would be great...keep up the good work and get us more tracks hopefully some high steep hills\n\nHelpful | 0", "xwil1984Jul 17 at 4:02 PM\nThe game is AWESOME, but...\n\nThe Go version of Coaster Combat is amazing, I love the fact that somehow, it is the only coaster game that don't get me sick and even my score is in the Top 10, which will give you an idea how much I like it. Since the first second I realized the Quest version was available, I bought it immediately and loved it, the new futuristic ride was so cool... Overall the riding experience is amazing, but the only problem, after playing that much the Go version that I noticed immediately was the new and slow firing speed. It takes so long to fire the guns when you are playing, and this is a big deal, please allows to have the option somewhere to use the same firing speed as in the Go version in both controllers, that would give this game the awesomeness it deserves.\n\nHelpful | 3", "argarcia86Jul 20 at 7:51 PM\nFun, cheap, polished graphics\n\nVery nice quality game, seems very smooth on the quest, my son has autism and he loves the game so much! Think about how much we spend at the fair, this is 10 bucks for unlimited coaster rides... Ty creators!\n\nHelpful | 3", "Rollplayer25 days ago\nReally good\n\nIts super enjoyable and great to show to new people who havent tried VR, not bad motion sickness for an amazing experience. The but is the music is super weak and quiet, would be nice to have a proper soundtrack, its just quiet cinematic orchestra in the far off distance, which doesnt add to the excitement the main but for me is the weapons having 0 haptic feedback so its like shooting a water pistol, theres no oomf to it at all.\n\nHelpful | 0", "ANGERSNIPER21 days ago\nNausea free!\n\nExact opposite of Epic Rollercoaster. No dizzyness, just high speed coaster fun. Could benefit from more coaster rides but the fact the routes change makes each ride unique.\nNew benchmark for coaster games.\n\nUpdate: Completed all the game has to offer and would welcome more content (tracks, weapons etc) even if it was paid.\n\nDevs is there away to turn off the music for a more realistic ride? I cant find it. Seems a basic feature to leave out.\nAnyway..... Heaps of fun\n\nHelpful | 0", "Tigerlilly34611 days ago\nGreat Game!\n\nThis is one of the best VR games with realistic feeling of actually being on a roller coaster. Not sure why some complain. For the price this is great!\n\nHelpful | 0", "TotidoJul 16 at 6:40 PM\nGlad to see this on Quest\n\nOne of my favorite games for Go. Graphics seem better and tracks longer but that may because I havent played it in a while. Great game to pick up for short sessions trying to beat your previous score.\n\nHelpful | 1", "MooeymoomooJul 17 at 5:33 AM\nLove it!\n\nLoved this game on GO so am really happy to see it come to QUEST. I think it's a bargain price and love the extras that you don't get on GO. Buy it, I don't think you'll be disappointed.\n\nHelpful | 2", "Deek_Lasner42A day ago\nExcellent Game !\n\nGreat Game ! Very addictive and great price. Highly recommended!\n\nHelpful | 0", "GameHoppingJul 18 at 10:48 AM\nInstant purchase\n\nPlayed this on a Oculus Rift and it is just as good here. Really good port of a great game at a great price. Lots of fun.\n\nHelpful | 3", "hightechfoolJul 18 at 8:34 PM\nPretty fun.. but limited\n\nI was expecting a little more for $9.99. The courses are beautiful and fun, and it definitely makes it fun to shoot stuff during the coasters! HARD mode is just the same thing, just with more pain in the trigger fingers.... and I feel like they could have done real multiplayer somehow. Oh well...pretty good!\n\nHelpful | 0", "Beachjim482 days ago\nBelly tickling, nonstop fun!\n\nI had this on the Oculus Go. Much improved on the Quest.\n\nHelpful | 0", "SojoAm19 days ago\nBest\n\nI dont usually like these but Im hooked. I have to play everyday. Himalaya is really scary and the neon one really fast . Live it.\n\nHelpful | 0", "SHARKY290Jul 20 at 4:30 PM\nLEGENDARY\n\nYou must get this game! It was hours of fun to me and for its price, its a DEFINITE STEAL. A must have for all questers!\n\nHelpful | 2", "agameoftwo13 days ago\nBoring and redundant\n\nYou get about 5 tracks here and they all seem to follow the same formula. This is lazy. Smooth gameplay, but not much going on.\n\nHaunted house? Nothing inside it. What's the point of having a haunted house ride and have absolutely no scenery or anything \"scary\"?\n\nThis should be $3.99 tops.\n\nI think everyone is rating this high because they loved the GO version.\n\nThis version can GO $*%# itself.\n\nHelpful | 1", "Fran_Apa29Jul 16 at 3:54 PM\nBEST ROLLERCOASTER GAME ON OCULUS QUEST\n\nThis game is one of the best games of rollercoaster on Oculus I LOVE IT\n\nHelpful | 3", "Marx894121 days ago\nIts cool\n\nAs a roller coaster geek, I find this not bad, maybe a major update for rides with loops, dunno\n\nHelpful | 0", "AHCULUSJul 18 at 11:21 AM\nfantastic a must have on quest\n\nfantastic game. a must have on quest. love the new 1st level and the speed of it, amazing. my 10 year old wouldn't get off it. lol.\n\nand the price point is BANG ON, thanks devs.\n\nHelpful | 1", "bad_hair_dayJul 26 at 1:35 AM\nPlease add haptic feeback :)\n\nGreat fun, would buy more tracks.\n\nHelpful | 6", "idrankthekitchen16 days ago\nYes\n\nIts good\n\nHelpful | 1", "Gilagassi1Jul 18 at 8:21 AM\n\nA great 3d vr experience\n\nHelpful | 2", "nishruu2Jul 23 at 8:23 PM\nride a coaster\n\neasy sitting fun\n\nHelpful | 0", "Shedstar11114 days ago\nPleasantly surprised!\n\nI was lucky enough to get 8 store credit recently and browsed for days wondering what to get with it. I'm not a huge VR roller-coaster fan but at such a good price I figured I'd give this a go. Within two minutes I was on a coaster grinning from ear to ear. It's so much fun and the graphics and choices of coasters are fantastic. I especially loved the neon one and spooky castle. No motion sickness atall. Also with there being different difficulty levels you can progress. 5 stars from me! Thanks for making my store credit worth it :)\n\nHelpful | 2", "TAZ202012 days ago\nA real Gem!!\n\nThis is such an enjoyable game. All other VR coasters have given me a small degree of motion sickness which always marred the experience. But this game is awesome!!! After playing for half an hour, I still couldnt wipe the grin off my face. Not the slight trace of motion sickness. It is super smooth with no stuttering, and the most gorgeous graphics. This is right up there with my favorite all time VR games/experiences. Thanks to the Devs for a awesome game!!\n\nHelpful | 1", "QuinnDarko23 days ago\nBest Quest Game\n\nDont overlook this game people. I wish there were more levels (come on devs add the ability to buy more tracks), but aside from that its the most fun Ive had on my Quest in a long time. Specifically the Mountain/high intensity track, its incredible. Great work and excellent purchase!\n\nHelpful | 1", "SpookySpirits4 days ago\nBeautiful, but lacks immersive settings.\n\nI'm a VR coaster collector. The shooting is fun but I enjoy the rides more than anything. I can't seem to find a setting that locks my point of view to the cart/track. You just kind of float above it while the cart has all the fun. Maybe I'm missing something? If not... feature request ;)\n\nHelpful | 0", "Lachie_DanielJul 21 at 6:20 AM\nNo motion sickness at all!\n\nHaving previously experienced epic roller coasters I was very skeptical about this one, but trust me this game didnt make me feel uneasy at all! This game is so fun and do yourself a favour and get it asap.\n\nHelpful | 1", "Silicon_NationJul 18 at 4:04 AM\nRoller coaster and shooter mix\n\nThis is a fun game. Good graphics mixed with a fun new good idea. Worth the price. Shoot targets for score while riding fun roller coasters.\n\nHelpful | 0", "Wildcard999Jul 21 at 7:13 AM\nVery fun game\n\nThis game is awesome and I highly recommend it for anyway who loves roller coasters.\n\nHelpful | 1", "papabear_the_old23 days ago\nBest coaster game. PERIOD.\n\nWhat the title says!\n\nHelpful | 0"]