{"App Title": "Color Space", "App description": "Coloring books are a timeless, easy way for adults and kids to have fun making art. But what if you could step into the coloring book? In Color Space you dont just color in a scene  you color inside a scene.\nEquipped with a palette and a coloring wand, youre transported into any of 16 beautiful black-and-white worlds. You fill in the world with as many colors as you like, one tree, rock and flower at a time.\nAs you color, the scene comes to life around you. Rivers run, birds fly, planets revolve, meteors shine. The soundscape responds hypnotically as you color.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Art/Creativity, Casual, Relaxation/Meditation", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico), Spanish (Spain)", "Version": "1.2.1", "Developer": "Lighthaus Inc.", "Publisher": "Lighthaus Inc.", "Website": "https://www.lighthaus.us/", "Release Date": "March 19, 2020", "Developer Privacy Policy": "None", "Developer Terms of Service": "Home\n \nAbout\n \nOur Work\n \nPress\n \nTeam\n \nContact\n \nJobs\nHome\n \nAbout\n \nOur Work\n \nPress\n \nTeam\n \nContact\n \nJobs\n\n\nA new reality for education\nEXPLORE\n\n\nVirtual reality learning\nAward-winning worlds\n\nBuilt with both beauty and scientific rigor in mind, our award-winning virtual learning worlds are among the most advanced in the industry. With honors from the National Science Foundation and the U.S. Department of Education, we've had our learning environments validated at the highest levels.\n\n \nImmersive interactions\n\nAll of our environments are fully immersive and filled with hands-based interactions. Learners can travel anywhere, scan anything, take photos and video, collect and use molecules, perform surgery with scalpels, and more.Action and experimentation are the keys to virtual learning.\n\n \nAuthentic assessment\n\nCould you ever look forward to a test? With VR, our students demonstrate their learning by doing it: they do actual CPR compressions, get cells to produce energy, or perform surgeries. Those assessments are captured for instructor review and analysis.\n\n\"There should be a version of this for every education lesson and job training program out there.\"\n- Mark Zuckerberg, Facebook CEO, about our virtual heart experience\n\nVideo of Zuckerberg's keynote at Oculus Connect 2017, showing our Stanford Virtual Heart\n\nOur Work\nVR CPR\nAmerican Heart Association\n\nWe worked with the AHA to develop a CPR training experience that teaches core CPR skills.  In one of the largest studies of VR-based CPR training, students showed substantial improvement and said it was incredibly realistic and engaging. \n\nThe Stanford Virtual Heart\nBreaking new ground in medical education\n\nThe virtual heart beats, blood pumps, and allows medical trainees to perform surgical repairs to correct congenital defects. The Stanford Virtual Heart was developed with support from Oculus VR and Stanford School of Medicine.\n\nLifeCraft VR\nEntering a new dimension of science\n\nOur LifeCraft cell biology application was one of five finalists -- of 250 applications, in the U.S. Department of Education's EdSim Challenge. Students learn about cells by taking control of their microscopic machinery.\n\nColor Space: The First Virtual Reality Coloring Book\nPress\nOur Team\nDavid Sarno, CEO and founder\n\nDavid founded Lighthaus in 2013. He is a lecturer at the Stanford School of Medicine, and covered technology for 7 years at the Los Angeles Times. A recipient of the John S. Knight Journalism fellowship at Stanford, David has a degree in computer science from Yale, and a degree in fiction writing from the University of Iowa.\n\nDavid Axelrod MD, lead medical consultant\n\nDr. Axelrod is a pediatric cardiologist at Lucile Packard Children's Hospital Stanford, and co-creator of the Stanford Virtual Heart. He specializes in the care of children with critical cardiac disease from acquired and congenital heart disease.\n\nSabina Kugel, chief designer\n\nSabina is a user experience designer with a background in perception and cognition. She has over fifteen years of experience in designing easy-to-use interfaces. \n\nMichael Stevenson, chief VR engineer\n\nMichael is a veteran Unity developer with specialties in virtual reality and natural motion interfaces. He has extensive experience building VR for education, science and medicine.\n\nAndrew Coggeshall, technical art director\n\nAndrew is an award-winning 3D artist and animator who specializes in high quality visuals for interactive and VR experiences.\n\nBen Barefield, head learning engineer\n\nBen is the head learning engineer at Lighthaus. He specializes in designing and building STEM learning simulations, with a focus on biology and chemistry. Ben previously led learning engineering at Smart Sparrow, an award-winning, Gates Foundation-supported education technology company.\n\nContact us\n\nLet us know if you're interested in creating virtual reality education.\n\nName *\n First Name\n Last Name\nEmail Address *\nPhone Number\nMessage\n\n 202o Lighthaus Inc.", "Space Required": "1.39 GB"}



["5 stars\n63%\n4 stars\n25%\n3 stars\n7%\n2 stars\n2%\n1 star\n3%", "BexoloMay 13 at 4:51 PM\nThis would be awesome if...\n\nI love the idea of this game! It would be next level, relaxing, & visually incredible, if there were just more colouring books available and some really minor tweaks.\n\nI finished all of the content within about an hour or so, and I havent seen any new pages added in o the game since. I have owned the game for about a month, and I keep checking back to see if there are any updates but its a bit slow. Devs, just so you know, I would actually consider paying for colouring books on a rolling subscription basis if there were plenty of books available to buy!\n\nIn addition to that, someone raised an awesome idea in another review I read, and thats the utilisation of VR. All the colouring scenes are always in front of you - but does it have to be? Could we colour the world around us (but in such a way that we can still play this sat down?) That would be so awesome and would bring this game to the next level.\n\nIf the devs and artists added lots more content, DLC, or even subscriptions, or the 360 degree colouring functionality, I promise to edit my review to 5 stars because this game would deserve it.\n\nThanks for reading, I hope you can consider some of the points above.\n\nHelpful | 175\nDeveloper ResponseMay 29 at 8:26 AM\n\nHi Bexolo -- thanks for your thoughtful review -- and good news! We just updated Color Space with 3 of our best new scenes yet -- all new worlds, original music and new coloring tools for users (eyedropper, undo, redo). Please give it a try and see what you think!", "Roxtar733 days ago\nA VR coloring book!\n\nIf you enjoy coloring apps on your smart device or coloring books in real life this game is a treat. 360 degrees of coloring space. There are several Books each with several scenes, around three per book.\n\nPros: easy to use, varied selection of scenes, basic and advanced pallets, simple user interface.\n\nCons: limited number of scenes, overly simplistic at times, no fine detail controls, no ability to save versions of colored scenes.\n\nThis is a great VR app for children and to\nintroduce older grandparents to\n\nHelpful | 1", "Catparty6 days ago\nCalm, Relaxing, and Colourful\n\nLove this game. It is very calming and relaxing. Comes with a plethora of colours to choose from including black, white and various grey shades. Can use the colour palette to create your own colours. Love this feature! There is also an eye dropper that allows you to copy one colour to another item in the page. Super handy feature, use it all the time. The pages are super cool the way they come to life. Only negative is that there are not enough free colouring pages. Needs more pages to colour. There arent really all that many. If there were a whole lot of additional free colouring pages added I would give it 5 stars. Love the nature scenes with the animals and flowers.\n\nHelpful | 0\nDeveloper Response6 days ago\n\nThanks for your review, we're glad you enjoy Color Space -- stay tuned, we've got more pages coming!", "AnthonypbJul 10 at 11:01 AM\nBeautiful Escape!\n\nWith the stress of everything going on this is a wonderful escape from reality. Beating able to paint the environment youre surrounded by and watching it come alive is breath taking! Absolutely love this!!! The reason its a 4 instead of 5 is because I would love to be able to interact with the environment more, whether it be moving around the painting or being able to walk through a door you just painted to open a new scene inside of the tree or house to paint. Those would be absolutely perfect additions. But even the way its stands right now is such a wonderful escape. Great work and thank you for an alternate reality!\n\nHelpful | 6", "Connacemox10 days ago\nRelaxing\n\nWhen I need to take a break from all the shooting and intense games, this is the place I go to.\nI like to sit on the couch observing all the little sounds and just relax while colouring my world and seeing it come to life as I go.\n\nIt is just a shame that there are not enough worlds to colour. Would love to see more, so I am hoping for an update.\n\nHelpful | 0\nDeveloper Response9 days ago\n\nThanks for your feedback -- stay tuned, more worlds to come!", "Mattplus096 days ago\nDone Buying Quest Software!\n\nThis is a nice way to just chill in VR! However...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 0", "FrozztasticJun 4 at 8:07 PM\n4, will be 5 if...\n\nThe only complaint I have is the inability to save/start a new image. We have a family of 4 and one of the children did every one of the books in a single session. Not wanting to ruin her work, none of us have touched it since. Not even her, except for the 20 minutes it took her to color all the new books in the latest update.\n\nGreat app, but it has no reason to ever load it after about an hour.\n\nHelpful | 24", "Zack-de-la-rocha21 days ago\nfine tuned beauty. add advanced scenes.\n\nthis is a great game for kids. for 5 stars i would want ths following:. 360 world to colour, not just in front. and secondly but most importantly for adults, some added complexity/ability to colour details. make a very detailed scene please. where we can zoom in and colour thousands of small parts, much like in adult colouring books. fod example in thr city scene i was really left wanting to colour the trees green on top of the buildings but not have the entore building turn green as a block. like let us colour each individual tiny square and section. you coul add advanced colouring dlcs or optimally add a few to the game with more dlcs. Very simplistic yet fine tuned beauty. this game is mint, i just wwnt more of it and complex scenes for adults (or anyone) who likes details. its beautiful but i was excpecting to be able to colour in more detailed blocks.\n\nHelpful | 5", "bash2135Jul 6 at 1:10 AM\nLove this game +an idea\n\nThis game is amazing to play and, just to look at art done by friends or family it is amazing right now but i think if they added a way for people to make their own creations like beat saber did it would be so cool to have more scenes to color in with little effort to the developers once they made the community feature but anyway this game is great totally worth 10 dollars and I hope to see more coloring scenes in the future.\n\nHelpful | 4", "eileen.barlia21 days ago\nPretty good..... but\n\nI like the app. But it would be really great if I could use a paint brush to create shadings and more detail. Is there an option to save or share my creations?\n\nHelpful | 2", "steveortega16 days ago\nSo far, so  cool\n\nI enjoy it so far. I may be talking too soon here, but I noticed that the pictures are not 360 around. Only the front. It would be nice to color objects in front , sides , behind and some details above. But this isn't a negative review.\n\nHelpful | 0", "preston.luberMay 29 at 9:19 AM\nMakes you feel a little like God\n\nCreate your own pulsating, relaxing and to some extent emotional world as you color in 360 VR. The scenes are beautiful, the colors vibrant and things become animated as your use your pallette.\n\nI especially like the Patterns Book that puts you on a little island floating in space while before you is this massive shape waiting for you to bring it to life.\n\nI am looking forward to more scenes to color as I have gone through all of the scenes twice so far.\n\nUPDATE: I just saw the new scenes! WOW!!! Lots of interactive things going on. Looking forward to more of the same. Whether you update again for free or if you offer as \"in app purchasing\" I am all in!\n\nHighly recommended. Fun and relaxing.\n\nHelpful | 8", "ansonort3 days ago\nCan we have a little more?\n\nAs far as it goes this VR experience is good. But it could be so much better. Filling in blocks of colours begins to pall after a while. How about a painting by numbers option? Or a choice of brush?\n\nHelpful | 1\nDeveloper Response14 hours ago\n\nHi there, these are both really good suggestions. Stay tuned for more scenes soon!", "jfly201525 days ago\nFun\n\nI would like to see smaller pieces to color instead of big pieces, other than that my 10 yr old loves it. Maybe add a 360 world to color.\n\nHelpful | 1", "oiseeMay 31 at 1:38 AM\nEvolving :)\n\nVery immersive experience :)\n\nAnd the best part, is that developers keep evolving the app - I have just read the review with such request, and boom! Next day this amazing update :)\n\nTnx goes to developers for such a beautiful app, and for listening the audience :)\n\nHelpful | 5", "NighthagJul 12 at 1:41 PM\nAlmost there\n\nFun game great idea. It needs way more coloring books. The ability to save pages completed would be awesome too\n\nHelpful | 2", "bobbyalcottMar 20 at 5:10 AM\nABSOLUTELY needed right now\n\nNo way the devs could have known how important something as simple as a coloring book could be  but cheers to them.\nGreat implementation, for sure.\n(Would love the option of a silver grey color, you know? Hard to point at a street or sidewalk and make it purple; it would be more satisfying to just a few more color options, please :-)\n\nHelpful | 176", "skigglettMay 22 at 9:35 PM\nSo I love this.. but its disappointing!\n\nOnly thing is I wish it had more pages to do.. I went thru the whole thing in about an hour.. it was super disappointing... I feel like they should have a way to download new pages and remove others.. Id even pay a little extra for the option to have more pages more often.. cause even if they update weekly it feel like a waste of money ya know.. its like when u buy\na video game and beat it in a day... well what now.. lol and maybe have an option to change the music.. but it is a lot of fun\n\nHelpful | 3\nDeveloper ResponseMay 23 at 4:21 AM\n\nThank you! Tune in next week for a new book of scenes, we think you'll like it!", "KenondpMay 28 at 6:01 PM\nMy go to show off app\n\nHuge update covers nearly all needed/wanted features for me anyway, with all the great apps i have installed i like to show off this one 1st. Hoping for further books to color in future updates when devs get a chance & thank you for the long lasting experience. Cheers\n\nHelpful | 4\nDeveloper ResponseMay 28 at 6:11 PM\n\nThanks so much, we're glad you like it!", "whiteravon90Jun 27 at 8:21 AM\nSuper cool app!\n\nI love this app. It's so nice to just sit back after a long day and just color and literally watch it come to life. The music is peaceful. I can just sit and watch it all day. Great job guys!!\n\nHelpful | 2", "DroculahJun 11 at 6:53 PM\nRelaxing, and Fun\n\nThis a great one. Nice when you want to take a break from more active apps, just sit back, and be creative. I'm glad the devs seem to be updating this with more features and content. So far so good, and I look forward to more content, and more features.\n\nOne bug though, was that I colored the first welcome scene. And then after the update, I re-took the tutorial to see what the new features were. It took me back to the welcome scene, and erased what I'd done.\n\nEdit: Thanks for the comment, dev, that makes sense.\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:46 AM\n\nThanks for playing and for the welcome feedback. Yes sorry about the welcome scene -- we changed a lot on it so the save files had to be reset in the process. We hope your second pass came out as good as or better than the first.", "KnivacJun 19 at 3:02 PM\nLove it!\n\nI finished all of my books within a week. Would love more. This is so relaxing and fun. I love the music, too. Keep the books coming! It would be nice if a book a week. But I'm probably dreaming.\n\nHelpful | 2", "matt.jensen.549Mar 19 at 10:58 PM\nIt really is relaxing\n\nThe coloring \"pages\" in this app are really beautiful and fun. Having subtle animations on the pages really add to the experience.\n\nMy favorite parts are when you discover hidden sections that allow you to color more.\n\nMy only critiques are the need for an optional expanded (advanced) color palette. Such as the ability to select more hues, saturation, and value.\n\nIt'd be awesome to see the ability to create gradients. Or even some basic textures (cross hatching, halftone patterns, etc).\n\nI would highly recommend this!\n\nHelpful | 40", "Wicked_WombleMar 21 at 9:21 AM\nA good start\n\nFor me, some basic colours are missing, black and grey for example -unless I can't see them.....\nAlso, it would be nice to be able to paint a blank canvas instead of just filling in parts of a picture.\n\nI'm looking forward to updates with new images to paint in the future.\n\nKeep up the good work..\n\nHelpful | 24\nDeveloper ResponseMar 25 at 2:47 PM\n\nDear Wicked -- we totally agree with your suggestion, and made it happen! We just released a new build with and \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We have more scenes on the way, too, but it'll take a couple weeks. Thanks!", "jamseazMay 27 at 8:31 PM\nVisually striking and very easy to play\n\nThis game is a fun way to wind down. Straightforward coloring activity where you pick a color from a pallet, point where you want to color, and squeeze the controller. Some whimsical animations appear throughout. The game would be better if there were more books. Additionally, theres no coloring outside the lines. Basically each object you select can be one single color. It would be a better game if the pieces were smaller and allowed for more creativity. It was worth the $7 I spent on it.\n\nHelpful | 0\nDeveloper ResponseMay 28 at 6:12 PM\n\nThank you James! Check out the new scenes we uploaded today, they're some of our best yet, lots more areas to fill and plenty of other new features. We hope you like 'em -- color on!", "LordoftheRingMay 26 at 8:38 PM\nI'm on the fence on this one (not sure)\n\nThis is a great concept, and I did enjoy it. But like others have said, there are only about 12 scenes to color. I got through them in less than an hour. I did find it relaxing, and was trying to gage if I'd want to do this gain. The answer was \"yes\" if there were an unlimited (or larger) number of scenes to color, or if I knew it would be updated regularly.\n\nThere was one scene where I painted a planet. Up in the sky was some sort of space docking station. A little later I opened up another scene, and it was that station, looking down at the planet! I thought his was a cool feature. It would have been nice, though, if the scene below had kept my colors.\n\nWhat I really liked where the big mural-type images at the end. These seemed to give me more flexibility in where I put the colors. However, I found I wanted to lay down for some reason. But since you are in perspective, you actually lay down and can't see the part of the screen below. It would be a nice feature to paint \"on the ceiling\" so to speak, for some scenes.\n\nOn the nature scenes, I would have liked a little more flexibility on where to put the colors. You click on spot, and sometimes more fills in than I would have hoped.\n\nStill, this was a nice app. Like others, I would have preferred if the scene \"behind\" was just as detailed as the front, but that's not a show stopper. If there were a lot more pages available, this would be a no-brainer keeper for me. But right now I feel like I purchased a demo.\n\nLike someone else mentioned, I would be willing to pay for more coloring books if they were available (like you pay $.99 per song for Beat Saber songs.) But not knowing what will be available later might push me to return mode. There's just not enough content to make it worth taking up space on my device.\n\nGranted, it is not expensive, and I get that...but I'd just like a but more meat to it.\n\nUpdate: Developer said new scenes were coming in a few days! I wonder if the updates will be regular?\n\nHelpful | 0\nDeveloper ResponseMay 26 at 7:29 PM\n\nThank you for the feedback. Wait two days and youll a new package of pretty awesome new scenes!", "Grandpuppy1Mar 25 at 4:30 PM\nFantastic app!\n\nI am in my 50s and I really enjoy this app. My wife suffers from pain, and while in the app, she noticed how her pain diminished. The sensation of colors and environment allowed her to take her mind off of the pain. Two things I would like to see though are more pages, and other color palettes to select. The latest update (as of this writing) the dev's Incorporated grayscale as well as color saturation and density. It would also be great to offer pallettes that were in the metallics, as well as neon. Imagine coloring with an all metallic scale. Not sure how much coding it would take, but I believe that would take the coloring to a whole new level. I would definitely recommend this app for its ability to take your mind off of whatever is bothering you at the time. The soothing music is a nice touch.\n\nHelpful | 23", "vrbryan71Jun 26 at 12:21 PM\nGreat for kids!\n\nA great way for young children to be creative! I just wish there were a lot more pictures, but they are adding more all the time!\n\nHelpful | 0", "TVL1977May 29 at 12:35 AM\nZen ! Beautiful !\n\nI didn't expect alot of it, but I was really surprised about it. It's so nice to be inside a coloring scene. This is my game to get into my relax zone. Love it!\nAnd it's replay ability is endless as you can clean up every drawing and start all over again.\nAmazing to see the drawing come to life while you are putting more colors into the scene.\nThere's enough variety in scenes... But I do hope at some point we will get more drawings to paint.\nGood job!\n\nUpdate.... Although it's already 5 stars, it just keeps getting better!!!\nLove the new update. The drawings are amazing!!\nKeep up the good work devs. Keep on looking forward to more updates on this experience. This is my game to get into a full relax and enjoy every drawing again and again.\n\nHelpful | 1", "Booty_WizardJun 25 at 5:06 PM\nSick\n\nHonestly this was one of my first experiences as a VR owner and I was blown away. Super simple, easy to pick up and theres a good amount of scenes to choose from. Would highly recommend.\n\nHelpful | 0\nDeveloper ResponseJun 25 at 5:21 PM\n\nThanks for the great review, we're glad you like it and welcome to the world of VR!", "JamesVan77Jun 23 at 9:14 PM\nGreat, but want more content.\n\nLove what is here, but I need so much more. Famous locations? Disney? Kids movies? I know things like this cost, but people will pay!\n\nHelpful | 1", "GotAbductedOnceMay 26 at 12:05 AM\nQuick, replayable, relaxing\n\nMy wife and I love this one. Less commitment and creative demand than Tilt Brush; you can finish a picture/world easily in one sitting. Even when a world loads in blank, it's already got life to it, so it's pretty engaging. I think there's something like 16 different worlds to start, and re-coloring the same world with different schemes is still pretty fun. Definitely worth it.\n\nHelpful | 0", "OcuLorneMay 24 at 5:40 PM\nCreativity is awesome!\n\nI bought my Quest thinking I'd be playing rhythm and flying games, but the games that keep me coming back are games like Puzzling Places (SideQuest), Gadgeteer, and this game. Don't get me wrong, dance central is awesome, but in the future I'll be keeping an eye out for more games like this.\n\nThe 3d drawings in this game are really beautiful, and I find myself spending time in the drawings once they are 'done' and just enjoying the atmosphere. The game is making me more color aware, which will hopefully translate into IRL activities. It's a very chill experience - you just select colors and everything is done for you. I might have liked a 'use exact color' option in settings.\n\nOnly concerns are the limited number of drawings (12 as of May 2020), and no indication of completion in the selection menu. I hope they release more drawings over time.\n\nI also hope more developers consider creative titles like this - seems like there is a huge untapped market here.\n\nHelpful | 1", "Ditto2046May 29 at 3:38 AM\nMust buy for vr\n\nAbsolutely amazing watching everything come to life as you paint the world around you with so many different colours would love for more and more worlds to colour absolutely a must buy\n\nHelpful | 2", "TransJenderGalApr 15 at 5:41 AM\nPure happiness\n\nPros: So much fun and very relaxing. Great Price. Easy to pick up. Slightly animated pictures.\n\nCons: Needs more pictures to color. Way too few. Has about 13. Need at least 30 pics imho. Holidays, Sports, more nature etc.\n\nSide note: Would be awesome if they could get some older Cartoon/Comic Licenses. *Original* Tom n Jerry, Scooby Doo, He Man, Transformers, Animaniacs etc etc\n\nHelpful | 5\nDeveloper ResponseMay 20 at 8:42 PM\n\nThank you! Tune in next week for a new book of scenes, some of the best ones yet!", "COZZABATMAN2000Jun 24 at 7:31 AM\nWould not recommend\n\nIt would be an amazing game if you had the choice to be more detailed, or have more colouring books for advanced people, and more colouring books in general. But at the moment the way it is, I would recommend and would even say its crap.\n\nHelpful | 1", "ScoobyMcJinglesApr 7 at 2:00 PM\nFantastic! But...\n\nI downloaded this app for my girlfriend, as shes really big into coloring pages IRL and on her phone. She absolutely LOVES this app, the only things that are slightly aggravating are the lack of coloring pages to do ( I saw Developers comments saying they are working on adding more as I was typing this out, so not the biggest deal) and the \"group coloring\" as I call it. I understand why it colors similar objects all at once (i.e. flower petals, or Mandala images) but it would be nice to have an advanced option or a switch in settings to turn on \"individual coloring\".\nOther then that, I have nothing bad to say about this. Fantastic app, great job to the devs for this genius idea! Cant wait to see what's in store for this!\n\nHelpful | 5", "rporter08Mar 27 at 10:20 AM\nThis is my Zen.... Calming, and Relaxing\n\nI really like this. It's calming and very relaxing. I myself always appreciate constructive feedback, so here are a few ideas that I feel will bring more buyers:\n\nMore scenes.... I think I colored all of them in one night. Hopefully this isn't too difficult and you can crank out a bunch of them.\n\nMore detail separation.... In the scene with the man fishing, he has to be all one color. It would be nice to differentiate the shirt, hat, pants, etc...\n\nSomething I'm sure would be more complicated.... Move around through the scene with one joystick, and zoom in/out with the other.\n\nEither way, I really enjoy this and so does my daughter. If we keep the scenes coming, it will continue to hold my interest indefinitely.\n\nRyan...\n\nHelpful | 8", "AnalisaSATXApr 17 at 3:18 PM\nExcellent idea partially executed\n\nI love pretty much everything about this app, but for one HUGE LETDOWN:\nYoure in a 360 degree virtual world, you can color everything in the environment, which then comes to life...BUT WAIT, theres only something to color in FRONT of you.\n\nIt seems a waste of the VR immersion to leave so much landscape un-colorable.\nYes, you make all that area a certain color, but there is no picture or detail to speak of other than the scene in front of you.\n\nI hope that the developer will make scenes that are truly 360 degree coloring scenes, with detail, instead of the front facing only pictures which lend a 2-d feel to the whole thing. I would be amazed if I could color all the things around me, in a complete 360, not these front facing pics only. Then I truly would feel like Im coloring my world!\n\nIf the devs do this, having some furnished interior home or apartment scenes with views out the windows or doors would be fun to color.\n\nA great start, I really enjoy it.\n\nHelpful | 3", "SysebosApr 3 at 10:03 AM\nA Calming Experience\n\nIt's an ideal VR coloring experience for amateurs and experts of the medium! It has soothing ambience music to it and each color you place is accompanied by a soft tone. It has a code selection of colors and maps that's worth the price or even more so. A feature that would be nice to add would be an \"Undo\" function in case you misplaced a color onto another area but other than that, its a relaxing app.\n\nHelpful | 7", "hammers79Jun 25 at 5:16 PM\nGreat for stress\n\nExcellent game, when you've finished, you can walk around in what you created.\n\nAudio is excellent, very calming, well done\n\nHelpful | 0", "kelemannJun 10 at 12:50 PM\nI hope there will be more improvements.\n\nI bought it to my 8 years old child. I thought it would be fun for him for a long time, even though I got bored very quickly. So, he had enough half an hour to color all the pictures. I'm not going to write down what others have done, but the reason only I didn't ask refund is that I hope there will be a lot of new interesting features in the future.\n\nHelpful | 1", "shreksmaApr 2 at 4:24 PM\nBest app for relaxing during Coronavirus\n\nI can't believe I hesitated before buying this one. Now that New Zealand has been in lockdown for over a week, with many more weeks to go, I'm enjoying the relaxation of this game more and more. I love that there is black and the grey tones as well as the colors now. With all that's going on in the world at the moment I can't recommend this one highly enough to provide relaxation and fun. I hope there are more pictures to be added in future - it's great.\n\nHelpful | 6", "ShadyBradyAZ14 days ago\nAmazing But\n\nSo I would love to give this 5 stars.\nUnfortunately there aren't that many coloring books.\nIt would be awesome if we could upload your own images. Maybe a drawing pad or a sketch book?\nOr use pre-drawn images to build a new landscape. It could be like the color wheel but with shapes like stickers to zoom, rotate and paste.\nOther games have done this where they give you a variety of shapes and then people take those basic shapes and make Incredible images.\nMaybe have a forum for people to post and share things to color.\nI dont know if this is a letter/idea pitch or a review???\nBuy it and enjoy.\n\nHelpful | 0", "KENNYVALENTINEMay 28 at 9:33 PM\nAwesome update !\n\nPretty cool for the price... the update is very nice. Keep the books coming. Fun to go back and recolor. What could make this better? Maybe a way to turn 360? Awesome job Devs! Love it, very immersive \n\nHelpful | 1", "davidaxelrodmdMar 21 at 11:42 AM\nFantastic  a biased review\n\nMy kids (12, 10, 7) love it! I\ndo too  simple, easy, relaxing. Yes its not as intricate or technical or expansive as other coloring apps....thats the point!! Important disclosure: I am part of team Lighthaus. And proud to work with a dev group advancing science, education, and relaxation with VR.\n\nHelpful | 15", "automan25Mar 19 at 11:19 PM\nLots of Potential\n\nI really like the idea of a 3D coloring book. This app does a pretty good job of exploring the idea. It's lacking in a few key areas though. There need to be more coloring pages, probably 25 or so. They should also have an option to be more complicated where the user can color individual sections rather than so much of the experience being automated. In addition the user should be able to control the saturation and brightness on the colors so you can create some more natural colors for rocks, trees, etc.\n\nHelpful | 54\nDeveloper ResponseMar 25 at 2:57 PM\n\nThanks for your great feedback, Automan! We totally agree with all of it. In fact, we just released a new version with an \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We definitely have more scenes on the way, too, as well as scenes where there are more individual 'fills' to color. But that'll take a couple weeks. Thanks!", "JWheezyMar 28 at 10:55 AM\nHas Greys and Blacks! Long-lasting fun!!\n\nAwesome value for this title. Clear/sharp visuals with beautiful colors and animations. You work from a palette that includes a color wheel option that lets you choose from hundreds of colors including greys and blacks. You point and click the color you want and then the corresponding area in your coloring book world. Like using the bucket fill tool in paint for Microsoft Windows. The majority of detail coloring will be in the 180 degrees in front of you but it is a fully realized 360 environment with lots to color in every direction. I have spent a little over 3hrs basking in the creative glory of just 3 of the images and would eagerly do so again. So at least for me this is an incredible value, with content I wont exhaust anytime soon and its also a great one to share with loved ones.\n\nHelpful | 6", "NyfreeMay 28 at 3:50 AM\nAwesome game\n\nLike other user I finish this very quickly, its very relaxing and fun. I am waiting on new material and it would be nice to sit and do it as well.\n\nHelpful | 1\nDeveloper ResponseMay 28 at 6:11 PM\n\nCheck out the new scenes we uploaded today, they're some of our best yet -- we hope you like 'em -- color on!", "NoblePharesApr 27 at 8:16 AM\nGreat time consumer\n\nIf sometimes you just want to sit back and paint your World, then this is the game for you. When this game first came out I gave some criticism as well as suggestions in my review, within 3 days the devs responded to my review within a week they had an update addressing 2 of the 3 issues I had currently written about. So if this game is up your alley give it a go, this app has allot of room to grow and am sure the creators are going to give their users plenty of content for years to come.\n\nHelpful | 6", "DrCheeseHeadMar 26 at 6:22 PM\nGreat for older folks\n\nI needed a game that I could show my older mother in law. She wanted to try the Oculus but a lot of the games are way too involved. This one is great because all she has to do is point and click. No grabbing, no teleporting! It's exactly what I needed! If you need a quick app to show older or non tech savvy folks, download this app! It's small now but more is coming. I colored like I was shooting in gun club because I have no common sense! Fun times!!!!\n\nI did see that the developers respond to feedback and have already made changes based on feedback (unlimited colors added) since it's release yesterday. I'm glad I bought the app.\n\nHelpful | 6", "puddlediver1May 29 at 12:45 AM\nMagical\n\nSays it all. More please. Thanks devs\n\n\n\nWow, youve done it! Thank you guys\n\nHelpful | 2", "BuzzMonkeyMar 28 at 10:58 AM\nRelaxing and fun\n\nThis is a nice change to all the shooter and action games that are out for the quest. I think it's very well made for younger kids but for adults, I feel a few changes could be made.\n\n1) Add an undo button for those times you accidentally color something\n\n2) Add an eye dropper which allows the user to select a color from an object on the page that was already colored\n\n3) Make some objects zoomable such that you can color them in greater detail. These objects can have two methods of coloring. The first is just as it is now. The second provides a greater number of smaller coloring zones when zoomed in. This allows for finer control of colors across the object and once zoomed back out, the detailed coloring will be displayed. Once colored in zoom mode, it can only be revisited in zoom mode for additional coloring unless the user elects to go back to standard mode.\n\n4) For color blind people like myself, please add an option which will display the name of a color when pointed at on the palette. The color names on the infinite palette can be something like 'purple - 20%' or 'red - 80%' instead of trying to name every single color.\n\nHelpful | 3", "Eric.StormMar 31 at 4:13 PM\nIts a great experience\n\nI really like the game and the idea is really cool but it would be a lot better if you could detail the scene better . There was a pot with flowers and I wanted to color the flower green and the pot brown but the entire thing turned green so I couldnt make the pot brown.\n\nHelpful | 4\nDeveloper ResponseMar 26 at 1:51 PM\n\nThank you Eric, great feedback! We're working on upping the level of detail!", "MAN_LIKE_A_GODMar 23 at 3:42 PM\nNicely done\n\nThis is a great initial release, the visuals are uncluttered and clean and the audio is actually quite therapeutic. This combined with a simple UI makes for a great UX that a 4 year old or 70 year old can both enjoy. As others have mentioned, the content is a little limited, but I'm sure the developer will release additional books soon. There isn't the granularity that you can get with mobile phone based colouring apps, but the VR experience makes up for it. The main visuals are more 180 than 360 but the overall 360 scene provides an immersive enough experience. My 9 year old daughter tells me that they could use this in her school as part of their wellbeing sessions. Whether that is the point of the app or not, I tend to agree. Well done devs.\n\nHelpful | 5", "TheBunnyGamer18 days ago\nVery nostalgic and peaceful\n\nI like the way you can create a world exactly how you like it, even the sky, and there is a certain ring to it which I like a lot.\nThis is definitely a good experience. I feel like it'd be a lot better if there was a bit more to it!\n\nHelpful | 0", "CokeHeadApr 15 at 7:32 PM\nOld dog - new trick!\n\nThis is simply a fantastic concept.\nSuch a simple idea yet within the VR world it seems to finally be in its correct medium.\nForget paper - color your world.\nIt's also magically relaxing.\n\nThe only thing I would request from the devs are more control over the \"faces\" so you can color with more complexity. (ex. the city world, I'd like to be able to paint the windows differently than the building itself.)\n\nHelpful | 1", "kathyy07Jun 4 at 7:02 AM\nCool\n\nIts a short game , but my daughter like it\n\nHelpful | 0", "katrinaukMar 27 at 8:26 AM\nAwesome\n\nLove this idea, I noticed something cool. When you flip the colour wheel over you have lots more colour options and depending where you select from it can be pastel or deep colours (in response to the review previous to me it has plenty of black, white and grey variants too!)\n\nI would love to see in a future version bigger worlds to colour, for example a full town you can explore and take your time filling in!\n\nHelpful | 2", "Erock80May 16 at 8:28 PM\nMeditative\n\nReally enjoyed this! The music and sound effects add to the meditative experience. Great work and excited to see how it evolves with new updates.\n\nHelpful | 1\nDeveloper ResponseMay 20 at 8:22 PM\n\nThank you! Tune in next week for a new book of scenes, we think you'll like it!", "CazzyJMay 8 at 5:56 AM\nSimple and Relaxing\n\nA nice way to unwind in VR. If you like to colour in then give it a try.\n\nHelpful | 2", "Princess_NickyApr 14 at 7:41 AM\nAmazing\n\nSuch a beautiful app, very relaxing. Also, when I first started it there was some sort of glitch that made it unplayable because the bottom half was a pixelated mess. However, after reaching out to the creators, I not only learned that I could fix it by re-installing the app, but they gave me a code for a free copy so I could request a refund. The game itself is worth every penny though. I definitely recommend.\n\nHelpful | 1", "ssixxMay 18 at 10:27 AM\nneed more\n\nThis is so great to get lost in and while its nice to erase and re-color, more pictures and/or books would be very nice.\n\nHelpful | 1\nDeveloper ResponseMay 20 at 8:22 PM\n\nThank you! Tune in next week for a new book of scenes, we think you'll like it!", "LauJusticeMar 25 at 9:25 PM\nAbsolutely Amazing\n\nI wish I could share this experience with the world right now. I felt like I completely stepped out of our world and away from all of the fear and sadness and uncertainty, if only for a few minutes. It is beautifully magical. Thank you! I need about 1000 more pages though!\n\nHelpful | 3\nDeveloper ResponseMar 25 at 9:28 PM\n\nThank you for the wonderful words! We are so glad you enjoyed it. Dont worry   more scenes coming soon!", "musse477Mar 26 at 5:02 AM\nRelaxing, but a little frustrating.\n\nSuperfun concept, well-made and very pretty. I enjoy it very much but would really, really like more color options. I understand the argument for simplicity but a simple option for an \"advanced palette\" with all colors and gray-scale would make this game perfect. Also, new environments and canvases. Free would be great but reasonably priced DLC is fine with me.\n\nEDIT: They added the features!\n\nHelpful | 2", "JonnyAlt42Mar 26 at 1:18 PM\nGreat concept from a great developer\n\nWatch the trailer. If that doesn't sell you on the concept, you can move along.\n\nFor everyone else, you're getting a fantastic app that has the support of a developer intent on perfecting and expanding their game in whatever way is appropriate and feasible.\n\nI don't usually write reviews and didn't for this one. I got it on release day and would have given it a 4 based on the limited palette available. Less than a week later, and that issue has already been patched up.\n\nSo yeah. This game does not fix the world's problems, but it sure is a very nice game.\n\nHelpful | 2", "cjthomas31Apr 10 at 6:51 PM\nAbsolutely perfect for my kids\n\nI got this for my kids specifically. They are always wanting games to play and are still young enough that I want to limit the violence but still give them something they can have fun with. I tried it out myself and found, even though I am in no way a drawing type artist (not what I do to relax) at least half an hour flew right by and was fun and relaxing.\n\nThe only con that I have is there seems to be only about a dozen or so images that you can choose to start. Otherwise I absolutely love the relaxing music and it's just simple fun that both I and my kids will enjoy.\n\nHelpful | 1\nDeveloper ResponseMay 20 at 8:44 PM\n\nWe've got more scenes to color, coming next week (free). We hope you like!", "itsDavidDugganApr 2 at 10:38 AM\nA Great Escape\n\nColor Space is a beautiful, immersive escape from the more traditional, fast paced VR games. This game looks brilliant on the Quest and I haven't had any problems while playing. It's arrived at a perfect time for people who are staying indoors. I find myself coming into this game after a more fast paced game to relax and enjoy the world of Color Space. There's 13 interesting 'scenes/places' to colour in, and with every colouring in action there's a satisfying sound to go along with it. I'm looking forward to more 'scenes' to be added to the game in the future. A good value game, very fairly priced.\n\nHelpful | 1", "basspro9218Apr 9 at 6:01 PM\nPretty good\n\nEdit to my original review. Blacks and grey available now! Hopefully they keep adding new scenes and possibly the ability to create your own scenes in the future. it's a great game for the price.\n\nNice relaxing game that allows me to take a break from others that require roomscale or standing. The coloring is satisfying but after a short while you're left wanting more.\nTheres no grays, blacks or off whites. In one scene theres a wolf but the only options are a bright colored or a red/brown wolf. Theres limited scenes but the low price is why I give it 4 stars.\nIt's nice to have because hopefully future updates will add colors and more custom scenes. It's also one of the few games my wife will play so that's a bonus\n\nHelpful | 0\nDeveloper ResponseApr 10 at 10:06 AM\n\nThanks BassPro! Yes, new scenes are on the way, stay tuned!", "Witcher.IIIMar 25 at 9:23 AM\nA very friendly and replayable app\n\nAside from the fact that this is about as stress free as you can get- it's also something you can go back to over and over to repaint the world/pages. It offers a lot for the money and my entire family has played and enjoyed it and enjoys looking in on each others versions of each world. Love it.\n\nHelpful | 2", "samxrApr 7 at 2:10 AM\nAwesome but kinda inconplete\n\nIts a great fun idea, unfortunately incomplete for full satisfaction.\n\nOk so new colors and coloring scenes would be nice and I get that theyre coming.\n\nBut what about:\n\n Why cant you navigate or fly around the scene?\n\n Why is there no undo button if you accidentally color something with a click and then you have to get the old color and recolor it again?\n\n Why is there no eye dropper to pick a previously used color? Or a history palette of colors used in the scene at least?\n\n Why isnt color theory pulled into this at all? With all the free tools like Adobe Kuler it seems like a future addition should be to make your own palettes based on color theory. Overlay them on the color wheel too.\n\nThese are all what Id consider fundamental to the coloring experience. But nice to haves would include:\n\n painting with gradients or angle-incidence colors (more cool if you can fly around the scene)\n\n painting with PBR materials- like adding some metallics, plastics, textures, or iridescence to the mix.\n\n have a color spray gun where you can load different colors from your palette or allow a brightness or saturation or color hue variance as you paint. That way you could add a randomness but with intention to your painting.\n\nThe calming side of the app is on point and the music and soundfx that fit the ambient tracks as well as the paint animations are great. But getting frustrated creating your creation because of no undo or no palettes means youre taken out of your zen as you struggle with the app. The way it is, (if you use the full color wheel) you have to plan every single thing you want to paint before you switch colors. So you cant just free form it and still create a nice design.\n\nGreat app and definitely worth the money (if more coloring scenes come)! Please tell me some of the ideas I mention here are in the roadmap and Ill certainly give it more stars, otherwise it might not have long playability.\n\nHelpful | 4", "mfoistMay 8 at 5:33 PM\nGood but...\n\nI wish you could color smaller areas at once. When painting the buildings I would love to paint each window and each section differently.\n\nHelpful | 4\nDeveloper ResponseMay 29 at 8:27 AM\n\nHi Mfoist -- thanks for the review. Please have a look at the updated we just published! The three new scenes included have many more areas to fill, original music and sound effects, and new tools so you can 'eyedropper' colors already in the scene, and undo and redo coloring choices. Hope you enjoy!", "darkuniApr 7 at 7:59 PM\nGreat if you know what you're getting!\n\nWait, a coloring book in VR? How can that POSSIBLY be fun, dad?, says my 13-year old son. \"This is friggin so much more awesome than some dumb coloring book!  an exact quote. Developers, feel free to use that in the marketing materials :D A 360, 3D coloring page. You can paint the world as you want it. 100x better than coloring, he says. This is awesome. You know how hard it is to get a tween boy to sit still and make art? That alone is worth $10. This is a relaxing, engaging experience that has a broad appeal. Use it to unwind, occupy kids 8 to 80  and it will surely be mesmerizing to take to parties of VR uninitiated folks that are looking for something less intimidating and more nurturing. There are 13 scenes and they get more detailed as you go. Cross buy is a nice bonus.\n\nHelpful | 1", "bryanloMar 28 at 11:15 AM\nFun , relaxing, happy game for everyone\n\nFirst , thank you for this beautiful game.\nCan I ask for more from you .\nAble to write text message to the page .. eg Happy Birthday to my wife .\nAble to save or export the page to a file folder with file names.\neg. able to save as 360 photo to be viewed in oculus 360 photo under my photo\nAble to open or import the page from a file folder.\nAble to add or import an object or element into the page . eg. a picture of my face\nAble to create or Drawing on page , will be more fun to do .\nI hope you like these suggestions to have into this great game for everyone to enjoy more .. thank you\n\nHelpful | 1", "PrestonInGaApr 7 at 8:56 AM\nVery enjoyable and relaxing\n\nHats off to the developer(s). I admitI was very skeptical about a VR coloring app and am really impressed at how well its designed. The only thing I would want in game is more color choices.\nOutside of that, I personally think this app rocks!! Definitely surpassed my expections. Totally relaxing to me and also like how user friendly the app is. Hell, dont my word for it just try it for yourself. Remember, you can always ask for refund but I seriously doubt anyone would want to return it.\n\nHelpful | 0", "john.metzgerApr 8 at 11:47 AM\nNice app - priced well\n\nOnly suggestions are adding a true color wheel that provides better mixing and range of colors. The other is an ability to get a picture of my completed art to save. Using the picture feature in the quest is hit and miss and pretty low fidelity. An heic Live Photo would be great.\n\nHelpful | 0", "minigeekgirlApr 17 at 5:18 PM\nLove it!\n\nI adore this app. I only have one wish...either more pages! Or the ability to save and redo. I like one of my mandalas a lot but I want to start over without losing it. The music is great and Ive already recommended it to others.\n\nHelpful | 1\nDeveloper ResponseMay 20 at 8:42 PM\n\nThank you! Tune in next week for a new book of scenes, some of the best ones yet! We hope you like them!", "sinothApr 3 at 1:25 PM\nWonderful\n\nWonderfully simple experience. Nice music to match the visuals. Both myself and my daughter have enjoyed this immensely! Hopefully more scenes will come with time. Worth noting that the scenes are not just static -- things move and it feels organic. Great little escape.\n\nThe only annoyance we've encountered is some objects not being as granular as we wished. For example painting a ladybug two tones rather than one. I realize there is a fine line between chill and something fiddily and TOO detailed, but I wouldn't mind more color freedom.\n\nHelpful | 1", "aweebitmooreMar 26 at 1:01 PM\nNeat game for the price\n\nThis is neat....looking forward to letting my granddaughter play with it when she comes to visit. I was a bit disappointed it wasn't paint by number. My daughter, granddaughter and myself are all hooked on Happy Color....I like having to find and fill in all of the numbers in sequential order before you move on or sometimes change it up by filling in one area at a time. If you could incorporate that feature into this....would probably be worth double the price of this one. Still neat and good way to pass an afternoon. Good job! PS...there are lots of colors to chose from now.\n\nHelpful | 1", "BakeCatterApr 2 at 9:38 PM\nBrilliant simplicity\n\nGreat apps don't require complexity. The simple concept of a VR coloring book makes so much sense. You stand there painting the world around you. There's a great tutorial, but it's truly intuitive. Its hard not to smile. Not expensive and a lot of relaxing fun. I Highly recommend it. It's one of those apps to introduce people into VR with. A must own app.\n\nHelpful | 1", "MrsCummingsMar 21 at 7:31 AM\nNice idea, but too limited\n\nI love the idea, and the scope for images is huge, but I found the colour palette way too small, with no greys or black. And I didn't like not being able to colour separate petals, for example, instead forced to colour grouped objects decided by the devs. I enjoyed doing one picture, but can't see me using it again.\n\nHelpful | 9\nDeveloper ResponseMar 25 at 2:48 PM\n\nDear MrsCummnigs -- we loved your suggestion (which a few others agreed with), and made it happen! We just released a new build with and \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We have more scenes on the way, too, but it'll take a couple weeks. Thanks!", "supermaksJun 14 at 7:20 AM\nGood but...\n\nInteresting experience but dont enough coloring books and features.\n\nHelpful | 0", "bbarone1Mar 25 at 6:11 PM\nBeautiful concept, needs free color\n\nHey all, want to give massive credit to creating such a beautiful and delightful experience. Its really nice to be able to sit in a scene and bring it to life through color. The music and animations make the experience delightful.\n\nTo me, the experience is missing once crucial element that I thought would be part of the package when I bought it - the ability to free color or color in the shapes by hand using the pointer on the controller. To me, this is the huge draw with adult coloring books - you can lose yourself in the details of coloring for hours as a form of meditation. Do you have any plans to add this feature?\n\nHelpful | 1", "oldeltaMar 25 at 7:37 PM\nAmazing. A fun escape for now and later!\n\nThis experience is so fun! Its relaxing and rewarding to be able to watch a beautiful world of your own creation unfold before you in VR.\n\nOne of the best things about this experience is that as you color in the details of the world around you, it comes to life...birds fly, leaves blow in the wind, waterfalls flow in the distant landscape. This has great potential and can be updated regularly to include new scenes, colors and options. Its so relaxing to watch it all unfold and just escape into the pages. Needed now more than ever, I think.\n\nThanks Devs for this imaginative entry into the 2020 VR field! Keep it going!\n\nHelpful | 1", "patternsMay 9 at 6:36 PM\nVery nice\n\nEnjoyed it. Nice having things move after coloring. More things to color and more color shades would be nice.\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:23 PM\n\nThank you! Tune in next week for a new book of scenes, some of the best ones yet! And make sure to use the \"Advanced Palette\" with tons and tons of colors possible to pick from.", "Kthome123Mar 24 at 8:40 AM\nColor Space\n\nI wasnt sure if I would like this type of VR app because i am not super creative and have never really liked coloring much. After reading the reviews, I decided to try it. It was so relaxing and a great way to de-stress after work. I love the way the scene you are coloring comes alive as you color it and I found that I really enjoyed it.\n\nHelpful | 1", "ALDUWIN668May 1 at 10:49 AM\nSo calming\n\nThe music and sounds are utterly perfect plus the calming colors make this one of my favorite and most relaxing games. Needs no skill whatsoever.\n\nHelpful | 0", "Fidecaro22 days ago\nInstant relax\n\nIlwould have never thought that coloring a world would be so amazing and relaxing. I literly layed down in my room and gazed at my coloring. It is so relaxing.\n\nHelpful | 1\nDeveloper Response21 days ago\n\nThanks so much Fidecaro -- we're so glad that you found it relaxing and fun. More scenes to come soon. Enjoy!", "elisianApr 6 at 7:26 PM\nOk... not enough content\n\nId happily pay a couple of bucks for this, and I love the idea. But each of 13 art sketches takes under 5 minutes to fully color, so the total play through content is simply not enough for the price point.\n\nHelpful | 8", "teziMar 22 at 2:39 PM\nCute\n\nI found this very cute but fairly empty. Needs more content and maybe it should come to life when you finish it, otherwise you finish the picture and nothing new happens. Would be nice to feel rewarded for picture completion\n\nHelpful | 9", "iambenslaterMar 28 at 3:57 AM\nOMG\n\nUp until today, our kids lived in Beat Saber. Now we cant get them out of their virtual colouring book. An absolutely must have game. Compliments to the developers. Your obvious love of this project shines through.\n\nHelpful | 2", "scottm813Mar 25 at 6:04 PM\nNeeds more colors!\n\nBetter with the new pallet. But with so many different colors to choose from now how do I create the same exact color? There should be a way to point something to change your paintbrush to the color you used on that item. I think paint had that feature 30 years ago lol\n\nHelpful | 1", "The.Flying.LlamaMar 26 at 4:15 PM\nLove it!\n\nAmazing title. I absolutely love it.\n\nHuge thank you for the developers for increasing the colour pallette.\n\nIf there was an option to have a standard and then high colour customisation to each scene, that would really make both camps happy! Just my two cents!\n\nKeep up the great work and I hope there are many updates to follow!\n\nHelpful | 1", "patriots2832Apr 5 at 2:59 PM\nAmazing and relaxing\n\nFirst review on a game while using Oculus but had to review this one this game is awesome starts off all black and white and you arent limited to certain colors shows you a whole pallet and you can customize everything you see including the SKY!!\n\nHelpful | 0", "Maximus_PowerMar 20 at 4:00 PM\nKids love it.....and so do I\n\nIf you have kids who like coloring books then this is a must have. As an adult I don't like coloring books but still enjoy this game. It's relaxing to just sit and color with the zen like music this game has in the background. Great game devs!!!!!\n\nHelpful | 2", "aliendave51Mar 26 at 2:04 AM\nGreat app\n\nThis is a great app for relaxing Im giving it only 4stars for a couple of reasons as stated in reviews needs more colours or a way to mix colour also could do with more pages to colour\nJust had a email from developers for app saying they have added more colours and more content on way\nWell done devs you are stars and my 4 star is now a massive 5 stars\n\nHelpful | 1", "GeeksGetsMar 25 at 5:22 PM\nHonestly Relaxing!\n\nI think that this is a really relaxing and fun game that could be enjoyed by anyone of any age. I honestly can't wait until they add more coloring \"pages.\" The only thing I would ask for is more color options, maybe a grayscale/black option? Just some sort of \"advanced mode\" would be awesome. Keep up the good work!\n\nEdit: They added infinite color options! Thank you so much devs!\n\nHelpful | 1", "nelagalvez1984Mar 25 at 2:29 PM\nBeautiful and relaxing\n\nI am not a fan of the relaxing games, because I enjoy more the adrenaline ones (shooters and similar). However, this game is simply and beautiful. It is the kind of game that is cheap and enjoyable for the younger, the older and the mid-age. I am not sure yet if its books are few, but as long as they can be redrawed, it is worth it (message for the developers: please update the game in the future with new books!). The only \"but\" that I can say of the game, is that it does not allow to use the grey and black colors, but it gets colourful drawings without them.\n\nUpdate 25/03/2020: Now we have an extended palette with grey-scale and light/dark color, thanks! (Please developers, update with new books and drawings!)\n\nHelpful | 1", "future.robot.planetMar 29 at 5:59 AM\nDelightful escape\n\nThis is what I need. A calm escape, where I can be creative but not mentally draining, delighted but not over stimulated, all while being lulled by a gentle sound track.\n\nColor Space will pass a few hours... Only regret is that there isn't more via expansion packs or similar.!\n\nHelpful | 0\nDeveloper ResponseMar 29 at 11:27 AM\n\nStay tuned for more scenes -- and thanks for the review!!", "Kingston1191Mar 25 at 8:29 PM\nGreat game, hope you keep adding to it.\n\nI tried it for a little while the other night and really enjoyed it, the only thing I could think of that would make it better would be adding more colors to chose from, like the darker colors and grey. Hope you guys keep adding more content to choose from :)\n\nHelpful | 1\nDeveloper ResponseMar 25 at 9:35 PM\n\nThank you! We just released a new version with gray, black and lots of new colors. Let us know if you think its an improvement!", "prgmrgirlMar 21 at 7:03 AM\nRelaxing Experience\n\nI was pleasantly surprised by this app. It's relaxing and beautiful. My kids love it, too. Highly recommend.\n\nA few suggestions:\n\nMore coloring books!\nMore colors and textures!\nThe option for finer control\nAbility to zoom in and out\n\nHelpful | 2", "mckenna3141Apr 10 at 9:49 PM\nSimple and beautiful\n\nEasy to spend some time relaxing in this space. My kids enjoy it too.\n\nWould like to see slightly sharper graphics, and a eye dropper tool to pick up a colour Ive already used.\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:43 PM\n\nWe've got the eyedropper coming in our update next week, plus three beautiful new scenes. We hope you like them!", "CyberBlossomApr 6 at 4:18 PM\nRelaxating VR Coloring\n\nVery easy and beautiful levels that become animated when color is applied. I wish there were more pictures. There are only 13 pictures to color and that's it. Hopefully they will add more.\n\nHelpful | 1", "PlatypusFriendApr 27 at 4:52 PM\nMy 4yr old loves it\n\nIf you like coloring books, or at one point in your life liked them, you'll enjoy this well-written app.\n\nHelpful | 1", "DAX_QcMar 19 at 8:18 PM\nSuper cool but useless.\n\nFor average vr adult joe this app is useless. I gave it 3* bc it deserve it. Lacking content, colors, movements etc. I can do better arts with tilt or sculpvr.\n\nAnother app gear for children. Annoying thing. For noobs and kids i guess its a 5*.\n\nRefunded.\n\nHelpful | 6\nDeveloper ResponseMar 25 at 2:59 PM\n\nThanks for your feedback DAX_Qc! We agree there's a lot we can do to improve it. We just released a new version with an \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We definitely have more scenes on the way, too. But that'll take a couple weeks. Thanks!", "daniel-adamsMay 1 at 12:56 AM\nRelaxing visual wonder\n\nLove to have more pictures,very addictive and great for ages 3 to 100 or older\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:41 PM\n\nHa ha thanks, check out the new scenes coming next week, we're excited about them!", "Jonesy38Mar 21 at 11:46 AM\nSuper relaxing and fun\n\nI loved the experience so relaxing with amazing visuals. Definitely worth the $10. If I had one gripe with it it would be I wish the color range was wider at the very least I would want black and grays.\n\nHelpful | 2", "alysyn.harveygreenMar 27 at 2:14 PM\nWish there were more options\n\nI love coloring in this app, but there are not enough colors like a black, gray, or other shades of colors. There are also not enough pages to color. I have already colored all of them and wish I had more.\n\nHelpful | 1\nDeveloper ResponseMar 27 at 4:51 PM\n\nHi Alysyn -- thanks for your comments. Did you try to switch to the Advanced Palette? If you click the color-wheel button on the right side of the palette, it'll give you lots more choices, including blacks and grays. Give it a shot and let us know if it changes your opinion. Meanwhile, we're cooking up new scenes right now and will release them soon!", "GalaxyEntity90421 days ago\nAmazing! Don't know what else to say\n\nIve tried it for about 30 minutes and so far it's been amazing. it really helps relax you.\n\nHelpful | 0", "maikmayers8116 days ago\nBeautiful!\n\nthere will be updates?\n\nHelpful | 0\nDeveloper Response15 days ago\n\nYes, we will be continuing to add more scenes -- thanks for playing!", "ElijahHendrixMay 6 at 9:39 PM\nRelaxing fun creative.\n\nNice game so play on a rainy night.\n\nHelpful | 0", "AndreidbzMar 22 at 6:42 AM\nGood\n\nThe app is really nice. I would have loved to see more scenes, as 12 are good just for start in my opinion. Also more themes, please :)\n\nHelpful | 2", "jsivonenMar 28 at 1:08 PM\nKids love it!\n\nI immediate knew that thisll be the thing that my daughter will fall in love. And I wasnt wrong :)\n\nThis is coloring book on steroids. Immersive locations with stuff to color is relaxing to adults as well.\n\nHelpful | 1", "GaolBirdApr 18 at 7:27 PM\nBeautiful and relaxing\n\nIf you are someone who enjoy coloring this is a must. Very relaxing experience and welcome for VR demo\n\nHelpful | 0", "bananyacatMar 28 at 8:05 AM\nVery fun\n\nDuring this period of time to be able to color in a little world is the best thing ever. Thank you Devs for making this cool game!\n\nHelpful | 2", "dan.thurleyMar 21 at 1:58 AM\nPeaceful and relaxing\n\nBought this to a) stop me playing Paintball in RecRoom and b) get away from news of diseases and lockdowns in London. Its beautiful,immersive and relaxing. Even my 18 year old son enjoys it.\n\nFill in a canvas then lie back and marvel at it.\n\nHelpful | 1", "thespiralcatApr 13 at 5:24 PM\nGreat coloring fun\n\nI only wish there were more scenes to color! I LOVE the peaceful settings and how they all link together.\nPlease make more!\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:43 PM\n\nWe've got more scenes to color, coming next week (free). We hope you like!", "DoberManPin-SureJun 7 at 11:02 PM\nVery cool, but...\n\nI was about an hour into coloring when I made the mistake of asking my wife to check out my work. It's now been at least another hour and she won't give it up. Great! ;)\n\nAs someone who loved coloring as a kid and continues to love it as an adult, this is a fantastic VR escape. As someone who has a degree of color-blindness, having the palette name each color when it's being pointed at with the \"brush\" would be extremely helpful. With that additional aid, this game is a clear 10.\n\nHelpful | 0", "KnyghtJul 11 at 4:00 AM\nSimple but fun\n\nI really like how easy it is to color and it's a lot of fun to do it in vr. I just wish we could get more detailed with coloring.\n\nHelpful | 0", "conradsykesMar 29 at 11:16 AM\nFun and relaxing\n\nGreat game. Very relaxing. Only complaint I have is I wish there were more coloring pages but the fact that I'm wanting more is a good sign. Hoping the devs will release more content later.\n\nHelpful | 0\nDeveloper ResponseMar 29 at 11:26 AM\n\nThanks Conrad -- new pages in process, stay tuned!", "HothChocolateMar 21 at 8:50 PM\nBeautiful and fun.\n\nReally cool idea brought to life wonderfully. I only wish there were some additional colors on the pallet like silver and grey. It appears like you can also choose a variant of a color on your \"brush\" hand but I'm not sure how.\n\nHelpful | 1", "TrisolaransApr 11 at 7:14 AM\nSimple. Beautiful. Tranquil.\n\nIt only takes a few small steps into this beautiful app to realise you are going to want to spend a lot of time in there.\n\nHelpful | 0", "Badbloke77Mar 23 at 5:55 PM\nSo a medical education group made this\n\nBut failed to consult with kids or artists? Wonderful idea and I realize this is for meditative purposes, but such a limited color choice is more frustrating than calming. Why does the paint brush show 3 shades of the color you choose, but then not let you select any of them?\n\nHelpful | 2\nDeveloper ResponseMar 25 at 2:27 PM\n\nThanks for your feedback, Badbloke -- we listened! We just released a new build with and \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We have more scenes on the way, too, but it'll take a couple weeks. Keep calm and color on :)", "rusuryousApr 19 at 12:02 AM\nGood times\n\nI bought this for my daughter and ended up using it more. Really relaxing well done\n\nHelpful | 1", "Azazel08Mar 28 at 10:00 PM\nGreat and fun coloring book come to life\n\nMy daughter just kept saying \"this is amazing\" repeatedly while playing this. Great jobs devs! Please add multiplayer. I would love to be in the world with her as she is coloring.\n\nHelpful | 1\nDeveloper ResponseMar 29 at 5:59 PM\n\nThanks for a great review! Multiplayer would be fun, for sure~!", "BingoFuel74Apr 2 at 7:53 PM\nLook honey, pretty\n\nI'm a disabled vet that LOVES being left alone for months (sadly years) yet my lady has been soooo happy with this and I just giggle and watch her go crazy\n\nHelpful | 1", "Ashley.BonaviaMar 24 at 6:29 PM\nColors\n\nIts really cool and immersive to be in this coloring book and be able to make it your own. However, I wish there were more color selections, being able to make your colors darker/lighter, and color with black and gray as well!\n\nHelpful | 4\nDeveloper ResponseMar 25 at 2:25 PM\n\nThanks for your feedback, Ashley -- we went ahead and did what you suggested! We just released a new build with grays, black, and a near-infinite range of colors on the new advanced palette. Let us know what you think and if this influences your overall feeling about Color Space! We have more scenes on the way, too, but it'll take a couple weeks.", "ezop73Mar 21 at 11:54 AM\nAmazing\n\nThis is a fantastic colouring game, loved it ! And the interactive animation was amazing. Loved being immersed in this brilliant game !\n\nHelpful | 2", "TedMcTedfaceJun 2 at 12:31 PM\nLovely game, needs finer functionality\n\nThis is a lovely game and theyve really got the atmosphere right with it. My 11 yr old loves it as well.\n\nFamiliar theme of comments is needs more content. Thats partially true, but more crucially would be more power to add finer details. Too much of the picture gets completed when you click into a space. Perhaps this can be controlled in the settings. At the moment it does mean one gets through the content more quickly, and slightly frustrates the creativity.\n\nHelpful | 0", "Drako6187Apr 3 at 9:00 PM\nGood\n\nWife loves it because of no motion sickness but how do you not have grey for rocks or anything? Plz add\n\nHelpful | 1\nDeveloper ResponseApr 4 at 6:31 AM\n\nHi! We do have gray! you have to choose the advanced palette by clicking the big color wheel button on the right of the palette. let us know if that helps.", "bryan.dicksonApr 18 at 7:53 PM\nGreat kids game!\n\nDaughter(5 years), loves it!\n\nHelpful | 0", "Skeeva007Apr 18 at 10:52 AM\nSuper chill\n\nLove this! Very chill and relaxing! Can't recommends it enough\n\nHelpful | 0", "umut.erhanApr 4 at 11:04 AM\nGame for kids\n\nNice game for your kids. I wish there were more pages to paint. It only has 12 pages in total.\n\nHelpful | 1", "TylerilApr 1 at 2:58 PM\nVery nice\n\nA good game, fun to use and easy to pick up on. Definitely helps with stress. Would love to buy more environments to color as they come out.\n\nHelpful | 1", "mystickidApr 12 at 1:56 PM\nCharming and Simply Delightful\n\nIf you just have to vege but still need to DO something, this is the app for you.\n\nHelpful | 1", "Okami77Apr 7 at 4:37 AM\nBeatiful Colors\n\nIf you want to be chill and relax, you now what you have to buy .\n\nhttps://youtu.be/mJLTdHcG-Os\n\nHelpful | 1", "GregMadisonMar 26 at 11:07 AM\nPeace of mind\n\nIt is hard to innovate in the VR space. This experience is absolute fresh air.\n\nHelpful | 2\nDeveloper ResponseMar 26 at 1:50 PM\n\nThank you so much Greg!", "staryan1Mar 27 at 2:55 PM\nVery cool and calming\n\nThis is a really good app. No glitches and it was surprisingly relaxing.\n\nHelpful | 2", "KMarcApr 18 at 6:05 PM\nLove it!\n\nFun and relaxing. Highly recommended.\n\nHelpful | 0", "VRwifeLifeMar 20 at 5:59 PM\nAwesome for relaxation!\n\nLoved this! Amazing color and really relaxing! - renee (shawn's wife, from rendered reality)\n\nHelpful | 2", "TheJoBroJul 5 at 3:19 PM\nGreat\n\nThis is such a fun game and its definitely worth the money but my one complete is that you cant reset the picture after you color\n\nHelpful | 0", "cuervosunJun 3 at 2:51 PM\nGreat escape\n\nJust what I need right now - some reality that relaxing! It's fantastic. If I had one wish, it would be to have the ability to walk around while coloring. It would be nice to be more inside the world as it comes to life. But hey - that's nitpicking. This is a great way to decompress. Well done.\n\nHelpful | 0", "pondfrogsMay 25 at 9:55 AM\nfun but needs more\n\nfun app to spend some relaxing time coloring and enjoying the peace and beauty. i love the way the leaves start falling off trees in the color that you just colored them. nice animation but would like more, and interaction with objects woukd be great. like most others mention being able to color an object many different colors instead of just one would be great. coloring a flower petals different colors instead of one solid color for all would make a 5 star app! cant wait for more pages!\n\nHelpful | 0\nDeveloper ResponseMay 25 at 8:02 PM\n\nWe agree it needs more! Tune in this week for three awesome new scenes with lots going on. All free to existing users. Thanks for your feedback and thanks for playing.", "picabotwoJun 4 at 8:52 PM\nExcellent program!\n\nAmazing program, very relaxing. Definitely worth checking out. I wish you could control the color from the left thumbstick. Even just to be able to increase or decrease the brightness. I would love to see future upgrades like moving colors (color shift from color to color).\n\nHelpful | 0", "12mmRatchetMar 29 at 3:25 PM\nGreat support\n\nThey've done a fantastic job on the color pallet with the new update, definitely worth updating the review\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:58 PM\n\nThanks so much!", "BigelowedMar 26 at 12:50 AM\nIt's beautiful\n\nAnd with each drawing you will probably feel a little creative boost and positive energy.\n\nIt's not all bad news out there.\n\nHelpful | 1", "Peiji.xoApr 21 at 8:06 PM\n\nNot enough coloring pages to make it worth it\n\nHelpful | 3\nDeveloper ResponseMay 29 at 8:28 AM\n\nHi again! We just released our new update with 3 new scenes, our best and most detailed yet. Have a look and see if you think it's an improvement -- and thanks again!", "lolroflbbqMar 21 at 8:39 AM\nLove it.\n\nLoves doing this especially during these crazy times. But.. I did them all already lmao. Hopefully they plan on adding more to color.\n\nHelpful | 1", "TheRealAndrewDMar 20 at 7:01 AM\nBeautifully relaxing\n\nWorth every penny\n\nHelpful | 3", "PsychoHeavyDMar 30 at 11:10 AM\nThis is awesome\n\nOnly thing I can say is more coloring books please\n\nHelpful | 0\nDeveloper ResponseMar 30 at 4:39 PM\n\nOn the way! Thank you!", "dingoflingMay 25 at 8:20 PM\nBeautiful , Compos Mentis .\n\nNo way to explain the relaxation and when your mind clicks into VR after the 30min period it takes to take full neurological effect of connection. When in this world. Simplicity makes an hour turn to two. And done so well beautiful and great on quest at the price. Its different from the rest. But it isnt trying to copy anything in particular much . It is what you make it as is life. Goodnight\n\nHelpful | 0", "ASchadeMar 20 at 8:09 AM\nVery well done\n\nNice graphics\n\nHelpful | 3", "ANubloMay 24 at 5:27 AM\nAwesome! Few suggestions only.\n\nThis game is awesome for relaxing. I really like to seat in the bean bag and play into it.\nHowever I would ask from developers for few improvements.\n\n1. It would be cool to have CTRL+Z functionality when you accidentally colored already perfectly colored item.\n2. It would be cool to have ability to save colors from extended pallet to be able to use it later if needed. As another option you can provide ability to take color from already colored piece (pipete like).\n\nThanks for this game it's amazing!\n\nHelpful | 0\nDeveloper ResponseMay 24 at 4:31 PM\n\nGreat suggestions and perfect timing. We have an update coming this week that has an undo as well as a dropper function to pick a color from something you have already colored. +3 new scenes  let us know how you like it!", "BMFSHOWMar 19 at 11:41 AM\nDown Right Relaxing\n\nI love this experience. Having spent a little time in it I can say that it is super relaxing and amazing! The colors are super vivid and the \"color pages\" are just awesome to see.\n\nHelpful | 63", "fabian.luqueMar 23 at 5:31 PM\nJust wow!\n\nSuch a relaxing game. Simple to use, great activity to unwind at the end of the day! We need more drawings!\n\nHelpful | 1", "seven-of-nineMay 24 at 7:04 AM\nRelaxing and beautiful\n\nI did not expect this to be so relaxing or beautiful. The coloring worlds come to life around you as you fill it in. Its simple enough for a child, but engaging enough for an adult. Definitely a zen type game.\n\nI suggest taking your time and enjoying the journey with this one.\n\nHelpful | 0\nDeveloper ResponseMay 24 at 4:32 PM\n\nThank you! Stay tuned for the three brand new scenes that we are releasing this Thursday.", "terrible.monsterMar 21 at 11:19 AM\nMy daughter loves it\n\nVery creative game for children!\n\nHelpful | 2", "dczarMar 25 at 7:29 PM\nFuntastic!\n\nLove it! This is the most relaxing and enjoyable way to be in VR! Moaaaar scenes!\n\nHelpful | 1", "VR2050Mar 23 at 10:38 AM\nGreat for these stressful times!\n\nWhat a great outlet when stuck in the house! Super relaxing with great music.\n\nHelpful | 1", "natyli.mcchesneyApr 4 at 2:15 PM\nStunning\n\nVery relaxing\n\nHelpful | 1", "zforce5Mar 23 at 2:05 PM\nLots of Fun!\n\nBoth my 40 year old wife and 5 year old daughter love it!!\n\nHelpful | 1", "abnormal.afropuffJun 26 at 2:48 PM\n\nI Love the game it is very relaxing but I wish there were more coloring books\n\nHelpful | 0", "dholloman76Jun 25 at 7:58 PM\nI Love it!\n\nThis app is a great way to escape and relax. Whish there were more to color.\n\nHelpful | 0", "krisvdvijverMar 19 at 11:50 PM\ndaughter loves it a lot!\n\nMy (almost 9y old) daughter isnt really into VR gaming. She likes a few rhythm games, but always stops playing pretty quickly. And the story driven games are in English (which is always a problem for kids with different mother tongues). She likes this a lot though! She played for 20-30 min straight which is really a long time for her. Afterwards I had to check all the coloring she did :). Thank you devs for making this! Hopefully lots of new beautiful drawings/environments will come!\n\nHelpful | 11", "Chris_OfforMar 28 at 8:47 AM\nMixed feelings\n\nColor space gives me motion sickness for some reason but beat saber does not. The experience beyond motion sickness is really good. More picture options would be great!\n\nHelpful | 0", "pushmatrixMar 22 at 11:32 AM\nSimply amazing\n\nJust what I needed right now.\n\nHelpful | 1", "farligfiskMar 20 at 4:51 PM\nGreat for kids, but lacking in features\n\nI bought this for my seven year old to play with and it hasnt outright disappointed. In fact its intuitive enough for my four year old to understand too and theyre both very excited at being able to put life in these drawings. Its definitely a great game for kids in that age (and maybe a bit older).\n\nIts fully worth the price, in my opinion and the developers appear to be very active and responsive to feature requests, so heres hoping the game will continue to improve.\n\nWith that said, there are things that could be improved upon.\n\nIt seems a bit limited, after having tried it for a short while. I've understood that the amount of things to draw in a single drawing are limited due to hardware (but surely there must be a way around that?), but it seems like a small thing to increase the amount of colours and make it possible to blend colours (and to maybe create your own palette with the ten or so colours that you want for the given drawing).\n\nAlso it would be really nice if more consideration was put into lighting. There was one level (one of the mandalas) where the painter was placed on a very dark surface, so each colour was basically almost black.\n\nI've read the comments saying that it's kept simple to be relaxing and so on, but I don't agree with that. My seven year old was quickly missing colours and she was quite relaxed. As mentioned I figure that's an easy feature to add (at least compared to multiplayer and what have you, that other people request).\n\nI think the above may sound quite negative, but I'd like to once again say that I think it's worth the money. It's just that it seems like it could be significantly better with not too much effort (I don't know your code, of course).\n\nEDIT: I went from 3/5 to 4/5 after giving the price some thought. Yes, I think it should be more advanced and feature rich, but it's only 10 bucks after all. That's a beer where I live.\n\nHelpful | 6\nDeveloper ResponseMar 25 at 2:51 PM\n\nDear farligfisk -- thanks for your great and detailed feedback, we love it! We totally agree with your suggestion to expand the color palette, so we just released a new version with an \"advanced palette\" -- grays, black, and a near-infinite range of colors. Let us know what you think and if this influences your overall feeling about Color Space! We have more scenes on the way, too, but it'll take a couple weeks. Thanks!", "zacenoMar 22 at 11:42 AM\n\nWell worth the price tag\n\nHelpful | 1", "KaystonMar 19 at 3:46 PM\nFun and Relaxing, Great Value\n\nThe app is intuitive and easy to use. Colors are vibrant and I love how the scenery moves. Its relaxing and a lot of fun. My 6 and 4 year old daughters can do it too. Looking forward to more scenes and maybe a feature where you could dip your brush in the color on the pallet instead of having to always click the trigger.\n\nHelpful | 8", "vbowen925Mar 25 at 4:49 AM\nNice!\n\nGood game! Needs more coloring options, this game seems to have only 9 pictures to color. Overall, once that change.. 5 stars all the way.\n\nHelpful | 1\nDeveloper ResponseMar 25 at 2:24 PM\n\nThanks for your feedback, vbowen -- we listened to it! We just released a new build with grays, black, and a near-infinite range of colors on the new advanced palette. Let us know what you think and if this influences your overall feeling about Color Space! As for scenes, there are actually 13, and we have more scenes on the way, too, but it'll take a couple weeks.", "aaron.sommers.1253Mar 19 at 4:02 PM\nColor Space\n\nI love to color and was just coloring last night, and I was having problems with my pens. My pens run out of ink or run low I said out loud man we need a Vr coloring book, and today to my surprise Color Space :) It's a Great app, and Great timing for me thank for the app. If I could do anything different I would say it would be nice to also have a brush so you could do details, instead of just fill.\n\nHelpful | 7", "Deadhead1999Apr 10 at 8:19 PM\nI really hope theres more\n\nTheres 13 things to fill in so I paid about a dollar 20 for each. Pretty dope I just think it shouldve been like 5$\nI make art and sell it on redbbubble (NativeAssady) and someone bought socks for 25$ and I only made 4$. So buying this was kind of a waste because I finished in one day literally in less than 3 hours. Use your $ wisely\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:44 PM\n\nThanks for you review! We've got more scenes to color, coming next week (free). We hope you like!", "CryptikBlissMar 20 at 7:00 PM\nColoring Zen\n\nIt's a great bit of VR and I hope to see this expand and evolve into all of its potential. Very intuitive and easy to grasp. Animated coloring book pages make it even more enjoyable to watch what you colored. It's really relaxing and a pleasure to experience.\n\nThere's sooo many cool things that could be done here. I really really hope to see this grow in the future. I would love to see bigger scenes, more detailed / intricate pages to color and more pallet options. I would love to see the ability to free hand color and zoom into the images slightly. Freehand would need undo functionality. Maybe some shading tools too. A bigger range of color access in the pallet including Grey's and black would be nice. Allow people the ability to upload custom artwork for coloring. Building a library of community submitted coloring pages and sooo much more!\n\nSure hope to see what it becomes. And, truthfully, if this is all it wind's up being, I still fully enjoy it and would recommend it to those who this kind of thing.\n\nHelpful | 3", "hargisssMar 19 at 12:13 PM\nTimely!\n\nThis is a relaxing app which can counteract claustrophobia and cabin fever - a particularly good thing for an app to do right now!\n\nHelpful | 14", "SmeliotApr 4 at 7:06 PM\nPretty pretty\n\nVery nice little game, theres only about 9 pictures you can choose from to fill in, and I found myself nearly done after one sitting. I could imagine it would be really good if you have kids who want to play VR.\n\nDespite it being a small game, it is incredibly relaxing and a great escape for a little while stepping into a coloring book. I like it a lot!\n\nHelpful | 0", "jretiefMay 12 at 7:43 PM\nI just feel so content and relaxed\n\nWhen I think of VR I think workout or games. As a result I was pleasantly surprised by content I was coloring in VR.\n\nHelpful | 0", "DeveloperSteveMar 21 at 5:26 PM\nAn amazing and beautiful experience\n\nIn a time of lockdowns and uncertainty this game brings about a beautiful immersive experience in times of need. Its underlying message of bringing color to a drab world is unforgettable and truely needed in the world right now.\n\nFuture requests wise id love to see a multiplayer mode (maybe different ends of the view) and possibly a share option so people could see others creations. Also once a scene is colored in leading the user to another scene without going to the menu would be a great UX option to see.\n\nHelpful | 1", "lisa5605Mar 20 at 2:04 PM\nVery fun experience\n\nI'm not usually a big fan of the art/drawing experiences, but this one is great. I think it's because you see your choices reflected so quickly - point and click and it has big effects on the scene you're standing in. The developers are very responsive and are considering improvements based on user feedback. My suggestion is to add more colors (black/shades of colors), but even as is the game is fun. I'll be spending more time here!\n\nHelpful | 2", "isal51Mar 19 at 1:17 PM\nBeautiful\n\nThis app is a much needed moment of zen. My five year old got his first experience in VR with this app and now he is hooked!\n\nHelpful | 9", "kevola1966Mar 29 at 10:35 AM\nBrilliant\n\nWell what can I say, I'm 53 and been a gamer from the early days zx spectrum the atari even the binatone in black and white of course, today we are here the vr I embrace it totally. This game, experience is what I need right now in these troubling times, rest the brain if you get me, well done to the developers and look forward to any updates that you can give us free or paid I really don't mind many thanks Kevin\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:59 PM\n\nKev, thanks for a wonderful review -- color well!", "Mixer1207Mar 21 at 6:35 AM\nTon of detail in this fun art experience\n\nMy 6 year old and I are enjoying this very much and the whole family enjoys watching the creations casted onto the big screen. This is a really beautiful experience and my son spends a good 30-60 minutes per day (10-15 minute sessions) coloring in here. Gave this a 5 star with the hopes that more coring books are coming soon.\n\nHelpful | 1", "Fantasmic2019May 7 at 7:09 AM\nBeautiful\n\nI hope theyre able to add more pictures in the future.\n\nHelpful | 0\nDeveloper ResponseMay 20 at 8:40 PM\n\nThank you! Tune in next week for a new book of scenes, some of the best ones yet!", "ParadiseDecayMar 21 at 9:32 AM\nCool, relaxing but could be better!\n\nMy Initial Thoughts:\nA chill and relaxing experience that comes alive with a click and point mechanic, however I would have liked to have seen the developers take this one step further and actually allow us to use a brush to color in the worlds ourselves.\n\nImpressions Video featuring the RIFT S version of the game here:\nhttps://www.youtube.com/watch?v=CuX-STWTyxc\n\nHelpful | 2", "zachary.denneeMar 20 at 4:42 PM\nI love it\n\nI love art but this takes it to another level. It's like being in a coloring book but the animals you color, are alive. 10/10 because it shows what the oculus quest can do.\n\nHelpful | 1", "tongaApr 13 at 4:18 AM\nMesmerizing!\n\nMy kids absolutely love it. More pictures please!\n\nHelpful | 0", "vasko.stoyanovApr 7 at 7:09 AM\nIt's so relaxing...\n\nI love it! Thank you for creating such a wonderful experiences!\n\nHelpful | 0", "MikeSpam69Mar 22 at 5:55 AM\nLove it\n\nIs relaxing, simple, very clear and tecnically a neverending experience. Add custom support or more maps to color and will endure many years!\n\nHelpful | 1"]