{"App Title": "Creed: Rise to Glory - Demo", "App description": "Experience the pulse-pounding excitement of boxing with the cinematic thrill of a blockbuster movie as you become Adonis Creed, fighting to establish your legacy in the ring and beyond. \n\n Live Your Legacy: Challenge both your body and mind as you experience the ascent of Adonis Creed from undiscovered underdog to world-class fighter, all within an immersive universe inspired by the Creed films.\n Multiple Game Modes: Choose your path to glory in multiple game modes: story-driven Career, customizable Freeplay, or minigame-based Training.\n Online PvP: The fight just a lot more personal. Set up custom fights with friends or find your contenders in crossplay Quick Match.\n Feel the Impact: Phantom Melee Technology mimics the real-life effects of throwing and taking punches in the ring, such as the out-of-body sensation of getting knocked out or the strain of fatigue during a long, frantic bout.", "Purchase section": "FreeView Full VersionAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade", "Languages": "English", "Version": "1.6", "Developer": "Survios", "Publisher": "Survios", "Website": "https://survios.com/creed/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "1.17 GB"}



["5 stars\n17%\n4 stars\n23%\n3 stars\n11%\n2 stars\n9%\n1 star\n40%", "LaggniapeJul 6 at 6:35 PM\nI can't give less stars or I would.\n\nI just got my new set and going through all the demos. This demo crashed but not before running me into a wall pretty hard. There is a square safe zone around your feet you need to stay in , but it moved its way half way through my wall so while staying in it the Oculus guard was disabled and it didn't work I just plowed into the wall. I reset and tried again and it did it twice. The second time I was wiser and stopped to take off the headset. My opponent was in the wall. Good thing I stopped moving. Then it locked up and the hand sets vibrated and would not turn off. I had to pull the batteries on them and then power off the headset to get it to close.\n\nHelpful | 0", "Jeppe_KDec 14 at 2:44 PM\nWow, that was bad!\n\nWhat's the point? Your opponent is in your face all the time, you land 50 hits but then it lands a knockout on the first hit. Fun... And when you've finished, you get retry or buy game. I want to EXIT!\n\nHelpful | 0", "ummwhatsureOct 10 at 11:53 AM\nI loved this game until.....\n\nNo matter what I do in the settings I can no long walk in a straight line in the ring. The walking mechanics work great in the gym but as soon as I get into the ring I start walking backwards and to the side. Its incredibly frustrating and makes the game unplayable. I really loved this game when I got it but I cant recommend it anymore.\n\nHelpful | 8", "dz1000Sep 23, 2019 at 8:28 AM\nGood workout\n\nThis gave my arms a good workout and it was enjoyable to play as well. By the end of just the first round i was exhausted.\n\nI hope it was registering my hits with accurate strength but it's hard to tell.\n\nI did get motion sick when my character moved forward to meet my opponent before the fight. But i have learned to just keep my eyes closed for a few seconds while that happens and that solved the problem.\n\nHelpful | 5", "kaushikwavhalOct 20 at 6:39 AM\nI loved the game but i injured my wrist\n\nI had badly set the room scale and ended up hitting a wooden wardrobe with pull power :/\n\nHelpful | 6", "frlecubeOct 22 at 4:06 PM\nBugs\n\nLots of bugs specially when walking or with the camera resets, it could have been a great game. It is not finished.\n\nHelpful | 4", "QuestGyrlAug 8, 2019 at 9:55 AM\nClubba Jones!!!\n\nI liked it! Didn't get nauseated like some others. I got a work out! Might want to do some cardio warm up before this game and a cardio warm down as you might drop your blood pressure too fast after an intense work out and feel woozy. My right hook ain't to be played with!\n\nHelpful | 4", "antoine.bartJun 30, 2019 at 4:44 AM\nGood fun but frustrating\n\nHi Everyone - Hi to the devs,\n\nI only rate this game 3 stars as there are still some technical issues triggering a lot of frustration in game for me - Mind, I'm going to bash open doors here as most of the complains I have have already been mentioned by other players.\nAs a former amateur boxer, I jumped straight into the gym for a bit of training to see whether I could get a bit of sweat going on and enjoy the game mechanics.\n\nI find the tracking issues to be the most frustrating:\n- when you get some padwork (with Balboa THAT is awesome), it's not clear why some punches do register and some don't. (speed? hands positioning?) Following advice I found online, I tried to keep my hands well inside the tracking area of the device, but still, I found my gloves weren't where I wanted them to be way too often. (or is it my muscle memory that makes me position my hands too close to my head, hence losing track, without even realising it?)\n- when I move freely in the gym with the intention of picking and choosing a workout, I tend to position myself in relation to my real life reach. Starting a minigame just messes up your reach, distance and placement towards the target. I find that the default starting position is way too close forcing me to step back - and therefore messing your Guardian setup.\nIt might be my boxing style that doesn't work great with the game, but I find it difficult to keep the distance, as the game keeps pushing the target right in front of your face when you're just trying to get your reach right.\nI'd much prefer it if the game would allow to trust the player to position themselves properly and not force their positioning system onto you.\n\nSo overall, it's a good game, hats off to the devs! But players that know a minimum about boxing, sparred and trained in real life, will find the limitations frustrating.\n\nLet's hope the devs come up with a nice update and Oculus fixes that tracking issue soon!\n\nBest, A.\n\nHelpful | 5", "tanapholOct 8 at 8:58 AM\nHow to control it?\n\nVery hard\n\nHelpful | 0", "mikaserlaJul 28, 2019 at 11:49 AM\nGood, but sound could be better.\n\nThis game demo is good on the Oculus Quest but it doesn't have surround sound. It seems like this should be corrected and could be corrected. Overall the game is fairly similar to the Oculus Rift version, but the freedom of the Oculus Quest headset makes it better than the Oculus Rift version (except for the sound).\n\nHelpful | 0", "EightBitApeMay 24, 2019 at 10:37 AM\nHow is this \"comfortable\"!?\n\nI've played my fair share of nauseating VR games. This tops them all. This was worse than The Martian VR. And that's saying something. I happen to love the movies that inspire these experiences, but boy does Hollywood have a lot to learn about just getting the basics right.\n\nI almost fell over the first time I attempted the \"recovery\" effect in this game, where you swing your arms and attempt to walk back to your body. The knock-out effects are definitely disorienting and made me want to vomit. Maybe that's exactly what they were going for. But I wouldn't think it's fair to call this a \"comfortable\" experience. Vader Immortal and First Contact are leagues above this experience.\n\nTalk about a punch in the face for your senses. I'm still recovering from the headache it induced. It's too bad that this is going to be a lot of people's first VR experience. I literally deleted the demo after playing it. I don't want it taking up space in my library.\n\nHelpful | 4", "andersd1Jun 26, 2019 at 11:07 PM\nHand tracking\n\nIt seems like the Oculus Quest has issues with tracking controllers when you block. It made for a poor experience for me, might work well if you have external tracking.\n\nHelpful | 0", "todd.perkins.37May 26, 2019 at 3:04 PM\nGlad I didnt purchase\n\nTons of potential, but the game just doesnt work right. I obviously blocked and dodged punches yet somehow I am getting hit and knocked out. Hopefully the developers can fix this game, because if these issues can be fixed it could be great. I was looking forward to this game, but I am glad that I didnt buy it.\n\nHelpful | 0", "buzzy1313May 29, 2019 at 2:33 PM\nComfort rating is wrong.\n\nThe comfort rating on this game is so wrong. I usually dont get motion sick but this game made me super nausess.\n\nHelpful | 2", "TsuyoiRaionMay 26, 2019 at 10:29 PM\nFun demo\n\nThis is a fun little boxing demo, it's cool to box with an AI that's responsive and really feel like you knocked your opponent out.\n\nMy only gripe is the hand swing movement, i mean it's ok but walking and rotating feels a bit off, other than that, totally responsive and was cool to play.\n\nHelpful | 1", "TSwofMay 25, 2019 at 10:51 AM\n\nFirst VR game to ever review because it made me terribly nauseated and motion sick. Mind you I seem to get this way on some of the different experiences, but mildly so. Standing in the ring before the fight felt really cool, and the big muscled opponent in front of me was surprisingly intimidating, but then <30 seconds into the fight I had to pull the headset off and still have a headache 6 hours later.\n\nHelpful | 1", "BOBTHEBOB2010Jun 12, 2019 at 7:20 AM\nWorth it if you like boxing\n\nIf you are decent at boxing and actually like it this is for you especially the full version but if you play for about even an hour itll make you very tired.\n\nHelpful | 0", "el_jergasMay 24, 2019 at 7:31 PM\nMotion sick + no tutorial\n\nYoure basically thrown right into a fight, without knowing how to move around the ring. And when you do move un the ring the experience is terrible because the floor moves. Not a room scale experience. Dont recommend it at all.\n\nHelpful | 2", "JforssbladMay 24, 2019 at 12:41 PM\nWow\n\nThis is working way better than I thought! As soon as I get my paycheck I will buy the full game.\nAwesomeness!\n\nHelpful | 0", "sen.sun1Jun 1, 2019 at 11:30 AM\nMade me sick\n\nHad to lie down for an hour. Do not download this garbage.\n\nHelpful | 1", "MasterPieceKCMay 31, 2019 at 8:06 AM\nCreed Full Vers Error Performing Query\n\nThis is my last resort! I had to leave a negative review here on the demo because I cannot add a review to the full version. Since the launch of the Quest store Ive received an error performing query when trying to add Creed full version to my library. I have created ticket with Oculus support and they are unable to resolve the issue as well. I have contacted the developer Survios via Twitter and Facebook with no response now. Please someone fix this as I have received responses on Reddit that others are having this same issue! I really want to play Creed and have it free through cross-buy but have no way to add it to my library because of the error. It gives the same error on both iOS and Quest headset by the way. This is not an issue on my Rift only the quest version. Any help is greatly appreciated!!\n\nHelpful | 1"]