{"App Title": "Creed: Rise to Glory", "App description": "Live Your Legacy: Challenge both your body and mind as you experience the ascent of Adonis Creed from undiscovered underdog to world-class fighter, all within an immersive universe inspired by the Creed films.\n\n Multiple Game Modes: Choose your path to glory in multiple game modes: story-driven Career, customizable Freeplay, or online PvP.\n\n Feel the Impact: Phantom Melee Technology mimics the real-life effects of throwing and taking punches in the ring, such as the out-of-body sensation of getting knocked out or the strain of fatigue during a long, frantic bout.\n\n Break Themor Become Them: Play or fight the most iconic figures from the Creed and Rocky universe in Freeplay or PvP, including classic Rocky Balboa, Ivan and Viktor Drago, and more!\n\n Oculus Cross-Buy: Got CREED: Rise to Glory in your Rift library? Let the punches fly on Quest at no additional cost with complimentary cross-buy.", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Fighting, Sports", "Languages": "English", "Version + Release Notes": "1", "Developer": "Survios", "Publisher": "Survios", "Website": "https://survios.com/creed/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "995.4 MB"}



["5 stars\n57%\n4 stars\n23%\n3 stars\n8%\n2 stars\n5%\n1 star\n6%", "DarkmentalityJun 29 at 10:33 AM\nRealism issues, but good overall\n\nMy experience with this game was pretty good. I actually box, so a lot of my combinations translate very well into the game. It's so satisfying to circle the opponent in an attempt to find an opening. I ADORED the knockdown mechanic, because the out-of-body experience is a well placed representation of your brain after too many times being rattled by an opponent's shots. The character list is wonderful as well. I relived many of the movie fights and was not disappointed.\nHOWEVER\nAs a gamer, I dislike things that take away from my immersion, whatever that game may be. On Creed, I think that stamina should entirely be on the player, not the in-game character. This is VR, not a console. I'm really punching. I'm the one who should be out of breath. On console, this mechanic makes sense. If I'm using an Xbox or a SNES, I'm sitting and my character is doing all the legwork. You need a stamina mechanic in a world where button inputs translate into exertion. In VR, however, I'm actually throwing jabs, hooks, bodyblows, and combos. I'm feeling that stamina myself. If I want more \"stamina\" I need to improve MYSELF.\nOverall, this is a great game. As long as you take it for what it is, you'll be thoroughly entertained for hours.\n\nHelpful | 331", "triplea2264Jul 9 at 9:46 AM\nGood game overall but lacks a feature\n\nI've had this game for a couple of months and it really gives you a workout, both the campaign and multiplayer game modes work great. One feature that really irritates me is the snap turning, I'll be facing away from my opponent at an angle and when I try to turn a little bit to the left my character turns too far and misses the opponent. An option to enable smooth turning would be greatly appreciated.\n\nHelpful | 28", "Bulldozer9818 days ago\nBetter than Thrill of the Fight\n\nThrill of the Fight gets better reviews than Creed, so I bought TOTF first. but Creed is an excellent boxing experience, and actually more immersive. I love the storyline, and I always feel like I had a good workout. The game deserves to be rated better, when it is compared against the boxing experiences on Quest. I love the fight and I look forward to getting back in each time I play.\n\nHelpful | 6", "peter.wrightson.1618 days ago\nGood game but short.\n\nActually enjoyed playing this game as I usually don't play boxing games yet I fully enjoyed the work out you do during training and then the matches.\nLove how you have to train first before each match.\nCouple of grips tho 1.\nWhen moving around the ring or gym can be a little awkward and two only six or seven fights in carrer mode I completed it in a couple of hours.\nCould do with more to the story and more matches but still a solid game.\n\nHelpful | 3", "Luk3078 hours ago\nSlightly buggy, but still very good\n\nWhen I first played the campaign, the game seemed VERY buggy when I was training. If I reset my position, it would make it so my waist was in the ground and I was four feet tall, and it would always spawn me next to the treadmill and not let me step on it. The next day, however, I found that there were VERY few bugs, so Im really not sure. Otherwise, game works great and the overall mechanics are very satisfying.\n\nHelpful | 0", "bj.jibbenJul 6 at 12:36 PM\nGreat exercise\n\nI am not a boxer and have absolutely no idea how. But I love this game. I hate and I mean hate to exercise, but when I'm in Freeplay and running the treadmill or hitting the dummies I don't feel like I'm exercising. But after a session or two I certainly feel it. I would recommend anyone that would like some upper body exercise to seriously look into this game. And hey, who wouldn't benefit from hitting a bag or person every now and again. So good as a stress reliever as well...\n\nHelpful | 17", "gaito324 days ago\nGood workout\n\nLove it. Can break a really good sweat.\n\n2 problems of note 1- no one is ever in the PVP ring when I get there. Is it me? Why isnt there a waiting room you can see before you go into that mode to see if anyone is there and ready to fight? 2- takes a fairly long time to get back to the main menu and then enter the regular fight mode. I spend a fair amount of time waiting around.\n\nThat being said, still a great game.\n\nHelpful | 0", "dawnofthed605Jul 23 at 7:58 PM\nPrivate matches request\n\nPrivate matches would be great if you had a psvr headset and a oculus headset that both had creed rise to glory vr. You could easily connect to other friends too. I tried quick match on both my psvr and oculus and it kept on connecting me to other players. I think this would help people with 2 headsets or when playing with specific friends.\n\nHelpful | 6", "Marchosias969Apr 14 at 7:03 PM\nGood game; Not enough content per price.\n\nGood game, mechanics feel great (and tiring) however not enough content to justify 30$+ price tag. Haven't tried multiplayer yet.\n\nThe stamina system in places so far has been the source of many funny moments around the house. So far half the people I've put in the game have tried to go in with a full street brawl mentally, and consequently run out of stamina and get decked they do this for about 3-4 fights and eventually get tired of being floored.\n\nThen after a few minutes hop back in ,and after a quick explanation of the stamina mechanic something clicks and they start boxing. They keep their guard, the actually think about when, where and how to punch, they move in more then a straight b-line to the opponent, and they start getting closer to victory. After a few more fights they start to win, and good god the rush of that first well earned Knock out.\n\nSo to the people out there that are looking at this game when it's on sale. (DO YOU WANT TO BRAWL OR DO YOU WANT TO BOX?)\n\nCON\nyou may not get hit ... But you WILL get sore \n\nHelpful | 151", "T2PHoneShawtyMay 22 at 7:50 AM\n\n\nI give it a 4star review cause the game is dope dont get me wrong I love this game and everyone I let play it love it but for the price of the game it should come with more content or at least a weekly or monthly base content drop that would make the game have more replay value it too short of a story mode but other then it because a shirt game the game is AMAZING \n\nHelpful | 20", "Philligan8114 days ago\nAll polish and Nothing else.\n\nI was really looking forward to this game and was very disappointed. Having a stamina factor that you cant turn off makes no sense for a VR game. Your stamina should be your actual stamina or the game should at least give you that option. Too many flashy, cinema type crap that rushes you through the game. Also this game is horrible at keeping you in safe play space. It puts you right against the boundaries, sometimes right In the boundary. I almost punched my tv, which TotF never allows me to do.\n\nAll the fake stamina, and balance position stuff is absolutely terrible and unrealistic and very much ruins the entire flow of a game.\n\nDevelopers, take a lesson from The Thrill of the Fight, its realistic, highly customizable, better exercise, and just an overall better boxing experience. If they could take the simulation and options from Thrill of the Fight and combine with the awesome graphics and characters of Creed, this would be the ultimate boxing game. Ill stick with TotF until you guys make some updates and changes. Please,... I hope you listen to your reviewers, we are loyal customers just wanting the best gaming experience possible. Thank you.\n\nHelpful | 3", "Ad-A7X-1Apr 27 at 5:35 PM\nGreat fun but expensive for a short game\n\nGreat visuals and sound design. The mechanics are fun and the game runs smoothly.\n\nThe career mode is well put together and fun to play, but it's just so short! The only way to get replayability here is to restart the career mode on a tougher difficulty.\n\nYou can make custom matches with characters from across the franchise timeline and this is fun and wins big on nostalgia points...but again its short lived. You can blast through every opponent in this mode in an hour or so.\n\nIn short this is a fantastic game that will let you work up a sweat whilst being immersed in the world of rocky / creed, but the content is lacking when considering the price tag of this game.\n\nIt would be great to include weekly or even lifetime challenges that reward cosmetics (gloves, skins, shorts, gym and ring environments, personal trainer skins etc). Or perhaps introduce DLC chapters to go through rocky's career that are heavily discounted for owners of the full game.\n\nHelpful | 45", "tyson1234567822 days ago\nFantastic\n\nLove rocky love creed, the fact I'm in a ring in an arena is just wow! I mean I did punch my oven but that was my fault......for putting the oven there haha\n\nHelpful | 3", "tazkmazterA day ago\nDisappointed\n\nSadly, despite the polish and nice graphics this game doesn't even come close to thrill of the fight. I tried but I just could not enjoy it at all. Looking at the 4 star rating, I feel like I must be playing a different game or something. The arcadey feel and extra bells and whistles take away from the fun rather than improve it. Also, get rid of the silly stamina mechanic, it's a VR game.\n\nHelpful | 0", "EmigrantCorgi5514 days ago\n\nI really like this game because its a really good workout also you dont get bored from it after two days so Im my opinion its worth the money so I recommend if you have the chance to get it\n\nHelpful | 0", "KillerQ2024 days ago\nGood game for new questers but gets old\n\nIf you bought this game before 2020, i would say it was completely worth it. But now, its just kinda outdated. I hope the developers will do a big update so the game gets newer.\n\nHelpful | 0", "Artisan38Jul 21 at 4:13 PM\nReally fun game!\n\nIm hooked. So much fun and a great workout.\n\nIm getting a glitch once in a while where it goes black all of a sudden and theres no way to fix it except to restart the game. But I dont see any other reviews saying that and I appreciate the reply and help from customer support and I will try what they suggest thanks!\n\nHelpful | 1\nDeveloper ResponseJul 20 at 7:58 PM\n\nHi Artisan38, Sorry to hear you're experiencing this black screen issue with Creed on your Quest. It's possible this issue may be caused by some type of corruption during installation. Could you try fully reinstalling Creed, then see if you still experience issues with your screen blacking out? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still experiencing this issue!", "TomDob24 days ago\nMy favorite game\n\nI really still play this most often. Its an incredible workout! I really do think it would transfer to real world fighting improvement. The PVP is my favorite. I wish more folks would get this game, sometimes I can't find anyone to fight!\n\nHelpful | 1", "spm1999Jul 7 at 7:06 PM\nThe game doesnt save my career progress\n\nThis game is really cool and is a decent work out and I love playing it. The reason I give it 3 stars though is due to the fact it does not save my career progress. Ill exit to the creed menu and Ill click career and it will allow me to continue but as soon as I quit the game and try to get back on later it makes me restart. I dont know it Im not doing something right and Ive tried looking up the answer to this problem and have been unsuccessful in finding it.\nThank you developers for reaching out to me that solved my problem. Thank you!\n\nHelpful | 0\nDeveloper ResponseJul 6 at 10:59 AM\n\nHey spm1999, Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot the game. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if this issue continues!", "faultedcell128413 days ago\nIts very fun but Career mode is to shor\n\nThis is a really great game but if the career mode was longer I would like it a lot more\n\nHelpful | 1", "RoreoOreo10 days ago\nCrazy fun\n\nI played this game a lot and I got a lot of exercise from it. Even though it was short the other things in the game easily make up for it\n\nHelpful | 0", "SwitchVRJul 14 at 11:45 AM\nAmazing\n\nI love this game. Its nostalgic to the movies and its has a realistic boxing gameplay to it the only downside is when you get exhausted in the game your first become turtle speed and its annoying when you get beat up by your opponent. Otherwise great game to get for a workout and nostalgia. \n\nHelpful | 1", "Mathhatter2 days ago\nGood game\n\nIts a good game hopping for some more content but other then that its well made and fun\n\nHelpful | 0", "bred005Jun 19 at 12:02 PM\nGood game love the fights and free play\n\nGood game love the fights and free play but the issue is when ur training I know it's not much of the game but it puts you in random spots and glitches abit but it's fine and doesn't change most of the gameplay I do recommend it for exercise and it's great fun\n\nHelpful | 2", "EyosakuraJul 22 at 1:35 AM\nGood workout, glitchy game\n\nThe game gets a good workout out of you but a lot of it is from frustration dealing with all the glitches. Dodging in the game is rather wonky, mostly only working during training by simply leaning back but leaning back, to the sides, squatting; nothing works when fighting, which is more infuriating when the game keeps yelling at you to stop taking punches via blocking and dodge. Would if I could couch, would if I could. But maybe it's just me and something I'm doing. But this is small compared to the major glitches like the fight being won yet it keeps going for some reason, the opponent still throwing punches, the commentary still running and your couch still yelling at you to dodge. And then the latest, never ending fights/infinite rounds. I was having issues dodging and the fight itself was going horribly, but not near as horrible as I was about to witness where after every punch or two the bell would ring, a new round would start, and the camera would be facing another way forcing me to try to find my opponent only to have the same thing happen again in just SECONDS. I got to round 20 something before ripping the headset in sweaty frustration and turning it off. Will give it this, one hell of a workout.\n\nSeriously though, upset I wasted my money on this, even the boxing games I had on the Wii were less glitchy and infuriating. Look for another boxing game.\n\nHelpful | 2", "ColeartianoJun 23 at 11:38 AM\nI love the game but there missing things\n\nI love the game but there missing really cool things they could do like add different outfits for characters ex.rocky with Apollos shorts and the red and white 2 make it so there is no rabbit punching THEY EVEN SAY IT IN ROCKY 3 add old rings like the ring in Russia or where rocky and Apollo boxed beside that the games great\n\nHelpful | 0", "slappy2669Jun 5 at 9:05 PM\nReally good game\n\nSo I have to played the game a pretty good amount. I like the storyline and I like the fact that your gym Coach   changes depending on where you are at in the game. I really like Rocky as my coach. Theres one thing I really want to work with the game. I really want native support for bHaptics. I want to feel the punch.\n\n\n\nHelpful | 5", "rollthedice326 days ago\ncould be a major vr game that people wat\n\nneed improvements, but the best game for a good workout in quest store!\n\nHelpful | 0", "virtualmandala9 days ago\nSo much fun\n\nBetween this and thrill of the fight, VR boxing games are good to go.\n\nHelpful | 0", "Jtizzel47Mar 29 at 10:10 AM\nFun game, one issue\n\nThis game is phenomenal and I like almost everything about it. Almost. The one thing I dislike about this game is the fact that sometimes the controller doesnt match with your hands and your opponent easily beats you when this happens. I think its the tracking, and thats the only thing bad about the game. Other than that, the game is great. Buy this game anyway, as Im sure they will get this fixed and its not much of an issue anyway.\n\nHelpful | 87", "MERRYOLDESOULJul 14 at 8:48 AM\nGreat game but has an issue\n\nThis game is really fun and I enjoy boxing, but theres only one problem: the walking maneuver is very strange. And sometimes I cant walk at all.\n\nHelpful | 1", "refridgerator31015 days ago\nyes\n\ngood\n\nHelpful | 0", "Rikesh.KotadiaJul 9 at 12:17 PM\nGreat game play.. Just too short\n\nExcellent game play and fun to play. But the \"career mode\" is only 5 fights. Which you get through within 90 minutes or less. Really needs to be a longer career experience.\n\nHelpful | 1", "ryanl81217 days ago\nSolid boxing game\n\nOverall a great game but the movements can get a little jarring when boxers move around you.\n\nHelpful | 1", "pizzadog2673Jun 9 at 8:03 PM\nVery fun but one little problem\n\nIt is a very fun game overall but what I think is that career mode is a bit too short and all of the montages Ill start moving around and its hard to do them but other than that I like it PVP mode is a very cool feature.\n\nHelpful | 2", "oscar905May 16 at 5:26 AM\nGreat game but needs more content\n\nI absolutely love this game but there is one problem and that is: when you have completed story mode and free mode thats about it. You guys should make more fighters and a harder difficulty because champion gets a bit easy and gamemodes like fight 2 or 3 people at once.. like that but overall amazing game i suggest buying it\n\nHelpful | 3", "revokeaddictionzApr 28 at 8:27 PM\nGood game\n\nI love this game one of my favorite games to play on oculus. The one thing I would want is for there to be more game modes. Overall I would recommend this game to all boxing lovers One more thing is please in PvP make it so you can actually knock people down I punched a guy 20 times in the face and he didnt get knocked down but 5 punches to me and Im knocked out\n\nHelpful | 10", "christopherlee939316 days ago\nOrange\n\nGIVE ORANGE ME GIVE EAT ORANGE ME EAT ORANGE GIVE ME YOU\n\n\n\n\n\n\n\nHelpful | 0", "jimschubertJul 17 at 1:09 PM\nGood game, crackling audio when casting\n\nMy kids and I love this game. It's a fun way to get your blood pumping. But I always cast games to Chromecast and this is the only game with crackling audio when it comes through the TV, all other games are fine. If this could be fixed it would easily be a 4-star.\n\nHelpful | 0", "JayVM817 days ago\nThe best game for trying to get fit\n\nI'm only 9 and this game is awesome it thought me how to fight and overall just a great game\n\nHelpful | 0", "briangolodMay 3 at 6:24 PM\nThe most I have sweated\n\nAn amazing game thats very realistic and even when youre just training you can get a really intense workout. I can easily burn 600 calories when I play it per my Apple Watch, which makes it the game I enjoy the most now because I want to burn the most calories while Im on VR. I really enjoy the game. Im stuck with this one boxer, I cant get past it... I think I have fought him five times already. I cant wait to get through, I havent even started the championship. lol\n\nHelpful | 10", "TirelessSoda972Jul 18 at 5:48 PM\nToo short\n\nThis game is great and I love the story, but I fell like it could have been longer.\n\nHelpful | 0", "DanD-RAJun 25 at 1:43 PM\nGreat work out\n\nAll my usual sports have been canceled due to the pandemic. Creed Rise to Glory is a fun workout that really makes you feel that you are inside a movie. Great game! A little laggy sometimes, but still fun.\n\nHelpful | 1", "ChromerE1iteJul 3 at 6:10 AM\nGood, there are some annoying issues\n\nThe game is great overall but the main problems I found was 1. That my opponent sometimes just walks inside me and knocks me out instantly 2. The walking technique is kinda buggy because when I try to move forward it just kinda pushes me backwards and I get rolled over by that 3. The stamina system is as# I cant event walk half the stage without running out of breath. 4. I need an option to skip the introduction to the opponent, once you meet a hard career opponent the same intro is being played and you cant skip. 5. For 30 dollars its lacking alot of content. The career is pretty short if you are good. The online matches take up to 5 minutes to find. 6 (this may be just my opinion but I'm 192 cm and the dodging system feels really wonky so I just have to go for blocking)\n\nHelpful | 0", "livic2Jul 29 at 2:06 AM\n\nIts ok\n\nHelpful | 0", "IMBUZIMay 30 at 3:36 PM\nAmazing.\n\nThis game is a ton of fun. I cant seem to find any problem with this game, and its exactly what youd expect from a VR boxing game! Theres training, fighting, and even multiplayer. Not only does this game provide a good workout, but youre also having fun simultaneously. Id recommend this to anyone who finds even the slightest interest in boxing, because I came into this game with very little knowledge about boxing, and now I feel like becoming the next Mike Tyson. Its incredible!\n\nHelpful | 2", "Dr.Jam5May 13 at 7:09 AM\nGreat game, but not much content.\n\nWhen I first got the game it was thrilling. A great workout and really had those few little details that made the game awesome. After a while though the game doesnt offer you much content anymore and it just becomes boring. I think that the developers should add more to the game. In my opinion it was the best workout Ive ever got in a Vr game and it really got me sweating. So overall I think its up to the person buying the game whether they will think its worth it or not.\n\nHelpful | 2", "Precoolza2496May 11 at 9:33 PM\nSuper great but...\n\nThis game is one of my favorite of all TIME!!!!\nIt can get you in a serious workout from the quarantine when you cant go to the gym . The only downside is that in the career, all you do is do fights, training, and just BARLEY talking to o the NPCs. All it is is a game with stuff you can do in free play BUT in freeplay, you can do WHATEVER U WANT!!! You can even make your own battles! I recommend buying this game and it will get you something to always come back and play more. Sometimes I sit on the couch, watching Stranger Things season 3 for the 1 millionth time, but Creed would come on my mind, and I wouldnt want to play it because after having a game for a while, it gets boring really fast, But when I actually try Creed from sitting on a couch, It makes me pause anything in my way. So please buy this because even though my family isnt a family where the whole family plays Minecraft together, they always take the Oculus while nobody knows and play Creed. They dont play Creed only to, They play Beat Saber, Superhot, and once I made my dad play GTA 5. Anyways, I give this a 4 star rating and you SHOULD buy it.\n\nHelpful | 2", "MegamocoJul 4 at 9:28 AM\nVery fun game\n\nOne of the best games I've played on the oculus quest the only problem i have with the game is that it has a very short story mode but i feel that the freeplay mode makes up for it.\n\nHelpful | 0", "Mayhem4807Jul 2 at 11:48 PM\nGood offline, bad online\n\nThis is an awesome game, when your playing offline. The online mode is just, flailing your arms. There is no skill, no way to block, and overall ruins the game. Online is just overall non playable.\nThe online mode though is almost perfect. The Ai, combos, and graphics are all great. My only complaint is the stamina system. I'm already tired in real life, so why do I need an in game stamina bar?\nOverall, not worth the price due to the short career. Still fun though.\n\nHelpful | 2", "coolguy716Jun 10 at 2:58 PM\ngreat game one problem\n\nso the game is great except that there are random times where the visual cuts out during the fight but the fight still continues which really sucks so if you could please fix it but other than that its really good\n\nHelpful | 0", "doreetosJul 14 at 2:11 PM\nI want a non slow mo KO option\n\nThe game is pretty good overall, my problems are that i have issues blocking against some characters, they punch straight through me. Also, i like Non Slowmo Knockouts waaaayyyy better than Slow mo. Please add an option for it and ill rate it 5 stars\n\nHelpful | 0", "RotuloMay 20 at 11:57 PM\nGreat game ruined by stamina bar\n\nI love everything about this game except for the stamina system. The punches feel great, but after 4-5 punches, my character is breathing heavy and unable to throw a punch.\n\nSo I have to block to regain my stamina. Even by moving around with loco motion my character is out of breath in a few second like a 90 year old. When blocking heavy punches the stamina decreases even more.\n\nAt the end of a match that I might have lost by KO or won by KO but nealy lost, I see that I've landed like 130 punches while the opponent landed like 16 punches. But he won or nearly won only because I can knocked down while my lazy a** character is breathing heavy after 10 seconds of the fight.\n\nPlease devs, make an update either without stamina or with 2-3 times better stamina and this game will become phenomenal. And the workout will become much better.\n\nHelpful | 4", "Jack._.W02Jun 19 at 1:39 PM\nGreat and fun game but not long enough\n\nMaybe if the developer would\nHave you start off with rocky/Apollo or take you through the adventures of Creed II\nWould recommend will work you out.\n\nHelpful | 0", "Leeson1825 days ago\nPretty light on in gameplay\n\nSo in less than 2 hours I completed story mode on normal difficulty. Another 1 to finish on hard. Not much gameplay really. PvP is average at best.\n\nHelpful | 0", "WadokinMay 12 at 7:42 AM\ndisappointing mechanics\n\nBad:\n-in-game hands get tired: seriously? Why can't we disable this, at least in PvP? It's STUP*D that a game that attempts to be a sport simulator, then decides to handicap players in this rude way. I have REAL hands, and they get tired according to REAL-WORLD RULES, not according to your in-game gauge, just ridiculous.\n\n-blocking doesn't work properly: body blocks don't recognize elbow tucked in to block body shots. There are leg shots and groin shots that count as damage, which are illegal in boxing. And even headshots go through a perfect high guard sometimes. Really unresponsive.\n\n-Dodging shots with head movement DOESN'T WORK: I can't slip punches, they all make contact unless I literally DROP TO THE FLOOR, walk sideways or back VASTLY out of range; the hitbox is too big to allow realistic slipping.\n\n-angles: the game constantly resets your viewing angle/position after every round or transition; so you lose your reference point in the room and your desired position, and you have to take off the headset after every round to know where you are and how to reposition the camera AGAIN with the joystick, and by holding the oculus button, to reset view.\n\n-joystick walking: you can't use the joystick with your thumb; instead you have to press 2 buttons and make circles with your hands; which creates a BULLSH*T \"mechanic\" that allows you to fist-roll infinite punches while chasing around really fast, and with great power because your \"body\" is moving.\n\n-The \"staggered\" mechanic feels humiliating: while the game forces you to raise and open your arms like you're being crucified, you have to watch how the oponent uses the fist-rolling \"mechanic\" to hit you with 20 punches in 5 seconds into your face.\n\n\nGood:\n-It has PvP\n\nHelpful | 17", "kurrumJul 28 at 2:14 PM\nNot worth the money\n\nNot very long, beat the game in one sitting, only couple hours not worth the price, the movement is awful too, it's not realistic to stand in front of an opponent and box.\n\nHelpful | 1", "SquadalooMay 30 at 2:00 PM\nLight on Content\n\nThe fighting is alright: I know people have a problem with the stamina system but I don't mind the game forcing you to stop punching for a while and look for an opening.\n\nThe way the game handles training as a montage is a clever and fun idea and uses classic Rocky and Creed music to pump you up.\n\nHowever, I had some weird issues where the world would shift positions mid training or fight where things I'd need to punch were inside me. It wasn't a tracking issue because my guardian never moved.\n\nIf you're a fan of the movies like me, it's worth picking up for under $20. Unfortunately, the lack of content and glitches hold me back from recommending it anyone else for any higher price.\n\nHelpful | 2", "wanchai5Jun 1 at 8:04 PM\nGood game, short content, small bug.\n\nAs title. The small bug is when I cast the game to my Chromecast, the sound is crackled, doesn't happen in my other games. Can't seem to find a way to report this bug to the developer neither on here nor on their website.\n\nHelpful | 0", "jackieboi9000Jul 26 at 4:57 PM\ngood\n\nwow\n\nHelpful | 1", "AttilaT8 days ago\n\nVery difficult to navigate between options and menus.\nNo help!\n\nHelpful | 0", "aaronhryJun 21 at 3:46 PM\nLove Creed, but lacks MP support.\n\nDont get me wrong, I love the Creed movies, especially Michael B Jordan. However this game is merely an attempt at basic boxing mechanics mixed with iconic Creed characters and IP. Im not a big fan of the stamina mechanic, as well as walking with the swinging of my arms when compared to TOTF. What really disappointed me was the fact that the multiplayer mechanic doesnt support two local Oculus Quests under the same FB account. Games like Eleven Table Tennis, Pro Putt, Synth Riders, etc all support local online multiplayer by recognizing the other Quest as an guest account. Would be a 5 star game with that feature implemented to be able to box at home!\n\nHelpful | 0", "SupacalypseMay 28 at 12:03 PM\nPretty darn good and fun\n\nI also play Thrill of the Fight, which is more of a simulator. Then i bought Creed, i wasnt expecting much. But it is very good, online is awesome! I have not experienced any network lag when playing fighting online.\n\nIf you have Thrill of the Fight already, Creed is a must, they go hand in hand.\n\nAnother good purchase.\n\nLets box! Friend me id: Supacalypse\n\nHelpful | 1", "connermacJul 14 at 4:11 PM\nGreat workout\n\nI love this game it really is a workout\n\nHelpful | 0", "SMJJJun 26 at 12:17 PM\nGENDER EQUALITY\n\nAmazing game but I think its missing female fighters because I know some women that would rather play as a women than a man in creed vr.\n\nHelpful | 1", "CrazybortzMay 19 at 6:26 PM\nFun game / classic characters\n\nI bought this at a discount. It is a fun game with good graphics. Play is easy to use and it gets your heart racing. Worth it for your time and to show friends that it takes more then brute strength to win. I would recommend\n\nHelpful | 1", "andrew.serrano.69Jul 13 at 8:41 AM\nCreed\n\nIt was amazing \n\nHelpful | 0", "Nightflame45616 days ago\nGreat game! Almost Perfect...\n\nSimilar to my Thrill of the Fight review (check that out for the full explanation), Creed: Rise to Glory is very different, yet the same.\n\nFor starters, this game has locomotion, but it has a sort of realism to it. The swinging of your arms makes the smooth movement feel like youre actually moving.\n\nOne negative, however. When in campaign training, every new exercise causes my body position to change and distort within my play area, causing me to have to complete tasks outside my boundary.\n\nNow, of course, this is a great game, and I highly recommend it. Great job, devs!\n\nHelpful | 0", "alphawavJul 17 at 10:07 AM\nNot worth it\n\nShoddy physics\nStory worse than the real movie\nMultiplayer awful awful awful.\n\nSorry Devs. U missed the mark w/ ur wild swing\n\nHelpful | 0", "JavalavalayMay 13 at 10:07 PM\nA good workout\n\nCould use some eye tracking towards the trainers and I've come across a glitch during the training sessions. Im put behind the bag or running backwards on the treadmill. Otherwise. Worth your money. And it really does teach boxing in a way.\n\nHelpful | 1", "9TreywayJun 24 at 9:14 PM\nTerrible\n\nIf you dont have a big enough guardian your screwed. I just basically broke one of my fingers. DO NOT BUY THIS GAME UNLESS YOU HAVE A GUARDIAN THATS THE SIZE OF A AIRPORT\n\nHelpful | 3", "Jackyboi234Jul 6 at 9:18 AM\nAmazing\n\nThis is the best fighting game you will find\n\nHelpful | 0", "Nico_LaguzziMar 4 at 9:19 AM\nNeeds more\n\nThis game is amazing dont get me wrong, but the career mode is so short and I want to see more. Sure free play is fun but it would be better if we had a better career mode with add ons to it. The game is amazing thought but also should not cost 30 maybe like 20. Definitely one of the better games on the oculus for sure though.\n\nHelpful | 14", "iGotticJun 5 at 9:17 AM\nSuper buggy and basic\n\nThis is one of the buggiest games I've ever played in my life. My hands teleport away, I can't run sometimes (prevents treadmill, knockdown recovery, and locomotion), sometimes you don't return to your corner at the end of a round, the locomotion goes the wrong direction, hit detection doesn't work, and blocks don't work.\n\nIn addition, the campaign bots are way too stupid. Turning up the difficulty just makes them do more damage it seems.\n\nThe multiplayer needs more support as well. After recording on paper for the last month, almost 85% of people I queue with leave before a round finishes (rage quit normally). There should be a rank system of some sort to prevent this and to get paired with people of similar skill level.\n\nThe only reason I still play this is because I need exercise during break. Thrill of the Fight is a much better game for a much better fight, although it needs multiplayer. If TOTH ever gets multiplayer, I'm ditching this game forever.\n\nHelpful | 2", "starr-07Jul 11 at 1:08 AM\nToo short\n\nLike the game but completed it within an hour.\nNeed to add more fighters to make it value for money.\n\nHelpful | 0", "KaliRA73Jun 6 at 10:42 PM\nJust get Thrill of the Fight\n\nLong story short.\nPros: This has Rocky in it.\n\nCons:\nThrill of the Fight is better in every way.\n\nAll of these games have glitchy tracking but I've had all sorts of problems. It loses track of where you are during the training montages and you can't do them. The fight space is really small so it becomes just stand in place.\nAnd in the end it is only about 5 fights. You can beat it in a day.\n\nHelpful | 0", "KersonsJun 29 at 5:35 AM\nGreat workout!\n\nDont think I have ever had such a hard workout!\n\nHelpful | 0", "GBHSuccessMay 30 at 10:49 AM\nGameplay recording has no audio\n\nI wanted to brag about how I beat Rocky , only to find out that there is no sound of my recorded gameplay. Please fix.\n\nHelpful | 0", "jacqueline.meacherApr 15 at 4:17 AM\nSoo good but one problem\n\nI love this game me and my brother own the app and we love to beat up Ivan drago\n\nThere is one issue, theres not a lot of boxers to play against. I think the game would be great if there was more variety. For example: longer story line, dificulty levels,more boxers to beat up. Thats pretty much it, I personally love the game as I might start boxing just cause of it.\nThank you soo much the developers of the game we all love and look forward to beat up\nPeople\nThank you\n\nHelpful | 3", "kingink444Jun 25 at 5:27 PM\nIt's a banger.\n\nJust make sure you have enough room space to move around , or you will be knocking stuff over.\n\nHelpful | 1", "thejuggsterFeb 12 at 7:51 PM\nNeed more players to beat up\n\nFun game, but kind of short, whooping everyone on champ mode since i trained boxing since i was a teen, its not as realistic as expected but still i can use a pretty legit philly shell stance, i dont think its worth the price point unless there were consistent amount of players to beat, about 20 dollars wouldve been good atm, the game makes me kind of contemplate a refund just because i feel like i wont get enough pvp fights in, but surprisingly i got 2 or 3 after buying the game after that couldnt find none. There is an annoying bug where everything goes black while the game is still goin on, happened to me twice, one in multiplayer and one during a campaign fight, had to do the training again before retrying which was annoying, sound is crackly but i think thats the oculus part of it, cant go live which sucks because i want to stream to my facebook group (dose of reality (virtual unreality). Come join if you want\n\nLeft it as 5 stars because im putting good faith in the devs to fix everything and update the game into the best boxing game, thrill of the fight can be learned from, but that game is way too ez, destroying all the opponents in outclassed mode\n\nAnyone complaining about the stamina just slap boxes or catfights, i like to use up my energy on flurries as well, but thats something u do on TOTF. On creed its best to play acting like youre really boxing, just going wild is silly\n\nAll in all i do hope they create real boxing rules like no double punching head and body at the same time and low blows on creed\n\nOverall the game is fun and you get a good workout whether or not you find the game unappealing after beating it, maybe try learning some stances and learn how to dodge and counter, if you dont have a real bag to beat on irl, use the bob dummy in game and learn some real punching form on youtube or something or a real class and then use your shadowboxing time on vr, im about to play hope to see some matches when im on, whoch reminds me, would be nice to create tourneys and spectate modes, or maybe a ref mode, but that would need a bunch of real boxing rule updates \n\nUpdate*. After playing more online i realized tracking on multiplayer really sucks\nIts like that dream where you punch hard but it s really not, its like the body is hesitating to move with the hands, there also needs a mass multiplier thing like TOTF, got these guys rapid cat pawing me and doing massive damage, and the ones i block destroys your stamina, im trying to box for real but when you get caught with these issues and people who would really get beat up in real life with their lack of fightin skills, it takes the immersion away, in real life these guys scratching fighting like cholos dont do damage, on this game its king...you can easily go through someones guard by cat fighting over the top of their head and just hitting the top really fast, or adv locomotion running holding x and a and hand rolling in circles around them whilst stopping for stamina every burst, its still fun and ive been using it as a workout since i bought it, but the game really needs a PHAT patchup on multiplayer, singleplayer is still great though, they throw actual punches making it more immersive\n\nHelpful | 70", "FloydDelFuegoMay 25 at 3:12 PM\nToo Short For The $\n\nThe game is fine but thats about it. Good graphics, fun gameplay, and a decent workout if that is your kind of thing. The campaign is way too short for how much this game costs though. The developers could easily insert an update to extend the campaign and fix some of the bugs, but it's been a year since the game's release and no such movement, so I don't think they're very interested. Bugs to note are for the controller tracking and sometimes the training sessions appear behind you, or they appear somewhere that they're obviously not supposed to appear. I'd definitely rate the game higher if there were updates to extend the campaign, but I won't hold my breath.\n\nHelpful | 1", "briandnly03Jun 8 at 4:46 PM\nGood game\n\nIts as real as it can get but not worth $33.00 but still a good game\n\nHelpful | 0", "arquetee72Jul 27 at 4:39 PM\nIts good but it needs more story\n\nSo when I got this game it was the best I had ever gotten but when I finished the story mode in like 2 hours I felt kinda sad that it was all over because it was a fun trip but when I figured out you can still train and play with others online that kinda brushed over me so it is sorta good but Ill just give it a 4 out of 5 stars cuz there is like 1-2 hours of story :/\n\nHelpful | 0", "jacob435Jun 28 at 6:59 PM\nCreed\n\nGood workout fun game\n\nHelpful | 0", "BenUSA1May 11 at 8:58 PM\nVery Arcadish and Buggy\n\nI have Thrill of the Fight and CREED. TOTF is SIMULATION, CREED is slapfest. There are some VERY GOOD suggestions by previous reviewers to make this a better game.\nBy the way TOTF is developed by ONE GUY ONLY. NO excuse not able to make this a better game.\n\nDEVELOPERS ARE NOT RESPONSIVE here.\n\nHelpful | 3", "lucas.davidson.14289Jun 14 at 8:26 PM\nThis is very fun\n\nI have had a lot of fun in this game already and I just got it.I highly recommend!\n\nHelpful | 0", "messenger82May 27 at 6:02 AM\nStamina Ruins this Game for Me\n\nI would give this five stars if it werent for the stupid stamina limitations. It was definitely an annoyance as I played through the game, but I dealt with it. But in terms of replayability? I keep going back to TOTF. I would play Creed a whole lot more if I could actually box and rely on my own ability and stamina. I cant tell you how frustrating it is for me to be going to work on my opponent only to see my arms slowly blur across the screen while Im not even close to being tired.\n\nDevelopers: Please, please, PLEASE consider adding the ability to turn the stamina limitations OFF.\n\nHelpful | 1", "Bravo-November7May 6 at 10:36 PM\nGreat workout game with non-stop crashes\n\nThis was a great game and it is a lot of fun, but the game crashes with a black screen constantly on my new Oculus Quest, even with the recent system update. I can't get very far into the ring matches when the screen goes black, but the fight continues on with just the audio. It's the same thing that other reviewers have stated as well. It has been doing this every time I play the game since I purchased it 24 hrs ago. The controllers and headset lockup and I have to reboot the headset each time.\n\nTrust me when I say this game is not worth the final sale price of $33.14. With all the blackout issues, bugs, and glitches, THIS GAME SHOULD BE FREE OR REMOVED COMPLETELY FROM THE OCULUS STORE!!!\n\nAs of now, I will be asking for a full refund and will get \"Thrill of the Fight\" instead. So \"Caveat Emptor!\" Let the buyer beware!\n\nHelpful | 3\nDeveloper ResponseMay 7 at 10:47 AM\n\nHi Bravo-November7, Apologies for this black screen issue you're experiencing with Creed. We believe this issue to be related to some type of corruption during installation. Could you try fully re-installing the Creed app on your Quest, then see if you still experience this problem? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. If you're still experiencing this issue after a re-install, please contact us at support@survios.com!", "TheSharkGunrJul 2 at 5:18 PM\n\nStory is fine but the pvp is annoying because people just spam punching and somehow it still works when out of stam\n\nHelpful | 0", "baller232323Jun 26 at 10:50 PM\nThis game is awsome\n\nIts awsome\n\nHelpful | 0", "usernameMutantJan 27 at 6:50 PM\nGreat game to play but not worth 30$\n\nThis game is almost perfect,I loved playing the first playthrough and it's also a great way to get into shape my only complain and keeps me from leaving a 5 star review are the achievements or unlockables !!!! Nothing else to keep playing for game wise and content wise this game should be 20 bucks not 30 I feel like I over paid and leaves you unsatisfied wanting more gameplay\n\nHelpful | 53", "NeaultyJun 22 at 5:36 PM\nPotential but not there\n\nGood mechanics in game but waaaaay too short for career. Was able to finish in 45minutes. Left me wanting a lot more.\n\nHelpful | 1", "kevin10181Apr 18 at 4:43 PM\nIts a pretty good game\n\nDont get me wrong the game is pretty fun the campaign is pretty short though and stamina is annoying because you run out of it so quickly also please make it so you can actually beat pretty Ricky Conlin in career mode its annoying that every time I fight him all that hard work I put into training just to lose every single time the graphics are pretty good but the people in multiplayer are so annoying like they can literally slap you and they will win the fight but overall its a pretty good game also theres this weird bug it happens with almost every fighter if theres two hits left when you stand them and you hit them at the same time they instantly come back up or some hell they literally dont even go on the Matt I just needed to get that out of the way also I know its going to take a long time but can you at least add a couple new fighters in free play mode the game is getting pretty stale but still its pretty good I know I sound like a Karen but its just it theres some flaws with the game and no I dont Expect a game to be perfect\n\nHelpful | 0", "MythwrynApr 22 at 3:37 PM\nA fun game...but not a good one.\n\nThis game can be incredibly fun at times, but the game mechanics just arent that good. At max difficulty (which wont take too long to get to if you know how to block) the fights can be unfair. You can only be knocked down a limited number of times before the game gives up for you. This can get out of hand when some opponents can knock you to the mat in 2 punches. Not to mention that sometimes you have to block a bunch of the opponents punches, which is fine...when it works. Sometimes you dont even get a chance to block before they start punching which leads to you being knocked to the floor because the game decided that you needed to block a bunch of punches. The stamina system works well on paper. It prevents you from launching unlimited punches, and it can work...but it really doesnt. What makes it not work is that the player is the only one bound by this system. The AI will throw so many punches with little to no break between punches. There are a lot of things stacked against you in this game, but that doesnt stop it from being fun. It is a very fun game, but its flaws can be really annoying sometimes.\n\nHelpful | 3", "williamtutor89Jun 28 at 2:23 PM\nNot worth the money\n\nWe purchased this game for $30 and it constantly blacks out in the middle of the game and you lose any progress youve made. NOT WORTH $30!!!\n\nHelpful | 1", "ShadyBradyAZJun 6 at 6:53 PM\nEpic Workout\n\nI Love this Game.\n5 Minutes and everyone I know is a sweaty mess, Unable to breath but smiling ear to ear.\n\nHelpful | 1", "melendez73May 23 at 7:47 PM\nCool\n\nI like the game. Sometimes I get a black screen that forces me to reset gameplay unfortunately.\n\nHelpful | 0\nDeveloper ResponseJun 1 at 12:45 PM\n\nHi melendez76, Sorry to hear you're experiencing this black screen issue with Creed on your Quest. It's possible this issue may be caused by some type of corruption during installation. Could you try fully reinstalling Creed, then see if you still experience issues with your screen blacking out? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still experiencing this issue!", "Not_AzraelApr 27 at 12:12 AM\nGreat game but needs a better story\n\nThis game is still one of my favourite games to play on my vr. However the story is quite short and the game ended quite quickly. But the game does have a free play mode and also has a pvp mode. You can also do the story all over again on a different difficulty which Im glad is there. But overall this game is definitely worth buying and in my opinion it is a must have game on your vr headset. It is also great for excersise and the graphics are fenominal\n\nHelpful | 0", "Scxligvng6Apr 22 at 2:23 PM\nSingle player ok.. Online terrible\n\nThe overall single player experience is great though short.. maybe not $30 great, but fun anyways.\n\nOnline however.. terrible, from not being able to find a single game to getting constantly barrage slapped by little kids who really think they wouldnt get tombstoned in real life throwing mindless slaps with no form or stance at all.. thing is thats the meta and there is no way to beat it unless you join in and slap faster than them.. hit registration is bad, people use strange blocking stances to be completely untouchable.. if you are looking for anything even REMOTELY close to simulating a real boxing match then do NOT buy for the multiplayer..\n\nHelpful | 4", "LegendHairyMay 25 at 3:00 PM\nGreat game, too expensive.\n\nIts a very fun game! It is based on blocking and dodging. Its a great buy, just not worth the $30. You still wont be disappointed though! 9/10!\n\nHelpful | 0", "Alexa_7426Jul 22 at 11:44 AM\nVery good!\n\nI love this game so much! I loved the demo! When I got the full game I was so happy! So I started the Career but it was so short! All you did was fight Rhino and then someone else and that was it. Thats the only thing I didnt like but free play is literally so amazing!\n\nHelpful | 0", "JohnnyFerroApr 26 at 1:02 PM\nNeeds work\n\nThere is an incredible amount of glitches within this game. It wont save my progress. It starts me off in weird locations as in i am supposed to be standing in front of something like a treadmill or punching bag and it puts me way off to the side. Also, after I have won a match, the opponent continues to throw punches and then It will go from victory to defeat. Has a lot of issues.\n\nHelpful | 3\nDeveloper ResponseApr 27 at 10:15 AM\n\nHey JohnnyFerro, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot the game. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if your progress still isn't saving!", "luis348Apr 13 at 11:46 AM\nGREAT GAME but....\n\nThis game is so great its som much fun and never gets boring but, the stamina should be remove cuz you lose it so quick and also your player should have more health you get knocked out in about 4 or 3 hits! And you have to hit him like 15 times in a row to know them out! If that was fixed and updated then I would rate a five star. But otherwise this game is great!\n\nHelpful | 0", "JohnnyK6Apr 21 at 9:25 PM\nLove this game!\n\nGreat balance of arcade and simulation style boxing with excellent graphics and audio that can really get you amped up. Lots of content in terms of campaign mode, free play, and pvp. The developers really knocked this one home.\n\nMy only and main gripe though. lol the stamina meter. Sure its great so you dont just flail your arms but itd be nice if the developers release an patch that gives you the option to disable it, would make some matches more intense with your buddies if the game can keep up with you. Otherwise though, definitely one of the most fun games on the store and a must buy.\n\nHelpful | 0", "randy.wilson.927Feb 1 at 6:00 PM\n\nI am a pancreatic cancer survivor. Ten months of chemo and surgery have left me 60lbs. lighter and very weak. I bought this to try and regain some strength and build stamina. The Oculus Quest allows me to work out at home without letting people see just how bad of shape I'm in. I hope as time passes the graphics get better but for now I could not be happier. Keep up the good work.\n\nHelpful | 499", "MrsTolliverMay 16 at 8:27 PM\nGreat Game but Glitches\n\nI just purchased this game and it keeps going black in the middle of the game. You can hear the game but cannot see anything. This has happened multiple times where we have to quit and go back in. Seems all the movement is too quick for the VR to keep up with. It is however a good workout and will have you sweating.\n\nHelpful | 1", "Mr.DILLIGAFApr 18 at 6:15 PM\nAmazing Experience\n\nIn my heart this game is a textbook 4 stars, but the 5 star rating is due to that feeling of being at a big venue fight in a movie. You really feel like it. I played some of TOTF and thought the game made you work way too hard for victory that didn't particularly feel like a good payoff. There's unlimited payoff in freeplay as you re-write history and do things like play as Apollo Creed to knock out Ivan Drago. It's all quite an experience.\n\nWith that said, the stamina system is terrible. Some other reviews made it sound like you'd brawl non-stop before you get a stamina warning. Maybe I just punch hard, but it felt like I'd land 4-5 clean shots and then my guy is gassed for the whole round. It's pretty ridiculous.\n\nI agree with reviews about how the game is probably better suited at $20. I assume the higher price is probably because of licensing, but as I said, the experience makes it worth it. TOTF is $10 and didn't really leave a lasting impression.\n\nHelpful | 1", "DreOculusApr 29 at 4:37 PM\nHands Up Off The Charts\n\nAs the rounds go on each fight is more difficult. Great for working up a sweat, and getting some reps in. After three fights had to get some rest and some water. The training sessions are awesome, really gets you ready for a fight in the ring.\n\nHelpful | 0", "CrazyFoxy10518 days ago\nAmazing\n\nIt's like a workout having fun. It's like real boxing except its cinematic. Like you get tired and stuff but it's awesome. Great graphics on the quest and runs very smooth. Free mode is my favorite and career mode is awesome.\n\nHelpful | 0", "rossilliApr 13 at 2:26 PM\nThis is NOT fighting TOO Arcade-like\n\nUnlike Thrill of the Fight, which costs on 9.99, this is NOT a fighting game.\nWhile the training is really fun, the actual fighting is very frustrating. When you are in a career, you are fighting opponents, and rounds randomly go by. When fighting a 12 round fight, rounds went by like it was a montage from the movie, not real rounds of fighting like in Thrill of the Fight. VERY disappointed by this. Not real boxing. If it was, I wouldn't be able to put it down. . . it is not. . . .Unfortunately, I gave it more than 2 hours (trying to fight a live person) and I can't return it. You will buy it, see what I mean, then return it. If you want to box, buy Thrill of the Fight. I LOVE Rocky, this is disappointing.\n\nHelpful | 6", "NO-A17 days ago\nFun Workout, BUT comes with Glitches\n\nAs a fit person, this is fun and still somewhat challenging.\nThe Movie license puts the price tag higher yet its cool to train with Rocky.\n\nNow the downside.\n\nPOSITION TRACKING:\nMaybe it's not common, but it barely recognizes my position during training, which is a major issue. If all goes well I am placed before the punching bag as supposed, but more often I am somewhere else. Like behind or meters away from it unable to finish the training which gives me a low stamina.\n\nSTAMINA: Stamina is not Your own Stamina, and as I understand, Creed builds stamina over the training which then is an issue with the position tracking.\n\nDODGING: Dodging works well in the training, not so much during fights. It's ok half maybe most of the time. But not always.\n\nINTERNET RELIABILITY: Now this is a specific issue, as I am in China, I am connected to a VPN Router otherwise Oculus isn't accessible. Creed doesn't save the game progress if not online. For people like me with an unreliable internet connection it doesn't keep my progress in case I get disconnected froma server. Sometimes I find myself having a great run with the exercises and would like to see if I beat my own record, but like today, I got disconnected and it didn't save my progress. Not Creeds fault... but would be nice if the progress would be cached and synced once online again.\n\n\nHowever if not taking it serious it's a nice exercise and worth playing.\n\nHelpful | 0", "CrystalRanger898May 21 at 5:46 PM\nGreat game\n\nIts really good my only complaint is that there are not enough levels for how much u get but otherwise great game\n\nHelpful | 1", "monkeyman200798Jun 3 at 10:43 PM\nAlways has me sweating after\n\nI\nLove the game it is so fun and its good exercise\n\nHelpful | 0", "RumhouseApr 10 at 10:43 PM\nSolid fun and a good workout\n\nYes. Many complain that the campaign element is too brief. Keep in mind that many quest titles have to be brief.\n\nToo many of us are used to lengthy pc games that run for weeks and months. Remember, these installs are hundreds of gigs, at least.\n\nOculus is about limited gameplay because the overall tech is still in the making.\n\nThis being said, the free play is what sold me. Also, a nice bonus that the lame fighter at the bottom of the pecking order looks so much like my ex gf new meth head bf.\n\nSo yeh. I beat him all night long. Love it. I beat him as Apollo. As rocky. As Drago. Good fun. Great therapy. Life is good.\n\nThe campaign is barely a thing. But the free play makes it worthwhile. Also, the graphics are quite good.\n\nHelpful | 1", "Shatterking420May 23 at 9:08 PM\n\nOne hell of a good game worth the buy and really shows how good the oculus quest is\n\nHelpful | 0", "DementeXDMay 8 at 4:45 PM\nFun\n\nFun game, one of first VR games and it gives yoy a really good workout as well.\n\nHelpful | 1", "RicketyGnu91286May 13 at 2:37 PM\nThis game is great!\n\nCreed: Rise to Glory is one of my favourite vr games. It feels like the boxers are really there but I think it needs more content.\n\nHelpful | 0", "luckykillerApr 5 at 4:28 PM\nCreed\n\nCareer mode is the shortest boxing game I've ever played. Moving is odd and training often causes me to walk out of my safety zone. On a positive note, the game is really cool and a great workout. Probably worth 15 bucks, but it is what it is\n\nHelpful | 1", "idoshatzApr 7 at 3:43 PM\nGood game but one issue\n\nI think its a good game,well graphics and nice excercise. One issue is that after an online match it tend to log out for no reason from the online profile, and somethimes it lose tracking and become black screen. Anyway, i think its a good vr game and you should buy it.\n\nHelpful | 0", "Amini48Mar 28 at 12:24 PM\nI used to box and LOVE this game.\n\nI did a little boxing growing up and am really enjoying this game, a little too much. It's becoming part of my daily gaming (workout?!?) routine. You'd be surprised how tired/worked out you'll feel after a few 6-9 round PVP matches with your friends.\n\nHighly recommend.\n\nHelpful | 2", "CapObliviousMay 14 at 4:35 PM\nIts ok\n\nNot worth $30. The training aspect is pretty good (when it works properly), but the fights are unrealistic and the mechanics arent great. If youre into boxing, go with thrill of the fight.\n\nHelpful | 0", "ethan.kessler.90May 10 at 5:25 PM\nGreat Game!\n\nAmazing Game. Get sore quickly. Let me tell ya that.\n\nHelpful | 0", "Jazza3Apr 8 at 6:04 PM\nPathetic! Do not buy!\n\nThe most boring storyline ever that lasts for 30 mins. you dont have your own stamina which makes no sense. Half the pinches dont even register. champion difficulty is a joke you hit them a thousand times nothing happens but they tap you once and youre knocked out. You dont get rewarded for better punches, a tap is as good as a proper punch . All round pathetic! If you want a real boxing game get thrill of the fight its amazingly realistic for so cheap.\n\nHelpful | 5", "KyrendareMay 14 at 5:30 PM\nCreed is worth it's price.\n\n-Visuals (4*).\n-Sounds and Music (5*).\n-Gameplay (4*).\n-Replay Value (4*).\n-Multiplayer (3*).\n-Price (4*).\n\nHelpful | 0", "mikeeuniceMay 11 at 7:18 PM\nDecent boxing game..\n\nGame was fun....training seems to be glitchy\n\nHelpful | 1", "Redreaper311May 28 at 10:19 AM\nGreat workout!\n\nMy favorite game. Great workout.\n\nHelpful | 0", "singjaiApr 18 at 3:36 PM\nTracker issues\n\nThe jabbing has major tracking issues if you punch too fast making it very difficult to play. Not an issue at all with Thrill of the Fight. Not my controllers considering this is the only game with the issue. Not worth the purchase price at all. If you want a better boxing game, get the other one, its cheaper and much more realistic.\n\nHelpful | 2", "EuanTheBoldJun 24 at 8:01 PM\nMy current favourite Quest game, but...\n\nSo currently this is my favourite thing to play on the quest. It's well-designed, evokes the Rocky and Creed movies in a fun way whilst still being a bit cartoony and not beholden to that aesthetic, and as someone who's super out of shape and hates exercise, actually kept me motivated to push myself. I wanted to win. When Rocky yells at me from the side of the ring to hit harder, I think \"OKAY ROCKY YOU'RE RIGHT\" and immediately start hitting harder. Nothing has ever motivated me to exercise like this game.\n\nHaving played the two Rocky PS2 games, I feel like VR has finally allowed for the perfect Rocky game. It makes sense. Everything works. The gameplay loop of training montages and fights feels satisfying.\n\nBut with all that said: all the other reviews will be telling you this game is too short. They are completely correct. I was wondering to myself when the game would start getting difficult when the career mode came to an anticlimactic halt. It doesn't feel like the story was building to the final fight. There's a \"go the distance\" montage, which felt very Rocky, but wasn't itself the last fight. There's a single character-building street fight, but it stands alone. There's worldbuilding radio discussions in the gym between fights, but I didn't feel like everything combined to form a story.\n\nAnd when I say story, I don't mean I need cutscenes or infodumps or for the pace to grind to a halt. But even in the Punch Out games, you can feel that there's an arc. A slow build of the strength of your opponents, until you face off with the best of the best. The Mike Tyson. The Mr. Sandman. You don't feel this in Creed. The boxers are fairly distinct, but not memorably so.\n\nAs for the post-game content, there's a PVP online mode (can't speak to it since my internet connection is terrible so I haven't tried it) and a freeplay mode with a selection of Rocky characters. Not as many as the PS2 games, no fun includes like Mickey and the Rocky statue, but you can play as Rocky and Clubber Lang and Drago so I'm not complaining. What I do think would be a worthwhile and fairly low effort update though would be to add a mode, like Punch Out (or Mortal Kombat, or Street Fighter's classic mode,) where you work your way through the already fully-designed opponents. That would drastically raise the replayability. If Freeplay mode meant choosing a character and then the game had me fight enough characters to last me a session, culminating in the natural rival for the character I chose (ie. Rocky for the Rocky antagonists, Creed for the Creed ones, Apollo for Rocky, etc.,) I would have no complaints.\n\nSo yeah, if Creed 3 happens or there's some extraordinary circumstances whereby the devs have a reason to patch this game, add that mode please!\n\nHelpful | 0", "geoffreylee716Mar 14 at 10:15 AM\nAwesome game 4 out 5 stars because...\n\nWell.. it's awesome game and I love the Rocky movies! I bought them all on Blu-ray! Would love to buy them all on my quest if.. I could watch them while off line. Not sure how? Email me at dieselbuff463@yahoo.com On to the Creed vr game.. it's almost perfect! The game needs Tommy Gunn and few other characters it's missing. Plus it should run the stamina like ..thrill of the fight. I hate it when I can throw punches and my character can't!!!!!! More arenas and real street fight mode like in rocky 5. Plus different versions of Rocky and Apollo. Plus the rings and arenas they fought in. Would love to train in Russia or LA after clubber loss. Or do the training Adonis did in desert with sludge hammer, toe to toe in tire etc. Or rocky lifting people in wheel barrow and chopping wood. I would pay $80 to have this! While at it let's do real RAMBO GAME ..from the first getting pushed by cops to him ripping out the heart of head of sex traffictor guy who took his niece. Please make this happen. Any questions email at dieselbuff463@yahoo.com\n\nHelpful | 1", "jelwellApr 17 at 9:23 AM\nBuggy and short\n\nOften I'll find, during training, that I am behind or to the side of the punching bag. Which means I can't hit the targets. Once you end up in this position you are screwed for the entire training session. You'll miss every single exercise. And there doesn't appear to be a way to redo your training once you've completed it once. Sure you can go and play with each individual exercise, but Rocky Balboa only offers you the option to go into the ring at that point. I took some screenshots in game. It's pretty bad and the walking mechanic won't let you get back into focus. Physically walking around might work but every time it happened to me I'd already be at the edge of my Guardian. Which means I'd have to walk through my wall. I have about a 8 foot by 6 foot playing area.\n\nSecondly, I beat the Career game in about 1 hour on Easy mode. I was not trying to speed run this game. I was hoping to enjoy it for a while. That's pretty short... I will go back and play it on Normal mode - but hopefully we'll see some fixes before I give it another go.\n\nHelpful | 0", "DiggyP89Mar 28 at 10:28 PM\nFantastic game play but short campaign\n\nThis game was definitely one Ill revisit but the campaign was way too short\n\nTraining is fun theres a hand full of things to mess around with in the gym which was cool\n\nDefinitely worth trying out hopefully there will be a patch so you dont spawn out of range when transitioning between activities when training for fights other than that no complaints about the game play or mechanics id just like to see more lol but I can say that about every game on the quest \n\nHelpful | 1", "Billy.The.BobletJul 4 at 10:51 AM\nVery good\n\nIts a really good game with a good story and you could get a good workout out of it. The only thing I would change is the fact that you have to control your stamina in game when you already have to do it irl and it gets kinda annoying at times. The other thing I would change is the price but luckily I got it on sale so yeah.\n\nHelpful | 0", "henry.delaneyJan 8 at 6:26 AM\nLove it.\n\nOne of the main reasons I purchased the Oculus was to try and be more active while still enjoying my favorite hobby. Creed is a great way to get 45 min of cardio. That said, the experience is what you make it. If you throw hard punches, throw them like you are actually shadow boxing, you'll throw a 100 punches in a match and you'll be good and gassed. Cool graphics, immersive, just a lot of fun. I think the negative reviews from folk about this game come from people trying to be \"good at the game\" and not just living into the experience. If you play along with the game and go hard, it's super fun.\n\nHelpful | 47", "kiteboard44Nov 30 at 4:48 PM\nStamina\n\nPlease add a option in your next update for unlimited stamina. I think the game is amazing and I find myself using it for my daily workouts. Ive been boxing for about an hour a day. The frustrating part being the boxer tires quickly in the game and Im not tired. You should be able to chose stamina modes. It would give you a much better workout.\n\nHelpful | 416", "drjay212119 days ago\nHighly addictive!\n\nI love this game! Its a great form of exercise and entertainment for family gatherings. Graphics are great as well!\n\nHelpful | 1", "itamar.love.5Apr 16 at 3:53 AM\nGreat workup and lots of fun\n\nI enjoyed the demo very much and downloaded the app, its great!\nA lot of fun and you do sport while having fun... Seriously, I break a lot of sweat doing it.\n\nHighly recommended\n\nHelpful | 1", "eclipse1099Mar 7 at 8:46 PM\nThis is perfect\n\nSo I got this app after trying the demo and to my surprise, you can work up quite a sweat doing it. This is a big step towards getting healthier for me or anyone who is, not to be rude, a big boned gamer. This deserves 10 instead of 5 stars for how good it is. Ive only started playing it today and the story is great so far. 10/10 greatest game on the OCULUS store besides Vader.\n\nHelpful | 2", "chingiuApr 2 at 2:05 AM\nFantastic\n\nI have been boxing for 15 years a King box teacher and I can tell myself that really real is beautiful fantastic advice for those who cannot go to the gym and train at home\n\nHelpful | 2", "DAVE.PNGJun 28 at 2:16 AM\nGodly Game\n\nFor being a game reviewer, this is a really rare sight for me to rate this game as godly! However, this game is amazing in more than one simple way.\n\n The graphics are outstanding!\n The story placed in career is short, but astonishing\n Multiplayer modes system\n Sound design and voice acting is pretty amazing!\n Character stats are accurate, but also useful for people who have different likings. Such as more stamina? More defense? Or more damage?\n\n\nThis game is very lucky to receive this review, a godly review placed my a game reviewer like me is highly rare. Basically legendary type. There are a few suggestions I shall note however.\n\n Multiplayer skins: customizable trousers and gloves, nicknames, other stuff\n The games play area to be removed, so the Oculus play area is the only play area being used\n More minigames\n Fight the coaches\n More characters\n\n\nThats all I have so far! Congrats on receiving a godly review, wish you luck in the future and future development\n\nHelpful | 0", "CassandraCollinsApr 4 at 4:41 PM\nCass\n\nThe game is fun but not worth the price. My kids enjoy playing it but they complain about how short the fights are. I expected more due to the name of the game and due to the price of the game. I will try a different fighting game.\n\nHelpful | 2", "da.bot12345678901Apr 3 at 12:28 PM\nRepetitive\n\nFun game but needs mor things to do and people to beat. It can get repetitive\n\nHelpful | 2", "Santucci33Apr 28 at 3:21 PM\nGreat workout\n\nGame glitches you may end up with a long as arm stretched out outside the boundary area. Your body never looks balanced. But all in all I still love the game and the workout I get from it.\n\nHelpful | 0", "miindzJun 1 at 8:00 AM\nGood but short\n\nIts a good game but way overpriced for the litoe content you get\n\nHelpful | 0", "netchellsApr 8 at 3:36 PM\nGame is fun... when it works\n\nI've had this game go completely black on me in the middle of fights several times. I am unable to use my controllers and have to completely reset the device from the headset. So very frustrating.\n\nHelpful | 4\nDeveloper ResponseApr 10 at 10:20 AM\n\nHi netchells, Apologies for this black screen issue you're experiencing with Creed. Could you try fully re-installing the Creed app on your Quest, then see if you still experience this issue? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. If you're still experiencing this issue after a re-install, please contact us at support@survios.com!", "MaXiMuM-VMay 19 at 9:20 AM\nFix the recording and streaming audio\n\nNothing but crackle ir dropouts, Besides that I would have rated higher.\n\nHelpful | 0", "fpb1677Apr 26 at 2:04 AM\nTop notch\n\nMy only problem with this game is I get too hard by Rocky. I get too tired, as happens to the best of us...\n\nHelpful | 0", "garypoundsApr 3 at 2:05 PM\nThis game is just ok\n\nThe graphics, visuals and voice overs are great in this game. But the physics, realism and overall performance are just God awful compared to thrill of the fight. If there was a game that had thrill of the fights physics and game engine, and these graphics, it's be the perfect boxing game. I've worn 16 oz gloves for almost twenty years. It should feel like my fists are a full foot from where my actual hands are. Should have consulted an actual boxer.\n\nHelpful | 1", "rhino_0902Feb 21 at 10:20 AM\nThis game is so fun !!!!\n\nIm a swimmer not a boxer. I want to be a boxer but I just dont have time,this game gives you a lot of exercise.\n\nThere is a couple of things they need to improve on you cant save your progress in the career so lets say you go to play a different game then you go back into creed you have to do the whole career again!!\n\nFree play is my favourite part of the game .You can fight Ivan drago and victor drago,also you can pick your character like my favourite character to be is Apollo creed .\n\nThe characters are way to easy to beat even Ivan drago is way to beat !!\n\nHope you like playing this game.\n\nHelpful | 4", "GavinyoyodudeApr 14 at 3:12 PM\nGreat\n\nJust one concern, could you make it more obvious on how to get back to the menu.\n\nHelpful | 0", "JLGamerkidMar 25 at 11:34 AM\nSoooo gooood\n\nI love this game. No matter how many times i fight Ivan Drago. I cant stop playing it. So many good opportunities to start a real career and it has gotten me to start boxing myself. Dont care what other people say, this game is definitely worth it.\n\nHelpful | 1", "MDavidson68Apr 22 at 9:10 PM\nGreat graphics but short game\n\nI was blown away how realistic it is. However the career mode does not last long. Seems like its just a few fights and you beat the game. Kinda a waste of money IMO.\n\nHelpful | 2", "Szechaun_SauZeFeb 20 at 7:14 PM\nNeeds left handed mode\n\nMy dad loves boxing, and when I got this headset I was ecstatic to show him this game. He loves it, and he plays it all the time. It is perfect, because it is a great workout and he doesnt have to drive 20 minutes to the gym. Overall we are extremely satisfied with this game, but my dad would like a lefty mode, because the offensive drills in the gym are supposedly set up for righties.\n\nHelpful | 3", "SeanSniperFeb 22 at 7:29 AM\nFix the Stamnia\n\nThis is a good game but the Stamina pausing is so very annoying it almost makes you not want to play. There should be an option to turn it on or off in settings. If you are in decent shape you dont need this game making you stop or slow down all of the time. Also sometimes your gloves will be out of sync with your controller. Very frustrating, especially when you are getting your butt kicked. Otherwise a good game. If those were fixed I would give it 5 stars. Seems like it should be an easy update to add.\n\nHelpful | 9", "OqUlUsQuEsTApr 9 at 2:58 PM\nFun\n\nYou get to beat the s**t out of people and you may not realize it but when you're playing your shadow boxing which is a good exercise while having fun playing a game in vr\n\nHelpful | 1", "Ray_RomanoMay 9 at 2:50 PM\nGreat, tad expensive\n\nGood game, and realistic boxing simulator. However, I think $20 would be a much better price. I do think this is better than Thrill Of The Fight.\n\nHelpful | 0", "Y_BeastMar 28 at 8:51 AM\nWorkout mode is good but fighting is bad\n\nI am a professional boxer for 2 years and the game is fun doing bag wok but when it comes to the fights the mechanics are not realistic. When you throw a strong cross it does not affect them and sometimes your wrist bends on impact. Also the moving mechanics are severely flawed.\n\nHelpful | 2", "marc2978Jul 24 at 12:33 PM\nGood game\n\nGood game after the demo I purchased the game.. defo enjoyed it. Certainly keep you active and entertained. Definitely recommend\n\nHelpful | 0", "JustNagatoApr 2 at 4:47 PM\nShort but so good\n\nThe fighting mechanism is so well made and the different gamemodes makes it even better in a bit ill be fighting my friend\n\nHelpful | 2", "WildwestbaconFeb 26 at 5:36 PM\nGreat Game\n\nI truly appreciate the attention to detail in this game. Whether it be the little tapping sounds when grazing your gloves on an object or the bloody face you create. Originally I did not know this was multiplayer and when I discovered that I was so very excited and I immediately played it, since then I have loved this game and I am awaiting my friends to purchase it so we can play it together. The only problem I have had while playing this game is simple tracking issues such as being off centered in the play area or some swings not being registered other than that this is a lovely game and I would definitely suggest it.\n\nHelpful | 2", "marie.watkins.902Apr 12 at 11:59 AM\n\nLove this game, it is such a great workout but make sure you have plenty of room and nothing fragile nearby it can get quite intense \n\nHelpful | 1", "BillTylerApr 12 at 5:42 AM\nGreat game\n\nLove it . Surprisingly good work out and Im in decent shape\n\nHelpful | 2", "E1973kiaApr 1 at 11:48 PM\nCreed\n\nI love this boxing game overall but how do you get the (?) Fighter on this game p.s. great way to get good exercise\n\nHelpful | 0", "HongkeySamApr 27 at 4:15 AM\nIt worths every cent. Good execrise\n\nThis is really good and realistic boxing action game. Love it\n\nHelpful | 0", "MacAPie-YT18 days ago\n\nIm a real boxer this game trackes your strength\n\nHelpful | 0", "GroundzeroHWApr 1 at 2:02 PM\nWish I could still refund\n\n- Guardian system not working properly (was hitting my TV once)\n- Glitchy (sometimes you are 10 foot above the ground)\n- Stamina system sucks\n- Campaign ist frustrating\n\nOverall Thrill of the fight is much better and much more fun.\n\nHelpful | 3", "MegaOofApr 18 at 1:12 AM\nJsut buy it\n\nPlrase its a good game. Worth 50 dollars everything eorks perfectly. Very nice and good. Very exercise\n\nHelpful | 1", "presston.gabel.7Feb 7 at 6:57 PM\nFun Game\n\nReally fun game, especially since I am a huge Rocky/Creed fan. The only thing that gets me is that during the fights, the stadiums aren't full. Not sure why they didnt take the time to fill in the stands. I hope the updates have the fights from the second movie. All in all it's a lot of fun and worth the 30 bucks.\n\nHelpful | 2", "mikesbizzareescapadeMay 5 at 1:25 PM\nGreat game\n\nGood game\n\nHelpful | 0", "tmolsenApr 11 at 1:50 PM\nAmazing workout!\n\nAs a part of my daily training 30 mins in Creed gives me about 400kcal burn! Fantastic game with good graphocs and fun to play!\n\nHelpful | 1", "dboy9600Mar 25 at 12:22 PM\nDisappointed\n\nThe game was cool but really short beat it too fast now its for free if you buy football for 11.99 I believe I was overcharged for The boxing!! from now on just wait one month after the release of the game the prices will always go down# fact. No I have waste of space in my oculus please make a way to sell back games Ill get some kind of credit!!\n\nHelpful | 2", "Denervation721Feb 21 at 7:03 AM\nGAMES IS AMAZINGLY FUN AND NOSTALGIC\n\nThe fights, the characters, the arenas and the fighting engine makes the game feel real to me and i watched creed 1 and 2 and im finishing all the rocky movies and i gotta say, the movies make you wanna play the game and fight just like Rocky, Apollo, Adonis, Ivan and other iconic boxers in the movies. BUY THIS GAME IF YOU ARE A HUGE ROCKY/CREED FAN. The game never gets boring to me.\n\nHelpful | 2", "SwooschMay 11 at 11:28 AM\nThrill of the fight is waaaaaay better\n\nOnly bought this sh*t game for PvP which doesnt even work good. Too expensive for its content.\n\nHelpful | 1", "AsgharAghaApr 28 at 8:20 AM\nLots of fun\n\nGreat workout while having fun\n\nHelpful | 0", "XxShield42xX16 days ago\nCreed is the best\n\nBest game ever\n\nHelpful | 0", "freddie.greenMar 7 at 10:27 AM\nBest game\n\nI love this game but during the training bits it would put me behind were I was meant to be so I couldnt do most of them\n\nHelpful | 2", "JusMonikaFeb 7 at 4:01 AM\nReally Fun\n\nI found Creed to be fun. I liked it more than TOTF. I liked how moving worked, punching worked, and how it felt to win. Being knocked down felt somewhat of a challenge but It wasnt physically draining and I liked the stamina mechanic and how you need to wait so you dont just punch and dont block.\n\nHelpful | 3", "johngmooreMay 22 at 10:35 AM\nCreed\n\nApp continually crashes every time.\n\nHelpful | 0\nDeveloper ResponseJun 1 at 12:40 PM\n\nHey johngmoore, Sorry to hear you're experiencing this crashing issue with the Creed app on your Quest. Could you try fully re-installing Creed, then see if you still experience this crashing problem? - To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. If the crashing persists, please contact us at support@survios.com so we can further troubleshoot!", "lfk0044Feb 16 at 6:01 AM\nA workout\n\nI suggest this game no matter what. Im not sure if its worth thirty dollars but I love boxing. Although there should be a way to turn off stamina. Great game overall\n\nHelpful | 3", "TheTurbo75Jun 21 at 6:31 PM\nGood game.\n\nThe games great but sometimes in training the game gets confused where you are and you cant do the objective, also the career mode is way to short.\n\nHelpful | 0", "Korb1nda11asFeb 19 at 9:43 AM\nPunching too fast?\n\nAnyone else knocked something loose in their controllers just by shadow boxing on this game. I never hit anything but air, but the constant punching motion has jarred something loose in both controllers. The Quest joysticks cannot handle this game.\nGave it 5 stars on PSVR because it didnt break my controllers, but now Im about to be out another $130 just so the clacking inside my joysticks stops.\n\nHelpful | 6", "erik.overland.5Jul 4 at 2:07 PM\nGreat game!!!\n\nJust got done playing for first time with a friend. We both are exhausted from our fights! Ill likely lose a lot of weight playing this game, great workout.\n\nHelpful | 1", "3DpyroApr 7 at 2:54 AM\nGood\n\nIt maces me taller and dat is a bad thing cus i cante dodge punches... but its stil lots of fun\n\nHelpful | 1", "BalooDaaBearApr 12 at 7:17 PM\nSupa cool\n\nThis game is supa cool. I want more career mode. Still really fun though\n\nHelpful | 1", "Astroboy_MonsterHighJun 29 at 8:33 AM\nThis is VR!!!\n\nInstant favourite game. It's almost realistic, minus the pain. I play this game right after my workout so I can get some good cardio. And best of all, it is online multiplayer.\n\nHelpful | 0", "Dark_Knight_Mar 7 at 11:15 AM\nGreat game\n\nMe and my friend play and fight each other a lot and even with me being weaker and less good of a boxer I still have a chance its a great game over all and I would recommend\n\nHelpful | 2", "jayph72Mar 14 at 11:13 PM\nRandy. Wilson.927\n\nBest to you in your recovery and quest adventures. Inspiration can be found in the most unexpected places in life. Blessings on you sir\n\nHelpful | 1", "JboltleFeb 10 at 5:04 PM\nThis is exquisite and supurfulous but...\n\nThis game is one of the best quest games out there. Although it would be good for you to be able to fight vs AI while in a que for an actual pve game. They should also have it so that if your opponent doesnt choose a map for you to play on, it is AI chosen as a random map. This prevents toxic kids/adults to take up all of your time. They also should do this for characters. (Another soloution) they should make a timer for champions where you cant take over 30 seconds to choose a champion and a map. The most difficult AI is too easy. I can knock them out within 4 minutes. This Game is excellent overall.\n\nHelpful | 1", "DyNaMiTe-KiDApr 25 at 2:00 AM\nCareer mode sucks\n\nI knocked down conlon 3 or 4 times each fight but never win. Then one more fight and career mode is over?! What is that crap?\n\nHelpful | 3\nDeveloper ResponseApr 28 at 11:23 AM\n\nHey DyNaMiTe-KiD, It sounds like the Conlan fight is actually working as intended. For this specific fight: You have to survive all 12 rounds to complete this part of the campaign, and the quick cuts to each round is actually by design. Apologies for any confusion on this. Please contact us at support@survios.com if you have any questions!", "sean.boguniaFeb 17 at 10:18 PM\nLove it!!\n\nWhat a work out!\nI was sweating and my muscles were sore.\nIm a big Rocky fan and this game is really fun to play if you want to lose a little weight play it for 30 minutes a day.\nIts better than going to the gym!\n\nHelpful | 3", "BradyTheBeastJul 23 at 10:20 AM\nGreat game\n\nGreat game if you love boxing and the movies\n\nHelpful | 0", "asian_beetlejuiceJul 8 at 7:39 PM\nTo short\n\nGame game is to short but super fun I love the game very much and I think you should get it if you dont have it \n\nHelpful | 0", "I_Have_ToesMar 8 at 10:09 AM\nGameplay is good\n\nGameplay is good but the campaign is short. Only took me like 4 hours to complete\n\nHelpful | 2", "diggygibsonJun 26 at 11:36 AM\nDisappointed\n\nI am very disappointed at this game. The story line is ok, but the boxing portion lacks something. You throw 3 or 4 punches and your player gets tired. Also, there was a time when I was fast forwarded through 12 rounds of fighting. I would through 2 punches and next thing you know, I am in round 12. My boxer would sometimes be turned backwards while my opponent would continue to hit my player, assuming in the back of the head. I enjoyed the training but the actual boxing matches are pretty unengaging. I wish Creed would have adopted, \"Thrill of the Fight\" methods for boxing. I guess what I am saying is, if you enjoy boxing then this is not the game for you.\n\nHelpful | 0", "MaxvzlaJan 25 at 12:50 PM\nMy experience\n\nWhen I first started, I knew straight from the get go that it was going to be hard. I even played the demo to see how the game was like. Anyway, the experience was really fun. I actually sweat and it has a lot to do with your muscles. This game is what I call virtual reality\n\nHelpful | 2", "Husker1224Jan 25 at 8:38 PM\nFun, but feels incomplete\n\nIf you enjoy boxing or the Rocky movies then you will enjoy this game. Obviously check the demo out first to see if it is a game you would be interested in. The mechanics feel like you are boxing and the characters are iconic. Wish there were more iconic stadiums/boxing rings! This game is fun but something just seems lacking, especially for 40$. Hopefully future updates will make the game have more depth and worth it.\n\nHelpful | 5", "JaxPHFeb 2 at 3:48 PM\nAmazing!\n\nIts a super fun challenging game! First you have freeplay, where you have all the characters from all of the rocky movies and creed movies! 2nd is the story mode you start off as Adonis Creed and as you got on you play on your coach will be rocky! The game is a little glitchy from time to time but it really doesnt effect anything. Multiplayer or Online PvP, Its really fun fighting my friends or my siblings with this game and then we really see who is the champion you fight other players and its really cool!\n\n\nSide Note: Its a little hard\n\nI RECOMMEND THIS GAME! ( only if your into boxing )\n\nHelpful | 2", "lawn_boyMar 7 at 3:20 AM\n\nYou can't play with friends unless they have Facebook\n\nHelpful | 1", "cookjmApr 6 at 7:00 PM\nFun game\n\nThis game is a lot of fun. Good to move around with.\n\nHelpful | 1", "DA_BEST_Apr 29 at 4:29 AM\nGood game but need more people to fight\n\n5 people isnt enough\n\nHelpful | 1", "ZombieSlager1424Feb 6 at 7:44 AM\nGreat job\n\nI say it was worth the price and worth the time because it's good for building stamina and other things because it's one good workout each time you play when it comes to the exercises they can help you build specific stats like my personal favorite is the double dodge bag\n\nHelpful | 2", "frofflexMar 20 at 1:18 PM\nGreat workout\n\nThis game is incredible I finished the story mode and was sweating by the end of it 10/10 would recommend this too any boxing fans\n\nHelpful | 1", "WaffleManGuyMar 25 at 6:23 PM\nGood game\n\nRealistic boxing experience\n\nHelpful | 0", "Abood1851Apr 10 at 1:25 PM\nBest game for Exercise\n\nBest game in the world\n\nHelpful | 1", "AirtightEagle38Jan 29 at 6:34 PM\nGood, but wish there was more.\n\nWhen I first got this game, I was super excited. I loaded in and started the career, but after a few minutes, I had already finished the career. The only other options besides for career were online play, which I could never find a match for, and FreePlay, which is playing against an AI, which you can just do in the demo. The campaign doesnt have much replayability, as far as I can tell. Im going to try the other difficulties on career, but for now, I say it isnt worth 30$ if they lowered the price to 20, it would be worth it.\n\nHelpful | 1", "xb0wMar 4 at 3:51 PM\nBest workout\n\nMe and my 4yo can't have enough of this game (both highly competitive:) )...highly fun and gives you all the workout you need.\n\nHelpful | 2", "MasterRDC13Mar 4 at 2:17 PM\nAmazing\n\nSuper awesome and really fun. Super realistic too. The career mode is also insanely cool. I have no problems with the game.\n\nHelpful | 2", "jacob.caudle.50Mar 9 at 4:24 AM\nGREAT GAME!!\n\nI love to play this game! I can fight people from the Rocky movies and its a great workout!\n\nHelpful | 2", "CMCosMicFeb 23 at 8:13 PM\nLove the movie, Love the game\n\nSuch a great workout and everything! Even though at times training gets weird and sometimes you don't know why you lost a fight, it still makes up for it in other ways.\n\nHelpful | 2", "fishnipps13Mar 28 at 12:34 AM\nGreat game\n\nI dont usually like games where you need to move a lot but this is fun \n\nHelpful | 1", "iCyCMar 17 at 9:34 PM\nMust have app\n\nAwesome game. No joke. One of the best made so far. Besides the star wars ones, but they are a different kind of experience\n\nHelpful | 1", "Derezzed22May 22 at 5:16 AM\nCreed for the win\n\nWow such a fun experience for a rocky fan. I cancelled my gym membership now that I am literally building up a sweat in the be gym for me just hitting the bags made this worth it. But add rocky legends and it's a dream come true to go toe to toe with the greats from the Rocky franchise.\n\nHelpful | 0", "chemicaldude543Jan 26 at 10:15 AM\nThis game is amazing but\n\nThe game is fun but the thing that most people are crying about is stamina the reason stamina is a thing is because the devs don't want people to only throw a fury of punches they want you to block Dodge and stuff like that too but it the stamina issue is to much for you then just go play thrill of the fight it's also a pretty fun game but does not have stamina\n\nHelpful | 1", "Markdeniro100Mar 18 at 6:41 PM\nGreat workout\n\nCREED is intense! You think you have stamina ? This game will test just how much you can take. What a work out!!!!\n\nHelpful | 1", "LinkmantaylorApr 3 at 7:18 PM\nGreat game, Super fun!\n\nAlways have a good time playing it\n\nHelpful | 1", "nikkovvJul 9 at 5:46 PM\n\nOne of the best vr games I have ever played\n\nHelpful | 0", "konovalov1988Jul 5 at 9:51 AM\nbest boxing game in vr\n\nafter playing the demo bought without thinking 10 out of 10\n\nHelpful | 0", "ddizzyJun 28 at 12:33 PM\nCreed\n\nBest fighter game ever absolutely love this game graphics are stunning i recommend this game\n\nHelpful | 0", "NateThePlateFeb 15 at 7:03 PM\nMiltiplayer\n\nWhen I was playing against my friend it was REALLY LAGGY but besides that it was superb just trying to sound fancy everything in the game is amazing but dont buy it just for multiplayer\n\nHelpful | 1", "kmatt.coyleJul 13 at 9:00 PM\nLove it!! Gets me going!\n\nGet pumped up!\n\nHelpful | 0", "stormhunter63Feb 24 at 2:46 PM\nNice game.\n\nI think this game rocks. Love the graphics, game play. I'm doing the challenge and the story line is pretty good. I am enjoying this game.\n\nHelpful | 1", "ant5581Mar 21 at 3:23 PM\nGreat boxing game\n\nI have recently got creed and loved it. The story has a decent length for a quest game.\n\nHelpful | 1", "hsrogers07Feb 22 at 1:50 PM\nWorth it\n\nThis game is super fun and super worth it. Not only is it very fun everyone enjoys it in my family and its a great work out. I highly recommend it.\n\nHelpful | 2", "hushpadMay 4 at 7:59 PM\nCreed\n\nFun game, kids love it. Only problem is when\nswitching players, their relative size will be wrong and smaller kids are to short to reach the circles to continue. Im sure its an easy fix, but we just got oculus 2 weeks ago and dont know how to adjust in the game.\n\nHelpful | 0", "timc8984Mar 27 at 6:16 PM\nGreat workout\n\nI only wish I could feel the hits more. Lol\n\nHelpful | 1", "dbviper62Feb 2 at 9:14 PM\nCreed\n\nThis game is great. Its a fun way to get a good workout. If you could add different stamina choices it would be much better because the boxer gets tired before I do. Other than that the game is great and a fun way to get active.\n\nHelpful | 2", "joshua_bernsteinJan 30 at 4:01 AM\nGreat! But want more\n\nI love this vr game it was fun and awesome but it felt short or quick. I had fun but you can only do so much. I even play the hardest difficulty and while yes it was fun and challenging but after I felt okay not excited to play again and again\n\nHelpful | 1", "Stinkfist44May 26 at 3:58 AM\nMy favorite boxing game\n\nIve played all the boxing games available on the quest and this one is the most fun. When I need a quick workout I play thrill of the fight. But if I have more time to play and actually want to enjoy my workout I play this.\n\nHelpful | 0", "SansBoi123Jun 13 at 11:58 AM\nOne issue\n\nIt just needs more stadiums. Other than that it is perfect\n\nHelpful | 0", "rabksajJan 17 at 4:35 PM\nGreat game but very glitchy multiplayer\n\nWow what an experience this game is . Feels great when you win a heart pounding match. The in game gym training could be better when training with Rocky the padwork seems not right and slow but main issues I am having is the multiplayer PVP mode it's hard to find anybody available but when you eventually do the opponent is all messed up and all he is doing is weird moves twitching and twisting in various ways but myself is fine. Please fix this problem. Thanks\n\nHelpful | 1", "JMA8Mar 16 at 9:56 AM\n\nGames awesome. Well done graphics and explains how to play with easy instructions\n\nHelpful | 1", "AdalbertoG.Apr 17 at 11:13 AM\nSound is horrible\n\nCan hear good sound when playing and casting sound horrible\n\nHelpful | 1", "Studt2008Mar 22 at 9:21 PM\nEpic\n\nIt's so good because it's a good workout\n\nHelpful | 1", "htsOct 23 at 6:20 PM\nNeeds ability to turn off stamina\n\nGreat game but if only there was a way to turn off stamina. I've heard the argument that with no stamina you'll be swinging wildly and that's unrealistic, but why not just let people switch it on or off and let them choose? It could be such a good cardio work out but having to pause every couple seconds really tones down the intensity.\n\nHelpful | 138", "Maktoxic076Jun 27 at 11:53 AM\nI love this game\n\nThis is a great game. Keep up the good work.\n\nHelpful | 0", "Macs_in_VRMar 28 at 12:14 PM\nbest game i have\n\n^^^\n\nHelpful | 1", "Bear6262Jan 11 at 6:56 PM\nVery fun game.\n\nEverything about it is great. Very few issues. The only ones I have so far are that in the Freeplay you can choose who you are but seemingly can't choose who you fight which seems quite odd. I could have just missed the option. Otherwise the only thing I'll say is that it helps to have as big a space as possible for movement although it works perfectly fine if you don't have a boxing ring size space to work with. Great for fans of the Rocky and creed series.\n\nHelpful | 1", "goduejovalJun 12 at 12:28 PM\nCreed\n\nGood graphics, good entertainment\n\nHelpful | 0", "marcos.cornelio.12Feb 13 at 12:44 AM\nGreat game but stamina too short\n\nLove the game love the concept. Great way to get some exercise in. However.. the stamina is way too short when fighting your opponent. It would be great if you gave us a little bit for stamina. Also give us a hard mode where our opponents would be extremely hard to beat because of their strength and speed but we would have unlimited stamina because at times Im not tired but my character is.\n\nHelpful | 1", "JudeVRMay 4 at 11:03 AM\nGET THIS GAME\n\nI got this game so I could get a bit of a workout while in vr not only did I get a workout i had a blast the graphics and audio were Amazing and this is a must have for any headset it supported and if your hands move from your glove you just lost stamina and need move your hand I front of your face but it is not annoying anyway\n\nHelpful | 0", "epicsquirrel123Mar 25 at 7:13 AM\nGood\n\nGood\n\nHelpful | 1", "Hello_PeoplesJun 26 at 12:19 PM\nGood game\n\nVery good game and very tiring\n\nHelpful | 0", "Hurcules_0615Apr 17 at 2:49 PM\nI LOVE IT,but you see\n\nI really like it its amazing its fun and it helps me exercise more even tho I dont need it its awesome, but you see I would like if in free play you could make you own character or if you could please make a mode were you could use only fist or maybe 2v2 or 1v2, but I love the game over all cause its crafics are perfect and its really fun any way thanks .\n\nHelpful | 0", "lethargicrhinoJan 12 at 8:21 AM\nWould be 5 if stamina wasn't an issue.\n\nLike other people have said, the stamina issue is sort of what breaks the game. You should be able to have the fighter move the way you do. The AI could also be a little more aggressive if you were to get rid of the artificial stamina.\n\nHelpful | 5", "yekaganJun 25 at 11:27 AM\nAwesome game\n\nSuper fun and a great work out!\n\nHelpful | 0", "Fam4peceJun 17 at 11:10 PM\nCreed\n\nFun game. Allow you to release stress while putting some work-out in.\n\nHelpful | 0", "CrispyCrabNov 30 at 7:42 AM\nA fun (albeit pricey) experience\n\nThis game is very enjoyable. Immersive graphics and good mechanics are this games strong point. This on top of multiplayer makes a fun experience that lasts for a while.\n\nThis being said, I cannot ignore the fact that the campaign is quite short. Because of this, I would say the game is a small bit overpriced. I would recommend getting this game on sale, personally.\n\nOverall 9/10. Would recommend\n\nHelpful | 21", "underdogcoolJan 23 at 3:25 PM\nIt was really fun\n\nThe story mode was really and they could have added more plot to be like the movie the fight mechanic was great you should be able to set skill difficulty if you could the game wouldnt seem so repetitive.\n\nHelpful | 1", "BigSmokeYeahJun 5 at 8:52 PM\nVery good\n\nIve played this game for hours and it is so much fun I recommend if you just got be and want to jump in get creed\n\nHelpful | 0", "The_AlgerianFeb 21 at 1:04 PM\nGreat workout game, but wasted potential\n\nIt's really good for an intense workout when you need one but don't have much time on your hands.\nHowever, the game doesn't respect sizes differences. First of all, it forces you to play Adonis Creed or other characters in freeplay and there's no way not to play a character at all and play as yourself.\nFirst problem with this, the game gives your character a defined ammount of stamina instead of just letting yourself tire yourself out, which is the number one problem pretty much everyone has with this game.\nSecond problem, if you're a tall guy like myself, the game will give you an average size, even if you're playing Ivan Drago.\nAnd you can very much tell which opponents and characters are supposed to be shorter than you, which makes it very weird and really hard to tell what your range is.\nThird problem, and this will again mostly apply if you're a tall person, there's only one position, which I'll call the \"Tyson pose\" and no way to adopt a more Ali kind of stance. You can do it IRL, but your character won't follow.\n\nAnd here's an even bigger issue that nobody's seemed to notice yet: You have to twist your wrist in order to place a clean punch. For your ingame fist to be in the right position, your IRL fist need to be in a very wrong and twisted position.\n\nAll in all, it's really good for working out, especially if you're doing the mitts exercise with coach Rocky. But as a game, it's not exactly winning any game design awards.\n\nHelpful | 4", "maddoxfultonFeb 12 at 6:37 PM\nGlitch\n\nI loved this game but I got a knockdown at the end of a round and the other fighter was just laying on the ground\n\nHelpful | 0", "Hancholo2007Jun 28 at 1:32 PM\nSome glitches\n\nSome glitches in training so I could not get 5 stars and story mode is way to short\n\nHelpful | 0", "Gh0sT7YMay 20 at 8:14 PM\nIts good and fun\n\nI think its a very fun game and you can play your favorite characters from the rocky saga you can play the championship game mode which is like story and the freeplay and pvp its very fun\n\nHelpful | 0", "mcbrjesseMay 28 at 9:45 PM\ncreed\n\ngood game but if you punch to fast the controllers don't work so etimes\n\nHelpful | 0", "ram4242Feb 27 at 9:00 AM\nCreed rise to glory!\n\nI recently downloaded creed and it has to be the best game on my oculus right now I rate this game 5 stars\n\nHelpful | 1", "matt.shumskyFeb 16 at 9:48 AM\n\nThis game is 100% the best but next time I would I add a bigger story mode\n\nHelpful | 1", "NosfertuJan 21 at 1:48 PM\nGreat Boxing Game, but now flawed!\n\nUpdate 01/21/2020: Had to bring this down to 2 stars, the screen goes completely black after the second match regardless if in career mode or free mode forcing us to restart game. Please fix!\n\nBy far one of the best and most realistic boxing game Ive ever played, hands down! This game takes the breath out of you if youre not in shape! Only reason why I have this at a 4 star is because not everything is perfect. Id like to see an impossible mode where the fighters dodges your every punch and the only way to hitem is to parry or a successful dodge and punch. Maybe play eye of the tiger soundtrack when boxing Rocky and the 2 other fighters. Other than that, this game is completely worth it! I would definitely buy DLC if there is more!\n\nHelpful | 3\nDeveloper ResponseJan 22 at 12:08 PM\n\nHey Nosfertu, Sorry to hear you are experiencing this black out screen issue with Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "NyctosisFeb 28 at 2:37 PM\nBest boxing Vr game\n\nBeen playing with my dad for the past couple days. Great fun multiplayer. All around memorable moments.\n\nHelpful | 1", "Giant.luckyJan 24 at 4:39 AM\nNice Exercise\n\nJust great and feels so real! But sometimes when youre not in center of your play area, camera loses tracking. Other than that, its definitely awesome way to enjoy exercising!\n\nHelpful | 1", "jvernikMar 15 at 5:11 PM\nAwesome!\n\nExhausting!\n\nHelpful | 1", "oliviaescobarMay 26 at 7:06 AM\nExpensive\n\nits an amazing game and for work out. But it is not worth the money for such short game, it also clinches and the screen turns black and wont allow you to continue, this sometimes happens randomly. does anyone know if this games will be updated and have more fights and characters?\n\nHelpful | 0", "KeighanEvanJan 22 at 9:24 PM\nTotally glitchy, slow and dangerous\n\nBuyer Beware. Game is dangerous. Due to the fast movement very easy to quickly punch through the gaurdian. Make sure you do not set the gaurdian anywhere near a wall or hard object. My son almost broke his hand. I tried it and had the same thing happen. Punched a glass picture hanging on the wall. The loading is super slow so be prepared to wait. Game gliches out often, makes player vs player mode seem like you are completely handicap at times when the controllers are not working. Broke my right controller playing this game. Customer service was useless. Had to buy another for $69. Not worth it.\n\nHelpful | 5", "hilljFeb 7 at 8:49 AM\n\nVery good game , good graphics with the matches and training, shows the reality of what you do in a real life boxing match. It also let's you practice boxing so I'll give this game 5 stars\n\nHelpful | 1", "kiana.p35May 10 at 5:58 PM\nFinally got Creed but waaah\n\nI have been waiting for this title to go on sale and when it was in the Daily Deal I snatched it up and was soooo excited to play until I got in there and have experienced nothing but glitches. During one of the fights the boxer was knocked out but the game kept going as if I was supposed to do something else. Round two started and he was still on the ground. I was like uh what the. I got out of it and started the game again. I start the training again and I kept getting placed away from where I was supposed to be. I couldnt figure out why I was behind the dummy, facing the treadmill etc. Got out again. Started it up and it worked fine for about 20 minutes then it stuttered and went black. I really want to give this game a chance cause when it works it is fun but Im scared that Im going to miss the refund window if I wait but the glitches keep happening. HELP!\n\nHelpful | 0", "Legion131Feb 7 at 12:23 PM\nGreat game wish there was more\n\nI really enjoyed this game but I felt the campaign was too short.\n\nHelpful | 3", "TomTheThotSlayerJan 3 at 2:13 PM\nPvE and stamina\n\nIve been playing this game for awhile now and i like it. Whenever in PvE yoo can the bots always do the same moves (most of them) and its so predictable. There should be a setting for either to turn off the stamina or keep it on. I just hope the bots become less predictable and more random and the stamina gets improvised.\n\nHelpful | 2", "rubert69-_-Feb 23 at 3:07 PM\nGood game\n\nWorth it if you have friends and are looking to have a good party game especially if you have 2 quest\n\nHelpful | 1", "Larkis123Dec 29 at 7:40 AM\nA strategic boxgame\n\nHi there, my first review for a gane. I hope it helps.\n\nCreed is in my eyes a very good box game using the Rocky licence to create immersive box fights. You could play a story, campaign where you start as a nobody boxer (son of Apollo Creed) and fight to the top. Its fun, challenging and you need to train before fights to get stamina (think about doing small trainings with the rocky training sountrack in a small time limit) so i garant you will sweat a lot. Sadly most story only comes about radio voices so its not very interesting. Beside that you could do your own fights with the legendary boxers from the movies.\n\nAnd you have MULTIPLAYER!\n\nFinally lets talk about Stamina. The Game is all about punch other people and get punched. The weight of the gloves and the feeling of get punched in the face is nothing you can feel in VR. This game try to simulate that in a more gamey way. You controll a ghost version of yourself (i called it the mind) and you could see your ghost hands moving around exact where you move the real arms. And there is the boxer which try to follow your movements. I say try cause the boxer get exhaustet when moving to fast and cant follow fast enough. When getting heavily punched you temporary lose control of the body and if you go down your mind flew out of the ring and you need to run back into your body before you loose.\n\nIts an very interesting way to put weight in the game. You start to worry about your body and you fight more strategic to reduce incoming damage and keep your stamina healthy. I personally find that much more entertaining than the your-own-stamina-counts variant of thrill of a fight.\n\nThe only negative thing is the movement system. You cant use the sticks to move forward or strafe. Moving with your hands feels more like some sort of ape and not human like.\n\nBut in the end that doesnt matter. When you play Rocky and finally beat rhat one guy in the campaign and he goes down and the rocky-victory-melody starts to play... Oh i love that. Maybe its not a perfect box simulation. But it is a very fun and rewarding BOX GAME.\n\nHelpful | 10", "TimLee1223Apr 22 at 2:54 PM\nJust like BOXVR\n\nIf you like BOXVR, you are going to love CREED: RISE TO GLORY. It has exercises, combo system, a campaign story mode who tells about the legendary Adonis Creed himself, an adrenaline filled vs mode, and a dedicated pvp in order to show your stuff! Are you craving for a miraculously good boxing experience, PLAY THIS GAME NOW!!!\n\nHelpful | 0", "Marce35Jun 3 at 6:13 PM\nThis game is amazing\n\nTitle says it all. What a workout gotta move those feet. Think you can fight? Prove it lol\n\nHelpful | 0", "yeetman27Jan 26 at 12:29 PM\nAmazing!!!\n\nThis game was the best VR experience I have ever had granted I only have free games and beat saber I was so out of breath after playing and it was fun I encourage this game to people who are trying to get a workout.\n\nHelpful | 2", "oscar.yeetMar 5 at 4:02 AM\nCreed\n\nIt is a good game and i love it \n\nHelpful | 1", "wutdahailFeb 5 at 10:09 AM\nOverall good\n\nGood game, but its short. Can replay the story mode, PVP is very fun but sometimes hard to get games\n\nHelpful | 0", "Tatertot69Jan 15 at 4:29 PM\nBad mechanics\n\nI play a game as Ivan drago and I punch a dude about 50 times in the face and it doesnt effect him. Than I get tapped in the the face or rib and it knocks me out. You need to make it way more realistic and the stamina mechanic sucks because In a real fight, your arms dont move at 1 mile an hour if you throw 3 punches, you need to measure how hard you hit them not if you have stamina or not. Bad game\n\nHelpful | 10", "zanyerFeb 24 at 6:44 AM\nGreat!!!\n\nI have played creed for awhile now and I have found it to be very fun and exciting!\n\nHelpful | 1", "upbeatpuffleFeb 23 at 5:58 AM\nVery fun\n\nIts a good workout and is very fun has all the original people from rocky and creed\n\nHelpful | 1", "blastman213Mar 5 at 6:14 PM\nAwesome game everything is awesome\n\nThe best game Ive played\n\nHelpful | 1", "LostkvayneDec 26 at 8:54 AM\nTracking and space\n\nIts a honestly a great game. Ive had trouble with the space of my characters box. Ill stand still in real life but the box moves. So I have to squirm around to try and train my character. I also will punch and my hand will flip or do weird thing and not register I have cleaned my cameras multiple times and unpaired and then repaired my controllers to no fix.\n\nHelpful | 0", "CovermwJan 24 at 9:55 PM\nSound issue\n\nAwesome game but please look ik not casting and sound. No issues on the other games I have played but for some reason when casting, the sound is staticky.\n\nHelpful | 0", "projay77Dec 26 at 6:33 PM\ncontroller on the game were still\n\ni found it a great game but there was one problem and that was whenever i punched anyone or anything it would freeze and it would take 5 seconds to fix it and also when i was in a match it would stop it and say draw your symbol or something like that then i had to draw a symbol i didnt even make\n\nHelpful | 0", "LtGreyfoxMay 19 at 11:17 AM\nReally fun when it works...\n\nGlitches too much. Especially during montage training the stations jump all over the place. Cant wait for future boxing games. Could be a lot more realistic if there were ankle controllers that monitored where your feet are.\n\nHelpful | 0", "AssessedBody64Jan 9 at 7:52 PM\n\nThe game is good for workouts and is fun to do I would recommend it to anyone whos into games that have some strategy. I just wish the career was longer I plowed through it in around 45 minutes and I was extremely impressed with the game although I was tired I decided to play around 7 more rounds the online with friends isnt compatible with rift s but other than that I wouldnt change anything the game was made well.\n\nHelpful | 0", "Call_Me_Z3ROMay 25 at 3:13 PM\nim unsure how to refund\n\ni like the game but im more interested in arisona sunshine and i want to get my money back to help me buy it\n\nHelpful | 0", "HyacinthLokiFeb 12 at 5:18 AM\nAmazing but short\n\nThis game is amazing but way too short so 4 stars\n\nHelpful | 0", "Slevy716Mar 3 at 5:31 PM\nSo fun\n\nI love playing this game\n\nHelpful | 1", "Vesten69May 25 at 4:33 PM\nCreed\n\nGreat exercise great game\n\nHelpful | 0", "bparker7684Feb 7 at 8:05 PM\nBruh\n\nThere is a level were you beat a mounted up in a back ally 5 stars\n\nHelpful | 2", "chrissyV.88Dec 27 at 8:08 PM\nSound\n\nGame is awesome but for some reason when casting to the tv the sound is really distorted. Have to mute it to watch it. And yes I made sure the volume wasnt up to high. Other games work great just not this one. Other than that really impressed.\n\nHelpful | 5", "CyberJack4Jul 2 at 4:16 PM\nVery Good\n\nVery good\n\nHelpful | 1", "Gripper_SupremeJan 30 at 5:55 AM\nBrilliant!\n\nThis is great fun and an excellent workout! I love the training montages to the Rocky music and that you can fight the Rocky legends such as Apollo Creed and Clubber Lang. A must for Rocky/Creed fans.\n\nHelpful | 0", "Geraldgotee76Feb 26 at 5:23 PM\n\nThis game is awesome you guys did a great job\n\nHelpful | 1", "bunkerfireFeb 27 at 2:32 PM\nA lot of fun\n\nThis game will make you sweat for sure.\n\nHelpful | 1", "Crewsy.123Dec 30 at 3:07 PM\nLoved the game but getting frustrated\n\nI would have given this a five star review as i find it the most immersing game on my quest so far, game graphics, sound and presents of the characters are outstanding, mixed with excellent game play.\n\nSo why the low score?\n\nMine has a bug despite reinstalling it still happens when the training montage stars the positioning messes up sometimes my punch bag is outside my guardian wall (impossible to hit) and my running machine would be to the side of me or place me the wrong side of the hand rails.\n\nDevelopers please fix this fault as it ruins the game totally.....\n\nEdit - the developers now ow me a lamp due to the messed up character placement ...... lets see if I can smash a telly next / got a feeling the quest may be the shortest lived VR product once someone gets seriously injured  as you may tell Im writing this in anger with blood on my knuckles.\n\nHelpful | 9", "Chaos2377Mar 3 at 10:25 AM\nCreed\n\nExcellent\n\nHelpful | 1", "Bel1alJan 11 at 12:26 PM\nI love this game\n\nI use this game to exercise a lot. However I think the campaign is a bit short and I have only one problem.\n\nA lot of the time when you get knocked down, for some reason it just wont run.m\n\nHelpful | 0", "bbbrrromezFeb 9 at 3:56 PM\nAn immersive work out\n\nHave a lot of fun with this one...the music really gets you hyped! I find the boxing really immersive in a cinematic way.\n\nHelpful | 1", "MaxitacionApr 8 at 2:57 AM\nWorse game\n\nThe Lion Is to mutch string Nerf jim\n\nHelpful | 1", "billy.rockstar56Feb 17 at 5:39 PM\nCreed\n\nI love this , best work out ever , ya you realy get swetting here . Great job!\n\nHelpful | 1", "Braymdc17Feb 8 at 5:02 AM\nGet this game\n\nGet this game best game ever!!!!!!!!!!!!!!!!!!!\n\nHelpful | 2", "BigLurvFeb 21 at 6:44 PM\nHurts All Over\n\nThis makes my whole body hurt and makes me realize I need to work out more.\n\nHelpful | 1", "CrimsonZAOct 1 at 10:26 PM\nLong waits before matches\n\nThe combat is great but to get into a single player match you always have to go through the same intro in this corner.... I want a clean fight.. every time . It is there a skip function I didnt read about ? And theres no quick restart at the end of a match , its back to the loading screen to start all of it over.\n\nHelpful | 87", "30juuJan 18 at 5:26 PM\nBlack out screen\n\nI got this game for my family to take turns and play, but there are times while playing the game, the screen will black out. The sound will still be playing and the game is still going, but we can't see anything. It's a really fun game, but it is hard to enjoy the game when after a certain time, we go blind.\n\nHelpful | 0\nDeveloper ResponseJan 20 at 6:01 PM\n\nHi 30juu, Sorry to hear you are experiencing this black out screen issue with Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "KylieBishop1974Feb 21 at 10:57 AM\n\nExcellent realistic game. Great work out too\n\nHelpful | 1", "TerminatorJABLFeb 29 at 2:27 AM\nVery fun\n\nFun game\n\nHelpful | 1", "cysliderDec 14 at 11:50 AM\nExhausting game! Impressive expierience\n\nThe immersion is spot on. The action is extremely taxing on your body and stamina. I love it for training.\n\nOne star less, because the pre-fight trials are buggy as hell. If you don't stand correctly in the beginning, or even move slightly, the position on the next trial's get worse and worse until you fail because stuff is behind/sideways to you or even outside the play area.\nShould be easy to fix though.\n\nWould love a \"Punch club\" meets \"Creed\" game with far more mandatory exercise between fights.\n\nHelpful | 3", "SenSSi_Jan 17 at 3:05 AM\n4/5\n\nGood boxing game! Graphics are nice for quest. If you like arcade boxing this is for you. 1 star off, because opponents are too close. \n\nHelpful | 0", "Calebfitzy56Feb 19 at 1:02 PM\nEpic\n\nIt was by far the most realistic boxing game on VR\n\nHelpful | 1", "TheSpikesterFeb 27 at 2:23 PM\nGreat game! Defiantly a must buy\n\nAmazing!\n\nHelpful | 1", "Gamerman264Feb 1 at 9:09 PM\nI love it.\n\nThis game is great it is very helpful to my fitness goal and I use it a lot this game is a great exercise routine I use it 1 hour a day.\n\nHelpful | 1", "maseinyourfaceDec 28 at 1:25 PM\nWhy creed is the best\n\nThis app makes you feel like you are actually living the fight. You punch and dodge just like in real life. The app provides you with motions that are easy to pull off. This app is also filled with many modes including career. This mode is you fighting and going through creeds life. Overall this game is amazing and I rate this as a 5/5.\n\nHelpful | 1", "Damdog1965Jan 20 at 6:44 PM\nUnderwhelming\n\nShame it could be so good if they put different options on the movement ie stick or full room with no resetting camera at end of round game is uncontrollable in its current form how can you use your hands to move as well as punch doesnt make sense\n\nHelpful | 2", "CowboyChauncyMay 23 at 4:01 PM\nAmazing\n\nI play this a whole bunch and the concept and style leaves me in awe.\n\nHelpful | 0", "donny471Dec 18 at 4:02 PM\nMeh\n\nThrill of the fight is significantly better. Creed does not tie the game space to your guardian space. So you have to keep resetting your view every time the round ends. The game misses out on lots of details like this throughout the experience. This lack of attention by the developers breaks immersion for the player.\n\nHelpful | 8", "aspen907Dec 28 at 11:07 AM\nIncredible!\n\nI love this so much. I played this yesterday for the first time and it was so fun.\nHowever, and I actually dont mind this, but the next day, today, I am VERY sore. Its very realistic. Only recommendations are to make so much more fitness games! Maybe do a gym simulator or something.\n\nHelpful | 1", "webvthokieDec 30 at 6:00 PM\nWhat a Workout!\n\nThis game makes for a great workout! It only took me a couple days to beat on Champion setting. Doesnt appear PVP works. It took 6 tries to connect and no one joined quick match waiting for 5 minutes.\n\nHelpful | 3", "akawakatabFeb 10 at 6:29 PM\nAmazing\n\nI dont know what to write, but I like it.\nMy only complaint is the graphics\n\nHelpful | 1", "EpicboxerJan 10 at 5:52 AM\nGreat at working out\n\nIt helped me work out by trying to duck and dodge and block and punch. Every time I finish a fight on champion mode and win or lose I end up sweating A LOT. This shows me I'm doing a great workout and having fun!\n\nHelpful | 2", "Saint4ndyFeb 1 at 11:59 AM\nGood workout\n\nHad a good time with this game! Great overall gameplay and mechanics. A few bugs, like broken legs and glitching away from training gear brought the total down to 3 stars - otherwise I would give it a 4 \n\nHelpful | 0", "TheFreddyGamerFeb 26 at 8:48 PM\nCrashes soooo much!\n\nThis is a really cool game, but in the first 10 minutes, it had crashed twice.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 1:24 PM\n\nHey TheFreddyGamer, Apologies for this crashing issue you're experiencing with Creed. Could you try fully re-installing the Creed app on your Quest, then see if you still experience these crashes? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. If you're still experiencing this issue after a re-install, please contact us at support@survios.com!", "MagicalmaxFeb 5 at 5:55 PM\nI loved it\n\nIts a good workout\n\nHelpful | 0", "KRoosterJan 12 at 7:00 PM\nBlack screen of death!\n\nThe game has awesome graphics. But the game has terrible gameplay. I had two black screen of death on my first play. I had to restart the game. There are instances during the training session that you would be too close to the punching bag or dummy and sometimes in a very awkward angle too. I have my VR YouTube channel and here is the video link of my review comparing it to another boxing game https://youtu.be/LJiGb1B011Q. The dynamics of the game is good.\n\nHelpful | 1\nDeveloper ResponseJan 13 at 12:36 PM\n\nHey VRKiddos, Sorry to hear you are experiencing this black screen issue with Creed. Have you recently tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "SlothWick1Apr 30 at 7:28 PM\nToo Short\n\nIt was great all things considered, but it was so short I wish they made it longer\n\nHelpful | 0", "dragon61716Jan 26 at 8:56 AM\nGreat workout\n\nI wake up every day and go play creed as a workout although I wish the career lasted a little bit longer but, a great overall great game.\n\nHelpful | 0", "TimmyTurtle4564Feb 29 at 6:05 PM\nGreat game but such a short campaign\n\nThe game is great but the campaign is really short\n\nHelpful | 0", "bedhead1405Dec 25 at 6:09 PM\nHavent played it but...\n\nHasnt played it yet because everyone one else in my house is enjoying it so much. I played the tutorial and didnt think much of it which is why Ive put it as four stars but everyone else loves Mo Mo is so it must be good. Totally worth it so far!!!\n\nHelpful | 0", "Mr1GonzalezJan 2 at 5:36 PM\nThe Demo is much better\n\nAfter the first fight you get pulled into this advanced training where it motions you to move with your glove. Funny thing is it doesnt tell you how to back up, so Im here stuck endlessly moving forward with the smooth motion thing that makes everyone nauseated with no means of turning it off. That plus the training always faces you in a random direction to where you either have to turn or press B to quickly smooth motion you to face the challenge with no regard for set up time... Im writing this nauseated so mind my run on sentences. I put in a ticket for a refund, this is not what I expected.\n\nHelpful | 3", "willdeal73Jan 13 at 7:11 AM\nLove this game\n\nThis game has inspired me to get back in shape. When I first started playing I would get tired by now I play a few hours before I get tired. The boxers are so realistic and the game is just amazing.\n\nHelpful | 0", "AnthonydeacFeb 20 at 9:48 AM\nQmamamamamamazazazazazinginging\n\nAmazing\n\nHelpful | 1", "jingram701Feb 8 at 5:23 PM\nExcellent\n\nThis game is amazing and it is so much fun to play with my friends\n\nHelpful | 1", "jago25_98Jan 2 at 1:35 AM\nGreat atmosphere but black screen bug\n\nI love the atmosphere in the game. It feels a lot more satisfying than Thrill of the Fight. It's amazing what they've achieved. Survios are artists and engineers.\n\nBut this game has been abandoned. It's just a crying shame that after more than 6 months the black screen bug is still here.\nStamina... Is annoying. It doesn't seem to engage properly during PvP matches.\n\nI actually refunded about 4 months ago and just re-bought it last week to see of the black screen bug during fights is fixed. It's not.\n\nIt's worth $10 just for the PvP mode but it's not worth $30.\n\nI've taken off a star for the bug and another star for abandoning the game.\n\nHelpful | 4\nDeveloper ResponseJan 2 at 12:40 PM\n\nHey jago25_98, Sorry to hear your still experiencing this black screen issue after repurchasing Creed. Have you recently tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "F1nthechatMay 26 at 5:24 PM\nFun game with great mechanics\n\nLoved the game.\n\nHelpful | 0", "slenderfdfFeb 1 at 8:15 PM\nAmazing\n\nThe graphics are amazing and I am a Creed and Rocky fan. Amazing game. Keep up the good work.\n\nHelpful | 1", "rndaviesMay 30 at 11:50 AM\nHow do you change your height?\n\nIn the game I feel like Im a little person. Is there a height adjustment?\n\nHelpful | 0\nDeveloper ResponseJun 1 at 12:46 PM\n\nHi rndavies, You should be able adjust your height by using the \"Calibrate\" tab through Creed's in-game options. Hope this helps!", "BurntJellyFeb 16 at 9:09 AM\nIts ok\n\nThe campaign is very short and the game crashes atleast once per two fights not worth 30\n\nHelpful | 1", "GiaGi1Apr 30 at 5:06 PM\nGreat cardio work out\n\nThis game is awesome. The graphics are good. Make sure you have enough room when you play cause it will \"suck\" you in. It gets intense.\n\nHelpful | 0", "The_Flying_DogeJan 1 at 1:25 PM\nKeeps blacking out\n\nI just got this game yesterday and the second day it keeps blacking out and then I have to restart the fight!!!! Please fix this. I dont want to waste my money.\n\nHelpful | 0\nDeveloper ResponseJan 2 at 12:39 PM\n\nHi The_Flying_Doge, Sorry to hear your screen is blacking out while playing Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "SammyK50Jan 16 at 6:45 PM\nEpic\n\nThis game is so much fun and whenever I play it I have a good time. Its also a good workout and Ill be sweaty after a hard fight but in a good way\n\nHelpful | 1", "Justawildtoby_Jan 7 at 8:43 AM\nNot enough content\n\nThis game is good... just good... it is visually pleasant, the movement and interactions are good... but.. just.. good. I initially bought this game to play the career mode but I completed it in about an hour. I expected it to be a lot longer than that especially as the name of the game is RISE TO GLORY and once you have completed the career (and you dont get to fight any of the time rocky movie characters) it is just training and fights a giants AI that you choose the arena and characters... so once the career is completed the game gets very boring, very fast. Other than than tho this game is alright but DEFINITELY NOT WORTH 23!\n\nHelpful | 3", "Superblue5Jan 1 at 4:33 PM\nIts limited and has bead graphics\n\nI like the game espically the multiplayer function but I hate the graphics and all you can do is train fight and fight friends. I want there to be a weekly challenge or something\n\nHelpful | 0", "u02jsc6Jan 21 at 9:24 AM\nHopeless\n\nThe hardware of the oculus isn't fast enough to track hand movements at any real speed so perhaps I was stupid to get thos game in the first place. Its doesn't track your movement properly and so it can be nearly impossible to position yourself for the training things. Why not just have a normal movement mechanism? Or at least one that lets me reverse. Tried it a couple of times and did not fair any better. Could have been something so much better.\n\nHelpful | 1", "Zensix6Jan 17 at 3:47 PM\nRocky\n\nIf you where a fan of rocky movies as a teenager, this is the game for you !\n\nHelpful | 0", "RiveraReppinJan 21 at 7:44 AM\nGreat game\n\nMore than I could imagine great fun with family and friends!\n\nHelpful | 0", "CabinetBeetle34Jan 25 at 8:13 PM\nBest boxing game ever\n\nI love this game, very accurate inside the VR. Lots of game modes and challenges. Also one heck of a workout.\n\nHelpful | 0", "WSelvoDec 30 at 5:13 PM\ngood game\n\nits a fun game but sometimes I get a black screen every once in a while and it gets glitchy sometimes but very fun and funny to watch people play it\n\nHelpful | 1", "MeltingLionFeb 7 at 4:40 AM\n5\n\nVery good and fun game for loosing weight\n\nHelpful | 1", "MemesBest123May 2 at 4:12 PM\nGreat Game!\n\nI loved this game and it was very fun, but I do wish there was more to the campaign. Otherwise, perfect game.\n\nHelpful | 0", "BACONeaterBILLDec 26 at 8:48 AM\nGreat game\n\nI recently was gufted the quest and when I tried the game it was a great workout I didnt finish the campaign yet but I wish it was more like 2k career with leveling up stats\n\nHelpful | 0", "revellgodMay 18 at 8:11 AM\n\nIts amazing all i can say\n\nHelpful | 0", "yahavsulamFeb 13 at 10:03 PM\n\nbest vr fighting game\n\nHelpful | 1", "psully4114Dec 11 at 10:09 AM\nIts a lot of fun\n\nThe story is pretty forgettable but does anybody really want to play a Rocky game for the story? You play it for the fights. It does one thing and it does it really well. Lookin down and seeing your janky legs can take you out of the experience a bit and the swinging your arms to move mechanic makes the fights feel a little silly but it's still fun and very replayable and there's nothing like the first time you try VR and look out into a crowd of thousands and beating a dude that towers over you. Great game.\n\nHelpful | 4", "ben.haselgrove.92Dec 30 at 3:55 AM\nBen\n\nThe oculus fitted really well, a lot a room on the move around being wireless can be a tad laggy sometimes tho apart from that its all good\n\nHelpful | 0", "BrojjkJan 18 at 2:59 PM\nFree play\n\nI love this game. I think that adding more customization to the the free play would make it a lot better though.\n\nHelpful | 1", "peter.hoag.5Feb 7 at 4:26 PM\ncreed:rise to glory\n\nbest game on oculus\n\nHelpful | 1", "TheKillerWhale707Jan 7 at 6:31 PM\nGREAT GAME!!!!\n\nThis game is a lot of fun if youre looking to exercise without realizing your exercising. The story mode is fun and preps you for the pvp mode. Loving it! Great game guys\n\nHelpful | 0", "bobob15Jan 5 at 5:59 PM\nCreed\n\nGreat game, but not long enough! There needs to be more fights and a mode for disabled kids so that it would be easier for them to hit them while not using to much power, thank you.\n\nHelpful | 0", "TAC0_MANFeb 7 at 10:45 AM\n:)\n\nThis is amazing\n\nHelpful | 1", "Adad_856Dec 27 at 8:09 AM\nGood\n\nMy friend took a lamp down while playing it.\n\nHelpful | 5", "Thomas_AcquaJan 1 at 10:39 AM\nGreat Game\n\nI recently just got a oculus quest for christmas and this was one of the 2 titles i got and its just simply amazing, its fun with friends if they also have one and at parties, i recommend 10/10\n\nHelpful | 0", "Cole3646Jan 27 at 3:55 PM\nGREAT\n\nGood graphics, nice movements, and no glitches worked amazing\n\nHelpful | 0", "PurpleApothecaryDec 29 at 4:43 PM\nNeeds autosave function\n\nThis game is okay. But i have had to restart the story six times because the game doesnt autosave. Its very frustrating. I tried exiting through the menu but alas when i restart the app my old game can not be continued. I will not play this game again until i hear that this feature is fixed\n\nHelpful | 8\nDeveloper ResponseJan 2 at 12:28 PM\n\nHi PurpleApothecary, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. If you're still having issues getting your Career Mode progress to save, please contact us at support@survios.com.", "ayden.chartierFeb 6 at 7:09 AM\n\nGood game\n\nHelpful | 1", "Wamalicious3012Dec 9 at 12:31 PM\nIt will kick your behind\n\nThis is my first experience with boxing and I must say its fantastic because it serves the purpose for me. I got the headset cos I want to get my heart rates up without no boring exercise n this is a mohair sweat factory and I must say with the way I throw punches in here no one should mess with me on the streets I am Adonis creed \n\nHelpful | 0", "JakeyFromStatefarmyDec 29 at 11:10 PM\nGreat!\n\nIf you are someone who really wants to feel the rush of blood in a fight while exercising , Id definitely recommend this game. From the gameplay to the atmosphere, everything is right here. 5/5\n\nHelpful | 0", "stu-ragMay 13 at 5:45 AM\nPerfect\n\nGood game\n\nHelpful | 0", "BigDog1111Apr 4 at 7:57 AM\nOverall really fun!\n\nIm sure Im going to punch my wall or my wife in the face at some point, but this at least was fun and got me sweating!\n\nHelpful | 0", "SlayYaDec 23 at 10:49 PM\nBlack screen\n\nI just got the game and I have been playing for about 30 minutes and then the screen just go's black please I have to reset my game to fix it\n\nHelpful | 0\nDeveloper ResponseJan 2 at 12:37 PM\n\nHi SlayYA, Sorry to hear your screen is blacking out while playing Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "josh.richards.733Dec 22 at 4:12 PM\n\nVery short games was a little disappointed in the story line but now I use it for part of my workout routine it amazing for that you will be pouring sweat\n\nHelpful | 1", "Muey_Thai_Old_GuyNov 22 at 6:16 PM\nFun and good workout.\n\nAs a trained Muey Thai fighter I find it fun and amusing, but it can't keep up with my hand speed. I look forward to the day when Oculus adds kicks! Once you figure out how to block and bob, it's pretty easy to beat. That said, I find it to be a good workout and worth the money.\n\nHelpful | 1", "WuzdarapFeb 1 at 12:53 PM\nGreat!\n\nAwesome game!\n\nHelpful | 1", "joe_ilikewaterDec 24 at 6:07 PM\nGreat\n\nIt is a lot of fun but the campaign is way too short for its price. I still recommend to play this game because its lots of fun\n\nHelpful | 0", "Pieman476Nov 27 at 2:48 PM\nCracked\n\nIts a great game but trying to play in champion in free mode is outrageous because sometimes when you punch them and they do the animation of being hit while they where doing a power move if where doing a power move and their hand touches you it counts it as a hit a 90% of the time thats why I get knocked down\n\nHelpful | 0", "HomerS66Nov 18 at 2:42 PM\nAfter update game is back to normal\n\nUpdate: Now after the newest update you can finally disable the subtitles and therefore Creed deserves a better score. I wish i could add opponents as friends in game tho and invite them even when they dont play creed but are online. Also the invite System within the game never seems to work even when someone is playing creed.\n\n\nAre they serious? They dident tell you what the update is about and now it ruined the game which i really liked before. They wanted to localize the game which made the text harder to read now but much worse everytime the box promoter or referee are talking during the fight, a giant text is floating right in your view in front of the other boxer, so that you get distracted and it seems to be 2D mixing with your 3D view aswell, what the fu**.\nIt was much much better before, let me chose if i want this terrible localisation or not, make it optional. If you leave it like this you ruined this game and i want my money back. What a terrible terrible update.\n\nHelpful | 2", "Deaths_ProfitsDec 23 at 3:05 PM\n\nShort campaign challenging but still a workout multiplayer is just swinging no real skill just stamina and body hit locations\n\nHelpful | 0", "ILOVETOAST101Dec 26 at 3:55 PM\nGreat game\n\nJust lacking the story, add more fights and more moves, that would be very fun\n\nHelpful | 3", "Chazz395Dec 23 at 10:26 AM\nPretty good\n\nGreat graphics and choice of characters but kinda wish the career mode was about creeds life and not just boxing\n\nHelpful | 1", "BurnmoreJan 10 at 9:31 AM\nSo far so good\n\nFun to play\n\nHelpful | 2", "jcameroniiJan 2 at 5:41 AM\n\nI am really enjoying this app, great cardio workout and a lot of fun.\n\nHelpful | 0", "Sgt.SadankoJan 24 at 5:40 PM\nCreed\n\nGreat game to play, and a good way to exercise.\n\nHelpful | 0", "bub38Apr 27 at 6:03 PM\nfun game but one issue\n\ni like the game but make so you can chose the difficultly\n\nHelpful | 0", "slowlightingFeb 22 at 7:25 PM\ngood game, and workout, few issues\n\nCan lose your balance if you are not careful\n\nHelpful | 0", "NizeezJan 4 at 9:35 PM\nFun campaign\n\nNo real complaints about the stamina. But the main problem is that the campaign is too short. I finished it in a couple of hours.\n\nHelpful | 0", "victorswkyipDec 27 at 5:17 PM\nTracking issue makes it a deal breaker\n\nCompared to thrill of the fight, this game is a much better *game* in terms of the immersion, the sound tracks and the gameplay overall. However, I can not recommend this game because of the tracking issue which exists. The tracking is just too buggy and inexcusable because this is one of the more expensive apps on the store. Love the dev work thats been done, but the single issue of tracking makes this game completely unplayable. The stamina issue is not a problem because its not a boxing simulator, its a boxing game. The stamina mechanic makes so that your punches are more valuable, so you dont throw random punches. Honestly I hate the tracking, literally Im walking backwards when Im supposed to be walking forwards.\n\nHelpful | 1", "kermit.the.sockJan 26 at 5:19 AM\nGood\n\nIts really cool\n\nHelpful | 0", "Danrock72Mar 25 at 9:45 AM\nAn out-of-reach problem\n\nThe game is fun, and I want to keep playing. The only problem is that in the training mode between each fight I keep getting teleported either behind or farther away from the target. Ive tried moving my character (which I would love an option to change it to thumb stick for movement), but nothing is happening. Am I doing something wrong or is this supposed to happen?\n\nHelpful | 0", "Lula637Jan 20 at 7:00 AM\nGreat workout\n\nGreat workout. Realistic and fun.\n\nHelpful | 1", "dylan.magararuNov 14 at 7:14 AM\nGreat game, almost perfect\n\nThe game is great, the controls are fluid enough and the gameplay style is fun and can be a great workout. The fatal flaw is the pvp mode, which is the biggest reason I bought the game. Ive yet to find a match with anybody after days of trying. I dont know if its the lack of players or if the match making system is not working correctly.\n\nHelpful | 0", "SyvertsenProJan 17 at 8:50 AM\nBugs out alot\n\nThe game is fun and not to hard, but the multiplayer buggs out the character and is just an overall bad experiance if youre trying to play\n\nHelpful | 0", "memes2.0Dec 25 at 11:30 PM\nGood game\n\nThe game was fun and keep me exercised I burned 400 calories just playing this the game is fun and if you have money to spend I would get it . The game is very well made\n\nHelpful | 0", "cocokidFeb 1 at 8:21 AM\nAwesome game\n\nIts a really good game but there is not that much story line\n\nHelpful | 0", "yasseralmohannaJan 21 at 8:09 AM\nGreat game\n\nOutstanding, we need more options\n\nHelpful | 0", "PugZilla1125Jan 26 at 7:11 AM\nAwesome\n\nAmazing\n\nHelpful | 0", "gamer_kiddo3Dec 4 at 6:10 PM\n\nPretty good and fun but the story was just so... short. They did try to add in some story but it just didnt work. heck I beat it about 25 minuets after getting it! Otherwise it was a good game\n\nHelpful | 0", "DIPPYZJan 6 at 6:42 PM\nAmazing\n\nI think its really fun to be punching as fake as the blocking is its also a really good excercise.\n\nHelpful | 0", "PentheusNov 23 at 12:05 PM\nI Cant Reccomend This Game\n\nI honestly thought this game was like Thrill of the Fight but its not. It involves a gamified play style in which pure boxing is substituted by hitting certain spots, intensity, timing, etc. It also has nauseating smooth motion segments in the training area that are utterly unneeded to even be in the game. For instance, when you are actually boxing there is no smooth motion. Anyway this is only one of two games I have really been disappointed in on my quest, and I have bought and highly rated quite a few. I wont event mention the stamina issues. I think the devs did a great job and meant well with this game, but VR has moved on in several ways since it was made and now with TOF in the store, the problems with this game are just really apparent.\n\nHelpful | 5", "michaelliebtagDec 5 at 2:34 PM\nGreat game\n\nThe first time I played it I was at my friends house using his ps4 vr. I recently got the quest and no matter what you play the game on, its a great game. Although the PVP is glitchy\n\nHelpful | 0", "HanzFlamenJan 24 at 4:19 PM\nGreat Game\n\nI loved this game but it can be a major workout\n\nHelpful | 0", "Hellish.violenceJan 5 at 3:22 PM\nAwesome\n\nIf your looking for a game that will beat your butt this is it! Hours of fun and a great wotkout to boot\n\nHelpful | 0", "Ru_flores1Jan 21 at 7:03 PM\nGreat game\n\nFun game to just box for fun!!!\n\nHelpful | 0", "onleyouDec 11 at 7:23 PM\nFun concept, but gameplay is buggy\n\nGlitches in the training mode makes it impossible to complete the tasks. The player is spawned too far away, or facing away from the equipment.\n\nIn the actual fights, sometimes the opponent will be too close, as if they want to kiss you (that is not the kind of game I was looking for here). That makes it difficult to punch, and unnatural to fight.\n\nHelpful | 1", "FyrsteJan 5 at 10:24 AM\n\nFun game for awhile, then repetitive like you'd expect from a boxing game. Opponents get too close to dodge and even to hit, but they can keep hitting you while you try to move away.\n\nHelpful | 0", "oculus-lucaJan 9 at 11:47 PM\nCreed to glory\n\nIt was simply the best ever I thought it looked real you also get a work out\n\nHelpful | 0", "battleplaugeApr 30 at 1:16 PM\nWoohoo\n\nIts fun\n\nHelpful | 0", "beasty123Dec 28 at 2:15 PM\nIt was great\n\nEverything was great but the career mode was really short.\n\nHelpful | 0", "doni.juan.7Jan 23 at 12:15 PM\nHammer\n\nCool\n\nHelpful | 0", "shrtdg1Jan 18 at 5:45 AM\nCreed\n\nGreat game, good workout\n\nHelpful | 1", "noah71hockeyJan 19 at 3:53 AM\n\nSo fun\n\nHelpful | 1", "MoePain4uDec 22 at 8:59 AM\nGreat boxing game\n\nGreat way to exercise. You feel like you are really fighting someone. Love the training sessions. I play this every day.\n\nHelpful | 3", "definingtimeNov 9 at 6:27 PM\nBuy Thrill of the Fight instead.\n\nTitle says it all; I wasted money so you don't have to. I bought both; won't open this app again. Its stupid you stand in a little square with a massive dude right in your grill (literally) and you have to like turn and wobble the controllers to move around instead of moving around your play space (which nothing tells you where it is and youll punch your wall and cut your finger). Buy thrill of the fight, there, your playspace is the ring you wont go out cuz the net is behind you and you can dance and move freely no using the controllers.\n\nHelpful | 6", "daltyn.maynardDec 26 at 6:00 AM\nGreat game\n\nI love this game so much it made me feel like I was Adonis creed and not just myself and it made me sore but it was very fun\n\nHelpful | 0", "johlrich1Dec 2 at 3:00 PM\n\nI enjoy it so much I can play for ever..until I pass out. But I need that! Please update and create unlimited stamina for exercise purposes. Great job otherwise.\n\nHelpful | 0", "stonesphereDec 11 at 5:38 PM\nTraining with Balboa\n\nReally like this game. Great exercise. I train and fight for about 30 min and Im worn out. Working towards an hour.\n\nHelpful | 0", "aghkoDec 6 at 4:31 AM\nNOPE!\n\nShort content, pricy and poorly designed for VR.\n\nYou will finish the game quite quickly. The stamina mechanic is quite bad... in a game where the player uses its own body and arms, the stamina is built in the user! There is no need of extra immersion breaking gimmicks... one will find around other games, cheaper and that are a much better simulation than this one.\n\nHelpful | 5", "Daffyd6ckJan 11 at 2:53 AM\n\nAmazing just can you add tommy Gunn\n\nHelpful | 0", "Yodaddy_653Jan 11 at 7:20 AM\nAmazing Game\n\nThis game is amazing one of my favs\n\nHelpful | 0", "ShryterDec 6 at 5:39 PM\nBad Glitches on Champion (Quest)\n\nIt is a fun game, however, the training before the fights would often be messed up for me. (I was playing on Champion mode, and I am 6'4\". Brand new Oculus Quest, and all other games work just fine.) I'll start by standing in the square it tells me to stand in, then I'll do the first training exercise. After the initial exercise when it spawns me to the next, it'll spawn me slightly off center. So, I'll adjust so I can be center of the training event. Then all hell would break loose. Each following exercise would spawn me further away from infront of the station, and even at different angles, so I'll end up spinning around, or even having to move near out of the guardian in order to reach the stations (some cases the station is spawn beyond the guardian so that I cannot even do it). This would often give me only enough time to complete 3 or 4 events, giving me terrible stamina during the match, and there is nothing that can do about it other than forfeit the match and try to \"roll the dice\" to hopefully get a better series of exercise spawns so that they are (hopefully) infront of me when they load.\n\nThe other issue I had was, during the final fight on champion mode. I had knocked now the opponent. Thecountdown began. He stood up on about the 3rd count, and IMMEDIATELY knocked me down. His count still counting when my count also began. 2 separate countings at different times (his about 4 seconds ahead of mine.)\nSo while I'm swinging my arms to try to avoid a K.O., his count reaches 10 and I become \"defeated.\" Then I become \"defeated\" again after my count finishes, just 4 secs later. After I retried the fight and finally K.O'd him, it started another round with him unconscious and ragdolled in his corner. It did this till the final round, where I one by \"unanimous decision. \"\n\nHelpful | 3", "EthanArensbergJan 8 at 8:55 AM\nIt Lowkey fun\n\nI fw it because its like entertaining yk.\nInsta: @ethan.j.arensberg\n\nHelpful | 0", "TheRealASIAN_97Dec 28 at 9:19 AM\nGreat\n\nLoved the game would Recommend playing the only bad thing is it made me really tired after playing\n\nHelpful | 0", "mknowltonJan 2 at 8:26 PM\nWont save career\n\nGame is awesome! Great chance to get some good conditioning in. When you go to career and end the game, it makes you start from the beginning. At this rate, I will never make it to the end of the game.\n\nHelpful | 1\nDeveloper ResponseJan 7 at 4:07 PM\n\nHi mknowlton, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. If you're still having issues getting your Career Mode progress to save, please contact us at support@survios.com.", "llamallama2Dec 13 at 7:35 PM\nAMAZING\n\nThis game is amazing In every way. The only thing I dont like is how the CPU gets really in your face. It does not really matter though. Overall great game\n\nHelpful | 1", "Zing-Jan 12 at 7:45 AM\n\ngOoD GAmE mUCh wOW\n\nHelpful | 0", "Titans4lifeJan 5 at 9:47 AM\n\nI think it needs to extend the career mode\n\nHelpful | 1", "AmazingStricker55Dec 25 at 10:20 PM\nImpressed\n\nI gotta say this game is really great graphics are great I love when you punch someone they get bruised up\n\nHelpful | 0", "nelson.morgado.5682Dec 30 at 12:58 PM\n\nGreat game good story\n\nHelpful | 0", "JakeconerDec 5 at 2:53 PM\nA Great Workout Game\n\nThis game is fun, punching fell very satisfying and it is a blast to play! It also a great workout game! The only problem is that it is very exhausting, and I highly recommend to take frequent breaks.\n\nHelpful | 0", "Elite_shadowDec 31 at 6:49 PM\n\nAwesome game if Ivan dragons wasnt so hard lol hahahahah\n\nHelpful | 1", "I_Luv_YouDec 6 at 6:38 PM\n\nThis game is amazing but has a few glitches. It was definitely worth it and is a good workout. One of my favorites.\n\nHelpful | 0", "ryantaylor2008Jan 1 at 11:02 AM\nAmazing\n\nThis game is everything I would want from a VR boxing game\n\nHelpful | 0", "vHoneyBadgerOct 7 at 7:54 AM\nGreat game but\n\nGreat game i just wish there was a option to turn the stamina system off and have it based off your real life stamina instead. The game is more about who manages their characters stamina better rather than which guy is actully the better boxer which i think is a shame because i love everything else about the game.\n\nHelpful | 11", "aaron.neisinghJan 4 at 10:43 PM\n\n\nGood game with fun mechanics\n\nHelpful | 1", "keegmoney11Dec 26 at 4:05 PM\n\nThe game is great but please add more fighters.\n\nHelpful | 3", "MarkStirtonAberdeenNov 18 at 2:59 PM\nGood fun\n\nNow that the fantastically intrusive subtitles have been removed, this is back to being a good game again. More arcade than boxing simulator, but that's fun if you're in the right mood.\n\nHelpful | 0", "stupidearthlingNov 30 at 1:15 PM\nWhy??\n\nGreat graphics and sound and I'd have given this a 5* if it had let me move around freely which is such an obvious thing in a boxing game. I was hoping I could turn off the controller movement in the paid version as it made me feel dizzy instantly.\n\nAnother annoyance is having to wait nearly a minute for the logos and intro sequence to load.\n\nI'm still quietly hoping the controller / swinging arms movement will become optional in later updates. Spoiled it for me.\n\nHelpful | 2", "nayquanososavagDec 27 at 7:37 PM\nRealistic and fun\n\nIt is a over all amazing game it just needs better graphics\n\nHelpful | 0", "KREX10Dec 20 at 9:41 PM\nNot cross platform\n\nThis is really fun and I haven't played very much of it yet. I'm new to oculus and I hope this isn't a trend, but you can't play pvp between the quest and the rift.\n\nHelpful | 3", "Dampedcaden2564Mar 19 at 11:59 AM\nGreat game but bugs NEED to be fixed\n\nSometimes when I go into training on the treadmill,I swing my arms to run but no progress happens.Thats not all,when Im in a fight,sometimes the game will shut down saying creed has stopped.\n\nPlease fix these bugs.\n\nHelpful | 0", "SatyriasizZNov 6 at 12:21 AM\nMy favourite Oculus game\n\nI spent hours in game and I love it. Champion difficulty is challenging, I had muscles soreness for weeks, but the game brining me so much joy I cannot stop.\n\nThere many ways to improve over time. PvP is amazing and I like training in the gym trying to beat high score.\nImportant: Black screen bug never happen to me after oculus v10 update.\n\nBackground pvp search would be the next level play ^^~\n\nI broke my little finger bone hitting the wall, finished the match and got my finger casted.\nI was thinking I'll not be able to play for a month, but turns out it totally playable with broken finger :)\nAdd me for pvp ;)\n\nHelpful | 7", "MarcMooPooJan 1 at 6:12 PM\nGood game\n\nAwesome worth it\n\nHelpful | 0", "Jones_PlayzJan 2 at 5:48 PM\nAwesome\n\nGet it....\n\nHelpful | 0", "GucciGangBoomJan 2 at 1:07 PM\nGreat game to start\n\n5 stars\n\nHelpful | 0", "ikem.okafo.5gDec 1 at 4:51 PM\nAmazing workout and fun\n\nThis is undeniably one of the best vr games out there now. Also doubles as a great physical activity. Oh you will definitely get sweaty playing this trust me\n\nHelpful | 1", "ExotticClutchYTDec 25 at 8:52 AM\n\nAmazing game Great for someone who is athletic!\n\nHelpful | 0", "JMoll88Oct 20 at 4:22 AM\nA Molley review\n\nOverall great game, I loved the training prior to the fights and the additional fight with the bouncer in the alley. This game gives its consumer a true dive into another life. From the physical exhaustion of the character to the players own physical fatigue. However I do see room for improvement, personally I have quite a busy life and not being able to save during the career mode forced me to start from scratch every time I returned. I know this game could gain even more of an appreciation with the saving addition. If not in this game then i would love to see another game that is like this with a personal feel to it. Where the player can customize his/her own character and have side quests out side of the gym that would utilize the oculus quests joysticks and allow the player to find himself in a tussle on the street making choices that effect his reputation as a person in the boxing community. As I said before this is a great game and I cant wait to see what kind of games these creators come out with in the future.\n\nHelpful | 0", "gamerkh07Jan 1 at 2:29 PM\nGreat for fitness\n\nRead title\n\nHelpful | 0", "lonepotato36Dec 25 at 11:31 AM\nGreat work out\n\nI am just a kid but this is a great workout\n\nHelpful | 0", "DavidQAKingNov 24 at 12:12 AM\nGood fights but it contains bugs\n\nThe fights look OK, but when I go for some training I'm misplaced in every exercise so I cannot do it cause I can't even move and it time counts so... And at random moments of loading the screen just go fully dark and the game continues even though I see nothing!\nAny fixes coming soon?\n\nHelpful | 0", "bennj73Jan 26 at 4:01 PM\n\nTracking and casting issues, doesn't work well\n\nHelpful | 1", "andylee4325Dec 30 at 6:29 AM\noften has black screen\n\nthis game often has black screen, this is a big bug ,you have to shutdown it.not hood\n\nHelpful | 2\nDeveloper ResponseJan 2 at 12:37 PM\n\nHi andylee4325, Sorry to hear your screen is blacking out while playing Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "420Brent420Jun 4 at 7:01 PM\nWas alrite\n\nNo updates or anything mp dont work\n\nHelpful | 1", "heathburr1995Dec 26 at 6:21 PM\nWorkout game\n\nThis game makes my arms hurt.\n\nHelpful | 0", "itsyourboy_AnthonyDec 14 at 10:45 PM\nIts the best\n\nLove the game because I came home mad and when you play this game it gets your stress out\n\nHelpful | 0", "casey.sherrellNov 30 at 4:48 PM\nFun as hell\n\nThis game is just fun as crap for this old boxer! Lol! Food exercise too! Except, I gotta quit getting so exited and hitting surf trying to box! Lol\n\nHelpful | 1", "priestedNov 13 at 6:59 PM\nGreat game!\n\nLove it. Thrill of the fight is good too but the atmosphere in that game is severely lacking. This game centered around the Rocky/Creed universe just really inspires you while playing. Both are great but I definitely prefer Creed.\n\nHelpful | 1", "FartingGoatDec 26 at 9:23 AM\nCreed\n\nAwesome game\n\nHelpful | 1", "LastActionHer0Oct 16 at 11:58 PM\nGreat but short\n\nThe game is a lot of fun. I really enjoy the gameplay but the story mode is a bit short. Im not sure if getting rights to other character would be possible but there could be an Apollo Creed story mode and a Rocky story mode to add some more to the game. Overall it is worth a buy.\n\nHelpful | 3", "InfernoDan1030Nov 11 at 6:39 PM\nWish rocky characters were realistic\n\nThe game is awesome like the fighting mechanics. The one reason to make it four stars is the character renderings dont really look like the actual actors.\n\nHelpful | 0", "yt_xandergamesghqDec 19 at 9:25 AM\nGreat Game\n\nIts good practice and its a workout\n\nHelpful | 0", "Wario_FartsNov 16 at 5:39 PM\nFun and Immersive\n\nThis game is very fun but challenging which isnt bad. You have the story mode and you can make your own custom fights. You can pick who you fight, pick your fighter, and where you fight.\n\nHelpful | 1", "JudeOsborneDec 18 at 2:09 PM\nAmazing\n\nGreat fun - also keeps me fit\n\nHelpful | 1", "Jude1xDec 25 at 4:55 PM\nfire\n\nfire\n\nHelpful | 0", "akalcoholic78Nov 9 at 11:30 AM\nCool till it cuts out\n\nPlaying the career mode on this was so much fun, I had a blast. While on my 3rd fight and it went to the 2nd round the screen just shuts off and all you hear are voices. Thought Id try it again and at the same spot it ddI the same thing. Waste of my money, maybe I need to do something . Until that gets fixed or I get my money back it a do not buy and 1 Star; otherwise itd be 5 stars and get this game NOW!\n\nHelpful | 2\nDeveloper ResponseNov 11 at 12:01 PM\n\nHey akalcoholic78, Sorry to hear you're screen is blacking out while playing Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a reinstall.", "Creed136Nov 28 at 9:41 AM\nReally good love it but the audio\n\nI love the game but the audio is broken when you record it cuts out on the recording\n\nHelpful | 1", "meantimeNov 29 at 11:42 PM\nGreat start, needs work\n\nCrashes regularly. Often positions me inside of training equipment. Game is basically unplayable if youre left handed. Even Rocky Balboa who is famously left handed is a righty in the game.\n\nHelpful | 1", "Lam-Ye-Moe-YeDec 20 at 4:49 PM\nGud\n\nGreat game\n\nHelpful | 0", "BaconNBeer69Mar 26 at 6:25 PM\nBlack screen\n\nThe game is nice but .. Cant go pass the second round in Carriere mode without a black screen :(\n\nHelpful | 0\nDeveloper ResponseMar 26 at 10:04 PM\n\nHi BaconNBeer69, Apologies for this black screen issue you're experiencing with Creed. Could you try fully re-installing the Creed app on your Quest, then see if you still experience this issue? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. If you're still experiencing this issue after a re-install, please contact us at support@survios.com!", "JOCA-VROct 21 at 12:02 PM\nGood Game,\n\nEven though the graphics are a downgrade from the PC . By no means this game is bad looking.. im very impressed of what the Developers managed to do with such low power mobile chip.!\nVery Fun and Run Silky Smooth!\n\nHelpful | 0", "Mikey.FlorsheimDec 19 at 4:01 PM\nGreat game\n\nHad lots of fun\n\nHelpful | 0", "KevinTheProNov 12 at 9:25 AM\nAwesome\n\nIt is amazing. The only tging thst could be better is you can sign in to multiple accounts in game.\n\nHelpful | 0", "Gokgoz32Oct 29 at 3:45 AM\nEverything gets dark during the fight\n\nAfter a regular training i start the fight. However sometimes i lose the display. Fight goes on, i hear the voice of fighting, but i cannot see anything. So there is nothing to do but restart the game.\nI'm very disappointed. This game was the reason for me to buy Oculus Quest. Now i rarely play...\n\nHelpful | 2\nDeveloper ResponseOct 29 at 6:01 PM\n\nHey Gokgoz32, Sorry to hear you're having this black screen issue during your fights. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still persists after a re-install.", "gamingjayNov 28 at 6:26 PM\nBEST GAME EVER\n\nIts so fun to play I enjoy it all the time its even better without the wire\n\nHelpful | 1", "smollboi1Dec 14 at 5:51 PM\n\n\nIts ight\n\nHelpful | 0", "redalert33Oct 18 at 7:53 AM\nFun boxing game!\n\nReally fun game, especially if you like the Rocky/Creed franchises. There are some odd control choices, like swinging your arms to walk, but once you get in the ring and understand that's how you get back up from a knockdown, it makes sense.\n\nHelpful | 1", "jeffyfuelOct 4 at 11:14 AM\nfun way to get the heartrate up!\n\nBeing a longtime fan of the Rocky franchise I was excited to give this game a try . The career mode is pretty brief but it does a good job of getting you the ring skills you need for the quick fights and pvp modes . I love the fact that they have brought back fighters from the older movies (Apollo Creed's stache is legit !) The quick fights let you choose from all of as playable fighters or opponents . These fights will have an arcade feel similar to the old Punch Out in the fact that you just have to learn the styles of each fighter and know your role . Doing this in VR with a towering Clubber Lang bearing down on you however is really a fun experience! Fight a few guys back to back and you can get a great workout also. Moving the difficulty setting from pro to champ really does not seem to change the opponent's ability other than to give them an iron chin so you really have to hit them an insane amount of time knock them out . Only glitch I have run into is between rounds I have actually been teleported outside the ring - at that point you have to use the locomotion and a little real room awareness to make sure you are back in the ring and also within the designated play space . PVP in theory is awesome . If you can find an opponent to mix it up it is an absolute riot . Unfortunately a lot of the people I have played against just stand there with their guard up and counterpunch like a machine gun once you throw your first punch . Since the force of the punch in real life does not seem to matter these pitter/patter strikes will still cause damage . Clearly it is not meant to be a boxing sim (I am psyched to try Thrill of the Fight when it is realeased) All in all Creed is a really fun game with graphics that are as good as can be expected .\n\nHelpful | 4", "Kevintakeshi6Dec 2 at 8:01 PM\nGreat game\n\nThis game is so fun and a workout\n\nHelpful | 1", "RZCRomanSep 26, 2019 at 5:48 PM\nReally Fun But\n\nThe game is really fun, but the career is not that much fun. I mean you just train and fight over and over. But the online where you can fight your friends and other people is a really good touch! \n\nOverall the game is really fun to play and if your not sure about buying I highly recommend that you do its totally worth it\n\nHelpful | 0", "yamil.castillo.733Nov 22 at 9:43 PM\nGood Game\n\nFor this time is super good the game but in a future this game have to be more longer\n\nHelpful | 0", "LordErnestJan 6 at 5:16 PM\nCould not play\n\nMotion sickness made this unplayable for me\n\nHelpful | 1", "DuAlBuLlS75Nov 25 at 7:47 AM\nGreat\n\nGreat game good exercise and a pretty good career /multiplayer mode\n\nHelpful | 0", "IJustGotThisTodayOct 15 at 1:52 AM\nAmazing\n\nAmazing game I still do think with the rocky legends update they could have added a little bit more like a apollo vs rocky but maybe I'm just being nerdy but overall great game\n\nHelpful | 2", "TomekOnVrSep 23, 2019 at 4:03 AM\nAmazing Apart from Bugs in Training\n\nPlayed the crap out of the demo and was blown away with how fun and exercising it is, only problem I have with the game is during training in between battles it doesnt always put you in the right position to complete the task, like the punching bag or piece of meat it sometimes places me a good couple meters away from it or behind it wich stops me from completing the task, once it happens in one task it happens in all tasks that come after it, not game breaking but annoying. Also would love to see some kind of intense training option where it tells you to do push ups or sit ups, jumping jacks etc that would be also fun, other than that amazing\n\nHelpful | 0", "YeezybousNov 13 at 6:48 PM\nGreat game\n\nGame was awesome but it was a little glitchy\n\nHelpful | 0", "ralf_dOct 27 at 12:34 AM\nWatch out if you played the demo\n\nI played the demo several times and let others try the app when they tried out my Quest. When I bought the game I was hoping to play the career mode but when I save it and close the app, the next time I open it, the career is gone and I can only start from the beginning. When I realized that (2nd day after buying), I asked for refund, as I didn't spend 2 hours with the full version of the game but after 1 week I received the message, that refund is not possible. No reason! Giving a \"no\" and no reason is just a bad attitude.\n\nEdit: the Switch was on \"allow to store\", so I uninstalled it and uninstalled the demo, reinstalled it and now it seems to work but I still don't know why the refund was not working.\n\nHelpful | 0\nDeveloper ResponseOct 25 at 11:35 AM\n\nHey ralf_d, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. If you're still having issues getting your Career Mode progress to save, please contact us at support@survios.com.", "chrisdothtmlSep 22, 2019 at 2:31 PM\nThis game is a workout\n\nThis is a great game. Very unlike other VR games. I am out of breath and sweating every time I play, and the training in between fights really gets you pumped to get in the ring.\n\nOnly issue I have is that the experience of blocking and recovery (e.g. from getting almost knocked out) can be a bit confusing. I usually am able to do what needs to be done, but it really breaks the immersion. When I'm punching and dodging an opponent I am 100% immersed and feeling awesome, but it gets ruined every time I need to run back into the ring or clumsily move my hands into 2 random circles that appear.\n\nI disagree with others talking bad about the fact that you have to put your fists up to recover stamina, I think it makes sense and makes it feel more like a real fight (where you would need to put your fists up to block yourself while trying to catch a breath)\n\nHelpful | 0", "evilbastrdOct 30 at 3:46 PM\nGreat Game\n\nAs one of only very few multi player games for Quest I have to give 5 stars, it's fun, it does seem to \"glitch\" a bit sometimes, but mostly its pretty solid game...Thanks developer!!\n\nHelpful | 0", "svendsenthor1234Nov 10 at 10:43 AM\nNice game\n\nI have played the game for a couple of hours and use it as a workout if you want to its great as long as you give it your Best\n\nHelpful | 0", "420WhachuSmokinOct 6 at 1:52 PM\nVery fun game and a great workout\n\nSwitch from Pro to Champ to get a great workout. By far my favorite Quest game so-far. Been playing for about 2 months to gain the fighting experience for PvP and champion fights, but the PvP mode does not find players locally so the lag is pretty bad.\nNote to the devs: Please make Creed search for the nearest players first in PvP to reduce lag in a round. Besides that, very fun game with awesome mechanics especially on a mobile processor.\n\nHelpful | 0", "CoachmeNov 27 at 8:39 AM\nGreat game\n\nLots of fun and great game play\n\nHelpful | 0", "KyndbyOct 11 at 5:35 AM\nVery nice but flawed\n\nThe game itself is really good and I use to get my daily excercise, BUT especially in the last training excercise before the big match, the area you should be in shifts during the differnt challenges. Therefore the runningmill/hitting bag and others is out of my play area and changing direction. very frustrating\n\nHelpful | 4", "madco2006Nov 16 at 3:11 PM\n\nThis is the greatest boxing game I have ever played. Never gonna stop\n\nHelpful | 0", "jeremiah.stakesNov 25 at 7:42 PM\nRidge Racer\n\nLove this Ganlme\n\nHelpful | 0", "mattbitconNov 26 at 11:42 AM\nVery fun\n\nGreat game\n\nHelpful | 0", "glenn.ratcliffe.961Oct 19 at 8:43 PM\nVery good but...\n\nThis is a very good game however pvp is very slow to find an opponent. Maybe when more people buy this, it will be better.\n\nHelpful | 0", "Tricks_7177Nov 28 at 8:36 PM\nCreed\n\nI love it so much\n\nHelpful | 0", "PhilitoNov 9 at 3:34 AM\nPhilito\n\nI bought this game when it came out, and it was great but now the game is awful the game stops for a second the speech and sound breaks up and its not player able\n\nHelpful | 2\nDeveloper ResponseNov 11 at 12:00 PM\n\nHey Philito, Sorry to hear you're having this problem with Creed. Have you tried fully re-installing the Creed app on your Quest then seeing if this issue persists? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if this issue still continues after a re-install.", "Peaceful_MindNov 2 at 11:18 AM\nToo fast game pace ending shortly\n\nUpdate: was nice when I first tried oculus but now I see it overpriced, no updates and boring. Multiplayer is no fun as players can cheat in moves, these days nobody online.\nPrevious review: Nice graphics and boxing exercise, however, all look alike.\n\nAlso, although the legendary Rocky is so like him, training keeps switching fastly from one task to another like a freaked out chicken not giving chance to poor Rocky to say what he wants.\n\nHelpful | 2", "dc640Nov 1 at 9:35 PM\nHorrible glitches\n\nGraphic is very nice. But so many glitches where the motion And position of the character is not in sync. The training sessions are confusing since glitches are so bad, you are not even near the treadmill or dummy bag. I want a refund\n\nHelpful | 5", "Mick3yTh3S4us3G0dNov 18 at 4:08 PM\n\nVery fun and a really good workout\n\nHelpful | 0", "BiltoniusSep 6, 2019 at 8:37 PM\nGood with small issues\n\nFirst off, I really like this game. The fights are fun and a good workout. The training is fun as well.\n\nThe biggest issue is during training when youre switching between activities, the positioning constantly gets messed up. Almost every time I do a training session I get put behind or beside targets or too far to hit them. Sometimes it starts you facing the wrong way and when theyre timing you these things are hugely detrimental.\n\nIt also occasionally glitches and wont let me walk to the door in the gym.\n\nIf the devs fix these issues, it would be five stars almost certainly.\n\nHelpful | 2", "icyyheadNov 3 at 3:09 PM\nCreed\n\nI think you should fight the characters from actual rocky movies besides that the game is awesome\n\nHelpful | 0", "sabgOct 7 at 6:19 AM\nStamina\n\nThe stamina ends very quickly. It would be great an option to remove it and allow the player to use the real stamina like a fit app.\n\nHelpful | 2", "MouldyCrotchSep 19, 2019 at 4:24 AM\nPVP Doesn't Work\n\nThe game itself is pretty good, but when I try to use the multiplayer mode, the game doesn't find any opponents! The only time I found an opponent was right when I had first purchased the game. But after that one time, I haven't found any opponents at all, and it's already been 3 weeks! I've been trying every day at several different times, with no success. I tried looking online for help but the Developer does't offer any customer service whatsoever. I've looked everywhere and can't find anyone to help. Im hoping someone will see this review and offer some kind of support!\n\nHelpful | 2\nDeveloper ResponseSep 3, 2019 at 3:43 PM\n\nHey MouldyCrotch, Sorry to hear you're having issues connecting to other users in PvP. There may be a chance you're getting unlucky with the player pool during the times you've tried playing :( Are you just sitting on an endless \"searching\" message when you tried to quick match? Also, we definitely offer customer service and can be reached at the following email address: support@survios.com", "prettybigpeen69Nov 19 at 7:25 PM\n\nGreat game\n\nHelpful | 0", "SurestSuid0091Nov 1 at 10:00 PM\nLike it!\n\nCreed, is very entertaining and fun. The graphics are great. The training and matches are awesome.\n\nHelpful | 0", "CalinksSep 26, 2019 at 5:46 PM\nThis is my favorite Quet game. Easily.\n\nI am a huge fan of the Rocky franchise. Creed was my favorite movie of 2015. So I come into this game wanting it to be good. Thankfully it really is. This game is a workout and I absolutely love that about it. You really feel like a beast and the fact that they use music from the movie adds SO MUCH to the experience.\n\nI do have two big complaints.\n\n1. One of the training mini games, the one with the dummy where you have ro repeatedly punch a green marker, that particular mini game almost always glitches for me. It doesn't detect all my hits and screws up training.its never been addressed.\n\n2. I just with the game was longer. If they could throw in 4-5 more generic opponents to go up agaisnt I'd love that.\n\nIf they make anorher boxing game with a career mode you can play through. Kind of like Fight night where you take on random generic challengers,have a record, and all of thar. I would buy it in a heart beat!\n\nHelpful | 1", "funkyteeSep 9, 2019 at 1:11 PM\nLove the game!\n\nI like the game but the guardian system changes view angels all of a sudden.\nCan create strange effects especially while in training.\nBut biggest pain is the non-saving! For some reason the career progress is not saved!! one has to start over and over again!\n\nUpdate: Hi developer team, thanks for the immediate reply! I really do appreciate. The game is finally saving my progress. Seems I also had to give access rights to the microphone as well.\nThanks again for the help! I updated and increased my rating accordingly.\n\nHelpful | 0\nDeveloper ResponseSep 5, 2019 at 3:01 PM\n\nHey funkytee, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom righthand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if you're still having issues saving your progress!", "Chris180Nov 17 at 9:20 PM\nAwesome\n\nAwesome\n\nHelpful | 0", "ASDsadsfg123Oct 3 at 10:22 PM\nGood game but weird tracking\n\nFun game good exercise but the tracking when u get knocked down start a new round or knock down the opponent messes up the guardian u set up. You end up knocking things around at the edge of your guardian and in worse case may even break the controller from punching a wall!\n\nHelpful | 4", "jmaytorenaOct 20 at 11:23 AM\nNice workout\n\nI love this game when playing against someone else, playing solo could be a bit boring, you can sweat a lot if you put up an effort :)\n\nHelpful | 0", "tkeletpisonOct 24 at 3:30 AM\nSlow jerky hand tracking\n\nReally awkward mechanics, punches register although pretty slowly, same thing with ducking. Blocking is confusing. Its decent fun though and you get a decent workout. Wish it would feel more fluid.\n\nHelpful | 1", "HexacolleyNov 1 at 3:17 PM\nThe best boxing game\n\nThis game is extremely fun to play and a great work out if you're not a fan of beatsaber\n\nHelpful | 0", "Yobro04Oct 28 at 11:14 AM\n\nAmazing it feels bigger and bether then thril of the fight you feel your actually in the boxing ring\n\nHelpful | 0", "logan.shephard.79Nov 23 at 5:07 PM\n\nMake the career longer and better\n\nHelpful | 0", "nerfer456Nov 30 at 7:49 AM\n\nthis game is the worst.I had fun until it erased all of my progres. do not buy.\n\nHelpful | 1\nDeveloper ResponseDec 5 at 2:23 PM\n\nHi nerfer456, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. If you're still having issues getting your Career Mode progress to save, please contact us at support@survios.com.", "saulvanillaNov 9 at 5:36 PM\nAwesome\n\nGreat exercise!!\n\nHelpful | 0", "ummwhatsureOct 14 at 9:11 PM\nTotally worth it\n\nSometimes you need to punch things. Ya know, because of life. This game let's me punch things. Also I am a huge rocky fan. Works great.\n\nHelpful | 1", "01kingjSep 27, 2019 at 11:18 AM\nExcellent but....\n\nI love this game, especially how emmersive it is... But it is so buggy....feels unfinished. The training may as well be excluded as I find that the game never places you correctly in front of the bag when it switches exccersises. But..... Stick to just the fights and skip the career and you will have lots of fun.\n\nHelpful | 1", "cutie_azn_boixOct 27 at 1:18 AM\nWhy not make multiplayer\n\nThey should make multiplayer is more fun fight with computer kinda boring\n\nHelpful | 0", "NuzhyOct 12 at 3:19 PM\nI love it\n\nIf u watch boxing or love boxing you might wanna try it\n\nHelpful | 1", "StokeleyZOct 8 at 8:14 AM\nVery fun! Campaign is too short though\n\nI love this game and it is excellent for getting the heartrate up, however I completed the campaign in about 30 minutes on medium difficulty. If they added more boxers in freeplay and a longer campaign it would be my favorite game I own\n\nHelpful | 1", "CaptainWigglySep 10, 2019 at 11:56 AM\nLove it, there gym is fantastic.\n\nWish the speed bag in the gym was better, and a jump rope would be better than the treadmill. Also my career progress didn't save but no big deal I'll just restart it.\n\nThat's the bad things. Everything else is great. Pick it up and get some sweat while you shadow box vs an opponent.\n\nGreat work out, great fun.\n\nHelpful | 0", "Jay_HoonOct 9 at 7:50 PM\nRealistic\n\nFirst review here. This game makes you feel you are really in the ring with another fighter. Good for cardio too. So glad that I got it!!\n\nHelpful | 1", "SwabereOct 10 at 12:42 PM\nFun game/Great workout!\n\nFantastic sense of emersion. My adrenaline is through the roof and at the end of each match I am exhausted. So fun!\n\nHelpful | 2", "elprovitoOct 29 at 8:56 PM\nCool and also good\n\nmy favorite part was accidentally killing Connor mcgregor\n\nHelpful | 0", "jleebondOct 25 at 10:12 AM\nLove this game!\n\nBest boxing game out there for VR...and what a workout .\n\nHelpful | 0", "akgorrellNov 19 at 6:37 PM\nIts ok\n\nWii sports works better and is a lot better than this game lol\n\nHelpful | 1", "TheDoomGuyMay 22, 2019 at 3:30 PM\nRing VS Guardian\n\nI set a big guardian space to match the ring size (so I can move phisicaly around) after that I do a \"reset view\" standing in the middle of my play space and then everything is ready to go... BUT, when first round finishes my character goes to the corner and the camera resets, then all that setup I did breaks and I have to do it again.\n\nI suppose a solution would be to have an option to phisically walk to the corners and then back to the fight, with no camera reset. This kind of things developers should care about when porting to quest! I know it's tricky.\nWhat u think?\nThanks.\n\nHelpful | 966", "frlecubeOct 22 at 5:19 PM\nToo short, lots of bugs\n\nThis game is not finished, it could have been great but it has a lot of camera, movement, and tracking bugs. For 30 usd it is a ripoff.. Buy Thrill Of The Fight.\n\nHelpful | 2", "PLAY3R_2Sep 28, 2019 at 12:06 AM\nGREAT GAME\n\nThe game works really well on the oculus quest I have two headsets and its so much fun boxing different people without the real pain\n\nEpic game definitely recommend !!!\n\nHelpful | 0", "colby.peterson312Oct 18 at 4:02 PM\nPhysically Awesome but tiring\n\nGreat game if you wanna get up and get some exercise\n\nHelpful | 1", "LamestGamrAug 29, 2019 at 11:57 AM\nLamestGamr Approved!\n\nI just do the training mode fights but find it an excellent value to add to my fitness regimen. Playing this on Rookie difficulty gives me a great workout and makes me feel like the boxing champ I could never be. I like how natural the boxing feels. It just gets down to the basics of blocking, dodging, jabbing, etc.\n\nHelpful | 0", "Rami_CASep 4, 2019 at 10:28 PM\nNot saving the career progress made\n\nHello, every time I start a career and do some achievements, it only lets me start from scratch whenever I start the game again.\n\nWhen I quit the game, I hit the main menu and then I hit the Oculus quest - a prompt comes up to hit X to exit the game or resume it.\n\nThat's my first game on Oculus Quest. What's the proper way for quitting the game but save the progress made?\n\nI love the game but given it 3 stars for this.\n\nUpdate: thank you so much; it worked!\n\nHelpful | 2\nDeveloper ResponseSep 3, 2019 at 1:01 PM\n\nHey Rami_CA, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom righthand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if you're still having issues saving your progress!", "dbradleyflOct 19 at 6:06 PM\nThis game doesn't get enough credit\n\nIt's amazing and a great workout.\n\nHelpful | 0", "ken666Sep 3, 2019 at 5:22 PM\npvp mode issue\n\nThank you very much for your answer, now it works ^^ You should explain that in the game because people can't guess that by themselves ! I updated the rate of the game by the way ! Cheers !\n\nHelpful | 2\nDeveloper ResponseSep 3, 2019 at 3:25 PM\n\nHey ken666, sorry to hear you're running into issues accessing Creed's PvP. What you're describing sounds like the PvP option is working as intended - you should load into an empty ring and see tutorial cards on how to use Advanced Locomotion. Once you advance locomote to other side of the ring (gold square on the floor), you should see an \"Exit Ring\" option in front of you. Select \"Yes\", then you should load into the PvP lobby. Apologies for any possible confusion on this! Also, if you're still having issue accessing PvP, please contact us at support@survios.com.", "juice_111Jul 24, 2019 at 10:09 PM\nPretty good... Needs updates\n\nYou will get tired doing this. This is the future I'm telling you right now. But the developers need to take their game more seriously and polish it to perfection. Hand tracking is good, but it loses tracking sometimes on gym exercises and in the ring, and it is incredibly frustrating, this should never happen. Also if you move your hands too fast, it will lose tracking. Also when you lose tracking in the ring, it will sometimes glitch insanely and you will get really dizzy. You have to somehow manage to restart the app during all this, very awkward. You can get stuck in the floor too. I play in a very large area and I am able to use the full ring, but the AI is incredibly stupid if you move around your opponent quickly, they are still looking in the other direction. AI is also way too aggressive just coming forward all the time, no tactics at all and does not adapt to your style. You will KO your opponent and not go the full 12 rounds even if you try. Huge oversight, at least allow me to get a full workout and not let the match end in 2-3 minutes because of KO. Also your legs in the game move extremely inaccurately. I understand there needs to be additional tracking for this, but what are you waiting for developers? It is god awful. Your arms and hands however do feel like your own in game though. Despite all that, you can still get a good workout. Use it for HITT for now, until they work out this mess. I am looking forward to Thrill of the Fight coming to quest, and it will probably a much better boxing simulator. This game still has potential though if the developers actually do something with it... Anyway I scored the longest time in the target dummy exercise, which made me feel a sense of accomplishment and most of all it's fun, but with major flaws. so please make it better. Pretty please...\n\nHelpful | 9", "m7.briggsSep 28, 2019 at 4:28 AM\nLove the on line consept\n\nTake time to find a friend to play with.\n\nHelpful | 0", "ChristosSupreme5Oct 17 at 6:10 AM\nReally good\n\nAmazing\n\nHelpful | 1", "imgradoAug 3, 2019 at 2:49 AM\nA Guardian Fix from 5 Stars\n\nLove the game. Action level, graphics, sound, presentation, its all there. The only missing piece is a guardian system that accounts for people with a full size playing space to accommodate the entire ring. I believe a setting that reads the center of your play space and places the ring accordingly would fix the problem of trying to guess how to reset myself every round or explain to guests why half the play space is outside of the ring.\n\nHelpful | 2", "iiiRavenOct 12 at 11:01 AM\nEpic\n\nEpic\n\nHelpful | 1", "StudioBugJul 31, 2019 at 2:35 PM\nAmazingly great but glitchy.\n\nI am only starting this great game, but I personally have glitchs. Mine starts in career mode during training. I will be in the middle of the bag or treadmill and cant back up. And when it goes to the next excersise, I have to find it as it may be behind me.\nso far thats my only complaint on my first couple go rounds.\n\nHelpful | 0\nDeveloper ResponseAug 2, 2019 at 11:48 AM\n\nHey StudioBug, sorry to hear you're experiencing this issue with the training/montage sections during Career mode. Just to gather more information: does this issue happen during a specific Chapter? Also, if you happen to have any video of this, could you email it to us at support@survios.com? Any additional information you have would be much appreciated :) Update: Forgot to mention, could you try the following and see if this helps with exercises being out of place. Once you get a \"Success\" on an exercise, try to avoid moving your controllers/touching any buttons until the next one begins. Let us know if this helps the problem!", "Explicit_storm42Oct 5 at 12:42 PM\n\nLiterally an amazing game nothing else to say\n\nHelpful | 0", "Buster_7fireAug 14, 2019 at 12:11 AM\nWho wants to be Rocky?\n\nOne of my fav games! Always the top three. I enjoyed the gameplay until it got to advance modes. If your not right in front of your opponent then it has trouble seeing you? Calories burned would be great as this game could be a work out plan. Regardless I love this game! Buy it! 5 stars even with the bug.\n\nHelpful | 1", "Jasonwolf21Jul 29, 2019 at 7:55 AM\nLag in Multiplayer\n\nThis was my first game in Oculus and it was amazing but for some reason when I went to Multiplayer the game would crash or be super slow to the point where the opponent almost teleports but in all its a really good game. Also why not make story lines for each character like rocky or apollo I know its gonna be hard but itll make the game more interesting\n\nHelpful | 0", "CaptainhutchoSep 15, 2019 at 1:02 AM\nVery good 5 star\n\nIt really made me think I was in the game and it is the most fun Ive had in a while that is why it is easily 5 star \n\nHelpful | 0", "elladovOct 5 at 10:57 PM\n\nThe best game ever\n\nHelpful | 0", "cigasdnaJul 28, 2019 at 9:29 PM\nFun, but a lot left on the table.\n\nThe career mode is decent but the PVP is where the excitement lies, and it could be so much better.\nIt takes WAY too long to connect with other players, if at all. You should be able to fight with created players, and unlock gloves, trunks, etc. I would also like to see a leader board!\n\nHelpful | 0", "veetown42Jul 25, 2019 at 12:49 PM\nIts really good but...\n\nThe gameplay is great. I definitely get a good workout from it and its a lot of fun however, when Im playing the campaign mode, it doesnt allow me to save my progress so I have to re-fight the same people all over again. Maybe I dont know how to save my progress if there is please let me know?? Otherwise its a lot of fun and I enjoy playing.\n\nHelpful | 0\nDeveloper ResponseJul 26, 2019 at 2:25 PM\n\nHey veetown42, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom righthand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if you're still having issues saving your progress!", "shady365ovrAug 9, 2019 at 9:27 PM\nYo ,Adrian this games Amazing\n\nThis game on the Quest is brilliant!! Such a great workout I bet youll be sweating like crazy! Graphics are excellent and the feel of fighting is fairly legit! The only thing I wish is that the fighters didnt stand so close all the time..I guess you can use the controls to move a bit but its kind of a funky way (rolling your arms) but Im pretty sure thats intentional as it also contributes to the sweating! This is a MUST own!\n\nHelpful | 0", "RydertheblazerAug 15, 2019 at 2:02 PM\nPlease add More To Career\n\nI have played through the Career mode many of times and I cant stop Thinking way havent they added more. If you guys can add more to the Career it will be a great game. And a 5 star.\n\nHelpful | 0", "dawn.m.carsonOct 6 at 2:05 PM\n\nLIT\n\nHelpful | 0", "umend7Sep 10, 2019 at 5:20 PM\nAwesome but..\n\nEverything is cool about this game, but the controller tracking is horrible since the new update. My controllers constantly disconnect within this gave almost all the time, even with good WiFi and environment. Would give a 5, but this issue is frustrating and needs to be fixed.\n\nHelpful | 1", "ZickenMomSep 14, 2019 at 3:17 PM\n\ni bought and played the rookie lvl today. now i don't have arms any more. help... anyone.\n\nHelpful | 1", "MattymochismoAug 15, 2019 at 1:03 PM\nScreen keeps going black, please fix :(\n\nWhen Im playing a free play fight, at least once a day my screen goes black, but I can still hear audio and if I start punching I can even hear my opponent grunting in pain, but there is no image and it is annoying me very much. I didnt pay $30 for my screen to go black and having to restart the game and lose my progress in the fight, I also didnt pay $30 for a broken PVP server. I would very much appreciate a fix for at least the screen problem, and if you cant fix this then maybe you should bring the price down to at least half of what it is now. Its not all bad, I play this game everyday and I loved the story, I played through all three modes. Another thing is that I feel that Champion mode on Quest is easier than PCVR and PSVR Champion mode, a lot of people on reddit are saying how hard it was to beat Ricky Conlan in the story on Champion, but I beat him in two tries, maybe Im just really good, but I doubt it. Maybe add a even harder mode or boost the difficulty of Champion. One more thing now, a Rocky Story DLC would be so cool. I would love to live out the story of the original Rocky movies, you already have all the Characters he fights, except for the Spider guy he fights in the club. Anyways fixes would be appreciated, and these add ons would be awesome, thank you ;D\n\nHelpful | 3\nDeveloper ResponseAug 16, 2019 at 4:26 PM\n\nHey Mattymochismo, Apologies for this black screen issue you're experiencing with Creed. Would you mind contacting us at support@survios.com so we can help troubleshoot/gather more information from you?", "SugarlandMikeMay 21, 2019 at 9:21 PM\nLove it!\n\nI was worried this would feel like a downgrade from the psvr... but it did not at all. I am amazed at the performance on a mobile processor. I love ditching the wires.\n\nHelpful | 179", "Mediocre_GamingAug 3, 2019 at 2:15 PM\nWii sports?\n\nOkay, this is not at all like Wii sports. But its absolutely amazing. The punches feel great, the hitboxes are rock solid, and its great exercise while still being fun as hell. In terms of character variety, its amazing. But it cant beat Wii sports. Adolf Hitler cant bowl with Steve Harvey and Shaggy. Occasionally also with Brock from Pokmon. (this is an actual thing Ive done with my friends)\n\nHelpful | 0", "scrappy.brainsteinAug 13, 2019 at 4:08 PM\nA boxing masterpiece\n\nThe game is superb it is accurate movement it is innovative to find realism and it did just that. a 10 out of 10 top 3 VR games.\nI like to give credit to a game that deserves it that's why this game gets a 10 score.\n\nHelpful | 3", "DouglasC.VJul 13, 2019 at 5:50 PM\n\nThis game just blew me away! At first I was just visually amazed at the graphics and I absolutely love the fact that all Rocky characters are included and are playable. I also love the the advantage of dogging instead of blocking because of the slo-motion mechanic. Hey also just love how the game is more interactive in more parts such as getting KOd or getting hit really hard by your opponent. But, on the downside, sometimes the training montage will move you out of place and you would have to go outside you play area to get in a good position.\n\nOverall I think this game is spectacular and could be even better if some bugs were fixed.\n\nHelpful | 2", "Playvr5Sep 30, 2019 at 7:50 AM\nI have one issue for play with friends\n\nI can't play with my frinds that has oculus rift s. I've oculus quest. Why?\n\nHelpful | 1", "DDay619Jun 21, 2019 at 9:50 PM\nAmazing; so bada$$, but...\n\nBeing able to box in VR is incredible. This game can make you feel like a bad a$$ mofo. I think it's the only first person game on the Quest that models your whole body. It can be a legit workout; my shoulders are pretty sore from boxing a lot the last couple days. I recommend taking frequent breaks as long sessions make me feel a bit discombobulated.\n\nThe graphics are a bit cartoonish, but I really like the art style. The crowd just repeats one person with different colors, but it's just a sea of people when your in the midst of a fight so who really cares.\n\nStill, I have a few serious gripes. The tracking can't keep up with my fastest movements. If I'm really giving a quick flurry then the game doesn't register each strike and you can see it glitching. After many hours this is becoming a dealbreaker.\n\nThe next fix I would like to see is the opponents circuling around while fighting like in real boxing. Also, the \"advanced\" walking mechanism is not great, just ok, and it doesn't work to walk backwards in the training gym like it does in a fight. I wish there was a setting to control the \"walking\" with one of the analog sticks, perhaps the left since the right controls snap turning. That said, I do really like the training exercises. They add a lot to the overall experience. However, it can be buggy and erronously spin you all around when it quickly switches between exercises.\n\nWhat irks me most about Creed RTG is that the AI does't really get any better at boxing technique. To win on the hardest difficulty you simply have to land about 30 hits to 1. Furthermore, it seems like the real life speed of your punch has very little to do with the power and associated impact of said punch in game. That sucks.\n\nThis is so close to being a 5 star game and it will blow your mind for the first hour or two. Then you just start to grow frustrated with the glitches and AI.\n\nUpdate: Multiplayer isn't very playable. It takes a few minutes just to get paired in a match. The opponents arms just ragdolled all over the place. It was neat, but needs work.\n\nDevs: For the love of all that is holy, please fix the treadmill exercise. Every single time it kicks me out to Oculus Home because I'm spinning my arms too fast. No, I'm not accidentally hitting the Oculus button.\n\nHelpful | 72", "Emilian1978Aug 1, 2019 at 2:42 AM\nGood game\n\nI finished your game in 2 days. Kinda short.\nI don't have any reason to play it again.\n\nThe force of my real punch isn't visible in VR. But I guess this is a game for kids also. Also my poor fighter is gettin' so easily fatigued. I'm good to go but my toon is almost tired dead :)))) This is funny and it make me feel good about myself. I'd rather have a realistic mode, where the game adjust itself based on the speed and force of the player. But I guess such programming requires a complete new game.\n\nThere is another boxing game here for Oculus Quest, similar to Beat Saber. You should steal their idea or do something to offer some way to play your title again.\nOnce completed on all difficulty levels, there's nothing left to do. I don't want to play it all over again. It's boring and isn't offering any new challenge.\n\nSuggestion: add some way to keep the fun. A survival arcade mode ... something to keep us playing your title.\n\nThanks. Overall you did a very good job with this title.\n\nHelpful | 0", "G3BishopSep 12, 2019 at 11:22 PM\nI want to love this...\n\nBut cant due to poor performance...dropped frames and severe lag keep this from being one of my favorite Quest games. Shame really, but at least its cross-buy.\n\nHelpful | 0", "hunterbuchanan23Aug 13, 2019 at 8:37 AM\n@TheDoomGuy\n\nTry playing outside and turning the guardian completely off I think this will solve your issue. This game is amazing but even more so when you are free to move wherever without the guardian. Must be outside for that tho\n\nHelpful | 1", "Emanuel20Aug 2, 2019 at 11:13 AM\n\nOverall, this is a great game to have. I genuinely get a workout (sweating through my clothes) when I fight. It's a great exercise game and fun overall. Plus it teaches the basics to boxing.\n\nHelpful | 1", "jkoegleJul 4, 2019 at 6:33 PM\nFloat like a butterfly, sting like a bee\n\nThis game will greatly improve your stamina and gives you a great workout. Slip the punches and work head, body, head, body, hook when you get tired. Keep them guessing.\nWait for openings and Work. The. Angles...\nNever stay in one place, keep moving around, but don't run away. Its exciting to go head to head. You'll be a champion in no time.\n4 stars only because the training was lacking and you can't build your character. It would be awesome to have training on utilizing boxing technique, add squats/lunges, jump rope, climbing rope, sledgehammer, flipping the tire, and speed bag excercises. Make a super difficult champion mode. Not where one hit will knock you down, but make the opponents use counter punches, dodges and let's go all 12 rounds. That would be insane. Great Game!\n\nHelpful | 4", "HarGrimnirSep 4, 2019 at 9:20 PM\nBest with a clear space.\n\nWho would have guessed I would jam my finger on a real punching bag swinging at a virtual one.\n\nHelpful | 1", "HenmfGAug 17, 2019 at 7:32 PM\nWow I mean wow\n\nThis thing is amazing I mean Ive personally never experienced nothing like this originally brought for the kids but now Im going to have to buy them another this is ridiculous\n\nHelpful | 0", "liam.duncan.trcAug 4, 2019 at 9:39 PM\nDodging and blocking are terrible\n\nHas so much potential for one of the first big boxing sims. On medium difficulty, opponents hit through gloves like they don't exist and are undodgeable unless you duck into a full squat. Having sparred many times in real life this is a horrible approximation. Seemed like it was going to get more fun and it just got extremely frustrating as the game went on. I'm a fairly heavy hitter irl and I felt like a wet noodle in this game against opponents with sledgehammer hands.\n\nHelpful | 2", "VogtqfevAug 11, 2019 at 11:47 AM\nPolished game with big handycap\n\nI like this game, how it looks, sounds, the training and presentation. But the endurance systems sucks and kills completely my gameflow. This should be optional, however.\n\nUpdate:\n\n\nThe endurance system annoys me to death.\n\nIt is impossible to fight authentically. Clinching is not as effective as it should be.\nIt is not possible to deal with the opponent with fast hard strokes or even keep him at a distance.\nI can only recommend \"thrill of fight\".\nHope it comes soon to the quest. Until then, it works pretty well with ALVR.\n\nHelpful | 3", "Matt2WagSep 8, 2019 at 10:31 PM\nNot adapted to quest.\n\nLong standing review about how dev has not localised properly to quest. Game also glitched on me making it stay logged in so long I cant get a refund. Double bad standards please read this and save yourself\n\nHelpful | 1", "wannacookAug 8, 2019 at 1:52 PM\nUGH... Love this game but.....\n\nI really like this game for working out.. Controller tracking gets a bit off now and then but that's understandable given the speed youre boxing....\n\nMY issue is the game will NOT save. Ive been through the story line to winning the first championship but still cant figure out how to save it. I think there's soemthing wrong with my download as when Im in the gym and it asks if i want to start training, the button is large and the only choice is \"YES\", leading me to believe that the menu is too big and the \"no\" is below, hidden..... along with SAVE button???\n\nAny help here please????\n\nId go 5 stars but having to restart the game every time and since its so physical, you can only get so far!!!\n\nHelpful | 0\nDeveloper ResponseAug 8, 2019 at 5:36 PM\n\nHey wannacook, Sorry to hear you're running into issues keeping your progress saved in Creed on your Oculus Quest. Did you happen to deny the initial Creed message requesting access to photos, videos and files? If so, this would explain why your progress keeps resetting every time you reboot your headset. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress successfully saves? Steps to enable storage access for Creed on your Quest: - Power on your Oculus Quest and navigate to the Creed: Rise to Glory app in your Oculus Library. - Click on the 3 dots located at the bottom right-hand corner of the app, then click on \"Permissions\". - On the Permissions screen make sure you have \"Storage\" toggled on. Please contact us at support@survios.com if you're still having trouble saving your progress, after trying the above.", "mako2009Aug 17, 2019 at 8:11 PM\nAwesome game very tiring\n\nIt is a awesome game but it is very tiring and a good workout and you cant use a big guardian to walk reason being it resets you in the corner every but really awesome\n\nHelpful | 0", "bobulatorSep 25, 2019 at 8:02 PM\n\nThe game glitches out sometimes is there a fix for that?\n\nHelpful | 0\nDeveloper ResponseSep 26, 2019 at 12:15 PM\n\nHey bobulator, Sorry to hear you're running into issues with Creed on your Quest. Not really sure what you mean exactly by glitches, but have you tried fully re-installing Creed, then seeing if you still experience this problem? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still experiencing this issue!", "crrizziJul 1, 2019 at 12:17 PM\nCool and awesome game - BUT\n\nI am a huge boxing fan, and I was craving to have this game. Everything is pretty cool, nice designs, nice story nice control handle.. and now comes my \"BUT\":\nI am a lefthanded person, or as boxers call it a \"southpaw\" there is no chance to change, and it makes it a bit strange to play like this. On the other hand, I can't tell for sure that the right punches are stronger than the left ones. So, I hope there will be an upgrade for us southpaws and make boxing more realistic (btw Rocky Balboa was a southpaw too.. I'm just sayin' )\nThe game is still great! I love it!\n\nHelpful | 2", "LegendaryDadJul 5, 2019 at 5:20 PM\nYou up for a challenge?\n\nPlay the career on hard. Love this game. VR noob and boxing lover here. I personally think it's pretty good. I'm OG tho. So... I been around since Mike Tyson punch out on NES. (I still have nes Tyson punch out) this is the same caliber game as TPO but in a new era. The future is NOW. :-D\n\nHelpful | 7", "tonydahtigerAug 12, 2019 at 6:48 PM\nA few glitches away from a great game\n\nUnfortunately all my complaints have been noted repeatedly in the comments, but I will reiterate anyway.\nIt seems every training montage I get turned around or the punching bag is way outside my guardian so I can hit it.\nUppercuts do t seem to register at all.\nPVP is non existent. Ive waited ages for an opponent, only to have the game crash when it finally connects:I think maybe the Devs have moved on to some other game because they dont seem to be fixing the problems with this one.\nReally too bad because its a great game when its actually working.\n\nHelpful | 1", "Cyborg777Aug 2, 2019 at 8:02 AM\nGreat, but with problems...\n\nThe game is a great workout, and is a lot of fun. However, the training routine is seriously broken. When you are done with one item in the speedrun training, it moves you on to the next thing. However, when you teleport to the next part of training, it will often put you on the wrong side of the bag where you can't reach the target. Or you will be facing the wrong direction.\n\nThis is especially problematic because apparently how well you do on these training sessions determines how much stamina you get in your next fight.\n\nHelpful | 0\nDeveloper ResponseAug 2, 2019 at 11:56 AM\n\nHey Cyborg77, Apologies for this issue you're experiencing with the training/montage sections during Career mode. Just to gather more information: does this issue happen during a specific Chapter? Also, if you happen to have any video of this, could you email it to us at support@survios.com? Lastly, could you try the following and see if this helps with exercises being out of place: Once you get a \"Success\" on an exercise, try to avoid moving your controllers/touching any buttons until the next exercise begins. Let us know if this helps the problem!", "CCyberJun 29, 2019 at 3:19 PM\nAwesome! However...\n\nI must say this game is pretty awesome and intense! The Oculus Quest is my first VR device I have ever owned and its impressive. Graphics are impressive for a mobile chip and the tracking is spot on for me.\n\nNow for why it is 4 stars and not 5. Is there no way to have multiple campaigns in the game? My wife and I both use our Quest and play this game and as far as I can tell you can only have one saved version of the game at a time?\n\nI have not had the game very long so someone please tell me I am just missing this option?\n\nHelpful | 0", "SlicknastyAug 9, 2019 at 3:26 PM\nHonestly, it was programmed so lazily\n\nIf you are at the edge of you guardian space (Im on quest) and move to the middle and reset, it basically makes you go back, it only slo-mos on 1/100 of dodged punches. The training is a gimmick to make the game feel bigger, but if they fixed those things it would be 5 stars for me. But, thats what I expect from epic games\n\nHelpful | 1", "MxgullaAug 29, 2019 at 10:13 PM\nVery disappointed\n\nI was so hoping to like this game, but there is HORRIBLE skipping and playback issues during gameplay on the quest. Will have to request a refund, unless there is some setting that can fix this.\n\nHelpful | 1\nDeveloper ResponseSep 3, 2019 at 3:08 PM\n\nHey Mxgulla, sorry to hear you're running into these issues with Creed on your Quest. Have you tried fully re-installing Creed, then seeing if you still experience these problems? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still experiencing these issues!", "SamaritanManJun 24, 2019 at 6:31 PM\nIs not a 30 vr game!\n\nThere are tracking issues and inaccuracies on punch detection, especially on the fastest ones.\nSimilar issues are not acceptable on a 30 title!\nI'm happy however as a good work out game, but not as a box simulation one.\nSolving the punch detection issue is much more important than graphic quality or the choice of the legendary Rocky character.\nPlease do something to solve the punch detection issue at least and i will give you 5 stars.\n\nHelpful | 0", "nattilioJul 9, 2019 at 9:23 AM\nSo close\n\nSend me a friend request so we can box .\nThis game is so close to being the ultimate boxing game. Lets get the online play going an include rankings and scheduled matchups that can be viewed by other fighters. Get the controls a little better synched. Dont let the game decide when we get tired . Let the player get tired on their own. Have a damage bar that shows how close you are to getting knocked down or out. Allow players to tie each other up. Im sure there is more but this game is definitely going in the right direction.\n\nHelpful | 7", "mrtuckerMay 27, 2019 at 6:38 AM\nIts ok but lots of issues still\n\nI love boxing in VR and Thrill of the Fight was my favourite game on the Vive. However there are lots of issues with this one:\n\n1) when doing exercises the space seems to spawn around and behind me to I cant actually hit the bag. My room is not huge so I physically cant step back\n\n2) The controllers reset the view when you click the trigger or move the joystick which means I cant grip the controllers correctly without it resetting me.\n\n3) when fighting I get to the center of the ring and reset the view however when its the end of the round it goes back which means I have to reset it every time just to stay in the play area\n\n4) The tracking doesnt pick up fast punches which is really frustrating.\n\nOverall its the best you can get on the quest so I will continue playing for that but it feels like a lazy port as some of these issues are a simple fix. I think it could be much better\n\nHelpful | 15", "benjamin.vega.946Jul 13, 2019 at 12:31 AM\nGreat potential, needs updating\n\nThis game is a lot of fun and One if the best boxing experiences/exercise outside of Beat Saber.\n\nGripes 1: The loss of tracking during gameplay. Many others have mentioned this and it does not appear the developers are trying to fix this issue.\n\nGripe 2: Gameplay is very short. You only fight a few boxers in career mode and than you become champion. Would be nice to have a story mode for each character and a random request from other boxers to defend the title.\n\nGripe 3: Limited characters, rings, rounds, and audience background. Need more!\n\nGripe 4: No disqualifications. Illegal punches are not registered. Some boxers punch after the end bell, low blows dont exist and punching after the boxer is KOd does not register either.\n\nHelpful | 3", "Godislove4uJul 23, 2019 at 6:08 AM\nBig hollywood that brings it.Jesusaves!\n\nThis on the other hand smells great.I always would fall for pumped up exploited ads for movies turned into games.Bring mod or dlc that adds real boxers like Tyson and Joe Louis.One of the best vr experiences,it's sleek,polished and totally comfortable.A workout or retro nostalgic movie review.Mostly always being let down by quickly released games to push and plug movies.This game is really too notch.It's a real boxing experience and with many alternate options.Praise Jesus !\n\nHelpful | 0", "tristan116Jun 25, 2019 at 7:16 PM\nGreat in quest\n\nAmazing job porting this to the quest I've only played on psvr before this but this held up so well the character models are incredible love the detail of the wear you do to their body's , bigger your playspace the better almost got it to size of ring once and that was a game changer , my only complaint which honestly you can work around as long as your aware bringing up the gloves to block if you do it right to your face the cameras have an issue seeing the controller's just remmeber to keep hands a bit further away a few cms not alot\n\nIf you like rocky or sports you will love this im personally not a big fan of either and still enjoyed this put a huge smile on my dad's face too and he enjoys the rocky movies\n\nHelpful | 2", "DancesWithNoobsJul 30, 2019 at 5:23 PM\nCamera reset kills it!\n\nThis will be my second refund request for a game. The montage sequences make you reappear way too far away from the activity... like the heavy bag... and a camera reset just throws me behind the bag instead of in front of it where I need to be. You cant use the walk function to correct your location either.\n\nI had REALLY high hopes for this game but its definitely not worth the cost unless they fix the bug.\n\nAlso, why render the body? Seriously? The foot physics just make it look goofy and breaks the magic of the experience when you look down and the feet are crossed over one another or floating in the air. Lame.\n\nThis BIG headline title with name recognition behind it... and the lack of new titles coming at a decent rate is almost enough to give me buyers remotes and make me want to return the whole system.\n\nHelpful | 1\nDeveloper ResponseAug 1, 2019 at 3:14 PM\n\nHey DancesWithNoobs, Apologies for this bug with the montage sequences ruining your experience with the game. Was this issue only happening during the montage sections of Career mode? If so, do you happen to remember what Chapters you were experiencing this in? Sorry again for this negatively affecting your time with the game.", "cYcisJun 2, 2019 at 3:45 PM\nPvP doesn't work\n\nFirst impressions, the game looks good and is fun for half hour on campaign mode. I mainly bought this game to play PvP though, but as others have said you never get matched with any opponent.\n\nI don't believe after leaving it almost half an hour that there is no one to play a 1v1?! Please fix this asap, people are going to get pissed off and want a refund.\n\nHelpful | 13", "sinkkingJun 14, 2019 at 9:53 AM\n1:1 realistic shadow boxing\n\nThe chatacter animations are so realistic.\n\nIf you have enough space you can turn off play area altogether by turning on developer mode in the android app then turning off the gaurdian system in the headset settings.\n\nLike someone else said it would be nice if there was a real 1:1 ringsize mode where you could simply walk back to your corner at the end of each round then your position in your play area wouldn't get messed up.\n\nI still give it 5/5 for what it is, I think less than 5 would be misleading people.\n\nHelpful | 7", "smitdogAug 6, 2019 at 4:49 PM\nAwesome App.\n\nI always wanted to get in a boxing ring. This is the best next thing to the real thing. Awesome App\n\nHelpful | 0", "dommommaJul 14, 2019 at 7:38 PM\nGreat, but one thing\n\nI know the developers cant fix this, but I really wanted to play multiplayer online. 20 minutes in to the queue and there is still nobody. Nonetheless, playing with bots is still super fun.\n\nHelpful | 2", "SammySamdalsJun 18, 2019 at 2:54 AM\nReally fun, needs some tweaks\n\nTo start off I think this game is really fun to play and its actually a fairly decent workout if you really get into it. But my main two problems are number one: multiplayer doesnt seem to work, I can never find anyone in matchmaking even if I wait for a very long time, and problem number 2: I always get annoyed at how fast my character runs out of stamina, I feel like it should just be based off of the players real life stamina because sometimes I just wanna go crazy on my opponent but my character runs out of stamina almost instantly and I have to stop and pause for a moment. Other than that Ive had a good overall experience with this game.\n\nHelpful | 0", "DingYeaJun 14, 2019 at 6:10 PM\nGreat game\n\nI love this game. But I only play on career mode. It make me do some exercise everyday. (At least move my body as I am such a lazy bone).\nBut I cant find the way to save game and therefore I need to play from the first match every time. I am appreciate if someone can teach me.\n\nHelpful | 0", "JL_Picard83Aug 19, 2019 at 7:27 AM\nAmazing!\n\nThis game is amazing! Its fun and its kind of a workout. Its really the only game I play on the Quest, for now. I would like to see longer rounds, more fighters and the ability to increase your fighters stamina (gets tired very quickly). Other than that its perfect!\n\nAddendum: Updated this. I want Mason Dixon.\n\nHelpful | 2", "Cap-1918Jul 6, 2019 at 1:02 PM\nPVP broken\n\nEnjoying the single player experience of this game but the main reason I bought it was to play PVP with friends. Have spent far too much time trying and failing to get this to work or connect. It tells me my friends are not in the game when they are, it says I'm not online when I am and it just wont connect to a game, eventually timing out and starting the whole process again. Really disappointed as this was one of the most expensive games purchased on Quest. If anyone knows of a fix this would be greatly appreciated\n\nHelpful | 7", "Draken67May 24, 2019 at 7:21 AM\nCrossPlay ?\n\nHi, I've just bought Creed and I can't play against my friend on Rift. Even if we are both in the Game, on Rift Creed tells that I'm not playing Creed, and on Quest it doesn't show my friend on the board.\nIs it possible (or planned) to PvP between Quest and Rfit (and Steam) ?\n\nHelpful | 5", "missashley1234Jul 17, 2019 at 8:03 AM\nOne of the best way to exercise on vr\n\nHere is a great game. I love to play and get my exercise on. I wish they would take off the outer body experience and the move your Arms to move around the gym is not a good ideal.\n\nHelpful | 0", "UsernamemarcJun 8, 2019 at 4:58 AM\nSolid game but has some load issues\n\n3 white dots on black background (initial load screen) just continue. Help please? :)\n\nUpdate: uninstalled and reinstalled (thanks!) and now works great. Havent done PvP yet, but good training mode. Great to make cardio enjoyable at home\n\nNew update: game now froze in career mode. No buttons worked. Turned oculus off and now wont turn back on and wont charge. No charge light all. Have a ticket into survios and oculus. Will update once resolved.\n\nUpdate newest: found forums online. Held power button in for 20 seconds and now rebooted/turned back on.\n\nHelpful | 0\nDeveloper ResponseJun 7, 2019 at 8:27 AM\n\nHey Usernamemar, apologies for this loading issue you're experiencing. Also, we never received a support request from you - did you contact support@survios.com? In the meantime, could you try full re-installing Creed on your quest? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us if you're still having loading issues after re-installing!", "darrell.elliott.98Jul 19, 2019 at 12:19 PM\nIt's ok\n\nNot bad but collision detection can be well off at times and the AI can take 3x as many hits as you with no effect.\nFighters get tired way too quickly it ruins the fun a bit.\n\nAlso not being able to skip the fighter intros is pretty lame.\n\nHelpful | 0", "biggoobsAug 6, 2019 at 9:02 PM\nCreed\n\nBest game on quest. Great game for intense workout. I love it!!!\n\nHelpful | 0", "ImSofaKingLazyJul 16, 2019 at 9:31 PM\nBuggy but has Great Potential\n\nThe demo runs just great, then you buy the game and then it gets buggy. In training it spawns you behind or way far to the side of training objectives. It even spawns you at the boundary of the guardian zone which makes this dangerous. At times it will spawn at a black screen and then you need to exit and restart the game, losing your progress. Its a great game when its working... Im going yo refund this and will wait until the ratings get better to buy again when the bugs are fixed.\n\nHelpful | 1", "ray1204May 28, 2019 at 5:54 PM\nGreat but play space reset issues\n\nThe game is great with a good career mode. You can build up a sweat real quick playing this game. Its like a workout. The fighting mechanics are great with occasional clipping and sometimes your punches go right through the person. The one problem this game has is when you knock down your opponent and they get up, the play space seems to shift a bit and your opponent is suddenly to close. You have to take a full step backwards to offset this. Another problem is training mode when you go through all the different exercises . Everything should be just locked in front of you but its not. I found myself off to the left or right and having to adjust and then the whole play space tracking is messed up.\n\nUpdate:what? Thats it for career mode... only one chapter? Such as disappointment. I though I was Creed and work my way all the way to the top, I was wrong.. half finish game took a star off...\n\nResponding to developers: Ok, I found out how to select the chapters. Thanks. Put a star back on the review. Will there be an update on the space and clipping issues?\n\nHelpful | 4\nDeveloper ResponseMay 28, 2019 at 1:17 PM\n\nHey ray1204, We wanted to reach out to you regarding your comment on there only being 1 chapter in career mode. There should be a total of 7 chapters. Just to be clear, are you playing the full version of the game or the demo?", "ernestishMay 21, 2019 at 4:29 PM\nExcellent!!!!\n\nReally impressed with it,you sweat like a real gym.Great cardio workout. Should try it!!!!\n\nHelpful | 35", "TwinTurbo74May 29, 2019 at 1:52 PM\nGood, can be great if some issues fixed\n\nI had a blast playing this game, it looks and plays great. I did read other reviews saying that the position of your character can veer off in training mode and was hoping I wouldnt have that issue but by the third training session in career mode I ran into this issue and it made it unplayable...even holding oculus button didnt fix it. I know the devs read the comments so I hope they realize this is not an isolated issue and release a patch to fix it. Otherwise awesome game.\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 2:25 PM\n\nHey TwinTurbo74, Thank you for the report! If you have any footage of this happening to you during gameplay, could you submit it to us at support@survios.com?", "antoine.bartJun 30, 2019 at 4:48 AM\nFun but frustrating\n\nHi Everyone - Hi to the devs,\n\nI only rate this game 3 stars as there are still some technical issues triggering a lot of frustration in game for me - Mind, I'm going to bash open doors here as most of the complains I have have already been mentioned by other players.\nAs a former amateur boxer, I jumped straight into the gym for a bit of training to see whether I could get a bit of sweat going on and enjoy the game mechanics.\n\nI find the tracking issues to be the most frustrating:\n- when you get some padwork (with Balboa THAT is awesome), it's not clear why some punches do register and some don't. (speed? hands positioning?) Following advice I found online, I tried to keep my hands well inside the tracking area of the device, but still, I found my gloves weren't where I wanted them to be way too often. (or is it my muscle memory that makes me position my hands too close to my head, hence losing track, without even realising it?)\n- when I move freely in the gym with the intention of picking and choosing a workout, I tend to position myself in relation to my real life reach. Starting a minigame just messes up your reach, distance and placement towards the target. I find that the default starting position is way too close forcing me to step back - and therefore messing your Guardian setup.\nIt might be my boxing style that doesn't work great with the game, but I find it difficult to keep the distance, as the game keeps pushing the target right in front of your face when you're just trying to get your reach right.\nI'd much prefer it if the game would allow to trust the player to position themselves properly and not force their positioning system onto you.\n\nSo overall, it's a good game, hats off to the devs! But players that know a minimum about boxing, sparred and trained in real life, will find the limitations frustrating.\n\nLet's hope the devs come up with a nice update and Oculus fixes that tracking issue soon!\n\nBest, A.\n\nHelpful | 2", "Noemis78Aug 3, 2019 at 4:27 AM\nNot just a game\n\nOne of my favority quest games. Really good to use as workout.\n\nHelpful | 0", "unskilledjaredJun 9, 2019 at 10:47 AM\nVery fun!\n\nThis game is a blast to play but sometimes it messes up and thinks your standing somewhere your not. For example, when your training and it sets you infront of the punching bag... Sometimes it will set you behind the bag not letting you complete your training.\n\nHelpful | 0", "TheGoodGuy414May 30, 2019 at 10:01 AM\nFun\n\nI had this for PS VR and I felt limited to the movement I could make due to the wires. With the quest definitely makes it a lot more fun being able to dodge and duck without the worries of pulling anything. My only complaint is that the game already has its own barrier. You are still able to take a step or two to the side or back.\n\nHelpful | 1", "MihaiDinulescuJun 16, 2019 at 4:16 PM\nPlay in Hard\n\nThis game is difficult and rewarding. I beseech the devs to patch the large room scale issues, the little pad is too small for a device made for the Quest. I cannot deduct points however because the AI is strong, the motion tracking is superb for the somewhat limited hardware, and the sense of dread when facing a larger opponent is palpable. If you have a small space... this review might be a lot less applicable for you...\n\nHelpful | 0", "carson.reidMay 26, 2019 at 6:08 PM\nVery limited game and features\n\nSave yourself the $30 and buy a different game. Pros and cons below.\n\n+ Fun 5 minutes for friends who have never played VR\n\n- Short (30 min) non-challenging campaign mode\n- No skill advancement in campaign mode\n- Limited features leading to the same boxing moves over and over\n- PvP just doesn't have a big enough community and you never find opponents\n\nHelpful | 10", "Hassan-LionJun 18, 2019 at 1:32 PM\n1 of the best\n\nOne of the best games on the oculus however I wish it was longer and had more fights.. and a proper build up... Maybe you guys should do more updates with more characters\n\nHelpful | 4", "Kayobot00May 25, 2019 at 9:19 PM\nGreat game but...\n\nThe game is great and will get your heart rate pumping. There is a story to the career mode so its not all matches. The voices sound like rocky and Jordan B aka Kill monger.\n\nUsing room scale mode in a 8ft x 8ft space. There are some issues I had with the exercise section before a match. It would sometimes spawn me behind the intended exercise. This is annoying as the there is a timer and being correctly oriented is key.\n\nThe matches are great. Having room scale allows for easier side stepping for hooks and body blows. However you can tell this game was designed for a more stationary experience, as running around the opponent is far too easy.\n\nHelpful | 3", "xman7Jul 2, 2019 at 6:27 AM\nSimply a must-buy\n\nIf you don't go to the gym or exercise much you have to get this game. Never have I had so much fun working up a sweat. If you can play this game for 30 minutes to an hour you are in great shape.\n\nHelpful | 2", "AZman360619Jun 30, 2019 at 4:14 AM\nWonderful\n\nThe game is fun and exciting, but the issues when you start a new activity, I.e camera reset, really ruins the experience sometimes.\n\nHelpful | 0", "wintereagleJun 7, 2019 at 2:47 PM\nGreat game\n\nThis is a great game I would just like if on the free play mode the characters that you fight had a mix up of their own programmed movements because when you face the other characters they have no challenge the all fight the same way.\n\nHelpful | 2", "arthur2089May 24, 2019 at 1:24 PM\nHow long can you last?\n\nSure, you survived those two KOs, and ended your opponents win streak, but are you up for a rematch? Chances are, your going to be a lot more winded then you thought. This game gets your blood going, and you have to manage your stamina not only in game, but in real life too. Sure there are noticeable differences when playing on my Rift S, but Id argue the lack of wire makes this version the better choice. Thank god for cross buy.\n\nHelpful | 6", "Stryder121May 24, 2019 at 1:10 PM\nAwesome\n\nOMG this is so amazing. I'm not exactly into boxing but i grew up with the rocky films and i enjoy boxing games. I always wanted this kind of thing in the days of the wii, or even hoped the switch might give me something along these lines with the joycon.. But, no... The quest is where it's at, and i absolutely love it. If you grew up with the films and love a good work out this is for you. Highly recommended.\n\nHelpful | 6", "diomarkMay 23, 2019 at 4:51 PM\nQuite a workout!\n\nPleasantly surprised by this game. I had played it on Rift before, but kept getting tangled up in the headset wires.. It's awesome on the Quest, and the graphics do not feel downgraded.\n\nHelpful | 5", "lcfitz1Jul 26, 2019 at 11:10 AM\nAwesome boxing game!\n\nGreat workout and lots of fun!\n\nHelpful | 0", "joueur22May 31, 2019 at 9:38 AM\nPvp quest / rift cv1 ???\n\nFOR DEV :\nI NEED TO KNOW: the pvp mode with a friend between rift cv1 and oculus quest is this possible? I see my friend online since the quest but he does not see me from CV1 and I have an error saying he does not play the game?\nis the game compatible? (I buy a copy on each 2 different accounts but without success, I need a reply please thank you\n\nHelpful | 1\nDeveloper ResponseJun 5, 2019 at 2:22 PM\n\nHey joueur22, To make CREED: Rise to Glory perform to our standards on Quest, we had to significantly rework the game's code and art assets. Unfortunately, for there to be cross-play between the Quest and PC versions of Creed, the code and assets need to be nearly identical. This was not possible due to the amount of optimization required to make Creed successfully perform on Quest.", "Djgates06Jun 23, 2019 at 12:48 PM\nGreat workout\n\nHaven't play this over played the cartoon version of punch out on psvr but decide to get on the quest pretty fun game and gives you a great workout 5 stars also like it got multiplayer.\n\nHelpful | 0", "baronvonmusclesMay 26, 2019 at 4:42 PM\nSore muscles\n\nThis game is so fun to get wrapped in. It gives me the sense I could really kick some butt which could not be further from the truth. This story lets me believe the sweetest of lies that regular old Joe can achieve greatness from his living room. This is the reason we do VR to escape into something rewarding and amazing. Wow I love this game. I always wanted to be Michael B Jordan and this lets me do that!!\n\nHelpful | 2", "The_CrawfSep 11, 2019 at 3:48 AM\nUndecided after playing demo\n\nI decided to give this game a go because I like boxing and I saw some YouTube videos of people boxing properly while playing this game. Once you get used to not putting your hands to close to your face and not to throw punches when your stamina is depleted the tracking works well. If you have a big play space its a lot of fun and you dance around the ring get a good workout and have fun the same time. All without actually getting punched in the face which was one of the things I didnt like about real boxing.\n\nHelpful | 2", "PieMan69Jun 13, 2019 at 2:11 PM\nGood but has a few issues\n\nI loved this game first when I got ready to play but my excited attitude started to diminish. First of all, the training section of the game relies heavily on the placement of yourself in the real world; so if you are not near perfectly standing in the middle of your play space, youll be very badly oriented during training. Secondly, I ran into a bug when I first faced Dwayne The Rhino Reynolds; after I knocked him out in the first round, he wouldnt get back up for TEN MORE ROUNDS until I decided to reset the game. Lastly, I am fairly short as I am young so my height in game is very short compared to the characters in the game. This makes it very hard to fight them. I think you should always be eye-level with the other characters unless it is for exaggeration purposes or reasons related to that. I very much hope these issues are resolved in the future because I really like this game.\n\nHelpful | 0", "KippaDRJun 24, 2019 at 11:59 PM\nI want a 12 round actualty\n\nFrom the demo I see potential.. I want the fatigue and brutality of a 12 round fight.. I want to work it.. I have tried the demo and I want the full engage of the stamina and strength it takes to go a full 10-12 rounds.. does the full game have it? I'm not sure\n\nHelpful | 0", "G59BoycrossAug 7, 2019 at 12:34 PM\n\nVery little gameplay\n\nHelpful | 0", "Azz81Jun 14, 2019 at 8:11 AM\nNot bad at all!\n\nCreed is alot better than i thought .. Hand tracking is good most of the time ..really good in the mini games!\nCool arcadey boxing game.\n\nHelpful | 0", "7ironJun 1, 2019 at 8:00 AM\nRing vs Guardian II\n\nThe game in itself is nice. Two flaws. okay, maybe even more.\n\nI feel that the training part of the game is rushed somewhat. I imagined the training part would give you a workout, train your skills in the game. It blazes through training in arcade mode, telling me that I completed only a few exercises, which is an incorrect score sometimes.\n\nMost annoying is that after one part of the training is finished and it rushes to the next discipline, I am more than often, out of position, looking round frantically for the object to do the training on. This sometimes costs me the score as the training is timeboxed: over before you know it.\n\nNext problem is with positioning and guardian. During the fight I lose my stance towards my opponent more than often. The oculus recalibrate button steers me towards my own corner, making me have to search for my opponent.\n\nI dont know how the Rift version is, but, although promising, the Oculus Quest version is certainly flawed. Perhaps because of the time to market. Wanting to be ready by the Quest Release date.\n\nHelpful | 2\nDeveloper ResponseJun 12, 2019 at 3:55 PM\n\nHey 7iron, just wanted to touch on the 2 flaws you mentioned. For the training part: it sounds like you're referring to the Career mode training section, which functions as a montage. If you're looking for training that focuses on just 1 exercise, please give the \"Exercises\" option under \"Freeplay\" a try - this may be more what you're looking for. For the recalibrate button steering you out of position: Have you tried using the Focus button while in a fight? This is the \"B\" button on your right Quest controller. Using this button will adjust your orientation so your opponent is right in front of you. This should help alleviate losing track of where your opponent is in the ring. Also, if you have any other issues you're experiencing, please contact us at support@survios.com. Hope this helps!", "chaingardenJun 2, 2019 at 11:37 PM\n\nFun game and good exercise, but they really have to figure out the positioning. It feels like theyve actively hampered the Oculus button functionality to reset your position. This is the type of thing Id expect Oculus to work with developers on to ensure every game matches the quality theyre after. Maybe Im just missing something obvious? Really having trouble getting my position re-centered so Im not backing up against my couch. Again though, the actual game is great aside from this.\n\nHelpful | 2", "lutias360May 27, 2019 at 7:41 PM\nServios is awesome\n\nYou guys make the best VR games. I have Sprint Vector, Raw Data on my Vive. I got the Quest and tried this game. The mechanics are amazing, graphics are very good and walking movement is incorporated from Sprint Vector. Having a blast!!! Dr S Cardiologist\n\nHelpful | 0", "BigelowedJun 2, 2019 at 1:50 PM\nFeels the same as on PC\n\nBut of course it does look a little different, not horrible nonetheless!\n\nHelpful | 3", "hadipartoviJul 4, 2019 at 11:28 PM\nManage the play area better\n\nThe Oculus Quest has a Guardian play area, this game should manage the boxing ring to match the guardian\n\nHelpful | 1", "TaskingCatMay 24, 2019 at 6:55 PM\nOne Downside\n\nYeah, its wonderful and all but I have two sons. One has PSVR, One has the Quest, both have Creed but cant play together\n\nHelpful | 3", "twistednipsJun 16, 2019 at 10:01 PM\nSolid Boxing game\n\nGreat cardio workout, just wish getting into the game was faster.\n\nHelpful | 2", "Bigmike846Jun 14, 2019 at 9:38 AM\nTo much glitchibg\n\ni just received my oculus quest and im a little disappointed in Creed, i dont luje the fact tou cant save where you stop, i have to go back to the beginning of training i hooe they fix the glitching problems too\n\nHelpful | 0\nDeveloper ResponseJun 14, 2019 at 11:54 AM\n\nHey Bigmike681, sorry to hear you're having issues saving your progression in Career mode. Could you make sure the Creed/Oculus app has access to your storage, then see if your Career mode progress saves? You should definitely be able to save your progression.", "peterlam268Jun 3, 2019 at 8:39 PM\nGood boxing VR app\n\nI would prefer the control would be more intuitive. The game play and the graphics are nicely done\n\nHelpful | 1", "Don_HassoMay 25, 2019 at 10:06 PM\nNearly perfect\n\nSlight tracking failers and the camera resets after each round, so my big guardian does not longer fit to the ring. But overall very good game.\n\nHelpful | 0", "King0fSpaceJun 24, 2019 at 6:13 PM\nRushed for release\n\nOne of my favorite games. Just a handful game breaking bugs here and there that keep me from giving it 5 stars. My guess is theyve moved on to the next game.\n\nHelpful | 0\nDeveloper ResponseJun 26, 2019 at 11:53 AM\n\nHey King0fSpace, sorry to hear these game breaking bugs have negatively affected your experience with Creed on your Quest. If you wouldn't mind, could you contact us at support@survios.com and share what specific issues you're experiencing?", "IIBelicIIJun 2, 2019 at 2:30 PM\nExpect single player only\n\nLove the game and the calories you burn but I bought this to play online, which isn't working. I have a 1000/1000 fiber and even if I wait for 20min I can't find a opponent.\n\nHelpful | 3", "marcalangriffinMay 23, 2019 at 2:31 PM\nReally faithful adaptation of Rift game\n\nIf there were only more active players for PVP...\n\nHelpful | 4", "Aqua-VRJul 25, 2019 at 5:13 PM\nOculus updated tracking, 5 stars now\n\nI like Thrill of the Fight more for realism, but this is more of an arcadey type game, and is really fun\n\nHelpful | 2", "CoolouJun 23, 2019 at 9:30 PM\nGreat workout\n\nThis game is a great workout and is very fun\n\nHelpful | 0", "gemini1976May 22, 2019 at 12:11 PM\nGood port\n\nI thought it was better and more accurate than psvr\n\nHelpful | 4", "TastycreamJun 4, 2019 at 11:34 PM\nWont download\n\nI purchased this today and the game just keeps saying pending it wont download and I have more then enough space to be able too\n\nHelpful | 0\nDeveloper ResponseJun 5, 2019 at 1:59 PM\n\nHey Tastycream, sorry to hear you're having issues downloading the game. Please contact us at support@survios.com if you're still having this issue!", "SuperFly00May 23, 2019 at 6:28 PM\nGlorious\n\nPerfect game with friends\n\nHelpful | 5", "kody.stampsAug 4, 2019 at 10:48 AM\n\nCool game I like it\n\nHelpful | 1", "VigilanteBantonMay 26, 2019 at 1:14 PM\nPretty good!\n\nJust need more players for pvp! Add me for a fight  VigilanteBanton\n\nHelpful | 1", "carlos_laMay 28, 2019 at 8:24 PM\nTons of content\n\nWay better than I'd expected.. there's PvP, PvCPU, a gym, a trainer (stallone), multiple characters, montage mode.. well worth the money\n\nHelpful | 1", "coolkid7Jun 3, 2019 at 10:04 PM\nNeed help!!\n\nRuns great but the sound on recordings is glitched and when Im fighting my right controller while throwing a punch just floats there in place and have to stop and wait for it to return to position\n\nHelpful | 1\nDeveloper ResponseJun 5, 2019 at 1:58 PM\n\nHey coolkid7, would you mind contacting us at support@survios.com so we can help troubleshoot this these problems with you?", "AzazanJul 12, 2019 at 1:35 PM\nGame wont load\n\nOnly the demo will work. I bought the full version and now the game will not load( just tries to). Will change rating when they fix\n\nHelpful | 2\nDeveloper ResponseMay 25, 2019 at 12:27 AM\n\nHi Azazan, Sorry to hear you're experiencing loading issues with Creed. Have you tried fully re-installing the game? If that doesn't help, please contact us at support@survios.com and we can help troubleshoot the issue with you!", "PanamaCabuya70Jun 11, 2019 at 1:41 PM\nAnnoying Sound On Facebook Live-streams\n\nFacebook Livestream, anyone viewing your Livestream on Facebook, will get this extremely annoying statistic noise, when youre against your opponent.\nThis turned off 2 of my friends from buying the Quest.\n\nHelpful | 1\nDeveloper ResponseJun 12, 2019 at 2:28 PM\n\nHey PanamaCabuya70, Apologies for the audio issues you're having when you stream on Facebook. Would you mind contacting us at support@survios.com so we could gather more information from you?", "donnyjoeJun 8, 2019 at 7:19 AM\nGood luck\n\nTwo things that Quest will always fail on: throwing and punching. This game really showcases the weaknesses of the Quest.\n\nHelpful | 2", "fewsterJun 18, 2019 at 12:57 PM\nDoesnt work\n\nCant even begin the game press a and x to walk doesnt work at all want a refund\n\nHelpful | 2\nDeveloper ResponseJun 18, 2019 at 2:28 PM\n\nHey fewster, Sorry to hear you are having trouble getting the locomotion to work in Creed on your Quest. Just to be clear: are you swinging your arms while you're holding the X and A buttons down? If you're still having problems, could you please contact us at support@survios.com so we can help troubleshoot this issue with you?", "aidenviosey021Jun 16, 2019 at 6:11 AM\nWont work\n\nWhen I launch the game and try and select a menu thee button dosent work Ive tried ever\n\nHelpful | 2\nDeveloper ResponseJun 16, 2019 at 11:41 AM\n\nHey aidenviosey021, Apologies for this issue you're experiencing. Please contact us at support@survios.com and we'd be more than happy to help troubleshoot this problem with you!", "quitesubMay 22, 2019 at 2:00 PM\nWow\n\nFeels like real gym workout felt knackered after 2 fights gorgeous graphics what a VR experience\n\nHelpful | 4", "mark.burton22May 30, 2019 at 8:47 AM\n\nVery good\n\nHelpful | 1", "SoapySonMay 23, 2019 at 11:18 PM\nFighting Fantasy\n\nAllowed me to live the fighting fantasy. Such a good workout and so fun wow\n\nHelpful | 4", "Firesnake45May 27, 2019 at 1:34 PM\nDone right!!\n\nMini games are worth it alone for reflex training. I have been waiting a long time since PS2 kenect and kinect.\n\nHelpful | 0", "FadboyJun 10, 2019 at 4:30 PM\ntracking issues\n\nGame is fun, there are some bugs that need fixing; biggest issue for me is the tracking.\n\nHelpful | 1", "PrimeTQuest4May 24, 2019 at 12:10 PM\nExcellent\n\nThis game is great and it gives u a work out too. Slight tracking flaws but very fun.\n\nHelpful | 1", "nils.evensenMay 28, 2019 at 8:20 PM\nGreat workout!\n\nI love the gameplay, this game is my favorite workout!\n\nHelpful | 1", "agoodname4allJun 7, 2019 at 9:36 AM\nSensors\n\nThe game is great but I would like it if the sensors wouldnt mess up every five seconds\n\nHelpful | 1", "AkALoPyMay 27, 2019 at 6:32 PM\nGood game for quest\n\nI like the fact that it has a training room with mini games nice touch\n\nHelpful | 1", "ragan.murphyMay 27, 2019 at 7:15 AM\nOnline PvP\n\nOnline PvP not working, either with friends or quick play. Bought it to play with my friends. Im very disappointed.\n\nHelpful | 2\nDeveloper ResponseMay 27, 2019 at 12:27 PM\n\nHey ragan.murphy, sorry to hear you're having issues connecting to PvP. Would you mind contacting us at support@survios.com so we can gather more information from you?", "jon.viktor.50May 24, 2019 at 1:34 AM\nOmg\n\nAwesome game\n\nHelpful | 3", "UniversalGalaxyMay 29, 2019 at 12:21 AM\nWow\n\nWow\n\nHelpful | 1", "batborisMay 30, 2019 at 11:33 AM\nHands tracking issues\n\nThere is a big space for improvement regarding the hands tracking.\n\nHelpful | 2", "Hardgains88Jul 15, 2019 at 12:51 PM\nDemo was good.. BUT game doesnt load!\n\nSeems like a great game based on the demo, so i purchased the full game. Unfortunately the most fun i have gotten is watching the three little circles loading!!! I try to load it every few days but it just wont load! I have a 3 week old 128 quest and purchased 5 other games which work perfectly. I dont use many free apps either because i use my go for those, so i am barely touching the memory in my quest. Theres no reason for this game not to load and work. Ill hopefully get it to work this week or ill ask for a refund but very disappointed!\n\nHelpful | 2\nDeveloper ResponseJul 15, 2019 at 3:46 PM\n\nHey Hardgains88, Sorry to hear you're having issues loading Creed. Could you try fully re-installing the Creed App on your Quest? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still having loading issues after re-installing!", "louisa.deitzMay 23, 2019 at 8:14 PM\nI paid and not getting it down loud\n\nBull money in the drains 33.00\n\nHelpful | 4\nDeveloper ResponseMay 28, 2019 at 12:13 PM\n\nHey louisa.deitz, sorry to hear you're running into this issue with Creed on the quest. Please contact us at support@survios.com and we can help troubleshoot this problem with you!", "pleglerMay 26, 2019 at 12:42 PM\nBuggy, keeps crashing\n\nPlease fix!\n\nHelpful | 2\nDeveloper ResponseMay 27, 2019 at 12:26 PM\n\nHey plegler, Apologies for the crashing issues you're experiencing with Creed. Have you tried fully re-installing the game? If that doesn't help, please contact us at support@survios.com and we can help troubleshoot the issue with you!", "bruce.coleroMay 24, 2019 at 2:00 PM\nDoesnt load\n\nThe demo loads. The full game doesnt. Just shows the 3 dots blinking.\nEven with the demo tracking seems to be a problem. How do I get a refund?\n\nHelpful | 4\nDeveloper ResponseMay 25, 2019 at 12:26 AM\n\nHey bruce.colero, Apologies for the loading issues you're experiencing with Creed. Have you tried fully re-installing the game? If that doesn't help, please contact us at support@survios.com and we can help troubleshoot the issue with you!"]