{"App Title": "Dance Central", "App description": "Dance Central is back! Designed from the ground up for VR, Dance Central immerses you and your friends in the worlds best dance club experience where you are the life of the party and nobody steps on your toes.\n \nDance Central includes a 32 song soundtrack featuring chart-toppers from the 1970s through to todays biggest hits. With two difficulty levels and unique routines choreographed for each song, theres plenty to keep you dancing all night.\n \nDance Central also features the franchises first dive into synchronous online multiplayer. Customize your look, take an in-game selfie and then meet up with friends in the multiplayer lounge to party, chat, and dance your hearts out. With cross-play, you can compete against your friends on both the Oculus Quest and Rift Platform in free-for-all or team dance games to see who's the best in the crew.\n \nDance Central supports cross-buy. Buy once, play on both Oculus Quest and Rift Platform.", "Purchase section": "$29.99Add to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer, Co-op", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Music, Social, Sports", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "1.2.1", "Developer": "Harmonix Music Systems, Inc.", "Publisher": "Oculus Studios", "Website": "http://www.dancecentral.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "GAMES\n \nMUSIC\n \nCOMMUNITY\n \nBLOG\n \nABOUT\n \nJOBS\n \nPRESS\n\nPRIVACY POLICY AND YOUR CALIFORNIA PRIVACY RIGHTS\n\nLast modified: May 24, 2018\n\nThis Privacy Policy describes how Harmonix Music Systems, Inc. (Harmonix, we, us or our) collects, uses and otherwise processes information, including personal data, that we collect from and about our Users (defined below).\n\n1. WHEN THIS PRIVACY POLICY APPLIES.\n\nThis Privacy Policy applies to the information, including personal data (or equivalent term), that Harmonix collects and processes about users, players, customers, purchasers, and/or subscribers (each a User) of our software, games, applications, content, websites and other activities and services (collectively, our Services), including, but not limited to, those Services made available through gaming consoles, personal computers, mobile devices, digital distribution platforms, social networking websites or any versions thereof. This Privacy Policy does not apply to any websites, services, products or applications maintained by other companies or organizations to which we may link.\n\nThis Privacy Policy is intended to provide our Users with information about how we collect, use, disclose, and otherwise process their personal data, the choices Users have related to our processing of their personal data, and how Users can exercise their access and other rights over their personal data.\n\nBy providing your information to us through the Services, or otherwise using any of our Services, you understand, acknowledge and unconditionally accept that Harmonix may process your information, including personal data, in accordance with this Privacy Policy. IF YOU DO NOT WANT THIS PRIVACY POLICY TO APPLY TO YOU, PLEASE DO NOT USE OR COMMUNICATE WITH US VIA ANY OF OUR SERVICES. If you access the Services through a digital distribution platform, social networking website or mobile version thereof, you may be required to also read, accept and comply with its privacy policy.\n\n2. INFORMATION THAT WE COLLECT\n\nHarmonix collects information, including personal data, directly from Users, automatically via use of the Services, and in some cases, from third parties. The information that Harmonix collects about Users (which may be combined across Services and features) varies depending upon the particular Services used, and may involve the following:\n\nA. Registration. To the extent we offer user registration on the Services, to register as a member of any of the Services, you may be required to provide us certain information that is identified on the registration page. Depending upon the Service, this may include your name, a user name and password, and other information, such as your country of residence, email, contact information and date of birth. Additional information may be requested during the registration process (but not required). Certain Services will not be available if you decline to provide the required information.\n\nB. Information from Third Party Accounts. You may be able to connect certain third-party accounts (each a Third Party Account)  such as Xbox Live, PlayStationNetwork, Facebook, etc.  to your use of the Services, so that, among other things, you can connect with your friends and network and share game information. In addition to linking a Third Party Account, we also may allow you to login to certain Services through certain third party accounts, including Facebook http://www.facebook.com/about/privacy/ (each a Third Party Account). If you choose to login this way, you are asked to share certain information with us (which may include name, email, friends and public profile information); the specific information and whether it is required or optional is stated on the permissions page when you login with the Third Party Account.\n\nC. Subscriptions and Purchase Information. If you make a purchase or sign up for certain subscription-based Services, you are required to provide your payment information, including name, billing and shipping address and details, payment type, as well as credit card number or other payment account details (e.g., PayPal) to the third party from which you are purchasing such items. We do not collect, receive, process or store any payment information, including credit card or debit card numbers, or other third-party payment account credentials (e.g., PayPal); this information is collected directly by these third parties. Depending upon the Service, we may receive your username, name and information on the items that you have purchased (including entitlements).\n\nD. User / Device Identifiers. When you access, play or use our Services, we may collect IP address, MAC address, console identifiers (e.g., XUID and PUID), and other device identifiers; we may also assign account holders a unique user identifier, which we use to identify and link relevant information to your User account (e.g., in-game information such as statistics, scores, and achievements). In an effort to provide a safe and fair gaming environment to all Users, we may employ \"anti-cheating\" software or applications during the use of certain Services to prevent fraudulent activities and behaviors that may negatively affect the experiences of a User. When creating a profile for certain Services, we may collect data about your personal computer in order to create a hash of machine components.\n\nE. Subscribing to Emails, and Participating in Sweepstakes, Contests, Surveys and Similar Activities. Users can sign up online or in-person (e.g., at tradeshows) to receive direct marketing communications from us, including emails about game launches, developments, and upcoming releases. If you agree to receive direct marketing communications from us, we collect your email address, and we may also collect your name, date of birth, preferences, and, if relevant, information about the Services and other games you use. We may also run contests, sweepstakes, surveys or other events or activities (collectively, events) on our websites and social media channels. Information collected for these events may include your name, date of birth, email address, and other information. To the extent you win a prize in a sweepstakes, you may be required to provide your mailing address and tax-related information.\n\nF. Your Communications. When you email us, call us, or otherwise send us communications regarding the Services, we collect and maintain a record of your contact details, communications and our responses. We may also maintain records of the in-game communications and information that you post in chat sessions, forums, and in other areas of the Services.\n\nG. Your Activities, Stats, Friends and Preferences. We collect usage and preference details related to your use of the Services, including, but not limited to, language, in-game purchases, game-play statistics, scores, persona, characters, achievements, rankings, time spent playing, click paths, game profile, preferences, friends) and other data that you provide to us as a User.\n\nH. Automatically Collected Information. We also may automatically or indirectly collect information about you, your computer or mobile device (such as when you use our Services, read our emails, through social media channels). We (and our third-party providers) may record log files and use cookies, pixel tags, local shared objects, java script, and other mechanisms to collect this information about you. For more information, see the How We Collect Your Information section below.\n\nI. Information from Third Party Sites. We also may use third party tools to help us manage and analyze our social media presence, and report on comments, mentions and other content that is posted about us on social media sites and other public channels and forums. These third parties activities, and their information collection and sharing practices, are subject to the terms of the relevant social media site, channel or forum. We will use this information in accordance with this Privacy Policy.\n\nChildren. Harmonix does not knowingly request or collect personal data from children younger than 13 years of age. If you believe that we may have unintentionally collected personal data from a child under 13, contact us as set forth at the bottom of this Privacy Notice, and we will take action as necessary to securely delete such information.\n\nUnless otherwise specified above, generally we collect your information, including personal data, on a voluntary basis. However, as noted above, if you decline to provide certain information that is marked mandatory, you may not be able to access certain Services and we may be unable to fully respond to your inquiry.\n\n3. HOW WE USE YOUR INFORMATION\n\nGenerally, we may use the information, including personal data, that we collect from you for the purposes and lawful bases described below:\n\nFor the performance of our agreement with you. The information referred to under Section 2 A, B, C, D, E, F and G above may be used to provide our Services to you, including to run contests, sweepstakes or other events or activities in which you participate; improve your gameplay experience; provide tailored customer services and support; matching; and to handle your questions and requests.\n\nTo comply with a legal obligation to which Harmonix is subject. Any information referred to above in Section 2 may be used to maintain appropriate business records; comply with lawful requests by public, governmental and other regulatory authorities or the courts in any relevant jurisdiction; and to comply with applicable laws and regulations; or as otherwise required by law.\n\nFor our legitimate commercial interests. The information referred to under Section 2 D, E, F, G and H above may be used to improve and develop our products and services; analyze the use of our Services and generate aggregate statistics about our User community; personalize your experiences (e.g., for your geographic area); send or display targeted marketing; facilitate software updates; assist in security and fraud prevention; for system integrity (preventing hacking, cheats, spamming, etc.); facilitate our business operations and maintain appropriate business records; operate company policies and procedures; facilitate our response to legal process (e.g., a court order, warrant or subpoena); enable us to merge, sell, acquire, or transfer assets; and for other legitimate business purposes permitted by applicable law.\n\nUse of information based on your consent. We may use personal data about you based on your express consent, for example to send you marketing communications, surveys, news, updates and other communications. Users may be able to withdraw their consent at any time in accordance with applicable laws; please see the Communications Choices and the Access, Amendment, and Other User Rights sections below for information on how to withdraw your consent.\n\n4. HOW WE MAY SHARE YOUR INFORMATION\n\nHarmonix may disclose your information, including personal data, as follows:\n\nService Providers and Processors. We may engage vendors, agents, service providers, and affiliated entities to provide services to us or to Users on our behalf, such as support for the internal operations of our websites, products (such as our games) and services (e.g., message board operations, and technical support processing), as well as related offline product support services, data storage and other services. In providing their services, they may access, receive, maintain or otherwise process personal data on our behalf. Our contracts with these service providers do not permit use of your personal data for their own marketing and other purposes.\n\nAffiliates. We may also share your information with our affiliate companies for purposes of assisting us to operate and market our Services. Our affiliate companies are subject to this Privacy Policy when they use your information.\n\nLegally Required. We may also disclose your information if we believe we are required to do so by law, or that doing so is reasonably necessary to comply with legal processes; when we believe necessary or appropriate to disclose personal data to law enforcement or other governmental or regulatory authorities or the courts (in any relevant jurisdiction worldwide), such as to investigate actual or suspected fraud or violations of law, breaches of security, or breaches of this Privacy Policy; to respond to any claims against us; and, to protect the rights, property, or personal safety of Harmonix, our customers, or the public.\n\nCorporate Transaction. In addition, your information may be disclosed as part of any proposed or actual merger, sale, and transfer of Harmonix assets, acquisition, bankruptcy, or similar event.\n\nWith Consent. We may also disclose your information to any other affiliated or third parties where you have consented or requested that we do so. For example, if you win a contest or sweepstakes, we may disclose the names of winners online, and we may also share your information with third party partners and co-sponsors, where relevant; in such cases, we will clearly notify you of the sharing, and you will have the choice not to participate or to otherwise object to such sharing. Where required by applicable law, we will publish information online or in the local press and to relevant regulators identifying the winner(s) of a context or sweepstake regardless of whether or not you consent to the same.\n\nNotwithstanding anything else in this Privacy Policy, we may share aggregate or de-identified information with third parties for research, marketing, analytics and other purposes, provided such information does not identify a particular individual and the individual cannot be re-identified.\n\n5. HOW WE COLLECT YOUR INFORMATION\n\nWe collect some information from you when you provide it to us directly, such as via an online form or when you talk with our customer experience team. We and third parties also use certain technologies described below to collect information.\n\nWe and our third-party providers may use cookies, clear GIFs/pixel tags, JavaScript, local storage, log files, and other mechanisms to automatically collect and record information about your browsing activities, gaming performance and use of the Services. We may combine this activity information with other personal data we collect about you. Generally, we may use this activity information to understand how our Services are used, track bugs and errors, provide and improve our Services, establish matchmaking, verify account credentials, allow logins, track sessions, prevent fraud, and protect our Services, as well as for targeted marketing and advertising, to personalize content and for analytics purposes.\n\nBelow, is a summary of some of the activities we may engage in. For more detailed information about these mechanisms and how we collect activity information, see our Cookie Policy below.\n\nLog Files. We may collect certain activity information from log files. Log file information is automatically reported by your browser or mobile application to our servers when you access our Services. We may record certain information from these log files, including web requests, IP address, browser type and version, language information, referring and exiting URLs, links clicked, pages viewed and other similar information.\nCookies. Cookies are small files with a unique identifier that may be transferred to your browser through our websites. They allow us to remember Users who are logged in, to understand how Users navigate through and use our Services, to display personalized content and targeted ads (including on third party sites and applications).\nClear GIFs, pixel tags and web beacons. These are tiny graphics with a unique identifier, similar in function to cookies that we may use to track the online movements of Users of our Services and to personalize content. We may also use these in our emails to let us know when they have been opened or forwarded, so we can gauge the effectiveness of our communications.\nAnti-Cheat and Fraud Prevention Technologies. We may use anti-cheating and fraud prevention tools or applications, which may collect information about your browser, device and activities within the Services, to detect and prevent fraud and cheating.\nAnalytics Tools. We may use internal and third-party analytics tools to collect and aggregate activity data and other data across multiple channels. Third party analytics services integrated into our Services may combine the information they collect in connection with EA's services with information they have independently collected over time and across different websites. Many of these companies collect and use information under their own privacy policies.\n\n6. THIRD PARTY ADVERTISING\n\nWe may work with third party ad networks, channel partners, measurement services and others (third party ad companies) to display advertising on our Services, and to manage our advertising on third party sites, mobile applications and online services. We and these third party ad companies may use cookies, pixels tags, and other tools to collect activity information on our Services (as well as on third party sites and services), as well as IP address, device ID, cookie and advertising IDs, and other identifiers, general location information, and, with your consent, your devices geolocation information; we and these third party ad companies use this information to provide you more relevant ads and content and to evaluate the success of such ads and content.\n\nFor example, we may work with Facebook (see their privacy policy at http://www.facebook.com/policy.php, and ad preferences page http://www.facebook.com/settings?tab=ads) to display targeted ads to you in Facebook. We may also work with others, such as Google Ads and DoubleClick (see their privacy policy at http://www.google.com/policies/privacy and ad preferences page at http://www.google.com/settings/u/0/ads/authenticated?hl=en), to display ads to you on other third- party sites, based on your use of our Services, activity information, and other interactions with us.\n\nCustom Audiences and Matching. Unless you have opted out, we may share certain information (such as your email address) with third parties  such as Facebook and Google  so that we can better target ads and content to our Users, and others with similar interests, within their services. These third parties use the personal data we provide to help us target ads and to enforce their terms, but we do not permit them to use or share this data with other third-party advertisers. You can opt-out of our sharing your personal information to target you this way by emailing us at privacy@harmonixmusic.com. If you opt out, we will process your opt out in a reasonable amount of time.\n\nAs noted above, you may control how Google, Facebook and other third parties display certain ads to you, as explained further in their respective privacy policies and ad preferences pages. You can also obtain more information about targeted advertising, and how to opt-out of receiving targeted ads from many third-party ad networks (including Facebook and Google), through the following:\n\nFor U.S. Users:\n\nhttp://www.networkadvertising.org/optout_nonppii.asp (Network Advertising Initiative)\n\nhttp://www.aboutads.info/choices (Digital Advertising Alliance)\n\nFor Users in the EU: http://www.youronlinechoices.eu (European Interactive Digital Advertising Alliance)\n\nFor Users in Canada: http://youradchoices.ca/choices/ (Digital Advertising Alliance of Canada)\n\nOpting out of participating ad networks does not opt you out of being served advertising. You may continue to receive generic or contextual ads on our Services. You may also continue to receive targeted ads on other websites, from companies that do not participate in the above programs.\n\n7. DO-NOT-TRACK REQUESTS\n\nCurrently, our systems do not recognize browser do-not-track requests. You may, however, disable certain tracking as discussed above (e.g., by disabling cookies), and you may also opt out of certain third-party ad networks as discussed above. Please see our Cookie Policy below for more information.\n\n8. THIRD PARTY FEATURES\n\nOur Services may include or incorporate social media and other third-party features (e.g., widgets, buttons, and plugins), which are operated by third party platforms and networks such Facebook, Steam, Twitch, Twitter, Instagram, YouTube, and others. These features are hosted by the respective third-party operator even though they appear on our Services, and the third party may collect your IP address, URL, date and time stamp, browser details and the like, subject to their own privacy policies.\n\n9. COMMUNICATIONS CHOICES\n\nIf you agree we may send direct marketing communications to you about our Services, events and promotions, we may also send you surveys, news, updates and other communications via email. If you wish to stop receiving direct marketing and these other communications from us, you may opt out as set forth below in the Access, Amendment, and Other User Rights section below. If you opt out of direct marketing communications, we may to the extent permitted by applicable law, still send you non-promotional communications, such as those about your account or our ongoing business relations. For example, if our service is temporarily suspended for maintenance, we might send you an email. Generally, you may not opt-out of these communications, which are not promotional in nature.\n\nIn some of our mobile Services, with your consent, we may send push notifications from time-to-time in order to update you about the game, events or promotions that we may be running. If you no longer wish to receive these types of communications, you may turn them off at the device level.\n\n10. SECURITY OF YOUR INFORMATION\n\nThe security of your information, including your personal data, is important to us. Harmonix takes steps to protect against possible breaches of our Services and the personal data we maintain. However, no website or Internet transmission is completely secure. Thus, Harmonix cannot and does not guarantee that unauthorized access, hacking, data loss, or other breaches will never occur. We urge you to take steps to keep your information and personal data safe, such as choosing a strong password and keeping it private, as well as logging out of your User account, and closing your web browser when finished using the Services.\n\n11. PERSONAL DATA RETENTION\n\nWe will retain your personal data as long as necessary for purposes for which the personal data was collected and is used by us, as stated in this Privacy Policy. If you wish to request that we no longer use your personal data to provide the Services to you please contact us as set forth in the Access, Amendment, and Other User Rights section below. However, if you withdraw consent or otherwise object to our collection, use and disclosure of your personal data, you may not be able to use the Services. Further, to the extent permitted by applicable law, we will retain and use your personal data as necessary to comply with our legal obligations, resolve disputes, maintain appropriate business records, and enforce our agreements.\n\n12. INTERNATIONAL TRANSFERS OF DATA\n\nHarmonix is headquartered and has operations in the United States, and has service providers in the United States and throughout the world. As such, we and our service providers may transfer your personal data to, or access it in, jurisdictions (including the United States and other jurisdictions where our service providers have operations) that do not provide equivalent levels of data protection as your home jurisdiction. We will take steps to ensure that your personal data receives an adequate level of protection in the jurisdictions in which we process it, including through appropriate written data processing terms and/or data transfer agreements.\n\n13. THIRD PARTY LINKS\n\nOur websites may contain links to third party sites that are not owned or controlled by Harmonix. We are not responsible for the collection and use of your information by these third-party sites. We recommend that you read the privacy notice of the website to which you link before you submit any personal data.\n\n14. USER GENERATED CONTENT\n\nYou may choose to disclose information (including personal data) about yourself in the course of contributing user generated content to our Services such as forums. Information that you disclose in any of these forums is unencrypted public information, and may be accessed by members of the public, who are not subject to this Privacy Policy. In addition, when you enter certain public areas of our Services, your username and other public profile information may be viewable by others. You should have no expectation of privacy as to any information you post or display in our forums or games, or in your profile, or that you otherwise make available on our or through our Services.\n\n15. ACCESS, AMENDMENT AND OTHER USER RIGHTS\n\nRegistration. To the extent we offer User registration on the Services, if you are a registered User of the Services and logged into the Services, you may review, update or delete certain Information collected by the Services by adjusting your profile settings at each Service. However, personal data that is necessary to check eligibility, such as date of birth or age, cannot be deleted, but may be modified with sufficient verification of the correct Information. We will allow you to change the password portion of your User ID, as well as certain other information you have given us in order to keep your information current, but once you select a user name you will not be able to change that user name provided to us during registration and which is associated with your User ID.\n\nMarketing Communications and Events. You may change your email preferences and opt out of marketing communications through links provided in our marketing communications provided to you. Certain Information collected for certain entries into promotions are subject to corporate and regulatory record keeping requirements and will not be deleted upon the user's request, unless the entrant is a child under the age of 13 years old.\n\nThird Party Accounts. To manage information we receive about you from a Third Party Account where you access and use our Services, you will need to follow the instructions at that Third Party Account for updating your information and changing your privacy settings. You may also be able to manage certain aspects of information collection and use by going to the settings of your device and reviewing the permissions of the applications you are using.\n\nIn addition, Users may also have the right to request that certain personal data be exported to another provider where technically feasible, and, under certain conditions to object to or restrict our use of certain personal data. You may contact our Privacy Administrator as set forth below to access or amend your personal data, to request that we delete or stop processing your personal data, to withdraw your consent to our processing, and, if you are an EEA resident, to exercise your opt-out rights or place a data portability request.\n\nIf you wish to request removal of any content you have posted, you should also contact our Privacy Administrator as set forth below.\n\nPrivacy requests should be directed to the Privacy Administrator at privacy@harmonixmusic.com, or Privacy Administrator, Harmonix Music Systems, Inc., 40 Broad Street, Floor 7, Boston, MA 02109. Please keep in mind that certain Services will not be available if you withdraw your consent, or otherwise delete or object to our processing of certain personal data. We will respond to your request in accordance with applicable law, and we will inform you if we do not intend to comply with your request.\n\nYou also have the right to lodge a complaint with a supervisory data protection authority.\n\n16. YOUR CALIFORNIA PRIVACY RIGHTS\n\nWe do not share personal data collected online with unaffiliated third parties for their own direct marketing purposes and will not do so unless you agree to such disclosure. If you are a California resident and you still believe your information has been shared or you have general questions about how your information may have been shared, you may contact us by requesting a list of the third parties to which we have disclosed personally identifiable information about you for their own direct marketing purposes. You may make one request per year. In your request, please attest to the fact that you are a California resident and provide a current California address for your response. You may request this information in writing by contacting us at via email at privacy@harmonixmusic.com or by regular mail at: Harmonix Music Systems, Inc., 40 Broad Street, Floor 7, Boston, MA 02109, Attn: Your California Privacy Rights, c/o Privacy Administrator. Please allow up to thirty (30) days for a response. All requests must be labeled \"Your California Privacy Rights\" on the email subject line or envelope or post card. For all requests, please clearly state that the request is related to \"Your California Privacy Rights\", include your name, street address, city, state, zip code and e-mail address (your street address is optional if you wish to receive a response to your request via email) and indicate your preference on how our response to your request should be sent (email or postal mail). We cannot accept requests via the telephone or by facsimile. We are not responsible for notices that are not labeled or sent properly, or do not have complete information.\n\n17. CONTACT DETAILS\n\nThe controller for your personal data is Harmonix Music Systems, Inc., 40 Broad Street, Floor 7, Boston, Massachusetts 02109.\n\nIf you have any questions, complaints or comments regarding our Privacy Policy or practices, please contact our Privacy Administrator via email at privacy@harmonixmusic.com or by regular mail at:\n\nPrivacy Administrator\n\nHarmonix Music Systems, Inc.\n\n40 Broad Street, Floor 7\n\nBoston, MA 02109\n\n18. U.S. GOVERNING LAW\n\nThe Services are designed and targeted to U.S. audiences and are governed by applicable U.S. state laws and U.S. federal laws. We make no representation that these Services are operated in accordance with the laws or regulations of, or governed by, other nations. By participating in our Services' activities, you certify that you meet the age and other eligibility requirements for these Services as set forth in our Terms of Use Agreement. If you do not meet the age and other eligibility requirements, please discontinue using the Services immediately as your continued use of the Services indicates that you are agreeing to the collection, use, disclosure, management and storage of your information as described in this Privacy Policy. If you are located in the European Union or elsewhere outside of the U.S., you use the Services at your own risk and initiative and you, not we, are responsible for compliance with any applicable local and national laws. By using these Services, participating in any Service activities and/or providing us with your information, you understand that we will collect, transfer, store, process and/or deal with your information in accordance with this Privacy Policy and U.S. law. Consequently, you hereby waive any claims that may arise under the laws and regulations of, or that apply to you in, any other country or jurisdiction.\n\n19. CHANGES TO THIS PRIVACY POLICY\n\nThis Policy is current as of the date last modified as set forth above. We reserve the right to revise this Privacy Policy at any time by posting an updated Privacy Policy without advance notice to you. Such revisions shall be effective immediately upon posting and your continued use of any Service will signify your acceptance of, and agreement to be bound by, these revisions. Notice of material changes with regard to personal data we have previously collected from you will be posted on the Services' homepage or will be provided by e-mailing you or notifying you upon login about these changes; the form of such notice is at our discretion. However, we encourage you to check this Privacy Policy and Terms of Use Agreement often for updates.\n\n____________________________________________________________________________\n\nCOOKIE POLICY\n\nOur website (the Site) may use cookies to distinguish you from other users of our Site. This helps us to provide you with a good experience when you browse our Site and also allows us to improve our Site. This Cookie Policy provides you with information about the types of cookies we may use and the purposes for using those cookies.\n\nYour Consent\n\nBy continuing to use our Site, you are agreeing to our placing cookies on your computer in order to analyze the way you use our Site. Please read this Cookie Policy carefully for more details about the information we may collect when you use this website. If you do not wish to accept cookies in connection with your use of this Site, you must stop using our Site.\n\nWhat is a cookie?\n\nA cookie is a small file of letters and numbers that are placed on your browser or the hard drive of your computer. Cookies contain information that is transferred to your computer's hard drive. Some cookies are persistent cookies\"  these remain on a users device for the period of time specified in the cookie, and are activated each time the user visits the website. Other cookies are \"session cookies\" - these are temporarily stored on a users device; once you close the browser, all session cookies are deleted.\n\nFirst vs. third-party cookies\n\nWe may use both first and third party cookies on our Site. Whether a cookie is 'first' or 'third' party refers to the domain placing the cookie. First-party cookies are those set by a website that is being visited by the user at the time. Third-party cookies are cookies that are set by a domain other than that of the website being visited by the user. If a user visits a website and another entity sets a cookie through that website this would be a third-party cookie.\n\nWhat cookies may we use and why?\n\nWe may use Strictly Necessary, Functionality, and Performance, Targeting cookies.\n\nStrictly Necessary: allow you to move around the website and use essential features like secure areas. These cookies are a condition of using our Site and services. Without these cookies, services you have asked for cannot be provided. We may use these cookies to remember information you have entered on forms during a web browser session; to identify you as being logged in to our Site; and to route users to specific applications of a service, or specific servers.\n\nFunctionality: used to provide services or remember settings to improve your visit. We may use these cookies to remember settings you've applied and show you when you're logged in to the website.\n\nPerformance: collect information about how you use our Site (e.g., which pages you visit, and if you experience any errors). They do not collect any information that could identify you. We may use Performance cookies to compile statistics on how our Site is used; to see how effective our advertisements are, including those on third party sites; to provide feedback to partners that one of our visitors also visited their website; to help us improve the website by measuring any errors that occur; and to test different designs of our Site.\n\nTargeting: linked to services provided by third parties, such as 'Like' buttons and 'Share' buttons. Third parties provide these services in return for recognizing that you have visited our Site. We may also use Targeting cookies to provide advertising agencies with information on your visit so that they can present you with advertisements in which you may be interested.\n\nHow to delete and block our cookies\n\nYou may delete, review and block cookies by adjusting your browser settings. However, if you block all cookies (including essential cookies) you may not be able to access all or parts of our Site. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies as soon you visit our Site. Turning off or deleting cookies will not prevent device identification and related data collection from occurring. For further information about deleting or blocking cookies, please visit: http://www.aboutcookies.org/Default.aspx?page=2.\n\nYour choices about third party cookies\n\nCurrently, we use the following third party cookies for Performance and Targeting:\n\nGoogle Analytics\n\nWe use Google Analytics to provide web analytics data about how our Site is used. For more information about Google analytics cookies, please see Google's help pages and privacy policy. To opt-out of Google Analytics, you can download and install the Google Analytics opt-out Browser add-on.\n\nMore information about how third party cookies are used for targeted advertising and how to opt out of some third party ad networks can be found at: http://www.youronlinechoices.eu or http://www.aboutads.info/.\n\n\n\nCopyright  2018 Harmonix Music Systems, Inc. - All Rights Reserved.\n\nPRIVACY POLICY TERMS OF USE USER CONTENT SUBMISSION COPYRIGHT COMPLIANCE MANAGEMENT JOBS PLAYTEST\n\n2020 HARMONIX MUSIC SYSTEMS, INC. ALL RIGHTS RESERVED. HARMONIX, FUSER, ROCK BAND, AUDICA, DROPMIX, DANCE CENTRAL, SINGSPACE, ROMANCE CENTRAL, A CITY SLEEPS, HARMONIX MUSIC VR, CHROMA, RECORD RUN, VIDRHYTHM, PHASE AND ALL RELATED TITLES AND LOGOS ARE TRADEMARKS OF HARMONIX MUSIC SYSTEMS, INC. FUSER, ROCK BAND, DANCE CENTRAL, SUPER BEAT SPORTS, BEAT SPORTS, SINGSPACE, A CITY SLEEPS, HARMONIX MUSIC VR, RECORD RUN, VIDRHYTHM, PHASE AND OTHER RELATED PRODUCTS AND SERVICES DEVELOPED BY HARMONIX MUSIC SYSTEMS, INC. DROPMIX DEVELOPED BY HARMONIX MUSIC SYSTEMS, INC. AND HASBRO, INC. BEAT SPORTS IS A TRADEMARK OF HARMONIX GAMES LLC. THE BEATLES IS A TRADEMARK OF APPLE CORPS LTD. GUITAR HERO IS A REGISTERED TRADEMARK OF ACTIVISION PUBLISHING, INC. ALL RIGHTS RESERVED. ALL OTHER LOGOS, COMPANY NAMES, BRANDS, IMAGES, TRADEMARKS AND OTHER INTELLECTUAL PROPERTY ARE THE PROPERTY OF THEIR RESPECTIVE OWNERS.\n\nWe use cookies to make the experience of our website better. By using our website, you consent to the use of cookies. Additionally, we have recently updated our Privacy Policy. To learn more about how we use cookies and review our Privacy Policy updates, click here.\nClose", "Developer Terms of Service": "GAMES\n \nMUSIC\n \nCOMMUNITY\n \nBLOG\n \nABOUT\n \nJOBS\n \nPRESS\nTERMS OF USE AGREEMENT\nLast modified: March 7, 2019\n\nPLEASE READ THESE TERMS OF USE CAREFULLY BECAUSE THEY DESCRIBE YOUR RIGHTS AND RESPONSIBILITIES.\n\nThis is the official Terms of Use Agreement (Agreement or Terms of Use) for RockBand4.com, RockBand.com, RockBandVR.com, TheBeatlesRockBand.com, DanceCentral.com, GreenDayRockBand.com, AudicaGame.com, SingSpaceGame.com, ACitySleepsGame.com, Amplitude-Game.com, vidrhythm.com, RecordRun.com, ChromaGame.com, PlayChroma.com, HarmonixMusic.com (the Websites) and any software, games, applications, content, activities and services (Applications) made available by Harmonix Music Systems, Inc. (Harmonix, we, us, or our), including, but not limited to, through digital distribution platforms, social networking websites or any mobile versions thereof. The Websites and the Applications are referred to herein as the Services and the Services are provided by Harmonix. These Terms of Use are a binding agreement between you (you or your) and Harmonix. By using the Services, you indicate your unconditional acceptance of the following Terms of Use and any other applicable Additional Terms (as defined below). This Agreement applies whether you are accessing the Services via a personal computer, a mobile device or any other technology or devices now known or hereafter developed or discovered (each, a Device). This Agreement governs only the content, features, and activities related to these Services, unless specifically stated.\n\nThese Services are offered and made available only to users 13 years of age or older and certain features on these Services (including, but not limited to, user registration and newsletter signups) may be subject to heightened age and/or other eligibility requirements. If you are not yet 13 years of age or older or the required greater age for certain features, and/or do not meet any other eligibility requirements, please discontinue using the Services immediately or, if for any reason, you do not agree with all of the terms and conditions contained in this Agreement, please discontinue using the Services immediately because by using or attempting to use the Services, you certify that you are at least 13 years of age or other required greater age for certain features and meet any other eligibility and residency requirements of the Services. If you are between the ages of 13 and 17, you represent that your legal guardian has reviewed and agreed to this Agreement and takes full responsibility for your compliance with them.\n\nThese terms and conditions regarding your use of the Services constitute a legally binding agreement between you and Harmonix. In this Agreement, the term Service includes all websites and web pages within the Services as well as any equivalent, mirror, replacement, substitute or backup websites and web pages that are associated with the Services. By using these Services, you understand, acknowledge and agree that you will abide by the terms of this Agreement and any additional terms that govern certain products and services, which will be presented by Harmonix in conjunction with those products and services (Additional Terms), including, but not limited to, Harmonixs Privacy Policy, testing agreements, non-disclosure agreements, end user license agreements accompanying a Harmonix game, Rules (as defined below), and the User Content Submission Agreement which governs your submission of User Content (as such term is defined therein) for the Services (except for submissions to creators.rockband.com and rockband.com/RBN (collectively, RBN Pages)). Submissions to the RBN Pages shall be governed by the Program Terms. The Services may also provide rules of participation (Rules) for certain activities and services including, but not limited to, contests and sweepstakes, award programs, membership clubs, email, and dating services. The Services Additional Terms and the Privacy Policy and the Rules are hereby incorporated in this Agreement by reference. To the extent that there is a conflict between this Agreement and Additional Terms for the activity in which you choose to participate, the Additional Terms shall govern. This Agreement will remain in full force and effect as long as you are a user of the Services and in the event of termination of any membership, service or feature, you will still be bound by your obligations under this Agreement, the Privacy Policy, and any Additional Terms or Rules, including any indemnifications, warranties and limitations of liability. Additionally, if you access the Services through a digital distribution platform, social networking website or a mobile version thereof, you shall comply with such platform and/or websites terms of service/use as well as this Agreement.\n\nUsers have a personal, revocable, non-transferable, non-exclusive right to access and use the Services and Materials (as defined below) subject to these Terms of Use and any applicable Additional Terms. The words use or using in this Agreement means any time an individual (a user), directly or indirectly, with or without the aid of a machine or device, does or attempts to access, interact with use, display, view, print or copy from the Services, transmit, receive or exchange data or communicate with the Services, or in any way utilizes, benefits, takes advantage of or interacts with any function, service or feature of the Services, for any purpose whatsoever. This Agreement does not cover your rights or responsibilities with respect to third party content or Services or any links that may direct your browser or your connection to third party Services or pages.\n\nHarmonix does not guarantee that any Services will be available at any given time or that it will continue to offer any Services for any particular length of time. Not all features, products or Services offered are available to all persons who try to register in all locations. Harmonix reserves the right to limit, in its sole discretion, the provision and quantity of any Service to any person in any location. Any Service is void where such Service is prohibited. Harmonix reserves the right to change and update the Services without notice to you, including the right to refuse or limit your request to acquire Services. You are solely responsible for complying with applicable laws with respect to the Services you use. This is the entire and exclusive Agreement between you and us regarding use of the Services and it cannot be modified, except as specifically described below in Section 2.\n\n1. REGISTRATION: YOUR ACCOUNT\n\nWe may require each user to have a unique user name and password combination in order to access and use certain features or functions of the Services and may also, from time to time, provide users with additional codes or passwords necessary to access and use certain features or functions of the Services. Please read our Privacy Policy, which describes the personally identifiable information (Personal Information) we collect, use, disclose, manage and store. As part of the registration process for a feature or function, you may choose a user name and password (or we may assign an initial password which we will give you the option to change). You must provide truthful and accurate information, and update such information to keep it true, accurate, current and complete. You may not select the name of another person, any third partys trademark, copyright or other intellectual property infringement, any name that could mislead others to believe you to be an employee or agent of Harmonix, or any name that Harmonix deems in it is sole discretion to be vulgar, offensive, or otherwise violates this Agreement. Your user name and password are personal to you and you may not allow any others to use your user name or password under any circumstances. We are not liable for any harm caused or related to the theft or misappropriation of your user name or password, disclosure of your user name or password, your authorization of anyone else to use your user name or password, or any other activities conducted under your user name or password. You agree to immediately notify us if you become aware of or believe there is or may have been any unauthorized use of (or activity using) your user name or password or any other need to deactivate your user name or password due to security concerns. You agree that you do not own any account you create for a Service, any user names created on the account, or any content or data stored or associated with an account. You may also be required to register an account with the digital distribution platform or social networking service through which you seek to connect to or access a Service.\n\n2. MODIFICATIONS\n\nWe may alter, suspend, or discontinue the Services in whole or in part, at any time and for any reason, without notice. The Services may also periodically become unavailable due to maintenance or malfunction of computer equipment or for other reasons. We reserve the right, at any time and from time to time, for any reason in our sole discretion, to change the terms of this Agreement. We will post or display notices of material changes on the Services and/or e-mail you or notify you upon login about these changes; the form and manner of such notice is at our discretion. Once we post them on the Services, these changes become effective immediately and if you use the Services after they become effective it will signify your agreement to be bound by the changes. You should check back frequently and review the terms and conditions of this Agreement, including, but not limited to, the User Content Submission Agreement, other Additional Terms, Rules and Privacy Policy, regularly so you are aware of the most current rights and obligations that apply to you and the terms and conditions of your agreement with us.\n\n3. OWNERSHIP OF INTELLECTUAL PROPERTY\n\nThe contents of these Services, including all Service software and computer code, technology, design, text, images, photographs, illustrations, audio and video material, artwork, graphic material, databases, proprietary information and all copyrightable or otherwise legally protectable elements of the Services, including, without limitation, the selection, sequence and look and feel and arrangement of items, and all trademarks, service marks and trade names (individually and/or collectively, Material), are the property of Harmonix, and entities under its control, controlling Harmonix or under common control with Harmonix (its Affiliates), and any of their successors and assigns, and any of their respective licensors, Advertisers (as defined below), suppliers, and operational service providers and are legally protected, without limitation, under U.S. Federal and State, as well as applicable foreign laws, regulations and treaties. Product names are trademarks or registered trademarks of their respective owners. Unless the context clearly requires otherwise or we explicitly say so in writing, the term Service includes Material as well. You may only use the Services for your non-commercial, non-exclusive, non-assignable, non-transferable and limited personal use and for no other purposes. You may not alter, delete or conceal any copyright or other notices contained on the Services, including notices on any Material you download, transmit, display, print or reproduce from the Services. You shall not, nor will you allow any third party (whether or not for your benefit) to reproduce, modify, create derivative works from, display, perform, publish, republish, edit, distribute, disseminate, broadcast, photograph or circulate to any third party (including, without limitation, on or via a third party website), or otherwise use, any Services without the express prior written consent of Harmonix or its owner if Harmonix is not the owner. Any unauthorized or prohibited use of any Services may subject you to civil liability, criminal prosecution, or both, under applicable federal, state and local laws. On notice, we will act expeditiously to remove content on the Services that infringes the copyright rights of others and will disable the access to the Services and its services to anyone who uses them repeatedly to infringe the intellectual property rights of others. Harmonix reserves title to the Services and all rights to any Services not specifically granted under this Agreement. The Services are licensed, not sold, to you.\n\nWe take protection of copyrights, both our own and others, very seriously. We therefore employ multiple measures to prevent copyright infringement over these Services and to promptly end any infringement that might occur. If you believe that the Services contain elements that infringe your copyrights in your work, please follow the procedures set forth in our Copyright Compliance Policy.\n\n4. ADVERTISING\n\nFrom time to time, you may communicate with, receive communications from, be re-directed to, interact with, or participate in or use the services or obtain goods and services of or from, third parties (collectively, the Advertisers) such as our advertisers, sponsors, or promotional partners as a result of your use of the Services. All such communication, interaction and participation is strictly and solely between you and such Advertisers and we shall not be responsible or liable to you in any way in connection with these activities or transactions (including, without limitation, any representations, warranties, covenants, contracts or other terms or conditions that may exist between you and the Advertiser or any goods or services you may purchase or obtain from any Advertiser).\n\n5. RULES OF CONDUCT\n\nYour use of the Services is subject to all applicable local, state, national laws and regulations and, in some cases, international treaties. You are solely responsible for all activities, acts and omissions that occur in, from, through or under your user name or password. You shall not use, allow, enable or encourage others to use the Services, or knowingly condone use of these Services by others, in any manner that is, attempts to, or is likely to:\n\nbe libelous, defamatory, indecent, vulgar or obscene, pornographic, sexually explicit or sexually suggestive, racially, culturally, or ethnically offensive, harmful, harassing, intimidating, threatening, hateful, objectionable, discriminatory, or abusive, or which may or may appear to impersonate anyone else, as determined by Harmonix;\naffect us adversely or reflect negatively on us, the Services, our goodwill, name or reputation or cause duress, distress or discomfort or embarrassment to us or anyone else, or discourage any person, firm or enterprise from using all or any portion, features or functions of the Services, or from advertising, linking or becoming a supplier to us in connection with the Services;\nsend or result in the transmission of, or introduce to the Services, junk e-mail, chain letters, duplicative or unsolicited messages, or so-called spamming and phishing;\nbe used for commercial or business purposes, including, without limitation, advertising, marketing or offering goods or services, whether or not for financial or any other form of compensation or through linking with any other websites or web pages;\ntransmit, distribute or upload programs or material that contain malicious code, such as viruses, timebombs, cancelbots, worms, trojan horses, spyware, or other potentially harmful programs or other material or information;\nforge any TCP/IP packet header or part of the header information in any email or newsgroup posting for any reason;\nexploit children under 18 years of age; use abusive, offensive or defamatory screen names and/or personas; obtain unauthorized access to any computer system through the Services; violate any laws, regulations (including, without limitation, laws regarding the transmission of technical data or software exported from the United States), judicial or governmental order or any treaties, or violate or infringe upon any copyright, trademark, trade secret or other intellectual property rights, rights of publicity or privacy or any other rights of ours or of any other person, firm or enterprise; gain unauthorized access to the Services, other users accounts, names, passwords, personally identifiable information or other computers, websites or pages, connected or linked to the Services or to use the Services in any manner which violates or is inconsistent with the terms and conditions of this Agreement;\nmodify, disrupt, impair, alter or interfere with the use, features (including chat rooms), functions, operation or maintenance of the Services or the rights of use and enjoyment of the Services by any other person, firm or enterprise;\npromote, upload, transmit, encourage or take part in any activity involving hacking, cracking, phishing, taking advantage of exploits or cheats and/or distribution of counterfeit software and/or virtual items;\nupload any software or Material that you do not own or have permission to freely distribute; or\ncollect, obtain, compile, gather, transmit, reproduce, delete, revise, view or display any material or information, whether personally identifiable or not, posted by or concerning any other person, firm or enterprise, in connection with their or your use of the Services, unless you have obtained the express, prior permission of such other person, firm or enterprise to do so.\n\nUnless otherwise specified, Harmonix has no obligation to monitor or record any online activity on the Services. Harmonix reserves the right to, but is not obligated to, monitor communications within, through or across the Services, and access and/or record online activity on the Services. You give Harmonix your express consent to access and record your activities on the Services.\n\nYou further agree not to access, create, or provide any other means through which the Services, including, but not limited to, any game(s), may be used or accessed by others, such as through server emulators. You may not participate, take part in, initiate, or engage in actions that impose an unreasonable or disproportionate load on the infrastructure hosting the Services. You agree not to use any hardware or software or any other method of support that is not authorized by Harmonix or that may in any way influence or advantage your playing abilities, or influence or advantage your use of the Services. Third party tools, the use of bots, speed hacks, deep-link, page-scrape, robot, spider, algorithm or other programs that copy or monitor any part of the Services, software that transmits, manipulates, or distributes (including, but are limited to, mirroring) the data stream or any aspect of the Services to another computer, server websites or other publication or distribution media, or software that permits you to use Services without human input are examples of methods not authorized by Harmonix. Harmonix in its sole discretion may implement various forms of filtering, blocking, or monitoring of IP addresses, MAC addresses or proxies used to use, play or access the Services, including without limitation blocking or filtering measures that restrict your ability to use, play or access the Services.\n\nYou agree to indemnify, defend and hold Harmonix and its Affiliates harmless for any and all claims, damages, losses and causes of action arising as a result of your posting or uploading content to the Services or your failure to comply with these Terms of Use.\n\n6. WIRELESS MARKETING SERVICES AND PROMOTIONAL OPPORTUNITIES\n\nHarmonix may provide you with the opportunity to register for special promotions, services, news, programming and information delivered via text messaging and other wireless Devices such as mobile phones. You are required to provide your consent to receive such information from Harmonix, either by registering on these Services or via your wireless Device. Such services and promotional opportunities are provided by Harmonix or its Affiliates. The information requested as part of the online registration process is your telephone number or a wireless email address, but only if specifically requested, and your carriers name. Optional information may be requested for specific promotions, such as your preferences regarding goods or services, choices of music or artists, or other similar survey information. Depending on the promotion, we may also collect an Internet email address or other information and, depending on the information collected, you may also be required to confirm your agreement to this Agreement and, including without limitation, the Privacy Policy.\n\nIf you register for Harmonixs wireless marketing services, then you acknowledge, understand and agree that you will be charged by your wireless carrier for all messages sent to you from Harmonix. Standard messaging rates will apply, unless noted otherwise. Under no circumstances will Harmonix, or any Affiliates be responsible for any wireless email or text messaging charges incurred by you or by a person that has access to your wireless device, telephone number, or email address.\n\nYou understand, acknowledge and agree that Harmonix may, at its sole discretion and without liability to you, terminate its offer of any specific wireless marketing service or all wireless marketing services at any time without advance notice. Harmonix may provide notice of terminations or changes in services on these Services.\n\n7. VIRAL FEATURES\n\nThere may be portions of our Services, content, functionality or features (e.g, digital streaming media player(s)) (Viral Features) that we make available to you for your personal use. While we can obviously change how, to whom and to what extent we make these Viral Features available at any time without any notice and in our sole discretion, so long as they are available to you, whenever you visit our Services or take advantage of any of these Viral Features (whether you use these Viral Features on your own personal or customized web pages, whether they are displayed or appear embedded or housed within a web page or websites of anyone else, whether a commercial websites or web page, an advertisement, promotional message or even a personalized or customized web page of a friend or through any Device that can access any of these Viral Features) you agree not to download any content made available as part of the Viral Features and acknowledge that such content is available only for streaming viewing and, further, that you are bound by the applicable provisions of this Agreement and our Privacy Policy.\n\n8. POSTINGS\n\nYour comments, suggestions and information are important to us. Portions of these Services may provide you and other users an opportunity to participate in forum services, blogs, web communities and other message and communication facilities (Communities) and may provide you with the opportunity, through such Communities or otherwise, to submit, post, display, transmit and/or exchange (a) information, ideas, opinions, messages or other information (Post or Postings) and (b) User Content (as defined in the User Content Submission Agreement), your submission of which is also governed by the terms and conditions therein, and considered a Posting for purposes of this Agreement. You understand, acknowledge and agree that such Postings are the sole responsibility of the person from which such Postings originated. This means that you are solely and entirely responsible for the consequences of all Postings that you upload, post, email, transmit or otherwise make available via the Services. Postings do not reflect the views of the Services, Harmonix, or our Affiliates. We reserve the right to monitor, edit or screen any Postings. If we determine, in our sole discretion and judgment, that any Posting does or may violate any of the terms of this Agreement, we reserve the right, at any time and without limiting any and all other rights we may have under this Agreement, at law or in equity, to: (a) refuse to allow you to Post; (b) remove and delete Postings; (c) revoke your right to use the Services; and/or (d) use any technological, legal, operational or other means available to us to enforce the provisions of this Agreement, including, without limitation, blocking specific IP addresses or deactivating your registration on the Services.\n\nIf a Posting originates from you or your account, you hereby: (a) grant the Services, Harmonix, and its Affiliates a worldwide, royalty-free, perpetual, irrevocable, non-exclusive license to use, distribute, reproduce, modify, adapt, create derivative works from, and publicly perform or display such Posting in whole or in part, in perpetuity in or on any and all media, now known or hereafter devised, and alone or together with or as part of other information, content and/or material of any kind or nature; (b) represent and warrant that (i) you have the legal right to upload the Posting to Harmonix and the Posting is original to you and/or fully cleared for use as contemplated herein, (ii) the Posting does and will not, in any way, violate or breach any of the terms of this Agreement, (iii) the Posting does not contain libelous, tortuous, or otherwise unlawful information, infringe or violate any copyright or other right, or contain any matter the publication or sale of which will violate any federal or state statute or regulation, (iv) the Posting is not obscene or in any other manner unlawful, (v) the Posting shall not be injurious to the health of any user, and (vi) we shall not be required to pay or incur any sums to any person or entity as a result of our use or exploitation of the Posting; and (c) if your Posting incorporates the name, logo, brand, service or trademark, voice, likeness or image of any person, firm or enterprise, you specifically represent and warrant that (i) you have the right to grant the Services, Harmonix, and its Affiliates the right to use all such Postings as described above, (ii) the Posting was produced in compliance with all applicable laws and regulations and (iii) for any User Content Posting that contains original videos, you will comply with any applicable identification verification and record-keeping requirements, and you will secure and maintain the requisite personal information and identification documentation for all individuals who appear in any such original videos, as may be required by law and/or otherwise requested or required by us in connection with our corporate compliance policies and practices, which includes (y) the individuals full legal name, current address, date of birth and (z) a legible photocopy of a valid government-issued identification document (e.g., a U.S. passport, state drivers license or valid photo ID card) to verify the individuals identity. With the submission of each such Posting, Harmonix, and its Affiliates reserve the right to request that you, and upon such request you must, deliver a full and complete set of such identification verification records to us, as well as a legible photocopy of your valid drivers license, passport or other acceptable government-issued photo identification for our verification and record-keeping purposes. In addition, you specifically acknowledge and agree to abide by our policies regarding governmental certification procedures relating to the foregoing identification verification and record-keeping procedures and, if applicable, you will promptly comply with any specific requests or directions we give you in connection with Postings you submit that may be subject to these requirements.\n\nYou understand, acknowledge and agree that we have the right to delete, re-format and/or change your Postings in any manner that we may determine (although you will not be responsible for any such changes made). The amount of storage space on the Services per user is limited. Some Postings may not be processed due to space constraints or outbound message limitations. You understand, acknowledge and agree that we assume no responsibility for deletion of Postings or any failure to store, receive or deliver Postings in a timely manner or any other matter relating to Postings. Posting is for noncommercial purposes only and you may not Post in any manner which does or is intended to promote or generate revenue for any business enterprise or commercial activity.\n\nIf you believe that any content on the Services (including, without limitation, Postings) violates any of the terms of this Agreement (except for any notices covered by the Copyright Compliance Policy), please email us at support@harmonixmusic.com (please refer to our Copyright Compliance Policy for any notices covered by the Copyright Compliance Policy). We cannot guarantee that we will respond to your message and we reserve the right to take or refrain from taking any or all steps available to us once we receive any such message.\n\n9. CONTESTS, SWEEPSTAKES, AUCTIONS AND PROMOTIONS\n\nFrom time to time, Harmonixs, the Affiliates or the Services operational service providers, suppliers, and Advertisers, may conduct promotions on or through the Services, including, without limitation, auctions, contests and sweepstakes (Promotions). Each Promotion will have Additional Terms and/or Rules which will be posted or otherwise made available to you and, for purposes of each Promotion, will be deemed incorporated into and form a part of this Agreement.\n\n10. CERTAIN PRODUCTS AND SERVICES\nRSS Feeds and Podcasts\n\nThe Services may provide RSS Feeds (RSS Feeds) consisting of selected text, audio, video, and photographic content (Content) from the Services that is provided over the Internet using an XML feed. Certain RSS Feeds may be podcasts (Podcasts) which may include as part of the Content an associated audio, video and/or photographic file where the audio and/or video file may be downloaded and played from a users Device or transferred to a portable listening device. Certain software and hardware is required for users to download and view and/or play Content through RSS Feeds and you are solely responsible for obtaining such hardware or software.\n\nContent is protected by U.S. Federal and State laws, and applicable foreign laws, regulations and treaties, and all rights in and to the Content are reserved to Harmonix or the content provider. Content is available for personal, noncommercial use only and you may download, copy and/or transfer to a Device or through a Device to another Device the RSS Feeds and associated Content for your personal, non-commercial use only. You shall not, nor will you allow any third party to, reproduce, modify, create derivative works of, display, perform, publish, distribute, disseminate, broadcast or circulate to any third party, or otherwise use any Content except as expressly authorized in this Section 10.\n\nBy your access to and use of RSS Feeds, you understand, acknowledge and agree that the Services, Harmonix, and its Affiliates do not warrant that its RSS Feeds will operate on all user equipment. Please see the Disclaimer and Limitations of Liability section below for further details.\n\nMobile Applications\n\nIf Harmonix offers products and services through applications available on your wireless or other mobile Device (such as a mobile phone) (the Mobile Application Services), these Mobile Application Services are governed by the Additional Terms governing the applicable Mobile Application Service. We do not charge for these Mobile Application Services unless otherwise provided in the applicable Additional Terms. However, your wireless carriers standard messaging rates and other messaging, data and other rates and charges will apply to certain Mobile Application Services. You should check with your carrier to find out what plans your carrier offers and how much the plans cost. In addition, the use or availability of certain Mobile Application Services may be prohibited or restricted by your wireless carrier, and not all Mobile Application Services may work with all wireless carriers or Devices. Therefore, you should check with your wireless carrier to find out if the Mobile Application Services are available for your wireless Device, and what restrictions, if any, may be applicable to your use of such Mobile Application Services. If you change or deactivate your wireless telephone number, you agree to promptly update your Mobile Application Services account information to ensure that your messages are not sent to the person that subsequently acquires your old number.\n\nUnder no circumstances will Harmonix, or any of our Affiliates be responsible for any wireless email, text messaging or other charges incurred by a user (or any person that has access to a users wireless device, telephone number, or email address) using any Mobile Application Services.\n\n11. HYPERLINKS TO THIRD PARTY SERVICES\n\nThe appearance, availability, or your use of names, URLs or hyperlinks referenced or included anywhere on the Services or any other form of link or re-direction of your connection to, with or through the Services, to websites that are not affiliated with Harmonix or the Services is not an endorsement by, nor does it incur any obligation, responsibility or liability on the part of, the Services, Harmonix, or any of its Affiliates, any of their successors and assigns, and any of their respective officers, directors, employees, agents, representatives, licensors, Advertisers, suppliers, and operational service providers. Your access of the unaffiliated websites is at your own risk, and we do not verify, endorse or have any responsibility for the content of any such third party Services, their business practices (including their privacy policies), or any goods or services associated with or obtained in connection with any such third party websites, whether the Services, Harmonixs, or any of its Affiliates logo or sponsorship identification is on the third party Services as part of a co-branding or promotional arrangement or for any loss or damage incurred in connection with your use of such links and Services. If any third party Services obtain or collect Personal Information from you, in no event shall we assume or have any responsibility or liability. Please read our Privacy Policy, which describes how Harmonix collects and uses your Personal Information and other information and certain of our relationships.\n\n12. TESTING\n\nIn our sole discretion, Harmonix may contact you to review, evaluate and/or playtest one or more Services, aspects of Services or online features prior to commercial release for the purpose of identifying program errors and obtaining feedback. You will be asked to provide Harmonix with feedback regarding your evaluation of such Services. Your participation in such testing is subject to this Agreement and other applicable Additional Terms, such as a testing agreement and non-disclosure agreement. By accepting our invitation and testing a Service, you agree that (a) playing an unreleased Service is at your own risk and you understand that the Service may include known or unknown bugs, (b) any value or status indicators you achieve through such testing may be erased at any time, including upon commercial release, and (c) Harmonix has no obligation to make the Service available to you or fix errors or bugs identified by you.\n\n13. DEACTIVATION/TERMINATION OF YOUR REGISTRATION OR USE\n\nIf you are registered to use the Services, you may deactivate your account on the Services, at any time and for any reason, by sending an email to support@harmonixmusic.com. We may terminate your use of and registration on, all or part of the Services, at any time and for any reason, with or without cause, without prior notice to you and without any liability or further obligation of any kind whatsoever to you or any other party. It is our policy to terminate users who violate these Terms of Use, as deemed appropriate in our sole discretion. Any and all Services and Materials will be considered forfeited immediately in the event of any deactivation or termination of your account by Harmonix. If Harmonix terminates an account, it may terminate other accounts that share the same characteristics. You acknowledge that Harmonix is not required to provide you notice before taking action to terminate your account, and if Harmonix terminates your account, you may not use any Service again without Harmonixs express written approval.\n\n14. DISCLAIMER AND LIMITATIONS OF LIABILITY\n\nTHESE SERVICES, AND ALL MATERIALS, PRODUCTS AND POSTINGS ARE MADE AVAILABLE ON AN AS IS AND AS AVAILABLE BASIS, WITHOUT ANY REPRESENTATION OR WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, OR ANY GUARANTY OR ASSURANCE THE SERVICES WILL BE AVAILABLE FOR USE, ACCURATE UNINTERRUPTED, FREE OF VIRUSES OR THAT ALL PRODUCTS, FEATURES, FUNCTIONS OR OPERATIONS WILL BE AVAILABLE OR PERFORM AS DESCRIBED. Without limiting the foregoing, we are not responsible or liable for any malicious code, delays, inaccuracies, errors, or omissions arising out of your use of the Services. You understand, acknowledge and agree that you are assuming the entire risk as to the quality, accuracy, performance, timeliness, adequacy, completeness, correctness, authenticity, security and validity of any and all features and functions of the Services, including, without limitation, Postings and Materials associated with your use of the Services. You agree that Harmonix will not be liable for any interruption of Services, delay or failure to perform, any loss of Materials, and/or account data resulting from any causes whatsoever.\n\nYOU UNDERSTAND AND AGREE THAT, TO THE FULLEST EXTENT PERMISSIBLE BY LAW, THESE SERVICES, HARMONIX, ANY OF ITS AFFILIATES, OR THEIR RESPECTIVE SUCCESSORS AND ASSIGNS, OR ANY OF THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, REPRESENTATIVES, LICENSORS, OPERATIONAL SERVICE PROVIDERS, ADVERTISERS, OR SUPPLIERS, SHALL NOT BE LIABLE FOR ANY LOSS OR DAMAGE, OF ANY KIND, DIRECT OR INDIRECT, IN CONNECTION WITH OR ARISING FROM USE OF THE SERVICES OR FROM THIS AGREEMENT, INCLUDING, BUT NOT LIMITED TO, COMPENSATORY, CONSEQUENTIAL, INCIDENTAL, INDIRECT, SPECIAL OR PUNITIVE DAMAGES.\n\nNotwithstanding any claim that a sole or exclusive remedy which is provided in this Agreement may or does fail of its essential purpose, you specifically acknowledge and agree that your sole and exclusive remedy for any loss or damage shall be to have Harmonix, upon written notice from you to us, attempt to repair, correct or replace any deficient goods or services under this Agreement and, if repair, correction or replacement is not reasonably commercially practicable for the Harmonix, to refund any monies actually paid by you for the Products involved and to terminate and discontinue your use of the Services. You further understand and acknowledge the capacity of the Services, in the aggregate and for each user, is limited. Consequently some messages and transmissions may not be processed in a timely fashion or at all, and some features or functions may be restricted or delayed or become completely inoperable. As a result, you acknowledge and agree that Harmonix assumes no liability, responsibility or obligation to transmit, process, store, receive or deliver transactions or Postings or for any failure or delay associated with any Postings and you are hereby expressly advised not to rely upon the timeliness or performance of the Services for any transactions or Postings. Some jurisdictions do not allow for the exclusion of certain warranties or certain limitations on damages and remedies; accordingly some of the exclusions and limitations described in this Agreement may not apply to you.\n\n15. INDEMNIFICATION\n\nYou agree to indemnify, defend and hold the Services, Harmonix and any of its Affiliates, or any of their successors and assigns, and any of their respective officers, directors, employees, agents, representatives, licensors, Advertisers, suppliers, and operational service providers harmless from and against any and all claims, actions, losses, expenses, damages and costs (including reasonable attorneys fees), resulting from your use of the Services, any breach or violation of this Agreement by you, or your Postings or other contributions.\n\nHarmonix reserves the right to assume, at its sole expense, the exclusive defense and control of any such claim or action and all negotiations for settlement or compromise, and you agree to fully cooperate with Harmonix in the defense of any such claim, action, settlement or compromise negotiations, as requested by Harmonix.\n\n\n\n16. PRIVACY\n\nWe respect your privacy and the use and protection of your Personal Information. Please see our Privacy Policy for important information and disclosures relating to the collection and use of your Personal Information in connection with your use of the Services.\n\n17. JURISDICTIONAL ISSUES.\n\nWe make no representation that information on this website is appropriate or available for use outside the United States. Those who choose to access the Services from outside the United States do so on their own initiative and at their own risk and are responsible for compliance with applicable local laws.\n\n18. FEEDBACK, IDEAS AND SUGGESTIONS.\n\nWhile we welcome your feedback, ideas, and suggestions, it is important for you to agree to and to be aware of the following assignment and restrictions. If you send us feedback, ideas, or suggestions (collectively, unsolicited ideas), you agree that: (A) your unsolicited ideas become the property of Harmonix and you are not owed any compensation in exchange; (B) none of the unsolicited ideas contain confidential or proprietary information of any third party; (C) Harmonix may use or redistribute unsolicited ideas for any purpose and in any way; (D) there is no obligation for Harmonix to review your unsolicited ideas; and (E) Harmonix has no obligation to keep any unsolicited ideas confidential.\n\n19. LAW THAT APPLIES TO THIS AGREEMENT; MISCELLANEOUS TERMS\n\nThis Agreement, together with any Additional Terms, Rules, our Privacy Policy and any other regulations, procedures and policies which we refer to and which are hereby incorporated by reference, contains the entire understanding and agreement between you and the Services and supersedes any and all prior or inconsistent understandings relating to the Services and your use of the Services. This Agreement cannot be changed or terminated orally. If any provision of this Agreement is held to be illegal, invalid or unenforceable, this will not affect any other provisions and the Agreement will be deemed amended to the extent necessary to make it legal, valid and enforceable. Any provision which must survive in order to allow us to enforce its meaning shall survive the termination of this Agreement; however, no action arising out of this Agreement or your use of the Services, regardless of form or the basis of the claim, may be brought by you more than one (1) year after the cause of action has arisen (or if multiple causes, from the date the first such cause arose).\n\nThis Agreement and your use of the Services are governed by, construed and enforced in accordance with the internal substantive laws of the State of New York (notwithstanding the States conflict of laws provisions) applicable to contracts made, executed and wholly performed in New York, and, for the purposes of any and all legal or equitable actions, you specifically agree and submit to the exclusive jurisdiction and venue of the State and Federal Courts situated in the State and County of New York and agree you will not object to such jurisdiction or venue on the grounds of lack of personal jurisdiction, forum non conveniens or otherwise. To the extent it may be applicable, you agree to opt out from and expressly exclude any applicability of the Uniform Computer Information Transactions Act. IN ANY ACTION OR PROCEEDING COMMENCED TO ENFORCE ANY RIGHT OR OBLIGATION OF THE PARTIES UNDER THIS AGREEMENT, YOUR USE OF THE SERVICES OR WITH RESPECT TO THE SUBJECT MATTER HEREOF, YOU HEREBY WAIVE ANY RIGHT YOU MAY NOW HAVE OR HEREAFTER POSSESS TO A TRIAL BY JURY.\n\nYou agree that Harmonix may assign or delegate this Agreement, the Privacy Policy and any Additional Terms or Rules, in whole or in part, to any person or entity at any time without your consent. You may not assign or delegate any rights or obligations under this Agreement, the Privacy Policy and any Additional Terms or Rules to any person or entity without Harmonixs prior written consent, and any unauthorized assignment or delegation by you is void and ineffective.\n\nThe failure of Harmonix to require or enforce strict performance by you of any provision of this Agreement, the Privacy Policy or any Additional Terms or Rules, or failure to exercise any right thereunder, shall not be construed as a waiver of Harmonixs right to assert or rely upon any such provision or right in that or any other instance. The express waiver by Harmonix of any provision, condition or requirement of this Agreement, the Privacy Policy or any Additional Terms or Rules shall not constitute a waiver of any future obligation to comply with such provision, condition or requirement. Except as set forth in this Agreement, no consents or waivers or other acts or omissions by Harmonix shall be deemed a modification of this Agreement, the Privacy Policy or any Additional Terms or Rules, nor be legally binding, unless documented in writing and signed by a duly authorized officer of Harmonix.\n\nThis Terms of Use Agreement was last modified on the date indicated above and is effective immediately.\n\nCopyright  2016 Harmonix Music Systems, Inc. All Rights Reserved.\n\nPRIVACY POLICY TERMS OF USE USER CONTENT SUBMISSION COPYRIGHT COMPLIANCE MANAGEMENT JOBS PLAYTEST\n\n2020 HARMONIX MUSIC SYSTEMS, INC. ALL RIGHTS RESERVED. HARMONIX, FUSER, ROCK BAND, AUDICA, DROPMIX, DANCE CENTRAL, SINGSPACE, ROMANCE CENTRAL, A CITY SLEEPS, HARMONIX MUSIC VR, CHROMA, RECORD RUN, VIDRHYTHM, PHASE AND ALL RELATED TITLES AND LOGOS ARE TRADEMARKS OF HARMONIX MUSIC SYSTEMS, INC. FUSER, ROCK BAND, DANCE CENTRAL, SUPER BEAT SPORTS, BEAT SPORTS, SINGSPACE, A CITY SLEEPS, HARMONIX MUSIC VR, RECORD RUN, VIDRHYTHM, PHASE AND OTHER RELATED PRODUCTS AND SERVICES DEVELOPED BY HARMONIX MUSIC SYSTEMS, INC. DROPMIX DEVELOPED BY HARMONIX MUSIC SYSTEMS, INC. AND HASBRO, INC. BEAT SPORTS IS A TRADEMARK OF HARMONIX GAMES LLC. THE BEATLES IS A TRADEMARK OF APPLE CORPS LTD. GUITAR HERO IS A REGISTERED TRADEMARK OF ACTIVISION PUBLISHING, INC. ALL RIGHTS RESERVED. ALL OTHER LOGOS, COMPANY NAMES, BRANDS, IMAGES, TRADEMARKS AND OTHER INTELLECTUAL PROPERTY ARE THE PROPERTY OF THEIR RESPECTIVE OWNERS.\n\nWe use cookies to make the experience of our website better. By using our website, you consent to the use of cookies. Additionally, we have recently updated our Privacy Policy. To learn more about how we use cookies and review our Privacy Policy updates, click here.\nClose", "Space Required": "2.78 GB"}



["5 stars\n64%\n4 stars\n21%\n3 stars\n7%\n2 stars\n3%\n1 star\n4%", "daniellessjJun 24 at 8:10 PM\nLove the game but could be better\n\nI purchased this game about one month ago. I played it almost everyday and now become a little bit tired of these songs. Could we change these songs periodically? In addition, every time when I play the game, I have to wait in a line and repeat the same dance with Emilia. Could we skip this step and just select the songs we'd like to dance with? Thanks!\n\nHelpful | 99", "Nick-_-25 days ago\nAmazing game needs uodate\n\nSo Im giving it 5 stars because I absolutely love this game. I think its one of my favorites, I like the the song choices, the character interactions and personalities, and overall atmosphere of the game. Ive played at least 50 hours of in song dancing in fact I can play a lot of songs without flash cards. But their is no new updates to keep it fresh. No new song updates, no new story, nothing. Once youve accomplished 5 stars on every song in pro setting its like boring. No one plays multiplayer so I cant get those achievements. Just sucks nothing new will seemed to be added.\n\nHelpful | 17", "Arnold733 days ago\nA great game but frame drops\n\nI really love Dance Central VR. Like many other players, I felt under the spell of this VR club, which is incredible.\nAnyway, on the Quest version I own, I am disappointed with the numerous animation issues. When dancing, the NPC you are watching experiences \"jumps\" in its animation, as if mini tracking problem were occuring. Or maybe these are purely frame drops in the NPC animation. Of course, I know Oculus Quest is not like PCVR. Nethertheless, these \"jumpy\" issues are very confusing. I tried to discuss with Oculus support, then to contact Harmonix by sending a ticket on their homepage, but I had no answer\n\nHelpful | 1", "Bossun21Jun 27 at 3:59 AM\nAs Aubrey says, \"A-mazing!\"\n\nThe game is pretty great and I loved every second of it!\nThe characters stories were great and I liked the finale too, even if Dr. Pain-In-The-*ss keeps sending me dad jokes every now and then hahah\nAlso, the gameplay. I've played a bunch of dance and rhythm games, but Dance Central VR is definitely on the top of the list.\nAbout little secrets, I've been searching the game for a while and I haven't found any Easter eggs or hard unlockables... Maybe I haven't searched hard enough?\n\nHowever, there are still a few things I'd like to suggest to the dev teams that I'm not sure everyone agrees...\n\n- The little play button at the top of the phone screen when you finish a song.\nI know that this is something you'd definitely use if you're trying to overcome your score, but I never use it at all.\nI believe that if that button displayed the song the DJ is playing at the time I'd use it a lot more often! Some times I'd prefer if the DJ chose the songs for me :)\n\n- Interactions with characters\nFrom my play through I noticed that the fist bumps or high fives the characters requested only happened when I called them over. I'm a sucker for these and would love it if they were more frequent!\n\n- The wardrobe clothing hangers\nMaybe I'm just stupid, but I only noticed you could move the clothing through the railing by pushing them after I was done with the main story line, which saddens me xD\nAgain, this may just be me, but something more intuitive could have helped a bit.\n\n- Promote this game a bit more\nI'd love to have more people on the lobby to play with, but it's rare to see anyone there... Maybe throw some events on the quest calendar? :)\nYou could give some clothing accessory or whatever to the top players or to everyone that joined. That's just an idea.\n\nThank you for so many hours of sweat and awesome dance moves!\nBig hug :D\n\nHelpful | 16", "Hurl3yJul 5 at 1:14 PM\nWithout a doubt my favorite vr game.\n\nI didnt think anything could pass beat saber for my favorite, but this game has definitely done it. I was bored so I was trying different demos and I saw this and thought who would pay $30 for a dancing game? I tried it out and immediately fell in love with it. The entire game is so fun, silly, and welcoming. Just an overall good time. I think the little storyline is fun and you can interact with the characters. Its a shame that this game isnt more popular, this game deserves to blow up. If you only ever get one game on your vr, this is it.\n\nHelpful | 8", "halfasnack23 days ago\nGreat game but...\n\nI love the game and I would love a concept where we can upload songs and create our own dances using the existing moves already, the same way we can make our own playlists. Id pay extra for it to be an option! Even if it was per song\n\nHelpful | 2", "Chimido9913 days ago\nA fantastic and legit experience\n\nThis is my favorite game, it has great music (original and from famous singers). It has an extensive song list (compared with other dancing games). And finally, the rest of the crew are very charismatic and fun to watch.\n\nThe only thing that I didnt like is the costumization of our avatar. You can change the case and the interface of your in-game phone and clothing, but I think that the devs could have add more items.\n\nSolid game, a must have for the oculus quest.\n\nHelpful | 0", "captaintoadetteJul 3 at 10:44 AM\nThe reason I got a Quest!\n\nThis is my absolute favorite game on the Quest. I love what Harmonix did with this game. I have been super obsessed with the Dance Central games (minus Spotlight, never had it and don't intend to get it) and honestly this game has impressed me. It is gorgeous and has a lot of character, something I have expected from Harmonix since they always pour SOOOOO much love and care into the Dance Central series. The choreography is centered mostly in your hands and you are scored on your movement pattern and hand/head position (to explain it veryyyy loosely)\n\nIMPORTANT: As someone who was nervous that this game would be butchered, I loved it so much and I really hope to see sequel(s) to the series on this platform in a similar fashion.\n\nLoved: Everything about the game lol, but to be specific - The new artstyle, the phone gimmick, the colorful club atmosphere, the act of befriending the dancers/giving them more personality (Emilia is my favorite btw, always has been and always will!!) They made the dancers SOOOO much more expressive in this game while dancing, which I love!!! They have always made them pretty expressive (except Spotlight) but they set the bar even higher in this installment. Absolutely gorgeous.\n\nChanges I'd like to see in future installments: A little bit more variety in the choreography, sometimes (not always!) it feels like even in Pro mode you do the same move for a long time. I'd also love to see full body tracking but that's not exactly Harmonix's call haha. I would love to see more playable characters, more outfits/customization options in general for your avatar, more texts and things from the dancers long after you complete their stories (maybe something even as simple as a \"how are you?\" every now and then, for a loose example) I'd loveee to see a bigger tracklist next time and/or more DLC: I know there are limits and reasons why maybe this isn't possible, but this is just what I'd like to see. Maybe even more outfits for the dancers?? Or an option to choose their outfit (Ex: texting them to wear a certain outfit, idk) Random, but I love what Harmonix did with DC3 by giving it a little story mode. Even though it was goofy and borderline cringy in a good way, I loved that little touch and would love to see a more structured story mode of sorts in the future. I would like to see more assistance in the Break it Down/studio mode. It is a bit harder to see what you are doing wrong without the video record options, voice control, etc. An issue I have with DCVR is that sometimes the hands are a little laggy - usually when the hands are close to the head, a few weird visual things going on but I can't complain much. This is blazing a new frontier.\n\nI'm sure I'm forgetting a lot of things I wanted to suggest or praise, but overall I am SO happy with this game and I think I will be playing it for years and years. (I play the older Dance Central games to this day just for fun and exercise; had DC1/2/3 for closer to a decade now and they still have their charm)\n\nThank you so, so much, Harmonix, for making this title and this series!!!!! Would looooove to see a sequel on the Quest \n\nHelpful | 5", "butterfly2848Jul 23 at 1:56 PM\nLike the game, but needs more songs\n\nMy soon to be 12 year old daughter and I like the game, but it needs more songs. I don't think it's right that you pay for the game and then you have to pay to add more songs. We danced the songs that came with the game within 3 hours of game play\n\nHelpful | 2", "stonecraftartsApr 8 at 9:53 PM\nVery Good, but could be better\n\nOk I've finally played Dance Central through to the story line conclusion, and I will admit it is very well done game; engaging, immersive, a lot of fun. The only thing that would make this a 5 star game is if you could load your own songs. I really wish there was a \"freestyle dance\" mode in the lounge where you could host... but actually play your own playlists! No competitive stuff, no strike a pose like Emilia on the dance floor; just dancing in the VR lounge to your own tunes. That would be a 5 star game.\nDance central is like going to a really awesome club, with interesting people - but the DJ just keeps playing the same f#@%!ng songs every night.\n\nHelpful | 175", "Reina09Jun 10 at 7:31 AM\nGood over all\n\nIt was a pretty good game besides that your arms really dont work properly you cant really bend your elbows in the game. It is a very fun game sort of like JUST DANCE just theres more to it which makes it more fun! I wish there was also a way to put your own songs in this game so you can make up your own dances for people to learn! But I definitely DEFINATLY do recommend this game for sure.\n\nHelpful | 4", "AlittleStitiousMay 2 at 10:25 AM\nPay attention to hand gestures!\n\nI really like this game!!! I used to play all the Dance Central games on Xbox One (Kinect) I love that the dance moves arent too easy or too hard. I was wondering why some of my dance moves werent flawless... No Im not a bad dancer... It was because some dance moves require you to make a fist or point your finger. Maybe I am the only one who didnt pay attention to this detail. The only criticism I have is not having a multiplayer option, like having a dance battle with someone else who is online, face to face. I am really looking forward to new songs and new dance moves!\n\nHelpful | 36", "musicman55Jul 21 at 8:12 AM\nBest dance game yet!\n\nI was curious on how this would be. I thought it was going to be like the xbox game but I am so glad I was wrong. The songs are amazing. The moves are very nice and even challenging for me. And best part, there is character development! I absolutely love this game!\n\nHelpful | 1", "OcuLorneApr 27 at 10:14 PM\nBest game for Quest\n\nI have about 25 hours in this game so far, and it's the best game I have played on quest by a wide margin. All the music is good enough that it's nice having the songs stuck in your head, and I find myself rehearsing the moves in my mind when that happens.\n\nI love the attention to detail. The partner dancers are absolutely pro, and the motion tracking is magnificent including finger movements, taping toes, and every millimeter of body movement. On rare occasions the partners sing along to the songs. The way partners and randos catch your eye is on the cool side of the uncanny valley.\n\nThere is no real foot tracking for the player, but it picks up some things, and I like to try to follow the choreography in full - More challenge, and a better workout.\n\nTop fix I would like to see is no \"encouraging words\" when you stop a song early or when you totally sucked. Really need more variety on encouraging words and cheers too.\n\nTop DLC I would like to see is alternate dance styles, Argentinian tango please? I know that requires physical interaction, but we all gave the robot a spin in \"welcome to quest\", so we know it might be possible.\n\nSecond would be more wardrobe for the partner characters. If Emilia wears the yellow shirt one more time I'm going to have a melt down.\n\nAnd yes agree with other reviewers, a romance might be nice, although the flirting in the existing game is very well done.\n\nThis should not be a game, this should be a genre. I hope very much to see more titles like this (   )\n\nHelpful | 30", "alosneckJul 13 at 10:21 AM\nGreat game but really needs more content\n\nI absolutely love the game. It's got really good vibes and you feel good while interacting with the characters. The character customization is ok but could be better.\nThe songs are decent but after a while you just get really tired of them.\n\nHelpful | 1", "Bender_2112Jul 16 at 9:40 PM\nNeeds more music variety\n\nFun game but it would be nice if they had an expansion pack of 70s, 80s, and 90s dance tunes. How about some Bee Gees or Prince?\n\nHelpful | 2", "Lindak6813 days ago\nDance Central\n\nI love this game. Its so much fun and great for exercise.\n\nHelpful | 0", "SerendipitySkyeJul 20 at 5:54 PM\nLove this!!\n\nI love this game so much! It's great exercise without being too strenuous. I have a bad knee but can play this game no problem. I love the diversity in the characters, even in body shape. Good songs too :)\n\nHelpful | 0", "ZiiiiiMay 23 at 8:54 PM\nGreat workout, better if more songs\n\nI knew nothing about dancing before and this game is so beginner friendly. Even got names of the dance moves, and the music fits perfectly with the moves. Love the practice mode as well, when you can track your hands and polish your skills. Every detail is well made and the characters are very interesting to interact with.\nThe only thing is there are only 30ish songs to dance to. There are tons of other songs that Id love to try in my head! Yet I know it takes so much effort to even make one. So still five stars, and hope to see more in the next update!\n\nHelpful | 6", "JoyceD21 days ago\nNeed new song\n\nFun game but get tired of the songs. Would be fun to have some popular tiktok dance song.\n\nHelpful | 0", "SweetEscape2Jun 1 at 1:20 AM\nGreat; could use a few tweaks\n\nSo far so good! There is a nice selection of music. Like others, there isnt a vast amount of songs so its easy for them to get old. I like being able to pick an outfit and modify my characters appearance. I would like the option to *skip the dance tutorial when first entering the main floor and *an option to confirm song selection. For example, when I am scrolling through the songs, the game thinks I selected a song versus tapped it while scrolling. I definitely dont want to dance a repeat song but the game isnt programmed to sense this , I guess. Id like if it confirmed my selection or gave me the option to stop a song and/or select a different song mid-play. Perhaps these features could be turned built into the user settings as preferential options.\n\nHelpful | 3", "YajieApr 24 at 2:52 PM\nlike it as workout, but need more songs\n\nI have just played through all the songs, basic as well as pro, within a week. I like the move design and most of graphics, but the phone chat is quite annoying, I dont have to check my phone that often even in my real life... and the chatting topics are incredible boring, not to mention sometimes the characters send you voice messages.. But the biggest issue for me is the taste of songs, yes they are suitable for repeated dance, but they all are highly similar and I cannot find any other music style. After playing some songs for 3 times you cannot get them out of your head, which is also quite annoying..\n\nHelpful | 24", "GoddessLaniakeaJun 25 at 10:25 PM\nDancing the night away\n\nI like this game. Immersive and fun to get inside my avatar.\n\nIve noticed that my avatar can move her legs when Im in the wardrobe pressing one of the buttons on the left controller but not anywhere else? But only after I pick up a different phone from the carousel. The motions are different after that.\n\nIt would be nice to know a little more how to progress in the game.\n\nHelpful | 0", "Thor_StoneJun 10 at 5:05 PM\nIn the club at home...\n\nIm a huge fan and hope they add expansions for this game! With clubs closed in the real this lets you hit a VR one from your home. DAaaance Baaatttlllesss! If youve spent a few nights in clubs youll immediately feel familiar with the cast of characters (they have far less drama then their real counterparts). Even better is no pushing through crowds, no smelling like cloves, no spending your rent on drinks, and no hangover the next day. Im currently early in the story but plan on taking my time to enjoy the cast interactions... and hoping future expansions (added clubs, control w/just hands, etc.) are in the pipeline.\n\nHelpful | 2", "MyrrhTreeJul 19 at 2:53 PM\nActive and engaging\n\nReally fun dance game with great details. The moves are simple and fun, and the dances are to popular songs. You dance with different characters and chat with them on a cell phone.\n\nHelpful | 0", "HarrisVRTeamJul 19 at 1:47 PM\nMy 5 year old LOVES this game!\n\nThis game is the all and be all for my 5 year old! She will dance and practice all day long if I allow her to! I give this game my highest regard!\n\nHelpful | 0", "MistOfHorrorMay 19 at 5:43 PM\nThe best dancing game on the Quest\n\nThis is by far the best dancing based game on the Quest today. There are 32 songs in total giving you hours of content to play with. You are also able to change your clothes at anytime, check how many calories you have burned each day, and even play with other people! Though, it can take a little to find others to play with sometimes, it's still a great feature to have. This definitely lives up to the original Dance Centrals; I would even say it's better than the previous ones. My only real critique is that sometimes the tracking on your arms can be a little glitchy which can make you mess up, but other than that this is a great game 9/10\n\nHelpful | 2", "therweesJun 11 at 4:12 PM\nLove this game\n\nCan you please add Shaggys It wasnt me to the playlist?\n\nHelpful | 6", "CircusKushJul 12 at 7:59 AM\nDance Central\n\nShould update periodically with fresh content. Its a great workout but it gets old fast.\n\nHelpful | 0", "wild-horseJun 24 at 5:42 AM\nNice, but...\n\nUnfortunately not my style of music or taste of style... But makes a nice kind of workout when you add oldies and evergreens i might am back...\n\nHelpful | 1", "Wamalicious3012Jun 8 at 11:33 PM\nI was really excited but didnt match up\n\nDc is cool but didnt match up to my excitement level. I always use it to warm up before I go into box vr or thrill of the fight. Its also nice if you wanna perfect your dance step if you have two left legs like me.\n\nHelpful | 1", "KageOkami666May 17 at 1:11 PM\nMakes fitness fun\n\nHave always hated exercising it was tedious and boring but this game has made it a lot of fun. Love the characters and the flirty dialog. The songs are great and a lot of fun to dance to (or attempt to as the case may be). I hope more songs and dance moves are added as this game is so much fun and I dont want the party to stop.\n\nHelpful | 2", "AverandJul 17 at 11:21 PM\nDance!\n\nIf you like to dance this is for you!\nGreat exercise!\n\nHelpful | 0", "BossLadyHMay 14 at 1:21 PM\nDance away!!\n\nI love it. When I feel like going to party I just grab my quest .\n\nThe songs are ok, could do with some more newer songs but I like the variety.\n\nDance with different characters and get better as you go.\n\nRecommend\n\nHelpful | 3", "CartagenaXlitoralXMay 2 at 12:42 PM\nPerfect but...\n\nThe game is extremely well done, very immersive, song selection is quite cool and dances are good overall. I think than despite technical limitations of dancing with a headset on, there's definitely room for more complex choreos. I'm not saying something like Just Dance Extreme routines, but something in between. They also need to add more DLC songs, I would totally buy new songs, but the current ones are a bit outdated and all can be seen on other dance games (the dances I enjoy the most are the ones I've only see in this game).\n\nHelpful | 2", "CameraLenzMar 6 at 12:13 PM\nWorkout time flies by!\n\nI have to really be engaged in an activity to keep exercising for extended amounts of time. This game makes that a breeze. Once you find your favorite songs, just add them to a playlist. You can build as long of a custom work out as you want. Then just dance through all those songs and burn a ton of calories while having a good time. We need more games like this on the quest! Very well done devs!!!! PS, I really like the characters. You start feeling like you know these avatars lol\n\nHelpful | 41", "sherbetlemon1996Jul 11 at 1:16 PM\nLove!\n\nWas my fav on kinetic and this is better!\n\nHelpful | 0", "kimbiecookieApr 17 at 6:30 AM\nLike you're in a club!\n\nLove this game and I play it everyday for a fun workout! It's great especially now during social distancing! You feel feel as though you are at a dance club! You feel as though the characters are familiar friends you meet up with. My favorite is Aubrey in VIP. She is like a mix between a valley girl from the 80s and your favorite millennial ( if you have a favorite millennial that is!). I like the variety of songs since I'm a child of the 80s but love modern dance songs too. Nice variety. I would like more options in the store to purchase more than just the few that are there. I do wish also that you could keep all the clothing options in the wardrobe. Once you get clothing rewards from the characters, some on your previous options disappear and some of the reward clothes are just plain ugly. I miss my favorite two crop tops for my avatar. Please let us keep all the clothing options because there isn't that many to begin with for our avatars. Maybe an update can fix this wardrobe option and give us more songs to purchase in the store. Waiting for these 2 updates to give it 5 stars! Anyway thanks for a great great game.\n\nHelpful | 3", "DraigesJul 21 at 5:56 AM\nCould be better\n\nI bought this for exercise,it would be better from my point of view if it played 70s/80s disco music.\n\nHelpful | 0", "Niah_1102Jun 3 at 5:37 PM\nFun\n\nThe game is really fun and energetic. No meed to go to the gym this game is a whole workout\n\nHelpful | 3", "oSevenSoMar 10 at 6:54 AM\nAbsolutely worth it\n\nIf you played Just Dance on the Wii or any other similar dance game and you loved it, I can tell you you'll love this game as well! It has modern and old songs. The environment is just amazing, it makes you dance even without music.\nYou get a phone as menu, it's nothing difficult. The tutorials are hidden in your phone so if you need them instead of discovering everything yourself, you can find them there.\nThe interaction with the characters is flawless. It's like you really meet and know them. It has a story so it isn't just dancing. You're dancing for a purpose.\n\nYou will adore it. Dance like nobody is watching!\n\nHelpful | 12", "Frozztastic20 days ago\nThe iPad part is too touchy\n\nFun but controls are messy.\n\nHelpful | 1", "History0206May 28 at 12:59 PM\nBluetooth sound bar sound horrible.\n\nHelp this get fix, i have a Samsung q70 sound bar.\nEverytime connected to Bluetooth the sound is really low quality and downgrade. When i using headphone feel like you in actual club. Any idea???\n\nHelpful | 0", "vincent_peterJun 2 at 8:54 AM\nDance Central\n\nI love this game! Its so fun and has a great set list and story line. I play it everyday!\n\nHelpful | 2", "MrKappaApr 19 at 7:31 AM\nGreat game / so much extra potential\n\nOk heres the deets\n- game has popular music both recent and old school hits (could be better if they had more buyable packs by genre)\n- youre in an immersive night club environment which is really cool (could be better if you could strike up a dance with some set patrons around .. some of the patrons actually seem to glance over at you sometimes .. would be cool if that was a feature to ask someone to dance to add in more Experiences besides the dance teachers)\n- the club is awesome but more environments would be cool (think dance battle in an alley or warehouse or one of those sessions where theres a crowd sitting around you .. think going to a studio to get some pointers from someone) .. the whole thing could be a great dance adventure\n\nAmazing game for a work out or just back fun\n\nA plus for its design and potential to be even greater\n\nHelpful | 2", "The_WerdolfFeb 18 at 12:12 PM\nCould be 5 stars\n\nI enjoy the game very much, the music is a cool selection. Dance moves are sometimes hard to master but I'm 52 years old, however I'm progressing quite well. The only complaints I have are the visuals, the avatars are not enough customizable. I'm not able to create an avatar that really looks like me. I would also prefer a less cartoon like graphic stye and I know the unreal engine is capable of this. Anyway it's worth it's price, if you like dancing, this is the right game for you!\n\nHelpful | 24", "Mr.BigPapiJun 11 at 6:22 PM\nAmazing\n\nMy favorite game on the Quest\n\nHelpful | 2", "mwarembourgApr 24 at 7:01 AM\nGreat but regular updates please\n\nGreat game. You sweat a lot. The songs are good and the virtual partners are great !! Really worth it but do you plan anytime soon to release some extra contents ? The game has laucnhed a long time ago and it seems you just left it there and forgot about it no ? Could be a 5 stars with regular updates. It start to be boring running on the same tracks\n\nHelpful | 4", "DJAxisMar 24 at 1:24 PM\nNothing but time\n\nThis app has given me time to escape, let go, and dance during this unprecedented time in our history.\nClubing while Quarantined and keeping social distance.\n\nHelpful | 19", "lilhuskyvrMay 14 at 5:31 AM\nLove this game!\n\nExcellent game and amazing characters. Very well designed game. Love to see more of this!!!\n\np.s: i fell in love with ms aubrey lol but found out that she doesn't look as good in the dance central 3. why? T_T\n\nHelpful | 1", "Borovicka3Apr 14 at 6:32 AM\n\nI really like this, I track my calories with it and use it as part of my diet exercise. I do d it really fun and an hour later I'm still wanting to do more. I just wish there was more music....Michael Jackson would be kind of nice!!!\n\nHelpful | 3", "sheri.resnik.5May 5 at 4:31 PM\nCan not get into the club any longer!\n\nThank you! That worked!! I am giving it 4 for now and will be back to up it again if I like it.\n\nEver since the last update, when I start the game, I am in a line outside the dance club. No matter what I do, and what buttons I push, it will not let me in the club. This should not be an issue of too many people on it, because it does not require an internet connection to play.\n\nHelpful | 0\nDeveloper ResponseApr 17 at 7:46 AM\n\nHi there! To navigate from the club entrance, physically look down towards your waist in-game and your cellphone should pop up. Grab your in-game cellphone and use the \"Travel\" app to bring up the map. From there, you can use your finger to tap where you want to go. Hope this helps!", "DLASTMOJICANApr 16 at 5:05 PM\nI LOVE THIS GAME!\n\nThis game takes dancing games to a whole new level. They have both classic and modern songs, the choreography is easy enough to follow but has enough moves to get you pumped and swearing. If you havent bought the ear phones from Oculus, the sound is astonishing and amplifies the experience. I think its cool you can dance with real people/friends, and I like the social interaction with the characters. The cell phone concept is brilliant, being able to travel to different locations, texting the characters, taking selfies of your self, and I love that the phones battery is actually the battery level of your headset. Lastly, I think its brilliant that weekend you start to hit each move flawlessly and unread your stars, you become the spotlight on the dance floor. TOTALLY Worth it! Especially since I got it in a flash sale for $23.99\n\nHelpful | 1", "TheMunroStoreyApr 16 at 11:21 AM\nGreat night out in!\n\nLove this!! After a stressful day working extra hard due to Covid, its great to dance the stress away! Learning the dances takes your mind off everything for a time. Added bonus is the exercise - I always .. always feel invigorated after each time I go to the best club in the world! Love it!\n\nHelpful | 0\nDeveloper ResponseApr 27 at 11:05 AM\n\nThank you so much for the kind words. We hope you're staying safe and healthy out there.", "mikemaysterJun 3 at 10:10 PM\nReally cool\n\nIts good for excercise.great game!thumbs up\n\nHelpful | 1", "Tea013Jun 6 at 4:24 PM\nFantastic!\n\nLots of fun!\nEasy to operate\n\nHelpful | 1", "goohliDec 20 at 12:32 PM\nNeeds hand-tracking support\n\nI like this game, it's a great workout and you may even learn some interesting dance moves. But I really hope the devs are working on hand-tracking support. I don't like having to press buttons to make a fist or when the controllers touch because a dance move requires to put your hands close to each other. It breaks immersion.\n\nAlso maybe it's me but when I scroll on the phone to pick a song, I sometimes instead click on a song, then I have to wait 3s to stop the song, it annoys me to no end. It would be so much better if we could use the joystick to scroll or if there was a scrollbar (for the hand-tracking mode ;)\n\nFinally it would be great if there was a Party mode like in Beat Saber to compare scores between friends.\n\nHelpful | 203", "sillydogeballFeb 18 at 12:55 PM\nFun and a workout!\n\nI havent fully completed the game, but Im nearly there. The relationships have been exciting for me to keep up with, and the songs that belong to each person have become favorites for me as well. Ive stuck mostly to the same ones to get the moves down, and after a while I find many songs are easy to jump into on a first run. This has been my absolute favorite game... EVER! And I still have tons of songs to try out!\n\nOn the workout end of things, Im floored by how much sweat this game creates - in a good way! I work from home and live a fairly sedentary life, so this game keeps me up and moving during breaks. There are suggestions of it burning between 6-8 calories per minute of dancing, and I totally believe it. The workout factor has been huge for me. Love this!\n\nHelpful | 11", "chengzhang265Apr 26 at 8:11 PM\nI like the pro mode\n\nIt's entertaining. Especially love the pro mode. The tracking is not 100% accurate but fairly correct. And I would love to have more interaction with other players but no one take my chanllenges or chanllenge me.\n\nHelpful | 0", "BenUSA1May 8 at 8:39 PM\nMore girls Please\n\nI danced like a stud, Saturday Night Fever.\nMore Songs please, some disco funky stuff.\n\nHelpful | 1", "saltavengerMar 22 at 1:04 PM\nReally enjoyable\n\nReally fun game. Im not an amazing dancer but I can at least passably keep up. Songs are entertaining and have a decent mix of old and new. Downsides are that I struggle a bit with the controls, I think it could use slightly more songs (b/c the in-app purchases add up quickly), and the fact that VR headset & sweating is kind of gross. I accidentally select songs a lot when Im trying to scroll. I appreciate the immersive quality of it, but I really wish it was more user-friendly.\n\nHelpful | 1", "Gator_Goddess_20206 days ago\nSuper fun!\n\nLove this game and the song list!\n\nHelpful | 0", "Pninush1Mar 28 at 1:34 PM\nA wish for more\n\nThis is a great game if you want to move your body, get social or just spend a couple of hours having fun. I wish the playlist was longer.\n\nHelpful | 2", "Jack0l0peMay 4 at 3:07 PM\nBeatufuil\n\nA beatuifuly made game. I couldnt make it better.\n\nHelpful | 0", "CrimsonJoltMar 15 at 12:34 AM\nGreat game with one major grip.\n\nI have a big room to move around in, so I like to dance around. My issue is when I come near the AI characters, I get a lot of stutter. So you have to keep your distance to avoid that lag. I'm asking for some video settings to lower efforts/resolution. I want better frames!!\n\nThat's my biggest grip. Never played the other DC games. I hope they invest in a sequel with better everything, more challenges.\n\nHelpful | 3", "pinnacleplusApr 11 at 6:05 AM\nBig fan\n\nLOVE dance central since it first came out on xbox. It'd be awesome if Harmonix could bring over all the dance track from Dance Central 1-2-3 from Xbox system.\n\nHelpful | 0", "bbknickersJan 6 at 11:23 AM\nLove it!!!\n\nspoilers *\nIm the opposite of a good dancer, but I downloaded this game on a whim and absolutely LOVE it (even if I do play when nobodys around to watch!). I love that it has a calorie tracker so that you feel like youre doing something productive. Its basically like a gentle aerobics workout, much better than just sitting around.\n\nI cant speak for the quality of the music. I hate most hip-hop and pop, so I dont like most of the songs, but enjoy dancing to them anyway. I wish there were more rock or metal-influenced songs, or even some country thrown in to mix things up, or more oldies.\n\nIm also really enjoying the character interactions via texts to the point where I sometimes play just to get the texts. Dr. Tans texts make me laugh out loud. Trouser Barons, indeed! I wish there was some kind of option to romance the characters, though (what happened after that motorcycle ride to the olive grove?? Did I offend you by making fun of your use of a spork??), and on that note I wish Oblio texted more. Like, seriously, I know youre busy brooding, but pick up the phone, bro.\n\nI feel like there was a real missed opportunity to explore Oblios relationship with his father, given that the player starts to develop a friendship with Dr. Tan that Dr. Tan views as a father/child one. Comedy seems to be the focus here, but the writers have been terrific and I feel like they can do great developing that character arc in a future update.\n\nI also wish that the rest of the characters texted more, too. It really adds a real-world element to the game and its fun to get to know them. (Yes, I know that theyre fictional.)\n\nIt would also be fantastic if the characters had more outfits.\n\nAnother suggestion: when the player gets to a certain level, Dr. Tan appears as a dance partner! His song should be something like Everybody Wants to Rule the World.\n\nHelpful | 22", "fenix777tjApr 12 at 3:50 PM\nGreat game, but no funcin to record vid\n\nThe only reason I rated 4 stars, was the fact that the game does not let you rcord your sessions.\n\nHelpful | 1", "tingting.huisApr 27 at 5:16 AM\nGreat game!!\n\nReally like this game!\n\nHelpful | 1\nDeveloper ResponseApr 27 at 11:05 AM\n\nWe're so happy you're liking Dance Central!", "BoyosialMay 1 at 10:14 PM\n\nIf you love dancing, this is the one\n\nHelpful | 0", "felicity.sistFeb 8 at 7:17 PM\nCould be good,\n\n1. You have lots of feedback about the hand tracking, it's really awkward to move about.\n2. I could put up with 1, except I really don't like any of the music. I am 60, there is a market out there for us. Beat saber was the same with all that synthetic/electro music, however the packs like green day, panic at the disco and imagine dragons provided some decent music.\n\nHelpful | 10", "ScorpionQueen51Mar 20 at 4:38 PM\nNot my type of game!\n\nThis game I love it u know with the dances and people but however this game is to complicated for me the moves I don't understand this game is kinda boring I would reccomend this game to people who r actually can dance and know all the basics other than that the whole game is dancing I does not give tutorials about the dance moves either this is not my type of game but tomorrow I am gonna refund it I will tell u if they allowed it so u can see the chances of refunding please give a tutorial about dance moves and make the wardrobe bigger thank you.\n\nHelpful | 2", "Hypnotic105Mar 24 at 2:59 PM\nPerfect\n\nI have owned all 4 Dance centrals on the Kinect and this game gave me a reason to get a Quest. I love DC and cant wait to see more in the future. Keep up the great work Harmonix!\n\nHelpful | 1", "JulieCusimanoWallJan 24 at 5:09 PM\nSo. Much. Fun!\n\nIn the real world I love Zumba and Hot Hula, but I gave up my gym membership last summer because I never went.\n\nThis, though! Wow! I am not a graceful dancer and fairly certain I look like a dufus playing this game, but who cares? Its a lot of fun, and Harmonix! They brought me Rock Band back in the day, and like that, Dance Central does not disappoint!\n\nI love the interaction between the characters and me, wardrobe choices, and the playlist! What a fun way to get a calorie burn into my play time.\n\nHelpful | 6", "tealparadiseFeb 22 at 7:18 PM\nBest workout in VR!\n\nVery real, very accurate. Much better workout than the other games I've seen recommended. Also it's friendly fun! Thank you for making something engaging and interesting with a simple premise.\n\nHelpful | 3", "andrew03251985Feb 17 at 11:31 AM\nVery fun and great work out\n\nGave 4 stars because no matter what my boundaries are set to when Im in the wardrobe I can never reach the clothes hanging in the back that just so happen to be the female close. Other than that I really enjoy this game. Would like more frequent updated music added but good selection already on the game. I highly recommend this game for sure.\n\nHelpful | 1", "jericho2005Apr 1 at 8:46 PM\nFun for parties\n\nMe and some buddies decided to do this in New Years and we had a blast. It was a great laugh, and I recommend it\n\nHelpful | 1", "dancegametoys17Jan 26 at 11:19 AM\nAwesome dancing and social experience!\n\nBefore I say anything else, I would like to thank Harmonix for continuing to listen to peoples feedback and improving the game. The latest update allowing to change the phone size is wonderful, and the addition of DLC is great, along with a nice fitness mode that tracks calories burned.\n\nNow, I have played all the past Dance Centrals on the Xbox 360, but this experience in VR was like no other. Even with peoples criticisms that the choreography is too easy or that VR is uncomfortable, I found the routines still had quality and the immersion in the virtual dance club is wonderful. The transition from console to VR was pretty smooth, and I love the greater expressiveness of the dances with hand gestures. Being able to interact and text with the characters up close is a dream come true. The art style is a nice callback to the DC1s intro cut scene and has wonderful attention to detail. The multiplayer lounge is the highlight of the game, being able to dance and chat with other people in real time and just hangout. I appreciate also Harmonix going in on Fridays to dance with us. Just wish that more people went into the lounge more...\n\nIn all, this game is a wonderful social experience and is worth the price. The references to past games, the still enjoyable choreography, the visuals and character interactions, and the solid social gameplay is amazing. I hope we can get songs new to the franchise in the future, and maybe possibly old characters that arent in the game now? Thank you Harmonix for reviving this game series!\n\nHelpful | 12", "gary.towersDec 31 at 3:36 PM\nParty anytime\n\nAn awesome game for the platform. The freedom of movement combined with the nice music beats and characters make it fun to jump in casually and have tons of fun.\n\nThe only reason why I'm not giving a 5 stars review is because the multiplayer mode (which is awesome) is normally empty or hard to find people to play with... Maybe the developers need to push more marketing into the game or add more multiplayer rewards to have more people joining\n\nHelpful | 5", "sputukJan 10 at 7:54 PM\nSo good, it made me dance\n\nI am not a dancer. Never have been, never enjoyed it, but...\n\nBought this game on a whim based on trying out what works and what doesnt In VR and Ive been playing it for a few hours every night ever since.\n\nGreat exercise, but also great fun.\n\nThe songs were initially not to my taste, but actually, they are all catchy in their own way, and some of the songs have now become real favs too.\n\nIm still not really a dancer, but I dont care. In VR, I can image I am and that I look good doing it.\n\nThe story lines and the characters in the game along with the immersion that VR brings makes you want to do better, to please the person you are dancing with.\n\nIve only got good enough to do well on the armature difficulty so far, but can now get 5 stars each time on the songs so I think its time to step up and try those pro dances.\n\nCons: the graphics are good enough, but could be better - eg the crowd characters glow in the dark eyes are spooky.\n\nThere needs to be a lot of expansion of the DLC store - and that would ideally include more characters.\n\nThe story line draws you in but then it all kind of hits the buffers once youve levelled your all the characters and the (creepy) club owner is revealed. The way you build connections with the characters hints that the game might include continuing building them, but they kind of plateau.\n\nIn a similar way, the wardrobe options could do with being able to unlock more choices, as could the character creator.\n\nIf the game can bring in using the hand tracking now it is available, that would be great - and if there becomes any way to track the other body movements better too, that would help with the immersion - sometimes you can get a top score for a move when you know you messed up, and visa versa, but generally, it does a good job of rewarding the right moves and recognising errors.\n\nHelpful | 4", "kimberlei.bradford1Mar 23 at 8:01 PM\nDance\n\nThis game is a lot of fun. Gets my cardio up and I have learned some new moves.\n\nHelpful | 0", "YardGyalJan 11 at 8:25 AM\nVery fun!\n\nCool experience. Nice song selection. Definitely use headphones. Hand tracking would be awesome. Cant figure out how to point two fingers only forefinger. Great workout once you pump up the effort and move your feet otherwise mostly arms.\n\nHelpful | 4", "ashish.gupta1Apr 3 at 2:02 AM\nNice\n\nKindly add more songs\n\nHelpful | 1", "OtomegtxMar 22 at 7:36 AM\nNICE\n\nI'm waiting for his email-all the time.\ni miss the event\n\nHelpful | 1", "AJMcCoy42Mar 13 at 11:13 PM\nNice\n\nI domt personally play it, but my sister said it was great so why not give it a good review\n\nHelpful | 0", "Yuk1muraNov 15 at 2:07 PM\nAwesome movements scary graphics\n\nYeah, I've never thought I'd finish using Oculus dancing. The idea, environment are super good! And I'll have to play, cause it's no alternative. But guys - this graphics... it's killing an impression! Isn't dancing about atmosphere? How we suppose to feel it if we see an ugly partner? Everyone is ugly actually. And... I want to play as a my rl sex - where's a male character?! I don't want to wear a blouse))\nWork on it and that will be a forever playable application! Thank you!\n\nHelpful | 42", "cprachJan 5 at 10:41 AM\nAwesome, even for a bad dancer\n\nIve never been a fan of dancing games. Not a great dancer, and they always feel so mechanical. But this game is so immersive. You kind of forget its a game and just enjoy the dancing. Its also great exercise so when I work out at home I use this for some cardio. (And as far as good dancers go - my in-laws are Colombian, all good dancers, and they love it.)\n\nHelpful | 3", "sarikatsDec 29 at 3:45 PM\nLove Love Love\n\nWow. What a great game. Im still too embarrassed to show my dance moves to anyone so I play this one alone. I love that I can go into the studio to learn the dance moves. Especially love the feature that allows you to slow down the moves to really get it right.\n\nThe fitness feature is great too. You can add your height and weight. It will track your calories.\n\nI cant wait to perfect my moves to play with others when Im ready.\n\nHelpful | 4", "KarlDrinkwaterDec 28 at 5:09 AM\nShame about the frustrations\n\nI had really looked forward to this. I used to be a fan of the Rock Band games until Harmonix gave up on the direction they'd been moving in (we hooked up via dongles so the game gave us tabs and lyrics, but we played real guitars and midi drums - there was so much potential to teach real music with no need for useless plastic controllers, but Harmonix pulled back from that).\n\nPros:\n- DC is colourful.\n- It gets you moving and has music.\n- Non-violent.\n- It's obvious that a lot of thought has gone into some areas.\n\nCons:\n- I only recognised three of the songs in the playlist. Of course, I know about the issues with licensing and how greedy the music industry is, and it doesn't mean other songs won't grow on me.\n- The people look good, but have ridiculously tiny pin feet. That distracts me as I look around. It's a stylistic choice but just doesn't work.\n- So far I have played three times, and each time I have had to restart with the tutorial and everything reset. That sounds like a buggy implementation of saves. One of the other reviews implied you have to give the game special permissions - which is definitely a bug, since all my other Quest games save progress with no problem and no special permissions needed. It is maybe tied to the fact that when I first played, the game asked for permission to do all sorts of stuff, accessing my files and so on, but without saying why. I don't agree with that kind of broad permission, which is often tied to tracking and spying in apps. If there was a real reason that benefits the player, then the message should make that clear, and explain what happens if you allow, and what happens if you deny.\n- I play single player offline games only. I don't want my games sharing data with servers. But DC gives you no option. It displays scores from total strangers I have no interest in. Worse, It presumably shares my name and scores with other players (and it's my real name). This should only happen with explicit player permission.\n\nHelpful | 17", "jc3113Mar 5 at 2:43 AM\nGreat game\n\nIts really fun, and wish to have more songs and support hand tracking.\n\nHelpful | 1", "aubreyclub4 days ago\nneeds an update\n\nLoved the game so much, I hope we get an update soon as it's getting kinda stale to play\n\nHelpful | 0", "jonathan.zisserDec 29 at 9:33 AM\nAlmost perfect - some tracking issues\n\nI've played dance central for Xbox, and this game is a nearly perfect transition to the VR platform. There are some occasional hand tracking issues when crossing them in front of the visor, but it's a minor inconvenience in what is otherwise a great dancing game.\n\nHelpful | 2", "SaiTakeshiJan 19 at 12:42 PM\nLove it!!!\n\nThis gam had me amazed and still does after playing many hours on it!!! My family was amazed as well once tried it out, and it is a pure blast!! I hope to see more songs coming out in the future.\n\nHelpful | 2", "Sonictheboss8472Nov 9 at 3:52 AM\nCant believe Im saying this\n\nI cannot believe Im saying this but this is literally the games from the xbox360 reincarnated into a AAA VR experience and it doesnt miss a beat. Down from the studio down to the multiplayer. This game is amazing and I love playing my favorite tunes and dancing to my hearts content.\n\nHelpful | 21", "OstisomaDec 3 at 10:28 PM\nImmersive and fun experience\n\nUpdate: This game is a blast. It might be difficult at first because you can't shift your focus in VR so it's hard to tell how close/far the guide orb is relative to the dancer's hand. Practice more and eventually you will know the correct depth. I was very motivated to practice to unlock the stories with characters. Their replies always make me burst out laughing. Hope there will be more contents (songs, stories, avatar customizations or even better, DLCs or sequel where we can bring back the old Dance Central characters in new visual). I don't like the existing songs but the dancing part is fun enough that I forget about it.\n\nOne thing to add is that video recording will not work in this game. I really hope they can add it but I can't blame them. The game is already draining the battery so fast.\n\nAlso for some people wondering about gender setting: there's no explicit gender setting, you just change the shape of your body / face in wardrobe.\n\nUpdate: I probably have seen all the chats? Will there be update that adds more side stories and songs?\n\nHelpful | 9", "CameroniRavioliApr 27 at 2:11 PM\nGreat lockdown exercise\n\nI originally brought this for my mother because this is the only excierse game she would play but I actually really enjoy it seems to be well worth the 20 pound price and would recommend\n\nHelpful | 0", "ddominiqueDec 31 at 12:40 AM\nSo much more than what I was expecting!\n\nThis game has humor, heart, a story, and is actually pretty doable for somebody who is in crappy shape. You can track your calories and make virtual friends within the world. The time flies and the music is so nostalgic, it hurts. Thanks for a great game.\n\nHelpful | 1", "danediniJan 5 at 10:12 AM\nFrom a dance instructor\n\nUnfortunately I have to compare this my previous experience with the Xbox Kinect version which tracts your entire body. If youre looking for a whole body dance game this isnt it. Additionally Im not sure how graphics have gone backwards since the Xbox 360 version. I however did like the ability to travel between locations and the orbs were very helpful in seeing how the game is tracking your movement. Decent game although will be asking for a refund.\n\nHelpful | 3", "junnyor18Oct 27 at 12:33 PM\nLets Dance !\n\nOk, I love Dance Central. I own Dance Central 1,2,3 for Xbox 360 and Dance Central Spotlight for XboxOne. Plus Im really good . So I was skeptical when this game was released. I was not sure how a dance game will work on VR. I thought it was a recipe for accident. Boy I was wrong. Its amazing and fun. Dont expect those complicated dance routines from the console versions. It tailored for VR. But it is pure Dance Central. You go to a club, explore different dance floors, you even have a closet with different clothes! The music is a blast, plus you can buy more outfits and accessories. This game is a must!\n\nHelpful | 11", "luolin61Dec 26 at 4:24 PM\nDancing Machine\n\nOk, maybe Im not but Im trying to get my 80s step back. I like the music. Nice to have original music that the Devs have to pay rights for. This is what I call a professional app. This is put together well.\n\nHelpful | 1", "EmotiveMaNov 9 at 2:58 PM\nBest Dance Game Ever\n\nSo, I absolutely love this VR Game! I never would have guessed that I would find so much enjoyment in learning dance moves and interacting with NPCs! And let me tell you, I love the NPCs and the stories behind them. Its a very excellent game that helps you stay fit and have fun!\n\nHelpful | 5", "thedonrlJan 17 at 11:19 AM\nLooks and works great\n\nSo I hate dancing games but dance central vr is awesome. Great way to trick ones self into exercise!\n\nHelpful | 0", "MilezPerHourDec 14 at 8:29 AM\nGood dance some annoyances\n\nTh is might be a good game for the new hand tracking. Its fun and its short Cummings arent really its fault. I think most of the dance or sports games need tracking of the feet to make it more immersive. Also I stuck at dancing but get great scores so maybe its a little too easy lol.\n\nHelpful | 8", "DeepMellowJun 18 at 9:48 PM\nBoring and lame bad graphics\n\nWay overpriced limited music. Terrible unrealistic gameplay. Nintendo 64 games look and play better than this.\n\nHelpful | 1", "julia.sixsmithJan 6 at 12:41 PM\nGreat fun.\n\nGreat to get you moving when you have a sitting down job! \n\nHelpful | 1", "toomuchninaJan 7 at 3:25 PM\nIts cool\n\nI like the game but I would like more songs and more variety reggae randb rap country rock and roll\n\nHelpful | 0", "ShaniaMBPNov 30 at 2:10 AM\nWow!\n\nNever thought I'd be having so much fun in a dancing game. As someone who has no rhythm and absolutely no funk, this game is non-stop fun. The atmosphere is great, the characters are even interesting, and the music isn't bad either. The controls are simple but not boring, and you really can just get lost in this game for hours. My one and only gripe would be that the music selection can feel a little short, especially when it costs quite a bit to unlock even a single new song. Besides that, this is easily one of my favourite games on quest. 9/10!\n\nHelpful | 3", "lisalisax2Dec 12 at 12:09 PM\nFun but....\n\nI enjoy much of the game but my only two negatives: not enough songs and the few in game purchase options are rather pricey, considering the total cost of the game.\n\nHelpful | 1", "SqueakinglyJenDec 27 at 4:48 PM\nLove it\n\nFun and charming - good exercise. Could do with a much larger library of songs though.\n\nHelpful | 1", "dingofoxvrfoxJan 30 at 11:42 AM\nTake what was good and wreck it\n\nOk Im sorry but this version is so stripped down that its not enjoyable and no dlc in the oculus quest store for it no thanks\n\nHelpful | 1\nDeveloper ResponseMar 11 at 12:09 PM\n\nHello dingofoxvrfox, sorry to hear you're not enjoying the game. The DLC is actually available for purchase on the in-game DLC store app. Check out your in-game phone for more.", "Arthands_VROct 18 at 1:12 AM\nGame selection is great, fun workout\n\nThe game is one of the underrated gems imo. There's a sizeable amount of songs for you to dance to, and the developers has been regularly updating the game with new songs and features. You can befriend the dancers and they will constantly text with you. Do it enough and you can unlock items. This is rather great as it provides some interesting backstories to the character themselves. I recommend it\n\nHelpful | 5", "chrystalgamingJan 3 at 8:32 PM\nAmazing game\n\nI thought beat saber was good with music but dance club blowed it out of the water.\n\nHelpful | 0", "jeffrey.leungSep 28, 2019 at 9:15 AM\nImmersive dancing experience\n\nI have played Just Dance daily for a while ago. Dance Central VR really shines for its immersive experience. Although Just Dance offer a much larger song library by a subscription, now I simply cannot go back because Dance Central VR make you feel like you are dancing in a club with the character in front of you, which is much much more enjoyable.\n\nThe multiplayer experience is also area I want to bring out. Although it seems that the online active population is quite low by my experience, I once joined a session with others and found that was mote fun that I expected. I hope the developer can let us to play as usual in the lounge while wait for others to join, which encourage more active online session for the online part to grow.\n\nIf you like dancing game, this is a must have.\n\nHelpful | 26", "SamuelRowanNov 16 at 4:53 AM\nAn extremely fun workout with great UX\n\nThis may very well become my most loved game in VR. The gameplay is extremely fun, the navigation of menus is shockingly intuitive, the soundtrack is great, the graphics are wonderful, the NPCs are delightful and, while playing it there is a chance that you might actually learn how to dance! The only real negative is that I wish there were more songs than the 35ish that are on there. I suspect that will be taken care of through DLC down the line. That being said; while they don't have quantity they very much have quality in their song selection.\n\nHelpful | 1", "marie.watkins.902Dec 30 at 2:28 AM\n\nGreat fun game,especially for new people to vr\n\nHelpful | 0", "Laura223_DCDec 25 at 3:14 AM\nTotally worth it!!!\n\nI've been playing for 2 days and this game is really amazing, the tracking works good, love the practice mode.\n\nHelpful | 0", "Relaxing3Dec 30 at 4:57 PM\n\nThis is great fun, I just want to dance the night away. Well worth the money.\n\nHelpful | 0", "CyberPeteDec 25 at 11:51 AM\nIf you like dancing and VR ...\n\n... this is a must-have. I hope revenues allow developers to invest much more work into this application.\n\nHelpful | 0", "mrP00Nt1m3Apr 4 at 2:51 PM\nWonderful game\n\nGreat game if you're into rhythm games and is an awesome work out with awesome music!\n\nHelpful | 0", "Aaronb3434Dec 3 at 9:53 PM\nGreat\n\nIm not too much of a dancer but this app is pretty awesome. heres a suggestion if possible can users b able to upload audio from sd/file manager or a pc? maybe a special room in the club could b added for uploading audio similar to the lounge mp. while hanging out with the characters or dancing. I highly recommend it for a great app like this.\n\nHelpful | 8", "xfinnSep 19, 2019 at 6:47 PM\nAmazing VR game\n\nIm pretty shy about dancing in public but once you out on the headset you forget about your surroundings and just get immersed in that world. The music selection is awesome and I found some songs that I would not have listen to that I enjoy. The only issue I have is that the game stutters and sometimes takes me to the home screen but other then that I think this is a must have game for any VR owner.\n\nHelpful | 8", "K1_J0hnD03Apr 11 at 12:39 PM\nCovid19 must have\n\nFor those who likes to party a lot \n\nHelpful | 0", "TehEpicGrimmyNov 2 at 6:26 PM\nDance with lite rog elements\n\nIm honestly shocked I got so into this game as I have such bad rhythm on instruments. Normally Id avoid this as I am more attracted to things like orbusvr or shooters on vr but Im simply eager to get back to the dance after the quest charges. So far this game is worth every dollar.\n\nHelpful | 3", "WonderDingoOct 21 at 8:54 PM\nNightclubbing, we're nightclubbing\n\nA lot of fun, and much more sensitive than the previous motion sensor dancing games I've played on the Wii and Kinect. The game has a really decent library of songs for the price, including some mega-hits, which is always nice. Unlike Beat Saber, it has multiplayer as well! It's also being regularly updated to compete with other rhythm games, which is great! It'd be even better with custom tracks though. Just saying devs :)\n\nHelpful | 8", "Jetty9086Nov 16 at 4:50 AM\nDance Central\n\nI suck at dancing but my wife loves this game. It's a pretty good workout, too! The tracklist could be better, some classic 80s-00s dance hits would be great.\n\nHelpful | 4", "natessinApr 3 at 2:25 AM\nNot a huge fan of dancing games\n\nBut this is surprisingly good\n\nHelpful | 0", "mwcolburnOct 25 at 11:47 AM\nSurprised and delighted!\n\nI've tried different dance programs before, but this one has got to be the best I've ever played. Having fully-realized 3D dancers in front of me to show me the right way to move is amazing and very useful.\n\nI will mention that the comment I have seen before about the phone interface with in the game being locked was something I could not overcome with any button push whatsoever. I don't know if I'm not sure if I'm just uninformed or if there's a problem, but it is an annoyance as a reboot of the game was needed.\n\nBut you can rest assured, I'm going to be playing this game until I've mastered every single dance. It's a lot of fun! Kudos to the game designers!\n\nHelpful | 3", "Harbers4Dec 27 at 5:37 PM\nNot in library\n\nDoes not show up in my library on Quest headset at all\nHave to start all the time from the app on my iPad\nPain in the butt\n\nHelpful | 0", "darramanDec 4 at 9:22 PM\nGender settings\n\nJust downloaded the game and been trying to change the gender in this game. The avatar is female. Wheres the setting to change the male?\n\nHelpful | 1\nDeveloper ResponseDec 2 at 8:09 AM\n\nHello darraman, You can change the way your avatar looks including body type, face shape, hair, and more by visiting the Wardrobe from your in-game phone and using the settings that are displayed on the mirror.", "fordasinDec 25 at 4:14 AM\nHeight Problem\n\nI adjust height at the first time I played.\n\nOther people in my family play this game how can I change calibration.\n\nHelpful | 3\nDeveloper ResponseJan 2 at 12:49 PM\n\nHi tptech123! The best way to change height calibration while in-game would be to press in on the right thumbstick as you do when you start up the game. This will automatically adjust the height. Hope this helps!", "IlliniumOct 25 at 6:29 PM\nFun!\n\nThey give you alot of popular songs to dance to. It tracks my movements flawlessly and is superbly fun. If you actually do the real dance with the legs as well it's quite the workout and adds to how fun the game is.\n\nHelpful | 4", "steven.brandtDec 7 at 1:24 PM\nFun\n\nMakes you feel like you're dancing at a club\n\nHelpful | 0", "gvozdik.sanyaNov 3 at 12:13 AM\nInterface could be better\n\nI find it hard to choose songs, need a preview like Beat Saber does. Also sometimes buggy and wouldn't let me stop the song - the stop button on the phone just won't work.\nTutorial seem to start every time as well which is annoying that you can't go to song selection straight. Maybe has potential but these things just make me play something else.\n\nHelpful | 4\nDeveloper ResponseNov 6 at 7:36 AM\n\nHi gvozdik.sanya! To help address the issues you're encountering, could you please confirm that you have given Dance Central the proper permissions for your headset? In order to save data, the game needs permission to write to the disk. You can check permissions by going to your Library > selecting the 3 dot menu next to the name of the game > go into edit permissions. If this doesn't solve your issue of having the re-do the tutorial, please reach out to us directly and we'll help get you sorted! support.harmonixmusic.com", "emviedSep 28, 2019 at 6:31 PM\nGreat workout\n\nIf your skipping the club this weekend, this is definitely a great alternative! I sweat more than I do on any night out. I would love a story aspect to this game. Add more to the club closing aspect, maybe dance your way to the top nightclub and fame! Definitely excited for this series overall.\n\nHelpful | 7", "hooblydooblySep 12, 2019 at 3:49 PM\nBetter than I could possibly imagine!\n\nThis game has been very fun for me. I dont dance normally and definitely wouldnt do it in front of other people. From the funny banter the characters share with you, to the great selection of songs to choose from this was well worth the money. I have loved getting to experience a club environment, and getting to know all the characters.\n\nHelpful | 16", "kingcodeNov 14 at 9:34 AM\nBrilliant dance game\n\nWhy shake your hands at bubbles like other dancing games when you can dance with real dance moves and a dance partner!\n\nHelpful | 1", "EdigsSep 2, 2019 at 6:46 AM\nGreat game\n\nBuying the game I kind of expected simple dance simulator- choose a character in a menu and dance your brains out. Instead, I got full on dance club experience, along with interesting characters, my very own vr phone and loads of sms messages. Almost a small adventure game in-between dancing.\nWhat surprised me the most was how lively characters feel. There's a whole range of personalities and it's all supported with great animations. Seriously, some of the best animated characters I saw on Quest yet. It helps the style is pleasing to the eye as well.\n\nDancing is great. Or at least as great as current VR tech allows. Quest doesn't support whole body tracking and that means all the game care about is hands moving. It's still good enough and you will find yourself replicating whole body choreography to catch the rhythm anyway. Still, once we'll have whole body tracking, games like this will be pretty much perfect.\n\nMy biggest complaint is about character's scale. I'm 1,84 meters tall and pretty much every character in game is bigger than me. It feels a bit weird and I would prefer it more if some characters would be smaller.\n\nOther than that, I can wholeheartedly recommend the game to all who like dancing.\n\nHelpful | 5", "Lelans01May 23, 2019 at 1:41 AM\nGreat game hampered by bad interface\n\nGame is awesome, but the phone interface is a genocide. It is hard to read, and sometimes it just says \"phone locked\" for no reason and the only option is to reboot the game. Game also forces me to do tutorial on every boot up without option to skip. 5 stars gameplay 1 star interface.\n\nHelpful | 94\nDeveloper ResponseJun 13, 2019 at 11:49 AM\n\nHi Lelans01, Update to the below response: We have pushed out an update that includes a larger, easier-to-read phone interface. Let us know if this helps! To help address the issues you're encountering, could you please confirm that you have given the Dance Central game the proper permissions for your headset? In order to save data, the game needs permission to write to the disk. You can check permissions by going to the Library, select the 3 dot menu next to the name of the game, and go into edit permissions. If this doesn't solve your issue of having the re-do the tutorial, please reach out to us directly and we'll help get you sorted! To address the game being hard to read, could you try adjusting the IPD settings using the physical slider on the bottom-left side of the headset while wearing it? Additionally, try adjusting the vertical alignment and placement of the headset on your head by physically moving it, and tightening it when it looks the clearest for you. If you are still running into issues, you can reach out to us directly through our support portal at http://support.harmonixmusic.com.", "SpiltInk_Nov 26 at 9:45 PM\nGreat game\n\nA super fun game\n\nHelpful | 0", "tanner.vegetaOct 3 at 12:55 PM\nNo English subtitle\n\nI am a deaf, I can feel music but not heard. But I cant to understand what an avatars talk. I wish have a English subtitle in.\n\nHelpful | 32", "NouhyxOct 24 at 3:40 PM\nI love this\n\nLove the interaction w/ the characters ! This game makes me wanna dance all day long ! Lot of choices of songs.\n\nHelpful | 4", "LingshanAug 30, 2019 at 11:34 AM\nBetter with more real player intetaction\n\nIt's an absolutely fantastic VR dancing experience , but most time you are just dancing with NPCs. It's nice to have them around though , just would feel much more immersive and exciting if you can see how other real players dancing in the room at the same time, or even talk with them. Freestyle dancing room for social purpose would be another good idea. Look forward to seeing more updates, nice work guys !\n\nHelpful | 6", "Cowboy1947Oct 23 at 1:27 PM\nFun way to get off the couch!\n\nThere is a little word to explore here. And who knows, maybe you wont feel so stupid on the real life dance floor!\n\nHelpful | 1", "scintillaaJul 18, 2019 at 6:25 PM\nIts an ok workout. But the music sucks\n\nSo with only 32 songs the game is a little boring after a few weeks. And Im not a huge pop fan so frankly, these songs are kind of grating; with a few exceptions. Im hoping theyre going to come out with some better tracks.\n\nThis is the first time Ive played this game, and I therefore cant really compare it to the other versions\n\nHelpful | 17", "BlondeNurseOct 3 at 12:15 PM\nIs there a way to change your avatar\n\nI love the game! Its lots of fun but would like to customize my avatar. Will this be a feature coming? Right now it only allows you to change clothes,\n\nHelpful | 2\nDeveloper ResponseOct 4 at 11:22 AM\n\nHi BlondeNurse! We're so happy to hear you're loving the game. If you travel to the wardrobe from your in-game phone, you can customize more than just your avatar's clothes! Check out the mirror, you can choose your hair style, hair color, body type, and more. Hope this helps!", "KB_McShortyNov 4 at 5:31 PM\nLove it!\n\nDance making exercise fun again!\n\nHelpful | 1", "cb83Oct 26 at 9:23 PM\nLove it!\n\nOne of my favs, got my fam and friends to play, and they love it as well!\n\nHelpful | 1", "WabznasmSep 2, 2019 at 8:36 PM\nGreat game, great hangout\n\nThis is a fantastic dance game with a lot of fun songs that can definitely make you sweat if you put the effort in. It has a basic and an advanced mode you can switch between depending on how energetic youre feeling. The story line and character interaction is endearing, and the feeling of being in a club is impressive. A fabulous bonus is you can set up a lounge where your irl friends (and anyone else) can hang out with you, laughing and dancing. This is what VR is all about.\n\nHelpful | 5", "Blazer_420May 5 at 2:35 PM\nReally is a good game\n\nAll I can say its really good\n\nHelpful | 1", "kelly309Oct 23 at 11:44 AM\nBest club ever\n\nI love this game an if u love to dance this game is for u\n\nHelpful | 1", "alvinmollieOct 16 at 4:30 PM\nDance Central\n\nA great game but the phone tap gives problems and can be frustrating as it doesnt always work.\n\nHelpful | 0", "NovelMakerAug 25, 2019 at 8:10 AM\nFantastic\n\nCan't think of any complaints. The few times in my life I ever danced in front of my boyfriend, he never seemed impressed. But when I dance while using this app, he gives me huge compliments, says my mom would be very impressed to see me and that she'd see she has a dancer daughter. I especially love the studio, where I can rehearse moves and slow them down and analyze them microscopically.\n\nHelpful | 7", "wgdSep 13, 2019 at 8:14 AM\n\nThis app is fun for a while but my enjoyment decreased after a couple of weeks. I would like to see more variation in the venues and available dance partners.\n\nHelpful | 4", "xRyan2008Oct 20 at 5:41 PM\nGood\n\nGood\n\nHelpful | 1", "jamssweetstuffOct 15 at 9:08 PM\nGreat exercise\n\nLove this game but would like if there were better graphics and more of a clear story line but overall its a great workout. The load time is a bit slow I find.\n\nHelpful | 0", "320x200Aug 3, 2019 at 5:40 PM\nGreat game but the world scale is wonky\n\nThis game is great and I want to play it but the world scale is so distracting... Every character in the game is super tall. There's nobody in this game world under 6' and you can look around at any point and see a bunch of people who must be over 7' tall. Are all the developers basketball players from the amazon?\nIt sounds like a minor thing but the entire game is about dancing with the NPCs and it's very immersion breaking to be walking around as a person of average height and be completely dwarfed by everybody. Game needs a \"NPC height scale\" option or something.\n\nUpdate: I've confirmed the guardian floor height is correct and done the in-game calibration many times but it does not change the game scale. The player avatar model scales to the new height but the game scale is unchanged. You can reproduce this by squatting during calibration to set a significantly lower height. When you stand up straight the player's avatar will be small and their feet too short to touch the ground, but the world and all the NPCs are have not changed in size and are still gigantic.\n\nUpdate 2: I've tried the Harmonix discord, updating the review and submitting a support ticket. It's nice to have the developer comment on the review and offer to help but it's been weeks and no reply. Not sure how else I'm supposed to follow up here...\n\nHelpful | 13", "TheSwirlingBrainJul 24, 2019 at 9:53 PM\nThis game is OK\n\nIt's sort of fun to copy a dance the computer is doing. I come back to this game and play it now and then but after you've done it a few times, it's just more of the same. It does seem that perhaps you could learn to dance by using this game but I'm not that into it to do that. It is a mild workout and that's why I wanted it more for the exercise which it does to that. I'd say I'm happy with the purchase and I'm enjoying it, but it's not a must buy for me.\n\nHelpful | 6", "bayonetta105Jul 30, 2019 at 10:15 PM\nSuper fun workout\n\nThis is seriously the best dancing game I've played. The VR aspect of mimicking dancer movements takes it to a whole new level, since it motivates me to copy the whole body movement instead of faking it (like playing on the couch). Being able to text characters in game also makes the world seem real. One suggestion is to have some long term open lounges for meeting people in a dance-off!\n\nHelpful | 7", "whitezombieOct 2 at 4:13 AM\nWow!\n\nWorth every penny!\n\nHelpful | 0", "Sydney_RobsterJun 27, 2019 at 4:06 AM\nDance Central is even better in VR\n\nI luv Dance Central Spotlight on Xbox. This version takes the core dance experience and improves in every aspect. The characters have depth now that the speak when the greet you on the dance floor, leave voice messages and texts. The studio is now perfect for learning. But best of all, you really feel like you are in a club, and the characters have physical presence when standing in front of you. IMO the track listings are better, and its seemless between finishing a song you picked, and the 'DJs' queing up the next track (just like in a club). This game is a unique underated gem in the shadow of Beat Sabre. Hope more ppl will discover it once the BS sun sets.\n\nHelpful | 6", "Lemon.ytSep 28, 2019 at 9:08 PM\n\nI love it\n\nHelpful | 0", "Illusi0nalMay 23, 2019 at 8:35 AM\nInterface is Fine\n\nI don't know why people are complaining about the interface; perhaps you should wear glasses. I can see it just fine. Adjust your IPD until text is clear. I think the phone interface gives the game charm and makes it feel more authentic.. like you're really hanging in a club. I'd much prefer than than some generic UI that pops up which can break immersion.\n\nDance Central is great. It really does feel like you're dancing in a night club. The characters are fun and interesting, and the movement tracking I've found to be very accurate. Also love that there's a leaderboard you can keep up with and try to move up.\n\nGraphics are good, gameplay is smooth, voice acting is solid. I simply love that I have to take out my phone to do stuff with; it gives it more charm and actually feels like you're saving contacts and friends.\n\nGreat job, devs! And thank you for also supporting cross-buy.\n\nHelpful | 34", "vanfanelMay 21, 2019 at 8:32 PM\nGo clubbing any time of day!\n\nThe atmosphere in this game is top notch! It really makes you want to stick around and dance the night away! Add the interactions with all the characters and this really is a hidden gem in the quest launch lineup.\n\nHelpful | 152", "Whisky_shusukyJul 8, 2019 at 2:23 AM\nExcellent Dance Game!\n\nWhat an awesome! I have never tried dancing before DC. However, I m crazy into Dancing because of DC. Dancing that matches with VR Experience give us great time!\nChallenging system is also good. By the challenging, We can compete with friends. And Id like to request chat system with friends for encourage each other, If it is possible.\nI love DC! Please add next Track as soon as possible!\n\nHelpful | 5", "MakMarAug 8, 2019 at 9:08 AM\nProblem fixed - can be fun workout\n\nI purchased the game a while ago, but wasn't loading correctly. Advice from developers fixed it. Game is fantastic, a few more popular songs would be great ;-) Fun workout.\n\nHelpful | 2\nDeveloper ResponseJul 31, 2019 at 2:11 PM\n\nHi MakMar! We're sorry to hear that you're experiencing this. Please try to uninstall and reinstall the game again to see if that works. If not, please submit a ticket and we will get back to you: support.harmonixmusic.com", "jujellyAug 16, 2019 at 6:51 AM\nmy favorite game.\n\ni really think this game is best game. my favorite game is bestsaber and this game. i want many more music. :'-(\n\nHelpful | 3", "Tummie555Jul 28, 2019 at 1:24 PM\nSecretly dancing my butt off\n\nDancing is scientifically proven to reward your body with happiness hormones. In other words: IT FEELS GOOD! Nice selection of songs. Quite a lot actually. Definitely one of the higher quality games released on quest.\n\nHelpful | 5", "happy.astridJun 30, 2019 at 9:36 PM\nNew to quest\n\nI just got it today and love it. It is a great way to keep in shape. I got the quest for my teen and decided to give it a shot and I love it . This dance game is so much fun. Had I known VR was so much fun, I could have gotten this a long time ago. Thank you Oculus. Hope you as more cardio games for this old mama.\n\nHelpful | 5", "UrGamingTechieMay 23, 2019 at 6:13 AM\nThe best version of dance central period\n\nThis game really caught me by surprise. What I thought would just be another regular dance central game but in be, turned into one of my favorite social games on quest or rift platform. The environment, social lounge, awesome interactions and mini games with others, really sets it apart. I did a full video review on my YouTube, check it out if interested to see more https://m.youtube.com/watch?v=JKFx4bx2KJg\n\nHelpful | 24", "philg7onr123Jun 30, 2019 at 5:58 AM\nAmazing night club experience\n\nI love this game, I feel totally inside this VR experience. The night club atmosphere really takes over, I completely lose track of time when I play this. To me the dancing is not the most important thing, it's the feeling of being amongst virtual people that you can interact with. Totally absorbing, this is what VR is all about.\n\nHelpful | 5", "colourpixelsJun 22, 2019 at 4:11 AM\nTonne of fun\n\nFun to dance and learn a few moves. Not sure why people can't read the phone, sure is not crystal clear, but easy enough to read. Reasonable selection of music with a few classics like pump up the jam for us 90's clubbers. Hopefully there will be more songs as dlc.\n\nHelpful | 3", "Defiant2kvrJun 21, 2019 at 4:57 PM\nVery Disappointed\n\nI have played all of the Dance Central games and I am disappointed to say that this is the worst one by far. I cannot believe how bad the graphics are on the main dancers. In addition, the playlist is the worst they have ever done and the lack of dances is pretty unforgivable compared to past games. I can only hope they update things to make it more worth the money.\n\nHelpful | 7", "CaptainWoodrowJun 21, 2019 at 2:03 PM\nDefinitely one of the best!\n\nIt's a really fun game that I play for hours at a time, and when I decide to quit, I end up playing just one more song(and then 12 more). I especially loved meeting the developers in \"Dance with the Devs.\" It's been a fun experience that will last for years to come, as I'm sure more songs will be added. Even though my time at the \"Dance with the Devs\" was short, I enjoyed every bit of it! Thanks for today! I hope there will be more! () (One thing I would like is the ability to message friends in-game via the phone.)\n\nHelpful | 3", "BossbeastJun 6, 2019 at 11:21 PM\nNot usually a dancing game fan\n\nBut took a chance on this and had a great time playing multiplayer until 1am . Its just such good fun. Any chance of more songs in the future? Good selection already but always nice to have more.\n\nHelpful | 6", "avardarMay 31, 2019 at 10:34 AM\nLots of fun / Bad UI\n\nI had great fun, the game is responsive and comfortable with fair amount of songs to dance with. Gives good workout too! The only reason I cannot give a 5 is the design choice to go for a phone interface. I believe it is there to make the experience feel more social and real but the phone screen is barely readable and the touch interface is not good either.\n\nHelpful | 6\nDeveloper ResponseJun 13, 2019 at 11:36 AM\n\nHi Avardar! We just released an update that includes a larger, easier-to-read phone interface. Let us know if this makes a difference in your gameplay experience.", "b-twiceMay 28, 2019 at 7:13 AM\nFun and challenging\n\nI am surprised at how hard it is to be a good dancer! I am getting the hang of it though and this game is a lot of fun. Learning individual moves in The Studio is a really cool way to learn. Love this game.\n\nHelpful | 4", "ArinarMay 25, 2019 at 3:27 AM\n\nI really like the idea, as I am a bad dancer, finally I can learn something new. Text on the virtual phone is not clear though.\n\nHelpful | 11\nDeveloper ResponseJun 13, 2019 at 11:39 AM\n\nHello Arinar! We just released an update that includes a larger, easier-to-read phone interface. Let us know if this makes a difference!", "MIMIVR2016Jun 13, 2019 at 12:27 PM\nThis game should said:booze required\n\nHonestly people. You have to get a booze in front of the table and it's a awesome multiplier for the game. Just try it. You know quest has the see through drink compability. Just drink after each dance.\nThe problem : guys, we need a step by step tutorial section. You know we can get serious sometimes. Even under the influence of alcohol. Or weed. Or whatever the f**k you have in your cabinet. It's a f*cking night club for god sake!!!!\n\nHelpful | 3", "arthur2089May 24, 2019 at 1:17 PM\nFan since Kinect\n\nThis game brings back nostalgia, as I was a big fan of this game back in the Xbox 360 days. I spent many hours playing that with my ex, and this is the best version. I recommend playing on the pro difficulty, as the dances seem more natural and goes with the song. Its hard for me to spot the difference between the Rift S and the Quest, as they did a great job porting it. Id argue its even better on the Quest since having no wires gives you a better sense of freedom. Although the cellphone can be a little blurry at times. One of the best games available and it will be a hit at family/friend events.\n\nHelpful | 11\nDeveloper ResponseJun 13, 2019 at 11:40 AM\n\nHi arthur2089! Sorry to hear that you're experiencing blurriness with the cellphone. We just pushed out an update that makes the cellphone larger and easier to read. Let us know if this helps!", "SubMonkeyJun 6, 2019 at 9:22 AM\nThat UI tho..\n\nThe graphics are fun and the game itself is great but Ive had some issues with the phone interface. For some reason it is always pretty much behind me. Its hard to read and select, would much rather a menu button or screen selection to the side. I get its supposed to give you that in the club feel but geez, its just awful.\n\nHelpful | 0\nDeveloper ResponseJun 13, 2019 at 11:21 AM\n\nHi SubMonkey! We just pushed out an update that includes a larger, easier-to-read phone interface. Let us know if this makes a difference in your gameplay experience.", "xman7Jul 2, 2019 at 6:34 AM\nFun and aerobic\n\nWant to get some good aerobic exercise then you need to get this game beat saber and Apollo Creed boxing games. And you will never ever how so much fun burning calories and getting in shape\n\nHelpful | 2", "JustosJun 22, 2019 at 2:39 PM\nLots of good songs\n\nWas surprised to see how many songs there are. I had a lot of fun with this and I can see myself picking it up every once in a while.\n\nHelpful | 2", "Soulsurfer83Jun 4, 2019 at 6:30 AM\nGreat fun, great exerciss\n\nIve been a long time fan of dance central games, and this one lived up to my expectations. Great visuals, awesome song selection, and such a fun workout. Ive not had any issues other players have with reading the interface on the games cell phone. I actually find it fun to navigate the interface using the phone...and just as much fun to throw the phone all over the club.\n\nHelpful | 4", "LamestGamrJun 14, 2019 at 11:39 AM\nMy Family Loves It!\n\nWe have two Quests and love doing multiplayer dance competitions. The single player is also lots of fun with plenty of songs to enjoy. BTW, you do multiplayer from the locations panel and select the Lounge MP.\n\nHelpful | 2", "RRSarahLynnMay 23, 2019 at 11:52 PM\nNew and Nostalgic\n\nCharacters remind me of my Kinect days, but honestly thats the only thing that feels old. Club experience is completely immersive. Great song and customization options. Honestly, its the only game Ive gotten so far for my quest that doesnt feel half-baked.\n\nHelpful | 14", "ForceFieldXRMay 29, 2019 at 11:04 AM\nStraight port really feels old\n\nI was really excited to get dance central in Vr because a long time ago it was a cutting edge dance so some game. This port fails on all levels -it doesnt use vr at all and like before, you cannot see yourself thus you cannot see if you match the instructor. There were so many opportunities to make this a good game. Only gave it 2 stars because it is exactly like the old version which i liked.\n\nHelpful | 8\nDeveloper ResponseJun 4, 2019 at 10:44 AM\n\nHey ForceFieldXR! Thank you for your review. Dance Central has some features available that can help you better line up your movements with the dancer's in the virtual space. Try turning on Guide Orbs in the Club, Studio and Lounge and Target Trails while practicing in the Studio! You can turn Guide Orbs and Target Trails on in the Settings. We hope this helps you enjoy your experience further.", "Lola.RenoirJun 9, 2019 at 3:24 PM\nGreat game\n\nHeight Calibration doesnt work properly, Im floating in mirror and seeing my own shoulder while dancing.\n\nupdate: appears to be oculus's problem. Weirdly all other games appears ok. After trying everything I reset the headset and reinstalled everything, everything works perfectly now:)\n\nGreat Game!\n\nHelpful | 4\nDeveloper ResponseJun 4, 2019 at 10:46 AM\n\nHi Lola.Renoir, Thanks for your review. It seems you may be having issues with floor calibration. We recommend you try re-calibrating tracking by setting the floor. You can do this by going to Settings > Guardian System in Oculus home. Once you've re-calibrated tracking, try calibrating again in the game by looking straight ahead or slightly up while pressing down on the right thumbstick. We hope this helps improve your experience playing Dance Central!", "JordanMJ2000May 27, 2019 at 2:28 PM\nFantastic Game, Add Me For Multiplayer!!\n\nSuch A Great Game On The Oculus Quest, I Wish That When Playing Multiplayer In The Club, You Could Turn With The Toggle Stick Smoothly. But That Didnt Make Me Wanna Make This Game A 4 Star. Its Quite Expensive I Do Admit, They Should Bring The Price Down Too 14.99-16.99.\n\nOtherwise On Multiplayer Mode Add Me My Oculus User Is JordanMJ2000 Thanks Guys\n\nHelpful | 3\nDeveloper ResponseJun 4, 2019 at 10:45 AM\n\nHi JordanMJ2000! We do offer an option for smooth turning! You can adjust this by going to Settings > Lounge Settings. We're happy to hear you're enjoying the game!", "JordzzzMay 26, 2019 at 4:49 AM\nTo the developers...\n\nI can't put into words how much I love this game! Im a fan of JD and any rhythm/ dance game but this is next level stuff! There's so much attention to detail and the dances are amazing! I just hope there's more songs coming soon! (Hopefully some more 2000's pop)\n\nHelpful | 7", "gsimmons87Jul 20, 2019 at 7:10 PM\n\nOne of my girlfriends favorite games.\n\nHelpful | 1", "SanlakiJun 17, 2019 at 9:55 PM\nDisappointed\n\nI played 2 songs and went to 2 rooms. Didn't really like it. I tried to request refund but couldn't. I think it's because I left my quest on last night with this game on. So the 2 hour limit was exceeded. Now, I'm stuck with the most expensive game I've purchased on quest and can't take it out. Smh.\n\nHelpful | 3\nDeveloper ResponseJul 15, 2019 at 2:32 PM\n\nHello Suranayay! Please get in touch with Oculus support about return concerns: https://tickets.oculusvr.com/hc/en-us/requests/new Sorry to hear that you didn't enjoy the game, but you should be able to get help with your return by submitting a ticket there.", "RodSpikeJul 3, 2019 at 4:54 PM\n\nAwesome game. This is a relaxing but sweaty experience. Please update often and bring us new songs :)\n\nHelpful | 2", "robertpatricianJun 16, 2019 at 9:39 AM\nGreat developer support!\n\nThe devs were very responsive in making the interface bigger, but it's still very blurry. Other games, such as space pirate trainer and Tilt VR, have very sharp interfaces. The fonts are teal on a white background in the main map interface, which I can't read. I have spent about an hour in this game, and am still stuck in what I believe is the tutorial.\n\nHelpful | 3", "Khafre027May 26, 2019 at 6:41 PM\nFor anyone who like dancing games\n\ni was a little hesitant at first but really enjoyed playing.must have for anyone who likes dancing games.I just hope that more songs and clothing options/hair styles for your character are added in the future\n\nHelpful | 6", "marcalangriffinMay 23, 2019 at 2:07 PM\nSo much fun!!\n\nYou really work up a funky sweat!\n\nHelpful | 10", "Twistedchild420May 25, 2019 at 9:55 PM\nAwesome\n\nGreat graphics and dance moves that make sense. You get a lot here and you should for the price. Very well done Quest launch title. Barely getting started but I can see getting some good fitness action out of this game!\n\nHelpful | 4", "rasamayaJul 31, 2019 at 10:47 AM\nsad compared to Kinect version\n\ndoes not feel lime dancing. wasted money, but love playing Xbox versions\n\nHelpful | 2", "nikk.wMay 24, 2019 at 10:51 PM\n\nJust like actually going to the club but with significantly less effort. I even broke my phone by accidentally dropping it, just like in real life. 10/10, would throw my phone into the crowd again.\n\nHelpful | 6", "Jasvas01May 25, 2019 at 3:26 PM\nHooked after the first song!!\n\nWent in a bit skeptical, however really impressed with the entire package, graphics, sound and gameplay. TOP Notch!!\n\nHelpful | 12", "jesaveeMay 24, 2019 at 11:44 AM\nSuper Awesome\n\nI love this game so much. I can have a night out at the club while staying in the house with my family. Its awesome! Its nice dancing in the game.\n\nHelpful | 8", "MidnightSun82Jun 12, 2019 at 5:00 PM\nJust not fun\n\nI saw videos of this and it looked like fun but in comparison to other games this just fell flat for me.. the movements are meh and the music selection was rather small. Would not get this again\n\nHelpful | 4", "Patrice_VRJun 1, 2019 at 12:52 PM\ndisappointed\n\nMenu and navigation awful, multiplayer terrible and available only between different oculus account. U wanna do a good game and a good multiplayer experience? Go check game like Rec Room or Fortnite and learn because you're far from that and it is not free.\n\nHelpful | 3", "TheRealJDM345Jun 3, 2019 at 10:29 AM\nDance central VR is the best!!!!!\n\nThis is an awesome fitness game and if you really like dancing and need to lose weight this is the game for you!!!!\n\nHelpful | 3", "SparkzzlyMay 23, 2019 at 10:19 PM\nGreat for dancing but bad graphics\n\nAll the text in this game is almost impossible to read- if you can get to the point where your dancing everything is crisp- this is the only game I have issue reading the text.\n\nHelpful | 7\nDeveloper ResponseMay 24, 2019 at 6:16 AM\n\nHi angel12312, Could you try adjusting the IPD setting on your headset? You can do this using the physical slider on the bottom left-hand side of the headset. Additionally, try adjusting the vertical alignment and position on of the headset on your head, and tightening when it looks the clearest for you. Finally, if you use corrective lenses, make sure you're wearing them while playing in VR. We hope these suggestions help improve your experience with Dance Central! If you continue to experience issues, don't hesitate to reach out to us through our support portal at support.harmonixmusic.com. Thanks!", "Doomsday911Jun 5, 2019 at 4:54 AM\nIdk\n\nId doesnt even let me download the game is just says queued and Ive tried everything to try and fix it\n\nHelpful | 1\nDeveloper ResponseJun 6, 2019 at 8:50 AM\n\nHi Doomsday911! This is a platform-wide issue affecting many games. Oculus is looking at tracking down the cause currently."]