{"App Title": "Dead and Buried II", "App description": "Dead and Buried II is a fast-paced multiplayer shooter set in a supernatural western world. Grab your six-shooters and choose from multiple gamemodes. Compete against real players online to see who the best gunslinger is or play cooperatively versus the undead horde! The game is a sequel to the popular Dead and Buried released on Rift and GO.\n\nFeatures:\n- Competitive Modes: battle online in free-roaming Deathmatch or cover-based Shootout.\n- Cooperative Modes: band together in free-roaming Survival or stationary Horde.\n- Duel it out: Go 1v1 in a last-man-standing Quickdraw match.\n- Multiplayer Bots: never wait for players again! Bots will fill the game.\n- Portable: with Quest, take the action on the go.\n- Social: make new friends in the Town and spin up matches together.\n- Weaponry: six-shooters, grenade launchers, and more!", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Shooter", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "2.0.8396", "Developer": "Oculus Studios Strike Team", "Publisher": "Oculus Studios", "Website": "http://www.oculus.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Privacy Policy\n\nLast Updated: December 27, 2019\n\nOculus is brought to you by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) (\"Oculus,\" \"we,\" \"us\") and is one of the Facebook Companies (https://www.facebook.com/help/111814505650678). We make virtual, mixed, and augmented reality (collectively, \"XR\") products and operate a platform where users can download, interact with, and submit content and obtain services related to our products. Collectively, we describe our products and servicesincluding our websites, mobile apps, platform, content, hardware and the services described further in our Terms of Service (https://www.oculus.com/legal/terms-of-service)as our \"Services.\" This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\n1. What kind of information do we collect?\n\nDepending on which Services you use, we must process different kinds of information from or about you. Heres how:\n\nInformation You (and others) Give Us. We collect the information you (and others) give us when using our Services. For example:\nWhen you register to use our Services, we ask for information such as your name, email address, and phone number.\nYou will have the ability to add information to your profile after registration.\nIf you buy something on or through our Services, we collect information about the transaction. This can include your payment information, purchase activity, and shipping and contact details.\nWe collect information about the people, content, and experiences you connect to and how you interact with them across our Services.\nWhen you post, share or communicate with us or other Oculus users on our Services, we receive and store those communications and information associated with them, such as the date a post was created.\nWhen you communicate with Oculus, you provide us with information like your email address.\nDepending on which Services you use, you have the option of submitting information about your physical features and dimensions.\nWe collect content and information about content you create using our Services, such as your avatar, a picture you post, or an object you sculpt.\nWe also collect content and information that other people provide when they use the Services. This can include information about you, like when they send us an abuse report that refers to or contains video of you.\nInformation Automatically Collected About You When You Use Our Services. We also collect information automatically when you are connected to our Services. Depending on how you access and use our Services, we collect information such as:\nInformation about your interactions with our Services, like information about the people, games, content, apps, features, or other experiences you interact with, including information collected through or from content provided by our third-party partners. For example, we may receive information about in-app purchases you have made in a game provided by a third-party developer;\nInformation collected in or through cookies, local storage, pixels, and similar technologies (additional information about these technologies is available at https://www.oculus.com/legal/cookies-pixels-and-other-technologies);\nInformation about how you access our Services, including information about the type of device you're using (such as a headset, PC, TV, mobile, or other connected device), its configuration (such as your operating system and graphics processing unit), your browser, Internet Protocol (\"IP\") address, and how your device is performing;\nInformation about the features you interact with on our Services. For example, when you use our voice-search features, we process your voice commands so we can deliver the content or feature youve requested;\nCertain identifiers that may be unique to you. These identifiers include device and other identifiers, such as those from games and apps you use;\nInformation about the games, content, or other apps installed on your device or provided through our Services, including from third parties;\nLocation-related information, which can be derived from information such as your devices IP address. If youre using a mobile device, some of our Services collect information about the devices precise location, which is derived from sources such as the devices GPS signal and information about nearby Wi-Fi networks and cell towers;\nInformation about your environment, physical movements, and dimensions when you use an XR device. For example, when you set up the Oculus Guardian System to alert you when you approach a boundary, we receive information about the play area that you have defined;\nInformation we receive through device settings you choose, such as your photos or audio content.\n\nThird parties may also collect information about you through the Services, as described below.\n\nRelated companies. Depending on which services you use, we receive information about you from other companies that are within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook, and combine that information with other information we collect about you. View a complete list of related companies at https://www.facebook.com/help/111814505650678.\nInformation from other sources. We also receive additional information about you from third parties, including partners that provide us information that is publicly or commercially available, and may combine that information with the other information we collect about you.\n\nYou can learn how to access and delete information we collect by visiting the Privacy Center (https://secure.oculus.com/my/privacy).\n\n2. How do we use information?\n\nWe use the information as set out below and to provide our Services to you and our partners. Heres how:\n\nTo provide and personalize our Services. We use the information we collect to provide you with our Services. For example, we use this information to:\nProvide you with hardware, content, games, apps, and other experiences;\nCreate accounts and user profiles;\nCommunicate with you about our Services;\nEnable user-to-user communications and other social services;\nProvide technical support;\nNotify you about updates to our Services; and\nCustomize your experiences based on your activities, including the content, games, apps, and other experiences you interact with, the other online services you use, and other information we collect. This allows us to make your experience unique and relevant to you, for example by showing you content that is most relevant to you.\nTo improve and develop your experience and our Services. We also use the information we collect to understand and improve our Services and to develop the XR ecosystem. For example, we use the information to:\nSolicit and analyze input and feedback about our Services;\nIdentify and address technical issues on our Services;\nConduct and learn from research about the ways in which people use our Services; and\nImprove services offered by others, such as third parties that offer content, games, apps and other experiences on our platform.\nTo market to you. We use the information we collect to send you promotional messages and content and otherwise market to you on and off our Services. We also use this information to measure how users respond to our marketing efforts. If you would like to opt out of receiving marketing emails, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\nTo promote safety and security. We use the information we collect to help promote safety and security on and off our Services, such as by investigating suspicious activity or violations of our terms or policies and protecting our or others rights or property.\n\n3. How is information shared?\n\nOur Services help you engage with the XR ecosystem and others that interact with it. To provide and support our Services, information we have about you is shared in certain circumstances. Here is who can see information about you when you and others use our Services.\n\nPeople and accounts you share and communicate with. When you share, interact, and communicate using our Services, you choose the audience for what you share. For example, when you post a photo on the wall in Oculus Rooms, other people who visit the room will be able see it.\nPublic Information. Certain information you post to your Oculus profile, such as your Oculus ID (also known as your Oculus Username), your system-generated user ID, and avatar, will be public and visible to people on and off our Services. Your Oculus ID is a unique identifier you choose to identify yourself on our Services. Your system-generated internal-ID is an opaque string of characters generated by the Oculus system that identifies your Oculus profile.\n\nInformation you post to public areas of our Services, such as a forum, blog, or other community tool, will also be visible to people on and off our Services. If you post information to these interactive features, it will be publicly available. Certain information associated with your public posts, such as the time of your post, may also be published and publicly available.\n\nContent others share about you. You should consider who you choose to share with, because people who are able to see your activity, content, or information on our Services may choose to share it with others on and off our Services. For example, when you interact with others in a multiplayer game, another player could choose to livestream that experience  including what you are doing in the game  to Facebook. People may also use our products to share content about you they have obtained from other sources. For example, people may share a photo of you with others in Oculus Rooms.\nApps, Developers, and Other Online Content Providers on our Services. You can interact with third-party content, games, apps, and other experiences through our Services. We may share information about you with these partners so they can provide you with the experiences you've requested, such as:\nInformation in your Oculus profile and about how you use our Services. For example, we may provide a third-party gaming experience with information about people you commonly interact with on our Services so they can offer to pair you in a social experience. We may also share information about individual abuse reports or abuse statistics on our Services, so we can help develop a safe and enjoyable XR ecosystem.\nInformation about your interaction with the third-party service, such as how long you have interacted with content or how far you have progressed in a game.\nAny other information you choose to share with the third party.\nThird-party content providers may also collect information from you directly through the experiences they provide. Please note that any information you share with these (or other) third parties will be subject to those third parties own privacy policies, not this one.\nSharing Within Related Companies. Depending on which services you use, we share information within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook. For a list of our related companies, please see https://www.facebook.com/help/111814505650678.\nService providers. We share the information we collect with vendors, service providers, researchers and other partners, who work at our direction to support the Services (such as hosting our Services, fulfilling orders, facilitating payments, analyzing the way people use our Services, processing credit card payments, providing customer service, or sending electronic communications for us).\nOther parties in connection with certain business transactions. In the event that the ownership of Oculus (or any portion of our assets) changes as a result of a merger, acquisition, or in the event of a bankruptcy, information from or about you or your device may be transferred to another company.\nPermission. We may share information about you for any other purpose you choose.\nLaw enforcement or legal requests. We share information with law enforcement or in response to legal requests in the circumstances outlined in Section 7 below.\n\nWe also share de-identified or aggregate data with others. De-identified data means information where we have removed your name and other data that could reasonably be used to identify you. Aggregate data is data that has been combined with other data so that it doesnt identify any specific person. For example, we provide developers with aggregated statistics about the number of people from a particular region that use our Services, so developers can create content tailored for people in that market.\n\n4. How the Facebook Companies work together\n\nOculus shares infrastructure, systems technology with other Facebook Companies (which include Facebook, Instagram, and WhatsApp) to provide an innovative, relevant, consistent and safe experience across all Facebook Company Products you use. We also process information about you across the Facebook Companies for these purposes, as permitted by applicable law and in accordance with their terms and policies. For example, we use information about bad actors on Oculus to fight spam or abuse on other Facebook Company Products like Instagram. We also work to understand how people use and interact with Facebook Company Products, like understanding the number of unique users on different Facebook Company Products.\n\nFacebook also powers social features on Oculus. If you choose to log into Facebook on Oculus, Facebook will use your Oculus account information and information about your use of Oculus products to provide, personalize and improve Facebook Company Products, including to personalize the ads you see on and off Facebook Company Products. You can control what data Facebook uses to show you ads on and off of Facebook Company Products in your Facebook Settings.\n\n5. Third Parties that Provide Content, Marketing, or Functionality on Our Services\n\nSome of the content, marketing, and functionality on our Services may be provided by third parties that are not affiliated with us. For example, we work with companies that help us understand how people use our Services.\n\nOther companies may collect information on or through our Services to market to you on or off of our Services. These and other third parties may collect information about your use of our Services, including through the use of cookies, device IDs, local storage, pixels and other technologies, and this information may be collected over time and combined with information collected on different websites and online services.\n\n6. Data retention and deletion\n\nWe store data that identifies you until it is no longer necessary to provide our Services or your account is deleted, whichever comes first. This is a case-by-case determination that depends on things like the nature of the data, why it is collected and processed, and relevant legal or operational retention needs. For example, we may retain certain purchase information for accounting and tax purposes even after you have deleted your account.\n\nWhen you delete your account, we delete things you have posted and information about apps and entitlements you have downloaded, and you will not be able to recover that information later. Information that others have shared about you is not part of your account and will not be deleted when you delete your account. To delete your account at any time, or to learn more about deleting your account, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\n\n7. How do we respond to legal requests and preventing harm?\n\nWe access, preserve and share information with regulators, law enforcement or others:\n\nIn response to a legal request (like a search warrant, court order or subpoena) if we have a good faith belief that the law requires us to do so. This may include responding to legal requests from jurisdictions outside of the United States where we have a good faith belief that the response is required by law in that jurisdiction, affects users in that jurisdiction, and is consistent with internationally recognized standards.\n\nInformation we receive about you, including financial transaction data related to purchases made on or through our Services, can be accessed, processed and retained for an extended period when it is the subject of a legal request or obligation, governmental investigation, or investigations concerning possible violations of our terms or policies, or otherwise to prevent harm. We also retain information from accounts disabled for violations of our terms for at least a year to prevent repeat abuse or other term violations.\n\n8. How we operate and transfer data as part of our global services\n\nWe share information globally, both internally within the Facebook Companies (https://www.facebook.com/help/111814505650678/), and externally with our partners and with those you connect and share with around the world. Your information may, for example, be transferred or transmitted to, or stored and processed in the United States or other countries outside of where you live for the purposes described in this policy.\n\n9. How will we notify you of changes to this policy?\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, and/or providing notice through the Services. If we make an administrative change, we may update the \"Last Updated\" date at the top of this Privacy Policy.\n\n10. Contacting Us\n\nIf you have questions about this Privacy Policy, please contact us at privacy@oculus.com.\n\n11. Privacy Notice for California Residents\n\nIf you are a California resident, you can learn more about your consumer privacy rights by reviewing the California Privacy Notice.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Developer Terms of Service": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Terms Of Service\n\nLast Updated: June 8, 2020\n\nBY ACCEPTING THESE TERMS OF SERVICE OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THESE TERMS OF SERVICE IN THEIR ENTIRETY. IF YOU DO NOT AGREE TO THESE TERMS OF SERVICE, DO NOT ACCESS OR USE OUR SERVICES.\n\nTHESE TERMS OF SERVICE CONTAIN IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SERVICES, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS. PLEASE READ THE \"DISPUTE RESOLUTION\" SECTION (SECTION 19) IN ITS ENTIRETY. IN ADDITION, CERTAIN TERMS AND CONDITIONS MAY BE APPLICABLE TO USERS THAT RESIDE OUTSIDE THE UNITED STATES. PLEASE REVIEW SECTION 27 TO DETERMINE WHETHER THESE TERMS AND CONDITIONS APPLY TO YOU.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THESE TERMS OF SERVICE. MAKE SURE TO REVIEW THESE TERMS OF SERVICE WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nOculus (\"Oculus,\" \"we,\" \"us\" or \"our\") is brought to you by Facebook Technologies Ireland Limited (formerly known as Oculus VR Ireland Limited) if you reside in the European Region (as defined at https://www.oculus.com/legal/territories) and by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) if you reside anywhere else.\n\nWe are pleased to provide you access to the services described below in Section 1 (collectively, our \"Services\"). These Terms of Service (\"Terms\") apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with Oculus for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nOculus reserves the right to change or modify these Terms on a going-forward basis at any time and in our sole discretion. If Oculus makes changes to these Terms, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided and/or notice through the Services. If we make an administrative change, we may provide notice by updating the \"Last Updated\" date at the top of these Terms.\n\nYour continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services and delete (https://secure.oculus.com/my/privacy) your account. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\n1. Oculus Products and Services\n\nOur mission is to enable people to have meaningful interactions regardless of physical distance. To help advance this mission, we provide the Services described below to you. In order to provide these Services, we must collect and use your personal data as described in our Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy.\n\nProvide innovative devices, content and systems. We offer a variety of physical goods, platform services, software, websites, applications, and content that allow you to access and immerse yourself in virtual, augmented, and mixed-reality (collectively, \"XR\") worlds and obtain services related to our products. We use the data we have to provide you with these products and to enhance the XR ecosystem.\nProvide a personalized experience for you. Your experience with Oculus is unlike anyone elses. For example, any Oculus user may be eligible to see thousands of unique pieces of content. We use the data we have  for example, information about the connections you make, the choices and controls you select, and the things you share and do  to personalize your experience.\nConnect you with people and experiences you care about. We help you find and connect with people, groups, events, and other experiences that matter to you across the Services you use. We use the data we have to make suggestions for you and others  for example, rooms to join, events to attend, and people you may want to become friends with. Stronger ties make for better communities, and we believe our Services are most useful when people are connected to people, groups, and experiences they care about.\nEmpower you to express yourself and communicate about what matters to you. There are many ways to express yourself on Oculus and to communicate with friends, family, and others  for example, sharing photos, creating or participating in events or multiplayer experiences, or adding content to a virtual environment. We also have developed, and continue to explore, new ways for people to use technology like augmented reality and 360 video to share more expressive and engaging content on or through Oculus.\nHelp you discover content, products and services that may interest you. We may provide you with offers and other promotions to help you discover content, products, and services that are offered by Oculus and the many businesses and organizations that use our Services.\nCombat harmful conduct and protect and support our community. People can only have meaningful interactions if they feel safe. We employ dedicated teams and develop advanced technical systems to detect misuse of our service, harmful conduct towards others, violations of our terms and policies, and situations where we may be able to help support or protect our community. If we learn of content or conduct that misuses our Service or violates our Terms and policies, we will take appropriate action  for example, removing content, blocking access to certain features, disabling an account, or contacting law enforcement. We share information with other Facebook Companies (https://www.facebook.com/help/111814505650678) when we detect misuse or harmful conduct by someone using one of our Services.\nUse and develop advanced technologies to provide functional services for everyone. We use and develop advanced technologies  like artificial intelligence and machine learning systems  to enable us to offer a better and more useful service to everyone who uses Oculus. For example, we use information we have to develop models that will surface content that is relevant to you. We also develop automated systems to improve our ability to detect and remove abusive and dangerous activity that may harm our community and the integrity of our Services.\nResearch new ways to make our services better. We engage in research and collaborate with others to improve our Services. One way we do this is by analyzing the data we have and understanding how people use our Services.\nProvide consistent and seamless experiences: Our products help you find and connect with people, groups, businesses, organizations, and others that are important to you. We design our systems so that your experience is consistent and seamless across the different Facebook Company Products (https://www.facebook.com/help/195227921252400) that you use. For example, some of our Services help you connect with your friends on Facebook.\nEnable global access to our services: To operate our global service, we need to store and distribute content and data in our data centers and systems around the world, including outside your country of residence. This infrastructure may be owned or operated by Facebook Technologies, LLC, Facebook Technologies Ireland Limited, Facebook Inc., Facebook Ireland Limited, or their affiliates.\n\n2. Eligibility; Registration and Account\n\nThe Services are intended solely for users who are 13 or older. Any registration for, or use of, the Services by anyone under the age of 13 is unauthorized, unlicensed and in violation of these Terms. You represent and warrant that you (a) are not identified on the Office of Foreign Assets Controls Specially Designated Nationals List (\"SDN List\"), (b) are not placed on the U.S. Department of Commerces Denied Persons List or Entity List or any other U.S. export control list, (c) will not use IP proxying or other methods to disguise the place of your residence, (d) will not use the Services if any applicable laws in your country prohibit you from doing so in accordance with these Terms and (e) have not previously had your right to use the Services suspended or terminated.\n\nTo access and use certain features of the Services, you may be required to register for an account. By creating an account, you agree to: (i) provide accurate, current and complete account information; (ii) maintain the security of your password, not share your password with any other person and accept all risks of unauthorized access to your account; and (iii) promptly provide notice at https://www.facebook.com/whitehat if you discover or otherwise suspect any security breaches related to the Services.\n\n3. Equipment; Software; and Updates\n\nCertain equipment and software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our Code of Conduct (https://support.oculus.com/1694069410806625), agreements, laws, regulations, or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\n4. Your Use of the Services and Content\n\n4.1 Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (\"Software and Content\"), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by Oculus or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n4.2 Oculus Runtime Software. Subject to these Terms, including the license provided in Section 4.1, you may access, install, and use the Oculus Runtime Software (\"Runtime\"). In order to maximize your enjoyment, safety, and overall experience through our Services, the Runtime may only be used with Oculus approved hardware devices and with software developed using the Oculus Rift Software Development Kit, as specified in the Oculus Rift Software Development Kit license agreement. We also require that you use only the then-current version of the Runtime. You acknowledge that the Runtime incorporates proprietary information, and that you will not disclose it to any other person or entity.\n\n4.3 Third Party Content. Your use of services, applications, or content provided by third parties (\"Third Party Content\") made available through the Services may be subject to additional end user agreements. In the event that these agreements conflict with the provisions of these Terms, these Terms will govern. Oculus has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Oculus be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Oculus) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n4.4 Trial Access to Services. We may offer free trials or other limited versions of Services so you can preview Services before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n4.5 Availability of Services after Purchase; Updates. Some Services may rely on services provided by third parties for some or all of its functionality. Such Services may not function properly or may become inoperable if these third parties discontinue their services.\n\n4.6 Support. Oculus will be responsible for all billing questions related to the purchase of Services and for support with respect to the Oculus platform. Oculus has no obligation to provide support for Third Party Content. Please contact us through the support portal at https://support.oculus.com for assistance.\n\n4.7 Availability. The Services and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n4.8 Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n5. Purchasing Services\n\n5.1 Purchasing Services from Oculus. You may only purchase Services for your personal use or to give as a gift unless otherwise expressly permitted in these Terms. You may not purchase Services from Oculus for commercial use or resale, although you may use the Services to develop and test content, software, or applications intended for distribution by Oculus.\n\nWhen placing an order or making a purchase, you will be required to provide us with information, such as your address and billing information. You represent and warrant that all such information is accurate, and you will ensure that such information is kept current. Oculus will have no responsibility or liability for inaccurate information or information that later becomes outdated, and Oculus will have no obligation to make efforts to determine the correct contact or shipping information. For most Services, you can manage your information within your account settings. For product purchases pending shipment, you can update your information at any time prior to shipment at https://shop.oculus.com/history. We will not take payment for product purchases until Order Acceptance (see below).\n\nAfter you place an order, you may receive a communication from us acknowledging that we have received your order (\"Order Acknowledgement\"). Please note that receiving the Order Acknowledgement does not mean that your order has been accepted. We will confirm our acceptance of your order by sending you a communication that confirms that the order has been processed or the goods have been shipped  when applicable (\"Order Acceptance\"). The contract between us in relation to the applicable Services will be formed when we send you the Order Acceptance.\n\nAny shipping dates or times provided by us (or a courier) are estimates only and are not guaranteed. The risk of loss in physical goods you purchase and the responsibility to insure the goods passes to you upon delivery of the goods to you.\n\nNothing in these Terms shall affect your statutory rights to reject physical goods that, when received by you, are damaged or defective.\n\n5.2 Pre-Orders. In advance of a new Service launch it may be possible to place pre-orders.\n\nThe price of the Service you pre-order will be as quoted to you at the time you submit your pre-order, and may include tax and shipping when applicable. Placing a pre-order does not guarantee delivery of a Service.\n\nWhen the pre-ordered Service is ready for shipping or delivery we will contact you to provide you with your purchase confirmation (including shipping costs and any taxes where applicable). This shall constitute the Order Acceptance.\n\n5.3 Our Right to Reject Your Order. At any time prior to Order Acceptance, we reserve the right to decline or reject your order. If this occurs, we will attempt to notify you. Some reasons for rejection can include: (a) we are unable to supply you with Service, for example because that item is no longer available or because of an error in the price at the point of sale; (b) you do not live in a country or region from which the Services may be purchased; or (c) you order more than the permitted maximum number of Services. If you have already paid, we will refund you the full amount including any delivery costs charged.\n\n5.4 Your Right to Cancel or Return Physical Goods. You may cancel your order or pre-order of physical goods at any time prior to shipping and Order Acceptance. After shipping the goods to you, you have the right, within 30 days from the date of your receipt of the goods, to cancel our contract with you and return the goods. This right does not apply to any goods that have been used, or are stated by us to be non-returnable, including any items or goods that have been personalized or modified in accordance with your instructions. The goods must be fully returned in the original packaging with the applicable proof of purchase and you will be responsible for the cost of returning the goods to us. If, on return to us, it is determined that the goods have been used, damaged, are missing components, or are not in resalable condition we may charge a 15% restocking fee, or otherwise reduce the amount of your refund to take account of this damage, use, or missing components.\n\nTo cancel your order or return your goods, you must inform us of your decision by following the instructions at https://support.oculus.com\n\n5.5 Content Transactions. You may have the ability to purchase digital content through the Services. You also may have the ability to purchase additional or enhanced functionality or media content within certain Services (collectively, \"In-App Purchases\"). Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content or In-App Purchases and assume no liability for Third Party Content or Third Party In-App Purchases that occur within Third Party Content.\n\n5.6 Errors. We attempt to be as accurate as possible and to eliminate errors in relation to our Services; however, we do not represent or warrant that any Service descriptions or pricing information are accurate, complete, reliable, current or error-free. In the event of an error, we reserve the right to correct such error and revise your order accordingly (which includes charging the correct price) or to cancel the order and refund any amount charged. If we discover a pricing or other material error related to a Service that has yet to be shipped or delivered, we will contact you to inform you of this error and give you the option of continuing to purchase at the correct price or cancelling your order. If we are unable to contact you using the contact details you provided during the order process, we will treat the order as cancelled.\n\n5.7 Account. You may be required to be a registered user in order to purchase some Services. You are responsible for all charges incurred in connection with your account. Oculus may attempt to collect unpaid charges, including by attempting additional charges to your payment instrument, use of collections agencies and any other legal means. If you decide to cancel your account, Oculus reserves the right, subject to any limitations under applicable laws, to collect fees, surcharges, or costs incurred before cancellation. Any delinquent or unpaid accounts must be settled before Oculus will allow you to register again.\n\n5.8 Virtual Items. Your purchase of a virtual item or in-game currency within the Services is a payment for a limited, non-assignable license to access and use such content or functionality in the Services. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Services can only be used in connection with the Services where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Services for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n5.9 Pricing and Payment. We may accept various forms of payment, including credit and debit cards, and payments made through PayPal and Facebook Payments. Additional terms with your payment provider may apply.\n\nBy submitting an order or pre-order, you acknowledge that you are authorized to use the designated payment method and you authorize us to charge your order to that payment method. When you provide your payment information, you authorize us (or a third party payment processor) to process and store your payment and related information. Depending on where you are located or ask to have Services shipped or delivered, Oculus may utilize an agent, subsidiary, or affiliate (including Facebook Technologies Ireland Limited for orders outside of the United States and Canada) to process payment and shipping. In the event the payment method you designate cannot be verified, is invalid, or is not otherwise acceptable, we may suspend or cancel your order. You are responsible for resolving any problems we encounter in order to proceed with your order.\n\nPrices are subject to change without notice. We reserve the right to refuse or cancel orders at any time and in our sole discretion.\n\n5.10 Taxes. If your purchase or use of the Services is subject to any type of use or sales tax, duty or other governmental tax or fee (\"Taxes\"), then we may charge you for those Taxes. Applicable Taxes may be presented at checkout. You are responsible for any Taxes due with respect to your use of the Services.\n\n5.11 Content Cancellations; Returns. All purchases of digital content are final except as required by law, or as described in our Mobile (https://www.oculus.com/legal/mobile-content-refund-policy) and Rift (https://www.oculus.com/legal/rift-content-refund-policy) Content Refund Policies. Once you purchase Content, we encourage you to download, install and/or access it promptly. You consent that the supply of the digital content may begin immediately following the completion of your purchase, and you acknowledge that you therefore will lose any statutory rights you may have to withdraw and receive a refund. If you are unable to download, install or access purchased content, please contact us through the support portal at https://support.oculus.com.\n\n6. Acceptable Use\n\nBy accessing or using the Services, you agree that you will not: (a) access or use the Services in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Services, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Services in any manner; (c) access or use the Services for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, Code of Conduct (https://support.oculus.com/1694069410806625), or any other terms or policies provided in connection with the Services; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Services; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Services or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Services, or third parties; or (h) infringe upon or violate the rights of Oculus, our users or any third party.\n\n7. User Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send, otherwise transmit, or interact with content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, \"User Content\"). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. If you use content covered by intellectual property rights that we have made available through our Services (for example, images, designs, videos, or sounds we provide that you add to content you create or share on Oculus), we retain all rights to that content (but not yours). By submitting User Content through the Services, you grant Oculus a worldwide, non-exclusive, transferable, royalty-free, and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform, and distribute such User Content in connection with the Facebook Company Products (https://www.facebook.com/help/195227921252400) (subject to applicable Privacy Settings (https://secure.oculus.com/my/privacy)). This right ends when you delete your User Content or your account unless your User Content has been shared with others, and they have not deleted it. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content. If User Content includes music, you agree to our Music Guidelines (https://www.oculus.com/legal/music-terms).\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Oculus the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our Code of Conduct (https://support.oculus.com/1694069410806625/).\n\nOculus does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Oculus has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nIn the event you are a developer who submits User Content to Oculus, you acknowledge and agree that our agreements with you as a developer may supersede this section of the Terms.\n\n8. Privacy Policy\n\nOur Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as developers of Third Party Content and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Services. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n9. Additional Terms\n\nThese Terms are in addition to, and do not replace or change, any other agreements you enter into with Oculus, which may include but are not limited to our developer agreements, special device terms of use, Code of Conduct (https://support.oculus.com/1694069410806625), and contest, competition, or promotion-related terms. In addition, if you purchase physical goods from Oculus, other terms of sale or promotion may apply from time to time.\n\nYour purchase and use of Third Party Content may be subject to additional terms, including but not limited to third-party end user agreements, and privacy policies. We encourage you to review any third-party agreements and policies carefully before accessing, downloading or using Third Party Content. You may also access services provided by other Facebook Company Products (https://www.facebook.com/help/195227921252400), which may be subject to additional terms.\n\n10. Ratings\n\nWe may display age, comfort, and content ratings for digital content that are based on information provided to us by the developers of such content. We cannot guarantee that digital content ratings will always be accurate, nor can we promise that you will not find some material harmful, offensive, indecent or objectionable.\n\n11. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Services are the property of Oculus or our licensors and are protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\nOculus, Oculus VR, Rift, Oculus Touch, Oculus Go, and the Oculus logo (\"Oculus Marks\") are trademarks or registered trademarks of Facebook Technologies, LLC. The Oculus Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, except as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder. For more information about our brand guidelines, visit our Brand Resource Center (https://oculusbrand.com).\n\n12. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials or other information about Oculus and our Services (collectively, \"Feedback\"). You agree that Oculus and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n13. Export Compliance and U.S. Government Rights\n\nYou will comply with all applicable export control laws of the United States and any other applicable governmental authority, including without limitation, the U.S. Export Administration Regulations (\"Export Laws\"). You will not, directly or indirectly, export, re-export or download any products, services or technology of Oculus, including, without limitation, the Services: (a) to any individual, entity or country prohibited by Export Laws, including by any U.S. sanctions program; (b) to anyone on the SDN List, the Denied Persons List or Entity List or other export control lists; or (c) for any purpose prohibited by Export Laws, including nuclear, chemical or biological weapons proliferation or development of missile technology. You further represent and warrant that no U.S. federal agency has suspended, revoked or denied your export privileges and you are not listed on the SDN List.\n\nThe Services, including all related software, technical data and documentation, are \"Commercial Items\" as that term is defined in 48 C.F.R. 2.101. We provide the Services for U.S. Government end use solely in accordance with the following: (a) the Services are licensed only as Commercial Items; and (b) the U.S. Government will have the same rights as all other end users pursuant to these Terms. This customary commercial license is provided in accordance with FAR 12.211 (Technical Data) and FAR 12.212 (Software) and, for U.S. Department of Defense transactions, DFARS 252.227-7015 (Technical Data  Commercial Items) and DFARS 227.7202-3 (Rights in Commercial Computer Software or Computer Software Documentation). If a U.S. Government agency has a need for any additional rights, it must negotiate directly with Oculus to determine if the parties can negotiate an acceptable license amendment that must be included in any applicable contract or agreement.\n\n14. Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (\"DMCA\") and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Services and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nIf you believe that anything on or available through the Services infringes upon any copyright which you own or control, you may file a notification of such infringement with our Designated Agent as set forth below:\n\nDesignated Agent\n\nFacebook Technologies, LLC\n\n1601 Willow Road\n\nMenlo Park, CA 94025\n\nPhone: (650) 543-4800\n\nEmail: IP@oculus.com\n\nPlease see 17 U.S.C. 512(c)(3) (available at http://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n15. Hyperlinks\n\nYou are granted a limited, non-exclusive right to create text hyperlinks to our websites for noncommercial purposes; however, you may not use our logos or other proprietary graphics to link to our sites without our express written permission.\n\nThe Services may contain links to third-party websites, applications or other third-party services, and you understand that by accessing third-party links, you may be exposed to content that is offensive, harmful, inaccurate or otherwise inappropriate. You understand and agree that we are not responsible or liable for the availability or accuracy of such third-party properties or the content, products or services made available through such properties. We do not endorse or control such third-party properties and we make no representations or warranties of any kind regarding such properties. If you access or use any third-party properties, you should also be aware that such third parties terms and policies will govern.\n\n16. Disclaimers\n\n16.1 THERE ARE IMPORTANT HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS THAT YOU MUST READ BEFORE USING THE SERVICES, WHICH ARE AVAILABLE AT https://www.oculus.com/legal/health-and-safety-warnings. BY USING THE SERVICES, YOU REPRESENT AND WARRANT THAT YOU HAVE READ AND UNDERSTAND THESE WARNINGS AND INSTRUCTIONS. WE MAY UPDATE OR REVISE THESE WARNINGS AND INSTRUCTIONS, SO PLEASE REVIEW THEM PERIODICALLY. ADDITIONAL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS MAY BE PROVIDED BY DEVELOPERS IN RELATION TO SPECIFIC THIRD PARTY CONTENT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS BEFORE USING THE SERVICES.\n\n16.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK. AS BETWEEN YOU AND OCULUS, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, AND OCULUS EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, OCULUS DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS, (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY OCULUS WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n17. Indemnification\n\nYou agree to defend, indemnify and hold harmless Oculus and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, \"Oculus Parties\") from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Services; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Oculus or a third party in relation to the Services; (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n18. Limitation of Liability\n\nTHE OCULUS PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SERVICES, EVEN IF AN OCULUS PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE OCULUS PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SERVICES. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n19. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH OCULUS AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM OCULUS (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n19.1 Binding Arbitration; Disputes; Small Claims. You and Oculus agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in San Mateo County, California, or, if you reside in the U.S., in a small claims court in your county of residence. \"Dispute\" as used in this Section 19 means any dispute, cause of action, claim, or controversy arising out of or in any way related to Oculus, these Terms, the subject matter of these Terms, or access to and use of the Services, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Oculuss intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Oculus empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n19.2 No Class Arbitrations, Class Actions or Representative Actions. You and Oculus agree that any Dispute is personal to you and Oculus, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Oculus agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n19.3 Federal Arbitration Act. You and Oculus agree that these Terms affect interstate commerce and that the enforceability of Section 19 shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (\"FAA\") to the maximum extent permitted by applicable law.\n\n19.4 Confidentiality. The arbitrator, Oculus, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n19.5 Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Oculus, you agree to first contact Oculus and attempt to resolve the claim informally by sending a written notice of your claim (\"Notice\") to Oculus. The Notice to Oculus must be sent by certified mail addressed to: General Counsel, Oculus, 1601 Willow Road, Menlo Park, CA 94025. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Oculus cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 19, commence an arbitration proceeding or file a claim in court. You and Oculus agree that any Dispute must be commenced or filed within one year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Oculus cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Oculus shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (\"AAA\"). In the event AAA declines or is unable to administer the arbitration, you and Oculus agree to use an arbitration forum or arbitrator that you and Oculus mutually agree upon. If, after making a reasonable effort, you and Oculus are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (\"AAA Rules\") then in effect. The AAA Rules and other information about AAA and arbitration are readily available at http://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Oculus agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, Oculus will pay all filing, AAA, and arbitrators fees and expenses. If the arbitrator issues you an award that is greater than the value of our last written settlement offer made before an arbitrator was selected (or if we did not make a settlement offer before an arbitrator was selected), then we will pay you the amount of the award or US $5,000, whichever is greater, and pay your attorney, if any, the amount of attorneys fees incurred, and reimburse any expenses (including expert witness fees and costs) that you or your attorney reasonably accrue for investigating, preparing and pursuing your claim in arbitration. We waive any right to seek an award of attorneys fees and expenses in connection with any non-frivolous arbitration between you and us.\n\n19.6 Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Oculus can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within 30 days of the date that you first became subject to this arbitration provision, and must include your name and residence address, the email address you use for your Oculus account (if you have one), and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: General Counsel, Oculus, 1601 Willow Rd., Menlo Park, CA 94025.\n\nIf a court or arbitrator decides that any of this section's limitations cannot be enforced as to a particular claim for relief, then that claim (and only that claim) must be severed from the arbitration and may be brought in court. Unless you choose to opt out, this dispute resolution provision in Section 19 shall survive termination of these Terms.\n\nThe courts in some countries may not permit you to consent to arbitration. If you reside in one of those countries, your countrys laws will apply.\n\n20. Governing Law\n\n20.1 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Services. Your access to and use of the Services may also be subject to other local, state, national or international laws.\n\n20.2 To the extent the provisions in Section 19 do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the United States District Court for the Northern District of California or a state court located in San Mateo County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims to the extent allowed by law. The courts in some countries may not apply California law to some types of disputes or allow you to consent to jurisdiction in California. If you reside in one of those countries, your country's laws will apply to such disputes related to the Services.\n\n21. Modifications to the Services\n\nOculus reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will Oculus be liable for the removal of or disabling of access to any portion or feature of the Services.\n\n22. Termination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n23. Severability\n\nIf any provision of these Terms is be deemed unlawful, void, or for any reason unenforceable, then that provision will be deemed severable from these Terms and will not affect the validity and enforceability of any remaining provisions.\n\n24. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Oculus, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n25. Nonwaiver\n\nAny failure by Oculus to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.\n\n26. Contact Us\n\nIf you have any questions or concerns regarding these Terms or our Services, please contact us through the support portal at https://support.oculus.com, email at contact@oculus.com.\n\n27. Special Provisions Applicable to Users Outside the United States\n\nCertain specific terms that apply only for German users are available at https://www.oculus.com/legal/terms-applicable-to-germany/. Please review these terms carefully if you reside in Germany.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Space Required": "1.60 GB"}



["5 stars\n45%\n4 stars\n21%\n3 stars\n14%\n2 stars\n9%\n1 star\n12%", "Mark-BlissJul 22 at 7:55 PM\nFun and fast but dizzy\n\nThe graphics and costumes in this game are great and game play is fun. The different events are fun. I would give it an A+ if it wasnt for one serious problem. Its little kids, we have a group of 20 friends who like to play and some are women. Kids come up to them and grab at there body parts and make sexual comments or pretend their kissing them. When you want to go into an event and we have 6 they jump in the circle so we cant get in. They are as young as 7 and have filthy mouths. The game has no way to block or report them so they have no fear to stop because they can never get kicked from the game. Oculus. is making no attempt at correcting this problem. When these kids are groping the avatars and making filthy comments about what they want to do to the womens bodies and the women try to run away the kids just follow. There is no way to block these kids Or report them for inappropriate behavior or sexual harassment. Oculus should be stepping in immediately and putting a stop to this and theyre doing absolutely nothing. Most other games and apps have a way to block people and report them for abusive behavior and this game has nothing.I once again want to add to my review, today (7-22-20) we tried to play with nonstop harassment from kids. One kid went up to a female in the female wolf avatar and started sucking her boobs and fingering her crotch. Everyone was yelling at him to get lost but he kept it up. We had a group of 6 and two of them followed us around and kept jumping in the circle until we just quit playing. WHY ISNT OCULUS FIXING THIS ISSUE? DONT YOU READ THE REVIEWS? I recommend NO ONE buys this game until they fix this problem.\n\nHelpful | 186", "rudymartin10May 27 at 8:03 AM\nI have a glitch thats happening\n\nSo I would play this game And this is a glitch called the dead pixel glitch and every hour to 30 minutes in front of my screen some black stuff cubes with a pop in and out like a pixel And Eventuallybecome dead I am going to do more research and find out if its the game or hardware or software reasons I\n\nHelpful | 19", "EncryptaynJun 24 at 4:27 PM\nDead and Buried II: Reloaded\n\nEDIT: My real review starts below, so skip ahead if you wish. Ive read several reviews asking for a few things, one being a team deathmatch, or a method to avoid the squeakers in the lobby (small, irritating children). I am friends with a lot of the Dead and Buried II community, and we have organized team deathmatches pretty regularly, almost nightly. I have several tips and tricks to lose the squeakers in town lobby as well. Also, I know the in and outs of everything else and more, so if you have a question about anything that you dont know Id be happy to help (ex. how to shoot different guns, when the busiest times are, unique secrets about all the maps, etc.) If youd be interested in learning about any of this, please send me an Oculus friend request and a message. Im very quick to reply and am quite friendly! Thanks, review below.\n\nIve had this game for almost a year now, ever since Oculus Quest came out and I snapped one up. With the original state of the game, I would have given it three stars. The basic gameplay was enjoyable, but glitches ran rampant, and it seemed like something was always out of whack.\nThen came a small update, which boosted my review up to four stars. Glitches were held mostly in check, and several small features were added to make the overall running of the game more smooth than it had been originally. However; there was somewhat of a lack of variety to the game modes, and it could get slightly monotonous. We were given news of an update that we waited for with starry eyes and all the hope in the world. Then, a month passed, then two, then three... we thought the update would never come. But then it did- this afternoon.\nMy updated review is now five stars. Characters are now customizable, new deathmatches are available, new game modes are up and running, and from what I can tell glitches have been reduced even more so. Originally, there were two game modes and eight maps- now, there are five modes and twenty one maps in all. Its impossible to get bored, because theres always something for you. If you like going head to head with your friends and blasting them to bits with an energy cannon, deathmatch may be for you. Maybe you prefer working with your friends to take down enemies- survival could be your favorite. Dont like the locomotion? Horde or Shootout might be your area of expertise.\nWith the addition of these new modes, theres always something to do, and something new to explore. Variety that had been lacking before has now been added, and you can endlessly roam about. The original game, under the bugs and issues, was a great game and a superb way to make friends. Now, its been polished enough to where this is a game I can rate 5 stars without any qualms. The weapons and maps feel great, and the AI cowboys and zombies seem appropriately intelligent and fun to play against.\nIf youre on the fence about this game, I would for sure make the plunge into your wallet for the 20 dollars you need. Its a choice Im fairly certain you wont regret- the update has made this game what is should really be. Even if youve had a bad impression of this game before, Id encourage you to take the chance and buy it. Most people are quite friendly, and the game is an amazing multiplayer experience.\n\nEDIT 2: Since the last update there have been even more bug patches that fix a lot of the problems left in the wake of the big update.\n\nHelpful | 22", "SourSirwinJul 26 at 12:11 AM\nGreat game, with a small player base\n\nFirst off this is a fun game, it may not be the best vr has to offer, but its a fun western for sure. You can do quick draws, horde mode, deathmatch and some other stuff. Its a fun game but unfortunately has a very small player base currently. Most the time if your logging in theres maybe a few people in your lobby if your lucky. So i would definetly bring friends if you can, or make sure to log on during peak times and youll find something to do here.\n\nHelpful | 1", "sean.holmes.1213Jul 15 at 4:15 AM\nSean\n\nGreat game, however it doesn't score properly in \"shootout forrest\"... and I feel the hordes sections need a different way to move to next level and do away a bit of the need to kill those annoying things, as when you end up.in there on your own with everybody else dead it's not possible to kill them and move on so you just play on a time warp.. got up to 70k in spooky town and had to just give up as wouldhv been there forever... and couldn't move to next level..!!\n\nHelpful | 0", "Low_BatteryJul 28 at 8:19 PM\nGreat when it works. Very buggy.\n\nThis game could be amazing. The number of hours Ive played with friends  despite the incredibly frustrating bugs  is a testament to the potential here. But ultimately our play time has fallen to zero. Why? Its just an exercise in frustration to try and successfully get everyone into a game together. Im reasonably certain weve spent half our total time in this game just trying to get into a match together.\n\nOne bug will hide the checkbox to disable bots. So we exit the match to try again. But then we encounter the next bug, which randomly sends some of our party into different towns when we exit a match. Sometimes we can fix that by going into the match and back out again. Sometimes everyone needs to restart the app. Sometimes one headset will crash and then everyone needs to relaunch the app.\n\nThis game has lamentably been riddled with bugs since day 1. The developer has delivered some updates, so perhaps the bugs will one day be resolved. I would be delighted if that happens.\n\nHelpful | 1", "LochlainnCroweJun 4 at 12:21 PM\nOne of the best but...\n\nIts really good and the community is nice as well. But I found the game doesnt have that many people active. Before reloaded the game wasnt that good but now I recommend it I gave it a 4 star because of the lack of players and game modes. I think they should add team death match or something overall very good game.\n\nHelpful | 5", "CURTROCKApr 27 at 9:51 PM\nThe Reloaded update = Win!\n\nTL:DR - for $20? Hell, yes!\n\nI bought this game when it 1st came out, and promptly refunded it. None of the good stuff from the first D&B was there. The weapons felt unsatisfying and lacked any weight. Im happy to report that the Zombie Horde modes now make this game ALOT better, and well worth the price. If you are a fan of any type of Zombie shooters, this game will make you VERY happy. Also, the ambiance of the audio combined with a unique graphical style, make this game a must-have for the Quest. I give it 4 stars, because there is still room for improvement. This game has the potential to be the PREMIER multiplayer shooter on Quest, and this update has shown the Devs have what it takes to make it happen. Also, the weapons systems feel ALOT more satisfying now. Congrats, Devs - keep up the great work \n\nHelpful | 19", "Mrkoopie52Jul 7 at 12:32 PM\nGreat Game but buy it with friends\n\nDead and Buried 2 is a great game now with the reloaded version its even better but I recommend buying with like 3 or 4 friends cus the lobby arent that much players ............................(but you get a match if there not enough players in macht).\n\nHelpful | 0", "AshmanRoonzJun 24 at 4:57 AM\nTown is the worst\n\nThis game might keep its players if there wasn't a garbage town you had to walk around to find other players. Make a matchmaking menu to play from! One review I saw the guy thought there was only one map to play. That's because the town is the worst idea for starting multiplayer games.\n\nHelpful | 3", "mutley35Apr 24 at 9:18 AM\nFinally!! Horde Mode!!\n\nWhat made me fall in love with 1 is finally available in 2. First game I bought when I upgraded to the Quest. Only game I didn't play! I used to load it up to check what the updates were then quit. Such a shame it took this long.\n\nHorde modes are awesome! The new locations rock! Love the \"boss\" on the levels too. Will be playing this a LOT!\n\nGet rid of that weird town thing with randoms wondering around and you got yourself a 5 star game! I want to choose a level and play, not roam around trying to remember where a certain game was. Nice idea, didn't work, stop it! \n\nKeep at it.\n\nHelpful | 18", "SinDonutsJun 15 at 7:52 PM\nExcellent shooter. Check this out.\n\nI avoided this one due to the bad reviews last year, but recently it popped up again and I read a bunch of 5-stars. And I agree!! Such a fun shoot em up multiplayer blast! Bots fill in the ranks and the multiple modes are great.\n\nI didn't notice any team death match, I'd love that option to play with friends vs bots or 2v2 private battles. If it's in there, sorry I missed it. I just played tonight mostly death match, some horde, and a few shootouts.\n\nWow, I'm spreading the word tonight to my friends about this game. So good. Well done with the updates.\n\nHelpful | 2", "TheQuaidsMay 27 at 11:46 PM\nMy Favorite Quest Game\n\nIf you might be interested in this game read the whole review.\n\nAfter the initial breaking in period for the quest, which is my first real vr experience. I played quite a few games, even the sideload games via side quest. But by far my favorite game is Dead and Buried 2. It offers 5 game modes and 21 maps, which is enough to keep you entertained for a while.\n\nMy favorite game modes are (in this order), shootout, death match, horde, and survival. There is another mode called Quickdraw but I never see anyone playing.\n\nShoot out has 2 teams playing on either side of a map shooting at each other. You can move around in roomscale to hide behind objects and other cover. The first team to 25 kills wins.\n\nDeath match is classic death match, you use the joysticks or roomscale (if using full roomscale you would need quite a large area) to run around a map and kill eachother free for all style. The cool thing here is you can get to the floor and shoot under, behind, and between objects to get the kill.\n\nHorde mode is similar to shoot out except you are killing zombie hordes coming at your team from all over the map. There are bosses and each wave gets harder than the last until you eventually lose.\n\nSurvival reminds me of the zombie mode in call of duty. You run around (again using room scale or joysticks on the controller).trying to kill zombies that spawn all while trying to move to the next area. Too many deaths and you lose.\n\nQuickdraw, which is my least favorite (although it sticks to the wild west theme of the game) just has two players face off in a quick draw match. While a few rounds may be fun, it loses its draw after a few rounds. I so hardly see anyone play it.\n\nEvery one of these game modes includes multiple weapons (except quick draw) to find around each map. However you always have the basic revolvers at your hip to use.\n\nMy only request would be to see if other players are playing a certain game mode in each area. The game is presented as a town in which all the game modes are scattered around. The further away from the starting point the map is the less likely real people will be playing. I doubt this will be an issue once many more people play this game at any given time. I'm not a big fan of joining random game to find out it is me and bots. If you don't see anyone in the lobby for a certain map just join and you may be surprised that you get matched up with other players.\n\nI really hope the developers will improve this game as time goes on. It is at the top of my list for games to play on the quest. The only thing I personally need is a large area to be able to run around in.\n\nI would highly recommend this game, I hope the developers continue to support and show love to Dead and Buried 2 for years to come.\n\nHelpful | 7", "wmarkfryeJul 2 at 7:32 PM\nHighly Underrated :)\n\nThe modes I have currently played are Deathmatch, Shootout, Horde, and Survival. The guns are very unique and fun to use. Grenade Launcher style guns such as the one shot are AWESOME. I will say, I was killed even though I was crawling behind cover in Shootout a few times, but, That might have been my fault. Overall, for people who love western (with sprinkles of steampunk and futuristic themes) style games, I would highly recommend this game.\n\nHelpful | 1", "Keyser_Soze._Mar 13 at 6:36 PM\nGood for price point\n\nOne of the first games I purchased. I still play this game today, and enjoy both the shootout mode as well as the Golden Eye like death matches, but I need to echo what others have mentioned in regards to cheaters. Developers need to fix this, or this game is going to die on the virtual vine. Also, new features need to be added to keep the interest up. A perfect time to fix the cheating aspect. I graduated over to Arizona Sunshine as well as Drop Dead, but this is still a solid game, and would recommend.\n\nHelpful | 51", "Ihrie4 days ago\nFun little shooter, but bring friends\n\nDefinitely a fun little shooter, And cant go wrong with the additional game modes that were added.\n\nThe AI bots can feel a little unfair at times but thats just an impression not sure if its verifiable or not.\n\nHowever still glad its an option as player population can be a bit of an issue.\n\nI dont regret buying it while its was on sale, but I do admit I havent been drawn back to play it as often as some of the other titles I own. Still though Id happily fire it up to play a few matches with friends.\n\nHelpful | 0", "JioxxApr 25 at 3:27 AM\nA rocky road to greatness\n\nThis game went from the first game I ever requested a refund for, to one of my favorite games.\n\nAt launch I didn't like it at all. It was sparse and confusing, not at all what I expected from the trailers. I requested a refund.\n\nAfter it had been through a few updates I gave it a second chance and really enjoyed it.\n\nAfter this last update it's a masterpiece.\n\nThe game plays incredibly well. If your stomach can handle it with all comfort settings off, and you turn with your body instead of the controller, you're in for an incredibly immersive experience.\n\nThere's a good variety of weapons, especially after this last update.\n\nThe levels and characters are beautifully designed. The cartoon style sets a great mood while helping ensure that everything runs well on the Quest's hardware.\n\nThe sound effects are excellent and the 3D positioning seems solid, even when using the Quest's built in speakers.\n\nClear as much space in your room as you can for the best experience.\n\nThis isn't just my favorite multiplayer shooter on the Quest, it's my favorite on any system.\n\nHelpful | 17", "pumkinjackJun 24 at 6:08 PM\nDead and buried 2\n\nThis game is my favorite game it's an absolute blast I love it sometimes it's a little hard to find matches but I don't care it's still an absolute blast.\n\nHelpful | 3", "f0xh0leMay 22 at 1:41 AM\nGreat shooter game\n\nI love this type of game, quick to access and gives me a quick work out bending and squatting.\n\nI like the shootout best but there seems to be more bots than real players.\n\nIt would be good if there was some sort of ranking or score building, if you choose bad guys it scores as most wanted and if you choose to be good guys it scores as most feared sheriff, ( my inner child coming out )\nThis could unlock features like weapons, clothing, create your own character.\n\nOther than that its a quick access shooter game that I play often and is worth the purchase but with the above features would make a five star game.\n\nHelpful | 0", "DoneByHandsApr 18 at 6:35 AM\nOculus Email 04/17/2020: Reloaded Update\n\nHello,\n\nWas I the only one to be excited when I read the Oculus email for this month's update? The D&B2 was advertised with a new update called \"Reloaded\" and the description read \"meet new gameplay modes like HORDES, SURVIVAL, and quickdraw. New maps etc.\"\n\nCould you have an official release date for this update?\n\nI love this game and having a horde/survival mode would be insanely good!\n\nThanks for your constant update and support,\nQuestlover\n\nHelpful | 17", "MaXiMuM-VApr 29 at 8:09 AM\nGood fun\n\nI didn't buy it a release so I can't speak to it. The reloaded version seems, very social, quick to get in, and good variety I was having fun immediately. It's that middle ground shooter I was looking for. It makes me feel like a kid playing Cowboys and Indians, I like how you have to use cover. I will be coming back to play more\n\nHelpful | 3", "randolph7778Jul 14 at 9:22 AM\nGreat shooter!!!\n\nSo far is the best game I have purchased. The mechanics are good and easy to figure out as you go. Only complaint is the maneuverability in battle but still absolutely love the game\n\nHelpful | 1", "aleks.pierce3 days ago\nThrowback to the Golden Age\n\nThis game took me way back to the days of playing half life deathmatch, quake, Doom, etc. It has the feel of an old deathmatch shooter in VR. My brother, sister, dad and I all bought this and play together and it's so fun. Deathmatch and shootout modes are the most fun for us. My only gripes are I wish there were more guns and a team deathmatch mode. Money very well spent!\n\nHelpful | 0", "NMaloyMay 8 at 11:28 PM\nAmazing foundation but a terrible lobby\n\nThe visuals and main mechanics are great but the game falls apart because of two easily fix I led flaws\n\n1) just add a quick play option so you will instantly be joined with other people. If you wanted to keep it in world then a birds perch where you choose your search options with a letter would still work.\n\n2) Can you copy the lobby system from Rec Room (including the high five to party up) as the circle system is confusing and doesnt work half the time.\n\nThese two flaws together tend to result in a game where people only play the map and mode at the centre spawn location as it so difficult to encourage people to spread out and try new maps/modes.\n\nHelpful | 0", "lightxcinemaJul 4 at 5:10 AM\nIt complete wack\n\nIts not even much to do it like to game modes kill people or zombies no story and bunch of wack I cant even get my money back\n\nHelpful | 2", "Thimbledorf-PwentMay 6 at 5:41 PM\nI want to give it 5 Stars but.....\n\nI love, love, LOVE this game. I want to give it 5 stars but it is so darn buggy. 3 out of 5 times I leave an event I have to quit the game and come back in to find my friends. Then there is getting kicked from the game in the middle of the event. Don't forget the screwy scores after a shootout.\nI bought this game after the update because friends that had it said the update made it so much better. I dont know what it was like but minus the bugs it's awesome!!! Please fix the bugs !!!\n\nHelpful | 1", "SamBamskyMay 16 at 2:08 PM\nLoads of Fun\n\nThe shootout is my favorite part of this game. Makes me wish I had a big play area. Quick, several minute, matches. Fun times.\n\nEdit: I changed it to 3 stars because I end up in BOT games. I will put it back to 5 if the devs can allow the option of playing without BOTS. I would prefer to wait for real players than play like that.\n\nHelpful | 3", "Slipknotmaggot44Apr 30 at 9:06 AM\nFun and friendly community\n\nThere's a good variety of both pvp and pve modes and there's always people on. With the recent update i think the devs should really add a match making system that will place you in a populated map based on the game mode you want to play, as it stands you have to walk around \"the town\" and check each map to see if there are players. Survival mode is one of my favorites but is far too easy to complete at the moment, the enemies need to be tougher and more numerous. Overall I'd recommend this game.\n\nHelpful | 0", "MegaFlopsMay 2 at 2:35 PM\nGreat fun!\n\nMy review before the update: I really love the shootouts, nicely done and absolutely worth the money. But please fix one problem that some cheaters take advantage of, ruining the game for others: it is possible to stick your weapon through a brick wall and shoot, while your body is still covered behind the wall - thanks!\nMy review after the update (Reloaded): Wow!! This update is amazing and for me more than doubled the value of the game. With 5 stars before I would now give it 10 stars if possible. But there is still a problem that I hope will get fixed soon: When you are in an Oculus party, your friends will be spawned with you into the same instance, thats working fine. Then you enter a map together and when you go back to town afterwards, you will most of the time end up in different instances. Workaround: quit the game and re-enter ... annoying!\n\nHelpful | 3", "ParadiseDecayApr 27 at 11:48 AM\nGreat Multiplayer Fun!\n\n1st Impressions Video with Commentary here:\nhttps://www.youtube.com/watch?v=9uOh2wJd_-M\n\nMy Initial Thoughts:\nI thought this was a fun game when it first came out over a year ago, I even played it on my back garden, now its even better and a lot more popular with the introduction of NEW maps, MODES and Weapons.\nIf you like multiplayer style shooting games, than this is for you.\n\nHelpful | 0", "ZedisnotdeadMay 2 at 11:37 AM\nGood game\n\nI just picked this up yesterday after the reloaded update. From the reviews and after playing it looks like the devs have completely revamped this game. I know people that play Arizona sunshine simply for it's horde mode.....if you are one of those people and want more out of that type of horde....with survival and the ability to walk around more with different environments than look no further....this is alot of fun\n\nHelpful | 4", "Nikko1965Apr 26 at 3:47 AM\nGreat game\n\nEdit: The new update makes this Dead and Buried II++. The new options are great, a few bugs and anomalies missed in Q&A to iron out but show me a major software release that doesnt have any. A definite buy for those who like shooting.\n\nKeep up the good work, devs!\n\n\nLove the shootouts but lets raise the kills to win to 50 from 25 (certainly in the saloon) or make the bots a bit crappier with their aiming otherwise its over too soon.\n\nYes, can be improved in many other areas but its a fair priced, multiplayer, no thinking required, well designed,\nWild West shooter. Oh, yes!\n\nHelpful | 4", "gabrskiller1Apr 7 at 3:37 AM\nWhy there is one map?!\n\nThe game is nice but you must to add new weapon and new maps\nAnd add new personal weapons\nAnd add new mods\n\nIf you add these things the game will be great and we will enjoy it and have fun\n\nHelpful | 9", "ChlasmaApr 25 at 12:22 PM\nLove it\n\nOne of the best graphics seen on the quest and both modes are unique and fun!! (EDIT: There are even 2 m9re modes by now!!!!!(\nWhat i would love to have is:\n- a seated mode for deathmatch (smooth turning and the guns furthe up to pick up)\n-a zombi coop mode to play in the same room with 2 quests\nEDIT: GOT IT!!!!!!!!!\nStill, more than worth the 20$ :)\n\nWow and THANKS for this AWESOME update!!!!!\nThis game is so freaking undertated.\n\nMuch love here :)\n\nHelpful | 4", "crazyluy14Apr 29 at 1:49 PM\nDead and Buried 2: Reloaded-Suggestions!\n\nThis isn't only a suggestion, but also a review.\n\nOkay, with that out of the way, I want to suggest something. MELEE WEAPONS! When I first picked up the axe, I thought it was a melee weapon, coming to my disappointment, it was throwable. Now, I'm no game designer, but if you guys would add this, like a bowie knife or something to keep with the theme would be great!\n\nAlright, I love this game. The idea of having a lobby with players that you can talk to before jumping into a game is great! Except, if you just want to go to a game, and not spend minutes trying to find it, make a menu. But overall, I can stick with the game with the countless game modes and maps it has.\n\nIn this game, you can make friends, play with past ones, and have a good time. I highly suggest playing and getting this game, as I hope the devs will come to make this game perfect. Truly, you can add other game modes like capture the flag and team deathmatch, the possibilities are endless. Everyone would love this game and it'd be highly rated.\n\nHelpful | 3", "FutsziApr 28 at 12:59 PM\nBest multiplayer shooter\n\nHands down this is the best online multiplayer shooter on the quest. I was looking to buy this game but their were some bad reviews about this game so I waited. After update I heard its musch better so I decided to buy it and I freeking love it. When I wanted to play online shooter I always went to play rectoom and pavlov(its a bug infested something) but now good bye pavlov I hope I never see u again until u are in a working condition. So this game is awesome if u want to play something like cod than come and play this one. Sooo much fun\n\nOnly two complaints so far\n\nFirst sometimes matchmaking and its kick me out to the quest main menu\n\nOther is the aiming. I hope they will update this so we can male our aim more punctual. That laser helps but give us where we can aim I want some headshots lol\n\nHelpful | 3", "Lt.SALTYJun 7 at 7:52 AM\nDead and buried\n\nBought this game when I got my quest liked the look of it and the horde mode is fun but deathmatch is horrid..soo many invisible bots did not enjoy it looks like itll be a regret game that will always haunt me.\nDont think itll be played again on my quest.\n\nHelpful | 1", "StevePDXMay 23 at 9:07 AM\nAlmost 5 stars!\n\nThe new Horde mode is great. If a few western shooting galleries were added like the first version this could be one of the best games on the quest!!\n\nHelpful | 0", "JohSm67Apr 11 at 8:08 AM\nIts Ok, still needs polishing!\n\nThis game has potential as a multiplayer game!\nBut on the Rift S and Quest it dosnt look that good, should be more optimization put in to it.\n\nAnother reflection the visuals are way better Arms/Guns/Characters on the first version of this game! Still only on the Rift/RiftS maybe to be ported to Quest) Compare them and you will be amazed how much better that is on the Rift S\n\nIf you got a Quest go for it, its kind a fun anyway!\n\nHelpful | 2", "EdmCaperMay 5 at 9:18 AM\nGood game\n\nI've only played since the reloaded upgrade and it deserves a higher rating then it had before the upgrade . Would be nice if there were a battle royale mode because deathmatch starts to drive me a bit bonkers after a few minutes with so many people simply running around shooting everybody and respawning once dead . And seems like spookytown only has two game modes so far and would like to see more but otherwise can't complain much at the price point and options\n\nHelpful | 2", "AGeer452May 24 at 9:04 AM\nNeeds offline mode\n\nThe game is good and all but the game cuts out due to my crappy internet connection.\nall I have to say is an offline mode would be great!\n\nHelpful | 1", "hail2theking28Apr 27 at 10:38 PM\nBest multiplayer game\n\nJust buy it already,it's awesome, there are so many game modes that you will not get bored. A lot of people use it as a social app as well. This is eadly the best multiplayer game on the quest. Its also cross platform, so you can play it on pc as well. The devs did a great job on this game.\n\nHelpful | 3", "Scramble1981Apr 28 at 12:02 AM\nReloaded update makes all the difference\n\nI bought this as a first purchase last year and promptly refunded it. Just felt rushed and incomplete.\nThis update has added a huge amount and there is now a lot to do. It looks and plays good.\nA lot of fun and the developers have made a very good game.\nI would like a death match game that was slower paced, such as where you only have one or two lives before elimination.\nRecommended.\n\nHelpful | 2", "MyNamesNotZeldaMay 10 at 4:50 PM\nReturn to form\n\nWhen i initially saw this game strayed away from its original premise in DB1 I was very let down and even avoided purchase. The concept of a standard quake-form VR team shooter, while enticing in and of itself, never appealed to me as Ive never been able to fully get over VR motion sickness, as well I didnt feel it fit the DB branding very well. I am happy to say with the new update I was convinced to discover old favorites from DB1 like horde and QuickDraw, now playable on the new quest platform- as well as shootout death match and survival- this game is one of the largest and well polished games the quest has to offer. Using its art style well to mask the lack of power on the quest, its arguably the best looking shooter on quest- even looking better than DB1 did at times on my gaming PC. All in all its a great package for the price, not many other games have the same value proposition when it comes to shear content. The community formed is also very friendly and eager to welcome newcomers to the space. I highly recommend this as a starting point for anyone looking to expand their quest library the right way.\n\nHelpful | 1", "BennyHaunna3Apr 24 at 1:11 PM\nDevs Please Look!\n\nFor being one of the only online shooters on quest, its really good, there a a few changes I think should be made though. Here is a list:\n\nCustomization/Level System: There are so many different types of revolvers you can have, but its frustrating that I have to keep restarting the game until I get the one I want. There should also be more characters that you should be able to play as instead of just the default boy and girl. I know that other people see you differently but there should still be more that you can actually see yourself play as. Maybe there could be a level system that lets you unlock more custom features, like gun skins, playable characters, different revolvers, it would just make more people come back to the game.\n\nEasier Matchmaking/Finding: Make it easier to find matches. I have to go around the whole town and I forget where things are. Also make the shooting range easier to get to instead of having to do the whole tutorial all over again.\n\nMore Modes: There are only two modes and it even says in the description of the game that they will update it often. Add maybe like a Team Deathmatch or explosives only, something like that. There are plenty of maps on the game, if you do add more that would be cool though.\n\nThis game is fun, I just think that if the Devs add more things I would keep coming back to it. So please add these things!\n\nUpdate:I think they saw my review, thanks XD\n\nHelpful | 2", "Hurcules_0615May 22 at 4:49 PM\nPlease add zombies\n\nIt would be a legendary game if this had a zombie option\n\nHelpful | 0", "Patmant10Apr 23 at 10:17 PM\nDead and Buried 2\n\nIn my opinion this is one of the best oculus games out. Fast paced action, good fun all around. Even better after the update!!!\n\nHelpful | 7", "Icarus-Has-FallenMay 28 at 12:54 PM\n\nIn my opinion its one of the best games on the quest. I got it about 2 weeks before the update came out and i must admit that before the update it was a little empty. Afterwards though it has so much to do. I could litterally play for hours. The online comunity aspect of it is really what makes the game for me. Most of the comunity is nontoxic and will help you learn. I was lucky enough to meet the regular group on my first day in the game and they helped me get better by repeatedly kicking my butt. (In the kindest ways.) I give this game a 13 out of 10.\n\nHelpful | 0", "Jockel58AApr 26 at 2:18 AM\nBad Update \n\nAfter Update the game is not the same as before. There are now many many bugs. 1. New weapons must time does not work. 2. Old weapons sometimes cannot shoot. 3. Special weapons are too high or too deep from ground. 4. Sometimes bots are invisible. Then the projectiles coming out of the ground. 5. Sometimes, when you logged out of s match, you materialised in an empty lounge, of course there were much people before. Finally when you go into a match again and immediately back to lounge, the people are back.\nI wish, to have back the old not updated game. Then you got 4 stars. But now only 2 stars.\n\nHelpful | 2", "SilverEvoBobMay 12 at 6:49 PM\nNeeds some work\n\nConcept is good but it doesnt feel finished. Reloading doesnt always work which is very frustrating in the heat of battle and there is no easy way to play with friends.\n\nHelpful | 1", "Baldyboy007May 13 at 5:50 AM\nGreat update!!!\n\nHas this since it's first iteration but ultimately played it very little as their wasn't much variety or ways to play with friends except randomly. This is the 3rd update I believe and now the games has quadrupled in size and quality and is now my go-to game with friends. Good variety of game modes and a brilliant social aspect. Love this game can't rate it highly enough! Don't sit on the fence just go and get it!!\n\nHelpful | 0", "caleb.boling.583Mar 17 at 11:54 PM\nStart\n\nI feel like yall rushed the game to get out with the quest and rift a little bit it has a lot of potential if you make it where you can upgrade your weapons add a trophy system to it and a team/party mode on it has a lot of potential ima keep the game for 3 weeks hopefully yall will have a update in the game to add something instead of different maps and yall have the shooting mode I get the concept of the game but you can at least add it where you can edit your character and guns and add a coin system and maybe a zombie mode like the first game/horde mode, if all this is done I will change this to a 5 star review but if part of this is done Ill make it a better review but thats why I put it as a 3 star review it has a lot of potential and I feel like its in like a beta test mode.\n\nHelpful | 4", "FeralCouchApr 26 at 11:22 AM\nGetting there\n\nCompared to the first game, it's obvious this was rushed out the door in order to be released at launch. The core mechanics are there, shooting and reloading feel really good, but the content and UI are not. There's no menu or tutorial, just random maps you have to stumble upon in town. Because of this, people usually just gravitate to the nearest map they see so they don't have to walk as far. Why not add playlists? Why not let us pick our character model? Why get rid of a co-op mode from the first game? There's just a lot missing from this title. And although the devs said more may be coming in the future, it's just disappointing that this is what we got at launch comparatively (maybe I just expected more from the actual Oculus studios team?) Since there's no obligation for the devs to update I fear this may be as good as we get, but I hope not because theres a really good foundation to expand upon.\n\nEdit: updated score based on April 2020 update\n\nHelpful | 1", "DeepStateAliensApr 24 at 10:01 AM\nNew update is awesome, worth a purchase!\n\nUpdate 4/24:\nSeveral months after originally purchasing the game, I was ecstatic to see that a new update was released. LOVING the changes. Horde mode is a blast and I no longer find myself wishing the original Dead and Buried was ported to Quest. I can now choose my Avatar, play additional modes, there are new weapons added, and plenty of people are online playing now. This game is finally worth the asking price.\n\nThanks Oculus for the update!!!\n\nNew Bugs/Gripes:\n\n1. I wish there was a mirror or some way to see the avatar on yourself when selecting - all I can see is the little profile picture of each, but I dont know what the full avatar looks like.\n\n2. I encountered a bug playing Horde in the Theater map. I was the last one alive in my team, and zombies had come past the barrier to my left. I was shooting them directly in the head point-blank, but they would not take damage or die so I lost the round.\n\n\nMy Original Review:\nIt honestly feels unfinished, shouldnt have been released in this state. Needs:\n- Character selection / customization\n- More weapons\n- More game modes\n- Additional / better maps\n- Smooth turning option\n\nHelpful | 0", "xfender93xJun 30 at 3:48 PM\nFuc*** lame\n\nNot worth the money\n\nHelpful | 1", "Vr35738May 1 at 4:30 PM\nBest for multiplayer\n\nAfter seeing the recent updated reviews from the user I decided to purchase this game , YES I love this and so does my kids , great for multiplayer, a must buy !!\n\n- must try shoot out on multiplayer, it will make you sweat , my knees and back are giving up .\n\nHelpful | 1", "ARCHMOWiEMar 12 at 1:26 PM\nFun at first\n\nI enjoy this game for its death matches.However; they have pretty much abandoned it. I havent seen so much as a update in ages. The first one was way better fighting waves of zombies, and had way better weapons ( Bow). Even upgradable weapons would be better. How about a ranking system something. This game is Dead and Buried. Only game on the quest that has seen absolutely no updates as promised. Just rerelease the first one. Had way better gameplay, and didnt focus on a multiplayer that you cant rank up, or unlock anything. Basically put out completely unfinished, and have showed no interest in anything with it.\n\nHelpful | 9", "Dark-invaderApr 24 at 9:36 PM\nSuper awesome game!\n\nThe game is fast, fun, and full of action and with the new update, it's going to be even better. It's my favorite shooting game on quest. I highly recommend it to players who want action, shooting and exploring. Try and you won't be disappointed unless you have a problem with quality.\n\nHelpful | 0", "jayisspillz94Apr 30 at 2:10 AM\nGotta move to groove...\n\nI like this game alot i gotta hide to survive and aim to win great game multiplayer is fire and the update filled in all the holes that were missing good job devs......gimme moooore!!!\n\nHelpful | 2", "IamRanApr 23 at 12:28 PM\nTons of maps and great gameplay\n\nWith the options to either full motion or classic stand and move, this game is great!\n\nLast eat updates adds tons more content and play modes, bringing back the same game play that was loved in the original.\n\nHope everyone jumps in and well have a great multi-player for years to come.\n\nHelpful | 1", "turtlehedgehogApr 25 at 9:14 AM\nGreat\n\nI bought the first one and refunded it as it was nothing like the old one. But then reloaded came out with tons of new maps, characters, and most importantly all the modes from the first one and a few extra. I have so much fun now playing it! Definitely recommend buying it.\n\nHelpful | 1", "AmlbuzzerApr 28 at 12:53 AM\nOutstanding\n\nSeen all the reviews since the update and thought why not , very happy with my purchase , hopefully many more will now buy this game to reward the developers with their hard work.\n\nHelpful | 2", "Son-of-a-GunDec 19 at 5:54 AM\nFun game except for the cheaters\n\nI love this game, especially the shootout, deathmatch makes me nauseous.\n\nDevelopers need to fix the ability to cheat. So many people are hiding behind stuff and reaching their arms THROUGH the virtual solid objects like barrels, walls, and beams.....even some of the bots do it. You can sometimes see their faces peek through the object also. This needs to be made not possible as it makes it impossible to kill the cheaters. Everyone should have to shoot around and over objects. The way it is now makes it not fun anymore as more players are hip to this cheating glitch and are destroying honest players.\n\nPlease.fix it!!\n\nHelpful | 222", "WajanaMay 5 at 5:12 PM\nWorth for Price\n\nAfter update the game very smooth and nice graphics\nYou can enjoy the game with friends in different maps and mode . It is addictive :)\n\nHelpful | 2", "Richimax10Apr 23 at 10:24 PM\nRichimax10\n\nTruly one of the best multiplayer shooter vr game on the market right now.. It's a must have.. Love it.\n\nHelpful | 4", "WentlleApr 24 at 10:10 AM\nSo good\n\nFuc king brilliant\n\nId love to see, classes, capture the flag mode, Payload mode, and capture point mode. But thats a stretch.\n\nHelpful | 3", "YahzirusApr 23 at 2:03 PM\nThe game Uninstalled it self\n\nI downloaded the game this morning using my limited phone Hotspot. This evening when I started to play discovered no app and now I'm out of hotspot and can't even download it. Smh thats ridiculous\n\nHelpful | 1", "TOXICMUSHROOM666Apr 24 at 10:51 AM\nReloaded is awesome!\n\nOk, this update made this game a must have. The new survival mode is my favorite and its awesome that you can select your character. The new variety of weapons is amazing! Just get this game.\n\nHelpful | 1", "Aaronb3434May 1 at 4:44 AM\nCool\n\nAwesome! thanks for the new and improved update, look forward to more from this developer and more content and improvements for this game.\n\nHelpful | 1", "dante.cerasuoloApr 30 at 8:27 AM\nReloaded update!\n\nIts way better than last time since the reloaded update has came out. It may have 3 stars but it deserves 5.\n\nHelpful | 1", "LayDownBoyJun 12 at 7:36 PM\nLay down boy\n\nI see what you're doing lol nice try\n\nHelpful | 0", "bradtshortridgeApr 23 at 11:12 AM\nSimply the best multiplayer on quest\n\nVery well done and fun multiplayer shooter.\n\nHelpful | 2", "shane.wilkesMay 4 at 5:13 PM\nBrilliant shooter\n\nSo much fun!! That is all, must buy for online with your mates\n\nHelpful | 1", "goodbyeDeskMar 6 at 5:52 AM\nNeeds MATCHMAKING - No Love From Devs\n\nGamePlay: 4.8 out of 5\nVisuals: 4.5 out of 5\nExperience 2.5 out of 5\n\nThe only way I can safely play against people is to play the Town Map. The one that is right there when you load the game. Other wise, I'll play AT LEAST half bots and they aren't fun. Neither is playing the same map all the time\n\nSimple SOLUTION: Have the maps CHANGE at the end of a round\nOR just have 1 portal for death-match for random maps and 1 for shoot out with random maps as well.\n\nHaving to walk around to play other maps is the worst design choice and can be easily fixed!\n\nThere is alot of criticism for the game in the reviews but the game is actually only missing one thing! MATCHMAKING\n\nHelpful | 19", "XxPaperStackxXApr 22 at 1:39 AM\nNot what I thought\n\nJust as the title says this games is not what I thought it would be. I'm trying to get a refund now but honestly can't figure out how\n\nHelpful | 1", "Micardi81Apr 24 at 4:15 PM\nGood game getting better!\n\nGreat multiplayer! Fun levels, many weapons , adding horde mode just makes thebgame even greater!\n\nHelpful | 0", "EC4Apr 27 at 12:48 PM\nWaste of $, Not for kids\n\nWasting money on this game is an understatement. Feel cheap. I did get to listen to a bunch of sub teenagers practice using the C word and other fun things that kids do to think they are cool though.\n\nHelpful | 1", "Wario_FartsJan 17 at 12:50 PM\nVery Fun and Exciting\n\nThis game feels like your in a old western movie. Thats nothing like being in a bar shootin people. I like all the weapons to choose from. When you start you have two revolvers at your waist, but you can search for weapons like a shotgun, a gernade launcher, and a gun that shoots 3 bullets at a time. Overall the game is incredible to play and is fun to hide behind objects to hide from bullets. Also a quick tip the orange levels let you move around but the blue is the where you hid behind objects.\n\nHelpful | 4", "K9kingMar 29 at 3:15 PM\nDon't like shootout\n\nThe reason I don't like shootout is because you can't move. Other then that they should add a customize character menu so it isn't random and a story mode\n\nHelpful | 0", "tareqausJul 15 at 4:37 AM\nBest game\n\nThis is the best game in Oculus quest. I have played many games. But this game is totally different and very challenging. I think, everyone will enjoy the game play.\n\nHelpful | 0", "BluehailXIOct 29 at 12:27 AM\nREAD PLZ AND THANK YOU\n\nThe game is amazing, it gets addicting to want to keep going and going but after so long you stop and realize and think \"what am I doing, there's no progression\"(all the time I'm putting in and .im achieving nothen).( pretty depressing) Which makes the game's longevity short. Cause people just ganna stop playing. And to be honest the game is great!!!! In its own way as a shooter. So I would like it too last long time. So what I would love to see happen and wish would happen is you guys create experience / level system and the people on the winning team gets a certain amount of experience and the leader of the team(score leader)maybe get a little more experience then the rest. AND!!! You create RANKS separate from your level system,that were given more we play. Ur level will represent how much you play and your skill level slightly(cause u still have to be on the winning team). And the ranking should represent how consistent one plays/an scores high overall with matches(or somethen like that or along thoughts lines)you guys are the brains so im sure ur picking up,what I'm putting down. U put both of thoughts ideas in the game. The game would be INCREDIBLE!! An the life span of the game would increase so much.\nPS. PLUS IT WOULD MAKE IT FILL MORE OF A REAL/FULL GAME. A community would grow with it. Sorry for rambling and thank you for your time.THE GAME AMAZING AND ROOTING for it too grow.\n\nHelpful | 113", "Marked-By-CainDec 28 at 3:23 AM\nGreat but could use a couple upgrades\n\nThis game was one of the first I got for my quest and I originally thought itd be a campaign style game with a story so I was surprised when it was just a massive death match.\nThe game is great but could use a couple more features, having seen videos of the first game having a horde mode would be pretty cool, definitely more maps and picking and designing your own avatar would be good. Being able to pick features for private rooms would be good too.\nEven though theres more potential for the game its still a great buy, really good inclusive community on it also.\n\nHelpful | 7", "serhiidziubaMar 1 at 12:58 AM\nFun but dizzy\n\nBest game for VR what i played so far!!\nNice atmosphere, fun guns and great gameplay.\n\nThe only problem - is it makes you dizzy during deathmatch. But this is better than if it was boring but good for feelings :)\n\nHelpful | 3", "hightechfoolDec 30 at 5:47 PM\nReally fun... seems like a beta\n\nDeathmatch is WORTH buying this game! Not many weapons...and you can't even jump in-game lol. Plus you can't really join parties with a friend or anything. Not many features, but the mechanics and levels are a lot of fun. They already said they're adding more too, so really glad I grabbed it.\n\nHelpful | 5", "amir.chidiacMar 27 at 9:41 AM\nHi\n\nBye\n\nHelpful | 5", "poyrazzzaa12May 3 at 3:09 PM\nDB2 RELOADED\n\nGood.\n\nHelpful | 1", "BoyosialMay 1 at 10:11 PM\n\nLove this game\n\nHelpful | 1", "roro512Apr 25 at 11:21 PM\ngreat game\n\nthis is the best shooter for vr\n\nHelpful | 0", "adrain.homesApr 28 at 6:21 PM\nWere are my people?\n\nWere are the more black characters?\n\nHelpful | 4", "mdkrushNov 26 at 11:58 AM\nAny updates coming soon??\n\nI like the game. It's fun run and gun shooter. It's getting a lot of bad reviews, but I hope this is not the finished product... More maps? Better friend support?\n\nI really don't like getting stuck with an avatar with no choice in the matter... It doesn't even let you choose your gender... Really???\n\nHelpful | 25", "cpattonzApr 23 at 9:50 PM\nThe update I have been waiting for\n\nI fell in love with the first dead and buried on rift a few years back and was so excited to see there was going to be a dead and buried on quest. After receiving the quest and realizing this game was stripped and was not like the first one I held off. Then after I heard about this update I was in shock and super excited to check it out. I just wanted to say thank you for doing an amazing job on this update and bringing my favorite game back. Totally worth the wait. Great game overall and if your a fan of shooting games this is definitely one to pick up. Thanks again for this update and look forward seeing you all inside the world of dead and buried.\n\nHelpful | 6", "RoofissDec 26 at 10:16 PM\nNeeds more\n\nGood game overall. Right idea. Not enough content to really keep you coming back. Not enough guns. No leveling system. No unlocks. Minimal amount of maps and game modes. This could be a really good game and could have been a must have if it just had a little more to it. I m no developer so I'm not sure if the Oculus system hinders this ability because it doesn't have the memory, processing power etc of the PC or big gaming systems. But I hope to see this coming in the near future. This is what everyone wants to see happen I think. Take Xbox/PS4 games and put us right in the middle of them. A full major system(PS4)cod version in vr would be amazing. Let's see this get better quick please!\n\nHelpful | 9", "HotBushMeatJan 29 at 7:12 PM\nDead and Burried 1 Way Better\n\nThe developers should have chosen a different name for D&B2. Its nothing like D&B1. No zombie boards or one on one showdown matches.\n\nUPDATE. TO DEVS. When will the undead rise again? Do you have a timeline? I keep checking every day. Add the dead and the showdowns, and this instantly becomes my favorite VR game. Id gladly pay!\n\nHelpful | 11", "sheppie73Apr 27 at 3:34 PM\nFun shooter\n\nNever having played the original due to the poor reviews I past this one by until the new updated was released.\nA great fun game with plenty of variety, array of weapons and game modes, well worth the purchase.\nPersonally i would like to see higher but slimmer defences in Horde and shootout modes to prevent the need to drop to your knees as mine aren't as good as they used to be.\nThere was an issue where myself and or team mates would become invisible after returning to the town. It seemed to be random who it affected and who could see other players but audio communication continued.\nAll in all a good solid game that still has plenty of potential.\n\nHelpful | 0", "REZOCHEDMay 18 at 4:55 PM\nAmazing\n\nWith the fact that this game is awesome. I love the zombie game mode (survival). I never played part one and people say part one is better than part two but I have to say that this game is amazing when it comes to the idea of getting to attack and play with friends\n\nI do have to say though that graphics arent 100% but it is still amazing its a social game that you get to pvp against other online people.\n\nHelpful | 0", "WEARELEGIONI4NIJan 16 at 8:57 PM\nGreat game\n\nI dont know why this game has got 3.7 stars Ive had a lot of fun with this game and the social environment in it too is just hilarious, hard to get sense through to people you want to play a deathmatch and them to follow you, but its a great game. Really entertaining, I hope other games can follow this games footsteps\n\nHelpful | 3", "PhotosN360.comMar 13 at 8:11 PM\nNew 2 VR & LOVE this game\n\nI think this is powerful. Don't know too many other games. I have over 7,000 Skydives & this is as close as you can get without a re-pack.\n\nHelpful | 0", "APPARISFeb 28 at 2:09 PM\nMULTIPLAYER\n\nAMAZING but id like play with my party how con invite my friends to play ?? Is it possible ? Thx\n\nHelpful | 2", "Poovy23Mar 1 at 1:44 PM\nAdd so you can play with friends\n\nIt's a fun game but I got it just so I could play with my friend but you cant and that's really annoying. Also you need to add more guns and some different modes.\n\nHelpful | 2", "AfricanNinja2Jan 2 at 5:59 PM\nMost fun game on quest imo\n\nThis is one of the few games that is full multiplayer and not co-op and i love it. I just love the feeling pulling off some plays in both gamemodes.\n\nAllthough its either the game or the VR, but when sometimes i take it off, the screen kinda resets and im WAY above ground and im having a harder timer hitting my targets but they an easier time to hit me, tried with a friend and he had way easier than me\n\nHelpful | 0", "SHADOW759Jan 14 at 6:11 PM\nWhat Happened???\n\nThe Go/Gear vr version is great, but this version is garbage. What happened ??? How about updating to bring the dueling back to this version ? Also the other features instead of kids running around aimlessly shooting everything insight. STUPID!!!\n\nHelpful | 6", "lastexplorerJan 15 at 9:39 AM\nHow to play?\n\nVery fun shootouts in teams but I cannot figure out how to play, reload, switch weapons, talk to teammates or enter other shoot outs or enable locomotion. No guide in the game or online. Want to play but cant! Need a guide!\n\nHelpful | 2", "lzuku_MidoriyaDec 31 at 4:40 AM\nThe game is great but....\n\nI love this game it is really fun but there is not enough variety of types of games and weapons. There is only deathmatch and shootout for game modes and for guns (not including what you pick up in game) you have two pistols. I honestly think there should be more added to this game.\n\nHelpful | 0", "Skyhawk613Jun 27 at 8:57 PM\nOk\n\nOk game!\n\nHelpful | 0", "basementjackJan 1 at 11:46 AM\nloved the first, hate this one.\n\nI loved the first one on Oculus Rift - I wish they would port that one and bring it here - dead and burried (original) was a simple wave shooter you+up to 3 more people vs the AI.\n\nThis game just didn't do it for me - I suck too much to play against real live players, I just get shot and there's no fun in that. I also didn't care for the interface.\n\nHelpful | 6", "bonezmusicNov 16 at 12:54 PM\nGreat game but horrible environment\n\nI was told by a friend that I should download and try this game. Seeing that I had the first version on oculus go I went for it and when I first entered the world it was amazing until I had my first encounter with real people. I was berated by a group of people as soon as I came in contact with them and before they even knew me. They instantly said many negative things about my name then the fact that I was sitting at home using my oculus they tried to say that I have to stand or else basically they would harass me then one guy heard my talk and immediately assumed I was black and started to make racial comments not only just about me but he said some racial things when he came in contact with an Asian and a Hispanic because of their names calling someone a wetback bean eater because their name is Pedro is horrible. I come to vr to have fun an escape from the real world once in a while. I'm starting to reconsider if it is a good idea now. Their needs to be ways to handle situations like this to make it a safe and more comfortable environment for everyone. Vr should be a place of the future where everyone won't have to worry about that type of hate and persecution. Other than that I enjoyed the game but please work on features such as blocking, kicking, and harassment reporting. Bullying is a true problem and then to realize how many kids could be in here in the future and have to maybe deal with that in here. It would be nice if they hired someone to be in these games full time to keep an eye on these things .\n\nHelpful | 20", "boosco2000Mar 21 at 9:29 AM\nDead and buried\n\nTerrible. I wish i never bought. Every time I play this game I get nauseous. The graphics and motion arent great and make u feel ill. I dont know how people get good at this game\n\nHelpful | 4", "thiccermcsnickerJan 20 at 7:33 PM\nTHIS GAME IS TRASH\n\nIf I would be able to give it no stars it would happen, not worth your money boring no one is fun played for 20 min and it won't allow me a refund this game is trash\n\nHelpful | 7", "GreenMouthwashDec 26 at 2:00 PM\nAwesome game. Needs horde mode\n\nThis really is a great game that you'll end up ducking, crawling, and squatting through. I tried leaning on the in-game crates and pillars a few times already from running out of real-life stamina. Shootout mode is the only playable mode for comfort players regardless of the vignette settings. I'm completely fine with this because of how great shootout mode is. This game only needs a horde mode and more maps. Assuming both of those will come eventually, this is a must-buy 5 star game.\n\nHelpful | 3", "tinymanmyboy1Jan 2 at 4:41 PM\nGood game just needs more content\n\nI'm enjoying the game fun I wish they had a team deathmatch game mode maybe a way to pick your Avatar and a way to report people I was playing the other day against some one who was invisible and just kinda ruins the game for everyone. As it stands right now it's a good online multiplayer shooter just need some new updates and more content but it's all we have right now so if your looking for a online shooter go ahead and get this game it's not bad and can be really fun\n\nHelpful | 2", "leh3Dec 23 at 11:02 PM\nGood\n\nWhen you start playing you thinks it ok.\nBut after a few games I really, really enjoy it.\nOK for the price. If you like a multi shooter it's a good game to get.\n\nHelpful | 3", "SamaritanManJan 1 at 11:45 AM\nThis is the game I play the most!\n\nThe fun that this game offers, fully justifies the purchase of a Quest.\nThis game is an endless fun, which is experienced together with many other players from all over the world.\nThe realism and precision necessary to acquire an ever more perfect aim are truly shocking and there is no difference with our reality.\nBy playing this game you experience unique emotions, made of tension, fun and a lot of adrenaline.\nWowww!\n\nHelpful | 2", "psully4114Jan 8 at 2:43 AM\nI don't have anything negative to say\n\nIts a great game. Its a lot of fun. Its smooth and responsive. I can easily get in and play with my friends. The art direction is cool. The gunplay is nearly perfect. I would like to see this studio develop a title with some swordplay and this level of polish cause its just great. The character models are kinda goofy cause they look in 2 different directions but that just adds to the charm for me. The art style kinda reminds me of old playstation games. Not the graphics, the graphics are great. I would like to be able pick my character but theres more than enough here to keep me coming back. Lotta fun. Can't wait to see what's next.\n\nOn a side note: I saw somebody make mention of implementing teleportation in this or snapping and I get that there is a group who is susceptible to vr sickness but to those of us that have been playing VR for a while and are not prone to motion sickness this is perfect. I want more games like this please.\n\nHelpful | 2", "Simme63Feb 11 at 8:49 AM\nHow to get a locomotion?\n\nI dont get it! Hos do a get a locomotion so i can joy dead match\n\nHelpful | 2\nDeveloper ResponseFeb 26 at 11:53 AM\n\nHi you can enable locomotion from the Settings menu in Town", "kingcodeMay 18 at 4:56 AM\n\nVery nice multiplayer shooting game. The recent upgrades make it worthwhile to check out again if you previously reviewed it.\n\nHelpful | 0", "neepsandtattiesDec 31 at 11:15 AM\nLots of fun\n\nGreat game that can be enjoyed in quick sessions alone or with friends. There isnt a story mode or campaign yet, but the multiplayer bots are smart enough to provide an enjoyable experience. The shootout mode is great for people who dont enjoy the fast pace of the FPS mode.\n\nHelpful | 2", "StMattrickDec 12 at 8:25 PM\nIts my fault?!\n\nI got sick and threw up less than 20 minutes into the game. I tried to get a refund. I was denied my refund bc not approved due to errors while attempting to reimburse the original payment method on file second time this had happened. It would be nice to get my refund so I could buy another game\n\nHelpful | 11", "MFroakieJan 8 at 5:30 PM\nIts fun but nothing to work for\n\nThere should be a leveling system like COD, where you unlock things for playing. Even if it were just gun skins Id be fine w it.\n\nHelpful | 2", "SharpGaming47Nov 14 at 6:47 PM\nBruh....\n\nThis is basically paying for a western multiplayer shooting simulator, no progression, no achievements, plain because of two game modes. I only got this game because the first one on my go was really fun, and this is a huge letdown. It has the potential but burns that potential quickly. This really deserves a 1 but it gets a 2 because of the gameplay overall. And dont get fooled by the other reviews, you will regret it.\n\nHelpful | 7", "ciib00mNov 8 at 8:15 AM\nWould not recommend at this time\n\nI got this game hoping for a fun shooter, and it was... for about the first 20 minutes I played. Its only multiplayer or bots, I wish there was a single player, maybe like zombie mode. This really sucks because the gameplay gets old and boring fast, and the death match is just motion sickening. I really expected more. If they added a single player mode and some sort of progression through the game I think it would be much better.\n\nHelpful | 8", "Virtual-LifeApr 25 at 5:45 PM\nThank You\n\nThank you for the latest update. Anyone who held off buying this, buy it! Please support devs that support their games.\n\nHelpful | 0", "BenUSA1Apr 25 at 7:10 AM\nI waited till update\n\nNow with this update, it is worth $20. Before was bad. Thanks to developers keeping the series alive.\n\nHelpful | 1", "HollywoodDR0Nov 9 at 12:22 AM\nBest Multiplayer on Quest so far\n\nI think the MP is great! It does gets repetitive especially with no overarching progression or levels or anything more than the game modes and lobbies for them. Still worth having especially for anyone who wants an online multiplayer shooter.\n\nHelpful | 6", "PortlyPigletDec 16 at 6:00 PM\nJust plain boring\n\nThere's just not much to this game. Also the way the town is made, only one of the lobbies ever has any people\n\nHelpful | 5", "BigManWotNov 30 at 4:17 PM\nAddictive fun!\n\nGreat game, very addictive with good maps! Would like to see some achievements in this game, e.g head shots in a single game, kills in a row ect. Would like to see how many head shots you did when the game ends and how many times you killed each player and they killed you. That would be very interesting to see. Also to be able to get more than 26 kills as the game ends as soon as you reach that. Having 3 vs 3 or 3 teams of 2 would also be a lot of fun. One bug that's gets annoying is the invisible bot running round, only sometimes. Everyone has to leave the game for it to disappear. Overall a great game.\n\nHelpful | 2", "jimmyjam5000Sep 22, 2019 at 5:22 PM\nEmpty, but promising\n\nI dont understand this game. Theres so much potential. It has a good theme, the basic idea is solid, I can move around freely if I want to.\n\nBut there are some things that make me quit the game instantly and play something else:\n- no one is playing it. Almost every time I get on, its completely empty.\n- there are only pistols and grenade launchers. Those are the most boring guns ever. Give me a machine gun, a crossbow, something other than a pistol!\n- shoot out and deathmatch is so boring. Its repetitive and its lack of variety only adds to the staleness.\n- there doesnt seem to be any sense of design in the maps. No good choke points.\n\nThose points may seem overly critical, but its just the way it is. It has a lot of promise. I still check back from time to time to see if they improve on any of these issues.\n\nHelpful | 39", "c0mm0n.EXEDec 21 at 4:50 PM\nGreat game\n\nI love the game but im wondering if you can change the character\n\nHelpful | 3", "troy.gilbert.88Oct 25 at 12:13 AM\nGreat game\n\nGreat multiplayer shooting game, I did find the reloading takes a bit to get used to but overall works well.\nI am disappointed you can't jump or climb over anything, this would make it a much more versatile game.\nAlso bigger maps, customizable characters and a story mode would be awesome.\nGreat game, one of the best PvP shooters I've played on VR\n\nHelpful | 1", "Jfallred22Dec 26 at 5:18 PM\nShootout is epic\n\nMy sister and I LOVE shootout on this. The technology here is incredible. More maps would be great and maybe a 4v4 or 5v5\n\nHelpful | 1", "tistethebeastDec 29 at 11:53 AM\nReally fun game with friends.\n\nI love the shootout mode. Great to show people what vr is without them getting motion sickness.\n\nHelpful | 1", "okkiDokkiOct 23 at 6:26 PM\nLack of game modes\n\nOculus...wtf. I know you guys claim to want to add more but where the hell is quickdraw?! And the sniper rifle? And all the other things that made this game entertaining. I feel like I'm playing a demo in its current state. I don't feel like I'm getting my money's worth in content right now and I wish I could refund and possibly repurchase when more content is added but hopefully you guys keep to your promise. It was entertaining for the first few hours of play, but honestly became stale with the same 2 game modes and maps that feel like so-so versions of the first games maps.\n\nHopefully this game gets better, I really want to enjoy this like I do on my rift\n\nHelpful | 5", "KrymBaltimoreOct 5 at 9:03 PM\ni love it\n\nthis is one of my favorite games on the quest. there's usually enough people to fill the rooms with actual human opponents but, if not, the ai is challenging enough to keep it exciting until people start to come in. i like the way you don't have to teleport. i think that breaks the immersion and makes it hard to really enjoy a lot of otherwise great games. this is smooth and responsive. whether i am last or first place, this game is a lot of fun and i end up playing way longer than i intended to more often than not. that being said, i would give 5 stars if you could choose your character and maybe even personalize it too. don't know why the devs chose not to add that option but it definitely doesn't take away from the overall experience. every person i talked to who has this game says it's either one of or the favorite game they have. if you like shooters and you're on the fence, get it. you won't regret it.\n\nHelpful | 8", "CSpaansDec 30 at 8:32 AM\nWell worth it\n\nThe old reviews put me off buying this but took a leap of faith and WOW!\n\nHelpful | 2", "CrimsonAvengerSep 20, 2019 at 6:15 PM\nInvisible bug kills this game right now.\n\nThe game lacks any tutorial or instructions. Makes it hard to ger started. Limited game modes. Onl Deathmatch and Shootout. Shootout is boring. You can't move just duck and fire. Deathmatch is ruined because there is a bug that can make one player invisible. I can get past the other issues, but invisible players destroying everyone else is too much. If this gets patched I'll giveit a 3rd star. more games would add another strar. Right now. its lacking.UPDATED: Tutorial was added. Haven't experienced invisible player or invisible gun glithches since patch. Still need easier way to change between maps. bumped up to 3 stars.\n\nHelpful | 9", "Ayrton_JerryNov 26 at 1:57 PM\nSweat stains\n\nVR is so fun, and I've owned a system for 3 days... But the sweats on this game are hilarious \n\nHelpful | 0", "FrenchHornManDec 26 at 5:12 PM\nGreat\n\nThis game is so goooooood\n\nAnd its not over priced\n\nHelpful | 1", "griffieboiNov 16 at 8:05 PM\nWhat the heck!\n\nThis game is call DEAD and buried making everyone think its a zombie shooter. Please at least change the title!\n\nHelpful | 8", "FilippsnOct 11 at 4:03 AM\nNice concept but boring guns\n\nI like the concept of this game, but please please please update some cool guns, Like a machine-gun, pump-gun and some other maybe crazy but not existing guns which have more power and more shots. If you think this is not working maybe you can create an extra room, for people who prefer big guns\n\nHelpful | 2", "invisibledig266Dec 4 at 6:01 PM\nSooo much fun!\n\nIts a simple run and gun multiplayer game but its more fun than Ive had in a long time. Simple to pick up and play. I love it!!\n\nHelpful | 1", "Zenik77Sep 30 at 7:14 PM\nNeeds more modes\n\nGame is $20 your oculus go game is $10 has better modes and more things to do. Will give five stars when u add horde mode or just more modes in general. The death match mode is ok but bots are too good and know one plays online. Please add some kind of stody mode even if it's just 12 levels. Or a horde mode with option for multiplayer, survival and general waves. Drop dead is less money than your game and currently offers so much more dont want to refund this games even just message back and let us know your adding more modes to the game.\n\nHelpful | 9", "Builderexpert07Nov 13 at 2:27 PM\nGood but.....\n\nIt is a little glitchy. But is fun!\n\nHelpful | 3", "joker1439Sep 2, 2019 at 11:25 AM\nPLEASE!!\n\nHey I really like this game, I also have it on the go, my only gripe is that you dont have a choice to what gender you wish to be. In the lobby part of the game guys try to hit on me bc the think Im a female and its bc Im dressed like one, please try to address this issue. Thank you \n\nHelpful | 3", "BLZDPraetorianSep 21, 2019 at 12:59 PM\nBest there is...for now.\n\nSeriously for the FPS gamers this is a must. I have seen devs talk about further updates, hopefully meaning more game modes. They have a shootout mode where you don't use real walking movment but use the spawn spots and the cover provided. For example 2 teams start across from one another with 3 people on each team. They start spawned in locations that are usually filled with objects to take cover in. And i mean REAL USE OF COVER. I found myself on my belly at one point shooting thru the legs of the chair at the enemie team. It was awesome! The other mode is a classic deathmatch with 6 players total (I think) i dont believe there is any teleportation locomotion, but i really love using smooth turning or doing so in my ever expanding play space. (I finnaly reached reccomended space!) As the title points out this game is the best at what it does, and i really hope they add more modes and actuall custimization! (You spawn in the lobby a different character every time you start the game, whom have there own pistol skins.) Since its the only real multiplayer fps is reigns supreme. I dont hope that this game gets blown out of the virtual water by a much better fps game. But i cannot wait to see what a full AAA 60$ worth of content Quest Fps game. I cannot wait. In the meantime i suggest you spend a 20$ bill on this. Its more then worth it. Especially if the devs keep on adding to the life of this game. Please do so. If its in the form of dlc i wouldnt be upset at all, to assist the devs livelihood and keep playing this awesome game, id happily pay more.\n\nHelpful | 0", "jefffguitarOct 9 at 9:50 AM\n\nMy Xbox 360 red lighted for the 4th time 10 years ago, and I threw it out.\nI never gamed since\nAfter purchasing the Quest, Dead And Buried was the first game I played,, and to be honest,, it's the only game I play!\nIt's bloody Brilliant.\nVery satisfying when you execute a head shot and the graphics and gameplay are excellent.\nI wish for a battle Royal of some sort.\n\n\nHelpful | 4", "zealouseappexOct 26 at 8:55 PM\nFun gameplay\n\nMultiplayer is smooth!\n\nNeeds more players. Ranking system. Leveling up system.\n\nOverall very fun!\n\nHelpful | 1", "DunkManLPOct 1 at 11:20 AM\nVery nice game\n\nThis is a great game but please add in 1-2 more weapons and it would be great if you can switch your position in shootout by teleporting\nBut all in all with friends its one of my favourite games.\n\nHelpful | 0", "Echo_TangoAug 3, 2019 at 6:47 AM\nIt could be awesome....\n\nFirst of all. Have the devs just abandoned ship?\n\n1.This game needs friends party fixes.\n2. More game modes\n3. Customization choices for characters and weapons\n4. LVL up system\n5. A reason to keep playing.\n\nNow it's just a intro to what VR can be. Not what it's ment to be. This game is dead the second any other multiplayer FPS shooter comes to oculus quest.\n\nIt's sad. Because it's actually fun... and then its not.\n\nDevs, fix your game!\n\nHelpful | 18\nDeveloper ResponseAug 12, 2019 at 1:56 PM\n\nHi, we actually just released an update! Check out the Release Notes and we hope you give it another try!", "theVRmangOct 22 at 5:49 PM\nThis game should get more attention\n\nNot sure why people dont talk about this game more. It is incredible. Absolutely love this title. Keep up the great work Devs!\n\nHelpful | 3", "geoffrey.milner.12Sep 8, 2019 at 10:32 AM\nGreat but\n\nIam loving the game like shootout mode the best but I bought the game thinking it would have zombie horde mode like on the oculus go I would love to know if this game will get such a mode would be awesome.\n\nHelpful | 3", "HomerS66Sep 21, 2019 at 1:56 PM\n*Updated Annoying Bug\n\nUpdate: So far the bug hasnt returned thats why i changed the rating.\nThe game is not bad and i will change the rating when the bug is removed but often when i start the game, first i see the logo all scrambled and then when the game starts the whole world is scrambled aswell. Restarting the game doesnt help, only a reboot of the Quest solves it. I see this bug only in this game.\n\nHelpful | 7", "Nephi1iumMay 27, 2019 at 8:13 AM\nSo much fun! Needs Tweaks\n\nThis is the type of game I have been waiting for since the original rift came out. Now, with a quest headset this type of deathmatch arena shooter is incredible. Shooting is easy, aim is fairly accurate, and once you are able to adjust to the slower speed of the bullets it's a game nearly anyone can get a handle on.\nNeeds for the future:\nA mute feature in chat. One kid was whistling an entire game and I have no way to mute them. Killing then was more satisfying when they would say- \"oh mannnn!\" But then start whistling again, so no one wins there.\nTraining for weapons- if you're okay dying a dozen times before you figure out the 3 burst gun and reloading of all the weapons then the current layout is fine. If you want to hop in a competitive shooter with some understanding of the most intricate parts of the game, a training mode would help.\nAn indicator if you are playing bots or people- I understand not everyone on their quest, rift etc is able to play this game right now, but talking to a full lobby and not one person talks back is sad.\nReport a Player feature- I have played against both invisible and invincible players. Which is crap and no fun.\nPress grip button to hold gun- my hands get tired \"holding\" all the guns. Tapping the button to hold would be a bit more relaxing.\nThose are necessary features that need to be implemented.\nOptional and/or future Features-\nMore game modes- team deathmatch, CTF\nCharacter Customization- I love some of the guns and skins. Should be a simple thing to unlock personal customization as right now it's totally random everytime I log in.\nA kill record- it would be helpful to know who I killed and not just who killed me. Most game have them in the upper right corner. Something that is small but sticks around for a minute so you can look after leaving a battle.\n\nAt this point the review is over, hope you guys agree with what I have noticed!\n\nHints and tips-\nShoot grenade launchers at the feet of an enemy when you are nearby.\nShoot shotguns as far as you want, range is not very limited, but spread increases.\nDomt move in one direction when you are circling someone, move back and forth.\nYou can carry two shotguns at once. Feels powerful\nYou can only reload the large grenade launcher once. So 2 x 4 grenades = 8 total grenades\nFlick outward to reload large grenade launcher. Takes a few seconds for the animation to run its course.\nFlick outward to reload 3 round burst gun. Super powerful if you hit.\nDynamite is useless.\nThanks for reading!\n\nHelpful | 61\nDeveloper ResponseJun 5, 2019 at 3:44 PM\n\nWow, thanks for the review and feedback! We really appreciate it. Stay tuned for more updates in the future.", "PainandVirtueAug 24, 2019 at 11:43 AM\nGood, Needs More.\n\nLoved the first one so had high hopes for the second.\nI like it a lot, bots are great for when no-one is online, but i do think it lacks from not having the Horde mode, as that seemed to be one of the more busier online elements on the first one. Hoping we will see horde come to this one.\n\nHelpful | 1", "BaracudazMay 23, 2019 at 10:00 AM\n\nGreat game does not make me sick with full location however I could not find an option to turn on smooth turning only snap turning. Sure you can turn in real life but it can be quicker to use the sticks in the heat of battle. Enjoy both modes available however would like some kind of progression and gear to unlock as well somewhere to view my stats. This game would benefit from a tutorial area to teach you how to use and reload each weapon as this is not obvious when you start.\n\nHelpful | 255\nDeveloper ResponseJun 5, 2019 at 3:48 PM\n\nGreat feedback - we appreciate it!", "pmgahanSep 12, 2019 at 9:54 AM\nMust have shooter\n\nI dont understand what people complain about, this game is awesome on the quest. You have two play modes, in case you get dizzy when moving around with the joystick you can then play the team games, which I love, where you just naturally move around a smaller space. My suggestions is to add more maps with more places to take cover and make recharging the weapons easier. I love how Pavlov implemented recharging the weapons, you should explore it. Until Pavlov is released, I think this is one of the best games in Quest. Even when Pavlov gets released, this one has a different cartoonish angle which I find great.\n\nHelpful | 4", "starlorgeSep 8, 2019 at 1:01 PM\nHow do I change my avatar\n\nLove the game play, but how do I change my avatar from female to male, its not syncing up with the avatar I have made for the oculus system, I own a Quest by way, any help would be appreciated\n\nHelpful | 1", "dingoflingSep 15, 2019 at 5:17 PM\nTown\n\nThe town's cool as a hub. But i like menus for games like this for some reason. Maybe i need to check out the hub area with people more to appreciate it. Still a great game , i like the mode where you are more or less stationary aside some cover and have to duel other dudes. Its a game with a lot more than seems at first I played only a few hour but Found it to be a great game it's quirky in a good way, and more unique than most games. As of now [9/15/19] its the only true shooter death match (im pretty sure) with a style the way it is, aside sideloaded games like Pavlov.\n-Kojima Digital Productions Co., ltc\n\nHelpful | 1", "Helmy366Aug 31, 2019 at 2:45 AM\nDisappointing\n\nNot having played Dead and Buried 1, I was looking forward to seeing how the game would work and what there was to do. I was disappointed, however with a number of things.\n1. Cheating. The fact that people can shoot through walls is just annoying as you are unable to shoot back at them. I am sure that this will be an easy fix though.\n2. When playing shootout I couldnt quite get low enough to hide in one of the positions on the train depot level. I am not sure if this was because of my guardian and the floor height but I would appreciate it if you looked into it.\n3. Variety. I am getting bored of being killed by Reaper continuously and would like it if you could make the bots vary in names and appearance.\n4. Returning to the shooting range. Now, I am not sure wether I just was not looking hard enough or have only just bought the game so would not understand but I would like you to be able to return to the shooting range and change your skin (not sure if you can do that or not).\nSuggestions: Maybe you could add another game mode to a future update like defending the payload or something more cowboy like such as robbing a bank and fighting of waves of policemen. Even a battle royals could be fun as that has taken a storm recently. Only seeing shootout and death match eventually becomes quite boring. You could even add more maps instead of the few maps we are given.\nSorry for the rant.\nHope to see some changes made in the future.\n\nHelpful | 3", "dmaya0607Aug 15, 2019 at 6:02 PM\nFun but miss opportunity\n\nThe game fun but not much to do I got some ideas like making the world more interactive like being able to shot your gun To Break bottles and being able to use the bottles as a Weapon once you break them. some more modes I had in mind are a draw mode how it will work is if you shot a player in the playable lobby and they return fire a draw will happen or a Heist like robing a bank with a Group of friends and . A ranking system and weapons skins lastly a jump button. But please dont put the jump button in multiplayer.and a menu for friends.The game is fun but I think this could make it better.\n\nHelpful | 0", "guenter.baumann1711Sep 19, 2019 at 1:01 AM\nNot easy, but fun!\n\nAll in all great fun playing, hiding behind walls to shoot at the bad guys.\nI hope more scenarios will be implemented soon.\n\nHelpful | 0", "OdinsViolinAug 8, 2019 at 1:07 AM\nAlmost overlooked this...\n\nI never really paid much attention to the game based on the reviews. However seeing that it was one of the few multiplayer games available I decided to give it a try. On my 1st game i spawned into a death match lobby where everyone was invisible and I would constantly get killed. After leaving the lobby I decided to try another game mode called shoot out. This really changed the entirety of the game for me. It is very unique, thematic, and immersive. Unless I am missing something there are some issues that the developers should fix or add. Currently you have to walk around in this lobby That has the game modes and maps spread out on the different corners of the map and you actually have to travel in game to select it. Which means if you wanted to go to play a death match You have to walk to the specific map and you are stuck playing on that map unless you exit to the lobby and then walk to the other side of the map and queue up for the other map you wanted to do. It would be nice to have some sort of quick match setting Where it will cycle through different maps. I think the game could encourage little bit more communication amongst players but I'm not sure if voice chat is even available. Some sort of progression system would also be appreciated and after each game if some sort of stats and rewards could be given to players that would be great. For example your accuracy percentage or even who got the most kills or who took the most damage. All in all this game has a great potential to be a 5 star game but in the meantime I am going to give it a 4 star because I had a very very good time playing it but the features are lacking.\n\nHelpful | 3", "GeeseBeGoneAug 29, 2019 at 3:21 AM\n\n08-29-2019 updated review to 3 star. There is now a proper welcome screen and a good tutorial. There is also now the ability to host a private room. I feel the 3 star is warranted as the game as it is now basically is what it should have been at launch.\n\nCan we get a confirmation if DB1 style horde/campaign is actively in the works? Thank you.\n\n***********\n\nPrevious reviews\n\n07-17-2019 update - where are the updates and/or more content thats mentioned in the description\n\n\nOriginal review: The game puts you into a shared multiplayer lobby without any instruction. You have to figure out everything for yourself. No tutorial at all. Additionally, I was hoping for an experience like Dead & Buried 1, but this is not it. I'm not asking for a refund, because I want to wait until a true co-op/private lobby/horde-mode is added. I just hope it doesn't go on sale before they add it.\n\nHelpful | 1", "GearknightAug 24, 2019 at 5:42 PM\nWhy are there kids underage playing this\n\nWhen I'm playing this game I've noticed that there are kids playing this. I thought the safety rules forbid players under the age of 13 to play this game or vr for that matter! You really need to crackdown on some of these kids ASAP. Because these kids are playing with fire and there about to get motion sickness. So, do something about this fast!\n\nHelpful | 7", "steve-01351Sep 27, 2019 at 4:38 PM\nNo idea how to do anything in this game.\n\nNo menu - no clue how to set options - and none of the voices I hear are even speaking English. So all I can do is start the game and then quit.\n\nHelpful | 4", "LollimasSep 19, 2019 at 7:13 AM\n\nNice Game, it has a lot of potential, but sadly not that many options for playing. It could be more extensive.\n\nHelpful | 0", "WaffleMaan742Aug 18, 2019 at 9:07 AM\nIdeas for the game\n\nI just got this and i dont know a ton but i know that the sniper and the long range maps was my favorite thing to do in the first dead and buried and im hoping you could bring that back or maybe at a custom lobby that you can just do wacky stuff in. Also i think you could add achievements and if you completed them you could earn in game money and you could turn one of the buildings in town into a shop where you could buy skins and you could give exclusive skins for achievements as well as like little toys like in poker-stars vr that you could get. You could turn a building into a bar and have little mini-games in all the buildings so if people got tired of playing the 2 game-modes that there currently are then they could relax and go to a bar or a arcade with their friends. I think these things wouldnt be super big or hard to do but might bring a bigger player base to the game because right now a lot of the people in game are bots. Also maybe add a single-player story mode where you have to ride out across the desert to different towns that are being attacked by zombies or thiefs or gangs and you would have to clean up the town. These new game-modes and then little things in the town i think would help the game become a lot bigger and more people would be online and buying it. It might take a while but i want this game to get bug and be popular because right now its bot very popular and theres not a lot to do, if you integrated these things and worked hard to make new game modes\nand events than i think it could be one of the best vr games on the store right now\n\nHelpful | 2", "Aracnareaper007Aug 4, 2019 at 1:42 PM\nFun game\n\nThis game is fun for being the only pvp shooter I have found on the store to date. My only recommendation to the devs would be to add a team death match mode. Currently the only team mode is a shootout mode where you spawn in a position and shoot across at the enemy. It is fun but the death match is even more fun. Death match is a free for all with locomotion and pretty fun maps to play. Pease put a team death match in game. That would make this game 10/10\n\nHelpful | 0", "gamewiz233Aug 20, 2019 at 4:30 PM\nGreat game just needs updates\n\nThis is a super fun game. Both modes are amazingly fun and in my opinion addictive. I just wish we heard more news on updates and bug fixes such as the noise/feedback we receive during game play.\n\nHelpful | 2", "MoxcrAug 14, 2019 at 6:34 PM\nMuch better\n\nI have to hand it to the devs, they listened to feedback and really improved the game. Shooting feels better and the addition of the training range is great.\n\nHelpful | 2", "DickDastardlyMay 22, 2019 at 6:23 PM\nAwesome (with some caveats)\n\nGreat fun and extremely impressive graphically for a Snapdragon 835. It really is amazing how similar to the Rift version this is considering the gulf in rendering power. Great to see Oculus finally embracing fast locomotion too - can't believe anyone ever thought teleportation was anything other than a temporary crutch when movement is the heart of most games (and here is greatly enhanced by being wire-free). Having said that, a teleport option is available for those who haven't got their VR legs yet and there are also \"shoot-out\" maps which play like the original D&B in addition to the main free roaming deathmatch maps.\n\nSpeaking of maps, level selection is very clunky - there are different launching points for each map scattered throughout the town environment and you have to run to the one you want to play. Then once you've played that map it just repeats over and over until you quit back to the town. It would be far better if you could just pick the one you want to start on from a menu and they cycled automatically so you could join a game and play each map in turn with the same group of players.\n\nMy main complaint, however, and the one that cost the game one star (and very nearly two) is that movement is tied to head direction so if you glance around whilst running your character will veer drunkenly from side to side. Really hoping the devs add an option to fix this and allow controller relative movement.\n\nHelpful | 25\nDeveloper ResponseJun 5, 2019 at 3:49 PM\n\nGreat feedback. More control options are coming soon :)", "cbrink812May 23, 2019 at 11:07 AM\nSo Far So Great\n\nBeing new to VR I was nervous of how moving around my house and hiding behind \"cover\" would work in the shoot out mode, but it surpassed all my expectations. Hiding behind boxes, and columns feels natural and is a lot of fun! Plus when you have friends filming you, you look ridiculously funny rolling around on the ground\n\nHelpful | 150", "HogansBreathJun 21, 2019 at 9:39 AM\nNo friend support!!!\n\nThis game would be tremendously fun IF you could match make with your friends! No way to get in matches with your friends except by chance. Game play is great, but after a while of playing random people it starts to feel no different than playing against bots. ADD FRIEND SUPPORT!!!!!!!!\n\nHelpful | 46\nDeveloper ResponseAug 12, 2019 at 2:09 PM\n\nHi, we just released an update that adds more support for Oculus Parties. If your Party has at least two online members, then you will be given a private Town instance where you can meet up and coordinate. Check it out and let us know what you think!", "OK.FoxJun 26, 2019 at 4:36 PM\nSupport\n\nHi,\nJust trying to reach the support staff about my username change, I changed my username immediately after getting the Oculus Quest but the only game that hasn't updated that username is Dead & Buried II. Any help would be appreciated!\n\nOtherwise the game is great, there are a few updates i think would make the experience better:\n-Knowing whether you're playing bots or people when looking at the scoreboard\n-Ability to mute players (i've left servers because some people are just straight obnoxious)\n-When you are about to enter an area from town, be able to see how many players are in that zone before entering\n-Check player latency in the scoreboard menu (sometimes players appear glitchy which I assume is due to latency)\n-Team Deathmatch mode would be fun or CTF\n\nHelpful | 4", "ABear2CookSep 22, 2019 at 5:44 AM\nReally like this game!\n\nTook a bit to be able to run around instead of teleporting without getting sick but I'm getting used to it more and more. I've read there are maps but I don't know how to get to them. I've seen a youtube video of someone shooting zombies in a tunnel or mine of some sort but I don't know how to get there. The objects to hide behind in the shootout seem to always be so low I find myself rolling around and crawling on the floor for cover. I understand the need to come back to life in a different spot but you come back right in the open and get killed again quickly. A few seconds of recover time (not being able to shoot at that time) would be nice. It would be neat to be able to see your avatar as others do. I was sitting on the floor (after rolling and crawling) and went back to the town and I was the height of me sitting down and people were walking up to me at standing height. Curious if my avatar was sitting too or just short. More and detailed instructions for the above would definitely help. Yes, yes - I am a newbie to VR and love it. UPDATE - I now know the maps are the ! marks but I'm still looking for the zombies to play single player - - is this possibly Dead and Buried 1?\n\nHelpful | 3", "YnGBL00DJun 11, 2019 at 5:29 AM\nDevs!\n\nSo much fun.\nWill be the best game on the quest if it is tweaked right.\n\nEveryone has already said what is needed.\nTutorials, character choosing (not required)\nMore Settings, mute options.\nAm I playing bots or not?\nReport options, maybe a place to practice.\n\nKeep it up so I can change this review to 5 stars!\n\nHelpful | 7", "DeecomJul 20, 2019 at 3:53 PM\nFun game with a couple of issues\n\nI haven't felt sick like some others that play this game. I don't enjoy the super arcade gunfire style as much, even in drop dead it's a satisfying feeling to shoot something. I haven't had a lot of luck getting to play full games with other people, lots of computer bots. Maybe just the time I'm playing? Those things aside still fun and I enjoy playing it, hopefully the developers can keep refining it.\n\nHelpful | 3", "FA1COJun 27, 2019 at 12:28 PM\nNeeds Horde Mode\n\nIve been a faithful Oculus fanboy since early 2016 and loved the first Dead and Buried!! The 2nd really needs co-op Horde Mode. I get that its going to be updated, but even after the first 6 weeks the online players are becoming fewer and fewer!! Please give us Horde Mode! That was my favorite part of the 1st game\n\nHelpful | 11", "mcoops26Aug 1, 2019 at 6:10 PM\nPlease support this great gane\n\nIve been playing for a couple hours and love this thing. Gameplay is fast and intense. Devs have promised to add the PvE from the first game in the future plus some events. Not enough people in the lobbys is not a worry as the game will fill in the spots with bots that are actually pretty intelligent. The only place that can use improvement is progression as it is basically non existent.\n\nHelpful | 3", "RealtorRoy17Jul 8, 2019 at 9:23 AM\nFavorite game, lot of bugs recently tho\n\nLove this game. Death match is fun and pretty competitive. Recently there have been a ton of bugs though. From it just not loading when I go to map (screen just black) or when in game everyone is invisible. Was lucky enough to get a quest the day it was released and this was first game I got into and still favorite, just wish it wasnt 50/50 these days if it was going to work or not. Also would be really cool to see players names in game so I know who Is what character. There are 20 or so of us that are pretty good and try to play together, always feel bad shooting up some kid when I think its a good player. A ranked system or tournaments would be great as well. Is there an update coming soon to fix all these bugs? Thanks- Beastheadbutt\n\nHelpful | 13", "Azazel08Jun 7, 2019 at 8:15 AM\nGreat PVP game\n\nThis game is superb on the Quest. The ability to spin around as fast as your body can is a big plus. I really like the shootout mode in this as well because it lets you use your physical playspace to duck behind virtual cover for a very intense firefight. The deathmatch mode is like the best form of online action that provides free locomotion and is very well done and enjoyable game.\n\nHelpful | 29", "FinnyWiggenJun 1, 2019 at 9:58 AM\nHave to say that I am very disappointed\n\nI have had an Oculus Go, and several versions of the Gear. One of the things that I was most excited about with the Quest is that they said that it would support a full version of Dead And Buried. Dead and Buried on the Go / Gear is one of the funnest games, and I was really looking forward to playing the expanded version which I have played before on my Son's Rift.\n\nNo such luck. This game (Dead And Buried II) is worse than both the Rift version of the game, and the Go version. All that is available is the ability to fight others in various settings. These shootouts are fun for a few minutes, but... they quickly get boring.\n\nWhere are the waves of zombies?\nWhere are the features that actually make this game fun?\nWhy are you charging me so much, when there are far less features than the much less expensive Go version?\n\nHelpful | 10", "draconis234Aug 25, 2019 at 7:41 PM\nGreat game!\n\nIts an awesome game with a lot of maneuverability but was wondering how to change character in game!\n\nHelpful | 2", "CormactheKidJun 26, 2019 at 2:13 PM\n(Barrel) loads of fun\n\nI believe the future of VR gaming is multiplayer shooters like this. I couldnt put the headset down the first time I played this. I do believe the game needs more maps modes and guns (definitely guns, and different types too) and a way to customize your own personal player to make it feel more like you. A ranking system would also make me pick it up much more often. Still, a lot of fun\n\nHelpful | 3", "jarusprasaJul 16, 2019 at 1:22 PM\nGreat game\n\nFun and exciting ! But has some glitches. One of the glitch i encountered was in train track shootout whenever i use the shield, it disappears and the gun fails to fire or reload. Another glitch , from time to time im floating in air and cannot get down. Other than that its really fun!\n\nHelpful | 3", "alex.densvenskeJul 11, 2019 at 8:01 AM\nGreat but not brilliant\n\nThis is a good game, but there are downsides about which it is worth saying that the developers could fix it. Firstly, there is no company against monsters. secondly, a very small multiplayer with real players, not bots, make a board to understand what mode to play now, to confront real people on bots. thirdly, add co-op and the ability to play one-on-one or invite friends to the game.\n\nHelpful | 4", "PeaceablecoltMay 30, 2019 at 10:18 AM\nLots of fun but totally under developed\n\nLet's get the positive out of the way first. The game feels great, I like how the weapons handle and mowing through other players when you get on a streak is supremely satisfying. It's also one of my favorite looking games on the quest, really shows off the console's capabilities.\n\nUnfortunately the game seems to have been rushed out for the Quest's launch. The game has crashed a number of times, almost seems like every time I play at least one of the maps just pops up an endless loading screen and I have to restart the app. Further more there are only 2 game modes, and one of them seems really phoned in and has almost no entertainment value. There are only 5-6 maps and a small selection of weapons which get old pretty quickly. There's no option to shuffle maps so you have to exit to the hub, walk across it to get to the map you want to play and then load it up every time you want to switch maps. It's extremely time consuming.\n\nThe devs have promised updates and I really do hope they deliver, because with all my complaints I still hold that the core of the game is very solid. Unfortunately because of the lack of content at launch I worry that people are going to get tired of this game before updates arrive and the servers may be too empty to get into matches consistently when the game is actually worth the cost. I hope I'm wrong, but for now I definitely recommend passing on this title unless it goes on sale for 5-10 bucks (I think it'd be worth that amount).\n\nHelpful | 25", "allentheoafSep 1, 2019 at 8:48 AM\nAwesome\n\nDespite the low rating, its a quick and fun COD type shooter which you can play when you have a spare 10 mins.\n\nHelpful | 1", "Glitch_FACEJul 1, 2019 at 6:35 PM\nEh\n\nAs a preface: this game is not bad. It could even be described as good... mechanically. The game itself is a lot of fun, and though I have spent all of my time thus far fighting bots it has been time well spent. However, content and execution wise the game is lacking. First if all, the \"menu\". No devs, you can't get away with using one of your maps as the main menu. For one thing having to actively seek out maps other than town means that they are all as dead as my grandparents, ergo why I have played mostly with bots to this point. For another, it implies a greater social experience than this game offers. This is not a chat vroom. If you want that play vr chat.\n\nAnother issue with this game is a lack of content. There are two game modes, shootout and deathmatch. The latter is self explanatory, the former is a kinda interesting stationary cover based affair. However... that's it. No team deathmatch, no capture the flag. Idk if I'm being a bit unfair but the presence of this stuff would have really helped this game.\n\nFinally, there is no jump button. You lost a star for that alone. Nuff said.\n\nOverall I recommend the game. Still p good for the price and as I said, it is fun.\n\nHelpful | 2", "Emanuel20Aug 2, 2019 at 11:20 AM\n\nSolid multiplayer. It would be nice if you could purchase and keep the guns other than the revolvers that you're always carrying. Maybe add a bit more of an interactive component similar to rec room?\n\nHelpful | 1", "VR-BLoOdshOtJul 18, 2019 at 7:23 PM\nDev's add more features!\n\nLove the game, don't get me wrong, the shoot outs are more enjoyable, less sick feeling, but we really need more control on sending a invite and having private matches when wanting to. I'd like to see extra's and wouldn't mind paying for extra's, let's gooooo\n\nHelpful | 2", "wallingajoelSep 22, 2019 at 6:01 AM\nDual player mode in the last update\n\nI just updated my comment. Thanks for fixing it so I can play private with friends. I love this game. Will be perfect when a game comes where you can use the sniper. \n\nHelpful | 3", "Jfan517Jun 11, 2019 at 4:26 PM\nFun sequel-missing vital aspect\n\nI love the development of this game and most of its mechanics, however its missing a horde mode that defined the game before. Also I feel like the gun mechanics are a little off, when I aim straight it seems to aim differently! Is there any way to recalibrate the aim?Will these fixes be patched in soon? Thanks!\n\nHelpful | 2", "PrimeTQuest4Jun 26, 2019 at 4:11 PM\n3.5 stars\n\nThis game is pretty good. I like the shootouts and the deathmatchs, but where are the zombies. WE NEED ZOMBIES. AND MORE GAME MODES. But I believe they will be updating the game frequently. And there should be a way to take off voice chat and mute other people. Other than that 3.5 stars\n\nHelpful | 3", "VasagorstMay 24, 2019 at 12:44 PM\nVery fun but unfinished\n\nVery fun, nice graphics, few framerate drops but ok most of the times , but: no progression system, no customization, cant play with friends, no stats... The game seems unfinished at the moment. Please do it devs I love your game :)\n\nHelpful | 8", "GadnosJul 5, 2019 at 7:25 AM\nCould be better\n\nOverall the game is very fun and the graphics are great for a mobile device. However the game is missing quick draw and the gun range from the original dead and buried. Had I known there was no quick draw and gun range I would not have purchased the game. I really hope they add these in the future.\n\nHelpful | 4", "DancesWithNoobsJul 25, 2019 at 4:56 PM\nNot a fan\n\nMissions full and have to wait in line? Cant figure out how to move around. Got stuck in the options menu and couldnt get out without reloading game. No tutorial or introductory level. Seems kinda half baked. Requesting a refund on that one before I play too long to qualify for it.\n\nHelpful | 2\nDeveloper ResponseAug 12, 2019 at 1:59 PM\n\nHi, we just released an update that adds a new Tutorial with a simple Shooting Range. Check out our Release Notes and we hope you give the game another chance!", "JonakeshJul 18, 2019 at 11:13 AM\nGet bored fast\n\nGood game for 15-20min, after that, you won't wanna open it again. Couple maps and no goal achievements. Just walk around and shot and thats all. No poin achievements, no gun improvements/attachments. I hope they add some fun stuff\n\nHelpful | 3", "ibestephJul 12, 2019 at 11:08 AM\n\nWaste of money. Worst game I have on quest. You cannot move around and kill people. You are spawned to a single spot and have to hide behind a single item like a box while you get killed over and over. Played it for 5 minutes and will never play again.\n\nHelpful | 4\nDeveloper ResponseAug 12, 2019 at 2:04 PM\n\nSorry you had a poor initial experience. Sounds like you were playing the Shootout mode, which is a stationary mode. I recommend trying Deathmatch, which has free movement. We just released an update and hope you give the game another chance.", "hmr2871Jul 5, 2019 at 9:31 AM\nMy favorite game so far\n\nI love this game. When it works right and you are playing real people rather than bots...\nThere are a few technical glitches that need to be worked out. Sometimes bots are spawned as invisible which makes playing impossible. The other deathmatch locations (mine and distillery) are always empty. I think that is most likely because people don't realize there are other options other than the main town.Even with all of these cons it is still a very fun game. I keep thinking I will just play for a few minutes and the next thing I know my headset is out of power. That's when you know the game is fun.\n\nHelpful | 7", "Icyphoenix122Jun 17, 2019 at 12:46 AM\nGood game with missing features\n\nThe game is good but a lot of features are missing. For example more guns would be nice, more maps would be great. Assists should be added for when someone takes your kill. I really loved shootout and death match but I have some suggestions. The point goal in shootout is the low and I feel as if matches end too quickly with not enough time to make a satisfying comeback, adjusting it to 30-35 would be great. In both modes there should be a solid scoreboard at the end of the game, for example if you subtract ones kills by their deaths then that positive or negative number is a good indicator of how well someone did in a match, You could rank players at the end of the game based on their numbers. In deathmatch somethings you will spawn then walk away and someone will spawn in the same place as you did then kill you, this could be fixed by adding more possible respawn areas. The turning needs to be fixed, rather than flicking the right joystick you should be using it to look around like in a normal shooter. Music and Art are great and really reflect the atmosphere.\n\nHelpful | 2", "Nemo112841Jul 8, 2019 at 4:29 PM\nWhats going on?\n\nIt looks good but where are the instructions? It dumps you in the middle of the town and if you join a match like Shootout  you dont have a gun. How do you customize a character? Everyone else seems to have their characters personalized. The settings section doesnt tell you anything. Us it the game or am I missing something?\n\nHelpful | 2", "Zef_GedeJul 11, 2019 at 10:30 PM\nFun when it rarely works....\n\nSo let me just start off by saying this is an enjoyable game when it does work. Rich is rarely on the Oculus Quest. I would not recommend this title until they fix many issues with the game for the Oculus Quest. the only reason I gave it to stars is because one star would be for a garbage game. But it is not worthy of three or more yet. I can't play with friends without them having to reset their headset. I like the game but I've only been able to play it about 4 times out of 15 successfully more than 2 hours straight.\n\nHelpful | 2\nDeveloper ResponseAug 12, 2019 at 2:06 PM\n\nHi, we just released an update that fixes several issues. Let us know what you think!", "vaiariiJun 17, 2019 at 10:02 AM\n\nThe game works very well, shooting and hiding is very exciting and it is precise! The game is marked as stand up position but I actually was able to move all around my room scale in shootout and deathmatch mode. I wish their is an option to increase displacement tracking sensitivity as now I have the feeling to do baby steps compare to joystick displacement!\n\nHelpful | 1", "natrat4Aug 17, 2019 at 12:11 PM\nHelp please\n\nI'm stuck in VR and this is the only way I can contact the outside world but so far this is my favorite game\n\nHelpful | 3", "jojasJun 21, 2019 at 11:29 AM\nJerky People\n\nJerky people make this miserable to play. The game seems fun if I could ever get to try anything. These jerks sit and wait for me to respawn(having never played before at all) and before I can even figure out what is going on or how to pick up my guns, they kill me. I'm standing out in the open looking around, looking down at my guns, not moving...its obvious I'm extremely novice, but these guys camped out for 3 games, and 15 times in a row shot me before I could even get my gun. How is that even any fun for them? What's the point? Hopefully we will be able to just play with friends soon. If not, I'm going to ask for a refund (I've never done that before) because there's no training to get better, and there are too many jerks who make it unplayable. I'll give 5 stars if they develop a training area and give us an easier way to play only with friends\n\nHelpful | 4", "Dave22705Jul 4, 2019 at 7:04 PM\nSteaming pile of garbage\n\nThis game is honestly one of the worst VR experiences on the store right now. You cant invite friends to the same game as you, and the matchmaking is abysmal. Every single time you get into the main hub, it makes you go through the process of choosing your locomotion. Most cover that you can find in the shootout mode is literally floor height, so you have to lie down for it to do any good. There are no tutorials, so youre just dropped in without any idea of how to play, not that its hard, considering how simple it is.\n\nOverall a terrible game that isnt worth the $30.99 AUD.\n\nHelpful | 4\nDeveloper ResponseAug 12, 2019 at 2:18 PM\n\nWe just released an update that adds a new Tutorial. The issue where it would ask you about locomotion is gone (which would only happen on your first session, but was understandably annoying nonetheless). The update also adds support for coordinating games with your Oculus Party members. Re: height issues, those should also be addressed (although in your case it seemed like you may have needed to recenter). Hope you give the game another chance.", "FlyingfoolJul 29, 2019 at 10:13 AM\nGreat addictive game\n\nLove the game great graphics waste many hours playing it . As a result I see many glitches and disconnects . Hope they fix it soon then I would rate a 5!\n\nHelpful | 1", "TheOriginalJun 25, 2019 at 12:38 PM\nLots of fun but needs an update\n\nThe game is great fun, especially shoot out mode. However, it urgently needs an update.\n1) it's frustrating to have to walk around the town area just to jump into a game. It needs a simple menu option\n2) You need to be able to invite friends into games to ensure you can play together\n3) Bots need to be clearly identified\n4) An option to change the gun barrel angle (as there is in space pirate trainer)\n5) An option to use the grip buttons as a toggle rather than having to hold them down the whole time. It's simply not comfortable doing that for long periods\n6) There's a bug where the game will not recognise a new username. I changed my username but the game still keeps my original name. This is a dangerous bug as some people may change their usernames for security and data protection reasons\n7) Some kind of solo practice area is needed. A shooting range with all the guns maybe?\n\nHelpful | 3", "MacheteHeadYTAug 25, 2019 at 5:13 AM\nAmazing\n\nIts just amazing the gameplay fun and it helped me find a friend in vr\n\nHelpful | 0", "Stark_IndustriesJul 1, 2019 at 10:26 PM\nGREAT GAME!!!!!\n\nComing from a PSVR this game is great for all the complainers this is the first wireless headset with out setting up sensors give the developers time. How can you help spread the word about the Quest great game guys this and Robo Recall are my favorites on the Quest by the way this is for Sony Im selling my PlayStation and PSVR\n\nHelpful | 4", "ashtongJun 10, 2019 at 6:33 PM\nNeeds Single Shooter option\n\nThis is one of my favorite games on the Oculus Go but the Rift and Quest version seem to be focused on a multiplayer environment. The problem is that there is no where to \"play\" as a solo game and develop some of the skills required to play with other people. At the very minimum there should be two environments.. on for new users and allow people to progress to the more experienced level.\n\nHelpful | 6", "TuvivavalJul 28, 2019 at 12:22 PM\nGreat game\n\nGreat game, easy to play and fun! Its more like a casual game but it is super fun!\n\nIt would be so good to have a team deathmatch! Do you have plans for that? Also, do you have a discord server to talk about the updates?\n\nHelpful | 1", "claude.schneiderJun 13, 2019 at 7:30 AM\nNeeds several improvements\n\nIve never stopped playing Dead and Buried on the Oculus Go, and loved the 3 horde maps - never played the shootouts as they just werent any fun at all.\nDisappointed that the Quest version only has shootouts and deathmatches. Im not a fan of Quake/Unreal type games where you have to run around platforms shooting people.\nSame issues as lots of other reviews - no tutorial, annoying to walk so far to change map.\nGetting a refund, but keeping an eye on future updates to see if horde modes are any good when added.\n\nHelpful | 5", "LNS-Jul 8, 2019 at 5:18 PM\nSuper fun!\n\nThis is in no means a realistic shooting game. The mechanics are fun and easy to figure out. The action is fast paced, and balanced. Theres some minor graphical bugs, but other than that its pretty polished. My favorite game to hop into and play a round or two.\n\nHelpful | 2", "sam.kmJun 9, 2019 at 4:50 PM\nAwesome start, could use some features x\n\nFirst game I got for my Quest and it's amazing, love the gameplay and graphics etc, but it feels a bit unfinished, would be amazing to see it developed some more - custom teams/private 1v1 matches, options to customise your character, tutorials, etc, would make it perfect!\n\nHelpful | 1", "DazbowJun 12, 2019 at 12:56 PM\nNeeds work\n\nThis could be a great game but unfortunately it needs a lot of work before its a top game. The menu is extremely poor and now we have the quest reloading Guns could be made extremely easy. This game really needs a big update and soon . Come on devs make this a great game .\n\nHelpful | 2", "DazbowJun 12, 2019 at 12:56 PM\nNeeds work\n\nThis could be a great game but unfortunately it needs a lot of work before its a top game. The menu is extremely poor and now we have the quest reloading Guns could be made extremely easy. This game really needs a big update and soon . Come on devs make this a great game .\n\nHelpful | 2", "Zenn69Jul 15, 2019 at 2:18 PM\nCrazy Fun\n\nI tried this with a 25x25 foot guardian and was blown away. I was able to actually run and crouch. The gameplay is on point as well as the clean graphics. This is one of my go to games for letting off some steam. Awesome Job DEV team\n\nHelpful | 1", "VR-GamesterzMay 21, 2019 at 8:19 PM\nVRgamesterz\n\n1st time played this, once I saw the arena battle I was like oh yeah. Even know this is not the arena play, I had fun, did get a little hot and dizzy using the joystick to move but that happens to me with most FPS I've tried without using teleport. The stand in place was much better, a good 6x6 play space is helpful to move around and hide behind the rocks, can't wait for more stuff and private matches too!\n\nHelpful | 21", "PatientBeaverJun 5, 2019 at 6:20 PM\nGreat but need a location with no bots..\n\nThis game is fantastic, however a HUGE HUGE HUGE issue is when you log on and go to a location and get your butt kicked by bots. I got better and am able to win against bots, but if I want to play with my friends, having bots in the same game is going to absolutely be a deal breaker. (I have two quests and might get some more). Also, I hate playing against bots myself, and I don't think other people like them either. I think the bots are severely hurting the online population and popularity of the game. It is much more fun to play against one other human than one human and a bunch of bots. Its just boring and lame playing against bots, whatever their skill level is, and the game doesn't require them. My sugeestion is to have some areas which have no bots at all in them for example Deathmatch town (no bots). I think newcomers try the game, and then soon quit because of the bots, whereas if the first location had no bots or only added a single bot if there were no other players and then removed the bot if a human joins that would be much better. I have seen it happen, a new player just gets owned by a swarm of bots and then quits soon. If there were humans, they might still get owned, but there might also be another new player to defeat. Even myself, I don't want to play because of the bots, and I am decent enough now to be able to win against bots fairly consistently. Those bots are really no fun, completely ruin the game for me.... when you play against a human you get to hear them curse when they die, they learn, etc, totally different game, way more fun if only the bots could be removed.....\n\nHelpful | 2", "ButterNoodlzJun 12, 2019 at 8:19 PM\nGreat game, needs tweaking\n\nThe game is fun and great, the shooting is great the pvp runs well, but here are the reasons why it's not 5 stars\n1. You can see through your shoulders for some reason\n2. I wish there was some sort of character customization\n3. When aiming your wrist is at an awkward angle\n4. Needs more game modes ex. Team deathmatch, as of right now there are two, shootout and deathmatch\n\nHelpful | 4", "slyhounddogJun 30, 2019 at 1:13 PM\nCheaters galore\n\nI loved the original dead and buried, so I was very excited for this game. Too bad I can't play a single game without AT LEAST one cheater, Many times multiple cheaters, in the same game. You will watch as an invisible person shoots and kills everyone. If it's fun to you to be killed by someone with perma-invis over and over, this is the game for you. Devs either have a broken game, or one too easy to cheat on. Either way, PASS. I requested a refund and Oculus straight up ignored me. Don't even get it to try it, they won't refund you!\n\nHelpful | 10\nDeveloper ResponseJun 5, 2019 at 3:47 PM\n\nSorry you encountered this. We are looking into this issue.", "GreenAzzMay 26, 2019 at 1:53 PM\nLooks great and that's about it\n\nThe game looks great and works smooth, but is totaly a step back game wise from Dead and Buried 1. The maps are tiny and filled with random combo of bots or players and this makes for short unsatisfying games. The cover provided in the maps will in no way help you, so you will die all the time, does not matter how low you crouch. The weapons will spawn out of your reach and no type of locomotion is suported in shotout mode, so you get to stare at them for the few seconds between deaths.\n\nPlease o please mighty dead and burried devs, bring back the big maps with the 2v2 option, give us a moment to enjoy this beutiful game you made.\nAlso maybe put the weapons just a tad closer?\n\nHelpful | 7\nDeveloper ResponseJun 5, 2019 at 3:44 PM\n\nGreat feedback. We will be making gameplay adjustments to the Shootout maps.", "ximorleadixJul 16, 2019 at 3:49 PM\nGood but needs more content\n\nPlaying the same levels over and over again can get a bit stale. Would like more content. Also the option to change your character/revolver would be nice\n\nHelpful | 1", "kiingju1017Aug 21, 2019 at 7:24 PM\nWhen will we be able to shoot zombies??\n\n:(\n\nHelpful | 1", "hunting-resonanceMay 29, 2019 at 2:56 PM\nKnees\n\nShootout is awesome, but you will need soft floor / kneepads and more than the minimum room space to really enjoy it for any length of time. In the right space there's nothing like it! I'm still getting used to locomotion so I can't play death match without feeling ill very quickly. Need to develop my vr legs for this one.\n\nHelpful | 1", "ScarfacejMay 21, 2019 at 9:19 PM\nDizzy\n\nI like the rift version better, I played 2 hours every day without any issue , but here I couldnt last more than 5 minutes, you should be okay if you dont move around, but whats the point of not moving when everyone else are moving and shoot you, hopefully they update this with a new environment just like rift version\n\nHelpful | 15\nDeveloper ResponseJun 5, 2019 at 3:50 PM\n\nHello, you may be interested in the Shootout gamemode which is the same stationary cover-based mode from the original game. You can change your locomotion settings to teleport and move around the town lobby to find Shootout events. Good luck!", "Branden1111Jun 10, 2019 at 5:46 PM\nDevelopers: Please change \"menu\" system\n\nMost people just go to the first one, rather than trying any other modes. What will happen is people will think that's all there is and never return to playing this game, therefore hurting online presence numbers. In the worst case people will just refund the game. The menu is literally killing this game.\n\nHelpful | 3", "Wyatt46xAug 9, 2019 at 9:46 AM\nI cant grab my guns\n\nIt happened to me twice now\n\nHelpful | 0", "jeff4433Jun 2, 2019 at 3:10 PM\nFast and fun\n\nOnline multiplayer shooter with full locomotion day one on the Quest. Great start! Game plays perfect and looks better than I thought it would. Matches are fast and action packed. The only reason it's not a 5 star game is that it's light on content. Pick this up\n\nHelpful | 1", "refugio507May 31, 2019 at 11:22 PM\nIt doesn't feel as good as the first one\n\nMy expectations of this game were really high! I was expecting a game with a nice menu where I could decide the game mode, invite my friends, and customize my matches.\n\nThis version of the game simply doesn't feel as organized as the first one. In the first game you even had the Undertaker giving you a tutorial about everything you needed to know. I opened the game expecting something like this and I was simply thrown in a town with other people. I just felt lost.\n\nI was expecting to be able to create custom matches with my friends: 1 vs 1, 2 vs 2, and free for all. I didn't find any button in the town that would let me do this. This is exactly what I was looking forward to doing in Dead and Buried 2.\n\nAdditionally, I joined the Team Deathmatch room, the game starts and I just float without even being able to move.\n\nI wanted to love this game. I got the Quest mainly for this game. But it just doesn't feel as good as the first one. Not even close. Is there even a Horde mode? Because I loved to play that too and I couldn't find it either.\n\nPlease, update this game so that it feels as amazing as the first one. It would mean the world to me.\n\nHelpful | 5", "phntsm408May 26, 2019 at 9:19 PM\nAwesome Multiplayer\n\nI have the Rift and Quest so my wife and I can play this awesome game together! Its wacky and fun and is definitely worth the money. Now, I havent played Dead and Buried 1, but it sounds like this will be even better in the future! After so much sweating, my wife is addicted. We got ourselves a winner!\n\nHelpful | 0", "Miscreant-1Aug 12, 2019 at 9:52 PM\nDead and Buried 2\n\nSuper fun games worth every penny\n\nHelpful | 2", "TonyisDeadAug 9, 2019 at 9:51 PM\n\nI dont like video games and I love this game!\n\nHelpful | 2", "L00kingGlassJun 1, 2019 at 8:52 AM\nUnplayable and Full of Bugs\n\nThis game is a buggy mess that can potentially brick your headset. Do not buy! the game regularly crashes, interactions and hits dont always seem to register, the bots are sometimes invisible. it frequently loses head tracking entirely and locks my headset, forcing me to hard-reset the console and re-create boundaries. It makes the entire system unresponsive frequently.\n\nHelpful | 6\nDeveloper ResponseJun 5, 2019 at 3:41 PM\n\nHi el_presidente, sorry you're having trouble with the game. Sounds like you are having issues with tracking and you should probably contact Oculus Support about it.", "SuperDuperAidanJul 15, 2019 at 7:14 AM\nBest\n\nThis is the best quest game Ive played the game looks great feeels great and all in all is great. The community is amazing and everyone is super nice\n\nHelpful | 1", "brady.zyllaJun 8, 2019 at 10:10 PM\n\nWould be one of my favorite oculus games if I didnt keep having this glitch that is only allowing me to rather hold one pistol at a time and sometimes not able to hold any at all\n\nHelpful | 2", "VRPATMANSIDEKIDSAug 9, 2019 at 10:05 PM\nAmazing!\n\nSo much fun!!!\n\nHelpful | 2", "GwarwickMay 25, 2019 at 4:38 PM\nCool game. But takes time to adjust to\n\nI really like the game but it's taking me a few days to adjust to the motion of it. If you really cant handle motion sickness dont get it as whilst the game has teleport mode it wont let you into most of the arenas without full locomotive.\n\nHelpful | 3\nDeveloper ResponseJun 5, 2019 at 3:46 PM\n\nWe will be adding more comfort and movement options soon.", "ZentryteMay 23, 2019 at 9:39 PM\nReally fun game actually\n\nRuns very smooth on the quest and has good graphics but honestly gameplay is what matters more and its great. Giving 4 star due to the game only having snap to turn not smooth. Hope that changes in the near future! Other than that its great and fun : D\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 3:48 PM\n\nMore options are coming :) Thanks for playing!", "rubico36Jun 20, 2019 at 4:16 AM\nFeels like a demo\n\nMechanics and shooting feels right, nice graphics. Unfortunately this game feels more like demo or beta. Buggy, no customization, no sense of progress, only 2 modes.\n\nHelpful | 5", "JohnnyWLMay 28, 2019 at 11:48 AM\nAwesome title\n\nThis is something I needed. Motion and gun control is smooth and intuitive. Gameplay is exciting. I just wish there was was leveling up of sorts. I wish you could also pick loadouts, and appearance, to make it feel more personal.\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 3:44 PM\n\nThanks for your review! We have updates planned. Stay tuned :)", "EggBuldgeJul 4, 2019 at 1:23 PM\nThis game sucks\n\nThe game has no progression and is horrible on vr. The guys dont hit if they are close because your arm will just go through them and its boring as hell where you spawn next to someone and die right away\n\nHelpful | 2", "NightMonk3yJun 6, 2019 at 12:21 PM\nOk game but reveals personal stuff\n\nFun shooter but its revealing my actual name and not my gamername. So its revealing personal info so avoid tried installing it nothings changed.\n\nHelpful | 13", "Jerryman1963Aug 10, 2019 at 7:39 PM\nMeh\n\nI like some of it. Don't like that there are no longer any AI players. Havig to always play against live players is annoying when you have too many annoying players. Can't escape them.\n\nHelpful | 3\nDeveloper ResponseAug 12, 2019 at 1:55 PM\n\nHello, bots are definitely still in the game. In public matches, empty slots are filled in by bots if there are currently not enough human players. In Private Rooms, players do have the option of disabling bots if there are enough human players on each side. Now if you want to play with ONLY bots, you can certainly start a Private Room with just yourself in it. Hope that helps.", "zekeymanJun 6, 2019 at 4:12 AM\nJust not fun\n\nThere is only one mode (pvp) and thats it. No character customization. No playing with friends. No game modes. Just player v player. I am getting refund. Only reason it get 2 stars is because the gameplay is pretty good. But thats it.... changes needed\n\nHelpful | 3", "Num1gatorJul 13, 2019 at 5:08 PM\nPotential\n\nI was really looking forward to this game because the gameplay videos I saw before buying didnt include the game freezing and clunky mechanics. I kept the game in the hopes that the issues are resolved. Still waiting.\n\nUpdate: Still waiting\n\nHelpful | 1", "WhyKlefJun 8, 2019 at 3:05 PM\nFor those who already got \"VR legs\"\n\nI wasn't gonna buy it but since Horde Mode is scheduled for a later free update, I decided to jump the gun early and I was not disappointed. It's a game that can become highly competitive real quick, and if you're looking for a quick Online FPS shooter itch, this is your title.\n\nFor the ones who had VR for a while, the more intense Team Deathmatch mode has you move as you'd expect in a 2D FPS. But for those who are starting, the duel mode is a great alternative to shooting while not having to worry that you'll get nauseous. The first one is amongst my most played title, once Horde is released and with the already good content, I'd see this one surpass it's predecessor.\n\nHelpful | 2", "coadyjJul 2, 2019 at 7:17 AM\nI would avoid\n\nThe multiplayer is a joke. Nothing but bots, not party or private match capabilities. Rubbish menu system. Obviously Rushed to market.\n\nHelpful | 3\nDeveloper ResponseAug 12, 2019 at 2:19 PM\n\nHi, we just released an update that add support for Private Rooms and also support for meeting up with your Oculus Party members. Check it out and let us know what you think!", "CrazyFinger4Jun 3, 2019 at 9:37 PM\nShootout is Amazeballz!\n\nI can't recommend trying shootout mode more...there currently isn't a way to invite your friends, but not one time did any of the 6 of us have trouble being put in the same lobby. 3 vs 3 shootout with your friends is hands down the best online shooter experience available on the Quest. I literally bought a pair of knee pads to roll around like John Mcclane on my hardwood floor...Don't miss it.\n\nHelpful | 3", "Skaven7Jun 5, 2019 at 8:39 AM\nI love this game.\n\nThis game is a lot of fun to play especially with the shoot out mode. It'll have you diving all over the place! Not sure if my character is a man or a woman yet and I can't seem to see what I look like in the game or how to change how I look. It's still loads of fun though and using the town as a lobby where you can run around and chat to people before diving into a game is a neat idea. I'd like to see a costume shop in the main town where you can change your look and character.\n\nHelpful | 2", "stevewyardMay 26, 2019 at 12:36 PM\nGraphics could be better\n\nI've never felt so sick on a vr game until I played this one it's so bad for motion sickness the game is good itself but not as great as a thought it would be and the graphics are not great especially if your looking at something a bit further away could be better in my opinion\n\nHelpful | 3\nDeveloper ResponseJun 5, 2019 at 3:45 PM\n\nWe will be adding more comfort and movement options in a future update.", "ExcessPanacheMay 24, 2019 at 4:47 PM\nOutstanding\n\nThis game is incredible. Its already improved over the last few days, and Im eagerly awaiting the stuff thats due to be added soon. The fact that voice chat is utterly erratic at the moment needs fixing immediately (this is annoying) but the gameplay is so immediate and satisfying that its hard to love even in its slightly basic current state. Addictive and brilliant.\n\nHelpful | 7\nDeveloper ResponseJun 5, 2019 at 3:47 PM\n\nThanks for the nice comments. We are looking into the voice chat issue.", "TrickxusJun 18, 2019 at 9:29 AM\nAwesome multiplayer fun\n\nI want to give it a lower rating due to some lack of options and general bugginess. But everytime I play it it just puts a smile on my face it's so much fun would love to see more game modes weapons and locations\n\nHelpful | 3", "backpocketMay 25, 2019 at 12:00 PM\nAmazing that this is even possible.\n\nOne of the greatest moments was when I got into my first game and didn't know how to reload. I asked the people I was playing with and they told me. To have that kind of interaction in VR is really something special. The game plays great and runs really smoothly. Sometime it doesn't make since how I hit the person 3 times and they hit me once and I die but hey maybe I'm just not as good. There only 2 complaints. The first is that there's a zapping sound effect that is almost constant and super annoying. (Happens in the dead and buried game too) I have been in several matches where I hear people complaining about that and it annoys me as well. The second complaint is I wish I knew when I was playing against a bot a bit more. I like that if there's not one to play with it'll make bots and you play with them. But I had a game where the entire match I didn't get shot at once. I was doing so well destorying the others. But I noticed noone was talking and noone shot at me ever. And so at the end all the other players names were some clever bot name. I wish it was a little more transparent that I'm playing against a bot and not a human.\n\nThis game is awesome and runs well. I play on my quest and love it. Probably not for everyone because there is alot of movement and could cause motion sickness to people without VR legs yet. It has options for other locomotion but it would effect your ability to play the game and so the only real way to play is by joystick running.\n\n\nIf you like team deathmatch this is great. It has other modes as well too.\n\nCannot wait to see what this developer does in the future.\n\nHelpful | 6\nDeveloper ResponseJun 5, 2019 at 3:47 PM\n\nThanks for your review! We have heard the odd zapping sound as well and are looking into it. Great feedback, too!", "DactaurMay 27, 2019 at 5:30 PM\nLove the game but...\n\nI just played this for the first time, after playing Dead And Buried on the Go, this is NOTHING like that game lol. Its slick and colourful and really really immersive. I have a couple of niggles though which has made me give the three stars. The options and settings are not obvious, nothing tells you where they are, just that they are. I was trying all my buttons and combinations of buttons to try and bring up a menu, eventually resorting to watching a few videos on youtube to find that the settings were in a beam of light on a porch of a building. I didnt even think to look anywhere but my controllers for settings. I think I would prefer to have my settings assigned to a button rather than trying to find that building again each time. My second niggle, is as much as jumping in to a battle with users from around the world is fun, I really just want to have a private battle area that me and my real life mates can kill each other in without worrying about new people. It would be great to arrange a shootout at 8pm in Damons room with my friends. I even think this game would be worth hiring a local village hall or something for a day and having battles in plenty of space with everybody physically in the building. That would be awesome, and something I hope I can do one day. The friends thing is really important, I can live with the settings option being in front of a building I guess, if private rooms become available Ill be back to let everyone know and bump the stars up to 5. Thank you for a brill game by the way !\n\nHelpful | 1\nDeveloper ResponseJun 5, 2019 at 3:44 PM\n\nMaking playing with friends easier for users is high on our list of things we want to address. Thanks for playing and your feedback matters a lot to us!", "yorkdtJun 24, 2019 at 8:36 PM\n\nJust like the rift, awesome.. please add duel game play..\n\nHelpful | 1", "andittleJun 21, 2019 at 12:00 PM\nExactly what I was looking for!\n\nI wanted an online shooter for my shiny new quest and this is perfect! Fast paced and fun, I will definitely keep coming back to this over and over. Pulling off those headshots is super satisfying. Great work devs!\n\nHelpful | 0", "TheDoomGuyJun 1, 2019 at 2:12 AM\nIt doesn't even work.\n\nWhen I enter a match screens goes black and stays there. I don't understand why the game is not working for me since I have a Quest like everyone else it can't be an specs problem. Also tried reinstalling twice. My Quest works perfect with any other game (some of them also online) so it's not a hardware problem.\n\nThe lobby worked but even that was a bad experience, the first time a menu appeared to choose locomotion and this menu were standing behind a column and I couldn't do anything else not even recentering view I had to relaunch the game.\n\nAlso for what I saw in the lobby, the guns are aiming way off, way up that it should, I had to unnaturally rotate my wrist down to aim right. This should be fixed or add a calibration option.\n\nAsking for a refund...\n\nHelpful | 3", "RiellionMay 22, 2019 at 10:38 PM\n\nHonestly was on the fence about this game but the price tag was only $21 and I was intrigued by the idea of running around and shooting other players made me buy the game and I regret nothing. Now a couple of things you guys are going to need to know going in:\n1.) Walk around town and get used to the feeling of the game before you go into a death match and instantly die.\n2.) Realize you are probably going to die a couple of times but once you pick up how to play its great, people cant really post up like in COD and take you out as soon as you go in, its a pretty even playing field just give it time.\n3.) TO RELOAD FLICK YOUR WRISTS or point down real fast and up (took me forever to figure that out)\n\nI really really hope there will be either more games like this or that theres more maps coming up because although I wont say its completely fleshed out I honestly do recommend this game for $20.\n\nHelpful | 6", "arthur2089May 24, 2019 at 1:19 PM\nLost many hours in this game\n\nI have had a blast playing this game. I enjoy both modes, and it gives you a nice workout, crouching/ducking and moving around. I just wish there was a progression system, to give you a sense of purpose for coming in first (as I am always in first place). Or atleast keep track of your stats. I believe this is a feature imperative to helping with the shelf life of this game. I am giving a 5 stars because the foundation is strong and a ton of fun.\n\nHelpful | 5", "irwindaleJun 30, 2019 at 10:48 AM\nNeed coop mode\n\nI want to kill zombie with friend!\n\nHelpful | 2", "Fatbaby2008Jul 29, 2019 at 10:34 PM\nSuper fun\n\nPlay now\n\nHelpful | 1", "Talisman-Jul 26, 2019 at 1:37 PM\nLove this game\n\nLove the shootouts, so much fun.\n\nHelpful | 0", "xiaolong.ma.79May 30, 2019 at 4:49 PM\nStuck on loading screen\n\nIm having the same issue as one of the other reviews.\nUpdate: Fixed by reinstall as dev suggested.\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 3:42 PM\n\nSorry to hear you are having issues. Are you stuck when starting the game from Oculus Home? Or are you stuck after trying to load a match in town. If the former, reinstall the app. If the latter, please try again and if still having issues, please contact us either via the support email or on our discord server: http://ocul.us/dabdiscord", "8888George8888Jun 2, 2019 at 9:15 AM\nGreat but is missing something\n\nThe multiplayer and stuff is great and good but where is the zombies/horde mode once you add that 5 stars\n\nHelpful | 4", "hNs-DeathKnightJun 1, 2019 at 4:57 PM\nOkay but needs to be polished\n\nShoot your opponents quickly and accurately! The game is good but theres some bug at some places that makes the player cant be killed.\n\nHelpful | 1", "leonyahJun 26, 2019 at 7:47 PM\nWish for original Dead & Burried content\n\nThere are very few ways to play compared to the original Dead & Burried game. Also it's annoying having to walk around town to switch to a different scenario.\n\nHelpful | 1", "SirMowerMay 26, 2019 at 7:26 AM\nA top favorite!\n\nThis is one of my top favorite games that launched with the Quest. Shootout mode is awesome, as well as deathmatch. The game is still lacking in some features, but it makes up for that in gameplay. It would be nice if there was some level of customization for weapons and for characters as well as some type of stats or level progression.\n\nHelpful | 1", "GlenLondonJun 12, 2019 at 11:19 AM\nWhat a load of rubbish\n\nGood graphics, but thats all. Its basically just a load of people running around shooting each other, which Rec Room does for free and much better.\n\nHelpful | 4", "BennyQuestMay 25, 2019 at 4:36 PM\nQuake VR\n\nSimple, fun and fast paced. If you liked quake arena you are going to love this game. It might lack a bit in content at this point but what is there just works and looks great on the quest. I just wish there would be more options. Not having to hold down the grip button all the time would be great for example.\n\nHelpful | 1", "ShadowSaviorMay 26, 2019 at 9:12 PM\nShootout mode rocks\n\nThe deathmatch using locomotion isnt great but the shootout mode where you take cover had me literally on the floor peaking around obstacles and loving every second of it. Id love to see more of this type of gameplay added.\n\nHelpful | 2", "cring.festJun 10, 2019 at 4:44 AM\nAwesome\n\nGreat game lots of fun just wished there was more than deathmatch and showdown\n\nHelpful | 1", "DizzzieMay 23, 2019 at 5:29 PM\nDecent but needs more content\n\nNeeds more content!\n\nHelpful | 4", "Dead11SinMay 20, 2019 at 12:26 PM\nIt's Lit!\n\nGreat game!\n+ more content coming soon\n\nHelpful | 28", "SoapySonJul 24, 2019 at 2:00 PM\nGreat but needs instructions\n\nGreat and love it, definitely worth the money both death match and saloon shootout are so fun. Big wish is to have a menu screen added with all the arenas and count of online players on each area. Often is the deciding factor in which level to play and hard to work out otherwise.\n\nHelpful | 1", "DoctorCodeMay 25, 2019 at 10:28 PM\nNot Enough Content\n\nCompared to the first Dead and Buried, this one is severely lacking in scope of content. Just seems like it was quickly slapped together for the sake of being a launch title. Will purchase again once there is more content.\n\nHelpful | 3\nDeveloper ResponseJun 5, 2019 at 3:45 PM\n\nMore content is coming. Stay tuned!", "FadboyJun 2, 2019 at 5:49 AM\nWaiting for updates\n\nUnfinished game, seems like they rushed to have it out on the oculus quest released day. I have a rift, and the first dead and buried is better. Hopefully the updates come soon\n\nHelpful | 1", "Jordan_E_SimonMay 30, 2019 at 1:42 AM\nLove it, but...\n\nSuper entertaining and I love playing it, but I wish it wasnt so difficult to play w/ friends.\n\nHelpful | 2", "Truculence78Jun 30, 2019 at 6:03 AM\nLove it!\n\nI'm generally not a first person shooter fan but I'm really enjoying this game.\n\nHelpful | 1", "SeeGuyMay 25, 2019 at 10:39 AM\nSo good\n\nThis game is a blast. If you could just add smooth turning with the joystick itd be out of this world!\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 3:47 PM\n\nWe hear you! Stay tuned.", "WhiteDawgMay 28, 2019 at 10:16 PM\nGREAT EXPERIENCE\n\nHad a blast playing shootout and meeting new people. The snap turning does make me queasy in The open world and when walking up/downstairs even in comfort mode but I think that has to do with me being new to VR. Thanks for the amazing product!\n\nHelpful | 1\nDeveloper ResponseJun 5, 2019 at 3:43 PM\n\nGreat to hear! We will be adding more comfort and movement options in a future update.", "AlphaWarrior1May 25, 2019 at 6:33 PM\nGreat Game But Get Motion Sick Easily\n\nThis game is great, with all of its game modes, and good shooting mechanics, the only problem or at least for me is I get motion stick really easily when playing this game for 30+\n\nHelpful | 3\nDeveloper ResponseJun 5, 2019 at 3:45 PM\n\nSorry to hear that. We will be adding more comfort and movement settings in a future update.", "occolusthaiMay 29, 2019 at 10:02 AM\nReally fun\n\nI really enjoy this game, this is my first shooting game vr with others online, very satisfied, but one time my experience was I cannot grap the guns, I have to shutdown the Quest and restart, then it worked, go to buy this, really fun\n\nHelpful | 1", "YetiGolf25May 25, 2019 at 3:59 PM\nShoot out mode is amazing!\n\nThe shootout mode is my favorite quest experience so far. Have a large playing space and get ready to have a blast. Using the cover like in real life is so much fun. Keep it up! Hopefully we get more game modes and player progression levels in the future!\n\nHelpful | 1", "BitterMcLungieJun 24, 2019 at 6:45 PM\nMost entertainment that I have\n\nNon stop addictive action. A lot of real people from all over the world to play with and against.\n\nHelpful | 1", "clairfamily2000May 21, 2019 at 12:12 PM\nStuck on loading screen\n\nWould be nice to play. Load screen wheel just spins and spins\n\nHelpful | 12\nDeveloper ResponseJun 5, 2019 at 3:51 PM\n\nPlease try again, it is possible you ran into a network issue or you may have run into an Oculus system wide issue with games not loading. We recommend reinstalling the app if you have this problem. Please contact us on our discord trouble if you continue to have issues: http://ocul.us/dabdiscord", "Tristan6776Jun 13, 2019 at 6:18 PM\nI dont know\n\nTried it didnt care for the shooting and moving, my refund was denied for some reason??? Will try it again it because i have to. It may get better hopefully. I hate to leave a bad review but i didn't have fun and i\n\nHelpful | 1", "james.barszcz.5May 30, 2019 at 8:52 PM\nFun\n\nSuper fun just needs some fixes and different maps\n\nHelpful | 3", "lefoulkrodJun 15, 2019 at 6:49 AM\nUnderrated\n\nThis games multiplayer shoot out is super fun and worth the price of the game alone. This game is underrated. You should buy it.\n\nHelpful | 1", "DingYeaJun 11, 2019 at 6:27 PM\nkeep loading at startup\n\nI have bought this game but I am not able to try it. I halted at game start up screen please fix it!\n\nHelpful | 3\nDeveloper ResponseAug 12, 2019 at 2:21 PM\n\nHi, we just released an update that fixed several connection related issues. Hope you give it another try!", "Gecko54May 29, 2019 at 8:14 AM\nGreat games\n\nThis game has all the aspects a vr game should have. Ability to socialize, plenty of comfort settings, locomotion, town location where you can just chill and meet people and lastly plenty of game modes.\n\nHelpful | 2", "MilkToast_415313Jun 3, 2019 at 2:15 PM\nGreat multiplayer fun\n\nThis is a great time with other users. Great game.\n\nHelpful | 0", "dnlmMay 26, 2019 at 9:10 AM\nThis is what I bought the Quest for\n\nHad a blast playing Tower Tag at the local VR arcade and hoped to recreate that experience on the Quest. The shootouts are pretty close (didn't bother for deathmatch, sorry), I just need a bigger play space!\n\nHelpful | 2", "agameoftwoMay 25, 2019 at 11:14 AM\nHow the west was fun\n\nIf you are ready for mutliplayer fps vr.. This game is it. Smooth, fast gameplay. Hide behind actual coverage (duck in real life to duck behind a boulder).\n\nJust awesome. A must buy for mutliplayer gaming.\n\nHelpful | 1", "KraznRaznMay 25, 2019 at 12:12 AM\nA must own for the Quest!\n\nIve played both the Quest and Rift versions. This game is great fun. Ive run into very friendly helpful people. Controls are great, shooting great, environment great. Best game I dont hear many taking about.\n\nHelpful | 0", "Indeed77Jun 8, 2019 at 11:36 AM\nGreat game. A must have.\n\nDidn't experience any flaws which I read about. All around, insanely fun. The shoot out mode is truly, indeed. Knee pads aren't a bad idea.\n\nHelpful | 0", "atticuszaneyJun 10, 2019 at 3:21 PM\n\nYeah its good to have multiplayer deathmatch FPS on quest, its nice to jump between this and rec room paintball\n\nHelpful | 1", "DoogHMay 22, 2019 at 10:22 PM\nNot fun\n\nFrankly, trying to turn around quickly is a pain. Furthermore, this game constantly asks you if you want to switch control schemes every time you load into town.\n\nThe game is redundant and a novelty at best. Should be $5\n\nHelpful | 3\nDeveloper ResponseJun 5, 2019 at 3:48 PM\n\nThe control scheme thing is a bug and will be fixed in the first update. It goes away after you relaunch the game.", "shane34May 29, 2019 at 9:32 AM\nMultiplayer\n\nGame will not load for me and keeps crashing I played 2 shootout games looked amazing and was fun but wont let me into deatmatch games :( of it wasnt for this I would have given 5 stars\n\nHelpful | 2\nDeveloper ResponseJun 5, 2019 at 3:43 PM\n\nSorry to hear this. If you were able to get into shootout matches then deathmatch should also work. Are you using teleport or joystick movement? If you are using the teleport movement option we prevent those users from entering deathmatch. If you saw a black screen, please try again as there were issues with some servers at launch.", "mhstnscMay 24, 2019 at 3:36 PM\n\n, I had to disable free loco so I cannot play certain levels\n\nHelpful | 0\nDeveloper ResponseJun 5, 2019 at 3:48 PM\n\nWe will be adding more movement options in an update. I hope you can find something that fits your comfort level and play some deathmatch!", "alexbwernerMay 22, 2019 at 8:25 PM\nAwesome!\n\nDidnt work at first so uninstalled and reinstalled. Now that its working it is incredible! The shootout mode is so unique and tons of fun!\n\nHelpful | 5", "vrbear1977May 30, 2019 at 9:09 AM\n\nThe shoot out was a very amazing and intense experience. Thanks for the adventurous experience i just had right on the floor of my living room\n\nHelpful | 1", "unskilledjaredJun 9, 2019 at 10:56 AM\nHaving a blast!\n\nThis game is fun to play. I love being able to crouch down behind boxes and shooting opponents!\n\nHelpful | 1", "HK19May 22, 2019 at 9:26 PM\nPlay With Friend Option?\n\nPlease add an option to invite friends to your match. Many other game have this feature.\n\nGreat PVP game, wish there was a tutorial. But need to be able to invite my friends.\n\nHelpful | 3", "ToxicSpeckMay 23, 2019 at 10:49 AM\nGreat and Polished\n\nThis game is action packed and fun for the family. My favorite mode is shoot out and you stay in place rolling around, having fun, and your arginine starts running.\n\nHelpful | 1", "asd92132May 21, 2019 at 12:48 PM\nNice game ~~\n\nIts nice but my VR sickness is so bad ...... Play for 10min and need rest now...\n\nHelpful | 9", "NVRflameMay 21, 2019 at 10:12 PM\nSICK\n\nBut not in the good way! Like many others are saying, gives me serious motion sickness when moving around.\n\nHelpful | 10\nDeveloper ResponseJun 5, 2019 at 3:50 PM\n\nYou can change your locomotion settings from joystick to teleport at the Settings menu in town. We recommend the Shootout gamemode events for those sensitive to virtual locomotion. More gamemodes that do not require locomotion are coming in updates, too :)", "darwins.lastMay 23, 2019 at 7:08 PM\nToo Much Fun!\n\nGreatest time meeting people and then battling it out. Incredible graphics, sound, and music. Tracking and framerates are perfect!!!\n\nHelpful | 2", "justin.wrong.921May 28, 2019 at 10:30 AM\nFun but a few minor issues\n\nSometimes when I join I am super tall and floating then my headset loses tracking but that's the only problem I've had\n\nHelpful | 1\nDeveloper ResponseJun 5, 2019 at 3:44 PM\n\nHello! You may need to recenter yourself. It is possible you launched the game when sitting then stood up. You can hold down the \"oculus\" button on the right Touch controller for 2 seconds to recenter your height. I hope this helps!", "Poppop1971Jun 8, 2019 at 2:45 PM\n\nFun, quick games, no pressure exactly what video gaming was meant to be\n\nHelpful | 1", "DennyD13May 22, 2019 at 9:13 AM\nExcellent\n\nThe shootout mode is a lot of fun.\n\nHelpful | 3", "zac.shafferMay 25, 2019 at 4:45 PM\nGame Stuck on Load Screen\n\nWould be nice to try the game, but its stuck on the loading screen. Waste of $ so far\n\nHelpful | 4\nDeveloper ResponseJun 5, 2019 at 3:46 PM\n\nPlease try again, there may have been a network issue or you may have run into a Oculus system wide issue with games not loading. We recommend reinstalling the app if you have this problem. If you keep running into problems you can contact us on our discord: http://ocul.us/dabdiscord", "Wishful_YTMay 22, 2019 at 11:47 AM\nIts okay.\n\nDisappointed with lack of content, and no tutorial or game mechanic explanation makes the game a turnoff. Also, I dont understand why there are not many settings.\n\nHelpful | 6\nDeveloper ResponseJun 5, 2019 at 3:49 PM\n\nThere are currently 4 Shootout maps and 5 Deathmatch. We plan to add more content as well. We are also adding more movement options.", "witboy83May 30, 2019 at 3:39 PM\nGreat!\n\nReally like this! I loved first one and this one is also great. Very fun to play, shootouts are my favorite.\n\nHelpful | 0", "DungeonquestJun 3, 2019 at 2:09 PM\nLove it\n\nGreat Shootout-Mode! A oneonone duel-mode with a friend would be awesome :)\n\nHelpful | 1", "timduruJun 29, 2019 at 9:14 AM\nNot worth the money\n\nboring and repetitive\n\nHelpful | 0", "GaryOptMay 22, 2019 at 4:54 PM\nSo good!\n\nPlayed for hours and hours!! Its a little dizzying but not much that I cant play.\n\nI hope there are more variety of maps.\n\nHelpful | 0", "sergio.hickeyJun 6, 2019 at 1:26 PM\nBad motion sickness\n\nMade pretty poorly. Shallow gameplay. Wonky movement. Worth a few bucks at the most, but honestly isnt worth most peoples time.\n\nHelpful | 1", "AppollionJun 7, 2019 at 10:42 AM\nBought this game but cant invite friend\n\nIf You want to play with your friend, dont buy it. You can Play only with random players or bots.. asked for refund\n\nHelpful | 2", "TribEofJudahMay 26, 2019 at 10:36 AM\nAmazing\n\nI ran into my wall this game got so intense\n\nHelpful | 2", "finniegMay 30, 2019 at 8:01 AM\nTons of Potential\n\nReally enjoying the game so far just wiah there were more maps and modes.\n\nHelpful | 1", "justin.rudolphJul 4, 2019 at 12:00 PM\n\nBest came for quest hands down\n\nHelpful | 1"]