{"App Title": "Dear Angelica", "App description": "From Emmy Award winning Oculus Story Studio comes Dear Angelica, a journey through the magical and dreamlike ways we remember our loved ones. Entirely painted by hand inside of VR, Dear Angelica plays out in a series of memories that unfold around you. An immersive, illustrative short story starring Geena Davis and Mae Whitman.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "", "Languages": "English", "Version": "3.0", "Developer": "Oculus Story Studio", "Publisher": "Oculus", "Website": "http://www.oculus.com/", "Release Date": "October 22, 2019", "Developer Privacy Policy": "None", "Space Required": "2.99 GB"}



["5 stars\n65%\n4 stars\n16%\n3 stars\n13%\n2 stars\n4%\n1 star\n3%", "Droculah9 days ago\nBeautiful\n\nThis was a perfect mixture of hand drawn art and immersive storytelling. It's short, which works well here. Sit down (make sure you have room to spin around), relax, and get ready to be totally engaged by the visuals. Much better than I expected, due to the silly armchair critics who will find anyhhing to complain about. A great piece to experience, and show a friend new to VR.\n\nHelpful | 1", "TheSpyHunt3rMay 29 at 2:54 PM\nBeautiful and Inspiring Tribute\n\nI didn't know what to expect when launching this title. I certainly didn't expect to be taken on a beautiful trip through the life of a child with her famous, movie-star mother (voiced by Gena Davis). It was a very entertaining piece of art, and I enjoyed it thoroughly.\n\nHelpful | 20", "ordagan5 days ago\nMore like this please\n\nI would want nothing else than more of these types of adventures on the quest. Living inside a movie.\n\nHelpful | 1", "johnnyotv21 days ago\nIncredible!\n\nI was amazed! This production really shows the potential for VR entertainment in general. Also, having very recently lost my mother, it particularly hit home with the heart strings!\n\nHelpful | 1", "Banja78May 20 at 9:13 AM\nBeautiful\n\nThis is not a game but a story painted around you. It is incredibly beautiful and touching. I do highly recommend it. I will certainly watch it again and would love to see similar realisations in the future. If you like painting, storytelling, and 360 videos, please watch this perfect match.\n\nHelpful | 5", "evandaganApr 18 at 8:12 PM\nNeat short film\n\nIt's a 3D, strictly 3DOF short film. And \"film\" might be stretching it, since it's not really animated, but rather illustrated and narrated in typical \"Quill Theater\" fashion. It's a touching story and good use of VR as a storytelling medium, and there are some nicely drawn scenes. However, there's not much to it beyond that. Compared to similar \"experiences\" like \"Notes on Blindness\" or \"The Key\" this is not interactive at all - a purely passive experience. (I wish Oculus would create a separate category for this type of content)\n\nOnly four stars because the Quest version was limited to 3DOF, where it seems like allowing some head movement would have been really easy for the developers.\n\nHelpful | 6", "Bender_2112May 20 at 1:12 PM\nBeautiful!\n\nIm really loving what people can do with Quill Theater. There are some amazing storytellers out there. Dear Angelica is a wonderful piece. Like visual music. A beautiful dream.\n\nHelpful | 3", "serpe.massimoJun 9 at 11:20 AM\nOnly 3dof, cartone brutto\n\nTralasciando che il cartone ha un eroina femminile con tendenze lesbo, lo sforzo di guardarlo lo si poteva anche fare, ma quando scopri che ha solo 3gradi di libert come qualsiasi video 3d, per poi  un cartone che poteva per questo essere benissimo a 6 gradi di libert, come i cartoni di quill, allora bocciato in pieno! uno spreco di gb inutili\n\nHelpful | 2", "Sh4dowqueenMar 7 at 4:34 PM\nMy VR Cover soaked up all my tears\n\nOne of the best storytelling experiences of all time. I wish I was standing up to see all 360 instead of sitting in bed and twisting around. Something about the astronaut scene did me in and then I was a goner all the way through the credits.\n\nHelpful | 11", "laurak123Jan 27 at 12:28 PM\nBeautiful short experience\n\nThis wonderful short movie you through a beautifully hand painted (in VR) story of a girl remembering her mother. With Some Magical 360 surroundings (I couldnt see everything because I was aseat and couldnt turn around on my couch), be ready to be amazed for about 10 minutes. I felt relaxed at the end and called my mom first thing after seeing it :) So happy to find enrichening little experiences like this on VR!\n\nHelpful | 34", "Brenthas1Jan 30 at 1:35 AM\nWho is cutting onions?!\n\nHaving been around the block in vr Ive seen plenty of these 360 videos that try to move you in some way. But this one is less about trying to blow you away with cool animations, and more about sharing emotion with you. About halfway through I realized this really isnt about you (or me) having a cool vr experience, this is a living monument to someones loved one. This is more or less an epitaph beautifully memorializing someone who you can tell meant the world to the creator of this. Its incredible the amount of empathy I felt watching this, and I just wanted to reach out and hug the person who made this. This video is a beautiful reminder that life is short and goodbyes arent always perfect, so we need to treasure the little moments we have with the people who matter to us.\n\nHelpful | 25", "OrcusMaximusMay 20 at 11:57 PM\nBeautiful graphics, but...\n\nGraphics are really beautiful. Shame that they are let down by the story. Tedious and a lazy tear-jerker ending.\n\nHelpful | 2", "linkinprkmxFeb 4 at 4:46 AM\nBeutiful, but boring\n\nI like the graphics on this short film, just I had to skip sections as it was too long the story ended telling you the idea and the images just seem staying forever, I am sure that if I was on acid thisll be better, but I wasnt and I had to skip those parts that didnt tell me more about the story, it was just like timing from the filmmaker, that I do have a mix feeling about it.\n\nHelpful | 6", "Cenks22 days ago\nBeautiful\n\nKeep up the great work!\n\nHelpful | 0", "SFMikeMar 2 at 4:48 PM\nInteresting Chick Flick\n\nVery artistic and well done Chick Flick which shows potential for future less cliche female oriented stories. Unfortunately to me it was like being lost in a bad Hallmark Movie.\n\nHelpful | 7", "Mister_FonzieFeb 6 at 6:56 PM\nHeartwarming experience\n\nThis is VR storytelling at its best. It's a great experience for those with mature sensibilities, especially those who are missing a loved one who has passed on.\n\nHelpful | 7", "dvazanaApr 19 at 12:53 AM\nPretty and immersive, but too slow\n\nLovely artwork and ways to draw your attention around the world as the story plays out, but almost uncomfortably lingers on static scenes as if forcefully attempting to elicit some deeper reaction, rather than letting the story play out naturally. The sequence in space was quite beautiful and immersive.\n\nHelpful | 0", "ViruZAngelJan 26 at 11:17 AM\nepic\n\nfirst review\n\nHelpful | 3", "mark.burton22Feb 13 at 1:27 PM\n\nExcellent\n\nHelpful | 1", "MivicoJan 29 at 8:26 AM\nNot in french ??\n\nPlease make french possible.\n\nHelpful | 3"]