{"App Title": "Death Lap", "App description": "Death Lap is a VR combat racing game that challenges you to drive to survive. Just point and shoot to destroy everything in your path. Hit the road, perform drifts and stunts, navigate traps, unleash your weapons and special abilities, and enjoy the chaos of its battlefields.\n\nA darkly comic, combat racing game that will leave you howling with laughter as you put your life on the line. Captured by Nitro Saint Payne  a maniacal yet tragic man, you are thrown into his deadly TV show where you must race and battle other drivers to win your freedom.\n\nFeatures\nChoose your car and use its weapons and powers to change the game.\nEnjoy various environments and take advantage of its traps, paths, and obstacles.\nIncrease your speed with boosters and NOS fuel.\nControl your car in first or third-person view.\nBattle solo or with friends to test your might and speed. \nRank in the Global Leaderboard.\nVoIP chat to communicate with your opponents.", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Racing, Shooter", "Languages": "English", "Version + Release Notes": "9.36", "Developer": "OZWE Games", "Publisher": "OZWE Games", "Website": "https://www.ozwe.com/deathlap/", "Release Date": "December 5, 2019", "Developer Privacy Policy": "GAMES\nSTUDIO\nBLOG\nPRESS\nPrivacy Policy\n\nOZWE SA is committed to safeguarding your privacy. Contact us at if you have any questions or problems regarding the use of your Personal Dataand we will gladly assist you.\n\nBy using this site or/and our services, you consent to the Processing of your Personal Data as described in this Privacy Policy.\n\nTable of Contents\nDefinitions used in this Policy\nData protection principles we follow\nWhat rights do you have regarding your Personal Data\nWhat Personal Data we gather about you\nHow we use your Personal Data\nWho else has access to your Personal Data\nHow we secure your data\nInformation about cookies\nContact information\nDefinitions\n\nPersonal Data any information relating to an identified or identifiable natural person.\nProcessing any operation or set of operations which is performed on Personal Data or on sets of Personal Data.\nData subject a natural person whose Personal Data is being Processed.\nChild a natural person under 16 years of age.\nWe/us (either capitalized or not)  OZWE SA\n\nData Protection Principles\n\nWe promise to follow the following data protection principles:\n\nProcessing is lawful, fair, transparent. Our Processing activities have lawful grounds. We always consider your rights before Processing Personal Data. We will provide you information regarding Processing upon request.\nProcessing is limited to the purpose. Our Processing activities fit the purpose for which Personal Data was gathered.\nProcessing is done with minimal data. We only gather and Process the minimal amount of Personal Data required for any purpose.\nProcessing is limited with a time period. We will not store your personal data for longer than needed.\nWe will do our best to ensure the accuracy of data.\nWe will do our best to ensure the integrity and confidentiality of data.\nData Subjects rights\n\nThe Data Subject has the following rights:\n\nRight to information meaning you have to right to know whether your Personal Data is being processed; what data is gathered, from where it is obtained and why and by whom it is processed.\nRight to access meaning you have the right to access the data collected from/about you. This includes your right to request and obtain a copy of your Personal Data gathered.\nRight to rectification meaning you have the right to request rectification or erasure of your Personal Data that is inaccurate or incomplete.\nRight to erasure  meaning in certain circumstances you can request for your Personal Data to be erased from our records.\nRight to restrict processing  meaningwhere certain conditions apply, you have the right to restrict the Processing of your Personal Data.\nRight to object to processing meaning in certain cases you have the right to object to Processing of your Personal Data, for example in the case of direct marketing.\nRight to object to automated Processing meaning you have the right to object to automated Processing, including profiling; and not to be subject to a decision based solely on automated Processing. This right you can exercise whenever there is an outcome of the profiling that produces legal effects concerning or significantly affecting you.\nRight to data portability you have the right to obtain your Personal Data in a machine-readable format or if it is feasible, as a direct transfer from one Processor to another.\nRight to lodge a complaint in the event that we refuse your request under the Rights of Access, we will provide you with a reason as to why. If you are not satisfied with the way your request has been handled please contact us.\nRight for the help ofsupervisory authority meaning you have the right for the help of a supervisory authority and the right for other legal remedies such as claiming damages.\nRight to withdraw consent you have the right withdraw any given consent for Processing of your Personal Data.\nData we gather\n\nInformation you have provided us with\nThis might be your e-mail address, name, billing address, home address etc  mainly information that is necessary for delivering you a product/service or to enhance your customer experience with us. We save the information you provide us with in order for you to comment or perform other activities on the website. This information includes, for example, your name and e-mail address.\n\nInformation automatically collected about you\nThis includes information that is automatically stored by cookies and other session tools. For example, your shopping cart information, your IP address, your shopping history (if there is any) etc. This information is used to improve your customer experience. When you use our services or look at the contents of our website, your activities may be logged.\n\nInformation from our partners\nWe gather information from our trusted partners with confirmation that they have legal grounds to share that information with us. This is either information you have provided them directly with or that they have gathered about you on other legal grounds. See the list of our partnershere.\n\nPublicly available information\nWe might gather information about you that is publicly available.\n\nHow we use your Personal Data\n\nWe use your Personal Data in order to:\n\nprovide our service to you. This includes for example registering your account; providing you with other products and services that you have requested; providing you with promotional items at your request and communicating with you in relation to those products and services; communicating and interacting with you; and notifying you of changes to any services.\nenhance your customer experience;\nfulfil an obligation under law or contract;\n\nWe use your Personal Data on legitimate grounds and/or with your Consent.\n\nOn the grounds of entering into a contract or fulfilling contractual obligations, we Process your Personal Data for the following purposes:\n\nto identify you;\nto provide you a service or to send/offer you a product;\nto communicate either for sales or invoicing;\n\nOn the ground of legitimate interest, we Process your Personal Data for the following purposes:\n\nto send you personalized offers* (from us and/or our carefully selected partners);\nto administer and analyse our client base (purchasing behaviour and history) in order to improve the quality, variety, and availability of products/ services offered/provided;\nto conduct questionnaires concerning client satisfaction;\n\nAs long as you have not informed us otherwise, we consider offering you products/services that are similar or same to your purchasing history/browsing behaviour to be our legitimate interest.\n\nWith your consent we Process your Personal Data for the following purposes:\n\nto send you newsletters and campaign offers (from us and/or our carefully selected partners);\nfor other purposes we have asked your consent for;\n\nWe Process your Personal Data in order to fulfil obligation rising from law and/or use your Personal Data for options provided by law. We reserve the right to anonymise Personal Data gathered and to use any such data. We will use data outside the scope of this Policy only when it is anonymised. We save your billing information and other information gathered about you for as long as needed for accounting purposes or other obligations deriving from law.\n\nWe might process your Personal Data for additional purposes that are not mentioned here, but are compatible with the original purpose for which the data was gathered. To do this, we will ensure that:\n\nthe link between purposes, context and nature of Personal Data is suitable for further Processing;\nthe further Processing would not harm your interests and\nthere would be appropriate safeguard for Processing.\n\nWe will inform you of any further Processing and purposes.\n\nWho else can access your Personal Data\n\nWe do not share your Personal Data with strangers. Personal Data about you is in some cases provided to our trusted partnersin order to either make providing the service to you possible or to enhance your customer experience. We share your data with:\n\nOur processing partners:\n\nMailchimp\nInfomaniak\nElegant Themes\n\nOur business partners:\n\nNone\n\nConnected third parties:\n\nNone\n\nWe only work with Processing partners who are able to ensure adequate level of protection to your Personal Data. We disclose your Personal Data to third parties or public officials when we are legally obliged to do so. We might disclose your Personal Data to third parties if you have consented to it or if there are other legal grounds for it.\n\nHow we secure your data\n\nWe do our best to keep your Personal Data safe. We use safe protocols for communication and transferring data (such as HTTPS). We use anonymising and pseudonymising where suitable. We monitor our systems for possible vulnerabilities and attacks.\n\nEven though we try our best we can not guarantee the security of information. However, we promise to notify suitable authorities of data breaches. We will also notify you if there is a threat to your rights or interests. We will do everything we reasonably can to prevent security breaches and to assist authorities should any breaches occur.\n\nIf you have an account with us, note that you have to keep your username and password secret.\n\nChildren\n\nWe do not intend to collect or knowingly collect information from children. We do not target children with our services.\n\nCookies and other technologies we use\n\nWe use cookies and/or similar technologies to analyse customer behaviour, administer the website, track users movements, and to collect information about users. This is done in order to personalise and enhance your experience with us.\n\nA cookie is a tiny text file stored on your computer. Cookies store information that is used to help make sites work. Only we can access the cookies created by our website. You can control your cookies at the browser level. Choosing to disable cookies may hinder your use of certain functions.\n\nWe use cookies for the following purposes:\n\nNecessary cookies  these cookies are required for you to be able to use some important features on our website, such as logging in. These cookies dont collect any personal information.\nFunctionality cookies  these cookies provide functionality that makes using our service more convenient and makes providing more personalised features possible. For example, they might remember your name and e-mail in comment forms so you dont have to re-enter this information next time when commenting.\nAnalytics cookies  these cookies are used to track the use and performance of our website and services\nAdvertising cookies  these cookies are used to deliver advertisements that are relevant to you and to your interests. In addition, they are used to limit the number of times you see an advertisement. They are usually placed to the website by advertising networks with the website operators permission. These cookies remember that you have visited a website and this information is shared with other organisations such as advertisers. Often targeting or advertising cookies will be linked to site functionality provided by the other organisation.\n\nYou can remove cookies stored in your computer via your browser settings. Alternatively, you can control some 3rd party cookies by using a privacy enhancement platform such as optout.aboutads.info or youronlinechoices.com. For more information about cookies, visit allaboutcookies.org.\n\nWe use Google Analytics to measure traffic on our website. Google has their own Privacy Policy which you can review here. If youd like to opt out of tracking by Google Analytics, visit the Google Analytics opt-out page.\n\nContact Information\n\nOZWE Games\nRue des Terreaux 20\nCH  1003 Lausanne\nContact\n\nSupervisory Authority\n\nhttp://www.edoeb.admin.ch/\ncontact20@edoeb.admin.ch\n+41 31 322 4395\n\nConsent\n\nTo use this website, you accepted our Privacy Policy. If you wish to withdraw your acceptance, please use our Privacy Tools.\n\nChanges to this Privacy Policy\n\nWe reserve the right to make change to this Privacy Policy.\nLast modification was made . 2018-06-20\n\nGAMES\nDeath Lap\nAnshar Online\n Ships\nAnshar Wars 2\nVRtillery\nAnshar Wars\nSTUDIO\nMission\nTeam\nHistory\nPress Room\nContact\nPrivacy Policy\n\nOZWE Games\nRue des Terreaux 20\nCH  1003 Lausanne  View map\n\nSTAY CONNECTED\n\nJoin our mailing list to get updates about the next VR gaming revolution and receive amazing offers!\n\n\n\n\nBy using this form you agree with the storage and handling of your data by OZWE Games\n\n\n\n\n OZWE SA, all rights reserved. Official partner: Oculus. Institutional support: Pro Helvetia | SPEI\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.OkPrivacy policy", "Developer Terms of Service": "GAMES\nSTUDIO\nBLOG\nPRESS\nPrivacy Policy\n\nOZWE SA is committed to safeguarding your privacy. Contact us at if you have any questions or problems regarding the use of your Personal Dataand we will gladly assist you.\n\nBy using this site or/and our services, you consent to the Processing of your Personal Data as described in this Privacy Policy.\n\nTable of Contents\nDefinitions used in this Policy\nData protection principles we follow\nWhat rights do you have regarding your Personal Data\nWhat Personal Data we gather about you\nHow we use your Personal Data\nWho else has access to your Personal Data\nHow we secure your data\nInformation about cookies\nContact information\nDefinitions\n\nPersonal Data any information relating to an identified or identifiable natural person.\nProcessing any operation or set of operations which is performed on Personal Data or on sets of Personal Data.\nData subject a natural person whose Personal Data is being Processed.\nChild a natural person under 16 years of age.\nWe/us (either capitalized or not)  OZWE SA\n\nData Protection Principles\n\nWe promise to follow the following data protection principles:\n\nProcessing is lawful, fair, transparent. Our Processing activities have lawful grounds. We always consider your rights before Processing Personal Data. We will provide you information regarding Processing upon request.\nProcessing is limited to the purpose. Our Processing activities fit the purpose for which Personal Data was gathered.\nProcessing is done with minimal data. We only gather and Process the minimal amount of Personal Data required for any purpose.\nProcessing is limited with a time period. We will not store your personal data for longer than needed.\nWe will do our best to ensure the accuracy of data.\nWe will do our best to ensure the integrity and confidentiality of data.\nData Subjects rights\n\nThe Data Subject has the following rights:\n\nRight to information meaning you have to right to know whether your Personal Data is being processed; what data is gathered, from where it is obtained and why and by whom it is processed.\nRight to access meaning you have the right to access the data collected from/about you. This includes your right to request and obtain a copy of your Personal Data gathered.\nRight to rectification meaning you have the right to request rectification or erasure of your Personal Data that is inaccurate or incomplete.\nRight to erasure  meaning in certain circumstances you can request for your Personal Data to be erased from our records.\nRight to restrict processing  meaningwhere certain conditions apply, you have the right to restrict the Processing of your Personal Data.\nRight to object to processing meaning in certain cases you have the right to object to Processing of your Personal Data, for example in the case of direct marketing.\nRight to object to automated Processing meaning you have the right to object to automated Processing, including profiling; and not to be subject to a decision based solely on automated Processing. This right you can exercise whenever there is an outcome of the profiling that produces legal effects concerning or significantly affecting you.\nRight to data portability you have the right to obtain your Personal Data in a machine-readable format or if it is feasible, as a direct transfer from one Processor to another.\nRight to lodge a complaint in the event that we refuse your request under the Rights of Access, we will provide you with a reason as to why. If you are not satisfied with the way your request has been handled please contact us.\nRight for the help ofsupervisory authority meaning you have the right for the help of a supervisory authority and the right for other legal remedies such as claiming damages.\nRight to withdraw consent you have the right withdraw any given consent for Processing of your Personal Data.\nData we gather\n\nInformation you have provided us with\nThis might be your e-mail address, name, billing address, home address etc  mainly information that is necessary for delivering you a product/service or to enhance your customer experience with us. We save the information you provide us with in order for you to comment or perform other activities on the website. This information includes, for example, your name and e-mail address.\n\nInformation automatically collected about you\nThis includes information that is automatically stored by cookies and other session tools. For example, your shopping cart information, your IP address, your shopping history (if there is any) etc. This information is used to improve your customer experience. When you use our services or look at the contents of our website, your activities may be logged.\n\nInformation from our partners\nWe gather information from our trusted partners with confirmation that they have legal grounds to share that information with us. This is either information you have provided them directly with or that they have gathered about you on other legal grounds. See the list of our partnershere.\n\nPublicly available information\nWe might gather information about you that is publicly available.\n\nHow we use your Personal Data\n\nWe use your Personal Data in order to:\n\nprovide our service to you. This includes for example registering your account; providing you with other products and services that you have requested; providing you with promotional items at your request and communicating with you in relation to those products and services; communicating and interacting with you; and notifying you of changes to any services.\nenhance your customer experience;\nfulfil an obligation under law or contract;\n\nWe use your Personal Data on legitimate grounds and/or with your Consent.\n\nOn the grounds of entering into a contract or fulfilling contractual obligations, we Process your Personal Data for the following purposes:\n\nto identify you;\nto provide you a service or to send/offer you a product;\nto communicate either for sales or invoicing;\n\nOn the ground of legitimate interest, we Process your Personal Data for the following purposes:\n\nto send you personalized offers* (from us and/or our carefully selected partners);\nto administer and analyse our client base (purchasing behaviour and history) in order to improve the quality, variety, and availability of products/ services offered/provided;\nto conduct questionnaires concerning client satisfaction;\n\nAs long as you have not informed us otherwise, we consider offering you products/services that are similar or same to your purchasing history/browsing behaviour to be our legitimate interest.\n\nWith your consent we Process your Personal Data for the following purposes:\n\nto send you newsletters and campaign offers (from us and/or our carefully selected partners);\nfor other purposes we have asked your consent for;\n\nWe Process your Personal Data in order to fulfil obligation rising from law and/or use your Personal Data for options provided by law. We reserve the right to anonymise Personal Data gathered and to use any such data. We will use data outside the scope of this Policy only when it is anonymised. We save your billing information and other information gathered about you for as long as needed for accounting purposes or other obligations deriving from law.\n\nWe might process your Personal Data for additional purposes that are not mentioned here, but are compatible with the original purpose for which the data was gathered. To do this, we will ensure that:\n\nthe link between purposes, context and nature of Personal Data is suitable for further Processing;\nthe further Processing would not harm your interests and\nthere would be appropriate safeguard for Processing.\n\nWe will inform you of any further Processing and purposes.\n\nWho else can access your Personal Data\n\nWe do not share your Personal Data with strangers. Personal Data about you is in some cases provided to our trusted partnersin order to either make providing the service to you possible or to enhance your customer experience. We share your data with:\n\nOur processing partners:\n\nMailchimp\nInfomaniak\nElegant Themes\n\nOur business partners:\n\nNone\n\nConnected third parties:\n\nNone\n\nWe only work with Processing partners who are able to ensure adequate level of protection to your Personal Data. We disclose your Personal Data to third parties or public officials when we are legally obliged to do so. We might disclose your Personal Data to third parties if you have consented to it or if there are other legal grounds for it.\n\nHow we secure your data\n\nWe do our best to keep your Personal Data safe. We use safe protocols for communication and transferring data (such as HTTPS). We use anonymising and pseudonymising where suitable. We monitor our systems for possible vulnerabilities and attacks.\n\nEven though we try our best we can not guarantee the security of information. However, we promise to notify suitable authorities of data breaches. We will also notify you if there is a threat to your rights or interests. We will do everything we reasonably can to prevent security breaches and to assist authorities should any breaches occur.\n\nIf you have an account with us, note that you have to keep your username and password secret.\n\nChildren\n\nWe do not intend to collect or knowingly collect information from children. We do not target children with our services.\n\nCookies and other technologies we use\n\nWe use cookies and/or similar technologies to analyse customer behaviour, administer the website, track users movements, and to collect information about users. This is done in order to personalise and enhance your experience with us.\n\nA cookie is a tiny text file stored on your computer. Cookies store information that is used to help make sites work. Only we can access the cookies created by our website. You can control your cookies at the browser level. Choosing to disable cookies may hinder your use of certain functions.\n\nWe use cookies for the following purposes:\n\nNecessary cookies  these cookies are required for you to be able to use some important features on our website, such as logging in. These cookies dont collect any personal information.\nFunctionality cookies  these cookies provide functionality that makes using our service more convenient and makes providing more personalised features possible. For example, they might remember your name and e-mail in comment forms so you dont have to re-enter this information next time when commenting.\nAnalytics cookies  these cookies are used to track the use and performance of our website and services\nAdvertising cookies  these cookies are used to deliver advertisements that are relevant to you and to your interests. In addition, they are used to limit the number of times you see an advertisement. They are usually placed to the website by advertising networks with the website operators permission. These cookies remember that you have visited a website and this information is shared with other organisations such as advertisers. Often targeting or advertising cookies will be linked to site functionality provided by the other organisation.\n\nYou can remove cookies stored in your computer via your browser settings. Alternatively, you can control some 3rd party cookies by using a privacy enhancement platform such as optout.aboutads.info or youronlinechoices.com. For more information about cookies, visit allaboutcookies.org.\n\nWe use Google Analytics to measure traffic on our website. Google has their own Privacy Policy which you can review here. If youd like to opt out of tracking by Google Analytics, visit the Google Analytics opt-out page.\n\nContact Information\n\nOZWE Games\nRue des Terreaux 20\nCH  1003 Lausanne\nContact\n\nSupervisory Authority\n\nhttp://www.edoeb.admin.ch/\ncontact20@edoeb.admin.ch\n+41 31 322 4395\n\nConsent\n\nTo use this website, you accepted our Privacy Policy. If you wish to withdraw your acceptance, please use our Privacy Tools.\n\nChanges to this Privacy Policy\n\nWe reserve the right to make change to this Privacy Policy.\nLast modification was made . 2018-06-20\n\nGAMES\nDeath Lap\nAnshar Online\n Ships\nAnshar Wars 2\nVRtillery\nAnshar Wars\nSTUDIO\nMission\nTeam\nHistory\nPress Room\nContact\nPrivacy Policy\n\nOZWE Games\nRue des Terreaux 20\nCH  1003 Lausanne  View map\n\nSTAY CONNECTED\n\nJoin our mailing list to get updates about the next VR gaming revolution and receive amazing offers!\n\n\n\n\nBy using this form you agree with the storage and handling of your data by OZWE Games\n\n\n\n\n OZWE SA, all rights reserved. Official partner: Oculus. Institutional support: Pro Helvetia | SPEI\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.OkPrivacy policy", "Space Required": "1.91 GB"}



["5 stars\n48%\n4 stars\n19%\n3 stars\n13%\n2 stars\n9%\n1 star\n11%", "O8bitheroJul 9 at 1:36 PM\nOverall satisfied.\n\nFor someone who really enjoyed twisted metal this was a great experience. I do hope that in the future they will update more vehicles, weapons, or have an ability to purchase more, which would benefit their studio. overall satisfied and would recommend purchasing this game...\n\nHelpful | 19", "QDaBeatJul 30 at 10:00 AM\nMultiplayer ? Come on devs.\n\nIve played every racing title for the oculus quest and they all suck except this game but the problem is this game has only five tracks and no seemingly online multiplayer so you can come you can raise the five tracks and then youre bored again I mean for the cost of this game 23.99. you guys really should add something else new maybe some new tracks or mirror the other tracks or someway to have the online competitions.... yeah I would pay for DLC for sure Im like I said this is the best racing title and Id rather not buy another one and not be satisfied when you maybe could expand on this one that would make me very happy\n\nHelpful | 16", "RazzleMonkeyApr 12 at 3:31 PM\nGreat game but...\n\nGreat game good features but needs vehicles and it would be cool if you had to buy them with game money. Also if would be amazing if the creators would make a mode where your friend would drive the car with both hands and You would be the shooter while he drives what Im saying is you are a passenger and your friend drives please take up my suggestion other than that this is the best vr game!\n\nHelpful | 224", "spikedragonbornJul 28 at 7:19 AM\nGood but some bugs\n\nI think the game is great a really fun experience. But it has a lot of bugs some that ruin entire races. 1 bug makes it to were you cant pick up any drops except for ammo. Another launches you out of the map. And i dont know if its cuz no one is on or something but i haven't seen a single person in over 20 multiplayer matches. So i would love if the game devs could fix these bugs to help revive the community and save the game.\n\nHelpful | 2", "powney1991May 18 at 4:27 PM\nMediocre at best\n\nThis was previously my only racing game on the quest. I played it for about an hour one night and behind the very limited number of vehicles and tracks this really does feel like an empty shell of a game which is mediocre at a push and it just festered in my quest library ever since.\n\nIm not one to usually write negative to average reviews but since the release of mini motor racing X on the oculus store which is an absolute game changer for racing games on this platform it makes you realise just how far behind the likes of death lap is!\n\nWhen you enter a race 90% of the time it lacks so much character and you barely even feel as if theres any action there. Could possibly be due to how much space and distance there is on the tracks. The weapons all feel\nVery samey and theres not even an option to just have a flat out race without gimmicks.\n\nThe multiplayer mode was the killer for me. From what I tried there was barely anyone i linked up with and the majority of the time CPUs were used to fill this void and it just made the game feel even emptier than it already is!\n\nIts also disappointing to see the lack of updates and support from the developers with this title. There barely feels like theres any desire to at least improve the game in any way shape or form and its a real shame as its almost like theyve given up hope in it too.\n\nCertainly not a racing title to shout about, it does an ok job if you want a race thats just average at best with limited action and thats being generous. That being said Ive deleted it from my library (and this is the first game Ive deleted off my quest in the year Ive owned it) and intend on playing mini motor racing X for the foreseeable future now.\n\nHelpful | 28", "obi2kenobiJul 3 at 12:20 PM\nMuch better than VR Karts\n\nPros:\n-immersive steering is available and works decently\n-nice graphics\n-lots of racing mechanics (drift, flips, boost, guns, 1 special and 1 power up slot)\n-powerups are well varied\n-game environment is well designed\n-multiplayer\n\nCons\n-steering can feel jerky at times\n-when you crash into a wall but dont die, you are stuck as there is no reverse (edit: i found that holding brake reverses, which isn't mentioned in the tutorials, but it doesn't work well and im usually stuck awhile anyway)\n-bit of a learning curve with controls, after playing an hour i still can barely memorize all of them, and certainly dont always think to use them in a race. There is also nowhere to simply view controls in the menu\n-you get blown up a lot and there seems to be no way to prevent it that i can tell\n-i preferred the more chill Lance Boyle of MegaRace to the maniac st payne guy. He is always yelling and furious and id rather have someone more smooth like the grandmaster in Thor Ragnarok, who is still crazy and evil\n-doesn't seem like many tracks or racers (5 ea?)\n\nIf youre looking for a straight racer this isn't it. Pretty heavy focus on the combat\n\nOverall though i do feel this game has a lot of the polish and options many games don't at launch. Then menus are novel and work well. They give the user lots of options to play too. Dont like hand steering? Use analog stick. Dont like nitro st payne? Turn off the scenes. Getting sick in 1st person view? Switch to 3rd person.\n\nIt also starts with a good tutorial that explains the controls pretty well. The biggest thing missing though is some way to view controls outside the tutorial. Because there are a ton and i need to see them more than once to get it. Luckily the controls pop up during a loading screen and i try to reinforce them during that time.\n\nIt seems a bit short on content at only 5 cars and what appears to be 5 tracks - there are no unlockables or upgrades to speak of so once you beat the tracks its off to multiplayer i suppose. But the price is set right at $20. Any game with multiplayer and singleplayer deserves that\n\nHelpful | 3", "david_heinrichJul 13 at 12:36 AM\nContent needed\n\nNeeds more tracks, upgradable weapons and or armor, open pit maps, auto gas setting, and a hud with rear view would be sweet.\n\nCool game, needs expanding developmently.\n\nHelpful | 3", "Greensmith11 days ago\nTwisted Virtual Metal\n\nBada&&. One of my favorites. Definitely\nneeds more vehicles but it's a must play.\n\nHelpful | 0", "MauiRedManJul 18 at 2:24 AM\nMario kart on steroids\n\nThis game is a blast it really is I wish there was more people playing it online I could have some real fun with that I hope they continue to update it it is fun play it maybe they should put a demo with one track online for people to test\n\nHelpful | 1", "scotty341Jul 7 at 2:48 AM\nComplete garbage. DO NOT BUY!\n\nI bought this game expecting a fun arcade driving game, instead I got a boring repetitive piece of garbage which looks like it should belong on the PS1. Not only are the graphics bad the game manages to make destroying other vehicles boring in VR ,which before buying this game I thought would be impossible. I personally do not at all recomend this game and instead you should just hold out until a decent driving game comes out. Whatever you do DON'T BUY THIS GAME.\n\nHelpful | 3", "DeepMellowJun 18 at 9:08 PM\nWorst game ever\n\nPoor graphics, terrible controls, limited tracks. Bad acting and corny. Game plays like something off a PS2. Worth about $5. Dont waste a refund on this one. Oculus denies refunds if you have too many. Bad reviews. No updates ever. Only a few tracks. Boring after 10 minutes. Also makes you ill.\n\nHelpful | 3", "OlRoodyMar 5 at 3:47 PM\nGood but not great\n\nSuper fun game. Its very arcade like. So if you ever played mario cart then you understand the concept. Drive, open boxes and then use the power ups to take down your enemies.\n\nI really enjoy the game but wish there were more maps, more car selection or an ability to customize a car. But i understand why they didnt add this in. One gripe i have is that the cars dont feel fast enough when driving and the tracks are almost too curvy. Its annoying to hit a wall over and over when youre driving. I get it you can drift and stuff but i just think its annoying and some of us want the arcade like power ups with the racing but without curving all the time. Like it could definitely be done. The theme of the maps is pretty cool with their own random things that the game throws at you like in the vegas map you can get giant dice rolled over you. Nice touch. So there is some luck needed to win, not all skill. Overall its a fun game. It just needs more love to make it a great game. If you like twisted metal, youll like this. Definitely feels like im in an early playstation death match car game and I love it.\n\nHelpful | 34", "Toast-MaloneMay 18 at 2:41 PM\nUnfinished, ugly, buggy, nausea\n\nPlayed for like an hour. I hated every second of it. It does not live up to 2020 standards for VR. Felt like it should have been a $10 Samsung Gear game like 5 years ago. Its ugly, its boring, its uninspired, and has no heart. It was obviously rushed and made on the cheap with stock music and sounds. Its bad. Please dont buy it.\n\nHelpful | 11", "LowKeyMoneyApr 25 at 11:44 AM\nMusic artist ; LowKey$\n\nGood evening & goodmorning everyone I'm hard gamer and Music artist at the same time... I take both seriously after reviewing hands on with this game I would like to give it a hard 10 STAR review the graphics, gameplay .... from the beginning to the end has been VERY immersive money well spent....!! Be sure to snatch it fast and tell your friends .. I sure will ;)\n\nP.s and customer service responds pretty fast as well and very receptive to customers thoughts and concerns as well\n\nHelpful | 10", "eva.cat.vlad.catJul 12 at 2:57 AM\nI reallly liked the game but...\n\nThe one thing I wish you could do was take your hand off the wheel. But other than that its a great game\n\nHelpful | 0", "adam_israelMay 16 at 12:31 PM\nMultiplayer doesnt work\n\nThe multiplayer is not truly online, I am always put in games no matter the settings or map with fake CPU players. They even always have the same names like Stephen, Trevor and a few other CPUs that never change. I bought the game to play with real people and have fun conversations as I play. If this is just a glitch a update or explanation on how to fix it would be great. If its just part of the game, I dont believe it is worth the price.\n\nHelpful | 3", "DylPickle19711 days ago\n\nThe tracks are too big. The guns are too overpowered. There arent enough tracks. There arent enough cars. The narrator guy annoys the crap out of me. I want my money back.\n\nI think the main problem is you just play the game once or twice and then youre done with it. I still want my money back\n\nHelpful | 0", "donkeyhighMay 2 at 12:22 PM\nNot enough courses\n\nYea, it gets pretty stale pretty fast. The maps are kind of boring and there are very few of them. Fun gameplay tho, so a few updates and dlc would make this a great 5-star game.\n\nHelpful | 5", "Umami_OrigamiJun 20 at 1:37 PM\nNot a variety in this game\n\nNot impressed with quality of the game but is okay for the first hour or so of gameplay\n\nHelpful | 1", "tamerrrMay 14 at 11:47 PM\nlove it\n\nVery fun game to play, I would recommend it to anyone looking for a racing game on their quest. It really is like a Mario Kart style game crossed with a Mad Max theme but this has the added fun of shooting from your car and doing it all in VR! Some people may want to save their money for now if you think you'll get bored because of the lack of content but the game play itself is a lot of fun! maybe look for a youtube review if you're really on the fence about buying it.\n\nI think this game has HUGE potential in multiplayer. I would love to see more mechanics, new items and some balancing done and I think it could become very competitive and infinitely enjoyable as players develop skills and strategies to out play each other, that's my vision at least :P Also I've noticed when trying to play multiplayer it will put you into a game instantly, sometimes mid race, and it also fills blank spots with bots. I think all of that is nice but please add an optional queuing system for players who are willing to wait for a fresh race with 6 real players.\n\nHelpful | 1", "unlockedoneJul 6 at 8:36 AM\n\nThe worst game I have ever played. The car that U are in is the only thing that is clear with great graphics.\n\nHelpful | 1", "BANKSSOTATTEDMay 17 at 1:20 AM\nADD ME HOMIE !!!\n\nIf u see this add me and message me homie , lets race boy !! (Dont matter if u see this months from now just hit me)\n\nHelpful | 4", "John.Henry.MagicJun 14 at 10:17 AM\nNaaa\n\nI like this game from the beginning. But there is no playing against anymore. Now you play against the computer and it cheats. You have gone from full pot to a bad game.\n\nHelpful | 0", "UntoldSlaughtaApr 12 at 8:53 AM\nAn outstanding game\n\nThis is the kind of game that was meant for vr fun tracks very creative vehicles you'll never get bored of this the narrator is funny the car abilities are unique but not overpowered the game is extremely balanced, I hope to see more cars and tracks in the future!\n\nHelpful | 4", "XxdarkdeathxX21Jun 23 at 11:07 AM\nIts ok\n\nNeeds more and constant updates and the game is lacking to entertain people but it's a great idea\n\nHelpful | 0", "daredevilGBJul 2 at 6:56 AM\nWhy\n\nI want my money back how do I refund this game\n\nHelpful | 0", "rebootjacJan 25 at 11:30 AM\nEXTREMELY fun but I want more content!\n\nThis is a game that gets it and should be studied meticulously by any future vr racing dev how to make combat racing work in VR. It is an homage to the best gameplay elements of Twisted Metal, Battle Cars (remember that one?), and Mario Kart with the aesthetics and humor of Mad Max and Smash TV. It also somehow sprinkles a good FPS shooter on top! As you can imagine, the gameplay on offer here is special and why it alone is worth the admission price. Let me explain: the controls aren't complicated where it risks feeling like a racing sim nor is it a dumb arcade clone because of how it demands attention with both of your hands independently. You will be racing with one hand while the other is aiming and gunning down your opponents with a machine gun frequently! The game gives you a generous amount of customization too including both first-person and third-person play styles increasing the replayability. However, as much as I just really like this game, I can only award this four stars because of how it feels like season one for content. It's a great start, a lot of variety with the tracks but I want much more and do hope that the developers are planning DLC with more tracks or at least plans for a sequel because you definitely got my attention!\n\nHelpful | 15", "Gudboi8May 20 at 4:56 AM\nHggghhhooooooooood\n\nGgggggrreeeay\n\nHelpful | 0", "teelapDec 5 at 12:28 PM\nDay 1 Review: Good and can be Great\n\nTLDR: if you are looking for a cart racer style game on Oculus, get this game. You will not be disappointed.\n\nPros:\nDriving feels really good.\nCool power-ups (not everything is a BIGGER GUN)\nSolid control scheme\nBeginner friendly, but open to advanced players too\nTracks are very well thought out with lots of hidden features\n\nCons:\nIMHO Cars don't feel special (or balanced)\nStill quite glitchy (especially when airborne)\nLimited content (but it is launch day so....)\nThe \"steering\" option feels a little lackluster (perhaps more tracking data will help them improve this)\n\nUltimately, this is a very good game. And this studio produces high quality, well polished titles. This one is close but not there just yet. I will update this review when it gets updates.\n\nUltimately, I will still play this in spite of my con list and enjoy the crap out of it.\n\nHelpful | 390", "LuigiRocks95Mar 5 at 4:17 PM\nAmazing! Like a Twisted MarioKart.\n\nThis is possibly the 2nd greatest game I have ever seen on the Quest (Vader Immortal being 1st). Whenever I first entered the game, I was astonished. The tutorial and the tracks are fantastic. However, there are three tiny flaws. One is being the overall diversity of the game. We need more tracks, more items, and more cars! And there could possibly be a way to customize your own character! The second being the overall graphics. I dont know if its just the quest itself or something along those lines, but it could probably be greatly improved. And the steering mechanics. Maybe you can make it so you can grab the wheels with both hands or one, because I have to tilt the hand off the wheel to go left/right. Otherwise, 5/5!\nFantastic job, OZWE Games, youve blown me away.\n\nHelpful | 6", "LilOutlaw405Jun 7 at 10:58 AM\nIt sucks\n\nSo I bought it and it crashes when I got in finally nothing worked I want a refund\n\nHelpful | 0", "Avon600May 29 at 9:51 PM\nHorrible\n\nThe tracking on this game is horrible and the graphics are disgusting. 1-10 vr experience\n\nHelpful | 1", "jkaz0420 days ago\nBOI!!! THAT WAS FUN!!!!\n\nTHIS WAS THE BEST RACING EXPERIENCE EVER!! I EVEN FELT LIKE I WAS IN THE MOVIE  FAST AND FURIOUS . LOOKING FOR THE BEST ACTION/ RACING GAME! THIS WILL BLOW YOUR MINED!!!\n\nHelpful | 0", "AskjerryDec 29 at 12:28 AM\nMultiplayer needs work\n\nI love this game... until multiplayer mode. I want to meet my friend... pick a track... and the two of us race to the death. Instead... as soonas you select multiplayer mode you are dropped into a race... no choice given to invite friends. Then at the end of the race you click \"same track\" and it ignores you... you get dropped into some random track with no choice of who you are playing against.\n\nDEVELOPERS: You need to fix multiplayer mode. I also would not mind more desert style tracks.\n\nHelpful | 28", "TabletopbreakMay 15 at 10:35 AM\nMeh\n\nIts fine just not worth 20 dollars it should be five. Its very limited and gets boring after an hour\n\nHelpful | 1", "jayden_johnsonJun 29 at 8:08 PM\ngood...\n\nI had fun but at some point it feels repetitive in a way. Don't get me wrong its awesome shooting and driving others but the tracks get old at some point.\n\nHelpful | 0", "LargePharmaMar 1 at 12:35 AM\ngood game\n\nOverall its a pretty good game. Excited to see what they do with the updates! They recently added a demolition derby map that I thought was pretty cool. Id love to see more car options or maybe even some car customization. Adding upgrades and deferent decals would be a huge plus for me. Dont have too much to complain about other than it gets kinda laggy when flipping or running into walls. Other than that I love this title\n\nHelpful | 1", "ChennamanDec 19 at 2:46 AM\nOculus you need to cater this game.\n\nThis game has so much potential due to how addicting it is. I find the competitiveness of this game similar to trying to place first and Mario kart. When I play this game all Im thinking about a speed and its fun, however, there are some glitches.\nGlitch number one: you fall through the stage at certain points if you do certain things, when you hit a wall it really destroys your car, the steering needs to be adjusted for the VR portion not the stick portion.\nHowever I feel if you guys did cater and gave this company some money or whatever this game can really help sell the quest because I love it and I see a lot of potential.\n\nHelpful | 19", "cj.searsFeb 13 at 5:23 AM\n\nTo start the game is quite good and fun to play... The controls take a bit of practice to get comfy with which is OK....there is a defenet sense of speed while driving the smaller cars..... Some of the tracks can get confusing to drive on due to the coloure of them ie you can't tell the difference between the road and the wall..... The game can be glitchy resulting in you're car getting stuck in a wall and won't move...... You have no reverse gear so if you get stuck you have to restart game..... The hand steering is unstable to the point of unusable..... I've tried multiplayer but there is never anyone playing it which is ashame as despite the few glitches it is a very addictive game.... Developers work on the multiplayer and iron out the glitches... Make it as popular as drop dead........ Ile add to the review if the glitches go\n\nHelpful | 3", "DerpionMay 10 at 11:35 PM\nPoor colection of cars\n\nBoring very fast. Regret purchasing.\n\nHelpful | 0", "MilwaukeeMikeFeb 18 at 5:44 AM\nSo Fun\n\nThis game is definitely Twisted Metal meets Mario Kart and it is awesome. There's only five stages and five different cars but I believe the developers said they're going to be adding more well hopefully they add more cuz I'll buy the DLC. But this game has lots of options and literally makes use of the Oculus controllers wonderfully. Hope this helps.\n\nHelpful | 3", "tanner.vegetaApr 22 at 10:47 AM\nLove that game but no english subtitle!\n\nI love that game, remind me of Twisted Metal game. Bit disappoint is no idea what announcer said, because no english subtitle!\n\nHelpful | 1", "ThatParkerKidFeb 24 at 5:17 PM\nThis has potential\n\nThis game really has a lot of potential. It just lacks a bit of polish in my opinion. Driving isn't bad but it definitely feels a little clunky at times. Personally I think the weapons should all be handheld weapons like the SMG powerup because it feels way cooler to be holding a gun and shooting off the hip while driving than just aiming a laser beam. The maps could definitely be cleaned up a little bit too, some of the crazier turns and slopes feel a little bit glitchy sometimes.\n\nHelpful | 3", "Skyhawk613Dec 5 at 3:47 PM\nAmazing with a wicked sense of humour!\n\nYES, YES, YES! Ten stars!\nThis is the racer we all waited for! Amazing graphics, great racing and sense of distruction combined with a wicked sense of humour! I love it lol.\n\nThe only downside - it lacks support for a gamepad or xbox controller !\n\n\nThere is a large learning curve until you're able to master the controls under the chaos and mayhem unfolding on the tracks but if you're a racer, don't think, just buy it!\nYou'll love it! See you on the tracks!\n\nThank you developers for a wicked job well done! I love the umbrellas lol\n\nHelpful | 114", "DylanDrewMar 19 at 3:07 PM\nOkay\n\nIt was cool at first, but something about it just makes it seem unfinished. Also the guy in the game is rlly weird\n\nHelpful | 4", "gtaionman26Mar 30 at 10:55 AM\nBEST RACE/SHOOTER GAME EVER\n\nWhen I first got to drive Against some bots I had a LOT of fun. I was drifting on the side of the first map and Lazard a bot with the mini gun YOU MUST BUY THIS ITS WORTH ALL THE MONEY\n\nHelpful | 0", "gogo123456Jan 28 at 4:04 PM\nThere is no right hand tracking\n\nUPDATE: I have written to this company with zero response they dont have your back they just want your money until I hear from them Im going to continue to flood the Internet with anti-Ozwe posts!! You do not get to make a game and just leave your customers hanging it makes me wanna help you sink!! Not fair to people who actually are trying to reach out to you for help!! As of now dont buy this game they dont have your back they want your money and let you sink!!\nThis game is fun right up until it stopped letting me use both hands please fix this Im about ready to leave a Facebook YouTube Reddit you name it review everywhere until this is fixed....,, CAHHHHHHRAPP GAME IF THIS AINT RESOLVED. I know it seems like Im being aggressive here but this is been going on for a few days and its really frustrating when Im trying to play with other people\n\nHelpful | 15", "NyctosisMar 5 at 9:00 PM\nNot bad. Once you get used to it\n\nTheres actually some strategy with the shield. Its not completely immersive but once you get good at the game it gets pretty fun.\n\nHelpful | 0", "squiddyrexJan 14 at 3:08 PM\nIts klunky and feels empty\n\nThis game is fun at first but you quickly realize just how clunky and empty the game is. There is no feeling of speed, no awesome high octane soundtrack, and if you play multiplayer youll be lucky to be able to get into a game with at least 2 other real players. There also isnt anything to unlock (customization wise) so there isnt anything to make you want to win. Also driving side by side just doesn't happen. Most of the time youll veer past somebody for a second and then its just open road for the rest of the game. This game mostly just consists of long ranged fighting. Dont expect it to be like mario cart where you are neck in neck fighting for the finish. There are also bugs but nothing terrible so not worth going into detail. But anyway my main complaint is how empty the game feels on most of the race tracks and also how little there is to play around with in the game (very few cars and tracks) this would be ok if it looked and felt good but this game has no styleistic approach and there is no feeling of speed to me, which i feel is the most important thing for a racing game. I dont hate this game but i had high hopes for a mad max type racing game, ive played some really fun psvr racing games and now that I've switched over to the quest, there still isnt anything to my liking. Im sure with updates this game will get better but ill have to give it 2 stars because i just cant bring myself to play it again even tho i have had some fun playing it the first couple times\n\nHelpful | 9", "ElectricGypsy72Dec 5 at 11:58 AM\nFun VR update of MegaRace\n\nOld enough to remember MegaRace? FMV host with an attitude intros wild and crazy deathmatch races. Add a Max Max world and put in VR and you've got Death Lap.\nIt's a lot of fun. There are 5 cars to race and five tracks to race on with 2 training missions. Going through all the tracks in single player is a good way to learn the courses and how the powerups work. I did see some shortcuts on the tracks, but haven't done much with them yet.\nThe other mode is Multiplayer. This is where I think the longevity will be. Not a lot of others on there yet, but I'm betting a full roster of human players (it fills empty spots with AI) will be the thing that keeps me playing this.\nI hope to see more tracks, more cars, and a lot more of Nitro Saint Payne!!\n\nHelpful | 41", "jswitch808Mar 18 at 1:32 AM\nCant wait to play but...\n\nWhen I open the app I hear music but no visuals. Just dark. Im giving 4 stars in advance.\n\nHelpful | 0", "King_Of_EgyptMar 27 at 2:24 PM\nAmazing game\n\nAmazing game and a lot of fun\nI like this kind of hard challenging games\nThank you so much \n\nHelpful | 0", "420Brent420Jun 4 at 7:03 PM\nNo idea\n\nWen arre we gettin more stuff added so simplistic\n\nHelpful | 0", "stormshadow612Feb 18 at 3:42 PM\nGreat combat racer\n\nPlease update the acceleration on the vehicles their so slow after Respawn. Needs more cars and tracks. So two months later and all we get is a dumb arena map.\n\nHelpful | 1", "timjrd86Feb 7 at 10:09 AM\nGreat game but...\n\nFirst things first I really enjoy this game(and love the price only if more content comes),it kind of reminds me of twisted metal and I loved playing that back in the day...here comes the but and it's a small but, it needs more cars and tracks other than that it's great. Thanks dev's for the awesome game!!\n\nHelpful | 5", "vrabbitsDec 5 at 5:18 PM\nHmm k cool.\n\nSo yeah its a really fun game. Totally recommend it. Few issues though. You accelerate so slow it feels like your just crawling unless your using nitro. Weird looking characters when you select which vehicle you want (just a weird thing I personally don't like). I would love a option to button map. May just be me but I can't make myself use half of the current buttons or remember what they all do I feel like I'm randomly braking boosting shooting etc never use my shield besides mabe like twice but that be because I'm always out of energy or nitro stuff. Button mapping and mabe external controller usage support would be amazing. Would love to use my Bluetooth xbox one controller with this game. Needs some unlockables to keep giving me a reason to play/goal to shoot for. Add the above or one of them and its an easy 5 star. One more thing the ability to mute narration would be nice as well.\n\nHelpful | 6", "i_hug_youFeb 17 at 6:38 PM\nIts fun but small\n\nIts a great game , but I wish it had more cars or stages, and multiplayer needs to be faster\n\nHelpful | 0", "MeatballmachineDec 7 at 5:58 AM\nCool game , one or two issues...\n\nThis is more of a Kart racing game than a Mad Max game. You are gonna try to survive three laps around some very cool tracks and you are gonna die a LOT until you learn the controls, to which there is some good depth. Shields, specials, laser aimed weapons, rear view, evasive tech, boost...theres a lot of fun to be had here. There are two things that bug me about this game. One, there is a mini map that pops up randomly in your view for no real reason. Anyone who enjoys VR knows that huds and maps in your face are not a good thing. All of that info could have been displayed on the dashboard like in real life and would have helped the immersion instead of being a visual nuisance. Also, someone on the dev team didnt learn anything from the disastrous Bravo Team fiasco lol You dont ever take the player out of first person during gameplay, When you jump and move the controller, you get ripped out of first person view into third person, only to watch some extremely lame barrel roll animation. Then, you are slammed back into first person. it is the most jarring and disturbing sensation and I thought we all learned a lesson from the failure of other games that tried to do this to the player. Now with that out of the way i will say that this game delivered on exactly what the trailer promised. You will be fighting for your life, managing your ammo, drifts, energy and shield while trying your hardest to stick it to the other racers. This game is fun in single player and a hilarious sh*t talking fest in multiplayer. The destruction and mayhem is all here and its glorious. If you long to blow up cars around you with streaking missiles, want to see what its like to lay down an oil slick and look out your rear window to see all the chaos you created or you just want to ride up to someones bumper and watch saw blade come out of your hood and eat the car in front of you-this is the best 19 bucks you will spend. I would gladly slam down 5,6 bucks too, for some dlc tracks or cars\n\nHelpful | 4", "CriptoNoobJan 30 at 11:22 PM\nAwesome racing game\n\nThis game is great , it have a good graphics , sharp image , good gameplay and a lot of control settings ,,, Also i used the standard mode and i didn't feel any motion sickness , like in some other games . The only cont of this game is that needs a little bit more content and extras , to summarize is a really fun game that you can expend many hours in multiplayer\n\nHelpful | 1", "rhythmjediDec 6 at 1:52 AM\nI hate this rubber band racer!\n\n(If you want to see how good racing can be, check out Dirt on PSVR.) Death Lap is a Mario Kart type racer with exceptionally wide tracks & pinpoint weapon aiming, but any fun is overwhelmed by inaccurate steering controls, rudimentary car physics, rubber-band speed compensation, and a srsly lame bad guy/story line that is shoved in your face before, after, and even during the race. Ugh. Good level design raises this from 1 to a 2 star rating imho.\n\nHelpful | 38", "barzattacksDec 12 at 9:33 AM\nLots of fun, hoping they add more to it!\n\nThis game is a lot of fun, I feel like this game would be much more popular if they add more maps. We really need a deathmatch type arena. Also a better way to reset the car or quickly turn around like via burnout or something. If they can add some more content to this I think we have a future series on our hands. What makes this game special is all the different functions you have when playing to boost your cars speed and energy. Once you learn how to use them all you will have a blast!\n\nHelpful | 3", "BringhurstDec 12 at 2:22 AM\nReally fun, with a ton of bugs.\n\nThis game is a masterpiece and the funnest multiplayer program on the quest. Let me get that out of the way.\n\nI'm sure they'll add more cars and maps down the line, so I won't go on about that. But I'm gonna list the bugs.\n\nWhen you hit a wall you simply spaz out instead of bouncing or grinding onward.\n\nThe barrel roll feature will wig out mid air if you aren't holding your hand perfectly straight, and most of us hold the left controller at a tilt all the time.\n\nIf you lap everyone and come upon the guy who's in 6th place, when you pass him it'll say you're now in 5th, and it's maddening.\n\nAs with many multiplayer games, there's almost always one person who's microphone glitches out the entire game. We should have the ability to mute players.\n\nWhen you're waiting for a game to begin, if someone is still \"sleeping\", you could wait perpetually, even 15 minutes sometimes. It should kick anyone out who isn't ready to go after one minute.\n\nIt would be great to have private rooms with invites for players you want to drive with.\n\nAnd lastly, it sucks there could be twenty payers online, but we're all spread out, sometimes each of us playing with only bots. Why not consolidate and get us all together? I'd rather play one person than only bots.\n\nHelpful | 3", "Mmoney18Apr 3 at 8:45 PM\nHorrible\n\nWorst stering and speed I have ever done in racing\n\nHelpful | 1", "ChlasmaJan 6 at 5:26 AM\nMario Kart in VR for GROWN UPS!!!!\n\nGraphics are amazing for a mobile title. I think the only reason for any bad reviews in here (despite motion sickness which is not the games fault) is that people simply dont get it. It is way more complex than mario kart, please play the advanced tutorial as well!!!\n\nAbsolutely worth the 20 bucks, trackdesign is so good and overall there is so much more depth to this game than you might expect when you start playing it. Just keep on ;)\nTop notch game\n\nHelpful | 3", "TopTerminator06Apr 3 at 4:42 AM\nNot very fun\n\nIt is just plain ol boring\n\nHelpful | 1", "loader26Jan 1 at 4:07 PM\nMario Cart meets twisted metal\n\nThis racing game is fantastic. I completely enjoy racing and shooting my enemies in VR, and to all those whining about being shot down, learn to use your shields. The challenge is what makes it a game and not just another VR experience. This game is awesome and I think Oculus needs more racing titles for the quest. Great job devs, keep up the good work!\n\nHelpful | 0", "CobraStrike_Dec 7 at 8:08 AM\nVery boring\n\nWith how the races go you could have 100 different tracks and this would still be a mind numbingly boring game. The tracks are way too wide and big for how slow the cars go even when boosting. The point and shoot element is a bare bones mechanic and too easy to execute so theres next to no way not to die in a match no matter what, and you cant turn around and shoot? Thats weak. Seems like very little effort went into it.\n\nHelpful | 24\nDeveloper ResponseDec 8 at 8:27 AM\n\nPlease note that part of the game is to deploy your shield to protect your car from the other cars and not die. However, that is not free. You need to drift or destroy other cars to accumulate enough energy to deploy your shield. Maybe you should give this a try. This will be a mandatory skill in multi player for sure. Note that there is also a button you can use to shoot behind you.", "vr_bummser_neiteyDec 6 at 7:06 AM\nDrifting needs improvement\n\nIn action racing games like this, the drifting mechanics are very important. And here is were this game fails. Drifting feels off and very unsatisfying. Why feels the override steering so strange?\n\nAlso needs a way to dodge / shoot incoming missiles. Now you just blow up without knowing what hit you or any way of defend.\n\nHelpful | 3", "ryan.beadle.146Dec 5 at 8:45 PM\n$20 for the best game on quest???\n\nA MUST HAVE FOR ANYONE THAT ENJOYS DRIVING GAMES! This game is very well done. No glitches, no problems with any of the driving or shooting mechanics. Very solid game and for $20 the only thing that doesn't go far beyond par is the content, which I expect we'll get more of in the future. 2 tutorials, 5 cars and 5 awesome tracks so far.\n\nDevelopers, if you guys were able to make a type of game mode, off road deathmatch (twisted metal style) that would be incredible and vastly improve replayability In my opinion. This might go against the style of the game, but just a thought.\n\nHelpful | 29", "Uscared13Mar 10 at 9:00 PM\nLame\n\nCan I get a refund\n\nHelpful | 3", "AwakeOneJan 17 at 12:32 PM\nBLAH No good\n\nThe teaser motivated me to purchase this one but the graphics, play and overall game are a disappointment. Not easy to steer and its quite boring. Quite monotonous. I dont recommend this one and would rather have my money back. Blah.\n\nHelpful | 4", "mob-bossDec 12 at 9:58 AM\nWicked, multi player needs attention.\n\nWicked game but I bought mainly for the multiplayer aspect of which it seems your still racing bots as practically no on on line. I've only had max 2 real players out of 6 at and one time and the rest are bots. I've never actually spoken to anyone.\nMy parter also has this and there is no actual way to invite freinds to play.\nOther than above its a wicked lil Mario cart type of racing game.\n\nHelpful | 9", "FwoupDec 5 at 11:59 AM\nOkay game, but not great...\n\nThe idea is there, and it's definitely a good one. However, like with numerous other VR games, it is severely lacking in polish. This leaves the game, while at its core fun, feeling clunky and poorly thought out in many aspects.\n\nThe narrator is annoying and obnoxious, shooting cars is fun, but it feels like a pain in the a** to actually view them most of the time due to how covered your vision is in first person mode, shielding with some cars completely blinds you, the controls require a bit of time to get the hang of, but I feel the worst problem is the actual control of the vehicles. It feels like they'll get a little stuck when going up ramps, but it feels so out of place in a game that tries to mimic Mario Kart.\n\nVerdict: Its okay, its priced well enough, but it's definitely not for everyone. If you're new to VR, know there are better titles for this price point (especially with Oculus Link).\n\nHelpful | 20", "noah.lugeonsApr 22 at 11:22 AM\nIt's... Fine.\n\nI was curious about the concept but I'm not too impressed. Basically it's Mario Kart with guns, but it doesn't play well. You're constantly getting destroyed from behind by unseen does and that detracts from gameplay. The weapons are kind of boring. The ad made me think firing a handgun from the car would play a larger role in the game. It's efforts at humor are painful.\n\nUltimately it's a solid attempt at a race game, but there's not enough going on to keep it fun for long.\n\nHelpful | 0", "VRBikerJan 5 at 7:20 PM\nGreat multiplayer racing fun!\n\nIf you liked the movie Mad Max you will love this game. The graphics and game play are excellent. You have several different cars to choose from and each one has it own racing style and special abilities. This game requires skill and timing that you gain from play experiance. It's lots of fun and has lots of replay value. See you on the tracks.\n\nHelpful | 2", "ZippenDec 15 at 8:03 PM\nAwesome game, fun multiplayer\n\nWhen ever I wanna play VR sitting down I pick this up and jump in. This is a really fun game with great driving(Stick) and fun gun game play. Multiplayer except for sometimes a mic noise issue from some players is quick and fun. So fun to kill someone with like 5-10 diff weapons and powerups etc..\n\nLove driving games, loved Twisted metal.. Well then get this and get driving. :)\n\nHelpful | 5", "psully4114Dec 5 at 11:17 PM\nThis is the most broken game\n\nI've seen some buggy titles but this one is consistently broken. Everytime I get in the lead I immediately lose control of the vehicle and slam into a wall and it doesn't fix itself until I'm in dead last and I don't care how good of an idea it is on paper in a racing game thats the first thing I'm gonna make sure works. Not happy.\n\nHelpful | 12\nDeveloper ResponseDec 6 at 11:16 PM\n\nDear player, Is there any way we can investigate this issue with you? If so, please send us an email at stephane@ozwe.com for follow up.", "DrakfyreDec 12 at 9:56 AM\n\nGame might be good. I don't really know. All I know is that I came to grab a steering wheel and drive a car, and that aspect of the game is *horrible.* When in \"wheel\" mode it acts like a stick, tilt your hand left and you go left, right and you go right. It's completely disconnected from your hand action on the screen. So until this gets fixed just going to rate it 3 stars.\n\nHelpful | 3", "thedapperzaperMay 15 at 11:45 AM\nI can't play online.\n\nWhile the main gameplay is fun, it gets boring over time.\n\nHelpful | 0", "Yobro04Jan 12 at 8:47 PM\nImprove the steering with touch controll\n\nIt would be bether if in the steer mode you actually had to grab the steer and feel more like steering cuz in the steer mode you just have to twist the controller and it doesnt realy feel like Im holding a steer I want to grab the steer and turn it kinda like other nice racers like project cars you also should be able to hold steer with 2 hands if you want but sadly we cant do that you should be able to let go of the steer whenever you want so keep this inmind for a future update so add like a 2 handed mode but overall the game is fun but I wish you would add a nice campagn kinda like as twisted metal maybe just a 2 or 3 hour campagn would be amazing those where the only things that botherd but overall the graphics are super good for a quest game good job on that guys\n\nHelpful | 1", "andyj99Dec 12 at 10:52 PM\nTon of fun\n\nGreat game, and online is a riot. Once you get the controls down, it's a lot of fun. I love racing around against other players that's the best part. Especially getting in the different cars and getting used to how each one performs.\nSingle player story consists of a track intro and that's it, could use some more substance. Tracks can be glitchy at times, and it's decently easy to get stuck on a wall, or fly off the map. Can't wait for more tracks and cars. Wish the mini map stayed up the whole time, and position seems to glitch sometimes and not accurately reflect where you are in the race.\nTo the developers; maybe a couple more modes to think about in the future: team race, brawl (on battle maps), tag team race. Can't wait to see how this progresses!\n\nHelpful | 3", "reapercon606Apr 25 at 4:29 PM\nWow\n\nThe only VR game that allows you to drive a car and shoot weapons out of the vehicle I have not played it yet but it sounds like a very very very fun game Im sure anyone who gets it will enjoy it Ill keep you updated in the next few days when does downloaded anyhow please like this and climate helpful get the game\n\nHelpful | 0", "Godislove4uDec 6 at 6:13 AM\nMore than I expected\n\nIt reminds me of those fun but destructive retro arcade hits of the 80s and 90s. Remember crash & burn on the 3do in 1994 ? This game plays in respect to it and fmv games during sega cd.But brings into high quality and smooth resolution with current comfort with a vast variety of game options to utilize vr.Praise Jesus!\n\nHelpful | 6", "GibbathJan 3 at 7:22 PM\nKindof gets old after a while\n\nI mean ive had this game for for just over a week and a half and i love this game - but the game just feels repetitive but i think you could make a good story line into this like you are forced to a race to the death but must build your way to the top and prove that you are worthy to escape the deathlap areana\n\nHelpful | 1", "thewilsonixMar 7 at 5:30 AM\nGood game\n\nDo wish for a customisable car\n\nHelpful | 0", "MutantbroomDec 5 at 12:22 PM\nGreat Game, missing a few things\n\nThis game is a whole lot of fun and I see myself sinking many more hours into it. There are a few things missing that I think the devs can fix however. There isnt much of a progression system to keep you coming back. You start out with all of the cars unlocked, which is fine from a gameplay standpoint, but even something like car cosmetics to keep players coming back would go a long way in keeping this game alive and thriving. I also dont like how the steer control option has you tilt the controller to steer the car. I had hoped you would have to actually grab the wheel and turn it but also have the ability to let go to and maybe sacrifice your steering to shoot a weapon more accurately. Other than that I love what the game has to offer and I think its at a great price point. I will update my review if these things are fixed/added, but its still worth a buy if youre looking for a good racer on quest!\n\nHelpful | 8", "AuldstockDec 13 at 9:20 AM\nGreat, But......\n\nSeriously buggy at the moment. Great game in fairness, well worth the money as long as the kinks get ironed out. Like the announcer character repeating the same quip over and over, not registering pick ups. The flamethrower sound fx at the end of a race are waaay too loud, and present when the flamethrowers are not. But the one that's killing the enjoyment for me is at the start of 90% of online races, I don't get spawned in on the start line, I get spawned in at last place after the cars have taken off, and catching up seems impossible. Ruins the experience. I will update this review when improvements have been made but until then I recommend you hang back on this one for the time being\n\nHelpful | 2", "AikarosDec 7 at 11:31 AM\nBalance issues, bugs but has potential\n\nI played maybe around 5 - 6 hours.\nThere are several things that can make the gameplay really frustrating. First is buggy and janky behavior of the cars. If you dare to touch a wall or another car, your vehicle gets a nasty epileptic seizure. This sometimes forces you to respawn and loose valuable time. And then there are several gaping balance scars. Some abilities are world ending doombringing and civilization collapsing weaponry (looking at you laser pointer), some affect the game with impact equivalent to a mosquito sneeze.\nThere is only a handfull of powerups and no creative or interesting way to defend your technopunk rear end from enemies. Sometimes you get obliterated and have no idea why or what you could have done about it.\nIf one player manages to get a big head start from the mayhem of brutality behind him, he is sure to win and no one can really do anything about it. (Which is okay only as long as the player in question is me)\nThe multiplayer has voice chat. You cannot tell who is talking and most of the time one or two players have weird robotic (and incredibly annoying) mic echo, so I can't use the voice chat.\nSo add some interesting powerups that can also be used defensively, make the cars not spazm out from any indication of physical contact, add a teaspoon of few more maps, balance the nuts out of this game and you have an awesome awesome game.\nAs of now... It's good game with some issues that will hopefully get fixed soon. And despite my whining, I like it and have fun playing it.\n\n4/5 - For $20 it's better than getting hit by a steel rod.\n\nHelpful | 5", "Crawfish321Jan 7 at 8:08 AM\nfun but needs dlc and abit buggy\n\nonce the game clicks after an 1 hour or so its brilliant but needs updates.\n\nHelpful | 3", "lolroflbbqDec 7 at 3:42 PM\nGame has great potential\n\nGame is a lot of fun, obviously the meat and potatoes is in multiplayer. There's just some things I think they should add that would make a lot more replayabilty.\n- more items(this is a given)\n- more tracks(a given again but also add in like more environment dangers the tracks seem kind of empty with only 6 racers sometimes.\n- Customization (for this I'd like to see all kinds of stuff from actual avatar Customization, to the cars, even the weapons on your car being able to be swapped out and what not)\n- some kind of progression or leveling system (this would not only make for replayabilty but give players something to play towards like rewards or cosmetics or something)\n- being able to group with your friends to race!!!!! This is a must!!!!\nI think these alone would make the game better along with some bug fixes. This is not saying I didn't have fun playing the game but it could be so much more.\n\nHelpful | 4", "CURTROCKDec 7 at 7:39 PM\nThis is SICK !!!\n\nWow! Slammin vehicular combat! This is the 1st VR game Ive played that nails the console type action Ive loved for years, and then goes beyond. 1st AND 3rd person views is sure to please anybodys preference. Turning your wrist to steer (optional) combined with rotating on a swivel chair gives this some next-gen immersion like Ive never experienced before. Weapons are meaty and satisfying. Fun factor is off the charts! Easy 5 stars. Well worth the price of purchase.\n\nHelpful | 5", "3.wavFeb 3 at 4:07 PM\nMore content?\n\nLove this game. I have been playing racers since I was little, and its great to have one in vr. Driving feels good and has great replayability. Just needs some more content.\n\nHelpful | 1", "BlackLion31Dec 9 at 5:24 PM\nLove it\n\nGreat graphics, great sound play. Good action. Is does take a while to get good with the controls. By the end of 3 laps, you should get the feel. It can get frustrating when it goes kill fest. If you shoot someone expect return fire. I wish the developers could figure a way to recrop further away.\n\nHelpful | 3", "fsunole94Dec 8 at 3:07 PM\nReally cool for the beginner\n\nA lot of fun, you can play this game sitting or standing as well as tweaking the movement so you dont get sick. Ive played it over and over simply enjoying the mayhem of all of it. The only part I would fix is that it really sucks that every time you die (which is a LOT) you start at the back. Multiplayer is pretty cool except everyone seems better than me \n\nHelpful | 3", "BostonSQUABDec 8 at 7:24 PM\nAwesome! So awesome!!!\n\nAn amazing game! I cant wait for more features like car customization and driver customization. But in the meantime it is so much fun! There a few glitches with slow internet connections. Especially while drifting or flipping. It can also make the VOIP scratchy but I'm loving this game. See you on the leaderboards hopefully!\n\nHelpful | 3", "ralphael_ninjaDec 7 at 5:16 PM\nSlow game more like a fast walk\n\nI am comparing this games that I have on the PS4 and this racing like game is nowhere near anything that is racy. Also you explode needlessly and there is no way to avoid it from other racers shooting at you. This game is not a mario kart type of game. You get shot at repeatedly by multiple racers behind you and when you do get going the controls are just terrible especially the rotating one where you rotate your controller to steer; I kept falling into a mud pit I think. The joystick is a little bit better but I don't know it really doesn't feel like a steering wheel racing game at all. Lets put it this way, I am use to racing games like need for speed, Wipeout, Gran Turismo and this is like the ps2 version of mario kart. I am sorry that everyone raves about it but I don't like it. I started up the game twice and both times was an awful experience. I'm asking for my money back. Again my apologies to those who made this game. It is just not for me.\n\nHelpful | 9\nDeveloper ResponseDec 8 at 8:24 AM\n\nPlease note that part of the game is to deploy your shield to protect your car from the other cars. For that, you need some energy, so there is a strong management part to it. Try it out, you may really unlock a fun part of this game.", "GamerBossTNTMar 4 at 7:07 AM\nI THINK IT SHOULD NOT BE A GAME!!!\n\nEverytime I get killed by a bot, the bot waits for me to respawn... and it kills me again. I am infuriated. \n\nHelpful | 1", "Lamprey79Dec 11 at 4:42 PM\nThe shooting ruins it\n\nThe game starts off fun, but it's ruined his the shooting mechanic. It takes no skill whatsoever to shoot, literally impossible to miss. This means it's not really a racer since you get blown up by anyone at will.\n\nThe problems are:\n1. Long range find are hitscan, to shell travel.\n2. Target boxes are really big & easy to hit.\n3. It takes 3-4 sec to kill someone.\n\nThis means people can't miss you, dodging shots with fancy driving is not an option, and by the time you know you're being shot you're dead.\n\nCould be great fun if the developers add a skill component, but refunded in the current shape.\n\nHelpful | 7", "dustinphillipsJan 11 at 5:18 PM\nGood game\n\nFun game. The commentary from the game host is a bit cheeseball, like a weird attempt to be Captain Spaulding. Other than that, I dig it.\n\nHelpful | 1", "chipskylark42Dec 6 at 4:58 PM\nGreat Start, Needs More\n\nThis game has been very enjoyable to play for the first couple days Ive had it. The combat is fun, the tracks are cool, and the car options add some depth. The single player mode is good to get players used to the game before they take on multiplayer. The graphics could be better, but ultimately I am satisfied with them. The only gripe I have with Death Lap right now is that there is no progression incentives to keep multiplayer alive. The game is fun and great right now at release, but soon the game will lose some luster and may not stand the test of time. To combat this, I recommend making some sore of multiplayer progression. It does not have to be something huge. It could be as something like completing challenges with a certain vehicle to unlock a different version/skin of vehicle. I have the feeling that racing against other peoples times may get old after some amount of time\n\nI also see tons of room for expansion. You guys could implement a team race option with one person as a gunner and another as a shooter. I would also love to see an option to race with friends in the future!\n\nHelpful | 2", "CaptainFroglegsJan 2 at 10:07 PM\nMeh\n\nMeh. Was excited about driving a car in a racing game and thought shooting would be a plus. Pretty difficult to get the hang of and the hand steering opposed to the stick is completely broken. Idk if its just me but I was pretty let down after trying to play for 2 days straight\n\nHelpful | 0", "Dr_HunkDec 27 at 9:14 PM\nGood\n\nIts pretty fun and cool, not going to lie. However, the price tag seems a little more hefty then the game. For twenty dollars you can super hot (special deal right now, normally 25). And super hot is so cool and awesome. You could also pay a portion of beat saber. Its a good game, however I wish there were more car selections and track selections, as well as 10+ game lobbies. With only six players, the games feel empty and sometimes boring when your way behind or ahead of the pack. Its a good play overall but needs some updates.\n\nHelpful | 1", "aaron.sommers.1253Dec 6 at 11:13 AM\nDeath Lap\n\nVr race car battling at its finest. Death Lap is so gosh darn good, if you wanted a car battling game done right this is the game. Great graphics, sound is also great, I also love the choices in cars, power ups, and tracks. Wow on this title, I didn't think I was going to love game as much as I do, thank you devs. Back to racing, see you on lap, Your Death Lap :)\n\nHelpful | 6", "BossbeastDec 5 at 10:35 AM\ngreat fun\n\nwas going to buy Arizona sunshine but I have that already on PC and PSVR so gave this a try instead and its a blast!\n\nHelpful | 27", "TurboBoarDec 5 at 5:35 PM\nFINALLY A RACING GAME... FROM HELL!! \n\nThis game rocks!!! \n\nSheer madness, steering while avoiding death traps and being shot at while trying to shoot your opponents is a real challenge and GREAT FUN!\n\nOnly downside so far... it has only 5 tracks and 5 cars, and hopefully the developers will add more over time. The graphics however are amazing and the gameplay with others online makes this a trivial detail in the scope of this game being a blast of excitement. A MUST HAVE!\n\nHelpful | 15", "todloDec 13 at 4:17 PM\nimmediate motion sickness\n\nit's barf-inducingly insane that this is categorized as a \"comfortable\" experience, with defaults set to \"moderate\". specifying comfortable is buried in the hard-to-find settings (which aren't immediately available from the pause screen). the first thing it should do, even before the intro, is ask how you want to set that preference.\n\nHelpful | 4", "chumpleeDec 8 at 9:11 PM\nIt's alright.\n\nIt's fun. Needs some work though. The sound effects for the cars and weapons are pretty bad. The graphics, music, and voice over are great though. Could use some unlocks to have progression. Right now I would say it's more like a $10 game.\n\nHelpful | 4", "ummwhatsureDec 6 at 8:20 AM\nA must own\n\nI actually wasnt looking forward to this game but bought it because I was kinda let down by another title that came out the same day. I wont say what game that was so I'll just call it \"southwestern daylight\". Anyways, this game far exceeded my expectations in every way. The graphics are great and the gameplay is a blast. This is absolutely one of the best games on quest. If Job Simulator is what you show someone whose never seen vr before than this and superhot is what you show to the friends that say \"ok what else you got?\"\n\nHelpful | 14", "JemmsterDec 31 at 4:38 PM\n\nWould have to give it 5 stars great game give it a go you wont regret it ;) didnt make me motion sick at all in firt person veiw speed of car was awsome. quality of game is awsome . lots of fun if you like raceing and shooting give it a go. i like th fact that they didnt use a gamepad this is VR use the VR options ;)\n\nHelpful | 1", "HelloAlice2019Dec 16 at 8:43 AM\nMy favorite Quest game so far!\n\nThis game is fantastic for short VR sessions that you can quickly jump right into. All the ramps, twists, turns, shooting opponents and flying through the air (sometimes with umbrellas) feel incredible! Each time after playing this game, I seriously feel like I just went to a theme park. It is so much fun! And I love the multiplayer mode.\n\nCON: only 5 tracks. While 5 different vehicles to pick from is more than enough, I really hope to see more tracks added to this game in the future. Even if it is for a small fee per additional track like with the Epic Roller Coaster game.\n\nHelpful | 8", "Littlemack02Dec 5 at 7:27 PM\nHonestly I hated it first impression\n\nBut...it got better once I got into multiplayer. The controls were lacking. The options were lacking. The car flip needs to be removed (dont know whos idea that was) massive loss of immersion. I have NEVER gotten motion sick. Thanks to this game I finally have. I tried turning comfiest all the way up. Nothing. I tried third person. Made it worse. It was just a massive disappointment. Multiplayer was fun. I enjoyed hearing random strangers curse at me after they got blown up by me. But still it lacked miserably. Id hate to get a refund but honestly I cant play it. Like at all. I know you guys put a lot of work into it. But it honestly feels like it should still be in beta. I will be doing a full review on my YouTube. (LittleMack02) but guys thanks for being part of the VR community. Keep up the great work.\n\nHelpful | 11", "Roxtar73Dec 14 at 8:15 AM\nIts better than VR Sprint Karts! :(\n\nUpdated review. I still like this game but I have to be honest. The only reason Im keeping the games is in hopes the developers add content in the future. Otherwise this game isnt worth buying. There are 5 cars and 5 levels. Once you race them all the only thing to do is play online which would be great if it wasnt all populated by bots. Most online races are maybe 2 players and 4 bots. Its boring and repetitive. Reduced to 3 stars until more content is added. That being said its still better than VR Sprint Karts.\n\n\n\nI bought VR Sprint Karts a few weeks ago as it was the only racing game on the Quest. A new opponent has entered. Death Lap is so much more fun and Plays like Twisted Metal & Mariokart had a baby, and I assure you that is a good thing. The fun to price ratio is ok but youre paying about $2 per track and $2 per vehicle. With a single player mode and online multiplayer the amount of content you get for your (US)$19.99 may not really be worth the ticket price to some. This is a ride you may want to miss even if the core mechanics are great the content is lacking.\n\nThat being said I have some complaints/suggestions /list of demands (sarcasm on that last one though)\n1. The game needs to be more liberal with the boost when drifting and tricking. I find Im always out of boost and cant power slide to build up more because I cant boost around corners.\n\n2. The disappearing and reappearing mini map. Just pick one. I get a map or I dont but its distracting having it pop in and out.\n\n3. There arent enough tracks and the ones that exist have a couple that are just too Mariokart and not Twisted Metal enough (pinball and roller coaster tracks) perhaps an expansion pack with more tracks. Maybe have a couple point to point races as well.\n\n4. more vehicles would be nice. Maybe in DLC you could have several tracks (6) and like 3 new vehicles.\n\n5. A Garage\nIn the garage we could check stats for each car see where we placed in each race and give the car an overall finish (where theyve finished each track averaged. So all 1st place wins on all tracks gives you a 1st place finish this is independent of other vehicles place scores. If all tracks have been completed by all cars in all 1sts then all cars would have 1st place overall finishing.\n(Hope you get what Im trying to say)\nThis would probably be one of the single biggest and most important Quality of Life additions so one can keep track of what cars have won what races.\n\nAnyhow thanks for such a fun game to play.\n\nHelpful | 4", "james.southworthDec 25 at 2:19 PM\nNot as immersive as I'd expected\n\nI just thought this racer was poor. Didn't feel immersed in it whatsoever, the controls were poor for a VR experience.... I was expecting to grab the steering wheel and then feel like I was racing - wasn't at all like this even after I changed the settings to the steer motion controls. Just felt really poor compared to other experiences out there. Developers, sorry for the poor review but I really expected a more immersed racing experience.\n\nHelpful | 1", "Hotshot80sDec 7 at 12:50 PM\nMad Max meets Mario kart. Obvs\n\nThis game is awesome, short but worth the money,\nThe cars are very detailed with shine on the chrome and decent textures and reflections.\nShadows are also present.\nBut nothing is as awesome as the giant guns mounted on your cars\nThat you get to control with the right touch controller.\nWhile steering with the left.\nThe tracks only being 5 of them are really well designed and textures look good.\nThe best element is shooting other players, watching the trail of smoke left by the destruction of your missiles is insane. Drifting round corners to gain speed is a nice mechanic it works well.\nI wish there were a few more tracks, a battle mode and grand Prix, the multiplayer is the place to be for now and I hope to see updates soon.\n\nHelpful | 10", "tully.travellerDec 5 at 11:59 AM\n'Interstate 76' meets Mad Max... in VR!\n\nI just spent the last hour checking one of the few racing games available yet for the Quest... The combination of various weapons and power-ups both on your car as well as various hand-held weapons to use with your 'non-driving' hand - these all combine with 5 different vehicles and 5 different tracks to give a great deal of variety. With single player options as well as multiplayer, you can practice and test your skills against a reasonable AI before racing against the community.\nMost of my games ended in a chaotic gunfest race to the finish, but the driving physics, while definitely arcade-y seemed solid and consistent. All around, a fun racer that could stand a couple of more tracks but is a welcome entry into the Oculus library.\n\nHelpful | 11", "DiamondbackDave069Dec 16 at 9:44 PM\nCross buy makes it all worth it.\n\nI love that devs do cross buy. I tend to stay away from the ones who dont. I figure I bought the game I should be able to play it on either headset I am using at the time. But outstanding game. If you were a fan of twisted metal. This is one you need to have in your library!!! Dont even hesitate!!!\n\nHelpful | 5", "ProdigyZay97Mar 21 at 12:37 PM\nThat SH*T IS FUN\n\nGood game , very fun . Just needs more content . It needs to be fixed when you hit a wall its not so effective on your car in a race but everything else is surprisingly perfect . It really feels like your in war .\nAmazing game !\n\nHelpful | 0", "manbearpig400Apr 21 at 12:25 PM\nGreat game!!!\n\nPlease add more vehicles and more racing tracks. Theres definitely enough but more would be AMAZING. this game is insanely fun. Worth every dollar. Its like Mario cart but more mad max style. LOVE it.\n\nHelpful | 0", "ANGERSNIPERDec 6 at 1:14 PM\nMeh\n\nPros: no motion sickness.\nGreat fun when you get a gun.\nGood array of vehicles and weapons.\n\nCons: die far to easy.\nTracks aren't very well designed.\nRelies too much on boost.\nTurret guns and hand guns empty fast.\n\nHelpful | 8", "MattymochismoDec 15 at 3:06 PM\nAwesome, and some suggestions\n\nAlright, so I am a fan of Mario kart and this is like a more mature Mario kart but in VR, which is completely insane. 10/10 should buy and only $20! I love how different and unique each car is , every one of them has different looks, weapons, special abilities, or stats. Now for my suggestion: There should be More single player maps and maybe a campaign where you eventually escape the show by completing different missions, challenges, and boss fights. Maybe even a boss fight against the host at the end of the game.\n\nHelpful | 4", "falocDec 7 at 1:08 AM\nCongratulations OZWE!\n\nThis game is just what the quest needed. Excellent game play and hours of fun. Its a game you have to work at to master the controls which is why I like it. I find most vr games are too easy, but this has to be mastered if you want to win. Masses of re-playability! Thanks to OZWE for putting so much care and attention into this game.\n\nHelpful | 8", "LayDownBoyJan 14 at 12:22 PM\nBoring as hell\n\nNot even close to being what the advertised video showed. The hype just isnt there. I would like a refund\n\nHelpful | 4", "ShityThePirateDec 7 at 11:27 AM\nTwisted Metal with a carmageddon vibe\n\nLove it for twenty its impossible to complain. The weapons are fun and the vehicles are pretty gnarly, shooting while driving is wicked fun and the graphics are fantastic, highly recommend but would suggest playing sitting in a rotating chair than standing\n\nHelpful | 3", "Przemo-cDec 6 at 4:57 AM\nRacing, Mayham, Fun, Fun, Fun!!!\n\nIt's Megarace, Death rally, Interstate '76 all rolled into one VR game!\n\nIt's a great arcade combat racing game. So much is happening at the same time not a dull moment in sight. Juggling driving, drifting, shooting with main weapon and special powerups and defending yourself...\n\nGraphically it's not that great but it's not bad either(on Quest) but with all the action I can forgive that small con.\n\nTons of replayability both in single player and multiplayer!\n\nTreat yourself! Get this game!\n\nHelpful | 8", "Fredd32Dec 5 at 6:30 PM\nExcellent\n\nThis game is a blast!! 5 stars when we fully populate multiplayer.\n\nHelpful | 5", "ArsoulDec 6 at 7:50 PM\nOne of the best VR experiences I've had\n\nThe developers have done a fantastic job with this, the trailer doesn't do it justice. The maps have amazing attention to detail, Gameplay mechanics are great, Motion sickness isn't an issue (for me), Vehicles are awesome, Environmental effects are solid and the sense of humor is on point. They really made a seriously solid VR experience, highly recommend!\n\nHelpful | 7", "jgambin1Dec 6 at 8:24 AM\nEverything we wanted and more!!!\n\nI just got done playing Death Lap for the last couple hours and this game has far surpassed my expectations! I'm so happy that this title has delivered. Kudos to the developers over at OZWE games!\n\nHelpful | 5", "TyvekdawgDec 9 at 8:49 PM\nDeath Lap\n\nI cant believe I spent money on this game... I grew up with Car Wars by Steve Jackson and was hoping to live out my fantasy of driving and shooting. This is simply Mario Kart in VR. Hard pass my friends....\n\nHelpful | 7", "MattchupichuDec 6 at 10:48 AM\nGreat and will get even better!!\n\nGreat game! I was excited at the end of the day to come home and race! Shooting in the game is great! The only things I would suggest improving are:\n- the low height limiter for the jump sequences seems to be so low that sometimes hitting a boost pad was forcing me into third person and starting a barrel roll.\n-on a couple occations, landing caused some glitching and turned the car all the way around in a matter of a frame or two.\nNOTE: This game rocks!! I will continue to play it joyfully and cant wait for updates and new content!!\n\nHelpful | 7", "centroxDec 6 at 9:01 AM\nGreat drive and shoot game\n\nCombat racing for VR! It's like a grown up version of Mario Kart. Race on tracks and pick up power ups to destroy other racers. I've only played the first few tracks so far but so far so good. Reminds me of the old Activision PC game \"Death Track\".\n\nHelpful | 3", "graham-scanlanDec 11 at 11:59 PM\nI so wanted this to work\n\nFirst of all Im glad to see this game released although at the moment it seems very buggy on many levels, one being for some reason reporting a bad internet connection when the connection is perfect. Some times the steering has a mind of its own. Hopefully it will let some updates to iron out the issues. Maybe its a server problem\n\nHelpful | 0", "eaglespaceDec 15 at 12:09 PM\nNot truly a multiplayer\n\nThis should not say multiplayer when its not. You cant play with a friend. Junk and false advertising\n\nI purchased for both headsets to find this out. Need my money back.\n\nHelpful | 7", "SupersonicblueDec 10 at 5:45 PM\nWOW..Hours of fun\n\nThis game is amazing and puts me in the mind of twisted metal in VR, and the style feels like starblood arena on psvr or eve Valkyrie .. it's got the same fun elements of those games lotta time went into it and it shows nice one. I'm sure there are bugs I didn't notice but as long as they update and keep working on it they got a really nice one u won't regret buying!!!\n\nHelpful | 4", "BLZDPraetorianDec 8 at 5:08 PM\nWATCH OUT STREET RATS! AHAHAHA!! \n\nOhhh this game is just great. I love the steering options i think they did great on it. And i really like the behind the wheel feel. And the 3rd person is wicked!! My favorite moments are when an opponent is getting close to me, side by side. We look over at eachother waiting to make a move... Do i wait? And throw up my shields ? Or fire the first round? Neither.... Because some junk rat blew us both up hahahahaha. Its fast paced yes! But very strategic! You have health and \"boost\" bar. Health regenerates slowly and you need to sparingly use shields, boosts, and try gaining boost thru drifting, air tricks (YES THERE IS AIR TRICKS!) And killing opponent's! I have been in 1st place, used my boost up and lost because i couldn't defend myself. I needed to be more careful. This game, Is so much more then a race game. There is combat, Strategy, weapons skills, and a survival game in one. Take a seat, dont worry about strapping in..... Welcome to DEATH LAP            \n\nHelpful | 5", "ParadiseDecayDec 8 at 5:37 AM\nI Play the game in a REAL CAR!\n\nMy Initial Thoughts:\nNot as good as I was expecting with all the hype, it seems to be missing something and I can't quite put my finger on it.\nMy immersion factor was through the roof though as I played this sitting in a real car!\nBut for now this is probably the closest VR game you will get to the Twisted Metal genre.\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=Ol9wAHcjCNY\n(Please Note: Links might not work from Oculus, so please search YouTube for 'Paradise Decay VR Death Lap')\n\nHelpful | 2", "SpenDivisionFeb 5 at 11:10 AM\nDisappointed\n\nGot boring really quickly...\n\nHelpful | 1", "OrdinaryWorldDec 8 at 12:22 PM\nVery promising game but complex to start\n\nQuest needed a good racer and so it's about time that something with so much potential came along. Death Lap starts with some really poor acting, which in hindsight I should have just skipped. THat's followed by a very useful and necessary tutorial. I kinda wish the tutorial had been broken down more, introducing new elements race by race maybe. I found myself in the first couple of races still trying to work out the basic buttons, never mind the more advanced stuff. Where the hell did they put that shield button again!? The game is fun and I expect once I start to master the controls, I'll begin the enjoy things a little more. For now, I'm going with a high 3* with fair potential for an increase to 4* depending on how things go.\n\nHelpful | 1", "jayisspillz94Dec 7 at 2:12 AM\nTwisted metal on crack!!!\n\nThe steering let alone the shooting is fluid like agua. I love this game and no Patricia u can't play it's my headset you got yours right there\". Jeez man my girl keeps trying to play my game while I'm writing this comment. But yes I wanna see dlc galore and I wanna see a water board. More cars transformers would be dope.\n\nHelpful | 5", "lineaboveDec 12 at 5:04 PM\nGood racing game\n\nI won this game and couldnt be happier, great piece of software. I only miss steering with my hand instead of the stick as it doesnt feel natural.\n\nHelpful | 3", "BertHalfpintDec 5 at 3:16 PM\nBrilliant!\n\nHe he he what a blast !\nAnyone remember Crash Team Racing on ps?\nThis is one crazy ride. From the very start I was grinning like a loon and loving the huge Gatling gun above my head. You seriously need your wits about you and once you gain some sort of control you just hunt those other cars down.\nWho cares about winning, just foot to the ground and go. I was shouting ( swearing )at the other drivers, doubling back for ammo and taking in the scenery ( crashing ) . Really looking forward to how this develops and what crazy updates will be offered.\nWe bought the Quest to immerse ourselves in the games of yesteryear.\nThis delivers folks, so give it a go.\nNow let's see what carnage I can inflict with the big truck..........see ya later ...... ha ha ha ha !\n\nHelpful | 5", "jd.biancottiDec 15 at 3:43 PM\nMY FAVORITE GAME\n\nSeriously was sketched when I first bought the game, and was kinda frustrating getting the hang of the game at first but this game is FAST paced FUN. Seriously a childhood dream come true, has a few minor bugs but over all super happy with this game. Skrrrrt skrrrrttttt\n\nHelpful | 3", "MaxpigeDec 10 at 12:59 PM\nAwesome\n\nBecause of some other race games in vr i was a bit hesitating on this one. There is NO motion sickness. The game is awesome. Super fun to play with a great great atmosphere. Bravo to the dev team for this.\n\nHelpful | 3", "CaryMGVRDec 7 at 6:54 AM\nNOYCE!!\n\nGRAPHICS: 4/5 SOUND: 5/5 GAMEPLAY: 5/5 FUN: 5/5 REMARKS: FINALLY, a kartracer on Quest!!  Some are complaining about the controls taking a bit getting used to, and that's true. But that's only because they're so comprehensive! You can do many things, and once or twice through the tutorial [where it's just you & a few puposely slow-moving bots] and you'll be just fine, really! I like this game a bunch and I think you will, too!\n\nHelpful | 4", "FollowWingsDec 11 at 5:16 AM\nMy childhood comes alive\n\nIve just bought n gonna refresh my review once i got home n try it out, but this game is Death Rally + Carmageddon together! So much thanks!\n\nUpdate: So it really is, Death Rally in VR and i fall in love to it from the style to the actor in screen (reminds me the Carmageddons game evil driver) till the actions in game. I love it all!\nOnly downside of the game is the very few tracks, cars and weapons but for 20$ it is a very nice start.\nPlease a ton more from everything, first a few free DLC and im ready for paid DLCs aswell.\nThis game rocks!\nPersonal wish: Flamethrower, explosive mines pleeeease! ..and add a pro race style with more speed!\nThese Developers of Death Lap were brave enough to take a 18+ game on the table!\n10 star\n\nHelpful | 2", "AlexAudioDec 7 at 8:14 AM\nExactly what I wanted!\n\nI dont usually write reviews but this game has potential to be a multiplayer monster. Racing with weapons. Very Easy to learn even better after learning all controls. Ive played most quest games and I play this one the most. As of now multiplayer pairs you up with 5 other cars. Hoping the devs offer a way to play with specific people. Im hooked!\n\nHelpful | 6", "IronicUsernameDec 10 at 4:34 PM\nMy favorite game at the moment\n\nPersonally, this was the first game I ever felt fully immersed. Especially when I was playing in a swivel chair and could turn with the car. Although there are only five racer, with different guns and special abilities, they all feel unique. Same goes for the maps! Each map is completely different and youll hardly ever find something reused in a map. From racing in Las Vegas (or Sin City) to racing in a giant pinball machine these maps have it all. I cant say that there was anything I didnt like about this game!\n\nHelpful | 2", "MoicoMDec 8 at 7:12 AM\nAwesome!\n\nI really love the atmosphere of the game! And the fact that you have many option for comfort that let you show this game to people who are sensitive to motion sickness without any problem. The races are fun, the tracks are varied and it is surprisingly beautiful for a quest game. I am not very good in online, but that is from me, not from the game itself haha!\n\nDefinitely a must have!\n\nHelpful | 3", "mannycalcccDec 10 at 12:05 AM\nLove it !\n\nGreat Race/Battle game. Pretty straight forward shoot and blast all your opponents during the race and aim to get first place! Every car is designed differently with special tricks.\n\nGraphics are good, you can shoot anywhere in the front or sides and it has a rear view option so you can shoot backwards . After I passed all the tracks I wanted things to get more difficult so I have been playing multiplayer to race against other gamers, which is way more competitive!\n\nHelpful | 2", "BlessMyUnderwearDec 7 at 11:01 AM\nThis could be more fun\n\nThe major issue I run into with this is crashes. It seems when my vehicle crashes, my neck snaps 180 degrees and I have to spend time trying to figure out a good way to turn around to correct my view from where I sit. This needs to be addressed.\n\nHelpful | 5", "sippy_cupJan 8 at 4:59 PM\nCRAZY GOOD!!\n\nI've been playing this nonstop, its just so fun! It gives you the thrill of racing, combat is great, and its the best and most realistic racing game on VR!\n\nHelpful | 3", "RowdyUpDec 7 at 10:10 AM\nThey finally created a real death rally\n\nThis is the game i've dreamt of for so many years , to be able to race cars while shooting guns , missles ,lasers , pick up upgrades and blow up the competition on the track. This is the best death rally type game i have ever played since Blur.\nThings i would love to see in the future:\n1. TONS OF MAPS\n2.tons of more guns and pickups\n3. Server list to browse races or join pending ones\n4. Tons of more cars and to be able to customize them to your personal liking\n5. special events and ranked racing\nTHANK YOU SO MUCH FOR THIS CREATION ITS FINALLY REAL\n10/10\n\nHelpful | 3", "StudebekkerDec 5 at 5:04 PM\nOutstanding fun for a fair price!\n\nIt is the first game of this type on Quest, so every average game would receive 5 stars easily.\nBut 5 stars for Death Lap are well deserved without first-in-the-field advantage.\nNo motion sickness, no glitches so far. Atmosphere of Carmageddon & Twisted Metal is in the air, but you don't have time to be nostalgic: you have some killing to do!\nGreat way of improvement would be DLC expansion in the future with bigger variety of tracks and cars.\n\nHelpful | 3", "Aracnareaper007Dec 5 at 6:49 PM\nMust buy for racing fans!\n\nThis game is actually pretty legit. I love the feeling of shooting other drivers while racing. The game has 2 steering modes one with joystick and one with hand movement. Note you dont need to swing your arm around like a crazy person just slight movements will steer it just fine. It kind of feels like twisted metal meets Mario cart with a mad max feel. Well worth the 20 bucks in my opinion.\n\nHelpful | 3", "dingoflingDec 11 at 5:45 AM\nTwisted metal Vibes\n\nGet some twisted metal vibes. Mostly Black but less dark. just driving and drifting is enjoyable. Throw in all the well placed button control's, a good tutorial and its the standard for unique car games on the Oculus Quest in controls and gameplay. Just fun, is what it is.\n\nHelpful | 3", "chakotaJan 7 at 5:48 PM\n\nGreat immersive twisted metal racing. You really do have to find the racing and steering mode your comfortable with and once you do the game is amazing!\n\nHelpful | 1", "DOGMEATZDec 7 at 11:27 AM\nGreat job Devs!!!\n\nThis game is a must buy for it to be launched in such a great state speaks volumes...its not perfect but close to it so far...few updates and it will be no doubt in my mind keep up the good work Devs!!! Oh yeah!!! one thing keeps happening and idk if its just me but sometimes when I will be in 1st the game skips and next thing I know I'm in 6th I've only seen it happen in multiplayer when someone joins or leave the game and also I noticed when its a full room its microphone feedback or static or something like that we've already started calling it \"mike\" saying stuff like \"ahh there goes Mike was wondering when he was coming back\".l...lol its a horrible sound please look into these minor issues and im sure this game will shine...\n\nHelpful | 2", "austinmonsterJan 15 at 5:08 PM\nFun game\n\nBut the guy/host is a super lame joke. If I ever see that actor in real life Im going to kick his junk\n\nHelpful | 1", "slopylopDec 28 at 7:56 PM\nMeh\n\nIt is a good game with potential but not to fun with the steering and not using your hands just your thumb.\nI do not recommend this game for the cost.\n\nHelpful | 1", "ivangranolaJan 21 at 2:20 AM\nGood but the drifting\n\nSounds fun, but when you drift you cant see at all, and controls could be a lot more simple lol. I'd take a refund if possible\n\nHelpful | 1", "kerlinjkDec 17 at 1:59 PM\nGood, potential\n\nThis could be so good they just need add more content, more tracks, more customisation, online is good but getting a constant interference noise which stops you being able to chat properly.\n\nHelpful | 2", "CryspycreamDec 5 at 10:08 AM\nAMAZING\n\njust like twisted metal :) awsome!!! oh btw 2nd review\n\nHelpful | 15", "michael.power.583Dec 5 at 4:17 PM\nVROOM VROOM\n\nWasn't expecting much from this game when we got the suprise announcement it was arriving today with no gameplay footage but decided to purchase and try and I'm glad I did. It is a fun drive and shoot game and the graphics are surprisingly good. Highly recommend you buy this game\n\nHelpful | 2", "andrewhunterDec 11 at 5:04 AM\n\nLose the giant guy talking in the sky; super cheesy and reminiscent of early japanese titles with bad acting.\n\nHelpful | 3", "GeeBee2Dec 5 at 4:48 PM\nBonkers\n\nThis is great fun. Mario Kart on steroids. I haven't got the hang of the shields yet so keep getting blown up but revenge is sooo sweet, even on NPCs. My only issue is that the Quest needs a racing game like the Grid and this isn't it. But still recommended.\n\nHelpful | 3", "ScanXDec 8 at 11:42 PM\nNot bad but..\n\nFrame rate is not very good, there is nothing you win, no new cars, no new map, no trophy, nothing. Only 5 diffrents races. It's not bad but quickly boring. Fortunately there is online multiplayer which grow up play time.\n\nHelpful | 1", "DaveStuart420Apr 27 at 11:40 AM\nExcellent VR developers!\n\nI can't write reviews well but I'll buy anything they make!\n\nHelpful | 0", "neshpicJan 19 at 6:14 PM\nHeads up before playing\n\nBoth my friends and I had stomach ache while playing this game. Environment graphics could be better\n\nHelpful | 1", "aghkoDec 11 at 8:47 AM\nGood Idea, Poor Technical Execution\n\nGot it to finally give a try to a VR driving game, and got very disappointed.\nThe best way to play this game is to use the thumbs Joystick and 3rd person camera.\n\nThe steering doesn't feel real. You can switch between joystick or the controller tilt but is not like steering the car, and the last option is far from being smooth or accurate.\n\nPoor air controls and the \"Flip in the air\" acrobatics mechanics often mess with you steering when you just get some bump or small jump when taking a curve... thus messing with your race performance since you crash upside down.\n\nSame with level collisions, when you hit it there is no smooth bounce back to track center, but often you just get stuck there.\n\nHelpful | 1", "darwins.lastDec 13 at 5:29 PM\nLots of Replay Value\n\nGood graphics, fun gameplay, leaderboard with friends, etc. make this a great game. High jumps actually get your stomach. And, you can play while sitting down, chilling between standup games. \n\nHelpful | 3", "jasmine.ferris2018Dec 15 at 2:42 PM\nNot true multiplayer\n\nI bought 2 headsets, so I can play with my kids. Cannot connect to with my son to play.\n\nHelpful | 8", "maydae23Dec 5 at 5:21 PM\nDope!\n\nWorth every penny, top of the line! Graphics 9.0 for Oculus quest. Gameplay/Controls 9.5. \"If Twisted Metal had a VR version this would be it\".\n\nHelpful | 3", "GrognakeDec 14 at 11:02 AM\nThis game has great potential\n\nyou should add more weapons and power ups\n\nHelpful | 4", "flojim1Dec 5 at 5:25 PM\nBig suprise\n\nIt s a show its a race i think only vr can make you feel that kind of race unreal but even better than a real thing just like the song\n\nHelpful | 3", "BGZ91Dec 5 at 1:54 PM\n\nAwesome game, hope the devs start a discord server for this game. I think a lot of people would use it for info and updates. It would also be good for the multiplayer I bet. Either way this is a great game so far.\n\nHelpful | 4", "garrick.goudyDec 16 at 3:20 PM\n\nReally fun! Well worth the money.\n\nHelpful | 3", "ItalianGuy81Dec 5 at 12:19 PM\nTop notch game!\n\nIt's everything I wanted it to be and more! Playing Twisted Metal on PS1 was everything and now I can actually drive myself and be in the game! So sweet, Thank you for a great game at a low price!\n\nHelpful | 6", "THESCOTTishGamerDec 9 at 12:58 PM\nFantastic\n\nGreat driving game experience with mad max style cars for you to pick and colour full levels (Pinball) what you waiting for !!! The game may feel short but its quality not quantity so would defo recommended it .\n\nHelpful | 2", "01kingjDec 7 at 5:00 AM\nUser error?\n\nNot quite sure how to proceed, I finish the advance training on single player...but there are no actual races available to participate in...restarted and still no tracks, just the default training lap. Seems odd.\n\nHelpful | 1\nDeveloper ResponseDec 8 at 8:22 AM\n\nHi, Did you complete the basic training as well? That should unlock the first track.", "Mark92325Jan 3 at 3:06 PM\nPure motion sickness\n\na good game if you want to get car sick and you cant get a refund\n\nHelpful | 3", "FerretLordPjDec 12 at 11:02 AM\nExcellent fun!\n\nReally good fun especially in multiplayer\n\nHelpful | 3", "shaunandash82Dec 6 at 8:16 PM\nAwesome game, bring arena maps!!!\n\nGame is a lot of fun. Limited maps but I'm sure more is coming. SERIOUSLY... ADD ARENA MAPS!!! This game is so close to being twisted metal in VR!!! Great but for 20 bones.\n\nHelpful | 6", "Beede87Jan 2 at 6:05 AM\nGreat game\n\nThis game brings back a lot of memories from when I used to play Twisted Metal. Good job guys keep it up\n\nHelpful | 0", "Zerocool69Dec 5 at 1:30 PM\nI love it!\n\nCarmageddon, Megarace, interstate 76 in one Game....and in vr!!!\n\nHelpful | 5", "imdoingstuffDec 7 at 3:15 PM\nDooooooodoooooooognsksnebevendn\n\nIru4idwnddndmxmxnnnnxnmcnxmcmc\n\nHelpful | 9", "txlcobraDec 8 at 3:31 PM\nAMAZING\n\nThis game is perfect it doesn't take long at all to join a public match it's not hard but I would love if they added a demolition area were you dont race you just fight to the DEATH.\n\nHelpful | 4", "awtreadDec 8 at 7:43 AM\nWOW WOW WOW WOW\n\nThis game is over the top! When I started my first race I found myself so immersed and I was having the time of my life! If you are even considering this game: DONT THINK ABOUT IT, BUY IT!!!!!\n\nHelpful | 3", "Paranuts76Dec 5 at 12:25 PM\nTakes some getting use to.\n\nTotally worth the $20 and appreciate it as well. Takes some getting use to but man one you do, things get fun fast. Maybe my new favorite game, I even played it before Arizona sunshine.\n\nHelpful | 5", "Dex-StarrDec 15 at 5:50 PM\nFlipping Awesome\n\nI'm hoping that the developers add more stuff. I absolutely love playing this game. Drifting will win you races. Master the drift\n\nHelpful | 5", "Nuttynatty354Dec 5 at 1:03 PM\nFantastic!\n\nBrilliant racing game runs super smooth and the gameplay is so much fun!\n\nOnly issue is the multiplayer is it only matchmaking or can we race with friends?\n\nHelpful | 7", "budgie0469Dec 30 at 1:10 PM\nSick\n\nVery good game but made me sick very quick\n\nHelpful | 2", "DroppinLoads24-7Jan 15 at 8:41 PM\nGreat game\n\nFully satisfied\n\nHelpful | 0", "dlr2683Dec 8 at 12:35 PM\nGood fun\n\nGood shooter/car game. After the tutorial it was a few races in the controls became easy to remember.\n\nNot much more to say, can't wait for more people to be on it as it is a good laugh.\n\nHelpful | 2", "DronePilotP4Dec 8 at 3:10 AM\nAwsum Racing....\n\nThis really is a great game, graphics, sounds, VR feel, everything you want to keep you entertained, over and over. Don't delay get this game added too your library.\n\nHelpful | 4", "almaml88Dec 5 at 10:14 AM\nWowww\n\nLooks absolutely amazing graphics, so easy to drive, love the car designs\n\nHelpful | 14", "IwanKrusensternDec 8 at 1:40 PM\nAmazing Mad Max Fury Road Experience\n\nTitle says it all. See you on the track;-)\n\nHelpful | 3", "jimmyray98Dec 7 at 9:12 AM\nEverything I hoped for but...\n\nThis is a fun game if you like to race. Its really immersive and fun I hope they add more to this game but Im still giving a 5 star review because it is a blast!\n\nHelpful | 3", "sebastian.kurz.583Dec 7 at 1:45 AM\nAwesome fun!\n\nYes! This is it! Mad Max, blast them away!\nHighly polished, dirt atmosphere, yes get it immediately!\nIts party time, see you on the road!!!\n\nHelpful | 5", "SnowUseDec 6 at 1:16 AM\nCross buy!\n\nGame is great. And it's cross buy.\n\nHelpful | 3", "MikeOliver88Dec 7 at 6:42 PM\nHell yes\n\n5 stars for creativity off the bat. The course designs are amazing. Game reminds me of the racing parts in the game Rage.\n\nHelpful | 5", "Tekray187Dec 12 at 7:15 AM\nIntense\n\nFast-paced racing action. Controls are easy to pick up  hard to master. Going after the top-10 times is a blast.\n\nHelpful | 3", "allenwrench59Dec 6 at 6:32 AM\nBetter then expected\n\nI Own ALOT of games now and I thought this was an excellent racer!! Definitely worth 20 bucks \n\nHelpful | 6", "xjoe90Dec 22 at 2:40 PM\nPoor Game\n\nBit boring\n\nHelpful | 3", "Aaronb3434Dec 24 at 6:05 PM\nCool\n\nFun racing game please add more levels, cars and weapons.\n\nHelpful | 1", "jcroonenDec 6 at 4:53 PM\nCool game\n\nMake me think of twist metal black\n\nHelpful | 3", "Leb0wskiDec 9 at 11:50 PM\nno running with friends\n\nthe game is nice, but there is no way to invite friends to the races. unbearable lack\n\nHelpful | 0", "RhyperDec 20 at 8:14 PM\nOne of the weakest Quest titles\n\nControls are clumsy, gameplay is bad.\n\nHelpful | 2", "rokocovingtonDec 6 at 7:51 PM\nJust straight fun\n\nTitle says it all. Mario kart mixed with twisted metal. You wont be disappointed.\n\nHelpful | 5", "Barnus8Dec 8 at 11:01 AM\nFinally a great title!\n\nPls make more tracks, i would pay 3 euro for every new track.\nThis game is the best quest game yet?\n\nHelpful | 2", "ShareProDec 21 at 8:23 AM\nLove it\n\nHighly recommended!!!\n\nHelpful | 3", "markmanicadDec 8 at 7:01 AM\n\nTis is the most awesome game in vr right now. Grab the controller and steer the wheel!\n\nHelpful | 3", "FamilyMagooJan 7 at 8:42 AM\nSo so..\n\nSo so..\n\nHelpful | 1", "MattyB711Dec 6 at 10:24 AM\nLike being in the game twisted metal!\n\nThis game was tons of fun especially playing with my friends.\n\nHelpful | 5", "bigjay79Dec 6 at 8:07 PM\nIntense\n\nI'm a button masher, this will take some getting used to.\n\nHelpful | 3", "DungeonquestDec 7 at 5:18 AM\nNice\n\nYeah\n\nHelpful | 2", "UrGamingTechieDec 12 at 7:03 AM\nVery fun twisted metal/ Mario kart mash\n\nThis game is a ton of fun. It is a mix of twisted metal and Mario kart. Controls well and easy to play. Racing and smashing and shooting others doesnt get old. Fun to play online..Wish it had more then 5 tracks but whats there is varied and well designed. Hope to also see more customization or an unlock system to keep interest high. Check out my full review on YouTube.com/UrGamingTechie\n\nHelpful | 3", "kingofkings93Dec 13 at 9:09 PM\nIt wont load up help\n\nIt wont load up please help\n\nHelpful | 0\nDeveloper ResponseDec 15 at 2:26 AM\n\nHi, Please contact stephane@ozwe.com for assistance."]