{"App Title": "DeoVR Video Player", "App description": "DeoVR is the best-in-class VR video player for all available headsets. \nEnjoy the best moments of your favorite videos. The built-in VR media browser delivers the best VR content from YouTube and other popular video sites. \n\nThe player is used to playback and stream thousands of hours of VR videos every day. It is designed to provide the best performance of every video for each VR headset. The simple and intuitive interface is achieved by a hi-tech back-end invisible to the naked eye. It is constantly being updated to include more features and better quality playback. Many suggestions are sent daily and we are trying to incorporate these fast.\n\nDeoVR unleashes the fullest potential of VR with:\n- A zoom feature that brings you closer to the action, just like real life\n- Tilt to adjust the video to your body position\n- Height fits viewers height to match the cameras POV\n- Rotation provides another perspective of the action in the video", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports GamepadSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Gamepad, Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Media Player, Movie, Utility", "Languages": "English, English (US), English (Australia), English (UK), English (Canada), English (South Africa)", "Version + Release Notes": "8.1", "Developer": "VRFavs.com", "Publisher": "VRFavs.com", "Website": "http://deovr.com/", "Release Date": "August 8, 2019", "Developer Privacy Policy": "WebVR Player Documentation Blog Forum Contact Us We on Patreon\nPrivacy Policy\nData Collected\nData Usage\nDisclosures of Information\nMiscellaneous\n\nThis document describes how we treat personal information related to your use of the Website, including information you provide when using it.\n\n1. Data Collected\n\nBrowsing the Website.You can use the search function, view articles, videos and pictures, and access other parts of the Website without having an account, in which case only your IP address, country of origin and other information about your computer or device (such as web requests, device type, browser type, browser language, referring URL, operating system and date and time of requests) will be recorded for log file information, aggregated traffic information and in the event that there is any misappropriation of information and/or content. If you have an account on the website and are logged in, the information may be associated with your account.\n\nRegistering on the Website.Registration of an account is required for using many parts of the Website, including purchasing access to certain content and using many other features. We request additional information at the time of your registration, including, without limitation, your name, email address and a password. Your IP address is recorded automatically. We may ask for further information to fill out your profile details. Some of this information may be used to provide you the Website and may become publicly available through your profile or through other use of the Website. If you intend to make your content available on the Website, we will collect additional information necessary to confirm your authority, confirm your compliance with law and to make available where necessary on the Website for others.\n\nUsage Information.We may record information about your usage of the Website such as pageviews, clicks, mousemoves, duration of video views, portions of videos viewed, search phrases, referrers and other various statistics. If you have registered and are logged in, we may associate that information with your account.\n\nUploaded Content.Any personal information or content you voluntarily publicly disclose online, including animations, pictures, videos, comments and your profile page or any other User Submissions, becomes publicly available and may be collected and used by others.\n\nOther Information.You may have the ability to make comments on content and engage in other social activities. Any such activities may be visible to the public.\n\nCorrespondences.We may keep a record of any correspondence between you and us.\n\nCookies.When you use the Website, we may send cookies to your computer to uniquely identify your browser session. We may use both session cookies and persistent cookies.\n\nPayment Information. If you purchase anything from us, you must provide payment information, including credit card, debit cards or bank account information directly to our third-party payment processors and their affiliates. We do not ourselves keep your payment information in connection with your purchases. All transactions processed by our third-party payment processors and their affiliates are subject to their respective privacy policies. We recommend that you review such privacy policies before using and of their services.\n\n2. Data Usage\n\nWe may use your information to provide you with certain features and to create a personalized experience on the Website. We may also use that information to operate, maintain and improve features and functionality of the Website, including building a recommendation system for the Website.\n\nWe may use your e-mail address or other personal information to send commercial or marketing messages. We may use your e-mail for non-marketing or administrative purposes.\n\nWe use cookies, web beacons and other information to store information so that you will not have to re-enter it on future visits, provide personalized content and information, monitor the effectiveness of the Website and monitor aggregate metrics such as the number of visitors and page views (including for use in monitoring visitors from affiliates). They may also be used to provide targeted advertising based on your country of origin and other personal information.\n\nWe may aggregate your personal information with personal information of other members and users, and disclose such information to advertisers and other third-parties for marketing and promotional purposes.\n\nYour username may be displayed to other visitors of the Website alongside content on the Website in relation to your uploaded content and other similar features.\n\nWe may use your information to run promotions, contests, surveys and other features and events.\n\n3. Disclosures of Information\n\nWe may be required to release certain data to comply with legal obligations or in order to enforce our Terms of Use and other agreements. We may also release certain data to protect the rights, property or safety of us, our users and others. This includes providing information to other companies or organizations like the police or governmental authorities for the purposes of protection against or prosecution of any illegal activity, whether or not it is identified in the Terms of Use.\n\nIf you upload any illegal or unauthorized material to the Website, or you are suspected of doing such, we may forward all available information to relevant authorities, including respective copyright owners, without any notice to you.\n\nWe may also share your information with third parties for the purposes of payment processing and any such information will also be subject to their privacy policies.\n\n4. Miscellaneous\n\nIf you have an account on the Website and have a password giving you access to certain parts of the Website, you are responsible for keeping the password confidential. Anyone else with your password may access your account and other personal information.\n\nWhile we use commercially reasonable physical, managerial and technical safeguards to secure your information, the transmission of information via the internet is not completely secure and we cannot ensure or warrant the security of any information or content you transmit to us. Any information or content you transmit to us is done at your own risk.\n\nStay updated with our newsletter\nNew features, updates and bug fixes only\nConfirm\nContact us\n Send\nPrivacy Policy Love VR? Join our team!", "Developer Terms of Service": "WebVR Player Documentation Blog Forum Contact Us We on Patreon\nPrivacy Policy\nData Collected\nData Usage\nDisclosures of Information\nMiscellaneous\n\nThis document describes how we treat personal information related to your use of the Website, including information you provide when using it.\n\n1. Data Collected\n\nBrowsing the Website.You can use the search function, view articles, videos and pictures, and access other parts of the Website without having an account, in which case only your IP address, country of origin and other information about your computer or device (such as web requests, device type, browser type, browser language, referring URL, operating system and date and time of requests) will be recorded for log file information, aggregated traffic information and in the event that there is any misappropriation of information and/or content. If you have an account on the website and are logged in, the information may be associated with your account.\n\nRegistering on the Website.Registration of an account is required for using many parts of the Website, including purchasing access to certain content and using many other features. We request additional information at the time of your registration, including, without limitation, your name, email address and a password. Your IP address is recorded automatically. We may ask for further information to fill out your profile details. Some of this information may be used to provide you the Website and may become publicly available through your profile or through other use of the Website. If you intend to make your content available on the Website, we will collect additional information necessary to confirm your authority, confirm your compliance with law and to make available where necessary on the Website for others.\n\nUsage Information.We may record information about your usage of the Website such as pageviews, clicks, mousemoves, duration of video views, portions of videos viewed, search phrases, referrers and other various statistics. If you have registered and are logged in, we may associate that information with your account.\n\nUploaded Content.Any personal information or content you voluntarily publicly disclose online, including animations, pictures, videos, comments and your profile page or any other User Submissions, becomes publicly available and may be collected and used by others.\n\nOther Information.You may have the ability to make comments on content and engage in other social activities. Any such activities may be visible to the public.\n\nCorrespondences.We may keep a record of any correspondence between you and us.\n\nCookies.When you use the Website, we may send cookies to your computer to uniquely identify your browser session. We may use both session cookies and persistent cookies.\n\nPayment Information. If you purchase anything from us, you must provide payment information, including credit card, debit cards or bank account information directly to our third-party payment processors and their affiliates. We do not ourselves keep your payment information in connection with your purchases. All transactions processed by our third-party payment processors and their affiliates are subject to their respective privacy policies. We recommend that you review such privacy policies before using and of their services.\n\n2. Data Usage\n\nWe may use your information to provide you with certain features and to create a personalized experience on the Website. We may also use that information to operate, maintain and improve features and functionality of the Website, including building a recommendation system for the Website.\n\nWe may use your e-mail address or other personal information to send commercial or marketing messages. We may use your e-mail for non-marketing or administrative purposes.\n\nWe use cookies, web beacons and other information to store information so that you will not have to re-enter it on future visits, provide personalized content and information, monitor the effectiveness of the Website and monitor aggregate metrics such as the number of visitors and page views (including for use in monitoring visitors from affiliates). They may also be used to provide targeted advertising based on your country of origin and other personal information.\n\nWe may aggregate your personal information with personal information of other members and users, and disclose such information to advertisers and other third-parties for marketing and promotional purposes.\n\nYour username may be displayed to other visitors of the Website alongside content on the Website in relation to your uploaded content and other similar features.\n\nWe may use your information to run promotions, contests, surveys and other features and events.\n\n3. Disclosures of Information\n\nWe may be required to release certain data to comply with legal obligations or in order to enforce our Terms of Use and other agreements. We may also release certain data to protect the rights, property or safety of us, our users and others. This includes providing information to other companies or organizations like the police or governmental authorities for the purposes of protection against or prosecution of any illegal activity, whether or not it is identified in the Terms of Use.\n\nIf you upload any illegal or unauthorized material to the Website, or you are suspected of doing such, we may forward all available information to relevant authorities, including respective copyright owners, without any notice to you.\n\nWe may also share your information with third parties for the purposes of payment processing and any such information will also be subject to their privacy policies.\n\n4. Miscellaneous\n\nIf you have an account on the Website and have a password giving you access to certain parts of the Website, you are responsible for keeping the password confidential. Anyone else with your password may access your account and other personal information.\n\nWhile we use commercially reasonable physical, managerial and technical safeguards to secure your information, the transmission of information via the internet is not completely secure and we cannot ensure or warrant the security of any information or content you transmit to us. Any information or content you transmit to us is done at your own risk.\n\nStay updated with our newsletter\nNew features, updates and bug fixes only\nConfirm\nContact us\n Send\nPrivacy Policy Love VR? Join our team!", "Space Required": "277.3 MB"}



["5 stars\n35%\n4 stars\n14%\n3 stars\n6%\n2 stars\n20%\n1 star\n24%", "blobbyxx3 hours ago\nThe best\n\nI got this app because I have an insta 360 1x camera. The app works well , it plays all my insta 1 x and EVO 180 videos and photos. \n\nHelpful | 0", "OasisisMar 1 at 8:57 AM\nGood VR player but browser have issues\n\nLike the control the VR player offers, but when I use the internet browser, a few website I am unable to scroll or click anything. The app didnt crash I am able to click settings or go to another website but not able to click or scroll within the websites. Five stars if that can be fixed\n\nHelpful | 44", "ZeleaxApr 3 at 12:52 PM\nGood idea, but ... No, thanks\n\nI wanted to use this app instead SkyBox, but tried and immediately got errors in several films at the start of using (SkyBox hasn't these problems):\nVideo\nXVID (12bit) - Error: Uknown Format\n\nAudio\nDolby AC3 - No sound in video (tried to watch two 3D films using DLNA)\n\nNo, thanks. But it was good idea to create this product.\n\nHelpful | 3", "IloveVR86May 22 at 1:46 AM\nGreat Player but can't uninstall\n\nI want to uninstall DeoVR but it doesn't work.\n\nHelpful | 2", "leob63May 10 at 2:15 AM\nCan't remove app\n\nApp stopped working but can not remove it for reinstall.\n\nHelpful | 3", "shyprektFeb 9 at 4:52 PM\nDecent VR player, sub-par browser.\n\nIt does a fair enough job at playing VR content, and the controls are solid, but as a browser it lacks serious privacy features like the ability to clear history or browse privately.\n\nSo far the only way I've been able to clear history has been to uninstall and reinstall, which is a little absurd.\n\nHelpful | 15\nDeveloper ResponseFeb 11 at 8:19 AM\n\nYou can delete any url from your history, if you select the trash can icon next to it. It's planned to add an option to erase all history with a single click in future updates.", "TipptippFeb 19 at 8:41 AM\n4,5 of 5\n\nAs stated, a must for Quest! Great VR-player and a real nice in app browser for online streaming. Lot of options to adjust the stream/picture.\n\nI agree that it lacks privacy features like a private browsing mode or the ability to pin code lock the app/bookmarks. I guess that's in development though.\n\nHelpful | 2\nDeveloper ResponseFeb 20 at 6:20 AM\n\nThank you for your review. Yes, a PIN code for the app is on the suggestions list and we hope to include this in future updates.", "gwthorntonMar 9 at 11:00 PM\nGreat player needs improvement\n\nI really like the control over the video playback. I would love to see the ability to view videos/photos from a media server. Would also like to be able to play from usb drive. Another nice feature would be the ability to hide folders.\n\nHelpful | 2\nDeveloper ResponseMar 11 at 4:22 AM\n\nThanks for the review. DLNA support is coming soon.", "DocAKIANov 10 at 4:05 AM\nPhoto! Next photo tranaition issue.\n\nThere is a very limited number of apps fo3 photos at the moment. So appreciated.\nMy issue is that current whenever a move to the next photo, the hud display pops up.\nPlease fix this bug\n\nHelpful | 7\nDeveloper ResponseNov 12 at 5:02 AM\n\nThanks for the suggestion. Added to the to-do list.", "M0ckingbirdAug 9, 2019 at 2:17 AM\nNeeds to support more VR file types\n\nIf you have Youtube VR and Skybox, then this video player is pretty pointless. I'm giving it 2 stars because it's free; otherwise, I'd give it a 1 star rating. I was pretty upset when I found out that one of my VR, porn videos wasn't watchable because the file type (MP4 Video File (VLC) (.mp4)) isn't supported, and yet, it worked flawlessly on skybox tv. The message that pops up is, \"Error playing video file! Unsupported format.\" I think the 5 star ratings from other users here is due to the fact that they had nothing to compare it to. In this case, I doubt they have Youtube VR and Skybox TV. If neither of those existed, then I'd actually give DeoVR a 4 star rating.\n\nHelpful | 42\nDeveloper ResponseAug 28, 2019 at 7:30 AM\n\nMP4 files are supported, as most VR videos are in this format. For more help, we would need more information about the video. We are constantly working on improvements and we appreciate your feedback.", "freemotoAug 29, 2019 at 10:34 AM\nStill incomplete\n\nI like this app as it has lots of configurable options to control the video. However, the one very basic feature didn't work: it did not resume playing where it was last stopped. This defect made the app unusable.\nUpdate Aug 24, 2019: today I got an update for this app. Now it can resume videos where it was last stopped. Good. However, there are still some undesirable things in the browser when going to the web: 1) there is no way to clear browsing history or save bookmarks or clear cookies. So all my browsing web link history are all there for everybody to see. 2) When I went to google.com, it said it was using an old version of Chrome and google suggested an update. So, DeoVR internally bundled an old copy of Chrome browser?\nUpdate 8/29/2019: the included browser is old. Just go to Google.com and on the top, Google said \"an old version was detected. Please update \". This is an old version of Chrome browser in DeoVR that Google already has patches to fix some serious vulnerabilities in the latest version.\n\nHelpful | 2\nDeveloper ResponseAug 28, 2019 at 6:25 AM\n\n1) There is an option to delete a single URL from browsing history. We should discuss about possible improvements regarding this option. 2) We tested it and there was no notification or anything about using an older version of Chrome. Everything worked fine. Tried some YouTube videos as well.", "PalleonAug 8, 2019 at 12:28 PM\nFairly pointless\n\nIt plays videos, but only ones on your headset - but not as well as the SkyBox or Oculus video.\nIt has 10 videos you can watch in 180o but not as good as other apps\nAnd it has a browser that is at best useable but inferior compared to oculus browser or Firefox.\nSo fairly pointless.\nUnless you really want an app thats worse than ones you already have\n\nHelpful | 10\nDeveloper ResponseAug 9, 2019 at 2:15 AM\n\nWhat do you mean \"it play only ones ones on your headset\"? It supports streaming as well. If you are referring to SMB or DLNA feature, unfortunately there is none. The videos you are probably referring to are only demo videos. This is not just browser, it's video player with browser feature. We are working on optimizing it though. You can suggest perhaps what is it you are missing. Compared to SkyBox, would you please share what is the difference in watching the video?", "ArnookieAug 9, 2019 at 8:08 AM\nGreat video player\n\nThis is a must install for Quest.\nIt's got a very clean easy to use interface. Plays 3d SBS video very well and supports most video formats. A great addition to the Quest. If you click on the browser icon within the app you are also taken to some great VR videos streamed to the headset. The Tesla video is great quality and well worth a watch. I use Skybox and have tried many other video players over the years and for a first release this is great. Hopefully more functionality will come in future updates. This gets a big thumbs up from me. \n\nHelpful | 20", "fl4shb1cAug 11, 2019 at 3:33 AM\nBetter options available\n\nUnfortunately I can't really find a use for this app when there are considerably better options available. Skybox has you covered for local/network streaming content in an immersive environment (which is kinda the point with VR), while Firefox Reality and YouTube has you covered for web based content. The included browser is basic at best (with no control/content/privacy options) and doesn't seem to work on many VR websites; you simply receive a notice explaining you need a WebGL compatible browser.\n\nHelpful | 5\nDeveloper ResponseAug 19, 2019 at 9:17 AM\n\nThank you for your feedback. I forwarded it to my colleague developers and we should discuss it.", "TraveljackAug 11, 2019 at 10:41 PM\nNot as good as promoted\n\nI tried it and found the first flaw: It can't pick up movies on my network. I don't want to copy movies to my Quest in order to watch them. Anyway, even the Oculus native browser can play my pc content. Skybox is by far superior.\n\nHelpful | 12", "VRPlayersAug 8, 2019 at 3:03 PM\nThe best and only!\n\nGet the most of VR vides on your headset right away!\nPerfect playback, great for watching video sites. Must try zoom and tilt features to customise the video and \"rotate\" for another view on things.\n\nHelpful | 5", "TorisHusbandAug 29, 2019 at 5:59 PM\nFantastic app with great control\n\nWith the ability to adjust nearly all settings, and being able to see file names easily makes this far superior to the standard Oculus Gallery app\n\nHelpful | 2\nDeveloper ResponseSep 9, 2019 at 7:20 AM\n\nThank you for your positive review. We appreciate it a lot.", "feelfarSep 18, 2019 at 11:57 PM\n\nnice work\n\nHelpful | 0", "Ghost_2019Aug 13, 2019 at 1:27 PM\nPointless app\n\nReasons why this is pointless :-\n1) Can not change to left handed\n2) The layout is shocking\n3) No browser videos work\n4) Very slow\n\nHelpful | 2\nDeveloper ResponseAug 19, 2019 at 9:19 AM\n\nYou should be able to change controllers. Hold grip button for I believe 2s. What would you change about the layout?", "dave.s.mcgAug 9, 2019 at 12:45 PM\nBest vr video player\n\nThis is the best movie player for vr.\n\nHelpful | 3", "adyan2015Nov 30 at 3:22 PM\nAdyan\n\nNice games\n\nHelpful | 0", "DAX_QcAug 30, 2019 at 10:44 AM\nLol. Nope.\n\nJust.. no.\n\nHelpful | 1\nDeveloper ResponseSep 2, 2019 at 6:41 AM\n\nWould you mind telling us what you don't like about the app?", "LlamaLlamaDuckAug 28, 2019 at 7:21 AM\nLove the app\n\nLike in the title, just love the app. I can either stream or play local files with no problem. Love the simplicity of the video player menu and additional settings. You guys are doing great job. Keep up the good work.\n\nI wonder what's next you have in store.\n\nHelpful | 1\nDeveloper ResponseAug 28, 2019 at 7:32 AM\n\nThank you for your positive review. Much appreciated."]