{"App Title": "Doctor Who: The Edge of Time", "App description": "A new mysterious enemy threatens to tear apart the universe and only you can stop them! Armed with the Sonic Screwdriver, players will solve mind-bending puzzles, grapple with iconic monsters and encounter new horizons in a quest to find the Doctor and defeat a powerful force that threatens to destroy the fabric of reality.\n\nKey Features:\n\n- Pilot the TARDIS: Team up with the Doctor and travel through space and time to new horizons, piloting the brand new TARDIS as seen in the last series.\n\n- Immersive Entertainment: Experience the world of Doctor Who like never before and interact with tools such as the Sonic Screwdriver.\n\n- Authenticity: Voice acting by the Thirteenth Doctor herself, played by Jodie Whittaker.\n\n- Official BBC Studios Licensed Product: Authentic music, props, sets, title sequence and Doctor Who easter eggs.\n\n- Iconic & New Monsters: Stand against iconic baddies, including the infamous Daleks, and even come face-to-face with brand new, never-before-seen monsters.", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Exploration", "Languages": "English", "Version": "343", "Developer": "Maze Theory", "Publisher": "Playstack", "Website": "https://www.doctorwhotheedgeoftime.com/", "Release Date": "January 23, 2020", "Developer Privacy Policy": "None", "Space Required": "1.28 GB"}



["5 stars\n32%\n4 stars\n23%\n3 stars\n19%\n2 stars\n10%\n1 star\n17%", "CacatuidaeJul 7 at 12:25 PM\nDoesnt feel like Doctor who...\n\nThis game was a decent length for the price, but as a Whovian, it was disappointing. It never felt like it was a Doctor who adventure. It was super linear, the Doctor constantly repeats her instructions, and worst of all, the Doctor doesnt speak in 1/2 the game. It tries to introduce a character, throw on a twist (thats been done in a similar way before), make us kill said character, then reveal that we didnt actually kill them two minutes later. aliens are introduced and it doesnt feel like the way a DW alien feels. Theres no learning about them, facing them, then beating them. Its just oh look at these guys! Do this one thing... oh wow you beat them!.\n\nThe only dr who elements are the Daleks, the weeping angels, and the tardis. The dalek sections was the worst because you couldnt control your own body, the weeping angels spoke in their part. **last I checked they couldnt speak on their own but whatever** . The ending was confusing as well.\n\n3/5 because the game was long enough, the other two stars being Docked is for the confusing/badly done plot and how little this feels like a dr who story\n\nHelpful | 23", "FatSheamusMay 15 at 10:23 PM\nIt has its moments..\n\nThough originally plagued by glitches, the designers managed to repair most of what was breaking the game.\nUnfortunately this does not improve what is a lackluster experience. I understand that the quest is a slightly lesser unit compared to something hooked up to a computer, but if games like Red Matter have taught me anything, it's that it is possible to make an environment look believable on a unit like this if you put enough time and effort into it.\nSome of the gimmicks were pretty clever, but a lot of the game seems void of a lot of detail and interactivity.\nFor a Doctor Who fan, it is worth at least one run through for amusement. Not a lot of replay value though.\n\nHelpful | 43", "NoraBrightstarJun 25 at 10:47 PM\nWorth it if you enjoy the show.\n\nIf you're a fan of the series, then it's definitely worth buying. For the most part, it feels like a proper love letter to the fans, and feels like you're in an episode of doctor who. The writing was a tad off, but up through chapter 4, it was a good game. Chapter 5 however was awful. There was nothing to do, you couldn't even move, and the cutscene that took the majority of the chapter looked incredibly cheap. And story wise, the ending is as unsatisfying as it gets and ends up leaving a bad taste in your mouth, especially since you go into it after a very cool sequence in chapter 4. I don't know if they rushed their way through chapter 5 or what, but it definitely deserves AT LEAST 2 stars knocked off because of it.\n\nIf you like the show, then it's worth the money play through it once, but if you're looking just for a puzzle game, I'd look elsewhere.\n\nHelpful | 7", "aurosieJun 18 at 10:04 PM\nvery scary,,, difficult to describe\n\nthe game was not advertised as horror very much, which was a lot of distress when i was launched into a horror like scenario. one thing that gives doctor who its charm is the doctor, having the time lord there to offset the scenarios. having the digital assistant was fun, but i felt so very alone and afraid. i heard rumors of a future game, and if anyone important were to read this, then i would like for them to note that it would be lovely to have another character, if the adventures will continue with the fear. if we could interact with characters too, showing the horror of people can sometimes be more than that of aliens or robots would be fun. i liked the game, dont get me wrong. i just want people to bounce off of. if you like horror, i would suggest this game for you!!! if you watch doctor who for the humor and characters, i would say pass on this game. it was immersive, but lonely.\n\nHelpful | 6", "jspehl9 days ago\nWell.. you can steer the Tardis,...\n\nWell. You have a sonic, can fly the Tardis, listen to the doctor's voice, have some original sounds and some beautiful views... and a linear story and relatively simple puzzles so far. A fr is fine for this game I guess. :)\n\nHelpful | 1", "Cy8ercopJul 25 at 4:02 PM\nWayyy too buggy sorta boring...\n\nThe game is buggy...I fell out of the world from the first room, the laundry room, and then when I escaped the office with the sonic, I somehow got stuck above the map and fell out of the world several times trying to get back into the game...Also, the fact that the game has to load when leaving/entering the TARDIS ruins the fantasy of it for me...I sorta expected more from a BBC licensed Doctor Who game...definitely going to get a refund...\n\nHelpful | 3", "BurntSinai25 days ago\nShould be titled Kinda Dr. Who Inspired\n\n$20 is too much for this game. The Weeping Angels were kinda cool. Large portions are too dark to see the scenes. The Doctors holograph on the TARDIS was not well made at all. An okay game. Wouldnt recommend for true Who fans.\n\nHelpful | 0", "W4XJul 27 at 1:16 PM\nWorst headache ever\n\nThis game is a nightmare, its very poorly done, the controls are extremely wonky, the action is meh and boring, the visuals look ok at best and the gameplay is simply put awful and uninteresting. Absolutely not worth the price.\nIt was even more painful to me as my little brother is a huge fan of the series and I bought it for him but he couldnt understand how to solve the puzzles and I had to shout advice at him while he played with super wonky controls that wouldnt do what he was trying to do. If this was my first introduction to VR, I would have wrote it off as a silly gimmick.\n\nHelpful | 3", "neilasaurusJul 18 at 12:17 PM\nPretty cool\n\nAwesome to be inside the Tardis, use a sonic screwdriver, and see Daleks and such.\nA little bit buggy though. The first time I took a real step I fell out of world. Another time my sonic disappeared. Both fixed by quitting and going back to last save point.\n\nHelpful | 1", "Tilly_DoggieJun 29 at 5:58 PM\nIt's like being in the actual show!\n\nI'm not usually scared by Doctor Who, but this game was terrifying... and awesome! If you're a fan of the show, this game is definitely worth it. It's every Whovain's dream to be the Doctor's companion, and this game makes it possible! You get to solve puzzles, fly the TARDIS, face weeping angels and daleks, all while trying to find the time crystals the Doctor needs to save the universe! The ending wasn't quite what I had hoped it would be, but the rest of the game makes it worth while. If you're a Doctor Who fan, I'd definitely recommend this game. (Be prepared to be scared, though!)\n\nHelpful | 2", "MrDonnieXMar 26 at 10:51 PM\nThis Doctor blows...\n\nIt's ok. The game is just straight forward, no deviating, no open world. Doctor is annoying asf. She repeats herself when you don't solve a puzzle in a certain amount of time. Side story to the main show I guess... this story makes the Doctor seem kinda cruel, (spoilers!!). Time loop!\n\nAnd of course the same old monsters, nothing's changed, except the last monster. The writers today have no more imagination. No wonder the ratings for this Doctor is going down.\n\nHelpful | 54", "AlmightyGemini16 days ago\nGreat game but.\n\nNeeded a little more for the price.\n\nHelpful | 0", "pouneh.morakkabiJun 19 at 9:36 AM\nDoctors stuck at home\n\nAll these previous incarnations of the doctor and their companions stuck at home with great voices could add additional content or a new mission.\n\nHelpful | 3", "King_Of_EgyptJul 2 at 12:43 PM\nTotally amazing\n\nThis game is really amazing \nI like it very much\nI'm a really big fan of the show and now to be inside the TARDIS with the doctor is wooooooow\nAnd the puzzles are really good and make your mind in sport\nThe only annoying thing is the black screen when you go outside the environment\nPlease fix this\nBut you already did amazing and awesome work\nSo thank you very very much \nLove from Egypt\n\nHelpful | 1", "Crewsy.123Mar 29 at 4:41 AM\nExpected better\n\nMost Quest games when you watch peoples first plays online look ok  but then you play them and you get drawn in by the feel and immersion.\n\nThis one on the other hand looked so promising however I feel failed to deliver.\n\nThe graphics damage the brand for oculus as make you think this is all a low powered head set can give. For example when you look out the Tardis for the first time into space it feels flat and that you are looking at a bad 90s render of a space pic.\n\nI know better can be done when you compare it to Vader Immortal that really made you feel in a different place. Although the gameplay for a one path game is not a disaster, it fails to keep you interest.\n\nUpdate / I have raised the rating on this as the developers keep working on it however my honest opinion is If it disappeared from my library I wouldnt notice.\n\nHelpful | 13", "DreamerO9 days ago\nTentative 3 star thanks to developers\n\nI left a really low rating of the game and worst review Ive ever given due to technical issues. The developers respond to a lot of the feedback including mine, and seem to be working very hard to improve the game.\n\nIm making my Star rating for now 3, until Ive been able to replay the game. Hoping its finally become the 4-5 I thought it would be at first.\n\nWill update my review once Ive played it again.\n-O\n\nHelpful | 35", "JinxxSpeaksJul 9 at 12:39 PM\nSo upset\n\nI tried playing this game only to have fallen out of the world and have a whole section of gameplay skipped. So now I either continue and miss out on what happened or I have to start over.\n\nHelpful | 0", "Get_To_Da_Choppa_VRJan 23 at 4:35 AM\nALLONS-Y!\n\nDoctor Who Fans Score - 4 Stars\nNon Fans - 3 Stars\n\nPaying homage to the original source and performing some wish fulfillment for fans, whilst also making the game accessible for newcomers as well Edge Of Time is a good solid game.\n\nYou will be in control of a new unamed Doctor companion and storywise it is very much in keeping with what you would expect from the Doctor Who universe and plays out a bit like a feature length episode using the tardis to travel across time and space for high stakes adventuring with some twists and turns along the way.\n\nThrouought the 2-3 hour story, the gameplay will primarily consist of navigating different environments armed with just the doctors trusty sonic screwdriver, if you havent seen the show think of this as a computer hacking swiss army knife, which you will use to solve different puzzles. With this being a very narrative driven experience the navigation is very much walk from point A to Point B solve puzzle and then rinse and repeat.\nThe puzzles themselves are pretty standard VR puzzle affair with most being observation based requiring you to look and interact with the environment around you to identify a password or specific pattern required but there are also some logic puzzles that are more taxing on the old noodle.\nSo being a Doctor Who fan, overall I really enjoyed this and felt it was a brilliant homage to the show that had great fan service, allowing me to experience the classic \"its bigger on the inside\" moment with the Tardis, use the sonic \"Deus Ex Machina\" screwdriver and to come face to face with some iconic creatures from the series as well.\nBut taking a step back and forgetting my personal love for Doctor Who I would say this is a well produced title that offers up some fun and engaging puzzle solving set amongst some fantastical locations with an interesting, if not convoluted, story that comes together to offer up a great excuse to get you away from the real world for a few hours.\n\nHelpful | 338\nDeveloper ResponseJan 29 at 4:56 AM\n\nThanks for the review ! It's a great overview of the game and really helpful for players wanting to try this.", "lj.vancuranJun 15 at 6:45 PM\nLaxkslacka\n\nJust to short.. everything else was really good\n\nHelpful | 2", "Atsalama91May 17 at 8:58 AM\nGreat concept, bad execution\n\nIf you love Doctor Who than you will probably find this game is worth the price. As it is the game is very rough looking. Normally I can be okay with that but the movement and interaction systems just feel clunky. Light from the flashlight is inconsistent at best and the screen turning black if Im too close to an in-game object just looking around can be quite annoying. If they optimized this game like Red Matter and just charged a bit more I think this could have been a really great experience. So if you love Doctor Who you can shamelessly pick this up, otherwise I wouldnt. The Developers have released a few updates with patches and fixes, will update after playing again.\n\nHelpful | 2", "dinder.9083Jun 29 at 4:19 PM\nFan of the Doctor not glitches\n\nI keep hitting tech roadblocks in each environment. Objects I need to pick up but cant, buttons I need to press but can't. And the app sometimes quits.\n\nHelpful | 1", "Bakerboi232May 30 at 1:52 AM\nShort but fun\n\nIt gives you a bit of horror while making your mind think the surrounding are dull but still cool to look at when it's late at night and need a spook\n\nHelpful | 0", "StephenGdBakerJul 18 at 9:46 AM\nGarbage\n\nThe controls are so bad it kills any chance of enjoying it\n\nHelpful | 0", "savvitoMar 6 at 1:33 PM\nInteresting game but filled with bugs\n\nFirst of all I want to say I had no experience with doctor who before so this games was an introduction to a new world ! 2nd this games is a bit of everything and nothing in particular so I could say its a nice narrative interactive story ! Only issue is that it has quite a few bugs that make the game annoying ! It even crashed Once close to the end and I had to start the whole game from the beginning and this makes the whole experience quite bad\n\nHelpful | 10\nDeveloper ResponseMar 6 at 2:15 PM\n\nAre you playing the latest version. Please give it an update, as we think many bugs are now fixed. Patch 3 also includes a fidelity update.", "UKThunderApr 25 at 9:56 AM\nFull of bugs\n\nI bought this game on the day of release, it was full of bugs, wouldnt play properly, so I gave up.\n\nNow a couple of months later, I have just tried it again. And I love it! Looks like theyve all fixed the issues it had.\n\nIts a fun sci-fi Dr Who puzzle game I havent got very far yet but wanted to update my review. Highly recommend this game now.\n\n****\n\nHelpful | 1", "r_FalksonApr 23 at 5:59 PM\nGreat but...\n\nAmazing game! I definitely recommend this game and even more for Doctor Who fans. The only thing I didnt like was that the ending was slightly anticlimactic and that the doctor or whoever was talking would constantly repeat themselves after you didnt pass something after a certain amount of time. Besides this, the game was great and I highly recommend it.\n\nHelpful | 0", "mcbobster600Apr 10 at 11:50 AM\nTBH I nearly crapped myself\n\nThis game is amazing! Theyve done a really good job at representing the doctor who franchise. And to be honest in the weeping angels level I nearly crapped my pants, the weeping angels are the scariest things ever for me! And theyve just done amazingly at putting them into this game\n\nHelpful | 7", "Gonz-eApr 5 at 11:04 AM\nGood story, bad game.\n\nThis is just from the point of view of game play. Not a good game if what you want is to play. I did like the story and graphics, and thats all this game is.\nI wish it had more brain games and action play.\n\nHelpful | 2", "Auckey702Apr 8 at 12:45 PM\nGreat but....\n\nThis game is fantastic. It is scary when it needs to be and is super immersive. However due to the graphical limitations of the quest it ruins that immersion in certain parts. The other thing is that the puzzles are nonspecific to doctor who and super easy. Other than that this game is great.\n\nHelpful | 1", "MaximumHeadroomFeb 27 at 1:18 PM\nThey're fixing the bugs\n\nI'm not a huge Dr Who fan. This was a fun game. It was short. The puzzles are decent, but certainly not \"I expect you to die\" or \"Red Matter\" level. The graphics are very good. They released an update yesterday that fixed some bugs which is why I'm giving this 4 stars instead of 3. The annoying bug of walking into complete darkness off the game area is resolved!\n\n5 stars if it was longer and puzzles were harder. I can tell they went into a lot of effort for authentic Dr Who experience, story and characters. Real Dr Who fans will appreciate that.\n\nHelpful | 6\nDeveloper ResponseMar 6 at 2:23 PM\n\nWe've just launched a major patch. Hopefully a big step forward.", "italktorobots10 days ago\nI gave up\n\nI didnt get passed the first puzzle in the tardis at the start. Super easy puzzle but I couldnt ever turn the knob I was trying to turn. Even when a knob is highlighted, that doesnt always mean you can turn it. Unbelievably frustrating when you know how to solve a puzzle but due to wonky controls cant get it done. This was a waste of $20. Side note: the Daleks have created antigravity crafts and can easily explore the universe, so for the love of God why havent they figured out how to generate a less monotone, irritating voice for themselves?\n\nHelpful | 0", "ssoRgniKApr 29 at 12:24 AM\nDoctor whom?\n\nEh. The other review basically cover it. The story is okay and the gameplay is extremely linear, during my play through i had a couple of bugs here and there but i never had to restart the game.\nThis game is like being inside a two parter episode of dr who where the show stops while the doctor tells you what to do and then tells you how she could do it better.\nFood for thought; what if the player assumed the role of a character such as Clara Oswald someone who experienced many of the doctors forms and helped him (only around while the doctor was a dude) to escape multiple adventures. Would leave room for more content.\nMaybe i was expecting more from the bbc but the VR seems as low budget as the SFX on the show, can look past it on tv but when its literally IN your face its very obvious.\nThis aint no red matter.\n\nHelpful | 0", "Ghost_VFXJan 27 at 1:38 PM\nDisappointingly buggy\n\nAs a Doctor Who fan this pains me to write but I fully agree with a lot of the other critical reviews pointing out the poor quality of graphics and overall bugginess of the gameplay. The story is solid and I hope there will be a patch in the near future to address these painfully obvious issues.\n\nHelpful | 23\nDeveloper ResponseMar 6 at 2:58 PM\n\nWeve just updated the Doctor Who - Edge Of Time Quest game today with a special patch that enhances visual fidelity across the game as well as a number of specific bugs. These include: Update 3  25+ visual fixes and improvements  Improved TARDIS portal effect & interior  2X AA using maximum foveated rendering", "Metaverse-AdventuresApr 1 at 6:47 PM\nBroken Game *Refund Requsted*\n\nUPDATE March 2020 Playthrough was much better with issues addressed so I upgraded my score to 4/5.\n\nOriginal Review 3/5:\nI want to love this game and was looking forward to spending my evening playing through it, but it is simply unplayable due to glitches and sloppy QA.\n\nLike others I had a hard time opening the door to the Laundromats office but eventually realized that to grab the knob you need to grab about a foot in front of your hand. Weird and why??? That seemed like an odd bug right out of the gate that should have been caught in QA.\n\nThen when I had to punch numbers into a safe number pad there was no way to point your finger. Rather you open hand push in the generally area and it would automatically press the right one for you. I have never seen this in VR as all other number pad puzzles you can point your finger and press an individual button. This made me raise my eyebrow.\n\nThe straw that broke the camels back was trying to get out the back door of the laundromats office as every time I approached it, the screen went black as if I was clipping through a wall and it would reset my position back into the room. I would approach the door again and it would repeat. I verified I was not at the edge of my guardian etc. yet no matter what I could not get near the door. If I stretched out my arm I could just see the lock on the door glow and the tumblers inside light up, but any attempt to turn the tumblers resulted in my view going black and again resetting as I was on the edge of the invisible broken boundary. I am not sure why this happened to me as it sounds like other got past this point, but I was unable too and had to give up.\n\nThis all happened in the first 15 mins. In summary it is the most broken experience on the Quest to date and this includes some pretty sketchy side loaded apps too. How this game got through Oculus QA is rather concerning. What happened Oculus?\n\nI will request a refund. Maybe one day it will be fixed and I can try again.\n\nHelpful | 0", "the_doct0rJan 23 at 1:18 PM\nWhat are they thinking?\n\nThis is a terrible terrible port to the quest. The graphics are comparable to the oculus go or Google cardboard at some time. The quest can do things like red matter and we are getting this.\nDo not buy it if you only have the quest! Believe me, iam a big doctor who fan and I can't stand the graphics, immersion killer. Besides that, you can only grab a few things in the room which is also poor. It gets worth when you run into objects and your screen turns black.\nOh yes, aaaand I glitches through the TARDIS in the tutorial.\n\nMaybe it's better with the link cable, have to try it.\nIf it's not better I have to give it back, yes that bad.\nIt's a shame :(\n\nHelpful | 138\nDeveloper ResponseMay 13 at 5:09 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "volureApr 4 at 2:32 PM\nDisappointing\n\nWith so much to draw on in the world of Dr who, This game was completely lame. Jodie Whittaker kind of ruined dr who for both my wife and I, hopefully they can renew the series when the next dr comes out. The fact that the basically hand hold you through this severely limited game and there isnt very much content. Extremely disgruntled in the price. $20 for barely $5 worth of content.... Total waste of money. BBC is grasping at straws to try to keep the franchise alive since they signed such a terrible dr this go round.\n\nHelpful | 4", "lilthMay 5 at 8:54 AM\nGood game for doctor who fans\n\nGood story line got stuck on the weeping angel level because I got so scared I had to keep taking the headset off. Would recommend for doctor who fans, less fun for non doctor who fans. Wish there where a few more classic villains tho\n\nHelpful | 1", "ben.alfrejdMar 26 at 2:18 PM\nPoor graphics\n\nThe poor graphics are a huge letdown.\nThe puzzles range from stumble until you get it, up to so obscure it takes a dozen failed attempts before you know what you are trying to do.\nThere is a ridiculous amount of handholding narration, that slows the gameplay to a crawl\nI just cannot recommend this game.\n\nHelpful | 3", "wutzhisnameonguitarMay 8 at 7:29 AM\n\nPretty amazing! The levels are great..unsettling and creepy at times\n\nHelpful | 0", "sonicdash120May 10 at 3:40 PM\n\nYes the Doctor is annoying but is still a lot of fun\n\nHelpful | 0", "steve.fuller.716197 days ago\nPoor game with poor puzzles,dont buy\n\nI have been looking forward to this game for weeks and now i have it installed i wish i hadnt bothered,poor controls poor gfx annoying voice,ive been stuck in the cave with the elecrical plugs for days,the four diagrams on wall are for positions for 4 or 5 coloured plugs but there are 6 plugs,doesnt make sence,after guessing im now inside a ship with lasers,must have spent an hour or two messing about with mirrors,ive just given up on it,boring boring game,last game i will buy for a long time,dont bother installing it,you will regret it!,i am now sick of this game and the unintelligent puzzles,worst game i have played on the quest,i would like to uninstall it to make space for a decent game,how do you do that\n\nHelpful | 4", "NuclearMineKidMar 17 at 10:13 AM\nOk game but...\n\nThis is a great game and the story is ok but the game around feels rushed like the just tried to get out a game as soon as possible. I really feel that if they had spent more time on it it could be really improved. Unless you are a doctor who fan it could be hard to appreciate this game\n\nHelpful | 1", "mjg298Jan 23 at 1:42 PM\nGlitchy and unpolished\n\nGame has a lot of positives but the glitchiness suggest it just wasn't quite ready to launch. It has similar problems that were in Vader immortal regarding fading to black when you are no where near a collider - sometimes it's an object you have to grab but it's still out of reach when the screen fades and bounces you back into the centre of a room. Also when trying to solve a puzzle you get the same 'helpful' phrase repeated over and over again in quick succession - this really gets annoying if you know how to solve the puzzle but it's a problem with the controls that just won't let you complete the task! The game could have been so much better if only they'd resolved the basics before release\n\nHelpful | 41\nDeveloper ResponseMay 13 at 5:10 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "minercraftmmMar 27 at 4:53 AM\nok I guess but theworst game Ive bought\n\nSo i the 1st glitch I found in the game was the TARDIS console it took me 6 trys to get the 1st crystal to pop up 2nd I wasn't impressed with the texture quality bloody vr chat has better graphics than this and it's free and the game wasn't very long other than that I liked the idea of the game\n\nHelpful | 2", "RemiFusadeApr 9 at 9:05 AM\nReally disappointed\n\nI was expecting sooo much more from a Dr. Who game in VR!\nInstead, I got a somehow cheap and uninspired experience.\nPuzzles are not very original and the story is below any episode of the Dr. Who series.\nThere are a few good ideas but they are either underexploited (Tardis driving) or repeated ad nauseam (weeping angels).\nAlso I managed to fall through the ground in a spaceship and into space. It was not a pleasant experience.\n\nHelpful | 1", "MarkStirtonAberdeenJan 24 at 5:12 AM\nEnjoyable\n\nTook me a while to find the teleport option, button A right hand, but once I did I found the game much more enjoyable since the stick movement was making me feel very sick indeed. Sound mix is all over the place and some of the mechanics are a bit frustrating but nothing that can't be patched. Happy to support this one.\n\nHelpful | 12\nDeveloper ResponseFeb 12 at 5:24 AM\n\nThanks for the review. We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "sputukFeb 27 at 5:11 PM\nScary - good, but scary\n\nI think Im a wimp but by chapter 4, this game had me wanting to hide behind the sofa, just like I did watching doctor who 40 odd years ago.\n\nNothing actually bad has happened, but there are lots of spooky moments - and the weeping angels just freak me out any time.\n\nIts great! :)\n\nHelpful | 8\nDeveloper ResponseMar 6 at 2:22 PM\n\nDon't worry, we hated those pesky Weeping Angels too!", "shawthingsApr 14 at 3:27 AM\nReasonable\n\nPretty good story and puzzles. Too much exposition. A few bugs. Movement could be better.\n\nHelpful | 0", "EnerisMar 7 at 11:23 AM\nReally bad game experience\n\nEven after two major patches which devs are mentioning in the responses, still really bad experience.\nOculus is capable of so much more than super low resolution graphics where you can see blurred out pixes even from opposite side of the room.\n\nI've noticed that resolution gets better when you actually try to approach them (like writing on the wall), but the game won't let you! Player is immediately thrown back.\nControls look like really bad port from Oculus Go, where you have only one controller with 2 buttons or so.\n\nDoctors hints are triggered by approaching certain places or touching already limited amount of intractable things, so it's really annoying when just walking around looking for clues. Plus! in the second room, when you have to enter the numbers you've just found, there is no interaction with the luck! You just slap the thing and it enters it self! Really?!?\n\nAll the doors feel like they are made of air and physics overall is a massive joke! Can't you just use Unreal engine?\n\nAt the end, I had to just stop playing because as a big fan of doctor who, I was getting really sad from the game after 10 minutes of playing.\n\nReturning this excuse for a game at earliest convince :(\n\nHelpful | 6\nDeveloper ResponseMay 13 at 5:37 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "julian.ginesMar 1 at 1:02 AM\nI was excited, but then was let down.\n\nI was super excited seeing not only a Doctor Who game being released (with THIRTEEN!!), but also because I was able to play a brand new game.\n\nBoy....when I booted it up, I was pumped.....then it took 5 minutes for the first interaction to happen. Then, I tried opening a door. Doing a simple thing as opening a door. Let's just say....it was next to impossible. Then, through luck, I was able to open it. When I entered the next room, the door shut behind me. Ok....except the final piece of the puzzle was on the other side of the door.....that I couldn't open.\n\nOk...reboot it is. Made it past that part. The TARDIS appeared. Yes! Awesome!! My dream was finally realized.....until I opened the doors. I must have walked too far past a border that I didn't know existed, and the moment was ruined.\n\nHelpful | 0\nDeveloper ResponseMar 6 at 2:20 PM\n\nNew patch launched today with visual improvements and fixes. We'd love you to try it again and update your review.", "LanzaroteDazzlerApr 12 at 10:30 AM\nI want more please\n\nHad a great time playing this feels like I was in the episode its self.\n\nWould like to see more\n\nThink you have to be a dr who fan to appreciate the game not the best game ever but you feel a part of it and thats all I wanted\n\nKeep the work up guys\n\nHelpful | 1", "RauelRualbeMar 5 at 2:12 AM\nNot bad\n\nAt the start of the game I thought it was going to be disappointing but it got better and better. So it gives you time to get into the game. The size is on the smaller side of reasonable but it's a good sizing for the initial playthrough and I found the gameplay quite engaging.\n\nHelpful | 2\nDeveloper ResponseMar 6 at 2:15 PM\n\nThanks for the review RauelRualbe!", "RytharrFeb 13 at 6:48 PM\nWas great until I entered the TARDIS\n\nThe controls in the TARDIS are nearly impossible to use. I had to rage quit after 20mins of failing to use the various switches. I pre-ordered rift and vive, have a huge br library and this is one machine f the most frustrating things I have experienced.\n\nHelpful | 3\nDeveloper ResponseFeb 18 at 2:23 AM\n\nHi Rytharr, So Sorry to hear you found the Tardis controls difficult to use. We are continuing to launch a number of patches to fix some of the key issues found by players over the coming weeks. We'd love for you to continue playing and hope we can fix any frustrations you have.", "MultiversingJan 23 at 10:53 AM\nAwesome game, massive replay potential\n\nAwesome game, massive replay potential, no previous knowledge of the TV show required.\n\nThis is my most played game on PSVR so I couldnt wait for this to come to the Quest and it has lost nothing in translation.\n\nIf you are a fan of Red Matter or Star Trek bridge crew then you will love this.\n\nPuzzles good, but not too hard, storyline really involving and very Dr Who, immersiveness totally off the scale.\n\nSeeing the tardis materialise in front of me was awesome, loved being able to walk round the tardis console room, and the bit with the weeping angels truly terrifying.\n\nThanks to people involved for bringing this to us. Youve made a fanboy very happy.\n\nHelpful | 29\nDeveloper ResponseJan 29 at 4:55 AM\n\nThanks so much for the review. Glad you're loving this game", "fedankleJan 23 at 9:57 PM\nDoctor who fans will love it\n\nIf you've never watched the show before then you should absolutely watch season 3 episode 10 before you play. You will enjoy (fear) it so much more, and you'll get a sense of what the show is like... Great game, could use some smoothing out still, and the graphics do take a hit on the quest version, as to be expected, but a big difference is noticeable. Unfortunately for many developers red matter has set the bar very high on what the quest is capable of. Do not let that stop you from getting this game though!! It's a story driven game, probably the best one on the quest in my opinion. I hope developers still tweak a few things though, but I'm ready for some dlc or a sequel! I would mention the story... But spoilers ;)\n\nHelpful | 6", "theJAZzGeFeb 23 at 3:22 AM\nGood for Fans, but overall not worth it\n\nAs a big Doctor Who fan I enjoyed it, but from the perspective of someone who isnt into doctor who, the game doesnt really have much to offer.\nIt is very straight forward and just puzzle based, but there is very few things to actually interact with and it felt very clunky when playing. Also the thing with your hands disappearing was very annoying and made the first time flying the Tardis rather frustrating.\n\nEven if you are a big fan the game is a little big disappointing and if your not a fan I dont think it will be that enjoyable.\n\nHelpful | 0", "brynleycharleshillMar 28 at 5:57 AM\n\"Oh brilliant!\"\n\nThe first words from the 13th doctor. You are really taken for a true Who adventure from start to finish. And having the opening titles really makes you feel like you're in an episode from a first person perspective. You get to use the sonic screwdriver and fly the TARDIS but most importantly, YOU get to save the world!\n\nHelpful | 0", "Hotshot80sMar 7 at 5:43 AM\nBuggy on Quest\n\nI initially played this on PCVR and couldn't beleive how broken and graphically inferior to the PCVR version. Please don't buy this unless you have a PCVR setup as your wasting your money. Can't believe Oculus let this through.\n\nHelpful | 2", "Josh_BroMar 6 at 11:23 AM\nwoah\n\nthis game is very shockingly good and doesn't deserve all of the hate its gotten, the gameplay is awesome, the horror is true to its word and the puzzles were sweet. hope this puts a smile on BBCs face because they deserve it.\n\nHelpful | 5\nDeveloper ResponseMar 6 at 2:12 PM\n\nThanks ItsGreifer998 - that's great to read", "Brenthas1Feb 17 at 3:05 AM\nEnjoyable, but flawed\n\nUnfortunately my experience with this game was very glitchy and the textures/graphics left a lot to be desired. Several times I had to turn the game off and back on to make a sequence of events happen. When it did work the story and puzzles where moderately fun, and a few of the scares made me jump. I also noticed that the first and third chapter looked noticeably better than other chapters, perhaps because of the quests limitations? Would love to see a patch. I would gladly add a star or two.\n\nHelpful | 2\nDeveloper ResponseMar 6 at 2:27 PM\n\nHi Brenthas1, Thanks for your feedback, weve just launched a 3rd patch which should rectify many of the reported bugs. Could you give it another try and let us know what you think?", "VRvinbeanselMar 9 at 1:48 PM\nGood experience ! *Needs a patch\n\nUpdate * the patched game works better and worth 5 stars now due to being a interesting journey and feel especially as it's priced well\n\n\nEDIT* Upon reinstalling I've not had as many bugs\nat all only one time did I have to simply reload checkpoint. The game has got better and creepier! The London level with the Angel statues freaked me out!!! so I've increased my score due to being overall a enjoyable experience once i got past the few issues\n\nThought I'd give this a try not too high priced and controls and looks are decent and above par for the Quest BUT after getting through the first part in the laundry shop you get a key of some sorts to a door well instead of using that I simply seemed to jump out of the room into a outside area where I can do nothing and then I FELL THROUGH THE FLOOR constantly falling untill I tuned it off !\nSeriously how could this be released like this everyone having lots of issues found my first problem within 10 minutes. Will most likely refund unless there is a update when I check it again over next couple of days. What a shame\n\nHope to see some developers responses soon please\n\nHelpful | 2", "r2row23Mar 8 at 11:07 AM\nVery good but a bit short\n\nI love doctor who so I was exited to get this game\nIt was fun and I got scared during the weeping angle part but I just didnt like how short it was.\n\nHelpful | 2", "beauregardenerMar 22 at 12:32 PM\nDisappointed in Tardis\n\nSad design, lack of amenities Simon Says controls.\n\nHelpful | 2", "HardcoreHarlowJan 23 at 12:43 PM\nNice Environment, Glitches\n\nOverall nice environment and sound. I just took off my headset in frustration as I was stuck on the second puzzle inside the TARDIS, despite the game telling me exactly what to do, 30 tries later I gave up. Like, I dont get it. There are some glitches like going through walls (required quit relaunch as I could no longer open a door required to end the level) and hand twist tracking is...finicky, which is a shame as every TARDIS control so far has been a twister. Object selection can also experience lag, or its especially inaccurate in close proximity to anther selectable.\n\nGame was released two hours ago on Quest. I wouldnt trust reviews older than that as some seem to be recounting the game from other consoles.\n\nI hope the devs can put a little more polish on the technical stuff. Seems like itll be a nice story. The intro environment had my anxiety up which was cool, immersive if you will.\n\nHelpful | 11\nDeveloper ResponseJan 29 at 4:53 AM\n\nHi HardcoreHarlow. We need to get you back in and enjoying the game. The TARDIS game bug you're reporting is actually a gameplay issue, with players not seeing the handle prompt at the end of the sequence. Here's a tip on solving this: TARDIS Control Game - players follow a 'Simon Says' style game to pilot the Tardis. Follow the exact sequence of highlighted clues, 'after' the full sequence has played. The last sequence includes a large handle to the right which some players are not spotting.", "eatibananaFeb 29 at 6:57 AM\nLots of fun... for another device\n\nIts a really fun game the only problem are the glitches... they have patched it...but what i really hope i that they will be able to make it look just a bit better like on the other vr systems... but all of that aside forna doctor who fan its a must get\n\nHelpful | 0\nDeveloper ResponseMar 6 at 2:21 PM\n\nBy your command - we launched a new Graphics Update today. Given your review, we'd love you to see what we've done: Update 3 Includes:  25+ visual fixes and improvements  Improved TARDIS portal effect & interior  2X AA using maximum foveated rendering", "christinamarybrownMar 25 at 10:58 PM\nHad to update 1 last time 5 stars!\n\nI am probably 3 quarters thru the game got my 2nd time crystal. This is just stellar! I am a huge fan of the show, and you guys did so amazing. So scary, and great graphics. I just love it. Thanks so much for keeping me so entertained during the Apocalypse.. LOL\n\nHelpful | 1", "MagicJayStylesFeb 9 at 2:39 AM\nFun during, disappointing once completed\n\nI really enjoyed this experience until I completed it (which took less than a couple of hours). But then when it was completed, felt a bit hard done by as I dont really think its something Im likely to play a second time. So much of the enjoyment of playing is the constant threat of danger.... once youve completed it, you know where the very few actual dangers are and the puzzles are hardly a challenge the first time round so they would just be tedious the second time round.\n\nWith that in mind.... if youre looking to be entertained for about 2 hours then its a judgment call as to whether you should buy this or go to the cinema for less cash\n\nHelpful | 2", "khm2008Feb 5 at 12:39 PM\nSo so game\n\nSo so disappointed by this game bought it the day it came out as I love Doctor Who, but waited till this weekend so I could fully enjoy it when I had time to actually play \n\nLoad up the game into a low Res room where I can interact with 5 items the phone, door and photo ALL part of the game paly and a whole 2 other objects witch is the same basket twice (also phone answered it's self 2 seconds into the world guessing that shouldn't have happened)\n\nThe next room has nothing of interest that you can interact with there is even a half built model T.A.R.D.I.S on the desk that I can't pick up like WTF the safe is a joke hey there is a grand total of 2 possible answers based on the info you have and you can't even pick one just move hand near save and it enters the correct numbers wouldn't even be surprised if I didn't need to find the actual numbers before I could do this\n\nAnd the best part is the random \"black zones\" where you are just thrown into pitch black like at the back door of the first area stand in front of it and blackness teleport won't let you move these areas but you can just walk into it (with left thumb stick) same happens outside that door where the T.A.R.D.I.S will land if you walk into that area before you even call it blackness\n\nThen I get what should be a huge part of the game for any fans of the series YOU get to open the doors and experience what we have watched so many times \"It's it's it's bigger on the inside\" and I got a stupid orange spinner in more darkness for 5+ mins and then I see what I am guessing is ment to be Jodie but looks closer to an extra from the original Planet of the apes film\n\nSo now here I am trying to decide to I refund the game knowing so many people will and BBC aren't going to invest any money in giving us a REAL Doctor Who VR game or eat the loss and hope a huge number of the fan base do the same so the game doesn't flop and maybe just maybe we will get an actual game second time round.\n\nUPDATE:\n\nOk going to give the game an extra star still has a lot of issues but the puzzles can be fun to solve, the laser puzzle alone gets you the extra star really enjoyed that one. The book puzzle on the weeping angels level was really well designed I just messed it up for myself by instantly burning the first thing I could interact with and then brute forcing it before Emma could tell me what I should have been doing but still appreciate the effort put into it.\n\nHelpful | 6\nDeveloper ResponseFeb 27 at 4:02 AM\n\nHi khm2008 - Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "teddelerFeb 16 at 11:49 AM\nNice atmospheric puzzle game.\n\nI want to love this game. To be fair, I am enjoying it, but not in the immersive, non-interrupted way a VR game should be enjoyed.\n\nOn the plus side:\nI do love the environments and I think the graphics are great (apparently I'm not as picky as others).\nThe premise seems good. I haven't gotten very far yet but taking the part of someone who has no idea what's going on works well.\nI loved the 'intro credits' with the time-vortex flight. A fun nod to the fact that yes, this is based on a TV show.\n\nGlitches/control issues:\nWhen I tried walking into the TARDIS the first time (which should be magical) it glitched and I had to restart the game. It worked, sort of, the second time I did it but not smoothly (the image kind of blanked and stuttered).\nTrying to get the 'hands' to work the controls properly was tricky. The control movement just didn't want to follow my hand movement. But I got it working eventually, felt like more by luck than anything.\n\nImmersion-breaking issues:\nFelt like there were too many things scattered around that you should be able to pick up but can't. On the plus side that means you know anything you can't manipulate has nothing to do with what you're trying to do but it does break the immersion and make it feel less real.\nBackground music. My life doesn't have a soundtrack. Having music suddenly start up while wandering around a dark forest just seems odd.\n\nEdited to add: Bumping my score up to four stars. Thanks for fixing a few of the issues and I understand some of the immersion-breaking issues are due to compromises to get it to work on the Quest. Thanks for getting it to work at all, it's been awesome. Just got out of the Victorian basement and for the first time in my life I am royally ticked at Steven Moffatt for creating the Weeping Angels. :P\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:46 AM\n\nHi Teddeler, Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "xan_draJan 31 at 7:53 PM\nRushed and not ready?\n\nIt is, for me, unplayable and in my opinion, you will lose hours just trying to get something broken to work. Playing this game right now is literally the equivalent of pushing the buttons harder on the remote but the problem is dying batteries.\n\nIt has so much potential and I cant wait to be able to update this review.\n\n\n***Update: ***I appreciate the dev response and I decided Im going to keep the game regardless. Ive also updated my stars.\n\nI went back in to try a bit and realized part of why some of the mechanic glitches or screen blackouts feel so frustrating is because the game is truly immersive and heart pumping. I feel like Im in a hurry and against a clock Im not sure if is even there at times. Every bump and shadow has me jumping and looking out from under my headset to make sure there isnt a weeping angel waiting for me on the other side. Even though I havent gotten far yet- Im excited and terrified for what Ill encounter and, at the end of the day- thats what its all about.\n\nHelpful | 11\nDeveloper ResponseFeb 27 at 4:04 AM\n\nThanks Xan_dra - Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "FulhairFeb 20 at 1:53 PM\nSeriously Nauseating\n\nOnly played for 20 minutes so far but had the worst nausea feeling for an hour after playing. Would say I'm on the more sensitive side for vision/motion mismatching but no other quest (or any vr) game has made me feel as bad as this one. Also the little game play was frustrating as the doctor continously parroted the same help and the hand grasping was so vague as to be annoying. I'm a doctor who fan but not of this game.\n\nHelpful | 3\nDeveloper ResponseFeb 27 at 3:40 AM\n\nSorry to hear this review. It might be helpful to try the teleport function with is the A button for motion sickness. Regarding your comment about the Doctor's instructions, it's difficult to get the balance right. We also have feedback from some people saying they want more guidance. Weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes", "strife711Apr 28 at 8:34 PM\nFun\n\nI like it some don't as I can see. But ioce.doctor who and this game is fun\n\nHelpful | 0", "Noir_MortFeb 12 at 4:50 PM\nA whovians dream\n\nLike this game a lot , it has a really good atmosphere and feel to it. The energy to this game really gives of the vibe that you are on a mission for the doctor and as a massive fan it really hits all those whovian dreams. I love playing it and would give it a thumbs up to anyone who wants a game to get them started on vr. Having the experience to walk into the Travis and use the sonic screwdriver is absolutely incredible. The design and layout of the game really feels out of this world !!\n\nThe Only down side is I could not play it for more than about 20 -40 mins tops at a time as I am quite prone to travel sickness and the smooth walking motion of this game really sets it off and is a bit disorienting.\n\nSo if you have travel sickness I would not recommend, however if you are fine with it I wouldnt hesitate to give it a try.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:53 AM\n\nHi Noir_Mort - love the review. Maybe worth trying the teleport function using A button.", "Martin701Mar 11 at 4:06 AM\nDoktor who\n\nNice game, puzzels are not to difficult and sometimes to easy ! Graphics sometimes lack detail, but had a nice time playing it.\n\nHelpful | 1", "thanatos38Jan 27 at 4:51 AM\nGeronimo !!\n\nI was so waiting for this game...\nScrewdriver in the pocket, speaking with Dr Who, fight against the angels :)\nThe game is pretty cool, but few things:\n- During the enigma, you don't let the time to search by yourself, you have after 20 sec the tips from the voice. And it's repeated every 20 secs !! Could you please remove that, it's disturbing.\n- If I'm walking too close of the wall or anything else, the screen is black. The \"black screen\" limit is too close\n- A french traduction... Yes I know... Work your english... blabla But the game must be immersive, and I have too read the subtitle !\n- The graphic... It's not so pretty, isn't it ?\n\nThanks for the game\n\nHelpful | 2\nDeveloper ResponseFeb 27 at 4:12 AM\n\nThanks for the feedback, this is all very useful and will help us to continually improve and update the game. UPDATE: Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "dagvrJan 24 at 1:51 PM\nGlitchy\n\nI really wanted to love this game but for now it seems really glitchy. I hope they can fix the bugs soon.\nSometimes I cant teleport, so I have to press teleport twice - the second time suddenly works. I got used to double tapping to teleport. The 2nd part of the first level was exceptionally glitchy - suddenly I was teleported outside of the tardis and I had difficulties entering her as well.\nYou dont grip where your hands are but what is marked and you have to kind of aim at what you want to interact with but without a Pinter or anything. I got locked in the 2nd room in the first level and had to restart the game to get further, because I could not reopen the door.\nThe graphics are in between awesome and bad. Texture quality is all over the place.\nAnd the doctor is annoying if she is repeating herself over and over again. If the player seems to be stuck, dont repeat yourself. Offer some advice or at least dont distract from solving the puzzles.\n\nPlease give the game some polish. If you fix the controls, it could probably be a great game.\n\nHelpful | 6\nDeveloper ResponseFeb 12 at 5:36 AM\n\nThanks for the review. We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "Knight1000Feb 3 at 11:30 AM\nGood, but needs a TARDIS add on!\n\nWith the caveat that Im a huge Doctor Who fan, let me say I really enjoyed this game. As a fan (and possibly even if youve not), the thrill of taking part in a Who story and walking into the TARDIS for the first time is fantastic.\n\nWithout spoiling things, there are also moments that are surprisingly creepy and I jumped at one point.\n\nThat said, at the time of writing, its not without the odd bug, including a black/loading screen if you get too close to a wall. It didnt prevent me from completing it, though.\n\nIts a shame that once the game ends there is no option to go back into the console room and play with the controls, activate flight, etc, without replaying the chapters. The new series console room has been painstakingly recreated and its seems a missed opportunity not to make it available just for a bit of fun.\n\nHelpful | 3\nDeveloper ResponseFeb 5 at 9:17 AM\n\nGreat review, thanks for taking the time to write this", "jobbie1kinobiJan 25 at 12:21 AM\nI hope its not finished\n\nThis game is genuinely the reason I bought the Quest, as soon as I saw the first trailer I bought a Quest and have been patiently waiting ever since. And dont get me wrong, the game is great and has the potential to be amazing, but it feels unfinished. There are too many annoying bugs, all of which have been mentioned by others and all of which are real and spoil the experience. I really hope the Devs are listening and address these as you have the making of a killer game here, everything is in place, it just needs fixed. The black screen when you get too close to a wall is awful, the TARDIS controls are frustrating, the hints come too soon and are too repetitive, there should be an option to disable them or reduce their frequency like in Fishermans Tale, the volume levels arent quite right, the vocals are difficult to hear in places and when I first stepped into the TARDIS, what should have been a magical moment, something Ive wanted to experience since I was a kid was ruined by me instantly falling through the side of the door back into the scrapyard and watching as it sort of glitched and melted around me, froze then eventually brought me back in. When inside the TARDIS if you wander round in room scale you can see behind the set and its unfinished. As much as I have waited for this I dont feel like it was ready for release yet. Look at Red Matter and thats the standard that can be delivered on the Quest and what is expected. There are also some pretty serious scaling issues, ironically the inside of the TARDIS feels too small, like you are on a 3/4 scale model, it should feel huge, the sonic screwdriver feels tiny in your hand and the belt and hand dont feel like they are part of you. It spoils the immersion a bit. So close, still great but needs a bit of polish to really be there. I hope the developers take this as constructive feedback and use it to finish off what could be a truly great, must have VR experience.\n\nHelpful | 5\nDeveloper ResponseFeb 11 at 10:58 AM\n\nThanks for leaving your review - we love to hear that people are coming to the Quest platform because of games like ours, but not that you're not fully satisfied. Rest assured we're working to patch some of the reported bugs and continue to support this title. UPDATE: We have just launched a rapid patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks. We'd love you to reconsider updating your review once you've dived back in.", "SkyAce3Feb 25 at 9:35 PM\nLacking a bit\n\nGenerally speaking, other games have set the bar pretty high and blown my mind unexpectedly. My hopes were high for Dr Who, but the gameplay and storyline fell a bit flat.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:33 AM\n\nThanks for the feedback SkyAce3 - Were committed to supporting this title and adding new features and improvements so hopefully we can entice you back in again soon.", "thomasstibyFeb 2 at 12:18 PM\nGood game but comfort rated wrong\n\n!!!spoilers!!!\n\nThe game, starts of comfortable then on the second level a weeping angel jumps out at you increasing your heart rate miles high changing the game from comfortable to intense so I think oculus or the company should rethink their comfort rating because of this known fact but all in all a great game with a brilliant story they should honestly make a sequel.\n\nHelpful | 3\nDeveloper ResponseFeb 27 at 4:03 AM\n\nHaha - I think the comfort rating tends to be more about Movement Systems than SCARE factor. We're sorry the Weeping Angels are so scary but that's out of our control.", "damc34Feb 6 at 4:39 PM\nGreat but crashes\n\nI'm working on getting the third time Crystal, so I'm not done with the game, but so far I have enjoyed it quite a bit. I thought I'd get a little motion sick but they did a good job with settings so I was able to avoid that horribleness. I got freaked out a couple times thanks to the music and creatures in the game. The puzzles were not too tricky for me... except for the one in chapter 2.\n\nMy only annoyance while playing is I have had 3 instances of the game shutting down and/or freezing. Luckily each time it happened my save file was ok.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 4:00 AM\n\nThanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "agitokazuJan 24 at 2:38 AM\nAs a Doctor Who Fan\n\nAs a fan of the show, I love all the Easter eggs, the length is 2-4 hours for $20 not bad at all, especially since it's crossbuy.\n\nThe puzzles are a bit of a headache but I need to be patient, it's not that they're tough it's just Jody keeps repeating the same phrase when I'm at a puzzle over and over again and I'm like ok I get it already lol.\n\nSo gameplay is great, the issue I have with the game is the Textures... They're just not visually appealing.. those N64 looking trees in the background were very Immersion killing for me :(.\n\nBut great game none the less.\n\nHopefully they update the Textures in the forest with a future patch.\n\nAnd I hope they come out with a sequel that also brings the 10, 11, 12 and 13 doctor together in a grand adventure\n\nHelpful | 7", "azvJan 25 at 3:59 AM\nDon't recommend even for the fans\n\nI'm a fan of Doctor Who, that's why I set 1 star. If it were a game from noname studio and not about Doctor, then it might be 3 starts, with a fair price 3 on a sale. What they did in the level with the Angels :( Instead of revealing their limitless horror potential (especially for VR), developers force you to repeat one simple action over... and over... and over again.\nSuch a disappointment.\n\nHelpful | 8\nDeveloper ResponseMay 13 at 5:15 AM\n\nHi Azv, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "HelloAlice2019Jan 24 at 1:48 PM\nBeautiful game, fun puzzles, but...\n\nI am not even a big Doctor Who fan, but so far loving this game. The game settings are very beautiful and immersive, the puzzles are fun and not too difficult, but... As some have mentioned the Quest version of Doctor Who is a bit buggy at this point (hopefully developers can fix some of the issues).\n\nE.g., It took me over a minute to open the laundromat door. I almost opened it, tried to get through the door, saw black screen, returned to re-opened it... but the Doctor's instructions for the office room I was trying to get into started up even though I was still trying to fully open the door. And I encountered quite a few black screen moments when stepping outside of the game borders. I had to step back and the game would resume.\n\nThe graphics are just as good as they are in Rift's Doctor Who in some parts and in others, not so much. I do have to mention that Rift version of Doctor Who is visually stunning in all scenes and is completely bug - free (at least in my experience). PS. Doctor Who is cross-buy, so Rift version included :)\n\nHelpful | 6\nDeveloper ResponseJan 29 at 4:33 AM\n\nThanks for the review. We're so pleased to hear that non Doctor Who fans are enjoying this title.", "XxARNTxXFeb 27 at 11:17 AM\nIts Doctor Who, with glitches\n\nIm a huge Doctor Who fan. And I do love the concept with the game; True Doctor Who enviroments, villans, characters. Love the narrative and the horror element. And I do love puzzles. But all that is lost (in time and space ;) ) when the controls are way off the chart. No logic in how to use a door knob. Or a switch, or a button. Its just dont responding to how it would do in a real world. Trying to turn a knob clockwise? Well, should be as intuitive as grab, hold, turn clockwise. Nope, it isnt. Its 5 minutes with Thai Chi movements and hopefully the knob actually turns. Most likely counter clockwise :)\nIf you are getting to close to an object (door, wall) everything goes black, and you might have to restart from previous savepoint to get back in the map.\nHope the dev-team can work out these glitches. Could easily give it 5 stars, but because its a puzzle game, the controls must be better or you loose all the settings for a great experience.\n\nUpdate: After the devs patched it, the game is all good for me. Now its a really good, immersive Doctor Who game \n\nHelpful | 3", "richie.broderick.7Jan 26 at 6:08 AM\nGreat game just a few bugs.\n\nSo where to start it is a great puzzle , action filled game with never ending fun but there are a few glitches the door in the laundrette took me ages to open because it wasnt working very well and also sometimes you can see through the walls. Also an annoying thing was most objects you walk into you get a black screen with a loading icon and can be annoying apart from them it was worth all the money for a 3 hour long puzzle thrill game. If you are a doctor who fan you will love this when flying the tardis. If you arent a fan of doctor who I would still check it out because its puzzles and fun it has. Ultimately a great game just with a few bugs!\n\nHelpful | 5\nDeveloper ResponseFeb 11 at 10:58 AM\n\nThanks for this balanced review Ritchie, we're glad you're enjoying this but also rest assured we are looking at some of the reported bugs and looking to fix these quickly. UPDATE: We have just launched a rapid patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks.", "ken.hutchJan 29 at 1:57 PM\nSomewhat of a miss\n\nThe story is not great. It does not feel like I am immersed in the Who universe. The black screen nonsense when you go out-of-bounds is a failure by the dev...come on guys.\n\nThe doctor and the program have voices that I found hard to tell apart. Doors do not open intuitively. There are stations on the Tardis controls that do nothing. The sound is mixed with background noise being too loud.\n\nI did like seeing Daleks and Angels. Opening the door of the Tardis not knowing what I would find was cool.\n\nThe game started well in the landuary setting and was immersive, but had very little to offer after that besides seeing Daleks, Angels, and stepping out of the Tardis.\n\nHelpful | 0\nDeveloper ResponseFeb 11 at 11:13 AM\n\nThanks for the feedback, this is all very useful and will help us to continually improve and update the game. We have just launched a rapid patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks. We'd love you to reconsider updating your review once you've dived back in.", "mgzsmanJul 11 at 2:02 PM\nPerfect\n\nPerfect, except of course not as good graphics as on PC but thats not the problem, the limitations on the graphics give it an amazing style.\n\nHelpful | 0", "Zenn69Jan 28 at 7:36 PM\nFeels like an unpolished gem\n\nDefinitely a Game for Doctor Who fans. Story was good, graphics where ok at best and just needs to be touched up and add better filters. Too many bugs such as clipping, glitchy controls and at one point I found my self outside the game area and had to restart to get back in. Please clean this tittle up in an update and Ill give it a 5 star for sure.\n\nHelpful | 1\nDeveloper ResponseMar 6 at 2:57 PM\n\nThanks for posting a review Zenn69 - hopefully now polished. Please give it a retry!", "paul.bunker.754Jan 30 at 9:07 AM\nDr who\n\nJust stared to play. Game freezes a lot. If you close the door behind youself you cant open it again and have to restart the game. Travel between room is awkward and finger pointing takes a little getting use to. Graphics good story very good and looking forward to seeing what's next.\n\nHelpful | 0\nDeveloper ResponseMar 6 at 2:55 PM\n\nHi Paul.Bunker.754 - please try the latest patch", "believer777Jan 24 at 6:16 AM\nGlitch fest\n\nI agree with the other frustrated gamers. Im a newbie to the Quest so I was saddened to experience what I experienced the first 15 minutes. The doorknob! The lock combo! The back door glitch! I eventually ended up in the land of polygons. It was dark and scary. Refund to be requested.\n\nHelpful | 8\nDeveloper ResponseMay 13 at 5:14 AM\n\nHi Believer777, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "CAD_BANEFeb 4 at 9:07 PM\nNot a bad game\n\nlike how they had the weeping angels, and the Daleks in the game, cool puzzle game, not a bad storyline, but pretty short, few glitches here and there but overall not bad, wish they had more characters or enemies in the game like the Ood, lady Cassandra, zygons, Sontarans, Davros, cybermen, or the silence, just beat the game 2/28/20\n\nHelpful | 5\nDeveloper ResponseFeb 5 at 9:17 AM\n\nThanks for the review CAD_BANE!", "gizmogladstoneJan 24 at 9:35 PM\nLike an episode of Dr Who, fighting bugs\n\n*4 Star Game for Dr. Who fans if bug-free\n*2 Star Game for current build status\n\n\nThe game needs The Doctor to swoop in, fire up a sonic screwdriver, and address a whole lotta bugginess infesting my Quest.\n\nIll spare you the errors Ive run into because others have gone to greater lengths to detail what I also encountered.\n\nIts a real downer for me because I see the potential, but crashes and sloppy world navigation has made me jump out of this TARDIS.\n\nThe game - in its current state - is really hard to recommend. Which saddens me. I am holding onto this in the hopes the devs get their virtual house in order.\n\nPlease.\nSoon.\nI want to play this!\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:27 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "Boss4711Jan 25 at 6:22 PM\nToo much glitch\n\nI was looking forward, very much so, to this game. I cant believe it took them all the extra time to port it to the Quest and then released it with the amount of glitches! Missing items, no sonic when you need it, get too close to a wall and all goes dark, etc. oh but the graphics are right up there with the PS2 (sarcasm). Was t quite worth the money, but at least it was only $20.\nOnce I realized I had to reboot because there were missing items glitch, puzzles were pretty easy.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 11:09 AM\n\nThanks for the feedback, this is all very useful and will help us to continually improve and update the game. UPDATE: We have just launched a rapid patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks. We'd love you to reconsider updating your review once you've dived back in.", "kbderingJul 7 at 5:07 AM\nSlightly scary\n\nJust finished the intro level and I gotta admit I took the VR off a couple times out of fear... And i'm not a teenager. Way more immersive than the tv show\n\nHelpful | 0", "pfrfJan 23 at 10:43 PM\nvery disappointing, broken, unplayable\n\nI don't know if there is a way to report buggy apps to oculus. I can't decide if I should ask for a refund, I've waited for months for The Edge of Time to come to the Quest. But this app is unplayable for me now.\n\nI can't get past the Tardis door no matter what I do, stuck halfway inside, halfway outside and the screen goes black. Prior to that scene I had to restart the game several times. I've redownloaded, reinstalled, rebooted but nothing helps. My Quest has no issues with any other apps, it is not remotely full, and has never been sideloaded.\n\nIs this something that will be fixed in the future? Or am I throwing my money away if I don't request a refund now? Why was this game released in such a broken state?\n\nHelpful | 21\nDeveloper ResponseMay 13 at 5:10 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "glenn.ratcliffe.961Jan 30 at 4:56 PM\n Good but not great.\n\nAs a Dr Who fan from the mid 70's, I've been anticipating this game for ages. The whole 'It's smaller on the outside than the inside' (not my quote, from a single episode years ago) thing.\n\nSo I'll start with the glitches.\nBlack screen: Sometimes when you get to close to walls, screen goes black and occationaly resets the level (especially when you go to explore the Tardis hallway).\nTardis door: Hard to reach?? Idk, distance is off? Also if they're not fully open and you try to go through, you get pushed back. Fine BUT it seems to change my position within the gaurden, pushing me backwards closer to the gaurden. Very annoying.\n\nNow the joy of my experience.\nI'm not the sort of person to give gameplay away so I'll keep it brief. Even if your not a 'Whoveryan ' like me, your going to love it. Flying the Tardis, meeting known and unknown aliens, outsmarting your evil enemies to save reality from a reboot. This game has everything going on.Got about 3hrs gameplay out it, and for the price that's great value.\n\nWhen these glitches are fixed, I'll upgrade this review to the five stars it deserves \n\nDevelopers it would be good if there was DLC that let you explore the Tardis on a mission.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 4:06 AM\n\nHi glenn.ratcliffe.961, We're glad enjoyed the game its great to get feedback from fans of the show. Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "Lempert007Feb 27 at 5:00 AM\nAn amazing game\n\nIf you are a fan. This game is amazing. I have to say. To all of you out there who complain about bugs and graphics issues, Believe me, the graphics are actually pretty Impressive and even the developers released some updates that fixed all the bugs. You really can see how much work has been put on this game. For fans its a must-play game and it's definitely worth the money\nBut if you are not familiar with the show. That game isn't for you.\n\nHelpful | 1\nDeveloper ResponseMar 6 at 2:24 PM\n\nThanks this was wonderful to read - the new patch is also a major step forward visually. Check it out.", "BossbeastMar 6 at 11:37 PM\nA must for fans\n\nI really enjoyed it , it gets quite scary at parts.\nI rated it 5 stars assuming you like the Doctor Who series as the gameplay isnt the most involved but the atmosphere adds immensely.\n\nHelpful | 2", "Dannycopo42Jan 30 at 1:36 PM\nBetter with Link\n\nOverall, this is a fun game with many nice puzzles, however I feel these graphics could definitely be at least somewhat improved to somehwat Red Matter and a more modern level. I have played this game on both Quest and Link and I can conlude the link experience is absolutely worth the hassle and cable. While I commend Maze Theory on making this game and porting it to the quest - I definitely think you should play it with a link cable unless you are a massive fan and absolutely cannot use the link, especially as it supports Cross-Buy.\n\nHelpful | 0", "mrpjbApr 8 at 10:29 AM\nEnjoyable\n\nEnjoyable, straightforward puzzle solving with beautiful designed graphics. The statues .. scary!\n\nHelpful | 0", "rob424Jan 24 at 10:39 AM\nGreat game, too many problems\n\nGoing black at the limits is not acceptable. Please just make it a barrier.\nPlease add volume control for the music - way too loud.\n\nOnce a puzzle is solved, please quit giving hints. For example, once I have the battery on the table, don't tell me where to look for it and how to obtain it.\nAlso, hints occur too soon. Please let me be lost and confused longer before providing hints. Perhaps this should be configurable. The game is already too short, requiring me to take longer to solve puzzles would actually be a good thing.\n\nI was totally confused going from the cave to a space ship - I thought that there was a glitch in the game. Perhaps there was a transmat or something that didn't display on the Quest. Very confusing.\n\nI would have given 5 stars, but dropped one for the reasons above.\n\nHelpful | 3\nDeveloper ResponseFeb 12 at 5:39 AM\n\nThanks for the 4 star review and for providing constructive feedback. We will look into these in the future. UPDATE: We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "pgc77Jan 28 at 7:33 AM\nOverall fun\n\nI am not a Doctor Who fan, but this game has been pretty fun so far. I have not experienced the glitches to the extreme as some others although I have come across a few. I think that once this game gets a patch it will be much better. I thought the graphics were good and so far I am following the story. I give it 4 stars for now and upgrade to 5 after they resolve a few issues. Its been fun so far.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 4:08 AM\n\nThanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "K9SHAWN16Mar 22 at 12:07 PM\nDr Who\n\nTook awhile to figure out, but cool game\n\nHelpful | 1", "Kota_I_AmJan 30 at 7:20 PM\nI MUST HAVE MORE\n\nThis is an absolutely fantastic game and its well worth every single penny! I never thought Id be able to enter the TARDIS like this. Let alone, take on the Weeping Angels and the Daleks. I only wish there was more to this game than we got. More TARDIS rooms, different Doctors, extra levels, etc. not that Im not glad for what I have experienced. Each level has different kinds of puzzles and challenges to overcome and each location feels so immersive. If youre looking for an epic Doctor Who adventure unlike any youve had before, this is the game for you.\n\nHelpful | 0\nDeveloper ResponseMar 6 at 2:35 PM\n\nAmazing thanks for the review - we hope to add new features and levels soon. Hope you enjoy the latest update.", "DoodlebritJan 25 at 1:48 AM\nA Must have for doctor who fans!\n\nAs the title says, its a must have for doctor who fans, Im only about 30 minutes in and I already feel like the doctor! A couple of jump scares, and a couple of puzzles, not to hard but not easy enough to have to rack your brain hours on end to figure them out! Very immersive and a couple of things I wasnt expecting, in a good way!\n\nIs it perfect... no! But it remains highly playable and Im sure they will iron the creases out very soon!\n\nIf you are a doctor who fan you will be able to see past the few hiccups and I think you will really enjoy the game!\n\nSo, What are you waiting for? As a great man once said... Allons-y!!!\n\nHelpful | 2\nDeveloper ResponseJan 29 at 4:23 AM\n\nWe loved reading your review. Thanks for playing!", "Edgardo810Feb 1 at 6:27 AM\nVery Interesting!\n\nYou go into these games with no instructions. Some have like a training section. Like Drop Dead, Vader has dojo. At least every single game should have a diagram outline of all the controller buttons. In most games you use you pointing finger to push buttons. In this one you have to turn over the pictures to just look at the numbers and then just put your whole hand on the key pad at it opens (weird). Gave it 4 Stars because you can not wander or explore the TARDIS. I wanted to see the bedrooms, entertainment area, the swimming pool, etc. The game was fun and challenging. Enjoyed being a Darlek and reeking havoc. Was fun standing in and flying the TARDIS! over all a lot of fun. Highly recommend it. Enjoy\n\nHelpful | 2\nDeveloper ResponseJan 29 at 3:48 AM\n\nHi Edgardo, sorry you're having trouble in this area. A number of players are struggling with this. Unfortunately the safe won't open unless you've found the 4 digit code. To do this you have to look around the office and laundrette and behind 2 picture frames. Once you've done this the Safe will open regardless of what buttons you hit. See extra hints here: https://twitter.com/Maze_Theory/status/1222474552195919872 I hope this helps, and once you've got back into the game. We'd love to hear what you thought of it.", "Nickk41oFeb 23 at 2:22 PM\nBig Doctor Who Fan!!!!\n\nI agree with other reviews if you are not a Dr. Who fan you might not appreciate the game as much. I really enjoyed playing the game. I thought the graphics were good. If you played Red Matter it does not compare but for me it did not effect the play of the game. I just really enjoyed the way the game played. Every chapter was different and did not play like the previous. For the price, I felt it was worth the money.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:34 AM\n\nThanks for your well written and balanced review Nickk41o - we're really pleased you enjoyed it.", "getya1trainMar 7 at 4:44 AM\nAmazing puzzle game\n\nStays true to the Dr Who feel, walking into the TARDIS for the first time is unreal!! If you're a fan of Dr Who, this is a must. If you like puzzle games, same thing.\n\nHelpful | 2", "BertHalfpintJan 28 at 11:17 PM\nTardis hint \n\nHi again, for those stuck in the Tardis at the start, me too for many, many attempts . Final attempt and I saw, out of the corner of my eye, a lever to my right on top of the console . It gets highlighted as part of the timed sequence too. Twiddle everything else until they sort of \"click\" and pull the level down last. Wooosh ! It worked.\n\nHope that helps a bit \n\nAnd now a slightly calmer review,\n\nYes, time for a slightly more grounded review after the euphoria of the Daleks.\nIt did all end rather abruptly after the Dalek segment and not really much else to do other than watch and listen.\nI can agree with everyone that on reflection there was a light-weight touch to the overall interactivity on offer. This is certainly not Red Matter or even Apex Construct, which incidentally is still keeping me occupied since purchasing it in May last year. Great that I did get a chance to stand in the Tardis rather than seeing it from a distance on my XBox. Moments in this VR experience are superb and alongside Vader Immortal it is just that , an experience. Skyrim , Fallout etc. are proper games and we know the Quest is never going to present this level of depth and vision. Red Matter has to be our baseline for developers to aspire to and evolve from. Dr Who didn't quite manage it this time. Maybe the sequel , on the Dalek home world please , will rectify this little blip in the VR timeline continuum . Maybe \n\nBelow is my previous 5  review which I still stand by ;\n\nExterminate, Exterminate,Exterminate!\nI have just dodged and outwitted ACTUAL Daleks. Then I became a Dalek and currently fighting the arrogant , evil little pepper pots . Why worry about anything else . I am a Dalek fighting Daleks.\nHonestly this entire experience ( game ),for myself , could just be called \"Fight The Daleks \" ......... and then more Daleks.\nDevelopers could you please make the sequel set on the Dalek home world and simply let me wade in.\nExterminate, Exterminate,Exterminate!\nOh and then bring on the Cybermen, Sea Devils and the Giant Robot \nIf my enthusiasm for squaring up to the most iconic villains from popular culture seems a bit OTT , it probably is \nVR and the opportunities offered by the Quest is transforming the casual gaming experience and this adds a whole new dimension and fits brilliantly into any VR library.\nNow must love and leave you , Daleks to hassle and destroy.\nExterminate, Exterminate, ......... oh ,you get the idea .\n\nFootnote: Being IN the VR opening DR Who title sequence was just a joy  woooohoo\nwoo hoo whooooohooooo da da da da ......\n\nHave fun \n\nHelpful | 3\nDeveloper ResponseFeb 12 at 5:39 AM\n\nWe wanted to thank you for posting this review. Particularly in highlighting the 'handle' in the TARDIS piloting game. Many players seem to be missing this. We are aware of some bugs reported and are working on a rapid patch for these. Thanks again for playing! UPDATE: We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "youkilledmydogFeb 12 at 9:37 PM\nPaying to test a beta\n\nNot refunding, only because Im desperate for this to be the game it should be. Im writing it off as a kickstarter donation with hopes that promised updates deliver at minimum a playable, stable narrative in the Doctor Who ecosystem.\nOne star for flying thru wormhole with Tardis in opening sequence.\nSecond star for responsive devs who seem sincere about trying to port Doctor Who to VR, although:\nThis game is not ready for prime time as of Feb 12, 2020.\nSo buggy, its hard to believe theres not a Quality Test required before being allowed as a supported release on the platform. Unplayable.\n\nFirst attempt, Standing setting, common issue of screen going black when close to walls or inclines, tons of objects that cant be interacted with. Seems easy enough to allow grabbing of miscellaneous debris, then if its an object relevant to the task, it glows or vibrates or something. Tool belt up around ribcage requires looking down too far and grabbing awkwardly, elbows out. Perhaps a setting to set player height if standing? Finding first aid packs that can be picked up, but not inventoried on belt. Unclear if they are useful at all, but one of a very few objects in game that can be grabbed. First colored wire puzzle a little confusing at first, but quickly solvable if it wasnt for irritating Doctors repeated unsolicited advice prompts and repeated black screen and flicker outs pulling one out of immersion and focus. Before solving, fell through floor, waist deep, Oculus positioning reset did not fix. Rage quit.\nSecond attempt, Sitting setting, picked up at wire puzzle, floor in correct position. Completed puzzle, most satisfying part was not hearing advice prompts repeated anymore. Why not a hint button if you need to hear a prompt a second or third time? Or an advice companion? Whatever happened to K-NINE? Got to the laser puzzle, repeated black screens and prompts again maddening, then whole screen becomes a flickering mess of black squares and controls stop working, and crash out of the game.\nQuest is my first VR. When my nephew handed me his at Christmas, and I pulled it over my face, Wow. Its bigger on the inside! That was the TARDIS moment I hoped for in this game, along with wild time-traveling adventure. Maybe its in there, but Im done looking until some serious updates are applied.\nWishing best to the devs. Will update review when promised fixes come through.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:25 AM\n\nHi youkilledmydog, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "INSAANITYVRJan 26 at 3:51 PM\nLove it, Needs more Pizzazz!\n\nThis will be a short review, So when i first play i was so excited about it, But my hands could only go in one way from relaxed to grab. No pointing... Nada. Other then that the game it self is amazing, The puzzles are good. The angels Oh the angels! Fantastic storyline! But what it could do with, Free roam Tardis, As a quest player i dont have access to play many doctor who games, So walking around inside the tardis and flipping switches dont last long. What they also need is more gameplay, This was very fun but also very short. Not worth 20 dollars thats for sure. (Spoiler) In the scene when your a dalek and shooting at the enemys, your head is your aimer. And i got very confused wether the circle is an enemy or my cursor. Last but not least needs to stop blacking out every time i get near a wall, Like ffs i dont want to restart my game every time i walk near a wall. Thats my review thanks for listening.\n\nHelpful | 0", "thejamhunterApr 4 at 9:12 AM\nA great treat for whoveins\n\nThis game is very immersive and is sure to put a smile on any doctor who fan\n\nHelpful | 1", "shawnersFeb 17 at 7:20 PM\nMore bugs than Daleks\n\nI had high hopes for this game as I am a Dr. Who fan. I just started playing and had to reset the game once in the first challenge due to a bug and the game loads the images often leaving you staring at a black screen with a orange loading circle. My first time entering the Tardis was ruined by that orange circle! Not sure if I want to try and continue playing.\n\nHelpful | 0\nDeveloper ResponseMay 13 at 5:32 AM\n\nHi Shawners We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "Lunafox1Feb 18 at 4:56 PM\nLoving this game so far\n\nThis is a game I have been waiting for ever since vr and I'm just in love with it. Granted it's not without it's odd issues but that's like any game and I would love to start seeing some add ons to this game or even just a travel mode where you can pilot the tardis to different planets and walk about the tardis, asking a lot for a quest game I know but I just think it would be awesome. If anyone is interested I am making a series on this game on my youtube channel.\n\nhttps://youtu.be/VTb6TPnkjn4\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:40 AM\n\nThanks - that's awesome to read!", "baker3212000Jan 29 at 2:20 PM\nPlease fix this game soon\n\nI really hope they figure out a way to fix this game soon I dont want to even try to play it again until its been fixed. its like watching a really good movie thats wasnt finished yet It ruins the whole experience\n\nHelpful | 1\nDeveloper ResponseMar 6 at 2:56 PM\n\nHi baker3212000, please try the latest update. There have been 3 since your initial review. Lots is fixed and now had a massive visual update with 2 x AA", "lakeroddickjFeb 16 at 12:38 AM\nGlitches\n\nMy son loves it although cant cant passed chapter 3 thanks to the weeping angels . My only big bare is that its glitchy at times.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:47 AM\n\nHi Lakeroddickj, Thanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "ItalianStallyonFeb 10 at 7:16 PM\nBig Dissapoinment for whovians\n\nI wont make this long, but as a long time Doctor Who fan, this game was a big let down. With all the material available from the long running series, this game should have been SOOO much more. To me it's almost insulting......you know kinda like Ghostbusters 3 was to GB fans (although next one looks promising). Other posts have pretty much captured all the negatives, but overall I was hoping to feel like I was in the dr who universe, and what I got was far from it. Honestly even if the game was free, it's still not good.\n\nHelpful | 3\nDeveloper ResponseMay 13 at 5:30 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "Sonictheboss8472Feb 2 at 4:40 AM\nAll I can say is wow\n\nThis game had me worried since Im not a huge fan or viewer of the Doctor Who series, but as soon as I got into the game I was hooked into the story. Since I dont wanna spoil anything all I want to say is that the T.A.R.D.I.S is crazy fun to operate, I love the Sonic Screwdriver mechanics and the story was AAA. There are a few bugs here and there but Im sure after the devs polish the game up this will be a perfect experience.\n\nHelpful | 2\nDeveloper ResponseFeb 5 at 9:22 AM\n\nLOVE this review. Thanks so much", "OncomingStorm11Feb 17 at 5:10 PM\nA Doctor Who Fans Dream\n\nRatings are relative, and while The Edge of Time has its quirks in terms of loading at times, it more than makes up for them by creating an authentic Doctor Who experience that any fan would love. Being inside the TARDIS is fantastic, as is encountering some iconic enemies. The references to the classic and new eras are both obvious and subtle, and clearly show that Maze Theory has done their homework. I was pushed to by my first VR headset because of this game and I have no regrets.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:43 AM\n\nThanks OncomingStorm11 - so pleased you're loving the game", "granuaile3Feb 16 at 1:00 PM\nworst game on quest\n\nTo start, I love Doctor Who. But this game was horrible. It tries to be a puzzler, shooter, stealth, horror, narrative experience and does none of those things well.\n\nThe puzzles are hampered by glitchy controls and magically appearing items. The shooting was the clunkiest I have ever seen in a video game VR or not. Targeting was glacial and firepower basically nonexistent. The stealth was repetitive, literally reduced to throw item to distract. Horror was not scary at all and had no real tension. The narrative was poorly written stereotypes with horrible graphics that put classic doctor who baddies where they did not make sense. Each chapter felt disjointed from each other and the lack of notification that you died was frustrating. Lack of teleportation made navigation a slow tedious process and lack of any navigation or much interaction at all in the last chapter was plain boring.\n\nAvoid!\n\nHelpful | 3\nDeveloper ResponseFeb 27 at 3:46 AM\n\nDifficult to respond to this as sounds like you really hated the game, which is hard to read for us Devs. We'd love you to give it another go and see if the recent patches change your opinion of the game. One thing to note from your feedback is there is a teleport function using the A button.", "TheLordnerdiousJan 24 at 6:28 PM\nTardis flying tip\n\nI was very excited for this release, but they need to explain things a little bit better. To make this short, for anyone who doesnt understand tardis flight its a memory game. Memorize what glows, and then do it while the beeping starts.\n\nHelpful | 0", "Adrian.TestcardFeb 13 at 6:29 PM\nThe tardis\n\nNot perfect but intriguing!\nWish we could explore the Tardis or at least have seamless entry /exit to it rather than a dark pause as this does destroy the magic somewhat.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:47 AM\n\nThanks for your feedback, weve just launched a second major patch which should rectify many of the reported bugs. These include:  Performance improvements  Fixed a teleporting issue in Dalek Stealth  General collision improvements across entire game  Improved Player position reset logic  Other bug fixes Wed love you to try the game again and hopefully update your review. Were committed to supporting this title and adding new features and improvements.", "Piggy5193Mar 14 at 11:02 AM\nAmazing\n\nThis game is the best game I have played in years. Its scared me a few times and I felt like a doctor companion. I would recommend this for a doctor who fan.\n\nHelpful | 1", "reaper_1423Mar 9 at 10:47 PM\nIt was fairly good\n\nEven if the newest form of the doctor isnt your favorite the experience alone is fun and worth a play\n\nHelpful | 2", "iDavrosJan 23 at 3:32 PM\nAtmospheric, scary and tottally 'Who'!\n\nThere is a real sense of presence in the enviroments, and they are impressive fit into the quest. The puzzles are very satisfying, just the right kind of gameplay to fit into the whoniverse. If you are a fan you'll be satisfied for the weeping angels section alone!\n\nOne word of warning, this game might be rather scary for non-vr-ers, my wife was genuinely terrified!\n\nHelpful | 10", "dalek_buddhaJan 24 at 3:52 AM\nGreat game but glitchy\n\nI do give a 5 star because I appreciate the effort, I will finish the game and obviously won't ask for a refund. You deserve the 20$ for just making this game.\n\nThe glitches I experienced\n1. On the camp she didn't guide me where to go and I walked around for ten minutes trying to open the other boxes\n2. My sonic just disappeared after going down the first lift so I couldn't open the door\nThat's it\nPlease go through the code once again that would be much appreciated\n\nHelpful | 10\nDeveloper ResponseFeb 12 at 5:22 AM\n\nThanks for the review Dalek_Buddha (great name by the way!). We have just launched a patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks.", "mark.wolden.7Feb 12 at 8:55 AM\nVery Happy Whovian\n\nWaited ages for this and finally got it. As a big Dr Who fan I love it, the environments and atmosphere are great imo. No software is ever perfect and bug free at release (look at Microsoft etc!) and sometimes you just have to release for Commercial pressures etc. However, the Developers are listening and actively patching and improving the game so kudos to them.\n\nI would like to see further DLC and for the hardcore fans a Dr Who Media Pedia, as a Timeline covering the History off the Drs and Monsters etc.\n\n\nKeep up the great work!\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:54 AM\n\nThat makes us devs happy too!", "BenKrazierFeb 12 at 9:53 AM\nIt has some issues but well worth it\n\nUPDATE: Theyve released the first patch. Everything is fixable \n\nOk so. Its great. It also has glitches but so does Fallout 4. Thats why they invented patches.\n\nI played this in the quest with link and also now on the quest stand alone. Even with the downgrade in graphics I prefer the stand alone quest version. I cant stand having to be aware of the cable. Any immersion that the decreased graphics breaks is made up for by free range of movement.\n\nGood job guys!\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:54 AM\n\nThanks so much for updating your review. We've also launched a 2nd patch yesterday with further improvements.", "TheFluffyToucanJan 26 at 2:20 PM\nHow could they release this?\n\nI bought this game in anticipation of a great adventure. I am pretty sure that great adventure is still in there somewhere, but the game is so buggy that within the first 10 minutes I ran into several major issues.\n\nFirst the screens keep going black if youre just a tad too close to a wall. If youre lucky you can manage to back out of that and get back into the game. I wasnt so lucky and in the second room I glitched through the wall into the backyard. I had to restart the game from the beginning. Same in the Tardis. Try walking forward and youre greeted by blackness.\n\nThis is so very broken and no fun at all. Ive been in VR for ages and have never come across anything as glitchy as this game. My suggestion if youre on the fence: Hands off, wait at least for two to three more updates or youre in for a lot of frustration. I will get a refund.\n\nHelpful | 11\nDeveloper ResponseMay 13 at 5:11 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "rayraysavesthedayApr 1 at 5:25 PM\nKewl\n\nIts was kewl. Just a bit more short than you'd like.\n\nHelpful | 0", "PortcherishFeb 13 at 12:01 AM\nA must for Whovians\n\nThis is a story mode game with problem solving. Sometimes a little tricky trying to work out what you need to do, but that's the point of the game. Some parts will make you jump. If you have a link cable I recommend installing free on crossbuy to appreciate the enhanced graphics.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:52 AM\n\nThanks - amazing! Glad you enjoyed it", "Mike98045Feb 5 at 1:38 PM\nVery buggy\n\nNo idea how to use this. Cant turn door knobs, cant walk thru doors-seems have to port thru. Cant point fingers to push buttons, constant tips just keep repeating which is extremely annoying. Got through a door ( not sure how) but game was still hinting in the prior room. Overall a big waste of money.\n\nHelpful | 8\nDeveloper ResponseMay 13 at 5:13 AM\n\nHi Mike98045, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "derphotdog169Feb 26 at 1:57 PM\nToo short but every thing else was great\n\nIs was just too short for the amount of money it is to get it\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:32 AM\n\nThanks for the feedback Derphotdog169 - hopefully in time we'll be able to add extra content and DLC", "Sbeard1Jan 26 at 7:20 PM\nTerrible\n\nI dont even know what is going on in this game.\n\nGraphics are simply awful. Its like playing PS1 again.\n\nEverywhere I go I get this black screen. Game is full of bugs.\n\nI wont even finish this trash. 10 minutes in and Im done.\n\nHelpful | 15\nDeveloper ResponseMay 13 at 5:10 AM\n\nHi Sbeard1. We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "thecreator2011Jan 28 at 3:37 AM\nHad great hope!! for this game\n\nI had great hope for this game, sooo disappointing l only got far as the tardis, which is only 3 scene which has been a battle on its own, because my character keeps disappearing into the walls and keeps going black not just a couple of times , And this game has been delayed I was expecting perfection , well as least these sort of bugs sorted , so at the mo stopped playing if this not sorted will be requesting a refund as the game becomes Frustrating and painfully to play\n\nHelpful | 4\nDeveloper ResponseMay 13 at 5:30 AM\n\nHi TheCreator2011, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "joehenry11Jan 26 at 10:53 AM\nGame has issues making it not fun\n\nafter reading all the bad reviews i still wanted to find out myself. They weren't off by much in my opinion. The game has massive issues you would find in a early acess. Screen goes black if you get close to walls even arms length trying to grab something. Cant turn knobs in ship to save my life. Load screens inside a room not even leaving an area really sucks but i can get over that. I gave up after a while and turned it off becuase of so many isuues made it not fun. Looks really cool though so i will keep it at 20.00 I hope they fix it soon so i can enjoy the game.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:27 AM\n\nHey Joe, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "matt.hegarty.54Jan 27 at 8:22 AM\nInterface needs optimisation\n\nI really really want to love this game, as a massive Who fan. The immersion is great, but there are often not quite enough hints to the puzzles. The main issue is the interface - grabbing items is very buggy and when it comes to the TARDIS controls this is a major issue. My \"hands\" would often not register as touching the control I needed to, instead selecting a nearby switch. This would not be so bad if it weren't for the fact that you have to run through the control operations within a time limit! Please look at improving the interactions (or remove the time limit) as I can't even get the TARDIS to the first destination at this point - as someone else said I managed to locate the time crystal but more by luck than judgement and I certainly don't want to have to repeat myself over and over hoping for a non-glitchy attempt.\n\nI also have the feeling the control puzzles are meant for you to use both Touch controllers to complete within the time limit. I'm highly right-hand dominant so this is not easy under time pressure.\n\nUPDATE: Oddly, standing up (whilst the game is in sitting position mode) seemed to help with the TARDIS console as the controls were lower down and thus easier to guide the virtual hands to. Still took a couple of events (it's not clear how much you need to turn the central \"tap\") but got the TARDIS to the first planet.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:27 AM\n\nHi Matt, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "JohnMarqzFeb 27 at 11:02 PM\nI loved, and they are working in more\n\nAnd, I think that the game plays very well, I yelled at the level of the weeping angels.\nThanks to read the suggestion of the languages and improve this game more and more\nThanks!\n\nHelpful | 1\nDeveloper ResponseMar 6 at 2:22 PM\n\nThat's great, we think you'll love the new update too. Visually it's a massive move on.", "Majestic76Jan 23 at 11:27 AM\nGood\n\nI agree with the last review the music is to loud and can make it difficult to understand the lady speaking other then that Looks like I'll be watching some doctor who this week.\n\nHelpful | 4\nDeveloper ResponseFeb 11 at 11:00 AM\n\nThanks for the review. We've looked at Sound Balance in the latest update. Hope this helps.", "GeeBee2Jan 29 at 4:54 AM\nWas good until........\n\nSee update below. The pre-title bit was great, seeing the TARDIS materialise was great, walking into the TARDIS it glitched, then it was great being \"in\" the titles. Then it all went wrong. What is up with those controls on the panels, it really can't be that difficult can it. Wondering if it will be fixed or should I get a refund. Beta test games shouldn't cost this much. Definitely cannot recommend you buy this, worst Quest game I have tried. I'm a real Dr Who fan, have been all my life but this is a big disappointment.\n\nUpdate: with help from devs on Facebook and here I am past this point of frustration. The game just gets better from there. Great atmosphere and puzzles, very much like Red Matter. Sounds and lighting make it pretty intense at times, in a good way. Look for the lever in the TARDIS and happy travelling!\n\nHelpful | 5\nDeveloper ResponseFeb 11 at 10:58 AM\n\nHi Geebee, we believe the TARDIS game issue may not be a bug and is actually players not seeing the last 'handle' clue. A number of the known bugs are being fixed now and you can also see some hints here: https://twitter.com/Maze_Theory/status/1222474552195919872 We will continue to improve and support the game moving forward. UPDATE: We have just launched a rapid patch to cover some of the key issues found by players within launch week. Here's some of the bug fixes and improvements listed below: - Players head going black in certain locations - Instance of Player getting trapped in a collision in Dalek Stealth - Door handle becoming offset - Other minor fixes We have a plan for several more updates to follow this over the coming weeks. We'd love you to reconsider updating your review once you've dived back in.", "ericbazingaJan 24 at 11:37 PM\nA fantastic and immersive experience!\n\nGreat story and gameplay, about 1-2 hours of gameplay depending on how fast you go. There's 5 chapters, featuring 5 different monsters. 3 of them are unique and two are recurring favorites (Weeping Angels and Daleks). There are also several puzzles which get more challenging as you go along. Plus plenty of fanservice too. Every switch, dial, etc on the TARDIS console can be messed with, although you don't need to for most of the game. Plus combatting against Weeping Angels (which is legit terrifying!) and Daleks, and even getting to pilot a Dalek shell. This is a must-play for any Whovian, but non-fans can get a kick out of it too. Oh, and it's cross-buy with Rift!\n\nHelpful | 5\nDeveloper ResponseJan 29 at 4:29 AM\n\nLove this. Thanks for a great review!", "EwebechaJan 24 at 9:51 AM\nGlitchy and loud\n\nWay too many glitches. I experienced the same as others. Could not go through the laundry room door, blackout then falling underneath what looks like a CAD drawing of the room. Had to close program and restart. Had to do this again to leave the office. There is very little exploration. The graphics are basic. The voice telling me what to do over and over and over is annoying. Please give option to turn that off. The puzzles are easy enough. If you veer off the narrow bounds of the game all goes black. No guessing where you should be. I had high hopes for much more! More exploration, more manipulation of random objects, harder puzzles...\n\nHelpful | 8\nDeveloper ResponseMay 13 at 5:14 AM\n\nHi Ewebecha, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "ABRektFeb 7 at 11:27 AM\nDr.Garbage\n\nWorst game Iv played on the oculus store. Be prepared for a black screen every-time you nudge a wall, the most annoying doctor in the franchise constantly talking while you try to solve puzzles, and awful puzzles that lack imagination and ingenuity. Honestly the whole team should be fired and never allowed to make games again.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:25 AM\n\nHi ABRekt, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "CybuchPLJan 26 at 1:32 AM\nWhy?\n\nI'm a big fan of the show and was so excited about this game. Actually, that's first game ever I preordered. It's so sad how glitchy it is :( Graphics is terrible and yes, you can do a lot better with Quest. Number of items you can interact with is limited to minimum. A lot of times you can interact only with objects that will push story further. 20% of time you will spend on puzzles with be solving a puzzle itself, 80% looking for not easily shown items, which you just need to pull or something.\n\nPlease keep working on this game and save it! It can be great!\n\nHelpful | 7\nDeveloper ResponseMay 13 at 5:15 AM\n\nHi CybuchPL, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "kriptisFeb 22 at 5:10 PM\nTo short\n\nIt was really cool wish it had more to it graphics kinda sucked\n\nHelpful | 0\nDeveloper ResponseMar 6 at 2:26 PM\n\nWe'd love you to try the latest update! Update 3 - 25+ visual fixes and improvements - Improved TARDIS portal effect & interior - 2X AA using maximum foveated rendering", "Mr.Microwave12Mar 1 at 7:51 PM\nHorrible controls\n\nI couldn't get past the first few parts because it was impossible to do anything I couldn't navigate the TARDIS or do the weird fuse puzzle thing because I could not grab the right object.\n\nHelpful | 0\nDeveloper ResponseMay 13 at 5:31 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "stevehawkeyeJan 24 at 11:49 AM\nBad port to quest....dont go there.\n\npoor graphics on quest compared to red matter and Moss. Glitches makes it almost impossible to move out of laundrette. And even managed to get out of office into back alley but system thought I was still in office.\n\nReally disappointing as I was waiting for this app.\n\nDev and QA need to rethink this port, very sad massive potential.\n\nHelpful | 7\nDeveloper ResponseMay 13 at 5:16 AM\n\nHi Stevehawkeye, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "TheInkblotKnight58Jan 24 at 1:42 PM\nSome gitches\n\nThe only problem was I had to reload it three times for it to work but other than that Awesome game and the best parts were weeping angels and controlling a dalek\n\nHelpful | 4\nDeveloper ResponseFeb 12 at 5:37 AM\n\nThanks for the review. We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "Nathan.FortkneeJan 26 at 6:07 AM\nThe story was great but..\n\nThe story was great but short it had 5 levels and they were all pretty short so I think it should cost 15$ and right when I got in my eyes were a foot taller than what I was in real life\n\nHelpful | 0", "FrankQuestJan 31 at 5:10 PM\nA lot of fun\n\nWell, not every game is to everyone's taste. This one definitely meets my expectations. A bit of puzzle, a bit of exploring, a bit spooky,... Graphics is ok, not the level of Red Matter but more than acceptable! Regarding bugs, what bugs? Long loading times? Also acceptable. Crashes? Haven't experienced one yet.\n\nHaven't been through all of the game yet, only found the first time crystal, two more to come. I expect that the last part is as smooth as the first one. So far, so great! (and no, I haven't been a Dr Who fan before)\n\nHelpful | 0", "ScottDellingerJan 30 at 4:59 AM\nBuggy and vomit-inducing\n\nLet me start off by saying I'm a HUGE Doctor Who fan and was looking forward to this game so much.\n\nAll the other reviews where they describe glitchy, buggy behaviour are correct, but this is also the very first VR game I've played (and I've played quite a few, including Red Matter) that gave me motion sickness so badly I was about to vomit after about 15 minutes of playing it. I'm not prone to motion sickness at all, so it was a big shock!\n\nUnfortunately, I'll have to request a refund on this one - also a first for me.\n\nHelpful | 3\nDeveloper ResponseMay 13 at 5:31 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "JagatiabcJan 27 at 7:02 AM\nBuggy\n\nVery buggy, it's annoying that 90% of objects are non interactive unlike its PC version. I cannot progress in the first level due to a bug closing the door and stopping me from going back to look for a number. I only found out this bug when looking for a YouTube guide on the level.\n\nHelpful | 6\nDeveloper ResponseMay 13 at 5:26 AM\n\nHi Jagatiabc - We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "WhovianGibby96Jan 23 at 11:23 PM\nWhen can I expect a sequel?!\n\nOkay so clearly I loved this game for obvious reasons. This game is geared to Whovians and newcomers alike and balances great scares and thrills along with an incredible story that I only ever get in the Big Finish realm of Doctor Who canon (not that the TV show doesnt try).\n\nThe only gripes I had with the game was that I wished to explore the TARDIS and its controls more, along with being able to really explore other places that may lead off the trail from the game but not quite open world. But maybe an open world unlockable could be fun and travel from place to place in the TARDIS but hey that can be for the sequel.\n\nBut all that aside I forget about the cons due to the fact that the pros outweighs it 100 to 1 as this is probably the most fun Ive ever had in a VR that didnt include having to go to my mates place using his VR set . And seriously please let there be a sequel given that setup. PLEASE!!!\n\nHelpful | 3\nDeveloper ResponseJan 29 at 4:43 AM\n\nWe loved this review and yes, having seen responses to the game we're looking at DLC, extra levels or a potential sequel.", "creditedJan 25 at 10:31 AM\nDr who is great\n\nThis game was so amazing. I would play it again and I loved it because I watch Doctor Who often. Even if you didnt watch Doctor Who I think that you would still like it because its full of mystery its like a scavenger hunt and it involves stealth. A warning is that there is one jump scare. I have a really big fear of weeping angels ever since I watch that the episode with them but this kind of made me conquer it. I love this game I would rate it a 10 out of 10\n\n\nHelpful | 2\nDeveloper ResponseJan 29 at 4:20 AM\n\nWe LOVED this review. Thanks so much.", "KermitdaninjaJan 23 at 5:19 PM\nVery impressive\n\nI have played the rift version of this game and I'm very impressed with the quest version. If anything the quest version runs more smoothly than the rift version.\nThe negative thing I can say about this game and the quest version is that the hands look like they are from superhot! Please fix this it's such a shame.\n\nHelpful | 3\nDeveloper ResponseFeb 11 at 11:05 AM\n\nThanks so much for this review! It's great to read.", "pumba230Jan 25 at 5:24 PM\nSandbox mode please!\n\nI loved it but i would be great to have a sandbox tardis that you could pilot to places with the ability to switch desktop themes/interiors. Other than that loved it!\n\nHelpful | 1\nDeveloper ResponseJan 29 at 4:20 AM\n\nSounds awesome, at some point we'll be launching DLC and other features for the game.", "annemie.prosecApr 2 at 3:46 AM\nMotion sickness\n\nSo apparently the movement in this game gives me motion sickness and not just a bit.\nI dont get sick while turning around but when you start moving forward and your field of view narows I start feeling sick. I dont know why this happens because I dont get sick in cars or on airplanes and such.\nI like the exploration in the game.\nJodies acting is awesome but it gets lost in the fact that her head isnt real it wouldve been much better if you just filmed her and put that in.\n\nHelpful | 1\nDeveloper ResponseApr 22 at 5:24 PM\n\nannemie.prosec so sorry to hear you felt VR sickness, we do have teleport which is a much more comfortable movement system if you are susceptible to sickness. Unfortunately Virtual reality sickness is different from motion sickness, we ensure that we adhere to all of the good VR practices including giving users a variety of movement options as everyone is different in their tolerance.", "Nicky.P.SmalleyJan 23 at 1:24 PM\nOut of this world!\n\nWhat can I say about this game?! Its amazing! The TARDIS flight alone brought a tear to my eye! Ive even requested they make a side expansion out of it.\nTheres so many exciting and spooky things that happen, but I wont spoil it for you. Just buy it!\n\nHelpful | 6\nDeveloper ResponseJan 29 at 4:50 AM\n\nWhat can I say about this review?! Its amazing!", "Ham2020Feb 12 at 5:56 AM\nSome brilliant moments, great game\n\nI loved this game. Lots of great Doctor Who moments, but I'm sure it would be almost as enjoyable for non fans. At it's core, it's a narrative adventure story. The Weeping Angels and Victorian level are great fun.\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:54 AM\n\nAhhh great, thanks so much", "jsmith72902Jan 26 at 8:49 AM\nLove it\n\nI had just become a fan of doctor who a few months ago and I love this game, to get actually experience the bigger on the inside experience, come face to face with actual Dalek, and the little bit of scariness makes me even more excited for FNaF HW VR to be ported to the Oculus quest\n\nHelpful | 1\nDeveloper ResponseJan 29 at 4:13 AM\n\nThanks so much for your review. SO pleased you are loving this game!", "vrkmarshallFeb 10 at 11:42 PM\nBuggy\n\nIm usually a fan but this game is very buggy, cant control or grab anything with any precision at all, which is a shame as it had potential to be great.\nDont buy it, you will be throwing money away!\n\nHelpful | 3\nDeveloper ResponseMay 13 at 5:29 AM\n\nHi vrkmarshall, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "icantthinkofgoodnameFeb 6 at 11:53 AM\nSPOOKAY\n\nI love the doctor who vibe and it has made me like the new doctor just a bit more watch out for chapter 2 though because the weeping angels are god terrifying. I loved it but if you hate spooks and hate doctor who dont buy this\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 4:01 AM\n\nThanks for the review!", "wickedlibrarianJan 26 at 2:46 PM\nVery disappointing\n\nIm a huge Doctor Who fan so I was very excited about this game. However, its so buggy its completely unplayable. I kept having to stop the game and re-start; its the first game Ill be returning.\n\nHelpful | 10\nDeveloper ResponseMay 13 at 5:12 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "jedi07Feb 25 at 5:16 PM\nYes Wonderful Game\n\nThis is the greatest game I ever played in VR now I get to know the Doctor Who world in a cool and interactive way.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:33 AM\n\nThanks Jedi07 - that makes us very happy!", "WadzeeJan 23 at 11:25 PM\nGreat concept - a little buggy\n\nNice plot and love the narrative, but constant blackouts and glitches are hampering game play.\n\nHelpful | 1\nDeveloper ResponseFeb 12 at 5:49 AM\n\nHi Wadzee, thanks for the review. We have just launched a patch to cover some of the key issues found by players within launch week. We have a plan for several more updates to follow this over the coming weeks.", "DarkenerMar 28 at 10:30 PM\nA few things\n\nI casually played the game not trying to go fast, I fumbled around a bit, messed around had some trouble with the puzzles, and yet the game only lasted the length of an actual dr who episode. The game wasn't bad but it definitely isint worth 20$ at best this game should be worth 10$. And yes I am a fan of the dr who tv show so I'm even a bit on the enjoyable side.\n\nSo yes I liked the game, and I loved the puzzles, but I was surely dosiponted when I only got an hour long experience, and that the whole story to it all was just a little hard to follow. (I still ended up understanding it)\n\nIf you've never watched dr who, dont waste your money.\nIf you just enjoy dr who but you rarely get the money to spend on a vr game, get a different game.\nIf you both have the money to waste and you enjoy dr who, go for it.\n\nBut hey who am I to tell you how to spend your money?\n\n(Side note: The voices are hard to hear and have inconsistent volume. The experience would be alot better with that fixed.)\n\nHelpful | 0", "bigcobes83Jan 30 at 4:01 PM\nBad motion\n\nFirst game in a while to\nMake me notion sick \n\nHelpful | 2\nDeveloper ResponseFeb 12 at 5:47 AM\n\nThanks for the review. Within settings we do provide a range of comfort settings you can adjust including walking speed, blinkers. It might be worth you adjusting these and trying again. The A button on the right hand also gives you a teleport option.", "IamREXrawwFeb 13 at 1:20 PM\nAmazing but sickening\n\nIt is absolutely amazing that we the people get to be apart of the doctor who experiences! The only thing wrong with this app is that it makes you feel very motion sick!\n\nHelpful | 1\nDeveloper ResponseMay 13 at 5:31 AM\n\nHi IamREXraww, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "soulripper1Mar 13 at 4:44 AM\n\nTop series top game\n\nHelpful | 1", "chris_hatch_99Feb 24 at 5:30 PM\n\nIt freaks me out but I want to finish. Definitely a love/ hate relationship. It's awesome.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:34 AM\n\nAmazing - thanks chris_hatch_99", "Rochez2011Jan 31 at 8:14 PM\nGood but scary\n\nWhen I first played the game I thought it was gonna be scary and I was right but I did not care Im only 9 and I love it but I havent watched any doctor who movies but now Im introduced to it and I love the game.\n\nHelpful | 0\nDeveloper ResponseFeb 5 at 9:23 AM\n\nSorry you found it scary. We hope it was ok by the end. Glad you enjoyed it overall.", "torvangerJan 25 at 9:17 AM\nNot intuitive at all\n\nYou have absolutely no idea what you can interact with and logic is not applicable. Plus the voice keeps repeating the same third over and over and over again.\n\nVery buggy unfortunately as I really looked forward to this game.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:29 AM\n\nHi Torvanger. We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "affectingNash79Mar 22 at 8:01 AM\nBad\n\nBad\n\nHelpful | 1", "WGC-GGRSFeb 16 at 3:32 PM\nGreat game!\n\nNot too far into it yet but so far I love it! An escape room kind of game with with the Doctor! And oh to be in the TARDIS!\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 3:43 AM\n\nThanks for your review!", "koohsffejJan 26 at 7:57 PM\nHopeful for updates\n\nPretty glitchy.\n\nHelpful | 4\nDeveloper ResponseMay 13 at 5:35 AM\n\nHi Koohsffej, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "MR.RaDoMFeb 5 at 1:59 PM\nReally good graphics\n\nDespite other reviews I think this game has some of the better graphics on the quest Im a huge doctor who fan and i think this game is great\n\nHelpful | 3\nDeveloper ResponseFeb 11 at 11:02 AM\n\nThanks for this review MR.RaDoM - it's much appreciated.", "buzzin247Mar 5 at 11:08 AM\nWaste of money\n\nI wish I didnt buy this game if it was the other doctor like 10 or 11\n\nHelpful | 0\nDeveloper ResponseMay 13 at 5:31 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "SaintRansomJan 26 at 3:15 PM\nDisappointed\n\nThere is way too many glitches and bugs that make this frustrating. I really tried to like it but its not user friendly at all.\n\nHelpful | 11\nDeveloper ResponseMay 13 at 5:11 AM\n\nHi Steve, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "DieZockStubeVRJan 23 at 9:59 AM\nGreat Game\n\nA great implementation of the game for the Oculus Quest. Highly recommended. My German First Impression Video is available on my YouTube Channel http://diezockstube.de\n\nHelpful | 7\nDeveloper ResponseFeb 12 at 5:29 AM\n\nThanks so much for the review DieZockStube!", "OrionV78Jan 23 at 9:50 PM\nDoctor Who Is Unplayable!\n\nI've never had this much trouble trying to get past a safe vault! This game is the buggiest VR game i have ever played on the Oculus quest,which is very disappointing.\n\nHelpful | 9\nDeveloper ResponseMay 13 at 5:13 AM\n\nHi OrionV78, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "davisk0527Jan 23 at 6:15 PM\nDONT BLINK!\n\nAs a huge doctor who fan, I LOVE THIS!! Super fun!!\nBut WARNING! There are jump scares!! I screamed! Truly makes you feel like you are the doctors companion!!\n10/10\n\nHelpful | 3\nDeveloper ResponseJan 29 at 4:47 AM\n\nAMAZING thanks!", "CrucibledJan 25 at 9:23 PM\nNeeds work\n\nAfter several restarts to unglitch the game I finally made it to the end. Controls are finicky and the movement is extremely jerky. The story is short but fun.\n\nHelpful | 1\nDeveloper ResponseMay 13 at 5:32 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "uncle.materJan 23 at 5:01 PM\nLove it\n\nWorking on the third crystal now and just love the graphics. Progression of the game is fantastic. Can't help but feel it's over soon though. Hope I'm wrong there...\n\nHelpful | 1", "richard169Jan 25 at 1:39 AM\nOutstanding\n\nBrilliant experience and even though they are a few issues to sort, non of them spoil the experience.\nWell done and please make more doctor who games!!!!!!\n\nHelpful | 0\nDeveloper ResponseJan 29 at 4:23 AM\n\nWe loved reading your review. Thanks for playing! We are working on a few bug fixes and will continue to support the title", "sjbuknewcJan 25 at 6:12 AM\nGreat tie in!\n\nLike an escape room experience without having to leave the house. Love all the subtle Easter eggs from the various series history too\n\nHelpful | 2\nDeveloper ResponseJan 29 at 4:22 AM\n\nAmazing! Thanks", "Z3PHIRJan 27 at 8:17 AM\nNot impressed\n\nPoor graphics & terrible controls. I rarely feel buyers remorse but I feel like I wasted $27.\n\nHelpful | 4\nDeveloper ResponseMay 13 at 5:30 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "o0finbar0oFeb 14 at 9:44 AM\nRlly good\n\nGreat game especially if you love doctor who\n\nHelpful | 0\nDeveloper ResponseFeb 21 at 4:23 PM\n\nThank you so much for commenting we're glad you enjoyed the game.", "harryyeetFeb 9 at 11:56 AM\nGood\n\nGood game graphics are good and is a buy if a doctor who fan\n\nHelpful | 0", "sethifusJan 28 at 6:05 PM\nLove it!\n\nAlways wanted a Doctor Who game like this! Lots of fun. Not perfect, but what is! Still gets 5 stars from me.\n\nHelpful | 1\nDeveloper ResponseJan 29 at 5:01 AM\n\nThanks so much for posting your review. We're so chuffed you 'Love it!'", "ruggrattzApr 24 at 11:56 AM\n\nits ok\n\nHelpful | 0", "cold_shiversJan 29 at 10:15 AM\n\nI love doctor who and when I saw they made a game of it I was ecstatic and really great game\n\nHelpful | 0", "fallinghorizonsytJan 23 at 3:12 PM\nIt absolutely fantastic\n\nGreat game gives me a good scaring Im going to finish it tomorrow hope the ending is good\n\nHelpful | 2\nDeveloper ResponseFeb 11 at 11:08 AM\n\nLove this review! Thanks", "boombsterFeb 2 at 6:38 PM\nAwful\n\nNot a 2020 game. Feels like I'm in the 90s. Looks awful.\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:26 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "DiscoBiscuit2020Feb 10 at 3:14 PM\nTerrible Experience\n\nNothing works.\n\nHelpful | 3\nDeveloper ResponseMay 13 at 5:30 AM\n\nWe noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "StevenHuk89Jan 24 at 12:28 PM\nDon't blink\n\nOne of the best games on the quest very\nGood if you're a fan or have been a fan.\n\nHelpful | 2\nDeveloper ResponseJan 29 at 4:34 AM\n\nSo pleased you enjoyed it.", "tjcool2004Jan 24 at 11:19 AM\nGerominoooooooooo\n\nA must play game for people who love doctor who.\n\nHelpful | 3\nDeveloper ResponseFeb 11 at 11:05 AM\n\nThanks so much tjcool, this is a great review to read for us Devs.", "dabomb556Jan 24 at 12:07 PM\nWow amazing\n\nKinda creepy bet you get used to it its amazing.\n\nHelpful | 2\nDeveloper ResponseFeb 12 at 5:45 AM\n\nThanks for the review Dabomb556 - it's lovely to read", "AndydouJan 26 at 6:33 AM\nGood game\n\nI like it a lot. Not come across any bugs yet\n\nHelpful | 1\nDeveloper ResponseJan 29 at 4:13 AM\n\nThanks Andydou! Glad you are having a great experience.", "DrDKarJan 23 at 11:34 AM\nA MUST HAVE for old and new Whovians!\n\nI have been watching Doctor Who since the 70's and my dream has finally come true!! Awesome to step into the Tardis and travel in time and space!!\n\nThe puzzles were fun and the environments amazing and creepy at times! :D\n\nHighly recommend this game to everyone whether you love Dr Who or not!!\n\nWish it was longer and can't wait for more!!! A++\n\nHelpful | 5", "yaGurlMadisonJan 28 at 1:19 AM\nYou can eat the biscuit\n\nThrow it into your mouth for sugary goodness!\n\nHelpful | 0\nDeveloper ResponseJan 29 at 3:52 AM\n\nWe love the fact you've found the biscuit dispenser!", "giroscopeJan 23 at 2:08 PM\nwhere is the spanish subtitles?\n\nit's increible!! all the other versions has subtitles in other lenguages! this is neglect... shame on quest.\n\nHelpful | 0\nDeveloper ResponseJan 29 at 4:48 AM\n\nWe're going to look into this. Spanish subtitles should be on there.", "kingyOWOFeb 1 at 2:50 AM\nNo\n\nWhy\n\nHelpful | 5\nDeveloper ResponseMay 13 at 5:26 AM\n\nHi kingyOWO, We noticed that you were one of the early players for our game and we are sorry that you did not feel your experience was as positive as you or we would have hoped. You may be pleased to hear that since the game first launched, we've been listening and have made a whole range of improvements. We were hoping if you would consider revisiting the game and re-rating based on your experience. We are small indie studio and we want to make sure we keep improving and keep listening to all our players - so would love for you to see how the game has changed for the better.", "OddlyspongeApr 13 at 5:41 PM\nWow\n\nJust wowoo\n\nHelpful | 0", "MrLou13Jan 24 at 11:27 PM\nEpic adventure through time and space!\n\nWell no surprise here Maze Theory knocked it out of the park with this port. This awesome trip through time and space transferred perfectly over to the Quest retaining an impressive amount of detail and all of the Who whimsy that makes this game great. Many of the locations in this game actually look even better then the PC version thanks to the true blacks and popping colors of the Quest display showing that this is by no means is a downgrade but rather a trade off from the PC version exchanging some of the finer texture details for a teather free experience on a gorgeous display. As far as gameplay goes everything runs just as smooth as its PC counterpart with the added benefit of room scale emerson that only the Quest can deliver and I must say being able to freely walk around the Tardis is simply amazing. So all in all this is still one of the best experiences on the Oculus store and a must have for any Whovian as well as a great jumping off point for people new to Who as the story is crafted in such a way that you dont need any prior knowledge of the show to follow what's happening while at the same time being jam packed with easter eggs, references and the whimsical atmosphere that makes Doctor Who so special. This game has a little bit of everything from a terrifying encounter with the dreaded weeping angels to a set of unique puzzles intertwined in beautiful environments and an original story that could easily be a Doctor Who special, this is one you dont want to miss. Grab your Sonic, hop in the legendary Tardis and enjoy an epic adventure through time and space.\n\nHelpful | 4\nDeveloper ResponseJan 29 at 4:30 AM\n\nSo pleased you enjoyed the game. We're going to continue to update and support this title moving forward."]