{"App Title": "Down the Rabbit Hole", "App description": "\"This is something really special and magical. And this is something that you can only do in VR.\" -Paradise Decay\n\n\"...as diverse and fascinating a VR adventure as Ive seen in the past four years covering the industry.\" -UploadVR\n\nYoud have to see this to understand how awesome it is. -BMF\n\nDown the Rabbit Hole is a VR adventure that takes place in Wonderland prior to Alice's arrival. You will discover a girl in search of her lost pet, Patches, that has wandered into Wonderland. Guide her as she moves through the mysterious world. But which way should she go?\n\nYou control the girls fate by plotting her journey through an immersive diorama that wraps around you. Through the games many twists and turns, you will find yourself exploring the most wondrous corners of Wonderland, solving puzzles, uncovering secrets and making choices about the story along the way.\n\n Multiple Playable Characters\n Rich 360 Diorama\n Various Unique Puzzles\n Hidden Collectibles\n Unique VR Locomotion", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Narrative, Puzzle", "Languages": "English, Chinese (China), French (Canada), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil), Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico), Spanish (Spain), Spanish (Venezuela)", "Version + Release Notes": "01.01", "Developer": "Cortopia Studios", "Publisher": "Beyond Frames Entertainment", "Website": "https://downtherabbitholegame.com/", "Release Date": "March 26, 2020", "Developer Privacy Policy": "None", "Space Required": "1.24 GB"}



["5 stars\n85%\n4 stars\n10%\n3 stars\n3%\n2 stars\n1%\n1 star\n1%", "LilAudJun 16 at 12:57 AM\nAhh-mazing!\n\nIve played other games that were escape room like games and was looking for something similar. I saw this and read the reviews which all seemed to rave ... but I still waited and kept reading more reviews. Finally, I made the purchase and boy am I bummed I took so long to decide.\n\nYoure going to love this! Challenging, entertaining, interactive. I loved the way you play as a third person but can stick your head in each set (reqd) to find all the invites. I love the way you can look up and see all the rooms you went thru, but better yet, you can see how far youve fallen down a rabbit hole.\n\nIt had an escape room feel for each set you have to make your way thru, takes several\nhours and DOES NOT make you motion sickness with how the game plays.\n\nYoure going to love this, dont hesitate to make the purchase and jump down this rabbit hole!\n\nSure hope this game developer has more like this to come! Make the jump, you wont regret it!\n\nHelpful | 138", "wzhang1008Jul 22 at 1:44 PM\nA true must have\n\nDevs nailed every single detail, you can always poke around or stick your head out and just be amazed.\nPuzzles are challenging and ALL different, not like other games like if you get the idea then the rest of it just gonna be easy.\nPpl say its about 2 hrs play time, but I doubt you could find all the invitations within 2 hrs. Worth every penny imo.\n\nHelpful | 18", "choshenJul 3 at 8:56 AM\nOutstanding! YOU NEED THIS GAME!\n\nThis is the first game on the quest I bother to rate, and I play quite alot. I read some reviews about this game being a must have so my expectations were pretty high, but wow.. And that's being said from someone who is not even such a fan of the original story.\n\n1. I found the game really immersive, the animations and characters are lovely- I had an unusually great time talking to the cards, the rabbit, Cheshire, the caterpillar.. The dialogs are simply hilarious and suitable for adults as well (I even think I recognized some references from other films there).\n2. the gameplay is clever and super comfy- 0 motion sickness, easy to control and also good for small spaces.\n3. The soundtrack is very nice, and Wonderland itself is just so well designed- These two combined made the game feel so real and above all- made me want to stay!\n4. The riddles get you to think, which I liked. It was never repetitive- each riddle, each mirror you cross- you discover something new and it's just never dull.\n\nTo sum it all up- don't hesitate to buy this game. It is indeed a must have.\n\nHelpful | 30", "jgrogersA day ago\nAmazing!\n\nThis game is amazing! It has many challenging puzzles spread across many detailed and colorful scenes. It really seems as if you are in a hole with a view into the different rooms within Wonderland. It's easy to control the characters, and to move your point of view. I liked the way I could grab hold of parts of the sides of the hole I was in and pull myself into a different point of view including being able to get very close to a scene to look for Clues. I am not a very experienced gamer so it took me some time to figure out some of the puzzles, but I only went to YouTube twice for a few small hints. Even though I finished the game , I was not able to find all of the invitations on that run through. I will go back and go through it again to try to find them all.\nAs a retired programmer and project manager I am very impressed with the quality, attention to detail, and consistent play ability of this game. As an added bonus, I appreciate that it is a non-violent game.\n\nHelpful | 1", "Valvette21 days ago\nLoved it!\n\nIve been looking for something Moss like, because Moss was an awesome game. This game came close. Its really cool how you can go to different levels in the rabbit hole while you try to solve the puzzles. If you liked Moss you will probably like this game also!\n\nHelpful | 6", "Jujuman7112 days ago\nIncredible!\n\nThe game is immersive. Its like looking into dioramas from your childhood Christmas. You have to use VR to look in ALL the books and crannies. This would not have worked on console games. By far the best game I have. I play it slow and enjoy if every time I play. I dont rush it just take in all the that I can see and hear. I love the cat deep in the dark watching!\n\nHelpful | 3", "SactoJoshJul 22 at 11:46 AM\nAmazing graphics and design\n\nThe graphics and the way you can stick your head in the environment and look around in the world you are thrown into are *amazing*. Easily some of the best graphics Ive seen on Oculus so far. The puzzles (especially the ones on the locked chests) arent the best but the story and everything else make up for it.\n\nDont play this game for the puzzles. But its worth it for the story and graphics alone. Another downside was its relatively short play time. The game can be finished in less than 90 minutes. Maybe stretched out to 2 hours if you look for all the hidden invitations.\n\nIll definitely be looking out for more Oculus titles from this developer (Cortopia)\n\nHelpful | 6", "Typhus2220 days ago\nWonderful!\n\nI dont usually write reviews for things but this game exceeded my expectations. Its such a unique and relaxing game.\n\nI am about halfway through the story and so far the puzzles have not been too difficult. The environments are spectacular and the voice acting is well done.\n\nIf you are looking for an adventure this is worth picking up!\n\nHelpful | 3", "shai01112 days ago\nFun and Enjoyable\n\nI enjoyed playing this game. Figuring out the puzzles were pretty easy and the characters were engaging. There are multiple scenes and there are mirrors which you can take to return to an earlier scene. I would recommend this game to a friend for sure.\n\nHelpful | 3", "mavic2proJun 29 at 3:43 AM\nDown The Rabbit Hole\n\nI for one enjoyed this game. Just the thing during CV-19 isolation. A nice brain puzzler. I gave it 4 stars because the designers did not build in the facility to save the progress for more than one player meaning only one player can play the game at a time.\n\nJust so you know - the designers of Moss allow 3 people to save their own particular game.\n\nHowever, I will be keeping my eye open for more from the designers of Down the rabbit hole.\n\nHelpful | 28\nDeveloper Response14 days ago\n\nHey mavic2pro. Thanks for your feedback. We've added multiple save slots to the game!", "lynnette.seybert5 days ago\nLOVE\n\nI absolutely love puzzle games and this one did not disappoint. Each level was so unique and the art was fantastic! Looking forward to showing it off to my friend's next time they come to visit.\n\nHelpful | 3", "PsyKoSmiley4 days ago\nPure fun!\n\nI haven't gamed since the Dreamcast days but Oculus peaked my interest. I'm loving it but finding games I like can be tough. This is perfect so far. There's a couple places I had a bit of trouble figuring what I was supposed to do but I got it eventually. graphics are great! I liked just looking around as much as actual gameplay.\n\nHelpful | 1", "dkdawson16 days ago\nAmazing!\n\nYou just have to try it. Enjoy simple brain teasers in a world with different realms. It is so fantastic to see all the creativity that the creators put into it. By far the best VR experience Ive ever had!!\n\nHelpful | 3", "bluandteddyJul 26 at 3:09 PM\nThe absolute BEST\n\nThis game is so beautiful! My daughter (10) and I both played it separately and not around each other, and both exclaimed out loud that it felt like being inside a Disney ride. I want more! Also, you don't die so there's no anxiety :)\n\nHelpful | 4", "eleeceJul 22 at 6:34 PM\nBreathing\n\nWhat an amazing use of the platform. Loved this game from start to finish. So much I was smiling ear to ear the entire time. On the shorter side but I'm quickly learning that's just the way it is for Quest. If you like any sort of 3rd person adventure game, this is 11/10 worth it!\n\nHelpful | 3", "agganis1984Jul 19 at 5:28 PM\nim confused\n\nIm downlaofin the game literally right now and it's only 690 megabits why does the oculas store say its 1.2 gigabytes? am i only downloading a game with half quality or half the game? excellent game ! thank you for making s game like this,\n\n\nUpdate i finished this game and it was an absolute gorgeous game!!! I've never experienced anything like it ! hands down in my opinion this was a such a cool game!\n\nHelpful | 3", "James.E.CardiganJul 13 at 1:38 PM\nVery aesthetically pleasing\n\nTrailer does not do this game justice! I come from a generation of the old point-and-click adventure games from the late 80's, early 90's. Story is important to me in a game like this. Puzzles are great with the gameplay and the old adventure games seemed to have a lot of \"moon-logic\" puzzles that took time to solve. I mean, weeks to months it took to get through a puzzle.\n\nThe puzzles in this game don't seem near as hard, but does require some thought process. But the story greatly reminds me of the old adventure games I used to play from Sierra or LucusArts. (Though, this game doesn't seem to have inventory puzzles.)\n\nAlso, the mechanic of getting through the story in this game is interesting. I feel like a giant climbing down the rabbit hole, and peeking my head into the rooms makes it so much more immersive. It is literally an insane feeling that you simply have to experience.\n\nHelpful | 3", "Scotty_04Jul 25 at 1:05 PM\nAmazing and Beautiful\n\nthis game is super good the graphics the story the style basically this game is off of Alice in wonderland I wish it could be longer I finished the game within 3 hours which made me sad but I definitely suggest buying this game for a fun puzzle game\n\nHelpful | 3", "DarkStatic66Jul 21 at 11:13 PM\nAbsolutely amazing!!\n\nThe visual are beautiful. The game play and plot kept me interested. I loved how I actually had to look around with the headset to find the items needed. I loved how objects interacted with me when I touched them. I loved having choices to respond with when talking to other characters. It is worth the money and I plan to play again to make different choices and to see where that takes me. I loved all the characters as well. The puzzles were challenging but not frustrating.\n\nIt didnt take me very long to get through it once, a few hours.\n\nHowever, I wanted to find all the invitations needed, the mirror count said I was missing a couple but my log said I had them all.\n\nDidnt let that stop me and continued on.\n\nTLDR: Buy the game, fun for all. I had a great time.\n\nPs: them baby bunnies are the cutest!!\n\nHelpful | 2", "TomMhClJul 20 at 3:26 PM\nBeautiful\n\nThis is a stunning game that shows you every corner of Wonderland. The visuals are great, as is the story. The controls take some getting used to bit once you do you can easily travers every part of the game world, and you'll want to. The puzzles aren't too hard, perhaps a bit on The easy side. The one big downside is that it's not very long. In about 3 of 4 hours you should be able tot finish it. Still, those hours will ben spent in a very magical installment of Wonderland.\n\nHelpful | 2", "Lady_Mel23 days ago\nLoved it\n\nA really good, traditional puzzle game. One of the best games I've played on Oculus so far. It kept me hooked for a good few hours. Fingers crossed there's a sequel! Definitely worth the money\n\nHelpful | 3", "s-ynth2 days ago\nArt\n\nVery well done game. Its a nice story and visually very beautiful. Not very complicated nor very long game but every minute you spend on it will be delightful. Waiting for future games from this team.\n\nHelpful | 1", "armandchar120 days ago\nBeautiful and clever\n\nThe artistic direction of this game is actual genius... Im amazed... glad I caught this on sale! Looking forward to your next games, lots of love from Mauritius.\n\nHelpful | 3", "MrWhitePawsJul 7 at 5:28 PM\nGreat game and awesome developers!\n\nORIGINAL REVIEW:\nGame is good, but Im disappointed that my partner cant start his own new game without erasing my progress. Only 1 player is allowed to save at a time. Other games have the ability to do multiple save profiles, so why not this one?\n\nEDIT:\nThe developers added the ability to have multiple profiles, super happy thanks!\n\nHelpful | 3", "keden716 days ago\nThis Game is All Aces\n\nAn absolutely beautiful and relaxing puzzle game! Immerse yourself in stunning visuals and puzzles that are not overly-complicated. This is a game I would recommend 52 times over!\n\nHelpful | 2", "Cherrygrrl9423 days ago\n\nSuch a fun puzzle solving game!!!! Only complaint I have is it was too short...I flew through it in a total of about 2 hours. Still definitely worth it!!!!\n\nHelpful | 3", "pattywilliams23Jul 13 at 6:12 PM\nAmazing Game\n\nI thought about buying this game for a few days then finally ended up actually doing and wow what an awesome immersive game I cannot get over how cool it is to walk around exploring and solving puzzles. I would definitely recommend this game. I just hope I can find another I like half as much.\n\nHelpful | 2", "mopsigmorumJun 17 at 5:10 AM\nBrilliant use of the VR platform\n\nThis game is the first Ive played on quest so far where I really felt you couldnt have done it on a non-VR platform. The way you interact with the game is really unique, and a lot of fun! The puzzles arent particularly complicated, although I did consult a trophy cheat list a couple of times, but the enjoyment wasnt in the challenge as much as in the way you play, which was awesome.\n\nHelpful | 7", "SpanishAmor3Jul 10 at 11:37 AM\nEnchanting puzzle game!\n\nI loved this game! The levels were challenging and creative puzzles to solve. The premise of an Alice in Wonderland vibe was fun as well. I hope more chapters get added, I didnt want the game to end! Its not super long but very enjoyable and a great escape traveling down the layers and creative navigating. So much fun and if youre on the fencebuy it! Do it. You wont be sorry!\n\nHelpful | 2", "nicolebell928Jul 11 at 11:19 PM\nSo addictive\n\nI love a good puzzle game so when I came across this game and read the reviews I decided to purchase it, I am so glad I did! Its so addictive, hard to stop playing! The layout of the game is unreal, love it! Would highly reccomend!\n\nHelpful | 3", "Mr.Thijs976 days ago\nAmazing\n\nyou really feel like you are in wonderland\n\nHelpful | 3", "SoNotRite07Jul 27 at 5:12 PM\nWow\n\nI was reading others reviews and thought I should give it a try. (I could also refund if not my thing). The very first scene I was already \"wowing\". I could not of guessed it was this awesome.\n\nHelpful | 2", "jaybrinson23Jul 13 at 12:22 PM\nIncredible story telling!\n\nThis remix of then classical tale brought new life into the story. Beautiful graphics, easy to use controls, fantastic art style. My only complaint is that it was too short (not that it didnt pack a lot into the game)!\n\nHelpful | 3", "hedhntressJul 18 at 10:18 PM\nEnjoyed very much, definitely worth it\n\nIf I could give a tip listen carefully at the beginning, if you get stuck go to YouTube and type down the rabbit hole look for Luis L.\nFor the best tips. I hope they do another did it twice. Its addicting hard to put down.\n\nHelpful | 2", "DarkAngel10614Jul 5 at 2:49 AM\nInteresting\n\nTo start, I am a 44 yr old disabled woman, so this comes from my perspective.\n\nI have always been fascinated with miniatures and looking at the protagonist in the game is amazing. Set up like a little miniature that goes deeper and deeper, the level of detail is amazing.\n\nI don't have a lot of play space currently but this game doesn't need it. I can play it sitting on my bed. I can move the diarama in any way I need to, even if it's just to marvel at the details.\n\nSome of the puzzles kind of make u go duh, when u figure them out. Don't over think things. It's a new spin on Wonderland and being a fan of Lewis Carroll's work, a wonderous job by the devs.\n\nGood for just about any age, though some kids might be too young to figure out the puzzles. But I would think if they can read, they would be old enough to enjoy this. Just as Alice and her adventures are enjoyable by all ages, I think this game would be too.\n\nHelpful | 2", "daygo2dabayJul 4 at 9:23 PM\nGreat great game\n\nExtremely well thought out experience. The name totally makes sense after playing. Outstanding representation of what Wonderland would look like in VR. So happy with my experience and have already told many others to make the purchase as you wont be disappointed! I love the puzzles the most!\n\nHelpful | 2", "StephenGdBakerJul 11 at 9:12 PM\nAmazing\n\nWow. Absolutely the most brilliant, interesting, fun, creative thing I've seen to date in VR. Historically I am not a gamer and expected to enjoy VR immersive video while my husband would play games. But I started this game and could not put it down. LOVE it!\n\nHelpful | 2", "11jaxdaddyJul 4 at 9:15 AM\nThis is extraordinary\n\nI first was hesitant buying this game because I thought you could do the same thing on Xbox or any average video game console but oh was I wrong theres so much more to this game than just moving around the girl this is an extraordinary game and I would recommend it to anyone who is on the fence\n\nHelpful | 2", "QDaBeatJul 3 at 1:07 PM\nTotally epic!\n\nI just want to start by saying I just finished the game and what must have been record time because I just couldnt stop playing originally I had beat the game with two invitations missed, remaining. I didnt think that made much of a difference but I pick the game back up just now, well earlier today and started playing again and finally had it completed to 100% and man was it worth it like Im not gonna say anything to spoil it for anyone else but if you havent finished it 100% you need to as the alternative ending and its just makes the whole game worth it lmao.. also it could be nice for something to do with the game now. Replaying for memory I guess, maybe some DLC for some. $ who knows. Or a sequel, either way for its value. 4point Whatever stars to make you just say 5 stars !! Lol\n\nHelpful | 2", "dana.darling22 days ago\nBeautifule\n\nThis is a beautiful game. Love this design. Interesting puzzles and fun for adults and kids alike!\n\nHelpful | 3", "JedichicaJul 1 at 5:23 PM\nMeticulously detailed!! Wow\n\nI had been looking forward to this and bought it shortly after its release. Time got away from me and today I finally set aside some time to try it out!\n\nThis game by far exceeded my expectations, and its still going. I took off my headset when my battery died and I couldnt believe Id been playing for so long.\n\nI got lost in this world exploring every nook and cranny just to see what the developers had in store for me. On each picture or around the back of the scene or under it, everything was so detailed and the graphics on the quest are stunning. To be able to read and look at objects so clearly is impressive!! At one point I even got a bit woozy because I was so excited whipping around the world so much so that I could see it from every angle (my fault dont do that )\n\nIll continue to take my time exploring this little world for hours to see what other surprises I can find. The puzzles are pretty easy so far if youre caught up exploring anyways. Im still sorting the second chest at this time.\n\nJob well done. This is truly a magical experience and a ton of work for a VR game to be that detailed. \n\nIf you love getting lost on purpose and exploring this game will bring you huge value!!!\n\nHelpful | 2", "felixableJul 18 at 10:58 AM\nTop notch VR escape game\n\nThis should be the standard of all VR escape room / puzzle solving game. It uses all capabilities of what VR can exclusively does. I have yet to finish the game but this is by far the best VR experience I've had.\n\nHelpful | 2", "GarabangliaJun 28 at 1:39 PM\nWonderful!\n\nIm new to VR and have a fear of heights, so was looking for something interesting, magical and not too scary.\nMy daughter found this game and loved and I have to say its a perfect match.\nAmazing escape room style adventure, interesting and magical.\n\nHelpful | 3", "RockStar202219 days ago\nWonderful imagination!\n\nI love how it is like escape room. The control of looking at different floors is amazing! \n\nHelpful | 2", "RnR2017Jul 15 at 6:35 AM\nEngaging perspective on a classic story!\n\nMy husband and I loved this game! We loved the overall story, the engaging perspective moving throughout the game, wonderful puzzles and collecting items. This game keeps the player involved via multiple methods.\n\nHelpful | 2", "NeonKeysMay 6 at 1:05 AM\nTruly a Masterpiece\n\nThis is honestly the best gaming experience Ive ever had. Im a grown man, and I was giddy with glee playing this game.\n\nEverything about it is fantastic. The user interaction mechanisms are an absolute revelation. The way you move around is incredibly gratifying...just wait and see what I mean.\n\nThe level design, modeling, texturing, lighting, character design, art direction, voice overs, story line, music, sound effects...literally every aspect of this game is magnificently executed.\n\nTheyve even injected a level of dry, witty humor into this game that fits so perfectly into this whimsical, fantastical version of Wonderland.\n\nI was hesitant to finish the game because I didnt want it to be over. It was so immersive and so much fun. Bravo to the team at Cortopia Studios! \n\nThis is easily the best $20 Ive ever spent. Cant wait to see what you make next...\n\nHelpful | 22\nDeveloper ResponseMay 7 at 1:45 PM\n\nWe're thrilled to hear that, Justin! Thank you so much!", "katie.bradyJun 11 at 3:47 PM\nStunning\n\nIm about half way through I think but so far its a real delight to play. I love the style and attention to detail. Its basically a point and click type game but more immersive and interactive. I would be quite happy without the switches to first person but thats just a personal preference. I havent played their other game Wands but definitely will after this\n\nHelpful | 4", "iamsteph16 days ago\nbeautiful game\n\nthis is a whole new level of Alice in wonderland. it's cute and beautiful all around!\n\nHelpful | 2", "silverfire32Mar 26 at 7:57 AM\nShort but enchanting\n\nThe perennial classic, Alice in Wonderland, doesn't quite come to life in this, because this isn't *that* story. This is before that story. And *this* story does come to life: as you descend deeper into the world of Wonderland, new scenes and areas unfold around you and you can always look back up to see the top of the rabbit hole.\n\nThis is technically a third person platform puzzle game, but with first person elements. Important dialog moments are first person, as are some puzzles. Splitting up between the two main characters--the girl and the Four and a Half--is needed to solve many of the puzzles, while some can be solved by only one character.\n\nThe game is full of beautifully-envisioned environments and plenty of references to the original classic by Lewis Carroll. The soundtrack is equally well-done and, I believe, is available on Steam.\n\nDespite the approximately 2 hour length of the game, it is entertaining and enchanting (especially in the Mirror Realm) and has a pleasant nostalgic feel for those of us who grew up with Alice. The puzzles are somewhat challenging, but not too challenging. I recommend it if you're at all a fan of Wonderland and/or puzzle story games.\n\nHelpful | 199", "ajaswinski16 days ago\nBRILLIANT FROM AN ARTISITC STANDPOINT\n\nI feel the \"diorama\" presentation of the game as the player literally goes down a rabbit hole is marvelous. I personally felt some of the early puzzles weren't that creative or fair. (Looking at you lunch time clock). Room Dark Matter had challenging but brilliantly designed puzzles and always felt fair. Rabbit Hole was a bit convoluted and I felt somewhat cheated. That said, it is a beautiful vision game and a wonderful showpiece for kids.\n\nHelpful | 0", "SteelyDan277Jul 3 at 4:06 AM\nAll the detail... it!!!\n\nIt is absolutely beautiful must have! ! !\nLots of fun to play!\nIf you are on the fence about purchasing this game then there is no need to be! Go ahead and spend a little and get this mind turning game. You will be thanking me later. Enjoy! \n\nHelpful | 2", "ninetailsq50Jul 1 at 12:49 PM\nIm without words\n\nAt first i was skeptical about this game it seemed like i would get bored easily but my the way they made this game is truly unique and amazing i highly recommend if you want to have a true vr experience!!will definitely be looking for more games made by them\n\nHelpful | 2", "ADSK_BostonJun 30 at 2:33 PM\nUhhhh....Wow!\n\nFirst game purchased for my Oculus Quest and now the bar is set super high! Such a creative and fun game that both my wife and I enjoy thoroughly. Great example of how VR can be used and experienced. BUY THIS NOW!\n\nHelpful | 3", "BlueWolfFangz17 days ago\nLoved it!\n\nWish it had been longer, but I say that about all great games \n\nHelpful | 2", "tribalmolecule6 days ago\nLove it!\n\nIt's fun.\n\nHelpful | 2", "randytaylerJun 9 at 4:54 PM\nA fantastic work of art.\n\nI'm still new to the Quest, so maaaaybe I'm just easily impressed, but this little puzzle game has blown me away so far. The puzzles are just the right complexity for my patience level - enough to make me feel clever, but not bored - and everything is just gorgeous to look at.\n\nThe variety of interactions was fun, too, though I got into some rough spots as I tried to play from my recliner - I couldn't reach things in the game without sitting forward, and even then the arms of my chair blocked the interaction. Like I said, I'm new to this - I imagine it's a problem for any sitting game? Regardless, I've been delighted. I plan to broadcast this to the TV so the family can watch as some of us play.\n\nMy only complaint is that the Wonderland universe makes so little sense - which is Lewis Carroll's fault. The creators did amazing work making nonsense into something coherent and fun.\n\n(I don't know how long this game will be by the time I finish, but I've been playing for more than an hour, and feel like it's been a great value.)\n\nHelpful | 3", "impetusjj25 days ago\nBest experience ever\n\nBUY THIS. You will not regret.\n\nHelpful | 3", "VongolaCielo16 days ago\nVery nice aesthetic\n\nGood looking and plays well.\n\nHelpful | 2", "govacationJul 5 at 12:03 PM\nLove it!\n\nI love the game! When I replayed it, looking for all invitations, I really liked finding the hidden plea for help wriiten in Swedish . Hoppas ni har ftt lite ledigt nu under sommaren!\n\nHelpful | 2\nDeveloper ResponseJul 6 at 3:43 AM\n\nVi har semester s nu allt r okej tack!", "Mikey45Jul 8 at 9:23 PM\nGreat game\n\nVery immersive world. Love solving the puzzles. Sitting in the middle of a rabbit hole while guiding the character through the game was great. I highly recommend this game.\n\nHelpful | 2", "CanadianFrogJul 13 at 4:15 PM\nA nice, but short experience\n\nThe game was very beautiful and the story interesting, but to be honest, it wasn't very challenging for most of it and was not very long. But to be fair, the longevity of Vr games are pretty much all really low, so I wouldn't say this one was horribly short. The only reason it's not a 5 stars is that I would've wanted to stay in this world for a bit longer ^^\n\nHelpful | 2", "Susi_NJul 17 at 9:26 AM\nLOVED IT\n\nGreat graphics and lovely story. I have always loved Alice and being immersed in an Alice-based world was a real treat!\n\nHelpful | 2", "Reader8Jun 17 at 9:55 PM\nNew VR experience\n\nMix of 3rd and 1st person storybook meets escape room. The story is too simple but the graphics and flow is excellent. Its very fun to pick questions and to find the hidden clues. It really testis your mind. You never know whats coming next!\n\nHelpful | 2", "AvCcDogJul 9 at 3:56 PM\nFun, challenging but achievable-loved it\n\nIm no master gamer but Im no dummy either. This beautiful game enchanted me and challenged me in equal measure.\nHighly recommend\n\nHelpful | 2", "koolKatxxMay 29 at 1:04 AM\nLoved it\n\nI was debating on purchasing but went for it and I dont regret this one . I had a blast playing this game , Ive always loved Alice In wonderland which this story is almost the same but still different . Puzzles were fun and the graphics and quality are well worth the money . :) its a must buy .\n\nHelpful | 3", "wwdadaJul 30 at 12:14 PM\nPerfection\n\nPlease make all VR in this image\n\nHelpful | 2", "virtualmandalaJul 28 at 6:06 PM\nWow\n\nYet again, my mind is blown!\n\nHelpful | 2", "HumbleHoneyBeeJun 4 at 10:51 AM\nDownload Now!!\n\nThis is such an immersing game! It allows the player to make personal choices as well as play through the puzzles. The game does feel like it is short, but I believe its worth the price. The visuals for the game as spectacular! The game also has hidden / extra interactions not needed for game play but to add more to the game and allow for players to explore.\n\nSPOILER EXAMPLE: when playing the Cheshire Cat level if you glance down you can see a bigger version of the cats face and interact with it by petting the cat. This causes the Cheshire Cat to purr!!  Honestly it made me super happy to discover this small thing!!\n\nIf you enjoy puzzle games, and interaction games like MOSS I recommend trying this game! In comparison to MOSS the puzzles are a little more difficult, requiring more effort \n\n\n\nHelpful | 2", "Golden_MindJun 4 at 4:25 AM\nSpiralling Down.\n\nRatings first.\nStory 5/5\nDuration 4/5\nGraphics 5/5\nValue  5/5\nPuzzles ? (required youtube help halfway)\nCharacters 5/5\n\nAfter playing games that involved shooting zombies, killings spiders, facing ghouls etc..., this game is a little gem. Calming, relaxing, but thought provoking. Everything, everywhere could be something.\n\nThe only downside, if it really is a downside, is the potential duration of time it takes to complete the game. However, it's a journey worth taking just to lose yourself in another world. It doesn't end when it ends, exploration is a never ending story.\n\nHelpful | 2", "Tinkers24May 25 at 4:44 PM\nI lost all sense of time\n\nI am very new to vr and decided to buy quest for ease of use. My husband has oculus, I tried it we fell out, definitely quest for me. This is the first game I have purchased for myself and its perfect for me. I love the animation. It reminded me of a live pop up book. I adored how far you could peep into each scene. I stood, I sat, I searched. I think I have been in this game a good couple of hours and pretty sure I'm only about half way through... I find it beautiful to look at. Its so easy to navigate. I was stumped with one puzzle and felt such a numpty that I hadn't thought of the answer earlier... The only reason I didn't continue was battery life. I lost all sense of time... Brilliantl!\n\nHelpful | 3", "TimNikiasMay 26 at 5:45 AM\nThough short, really well made\n\nI love that this game does what I like most about VR: Tons of detail which you can actually see in 3D. The scenery is gorgeous to look at, the voice-acting is good and the animation well-done. Having the entire game surround you is a really neat idea and adds some nice interaction to the game when you're shifting the world around to position yourself in the scenery.\n\nMy nitpick would be the placement of the scenery when you shortly leave the game to the Quest's menu, as it doesn't stay where it was when you return.\n\nHelpful | 3", "BooallenJul 15 at 3:20 PM\nLove it!!!\n\nThe graphics are amazing, its a puzzle and its a blast trying to figure it out!\n\nHelpful | 2", "laceymarie.wilksJul 11 at 10:36 AM\n\nGreat game. You can replay it making different choices.\n\nHelpful | 3", "VictoriavalintinJun 25 at 4:14 PM\nGreat for my daughter and me\n\nLove this game honestly! The puzzles are great and keep u thinking. The story is entertaining as well. My daughter and I love it.\n\nHelpful | 3", "Wynot3Jul 12 at 5:59 AM\nBroken puzzle\n\nSpent an hour moving the hands on the clock to the precise position that every single tutorial on YouTube told me to do. Nothing happens. Asking for a refund. UPDATE:\nBug was fixed! Got to jump back in. I absolutely love the concept, mechanics, and graphics, but most puzzles were way too simplistic. Younger kids will adore this though.\n\nHelpful | 3\nDeveloper Response11 hours ago\n\nThanks for updating your review!", "ajcinalliJul 9 at 8:36 AM\nSo much fun\n\nGreat game with a fun story and good puzzles. Its super interactive and really transports you there.\n\nHelpful | 2", "DISOXYGEN2KJul 11 at 10:40 AM\nAmazing!\n\nThis Game Is Amazing!!! I love the story and it's graphics. I'm happy I purchased it!\n\nHelpful | 2", "shayne.mackey73Jun 5 at 8:28 AM\nFun, charming, and entertaining\n\nThis is a fun game with cool puzzles and some brain work around a great story. Even though this isnt Alice in Wonderland, a lot of the best characters are still here - and its is beautiful in its design and creativity. Its really a lot of fun.\n\nHelpful | 2", "OcularMigraineMar 26 at 11:17 AM\nWonderful game!\n\nI very much enjoyed playing Down the Rabbit Hole and think it's a wonderful experience for all ages. You guide the girl (and the friend she makes along the way) through an ever expanding world, figuring out various puzzles and finding invitations to the Queen's party along the way. Each new room or realm is a delight to see and explore, and it's worth it to spend some time in each room. I enjoyed scooting baby bunnies around, rustling tree leaves, and finding interesting artwork by moving my head right inside the scenes and looking behind walls. I loved \"hearing\" the stars circling around the cook's head. There are so many nice touches they added to this game.\n\nThe puzzles are fun and often clever, and I never felt like I couldn't solve them and get stuck in the game. Probably the most challenging thing is to find all the invitations, some of which are very well hidden. The ending options will change, depending on how many you find. The nice thing is that once you leave a realm, you can always go back to it later, in case you've missed some. There are a couple of different ways you can see how many letters you've found in each level, so you know where to look. Although you don't need to open the chests or find all the letters to actually finish the game, doing so will give you the most enjoyment and make you feel like you truly completed the game.\n\nLastly, I just loved being in the various environments and greatly enjoyed the music. There's a different song for each realm, and they all add to the feeling of being in a magical place. Very well done!\n\nHelpful | 39", "peter.hamm.378Jun 13 at 8:36 AM\nDown the rabbit hole\n\nAbsolutely awesome game got really addicted to it and played it from start to finish and the puzzles are quite hard in places absolutely awesome definite Buy it\n\nHelpful | 3", "Gmacv649May 24 at 7:07 PM\nWonderland\n\nThe game is so enchanting. The puzzles are fun if sometimes quite easy, which is my cup of tea. I like puzzle games, but dislike games with puzzles that are so difficult you can't enjoy the game or move forward in the game. This is not one of those games. The game in VR makes it so immersive and the mechanics of the game so interesting . I don't think I would have the same giddy experience playing without VR.\n\nHelpful | 2", "MakMarMay 24 at 2:36 PM\nSimply incredible!\n\nIf I could give 10 stars, I would. This was a magical journey; I was fully immersed into the Wonderland! Massive congratulations to the team for the fantastic graphics, the captivating voices, the puzzles and the tricks! Great storytelling and, in my view, of the right length.\n\nI look forward to seeing what you will develop next! A must for all ages!\n\nThank you for the incredible experience \n\nHelpful | 2", "kristyprcMay 16 at 12:33 AM\nI found this to be magical\n\nMaybe because Im brand new to VR, Im not sure. I am blown away. Im having the absolute best time playing it. The story is unique, so its not tedious. The puzzles have been just difficult enough not to be frustrating. Its both first person and a character that you control, depending on where you are in the game. It was such a trip when the scene would enlarge from the storybook view to place me in the room. Im still playing, so Im struggling with a couple things. Im trying not to enlist a walkthrough on YouTube. I got a couple chests unlocked, but theres three more so far I cant figure out. Im struggling with finding each invitation for every step. I dont know if the game will finish without those things, time will tell. Its my first purchased game for my new Oculus and as stated above, I find it magical.\n\nHelpful | 3", "jeremyrex7Jul 5 at 8:31 AM\nGreat game!\n\nThis was one of the most unique games Ive played on the Oculus so far. Really well done!\n\nHelpful | 2", "Wingo987Jun 24 at 12:03 PM\nPretty awesome game!\n\nWish it was a little longer than it was for the price but other than that it was pretty interactive.\n\nHelpful | 3", "WonderWoman81Jun 15 at 6:11 PM\nGreat game\n\nGreat story line and unique puzzles. Love the character interaction and how the whole game literally takes place down a rabbit hole. Very cool. Hope they come out with some sequels!\n\nHelpful | 2", "joseph.sabgaJul 19 at 2:58 PM\nWow\n\nA must try.\n\nHelpful | 2", "sdouhneJul 5 at 1:11 PM\nWhat's an amazing story and game\n\nwhat a great game and use of VR really enjoyed it and highly recommend it\n\nHelpful | 2", "jdubya515Jun 18 at 8:42 PM\nWonderful experience\n\nMy family loved this game from the 7 year old to the 64 year old. It's beautiful, the puzzles are challenging but not impossible. The only complaint is that you can only have one game in play at a time. Allowing multiple players would really improve this experience.\n\nHelpful | 3\nDeveloper ResponseJul 7 at 5:11 PM\n\nThanks for the feedback, we're listening! That feature will be added to the game soon. Update: Multiple save slots have been added to the game. We hope that this improves your experience. Thanks!", "Challenger12May 4 at 1:04 PM\nBuy it!\n\nThis was the most beautiful and enchanting VR game Ive played. I wish it was ten times longer but I loved every second. Its a beautiful story and you feel joy as you play it which was just a wonderful experience. Some parts are quite challenging and you have to really engage to pass the level - but its a fabulous game for all the family to enjoy. Absolutely love it.\n\nHelpful | 4", "YornavMay 19 at 12:50 AM\nIf you like Moss, you like this.\n\nThis game is amazing. If you played Moss and liked, you'll definitely like this as well. It ha some cool game mechanics that gives it even a little extra. Like that it switches from 3rd person to 1st person. so you really zoom in to objects and you ARE the character. For the rest it's also very cool that you ACTUALLY go down the rabbit hole. You can always look up and see the stars through the opening of the hole and all the levels you played thus far. The Alice in wonderland style puzzles are also very unique and everything fits well together. I only think it's a bit on the short side, but nevertheless worth every penny. Thumbs up, guys!!\n\nHelpful | 2", "MadMabhJun 5 at 8:46 PM\nCharming and Surreal\n\nThe structure of and movement through the vibrant and richly detailed worlds is unique and fun to manipulate. The story and characters are simple yet well crafted. My only wish is that the game lasted longer.\n\nHelpful | 2", "DIPDIA-QMay 25 at 9:53 AM\nVR Art\n\nThe art and design of this game is creative and charming. The puzzle arent extremely difficult but they still make you think. I showed my Fiance and this is one of the few VR titles she actually has an interest in.\n\nHelpful | 3", "aclash1Jun 24 at 6:44 PM\nAwesome\n\nReally enjoyed it, the whole game blew me away. Great visuals\n\nHelpful | 3", "golder.alexJul 6 at 3:23 AM\nFun and easy\n\nThe game is lots of fun and easy to play. I was looking for a game where I can play while sitting on my couch and this one fit the build perfectly. The graphics are pretty good and the storyline is cute and funny.\n\nA couple of shortcoming I wanted to mention. First of all the game is relatively short and I was able to complete all 6 levels in about 2 hours. I wish there were more to the story. Second, is the interaction is not very intuitive and moving through the rooms is a bit of a challenge since you need to move the character in different directions while she is out of sight. Also, using the vines to reposition yourself is a bit of a pain.\n\nI hope there are other chapters in the works to make this game worth the money.\n\nHelpful | 2", "lilinandoJun 7 at 4:02 PM\nTrippy game\n\nI've played for about 30 min so far. This is unlike any other VR game I've played. It seems very unique and quirky. I'm really enjoying it.\n\nHelpful | 3", "BugofalugMay 10 at 7:02 AM\nDown the rabbit hole\n\nThis game Rocks!! If you like trying to figure thing out with clues you will love this game. Feels like youre in a movie. The treasure chests are a little difficult, we had to cheat on one of them. Definitely worth trying. I actually wish it was a longer game, I liked being in the moment.\n\nHelpful | 3", "BossLadyHMay 14 at 1:36 PM\nThis is my all time favourite.\n\nI'm so in love with this game to the point I keep putting it down when I get to far as I don't want it to end. I'm on the last 2 levels and I will probably start it again once it ends.\n\nIt's not the story of Alice and wonderland but it has characters and references which are the same/similar so it's Great for any fans of the film.\n\nI'm a Disney lover and I like puzzles. Recommend.\n\nPlease bring out another one, I'd love another film based game like this. ( Another spin on a Disney film would be wicked)\n\nHelpful | 2", "r3df1r3dr4g0nJul 18 at 9:08 PM\nGame play gets stuck and cannot proceed\n\nUpdate: This game is very fun and unique. There are still bugs buy welcome to VR! Even with the issues mentioned below I would still recommend the game. The concept is unique. Movement is smooth and comfortable for a VR game.\n\nAfter the developers comment I restarted and went beyond the clock. All was great until the final room when again there was an issue. After removing the sward and stabbing the king's hand the sward disappears. Later returning to the game there is no way to go beyond as the hand and foot are blocking the way. Look like I'm about two steps from the end of the game and have to start over \n\n\n\nGame was moving along and great but at the lunchtime clock the game play is frozen. No time on the clock allows me to proceed. I understand the hint, have reviewed times online and tried all clock time options, nothing works. After exiting the game and returning even the hint no longer appears. Very disappointed since the game has been fun and unique. I would not recommend this game at this time it seems there are still bugs to workout and a few Google searches will confirm this for you as well.\n\nHelpful | 0\nDeveloper Response21 days ago\n\nHey, r3df1r3dr4g0n. It's not a bug that the king's hand and foot are blocking your path. He'll move his hand when you put a tart in it, and he'll move his foot when Patches scratches it!", "HotRust27May 14 at 2:47 AM\nShort but incredible! Must play!\n\nI completed this on one headset charge and that really is the only bad point as I just wanted more!\n\nThis game is like Moss in that it has that same incredible feel and amazement.\n\nYou literally look forward to what imaginative room your little character will go into next, the artwork is beautiful and just everything really.\n\nGreat escapism in these tough times!\n\nHelpful | 2", "MooeymoomooMar 26 at 10:18 AM\nLove it \n\nBeautiful game. I'm not a fan of Alice in Wonderland but am really enjoying this and will definitely play again. Love how each challenge takes you further down the rabbit hole and looking up you can see how far down you are, each scene is so beautiful. Puzzles are enough to get you thinking but not too hard. Would love more games like this in the quest store... Already purchased \"The Curious Tale of the Stolen Pets\" and \"A Fisherman's Tale\"... I definitely recommend it, indulging my inner child.\n\nHelpful | 19", "July08Jun 30 at 3:32 PM\nAmazing!\n\nAmazing game! I cant stop playing . Completely magical!\n\nHelpful | 2", "MysteryTeenYTJun 30 at 4:31 PM\nLove this game!\n\nBought it to entertain myself, boy em i glad that i did.\n\nHelpful | 2", "ParadiseDecayMar 27 at 1:46 PM\nSo I took the RED Pill!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=dlvgyYeF77c\n\nMy Initial Thoughts:\nA fantastic concept that really takes you into the realms of Alice in Wonderland.\nThe execution of the level design is superb and intuitive with lovingly crafted and stylish artwork and animations.\nI also love the view system in this game, it makes really good use of what VR is capable of.\nThis is a treat for the senses and so far the Quest is just killing it with quality VR content.\n\nHelpful | 16", "Ames13May 30 at 4:18 PM\nBeautiful\n\nThere is no Alice, but theres lots of Wonderland! Its a relatively short and easy gameplay, with fun puzzles and overlying scavenger hunt. Highly, highly recommend for any fan of the story!\n\nHelpful | 2", "teddelerMar 27 at 7:39 AM\nWorth every penny!\n\nI'm about half way done at this point (I think). Awesome game. Very creative. Love the way you descend through the levels and can see everything above you. Switching between third person and first person is a great idea. Third person gives you the broader view for problem solving, first person lets you enjoy and appreciate the environments from a more 'realistic' viewpoint. I especially love the caterpillar.\n\nMore games like this, please. :)\n\nHelpful | 15", "holaarigatoeApr 30 at 10:55 PM\nSo much fun!\n\nThis was such a cool twist on Alice and Wonderland. The characters and different scenes were so cool and interesting. Everything had a ton of detail, and it was very challenging. I had to really think hard to get past most of the rooms in this escape room. I 100% recommend its worth every penny!\n\nHelpful | 3", "Mr.BigPapiJun 30 at 9:52 PM\nCute game\n\nI love the game but its too short\n\nHelpful | 2", "Cross-Eyed-BearJun 8 at 2:58 PM\nStunning, clever\n\nI couldn't get enough of that little world. Wish I could erase my memory and play it again!\n\nHelpful | 3", "JoolserMay 8 at 8:06 AM\nSimply outstanding\n\nI can't stand the original story, was never a fan of the movie, but thismis just brilliant. Beautifully executed. Funny. Love the switch between views.mlove that so far I can see my journey, simply by looking up the hole. Don't hesitate. Buy this now.\n\nHelpful | 3", "elaineloueezyMay 21 at 5:58 PM\nDown the rabbit hole\n\nI love this game! It totally immerses you in the story with beautiful graphics and cool puzzles. Not since Sierra gaming and the old quest games have I felt so intrigued with a cool game! Thank you to the manufacturers!\n\nHelpful | 2", "beverley.bassonJun 6 at 11:38 AM\nLovely Game\n\nLoved every minute of it. Love the graphics and the story. Enjoyed losing myself in the world. Wish it was a bit longer. Such a cute game\n\nHelpful | 2", "Alanna_2020May 31 at 1:49 PM\nEnjoyable game play\n\nAlthough a little juvenile, this game is entertaining. The only criticism I have is toward the end the chest puzzles seem impossible to open.... not sure what some pics are referring to, but trial and error will get it open eventually if you can match one or two.\n\nI have yet to find all the invites, but still made it through to the end :)\n\nHelpful | 2\nDeveloper ResponseJun 1 at 7:10 AM\n\nHey Alanna_2020. Thanks for the review! The chest puzzles have solutions that can be deduced from the environment. If you're curious about any of the solutions or what the pictures mean, don't hesitate to contact us at support@cortopia.com!", "YaGirlKindaBusyMay 2 at 9:18 PM\nFun and Well Made\n\nThis is a beautiful and fun game perfect for players just getting into VR or veterans watching the virtual reality world grow. Its an age old story told in a way that makes it feel brand new with enough puzzle and exploration for a satisfying play through. Good fun for anyone!\n\nHelpful | 2", "goohliMar 28 at 6:54 AM\nTop-notch\n\nWhat I liked most in this game is the diversity of the puzzles. It never feels repetitive.\n\nI'm also a big fan of diorama VR games, I really think it is the future of VR gaming so congrats to the devs, one day you will be remembered as pioneers. Especially now that you've shown that we can switch to a first-person perspective for some tasks (as long as they don't require nausea-inducing locomotion). Really the best way to maximize immersion in VR.\n\nToo bad it's so short. I think the price is right but it's a testament to the quality of the game that I was still a bit disappointed when it ended. Hopefully we will get to further explore this world in a sequel.\n\nHelpful | 9", "Magic_VR_Mar 26 at 8:11 PM\nWonderful Adventure with Smart Puzzles\n\nIt doesn't matter how old you are, you will love this game. I was waiting for months and I was really excited to finally play it. Definitely better than my expectation. During this adventure you must find your lost pet Patches while solving puzzles, searching for clues and invitations letters from the Queen of Heart. The puzzles are great and always different. The puzzle with the bird took me about 15 minutes to understand what I had to do. I wonder how long you will take :) Overall the story line is perfectly written in the amazing and beautiful world of Wonderland with the rabbit, the Hatter, the Cat and many others.\n\nI have been following Cortopia Studios since they created their first game **Wands** and seeing the success of that game I knew I was not going to be disappointed with this one. Developers did a great job here.\n\nIf you still need to be convinced, check my review about it I just did on my YT channel called \"Magic VR\"\n\nHelpful | 9", "wescotteJun 18 at 3:30 PM\nVery entertaining adventure game\n\nYou can get very close to a 100% complete run in about two hours.\n\nDespite being so short I found it very enjoyable. The environments were excellent and how you navigated the world was really creative. I would have liked to see more progression on the puzzles/game mechanics.\n\nHelpful | 1", "CarmelclosureApr 21 at 3:18 PM\nEnchanting\n\nExcellent storyline!! Definitely makes you think! But what was so amazing about this game was the ability to move the screen around, closer , further, higher or lower. Plus the ability to switch characters  I just wish it was longer\n\nHelpful | 4", "NeverWrongApr 19 at 9:15 AM\nA Delightful Treasure\n\nWhat a beautifully done game! Graphics are terrific, the game play is unique, and the story is perfectly laid out. There are mysteries to solve, but nothing is scary. There is light-hearted conflict, but no battles to fight. The puzzles are a well balanced mix of easy and challenging, so you dont constantly get stuck (which would frustrate my tired brain).\n\nThe game was long enough where I feel I got my moneys worth and since it has a choose your own adventure component, I plan to play again soon and see what changes to the story occur.\n\nThank you to whomever brought this fabulous game to Quest!\n\nHelpful | 3", "Go-To-Wands-DiscordApr 20 at 7:03 AM\nBest puzzle adventure for vr!!\n\nBrilliant!! Many of challenge puzzles that made me really happy with the lovely story. I love beautiful graphics and how you interact with every inches of it. Also it has some replayability. Great game with the good price!\nRecommend!!\n\nHelpful | 5", "Tiger-ClawMar 29 at 4:54 PM\nAbsolutely stunning!\n\nI should start off by saying that Im not generally a big fan of puzzle games, but Im a HUGE fan of Cortopias other title, Wands, so I figured Id give this one a shot.\n\nAll I can say is that they really knocked it out of the park. The world they created is absolutely gorgeous and the puzzles were fun, creative, and seamless in their execution.\n\nIm having a tough time putting into words what it is that makes this game so magical and immersive. Ive never seen anything like it.\n\nYoull know what Im talking about within the first minute.\n\nHelpful | 7", "RobertPhoenixAZMay 10 at 4:22 PM\nIt's as good as the other reviews say.\n\nBeautiful graphics, terrific script, top notch voice actors, game play is butter smooth, puzzles are fun. If you liked Moss you'll like this guaranteed (literally).\n\nHelpful | 3", "nishruu2May 30 at 3:31 PM\nfun but frustrating\n\ni like the environment, a rabbit hole but for me its slow going. the puzzle can be a little frustrating\n\nHelpful | 2", "kimbiecookieApr 11 at 3:01 PM\nABSOLUTELY SPLENDIFFEROUS !\n\nWow! One of the most amazing games I've ever played in VR. I like the way you switch from 3rd person to 1st person when talking with the characters. I love the miniature scenes too. You are definitely transported into a wonderland! I nice to be able to adjust the scenes to exactly where you need them allowing you to play even if you have a very small space. I was completely immersed and enthralled! Greatif you like games like Moss although this one is a bit more relaxed since you dont have to fight anything. Game play is smooth and simple too. Awesome job developers! Thank you for creating such a wonderful and beautiful game!\n\nHelpful | 3", "MightyQuinnJMar 31 at 5:27 PM\nThis game shows off whats possible in vr\n\nI absolutely love how transitioning from 3rd person view to fp just brings the story alive!! And being able to create your own story gives this game so much replay ability! If anyone says you cant have stories in vr games Ill point them to this one for sure! So much fun and so immersive! Ill be diving back into this game after a couple family members have their turn\n\nHelpful | 9", "calforbMar 26 at 7:30 AM\nWow!\n\nI havent completed it yet but its beautifully created. Thought it was along the lines of moss in play at the start but when you pull yourself into those scenes and see the details you can see a lot of effort went into this title. Highly recommended!!\n\nHelpful | 9", "mcgooganApr 14 at 1:57 AM\nDown rabbit hole\n\nThis is a slow paced, comfortable and relaxing journey. It is a beautiful delight as each section opens up to reveal a sequence of micro detailed dioramas, 3rd or 1st person, of not over taxing puzzles and seeking of hidden objects. It is immersive, Especially as the tunnel above extends ever further from the sky, with all the little scenes visible and still accessible. Movement between them is slick. The story has options. Some humour sure. Some wow moments also. More interaction with characters and objects would be nice addition though, as sometimes it felt like turning pages in a book rather than true involvement - only criticism.\n\nHelpful | 3", "NinjaXMMar 27 at 9:58 PM\nLiterally down the rabbit hole\n\nI had never considered third person games for VR despite all the positive comments I had seen on games like moss, that is till I tried this game.\n\nThis is a game I would actually still enjoy playing on other platforms, in contrast to most VR games which would make awful games if they were to be ported to pancake.\n\nDown the rabbit hole has a story and has character presence that makes you feel more interested in going on. Its not a tech demo for sure.\n\n\nNow the thing that really sold me on the whole third person VR is the smooth transition from third person to first person, without which I would have said this game would have been better as a normal non VR game. Yes, seeing the characters in 3rd person 6DOF is amazing and really adorable, but once you get going with the game you stop really noticing. Also the way you peek from different angles to find the letters is a great use of VR but not something a console controller cant handle. Its all about how one moment you are watching from outside then suddenly you are the player and you get an amazing sense of scale and get fully wrapped in the atmosphere.\n\n\nIn this game you literally go down the rabbit hole and not just once when you start the game, no, just look up and you will know what I mean.\n\nAwesome awesome game and one of my favorites.\n\nHelpful | 5", "rockit.rountreeMar 31 at 8:57 AM\nBeautiful\n\nFrom the first scene I was entranced with this beautiful game. My kids play the shooting games and I wander around in wonderland solving puzzles. The graphics are fun and I love wandering back and forth through the levels looking for missed clues. Two minor issues... I am not a gamer and would like a way to get hints when Im confused. Also, there is no way to save 1 persons game so my kids keep resetting my progress to show their friends this amazing world. Otherwise this is a solid purchase!\n\nHelpful | 4", "izikasMay 10 at 3:48 PM\nGreat game\n\nVery impressive game, I believe one of the examples when VR game done right.\nMy only wish is it allowed multiple users so new game did not erase existing progress.\n\nHelpful | 2", "Moore235May 27 at 8:41 AM\nAwesome Game!!!\n\nWow! They really did it with this one. The whole family has thoroughly enjoyed this game.\n\nHelpful | 2", "dickosmMay 23 at 5:44 AM\nIt really is great\n\nNot a massive fan of puzzle games but this one if absolutely worth it and may get me to rethink my aversion\n\nHelpful | 2", "KawaiiShortcakeMar 29 at 3:35 PM\nSO BEAUTIFUL!\n\nI practically eat, sleep and breathe Alice In Wonderland. This game was so fabulous; anyone who enjoys light story telling and a scavenger hunt will enjoy this game! Great for kids too, though the cat almost scared the living daylights outta me when I saw his face, all blacked out, smiling at you in the dark.. It definitely was a short game but I so enjoyed it and will be going back to see what other choices will change the outcome I had. LOVE THIS FOR THE PRICE. WORTH THE WAIT!! <3\n\nHelpful | 4", "IshIsntANameJul 12 at 11:56 AM\nIt's kinda just okay\n\nIt's not bad at all just kinda boring in some parts it's worth a shot for most people\n\nHelpful | 1", "equal2uMar 28 at 8:56 PM\nWelcome to Wonderland\n\nThis is as close as you can get to Wonderland. This game was an absolute joy. Escape to a world from your childhood. The graphics are good, and the mini games are fun. There are several levels and each level has invitations hidden as in Hidden Object Games. However, looking for the Rabbits party invitations is Also fun. I still cant find three invitations. This is a great game for younger kids or those of us who want to escape our Coronavirus world.\n\nHelpful | 4", "thekrunkymonkeyJun 7 at 6:18 AM\nBeautiful game with a fatal bug.\n\nThe game looks magnificent and is commendably atmospheric BUT - a fatal glitch with the \"lunch time\" clock puzzle means that I can't proceed. Where's the patch that the devs promised? Telling people to start the campaign again is not a fix. It's a pain in the ****.\n\nHelpful | 2\nDeveloper Response11 hours ago\n\nThis bug has been fixed, and you won't need to restart the game to progress!", "rachelmickMay 23 at 9:25 PM\nWorth The $$$\n\nI dont review stuff but this game was fun and well made. 10/10 would recommend.\n\nHelpful | 2", "wigginswadeApr 18 at 7:13 PM\nAmazing\n\nMy daughter just finished this after days of playing off and on, every day she would return to the rabbit hole for hours of working away at the puzzles. She enjoyed every second of it! Please do a sequel! Soon!\n\nHelpful | 3", "snipermavenMay 30 at 10:37 AM\nGlitchy\n\nGreat game but glitchy. Impossible to solve one of the puzzles in the game, so I cannot continue. Disappointing.\n\nUpdate: I did get the clock puzzle but yes, that was glitchy as well. The particular I mention now is the cheat in the clouds. The combo is impossible to enter. If it helps, its also impossible to line all up to match.\n\nHelpful | 3\nDeveloper Response11 hours ago\n\nAre you talking about the chest puzzle in the clouds where you have to get the four parts of the key to be in the correct order? If so, we've tested this puzzle thoroughly and can assure you that it's solvable (but it can be pretty tough). If you're talking about something else, please reach out to us at support@cortopia.com and we'll get it sorted. Thanks!", "inkmealMar 27 at 10:21 AM\nSurprisingly a Lot of Fun\n\nI was expecting one of the puzzle experiences like Ghost Giant... and it has that and well done. But its more like Moss with a third person control. Unique and a lot of fun. Kids and adults would both enjoy this game a lot. Highly recommended.\n\nHelpful | 6", "AlisonMoranoMay 9 at 9:33 AM\nLove it\n\nIm not great at these games - which means I probably play longer. But its beautiful to go through.\n\nHelpful | 3", "LipglossArsonistApr 19 at 8:20 AM\nImagine the delight of a 360 dollhouse\n\nImagine the delight of a 360-degree dollhouse/diorama come to life. Thats only the first of many awe-inspiring aspects of playing Down the Rabbit Hole on the Oculus Quest. You begin the gameplay as an unnamed (for a while, at least) girl whos fallen down the rabbit hole while looking for her lost pet. However, this isnt the story of Alice, but someone who traveled to Wonderland on a prior adventure. Already a fan of American McGees Alice PC game circa 2000 (Rogue Entertainment/EA), plus a lover of basically any incarnation of Alices Adventures in Wonderland (complete with my own Easter egg of the Caterpillar hidden in one of my tattoos), I was instantly intrigued by the notion of fully immersing myself into a VR Wonderland.\n\nExploring the seemingly infinite levels farther and farther down, the main objective is for the girl to find all the invitations to the Queen of Hearts party that were disrupted and dispersed as she landed in the White Rabbits den. In true White Rabbit fashion, he starts panicking that the Queen will go after his 57(!) baby bunnies as punishmentor that shed even decry, Off with his head!\n\n\nOn the search for all the invitationsand her petvarious puzzles and mind-benders must be solved to move through the levels. To navigate, the player can either use the Quest controller joysticks to pivot and go up-and-down, but much more fun is using the related vines underground for a more seamless experience. This is also more useful to essentially pull the rooms towards youa relative giant compared to the girland also a better way to search for hidden invitations. Your progress can be tracked to see if perhaps youve missed an invite somewhere before completing a level as well.\n\n\nRegarding the aforementioned dollhouse feel, one can essentially immerse their whole face into a roommuch as I wished I could as a kid to see what the dolls were seeing. The levels are rich with creativityas well as some fairly challenging puzzles along the way. The POV also switches between the gamer as a third-person observer/navigator to putting themselves directly in the girls shoes to get up-close-and-personal for certain tasks and conversations with other characters. The environment of the hookah-smoking Caterpillar prompted an audible Oh, wow! moment for my favorite character from Lewis Carrolls Alices Adventures in Wonderland/Through the Looking Glass. The game developers (Cortopia) even pay tribute to the original Sir John Tenniel illustrations at moments where the gamer has to make choices related to shaping the girls identity.\n\nPreviously, Ive mostly played Oculus Games that get me up and moving such as Beat Saber, Sports Scramble, and the hilarious/stress-relieving Drunkn Bar Fight. While Ive also started another puzzle game, the creepy Last Labyrinth, Down the Rabbit Hole is the first story-based game on Quest that instantly drew me in and was eager to uncover all the surprises and challenges, thus I completed the game in only a few sessions. However, the environment is so mesmerizingand with three possible endingsits one to share with friends and watch the amazement on their faces as well.  @deannarilling\n\nHelpful | 5", "crazygirlie89Mar 26 at 5:49 AM\nBeautiful!\n\nVery beautiful game. Took me a while to find all the letters, and I even found a few easter eggs!\nI highly recommend picking this one up!\n\nHelpful | 15", "Darkfr0gMar 28 at 12:37 AM\nA great game!\n\nI love 3rd person VR games and have been waiting for another one since Moss. Down the Rabbit Hole is a fun and charming little adventure with some tricky puzzles. My wife really enjoyed playing this game as well and she is not a big fan of VR games! Stamp of approval.\n\nHelpful | 3", "SangmoosaMar 31 at 8:56 AM\nWOW!!\n\nSo far I have enjoyed a number of VR experiences on my Quest but this game takes it to another level. The graphics really are something else. If you only buy one game it should be this one. In this period of confinement I would happily lose hours in this alternative world.\n\nHelpful | 3", "christineeveMar 26 at 6:21 PM\nBeautiful\n\nBeautiful experience, imaginative game-play. I thoroughly enjoyed every moment of this game. I found the story enchanting and sweet. I do hope this developer makes more games for VR. Thank you for such a great game.\n\nHelpful | 6", "jaxdashboltMar 28 at 5:49 PM\nCan I just live here for awhile?\n\nIf you on the fence about getting this game then go ahead and jump off because this world the developers have created is just amazing, the immersion is breathtaking and I almost lost it when I found the butter-flys \nGood jobs devs you guys are like magic genius\n\n\nHelpful | 3", "DreamCatcher07Apr 15 at 11:29 AM\nEnchanting \n\nBeautiful game!! Fantastic developers! What more can be said other than you will love it and you will not be disappointed!! \n\nHelpful | 5", "belambaApr 4 at 3:31 AM\nAmazing\n\nThis game is just incredible. The graphics and gameplay to me, is what VR is all about. I got stuck on a puzzle and the devs got straight back to me when I asked about it (which was much appreciated).\nDont hesitate to buy this game! Hoping for more like this to come to the Quest.\n\nHelpful | 2", "evandaganMar 31 at 8:48 PM\nToo short, too sweet\n\nFirst off, the game is beautiful. Great character design, environments, and atmospheric effects that make great use of the Quest's limitations. The story concept is clever, and the basic level design will have you spinning - great use of all 360 degrees. That said, I'm disappointed in the actual gameplay. Most of the \"puzzles\" are either too easy to even qualify as such, or involve tedious hide and seek: find a symbol, then dial it in on a lock box, for instance. I can't think of a single puzzle that required multi-step planning or truly made good use of VR. If you're looking for complex, spatial puzzles, I'd recommend The Room VR or Shadow Point, both of which are more challenging. If you're looking for an action/puzzle game like Moss, this is not it at all. This is effectively a linear story game/experience similar to Ghost Giant or Fisherman's Tale, with about the same level of difficulty (i.e low). Still worth checking out for the high production values and engaging story, just keep your expectations in check.\n\nHelpful | 19", "TVL1977Apr 13 at 3:49 PM\nMagical fall down the rabbit hole.\n\nWhat a lovely puzzle game..... It's kind of a magical feeling to go down the rabbit hole. Each scene is kind of a diorama. Sometimes you play 3rd person, in some cases you enter the scene as 1st person, which switches up the game a bit, and makes it interesting.\nGraphics were really nice, definitely the feeling of being in wonderland. Also very nice you can look up the rabbit hole and still see all the other scenes. You can crawl back up and down by using the roots, pull every scene towards you, even stick your head inside every room if you want..... It's really nice to see how the mechanics of this game works.\nThe story ain't that very long or hard to get to the ending, although I still didn't find all the invitations yet, but the price is definitely fair for the gameplay you get.\nInto magic, wonder and puzzles.... Then you should buy it.\n\nHelpful | 1", "Ic3W01fMar 29 at 11:53 AM\nGreat game\n\nThis is a very fun game! All in all if you like Moss you should like this game.\nSimilar to mosss 1st/3rd person, except in this game you are actually supposed to be the girl which I like so periodically it will pull you all the way into first person which I think is a very fun and cool feature! In regards to some of the other reviews yes the puzzles are not always clear but that is part of Alice in Wonder Land its a mixed up world and they accomplish that. This game also shows the potential for a game that is built 1st/3rd person cooperative play with another user. I would love to see longer game play with less liner story line (see Zelda games).\nHave fun with this game I know I did!\n\nHelpful | 2", "moon_star_Mar 28 at 6:14 PM\nAbsolutely love it!\n\nExceeded my expectations! Absolutely engaging & enchanting! Graphics, storyline, characters, puzzles, everything was amazing - one of my fave Oculus games now, top 3 for sure \n\nHelpful | 5", "martfan1800May 3 at 1:05 PM\nAmazing\n\nIt has amazing graphics but would love it in first person and I am already stuck on puzzle 2 very good game though\n\nHelpful | 2", "jasonduncan1976Mar 28 at 12:30 PM\nGreat Game!\n\nHad a blast playing this game. The graphics, colors, voice over work, animation all top tier. The mix between 3rd person and 1st person game play is one of my favorite styles. I wish it had 50 more levels. Thank you guys, absolutely a great game.\n\nHelpful | 3", "KEI0116May 23 at 4:11 PM\nDo not recommend\n\nThis game seems to give me a bad headache everytime. Tricky to control and couldve been played easier with console rather than VR. Disappointed with the purchase as I was expecting this game to be similar to The Room VR. Not recommended.\n\nHelpful | 4", "MOLATINO1Mar 28 at 1:41 AM\nCan't stop\n\nIf you want a game that challenges you ! Keeps you up trying to figure it out. well this one will.\nI have played a lot of puzzle games and after a while they have bored me, not this one. try it you'll like it.\n\nHelpful | 4", "NGxSmokeyApr 8 at 4:10 PM\nGreat game.\n\nI was at first very sceptical to the whole gamestyle. But in the short time I played the game, it was awesome. All down to the graphics, story, game mechanics, the whole style of standing over and look for clues for puzzles zooming in and out, voice acting fitting right in - and more. Completing the first 2 tabs of letters, and loving it so far.\nWouldn't recommend it to first time users, since some mechanics can be \"a bit trippy\". But overall a great game, definitely worth a try (and you get it for both platforms). All that's left, is to set your phone on silence and keep it out of reach, you won't get the joy killed by pesky phone sellers calling you in the middle of your journey. Happend to me... Urgh...\n\nHelpful | 1", "Atrox217Mar 26 at 6:23 PM\nDown the Rabbit Hole\n\nMoss, Ghost Giant, and now Down the Rabbit Hole. These are what make VR an experience beyond gaming. This is why we put a VR headset on in the first place.\n\nHelpful | 7", "melcacMay 17 at 6:35 PM\nSo detailed!\n\nLoved the detail In this!\n\nHelpful | 2", "TheJonVaughnApr 6 at 3:35 PM\nBig Fan!\n\nThis game is really really cool. At first I was unsure about Alice not being the main character of this story, but it turned out to be genius. Visually, it's beautiful and I loved that you go between first and 3rd person and switch between characters. My only critique is that I wish it were a little bit longer, but the story line is interesting and easy to follow. I'd love to see more games like this!!!\n\nHelpful | 0", "cops4jcApr 7 at 7:39 AM\nMind Blowing!\n\nThis was the most amazing game I have ever played. What an incredible immersive experience. I am a huge Disney fan and could not have asked for a better experience. I hope to see more games on this level of creativity and especially more Disney games of any kind. I would 100% recommend this to everyone. I did not want this game to ever end! Best game ever!\n\nHelpful | 1", "KillahKonceptZMar 30 at 3:31 PM\nSo far so good!\n\nTo be fair and honest I've barely scratched the surface of this game but from what little I've play so far it is very well done. I'm actually already stuck at one of the beginning puzzles but I'll get it figured out! ! Great game and beautifully done!\n\nHelpful | 2", "SizzorbossApr 5 at 3:45 PM\nCouple o three hours\n\nGreat, gorgeous intuitive graphics, they what you can pull up and down to look from any conceivable angle is ace.\nCompleted the game, but not found all the invites. Fiendishly tricky to find em all methinks. Good price for an altogether excellent fun game.\nMake sure you stream to another device, extra pair of eyes helps.\nWe changed after each level. To give us both the challenge.\nIt always looks sooooo much better in the headset, than on a screen .\nCheers\n\nHelpful | 0", "G4untApr 6 at 1:57 AM\nEntertaining, BUT...\n\nThis game entertained me for the 2~ish hours I played it, the time it took to finish it. This is a narrative experience featuring basic puzzles with a collect-a-thon feature on top of it.\n\nThe game is presented somewhat like a doll house where you explore each room by controlling the protagonist with the analog stick, while using the oculus touch to interact with various objects. to progress the story.\nThe puzzles are easy enough so you will never get stuck, and the search for collectible is really what is going to take most of your time (Although they are not that hard to find).\n\nI am writing this review because although I enjoyed the game tremendously, I was frustrated by two aspects :\n1 - For a 20 euros game, it is a SHORT experience, with close to zero replay value. Despite the game being so nice to look at, and listen to, this should be a 10 euros experience.\n2 - The endings, even with all collectibles, are underwhelming. Instead of feeling a sense of accomplishment at finishing the game, me and my GF were left disappointed to the point where we know we'll never play this game ever again. the ending are not bad per se, just flat (even with all collectibles).\n\nIn my opinion, this game should be bought on sale. It is NOT bad, it is actually pretty entertaining. But I feel I could have invested this money in games that I would play longer than 2~ish hours.\n\nHelpful | 11", "Longkn1feApr 20 at 11:04 PM\nFun game good pyzzles\n\nThis is a very clever VR puzzle game... I enjoyed it a lot. Well worth your time and money.\n\nHelpful | 3", "John.Henry.MagicApr 16 at 9:35 AM\nVery cute.\n\nIt is a sweet game with both humor and medium level difficult puzzles. A must.\n\nHelpful | 4", "ZedisnotdeadMar 26 at 7:15 AM\nGreat Game!!!\n\nThis game is worth every bit of 20 bucks. We'll put together. Good story. Graphics ....great addition to the quest library\n\nHelpful | 7", "RickK75Apr 3 at 3:11 PM\nGood but no save profiles\n\nLove the game. Looks fantastic reminds me of games like Moss and Grim Fandango. Will give it 5 stars if/when it supports save profiles which I think is a glaring omission - you can't show it to friends or family without losing your game which sucks in 2020.\n\nHelpful | 5", "PhotoGuy98Apr 30 at 9:49 AM\nGreat game just short\n\nSuper fun game just way too short. Hoping the there is a longer sequel.\n\nHelpful | 2", "ScubaRicApr 27 at 1:53 PM\nVery well done\n\nFun game, immersion is great, fun for all the family. Nice chill out gameplay.\n\nHelpful | 2", "DigitalClutterApr 8 at 10:58 PM\nStoked!!!\n\nI'm rating a 3 for now but Ill leave a full review after first impressions. I honestly can't wait to dive in already!!!\n\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\nFurther review & I apologize for the time it took for me to review back. Yes!!* I absolutely loved it.. A very magical experience you can tell the devs took the time to ensure the experience was enough for adults and children, alike. I give this game 5 stars!!! ...Its very polished and had a simply fantastic story line all of the way through. You can tell that whoever scripted DTRH had more in mind.. Either in updates maybe or buyable chapters..\nOnly lag was that it was short and left me wanting to go even further down the rabbit hole  5 stars!!     \n\nHelpful | 7\nDeveloper ResponseApr 6 at 8:47 AM\n\nHey DigitalClutter! Have you had a chance to play the game yet? We'd love to hear your review.", "T_K_OApr 21 at 7:36 PM\nAmazing!\n\nLoved every minute of it! My favorite quest game so far.\n\nHelpful | 3", "zathlonxpMar 30 at 8:25 PM\nAwesome\n\nI've played many oculus quest games, this is my favorite. Anyone who likes adventure games will love this. Reminds me a little bit of what the old kings quest games would be like if you could play those in vr.\n\nHelpful | 2", "RafaVillalba3 days ago\nNot for Spanish speakers\n\nIt is a nice game but, even when the description indicates it is translated to Spanish, there is no translation for the voices, which makes the playability lower. Also, in some word games, translation is wrong and confuses, and subtitles not always appear or show up in a place you are not seeing. I would strongly recommend to include the voices and fully test the game in each language.\n\nHelpful | 0", "Drb.danielApr 15 at 8:25 PM\nShort but very good\n\nHighly recommend this game. Great immersive Fun and enchanting in the world of Alice in wonderland . Very cool !\n\nHelpful | 2", "Miss-Mama12 days ago\nLove the look\n\nI completely love love love the look of this game. I love the game play and dialogue. I got a big glitch during the catching of patches in the tea lake (the teacup did not want to move) but I want to do it all over and play more\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHey Miss-Mama. We're glad to hear that you're enjoying the game. If you can, please send more details about the teacup issue to support@cortopia.com so we can figure out what happened. Thanks!", "spammonkey1971Mar 28 at 8:50 AM\nAm in love\n\nWhat a great little game very well done and its challenging at times the voice acti g and graphics are amazing so glad I downloaded it now if you like a great platformer like moss get this\n\nHelpful | 2", "DaleCoopMar 31 at 10:17 AM\nLoved this trip to Wonderland\n\nAmazing game and fascinating world...Hoping for a sequel or a DLC \n\nHelpful | 4", "SirRealDealMar 26 at 6:19 AM\nYour Library's Newest Edition (addition)\n\nYou're here reading these reviews. All the while knowing you're gonna purchase this fine piece of VR gaming software.\n\nHelpful | 4", "mike.kerbeMar 30 at 3:01 PM\nUnreal\n\nIf youre into solving puzzles this is awesome. Great graphics, great story and innovative vr style, its like diorama view and first person view. Excellent game\n\nHelpful | 2", "devinka.wa.5Apr 18 at 11:25 PM\nNice to experience Wonderland\n\n*Spoilers* A nice game to play, I enjoyed being in Wonderland. I completed it though I couldn't solve all of the puzzles or find all of the invitations, I wish there was somewhere to go for help with this.\n\nThe ending was a little anticlimatic. I thought I would get to explore all of the castles before gaining entry to the Queen of Hearts' castle. I would expect this as a future add-on as well as the ability to have multiple saved games and more aspects and characters from the book.\n\nNot as beautiful as Moss but worth purchasing if you are after something simple to control and pretty to look at.\n\nHelpful | 1\nDeveloper Response11 hours ago\n\nHey devinka.wa.5. The new patch adds the ability to have multiple saved games! And if you need help finding invitations or solving puzzles, there are some great playthroughs on YouTube. This is one of our favorites: https://www.youtube.com/watch?v=Sb6shLJaYOU", "czech050Apr 3 at 3:31 PM\nGreat game!\n\nBought this game for my wife, as she is into fantasy. But I ended up playing it first, and I was blow away! Loved being sucked into the story, great environment! Visually stunning! Hope more games are made like this !\n\nHelpful | 1", "Quickster1Apr 4 at 11:21 AM\nImmersive experience\n\nThis game is really fun! Ive only played half of it so far and its been great! Its has been very addicting. The graphics are great! And its awesome switching from first perspective and second perspective.\n\nHelpful | 1", "wolf01796Apr 1 at 10:25 PM\nA must buy!\n\nMade me a little motion sick but it's a good story and definitely the first game I will show my girlfriend\n\nHelpful | 3", "Kthome123Apr 7 at 4:56 PM\nSooo cute!\n\nI really enjoyed this game. I normally am not a super fan of puzzle VR games. I wanted to try something new. It was very cute and was a good way to get my feet wet with this type of VR game.\n\nHelpful | 1", "BlueEyes300Mar 30 at 9:42 AM\nMy new favorite !\n\nThe graphic and the concept was just spot on! I love the wonderland so this was my type of game. The puzzles were quite challenging but fun!! However it was short. :(. Wishing it was longer. Im hoping they can add dlc to it??\n\nHelpful | 1", "CyberBlossomApr 14 at 3:40 PM\nSuper Fun but a Little Confusing\n\nOkay, so let me preface this by saying that I am a mom. I am not a gamer but finding that I actually am enjoying this Oculus Quest. So with that in mind, let my review begin.\n\nI love the graphics and painstaking details the developers created in this game. It is so beautiful, adventurous and fun. However, since I am not a gamer, the game was a little difficult to figure out. There was like a 30 second help guide but that was about it. Once I figured it out, it was much more fun. I do wish the developers of the game would actually include instructions in the settings menu for those a little challenged.\n\nOne of my biggest crisisms is the treasure chest code unlocking. The first one was fun because you could actually find the clues to unlock it. The rest were basically a guessing game or just a process of elimination. Seriously, I wish the developers had included clues or maybe had Alice say, \"Umm, I remember I saw a clue in (insert room name). Or something like that. Maybe there aren't any clues and if there aren't, then they should be included on the game.\n\nBesides that, I really really really enjoyed the game and would buy it all over again. I do wish it was longer though. I had it completed in 3 days with about an hour of play each day.\n\nHelpful | 1\nDeveloper ResponseApr 16 at 9:56 AM\n\nThanks for the feedback, CyberBlossom! We agree that those chests are pretty challenging. Fortunately, they're optional! For most of the chests, you can find clues in the environment. For example, in The Estate, the Diamond is matched with the Book, since the book has diamonds on it. And the Mirror is matched with the Chess Piece, since they are facing each other in the previous area. Feel free to reach out to us at support@cortopia.com if you have any more feedback or questions!", "cloud.xsdApr 10 at 2:24 PM\nFun, Wacky, Smart\n\nThis game. As a fun of all things Wonderland this is a hit for me. I love the sound track the puzzles and the atmosphere. Replay value is definitely there\n\nHelpful | 1", "borenoMar 31 at 3:12 AM\nGreat use of VR\n\nGreat visual and immersive experience and a entertaining gameplay, I love it!\n\nHelpful | 3", "wgdApr 3 at 12:10 PM\nDown the Rabbit Hole\n\nOutstanding game! Beautiful and fun to play. Definitely want to see more games like this for the Quest.\n\nHelpful | 2", "LerdpooApr 4 at 10:51 AM\nGreat navigation\n\nThis game was great! Loved how you moved from one location to the next. You could see every inch of the game. Wish it was longer, but like how there are multiple endings.\n\nHelpful | 1", "Denisio7Mar 27 at 8:36 AM\nEnchanting\n\nWonderfully made!\nI love games in this scale. Hope we get a DLC in the near future!!\n\nHelpful | 3", "Virtual-LifeMar 28 at 2:01 AM\nFantastic\n\nBeautiful and charming game. Worth a purchase.\n\nHelpful | 4", "SunshineNurseMar 28 at 11:52 AM\n\nSuper awesome. Way to short though. I love that there is NNNOOO violence, a very relaxing game thx. Plz add more to the story.\n\nHelpful | 2", "electronjoeMar 28 at 9:11 AM\nUnbelievable\n\nOne of the more defining experiences I've had in VR at this point. So excited to share it with family and friends.\n\nHelpful | 2", "nobleAlchemistApr 4 at 12:55 AM\nMoss but less challenging\n\nDefinitely Moss-inspired. The graphics and VR experience are actually better than Moss. There are not enough puzzles and the puzzles are not very challenging, which makes for a short game.\n\nHelpful | 3", "MatthewThomasMDMar 26 at 12:35 PM\nFANTASTIC\n\nBeautiful game!\n\nHelpful | 5", "Spencer1717Apr 4 at 11:37 AM\nBeautiful and charming\n\nThis game is amazing. Its very reminiscent of Moss. The graphics are great, the games are challenging but not so much so that you want to throw the console. My only complaint is that its VERY short, much shorter than Moss. I wish there would have been at least another 2 hours worth. I probably finished this in 2 or 3 days - 30 minutes at a time. But well done. Hope there is a round 2!\n\nHelpful | 1", "guy.talmorApr 7 at 7:33 AM\nVery well made puzzle game\n\nGreat graphics, storyline, and controls. Game uses multiple view points according to need which makes it more interesting.\n\nHelpful | 1", "interface7Mar 27 at 12:11 AM\nImmersive Fun\n\nIts whimsical puzzles and graphics will definitely take you into a nice Wonderland suitable for a great escape during these trying times of our lives.\n\nHelpful | 5", "JenspadMar 30 at 6:32 PM\nReally liked this!\n\nI enjoyed this game a lot especially the way you can pull the tree towards you and peek into all the different rooms the only thing that would have made it better is if it was longer of course and also it seems impossible to find every single invitation. This is fun and appropriate for all ages and the puzzles although challenging are not so hard that you have to pull off your headset and go look up a gameplay video. The other thing that's cool is you can change the ending based on your decisions throughout the game I'm pretty sure you have to complete it in full to get a certain ending. 4.5 stars!\n\nHelpful | 1", "pw11326Apr 8 at 2:21 PM\nScreen going crazy\n\nVery good until about half way through the screen started going crazy, making it unable to proceed. All fixed\n\nHelpful | 0\nDeveloper ResponseApr 8 at 1:11 PM\n\nThat's the first time we've heard of anything like this happening! If you send us an email at support@cortopia.com, we can help you figure out what went wrong!", "AbbycornApr 5 at 4:17 PM\nOnly one memory slot\n\nI think this is a great game but it only allows for one memory slot for one player. I dont want to play over my daughters game but I would like to play through the game too and save in my own memory slot\n\nHelpful | 4\nDeveloper ResponseJul 7 at 5:06 PM\n\nThanks for the feedback, Abbycorn. The new update adds multiple memory slots, so now you can play without overwriting your daughter's save file. If this improves the game for you, it would help us a lot if you reconsidered your review. Thanks!", "CongratulationsMar 30 at 3:57 AM\nIts Good.\n\nI found it enjoyable havent found all the invitations, Ive got the the end and finished. It also needs more collectibles just collecting invitations seems not enough. Maybe add other collectibles like cards or statue etc. Its a polished game no bugs that I didnt bump in to.\n\nHelpful | 0", "andrew.muz.3Mar 30 at 12:47 PM\nDown the rabbit hole\n\nGreat concept and very original \n\nHelpful | 2", "Okami77Apr 7 at 4:42 AM\nWhoah......\n\nI love to dive deeper in this hole !!\n\nhttps://youtu.be/84Jo4zu4y5E\n\nHelpful | 0", "gism0eJun 29 at 12:34 PM\nLove this puzzle game\n\nThe graphics are 1st class the game play for me is brilliant seeing Im not that great at puzzles I only gave it four stars because I would have liked to be able to by a press of a button to be in any of the rooms full size and it would be great if my kids could independently save the point they reached so they both can go back to were they left off\n\nHelpful | 0\nDeveloper ResponseJul 7 at 5:14 PM\n\nThanks for the feedback, gismOe. The new update adds multiple save slots, so now your kids can both go back to where they left off.", "neverWantedApr 4 at 10:38 AM\nAbsolutely loved it\n\nVery entertaining! Cant wait to play again to get different endings\n\nHelpful | 1", "danv1710Apr 10 at 11:57 AM\nAmazing!!!\n\nA wonderfully beautiful game\n\nHelpful | 1", "StoicGuardianApr 10 at 1:39 PM\n\nLove it!\n\nHelpful | 1", "CyberAnApr 11 at 2:30 PM\nToo short\n\nIt's better to call this game a demo\n\nHelpful | 11\nDeveloper Response11 hours ago\n\nHey CyberAn, there are hidden invitations and multiple endings to unlock if you're looking for an excuse to spend more time in Wonderland!", "RauelRualbeApr 14 at 2:59 AM\nNot a fan of 3rd person BUT\n\nNot a fan of 3rd person games but I have found this quite enjoyable. Haven't finished it yet, but suspect I am nearing the end?\n\nHelpful | 0", "krxskyJun 23 at 1:46 AM\nDelightful Puzzle\n\nGame is well made and delightful to play. It has a beautiful presentation similar to Moss with occasional first person aspects. For me though, the puzzles are not as captivating as some other puzzle games (ie. ieytd, shadow point). The overall experience is great though.\n\nHelpful | 0", "VillagerVillager7 days ago\nToo Hard\n\ngood game but there is way way too hard puzzle in the intro\n-100 stars\n\nHelpful | 0\nDeveloper Response11 hours ago\n\nFeel free to contact us at support@cortopia.com! We're happy to help!", "erasmushurtMar 29 at 4:44 AM\n\nThe puzzles can be confusing at times and not all that obvious. The mechanics are interesting though.\n\nHelpful | 1", "johnnyotvApr 6 at 3:15 PM\nAmazingly magical!!\n\nI could not even believe what I was seeing right from the start, it is an incredible experience! It is completely unique to anything I have seen in VR, I was dazzled by the details and it reminded me of something you would experience at a major theme park (even pay extra for!). With productions like this, it is clear that the future is here for VR entertainment. It is the kind of thing that must be experienced to be believed!! I can't wait until I can make another trip Down the Rabbit Hole!!\n\nHelpful | 2", "PTP400Jul 1 at 2:21 PM\nGreat game\n\nGreat game if a little short. Great graphics and puzzles. Wanted more!\n\nHelpful | 0", "WisheddarknessJun 30 at 9:32 AM\nSuper cute and lovely\n\nWould recommend to friends!\n\nHelpful | 0", "JacmuslJul 7 at 8:00 AM\nBoring\n\nHonestly quite dull. Being VR added nothing.\n\nHelpful | 1", "AlexLenApr 5 at 1:35 AM\nNice way to use the potential of VR\n\nThe game is much more interesting than it seems at the first glance. I thought it was a point & click at first but it is a great combination of 1st and 3rd person game ... voice acting is spot on and the characters are nicley designed ... the last invitations are hard to find and the only thing missing is the the extra content after you find them all ... that is the only reason for 4 star review ... otherwise would be a 5 star ... More please\n\nHelpful | 1", "jabara97Mar 26 at 12:32 PM\nNice game!\n\nReally enjoyed it.\n\nHelpful | 4"]