{"App Title": "Dreadhalls", "App description": "Experience a new kind of immersive horror in Dreadhalls!\n\nYou are trapped deep inside a massive dungeon. Explore it, survive it, and find a way to escape. Your only weapons will be stealth, your own courage, and a faint light.\n\nInspired by the survival horror and roguelike genres, Dreadhalls has been terrorizing people ever since its debut at the 2013 Oculus + Indiecade VR Jam.\n\nDreadhalls is an intense and scary experience, not for the faint of heart. You have been warned!", "Purchase section": "$9.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Exploration, Horror", "Languages": "English, French (France), German, Korean, Spanish (Mexico)", "Version + Release Notes": "1.6.19", "Developer": "White Door Games", "Publisher": "White Door Games", "Website": "http://www.dreadhalls.com/", "Release Date": "October 3, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "End User license Agreement (EULA)\n\n\nThese license terms are a legally binding agreement between you and White Door Games, S.L., governing your use of White Door Games applications, games and services (the Software). These terms, as updated from time to time in accordance with this EULA, apply to any demo / trial version, updates, DLC, enhancements, support and internet based services associated with the Software.\n\nBy using, installing, downloading or making any copy of the software, you accept these terms. You also consent to provide us with certain information as set out in these terms. If you do not accept these terms, you must not use the software, and must remove and delete or destroy any copy of the software in your possession.\n\n\n\n\nOwnership of the Software\n\nWhite Door Games, S.L. retains ownership of the Software, and reserves all rights in the Software. No proprietary rights are assigned or transferred under this EULA. You may not copy, reproduce, modify, alter, adapt, translate, decompile or reverse engineer the software except as permitted by law or this EULA. This EULA does not give you any right to sub-license the Software.\n\n\nGrant of license\n\nUpon payment of the applicable license fees, we grant you a non-exclusive license to use, copy, install and enjoy the Software for your personal non-commercial use, subject to the terms of this EULA.\n\nYou cant sell it, rent it, or use it for commercial purposes (such as an internet cafe, arcade, or public library)  for these uses please contact us to discuss a commercial license.\n\n\nRestrictions on Use\n\nUnless otherwise permitted by law or this EULA, you must not:\n(a) work around any technical limitations in the software;\n(b) reverse engineer, decompile or disassemble the software, or disclose the algorithmic nature or describe any part for the source code or inner workings of the Software;\n(c) publish the software for others to copy;\n(d) use the software in any illegal or immoral way, or for any such purpose;\n(e) use, copy, rent, lease or lend the software; or\n(f) create any derivative work or program to mimic the data or functionality of the Software.\n\n\nThird Party Components\n\nThe Software incorporates some third party components, which are subject to applicable third party software licenses and privacy policies, incorporated by reference. A list of these third party components is available upon request.\n\n\nBY AGREEING TO THE TERMS OF THIS EULA, YOU AGREE TO BE BOUND BY THESE APPLICABLE THIRD PARTY SOFTWARE LICENSES.\n\n\nBackup Copies\n\nYou may create a backup copy of the Software, in its entirety (including a copy of this EULA), for your own personal data recovery purposes, or otherwise as permitted by law. You may use this copy only to reinstall the Software, subject to the terms of this EULA.\n\n\nSoftware Updates and DLC\n\nWe may release updates, patches, DLC, or new versions of the Software from time to time. You have no automatic right to any updates or DLC, but where we choose to provide these to you, they shall be considered part of the Software and shall be governed by the terms of this EULA.\n\n\nResale\n\nThis license is not transferable. You may not sell, rent, assign, transfer or novate your rights or obligations under this EULA.\n\n\nPrivacy\n\nUsage of the Software is subject to our Privacy Policy, incorporated by reference. Our privacy policy is available on our website at www.whitedoorgames.com/privacy or upon request to info@whitedoorgames.com\n\n\nLets Play Videos and Fan Made Content\n\nYou may create fan content (including Lets Play videos) incorporating videos of actual game play, and may publish and monetize your fan content. All such fan content must be respectful to our industry, company and the Software. We reserve the right to revoke this permission at any time and for any reason by notice to you. Upon such notice, you must immediately remove the fan content from distribution.\n\n\nIndemnity and Limitation of Liability\n\nWe only accept liability to you as set out in this clause, or as required by consumer or other laws that cannot be excluded by contract. All other implied conditions or warranties are excluded. To the fullest extent allowable at law, any condition or warranty which would otherwise be implied in this EULA is excluded. We make no warranty as to fitness for any purpose, performance or compatibility.\n\nTo the extent allowable at law our total liability is limited to (at our election), repairing (updating) or replacing the software, resupplying the services, or refunding the price you paid for the software and services.\n\nYou agree to release, indemnify, defend and hold harmless us, and our officers, employees, agents and contractors from any and all liability or for claims associated with or arising from the misuse of the software by you or by anyone to whom you allow to access the software.\n\nTo the extent allowable at law, you agree to release and hold us harmless from any claim, allegation or demand for any loss, cost (including legal fees), expense, or damage arising in relation to:\n(a) your breach of this EULA;\n(b) any indirect, special or consequential loss;\n(c) any act, default, omission, or representation made by any person other than us, our agents or employees; or\n(d) any cause independent of human control that occurred after the software or services were supplied.\n\n\nSeverability\n\nIf any of these terms are held to be invalid or unenforceable by a court of law, that part will be excluded, and the remaining valid terms will remain in full force. This EULA does not affect your rights in relation to any third party from whom you acquired the Software.\n\n\nEntire Agreement\n\nThis EULA, and those documents expressly incorporated by reference, contain the entire agreement between the parties and supersedes all previous negotiations or agreements relating to your right to use the Software.\n\n\nUpdates to this EULA\n\nWe may update this EULA from time to time by notice on our website, or by including the updated EULA in a Software update. Such variation will be effective upon posting those notifications and changes on our website, or your installing the Software update, without further notice to you.\n\n\nWaiver\n\nAny delay or failure to exercise or enforce our rights under this EULA will not be construed as a waiver of those rights, nor preclude any future exercise of those rights\n\n\nLegal Fees\n\nIn the event that we obtain the legal assistance to enforce this EULA for your apparent breach of these terms, all legal fees (on a solicitor own client basis) incurred in enforcing this EULA may be recovered from you.\n\n\nDispute Resolution\n\nYou agree that in case of a dispute or claim, you will first attempt to informally negotiate a settlement or resolution of the dispute by contacting White Door Games, S.L. and informing us in a comprehensive way of the grounds of your dispute before resorting to any legal action.\n\n\nJurisdiction\n\nThis EULA will be governed by the legislation of the Kingdom of Spain, and the parties submit exclusively to the courts of that jurisdiction.\n\nThis EULA establishes certain legal rights, but you may have other legal rights under the laws of your state or country. This EULA will only change your rights under the laws of your state or country to the extent permitted by those laws.\n\n\nRepresentatives, Successors and Assigns\n\nWe may assign or novate our rights and obligations under this EULA at any time by notice on our website. Upon such assignment or novation, our obligations and benefits under this EULA are binding on and shall benefit our respective representatives, successors and assigns.\n\nPlease direct any questions, comments or concerns about this EULA to info@whitedoorgames.com", "Space Required": "519.3 MB"}



["5 stars\n74%\n4 stars\n13%\n3 stars\n6%\n2 stars\n3%\n1 star\n4%", "Banja78Jun 17 at 12:22 PM\nNot sure I will finish this one\n\ni was curious of the potential of VR for horror so I played this game for 20 minutes to give it a try and never opened it again since. Maybe I will play it again, maybe not - It is so terrifying ! That game on a 2d screen would be boring but in VR, being in it, my bones were shaking.\n\nGotta be fair - an horror game that is so frightening that I am not sure i can finish it deserves its 5 stars.\n\nHelpful | 96", "buttwiserJun 25 at 5:41 PM\nAbsolutely amazing game\n\nIm the type of person that doesnt get scared easily like if I go to a haunted house I expect things to happen and I dont get scared but this now this is a whole new level I was laying in bed thinking to my self I bet this wont scare me Ill be expecting things to happen I was 100% wrong my roommate came out his room with a gun when I yelled oh Sh*t extremely loud cause of the jump scare so far I love it I hope to get even more scared Im get drunk and play it to see if it makes it even more scarier so if yall want a scary game to play definitely worth the $10 money well spent I dont regret the perches at all I hope everyone gets the scares that I get \n\nHelpful | 31", "christopherschulzJul 10 at 12:44 AM\nSo scary that I pooped in my pants \n\nThis game is absolutely terrifying. I am a horror game veteran. I've played them all such Dead Space, Silent Hill, Resident Evil, The Evil Within, Outlast and more. No joke, I literally had to take the headset off a number of times to calm down. The narrow hallways, the dark rooms, the sound and music design, the enemy design and the jump scares sent me into a fit of horror that literally made my heart race. I'm currently waiting for my new underwear to arrive at my house so that I can go outside the house again. But, considering I just bought my Quest, that probably won't be happening for a while. But who's going out right now with Covid-19 anyways right? Definitely worth the price! If you love horror games you won't regret buying this!!!!! \n\nHelpful | 10", "Ihrie3 days ago\nFantastically creepy atmosphere l\n\nHavent finished it yet, but so far really enjoying it. So far considerably better than Exorcist Legion VR IMO if your looking for something to get that blood pumping.\n\nHavent checked out the replay ability yet but so far seems like a no brained if your after a horror themed title. Oh and the price is top notch.\n\nI know its a older VR title which was ported to the quest, but it is definitely a gem and a must buy game in my opinion.\n\nHelpful | 1", "taylorbug1Jul 16 at 5:48 AM\nterrifying game\n\nThis game didnt seem scary but as a horror lover I decided to try it. So I bought the game and literally the loading screen gave me chills. I played it for about 20 minutes and had to take it off. THE ABSOLUTE MOST TERRIFYING GAME EVER! Im probably ganna get back on it but after I eat a gallon of ice cream with all the lights on watching spongebob.\n\nHelpful | 5", "jtf196022 days ago\nVery Creepy\n\nI've always loved haunted houses but the ones in the real world no longer scare me. I just laugh at them. I don't laugh at Dread Halls! This game makes my skin crawl! The first several times I played it scared me so much I could only stand a few minutes at a time. Once or twice I had to rip the headset off my face in horror because I was getting too scared! Being immersed in this house of horrors makes it almost too real! If you want to be scared then buy this game! It is well worth the money!\n\nHelpful | 2", "thechrisstreet10 days ago\nAAARRRRRRGGHHHHH!!!!!\n\nHaving seen this on the storefront for a reduced price, I was undecided on Dreadhalls. So I watched a few Youtube videos and kind of wish I hadn't - I think I would have enjoyed this game even more had I not spoiled things for myself. But still, I decided to download it.\n\nSo... Dreadhalls. A game involving (mostly) randomly generated labyrinths. The goal? Collect eyeballs and find the exit. I didn't see how it could be that scary and OHMYGODAGIANTDOGTHINGISCHASINGME!\n\nYes, Dreadhalls is reliant on a few scares. They're not jump scares as such, but scares in the sense that you're walking too quickly, turn a corner, and bump into something.\n\nThe labyrinths are very detailed graphically, and extremely claustrophobic. It's this sense of enclosure that makes me feel uncomfortable when I play. Second only to Condemned: Criminal Origins, this game is probably the scariest I have ever played. I had to frequently take off the headset to collect myself, before diving back in for some masochistic torture.\n\nDifferent monsters appear within the mazes, and your only shot is to outrun them - they cannot be killed. There aren't a huge number, but it's enough to make you wary of every corner. Even though I try and anticipate these things, they get me every time.\n\nEven the title screen makes me feel uncomfortable and edgy.\n\nWould I suggest any improvements? Only one. It would be nice to see a few more types of environment. The lack of visual variety can grow a little stale and I would imagine it would be as easy as adding new textures onto the walls.\n\nWould I recommend Dreadhalls? If you have a heart condition, absolutely not. To everyone else? Absolutely. Just be prepared to have a change of trousers nearby.\n\nHelpful | 0", "RoreoOreo10 days ago\nNot as scary as I hoped\n\nI loved this game when I got it, i had a lot of fun playing this and trying to analyze the lore. This game is longer than most games on the quest and the only flaw I have with this game is its not a scary as I expected. Sure it is scary at some parts like when gargoyles move or a loud noise plays but those jump scares just shook me up a bit. If they made it so when you die theres a loud jump scare. Kinda like five nights at Freddys. This would definitely be 5 stars\n\nHelpful | 0", "DoxocubesJul 8 at 5:41 AM\nWow\n\nOK, definitely the scariest game I've played in a long time. Can only play one maze at a time before it's too much and love coming back to it. One thing that I hope the devs will ad is a way to customise a random map. For people who have not installed, each map is randomly generated. So I wish you could choose what monsters you have and how often they will spawn. Apart from that amazing game if you like tension and scares.\n\nHelpful | 3", "AnimatedLegend23 days ago\nIntense\n\nFrom an overall gaming standpoint it's a 3-4, but from a horror VR experience perspective it's definitely a 5. Absolutely terrifying to the point of being difficult to keep playing (assuming you're actually immersing yourself and playing alone). Would 100% recommend getting it if you're into anything horror-related. You won't be disappointed.\n\nHelpful | 0", "ajaswinskiJul 13 at 12:41 PM\nDEFINITELY SCARY\n\nIf you want a sense of dread, this is it. There seems to be a fight. DREADHALLS V THE AFFECTED. Both are excellent but different experiences. Affected is a scary fun haunted house tech demo. Dread is a very frightening singular experience because the design can be rewritten. Affected is a great party VR. Dread is a lone person with a lantern that needs to be relit. Your choice.\n\nHelpful | 2", "KrymBaltimoreJul 26 at 5:07 PM\ncreepy as hell!\n\nme and my niece (14) have been playing this together for months now and taking turns when one of us has had too much of the creepy music and sound effects making our hearts race to continue. the ever changing maze of environments are eerie enough to keep you on edge and feeling lost and horrified continually. that coupled with the fact that the game is never the same and the creatures can pop up anywhere at anytime to get you keep it fresh and new every time you play it. dread halls is definitely NOT for the weak hearted! only complaint i have is the same that i have with a lot of vr games and that's multiplayer support. it would be great to play this with a friend or two and laugh at how terrified each other are when the devil  looking monster is tracking you beyond where you thought he would or running into \"her\". overall excellent game and i highly recommend it. add multiplayer, 5 stars easy.\n\nHelpful | 0", "dayan.garcia.9212322 days ago\nScarriest game I've played so far\n\nIve played a bunch of scary games but this one takes the cake when you leave a dungeon and load back into a game it's a different dungeon with a different location for the eye and different enemy's in different places.\n\nHelpful | 1", "ryanlexjackson19 days ago\nBeyond scary\n\nAbout 25 minutes into the game and not sure if I can keep playing. Had to stop multiple times due the intense experience. Dont consider myself a scared person overall but this really gets to me\n\nHelpful | 0", "getbosJul 7 at 11:44 PM\nWhats that wet spot on your pants?\n\nThis game is really scary! I couldnt get out of the 1st hallway so I turned it off. Then I put it back on and played a random map and some demon snuck\nup on me and I peed myself.\n\nGet this game and play with your friends!!!\n\n(Bring extra underwear)\n\nHelpful | 2", "maddog.broncosJul 8 at 10:32 PM\nAmazing\n\nMe and my friends absolutely LOVE this game, we are terrified but are hooked, we are on a mission. Its so fun and exciting, weve come up with a system so that we arent constantly stopping it to take a chill break we watch threw the casting on my phone with the headset partly on my head so that we can still see whats going on, Ive gotten killed to many times to count but Im hooked on this great, terrifying game. And any horror game that can shake me and my friends is worth a 5 star review.\n\nHelpful | 0", "DAmonsterboyJul 26 at 12:43 PM\n\nIts a very good looking game, and its cheap! You will get the spooks right away. The game play is solid, had no problem with the game. If you are looking for a good horror game, look no further. Solid 5 stars!\n\nHelpful | 0", "daddydinklage22 days ago\nIts in the name\n\nThere are hallways. There is dread. The monsters themselves aren't scary on their own, but in numbers they can mess you up and ruin your day.\n\nHelpful | 0", "airkevbo26Jul 12 at 6:19 AM\nIntense!!\n\nThis is definitely not a game for the weak at heart. As a horror movie fan, this game is perfect for me!! I absolutely love it!! The rush after playing it is intense! It's great fun not just for the player, but anyone watching and laughing at the jumps and screams!\n\nHelpful | 0", "loca1Back5t4bberApr 15 at 8:32 AM\nScary at first.\n\nFirst of all I love this game it is amazing and utterly terrifying. When I first started playing I was horrified I would turn around see a shadow monster, then immediately take of the headset. But because of the lack of randomness and the safety you feel in the halls I rarely get scared playing this game anymore . For example the only time I get scared is when blind boi spawns right around the corner, or when Im stuck in a room with meatball. But I have put a good amount of time in this game and Im still not bored, because of the random map this game has a ton of replayability, but after a while it feels like an arcade game. This is not a bad thing, but it could be better. That being said one thing I can say for sure its that this game is a must have on the quest.\n\n\n\n\nMessage for the devs: If your reading this you need to add more monsters to the halls. And you should make it to where the other monster can roam/spawn in the halls. As an example you could make a stand for a gargoyle in the wall that way you have to keep your eye on him until you round the next corner.\n\nHelpful | 34", "Darkking7734Jun 24 at 2:57 AM\nRuns smooth and looks great\n\nThis game is really spooky. It's appropriate for most kids bit is scary. It runs really smooth with no eye strain. It also looks great for what it is and the hardware running it. I recommend buying it.\n\nHelpful | 4", "desireestorm666Jul 4 at 11:21 PM\nVERY.. intense... scary music... afraid\n\nI love the concept... music makes it worse.... afraid to turn the corner... always need a glass of red dry wine to relax me...I love it ... please make more.\n\nHelpful | 3", "jimmy.emmons.9Apr 27 at 6:49 PM\nTerror\n\nI have never in my life been more afraid. I bought this for a party. I am 6-1 272 pounds. I shook in my boots and cried. I only could play for a total of 5 minutes. The whispers behind my head made me break down into a fetal position. I am not ok.\n\nHelpful | 36", "wil.hunter.7May 16 at 1:41 AM\nDreadhalls excellent\n\nThis game is awesome and very clever how the developers create an environment that encourages the user to engage in their own fears. They have successfully provided enough atmosphere and scope that the users own imagination runs riot with thus creating a fear that they have initiated but the user intensifies with their own mind. TERRIFIC!!!!\n\nHelpful | 6", "latinospackman123Jul 25 at 2:16 AM\nGreat\n\nYou have got to play further in the game to get to the good stuff cause when you get to the third or fourth eye it picks up and gets a lot more scarier.\n\nHelpful | 0", "Gilbandin123Mar 5 at 9:26 PM\nDEVS TAKE NOTICE PLEASE!\n\nI really love this game, I mean, reeeeaaaaly love this game, but there is a flaw to it and id love to point it out. No, it isnt a glitch, your game so far is glitchless. What I wanted to point out was that most of the game is walking down the narrow halls, when nothing spawns in them except the guy thats attractive to light, and thats it. Id love atleast one more creature that spawns in the small halls and roams. The reason to this is because I know wher the dogs can spawn, the floating head can come out of wells, the old hag can spawn in rooms that you open, and I have never seen the shadow men in halls either. The times that I have been scared the most is when Im in a hall, not expecting anything because everything else spawns in other notable places, and then BOOM! Theres that blind guy right in front of me. You see, the halls and the really large rooms are the safest places out of all of them, and it would strike more fear if there were things that can go into them. It would give the player a feeling that he is even more defenseless, and that is what I would truly love. I hope you add something like this soon, and If you did read this, thank you. I wish you luck with your new games.\n\nHelpful | 166", "jntevans03Jun 27 at 6:42 AM\nNeck hair standing!!!\n\nThis is truly a scary game. You feel as though you are there and the noises just add to the fear. It was definitely what we were looking for.\n\nHelpful | 3", "Apple-with-a-gunJun 29 at 6:00 PM\nTHE VR HORROR GAME\n\nThis is going to be the horror game that I go to every time I want a fun yet scary experience, until fnaf vr comes out on quest, this is my favorite scary game!\n\nHelpful | 2", "boutzillaJul 20 at 9:41 PM\nBetter than expected\n\nThis actually freaked me and my family out and Im not usually the one to scream when watching horror films.\n\nHelpful | 0", "MeisPiiZzaCaTJul 14 at 12:06 PM\nShow your friends. Play random.\n\nFun game with a bunch of spooks at the start. However as far as making a good horror game, they did not aim to achieve anything special or make anything unique because the campaign just makes random mixes of with every monster straight off the bat and throughout the rest. This is not limited to the amount of sounds that you will here that pop up with no rhyme or reason but to try and scare you.\n\nHelpful | 2", "CaptainMilkJul 16 at 2:31 PM\nBest VR horror game EVER\n\nThe randomly generated dungeons makes everything fresh and scary, and it's simple enough for new people to try\n\nHelpful | 0", "alphadog30934Jul 10 at 1:16 PM\n\nThis is probably one of the best horror games I've played on vr i would recommend buying this one and let you're friends and family try it out\n\nHelpful | 0", "TheDude0709Apr 28 at 4:43 PM\nBest horror game on Quest... Easy\n\nThis game is so much fun. Even after beating the short \"story\" mode it is still fun to play random dungeons... It is a great thriller and it is great that it does not rely on jump scares at all... The horror is in the game's mechanics... 10/10 would be scared again by a amnesia want to be blind creature...\n\nHelpful | 6", "PantaloonaticJun 15 at 12:14 PM\nI died a little. In a good way.\n\nThis is basically a vr version of Amnesia and its just as terrifying. It plays well and smoothly and the scares will make you sweat. Overall, great horror game.\n\nHelpful | 3", "SChargerApr 24 at 10:58 PM\nScary Scareeeeey!\n\nGet ready to jump and scream. It was the music that got me. Got me so scared had to stop playing a couple times, only to go back, make me conquer my fears, and try again. So scared had to make my daughter stand next to me so I didnt feel alone..lol Loved it! Dropped to the ground laughing so hard when my daughters would scream, only to have us try to talk each other into playing. Scarey, fun, gets your heart going. Recommend.\n\nHelpful | 5", "josephezrachaimApr 19 at 7:18 PM\nToo afraid to play\n\nnot gonna lie. i can only play this game for like 5 minutes at a time ... if that. the second i hear a creepy voice i have to stop playing lol. or when You see something creepy thing staring at you from across the room omg. for real awesome game. but im a 30 year old man and this scares me to my core... i always afraid of RE and Silent hill games as a kid so just a phobia more than anything. anyway, if your not a baby like me im sure you will love this. i love the game too but just in very short spurts lol\n\nHelpful | 8", "MuddyBudMay 11 at 10:17 AM\n1 tension breaker\n\nI was running down the halls, getting away from an eyeless witch! I found a side room and went into it! I was told there would be a floating head coming out of wells, and lo and behold, a well. A started to see something coming out of it, but my lamp ran out of fuel and everything went dark. A grabbed oil and put it into my lamp! When it lit up and so terrified to see... no wait, I was laughing. The head looked like dirty bubble from spongebob with RTX shaders on. And the cherry on the cake I heard: nnyehhh! It wasnt an HD flying meatball anymore, it turned into an angry boi. My suggestion: a redesign. Maybe a screaming and sobbing head with the spinal chord still attached? I dont know. Anything is better than the dodgeball from elementary school covered in wet sand that we have over here. Thanks. Otherwise, amazing game! Little short though.\n\nHelpful | 2", "lawsyx39Jul 27 at 12:19 PM\nFirst purchase but made me sick\n\nMovements in this game are not good , vr needs to flow to feel real and they don't, right and left movements swing and jar this is the problem .\n\nHelpful | 1", "Jiggs56May 17 at 4:46 PM\nHelp\n\nI don't like it. So scary. I hate thing in hallway. Open door, there is girl. Don't look at girl. Scary. Giant floating meatball going to kill me. Buy this game. So good.\n\nHelpful | 4", "JustNarniaJun 14 at 4:14 AM\nI WANT MORE T^T\n\nThis game is amazing!! But I want there to be like a dlc pack! To add more to the story!! Like in the desert halls I was imaging a giant scorpion to pop up but moooo TT\n\nHelpful | 1", "Rick_R-347Apr 13 at 2:41 PM\nI'm a man Darnelliot!\n\nI still haven't beaten it. Eff you I'm scared. I live in the ghetto. I have big gangster guys trying to play it cool getting the first eye,soaking wet sweating through my headset. It's the best. I go back every day and every day I'm like why do i wait for everyone to go to sleep for this? Nope.\n\nHelpful | 5", "nishruu2Jul 9 at 2:55 AM\nfor what it is\n\njust dont look at her...lol\n\nHelpful | 0", "lizbrown37Jun 7 at 6:23 AM\n\nSo scary and fun!!! Exactly what I'd expect from a vr horror game.\n\nHelpful | 1", "znanneyMar 15 at 7:32 AM\nPanic Inducing!!\n\nThis horror game is the one that makes me squeal in fright. The Exorcist forces you to face the demons, Affected lets the scaries go away, and Face Your Fears plays with common phobias. Dreadhalls makes you panic, sweat, and scream. Managing your oil lamp, keeping your bearings, and the different monsters that are out to get you are a perfect combination for a frightening good time!\n\nHelpful | 6", "rodg15Mar 20 at 1:09 PM\nDeadhallss\n\nJust finished the main storyline game. It took a few weeks because dang this game is scary. I need to work up the nerve to play a level at a time. Great graphics.. VERY immersive. Good replay value to due to random generated maps.\n\nHelpful | 6", "wgdJun 2 at 1:23 PM\nOnly Average\n\nAfter reading the many positive reviews I was disappointed with this game. The graphics are just OK and it becomes very repetitive after you have played it for a short while. Unlike others I didn't find it scary but at times did experience some motion sickness.\n\nHelpful | 1", "TMcMullenJan 17 at 10:54 AM\nFinally beat it (Info on length of game)\n\nLike a lot of people, I had a hard time playing this at first. Being new to VR, first it was the motion sickness. I quickly remedied this by playing it for a short amount of time at first and also by using my body to turn directions rather than the toggle.\nMy second challenge to overcome was just plain fear! Getting your first two eyeballs not a lot happens , but then everything changed! I had a really hard time playing after this because I kept screaming and ripping my headset off. I kept scaring my dog and gave my husband multiple heart attacks as he was taking a nap on the couch!\nBut....my desire to beat this was stronger than the \"dread\" I felt when about to restart the game. The only way I was able to get past the ripping off of my headset (and dying because of doing so) was to read a blog someone wrote when I googled Dreadhalls tips. It was called \"The monsters and how to deal with them\". After this I was able to think of the monsters as more of a game element rather than just scary!\nIt took me a long time to get my 3rd and 4th eyeball (Paying closer attention to the map helped). After I got my 4th eyeball I felt sweet success until I realized there was now a set of 3 more eyeballs to get! Then I got determined to beat the game once and for all! So I blew through this next set (I actually found it got easier on this set) only to find out there was another set of 3 more eyeballs after this! I blew through this too although it got more challenging again! It took me a few weeks of playing short sessions to get my first 3 eyeballs, but after my determination kicked in I got the next 7 in a few hours.\nThe length of the game is as follows: 1st set of 4 eyeballs, 2nd set of 3 eyeballs, 3rd set of 3 eyeballs, ending \"ceremony\" of two eyeballs, sweet freedom!!!\nEven though I still had a sense of \"dread\" starting down each new tunnel the feeling of relief every time I found an eyeball was exhilarating! Time to replay!\n\nHelpful | 49", "StoveHengeJul 17 at 11:25 PM\nExactly what I was looking for\n\nThis game may not be top tier graphics but in VR I dont find that to be 100% important. Other than that, it's super smooth, I played for an hour and didnt get motion sick (I'm a new VR user) and on top of that it was exactly what I wanted in a VR horror game, keeps you on edge with minimal jump scares and actually plays on your fears a bit. Great price for a great game!\n\nHelpful | 0", "shalalaolalaMay 25 at 4:30 AM\nmotion sickness\n\nI really want to play this game so bad coz I love horror but i cant due to the motion sickness since Im moving in the game but not really moving in real life. Im not sure if its me or the game but not even one minute into the game it gave me quite a bad headache. Its probably just me since other reviewers have no similar problem.\n\nHelpful | 1", "DeepMellowJun 18 at 9:54 PM\nNot fun. Looks like a game from the 90s\n\nGame is boring and graphics are terrible. No updates. Same boring stuff throughout.\n\nHelpful | 2", "willifosMay 25 at 11:50 AM\nBoring and not scary\n\nIve been playing this game for an hour. So far, just a bunch of empty halls. I have no clue what the point of this game is. I have yet to encounter anything but a maze. Thats it. So dissatisfied.\n\nHelpful | 2", "Dodooq8Jul 23 at 1:55 PM\nVery SCARY\n\nFirst of all the start of the game gave me chills second its adventures fun mysterious BUT scary SOOOO SCARY!!that I played around 20 minutes only and stopped it right away I couldnt continue cuz it scared the hell of me\n\nHelpful | 0", "xXSharp_ShooterXxJul 8 at 7:18 PM\nYeah so basically.... very intense!\n\nThis game is terrifying.... absolutely terrifying.... Im a 16 year old guy and I have to be playing music in the background to play it  it is very fun... lots of things you learn as you play it... let me just say there is more than just one type of creature... and chances are each one will kill you at some point.... when you die it explains why you got killed and what you can do to prevent it from happening again... you learn as you go which is exciting... its thrilling to see something you dont recognize and not know what to do haha\n\nHelpful | 0", "jayman5671Jul 5 at 6:16 PM\nAmazing! Better than Affected: Manor\n\nSo well done! monsters are unpredictable and can make you start back from a checkpoint or the beginning so theres a real sense of danger and urgency. You come across them in clever ways that actually surprise you and I get chill after chill playing this game. Ive put a good 45 min or an hour in now and theres still more, plus the random generated maps so tons of replayability. Well done! Well worth the $10! Hope they make a longer sequel\n\nHelpful | 0", "paige.blomquist3 days ago\nScary and fun\n\nMy sister literally ran straight into it take playing this. Super terrifying and allot of fun\n\nHelpful | 0", "pepeR0NiJul 11 at 1:37 AM\nScary atmosphere\n\nThe game is scary just at the beginning because of sounds and visions it isn't terrifying or psychological like Face Your Fears or Layers of Fears but it's more about the exploration of the scary halls and its a fun time killer or just a game to laugh at your scared parents, I would say even a good first experience of horror fans, I enjoy it. Controls are comfy i got used to it very quickly and the quest perform very good with this game.\n\nI've seen some that said its boring, correct, it has no story, at least not a big one with a plot-twist and guns. Like I said, its an *exploring game* if you want more story driven go for face your fears 2 or lies beneath.\n\nHelpful | 0", "BeastfirefoxJul 25 at 11:59 AM\nIm refunding this game\n\nThe first thing I ran in to sent chills down my spine and I just stopped playing and now Im refunding it because it was too scary but this is a must buy for anyone Im probably gonna buy it again\n\nHelpful | 0", "BloodyShanglongMar 18 at 6:22 PM\nWorth every penny.\n\nThis game is genuinely scary. Creeping around dark halls navigating large maps while evading monsters. Replay values is off the charts. Great purchase. Be aware motion sickness is a thing with this game, pro tip: use your body to turn not your controller.\n\nHelpful | 2", "thegamerkid1Jun 30 at 12:36 AM\nThis game still gets me somehow\n\nThis game is amazing and terrifying at the same time I'll be walking down a hall and all of a sudden the demon spawns right in front of me. I played this at a friend's house one time they never played it again but then it was released on the Oculus Quest and I know I had to Play It Again. and it hit me twice as hard than it did back then. and so if you're looking for a good horror game in VR the $10 definitely worth it\n\nHelpful | 0", "The_big_perch8 days ago\nTo easy\n\nThe game really inst really that scary and the best part of the game is the music. The rest of the game is look at the ground and find a human eye . Not great. If u try u cant even die. When u die its just a quick hit not a cool jump scare. However the game is only 15$ so i guess that make sense.\n\nHelpful | 0", "Bonobo55824 days ago\nGreat, scary game\n\nIve not competed it yet but it is as scary as I anticipated it to be very cheap for what you are getting. Amazing vr horror game\n\nHelpful | 0", "ramen420nice25 days ago\nWorth it\n\nOk so this game isn't really a jump scare game but it keeps you on edge and I had to take off my headset at some points a must buy\n\nHelpful | 0", "BUTTERY_MEMESMay 1 at 5:47 PM\nWell that was scary\n\nThis made me nearlly piss my pants so if you want a good game for a small price definitely get this game\n\nHelpful | 0", "Ethoz787Jul 6 at 3:04 PM\nAmazing\n\nThis game is insane. It's incredibly immersive and easily the scariest game I've ever played. I 100% recommend you buy this game, the $11.99 price is an absolute steal and even better on sale. If you want a good scare I highly suggest you play this.\n\nHelpful | 0", "belambaFeb 23 at 4:48 AM\nCreepy but loving it\n\nThis was the first game I bought on Quest and Im very happy with it. A lot of scares and lots of dark alleys and doors to open. The graphics are amazing and my heart is pounding even though nothing much has jumped out at me. Think Im being followed but dont know by what.\nIf you like scary and horror games give this a go.\n\nHelpful | 3", "getdavemJun 28 at 3:05 PM\nGood\n\nMy first horror game on oculus. It certainly is creepy and I did jump but it took me a long time to reach that point in the game and far too long walking with nothing much happening. Unfortunately for me, I also got too much motion sickness and had to stop a couple of times. But I do intend to give it another go and hopefully do it in small stages.\n\nHelpful | 1", "ummitsayJul 2 at 7:23 AM\nSo scary I hate it\n\nI am absolutely terrified of this game. I bought it for my fister so she could try a scary game and we hated it so much but yet loved it. So I guess I have to give it five stars because it is so scary I don't want to play it anymore\n\nHelpful | 0", "emmatabithaJul 8 at 1:27 PM\nHeadset off\n\nNever thought a VR game would make me pull the headset off, but this game is intense. Reminds me alot of DOOM like the rooms general feel. I knew none of it is real but yeah freaked me out.\n\nHelpful | 0", "661c.sanabriaMay 23 at 10:52 PM\nPs2 graphics, but\n\nIt has Ps2 graphics, but its fun to play. I hope they make another one with better graphics and add more things on the maps, its sorta empty with the same books, beds, boxes ETC\n\nHelpful | 0", "KayoziaNov 26 at 5:21 PM\nPlayed 15 mins and will never play again\n\nThis game is TERRIFYING. It felt too real, and at one point I looked over my shoulder and saw this black shadow personthat was enough. Right then and there I took of the VR headset and knew I was never going to play it again. It was TOO real.\nThat being said Id never think about refunding the game because the developer clearly did their jobs correctly.\nGreat purchase, Ill hopefully trick others to try it out but Ill personally never play it again haha.\n\nHelpful | 128", "Thomasdelgado123Jul 9 at 6:01 PM\nReally fun and scary\n\nI love this game it is the first horror vr game I have played I didnt expect much for $9.99 but it really made me crap my pants but it is a very good beginner horror game\n\nHelpful | 0", "Angiiee_GamerJul 29 at 5:05 PM\nScary\n\nIts honestly really scary! Even my father couldnt play it. Though thats whats expected, it g s kind of boring after a while. If you just want to try the game yourself without it being too scary, play some of your own music with the audio off. \n\nHelpful | 0", "romanos.kazantzidisMar 26 at 5:19 PM\nIf you want to sh*t in your pants take i\n\nIf you want to sh*t in your pants take i\n\nHelpful | 4", "daryl.hurleyJul 8 at 7:41 PM\nCool spooky game\n\nIf you are looking to get scared like playing doom/ resident evil (the originals) in the dark not knowing what is around each corner. I would play this game.\n\nHelpful | 0", "CorwiiJan 2 at 8:41 AM\nHard to Review\n\nIt's very difficult to review a game you're too scared to play. Let's just say if you're into horror games, this one wont let you down. The narrow hallways and slight whispers you hear all around you will frighten you the whole ride. I managed to get through most of the story out of pure luck cause usually when something starts chasing me I quit.\n\nAll in all this is a very immersive title especially if you wear a good pair of bass enhanced headphones. You will feel like you're really there especially on quest if you use the 360 turn ability the quest offers.\n\nHelpful | 13", "bocurFeb 16 at 8:59 AM\nMakes me  my pants!!\n\nI play this game literally every day and yet its still makes me scream like a little girl! Its just the fact that its completely randomized every time that makes it so scary you never know when your gonna run into something or when something will happen and thats what makes this game truly terrifying!\n\nHelpful | 2", "sgwigglysquidJul 6 at 11:03 AM\nIts Decent\n\nFor a $10 game this game is ok. It lacks jumpscares and when you get attacked you just make this grunting noise then die. The random creature encounters are what makes this game the scariest. The shadows, sound effects and lighting makes you shiver to the bone. But when it comes to getting attacked its not even scary. I give it a 3 star. This game has so much potential but as i started playing i got bored pretty easy.\n\nHelpful | 0", "Noodle_SquishJul 10 at 8:30 PM\nTerrifying\n\nVery scary game, accomplishes what it tries to do with no cheap jump scares.\n\nHelpful | 0", "Mr_DreamsterDec 27 at 10:55 PM\nSurprisingly scary\n\nAt first glance it does not look that scary, and since I'm used to scary movies and games, I thought I would be ok... Oh boy, was I wrong.\nThis game is absolutely terrifying, and it's mostly because of the awesome ambient sounds. Creatures all have different mechanics, game's replayablility is very good, controls are excellent. It's the best vr horror game I've played.\nIf I could just change one thing, I'd like it more if the game did not force me into wasting my first unlocking tools on the first closed door I try to open.\n\nHelpful | 11", "JakhumanFeb 11 at 6:48 PM\nTerrifying\n\nThis game definitely scared me plenty and I'm not usually phased by horror games or movies. Feels so real, had to take plenty of breaks because of a bit of motion sickness from the walking, but also because It was just terrifying at times.\n\nI never used the right stick to turn my head in game, I instead turned my whole body when moving through the game. It cuts down on motion sickness, for me at least.\n\nOverall it was really fun and scary as all hell. Recommended, even if you're not a big fan of the horror genre.\n\nHelpful | 1", "sammywallFeb 29 at 6:17 AM\nNot Bod Not Bod\n\nMade me crap my pants not ONCE but TWICE! My heart rate jumped from 70 beats a minute to like 480 beats a second and then I was hit with the Jimmy legs followed by cardiac arrest. I need to go watch some cartoons.\n\nHelpful | 1", "SmallyBiggsFeb 11 at 6:48 AM\nLove the replayability\n\nRandomly generated maps make for some interesting sights before being eaten. You can be a pro at this game and it will still find ways to GETCHA!! Still play every day, awesome value for a game you can play again and again and never see a familiar map! Cant wait for the sequel!\n\nHelpful | 2", "tanner.vegetaApr 22 at 10:43 AM\nNo english subtitle!\n\nI cant hear what a medusa said on the wall. So disappoint. I cant get refund back!\n\nHelpful | 2", "SebtacularJun 28 at 10:03 AM\nI am genuinely having trouble finishing\n\nWhenever I start to creep down a hall I get jumped by a monster.\n\nHelpful | 1", "Spyderspy1458May 18 at 9:15 AM\nAmazing\n\nI got this game yesterday and I am already in love with it. Playing it at 2 am with noise canceling headphones is one of the most terrifying experiences I've had but also one of the best. I reccomend this game to anyone who likes horror games or wants to get scared.\n\nHelpful | 0", "mr.BinocularsFeb 25 at 10:45 AM\nGood and scary but...\n\nThis game is terrifying! The scares are effective and the gameplay mechanics are great, but theres one problem. The game is a little bit too easy, most of the rooms you go in doesnt even have a use, its basically just a labyrinth with monsters attached. As I said the gameplay mechanics are great but it still should have more elements to it to make the game harder and a little bit scarier. Most of the monsters I barely stumble on, and some of them are very easy to avoid. Because its so easy to beat it is really not that scary once you finished it, and may drag you out of the game. Witch is not ideal in VR, but other than that dreadhalls is a good little horror game with effective scares, especially when it comes to the environments\n\nHelpful | 2", "RandomMan85Oct 4 at 3:47 AM\nI think I need Jesus!\n\nOK, so I saw Dreadhalls announced a few weeks/months ago and being a big fan of horror games it piqued my interest. So I read a few articles and reviews of the game on pc vr and the oculus go and thought \"Really!? How can all these people be freaked out and scared of a game where the graphics look so dated?\"\nSo, yesterday I saw it was only 7.99 on the store and decided to buy it. On goes the headset and off I go on my journey down the dark, damp corridors.\n\nNow let me just start off by saying, I don't scare easily. I've played all the Resident Evil games, all the Silent Hill games plus P. T, and horror movies just don't do anything for me.\nI've been praying for something to scare the absolute sh** out of me for years and now, all of a sudden, I'm walking into the darkness of a dungeon with the hairs on my neck standing right up, my senses are awake! My butt is clenched very tightly. I've not felt like this since my first trip to Silent Hill!\n\nI seemed to spend what felt like forever exploring the dark corridors, peeking around the doors, sneaking slowly into small room with bones and skeletons hanging inside them. I'm all too aware that something is stalking me but I can't see it, only hear it. Then it happens! I walk in on this terrible looking witch/ghost woman and just stand there staring at her back, it slowly turns round whilst hissing and screaming and I was frozen to the spot, still just staring at it. Then, without warning, it just starts chasing me down, the music starts playing fast in my headphones which is almost as startling as the ghost! I keep running away in horror until I get a good distance away and start to relax a little, \"she's not so fast\" I thought to myself... Then it dawned on me, there was a horrible noise coming from behind me. Sounded like demented barking/growling? I'm honestly too scared at this point to look. My sprinting victory from the ghost mattered not, for as I slowly and reluctantly turned around I was greeted by this huge hulking beast, which lunged right in my face and killed me instantly. I even let out a scream which frightened my wife, who was watching TV. I was dead.\nSo, eventually after a short recovery, I took of the headset, my palms sweating and I'm actually shaking, \"f***\" was the only phrase I could verbalise.\n\nWould I do it again? Definitely! This game is what I've been waiting for and although I'm not a religious person, I think if you play this game you WILL need Jesus. Oh, and some fresh underwear, Amen.\n\nHelpful | 406", "mustardtiger666Jan 25 at 8:51 PM\nJust like everyone else, I am scared\n\nThis is just a well done game. Very simple to play and definitely not in a bad way. How ever long you last, and I mean you will definitely quit from fear, is intense from beginning til end. Sound is scary enough let alone turning a corner and coming face to face with an unfriendly entity. Well done developers. Oh and the replay value is fully intact.\n\nHelpful | 0", "PaladinLeeroy710May 31 at 11:23 AM\nScary\n\nI wasnt ready to be messed with like this. The sound design is great and the encounters had me spooked. Some more diversity would be great though. Overall great game\n\nHelpful | 0", "bnaas30Jan 26 at 12:13 PM\nMajor spooky\n\nSo this game is not for the faint of hearts. I mean I can watch horror movie after horror movie in the dark, home alone, in the middle of nowhere and my heart rate barely go over 70. But this game I can barely go 30 minutes before the tension and fear forces me to take my visor off.\n\nThis game has amazing graphics and a pretty decent story. The map actually changes each time you die, which creates great replayibility. Not to mention there are random maps you can complete once you finish the story.\n\nI dont this game much, but for the price is a must buy even just for the amusement of seeing friends and family (although maybe not Gramps with his pacemaker) try to brave it out.\n\nHelpful | 0", "SomewhataddictedJan 25 at 6:15 PM\nScariest game you will EVER play. \n\nWhen I bought this with the low price tag it came with I was expecting a bootleg face your fears or outlast, but my god. I cannot play this game for more than 5 minutes at a time, the dang beginning screen jumpscared Me.\n\nI find myself clinging to walls hoping I find the woman on the wall so I can talk to her for even a few moments of comfort.\n\nThis game knows how to creep you out and scare you silly without repeated cliche jumpscares. In fact, I havent even been jumpscared in game yet other than the unexpected title screen which proves how true horror is supposed to feel.\n\nI doubt I will ever beat this game as whenever I see the shadow people appear in the second level I close out my game and play something else, highly recommend to ANYONE looking to wet themselves within minutes of pressing start.\n\n5 stars!!! \n\nHelpful | 1", "XpAmadeusJan 25 at 2:52 PM\nGreat creep you out game\n\nPlayed this on a friends quest and was impressed with the game play and atmosphere that the VR creates ,its not a game to play late at night before you go to bed ,I think it he creepiest stuff is the whispering of the black smoky looking lady ghost that looks like something out of the film The Ring .\n\nHelpful | 0", "Hydramonkeh87Jul 1 at 11:08 AM\nAHHHHH\n\nscary\n\nHelpful | 0", "Owen_kullmanApr 30 at 4:57 PM\nA must have for the quest\n\nDread halls is an absolute most have for the oculus quest. Paired with its cheap price and amazing gameplay mechanics , this is the most value oculus games come in. Even if you dont usually play hire ( like myself ) it does not take away from the fun strategic-but-scary gameplay!\n\n\nNote for Devs: please add at least one more monster that can roam in the halls , as in the beginning when I didnt know the monsters the halls were the scariest part, but as I played I realized that the halls were by far the safest place in the game ( other than the huge safe rooms)\n\nHelpful | 0", "Jakester666Apr 29 at 3:10 PM\nDefinitely creepy\n\nSomeone said they dare you to play it alone... Well I dare you to do that with 2 dogs in the room... Walking around and snuffling and clacking of nails on the floor from random directions! It was unbearable in addition to what the game already provides!\n\nI will continue my experience without the dogs.... Well worth the purchase even after 10 minutes!\n\nHelpful | 0", "ReggieRebornApr 29 at 9:32 PM\nJust got it on sale and it's terrifying!\n\nDefinitely worth the money and really scary. I got about half an hour in before needing to tap out for the night but I'm excited to try more soon! If you're on the fence about picking this one up, I'd certainly say to just go for it. It's polished (enough) considering its price and the locomotion is very smooth in my opinion. I had no feelings of dissyness throughout my play!\n\nHelpful | 1", "mechwarrior1Jan 29 at 10:21 AM\nWhoa!! A terrifying experience.\n\nThis game is absolutely incredible! I am only half way through but this game already deserves 5 stars. The randomly generated levels are so immersive and scary. Looking foward to finishing the game. This is a great title to show friends and watch their reactions!\n\nHelpful | 1", "DStubbs67Feb 15 at 10:39 AM\nGreat game!\n\nSimilar to the old Doom game with much better graphics. The use of lighting, sounds, and music make this a great horror game. You just never know whats around the corner!\n\nHelpful | 0", "zeewildFeb 19 at 1:33 PM\nNice experimental horror experience\n\nThis is a very simple game. If you are looking for a cheap(ish) method of trying horror in VR this is a great choice, but overall the gameplay and environments are bland and repetitive. Its fun, but it gets old fast.\n\nHelpful | 3", "justsaewhenApr 26 at 6:45 PM\nGoosebumps\n\nI went in this game blind.\n\nScared me a handful of times and the last one gave me goosebumps. What an excellent horror game. Audio is top notch. Background music and sounds are eerie. A horror game where you're always moving forward with rarely any respite. Simple design and perfect draw distance.\n\nA VR essential \n\nHelpful | 0", "Rafael_9Feb 5 at 7:42 PM\nPretty epic and spoopy\n\nThis is a great game but theres a problem Im a bit of a baby so I cant do anything because Im too scared to even go to the next room but its a pretty good gameplay and cool storyline\n\nHelpful | 0", "khousley11Jan 12 at 3:20 PM\nHonestly...\n\nIt's not bad at all. It gave me very outlast vibes after finishing it... Having that feeling of I can't believe I'm done I can't believe I did it, it's finally over.The additional monsters that get added into the game as you go along add to the experience. My two least favorite monsters are the fish people and the gargoyles. My favorite monster is the floating head; not being able to move is a really cool aspect of the game. I believe that your could make a part two that shows how we got into the halls but like a different risk. I learned in the game that the character followed a ritual to get there meaning that he chose to be there. I'd want to see gameplay of this ritual. And since this is a kinda old game the new technology could help amp up graphics and fear.\n\nHelpful | 1", "JerseyArtistFeb 5 at 12:17 PM\nScary.\n\nI recently finished playing the garland just let me say this: The VR games great' I found myself trying cover my head yo ward off the creatures in the game. Also it had me jumping at shadows.\n\nHelpful | 0", "tony.ermakovJan 17 at 8:55 AM\nScary as hell!!!!!\n\nI love horror games and this one is one of my favorite ones. So simple and so scary!!!!! Especially I want to mention level randomization. What makes it replayble. So far I'm taking small doses of this game. Dont want it to get old to fast. Totally love this game. Scatchy as hell!!!!\n\nHelpful | 0", "Zenik77Oct 3 at 10:59 AM\nAmazing\n\nDid random map went down like 33 hills and got my money's worth. So the story is 9 or 12 levels long. But random map puts you into a randomly generated dungeon. It has amazing replay value for just $9.99. Love the control options and being able to peer around corners. Love using the lamp to look at the map. I never use maps in games but this one I use lol. 5 out of five. Plan to release any DLC?\n\nHelpful | 104", "thehunter101Mar 8 at 11:46 AM\nreally fun and scary\n\nreally really scary\n\nHelpful | 1", "cenoquestJan 25 at 4:15 PM\nControl scheme not ok\n\nThis is a port from a (by now) quite old PCVR game. I think the visual downgrade was quite well done, but the control scheme and object interaction model remained basically the same. It doesnt follow Quest standards, its just something the devs made up and its profoundly jarring to play. Press grab to run? Press trigger to grab object? What? I dont understand how oculus allowed the game to be published like this. It feels so completely out of place.\n\nHelpful | 3", "JCsMagicLinesOct 3 at 12:53 PM\n5/5 for immersion and possessing my dog!\n\nThe whispering voices started revolving around me growing in volume, coming closer and closer... increasing my fear and the tension in my body... then at the peak of the sounds, my dog literally pushed her CLAWS on my foot! Not knowing instantly that it was my dog due to the sound overwhelming my ears and keeping me immersed, I literally screamed as I felt helpless for a second and fearfully accepted the impossible reality that I was somehow magically transported into this nightmare and I couldn't escape. Or so thats what it seemed. 5/5 for immersion and my dog's timing. My dog is fine. I did not kick her and it was just a perfect timing for my dog to greet me good morning. MUST PLAY WITH HEADPHONES.\n\nHelpful | 52", "NightMonk3yJun 8 at 4:07 AM\nVery creepy\n\nPlayed it on silent mode was very creepy. Graphics some ok aswell.\n\nHelpful | 0", "OrcusMaximusFeb 15 at 4:34 AM\nUnable to play due to motion sickness\n\nThe game is atmospheric, but unplayable for me due to there being no way of moving without motion sickness. If the game is updated to allow jump moves, as is standard in other games, I'll update my review.\n\nHelpful | 4", "AnubisXtremeMar 12 at 1:37 AM\nNice game\n\nNice\n\nHelpful | 0", "meduzoJan 1 at 7:30 PM\nMultilanguage voice and text! Yay!\n\nNot being an english native speaker, VR has always felt different to me.\n\nI feel like experiences do not connect with me as much as they should, that happened to me with Vader Ep. I, and I have been worried that it might happen to me with other games.\n\nTo my surprise, this game supports multiple languages, and the experience is simply incredible, well also it's a horror game, so immersion is easier to have.\n\nAt the price it has, you should buy it! Worth every penny!\n\nHelpful | 2", "BLZDPraetorianJan 2 at 7:44 PM\nWow wow wow SCARY!\n\nIm not a huge horror fan. Im not a huge maze game fan. But man this game has me scared more then i care to admit! I really like the way this game has me buggin out! Running from entitys, peeking around corners and listening for audio cues. I think they did very well! I understand this was a ported game, but would love to see it evolve further! Great game! Id recommend!\n\nHelpful | 1", "Fat-ManJan 25 at 3:31 PM\nTerrifying\n\nMy favorite thing is to put my mother in law in it. She turns a corner, complete debilitating terror. A little repetitive game play, but definitely the best thing to show off your new Oculus.\n\nHelpful | 0", "Mr.TinkertrainJul 18 at 10:15 AM\nCould be good\n\nI lost interest after about 10 minutes.\n\nHelpful | 0", "rychappellJan 1 at 5:48 AM\nCreepy!\n\nI'm not generally a fan of horror as a genre, but this is worth experiencing. Very immersive and creepy experience (though I think some of the other reviews exaggerate in calling it \"terrifying\"). In-game tutorials give just enough clues to help you figure out what you need to do -- how to avoid the various monsters (one you mustn't look at directly, another will lose you if you turn out your light, etc.). I don't expect I'll come back to it often, but glad I gave it a try.\n\nHelpful | 1", "Drake_NobleDec 24 at 5:58 AM\nA fun game but\n\nThis games been out so long and it's still fun and good to show friends who think horror games aren't scary... Horror games in VR have more emersion and more fun.\n\nI would like to state there needs to be more updates to this.\nThe game released 4 years ago and I see the same character models, this wouldn't be a negative thing except for the replayability.\n\nThat said randomly generated maps add to the fun but I would like to see a 1 in 100 creature that is on the map you can't outrun... It's the Dreadhalls... RNG bias aside this would add to the fact you can be as careful and as smart as you want but eventually the big bad will find you.\n\nThat aside I like the game and would love to see it thrive again.\n\nHelpful | 9", "pondfrogsDec 30 at 1:40 PM\nall i gotta say is dont look at her!!\n\nIve had this game for a while now and couldnt figure out how to get out of the main halls but watched a few minutes on youtube of someone playing and then tried again. oh my this is sooo scarey!!! use earbuds so you can hear all the soft wispers...so many shadows appearing and disappearing...collect all the lamp oil and other objects in each room. if you love to be scared this is truley a horror game worth buying. I dont know when ill be able to complete it as my heart can only take a few minutes at a time. great job developers!!!\n\nHelpful | 1", "gilad772Jul 17 at 11:20 AM\nBoring \n\n.\n\nHelpful | 0", "Roven_WanDec 25 at 1:05 AM\nI cant play. Too scary!\n\nI am a horror movie fan, but I cant play this game. For a few attempts, I could just walk to the corner and I dont think I can move any further. Help me!\n\nHelpful | 5", "Davido26Feb 2 at 8:38 PM\nMotion sickness\n\nThe mechanics of moving around down multiple halls makes me sick to my stomach every time I play and sadly I have tried many times now. The concept of the game is great just wish that I was able to stay in longer then 10 mins.\n\nHelpful | 4", "TanSeekerDec 28 at 10:31 PM\nBuy this and some undies.\n\nDefinitely a 10/10 for the price. Much more immersive and frightening than it appears. Made me yell out a few times, but I finished it and will definitely return. The mechanics work really well, and the environment has a beautiful atmosphere of dread definitely appropriate for the title. It's a must buy!\nReplay value is there from the random map generation, and also the random dungeon mode. Awesome stuff.\n\nHelpful | 1", "KyrendareMay 14 at 5:11 PM\nDreadHalls is worth it's price.\n\nMy opinion:\n-Excellent creepy ambience. (5*)\n-Average Visuals. (2,5*)\n-Gameplay. (4*)\n-Replay value. (3*)\n-No bugs found yet. (5*)\n\nHelpful | 0", "ChunkylemonsDec 22 at 10:50 AM\nGood value Horror game\n\nThis game is not the most scary out there but it definitely does the job and had me scared. The premise of the game is simple and easy for anyone to understand and great to scare friends and family. The real value is that the maps can be randomly generated which adds a lot of replay value. Each map is different which adds technically infinite ways to be spooked. Unlike other hotels where you know where the scares are after the first play-through this game keeps you guessing.\n\nHelpful | 3", "MikeHawkinbalzzJan 3 at 4:12 PM\nNeed clean underwear\n\nGame is awsome and very scary. Cant help to think how awsome it would be if there was more to it other than lock picks(that you dont really need) and lamp oil. The coins are useless except for the wall heads and all they do is repeat the same stuff over & over.\n\nHelpful | 3", "LoudfireJan 11 at 8:06 AM\nHoly hell this is scary\n\nI love real life haunted houses. Even though I don't believe in the afterlife or ghost I downloaded this because of the ratings and the fun Factor. Scary as hell! Very enjoyable game would recommend to just about anyone.\n\nHelpful | 0", "mnaragon15Dec 9 at 7:24 AM\nObviously a must buy!\n\nAs you can see from the other reviews, this is an amazing game. I won't go into the whys and hows of what makes it great and reiterate some of the comments already here - just know that for the price you will not find a better scarier horror game on VR. Not only do you get a fairly lengthy story mode, you also receive a random dungeon mode as well. Both are equally as frightening. One other comment - there is nothing else like toting around a lantern in your hand in VR with this title. I found myself moving it around as the lightsource to peer into dark rooms and around corners - excellent. You cannot go wrong with this title, pick it up now.\n\nHelpful | 2", "GrimmcragDec 26 at 1:04 PM\nNightmare\n\nI've heard some people say this game isn't scary any more. Well I've played or for the first time the other day and it's genuinely horrifying. The tension is palpable and makes you hesitate to walk into a room and dither in a corridor for ages. Go into it cold if you can.\n\nHelpful | 1", "stromer16Dec 12 at 12:39 PM\nFrickin scary\n\nLet me just say, Im a horror fein. I love horror movies, horror games, and dont get scared at haunted houses. (Not to mention countless hours of watching Markiplier play horror games). But this is something else.\n\nThis is my first true horror experience in VR and let me tell you there is nothing like it. Being literally set in the atmosphere of a horror game is an incredibly new experience. This game sets the mood perfectly, the music is amazing (except when it goes completely silent thats terrifying ), and the scares get you every time.\n\nIm still trying to get through it without getting spooked, but for any other horror fans like myself, this is a must have game.\n\nHelpful | 4", "LiquidSunfireJan 24 at 5:18 PM\nDreadhalls\n\nHeart pumping fear. Enough curiosity to keep me going, and scary enough to be glad when it was over. Awesome experience!\n\nHelpful | 0", "KatieGahGahDec 15 at 5:45 PM\nSCARY AS HELL\n\nI had low expectations which was a bad idea because I was screaming my head off the entire game. Its so much fun playing and having other people watching you through the casting. Be careful though. My boyfriend got freaked out by a jump scare and flew back into our wall and knocked a hole in it!! This game is terrifying. I wont play it by myself.\n\nHelpful | 2", "ryan.danahy.99Jan 10 at 4:07 PM\nBig scary\n\nI play, big scare, make poop.\n\nHelpful | 4", "TaladuZDec 17 at 12:21 PM\nJeepers Creepers Shaggy!\n\nI got his at Halloween to use at a party. But never got around to incorporating it. Too bad, it would have been a hit. This is darn creepy. Taking it a little bit a a time as he game is just too adrenaline inducing! If you like a good skin crawling scare one in a while, I recommend it. Easy to play. The hand control works well. Interesting twists and turns await also.\n\nHelpful | 2", "hyrrokkin2020Jan 2 at 2:40 PM\nfairly good\n\nThe graphics are a bit samey- it takes a long time to get around with pretty repetitive scenery and theres not that many scares in there, they seem to be few and far between, but they are fairly good when they do come and do send a shiver.\n\nHelpful | 0", "zackery.peltierJan 2 at 9:52 PM\nit scares!\n\nThis little game has legit scares. i love the item menues and how the game functions as well. If your tired of killing robots and zombies give this game a try, and out of the blue you may pop a turtle head in your pants.\n\nHelpful | 2", "WhiteThanosDec 27 at 5:08 PM\nScary as f**k\n\nThis is an amazing game. It is terrifying. I dont care that the graphics are bad. I would 100% recommend this game to anyone who loves horror games. This is an amazing game. It made me scream. Love it. Absolutely amazing\n\nHelpful | 1", "TimTrainageJan 24 at 9:35 PM\nExcellent\n\nA thoroughly enjoyable experience, I screamed like a prepubescent girl, as an adult man!\n\nHelpful | 1", "MichaelSanFranciscoDec 12 at 11:11 PM\nAy Caramba! Aye aye aye! Wee wee wee!\n\nI don't like this game. Don't get me wrong, it is very well done, e.g., the graphics are a testament to the overall quality of gameplay. The musical score is guaranteed to creep you out. The problem I have with it is my underwear, namely, my tighty whities.\n\nYou see, laundry day is Saturday. I have five pairs of briefs that I change daily. (My mom taught me well. She said always wear clean underwear because if I'm in an accident I will forever be disgraced if I am wearing dirty underpants when the nurse at the hospital strips me down.) I digress, forgive me.\n\nBack to this game. When playing I have five times now soiled me briefs. End result, I don't have enough underwear to last me till Saturday.\n\nThis wouldn't be an issues if the Devs included an UNDERPANTS WARNING in the game's opening credits, but they didn't so now I'm underpantless in the Big City. Shame on the Devs, shame.\n\nUpdate, Mark Z. came up with a good solution: I'm going to play while sitting on the toilet. Thank you Mr. Z!\n\nHelpful | 3", "DoctorSweetsJan 3 at 8:42 AM\nWorth the purchase, but has some flaws\n\nOutside of the positive things others have said, I'll add that I think this game needs better checkpoints. Too often in my learning stages, I came across a spook that had rules about it (don't look at it vs. don't stop looking at it vs. don't turn on your lantern) and was dead before I even realized what was going on. This meant that I basically had to start that entire section over.\n\nThe game has a nice hint as to why you died, but that doesn't help if you didn't even really see the creature that it claims you looked at.\n\nHelpful | 2", "SkyHiveOct 3 at 5:13 PM\nYour FEAR will be legendary,even in HELL\n\nFrom the moment you open your eyes,fear takes hold and refuses to let go.\nYour objectives are clear:\n\n1) Avoid prolonged contact with a menagerie of demonic beings\n2) Manage your stamina by practicing breath control. Run out of breath? Forget about getting away in time.\n3) Collect gold for the stone witch. She is willing to tell you things that may or may not be helpful to your situation. Always pay her up front.\n4) Search this hellish place for lockpicks and lamp oil. You do not want to be bumping around in the dark down here!\n5) Collect and place the heretics trophy eyes in stone monuments. You shall not pass without returning them to their nests.\n\nDREADHALLS is stunning in how it is able to do so much with what seems like so little.\nSound design is stellar throughout. The sound of footsteps,scratching,moans,and creaks keep the adrenaline flowing.\nGraphics are to the point perfect for achieving the developers vision. Even when your lamp is burning brightly the darkness chokes it out several feet from where you are standing. The lights footprint is genius in how it plays with your mind. Did I just see a child or was that a shadow?\n\nEvery beastie has its own particular behavior. It is up to you to find out how to survive each encounter. You always have the option to RUN!\nYOU WILL END UP RUNNING SOMETIMES!\n\nThe price for this game is a no brainer in my opinion. Have a ego bro in your group? Boot this up for the antidote.\nEvery library needs a copy of this terrifying adventure through hellish catacombs.\n\nHelpful | 21", "MadmartagonJan 5 at 9:10 AM\nIf scary is your thing.. get this..\n\nI'll have to write a more detailed review at a later date, because I'm too chickensh!t to go back in and try to complete the game right now..\n\nHelpful | 0", "AironasoreDec 29 at 4:17 AM\nAmazing horror experience\n\nThis game is great for someone trying out VR for the first time. It has all of the things necessary for a fright. Ambience, monsters, labyrinths. Great game, would buy again.\n\nHelpful | 0", "dustyneon3DNov 28 at 5:04 PM\nOne of the best Horror games on VR\n\nSo, I'm a huge horror fan. Nothing typically scares me, and I mean nothing. One of the reasons I bought the Oculus was to experience horror in a more exciting way. So this was one of the first games that was recommended. I told my girlfriend about it, but I wanted to try it out first. As soon as I got to the menu, the hair on my back spiked up. This game has an eerie feeling to it. The first 5 min, I was shaking, then I saw my first ghost and I almost had a heart attack. I turned it off and waited for my girlfriend to come home so she can play it and I can watch. She didn't last 5 min without screaming\n\nHelpful | 2", "savage.jaypMar 26 at 10:56 AM\nSuper scary\n\ni bought this game game due to the reviews i saw because i wanted it to be the first VR game and first horror game on my youtube channel, it has not disappointed at all i will tell you that much. i recommend to the max\n\nHelpful | 0", "Sea_Crust56Dec 30 at 12:19 AM\nTerrifying\n\nI had my siblings play this game and they threw off the headset. It's a terrifying game, but fun too. If you are looking for scary, get this game.\n\nHelpful | 0", "kblairwitchDec 25 at 3:53 PM\nFecking scary\n\nWhen it says not for the faint hearted it means it. It is a very atmospheric game that has you peering around corners and running down halls as you play....\n\nHelpful | 0", "mopaulNov 17 at 5:05 PM\nFrightening!\n\nSo..I don't scare easily, but Dreadhalls is another level! The ominous atmosphere that is created is frightening. From the music, the creaking doors, the whispering..it all adds to a completely immersive experience that will take you to the edge. So much so that as I slowly turned a corner and encounted one of the monsters running towards me, instead of running away with my trigger finger, I literally ran into my loungeroom wall! If you love a scare I can't recommend this game highly enough!\n\nHelpful | 5", "SnottyFaceBabyyApr 20 at 6:32 PM\nMan wtffff.\n\nBro I bought this game played 5 minutes and sharted in my pants...\n\nHelpful | 0", "YT-Ambitious-XPDec 1 at 12:37 AM\nTHIS GAME GAVE ME NIGHTMARES!!!\n\nThis game is absolutely terrifying, I played it before on the PSVR. But NEVER had the same experience as I did while playing on the quest. Playing this game on the quest reached far beyond my expectations. It seemed too real. I forgot I was in a game and not in reality... even after taking off the headset, I still felt uneasy. Even had nightmares about shadow people! The price for this game is only $10 but I would have happily paid $30 if I had knew the experience was gonna be this awesome.\n\nHelpful | 2", "RitznarokJan 5 at 9:45 PM\nPretty spook\n\nI played this and I don't really get scared of games but the vibe this game gives off straight up gives me the creeps lmao\n\nHelpful | 0", "JoanneLoveSpringbergFeb 12 at 11:11 AM\nMotion sickness!\n\nYou walk in the dark through endless halls collecting eyeballs, monsters kill you , not bad except the motion sickness\n\nHelpful | 0", "Potatos_are_life_123Feb 6 at 2:43 PM\n\nExtremely overrated not scary at all\n\nHelpful | 3", "Gecko54Jan 28 at 12:43 PM\nGreat game but no motivation\n\nBottom line So this game is great simple and takes little to no time to learn but lacks a reason for me to keep playing unless your addicted to being scared.\n\nHelpful | 0", "joshua_bernsteinJan 16 at 11:47 PM\nTerrorized fun!\n\nScary me so hard.\n\nHelpful | 0", "dave.s.mcgJan 16 at 2:07 PM\nScary\n\nIt's very scary.\n\nUpdate: I'm too scared to go back\n\nHelpful | 2", "theoryofeverywhereDec 29 at 11:59 AM\nKinda scary and fun\n\nSo I realized that I am most scared playing it standing up because I am afraid Ill fall over with jump scares (never actually happened so far though) and break stuff. If I play while sitting down, I just run around not really worrying if I encounter the bad guys as they arent really that creepy looking. Its kind of fun, but pretty repetitive overall. Graphics are very very basic here too which just really makes it hard to feel immersed. Definitely on the lower end of immersion for games I have played on the quest so far. Not a bad purchase though for its small price tag.\n\nHelpful | 1", "wouterjunkDec 25 at 9:11 AM\nGreat game!\n\nWhow. I just played it like 15 minutes and realized horror games are nothing for me  but it is really well made!\n\nHelpful | 0", "martyteebzNov 27 at 11:36 AM\nDo Not Play if You Get Motion Sickness\n\nI have played through the whole game and really enjoyed it. However, whenever I show it to anyone else, they get motion sickness after only 2 minutes and have to lie down for over an hour before theyre able to recover. Most games with walking controls will limit your peripheral vision in order to prevent motion sickness, but this game does not. I think I havent had the issue because Ive played a lot of games with walking controls that do limit your peripheral vision and so Ive gotten used to it. Ultimately, if you have been using your VR headset for a while and dont get motion sickness easily, I would recommend this game, as its very immersive and genuinely frightening. However, if you are new to VR, or are interested in sharing this game with others new to VR, I would not recommend buying this game.\n\nHelpful | 5", "Sidx21Dec 30 at 12:47 PM\nVery scary\n\nLove the relatability through random dungeons, and the main story is full of jumps.\n\nHelpful | 0", "ray.bradshaw1Jan 3 at 6:26 AM\n\nGreat scary game love it but not to happy about keep paying for same game first on psvr then go now quest\n\nHelpful | 0", "cutie_azn_boixDec 16 at 9:16 AM\nAlway like scary game\n\nI only try once didnt finished the game yet it make me got sickness I read all comment before purchase hope they upgrade not making me got sickness\n\nHelpful | 0", "WeenSilyumsNov 10 at 9:52 PM\nSupspenseful and scary!\n\nIm really enjoying this game, sometimes its too scary and I have to stop playing! You progress through randomly generated levels with only a map and lantern, which you need to keep refilling in order to have light. Its mostly stealth and you must avoid, hide, or run from the various monsters and ghouls.\n\nThe horror atmosphere and music really add to the spookiness. My only criticisms are that there are not too many objects to manipulate in the game and that so far the style of gameplay stays the same. However Im only a few levels in and I still really enjoy exploring with the map and progressing through it. The randomly generated levels helps keep it interesting too so theres some replayability.\n\nHelpful | 2", "deadczechDec 21 at 11:10 AM\n\nCant beat it for the money. If you like jump scares, youll love this game. Invest in a set of adult diapers.\n\nHelpful | 0", "vadim.gorodetskyNov 17 at 4:50 AM\nSurprisingly scary...\n\nThe video doesn't do this one justice. Judging from screenshots and videos I couldn't figure out how this game with weak graphics and basic gameplay can scare people (youtubers and streamers) so much. But the price is really low so I decided to give it a go. A month later, both me and my wife can't make ourselves to finish the campaign. The atmosphere is really scary and all the elements in use are effective in giving you the creeps and then startle you out of your mind. I took it to work and several of my colleagues shrieked like little girls while taking off the device in a hurry while playing.\nGreat experience well worth the price! Try it in an open area with the Guardian off!\n\nHelpful | 1", "SMPL82Dec 27 at 8:28 PM\nAmazing game!\n\nThis is the best party horror game. Terrifying to play & hilarious to watch.\n\nHelpful | 0", "jeff.xu.7Nov 13 at 12:42 AM\nScariest game ever\n\nIt always blows my mind how my self proclaimed horror game super fan friends can only last 5 minutes in this game even with the sound off. It looks so fake from oculus cast in my phone, but my friends seem to be scared beyond anything they can imagine from previous horror games and movies.\n\nI personally never ventured far into the game (menu), but I think its an interesting game to get because it makes you think hard about what is real and what constructs our sense of reality. I guess a few low resolution polygons are enough to convince people they are being haunted for reals if the object appears 3D and right in front of you\n\nHelpful | 1", "BringhurstOct 3 at 6:18 PM\nScary, but why am I buying it twice?\n\nIt's genuinely unnerving, but I waited for this with the understanding it would be free since I bought this on Gear VR. The textures and locomotion don't seem different. Why didn't this qualify? But still, yes, it's definitely scary and I won't play it without someone watching, cause I'm a coward.\n\nHelpful | 10", "SphooxJan 2 at 1:06 PM\nPooped\n\nA real scare. But if you want to cry of fear.\n\nHelpful | 0", "arnorsigDec 28 at 10:35 AM\nVR horror\n\nGreat horror game, had a good scare a couple of time.\n\nHelpful | 1", "scott_1127Nov 27 at 2:28 AM\nBest game ever\n\nThis game is a masterpiece of horror. Best $10 I have ever spent. The game is pretty deep too with hours of gameplay to beat the main story. Honestly, I hoping it was shorter. Buy it if you dare!\n\nHelpful | 1", "Butterdidit2Nov 8 at 11:58 AM\nHorror to the max\n\nI bought this game wanting\nTo be scared. I must say I was walking down the hallways and turn the corner and this demonic women appears. I screamed at the top of my\nLungs. I was so\nScared, now I wont play this if nobody is In the room. If you want to be scared this\nIs the game for you. Worth it! Love being scared. Puts all your senses on edge. Awesome!!!\n\nHelpful | 0", "david1456Dec 29 at 4:52 PM\nGame is fun luv it\n\nThe game is fun looks great\n\nHelpful | 1", "AnderstarsOct 6 at 7:56 PM\nHOLY\n\nI remember watching markiplier play this in dk1 years ago and thinking how incredible it would be to play this in vr. Folks don't think that because it's older or not AAA or anything that you can skip this one. It is INCREDIBLE. There is nothing like exploring a haunted crypt with a dim lantern and numerous monsters waiting within. I have never screamed so much in my life. This will make you're Halloween! Perfect for a Halloween party or something. Just holy cow wow.\n\nHelpful | 5", "coleymoley67Nov 4 at 4:27 AM\nLove it\n\nI love playing horror games. I love the feeling of the only protection is the lamp that constantly goes out, it really adds to the experience of feeling helpless. Ive played it all the way through and it was one of the best experiences. The details on the walls making it feel more realist and the creatures are very unique.\n\nHelpful | 1", "Dittoman17Dec 4 at 1:19 PM\nMust have for horror fans\n\nAlmost scarier then the excercist game with its uniqeu monsters and dark hallways. But some may not like it for the \"walking simulator vibe\" it gives off.\n\nHelpful | 0", "VerminXODec 25 at 7:54 AM\nWould recommend\n\n10/10 spooky. Scared my sockskskksks off.\n\nHelpful | 1", "john.spacksDec 4 at 7:00 PM\n15 minutes max\n\nThere is no horror movie I won't watch, but dread Halls is a game that I can't play for more than 15 minutes. That's a really good thing\n\nHelpful | 0", "thickboiyeetJan 1 at 12:41 PM\nWHY\n\nI keep on getting killed by the monster when it goes through walls I dont know if thats a glitch or if thats supposed to be part of the game can one of the developers reach back to me\n\nHelpful | 0", "ANGERSNIPEROct 7 at 4:50 AM\nVery first thoughts\n\nSo I just purchased Dreadhalls and have played about 30 mins or so.\nFirst thoughts are the controls and movement are really natural feeling with almost no motion sickness.\nSecondly - yes it's freaky. I jumped a couple times so far.\nMy only issue is the interaction with objects in the halls - of which, other than items to collect, there is really none. Your hand just passes through them as though they weren't there. Chains, jugs, candles etc.\nSurely for added immersion these items should be able to be picked up/moved/thrown etc regardless of there usefulness.\n\nHelpful | 19", "ascend1ntolightOct 24 at 12:18 PM\nTerrifying\n\nI dont know what it is about the thrill of being scared and surprised but it excites me, especially if a video game is able to execute that very well..as this game does in every way. I havnt beaten it mainly because i have to prepare myself before putting my headset on and playing this game...IT IS SCARYvery very scary just seeing the pictures does not show much of that but once you are in you are in...you will have the hairs on your body up to the ceiling..rising heartbeat heavy breathing you may even have to take your headset off or pause the game to compose yourself again. There was a few moments where i was literally shaking and breathing heavy. The game is very unexpected and you are not sure exactly what your gonna see next or where or when..not even silent hill 2 scared me as much as this game scary is an understatement. As far as gameplay there is not tooo tooo much you can do beside run hide explore pick up things you need, read scrolls to find out the story, turn your lantern on and off and look at your map...but thats all i need in this game because the scare factor is what makes this game shine..you really feel like you are there! And the music and voices keep you on edge. I love this game just for the fact that its not some cheap random jump scare game...its like jumping into the real thing! Amazing job team \n\nHelpful | 4", "Transient_VagabondDec 12 at 12:15 PM\nA game my girlfriend will play.\n\nAnd she loves it so much, she suggests that we play it. Its a fun game to be a spectator.\n\nHelpful | 0", "iamballzdeepNov 7 at 5:29 PM\nScary AF\n\nThis is probably the only game that can give me a scare. The ambience is well done, never letting you get comfortable. The fact that you're only armed with a lantern adds to the intensity. Proof that you don't need top end graphics to have a good time.\n\nHelpful | 1", "z0mbiekillerDec 14 at 12:06 PM\nTrue horror\n\nEven though I played all sorts of horror games from outlast to resident evil 2, this game takes it to a whole other level.\n\nHelpful | 0", "TichraiDec 1 at 5:28 AM\nWorth it\n\nThe story is a bit short, although more than sufficient for its price. Very atmospheric, very creepy. Great for scaring your friends\n\nHelpful | 1", "Man1ceNov 27 at 2:27 PM\nI really enjoy it.\n\nIm really enjoying this game, I like the anxiety and anticipation of going around the corner. It can be a bit clunky but other than that, it is very easy to play and lose yourself in.\n\nHelpful | 0", "scotta72Dec 22 at 4:47 PM\nAwesome\n\nLoved this game. Very intense\n\nHelpful | 0", "operator139Oct 3 at 4:50 PM\nThe definitive horror experience for VR\n\nEasily the best VR horror experience. So chilling. Also it supports cross buy! These devs are amazing and always want the best for their games. I really suggest this app. Plus its only $10. Ive bought this game twice on different platforms and dont regret it one bit!!\n\nHelpful | 4", "Doctor008Dec 22 at 3:00 PM\nToo spooky\n\nIt's too spooky\n\nHelpful | 0", "Up_And_AtomDec 10 at 8:46 AM\nF**k me!\n\nThis game is more scary than when I thought I had HIV\n\nHelpful | 2", "bobbycliffordNov 28 at 8:12 PM\nScariest game experience\n\nIf you like scary oh this is scary. This game has a story and just a normal escape mode aka random maze and it gets so scary\n\nHelpful | 0", "paddyaddyOct 18 at 9:32 AM\nBe warned\n\nOh my God this is very Scary, after reading a previous review I had to give it a go because I thought no he cant be serious its only a game! Well believe me I had to take the head set off lol it scared me that much but I have to go back again which I did and yes it scared me again . It makes the hairs on the back of your neck stand up and I actually screamed out a few times with my partner laughing at me saying whats up I said here you have a go and after 5 mins she said no Im not going through that door Emm who laughing now. If you like to be scared well this is for you and for the price its well worth it . Try if you Dare!\n\nHelpful | 3", "LayDownBoyOct 28 at 6:51 PM\nGreat game but....\n\nIn my opinion this is one of the best horror games on the quest but, 3 notes I noticed. First off the obvious , dying in this game is like dying in your sleep, very uneventful or scary. The noise made and the last sight is very dull and seems rushed. Secondly, I've played and beat the game with almost no contact with monsters. It needs more monsters. Thirdly..more jump scare with build up. Now although I consider this game to be very well polished. It could always use a little boost\n\nHelpful | 0", "Abc123xzvndrDec 12 at 11:52 AM\nGreat atmosphere, but ...\n\nThe game is great overall. However I cannot play it for more than 15 minutes at a time. Motion sickness Kicks in at around 10-15 minutes mark.\n\nIf you have no history of motion sickness. Would recommend this game. It is worth its price\n\nHelpful | 1", "BladeocityOct 14 at 1:51 PM\nStressed in All the Right Ways\n\nIf you are a fan of horror, buy this game. If you are looking for a good Oculus Quest game for cheap, buy this game. Even if you don't fit in either category, chances are, you should probably buy this game. For $9.99, this game provides so much more bang for its buck unlike many other games on the Quest store. From it's spooky atmosphere, to the unnerving music, to the variety of enemies and horrors you'll come across, each of which you need to tackle differently if you don't want to end up as their next meal, Dreadhalls makes it so that there is rarely a moment where you need not to be on your toes.\n\nEvery room you enter is a gamble, every sound you hear an possible encounter with death, every safe room a sigh of relief and ecstasy. This game knows what it emotions it wants to draw from the player and does so almost flawlessly. While a few hiccups in terms of audio and gameplay may occur, these instances are few and far between and do not take away from the immersion all that much. While like most games on the store, it's not the longest expirence in the world, but Dreadhalls counteracts that with its low price and mode that randomly creats a map for the player to traverse through, adding a great sense of replayability to a game that was already more than worth the price of admission.\n\nScary games are currently something that the Oculus Quest store needs and has been lacking since its release. Dreadhalls delivers on that front in spades, all in time for Halloween season, and with crossbuy I'll end this by restating what I said when I began: buy this game.\n\nHelpful | 4", "oysterassassinNov 17 at 1:45 AM\n\nJust not a compelling game. Moving around is clunky. Ghosts arent scary. Tried and tried to find some value in it but I cant. Maybe as a freebie. $2.99 would be absolutely top dollar but I, personally, would be unhappy with that price.\n\nHelpful | 4", "MattyProfOct 28 at 1:40 PM\nToo much movement not enough gameplay\n\nI was excited to try this game based on the reviews. They did a great job of creating suspense and the story is interesting. Running through the halls is making me physically sick after 15 mins. I dont get motion sickness easily. They could have easily minimized the extraneous motion or at least allowed unlimited running which isnt as bad. The questions from the heads are kind of lame and are redundant. They arent helpful to the gameplay, neither are all the notes. This game shows what can be done in VR in terms of creating suspense but gets boring fast. I think Im done playing this one.\n\nHelpful | 7", "larry_legendOct 3 at 10:54 AM\nLike walking through a nightmare...\n\nHave you ever wanted to sweat and crap your pants from something other than sushi poisoning? Well have I got the game for you...meet Dreadhalls. Full disclosure: Ive never played this before. I know this has been around for some time, but this is my first trip into the halls. Ive seen reaction videos, Ive read the reviews, but I havent experienced it yet myself. This isnt your whimsical 80s David Bowie-inspired labyrinth. This is terror, dredd, and death all rolled into one underwear-stained package. Im a huge horror VR fan and its safe to say this doesnt disappoint. Its not a jump-scary game; sure theres things thatll appear suddenly, but not in the same manner as say Emily Wants to Play. This is more of a wtf is waiting for me around the corner or I swear that demon saw me, is it chasing me? The feeling of helplessness from zero defense also adds to the nightmare....No one is coming to help you. Its just you, narrow hallways, and the dungeon ghouls as you search for the items to help you escape. The sounds of your screams become a regular occurrence ...so if you like consistent fear in your struggle to make it out alive, I highly recommend this.\n\nHelpful | 9", "InstaVR-Player1Oct 19 at 12:34 PM\nThis game should get the award..\n\nThis is the most scariest game ever... Not just for VR... It should get an award for the most scariest game of all time.. it is just Soo scary to that strong men shiver... I. Still yet to see anyone that did not get scared..\nGreat game but just too scary... The fear is so real and definitely not for the weak mind\n\nHelpful | 1", "ChavsniOct 20 at 11:36 AM\nThis game is awesome\n\nIt's a tad short but you can play randomly generated maps which is great when showing it to friends. The sound and dungeon setting is great and being able to move freely on the Quest makes it so immersive. Unless you really dislike tense and scary games this is a must have and at a great price too.\n\nHelpful | 1", "Miscreant-1Oct 25 at 10:44 AM\nDreadhalls\n\nThe start of this game is a little scary but as it progresses it'll make you jump 30 feet in the air if your dog comes and touches your leg or something while you're playing .it is horrifying that being said I love the game.\n\nHelpful | 4", "Soupdogg22Oct 12 at 6:45 PM\nGreat vr horror game for the price\n\nSort of a mix between slenderman and scp containment breach with a Medieval flavor. very real tension with a surprising amount of rooms and textures. Having an encounter with the monsters cause genuine spooks. Bonus: procedural mazes who doesn't love that.\nNothing mindmeltingly scary here but definitely fun to pick up and play from time to time due to it's replayability.\n\nHelpful | 2", "chaoswhistlerOct 6 at 6:14 AM\nSo scary I had to get a refund \n\nThis game is wonderfully made. The atmosphere is perfect. Controls are easy to understand. The mechanics are beautiful, like having to actually hold your lamp up to see your map. It's a simple, crisp experience.\n\nUnfortunately, it was scary as hell. I've played horror games on Xbox and been okay, but this was a whole other level of scary. I managed about 10 minutes of nervous play before I had to give in.\n\nIf you're stronger than me, give it a try!\n\nHelpful | 5", "Crashcourse5Dec 15 at 2:57 PM\nDLC?\n\nI love this game and its replay ability. Every corner had the possibility to scare. So dark and so sinister. I really love how you lose light and it gives challenge to the game.\n\nI know IT has been out for a long time, but an IT dlc would be AMAZING! Make a new environment (sewer) and have a Pennywise chase you through the sewer.\n\nI love this game, I just wish for an IT dlc to make this the perfect game.\n\nHelpful | 1", "Skow0001Oct 6 at 9:25 AM\nSppoky\n\nThis is the first VR horror game that I have ever played. It had me on edge with every room and hall that I entered. The sound effects and music were what really made the game great.\n\nThe only thing that I think should be added is the ability to interact with the environment more, just to make it more immersive.\n\nHelpful | 4", "Logan_HowletteOct 10 at 12:53 PM\nHeadphones are a must.\n\nLet me start by saying that I've only been playing for a little over an hour. My hands were so sweaty I was fearful of shorting out a controller. The game has excellent sound design that really make up for the inability to really push graphics on the quest. This was one of the first games that piqued my interest when first looking at the quest, and it holds up to my expectations. Phenomenal to play, even with friends streaming to a device.\n\nHelpful | 2", "AvetaJan 30 at 11:37 AM\nDizziness\n\nUnable to play it!\n\nHelpful | 0", "chexmax54Nov 24 at 3:00 PM\nWOW\n\nI had my doubts at first but this is actually the scariest game I've tried in VR YET!!!\n\nHelpful | 0", "JimBatmanOct 3 at 12:31 PM\nIntense Fun\n\nI don't know how people can post an accurate review two seconds after a game is released.\nI haven't finished this game yet but it is scary fun. I like the idea of being totally helpless against these monsters, it takes some real strategy to avoid getting killed (which has happened to me a few times already).\nIt's not going to win any graphics awards but it's well worth the money. Everything handles\nsmoothly, I experienced absolutely zero motion sickness.\nYou can't beat the scare for the price, dive in!\n\nHelpful | 5", "AlynnfarrellyOct 4 at 8:51 PM\n5/5 For Making Me Scream\n\nI love horror - horror movies, books, games, haunted houses at Halloween. It takes a lot to scare me as I've become used to typical horror. I'll be honest: as a 2D game this would not be scary for me. Immersed in VR is a whole different story.\n\nMy kids told me this game was really scary (from what they had seen on YouTube). At first glance, it looked graphically really basic. I mean, potatos in a crate, for instance, are a basic, flat 2D texture reminiscent of late-90s/early-2000s, how scary can this be? Well... As someone who does not scare easily at all, this game made me scream out a couple times (my kids came running in to see what was wrong, lol)! The ambience, the tension building, are done quite well and appropriate. It psychologically messes with you, while not overloading you with annoying jumpscares (jumpscares are cheap horror tactic, in my opinion). I was used to the extra sounds (whispers, etc) early on, but it did not detract from my experience as I still sometimes wondered if something really was behind me (just not gonna look Haha). Catching glimpses of something creepy from the corner of your eye, slowly turning your head around to see if something is or is not there, all that building of dread and tension from actual physical movement is very much intensified in VR (I loved it)!\n\nI loved being able to physically turn around to 'run away'. It's an instinctive movement that lends to immersion and is part of the gameplay. I am clunky with controllers trying to turn characters in games, so being able to just instinctively turn my body around while 'running' with my controls really can't be beat. I also walk and run \"in place\" as it helps prevent nausea for me.\n\nBut, boy, it made me scream...\n\nOh, I'm also thinking the creators are Doctor Who fans.\n\nHelpful | 4", "James04059Oct 12 at 4:22 PM\nVery scary\n\nThis is a really scary game I really enjoy it if I am being honest I have almost broke my ocolus by taking it off my head it true terror over all it has a really great and engaging storyline and makes you want to play more if I had only one suggestion for the game would be to make it multiplayer but only for 2 people because over that would make it to easy I think that this would be better because for the people who are to scared to play alone might have some consolation with a friend and then they can realize how great and fun it is\n\nHelpful | 0", "cubicninjaOct 10 at 8:55 AM\nVery well thought out.\n\nAll the ingredients are there the minute you launch the game.Creepy music, scary sounds, darkness and the creatures you bump into and the game gets a lot more unsettling once you have encountered your first creature.That happened for me after seeing the dog face to face as it lunged at\nme straight out of the darkness and killed me.From that point on every corner makes you wonder if something is waiting for you the minute you turn.\n\nIf you compare this game to Exorcist, for me it delivers the horror in a much better way as it is constant.The most comfortable you will ever be in this game is uneasy and unsettled which changes to fear when you bump into the dungeons residents, whereas apart from the horror sequences in the Exorcist, the game isnt scary at all.\n\nThis is also a great app for introducing a horror game to friends who are new to VR as you just launch and go rather than them having to solve a heap of puzzles before getting to any horror type content.\n\nAt 9.99 this really is a no brainer.Get the game and start getting scared.\n\nJust a tiny suggestion to the devs though.Ask the player whether they are male or female and have the corresponding sounds based on their choice.The immersion was broken a bit for my wife when she tried the game as the sounds of a man panting rather than a woman was naturally unrealistic for her.\n\nHelpful | 2", "Griffith_The_HawkOct 11 at 8:24 PM\nActually freaked me out.\n\nI love horror movies. Creepy films like Rose Mary's Baby and The Witch are just spectacular. They never scare me though. I never feel a flash of adrenaline and fear. Dead Halls made me feel a cold tingle in my head and at one point I had to take off the headset from feeling overwhelmed. This is legit, especially for $10.\n\nHelpful | 1", "Str4wzOct 10 at 7:43 AM\nSo fun!\n\nOkay this game is scary, actually Terrifying Im walking down a hall and I hear gurgling sounds behind me, I was frozen in fear. I heard the sound getting louder from behind. I was so scared I just took off the headset. It was so fun to watch my siblings play and get scared this game is worth the 10 dollars and you should get it if u wanna fright.\n\nHelpful | 1", "zack.slotkowskiOct 3 at 8:02 PM\nPlay with friends\n\nThe game is creepy as hell and you have to be psycho to play this alone. The noises you hear and demonic creatures you see is terrifying. I dont scare easily and I had to take the headset off at one point. I also have noise canceling speakers and IR sensor to play in the dark so that makes all the difference. I definitely wont be finishing this anytime soon and the fact that the dungeons change every time you play is awesome for only $10. Honestly, it is fun just watching your friends get scared to death. Job well done.\n\nHelpful | 4", "Yeet_thiOct 11 at 11:58 PM\nGood game to soil ur pants\n\nNever experienced being terrified in a video game before, jesus christ this was terrifying, came back to edit my review, JESUS FU$&&$& CHRIST THIS GAME IS TERRIFYING, if u play this and dont get scared u must have the balls of 20+ Trojan armies, like my Heart rate goes through the fuc$&& roof! If u want to give ur self a heart attack then get this fuc@$&@ game\n\nHelpful | 3", "psully4114Dec 11 at 10:44 AM\nThe graphics look pretty dated but...\n\nIts pretty atmospheric. It might freak you out. I dont think its going to blow your mind or redefine the medium or anything but it might make you s**t yourself if thats what you're into lol\n\nHelpful | 0", "shadowinist777Oct 10 at 8:43 PM\nScary as Hell\n\nLet start by saying this game is freaking scary! I was sceptical as to how well this game would do as a horror experience. Boy was I wrong, I dread every moment walking down the dark cold Halls of Dreadhalls  This game is full of suspense and anticipation . What's wrong with me!!! I hate it but I keep coming back to play it! I hate the statues, they are so hideous! I love this game!\n\nHelpful | 0", "ThatsPrettyNeatOct 5 at 6:35 AM\nScary as f***\n\nLet me preface this and say this is not for the light of heart whatsoever. I'm 30 minutes in and have had to take off my headset half a dozen times and scream the f word more times than I'd like to admit, playing this game around family is even worse because they tend to try a physically scare the s*** out of you too! I dont know if I have the balls to finish but I'll try just so I can see others play and laugh at them\n\nHelpful | 3", "redalert33Oct 18 at 7:49 AM\nGreat dungeon crawl/exploration/horror\n\nThe map designs are pretty simple, but the experience is thrilling and fun as you try to navigate a maze, running into monsters that have certain things that set them off (whether it's motion, or a light, or turning away from them). It was really fun to have to remember which way to \"defeat\" a monster while being creeped out, and glancing down at my map to figure out where to run to next! Other than Face Your Fears 2, this is the creepiest game I've found on Quest. Total content probably ran about 3 hours, but you can also play randomly-generated maps to increase replay value.\n\nHelpful | 4", "CaptAARRGGHHOct 7 at 1:16 PM\nIdentical to the Gear VR version\n\nFirst off I love this game, so why the 3 stars? Because it's a direct port from the Gear VR. A small change has been made to accommodate hand tracking with the lamp and map, there is a new opening doors mechanic, but that's it. No other changes were made that I can see. No new assets or textures. And a few mistakes too, for example it doesn't put the floor at the correct hight. Same default hight as Gear VR. However I thoroughly enjoyed it again, even more so with 6DOF. If you've never played it it's a no brainer, very imersive, scary and fun. Glad it came out despite the lazy port. Keeping my fingers crossed for dreadhalls 2.\n\nHelpful | 8", "ParadiseDecaySep 26, 2019 at 9:52 AM\nStill scary on Quest!\n\nHere's a video of me playing Dreadhalls on the Quest in a HAUNTED CELLAR!:\nhttps://www.youtube.com/watch?v=krRG1gBujpo\n(Please Note: Links might not work from Oculus, so please search YouTube for 'Paradise Decay VR Dreadhalls')\n\nMy Thoughts:\nOne of the SCARIEST PC VR Horror games now on Quest!\n\nHelpful | 9", "ChadwickSirJamesOct 3 at 10:40 PM\nSerious lack of great dungeon crawlers\n\nThis is one of the greatest dungeon crawlers.\nA classic staple that people will recall when reminiscing about the early days.\n\nFirst played on Gear VR in 2015. 4 years later I still love playing it.\n\nMore gothic haunting experiences please!!!! Do you hear me VR industry?\n\nHelpful | 4", "MichaelM_JROct 7 at 11:33 PM\nAwesome but flawed\n\nThis is honestly a freaking scary game . The one issue Im having is glitchy graphics on the Quest. When moving your head, the picture blurs, lighting will appear and disappear based on the angle of your head, and there appears to be a gray haze especially noticeable in dark areas. I had none of these issues on the PC version.\n\nHelpful | 3", "noneedtotalkOct 5 at 6:30 PM\nwell done Developers!!\n\nthe Oculus Quest is a very good with deep blacks and this game is very dark so it doesn't feel like you're losing any attention to detail and the controls are simple enough that my mother can understand how to play the game and the sound design is exceptional and the levels are randomized so there's so much replay value. thank you for the wonderful experience!!\n\nHelpful | 1", "God_DoomOct 3 at 7:10 PM\nGreat game. Very scary\n\nThere r no words for how great this game is. Love everything about it. Cant believe a 10$ game is this great. If u think it wont scare u buy it. Im a huge fan of horror and thought Id b fine but it freaked me out multiple times. Not so much jump scares either which was a really nice surprise\n\nHelpful | 2", "TheKillerWhale707Oct 3 at 11:22 PM\nReally well done!\n\n5/5\nThis game is great! The atmosphere really draws you in. Extremely creepy dungeon, full of strange noises, quiet whispers and slow shuffling. Couple that with some pretty good jump scares, and an interesting enough storyline, and you got yourself a really fun game. The puzzles are simple in nature, but difficult in having to walk around every dark corner and open every creaky door not knowing what terrifying creature awaits you. Really well done devs.\n\nHelpful | 2", "Alo1984Oct 6 at 7:50 AM\nWorth it\n\nDefinitely worth the $10 price point. This is an experience I will enjoy having when I have people over to watch their first time that they freak out and scream. I do hope they add a turn around quick button though because running from the dog creature is hard when you have to turn around so slow.\n\nHelpful | 1", "MasterMahanOct 10 at 10:01 PM\nTERRIFYING\n\nI've been in VR weekly over more than 3.5 years.. and this game had me screaming in terror and waking my kids up at night. .. wow.\n\nHelpful | 4", "mcwhorterbryanOct 4 at 2:34 PM\nCreepy factor achieved!\n\nI am a fan of horror movies and games and Dread Halls delivers some great chills. The visuals and sound effects draw you in as you wander the maze of hallways avoiding monsters that seem to want to kill you. I say seem because I never hang around to find out. There is a sprint button and I use it a lot.\n\nI am glad to recommend this game and for only $9.99, it is a fantastic value.\n\nHelpful | 1", "BlueOrcaVROct 4 at 12:51 AM\nMust have for Horror fans\n\nI had Dreadhalls on my previous headset, the Gear VR, and I was so excited for when this game was announced. I bought it asap when it released and I am extremely impressed. Its honestly an extremely horrifying experience that I really enjoy. This game had a very smooth release as of all the current reviews, I can tell the developers did an outstanding job. I have been playing quite a bit today as I have gotten to the 3rd main area after the 7 levels as well as a ton of random maps. I love this game and I highly highly recommend this game for the cheap price of $10.\n\nHelpful | 1", "RadicalRobOct 14 at 7:29 PM\nToo scared to play\n\nPersonally, I need to take multiple breaks in between so that I don't suffer a heartattack and pass out. Really puts you in the game and gives a sense of dread and panic. Can't wait to recruit unsuspecting friends to play this game!\n\nHelpful | 2", "KenswiftOct 8 at 6:45 PM\nNot scary and Im floating above ground\n\nI couldnt seem to get this game to understand that I wasnt 8 feet tall. Every other game recognizes the floor but this one wouldnt. On top of that, its just not scary. Brookhaven experiment on the Vive was scary, this is just elementary graphics with some sound effects.\n\nHelpful | 8", "ummwhatsureOct 4 at 9:05 AM\nVery Effective.\n\nI don't scare easy and twice I took the quest off mid game because the tension was too much. I mean this in the best possible way. This game is exactly what makes VR so great and unique. I love when games do not hold your hand and when I ran out of oil for my lamp and had to step out into the dark I felt chills. A lot of this is due to its excellent sound quality.\n\nThis game is well worth more than its price and if you like horror It is a must own. People who do not like horror or being spooked will have no value for this game understandably.\n\nHelpful | 0", "dyl432Dec 2 at 7:14 PM\nFun and scary game\n\nTotally worth $10\n\nHelpful | 1", "BMFSHOWOct 2 at 12:26 PM\nScary as you know what\n\nAll I can say is its freaking creepy. Fun but very creepy.\n\nHelpful | 25", "UniQue_ToeTomNov 23 at 1:22 PM\nSo scary I genuinely cried\n\nI'm afraid to play this game now.\n\nHelpful | 0", "godlessOct 25 at 4:19 AM\nExactly what is promised.\n\nCan't play the game myself, am too scared. Love to watch others play it and feed of their screams of torment.\n\nHelpful | 4", "SevensleeperOct 3 at 3:54 PM\nI was waiting for it on Quest!\n\nI played with this game first time 3 years ago on my Gear VR.....\nBut now.... I can play with it on my Quest.... Yes baby....\nI was sh.... t to my trousers few times.... \nI'm love it.......\n\nHelpful | 2", "BloodiedNov 2 at 7:16 PM\nScary as hell!\n\nGreat game. Decent difficulty. Random dungeons add loads of replay value... all for $10?! Easy decision here. Buy it.\n\nHelpful | 0", "DrachenherzOct 11 at 1:31 AM\nIntense\n\nToo scared to play.\n\n10/10, would actually pay 10 bucks again to not play a game.\n\nHelpful | 4", "LouisObviouslyOct 21 at 5:01 AM\nTerrifying\n\nThis game is the only game so far that has literally made me s*** myself  which is exactly what you want from a horror game!\n\nHelpful | 5", "MysticJoeOct 21 at 7:02 PM\nOne of the best - scary and creepy!\n\nLoved it. Going through the halls, first time killed. I have been avoiding horror games, but decided to try. Very good, satisfying and scary. More than worth the $\n\nHelpful | 1", "KelvinUOct 14 at 8:44 PM\nAmazing!\n\nThis game looks and feels a lot better than I expected. Very immersive with headphones, as the sound design does not disappoint. Great job, I just about soiled myself playing.\n\nHelpful | 3", "JayJayNNov 6 at 4:12 AM\nSadly disappointed in this game\n\nSaw all the good reviews and recommendations and thought this game would be scary and fun but ended only being a thrill in the first area then after became boring, sadly I no longer have an option to get a refund =\\\n\nHelpful | 3", "johnathan.scott.566Oct 14 at 11:59 AM\nHOLY JESUS\n\nThis game is terrifying! I played face you fears 2 that games is based on jumpscares and phobias this is game is based or being trapped subtle little noises and stuff appearing our of the dark.\n\nHelpful | 1", "DiamondDutyOct 3 at 11:16 PM\nExactly the horror game Quest needed!\n\nThis game has a story, AND it has randomly generated levels! (Good replay ability/perfect to play with friends)\n\nIts scary, and immersive, and has great monster mechanics.\n\nHighly recommend. 5/5\n\nHelpful | 5", "Drizzydre818Oct 18 at 1:57 PM\nI recommend this game to horror fans!\n\nBest game in quest store! with really good replay value! I recommend it to anyone who thinks they can't be scared so easily.this will change that ! Bwahaha!\n\nHelpful | 2", "kinsarc0Nov 3 at 6:48 PM\nLiterally ran into a wall.\n\nI may only ever have the courage to play the game once but it was still worth the price.\n\nHelpful | 0", "PublicDragoniteOct 18 at 2:58 PM\nTerrifying\n\nHad some of my kids play. Every single one of them screamed at multiple points. Im too much of a chicken to play myself. If you want horror, its here.\n\nHelpful | 1", "SerpulaOct 4 at 10:16 AM\nDisappointing... and terrible smearing\n\nFirstly, the game is cheap, and reasonably well put together, I seem to be an outlier in my opinion here. Personally I didnt find it scary in the slightest (and I am a monumental wimp with these things). Actually I found it quite boring...\n\nMy main issue was black smearing. The game takes place almost entirely in the dark and colour next to black smears horribly as you move your head, like the edges are warping, which is quite nauseating.\n\nHelpful | 13", "ADON_CATOct 8 at 6:54 PM\nEfficient Service\n\nI paid them 10 dollars to scare me and they did. As soon as I opened the game! Its just unsettling to walk around and finding out youre not alone just makes me wonder whats behind me. Might as well look!\n\nHelpful | 0", "UBSERDOct 5 at 5:23 AM\nStill good.. But needs more updates.\n\nWhy does this version perform worse than the Go version? I played one level and it had horrible stuttering and hard hitching about 3 times and when scary events happened ruining the effect. On top of that there is a lot of screen ghosting when looking around in the darkness. This was not present on the Go version.\n\nFor how long this game has been out and how simple the graphics are the Quest should handle this with no issues.\n\nUntil they update, it is the most inferior version of Dreadhalls and being one of my favorite horror games of all time that is a big disappointment.\n\nHelpful | 3", "Mackem33Oct 3 at 2:03 PM\nScary but fun..\n\nThis game is great and has a really good scare factor love how all the creepy sounds like whispering keeps you on edge and you never know whats waiting around every corner for 7.99 this game is a must for any horror fan.\n\nHelpful | 1", "maximus5232Oct 26 at 12:15 PM\nTerrifying\n\nWhen I first saw this game I thought it didnt look that scary so I was going to get it b as my V first\n\nHelpful | 1", "ItalianGuy81Oct 9 at 11:23 AM\nScary as sh#t\n\nI don't get scared easy but this game turned me into a little scary bytch..lol I screamed, Jumped and turned it off a few times! Awesome game if you like scary stuff, I love it!\n\nHelpful | 2", "GeneralFuferOct 4 at 9:44 PM\nYou'be been warned\n\nLook back frequently. Take your time around the corners. But, above all, try to keep your lamp lit as much as you can. Trust me... you do NOT want that light to go out.\n10/10, would soil pants again.\n\nHelpful | 1", "MORTONICOct 3 at 6:26 PM\nAmazing\n\nProbably my favorite quest game and one of the scariest horror games I've played I think It would be really cool if their was a monster that could hear your mic and find you.\n\nHelpful | 4", "ChennamanOct 5 at 8:27 PM\nDefinetly scary!\n\nI had this on the GeaR VR for the Samsung note, and I really enjoyed it on that. However this immersion on the Quest is amazing!\n\nHelpful | 2", "Mugg-Oct 4 at 5:47 AM\nCreepy fun\n\nThis game is well worth getting. It made me jump a few times and is great having friends try and seeing their reaction. Walk through halls and rooms with a lantern trying to find your way out. Well done\n\nHelpful | 1", "AnthonyR86Oct 23 at 5:04 PM\nGreat game\n\nGreat for getting scares, havent had one person not get scared playing this game.\n\nHelpful | 2", "casefreshOct 8 at 8:55 AM\nReally scary and easy to play.\n\nDefinitely worth the money. It has freaked out my entire family and been a load of entertainment. Make sure to use the cast feature when hanging out with people.\n\nHelpful | 2", "BillCOct 12 at 2:33 PM\n... send help!\n\nI'm hiding in my closet. I saw her around the corner. I crawled my way in here and I'm scared to open the door to see if it's safe.\n\nHelpful | 2", "gideonstrangeOct 5 at 10:31 AM\n\nStupid game. I screamed like a little girl the first time I played it. Definitely worth $10. Id love to see this in real graphic scenery like Real VR Fishing. Good fit for the Halloween season.\n\nHelpful | 2", "Jimbob2bobOct 3 at 12:38 PM\nNo crossbuy?\n\nI have the full version on the rift, but I had to purchase this on my quest. What's going on? You promised crossbuy.\n\nHelpful | 8\nDeveloper ResponseOct 3 at 2:18 PM\n\nYes, the game supports cross-buy between Quest and Rift. There was a short time right after release when it wasn't working properly, but Oculus confirmed to me it should be fixed now. If you already owned Dreadhalls on the Rift and purchased the game again while cross-buy wasn't working, please go ahead and contact Oculus Support so that they can refund you.", "JoeSargeant93Oct 27 at 2:04 PM\nGreat for scaring your friends\n\nEndless fun watching your mates jump out of their skin\n\nHelpful | 2", "MoneybagvrNov 12 at 6:21 AM\nCrazy scary\n\nGet ready to be scard\n\nHelpful | 1", "reags78Oct 6 at 8:01 AM\n\nOne of the eeriest games Ive ever played. So much suspense followed by jumpy encounters with evil beings. The flickering of the lamp and background noises add some seriously haunting vibes.\n\nHelpful | 1", "FirestoneXOct 14 at 7:26 AM\nI've bought this game 3 times\n\nOn windows mixed reality, oculus Go, and Quest. And I'm still to scared to play it. 2 spoopy 4 me. 10/10 would buy again.\n\nHelpful | 1", "samsonite312Oct 5 at 2:21 PM\nA pants-sh***ing experience\n\nHoly crap, this game is scary af. Horror movies don't really faze me much, but this game sure as hell does! The atmosphere is perfectly done and very immersive.\n\nHelpful | 1", "arcaneskinnyOct 9 at 9:00 AM\nThis game is self inflicting punishment\n\nThe hair on my legs were standing up while playing this game. This game would probably be scary playing it on a flat TV with headphones on.\n\nHelpful | 1", "riftlover1000Oct 27 at 1:59 PM\nVery realistic.\n\nMakes you question reality.\n\nHelpful | 3", "PolemarxosNov 18 at 7:29 AM\nAwesome!\n\nI love that game!\nVery good graphics and replayability with random maps!\n\nHelpful | 1", "Nuttynatty354Oct 3 at 7:24 PM\nSuper Scary\n\nStill just as scary as I remember. Looks and plays pretty well. I did have the occasional stutter but aside from that the game is really well done!\n\nHelpful | 2", "Rolyat716Oct 5 at 8:02 PM\nRad\n\nTitle says it all. Its scary, but it's not gonna ruin your night or anything. Just a good ol time, especially with friends.\n\nHelpful | 4", "OctallaOct 4 at 6:44 PM\nScary yes, saving error?\n\nI like the atmosphere. i was playing an hour. when the battery was empty i want to leave game, but it says if you leave the game now, you loose the map? Thats bad :(.\n\nHelpful | 2", "TexasFreemasonOct 24 at 7:12 AM\nThe Title Says It All\n\nHeck of a fright for just $9.99!\n\nHelpful | 1", "Mr_ToddDec 13 at 2:30 AM\nNot that Scary\n\nReading the reviews below I thought this would be the scariest thing ever! it's not that Scary maybe cause I'm an adult. Still it was perfectly challenging for me, and I had a lot of fun in it.\n\nHelpful | 2", "dingoflingOct 14 at 2:25 PM\nFrom Daydream View to Oculus Quest\n\nEnjoyed this the most on my Daydream View long ago. LOVE it on the quest.\n\nHelpful | 1", "manhunter2002Oct 17 at 5:18 PM\nFreaking epic!\n\nI rarely get scared, and this made me jump SO MANY TIMES\n\nHelpful | 1", "max.bultermanOct 3 at 3:58 PM\nI hate this game (in a good way)\n\nThis game is so scary, I get scared of literally every noise in my room now and I have stopped playing.\n\nHelpful | 3", "MobiugearskinOct 13 at 2:14 PM\nScared\n\nThe atmosphere in this thing is palpable and the controls are intuitive and responsive. Bring spare underwear\n\nHelpful | 0", "CongratulationsOct 6 at 11:47 PM\nStill scary as PC Rift.\n\nStill as scary as the Rift Version on PC, if you are into horror this is a recommend app for scare fans.\n\nHelpful | 3", "jorgenReOct 3 at 11:48 AM\n\nHorrifying!\n\nHelpful | 3", "HooverFlyOct 8 at 1:33 PM\nJumpscarevillle\n\nGreat fun.\n\nHave to stand up to turn around as the snap turning is motion sick inducing.\n\nSound design really makes this game work.\n\nHelpful | 0", "seloaceOct 7 at 7:13 PM\nBest interactive. Ive played in vr\n\nSo scary with such easy and smooth gameplay I will take my time with this one. One day at a time\n\nHelpful | 0", "Zork71Oct 7 at 2:33 PM\nWow!\n\nThis is a steal for the price! Gets more intense the more you progress dont let this fool you!\n\nHelpful | 0", "ImaSuguOct 3 at 7:18 PM\nI haven't screamed in a very long time\n\nThank you for that Dreadhalls!\nI noped the hell out of there\nWill play again\n10/10\n\nHelpful | 2", "TalamiusOct 4 at 9:44 AM\nFor the money you cant beat it.\n\nForget Vader. A VR Classic and the best value for $10 on the store. Looks and runs great on Quest!\n\nHelpful | 1", "beattenOct 5 at 7:10 PM\nI screamed so loud...\n\nThe atmosphere and sound in this are top notch. It builds tension... And then it gets you. Worth it.\n\nHelpful | 1", "Paine2236Oct 6 at 4:36 AM\nBrilliant\n\nSimply put it's awsum and has plenty of replayability if that's even a word\n\nHelpful | 1", "kevinleekleyOct 3 at 5:15 PM\nGreat horror game\n\nLove this game and thank you for making it a cross platform buy!\n\nHelpful | 1", "nickthompson35Oct 3 at 4:19 PM\nInsanely scary\n\nEither Im a big baby or this games scary as balls\n\nHelpful | 2", "winb87Oct 12 at 6:58 AM\nI wanted a scary game.\n\nNow I'm too scared to play it. Worth it.\n\nHelpful | 2", "PngawarriorOct 4 at 1:12 PM\nScary\n\nNice atmosphere...im hard to scare and this did the job\n\nHelpful | 1", "skm2Oct 6 at 4:54 AM\nMotion sickness after only a few minutes\n\nI saw all the great reviews but couldnt play more than 2 minutes before strong motion sickness\n\nHelpful | 10", "Nathan.FortkneeOct 3 at 1:04 PM\nAmazing\n\nFirst couple min I already had goosebumps\n\nHelpful | 2", "clive.mills.777Nov 13 at 1:13 AM\n\nPlease please a 2nd w w fighter game (ie spitfires etc)!\n\nHelpful | 0", "richp-Oct 31 at 3:29 AM\n\nBoring\n\nHelpful | 4", "3chipsOct 11 at 9:50 AM\nSeasick\n\nD### what a strange game. Getting sick and had to quit playing after about 5 min. Make a teleport option please\n\nHelpful | 3", "PamelahaOct 9 at 1:07 PM\nNope\n\nMade me sick almost immediately.\n\nHelpful | 5", "shanakoOct 11 at 2:25 PM\nBuy it on another platform.\n\nThis game looks and feels great on other platforms. It isn't a very enjoyable port.\n\nHelpful | 2", "dumptruck_dsOct 3 at 10:42 AM\nSo frightening\n\nBelieve the hype. One of the best examples of presence in the VR medium. I dare you to play it alone!\n\nHelpful | 5"]