{"App Title": "Drunkn Bar Fight", "App description": "Drunkn Bar Fight is a simple, immersive, silly, rowdy game. Now with 2 player Co-op! Take turns throwing bottles, darts, chairs, tip jars or anything else you can get your hands on at opponents. Or use those same items to smash the other patrons to the floor and then toss them through plate glass window. Enjoy performing socially unacceptable behavior without the resulting obligatory visits to the hospital, jail and courts. The only limits to the mayhem is your imagination and your moral decency.", "Purchase section": "$16.99Add to WishlistShareComfort: IntenseSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Co-op", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Fighting", "Languages": "English, English (US), English (Australia), English (Canada), English (UK), English (South Africa)", "Version": "4.51", "Developer": "The Munky", "Publisher": "The Munky", "Website": "https://www.themunky.com/", "Release Date": "September 12, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "The Munky\n\nDrunkn\nBar Fight\n\nDrunkn Bar Fight is a simple, silly, and semiimmersiveVRgame, where you can and will enjoy performing socially unacceptable behavior, liketakingturnstryingto hit opponents with thingssuch as;bottles, darts, chairs, or evenPEOPLE, Or use those same items to smash your opponentsto the floor and then toss them through a glass window!\n\nGet Drunk Here\nLearn to Play\nDBF Wiki\nQuiVR\nGet QuiVR\n\nQuiVr is the defining archery experience, made from the ground up for Virtual Reality. Grab your bow, arrows, and some friends to fight the enemy onslaught\n\nWith satisfying, intuitive archery gameplay, QuiVr is the game of choice for both VR veterans and newcomers alike. This is what Virtual Reality was made for.\n\n\n\n\nCONTACT US\nSubmit\n\nHermosa Beach, CA 90254\n\nCall Us:(818) 793-3003\nEmail:Company.Munky@gmail.com\n\nThe Munky\nConnect with Us\nOur Giveaway\nFind Us Online", "Space Required": "1.40 GB"}



["5 stars\n57%\n4 stars\n25%\n3 stars\n9%\n2 stars\n4%\n1 star\n5%", "Chally3411Jul 16 at 3:05 PM\nGreat stress Reliever\n\nIts not one of the most expensive games but its one of the best.\nIts a great stress reliever, if youre feeling angry and upset about something or someone, take it out in the VR not in the real world. It works.\nBe careful to clear the room as its very easy to get disoriented and end up punching a nest of tables that you forgot were there \n\nHelpful | 77", "shawnasmith2 days ago\nI Was Kinda Scammed... but great game.\n\nGraphics are... bleh. But great game! I loved it also my friend was so scared of it lol. And I cant seem to update to the new map... devs can you answer that or is it just me?\nIts the august 21 update. With new npc and new map. God bless you.\n\nHelpful | 6", "zee_008Jul 16 at 11:15 PM\nAwesome game, needs more updates\n\nLove this game, honestly its a blast and super immersive. It needs more levels and places to play in, otherwise it gets pretty repetitive. Great to blow off steam though! PLEASE developers- add more levels/worlds to play in!! Give me my monies worth!\n\nHelpful | 9\nDeveloper Response8 days ago\n\nHey zee_088 Thank you so much for your review. We are happy that you enjoy the game :) Were glad to inform you that a new update is coming out on August 21st! It contains bug fixes, new NPCs, new weapons, and.a new MAP! And wed like you to know that well be releasing new updates in the future with more maps and new features to the game! We would love it if you could play the new update and give us feedback!! Please join our Discord to have a direct channel with the community and developers: discord.gg/duuVztD", "superpigmlgMay 10 at 9:28 AM\nGreat game \n\nI love this game is fantastic but theres a few things I think could be better:\n\n1: In the new multiplayer I love it but could you add full bodys instead of just heads and also be able to fight your online friends in a game.\n\n2: I think its amazing but could you add more maps to the game? Like I think a mountain or waterfall one would be awesome. Or also a Forrest or a house party. Just some ideas \n\n3. Also a great idea would be to add more people in the bar at the one time. It is still really fun but gets a bit boring after youve completed it.\n\n4. And mabye make it so you could pick people up and throw them about its a bit awkward having to knock them out first\n\nThank you Jamie\n\nHelpful | 228", "Balakae.exeJun 3 at 7:53 PM\nAwesome but needs one thing\n\nIdk if the devs will see this but if they do could you guys respond please???\n\nOnto the review, this game is FIRE!!! Yes there is only 3 people at a time but I dont give a crap. I still beat them to death. This game is awesome and I always find a way to come back to it even with the multiplayer its awesome. Speaking of multiplayer... here is the one problem: we need full bodies for multiplayer. I dont need a full body but Im tired of seeing my friend as hands and a head. If you could at least do it like Arizona sunshine where other players see you have full bodies but In your perspective you dont have one. Just please add this. Otherwise 11/10 game would be the s**t out of others again.\n\nHelpful | 63", "ICameForVaderA day ago\nGreat port with a co op option.\n\nI love this game, I have played on vive and quest. This is a great port, the graphics barely suffer, the fact there is only 3 people in the room at a time is more funny than bad, there is infinite replay ability, and has great co op. It is also worth what you are getting, this is a small game and the price shows that. But this game is still fun, the bugs are stupid and in co op only add to the experience because they look incredibly stupid. Overall a great laugh for teens and adults to enjoy.\n\nHelpful | 3", "Dr.Silz6 days ago\nThis game is great\n\nI would 100% recommend this game to anyone considering it, but my only problem with this game is that they dont add anything new. Other than that this game is fantastic and a great multiplayer experience.\n\nHelpful | 1\nDeveloper Response7 hours ago\n\nHey Dr.Silz Thanks for your review, your feedback helps us improve the game!!! Wed like to inform you that an update will be released this week, it brings many new features including a new map and new weapons, dont forget to check it out!!! Also, wed like you to know that well be updating the game always from now on, from bug fixes to new features  Please join our discord to have a direct channel with developers and the community: discord.gg/duuVztD", "dragmaballsJul 29 at 8:10 AM\nSo much fun !!\n\nThis is one of the most fun games I have played the music is amazing the physics are hilarious it just needs more areas to play but other than that this is a amazing game\n\nHelpful | 6\nDeveloper Response8 days ago\n\nHey dragmaballs Were glad that you enjoyed the game, and thank you for writing this feedback! Its really important to know what you thought about the game!! Also, we have a Discord channel, feel free to join and get in touch with the community and the developers: discord.gg/duuVztD", "Soggy_Burrito7 days ago\nGreat game but it needs some things\n\nSo when I got this game, boy was it fun, and it still is. But it would be cool if stools would re spawn. And how about infinite ammo ammo for the taser, airlift gun stuff like that. The shock devices in the alley are cool, but you get one burst. Rechargeable shock things potentially?\n\nHelpful | 1", "AndyBoosh23Jun 19 at 10:27 PM\nWorth a buy\n\nThis is a must buy for any gamer into combat games. It's totally ridiculous but a great blast to play. It's a bigger must if planning to play co op with a mate. It's quite slap stick in most cases especially with the rag doll like bodies flying over the bars or out the windows with a simple grab and throw. Never gets old though \n\nHelpful | 8", "bella.sayersJul 22 at 8:24 AM\nThe best thing you will ever see\n\nThis game is perfect, it's good for stress relief, for fun, for feeding your insanity, drinking virtual beer in a virtual bar, this game is just fun. My friend came over the other day and we tried some games, and this one was just his favourite, and I could say the same!\nKeep up the good work devs\n\nHelpful | 2", "grugcoom69Jul 15 at 12:34 AM\n\nIt's really good game and you can have lots of fun, I just wish that the multiplayer was a little better. For example it would be good if you could see their whole body instead of just their head and hands\n\nHelpful | 3", "jmcgrade404015 days ago\nDrunken bar fight\n\nThis game is super funny and fun to play I love it so much and I would play it in my free time but the only thing that made me a little disappointed was the graphics\n\nHelpful | 1", "MoF0bian14 days ago\nPerfect stress release for todays world\n\nLove the characters ( particularly the ones in the little side bar. Gets 5stars for this alone), makes kicking their butts all the more satisfying. Love it, many thanks to the developers.\n\nHelpful | 0\nDeveloper Response7 hours ago\n\nHey MoF0bian Thank you so much for your review, and for taking the time to write it, it means so much to us that you enjoy it!! Dont forget to check out the new update that will be released this week, it includes many new features including new NPCs and new weapons! Feel free to join our discord and have a direct chat with developers and community: discord.gg/duuVztD", "Koloax_YTJul 18 at 4:14 PM\nBeet game on the quest FIGHTER YET!\n\nThis is such a great game! I love how powerful I am to knock out everyone. And use items to add even more power! But durability. But please add full bodies on multiplayer and let us pick up eachother to help each other. And the game's community is so nice and awesome! Hope you read this devs <3\n\nHelpful | 1\nDeveloper Response8 days ago\n\nHey Koloax YT We are glad to hear that you loved the game! Thank you so much for taking some time to give us this feedback. Your suggestion is really appreciated, it will be passed on to our developers <3 Please join our Discord to have a direct channel with the community and developers: discord.gg/duuVztD", "joe.tromblee.20058 days ago\nGreat for blown off steam\n\nWhenever Im mad this is the game to go to turn on indestructible weapons god mode endless levels and change the pick up control and get to work\n\nHelpful | 1", "Spar7acus007Jul 27 at 4:05 AM\nPretty good\n\nThrough playing this game I have shorty realised I have anger issues which was promptly fixed by caving some poor mans skull in with a crowbar.\nIn short good game would buy if you need an emotional outlet or just want to have some bar fight fun.\n\nHelpful | 1", "DevonShifton2 days ago\nGreat game!\n\nOne of the best games in its category. Super funny, rag dolls are crazy and I would recommend .\n\nHelpful | 0", "FallenHuckleberry616May 20 at 2:00 AM\nIts good but..\n\nGreat game great physics great variation. BUT there should be a gore mode. With dismembered limbs..blood...stab wounds. Also guns would be a cool addition. I would like a free play mode where you could spawn things in similar to the boneworks sandbox. This is the best combat and fighting game on quest. It would be great to see new content added .\n\nHelpful | 7", "EliteTCulp1029414 days ago\nReally good but need updates\n\nI love this game and it is great but the only problem it that it is so old and it needs updateds\n\nHelpful | 0\nDeveloper Response7 hours ago\n\nHey EliteTCulp10294 Thank you so much for your feedback! We are glad to inform you that an update will be released this week!!! It brings many new features including a new map and new weapons, dont forget to check it out  Feel free to join our discord channel to have a direct chat with community and developers: discord.gg/duuVztD", "Endertroller48vip8 days ago\nVery small game.\n\nFeels repetitive, AI just attacks you for even getting too close to them. Maps are very small. Weapons break WAY to easy. I would not recommend this to anyone.\n\n\n\nUpdate: I think that the weapons that most need fixing are definitely those pole thing, forgot what they are called, but they break even by picking them up, chairs are a bit too weak, and all the other weapons could have a bit more.\nI moved it up to a 2 star, and I hope to soon be a five, because I really like that fact that you actually read this.\n\nHelpful | 2\nDeveloper Response8 days ago\n\nHey Endertroller48vip Thank you for the review, your opinion is really important to us! We are working on bringing more maps to the game! By the way, well be releasing a new update this month that includes a new map! If you could play it and give us your feedback about it wed be really glad! About the weapons breaking: we understand your frustration! Despite most of the weapons not breaking, the ones that do are quite fragile. To counter it, so far we add a bigger number of those on the scenery. However, it's a good point. Which weapons do you feel we should improve on fragility?", "CajunJesus15 days ago\nSlap Happy\n\nThis game will get your heart rate up, make you laugh at some of the stuff you can do, and its fun to be back in a bar in 2020.\n\nHelpful | 0", "HecticGoldApr 15 at 1:21 AM\nGreat Game \n\n(This was a 2 star review because of a problem but because of the really quick response I now rate it 4 stars)\n\nThis game is really fun and I see my favourite youtubers playing this game one suggestion I would like to make is that instead of 3 people in the bar/alleyway/balcony at a time if you can\nPlease make it so 5 to 6 people spawn\n\nI know the quest is a bit limited in games like this of a gigabyte or more, I mean even Vader Immortal Glitched out like crazy for me.\n\nI think that any chance you get to upgrade the amount of people in the bar at once please try to upgrade.\n\n\nThanks.\n\n!Update! Thanks for the reply, I couldnt find anything on YouTube or Google about this so I will do that and write a better review.\n\nThanks for the quick reply \n\nHelpful | 34\nDeveloper ResponseApr 14 at 5:10 PM\n\nsorry for the issue, you can grab the close sign on the door to re-open the bar", "Cian28Jul 3 at 11:47 PM\nA Sidequest-type game.\n\nThe game is fun for a few minutes, but only if you are new to VR. As a long time VR gamer, this game unfortunately doesnt live up to my expectations, and is frankly overpriced . The physics are Jank, the co-op is unstable, and there really isnt a lot of motivation to play.\n\nOn the up side, this game has massive potential to be a top, must-have game. Heres what I would recommend changing in order to get it there:\n\n1- Add a competitive mode, where friends can fight each-other\n\n2- Utilize a better physics engine, one that allows objects to actually collide, instead of pseudo-colliding. The objects in this game like to phase through things a lot.\n\n3- Create an easy way to track points during gameplay, instead of just at the end of the session.\n\n4- Increase the texture quality.\n\nHelpful | 3", "Sour_Pancakes4uJun 30 at 11:28 AM\nHilarious and fun game\n\nI purchased this game about a week ago and I have had so much fun playing it. The multiplayer mode is lots of fun when playing with friends! The only thing I wish this game had more of is customization options. In the end, this game is worth the money you pay for it. Make sure you have a decent amount of space before playing it too.\n\nHelpful | 1", "Gabriel_V_YTJul 17 at 11:31 AM\n\nGreat game very funny and kind of a stress reliever because you get to beat people up but there should be more bars and you should be able to fight the police or something\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHey Gabriel_V_YT Thank you so much for your feedback! We are always open to suggestions to make the game greater and for fun for you guys to play! Also, wed like you to know that we will be releasing a new update August 21st that will bring new features to the game, including a new map and new weapons :D Please join our discord channel to get in touch with developers: discord.gg/duuVztD (And about the police, stay tuned.)", "Business_H0nk15 days ago\nBloody Brilliant!\n\nRealistic. Funny characters. Personality. Best game on the quest i have played so far!\n\nHelpful | 0", "MikkoISJun 10 at 6:50 AM\nFun game!\n\nThis game is really funny and i like it a lot. I would like it even better if i could turn the music off or down a little bit so it would be possible to hear a little better what the people in bar are saying.\n\nHelpful | 4", "scotty341Jul 7 at 3:04 AM\nFun arcade style combat.\n\nThe game is incredibly fun and you will 100% get a few hours out of it. Only issue I found is that sometimes it feels like your opponents can take too long to kill and there aren't enough of them.\n\nHelpful | 0", "galvinsean89Apr 5 at 2:39 PM\nVery fun but one problem\n\nOk so this game is awesome. However i have one major complaint. Once all the bars are closed for repairs, you cant reset them. It says press menu to reset but i pressed menu multiple times and nothing. I pressed all the buttons and the bars are still closed for repairs. Can you please fix this. I dont want to have paid 16.99 for 16 minutes of fun\n\nHelpful | 32\nDeveloper ResponseApr 14 at 5:26 PM\n\nsorry for the issue, you can grab the close sign on the door to re-open", "JustNcase00725 days ago\nDrinking blast!\n\nOne of the most exciting games I've ever played. Give yourself plenty of room cause you're gonna need it. Great fun!\n\nHelpful | 0", "FearishaccJun 14 at 1:17 AM\nReally fun and hilarious\n\nIts really fun and funny to see the rag doll effects and the knockouts! Theres also an online feature where you can play against computers with other people. Punching, smacking, and slamming through all of the people! Really fun Id recommend it to a person who likes to have fun and just enjoy themselves while playing VR.\n\nHelpful | 0", "GoldLennyJul 29 at 3:26 PM\nFun but short\n\nDefinitely needs more places to visit but the right hook people to the ground concept is awesome and never gets old\n\nHelpful | 0", "Mwhitman82713Feb 12 at 9:29 PM\nGreat game but...\n\nI really liked this game and i find it to be a great stress reliever. The only thing I didnt enjoy much was three things. ( these are suggestions/ on plain ta for the quest)\n\n1: the fact only three enemys appear in a room at the same time, it kinda limits the gameplay.\n\n2: The visuals. Everything looks blocky and like it was rushed. I understand the quest doesnt have as great as visual software as something like the rift but I still feel like it could be better.\n\n3: No multiplayer. I personally feel that if you guys had the time to update the game so it was multiplayer it would be a much funnier and overall better game.\n\nI realize these are my own personal opinions and dont apply to everyone but these are just things I think would make the game better if you added\n\nHelpful | 665", "jakewhibbardJul 29 at 6:25 PM\nfun as hell\n\nYou guys really need to add some weapons from the oc build though\n\nHelpful | 0", "theoneandonlycadenp22 days ago\nVery fun with freinds\n\nIts fun to team up on AI with my freinds and throw bottles without consequences\n\nHelpful | 0", "inanimate-objectJul 10 at 7:07 PM\nDefinitely buy\n\nI absolutely love this game! The quest can only handle 3 people to beat up at a time and co op physics are a little jankey but still a great and fun time. And one of my favorite games on the quest.\n\nHelpful | 0", "oldbag6024 days ago\nDrunkn Bar Fight\n\nBest fun without getting arrested or hospitalized \n\nHelpful | 0", "Karma_Lobsang21 days ago\nGood\n\nGreat game love beating people up to relive stress when fedex lost my $1600 GPU in the mail\n\nHelpful | 1", "K-oticJul 26 at 10:39 AM\nNo Cross Buy/Cross Play\n\nI have a Rift CV1 and recently bought a Quest, hoping to play some multiplayer games with my son in VR. I had already bought this game for my rift, and bought it a second time on my quest with a second account.\n\nThen I find out this is one of a few games that does not support cross play between rift and quest.\n\nOK, I thought, no biggie. Ill just sign in to my quest account on my laptop and use the Oculus Link cable to play it like a Rift, that way we are both using rifts so we can play together.\n\nNope.\n\nThe devs decided to also not make this game cross buy, meaning even though I purchased this game on my quest, and Im using that account on my pc, I would have to purchase the exact same game for a third time if I wanted to play it with my son.\n\nThis game isnt worth the price they charge for one copy, much less buying it on every platform. The devs are money hungry and I will keep fighting with Oculus to get a refund for at least one purchase.\n\nHelpful | 2\nDeveloper Response8 days ago\n\nHey K-otic Wed like to thank you for the review, every feedback has huge importance for us!!!! Thanks for pointing out your frustration with Cross-platform, the complaint was passed on to the Developers and it will be discussed!!! We are really sorry about your bad experience, about the refund we encourage you to go forward on it and ask Oculus for it, its more than fair! Well be releasing an update this month, if you could play it and give us your feedback on what can be improved, we would be really thankful!", "AlegotronJun 18 at 11:07 AM\nBar scale fights!\n\nI was able to fit most of the bars completely inside the maximum guardian space. Completely untethered, no cords and no need to use the sticks when mapped out. What a great time. swing with your full weight, especially with breakable items to get the most out of the physics, it'll register for weak punches so for maximum satisfaction, punch and swing like you mean it\n\nHelpful | 0", "kyboi069 days ago\nEpic\n\nEpic\n\nHelpful | 0", "GetDNetJul 14 at 2:30 PM\n5/5 Stars.\n\nThis game helps with my anger, If I never downloaded it I probably wouldve got too angry. Thank you to all the creators for creating such a fun game!\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHey GetDNet Were glad to hear that the game helped you!!! Thank you for taking some time to write us a review. And were pleased to inform you that August 21st were going to launch a new update, dont forget to try it! Itll bring many new features to the game, including a new map and new weapons!! Feel free to join our Discord to have a direct channel with developers and the community: discord.gg/duuVztD", "neelybutters376Jul 21 at 5:05 PM\nFun\n\nThis game is really fun and its probably the best fighting game on the oculus store and with little blood and gore\n\nHelpful | 0", "YvngBoiJaime13 days ago\nStress Reliever\n\nAmazing game 10/10 recommendation buy this game its awesome\n\nHelpful | 0", "LadygamyrJul 4 at 5:51 PM\nFun\n\nWay more fun than it should be. Love the comments the patrons make after you punch them.\n\nHelpful | 2", "GameBoi67Jun 14 at 9:55 AM\n(Almost) best game I ever played!\n\nI really enjoy playing this game, and its a real fun stress reliever. A quick tip when playing the game: play in a large area and in stationary. Itll save your controllers lives and your walls and furniture lol. I wish there would be more people in the bars, like bartenders, and just features from the steam version. I understand the quest isnt the absolute best at high quality games, but I at least want some more things.\n\nHelpful | 1\nDeveloper Response8 days ago\n\nHey GameBoi67 Thanks so much for your thoughtful and detailed review. This is incredibly helpful, with your review we are able to make so many improvements in the game and gameplay! Also, thanks for the tips, they will be really useful for other players :D Feel free to join our discord channel to get in touch with developers and the community: discord.gg/duuVztD", "jon.d.vJul 20 at 7:14 AM\nA Must Have\n\nSo much fun! Wish there was more options/things to fight with. But still so good!\n\nHelpful | 0", "TorebinJul 10 at 2:09 PM\nPlease just add one thing\n\nPlease add online multiplayer, otherwise it is a really good game 10/10 I am giving it a two star so I can get a response from the devs, otherwise this is a REALLY good game\n\nHelpful | 0\nDeveloper ResponseJul 10 at 2:09 PM\n\nHi Torebin, There is already Online Multiplayer. You can add friends or play random if you check the option on the game's smartphone. Cheers!", "Finb0bul0usJul 14 at 4:11 AM\nGreat game\n\nGood to get your stress out and Great for friends and family. Awesome fun and HILARIOUS memes fantastic buy\n\nHelpful | 0", "DarthComyns0821 days ago\nAmazing so fun\n\nIt is so good I highly recommend it\n\nHelpful | 0", "xd_retarderJul 13 at 2:11 AM\nIt is pretty good\n\nI bumped my head into my wall whilist playing so a 4/5 for the immersion but the graphics could be better\n\nHelpful | 0", "Strangeperson2007Jul 18 at 4:21 AM\nAmazing game\n\nI love everything about this game and everyone that Ive let try it out love it to and I wish there were more bars\n\nHelpful | 0", "dancejohndanceJun 25 at 10:05 PM\nYou don't even have to be drunk!\n\nIt's called Drunk'n Bar Fight but it's a lie, you can play the game sober. I do it all the time. I'm a guy who likes to bend the rules like that. You won't see me coming to a complete stop before I turn right at a red light!\n\nHelpful | 1", "Gr4y_ChapJun 20 at 9:45 AM\nFantastic! One thing tho,\n\nThis game is very fun to play by yourself and friends but I would really enjoy the characters to have an entire body instead of just a head. Itll make this game a five star review I the entire body is added.\n\nHelpful | 0", "blondejaguar48424 days ago\nVery good game\n\nThe game is really fun to play but I wish you guys added a endless mode or a mode to roam around like some type of alley fighting people\n\nHelpful | 0", "Conor_OBrienMar 15 at 2:46 AM\nAmazing but...\n\nI thought this gave was so fun picking up people and headbuttimg them but there were a few things that could be improved on such as\n\n1. Add more areas to the game there are only 4\n\n2.try and improve the visual graphics I thought honestly look kinda bad\n\nOther than that I recommend this game as it is good fun and is quite funny\n\nHelpful | 44", "that_one_guy_lol123May 4 at 8:02 PM\nposted on Tuesday 5th of may 04:03am\n\nWow was\nI amazed, for a cheap game this was worth it (best played with a mate in my opinion)The goofiness-could just be glitches but if they are dont get rid off them pleaaseeeeee-is what makes this game way better\n\nTHERE IS A PROBLEM THOUGH (its not huge so thats why its still 5s\n\nWhen u go onto the oculus menu and ur in a game with a friend or a random; yes u dont need a friend you can play with randoms, to well I havent but I have played with a friend\n\nIt will make you disconnect WICH is realllly annoying most of the time\n\n-review by charlie(that_one_guy_lol123)idk why I did this but shhhhhhh\n\nHelpful | 6", "gmb9191967Jun 27 at 5:29 PM\nThis app is amazing\n\nThis app is so goooooooood but please add full body in it cause all I see when Im playing with friends is a head and two hands\n\nHelpful | 2", "TehelmoJul 18 at 2:08 PM\nAmazing game\n\nPerfect stress reliever I just wish there was more levels and weapons I highly recommend this game\n\nHelpful | 0", "EdenGardenOfMar 18 at 9:57 AM\nGreat game, but theres 2 flaws...\n\nThe game is amazing and extremely fun. Especially when I play with my friends. It would be perfect, but theres 2 flaws. I dont like that there are only three NPCs in a bar at a time. This makes it get a bit boring and less action packed. They should definitely add in more NPCs. It would also be nice if the NPCs didnt have to be knocked down to pick them up. It would be a lot better if I could just grab them anytime I want. I always want to choke slam an NPC, but I cant because they have to be knocked down for me to pick them up. If the game directors see this, it would be great if they could fix these flaws, otherwise, its the perfect game! Always fun to beat some people up in a bar! Great game, just a few flaws.\n\nHelpful | 44", "RandomFunJul 21 at 10:38 AM\nGreat Game\n\nA lot of fun to play\n\nHelpful | 1", "stackmoneynoz21 days ago\nToo expensive\n\nGood game I guess not much yo do but fight cant talk to the NPCS to initiate a fight the game can use some improvements of course but thats all games\n\nHelpful | 0", "Midgetman1Apr 20 at 1:03 PM\nGreat game but\n\nThe game is great and simple. It is fun to play and personally I do not think it is repetitive. If you get the game I would also recommend playing with friends. However the graphics are not great and there are only 3 enemies at one time. I know the quest isnt the most powerful be headset but I still think the graphics and amount of enemies can improve. I would recommend this game to anyone looking for a simple and fun game\n\nHelpful | 5", "PTHgaming61Jul 1 at 11:13 PM\nGreat game\n\nIts just a good game for playing for about 20 minutes and taking a break but overall a really good arena game I guess you could call it\n\nHelpful | 1", "myronxd20Jul 25 at 6:07 AM\nEpic\n\nIs good game must play\n\nHelpful | 0", "RauelRualbeJun 24 at 10:15 PM\nA bit of fun\n\nThis is quite enjoyable, ridiculously funny but it needs more levels. At least three with about the same number of Bar scenes to fight in.\n\nHelpful | 1", "IMBUZIMay 30 at 3:43 PM\nHilarious.\n\nIf youre ever bored, angry, or just not feeling right. Just go ahead and download this game and release all your deepest concerns on the innocent bystanders at the bar. Whether youre smashing chairs, laptops, or even skulls, this game is a blast to play especially with friends. No problems with this game pretty much, only that with enough repetition, you might find yourself already knowing what to expect. But for some odd reason, it never gets boring. I still get the thrill of beating up civilians at the bar even after doing it millions of times. As messed up as this game might be, at least youre not doing it in real life. Get this game. Now.\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHey IMBUZI Thanks for taking the time to share your feedback with us. It means so much when you share your experiences with us, being positive or negative, we are able to filter the opinions and bring a lot of improvements to the game! We are really happy to hear that you liked the game, and wed like you to know that a new update will be released August 21st, dont forget to check it out (it contains a new map and new WEAPONS)!!!!!!! Please join our discord to get in touch with the community and the developers: discord.gg/duuVztD", "SithLord24Jul 21 at 3:55 PM\nHilarious!!!\n\nFantastic game! Highly Recommend! A++++\n\nHelpful | 1", "MrTrolliJul 26 at 10:56 PM\nIts Okay\n\nThe game is hilarious dont get me wrong but it can get boring really fast and fun out of things to do but its awesome for playing with friends who are new to VR\n\nHelpful | 0", "zadensoculusMay 22 at 1:50 PM\nStory time (pls read)\n\nSo me and some other guy found eachother. So we went to the bar and smashed up the place. After that we went to the salty saloon and I got behind the counter. I gave him drinks and he started throwing them at people.\n\nHelpful | 3", "TropsyJul 8 at 8:04 PM\nFANTASTIC!!\n\nFunny and amazing game should definitely buy if you like fighting and cant do it in real life!\n\nHelpful | 0", "DaveH46Jun 13 at 9:02 PM\nCustom music\n\ni would really enjoy it if we could search for our own songs on the music player, there would be a search button on it which it would allow us to search for our own music and play the music while we fight\n\nJust a suggestion by the way\n\nHelpful | 3", "joser67982Jul 11 at 9:28 PM\nSO EPIC\n\nI would like to have more people in one bar because its more epic but yes\n\nHelpful | 0", "Unit7800Jul 13 at 2:22 PM\nFun\n\nIts a lot of fun just to punch the people and use the weapons\n\nHelpful | 1", "WxckyJackApr 10 at 2:14 PM\nAmazing game but needs improvement\n\nI love this game everythings awesome but what Id love is if you can break a bottle and turn it into a shank. Also in the top bar if you could use the knifes to actually cut someone. Also in the ally the shockers are missing so if you could fix that bug. Id also like if I could grab the npc even if there standing. One last thing is I would like to see a full body when I look down. Other than that amazing game!\n\nHelpful | 6\nDeveloper Response8 days ago\n\nHey WxckyJack Thank you for taking some time to write this review, its really important that you share your thoughts and tell us what youd like to see in the game! Also, thank you for reporting this bug, we are glad to inform you that it has been fixed!! Theres a new update coming August 21st, it includes a lot of new features, like a new map and new weapons! Wed appreciate it if you could play it and give us feedback! Please join our discord to get in touch with the community and the developers: discord.gg/duuVztD", "Woodmar10Apr 17 at 2:22 PM\nMore people in the bar at once\n\nSo multiplayer has been added but now the biggest complaint from everyone is that there is only three people allowed in a bar at once I watch YouTube videos on different platforms that are not the quest there are 20 at once but because this is the quest add like 5 or six also in co op you should be able to see the the other persons whole body idk why you can only see the head and hands it makes the co op mode seem rushed\n\nHelpful | 6\nDeveloper Response8 days ago\n\nHey Woodmar10 Thank you so much for your feedback and criticism. Also, wed like to inform you that we're working hard to bring more NPCs to every bar soon!! Were glad for your suggestion, it will be passed to our devs  Please join our discord channel to get in touch with developers and the community: discord.gg/duuVztD", "Sync_172Jul 10 at 1:24 PM\nGame is fun\n\nThe game is really fun but it kind needs a graphics update and new weapons\n\nHelpful | 0", "lennysgcJul 15 at 2:40 PM\nSick\n\nIt felt so realistic yet not amazing game 10/10\n\nHelpful | 0", "SwagcityUSAMay 10 at 10:40 AM\nPure fun\n\nWhen I bought this game I thought if this was a worth while investment, I mean its just punching people till they leave and someone else joins the fight.\nAnd dont get me wrong it is exactly that but some how with all the props and opportunity this game hold of just beating people up is just so fun\nthere is a replay ability factor of which you just find new and creative ways of beating the ever living sh*t outta someone and thats more than enough for me\nIf your just looking for a high intensity beat em up then this is why exactly it\n\nHelpful | 2", "flizyApr 29 at 1:36 AM\nGood game one problem\n\nI am writing this review because I would like to be able to play this game online with my friends that also play on Oculus. Dont get me wrong I love this game I just think it would be cool to be able to play multiplayer on oculus. The tracking doesnt even have to be that good.\n\nHelpful | 2", "madraydexJun 28 at 7:47 PM\n\nIt would be a lot better if there was blood but its not a bad game\n\nHelpful | 0", "mr.memanJun 16 at 2:43 PM\nAmazing game\n\nThis is probably the best game Ive ever played but there is one thing to happen that there was more places to cause mayhem\n\nHelpful | 0", "TheTerraBlade42May 21 at 1:23 PM\nCool, but really short\n\nI like the combat and the different areas of the game, and how you can use anything as a weapon. I dont like that there are only 3 enemies at a time. Games like Arizona Sunshine can support around 15 zombies and 4 people playing online with huge, detailed environments, while this game can support 3 enemies and 2 online players with worse graphics. The lack of enemies makes this game a bit too easy and short, but being able to go back and play with friends makes this game worth buying if you like punching people and throwing them in sewers. Also, grabbing things with the trigger is a bit strange. I would like an option to use the grip button.\n\nHelpful | 3", "Redalt99May 21 at 9:58 PM\nThis game sucks DONT BUY\n\nThis game while fun at first absolutely does not justify its price point especially considering you can get an amazing experience like waltz of the wizard for less. it really only has maybe an hour and a half of content. Very disappointing. I unfortunately was unable to refund this game as I just barely crossed over the 2 hour mark on game play.\n\nHelpful | 6\nDeveloper Response8 days ago\n\nAnswer: Hey Redalt99 Thanks so much for sharing your experience with us. I'm so sorry that your experience with the game fell short of expectations. Wed like you to know that were always taking notes from reviews to bring all kinds of improvements to the game! Feel free to join our discord and have a direct talk with our team and developers: discord.gg/duuVztD", "soupisgood20Jun 12 at 5:30 PM\nGreat but needs work\n\nGood game thats worth the money, and the multiplayer is pretty cool, a mic system would be nice though. I play this a lot so Im glad work is still being put into it.\n\nHelpful | 1", "Scooby133Jul 29 at 7:22 PM\nGreat game but some things\n\nIts a great game but it needs where join your friends in game\n\nHelpful | 0\nDeveloper Response8 days ago\n\nHey Scooby133 You can invite your friends for an online multiplayer game by clicking the third icon on the top part of the cell phone (which you can access by clicking on the system menu button on your controller) and then click on the name of the friend that you want to invite :) I hope that we were able to help you! Also, please feel free to join our Discord if you need further help (and also to get in touch with devs and the community): discord.gg/duuVztD", "Baileydog8Jun 29 at 5:10 AM\nMore bars/fight places/ guns/weapons\n\nI loved the game I just feel like I just go bored because of only 3 bars I liked and only a few weapons\n\nHelpful | 0", "lettucegyyMay 18 at 1:00 AM\nGood stress reliever\n\nI like to play this game when I just want to take my anger out on something (or someone) but dont want to face the consequences, so this game is perfect. I see a lot of reviews about how the game is too low quality, and I honestly have no problem with that. Or that there are only 3 people in one bar? Completely fine. I dont want the game to be competitive. Im just fooling around and having fun while getting drunk. It would be nice to see some more interactions. Weapons would be nice, and I wish the characters would react more to what you did to them. Like, when you smashed a bottle in their face, they would have pieces of glass stuck to them. Idk, its just some suggestions I had but the game is fine and great to play in free time. Not only me, but also my friends enjoyed it as well.\n\nHelpful | 1\nDeveloper Response8 days ago\n\nHey lettucegyy Thanks for taking the time to share your feedback with us. It means so much when you share your experiences with us, being positive or negative, we are able to filter the opinions and bring a lot of improvements to the game! Also, wed like to thank you for the feedback, your suggestions will be passed on to our developers! A new update will be released on August 21st, it would be amazing to us if you could play it and give us feedback! Please join our discord to have a direct channel with the community and the developers: discord.gg/duuVztD", "BigSmokeYeahJun 12 at 10:09 PM\nGreat game but\n\nThis is a amazing game but for me I get minor headaches when Im playing s ok I recommend it but if you are the type to get sick during breaks games dont play it for long\n\nHelpful | 0", "Modalfuzzball41Jul 10 at 5:02 PM\nGreat game\n\nKeeps me busy during COVID\n\nHelpful | 1", "error4554Mar 19 at 4:23 PM\nIt made me a better man\n\nI always had the trouble to punch a woman. My entire life I was taught to never punch a woman and I always lost a battle with them, but now I can punch them and Ive won every time I got into a fight. So thanks for making this great game possible and broke my teachings of never punching a woman.\n\nHelpful | 43", "GHOSTLY_VRA day ago\nSo good 5 star\n\nI tried this game with my family and Im amazed the graphics is meh but the gameplay is so fun and its really funny just be Careful when playing this game cause I hit my hand on a wall and was bruised but Im Okay overall this games is awesome cant wait for new updates to come\n\nHelpful | 0", "gameq11Jun 10 at 12:18 AM\nGameQ Lounge\n\nI lot of ppl love the game at my Lounge and it is one I use to show ppl the fun of vr! Only thing that would be great would be able to make lobbies for online\n\nHelpful | 0", "Bovice209May 12 at 1:00 AM\nDefinitely a must have\n\nIs drunken bar fight the most innovative game with the best plot know does it have the best looking graphics know but what it lacks in those two things it gives so much entertainment and fun and just punching Im beating people up definitely an app that shows how immersive VR can be Im excited to see where it goes and with the new co-op its even more fun to lay waste with your friends\n\nHelpful | 0", "HeatWave2020May 11 at 3:17 AM\nIts cool, funny, and interesting.\n\nI love this game. I understand that the limited processor on the Quest makes it difficult to create larger and more demanding games, but I think the amount of content right now just isnt enough. Hopefully the developers will keep working on this game and release some awesome new updates with more enemies, updated graphics, (hopefully) another bar, and possibly some mini-games!\n\nHelpful | 0", "CatGod99May 15 at 4:37 PM\nGood but\n\nIts a good game but some too almost none of the unlock able weapons spawn. For instances I unlocked every weapon but they dont spawn like the airsoft, paintball gun,and mace.\nBut excluding the weapon spawning problem it is a good game.\n\nHelpful | 0", "happyface333Jun 21 at 9:21 PM\nFire\n\nYeah idk what to right about so all I have to say is just play it and its pretty fun tbh\n\nHelpful | 0", "AceinkcJul 2 at 10:14 AM\nThis was not a 17$ game\n\nThis game is poorly made it is like one of those online browser games you would play in school but in be and it costs 17$ dollors\n\nHelpful | 3", "jacqui.isaac.96Jul 12 at 11:45 AM\nDrunkn bar\n\nGreat and fun game to play and to play with friends.But I wish there was a little more stuff to the game\n\nHelpful | 1", "shadowwolf77Jun 24 at 1:23 AM\nI Beg of you\n\nPlz add Pavlov to your store on quest my it would be the best plzzzzz\n\nHelpful | 1", "OrangeBBJun 9 at 11:34 AM\nAdd a prison map\n\nThere should be a prison map it would be so\nFun to fight in a prison\n\nHelpful | 2", "Lane81Jul 2 at 2:41 PM\n\nIts like my favorite game\n\nHelpful | 0", "KodakJack843Jun 28 at 1:25 PM\nDisappointed\n\nThe way you hold things makes no sense at all..only one way? Literally one of two things you do. Pick up things and punch..and picking things up is terrible..its better in other games where you can do all kinds of things. Graphics suck and so do the animations. I would refund if I could\n\nHelpful | 0", "Orie0May 28 at 7:21 PM\nWorkout!\n\nThis is my first review ever but I had to after playing this game!! I LOVE it! I always leave playing covered in sweat and heart racing! As I am a lady, I do not fight. So its fun to pretend lol\n\nHelpful | 0", "NJMeyerJul 3 at 1:14 PM\nGreat\n\nGreat\n\n\n\n\n\nYes\n\nHelpful | 0", "MusetteVonWakenbakeJul 18 at 2:15 AM\nAmusing, but extra short.\n\nCan't say I used a Karen as nunchucks in any other game, though.\n\nHelpful | 0", "gage.coppersmith.9Jun 3 at 3:25 PM\n\nThis app is super fun but one thing they should add is full bodys so it could look better when you play with friends but overall its a very good game\n\nHelpful | 1", "661c.sanabriaMay 23 at 10:57 PM\nFunny, fun, fantastic, F yea!!\n\nThis game is fun to play, a stress reliever, and there was a dud in the bar that looked like someone I always wanted to kill, so I kicked his A** at least in this game \n\nHelpful | 0", "Elias_JohansenMay 4 at 4:27 AM\nIts good but\n\nYo so the game is good. You should pick it up. Its fun. But would love if the devs put sone more time into it like the grabbing of items its kinda off. And im sure there is like a hole part missing to the last level. Ive seen it on youtube plus in the trailer. Its where you can get the stun gun. But other than that its so much fun a good game buy it!!\n\nHelpful | 0", "Jazz1109May 5 at 9:27 PM\nThis game is so much fun\n\nI owned a psvr at first and I was looking for a new game to play I stumbled upon this it was so much fun when I first played it and I thought it cant get any better but oh BOI was I wrong they added multiplayer new levels and new npcs and voice lines the game will just keep getting better\n\nHelpful | 0", "nolan.thorenyaaMay 3 at 12:26 AM\nGreat Game\n\nThis game is great I love all of the maps and they are great quality. The 2 things I have to say are about hand size and picking people up. When I pick up items, my hand is too large to see them. The second one is when I try to pick people up, they glitch out and fly across the bar. Still give it five stars for having so much fun. Edit: Your last update broke the game. You cant reset the bars.\n\nHelpful | 0", "REEE_27Jul 20 at 6:26 PM\nBest oculus game\n\nWOOOOO\nBEST GAME EVER I DEFINITELY THINK YOU SHOULD GET IT\n\nHelpful | 2", "jonsie_playz_ytMay 12 at 12:18 AM\nGreat fun ,but...\n\nI did have a few problems 1. I couldnt find people to play with 2. There can only be 3 people in one game 3. And this is minor but ,I kinda wish you could see the other peoples bodies in game it would make the game a lot funnier.\n\nHelpful | 0", "BtracchiasJun 14 at 5:34 PM\nGreat game\n\nLove this game never gets old super fun and great for teens\n\nHelpful | 0", "PopularGamesMay 29 at 10:50 AM\nIntense and Fun\n\nThis game is very fun and enjoyable. The only problem I have is that there isnt much content in it.\n\nHelpful | 0", "ConKenna09Apr 26 at 5:28 PM\nSuggestions\n\nEverything is great I enjoy the game play and everything just a couple problems but it is overall great but there are only 3 people who appear in game at one time and they are slow to leave and get up and when they are slow to leave so more people cant come in so a suggestion is that you should make the people get up faster and make them leave faster that is pretty much it and it is overall a great game so good job just maybe if you fixed that problem it would be much better!\n\nHelpful | 0", "TimeBombCubedMar 19 at 12:02 PM\nNo multiplayer\n\nDrunkn bar fight is a really good game that is a lot of fun and a good stress reliever.\n\nThe game has a multiplayer function but whenever you try and join a random lobby or a friend and the game tries to load but then just put you back in the same room.\n\nHelpful | 6", "SiboldJun 13 at 2:05 PM\nAwesome game\n\nThis games is really good but I would love more areas.\n\nHelpful | 0", "Biggie_Pig55Apr 27 at 3:00 PM\nGreat game\n\nThis game was AMAZING it was so fun my whole family enjoyed just smacking people and watching them just flopping around\n\nAnd I would be better if you could get the Halloween Drunkn bar fight\n\nBut I really enjoyed how you can change the height and customize your character with the phone\n\nHelpful | 0", "Proton22Apr 9 at 9:00 AM\nHILARIOUS game but...\n\nI play on the oculus quest and the game is really fun and all, however would kill for the game to be multiplayer. It is fun for the first few minutes then gets boring, if it was multiplayer the game would be much more enjoyable. Also I would love for there to be more areas and more weapons.\n\nHelpful | 1", "chaderrJun 13 at 1:54 PM\nGreat Fighting Game\n\nI can punch both (2) genders and all ethnicities\n\nHelpful | 1", "Eddie_bFeb 11 at 3:39 AM\nFun, for a while\n\nI've owned it for a week and I've been returning to this game several times. It's not hard and has a high fun factor. However, there are few different 'opponents' and some things are too far from being realistic. For example, hit two opponents down, grap one in one hand and one in another and slap the other one that's remaining around as you wish.\nThe new update has some bugs btw. I've had it twice that I couldn't make a fist anymore with one hand (after finishing the bar I could, again) and a game crash.\n\nHelpful | 24", "bluebird28Jun 16 at 10:30 PM\nGreat game\n\nJust get to mess around in bars\n\nHelpful | 0", "asmellypizzaMay 22 at 10:52 AM\nThis game now has multiplayer\n\nStill only 3 baddies spawn at a time and the graphics could use a bit of smoothing out. All in all im happy clearly.\n\nHelpful | 1", "Lewis675Apr 18 at 2:25 AM\nNeeds full body\n\nAmazing game I like the new multiplayer feature would be more better if could fight other online players and could see full character in game not just hands and head\n\nHelpful | 3", "NakaiVRMay 7 at 9:17 AM\nThe game is great\n\nNot only you get to experience and be a part of a bar fight, it can also be an endless way to get your stress out! This is also a good exercise game!\n\nHelpful | 1", "matt.bursik.3Apr 22 at 10:33 PM\nGreat fun time killer! Needs more bars!\n\nI love this game, always wanted to play it. Finally bought it and im so thrilled and happy with it, i just want to see more bars added and definately more modes, and enemy types.\n\nHelpful | 3", "LivingCartoonApr 26 at 12:38 PM\nGood game but bug\n\nThe game is very good but I have a glitch where when I spawn in it would keep pulling me to the left.\nI have tried uninstalling and reinstalling but it did not work.\nIt does not happen on any other game.\nOther than that a very good game.\n\nHelpful | 1", "blitzzzies5 days ago\nGreat Game If You Like Violent Games\n\nIts definitely up there with combat games, i loved it so so much. If your ever mad or stressed this is good game to get rid of all that. I am enjoying it and its a good game! \n\nHelpful | 0", "thatmetakid12 days ago\nI feel so relieved of stress\n\nThis game makes you feel amazing\nAnd there are so many ways to beat people up\nWith bricks,darts,guitars and more\nAlso there are 4 great levels there's a western bar,a normal bar, a roof top, and a ally way\n\nI recommend this game\n\nHelpful | 0", "jojofan97Jun 15 at 4:40 PM\nBest game ever\n\nFav game in be and out\n\nHelpful | 0", "saeidamouzgarJul 14 at 4:40 PM\nGarbage\n\nI paid for it but it never appears in my Quest. It never pair with my phone\nI hate it\n\nHelpful | 0", "pandaboi09Jun 16 at 2:51 AM\nGet the game now!!\n\nGet it now right now!\n\nHelpful | 0", "JamesVader9May 14 at 12:51 AM\nI would give this 5 stars but...\n\nThis needs only 2 things, more than 3 NPCs (I don't care about the graphics I just want more NPCs to fight at a time), and character bodies\n\nHelpful | 0", "clips69Apr 3 at 1:51 PM\nHelpful information\n\nThis game has taught me many things. You cant get hate for punching waman in a alley way. When I went to other bars and punch waman I got boo at, but when I punch waman in alley way i dont get boo. So now I go and punch waman in alley ways for fun. Because I dont get boo. But for some reason I got to jail for punching waman in alleyway even though this game said it was ok.\n\nHelpful | 2", "MalficetopheMar 15 at 2:11 AM\nGood game.. few quirks.\n\nPretty cool game overall. Mapping is really good, physics are mostly pretty good as well. For anyone unable to start a new game because the bars won't reset.. remove the closed/ under construction etc signs from the doors/walkways/etc, back up a few steps, then walk back into the bar.\n\nHelpful | 4", "Moses967Jun 6 at 12:11 PM\nFun\n\nFun game when you feel like slapping people around\n\nHelpful | 0", "aias.ghurraMay 24 at 11:33 AM\nBest game\n\nI bought this game thinking it was going to be realistic but the damage to the offline bots are unrealistic witch is good cause it makes it more fun.\n\nHelpful | 0", "oO_Cosmo_OoMar 12 at 5:26 PM\nFun!!\n\nIt's fun to unlock new weapons, characters and customization options! And Im having a blast playing this when I'm bored and let my imagination flow! But there is a couple of things though that will definitely keep me playing.. it would be cool if there were actual cops trying to stop you with weapons, having different bars available, people fighting each other inside the bars and that you could grapple people while they are standing instead of punching them until they are knocked down, Not saying that while we can grapple them you can just throw em out that easily but just to grab them by the shirt or head and just punch them or smash a bottle on their head without them being knocked down or stumbling away. That would really be cool! In the end this game is good those were just some things that would be great if they were added! \n\nHelpful | 6", "zackspider1204Jul 16 at 5:43 PM\nRefund\n\nI tried to refund it but for some reason it didnt work\n\nHelpful | 0", "PyroProMar 24 at 6:20 PM\nA never ending blast but could improve\n\nI love this game so much! I play it all the time and Ill never get tired of it. But I kinda want the physics in the game to be better. Ive had times where some of the people get stuck in the floor and disappear all together. I also wish that you could push people because it gets boring to just punch people and wait for them to get back up again. Kind of like in boneworks, the game could be way better if it could have the same physics for enemies as in Boneworks. But overall this game is a great way to unwind and have a blast! I would recommend this to anyone looking to have a great time!\n\nHelpful | 1", "TheOGPhilSwiftMay 25 at 4:53 PM\nSuper fun always keeps me entertained\n\nUse this for coping and entertainment and throwing people off a building is amazing\n\nHelpful | 0", "Crewsy.123Apr 27 at 12:50 PM\nGood fun for what it is\n\nIts not really that much of a game more of a virtual stress relief.\n\nIts limited due to being on the quest as the more advanced systems have full bodied multiplayer and I think that would build the immersion so much.\n\nHelpful | 0", "Ray_RomanoMay 9 at 2:54 PM\nAMAZING game, lack of content\n\nThis is a great game and a good stress reliever. However, I wish that there were more weapons, enemies, and possibilities.\n\nHelpful | 1", "james23bJan 25 at 8:01 AM\nIt Is Amazing!\n\nI Bought This game and i just loved it, but... NOTHING ITS JUST SO FRIGGEN GOOD! although i could recommend a game called \"Arizona Sunshine\" if you like this game you should play it, you just shoot zombies with friends and crack simple puzzles. Over All just play these two to games cause... THEY! ARE! AMAZING!\n\nHelpful | 59", "JinnisaurusMay 25 at 4:52 AM\nGreat game but trimmed down\n\nIt's pretty obvious it only limits 3 enemies at a time with unrealistic new npc running in immediately after one gets knock out. A random timer and variable enemy numbers would be better. And 3 enemies is definitely not enough. Needs to be pushed to at least 4, do some modification to look like there is more npc. Could try to learn from other apps like dance Central or Arizona sunshine.\n\nHelpful | 1", "FishyMcPhishMay 27 at 2:30 PM\nBoring\n\nCould use a lot of work, and a price reduction. Repetitive and not very fun after about two minutes. Wish I could get a refund.\n\nHelpful | 4", "GoutSurvivorJun 3 at 10:37 AM\nGreat Stress Relief\n\nDestroy idiots and relax:-)\n\nHelpful | 0", "CribselJun 16 at 3:57 PM\nNot Much Replayability\n\nBought this game and it was fun for the first few hours then there wasn't much else to do.\n\nHelpful | 0", "M1kedabestMar 24 at 5:46 PM\nGreat\n\nI wanna start off by saying this is one of my favorites out there on the oculus store. There are so many items you can fight with my favorite is the baseball bats. Then there is the unique people they say so many swears that makes me wanna punch them. But in all I rate this game five stars for being a great game if your bored or you just feel mad.\n\nHelpful | 2", "faygomMay 21 at 7:15 PM\nGreat game\n\nAlthough it dosen't have all of the features as the rift version it is still great\n\nHelpful | 0", "markus.luedtke.35A day ago\nPretty good i hope you buy\n\nI really liked this game I can just beat the crap out of ever one I really like it its good for stress\n\nHelpful | 0", "JigglyPuff69May 26 at 12:25 AM\nAwesome Game\n\nThis Game is amazing! Even better when playing with friends!\n\nHelpful | 1", "deadpool1514Jun 3 at 10:08 PM\n\nThis game sucks gets old fast\n\nHelpful | 5", "CheartlessMay 22 at 1:16 AM\nLove it.\n\nIt's just so satisfying. I'm a simple man I give it 5 out of 5 baby.\n\nHelpful | 1", "Teddy.ShervheimApr 16 at 5:21 PM\nA great game but just one thing to fix\n\nDont get me wrong this is an amazing game for a pretty cheap price and amazing replay ability but one this to note is I just wish there were a few more people in at once but I love the game gives me laughs and great stress relief\n\nHelpful | 1", "WillyWampaApr 1 at 8:34 AM\nFun but ruined by game breaking glitch\n\nGame says to touch menu to restart once you've played all four bars. Nothing happens. Game was fun before latest update but now you have to uninstall and then reinstall the game in order to play all the levels again. Rinse repeat. Lose all progress every time too. Very broken. Easily a 5 once this is sorted out but a one for now since its literally one and done.\n\nHelpful | 6\nDeveloper ResponseApr 14 at 5:15 PM\n\nsorry for the issue, you can try grab the close sign on the door and break it", "Edgetr22Jun 13 at 9:23 AM\nNeeds more\n\nIts fun and ive gone crazy drunk in game but theres not much to do, and with little to keep playing. multi player needs a long play time its over way to fast and solo is really slow\n\nHelpful | 1", "pk_oofmanMay 7 at 1:58 PM\nFINALLY!\n\nIm so happy that they finally made a co-op mode now me and my freinds can enjoy this game together\n\nHelpful | 1", "PeoriwriMar 13 at 4:14 PM\nAmazing!\n\nIt's amazing! But here are some things that I think should happen. First off I think that there should be more NPC's at a time. I like chaos so the more the better. Second off we should be able to grab them while they aren't knocked out just we shouldn't be able to pick them up all the way when they aren't knocked out and they can still hit you when you have a hold on their head. I feel like it would bring more creativity and fun to the game to be able to push someone into the bar counter while they are still awake and pull them into 5 other NPC's. Another thing I suggest is to be more details to the bruising and some blood if you punch them enough, and the knifes it's amazing how you can throw them, but what if you could stab with them. Obviously you don't have to do these, the game will still be fun and it's your choice to decide what to do not mine. :)\n\nHelpful | 2", "PowerSmash06Apr 3 at 7:58 PM\nGreat game!\n\nThey have a lot of things to unlock, theres only 4 bars and no story mode which is to be expected with this type of game, you can finish the game in 5 minutes but is a good stress reliever if you just want to beat up some people\n\nHelpful | 2", "ThatgirlMelindaApr 26 at 12:59 PM\nVery fun limited content\n\nVery fun game but I wish there was more to do than just keep replaying the same four levels\nBut playing with people is awesome I would recommend this game\n\nHelpful | 0", "TheGreenIraqiMar 20 at 7:10 PM\nGreat game\n\nI absolutely love this game I can play it any time and figure out new ways to beat people up. I love the silliness to the characters. I also love the creative ways you can beat people up like throwing them off roofs or out windows or beating them with walkers (my personal favourite). Some things I found with the most recent update is that I can no longer reset the game which has stopped me from playing and I also cannot find anybody to play with on the multiplayer fights. Overall I still give this game 5 stars for the amount of fun and stress relief it gives.\n\nHelpful | 2", "AnabolicalxJul 11 at 3:30 AM\nLovely game\n\nIt is a fantastic game especially for getting your rage out. However like the other person said a few more maps would be nice, and I would love to be able to grab people without having to knock them out first. However Im sure the game isnt even close to be finished. But even at this stage it is still absolutely amazing and would one hundred percent recommend you buy it. Also you should add a setting to set how many people are in the bar at once.\n\nHelpful | 0", "SavageKing759 hours ago\nMost fun I had\n\nAlways wanted to be in a bar fight, and this is the closest I can get to it.\n\nHelpful | 0", "kira.christonFeb 9 at 7:12 AM\nDrunken Bar fight\n\nIt's a good game but could do with improvements such as more than just the same four rooms. It can get a bit boring if played for a long time. I wish we could fight the police or some thing too. Give it more of a twist rather than the same people. Okay game though and good graphics though could do with some blood or something.\n\nHelpful | 8", "Wauib786Mar 17 at 5:51 PM\nSome comments\n\nGood game but i recently came in touch with a glitch were i beat it the couldn't start again so i can't play but i really enjoy the multiplayer feature but it could use some touch ups other than that tho great game i love smacking people around with guitars\n\nHelpful | 3", "dillpickleJApr 5 at 11:38 AM\nLoved it\n\nI love the game and its good but can you add more people and more weapons? Also this one may sound stupid but can you add arms to the player? I hate games that have the user only have hands and not arms\n\nHelpful | 2", "Savitar2714 days ago\nSimply amazing\n\nI feel like some people saw this game on a video and decided to buy it and its worth it if your mad play this game great stress reliever\n\nHelpful | 0", "DEMONCHILD647811 days ago\nBest game ever\n\nIts the perfect game to fight. Punching people, throwing them, Melee weapons. Its just the game to beat up people\n\nHelpful | 0", "QualiMay 1 at 11:35 PM\nTerrible\n\nIt sucks, almost every game on quest is overpriced just like this one. The graphics terrible, physics terrible. Barely fun for more than 10 minutes unless you are less than 10 years old which i am realizing more and more that the target audience for quest is extremely young children. Sucks.\n\nHelpful | 3", "xGrayzillaMay 11 at 5:19 PM\nFriends Needed\n\nThis is a super one-dimensional game to play solo. After you beat each bar, it glitches out and requires more effort than it should to play solo game modes. Its much more fun when you have friends to play with.\n\nHelpful | 0", "SHADOW759Mar 22 at 10:32 AM\nNeeds Another Update\n\nAfter the latest update, adding multiplayer,\nmore than not, continues to download and doesnt stop, trying to connect with another players. Many other glitches are making the app unplayable. After a game is over, theres no way to start a new game. It just says bring up menu for a new game. Wheres the menu ?\nIf you mean the the phone window, theres nothing there that starts a new game. I have uninstalled and reinstalled the app many times...That doesnt fix the problems.\nI hope you can fix the app. thanks....\n\nHelpful | 9", "orphangononoMay 4 at 12:24 PM\nDelivers what it promises\n\nIts great at what it says it does, if you want this style of game its great if not then its not great.\n\nHelpful | 0", "marcusmarcanoApr 27 at 11:44 AM\nGood game but needs more bars\n\nTheres so many stores across the spawn you can add a pathway and really expand the game but amazing game\n\nHelpful | 0", "emkarmaMar 31 at 5:14 PM\nMace\n\nI love the game but I only have really one problem, I have no clue where to find the mace! I have looked in every bar and cannot find the mace. This disappoints me because I have seen what the mace is like and it just looks so fun to use!\n\nHelpful | 1", "shogun1411349 days ago\nMy favorite game\n\nIts really fun picking people up is a little hard but its still an amazing game\n\nHelpful | 0", "TaylaWadMay 9 at 1:26 PM\nAwesome stress reliever\n\nIt is a great game to play if you want to de-stress.\nBeware it is sweat inducing\n\nHelpful | 0", "harrysp0terMay 19 at 7:53 AM\nGreat game for an hour\n\nThis game is so fun funny and just a great game but I feel sick after maybe a hour of play time I dont get motion sickness on any other game but this one\n\nHelpful | 1", "samykite13Apr 20 at 1:18 AM\nFun vibe\n\nDrunken bar can be really fun, there is this weird thing about pretending being drunk and starting a bar fight that makes playing this game hilarious. I ve caught myself laughing out loud playing this several times. It's serious fun. On the other hand, the game isn't that good looking- it sorts of need a good polish.\n\nAlso, I've found out I might be a virtual wife beater, and I enjoyed it.\n\nHelpful | 1", "Captain_john2 days ago\nGood\n\nGood\n\nHelpful | 0", "TrumpyVRApr 11 at 8:34 PM\nBest game Ive ever played\n\nIt was sooo fun I mean who doesnt want to play this game and then the multiplayer came out and that was even more fun you can socialise in VR when your playing this amazing game definitely buy this game\n\nHelpful | 1", "WizbroMar 22 at 2:34 PM\nLove the game but there is one glitch\n\nSo I love the game but there is a glitch for me when after you finished all the bars the victory screen wont go away even if I press the menu button so if anyone can help me I would greatly appreciate it thanks\n\nHelpful | 3", "millennial37Apr 21 at 9:36 PM\nFor 16 dollars\n\nI feel like the vr world is like AOL back in the days. Boring and boring. Like I want to keep kicking the sh*t out the same guys over and over again. For 16 dollars, this game is a rip off. Sorry.\n\nHelpful | 5", "strayrandomheroJul 1 at 7:22 AM\nFantastically stupid fun\n\nOk\nFor a game with no plot point what so ever.\nIts great pure and simple go in to a bar drink and fight everyone and everything its dumb fun that's it and that's all it needs to be.\nThere is tons of room for improvement and more areas and better tracking on things you can grab in the environment but nothing really deal breaking. If your looking for a few laughs or to let out some deep seeded anger issues this is worth the price.\n\nHelpful | 0", "WolfPlayz2Apr 17 at 6:58 PM\nGood game but...\n\nThis a really fun game but I like the old drunken bar fight it actually showed the arm and I dont know if you can but I wish you can put back the arms of you can thank you \n\nHelpful | 1", "J-_May 22 at 11:55 AM\nFun\n\nFun\n\nHelpful | 0", "zebo13Apr 29 at 6:48 PM\n\nI like your game so much. But can yall add a wwe ring and some random Wrestlers\n\nHelpful | 1", "LightningBoi29631Mar 14 at 9:39 PM\nSuggestion\n\nI have a multiplayer idea. Maybe you could make a mobile app that other people can use and fight the VR user, kind of like Acron, Attack of The Squirrels!\n\nCan you add Grabbing and throwing people without having to kill them.\n\nHelpful | 2", "CoolKid20Mar 26 at 3:53 PM\nJust 3 (or more)\n\n1. Can we be the rag doll as a character so that it is more easier to become a ragdoll and be more wackier\n\n2. Can we punch our co-op partner\n\n3. This is perfect\n\n4. Can you fix the Join random game button\n\nHelpful | 1", "valevalencia6 days ago\nReal fun\n\nFun game\n\nHelpful | 0", "alex.maw.963Apr 5 at 4:08 PM\n\nReally fun game and a great stress reliever, my only problem is the graphics. For me, it looked rushed which isn't a massive problem, but it would be nice to play in a more polished environment\n\nHelpful | 1", "bruh_moment88Mar 15 at 6:42 PM\nAwesome but..\n\nThis game is very good I find myself playing this game until my quest dies. I love how when you knock someone around you can pick them up and swing them around. My only problem is that I wish you could have more NPCs spawn at once but other than that it's great and definitely worth 15 dollars\n\nHelpful | 1", "greasykiwiApr 30 at 8:16 AM\nAwful.\n\nVery shallow game with awful graphics and very basic fighting mechanics. You grab. You swing. Thing is hit. Thing down. Hit thing more. Just dont get it, even on sale.\n\nHelpful | 3", "williamholt454Apr 30 at 8:43 AM\nEpic\n\nReally fun and stress relieving, has it all, comfort is great, graphics could be better though.\n\nHelpful | 0", "GuyHeroMar 16 at 10:27 AM\nMake a medevil version\n\nThis is a simple yet fun game. This is basically blade and sorcery but in a bar. If you guys make a medevil version. Id buy immediately and alot of others as well\n\nHelpful | 3", "nomo10Apr 21 at 9:46 AM\nPlayed one round now cant play anymore\n\nAfter un-installing and re-installing it went back to the original setting. Cleaning out all the progress, but not a progress I have to cry over. But if this happens to you, re-install. I did get an email from the support team to tell me.\n\nDeveloper Response was:\nsorry for the issue, you can grab the close sign on the door to re-open it.\nTried that... it did not work either. But at least they answered.\n\nAfter finishing all 4 bar locations the game will not let me reset. The games support page through the Oculus app shows a helpful link to click but does not work (says page is broken). Ive owned the game for more than two weeks, played less than two hrs and havent been able to play but once, already passed the two week return time so I cannot return either. Will this ever be fixed? The instructions to press menu button to reset DOES NOT WORK. pressed it long, short, all buttons and nothing\n\nHelpful | 0\nDeveloper ResponseApr 21 at 5:19 PM\n\ndid you try throw the close sign on ground and break it?", "ShmalecApr 20 at 2:13 PM\nGood game\n\nI would put 4.5 stars but I cant do that.\nSome bugs but you get used to it.\nFun multiplayer.\n\nHelpful | 0", "asian_beetlejuiceJul 16 at 9:22 PM\nVery good game\n\nIts fun and good but you guys need to add the bodys when we play online so it at lease looks more real then just floating heads and hands but I think its pretty fun. good game to play\n\nHelpful | 0", "xcom93Dec 7 at 7:22 AM\nBe nice if\n\nThere needs to be more npcs also when one npc hits another they should fight each other. It would also be nice if we get the new ally way and there needs to be were the police come inside and tase you but you could also fight but that just a idea could you add in the arms of the player it would be pretty cool if the devs would add some more places. But ether way pretty fun\n\nHelpful | 157", "StefEddieApr 5 at 10:11 PM\nAMAZING GAME!\n\nThis game is great for relieving stress, and just feeling powerful. You should buy now!\n\nHelpful | 2", "deb598917 days ago\nGreat game but missing 1 thing\n\nIts great on the oculus quest but if you could put the arms that would be good\n\nHelpful | 0", "ClicksTwo15 days ago\nJust get Drunk\n\nSimple fun to grab someone by the neck have a beer and slap them.\n\nHelpful | 0", "gaminglegend23Apr 12 at 4:16 PM\nGood stress reliever.\n\nThis game is a fast paced, fun stress reliever. Although it does get repetitive, it's really fun to go all in and punch some people.\n\nHelpful | 1", "leon.carpin.790Jul 2 at 4:00 AM\nGreat game but..\n\nThis game is great. You can start fights for no reason and use anything you can get your hands on. I rated 4 because I wish that you actually have a full body and all the props were already unlocked. Great game though.\n\nHelpful | 0", "leo_9799Feb 21 at 2:00 AM\nVery good game\n\nGreat game. Even though the graphics are not up to the standard game, the gameplay makes up for it. At the moment this is the closest thing us quest users have to games like gorn and blade and sorcery. So overall, excellent game takes a while to get over the movement and graphics but in my opinion 10/10\n\nHelpful | 3", "SvEnOmOsAbRgApr 19 at 12:41 AM\nGreat game!!\n\nSince they fixed the multiplayer it made the game more enjoyable since now I can play with my friends and have endless amounts of fun\n\nHelpful | 1", "FloydDelFuegoMay 2 at 4:36 PM\nWaste of $\n\nThis should have been a free experience or at most a $5 game. Gameplay is very awkward & confusing and the graphics are just terrible. Lot's of glitches with the menu button as well, especially after you beat all of the bars.\n\nHelpful | 2", "wyattjamesc5 days ago\nDrunken bar fight\n\nCoo\n\nHelpful | 0", "xGysaMar 26 at 5:00 PM\n\nGame is good and everything wish the enemys wouldnt crawl away from you. Also the multiplayer is broken I try to join up in a random lobby with someone and it doesnt pair me up with anyone. The only way I join someone is through friends m. You should make a random match joiner Incase our friends arent online.. update random match feature is broken\n\nHelpful | 2", "TxFrostyDec 11 at 3:49 PM\nOnline?\n\nThis game is fantastic I love it but the only thing Is that there is no online and I feel like if it was online it would be better also, if you beat a level I would want to have a option to have every one that you just beat and be in there at once like a full bar or weeding I would really love if there was online though.\n\nHelpful | 79", "that-manMar 10 at 5:28 AM\nThere needs to be multiplayer\n\nIts fun it really is but it would be more fun if there was more people to play with and fight with then it would make it more interesting if there were more npc\n\nHelpful | 3", "JacoobAH7Jun 13 at 8:38 AM\nGreat game but one thing that sucks\n\nOverall I love this game and it is defiantly worth the money, but I havent even had the game for 24 hours and I have beat every bar or place at least 3 or 4 times. I think that there should definitely be more bars and more variety of everything. Also it would be great for options to pick how many people you fight, how strong they are, how long the fight lasts, things like that. I think with at least 7 to 10 bars and difficulty settings for the Ais this game would be a five star\n\nHelpful | 0", "eddie706Mar 13 at 10:58 AM\nFun game. But this would be cool\n\nVery fun game and very happy with new update. just some suggestions to make game more fun\nit would be cool if you can bust the end of a bottle and use it as a weapon. like a classic bar fight.\nmore weapons and more possibilities. It would be cool if theyre was a gun you could use like just a revolver that spawns in every now and then. also I wish the knives were able to use and stab people like the game Blade and sorcery. that game is really fun but unfortunately isnt on the quest if you base some of the mechanics on that game.\nfighting each other in multiplayer. I enjoy the new co-op playing but i noticed you cant fight other players. I think it would be fun to knock out a friend and have a fight with them.\nMore maps would be cool. I feel more maps would add to the available things to use on the npcs\nOverall this is a good game and i do recommend it but these things would make this game the best game on the quest\n\nHelpful | 1", "AidanRineyApr 13 at 3:09 PM\n\nI had fun beating people to a pulp with metal objects in a back ally\n\nHelpful | 2", "MythicalFearMar 20 at 4:51 PM\nIts broken\n\nAfter when I unlocked everything Ingame it wont let me restart it says press menu to play again like usual so I press the menu button and nothing happens so I do it over over again I reset my headset and do everything in the book! I know the button on my controller is not broken because it works everywhere else as in other games. So Fix your game now! Its unplayable. Sorry for the bad use of grammar I feel a little bit lazy today.\n\nHelpful | 6\nDeveloper ResponseApr 14 at 5:18 PM\n\nsorry for the issue, you can try grab the close sign on the door and break it", "AfraidBicycle92Feb 10 at 6:03 PM\nSo much fun\n\nI first got this game to play with a friend but then we found out on the quest it was only single player. We still played and it was so much fun to play even without my friend. It would have been a five star if there was a multiplayer feature and I think there should be more bars and people added into the game but other wise its amazing\n\nHelpful | 3", "steven.ward.1829Mar 20 at 9:10 PM\nGreat. But what's my score.\n\nReally would prefer some kind of visible score. Didn't even realise this game had it until I wrecked all three bars and finally got a number.\n\nHelpful | 3", "ScotchandMaxx15 days ago\nGreat stress reliever !\n\nI was drenched in sweat from whoppin A$$!\n\nHelpful | 1", "bigworld12Mar 25 at 4:02 PM\nFun but dizzy\n\nThis game is awesome but its not for the people who have motion sickness. It has so many things to interact with and you get to just release all your anger on those drunk people\n\nHelpful | 1", "EarlDibblesJrMar 24 at 7:40 PM\nGreat game\n\nPerfect only thing I ask is for you guys to add chew into the game because you have spittoons but where is the dip\n\nHelpful | 3", "mrjleetMar 30 at 8:55 PM\nDrunken Bar Fight\n\nThe game is great for the price, but the game keeps on hanging up when you try to reset the 4 bar scenes. It says to press the the menu button, but it doesn't work.\n\nHelpful | 1", "guitarhero14830Mar 14 at 9:56 AM\nAmazing! But theres a few things\n\nI think this game is amazing. However I think there should be more weapons like in the PC version. There should also be multiplayer because that would make your game amazing and hilarious. I love this game and it always seems to make me laugh.\n\nHelpful | 1", "Xo_CamelotFeb 15 at 12:50 PM\nAwesome but could be even more awesome\n\nNgl it was a really good game. I only had it for two days counting this one and it has been a fun and awesome experience. U can also play this game if you want to take your anger out of something. When i was playing this game i thought it could use a bit more. Maybe more bars or locations? It would also be cool if there could be more AI in the same room. You could only have 3 enemies in the same room at a time which could be better if it was either 5 or more etc. Now some of what im saying might not be true because again ive only had this game for two days but all in all the game is awesome but could be even more awesome.\n\nHelpful | 2", "tulipswagmire25 days ago\nSimple Fun\n\nAlthough it isnt the best made game, i have never had more fun in a vr experience.\n\nHelpful | 0", "Logannaylor08Apr 14 at 3:34 PM\nWhere is the full body\n\nThis game should be full body so please this would make the game 100 times better\n\nHelpful | 1", "tug_May 7 at 6:22 AM\nYes\n\nyes\n\nHelpful | 0", "squidopsApr 17 at 4:16 PM\nDrunk Bar Fight\n\nBest game hands down.. My whole family had a blast. My mom was so into it that she hurt her elbow lmao\n\nHelpful | 1", "LiquifyVRMar 15 at 8:16 PM\nGood game but some flaws\n\nThis game is amazing in lots of ways good replay ability but u get carried away in multiplayer I was holding 1 person in each hand smashing them at a person on the floor and I broke two fingers punching my desk\n\nFun but dangerous\n\nHelpful | 1", "kacperolieJul 17 at 5:24 AM\nThis game This Game Is PERFECT\n\nI CAN KILL MAFIA CITY BOSS AND STOP THE ADS THERE'S 2 PLAYER COOP LITS OF WEAPONS LIKE A GUN FIRE WORKS ETC THIS GAME IS FUN As good\n\nHelpful | 0", "HiMyNameIsMarvApr 13 at 4:49 PM\nLimited Gameplay\n\nThe first time you boot up the game and play all pf the levels, it's a blast to throw people out of windows and off of roofs. It just gets stale and old after a while and doesn't have much replayability to it. Good game, but could be better\n\nHelpful | 1", "furmansionApr 5 at 4:25 PM\nBEST GAME IVE EVER PLAYED\n\nIm speechless Great quality stress reliever and just fun I love it\n\nHelpful | 2", "ConnacemoxJul 22 at 3:22 AM\nFun!\n\nA game I keep coming back to and release all my frustrations. It is super fun and addicting. \n\nHelpful | 0", "darkheart12Mar 24 at 8:09 AM\nI like this game\n\nIts fun but after a couple days it can get repetitive but overall its a very fun game.\n\nHelpful | 2", "M3TR016 days ago\n\nGreat\n\nHelpful | 0", "comet007Mar 31 at 2:40 PM\nAwsome game but one thing\n\nIts a great game but you need to fix the problem with only three enemys aloud in a room at once i know it might lag but can you please at least make it a option thx\n\nHelpful | 1", "mike.orr.14289Apr 7 at 8:02 PM\nDrinkun bar fight\n\nThis game is kind of easy to finish\nBut its also the funnest game Ive played\nFunny to watch other people play too\nHats off\n\nHelpful | 1", "Poovy23Feb 29 at 8:07 PM\nGood game but...\n\nIt's a very fun game but it would be a lot more fun with a multiplayer option. Also there's a bug where I can't make a fist with one hand(its my right one) but once I'm done with that bar option or close the game I can. add multiplayer and fix that bug and you have a 5 star game\n\nHelpful | 1", "pilotman21Mar 20 at 9:48 PM\nMore\n\nThe game is very fun and a great stress reliever. But all it needs is multiplayer and more bars\n\nHelpful | 2", "VaporyBeatMar 27 at 9:21 AM\ndecent but not as good as it could be\n\nThe game starts by throwing you outside a bar and giving you a prompt to go in and then it lets you start having fun throwing, drinking and fighting but to be honest the combat isnt the best and feels like Goat Simulator because of the rag doll effect. The Npcs dont look great and only 3 can be in the bar at a time which isnt great so even though the game is fun for an hour or so while you explore and beat all the rooms there isnt much replay ability other than unlocking cosmetic items for your hands. Overall the game is decent for a couple minutes of messing about but gets boring really quickly after a while and I dont think it should be 11.99 and instead should be around 7.99 at most because of the lack of content. If you wanna get the game then go ahead and see what you think but I cant recommend it when there are games like Gorn and Job simulator which are only around 8 more.\n\nHelpful | 1", "UNImagicMMFeb 22 at 11:44 AM\nShort but Sweet\n\nThis game is one of those to play when you have time to spare. The collectibles make the game a little more fun. But a down is theres not enough people in the bar. Even if some are inactive I would like more. And, its very short make it so theres actual long gameplay. In any way this is a really fun, all out game. Deserves lots of love, not intended for 10 hours of gameplay straight. But, with a little time to spare you could have some fun kicking butt.\n\nHelpful | 1", "Fudge1218Apr 25 at 9:12 PM\nGood game but\n\nIt's a fun game but I find myself constantly at war after conquering all the bars as the game doesn't recognize the menu button to restart hardly ever. So now I can't play the game anymore after conquering the bars\n\nHelpful | 1", "UrVeryStinkyApr 10 at 12:21 AM\nGood Game\n\nThis is a good game overall bit I need more people to play with\n\nHelpful | 1", "landonzane333Apr 26 at 4:20 PM\n10/10 BEST GAME EVER\n\nLove this game\n\nHelpful | 0", "PiggyWiggleMar 14 at 11:55 AM\nNeeds a bit more but a great game\n\nDrunkn Bar Fight is a really cool game and all but I feel like it needs more things like\n1. A full body in multiplayer\n2. More people there in multiplayer\n3. The ability to fight your friends\n\nHelpful | 1", "dundunduuun.Jul 28 at 1:04 AM\nGood game\n\nMe and my friend played till 3 in the morning\n\nHelpful | 0", "OculasArcher67Jul 6 at 8:29 PM\nTHE FUNNEST GAME EVER!!\n\nThis was a lot of fun and the body launchers are the best part and I love how the objective is to DESTROY the bars..\n\nWould recommend this game!!\n\nHelpful | 0", "Harbinger_Hume-humeJul 26 at 2:13 AM\nHALP!\n\nI was looking forward to playing this game, but I can't play it with my setup at home if the settings or Google won't tell me if I can rotate my view w/ the thumbstick.\n\nHelpful | 0", "SirLemonIIJun 26 at 7:24 AM\nAmazing game\n\nI love how you can pick up pretty much anything and throw it and how you can play with a friend.\n\nThe only thing I would say wasn't great was the very few number of maps/bars to fight in.\n\nHelpful | 0", "JediunfallenMay 26 at 3:40 PM\nFun game for whoopin butts\n\nPretty nice for taking out the anger of the day. Got a lil dizzy though,is there a way to make the right thumbstick turn your body? I also couldn't grab everything I tried right away,had to try a few times. It's a lil difficult to pick yourself up too, it doesn't react properly every time you try. Also women only have to hit you once for K.O? i had fun though. Thanks for building a good anger relief game with some good music too!\n\nHelpful | 0", "DeadlyCrusherApr 15 at 1:58 PM\nGood game\n\nIts good for a bit of crack for a while\n\nHelpful | 1", "ZakkyWhakkyApr 7 at 11:40 PM\nGreat\n\nI think that this is a great for stress relief and having a good time \n\nHelpful | 1", "happydave08Jan 27 at 4:09 PM\nUuummmm\n\nThis game is good the only problems are when you go into a bar and you start a fight if you go next to the door it will take you out of the bar you are in. And if you finish the level you cant play it again I havent finish all of them yet but I think you cant play them again. Those are the only problems Ive found other than that its a good game\n\nHelpful | 3", "FissilePumpkin4Feb 21 at 7:14 PM\nGreat Game but Needs to be Multiplayer\n\nThis game is definitely one of my top favorites! Although multiplayer and coop would be nice like how it is on the oculus rift, I definitely would love to see it updated soon that way!\n\nHelpful | 2", "sirlightlordFeb 29 at 8:45 PM\nIts good but\n\nYou can have add more npc and more dialogue and multiplayer and can you add gun or like finish people off\nAdd fix the grafic look like a block\n\nHelpful | 2", "ofirleon10Apr 6 at 12:49 PM\nIt's good but...\n\nThe game is good but oculus rift is way better\n\nHelpful | 1", "KingSombra9Mar 15 at 8:29 AM\nRecent update\n\nThe update you did recently that added multiplayer doesn't work, it keeps saying the servers are down if i try to host or join.\n\nHelpful | 1", "spudnut6Mar 14 at 4:00 AM\nMultiplayer\n\nPls add multiplayer because me and my friend saw people playing this multiplayer so we got it thinking we could mess around but its still fun\n\nHelpful | 1", "NUBIGUMIMar 24 at 5:53 PM\nGG\n\nI love it but my family don't xD\n\nHelpful | 1", "JUSTV1B1NGMar 4 at 6:19 AM\nThis is alright\n\nI really like this game personally but some features could be added like on the psvr the character has actual arms and legs also on the HTC vive there is multiplayer\n\nHelpful | 1", "NightMonk3yMay 22 at 6:05 PM\nGreat fun\n\nSuprised to hear so manu negative reviews on this game. After wanting to play it for so long i finally purchased and started to play. The game is so much fun just smashing people over the head with bottles and wooden chairs. The graphics are surprisingly decent aswell, i tried to jump online twicr but had no success. I really hope the developers add alot more bars too the game.\n\nHelpful | 1", "JoojTheMACJul 15 at 7:59 PM\nGreat game\n\nPlayed with my cousin fun\n\nHelpful | 0", "Jalap3n0Jun 12 at 8:28 PM\nFun but,,,,, needs more content+\n\nMy caption says it all, its a fun game but just needs some content weather its adding dlc or simply updating the game, overall still a fun game.\n\nHelpful | 1", "CamRonLee2006Mar 26 at 10:04 AM\nI punched my tv!!!!\n\nGreat game! Much fun! I indeed punched my 55 inch Sony tv.......great game though!\n\nHelpful | 0", "GharaJun 21 at 10:41 PM\nHelp\n\nI cant start it because of some update but the update wont work. Does anyone know how to fix this?\n\nHelpful | 0", "ryantheclassclownMar 13 at 7:42 AM\nONLINE IS NOW AVAILABLE!!!\n\nGUYS ONLINE IS AVAILABLE SO DONT COMPLAIN AND IM NOT MAD IM JUST HYPED\n\nHelpful | 2", "rile007Jan 4 at 8:49 PM\nGreat Game-1 flaw\n\nThis is a great game and ive easily gotten 5 hrs out of it but i feel there are little weapons in the game. In any version not quest there were far more ppl in a bar and i remember the whip being the funniest in the game in the rift. But the version on the quest seems not updated to include weapons like the whip.\n\nHelpful | 4", "steelgaming06May 31 at 3:36 AM\nGreat game\n\nI think this game is great but I only have it 4 stars because of some off the mechanic's and how sort the game was I completed the full game in 20 min but apart from that great game buy it price is great\n\nHelpful | 0", "ClymiusJul 17 at 10:16 AM\nIt was good\n\n\n\nHelpful | 0", "BendoesvrMar 20 at 10:57 PM\nLove the wacky physics\n\nI love this game its like a mix between me getting in a fight and being a rag doll I recommend this.\n\nHelpful | 1", "ThTuffStuffFeb 7 at 1:16 PM\nWacky fun\n\nThis game is just full of wacky fun. The comments people make before, during, and after getting beaten are hilarious. I threw a man out of a window. I used a mans ragdoll body to severely beat a Garth Brooks fan. I threw a woman. If you get someone on the floor, then you can beat them until your arms get tired. No jail time. Just good ole janky fun.\n\nHelpful | 1", "adamr.flyFeb 7 at 12:04 PM\nAmazing game\n\nThis is by far one of my favorite games. Whenever I put on my headset I almost always start with this game. I love messing around in this game, and to be honest that is that whole point of this game, its just to mess around. I believe that anyone who buys this game will meet and exceed their expectations. 100% worth my TIME and my MONEY.\n\nHelpful | 1", "BenGeskinJan 9 at 10:13 AM\nMOST FUN I HAD IN VR! \n\nThis is the funniest game I played so far on Quest. Ragdoll physics are great. You can grab and throw or use as weapon almost all things in the game. I played thought entire game in 50 minutes, but I and my friends replayed it many times  Great game, funny, nice way to release stress\n\nHelpful | 4", "RepaidPoet17034Jan 9 at 12:04 PM\nAWESOME, But...\n\nThis game is super fun. Heads up there are only 4 rooms that you can fight in and after you beat all of them (by defeating every person that walks in) the game is over. You can replay it as many times as you want though. I would not recommend this to people that get motion sick really easily. You have to move using A.M. (artificial movement) a lot and that is the usual cause of motion sickness in vr.\n\nHelpful | 16", "wyliecoukouMar 29 at 7:30 AM\nEpic\n\nSupper fun and easy to get lost in.\n\nHelpful | 0", "TheElTortugaFeb 22 at 3:40 PM\nThis game is so violent!!\n\nI let my son (8) play this game because wit looked fun, however he now starts cussing when he is playing it. He is also charging MY card for other Oculus games and I hate it! This game is basically teaching kids how to be a criminal! So, extremely, inappropriately, BAD!!?!!\n\nHelpful | 0", "toastdeFeb 22 at 3:54 PM\nDO. NOT. BUY.\n\nDO NOT listen to the 3-5 star reviews, I can promise you this game is terrible. Ive waited months for this multiplayer update but they have not updated it once since release. Terrible glitches and awful graphics sprinkled along the way. Terrible port with no effort. DONT BUY.\n\nHelpful | 3", "RumpelforeskinFeb 4 at 12:57 PM\n\nWould really like if you guys could make it more like the PC version with a body and more than 3 people in a bar at the same time. Also, if you guys could make a way to play with other real people that would be really cool. Both my brother and I have this game and thoroughly enjoy it, but he is always asking me how we can play together.\n\nHelpful | 0", "AvidAntelope200Jan 22 at 7:43 PM\nBuy this game\n\nThis game was one of the first games I played on the Quest. It was so fun to just be able to punch somebody over a bar counter or head-but somebody into the ground. I would say that the movement is weird and gets some getting use to, but after you get use to it it becomes a hilarious game with wacky physics and funny ragdolls.\n\nHelpful | 6", "Emonkey058Mar 31 at 7:02 AM\n\nGreat game\n\nHelpful | 0", "rokas2006Mar 28 at 3:35 AM\nEpic\n\nThis game is very epic\n\nHelpful | 0", "VoodooJonnyFearFeb 1 at 4:41 PM\nDude where do I start\n\nThis game is a lot of fun. It goes down almost exactly the way you expect. You spawn in, and you start beating the crap out of people, the controllers even vibrate to KINDA simulate the feeling when your punches connect. There's weapons around the bars to pick up, and there's power up drinks that spawn in. There's not much to it, but does there really need to be? I like the music in it, though it'd be better if there was some HARD metal. Overall, really fun game to blow off some steam on. Only downside is that I can't play long before the motion sickness sets in, but they do say that it's intense so I certainly can't fault them for that.\n10/10 highly recommend\n\nHelpful | 0", "Captain_AustraliaMar 19 at 5:42 AM\nMultiplayer doesnt work\n\nGame is cool but multiplayer doesnt work at all.\nI sent an invite to a friend and his game was stuck in a loading circle, and when I wanted to join him, I just got kicked back to the lobby\n\nHelpful | 1", "IXX_HD_IXXJan 22 at 2:12 PM\nVery fun to play but...\n\n(Before I talk about negatives, the game is great and fun and Id give it a 4 1/2 stars with high recommendation...I dont get motion sickness personally so I cant relate on that but it is fun and a good buy) This game has a dilemma...it is extremely repetitive not only with only beating up 3 enemys at one time but only 4 bars and nothing really changes after you beat all 4 bars for the first-10th time except for accessories. The repetitiveness can still be good for the game and it is fun to play and go back to but their is a lack of content..if the game had some more content definitely a 5 star especially for getting your moneys worth\n\nHelpful | 1", "beasty123Mar 29 at 6:34 PM\nGreat game\n\nGreat game\n\nHelpful | 0", "The.ping.benderJun 21 at 11:15 AM\nThis game is so good\n\nI got this game because I like beating people up thats all you do in this game\n\nHelpful | 0", "Killerstinger94Jan 30 at 6:34 PM\nVery fun, great game\n\nDrunkn Bar Fight is a very fun game. You can fight and drink in bars and an alleyway. You can pick up almost anything and use it as a weapon. It is also a very funny game, the NPCs can say some very funny things. Drunkn Bar Fight is well made and very fun to play with friends and family. There are even fireworks you can explode at the NPCs. I recommend Drunkn Bar Fight to anyone who likes a good laugh and fighting. One of my favorite VR games.\n\nHelpful | 0", "breakpoint5055Feb 29 at 11:34 AM\nAwesome game\n\nAfter you complete everything you can still play because it will let you do things like costomize your character and change height and do god mode\n\nHelpful | 0", "wtf_josephFeb 4 at 9:48 PM\nStress relief\n\nIt has some flaws but in general great game. I was so mad today and this made me feel way better. It's fun to beat the hell out of people with no consequences. Love the weapons too.If you play GTA and enjoy it trust me get this game\n\nHelpful | 0", "bree.patino.5fJun 26 at 11:21 PM\n\nHilarious!!\n\nHelpful | 0", "roadkill1963Mar 5 at 5:02 PM\nDrunken bar fight\n\nVery fun to play in not spend a night in jail lol. They need to fight back more. Needs more country music\n\nHelpful | 1", "0utlawzMar 25 at 6:11 AM\nThis game is awesome !!\n\nCan we please be able to dismember them haha\n:|\nOr more/ worst bruises\n\nHelpful | 1", "cmartin21Feb 15 at 7:11 AM\nWe need more...\n\nMore levels would be amazing and they should add when npcs hit eachother they start fighting and they should make the weapons have more health so they dont break so soon\n\nHelpful | 0", "Brad1954Mar 2 at 8:06 AM\nI loved it but\n\nI want multiplayer lobbys so that I can beat up a bar with my friends and also there aren't enough enemies\n\nHelpful | 2", "preachedeseven1Mar 13 at 6:17 PM\nBest game on here so far\n\nI have been waiting for a good multiplayer game and this is one of them\n\nHelpful | 0", "Co0pFeb 5 at 5:28 AM\nYes\n\nIt is so fun! The best game I have ever played! I wish there was online though. That would be so fun. I also wish you could fight cops once they come to the bar. I love the beer that makes you grow and shrink! This is the most fun I have ever had in VR.\n\nHelpful | 0", "Sry_i_cantJun 17 at 5:16 PM\nLove it\n\nIdk what about it but when I'm playing I'm having fun and thats it. Very good games\n\nHelpful | 0", "xXAZZLIONXxMar 8 at 10:49 AM\nAwesome Game But...\n\nIt would be good if the game was multiplayer and the levels were much harder I would also like if it was not buggy when picking up items\n\n\nAaron Hall\n\nHelpful | 0", "gavin.yeetersonzJan 26 at 1:54 PM\nGreat game\n\nCops with taser is good but when you punch them they drop it. I just got this game and love it already. And arms with the hands is a awesome idea. I also have an idea for the game. Walking around the city. I think that would be fun. Also it would be funny if you could get hit by a car. Everyones ideas are great.\n\nHelpful | 0", "debksurJan 25 at 7:02 AM\nrelease that anger!\n\nYep like it,if you have a bad day at work,don't just think about knocking their heads off come on here & take it out on these guys. It's fun hitting them with bottles,metal bars & just think of that person who as ruined your day, have fun & feels great.\n\nHelpful | 1", "VendableStewFeb 17 at 6:33 AM\nAmaizing\n\nMost fun I had in VR, I like the fact there is an endless mode and a setting where weapons are unbreakable while using them, I really wish that they would add a multiplayer mode though.\n\nHelpful | 0", "bean-boiMar 14 at 3:29 PM\nGets boring\n\nIt's a very fun game, don't get me wrong, but sometimes it gets boring to fight in the same 4 levels over and over. This is from\nsomeone who has unlocked ALL the weapons.\n\nHelpful | 0", "Dribble_DroppinJan 15 at 9:55 PM\nAmazing!!!\n\nI love this game and the whole goofy fights, but I just think they should make the NPC's hit more it's like I knock them out in one punch, also I think they should add multiplayer (online( so we can play with freinds! And they should add a few more maps and NPCs. Other than all that, I love this game and I play it almost everyday\n\n8/10 I recommend this game if you you haven't played it yet!\n\nHelpful | 0", "coststampyJan 30 at 6:35 AM\nRequests\n\nRequests: please make drunk n bar fight an online multiplayer game and not just single player\n\n\n\n\nAbout other games: can you please bring blade n sorcery to quest because it would be a big hit and I myself would by it aswell\n\nHelpful | 0", "aliali1712Jan 28 at 7:07 AM\nReally good\n\nI played this game on psvr and it was not good but this one is amazing! Ive unlocked all items with a secret Easter egg and each bar (and alley) has different people, I also noticed u can hit pressure points and they fall down slowly but it is hard 2 hit them.\n\nHelpful | 0", "phobes2Mar 7 at 4:16 PM\nFun and a great stress reliever\n\nFun and a great stress reliever if you're the type that hit lol\n\nHelpful | 1", "buzzin247Apr 15 at 9:49 AM\nBored\n\nI played it once and never opened it again waste of money\n\nHelpful | 1", "mcintyre260Feb 14 at 4:22 PM\nGreat fun but!\n\nGreat fun but have trashed all 3 bars and can't play!? How do i reset so I can continue to play? All bars say under construction!?\n\nHelpful | 0", "jordyjoestarApr 20 at 5:50 PM\nDull\n\nJust dull\n\nHelpful | 1", "assmasterfingerJan 28 at 6:56 PM\nReminds me of my wayward youth!!\n\nLets be honest the graphics in this game arent fantastic but its just pure joy to be able to punch people in the nut sack repeatedly. The cost was worth the lack of todays graphics!! Hopefully well get better graphics in most VR games in the next few year!!\n\nHelpful | 0", "callmesolidsnakeMar 15 at 6:14 PM\nAwesome game just some problems\n\nIts an awesome game and I believe others should try it, but there are some things that I dont like such multiplayer and graphics and such\n\nHelpful | 0", "MutagenicJan 18 at 6:07 PM\nGame is fun but..\n\nThis game is really fun and Ive spent a lot of time playing it, although it would top it all off if there were more characters like in the pc version. Maybe not as many but more than just three or four. Otherwise this game is incredibly fun and immersive.\n\nHelpful | 0", "mike.east.9619Jan 10 at 3:13 PM\nGreat game but....\n\nOverall this game is SO FUN! But it has its downsides, like its hard to pick things up and your hand had to be inside the object have the time. Also, the game is very short so I have to keep replaying bars, maybe you could add more across the street like the hotel, or the restaurants!\n\nHelpful | 1", "MeLuvHaxFeb 13 at 8:21 AM\nSolid game, but..\n\nI wish there were more locations and also a way to grab opponents and more ways to interact with the environment in general.\n\nHelpful | 0", "carter.hardmanFeb 24 at 6:14 PM\nAbsolutely amazing\n\nI bought it hoping for a game that I could play for hours and that is exactly what I got! Well done!\n\nHelpful | 0", "xiphidFeb 7 at 6:42 PM\nGood game\n\nOk all this game needs is a bit of spice.whenever you hold something it glitches in your hand.multiplayer needed. More exploration in alley fight\n\nHelpful | 0", "SKELEEFeb 13 at 3:45 AM\nGreat game but not enough content\n\nIve played this game lots of times, and it is amazingly fun! The only problem is that its quickly over and it can become boring as you keep playing it. Im sure its still in development, but either lower the price a bit or maybe add more things to make it more fun.\n\nHelpful | 1", "Brock2707Feb 8 at 10:17 AM\nNew updates\n\n1. NPCs fighting each other?\n2. Blood? (also option to turn off on the phone)\n3. Police come into the bar?\n4. Online?\n5. New rooms?\n\nHelpful | 4", "BT137Feb 29 at 8:14 AM\nThe best game ever\n\nIt's really helpful when you want to release your anger.\n\nHelpful | 0", "rob.saillantMay 25 at 11:09 AM\nDisappointing.\n\nGraphically it isn't great, which isn't something I'd be too down on if it at least performed well or had much more going for it. The game is extremely laggy, hit detection is iffy, the menu via phone is a pain in the butt to use and most of all there isn't a lot of variety. You see the majority it has to offer within 10 minutes of playtime.\n\nAs others have said it is also annoying trying to grab opponents, even after knocking them down, and even when you do there isn't much physicality to throwing them. Needs more of a physical impact and better sounds. You should be able to grapple with standing opponents and drag them around without having to incapacitate them first, but they can fight back while conscious if you aren't occasionally smacking them about a bit.\n\nBreakable tables would be cool too, to be able to recreate some pro wrestling styled theatrics there.\n\nHelpful | 0", "raincloud26Mar 4 at 2:16 PM\nThe best game for fun and stress\n\nThis game has the funniest word play ever\n\nHelpful | 1", "zyler.moore.7Feb 16 at 2:58 PM\nIt was so much fun\n\nIt was one of the best games I've seen on quest for quite some time,once I got I was in love.thanks for making a good game :)\n\nHelpful | 0", "Sodbuster1989May 12 at 8:26 PM\nMotion sickness WARNING.\n\nThis game is very fun, and works well on the Quest. But I can only play it for about 30 mins before I become very nauseated from all the fast motion.\n\nHelpful | 0", "noobnaroundMay 29 at 2:13 PM\nFun AF\n\nLove the physics and the fighting especially being able to beat people with other people \n\nHelpful | 0", "TrickstahJan 16 at 6:08 PM\nGood but seems incomplete\n\nThe game itself is fun but there are only three bars and the npc are not very numerous, you see the same person like 8 times in 10 minutes. And sometimes one hand will just stop being able to grab stuff, otherwise it is a fun game\n\nHelpful | 0", "chickennugg1Feb 29 at 1:12 PM\nI loved the new updates\n\nAwesome game, way better on oculus than on psvr\n\nHelpful | 0", "CertifiedTideMay 27 at 1:40 PM\nGreat game! One thing tho\n\nMy only things I would change is having smooth turning with the right stick instead of snap turning\n\nHelpful | 0", "TheGreatJAEJan 2 at 10:45 PM\nThe best game I have right now\n\nTo some people might think its boring but it is so fun once you try it. I played it 4 days in a row I cant stop I saw a review saying it gives them motion sickness but I didnt to me so if you like fighting and dont get motion sickness I %110 recommend it the only things I want is multiplayer\nadd the characters arms and more npcs to fight I only found one bug in it where my right hand doesnt move its fingers but its not my controller because I went to the home screen and it worked fine anyway please fix this and add multiplayer PLEASE\n\nHelpful | 3", "LittlebigBoiJun 13 at 6:39 AM\nEpic\n\nIt be fun\n\nHelpful | 0", "African_frogMar 1 at 5:43 PM\nPretty fun\n\nPretty fun till I punched my desk.\n\nHelpful | 0", "big_swaggerguyApr 18 at 5:31 PM\n\nLiked it good game for quick fun graphics could be a bit better wish there was more blood tho since there is weapons but small things that could be added during updates not a ton or maps/ places to fight(4) I found but overall not a bad game for 20$\n\nHelpful | 0", "Dino69_Feb 16 at 12:47 PM\nAwesome Game\n\nDrunkn Bar Fight is a great and fun game. I play it all the time and find it extremely funny and fun.\n\nHelpful | 0", "frankbuscus02Feb 21 at 11:30 AM\nUpdate\n\nThe game is absolutely amazing but I hope they add new rooms in the future\n\nHelpful | 0", "larry.goedeMar 13 at 10:26 AM\nDrunken bar fight\n\nUsed to enjoy the game. It needed to update and now it won't let me play!!\n\nLooks like I wasted my money\n\nHelpful | 2", "Ammo777Jan 3 at 5:29 PM\nDrukin bar fight\n\nAmazing game if you just want to beat the hell out of some guys it was really fun at first the game was really fun the first time I played but the game was really short I already completed it seven times and I still think it it loads of fun I recommend this game to all be users\n\nHelpful | 0", "Rossatron96042Feb 9 at 6:18 PM\nPretty good\n\nIts a great game now I can relieve all my stress but I feel like they need to add more maps\n\nHelpful | 0", "idrinkgingerbeerMay 29 at 9:41 AM\nJust a wicked goofy and creative game\n\nGrab what you can, drink what you can and smash these people in their faces\n\nHelpful | 0", "JasminionMar 26 at 3:48 AM\nCan't access the menu\n\nLove the game but can't access the menu to re-open the game when I've done all of the bars\n\nHelpful | 0\nDeveloper ResponseApr 14 at 5:16 PM\n\nsorry for the issue, you can try grab the close sign on the door and break it", "jagerwaldDec 29 at 2:40 PM\nGood For What I Paid\n\nFor starters, I got this game at a discounted price and I used the starter $5 store credit - bringing the price down to $4.74. I believe that this game should be around $5 as $15 is pretty steep considering the lack of content.\n\nPros:\n- Funny as hell\n- Lots of different objects and weapons to fight with\n- Customizable character\n- Reminds me of POSTAL 2\n- 4 different levels to choose from\n\nCons:\n- $15 regular price is too much for the amount of content\n- Physics can be wonky at times\n- Glitchy, sometimes my character's hands don't work when attempting to grab things\n- Repeating levels over and over is a necessity to unlock more items/customizations\n\nOverall a fun game, I just wish there was more content.\n\nHelpful | 0", "groovyfinFeb 23 at 9:08 PM\nGood game needs to add more people\n\nI like the game needs more people in the bar great game !\n\nHelpful | 0", "theoneontop101Jan 1 at 10:12 PM\n\nI love drunken bar fight but there are some things missing,to start off I would like it if there was an option put in the that would allow there to be blood in the game (for example, when you throw a dart into someone, blood when then come out), another thing I would like to see would be the rest of the street level added with all the weapons unlockable for it, to end this off with the third and final thing added I would looovveee it if you could customize and create your own level with your own weapons and npcs.\n\nHelpful | 2", "IKnowYunoItFeb 2 at 12:13 PM\nVery fun for the time you play it\n\nThis game is very simple yet I love it so much. If you ever need some laughs or just want to launch something with a guitar this is the game for you.\n\nHelpful | 1", "Inspired_noobFeb 5 at 8:22 PM\nLonely\n\nI wish I could play with more people but it's still really cool to play that's my only grievance about it\n\nHelpful | 0", "Nq_I_MATTJan 18 at 9:07 AM\nBest game Ive played but\n\nThis has to be one of the best games on the quest I have played. Not only is it fun but interactive but it would be nice if it was multiplayer or add some new places. Over all it has to be a 9/10\n\nHelpful | 0", "Hockeycoop6309Feb 14 at 7:52 AM\nBest game ever\n\nI love this game.i wanted it Wen I saw it.now that I have it I have been playing this game since.\n\nHelpful | 0", "FatalEazy47Feb 18 at 1:47 PM\nIts fun but..\n\nYeah the game is fun in all but if you get dizzy and nauseous easily do not play this game. Every other VR game Ive played hasnt made me sick to my stomach but this game has on 2 separate occasions.\n\nHelpful | 0", "TeddyBear82Dec 27 at 7:05 PM\nFun times, anger managment\n\nThis is a cool game. It is not a boxing game and shouldnt be; when you open this one up its because you want to feel like a super hero and just beat people down. And this game excels at that. I agree about maybe changing the grip button instead of the trigger since I just started using recently and that is the standard from the Oculus demo. Variety of weapons and enemies and locations is good - near seeing what is around you can grab. This is kind of like a VR rage room which actually is better than a real rage room since you can hit people in this one. I can see using this a lot after a tough day at work...or maybe I will bring it into work! Haha.\n\nHelpful | 0", "KrispyChrisMay 30 at 4:26 PM\nNice\n\nSure it has 3 people only but hey fun to beat the people.\n\nHelpful | 0", "AaronBfgDec 27 at 9:09 AM\nGreat game\n\nOn my friends htc vive this game was class because the ally way part was much longer had more people and more weapons to use as well as the bar and upstairs. Really wish this was the same tho because three people is like the max and its more fun with loads of people, but overall is a great game.\n\nHelpful | 0", "sepp187Mar 17 at 11:18 AM\nWheres the multiplayer\n\nI bought this game and found out there was no multiplayer, so I was going to return it. Then I read that multiplayer was coming, but still no multiplayer.\n\nHelpful | 1", "AnthonyAC814Jan 11 at 3:14 PM\nAwesome game but.....\n\nWhen is multiplayer going to come out for drunken bar fight because I think me and a lot of people have been waiting for there to be multiplayer and it still hasnt came so if you can let me know about that please tell me\n\nHelpful | 0", "aaron.sommers.1253Feb 28 at 2:59 PM\nDrunken Bar Fight\n\nClassic Vr at its best :) Drunken bar fight is so much fun, don't go in to serious and expect to much. Do expect Drunk, Fighting, Fun, that's all.\n\nHelpful | 0", "TheMan06Feb 11 at 9:48 PM\nGreat Game\n\nI love the gameplay, its so simple but so fun and addictive, would be nice if there were more songs though.\n\nHelpful | 1", "Yeeterman475Dec 27 at 3:58 PM\nVery Fun\n\nThis game is super fun, like how glitchy the game can be and you can grab people, but Im not saying thats the only fun part. 4 levels of amazing brawl as well, I just love how much different items there are for each level, example if you go to the wedding level (elevator level) theres fancy drinks and In the regular bar its just beer. In the alley way one of the final people you fight is a superhero which is even more cool. Conclusion this game is awesome and you should buy it.\n\nHelpful | 3", "McgruffMay 11 at 8:05 PM\nReally funny but gets old fast\n\nThis is a fun game to show your friends and family but it does have limited content and replay potential.\n\nHelpful | 0", "RumhouseApr 2 at 3:15 PM\nA little tweaking...\n\nNo doubt this is just pure goofy fun. No goals. No point in much of anything at all except to brawl. Love it. Graphics are sub par but thats really not even a problem.\n\nMy only issue from my experience so far is that the npcs fall back after one hit. So combos are hard to come by. And I love throwing combos.\n\nSo maybe in a future patch, these guys can stand their ground a little more early on. Or is that something that comes around with advancement? I havent played too long. But just long enough to really get a whiff of how much fun it can be to just throw down for no reason.\n\nGood stuff.\n\nHelpful | 1", "LoganPowersFeb 7 at 6:33 PM\nFun but...\n\nIt was fun while I played but incredibly short I beat it within 40 minutes.then after you beat it all you can do are the same things you did before. In my opinion I wouldnt recommend it.\n\nHelpful | 3", "Rulan125Jan 1 at 2:37 PM\nVery fun!\n\nThis is a great game that I have had a lot of fun with. It is just a great stress reliever or if you just feel like beating anyone up than this is the game for you. The only thing that I don't like about the game is that there is no multiplayer unless I haven't figured out how to get it to work yet. I know that it has multiplayer on the PC VR version but as far as I know it is not on Quest. If there is multiplayer and I just haven't figured it out yet than please tell me how. If there isn't any multiplayer feature yet than please add it to the game soon it would make it so much better.\n\nHelpful | 0", "BaronP22Mar 16 at 9:13 PM\nBad multiplayer gameplay\n\nIt's very heart to play multiplayer with friends and when you can everything is stopping mid air\n\nHelpful | 0", "mysterio_tnoFeb 27 at 6:19 AM\nPretty good\n\nIts just good\n\nHelpful | 0", "RonaldlolgghMay 22 at 12:09 PM\nNice.\n\nFunny game with wacky physics but it could use some more bars and weapons to use\n\nHelpful | 0", "Awesome1347May 8 at 6:59 PM\nAmazing game a few things to add\n\nThis game is a amazing game but to make it perfect you got to add more npcs. Second you should let more people be in a game at once\nThe rest is fine\n\nHelpful | 0", "RiftyzzzFeb 13 at 5:55 PM\nG\n\nYou should add better graphics,arms and more weapons this game is amazing tho\n\nHelpful | 0", "i_do_MethFeb 19 at 3:35 PM\nAwesome game!\n\nIts just awesome! Worth the money\n\nHelpful | 1", "Barney_2.0Dec 28 at 5:29 AM\nGreat! But...\n\nI think this game is one of the best on the oculus store. The only problem is that, its not multiplayer and its very short. When I first saw this game online it was multiplayer on steam, in pc, and all of the weapons showed up after unlocking them. Whenever I unlocked a new weapon or even after I unlocked all the weapons, some of them still wont show up. Other than that I give it a five star and I would really recommend this app to people who like fighting in VR.\n\nHelpful | 1", "Sun-DeathDec 30 at 7:19 PM\nAbsolut fun, top Vr game\n\nWe have now about 10 games tested and this is best one to have fun and to release your anger. There are 4 level and this is the only negative point. There should be more level to play, but it is okay for 30 minutes to beat all those people. You even can play God mode, yeah.\nI would like to see an update or a sequel of this fun battling game. Lots of fun for everyone. :)\n\nHelpful | 0", "Latn24Feb 2 at 6:54 AM\nThe Most Dumb Fun Ive Had\n\nPros\n- Low Price\n- Large Weapon Variety\n- Every Hit is a Satisfying Blow\n- Multiple Unique Levels With Unique Weapons\n\nCons\n- ???\n\nHelpful | 0", "TheLegendaryCheeseFeb 15 at 8:27 AM\nIt's fun\n\nLove the game and it's wacky physics would love if there was more than just 3 npcs at a time and make the menu easier to navigate and moving around looks choppy would love if it was smoother!\n\nHelpful | 0", "Paine2236Sep 12, 2019 at 5:39 PM\nBrilliant but...\n\nBrilliant fun game yea it's short but turn on endless and have a good long brawl.\nOnly 3-4 people in the bar at once but when defeated some will crawl away and more take their place.\nOut of all VR games this is the only one to give me motion sickness altho it isn't as bad on the quest than it was with the psvr so if you get motion sickness easily on other games you may suffer with this one.\nUpdate for Devs: I play without snap and don't use the walk that much it is only minor nausea it was waaaay worse on the psvr it's more of a heads up for other users with me never really having motion sickness with any other game I figured it may be bad for others.\nOculus does have it down as intense in the comfort range tho in store.\n\nHelpful | 210\nDeveloper ResponseSep 12, 2019 at 4:48 PM\n\nHey Paine2236, Thanks for mentioning the \"3 opponents\" issue. It looks like a lot of people feel the same way so we will be looking at changing it. Are you still using joystick to move and turn on Quest? Try this.... Make a very large playspace, set the guardian at a safe distance and play without snapturn and with walking. Even if your play space isn't big enough, the opponents will come to you. I hope if you stop using snapturn and move with your feet rather than your finger you might not get as sick. Please let me know how it goes.", "Gungrave696Dec 19 at 11:58 PM\nNeeds more!!!!\n\nFun game. First VR game I have ever played. Already broke a lamp in my living room. LOL, got to involved beating people up. I agree with the other reviews, needs more people in the bars. Also Steam has the Halloween version. Please bring this to the quest.\nAlso needs the live radio stations, like on the Rift version\n\nHelpful | 5", "johnathan.scott.566Feb 21 at 5:59 AM\nepic\n\npunch drunk man yes\n\nHelpful | 1", "dulcesandy_282Feb 23 at 3:59 PM\n\nI just need online\n\nHelpful | 0", "N0ME_KINGFeb 29 at 6:04 PM\nKinda insulting\n\nDon't like that you can't start with a female character. Dislike the booing ,\nBesides from that it's a good game.\n\nHelpful | 0", "Capt_Quint620May 2 at 12:25 AM\nYeah it's okay\n\nYou grab stuff, drink, and beat people up. While it is satisfying in it's own way, the replayability of this game lacks greatly. You can only knock out so many mindless patrons before yawning.\n\nNow, to be fair, it is a pretty good showcase game for friends and spectators. You can get amusement from having an audience or letting a newbie play it. It's a lot like the plank experience. Good newbie VR experience, but not much more than that.\n\nSo, I got it on sale, 50% to enjoy it for a few hours and letting it sit there, 50% to let visitors try it. I wouldn't pay full price.\n\nHelpful | 0", "Datboisloth1Feb 17 at 3:54 PM\nWeird\n\nIt is weird and funny but still a awesome game\n\nHelpful | 0", "GamerBoyBrodyBMar 2 at 9:22 PM\nLegit review\n\nGreat game i like that we have to unlock stuff but we need new weapons and multiplayer please do this.\n\nHelpful | 0", "JackKehoe69Mar 7 at 5:43 AM\nOkay\n\nGood game but needs multiplayer to add replay ability , nothing else to say\n\nHelpful | 0", "nearlydank3Jan 21 at 11:17 PM\nOverall good\n\nIt was a really good game that really gave a feel to how fighting is in vr. Maybe give a better variety of bars to fight in and characters.\n\nHelpful | 0", "ZARNIXVRFeb 29 at 10:26 AM\nIts ugly\n\nGuys I love this game but their is no excuse for it to look this awful it gives you a headache to play save yourself 15 bucks and get super hot or job simulator their is no excuse for this mess\n\nHelpful | 1", "Brady618Feb 6 at 4:01 PM\nAwesome Game\n\nCrazy,exciting,intense a great game over all\n\nHelpful | 0", "thiccieFeb 2 at 10:55 AM\nAmazing! But...\n\nI wish you guys would add more bars to fight in. Also, please add online... it would make the game more fun\n\nHelpful | 0", "nickschirmerFeb 17 at 8:48 PM\nLove it\n\nMUST GET\n\nHelpful | 2", "Ashpotato33Feb 7 at 10:43 PM\nAmazing game but could use more weapons\n\nThis game is amazing but I think they should add better weapons and more bars\n\nHelpful | 0", "yeboi22Feb 10 at 9:30 AM\nReal good\n\nAwesome but needs online\n\nHelpful | 0", "OceangamerplayzApr 22 at 10:55 AM\nGreat Game but...\n\nThis is one of the funnest games Ive played so far. But I feel the mechanics of the game can be better. Like the phone and just the floating head and hands.\n\nHelpful | 0", "Ninja_McDanksterJan 13 at 8:18 PM\nGreat\n\nIts a fun game. Just beat up a bunch of people and move on. Thats it. If you like that then great. Of course it could use more npcs and weapons, but overall its worth the money and its fun.\n\nHelpful | 0", "gamerliveFeb 14 at 9:59 AM\nThis game would be more fun if they add\n\nMultiplayer and more people in the bars\n\nHelpful | 0", "Nathan_HartzDec 16 at 5:40 PM\nFun Fighting Game\n\nThe game is quite simple: you grab stuff or use your bare fists to hit people as hard as you can. It's a lot of fun and it's very satisfying, a great way to blow off steam. There isn't a ton of content but it's a pretty cheap game so that doesn't big me. The game has great music, really good sound effects, funny dialog, and decent controls, but it's looks terrible. This doesn't bug me too much but what you see in the screenshots is what it looks like, so if that is a big issue for you then keep that in mind, but it's still a very fun game.\n\nHelpful | 0", "davemcconnell69Mar 15 at 1:23 AM\n\nThe game is faulty. Worked for start then started failing\n\nHelpful | 0", "Richkid001Jan 25 at 7:32 AM\nI love this game\n\nIt helps me you get my anger out and just have fun. Its a great game\n\n\n\nHelpful | 1", "UndertokerDec 25 at 2:57 PM\nFun but could be better\n\nGood fun, but the tracking need slight improvement and Id like to see the drunks pose more of a challenge and do more complex attacks.\nI gave my tv a good clout playing this so be warned that it is easy to throw punches outside the guardian zone\n\nHelpful | 0", "SqueefSep 21, 2019 at 12:06 PM\nPlease fix some of these\n\nThis is pretty fun for a little bit. Needs more reason to keep playing. The rewards I have gotten so far havent made it much better.\n3 people isnt enough. Makes it feel like a demo. The voices dont really match the characters.\nA lot of items are really glitchy in your hands. Also please change the button for grabbing to the grab button and not the trigger.\nI keep getting too close to the door while fighting and I leave the bar accidentally.\nI turned on indestructible weapons but the chairs still break. The chairs break too easily.. most of the time its an accident.\nNeeds challenges and game modes. Survival mode or something when multiplayer comes out. Make them get harder each round.\nReally hoping the multiplayer has it so we can find people online to play with not just people we know.\nA way to turn the music down a little bit would be nice. Also some sounds are really loud like glass clinking sounds and the prosthetic leg is terribly loud.\nI dont think the drunken effect lasts long enough. If I drank a ton of beers I would want to have the effect last a while.\nYou should eventually open up the street allowing you to walk a little bit around the city fighting pedestrians and homeless people, and cops.\nAnother location that would be neat would be a backyard bbq with the in-laws.\nZombies for halloween?\n\n\nReally excited for the future of this game.\n\nHelpful | 130", "paytonandmasonsdadJan 4 at 6:35 PM\nNeeds multiplayer\n\nFun game forreal worth 10$ in my opinion\nNeeds more levels\nBots fighting each other if they bump into each other\nNEEDS MULTIPLAYER\nMore levels\nA chance to fight 12 when they pull up\nMore bots to fight other than three\nMaybe them not be so flimsy on being hit so you can connect good combos\nOverall though fun game to play and to top it off a GREAT cardio workout if you get yourself into it\n\nHelpful | 6", "idontkn0wJan 24 at 3:35 AM\nDecent game\n\nVery good\n\nHope to see updates soon with more weapons\n\n\nLike a mace\n\nYes a mace\n\n\n\nI WANT THE MACE I WAS PROMISED SHEGDJAGBSIAG\n\nHelpful | 0", "monkeynewstedJan 25 at 12:13 PM\nIts great\n\nI would high recommend because it is a great game the holding machanic is weird but its worth it\nHilarious!!!!\n\nHelpful | 1", "DeepMellowFeb 17 at 8:08 PM\nNeeds more content\n\nDoesnt take long to play through. Low replay value. No updates or new content from developers. Repetitive same stuff all the way through. If you play 5 minutes of it youve played the whole game.\n\nHelpful | 2", "PasdorMar 15 at 1:48 PM\nMultiplayer doesnt work at all\n\nThe rest of the games fine but Ive waited for multiplayer for ages\n\nHelpful | 0", "jenisis77Jan 22 at 12:58 PM\nGood but definitely room for improvement\n\nIt is a pretty mindless game but its fun for what it is. The issue is that at least for me, the game is super glitchy. I have issues with the hand movements not responding as well as never growing. Its okay to play, just make sure you have plenty of room.\n\nHelpful | 0", "JuicykangarooNov 10 at 4:36 PM\nStupidly fun!\n\nThis game is fun and hilarious! I hate saying this but punching dudes in the face repeatedly to knock them down is satisfying and fun. I would say that it is light in levels but for 15 bucks you get a good amount! Customization, with fun challenges and characters is great to complete! You can literally beat this game in maybe 1 hour but you can turn on endless and just beat the crap out of people in interesting ways for however long you can survive. Devs, please please please add multiplayer to the quest version! I would go as far to say this would be one of my top played games if it was added!\nIts a lot of fun for an easy price.\n\nHelpful | 16", "88ekh88Jan 11 at 5:21 PM\n\nVery fun game good to get your anger out. Only bad thing is that after a long time it gets a little boring but overall its very good\n\nHelpful | 1", "Microwavable_bananaDec 18 at 3:03 PM\nFREAKING HILARIOUS\n\nThis game is HILARIOUSLY amazing. After you beat a dude up, you can pick them up WWE style, and throw them at other characters. There are plenty of items you can use to fight with. Most will be unlocked as u play but it doesnt take long at all to unlock them. Completely worth the money, if not its worth more money than we pay. As u beat characters up some bigger dudes come in too. I guess you could consider them mini bosses?\n\nHelpful | 0", "Aace-Feb 14 at 11:52 AM\nNice\n\nNice\n\nHelpful | 0", "Jani1988Feb 21 at 12:02 PM\n\nThe game fast became boring. I wish there where more people in the bar, even if they where inactive\n\nHelpful | 0", "paco.ludiexJan 29 at 9:44 PM\nDrunkn bar fight\n\nReally nice Game its soooo much Fun . You can do what you Want you can just have fun\n\nHelpful | 0", "StruckBean72965Feb 1 at 10:02 AM\n\nAmazing fun when god mode enable and indestructible weapons is on\n\nHelpful | 0", "ChickenMasterWalordFeb 6 at 4:21 PM\nPolitical Satire Stress Reliever\n\nNow add an LGBT NPC and youll be banking\n\nHelpful | 1", "XybardJan 7 at 10:33 AM\nLoved it\n\nI love this game the only problem i had was picking up the pool cues but everything else is awesome. I cant wait for the multiplayer update so my wife and i can play together. We both have headsets but we only buy one copy of each game if it doesn't support co op.\n\nupdate 1/7/2020 im chamging my review because i expected multiplaye by or before december and im extremely disappointed in the long wait so my review is changing until multiplayer is addded\n\nHelpful | 1", "Sea_Crust56Dec 30 at 12:21 AM\nFun\n\nIt's pretty fun, but after playing a while it really makes you dizzy. When I took my headset off, I felt like all my reality was fake. It did go away eventually. It's still a fun game.\n\nHelpful | 0", "MsDemeanorDec 29 at 8:38 PM\nBe careful\n\nFun game. All Im gonna say is I punched a drink across my room so be careful and uh fix that one bug that makes it so you cant stop walking when you pick up something next to the bar.\n\nHelpful | 0", "unknown322Mar 17 at 10:33 AM\nOk, but needs more\n\nPicking up items is hard and it is very repetitive.\n\nHelpful | 0", "NitroBoostMar 14 at 10:27 PM\nAwesome game but multiplayer needs work\n\nI love this game and its a great way to have fun and beat the hell out of some fools, but I do have some issues. The multiplayer does not work when trying to play with more than one person. Im pretty certain this is a bug because youre able to play with more people on the rift so it doesnt make sense why you would only be limited to one other person. I seriously hope this is fixed in the future.\n\nHelpful | 0", "Epicness101Jan 19 at 7:34 AM\nLegendary but\n\nEpic game but can you get more rewards like hats gloves new weapon textures and features but good game its awesome\n\nHelpful | 0", "P1K4DUDE888Jan 20 at 12:52 PM\nGreat game\n\nI love the game. It is fun, and you can do a lot of things. I also like how you can throw the sign that say stay out and play the level again\n\nHelpful | 0", "YO_MAJan 13 at 4:22 AM\nNeeds multiplayer\n\nI like the game it's fun but it would be even funner if there was mutiplayer so I can play with my friends\n\nHelpful | 0", "XarrzDec 14 at 7:38 PM\nGood But A Little Broken\n\nPretty good its just that there is a few bugs in the game.Nothing game breaking but still bugs.Also the game feels repetitive after a short amount of time.Other than that,the game is pretty fun and sometimes funny.Theres my opinion.\n\nHelpful | 2", "VLordJan 16 at 10:06 PM\nWas excited about the concept but...\n\nEven a free demo is fun in VR. However, when you pay this much for a game and there is this little to it, it makes you feel that its very easy to get ripped off on this platform. Now I feel I need to be more cautious when considering spending.\n\nHelpful | 1", "FlyNavy37Dec 27 at 9:53 PM\nAll around great stress reliever?\n\nBoss got you mad? Coworkers driving you nuts? Tired of coming home to the same old crap?\n\nThis game is the answer. Just hit people over the head with a beer bottle or shove a pool stick up their nostril.\n\n*Feeling relieved*\n\nHelpful | 0", "vecchione5Jan 14 at 7:02 PM\nFun game but....\n\nAll in all, fun game. however, its waaaaay to short and because of that its not worth $15.\n\nHelpful | 0", "deakin9Jan 12 at 3:06 AM\nExelallant\n\nThe game is perfecto you might need a bigger room though if you want to be realistic or you can change the game settings on your phone in game\n\nHelpful | 0", "M0ckingbirdDec 26 at 2:37 PM\nVery buggy, needs more NPCs, multiplayer\n\nI thought this game was going to have multiplayer before 2020. Why are there less NPCs (less than half of the pc version; games like arizona sunshine can fit over 10 zombies and 4 other actual players online)? The grabbing mechanic is very buggy. For some reason, I can't pick anything up with my right hand at random times, so it only gets fixed if I restart the app. Please add multiplayer and make the game feel more intuitive. Items are hard to grab and break easily. We need to be able to fight against a ton of drunks like at least 8 people on at the same time. Why do we only see our hands on the quest, but the pc version lets you see your whole self like arms and body? That feels more real and immersive than just seeing your floating hands. I hope a future update makes the game feel more polished, at least somewhat closer to the PC version. It's definitely possible just like Pavlov on sidequest (Pavlov lets you see your hands, arms, and body versus just hands on drunkn bar fight), and it's in beta testing.\n\nHelpful | 3", "Projake232Mar 19 at 2:49 PM\nDrunken Bar fight\n\nI think this is a great game an I love the style and the fun of it I just want to say a few glitches I have found that might help in the next update.\n\n\n1. For some reason the 2 player seems to be very glitchy and for some reason it take like 10 min for me and my friends to actually join because it always shows an error\n\n2. I wish you could see there hole body in the 2 player and not just there face and hand\n\n3. And I think this is the most important for some reason when I finish all 4 bars a black screen shows up that tells me to press the menu button to reset it and for some reason this never works\n\nHelpful | 0", "BlackvansJan 11 at 8:27 AM\nAmazing But....\n\nUmm the game is good love it but I wish there was multiplayer so me and my friends can play together thats just a suggestion from me Thank You.\n\nHelpful | 0", "FireBallProBroJan 8 at 7:04 PM\nAmazing Game!!!\n\nLove everything about this game! There are a few problems though. When trying to pick people up they glitch and fly everywhere making it hard to pick them up.\n\nHelpful | 0", "JourneyOnQuestDec 7 at 9:34 AM\n\nThe 4.00 update (multiplayer) broke the game for me. The hand placement is off, you dont even have to drink to get stronger youre literally hulk right when you join. Yeah. Please fix the game!\n\nHelpful | 8\nDeveloper ResponseDec 8 at 4:49 PM\n\nThanks for the review, we will be looking into it to fix and make a new updated version ASAP", "Sxbast1anJan 1 at 10:52 AM\nNeeds more items and locations\n\nOverall amazing game but it needs more weapons and more locations to make the game more interesting\n\nI would definitely recommend a friend to this game\n\nHelpful | 0", "AidenAnimatesMay 16 at 6:13 PM\n\nFun\n\nHelpful | 0", "reeeeeeeechesteretoFeb 17 at 10:51 AM\n\nI wanted to play with my brother but it was not letting people join and I watch people play this game with friends so why does it not work for me\n\nHelpful | 0", "Mr.NarwhalmanMay 19 at 6:42 PM\nqwallity\n\nis gud\n\nHelpful | 0", "jneadakingFeb 22 at 10:38 PM\n\nGame is good and all but need mutiplayer and more npcs\n\nHelpful | 0", "MeatballmachineDec 9 at 6:53 PM\nClassic Vr is here\n\nCongrats to anyone who is just enjoying this for the first time . The Youtube videos of this gameplay have been the stuff of legend for a few years now. Everybody knows the game is a little wonky with the physics and just like Goat Simulator, its part of the humor of this title. I dont have too many complaints here since Ive been playing this mostly on psvr until now. Devs, Im so glad you finally added NPC dialog and thank you for working on the port to Quest. My only gripe here is the placement of the options button. Every time I go to grab stuff or make a fist, that little smartphone pops up. Please if you can, just move it to the Oculus button so it doesnt get in the way. As far as price, I got my 15 bucks worth today alone, just nut shotting guys with the cane and watching them fly up into the air. Throwing a 200 plus pound biker through a plate glass window wasnt too bad either....The most cathartic game I own so far ;)\n\nHelpful | 1", "Aurora.ZaneDec 7 at 12:20 PM\nBest game ever\n\nLove the game...but the multiplayer needs work. First of all the door will make you get out when your not that close to it. Second of all, only hands? We need the full body because it would be so much more fun and easy to know where they are, I'm not saying the whole body, but that would be nice but like only the body and hand's. Third. Where's MartWall?\n\nHelpful | 1\nDeveloper ResponseDec 8 at 4:49 PM\n\nWe want to add fullbody, but CPU restraing a little bit of performance, we are looking into solutions for it ;). MartWall is about to come as well!", "ElGrandeCheeseDec 13 at 10:05 AM\nAwesome\n\nHalarious gameplay, wonderful interactive levels, an overall great game. My only gripe is that only three enemies are on screen at once, but thats probably from limitations of the Quest, but other than that, an overall good game.\n\nHelpful | 1", "megacityNov 29 at 9:22 AM\nReview from both sides of the coin\n\nThis app is great on the VIVE and this Oculus Quest. Few things to notice. The combat is a little easier on Quest. The games too easy with only 3 characters at a time for me. However, the new leveling systems a cool bonus. Still fun as hell and I play all the time, worth buying on each medium. This game is going to shine if you are on the road, or doing a show and tell. Its nice to spread out and kick some A.\n\nHelpful | 1", "crispy2007Jan 31 at 2:13 PM\nBrilliant\n\nWe love it so good.\n\nHelpful | 1", "brianhtxMar 21 at 9:42 AM\nWow\n\nWhen is a update coming.......\n\nHelpful | 1", "MysticalGecko79Jan 2 at 12:09 PM\nSeemed fun...\n\nI bought this due to the wonky looking fighting and the idea of smashing glasses into drunken people in VR! And while it did deliver that, the lack of weight behind all of your punches, the one hit health bar you have, and the intense amount of moving needed to play left me disappointed and sick. I almost puked after playing a few rounds in one sitting. I know the description warns you about intense comfort levels but this was a lot, not only are you swinging all over the place (putting me in a serious sweat and sense of dizziness), but you have to move your character around with the control stick which gives you a sense of vertigo at times. All in all a good laugh with a group of friends, but not worth the price in my opinion.\n\nHelpful | 0", "GAMING_GANGSTAMar 16 at 2:48 PM\nsucks\n\nnot fun at all\n\nHelpful | 0", "NebulaNubNov 29 at 11:02 PM\nIt's fun, but it needs more.\n\nIt's a pretty fun game. For only $15, it's worth not returning it and she get bored after a little bit. Three people just isn't really enough. I would say at least five if it's possible. And some more things to interact with than just glass bottles because it seems like and three is a levels all that is is just glass bottles. And the grabbing should just be the button and not the trigger, although it's not that responsive with the grabbing and I have to try a few times for it to work. So that can be annoying.\n\nHelpful | 0", "wejosh94Jan 7 at 5:22 PM\nMultiplayer please\n\nThis game is amazing and an exercise but multiplayer would make hilarious with my friends so if your working on multiplayer will it be soon?\n\nHelpful | 0", "deadmanzJan 14 at 7:08 PM\nThis game is good but needs more\n\nYou should get this game. Dont do it because I said so but get it so you can be the drunken king/Queen\n\nHelpful | 0", "hudson325Jan 21 at 5:10 PM\n\nAmazing game but the door way is annoying plus there needs to be more levels and maybe a gun it also needs to be online\n\nHelpful | 0", "IcedBlooYetiJan 17 at 8:53 PM\n\nI think that it is very fun i spent over 2 hours on it VERY fun and a must have game\n\nHelpful | 0", "TheCrimsonWallJan 6 at 8:09 AM\n\nMultiplayer would be nice.\n\nHelpful | 2", "THEBOI898989Dec 8 at 1:07 PM\nWhat happened with the hands?\n\nThis new update incorporated a new online feature, which works but could use some improvements, like showing the persons body. But the hands, what happened to their orientation? I dont even feel like theyre my hands, they are just objects. plz fix this devs\n\nHelpful | 2\nDeveloper ResponseDec 8 at 4:50 PM\n\nThanks for the feedback, we will be on it!", "CaLeB_tHe_BiG_bOYJan 30 at 6:53 PM\nhella fun\n\nthis game fun asf\n\nHelpful | 0", "panthemusicalgoatDec 26 at 10:21 AM\n3 opponents makes it feel empty\n\nSo this game is really fun but compared to other versions I've played of it this feels very lonely. Having only 3 people in a bar or wedding party makes it feel like it feel like a empty tech demo instead of a rachous brawl. I'm kind of dissapointed honestly. Wish they could change that and maybe use the adaptive foviated rendering to help if things get bogged down\n\nHelpful | 2", "LilBerkyJan 30 at 8:33 PM\nFun\n\nIt is a fun game\n\nHelpful | 0", "niftyryanyanJan 31 at 8:41 PM\nEpic\n\nJust buy it\n\nHelpful | 0", "christian.blount.714Jan 23 at 2:29 PM\nReally fun\n\nAmazing game, just wish there was multiplayer lol\n\nHelpful | 0", "Basedtribe14Jan 17 at 3:21 PM\nIts fun\n\nI think its great, just needs multiplayer\n\nHelpful | 0", "soumnDec 25 at 5:15 PM\nBar fight sandbox\n\nFor a demo prototype of a bar fight sandbox it is . But if you're expecting a game with any game mechanics such as levels, points system, score, goals, leaderboards, responsive physics, challenge it's a very deceiving.\n\nHelpful | 4", "cbain75Dec 25 at 8:47 AM\nDecent\n\nThis game is a fun game. The fighting mechanics are very fun to play with. Theres a decent amount of different items and places you can fight.\n\nPros- cool items and unlockables, 4 maps, different characters, almost endless fighting\n\n\nCons- graphics are less than half as good as pc, no online (yet), gameplay can get a little boring, only see just your hands, the fighting is way to easy, 3-4 npc at a time when fighting ( come on we know you can do more without dropping frame rate.)\n\n\nThis game is fun, but not really worth its price tag.\n\nI will up a star when online is here.\n\nHelpful | 2", "HelpMe2004Feb 14 at 9:08 PM\nI dont like it\n\nNot good graphics I thought it was gonna be online where ei could fight other people it's not wort 14 dollars\n\nHelpful | 0", "DrMemeManJan 22 at 2:50 AM\nSuper fun\n\nIve only played it once so far but it was super fun\n\nHelpful | 0", "yt_hiddenthreeptDec 18 at 6:35 PM\nWonderful\n\nThis is awesome but I dont like how you have to hold the weapons a certain way and not freely. The performance is great. A little annoying to operate the phone in the game but do able.\n\nHelpful | 0", "CyberDoomerDec 28 at 9:48 AM\nPhysically satisfying, visually awful\n\nThis game is a good chunk of fun and a great experience to share. The physics are good for the most part, enough to be satisfying when you hit someone. There is some collision issues with this game. Some objects break when you touch them before you grab them, detection is flaky, and some objects don't collide with the enemies.\n\nAlthough it's a nice game, it's possibly one of the visually horrendous games I've played on the Quest. It's sightly akin to a unity asset flip, and that doesn't make me feel like I got my money's worth. A distinctive art style can make a world of difference, but this looks like they took a tech demo beta and called it quits.\n\nGet this game on sale if you can, I'd suggest below $8...\n\nHelpful | 0", "BIGLINK742Jan 14 at 7:28 PM\nAwsome\n\nIt is so fun me and my buds play it all the time\n\nHelpful | 0", "forcefulplum909Jan 30 at 3:53 AM\nGood\n\nGood\n\nHelpful | 0", "LargeDogg0Jan 30 at 12:59 PM\nOk this is epic\n\nEPIC\n\nHelpful | 0", "fierce181cartJan 10 at 2:07 PM\n\nLove the game its really fun but if you have the time can you create more places to fight. Thank you\n\nHelpful | 0", "FrenchHornManJan 25 at 8:21 PM\nBest\n\nGreatest game ever\n\nHelpful | 1", "willandben0408Dec 26 at 9:14 PM\nLove it but one thing\n\nI love this game except all of the videos I watched have had a bar full of people but in this one all there is is just 3 people and one person crawls out and another one come in.\n\nHelpful | 0", "braydonrichardsonJan 28 at 8:38 PM\nIts good but...\n\nI think you should update it to how it is on the HTC VIVE, like more npcs, more bars, have arms instead of just hands but overall great game\n\nHelpful | 0", "apfa0355Jan 4 at 3:59 PM\nVery funny\n\nThis is a very funny game but this game needs alot of space to play but I would recommend this\n\nHelpful | 0", "RylanspikerJan 26 at 9:23 AM\nGreat game\n\nGreat game\n\nHelpful | 1", "Patronis1510Jan 14 at 7:27 PM\nAwesome\n\nWho wouldnt love to play as a drunk person who gets to fight people at bars!\n\nHelpful | 0", "jon.skarangerJan 4 at 12:16 PM\nGreat fun\n\nThe character types and the way they fight/stumble and trying to rebalance is hilarious.\n\nHelpful | 0", "PilarXxAliaJan 21 at 7:07 PM\nDrunk\n\nIt is super good and fun and it is cheap\n\nHelpful | 0", "MeditatingKiwiJan 8 at 2:40 PM\nZombie mode?\n\nWhere do I get zombie mode? Or activate it? I know there is a DLC on the steam store but what about here?\n\nHelpful | 0", "TRAVLEYJan 8 at 8:49 AM\nAdd to join friends\n\nI can not play with my friends on this game but the game still good\n\nHelpful | 0", "LeeRyyyJenkinsJan 3 at 9:30 AM\nVery dated\n\nThis feels like an outdated VR demo. None of the objects perform any other effect other than blunt force, even the knives and cigarettes.\n\nThe physics are in need of a big update.\n\nThe graphics are low, even for quest.\n\nThe scenarios are non-existent. Theres no point or strategy.\n\nEven as a demo, its not impressive.\n\nHelpful | 0", "YoDogYTJan 2 at 11:49 AM\nA lot more fun than youd think\n\nThis game surprised me with its simple yet fun and its strangely a stress reliever for me.\n\nHelpful | 0", "ShiposhadowDec 27 at 7:00 PM\nNot bad\n\nCould be much better as things stand right. Still it has a lot of potentialoverall I would suggest it to a friend.\n\nHelpful | 0", "RhysPhDJan 18 at 5:21 AM\nMore Levels Needed\n\nGreat Game also it is good as a as stress relieving experience.\n\nHowever there is a big flaw.\nOnly 4 levels...\nThey need more! I suggest being able to walk around the street.\n\nHelpful | 0", "jokosajokerJan 11 at 12:03 PM\nPretty Darn Good\n\nThis game is great but it needs more weapons\n\nHelpful | 0", "icewing97Jan 19 at 10:21 PM\n\nGood for releasing your rage!!! And fun!\n\nHelpful | 0", "HarryMorpheus97Jan 18 at 11:15 AM\nThe best game ever\n\nThis game is the best game I have ever played\n\nHelpful | 0", "Skyrimgamer655Jan 22 at 11:05 AM\nLove it\n\nLove it love it love it\n\nHelpful | 0", "Young_RanchJan 10 at 12:10 PM\nAmazing\n\nThis game is awesome the replay ability is awesome and the unlockables are awesome\n\nHelpful | 0", "Rodney-Davis-Jr.Mar 18 at 4:00 PM\nFun but feels incomplete\n\nI really enjoy this game, but I feel that it needs more levels. Controls are also a bit clunky, but for the price Id recommend it to anyone looking for a good way to pass time and get some laughs.\n\nHelpful | 0", "PooTLaDDec 26 at 12:35 PM\nAmazing and hilarious\n\nThis game is the greatest $10 Ive ever spent. Every time I come to this game it relieves so much stress. I would totally recommend it to any one new to VR.\n\nHelpful | 0", "xXEY06XxDec 1 at 2:23 AM\nSooo good\n\nJust the experience I needed. I was looking for a game where I could just pretty much endlessly beat people up. Its definitely one of the games that just make you laugh so so hard. If you are not sure whether or not to buy it, make this review guide your decision.\n\nHelpful | 1", "elijah.seth.14Jan 8 at 1:32 PM\n\nIt's a fun game but I dont how to do multiplayer\n\nHelpful | 0", "sergeboowerDec 25 at 9:18 AM\nCurrent favorite version\n\nI originally played this amazing game on the psvr when it came out and loved it. Being able to play a better version is amazing and love it even more!!!\n\nHelpful | 0", "dingoflingDec 28 at 2:53 AM\nGoofy fun\n\nAnd i like it a lot more.on the Oculus Quest than my PS5 Development Kit / PSVR model 1 and 5's 2.\n\nHelpful | 0", "JJbolts3108Dec 25 at 5:27 AM\nGreat\n\nThis game is a pick up and play game I love it but I prefer the old maps but if you are looking for a fun beginning game this would be awesome for you\n\nHelpful | 0", "Vlop7Jan 23 at 2:00 PM\n\nGood\n\nHelpful | 0", "faith.b.brewerJan 9 at 4:21 PM\nGood game but...\n\nI love this game but it needs multiplayer. But besides that its great\n\nHelpful | 0", "kevin.a.yarberNov 24 at 8:38 PM\nYeet\n\nSure you can walk into a bar and play pool but when theres no pool table but there is pool sticks u gotta make due and pretend in other words this is the beat down masterpiece which is so immersive and maybe youll catch an Epstein reference from your typical stereotypes I give it a thumbs up now go ruin a bachelor party or a simple mans drinking night but dont hit the ladies or else be shamed\n\nHelpful | 2", "MadAussieLadDec 30 at 7:12 PM\nNeeds online\n\nMore people including myself would like online a lot and it would be good to play with other people in my prospective.\n\nHelpful | 0", "HesTheHANDYMANDec 22 at 7:04 PM\nVery good\n\nMan one thing I love about this game is that you can literally pick up anything you see and then just start beating people with it, its a very good game\n\nHelpful | 0", "BeyondvortexMar 15 at 12:00 PM\nNoice\n\nThis game is great it's also amazing for letting you anger out.\nBut you guys need to make it easier to join you friends and instead of head and hands make it show you full body to other players\n\nHelpful | 0", "JustzachDec 5 at 5:18 PM\nVery fun\n\nThis game is very fun and good to get your anger out. It does get boring after awhile of playing but its fun to play after you take a break for a day. It is a little dizzying but very fun and simple.\n\nHelpful | 0", "Heapster1200Jan 20 at 6:38 PM\nRgeshd\n\nDxfcgctf\n\nHelpful | 0", "alaskiiaqJan 31 at 10:00 AM\nGood Title\n\nGood Title bit repetitive,should have more levels,other than that its alright\n\nHelpful | 0", "MikeHawkinbalzzJan 3 at 4:23 PM\nKicks major butt\n\nLove the game. Not much to it, but is fun for sure.\n\nHelpful | 0", "nick16727Jan 19 at 7:44 AM\nBest game ever\n\nSo good\n\nHelpful | 0", "xXRicketts23XxDec 9 at 4:40 PM\nBest game on VR\n\nThis game is amazing in every way and a way to have fun in the virtual world. I do wish that it had multiplayer because that would make it a lot more fun but its an all around amazing game\n\nHelpful | 2", "MilezPerHourDec 14 at 8:21 AM\nJust fun\n\nI play three boxing games for fitness and this one is not the best work out but its the most fun. I always finish with 15 minutes of this. Beating idiots can be therapeutic.\n\nHelpful | 1", "epic_spagetti36Dec 25 at 8:27 AM\nIts so good but\n\nIts really good,great fun but I would like if they could add online and more places.There also need to be more people to fight\n\nHelpful | 0", "flashorcash24Dec 28 at 10:09 AM\n\nThis game is super fun to play and kinda funny but it is super disorienting\n\nHelpful | 0", "purplekarrot1Nov 15 at 5:51 PM\nDevelopers please see this\n\nI love this game play it everyday. But please if the developers see this add more phrases for them to say. Im getting sick of the ones that they say. Also add more people please!!! If you hurt someone and they have to crawl out they come back in after like 20 second.\n\nHelpful | 2", "Dmengel40Feb 6 at 5:45 PM\nBe nice if\n\nIf you could play with friends and have more people in the bar it would be amazing.\n\nHelpful | 0", "JaxW2114Dec 6 at 5:42 AM\nIts a great game\n\nThis is a for sure buy for anyone who wants a little realistic action I would just love to know if theres a multiplayer mode on quest because Ive seen it before on other headsets\n\nHelpful | 3", "BeastyLawrence3Jan 18 at 2:39 PM\nNice\n\nNice\n\nHelpful | 0", "rabksajDec 16 at 3:02 AM\nSo short is very disappointing indeed\n\nI was so immersed and impressed with this game the action is Bollywood style really indulging though I had difficulty in throwing the bodies at places I wanted to but the game was all over within an hour. I feel so disappointed indeed. Please add more levels and environments and make it multiplayer.\n\nHelpful | 0", "FunkyfraggleDec 27 at 5:56 AM\nSo funny\n\nThis is great fun, me and my son are loving it so far, really good for when your family and friends are round.\n\nHelpful | 0", "StarkillerDyllJan 7 at 7:23 PM\nSilly game\n\nMy husband and son play this regularly. They love it!\n\nHelpful | 0", "calboi123Jan 8 at 11:15 AM\n\nNeeds more bars or club scene or street party\n\nHelpful | 0", "greybossDec 23 at 2:46 PM\nIt's everlasting fun\n\nNo fighting game is like this this is way better very funny and good for relieving stress in was you don't hurt real people\n\nHelpful | 0", "GameHoppingDec 8 at 2:17 PM\nDec 7 update breaks game\n\nI have played this game every day since I bought it. The update on Dec 7 broke a lot of things and it kind of sucks now. The arms are broken in position and range. You are super powered now, so the fights are boring. You also cannot reopen bars by removing the closed signs. Please fix this and actually test updates before deoying them in the future.\n\nHelpful | 7\nDeveloper ResponseDec 8 at 4:51 PM\n\nThanks for the review man, sorry about your issues. The multiplayer gave us a lot of bugs to fix, and we thought we had test it enough, but it was our mistake, we will be working on update it ASAP!", "rustybaDec 26 at 5:05 PM\nHilarious\n\nGreat game if you want to burn a couple of calories, really enjoyable.\n\nHelpful | 0", "psully4114Dec 11 at 10:28 AM\nIts a good bit of fun\n\nIts fun. Its janky but its real cool. It gets old quickly though. Theres 4 bars theres a good selection of weapons and bar goers but there isn't a lot to keep me coming back but if you have a rough day nothing beats going with a guitar and batting somebody out of a nearby window. The graphics are suprisingly pretty impressive for the Quest.\n\nHelpful | 1", "romanzboy1Jan 6 at 8:33 AM\n\n\nGreat fun\n\nHelpful | 0", "DiGGyP77Jan 6 at 6:52 AM\nSo realistic\n\nIt is amazing, the money you pay is worth it.\n\nHelpful | 0", "kurttissJan 11 at 8:04 PM\nAwesome\n\nFun to raise hell\n\nHelpful | 0", "Sol-VRJan 8 at 10:38 AM\nSo funny\n\nThis game is so funny but short\n\nHelpful | 0", "TraeHdz7vrDec 28 at 11:18 AM\nNo alleyway?\n\nI tried finding a long alleyway or more bars and places and they are not open I have seen youtubers access it and i dont know if it's the game glitching or is it broken but please fix it. If it is supposed to show\n\nHelpful | 0", "moistboi23Dec 17 at 8:53 PM\nGreat way to relieve some pent up stress\n\nWith finals over a game like this is something I really needed to get out all that stress and frustration.its a fun game I enjoy it.wish there were some more bars tbh because it's rather short and that's my main problem otherwise a good game if you just wanna go ham\n\nHelpful | 0", "AmazingtoastyNov 17 at 8:00 AM\n\nIts quite fun. Content can be a little lacking but overall theres still a lot of fun to be had. Picking people up and using them as weapons will never get old to me. Unfortunately it can give you motion sickness if you play it for too long.\n\nHelpful | 1", "F2mrlizardJan 1 at 3:58 PM\n\nGood game but shameful there is no multiplayer to my knowledge\n\nHelpful | 0", "MainstreamTitanJan 6 at 11:01 PM\nDownload this game\n\nWhat are you doing, download it now\n\nHelpful | 0", "JhanzoiDec 12 at 5:29 PM\nBest game ever! Some cons\n\nI know the game will be better soon. I\nkinda like the 3 Npcs because it helps me practice alot. But the only question im asking is when are we getting arms?\n\nHelpful | 0", "gingerbeast77Dec 26 at 11:04 AM\nReally fun but\n\nThis game is really fun but i feel like there should be more levels and more things to do.\n\nHelpful | 0", "jaypidgeDec 26 at 3:08 AM\nLove the game\n\nI love the game but if u could fix some of the bugs and make it so u can knock people out\n\nHelpful | 0", "FlomflomflamingoJan 1 at 1:54 PM\nPLEASE ADD MORE STUFF\n\nI love this game hands down but once you defeat all the bars the game just becomes boring add more bars more stuff to attack them with. Im giving its 3 stars because it gets boring.\n\nHelpful | 0", "dxrkJan 9 at 9:54 AM\nGood\n\n.Good. Good. Good.\n\nHelpful | 0", "sam.foot.771Nov 6 at 10:43 AM\nGood but needs fixed.\n\nDon't get me wrong, this is a very fun game but there are some issues that I think needs fixed to make it a 5 star game. The first issue is that only 3 people show up in a bar at the same time, this really ruins the game because its not a big fight its only a small brawl. The other issue is when you watch people play it the maps are soo much bigger but when you go on the quest version its really small. I hope you can make the game better by taking my review into consideration and I hope I helped giving you my constructive feedback. Thank you.\n\nHelpful | 0", "cujo4844Jan 27 at 10:36 PM\n\nWould probably benefit from a multiplayer\n\nHelpful | 1", "CoolbluefireVRApr 18 at 10:32 PM\nGood game\n\nLove it\n\nHelpful | 0", "Original_NameDec 2 at 12:20 AM\nShort but fun!\n\nIts one of those games you would come back to to blow of some steam, although short it is fun to come back to it. Will look forward for more updates !\n\nHelpful | 1", "MaXiMuS.BrAmWeLl505Jan 23 at 7:04 AM\nPlease allow online\n\nGreat game just need the friends to play it eith\n\nHelpful | 0", "TheFreddyGamerDec 25 at 11:53 PM\nGreat, buuuttt\n\nI think some of the weapons break too easily.\n\nHelpful | 0", "Baden1119Feb 8 at 10:10 AM\nNo Multiplayer\n\nI really need multiplayer for games but it gets repetitive fast also\n\nHelpful | 0", "jake12345678Dec 24 at 10:54 PM\nVery fun\n\nThe game is a time passer started at 12AM and now its 2AM and I just stopped playing\n\nHelpful | 0", "UDontHaveMyNameMar 14 at 9:28 PM\nFun concept\n\nIf youre new to VR, this is a 3 or 4 star game. If youre a seasoned VR veteran, this is a 2 or 3 star game.\n\nThe concept is fun to me, but as a VR Veteran a lot of it feels dated. Some of the visuals, very large hands, etc.\n\nI wish you could play with more than 2 people at once, but Im guessing to do so dev wise is harder than it seems (physics etc etc). Additionally, we all know the Quest can handle more than 3 NPCs at a time on screen and not have frame drops, so Im not sure why it was downgraded so much.\n\nFun concept, a little outdated and restricted. Wont have high replay value unless people to use it as a 2-way chat room with some silly fun involved.\n\nHelpful | 0", "steveob83Apr 30 at 7:24 PM\nSounded fun but boring\n\nThis game is super repetitive and can be finished in 15 mins. Maybe okay for a demo but it is not finished.\n\nHelpful | 0", "azadagreatApr 8 at 5:04 PM\nAzadagreat\n\nThis game is fun and it takes out your angers\n\nHelpful | 0", "DrSamikNov 24 at 10:30 PM\nWow Just Wow\n\nThis game is awesome. There are 4 different areas to fight and tons of characters to unlock. You can customize your characters with tattoos,bracelets, and rings. Although your enemys curse at you, the game is still amazing!!!!!\n\nHelpful | 0", "SleepJuiceDec 6 at 7:44 PM\nParty Game\n\nIt's fun enough to play every now and then but it's definitely more of party game. Gets boring playing it by yourself after a while.\n\nHelpful | 0", "glenn.parry.10Dec 26 at 9:01 AM\n\nSo funny I love how the game makes you superhuman highly recommend!\n\nHelpful | 0", "usslessblacksmith12Mar 29 at 5:08 AM\nGreat game\n\nVery good for stress and anger but just be careful of other people in the room while playing\n\nHelpful | 0", "torin.douglas_Dec 25 at 9:21 AM\nAbsolutely brilliant\n\nIts just amazing honestly some of the most fun Ive had in a while\n\nHelpful | 0", "C0R0CAJan 18 at 9:10 AM\nShould have multiplayer\n\nI think its a good game but i think the multiplayer mode should be on the quest\n\nHelpful | 0", "CaptainFroglegsJan 2 at 10:18 PM\nLOL\n\nL\nO\nL\n\nThis game is hilarious\n\nHelpful | 0", "M0useT00thSep 12, 2019 at 4:20 PM\nGreat fun, and will be better soon!!\n\nHonestly I've been waiting for this game/experience on the quest.. just sucks there's no multiplayer, its annoying that there's only 3 NPCs at a time per bar.. the whole point of this game to me was creating your own imagination/story with these NPCs with others to get a good laugh going with friends at a party or playing online with.. I hope in the future there's a update to add a lot more NPCs and multiplayer.. that would be great then id definitely give 5 stars if done so.\n\n\nUpdate : Thank you Dev's for the news update, now I'm definitely hyped up for this. Just curious Any chance when this update could happen?\n\nHelpful | 25\nDeveloper ResponseSep 12, 2019 at 3:57 PM\n\nThanks for playing Alexflo07 You will be happy to hear that multiplayer is on the way and will be included in the next update along with our new level \"Black Friday\" at Martwall. You aren't the only one asking for more opponents, we are in the process of considering adding more or creating a separate mode with a lot.", "JukleFunkleDec 21 at 1:37 PM\nIt's Good Tbh\n\nI think the graphics are good i guess for quest\n\nHelpful | 0", "will.jarrett.798Dec 12 at 12:56 PM\nCrazy\n\nThis game is amazing!! I love it so much the only thing is I think you should be abled to have an ally or a way to spawn tools\n\nHelpful | 0", "killcumber09Apr 3 at 4:26 AM\nIts aight\n\nIts not bad, but the graphics are underwhelming and kinda boring. It works for its point but lines are overused and more of a game that youll stop playing after 1 hour game time.\n\nHelpful | 0", "Jayydenthe5684Mar 15 at 4:01 PM\nAwesome!\n\nHi! This game in my opinion is very fun. I like the way it behaves. The whole concept and game is just fun itself\n\nHelpful | 0", "IbrufenNov 7 at 2:59 AM\nNeeds multiplayer\n\nIts a great game to just let some steam go. Had a bad day at work? Vent out on those npcs and watch the hilarious fysics do their work. If there would be more then 3 npcs at the time and most importantly multiplayer this would easily get a 5 star rating.\n\nHelpful | 0", "Hexenv88Oct 14 at 1:49 PM\nKick some A$$\n\nGot pent up anger. Traffic, work, school put you in a bad mood. Head to the bar and open a can of whoop a$$. I love this this game. It's simple, primal and there is only one objective. Be warned tho. It requires alot of space to get into it. Clear your play area and make sure there is no furniture or stuff close to your grid. I have hit the desync and wall a few times getting close to the boundaries.\n\nHelpful | 12", "Phuque2Jan 27 at 10:10 PM\nToo simple\n\nThe game is way to easy, needs more NPCs n quest mode or something\n\nHelpful | 0", "therobro88Mar 14 at 1:05 PM\nAmazing game\n\nIts a nice way to relieve frustration also with all the weapons and places you can go you can have hours of countless fun. Five out of five. \n\n\nHelpful | 0", "LahRiNov 22 at 9:07 AM\nGood time with the fellas!\n\nMy quest is pretty much my work friends only source of fun on our breaks and this game just makes them laugh. Definitely made them want to invest in VR. Hopefully a multiplayer might be available later!\n\nHelpful | 2", "magorafaelDec 22 at 8:00 AM\n\nPlanease I wish buy bone works what can I do\n\nHelpful | 2", "N8willgetUDec 4 at 12:28 PM\n\nGreat game to blow off steam, super fun and hilarious, hoping they'll drop multiplayer for it for the Oculus quest, but still a great game as single player\n\nHelpful | 0", "Beast_Rider77Jan 7 at 4:57 PM\nStarts to get boring\n\nIt's all pretty much the same thing, and only single player. Would be 5 stars if you could play with your friends\n\nHelpful | 0", "Lazer241Jan 18 at 4:01 PM\nTerrible\n\nFirst of all the graphics are completely trash! The gameplay barely works and for five dollars more path of the warrior is so much better.\n\nHelpful | 0", "Supercooper28Nov 13 at 1:43 PM\nClosest we have to Gorn\n\nThis game is fantastic, everything interaction feels so real, and it is easy to loose yourself in gameplay, while it is limited in gameplay and features it still can keep you busy\n\nHelpful | 2", "inkmealDec 3 at 2:49 PM\nBetter than punching a pillow\n\nI played the early version of this back on the Rift. Im happy to say its come a long way. Really fun and feels amazing. Wish I had bought it sooner.\n\nHelpful | 0", "meltreyes17526Dec 9 at 5:19 PM\nLove The Use Of Improvised Weapons\n\nThe different variety of whats available\nuses your imagination in how to apply them in an emergency situation.\n\nHelpful | 1", "sue.bradleyOct 30 at 10:40 AM\nOST\n\nI love the game, always a great thing to play while bored, and all the weapons you can use to pummel your opponents (the defibrillator is one of my favs) but I was wondering where the OST is; I have looked all over and I cant find it, the reason I desire this so much is because, well, the soundtrack is amazing.\n\nHelpful | 2", "skrillabruh69Jan 1 at 10:49 AM\nEpic\n\nFunny\n\nHelpful | 0", "SalvadoortheboiiDec 26 at 7:57 AM\nDefinitely a good buy\n\nSuper fun!\nTotally worth the price\n\nHelpful | 0", "iluvcats123Jan 15 at 4:54 PM\n\nGames fun for about 5 mins.\n\nHelpful | 3", "andru2004Dec 31 at 2:58 PM\nBest game\n\nThe best\n\nHelpful | 0", "BigDaddyRob1967Dec 1 at 6:00 AM\nBoring.....\n\nThis is the most boring app Ive bought from Oculus. It has no real function other than going around picking fights with poorly animated characters. Chairs fall apart when trying to pick them up and opponents are dumb and lethargic with no real thinking needed to play this app. Very disappointed but what did I expect? Its name says it all.\n\nHelpful | 5", "LipglossArsonistOct 24 at 9:23 PM\nA workout thatll hold your interest!\n\nWas looking for an active game as a new Quest user and got bored with dance routines, so saw this and lold. And sure enough an hour goes by while laughing at the cheesy dialogue (the 3 million dollar hip-hop record cracked me up). Also a good stress reliever on par with GTA in that youd never trash four bars in a night IRL (two, maybe... j/k). And there are also goals where the more bars you clear over time you can upgrade your avatar, which Im working towards so I can change to the female character for extra fierceness lol. Yeah, the graphics arent super refined, but its fast-paced so didnt really bother me too much.\n\nHelpful | 1", "TehRealDogeDec 14 at 9:34 AM\nBruh moment\n\nBought it and didnt stop playing it.\nOnly wish their were a few more npc's at each bar.\n\nHelpful | 0", "ANGERSNIPERDec 29 at 11:39 AM\nA violent game for kids\n\nFun for about 10 minutes. Move around, turn, punch. Repeat.\nDestructable items reappear. Awful music which can't be turned off.\nEasy refund.\n\nHelpful | 0", "Itz_SpringyFeb 1 at 11:13 AM\nNo\n\nMultiplayer:(\n\nHelpful | 0", "mckenzie.watson.3954Dec 28 at 11:01 AM\nReally good\n\nFighting is fun\n\nHelpful | 0", "4TonHammerOct 24 at 7:03 AM\nGreat, could be amazing.\n\nThe game is hilarious and actually really sucks u into its world. Before I realized I had spent an hour beating people up. The game just absorbs u. The only issues I have, the game doesn't have a very good grab mechanic. It's difficult to pick things up. Maybe it's my inexperience but u find it very difficult to pick up items. Or especially pick up my body. As for more enemies I don't know about that, the game is fairly challenging. Some slight annoyances where it u get too close to the bar door u will get booted right out of the current fight. Which sucks because after beating the hell out of everyone for ten minutes and about to win u just insta lose. I wish there was more stats and more objects to hit people with. It would be far funnier if there was a body stack as well, instead everyone just crawls out. Now all those minor suggestions to devs / criticisms doesn't mean this isn't fantastic. Funny funny funny and surprisingly a bit of a workout. Graphics are much better then what u see posted on YouTube as well. The quest is crisp clear, it looks sharp and the framerate is fabulous. Get your sea legs though because if u have a big enough room to play in u can actually really get dancing around swinging and fighting for your life. Roadhouse!\n\nHelpful | 0", "juicyjuice141Dec 28 at 4:58 PM\n\nAmazing game\n\nHelpful | 0", "expectedchief7Nov 23 at 11:09 AM\nI love it\n\nI love this game I play it all the time. It is worth the money although it can ether hurt your head or hurt your eyes after playing for a while. Otherwise I love the game its so fun\n\nHelpful | 0", "natedogboiDec 17 at 5:50 PM\nGreat game\n\nI'm am waiting for new updates because this is the best game\n\nHelpful | 0", "OG252Dec 13 at 2:33 PM\nAwesome game\n\nWhen are we getting multiplayer\n\nHelpful | 1", "Desyarzaha5669Dec 23 at 11:23 PM\nThis is such a good game!\n\nI really enjoy this game :)\n\nHelpful | 0", "hyperhexjoeSep 13, 2019 at 5:01 AM\nVery shallow but fun\n\nThis games great if you can get over the low quality graphics. As far as I know, this version has a little less content than the PC version but its still the same jist. Only three NPCs can be in a bar at once, but I dont mind because the areas are pretty small. I just wish one of them was the bartender. Another thing they do is say certain line that gets pretty annoying, but that just makes you wanna punch them more. The audio quality between the NPCs varies, and they are obviously some kind of Unity assets or something. At least that means you get to fight the Mafia City boss guy! Most reviews seem to fail to mention that you get cosmetics for completing rounds of a bar fight if you arent on endless, which is at least some kind of incentive. Also you can stop time when you use your phone, which can be fun. Overall, the game is pretty fun if you go in without the ridiculous expectations of an Oculus funded game. Multiplayer will also be very fun if that ever comes to Quest.\n\nHelpful | 6", "OneLonelyBoiDec 26 at 3:44 PM\n\nAmazing!\n\nHelpful | 0", "Kain-monkDec 25 at 1:52 AM\nAwesomely enjoyable\n\nGreat fun\n\nHelpful | 0", "A_bot_Mar 13 at 4:57 PM\nVery nice\n\nGreat, its almost perfect it is a great stress reliever. I love it.\n\nHelpful | 0", "ManMythLegend303Nov 12 at 11:40 PM\nFun But...\n\nThis game fills all my rock em sock em needs although I do wish there was more to explore and maybe some more reward for all the swinging I put in but all around a good game to play.\n\nHelpful | 0", "nathan.muklewiczDec 24 at 11:09 AM\n\nGreat game\n\nHelpful | 0", "niceguy469Dec 25 at 2:30 PM\nNice\n\nNice\n\nHelpful | 0", "E.GaxnaOct 29 at 8:15 PM\nPretty Good\n\nEverything is very amazing about it, expect how you turn your head; when Im playing stationary I wish I can use the other joystick to turn my head. When Im playing while standing it is perfect, but stationary mode needs some work.\n\nHelpful | 1", "cforcalvinOct 15 at 8:07 PM\nAlmost perfect!\n\nThis is hilariously satisfying, but just one small thing would make this even more satisfying: that the people stay down instead of crawling away. Not asking for gore or death (although those options would be a nice bonus)- if they would only stay down that would be the cherry on top of a fantastic experience...\n\nIll still give it 5 stars- great job in the right direction!\n\nHelpful | 5", "Son-of-a-GunOct 17 at 6:25 AM\nYou can actually break your stuff\n\nWow, what a fun immersive game, but be very careful and create a tighter guardian than you normally would. I was beating down the biker dude and punched my plasma TV and smashed it, this was within the first 30 minutes of play.....not sure if a $15 game is worth me buying a TV Everytime I get carried away in this game. I may have to return it \n\nHelpful | 0", "lowlandpandaOct 17 at 4:49 PM\nThis is great, cant wait for the update\n\nIve seen a lot of people complain about the NPC account and multiplayer but once i saw that you guys were adding more NPCS and multiplayer I bought and its still super fun with 3 NPCs\nAnd with a little more optimizations Im sure it will be great good job guys\n\n(Will rate 5 stars when you update)\n\nHelpful | 0", "DarkHeart101Oct 18 at 10:32 PM\nBest Fighting Game On Quest!\n\nIve heard that the game will get multiplayer but I dont want to get my hopes to high I just want proof but anyways. This is a really good stress relief game and I have anger issues but once I play this game Im able to control myself after Im done. DBF is about 30-40 minutes worth of gameplay which I have no problem with. You find random Objects To fight People in 4 levels. If your looking for something To do then try to find all moves. So developers HMU if you info on the multiplayer. Great game!\n\nHelpful | 3", "Jeffsk1Jan 5 at 12:18 PM\nVery Watered Down\n\nI already own the PC version of this game. It's a lot of fun, and everyone who tries it really enjoys it. I understand that the graphics and NPC count needed to be downgraded for the Quest. However, the game just feels like complete garbage. The worst part about it is probably picking stuff up. It's just off. Maybe I went in with higher expectations than I should have, but this is the worst PC to Quest port I have tried so far.\n\nHelpful | 0", "sukiaceOct 9 at 2:30 PM\nAmazing and can make better easly\n\nSo this game is really good one of my favorite on vr but its not up to date with normal version of the game. Witch I don't mind too much I just got to be patient and wait for updates. Witch will come in time but. Some of the other things that make it kinda annoying at times is the controls. Yes there easy to learn but when you want to pick someone up and they faze with ground and disappear because your hand was in them can get annoying fast! Or when you try to pick something up and it brakes in your hand. But other then all of that it's a amazing buy!!\n\nHelpful | 3", "Nour2007Oct 21 at 8:29 PM\nWhere is the multiplayer?\n\nI spent around 30 minutes trying to look for multiplayer And I couldnt find it anywhere the reason why I bought this game in the first place so I can play with my friends. Please make the multiplayer more visible if there is any. But overall the game is good.\n\nHelpful | 0", "VainNickel154Mar 13 at 3:44 PM\nTo broken\n\nThe pipe in the alleyway is op, it never brakes, and sends them flying, amazing\n\nHelpful | 0", "Dr.evilmanOct 13 at 10:30 PM\nIt's actually really fun\n\nThis game is a work In progress so alot room for improvement and this could be a aaa tittle I would like to have a chat with the developers of this game and be on the helping end since I enjoyed it so much, let's be honest most of you clicked on this and the reading the reviews because you're on the fence about getting the game yeah there are some people taking crap about this game but it seriously it's a lot of fun. The political side of things could be more equally balanced so it's does not seems like your some angry baby bloomer, also they could use a little comedic scripting.\n\nSo to the developers good job but still needs a lot of things like , more bars different people, new modes like they where npc pick up weapons and can fight each other, also upto 15 npc on screen at once, also a full on biker bar full of bikers,a another sports bar, a wild west saloon, a kkk meeting and Nazi beat down mode,\nAlso a story mode would be cool, eg your out on a night with your girl and you get harassed in the bar, or your in drinking in the saloon in a fight breaks out, your sports team just won but your at the wrong bar and so on.\nneeds a 4 player online muiltplayer co-op and versus\nCo-op mode you and another player or 3 gang up on a bar and have to fight your way out no man left behind type thing, more music I will be happy to give you some tracks I've made so you don't have to do all that royalty stuff, some more improvement on some physics and environmental reactions, also have people or people cut outs looking in and cheering or booing please do not give up on this game update and release DLC like characters and special weapon people can pay for but leave all the stuff free and I swear to you that this will be a cult classic, after recoding a few play throughs live people kept asking about this game ...\n\nHelpful | 0", "HedonXDec 7 at 5:19 AM\nGood but things I dont like\n\nI like the game so much its very fun its like when you want to play quest but you dont know what you want to play in that time the game really show its self but the things I dont like is theres no online and you cant see your full hand thats it i hope the developers dont stop supporting the game )\n\nHelpful | 2", "dommommaNov 27 at 10:11 AM\nSuper duper fun\n\nEverytime you logon, you dont realize youll be playing for 2 hours hitting people with guitars and bats\n\nHelpful | 0", "jgb44Oct 15 at 4:23 PM\nEntertaining, lots of potential!\n\nIt's a really short game, although that seems to be the unfortunate case with a lot of the current Oculus experiences. I can definitely see how motion sickness might be an issue, as well.\n\nThat being said, I still gave it five stars. It's got some replay factor and it's a LOT of fun. The game gives you a lot of room to be creative. If they add more venues over time, this will keep its five star rating.\n\nHelpful | 2", "alialhaddad_uaeNov 17 at 5:27 AM\nSo much fun\n\nI just love how many creative things you can do in the game, unlike other games this game makes me wanna keep on playing and I just cant get bored of it\n\nHelpful | 0", "TKA_lil_dudeNov 27 at 9:43 PM\nGreat but\n\nIt is great but if you go near a door, it immediately kicks you out\n\nHelpful | 0", "HalfFateOct 6 at 11:12 AM\nGoat Simulator physics and humor\n\nI got his game because I saw other people play a lot of it on PC or PSVR and it looks absolutely awesome. I was aware of the limitations of he quest when I bought it so I wasnt disappointed. Yea, 3 people in one room seems a little underwhelming but I only really fight them one at a time anyways butttt...the more the merrier ;) The stereotypes are absolutely perfect and the physics make me laugh but I would like it a little more if there was more to do. Like another zone to fight, more people or unlockables or modes. Still play it for kicks and giggles today so thank you so much for porting this to quest!!!\n\nHelpful | 6", "f1aming069Dec 15 at 9:58 AM\nEpic\n\nGood game\n\nHelpful | 0", "Rexoy_Sep 17, 2019 at 10:57 AM\nPlayed this for 4 hours straight\n\nIts the best vr game Ive spent my money on and the only down side is that you have only 3 people in the stages , still cool but thats the only down side. If there is a release date for the more npcs update please tell us also add barfing and online multiplayer and more cosmetics and more item unlocks \n\nHelpful | 4", "luke_dankusNov 10 at 10:29 AM\nNot challenging enough\n\nFun at first until it gets way too easy. I would recommend having a points indicator and letting drinks affect you more. For example the more drunk you are the more points you get. I also think the NPCs should try to hit you more often so you aren't safe just by walking away or throwing something at them\n\nHelpful | 0", "Dragnmasta71Oct 4 at 4:43 AM\nDecent Game\n\nI first played this game at a VR store with connected headset so when it became available on Quest I wanted to try it again. Fun but gets tiring after a while. The character scenes should change beyond the 3 allowed but I'm sure future updates will provided. Overall it's enjoyable and good stress reliever when you wanna knock someone out but can't do why not VR! Lol IJS.\n\nHelpful | 1", "Zef_GedeOct 2 at 4:29 PM\nFun but flawed, good for intro to VR.\n\nI own this game on the PSVR and I liked it better a year ago when I bought it on the psvr than I do on the quest. So many things have changed where there's only three enemies at a time. They do not seem to pose any challenge whatsoever. unfortunately the mechanics of the game tend to clash when you swing a weapon or pick a weapon up and feels awkward and clunky on the quest. I see a lot of potential and room for improvement. No doubt this will get much better over time but at this time I think I'll ask for a refund.\n\nHelpful | 4", "YGEEZNov 17 at 3:31 PM\nFun!\n\nPlease add more levels and weapons! Other than that, great job! My son loves it\n\nHelpful | 1", "Jayo2xDec 29 at 9:50 PM\nEhhh\n\nIt's cool just to show friends that's new to vr. But it's kinda wack after while\n\nHelpful | 0", "spicytunapizzaNov 26 at 7:06 PM\nVariety\n\nNeeds more levels! Love this game\n\nHelpful | 0", "powney1991Sep 13, 2019 at 8:28 AM\nBrilliant & hilarious experience!\n\nFor anybody whos writing bad reviews about this game you first of all have to take a step back and realise that this game is NOT supposed to be long and it isnt supposed to have a ton of depth to it! Its a simple and hilarious old fashioned beat em up in bar locations which is hilarious and downright FUN! Played this game for over an hour last night and absolutely loved it! Especially picking people up and chucking them through windows or over a balcony!  Great game and highly recommended!\n\nHelpful | 14", "SpaghettiBoyNov 6 at 4:17 AM\nFingers\n\nI am in love with this game but the only problem is sometimes the hand glitches out and you cant use that hand at times\n\nHelpful | 1", "auntbenDec 30 at 10:07 AM\nNot great\n\nThis game doesnt really fill any holes that other games are doing a better job filling. Doing movement with the joysticks is disorienting and grabbing items in the bar is awkward. I may poke at this a few more times but I regret adding it to my library.\n\nHelpful | 0", "Aydin_95Oct 28 at 3:24 AM\nGreat fun but could be improved\n\nDrunkn bar fight is great and a good way to release stress.But I've noticed it's not the same as pcvr and I understand but I'm sure it doesn't take an video arts 1080\n\nHelpful | 0", "ToastedButterOct 15 at 10:43 AM\nPower\n\nI love the game it is really fun but I want more enemies to spawn and maybe better graphics and multiplayer to the game like the pc be version because it the regular rift Can run it with better graphics so can the quest so ya thank yall for the great game\n\nHelpful | 1", "jelane.johnsonOct 17 at 8:11 AM\nGreat Stress Outlet\n\nI play a few rounds every night and it makes me giggle every time. So wrong, yet so right. To the devs: thanks for making a game that gives me exercise, makes me laugh, and takes my stress away. I'm looking forward to future updates!\n\nHelpful | 2", "refridgerator310Nov 30 at 10:59 AM\nno\n\nits not loading help\n\nHelpful | 1", "popinwaffNov 9 at 7:06 AM\nGood game\n\nI was playing and I am 13 so I want to refund it because my parents are mad at me for buying it. Can any one tell me how to refund it\n\nHelpful | 2", "JackHopkinzOct 1 at 8:00 AM\nGood Game\n\nThis game is really fun to play, but I think that sometimes the fighting is too easy. I think that there should be an easy mode, normal mode, and hard mode sorta thing. And maybe a storyline to the game. And lastly, a few more levels. No matter what happens with this game, I still love it.\n\nHelpful | 0", "hentaiisgood4uOct 28 at 7:51 PM\nBEST GAME EVER\n\nSo this is by far the best game I have ever played no bad things Ive noticed. I have played this game for a total of 18 hours and I have only had it 2 days. I definitely suggest this game.\n\nHelpful | 0", "calvin.susJan 1 at 1:16 PM\nGoo going gong gong\n\nIts fun but there should be a multiplayer\n\nHelpful | 1", "GiarlyOct 1 at 11:59 AM\nJust...wow this game!!!\n\nThis game is the best game i have ever played i rate five because it is funny and easy to play.\nFirst off, when you hit the caracters they say funny things like EWWWW YOUR HANDS ARE SWEATY!!!\nSecond of all, it is easy to play, just dont get hit, and if you do get hit just pick yourself up again.\nIf you still are having trouble with dying then just turn on god mode.\nI see people complaining about motion sickness, but me personally have never had an issue with that.\nIf you like fighting games you should most definetly play this game, and on top of that it is a funny game...it is the perfect combinasion.\nJust...wow this game!\n\nHelpful | 2", "Dittoman17Dec 4 at 1:22 PM\nFeels sloppy\n\nThe gameplay and overall feel of the just seems sluggish. But if the devs ever add co op to this mode it would make up for it :)\n\nHelpful | 0", "Cball11Nov 14 at 11:40 AM\nIts a must have.\n\nGotta play this game, gameplay is limited down to 4 different locations but I dont see why they wouldnt add more.\n\nHelpful | 0", "magic_missile_Jan 8 at 9:22 PM\nStupid\n\nThis game is not fun and a waste of time, 0/10\n\nHelpful | 1", "Ender772Nov 17 at 8:11 PM\nReally guys?\n\nI was playing that new boxing game when I realized I wanted to beat people up, not just fight them. I thought this game would satisfy my craving. Sadly it did not. This game has no aspect of fighting in it. Your just too strong. You cannot even walk by people without knocking them down. Way too easy way too simple. I had fun for about 30 seconds before it got old and Im 32.\n\nHelpful | 0", "That_boi_dougSep 23, 2019 at 5:27 PM\nBuggy and needs to be polished more\n\nThis game is very buggy and my hits keep going through the characters. But that really only happens when Im using a weapon. Im being nice with a 4 star because this game can give you a real work out and make your swings faster when your in a real fight. Its like a creed spin off but more goofy and wacky. Its fun to pick up people and swing them around or slide them acroos the bar table. Sucks theres barely any variety and theres only 3 people. At least 5 or 6 because 3 can go by so quick. Overall fun game but if multiplayer were to be added it would be a 5 star.\n\n\n\n\nPs: better be more than 3 AI in multiplayer\n\nHelpful | 2", "freezingphoenix2007Sep 15, 2019 at 11:54 AM\nGood but\n\nThis game is sick but I really want more npcs and a multiplayer then its a five star game also something that bothers me a little is your guy doesnt have full arms and the graphics are a bit bad and I want to know when the next update is other than that it be good\n\nHelpful | 10", "Mr.TrashManDec 26 at 1:49 AM\n\nADD MULTIPLAYER\n\nHelpful | 0", "DrFathomOct 1 at 10:32 AM\nHilarious fun!\n\nThis game is far-and-away my favorite purchase for my Oculus Quest so far. It's my favorite game to show to my friends, and the ONLY complaint I have with it is that when I'm casting in-game view to my phone, so myself and others can see the fun, it's laggy on my phone screen (Galaxy Note 8).\nBuy this game and have a blast, but be sure to set the Guardian Wall System safely away from the real walls around you, or you can get scraped knuckles, like I did initially, lol!\n\nEDIT: Can anyone tell me how to give \"the finger\" to opponents?\n\nHelpful | 2", "jay.hassan.90Nov 17 at 5:24 AM\nPlease make it online\n\nThe game is good but it gets boring after a while I feel like if it had an online version it will be more fun and not get boring quick cause u can play with ur friends and random people that u dont even know\n\nHelpful | 6", "MrCloudFaceHMMNov 4 at 1:55 PM\nAmazing workout\n\nI recently got this game and it's a good workout. There are some bugs and few enemies but overall, it's a good game to have in your library.\n\nHelpful | 0", "KillerCandy336Nov 5 at 6:42 PM\nKinda good kinda bad\n\nThe levels need to be longer or have more people\nIt was really fun tell I knew there was an end\n\nHelpful | 0", "The69thCrusaderOct 31 at 7:00 PM\n\nGreat. Even my mom plays it. You can use many types of fighting. Only punching, using weapons, throwables, and power ups. You can have a lot of fun with this\n\nHelpful | 0", "SuperBros360Nov 26 at 1:26 PM\nI love being drunk!\n\nCant stop playing it\n\nHelpful | 0", "friendlygiantNov 6 at 8:28 PM\n\nThis game is super awesome and fun I would totally recommend this to anyone that has a headset over all this game is a blast\n\nHelpful | 0", "DamnZuckSep 22, 2019 at 7:39 PM\nAn Amazing Quest Game!\n\nWelp, where do I start. This game is amazing (I already said that)! It has the fun physics of Goat Simulator, and the gameplay of a fighting game! The bars are all unique, but there are not many in the game. The amount of people to fight at once is only three, I wish there was a way to change it. Other than that, it's a great game! One request, could be have a way to make our own bars? That would fix the the fact that there are not many bars and would be amazing!\n\nHelpful | 1", "jacemcdermottSep 28, 2019 at 11:51 PM\nAmazing game but.....\n\nI only have two problems, and one is that sometimes when Im in a level One of my hands will freeze so I cant use it until I exit the level? The second one which isnt really a problem but more of a request is that you should make the radios and stuff have more music, maybe later make it so we can add our own\n\nHelpful | 1", "doomedrabbitNov 25 at 12:24 PM\nYes\n\nThis game is yes\n\nHelpful | 0", "ShadowMannSep 21, 2019 at 9:26 PM\nStripped down for Quest, but still fun\n\nI have both an Oculus Rift S and a Quest. The idea was to go portable with the apps I love on the Rift S and this is my most played game. It's cool, silly and loads of fun to play. On the Rift S, the bar is full of people, and there are baseball bats to fight with, lots more bottles to smash (and drink), fire extinguishers you can fight with, and the fighting is more intense. For the Quest, there are only three people in the bar at any given time, and the characters familiar in the Rift S version are in the Quest version, but the Quest version has a couple of different characters not in the Rift S version. It isn't as realistic as the PCVR version. People don't just come running into a bar to fight you who have never interacted with you.\n\nOverall, it is well worth the $14+ they want for the game if you own a Quest. If you have played this game on a tethered PCVR, you will notice that it is stripped down. Still giving it 4 stars. Too much compromise, but this is not the Dev's fault.\n\nHelpful | 0", "KingFetus87Nov 3 at 5:14 PM\nAmazing\n\nAmazing just wish more than 3 people could be in at a time and I do get a bit of motion sickness but still a great game\n\nHelpful | 0", "starfall88Oct 9 at 3:07 AM\nIts good\n\nIts a good game except their is a scary glitch, if your punching to hard and you hit one of the characters in the right bar there mouth will break and its horrifying it looks like a giant monster duck\n\nHelpful | 0", "justink9088Oct 24 at 6:56 PM\nShort lived fun\n\nI wanted to love this game.\n\nA few things just throw me off.\nHand placement on items are all snap to.\nPick up a mic and stand and your gripping right below the mic with the long stand facing down toward your feet. It makes no sense to me why you shouldnt be able to rotate the grip or just grab another area and hold it like a bat or such.\n\nOpponents can be thrown or hit outside the bar but dont just leave. They walk back (or crawl back I cant remember) into the bar only to leave again.\n\nIts very monotonous damage wise. For a game all about fighting. Its bland. Hit a leg with a metal rod and its the same as hitting someone in the head. You can imagine a hp bar just going down for the whole character.\n\nUnless you have cash you dont mind throwing away.\nDont bother.\n\nHelpful | 3", "AleusGamingSep 12, 2019 at 5:38 PM\nIt's Amazing, with flaws\n\nNow let me start by saying to go into the game with an open mind, I see alot of reviews negatively talking about this game because it \"doesn't have a story\" or \"it has no point\" Wich is not something to judge a game on. It's like a B movie, but it's a game. We're all just here for stupid fun and to enjoy ourselves. And I did and still am enjoying myself ESPICALLY on the tetherless experience on the quest.\n\nBut this game isn't without it's flaws. It's more expensive that all other versions resting at 15$ on the quest store. Now this isn't so bad until you consider the fact there can only be 3 enemies in a certain area at a time. This would definitely set well at 10$ and I think the 15$ price tag may drive some people off. Apart from those small issues I really enjoyed the game!\n\nHelpful | 3", "Mikey_FerrelliSep 14, 2019 at 1:01 PM\nClassic\n\nGreat game and concept, can't wait for the updates... fun game to show friends and family, would love to see celebrity look a likes, with voice impersonations, or even a coffee shop \"Star Shmucks\" lol that would be classic, nothing like some hot coffee to the face, or some sugar in your eye for holding up the line. Lol\n\nHelpful | 2", "Sebb82Nov 1 at 1:56 PM\nFunny Game\n\nThis game is good with friends and any beers :) The graphic could be better...\n\nHelpful | 0", "KevcopoSep 15, 2019 at 3:27 PM\nSo much fun!\n\nThis game is so much fun and I showed my friend who played for a solid 20 minutes laughing the entire time. There is so much to do and it really lets you blow off steam and is hilarious with the rag doll physics of the game. The only 2 complaints I have are the I wish the trigger button wasnt how you grab things because in most vr games the grab button is how you grab thing (hence why they call it the grab button) so I wish they didnt have the trigger button there because it feels out of place. The game also feels a little bit glitchy with how they items work a lot of the time but all in all for only $14 this game is a 100% steal and such a fun experience.\n\nHelpful | 0", "Davepr79Dec 2 at 3:49 PM\nScore lowered***\n\nReally enjoying this game so far. Just a few suggestions:\nAbility to turn off music or turn it down.\nMore enemies on screen\nBe asked if you really want to leave the bar if you accidentally wander too close to the exit.\nStick a barman/barmaid behind the bar.\nAbility to grab people while fighting (not just off the floor)\nAlso - fight in the toilets!\nPlease continue to support this game as it has loads of potential.\n\n***Will this game be receiving any updates soon?\n\nHelpful | 9", "MoonDaSpoonNov 11 at 7:03 PM\nSo much fun\n\nBuy it please this game is so entertaining and fun\n\nHelpful | 0", "RavebarflyOct 5 at 6:37 PM\nAdd one more thing\n\nAdd one more thing that these people didnt talk about. If you want add killing not just running out of the bar. Overall the game is very fun and I cant wait for the multiplayer update. We just want to know the release date.\n\nHelpful | 0", "sage.bond.2000Oct 17 at 5:11 PM\nAlmost there to the PC version\n\nThere are a few things missing from this that were in the PC version. I understand the Quest not being powerful enough to handle 12 NPC, but maybe a static bartinter NPC in some levels. I read on Reddit that you would be trying to add more which blows my mind as this is on of the best looking game on Quest. After you add more NPC maybe you could make hitting WOMAN a real thing in the game again. It's not it's the same as beating men. I want a group of men to come to a woman defense like on the PC version. Also when on the PC version when you got drunk didn't you lean left and right or is that a fever dream I remember. If the leaning left and right when you get drunk was in the original game please try to add it back. I read that you were adding drunk vision back. I hope that's what drunk vision is. Thanks you for the great game. One of my favorites.\n\nHelpful | 1", "darwins.lastSep 13, 2019 at 6:58 PM\nVery Fun... And Hilarious!\n\nGreat graphics on the opponents. Love the annoying chatter from them... Great fun! Spent two hours knocking people out tonight and cant wait to show friends. However, would love to be able to invite one friend/multiplayer into the scenario and pipe in my own music... Just a wish list. Thanks, devs. Well worth the money.\n\nUpdate: Thanks for the great news/info, devs and quick response. I can see by your responses to the reviews that you're involved and attentive. Thanks for multiplayer soon. And, I'd love to stream spotify, but if it messes up speed or limits multiplayer, more npcs or other things, then could do without. If not spotify then load onto Quest from computer mp3s. THANKS\n\nHelpful | 4\nDeveloper ResponseSep 12, 2019 at 9:37 PM\n\nThanks darwins.last! Multiplayer is coming in the next update. We also want to \"pipe in my own music\" (Did you know you can do that on PC versions?) Where would your own music be located? On your Quest, PC, Phone, Cloud or a music service (Spotify)?", "InsaneTomato95Sep 19, 2019 at 4:18 AM\nThis game is stupidly fun\n\nNot every game has to have a great story or amazing graphics. Sometimes you just want a game that is stupid and fun. This game is exactly what it says it is: Drunkin bar fights. There are a variety of weapons including picking up your enemies and using them as a weapon. I don't know why my character is so angry or why he needs to pick a fight in a variety of bars. Perhaps it is related to some deep seated childhood trauma or an undiagnosed mental illness. The game doesn't try to explain why my character does what he does, and you know what? That's ok. Why? Because breaking a bottle over somebody's head with one hand while changing the song on the jukebox with the other is fun.\n\nHelpful | 0", "8888George8888Sep 15, 2019 at 9:48 AM\nReally fun\n\nI really enjoy with game the only thing to improve would be would holding things it clips out of the hand so it looks weird but the gameplay is so fun to mess around also It would be amazing if like once a week or something you regularly add new items nad even new bars.\n\nHelpful | 1", "pacethatkillsSep 21, 2019 at 12:27 PM\nFun but...\n\nFirst off I just want to say that I do not personally care about the multiplayer, but one thing that really bothers me and others is the amount of people in the bar. Also its pretty hard to pick up certain items such as people or anything else.\n\nHelpful | 4", "Blueblur18Sep 13, 2019 at 1:36 AM\nThe game is fun but..\n\nI do wish it had a little more fun variety to it. Like super powers, magic spells or even more fun ways to smack people around, maybe even a physic setting to lighten the mood. Overall fun game it just needs a bit more varities to add replayability.\n\nHelpful | 4", "CrockpotCriminalSep 12, 2019 at 9:54 PM\nReally Fun!\n\nI have been looking forward to this game since it was first put on the, \"coming soon\" list. I have only played a little bit so far, but I'm loving it! The fighting is both goofy and satisfying. The dialogue of the NPCs crack me up, and are a great addition. I would love to see an achievement system for various goofy things. Overall, love it!\n\nHelpful | 3", "Cass582Mar 20 at 11:37 AM\nNeeds to be multiplayer and crossplay\n\nNeeds to be multiplayer with quest and rift s.\n\nHelpful | 0", "NoItsNotThatSep 12, 2019 at 6:49 PM\nFun but needs multiplayer\n\nI got this game bc I saw a bunch of videos on YouTube over it and it was hilarious. Me and my friend got the quest so that we could play vr games together and we bought this game bc we thought itd have co op like every other version of it. Would be 5 stars if it had multiplayer\n\nHelpful | 1", "eaglegames13Oct 5 at 4:12 PM\nWhy did i not notice this before??\n\nI accidently found this game and instantly loved it. The only things that need to be fixed are the amount of people, the physics, and multiplayer NEEDS to be added. So far, i love this game. 10/10 would share with friends.\n\nHelpful | 1", "SkyjoggerSep 13, 2019 at 5:27 AM\nFantastic !!!!\n\nTired with colleagues at work and want to let off some steam or just want to vent some frustration generally whilst not actually getting in to fights in real life?\n\nThe concept is just brilliant and the game does exactly what I was expecting it to do. Funny, silly, cathartic, it does what it says on the tin, no more no less.\n\nI get peoples comments about occasional graphic glitches or wanting more NPCs but seriously guys these are clearly just details! yes maybe the devs could tweak the graphics. I actually think 3 NPCs at a time is fine. I mean how violent are you? How many people do you need to beat up at once to be happy?\n\nAnd 15 dollars is nothing when you think what all this would cost in repair and legal fees in real life!!!\n\nHelpful | 2", "Roaldur123Nov 3 at 11:52 PM\nGood game\n\n like the consept but I would like if you could be drunk longer\n\nHelpful | 0", "hamish1610Mar 16 at 2:15 PM\nFun but gets old very quickly\n\nSpent 30 mins playing and enjoyed but had seen it all by then\n\nHelpful | 0", "joss.goodman.3Dec 8 at 1:27 PM\nStoopid\n\nI cant see anything the new update is garbage\n\nHelpful | 3\nDeveloper ResponseDec 8 at 4:50 PM\n\nThanks for letting us know, but can you elaborate? The game doesn't work for you, that is it?", "nikolai.volkoffSep 12, 2019 at 9:53 PM\nMust own VR classic, quality port.\n\nI have now played Drunkn Bar Fight on 4 different platforms, Steam, Rift, PSVR, and now Quest. The Quest version holds its own. The graphics are actually impressive, I would say better than the PSVR version. The freedom of wireless really shines here. I need to take this to a big open room and really go at it. There have been some nice additions to this version including voice acting, which is actually quite funny. There is also now a back alley where you can fight. The Devs are super active and keep on adding things to this game. I always find myself coming back to this game to see what is new. Also, this is a very popular game that people want to try in VR. I have showed this game to lots of friends on PC and it is an absolute must own in my opinion.\n\nHelpful | 2", "Nova212121Sep 16, 2019 at 2:42 AM\nits so fun!\n\nI love it its so fun to find these people a few glitches but you probably already know what those are and youre probably working on them but one thing I want to know is will they be multiplayer added to this version I really want to play with a friend so if you dont want to give me an answer thats fine but if you do add it that would be awesome\n\nHelpful | 0", "4ravens44Oct 26 at 8:40 AM\nObjectively Fun\n\nIts what I expected... just beating the crap out of people.\n\nHelpful | 0", "Putten21Oct 15 at 2:20 PM\nGood fun, but\n\nIts a fun game to play 20 min once a day and its had potentianel. But its very short. The gameplay and fun is strong\n\nHelpful | 0", "Dagon0180Sep 13, 2019 at 8:15 AM\nAwesome!!\n\nI was hopping this game would come to the quest and I was so excited when I heard that it was. And it didnt disappoint!! I can spend hours just beating the crap out of the opponents. More opponents would be great but Im fine with just the three opponents if it has to be that way. Multiplayer will also be a game changer.\n\nHelpful | 1", "jon.watkins.Sep 13, 2019 at 8:56 PM\nIts fun and funny like postal 2\n\nI love this game since i saw it come on the store it looked like one of favorite pc games postal 2 and was Hoping when i could play bar fight it be as funny and Edgy in a good was and im not Disappointed buying bar fight its very funny if looking for a game that let just have fun and Start Chaos this is the game you have been waiting for. I do wish there was Japanese saki bar to fight in and it also be cool if you could unlock a special movies for your fighter to use sry for the long review but this game is worth your money in short ps im playing it on oculus quest\n\nHelpful | 1", "UnusualthemedicOct 15 at 3:28 PM\nAbsolutely hilarious\n\nI don't have much experience with vr as a whole, what I do know is that a bar fight simulator with hilarious physics should fit right it. And it does\n\nHelpful | 0", "yellowysiamang4Sep 15, 2019 at 3:33 AM\nJust buy it\n\nI was planning on returning this game but its just so incredibly fun.\nI own super hot bear saber and sairento\nYet as soon as I put on my headset this is what I play\nIts just stupid fun and I love it\nIt would be better if it had more area though so I hope that will come in the future.\n\nHelpful | 0", "StreetprojectSep 14, 2019 at 8:47 AM\nA blast to play for anyone\n\nI love this game. Have been watching it since some of my favorite youtubers have shown how funny this is. Now that its on Quest I finally get to play it myself.\n\nI love the content additions as well. Potions, unlocks led, and new levels are all really cool.\n\nIf you could please update the grab functionality to be mapped to the inner triggers instead of the rear, that would follow the convention that has been pre-estsblished by the rest of the Quest games that would be greatly appreciated. Even if it is added as an option I would greatly appreciate it.\n\nKeep up the good work!\n\nHelpful | 0", "GameToTheLastNov 1 at 7:00 PM\nCrazy fun\n\nSmashing heads in thats really all that needs to be said\n\nHelpful | 0", "XxBreadStickxXNov 11 at 3:13 PM\nepic\n\nepic\n\nHelpful | 0", "CormactheKidSep 12, 2019 at 12:05 PM\nWhy are people so hyped?\n\nThe idea of this game sounds fun. But the game is 20 minutes long, pretty glitchy, bad graphics, with only a few locations. \"But wait.. After the game is over.. You can still hit people!\" Mhm.. True.. It baffles me this gamevis getting good review. Biggest regret-purchase yet\n\nHelpful | 24\nDeveloper ResponseSep 12, 2019 at 5:04 PM\n\nHey MasterR913, Thanks for giving us a try, sorry we couldn't make you happy. Before you give up, can you please try one thing for me. Try playing without using the joystick to move or turn. Do everything with your body and not your fingers. You will need to setup a larger playspace and a safe guardian but I hoping it helps you discover why people like this game. Room Scale is very cool and most games don't use it so most players don't get it. You said \"few locations\". Did you find the alley? Have you looked for weapons? We will be adding multiplayer in the next update, perhaps that will also help you find something you like about the experience. Thanks for the clear feedback!", "pcoop0503Oct 20 at 4:37 PM\nSome more features would be good\n\nThe only thing that I dont like in this entire game is that you can only have 3 people in a bar at time and wish it could be at least like 5 also there are only 5 levels\n\nHelpful | 0", "rclaw1Nov 2 at 12:47 PM\nUnpolished, but that's what makes it fun\n\nDevs, please don't fix these halirious bugs\n\nHelpful | 0", "Lostspawn08Nov 2 at 7:18 PM\nIts great\n\nThis game brings out the fight in us all\n\nHelpful | 0", "Austrian-homeownerOct 13 at 4:21 PM\nis multiplayer coming?\n\nI truly Love this game but I feel that it would make it so much better if there was multiplayer\n\nHelpful | 0", "MRmcNuggettOct 5 at 6:55 PM\nFun but...\n\nI think you should add more weapons/items to the back ally and the the areas just seem so bear my favorite place is the western bar because its a lot more filled but Id like to play more back ally and the downstairs bar needs more people and stuff because right now it feels empty also I have a problem with my hand it glitches and I cant pick anything up or move my fingers and I have to leave the bar to fix it also please add something cool for Halloween Im not trying to bash the game because its fun and one of my favorite games but I think you guys can make it better.\n\nHelpful | 0", "MaxvzlaOct 5 at 12:31 PM\nLevels\n\nI mean yeah the levels are really cool and well made, but for next update can you add a little more to the levels like the back alley\n\nHelpful | 0", "joe.ross.184881Sep 12, 2019 at 5:43 PM\nRite price for this game\n\nOnly things missing is the \"drunk vision\" after u drink anything and the bartender... add 2 or 3 more people in the bar and a couple extra stages and this would be a full game but it feels like a demo, but for the price its worth it!\n\nHelpful | 5\nDeveloper ResponseSep 12, 2019 at 7:18 PM\n\nHey joe.ross.184881, Thanks for the kind words! We will be adding \"drunk vision\" back in on the next update. We will also try to add more opponents (maybe not next release though). It seems to be a very popular request. We will be adding more environments. \"Black Friday\" at MartWall will be in the next update.", "SlipegSep 29, 2019 at 8:41 PM\nIt could be really good..\n\nI mean sure the game is funny and all, I have massive fun playing but... The downgrade break it for me, let me explain.\n\nI was hyped to play it after watching videos of it in the past (PC VERSION) it looked awesome, I don't really see any graphics downgrade but there's only 3 people in every bars compared to PC the bars are just full and this destroy the immersion.\n\nIt's almost like the guys said \"well.. Not enough money to optimize let's remove the fun out of it, that'll fix it\"\n\nIt just remove the feeling of you starting random brawls in the bars now its more like, well... I punched the guy on the left last time so let's try the right one.\n\nI don't recommend the game at this price I feel like I got ripped off.\n\nPS:sure its the quest... Less powerful and all... But let's be honest here its far from being the biggest and most demanding game on the quest nor vr in general.\n\nPPS: I may edit it depending of what a dev answer if they answer I'm not the one that always blame devs for everything but I feel like its just a lazy port (may be wrong everything can happen behind the scenes).\n\nHelpful | 7", "doesnotmatter1Nov 24 at 8:38 PM\n\nNeeds more bars weapons and people in the bar\n\nHelpful | 0", "Tekray187Sep 12, 2019 at 1:16 PM\nGood times\n\nAn entertaining game that benefits from a large play space. Youll definitely burn a few calories whacking drunks about with gum ball machines and pool cues.\n\nHelpful | 3", "jakejason711Nov 3 at 4:01 AM\nAMAZING\n\nI LOVED THIS GAME\n\nHelpful | 0", "captainottXOct 30 at 2:28 PM\nLove this game!\n\nI play this more than anything else.\n\nHelpful | 0", "Slayer290Sep 24, 2019 at 3:43 PM\nSuper fun and silly\n\nThis is my first vr ever and I am really glad I started off with oculus when I went into the game for the first time I was so excited!And so from there I started off.I really recommend this game to anyone\n\nHelpful | 1", "JerryGerryyMeOct 17 at 2:41 PM\nOnline\n\nIts awesome. But we need online\n\nHelpful | 3", "curtis.lackeyOct 4 at 11:56 PM\nIt's a blast\n\nIt is so much fun and so funny. Listen to the comments the fighters make. When the fighter in the first bar does the Karate Kid stance. I had to laugh.\n\nHelpful | 1", "DiamondDutySep 23, 2019 at 12:11 PM\nVery fun, little buggy.\n\nI find gripping to be buggy. It can also be tricky to pick people up because it thinks youre pinching hem most of the time.\n\nSo, I give this a 4/5 for now. :)\nStill very fun! :)\n\nHelpful | 0", "Crazy_SaneSep 13, 2019 at 4:42 AM\nToo simplified for price\n\nMy first impression was that it's been dumbed down so much, it's nothing like the PC version. Only 3 opponents at once and no multiplayer?! For a game that can be played through in minutes, this should be in the next price tier down.\nMind you, if you want to get out some pent up frustration and can't afford Creed, this is a fun alternative. It's not every day you can beat up a bride at her own wedding and then throw her off a high-rise balcony. That'll teach her to elope with my best friend!!!\n\nUpdate: Multiplayer and extra levels sounds awesome. That would certainly make it better value. I will definitely reevaluate my review when that happens. Thanks\n\nHelpful | 10\nDeveloper ResponseSep 12, 2019 at 9:31 PM\n\nCrazy_Sane, Multiplayer is coming in the next update. We will also be adding new levels. Check back later! The Quest version currently has features that have yet to be added to PC, but they will soon.", "mcoops26Sep 28, 2019 at 4:00 PM\nWow..it feels good to smash people!\n\nGreat game, the quest was missing a game where u could just go in and cause mayhem by using whatever item u have at your dispose. Everything feels great and i would definitely recommend this.\n\nHelpful | 0", "Stan_127Sep 14, 2019 at 6:57 PM\nMissed opportunity\n\nMissed an opportunity by not setting up a better bar scene, ability to start a fight by dancing with a dudes girl for example. The humor is lacking and the game is even more shallow and uninvolved than I could have imagined. The Onion did a parody of a video game where you just repeatedly shot people point blank in the face. I feel like fake game was on par with what I just bought. There's not really anything good to say about it.\n\nHelpful | 4", "bmkippSep 18, 2019 at 8:00 PM\nFun game!\n\nTracking is good and the atmosphere is perfect. It is a little repetitive and monotonous but will definitely keep your heart rate up. Enjoyed all 4 levels alot by figuring out new ways to take out enemies. Great job developers!\n\nHelpful | 0", "PronzySep 12, 2019 at 10:08 AM\nMy favorite quest game yet!\n\nThis game is so fun because there is like unlimited things you can do, it had a lot to do and never gets boring!\n\nHelpful | 14", "reecelovesfifaOct 15 at 10:45 AM\nBest game\n\nIt one of the best games but you need to add levels like the version on oculus rift\n\nHelpful | 0", "eryka.martinNov 28 at 6:18 PM\nAlright\n\nDefinitely gives you motion sickness\n\nHelpful | 0", "joseph.capoun.54Sep 23, 2019 at 12:42 PM\n\nI think that there should be more peaple in the bar and it would be cool for more spaces to fight and more weapons and theres a glitch with your hand/ hands after you play for a while it would be really good if you could fix these problems other than that its probably the best game on the market for now.\n\nHelpful | 2", "BopdrummerSep 12, 2019 at 4:53 PM\nYaaaasssss!\n\nAmazingly fun, very glad to here multiplayer is coming soon! I think that will take the game to a whole other level! I cant tell you how often in vr chat or be poker Ive wanted to bust a sucker in the head with brick.\n\nHelpful | 2", "Krimion13Sep 21, 2019 at 7:53 PM\n100% worth, BUY IT!\n\nI waited on buying this for a while, and man I wish I hadn't, this gem is one of the most fun games on the quest, and for 15$ it's a perfect price\nIf you're on the fence, just stop, drop and but it.\n\nHelpful | 0", "BossbeastSep 12, 2019 at 12:46 PM\nuntethered feels so much better\n\nanother game that benefits hugely from being on the untethered Quest.\nWas not overly impressed when i bought it on PSVR but have had great fun playing on Quest.\n\nHelpful | 2\nDeveloper ResponseSep 12, 2019 at 4:48 PM\n\nTHANK YOU!!!!!", "JakeconerSep 25, 2019 at 1:53 PM\nGood idea but poorly executed\n\nThe idea behind this is great! Its a free for all fighting game with no rules or regulation! However, the one hit knock outs take away enjoyment and the get up system seems to work when it feels like it! Often this results just getting hit once and you lose! The game also has little variety! Its the same thing for all 4 location with Almost no enemy variety. On top of that, after beating the 4 locations you get a score and the game repeats. To be fair, it does seem to be early in product game, but I would wait for a few updates\n\nHelpful | 4", "Allusivenut12Oct 23 at 3:46 PM\nGood\n\nIt is just as its titled\n\nHelpful | 0", "Quantumblast11Sep 12, 2019 at 6:58 PM\n\nI've spent about an hour in this game and it was probably the most fun I've ever had in VR. I only really encountered 1 bug that happens when a NPC despawns when held, but it didn't compromise the fun and wacky gameplay.\n\nHelpful | 1", "domxxxtentacionSep 28, 2019 at 6:46 PM\nGreat game\n\nYoull have a lot of fun with this game if your letting of steam having some laughs with friends and just in general I love this game it got my 5/5\n\nHelpful | 0", "LucasHunter2008Sep 28, 2019 at 8:14 PM\nFunny and Creative\n\nThe sky is the limit. I found so many secrets and its super funny. Knock people off buildings, smash beer bottles or be a good person.\n\nHelpful | 1", "alfie.strooleySep 12, 2019 at 10:06 AM\nIt epic\n\nUghh\n\nHelpful | 9", "CliffyMonster6Sep 12, 2019 at 5:32 PM\nFinally a good fighting game\n\nAmazing just amazing finally a great fighting game and I'm not dissing on other games just this is what I was looking for all we need left is gorn\n\nHelpful | 2", "Chris.BurkeOct 12 at 2:53 PM\nAmazingly fun!\n\nThis game is great! So much fun!\n\nHelpful | 0", "carter.jenkings.5Sep 18, 2019 at 1:42 PM\n\nI love the game but like when I beat all the levels it said game over go to menu to play again but I dont know how to go the menu can somebody plz help me\n\nHelpful | 0", "Genaro1346Sep 19, 2019 at 5:59 PM\nFrame rate looks very choppy\n\nNO online and the developer said that their would be in the new update. Also when you move in the game the frame rate is so choppy that you dont even know what you are looking at and it makes you dizzy\n\nHelpful | 4", "Bigboi420Sep 12, 2019 at 3:22 PM\nFeels amazing, but a few issues.\n\nI would be giving this 5 stars, except I have a few problems. I told my parents about this game, and I got it, and they said it would be fun to watch other people play it. However, I wasnt aware of the swearing (My parents are heavily Christian and hate that sort of stuff), and there are a lot of bugs when trying to pick up objects. 1, I could only rag doll people and throw them, if I grabbed them by the legs. 2, All objects go to the middle of your hand, so short objects like knifes, are barley sticking out and its hard to swing them. And maybe could you add the option for the players to face more than 3 NPCs? When multiplayer is introduced, only having three NPCs will be a problem. So TL;DR, can you add a censory option, and can you reduce bugs when picking up stuff/people, and maybe some more NPCs? I absolutely love this game, and I wish these options were in the game.\n\nHelpful | 4", "FarmMan247Oct 26 at 1:42 PM\nEhh\n\nIts pretty fun when you play in the first bar, but gets boring VERY quickly. Personally your just doing the same thing over and over but not in the fun way.\n\nHelpful | 0", "oooioooooodjdjdOct 10 at 8:02 AM\nGood\n\nIt good game it cool and I love to play the I think you would to\n\nHelpful | 0", "TalemannSep 15, 2019 at 10:08 AM\nIs this Final?\n\nI tried the game yesterday and could not play because the left hand got stuck and didnt move. I love to support stupid things in general, but i really do hope the devs will put more effort in to this version of the Game. I thought Oculus will qualitycheck everything before it hits the store on the quest. Some already got denied because of the regulations. Please, no more alphas (payable version is called early access these days). It will destroy VR in the End and there will be no winner. Take your time guys. I know money rules.\n\nHelpful | 1", "BrookerTSep 13, 2019 at 2:14 PM\nA fun experience with room to improve\n\nI just spent the last hour playing this game and had a good time. Its short but thats the point and the price reflects that - its about jumping straight in and being silly. The thing I really dont like is having only 3 other people in the bar. It doesnt feel like a bar fight at all when its just the four of you in a room, and it doesnt make sense that theyd leave in order for a new set of three to enter - then rotate. When I jumped in, I was really disappointed with this as Id seen other versions in what felt like a real bar that was full of people. If Id seen this was the case beforehand I dont think I wouldve made the purchase. Its also a shame its missing multiplayer at the moment.\n\nHelpful | 2", "HalfheadhalfdeadOct 7 at 6:16 AM\nIts good\n\nAdd more maps and multiplayer.\n\nHelpful | 0", "dennyajdSep 15, 2019 at 3:39 AM\n5 stars but...\n\nIt worth the price and (even) 6 stars if you guys manage to do some major IMPROVEMENT of the character's quality. Is it what you gonna do for the next version? Please say yes...\n\nHelpful | 0", "leo.zaar.1Oct 12 at 11:51 AM\nWhen is multiplayer coming\n\nWhen is multiplayer coming best game ever\n\nHelpful | 0", "Wario_FartsSep 30 at 5:32 PM\nHilarious and fun\n\nThis game is fun, its so cool to find all the fun ways to hit people and customize your character.\n\nHelpful | 0", "TrueRepzOct 4 at 11:58 AM\nVery good\n\nSo flipping good, never gets old, HURRY with the multiplayer please!!\n\nHelpful | 1", "TomatoWillOct 11 at 11:50 AM\nAmazing\n\nVery good game for the price a lot of fun\n\nHelpful | 0", "Boltz_N_BulletzSep 19, 2019 at 3:27 AM\nSatisfying! But i wish...\n\nI WISH YOU COULD UPLOAD PHOTOS to the textures! Everyone has a few faces they wanna punch! Make it happen devs!\n\nHelpful | 0", "FinS5642Sep 12, 2019 at 11:33 AM\nGreat Game! But...\n\nThis is one of the funnest games to play on the quest and is so good with no wires!\nBut I really hope that this could get graphical improvements and slight bug fixes.\n\nHelpful | 2\nDeveloper ResponseSep 12, 2019 at 5:06 PM\n\nDr-Autism, We will be updating the game every 3 months so we have a chance up get those bugs.", "dballot34Sep 12, 2019 at 10:30 PM\nSomethings need to change\n\nIts certainly fun and silly with its obvious flaws.\n# 1 is the fact the developer make you use the trigger to pick things up. Why?!! This should be the side button only.\n# 2 NPCs react to your punches but to be able to pick them up is silly.\n# 3 trying to push buttons accurately is near impossible with the hand. Theres no obvious finger to choose an option.\n# 4 everythings available from the start, even god mode. It seems like you get zero reasons to keep playing other than jump in and jump out play.\n\nOverall entertaining for a few moments but you will get bored super fast as theres no depth and no rewards.\n\nHelpful | 3", "TalamiusSep 28, 2019 at 9:44 AM\nThis close to greatness.\n\nUp the NPC count and add multiplayer and its a 5 star game.\n\nHelpful | 1", "H20Killer27Oct 6 at 10:36 AM\nMy finger\n\nAll Im saying is I broke my finger still 5 stars\n\nHelpful | 0", "BigManSandoOct 9 at 6:59 PM\nSolid\n\nSolid game but not a lot of content and weird controls with the controller. I really its definitely a lot of fun to beat the sheet outta people but the game is not worth its price tag. Buy at your own risk\n\nHelpful | 0", "MangoFett54Sep 14, 2019 at 9:36 PM\nFun... for about 5 minutes\n\nAs the title suggests, the game gets old... and fast. With only 4 bars to choose from and a maximum of 3 NPCs in the game at the time this game is worth 5$ maximum. The thing thats crazy to me is the dev is actually charging 1$ MORE than the PC version for a far worse version...\n\nHelpful | 9", "vincent.alavi.5Sep 26, 2019 at 11:49 AM\nAmazing\n\nThis game was so fun, I couldnt stop playing, I highly recommended this game\n\nHelpful | 2", "freddiej1909Sep 13, 2019 at 8:26 AM\nHoly crap!!\n\nThis game is hilarious and just so much fun. For me this alone was worth the 4 month wait. Great job Munkey. I will continue to support you!!!\n\nHelpful | 2", "ChangeMyMindSep 24, 2019 at 3:47 PM\nFun.. but short\n\nVery fun and satisfying game, I just wish there was more content!\n\nHelpful | 0", "hockidoggSep 12, 2019 at 10:09 AM\nAmazing port\n\nThis port is amazing great controls\n\nHelpful | 3", "WorldlySage940Sep 29, 2019 at 12:22 PM\nIt was awesome\n\nWhen will multiplayer release other than that I love it\n\nHelpful | 1", "coleymoley67Oct 1 at 11:03 AM\nGood\n\nIts great great stress reliever five stars\n\nHelpful | 0", "PublicFartSep 12, 2019 at 10:23 AM\nCan't wait to play!\n\nCANT WAIT\n\nHelpful | 3", "FockingBreadSep 12, 2019 at 10:27 PM\nLove it\n\nIt's the funniest game I have ever played and i was so excited when the trailer got released and I wasn't dissapointed\n\nHelpful | 1", "hubba_bubbas_manOct 5 at 7:18 PM\nGood\n\nPretty good\n\nHelpful | 0", "thekrunkymonkeySep 14, 2019 at 5:13 AM\nFun but wheres the rest?\n\nThis took me all of 30 minutes to complete and while it was fun, at almost a dollar a minute it really didnt deliver quite the game Id hoped for.\nBuy it for the ridiculous premise and enjoy the hell out of it for all of half an hour.\n\nHelpful | 1", "MisterFlSTERDec 3 at 6:00 AM\nHate the game\n\nNot good overall i dont know how to refund so i guess Im beat ... dont buy its not even remotely good or have any potential IMO , yours may differ\n\nHelpful | 2", "PrinceOfPersiaSep 12, 2019 at 10:48 AM\nWhat do you expect?\n\nDoes the job well , some improvements need to be made but nothing that isn't being worked on.\n\nHelpful | 2", "DAX_QcSep 12, 2019 at 6:21 PM\nBoring, no physics, cheap port.\n\nThis game is a waste of time and space on your quest. We have a button name grab button but no... trigger is used. Why? Ragdoll effect almost first gen. Poor graphics. Its a cash grab. No idea why ppl in these review hyped so much on this.\n\nHelpful | 4\nDeveloper ResponseSep 12, 2019 at 10:02 PM\n\nDAX_Qc, Thanks for giving us a shot! There is an option on the in game cell phone to select which button is used for grab. You can choose \"grab button\" or \"Trigger\". We defaulted to trigger because in DBF you throw a lot of objects and if you have larger hands, using the grab button moves one of the last fingers holding the controller off the device at the exact time you release the virtual object. Thank you for alerting us, we obviously need to make a notification letting people know of this option. This is why we really appreciate you taking the time to leave a review. Before you give up on the game, can you please try something if you haven't already. What I am about to ask you won't improve the graphics, the physics or the options but I hope it will help you understand why folks like the game. Setup a very large Guardian in a very open space. Then, play DBF without using snapturn or using the joysticks to move. Do everything with your body and not with the controller. Move around the space freely dodging, punching, blocking, smashing. I hope this helps you enjoy the game. Thanks for the feedback.", "Purple9gorillaOct 1 at 5:22 PM\nWow\n\nIts good\n\nHelpful | 0", "Pitbullmaster123Oct 14 at 8:59 AM\n\nI like but I got a little motion sickness\n\nHelpful | 2", "KnatmanSep 27, 2019 at 6:19 PM\nOne two buckle my shoe\n\nBeat the life outta them\n\nHelpful | 0", "YOURnameHERE69Oct 18 at 5:26 PM\n\nMake it where people can fight by your side!!!\n\nHelpful | 0", "mickbowlesSep 12, 2019 at 12:08 PM\nAwesome game!!!\n\nHours of fun!!!\n\nHelpful | 2", "parkerbice22Sep 23, 2019 at 11:17 AM\nFun for about 10 min\n\nGame only has 3 levels and got bored of it really fast\n\nHelpful | 4", "DamonBaker88Oct 8 at 4:10 PM\nGood but...\n\nYou should go for the newest update for it and have everyone in the bar\n\nHelpful | 0", "FuzzzzzzballSep 13, 2019 at 12:23 PM\nOnline please\n\nThere is no online mode so you cant play with friends.\n\nHelpful | 1", "xRyan2008Sep 23, 2019 at 1:08 PM\nAwesome\n\nGreat\n\nHelpful | 1", "whatsupbrewOct 11 at 11:47 AM\nVery short\n\nVery short, little direction, not that fun\n\nHelpful | 1", "tiny_tim466Sep 13, 2019 at 7:25 AM\nShort\n\nReally fun game just super short\n\nHelpful | 3\nDeveloper ResponseSep 13, 2019 at 9:55 AM\n\ntiny_tim466, We plan to continue to add content every three months. The next environment \"Black Friday\" at MartWall is currently being added along with Multiplayer. I know it feels like you have finished the game, but you haven't unlocked all the weapons and characters yet. Some of the unlockable weapons are pretty cool. Thanks for giving us a shot!", "SweetMan2612Nov 3 at 4:49 PM\nBoring\n\nIt's just meh\n\nHelpful | 1", "colezilla74Oct 29 at 3:38 AM\nFun times but\n\nCome on already with the multiplayer!\n\nHelpful | 3"]