{"App Title": "ecosphere", "App description": "Venture into the wildest places on earth and meet the humans protecting our most precious wildlife. Explore the great savannahs of Kenya, discover the ancient jungles of Borneo and dive into the rich coral reefs of Raja Ampat. Encounter elephants, orangutans, manta rays and some incredible humans, all in stunning cinematic footage filmed from the air and deep into the ocean.\n\necosphere sets out to redefine the limits of 3D-180 cameras, natural history storytelling and conservation filmmaking. Travel to natures most fragile and diverse ecosystems, where indigenous and community-led efforts are creating space for humanity and wildlife to thrive together.\n\necosphere is an uplifting nature documentary series by the award winning studio PHORIA. Produced in partnership with World Wide Fund for Nature (WWF), Silverback Films Ltd and Oculus, this groundbreaking series is narrated by Emmy Award winning actress Anna Friel.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Documentary & History, Educational, Travel", "Languages": "English", "Version + Release Notes": "1.0.6", "Developer": "PHORIA", "Publisher": "PHORIA", "Website": "https://www.phoria.com.au/projects/ecosphere/", "Release Date": "June 7, 2020", "Developer Privacy Policy": "", "Developer Terms of Service": "404 Not Found\nnginx/1.10.3 (Ubuntu)", "Space Required": "608.1 MB"}



["5 stars\n66%\n4 stars\n18%\n3 stars\n9%\n2 stars\n1%\n1 star\n6%", "Palaxax22 days ago\nPretty Good\n\nI liked the documentaries and I think this might be the way forward for TV in the future once the technology improves and is more accessible to everyday people. The Quest goes a long way, but I think it's going to take another decade before everyone has one of these in their homes.\n\nThe scenery is beautiful, but I was a bit disappointed that there were only 3 documentaries. Still, it's a fascinating experience to watch a documentary in VR and I'd recommend the experience to everybody. I was surprised on several occasions when an animal \"got close\" to me, but that's part of why it was fun. It scared the crap out of me when the orangutan landed right in front of me, but in a good way!\n\nHelpful | 9", "miguel.dipp.14Jun 7 at 8:31 PM\nI HOPE YOU WILL IMPROVE IT !!\n\nI loved the level of quality of the filming !! What I didn't like and surely could be better is the video compression they used for the Oculus quest. I wish and hope they can fix it! I'm sure you can see better, the compression of the video is not good!\nSPANISH SUBTITLES !! IT IS A SHAME THAT THE MARKET IS ONLY POINTED AT ENGLISH. IN THE WORLD THERE ARE PEOPLE WHO SPEAK OTHER LANGUAGES THAT WE ALSO WANT TO ENJOY A DOCUMENTARY. I HOPE YOU SOLVE THESE THINGS. THEY ARE GOOD DETAILS FOR US CONSUMERS.\n\nHelpful | 151\nDeveloper ResponseJul 7 at 9:03 PM\n\nHello Miguel, Thank you for your feedback. We wanted to let you know that we were working to very restricted file sizes so compression was an issue. We have listened to the community and implemented a new system of compression and playback. While it isn't perfect, we believe that it has improved the quality significantly. If you would like to take another look please feel free, though it does require re-downloading. All the best, Team ecosphere", "calforbJun 8 at 5:22 AM\nExcellent experience!\n\nThe videos are fantastic but maybe the compression could be improved for a really high definition experience?\n\nBut the experience is still amazing! Beautiful use of 3D video and really brings the subjects to life. Its narrated well too so really feels like the next level for documentaries.\n\nI hope that this is only the start for Ecosphere and that more experiences will be added as time goes on!\n\nHelpful | 57", "YeahWowCoolJul 3 at 9:27 AM\nLove the content\n\nDocumentaries inside are just stunning - I wish you could add new ones as the time goes. Also, dont be afraid to provide larger filesizes of these documents - Id download 6-8-12gb per document within a blink of the eye - if these videos were just sharper / with better bitrates and in higher resolution. The content is worthy of it. Cant wait for these crystal clear teleports to other places. Im also very happy youve decided to go for 180 stereo instead of 360 - they are much more practical. Im keeping my fingers crossed and wish you the best of luck.\n\nHelpful | 11", "bryanloJun 8 at 5:44 PM\nBeautiful our home land , Earth\n\nFirst, many thanks to every team members for their times to this game.\nAn open eye learning VR experiences about lifes on earth.\nPlease continue to add more contents or payable DLC to this game because it is a helpful and educational games to our children. Love to learn more as well.\nHistory of earth is an interesting story to learn. How earth is changing every day from the past to present. How humans and animals are living together, and what can humans do to improve the living conditions of our home Earth.\nInside the game, have a Q & A area where we can ask questions and get answers to share and exchange knowledge. Thank you . .\n\nHelpful | 13", "TorisHusbandJun 27 at 3:39 PM\nHow is this free?\n\nIm probably the only person here that found this from the camera manufacturers website under samples. Its filmed on the Brand new, unreleased ZCam K2 Pro and while I can understand the need for compression, would personally love to pay to have the full resolution files. To any Quest users reading this, disregard all the negative comments if their main qualm is about it not being in 360; 180 has a higher potential for quality as it allows sets to use & hide lights, diffusers, and immersive mic setups - not to mention resolution in regards to processing power on the Quest. Anyone up in arms about the 180 element is simply ignorant of the technical feats that are going on right behind the camera. These are 10+ minute 6K 60p films that they compressed really well, especially considering under 2gb a piece. People clearly take the complexity of their eyes for granted as they falsely undermine and compare it to technology.\n\nThank you for doing this, planning on financially supporting this venture! One of my VR videos: https://youtu.be/nZrN6mcJqks\n\nHelpful | 4", "andrew.purdamJun 10 at 9:01 PM\nGroundbreaking\n\nNatural World documentaries just took a huge leap forward in how immersive they can be! The sound in the Kenya module and the awesome video in Misool (Indonesia) leave me thinking I am right there. Manta rays so close you can nearly feel them muss your hair with their wings. Shoals of fish scintillating in the filtered sunlight.\nAnd the positive messaging is very refreshing. The world needs more of it.\n\nHelpful | 9", "AuziFoxJun 9 at 7:53 PM\nCould have beeen AMAZING.\n\nIm extreme disappointed in the QUALITY of the downloaded videos. The bitrate is horrific and hurts my eyes. The porn industry has better quality 3D 180 videos (dont judge uwu) than this and those are streamed, not even downloaded.\n\nI will change my review to 5 stars if you fix the sad bitrate/compression.\n\nHelpful | 28\nDeveloper ResponseJul 7 at 9:00 PM\n\nHello, Thank you for your feedback. We wanted to let you know that we were working to very restricted file sizes so compression was an issue. We have listened to the community and implemented a new system of compression and playback. While it isn't perfect, we believe that it has improved the quality significantly. If you would like to take another look please feel free, though it does require re-downloading. All the best, Team ecosphere", "NeonPruJun 23 at 1:28 AM\nLife Changing\n\nAbsolutely incredible. My fave Oculus experience to date.Life changing and evoking.I m an animal freak.Especially exotics and primates.Big cats, amazing!!!!! I wish sooooooo much more of these would be produced.All different species worldwide.\nFrom bears in Laos to Kangaroos in Aus.And not to mention the education and awareness raised.This experience is in my top 10 life jams.\nSeriously, 50 stars......5 is nowhere near enough.\nThank you to whoever made this happen.\n\nHelpful | 3", "cprachJun 20 at 12:09 PM\nBeautiful videos and message\n\nSo far Ive watched one of three videos and previewed the others. This is really great. The content was informative and interesting, but also just the video itself was gorgeous. So it was educational but also just cool to be immersed in a great environment. The video wasnt 360 degrees, just 180, which took a little getting used to. But it kind of made it easier to relax that way- with 360 videos I find myself cramming my neck trying to look all around. Also, the menus were stylish and fun. Really nothing negative to say especially for a free app that supports a great message of conservation.\n\nHelpful | 3", "tamerrrJun 29 at 1:51 AM\nmust watch\n\nall I can say is you must watch this yourself because words can't do it justice. An experience that was nothing short of inspiring, really got me in the feels like I wanted to cry with sadness and then I wanted to cry with joy =')\n\nHelpful | 3", "angyd83Jun 3 at 2:56 AM\nNatural history like never before\n\nStunning VR cinematography. Great stories. Face to face with megafauna. Ecosphere is incredible.\n\nHelpful | 31", "slamberhamJun 28 at 9:25 PM\nAlmost perfection\n\nAgree that bit rate could be higher. Since you download episodes -- how about giving us the choice of a quick download or a more hefty higher def download -- would be ideal. But hi def quality is my only complaint. Super cool to be hanging out with monkeys and the giant ray underwater is stellar. Can't wait for more!!\n\nHelpful | 1", "TransJenderGalJul 5 at 9:14 AM\nLove it\n\nVery beautiful, educational, and entertaining.\nBUT\nNeeds Much more content. Im not being Petty, But for it's own sake, add more content to this gem. Seemingly everything is in place for them to do so, I hope they do. Would love to see the globe filled with all kinds of locales and VR Experiences.\n\nGraphics/Video Quality 5/5\nSound 5/5\nStory/execution 5/5\nAmount of content 2.5/5\nFun and enjoyment 6/5\n\nBest veiwed with a Swivel chair or standing.\n\nHelpful | 1", "AnniehenJul 12 at 12:26 PM\nFabulous!\n\nThe films within this app are very beautiful, clear and educational. Unfortunately, there are only three, Kenya, Borneo and a reef area at the interface of the Indian and Pacific ocean. I would love to see additional films and would be happy to pay for them.\n\nHelpful | 0", "boroboymattJun 18 at 5:20 AM\nLove this!\n\nVR has such a magical capability of taking you places and making you feel like you spent a lifetime with the orangutans in the rain forest or walked alongside the elephants on the Serengeti. Apps like this give me hope for future generations of humans on this planet! I really enjoyed the 3 docus already available and definitely hope to see many more <3\n\nHelpful | 2", "VertigeVJun 16 at 12:44 PM\nGreat little documentary\n\nLikes\n- 180 degree field of view. I watch that kind of content sitting down so 360 doesn't work for me (hard to turn around when sitting down on a couch lol)\n- Video quality is much better than similar experiences.\n- Downloading episodes instead of streaming. This ensures the highest quality experience.\n- Message. I like the message and how it was delivered.\n- The hub is nice looking.\n\nAreas of opportunity\n- Please let us download larger files that are less compressed. Doesn't have to be the default but having the option would be nice.\n- Looking far left or right sometime hurts my eyes. I understand this is a limit of the technology though.\n\nHelpful | 2", "Banja78Jun 17 at 10:01 AM\nA great experience\n\nOne of my main motivation to buy a Quest was to be able to travel in VR and watch realistic 360 videos - so thanks a lot to the people who developed and paid for this app - I love the concept - I love the ecological messages and the videos are very well filmed (who would not want to see the Manta and the elephants - that is a kid dream) although technically a bit compressed. For the price of 0 Euro, this is for me an app that everyone should look at. Obviously there are only 3 videos for now - so all in all it last one hour max but I do feel the concept is great so I look forward to see more videos coming soon ! One new video per month would be a great update.\n\nHelpful | 2", "MondsuchtJun 9 at 7:08 PM\nTop Noch\n\nIts a must have for anyone who is into nature and documantation. The videos are a 15 min experience each and are really good looking. Every episode is about another habitat. Right now there are 3 episodes and they are for free. The main menu and episode selection is also really lovely.\n\nThank you for spreading free education and for bringing those stunning places right into my living room!\n\nHelpful | 2", "theVRmangJun 10 at 10:00 AM\nClose the zoos bring us the real deal\n\nEver since I was a kid I was always against going to\nzoos. Never liked them. This experience gave me a completely different feeling. I sat there in awe of watching the elephants in their natural habitat. Very informative, great menus and filming. Some shots were a little motion sick worthy (for some folks). But if you cant visit these animals in their real habitat then this is how it should be done. Be gone with you Zoo.\n\nHelpful | 2", "okeyoneJun 8 at 2:11 PM\nThank You!\n\nYou will love the whole theme. I was going to give 4 starts because it is 180 but that would be selfish. Hard work and thought made these films possible. Thank all ou You for this wonderful experience.\n\nHelpful | 5", "360VRcreatorJun 9 at 12:58 PM\nAbsolutely Spectacular\n\nSetting benchmark for immersive documentaries. WOW.\nAbsolutely a must see production.\n\nYES I would absolutely subscribe to these episodes.\n\nCouple of nickels..\nCompression, upside of shooting \"only\" 180 is that you get more resolution out of a 8k file.. but in this case I constantly see compression artifacts, so the increased resolution is wasted in the compression. each 15min episode is 4gig.. lets increase that a bit and get a clear image. this is the reason for the 4 stars vs 5.\n\nAgree with others, this could easily be dubbed to say German, Spanish, Chinese etc. and would increase the appeal. But thinking there is a good argument that most VR users probably are fairly fluent in English as it is.\n\nHelpful | 1", "sindredJun 9 at 11:44 AM\nThis is how it's done\n\nNo 360 spherical flat video. No stream-only option that results in murky video resolution.\n\nThis is 3D-180 downloadable video that looks as crisp as you can get right now and really brings these images to life, and it's the next best thing to being there.\n\nHelpful | 2", "RickK75Jun 13 at 4:32 PM\nDisappointing\n\nThe good:\nGreat concept.\nNice interface and this app is free.\n\nThe bad:\nThe execution of everything else.\nUncomfortable and nautious drone motion segments are unnecessary and would have been better from a static POV.\nDownloading clips seems a bizarre choice, they take *ages*, streaming would have been better, with the option to download for offline use\nAs others have remarked, video compression artefacts let this down. The material could have been far better optimized to avoid this.\n180 degree is an immersion killer, so many 360 degree VR options on YouTube so this is far from state of the art.\n\nHelpful | 6", "weirdmonkey2807Jun 8 at 10:15 PM\nAs other vr180 experiences it suffers\n\nThe main issue here is not the content itself which is wonderful (together with the slick interface and simple navigation) but the fact that there is major issues with the stereoscopically acquired 180 degree footage. I do not understand how these issues couldnt be fixed in post but it leaves the viewer dizzy after a few minutes having to watch footage that suffers from misalignment most of the time and excessive parallax at other times.\n\nHelpful | 4", "nr6542Jun 17 at 1:14 PM\nNOTE: You should stand! (Probably)\n\nAt least with the video on Africa, the camera was set up from a standing point of view. If you watch it seated, the elephants will seem small. If you stand however, they seem as big as they should. Give it a shot!\n\nUnfortunately, while the idea of this is great, the execution is poor. For example, the camera height varies throughout a video. So whether you stand or sit, you're always either not far enough off the ground or too far off it compared to how it was recorded. You'd think that companies that spend so much money on creating content like this would experiment with such absolutely basic things before shooting tons of material.\n\nAnother problem is that the image position isn't fixed. Which means that as you move your head, the image slightly moves with it. For one thing, that made me feel slightly disoriented, for another, it breaks immersion.\n\nCompression also seems worse than what it could be. It's only about 18 MBit/sec. and I'm pretty sure that I've seen 180 deg. 3D videos of better quality. There should also be streaming options because while the Quest doesn't have a lot of storage space, there are many people who have >50 MBit connections (which means that they could easily compress less AND offer streaming).\n\nWeird how long VR has been around for now and what budget we're probably looking at here and yet, they didn't get so many pretty simple/basic things right.\nGuess it'll be another few years before we'll see decent 180/360 3D video content. (What I've seen on Youtube has been pretty bad as well. Pretty much the only somewhat decent one I've found so far is \"ASMR / Meditation - Welsh Coastline\" on Vuze. That's it.)\n\nHelpful | 2", "CURTROCKJun 14 at 6:43 PM\nVR for good (edu-tainment)\n\nThis would be great for children in school. Its the next best thing to seeing these magnificent animals in person. More immersive than videos, light years beyond the encyclopedias of yesteryears. Love the little 3D dioramas for each section on the earth/globe. VR in the classroom is the future. The potential is unlimited. I hope we see much more content like this. Bravo \n\nHelpful | 1", "evandaganJun 15 at 4:57 PM\n180 degree, 3DOF, 3D video app\n\nIt's a collection of 15-minute nature documentaries, presented in 180 degree 3D video, 3DOF and no interactivity.\n\nThe 3 videos included on launch are interesting. I wish Oculus would create a separate category in the store and library for this type of non-interactive content.\n\nHelpful | 2", "DracornasusJun 23 at 9:56 PM\nI love this app!\n\nI just wish there were more than only 3 videos. They are so educational and relaxing to watch. Please make more!\n\nHelpful | 0", "Scary_Clown5831Jun 12 at 7:54 AM\nWhy you should improve it\n\nI love these documentaries and how you make them but the graphics could be better as Ive seen the quality for videos on the quest. Like a previous comment said that you should make them other languages except English which I would like to disagree. You cant redo a shot in another language once its already done if anything they can do a voice overlay. Anyways, the last thing is you should add more areas to travel too than just two places in Indonesia and one in Africa.\n\nHelpful | 1", "felixableJun 19 at 6:33 AM\nGreat educational videos\n\nNothing special other than a few educational videos. I like the educational elements of it but that's all.\n\nHelpful | 0", "BadLarryNYJun 16 at 3:12 PM\nWoefully behind the times.\n\nA couple extra stars for being free. I'd give it a 1 star if it was paid. 180 degree videos with resolution issues ain't exactly cutting edge of what this device can do. The content is nice, but it would be so much more worthwhile if the videos were 360 degrees.\n\nHelpful | 0", "Laggniape22 days ago\nBig black square in middle of screen\n\nCan't see around the big square that blocks the view of everything but the corners. Needs more testing.\n\nHelpful | 0", "krisvdvijverJun 15 at 5:19 AM\nloved it\n\nVery nice interface/menu, good quality videos and very interesting stories accompanied with an excellent narrator. I just hope they add more videos.\n\nHelpful | 0", "Baseballrocks04Jun 8 at 4:58 PM\nGood game, but I hope it will be updated\n\nThis game is an amazing game. It shows you nature and has people that live there talk to you about it. The first thing I dont like about this game is that I can only look forward. It is only 180, not 360. Behind me is just blackness. Secondly, it is only a stationary game. I wish it was room-scale and I could walk and get closer to the animals. In the next update I hope these things will be fixed and that there will be more places to go!\n\nHelpful | 1", "gemini1976Jul 30 at 1:03 AM\nOnly 180 vr\n\nIf this was 360 video it would be 5 stars\n\nHelpful | 0", "freshjcApr 24 at 3:21 PM\nGamechanging education\n\nThis is the most immersive learning experience I could imagine!\n\nHelpful | 16", "TheHaminatorrJun 9 at 12:46 AM\nSomething Special, Something Good\n\nDocumentaries in 3D! Yes Please and thank you for being free!\n\nHelpful | 2", "linkthplaysJul 16 at 4:55 PM\nNot enough content And bad compresion\n\nPls add more content And improve ur compresion, like one download takes a 1h.\nLike JEEZ\n\nHelpful | 0", "Ender772Jun 11 at 10:27 PM\nWow amazing until it actually starts\n\nI thought this was a 3d recreation of the video. The starting section of the manta ray fish tank is better than the app itself. And that is only in the downloading section. Once the video started I realized the quality is kinda bad. Those of you who are used to low quality videos will probably love this app.\n\nHelpful | 2\nDeveloper ResponseJul 7 at 9:00 PM\n\nHello, Thank you for your feedback. We wanted to let you know that we were working to very restricted file sizes so compression was an issue. We have listened to the community and implemented a new system of compression and playback. While it isn't perfect, we believe that it has improved the quality significantly. If you would like to take another look please feel free, though it does require re-downloading. All the best, Team ecosphere", "ReptileMkJun 12 at 4:32 PM\n180 Videos? No thanks\n\nJust doesnt feel immersive at all being 180. Uninstalled as soon as I turned around and faced a black screen. It would have been a 1 star if Id have paid for it.\n\nHelpful | 0", "oli70Jun 8 at 10:45 PM\nnothing special\n\nnothing new\n\nHelpful | 3", "OnePerspectiveJul 3 at 12:23 PM\nAn eye-opening experience\n\nI really appreciate the high frame rate footage, I also prefer videos like these to be 180 degrees instead of 360 so I can watch them comfortably on a couch.\n\nThat being said some of the shots in the underwater video hurt my eyes, sometimes the 3D effect felt distorted and my eyes couldnt focus, so the other two videos are my favorite.\n\nI like what this app represents and Im excited for more videos. A dedicated app for 3D nature videos is needed on the Quest, most of the video apps with free content are not good.\n\nHelpful | 2", "HanabearJul 20 at 8:36 PM\nAmazing experience, must watch!\n\nReally enjoyed the stories, they are beautiful and moving, full of details. Also appreciate all the efforts of camera movement design that make motion sickness down to zero(I am very sensitive to the motion sickness.). Hope to see more videos like this.\n\nHelpful | 0", "ParadiseDecayJun 17 at 7:45 AM\nI played in the rain!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=twR3uB2Fspc\n\nMy Initial Impressions:\nEcosphere does a really good job of transporting you to location in the World and makes them as realistic and lifelike as possible.\nMost of the 180 images in 3D were really sharp and crystal clear, but I did notice a lot of compression in some of the more demanding scenes, which kind of dampened the experience a bit.\nStill a great experience.\n\nHelpful | 0", "SurfertjeJun 12 at 11:25 AM\nImpressive and FREE\n\nOf course the quality can be even better, but find the 3 documentaries impressive.\n\nIt really feels like standing or swimming next to the animals yourself!\n\nI really would like more areas !!!\n\nAlso a very nice learning environment for children. But then the choice for other (spoken) language would be desirable.\n\nThanks for the experience!\n\nHelpful | 0", "mage789Jul 25 at 1:45 PM\nGreat content\n\nReally fun videos. I would be really happy to see more places added.\n\nHelpful | 0", "EkotarJun 8 at 7:12 PM\nLove it\n\nThis was one of the things I imagined when I first looked into VR. Traveling the world and seeing things in the wild on my couch. I would pay a few bucks per episode for more like this.\n\nHelpful | 2", "robbienolJun 10 at 2:59 AM\nFantastic!\n\nBrilliant photography great fun and educational too. Some similar videos you watch are of very poor quality fuzzy and blurry but this is crystal clear and beautiful. AND ITS FREE ! . You don't get anything much for free these days .\n\nGreat job people !\n\nHelpful | 0", "jason.martino.737Jun 13 at 5:17 PM\nIncredible video quality\n\nThe video quality is the best Ive ever seen. The underwater reef shots are colorful and clear with little artifacting. Perhaps one day, we wont even need to learn how to scuba dive. Borneo and the orangutans were cool too.\n\nHelpful | 0", "randomundertoneJul 1 at 5:18 PM\nGreat start but not there.\n\nI really wanted to love this app but I just couldn't. It's obvious that a lot of time, effort and heart went into making this and it's disappointing to see all that work let down by bad deployment. It's super uncomfortable trying to look at something when ur basically pressing ur nose to an imax screen. It's not VR at that point. Also, and this could just be me, but it took a turn from beautiful and informative, to preachy, then finally to almost guilt tripping. That narrative set against the beauty of the landscape was an instant uninstall for me.\n\nHelpful | 0", "Bigsmile66Jun 8 at 1:57 AM\nBeautiful immersion\n\nUp close and beautiful, just stunning! Just dont move your head around too much as not always rock solid, but thats no big deal!\n\nHelpful | 3", "dazzlerellisJun 8 at 12:15 PM\nPositive well made content\n\nEnjoyed this, really well shot, interesting stories and especially appreciated the positive endings in these dire times, thumbs up\n\nHelpful | 2", "turbosmoothJun 9 at 12:06 PM\nWonderful\n\nThis is the power of VR, education amd transporting yourself to places you might not have the chamce to experience in real life. Wonderful, hope we get more episodes and generally more apps like this! Big thanks to the dev team!!!\n\nHelpful | 0", "SilentHashassin7Jun 9 at 11:07 AM\nVery very nice.\n\nI purchased my VR for gaming but also love visual experiences like this. Quality is nice although the immersion is not what I expected but is totally worth the download and my time.\n\nHelpful | 0", "poetic_is_hereJun 25 at 5:13 PM\nAmazing and educational\n\nThank you for creating this app and educating me. I really hope you continue to update and provide more content.  Well done!\n\nHelpful | 0", "HotnumbersJun 13 at 10:12 PM\nAmazing Adventure!!!\n\nGreat quality. What a wander full tool to educate out new generation. Specially in todays world where YouTube rules. Need to have more adventures like this.\n\nHelpful | 0", "gallon422Jun 9 at 8:15 AM\namazing experience.wonferful contents\n\nit's one of the best video watching App in oculus quest. amazing experience and the video quality is so good. it's must the future. I can see the colour world at home. thanks\n\nHelpful | 0", "Hiv0ltageJun 9 at 4:52 PM\nIncredible!\n\nThe underwater scenes in Raja Ampat were unbelievable. I've never had a VR experience where I felt so close to the action. I wanted to reach out and touch a manta ray.\n\nHelpful | 0", "lsqdg99Jun 8 at 10:11 AM\nlsqdg99\n\nwhat can i say but brilliant will there be anything else in the future like this\n\nHelpful | 2", "Holy4DJun 9 at 12:59 AM\nLove the concept, image quality poor\n\nI love the app, I love what they are doing. Its a wonderful educational experience. The image quality is better than most in VR but this would just rock if it were crystal clear 4K. Im curious does anyone know what breed of dog was seen in the video of Indonesia?\n\nHelpful | 0", "FreddiedudeJun 9 at 1:35 PM\nBrilliant\n\nBest wildlife show ever! The only thing it missing is David Attenborough to narrate it. Cant wait for more\n\nHelpful | 0", "maikmayers81Jun 8 at 8:45 AM\nbeautiful\n\nvery nicely designed app. who has delivered more films to the hat?\n\nHelpful | 1"]