{"App Title": "Electronauts", "App description": "Ever wanted to ride the vibes of a top DJ playing a packed festivals main stage? Heres your chance to shine: all it takes to be an Electronaut is the passion to become one with the beat. Create music with confidence, no matter your skill level, as you make music magic in this VR-exclusive experience featuring 80-plus songs from over 80 top artists across EDM, hip hop, trap, and countless other genres.\nExplore. Experiment. Electrify: Jam on eight digital instruments only possible in VR arrayed on a customizable deck. Record loops and sequences, layer filters, mashup and arrange songs to your style as you make them your own.\nMusic Reality Engine: Electronauts proprietary technology always keeps your sounds bumpin on beat, no matter how much you mix.", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Art/Creativity, Casual, Music", "Languages": "English, English (US)", "Version + Release Notes": "175667", "Developer": "Survios", "Publisher": "Survios", "Website": "http://www.electronautsvr.com/", "Release Date": "June 6, 2019", "Developer Privacy Policy": "This site cant be reached\n\nwww.electronautsvr.com took too long to respond.\n\nTry:\n\nChecking the connection\nChecking the proxy and the firewall\nRunning Windows Network Diagnostics\nERR_CONNECTION_TIMED_OUT\nReload\nDetails", "Developer Terms of Service": "This site cant be reached\n\nwww.electronautsvr.com took too long to respond.\n\nTry:\n\nChecking the connection\nChecking the proxy and the firewall\nRunning Windows Network Diagnostics\nERR_CONNECTION_TIMED_OUT\nReload\nDetails", "Space Required": "1.24 GB"}



["5 stars\n51%\n4 stars\n20%\n3 stars\n13%\n2 stars\n4%\n1 star\n12%", "Sydney_RobsterJul 26 at 1:28 AM\nFun Mixer and Synth Drums\n\nThis app is great for anyone who;\n\n(1) likes the idea of being able to make a mix by filtering out/in different vocals, drum, high hats, etc? It's very easy, no musical skill is required and best of all, no matter what you do, it sounds great.\n\n(2) banging away on synth drums. Again, sounds great, no actual drumming experience needed. I find best results and enjoyment achieved after consuming at least several drinks before or during the set.\n\nWish Improvements:\n\n(1) It had co-op like in the PC version so you could hang and have fun with a mate\n\n(2) an option to gave real drum sounds instead of synth drums.\n\nHelpful | 6", "RealCosmicJul 9 at 4:34 PM\nGot the game working\n\nSo I got the game working thanks to the developers help so thank you for that and despite the crashing issues the game is amazing and I really enjoy it definitely a must have on the oculus quest\n\nHelpful | 4\nDeveloper ResponseJul 9 at 3:21 PM\n\nHey RealCosmic, Apologies for this crashing issue you're experiencing with Electronauts on your Quest. Could you try fully reinstalling the Electronauts app on your Quest, then see if you still experience this crashing issue? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if the crashing persists!", "SquallySugar6 days ago\nIts better than expected\n\nI had no crashes or problems with audio, theres no delay. People saying there is not enough songs, there are about 200. I would pay $100 for this game.\n\nHelpful | 0", "lukianowiczJul 13 at 7:20 AM\nunplayable\n\nFirst 3 times app crashed after trying playing the tutorial... ok, happens.\ndevice restart, try again... crash on entering tutorial.\nOk maybe songs works -> normal single player songs works fine but i have no idea what im looking at -> get back to menu and try launching the tutorial once more.\nThis time it launched, yet I was able to only hear instructions, no video, black screen.\nI can't commend using an app that does't work\n\nHelpful | 2\nDeveloper ResponseJul 21 at 12:17 PM\n\nHi lukianowicz, Apologies for this crashing issue you're experiencing with Electronauts on your Quest. Could you try fully reinstalling the Electronauts app on your Quest, then see if you still experience this crashing issue? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if the crashing persists!", "Chazzbo9 days ago\n\nProbably Good fun if your have no musical ability, crap if you do. All the triggering seems to be loops and has latency. Filters are the only thing the work correctly in real time.\n\nHelpful | 1", "Crystallized_WolfYTJul 11 at 1:39 PM\nnoice\n\n(   )(   )(   )(   )(   )(   )\n\nHelpful | 5", "SaraBell951Mar 31 at 12:43 PM\nLove this game but...\n\nI LOVE THIS GAME SO MUCH but please please PLEASE add more songs or a search where you can search for any song in the world I know it would be a lot of songs to put in but if you could do that that would be great\n\nRegards,Sara\n\nHelpful | 38", "ShadyMace22Apr 13 at 9:56 AM\nGreat Game\n\nThis game is super fun and I love to play it but there needs to be multiplayer. I think there is but I have a Quest so its only single player I dont have much to say but there needs to be multiplayer\n\nHelpful | 7", "Wolfy_WhitefoxApr 24 at 9:12 AM\nNeed more songs and multiplayer\n\nIve love the game on psvr and still loving it on the quest I find the quality is amazing the game is good but still there something missing inside it dear developer if youre reading this I would like to add that you should make a vr server even for 1 dollar a month where people could login and watch you with your friends play this and party from distance also theres no selfie mode and needs to add the colour changing mode with speed level\n\nHelpful | 4", "VerselDarastrix16 days ago\nPlease put more song, please.\n\nLove this game but it could do better with some more songs. Marshmallow and TheFatRat would be amazing add-ons, I'd buy them for a few bucks if you had them (preferably free but it's your call).\nOtherwise this is a great game and I expect to keep playing this!\n\nHelpful | 0", "beullerJan 3 at 12:27 PM\nSo conflicted\n\nThis is tough... on the one hand, this game has made me more excited than anything yet in VR. But I have a quest, and there is a significant delay that makes a central part of the game unusable. And with loops being limited to 4 beats, I am very close to going the refund route.\nInstead, Im scrambling to get a PC set up so I can fully embrace this game. Its absolutely amazing. Please please please devs, prioritize longer loops. Quest hardware is limited and thats understandable, but 4 beat loops are extremely limiting to those of us that love music and want to throw Electronauts parties.\n\nHelpful | 105", "mattjohnholmesJun 20 at 2:41 AM\nOk, needs better songs\n\nNeeds more colours and songs\n\nHelpful | 1", "Meowformebaby20 days ago\nIm no Elvis\n\nI dont have a musical bone in my body but I really enjoyed this.\nBeing able to mess with the samples and the sounds. I love the distortion effect.\nIts a great sensory toy for adults And kids alike.\n\nKeep in mind, Its not really a game though, its not really a music creator either because you cant really create a song with it that you can play back, or save in anyway.\n\nIts more of a live dj booth with stupified equipment and its really simplified and everything automatically syncs to the beat so its hard to mess it up. Its fun to mess around with. Kinda like all the art apps in the oculus store. Theyre fun to play around with and for sensory reasons but are they a serious creation tool? No not really.\n\nHelpful | 0", "SyddieApr 12 at 11:06 AM\nSo therapeutic\n\nKept looking at this when I got the quest and somehow never got round to it and I regret it big time. Please have a look at videos on YouTube. It is so immersive and relaxing mixing the many tracks. I can quite easily be in the one song for an hour and not be bored. You need absolutely no skill. All you need is a love of music. I love this game and I will end up using this more than any game I own (and I own a few!).\n\nHelpful | 0", "Catgamer06Apr 17 at 8:18 AM\nIts a good game but...\n\nI want it to have more popular song\n\nHelpful | 2", "zsoccer_05Jan 30 at 2:09 PM\nDont Buy\n\nThis game would be 100% better if you save your work, which the game doesnt tell you that you cant. Here are the many reasons why this game is not where it should be.\n\n1)There is such a small variety of songs they offer and out if that, you only enjoy maybe five of them. Then, after you are done mashing up the song, it doesnt save, and it gets boring mashing up the same five songs over and over again.\n\n2)Also, when you tap on the music blocks, the sound output is slightly delayed and therefore it is pretty hard to make a good rhythm with the delayed sound. For an example, if you are a drummer and you hit the drum, the sound wouldnt be immediate.\n\n3) After not even 30 minutes of playing this game it gets really repetitive and eventually boring.\n\n4)Finally, the game doesnt give you the best explanation on how to work all of the tools. Some of them are really basic and some really arent. For one of them you have a selection of loops but you dont have an idea on how to incorporate it into the music.\n\nI have always loved to make music on different platforms like apps, desktop applications, and more. I was hoping this game would be another way for me to make music but it just isnt. Devs please fix this and I will be happy to play your game much more often.\n\nHelpful | 51", "EatToast22 days ago\nBest game ever\n\nThis is my favorite Br game and when I was playing I had no problems this game is amazing\n\nHelpful | 0", "Le_CheffeMar 4 at 10:15 PM\n\nIt's pretty dope! I wish there were more songs tho.\n\nSome songs don't really flow well. But when you find the ones that do, it's a lot of fun.\n\nHelpful | 2", "Gamer217Jan 15 at 7:09 PM\nIm freaking having a blast!!\n\nI freaking love this app!! The only thing thats missing is a save button to save music, more music orbs,\nsome drums and different instruments . There is a slight delay when hitting the orbs. Other than that,I am freaking having a blast with this app!! I hope the Devs dont give up on this app . I cant wait to see what the next update will be. Hopefully they will have more special effects ,add more orbs and different music instruments in their next update .Maybe sell some addon packs or something just a thought. This app still gets my vote! Two thumbs up ,five stars! Keep up the good work guys!\n\nHelpful | 7", "thechrisstreet19 days ago\nVirtually unplayable.\n\nThis would not stop crashing, so am requesting a refund.\n\nHelpful | 0", "JacksonMcBigBoiJan 1 at 3:12 PM\nI love it!\n\nI got this game about 2 days ago and I already am enjoying it more than beatsaber. While yes, the graphics leave a little to be desired, its a blast. The only real problem with the game is that whenever you use an instrument like the orbs and/or the laser harp, theres a delay from when you hit it to when the corresponding sound plays, and even that isnt very much of a problem, seeing as you dont even notice it when youre in the groove. Overall, an amazing game to play around with, with or without friends. I even stayed home from New Years Eve parties to play it! I highly recommend this game to anybody who is trying to get into music production, or even if youre not, I still recommend it.\n\nHelpful | 4", "Kellis0289Nov 22 at 4:12 AM\nGreat game with friends or by yourself\n\nMy whole family loves this game. It was funny hearing my dad say \"really?!\" When he first hit an orb. PSVR version has cleaner graphics but other than that it's the same exact game and performs great. Songs are good but some more familiar or popular ones would really boost this to 5 stars but I know licensing is difficult.\n\nHelpful | 9", "brycegarrett32Feb 20 at 5:50 AM\nLove it\n\nCould play all day .\n\nHelpful | 1", "PinkGreaseSep 30, 2019 at 2:09 PM\nPartytrick\n\nI didn't know what to think of this game at first. I realize that it's a pretty good party trick, and fun to stream music from. You can just jam away, and whatever you do, it sounds good.\n\nI get a little frustrated at first with the graphics and textures of some of the spaces, for first time users, they won't be impressed at first sight.\n\nHelpful | 7", "FunnyFireDec 25 at 4:30 AM\nWORTH IT\n\nI would totally buy this game because if you you like music you will love this game, The main point of the game is to make music, and its great!\n\nHelpful | 0", "vrabbitsNov 1 at 9:02 AM\nMeh\n\nGets old fast.\n\nHelpful | 7", "jimbizzyboyfoxybizzDec 5 at 8:17 PM\nThis is fun but ....\n\nNew songs would be great throw a little funk or throw back beat streat in to play with a away to let go of free world stress and have fun\n\nHelpful | 0", "BrendenD34Oct 12 at 12:34 PM\nNo saves no problem\n\nI had an ideas that you couldnt save your work so I looked it up and I found out when I played I never wanted to save my work because I felt that if I did I would have a completely different experience so I was bummed that I couldnt save a couple but I feel like I wouldnt have the same feeling of freshness or surprise when I make something different that sounds just as good and I feel the game wants you to not rely on you old work for inspiration because no matter what you make sounds really good I just enjoyed having so many options to change the music and still finding out I could do even more I would suggest adding multiplayer but I bet the quest cant handle it quite yet and the ability to mix up songs and saving would be nice if you make something you really like but I you really want to save it stream it and download the streamed video off of Facebook you can listen to it out of the game with some exiting so its not like a real way of saving it but I works well enough. Overall I enjoyed this game I think its just as good as beat saber but It feels different than what beat saber is where this is more relaxed and less energy consuming\n\nHelpful | 9", "PHambone06Oct 7 at 4:25 PM\nFun for a bit\n\nThis game seems great at first, but then it slowly gets uninteresting and then is forgot about. It could be a game you can come back to but it seems great and then becomes forgettable. Great game but doesnt keep my interest\n\nHelpful | 3", "The_Guini_PiperAug 21, 2019 at 9:05 AM\nBasically an EDM with pre-made songs\n\nThe app is pretty simple and straight forward. It helps you feel like you're a virtual reality DJ. And a pretty good one. Don't even need to have much musical knowledge. The app compensates for your actions.\n\nOnly two real downsides are that it's all pre-made songs and you can't record without using the Oculus record feature. It would be really cool if you could upload your own sounds and make a completely original song. But aside from that it's a very simple and fun EDM machine.\n\nHelpful | 3", "UmpireOct 6 at 3:32 AM\nFull of bugs and crashes\n\nI saw this game live in an Altspace VR event and decided to try it out myself. It seems like alot of fun but after three tries I haven't been able to play more than 5min before the game crashes. I'm refunding it on quest and will try the steam version with my index instead.\n\nHelpful | 2", "SCreed423Oct 8 at 2:18 PM\nThis is awsome\n\nThis game is sooo good. Its just amazing that you can make music out of music and you can customize your music if you dont like the basics song. Its definitely a must have if your into music and you have an quest\n\nHelpful | 2", "paul.pavelJun 6, 2019 at 10:25 AM\n\nHonestly have way more fun with this than Beat Saber. Very relaxing music-making game thats easy to pick up (and you always sound amazing no matter what you do) but has quite a bit of depth if youre willing to dive in with some of the more advanced tools. Highly recommend!\n\nHelpful | 99", "Tummie555Jul 28, 2019 at 1:21 PM\nNiccccccceee\n\nA feel-good game in it's purest form. But for real. This game does an OUTSTANDING job making you feel like a godlike DJ. Altering the flow of the music on the fly with enough tools and songs to keep you busy for hours and hours. It feels like it's YOUR SONG. I have some friends who've created beats for years, and they were in heaven while playing this. But no experience needed, everyone gets deep into their creation and the result is always satisfying.\nYou CAN SAVE, just not from within the game. Only way to SAVE is to use oculus recording (from oculus home menu).\n\nHelpful | 22", "SoapySonAug 24, 2019 at 8:37 AM\nWow, very impressed\n\nAnnoyed I was put off by prior reviews, this games amazing super impressed by what they've done. Great songs including tokimonsta don't call me, a fav of mine, Childish Gambino. Many samples and sounds extracted for you to jam to, can't help stay in a song for 10-15min jams it's so fun.\n\nYour sounds are always to the beat so will always sound good what you do\n\nHelpful | 4", "clubamericalaraAug 12, 2019 at 7:37 PM\nFor the bedroom DJ\n\nThis is the perfect game for the casual bedroom DJ most of the tracks are electronic music which was perfect. This is not to produce original music but more than anything its to add your twist to original tracks.\n\nHelpful | 3", "Zenik77Sep 27, 2019 at 1:10 AM\nAmazing\n\nThis is an amazing app love this more than beat saber. This needs to be number one. Literally can just zone out to it.\n\nHelpful | 0", "VasagorstJun 20, 2019 at 6:29 AM\nBad version of a great game\n\nI really love the original game. Played it sooo many hours...But the quest version has real framerate drop issues. With a game where you move your head on great beats its totally uncomfortable. Really hope it will be updated... 3 stars cause the game is great and its cross buy (thanks for this) but if I only had this version it would be 2 stars. Need optimisation\n\nHelpful | 21", "Cable312Jun 6, 2019 at 11:59 AM\nFun,rewarding,relexing,WoW\n\nFirst time ever hearing about this app this app made the value of my quest go up like having a full Music studio it is so immersive and fun words cant describe how awesome you feel. runs perfectly on the quest so relaxing and feels really good making your own music this app should be way higher price LOL for how great it is but Im glad its not because I probably wont have it a chance because Im not really into making music but this game is more than making music its relaxing and therapeutic fun and rewarding keep up the great work development team if they make any other apps Ill probably buy them instantly just because this app is so awesome :)\n\nHelpful | 21", "Spidertoes_Oct 27 at 8:19 PM\nThe Graphics are awful\n\nIf the graphics were better I would like it a lot more , but then again I played it for 1 hour and still cant get over the graphics, I hope for them to improve on this issue bc it almost makes it unplayable\n\nHelpful | 0", "Fovea_Jun 6, 2019 at 5:30 PM\nWaste of Money\n\nDont buy this games This game fails to tell you that you cant save your work. It is a play as you go game. They give you a beat and you can mess around with it and thats it until you get bored. You can literally only make one little melody and a few effects. Real bummer. I was excited\n\nHelpful | 411", "robbieloseeJun 7, 2019 at 8:42 PM\nExpectation Management\n\nWHAT ITS NOT:\n1. Its not a game. You wont break a sweat.\n2. Its not a music editing tool. You cant make your own creations or save and share anything.\nWHAT IT IS:\n1. Beautiful. Love the 80s feel.\n2. A slightly complicated setup that lets you apply live effects while exploring the several songs it has.\nIMPORTANT TIP:\nRewatch the tutorial after playing a bit and see all you forgot.\nALSO NOTE:\nOn quest this doesnt close easily like other apps in my experience. Probably all the music samples make it run heavy on the hardware. I just reboot when done and its good.\n\nHelpful | 11", "keebzJul 10, 2019 at 2:08 AM\nIt's a really fun remix toy!\n\nIt's a very fun remix toy, not an instrument. Anyone complaining about a lack of save or export features really doesn't understand what this is. This is basically a compilation of great music that you can play around with for as long as you like. It's weirdly meditative and relaxing really. If I had any constructive criticism, it's that it's also not a game, but everything about it's marketing and even the tutorial voice in the software presents it as a game. That had me looking around way too long thinking I missed something.\n\nHelpful | 2", "frozengardenJun 11, 2019 at 9:25 PM\nA very lonely experience.\n\nI love the concept. I enjoyed experimenting with the instruments. Love the tracks included. However, Im returning it. The reason is simple. It is a very lonely experience. You are basically playing to an empty tunnel. Yes, you can stream it to a TV so your friends can see what you are doing. But they see you. You however are still all by yourself in a virtual world playing to an empty tunnel. Some may say that this is only a music game, but ask yourselves: Why then will the devs. go for the DJ look? Doesnt that make sense? DJ + crowd? Helloooo. I doesn't need to be overly complex. Perhaps a simple silhouette crowd with some lights thrown in for good measure. For this simple reason the experience as it stands, falls short. Dear devs, make me believe that what Im doing in your experience/game/world matters. You do that and I will purchase it again.\n\nHelpful | 20", "J2JNGSJun 7, 2019 at 7:50 AM\nGreat experience hampered by stuttering\n\nI'm wondering if this game was delayed from launch because the devs couldn't get the framerate right. Great selection of songs and very enjoyable to remix on the fly so it's just a shame that the stuttering of the text and tool displays can take away from the flow of the music. Hopefully this can be smoothed out in a future update?\n\nHelpful | 9", "xman7Jul 2, 2019 at 6:18 AM\nLots of fun\n\nLarge selection of songs to choose from you can really get lost in the immersiveness of creativity. It's probably the best music game you can only experience yourself. Wish you was away with others can hear it\n\nHelpful | 1", "drhartleyAug 11, 2019 at 8:39 AM\nLack luster\n\nWish it had real instruments or even just more options. After playing a few times, you've played it all :/\n\nHelpful | 2", "tenacious-tAug 19, 2019 at 4:43 PM\nIntuitive, creative, and fun!\n\nImmersed in an awesome experimental experience that feels creative and rewarding\n\nHelpful | 1", "SharpstermanJun 10, 2019 at 10:42 AM\nThere is great potential here\n\nFirstly, I want my hands and arms to look like the guy in the picture. The graphics need an overhaul. The music tracks are great! There is plenty of DJ variation from dubstep to chillwave. A lot of effort was put into the instruments. There is a 3d cube synth! Also there needs to be more stages. I want to DJ for a huge crowd of people in a stadium or a downtown place. Please keep updating this.\n\nHelpful | 0", "duanewoodsJun 18, 2019 at 4:17 AM\nWay more fun than I was expecting !!!\n\nI was having so much fun creating my own mixes!! I would literally be playing for over an hour at a time because I would get lost in creating music its so much fun. Once I went through the tutorial to understand how to play I was off and running. If youre a creative type of person that loves music I would highly recommend this app. My one negative was I wish there was a way to record what you do but the experience of making music was excellent!!\n\nHelpful | 8", "technoticJul 9, 2019 at 1:12 AM\nGreat release, lots of room to expand\n\nI'll be honest, I'm a huge music game addict, I used to DJ trance and progressive, private parties and a couple small venues, done a few remixes. My favorite music games ever were DJ Hero 1 and 2.. When I saw this release post on Twitter, it took me less than 10 words of reading to purchase! The price is great for what it is. Only 4 stars because I feel there are some missed opportunities. Would love to talk to the dev team with some ideas. The tutorial is well done; you know enough of what you're doing after completing it. Some of the controls could be a little reworked for smoother transitioning, since this is purely a real-time remix. Options for more immersive visuals in the \"tunnel\". Maybe different scene options.. All of this said, I don't regret a penny I spent on it.\n\nHelpful | 8", "OnlyRevolutionsJun 6, 2019 at 5:44 PM\nPure Joy\n\nI havent played long, but if youre musically inclined at all or just enjoy making music in general, then you should get this. If you happen to enjoy making electronic music, then youll just absolutely sh*t your pants. This is the easiest game to get lost in. Its almost the Tilt Brush for musicians. Its ridiculously fun so far, creatively invigorating, and overall a pure joy. Im hoping the content never stops coming for this one.\n\nHelpful | 11", "mattjohnson817Jun 11, 2019 at 3:51 AM\nFun for a second\n\nAs an electronic music producer I understand everything that's going on in this game and boy there are so many missed opportunities. Easy things you could have added to make this game playable forever. The most obvious being playing your own beat. You already have the orbs system which would work perfectly. Load up a different drum/percussion sample into each orb and let up play our own beat. Another thing is the recording system. Let us record each part of a section orbs/drums/grenades/fx/vocals and then play them as a whole all together aka full intro/break/drop etc. And then combine all those to play our own full song. I get this is made for anyone just to fool around in and it will always sound good, but add those features and this game is awesome for way more than a few minutes.\n\nHelpful | 7", "tristan116Jun 25, 2019 at 7:34 PM\nMixed feelings\n\nI played this in psvr and I don't know why but this game took a big hit on the quest , the gameplay feels the same but it just feels hollow like everything is made of cardboard or something don't get me wrong you can still have just as much fun with the quest version but it's definelty an inferior version to the rest , I'm really surprised as most games hold up really well on the quest , I may be wrong about this but I'm guessing the Devs wanted to maybe aim for a longer lasting battery while playing by lowering the demands of the game so it lasts more of a party or something?\n\nHelpful | 0", "kt9mangoJun 14, 2019 at 3:24 PM\nLoading (updated)\n\nAfter the splash screen you just get a black screen\n\n(Update) - Thank you for your suggestion to fix this devs, it worked and I can now pay the game. Thank you :)\n\nPROS: Now that I can play I can report that this is very fun and entertaining if you like mixing or making music tracks. Some people have said you should be able to save the songs but I believe that the point is that you are mixing live, on-the-fly. Lots of songs to choose from and some good tools.\n\nCONS: Performance is a bit choppy which can induce VR sickness. The loops that you can record should be 8/16 bars long. Would be nice if when choosing a new song it faded/mixed into the next track.\n\nHelpful | 2\nDeveloper ResponseJun 8, 2019 at 9:38 AM\n\nHey kt9mango, Apologies for this loading issue you're experiencing. Could you try full re-installing Electronauts on your quest? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still having loading issues after re-installing!", "Twistedchild420Jun 6, 2019 at 6:41 PM\nAmazing\n\nI had no knowledge of this game previous to the Quest release. Some of my favorite music based VR games are Audioshield,Beat Saber,Synthriders, and Audica. And I can easily say this one is right up there with those! It's very different but a lot of fun. Don't go in thinking it's a full studio. It's just something to hop in and relax with. And at the very least you can record your game play. Also has a ton of songs! Quite the lovely little Quest surprise! Buy it if you like Trap and electric music or just music in general!\n\nHelpful | 3", "djase1Jun 7, 2019 at 6:49 AM\nChill music game\n\nIn a nutshell, this game provides you with a number of songs and let's you endlessly remix the tracks. You can add effects, record short note sequences and mute instruments. There is no score you are trying to beat, there is no story and no way to record what you create. It's very much centered in EDM style music, so buyer beware if that's not your thing. I would classify this as a meditative or chill experience. I find it relaxing and charming and I look forward to more features hopefully in the future. Multi-player would be a blast. Worth the money if you are into creating sounds and playing music. Easy to get started but has some surprising depth.\n\nHelpful | 1", "EvillienJun 7, 2019 at 11:03 AM\nFun and relaxing\n\nI agree with all the previous reviews. It's relaxing and fun but there is room to improve. For example saving your tracks and the visuals are not great.\n\nHelpful | 2", "BRDMANEJun 6, 2019 at 7:08 PM\nDope\n\nAwesome game. Had a blast. Was straight jammin. Only thing was I wish it was louder on the quest. Haven't tried it with headphones or a speaker but I'm sure that would make it even more amazing.\n\nEdit: Tried with headphones. Much louder and you can just get lost in the music.\n\nHelpful | 4", "Two_Eye_JackJun 6, 2019 at 1:05 PM\nInstallation Issue\n\nUPDATE: Changed my earlier rating.\n\nSeems like Electronauts wouldn't launch if installed from the Oculus iOS app. After uninstalling it, I reinstalled it from the Quest itself. Now I can get past the title screen and enjoy this terrific portable version.\n\nHelpful | 6", "cdysggs11Jun 10, 2019 at 10:43 PM\nFun and Amusing\n\nLove making music on this app. Only Con is that you cant record just the Mp3. Can still record the video and convert to mp3... In my opinion its definitely worth the purchase.\n\nP.S. really fun on drugs.\n\nHelpful | 7", "rclaw1Jul 25, 2019 at 1:43 PM\nVery good\n\nThis is brilliant, plus it's crossbuy\n\nHelpful | 1", "OnematepoetikonJul 23, 2019 at 12:09 PM\nDoesn't work\n\nLogo on startup and then just a black screen and nothing happens. This on a brand new set.\n\nHelpful | 1\nDeveloper ResponseJul 25, 2019 at 11:23 AM\n\nHey Onematepoetikon, Sorry to hear you're having issues loading the Electroanuts app. Could you try fully re-installing Electronauts on your quest? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still having loading issues after re-installing!", "ramielkerdaniJun 27, 2019 at 5:54 AM\nApp won't open\n\nThe app freezes after the welcome logo and fails to load.\n\nHelpful | 3\nDeveloper ResponseJun 27, 2019 at 12:00 PM\n\nHey ramielkerdani, Sorry to hear you're having issues opening the Electroanuts app. Could you try fully re-installing Electronauts on your quest? To uninstall an app from your Oculus Quest headset in VR: - Put on your headset and select Library. - Hover over the app that you want to uninstall. - Once it appears, select the three dot menu. - Select uninstall. Please contact us at support@survios.com if you're still having loading issues after re-installing!", "daniel.geoffroy1Jun 27, 2019 at 12:38 PM\nA disgrace\n\nNo crowd, crappy songs\n\nHelpful | 3", "SurfeliteJun 6, 2019 at 10:49 PM\nSo siiiick!\n\nDropping beats yo. Visually stunning and immersive. The tracks, effects, controls...amazing. Get it!\n\nHelpful | 3", "cheddleJun 7, 2019 at 3:00 AM\nSo fun!\n\nSo much fun!!\n\nHelpful | 2"]