{"App Title": "Elixir", "App description": "Elixir is seeking an experienced lead sorceress . . . 's apprentice. Youll join our team located somewhere in the nether world to feed, wash, and document mysterious creatures (applicants inexperienced with dragon vomit need not apply). The apprentice will also maintain various delicate contraptions while experimenting in an unstable alchemy lab. Constant praise of the sorceress's brilliance is expected.\n\nMust be certified in the quantum manipulation of elemental magicks as they relate to the Oculus Quest device. Availability to work on-site FOREVER a plus. \n\nNo pay.\n\nPlease staple a death certificate to your application in the top left corner angled at precisely 45 degrees (must be your own death certificate).\n\nFURTHER RESPONSIBILITIES\n* Quietness and obedient-ness\n* Maintaining a gullible but enthusiastic temperament\n* Teleporting hither and yon\n* Daily calisthenics of the fingers and the hands\n\nElixir employees enjoy zero benefits, no medical or vision, and an open office setting.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Roomscale", "Supported Controllers": "Hand Tracking, Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Adventure, Casual, Narrative", "Languages": "English", "Version + Release Notes": "0.1.2337", "Developer": "Magnopus", "Publisher": "Oculus", "Website": "http://elixir.magnopus.com/", "Release Date": "May 22, 2020", "Developer Privacy Policy": "None", "Space Required": "1.14 GB"}



["5 stars\n42%\n4 stars\n16%\n3 stars\n11%\n2 stars\n5%\n1 star\n26%", "mjg298May 23 at 1:13 AM\nGood demo but the voiceover will annoy\n\nA good quick introduction to hand tracking in a game. The hand tracking works very well largely due to the simplicity of what you do with them. The narrator however does gets very irritating very very quickly and you feel like you are rushed through the experience too quickly (maybe 10 minutes at most) even when you do the final exercise with the pen and it just cuts out half way through. I did laugh however when I followed the narrator's instructions to the letter and a developer had to step in and tell me to ignore them  I did have to grab the controller's to exit the game as it wouldn't recognise the hand signal for the oculus menu - but that's no big issue\n\nHelpful | 221\nDeveloper ResponseMay 23 at 8:02 AM\n\nI'm glad you found Emily's Easter egg!", "kaos_nightmareA day ago\nCant complete tutorial?\n\nSeems like it should be fun. The controls can be a little glitchy. However, neither my son nor I can get past the initial tutorial stage. Were busily stabbing the eye balls and finish off a few, then she tells us to go away and come back in 400 years. Theres no feedback of what weve done wrong (maybe too slow?). Slightly surprised this wasnt found in play testing, but maybe we are super bad players ;-)\n\nHelpful | 1", "Morgus123Jul 18 at 10:08 AM\nCool but there are some problems\n\nProblem1: teleporting is a bit annoying when the voice tells you to make a triangle with your fingers and when I did it it just would not work to let me teleport\n\nProblem 2: no free exploration really you cant choose to play with the powers without getting sent this is my biggest issue with the game you cant just play around with the powers you get if you don't get rid of the eyes you get sent away, if you get rid of the eyeballs you get sent away they should make it so that you can play with the powers and you can change the powers like you can change the posing hands to squid hands and back to the poison hands\n\nProblem 3: the person who talks\n\nShe keeps on talking and it gets annoying\n\nHelpful | 5", "PeptoBismol_Papa9 days ago\nIts good but glitchy\n\nI played it once and everything went great. Its a fun game that Id like to experience again, though now whenever I try to play it again it seems like Im moving around all over the place when Im not. Its like this in the loading screens and at the start. Im not sure if it would be doing that throughout though, as I cant seem to stand still enough to even get past the start. Ive tried uninstalling and reinstalling but it didnt do anything. Its somewhat frustrating since I would like to play the game again, but it just seems impossible with this glitch. Ill try to see if I can fix it myself but I doubt it.\n\nHelpful | 0", "ecromptonMay 22 at 11:24 AM\nThis was one of the best OH WOW moments\n\nHaving my fair share of \"wow\" moments from being a kickstarter DK1 riding a rollorcoaster for the first time all through now, I have to add this as one of them. WHen i first tried hand tracking in the interface, i thought, oh this is neat, but i couldnt really do much but use the GUI. This is the first ap I have used that is made for hand tracking. For the first few minutes of this app i thought, this is cool, but then it happened. I dont want to give qny spoilers so i will just say it is the first time i really didnt feel human in VR\n\nHelpful | 311\nDeveloper ResponseMay 22 at 8:00 PM\n\nI've been trying to come up with a response for hours, but I simply cannot. As a developer since the DK1 days, this means a tremendous amount to our team. Thank you for your kind words!", "powney1991May 22 at 6:08 PM\nDawn of a new era in VR\n\nIt was so good to finally play the game Ive seen many times in the hand tracking advert for the oculus quest and it didnt disappoint! Intuitive, humorous and a definite wow factor with the revolutionary full hand tracking controls in the game! Would give it 5 stars however the teleport system is a little hit and miss and it was becoming quite annoying to try and master it after a few attempts. Apart from that though, brilliant game to get things started with the hand tracking revolution of the quest!\n\nHelpful | 37", "Orinades22 days ago\nImpossible to get past the opening scene\n\nWhen I start up the game and get to the scene with the title and the tablet Im supposed to put my hands on, Im some distance away from the tablet and need to somehow get to it. There were absolutely no prompts given for how to engage in locomotion to get to the tablet. Holding my hands out in front of me does let me move around, but only in a very uncontrollable manner. No matter what I try, I cant get in front of the tablet long enough to put my hands on it for a few seconds. At such an early point in the game, it is very disappointing to have my experience cut short by such a game-breaking flaw.\n\nHelpful | 6", "Parzival120May 22 at 8:33 PM\nGreat game but way to short and buggy\n\nIt was a good game but the gameplay was way to short it only had about 10 mins of playing time and then the game just starts over so you can't just have a little fun by yourself and after I replayed it the 3rd time the teleportation just wasn't working anymore. But it is a great game.\n\nHelpful | 30", "amante63May 31 at 8:39 AM\nSet Hands Tracking in Oculus Menu\n\nI can not find any menu in this app, can't even get past the activate hands tracking in oculus menu floating around when the app first starts. I went into settings and device, the activate hands and controller is activated in there, both that one and auto detect are blue indicating that they are turned on, can I get some help with this :-/\n\nUpdate; figured out the hand issue (no thanks to the developer/Oculus) UtUBE is awesome.\n\nApp still sucks though, @ the Elixir startup with the floating berries and the two hands you need to touch but won't stay still long enough to do so, is the piller with the two hands on it that you need to touch supposed to be moving/floating all over the place or is something wrong with the app??? Most frustrating experience that I've had since buying Oculus Quest :-( !!!\n\nUpdate; This app will not work in room scale ??? why not sure, but I was finally able to get it to work when I changed to stationary. You will need to set the stationary in an area where you can still stand during the game, because you will need to be able to turn yourself in 360 degrees as the game is immersive when you're able to play, pretty fun now that I can actually play (so no longer sucks) :-) but very very short ;-(... moved up from 1 star to 3, so I hope this helps any of you guys whom may be having these kinds of issues (developers/Oculus never lent a hand in explaining/helping out with any issues I was having) good luck!\n\nHelpful | 12", "melanie.allen.520May 23 at 9:46 PM\nI cant even get past the first step\n\nWhen I do the teleport/moving gesture it simply doesnt work, I looked at one of the devs videos on ways to do that gesture, but nothing, but the hand tracking is good and so far I like how it looks, so 3 stars, please make it easier teleport.\n\nHelpful | 41", "Pichi01049 days ago\nGreat Game and shows the future of VR\n\nThis game is cool. Short but nice. The teleporting is okay and the narrator sounds...... risqu....... but overall the hand tracking is awesome. I found Emilys Easter egg (I think thats her name) and it was fun to see what that pens if you do the right thing. I hope more games come out with hand tracking. I also like what happens if you bring the controllers. (Put those away apprentice!) this game is super cool. Try it out \n\nHelpful | 0", "tcmgamingMay 22 at 11:55 AM\nBetter then expected\n\nI thought it was a fun demo that showed the potential of hand tracking and implemented a lot of really unique ideas with how your hand can change to solve problems but it didnt do a lot with that idea. I felt that the teleportation system was very clever but didnt always work. In the end I felt like this was a great experience and the devs did a great job but I was left wanting more.\n\nHelpful | 41", "Dampfishb0neJul 28 at 1:32 PM\naudio problems\n\nso far the graphics look great and im excited to play. however, theres no audio for the game; no voice over, no music, nothing.\n\nive heard other people have this problem and once its fixed i will change my review\n\nHelpful | 0", "mattphotoJul 14 at 5:58 AM\nMovement system buggy\n\nHand tracking is imperfect. Even with the best light and perfect hands, it simply is imperfect. If you go into this demo knowing that you will have a better appreciation for how well this demo handles it.\n\nUnfortunately the innovative movement system is simply broken. Three out of three plays I got locked due to the movement system breaking. It simply would not take the input for selecting a position, while it was recognizing my hands just fine.\n\nHelpful | 0", "BEKFAST_DAB_PDJun 1 at 1:12 AM\n\"Put your hands like this\". I DID. LOTS.\n\nI'm sure this is a very good game, it had good graphics from what I could tell. Which wasn't much. At the VERY BEGINNING! The lady has me do a sign with my hands. I did. Nothing happened. I paused and resumed a couple of times, and that somehow triggered it, so then it said to keep doing that sign, and aim. I DID. NOTHING HAPPENED. Perhaps this is just my headset or something, but I didn't expect something to go wrong in the very FIRST SCENE.\nI will probably leave an actual review once the game actually triggers its sequences.\n\nHelpful | 6", "CongratulationsMay 23 at 8:01 AM\nIts ok.\n\nIts ok first off its short I mean finish in 10 minutes I guess its just to show you hand tracking, just wish it had more. The graphics ok. I shouldnt complain its free.\nThis app is really for people you want to show hand tracking.\n\nHelpful | 15", "lowresferret11 days ago\nGood hand tracking experience\n\nThe hand tracking is fine but still a nice experience but the voiceover can be annoying and is a little short but a good intro to hand tracking\n\nHelpful | 0", "gavin.stinson21 days ago\nboring\n\nthe entire game is just a few minutes and i had no idea what i was supposed to do. catch the eyes? this was a waste of time all be it a small amount of time.\n\nHelpful | 0", "DireWOLFSJul 10 at 4:38 PM\nJust beginning\n\nIts free its hand-tracking but its new.I wish they had lot more content.Once they get more content will give better stars.Also when they tell you not to open up the eye box they actually want you to open it.I stood there not opening up the box till they said you are supposed to.\n\nHelpful | 0", "RoreoOreo9 days ago\nWay to short\n\nThis is a really good game to show off the power of the quest but it was really short and very boring\n\nHelpful | 0", "knucklepuck907Jul 11 at 12:37 AM\nI love this game but\n\nI love this game but. I is very short but it makes since it is free but it could be a bit longer and still be free. Never the less this is an amazing game ( on a side note wear head phones if you are not alone because the womens voice sounds kinda weird to say the least)\n\nHelpful | 0", "Kyle.AEJun 5 at 7:34 PM\nFun til it stopped working\n\nWas able to play the whole game twice but now everytime I start the game I can't place my hands on the stone to begin. The stone just keeps flying away everytime I move. Tried restarting, uninstalling and reinstalling etc. No luck. It's too bad because this game was a ton of fun to show off hand tracking to my friends and family.\n\nHelpful | 3", "xuwugameMay 27 at 8:46 AM\nToday is a very memorable day\n\nAlthough this demo is rough and sometimes gets stuck, it shows the potential of the next generation of interaction, which USES magic to transform hands and possess superpowers.\nHave space to improve,including:\n\n1.Sometimes the hand disappears.\n2.Sometimes moving gestures doesnt work.\n3.I can feel the response delay.\n4.The final signature recognition doesnt work well.\n\nHelpful | 8", "LemonNitrateJul 27 at 4:07 PM\nGreat way to show off hand tracking\n\nThis little demo is a fantastic way to show a friend or family member hand tracking for the first time outside of the home menu. Its not really a game, it more shows off what can be done with hand tracking, and the entire experience is 15 minutes MAX. I really do hope a full game is made out of this though. It does somewhat hint at that in the end.\n\nHelpful | 0", "ProtastingJul 6 at 9:10 AM\nVery nice game!\n\nIts a very fun game and the tracking was working very well for me, but when my friend try it, the hand tracking wasnt working. He couldnt complete the tutorial with hand! His hand is more little than mine, so it can be the\nreason of the bad tracking...\n\nHelpful | 0", "TheGoddessJul 21 at 7:12 AM\nGive me more!\n\nI loved this game, it was super creative. My only wish is that it had more then a few minutes of play time! I would have liked to explore a little more. Otherwise it was amazing.\n\nHelpful | 0", "Buchibo_Jun 30 at 5:31 PM\nTrailer has more content than the game\n\nI was eyeing this for a long time because I was excited to have a hand tracking experience on the quest. I knew it would be short but this was way too short. I finished it and was asking myself, is there a chapter 2? This was just so short. It lasted about five minutes. I was super disappointed because I had heard of elixir a while ago and was super excited for its release, but this just... wasnt good. I Understand that its hard to make a hand tracking experience, but it almost seems like the trailer was longer than the actual experience itself. This just doesnt really show what we can do with hand tracking. It just felt like I was going through the motions, rather than actually experiencing it.\n\nHelpful | 4", "Elise4490Jun 25 at 8:36 PM\nI cant even play....\n\nI heard how good this game was from my friend so I decided to download it and try it myself. Going into it I was very excited and used hand tracking. It wasnt until I got to that stone hand thing that I had major issues. Its hard to explain, but basically I couldnt stay still, kind of like I had to move my Head around to get to that stone altar but I couldnt stay still. I kept resetting my quest and the game but nothing was working, even the logos in the beginning were moving around and not staying still. I am highly disappointed.\n\n\n\n\nEDIT- it was a guardian issue, if anyone else has the same problem just recreate your guardian\n\nHelpful | 1", "sputukMay 25 at 10:35 AM\nFun intro to potential of hand tracking\n\nThere isnt a lot to this, so dont expect hours of entertainment, but its free and it does show off what the hand tracking can do and how intuitive and immersive it can make content.\n\nI hope this helps inspire developers to embrace this capability - but I recognise that we need similar capability on multiple platforms for devs to invest in being this innovative in interface design or else they have to create content that can work with hands or controllers, and thats much harder.\n\nSo - give it a go, and see what we might have to look forward to if were lucky :)\n\nHelpful | 3", "34thughesJul 18 at 10:01 AM\nGreat introduction to hand tracking\n\nThis game deserves more than its current 3 and a half stars! Its not a game really, but an experience. I dont mean this in a pretentious way. It is a game/tutorial to introduce hand tracking, and it does a good job at this. With this is mind, it is a magical experience. I had no technical issues with the game, so I hope this is fixed for the rest of the community. This game is a starting point for what hand tracking in games could become!\n\nHelpful | 1", "VrylxJun 21 at 12:12 PM\nFun\n\nGame is fun, but the hand tracking can be frustrating sometimes. But thats expected, because hand tracking is new to oculus. I wish the game lasted longer though. I was disappointed to find out its just a demo for hand tracking. Its REALLY fun and would make an awesome full game, but unfortunately the gameplay only lasts about 10-20 minutes.\n\nHelpful | 1", "APG3488May 23 at 9:54 AM\nDoesnt work.\n\nThe movement feature doesnt work. After restarting the app many times, it still wont work. I did the gesture and the L on both hands but still nothing. Can someone tell me what Im doing wrong? It only works on your first try using it\n\nHelpful | 94\nDeveloper ResponseJun 5 at 5:18 PM\n\nHey there! We value your feedback and hear you. We just released a new update that should address the issue you are running into. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "JioxxMay 24 at 11:33 AM\nExcellent Demonstration!\n\nThe Quest's new hand tracking feature feels a little clunky and glitchy in the two full games I tried, The Curious Tale of the Stolen Pets and Waltz of the Wizard, but in Elixir, which was designed specifically for hand tracking, it works great.\n\nJust keep in mind the hand tracking will fail if you get your hands very close together, so don't touch your fingertips together when you're making the teleport gesture. This makes sense from the computer's point of view since the silhouette of two hands touching, or occluding each other, probably doesn't look like a hand to AI trained to look for two separate hands.\n\nThe experience in Elixir is really a lot of fun. It would be a great introduction to VR, but I've been using VR almost on a daily basis for around four years and I had a blast with it also. It's one of those VR experiences that can quickly instill a sense of wonder and completely mesmerize you.\n\nI really hope the team that developed this releases a full game. I want to give them some of my hard earned money! :)\n\nHelpful | 13", "WonderTrashy1144 days ago\nGreat indriduction\n\nI had no problems with this game its a quick fun way to learn the basics of hand tracking and its free!\n\nHelpful | 1", "sage.bond.2000May 22 at 4:11 PM\nSeems like the groundwork for a game\n\nYou guys put a lot of effort into this game. I would love to see more of it. Maybe it's sequel that I could buy. I would love to give you guys some money for another experience like this but longer. I'm loving wizards of waltz right now. So obviously I would pay for another wizards game. Thanks for the great free experience.  I can't wait to show my friends.\n\nHelpful | 11\nDeveloper ResponseMay 22 at 5:56 PM\n\nThank you! It's always great to hear you'd like to see more!", "Danu_Jul 12 at 12:50 PM\ngood for being free\n\nits a bit boring because its soooo short but i cant really complain because its free. i want a larger game with the same mechanics because i really enjoyed it\n\nHelpful | 0", "RainsThePersonMay 22 at 2:09 PM\nFun, short experience.\n\nThe game is a short and simple introduction to hand tracking. One problem is that the game has a weird way of moving but I guess it expected.\n\nHelpful | 16", "DaBeast2707May 29 at 8:32 PM\nGreat, but teleportation is a bit tricky\n\nVery fun, and an amazing introduction to hand-tracking. Im going to get to why I left one star off. I found that the hand gesture for teleportation is quite hard for me and it takes me about a minute and sometimes two or more to make it work and get around the environment. The gesture for telepath in Waltz of the Wizard seems a lot easier to me. Although it may be just me that has this problem, but I do have it. That is my only complaint.\n\nHelpful | 2", "RockteurMay 24 at 7:38 PM\nThis game is completely broken.\n\nThe teleporting flat out does not work. As a launch title for hand tracking, this is a frustrating disaster of an experience. Also, this game is a BLATENT rip off of Waltz of the Wizard, shame on Facebook for ripping off those devs. Do not waste your time with this game.\n\nHelpful | 24\nDeveloper ResponseJun 5 at 5:24 PM\n\nHey there! As the developer it is important that the oculus community is able to experience Elixir as it was intended. We value your feedback and hear you. We just released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "KidnapKermitJul 9 at 8:36 PM\nOverall a nice game!\n\nHonestly this a pretty good game. Its a nice start to introduce hand tracking. I know some people did have issues with the hand tracking, I did to at first. The hands kept disappearing and it was really hard to move around. But I think I found a solution? You may be playing in a dark room and the cameras on the VR cant keep track of your hands. I dont know if this was your exact problem but once I found better lighting the game worked great! I dont know if this is a demo but its really short. I finished it in about 5-10 minutes. But overall the game is well designed and thought out!\n\nHelpful | 0", "berickphilipMay 27 at 2:42 AM\nTeleport DOES work just keep hands apart\n\nFirst, a tip for people with small playspace: just re-center the game around you (hold the Oculus button on right controller) when needed.\n\nA lot of people are complaining about the teleportation not working after the tutorial for it. That happened for me too. For some reason during the tutorial it is fine to completely join both hands in a triangle pose, but after that this same hands pose leads to loss of tracking and/or erratic input.\n\nJust keep both hands a bit apart. You don't even need to make a correct triangle, just kind of an approximate shape.\n\nThat said, the narration is too irritating, on the dumb and childish side.\n\nAs far as content, yes this is just a very brief tech demo.\n\nIt is free, and for that I give it 3 stars.. had I paid any money for this I'd ask for a refund. As a free experience it's ok-ish.\n\nHelpful | 2", "BigBoiBobIsHereMay 25 at 10:00 AM\n\n\n                                                good game\n\nHelpful | 83", "EepertonJun 11 at 7:04 PM\nGreat experience, just too short\n\nThis is a great game, no doubt, but it's simply too short. The hand-tracking is incredible, the game is funny, and the visuals are great. It was very fun to play, but it ended so quickly! I was only able to do a few things and then it was over. I really hope the developers add a lot more to the game (maybe different activities every in-game day) and continue to work on it. Overall, a great game, just not done in my opinion.\n\nHelpful | 1", "Ralf_TJun 23 at 12:01 PM\nA nice introduction to hand tracking\n\nHand tracking is a great feature of the Oculus Quest and this is a nice way to try it out. It's basically a short demo, bit it gives you a good impression of what can be done, but also what can't be done using your own hands in VR.\n\nHelpful | 0", "Teddy.ShervheimMay 22 at 5:01 PM\nHOW TO TELEPORT!\n\nSo i had sooooo many problems with teleporting but you dont have to make the exact shape of Hans hands just make Ls I hope this helps it took me a while to figure out\n\nHelpful | 62", "CharlieSayNoJun 8 at 6:42 AM\nfantastic hand tracking tech demo\n\nAny negativity in the reviews about this fun little hand tracking tech demo is missing the point (it is free after all!)\n\nI have not been a fan of hand tracking in the Oculus Quest menu as it has always seemed clunky compared to the touch controllers. This demo quickly convinced me that there are some exciting possibilities for future games to use hand tracking input.\n\nEither way, Elixir made me smile from start to finish and I loved the cartoon art style and OTT pantomime narration - what more could you ask?\n\nHelpful | 0", "FijiwijiJul 10 at 1:52 AM\nOk demo but too short\n\nI think this is the shortest vidoe game i have ever seen, EVER.\nBut it is free so.. \n\nNot worth the space in my quest.\n\nHelpful | 0", "Fred_G_21Jun 5 at 4:28 PM\nA needed experience.\n\nThis fairly new game is great for vr newcomers and people who want to try hand tracking in a game which they don't have to pay for.\n\nIt is a great experience which has a lot of potential and could achieve a lot of possibilities.\n\nThe only problem is that it is quite short. It could've been a bit longer.\n\nHelpful | 0", "imperfect-key478Jul 5 at 7:40 AM\nNo replay value\n\nGood way to show hand tracking but some objectives are very vague and its kinda boring to play. I think if you want to see how hand tracking works, download it but its really disappointing. The teleport is hard to do because you have to do a certain gesture and if you dont listen, you wont know what to do. Good if you want to see how hand tracking but I wouldnt recommend it.\n\nHelpful | 0", "ThinkHyperMay 27 at 1:54 PM\nWow, such bad\n\nI cant even teleport! I make the L hand gesture and the teleportation thing doesnt pop up! I looked up YT videos and they do it almost immediately but when I make the gesture all she does is say like Do what Hanz does or stupid thing like that. I make the L, hell I made the exact shape the hands were showing me! Worst game ever, I was excited and it failed my expectations tremendously\n\nHelpful | 11\nDeveloper ResponseJun 5 at 5:25 PM\n\nHi there! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "Iron_Ninja247May 22 at 4:15 PM\nI would like to play the game...\n\nI cant even get into the game past the put your hands on the rune section because it wont stay still long enough for me to move I mean what the hell?!\n\nHelpful | 36\nDeveloper ResponseMay 23 at 9:37 PM\n\nTry setting your Guardian to Stationary or redrawing it.", "GamfuMay 24 at 11:59 AM\nA glimpse into the future\n\nSent here by my boy Ralph! Being one of the few apps on the market with hand tracking enabled, Elixir is an amazing glimpse into what the future of VR interaction holds. With it's fantasize style you're pulled into a sorcerer lab to do her bindings. Along the way you discover new and engaging abilities that produce wacky effects when implemented. All with your hands, no controllers need. The hand tracking in this game gives a whole new meaning to gaming immersion, and is an experience one won't soon forget. It would be great if the next game was about NINJAS!\n\nHelpful | 5", "thicccburgerJun 1 at 8:28 AM\nVery good showcase of hand tracking\n\nAt the very core this is what this app is about, showing off the capabilities of hand tracking but some people unfortunately fail to understand that 1. Hand tracking is a brand new type of controller that just fully released so it will not work perfectly to everyone's standards. 2. That you need to have a lot of light for the cameras on the quest to effectively track each hand, i fully understood that and that allowed me to teleport, touch the runestones in the beginning and to interact with everything in the game. If you don't have enough light in the room then your virtual hands appear and disappear. But anyways this is a great game even if it is short it is free and worth it if you like these type of games.\n\nHelpful | 0", "GrahamFam201822 days ago\nBest game ever\n\nThis was so fun i cant wait for the full game and be needs more gams like this i like be this game we need more endings\n\nHelpful | 1", "scotty341Jul 7 at 2:53 AM\nWorth checking out.\n\nA nice free experience that only lasts about 15 mins but doesn't overstay its welcome and shows off hand tracking well.\n\nHelpful | 0", "theshorthipanic_yaniJun 29 at 3:59 PM\nGood but too short\n\nI was hoping for an extensive experience but it was too short. If there is an extended edition then I would have rated it better\n\nHelpful | 1", "TwitchyTwistJul 16 at 11:10 PM\nFree and fun to test new features\n\nIts free and its a really cool way to test the hand tracking features.\n\nMy brain even played tricks on me, making my hands tingle when I placed them in the green slime.\n\nGive it a go \n\nHelpful | 0", "redwoodfern1May 29 at 9:42 AM\nNot enough room to play\n\nI was really excited about this and followed best I could but I don't have a large play area so couldn't move past the first door so don't know how the rest of the game go's\nIt looks like it's a good experience for hand tracking\n\nHelpful | 2", "MasterDecoySGJun 25 at 12:00 AM\nJust a tech demo\n\nPros:\nIt's free - the price is right\n\nShows off what is possible controller free - the controls are responsive and cool\n\nCons:\nvery short - takes about 15 minutes to see everything that's on offer\n\nNo replayability - once you've run through it once, you'll probably never load it up again unless your showing your friends.\n\nOverall:\nCan't complain, it's free, it does exactly what it says on the tin, it's worth at least one play through.\n\nHelpful | 1", "Dragon81695May 28 at 3:22 PM\nIts good\n\nIts good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good Its good\n\nHelpful | 5", "ocuboy314May 28 at 7:19 PM\nGood but short\n\nI played through the game about two times and when the guide said to come back or whatever I played through it a second time thinking something would be different but it wasnt. Other than that the game is great and a fantastic introduction into hand tracking but I would love for there to be a expansion eventually.\n\nHelpful | 1", "LuigiRocks95May 28 at 12:14 PM\nFantastic! But missing something...\n\nI believe the overall game is very well developed, and gave a few laughs. But there is one problem: The length of the game. It did not take me very long to finish the game at all, so I think extending it would be a first approach to improving the game. And I also had a great idea for another extension while you are at it. Could you possible add a free play mode? This would make the game ten times better than it is now. But overall, fantastic game and I would love to see new updates!\n\nHelpful | 1", "ShapeOfEvilJul 13 at 11:15 AM\nLove it, need more\n\nI had no problems and loved this game And I felt the hand tracking worked great. I cant wait for a longer story driven version like some others Ive seen. Hand tracking takes it to the next level.\n\nHelpful | 1", "obi2kenobiMay 24 at 4:36 PM\nAnother in a long line...\n\nOf successful demos such as first steps or first contact. Good graphics, short and sweet intro to headset capability.\n\nUnlike those two it shows off \"what could be\" with the new hand tracking feature.\n\nIt is so exciting to play a game with no controller. The immersion level is unlike anything before it.\n\nI can't wait to see more apps featuring hand tracking. Kudos to these guys for doing it first.\n\nHelpful | 4", "DerekImmeJul 30 at 9:28 AM\nNot enjoyable\n\nThe game was very short, had no storyline, made no sense, and was very glitchy. Also the lady that talked I found annoying. 1 star, good thing this game was free\n\nHelpful | 1", "ninjack1372Jun 4 at 3:33 PM\nAn introduction to hand tracking\n\nThis title exceeded my expectations! With how this title implements every single use of hand tracking. To teleporting, (which I have to agree is weird) to interaction, and to.. Well just use only the headset. And it's all free so ....yeah. But it feels to short.\n\nHelpful | 0", "jprallMay 25 at 7:03 PM\nCant really call it a game\n\nIts just a show of hands controlling a demo. Hand tracking still needs a lot of work because it is easy to get the quest to mis-track hands (putting them together in the water to rinse is a fail). So, better than trying to control the UI with hands but you cant really call this a game. Its a short experience that will ultimately get deleted.\n\nHelpful | 1", "SloppyComic2523May 22 at 1:11 PM\nIt didnt work\n\nThe teleport gesture was not working. I followed Hanss instructions but it didnt work. Please fix this.\n\nHelpful | 48\nDeveloper ResponseMay 23 at 9:40 PM\n\nTry putting your fingers into an L shape then slowly pushing your thumbs together.", "SuperoogMay 27 at 5:33 PM\nSad\n\nI was super SUPER excited for this game, but I have very disappointed. When I saw that it was released I immediately downloaded it and played and well, I was SUPER disappointed I couldnt get past the first part part because it didnt detect my hands at all\n\nHelpful | 5\nDeveloper ResponseJun 5 at 5:33 PM\n\nHey Superoog we're sorry to hear that you ran into some hand detection issues. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "jellyfishmaiyaJun 7 at 6:45 PM\nGreat but short\n\nThis was an amazing cool fun game but I wish it lasted longer. it was only about a 10 minute experience which I was pretty sad about. I recommend to make a sequel to this but make it longer. I LOVE the detail and the game itself.\n\nHelpful | 1", "Josiecat07Jun 19 at 9:14 AM\nAbsolutely amazing! \n\nElixir is honestly such a great game! It has a unique storyline, narrative, and style. Throughout the whole demo I couldn't believe how smoothly the hand tracking worked. Every now and then I'd have to do the teleporting motion 2-3 times but I totally expected that from a new feature. Though it was a pretty short demo, it was packed with small details (which I love seeing when creators add so many simple things that most people wouldn't even look at). I'd love to see where they take the story from here!\n\nHelpful | 0", "dyingDECOYMay 29 at 4:48 PM\nHorrible\n\nCan't get past the teleportation spell because it isn't recognizing the hand gestures. Followed exactly as shown and even watched YouTube videos of others getting it just close enough and having it work. Game is pointless if you can't even get past the beginning. Was looking forward to using hand tracking. \n\nHelpful | 4\nDeveloper ResponseJun 5 at 5:32 PM\n\nHey there! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "ThatOneGothJun 24 at 4:23 AM\nHeartbreakingly short\n\nAn adorable game with excellent voice acting and premise but it's so short. 10-15 minutes at best. I was hoping for a world I can hangout in.\n\nHelpful | 0", "jcdescoMay 25 at 7:19 AM\nUnusable game\n\nIt perfectly shows the shape of my hands but is unable to recognize the triangle even when my hands perfectly overlap the one from the tutorial. The anoying voice keeps on saying do as hands does. Hope this is not the future of hand tracking\n\nHelpful | 9\nDeveloper ResponseJun 5 at 5:28 PM\n\nHey there! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "TimNikiasJun 1 at 9:15 AM\nGreat Experience for Hand Tracking\n\nGraphics and Interaction are great, and seeing your hands in VR as something else, but still wriggling the proper fingers is quite an interesting experience. The teleportation mechanic is great as well and something I could dig for future games!\n\nHelpful | 0", "Ray_RayoJun 4 at 2:32 PM\nToo short\n\nIts too short, its a good game really fun actually, but its too short I think if your gonna keep it short add more options to do because reloading it and doing the same thing over again is boring\n\nHelpful | 0", "TubaWranglerJun 17 at 11:58 PM\nWish I could play\n\nI was surprised to see that it was a hand tracking game but I was unable to even start due to the sensitive movement system. I couldnt stand still long enough to press down the plat. I also wasnt given any settings to change the sensitivity of the movement system\n\nHelpful | 2", "krisvdvijverJun 3 at 1:00 PM\nMagical!\n\nI loved this experience for two reasons: because my daughter had a mn absolute wonderful time playing with it. And secondly, because it made me see the possibilities of hand tracking. Highly recommended for Quest owners with kids!\n\nHelpful | 0", "jkaz04Jul 2 at 7:53 PM\nReally fun hand tracking demo\n\nThis game was fun and it is cool to see your hands change. The teleport movement was simple. You should add more experiments for the hands. Looking for a first hand tracking game, pick this one, it will be for you.\n\nHelpful | 1", "roman0904Jul 27 at 10:03 AM\nPlease please make a full version\n\nI loved this demo and I would love a full version also I found Emilys Easter egg\n\nHelpful | 0", "winkosaurJun 4 at 4:57 PM\nMovement issues\n\nWhen I was playing some reason I was just gliding around and could not interact with things because it would fling me away before I could and I restarted my vr headset and it still happened\n\nHelpful | 1", "SnowUseMay 26 at 10:11 AM\nWhy are people down voting this??\n\nIt's free! It's hand tracking and free. Yeah, it's like 15 minutes. But it's pretty rad for the first (official) hand tracking demo on the Quest. Plus it's free. Thanks Oculus people. You could've charged $3 for this and it would've been worth it IMO. But not more than 3.\n\nHelpful | 3", "drew.hyndsJun 13 at 8:06 AM\nPeople moan too much.\n\nThis DEMO EXPERIENCE, was amazing!!! I think people reviewing this have forgotten that it is only meant to be a demo for hand tracking, and on those terms it's awesome! Though it didn't last long, it was great fun, and felt really cool to do things without the controllers :) I think everyone who owns a quest NEEDS to try this :D\n\nHelpful | 1", "RamenFansMay 31 at 9:51 AM\nI was excited, than a little disappointe\n\nThis game will seem great for any person trying out hand tracking, but the story is a little boring while I just wanted to play around. Also the spell to teleport is almost impossible for smaller hands.\n\nHelpful | 0", "underwoodmahalaJun 20 at 7:14 PM\nAbout the hand tracking. Please read!\n\nYou can't cross your fingers or touch your hands together with the virtual reality hand tracking. I'm sure you know this, but to me it seems like an important detail because of sign language and deaf users of VR. I'm not deaf, and I can't pretend like I know the struggles of being disabled or anything. But I like to practice ASL.\n\nA just in case I someday meet a deaf person.\nB its fun and I can be secure in the knowledge that if I ever meet something not human like E.T. or Bumblebee I can still communicate with it Shape Of Water style.\n\nAnyway, you can do whatever you like, but to me, hand tracking IS NOT finished until you can do full sign launguage in it and not have to make up new signs. You could make a game that teaches ASL in virtual reality. You'd make an absolute killing.\n\n(Can't be easy but nothing worth doing ever is)\n\nHelpful | 0", "JaimeVisser3 days ago\nSweet little hand tracking demo\n\nIt's not very long (you can probably finish it in 15 minutes) but it's quite polished. Had to fight a bit with the teleport gesture as sometimes it does't target well or my hand disappear while aiming at a target. The different things you can do with your hands are fun but you are rushed too much by the voice-over to just finish the game.\n\nHelpful | 0", "Ninjanick0708Jun 26 at 10:50 AM\nPetty good but\n\nTheir are some things I am confused on like how she says what to do and I'm still confused\n\nHelpful | 0", "tomthegamer55Jun 4 at 12:07 PM\nI...liked it\n\nThis is a great hand tracking game. I feel though that the experience needs more content. After about 5 minutes you get kicked to the menu. The game needs more gameplay.\n\nHelpful | 0", "Fallibleegg4397Jun 5 at 2:28 PM\nGood idea terrible experience\n\nFor some one who loves new ideas like this this is not one I cant teleport it do any spells because of my hand size (small) and the gestures are hard!! Plz fix.\n\nHelpful | 1", "angela.benhamJun 3 at 6:06 PM\nI want to play\n\nI would gladly love to give this a fair rating but I cant even put my hands on the stone tablet to begin. Any time I try to get close to it it gets off to my other side, behind me or way far ahead of me. The hand keeps shaking at me and pointing where I'm supposed to stand but the stone tablet never appears. I shut down the quest and started it again several times but it still wont let me play. Any help on how to get it working would be greatly appreciated it looks fun!\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:27 AM\n\nHey angela.benham, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "DiamondDutyMay 27 at 12:42 PM\nFun but want uninterrupted free play.\n\nWish I could just keep playing it without being kicked out when I do an objective.\nAlso more interactions would be cool.\nAlthough I get its a demo and proof of concept for hand tracking.\n\nGood stuff!\n\nHelpful | 1", "EltrokidJul 16 at 11:37 AM\nAn uninteresting mess\n\nThere are three main flaws:\n1. It has only hand tracking support. This means you can only move your hands moderately slowly. It also means the teleporting feature is way harder to use.\n2.the ingame hands themselves are also annoying. They always have a random effect in play, from shooting fire to having tentacles. This also makes many tasks more difficult.\n3.at one point the teleportation ceases to function and you are stuck in your spot. The game recommended a 2 meter space, but most, incuding myself, do not wish to have to go into their back yard to play a VR game.\n\nHelpful | 1", "sebastian.kurz.583May 26 at 11:44 AM\nVery good :-)\n\nGreat experience in its core, hands tracking is very well implemented, tentacle hands and dragon hands look and feel awesome :-)\nMoving is cumbersome with this gesture and does not add to the otherwise great experience at all.\n\nHelpful | 1", "HammyDaHammyster11 days ago\nFun but boring at some point\n\nThe game is fun and all but if you show it to anybody else or try to get in its gonna be boring and the teleporting not that good in the voiceover gets annoying in the hand tracking its not always the best either so its not the best game but its a pretty good demo if I might say.\n\nHelpful | 0", "firepig71May 26 at 11:53 PM\nEnjoyable once you know how to move\n\nI had to watch a YouTube walkthrough to understand how to move. Once you get the hang of that it is a nice introduction to the hand tracking world. The voice actor sounds like Catherine Zeta Jones! lt felt good not having to use the controllers and its Free! Thank you guys.\n\nHelpful | 2", "shenry6001Jun 10 at 5:03 PM\nIts more of a demo\n\nThere is nothing wrong with this game, but I felt it was rather short. It would make a great demo to hand tracking.\n\nHelpful | 0", "Squishy2008May 26 at 9:26 AM\nGreat game!\n\nI like the game a lot but I was hoping for a little bigger story and where it say Oculus touch controllers also add hand tracking!\nThanks\n\nHelpful | 2", "HumbleHoneyBeeJun 5 at 9:09 PM\nA MUST TRY, NEW EXPERIENCE\n\nThe demo was excellent. It encompasses many aspects of the hand tracking as well as changing the appearance. It was fun to play through and had a nice visual appeal. However, I do wish the demo was longer. I enjoyed the bit I got to play and can not wait for this to be further expanded.\n\nP.S. for the people saying the voice is annoying. It is not, and honestly I almost didnt download the game because of the comment. However, I am glad I did. The voiceover explains what to do like a tutorial which is basically what this is...\n\nAlso the play area does not need to be 6.5 by 6.5. I played in a 6 x 4 space. Although the bigger space is recommended and is probably better, do not let spacing stop you from trying the game \n\n\nI recommend giving this a try. It honestly surprised me!\n\nHelpful | 1", "Alphaa799Jun 2 at 11:32 PM\nThis Is The FUTURE of VR!!\n\nHand tracking in VR is excellent. Hand tracking paired with the wireless nature is of the Quest makes for a truly immersive experience.\n\nTrying the different spells put me in aw every time. I found myself going back and playing through two more times before going to get my brother to show him.\n\nI've seen some reviews about the teleportation not working but it worked perfectly for me. Either way it's free so no reason to not give it a shot.\n\nHelpful | 0", "shanae09May 22 at 12:26 PM\nThe first part didnt work\n\nI was doing the hand gesture right but it wouldn't do anything.\n\nHelpful | 28\nDeveloper ResponseJun 5 at 5:19 PM\n\nHey there! We value your feedback and hear you. We just released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "BeccyQJun 13 at 10:09 PM\nThis demo is awesome!\n\nI really hope they expand it into a full game because I'd play that for hours. The narrator is a fun character and the pudgy dragon is adorable.\nI found that turning on all of the lights in my living room helped make the hand tracking much better.\n\nHelpful | 0", "JaxKidderJun 26 at 12:53 PM\nWeird\n\nThe witch kicked me out\n\nHelpful | 0", "antburtMay 22 at 10:14 AM\nNot bad\n\nIts pretty good for a hand tracking game\n\nHelpful | 17", "Superblue5Jun 30 at 5:17 PM\nGood for its price\n\nIm guessing this is a demo, but I was expecting a longer game if they made a $20 4-5 hour long version of this I would buy it though. Its really fun.\n\nHelpful | 0", "damianmoreno2009Jun 1 at 9:58 PM\nIts ok\n\nAfter a little while it gets kinda boring\n\nHelpful | 4", "BlackburnBoysMay 24 at 11:40 AM\nI CANT PLAY!\n\nThe game has a lot of potential but I cant move I tried looking at other peoples reviews and found them helpful but I still cant move\n\nHelpful | 9\nDeveloper ResponseJun 5 at 5:30 PM\n\nHey there, we're sorry to hear that you can't move! As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "SimonRigotJun 26 at 12:09 AM\nuseless\n\nAfter 5 minutes trying to follow the use of the hands I just stopped because it pisses me off trying this finger down without any result. I wil deinstall this app because I probably dont understand the move I am supposed to do with my hands.\n\nHelpful | 0", "Dinosnake7613 days ago\nWay too short.\n\nI finished the game the first time and I felt like it really rushed towards the end with the eyes. I did get the lead designer easter egg and found Hans inside the barrel, pointing to an area in the water. I replayed the game and it felt a little slower but still rushed. It was way too short and I wish you were able to interact with all of the powers in a different environment.\n\nHelpful | 0", "ThefazbearMay 27 at 1:00 AM\nNO\n\nOk so I started the game super exited to play it but I cant pass the first part! Im doing the right hand movements but it just doesnt work and I just wasted my time downloading this game and I cant pass the first stage because its just not working.\n\nHelpful | 3\nDeveloper ResponseJun 5 at 6:41 PM\n\nHi Thefazbear! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "CookieMonster411May 30 at 6:29 PM\nDelightful\n\nI can't imagine anyone giving this experience less than 5 stars. The first time i tried it in a darkish room it was a little wonky, but when i tried it again in good lighting the hand-tracking worked perfectly. A really great introduction to this new technology, and a super fun experience to share with friends and family-and the narrator is positively hilarious.\n\nTips for those having trouble with teleport/hand tracking:\n\n1. Make sure you are in a well-lit environment first and foremost. (This will solve all your hand-tracking issues really, the external cameras on the quest are very low-power and require a lot of light to perform as intended. Maybe even clean them off with a microfiber cloth as well.)\n\n2. Dont put your fingers together to form a triangle to teleport (as i accidentally did at first), as the narrator says \"Do as Hans does.\" Notice his fingers are not touching, space your thumbs and index fingers about an inch apart as indicated and it works like a dream.\n\nHopefully people that didn't review this game highly will try it again using these tips and come back and change their rating. Because it is really a great thing and the developers deserve recognition and appreciation for giving this to us free of charge.\n\nHelpful | 0", "RickK75May 23 at 2:14 PM\nINFURIATINGLY BUGGY AND BROKEN\n\nCouldn't get into the game because of one bug after another. I know this is free but it is also the most buggy software I've run on my Quest in the last year. I don't know how this got past Oculus QA it's horrendous.\n\n* Would not observe correct center of room despite recentering repeatedly.\n* Flickering rectangles over the screen obscuring the view when Chromecasting, then also when chromecasting stopped.\n\nWill update this review if things get fixed. Was it tested with the casting feature?\n\nMy center point is in front of me. I'm sitting on a corner sofa... So why when I've centered in front of me meaning that's the direction I want to play the game are you making me rotate around to put my hands through the back of the sofa to start the game???\nAll your credits pop up in front of me in the correct direction of play, but when the game starts, no, it's got to go through the back of my chair. It's hard to like things like this.\n\nHelpful | 2\nDeveloper ResponseJun 10 at 6:58 AM\n\nHey RickK75, we value your feedback and hear you. It is important that the oculus community is able to experience Elixir as it was intended. We released a new update with improvements. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. One thing to note is that Elixir was primarily designed to be a standing experience, though it can still accommodate as a sitting experience. You may run into a circumstance that a standing user may not. Another item to note is that currently Elixir and other hand tracking experiences do not support Chromecasting as it tanks performance. Thank you for the support and be on the look out for future updates of Elixir.", "CrelsJun 4 at 7:42 PM\nTeleport does work.\n\nMake sure your area is lit up well and the tleport works. Experience is interesting enough. Worth a free download.\n\nHelpful | 1", "bradley.mcelvy.7May 29 at 6:22 AM\nIs this a bug?\n\nI dont know if this is a bug but at the start of the game I follow what the hands told me to do for the teleportation spell but it never work. I kept restarting the game but it would never work. Can you fixed this if it is a bug\n\nHelpful | 3\nDeveloper ResponseJun 5 at 5:36 PM\n\nHey Bradley, we value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "jigga0323May 31 at 4:09 PM\nTo short\n\nI thought this game would be longer but for me it took 5 minutes the narrator gets made for poking the eye but the game asked me too\n\nHelpful | 0", "kim.donachieMay 29 at 3:09 AM\nIt isnt that bad but\n\nAlthough I really liked the experience its to short and the tutorial took me about a hour great hand tracking game but i am really gutted it was that short\n\nHelpful | 0", "tron0909May 29 at 8:34 AM\n\nIts a great game and it was a lot of fun to play but it would be better if after you completed it you could mess around with all the hands and stuff instead of the game just ending\n\nHelpful | 0", "SquidfacedMay 28 at 3:05 AM\nThis is... Awesome.\n\nElixir is a most interesting game for certain. DO NOT take it as any more than a tech demo because...it isnt. Nonetheless, this is an outstanding tech demo of finger tracking. Do i think it will stand the test of time as VR develops? Hell no, but it's an outstanding glimpse into the future. Beautifully showing off the capabilities of hands in games, and how what your fingers do does not need to be 1:1 with what you see (take the squid hands or robot hands for example), elixir is begging you to ask what else finger tracking can bring. The point of Elixir is to set you off in the direction of the future, and watch you and your friends enjoy it like crazy.\n\nHelpful | 1", "Ctrl2020May 28 at 3:07 PM\nGreat demo\n\nGreat way to show off hand tracking. I loved the different variety of things to experience, and the graphics are quite good! This is mostly a tech demo, but thats ok. Oculus should be advertising this a lot more because its clear the devs put a lot of work into it.\n\nOne bug/issue: the teleportation system is a bit wonky. I could never get my sons hands to work with it. But hes smaller than me.\n\nHelpful | 1", "coachcamjoonMay 23 at 10:02 AM\nCant get past the intro\n\ni cant cant get past the intro and i really wanted to play this game but i cant even get past the intro even tho im doing the exact same gesture for it\n\nHelpful | 9\nDeveloper ResponseJun 5 at 5:31 PM\n\nHey there coachcamjoon! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "mungyunMay 26 at 1:29 PM\nTeleport did not work\n\nRead all the reviews and tried every suggestion and nothing worked. Tried same shape as the hands, tried the L shape, slowly moved fingers closer and further apart, nothing. There was one split second moment I saw a stone light up but then it turned off and afaik my hands didn't change shape at all\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:22 AM\n\nHey mungyun, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "EeveekittyMay 30 at 11:36 AM\nGreat! But...\n\nThis is a wonderful game, but so wish it was longer. Also, after two run throughs, the teleportation spell didnt work, so I couldnt play a third time.\n\nHelpful | 1", "RaxiaJun 10 at 8:21 AM\ngreat game\n\nreally enjoy it. using your hands to control to grab to move, amazing. but sometime lose tracking.\n\nHelpful | 0", "fletchercatMay 28 at 6:24 AM\nI cant move\n\nEvery time hands pops up And shows me how to teleport it doesnt work I dont know why Im doing the triangle but it doesnt work\n\nHelpful | 1", "hunaveliMay 25 at 6:54 PM\nAmazing but short\n\nThis was an introduction to hand tracking on Quest. I wish there was a little more to explore and I felt like it was rather short. Its really fun although and very immersive.\n\nHelpful | 1", "DG107Jul 18 at 4:19 PM\nVery fun must play\n\nVery fun for a free hand tracking demo\n\nHelpful | 0", "FaveRaveJun 6 at 9:24 AM\nTeleporting weird\n\nWell its a good game but the hand tracking is very wired when trying to teleport I hope you can fix this.\n\nFave!\n\nHelpful | 0", "ShadowProgrammerJun 10 at 8:42 AM\nExcellent, but only 5 mins. long\n\nMaybe if you could lengthen the story and add more spells and outcomes, this would be 5 stars.\n\nHelpful | 0", "KRAW2DEATH01Jun 6 at 3:10 PM\nIt's ok but has room for improvement\n\nThis was pretty good but the tracking constantly turned of and the game was quite short\n\nHelpful | 0", "hunter331Jun 11 at 2:16 PM\nGet it right\n\nReally, people this is not a game, it is a tech. demo.\n\nHelpful | 1", "BossloreyMay 26 at 3:29 AM\nDecent\n\nJust get Waltz of the Wizard\n\nHelpful | 3", "MindTracerJun 6 at 8:56 PM\nUnplayable\n\nSpent 10 minutes trying to get passed the splash screen by placing hands on rune stone. Every time I move my head the rune starts flying all over the place so cant place hands on it to move forward.\n\nHow anyone got to gameplay is beyond me.\n\nWhat have you got in your hand apprentice? Put that down! Its a controller bucko, exiting this mess!\n\nHelpful | 1\nDeveloper ResponseJun 10 at 7:21 AM\n\nHey MindTracer we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "NickMajora23 days ago\nLovely showcase\n\nThis short experience had some surprising moments. It would be nice if this game could be slightly more interactable, a little longer and have a better method of teleportation. Combine those with smoother hand tracking once Quest 2 comes out and this would be pure magic to show people.\n\nHelpful | 0", "LazyActivistMay 26 at 5:24 PM\nFun tech demo\n\nThis is short but fun tech demo of hand tracking. I enjoyed the experience. Thank you for making this and letting us explore hand tracking possibilities.\n\nHelpful | 0", "R3tr01140Jun 30 at 5:19 PM\n\ni liked the actual game but when i tried uninstalling its just stuck at unistalling and its stayed that way for over a month now\n\nHelpful | 0", "seth1928May 25 at 6:12 PM\nIts great\n\nIt didnt work but then a dev helped me out props to u I love how fun the game is thanks for helping me out\n\nHelpful | 6\nDeveloper ResponseMay 23 at 9:06 AM\n\nI'm glad we were able to help. Have fun!", "Cozzy_Jun 8 at 8:52 AM\nPerfect execution\n\nElixir is what a game should be. Playful, fun and beautiful.\nOf course it's short as it's an experience, the hand tracking is implemented amazingly well and the hand models are hilarious.\n\nAnything from these Devs will be worth playing.\n\nHelpful | 0", "marcotheham321Jun 7 at 11:28 PM\nIts bad\n\nI get that its the first finger tracking experience in the quest but it definitely is annoying how there isnt a free mode where you can explore more in the world of finger tracking. The lady who guides you has a very annoying voice\n\nHelpful | 0\nDeveloper ResponseJun 10 at 10:50 AM\n\nHey marcotheham321, we appreciate your feedback. Freeplay is something that multiple users have expressed and is in our radar to drop in an update in the future. Stay tuned.", "GimmeDemSocks22 days ago\nCreator of the Game had to step in lol\n\nI loved the game. The hand movement and the different variety of hands lol. The graphics were super cool but yet....different. In a good way:) quick movements with the hand tracking bugs out which sucks but yet understandable. (I tried to sucker punch those eyes.) When the sorcerer said not to touch the eye. I didn't. I waited. Then the narrator came in or the creator of the game or somethin had to step in and tell me that I didn't have to wait. Poke that eyeball:) In all its a great quest starter game. And its free! Which is awesome. I recommend longer hand tracking games tho. Recommendddddd:)\n\nHelpful | 0", "Adam_woodMay 23 at 10:02 AM\nGood after some help from the devs\n\nThis game was amazing. At first I was having some difficulties but after some help from the devs this is one of the best hand tracking games out there. Not only does it have loads of stuff to interact with its completely free! This means its accessible to everyone with a quest\n\nHelpful | 1\nDeveloper ResponseMay 23 at 10:04 AM\n\nFantastic! I'm glad we were able to help and happy you enjoyed the experience.", "69yeetmeister420Jun 10 at 5:11 PM\nNice\n\nAt first I was confused on why I kept getting kicked out but once I was told that it was a demo I understood my opinion totally changed. This is really cool and the tracking is almost flawless\n\nHelpful | 0", "slavahMay 27 at 5:08 PM\nNice but very short.\n\nIt's about 20 minutes of gameplay for kid. Very short. Game is nice and fun for kids.\nWait for discount.\n\nHelpful | 0", "Melo1821May 27 at 1:40 PM\n\nSadly its a 1 star since I cant get past the teleportation the L gesture and triangle gesture wont work and I cant even get to the pinching part.\n\nI dnt know why but it started working. I loved the short demo and am wondering if their is a full game\n\nHelpful | 1", "jdecarlo9123 days ago\nToo short\n\nI thought the concept was cool but I feel the game should be expanded into a full game and give you quests and stuff to do. I was a little disappointed that I was able to get through the whole thing In only a few minutes.\nGreat introduction to hand control though.\n\nHelpful | 0", "debora.v12Jun 4 at 2:05 PM\ngreat game but felt rushed\n\nthe was over within about ten minutes and felt rushed\n\nHelpful | 0", "Sanikh3dhogMay 23 at 4:48 PM\nits so gross\n\ni like elixir a lot because the dragon throws up on you. its so funny. the only thing i wish they could hide the scary sewer eyeball because i dont like that one. My favorite part is the claws\n\nHelpful | 1", "pwils1May 25 at 4:39 PM\nI dont like that Emily character\n\nI kept waiting and Emily just kept saying no poke the eyeball but Im loyal and waited 30 minutes for that sorcery she never came back\n\nHelpful | 3", "BabyChewy123423 days ago\nA great game\n\nThis was awesome but I am not able to tell if this is just a demo, based on what I did I want to do so much more! But after you sign the contract it just restarts, I hope this is just a demo and there is a full game tho, or its a game made to experience hand tracking.\n\nHelpful | 0", "wstmbgh2911 days ago\nHas potential\n\nI dont know if there is a longer version available or not but if there isnt then I see this being an amazing game but with how short and limited it is as of now is disappointing.\n\nHelpful | 0", "ShinyBrainJun 4 at 6:27 PM\nWHAT DID THE UPDATE DO!\n\nI cant even start the game because when in try to put my hands on the table, I start moving around and I eventually get horrible motion sickness, someone please help\n\nHelpful | 2\nDeveloper ResponseJun 10 at 6:38 AM\n\nHey ShinyBrain, that's no fun. We want to make sure you can play this experience as intended. One suggestion is to restart your quest, download the latest update of Elixir(0.1.2337) re-define your game space, and then launch the experience. Be on the look out for future updates as we'll be continuing to refine and polish the experience.", "PikachuGamin555 days ago\nCould use more gameplay or a sequel\n\nI thoroughly enjoyed the game but felt it was too short I would love to see a longer game by the same people because I would love to see what interesting things could happen\n\nHelpful | 1", "robyescombeJun 2 at 10:28 PM\nA very exciting start...\n\nFirst and foremost, I literally laughed out loud at Emilys voice prompt. The choice to include that alone made me excited about this team.\n\nMeanwhile, hand tracking is wild and wonderful and I cant wait to see more like this.\n\nHelpful | 0", "jbenavides1981May 23 at 6:08 PM\nIt was cool....... For the first time\n\nWhen I played the first time it was a little Buggy but it was decent (the emrsion was broken thanks to gardian) the second time I played The teleportation spell didn't work I tried restarting the game and still it didn't work.\n\n\n\n\n\nJust a suggestion add a free play mode\n\nHelpful | 0\nDeveloper ResponseMay 23 at 7:15 PM\n\nWe're very interested in a free play mode, thanks for the suggestion! Try playing around with the teleportation gesture a bit. It works best when your hands are in front of your face at about chest height.", "simon_cooksonMay 28 at 1:30 AM\nGood game but it was too short\n\nThis is probably the best hand tracking game but it was too short\n\nHelpful | 0", "ZaccSmacc921Jun 14 at 11:14 PM\nGreat hand tracking app\n\nI love the new hand tracking feature and this new free demo is cool. All I want is more demos like this and also its kinda short\n\nHelpful | 0", "BlueEyes300May 25 at 5:23 AM\nThis game looks so much fun\n\nThe game,the colors,everything is so crisp and so clean. Looks like fun. However I cant play it because I have no idea whats that baby dragon is saying... there are NO SUBTITLES at all. That needs to be added. Once thats done Ill add 5 stars\n\nHelpful | 0", "Aaronb3434May 23 at 10:23 AM\nCool\n\nHand tracking now that's brilliant! wish it was longer and more to do. can't wait to see more hand tracking games and apps especially horror and action & adventure.\n\nHelpful | 2\nDeveloper ResponseMay 23 at 10:24 AM\n\nAwesome, we're glad you enjoyed it!", "mjcukJun 27 at 9:54 AM\nGreat hand tracking app\n\nReally good experience for hand tracking very well done.\n\nHelpful | 0", "SSpectacularShielddJun 18 at 11:04 AM\nHelp\n\nOk so at the start of the game you learn to teleport. I did the actions. Didnt react. Is this the game or the headset?\n\nHelpful | 0", "NoTopTeethMay 28 at 7:00 PM\nNice graphics.\n\nWas touch and go at some points even with the controller. But was cool.\n\nHelpful | 0", "RustedEmpire_May 29 at 8:08 PM\nFix the hand Gesture immediately!\n\nI was so excited to play this game, exited for the feature, but it doesnt work at all. I restarted it and did one step by luck. Please fix this, if so add a feature to use controllers only if necessary, im begging you, were begging you.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 10:51 AM\n\nHey RustedEmpire_, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "NightVIPERzJul 10 at 2:10 PM\n\nDid not work very well\n\n\nHelpful | 0", "Sayhi121Jun 10 at 6:57 PM\nWhy does this have 3 stars?\n\nThis is a really cool demo especially since it's free. Great introduction to what hand tracking can be capable of in the future.\n\nHelpful | 0", "TheTipUSMC0331May 31 at 12:55 PM\nIt does not work\n\nThe hand tracking does not work the l shape you have to make does no work if you try over and over nothing happens\n\nHelpful | 3\nDeveloper ResponseJun 5 at 5:37 PM\n\nHi there! We value your feedback and hear you. As the developer it is important to us that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "GattoHolguin1May 26 at 10:45 AM\nAnchor for our future!\n\nGreat game truly immersive. It shows the mechanics of the Oculus OS and is proof that games like even Doom or quake are possible without giving up their graphical fidelity! Make it Happen Nativly!\n\nHelpful | 0", "Gillz1978May 29 at 3:49 PM\nI absolutely loved it but.....\n\nThis game was absolutely epic. I had so much fun playing it my only complaint is that its entirely too short I would gladly pay money for a much longer experience!!!\n\nHelpful | 1", "kaman116May 22 at 10:09 AM\nHand tracking\n\nIt is good\n\nHelpful | 5", "rottingfrootloops689Jun 7 at 5:20 PM\nHorrible\n\nIdk if its just me, but I swear Im on quest and I do the teleportation spell at the beginning and I do the gesture, but it would not do anything whatsoever\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:55 AM\n\nHey rottingfrootloops689, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "MrUnboxerManYTMay 23 at 12:53 PM\nWoah\n\nIts tracks your hands WAY better than the hand physics lab demo. It's such a fun, free, short experience thank you Oculus\n\nHelpful | 2", "blueteddy00May 22 at 12:53 PM\nJust perfect\n\nHonestly I wish this was a full game because I screamed \"NOOOO\" when the demo was over cause I so badly wanted to play more.\n\nHelpful | 2", "EzotonJun 2 at 5:22 AM\nIt was very big fun\n\nThe narrator's voice was a little annoying, but I really enjoyed the game. It's just a demo, but it gave a whole new vr experience. Thanks to the developers:)\n\nHelpful | 1", "DeepchargerJun 21 at 3:27 PM\nCool\n\nWish it was longer but its amazing great work\n\nHelpful | 0", "RNGACESJun 2 at 1:51 PM\nDifficult\n\nI have attempted to get past the beginning of the game you know the eyeball part and after around 40 attempts I had to give up the game is fun though If you like constant repetition\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:47 AM\n\nHey RNGACES, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "HudsonYMay 24 at 2:47 PM\nVERY Good , But Short\n\nI Like It But Its Very Short. I Would Love To See a Full Game Out Of This Sort Of Like Waltz Of The Wizard!\n\nHelpful | 1", "Get_To_Da_Choppa_VRMay 23 at 11:19 AM\nTruly a taste of things to come\n\nFull of charm and humour, this is a brilliant introduction to official hand tracking and works really really well!\n\nHelpful | 2", "FroetiboyyMay 27 at 6:05 AM\nCant start the game\n\nI cant start the game bcs the thing where i have to put my hands on at the beginning is outside of my guardian, and every time i move my head i teleport around, but that doesnt facking work. Good job game, good job\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:01 AM\n\nHey Froetiboyy, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "DeepMellowJun 2 at 6:52 AM\nLimited movement, Corny\n\nIf youre 5 years old you might be entertained for r minutes. Very limited in what you can do and the voice is an annoying attempt at some played out Disney movie. Uninstalled. Yawn.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:08 AM\n\nHey DeepMellow, we appreciate that you played Elixir. Our goal was to create an experience that can captivate a wide range of users. In this case it was important for us to try to bridge the gap with parents and their kids and give them an experience that they can enjoy together. We are hoping to expand on the universe and give it more depth to entertain the more seasoned VR users. Stay tuned.", "PyrowhoMay 30 at 2:29 PM\nDidnt work\n\nIdk what happened here but I cant get my hands to register the teleportation. Right from the get go its broken for me. Bummer\n\nIll try again and redo the review if I can get it to work.\n\nHelpful | 1\nDeveloper ResponseJun 10 at 8:35 AM\n\nHey Pyrowho we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "joshtrussMay 25 at 11:20 AM\nAMAZING\n\nIve played many hand tracking games from side quest and the dont compare to this game. This has good game mechanics and once your used to how it works its super fun.\n\nHelpful | 1", "JDGONZOMay 24 at 2:42 PM\nAmazing Game\n\nI loved this game, I love how it shows what hand tracking can do. It is amazing how you have designs for hand, it would be cool to change how your hands look in the Oculus home.\n\nHelpful | 1", "schu28May 24 at 11:00 AM\nStuck\n\nThis game is making me move and idk how to control it but when I try pressing my hands on the stone thing I just move away!\n\nHelpful | 3\nDeveloper ResponseJun 10 at 6:46 AM\n\nHey schu28! We value your feedback. We released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also make sure you are in a well lit area to ensure the quest can track your hands.", "pixel_dad_007May 23 at 9:17 AM\nReally fun\n\nAs someone who didnt know if hand tracking could be affectively due to oculus quest only having 4 cameras. This game proves that Virtual reality is going in the right direction.\n\nHelpful | 1", "guy.talmorJun 10 at 9:32 AM\nA charming experience\n\nAn opportunity to experience hand tracking in a game, very cute. Totally worth your time.\n\nHelpful | 0", "Pepperw2May 29 at 1:19 PM\nAmazing\n\nJust wow! Am I the worst apprentice ever? Absolutely!\n\nIs this one of the best experiences I have had to date on VR? Yes a hundred times.\n\nHelpful | 1", "TehelmoMay 25 at 1:08 PM\nWhy cant I teleport\n\nIV SPENT 15 MINITES JUST TRYING TO FIGURE OUT HOW TO TELEPORT AND IM STILL STUCK TRYING TO FIGURE IT OUT\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:25 AM\n\nHey Tehelmo, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "Dw1ghtSchruteJun 16 at 8:31 AM\nEh\n\nThe game works and it can be fun, but the voiceover is SUPER annoying.\n\nHelpful | 0", "NebulaHuskyJun 11 at 12:53 PM\nAmazing game! Excited to see more!\n\nHand tracking works flawlessly, great voice acting, fun interactions, 5/5\n\nHelpful | 1", "slothgamer4321Jun 27 at 5:26 PM\nCant do more spells\n\nYou can only do like a couple spells\n\nHelpful | 0", "pvreAgJun 1 at 5:09 AM\nIt doesn't even work\n\nThe teleportation system doesn't work at all. It stops working after the first teleport.\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:12 AM\n\nHey pvreAg, We value your feedback and hear you. We released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "Overkill028May 28 at 8:27 PM\nIt wont let me teleport.\n\nThe game just wont let me teleport, so I cant play the game. Im at the very beginning when you meet Hans. Im doing the exact symbol yet nothing is happening. Please Help!\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:00 AM\n\nHey Overkill028, We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "MooeymoomooMay 24 at 12:18 PM\nLove it!\n\nBrilliant! A real \"wow\" game for me. Wish it was longer, hoping it's a prequel to a buyable game. I couldn't seem to exit but other than that I loved it.\n\nHelpful | 1", "Vlop7May 24 at 10:45 PM\nIts good\n\nIts ok\n\nHelpful | 0", "uggie2016May 28 at 8:36 AM\nFailed\n\nCant get started, won't let me place my hands on start panel, it keeps moving away from me, what am I doing wrong?..\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:19 AM\n\nHey uggie2016 we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "Kyan010Jun 5 at 6:41 AM\nWowowowowowow\n\nIts a really good demo, and i enjoyed playing it, i hope theres gonna be a full game\n\nHelpful | 0", "Glitch324Jun 10 at 1:35 PM\nGreat game\n\nI love this game but it is to shot it needs more content\n\nHelpful | 0", "skybithMay 30 at 11:58 AM\nToo short\n\nWe need a full game bc this was fun\n\nHelpful | 2", "Chickens3May 26 at 6:08 AM\nHOW TO TELEPORT!!!\n\nSo the game is really good but people do not know how to teleport so put our hands in a L shape and put your hand in front of you\n\nHelpful | 1", "Miney80May 27 at 8:21 AM\nI cant get past the moving part\n\nIt says make a triangle with my hands, but then I do it and It wont work.\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:26 AM\n\nHey Miney80, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "Masonator245May 26 at 3:23 PM\nNot a child compatible game\n\nIf you have small hands its impossible to play\n\nHelpful | 3\nDeveloper ResponseJun 10 at 6:32 AM\n\nHey Masonator245, we're sorry to hear about your experience with Elixir. At Magnopus we went through multiple passes to define a hand size that can accomodate all users comfortably. The captures and thresholds are being improved as we roll out updates in the future. One suggestion to help trouble shoot in the meantime is making sure you're in a well lit play space. The cameras on your quest headset can have trouble reading your hands if there is not enough light.", "MyvrnotyoursMay 28 at 3:13 PM\n\nThis doesnt work with small hands\n\nHelpful | 3\nDeveloper ResponseJun 5 at 6:39 PM\n\nHey Myvrnotyours! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "Accrcybyvol0331May 27 at 8:19 PM\nI cant teleport\n\nI had all the problems you can get in this game my left thumb was constantly twitching and I cant get past the teleporting and the narrator is very annoying when failing at this\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:01 AM\n\nHey Accrcybyvol0331, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "LIVEFORVR2011May 25 at 9:27 AM\nThis is so fun\n\nOmg this was on the release date Commercial on YouTube this looked so cool but then the creators of the game released it\n\nHelpful | 1", "splapMay 27 at 6:36 AM\nThis game is unplayable for me\n\nI cant teleport Ive tried the L shaped hands but that doesnt work either I wanted to play a hand tracking game but this one is not working for me.\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:02 AM\n\nHey splap, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "jtk_10invrMay 25 at 5:15 AM\nI was blown away\n\nJust wow oh and hand tracking in on another magic game to that alot more fun than this but this is still pretty fun\n\nHelpful | 1", "RasesmusMay 23 at 3:15 AM\nTo short\n\nGood game way to short.\n\nHelpful | 3\nDeveloper ResponseJun 10 at 6:50 AM\n\nThanks for the positive feedback :). The dev team really enjoyed creating this experience and would love to return and expand on this universe.", "BigelowedMay 28 at 7:24 AM\nA short step into the future\n\nI was surprised how short the experience was, but wow is this still a great glimpse at the future!\n\nHelpful | 0", "MryeetcanteatMay 25 at 4:57 PM\nNot a good game\n\nThe game is bad glitchy and its not possible to get past the first part the teleportation is broken.\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:26 AM\n\nHey Mryeetcanteat, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "dadandson1May 31 at 11:23 AM\nTeleport bad\n\nNever got to play because teleport spell broken :(\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:13 AM\n\nHey dadandson1, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "NICSTRBOIIIIIMay 28 at 11:47 AM\nCant even play\n\nI dont know if its the games or my quest but when I try to place my hands on the stone in the beginning it keeps making me go in circles around the stone\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:59 AM\n\nHey NICSTRBOIIIII, We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "gsil.armenta.9May 29 at 12:36 PM\nI cant teleport\n\nI cant move at all fix this cause I am crying right now\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:18 AM\n\nHey gsil.armenta.9 we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also make sure you are in a well lit area when playing hand tracking experiences.", "OddlyspongeJun 5 at 9:09 AM\nYes a good update for movement\n\nWell they fixed it guess I shall change my review.\n\nHelpful | 0", "spiderspenceMay 23 at 8:41 AM\nI couldnt even get in the game\n\nThe only time I spent in there was trying to get in the game\n\nHelpful | 3\nDeveloper ResponseJun 10 at 7:11 AM\n\nHey Spiderspence, We value your feedback and hear you. We released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "SyecakeMay 23 at 8:39 PM\nGreat game\n\nIt's fun but it takes a while to get past the first part\n\nHelpful | 2", "weejpJun 1 at 2:14 PM\nThe future of hand tracking\n\nThis is by far the best Hand tracking I've experienced. Good job.\n\nHelpful | 0", "DudeBro789Jun 12 at 8:48 PM\nHand tracking is bad\n\nGame keeps loosing my hands\n\nHelpful | 0", "TheOnlyLegendMay 28 at 8:34 PM\nInteresting but terribly overrated\n\nThis game was the talk of VR when trailers dropped. It ended up being a 5 minute side quest demo.\n\nHelpful | 0", "FeatherithJun 10 at 6:54 AM\nI would rate this fairly but I cant\n\nThe fixed it\n\nHelpful | 0", "Silje876May 28 at 12:19 PM\nI love it\n\nIts fun and makes you wanna play more. Id love if you made a number 2.\n\nHelpful | 0", "shosholaMay 27 at 1:15 AM\n\nI cant make it teleport\n\nHelpful | 3\nDeveloper ResponseJun 5 at 6:40 PM\n\nHey Shoshola! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "1Nathan08May 26 at 12:46 PM\ni broke my vr\n\nI cant play my vr it wont load and i i tried everything but it dident work\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:24 AM\n\nHey 1NathanO8, we're sorry about your initial experience with Elixir. We released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. But if your VR is broken your issues could be related to the hardware itself.", "dlsdlrMay 23 at 9:38 AM\n\nI really enjoyed this demo. Hand tracking was easy for me to use. Everyone should try this out.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 9:53 AM\n\nThank you!", "DoodlerDudeMay 22 at 10:19 PM\nShort and sweet\n\nSolid demo. Great price.\n\nHelpful | 2", "Tuxedo-CharlieMay 22 at 6:38 PM\nGood game\n\nThis was a fun game.\n\nHelpful | 3\nDeveloper ResponseMay 22 at 6:49 PM\n\nThanks Tuxedo-Charlie! We had a great time making it!", "Gameday909May 25 at 9:53 AM\nNope\n\nCant move? Solid game 10/10\n\nHelpful | 3\nDeveloper ResponseJun 10 at 6:33 AM\n\nHey Gameday909! We just released an update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "wolflagerweyJun 29 at 10:27 AM\nGood game but ahort\n\nA very good and free game but you van only transform into 6 different hands, i expected the game would be infinite time but in 15 minutes you are don with everything. A very good experience within this time is good and this is a good game for playing on the Oculus quest\n\nHelpful | 0", "idontkn0wMay 22 at 3:54 PM\nAwesome!\n\nThe game is very simple and short but it's very fun.\n\nWorth every penny... that I did not spend\n\nHelpful | 1", "EileenSnitchJun 8 at 6:06 AM\nNever worked\n\nWhen I open the game it tells me to activate my hands?\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:47 AM\n\nHey EileenSnitch! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "BadSalesmanJun 17 at 12:16 PM\nIt great but...\n\nIts a great game but theres one problem and thats the hand tracking. I have a really hard time with the hands as they shake disappeared etc and I would really love it if there was a way to use controllers so I could experience it without problems with my hands. I know this would kinda ruin some of spells and teleporting but it would be a way to see the game without these kinds of problem.\n\nHelpful | 0", "semihtrMay 23 at 8:44 AM\n\nFuture of vr\n\nHelpful | 2", "LilMathFlashMay 23 at 12:05 AM\nTo teleport make an L shape\n\nGreat game just had trouble teleporting but you have to make an L shape with both hands\n\nHelpful | 1", "unhelthypotatoMay 28 at 12:51 PM\nTitle\n\nThe game has a great concept but seriously I cant even teleport and the L shape hands then move in slowly still did not work\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:00 AM\n\nHey unhelthypotato, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "TracermissMay 23 at 6:56 AM\nJust why\n\nThe first time I was playing yeah it was fine the next time I didnt even let me pass the first thing\n\nHelpful | 1\nDeveloper ResponseMay 23 at 9:35 PM\n\nTry redrawing your guardian or switching to Stationary.", "kenekoKittenMay 29 at 8:26 PM\nHand tracking is trash\n\nI'm putting my godbamn hands in the position as requested and it's not working it's just jittering\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:48 AM\n\nHey kenekoKitten, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "epicalex27Jun 4 at 3:02 PM\nOk question\n\nWhy when I move my head 3 inches it moves me across the little area\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:03 AM\n\nHey epicalex27, that's interesting bug that you just ran into. We value the feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that may help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "MarkStirtonAberdeenMay 22 at 3:32 PM\nBrilliant demo\n\nSeemed to work almost perfectly for me, fantastic fun. A real show the family app.\n\nHelpful | 1", "graythegraybearJun 18 at 12:45 PM\nlove it\n\nthis was a very exciting and loved experience for me\n\nHelpful | 1", "TreeWoahMay 27 at 9:29 PM\nAmazing game\n\nIts the first hand tracking game it was an amazing to\n\nHelpful | 1", "GavinyoyodudeMay 22 at 10:53 AM\nReally goodish\n\nGood\n\nHelpful | 2", "FlarnMay 22 at 11:54 AM\nWow!\n\nTitle says it all. Great Wow Factor for hand tracking. I can't wait to see what these guys do next!\n\nHelpful | 1\nDeveloper ResponseMay 22 at 6:53 PM\n\nThanks! We're always excited to build new and wonderful things!", "Darkshadow1578Jun 28 at 6:10 PM\nCould be better\n\nWhen I played the game I found it to be fine the locomotion was kinda stupid but I really enjoyed playing the game but if you want a good hand tracking game get waltz of the wizard tho overall its a free game so may as well try\n\nHelpful | 0", "MarDCaosJul 15 at 9:41 PM\nMy first pick for my first VR experience\n\nI just purchased the Quest and this title caught my attention right away, I mean, who doesn't like magic?!.\nIt's like you know exactly what I like!.\nI enjoyed experiencing the hand tracking and definitely loved the interaction and details of this game.\n\nI may have spent quite a bit of time grabbing the bugs and also playing with the poison bubbles XD\n\nI wish it was longer tho but I'll definitely re visit it sometime again.\n\nThank you for creating such a wonderful experience.\n\nHelpful | 0", "Jorge_VlzMay 22 at 5:04 PM\nBest hand tracking demo so far.\n\nCharming graphics and surprisingly polished hand tracking implementation.\n\nHelpful | 1\nDeveloper ResponseMay 22 at 5:55 PM\n\nThank you so much! I'm glad you enjoyed it!", "microchipgnuMay 22 at 2:16 PM\nThe First Steps for Hand Tracking!\n\nFlawless interaction design. Just want to see snap turn integrated too.\n\nHelpful | 1\nDeveloper ResponseMay 23 at 9:40 PM\n\nWe love First Steps! Thank you for the comparison!", "Gilagassi1May 27 at 12:01 AM\n\nA great vr hand tracking experience\n\nHelpful | 0", "hank1234021 days ago\nAlmose good enough\n\nIts amazing what thay have accomplished with this,but they need to come out with the game quick cause I cant wait to be apart of a game like if not better then Waltz Of The Wizard.\n\nHelpful | 0", "Fearfab_VRJJ25 days ago\nAmazingly well done and surprising\n\nThis app is a very nice experience. The voice used in this app is perfect for this experience. A 'must have sence of humor' should also be added to the application requirements. A 12 out of 10.\n\nHelpful | 0", "rams5555May 24 at 5:02 AM\nWOW\n\namazing little experience this \n\nHelpful | 1", "4RT1F1C1ALMay 22 at 9:34 PM\nGreat Hand Tracking Demo\n\nVery nice to see more use of hand tracking.\n\nHelpful | 1", "Kenjii.D12 days ago\nbroken\n\ncant get past the part where you gotta put your hands on the tablet, tablet constantly moves, try moving around with just head but it wont stay still long enough to activate\n\nHelpful | 0", "DerpyPugXDMay 23 at 11:56 PM\nI can teleport\n\nAt the start of the game it repeats its self over and over and doesnt let you teleport\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:22 AM\n\nHey DerpyPugXD, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking.", "r_romatherapyMay 26 at 2:36 PM\nJust wow!\n\nJust wow!!!!!\n\nHelpful | 0", "Tinyweirdo624Jun 23 at 10:35 AM\nShort but fun.\n\nI really enjoyed getting to use hand tracking for real for the first time but the game was too short. I kind of expected there to be more creatures other than a dragon and some eyeballs. But since it's free and fun I say go for it.\n\nHelpful | 0", "ollinek10 days ago\nBest game on the store\n\nIt gave me a response for not doing what I was supposed to. 10/10 would poke the eye box again\n\nHelpful | 0", "killerwolf25May 28 at 11:27 PM\n\nThe first spell will not work\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:48 AM\n\nHey killerwolf25, we're sorry about your initial experience with Elixir. We value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "CoolcatmanMay 23 at 8:49 AM\nThank you Facebook\n\nThank it god\n\nHelpful | 1", "jtesssMay 22 at 7:41 PM\nDoooooope Hand Tracking\n\nWe want more!\n\nHelpful | 1\nDeveloper ResponseMay 22 at 7:48 PM\n\nI'm glad I'm not the only person still saying \"dope\" effectively", "KayEmBeaJun 1 at 5:49 PM\nFun but unclear\n\nLearning the tutorial for this game was fun, but it's not clear when it ends. I kept getting kicked out for being \"a bad apprentice\", so I thought I was doing something wrong in the tutorial. Turns out that was the whole game! I definitely enjoyed it all, I just thought that there would be more to it based off of the description. Overall I would recommend this game if you're looking for a short, cool VR experience.\n\nHelpful | 0", "SheilkuroiJun 1 at 10:41 PM\nPromising and fun\n\nWhat I was able to play was crazy fun! The technology was so amazing and you really feel there. However the tracking froze many times and glitched so much I was only able to play a short amount of the game despite restarting multiple times. But If the tracking gets better Im looking forward to playing more!\n\nHelpful | 0", "AlpacaWasTakenMay 22 at 10:51 AM\nAmazing Hand Tracking\n\nI recommend.\n\nHelpful | 1", "Finn-McvMay 23 at 10:15 AM\nTerrible\n\nI cant even get past the rune at the start because the headset wont stay F*****g still\n\nHelpful | 0\nDeveloper ResponseMay 23 at 10:19 AM\n\nHi Finn, you can fix this by redrawing your Roomscale guardian or setting it to Stationary. Let us know if that helps!", "kiroriaJun 1 at 7:22 AM\ngame\n\nTrash\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:11 AM\n\nHey kiroria, we appreciate that you tried out Elixir. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that may help address issues that you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "TDMageJul 5 at 10:23 AM\nFrustrating.. but free, so whatev.\n\nI wanted to get excited and have a little childish fun with this, but wound up sad bc my hands kept disappearing every few seconds. I went through the motions twice and it didnt really feel like anything in the room was tactile other than the few scripted whistles and bells. Nothing changeable or variable. Its just a little 5-10 minute sniff of things to come, but I think it helped me to decide to opt out of hand tracking until its fleshed out a bit more.. PS, yes I re-did my guardian space to play.\n\nHelpful | 0", "babisdkMay 29 at 4:46 AM\nAbout \"hand function\", in this game!\n\nWell... Ofcourse I was curious, and tried to converse my Oculus Quest, in \"hand use\" model, and at start it went well... BUT..., when I reach a level, where I need to point both hands \"point\" finger at a specific stone... It simply DOESN'T WORK!!!... Please give us a \"HAND\", about, what went wrong.... With great respect... Babis dk....\n\nHelpful | 1", "AxallMay 30 at 12:39 AM\nThanks for the tech demo\n\nThis is more or less just a proof of concept for what hand tracking can do. There isn't a whole lot to do other than change what your hands look like. This hardly counts as a demo honestly. The Oculus Quest intro game has more content than this. But hey, for free, what do you expect.\n\nHelpful | 0", "NightFamilyMay 26 at 1:41 PM\nGreat potential but too buggy\n\nFirst things first, hand tracking feature is extremely cool. Turning hands into different things is fun. Premise of the game is promising and game environment looks really good.\n\nHowever, the hand steeple mechanic to move around is really counter-intuitive. The floor tiles seem to decide at random whether they want to appear or not, so youll spend most of your time trying to move around while the sorceress berates you and repeats instructions.\n\nCouldnt complete eyeball task, as the last eyeball on the floor was too low to reach. Ended up stuck, unable to progress, before the game eventually glitched out and presented my face with a continually flickering grey square.\n\nConclusion? Game has potential but needs serious work on mechanics and bug fixes.\n\nHelpful | 0", "Bad_ProMay 31 at 3:23 AM\nIt is realy fun\n\nIt love the game and the meganics, but even with al lot of different ways and video's, I came to the conclusion, the end is the end and that makes me sad, I wanted to learn from her, At first I just tought the kicked me out and I had to make my own workshop, and that woulf have bin realy cool, but no, I do the things, and I am out, that is the only part I don't like\n\nHelpful | 0", "zoroark47May 30 at 11:44 AM\nIt sucks\n\nIt is boring and glitchy\n\nHelpful | 1\nDeveloper ResponseJun 10 at 7:30 AM\n\nHey Zoroark47, we appreciate that you took the time to try out Elixir. We did release an update with bug fixes(0.1.2337). Please be sure to recreate your guardian before launching Elixir.", "rlhiiJun 29 at 10:37 AM\nLove it!!\n\nI first started and I instantly loved it. I gave four stars because I wish it were longer, but otherwise its awesome. Especially since its free.\n\nHelpful | 0", "Cookiecute516May 29 at 2:59 PM\nAmazing, but confusing\n\nI loved this! It was really good, the teleportation was a weird mechanic though, perhaps a different hand gesture wouldve been better, idk. I really liked the little story, and a thing about me is that Im very obedient. I patiently sat there not poking the box until the developer Emily just flat out told me to press it or I couldnt get on with the story. I honestly was not expecting that and I felt really bad when I went against the sorceresss orders! ;-;\nIt took me a while to figure out what I was supposed to do, and when it ended I was still confused. A fantastic demo for hand tracking, but maybe some more obvious prompts for the oblivious among us like myself could help make this a perfect experience! I personally can look past the teleportation thing, it didnt bother me too much\n\nHelpful | 1", "KingstonCormierMay 29 at 5:52 PM\nLooks great but cant pass teleportation\n\nThere is a bug at the start of the game I am on quest and when you get the game it tells you about a boundary and I have way more than needed and when you try cast the teleportation spell it doesnt work I really want to play this game but Ive tried everything and it doesnt work please try to fix this btw I love the hand tracking!\n\nHelpful | 1", "VRAnimalMay 28 at 4:14 PM\nVery Decent\n\nElixir is short, but honestly the hand tracking impressed me. It is smooth and the movement system is not too bad. It's a perfect game to introduce friends/family to the hand tracking experience but it is also very task-based so you don't have much to mess around with on your own. Instead you will find yourself completing a set of simple yet amusing tasks given to you by the sorceress narrator as her \"apprentice\".\n\nHelpful | 0", "meltingbananaMay 25 at 6:53 AM\nThat was great!\n\nI'm excited to see more! The atmosphere was amazing, the witches voice was to die for! They have a pretty good base for a game. Only reason I gave 4 stars instead of 5 was because I was having a lot of trouble with the game tracking my hands, honestly sometimes it took an entire minute for it to register that I wanted to teleport. Other than that it was excellent!\n\nHelpful | 0", "LinkFox01May 24 at 7:30 AM\nReview\n\nWhen I heard hand tracking was coming out in OC6 I was so stoked I couldnt wait to do stuff with my hands in vr I tried out the elixir demo for hand tracking and heres what I thought. I thought the game was great barely any lag the idea great graphics were great the main problem was the movement option were I was doing the same thing Hands was doing even put my finger in his/hers to make it perfect but it didnt work but I cant get caught ing that tiny little detail because Im sure that not how we will move in vr but over all I love this game and cant wait to see what hand tracking brings us great job!\n\nHelpful | 0", "Banja78May 23 at 3:24 AM\nHand tracking demo\n\nA good demo of things to do with hand tracking. game itself is not really interesting but definitively worth a try for the technology. Touching, grabbing does not feel that different to me. But teleportation is great. Looking forward to see more in the future whenever possible : pointing, counting on fingers, sliding, using fingers individually on keyboards.....thanks for offering this. Future looks great.\n\nHelpful | 0", "Koca22Jul 23 at 4:04 PM\nIts crap\n\nI downloaded this game thinking \"oh wow, sounds cool imma try it!\" But I can't get past the FIRST ROOM it keeps moving me around with headset and I dont know how to fix it\n\nHelpful | 0", "cnkspJul 11 at 5:32 AM\nBoring\n\nI see lsoling all the time\n\nHelpful | 0", "Edgetr22May 22 at 7:19 PM\nNot worth your time\n\nOver to fast and hand tracking is buggy\n\nHelpful | 1\nDeveloper ResponseJun 10 at 11:12 AM\n\nHey Edgetr22, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking. Also we do hope to expand on the Elixir universe and provide more content for our fans. Stay tuned.", "ziemer5May 23 at 7:12 PM\nI can't believe it\n\nThis kicks @ss! The hands are insane I can't believe this is a real game I'm playing. The future of gaming is happening here and this is amazing! I wish there was more to do and it was a lot longer. The graphics are amazing. Really really loved it. Had trouble the first time with the teleport but I figured it out and this is amazing.\n\nHelpful | 3\nDeveloper ResponseMay 23 at 7:16 PM\n\nI'm glad you were able to figure it out! Thanks for the review!", "ThurialaJun 25 at 6:18 PM\nCan't continue with action\n\nMany actions occur outside of the guardian zone, I'll need to reach beyond my physical walls to get there. Otherwise cool game\n\nHelpful | 0", "TylstrupMay 24 at 5:41 PM\nGreat hands tracking experience\n\nShort but sweet. I liked the different interactions and small testing, however I really wish I could do more than just playing around in the lab. I did like that there was more than one ending. Looking forward to more hand tracking integration and a full game too.\n\nHelpful | 0", "240MelJul 10 at 10:34 PM\nCute Game\n\nIts really short but cant complain since it was free. I wish it was longer, it was fun. I liked the octopus hands, I chuckled wiggling the fingers around.\n\nHelpful | 0", "Screenslaver59_May 30 at 6:51 AM\nCool experience but too short\n\nI thought it was cool until I left and was told to come back in 300 years. I was hoping for something like Waltz of the wizard where you could play around with the spells in a free environment. Overall great short experience.\n\nHelpful | 1", "TegmurkJul 25 at 1:42 AM\nMovement is broken\n\nI CANT EVEN STAND STILL BECAUSE EVERY INCH MY HEADSET TILTS I I GET FLUNG INTO THE WALL OF THE START ZONE! Please fix this\n\nHelpful | 0", "DeclaredspyJun 11 at 12:38 AM\n\nIt was rly fun but I couldn't figure out how to get past the training thing she kept kicking me out but other than that it was pretty good\n\nHelpful | 0", "jmads06Jun 4 at 10:17 PM\nFun but very short\n\nThe game was pretty fun but I was sort of surprised when the game ended after just a few minutes. It was still overall fun and it was nice to finally use the hand tracking\n\nHelpful | 0", "AlecjnJul 19 at 8:38 AM\nIm zooming\n\nFor some reason I start to zoom around the game making it unplayable, would NOT recommend\n(And no my oculus is not broken I just got it yesterday)\n\nHelpful | 0", "YeetomousprimeMay 29 at 7:09 PM\nI like it but.....\n\nI loved the game but it felt like a demo.. way too short I liked the gameplay but really really wanted more it took me 5 minutes to finish I play I played 2 times to make sure I 100% it.... but loved the game mechanics.\n\nHelpful | 0", "Twissy-87Jun 24 at 12:23 PM\nSuper fun experience!!\n\nIt's a much better fun and beautiful tutorial on how to use \"hands\" on the Quest. \n\nHelpful | 0", "Samdozmem420Jul 1 at 12:06 PM\nHand tracking\n\nAdding hand tracking in this game means that I now dont have to put new batteries in my controllers so it was a very good idea\n\nHelpful | 0", "toastdeMay 23 at 11:38 AM\nThe Best Hand Tracking Experience!\n\nThis game is amazing, usually I dont write 5 stars, but this time, I just had to, although its short, it makes you feel like your a wizard! Honestly, hand tracking didnt spark much for me, thought it would blow over, and we wouldnt really ever have any games, but this app, made me change my mind, this app, made me feel like I WAS in a different world, no VR games really make me feel like Im in their world, but this app I was so blown away that I wont lie, wanted to play it again, this app is amazing, the only problem I had was with teleport, if it could be a little easier to recognize the hands, because I was stuck and it wouldnt let me teleport for some reason, but I got it working now and I do have to say, the experiences where your hands turn into creatures hands, is the best part about this game. Devs, I can tell you worked hard in this, and you deserve an Award!\n\nHelpful | 2\nDeveloper ResponseMay 23 at 2:31 PM\n\nThank you so much. We're happy you loved Elixir and are proud to have changed your mind about hand-tracking!", "Catsareblue21May 23 at 4:24 AM\nSo good\n\nThank you for making a hand tracking game for free but its so fun its cool to see the features Ive been waiting for months to be in games actually be here I would definitely recommend it may be short but its so fun and its cool to se the features come into play good job but developers I would change the teleportation make it like maby the walts of the wizards where you can point down to walk but anyways good job and keep it up \n\nHelpful | 2", "eggkiddMay 27 at 12:01 PM\nNice short experience\n\nIt was cool for a bit but too much hand (ha) holding. No way this would be worth money, so it's great they made it free. If you want a more substantial hand tracking experience then go to Sidequest and get hand physics lab\n\nHelpful | 0", "hobblin_goblinMay 25 at 6:36 PM\nThis is a paradigm shift...\n\nI don't understand all the negative feedback for this game. It is short and relatively simple but it is free and meant to be an introduction to hand tracking. The movement system worked fine for me and I had no major issues. I firmly believe that hand tracking is the future of VR.\n\nHelpful | 2", "bb1216Jun 14 at 9:00 PM\nWow. Such Crap.\n\nThere are so many ways this game could be more user friendly. Like telling the user to put down the controllers instead of telling the user to change a non-existent setting. Or refusing to load in stationary mode since it requires roomscale. There's no way that Oculus would allow this crap from any other developer besides itself.\n\nHelpful | 0", "SebTheIdiotJun 16 at 11:30 AM\nI move around WAY to much\n\nI was excited to play this game when I first downloaded it, but the second I got in it was frustration after frustration. It took me 15 mins just to put my 2 hands on the stone. I couldnt even learn to teleport because I was just kept moving and I couldnt stop. 1 Star :(\n\nHelpful | 0", "Chase_LinnJun 4 at 10:35 PM\nVery good game\n\nThis was a very good and fun game but I feel like it was very short but it was very fun because of the hand tracking cant wait for more games like this\n\nHelpful | 0", "greycharmingMay 31 at 7:39 PM\nInteractive AND CREATIVE\n\nI'm simply sad this wasent longer. You pulled me into this I got excited and could have spent few hours on this playing with everything and finding things. It's better then the wizard game and the graphics are up to par for sure. The story is good. Hoping you are releasing a paid version or something otherwise this is\n\nHelpful | 0", "psully4114May 25 at 12:10 AM\nAs far as tech demos go, this is one.\n\nIts free. Its like 15 minutes long. You get to experience what its like to teleport around a small area and have hands. Its very exciting. 10/10 would use hands again.\n\nHelpful | 0", "adamkanderson03Jul 15 at 5:55 PM\nFun hand tracking\n\nIts free and fun to experiment with hand tracking\n\nHelpful | 0", "ParadiseDecayMay 26 at 11:26 AM\nOne of the best HT experiences!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=YuuoUz2D6pk\n\nMy Initial Thoughts:\nOne of the best hand tracking experiences to date!\nGive it a try its FREE!\n\n*OCULUS please sort out the issue of Quest not recording sound in certain games, this is the 4th time this has happened to me!\n\nHelpful | 0", "El_DudenessMay 26 at 5:46 PM\nGreat Game  needs a sandbox mode\n\nThe game is great, I am surprised how well hand tracking worked. This could be a start of something new. I have a leap motion that barely compares to the clarity and playspace that your hands can move in. This game was more of an experience then a game. It was short which I understand because it's free . But it could use a sandbox mode were you can pet the dragon and use new features such as new hand and maybe a physics engine were you can push objects and pick them up. 5/5 great job oculus\n\nHelpful | 0", "Djtiny_beepiJun 7 at 11:47 PM\nDO NOT DOWNLOAD\n\nYou see all these people saying oh my what an amazing game LIES oculus hand tracking isnt this advanced you touch your hands together POOF HANDS ARE GONE when I put my hand in front of the oculus POOF HANDS GONE there are no cameras in front of the oculus. Go look. Take off your headset and look. Only cameras on the side and the voiceover is EXTREMELY ANNOYING the movement system is terrible, AND You have to turn around everywhere to see what shes talking about. I slightly touch my controllers WHAT ARE YOU DONING GET THOSE OUT OF YOUR HANDS but when I pick up my controllers to get out of the game NOTHING I have to spam buttons on my controller for this stupid voiceover to recognize it. this game is terrible DO NOT AND I REPEAT DO NOT WASTE YOUR TIME ON THIS GAME\n\nHelpful | 0\nDeveloper ResponseJun 10 at 10:45 AM\n\nHey Djtiny_beepi, we're sorry about your initial experience with Elixir. We value your feedback and hear you. There are some thresholds that we can tweak and update to help with some of the issues that you and other users have ran into. More updates to Elixir coming in the near future.", "VoiD_s3c2May 28 at 3:54 PM\nBoarde issues\n\nI have a 7 ft x 7 ft boarder and it still manages to get important parts of the lab outside of the boarder, and I even punched a wall at one point trying to poke the eyeball chest. With this, I had to restart the game several times, and still I cant even get past the tutorial due to this issue. A good suggestion would be to make a recentering function by holding down the pause button on your left hand. Either that or adding teleportation to the lab... I really believe this game has great potential but its just locked up due to not even being able to reach anything.\n\nHelpful | 1\nDeveloper ResponseJun 10 at 10:58 AM\n\nHey VoiD_s3c2, we appreciate that you are wanting to try out Elixir in its full free walking capabilities. It was designed to work best in a 8 x 8 space. We recommend updating your guardian to that size. Also generally speaking we pushed an update (0.1.2337)that has bug fixes. Update to latest, recreate your guardian, and give it another try.", "pondfrogsMay 24 at 10:30 PM\nsuch a wondeful experience!\n\ni am new to vr and in the older generation as far as video games and it takes me a while to catch on sometimes. the hand tracking took my about 10 minutes to figure out and then teleporting was pretty good. i loved the fun interactive objects, stunning colors and cute narration! i found myself laughing out loud during most of it. i wish it was longer play time but will for sure play it again and show it off to others. great that its free and id be happy to pay for updates. i would love to poke the dragon more lol. great job developers-please make more!!! thanks so much!!!\n\nHelpful | 0", "DemogorgonWhiteMay 24 at 6:16 AM\nTiny, Free, Amazing\n\nIt is a really short experience you can finish in 10-15 minutes. It is basically a first contact handtracking game. Not giving much freedom but really fun to play for a while. Give you perspective on how a hendracking games of the future can be. I would say it is a must play for Quest. Why not? It is free after all.\n\nHelpful | 0", "SpooopyBeanMay 24 at 11:02 AM\nFantastic virtual environment!\n\nWhen I first downloaded this onto my Oculus, I wasn't expecting much. It was free and there was a good amount of negative reviews, but it did have hand tracking (something I've been hoping more developers would put in their games). However, once I started it, I was immediately transported into a gorgeous fantasy land surrounded by fire bugs and glowing candles and the scenery got even better once I made it to the sorcerer's room. The first time I played through I immediately poked the eyeball on the chest despite the warning from the sorcerer and chaos ensued. The second time, I put off poking it for so long that the developers message telling me to touch it came on, twice.\n\nNow, while this game is incredibly well done I did experience a minor bug while I had the 'octopus' hands. I was trying to summon the Oculus menu by pinching my fingers together, however it couldn't register it because of the tentacles. Other than that, I can't recall experiencing any other problems, though I do have a few suggestions.\n\nAs the game was so enjoyable (albeit short), I played through it a couple times, trying to find new things to do or different 'paths' to take and I only was able to find one (which is cutting the rope or not cutting it). It would be incredibly neat if the developers could add different 'paths' you could take that are dictated by your actions. For example, if you didn't poke the eyeball, perhaps the sorcerer would come back, be pleased with your actions, and proceed to teach you how to make potions. And of course, who wouldn't love it if the game was longer!\n\nAnyways, kudos to the developers, it's clear a lot of time and effort went into this game. I thoroughly enjoyed it and will definitely play through it more!\n\nHelpful | 0", "KadenSteedJun 4 at 2:25 PM\nWish it was a game\n\nI like Thais as a demo but I think that you could turn this into a game just give it objectives and a bigger map\n\nHelpful | 0", "solakian1Jun 13 at 10:53 AM\nCould barely move.\n\nI could barely place my hands on the stone before the game even started!! Every slight head movement caused me to go shooting one way or the other. How am I supposed to be steady and play a cool looking game if my person wont even stay still??\n\nHelpful | 0", "Beast220055Jun 3 at 5:00 PM\nNot enough content\n\nThe whole app would be better if there was a little more content to the actual storyline it could be made into an actual neat game but just not enough content and goes to fast I played it a few times to see if there were different endings or different scenarios but none so it was very lacking\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:04 AM\n\nHey Beast220055, we appreciate that you'd like some more content. Our hopes is to expand on the Elixir universe in the future. Stay tuned.", "ndarnoldJun 16 at 9:58 PM\nNot really a review, but could use help\n\nSo, was excited about first hands only game. But I can't even get past the first part. She says put hands on the stone, but it keeps moving away and won't be still. What am I doing wrong? Any advice?\n\nHelpful | 0", "matirishhhMay 25 at 1:33 PM\nV(R)ICKED\n\nI cant understand why people down rate this game. Sure its very short, but its not only free but its a huge milestone for VR. I would love to buy a full game like this. Art direction, voice acting, humour and tech all top notch. Just play it. I cant take a grin out of my face. SO wicked.\n\nHelpful | 0", "CasualCheetahMay 28 at 7:00 PM\nHand tracking! Shame about the voice...\n\nGreat, free introduction to handtracking. That overexcited, uncomfortable voice is a bit of a deal breaker though.\n\nHelpful | 0", "Ghostforever75May 28 at 4:16 PM\nDoesnt work\n\nI waited so long for this to come out , but when I got into the game it just kept moving me around and couldnt even get past the title screen. This was a horrible introduction into hand tracking.\n\nHelpful | 3\nDeveloper ResponseJun 5 at 6:35 PM\n\nHey there Ghostforever75! We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "Flashbang2411May 22 at 2:37 PM\nBrilliant, a new milestone for VR\n\nThis is a fairly short game, it's more like a showcase or experience, it's fully hand-tracking supported and that in itself is absolutely incredible. Really worth installing to experience Hand Tracking in-game. It's a little buggy, very slightly but for what it is and for one of the first \"Proper\" games of it's it's kind, I can forgive the bugs.\n\nCrazy fun. Brilliant and really quite wow.\n\nHelpful | 1\nDeveloper ResponseMay 22 at 7:57 PM\n\nWow, that's a lot of compliments! Thank you for playing.", "Ghost_VFXMay 30 at 3:58 PM\nGreat Hands Demo\n\nPretty cheesy idea all around but an amazing utilization of the newer hand tracking tech and shows its clear potential - MUST TRY!!!\n\nHelpful | 1", "kbinowskiMay 30 at 5:17 AM\nI like the concept but I don't like it\n\nThe looks are good don't get me wrong but I wasn't able to get past the teleport part because it wasn't letting me get through so I tried to use the controllers but it didn't work so this game sucks and whoever created this game why can't I just put out a finger to teleport because I wasn't able to get my fingers right.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:13 AM\n\nHey kbinowski, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking", "garrettfuselierMay 25 at 2:31 PM\nSuper fun!\n\nLove showing this to other people. Its such a fun, quick demo of the amazing things you can do with hand tracking. I wish it was a full game!\n\nHelpful | 0", "MrMemeChungusJun 25 at 5:49 PM\nI hate it\n\nI played the game, and it was ok. But I was playing it on my oculus quest when it almost short circuited it and I needed a hard reset. Would not recommend whatsoever.\n\nHelpful | 0", "Ajp121926May 25 at 11:21 AM\nIts a really good hand tracking demo!!\n\nI absolutely LOVED this game, it was one of the coolest games I have ever played, and the fact that it was hand tracking compatible is great! I dont mind that it was short, but I do believe there could've been more things to do in it. But other than that it is REALLY GOOD.\n\nHelpful | 0", "VR_Overdrive_May 22 at 12:37 PM\nSuch a good game\n\nI *loved* this game. The hand tracking was a little bit glitchy (to be expected for an early state of hand tracking). It worked so well and I really really hope they make some kind of part two, because I would TOTALLY buy a sequel if they made one. Keep it up! (And pls make a part two :)\n\nHelpful | 1\nDeveloper ResponseMay 22 at 7:59 PM\n\nWe're not even sure what we'd CALL a sequel. Ellixir? Elixir2: 331 Years Later? Elixir2: The Return of the Pudge?", "atirathaMay 23 at 1:52 PM\nOculus First Steps for handtracking\n\nThis was a lovely demo with cool atmosphere. Especially the voice acting added a lot. I feel even in the small room setup, there is a lot of possibilities to turn it into a sort of mini game. Electric hands, robo hands, tentacle hands, oh my, I would love to have some fun using them,but some are totally glossed over. It makes me want to do more! Thanks for fun, if short, experience.\n\nHelpful | 1\nDeveloper ResponseMay 23 at 2:29 PM\n\nWe're happy you enjoyed the voice acting!", "realblushMay 23 at 8:45 AM\nMagical in multiple ways\n\nI still cannot believe this is real. I always love to experience the newest in Tech, but Elixir feels like a title that should be possible by 2030 - and yet here we are.\n\nFrom the inteoductory scene up until the end, you dive into a small yet detailed world of magic. It is impressive how the developers managed to create such a charming place with lovely graphics and animations that look amazing every single time.\n\nBut of course - hand tracking. I loved to show this feature to people, but a fitting experience was missing - Elixir is that experience. I don't want to spoil anything, but looking at your hands, touching stuff and moving your hands around never felt this amazing. This truly is a new step in experiencing digital media - and is just as facinating as seeing VR for the first time. I was missing that feeling, but the devs managed to bring it back.\n\nThank you so much for the groundbreaking and sweet game/experience. It is free, of course everything should buy it. But more importantly: I cannot wait for what you will do in the future.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 9:09 AM\n\nThank you for saying such wonderful things about Elixir. We're proud of it and I'm so happy that you've enjoyed the experience!", "Rylee.FMay 28 at 6:28 PM\nI couldnt even play it\n\nI highly recommend u dont play this game I couldnt even get past the title screen. I kept moving away and couldnt lock my hands onto the rune thing the screen kept moving around and I tried so hard for it to work but I couldnt. This game is full of bugs and while I looks like a fun game how can u enjoy a game if u cant even get past the title screen. I hope this game gets an update soon because I really really want to play it the hand tracking seems so cool to play around with\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:20 AM\n\nHey Rylee.F, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking.", "tsl3161991Jun 12 at 9:43 PM\nTotal waste of time and effort\n\nAbsolutely do not buy this. It's basically an inferior version of Waltz of the Wizard. Being free is the only good thing about it. The game ends after barely one minute of gameplay and the hand tracking is mediocre at best.\n\nHelpful | 0", "j70610May 22 at 11:00 AM\nI love this game\n\nAmazing hand tracking demo and its free just think they could do teleporting a bit better but besides that its almost perfect.\n\nHelpful | 4\nDeveloper ResponseMay 22 at 6:57 PM\n\nThe game loves you!", "kilabinJun 10 at 12:50 PM\nissues\n\nThe concept is great! But the handtracking DOES NOT WORK every wrong move, every wrong turn and your hands are gone. the headset has problems with seying your hands when they're right in front od it.\n\nHelpful | 0", "VR-NL-20May 26 at 5:01 AM\nWow! Dad this game is awesome!\n\nThose were the first words my teenage daughter said when the game started. Hand tracking games are new and have so much potential, kudos to the team who got ahead of the curve and made one of the first games. I also love the job description by the way.\n\nHelpful | 0", "DDay619Jun 1 at 9:31 AM\nReally Neat Tech Demo\n\nWorked super well for me. I had previously calibrated hand tracking. Super cool example of how hand tracking can be implemented in games. Gorgeous environment, but very short. It's free so absolutely worth downloading.\n\nHelpful | 0", "CarsonDoTheSwagMay 26 at 2:59 PM\nDang\n\nHonestly thought it was gonna be like one of those weird sidequest handtracking games, but I'm suprised on how it came through, works just fine, teleporting is good to. And the hand tracking feels much better than it usually does on sidequest games.\n\nHelpful | 0", "Alphaplayer0May 23 at 8:13 AM\nAwsome\n\nIt took a few minutes to get the teleport gestures right but thats just because it was new to me, this has been so beautifully crafted and really shows how hand tracking can increase immersion in VR. Absolutely loved this and cant wait to see what comes next\n\nHelpful | 0\nDeveloper ResponseMay 23 at 8:18 AM\n\nThank you! I'm glad the teleport gestures worked out for you and that you enjoyed the environment!", "Lysergic.DadMay 28 at 2:44 AM\nDisappointed\n\nI've been waiting for the title since the moment it was announced and I'm not impressed with the gameplay. The hand tracking tech is definitely making substantial improvements but this game is very poorly written and designed. It couldn't maintain my interest for more than a few minutes. Aside from the fact that its a free title there's not much to appreciate here. Just my opinion but I'll definitely be deleting this the same hour I downloaded it. Give it a try, the tech is cool but there are far more enjoyable hand tracking physics labs than this complete game.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:19 AM\n\nHey Lysergic.Dad, we value your feedback and hear you. We're hoping to expand the Elixir universe and give more depth to the user experience and much more content. Elixir was originally designed as a OC6 demo. The narrative was written as a very quick user experience to give developers about 10-15 minutes to get exposed to the hand tracking technology. Stay tuned for future updates of Elixir.", "steamingpiranhaMay 23 at 9:45 PM\nBit of problems\n\nI had a lot of problems with the tracking on my hands it might have been my lighting but besides that I loved the little demo\n\nHelpful | 0", "Ryanguz04May 22 at 8:59 PM\nThe first hand tracking\n\nThis is one of the best experience ever, and I really love it. I was expecting the experience to be longer but it was very short.\n\nHelpful | 0", "Kirby24601May 26 at 4:15 PM\nFun game, hoping for more\n\nFor a free game, this was really fun! Hand controls increase immersion; teleporting feels like youre actually casting a spell rather than pressing a button on a controller. I would love to see a longer (paid) version/sequel in the future!\n\nHelpful | 0", "TLCloakMay 25 at 9:57 AM\nVery Cool\n\nVery good demonstration of hand tracking possibilities. Teleportation worked fine for me, however grabbing things was a bit touchy. Would be interested in seeing a full blown application of the hand tracking, or even just a bit more of this one.\n\nHelpful | 0", "Maxpower2May 24 at 1:29 PM\nReview\n\nIt is a great fun relaxing game for beginners but it is a small game and my only request is to add a sand box mode\n\nHelpful | 0", "3AZeroJun 28 at 9:20 PM\nFun but very short\n\nGreat fun to use just your hands but wow is it short. But it is FREE!\n\nHelpful | 0", "LukieSkywalkerJun 1 at 9:30 AM\nTerrible\n\nI spent 30 minutes trying to get in to the game but I couldnt hold my hands on the platform long enough.\n\nDONT GET THIS GAME\n\nHelpful | 3\nDeveloper ResponseJun 5 at 5:35 PM\n\nHey there! We're sorry to hear that you ran into some issues getting into the experience. We value your feedback and hear you. As the developer it is important that the oculus community is able to experience Elixir as it was intended. We just released a new update that addresses some bugs. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "MatoxicJun 12 at 11:16 AM\nPretty Fun\n\nIt was pretty fun\n\nHelpful | 0", "Banana2008May 29 at 7:15 PM\nAmazing but short!\n\nIt was an amazing experience to use the hand tracking but sometimes it didnt work :/ its really short but I recommend playing it :)\n\nHelpful | 2", "yalgkingMay 29 at 11:38 AM\nUnplayable\n\nYou cant even get into the game I was excited about hand track till I tried this piece of virtual trash. You cant get pass the menu screen unless you can stand completely still and not move an centimeter, it is a horrible game DO NOT BUY THIS GAME!\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:15 AM\n\nHey yalgking, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking", "ShemhamJun 7 at 5:46 AM\nI really enjoyed this.\n\nOK so it's short but it demonstrated the potential for hand tracking beautifully! Very well made and I personally enjoyed the narration. Well done!\n\nHelpful | 1", "sylbeeMay 22 at 11:26 PM\nIs everything this good?\n\nThis is the second VR game I've done and it's so much fun. Even touching the book of credits at the end was like magic. I'm so glad I got a Quest!\n\nHelpful | 2", "EMB3R_ASHJun 6 at 2:34 AM\nGood\n\nAmazing but short\n\nHelpful | 0", "schweichenMay 25 at 8:13 AM\ngood for showing others hand tracking\n\nIts good but the teleportation was kinde trash, but first time it was ok.\n\nHelpful | 0", "boybrownMay 23 at 12:56 PM\nFuture Technology NOW!!!\n\nElixir is a fantastic starting point in the evolution of hand tracking. Its amazing what has been achieved on the current hardware. It will only getter better from now on but Elixir is a brilliant starting point.\n\nHelpful | 1", "mjsimoneMay 24 at 4:13 PM\nNice Demo\n\nGreat to finally use hand tracking. I hope the controls can be refined.\n\nHelpful | 0", "chinwi96May 24 at 4:27 AM\nSpanish please!!\n\nGreat experience, but as most of games it lacks the Spanish language.\n\nHelpful | 0", "pumkinjackMay 23 at 6:31 PM\nAwesome experience\n\nReally cool game. My son and I love it. Hope to see more creative hand tracking experiences like these in the future. Well done!\n\nHelpful | 2", "mmead3May 28 at 8:48 PM\nWorks great\n\nWorks great for me. It's a great intro for what's possible with hand tracking. The hand tracking is glitchy in waltz of wizard and stolen pets but feels pretty polished in this game\n\nHelpful | 0", "emmettjedMay 29 at 10:45 PM\nGreat experience\n\nAmazing game and its free, thats a great price. It really made me like WOAH. Like the the first time I tried vr. Very good game although I wish there was more to it.\n\nHelpful | 1", "Fraley99May 29 at 12:32 PM\nToo buggy\n\nI wanted to try this game since it was free and uses hand tracking but its unplayable. As soon as the creator titles disappear the screen starts flashing and glitching making it literary impossible to play\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:14 AM\n\nHey Fraley99, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking", "BirdBrainsInParadiseJun 3 at 2:52 PM\nOne of the coolest VR experiences yet\n\nThis game is so enchanting to play, I hardly mind that its short. Hopefully more levels or experiences are to come, because this was just marvelous!\n\nHelpful | 0", "nscdogMay 23 at 11:10 AM\nI there a different ending\n\nReally fun for the price of free please make a full game I would love for it to become a full game so excited for after the quarantine to show my friends and family this game\n\nHelpful | 0\nDeveloper ResponseMay 23 at 2:32 PM\n\nAt least during quarantine we've given you the opportunity to touch a bunch of gross stuff without needing to wash your hands after!", "DJYONDER2334May 31 at 8:47 AM\nBROKEN\n\nOn the first level I moved my hands in the position of Hans hands but it kept saying move your hands\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:14 AM\n\nHey DJYONDER2334, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir.", "Gina2909Jun 16 at 6:40 AM\nAmazing experience\n\nNot much to say about it, its just awesome!\n\nHelpful | 0", "SimJooMay 30 at 2:50 PM\nVery fun experjence\n\nAlthough the hand tracking itself isn't that great yet (my hands disappear all the time), the game itself was actually really fun.\n\nHelpful | 0", "Andrew_G_YodaMay 29 at 2:45 PM\nHand tracking\n\nWhile hand tracking seems amazing it doesnt work most of the time Ive tried fixing it but nothing works the game is free but itll rip you off by putting time into it\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:21 AM\n\nHey Andrew_G_Yoda, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking.", "ConnorGuyJun 2 at 8:26 AM\nAlmost Made Me BREAK MY HEADSET\n\nThis game made me so mad because I could not stand still for 1 second because of how sensitive the movement was please fix somehow but love the idea.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:09 AM\n\nHey ConnorGuy, It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences.", "Plaguey_doctor12847Jun 7 at 8:57 PM\ngreat game but...\n\ngood game but i think they should add a free play mode and add more potions\n\nHelpful | 0", "morganjohnsMay 30 at 1:55 AM\nWhyyyyy\n\nThe start wow thanks Hans ok I was doing the gesture for fs sake\n\nHelpful | 2\nDeveloper ResponseJun 10 at 7:17 AM\n\nHey morganjohns, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issue you are experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also make sure you are in a well lit area when playing hand tracking experiences.", "pestosauceJun 7 at 3:59 PM\nToo short!\n\nThis game was a blast and so much fun but too short\n\nHelpful | 0", "amari2011Jun 7 at 2:15 PM\nAmazing app\n\nI really love this game.but i waited to long for it\n\nHelpful | 0", "randomace59Jun 12 at 6:29 PM\nYes\n\nGood Game.\n\nHelpful | 0", "BenTheDeerMay 29 at 12:11 PM\nThe teleportation wont work\n\nI tried everything on every review and developer review and it will not work one bit. I need help with it.\n\nHelpful | 0\nDeveloper ResponseJun 10 at 11:16 AM\n\nHey BenTheDeer, we value your feedback and hear you. It's important to us at Magnopus that all users are able to play Elixir as intended. With that said we released a new update that should help address the issues you were experiencing. If you've updated to the latest version of Elixir (0.1.2337) please be sure to recreate your guardian before launching Elixir. Also, make sure you are in a well lit area when playing hand tracking experiences. This can help with the hand tracking"]