{"App Title": "Elven Assassin", "App description": "Is there anything more epic than slaying hordes of orcs and dragons with a bow in Virtual Reality? When nothing comes to your mind, then you probably should try this. If you thought: \"Of course, slaying them with my friends online in co-op mode!\", then this is the matter of destiny.\n\nBECOME AN ELVEN ASSASSIN.\nTake a bow and kill hundreds of enemies that want to get into the elven town and destroy it. As an elven assassin, you will make spectacular shots like long distant headshots.\n\nPIECE OF CAKE THEN?\nNot really.The Orcs are running fast, they break into houses to hide from your arrows, and when they got furious their massive axe is thrown to splash you head into pieces. \n\nASSASSIN UNITED.\nUp to four assassins may unite to defend the town. Communicate using voice chat, but watch your language. \n\nDisclaimer: \nAny similarity to any other fantasy movie, game or book is purely coincidental.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, RPG, Simulation", "Languages": "English", "Version + Release Notes": "1.3.1f", "Developer": "Wenkly Studio Sp. z o.o.", "Publisher": "Wenkly Studio Sp. z o.o.", "Website": "https://www.elven-assassin.com/", "Release Date": "September 5, 2019", "Developer Privacy Policy": "Contact:\ncontact@wenklystudio.com\n\n\n790661123\n\n\nOffice Address:\nul Prymasa Stefana Wyszyskiego 11/201\n44-100 Gliwice\n\nInformacje o Danych Osobowych\n\nLegal info:\n\nWenkly Studio Sp. z o.o.\n\nul. Prymasa Stefana Wyszyskiego 11/201\n\n44-100 Gliwice\n\n\nPrivacy Policy\nElven Assassin - Terms Of Service\n\n\nKapita zakadowy: 5000,00 PLN\n\nnumer KRS: 0000570301\n\nNIP: 6312658273\n\nREGON: 36220647400000\n\nCopyright  2020 Wenkly Studio.", "Developer Terms of Service": "Wenkly Studio\nVR production & 3D games development\n\nWe are a virtual reality studio from Gliwice, Poland. Our goal is to create immersive experiences that entertain people from all around the world.\n\n\n\nBesides making games, we help enterprises by crafting VR and AR solutions, highly tailored to satisfy their business needs - even the most sophisticated ones.\n\nWe are an experienced game producer & publisher. One of our best titles, Elven Assasin VR, has more than 800, 000 active users worldwide.\n\nWe create our experiences with the Unity3D Engine. Having that said, Visual Studio and Git repositories work best as our programming environment.\n\nGamification is our thing. As well as creating the open world experiences for the variety of platforms and users. Our imagination has no limits!\n\nYoull find our office in Gliwice, Poland. Both on map and in person - we encourage you to visit us and discuss your idea anytime.\n\n\nVR PRODUCTION & 3D GAMES DEVELOPMENT\n\nVR & 3D GAME DEVELOPMENT\n\nMaking a game its not a hobby. Its an art. Our games development team consist of 25 passionate developers and visual artists. Let us convert your unique idea into fully interactive, engaging game experience for mobile or VR devices.\n\nExplore our Titles\nVR GAMES FOR VR PARKS & ARCADES\n\nAre you an VR Arcade Owner? We encourage you to make yourself familiar with our highly immersive commercial titles, fully integrated to the top-rated VR headsets. Provide your customers with endless hours of fun - and watch them going back for more.\n\n\nVR Arcade Games\nPlay Video\nAll Videos\n\nVIRTUAL REALITY\nFOR BUSINESS\nVR\\AR\\Unity3D DEVELOPMENT\n\nImmersive experiences in VR and AR are used in many industries to prevent workplace accidents, increase efficiency, develop professional skills and minimize unplanned downtime.\n\n\nWith over 5 years of VR experience, Wenkly Studio supports companies in moving with the times by offering fully-customized VR trainings, which meets the exact needs of a specific industry. See, what we can do for your business.\n\nSome work-related situations are too dangerous, or expensive, to practice in the real life. That's where the VR steps, showing employees the consequences of their risky behaviour.\n\nVR trainings are fully immersive, capturing the employees full attention. They are more willing to practice in the highly realistic, interactive environment.\n\nGamification is proven to have a great impact on the users engagement by combining fun and competition. Why not use it to activate your users, clients, or workers - you name it.\n\n\n\nFit a whole collection of massive components, bulky machines and customizable products in one device. Let your customers experience your brand through a fully-interactive, realistic experience.\n\nBusiness Portal\n\nWe can work with you on a fixed time/budget basis or using a more agile approach whichever is more convenient for you. Or maybe you need a flexible outsourcing partner.\n\n\nCareers\nUnity3D Developer (All Levels)\nLevel Designer\\Enviro Artist\nGame Tester\\Community Support\n\nBlog\nMeet our team!\nBut hey, where are youfrom?\nPoland, Gliwice\n\nContact:\ncontact@wenklystudio.com\n\n\n790661123\n\n\nOffice Address:\nul Prymasa Stefana Wyszyskiego 11/201\n44-100 Gliwice\n\nInformacje o Danych Osobowych\n\nLegal info:\n\nWenkly Studio Sp. z o.o.\n\nul. Prymasa Stefana Wyszyskiego 11/201\n\n44-100 Gliwice\n\n\nPrivacy Policy\nElven Assassin - Terms Of Service\n\n\nKapita zakadowy: 5000,00 PLN\n\nnumer KRS: 0000570301\n\nNIP: 6312658273\n\nREGON: 36220647400000\n\nCopyright  2020 Wenkly Studio.", "Space Required": "1.11 GB"}



["5 stars\n47%\n4 stars\n31%\n3 stars\n10%\n2 stars\n6%\n1 star\n6%", "vigoexisteJul 3 at 1:33 AM\nGreat Co-Op, greater PvP\n\nUpdate: Really? No answer in 2 months? Not a single \"on it\" or \"will be beta forever\"?\n\nThe PvP mode is gorgeous. Just one thing: it's been \"beta\" for months, and there's just one scenario. Big drawback.\n\nLet me be clear: I'd be glad to pay a reasonable amount for each additional PvP scenario as long as they're large and well designed. Of course I don't mean another $20 to add 1 new map, but I know I would pay $10 for two or three PvP scenarios and I know a handful of players that would do the same. And we would enjoy killing each other multiple times in those new scenarios.\n\nSo, important question for the developers: are there new PvP scenarios planned for the near future?\n\nAlso: Remove PLEASE the \"get out of there\" message. PLEASE.\n\nAnd now just a bit of positive criticism:\n\n* The servers are a bit upsetting sometimes, in various \"glitches\" that happen quite often:\n** Having to click \"join\" several times, going back and forward, to be able to finally join a game.\n** Games disappear from the list, again needing to go out an in again.\n** Sometimes it's just impossible to play a good PvP game due to lag and constant falling out of the server. Tested several times and ways to be sure it's not my local internet connection but some server issues.\n\n* Even a small lag can be frustrating sometimes, due to arrows not hitting what they're supposed to hit, but it's something that can be learned.\n\n* Cheating by going inside walls or out of the allowed zones is too easy. Whenever I find a cheater in PvP mode I can't do anything like kick them out of the game (if I'm the one that initiated the game, of course) and it's frustrating. Either that should be controlled by the game mechanics or some ban option by the current game \"host\" should be allowed.\n\nI will change my score to 5 stars if my concerns are addressed, mainly the beta status of the PvP mode (I don't mean immediately fixed, just a nice answer from the developer about that). Because I really like the game :-)\n\nHelpful | 46", "Grawill79May 31 at 12:29 PM\nGreat game but needs some polish\n\nThis is a fun game thats challenging enough and doesn't require a sharp leaning curve. It just needs a few tweaks to polish it up to a 5star.\n\n1. Multi-player connect is buggy, multiple tries to join a game are required. Eventually it will connect, but for the cost of the game this basic function should be much better.\n2. A bit more strategy with shooting the bow is needed. For example, further pull back equals more damage and/or longer shots.\n3. Buying a better bow should come with some kind of damage/distance/spell option increase. Buying a bow simply for the looks really pulls away at the desire to continue playing and improve.\n\nHelpful | 143", "sandrock3922 days ago\nI absolutely love this game!\n\nI absolutely love this game, especially the multi-player version. It's great fun, challenging (once you get past the 1st 15 or 20 waves), it's enjoyable chatting with the other players and despite you essentially standing fairly still, is a pretty good workout when you start to get overwhelmed by orcs & dragons.\n\nA run from wave 1 to 100 takes roughly 90 minutes of brilliant fun (I'm not sure how high the waves go, I've reached 158 so far) or in multi-player you can pop in and out of the game whenever you want, so you can play for as much time as you have available, and the people in a multi-player game above wave 50 really want/need people to join in so they don't get overrun by Orcs.\n\nThere was a big update about 2 (ish) months ago which fixed the multi-player connection issues that a number of reviews have mentioned so it's much better in that regard but unfortunately the same update changed something in the bow/arrow/hands area and now the accuracy is a bit different (which is why I went for 4 stars instead of the 5 stars it generally deserves). Before that update once you had learnt the game an accurate shooting style felt natural even if you didn't play for a couple of days. Now every single time you play the game it feels like you have to modify your natural shooting style/hand positions and relearn how to be accurate. There was a very obvious change as soon as it updated and all the people I played with noticed the same thing. Luckily you have the easier 20 or so waves at the start of each game to get an accurate shooting style again.\n\nThe only other thing I would change about the game is the bow/helmet purchasing/upgrades. At the moment, from what I've seen and heard, buying a new bow or helmet with the coins you've earnt doesn't change anything but the appearance of them, there's no difference between them in terms of accuracy or distance etc. I think having different attributes etc would add something to the game.\n\nOverall, I really do love this game and play it every chance I get (for hours and hours at a time) and I would highly recommend it to people.\n\nHelpful | 4", "Blitzman135223 days ago\nGreat Game\n\nI love this game. Only wish there was a way to play gamers that dont have the Gatling gun arrows. Not fair to those who want to play by skill, not firing a ton of arrows. Takes the fun out. Also when you buy upgrades there should be some kind of incentive to upgrade. Right now you get nothing but a fancier outfit. But overall a great game.\n\nHelpful | 4", "MAGEBA7316 days ago\n\nGreat game with lots of potential. Sometimes aiming is a little hard. Are there endless waves? It feels like it isn't possible to win this game. This is frustrating.\n\nI wish the following changes for a future update (or maybe for Elven Assassin II):\n- directly spawn on an empty tower when joining a game.\n- more maps\n- a clear game target which makes possible to win the game\n- a coop game mode with story which sends you from battle to battle instead of attacking waves only.\n\nHelpful | 3", "AlextorndjJun 20 at 5:55 AM\nNice game that could become great !\n\nI was hesitating to put 3 stars but I'll go for 4, to show the devs some support.\nSpeaking of support I've also bought that game twice as we have two Quest headsets at home.\nSo why my hesitation? I love this game but it's really really frustrating.\nElven Assassin is the only one of its kind on the Quest store (medieval bow shooter)...and considering the growing success of the Quest, it would really be a pity if this game would not reach its full potential.\nRight now it really feels like a beta...a good beta tho but it feels incomplete and suffers from many annoying bugs. Mostly in multiplayer mode where the game is really buggy and crashes a lot...sometimes it crashes so hard that you need to restart your headset to be able to play again !\nThe solo mode would really be great with a campain, something to complete. Infinite waves become boring after a while.\nThe multiplayer coop mode adds a lot more fun. But can also become repetitive with the lack of objectives. A campain playable in coop would be a great add and players could chose between the campain or infinite waves.\nImo, the funniest part of this game is the PvP mode...but saddly the less developped.\nFacing some skilled players can be really challenging and becomes a real workout ! PvP games are huge success now on the Quest and I think the devs could really benefit from improving that aspect of the game. Adding more than one map and maybe some other modes like team deathmatch or zone capture.\nThe game looks good and the bow mechanic/haptic is great...except one thing that baffles me...the ratio shot power/rope pulling is non existant. Meaning that you can barely pinch the rope to shoot full power. Some players are abusing that and are turning their bows into spraying machine guns. That totally sucks big time... really breaking the immersion !\nThe online players of this game are really cool and friendly.\nI really hope the devs will continue improving this cool game and suprise us with awesome updates !!\n\nHelpful | 15", "Himataio11 days ago\nFour stars because it is what is says.\n\nDon't expect layers of ramping complexity, this is a fine entry level game for new Quest owners.\nIt's price point drew me in, also allowing for more likely co-op sessions.\n\nThe aim can feel wonky at times, the hands floating away on occasion.\nThe arrow does not nock right away or when expected, causing frustration and sometimes round losses.\nThe Spells selection tool is a pain at times, using the bow hand's thumb stick, which can be difficult when focusing on aiming, I feel it should be on the arrow hand to feel like you are using a different arrow.\n\nOverall, worth the money when it is on sale.\n\nHelpful | 0", "aludra.delcano13 days ago\nPretty good relaxing slow burn game.\n\nI just got this game for about 2 weeks now and it's pretty much the only game I've been playing lately compared to the Beat Saber, Arizona Sunshine, Red Matter, Pistol Whip, etc. After awhile though, things become predictable. The orcs pretty much walk the same path and in later waves the orcs just walk faster and in greater numbers. I wish there's more variety like evil hounds from time to time or more farm animals or even dogs sniffing around. A more lively music would be a great welcome too. The game do suffer from lags and crashing regularly but I'm not sure if it's from my end. I prefer to play this game than the other games I have because it's not too involved. You just select a group you want to join then you're ready for fighting. However, usually there's not a lot of people playing so you have to create your own group especially at night. Most players are from the US by the way. I highly recommend this game if you like casual archery game that you can just chill and relax without having to deal with a story or a campaign.\n\nHelpful | 0", "AziraphaelJun 22 at 7:00 PM\nVery good game with a few quirks\n\nLoads of fun, especially in multi-player mode. Last update seems to have resolved all multi-player connectivity issues. Works very smoothly and quickly now.\n\nEasy to learn. Needs some benefits for purchases beyond looks; added damage and/or distance.\n\nGame occasionally flakes out (black squares occupying most of the screen) which requires a reset. Happening more frequently since the last update.\n\nHelpful | 8", "nelagalvez1984Jul 25 at 9:52 AM\nSimply and enjoyable\n\nAlthough the graphics are in the low end, the game dynamic is enjoyable.\n\nYou will start failing a lot of shots (because it has no aiming assistance), but this is the most beautiful part, because it forces you to shoot differently respecting a gun. Here you will need to calibrate a small difference in the distances, because the arrow does not hit instantly. The bow also, is funny to catch and tighten, and I feel it relaxing to have it tightened while guarding down meanwhile the next wave appears.\n\nThe multiplayer game, its an extra plus, because sometimes you can't physically cover all the enemies, and feel some strange feeling of \"this is overwhelming\", but in multiplayer, 4 players are covering all the points, and you will reach a very high wave, including dragons, olog-hai, and a lot of hard orcs.\n\nIf you like the concept of bow shooting, this game is must-have.\n\nUpdate 25/7/2020: This game became obsolete with the release of \"In death: unchained\".\n\nHelpful | 4", "parker.bird.9A day ago\nPretty Good\n\nGame is cool. Co-op is a lot of fun and easy to play. Just wish there was some tutorial on how to actually play, maybe there is and I missed it but seems like any new game would have something like that.\n\nHelpful | 0", "tjdetwilerftw8 days ago\nWay to Go!\n\nI had reservations initially because I was hoping to find a dungeon defense type of game and didnt expect this to check so many boxes!! Im easily entertained and my first day I leveled up so many times!\n\nHelpful | 0", "MicBurns9 days ago\nTotally Obsessed\n\nI havent been this into a video game in years. I'm 42 and recently broke down and bought the occulus quest. I decided to buy Moss, Beat Saber, and Elven Assassin. My wife plays the Best Saber a lot, but has had to let the headset recharge after I relentlessly sharpen my Longshot at dragons , my quick headshots at ogres. After I dodge a few hundred axes I even feel like I got a small workout. My bow arm certainly feels it!\n\nHelpful | 0", "ybriancJul 23 at 5:10 PM\nGood replayability\n\nI really like to play the archery game in The Lab, which isnt available on the Quest, so I was looking for an alternative. Elven Assassin does a good job delivering. While archery in The Lab has a certain cartoony charm, Elven Assassin is a more fun and feature rich game. Multiplayer mode is particularly fun.\n\nThat said, I do agree with other reviewers that it feels a bit too much like a beta and it does crash with the display getting all pixelated or throwing you out of the game sometimes. It would be a lot more fun if it had a campaign mode, a few more environments to play, and if the armor that you can buy improved your magic skills or actually protected you from some axe throws. It would also be fun to see more features for advanced high level players like perhaps more spells or for there to be certain locations only high level people can use.\n\nI also find it frustrating that when you bring up the menu while you are playing that you are not shown your level progress or how much money you have. A tutorial for teaching you how to use magic would be nice.\n\nNow that In Death: Unchained has been released and Elven Assassin has some real archery competition on the Quest, I hope the developers focus more time fleshing this game out and losing the beta feel because it is a great game. The developers do seem to be good about making regular updates and improvements and I understand it does take time.\n\nHelpful | 1", "brbradfordJul 21 at 10:20 AM\nGreat game!\n\nUpdate: They finally fixed the buggy connecting in multiplayer! The other issues I mentioned seem better as well. Updating to 4 stars. I would love to see more multiplayer arenas, or other types of multiplayer games, teams in multiplayer, etc. That would capture my 5th star!\n\n\nThis game is awesome except the really fun part is the PvP but it's STILL in \"beta\" and sooo buggy. If they can ever make it work correctly I will give it 5 stars. Here are the problems:\n- Creating and joining private rooms is really buggy. You have to keep trying to join over and over because you press join and it kicks you back out to the server list.\n- Once you join you occasionally get disconnected and have to go through the whole process all over again and by the time you get back in the match is almost over.\n- The aim is so off in PvP. I don't understand why it doesn't have the same straight aim as cooperative. You have to aim clear to the right of your target.\n- Sometimes you watch 2 or 3 arrows go straight through your opponent's helmet and they don't die.\n\nHelpful | 1", "evenflo6814 days ago\nAwesome Fun!\n\nThis game has been one of the most satisfying for me personally. It's conceptually simple, shoot ogres and dragons with your arrow - yet when doing this on multi-player it is incredibly fun and exciting. Going up in rank helps you gain more spells and better aim etc. Just buy it you'll love it.\n\nHelpful | 0", "TheGreatSukki15 days ago\nMy family loves it!\n\nWe have a ton of fun playing \"tournaments\" where we keep passing the headset around while everyone else watches the cast to the TV through our chromecast. Best part is when we are doing that we keep leveling up our character.\n\nBIG thanks to the Devs for letting us reset our spell level choices between every game. This MASSIVELY improves replayability and makes things more fun with a little variety. As a real world archery instructor I would love to see some kind of sight pin on one of the bow models. Instinctive aiming works fine but it would really help new people's learning curve if they could maybe add one for a small amount of gold.\n\nDropping into a multiplayer match is also super fun. Having two or three archers supporting you in defense of the castle makes it easy to get to the higher waves. That's how we first saw the trolls with helmets.\n\nHelpful | 0", "ShaganeJul 3 at 1:40 PM\nGood game that could be improved :)\n\nIt's a fun game to play and shooting bow is nice ! Except maybe for a strange thing : there is no difference in shooting power no matter how hard or soft you pull the rope !\n\nWaves mode is cool but can become boring quickly as it's endless and nothing different really happens till you lose or quit playing.\n\nPvP is the best ! It's really great to play against other players and it's a good exercice too (trust me). I saw that this function seems more complete in the Rift S version with tournaments etc...too bad it's not the same on the Quest and also no crossplay.\nAnother problem is that it's been on beta since a long time. Just one map.\nThere are some bugs too that can be anoying at times, like having to quit the server and join again to be able to play.\n\nAlso some players are abusing the bugs to cheat and hide into walls or go throught them to shoot you from places that are not supposed to be accessible. And there is no way to vote them out !\nSome players are also doing some weird AK47 fast shooting with their bows that is totally unrealistic. Must be related to the power thing I mentioned above.\n\nBesides that it's a pleasure to come back to that game and I really hope it will be improved !\n\nHelpful | 2", "IDoDishesDaily20 days ago\nReal review.\n\nPros:\nFun regardless of game mode\nMagic spells make gameplay rewarding\nIn game chat is good\nGenerally intuitive game as a whole\nCons:\nGraphics are downgraded to run well on quest\n(Doesn't good terrible)\nNo tutorial\n(Simple game)\nMatchmaking is terrible\n(Many times while looking for a game you'll get immediately disconnected, joins you in the wrong game, game mode, or refresh matchmaking)\n\nOverall I still feel this game is definitely worth the price point. Its fun, a little simple, and cheap. I've more than got my money's worth out of this game. Ive met some really cool people and pretty pleased that several months ago I decided to purchase it.\n\nHelpful | 0", "GForcePlayerJul 13 at 1:05 PM\nGreat Game, Could Become Even Better\n\nThis is a very fun add well executed game. It has a wide range of enemies abs a consistent multiplayer player base. The one complaint that I have is you dont need to reach into a quiver, which I think would make the game more interactive and stop people from spamming in pvp. Overall great game. Would recommend to anyone.\n\nHelpful | 1", "Javi.ArevaloJun 30 at 2:30 PM\nAddictive Arcade Bow game\n\nOne of the games I've played most in Oculus. Take your bow and become and elf defending the siege with your arrows.\n\nIf you want to enjoy a multilayer co-op ambiented in a fantasy world, this is probably your game.\n\nThey recently made a couple of updates that improved the experience that was hampering from few bugs. It's important to take this in consideration because many negative comments can be found around this. :)\n\nHelpful | 3", "Skyhawk613Jul 4 at 7:40 PM\nGreat game compromised by a loop whole!\n\nElven Assassin is a fantastic arcade archery game with real archery physics.\n\nTo the Developers:\nI love your game, unfortunately I feel your game is being compromised online by gamers finding a loop whole and using a nack for rappid fire, sending out arrows at machine gun speed.\n\nThis machine gunning hack overides the need for a gamers to develope archery skills and overides the need for using magic spell arrows that you have so cleverly included in the game.\n\nThis rapid fire/ machine gunning makes a mockery of any experienced archer who has been developing archery skills in your game such as instant headshots or long distance head shots.\n\nTo be an ace at Elven Assassin online as it stands for the moment, you simply need to 'machine gun' your bow.... which is not archery!\n\nI therefore have downgraded my previous five star review to a three star review for the above reasons. Once this is fixed I will of course upgrade accordingly.\n\nBeing some what disabled please allow a button setting for ducking\nBeing disabled I have been dying to many times from the nasty axes lol.\n\nHelpful | 4", "Parzival911Jun 29 at 2:54 PM\nFavorite game\n\nI by far spend the most time playing Elven. It is a great game that I very much enjoy.\n\nUpside: Fun multiplayer. I enjoy interacting and learning different techniques from other players. Great workout with some light wrist weights.\n\nDownside: Kind of glitchy at times. You often get stuck aying with a (seemingly) 8 year old who instead of playing the game, babbles incessantly and shoots you.\n\nIdeas:\n1. Be able to mute individual players.\n2. Give the party the option of voting one of the others out (for the aforementioned reasons).\n3. Use coins to purchase spell points, torsos, etc. Once you save up enough for the most expensive outfit, coins are pointless.\n4. Give the option of starting at a specific wave number. Sometimes there are no openings on multiplayer. For the advanced player, it takes well over an hour if not longer to be challenged if creating a new game.\n\nHelpful | 3", "Spartan770913 days ago\n\nthe game could use so.e polish but it isn't anything more than it claims to be and for the price its not bad\n\nHelpful | 0", "zoiks_ruhrohJul 17 at 12:34 PM\nYes yes yes\n\nThis game is addicting! Haven't played in a while but hopefully they added the store in game to get better gear (on the quest). When I take my VR to a friend's place, this is one of the games I make sure they try out and so far nobody has disliked it, at all. Haven't tried multi-player yet, heard it gets crazy fast.\n\nHelpful | 0", "sebastian.kurz.583Jun 2 at 4:53 AM\nGreat multiplayer\n\nEnjoying multiplayer a lot, it is really stressy but also super rewarding to defend the gate against the evil forces. The steering and game mechanics are very good. The game runs smooth performance wise even with 4 players.\nHopefully we will see changes to the game in the future to keep it interesting, e.g.. different maps, different enemies (bow shooters?), cool gadgets (catapults, cannons,...),...\nIf you like multi-player experiences get it!\n\nHelpful | 3", "paet0rJun 22 at 3:21 AM\nOne of the greatest VR Games\n\nElben Assassins was the first Game i bought for my Quest and still playing it frequently. It is fun to start in the single player Modus but the most fun, of course, are the multiplayer games. Especially Im happy that there even is a pvp Mode now. I would wish to focus on that new mode, adding new maps and maybe more players / or game modes (e.g. Team vs Team).\nGreat Job. And like already mentioned, at least the expensive Equip shall have an effect on damage or something. Now, it just looks nice.\n\nHelpful | 3", "Henrioticus14 days ago\nThis is Great\n\n3D Tower game with a variety of foes and bows. Also 3 different maps you can use and tons of spells (though you can only have 4 loaded at a time. )\nGreat fun!\n\nHelpful | 1", "DoktorDeathJun 25 at 10:51 PM\nBest game ever! Buy it now, join the fun\n\nBuy this game now! You wont regret it! I absolutely love this game! You can get in quickly and start shouting stuff and defending towns and castles. You can play on your own and build skills and eventually earn spell points for even more power, or you can play with family and friends including new ones you meet online. You work as a team to stop the hordes, talking and coordinating the defense if you do choose. Its brilliant. The graphics and sounds are top notch. Progress saved to the cloud, which is very helpful given occasional glitches. Its so much fun just to grab my bow and arrow and start shooting stuff at the end of the day. Mindless fun that really helps me chill. I really recommend you buy this game and join the Elven community.\n\nHelpful | 2", "ManishvaidyaJul 27 at 3:22 PM\nExpecting more from this awesome game.\n\nThis is one of my favourite games however after level 100 , I wish there were more hurdles and even more landscapes after a certain level and alongside even more powers of spells to arm ourselves with would be great .\n\nHelpful | 0", "KVW1Jun 5 at 1:03 AM\nGreat game but needs scoreboards!\n\nI've really enjoyed playing this game on quest and steam vr. However on quest there isn't a scoreboard. The challenge and competitive element of working up the scoreboard made it alot more enjoyable. I wont be playing this game again till a scoreboard is added. Please devs could you add it in.\n\nHelpful | 2", "asic_antJul 27 at 9:47 AM\nLots of fun\n\nOnly the waiting part btw waves is kind of boring. Will be nice if they can put some target to play with.\n\nHelpful | 0", "martin.buglass.714 days ago\nSuperb\n\nIf you ever wanted to shoot a bow and arrow this is the game for you. The feeling of hitting a distant target is great.\n\nHelpful | 0", "007LegolasJul 18 at 1:07 PM\nLegolas\n\nThis is an excellent practice set for those wishing to prepare for battle. Working as a unit is critical to defending off Orc attacks. A young Elf must first master in individual games and then work into a unit.\n\nOutstanding preparation.\n\nHelpful | 1", "Nightflame456Jul 12 at 6:29 AM\nGameplay, Great. Extras, Eh\n\nThe combat, the magic, the enemies, this games gameplay is near perfection! The different wave systems that introduce more complex foes every few waves keeps the game fun and challenging.\n\nNow for the cons. Nothing too major, but there are only two magical elements; ice and fire. If there could be a couple more elements, maybe poison or lightning, that would add to the variety of the game.\n\nAlso, the coin system in this game has nothing to contribute to the actual game. The new bows and helmets dont give any sort of advantage in damage, defense, or assistance in aiming your shots.\n\nAll in all, a great game that is riddled with useless extras and minor magic.\n\nHelpful | 0", "TazrFaceJul 21 at 8:02 PM\nFun but glitchy and repetitive\n\nBeen playing this game off and on since it came out for Quest and it's been pretty much the same experience throughout. I usually get kicked between 3 and 10 times a gaming session which is extremely frustrating and has caused me to stop playing for weeks at a time. Early attempts to fix the kick issue resulted in my losing 50 levels of progress (cloud saves would be great). Also the waves are pretty much the exact each time I play; trolls always come from the same place in the map, dragons waves are the same... it's very predictable.\n\nThe other players online are frustrating as well. Most machine gun kill everything in sight and steal the fun away. When I try to create a private game with a friend, other players cycle through password combinations and crash my game.\n\nHere's to hoping they get the game to stop crashing and get some new content soon.\n\nHelpful | 1", "Hairy_PotterJul 21 at 7:56 PM\nDisappointing\n\nIn general I like this game, but I can't ever enjoy it. I get kicked out constantly. I get a message saying the app has stopped and I'm kicked out completely. I lose all of my stats and have to start back on the board with 0 points when I'm in multi player. Also why can't we have 3 digit codes for private rooms? My husband and I spend a bunch of time getting to higher waves and people constantly crash into our private games and refuse to leave. All of them rapid shooters and taking all of our points. It's unplayable for me. We've done literally everything and I still get kicked out. Even got a brand new quest headset.\n\nHelpful | 1", "stash1053Jul 28 at 4:42 PM\nGame Top Rate\n\nIt is very easy to learn. I find the bow and arrow interface pretty realistic. It starts easy and progresses to more challenging. I recommend it. Its a lot of fun.\n\nHelpful | 0", "VRSugarBabyMar 14 at 1:00 PM\nReally, a good game\n\nWhile i enjoyed this game, and will continue to enjoy it i feel like some of the more seasoned fps gamers might find themselves wishing that this game had a bit more meat on its bones... As it only has 2 modes of play, 3 if you include multiplayer as its own mode separate from arcade mode and with spells mode. So its a bit shooting gallery in its style of gameplay. But it is a pretty good arm work out and if you are more of a nube in the fps arena you will find it quite the exciting gameplay experience.\n\nHelpful | 82", "Green_witch23 days ago\nAwesome\n\nLove this game. I am not much of a gamer. I get motion sickness but this game is working for me. Im extremely liking archery now.\n\nHelpful | 0", "jmtizzleApr 1 at 12:06 PM\nA fair game For sure\n\nI've played this a fair amount. It is very entertaining and with an OK progression tree, but you can't help but feel like you've experienced all it has to offer very quickly. The higher level players aren't exactly \"master archers\" they are the ones who figures out draw strength means nothing on the bow in this game. As the game stands it isn't about accuracy, it's about how many rounds you can fire in a minute which determines success. If that changes, so will my rating.\n\nHelpful | 22", "GLWelling21 days ago\nBest Archery Game on VR\n\nThis is a great game. It feels like you are defending a small village in Middle earth very fun.\n\nHelpful | 0", "WinterXP19 days ago\nArchery\n\nYou know, there is just some real pleasure to shoot orcs with a bow on your day off.\n\nHelpful | 0", "SandovanJun 19 at 5:10 PM\nStill my favorite quest game\n\nGlad there has been an update recently:-). If you are new to this give it a shot for a couple of levels and you will meet one of the most international and interesting communities of any quest game.\nThis game has addictive qualities, but thats not the main reason why so many of us check in regularly to relax after work. Its the people you will eventually play with, meet and connect.\nIf you are not in a conversation mood ( as we all are sometimes). Its easy to just cooperate silently.\nSooner or later though, you will play with others who are just like you only thousands of km/miles away, and you will bond shooting Orcs & supporting each other.\nIf you are an introvert looking for occasional connection with likeminded, there is no other place in VR like this.\n\nHelpful | 1", "someofamitchJul 29 at 6:51 PM\nLove it!\n\nThis is a great choice for an action game. Will make you sweat as you advance because you must be quick!\n\nHelpful | 0", "NS1595Jun 9 at 1:15 PM\nGreat Game - Awesome Arm Workout\n\nSuch a great game, its like a zombie apocalypse. I would define you recommend buying this game, its fun and an excellent workout. I like how you can teleport from base to base, however, I would recommend including more maps. Overall, a really good game.\nFour stars from me!\n\nHelpful | 0", "fnulpsJul 10 at 9:42 AM\nVery poor, much room for improvement\n\nWell, where do i start? In my onion the game is poorly designed and lacks finetuning. Very dissappointing, even for ten bucks. Let's try to sum up some points, from worse to not-so-worse to comedy:\n\n- Tracking of the bow and arrow is downright horrible. Devs, please fix this\n\n- You teleport by shooting arrows. Who's idea is this? What's wrong about using sticks and buttons for teleport? Many, many times i teleported accidentally, not knowing what's going on. Doing \"trick shots\" by shooting orcs through windows and balconys is impossible because of this\n\n- Speaking of trick shots: There are lots of invisible walls here\n\n- No seated mode. When you play seated, the ceiling is so high you can not shoot at orcs beneath you. The game forces you to play standing, and matches could take long\n\n- There are two game modes: Arcade and RPG. In RPG mode, i collect money and experience points, but for what? The game doesn't tell me. They're said to be spells but i haven't seen one yet. Although i don't wanna loose my progress here, which is the only reason which keeps me from deleting the game (UPDATE: alright i have to look back. There was a sack of gold on the table, which keeps giving me money just for standing there. I bought all the weapons and armour with these gold, just to discover they do not make any difference. Spells are nice but grinding them takes forever)\n\n- When an orc trows his axe at you, reaction time is way too short, downtime is way too long. This seems to be balanced for multiplayer. Singleplayers like me have to deal with it. And no, i don't wanna try out multiplayer\n\n- The big orc takes way too much damage. Also balanced for multiplayer\n\n- Only 3 locations, of which only the human village actually looks good\n\n- There is exactly one line of voice acting in the game. A guy is jelling \"They're breaking in\" when an orc reaches your gate. The guy sounds like he's from New York or so, absolutely no fantasy feeling here\n\nHelpful | 0", "michael.lafricainJul 12 at 1:22 PM\nGave it a shot!\n\nFun game! The first game i purchased for the quest, i really like it and that it has multi player mode\n\nHelpful | 0", "MadiMacLeodApr 23 at 2:55 PM\nReally fun!\n\nI love the co-op multi-player function of this app. Its a lot of fun. When youre trying to get into a specific game it can be annoying to constantly have to have the server restart. Also, I think the gear we buy with coins should add to our talent or protect us better from hatchets being thrown at us. Something. It should serve more of a purpose. Besides that I really love the game and get a good work out!\n\nHelpful | 4", "VladislauJul 16 at 9:15 PM\nThe game crashes too often.\n\nThe game crashes each 7-10 waves in both modes: single and multiplayer.\nUPD. Current version works properly.(17.07.2020)\n\nHelpful | 0", "alexbostonJul 16 at 5:38 AM\nLot of fun\n\nGreat game with nice ambiance, challenging with multiplayers but fun . Several villages with realistic views. Thanks\n\nHelpful | 0", "m_pageApr 9 at 5:53 PM\nAwesome Multiplayer\n\nGreat multiplayer game. The multiplayer in this game is great. Would be 5 stars if you could auto start on a certain wave (takes awhile to get to a difficult wave, especially if you have 4 people playing), there needs to be more than just 1 PvP map (diminishes replay value by only having one map), and leveling up should make a difference (upgrading arrows that make a damage difference, etc). Even with these shortcomings, its a top 3 game for me because of the multiplayer.\n\nHelpful | 7", "SportyballMay 17 at 3:45 PM\nGood game with lots of added potential\n\nExcellent concept and game play is really good with an occasional freeze-up. Would be 5 stars, but the potential for added dynamics is endless. Purchased items should upgrade effectiveness in combat. Other ideas include rewarding players with a percentage of new villagers over so many waves survived; new spells such as Pierce or lightning; upgraded armor that deflects an axe or is fire resistant; the occasional villager that comes out to help fight; love the game and I hope they continue to build in it.\n\nHelpful | 1", "SwagStar59May 18 at 8:18 PM\nBugs but still good\n\nIts pretty good but the devs havent fixed a very irritating bug that is getting into a private multiplayer match takes forever. At first when you type the right password in it brings you to the main menu. Fast forward like 8 times and it finally lets you in. Please see this devs\n\nHelpful | 1", "eborquezMay 26 at 3:14 AM\nPlayed until the battery died\n\nIm hooked! This game is a lot of fun and its the first game I only put down because the battery was drained\nI would hope for a better explanation as to what if anything the bow and helmet upgrades do\nfrom reading on forums it seems like its just cosmetic - meh\n\nHelpful | 2", "FireWolf9Jun 7 at 7:07 PM\nMy favorite game so far!\n\nIve loved playing this game! I like that you can earn spells and buy fancier bows. I think its a great concept and a fun first person shooter with a bow & arrow.\n\nI am amazed at how this game performs and the options available. Most of my considerable time Ive spent playing has been as a single player. However, Im now playing more multiplayer and PVP. Its different experiences for whatever mood youre in. I love the new landscaping in the ancient temple (my favorite map), rounds 1-14 along with the new dragon starting in round 60 and the added blood/reactions. The vibration in the bow as its drawn back is incredible. I cannot imagine how you built this amazing environment where four people at different locations can interact with each other and the oncoming threats.\n\nHelpful | 0", "SkywalkezMay 16 at 3:52 AM\nNice game. Good workout. Repetitive\n\nThe game is well executed, and aiming is natural. The workout is ok but will be heavier in one arm only. Matches are fun and I will keep returning, but the story and challenges are a bit repetitive and you feel bored after a couple of matches.\nWorth buying when in discount.\n\nHelpful | 1", "chicobigote21 days ago\nNot Good\n\nIt is really hard to put your arrow on and the aim is garbage. I gave it about 2 hours of play but will never play again.\n\nHelpful | 0", "Flip4989Mar 19 at 10:45 AM\nAmazing fun\n\nAbsolutely love this game and online with friends is even better.\n\nI do want to pull up an issue to the devs - for some reason I get kicked out of the game at random times. It will just close and this happens in single player offline as well as offline. It makes progression very difficult. Happened to me 4 times today.\n\nOtherwise an excellent game. I just dropped a star for the issues.\n\nHelpful | 10", "Oxalis_BloomMay 8 at 4:47 PM\nAddictive and fun\n\nThe pvp mode could be improved as the aim is off and there is some occasional lags during the multiplayer games (arrow not killing the target when it clearly went throw them or the elven going through some walls or odds directions). But otherwise I completely love this game and i would recommend it! I am sure these buggers will be solve soon enough! Xx\n\nHelpful | 0", "RayAllenTaylorJun 12 at 9:22 AM\nLove it\n\nOnly wish I could change the shooting hand easily. During a long session, I can really feel my left getting tired haha\n\nHelpful | 1", "mikeholMay 5 at 1:16 PM\nGreat fun for quick blasts\n\nAll works very well, great game to jump into and spend half an hour, upgrading armour, bows and increasing magic power, i don't think the bow upgrades make any really difference apart from looking nice which is a shame though.\nAnd the game really needs a save feature, as soon as your skill level increases 30 minutes turns into 60 and so on, once you start you can't stop until your defeated.\nOverall aside from my minor gripes gives a whole new aspect to tower defence type games.\n\nHelpful | 0", "jcameron33Jun 29 at 6:38 PM\nDANGER\n\nOn multiple occasions while playing the game it froze up with a flicker that was so disorienting that I almost fell down.\nIt's a shame because I love the game but it just isn't safe to play. It would be extremely dangerous for an epileptic.\n\nHelpful | 0\nDeveloper ResponseJul 16 at 9:03 AM\n\nDear jcameron33, Thank you for your feedback. We are very sorry to hear about this serious problem. Safety and health of Elven Assassins players are a priority for us. Please tell us more about the issue  when game usually freeze while youre playing? Its a regular problem or it happens each time you play? It happens in specific place on the map or during one wave of enemies or totally random? Also, please remember about downloading newest updates. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "olliscuba011May 4 at 3:18 PM\nFun game for lazy evenings\n\nMy husband and I love playing this game when we need to unwind and have some fun too. It is challenging to some degree and rather entertaining. The Reason I gave it four stars is because it glitches relatively often and kicks me out, and cause occasionally there is a kid that joins the game, hops on my stand, wave in my face and just occupy a spot in the team and not really participate.\n\nHelpful | 0", "janine.welchJul 3 at 4:31 PM\nA lot of fun!\n\nThis is a great game to play multi player, you can chat and work together. It gets harder as you go!\n\nHelpful | 1", "jazzy051048May 12 at 5:46 PM\nGreat Game\n\nI really like this game but it should have more to it. The ability to move around is a bit jaded.the use of spells is redundant snd it does not have enough levels. But, to just move around and shoot, it is a very good and slightly challenging game.\n\nHelpful | 0", "omnigateJun 10 at 9:14 PM\nI really tried to like this game...\n\nThis game has so many fundamental flaws - no goals, no achievements, unbalanced levels and economy. There's potential here, but after playing other games out there that have descent depth, I'm not sure why this game is so shallow.\n\nHelpful | 2\nDeveloper ResponseJun 16 at 7:04 AM\n\nHello omnigate, thank you for your opinion. We are sorry to hear that your experience with the game wasn't to your liking. We are still working on improving the game and would love to know if there are some things we could add or change to make the gameplay feel better. If you have any ideas you could share with us, feel free to do that. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Consider checking back the game someday later. We would love to hear if this got any better for you.", "swoozaMay 31 at 8:27 AM\nGood game\n\nI enjoyed playing the game and controls felt accurate. The game does get a bit repetitive and I feel that the game could have some mini games which could extend life of game.\n\nHelpful | 0", "DJMahlMay 23 at 10:46 PM\nMultiplayer is Key\n\nDont bother with single player, there is no campaign or meaningful single player, but multiplayer is really really fun. Even if you dont know the people youre playing with, its a satisfying time sink.\n\nHelpful | 1", "TheGentlemenMar 30 at 7:54 AM\nI'M STILL ADDICTED MONTHS LATER...\n\nIf you bought this game you wont be disappointed, I tell you multiplayer mode is the best in this game especially when you find folks that dont mind chatting a little while you play, this is a real cool way to gain friends in here.\n\nOne of the coolest archery games I've ever played, then you level up to get spells you can use so awesome.\n\nDont forget PVP mode is so much fun, just tell ya friends to join in in the fun where you shoot each other, see who gets killed the most.\n\nJust Experience It. You wont regret it!!\n\nHelpful | 4", "PustolioApr 28 at 2:59 PM\nDoes one thing really well\n\nIf you want to be an Archer defending s castle with friends against mythical creatures this is your game.the mechanics are great. Spells give you goals to work towards. Some maps let you shoot cannons and catapults.... Cons: you can't use the axes thrown at you to throw back. There could be real potential with a career mode where you use the right toggle to walk instead of shoot to new locations. Love the game, worth the money\n\nHelpful | 1", "DeathlyHaIIowMay 26 at 9:05 PM\nAmazing Game\n\nWhile getting a good workout, you have so much fun. I really enjoyed killing orca and using some spells to help me. The only thing I wish this game had is a campaign mode where there is a storyline. Overall this is an amazing app and worth the price\n\nHelpful | 1", "Keyser_Soze._Apr 11 at 8:21 AM\nGrab your bow, its worth the dough!\n\nThis my latest game purchase and Im having a blast with it. The price is right, and there is enough grind to it that youll get your moneys worth. This is a review, so here is what Ive got for you after roughly two weeks.\n\nGood: Nice main menu. Easy server interaction. I have yet to have an issue with any live game sequence to date. The controls are easy to use, and they have paid attention to the little things that make it more realistic. The various arrow spells and the lure of upgrading them keeps you coming back for more. Like all the other reviews, I agree, its more fun to play this game with others, because the levels dont really change much, so having some banter and competition in game keeps it interesting.\n\nWish list: This game is at least two years old, so Id really like to see a big update, or a sequel. We need new levels, more characters and wave achievements. The equipment that you can purchase with the gold you earn needs to improve your performance, instead of just being cosmetic in nature. There also needs to be a function in the game that allows the town, castle, or whatever youre defending at the moment, to heal itself if you survive enough rounds. Example: survive 7 rounds, gain 5% back in health. Adjust the layout so players arent allowed to move beyond realistic shooting positions. Ive been in games where players have drawn a large enough guardian that they can walk out into midair and just cherry pick orcs from their positions....kinda takes the fun and artistic design out of the game, but I hate game cheaters in general, so thats probably just me. In player versus player mode, it would be a great feature if you could set a wager amount in gold that you would play for. The gold is already kind of meaningless, so this would add a little ready player 1 spice to it.\n\nIn any case, go get this game!\n\nHelpful | 2", "momofflowersApr 25 at 6:55 PM\nGreat archery shooter/tower defense game\n\nThis game and beat saber were the two that made my decision to get the oculus. Its fun and challenging. I am not much of a fps player but this feels much better to me.\nYou face off against wave after wave of orcs, giant trolls, wyverns, and massive dragons to see how long you can survive. Its also a great arm/shoulder workout if you even try to treat it like a real bow.\nThe problems that keep it from being a 5 are as follows.\n1. It can be a little glitchy from time to time randomly throwing you all the way out to the oculus menu. And I still havent been able to join multiplayer for the same reason.\n2. Theres no campaign or storyline whatsoever other than protect xyz\n3. Leveling up is tediously slow. For instance I have played everyday for about an hour total for about a week and Im only a lvl 8. And have very little coinage.\n4. Apparently the gear you can buy is for aesthetic value only it should do something!\nFix those and its a 5 star game even win those little hiccups its worth having for its beautiful graphics and replay ability.\n\nHelpful | 0", "AazaaadMay 22 at 8:43 AM\nMost played game\n\nGraphics is not that impressive, very hard work to collect enough gold coins to buy stuff and long way to go to 35 levels to unlock more tools.\nBut easiest, fun, most played, and interesting game on oculus. \n\nGets challenging as you go and keep you interesting...\n\nHelpful | 1", "JacobyAZApr 24 at 10:26 PM\nA ton of potential\n\nThis game has a ton of potential to becoming a 5 star game but it has some really frustrating issues too. Issues aside, it is super super super fun. I highly recommend it. Its fun by yourself. Its fun with your friends. Its exhilarating. Youll love it.\n\nIssues: biggest issue Ive had is when going into a private party, you click on the party name and it flips to the next page of party names. After you try to click on your buddys party name 20 times and it finally lets you through to the passcode screen, the passcode doesnt work 80% of the time and you have to go back to the beginning. It typically takes 5-15 minutes to log into a private party with my friends every night. Also, Ive had several instances when strangers have gotten into our private parties. I have no idea how. I doubt they just guessed the password correct.\n\nHeads up, your arm will get tired after holding the bow up for a while. Its a great game though.\n\nHelpful | 1", "StrandbaniacMay 23 at 4:16 PM\nFun but shallow experience\n\nThe core mechanics are fun. I love killing orcs and switching perches is great. The issue is there isnt much meat on this game. No story, no campaign and limited character progression, limited number of maps. You can add and upgrade spells but thats about it. It feels more like a technical demo or an arcade mode for a full fledged game rather than its own game.\n\nMultiplayer is more fun but it can be frustrating as your friends room may not show up or may not be joinable randomly. When multiplayer does work its pretty fun.\n\nHelpful | 0", "LordElr0ndMay 26 at 10:32 AM\nGood game but\n\nI tried to play but too hard for me (maybe just me). Waves come too fast but not gold so I can't easily upgrade my weapons and it's easy to not hit anything\n\nOther than that, I do like to be able to take a bow and hit those trolls. It's good exercise too. My arms were hurting in just 30 minutes. Eventually I may even build muscles. Ha\n\nHelpful | 0", "L0G4RY7HMU5May 27 at 7:24 PM\nVery fun LOtR lije experience\n\nI'm glad to have bought this game, I'm living in a hostel and organize Elven Archer tournaments here every day. This game blows everyone away the first few days :) I love how intuitive this game is too. Perfect for me.\n\nHelpful | 0", "RussetWilsonApr 20 at 5:35 PM\nFun wave game\n\nThis reminds me of old flash games on Newgrounds. Tons of fun. Literally dove on my floor today to dodge a flying axe. I gave it 4 stars instead of 5 because a couple small changes would make it more fun in my opinion. Gear upgrades could improve damage or something. Or at least a game mode where you can buy upgrades as the waves progress (just like flash games)\n\nHelpful | 1", "MaksquaredJun 24 at 11:03 PM\nLove this game!\n\nI love this game so much! It is the reason I bought the Oculus!\n\nHelpful | 1", "TheJarlaxleMay 11 at 1:00 AM\nIt ain't Robin Hood...\n\nWhich is a good thing  Caught this game bundled with that ninja sauce Sairento game and it was well worth the price for the combo. Both are fun and wildly different.\n\nHonestly the current 2 games for the price of less than 1 sale is cheaper than a truck stop woman of the night. Then again aren't most things?\n\nBut seriously this is fun and beyond affordable bundled with Sairento.\n\nHelpful | 1", "Vraag673Jun 4 at 2:29 AM\nVery good game\n\nThe multiplayer is a good experience. I like that game.\n\nHelpful | 0", "j_SembiMay 7 at 1:39 AM\nFun multiplayer game\n\nGood game but its impossible to get buy any items as its way too hard to earn gold. Also it does not say if any items have abilities or enhancements. Also a crossbow option would be good.\n\nHelpful | 0", "TheRestless2018Jul 7 at 12:23 PM\nBoring Game\n\nIt's every time same. Just stay and shoot at orcs. After 3 times of playing it, it got boring.\n\nHelpful | 0\nDeveloper ResponseJul 16 at 8:55 AM\n\nDear TheRestless2018, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting.", "aNigerianPrinceJun 17 at 10:46 PM\nAs bare bones as it gets...\n\nThis game has basically no substance to it. I get that it's old, but the fact that $10 is being charged for this is insane. I would give it an extra star because the game 'plays' fine, but everyone feels the need to give every game a good rating that I feel are typically undeserving. Within 10 minutes you've seen it all. $5 would be more suiting for this early VR tech demo\n\nHelpful | 1\nDeveloper ResponseJun 20 at 4:40 AM\n\nHello. We are so sorry that you didn't have a pleasant experience with our game. We want you to know that the game is still developed and that there will be things added and improved in the future. We would love to know if there are some things we could add or change to make it better for you.", "CabronusMaximusMay 31 at 1:49 PM\nVery good fun, but bit repetitive\n\nReally enjoyed it and will have replay value. However, needs more maps, different enemies\n\nHelpful | 1", "julian.freitag.007May 30 at 11:40 PM\nCool Tower Defense Game\n\nThe game is a lot of fun, but could have more levels/playing fields\n\nHelpful | 0", "MayhemwithmrbMay 20 at 2:26 PM\nA good game, but...\n\nThis is a really good game with clever mechanics for the bow and arrow which could be even better when playing with others, but being repeatedly kicked out of your game soon grates and you will find yourself playing something else. A great single player experience though.\n\nHelpful | 0", "FadedRangeJul 21 at 10:17 AM\nnot the best\n\nit's not bad at first but gets very boring and repetative\n\nHelpful | 0", "OculusQuestFunApr 22 at 12:59 AM\nMake the bows have powers.\n\nGreat use of the 6DOF. Enjoyable and worth the money. A future update having the different bows and arrows all have different abilities, would be welcome. Also, more levels. Again, great game and I will be recommending this one to those new to VR.\n\nHelpful | 1", "axiethMar 10 at 5:49 PM\nGreat fun with others\n\nThis is the game that got me to buy the Oculus in the first place. The game is quite addicting and also not a bad workout. I fear that it will be losing its player base if they don't update it soon as it does become very repetitive. Players are getting better and better it has almost become hard to not go on forever in a multi-player game. Most people I play with just leave at bedtime and someone else will join. It desperately need a way to make it harder earlier on and some new maps.\n\nHelpful | 4", "jarland.donnellMay 23 at 8:35 PM\nAmazing game\n\nExcept that it crashes constantly and joining a multiplayer game requires continually exiting and re-entering the menu, 10-20 times, before it works.\n\nHelpful | 4\nDeveloper ResponseJun 20 at 5:16 AM\n\nGreetings, jarland.donnell! We apologize for the inconvenience with the game. We want to let you know that we've recently released an update with some fixes to lobby refresh bug, joining the multiplayer match, and more. Please let us know if it got any better for you after the update. If you are still facing some problems feel free to contact us at support@wenklystudio.com", "B-TronDec 24 at 10:51 AM\nMultiplayer is the best part\n\nI want to start by saying this is a awesome game, but in my opinion it's NOT a single player game. When I first got this game and started playing I was very disappointed at the lack of content. I got bored really quick as there are only 3 areas and you are essentially doing the same thing over and over. I wanted to return it but was past the window so I decided to try the multiplayer mode. I usually hate multiplayer games but the multiplayer experience here is SUPER ADDICTING and by far the best aspect of the game! The single player mode is really just training for multiplayer runs. Whenever I start multiplayer I know I am going to drain the battery to zero and have to use a battery pack to keep playing (It's that much fun!). I would probably give this five stars if it either had more single player content or was at least marketed specifically as a multiplayer game. Great game!\n\nHelpful | 157", "yassmonnApr 12 at 10:05 PM\nmy dad bought a VR for this game\n\nSo a few months ago my dad and his company went to a VR place do to some team building, where he first played this game. A few weeks later he took my mom and I to play this game.\nLast week he bought a VR, and claims that it is for the family, but hes been playing this game for at least 8 hours everyday since I set it up.\n\nHelpful | 2", "al.bakes.77736Apr 18 at 3:40 PM\nMy favorite game to play on my Oculus!\n\nI seriously love the hell out of this game, but there haven't been any updates since it's been out I hear..... I wish the developer would either continue to improve with updates, or they should give permission to someone else that can provide us with updates for the game...\nAll BS aside still my favorite, and I would gladly buy it again!\n\nHelpful | 2", "Callen0226Apr 26 at 6:52 PM\nFirst review\n\nI find it really fun to play and all of the different kinds of helmets in Bows. Im in archery but since youre in quarantine this is a good way to play its always fun to get a headshot from a long ways away on the hardest orc. Overall I find that its a fun game I think the fun for most people play there into the archery\n\nHelpful | 0", "SojoAmMay 1 at 10:45 AM\nFun\n\nIm enjoying this game more than I thought I would. Not particularly involved, which is what I wanted. Something enjoyable, that I dont have to think, but I can see progress every time I play.\n\nHelpful | 0", "DriftingFoxMay 25 at 10:48 PM\nLove the game but..\n\nSO. MANY. GLITCHES!! Getting into a multiplayer takes numerous tries, that menu is a mess. Once in, Multiplayer freezes or the whole screen moves with you then kicks you out constantly, Love the concept and gameplay but SWEET JESUS FIX THE GLITCHES!!\n\nHelpful | 1\nDeveloper ResponseJun 20 at 5:02 AM\n\nGreetings DriftingFox, We are sorry to hear that you ran into some issues with the game. We've recently released an update that should help with the lobby refresh bug, joining the multiplayer match, and more. Please let us know if it got any better for you. If you still experience any problems please contact us at support@wenklystudio.com", "bkangaJun 20 at 7:21 AM\nMuch improved after updates\n\nFun wave shooter\n\nHelpful | 1", "pixeltimApr 19 at 3:54 PM\nFun, but multiplayer could be better\n\nI quite enjoy shooting orcs. I feel like I'm actually making progress in aiming skill and arm stamina. I very much appreciate that the developers allow for left handed players with a setting.\n\nThe mechanism for leveling up your spells and weapons really does keep me coming back for repeat play, but I imagine I'll tire of that quickly.\n\nWhere this game could really shine is in multiplayer, but joining a private game was quite difficult. It seems as if my friend's games isn't on the first page of results it bugs out when trying to join. I'd also appreciate the ability to search, but it's not too bad scrolling through four pages of games (assuming scrolling gets fixed)\n\nHelpful | 1", "BigM1971Apr 15 at 10:49 PM\nLove it but GLITCHY\n\nThe game is fun and addictive. I will continue to play it but it is really glitchy. Continues to kick me out in the middle of games. When that happens, I lose all of my points from that game and have to start all over again. This happens multiple times per day.\n\nHelpful | 3", "MikeyMoleApr 9 at 4:18 PM\nSolid Gameplay, great workout.\n\nIt's a solid 4 out if 10. I was wondering whether worth it at first but I'm glad I bought it. Didn't give 5 just cos a bit limited in terms of levels and depth of gameplay.\n\nBest thing for me though is it's great excersise. Working out and shooting orcs. That's win-win.\n\nHelpful | 0", "SamBamskyMar 24 at 10:21 AM\nGreat Game\n\nI love this game. I am hoping for updates and improvements.\n\nSuggestion 1, please include a visual indicator on the bow (or hand) that let's us know when each magic item cooldown is up. That would be awesome.\n\nSuggestion 2, making the rounds harder would be great, games last way too long...\n\nLooking forward to some more fun stuff.\n\nHelpful | 4", "DedWar62Jun 18 at 4:43 PM\nEleven assassin\n\nThis game worked fine for a while. Then it got glitchy and stopped working. Won't let me Uninstall it. So right now it's a piece of sh*t app!!\n\nHelpful | 0\nDeveloper ResponseJun 20 at 4:42 AM\n\nHey DedWar62! We are so sorry to hear that you are having trouble with the game. Please contact us at support@wenklystudio.com so that we can help you with the issue.", "PatriotCamMay 10 at 5:37 PM\nReally fun\n\nHad some slight issues with tracking though that could have just been me and not the game. It was really fun though definitely worth it.\n\nHelpful | 0", "daddyobrownApr 24 at 4:38 PM\nGreat gameplay, needs more story\n\nThe targeting and skill building of this game is great, and this has one of the best multiplayer arenas out there.\n\nWhat it lacks: a story mode and a larger variety of arenas.\n\nHelpful | 0", "GlitchVertexJun 4 at 10:20 AM\nGood game\n\nI love this game except for that it can be hard to shot the bow.\n\nHelpful | 0", "FlavoredYew5704Jun 17 at 1:15 PM\nFun\n\nPew pew game but with bow\n\nHelpful | 0", "montrosidadMay 18 at 11:52 AM\nGreat game!\n\nLove the feel of shooting the arrow. Its super cool to play with other people (especially if you have a buddy you can communicate with). A lot of fun!\n\nHelpful | 0", "jaydegeerMar 29 at 11:18 AM\nFun!!!!!\n\nSo only reason you get 4 stars is because of the play modes. The game is extremely fun and well priced, I feel like Robin hood sometimes hitting multiple enemies with the pull of my arm. If there was a campaign mode that would put it at 5 stars for sure, all in all the game is fun and well worth the price. Glad to add this game to my oculus library.\n\nHelpful | 1", "KissenschlachterApr 23 at 3:38 PM\nunter blauem Himmel auf Orks schieen :)\n\nIch liebe Elven Assassin, weil es nie langweilig wird unter strahlend blauem Himmel mit Pfeil und Bogen auf Orks zu schieen. Besonders im Multiplayer-Modus macht es Laune mit bis zu vier Spielern gleichzeitig zu spielen und (wenn man sein Mikro freigibt) sich mit anderen auszutauschen, zu fluchen, um Untersttzung zu bitten, usw. Herrlich. Man kann die Rume auch mit einem Passwort schtzen, wenn man sich mit Freunden oder Kollegen treffen will, usw. Je mehr ich es spiele, desto begeisterter bin ich.\n\nHelpful | 1", "thines68Jan 15 at 6:10 AM\nCould be better.\n\nFirst and foremost, I love this game. There is something about the pace, along with excellent multiplayer interaction, that keeps me entertained. While I play many games on my Quest, I come back to this one most often. While E.A. is probably my favorite game at the moment, it could certainly be improved upon.\nCurrently, I'm at level 126, which means that I now have 25 spell points that I cannot use. It seems like the developers could come up with new stuff or maybe would allow for spell upgrades or even let us use them for \"one-time end-all\" emergency usage. Also, I have the most expensive armor one can buy in the game, but it is only ornamental. Maybe the more expensive armor could be upgraded to where it will withstand two or three axes before you die. Otherwise, there is no reason to even bother with it. Finally, after somewhere around Wave 120, all of the following waves are pretty much the same. I've been to wave 301 and it seems like the waves could get successively harder as the campaign progresses. I would also love to see additional maps added.\n\nCriticism aside, this is a great game and is well worth the money.\n\nHelpful | 29", "Francis_HehleApr 2 at 10:23 AM\nAmazing game but...\n\nSince I can almost never play in coop without being disconnected, I can only give it 3 stars. Each time we play, either me or other players get disconnected at least one or two times. This is really, REALLY annoying. This does not happen in other multiplayer games. Devs should definitely adress this issue.\n\nHelpful | 3", "jsivonenMar 2 at 1:16 AM\nBest archery game so far for Quest\n\nWhat can I say.. I play this game almost every time I pop on the headset. It's fun yet eventually you'll fall. The multiplayer is the best feature of this game fo sho!\n\nThe downsides are the lack of content and the EXTREMELY slow progression. And I mean the gold accumulation. I'd reckon that it'll take YEARS to get thousands of gold coins to buy the high-end gear in this game. Feels stupid...\n\nBut overall - WELL worth the money!\n\nHelpful | 3", "faraduckJun 5 at 9:23 PM\n\nGood game      \n\nHelpful | 0", "mattjohnholmesJun 20 at 2:42 AM\nGreat multiplayer\n\nFun but repetitive\n\nHelpful | 0", "destructor1210May 9 at 4:43 PM\nWhy this game is crap\n\nFirst off it's a wave fighter those are the exact same thing every round and they always get boring but this one this one holds a special place in the hearts of people who are going to play it a special place where the most hate gets delivered first off the accuracy on the bow is terrible literally I was aiming down at an orc and somehow I the arrow ended up in the sky second off it's the same exact enemies every single time either orc or an axe throwing orc a flyer a dragon or a big orc or a big blue orc with a helmet at least other wave fighters can come up with new enemies every once in awhile\n\nHelpful | 1\nDeveloper ResponseJun 20 at 8:32 AM\n\nHello, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, you've mentioned some difficulties with the bow aiming - have you tried the \"Arrow offset\" option from in-game settings?", "Masterpayne.io19 days ago\nDisorienting Draw String Effect.\n\nIs a great game so far. Though, I wish that I could adjust where the draw sting is attached to the controller. It feels like the string is an inch from my finger, breaking the experience. But other than that it is awesome.\n\nHelpful | 0", "JammyOSawRusRexJun 3 at 3:06 PM\nLots of fun, especially pvp mode\n\nLots of replay value for a game this price\n\nHelpful | 0", "55MosesInboundJun 2 at 5:38 PM\nFun Game worth downloading!\n\nGreat for playing with friends and family!\n\nHelpful | 0", "walton75Apr 4 at 6:46 PM\nBigC\n\nAm new to VR. This is a great intro game. Lots of fun in multiplayer mode with friends. Not a lot of thinking required, just fire away. Could see where it could get boring after awhile but overall a fun easy to game to play. Highly recommend for new users.\n\nHelpful | 0", "NaddybugApr 20 at 9:21 AM\nI love it\n\nI DO love the game, BUT it would be cool to have more variety for worlds. Other than that, I can play this for hours (or until my headset dies.)\n\nHelpful | 0", "MAGA.MEGAApr 8 at 3:36 PM\nThe best game\n\nI really enjoy this game. Played plenty of shooting games but I love archery the most - guns are for amateurs :) I like the co-op for up to 4 players. There is also pvp but I have never tried since I like working together not against each other. Graphics are decent. Its pretty relaxing yet challenging. The only problem I am having is to join the multiplayer games: have to try several times before I can join because when I clicked the join button, it took me to somewhere else. Hope they will fix it\n\nHelpful | 1", "ElTorro21Jan 27 at 4:55 PM\nSuper fun\n\nI love playing this game but I wish the developers would add more maps with interactive weapons, have it so you can undo certain purchased spells like in the game Wands and make it to where your purchased gear actually effects your combat and hit points during the game. Also to have the single player portion be different than the multiplayer.\n\nit seems like a few updates could make this game phenomenal. Even so though, it is great and super fun.\n\nHelpful | 10", "mrb.jmbMay 11 at 11:20 AM\nEEeeEeEeEEEEEe\n\nGORILLA BE LIKE: HOHOHOHOOHOOOOOHOHOHOH BANNANA\n\nHelpful | 2", "gazoopsApr 30 at 11:47 AM\nFun\n\nIts a simple game but highly enjoyable. Wish the multiplayer was harder.\n\nHelpful | 0", "SparkzzlyMar 25 at 7:11 PM\nLots of fun\n\nThis game is a lot of fun. Im a total nine to this kind of game place so its easy enough to get a hang of. I do wish that the time between the end of a wave and the start of a new one could be sped up though. It seems like its a lot of waiting around.\n\nHelpful | 0", "FilamoriaApr 7 at 6:03 PM\nBeware the dragon\n\nAmazing interaction with the environment and you. Kill the orcs, slay the dragons, and down the giants. Team play is alot of fun. Highly recommend this multiplayer game.\n\nHelpful | 0", "Harcourt.MuddFeb 26 at 9:07 PM\nLoads of fun!\n\nI'm sure I'm not the first to say that the multiplayer is what this game is about. It's just loads of fun to shower arrows at the oncoming orcish hordes!! Not a whole lot of maps, but I still keep coming back for more. Want to give four and a half stars, but can't give full five without more maps.\n\nHelpful | 2", "BenUSA1Apr 22 at 9:11 AM\nMutliplayer plus, PVP has 1 Map Only\n\nIt needs more maps for PVP, ain't that hard to do.\nPVP can be 2 vs 2 or 3 vs 3 too like Team Death Match in larger location.\n\nHelpful | 0", "Hyrule109Mar 8 at 6:15 AM\nGreat multiplayer title\n\nWhat a great concept! I've been having an amazing time playing this. It's definitely a multiplayer game though, there's not really enough single player content to keep you coming back for more. However working with a team of 3 other players, holding off the horde and showing off your improving skills is a great experience! Definitely worth a buy, provided you have a stable internet connection for co-op!\n\nHelpful | 1", "DarknessWithin2009Jul 3 at 11:33 PM\nAmazing\n\nThe bow being my personal favourite weapon if you like archery get this game it is so fun\nJjfjvhcnjdj fdbvidfbjhbhjfebyifebvfeihbhfbvfuebhjfebvhiefbviuefbiucerhihefbvuisnv idk shbhbfhebhbicnhbehhkrevkfbcjfbskhtbvhjbchjdfbvhfdbvhdfvfdkhvbdhvbdiufbviudbvhkdbhkfdbvkhdbvfkhbvdkhvbfdkuvbdfkhvbfdkhvbdkhvbdkhbfdhkbfddhkdbkhbfduibfjvkbdfjkvnfdkjvgrkhtrvkh idk still efjhjfbifbvdhkrbhkndhivbfehnvhkfevjfnvjkdfbjkfebvkjdfbvukfdnkjebfkjvbdkhvbfdkbdfukvfdhkbfdkjvbfekhvbfehkvbrfkhvbefojbvihbrfhkbvrfhvnrfhkvvfrkhb I don't have the Tim to write a real review jnjbhkbhjdbcjhfebvjhdebckhrebvkhfebfdhkfbkfhsvbbfdhvbdhkvbfdmhvfdhkvbfdvhbfekhvbfrkhvbfkhvbfdhvbdfhkbhjfdbfdhkv fdhkvbdkhbvkh bcdhk d hjbvdfkbhfvehkvfebkhvfebhkvfdbhvfdvhbkhbkvfskbhsfbhksvfhkbfdvhkbvdhbkfckhbvfdubkefvibuefv efvbiufevbfuif\n\nHelpful | 0", "kwh78May 19 at 12:19 AM\nHit and miss\n\nIt seems to be really fun at first, but there's something way off with the bow/aiming mechanic compared to using a real bow. And for me that's a deal breaker.\n\nHelpful | 0\nDeveloper ResponseJun 20 at 6:40 AM\n\nHello kwh78. Thank you so much for trying out our game. We are really sorry that in the end, you did not have a good experience with it. If you could provide us with more information on what you feel was wrong with bow/aiming mechanic we would be happy. That way we can improve in the future. Also, have you tried the \"Arrow offset\" option from in-game settings?", "dave.jackson.505Apr 26 at 5:41 PM\nI like it !\n\nGood game good price. Hoping for updates\n\nHelpful | 1", "cmay555Apr 4 at 11:53 PM\nElven Assassin\n\nGame definitely exciting to play. Players chatting away while we unleash hell on the enemy. A bit glitchy but most players know how to keep the waves rolling. Oh ya 1 negative, if you have to reset your headset all your progress is gone. Not cool...\n\nHelpful | 1", "BadLarryNYMay 11 at 2:09 PM\nSubpar in so many ways.\n\nBare bones in presentation, poor animation and what seems to be shoddy hit detection and inconsistent aiming. To top it off, not one shred of a tutorial at the start. Requesting refund.\n\nHelpful | 2\nDeveloper ResponseJun 20 at 7:02 AM\n\nHello BadLarryNY, thanks for trying our game and sharing your thoughts. We've recently released an update with improved textures quality, improved quality of the environment around the Player, adjusted enemies animations, and more. We have some tutorial information that appears with the first launch of the game on how to teleport for example. You can also find some information on how to use spells in the lobby or a controllers guide which is available from in-game settings. Would you mind telling us what tutorial aspects we should consider adding? That way we can improve in the future.", "Blue_MermaidMar 23 at 10:07 PM\nGreat game\n\nMy fianc and I love playing this together. He posts up in the living room with me in the kitchen lol. We played it at a VR storefront and were hooked and bought each other headsets for Christmas. I have zero gaming experience and have really enjoyed it, he has lots of gaming experience and has enjoyed it just as much. Great game for all levels, and fun activity to do as a couple. After nine years of trying he finally has brought me into his gaming world with VR and this game.\n\nHelpful | 1", "TorisHusbandMar 22 at 8:47 AM\nWhy havent you gotten this?\n\nI get it, the graphics arent the best... there is a lot of repetition and the game overall - probably needs a good update.\n\nBut this is one, if not the best, family multiplayer experiences. This is the game that even non-VR people in my circle seem to enjoy.\n\nThis is not worth your time if youre a single player or storyline kind of person.\n\nHelpful | 1", "WVbrUApr 28 at 4:30 PM\nGood idea, incomplete game\n\nFix multiplayer, give me missions, and please let me start arcade at higher difficulty.\n\nI love the concept and the arcade is good. I just wish I didn't have to play the lower levels to get to the fun stuff.\n\nHowever, the \"RPG\" is just arcade with spells. There is NO STORY or MISSIONS, NO REAL PROGRESSION, and NO END GOAL. It doesn't need to be a full-on RPG, but there should be levels missions or something, and changing environments.\n\nMultiplayer is a mess, I spent an hour trying to find a friend's lobby, but the list kept glitching. Even when it showed up, I couldn't actually join.\n\nAll said, it is still decent fun. But with a few improvements, it would be down right addicting.\n\nHelpful | 1", "BratmasonMay 26 at 12:16 PM\n\nVery fun game\n\nHelpful | 0", "TnaknspnakMar 13 at 12:00 PM\nVery fun and worth the $$$\n\nElven assassin is a lot of fun and you should get it. There's room for improvement. Please let us switch bow hands during an open game. Maybe toss in some random power ups during combat. More levels and vantage points would be cool.\n\nHelpful | 1", "Tamtam27Mar 31 at 2:53 PM\nBest Multiplayer Game\n\nElven Assassin was such an amazing surprise. The solo game is just ok but the multiplayer with friends is incredible. It's challenging, fun and surprisingly stress relieving. Going thru waves of orcs with buddies is the best VR experience to date.\n\nHelpful | 0", "Ishih-tzunotApr 20 at 9:29 AM\nNeed more scenery\n\nIts a fun game . Challenging n a good workout for your legs n arms .wish there will be more scenery soon . Getting bored with same one...\n\nHelpful | 0", "Dragonmagic69Apr 4 at 9:10 PM\nA lot of fun.\n\nI play this every day. You can play with 3 other people. Multiplayer is where this game really shines.\n\nHelpful | 0", "superfriend2OOJan 24 at 6:41 AM\nGlitchy w/ little depth - but still buy\n\nThis is a very fun and addictive multiplayer game. But it has more glitches than any game I have ever played. And the glitches are serious and happen on the regular. From getting kicked out of the game to having the A.I. elements of the game behaving contrary to what they should (Eg refusing to die), it can be extremely frustrating.\n\nAnd yet I play every night. If they got rid of the glitches and added more features and depth to it, it would be by far the best game.\n\nHelpful | 4", "dana.shields.71Feb 22 at 7:49 PM\nGreat game but needs a little work\n\nI played this game for hours. Playing solo is boring, but multiplayer is awesome.\n\nI just wish the towers were more interesting. If U compared to, say, Apex construct, in that game there are walls you can hide behind and slice around.\n\nAlso, someday I'd like to use a play area that's large enough that I could sneak up on them as they come out.\n\nHelpful | 1", "rsstruthersMar 8 at 2:31 PM\nEntering multiplayer almost impossible\n\nLove the game. Playing it in a VR arcade was the reason my friends and I got Oculus.\n\nWe were super excited to get together online and play. Set up a private multiplayer. Sometimes one could join. Never all 4 of us. Kept getting booted to other games or weird changes in the list of available games after pushing join button... ie a new list that wasn't present before pushing join. Are the servers overloaded? Buggy? What's the problem?\n\nHelpful | 2", "srvoApr 24 at 6:16 AM\nGreat fun!\n\nPerfect for a quick session every now and then. More of an arcade experience than a RPG but it's great fun.\n\nHelpful | 1", "jorge.gonzalezgilApr 13 at 12:28 PM\nMultiplayer\n\nGreat and fun multiplayer deathmatch experience. The game is worth buying just because of it.\n\nPlease, add some extra deathmatch scenarios!!\n\nHelpful | 0", "VReSwatiniFeb 15 at 1:02 PM\nGood times overall\n\nIm not sure that I have enjoyed a game that I have sucked at so much.  I'm looking forward to getting better and spending many hours shooting orks and giants, plus what ever comes next. I liked the graphics as well and found the game play enjoyable.\n\nHelpful | 2", "Chicko-62May 17 at 2:46 PM\nThink of The Hobbit and your there\n\nIve not played for long but it is a great game and shows a lot of promise as a multiplayer game. I have not gone multiplayer yet as I have been practicing and trying to earn gold coins so that I can better my bow and armour. For this reason I have not yet got my head around the spells you can use in RPG mode.\nThe graphics are ok, you can believe you are actually within the game. The only thing that does not seem real is the fact that the orcs do not fight back as you may expect when you are firing arrows at them. You do get an axe thrown at you if you do not get a kill shot. Apart from that the orcs just run for the village or temple gate. This may be different in multiplayer but at this point I cannot comment on that.\n\nUpdate after reaching level 35 and playing on the internet for 3weeks.\nThe game is still great and it is good to talk to folks from other countries. That said a message to the game writers would be is that the game does need some updating as it does get a bit samy. It reminds me of the old space invaders where every think gets faster and there are more foes, up until you final demise.\nA few suggestions would be:\nTo be able to kill the dragon and get spell points or some other bonus.\nTo be able to exchange gold for some kind of bonus, perhaps a bonus that kills the dragon.\nOnce you have got the 10,000 coin armour perhaps you could use the gold to make it more orc/axe proof, so that the magic spells can be used for attack rather than defense.\nIf the axes could be thrown back, and earn spell points by doing so. I know this would not be possible beyond say wave 10 but it would change the way the game was played by the serious elven assassin.\n\nHelpful | 1", "Mark-BlissJan 26 at 8:16 AM\nVery fun\n\nThis game has great graphics and is a very fun game, definitely worth the money. However when you are trying to meet up with a friend and play together its very difficult to locate each other. After several tries we were only able to find each other once. Single player and multiplayer are both fun if you can locate each other. Definitely give it a try\n\nHelpful | 3", "Wyrd_TrapezoidApr 8 at 1:00 PM\nmultiplayer is fantastic! great game!\n\nPretty good game! The multiplayer is particularly awesome! Pretty cool to fight waves of these monsters alongside three other players. Hope to see some more additions!\n\nHelpful | 0", "Smiley9665Jun 24 at 8:14 AM\nCould be Great\n\nA fun game but as stated it has some bugs that need to be worked out. Once they are it will be a five star. Even now I would give it a four and a half.\n\nHelpful | 0", "SpoonerFamMay 14 at 7:20 AM\nYou need to get this game\n\nThis was the first app that I bought with money and it was great.It got me more adventurous with my oculus but it is still probably my favorite game. Easy 5 star\n\nHelpful | 0", "sandarlowJun 23 at 12:56 PM\nGlitches\n\nI like this game for the most part and the low cost. It was fun to play online with my daughter but I kept having issues with my arrow getting stuck in my fingers and I couldnt do fast consecutive shots to keep up, she was able to get more shots in than me. An update is needed to fix this issue. The only way I could get the arrow unstuck was to shake my controller really hard between shots and Im sure thats not good for my controller and my arm, I was sore afterwards.\n\nHelpful | 0", "mark.testaseccaJun 3 at 10:20 PM\nYou get what you pay for\n\nIts fun but theres not a lot to do and you get bored really quick but the physics are cool!\n\nHelpful | 0\nDeveloper ResponseJun 20 at 4:47 AM\n\nHey mark.testasecca, thanks for your opinion. We are glad that you liked the physics! We would love to know if there are some things we could add or change to make the game any better for you. Please let us know if you have any ideas. Also, have you tried a multiplayer deathmatch mode? It's a slightly different experience than the co-op.", "skrulleboyMar 7 at 5:35 PM\nGreat game\n\nGreat game and idea. My goto chill game. However the serverlist is buggy. Very poorly to be honest. Would wish the bow upgrades actually mattered. Second, start at specific levels would be nice, because your quest will run out of power before you are defeated.\n\nHelpful | 2", "MindTracerJun 21 at 4:53 AM\nCrashes constantly yet I keep going back\n\nThis is an addictive wave shooter. I keep coming back for a quick session everyday to level up my archer despite the near constant crashes (where you lose the points earned before the crash). I think that says something about the overall package here, especially as one not interested in the fantasy genre.\n\nWould give it more stars for crash fix and new environments.\n\nHelpful | 0", "hightechfoolFeb 8 at 12:58 AM\nIncredible multiplayer\n\nHaven't even played single-player yet... but even just the multiplayer & shop experience deserves an easy 5-stars! The fact that there's a whole single-player experience I haven't touched...well this game is one of the best values in the store. Shocked there aren't more 5-star ratings. I really hope they add more maps!!!!!\n\nHelpful | 3", "Memer-gamermanFeb 21 at 7:04 PM\nAmazing and fun\n\nElven assassin is a amazing game I love shooting enemy with arrows and using spells to help kill them but aiming the bow and arrow is hard and for me learning spells takes awhile but other than that its awesome especially the multiplayer\n\nHelpful | 1", "afroblademasterApr 17 at 2:04 AM\nFun, but not worth the $20\n\nIts a bit jank, and they should really tell you that you need to turn around at the menu screen to upgrade, but it IS fun. Its just not worth the $20 IMO.\n\nHelpful | 0", "Roo1212Jun 18 at 10:38 PM\nGreat game!\n\nI had low expectations but this game really immerse me into the VR universe! I LOVE LOTR and I truly feel like I'm in the middle of a battle! Loved the physics of the arrows and bows! Simply a great game and a lot of fun for bow and arrow lovers\n\nHelpful | 0", "CageyKGApr 17 at 1:28 PM\nAwesome game, one of the best\n\nI have loved this game since it first came out and still do.\n\nHelpful | 0", "Whodyy20 days ago\nEh\n\nIt gets a little boring after the first five minutes also the bow is always pointed a bit far to the right.\n\nHelpful | 0", "DesendantZero75May 17 at 4:24 PM\nMultiplayer is where it's at\n\nFun in single player, much more fun with a group.\n\nHelpful | 0", "jjamirFeb 23 at 5:28 PM\nWhy its an amazing game\n\ngoing into a long multiplayer game with some chill moments and some intense gameplay is really fun! You get to talk to new people and learn spells as you level up. It has different kinds of bows and helmets that you can buy with you game currency. You dont have to buy the currency too!! Altogether its such a fun game; very different than other games.\n\nPs. Its easy to gain coins and is my favorite game on VR\n\nHelpful | 1", "LeoAtreidesJun 26 at 4:29 AM\nsadly no crossplay between Quest andRift\n\nThis is one of my favorite games i like to play together with friends. And just now i bought a Quest for my wife so that she could join us byt only then found out that multiplayer on the Quest is seperated from the Rift/Steam multiplayer... why?!? so in other words i wasted money for the Quest and the Quest version of Elven Assassins :(. I hope they will chage this in the future, tyan they get 5 Stars but this way none for the Quest version of tgis game...\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:05 AM\n\nDear LeoAtreides, Thank you for your feedback. Currently the crossplay on Oculus Quest & Steam/Oculus Rift, unfortunately, is not supported. We do have plans for the future development of the game and we might implement the crossplay in the future. You might consider getting an Oculus Link cable. It provides the access to Rift games and experiences from a gaming PC on Oculus Quest. Also, please remember about downloading newest updates. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "Ray_StarlingApr 13 at 1:21 PM\nYay\n\nYayyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy\n\n\n\n\nYeet\n\n\n\n\n\n\n\n\n\n\nUr welcome\n\n\n\n\n\n\n\nBye\n\nHelpful | 1", "CarmacAndCheeseDec 27 at 8:02 AM\nBetter than good but not amazing\n\nLets face it, killing fantasy monsters is extremely fun. However, theres only 4 coop maps, and the upgrade system is far from extensive, most if not all of the damage done comes from arrows, not spells. little content and upgrades that do nothing major are the main fallbacks. Conversely, I would still recommend, as the game is still able to give 10 hours of escape from life without getting boring.\nBTW, if a developer reads this, can you guys get a DLC/expansion released, double the maps and many add in another upgrade system, many one that resets every game and is upgraded in battle? Im just saying I would buy a DLC, even if its $30\n\nHelpful | 5", "TeebooTedJan 15 at 7:25 AM\nFun game with some glitches\n\nPros: Fun game with engaging social/cooperative structure.\nVarying difficulty level on maps. PVP, single player, and co-op modes. Collect gold to buy flashy gear. Gain magic spells to do more damage.\n\nCons: Gold is only useful to buy a look. It would be great if those did more damage (or something more). Players regularly get booted from games in the middle of a wave with the message You have been disconnected from the game. Orcs and birds glitch and walk into rocks, up mountainsides, and behind walls and without a meteor or ice shower, youre not likely to end the wave very quickly. Time between waves gets longer and longer the farther you get. Shortening that would be great. Adding another couple of maps would be great.\n\nBottom line: Fun game with some glitches and opportunities.\n\nHelpful | 2", "Seboy2006Feb 10 at 8:22 AM\nGood but glitchy.\n\nThis game is really fun and it's exciting how you can unlock different spells and bows. The only thing is it's quite glitchy. Devs, if your reading this, this would be an amazing game if you polished it up. Other than that, it's definitely worth buying.\n\nHelpful | 1", "Sb1986Mar 20 at 11:37 AM\nLove it\n\nReally fun to play with friends\n\nHelpful | 0", "thesekineticsJan 10 at 11:13 PM\nFun game with a good skill curve\n\nA really fun game that's the classic \"easy to learn, difficult to master.\" I play with my retired father and he's a headshot machine, while I've been gaming for over a decade and can barely shoot a thing. The graphics could be better and wow, they need new music, but the game is enough of a challenge and fun enough to still be worth four stars! Devs, please update this lovely game!\n\nHelpful | 2", "AllbeeApr 10 at 9:32 AM\nElvin assassin\n\nVery very fun game\n\nHelpful | 0", "cfhanksMar 17 at 10:23 PM\nGreat game but needs work\n\nThe areas could be expanded on and could use a better single player mode.\n\nHelpful | 0", "FatSheamusFeb 11 at 4:31 PM\nRepetetive Yet Addicting.\n\nThis game certainly challenges your abilities. When it comes to having a steady hand and a good eye. Rather than just mine was aiming and shooting, you really do have to have your arms lined up as if you were really pulling a bow and arrow, which makes it that much more satisfying when you're shot meets its mark.\nThis is definitely a game of made be played socially, and there's almost always people around to play with.\nThe leveling system is a little steep, but you find yourself playing it for such long hours that it comes about a lot easier than one might think.\nI hope in the future if they Might provide a little TLC with a few more environments. The four they have are fun, but it might be neat to try some new places.\n\nHelpful | 1", "Satanic_EntityMay 14 at 5:27 PM\nThis game sucks\n\nIt's just repeating B.S.\n\nHelpful | 1\nDeveloper ResponseJun 20 at 6:47 AM\n\nHello. We are so sorry that you did not have a pleasant experience with our game. Would you mind telling us what aspect of the game did you not like? That way we can improve in the future.", "Links_GoldstMay 25 at 9:29 AM\nOutstanding game\n\nThe game is great the only that sucks is you cant add friends and the game crashes a lot. But I would still recommend for anyone who loves archery games to buy it.\n\nHelpful | 0", "Royal2FlushMar 28 at 7:24 PM\nGreat...but...\n\nLove the game. Shame the big,dragon doesnt die it juast flies away. And the multiplayer rooms have problems\n\nHelpful | 1", "kenneth.purcell83Apr 3 at 8:19 PM\n\nAwesome\n\nHelpful | 0", "szlesinscy.vr1Dec 28 at 2:19 AM\nAwesome game with unplayable multiplayer\n\nThis is one of my favorite vr games and it would be a strong 5*, BUT MULTIPLAYER IS A JOKE. I own 2 headsets and I bought 2 copies of this game to be able to play with my wife. Unfortunately, most of the time one of the following happens: 1. \"Join\" does nothing, it just refreshes the server list and there's usually just 1 or 2 of them, never the one you tried to join. 2. The same but sometimes happens after you enter the code. 3. You get disconnected during a game A LOT. Like once every 3 waves. This is insane! I'm willing to change it to 5 stars, but FIX MULTIPLAYER first.\n\nHelpful | 24\nDeveloper ResponseJul 16 at 9:24 AM\n\nDear szlesinscy.vr1, Thank you for your feedback. Please check out the latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Weve also improved networking, lobby and servers list (joining, refreshing). Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "TyshoMar 27 at 1:15 PM\nGreat game\n\nI really enjoy this game. I recommande it to play on multiplayer\n\nBut I hope it will be updated to add more fonctionnalities and diversity. I get bored after 5hours\n\nThis game has a great potential\n\nHelpful | 1", "ParadoxPlate_4DFeb 24 at 9:18 AM\nREALLY GOOD\n\nMultiplayer is best, the price is affordable and the game is VERY FUN\n\nHelpful | 1", "TwitchyWitchMar 16 at 10:33 PM\nMulti-player\n\nDefinitely like multi versus alone. Very cool game!\n\nHelpful | 0", "ZephyrTheDreamerMay 25 at 12:10 AM\nUnimpressed. Felt like a free phone app.\n\nThis game felt like a free phone app. First and foremost the lack of instructions is messy. It tells you basically \"don't let the bad guys into the village,\" but it doesnt tell you how to navigate the menu (you point your right hand and click on of the standing positions), how to switch vantage points (shoot the glowing places to stand there), or why your screen suddenly turns red and you cant shoot sometimes (it means a bad guy attacked you (which is odd for a tower defense game) and you just have to sit there helpless for a while), or how to dodge attacks (move to another vantage point before the projectile gets you). I didnt even know spells were a thing before I figured out how to get around the menu, and turns out you can only use them in multiplay mode.\n\nWhile the lack of instructions was annoying, the control scheme is worse. The draw strength doesnt mean anything (if you barely pull the arrow flies same velocity as full draw back), the aim is incredibly fickle and not life like (although my comparisons to life like could be harsh due to me using a bow as a hobby, I'm an active archer in real life), and the only way to avoid attacks is to switch vantage points, and pulling that off with the inconsistent aim of the bow is quite difficult.\n\nIn conclusion I would have to say that, despite nitpicking, is an ok game. Not great but ok. This is the kind of quality I would expect from a free app. The base idea is great, hence me giving it more than one star, but you cant charge money for an app with this low of quality.\n\nHelpful | 0\nDeveloper ResponseJun 20 at 8:16 AM\n\nHello ZephyrTheDreamer, thank you so much for your opinion and suggestions. We will definitely work on improving the aspects that you've mentioned. Consider checking back the game someday later. We would love to hear if this got any better for you.", "Slipknotmaggot44May 10 at 12:58 PM\nExcellent coop game for the price\n\nGame gets very challenging at higher waves, as you play you level up and earn multiple up-gradable spells to choose from. You will also earn gold from getting headshots and surviving waves to buy cosmetic items. Plenty of friendly players online. Highly recommended!\n\nHelpful | 0", "dukjrJan 31 at 5:03 PM\nBad\n\nI am going to be honest I watched the vid and seriously was convinced, I was wrong. As soon as I started up the game I was excited and when I got into the level I was severely disappointed. Though I do want to mention I REALLY love the graphics (this is why I give it 3 stars).\n\nHelpful | 2", "jaxdashboltFeb 13 at 4:13 PM\nReally fun to play everyday\n\nThis game is a super good investment and you can easily spend all day playing this online. Im hoping for future updates but thats not to say the game isnt truly epic. Good job devs.\n\nHelpful | 1", "D3LARAFeb 15 at 8:02 AM\nMultiplayer!!\n\nNeed more games like this! You can play with friends and against. Online PvP is currently in beta stage but is really fun. Hopefully add more cool features like 2v2 and more maps soon.\n\nHelpful | 1", "RaphybabyMar 1 at 9:23 AM\nA++\n\nA++\n\nHelpful | 1", "Justin1111089Mar 1 at 5:44 AM\nFun\n\nVery fun takes a while to get good with the bow but fun try to play with friends now thats addicting\n\nHelpful | 1", "catskulFeb 9 at 6:59 PM\nVery fun but gets boring\n\nThey need to allow skipping levels so that experienced players don't get bored.\n\nHelpful | 2", "ThumpertJan 17 at 8:37 AM\nBest introduction to VR\n\nMy son bought his nephew our grandson a VR experience whilst in Melbourne. This was the game he played and he was so excited by the experience we paid for another experience for the whole family and we all played Elven Assassin. The experience was on an HTC Vive Pro rig so we were looking at how to bring it home. Then the Oculus Quest came on the scene and we got 2 of them and Elven Assassin was the first game we bought. It is very engaging and we have yet to explore all the features such as spells etc.\n\nA really good intro to VR for all the family.\n\nHelpful | 2", "wheelermarlowMar 15 at 5:26 PM\nGreat multi player game but not...\n\nNot single player though\n\nHelpful | 0", "teddymvFeb 28 at 10:52 PM\nVery fun\n\nVery fun. Multiplayer is where it's at for this game, as others have stated. Good value for the money.\n\nHelpful | 0", "Jack_N_CokeNov 21 at 12:02 PM\nAmazing...But..\n\nLove the game, by far one of the best for multiplayer.. Yes graphics NEED updating, my main issue is the game crashes far too often... The crashing is really problematic... Fix those 2 things, and voila the best game on VR so far!\n\nHelpful | 12", "KryptonianSonJan 17 at 8:43 PM\nOne of the top experiences in VR\n\nThis game was amazing when I first got it. Teaming up stopping hoards with the bow and arrows is more fun than you can imagine. But now the PVP mode is introduced and seriously youve got to play it. Get into a fun group and the biggest problem youll have is no matter what you wont have enough battery.\n\nThis is a great game, everyone should play it.\n\nHelpful | 1", "ed.vo.88Feb 16 at 12:31 PM\nKeeps crashing\n\nI really enjoy the game but it keeps crashing on me. Any tips?\n\nHelpful | 1", "TheBlondeBombshell14Dec 30 at 7:35 AM\ngreat game and concept with Skyrim vibes\n\nReally awesome game, good gameplay and nice concept. enjoy playing it but just wish there was more of an adventure game feel to it as it is more of a knock out vibe to it with waves of enemies that you have to work through. good for going on online and multiplayer but again more customisation would be great.\n\nHelpful | 0", "matthew.harvey.1460Jan 19 at 9:36 AM\nFun\n\nThis game is definitely fun. It has its rough spots here and there, but overall really nice. There is a learning curve with shooting the bow and arrow, takes a while and different maps seem to have their own. The levels don't seem to scale with the number of players on the map, so more players the further you should be able to go. All in all with the money, and hope the developers continue making updates.\n\nHelpful | 0", "chitty73Dec 27 at 8:49 PM\nBetter than I thought!\n\nI really like this game. Haptic feedback is great, spells are good, and how you activate them is perfect. Really enjoyed this, despite a few frustrations when game crashes in multiplayer.\n\nOnly thing is I cant seem to see any place that records top scores? If the goal is to survive as many waves as possible, would like to see a place recording how many waves I have survived.\n\nHelpful | 0", "szlesinscy.vr2Dec 27 at 3:54 PM\nAwesome game with unplayable multiplayer\n\nThis is one of my favorite vr games and it would be a strong 5*, BUT multiplayer is a joke. I own 2 headsets and I bought 2 copies of this game to be able to play with my husband. Unfortunately, most of the time one of the following happens: 1. \"Join\" does nothing, it just refreshed the server list and there's usually just 1 or 2 of them, never the one you tried to join. 2 The same but sometimes happens after you enter the code. 3. You get disconnected during the game A LOT. Like once every 3 waves. This is insane! I'm willing to change it to 5 stars, but FIX MULTIPLAYER first.\n\nHelpful | 8\nDeveloper ResponseJul 16 at 9:24 AM\n\nDear szlesinscy.vr2, Thank you for your feedback. Please check out the latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Weve also improved networking, lobby and servers list (joining, refreshing). Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "alex.densvenskeMar 1 at 10:13 AM\nThe best experience in pvp\n\nIt is really cool and interesting training. I'm really love pvp in the game\n\nHelpful | 0", "KevinaterDec 24 at 9:57 AM\nJust What I Wanted\n\nThis is my first review on the store just to further convince my past self and you that this is the archery game you're looking for. Great levels, gameplay, and ways to keep leveling up so it's definitely worth the money. The multiplayer is fun but so is just by yourself. I've looked forward to getting home the past week just to get back into this wave defense game!\n\nHelpful | 1", "PoimisApr 19 at 10:11 PM\nAmazing game but way too buggy\n\nIf this worked well, it would be an easy five stars. If it werent so good a game as it is, it would be an easy one star.\n\nThe lobby is amazingly buggy, being so simple screen. Sometimes it feels impossible to enter any given game. The items in the list change randomly, forcing me to go back to main menu.\n\nThe biggest problem, though, are the frequent crashes. Today I had an hourful of orc hunting and during that time I had to restart the game at least five times. Today is no different fron any other day.\n\nSometimes it will crash after one minute playing, sometimes I can have half an hour of playing, but I have never managed to play over 30 minutes without any problems. Please, make a bug fix release!\n\nHelpful | 2", "ken.hutchJan 12 at 4:10 PM\nLooks good, fun to play.\n\nThis game can be a touch repetitive and can seriously wear out your arm. Beyond that, it is a lot of fun and pursuing the rpg spells and helmet-bow gear keeps me playing.\n\nI am unsure if playing multiplayer, if I want to leave the game, do I get any of the gold or experience? It seems that I don't. Multiplayer games can last a long time...it would be nice to have like a cash-out-now option. Many times the game went beyond the amount of battery I had left so I lost any rewards for playing.\n\nI see no crashes with this game which makes me think those that are have some other issue, something else did not close, or the game installed wrong.\n\nI do see issues in joining multiplayer games though...many times clicking to join does not join but shows a new list...none of which can be joined. Going back a few times I can usually get into a game though.\n\nHelpful | 1", "DeepchargerMay 9 at 6:08 PM\nFun\n\nReally fun game I have some ideas for the game though I wish you could walk around and use swords and stuff\n\nHelpful | 0", "SpelingBeeFeb 17 at 2:44 PM\nGreat Game!\n\nPVP is so much fun... Love this game!\n\nI wish the music and sound effects were louder though for a more immersive experience.\n\nHelpful | 0", "CatGirlGamerJan 2 at 7:27 AM\nFun with friends\n\nThis is a great game to chill and have fun with your friends. The only issue I have is joining servers, esp. ones your friend created. It takes 3+ times going through the menu to actually get into their server. Once in though, I have hours of fun.\n\nHelpful | 0", "frank.detank123Dec 26 at 4:49 PM\nUpdates and Bug Fixes Needed\n\nThis is a really fun game when it's functioning. It's a fun social game. They do need someone additional maps and functionality. The glitches when it's being heavily used is getting old. The good outweighs the bad though. Keep playing, you'll get faster dodging and shooting.\n\nHelpful | 0", "Carl_Wheazer420Apr 19 at 5:27 AM\nGreat game for new comers\n\nI love this game and Ive only had for a couple days but I still love everything about it\n\nI dont know if anybody else is experiencing this but occasionally the game crashes and I have to join back to the lobby I was in and I lose all my points but I still do get the coins and levels . Its not that big of a deal but it is really annoying.\n\nHelpful | 0", "fitzgibb0nMay 10 at 10:42 AM\nIt's a pretty good and fun experience\n\nAlso a nice workout for the arms. But it could use more content and more different levels.\n\nHelpful | 0", "LoevesteinJun 6 at 1:41 PM\nAddictive\n\nI truely love this game. Especially when played together\n\nHelpful | 0", "TopoSolitarioSep 5, 2019 at 11:51 AM\n\nI'm ejoying the game. For some reason bow games are always good on VR. My only concerns (and that's why it doesnt go for 5 stars) are the following:\n\n1- Most buttons are unused... it could be great to use some of them to switch between platforms or freely move in your current platform (if you're playing seated or with restricted space).\n\n2- Graphics ara a bit below expectations... it looks way better in the screenshots, textures and effects ingame are worse than that.\n\n3- Bow behavior is a little weird, for some reason it repositions your bow hand when you set an arrow, that is a bit weird. Comparing to Apex Construct behavior, Elven Assasins behave a little artificially.\n\nI expect you can address some of these points in a near future. :)\n\nHelpful | 136\nDeveloper ResponseSep 5, 2019 at 1:47 PM\n\nHi, thanks for your interest in the game and feedback. Nice idea, with a new way of teleportation  we will discuss it. Also, we will investigate how we can improve the graphics more.", "MissMantisDec 24 at 3:11 PM\nAddictive\n\nThink you may enjoy archery? Do not hesitate. IT IS SO FUN. Multiplayer is awesome and I've met some really great ppl. (Note: My 5 star is based on the Quest only. I've also played on Rift S but the Quest version is far superior (imho.) There is definitely more detailed graphics on the rift s, but it is a darker vibe, barbaric, blood squirting out every time you hit your target, etc. which is off putting for me. Plus, it is much, much harder to shoot - the difference btwn having power steering and not. For me, the Rift s ver. earns max 2 stars.\n\nHelpful | 27", "CriticalPFeb 21 at 12:39 AM\nAll about the shooting\n\nNo amount of spells will make you great, accuracy and speed is the name of the game\n\nHelpful | 0", "VerselDarastrixMay 12 at 7:10 AM\nPunched my headset a bunch :(\n\nReally fun, punched my headset alot because my arm is short as hell. Anyways it's a fun game and when the fanbase grows the multiplayer will to which I'm looking forward to\n\nHelpful | 0", "hey-johnboyFeb 2 at 2:40 PM\nAwesome multiplayer game!\n\nI love this game so much , I can hardly walk from dodging axes being thrown at me.... would be great in the future to have some modern day warfare versions of the game.... be a sniper, a tank, maybe even a battle ship....\n\nUpdate- now that Ive leveled up my spells and armor I need something to spend my money/ experience points on... armor that makes a difference would be cool.... maybe extra spell slot or a powerful nuke attack with long cool down!\n\nHelpful | 2", "commandermannFeb 17 at 7:48 PM\nFun for beginners\n\nThis game is a simple and a great entry game for beginners.\nThe real fun is multiplayer who communicate and act as a team.\nGreat fun and greAt value for the price!!!\n\nHelpful | 0", "jmanis2Dec 3 at 3:44 PM\nFun game but overly simple mechanics\n\nI nearly stopped playing once I learned that collecting gold and upgrading armor and bow has no effect on damage inflicted or taken. Neither does the strength of your arrow pull. Quick flicks of the bow cause arrows to travel just as far and inflict the same damage as a full pull.\n\nSpell Upgrades are the only real progression in the game and are based on your level and earning of spell points. Unfortunately the rate of collection of spell points is a mystery unexplained in the help.\n\nRegardless its still one of the only 4-player games and worth several hours of playtime. If more was done to take advantage of the mechanics the game could become a lot more technical and challenging.\n\nHelpful | 1", "hmallar1Dec 24 at 6:39 PM\nMultiplayer bugs\n\nI would give this app a 5-star review for its multiplayer experience because it is so much fun, especially with someone you know, but more often than not during multiplayer games the app will freeze and I will be kicked out of the whole thing, back to the Oculus home screen. Upon returning to the game and rejoining the current session (if its still going), you have lost all points/gold gained.\n\nHelpful | 11", "michael.daniel428May 9 at 7:16 PM\nSolid\n\nWould like to see more features. Target practice would be awesome!!!\n\nHelpful | 0", "Shadow_jpFeb 16 at 4:28 PM\nSimple and fun\n\nYes there could be more maps but still a great simple game that makes you move a little.\n\nHelpful | 0", "blackrock2014Mar 15 at 7:08 AM\nGreat game if not for the bugs\n\n\"Private\" Multiplayer join is the most buggy interface I have ever seen. How is this this version of the game in production? It's unbelievably bad. I have tried it on multiple Oculus Quests, same issue. Also, if you are able to get into multiplayer the game will randomly bug out where you can't really see anything and the screen is sort of flashing.\n\nOtherwise, great game and concept. Well worth it if the bugs get sorted out. Otherwise, stay away.\n\nHelpful | 0\nDeveloper ResponseJun 20 at 8:50 AM\n\nGreetings! We are so sorry to hear that you were having trouble with the game. We've recently released an update with some fixes to lobby refresh bug, joining multiplayer games, and more. We would love to know if the changes we have made make the game better for you.", "CBBCCBBCDec 29 at 9:13 AM\nGreat fun but lacks power ups\n\nI really enjoy this game and the online community are great fun to play along with. A slight frustration is the lack of power ups in multiplayer (perhaps its my lack of experience to generate them). Otherwise a really fun game.\n\nHelpful | 0", "CenxilorMar 2 at 11:10 AM\nCool\n\nGood game !\n\nHelpful | 0", "Shayla0211Jan 4 at 12:09 PM\nAddictive\n\nTo start i LOVE this game. I am addicted to it and have gotten my family addicted to it as well. Now problem we have noticed is doing a private one it wont work. Or just joining family in the public places. You have to click on the name, go back, click on the name, go back, and maybe you'll get on. Even for private room its the same thing. Aside from that I LOVE THIS GAME!!\n\nHelpful | 0", "VocusJan 26 at 9:19 PM\nExciting experience for PvP\n\nAs single player it could be boring, but multiplayer is really exciting and you learn from others, this is one of the addicting game I recommend for you all... well except children!!!\n\nHelpful | 0", "dejardi2Jan 18 at 7:49 PM\nDecent\n\nI like this game although it is very difficult and often the arrow dosen't pull back the first time. Still a good game.\n\nHelpful | 0", "EpicboxerFeb 5 at 4:42 AM\nGameplay\n\nIts a great game and I like talking to my friend wildfire in multiplayer and I love how there is no aim assist here :)\n\nHelpful | 1", "KilecJan 17 at 8:02 AM\nAmazing potential!\n\nThe physics and gameplay are fun. Great multiplayer game. Well worth the purchase and is enjoyable for many hours. The game has a lot of potential to be much more than it is now, but for a fun archery game its a win.\n\nHelpful | 0", "JTDahlDec 27 at 9:51 PM\nAmazing potential\n\nIm giving this game five stars because Ive always wanted to feel like Legolas! Multiplayer with friends is one of the best VR experiences out there. Purchase this game and do it now!\n\nDevelopers - please create more! Please please please. I need more! I fear that Ill get too bored with the same maps/spells/Ai soon.\n\nHelpful | 1", "NikkiJ54Jan 16 at 12:27 PM\nIts great\n\nIts a great game did you have to use more skill with. It will be even better when the glitches get fixed.\n\nHelpful | 0", "taylor.framptonDec 3 at 8:18 AM\nSuper fun game\n\nOne of my favorite games. My wife and I almost play this every night with some of our oculus friends. Lots of fun to be able to communicate about the battle.\n\nThinks I would like to see improved to make it 5 star are:\n\n1: More levels. After playing for only three weeks almost every night it would be fun to have more options.\n\n2: Get rid of the the long intervals between waves and just give a kick back for the spells instead of having us wait.\n\n3: Then a few bug fixes of difficulty getting into a particular group and sometimes players cant communicate(in game chat wont randomly work for one player).\n\nHelpful | 2", "Mary1503Jan 19 at 12:28 PM\nCool Game\n\nFunny game, on some positions at a map a little bit boring. But at all it makes fun.\n\nHelpful | 0", "J-D-CJan 10 at 4:19 PM\nBrand new to VR\n\nGreat interactive shooter game. Got bored with single player, but multi player is where its at. Voice chat would be cool if I could figure out how to work it (definitely a user issue). Its been my favorite game so far.\n\nHelpful | 0", "Wolvesbane364Dec 24 at 3:33 PM\nAddictive fun\n\nI like this game, it is very fun. I enjoy this alot. Im only giving 4 stars because the game needs a little more. Either more interactive environments or maybe some goblins or others. Also the gear should be more than just cool looking it needs buffs or stats of its own. The spells are quite excellent and exquisitely rock! Great game overall and I recommend it.\n\nHelpful | 4", "VendurDec 23 at 1:55 PM\nDisconnect Disconnect Disconnect\n\nIts a funny and good game especially with friends BUT almost unplayable, me and my friend have disconnects all the time...\nWe are playing for example 20 waves and then another DISCONNECT I almost fired my Quest against the wall!\nFIX IT PLZ!!!\nBut we have also disconnects at wave 3 or 5 or 9 you can be sure a disconnect is coming!!! :-((\n\nHelpful | 6", "EltremblorJun 2 at 7:05 PM\nTerrible Game\n\nVery laggy and hard to play. I found that my arrow would constantly disappear or just get stuck back on my hand.\n\nHelpful | 0\nDeveloper ResponseJun 20 at 4:55 AM\n\nHello Eltremblor, Thank you so much for trying out our game despite it's sad to hear that you run into some problems. We've released a few updates since your review which might fix the issues that you've experienced. Please let us know if it got any better for you. If the problems still occur contact us at support@wenklystudio.com so we can look into it. Thank you.", "TomHankRulesDec 27 at 10:55 AM\nCross platform play\n\nSo I got the quest thinking I could cross platform and play with my wife who would use the rift and Id use the quest. Lo and behold, I create a game in the rift, my quest cant see the game. I created a game in the quest. Rift cant see it. Bought the game twice on two different accounts and Im still screwed and cant play with my wife. One star for killing my dream of playing this game with my wife for Christmas. Per oculus support, it was the game devs choice to not make it cross platform from quest to rift\n\nHelpful | 5\nDeveloper ResponseJul 16 at 9:25 AM\n\nDear TomHankRules Thank you for your feedback. Currently the crossplay on Oculus Quest & Steam/Oculus Rift, unfortunately, is not supported. We do have plans for the future development of the game and we might implement the crossplay in the future. You might consider getting an Oculus Link cable. It provides the access to Rift games and experiences from a gaming PC on Oculus Quest. Also, please remember about downloading newest updates. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "SaxomophonistSep 12, 2019 at 5:41 AM\nPros, Cons & Ideas\n\nThis game is amazing! That being said, it's not for everybody.\n\nPros:\n-The online co-operative multiplayer is my favourite part, allowing drop-in/drop-out matchmaking\n-Bow mechanics and haptic feedback feel good and intuitive as well as the arrow trajectory\n-Enemy scaling depending on your party size is nice (haven't confirmed this, but I'm pretty sure)\n-PTT as default is great for kids and those with loud background noises\n-Maps are designed well, encouraging teamwork and tactical positioning based on skill sets\n-Spellcasting is added smoothly, with minimal effort needed and fits the fantasy setting nicely\n\nCons:\n- Not all teleport locations are aligned the same by default, resulting in a lot of confused spinning when trying to quickly change vantage points\n- No way to mute/votekick annoying players\n- Arrows are not drawn from a nearby stand or quiver, but are infinitely supplied at your fingertips\n- When upgrading spells, there is no way of knowing how great/minimal the improvement will be beforehand\n- Waves follow fairly predictable patterns, making the appearances of dragons and trolls less exciting/shocking\n\nIdeas:\n- Instead of magic revive arrows, make physically removing axes from your teammate the revive action (would encourage quick movements and also punish slow action against dragon breath/troll smashes)\n- Instead of arrows magically appearing in our hands, have them in large piles at each of the tower positions (more realism and potential for panic under stress)\n- Input votekick options at the end of the match or within first 10 waves maybe\n- Randomize boss enemy appearances more (wastage of high level spells will become riskier)\n- Increase sound distance of running orcs to better make use of spatial awareness in VR\n- Have more teleportation points (a lot of requests for ones on the same level as the orcs)\n- Maybe have a Hint Screen that tells you how to score Gold\n\n\nOverall, still love the game and will be playing it a lot for quite a while, but I'm hoping for even more\n\nHelpful | 60", "88KKDec 15 at 11:46 AM\nLack of contents and boring\n\nThis game has lack of contents and it becomes boring quickly because all you do is to pull your arm, hitting the same monsters again and again. To devs, if you want this game to be fun, at least create different monsters, create more maps, create different weapons that has more attack power. The biggest failure for this game is you cannot aim right.\n\nHelpful | 6\nDeveloper ResponseJul 16 at 9:27 AM\n\nDear 88KK, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, you've mentioned some difficulties with the bow aiming - have you tried the \"Arrow offset\" option from in-game settings?", "Jeffcrou94Jan 29 at 6:28 PM\nOne of my favourites.\n\nThis game is very simple and doesnt take a whole lot of effort. Love that you can upgrade your bow and arrows with magic . Over all great game !\n\nHelpful | 0", "Nuts1040Dec 18 at 11:59 AM\nCrazy multiplayer game !\n\nA very nice shooting game. The evolution of the character gaining XP, the upgrade of spells and the general atmosphere make it a very good game.\nThe multiplayer mode is awesome ! Defending the place with people from all around the world is so fun.\nAs an improvement, you might maybe create new enemies.\nThanks for the job guys !\n\nHelpful | 0", "zero991Feb 2 at 8:23 AM\n\nSuch a fun game worth getting. Definitely can recommend buying this.\n\nHelpful | 0", "soxincincyDec 30 at 9:00 PM\nPoor Adaptation of a great game\n\nI love Elven Assassin as a whole. I frequented a VR arcade before buying a Quest and became an Elven Assassin junkie. I'd generally play all kinds of different games, generally not playing any game more than once or twice... with the exception of Elven Assassin. This one I played almost every trip.\n\nThe game itself is your classic tower defense game where you are defending a village/town/castle from invaders. Each wave gets harder until your town is destroyed. The mechanics are simple and gameplay is straightforward. It is easy to jump in and get sucked in. VR lends itself well to bow games for some reason, and this is a great example of that. Elven Assassin is truly one of the games that made me want a VR headset myself.\n\nNow for the ugly... the tracking on the Quest for this game is horrible. I'm not sure if it is Quest specific or all inside out tracking headsets. You frequently lose your arrow hand and end up having to waste a shot into no mans land, followed by waving your hand in front of you waiting for tracking to pick it back up. Not only is this a time waster in gameplay, but it also really pulls you out of the experience.\n\nI was so excited to get back to being able to play Elven Assassin again. I really was looking forward to a good binge on it. But alas, the tracking on the Quest version is bad enough that it will likely get relegated to a b-list game that I check in on occasionally hoping to see it get fixed.\n\nTLDR: Great game, Quest version has debilitating tracking issues.\n\nHelpful | 0", "GamesfanVRDec 15 at 10:49 AM\nVery Addictive\n\nWell... where to start, I wish you was able to miss the first few waves after it realised that you are a reason shot? However if you did this then you would not get the relevant score etc...\n\nGraphic good and the size of play area need is not too big. Recommended for all ages but you need a good eye to get higher levels.\n\nHelpful | 1", "Coco-VRDec 13 at 3:14 PM\nVery addictive, I keep going back.\n\nThis was my first experience to VR in a VR Cafe, and this was the main reason I bought the Quest. The game doesn't really have a story or single player campaign. U can play single player to get LVLs and gold to buy stuff.\nBut the real fun for this game is playing multiplayer with your friends. The simple mechanics allow people to learn it quickly and the repetitive nature reminds me of the old school Nintendo games like Balloon Fight or Joust... every wave just gets stronger and harder.\nDefinitely my go to when a buddy is online and we want to play a quick game. Even when I'm solo I'll see if I can join someone else's game to get some levels for spells. But if you don't want to play with anyone this isn't the game to load up.\nThe game is also cheap. So easy for ur friends to pick it up. Thanks a bunch, great game! Graphics wise for the Quest, it seems excellent. I played on an HTC Vive Pro a long time ago, and I'm sure if I compared back to back I'd know a difference. But for the Quest, the graphics look just fine to me for the type of game this is. Meaning they are definitely not bad where it affects the \"Nintendo\" game play. The overall experience I felt was the same as I remember on the HTC Vive Pro.\nI would really rate it around a 4.5 game because of the lack of interest in the single player campaigning, but since it doesn't allow me to do that, I rounded up to 5.\n\nHelpful | 2", "keebzMar 8 at 7:58 PM\nAn example of when graphics don't matter\n\nEdit: I have never played a game where it went from 5 stars to 1 star... But here we are. In some update they have completely broken the multi player menu system and are evidently fine with that. You can't join games with your friends without fighting with the menu for 10minutes and restarting over and over. It's pathetically bad and the devs should be ashamed that they pushed this utterly broken mess.\n---------------------\nPervious five star review:\n\nLook, it's true... The graphics in this game suck and I really do hope they improve. But this is a five star game even with crappy graphics. I really wasn't excited about this game but my brother in law talked me into it so we could play it together. The graphics are like a VR version of Morrowind, which is not a compliment. But holy cow does the game work well! The multi-player is FAST and really stable. I can always count on a group game if I make it public. The bow function is perfect, you really feel the bow stretch with very clever haptics and the wave progression is well balanced. This game doesn't rely on flash and graphics, what it is is stable and very addictive. I keep going back to unlock new spells, gear, and level up. The people I have met in random games have been awesome. Don't over look this game based on it's looks. It's worth the $15!\n\nHelpful | 6\nDeveloper ResponseJun 20 at 8:52 AM\n\nHello, keebz! We are so sorry to hear that you were having trouble with the game. We've recently released an update with some fixes to lobby refresh bug, joining multiplayer games, and more. We would love to know if the changes we have made make the game better for you.", "KukulukJan 26 at 7:19 AM\nBad servers\n\nThe multiplayer feature is full of bugs. Players getting disconnected all the time. It's a great game. But the multiplayer options is what makes it fun. Especially during the weekends is unplayable.\n\nHelpful | 0\nDeveloper ResponseJun 20 at 9:09 AM\n\nHey Kukuluk, We are sorry for the inconvenience. We want to let you know that our latest update includes improved Client-Side Networking System & Networking optimization which results in reduced disconnection rates. We would love to know if the changes and improvements we have made make the game better for you.", "Juicebox_TroyApr 23 at 10:46 AM\nEleven Assain\n\nIt is really fun but I feel like they need to add more game modes in it and they need like more weapons and helmets\nOverall it is a really good game\n\nHelpful | 0", "RuneHMFeb 27 at 7:56 AM\nI hate your game\n\nIts the worst game i have ever played\n\nHelpful | 2\nDeveloper ResponseJun 20 at 8:56 AM\n\nHey RuneHM, Thank you so much for trying out our game. We are really sorry that you did not have a good experience with it. We would love to know if there are some things we could add or change to improve the gameplay. If you have any ideas you could share with us, feel free to do that so we can improve in the future.", "BunCrushBunFeb 2 at 11:27 PM\nI bought Oculus only bcause of this game\n\nGo multiplayer right away. Super addictive.\n\nHelpful | 0", "magicpug105Mar 14 at 4:08 PM\nGood but not perfect\n\nIt's a really fun game to play with friends but I was in the same room with a friend and on the same internet and same server but we still couldn't see each other rooms. And please add more maps! We finished all the maps in like a hour\n\nHelpful | 0", "SwooschDec 8 at 2:48 PM\nFun BUT...\n\nGreat game, however, it takes too long sometimes for a wave to start. The waves in the beginning are also too slow-paced after you get good. The game needs something for advanced players as well.\n\nHelpful | 3", "Kickinchicken06Jan 17 at 2:10 PM\n\nGreat game the physics are great and the way the game runs is cool to but I wish that they would add different bows that have certain abilities\n\nHelpful | 0", "BradyhillApr 30 at 9:07 PM\nFun fun game\n\nI had played this game years ago at Comic Con I think. Loved it just as much now. So fun!\n\nHelpful | 1", "xxitsyaboijay37Feb 27 at 1:27 PM\nI FRIGGIN LOVE IT!!!\n\nIts so good i highly recommend\n\nHelpful | 1", "an.lr.pure.evilSep 5, 2019 at 1:30 PM\nLove it\n\nMy first time playing a VR game was at an amusement park fun center a few months ago, and this was the game I played. After my 10 minute session was over, I immediately paid for another session, and when I left the park that night, I knew I wanted a VR headset. I bought the Quest with the hope that this game would come out on it soon, so I couldnt be happier! This game was my entire reason for ever purchasing a VR headset in the first place! I like several other games, but I have a feeling Ill be playing this one nonstop for quite awhile. $15 well spent! And now..........back to killing orcs and dragons!!!!\n\nHelpful | 219", "HolierThanAllMar 19 at 5:31 PM\nSo much fun\n\nGreat game. Good arm workout.\n\nAs many have said before me, single player is basically just practice for the multiplayer modes. PvE is wonderful, PvP.... Not so much. There are only 4 levels, and I still rate this 5 stars, because replayability is so high. If you like tower defense games, just imagine YOU are the defense. When pulling the string back on your bow, it actually feels like you are pulling it back. I do not have an external power pack for my quest, but after playing one full battery cycle on this game, I'm sweating intensely. Lol. Corona quarantine and this game are gonna cause me to lose some weight!\n\nDevelopers.... Make some more levels please!\n\nHelpful | 0", "dlduncanparkerNov 20 at 8:57 AM\nElven assassins review\n\nEnjoy the game, would be nice to have some different characters. COOP play is good. Of course a person could pick the game apart, but all in all I would refer this game to anyone that enjoys this kind of game. I hope the developers improve the graphics, and add more characters in my mind it would definitely be a 5 star game then.\n\nHelpful | 0", "Michelo77Jan 12 at 3:59 PM\nMulti players pretty cool\n\nI just think its a fun interactive game. I like the interaction with the people. And I like the different boards you can play on.\n\nHelpful | 0", "Hoshi_WillApr 14 at 6:18 PM\n\nGreat game but could use more game modes like Mabey pvp\n\nHelpful | 0", "GOD_MODEApr 19 at 7:15 AM\n\nNice ordinary casual game.\n\nHelpful | 0", "Skyknight101Dec 13 at 3:48 AM\n\nIts good, multiplayer is really the only version to play. While it is fun mowing down enemies, there definitely should be some more variety in them. In addition most of what you buy in weaponry and armor makes no difference. The gear should make a difference to help give the game a bit more of a progression feel.\n\nStill fun once in a while when you have some time to burn and get in a group thats fun to chat with.\n\nHelpful | 2", "sarikatsDec 29 at 3:49 PM\nYes!!!!! Great Game\n\nVery cool game. Standing in a castle, shooting dragons, tetradactyls and Orgres!!!\n\nThis game is great to show the whole family.\n\nLove that I can practice archery daily\n\nHelpful | 2", "richferguson1Jan 19 at 1:50 PM\nGreat game!\n\nThis game was so awesome me and my family had a great time playing this together!\n\nHelpful | 0", "AshtonOculus12Jan 12 at 5:30 AM\nInteresting\n\nThis game AWESOME, i am a young Boy and ive been playing superhotvr often, this brings a whole new wave to my mind.\n\nHelpful | 0", "DanielReyNov 25 at 1:16 PM\nFun but has bugs\n\nThis is great but i have to reopen it because during the battle it kicks out and after joining i have no points. Its frustraiting when you have the highest score and even more when it happens during wave... otherwise id give 5stars because game is cheap and provides a lot of fun.\n\nHelpful | 3", "jlstaffo72Jan 11 at 5:06 PM\nUpdate 1/11/2020 - Join bug still exists\n\nI won't rewrite what Doctori said in his review, but multiplayer is not working for quest. Also tried for awhile, like Doctori, and could not join a game created by my better half. Hopefully, the quest sales over the holiday will get them to fix it.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:19 AM\n\nDear jlstaffo72, Thank you for your feedback. Please check out the latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Weve also improved networking, lobby and servers list (joining, refreshing). Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "MikekelcDec 11 at 8:55 PM\nEnjoyable\n\nI hope they come up with some training sites, ability to see your score during the match and the ability to save your progress. 2nd favorite game on VR so far.\n\nHelpful | 0", "Blossom911Apr 3 at 8:49 PM\n^\n\nNeeds the left hand feature. So you can switch sides for a more even work out.\n\nHelpful | 0", "D3AD5H0T420Jan 22 at 12:51 PM\nWish Ir had no star\n\nThis game sucks and I really dont like it one bit its just so basic and repetitive I cant justify spending that money on it really a rubbish game sorry to the dev team I really am but this is a load of crap\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:13 AM\n\nDear D3AD5SH0T420, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Cheers, EA Team", "jesus.andiongarciaJan 21 at 3:47 PM\nI love it\n\nI can spend hours playing this game! Love it\n\nHelpful | 0", "kyle.gouletNov 8 at 9:40 PM\nPVP Messed up Controls\n\nThe game is absolutely amazing... But today my wife and I tried PVP for the first time. As soon as we entered, it messed up the aim for both of us. The wonky aim then kept on through single and mutliplayer games. Nothing we have tried has fixed it so far: exiting Eleven Assassin and going back or turning the OculusQuest off and back on. Now the game is messed up for us. I guess we will both have to try uninstalling and reinstalling. But we'll lose out gold.\n\nHelpful | 0", "svyatoslav.ageevJan 5 at 9:58 PM\nGreat game\n\nThat is really awesome!\nPhysical exercises, endurance and agility. Strongly recommend for everyone.\n\nHelpful | 1", "Drb.danielJan 31 at 11:27 PM\nMust have\n\nSo cool, shooting arrows , casting spells , VR perfect, tracking great , multiplayer is a blast!\nHIGHLY RECOMMENDED!!!!\n\nHelpful | 0", "padrino839Jan 5 at 4:46 PM\nCool game!\n\nFunny entertainment with this game, would be amazing a future update moving around with a sword too\n\nHelpful | 0", "talkersmallpalJan 16 at 6:36 PM\nGood game, but unstable\n\nThe game is breaking and lagging often, completely freezing the Quest. While the gameplay is fun and entertaining, I cannot enjoy it fully due to that.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:14 AM\n\nDear talkersmallpal, Please, update Elven Assassin (as well as Oculus Quest software) to the latest version and let us know if any of your problems are still present. If so, contact us on support@wenklystudio.com", "NetHunterJan 17 at 6:37 AM\nThe game is fun, but...\n\nYou get constant disconnects when you play online, which is basically the most fun part of all.\n\nHelpful | 1", "kem423Sep 17, 2019 at 8:28 PM\nGreat multiplayer fun\n\nI am giving this four stars because it is a great tower defense game especially in multiplayer. I would give five stars if there was a little more variety in the enemies.\n\nGetting a long distance aerial shot or headshot is really cool. I got Elven Assassin the day it came out. I have taken it to work to use on my lunch break and had a lot of fun trying to level up and unlock new spells. Another really good thing is that you dont need a lot of space to play this.\nI recommend this game to everyone. Especially the multiplayer. It is very fun to take down massive groups of enemies with a team. It felt like the scene in LOTR Return of the King when Legolas and Gimli were keeping track of kills. It was great to keep seeing my color pop up above the enemies I was taking down. Especially from way across the field of battle.\n\nMAKE SURE YOU DONT RESET YOUR SKILL POINTS UNLESS YOU ARE ABSOLUTELY CERTAIN YOU KNOW WHAT YOU WANT TO DO.\nYou only get one reset for the entire game and I wasted mine at the beginning and didnt realize there is only one reset.\nDevelopers please add more resets or allow buying resets with gold or moving skill points with gold. Anything would be better than just one reset. That was really frustrating.\n\nI still love this game just wish I could rearrange my skill points.\nMore variety in enemies and ability to change/move skill points and it would definitely be a five star rating.\n\nHelpful | 30", "debksurMay 8 at 2:23 PM\nok but\n\nSpent all my time getting gold to buy bows & helmets & now noticed makes no difference what items you use.\n\nHelpful | 1\nDeveloper ResponseJun 20 at 8:41 AM\n\nHey debksur! Thanks for sharing your thoughts. For now, the equipment that you can buy with in-game gold has only cosmetic use. We'll definitely think about adding more purpose for in-game gold and some more benefits for items.", "danthemanukApr 17 at 12:12 PM\nNeeds Leader board Support\n\nIt's a great game, but a wave based shooter without any type of leaderboards reduces the longtivity of the single player game\n\nHelpful | 0", "Paranuts76Dec 1 at 7:48 AM\nGreat game at a great price !\n\nGreat game! Of course there are some side effects like burning shoulders. EXERCISE is a side effect of many vr games... I hate exercise, but will keep playing \n\n\nCan you please make another game like this but with better weapons? Like guns, missiles, air strikes and bombs. Bow and arrows are great but gets very repetitive.\n\nHelpful | 1", "DeepStateAliensDec 26 at 9:44 PM\nFun little archery sim\n\nFeels arcade-y, not in a bad way. Pretty simple game, good fun, but dont expect a story or fancy graphics. Simple bow shooting fun\n\nHelpful | 0", "dvdnzlOct 22 at 5:11 AM\nAwesome game but its unfinished\n\nThis is a half baked masterpiece, the developers were on to a #1 VR of all time but then just gave up on it at the 65% baked mark.\n\nI return to this game and play it more than any other game, and I get a mild workout from playing it too...\n\nBut my gawd is it half baked, I sincerely hope the developers update it with the 35% of effort it needs to easily rise to the top...\n\n3 stars for it really just being a beta\n\nHelpful | 7", "Black_NapalmJan 19 at 2:16 AM\nJOLLY COOPERATION!\n\nSHINES in Co-Op!\n\nHelpful | 0", "greenfutureNov 11 at 6:32 PM\nFavourite co-op game\n\nReally enjoy playing this with my buddies for hours, just like real bow-shooting and so much fun killing hordes of orcs!( and other creatures who want to attack our beautifull village or castle )\n\nOnly thing is they need to do a little bug-fixing, there is sometimes people get dropped from the game, they can easily reconnect, it sucks when it happens though!\n\nAlso I wish they made more out of the game, possibly they are making elven assasin 2, I hope with lots of more fun things to do!\n\nHelpful | 5", "slayneApr 10 at 7:15 AM\nSuper fun, specially in coop\n\nI love Orc must die on PC and I had the same fun in elven. Maybe repetitive but worth the 15$\n\nHelpful | 0", "ReincarnatedUnicornDec 22 at 6:20 PM\nAwesome VR Game\n\nElven Assassin is an amazing game. I play every day and this one game has made my purchase of a quest worthwhile. I highly recommend the game.\n\nHelpful | 0", "UDontHaveMyNameNov 25 at 6:03 PM\nVery solid effort!\n\nWhile this game seems simple and has a few flaws (mainly is repetitive) it is SO much fun to play with 3 other friends in tower defense. This is a very fun title.\n\nHelpful | 0", "BaconBotNov 6 at 10:24 PM\nIt's ok\n\nIt's ok still waiting for a better archery game the concept and game balancer done well but the over all game needs some polishing this isn't with just the quest version rift as well other than that it's a fun game and worth the money till a better game comes out\n\nHelpful | 0", "LordKnudsenJan 3 at 5:10 PM\nLol the death match mode\n\nTakes a little to get used to but military-player is pretty fun\n\nHelpful | 0", "KKTK13Jan 9 at 4:20 PM\nMy favorite!\n\nIm an archer and I love it!\n\nHelpful | 0", "denniznDec 27 at 9:16 AM\nGreat game\n\nAmazing game and VR experience. The shoots are very precise. My favourite is a multiplayer option.\n\nHelpful | 0", "HalldorHrafnDec 12 at 6:57 PM\nGreat entertainment!!!\n\nFor 14bucks. Totally worth it, I've been shooting arrows for probably 4hrs. Gotta go sleep but will dream me with a bow shooting goblins and dodging axes. Great game.\n\nHelpful | 0", "DoctoriSep 16, 2019 at 4:41 PM\nMultiplayer\n\nUpdate 9/16/2019 - multiplayer join bug still occurs. I cannot get a single reply from companies email contact. I emailed company and joined discord channel and let them know! It's been week(s) no response. Please click helpful guys on this review so it gets noticed. Please.. I love the game and it needs fixed on the quest.\n\nHey all, let me start I love the game. I have on steam. My uncle and I tried multiplayer for 2 hours. Its sooooo buggy. Cannot join games if there are more than one lobby full of games going, you click join and it brings you to page 2 of the server list, then you cannot get back to page 1 and see the game, it goes on and on. Its impossible to join a server of your choice if there is 2+ full rooms of games going. The join click bounces you around to server browser pages 1/1...\n\nHelpful | 115\nDeveloper ResponseJul 16 at 9:36 AM\n\nDear Doctori, Thank you for your feedback. Please check out latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Weve also improved networking, lobby and servers list (joining, refreshing, and other). Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "paszekjOct 25 at 9:45 PM\nFun game but buggy\n\nThis game is a lot of fun and I find myself going back to it more than any other Oculus Quest game. That being said, the gameplay is quite buggy and will commonly kick you out of the game. Very frustrating. At this point, I cant recommend it until gameplay is improved. I hope the developers will work on stabilizing the program as it is a lot of\nfun, but the frustration of the game outweighs the upside.\n\nHelpful | 5", "DRDILLISSep 5, 2019 at 11:12 AM\nRuns Great & Plays Better!\n\nPVP is great & Single Player is a lot of fun. A real arm workout after an hour or so (on just the dominant arm) the game looks great graphically and has great handling. Hoping they add more maps to PvP as there is only one of them (marks itself in beta). Hands down the best crossbow game for the quest so far that utilizes the ability to spin around and duck. I totally reccomend this game.\n\nTo the devs; is there a lot planned for the quest going forward with this game in terms of adding more maps and sounds?\n\nHelpful | 39", "SamaritanManJan 1 at 10:10 AM\nMagic game!\n\nThis game is a must have for each Quest owner.\nReally magic game!\n\nHelpful | 0", "AIMEZ7Nov 23 at 3:43 PM\nMoney and Magic Skills, Reporting Others\n\nThe multiplayer makes this game! Love the socialization even with those who dont speak English. Body language is international and the thumbs up is too!\n\nQuestion? What are we supposed to do with the gold collected after all bows, helmets, and combat combos are bought? As well as skill points for magic...\nSolution: My idea is to be able to allocate some of our gold and points to new and upcoming players as we see fit.\n\nA Problem: I am a female and have heard reports tonight 10/20/19 (from male friends) of a new player being disrespectful towards another female player...and theres not a lot of us... I know we can report them, BUT how do we record it during a game for proof? It has been suggested by Saxophonmonist that we should be able to have the ability to kick someone out of our map and then repot them to you with out ruining our experience.\n\nOther issues that you have already heard about (that are still going on) are getting kicked out of the game and having trouble at the main menu returning or joining a game.\n\nThank you in advance,\nAIMEZ7\n\nUpdate:\nI have noticed that we are now able to record on the updates for the quest and I think it is Great!! I havent heard of any other problems with the real internet Trolls but now this can be a deterrent..\n\nHelpful | 2", "FiF-TDec 8 at 12:31 AM\nWay too many bugs\n\nGreat idea for a game but not the best implementation. The game is full of bugs.\n\nHelpful | 4", "MightyQuinnJNov 7 at 11:10 PM\nSo much fun and a great workout!!\n\nTheres something so satisfying about being able to shoot down dragons with a bow & arrow!! But whats even better is playing with a friend, covering each other and working as a team to survive as long as possible!\nI also love that you can earn weapon upgrades to allow you to advance further! So much fun!\nAlso after a couple rounds my arms were really starting to burn!\n\nHelpful | 3", "L0g1-kOct 21 at 8:00 PM\nAwesome! But with a catch...\n\nBow and arrow wave shooter with some enemy variety and spells! Sounds simple and boring, right? But NO! The way the bow shoots, the haptics, the sound of the arrow hitting is really fun and responsive. The enemy sizes can vary at some point it requires a strategy to hold them all without getting an axe on the face.\nCoop multiplayer really fun!\nPvP multiplayer is insanely fun, you can hide and do crazy stuff using your whole real body!\n\nOk, now the problems. Bugs! When the maps starts to get crowded, around wave 40, the enemies seems to lose their pathway and start to do unexpected movements and big in some unreachable area and the end, you have to quit. This happens in every session I play... It happened to me at wave 99...\n\nPvP is still in beta, but a bug that affects a lot is that the arrow hand is positioned differently from the campaign mode, and it takes out a lot of the good feeling of shooting the bow in this gane.\n\nRecommend it? OF COURSE! There are bugs but this game is FUN!\n\nHelpful | 1", "massanuSep 26, 2019 at 11:29 AM\nUsed to be my favorite game\n\nUsed to be my favorite game but the epic instability especially in multiplayer has reached an unplayable level. Everybody is complaining about it online or even during the games for weeks but seems like nothing is done to fix it\n\nEither the devs are gonna fix that or you are absolutely wasting a game that could be one of the very best\n\nIf you fix those issues I will update my review, in the meantime this game is a brick\n\nHelpful | 29\nDeveloper ResponseJul 16 at 9:34 AM\n\nDear massanu, Thank you for your feedback. Please check out latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Weve also improved networking, lobby and servers list (joining, refreshing, and other). Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "Nbomb53Jan 3 at 11:32 AM\nBest game ever\n\nYou really need to try this game it is so fun\n\nHelpful | 0", "JB104Dec 27 at 2:57 PM\nGreat!\n\nGreat game, made even better by multi player. Definitely got my recommendation.\n\nHelpful | 0", "HogansBreathDec 25 at 6:46 AM\nGood start\n\nFun archery game, especially pvp. Needs more pvp levels. Horde mode starts very slow and takes forever to get to the fun part.\n\nHelpful | 1", "ztrandNov 2 at 10:34 AM\nAwesome multiplayer\n\nMultiplayer is amazing! the game is incredibly fun with one or two friends.\n\nA few requests to improve the game and make it 5 stars, would be:\n1) allow players to jump into later waves. Always starting at wave 1 is a bit of a chore once you get good at it.\n2) make the equipment you can buy do more damage or even special spells/powers. Currently they seem only cosmetic.\n\nHelpful | 5", "VRLoungeAlamSuteraNov 26 at 8:53 AM\nNice game\n\nEntertaining, since a bit monoton, it's gonna be better of the various weapon or skill can be used during mutiplayer mode\n\nHelpful | 0", "drmrdOct 20 at 5:09 AM\nLots of fun\n\nMy brother and I really enjoy this game and play it more than anything else. There is a bug we both experience in Quest where we cannot talk to people in game. Even if we are not in a party, pressing the speak button doesnt let audio through (although the icon shows up on screen that we can talk). There needs to be more PvP maps too\n\nHelpful | 0", "adam.carey.5891Oct 19 at 6:41 PM\nTerrible Title Font, Fun Multiplayer\n\nDont let the terrible font, title or screenshots fool you. Eleven Assassin is seriously addictive and the archery feels dead on (full disclosure, I enjoy archery in the real world too).\n\nIve had some very enjoyable multiplayer games with Assassin. The gameplay is repetitive but Im never bored. Its fun to keep improving your archery skills and become deadly to the enemy.\n\nThere have been a few times I get kicked out of room which is annoying, but its relatively easy to pop back in. This is the only title Ive played where this happens.\n\nIf you want to get your LOTR on, this game is for you.\n\nHelpful | 0", "AKOttoOct 8 at 12:44 PM\n\nWe purchased the Oculus after being introduced to it by our good friends. The first time we used it- we knew we wanted one. Upon buying our own- I was looking through all of the games and bought this one because it looked like we would enjoy it- I played it and was instantly won over- I told my husband about it and he started playing- I had a hard time getting my turn! He loves this game- he plays for over an hour every time he gets on it, and comes away looking like he has had a hard workout! We eventually purchased a second Oculus so we could play together! Its awesome! Now, heres why I couldnt give it 5 stars..... even before we bought the second one- we would experience strange things like being kicked out of the game multiple times during a game- our bow hand would be away from our body- or our arrows wouldnt notch correctly- sometimes the orcs would run backwards-or turn around and run the other way, or the little dragons would fall to the ground and just flop around for a while instead of disintegrating like they would normally . Mostly- the function of the bow and arrows are all over the place- I could aim exactly the same way four times and the arrows would go in 4 different directions- of course I do accept that that could be some of my  operator error- but after reaching level 48 on our first game and level 18 on our 2nd one- I feel that I should be a much better shot by now- but the 4 stars I gave are solid! Even with the issues we have had- we still enjoy being able to play this game together. AKOtto\n\nHelpful | 6", "dylan.amadeckDec 9 at 2:56 PM\nSolid but nothing special\n\nIt ia a fun game, but it is also sorta one note\n\nHelpful | 0", "gemini1976Dec 21 at 11:07 PM\nBoring\n\nLooked ok played ok mechanics worked good but gameplay was boring. Not like a tower defense i was expecting. Not enough change between levels and enemies.\n\nHelpful | 2\nDeveloper ResponseJul 16 at 9:26 AM\n\nDear gemini1976, Thank you for your feedback. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. By the way, have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "pollo2586Jan 5 at 6:30 PM\n\nGood for the price aiming is lil tricky\n\nHelpful | 0", "Guidance777Dec 26 at 7:17 PM\nSuper fun! A+++\n\nThey need to keep developing this great game! Plz!\n\nHelpful | 0", "tht_guy_davidJan 21 at 6:51 PM\naddiction!\n\ni have spent so many hours on this game!!! trying to level up and get coins for gears. Very good co-op game with others!\n\nHelpful | 1", "oysterassassinJan 18 at 3:08 AM\nSimplistic, good for young kids\n\nVery simplistic graphics. Simplistic game. Shoot the Orcs. Done. This will end up at $4.99, then free, then gone.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:13 AM\n\nDear oysterassassin, Thank you for your feedback. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. By the way, have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "BobbyManningJan 4 at 10:14 AM\n\nFun\n\nHelpful | 1", "verdemanOct 2 at 5:28 PM\nReally fun replayable game\n\nBUT day one Ive been experiencing a lot of app crashes for this game. Get this app more stable and it will be 5 stars!\n\nUpdate: I restarted the Oculus and this game still crashed 2 times within 10-15 minutes. Dropping to 3 stars until fixed. This game has such amazing potential. Just fix the crashing!\n\nHelpful | 7", "eoinokJan 18 at 4:19 AM\nDevs, please read this!\n\nUpdated after many hours of play:\nI've changed my rating from 3 to 5 stars because I've gotten more than enough enjoyable play out of this game to make it good value. Overall excellent experience.\n\n***However***\nIn my opinion there is one major flaw keeping this game from reaching its potential:\nIt is much, MUCH too easy. I mean, it's about 5% as challenging as it should be. Don't get me wrong, hitting moving targets at a distance is not easy. If you're like me, you'll miss a lot. The problem is that it hardly matters whether you hit or miss. You have infinite arrows, magical spells, and plenty of time to miss and miss and miss again and still survive for round after round, into the 20s, 30s, 40s etc. If you're playing online with a full team, you can easily see 70 rounds pass before things start to get at all challenging. And that's even if you and your teammates aren't playing particularly well. A team of *good* players might as well be invincible. Add to this that some people have started using a crazy rapid-fire technique that turns their bows into gatling guns and the whole experience seems less like a game and more like an *experience*, with no challenge or stakes. It's still fun to shoot a bow at orcs in VR, but surviving rounds doesn't feel like any kind of achievement. If getting to, say, round 20 was a real challenge, I think players would be a lot more engaged and the action would be more satisfying.\n\nOriginal review: Everything seems great except for tracking. The Quest has known limitations with near-headset controller tracking so some issues are to be expected. However, the problem in this case doesn't seem to be in the hardware. The tracking is perfect until you nock an arrow, at which point your drawing hand suddenly leaps upward about 10 centimeters and the wrist angles upward sharply so it looks as though your arm is coming from the top of your head rather than your shoulder. If you look out under your headset and compare real world hand position to in game position, before and after nocking, you'll see this very clearly. The game is still playable, but the sudden shift in tracking and the unnatural appearance it presents are very immersion breaking.\n\nHelpful | 14\nDeveloper ResponseSep 5, 2019 at 7:03 PM\n\nHi, Thank you for your feedback and for describing your issue precisely. We'll definitely look into this.", "maggilillyNov 6 at 8:22 AM\nA lot of fun, but buggy\n\nI bought this game with friends because it was one of the few co-op games available at the time. We have enjoyed playing the game, however there are some significant bugs that produce a problem with game play.\n\n1. Some players have experienced a Vertigo feeling that is only resolved by logging g out of the game and coming back.\n\n2. Sometimes those players cannot rejoin the group after they log out and try to come back in again.\n\n3. Sometimes there is a weapons failure in that the bow and arrow do not align up in any way that a human could actually hold them. And either the don't fire at all, or they fire wonky. I have to shake my controllers to resolve this. Thankfully this seems to happen around the time we have all played a long game and are ready to quit.\n\nI'm hoping that updates and upgrades to the map will continue our enjoyment of the game. Eventually it will get stale, elsewise.\n\nHelpful | 3", "nils.andrae.7Oct 20 at 12:09 PM\nFantastic fun Co-Op with friends!\n\nThis quite simple game is so much better when played in Co-Op with friends. A bit buggy at login and some crashes but manageable.\nWith some more content and this could be a top game for me.\nHad problems sharing screen to my phone for others to watch.\n\nHelpful | 1", "KayveenOct 12 at 10:37 AM\n\nThis game is awesome and is definitively worth its price.\nI would love to see new content (spells, maps, monsters, equipment, ...)\n\nThe only problem I have is that it gets too easy at some point. I'm lvl 90+ and have reached wave 156 so far.\nWhen you start a new game, you need to wait at least 80 waves before having some challenge, and that takes more than an hour...\n\nI had a glitch today that started two waves (100+) simultaneously. So two trolls, twice the amount of orcs and 2 bloody dragons!\nThis 'super' wave was so great it made me think, you should be able to start the next wave whenever you want without having to wait for the current one to end.\nIt could also help skipping the boring first waves by making them simultaneous.\n(I really hope a dev will read this, I believe it shouldn't be too hard to implement)\n\nAlso, I don't know what to do with all my gold since I already bought everything available :/\n\nHelpful | 10", "sabremanNov 17 at 11:45 AM\nKeeps crashing\n\nAbsolutely love the game but it keeps crashing around wave 15. Also needs more explanation about the different bows, I upgraded but seems the same except for the look. I expected more damage :/\n\nHelpful | 2", "juanfdezdcDec 31 at 1:11 AM\nVery repetitive\n\nVery repetitive game. My arm hurts of doing the same movement over and over again\n\nHelpful | 2\nDeveloper ResponseJul 16 at 9:21 AM\n\nDear juanfdezdc, Thank you for your feedback. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. By the way, have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "gamrgrubNov 28 at 11:42 AM\n4 star could be 5\n\nBeing owner of apex construct a bow game\n\nHelpful | 0", "Ast2TheRegionalMngrOct 29 at 8:31 PM\nFun Game\n\nThis is a fun game that can be played over and over again. I love that it's multiplayer. I am enjoying playing with my friends and others online. I love the spells and the bows you can buy from the shop. It does get a bit repetitive with endless waives of orcs. I wish there was some closure after x number of waives. As far as I have experienced, the waives never stop and eventually the village will be overtaken by orcs. It would be more satisfying to experience some type of level up after successfully saving the village from 20 waives of attacks. I will keep playing and advancing so I can upgrade my bow and buy new spells.\n\nHelpful | 1", "muddywaterzzzNov 7 at 7:45 AM\nNice workout\n\nGood graphics, co op mode is fun. Your legs and arms will get a workout from shooting and ducking!\n\nHelpful | 2", "Nexus_008Oct 5 at 4:11 AM\nGood for VR introduction\n\nThis game is great and quite simple. It may really be played by everyone. However, it would be nice to have more maps, more diversity in term of gameplay. The mechanic is so simple that it quickly becomes repetitive. But it is still a nice game for the price.\n\nHelpful | 2", "ShubugOct 30 at 11:25 AM\n\nLove the game it really shines in coop. Only issue is the lack of cross platform support. As a result there are often not in players around.\n\nHelpful | 0", "BigfisherringOct 2 at 9:26 AM\nGood price/value\n\nGood entertainment at $15. Lacks long term appeal as there is no character advancement beyond cosmetics. Disappointed that the bow/armor upgrades provide no increase in character power. But again at $15 Ive got at least 20 hours worth of entertainment. 4/5\n\nHelpful | 2", "SimonBullockOct 22 at 9:16 AM\nBrilliant VR game\n\nPlayed on the Oculus rift via PC at an escape room event in Aylesbury. Played mutliplayer. Was great fun. I brought the game as soon as it was out for the Quest this year. Excellent mutliplayer but just as good playing on your own. Very comfortable to play for long periods. The archery mechanics is very good coming from someone who does archery for real.\n\nHelpful | 0", "superhappyalexSep 18, 2019 at 7:03 PM\nVery fun, but multiplayer setup is buggy\n\nElven Assassin is tons of fun, especially when playing with other. Unfortunately, getting into games with your friends is currently extremely buggy.\n\nWhen you try to join a game, Eleven Assassin often takes you to *another* game to join. If you manage to get into the right one, entering a private room passcode usually kicks you back to the lobby, which shows an incorrect listing of current games. You have to leave the lobby, re-enter, try to click you game, try to enter your password, and repeat ten or twenty times until its successful.\n\nBut once you're in, it's tons of fun. Hopefully, the developers will fix this soon.\n\nHelpful | 5", "kalindejanDec 28 at 4:40 AM\nNice, multiplayer is fun\n\nMultiplayer is fun if meet nice people\n\nHelpful | 2", "diomarkSep 5, 2019 at 4:37 PM\nSweet game\n\nI thought single player was fun.. then I tried Co-op multiplayer.. wow.. having 4 people in the same playing field against the baddies is another experience..\n\nI do suggest making your voice always-on if you're playing multiplayer though. it's too hard to hit the button for the mic in the middle of the action.\n\nI highly recommend this game. good job devs.\n\nAddressing someone else's complaing that the graphics weren't good..they're fine.\n\nHelpful | 7", "drinfoOct 25 at 7:08 PM\nReason I got into VR\n\nGreat game showed me what VR could do. Multiplayer is the only way to play. Would be nice to be able to skip waves or have them rest faster.\n\nHelpful | 1", "steve.hulowskiSep 10, 2019 at 9:15 PM\n\nAbsolutely loving this. Fun. Rewards practice. Probably my favorite title so far.\n\nIt's a bonus that's a bit of a workout when surviving to more chaotic levels. Fun fact: I switch bow hands to even out this workout.\n\nHopes for Updates:\n- Reward head shots even more. Successful markmanship deserves greater reward.\n- Profiles please. I want to play this with my family. I can't afford two quests, and want my progress to be my progress.\n- More game modes. Targets, dragons only, balloons, ect. l\nLocals throw fruit for you to shoot mid air.\n- Moonlit night mode a fun ambience changer\n- More Maps because more of a good thing is always good!\n\nHelpful | 5", "john.hunt.10420321Oct 23 at 8:07 AM\nGood game\n\nThis is a good solid wave shooter, it is intuitive, but not easy. The constant arrow firing weighs heavy on the arms after a while so Im playing it occasionally\n\nHelpful | 0", "aaron.sommers.1253Sep 5, 2019 at 10:09 AM\nElven Assassin\n\nOh man so happy today. Elven Assassin is my game, bow shooting with RPG elements. This game is so fun, played on rift but this is the only way to go. The multilayer is also so much fun. Ok guys Elven Assassin has arrived let's get busy :)\n\nHelpful | 11", "GitGutOrRektSep 27, 2019 at 12:14 PM\nGood game, have room for improvement\n\nI was waiting for such game for some time, a bow game, I tried it for a bit , seems alright , but as others said , hand with arrow is off, appears above the actual hand in real life, also teleportation is confusing as hell, at first i was pressing all the buttons , hoping for some kind of \"beam\" appear that will teleport me to new location, but now buttons are actually mapped for anything, and then i missed my arrow and it went into blue field ...wow.. what a surprise the result was...\nMy favourite VR game is \"bowmen\" part of Valve's \"The Lab\" , simple graphics , high contrast between background and bad guys, easy and hooking gameplay, I suggest devs listen to John Carmack speech at OC6, keep it simple guys, maybe create a second game with super simple visuals like bowmen in The lab? :) Most games I play are super simple visually and give best experience. Hope you improve the game and wish you best of luck.\n\nHelpful | 1", "ShrewminatorSep 13, 2019 at 11:26 AM\nAwesome with multiplayer!\n\nThe games mechanics are a little rough around the edges (bow physics) but this game is FUN.\n\nPlaying with 4 people and utilizing magic to get you out of a tough spot is so satisfying.\n\nI was level 19 but after replacing my broken oculus I now cant sync with the cloud so Im back to being level 10\n\nAll in all an awesome game, but I do hope for upgrades now mechanics. Mainly the draw/tracking on the positioning of the bow.\n\nHelpful | 6", "bobby.lukicDec 28 at 10:55 PM\n\nGlitchy for me. How do return this? Not what I was expecting at all.\n\nHelpful | 2\nDeveloper ResponseJul 16 at 9:22 AM\n\nDear bobby.lukic, Thank you for your comment despite it's sad to hear that. Please, check out the latest update and let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "bobby.rohrDec 4 at 7:29 AM\n\nLots of fun, just need more stands to fight from\n\nHelpful | 0", "Kinetic87Sep 17, 2019 at 6:57 PM\nThis is a good archery game\n\nMy first VR archery experience was longbow on the HTC Vive. I love that game, the archery experience seems very real. The glass barbarians with their silly comments and how they exploded when you hit one was hilarious. That being said, on my Oculus quest unfortunately Longbow isn't available. So looking for an archery games I was really happy when Elven Assassin became available. The archery experience seems very realistic. The limited number of scenarios is kind of disappointing, however it is a lot of fun and really good exercise for your shoulders. I've enjoyed it a lot in solo play, and I look forward to giving it a shot in multiplayer mode. The orcs and dragons and Giants are good opponents and the game of course gets progressively harder as you goes to successive waves of enemies. You really have to start moving fast and shooting as accurately as possible as you get above waves 16 or 17. All in all not quite the great fun experience of Longbow but still a very very good archery game. And I think it's definitely worth the modest $15 price. I've already played it for at least 8 to 10 hours hours and every evening still I go back looking forward to another session. Those long-range headshots are a blast!\n\nHelpful | 3", "shreder856Sep 8, 2019 at 2:02 PM\nReally fun archer game\n\nIf you like tower defence games you will love this game. Only complaint is that sometimes pulling back the bow feels a little higher than where my arms are at in person. Other than that maybe add more maps (especially for pvp) different spells elements like lightning, or water, and storms as you progress further in waves like thunderstorms and rain.\n\nHelpful | 2", "GanthanorOct 25 at 12:01 PM\nAwesome\n\nGreat game! This game is my wife and I's first VR game. You can feel how the bow and arrow work together to aim at your target. After a few shots you can get those orcs from across the battlefield! My wife and I play this regularly together in co-op mode. Fun and challenging with no motion sickness.\n\nHelpful | 1", "YairCOct 1 at 8:07 AM\nExcellent game!\n\nThe game is very well made and also very immersive. Minimal amount of motion sickness and high level of accuracy and fun :)\nMultiplayer is definetly the best mode in this game, although it does kick you out of rooms sometimes and then you lose your score.\n\nHelpful | 0", "bbknickersOct 5 at 6:51 PM\nKeeps Disconnecting - Unplayable\n\nI wanted to love this game, but it disconnects while playing multiplayer\n(which is fun while it works). Sometimes within seconds, sometimes within minutes, but it always boots me out. I gave the developers time to fix this issue (they said they were aware of it and working on it), and really didnt want to leave a negative review here, but I cant play the game. If the game gets fixed, I will alter my review accordingly. Check the Oculus Quest subreddit; I'm not the only one with this issue.\n\nSecondly, the on the buggy multiplayer game select menu, when you click on an available game, it often takes you to a new page of the menu with a completely different game, or it wont let you join. This makes it hard to find the game you just got disconnected from.\n\nHelpful | 8\nDeveloper ResponseJul 16 at 9:31 AM\n\nDear bbknickers, Thank you for your feedback. Please check out latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "EdG10Oct 6 at 5:57 PM\nMore, please ....\n\nMany hours into this, Im still working my way up the levels. Im not sure what will happen when many users are at higher levels, and have gained enough power to destroy level after level with ease.. Looking forward to some shift in the power balance. ?? As it is, though, the game is fairly addictive. As We are using it on Wi-Fi connected devices, it would be nice also if you could reconnect with your game when the Wi-Fi breaks down temporarily. (When that happens now, you lose all the points youve earned in a communal game.)  anyway, trying not to play too much. Hard to avoid wanting to play this one!\n\nHelpful | 2", "corgiwizardMar 14 at 4:08 PM\n\nIts good\n\nHelpful | 0", "jaumemussons79Oct 20 at 1:40 AM\nCool game but...\n\nThe game idea is really cool, and it is fun to play. BUT:\n\n1. Sound is TERRIBLE. We all know that quest graphics are very limited, so it is important to compensate it with the most powerful sound effects possible, and this game sound is absolutely \"cheap\"\n\n2. Enemy animations are really bad\n\n3. There's not much game variety. Every map seems the same after you play one or two.\n\nIn fact, the only thing that saves this game is VR. Playing this with the quest is really fun, but it is all because VR is fun. Grafics are average, few types of enemies that act and move all the same, and the sound effects are terrible.\n\nHelpful | 0", "Doom67Sep 6, 2019 at 10:54 AM\nCoins\n\nI really love the gam mechanics and the archery is spot on but I think that you could have maid the process of collecting coins a little better. As far as I know the only way to collect coins is in the Single player mode. And the most coins I have collected from my best run is 33 coins. I think that you shield at least double the amount that you collect per round. Please take this into consideration.\n\nHelpful | 6", "Blackhole777Oct 4 at 5:30 PM\nGrind\n\nI really like the archery in the game. But you will need to grind to get the good spells. I sneak off a work and play two games a night. Don't think I would have the patience to play this much at home.\n\nHelpful | 1", "CormactheKidSep 5, 2019 at 12:42 PM\nGood for price\n\nI'm a huge fan of archery games. For the price, this game is great! But...\n1) graphics aren't that good, and there are only three maps\n2) theres only two modes (survival and pvp) so with the small number of maps, it csn get pretty repetitive\n3) thr controls are a bit weird. Not the biggest deal but most of the buttons aren't utilized, and really thr obly one that is is pressing in the analog stick, which... Why?\nAll in all totslly worth 15 bucks, in having a lot of fun, but it seems like they didn't do too much with it because maybe they knew they didn't have to cause an archery game would sell regardless\n\nHelpful | 6\nDeveloper ResponseSep 5, 2019 at 1:41 PM\n\nHi, thanks for your interest in the game and feedback. We will investigate how we can improve the graphics more. There will likely be more maps in the future - but for now, be sure to check the 4th map (Human Castle  the one with stationary weapons) Its only available thought multiplayer although if you prefer to play alone just make the room private. Analog stick is a bit tricky but the idea is that when you gain skill points you can learn spells in Main Menu location and then access them on the thumbstick while the arrow is attached.", "SpookySpiritsSep 11, 2019 at 9:51 AM\nReview from a traditional archer:\n\nWhat I've played of it the arrow physics seem pretty good. Nothing fancy like bending arrows or archer's paradox but it has a nice instinctive archery feel to it that I can get used to... which is also the problem.\n\nMost archers use what we call an \"anchor point\" somewhere on the side of our face that we draw to every time. Playing this game it's no different however in game my anchor point is too high when I draw to my natural position. It feels like the hand and arrow knock are about 3 inches above my real life hand. Drawing to my natural anchor point does not put my arrow to where it would be in real life, causing me to retrain myself to draw lower. Fine for a game but I hate to throw away my current muscle memory. For realism your arrow knock in game should be just a hair below where the controller trigger is. A solution that should please everyone would be to provide some kind of offset slider. (edit: It seems they added this feature or it was there and I didn't notice, there's an \"arrow hand offset\" checkbox in the main menu... I see why they did this though... without the offset I found myself bumping my headset with my controller drawing to my natural anchor point)\n\nIt is a bit confusing when you jump to another platform as you don't keep your directional facing. Causes a few seconds of disorientation.\n\nOverall though... I can see myself having a lot of fun with this in spite of people deliberately poking through walls in PVP. Feels almost wrong and scary shooting a bow at a human. I like it! Graphics are smooth and there's a good perception of depth. With just a few improvements this would be a 5 star game for me.\n\nHelpful | 5", "Slatarou01Sep 10, 2019 at 12:46 AM\nAmazing game, with one problem\n\nI honestly am really enjoying this game, however I have a major problem with online multiplayer, I can only play about 10 waves before the game crashes. I am wondering if other people are experiencing this problem, but it makes online play very difficult and I am hoping for a fix.\n\nOther than that the game feels amazing, the arrows appearing in your hand instead of reaching for them behind your back is very helpful when there are a lot of enemies. The aiming feels very nice and all maps have a unique feel to them.\n\nOther than multiplayer crashing no other problems\n\nHelpful | 3", "Zenobius101Oct 22 at 11:22 AM\nElven assassin\n\nLots of fun. Not too far into leveling up. Hope there is an end to the game and not just repetitive waves to shoot.\n\nHelpful | 0", "mr_booooomOct 1 at 2:07 PM\nFun\n\nPretty new to VR in general and this game was one of the first I purchased. Generally loving it.\nSometimes I experience tracking issues when shooting up in the sky fast (to kill the small dragons) .\nThe new arrow then does not register although my hands are in the correct position. might be a quest tracking issue or some kind of bug in the game.\n\nWould love to have more choice of weapons (crossbows?) and some options to trade damage with speed. Also more different enemies/monsters would be great.\nGenerally I feel that arrow spamming (crazy fast shooting of arrows without actually aiming exactly) should not be rewarded or even possible.\nAll together great game and great job!\nLooking forward to future updates and upgrades!\n\nHelpful | 2", "robert.dodge.378Sep 6, 2019 at 3:33 PM\nGreat Co op Game but needs more variety!\n\nThis is my first review so will be relatively short - Greet game for playing multiplayer co op but it needs more variety ideas below..\n1. Enemies with different weapons not just axes - maybe bows and arrows too.\n2. Extra platforms even at ground level.\n3. Night mode with flaming arrows.\n4.Improved graphics - maybe implementation of vulkan.\nI am not sure if there is a bug with the mic as even if I press the B key I cannot hear anyone but maybe they just do not want to talk?\nPerfectly priced for what it is worth more if it can be improved.\n\nHelpful | 4", "thezachbrandonSep 12, 2019 at 4:25 PM\nI love this game!\n\nMy favorite game on VR ever is the famous demo from The Lab, Longbow. This is a very similar game and I really, really enjoy it. I do wish they gave a bit of a tutorial on how to most effectively kill larger enemies. Especially playing with spell mode off, I cannot kill the large dragon before it reaches my gates. It is definitely worth the money and is one of the funnest games on the quest!\n\nHelpful | 1", "acarpenterSep 7, 2019 at 11:31 PM\nHaving so much fun\n\nSo far Ive had a blast killing Orcs and Dragons! Some of the little touches like magic and different bows and helmets just rounds out the entire experience for me. Cant wait to try multiple player! Would love to see some polish to the graphics if possible? Great job to the developers!! Well worth $15.00\n\nHelpful | 3\nDeveloper ResponseSep 8, 2019 at 6:14 AM\n\nWe will be adding more polish to the graphics soon.", "ChompMcRibSep 5, 2019 at 6:01 PM\nWorthwhile especially considering price\n\nAs others have said graphics aren't amazing but they are appealing in a classic arcade kind of nostalgic way. Bow controls and arrow trajectory are extremely realistic. Not the most strategic game but it's simplicity is a bonus if you want to focus on archery! I have fairly strong shoulders and I was shaky after three minutes of intense firing and had to take a break.\n\nHelpful | 3", "Icepick869Nov 6 at 12:00 AM\nHooked me on VR\n\nA few of us from work played this at a place nearby and now I have a Quest and the only game I bought so far is this one.\n\nHelpful | 0", "VedranMar 4 at 4:31 AM\nAwesome game but keeps crashing\n\nSo sad... :(\n\nOculus Quest, Single Player mode only - never played it in multi-player. Im gonna have to stop playing it because i reach like wave 16 and all my effort is in vain all points lost, etc. due to it crashing. I start it up again, wave 6 crashes again. Whats the point in trying...i am open to helping the developer fix this by providing logs, etc. not sure how to get in contact though...\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:10 AM\n\nDear Vedran, Thank you for your feedback. Please, let us know, is game still unplayable? Does game crash each time you play or only on specific time (like during 6-16th wave)? Also, please remember about downloading newest updates. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "vrgames.ioSep 7, 2019 at 12:43 PM\nNew Favorite Quest Game!\n\nElven Assassin is an excellent multiplayer first person tower defense game that is easy to learn and fun to master! It has quickly become my new favorite game on the Quest with intense waves of enemies including dragons and giants! Your battery will die first before you feel like quitting, or your arms might just fall off from shooting arrows non stop for hours.\n\nDefinitely worth it for the fun factor, multiplayer, and addicting replayability. I would love to see more upgrades that have a big impact and custom waves of enemies. Love it!\n\nHelpful | 3", "DomachiSep 10, 2019 at 1:37 PM\nLove it. Could be more complete\n\nPlayed a couple of hours befor writibg this review. The game is fantastic ! The way you manipulate the bow is great and the more you practice, the better you become which is wonderful.\n\nI do believe that there is not enough types of monsters. My reason behind this is with only 3 levels, the only difference there can be is the diversity is those levels which is absent. Only a few types of monsters that feels all the same wave after wave, level after level\n\nMy other concern is the lack of stats on the weapons. Getting gold in this game is a hell of a grind and to get equipement that those nothing but esthetic is weak. I say that because you can actually have spells that increase damage so why not have equipements thst do to. You could incorporate difficulty levels so that grind would actualy be worth something abd it would give purpose to the game.\n\nOverall, it is a must have on the Oculus Quest and hope to see more updates to add content to this game !\n\nHelpful | 0", "mati.ihs.567Sep 30, 2019 at 12:13 AM\nGreat game, terrible multiplayer\n\nI would love to give this game five stars. Played it with friends on HTC vive, and on quest the feeling is almost identical, brilliant bow mechanics, entire game is as simple as it gets, but, boy, is it addicting. We have spend small fortune in VR cafes just playing Elven Assasin. But what kind of ruins the game for me are constant crashes while playing multiplayer, problem with server connection, problems with server browser - after reading few forums i found that issue is quite common, and devs are aware of it. There is no rule - last day i was able to play 43 waves without single crash. Later that day i got consecutive five crashes every five waves. If he problem is fixed, the score would be 5/5. Right now - either singleplayer, or frustrating and uneven multiplayer experience.\n\nHelpful | 5", "armando.foster.5Jan 31 at 10:32 PM\nBest game out There\n\n#1 gamw6\n\nHelpful | 0", "d0n3valDec 2 at 11:26 AM\nCrashes too often\n\nI can only play in the first map, other Teo crash after a while :(\n\nHelpful | 1\nDeveloper ResponseJul 16 at 9:29 AM\n\nDear d0n3val, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future. Please, update Elven Assassin (as well as Oculus Quest software) to the latest version and let us know if any of your problems are still present. If so, contact us on support@wenklystudio.com", "max987manNov 22 at 11:46 PM\nGhchgug\n\nufuf\n\nHelpful | 0", "jimmyjam5000Sep 22, 2019 at 4:52 PM\nMy favorite oculus quest game so far\n\nWow. Great implementation of VR in a game. I dont have to move around, but I can if I want to and I always feel involved in the game play. Multiplayer is very active which is awesome. The only suggestion Id give is a more epic battle scene. Id love to see friendly NPCs battling on the ground and a generally more active environment.\n\nBut overall, this is a great game. I can easily spend hours on this. To be honest, Im probably getting really good exercise playing this.\n\nHelpful | 1", "IdentityCrisisVRSep 16, 2019 at 1:52 PM\nGreat fun\n\nI was a little worried this game would get repetitive fast, but with the co-op online I have had nothing but great fun playing this game. I am hoping for more maps down the road, but am very happy with what we have do far.\n\nHelpful | 1", "Z3PHIRSep 9, 2019 at 7:19 AM\nAwesome game\n\nMy first experience with this game was at a VR Arcade and couldn't stop playing it. I purchased the Quest a couple weeks after its release and I was disappointed this game was not available for the Quest. I could not find a game that caught my interest and for the last couple weeks I was considering selling my Oculus as it was collecting dust. I decided to go into it once more and to my surprise, there was Elven Assassin!!!! I haven't been able to stop playing for 3 days and believe me, my legs are so sore from ducking axes. This game has actually been helping me to get active again.\n\nI'm a little worried though as this game is repetitive after a while, I hope they add to it. Also, would be nice if upgrading your bow actually did something other than look nice. You work so hard to get the gold to upgrade your bow and helmet but it's just for decorative purposes. The properties of the bow don't change, only the skin.\n\nHelpful | 9", "Jonny364Sep 20, 2019 at 2:47 PM\nGreat game (suggestion)\n\nThis game is great. It adds a whole new depth to VR and it is more than just your average shooter. If I may suggest, it would be nice to have the option to toggle on a \"ding\" sound whenever you hit an enemy with the arrow. I feel like it would add some satisfaction to those long distance snipes.\n\nHelpful | 1", "Hexenv88Oct 14 at 1:52 PM\nFantastic game\n\nHummed and hawd about this title for a while. Didnt find it that appealing. One day out of boredom I bought it. Was very surprised at how much I like it. It has quickly become one of my favorite games.\n\nHelpful | 0", "DeadlyEagleOct 14 at 5:13 AM\nNice but short\n\nOnly 4 maps and mising chalenges. Just only for learning on 3D Oculus options.\n\nHelpful | 0", "ParadiseDecaySep 6, 2019 at 11:14 AM\nRobin Hood would be proud!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=An8KZvs1-Ls\n(Please Note: Links might not work from Oculus, so please search YouTube for 'Paradise Decay VR Elven Assassin')\n\nMy Initial Thoughts:\nGreat bow mechanics and physics on top of a fun medievil styled wave shooter. And I got to play it stood next to the Major Oak in the heat of Sherwood Forest.\n\nHelpful | 1", "min_tabOct 17 at 8:34 PM\nA must have game\n\nMy first VR experience at a gameroom had this game, I really enjoyed it. So when my wife bought me the Occlus Quest for my birthday, I was elated to see that Elven Assassin game was coming soon! It was everything that I remembered and more, even my wife is hooked. If you buy this game, it is worth every penny. Min Tab\n\nHelpful | 6", "robgirardSep 14, 2019 at 9:16 AM\nAmazing!\n\nThis game is a lot of fun! Took me a while to get a feel for the aiming, but once I had it, it's great. Unfortunately, if you try to hold it like a real now, your draw hand may be out of view and lose tracking.... And the bow draw feels shorter than I'd expect (I'm tall with long arms ... Would be nice if I could set my draw distance in the settings). But even with these drawbacks (pun intended!), I'll still give it a 5.... Very well done... Thanks for producing this title!\n\nHelpful | 2", "J_Rene1Sep 8, 2019 at 10:23 AM\nUpset\n\nThis is a great game with a lot of potential. Im level 31 and Im trying to keep leveling up but I get to a wave in the 20s and it just keeps sending me to the home screen. Its very frustrating.\n\nHelpful | 6", "powney1991Sep 13, 2019 at 8:38 AM\nFavourite game to date as of 13/09/19\n\nWow oh wow! This game is absolutely MADE for the quest and is my favourite game to date! The incentivised replaying system for a start is FANTASTIC and makes it extremely replayable in the way in which the more you play the more magic points and coins you earn enabling you to upgrade magic arrows and equipment in order to get further through the game. The multiplayer is something I havent tried yet but heard thats also epic! Theres something magical about standing at various vantage points and aiming for a axe throwing troll or a fire breathing dragon which is hell bent on destroying your village! Absolutely amazing! A great job on this game and highly recommended!\n\nHelpful | 2", "KristinlkcSep 17, 2019 at 1:15 PM\nThe game that made me buy Oculus Quest\n\nThis game got me into VR, and it's still my favorite. It's a great place to start, because of the way you move around in the game, it's more comfortable than immersive. Most importantly, it's just a whole lot of fun! The only things I'd like to see improve would be adding new levels/villges and allowing more than four players. At the end of the day though, would still give this game five stars, it's a great game to play with friends and family.\n\nHelpful | 0", "Stevie18784Sep 13, 2019 at 12:55 AM\nGreat game\n\nCan anyone please confirm if the suits you can buy give you any special abilities ?\nIf not this would be a great idea was it gives a player something to aim for!\nReally fun game though. Small issue with kicking me and my friends out though please look at this.\nAttempting to join multiplayer bug is a problem and has stopped me playing game\n\nPlayed 13/09/2019 and was disconnected or it froze 6 times, this was also the case for my friend. Can the developers confirm they are looking at this ?\nCan developers also confirm if you delete game or lose game for any reason your progress will be saved to keep progress when reinstalling\n\nHelpful | 3", "darrenconnellySep 15, 2019 at 6:45 PM\nPretty good - Wish graphics were better\n\nThis is pretty fun, especially on multiplayer mode :) It was definitely worth the purchase. I feel the graphics could be quite a bit better though, as other games on quest have shown.\n\nHelpful | 2", "PuppetsMasterSep 28, 2019 at 5:45 PM\nLovely healthy enjoyable experience\n\nJust like the pc game with few glitches.\nSome enemies get lost before the exit the pathway on the right.\nSome hits to the giant dragon get stuck in the air.\nI think it will be to improved through time and thats it\nBottomline its a very good experience.\n\nHelpful | 1", "dinlersNov 23 at 3:28 PM\nBoring\n\nBoring\n\nHelpful | 3\nDeveloper ResponseJul 16 at 9:30 AM\n\nDear dinlers, Thank you for your comment despite it's sad to hear that. Let us know, what do you want to see in game? What kind of content is most wanted in your opinion? The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "DavidMG3Oct 20 at 6:33 PM\nGreat, but buggy\n\nGames really good but it crashes A LOT on the quest and you get kicked out of games every other wave\n\nHelpful | 2", "CoreboSep 6, 2019 at 2:38 PM\nAwesome Game\n\nI got my first taste of using a bow on the Oculus Quest with Apex Construct, and I had a lot of fun, so when I saw this game coming out, I was thrilled.\nThe first thing I can say is that the villages look awesome and I love the fact that you are not stuck in one place. The game operates smoothly and it makes it all the more challenging avoiding battle axes and fire. They have also incorporated magic into the game so that you can send a special arrow to your enemies.\nYou have the option for single player or multiplayer. If you choose a multiplayer game, you team up with others to defend your village.\nOverall I would say it is well worth the price and will provide many hours of fun. About the only complaint I have is that the bow does not operate as smoothly as in Apex Construct. Sometimes is gets a little quirky trying to load an arrow and when trying to change positions you may have to shoot the blue area a couple times. Im sure that these bugs will be worked out over time.\n\nHelpful | 5", "UntoldSlaughtaSep 15, 2019 at 5:28 AM\nExcellent game best co op for vr\n\nAbsolutely outstanding game it does need a tutorial so that we will know to shoot to move to different platforms, I'd also like to know why do we get gold and why cant we see how much gold we have I noticed earning it after longshots is it going to be used for something as we already have a point and score system other than that great game would love to see more maps and customizable bows and armour with the gold system at least explained rather than getting gold at random\n\nUpdate it's been fixed before I couldnt see the store and everything else I just hope to see a more clearly defined gold drop and more gold perhaps with each kill still needs more\n\n1.Add more too the shop perhaps more spells as well we're supposed to be fictional elves right surely they know more than fire and ice\n2. More vantage points\n3. More monsters as well with different movements\n4. Some kind of game music otherwise it's just dead silent besides fighting sound affects\n\nHelpful | 5", "mattamdSep 9, 2019 at 2:33 PM\nReally fun VR experience and great price\n\nI've sunk about 6 hours into the game at this point and can see myself putting in a lot more time. At it's core the game is super simple. You stand on one of various towers overlooking a handful of lanes and fire arrows to stop invading orcs, trolls and dragons. At first glace it seems like this \"simple\" game play would tire quickly, but thanks to the solid game play you want to keep coming back. It's not the most realistic bow mechanics you'll ever see but within a few minutes it feels very natural and extremely satisfying as your aim starts to improve. When that horn sounds announcing the start of a new wave and you nock your arrow, pull back the string, line up your first shot and finally let it go....it feels so cool! Once the orcs start flooding in and you're trying to find a balance between slow, carefully aimed shots and rapid fire bursts, it's just a blast. On top of that there's the whole leveling and spell system to augment your arrow shots with elemental powers. Having some special firepower at your disposal is a nice little extra to make you even more powerful.\n\nI played a few matches of single player and while I was still enjoying myself, I found the multi-player really made the game shine. Coordinating with teammates and cheering each other on when you land a big shot adds a lot to the experience.\n\nThere's also a PvP mode where you're just warping around various spots trying to land shots on your opponents. Again, a super basic concept that ends up being a total blast. Definitely a good place to fine tune your aim as well.\n\nLastly, sometimes landing a kill grants you a bit gold. If you save up you can spend that gold on new gear...though as far as I can tell it's purely cosmetic. Eventually if you save up enough gold there's some really cool looking bow and armor sets. It's a little extra bit of progression to aim for.\n\nWell worth the $15 price tag. I'd obviously love to see more content (free or paid) in the future too!\n\nHelpful | 3", "redrum033Sep 10, 2019 at 4:26 PM\nLove this game!\n\nLove this game but I keep getting kicked from matches and losing my points which can be very frustrating when its hard enough to earn gold in this game. And does anyone know if upgrading ur bow or helmet does anything?\n\nHelpful | 0", "joeldengSep 6, 2019 at 3:19 PM\nGreat game, but not same as the rift\n\nI am a die hard Elven Assassin player and have contributed way more time to playing it than I should have this last year. The multiplayer community is amazing to play with and I have made a lot of friends during the long running rounds. The following are several disappointments in the Quest version of the game, though.\n\n1. I bought my Quest in the hopes that Elven Assassin would migrate to the platform, expecting to play together locally with my family on both the Rift and the Quest. I was disappointed to find that not to be the case. This also means I cant play with friends i already have on the Rift version.\n\n2. None of my progress transferred from the Rift. I have to start at level 1 and none of my gear, gold, or spells transferred to this platform.\n\n3. There are variances in the maps. This isnt huge, as changes in the maps create new experiences in the game play, but they should be across all platforms.\n\n4. The bow/arrow usage is much different between the Rift and the Quest. I had to readjust my shooting to a much less natural feeling experience to actually hit anything.\n\n5. The game is buggy. Again, not a big deal, as the developers tend to respond quickly to bug fixes. One notable one is that the orks disappear underneath the back deck in the Elven Village map.\n\n\nI will always be committed to playing Elven Assassin probably to an unhealthy addictive level needing psychological help to come back to reality because it really is an amazing experience. If you are new to the game on the Quest, you will not be disappointed at all!! For those of us from the Rift version, we will have to trade the experiences from the Rift for the opportunity to play the game with portability and no need for an expensive laptop computer. But I do hope that the development team will find a way to integrate the experiences.\n\nHelpful | 9", "Renegrenade23Oct 2 at 10:09 AM\nFun, but.\n\nFun, but after about ten hours it's the same thing. No real reason to keep playing. A lot of variety could be added to the game with weapons behaving differently or different enemies. Good for what it was meant to be, could have been more.\n\nHelpful | 2", "Spawn2000Sep 25, 2019 at 3:42 PM\nThis game rocks!\n\nIf you like killing orcs, giants and dragons then this is the game for you. Prepare for your shoulders to hurt as you shoot your bow and arrows for hours. No really, you're arms are going to hurt but it's well worth it. Buy the game!\n\nHelpful | 1", "DAX_QcSep 5, 2019 at 12:09 PM\nGreat game.\n\nSeriously, its one of the time i had the most fun since launch. At this price its a no brainer. Multiplayer is awesome. Sure its repetitive but its still a must have. No 5* just bc no game is perfect.\n\nHelpful | 4", "ShadowHunter_313Oct 10 at 1:48 PM\nAbsolutely love it, however\n\nI just wish there were more than a few people who play online. Pretty boring when you play by yourself, it only gets fun when you get to the higher waves\n\nHelpful | 1", "dingoflingSep 5, 2019 at 1:43 PM\nIf you like VR bow and arrow games.\n\nLots of games in my library have bow and arrows alongside guns. My more expensive HMD's playing Skyrim, I always found after the big update for VR, Bow and Arrow was my thing. There being no Skyrim VR on the quest, and me wanting to shoot bow and arrows in a very well done way is good for bursts or long sessions. I hope the Devs. Have plans for future add-ons and updates. Thanks Devs for creating this great game btw!!\n\nHelpful | 5", "SirRealDealSep 6, 2019 at 9:13 AM\nExceptional Wave Shooter\n\nThe multiplayer is GOLDEN. Especially PvP.\n\nFantastic fun all around.\n\nLike others here I felt like something was off with aiming. But that's just user error. Persevere & you'll figure it out. Pay more attention to your arrow hand.\n\nI agree with others about utilizing buttons. I think a 'look & press B' to teleport would work much better but I also understand the use of arrows as it gives a sense of urgency that otherwise wouldn't be there.\n\nA couple more spots to shoot from would be great as well.\n\nHoping for more maps too.\n\nRegardless of any suggestions I've made above, this game is well worth the price of admission as it is.\n\nHelpful | 3", "Baldyboy007Sep 6, 2019 at 2:56 PM\nWhy the hater's?\n\nI can't quite see what people are moaning about I think the graphics are actually pretty good very smooth with good depth of field and the dragon animations are particularly good. Single player is good but it's the multiplayer that shines! Really loving it, nice to have a chat with others while playing and very few glitches. Would highly recommend if you like wave shooter's\n\nHelpful | 3", "MBolinskySep 15, 2019 at 9:28 PM\nFun! *When it works\n\nSimple concept but loads of fun, easy to sink some time into. That being said, the game has crashed on me probably about 75% of the times Ive played. Would still recommend, but please work out the bugs :/\n\nHelpful | 3", "Ph4ntomProph3tOct 21 at 2:29 PM\nGlorious wave based action\n\nGreat game for your vr horde mode fix! For gameplay check out this video https://youtu.be/N1gh3NTsyD0\n\nHelpful | 0", "CuppojoeSep 12, 2019 at 7:54 PM\nMeh.\n\nAs someone who really enjoyed the feeling of QuiVr, I was very much looking forward to this title. That being said, it does NOT feel as realistic (physics-wise) as QuiVr, and the wave-upon-wave of the same creatures with no feeling that the player is making any progress becomes very boring. Yes, each wave is successively more difficult (ie. more baddies from more directions), but that's it. Eventually, there are so many coming from so many different directions you can't possibly survive. Ultimately, a very tiring and unrewarding experience. If there was a free demo of this game, it would be all that you need.\n\nHelpful | 4", "sinkkingSep 10, 2019 at 6:00 PM\nSolid Game\n\nThis is an awesome game for the quest it has a very Skyrim atmosphere and it feels good to work as a team in multiplayer. This game has some of the nicest graphics I have seen on the quest besides the simplistic character animations. It would be cool if it was a full-on open-world game but I totally appreciate it for what it is.\n\nHelpful | 1", "ph0t0nv1s10nSep 6, 2019 at 5:49 PM\nSuperb value for money\n\nFun, multiplayer and also gives you a bit of light exercise.\nThat and you get to slay dragons and be a hero with a crossbow, this game is superb, especially in multiplayer mode. At the time of writing, it's around 10 for the game. A bargain by Quest standards for such a game.\n\nIf anything, I would like to see more game maps over time\nbut the seven or so to pick from so far, are great.\n\nWorth the money and the archery mechanic works well.\n\nHelpful | 2", "KenswiftSep 5, 2019 at 7:41 PM\nIts finally here!!!\n\nThis is the only game where I wrote the Studio to find out if it was coming to the quest. I got the HTC Vive on release day and got this game early on. It has grown a lot since its initial release and has gotten better and better. I remember not letting my buddy know they fling axes in the later levels and I watched him fall on his butt as a axe wizzed by his head. So much fun!! If you dont have this game yet you are missing out! Its made for a cordless experience!! Thanks W.S. For such a great game!\n\nHelpful | 4", "StudebekkerSep 10, 2019 at 3:52 PM\nFinally, serious challenge!\n\nHey there, thanks for this title! Tower defense game in co-op is brilliant idea. Great experience starts from co-op mode. Please, make bow handling more realistic - it will help to immerse into the environment totally. Hope, we will see more updates in the future, because there are no limits to develop TD game.\n\nHelpful | 0", "SC077YSep 6, 2019 at 1:10 AM\nMy First Rift game on my own Quest\n\nThis was the very first Rift game I played, and apart from PSVR (Res Evil Demo & Thorpe Parks ghost train my first VR experience... this is what sucked me into VR. Its so easy to pick up and play for 5 minutes or longer, no motion sickness and looks great!\nI also love the idea of being Green Arrow/Legolas saving the day. Not tried the multiplayer yet but I am looking forward to it. Well done Quest for bringing over this title!\n\nHelpful | 2", "fearlessfateSep 8, 2019 at 9:24 PM\nIt's like a cling on\n\nThis game is addictive, But make sure you reset your router.\nBefore hand if you are playing online. Because you will get kicked off. You need a strong wi fi connection.\n\nHelpful | 3", "m7.briggsOct 7 at 4:59 PM\nNice game\n\nPlease continue to develop this game .nice multiplayer game\n\nHelpful | 0", "thekrunkymonkeySep 8, 2019 at 3:53 AM\nImpressively mediocre\n\nArchery lends itself well to VR but this game does nothing to support that notion. If this is the future of VR then then platform is already dead.\nDull graphics, mediocre & repetitive game play, multiple bugs (including the start menu failing to disappear once the game starts) all combine with an inability to move around the castle area make this the a genuinely bad game.\nI want my money back.\nThanks.\n\nHelpful | 4\nDeveloper ResponseJul 16 at 9:37 AM\n\nDear thekrunkymonkey, Thank you for your feedback. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Were planning to still improve the balance of gameplay, add various features, expand universe and make plot more important. By the way, have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "BigHeyZuesSep 24, 2019 at 10:35 PM\nLove this game !\n\nThis was the first game I played on a Vr headset and I loved it so glad I get to play it now with no wires soo happy with it gets me tired too and even if it gets a little repetitive I cant get enough!!\n\nHelpful | 1", "TheHeadFoolOct 25 at 12:27 PM\nLove it\n\nI love this game, the ability to add magic increase playability\n\nHelpful | 0", "D1ZZYCL0N3Oct 14 at 10:04 AM\nFun to play.\n\nPretty basic game however still very fun to play. I find it very fun even playing the same stage over again just to get better.\n\nHelpful | 1", "CaptainCorbinSep 9, 2019 at 7:45 AM\nAwesome sauce\n\nGot it ASAP as this is the game I played at the VR cafe on the htc vive. Happy to report it plays the same on the quest. Great graphics and play. Multiplayer is fun and works well\n\nHelpful | 1", "pink-pandaSep 23, 2019 at 8:45 AM\nCrash after crash\n\nGame just crashed in the middle of the game, two times in a row! This is no fun, when your battle is being interrupted for no good reason!\n\nHelpful | 5\nDeveloper ResponseJul 16 at 9:35 AM\n\nDear pink-panda, Thank you for your feedback. Please, update Elven Assassin (as well as Oculus Quest software) to the latest version and let us know if any of your problems are still present. If so, contact us on support@wenklystudio.com", "steven.couture.5Sep 9, 2019 at 7:15 PM\nGood game\n\nThe multiplayer is awesome!\n\nNeed more map and still have some glitches!\nQuestion to the dev?\nIf i do a factory reset on my quest, do i lost my progress ?\nThanx!\n\nHelpful | 1", "SoapySonOct 5 at 3:28 PM\nGreat multiplayer\n\nGood fun, nice to pick up and play with a few dudes, like how you can join in on others game.so skip straight ahead to tje later levels\n\nHelpful | 1", "BacktraceSep 7, 2019 at 3:55 AM\nNice in solo mode , great in coop\n\nGreat fun in Multiplayer!\n\nMinor Glitch: Please also clear the left over arrows when the giant/ogre dies, atm they stick mid air for some time.\n\nHelpful | 4", "Dragonvang87Oct 1 at 3:51 AM\nDont buy\n\nThis game was hyped by the reviews and this game really is bad. Mechanic is terrible and there is no tutorial on how to do certain things. I tried playing it a few times cant get into it so irritated I got this.\n\nHelpful | 3", "flynnworldSep 11, 2019 at 10:05 AM\nGreat Gameplay\n\nI loved the game itself and multiplayer co-op was a blast. The only issue we were having was getting together in co-op. My brother and I were trying to play a private game but either the game would not show up or once we clicked on it to join, it would just refresh the game list and not be there. We would have to go back to the main menu and then to multiplayer and back for about five minutes to finally be able to connect. Loved the game play, but had a lot of issues trying to connect for multiplayer.\n\nHelpful | 1", "richard.manwarrenOct 16 at 2:27 PM\nFun!\n\nThis game is so much fun! My wife and I play it all the time and it never gets old.\n\nHelpful | 0", "KegsOverEZSep 5, 2019 at 11:16 PM\nHas great potential!!\n\nNothing like shooting a bow in VR. Def a great buy for 15 bucks. Only reason I didnt give it more stars was the sound design. It could def be punched up a bit and right now on the quest seems super low even turned up the whole way which dulls the experience. A louder in your face sound design would completely change the experience!!\n\nHelpful | 3", "SweetMan2612Dec 10 at 4:34 AM\nUpdated\n\nI gave it 5 stars because this game is absolutely wonderful. Graphics are good, not great,if it keeps it from lagging then I say keep it that way. I have already spent so much time on this game even when my arm is crying for a break. I would say add some more. Levels are all pretty much the same. Lol 30 is the hardest and lvl 83 is as hard as lvl 10. Earn and keep this five stars please. I want this game to stay amazing.\n\n(Update) I reviewed this game on September 8, i got it when it first came out and it's my favorite game but you should be warned. I loved this game and I played so much I was the highest player you'll meet, but then I stopped until a couple of days ago which is about 3 months. I got rid of my 5 stars even though this is my favorite game and hear me out. This game had four maps and a pvp map when it first came out and when I got back in 3 months later it still had that amount and not a single detail was new or the physicals. They did not add a single thing, people gave max spells and every clothing item and all you can do on this game is see how far you can go. I'm disappointed they thought the game would take care of its self.\n\nHelpful | 7\nDeveloper ResponseJul 16 at 9:28 AM\n\nDear SweetMan2612, The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Were planning to still improve the balance of gameplay, add various features, expand universe and make plot more important. We are hoping to give more content updates soon. We have very exciting things coming to Elven Assassin this year. Also, check out latest update full of multiplayer and social features.", "fdisksSep 13, 2019 at 8:47 AM\nGood Stuff\n\nGive it time...it gets better..\nLike when you kill your first zombie with an arrow to the head....wait.....No Zombies.....so refreshing...\n\nHelpful | 1", "dballot34Sep 5, 2019 at 1:00 PM\nWhat am I missing\n\nI spent about 30 mins in the game and there was zero training on how to even switch from tower to tower. Maybe this is common sense for some, but not me.\nWhy cant I just use the joystick? Shooting an arrow to that platform seem rudimentary.\n\nHelpful | 8\nDeveloper ResponseSep 5, 2019 at 1:12 PM\n\nYou are totally right that the information about how to teleport is not highlighted enough as we've seen more players who did not know it. Currently, we have this under the \"Controls Window\" which is accessible from the \"Settings Window\", but it would be better to show this information to all players before they start the game. We will try to improve it in one of the upcoming updates. Thanks for your feedback and the interest in the game.", "MrsFoggSep 7, 2019 at 5:45 PM\nUpdate on Glitchy - on Oculus Quest\n\nUpdate - tried the game again today and did the RPG version. This had the glowing blue spaces to transport to when shooting but still a couple times after a jump my arrows hung in the air or after a strike they would still be hovering. I could still play but hanging arrows. More enjoyable this time.\n\nI went back to the arcade side and the blue teleport circles were there this time, they were not last night. Not sure if there was an update or not but did not play to see if the other issues had been fixed.\n\n- I played the game last night - Look like a fun game and wanted to try the arcade solo. Very glitchy. I love arrow shooting games. I chose solo into arcade without spells. Half way through while orcs where running it jumped me to a different ledge then when I went to shoot the arrows,\nthey hung in the air and I could not shoot anymore. Which got me killed repeatedly. Not sure if it is that way due to being on Quest. I will try the spell version tomorrow maybe that would be different. Just disappointed so far.\n\nHelpful | 3", "SanlakiOct 13 at 5:04 PM\nFavorite multiplayer gamw\n\nWe play this game on a daily basis. Love the fact that it supports 4 players\n\nHelpful | 0", "EwjOct 18 at 3:42 AM\nOutstanding!\n\nGreat game have the pc version to .\n\nHelpful | 1", "Crazybee0072019Sep 21, 2019 at 1:24 PM\nCant play with your friends!\n\nYou cant play with your friends! For some reason I couldnt find my friend and seems like the games on the server is totally different from each area. You cant search games you cant find people. This is just the best multiplayer platform.\n\nHelpful | 5\nDeveloper ResponseJul 16 at 9:35 AM\n\nDear Crazybee0072019, Thank you for your feedback. Please check out latest update full of multiplayer improvements and social features like comfortable joining to the game or inviting your friends using Oculus HUD. Please tell us which VR set you (and your friends) use. Currently the crossplay on Oculus Quest & Steam/Oculus Rift, unfortunately, is not supported. We do have plans for the future development of the game and we might implement the crossplay in the future. You might consider getting an Oculus Link cable. It provides the access to Rift games and experiences from a gaming PC on Oculus Quest. Also, if your Let us know if any of your problems are still valid. If youre still facing some problems, feel free to contact us at support@wenklystudio.com", "The_LionSep 25, 2019 at 8:19 PM\nMust Have\n\nFor me, this game is a must have.\nPlaying online either PVP or PVE is where I get the most enjoyment.\nDozens of hours played so far, not let down.\n\nHelpful | 0", "DrDrewskiSep 9, 2019 at 7:29 PM\n\nSo good! I am HUGE on multiplayer experiences and this is exactly what I was looking for! Join up to 3 other players online and fight waves and go for the highest score. Also has leveling up and gold mechanics. Excellent game!\n\nHelpful | 1", "ChyknSep 14, 2019 at 10:58 AM\nDraw hand tracking glitches ruin it\n\nI played this on the Rift for 2 years and became accustomed to the nearly flawless hand tracking. Unfortunately the Quest version seems to have issues tracking when the draw hand is too close to the headset.\n\nWhen I draw my hand back to my shoulder or beside my head, it loses vertical tracking almost every time. It will usually detect some lateral movement, but once the hand is drawn I can't make vertical adjustments. It would be one thing if this were an occasional glitch, but it happens so often that it kills the experience for me.\n\nGiving it 3 stars because it's a great game overall, but extremely frustrating to play on the Quest due to the draw hand tracking.\n\nHelpful | 0", "OrdinaryWorldSep 12, 2019 at 7:31 PM\nSimple game. Not feeling it.\n\nThe gameplay is pretty simple and straightforward. Waves of bad guys walk into the castle and you defend by taking them out with your bow. I only played for 10-15 minutes and the boredom started to kick in. Maybe it gets better and I've only played in Arcade mode but I'm not really feeling it.\n\nHelpful | 1", "thediabetesheroSep 7, 2019 at 9:44 PM\nAn absolute blast.\n\nI couldnt wait to play this for quest as Im a huge tower defense fan and it did NOT disappoint. I played for a couple hours and only put it down to rest! Hope there are some add ons or expansions in the future!\n\nHelpful | 2", "AlphazippoOct 1 at 9:12 AM\nLove this game\n\nThis is my number one go to game for my quick VR fix. Really addictive and fun gameplay\n\nHelpful | 2", "agugginaSep 27, 2019 at 7:17 AM\nbest game for quest\n\nThis is why i bought this system. Great mulitplayer game and love the ability to team up with others or play against them.\n\nHelpful | 0", "Transient_VagabondSep 29, 2019 at 5:08 AM\nMost fun multiplayer game so far\n\nWhile this game has its quirks, its a must have game to play with others\n\nHelpful | 2", "daniel.geoffroy1Oct 3 at 7:33 AM\nBest game ever.\n\nBest game on the quest. Superhot vr is second by a mile.\n\nHelpful | 1", "MoneybagvrNov 12 at 6:19 AM\nChange of heart\n\nThe game is okay but the people that are on there are great\n\nHelpful | 0", "maessofOct 8 at 3:08 PM\nGreat though sometimes bugs out\n\nGreat, Spent many hours in her.\n\nHelpful | 1", "Meggy-Lu2Oct 3 at 2:07 AM\nVery entertaining game\n\nGreat game if you like medieval fantasy.\n\nHelpful | 1", "HausSauceSep 6, 2019 at 8:43 AM\nRuns good, great concept,lacking content\n\nFun experience, played it for about 2 hours on release. Gets dry fast. Endless waves of orcs and dragons, but the same orcs and dragons. Same waves, four maps. Needs more content, Multiplayer maps were empty. Wish I could refund.\n\nHelpful | 10\nDeveloper ResponseJul 16 at 9:41 AM\n\nDear HausSauce, Thank you for your comment despite it's sad to hear that. Do you have any ideas how to improve feeling of the game? How to make it more immersive? How to squeeze more fun from Elven Assassin? If so, please let us know! The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting.", "Freak5how232829Sep 7, 2019 at 2:32 PM\nFun Game\n\nThis game is alot of fun if you like wave shooters. Multi player is great.\n\nHelpful | 0", "shmanySep 6, 2019 at 11:58 AM\nMeh\n\nI must be missing something I thought it was quite boring and the graphics arent very good.its cheap but if it's not very good it's a waste of money.\n\nHelpful | 6\nDeveloper ResponseSep 8, 2019 at 6:16 AM\n\nWe are very sorry you didn't like the game. We'll be improving graphics soon. Be sure to try multiplayer as this might provide more fun for you.", "wishperOct 3 at 11:03 AM\n\nMultiplayer mode is worth it\n\nHelpful | 1", "HMon2009Sep 30, 2019 at 3:30 PM\nAwesome\n\nLove this game and the game play is great!\n\nHelpful | 1", "kushagrapundeerSep 9, 2019 at 7:56 AM\nBest with multiplayer\n\nLove the multiplayer mode. Would love to see more features and maps in the game. The only game on Quest that I can continue playing for hours.\n\nHelpful | 2", "TheeZombieHunterSep 27, 2019 at 12:53 PM\nFantastic bow & arrow game.\n\nThis is why we purchased VR !\n\nHelpful | 1", "12vdcSep 19, 2019 at 9:50 PM\n12vdc\n\ndude why is the music from the sixteen hundreds\n\nHelpful | 2", "vrbear1977Sep 11, 2019 at 10:11 AM\n\nGreat game i love it\n\nHelpful | 1", "kjc825Sep 6, 2019 at 8:17 AM\ngreat!!\n\na little hope!! more map... more item... and more Enhanced graphics ??\n\nHelpful | 3", "Quest787Sep 15, 2019 at 1:25 AM\nVisit Middle Earth\n\nSurprisingly fun and addictive wave shooter.\n\nHelpful | 1", "guenter.baumann1711Sep 19, 2019 at 2:50 AM\nFitness by shooting arrows\n\nYou feel like running a marathon after shooting the bow at several waves of Orcs - funny\n\nHelpful | 1", "SuperBonSep 5, 2019 at 10:09 AM\nFinally !\n\nIts a long long wait! Finally its here!\n\nHelpful | 5", "Maxol90Sep 5, 2019 at 2:52 PM\nLove this classic\n\nAt last it's here. Totally love it, this game got me into VR\n\nHelpful | 3", "MikeNHSep 6, 2019 at 11:41 AM\nIt's ok\n\nMaybe I'm just bad at it, but I found the aiming mechanics more of a chore than fun. A better way to teleport would've helped.\n\nAlso had two axes thrown at me THROUGH a building.\n\nHelpful | 0\nDeveloper ResponseJul 16 at 9:38 AM\n\nDear MikeNH, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future. Please, update Elven Assassin (as well as Oculus Quest software) to the latest version and let us know if any of your problems are still present. If so, contact us on support@wenklystudio.com . You've mentioned some difficulties with the bow aiming - have you tried the \"Arrow offset\" option from in-game settings? Please, be patient and follow us on social media, more brand-new content to come this year, we cant wait to share you all the exciting news!", "ArbUstSep 7, 2019 at 9:17 AM\n\nNot fun at all.\n\nHelpful | 2\nDeveloper ResponseJul 16 at 9:38 AM\n\nDear ArbUst, Thank you for your comment despite it's sad to hear that. The game is still developed, there will be things added and improved in the future, we have plans on adding some new locations and enemies in order to multiply the gameplay scenarios and make it more interesting. Have you tried multiplayer deathmatch? There's more dynamic and skill-based gameplay - it might be interesting for you. Also, check out latest update full of multiplayer and social features.", "TAICHUNGSep 8, 2019 at 10:09 PM\n\nCan't move other Blue portal, It feel bad.\n\nHope u guys can fix it.\n\nHelpful | 0"]