{"App Title": "End Space", "App description": "'Game of the Year' - Nomination - UploadVR\n\nThis is the absolute best game I've ever played... - vrgamerdude\n\nOur highest scored game, 9.3/10 - Twisted Reality\n\nTake command of the most advanced starfighter the United Trade Consortium has ever\ndeveloped in stunning virtual reality as you battle for control of the Tartarus sector. Protect the\nUTCs secret jump-drive technology from the Tartarus Liberation Front insurgents as you fight to\nmaintain the corporations dominance and earn yourself fame and fortune in the process.\n\nTrack targets with your gaze and blast them with your Pulse Lasers or lock on and pound them\ninto space dust with your Meteor Missiles. Unlock new weapons and upgrades as you progress\nthrough the ranks by taking on increasingly daring missions.\n\nFind out what secrets are ready to be revealed here at the end of inhabited space. Welcome to\nthe Tartarus sector, contractor. Or as the locals like to call it, End Space.", "Purchase section": "$14.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Flying, Simulation, Space/Universe", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Russian, Spanish (Spain)", "Version": "1.0.6", "Developer": "Orange Bridge Studios", "Publisher": "Orange Bridge Studios", "Website": "http://endspacevr.com/", "Release Date": "August 29, 2019", "Developer Privacy Policy": "Skip to content\nSkip to content\nEnd Space\nMinos Starfighter\nPress Kit\nEnd Space\nMinos Starfighter\nDev Blog\nSupport\nPrivacy Policy\nJustin Wasilenko Terms of Service and Privacy Policy\n1. Terms\n\nBy accessing the web site at http://endspacevr.com, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this web site are protected by applicable copyright and trademark law.\n\n2. Use License\nPermission is granted to temporarily download one copy of the materials (information or software) on Justin Wasilenkos web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:\nmodify or copy the materials;\nuse the materials for any commercial purpose, or for any public display (commercial or non-commercial);\nattempt to decompile or reverse engineer any software contained on Justin Wasilenkos web site;\nremove any copyright or other proprietary notations from the materials; or\ntransfer the materials to another person or mirror the materials on any other server.\nThis license shall automatically terminate if you violate any of these restrictions and may be terminated by Justin Wasilenko at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n3. Disclaimer\nThe materials on Justin Wasilenkos web site are provided as is. Justin Wasilenko makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, Justin Wasilenko does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site.\n4. Limitations\n\nIn no event shall Justin Wasilenko or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on Justin Wasilenkos Internet site, even if Justin Wasilenko or a Justin Wasilenko authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\n\nThe materials appearing on Justin Wasilenkos web site could include technical, typographical, or photographic errors. Justin Wasilenko does not warrant that any of the materials on its web site are accurate, complete, or current. Justin Wasilenko may make changes to the materials contained on its web site at any time without notice. Justin Wasilenko does not, however, make any commitment to update the materials.\n\n6. Links\n\nJustin Wasilenko has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by Justin Wasilenko of the site. Use of any such linked web site is at the users own risk.\n\n7. Site Terms of Use Modifications\n\nJustin Wasilenko may revise these terms of use for its web site at any time without notice. By using this web site you are agreeing to be bound by the then current version of these Terms and Conditions of Use.\n\n8. Governing Law\n\nAny claim relating to Justin Wasilenkos web site shall be governed by the laws of British Columbia without regard to its conflict of law provisions.\n\nGeneral Terms and Conditions applicable to Use of a Web Site.\n\nPrivacy Policy\n\nYour privacy is important to us, and it is Justin Wasilenkos policy to respect your privacy regarding any information we may collect while operating our websites. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy.\n\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\nWe will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law.\nWe will only retain personal information as long as necessary for the fulfillment of those purposes.\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. Justin Wasilenko may change its Privacy Policy from time to time, and at Justin Wasilenkos sole discretion.\n\n\n\n\nFollow End Space:\nCategories\nBeta\nEnd Space VR\nHow-to\nMinos Starfighter\nPatch notes\nDownload Minos Starfighter VR for Cardboard:\n \nFollow End Space:\nSupport | Privacy | Terms\nA game by Orange Bridge Studios Inc.  2020\nScroll back to top", "Developer Terms of Service": "Skip to content\nSkip to content\nEnd Space\nMinos Starfighter\nPress Kit\nEnd Space\nMinos Starfighter\nDev Blog\nSupport\nTerms of Service\nEnd Space VR\nCopyright (c) 2016 Justin Wasilenko\n\n*** END USER LICENSE AGREEMENT ***\n\nIMPORTANT: PLEASE READ THIS LICENSE CAREFULLY BEFORE USING THIS SOFTWARE.\n\n1. LICENSE\n\nBy receiving, opening the file package, and/or using End Space VR(Software) containing this software, you agree that this End User User License Agreement(EULA) is a legally binding and valid contract and agree to be bound by it. You agree to abide by the intellectual property laws and all of the terms and conditions of this Agreement.\n\nUnless you have a different license agreement signed by Justin Wasilenko your use of End Space VR indicates your acceptance of this license agreement and warranty.\n\nSubject to the terms of this Agreement, Justin Wasilenko grants to you a limited, non-exclusive, non-transferable license, without right to sub-license, to use End Space VR in accordance with this Agreement and any other written agreement with Justin Wasilenko. Justin Wasilenko does not transfer the title of End Space VR to you; the license granted to you is not a sale. This agreement is a binding legal agreement between Justin Wasilenko and the purchasers or users of End Space VR.\n\nIf you do not agree to be bound by this agreement, remove End Space VR from your computer now and, if applicable, promptly return to Justin Wasilenko by mail any copies of End Space VR and related documentation and packaging in your possession.\n\n2. DISTRIBUTION\n\nEnd Space VR and the license herein granted shall not be copied, shared, distributed, re-sold, offered for re-sale, transferred or sub-licensed in whole or in part except that you may make one copy for archive purposes only. For information about redistribution of End Space VR contact Justin Wasilenko.\n\n3. USER AGREEMENT\n3.1 Use\n\nYour license to use End Space VR is limited to the number of licenses purchased by you. You shall not allow others to use, copy or evaluate copies of End Space VR.\n\n3.2 Use Restrictions\n\nYou shall use End Space VR in compliance with all applicable laws and not for any unlawful purpose. Without limiting the foregoing, use, display or distribution of End Space VR together with material that is pornographic, racist, vulgar, obscene, defamatory, libelous, abusive, promoting hatred, discriminating or displaying prejudice based on religion, ethnic heritage, race, sexual orientation or age is strictly prohibited.\n\nEach licensed copy of End Space VR may be used on one single computer location by one user. Use of End Space VR means that you have loaded, installed, or run End Space VR on a computer or similar device. If you install End Space VR onto a multi-user platform, server or network, each and every individual user of End Space VR must be licensed separately.\n\nYou may make one copy of End Space VR for backup purposes, providing you only have one copy installed on one computer being used by one person. Other users may not use your copy of End Space VR . The assignment, sublicense, networking, sale, or distribution of copies of End Space VR are strictly forbidden without the prior written consent of Justin Wasilenko. It is a violation of this agreement to assign, sell, share, loan, rent, lease, borrow, network or transfer the use of End Space VR. If any person other than yourself uses End Space VR registered in your name, regardless of whether it is at the same time or different times, then this agreement is being violated and you are responsible for that violation!\n\n3.3 Copyright Restriction\n\nThis Software contains copyrighted material, trade secrets and other proprietary material. You shall not, and shall not attempt to, modify, reverse engineer, disassemble or decompile End Space VR. Nor can you create any derivative works or other works that are based upon or derived from End Space VR in whole or in part.\n\nJustin Wasilenkos name, logo and graphics file that represents End Space VR shall not be used in any way to promote products developed with End Space VR . Justin Wasilenko retains sole and exclusive ownership of all right, title and interest in and to End Space VR and all Intellectual Property rights relating thereto.\n\nCopyright law and international copyright treaty provisions protect all parts of End Space VR, products and services. No program, code, part, image, audio sample, or text may be copied or used in any way by the user except as intended within the bounds of the single user program. All rights not expressly granted hereunder are reserved for Justin Wasilenko.\n\n3.4 Limitation of Responsibility\n\nYou will indemnify, hold harmless, and defend Justin Wasilenko , its employees, agents and distributors against any and all claims, proceedings, demand and costs resulting from or in any way connected with your use of Justin Wasilenkos Software.\n\nIn no event (including, without limitation, in the event of negligence) will Justin Wasilenko , its employees, agents or distributors be liable for any consequential, incidental, indirect, special or punitive damages whatsoever (including, without limitation, damages for loss of profits, loss of use, business interruption, loss of information or data, or pecuniary loss), in connection with or arising out of or related to this Agreement, End Space VR or the use or inability to use End Space VR or the furnishing, performance or use of any other matters hereunder whether based upon contract, tort or any other theory including negligence.\n\nJustin Wasilenkos entire liability, without exception, is limited to the customers reimbursement of the purchase price of the Software (maximum being the lesser of the amount paid by you and the suggested retail price as listed by Justin Wasilenko ) in exchange for the return of the product, all copies, registration papers and manuals, and all materials that constitute a transfer of license from the customer back to Justin Wasilenko.\n\n3.5 Warranties\n\nExcept as expressly stated in writing, Justin Wasilenko makes no representation or warranties in respect of this Software and expressly excludes all other warranties, expressed or implied, oral or written, including, without limitation, any implied warranties of merchantable quality or fitness for a particular purpose.\n\n3.6 Governing Law\n\nThis Agreement shall be governed by the law of the Canada applicable therein. You hereby irrevocably attorn and submit to the non-exclusive jurisdiction of the courts of Canada therefrom. If any provision shall be considered unlawful, void or otherwise unenforceable, then that provision shall be deemed severable from this License and not affect the validity and enforceability of any other provisions.\n\n3.7 Termination\n\nAny failure to comply with the terms and conditions of this Agreement will result in automatic and immediate termination of this license. Upon termination of this license granted herein for any reason, you agree to immediately cease use of End Space VR and destroy all copies of End Space VR supplied under this Agreement. The financial obligations incurred by you shall survive the expiration or termination of this license.\n\n4. DISCLAIMER OF WARRANTY\n\nTHIS SOFTWARE AND THE ACCOMPANYING FILES ARE SOLD AS IS AND WITHOUT WARRANTIES AS TO PERFORMANCE OR MERCHANTABILITY OR ANY OTHER WARRANTIES WHETHER EXPRESSED OR IMPLIED. THIS DISCLAIMER CONCERNS ALL FILES GENERATED AND EDITED BY End Space VR AS WELL.\n\n5. CONSENT OF USE OF DATA\n\nYou agree that Justin Wasilenko may collect and use information gathered in any manner as part of the product support services provided to you, if any, related to End Space VR.Justin Wasilenko may also use this information to provide notices to you which may be of use or interest to you.\n\n\n\n\nFollow End Space:\nCategories\nBeta\nEnd Space VR\nHow-to\nMinos Starfighter\nPatch notes\nDownload Minos Starfighter VR for Cardboard:\n \nFollow End Space:\nSupport | Privacy | Terms\nA game by Orange Bridge Studios Inc.  2020\nScroll back to top", "Space Required": "607.0 MB"}



["5 stars\n38%\n4 stars\n24%\n3 stars\n19%\n2 stars\n8%\n1 star\n10%", "BruceinAKJun 18 at 12:12 AM\nProblem with motion sickness\n\nIve played this game twice over a period of 3 days. The first time I played the tutorial twice and felt quite ill. The last time I concentrated more and the motion sickness was less of a problem, but still there. I plan to keep working on this to see if I can play the game without becoming sick.\n\nWhy bother, you might ask. For starters, the graphics are great. The sense looking out of the cockpit of a space fighter is also realistic.\n\nOne change that I would make to the tutorial is to allow the new pilot some time to just fly around. That might help people overcome their motion sickness more quickly.\n\nHelpful | 95", "QDaBeat23 days ago\nWheres the rest of the game lol\n\nSo I guess thats why its been dropped to 8.99 Im sad to have paid 17. Hopefully the dlc will be free... disappointed after completing what is the final mission it just has to be continued I know for price points game doesnt need to be much longer but at least have an ending. Still the games great the functions are awesome controls and visuals are stimulating its awesome except the ending has to drop down the rating, sorry but even just write in the conclusion video and those improve the rating but\n\nHelpful | 11", "maragokApr 30 at 7:03 AM\nLimited amount of content, but good\n\nThe good:\n- Overall a fun space shooter\n- The default motion controls are very intuitive and easy to use\n- With the motion controls, I had no motion sickness even after over an hour of playing, really well done!\n- Decent graphics (within the limitations of the platform)\n\nThe bad:\n\n- About 2 hours of content at best (as of April 2020)\n- Repetitive: Every mission is basically \"kill the enemies\", few enemy types.\n- One ship with 3 kinds of primary weapons and 2 kinds of lasers, that's it.\n- Low replay value.\n- Difficulty not adjustable.\n- The alternative control modes seem poorly implemented.\n\n\nAlso, a really, really bad first impression (that luckily didn't carry over into the game itself):\n- The intro/title is blurry and seems to not be 3D (the game itself is OK)\n- In the tutorial, if you press the left trigger at the beginning, it crashes reproducibly. You press it and bam, home screen. (Devs: If you can't reproduce, try with a fresh install - maybe no weapon is selected?).\n- Can't change control settings without aborting the current mission\n- No throttle or roll control except boost/brake in the default control mode, but the on-screen key map display shows that it should be there, which is very confusing.\n- While scrolling in the settings menu the orientation randomly changed by 45 degrees or so\n\n\nI hope that more content will be added later - how about an attack on a really big capital ship/station where you have to attack the shield generators first, defending a capital ship from a stationary turret, or multiplayer?\n\nHelpful | 81", "Thorvindr10 days ago\nIt's not X-Wing\n\nIt's not bad, but it certainly doesn't compare to anything from the golden age of PC spaceflight simulators (X-Wing Alliance, Freespace 2, etc). VR adds some very intriguing control ideas to the spaceflight genre (look-to-target, for example), but for some reason, this game just doesn't seem able to string everything together into a solid simulation.\n\nAt the same time, it seems both too difficult and too easy. The difficulty is mostly with the controls. To the dev's credit, you can essentially disable the \"virtual joystick\" and instead use the actual control stalks on the Touch controllers. But if I'm going to fly a starfighter in VR, I want to use the actual cockpit controls, not a PS4 controller. That being said: the control axes for using virtual joystick require excessive tweaking to get them to really work well. And even when I get them working, I find myself using the control stalks when precision is needed.\n\nMaybe this is just a hardware limitation, but the added disappointment of a game whose difficulty derives ENTIRELY from learning how to properly adjust the controls kinda kills it.\n\nDon't get me wrong: this game does not suck. I don't want a refund. I just wish some of the game's challenge could come from challenging gameplay, rather than from trying to manipulate VR stick-and-throttle controls in an environment that (a) really calls for a dual-stick setup and (b) seems to be too rigid to account for differences in the muscle memory of different humans. I suspect the major reason this game lacks multiplayer is that if there were other humans shooting at me, \"using virtual joystick controls\" would be utterly synonymous with \"losing every single match.\"\n\nHelpful | 1", "LordMitchell1.07 days ago\nEnd Space\n\nI NEED MORE CONTENT! Cmon guys, jazz this thing up. So much potential. I really like the game, i hope they put more into it soon. Put in some insane weapons, faster thrusters, choice of ships.\n\nHelpful | 0", "Articus239Jul 23 at 4:17 PM\nPoor story and little content\n\nThe game while great while playing had no real story to it and I didn't like the way it just ended with no real feeling of beating the game. If there was more content in it and an actual story I would have really enjoyed it especially since I love space and don't get motion sick from VR at all. I will raise my rating however if we get a content update cause what this is right now I would only recommend it if you just want a quick space flight fighting game and nothing else.\n\nHelpful | 2", "Your_Pilot9 days ago\nI hope it will be continued...\n\nI love the HOTAS support directly on the quest, amazing. Done all the missions, waiting for more. Hope it have a multiplayers one day, coop and dogfight, great job!\n\nHelpful | 0", "pascom026 days ago\nIts a first person shooter\n\nIts good and it does what it says it does in the description so no complaints . Easy to pickup and get going with no complicated entry into the game.No glitching or crashing.\nThe graphics are quite acceptable and not as bad as some reviews suggest. Its easy on internals so Ive had no motion sickness at all, not that Im immune to such things.\nI havent played all the levels as yet so looking forward to the rest of the game.\n\nHelpful | 0", "moebenconway22 days ago\nWOW !!!!!\n\nOnly played 3 hrs over a couple days did not get any of the motion sickness other people had. This has been my first purchase of a VR game. WOW if this is the future of gaming these developers are on the right track. I really feel like I am there when I play this game. Granted not alot of experience in VR, But Im very very happy with this purchase, only critics would have liked to experience a demo of this game before I purchased it in case it wasnt as advertised.\n\nHelpful | 2", "mgetts25 days ago\nGood game.\n\nThis game is a good game its not what i expected. But my expectations might have been. Little to high for any dame. I would buy this one again if I needed to its a good fun game and the morins sick esss wasn't there at all for me.\n\nHelpful | 0", "Aztecdude69Mar 26 at 5:43 AM\nReview for Oculus Quest Users\n\nBLUF: Excellent game! It takes a few runs to get the hang of it. Definitely a must have for library.\n\nPROs:\n The graphics. This game takes you to the edge of space. Not an easy task for the graphics design/programing team. The graphics offer a full on space fighter flight experience. You really get the feel of a pilot in a space fighter craft. You might never fly an actual space craft but this game will give you a taste.\n Controllers. Once you have mastered the controls the game becomes extremely easy and fun. The missions are still challenging but youre able to kill and destroyed with ease. An example of ease, depending on the threat you can toggle between the appropriate weapon for the specific target very quickly. This is useful while simultaneously preforming erratic evasive maneuvers to dodge incoming missile threats.\n Learning Curb. No prior flight simulation experience is needed. If this is your first flight simulator, youll be great after a few runs. Theres no need to rush completion of the game.\n The Price. This game is 100% worth every penny. The amount of flight fidelity will make you wonder why its so inexpensive. (Note for the marketing team: yall lowballed this game, but thats awesome for the consumers. THANK YOU!)\n\nCONs:\n Fighter Ship. You are limited to only one ship. It is an Awesome ship, but more of a verity would be a nice to have.\n Fighter Upgrades. You collect coins after every successful mission. You can use the game currency to purchase additional primary and secondary weapon systems. Once you purchase three available add-ons, youre done upgrading. Maybe more weapons in the near future.\n Available Levels. As of 26MAR2020. There are 11 levels, 12 if you count the tutorial. I might be exposing my acquisitive side here, but I bring this point up as a CON because I wish to experience more. Dont get me wrong the current levels are awesome, but Id like to feed my adrenaline with more levels in the upcoming updates.\n\nPRO TIPS:\n*Flight Experience\n Using a Gaming Chair or just an office 360*degree rotating chair will enhance your experience. If you dont have one try to invest in one. Maybe even smuggle your Oculus Quest into work and use it during lunch or after work hours.\n Music. Having an extra set of earbuds to play your favorite space ship killing sound track is a must! Nothing compares to awesome flight maneuvers, guns blazing, and explosions while listening to your favorite tunes.\n Motion Sicknesses. To avoid motion sickness practice a break between every two runs. This doesnt apply to everyone but if your like my wife, youll need a break to recompose yourself.\n\n**for all the End Space Staff that put this game together. Incredible job, I look forward to upcoming products.\n\n***Finally, no one ever reads this far down. End Space Staff: yall have a sensitive team member (probably in the marketing/sales team named Jeff or Carl) that doesnt like constructive criticism, tell him Im very sorry. But Im not really sorry. **** you Jeff.\n\nHelpful | 782", "sincitykimberly22 days ago\ndon't look around too much\n\nOverwhelming when you first start,but,9 if you just focus and look where you want to go you will get it right away and the motion sickness goes away! Awsome!\n\nHelpful | 0", "TimNikiasJun 30 at 2:24 AM\nFun Action!\n\nIf you have an itch for Space Shooters, this one fits nicely. The missions, albeit all revolving around variations of \"Shoot All enemies\", take place in different vistas. Credits earned can be used to buy different weapons and missiles, which - once upgraded and installed on the ship - can be cycled through during a Mission.\n\nIt is a small and rather simple game, with short missions, and one or two AI bugs (in one Mission, a 2nd fighter accompanies me, if that one gets shot down, the enemy that killed it just heads off instead of attacking me, which made it impossible to \"Eliminate All Enemies\", as I couldn't reach it anymore. I just took better care of my companion on the next attempt).\n\nOverall though, it runs smoothly and is fun for a quick Space Fix and given the price well justified for what it delivers.\n\nHelpful | 1", "TVvillain19 days ago\nPoor control\n\nThe default is steering with your head wherever you look; super annoying and takes away from the experience of being a spaceship pilot using controls at hand.\n\nTake the default off & instantly get situated in a perpetual forward tumble without even touching any controls. If you suffer from motion sickness, your done at the gate.\n\nI could go on & on about how bad the controls are. There's some adjustments to play with, but nothing I found that wasn't compromising something else.\n\nBottom line is good luck finding pilot controls that are to your liking and comfort. Seems like a cool concept. I never even went back to try it again. Glad I bought it on sale\n\nHelpful | 0", "RauelRualbeJul 17 at 8:53 PM\n\nI had a problem with the craft drifting. I struggled with it for a few goes but then found something in the settings that stopped it. Thanks for the response though guy's.\n\nHelpful | 0", "oliver.austin.917 days ago\nEND SPACE\n\nLove the game play. Just wish it was a bit longer. Please make sequel ready to continue playing\n\nHelpful | 1", "P3achNutzJul 9 at 8:24 PM\nSo fun, cant wait for a multiplayer!\n\nThe controls are totally customizable and intuitive, bots are plenty challenging, good for some quick stationary fun, Ive been using it seated.\nOnly reason for four stars is no multiplayer!\n\nHelpful | 1", "beldurJul 24 at 10:14 PM\nUnfinished, but interesting start\n\nAfter a few missions its very repetitive, and not really challenging. I would love to see what the finished game might look like, but sadly it sounds like that wont happen. It just ends after 12 missions, and I did the last one a couple times because I thought it was a glitch that the next mission didnt unlock.\n\nLost a star for oculus not disclosing that its unfinished.\n\nHelpful | 0", "brandon.delalloJun 28 at 2:23 PM\nToo much motion sickness to be enjoyable\n\nI don't get motion sick a lot (either in VR or watching movies like 'Saving Private Ryan') but I can only play this about 10 minutes before I get too sick to continue. I *wish* I had returned it in the timeframe but thought my son might like it too. He, too, gets motion sick on this game.\n\nThe shooter does have cool graphics but is a pretty basic story.\n\nI do not know if this company makes other shooters, but if the motion sickness issue isn't persistent in those games, I would love to play them.\n\nHelpful | 3", "dude333Jul 12 at 5:48 PM\nIt's ok.. definitely not the best.\n\nIt was fun at first but it quickly got repetitive and boring. And the combat was kind of the worst bit, you would chase and shoot a enemy and it would just absorb the bullets. If you are willing to go through this then go for it!\n\nHelpful | 1", "StumanchewJul 27 at 6:50 PM\n3/5\n\nFun concept but it wasnt for me. The content is VERY repetitive with low replay value. Controls are great. I would love a full customization option.\n\nHelpful | 0", "KylanJul 20 at 6:07 PM\nGreat space sim\n\nI originally played this game in the GearVR. I was impressed with it. Now I have it on the Quest and still like it very much. If you are a space sim lover you should try this game,. Play it on a sitting position to get full immersion from the cockpit design.\n\nHelpful | 1", "rreed115Jul 1 at 8:57 AM\nCant get past the opening mission\n\nEvery time I try playing the game, it crashes. I touch the triggers, even the slightest and Im taken to the home screen. Only game Im having this issue with and I cant find any fix online. So until I get it fixed and updated, 3 stars is all I can give. Im willing to bet its an amazing game and will update when/if its fixed\n\nHelpful | 0\nDeveloper ResponseJul 17 at 7:47 AM\n\nThis is now fixed in our 1.0.6 update!", "syberkittenJun 20 at 4:43 AM\nnice concept, badly realized.\n\nmade me sick from the get go.\nperhaps it's good as an astronaut simulation,\nbut does not prepare you to the experience.\n\nits more if a dark and cold concept demo of flying in the void. makes you feel really lonely.\n\nafter 10 minutes there, no desire to come back,\nif it was free should get 2 stars\n\nHelpful | 4", "MykallCasias24 days ago\nPlease\n\nI was hoping you can change the thrust button to one of the grip buttons so I can do barrel rolls as I'm going fast. That's an easy fix that will pay off in strides.\n\nHelpful | 0", "DarkenerMay 31 at 5:42 PM\nCan't play?\n\nI was excited when I first saw this game, it looked fun, exiting, and something I'd really want to play. I bought the game, and was rather disappointed. I mean come on, the beginning cut scene is a 360 video that appears way too close too you, and it isint even pretending to be a 3d video. Honestly first impressions weren't great. Either way I disregard the tarible graphics in the main menu and continued on to the tutorial. Less to my surprise the cockpit was way smaller then expected and also used the same terrible shaders used in the main menu. You could argue that thats the art style of the game, but I just find it very distracting, and something worth complaining about. Anyway In the tutorial I started to mess with the controls, as anyone in a game they've never played before does. And I clicked trigger to fire my weapons, I clicked it once, I didn't get any lag, didn't even get a sound effect, the game just closed. I went again, started up the game, got in the tutorial. This time not attempting to fire until the tutorial told me too. Still though, the moment I fired, the game crashed. So this means I spent 15$ on a game that I can't play.\n\nIf someone can help me fix this issue, it would be greatly appreciated. (Please get to me soon though because I'm going to get a refund if I can't even play the game.)\n\nHelpful | 12\nDeveloper ResponseJul 17 at 7:51 AM\n\nThe crashing is now fixed in our 1.0.6 updates. Hope you can enjoy the game now and if not feel free to contact me via our support page.", "canadian87Jun 2 at 5:04 PM\nDisappointed\n\nGreat game, but there are not enough upgrades, not many levels and only one ship. Game has potential I will be waiting for upgrades.\n\nHelpful | 9", "jeffryd123Mar 22 at 2:56 PM\nIncomplete but fun\n\nI enjoy playing this game for a while. Pretty cool the way it works. Unfortunately they never completed it. Im sure that there are more worlds and more weapons. I actually spoke with the director of the game by email and he told me that he just put it down and never really came back to it.\n\nHelpful | 50", "STOOOPIDMONKEY96Jul 15 at 9:40 PM\nPretty awesome\n\nI like this game even though I get pretty bad motion sickness.\n\nHelpful | 0", "jinsincityJul 5 at 7:47 PM\nCool game\n\nAmazing first game I paid for. Graphics could be better but amazing game\n\nHelpful | 0", "Bender_2112Mar 25 at 9:49 PM\nAlmost perfect\n\nI like this game. It satisfies my desire to pilot a spaceship and take down enemy fighters. Kind of like The Last Starfighter movie.\n\nIt requires some dexterity to roll, bank, thrust, and brake - meanwhile toggling through missiles and cannons to shoot. But once you master the controls, its a fun ride.\n\nMotion sickness might be an issue for some. Didnt bother me.\n\nIt would be nice to have a rear view screen to see enemy ships attacking from behind.\n\nOther than that its an entertaining game.\n\nHelpful | 33", "JSamaMay 30 at 10:15 AM\nTotally worth the money\n\nGenuinely from how cheap the game was I thought it was gonna be some 4 stage, shallow kinda game, but I was happy to spend the money because I just wanted to be able to fly around in space. But oof... This game way exceeded my expectations.\n\nFirst time I played it I found the first 3 stages super easy, then died over and over on the fourth stage so stopped playing. But recently I started again and forced myself to learn the mechanics and finished it over a couple of days.\n\nNow.. the game is easy, and yes it might seem short given that I finished it so quickly... But really I see it like this:\n\nThe game is great so I wished there was more of it to play. Would have destroyed twice as many stages without getting bored I think. And really... It can't be that short, I mean, I remember finishing RPGs in two days... and I only expected four or five stages, so I was pleasantly surprised.\n\nThe game doesn't explain / train you up very well, and tbh I only just mastered flying the ship and utilising all its weapons by the last but one stage \nWhen I got stuck on the fourth stage it was because I hadn't figured out how to switch my weapons mid combat properly.\n\nThe whole game can feel hard to control at first, but... It should! Shouldn't it? I mean you're flying in space in a ship you've never controlled before. There could *definitely* be a more clear tutorial kinda section explaining the uses of certain functions and how and when to utilise them properly etc. (I was on stage 4 by the time I figured out proper throttle control / thrust / airbrake use) but honestly I think a more obvious tutorial would have detracted from the immersive feel of the game, and it felt super rewarding to figure the controls out by myself. If the controls had been too easy to figure out it wouldn't have been as fun.\n\nI genuinely don't think the average review score does the game justice. I think, yeah, it has loads of ways to improve, but on the whole this was worth every penny.\n\nI'd love to see multiplayer... Even just a 12 ships per team basic PvP would be awesome, but imagine the possibilities for different game modes incorporating destroyers or protecting stations etc. Even spectator mode would be cool once you died \n\nI would have loved to have seen more ships to buy / customise (to use my remaining points and would also encourage me to play through it again to buy the other ships) and again they'd be awesome for PvP (especially things like custom paint jobs)\n\nJust buy the game. Oh and Dev team - please make more. I'd happily pay the same again for another couple of stages and PvP \n\nHelpful | 2", "SgtREIPERJun 25 at 6:07 PM\nGood game but its missing something\n\nIn all honesty I played the game a few times the motion sickness was kick me in the butt but to be be honest I wish this had multiplayer I feel thats what missing\n\nHelpful | 0", "don.welknerJul 25 at 6:59 AM\nPretty cool\n\nIf you get motion sickness this is not for you. Lots of shooting and rolling.\n\nHelpful | 0", "gamepugboiJul 28 at 1:08 PM\nBest game I have played\n\nThis is the best game I have played in a long time. 10/10\n\nHelpful | 1", "ChipylunaJun 6 at 3:11 PM\nMy own spacecraft\n\nI love this game, I was so worried that it would give me motion sickness, and was extremely happy to find out it didn't! I use my head movement to steer my ship, I think that helps. I find the game not too easy and not too hard, but certainly challenging in lots of places!\n\nEdit - need to sort glitch, everytime I push the trigger it sends me back to my Oculus main menu. Just happened 3 time in a row.\n\nHelpful | 2", "Hendrickson7478Jul 22 at 9:03 PM\nMotion sickness\n\nNot playable in any fashion, the controls and rapid movements mixed with headset motion control creates an unplayable game.\n\nHelpful | 0\nDeveloper ResponseJul 23 at 2:58 PM\n\nHave you tried some of the other control settings? There are a lot of different options to make the experience more comfortable.", "Randall-WaterhouseMay 6 at 9:14 AM\nLots of fun, ends abruptly\n\nJust when I was getting good, I seemed to have found a roadblock in the Minefield map, escorting the Malevolent out of danger. After I escort/defend/blow up everything, there's one fighter on my HUD that never enters the battlefield and I can't reach no matter how long I boost towards the little red diamond. I've beaten the level twice now but end up having to quit because finishing is impossible. Kind of frustrating!\n\nOn the good side, I do feel like I got $15 bucks worth of entertainment from it. Is the missing fighter in the minefield map a bug? Is it because that's all there is and they want to leave me wanting more? If that's the case, mission accomplished because in fact I WANT MORE. Lots of fun, as long as you don't expect to make playing End Space a long-term habit.\n\nHelpful | 2", "damnedcaptainApr 3 at 11:49 AM\nA pretty good space/dogfight simulator..\n\nI applaud the devs for getting this game onto the Quest, albeit in a minimal form. Its a good simulator. There are a ton of control and comfort options, which took me many replays before I found the right combination. Its a nice production and has some great moments throughout the various missions. I guess what keeps this from 5 stars is that the devs seem to have given up on it. No updates in like forever, and no DLC or future add-on content to speak of. Thats too bad because with more missions and a few more customizable options, Endspace really could be the space simulator everyone has been hoping for. Just not quite there, at least in this iteration.\n\nHelpful | 4", "SranClanMay 29 at 7:19 PM\nSranClan\n\nGreat interactive game and graphics. I absolutely love this game, it's one of my favorites. The first 3-4 stages were easy to complete but now I can't seem to pass this next stage . It's a little frustrating but I like how its not so easy to finish. I like the challenge. I highly recommend this game, it's worth every penny.\n\nHelpful | 0", "UndeservedMay 4 at 5:27 PM\nEnd of space, short on time\n\nPhysics and feel were good. Once I figured out the best controls for flying and targeting (head tracking) I finished the second half of the game in just a couple hours. More missions needed. Easily playable. Cheap price for cheap thrills. Worth what you pay for.\n\nHelpful | 1", "Juan-117Apr 28 at 4:50 PM\nBest Space Simulator!!!\n\nIt takes a bit to figure out the controls and what set up works best for you. I can understand the confusion of some of the reviewers on here but dont let that discourage you from purchasing the game! It is such an amazing experience once you get the hang of it! I waited a long time to purchase the game and finally bought it once it was on sale. Oh man I wish I would have purchased this game earlier because it is so much fun which I have been missing out on! It is a must have for all space enthusiasts!\n\nHelpful | 4", "gosseynJul 15 at 9:19 PM\nawesome game\n\nSo happy this was made for Quest. Liked it on GearVR. Love it on Quest\n\nHelpful | 0", "Azazel08May 3 at 8:19 AM\nMuch improved from the Go version\n\nI really liked this game on my Oculus Go, but the controlls are less precise. For this reason, I never could finish the game. I was stuck on one level I could never defeat. To my surprise I beat that level on my first try using the Quest. It wasn't until after that, I realized why. The controls are so much more comfortable and precise in this new Quest version.\n\nHelpful | 3", "sellercApr 10 at 8:16 PM\nHas potential but pretty empty\n\nThe graphics and gameplay are pretty slick. But there's zero story, just a collection of dull missions that go to nowhere. I finished the last mission and that was it. No fanfare just an abrupt ending. Combine the gameplay mechanics with a story and some cutscenes and you'd have a great game. Oh and no unlimited missiles unless you're going arcade.\n\nHelpful | 4", "DrtoolJan 11 at 9:05 AM\nNew to VR rookie review\n\nOk getting use to the controls was a bit of a challenge for me. I fly drones so have to set controls up to match. Once I did that a little better the game became more fun. The flying around and battles is so cool, graphics are great but the quest has been my only try at VR. Very immersive and good time spent playing. Worth a try.\n\nHelpful | 105", "steve.waddy6 days ago\nGame is great until the motion sickness\n\nThe game itself is fun and flying and shooting is obviously awesome but I only managed about half an hour and three missions before the motion sickness got too bad. A shame because I loved the concept but it turns out I'm just not meant to fly cool space ships\n\nHelpful | 0", "BangieboyApr 18 at 1:50 PM\nCompetent and enjoyable space shooter\n\nDelivers what it promises. Controls are everything in these types of game and although I hated the default settings you can tweak them so I found a setting that felt right. Graphics are decent, although better internal cockpit textures wouldn't hurt. Dogfighting is spot on and feels natural once you get the hang of it. The gameplay reminds me a little bit of the old X Wing/Tie Fighter games for the PC, which is not a bad thing. The weapon upgrade system is so so, but doesn't harm the overall gameplay experience. All in all, a decent, reasonably priced Quest game that looks good, plays well and if you like space dogfighting you can't go wrong here. This goes on my list of top 5 best Quest games. Also, kudos for cross buy.\n\nHelpful | 4", "Riley_611Apr 1 at 11:14 AM\nPretty good!\n\nIt was a really good experience other than the motion sickness I was experiencing, but I quickly got used to it. The controls were relatively easy to get used to also. The only thing that I would like in the game is a longer story mode or a mode where there are endless waves that increase in difficulty as you complete each wave. That would make this game a 5 star game.\n\nHelpful | 2", "matroidMay 1 at 2:37 PM\nBrilliant Gameplay, but ...\n\nI intensively played Elite Plus, Decent, Wing Commander, Freelancer and Darkstar One. I like End Space in terms of gameplay (with the default control settings!) more than any of these! I further enjoy its Arcade-style (it's not a Simulator like X10) with not too complex, but nicely arranged missions. I give it 5 stars, because I would give it 6 minus 1 for some downsides: just a single ship, only five simple and quite cheap weapon upgrades, and there are some minor bugs here and there. Also, some big enemy ships can be destroyed too easily, with standard weapons. I saw that there is just a small developer team, so really a great job! However, please create a follow-up by adding the missing pieces: more ships and weapons (even some super-expensive bombs that are required for destroying really big enemy ships), more missions, extended story, perhaps even a community highscore-list for \"finish mission X in as few seconds as possible\". These things would add great long-term-fun. Beside these things, as said before, the most important part, the gameplay, is already achieved in a brilliant way! End Space is definitely worth its price, even in its current format!\n\nHelpful | 2", "RaventheGraveApr 30 at 12:11 AM\nFun\n\nTook me a little getting used to in the ship handling Dept but once I got it down it's actually really fun. Graphics are great, I always feel like I'm actually there flying through space. So easy to get lost in the VR world.\n\nHelpful | 4", "breadstick20000Mar 23 at 6:10 PM\nNice I guess\n\nI only bought this game so I had something to do while Coronavirus takes over the country.so far I like this game. However it gets boring sometimes trying to get enough points to upgrade your weapons.\n\nHelpful | 7", "BrandyonTXJun 7 at 9:16 PM\nBest space shooter on quest.\n\nIt took about 15-30 mins for me to get a handle on controls, but once I did I couldn't stop. I'd love to see games expand on this model.\n\nHelpful | 1", "mwr2700Apr 11 at 9:24 AM\nNice game however ....\n\nIts easy to get up to speed and finish all the missions but there are waaaayyyyy to few missions. In its current version it would be perfect as a freeware game to get you ready to pay for an upgrade but pretty pricey as it is.\n\nHelpful | 3", "Ultimablaze08May 9 at 7:16 AM\nGood but want refund\n\nGood game but want refund because It is hard to control and I get Motion sickness easily\n\nHelpful | 3", "alon.sabiApr 11 at 6:41 PM\nA great game by a single developer\n\nI usually don't write reviews, but I've read some of the bad reviews about this game, and I understood from the replies that this is a one man show project, so I decided to give it a try anyways.\n\nI was blown by the amount of effort this single developer put into this game. Yes, you can complain about the lack of deep story, and you could wish for better graphics (although I think it's great).\n\nAs a community we need to support talented developers who put their neck out, and provide us with the best experience they can.\n\nThe gameplay is smooth, there are many options to fly the ship and shoot, and it's a lot of fun to play. Not to mention the breath taking environments. It also does not make me feel dizzy which is a miracle in itself.\n\nThank you for taking the time to build such an awesome space shooter experience. Reminds me of wing commander \n\nHelpful | 3", "psully4114Jun 28 at 8:15 AM\nUnplayable\n\nI was excited to see the new content. Instead it crashes when i pull the trigger.\n\nHelpful | 1\nDeveloper ResponseJul 17 at 7:47 AM\n\nThis is now fixed in our 1.0.6 update!", "liquidneckJan 21 at 4:56 PM\nReally fun buuuuuuuut\n\nMan. Was waiting for a game like this. Finally got my hands on it. So much fun. Very involved with motion. I mean it can get you really motion sick if you are prone to it. I must really suck at it because i can not get past the 5th level. Maybe i need to play the 3rd level 30 times to get enough cash to upgrade weapons. But by the 6th time i play the 3rd level Im bored to tears. Maybe its just me but i suspect other people may be having trouble getting on the learning curve. Other than that, its fun. Very well programmed, and a whole head experience.\n\nHelpful | 32", "Peter70theGermanJun 11 at 7:15 AM\nBattlestar Galactica Vr\n\nCaptain Apollo: please upgrade this amazing game!!!\nLt Templeton: quick,quick,quick!!!\n\nHelpful | 0", "dale.capelouto.94Jun 20 at 6:34 AM\nGreat game for experienced players\n\nNot for the faint stomach.\n\nHelpful | 1", "lwislaMay 20 at 10:18 PM\nLiked the game\n\nCliff hanger ending though. It looks like there should be more but it just stopped...\n\nHelpful | 1", "Tony.DiIuorioMar 14 at 10:53 PM\nDecent, but not very deep\n\nFirstly, it's a good game. If you like shooters then yeah. The game mechanics are really cool, steer in 3D space with thumbsticks, aim your guns with HUD by looking at targets (or vice-versa if you like).\n\nThe storyline is basic. Enemy fighters appear at preset times, and you follow orders by the commander by radio. Each level is different but the same.\n\nAfter 4 missions I could finally afford to upgrade my fighter! But sadly, there's only 2 upgrades each for.missiles and guns.\n\nIt's like my topic sentence says, not very deep. No other customization or upgrades, none for engines and shields, and shoot the enemy fighters every level.\n\nI haven't gotten past the 5th mission yet, it IS challenging.\n\nHelpful | 3", "Discobear6405Feb 22 at 10:54 PM\nWe want the beats!\n\nThis game is awesome and fun, worth the money in my opinion. But, and here's the kicker; there's no music to keep you going! It's just space sounds and the ship sounds! Complete silence (mostly). If you could please play music during the missions, or add a beat in the background, like in the red space mini game. It would make this game more emersive and fun.\n\nHelpful | 3", "bryan1070Apr 22 at 9:18 PM\nNeed more.\n\nHeck, I'll buy an expansion pack.\nThat should tell you why only 4 stars. Give me new missions I'll give you 5 stars ;)\n\nHelpful | 0", "tusamiFeb 19 at 9:20 PM\nI hope to update to a better review\n\nAs it is. There just is not enough instructions for the missions before or even during the mission. It makes for a frustrating experience, especially when the graphics are so superb. Please developers get in touch with me because I would like to make this a top notch game. With very few and minor additions it can become that.\n\n\nHelpful | 21\nDeveloper ResponseApr 29 at 2:17 PM\n\nFeel free to contant me at justin@endspacevr.com!", "Nightflame456Jul 22 at 10:40 AM\nCmon, its Straight Up Star Wars\n\nUnbelievable job, developers! The maneuverability and the spectacular piloting training allow for an amazing experience, like youre Han Solo.\n\nOne minor problem that isnt a problem with the games content, but with the editing of the content. In other words, you cant change the difficulty.\n\nOtherwise, this game is a must have for all the spaceship duel fans out there!\n\nHelpful | 0", "KURO347Mar 9 at 2:17 PM\nGenerally a fun time\n\nHad a lot of fun. Price tag is a bit high for how short it is. But has decent replayability with the different weapon options. Just wish there was a bit more. A downside is of you get motion sick this game won't treat you well. Overall a good time I feel it is worth a purchase if you want a decent space vr game\n\nHelpful | 1", "KradleRckrWeApr 1 at 5:16 AM\nIs that all?\n\nMe and my girls are having fun flying and love the graphics. We would love a bigger variety of upgrades and other missions... I hope there are more games like these to comes.\n\nHelpful | 0", "matthew.caldemeyer.5Jul 26 at 12:29 PM\nIts pretty good\n\nI have played it for a little bit and I like it but if you gonna play it sit down\n\nHelpful | 0", "mastermanagerApr 25 at 10:20 PM\nThoroughly Enjoyed it!\n\nIve been looking for a cockpit shooter and this game is reminiscent of the arcade cockpit-style games I played growing up in the late 80s and 90s. Great, fun action! Hoping for a sequel.\n\nHelpful | 1", "SunRayNomadFeb 9 at 4:06 AM\nA blast\n\nIf this game could be reskinned with classic Wing Commander ships I would gladly give you all the money in my pockets!\n\nThat said, this is the kind of game I brought VR for. Its immersive, dogfighting is fun, controls intuitive and there is nothing like looking around your cockpit for the next target whilst rolling at full speed in the opposite direction.\n\nI am impressed and want more.\n\nHelpful | 3", "klattin3Apr 25 at 7:00 AM\nBetter sit down for this......\n\nHoly crap, do not drink alcoholic drinks and play this standing up, you won't make it......one early level is a little tricky but not impossible to get by and the rest is easy.\n\nHelpful | 0", "grimsyxJul 22 at 9:36 AM\n\nThe only problem I had was getting used to the controls, its weird to use the left joystick to turn, the controller to aim and the right joystick to shoot\n\nHelpful | 0\nDeveloper ResponseJul 23 at 2:59 PM\n\nIn the settings menu, you can customize all the controls to how you would like them.", "Baddog181Feb 29 at 4:58 PM\nAwesome game BUT DEVS PLZ READ\n\nThis is an excellent flying shooter, genuinely loved every second. My only complaint is the thumb stick controls, having the roll on the opposite stick as the pitch was very disorienting. The natural movement of a stick is pitch and roll, then yaw would be through the feet rudders, if there was an option to have a traditional flight stick controls then the rudder/yaw with the throat would be much more intuitive IMO would be 5/5 stars\nAbsolutely loved the game though!!\n\nHelpful | 2", "RichWrongMar 29 at 7:39 AM\nNeeds a sequel!\n\nThis is a great game, great graphics and game play with some brilliant missions.\n\nIt does however need more upgrades other than the missiles and guns. Maybe shields, new ships extra guns or missile slots.\n\nWhen the sequel comes out or the add on Ill 100% get it because this was well worth the money.\n\nHelpful | 1", "nishruu2Jul 23 at 8:19 PM\nvery fun\n\nfun and not too complicated. worth the price on sale for sure\n\nHelpful | 0", "vysemMay 1 at 6:38 AM\nAmazing\n\nAmazing space Flight simulatore...well graphics and gameplay, Maybe too short.\nOnly One question...when come out a sequel of story?\n\nHelpful | 1", "Biteki_ShinobiMay 6 at 8:12 PM\nVery Limited\n\nCategories for weapons are limited.\nLimited levels with barely a challenge.\nRegret buying because of the lack in content.\n\nHelpful | 0", "russliotApr 7 at 7:21 PM\nMove over buck rogers\n\nMind blown takes a few runs to get the hang of things and build up your pot to get better weapons by repeating the easier levels and gaining mastery of your ship but oh my gosh when you put it all together its totally sick\n\nHelpful | 1", "VignosiaFeb 21 at 2:53 PM\nChallenging and a lot of fun\n\nGame controls are great. Not like anything else, but I thought they were intuitive. Weapons control took more effort to figure out than the flight control. If I have to jump out during a mission it has some odd effects on my headset, I loose sound and control when I resume. Have to reboot to fix it. Other than that, I really like the game.\n\nHelpful | 0", "SpecialCircumstancesJan 30 at 5:46 PM\nGreat shooter - but ends too soon\n\nJust when youre getting into it, you run out of levels. Levels are challenging, and not for the easily sickened! Sometimes the objectives arent clear and take several deaths to realize youre destroying the wrong things (sometimes green is GOOD other times green is what you are supposed to SHOOT - and mixed within the same scenario). Good mechanics. Wish the dashboard gave me more info about good guys / bad guys.\n\nHelpful | 10", "rmib200Apr 28 at 7:55 PM\nNeeds mini games\n\nThis game will be so boss with action levels on rings of asteroids, bosses or full ship customizations. Great job!\n\nHelpful | 1", "kurosakiedisonJul 25 at 10:44 AM\nGood graphics but easy to get dizzy.\n\nNormally I don't feel sick in vr games that easy, but controlling the game with my head in this kind of speed is one of the worst experiences I had so far. Hopefully... some update can improve it.\n\nHelpful | 0", "CaptainFandangoJul 8 at 5:49 AM\nBroken\n\nIve always disliked reviews like this, but I totally get it now. It seems harsh writing a review of a game that I didnt get to play, but thats the point isnt it.\n\nThe game kicks me out to the lobby every time I pull the trigger and the controls seem to be set so that the Craft is constantly spinning no matter what I do.\n\nWith Oculus curation policy I find it astounding that a game like this has slipped through the cracks. Unfortunately, its an instant refund for me which is sad because many people have got the game working seem to enjoy it...\n\nHelpful | 0\nDeveloper ResponseJul 17 at 7:46 AM\n\nThis is now fixed in our 1.0.6 update, please give it another try and I hope you enjoy playing End Space!", "toothlessthedragonApr 23 at 10:11 AM\n\nDont like the controls should use joysticks\n\nHelpful | 0", "stealthmutantMar 16 at 5:37 AM\nGreat game so far!\n\nI have moved through about 8 levels (missions).\nA couple notes though. I had to play one scenario about 10 times to be able to get money to buy upgraded missiles and guns. Without them it is virtually impossible to get through the mission to destroy 3 satellites. The satellites have asteroids with missile batteries on them, and there is a wing of enemy fighters also. The satellites are a good distance away from each other. You need the extra firepower to quickly dispatch a satellite and then move on to the next. If you use too much time the missile launchers and fighters will destroy your ship before you can get to the 2nd one.\nGreat game.\n\nHelpful | 1", "crompvivJun 20 at 8:45 PM\nThis is broken on Oculus quest.\n\nMain menu annoyingly rotates world 90 degrees left every time use the controller thumb sticks and game crashes every time I press the fire triggers in the tutorial. If game control options are set to look for target and controller for flight control the ship tumbles in a forward roll that can not be controlled with the controllers. Looks good and i would live to play it but it is completely broken for use on my Oculus Quest.\n\nHelpful | 2\nDeveloper ResponseJul 17 at 7:49 AM\n\nThis is now fixed in our 1.0.6 update", "MaXiMuM-VDec 13 at 6:53 AM\nI dig it on the Quest.\n\nI wish the graphics were a smidgen better , but overall its immersive, and fun as a sitting, chilling, flying around shooting stuff game. Runs smooth and satisfies the flying around space quick fix. Once I got used to the controls it got even more fun, I will be playing it regularly.\n\nHelpful | 22", "tdruegeFeb 22 at 6:03 PM\nGreat Game\n\nBy far one of my favorite games. If you put Star Wars music to it, then you would feel like youre in the fight. The key is easy to control and after a few minutes the firing controls are easy.\nHighly recommend.\n\nHelpful | 0", "NickKrispyFeb 27 at 10:47 AM\nVery limited on content\n\nIts a wonderful game and experience I just thought there would be more than one sector, replay able if you havent touched it in about a week or two\n\nHelpful | 1", "David.Cameron78Apr 5 at 2:05 PM\nNot bad\n\nNot bad at all... Addictive... More choice of weapons would of been a great idea\n\nHelpful | 0", "PhoenixPhenomenalJul 26 at 11:50 AM\nControls\n\nThe controls are really hard to learn and I wish they had more options on how to control the space craft.\n\nHelpful | 0", "Len-LarsenApr 14 at 11:48 PM\nAwesome Game\n\nFelt like I was sitting in the Millennium Falcon.\n\nHelpful | 0", "DancesWithNoobsNov 21 at 6:12 AM\nIt has potential... but...\n\nIt has potential... but you cant really use strategy against a mindless swarm of ships and missiles.\n\nMessier level is just insanely frustrating and broke the stride of gameplay for me.\n\nI dont feel like Im training to be an elite fighter pilot so much as Im just being used as cannon fodder for the endless waves of ships and missiles on this mission.\n\nI even gave it a chance with an Xbox One controller. That made playing the first few levels a lot more enjoyable... but then the difficulty ramps up way too soon and makes it a miserable replay grind to just skim through.\n\nIf seeing a restart mission screen is your thing... enjoy.\n\n(Having read the other reviews and knowing now that this is one person working on this... its impressive. Please add a way to adjust difficulty or something. Maybe allow for less ships per wave in Messier or at least give a better hint/strategy than shoot the missiles first.)\n\nHelpful | 44", "AshmanRoonzDec 27 at 9:09 AM\nI liked it, but...\n\nIt's too easy, and too short. Besides that, it was pretty fun. For $12.50CDN it was worth it for a 3 hour experience. The game is comfortable, controls are fun with head aiming and joystick steering. The graphics and sound are nice. I'm not sure there is much replayability; doing easy missions over and over would get boring. I hope there are some DLC. I hope maybe the developer team of two brothers can team up with some other developers to make multiplayer? Maybe some new ships to customize?\n\nHelpful | 16", "12vdcJan 16 at 7:54 PM\nPoint form Win fail\n\nWin- great controls over the ship\nFail- Your hands dont move with your controllers taking away from the immersive experience.\nWin- the visuals are very good\nFail you are forced to be a girl\nWin- the ship looks cool\nFail- the ship is not very fast\nWin- the MPC is very realistic\nFail- Zero story line\n\nRecommendations\n-have free motion of hands to control options for the ship to scan the region select weapons and then once the hands are inserted into the control area then they become primarily weapon control.\n-make it exactly like Galaxy on fire for gameplay\n\nHelpful | 12", "monstermatt.markusFeb 24 at 11:14 AM\nMoves flys well\n\nI didnt get it at 1st you actually have to move your head to change the view to stay on target  Ill get better at it and probably like it even more\n\nCool graphics\n\nDefinitely need a Star Wars games like this\n\nHelpful | 0", "a_hoomanApr 4 at 7:58 AM\nOne of my favorites\n\nThis game is perfect if your looking for some star wars or star fox like game!\n\nHelpful | 0", "mattjohnholmesJun 20 at 2:42 AM\nToo basic\n\nBasic\n\nHelpful | 0", "VReSwatiniFeb 15 at 1:04 PM\nHands down my favorite VR get so far\n\nThis is likely my new favorite game of 2020! I was surprised how intuitive I found the controllers. Using the thumb stick to aim shooting while using my head for directional movement was much easier than I would have guessed. B button to speed up, trigger finger to shoot my blasters and middle finger trigger to launch rockets was easy to get down after trying the tutorial. This is a game I look forward to beating over the next few weeks of play. I assume they will release new missions which will give me months of game play.\n\nI definitely recommend EndSpace VR for the serious RPG players out there.\n\nHelpful | 2", "THEREX1Feb 26 at 5:38 AM\nGreat game\n\nEnjoyable game play and a challenge to advance. Controls take a bit of getting used to but I've only been playing a short time. Will update in a few months time when I've had a better look.\nUpdate brilliant and solid game play. I had a few issues passing some levels but once I realised not to forget the objective of the mission and get caught in unnecessary firefight these missions where completed. Love the game well done Devs\n\nHelpful | 0", "Cheap_shotMar 16 at 8:34 PM\nIt'd be nice if it was longer\n\nNot long enough\n\nHelpful | 0", "RadioBarberJul 17 at 4:05 PM\nRadiobarber\n\nNot happy so far no tutorial to understand no clue whats happening\n\nHelpful | 0", "Chally3411Feb 24 at 9:38 AM\nGreat Game\n\nIf you like flying fighters this is a good start. You play sitting down which is a bonus and can set it so you fly wherever you look. So all you have to do is concentrate on your weapons and locking on.\nIts a great game for someone starting out in VR\n\nHelpful | 0", "k1llhunt3rApr 27 at 1:48 PM\n\nHorrible control\n\nHelpful | 0\nDeveloper ResponseApr 29 at 2:14 PM\n\nHi, have you checked out the Settings page? There are so many different options for controls you have to find something you like. We even support gamepads and HOTAS if that's your thing.", "SpeloFeb 16 at 2:15 AM\n0 stars dont buy\n\nIts shi**, utter sh**, controls are atrocious gameplay even worse dont buy this game it's so bad I cant describe, constant crashing and bugs, no story DO NOT BUY THIS you will get more entertainment from unclogging a toilet\n\nHelpful | 8", "iltac38Feb 5 at 11:41 PM\nGood game but...\n\nI just start to play to this game, it is quite impressive but I would have expected a better immersion with use of controllers to drive the space ship instead of using the head movment.\n\nHelpful | 2", "phillyg2020Feb 10 at 10:39 AM\nWow, just what I was looking for!!!\n\nI was looking for a game I could play sitting down on my exercise bike, and wow!!! This is perfect! I definitely feel like I'm flying in space shooting down ships and turrets and yes this game can give you some motion sickness...but that makes it even better! I use the look to steer and controllers to shoot and that gives me the least amount of motion sickness. The developers should team up with VZ Fit and make the most epic space exercise bike simulator!!!\n\nHelpful | 3", "Drake_NobleNov 29 at 2:05 AM\n29 Nov 2019 epic\n\nThose reviews saying this is easy are wrong.\nGo to the options and set the controls to joystick and thumb stick, and you'll get the space piloting experience.\nYou can even further the hardcore experience by setting it to Jet pilot style with inverted or even only shooting dirrectly forward of your view.\n\nNow to a real review, great detail (not the best but pretty good).\nThis isn't for people who can't handle sitting in a real plain but people can adapt the sea legs n not get sick from doing a 980 dog fight or just turning to get to the direction you need to jump.\n\nSound design is good, feedback on target hits is quality and the playable experience is not as short as the people who use the baby mode by just looking at things to shoot them say.\n\nThis is an easy fun simulation or a hard dog fight depending on your settings, the quests have back story and you're important.\n\nPlay how you will but don't judge a game for not playing at the setting that suit you. Always check the settings when you enter a game n judge it's mechanics.\n\nI haven't finished it and I'm still chugging along the hardcore dog fight experience.\n\n9/10\n\nHelpful | 35\nDeveloper ResponseDec 16 at 8:37 PM\n\nThanks for the great review and really happy to hear you enjoy the game. End Space is a labour of love for my brother and I. I love to get this kind of feedback!", "Xanathar865Feb 20 at 9:13 AM\nVery good game\n\nThis game is very good.\n\nHelpful | 1", "PoconoPeteApr 13 at 8:48 PM\nI Like It\n\nNot a must have unless you love flying combat. Then get it cause there isnt another game like it for the Quest. A good solid game and if you like flying dog fights youll enjoy it. Best of all you can play sitting down. Wish this was mixed in with Vader game. Oh wait I can do that myself! Perfect!\nUpdate: Shelved this for many months playing the hotter titles. Glad I came back to it. Easily worth the price. Been having a blast with it for a week now. Ignore the few negative reviews. The other reviews are spot on. Use a swivel chair for more fun. Yes it could be better. Wish a major studio would pick it up and enhance it. With more story upgrades unlocks challenges missions etc it would be perfect and worth twice as much.\n\nHelpful | 1", "TalosRobotMar 2 at 8:00 AM\nEndspace\n\nFinaly, I'm in space. Love VR, love this game I'm in side ths ship. I will never play a game on a TV again.\n\nHelpful | 1", "SuperCosby117Feb 4 at 4:51 AM\nElite Dangerous for Quest\n\nWhile not as big as Elite Dangerous, it does fill the space fighter game that VR was missing.\n\nHelpful | 0", "MightyQuinnJFeb 23 at 12:21 AM\nSuper fun space battle game!\n\nI love the space junkys type feel you get from this game! The graphics are really good and I was able to pick up on the controls pretty quick!\n\nHelpful | 0", "Clutch800Jan 8 at 8:45 AM\nPretty fun SPACE SHOOTER, meh controls\n\nVisually appealing, fun shooting and controls buuuut\n\nTO THE DEVELOPER\n\ncan at some point you implement the option to aim with your controler? I was about to refund this game but I pasted the time limit .\n\nMy ideal set up is on the left hand I can control the ship, with my headset I'd like to be able to look around and with the right hand I'd like to aim the turrets, is greatly appreciated it \n\nHelpful | 0", "billy.rockstar56Mar 13 at 11:20 AM\nEnd game\n\nLove it want more longer levels\n\nHelpful | 0", "Duncster-swcJan 17 at 5:35 PM\nSooo good!!!\n\nWhat a great title.... one of my favs in VR!!! A fantastic sit back and kick butt title. Graphics are great, and the levels are challenging.... either get the job needed done, or go after everything that moves. :)\n\nOnly thing that would be a nice touch ,would be to see your high scores (and world wide) for each level... so to give the levels a bit more replay value.\n\nHelpful | 1", "katrinaukApr 29 at 5:50 PM\nWow\n\nReally good looking game! Feels like you're sitting in a spaceship :)\n\nAlso any idea how you play the red space mini game?\n\nHelpful | 0", "sbrandon111Dec 21 at 3:47 AM\nAwesome space shooter\n\nOnce I got the hang of the look-to-steer control scheme, this game just clicked. I was having so much fun swooping around tracking enemies and blowing stuff up. Kudos to the developer, I totally recommend this game to anyone that likes arcade style space shooters.\n\nHelpful | 0", "deadmeat300Aug 29, 2019 at 2:04 PM\nMeh\n\nOK, so this was the genre I was really looking forward to when the quest came out. Space flight sims are what vr should be made for.\n\nBut I must admit I found the experience somewhat underwhelming.\n\nThe control is cleverly done and once I got used to the freelook function, Easy to use. But I got no sense of skill or challenge in the dogfighting. There is no sense of manoeuvring to get on your targets tail to get into a firing position then staying with him as he jinks about trying to escape. Look until you see a ship. Aim. Fire. Ship explodes. Rinse. Repeat. A lot. Waves of enemy targets come at you a half dozen at a time, and you kill them. That's the game. There's not much story, no surprise, no sense of being in a war with living breathing characters. It's space invaders 3d.\n\nFor 10 I guess it's a fun enough time killer. The graphics are pretty (the cockpit is actually gorgeous) the explosions satisfy, and you occasionally get a sense of scale and movement when strafing a big ship. But if you were hoping for something in the x wing / wing commander / freespace / tachyon genre then you'll be disappointed. It's full arcade, with nothing of a space flight simulator.\n\nStill, I hope its the first run at would could be a fantastic application of the quest. It's a start.\n\nHelpful | 748\nDeveloper ResponseAug 30, 2019 at 12:18 PM\n\nSorry you were looking for more of a sim, but you are right, End Space is designed to be on the arcade side of the space spectrum. X-Wing / Wing Commander / Freespace / Tachyon were all favorite games of mine growing up and heavily influenced the development of End Space. However I chose to go for something a little more approachable with End Space for people just getting into VR and space games. It's just me working on End Space and to create something the scale of Wing Commander isn't possible for me yet, but that is the future goal. I thank you for your support, you are helping me realize my dreams of creating the next great game.", "Airwolf523Dec 8 at 12:10 AM\nBeautiful graphics..\n\nFun game, decent story. I wish you could map the controls on the quest controller like you can a bluetooth game controller. That said, after i got used to flying by gaze and tilting my head in the direction I want to go, it gets pretty immersive and fun...this is not a game for people who get vr sick though. I'm on my second playthrough of the story, and still enjoying the experience. Would like to see more from this dev...great job.\n\nHelpful | 2\nDeveloper ResponseDec 16 at 8:32 PM\n\nGreat thanks a lot! Sorry you can't remap the Touch controllers. I haven't figured out a clean way of doing that yet because of the use of the controllers rotation as a input as well. Still need to figure that out.", "Centurion11095Feb 23 at 1:00 PM\nCenturion 11095\n\nOnce I get used to the controls this will be an amazing game. Already loving it.\n\nHelpful | 0", "car-losJan 31 at 4:20 PM\nAmazing game...\n\nWith room for improvement\n\nHelpful | 0", "maximilian.kaneApr 14 at 6:05 PM\nThis is LEGIT!!\n\nThis game is a lot of fun and the controls are easy to adhere to. Free look is great, learn to look correctly to steer and turn your right hand to hone in on enemies. This is YOU inside a arcade space shooter and it legit feels like Ive warped into an arcade space shooter, myself. Sit down, relax and BLAST the enemy ships!!! I really appreciate the DEVS work here but my only hope is that they add more atmosphere with the nebula/planets/stars. More movement....etc. I would love to see an active star in action with flares and bursts while flying in space above it.\n\nHelpful | 0", "thetigers01Jan 26 at 7:44 AM\nEnd space\n\nExcellent game can play over and over again ?\n\nHelpful | 0", "AlphodeusDec 21 at 4:47 PM\nNot enough control options\n\nWhile the core gameplay seems fun, the limitations of the control options make the game hard to recommend. The basic ones make you use your head to steer which is very confusing and makes it almost impossible to look around in any way. The mition controls are not responsive enough. The joystick is fine for steering but it's difficult to boost and rotate your ship at the same time. Aiming options when using the joysticks require you to either shoot straight ahead or use your head to aim which in my case caused terrible motion sickness. Might not be an issue for some, was a huge one for me.\n\nHelpful | 1\nDeveloper ResponseDec 23 at 9:18 AM\n\nWhat other control options would you like to see? There are already so many. You can even use a joystick over USB if you want, or a bluetooth gamepad. Feel free to email at justin@endspacevr.com with your suggestions.", "flybye66Feb 9 at 10:01 AM\nEnd space\n\nFun for a short while, then It becomes routine.\n\nHelpful | 0", "jer_just52Jan 19 at 8:25 PM\nEnd space\n\nThis app is amazing I am a big fan of sci-fi and was kind of sceptical about the game at first because it seemed really easy to get motion sickness but the flow of the game makes it have no motion sickness at all.\n\nHelpful | 0\nDeveloper ResponseJan 29 at 1:45 PM\n\nGreat to hear!", "Icepick869Dec 31 at 7:41 AM\nGreat graphics and fun\n\nReading another review and the author's reply, this is exactly what the creator was after. Fast, fun and sharp.\nThat said it is also a bit short and challenging only in a few places. Not intended as a sim, so if that is what you want wait for another game. For me it is worth it and I hope to see more from this game and it's creator.\n\nHelpful | 1", "megamehmehoFeb 22 at 7:00 AM\nGarbage\n\nFirst 5 mins hated it I bought in a pack and tried to refund it separately note: I had already bought other game in pack\n\nHelpful | 0", "chiquita.barrazaDec 21 at 1:48 PM\nIf you want a space shooter....\n\n...This is your game. It is so much more visually impressive than I was expecting. Holy cockpit batman. I've played w the settings so steering is all in the controller and not w your vision. Makes it more challenging, more realistic, and less sickening to play for me. Overall, super impressed and the kind of content I hope to only see more of. You can tell this dev cares about this game from how it looks and handles immediately.\n\nThat said, I'm a big motion sickness sissy, and I can't play very long without having to take a break. Store says moderate comfort and its right. Sitting during play helps but this is a quick shooter with great options to roll and loop and avoid fire, which A. great job dev, but B. Potential for a puke fest if u dont take time to really learn the controls. I'm not sure if I have the ability to fully finish the game for that reason, but hurry up and take my money, because this game is excellently made and I'll enjoy it plenty in short bursts.\n\nHelpful | 5", "dr_pureDec 30 at 9:04 PM\nTotally worth it \n\nWell To be Honest if you have 15 bucks then go and get this game guys... It will be totally worth it  Space exploration like never before ... Very Arcade feel while shooting other space ships.. kudos to developer for creating this .. I was always thinking about flying a spaceship and now it has happened\n\nHelpful | 0", "OWDVRFeb 8 at 9:05 PM\nAwesome but makes me motion sick\n\nGame is great from what I can tell but certainly makes me a little ill from the motion lol\n\nHelpful | 0", "przecinekNov 16 at 3:08 AM\nSmall tip - change control settings\n\nI've seen some complain game feels too arcadey. My advise is to change steering from 'head based' to a 'controller based'. You can then freely look around and use head movement for aiming. Will not make End Space suddenly play like a simulator but if you're looking for more immersion it definitely helps.\n\nAs for the game itself - it's fun, looks good and is reasonably priced.\n\nHelpful | 8", "UlthienMay 4 at 2:57 AM\nBattlestar Galactica here we are ... \n\nNot much motion sickness as you follow the target per head movement.. gorgeous scenery.. nicely done.\n\nOne of favs for us, SciFi generation \n\nHelpful | 0", "ShadowMuzDec 12 at 3:26 AM\nGood, VR controller mapping needed\n\nI've played a few hrs or so, great visuals and impressive as created by a just 1 or 2 people I heard. Cheap price so worth trying out if you like Sci fi space flying games.\n\nHowever I feel frustration flying the ship and take hits I could have avoided due to the controls. Have\ntried gaze to fly, gaze to aim, invert sticks, lefthand flight but none of them feel right as the underlying movement of the ship feels clunky for me at least.\n\nIf there were the ability to change the controller setting on VR controller this game would be a better experience . Currently has the boost button on Y or one of the facpad buttons so you can't boost and yaw same time as have to move thumb from the control stick. I want to boost and move tme ship where I want same time, not line it up first then boost letting the AI get easy shots off.\n\nGood control set if ever added would be Left stick turn ship and increase/decrease throttle, right stick up down and yaw, brake/boost on shoulder trigger button L/R respectively, guns on one side trigger missiles on the other, face buttons to change weapons. Can do virtually everything with a setup like that with thumb moving only to quickly change weapon. Really unsure why this wasn't covered off, ruins tne immersion for me.\n\nI could tether an wireless xbox controller and get this, but then might as well just play the xbox in reality ;)\n\nHope VR controller config support gets added, 5 star game with that\n\nHelpful | 0\nDeveloper ResponseDec 16 at 8:29 PM\n\nI don't have a way to add configuring VR controllers. However if you have a Bluetooth Xbox controller, or any Bluetooth gamepad for that matter you can connect it to your Quest and use that for playing instead of the Touch controllers and that would allow you to customize the controllers.", "ReconGhost187Dec 23 at 3:59 AM\nNot bad for what it is!\n\nTbh it's not flying around in an Xwing but it's the closest thing we've got and it's not bad! Levels are fun, graphics looks alright and it's fun to play!\n\nHelpful | 4\nDeveloper ResponseDec 16 at 8:27 PM\n\nGlad you enjoyed it! I would love to make a X-Wing game. Tie Fighter is one of my favorite games of all time. Just get me a license!", "kris.maizeFeb 5 at 9:00 PM\npure fun\n\nI love this game bought it yesterday and so far it is my favorite\n\nHelpful | 1", "Sightseer73Dec 29 at 5:23 PM\nCompelling but disorientating\n\nThis is an addictive immersive game, with good narrative between missions, however the rapid tilting leaves you feeling rather nauseous (and the worse Ive experienced in any Oculus VR game).\n\nHelpful | 0", "JerCinemaFeb 5 at 2:07 PM\nSPINNING out of control\n\nHello. installed the game and once I got to the tutorial, your ship just spins out of control. I deleted and reinstalled it, same problem.\n\nHelpful | 1\nDeveloper ResponseApr 29 at 2:23 PM\n\nRecenter your headset or position when this happens. Hold the Oculus button for 3 seconds when this happens and it will fix it.", "vkalitkinJan 23 at 6:36 AM\n\nI change language to Russian but see translated to Russian only menu text. All mission goals are in speaking English, I can't understand what to do in missions.\n\nHelpful | 1\nDeveloper ResponseJan 29 at 1:43 PM\n\nSorry we haven't figured out a way to do subtitles well in VR and don't have anyone to do Russian voice over. We are only a team of 2. However just follow the Green Objective squares on your HUD and you should be fine.", "KermitdaninjaNov 18 at 2:29 PM\nLoads of fun and great value.\n\nSo far I've really enjoyed this game, it's early days for the quest and currently this sort of game is in short supply. The only suggestion I can make is to disable to look to steer setting as standard as it made me feel sick and you lost the feeling of being in a cockpit, but leave the look to aim setting on. Keep up the good work devs and may be a flight sim with planes might be in your sights next, hint hunt .\n\nHelpful | 0", "iamtherealrockDec 19 at 7:52 AM\nGreat concept, horrible execution\n\nYou dont even control the ship with your hands, you steer ware you look. This is the only VR aspect of the game. 1/5 would not recommend.\n\nHelpful | 6\nDeveloper ResponseDec 20 at 8:21 PM\n\nIf you head to the settings menu, there are options to change how you control the ship. You can use the Touch controllers as virtual joysticks, or use the thumbsticks. You can also connect a Bluetooth gamepad, or even a HOTAS if you want.", "ian.bloomsNov 27 at 8:22 PM\nIts good for about the first 15 min.\n\nThe graphics are awesome, the immersive experience (please use headphones) are very awesome. The main drawback is that the story is just not to my taste. Ive read the developers responses, and I know how hard it is to create this kind of product, its truly a fine piece of work, but like anyone else - it just didnt meet my preference and it will for many others\n\nHelpful | 2", "star5kyJan 5 at 2:30 AM\n\nClassic arcade space shooter, this time you really feel like you are in the cockpit of a fighter. As others say, it is imoprtat to configure controls for your liking.\n\nHelpful | 1", "DjtrippingMay 8 at 4:18 PM\nGREAT!!!\n\nI played it and found it visually stunning!\n\nHelpful | 0", "BADS33DDec 10 at 6:39 AM\nGreat game!\n\nI only wish I could rearrange the weapons in the Quest version. I hope they allow it on a near future update.\n\nHelpful | 1\nDeveloper ResponseDec 16 at 8:30 PM\n\nHow would you like to rearrange the weapons? Feel free to email me or join our Discord: https://discord.gg/8mQWFec", "DaveThePsychoAug 30, 2019 at 2:55 PM\nY'all need to sit down honestly\n\nI dunno what ppl expected from low price, 1-person dev team and old school arcade space shooter, some of y'all need to sort things out.\n\nWhen it comes to the game: it's a good starting game of its genre on Quest. Nothing too crazy, a bit nostalgic from the 90' and 00', straightforward gameplay, simplistic story, action-packed graphics. Offers on average 2-3 hours of playtime. The locomotion caught me off guard to be honest, different but well done, sitting down I experienced pretty much no motion sickness (and it's probably the best way to play the game). The only thing bothered me/would add is the volume bar for SFX sounds, I wanted to hear more clearly narration in the cockpit but the environment was too loud to focus on it and usually just focused on blowing up spacecrafts.\n\nKnowing the backstory to this game and what went into it, nothing but respect and congratulations, it's impressive.\n\nHelpful | 84", "ralphgarcia614Nov 29 at 7:46 PM\nGreat BUT\n\nSo I must admit I was very impressed by the gameplay but what I didn't like was there wasn't enough ship upgrades enough ammo upgrades enough missile upgrades and then to top it off it's one big map full of missions but it only takes up 25% of the map the missions just weren't long enough or I should say there wasn't enough missions they should expand on this game and I would say would be awesome but it's definitely a fun game as it is\n\nHelpful | 2", "wagnerstechtalkAug 28, 2019 at 5:28 AM\nLooks Beautiful and Immersive Gameplay\n\nAbsolutely LOVE this game! The graphics are beautifully done and the game-play/narration really draws you in. The controls are very intuitive, you'll be ready to fight after the 1st mission. There are 12 missions in total, currently, from what I understand more may be coming. There is even a little easter-egg (surprise), but you'll have to search for it (not hard). There is no multi-player mode, if that was added it could easily be the #1 Quest Game (IMO)! It would increase the re-play-ability to an infinite level. I made a video review on my YT channel wagnerstechtalk ( https://youtu.be/NdZ4TY1Rle4 ) if you want to see some game-play footage and tips. If you love sci-fi/dog-fight space games, you won't want to miss End Space!\n\nHelpful | 155", "SANEWBERRYNov 27 at 2:29 AM\n\nThings have come along way from my youth playing space invaders on an Amiga 500. Im really enjoying End Space, it looks great and feels great to play. Im using look to aim and watching the gun turrets move is very cool. The detail on my own ship is very nice it really makes me feel like Im really in it.\n\nAny plans for new content?\n\nHelpful | 0", "brian.g.obrienApr 29 at 1:09 PM\nCRASHES All the TIME I want a refund\n\nI want a refund, played about 3-4; levels and now all it does is crash. I want a refund\n\nHelpful | 0", "Roxtar73Jul 4 at 5:08 AM\nNeeds more time in the oven but good\n\nThis game reminds me of an iOS space shooter I recently played visually. Its an alright game but its not really done. There are so many things this game sorely needs. Perhaps more than one ship with a limited arsenal is a starting point. More missions across different sectors of space. Longer more engaging missions with checkpoints. I gave four stars because at this base level its a descent space shooter with unlimited replayability assuming you dont mind the same missions over and over. Which isnt as bad as it sounds. If what you long to do is fly through space shooting bad guys then this game should be able to scratch that itch. However if you are looking for an engaging space game with lots of ships and levels and missions this is not your game.\n\nEdit: after having a Quest for a while this game works well and does plays fine I really just wish there was more. I would pay $10-$15 for a dlc pack that adds ships levels and weapons.\n\nMultiplayer dogfights would be amazing if they could be added even if theres a price to get the multiplayer dlc so be it as long as it has some great new co tent with it like multiplayer arena areas.\n\nHelpful | 2", "TargetBoyPlaysNov 5 at 3:50 AM\nHard block at Comm Breakdown\n\nI like the game, but I am hard blocked at Mission 4. Try as I might, I get swarmed by fighters before I can take out the three missile launchers near an array. If I try to finish the launchers, the fighters kill me. If I take on the fighters before killing the launchers, I get killed by missiles. I rarely kill more than one comm array. I have tried dozens of times. There does not seem to be any difficulty setting to get me through.\n\nI am sorry to post my problem here, but neither Oculus or the games page have any sort of forum or discussion group to ask for help with the Quest version. On Steam nobody has had trouble with this mission. I found one video on line, but in it the fighters trickle in one or two at a time, instead of swarms of 5 or 6. They also seem to appear less frequently. I'd love to rate it higher, but I have only seen 1/3 of the game. I have tried a dozen times.\n\nHelpful | 3\nDeveloper ResponseDec 16 at 8:41 PM\n\nSorry for the late reply, I have been in the middle of moving. Here's a little cheater tip. If you leave one ship in the first wave alive, the 2nd wave won't spawn. Leaving you able to deal with the rocket batteries.", "FollowWingsDec 20 at 11:24 PM\nAwesome\n\nI like the outstanding graphics and style of the game! Fast study curve and action packed shooter. Hope the dev. adds more to it! Worth the price!!\n\nHelpful | 1", "UncleSam75Nov 14 at 10:35 PM\nEnjoyable but short\n\nIts not very long (3 hours or so, depending on your skill) but what is there is well done and for this price its fine. I hope the dev makes another larger game in the same genre.\n\nHelpful | 0", "aghkoDec 6 at 4:24 AM\nBad Port to Quest\n\nThis game controls works better and feel better on Go than Quest. It is a pity that he has not managed to set up only Touch control system and still requires the head.\n\nHelpful | 1\nDeveloper ResponseDec 16 at 8:33 PM\n\nCheck the settings, there are multiple ways of controlling the ship. You don't have to use your gaze to control the ship. Disable Gaze to Fly, and you can use either the thumbsticks to control the ship, or the controllers rotation.", "WentlleOct 21 at 10:01 PM\nGreat game lacking some content\n\nSome content missing is story and a sense of progress and skill. Its all positives from there. The mechanics work smoothly and feels great to control and the game comes in at around 3-5 hours depending on how fast you try to beat it. It never felt like a chore to take out baddies. I would like to see multiplayer PvP later tho if possible cause I want reasons to come back to this masterpiece. You did a great job!\n\nHelpful | 0", "CaroJackKateOct 29 at 4:38 PM\nGood basics, but lacks depth\n\nI love space sims and this game has the basics for a good one, but there are many shortcoming which hurts it imo.\n\nThe good\nGood graphics, tight controls, smooth flying are all there\n\nThe bad\nVery limited controls customisation.\n-Only the right controller can be used as a virtual joystick. You cannot steer the ship with the left controller and aim with the right one or vice-versa. If you want to use virtual joystick instead of looking to both steer and aim, the reticle will be locked in the middle of the screen and the right controller will steer & aim...\nIt is also impossible to calibrate the virtual joysticks, making it quite uncomfortable to steer the ship with this method.\n-Very limited equipments and unlocks\n\nThis seems like an occulus go re-release on the quest and the devs did not bother adding full support for the second controller, which is unfortunate. Hopefully, future development will resolve the issues and the game will get a lot better!\n\nHelpful | 5", "YazoonyDec 12 at 4:05 PM\nGreat for vr noobs\n\nI'm new to gaming let alone VR gaming. So I'm very grateful that some developers are thinking of ways to help people like me enjoy VR. Amazing graphics and Super fun. Thanks!\n\nHelpful | 2\nDeveloper ResponseDec 17 at 5:04 PM\n\nWelcome to VR and glad to hear you enjoy the game!", "Wolvesbane364Nov 20 at 6:56 PM\nValkerie eat your heart out!\n\nGreat game! Awesome space combat VR simulation. This game sealed the deal for me on buying an Oculus Quest. It is a fun game and the controls are intuitive for me. I enjoy the experience and got so into it the first time I played. This is a great game the developers should be really proud!\n\nHelpful | 1", "erasmushurtAug 29, 2019 at 12:25 PM\n\nThis is a solid game. The head based movement takes some getting used to and it's the first Quest game that made me feel a little queezy. Not too bad though. It's definitely an arcade style game though. It doesn't have the over the shoulder looking and tactics of something like Elite: Dangerous on PCVR. It's more in the mold of Eve.\n\nHelpful | 11", "rmaxixOct 16 at 12:46 PM\nEND space\n\nGreat game, really fun intuitive and exactly what I was looking for on the VR scene to get a feel for flying through space.\n\nThe head tracking and general flight controls are exceptional. The ship upgrades give a nice, if limited, progression. As do the additional fighters and cruisers.\n\nId like to see some improvement to the alert system or vibration feedback to give a feel of being under attack as you never really get a feel in being under fire or having a missile lock on, until shields are down and the cockpit cracks. Which gives the game more of an arcade point and shoot style rather than a fully fledged dogfight situation.\n\nMy biggest dissatisfaction with the game however was the sudden ending with no obvious roll credits, I really felt like the missions were building up to something and then just seemed to end so abruptly that I was left scratching my head and wondering if I had somehow failed to unlock the next step. Still not sure that isnt the case...\n\nNegative points aside this is first on the scene for decent space flight VR and an awesome starting point, well worth the few quid\n\nHelpful | 2", "MichaelSanFranciscoOct 19 at 7:12 AM\nExcellent, cool FPS arcade space game.\n\nIf you are like me, guy who likes the space environment shooting games genre, this is the game for you. It is a combat spacecraft first person shooter game, no more, no less. If this is what floats your boat so, read on.\n\nI bought this game fully aware of what others have said in criticism of the game. In my opinion the problem is that people don't read beforehand what this game is all about, they have their own personal expectations, and are disappointed when they play it. If you are into this genre of game playing, you however will not be disappointed.\n\nThis game is like being in the arcade playing inside the machine, specifically those space shooter games, except this is in virtual reality, which funtasticly adds a 21st century twist to playing the genre.\n\nThis game is quite pleasing to play, for a quickie, or for two hours. You can pretend to be fighting in your favorite TV show or movie. Wing Commander, Star Wars, Star Trek, Battlestar Galactica, it's all good. Our delusions are limited only by the boundaries of our imagination.\n\nI won't go into boring detail, suffice it to say that the graphics are excellent, the gameplay son, and is sufficiently challenging to Stave off being bored.\n\nThis game will go to the top of my list of favorite games in my library. It is well worth the price and does not disappoint so, again, but only if you are into this type of game playing.\n\nBottom line, if someone told me 30 years ago that I would be inside the arcade game console playing in a rich 360 degree virtual Star Trek environment , I would have told him or her they are crazy because that technology will never exist. Fast forward to 2019, here I am sitting in my underwear, manning a spaceship fighter cockpit taking out bad guys.\n\nAs a bonus, I look forward to the game being updated, perhaps a multiplayer mode allowing us to shoot each other into another galaxy, shouting before each game: \"Let's get on with the killin!\"\n\nHelpful | 4", "cjesqipOct 17 at 12:39 PM\nplayed it first on Gear VR\n\nThis game was great using a Bluetooth controller on Gear VR. Now, using the Quest controllers, I'm having trouble figuring out how to roll the ship. I tried manually changing the controls, and my efforts were fruitless. Something in the options menu is either glitchy or just too difficult for me.\n\nI like most of the game, although I still wish the combat were a little less monotonous.\n\nIt's definitely worth what I paid for it on Gear VR (on sale). So I can't complain.\n\nHelpful | 0", "x.wesley.xMar 24 at 9:02 PM\nHOT game!\n\nOne of the best games out there!!! Extremelly worth if you like space combat games. It's mandatory to your collection. Don't think, play it now!!!\n\nHelpful | 0", "LEYG13Jan 20 at 10:44 AM\nEndspace\n\nMakes me feel too sick! Really bad motion sensitivity\n\nHelpful | 0\nDeveloper ResponseJan 29 at 1:44 PM\n\nHave you tried out some of the other control options in the Settings page? I am sure you will find something that makes it more comfortable for you.", "Kahless1970Oct 12 at 7:53 AM\nIssues disabling Head tracking\n\nDoes anyone know if there is a method for disabling the head track option that enables you to look around your cockpit without the ship going in the direction you are looking at. I love Eve Valkyrie and would like this option for a more immersive experience while still using the oculus quest controls for weapon and flight options.\n\nHelpful | 2\nDeveloper ResponseDec 16 at 8:44 PM\n\nYes under the settings menu, head to the to Gaze for Flight option and disable it.", "QuantumbulletAug 29, 2019 at 7:24 PM\nIts with a heavy heart, but its honest\n\nI write this review with a heavy heart but I have to be honest. Gameplay itself is decent. I enjoyed the ability to change the controls. Lots of options there. Overall the game can be fun but it is very hard to get over the sort comings. Audio is terrible, graphics are equally terrible. After seeing what Red Matter and Vader Immortal was able to do this is a very hard pill to swallow as it looks nothing like advertised. Not even close. Space is painfully nothing more than a back drop with random asteroids that will fly at you as you move around. Feels like your on rails not really moving like those 4D theaters where youll get some cool effects but your never truly immersed. I dunno what else to say really. I was happy it was only $15 but after playing it for about 30 mins I put it down. To answer the question I wont be asking for a refund as I want to support the developer but this port was not ready for prime time. Additionally, I would like to add that Im not expecting the greatest graphics or anything even though the pictures and video was not a good representation of what to expect. Its the lack of immersion you feel when you realize your ship is not moving in that space and speaking of space, the sound effects dont make a lot of sense. I understand even Syfi films do have them but it should be a little more subtle. Again it was an immersion thing for me.\n\nHelpful | 40\nDeveloper ResponseAug 30, 2019 at 12:07 PM\n\nSorry to hear that. However End Space is made just by me. To compare it to a game made by Industrial Light and Magic is a litte unfair. I agree there is room for improvements and the game has been updated over the last 3 years with constant updates making it better each time. Still I thank you very much for your support and not refunding it. I love working on End Space and want everyone to have a good time with it and it's always getting better :)", "Mr_McBrettOct 1 at 1:39 PM\nIt' a space sim, shoot space stuff\n\nGraphics are pretty, but sense of depth is lacking... you think you are passing an asteroid, suddenly you lost half your shields.\n\nGame lacks the tactical awareness of a 3D threat display or missle warning system, but the it until it 'booms' is enjoyable for a while. Upgrade system for weapons is pretty flat, earn point and buy stuff.\n\nIf you was a space shooter like \"Gun Jack\", End Space is not a bad choice. Do not Expect \"Valkerie Warzone\" level of complexity...\n\nHelpful | 3", "KubikerOct 6 at 12:16 PM\n\nFirst of all a great thanks for giving an option of a space sim game for Quest. There are a lot of zombies, sports, puzzles, shooters in the Oculus Quest Store. But very few fly sims. So you have very good potential to grow, don't lose it. Your game has a very good core. Nice combat mechanics, simple controls (however for me, particularly, is better to change yaw/pitch with the stick, not moving head), vivid explosions. But it feels like half-made. Many things could be done better. If you need an example, please look at the GoF series. They run smoothly on mobile hardware and feels like a polished masterpiece.\nHope my comment was useful. Good luck in development! Waiting for new games from you!\n\nHelpful | 0", "BadelatscheOct 19 at 11:30 AM\nPlease let us configure input free\n\nSpend most of the time with configuration of input. I'm playing now with virtual joystick, because it gives me roll/pitch on right hand. I would prefer to have it on the right stick. Also I can't remove yaw from virtual joystick right controller. That feels weird.\nSo I tried ps4 controller, but I couldn't configure the axis free. Game keep telling me that the axis is already in use and can't be replaced. I tried removing all axis, save and tried again, no way you can't change the axis of the sticks.\n\nThat's a bit sad, I like the gameplay and would love it with the setup, I prefer for flying games.\n\n4 stars, if you let us configure input axis where we like to have them on the standard controller. That it doesn't work with the ps4 controller is a bug in my opinion, but that's a experimental feature.\n5 stars if you let us configure everything free on the standard controller. I would change a lot, if possible.\n\nHelpful | 1", "ajmurrayukOct 29 at 1:19 AM\nBest flight sim. Period\n\nExcellent level of immersive control, great visuals and very engaging gameplay. This is better than any other flight sim I have played (in VR or otherwise), and once you get the hang of all the degrees of freedom (including using free-look to target!) is very intuitive and flight combat just feels right.\nWonderful update to many hours of my youth playing x-wing vs tie fighter.\n\nHelpful | 2", "jameymcelveenDec 15 at 10:20 AM\nLove It!\n\nI really wish X-Wing would be remade for the Oculus. This is the next best thing!\n\nHelpful | 0\nDeveloper ResponseDec 16 at 8:23 PM\n\nIf you know anyone that could get me a license to use X-Wings, I would love to do it!", "WinrmanNov 30 at 1:39 PM\nThe Controls\n\nI know I need to give this game more time, but right now I hate the controls. People who play these games a lot more than me love this game so I'm going to keep at it. I will update later.\n\nHelpful | 0\nDeveloper ResponseDec 16 at 8:34 PM\n\nFeel free to join our Discord for more tips: https://discord.gg/8mQWFec or reach out to me to see if I can help with your issue on controlling the ship.", "pmgahanOct 26 at 5:54 AM\nGreat game Beautiful graphics and sound\n\nThis is a well made game, the cockpit and the planets are beautiful, you feel as if you are floating in space. It is a different kind of game well suited to play seated, a good addition to your game library so that you have some diversity.\nIt took me a while to get used to the virtual joystick, you need to hold your right control up to maneuver the ship which sometimes gets your arm tired.\nSome suggestions and requests: Damage: the ship bounces into everything, it should get some damage and eventually explode. Story: It would be great to have more of a linear story as opposed to return to the hangar every time you complete a mission. Multiplayer: It would be great to have a Multiplayer dog fight.\nThanks for such a good game!\n\nHelpful | 2", "Kalbrek009Oct 9 at 12:54 PM\nEnd Space\n\nPretty cool game, great graphics. Would rate 5 stars if I could go into first person mode..maybe add that in a future update? Altogether, I really liked this game & look forward to seeing more like this in the future from this company.\n\nHelpful | 1", "excel8951Nov 11 at 6:28 PM\nBoring\n\nThe Game is just missing something. Flying through space like han solo is great but every level seems the exact same. Not much excitment\n\nHelpful | 1", "JAM3XSep 22, 2019 at 5:11 PM\nLooks pretty good\n\nI haven't been able to to play too much of the game yet (controls), but from what I have experienced it seems promising, if not possibly a bit short. There are plenty of control schemes available, but the most important setting for me personally is missing; you can't change the axis on the control stick. Default is set to forward/ back for pitch (nose up/down), left/ right for yaw (left/right or rudder) and twist for roll. Unfortunately due to roll and yaw being switched I just can't play the game due to it being opposite from every other game, sim, and aircraft that I'm used to (like playing with a gamepad w/ the sticks switched around). I will keep the game and hopefully the devs will update at some point.\n\nHelpful | 1", "TronjerOct 17 at 1:24 PM\n\nI like that one. For that price I think you get a real good experience. Feels to me like this should be the beginning to a biiiiig space simulator!!\n\nHelpful | 2", "Guidance777Oct 14 at 7:21 PM\nExcellent Space Shooter!! A+++\n\nIf your looking for some awesome space fighter battles, this is your game! I'm hooked!\nIts also solved my extreme motion sickness sensitivity with head to reticle tracking!!\nI finally get to enjoy flight in vr! Thank you!!\nExcellent detailed cockpit and savvy enemy AI.\nPlease keep making more missions.\nBut most of all, MULTIPLAYER PLEASE!!! ASAP!\n\nHelpful | 3", "frikiconsoleroOct 20 at 1:52 PM\nI want more!!!\n\nPlease don't be mislead by bad reviews. Try by yourself. I strongly recommend to spend some time adjusting the controls. Once you're comfortable with them, hop on to your favourite seat and ENJOY!! UAUH! This is what VR should always be! Arcade based style, dog-fight on nice environements on space. The bad side is: I need more of this!! More stages, fight closer to planets, maybe even a little bit of lore...anyway this is f****** great! Congrats to dev team, I heard all of this is done by just one person. Awesome work.\n\nHelpful | 0", "higginlsSep 9, 2019 at 10:58 AM\nGOOD Solid Title, BUT.....\n\nSpace shooters are indeed great in VR! As with a few other purchasers, I thoroughly enjoyed this game but was left a little wanting. First, there could have been a few more missions. When I got to the last mission I thought the empty area at the top of the missions map might be 2-3 bonus missions in another sector. Not the case. Additionally, you have no way of even telling you've finished the last mission other than another doesn't pop up. Basically, no self-congratulatory grand conclusion video to tell you how great you were or at least let you know you have finished the game. Nothin! It just lays there. Leaves you feeling very underwhelmed and wanting more rather than feeling self-satisfied at having removed the invading hordes (and wanting more). Still all in all I liked it but took one star away. Is it me or are a few too many VR apps and games a little to short for the money. Especially compared to Oculus GO.\n\nHelpful | 5", "iamhereAllmightMar 27 at 3:59 PM\nNot that good\n\nI expected it to look way beter\n\nHelpful | 0", "925aonraOct 4 at 4:13 PM\nGreat graphics, not a flying experience\n\nFine for an arcade, shoot em up game but with just a little more they could have added the minimum of accurate flight controls and this would be so much more enjoyable. Not the fault of the developers. I know they had to make choices. It's more about my own frustration with the lack a decent flight sim on Quest.\n\nHelpful | 0", "Marvin_MaverickSep 16, 2019 at 2:10 PM\nSpace Flight Game, not a Sim\n\nI like the game, but I cannot get used to the controls, I expected controls like in Aircraft, but the controls cannot be configured like that. Over all I think there is room for future improvements. I did not refund it, because I learned the game is made by one individual, and I want to support the future work on this project. I expected something more like a Spaceflight Simulator, but the shooter game is ok enough for me to keep it.\n\nHelpful | 0", "brian.johns.9028194Oct 9 at 12:22 AM\nDisappointing\n\nI bought the oculus because of this game , but instantly did not like it . Do not like how you steer by looking around. Very unrealistic feel . Good idea, but terribly executed. It was a big let down. I do not recommend purchasing this game.\n\nHelpful | 3\nDeveloper ResponseDec 16 at 8:46 PM\n\nIf you head to the settings panel there are lots of different options on configuring the controls. You don't have to steer by looking around. You can also use the thumbsticks or the Touch controllers as virtual joysticks. You can even connect a Bluetooth gamepad or a joystick if you want.", "matthew.gilliam.18Nov 21 at 11:18 PM\nSpace Battles\n\nFight battle after battle. If you have always wanted to fly with unlimited movement. This is for you.\n\nHelpful | 0", "Masaru.KatoSep 12, 2019 at 4:43 AM\nThings that can improve the game\n\nIt's the first and only space shooter in quest so far, and it generally delivered what I was hoping for.\n\nI found the controls are intuitive and not complicated. The gameplay is simple and lots of fun. It felt most impressive when I could look around my cockpit while piloting with the controller, and the piloting virtual hands reacts with my control. It really felt like you are piloting a spaceship fighter!\n\nThe only way to play this game is sitting down, you ll probably fall over if you try playing standing up. I got a bit nauseous at first but got over it quite quickly.\n\nAs for improvement, I finished my 6th mission, and the game can become a bit repetitive since it's an arcade style game. Maybe add a big boss like antagonist at the end of each mission would make it more interesting.\n\nThe cockpits graphic is done well, but I wish it can be further polished to add some reflective elements, given that 99% of the gameplay starts from there.\n\nThe deep space is a wallpaper that you cant fail to notice. For me this is the achilles heel of the game. It takes away the immersed level of the game.\n\nHelpful | 0", "mjcorAug 29, 2019 at 1:51 PM\nFirst true dogfighting experience\n\nBeing first will probably get this bonus points, but what it really does is give a great glimpse of whats to come in the Quests future. Sitting in my chair had me immediately immersed in the cockpit of a star fighter. Listen to everyone else, find controls that work for you. I prefer flying with the physical joysticks so it was really impressive to be able to see a ship Im chasing zoom past my head and visually follow it out of the top or sides of the cockpit. Could use more content but is just fine and fun how it is.\n\nHelpful | 22", "AlfaDonAug 29, 2019 at 9:04 PM\nSo far so good. Mostly.\n\nThe game is fun but the immersion youd expect from a VR game is diluted by the fact that everything is moving so quickly, it makes everything seem smaller and not to scale. The ship doesnt quite have any weight due to lack of aim acceleration while steering, it just rotates extremely fast with no weight or inertia. If the game were slowed down a bit, it would make it feel a bit more realistic and less arcadey, thus making you realize the size and scale of the other ships around you. There was a disconnect for me playing this game and I wasnt sure what it was so I jumped back into Elite Dangerous and instantly realized why the flight isnt as satisfying in Endspace. Although it could be with minor tweaks. At some point theres gotta be some kind of gameplay loop added that keeps you coming back, like multiplayer with progression or single player elements that scale with you. Great job so far though, especially for just one guy. Btw I dont really write reviews but theres real potential here so I thought Id do my part.\n\nHelpful | 6\nDeveloper ResponseAug 30, 2019 at 12:02 PM\n\nDoing away with ship inertia was design decision based on VR sickness. That extra acceleration and deceleration had caused discomfort in testing. I know some people are ok with it but I am trying to make the game accessible to everyone. But I'm glad you still like the game and can enjoy it :)", "dalton.anderson2Oct 3 at 5:43 PM\nFor one man dev team this is amazing!!!!\n\nThis game was a selling point for me when deciding to buy the quest. What the solo dev has done without a support team is impressive to say the least. I hope this contribution helps you make the decision to make the jump and see where end space could go with a full time dedicated team. I give this game 5 stars. Where Id like to see you advance in the future\n\n-More advanced AI: I feel that unless Im directly in between the objective and the enemy Im generally ignored\n\n- more intense middle avoidance experience. Maybe an alarm and red flashing light of incoming fire. With perhaps a flare dump or barrel roll to break the lock\n\n-move the main menu to over look your craft with perhaps a color customize setting\n\n-perhaps some sort of wing man system where you get radio chatter when a wing man is getting shot at and name plates on the ally craft\n\n-Multiplayer!!!!!\n\nI realize these suggestion represent weeks and weeks of coding and testing. By no means does these critiques mean that I dont love this game.\n\nLooking forward to future updates and dogfights!!!!!\n\nThanks for all your hard work!!!\n\n-Red5\n\nHelpful | 4\nDeveloper ResponseDec 16 at 8:51 PM\n\nThanks for your positive review! So awesome to get feedback like that!", "OrnateColtSep 8, 2019 at 3:14 AM\nFun\n\nReally enjoyed this, yes its a little repetitive but I have never played a game of this genre that wasnt.\n\nOnly criticism is that it just ended without explanation. I completed a level, and then just went back to the map. A single splash screen would avoid confusion.\n\nLooking forward to future development.\n\nHelpful | 1", "ParadiseDecayAug 28, 2019 at 8:56 AM\nIn Space you don't need cables!\n\n1st Impressions Video with Commentary // Oculus Quest:\nhttps://www.youtube.com/watch?v=VxRaUljdEn4\n(Please Note: Links might not work from Oculus, so please search YouTube for 'Paradise Decay VR Endspace Quest')\n\nA MASSIVE THANKS TO THE DEVELOPERS FOR THE REVIEW KEY!\n\nMy Initial Thoughts:\nFinally a game on the Quest where you get to sit in an awesome cockpit of a starship.\nDon't be put off by the initial control scheme, you might not like it. I changed mine as if playing on a standard gamepad.\nI was a big fan of this game on PC giving it a Steam Curator recommendation and also positive reviews on Oculus and Steam.\nBeing able to experience this game without any cables was a blast!\nI never played the original game on the Gear VR so I cannot compare, but for an Oculus port its seems pretty decent. This is the kind of experience I was hoping for in an Eve Valkyrie campaign.\n\nHelpful | 21", "alex.moody.779Sep 8, 2019 at 12:32 AM\nGood fun.\n\nI had this for the Gear VR, now for the Quest. It's a great game to dip into for a 45 minute blast. Yes it would be nice to have more depth to the missions and gameplay, but what you have here works well. I'd like to see more space/flight based games. The dog fighting with enemy craft is quite satisfying. If a sequel were to be made, perhaps offering more variety I'd be all over it. Well done.\n\nHelpful | 1", "KingCooperchuSep 8, 2019 at 12:01 PM\nGood, bit I have some suggestions\n\nThis game is really fun, but the controls are kinda wacky. If you could implement an actual joystick-like controls, that would be really cool. Also if you could get an arena mode with multiplayer and more unlockables like skins and such. Really good game, just some adjustments to make it possibly better.\n\nHelpful | 0", "nyra.raynAug 30, 2019 at 2:30 PM\nWonky Controls & Rushed Texturing\n\nThe game is ok but there is lots of room for improvement. The stars space texturing is blurry and way to static looking. The controls are meh and need a far better explanation window.\n\n*Star increase for a developer that cares and responds. I look forward to future updates. Maybe chose a texture with less stars, might help.\n\nHelpful | 5\nDeveloper ResponseAug 30, 2019 at 12:04 PM\n\nYou have a point about the controls needing a better explanation. I'll try to fix that in a future update. The background is fixed for performance reasons. I haven't found a better way to do animated stars without killing performance. The game is already pushing the limits of what Unity can do on Quest.", "frank.albanese.3Sep 24, 2019 at 9:07 AM\nWorth the $\n\nFun game to play well worth $15 , just wish it had better depth to the starfield looks like your in a dome but that said I'm having fun playing , it's more a 4.5 star rating just cant do half star on my rating system\n\nHelpful | 0", "mrkdoggOct 11 at 12:19 AM\nAddictive Arcade Space Dogfighting\n\nThis game is fantastic, Its arcade style space age dog fighting game similar to the original x-wing. The controls are intuitive and there are plenty of different options to suit. The missions quickly become challenging. The graphics are great and the price is good too!\n\nHelpful | 1", "arongkatzSep 2, 2019 at 7:39 AM\nGreat spaceship vr game!\n\nI read some of the reviews and really took them into consideration when deciding to buy the game or not. I decided to do so since i like to support developers that really have a passion to do cool games.\n\nThe good:\nIt is fun. Im into level 4 or 5 and im really enjoying the game using the controllers to maneuver the ship since i love to feel like im in the ship and taking a peek at my sides and upper views. This cant be done when using \"gaze\" control. The story is decent enough to make me care enter each of the missions (i would appreciate a little bit more but hey its a one man game) and the combat is also pretty decent and easy to get into and enjoy.\nThe bad:\nThey pointed out that the space looks bad or low res. It does if you stare at it but most of the graphics are great. Just take care of that on an update.\nControls are not that intuitive perhaps a better tutorial or guide to learn how to take the most of each would be good. Once you get the hang of it you will enjoy the game.\n\ni really cant say many negative comments because you can see the love taken to make a game like this from the creator. I wouldnt mind paying a little more for DLC or more options so that i can support him as long as it is a worthy update like online, coop gaming, story snippets or movies, more missions, etc. I recommend people to try it out we dont have another spaceship game as of now so it is worth a try.\n\nCongrats to the developer i really hope you stay on this for a while!\n\nEDIT: as a request please consider changing colors on missile and laser reticles, when battles get intense I confuse them so maybe having different colors would make it more distinguishible\n\nHelpful | 3\nDeveloper ResponseSep 2, 2019 at 6:42 AM\n\nThanks for your support! By the way if you hold down the Left Touch controller thumbstick in Gaze mode you can look around the cockpit.", "cssmythe3Sep 4, 2019 at 5:28 AM\nFINALLY scratched that starfighter itch\n\nI've been craving a starfighter game for months - this has everything I needed, not quite everything I wanted. Great mission variety, some hokey AI (enemy capital ship deprived of weapons on one side won't turn to bring weapons to bear on you), compelling graphics, good voice acting. It could benefit from a better in game tutorial to explain things how you can equip multiple guns and rockets at the same time. It would be cool if your targeting reticle changed depending on what weapons you had armed.\n\nWELL WORTH THE $$$\n\nHelpful | 1", "Hypr4idenOct 20 at 12:54 PM\nI need more BUTTONS !\n\nAmazing I wanted it to be like where there was a lot of buttons but its good\n\nHelpful | 0", "Crazy_SaneOct 4 at 9:09 AM\nRed 5 standing by!\n\nI loved this game on the Gear VR, and the Quest version is just as good. Even a little bit better. It could even pass for the spaceflight battle level that Vader Immortal didn't have. This is a solid space dogfighting sim, but one thing that might ruin you first impression is the default control setup. \"Steer with your head, aim with the controller (pointing)\" feels unnatural to me. You can easily change it to \"joystick steering, head aiming\" in the settings, which I find much better. Feels less arcade and more sim. If you are prone to motion sickness, this game might not be for you. But if you have your \"VR legs\", it's definitely worth a go. But I would like to see it made easier to change the control setup. Maybe during the tutorial, so you can sample the different control methods.\n\nI think this game deserves about 4.5 stars overall, but there just haven't been enough reviews yet. I would like to see this game do well and continue to grow and improve. More content and multiplayer would be cool.\n\nHelpful | 1", "marv3lAug 30, 2019 at 7:30 AM\nAlmost a Piece of Art..\n\nI've been waiting like crazy for this game, couldn't wait to see myself in a Space Pilot's shoes (Boots?)..\nStarted to play the 3 1st missions so far, and here are my early Pro's & Con's:\n\nPros: The feeling of being able to get a Space Battle tracking ur enemy high speed between Asteroids and such, and being able to stay locked on target is there! It will only depend on your Pilot'skills..\nGraphics are nice, but could have been better (Red Matter like?)\nSounds are immersive enough to keep you in the Battle.\n\nCons:\nDespite the advert, French language is just present during the Menu selections.\nNot in the Game itself.\nNo subtitles either. (?)\nThe Feeling of speed could have been better.\nGraphics could have been more crisp.\nMultiplayer Mode would have been a BIG Plus (Co-op, vs, etc..)\n\nBut it's still a VERY wicked game, Gameplay and all, and to be honest, for quite a cool price.\n(Can't wait for updates.. ;) )\n\nHelpful | 3", "brian.scarthNov 5 at 7:51 AM\nReally cool\n\nIve had my quest for a week and this is an early favorite. Great fun for casual gamer looking for the flight experience.\n\nHelpful | 2", "vinylkiller1982Oct 29 at 2:06 AM\nFantastic space shooter\n\nThis is just fantastic, flying in space and shooting otter spaceships. Really cool be game, you feel like your really in space. The space battles feel intense, worth a purchase.\n\nHelpful | 0", "agitokazuOct 3 at 1:25 PM\nOriginally played on gearvr\n\nRan really well on gearvr, I think its meant for 3dof headsets over the 6dof ones. Played it as a beta on Lenovo mirage solo but had been extremely buggy. I dont know couldnt get into it on quest. But I hope to see improvements overtime.\n\nHelpful | 0", "UmbustadoSep 10, 2019 at 5:38 AM\nExcellent - for what it is !\n\nFor a one person dev team I have to say well done\nThere are a few shortcomings though - there are only the mission levels and once theyve been done then thats it, you can only repeat the same missions so gets a bit boring\n\n1 - whats needed is a horde mode where you get wave after wave of increasingly more ships until you die\n\n2 - a free roaming universe (maybe via jump gates) with random enemies generated on every jump to give longevity to the gameplay\n\n3 - more weapons to upgrade to otherwise theres nothing to spend your cash on after youve bought the 3 available weapon types - even upgrading the power of the available weapons in steps would be a step forward\n\n4 - I know multiplayer would be a bit much to ask for but how about a global scoreboard so even if we cant blast other people out of the skies we can still have competitive bragging rights with online scores - itll give players something to aim for and a reason to keep coming back to play\n\n5 - other ships to fly - the bad guys have them, why cant we !!! Short term you could let us fly captured enemy ships, long term we need a fleet !\n\nThese 5 things would make your game much more re-playable and you need people to keep playing and recommending it to their friends!\n\nLast suggestion - when you make enough cash - hire some more devs to help implement true multiplayer to turn this game from good to truly awesome ! Youve done great on your own so far but everyone needs a bit of help to take things to the next level and this game could be as popular as Beat Saber if its developed!\n\nIm going to give 3 stars (if it was out of 10 Id give 7) but I will upgrade my rating if you upgrade the game \n\nHelpful | 4\nDeveloper ResponseSep 13, 2019 at 5:21 PM\n\nA lot of those things are on the list! Thanks for your feedback and hope the updates deliver!", "MythrealOct 7 at 11:03 AM\nNeeds a lot of work\n\nI'll admit I didn't get very far into the game but what I saw was enough.\n\nThe graphics were really bland and too much aliasing. The flight controls are very strange and for whatever reason boost is on the Y button of your main flight hand which means you have to choose between boosting or steering the ship. The combat would be more fun if I felt the aim with headset controls actually placed the cross hairs where you are looking and even when it does there's a good chance your just sitting there missing if you get it into the lead circle. The controls should be customizable and the gaze aim needs to be calibratable.\n\nHelpful | 1", "christopowerOct 26 at 3:26 PM\nGood price , even for the Canadian D\n\nI am having fun with it ,\n\nHelpful | 0", "CoreboAug 31, 2019 at 6:08 AM\nFun\n\nThis is the first flying VR game Ive ever tried and Im very pleased with it. It took a little bit to get use to the controls, but there a few options in settings to help. The cockpit graphics are awesome and the gameplay fun. A great start for a space game. Cant wait till someone makes a WW2 flight simulator game for VR.\n\nHelpful | 0", "keengermAug 30, 2019 at 5:32 PM\nSweet Sim\n\nThis is the best arcade space sim on the Quest. Well, ok, the only one. It's considerably prettier than many action-oriented games on the platform.\n\nThus far it makes for a fun dogfighter IF you change the default control scheme. Using look to fly AS WELL as target makes the game a cakewalk. Switch it up to Oculus controllers and you have a brilliant and challenging game.\n\nFor $14.99 it`s a steal. Well worth the price. If DLC comes out I will definitely buy it.\n\nHelpful | 0\nDeveloper ResponseAug 30, 2019 at 11:58 AM\n\nI haven't heard of any issues like this before. I would suggest reinstalling it as no one else had reported anything like it. Have you modifed your Quest at all or using something strange. Feel free to email me at justin@endspacevr.com.", "quillrirzOct 6 at 4:55 AM\nLooks Good and lots of control options\n\nBut some other interior of the ship would be nice, looks abit too worn down and is like a grain of sand in the eye\n\nHelpful | 0", "dennisn8tkkNov 18 at 6:34 PM\nEnd Space / End of Play\n\nVery very bad video. Black flickering blocks. Not playable not even on the menu. Needs to be fixed.\n\nHelpful | 1", "obi2kenobiOct 3 at 8:51 PM\n1st time on endspace was Google Cardbord\n\nAnd I am not sure if much has changed since then. As one of my first VR experiences it blew me away at the time. Now it feels pretty meh.\n\nImprovements i noticed were much better graphics, two distinct arms, and free look. It is better than my old Google Cardboard, but the controls really kill it.\n\nIt just doesn't feel natural at all. I tried both the gaze steering and hand steering. It would have felt more natural if you actually grabbed the thruster and joystick but you dont. Just press analog stick for thrust and the joystick feels very 3dof like.\n\nBesides controls the movement of the ship just felt very awkward as well. I guess it is supposed to be pretty arcadey but it just seemed hard to get into the game between bad controls and odd ship movement.\n\nOh another issue is lack of reference points. Maybe that changes as you advance but when i played there was a lot of flying straight through dark space to get to something. Maybe thats how actual space would be but it feels boring.\n\nWhile i find the game subpar, i wouldn't say it is a total disaster. I may still come back and blow some things up with the lack of a competing game in this genre. Still, not worth $15 imo. $10 for its current state.\n\nHelpful | 1", "scubaduAug 29, 2019 at 3:31 PM\nNot what I was hoping for.\n\nI was really hoping the graphics were going to be more realistic than they are. I felt like I was playing more of a 3d arcade version of asteroids. I only spent about 15 or 20 minutes playing and I was board with it. So if there are only 12 levels from what I read from another review there's no point on hoping it will get better. I wish someone would make a more realistic space game like a really good Star Trek, as I'm tired of going through dark corridors and caverns.\n\nHelpful | 7", "RainorRunamukSep 26, 2019 at 6:34 PM\nIts. Ok.....\n\nIt's all right the plot there is none you just shoot and fly around and shoot some more and go on different little sorties would be nice to see different ships more weapons anything I mean, this is a boring game after a while. The Debs need to Think more along the line of wing Commander if any of you were alive back then.\n\nHelpful | 3", "omer.aviad.Dec 2 at 2:30 PM\nSome what disappointed \n\nNothing to add\n\nHelpful | 0\nDeveloper ResponseDec 16 at 8:35 PM\n\nI think there is a lot more to add, please reach out to me about why you don't like that game. End Space is created with nothing but love and enjoyment by myself and my brother and we want everyone to get something great out of the game.", "feedbignateSep 7, 2019 at 9:29 PM\nControl options need critica improvement\n\nThis is a fun game and the graphics are great. As someone whos played lots of flying games (sim, arcade, strategy, you name it) I really didnt like the default look to steer setup. Im glad they have an option that allows you to steer with the controller and look to aim the guns, but the default calibration of the controller makes it almost impossible to use and theres no way to recalibrate.\n\nIf youre sitting in a chair holding the Oculus controller at a naturally neutral position, you will be constantly steering the ship down at a severe angle. The only way to get to neutral is to hold the controller very unnaturally at your fingertips with your wrist pulled back.\n\nThere appears to be a calibration option but not if youre using the Oculus controller, which makes no sense to me. I really hope they address this in an update.\n\nHelpful | 1", "john.dalquenOct 5 at 1:31 PM\nSurprisingly great\n\nOne of the best games I own. The controls are good, the action is good. It really feels like a true arcade experience. It's made by one guy, there are so many games made by a team of many that cant reach the heights End Space reaches\n\nHelpful | 0", "tobias633Sep 1, 2019 at 3:09 PM\nWaiting for updates\n\nI like the game but i think the story is too short, in the map i saw other sectors but wasnt able to play in them. Also a game mode with endless waves and a ranking would be nice. I do also hope that you will be able to buy more upgrades and other ships.\n\nHelpful | 0\nDeveloper ResponseSep 1, 2019 at 11:12 AM\n\nThat's all stuff that is planned for future updates! Stay tuned. The other sectors are there for future planned missions :)", "GeeBee2Aug 29, 2019 at 12:08 PM\nGreat fun\n\nGreat immersive experience. Feels like you're flying through space. The sound and visuals make it even more immersive. Not sure of the longevity but it only cost a tenner. I'd like to see more missions, perhaps a variety of mission types as well. This will appeal to the space cadet in everyone!\n\nHelpful | 12", "FuctChaupSep 26, 2019 at 12:06 PM\nControl Mapping\n\nI'm really enjoying this game but the Oculus controls have pitch and yaw on the right stick which drives me crazy. I like roll and pitch on one stick.\nI connected a new Xbox One bluetooth and went to remap however every stick said there was existing mapping. I removed all stick mapping and it still said the sticks are mapped. Reset to defaults doesn't work and now the Xbox control can't move the ship at all... If this is fixed it's 5 stars for sure.\n\nHelpful | 1", "preston.luberSep 21, 2019 at 6:27 PM\nMission Impossible\n\nMission #5 \"Destroy communication satellites\" Has become a souce of frustration. I cannot complete this scenario and get killed every time. I have relegated to playing missions 2-4 numerous times if I want to enjoy the game. In mission #5 the enemy ships and the missiles are way more aggressive than in the previous missions. There must be a secret to beating this level. I dropped my rating from 5 to 3 stars due to the frustration of this level. I can only imagine that subsequent levels will be even more challenging.\n\nIf the creators of this game would add an option to increase shield strength or just make the ship invulnerable it would be IMHO a great thing.\n\nI would like to hear from anyone who had completed #5 to hear their feedback. As of now this game which I loved in the beginning has become a source of frustration and I no longer have a desire to play the same beatable missions 2-4 over and over.\n\nI'd even be willing to buy the option of invulnerability as an in-game purchase if that's what it takes.\n\nHelpful | 3\nDeveloper ResponseSep 1, 2019 at 11:12 AM\n\nThank you very much, glad you like it!", "ryaz.tripOct 23 at 3:33 PM\n\nso much fun. i felt like a true star fighter. the graphics are amazing. would had liked a rear view of whos behind me\n\nHelpful | 2", "HYPERGECKO405Aug 30, 2019 at 5:23 PM\nIts a nice sit-down VR game.\n\nWorth a try!\n\nNothing too revolutionary, the controls took a bit of adjusting to find the right way to play for me. It reminds me a lot of the mission from Halo Reach where youre in space shooting Covenant ships in your mini space ship. Really basic gameplay, you have your primary automatic weapon with some lock on missiles. You can upgrade your ships arsenal a little bit but not much else.\n\nI really do appreciate the fact that it does offer a virtual joystick control option. This is where you rest your right controller on your leg and move it like its a physical joystick in the game. Its actually pretty immersive and impressive when an enemy flies right past you so you tilt your controller back like you would with a physical joystick and you yeet your ship around to relocate your enemy.\n\nAgain, a nice sit down experience that you can have some fun with. I thought I was gonna refund this at first but after a while I realized its a nice game to have in my Oculus Quest library :)\n\nHelpful | 3", "LilguipoSep 15, 2019 at 9:10 PM\nShort review.\n\nArcade kinda game. My dad bought this when he said he was playing beat saber. I dont have to best stomach so it makes me feel a little bit nauseous.\n\nHelpful | 1", "OrdinaryWorldAug 30, 2019 at 12:12 PM\nNot bad. Not great.\n\nIf you want to fly through space and mindlessly shoot things without much skill required then you might like this game. I could be missing something but the gameplay (although not the graphics) seems very one-dimensional and lacking any depth. The controls are good and I like the customization options. The visuals are pretty nice looking too. Perhaps I'm just not cut out to be a space pilot? That said, it didn't make me nauseous like Eve on the Rift.\n\nHelpful | 3", "BusyJRHAug 30, 2019 at 8:29 PM\nFun shooter.\n\nIt really fun space shooter. Great visuals and once you change the movement settings there is no motion sickness. Would love to see this new content added in the future.\n\nHelpful | 2\nDeveloper ResponseAug 30, 2019 at 11:47 PM\n\nThere are more missions planned, new games modes, and more of everything. The game has been updated over 3 years since it's release on Gear VR and will continue to be supported!", "anthonshOct 7 at 9:37 PM\nGood but basic\n\nThe control options take too long to figure out.\n\nHelpful | 0", "smackattack254Sep 27, 2019 at 1:03 AM\n\nAwesome game. To freely move around in any direction and fight in a 360 environment. Just awesome. Can't wait to see more games lime this. I haven't had this much excitement since I was on the swing coaster on the oculus go.\n\nHelpful | 3", "wigginswadeAug 30, 2019 at 10:10 AM\nEnd space\n\nEnd space,\nI was excited to get a space combat sim. But Im a little disappointed. The graphics of the main menu are bad but the graphics of the actual combat are great! The ship controls are amazing. Using your head to control the ship is literally game changing.\n\nBut the storyline (so far) mission 5. Is just boring. The mother ship is boring (1 room so far to explore). And as a hired agent the story line seems impersonal and no sense of urgency. Why am I shooting these guys.\n\nI remember the wing commander and I remember as a teen staying up hours playing through that game. I couldnt wait to see how the chapters unfolded. There was a pilots lounge for plot development.\n\nSo far Im not into the game Im just flying a space sim. The combat and control of the ship is amazing, (although enemies tend to sometimes fly around you in a close circle making it impossible to find them when they are close.) the story line and immersion into the plot. Is just not there. Maybe in mission 6 the bad guys will turn bad or there will be a plot twist? Idk. I hope so. I dont enjoy being a hired gun, I want to save the universe.\n\nHelpful | 2\nDeveloper ResponseAug 30, 2019 at 12:19 PM\n\nSorry you were looking for more of a sim, but you are right, End Space is designed to be on the arcade side of the space spectrum. X-Wing / Wing Commander / Freespace / Tachyon were all favorite games of mine growing up and heavily influenced the development of End Space. However I chose to go for something a little more approachable with End Space for people just getting into VR and space games. It's just me working on End Space and to create something the scale of Wing Commander isn't possible for me yet, but that is the future goal. I thank you for your support, you are helping me realize my dreams of creating the next great game.", "edmozleySep 1, 2019 at 2:39 AM\nReal potential but frustrating\n\nThis game has huge potential but one major problem has made it very frustrating.\n\nHolding my right hand out in front of me for several minutes gets really tiring and it would be so much better if I could sit with my hands resting on my knees and use the joystick to steer.\n\nCurrently if I rest my hands on my knees it thinks I am trying to steer sharply and so sends me into a crazy spin. Once I raise my hand so my arm is horizontal it levels out.\n\nHelpful | 0\nDeveloper ResponseSep 1, 2019 at 11:15 AM\n\nIf you hold down the Oculus Home button for 3 seconds after you have your hands in a comfortable position they will reset there position and you can be comfortable and play End Space for hours on end!", "mjg298Sep 8, 2019 at 9:24 AM\nFun but lacks content or challenge\n\nNice game with interesting controls. Sadly only one hard challenge as a middle level and the rest were easy with no option for increasing difficulty. Also somewhat short and due to ease of completing has little replay value. Good start but needs more substance.\n\nHelpful | 0\nDeveloper ResponseSep 13, 2019 at 5:22 PM\n\nWe are going to be adding a challenge mode as well as more gameplay. Stay tuned!", "ralphael_ninjaAug 31, 2019 at 1:55 AM\nUnderwhelming but okay for the price\n\nIm glad that there were different options for navigating and aiming, which gives the game more playability to choose different methods to try out. However as most reviewers have stated that there is really no feeling of movement in space and the background are more 2d 360 views with spacecrafts that whizzes pass you as you attempt to lock in and fire missiles and that is the whole game; spin around, lock in and fire. However for the price and since there is a lack of any interesting quest titles, this should entertain you for the moment. Its a keeper to help send the developers children to college.\n\nHelpful | 0\nDeveloper ResponseSep 1, 2019 at 11:11 AM\n\nThanks for your support! The Rift version has more animated background in space, but they had to be cut to get the game to run on Quest. Maybe in the future I could find a better technique to make them more immersive.", "fearlessfateSep 8, 2019 at 9:18 PM\nSpace shooter\n\nNot a bad game, Bit of a learning curve with the controls, But it was like that on the oculus go. Good that you get the options to change them I surrpose.\n\nHelpful | 1", "Wraith2021Sep 10, 2019 at 5:19 AM\nAwesomely Immersive Space Fighter!\n\nI had this on the Oculus Go, and to be honest even on the Go i found it way more rewarding and immersive than the X-Wing VR mission on PSVR. One of the main things that really makes the immersion are the controls. Yes it is a rearning curve, but if you hold the right controller just like a flight stick (set the game so that cannons are tied to where you look), you can control the ship and your virtual hand moves the flightstick along with your real hand. They just need to impliment using your left had to control the speed.\n\nOnce you get the hang of flying, it really is rewarding and it really does pull you in, as you catch glimpses of your hand moving in VR just like yur real hand, and that helps you feel like you are in the ship. I played the other ways with controller sticks, but that breaks the immersion.\n\nControls aslide, the graphics are fantastic, the backstroy is great, and the missions are difficult enough to keep you on your toes, well wirth the price.\n\nHelpful | 1", "JWheezySep 30, 2019 at 10:49 AM\nVery underrated if you like the controls\n\nI first became aware of End Space watching YouTube reviews. In the reviews they immediately disliked the control scheme and made the necessary adjustments in the options (negating End Spaces most unique feature). So I figured I would feel the same but it was worth a try because I love anything in a spaceship. Once I tried it, I felt like a cowboy hearing bebop for the first time. Using my gaze as directional control is perfect. I dont find it unpleasant in the least but VR legs is a real thing and experiences that made you queasy in your first few weeks of play, are often very comfortable when you return to them later. The graphics in End Space are good, especially when your always focused on where your going. Im not sitting in my ship peering left and right at planets because that would steer the ship that direction and I am a fighter pilot who doesnt have time for that. The feeling of flying straight at a large enemy ship, firing off a few missiles, careening my head towards the sky and kicking in the boosters as I miss the ship by a few feet is special. If youre making your list of games with a cool pause menu End Space is a serious contender. You can pause amidst all the chaos, checkout the gorgeous cockpit, then stand up (I play sitting) look around and take in the full scale of the action in all its glory (including your headless body writhing beneath you). Dope game.\n\nHelpful | 2", "tarod208Sep 8, 2019 at 11:21 PM\nExcellent space arcade fun!\n\nI hate when people give software a poor rating when they wanted it to be something it never claimed that it was! So I had to log in and write a supportive review. This is a great virtual space shooter action arcade type game. The graphics are way above average for what the Quest is capable of producing! Again surprised to see poor reviews for such a beautiful looking game for a Quest system. Super fun story that doesn't get in the way of the fun action.\n\nMy only recommendation is to change the controller settings to a basic Xbox like setup with your view being the target system. Really fun to look at a Target and lock on. This just my opinion though!\n\nGreat job! I cannot believe this was made by a one person development team! Keep up the great work and I look forward to future development on this and many more new games (I hope).\n\nHelpful | 1", "brandan.ballantyneSep 4, 2019 at 8:27 PM\nGreat game!\n\nThis is exactly what the Quest is made for! Thank you for a great time. Lite on story, but missions are just right when it comes to length and difficulty. Loved the Easter egg game hidden inside the game. Dont be afraid to enjoy yourself. Would like to see the developer make a sequel.\n\nHelpful | 4", "medinad08Sep 2, 2019 at 7:18 AM\nImmersive AF!\n\nI might not be the biggest gamer on here, but this game exceeded my expectations. Truly an amazing experience and a great jump off point for games of this genre on Quest. Reminds me of all those Star Wars space battles, now you can be \"in\" them! I felt the controls were simple enough to use and as you get better at maneuvering, the nauseating feeling is kept minimal. Graphics look good. Could be a little sassier with its heads-up display, weapon choices, think this could benefit from a small map showing your position relative to enemy fighters and objectives.\n\nHelpful | 3", "ZenburnAug 30, 2019 at 6:34 AM\nGreat Dogfight Experience\n\nLove the graphics and premise, been looking for it since they announced it for the Quest. Im struggling a little with the controllers but Im sure Ill be fine given some time.\n\nLove to be in a VR cockpit since Eve: Valkyrie launched. We need more games like these as theyre perfect for the platform - they provide immersion that feels natural to the body. This is the VR fantasy we crave since the 80s.\n\nMy only complaint is that sometimes I have no clear representation that the ship is being hit. Why not using a more aggressive control vibration cue coupled with sparks? Anyway, keep the good work!\n\nHelpful | 5\nDeveloper ResponseAug 29, 2019 at 1:17 PM\n\nHave you tried re-centering by holding the oculus home button on the right controller? That should this issue. If you are using virtual joystick mode it's very picky on being correctly centered. If you need more help just email me at justin@endspacevr.com", "RattleKatSep 15, 2019 at 7:45 AM\nAmazing game.\n\nI don't know what people were expecting but this is the gaming experience I've wanted since I was a kid! It's a perfect blend between arcade action and, if you want, sim-like controls. I've opted to control flight using the stick and guns using my head and it works perfectly. It took me a little while to set dead-zones and fine tune controls but it's been well worth it. Out-maneuvering groups of enemies is very satisfying and some of the missions can feel quite tense. For a one man development, I'm blown away. Took a couple of missions to warm up but after that it's the most fun I've had on the quest. If I had one slight criticism it's that sometimes you don't realise when you're taking fire. Maybe a more intense shake or sound effect would add to the tension? It's very fairly priced so just buy it and have a blast!\n\nHelpful | 4", "JonOneUKSep 1, 2019 at 5:22 PM\nGood game but needs more\n\nThe game is ok but I feel like its missing something, maybe multiplayer?\nThe mechanics are good and its easy to control but i found I was bored after the 2nd level, just gets very repetitive and is too easy. Adding multiplayer would give it 5 stars\n\nHelpful | 0\nDeveloper ResponseSep 2, 2019 at 6:41 AM\n\nSorry JonOne, I am solo developer with no multiplayer experience. End Space is my first game and I don't have the skills. The plan is to add more missions and some more game play modes in the future.", "FuntybunsOct 13 at 12:14 PM\nAwesome arcade space dogfighter\n\nBrilliant controls, graphics and game play. Proper chuffed with this shooter, played it until the batteries died! :)\n\nHelpful | 0", "BopdrummerAug 30, 2019 at 9:37 PM\nSuper Dope\n\nAs a person just getting into VR Ive got to say first Ive bought almost every popular title and this one is too cool, I love the head nod to the retro space arcade games, and to the single developer bro you killed it youre clearly a genius and I would buy whatever you make in the future! Kudos man!\n\nHelpful | 3\nDeveloper ResponseAug 30, 2019 at 11:48 PM\n\nThank you so much!", "SoapySonOct 5 at 3:24 PM\nLove it\n\nVery fun and immersive but stuck on level 5 and can't pass it which is annoying as wanted to keep playing but unsure what I'm doing wrong\n\nHelpful | 1\nDeveloper ResponseDec 16 at 8:49 PM\n\nFeel free to join our Discord and ask other players for help https://discord.gg/8mQWFec", "nylok33Sep 18, 2019 at 7:34 PM\nMy dream from 1999\n\nIt made me so happy to see this game show up in my google cards as a new quest game. I snuck down the stairs at 2am like a child on Christmas morning. Brought me right back to Privateer on floppy disk. Keep making more!!!\n\nHelpful | 1", "DenL-VRAug 29, 2019 at 7:06 PM\nExactly what I was looking for!\n\nReally enjoy the game, met my expectations, cant wait for more missions to come and wave mode (author mention on Reddit those will come at no cost). It is a beautiful game, the cockpit is awesome. I do enjoy the combat style (move ship with my head and guns with the controller) considering it was made by a single person, it is an impressive game.\n\nHelpful | 3\nDeveloper ResponseAug 29, 2019 at 10:28 PM\n\nGlad you like it!", "gideonstrangeOct 5 at 10:35 AM\n\nEnjoy it. Wish it was longer and had more builds to ship and weapons.\n\nHelpful | 0", "justmetooSep 1, 2019 at 12:53 AM\nOne of the best\n\nThis is one of the best on the store.. i think oculus needs to look more at people like me who are just starting in vr.. get a greater variety of games. Even if they are older. For us they are not.. endspace gives an arcade type experience where and when i want it....\n\nI know there are memory problems putting a lot of games on. But. Like on the go if i want different things to play. I change them around at the start of the session..\n\nAnyway. Endspace is a very good arcade experience. To wash away the sins of the day with....\n\nHelpful | 1\nDeveloper ResponseSep 1, 2019 at 11:13 AM\n\nGlad to hear you enjoy and thanks for the positive review! Look forward to bringing you more End Space :)", "mcwhorterbryanAug 30, 2019 at 7:17 PM\n\nFirst, I should state that I love space shooters. I played all the Wing Commander games, etc. I was excited to hear about End Space. Now that I have it, I am not let down. The game is fun to play. It does not have all the elements of some of the other games, but the VR experience more then makes up for it. In Wing Commander, I used my cockpit radar to see where enemy ships were. This enabled me to avoid and attack them with ease.\n\nThe controls are easy to use and adjustable. I was flying and shooting down enemy craft in no time. The game environment looks great and I foresee many hours gameplay ahead. For $15.00 the game is well worth adding to your library if you enjoy flying through space and blowing up enemy fighters.\n\nHelpful | 2\nDeveloper ResponseAug 30, 2019 at 11:46 PM\n\nThanks for the great review and glad you enjoyed it! Makes my day to hear stories like this :)", "shmanyAug 30, 2019 at 4:07 PM\nNot bad but not great either.\n\nThis game was not as good as I expected it to be.however for the price and considerating one man made it himself I have to give the developer credit for his efforts.i will not be asking for a refund as the developer deserves support.\n\nHelpful | 1", "jesse.schermerhornSep 2, 2019 at 3:04 PM\nCome on now.\n\nFun little spaceship flyer. Controls feel good and are fun. For a lone developer its a fun arcade style game. Keep it up.\n\nHelpful | 3", "sheppie73Sep 2, 2019 at 11:44 AM\nEnjoyable\n\nAn enjoyable space shooter which looks great with controls that are really intuitive.\nIts a little short and could do with a few more levels and more location diversity but on the whole I enjoyed the experience.\n\nHelpful | 2\nDeveloper ResponseSep 2, 2019 at 1:37 PM\n\nThere are more missions, and new game modes in development, Stay tuned for future updates :)", "hkgroovyAug 31, 2019 at 1:17 AM\nUpdate in progress\n\nI started the game after installation. But then it said Update in progress and told me to connect with power and Wi-Fi until the update is finished. I followed for 30 min but still displayed the same message. Any advice ? Thanks.\n\nHelpful | 1\nDeveloper ResponseAug 31, 2019 at 1:20 AM\n\nThis has been a problem with the Oculus servers over the weekend. Stop the download, and restart everything. It's not a fault of the game but of the delivery of the game from the Oculus servers. Also try installing the game just from inside the headset instead of through the app.", "DaveS1138Sep 1, 2019 at 6:47 PM\nLots of fun\n\nVery good looking and lots of fun space combat. Reminds me a lot of the old X-Wing and Wing Commander games. Something that has been in surprisingly short supply on the Quest. Would really like to see additional story and missions added as future DLC. Strongly recommended :)\n\nHelpful | 2", "colten.willisOct 1 at 6:54 PM\n\nGreat game i have to stop after a while from motion sickness but flight wise its the best game i have ever come across so far\n\nHelpful | 1", "DAX_QcAug 29, 2019 at 2:23 PM\nControls are f* up, game boring\n\nNope. You do not have the feeling of flying at all. All you feel is if you are siting is a 360 slow turret. Controls are very NOT clear. The menus are basics as the game. Refunded. 1st space sim on quest. Fail.\n\nHelpful | 12\nDeveloper ResponseAug 30, 2019 at 12:09 PM\n\nSorry to hear that DAX-Qc. I agree there could be some better explanation of the controls however once you get used to them they are very intuitive. You could also try playing with a gamepad or joystick if you feel like it.", "Studly_McSexfireAug 30, 2019 at 7:42 PM\nAwesome!\n\nI love it. Its nice to have the ability of customizing the control scheme to such an extent. I thought it was gonna make me sick but it doesnt. Its great. Really cool you can use the touch controllers as virtual joysticks. Great price great game.\n\nHelpful | 3\nDeveloper ResponseAug 30, 2019 at 11:46 PM\n\nThanks for the kind words! Happy to hear you enjoy the game and look forward to bringing you more End Space!", "orrcorman21Sep 12, 2019 at 9:01 AM\nVery cool.\n\nI can definitely sense the designers influences in this game. It made everything cool about flying and combat in wing commander except now I feel like Im in the cockpit. Well done\n\nHelpful | 2", "mlantrySep 2, 2019 at 6:19 AM\nLoved it within 5min\n\nI read the reviews and they were a bit mixed. That said 5 min in and I was loving it. We rarely get good dog fighting games like this anymore. A good throw back to Xwing and Tie Fighter. I spent a lot of hours on that growing up.\n\nHelpful | 2\nDeveloper ResponseSep 2, 2019 at 6:39 AM\n\nMe too, most of my childhood was spent playing Tie Fighter. I still come back to play it :) Thanks for your support!", "TheWinner11111Aug 29, 2019 at 12:19 PM\nWow\n\nFeels like you're in a movie!\n\nHelpful | 8", "JNSSep 3, 2019 at 2:15 PM\nTop notch game\n\nThis is a really nice game. However make sure that you change the controls. Fly your ship with the joysticks and use freelook for aiming. Otherwise it is too easy and that kills the fun. Big up to the dev!\n\nHelpful | 1", "lorissasSep 3, 2019 at 8:46 PM\nGood arcade game\n\nLooking for a space / pilot game where you get to blow stuff up! This is it! Hopefully there will be updates and more game features soon! Good graphics and fun controls! Bring on the bad guys!\n\nHelpful | 1", "BobaJoeSep 1, 2019 at 10:59 AM\nWOW this is amazing!!\n\nFrom the adaptable controls to the flight physics this game is everything I desired in a space flight combat. Someone give these guys full funding to continue this amazing story!!!!\n\nHelpful | 2", "darwins.lastAug 29, 2019 at 11:02 AM\nBeautiful on Quest\n\nThis game looks amazing. Graphics are great. Action is fun. Very immersive. Change controller settings and it's a blast. Would love to see a pvp area!\n\nHelpful | 6", "neuraldaggerAug 31, 2019 at 7:42 PM\nVery cool\n\nI think its super fun, and well worth the price\n\nHelpful | 1", "TxTomSep 19, 2019 at 7:37 AM\n\nLOVE this game! but was Sad there are only 12 Missions, I hope there will be more Add!\n\nHelpful | 1", "keemo3912Aug 30, 2019 at 3:38 AM\nVery well\n\nI find this game very good,its not as elite dangerous obviously,but for the quest its very well.I would know if more mission or Multiplayer mode will be planning soon ?\n\nHelpful | 2\nDeveloper ResponseAug 30, 2019 at 11:59 AM\n\nMore missions are planned and a new game mode. Multiplayer is not possible. This game is developed by one person and I don't have the skills / time to implement it properly.", "embersVSep 4, 2019 at 11:03 AM\nReally good!\n\nI wont binge play this but it is the perfect sit down game with not much body movement. Great first effort of this genre for this platform. Well done!\n\nHelpful | 1", "emboyeriii1972Aug 31, 2019 at 12:34 AM\nGreat Game. Hope more content added\n\nThis game reminded me a little of colony wars. I just hope the campaign is made longer and more content and upgrades become available. Worth the price though.\n\nHelpful | 2", "PrestoniLCFCSep 14, 2019 at 2:55 AM\nMe and my Dad love it\n\nMy Dad got it for me today and I played it and Its amazing feel like Im in Star Wars\n\nHelpful | 2", "Aracnareaper007Aug 30, 2019 at 11:16 PM\nSweet space shooting game\n\nNice Graphics. Fun gameplay. Intense Space Combat action. 5 stars. Wish it had pvp multiplayer though\n\nHelpful | 1\nDeveloper ResponseAug 30, 2019 at 11:49 PM\n\nMultiplayer would be great to do, but I'm a solo dev and End Space is my first game. Multiplayer is incredibly complex and I don't have the skills to do it properly. But I agree it would be so much fun!", "punkgeekSep 10, 2019 at 7:57 AM\nI had too high of expectations?\n\nNot a bad game. But the \"fun\" of space combat seems to be missing. I applaud the dev and was really looking forward to it but I just kinda stopped playing.\n\nHelpful | 0", "FrankderTankSep 8, 2019 at 10:31 AM\nBeta Work\n\nGood Idea, but you cant configure it. If you control with sight it only works for a minute. Than you have to look at the ceiling to fly straight. In the menu, nothing works as it says.\n\nHelpful | 1\nDeveloper ResponseSep 13, 2019 at 5:22 PM\n\nSounds like you are having tracking issues. Be sure to recenter the game by holding down the Oculus button for 3 seconds if you experience something like this.", "KonaaAug 30, 2019 at 9:24 AM\nFlight controls suck\n\nThe joystick doesnt work and the other flight control is annoying because you cant look around without completely turning youre ship, graphics are very good but overall is a waste\n\nHelpful | 1\nDeveloper ResponseAug 30, 2019 at 11:55 AM\n\nIf you hold down the left thumbstick while using gaze for flight you can look around the ship. What problems are you having with the joysticks otherwise? Also the game supports gamepads if you prefer to use that.", "oshannelAug 30, 2019 at 5:17 PM\nGreat game\n\nGreat game, good controls, not too bad on the vr sickness. Would suggest possibly adding a multiplayer functionality for longevity.\n\nHelpful | 2", "HOTROCKS.CALLABYAug 30, 2019 at 11:49 AM\n\nI bought it on the GO and enjoyed it and bought it on the quest and its so much better to look at and play\n\nHelpful | 2\nDeveloper ResponseAug 30, 2019 at 11:54 AM\n\nAwesome, great to hear you like the game and thanks for your support!", "trapperjimDec 10 at 8:12 AM\n\nGreat game for the Quest, will there be more missions I see there is still some space at the top of the mission board\n\nHelpful | 0\nDeveloper ResponseDec 16 at 8:30 PM\n\nGood things come to those who wait!", "xXMedheadXxAug 30, 2019 at 4:08 PM\nNeeds more\n\nAll I want is for sim controls\n\nHelpful | 1", "aprillstrombergAug 29, 2019 at 5:34 PM\nOk\n\nThe game seems ok but made me extremely sick\n\nHelpful | 4\nDeveloper ResponseAug 29, 2019 at 10:28 PM\n\nTry some of the other control options. There are a lot of options there and they all affect how you feel with the game.", "Godislove4uSep 1, 2019 at 5:13 PM\nI played it on gear,viveport and quest\n\nBest on quest.Jesusavesouls !\n\nHelpful | 1\nDeveloper ResponseSep 2, 2019 at 6:43 AM\n\nThank you for your support of End Space.", "PsDHarpSep 5, 2019 at 6:11 PM\nBad\n\nThis game is so boring graphics are also horrible\n\nHelpful | 2", "krishoskins85Sep 17, 2019 at 11:29 AM\nTerrible\n\nHad if few days still can't play it . Keeps saying needs update needs update , leave it on for 2 hours check again still no work . Don't even give option to update . I've deleated it and reinstalled it still no chance .. can you please fix this game doing my nut in now\n\nHelpful | 7"]