{"App Title": "Epic Roller Coasters", "App description": "NEW Realistic Pack added featuring five new theme park rides... One of them is on us and there will be more soon with no extra costs.\n\nMULTIPLAYER was redesigned to be much more easy and pleasant to find someone or a friend!\n\nIn Epic Roller Coasters you'll get the same feeling of real roller coasters in places and situations that probably you will never have in the real life!\n\nYou'll find four different modes:\n- Classic is where you, your family or friends can take a clasic roller coaster ride.\n- Shooter mode is the perfect combination of two amazing universes! Roller coasters and shooting! You can have a completely different view of the ride with the slowmotion feature that will also help you to aim over high speeds and get more hits!\n- Race mode: take the control of the cart on your own time or fast as possible challenging your friends for the best score!", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfort: IntenseSupports QuestSupports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Sitting, Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Racing, Roller Coaster, Shooter", "Languages": "English, Chinese (China), French (France), German, Japanese, Korean, Portuguese (Brazil), Russian, Spanish (Spain)", "Version + Release Notes": "6.26.0", "Developer": "B4T Games", "Publisher": "B4T Games", "Website": "http://b4t.games/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Privacy Policy\nB4T Privacy Policy\n\nEffective Date: February 12, 2017\n\nB4T Games (B4T, we, us) makes virtual reality products where users can download content. Collectively, we describe our productsincluding our websites, mobile apps, platform and contentas our Services. This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\nBy visiting or using our Services, you consent to the practices described in this Privacy Policy. If you have questions about this Privacy Policy, please contact us at contact@b4t.games.\n\n1. What kind of information is collected?\n\nDepending on which Services you use, we could collect different kinds of information from or about you, such as:\n\nInformation You Give Us:\nE-mail address;\nComments on our posts and forums.\nInformation Automatically Collected About You When You Use Our Services:\nLocation information, which can be derived from information such as your devices IP address. If youre using a mobile device, we may collect information about the devices precise location, which is derived from sources such as the devices GPS signal and information about nearby WiFi networks and cell towers;\nThird parties may also collect information about you through the Services, like Google Analytics.\n2. How do we use information?\n\nWe use the information to promote our apps and to do things that help us provide a better content to you:\n\nTo market to you. We use the information you give us to send you promotional messages and content and otherwise market to you on and off our Services. We also use this information to measure how users respond to our marketing efforts.\n\n3. Who can get information about me?\n\nWe share your information with no one.\n\n4. Changes to this Privacy Policy\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, providing notice through the Services, and/or updating the Last Updated date at the top of these Terms.\n\n9. Contacting Us; Data Access and Deletion\n\nIf you have any questions about this Privacy Policy, or if you would like to deactivate or delete your account or access data associated with it, please contact us at contact@b4t.games. Content deleted from the Services may remain in backup copies and logs for a period of time.\n\nConnect socially withB4T\nLike on Facebook\n \nFollow on Twitter\n \nFollow on Instagram\n \nWatch on Youtube\nB4T Games 2018. All rights reserved", "Developer Terms of Service": "Terms of Service\nB4T Terms Of Service\n\nLast Updated: March 28, 2017\n\nBY ACCEPTING THESE TERMS OF SERVICE OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THESE TERMS OF SERVICE IN THEIR ENTIRETY. IF YOU DO NOT AGREE TO THESE TERMS OF SERVICE, DO NOT ACCESS OR USE OUR SERVICES.\n\nTHESE TERMS OF SERVICE CONTAIN IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SERVICES, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS. PLEASE READ THE DISPUTE RESOLUTION SECTION (SECTION 18) IN ITS ENTIRETY. IN ADDITION, CERTAIN TERMS AND CONDITIONS MAY BE APPLICABLE TO USERS THAT RESIDE OUTSIDE THE UNITED STATES. PLEASE REVIEW SECTION 26 TO DETERMINE WHETHER THESE TERMS AND CONDITIONS APPLY TO YOU.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THESE TERMS OF SERVICE. MAKE SURE TO REVIEW THESE TERMS OF SERVICE WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nB4T Games (B4T, we, us or our) is pleased to provide you access to software, websites, applications, and content (collectively, the Services). These Terms of Service (Terms) apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with B4T for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nB4T reserves the right to change or modify these Terms on a going forward basis at any time and in our sole discretion. If B4T makes changes to these Terms, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided, providing notice through the Services and/or updating the Last Updated date at the top of these Terms. Your continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with the English version, the English version controls.\n\n1. Eligibility; Registration and Account\n\nThe Services are intended solely for users who are 13 or older. Any registration for, or use of, the Services by anyone under the age of 13 is unauthorized, unlicensed and in violation of these Terms. You represent and warrant that you (a) are not identified on the Office of Foreign Assets Controls Specially Designated Nationals List (SDN List), (b) are not placed on the U.S. Department of Commerces Denied Persons List or Entity List or any other U.S. export control list, (c) will not use IP proxying or other methods to disguise the place of your residence, (d) will not use the Services if any applicable laws in your country prohibit you from doing so in accordance with these Terms and (e) have not previously had your right to use the Services suspended or terminated.\n\nTo access and use certain features of the Services, you may be required to register for an account. By creating an account, you agree to: (i) provide accurate, current and complete account information; (ii) maintain the security of your password, not share your password with any other person and accept all risks of unauthorized access to your account; and (iii) promptly provide notice at https://www.facebook.com/whitehat if you discover or otherwise suspect any security breaches related to the Services.\n\n2. Equipment; Software; and Updates\n\nCertain equipment and software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our community standards, agreements, laws, regulations or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\n3. Your Use of the Services and Content\n\n3.1 Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (Software and Content), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by B4T or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n3.2 Third-Party Content. Your use of services, applications, or content provided by third parties (Third Party Content) made available through the Services may be subject to additional end user agreements. In the event that these agreements conflict with the provisions of these Terms, these Terms will govern. B4T has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall B4T be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not B4T) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n3.4 Trial Access to Services. We may offer free trials or other limited versions of Services so you can preview Services before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n3.5 Availability of Services after Purchase; Updates. Some Services may rely on services provided by third parties for some or all of its functionality. Such Services may not function properly or may become inoperable if these third parties discontinue their services.\n\n3.6 Support. B4T will be responsible for some features of some our contents but questions related to the purchase of Services may be responsible of Third Party companies, like Oculus VR, LLC. B4T has no obligation to provide support for Third Party Content. Please contact us through the support forums at https://b4t.games/forums for assistance.\n\n3.7 Availability. The Services and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n3.8 Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n4. Acceptable Use\n\nBy accessing or using the Services, you agree that you will not: (a) access or use the Services in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Services, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Services in any manner; (c) access or use the Services for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, community standards or any other terms or policies provided in connection with the Services; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Services; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Services or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Services, or third parties; and (h) infringe upon or violate the rights of B4T, our users or any third party.\n\n5. User Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Services, you grant B4T a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Services. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to B4T the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our community standards.\n\nB4T does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. B4T has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nIn the event you want to help some people submitting User Content to B4T forums or other sections, you acknowledge and agree with this section of the Terms.\n\n6. Privacy Policy\n\nOur Privacy Policy, which is available at http://b4t.games/pp, is incorporated into these Terms and sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as developers of Third Party Content and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Services. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n7. Additional Terms\n\nThese Terms are in addition to, and do not replace or change, any other agreements you enter into with B4T, which may include but are not limited to our developer agreements, special device terms of use, community standards and contest, competition, or promotion-related terms.\n\nYour purchase and use of Third Party Content may be subject to additional terms, including but not limited to third-party end user agreements, and privacy policies. We encourage you to review any third-party agreements and policies carefully before accessing, downloading or using Third Party Content.\n\n8. Ratings\n\nWe may display age, comfort, and content ratings for digital content that are based on information provided to us by the developers of such content. We cannot guarantee that digital content ratings will always be accurate, nor can we promise that you will not find some material harmful, offensive, indecent or objectionable.\n\n9. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Services are the property of B4T or our licensors and are protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\n10. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials or other information about B4T and our Services (collectively, Feedback). You agree that B4T and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n11. Hyperlinks\n\nYou are granted a limited, non-exclusive right to create text hyperlinks to our websites for noncommercial purposes; however, you may not use our logos or other proprietary graphics to link to our sites without our express written permission.\n\nThe Services may contain links to third-party websites, applications or other third-party services, and you understand that by accessing third-party links, you may be exposed to content that is offensive, harmful, inaccurate or otherwise inappropriate. You understand and agree that we are not responsible or liable for the availability or accuracy of such third-party properties or the content, products or services made available through such properties. We do not endorse or control such third-party properties and we make no representations or warranties of any kind regarding such properties. If you access or use any third-party properties, you should also be aware that such third parties terms and policies will govern.\n\n12. Disclaimers\n\n15.1 THERE ARE IMPORTANT HEALTH AND SAFETY THIRD PARTY WARNINGS AND INSTRUCTIONS THAT YOU MUST READ BEFORE USING THE SERVICES. BY USING THE SERVICES, YOU REPRESENT AND WARRANT THAT YOU HAVE READ AND UNDERSTAND THESE WARNINGS AND INSTRUCTIONS. WE MAY UPDATE OR REVISE THESE WARNINGS AND INSTRUCTIONS, SO PLEASE REVIEW THEM PERIODICALLY. ADDITIONAL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS MAY BE PROVIDED BY DEVELOPERS IN RELATION TO SPECIFIC THIRD PARTY PLATFORM. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS BEFORE USING THE SERVICES.\n\n13. Modifications to the Services\n\nB4T reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will B4T be liable for the removal of or disabling of access to any portion or feature of the Services.\n\n14. Termination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n15. Severability\n\nIf any provision of these Terms shall be deemed unlawful, void or for any reason unenforceable, then that provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions.\n\n16. Contact Us\n\nIf you have any questions or concerns regarding these Terms or our Services, please contact us through the support portal at https://b4t.games/forums/.\n\nConnect socially withB4T\nLike on Facebook\n \nFollow on Twitter\n \nFollow on Instagram\n \nWatch on Youtube\nB4T Games 2018. All rights reserved", "Space Required": "613.4 MB"}



["5 stars\n30%\n4 stars\n13%\n3 stars\n15%\n2 stars\n15%\n1 star\n28%", "christinamarybrown6 days ago\nDevs PLEASE FIX MULTIPLAYER\n\nI love Epic and I think the new realistic coasters are great as well as the amazing graphics upgrade on some of the originals. However the upgrade has the multiplayer all sorts of messed up. I tried multiple times to ride with a friend last night and it was awful. The 1 time we finally ended up in same coaster and saw each other we said YAY! Then we were both booted and the entire game crashed for both of us. So just thought you should know. This is one of my favorite features riding together. So really hoping you fix soon. Thanks\n\nHelpful | 7\nDeveloper Response4 days ago\n\nAn updated is out fixing this issue! Thanks again.", "pdemorypJun 9 at 1:27 PM\nCould be 5 stars if .....\n\nThe game is great! I bought all 18 tracks. The only problem I'm having is in multiplayer mode. One player can see both avatars and the game play, but the other player can only see the other avatar and a blackout screen. If you pause/return to lobby/pause/resume.....etc. sometimes you can get both players to be able to see simultaneous gameplay. If this were fixed to be able to work in multiplayer on the first try, I would give it 5 stars.\n\nHelpful | 64\nDeveloper ResponseJun 19 at 3:55 PM\n\nHello again, the update with this fix is out! Please let us know if you need anything else. Thanks.", "chubtoad1Jun 24 at 10:28 AM\nFun for Special Needs youth\n\nHonestly I think its great value getting all the coasters for $12.00. I have an adult son with Downs Syndrome and Autism. He loves his playstation games esp all the Lego ones so we were unsure how the VR thing would work out. Kinda thought maybe it would be to much stimulation. Anyway he loves it . We take turns doing the roller coasters and cast it to our big TV. He's been hesitant about most of the rides at places like Disney and I'm hoping this will get him used to the idea from the safety of our home. In general I think this VR thing might end up being a whole line of consideration for Special needs, and mobility challenged kids, youth and adults. For fun but also therapy. Anyway great fun -thx for the coasters !!!\n\nHelpful | 44\nDeveloper ResponseJul 7 at 4:13 PM\n\nThat's great to hear! Thanks for letting your feedback here.", "gabbytheguppy118 days ago\nEven the free coasters are so worth it!!\n\nI got the free version of this game and the coasters that come on the game for free are so worth it. I dont think this game gets the right ratings that it should. I think this game should get 4-5 stars from someone every time. I love going on the coasters with a fan in front of me at home. I seems so real and even my parents love it! This was very worth it!!!\n\nHelpful | 6", "Dark_Nebula6 days ago\nWhat do I do?\n\nI absolutely love this game, but Im having trouble with multiplayer. When the person gets on a coaster, and I join them on the same one, it says I have to wait for the other player to be in the same place as me. Please help\n\nHelpful | 0\nDeveloper Response4 days ago\n\nHey there! An updated is out fixing this issue! Thanks for being in touch."]