{"App Title": "Face Your Fears 2", "App description": "You asked for it! Now you can jump right into the scares...try quickplay for shareable screams. \n\nAre you prepared to Face Your Fears and step into Harvest House?\n\nLearn the tragic history of the Harvest Family as you explore their long-abandoned home. Immerse yourself in two spine-tingling scenarios that unravel a tale of terror across the ages. In the first, your sister is missing and all roads lead to the old Harvest Estate. Next, take on the role of a paranormal investigator and come face to face with the evil that dwells there. \n\nCan you escape the same fate that befell other interlopers in these blighted halls, or will you forever remain buried in Harvest House?\n\nWe are proud to support Cross-Buy - buy the game once and play it on Quest or Rift/Rift S!", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Exploration, Horror, Narrative", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "1.0.487009", "Developer": "Turtle Rock Studios", "Publisher": "Oculus Studios", "Website": "https://www.turtlerockstudios.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "STUDIO\nGAMES\nVR\nCAREERS\nCOMMUNITY\nNEWS\nSOCIAL\nTURTLE ROCK STUDIOS, INC. END USER LICENSE AGREEMENT\nLAST MODIFIED ON NOVEMBER 12, 2019\n\nPLEASE READ THIS AGREEMENT CAREFULLY; THIS IS A BINDING CONTRACT.\n\nThis End User License Agreement (this EULA) describes the terms and conditions between you and Turtle Rock Studios, Inc. and its affiliates (TRS, we, our, or us), and governs your use of any online service location or application that posts or provides you a link to the EULA, including, without limitation, the applications Face Your Fears, Face Your Fears II, Other Worlds, The Well and Journey of the Gods (each, the App), and all features, content and other services that we own, control, and make available through such online service locations and the App (collectively, the Service).\n\nYOUR USE OF THE SERVICE SIGNIFIES THAT YOU AGREE TO THIS EULA AND CONSTITUTES YOUR BINDING ACCEPTANCE OF THIS EULA, INCLUDING ANY MODIFICATIONS THAT TRS MAKES FROM TIME TO TIME.\n\n1.EULA Updates. We reserve the right, at any time in our sole discretion, to modify or replace any part of the EULA and will provide you with notice for any material changes to the EULA. If you object to any such changes, you agree that your sole recourse is to cease using the Service.\n\n2.Service Use.\n\n2.1Content. The Service contains: (i) materials and other items relating to TRS and its products and services, and similar items from our licensors and other third parties, including all layout, information, databases, articles, posts, text, data, files, images, scripts, designs, graphics, instructions, illustrations, photographs, sounds, pictures, videos, games, applications, advertising copy, URLs, technology, software, algorithms, interactive features, the look and feel of the Service, and the compilation, assembly, and arrangement of the materials of the Service and any and all copyrightable material; (ii) trademarks, logos, trade names, trade dress, service marks, and trade identities of various parties, including those of TRS (TRS Marks); and (iii) other forms of intellectual property (all of the foregoing, collectively Content). All right, title, and interest in and to the Service and the Content is the property of TRS or our licensors or certain other third parties, and is protected by U.S. and international copyright, trademark, trade dress, patent and/or other intellectual property and unfair competition rights and laws to the fullest extent possible. A list of credits and notices for third party components of the Content is set forth in Exhibit 1.\n\n2.2 Limited License. Unless stated in another written agreement between you and TRS, and subject to your strict compliance with the EULA, TRS grants you a limited, non-exclusive, revocable, non-assignable, personal, and non-transferable license to download, display, view, use, and play the Content on a personal computer, browser, laptop, tablet, mobile phone, or other internet-enabled device (each, a Device), in each case for your personal, non-commercial use only. The foregoing limited license (i) does not give you any ownership of, or any other intellectual property interest in, any Content, and (ii) may be suspended or terminated for any reason, with or without cause, in the sole discretion of TRS, and without advance notice or liability. Your unauthorized use of the Content may violate copyright, trademark, privacy, publicity, communications, and other laws, and any such use may result in your personal liability, including potential criminal liability. \n\n2.3 Availability. TRS may suspend or terminate the availability of the Service and Content, in whole or in part, to any individual user or all users, for any reason, in the sole discretion of TRS, and without advance notice or liability. Upon suspension or termination of your access to the Service, or upon notice from TRS, all rights granted to you under the EULA or any applicable Additional Terms will cease immediately, and you agree that you will immediately discontinue use of the Service and Content.\n\n2.4 Reservation of Rights. All rights not expressly granted to you are reserved by TRS and its licensors and other third parties. No right or license may be construed, under any legal theory, by implication, estoppel, industry custom, or otherwise. Any unauthorized use of the Content or Service for any purpose is prohibited.\n\n2.5 Virtual Reality Devices. You must have an Internet-enabled third party virtual reality headset device (a VR Device) that is compatible with the Service in order to access and use the Service. You are solely responsible for ensuring that your VR Device is compatible with the Service. The applicable third party provider of the VR Device, and not TRS, is solely responsible for any warranties, liabilities and all other matter relating to the VR Device.\n\n2.6 Health and Safety Warning. You understand and agree that the Service is designed for use on a virtual reality platform and that there are inherent risks of personal injury, discomfort, and/or property damage that may be associated with virtual reality platforms and the Service. To reduce these risks, it is important that you read, evaluate and follow all health and safety warnings, guidelines, and instructions with respect to the virtual reality platform that you are using. By using the Service, you represent and warrant that you have read and understand all such warnings, guidelines, and instructions. Be aware of your surroundings when using the Service. You may injure yourself or others if you do not properly clear the space in which you may use the Service. You are solely responsible for your use of the Service and assume all risks associated with your use of the Service and any activities related thereto. The Service may contain flashing lights, realistic images and simulations. Some people may experience side effects such as motion sickness, epileptic seizures, momentary loss of consciousness, dizziness, or nausea when viewing certain types of flashing lights or graphics that are included in the Service. This may happen where a person has not previously suffered in this way and has no known symptoms or history of these side effects. If you have a condition which makes this possible or you have experienced similar symptoms, please consult a doctor before using the Service. If you feel dizzy, tired, fatigued or uncomfortable when using the Service, please stop using the Service. If these symptoms continue after you have stopped using the Service, please consult a doctor. Nothing herein shall be construed as an admission or a waiver on behalf of TRS.\n\n3.Disclaimer of Representation and Warranties.\n\nTHE SERVICE IS PROVIDED TO YOU ON AN \"AS IS,\" \"AS AVAILABLE,\" AND \"WITH ALL FAULTS\" BASIS. NEITHER TRS NOR ANY OF ITS OFFICERS, DIRECTORS, MANAGERS, EMPLOYEES OR AGENTS (COLLECTIVELY, THE \"TRS PARTIES\") MAKE ANY REPRESENTATIONS, WARRANTIES OR ENDORSEMENTS OF ANY KIND WHATSOEVER AS TO THE CONTENT OR OTHER SERVICES, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, OR ARISING FROM COURSE OF DEALING, COURSE OF PERFORMANCE OR USAGE OF TRADE, INCLUDING, TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE IMPLIED WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT AND FREEDOM FROM COMPUTER VIRUS. BY ACCESSING OR USING THE SERVICE YOU REPRESENT AND WARRANT THAT YOUR ACTIVITIES ARE LAWFUL IN EVERY JURISDICTION WHERE YOU ACCESS OR USE THE SERVICE.\n\nNOTWITHSTANDING THE FOREGOING, AND TO THE MAXIMUM EXTENT PERMITTED BY LAW, THESE DISCLAIMERS DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n4. Limitations of Our Liability.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL THE TRS PARTIES BE LIABLE TO YOU FOR ANY LOSS, DAMAGE OR INJURY OF ANY KIND INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, CONSEQUENTIAL OR PUNITIVE LOSSES OR DAMAGES, OR DAMAGES FOR SYSTEM FAILURE OR MALFUNCTION OR LOSS OF PROFITS, DATA, USE, BUSINESS OR GOOD-WILL, ARISING OUT OF OR IN CONNECTION WITH (A) THE SERVICE, (B) THE EULA OR (C) YOUR MISUSE OF THE SERVICE OR ANY CONTENT AVAILABLE ON OR THROUGH THE SERVICE, INCLUDING, WITHOUT LIMITATION, THE TRS MARKS. THE LIMITATIONS SET FORTH IN THIS SECTION SHALL APPLY REGARDLESS OF THE FORM OF ACTION, WHETHER THE ASSERTED LIABILITY OR DAMAGES ARE BASED ON CONTRACT, INDEMNIFICATION, TORT, STRICT LIABILITY, STATUTE OR ANY OTHER LEGAL OR EQUITABLE THEORY.\n\nNOTWITHSTANDING THE FOREGOING, THESE DISCLAIMERS HEREIN DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n5. Indemnification.\n\nYou agree to defend, indemnify and hold harmless the TRS Parties from and against any and all claims, liabilities, damages, losses, costs and expenses (including, reasonable attorneys fees and costs) arising out of or in connection with any of the following: (i) your breach or alleged breach of the EULA; (ii) your misuse of the Service or Content; (iii) your violation of any laws, rules, regulations, codes, statutes, ordinances or orders of any governmental or quasi-governmental authorities; (iv) your violation of the rights of any third party, including any intellectual property right, publicity, confidentiality, property or privacy right; or (vi) any misrepresentation made by you. TRS reserves the right to assume, at your expense, the exclusive defense and control of any matter subject to indemnification by you. You agree to cooperate with the defense by TRS of any claim. You will not in any event settle any claim without the prior written consent of TRS.\n\nThis provision does not require you to indemnify us for any unconscionable commercial practice by us or for our fraud, deception, false promise, misrepresentation or concealment, suppression or omission of any material fact in connection with the Service.\n\n6.Restrictions and Conditions of Use.\n\n6.1.Use of Service. TRS permits you to view and use a single copy of the Service for your personal, non-commercial use. You agree not to license, create derivative works from, transfer, sell or re-sell any information, Content, or services obtained from the Service.\n\n6.2.No Violation of Laws. You agree that you will not violate any applicable law or regulation in connection with your use of the Content or Service. The Service is operated by TRS in the United States. Those who choose to access the Service from locations outside the United States do so on their own initiative and are responsible for compliance with applicable local laws.\n\n6.3.No Commercial Uses. You agree that you will not use the Content or Service for any commercial purpose or the benefit of any third party or charge any person, or receive any compensation for, the use of the Content or Service.\n\n7.Children. The Service is not directed toward children under 13 years of age nor does TRS knowingly collect information from children under 13. If you are under 13, please do not submit any personally identifiable information to TRS.\n\n8.Agreement to Arbitrate Disputes and Choice of Law.\n\nPLEASE READ THIS SECTION CAREFULLY  IT MAY SIGNIFICANTLY AFFECT YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO FILE A LAWSUIT IN COURT AND TO HAVE A JURY HEAR YOUR CLAIMS. IT CONTAINS PROCEDURES FOR MANDATORY BINDING ARBITRATION AND A CLASS ACTION WAIVER.\n\n8.1 We Both Agree to Arbitrate. You and TRS agree to resolve any claims relating to the EULA through final and binding arbitration, except to the extent you have in any manner violated or threatened to violate TRS intellectual property rights (for example, trademark, trade secret, copyright, or patent rights). Under such circumstances TRS may bring a lawsuit solely for injunctive relief to stop unauthorized use or abuse of the Service, or intellectual property infringement (for example, trademark, trade secret, copyright, or patent rights) without first engaging in arbitration or the informal dispute-resolution process described herein.\n\n8.2 What is Arbitration. Arbitration is more informal than a lawsuit in court and seeks to resolve disputes more quickly. Instead of a judge or a jury, the case will be decided by a neutral arbitrator who has the power to award the same damages and relief that a court can. If any provision of this arbitration agreement is found unenforceable, the unenforceable provision shall be severed, and the remaining arbitration terms shall be enforced.\n\n8.3 Arbitration Procedures. The Federal Arbitration Act governs the interpretation and enforcement of this dispute resolution provision. Arbitration shall be initiated through JAMS. Any dispute, controversy, or claim arising out of or relating to the EULA, except as otherwise provided herein, shall be referred to and finally determined by arbitration in accordance with the JAMS Streamlined Arbitration Rules and Procedures in front of one arbitrator. If there is a conflict between JAMS Rules and the rules set forth in the EULA, the rules set forth in the EULA will govern. The JAMS Rules and instructions for how to initiate an arbitration are available from JAMS at www.jamsadr.com or 1-800-352-5267. To initiate arbitration, you or TRS must do the following things:\n\n(1)  Write a demand for Arbitration. The demand must include a description of the claim and the amount of damages sought to be recovered. You can find a copy of a demand for arbitration at www.jamsadr.com.\n\n(2)  Send three copies of the demand for arbitration, plus the appropriate filing fee to your local JAMS office or to JAMS, 5 Park Plaza, Suite 400, Irvine, CA 92614.\n\n(3)  Send one copy of the demand for arbitration to the other party.\n\nPayment of all filing, administration and arbitrator fees will be governed by the JAMS Rules. If travelling to Orange County, California, is a burden, you may participate in the arbitration by phone or via document submission to the fullest extent allowable by the arbitrator. Each party will bear their own costs of arbitration unless the arbitrator directs that bearing such costs would be an undue burden and in that case, we will pay for your portion of the arbitration administrative costs (but not your attorneys fees). Arbitration under this agreement shall be held in the United States in Orange County, California under California law without regard to its conflict of laws provisions. The arbitration may award on an individual basis the same damages and relief as a court (including injunctive relief). Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction.\n\n8.4 Authority of Arbitrator. The arbitrator will decide the rights and liabilities, if any, of you and TRS, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim. The arbitrator shall have the authority to award monetary damages and to grant any non-monetary remedy or relief available to an individual under applicable law, the Arbitration Rules, and the EULA. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and TRS.\n\n8.5 Waiver of Class Actions. You waive any right to pursue an action on a class-wide basis against us and may only resolve disputes with us on an individual basis, and may not bring a claim against us as a plaintiff or a class member in a class, consolidated, or representative action. Class arbitrations, class actions, private attorney general actions, and consolidation with other arbitrations are not allowed.\n\n8.6 Waiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in court and are subject to very limited review by a court. In the event any litigation should arise between you and TRS in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND TRS WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge. YOU ACKNOWLEDGE THAT YOU HAVE BEEN ADVISED THAT YOU MAY CONSULT WITH AN ATTORNEY IN DECIDING TO ACCEPT THIS AGREEMENT TO ARBITRATE.\n\n8.7 Choice of Law/Forum Selection. In any circumstances where the Agreement to Arbitrate Disputes permits the parties to litigate in court, the EULA shall be governed by and construed in accordance with the laws of the State of California, excluding its conflict of law rules. You further expressly consent and agree to submit to the exclusive jurisdiction and venue of a court of competent jurisdiction located in Orange County, California.\n\n9. Waiver of Injunctive or other Equitable Relief.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, YOU AGREE THAT YOU WILL NOT BE PERMITTED TO OBTAIN AN INJUNCTION OR OTHER EQUITABLE RELIEF OF ANY KIND, SUCH AS ANY COURT OR OTHER ACTION THAT MAY INTERFERE WITH OR PREVENT THE DEVELOPMENT OR EXPLOITATION OF ANY WEBSITE, APPLICATION, CONTENT, SUBMISSIONS, PRODUCT, SERVICE, OR INTELLECTUAL PROPERTY OWNED, LICENSED, USED OR CONTROLLED BY TRS OR A LICENSOR OF TRS.\n\n10.General.\n\n10.1.No Partnership. You agree that no joint venture, partnership, employment, or agency relationship exists between you and TRS as a result of this EULA or your use of the Service.\n\n10.2.Assignment. TRS may assign this EULA, in whole or in part, to any person or entity at any time with or without your consent. You may not assign the EULA without TRS prior written consent, and any unauthorized assignment by you shall be null and void.\n\n10.3.Severability. If any part of this EULA is determined to be invalid or unenforceable, then that portion shall be severed, and the remainder of the EULA shall be given full force and effect.\n\n10.4.No Waiver. Our failure to enforce any provision of this EULA shall in no way be construed to be a present or future waiver of such provision, nor in any way affect the right of any party to enforce each and every such provision thereafter. The express waiver by us of any provision, condition or requirement of this EULA shall not constitute a waiver of any future obligation to comply with such provision, condition or requirement.\n\n10.5.Notices. All notices given by you or required under this EULA shall be in writing and addressed to: Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491 Lake Forest, CA 92630 ATTN: President.\n\n10.6. Email Communication. When you communicate with us electronically, you consent to receive communications from us electronically.\n\n10.7. Survival. The provisions of this EULA and any applicable Additional Terms, which by their nature should survive termination of your use of the Service, including sections on Service Use (except for the limited license), Submissions, Copyright Infringement, Third Party Services, Agreement to Arbitrate Disputes and Choice of Law, Disclaimer of Representations and Warranties, Limitations of Our Liability, Indemnification, Waiver of Injunctive or Other Equitable Relief, and General Provisions, will survive.\n\n10.8.Entire Agreement. This EULA, including the documents expressly incorporated by reference, constitutes the entire agreement between you and us with respect to the Service and supersedes all prior or contemporaneous communications, whether electronic, oral or written, between you and us with respect to the Service.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ AND UNDERSTAND THE FOREGOING TERMS OF USE AGREEMENT AND AGREE THAT MY USE OF THE APP IS AN ACKNOWLEDGMENT OF MY AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS TERMS OF USE AGREEMENT.\n\n\n\n\nEXHIBIT 1\nTHIRD PARTY COMPONENTS OF CONTENT\n\nUnreal Engine 4\n\nUnreal Engine Copyright 1998-2019, Epic Games, Inc. All rights reserved. Unreal is a trademark or registered trademark of Epic Games, Inc. in the United States of America and elsewhere.\n\nWwise\n\nPowered by Wwise  2006  2019 Audiokinetic Inc. All rights reserved.\n\nKhronos Group Inc.\n\nCopyright (c) 2007-2018 The Khronos Group Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and /or associated documentation files (the \"Materials \"), to deal in the Materials without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Materials, and to permit persons to whom the Materials are furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Materials.\n\nTHE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE MATERIALS OR THE USE OR OTHER DEALINGS IN THE MATERIALS.\n\nMesa3D\n\nCopyright (C) 1999-2007 Brian Paul  All Rights Reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS >OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nAndroid Open Source Project\n\nCopyright (C) 2008 The Android Open Source Project\n\nLicensed under the Apache License, Version 2.0\n\nZLib\n\nCopyright (C) 1995-2017 Jean-loup Gailly and Mark Adler\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nICU\n\nCopyright  1991-2019 Unicode, Inc. All rights reserved.\n\nDistributed under the Terms of Use in https://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Unicode data files and any associated documentation (the \"Data Files\") or Unicode software and any associated documentation (the \"Software\") to deal in the Data Files or Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, and/or sell copies of the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that either\n\n(a) this copyright and permission notice appear with all copies of the Data Files or Software, or\n\n(b) this copyright and permission notice appear in associated Documentation.\n\nFreetype\n\nThis software is based in part of the work of the FreeType Team: https://www.freetype.org/\n\nHarfBuzz\n\nCopyright  2010,2011,2012,2013,2014,2015,2016,2017,2018,2019 Google, Inc.\n\nCopyright  2019 Facebook, Inc.\n\nCopyright  2012 Mozilla Foundation\n\nCopyright  2011 Codethink Limited\n\nCopyright  2008,2010 Nokia Corporation and/or its subsidiary(-ies)\n\nCopyright  2009 Keith Stribley\n\nCopyright  2009 Martin Hosken and SIL International\n\nCopyright  2007 Chris Wilson\n\nCopyright  2006 Behdad Esfahbod\n\nCopyright  2005 David Turner\n\nCopyright  2004,2007,2008,2009,2010 Red Hat, Inc.\n\nCopyright  1998-2004 David Turner and Werner Lemberg\n\n\n\n\nFor full copyright notices consult the individual files in the package.\n\n\n\n\nPermission is hereby granted, without written agreement and without license or royalty fees, to use, copy, modify, and distribute this software and its documentation for any purpose, provided that the above copyright notice and the following two paragraphs appear in all copies of this software.\n\nIN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFTWARE PROVIDED HEREUNDER IS ON AN \"AS IS\" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.\n\nVorbis\n\nCopyright (c) 2002-2018 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nCopyright 2001-2011 Xiph.Org, Skype Limited, Octasic,\n\n          Jean-Marc Valin, Timothy B. Terriberry,\n\n          CSIRO, Gregory Maxwell, Mark Borgerding,\n\n          Erik de Castro Lopo\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nPNG Reference Library\n\n* Copyright (c) 1995-2019 The PNG Reference Library Authors.\n\n* Copyright (c) 2018-2019 Cosmin Truta.\n\n* Copyright (c) 2000-2002, 2004, 2006-2018 Glenn Randers-Pehrson.\n\n* Copyright (c) 1996-1997 Andreas Dilger.\n\n* Copyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.\n\nThe software is supplied \"as is\", without warranty of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose, title, and non-infringement. In no event shall the Copyright owners, or anyone distributing the software, be liable for any damages or other liability, whether in contract, tort or otherwise, arising from, out of, or in connection with the software, or the use or other dealings in the software, even if advised of the possibility of such damage.\n\nPermission is hereby granted to use, copy, modify, and distribute this software, or portions hereof, for any purpose, without fee, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated, but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This Copyright notice may not be removed or altered from any source or altered source distribution.\n\nCurl\n\nCopyright (c) 1996 - 2019, Daniel Stenberg, daniel@haxx.se, and many contributors, see the THANKS file.\n\nAll rights reserved.\n\nPermission to use, copy, modify, and distribute this software for any purpose with or without fee is hereby granted, provided that the above copyright notice and this permission notice appear in all copies.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Software without prior written authorization of the copyright holder.\n\nIntel(R) Metrics Discovery Application Programming Interface\n\nCopyright (c) 2019, Intel Corporation\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nOpenSSL\n\nCopyright (c) 1998-2019 The OpenSSL Project. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit. (http://www.openssl.org/)\"\n\n4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to endorse or promote products derived from this software without prior written permission. For written permission, please contact openssl-core@openssl.org.\n\n5. Products derived from this software may not be called \"OpenSSL\" nor may \"OpenSSL\" appear in their names without prior written permission of the OpenSSL Project.\n\n6. Redistributions of any form whatsoever must retain the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (http://www.openssl.org/)\"\n\nTHIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n====================================================================\n\nThis product includes cryptographic software written by Eric Young(eay@cryptsoft.com). This product includes software written by Tim Hudson (tjh@cryptsoft.com).\n\nSSLeay\n\nCopyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)\n\nAll rights reserved.\n\nThis package is an SSL implementation written by Eric Young (eay@cryptsoft.com).\n\nThe implementation was written so as to conform with Netscapes SSL.\n\nThis library is free for commercial and non-commercial use as long as the following conditions are aheared to. The following conditions apply to all code found in this distribution, be it the RC4, RSA, lhash, DES, etc., code; not just the SSL code. The SSL documentation included with this distribution is covered by the same copyright terms except that the holder is Tim Hudson (tjh@cryptsoft.com).\n\nCopyright remains Eric Young's, and as such any Copyright notices in the code are not to be removed.\n\nIf this package is used in a product, Eric Young should be given attribution as the author of the parts of the library used.\n\nThis can be in the form of a textual message at program startup or in documentation (online or textual) provided with the package.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgement:\n\n \"This product includes cryptographic software written By Eric Young (eay@cryptsoft.com)\"\n\n The word 'cryptographic' can be left out if the rouines from the library being used are not cryptographic related :-).\n\n4. If you include any Windows specific code (or a derivative thereof) form  the apps directory (application code) you must include an acknowledgement:\n\n \"This product includes software written by Tim Hudson (tjh@cryptsoft.com)\"\n\nTHIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nOpenSubdiv\n\nCopyright 2013 Pixar\n\nLicensed under the Apache License, Version 2.0 (the \"Apache License\") with the following modification; you may not use this file except in compliance with the Apache License and the following modification to it:\n\nSection 6. Trademarks. is deleted and replaced with:\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor and its affiliates, except as required to comply with Section 4(c) of the License and to reproduce the content of the NOTICE file.\n\nYou may obtain a copy of the Apache License at\n\n  http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software distributed under the Apache License with the above modification is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the Apache License for the specific language governing permissions and limitations under the Apache License.\n\nLibtiff\n\nCopyright (c) 1988-1997 Sam Leffler\n\nCopyright (c) 1991-1997 Silicon Graphics, Inc.\n\nPermission to use, copy, modify, distribute, and sell this software and its documentation for any purpose is hereby granted without fee, provided that (i) the above copyright notices and this permission notice appear in all copies of the software and related documentation, and (ii) the names of Sam Leffler and Silicon Graphics may not be used in any advertising or publicity relating to the software without the specific, prior written permission of Sam Leffler and Silicon Graphics.\n\nTHE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nOpenEXR\n\nCopyright (c) 2006-2019 OpenEXR a Series of LF Projects, LLC. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nAMD\n\nCopyright (c) 2016 Advanced Micro Devices, Inc. All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nVorbis Quality Improvements\n\naoTuV - Copyright (c) 2003-2008 Aoyumi\n\nlibvorbis - Copyright (c) 2002-2008 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLibwebsockets\n\nCopyright (C) 2010 - 2019 Andy Green <andy@warmcat.com>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nMikktspace\n\nCopyright (C) 2011 by Morten S. Mikkelsen\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nCopyright  2020 Turtle Rock Studios. All Rights Reserved. Privacy Policy | Terms of Use", "Space Required": "2.16 GB"}



["5 stars\n46%\n4 stars\n20%\n3 stars\n11%\n2 stars\n10%\n1 star\n14%", "j_aem_132 days ago\nEXTREME FEAR\n\nI'll say at the start that I LOVED the first game and used it as my try-this-it's-fun jumpscare inducer on the Go (RIP u brave lad). You'll see a lot of people ask for a port of that here, and I can understand why.\nThe main difference between fyf 1 and 2 is: this is a game. Fyf 1 was a really cool, non interactive proof of concept for VR horror that deserves its reputation. The fact that a lot of its content was free probably helps this. You basically watch a VR video experience there, leading it to (disappointingly) not shock people who were looking the wrong way.\nHere, you have more traditional game controls and much more interactivity. Scares are somewhat reactive to player behaviour and not \"canned\" (so what happens to one person who strides boldly through the world, looking at everything, will not occur to people who look the right way to fend off scares, or stare at the floor).\nBut it's maybe TOO good at what it does, to make it playable. Stuff whirls itself directly at your eyes from walls. This made me flinch so hard I nearly strained my neck. You constantly expect extreme jumps from everything - every room, heck even every kitchen applance for goodness sake. It's hard to give players a reason to continue when all that awaits is pure punishment. I'd much prefer a game that builds atmosphere up to scares, rather than lining them up.\nI thought I'd gotten over VR jumpscare games after my time with affected, but no. The comparison I'd draw, is between liking spicy food and ordering something to scratch that itch, only be be served a dish that tastes like Satan has done his business on your tongue.\nI seriously hope that sells it to some people!\nI have no idea how much content is in this but hate that I feel I must see it. As it stands, a 15 minute per episode play through would be fair to me...\n\nHelpful | 3", "ROTOMONKEEMay 29 at 5:18 PM\nMore, please!\n\nI agree with the other users... PLEASE get FYF #1 onto Quest! The first is the main reason I upgraded to a Quest in the first place. I love the new interactions of #2, but the passive immersion of the first is brilliant! Please consider our requests.\n\nHelpful | 158", "SORT_LIFE22 days ago\nPlease bring back the original\n\nThis one is ok, but Im on board with all those begging for the original to be available for the quest.\n\nHelpful | 15", "RockPaperGrenadeJul 27 at 7:05 PM\nPeople want the 1st Face Your Fears\n\nPeople want the 1st Face Your Fears.\nPlease bring the 1st Face Your Fears to Oculus Quest.\n\nHelpful | 24", "RoreoOreo10 days ago\nAwesome but\n\nI loved this game and it scared me to death. The only trying that would make this better is if the investigation part was longer and was scarier and if the shadows of the past part had more jump scares\n\nHelpful | 0", "fernando.vazquezjr2 days ago\nYou know what this is a good game!!!!!!!\n\nThe gameplay is good the story is good the graphics are good it's fun it's funny it has a couple of jump scares that are pretty good.. don't compare this game with the other game because part 1 was a different game completely different if you guys want to play part 1 go get yourself an Oculus go!!!!!!! Personally I prefer this one over the first one.. because after you did all the stores in the first Windows short stories it became boring.. at least this one has a storyline and you can walk around and you could do different things.. I enjoy this game and I highly recommend it.. it took me almost a year to buy this game because of all the bad reviews.. and this should have been one of the first games that I brought I was mistaken for completely following reviews.. this is a good game!!!!\n\nHelpful | 1", "Sydney_RobsterJul 26 at 9:40 PM\nIt's got it all\n\nGreat story, creepy atmosphere, jump scares, and puzzles. This game exceeded my expectations. I especially like the different ways you need to interact, like throwing cans at crawling things, picking up flaming torch and placing into correct spot, climbing outside of house.\n\nI also like how they've included a second bonus shorter story, reusing the environment, but changing it into an abandoned house.\n\nHelpful | 3", "BKG-KaijuJul 21 at 6:24 PM\nFace Your Fears\n\nI like it, but please please please bring back the first to the quest, me and my friends loved it!!!\n\nHelpful | 11", "TheGrantJul 23 at 8:26 PM\nNILBOG! NILBOG! NILLLBOGGG!!!!!!!!!!!\n\nThis was be goog game but the part for the weird hair lady be yelling at YAHBADEUCE \n\nHelpful | 6", "RAGEoEVILMay 13 at 12:16 PM\nWe need the first Face your fear videos!\n\nAlthough this is a great game, please add the videos from the first part, VR Gear is pretty much obsolete, those videos were some of the best scares and fears my family and friends had. You need to bring them all to the Quest and Rift asap! I will definitely 5  after.\n\nHelpful | 72", "QuestDog16May 30 at 10:55 AM\nGood but abit glitchy\n\nGood, though the graphics aren't that good, which is amplified by it being in VR, so you see all the details. This game should've been in a normal game, but then again it wouldn't be as well known if it was.\n\nAnother problem is that sometimes scripting errors happen, such as the dog spawning in the house when I started a new game.\n\nOver all, if you're looking for a decent scare and a decent story, check out the game.\n\nHelpful | 5", "ConnacemoxJul 22 at 3:18 AM\nAmazing, please make more.\n\nI love it, it is wonderful and really immersive.\nCannot get enough of these experiences.\nPLEASE, make more of it! That is my only \"complaint\" because it feels there is not enough.\n\nHelpful | 1", "Noersterud2 days ago\nFACE YOUR FEARS 1\n\nPlease give us FYF1 , it is the Best VR experience i have ever tried. Why cant we have it back??\n\nHelpful | 0", "Ursell64Jun 26 at 6:47 AM\nGood game but a few problems.\n\nI'm actually very upset, this game is so much fun and originallyI would give it a 5 star rating, however it doesn't save my game properly so whenever I load it back up im missing about an hours worth of progress, PLEASE fix this because I was really looking forward to finishing this and I was met with a huge disappointment.\n\nHelpful | 6", "Golden_MindMay 14 at 3:56 AM\nSpooky and Creepy\n\nThe Investigation was spooky, fun and extremely joyful to play although some puzzles/challenges took a while to work out. Dieing many, many times was humorous. The physical parts of the game were enjoyable and the feeling of a connection with certain characters made the game more satisfying. I would give this part of the game 5*\n\nShadows of the past with the creepy crawlies was a little less enjoyable as there were no characters to 'interact' with. I found it less enthralling and thought provoking. I would give it a 3* as I felt less connected to the game from an emotional point of view.\n\nI am happy to give it a 4 overall.\n\nHelpful | 6", "Say_WhutMay 20 at 3:20 PM\nMotion sickness can occur\n\nFun game but the motion as you move through the game across the property gets you dizzy in the \"Investigation\". The other adventure it was less motion sickness because you had the teleport option with the map.\n\nHelpful | 9", "OculusNathan2019Jun 10 at 8:34 AM\nGreat game but needs more\n\nThis game is great but it needs more. It feels too short and if the devs cant add on to this game give us the first game fyf #1\n\nHelpful | 7", "NeonSFMProduct10 days ago\nGood game\n\n10/10, would buy again. Expect for the Spiders\n\n\n\n\n\n\n\n\n\nI hate spiders.\n\nHelpful | 2", "Bird502Jul 23 at 8:17 PM\nYabaduece\n\nWhy did they have to do my boy John like that, if John survived it would be 5 stars I love John he's my favorite character in any media ever\n\nHelpful | 2", "AnamelJul 14 at 4:17 AM\nHgg\n\nGame\n\nHelpful | 3", "Sonnydayz703Jul 14 at 10:16 PM\nCreepy AF\n\nIm a big fan of horror games and this is by far one of the scariest games Ive ever played! The graphics are great the stories are great as well. If youre a fan of horror games like me give this game a shot! Much love and respect\n\nHelpful | 0", "Glow_ClapsJul 2 at 12:03 PM\nGreat game\n\nThis game was better then the first game me because you have to use your brain and so realistic so tinted I would walk forward in real life thinking it was real if you have a extra 20 bucks I would really recommend it first do both by yourself then have you friends do it. Also try doing the investigation first then shadows of the past because it is kinda has a story behind them. Shadows of the past 5/5 takes around 1 hour and 30 minutes to complete if you dont know anything. The investigation 5/5 takes about 1 hour to do not knowing anything truly would recommend!\n\nHelpful | 1", "gin2022May 31 at 4:38 PM\nFace your fear 1\n\nI liked the first one better it was much better this one. When are you going to make part one available to quest because I invested money in that one I bought this one and dont even play it because its not as good as part 1 The original was better stick to that\n\nHelpful | 17", "K3HydraJun 22 at 4:45 PM\nA great looking game\n\nProbably not worth the full $19.99 since it lacks content there are only two stories otherwise it looks good\n\nHelpful | 2", "G_NUTSApr 14 at 11:02 PM\nI almost had a heart attack!\n\nWow. I cant believe I did not buy this game at launch and I waited this long. I dont know what others are saying and giving bad reviews. This game is amazing. I havent played the first one so I cant compare. But this game scared the living ***t out of me. The graphics are also amazing. The sound is also amazing. Please wear earphones or headphones or a headset for this game. It will make a huge difference. Especially in scaring you with the jump scares. There are 2 campaigns or 2 chapters in the game. One set in the 80s and one in 2013. The story is good and it connects chapter 1 with chapter 2. Its like taking part and being In a horror movie. Its a horror game and campaign game with a story making you feel like you are in a horror movie. It literally made me feel like I was in a horror movie and taking part in it. Crazy! Its also a jump scare fest game.\n\nI dont know why people are saying this game is a puzzle game. The game has a few puzzles to solve but its not many. Maybe 2 or 3 for each chapter. Its just enough to make you feel like you are doing something. Other wise it would be a little boring. But to say its a puzzle game is not fair. Its not a room puzzle game like Red Matter. The 2 or 3 puzzles are just part of the campaign Aspect of the game. And they are not hard. You discover things in your investigation and find a few things that you use afterwards. Like for example you find a paper during the story mode and it has the combination of the safe. You use that code to open the safe. Its literally part of the story and is found as the game progresses. Its not like they are telling to go around and look for the code in order to open the safe. You just find the code during your campaign and you use it afterwards. Only 1 puzzle in the whole game is a thinking Puzzle. Its the mannequin puzzle. Literally only 1 in the entire game. This is a jump scare fest game. And only 2 puzzles involves you looking for something. But its literally right in front of your face. You are not looking for it like in a puzzle centric game. What I mean is that at a certain point you need to turn on the lights in the house but there is no power. You are told to get a fuse and insert it in the fuse box. But you dont spend half hour looking for it you just find it in plain sight as you are progressing in the campaign. This is a story based jump scare game that plays out like a campaign. It is the scariest game I have ever played. Its literally like you are taking part in a horror movie. Its like you are in a horror movie. Please try it. You will love it.\n\nI love the fact that both chapters are connected. And you will notice the connection of the chapter set in the 80s and the chapter set in 2014. I love that the surveillance Van that you start in the 80s chapter is in the 2013 chapter. I went and looked around. It was cool to see the van parked outside the house 30 years later and in a state of decay. You can still see the surveillance monitors inside if you look around. I would suggest you start by playing the 80s chapter and then go to the 2013.\n\nHelpful | 20", "RatbastrdJul 8 at 11:57 AM\nLove it\n\nGreat game! Took a few to become accustom to the layout, but once you do its good to go. Keep your back against a wall! Lol. Dont fight in the middle of a room!\n\nHelpful | 0", "ITSCAZMOFOAn hour ago\nBRING BACK THE ORIGINAL\n\nThis was just ok. The original face your fears was much better for the go. You actually faced your fears. Hopefully the developers listen to what a lot of people are saying and bring it back.\n\nHelpful | 22", "GeminiAssassinJul 19 at 11:37 AM\nIts fun and terrifying\n\nI am scarred of spiders\n\nHelpful | 2", "ChrisKycklingenJun 7 at 4:01 PM\nScared the hell out of me\n\nIf you're looking for a great story-driven horror game, this is defenitively up there amongst the greater ones on the Oculus Quest. It scared me genuinely a couple of times and I still wanted to proceed because the story really kept you in. It has a few simpler puzzles here and there and there's a lot of different types of scares so that everyone gets to face their fears.\nA must have title for those seeking for a thrill and more of a gameplay style experience.\n\nHelpful | 0", "Magic_GuruJun 5 at 9:39 PM\nAmazing game\n\nGreat game and really a step up from the first one. I like being able to interact with the games and this game did just that!\n\nCons: because there is a lot of moving around and changing directions so the game will cause nausea for sure. So if you are new to VR this isnt the game for you.\n\nHelpful | 1", "Dodooq8Jul 21 at 7:51 PM\nScary\n\nOmg today it scared the hell of me I quickly stopped the game! LOL\n\nHelpful | 1", "watermelonw.mJun 23 at 2:53 AM\nI love this game but\n\nI love it and I suggest it but its quite short and quite complicated and i agree its a good game and if u like scary games or horror then get it and oculus also release fyf 1\n\nHelpful | 1", "brofireninja336Jun 8 at 9:24 AM\nBad all around\n\nOriginally I didn't ever have a powerful enough PC to play a VR headset so then when I heard about the oculus go I was very excited to get my hands on VR so when I did my research on some games for it I found face your fears and was very excited to try it fast forward a couple weeks as I did more research and got ready to purchase it I found out about the oculus quest so decided to go for that instead so when I saw a face your fears for the quest I was very excited but when I got it the game wasn't the original so that was a little sad also the game itself relied on jump scares and for the investigation after a certain amount of playing it got dull and the jump scares didn't scare me my final issue with the game is when I got the game I had lots of hardware malfunctions everywhere on my quest but when I deleted it they just went away I wonder how\n\nHelpful | 0", "AxoidMay 3 at 1:08 AM\nAN AMAZING HORROR GAME.\n\nWow, the scares, the thrills, the suspense, the horror! Face Your Fears 2 is an Amazing VR Horror game. The spiders in 2013, was great! Really gave me and my family a big scare. The backstory is intriguing, really gets the player immersed. Constantly looking over your shoulder to see what is gonna get you. Didn't matter whether I was prepared or not the Jumpscares aren't easily predictable!\n\nAmazing game. Highly recommended!!!\n\nHelpful | 3", "ayalaisai13May 11 at 12:36 PM\nIt has a height problem\n\nIt was ok but when I was playing shadows of the past I was surviving the boathouse and I fell in the water in order to survive i had to use a chair\n\nHelpful | 2", "jecainFeb 11 at 6:26 PM\nGreat game\n\nThis game is a great and amazing puzzle game with suspense around every corner. It's wonderful as a horror game and scary because you never know what's going to happen while playing. Definitely worth it\n\nHelpful | 40", "MoontheAngelMar 26 at 2:27 PM\nGreat Experience\n\nThis is a great game! I played the older story mode first and I thought the WHOLE game wasnt that scary. Then I jumped into the 2013 story mode one and oh boy! That one made me scream at every jump scare. I dont know what changed between the two but I love it! I just wish there was more to play or maybe a free mode where its just unlimited gameplay because I feel like its over to soon! I do miss the first face your fears but this one is better in my opinion. (Unless you dont like climbing or interacting with things.) I enjoyed it a lot!\n\nHelpful | 7", "thiccieJun 9 at 2:06 PM\nThis game is really fun!\n\nThe only bad thing about it is the graphics... thats it!\n\nHelpful | 0", "Brennan999Jun 30 at 12:50 PM\nPretty Bad\n\nDon't get, save your money.\n\nHelpful | 5", "LosjuniorMar 18 at 11:39 PM\nGood but not good\n\nI like it but not to scary and it was kinda hard. That was the problem I got mad cause of all the death and I really didnt get scared but I still like it\n\nHelpful | 4", "KarmaxaJun 8 at 1:59 PM\nScary\n\nI almost wet myself its scary as hell lmao\n\nHelpful | 1", "Z3IR0May 14 at 6:11 PM\nFun\n\nI like the game only because i was able to watch my siblings scream and jump\n\nHelpful | 2", "JazzyVokezMar 23 at 3:23 PM\nOk\n\nI liked I did purchase this by accident and oculus wont let me get my money back but its ok\n\n\nHelpful | 9", "buzzin247Apr 20 at 1:26 PM\nGreat but\n\nTheres 2 stories the first story is boring the 2013 one is much better\n\nHelpful | 1", "jenpescoMay 12 at 10:16 AM\nSuper scary\n\nAnd amazing but sometimes super laggy tho\n\nHelpful | 1", "SenSSi_Dec 25 at 2:47 AM\nGood horror game \n\nI buyed this game now on sale, played about 1hr so far.\n\nOverall good gameplay, but that climbing sometimes glitching.\n\nGraphics not awesome, but not bad either.\n\nThis is horror game, where you solve some puzzles etc. so this is not sit and watch experience, and i dont know why people put those negatives for that..\n\nHelpful | 21", "dr_pureDec 30 at 9:05 PM\nThe worst game that I have ever bought\n\nLike I said I have bought oculus quest essentials pack and this came along with this ... Literally Hands down this is the worst game that I have even seen or played ... Only some jump scares no horror at all... best part is that developer abandoned this game after launch without any further updates nor any extra added content to the core game ... 2 star is just the saving grace that I'm giving to this game inspite of my wasted 20$ money on this game ... I can't refund this game alone as it came in the bundle\n\nHelpful | 167", "JosueVR89May 17 at 5:04 PM\nScary\n\nI love it\n\nHelpful | 1", "RRabbiMay 9 at 6:35 AM\nMakes me nautious.\n\nHad to stop playing after a few minutes...\n\nHelpful | 1", "HopSkip24Jan 14 at 4:53 PM\nFun\n\nIm enjoying this game and the story lines. Im older (45) so I get a little motion sick but once I got the settings dialed in for my liking it was no problem. Glad theyve put the thought in those motion settings!\n\nHelpful | 6", "DoctorCannablissMar 15 at 2:58 PM\nReally funny to watch other people play\n\nMy friend jumped so high trying to escape the grave and hit her hands in the ceiling \n\nHelpful | 4", "mattlisatz91Feb 22 at 5:58 PM\nScary fun short\n\nPretty good kinda short but has some good scares I'd say it's worth 20 , maybe 15 if you get q promo code\n\nHelpful | 2", "John9779Mar 1 at 11:57 AM\nBig fan\n\nGripping story and good jump scares 100% recommend\n\nHelpful | 2", "Defualtyboi6000Feb 12 at 11:55 AM\nNeeds more dlc\n\nI loved playing the game but after finishing it I wish there could be more content to play\n\nHelpful | 3", "Jackb36Jan 16 at 10:41 PM\nGreat Game\n\nFace your fears 2 was and is a great game with scary characters to horrifying jump scares and a even better storyline, but you know what better then 1 great storyline, 2 great storylines. Couldnt of asked for much more.\n\nThanks Jack\n\nHelpful | 10", "MicklePickle5Feb 5 at 8:43 AM\nBear with friends\n\nOne of the funniest games to watch your friends play. Recently every time me and my friends have hung out weve only played face your fears 2. I definitely recommend this game if your looking for a fun time with your friends\n\nHelpful | 4", "adamkanderson03Jan 26 at 12:07 AM\nAMAZING\n\nTotally worth the money I bought every single horror game for the quest and this tied with exorcist and Ive only done half so far and that half took me about 40 minutes so exited to see the other half of the game! Soo many jump scares that will get you into the game.\n\nHelpful | 4", "YEMENWARRIORDec 23 at 9:45 PM\nFace your fares\n\nPlease bring back the original face your fares. It was the only reason I upgraded my oculus. This new game requires you to move around and solve the mission. People are tired of that. We just want to sit and enjoy the game and experience like the original one had\n\nHelpful | 50", "AndrewRyanHAJJan 11 at 12:00 AM\nWhat is that?\n\nIf you come from the go and you expect it to be a better version of the first FYF - do not buy it. Is there any plan to bring the old FYF to the quest? It was so much better \n\nHelpful | 21", "HADESWRATHDec 26 at 12:05 PM\nScarey... good control...NEED RUN!!\n\nNeed run function. 3 hours and only slight nausea. Need to be able to interact with more stuff. I kept wanting to pick stuff up to protect myself with it..no go. Also, save options. I got to the house and put the fuse in and ended game. I hope I have a save point.\n\nHelpful | 2", "plagiarizeJan 3 at 10:05 PM\nSpooky, Buggy, still decent\n\nDespite running into a scripting bug where the fuse vanished and prevented me completing the game on the first play through, Face Your Fears 2 was a fun spooky time. It is somewhat milder than I was expecting for a VR horror game but I suppose that isn't a bad thing. If you find Dreadhalls or Exorcist too scary and want to try something else this might be for you.\n\nThe graphics are a little more cartoony than those games, and the environments arent nearly as interactive as those in the Exorcist but they are larger and well designed. I espescially like the main house with its diagonal central corridor and looping rooms.\n\nThe climbing was fun. The scary bits are quite good. I enjoy the different focusses found in the two different stories and how they inform each other.\n\nOver all a solid effort. I'd give it 3.5 stars if I could but I can't push it to 4 given the show stopping bug I ran into and the somewhat uneven texture work and lack of interactivity. I'll be open to see where things could go with a third game in this series. Turtle Rock have the talent to deliver something really special rather than something overall decent like this.\n\nHelpful | 3", "lookinforgamesDec 25 at 4:16 PM\nGreat idea but...\n\nNew quest user here, for some reason I got a bout of motion sickness playing this game. Scenery is beautiful and I'm looking to play more but concerned about the nausea which i haven't gotten playing any other games so far\n\nHelpful | 8", "tracilynn1313Mar 22 at 11:34 PM\nFyf2\n\nLove it. Just wish there was more hints.\n\nHelpful | 1", "1962jbFeb 9 at 6:18 AM\nCould not play it\n\nAlthough the visuals looked good I could not play this as I got nauseous and had to stop after 10 min\n\nHelpful | 5", "Marvelnat10nJan 11 at 10:28 PM\nVery good\n\nThe first part of it was meh and not that scary but when I got to part 2, the game lived up to its name cuz I am terrified of spiders\n\nHelpful | 2", "coleymoley67Feb 18 at 6:06 AM\nFive stars great game\n\nThere is so much you can do its fun scary and difficult the perfect mixture of a great game\n\nHelpful | 2", "TwistedcmJan 2 at 7:48 AM\nGreat but\n\nIt plays well and gives me and everyone that tries it a scare but some parts the graphics look really bad and other parts look good, I'd give it 5 stars if it looked nicer in those areas and also would really like the ability to open and grab majority of things in the world\n\nHelpful | 2", "rowee270Oct 30 at 11:17 AM\nDecent game but needs polish\n\nWhen i read reviews the complaints seem a little too hyperbolic. This is just like Face your Fears 1 with but extended scenes stitched together with puzzle solving to create a full story. The scenarios are creative, however the storyline and writing is average, even for this genre. Once finished you can play the specific scenes like FYF1. Some of the creatures from FYF1 return too!\n\nI'm only about 3/4 through the first story but enjoying it for what it is. My issue is that the game is rather linear so the dangers and jump scares get old when you know what's coming. Some randomness could really help keep the tension high like Dreadhalls.\n\nThe graphics can be a little basic or unpolished/glitchy at times, killing some immersion. Graphically it's no Red Matter or even some of the later FYF1 DLC. Trying to explore outside is limited and your object interactions are also restricted. I thought it was a bug when it wouldn't allow me to explore a dug out grave until the story was waiting for me to move on, so it could put me in there!\n\nOverall it's a good effort, but some polish and further development could have made this a lot better!\n\nHelpful | 14", "X-YEETKID-XFeb 17 at 7:16 AM\nGood fame\n\nI literally pissed my pants it scared me so bad I love the game,it was the scariest game I have ever played .\n\nHelpful | 1", "shmacky1Jan 24 at 2:26 AM\nAmazing!\n\nMust have! Feels real, the room scale best feature. Little glitchy at times.\n\nHelpful | 1", "Shadow_GoddessJun 3 at 3:34 PM\nDizzy\n\nThis game made me feel really dizzy when and I used both modes. The problem is when I move forward or back. I really wanted to keep playing it but I couldnt it was really dizzy.\n\nHelpful | 7", "AidenaiterVRMay 22 at 1:00 PM\nLove love love this game\n\nBefore I start, I just wan to to say no joke this is my favorite game on my quest(and I have a lot). I have always been a fan of horror but hate how over the top everyone tries to make it. Most developers think that just because its scary makes it a good game but that is false. This game is legitimately fun. I got super creeped out but not enough to make me take off the headset. The art style works really well on the quest and on horror games in general. The mechanics are super fun and I loved the story.\n\nThe entire experience was amazing and loved showing it to friends and family. The only thing that I wasnt satisfied with was the amount of content. I beat the game rather quickly and felt like there could have been more added story. So some dlc adding more doors would be very appreciated. Also the boss fight mechanics and the whole old school door wasnt all that great. The other door was just amazing. It would be really cool to see more doors with their each individual story. That would be truly amazing. In the end I just want to say thank you to the developers and I hope you keep making amazing content.\n\nHelpful | 3", "DizzanDec 30 at 5:58 PM\nEh\n\nThis was one of the best games on the Oculus Go. They totally abandoned why it was so great.\n\nDont get me wrong, its got some scares but its nothing compared to the scary simplicity of the part 1.\n\nMake part three like 1. But better please.\n\nHelpful | 3", "E1973kiaFeb 26 at 2:25 PM\nFace your fears 2\n\nGreat game great puzzles solving game , \n\nHelpful | 1", "ANGERSNIPERNov 3 at 11:00 AM\nOK so far but....\n\nIt's been OK so far, bit creepy, maybe a touch cartoony though.\nThe most annoying thing however is the blue stand marker at your feet, always there, never able to centre on it and it's a big distraction when trying to immerse yourself in the creepy house. Even when climbing, you look down to see how high you are and there it is, right below you floating. How annoying.\n\nHelpful | 4", "den.harrisJan 4 at 10:57 PM\nDisappointed\n\nI thought it was like the first one but it's not. Very disappointed. No action really. More puzzle like game. GRAPHICS ARE GOOD.\n\nHelpful | 7", "Arch281Feb 8 at 3:37 AM\nFavourite game on the quest!\n\nI really hop they come out with face your fears 3 because I love this one. More quest games should be like this!\n\nHelpful | 1", "JerachiDec 17 at 3:09 PM\n\nIt scared me a good few times but I didnt like walking in circles for 10 minutes to find where to gk\n\nHelpful | 3", "TrojanAxJul 23 at 9:12 PM\nBiggest quest regret. Still want FyF\n\nThis for sure is my biggest purchase regret for quest, and I have very few of them. Positioning was weird, hitting right spot something wonky, you'd fall to death when you feel you were fine. A few parts were nice, but overall really lacking.\nI bought everything for FyF 1 on Gear and still it isn't in Quest !!! Super disappointed to not have that \n\nHelpful | 1", "sondiegirlDec 6 at 9:08 PM\nFace your fear 2\n\nI like the original best because it's not a game. I'm not a gamer if so I guess I would prefer the new but I just like to put on head set and watch\n\nHelpful | 3", "kohle.cogdill.1May 17 at 11:12 PM\nAwesome game\n\nI have had this game for only a few days now and it's really fun, it has a ton of jump scares.\n\nHelpful | 0", "Studly_McSexfireApr 13 at 7:27 AM\nAwesome game but locomotion too sharp\n\nI just played this game for the first time in a while and realized the reason everyone is getting sick playing it is because the locomotion is way to sharp and jerky. If it would be made smoother playing would be much more pleasant. Its a shame cause it really is an awesome game.\n\nHelpful | 7", "Charlez199Dec 29 at 5:30 PM\nVery big disappointment.\n\nThe game is boring. Nothing scary. There's a few good ideas, but not well developed. Worse, you die without knowing why and restart over and over again without having a clue why. Totally unacceptable. The quality control of Oculus store really made a mistake here. My worst Oculus purchase so far.\n\nHelpful | 5", "octoplyNov 24 at 10:59 AM\nScary game and then story game.\n\nPersonally I love scary games even if I can't handle them, so I had mixed opinions on buying this game. But after buying it and playing through it it was incredible. I played the \"investigation\" chapter first and thought that it was kinda lacking in the scary department which was what I bought the game for, so it left me disappointed. Then I played the second chaptdr and my god I had to take breaks because I was too scared to go into the house. I love that the story connects betseen the 2 chapters. Since I played the second door first I followed the story's timeline and It was all the more scary.\n\nSo the first chapter was truly terrifying while the second chapter was more of a story based chapter. Allthough I think it's pretty cool I bought the game expecting more of the first door and less of the second door, thats why I rate this game a 4 out of 5.\n\nHelpful | 3", "roydaboy4002Dec 27 at 9:30 AM\nEhh\n\nIts scary dont get me wrong, but I cant even play the whole game because I get so dizzy from the motion. I dont get motion sick so for that to happen is pretty frustrating. If there is something to help with that please let me know because I want to play the whole game.\n\nHelpful | 3", "NoobiusMaximiusJan 3 at 10:12 AM\nmotion sickness and not very good\n\nI think Id like it better if it didnt give me motion sickness, its fun until a couple minutes of moving around in game and I get really sick. This has happened in other games so its not just the game but all in all its pretty fun minus the sickness.\nFinally got to finish the game and I would not recommend it to anyone. Parts were you have to climb or hold gutters feel glitchy, screen goes black sometime and will fall to your death even when you dont let buttons go... at no point was this game scary.. buy something with better reviews, wish Id have looked more at reviews before the buy\n\nHelpful | 4", "Slingjet84Dec 15 at 5:19 AM\nTerrifying!\n\nThis game is perfect for those who like puzzles and horror. with lots of grabbing (like doors and items like the lamp, climbing is really realistic) it really immerses you. A few times I found myself closing my eyes and trying to open doors so I dont have a BIG accident in my pants.\n\nThough, I did have one issue. (Spoiler coming)\nOn the part where your being chased by the dog and all the other creatures. I had to open a door to get to the docks where the speedboat is and escape. but when I opened the door to the stairs that led to the docks it just left me in pitch black.\nI didnt know what to do so I quit and watched the end on my phone by a playthrougher. Overall realistic and terrifying.\n\nDefinitely recommend \n\nHelpful | 2", "AlBoogie3Nov 18 at 1:10 PM\n\nThe very first time I was really scared by a VR game. I just recently bought my Quest (11/16) and I can truly say this is the best game Ive played thus far, with that being said. I didnt get too far because I was truly scared out of my mind, but the graphics and the interaction is on point. Shout out to the developers who put this together!!!\n\nHelpful | 0", "GODHEDDec 1 at 1:33 AM\nToo little, not scary\n\nAll the experiences are really short and lack the scare factor from the previous game. In this one the devs relied too much on jump scares while the first one was more creepy throughout. In the first game there was no movement aspect which in my opinion made it more scary since you can't just back away instead you had to face it as the title suggests. All in all this game just doesn't have enough content and is not scary. I'm sorry to the devs but this game is a complete do over\n\nHelpful | 14", "KySaFlNov 21 at 4:16 AM\n\nI got this game after seeing the plane crash scenes on YouTube. I didnt realize it was a different one and totally different experience. I play this, but never finish. Not because it is scary, but because its alot of wandering around aimlessly looking for bits and pieces to a puzzle in the dark. I wish they would expand this with different types of scary stories. These two dont do much for me.\n\nHelpful | 6", "papabear_the_oldOct 25 at 12:47 AM\nSigh.\n\nKinda let down by this. I ADORED the format of FYF 1 and made this my very first purchase on the Quest. And I gotta say, I don't really understand why the change. The \"sit/stand and let it happen to you\" format of the original was fun, terrifying and exhilarating all at the same time. It paid homage to many horror classics of my era and it was truly refreshing. This...just sorta feels like a mediocre Resident Evil clone. Rather disappointed. \n\nHelpful | 15", "bnielsonJan 5 at 12:20 PM\nVR Haunted House\n\nExcellent Quest Horror experience akin to experiencing a Haunted house. Or just pick a single scary experience if you don't want the story or want to show off to friends quickly.\n\nHelpful | 1", "awesomegamer21Jan 26 at 12:21 PM\nLove it\n\nFace your fears 2 is the best game in my library definitely get it\n\nHelpful | 1", "GrimmcragDec 20 at 12:16 PM\nBroken\n\nGame can't be finished because of a game breaking bug which has caused the vital fuse to disappear. Tried to play the final \"scare\" sequence at least and ANOTHER bug prevents me from pulling a vital switch so I can't even do that. Utterly disappointed. One or two good scares but the true horror is that the game breaking bugs didn't show up until I had played for more than 2 hours and could no longer request a refund.\n\nHelpful | 2", "PATZMNMar 23 at 10:38 AM\nWhy dose everyone give this game hate?\n\nThis game is amazing and the graphics are honestly some of the best on quest. I played and finished the game in about 2 to 3 hours. But the reaction that you get from your friends are priceless! WARNING: This game is very scary and full of breathtaking jump scares!\n\nHelpful | 0", "giulytheboyNov 7 at 1:25 AM\nSimply great!\n\nThis was Just what I was looking for from an horror game. Creepy atmosphere, tense situations, great jump scares, and a good story to guide you through all of that. My only complaint is directed to some \"action\" moments in the game, like the \"boss fight\" in the poltergeist story. I always hated too much action and boss fights even in games like Resident Evil or Silent Hill. It breaks all the tension and atmosphere for me, and the game quickly becomes from anxious and scary, to tedious and repetitive. That thing chasing you inside the house. THAT is what I want!\n\nHelpful | 0", "gabbykittenOct 21 at 5:53 PM\nFace your fears !! The original\n\nAlthough I enjoy this game I keep searching the internet to see if you are ever going to listen to the masses and bring the original FYF that I played and loved on the go to the quest ?\n\nHelpful | 8", "MereHydra0Nov 20 at 9:03 PM\nGreat game with great story\n\nIve been looking for a horror VR game on the quest and Ive always been wanting to get it but find myself buying other games instead. I bought this game a few days ago and have been loving it. Characters are great, story is great, and Im not known to easily scare but I still found myself jumping a few times. Amazing experience and am hoping for another\n\nHelpful | 1", "Carmel_CrappleDec 12 at 7:25 AM\nBOOOOO!\n\nWaste of money if you are a fan of the original. This is a less than mediocre puzzle game.\n\nHelpful | 5", "sandradee123Jan 13 at 11:09 AM\nFace your fears 2\n\nVery dissapionted with this so called game not a single bit scary at all\n\nHelpful | 1", "eric.welwood.7Nov 10 at 10:58 PM\nBetter than the first\n\nI don't know why there are reviews about how this sequel is an actual interactive game rather than an idle experience. They even added the idle experience mode in response. The graphics are not great but as a quest developer I'm fully aware of the limitations and am actually somewhat impressed. The story and voice acting is good and the scares are fun. Also technically it has 2 stories but they take place in the same location. At first I was disappointed but the environment sharing was done well and it does actually introduce new content.\n\nHelpful | 4", "TURBOSRTDec 29 at 3:28 PM\nWeak\n\nI'm not facing my fears. I'm exploring some environment. Not impressed. Jump scares aren't exciting like the first one. Definately a let down. And the \"scares\" aren't even really scary. I liked the first face your fears concept. Fear of heights...spiders...snakes...ECT. Wish they would port the first version to the Quest and develop the 1st as what it was, facing people's fears, and make the second one the adventure/exploring game.\n\nHelpful | 5", "TimPopeDec 14 at 12:20 AM\nThis Game Blows\n\nWhy change what was so good? Now this is a dime a dozen joke of a game. Had I been able, I would've given it a negative 5 star rating. I requested a refund after less than an hour of shi*ty play.\n\nHelpful | 1", "CalebcornNov 8 at 11:13 PM\nAmazing Scarefest!\n\nI just recently bought a headset and this is one of the first games I bought, I didnt expect the immersive frightening experience that was thrown at me. I hesitated because of the bad reviews but they were misleading once I fired it up, I have always yearned for a horror game that could actually scare someone playing and this is definitely the fix!! Every friend that tries it I have them skip to the spider chapter for some good laughs watching them scream and jump ! I look forward to the developers next game\n\nHelpful | 2", "TrustedWalk2231Mar 13 at 10:00 AM\nIt is scary but it's awesome\n\nThis is way better then the first game the reason why I like this better because it has story mode it is more of a challenge and it is about solving puzzles you should get this game\n\nHelpful | 0", "Volsfan10Jan 4 at 2:04 PM\nSpooky\n\nIt is terrifying and fun\n\nHelpful | 1", "Pieman476Oct 8 at 3:13 AM\nPretty good\n\nIm not in it for the story and if your new to VR than this is not for you, if you get Motion sick than this is not for you , its a good game if your just playing for the scares but the storys pretty bad and hard to follow (Probably because I didnt play the first one)\n\nHelpful | 1", "exjraordinaryOct 20 at 4:04 PM\ngreat original great sequel\n\nI would just say I loved the original and I love this sequel. But I think I would love DLC styled like the original game small intimate environments. that way you can satisfy the old and new fans of this franchise. Also please bring The Well and Face your your Fears 1 onto the oculus quest store. Amazing games and The Well 2 would be an amazing game such an under rated under appreciated gem.\n\nHelpful | 2", "djoz123Oct 22 at 5:36 PM\nThis is fantastic! ESPECIALLY for a noob\n\nI already know that the internet is filled to the brim with sad people that will always find the negative in everything, which you will see in a lot of the reviews; but for a newcomer to VR, this is a ton of fun! Very immersive, great visuals, and the best jump scares! Even when you're expecting it you still jump! If you can only find the bad in this experience, just kill yourself already. And it's only $20 freaking dollars!! That's two Burger King combo meals! I know all you negative fatties out there stuck in your gaming chair ordering multiple Door Dash orders while complaining about 'story lines' and 'not enough game time' can do that math!!! Get this game reader of this.... You'll get your money's worth for sure!\n\nHelpful | 10", "DBoivinOct 13 at 10:54 AM\nNo fear\n\nThis was not like I expected. FYF on the Go was great and fun. This one gives you puzzles and motion sickness. I was loking for something to share with others like the Go had. Not a puzzle game, but fear experience.\n\nHelpful | 7", "Caterpillar123Nov 8 at 11:05 PM\nI s**t my pants\n\nIt was such scary but fun game theres two little stories and they each last for about an hour The whole time through I was scared out of my goddamn mind I had my hands up to my face and it was the scariest thing Ive ever played I would thousand percent get it if youre into the horror stuff\n\nHelpful | 0", "gommonNov 11 at 9:52 AM\nGreat Horror game\n\nA great horror game, some good scares and replay value. Graphics are good. Price is reasonable.\n\nHelpful | 0", "SantirhetoastNov 11 at 7:24 AM\nGood\n\nThe game it self is good. The only problem is that you get motion sickness. The story is nice.\n\nHelpful | 0", "pannese1Oct 27 at 9:53 AM\nFace your fears two\n\nLove this app, For those that have face your fears one, understand this app is more interactive. If you dont like figuring out puzzles, you may find it less entertaining.That being said, its still five stars in my book. Great to have at a Halloween party! Love these guys for creating it, thanks, looking forward to face your fears three.\n\nHelpful | 1", "rigger.ramoneOct 16 at 10:11 AM\nSkyscraper\n\nI bought this for the experiences and not to have to do tasks. Please put fyf 1 on quest so i can have all my doors back i bought with samsung gear. I loved the experiences without the game play\n\nHelpful | 7", "SpaghettiBoyDec 22 at 8:57 PM\nTooo scary\n\nIt is a fun game\n\nHelpful | 0", "BluecoSilverscalesOct 14 at 5:48 AM\nJump-Scare Galore!\n\nI loved the first FYF and although a lot of people reviewing this prefer the original but I appreciate how they took it in a whole new direction. I lost count on how many times this game s**t me up straight from the intro all the way to the end. I loved the Resident Evil like vibe, encounters were creepy and the climbing sections were really intense. It's quite short but has plenty of ways to scare you enough that you don't wanna rush the game. Explore the house.. you'll find some creepy stuff that you won't experience just running through it. I liked how there was two parts which makes the game around 4 hours for me but it depends how you play. I really\nIiked how the story went down on the second part, I just found that way more intresting as you get to learn what happened in the house and everyone involved. I liked the puzzles to as they were long and actually gave more story, I like optional stuff like that. I really hope you guys make another horror game because you did really well on this and I can see you coming up with something amazing. Enjoyed the experience, wished there was more! Definitly pick up this game if you're in for a scare, love solving puzzles and getting into a creepy story!\n\nHelpful | 4", "Rhys748Nov 11 at 10:58 AM\nOk...\n\nI didn't like it, I bought it to get scared but it wasn't scary. It's not a bad game over all but it's not that scary.\n\nHelpful | 0", "SicxJuggaloNov 15 at 6:25 PM\nWow This is A real game..\n\nExpecting this to be like the one on the Go.. This is Real game full motion climbing jump scares.. it's all here this is a must buy for any horror fan..\n\nHelpful | 0", "Dittoman17Dec 4 at 1:31 PM\nPerfection\n\nReally amazing story mode and walking sim\n\nHelpful | 1", "ChlasmaSep 30, 2019 at 6:20 AM\nAmazing!!!\n\nAbsolutely love that game, unbeliveable how much value for 19.90.\nVery good graphics, superb climbing parts and a good lenght makes this to a well executed exclusive.\n\nAbsolutely cant understand the bad ratings, maybe the only problem is the title which makes many people belive it is just an experience as the first was. Have to admid that the bad ratings made me to hesitate do buy it in the beginning........\n\nVisuals 8\nGameplay 9\nImmersion 8\nLenght 8\nSound 10\n\nOverall 8.5\n\nIf you are a LITTLE bit of a gamer, just go for it!! Its a gift that should get as much support as possible and you won't regred it except you are expecting \"only look around\" experiences like the first one was.\nThanks a lot turtle rock and please don't loose your faith in creating most awesome VR GAMES!!!\n(love JOTG too btw)\n\nCheers\n\nHelpful | 2", "ShawnSkaySep 27, 2019 at 3:11 PM\nScary experience\n\nI can't climb to the roof at final stage, I've tried hundred times, hundred ways and everytime I fall even when I'm holding with both hands. It drives me crazy.\n\nEdit: ok, I've found the way :) but it isn't so intuitive.\n\nHelpful | 1", "EdmCaperNov 7 at 9:54 AM\nLoved it!\n\nAbout 3 hours worth of story mode and great for showing to friends and family . I finished the game and would definitely buy a part 3 if one came out . Very spooky\n\nHelpful | 0", "redalert33Oct 18 at 7:50 AM\nCreepiest game on Quest!\n\nHands down the creepiest game on quest. I've played all the games in the \"horror\" genre currently available (Oct 2019) and this is the only one that truly creeped me out. It felt a little bit like playing some of the original Resident Evil games back in the day, where I was scared to turn the corner or walk down into the basement. If you like scary stuff, check this out!\n\nHelpful | 1", "Machina4KSep 1, 2019 at 5:54 AM\nBring the original FYF1 to the quest!!!\n\nI played the original on Go on a friends party and love it! So, after purchasing the Quest I proceeded to find it and only discovered the second one available. I purchased it, played it and.... boy oh boy, what a deception :( The original was fun and quick to play with friends and first time VR players... I thought this will be the same but with more horror experiences, but no... just another puzzle walking simulator. I do not know why they change something so good and fresh for something so generic and boring. Please bring the original one to Quest!!!! And if there is a third one, please go back to the original formula and forget this second one under the carpet. This was heart breaking.\n\nHelpful | 12", "savageboerboel12Oct 29 at 7:59 PM\nPeople come on\n\nJust because your prone to motion sickness doesnt make a game a bad game. If you see a comment giving a thumbs Down because of motion sickness than ignore it please.\n\nHelpful | 1", "Flitch_1989Nov 3 at 1:22 PM\nFab game for party's\n\nA fun game with some genuine scares, had everyone laughing that was watching the victims that played. Hope there is a 3rd edition.\n\nHelpful | 0", "Sebulan2049Oct 9 at 1:06 PM\nScary\n\nSince I haven't had the heart to play it much since I first bought it, I must say this was indeed scary. I feel this game did it's job and definitely made me scream. Would reccomend if you're looking for a good quick scare, especially with friends.\n\nHelpful | 0", "DeoFalconSep 24, 2019 at 2:49 PM\nAmazing!!!\n\nSuper fan of the original Face Your Fears, was always my go to for friends and family that never tried VR. I absolutely love the direction you went with the Quest utilizing the controllers, it is amazing and I'm super stoked to see more content from yous! Hopefully yous add the original FYF to the quest!\n\nHelpful | 2", "thedeancorpAug 5, 2019 at 12:51 AM\nFun but I like the GO version best\n\nFirst off, yes this is great and Im sure this actually took more work to make than the original. However, this is difficult to play for first time VR players. I prefer the original game on the GO because it was a great time watching first time users get scared. New older players have a hard time navigating. I would love it if you brought the original version to the quest. Would pay for it again. If I had just bought this game not having prior experience with the franchise I probably wouldnt have been disappointed because it really is great, just unfortunately too much of a departure from the original hence didnt hit expectations.\n\nHelpful | 20", "KarlDrinkwaterAug 20, 2019 at 12:27 PM\nEnjoyment, but with frustrations\n\nWhen I first started it I was quite pleased by the chance to explore a creepy house. That works quite well. The textures are often rough, but exploration was fun. It did begin to outstay its welcome though. Unfortunately the scares are either jump scares, or very cliched, and as a result it is rarely actually scary. The biggest issue for me was bugs. In some scenes if my head tilted or I leaned forward or back a bit, the whole screen went black until I put my head in whatever position the game accepted. It happened most in the 2013 scenario. And that totally bugged out at the end. I escaped from the house with the key to the boat, but although I could hear the water, the screen was black apart from one second as I left the menu. So I had to keep going into the menu, leaving it, then trying to judge where I was and move a bit closer to the boathouse door. I eventually quit and reloaded, and it was less flaky (still went black sometimes), but when I got into the boat and got the boat key out there was no way to start the engine. I spent about 5 minutes then gave up - I suspect something hadn't triggered properly, so I didn't see the ending.\n\nOverall, I don't think this worked. The frustrations and cliches took away enjoyment. Face Your Fears 1 was a pair of effective and different experiences. Maybe this would have been better as those two, plus another 10-20 different short experiences. The house didn't live up to the first promise (much of it is not interactive). It feels like a slight mis-step. So, it will work for some, and I'd have thought my review would be 3-4 stars, but the bugs that killed any remaining enjoyment at the end knocked it down to 2.5 stars for me. I praise the effort and intention, but less so the execution.\n\nHelpful | 8", "Jza16Aug 23, 2019 at 8:57 AM\nNo where near as good as the original\n\nI see what they were trying to do here but it just didn't work well. The voice acting is EXTREMELY cheesy and pulls you right out of the experience. The scares are predictable and very short. The boss levels are learn as you go so I died 5-10 times just to figure out the pattern and had to repeat which took away the \"fear\" factor of the whole game. I highly recommend the original Face Your Fears but this one is just not good.\n\nHelpful | 18", "ddport2Oct 20 at 4:36 PM\nVery Immersive\n\nFun to show people VR especially around halloween season. The ability to jump rigjt in to certain experiences is great for a party or group.\n\nHelpful | 1", "caj001Sep 9, 2019 at 9:18 AM\nFace Your Motion Sickness\n\nI enjoyed the original FYF. But the motion sickness in this one makes it truly unplayable. I tried to different options for locomotion and no matter what, a few minutes in and Im ready to puke. Perhaps adding different locomotion styles, similar to Red Matter might improve the experience. Better experience, higher ratings, more sales. Think about it.\n\nHelpful | 10", "JakeBeck056Oct 1 at 6:52 PM\nThis game is action packed\n\nIf you wanted a sit around good scare experience then dontget this game. This game you go through the callenges of the player investigating a haunted house. This is the best game on the oculus quest ever!\n\nHelpful | 3", "1-VRSep 16, 2019 at 6:30 AM\n\nLike a haunted-house house experience except if you span in circles a bunch before going in. Yes i tried both movement methods. No it did not help. This is literally the first time i have experienced motion sickness, ever. Is this what my friends feel like when they get car sick? Good god, how do they live. If nothing else this game gave me nausea, and empathy for those who experience it more often.\n\nHelpful | 3", "ChitownkayaJul 29, 2019 at 4:33 PM\nFace your Fears 1 over this\n\nThis shouldnt be called Face your fears 2. It has nothing to do with the original game. This is something else. The original game was perfect for friends and family as you sat there and the experience came to you. Will Face your Fears 1 be available for Quest? I would pay for that game all day.\n\nHelpful | 16", "toddkane68Nov 9 at 6:41 PM\nIf only\n\nJust not fun!\n\nHelpful | 2", "philiprvkAug 26, 2019 at 10:19 PM\nGreat but short\n\nI really enjoyed my time with face your fears 2, and I think its 100% a step up from the original, however without more content it feels like a wasted buy. Im sure with some extra dlc, it will be one of the best horror experiences on the quest.\n\nHelpful | 2", "rocknrolzMay 22, 2019 at 10:02 AM\nExceptional... Stunning... Immersive!\n\nSo far I am just floored by this game. Face your Fears was my favorite app on the Gear VR, and now this was my first purchase on the Oculus Quest. I am impressed with the direction the studio has headed with this. This turned out to be even better than I had hoped for. I really feel like I am there, interacting and solving. Just fantastic. Looking forward to more content like this soon from Turtle Rock!\n\nHelpful | 146\nDeveloper ResponseMay 22, 2019 at 3:42 PM\n\nThis means so much to us. Thank you!", "JRAOULOct 15 at 3:56 PM\nGreat game\n\nI love it super fun and scary\n\nHelpful | 0", "ray.bradshaw1Aug 26, 2019 at 2:30 AM\n\nThis got mixed reviews but it's the first game I paid for on the quest because face your fears on the go so good. NOT played long but so far very good, lot different from other face your fears but very good so far, climbing a bit hit and miss and you do get killed a lot so have to keep repeating moves till you get it right.Played a bit longer now love it\n\nHelpful | 1", "booty302Aug 11, 2019 at 10:14 PM\nGives headache\n\nplayed for 10 mins amd gave me bad headache and giddy after that. i want to love this game but i try and try playing only like 10 mins i stop. i can't take it. make me sick. regret buying this. if can get a refund would be great.\n\nHelpful | 4", "rabb24666Jun 20, 2019 at 6:20 AM\nNot sure I like it\n\nLoved face your fears on oculus go.However, not too keen on the new concept.\n\nI found myself walking around wishing it would hurry up and end, Its similar to resident Evil VR game on psvr.\n\nThis is the first game on the Quest I've looked into getting a refund BUT decided to wait for new content.\n\nUPDATE:- I went back to this game, changed the settings so I didnt get motion sickness and to be honest started to like it, actually really like it. Looking forward to new parts coming out now.\nIchanged this to 4 stars now !!\n\nHelpful | 13", "NVRflameMay 20, 2019 at 11:04 PM\nGutted\n\nWow this game is nothing like the original. Its more a walk around and find clues game now. If u like this type of game and arent prone to motion sickness then I guess its ok to try. It made me really dizzy and if anything thought the graphics on their original game on the oculus Go was actually way better than on this new version.\n\nIm really disappointed as a big reason I even purchased a Quest was for this game. I thought it would be the same thing but better. Sadly it isnt :(\n\nThe big question is why would these guys of changed a formula that just clearly worked so well?\n\nHelpful | 306\nDeveloper ResponseJun 3, 2019 at 4:12 PM\n\nHi NVRflame, So sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable! Also- We have good news for you! FYF 2 is working on a patch that will introduce a new \"quickplay\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out!", "RamboTeddySep 15, 2019 at 12:44 PM\nMakes me sick\n\nThis game makes me sick\n\nHelpful | 4", "iamdrewanthonyJul 25, 2019 at 12:24 PM\nNot the experience I expected...\n\nMy friend has the Rift S and has the first FYF and as I played it I thought, mann this game is pretty awesome.\n\nI went home purchased FYF2 on my Quest and boyyy the disappointment. This game is wayyy too immersive than what it needs to be. I think my expectation was to do as little as possible yet experience the fear or scare-tactic this game is promising.\n\nNope.\n\nThis game you sort of going through an immersive maze or obstacles. There were points in the game I got dizzy. For me, when I play the Quest, I don't want to feel dizzy and sometimes developers forget that when they're reaching a little too much when it comes to being immersed in the game play, it takes away from the experience of what the game is supposed to deliver.\n\nHelpful | 9", "Beachjim48Jun 18, 2019 at 3:33 PM\nGood\n\nI have updated and changed my review. This is not a walk in the park game. A veteran since the phone devices, go, and at first had to stop due to nausea. It passed. The challenge is difficult and sorta wish it wasn't so and more of a walk through interactive haunted house instead. I did enjoy most of the experience with some I could have done without. I just finished the first 80s story and now on the second. And that climbing is insane lol I hate it and love it at the same time. Still would like to see y'all do something with less thinking and more of a walk through scare fest of some kind. Sometimes you don't want to think and just have fun. Especially after a long day working. Just saying.\n\nHelpful | 4\nDeveloper ResponseJun 18, 2019 at 12:17 PM\n\nSo sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable! Run towards the bookcase!", "PrettyPoisonFeb 8 at 9:15 AM\nNot Like the Original\n\nWHAT HAPPENED TO MY ORIGINAL FYF THAT I PAID FOR??? ITS GONE!!\n\n\nI only purchased this because I thought it would be like the original that I love. It isnt. Waste of my $\n\nHelpful | 10", "JinxxSpeaksAug 11, 2019 at 8:24 AM\nCan't progress\n\nThis game has done nothing but piss me off. Half of the time I can't pick up certain items that I need to progress in the game so I end up stuck and can't continue leaving the game unplayable at this point. What a waste of money!\n\nHelpful | 8", "CampFilmsMay 26, 2019 at 5:28 AM\nVR Horror at its Best!\n\nThe guys and gals at Turtle Rock Studios know how to make amazing VR horror experiences! I was a big fan of The original Face Your Fears on the Oculus Go, and this new version basically takes what was great about the original experience, and turns it into an actual game.\n\nDuring Face Your Fears 2, you actually explore the same house in two different time periods (which is a cool touch.) some of the situations were so terrifying, I had to take the headset off, build up some nerve, and come back to try again later. I love how you can explore the game spaces now, interact with objects, read lore, and solve puzzles.\n\nThe only things holding this title back from me giving it 5 stars is that the graphics could be just a tad better (I am aware of the hardware restrictions) and I would also like to be able to interact with even more things in the environment.\n\nI dont understand the complaints that some others have had about this being turned into an actual game and it not being a passive experience like the original Game on the Go. Why wouldnt the developers want to take advantage of the new hardware, and make their game bigger and better? I bought the Quest for Rift-like 6dof experiences, and this game delivers!\n\nOverall, this is a must-have Quest title for fans of the horror genre! Dont miss it!\n\nHelpful | 18\nDeveloper ResponseMay 29, 2019 at 3:06 PM\n\nThank you very much for the well thought out feedback. Appreciate you!", "skm2Aug 26, 2019 at 10:34 PM\nUnplayable\n\nMakes you sick after a couple of minutes regardless of the mode used. Only game I played on Quest with that effect. Bring us face your fears 1 pls !\n\nHelpful | 7", "darwins.lastJul 21, 2019 at 10:06 AM\nGood Mystery Game\n\nTurtle Rock Studios is very talented and this is a good experience. I liked the prior format better, but this is good too... just different. Good graphics.\n\nHelpful | 2", "itsjusttoomasJun 21, 2019 at 1:41 PM\nOkay so Im a whimp\n\nI love playing horror games, the first real one me playing being Resident Evil 7 I loved it. After my first playthrough I played a bit of it in virtual reality before having to return it to GameFly sadly. But experiencing horror in vr really got me excited when I found out about this game I bought it my second day with my quest. I am too scared to play for long periods of time I constantly work up the courage to play then exit 5-10 minutes later. Thats how you know its a good horror game (in my opinion). The only reason Im giving 4/5 stars is because after trying both movement modes I would still feel a little nauseous. Overall this game is definitely worth a go. I do plan to beat it start to finish but maybe just not now.\n\nHelpful | 3", "tveithMay 24, 2019 at 6:16 AM\nMeh\n\nThis game really didn't thrill me. Personally, I enjoyed the format of the first game better, with mini experiences. I asked the developers if they planned to port the original to the Quest and they said no. They are missing out on a great opportunity because the original is well loved and people would pay for it. Overall disappointed.\n\nHelpful | 27\nDeveloper ResponseJun 3, 2019 at 4:11 PM\n\nAppreciate your feedback. We have good news for you! FYF 2 is working on a patch that will introduce a new \"quick play\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "gemini1976Jul 12 at 2:02 PM\nCould of been better\n\nI have several quest vr games and this is the only one that causes motion sickness. Also even though the gaphics arent terrible they are the least polished of all the games i have\nThe gameplay so far seems like just finding items to get to next area with limited jump scared in between.update after playing this for awhile it got better and i finished the 80s scenerio. After playing second newer house it seems to be better than the first.\n\nHelpful | 2", "CyberGlyph33Jun 5, 2019 at 1:30 PM\nFun game, but...\n\nI just dont understand why the devs wont port over FYF 1. It was well made, the Quest is my first self-owned VR system, and I would LOVE to put my family and Friends into the FYF 1 situations. I understand they have quick play mode for FYF2 now, and I will check that out, but why not give us #1? Its amazing! Seriously, whats the reason?\n\nHelpful | 17", "GoldenWarrior43Jul 16, 2019 at 11:14 AM\nNot worth\n\nI absolutely loved FYF1 on the Oculus Go. This experience is entirely different, it puts you in control. It is entirely different in a bad way, the first game forced you to sit and let the environment scare you in different ways, getting worse as you go. If you like typical walk around around horror games, then this one is an okay one. The movement in the game isnt that bad but could be improved(both methods). All in all I would say this game is a bust.\n\nHelpful | 5", "Mockslayer254Sep 13, 2019 at 12:40 PM\nI loved it I was really scared lol\n\nFun\n\nHelpful | 1", "terminator798Aug 25, 2019 at 10:08 AM\nStraight trash\n\nThis is not scary whatsoever. The graphics are bad, the gameplay is boring, and everyone who plays will get sick. Please dont buy.\n\nHelpful | 5", "Jayix_92May 24, 2019 at 6:13 PM\nAbsolutely Amazing\n\nProbably one of the best VR titles out right now on the Quest.\n\nI only wish there was more, like if there was two more doors with a separate story all together or something like that.\n\nBut either way, Beautiful graphics, good story, great gameplay mechanics.\n\nDefinitely more immersive than the original and worth every cent.\n\nHelpful | 12\nDeveloper ResponseMay 31, 2019 at 4:05 PM\n\nThank you so much for the feedback!", "MikkoISMay 21, 2019 at 6:24 AM\nBest horror quest yet\n\nThe game is everything I expected. Bigger, better and scarier than the first one. This is a real game now. Not just a collection of horror experiences like the first game. It's different but also so much better.\n\nHelpful | 35\nDeveloper ResponseMay 22, 2019 at 3:41 PM\n\nThank you so much MikkolS! So glad you enjoyed it.", "JioxxJun 28, 2019 at 7:35 PM\nExcellent Horror Adventure\n\nIf you get this expecting a collection of passive mini scares like the original Face Your Fears, you may be disappointed.\n\nThis is a horror adventure game more like Resident Evil 7 or Paranormal Activity. Horror Adventures are one of my favorite genres on PSVR, so I had a lot of fun with Face Your Fears 2.\n\nSince Quest can't render environments as realistic as PSVR I wasn't quite as scared in FYF2, but there were plenty of moments when I was seriously creeped out.\n\nQuest's roomscale tracking really lets you get immersed in the game. There's lots to do with the controllers, including climbing. This is the most physical horror game I've played so far.\n\nThe tracking can get confused occasionally, but overall the experience is pretty smooth.\n\nThe game is divided into two timelines which is an interesting twist.\n\nI highly recommend this for any horror fan, and I really hope the developers have a Face Your Fears 3 in the works.\n\nHelpful | 7", "bmkippJun 3, 2019 at 5:41 PM\nAwesome and terrifying\n\nThis is a great experience that scared me nearly to death. The complaints about the new format are silly. This is a huge improvement over the original as it's way more interactive. My only complaint is the walk mechanics are a little hard on the stomach even as a seasoned vr user. The story is immersive and the fear is real. If you're a fan of horror this one is great!!\n\nHelpful | 6\nDeveloper ResponseJun 6, 2019 at 5:01 PM\n\nThanks so much for the feedback. Did you try out both movement modes?", "PyroRuptAug 21, 2019 at 4:19 PM\nIts good\n\nIts actually scary I thought it was going to be ok but they really nailed the sounds\n\nHelpful | 1", "RonzarelliJul 16, 2019 at 6:56 AM\nDizzy, not at all like part 1\n\nI was super excited that part 2 was going to be as cool, if not better than part 1. I was wrong, the first one is a lot better. It's a nice idea but I got dizzy and motion stick with both control methods, I had to take off the headset and lay down trying not to throw up. I much prefer the video clips method where you pick different rooms like in the first game. I uninstalled it hoping future updates make it better. Please bring Face your Fears 1 to the quest, I'd buy it right away.\n\nHelpful | 6", "paulmwagnerMay 23, 2019 at 5:07 PM\nBecause you can doesn't mean you should.\n\nWhat made the original so compelling was that it was an experience. This is not. Some 20 minutes into what is now just another game, I was so nauseous that I had to quit. I can only hope they'll port FyF 1 to Quest. Part of the joy of that version was watching others experience it. This is a massive disappointment.\n\nHelpful | 31\nDeveloper ResponseJun 3, 2019 at 4:11 PM\n\nSo sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable? Also- We have good news for you! FYF 2 is working on a patch that will introduce a new \"quickplay\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "ParadiseDecayMay 23, 2019 at 1:02 PM\n1st Impressions Video with Commentary!\n\nhttps://www.youtube.com/watch?v=Mv9qUjCDxjw (Please Note: Links might not work from Oculus store so please search YouTube for 'Paradise Decay VR Face Your Fears 2 Quest)\n\nMy Quick Thoughts:\nThis game has jump scares around every corner and I had goosebumps quite a few times during my initial playthrough. I like how Turtle Rock put a twist to a lot of the standard horror tropes.\nSome people might not like the concept of wandering through a story, myself I was a big fan of the Oculus GO version of face Your Fears and I would love to see an enhanced version of the GO version on Quest and Rift.\nIf you like games like RE7 then you'll get a similar vibe here.\n\nHelpful | 12", "billym91Jul 1, 2019 at 5:37 PM\nWow, wow, wow\n\nPlayed this tonight for the first time and I couldn't get through it! The tension is too much! One part literally had me trying the remove the headset as fast as I possibly could! Can't wait to play more. The VR in this game is amazing. I really love that it has a story narrative also. The sounds, the tension and the actual scares are killer! Play if you dare! This is going to have to be something I plah during the day from now on!\n\nHelpful | 3", "DrTabooSunJun 12, 2019 at 2:26 PM\nFYF1 fans hate this\n\nFace Your Fears 1 had a fantastic formula going for it. Sit down or stand up and enjoy the ride. Part of the fun was almost being helpless to the experience and fighting back the prairie dog coming out from the behind. FYF2 tried to get too clever with its story mode and I lament to say the result was disastrous. I really wanted to love this game. I really did. It just falls very flat this way.\n\nI had all 60 people at my local board and video game meet up play the original and the day I announced I had gotten my quest, I received more than one email about how excited everyone was to try part 2. After trying it though the disappointment was palpable. \"When I stood on a ledge like I was going to fall was awesome, but this game had boring and predictable jump scares that ruined any mood that had been established\" said the game night leader. I had others use more vulgar language. Unfortunately, the game was an unexpected departure from an idea and formula that worked.\n\nGive us instead a compilation of scary real world or fantastical scenarios. Give us the airplane scene that we didn't get on the rift from the telephone based VR systems. Give us maybe an african safari gone wrong or maybe some kind of slasher movie experience... heck throw in a choose your own adventure style response system that could change the outcome, but keep it short, sweet and to the point like the original everyone raved about. I would buy that in a heartbeat.\n\nHelpful | 18\nDeveloper ResponseJun 12, 2019 at 2:40 PM\n\nHi DrTabooSun, Sorry to hear that FYF2 wasnt what you were expecting. If you want FYF1 styled experiences to quickly show your friends and family some scares, try accessing the quickplay events on the right hand side of the main menu. Story mode will also still be accessible through the main menu if you want to give it another shot.", "CavarasMay 24, 2019 at 5:52 PM\nWheres The Go version\n\nHi Im happy you tried some new stuff but would be nice to have access to the Go Version on both Rift and Quest. Next time please just make more of the others the questing is fun and all but the old style was great to. Would hate to lose that style moving forward.\n\nHelpful | 9\nDeveloper ResponseJun 3, 2019 at 4:10 PM\n\nAppreciate your feedback. We have good news for you! FYF 2 is working on a patch that will introduce a new \"quick play\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "Aj9330Jun 5, 2019 at 1:00 PM\nNow I need a fresh pair of underwear !!!\n\nOk so at first this game was a little to get used to but I stuck with it and was rewarded for it. What a terrifying experience!!! I did get a little motion sickness the first time I tried it (I had a few beers the first time so that might have been my bad)but quickly got over it and enjoyed pooping my pants for the 1 1/2 hours it took me to complete the door on the left. Great job devs knocked it out of the park for me!! Thank you. Hope more content is coming soon.\n\nHelpful | 4\nDeveloper ResponseJun 6, 2019 at 5:00 PM\n\nCouldn't ask for a better review! If you play with the settings a bit there are two different movement modes, \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable!", "m.cody.simsJun 1, 2019 at 4:56 PM\nA well executed jump scare\n\nFace Your Fears on the Oculus Go was my all time favorite VR game. It was the perfect blend of visuals, mood, and phobias that could scare just about anyone. I appreciate what Turtle Rock was trying to do with this game, and in a way they nailed it. The graphics are great, and there are a ton of jump scares. However I miss the variety and the different types of experiences from the first game. It feels like it is missing its soul, for example something for people scared of heights, or planes, and has been replaced by a well executed jump scare from a blockbuster scary movie. I still recommend it for potential buyers, but just know it isn't like the first game at all.\n\nHelpful | 10\nDeveloper ResponseJun 3, 2019 at 4:09 PM\n\nAppreciate your feedback. We have good news for you! FYF 2 is working on a patch that will introduce a new \"quickplay\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "vickyvaleJul 23, 2019 at 8:42 PM\nCustomer Query - no response...\n\nUPDATE: The developers emailed me asking me to send them an email; however that's not necessary as I'm not having a technical issue, and I'd just be repeating exactly what I've already said in this review. The purpose of this review is to provide customer feedback/suggestion - outlined below, and is regarding all the climbing that is required ie Widow Walk, and being kicked out of the game and having to start all over again from the start. After a few attempts, we lost interest having to repeat all that climbing, which gets quite tedious. Are you able to either include an option where you don't die, or, if you do, you don't have to start all over again from the beginning? Or just remove at least half of the climbing. Would be great to be able to play these games without being kicked out. Also when showing friends and family, it gets frustrating for them if they're just getting into it, and they get kicked out and have to repeat. Hope the developers take this on board.\n\nHelpful | 4\nDeveloper ResponseJul 23, 2019 at 2:15 PM\n\nApologies, where did you email? We didn't see it! Please contact us at community@turtlerockstudios.com", "krisvdvijverJun 20, 2019 at 2:56 AM\nEntertaining!\n\nIts more a spooky adventure than pure horror. Lots of fun, a few original ideas I havent seen in other VR horror games. A jump scare here and there, atmospheric, nice graphics, I certainly recommend this.\n\nHelpful | 1", "ToguyJul 5, 2019 at 1:27 PM\nDon't Buy\n\nThe morons who made this game made some of the controller actions unnecessarily painful. I love horror related stuff but this game made me just... I can't even... Don't buy. It is safe to say everybody was disgusted by this game. Give us Fear 1 for free for everyone that purchased Fear 2 or else forgot about us giving this developer a second chance\n\nHelpful | 8", "PrimeTQuest4Jun 26, 2019 at 4:06 PM\nSuper scary and clear\n\nThis game is fun and scary. I love watching other people do it especially. The only reason I give it one star is because the controls are weird. Everything else thumbs up\n\nHelpful | 1", "FunkyfraggleAug 1, 2019 at 2:40 PM\nAwesome\n\nI've played some great survival.horrors but nothing beats immersing yourself In the house, sweat inducing stuff in story mode, love this game\n\nHelpful | 0\nDeveloper ResponseAug 2, 2019 at 6:07 PM\n\nSo glad you enjoyed it!", "Aro3891Jun 18, 2019 at 1:22 AM\nBest horror game i played in my life\n\nI am huge fan of Horror movies and horror games, games like resident evil etc...this game is sooo fantastic, cant describe in words how great job Turtle rock studios made in this game, this is a classical horror game. Those who like Resident evil will definitely like this game.\n\nYear 2013 is muuuuuch more scarier than year 2013 part.\n\nHelpful | 7", "Ace_RiazMay 27, 2019 at 3:35 PM\nI was terrified\n\nI found this game to be excellent and I've never been so scared in my life. If you play it properly like you are really in that situation and don't rush it then you are in for the experience of a lifetime. Congratulations to the Devs!\n\nHelpful | 8\nDeveloper ResponseMay 31, 2019 at 3:58 PM\n\nSo glad you had fun!", "wintereagleJun 13, 2019 at 2:35 PM\nGreat Great game\n\nThis is a great scary/horror game. With jump scares and finding clues also puzzles which really fills the Emerson of feeling under pressure in some of the situations throughout the game. I myself enjoy scary VR games even though they scare the heck outta me and this is definitely one of them.\n\nHelpful | 2", "OuijaboredMay 27, 2019 at 9:31 PM\nA Pre-Halloween Treat\n\nAs an avid horror genre fan, Im really quite impressed by how this game puts you in the middle of your own paranormal investigation in and around a haunted house, and in VR!! Amazing work devs!! I cant wait for another sequel! Please add a teleport option for those prone to VR motion sickness.\n\nHelpful | 4\nDeveloper ResponseMay 31, 2019 at 3:58 PM\n\nThanks for the feedback! There are two different movement modes, \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable!", "JTubbrittMay 25, 2019 at 9:56 AM\nPainfully Disappointed\n\nWhy would you even call this Face Your Fears 2? It's nothing even remotely like the original concept that was so successful. Cant believe I'm saying this but I found it boring and annoying. Hate to leave a negative review but I really found this to be awful.\n\nHelpful | 10\nDeveloper ResponseJun 3, 2019 at 4:10 PM\n\nHi there. So sorry you had a bad experience. We hear you and have good news for you! FYF 2 is working on a patch that will introduce a new \"quick play\" mode. You will skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "NightMonk3yJul 6, 2019 at 1:01 PM\nFantastic\n\nReally frightening horror vr game, a must try for new quest users. I hope another is in the works but hopefully they will add proper weapons.\n\nHelpful | 2", "VRvinbeanselJun 1, 2019 at 3:48 AM\nHopefully patched\n\nI'm quite enyoying the game but I am noticing quite a few areas that the frame rate drops especially outside the house or towards the shed made worse if you are turning while looking in a different direction. With the quests lower refresh rate of 72hz this really spoils any immersion for me.\nMaybe I'm asking too much but I feel all quest titles have to be locked at 72hz otherwise the refresh rate simply isn't good enough. Also the graphics are pretty poor in a lot of areas but I suppose I have to accept that with the limitations but still feel quest can perform better in this area too\n\nHelpful | 2", "criticalDJun 2, 2019 at 2:07 AM\n\nOne of the main reasons if not the main reason for me getting an Oculus quest was to try face your fears. I had originally played this on the gear VR at a friend's house. I really enjoyed what the original Game had to offer I really hope this will come as a free DLC\n\nHelpful | 6\nDeveloper ResponseJun 3, 2019 at 4:08 PM\n\nAppreciate your feedback. We have good news for you! FYF 2 is working on a patch that will introduce a new \"quickplay\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "DreamerOMay 22, 2019 at 7:30 PM\nFantastic Immersive Horror!\n\nFace your Fears for the Oculus was one of the best in its class, and was a series of experiences. FYF2 trumps it with its interactive gameplay and storytelling\n\nThis is a great game to showcase to others\n\nHelpful | 8\nDeveloper ResponseMay 23, 2019 at 11:26 AM\n\nThank you so much for your review! We're so glad you enjoyed it.", "NotoriousMsJul 7, 2019 at 3:49 PM\nMotion sickness bad\n\nI wish I had listened to the first review! Straight motion sickness...is there anyway I can get a refund. Cant enjoy it at all. Graphics are cool but cant play long enough without getting sick. Sorry.\n\nHelpful | 5\nDeveloper ResponseJul 8, 2019 at 4:13 PM\n\nSo sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable!", "gem2113Jun 2, 2019 at 2:45 AM\nConfused\n\nSo far Im enjoying the storyline and Ive nearly peed myself a few times. Im not sure if there are a few bugs though, or maybe Im playing it wrong. When I look down sometimes to pick up an object, my whole screen goes black and I can still hear the game but I cant see it. Also, at one point I just fell right though the floor while I was climbing down something and had to quit the game because I couldnt get out. The movement is very difficult to get used to...Im going to try to play it again and see if I have any luck because the actual game is great and its terrifying to play, Im screaming at things that dont normally scare me!!! If I could figure out why it makes my headset glitch so much, Id really love it.\n\nEdit: the headset tends to go black mostly in the cave at the beginning of the 2013 experience. Its mostly when I look down but its happened all through the game when I look at an area thats not accessible, I think Im too close to the edge. Ive played the game a bit more since the first review and Ive not experienced the falling through he floor thing again so thats good. I just jumped down the hole instead of climbing. I tried to play the game in the sitting mode so I didnt get dizzy when I played but the height doesnt change even when you press reset height so you cant grab anything on the floor as youre too low down and you feel like youre flying when you move. I am really enjoying this storyline though and Im going to keep going back until I get it right and finish it!!! So the bugs arent a major issue but would be nice if they were fixed.\n\nHelpful | 1\nDeveloper ResponseJun 3, 2019 at 4:07 PM\n\nHello, so sorry you're experiencing this- How often does this happen and does anything seems to trigger it in particular?", "Chris_StaceyMay 26, 2019 at 7:36 AM\nScary fun!\n\nLove horror movies so had to try this one. Jumped out of my skin a few times but really got into the story. Just finished The Investigation - lots of fun and some pretty challenging puzzles to solve. Looking forward to the second half of the game and can't wait to scare my friends with this one!\n\nNote: Had FyF on the GearVR (which was excellent) but this is so much more. It's story-driven but in the same \"spirit\". If you're a horror fan you WILL love it!\n\nHelpful | 8\nDeveloper ResponseMay 31, 2019 at 4:00 PM\n\nAppreciate all the support!", "R-e-i-z-oMay 31, 2019 at 10:32 AM\nTemper expectations\n\nI picked up this game on launch, having seen some footage of the original i thought it would be a good game to throw friends and family straight into, get some laughs and scares. Unfortunately this fell quite wide of that mark, its not something I would through newbies to VR into at all.\n\nThe game features full locomotion and no option for teleporting, I am fine playing locomotion games but this game in particular even made me queasy.\n\nOpening and navigating through doors is particular glitchy and I found myself constantly wrestling with the locomotion and trying to open and walk through a door (of which there are many).\n\nThere are not a lot of real world items to interact with, but there is always the belief that something is interact able, so your always trying to grab something there cant be grabbed.\n\nThese points combined throws you out of immersion.\n\nWhat i would love to see from the devs is a genuine face your fears game that is a handful of different , easy to play, short experiences that are designed to scare the player, but something that can be played by someone with no experience.\n\nHelpful | 8\nDeveloper ResponseJun 3, 2019 at 4:09 PM\n\nHi there! Thank you very much for the feedback. We are actually working on a patch as we speak to allow quick play for instant access to scary experiences. As for the motion sickness have you tried both movement modes? \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable.", "Blink18StuMay 24, 2019 at 10:19 AM\nHorror, jump scares and fun!\n\nI have played a lot of horror games on the PSVR and this has made me jump and shout out loud more times than the others combined. Brilliant level design, scares and in my opinion worth the price tag.\n\nHelpful | 5\nDeveloper ResponseMay 31, 2019 at 4:07 PM\n\nSo cool to hear this. Thank you so much for your review!", "toobee123May 27, 2019 at 12:04 PM\nNot like the original one\n\nWalking in vr via joystick makes me sick. i cant play that. part 1 was awesome because there were no bad walking mechanic. i see that the devs tried to make an even better game than the original one but they should not have go for a walking game. the fun part about this game is showing it to frieds/family but without vr experience, its almost unplayable without someone permanentely giving instructions on the controls. at least you could have built one version without walking. would be much better\n\nHelpful | 11\nDeveloper ResponseJun 3, 2019 at 4:09 PM\n\nThanks for the feedback! There are two different movement modes, \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable! Also we are working on a patch that will introduce a new mode where you can get directly into the scary experiences without story mode.", "brentblansettJun 27, 2019 at 9:29 PM\nNot Good\n\nThis game made me really sick playing it. I dont get motion sick at all but this game makes me stop playing after 5-10 minutes. I dont know if its the controls, the way it makes you spin, what... but its bad! Bring back the original.\n\nHelpful | 4\nDeveloper ResponseJun 28, 2019 at 12:37 PM\n\nSo sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable", "jedimario2May 23, 2019 at 11:08 AM\nNot fun\n\nNot as fun or scary as the original, I want to return this title but am not sure how to do this on the quest.\n\nHelpful | 14\nDeveloper ResponseJun 3, 2019 at 4:11 PM\n\nAppreciate your feedback. If you miss the format from the original Face Your Fears we have good news for you! FYF 2 is working on a patch that will introduce a new \"quick play\" mode. You can skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "wasp26jimJun 4, 2019 at 5:30 AM\nNeeds more\n\nI was introduced to VR on a Oculus go playing the original version of this game which is why I bought a quest and this game as well. Disappointed with the selection of experiences Available. Would like to see quick scary experiences to demo others to VR.\n\nHelpful | 7\nDeveloper ResponseJun 6, 2019 at 5:01 PM\n\nHi there. We hear ya! We recently updated the game so you can now jump right into the quick scary experiences.", "Petro9986May 25, 2019 at 12:53 PM\nPlease port part 1\n\nI really hoped for something like face your fears 1...this is not it, really disapointed. It does not seem like a bad horror game per se, just dont expext it to be like part 1.\n\nHelpful | 12\nDeveloper ResponseJun 3, 2019 at 4:10 PM\n\nWe have good news for you! FYF 2 is working on a patch that will introduce a new \"quick play\" mode. You will skip the story bits and go straight into the scary experiences. Hope you come back and check it out.", "CaptainMilkJul 16 at 2:32 PM\nA flawed masterpiece\n\nGreat atmosphere, great graphics, ease of access, and just fun, the only issue is the bugs that occur every once in a while\n\nHelpful | 0", "TwinTurbo74Jun 6, 2019 at 5:09 PM\nI love it!\n\nScared the crap out of me....very well done. Will download any future episodes for sure!\n\nHelpful | 3", "RuomraMay 30, 2019 at 12:43 AM\n\nFantastic experience. Like starring in your very own horror movie. Incredibly immersive reaching forward to open doors and peeking around corners. Great fun. Highly recommended.\n\nHelpful | 2\nDeveloper ResponseMay 31, 2019 at 3:58 PM\n\nThank you so much! Super glad you enjoyed it.", "Tank2003Jun 1, 2019 at 9:40 PM\nHave the Devs even played this game?\n\nWow buggy! Doors are very difficult to open, you can't interact with anything minus like a couple objects. Trying to climb? Standing or sitting it's almost impossible. Star wars was 10 bucks and I would have paid double this game is 20 and not worth 5 in it's current state.\n\nHelpful | 1\nDeveloper ResponseJun 3, 2019 at 6:05 PM\n\nHi- have you tried to reset your height? This could be causing the interaction issues.", "IeatwaspeggsMay 24, 2019 at 5:03 AM\nUugghh\n\nI have had my fair share of VR experience and do not get motion sickness easily. but this game made me throw up just 5 minutes of playing it. Its been gutted from the original version and the price is ridiculous.\n\nHelpful | 8\nDeveloper ResponseJun 3, 2019 at 4:11 PM\n\nSo sorry you experienced this! Did you try both movement modes? We have \"Head Directed\" and \"Hand Directed,\" which can have a big impact on comfort for some. Perhaps you'll find using a different movement mode more comfortable?", "DeltaFlightMay 25, 2019 at 7:07 AM\n\nThis is quite scary, I've literally jumped and screamed a few times. Good immersion, decent graphics, like the controls.\n\nHelpful | 2\nDeveloper ResponseMay 31, 2019 at 4:05 PM\n\nThank you kindly!", "Quest787May 27, 2019 at 5:52 AM\nResident Evil type adventure\n\nHad a fantastic time exploring these Resi like environments. Proper game and story. Looks great and plays great with effective jump scares.\n\nHelpful | 4\nDeveloper ResponseMay 31, 2019 at 3:59 PM\n\nAwesome to hear this. Thank you for your review.", "NiuQJun 9, 2019 at 12:53 AM\nSuper scary\n\nReally scary easy to find your way around I would highly recommend\n\nHelpful | 3", "SchultzeeJun 9, 2019 at 6:34 AM\n\nSays wont install until my headset is connected when it is connected\n\nHelpful | 2\nDeveloper ResponseJun 12, 2019 at 2:17 PM\n\nHi there! There was a Quest download issue that impacted some users over the weekend. Please try completely turning the device off and powering it on while the device is plugged into the charger that came with the device to initiate a software update. Here are the instructions from the Oculus forums  http://bit.ly/2IIOXrA If you are still experiencing this issue, please contact Oculus Support here  https://ocul.us/2MHBkxV Hope this helped!", "AcesgoneMay 25, 2019 at 5:01 PM\nTrying to actually play . HELP\n\nFor some reason the game continues to show the three white circles as its loading and it never gets me to the actual game to play! Help\n\nHelpful | 4\nDeveloper ResponseJun 3, 2019 at 4:10 PM\n\nSorry this is happening to you- have you talked to support yet? If not can you try to uninstall and then re-install?", "GrZontanMay 24, 2019 at 2:52 PM\nIt doesnt load\n\nI dont know who to communicate and what to do the game doesnt load stay in black screen\n\nHelpful | 2\nDeveloper ResponseJun 3, 2019 at 4:11 PM\n\nPlease contact support and let us know if it starts working for you. https://support.oculus.com/885981024820727/"]