{"App Title": "Fail Factory!", "App description": "Immerse yourself in a whimsical robot factory while climbing your way up the corporate ladder from lowly intern to esteemed star employee. In a wacky spectacle of increasing chaos, strive to keep up with the escalating comedy of errors as you operate various assembly lines in a myriad of mini-games. Entrenched in a physics-based, no consequences playground, experience three main types of mini-game stations, all with the goal to help the factory build robots on a massive scale. \n \nWorking in assembly stations, sorting stations and quality assurance protocol (QAP), where youll control unfathomably large robots, youll hone your skills in a factory that feels reactive and alive, allowing for a fully immersive experience. Designed with approachability in mind, ridiculous failure is inevitable as you work your way to the top in this vibrant, witty and comedic stress-inducing Fail Factory!.", "Purchase section": "$4.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Casual, Puzzle", "Languages": "English, Chinese (China), French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "1.0", "Developer": "Armature Studio", "Publisher": "Oculus", "Website": "http://armature.com/games/failfactory", "Release Date": "January 16, 2020", "Developer Privacy Policy": "STUDIO\nGAMES\nCAREERS\nCurrent Openings\nAbout Austin\nCONTACT\n@2018 Armature Studio LLC. All Rights Reserved\nSTUDIO\nGAMES\nCAREERS\nCONTACT\nFAIL FACTORY PRIVACY POLICY\n\nEffective: March 21, 2018\n\nThis disclosure and Privacy Policy governs Armature Studios LLCs (we, us or Armature) treatment of personally identifiable and certain other information that Armature collects, or which may otherwise come into its possession, when you become a game player of Fail Factory (the Game).\n\nThe Game is owned and operated by Armature. Armature values your privacy and is dedicated to protecting your personal information and providing you with:\n\nNotice\n\nWhat personally identifiable information we collect\n\nHow the information is used\n\nWith whom the information may be shared\n\nConsent\n\nWhat choices you have regarding collection, use and distribution of that information\n\nSecurity\n\nProcedures we use to protect against the loss, misuse or alteration of that information\n\nAccess\n\nHow you can correct any inaccuracies in the information we have collected from you\n\nINFORMATION WE COLLECT\n\nArmature collects basic user information, your user name and game score(s) from your Oculus account(s), but none of that information is retained by Armature. Nothing further is collected or retained by Armature.\n\nUSE OF THIS INFORMATION\n\nArmature makes no use of information it collects except in connection with providing your game playing experience. We do not store or retain in the normal course any personal information we gather, whether from Oculus or resulting from your playing the Game.\n\nExceptional Circumstances. If Armature or any of its lines of businesses or affiliated companies, is sold or disposed of as a going concern, whether by merger, sale of assets or otherwise, the relevant databases of Armature could, in whole or in part, be sold as part of that transaction. Therefore, any information about our game players that may be in our possession at the time, including personal information, will be disclosed as part of any merger or acquisition, creation of a separate business to provide the Game, or sale or pledge of our company assets, as well as in the event of an insolvency, bankruptcy or receivership in which personal information would be transferred as one of the business assets of the company. Information about our users in our possession, including personal information, may also need to be disclosed in connection with a commercial transaction where Armature seeks financing, investment, support or funding. We also may have to release personally identifying information when it is necessary to comply with judicial or other government subpoenas, warrants, orders, or to protect the rights, property, or safety of Armature or others.\n\nARMATURE ASSUMES NO RESPONSIBILITY OR LIABILITY WITH REGARD TO ANY THEFT, LOSS, ALTERATION OR MISUSE OF PERSONAL OR OTHER INFORMATION LAWFULLY PROVIDED BY ARMATURE TO THIRD PARTIES, OR WITH REGARD TO THE FAILURE OF ANY THIRD PARTY TO ABIDE BY THIS PRIVACY POLICY OR AGREEMENT BETWEEN THAT THIRD PARTY AND ARMATURE.\n\nACCESS TO YOUR INFORMATION\n\nIf for any reason you are concerned that the personal information in the possession of Armature is not correct, please contact info@armature.com. To the extent any information may then be in our possession, we will be happy to review, update or remove it as appropriate. We may still retain your information in our files, however, to resolve disputes, enforce our End User License Agreement or Terms of Service, and due to technical and legal requirements and constraints related to the security, integrity and operation of the Game.\n\n\n\nHOW ARMATURE PROTECTS YOUR INFORMATION\n\nWe have security procedures for the storage and disclosure of your personal information in order to prevent unauthorized access. Keep in mind however, that no method of transmission over the Internet, or method of electronic storage, is 100% secure. Therefore, while we strive to use commercially acceptable means to protect your personal information, we cannot guarantee its absolute security.\n\nIt is important for you to protect against unauthorized access to your user name and password and to your game system or computer.\n\nNOTIFICATION OF CHANGES\n\nThe Effective Date of this Privacy Policy is set forth above. Please make special note of the Effective Date of this Privacy Policy. We may revise and update this Privacy Policy if our practices change, as technology changes, or as we add new services or change existing ones. By using the Game after the then-current Effective Date, you are deemed to consent to our then-current privacy policy.\n\nIf you do not agree to the Privacy Policy at any time, you must discontinue use of the Game.\n\nDISPUTES\n\nIf you choose to load and play the Game, your visit and any dispute over privacy is subject to the Privacy Policy in effect on the date(s) of your visit, and our Terms of Service including limitations on damages, arbitration of disputes, and application of the laws of the State of Texas.\n\nHOW TO CONTACT US\n\nIf you have any questions about our privacy policy contact us at info@armature.com with a thorough description of your concerns or questions.\n\nPRIVACY POLICY/SUPPORT\n\n@2018 Armature Studio LLC. All Rights Reserved\n\nYou can opt out of Google Analytics tracking by clicking Here.", "Developer Terms of Service": "STUDIO\nGAMES\nCAREERS\nCurrent Openings\nAbout Austin\nCONTACT\n@2018 Armature Studio LLC. All Rights Reserved\nSTUDIO\nGAMES\nCAREERS\nCONTACT\nTerms of Service\n\nEnd User License Agreement & Terms of Service\n\n1. IMPORTANT READ CAREFULLY: This End User License Agreement (Agreement) is a legal and binding agreement between you (either an individual or a single entity) (you or your) and Armature Studio LLC (Owner). This Agreement sets the terms for your access, and/or use of Fail Factory, an interactive game that is and remains, as between you and Owner, the sole and exclusive property of Owner, as well as any documentation and updates thereto provided by Owner (collectively, the Software).\n\n2. WHEN YOU LOG IN, INSTALL, ACCESS, OR OTHERWISE USE OR MAKE USE OF ANY PART OF THE SOFTWARE, YOU ARE CONSENTING TO BE BOUND BY, AND ARE BECOMING A PARTY TO THIS AGREEMENT. IF YOU DO NOT AGREE TO (OR CANNOT COMPLY WITH) ALL OF THE TERMS OF THIS AGREEMENT, YOU ARE NOT AUTHORIZED TO USE OR HAVE ANY LICENSE TO ANY PART OF THE SOFTWARE.\n\nWRITTEN APPROVAL OR CONSENT IS NOT A PREREQUISITE TO THE VALIDITY OR ENFORCEABILITY OF THIS AGREEMENT. IF THESE TERMS ARE CONSIDERED AN OFFER BY OWNER, ACCEPTANCE IS EXPRESSLY LIMITED TO THESE TERMS WHICH ARE NOT SUBJECT TO CHANGE WITHOUT THE EXPRESS WRITTEN CONSENT OF THE PRESIDENT OF OWNER.\n\nWHEN YOU LOG IN, INSTALL, ACCESS, OR OTHERWISE USE OR MAKE USE OF ANY PART OF THE SOFTWARE, YOU ARE REPRESENTING TO OWNER THAT YOU ARE OF LEGAL AGE TO ENTER INTO THIS AGREEMENT AND WILL FULLY COMPLY WITH ITS TERMS.\n\n3. GENERAL SOFTWARE LICENSE.\n\nThe Software is licensed, not sold. It is a material term of the license that the Software is intended solely for your personal non-commercial entertainment use. You are not permitted to sell, sublicense, share, or otherwise transfer rights to the Software to any third party. You may not, for example, and not in limitation, decompile, reverse engineer, or disassemble the Software, except as permitted by law. The Software, including, without limitation, all code, data structures, images, sounds, text, screens, interfaces, derivative works and all other elements of the Software may not be copied, shared resold, sublicensed, rented, leased, uploaded to any computer system and/or network, distributed (electronically or otherwise), or otherwise used except as expressly authorized hereunder. Owner retains all right, title and interest in and to the Software including all intellectual property rights embodied therein and derivatives thereof. As between you and Owner, the Software is and remains the exclusive property of Owner, and is licensed, not sold, to you for non-commercial entertainment use only as provided in this Agreement. All rights not expressly granted are reserved exclusively by Owner.\n\n4. LOGIN\n\nYou may establish a unique login and password that will be required for access and use of the Software. The login is personal to you and can not be shared. You are responsible for your login and use of the Software in accordance with this Agreement, whether such use is by you or by anyone using your login. Owner may cancel or restrict your login for any reason and will have no liability to you or to any third party for doing so.\n\n5. CONTINGENT LICENSE FEE\n\nThe license hereunder is granted in consideration of the purchase price of the Software.\n\nHowever, in the event the Software is used by you or by any third party with your authorization for any commercial purpose, you agree that you will pay Owner a one time license fee of one hundred thousand dollars ($100,000.00). This license fee is in addition to, and not in lieu, or other rights and remedies that may be available to Owner arising from your breach of the license in and to the software granted hereunder.\n\n6. YOUR CONDUCT WHEN INTERACTING WITH OTHER PLAYERS.\n\nYou are responsible for your conduct when interacting with others. As a material condition to being granted this license and being given access to the Software, you agree that you will not engage in conduct or communication (written, verbal, or nonverbal), either yourself, or by or through any avatar or alter ego, which:  is threatening, bullying, defamatory, abusive, obscene, pornographic, or which in any manner could give rise to any civil or criminal liability under applicable law;  could infringe or lead to infringement of any copyright, trademark, publicity or privacy right or any other personal or intellectual property right of any person or entity;  is or could be taken as threats, slurs, hate speech or attacks on individuals or group on the basis of race, color, gender, age, religion, national origin, sexual preferences, gender identity, or any other basis;  is a solicitation or advertisement for any commercial product or activity;  encourages or constitutes behavior that does not support a safe, welcoming, and comfortable environment for all users, which behavior includes but is not necessarily limited to bullying, vigilantism, engaging in any conduct or activity that is threatening, harmful, harassing, abusive, vulgar, hateful, defamatory, sexually explicit, inflammatory, profane, racially or ethnically objectionable, religious or political, or in any manner constitutes or encourages inappropriate, disrespectful, abusive, or unlawful conduct or otherwise makes the Software and the experience of enjoying the Software and the gameplay experience uncomfortable for anyone;  restricts, inhibits, or discourages any other user from enjoying the Software and the gameplay or any element, feature, or content of the Software;  violates any local, state, federal or international laws or gives rise to civil liability;  violates or infringes any rights of third parties (including but not limited to copyright, trademark, rights of privacy or publicity, defamation or any other proprietary right);  requests account login information from other players;  spoofs (using of any means to disguise your online identity or alter original attribute information);- uses or possesses programs to crack the Software or other Internet security tools. We may, at our sole discretion, immediately suspend or terminate your access to the Software should your conduct, in our sole determination, fail to conform to these standards.\n\n7. TERM AND TERMINATION\n\nThe license granted in this Agreement is effective until terminated hereunder. You may terminate the license at any time by notifying Owner in writing by email at: (add email address) and by removing any elements of the Software that reside in any form on your computer system(s). Owner may terminate the license granted herein immediately and without notice if you fail to comply with any term or condition of this Agreement. For example and not in limitation, the license granted herein will terminate automatically upon any breach of Section 3. Upon termination of the license for any reason, you shall immediately stop using the Software and shall destroy and remove from all computers, hard drives, networks, and other storage media all copies of the Software. Section 3 through 6, and Sections 8 through 12 shall survive termination of this Agreement.\n\n8. DISCLAIMER OF WARRANTY\n\nTHE SOFTWARE IS PROVIDED AS IS WITHOUT WARRANTIES OF ANY KIND. TO THE MAXIMUM EXTENT PERMITTED BY LAW, OWNER EXPRESSLY DISCLAIMS ALL WARRANTIES, INCLUDING WITHOUT LIMITATION, WARRANTIES OF CONTINUOUS PERFORMANCE, NONINFRINGEMENT, AND ANY IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE DISCLAIMER OF ALL WARRANTIES CONSTITUTES AN ESSENTIAL AND MATERIAL PART OF THIS AGREEMENT\n\nTHE ENTIRE RISK ARISING OUT OF THE USE OR PERFORMANCE OF THE SOFTWARE RESTS WITH YOU.\n\nIN NO EVENT WILL OWNER, ITS MEMBER(S), MANAGER(S), OFFICERS, DIRECTORS, AGENTS, AND/OR EMPLOYEES, BE LIABLE FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, SPECIAL, OR PUNITIVE DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, OPPORTUNITIES, OR OTHER PECUNIARY LOSS) ARISING OUT OF THIS AGREEMENT, THE LICENSE GRANTED HEREUNDER, THE SOFTWARE, AND/OR THE USE OF OR INABILITY TO USE THE SOFTWARE, EVEN IF OWNER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\n9. INDEMNITY\n\nYou agree that Owner shall have no liability whatsoever for any use you make of the Software. You shall indemnify and hold harmless Owner from any third party claims, damages, liabilities, costs and fees (including reasonable attorney fees) arising from acts or omissions in connection with your use of the Software as well as claims that would not arise but for your failure to fully comply with any term of this Agreement.\n\n10. LIMITATION OF LIABILITY.\n\nUnder no circumstances and under no legal theory will Owners liability hereunder exceed one hundred dollars ($100.00)\n\n11. ASSIGNMENT; NO THIRD PARTY BENEFICIARIES\n\nThis Agreement is personal to you. You have no right to assign or otherwise transfer this Agreement and any action or conduct in violation of the foregoing shall be void and without effect. Owner expressly reserves the right to assign this Agreement and to delegate any of its obligations hereunder. The parties further intend that this Agreement is solely for the exclusive benefit of the parties and there are no third party beneficiaries hereunder.\n\n12. GENERAL\n\nThis Agreement represents the complete agreement concerning the subject matter between the parties and supersedes all prior agreements and representations between them. This Agreement may be amended only by a writing executed by both parties. If any provision of this Agreement is held to be unenforceable for any reason, such provision shall be reformed only to the extent necessary to make it enforceable. The failure of Owner to act with respect to a breach of this Agreement by You or others does not constitute a waiver and shall not limit Owners rights with respect to such breach or any subsequent breaches. This Agreement shall be governed by and construed under the State of Texas law (without regard to its conflicts of laws provisions) as such law applies to agreements between Texas residents entered into and to be performed within the State of Texas. The sole and exclusive jurisdiction and venue for actions arising under this Agreement shall be the State or federal courts located in Austin, TX. You hereby agree to service of process in accordance with the rules of such courts. The party prevailing in any dispute under this Agreement shall be entitled to its costs and legal fees.\n\nEach party recognizes and agrees that the warranty disclaimers and liability and remedy limitations in this Agreement are material bargained for bases of this Agreement and that they have been taken into account and reflected in determining the consideration to be given by each party under this Agreement and in the decision by each party to enter into this Agreement.\n\nQuestions concerning this Agreement should be sent to the address set forth below.\n\nAny notices or correspondences will only be effective if sent by prepaid Certified Mail, Return Receipt Requested, to such address.\n\n8310 N. Capital of Texas Hwy\n\nBuilding 2, Suite 100\n\nAustin, TX 78731\n\n13. COPYRIGHT AND TRADEMARK NOTICES\n\n Armature Studio LLC. All rights reserved.\n\nFail Factory is a trademark (or registered trademark) of Armature Studio LLC. All rights reserved.\n\nPRIVACY POLICY/SUPPORT\n\n@2018 Armature Studio LLC. All Rights Reserved\n\nYou can opt out of Google Analytics tracking by clicking Here.", "Space Required": "616.0 MB"}



["5 stars\n58%\n4 stars\n19%\n3 stars\n9%\n2 stars\n6%\n1 star\n8%", "andy.musgrove.33Jul 9 at 8:56 AM\nSimple, easy, little bit queasy\n\nNice fun little game, simple to pick up and play but nice rewards and gameplay. The animation between levels gave me a little bit of motion sickness but those sections are short in-between areas.\n\nHelpful | 20", "VRBAE21 hours ago\n\nSo fun!\n\nHelpful | 1", "KawaiiShortcakeMar 29 at 3:57 PM\nSuch a cheap game but with big thrill!!\n\nI honestly didn't expect to have so much fun playing this game?! It has so many levels for its price, and even though it's just an increased difficulty every time I still very much enjoyed pegging for all the stars (I am one short and cannot for the life of me get it, it's a disgusting stain on my perfectionism.. (': ).\n\nEventually I'm gonna show this to my nieces when they get a little older and I KNOW they're gonna have even more fun than I did.\n\nI played this game sitting down, but you can stand up if you want to? You don't even need a swivel chair to play! Just relax on the couch friend! PROBABLY THE BEST CHEAPEST GAME I WILL BUY ON THE OCULUS!!!\n\nHelpful | 60", "BallyBoy21201Jun 8 at 4:50 PM\nGreat distraction\n\nThis is a great game for the price. I like to relax with this game when I'm too tired for a roomscale but want to get away for awhile. There are 3 basic puzzles that get more difficult and complex has the levels increase.\n\nHelpful | 2", "NebulaHuskyJun 11 at 12:52 PM\nGreat game!\n\nNo complaints! Can get utterly chaotic as you go to higher levels, lots of achievements to earn, all the achievements as far as I know are just for getting more and more stars, by completing levels with higher scores\n\nHelpful | 2", "BossLadyHMay 14 at 1:28 PM\nCute and loveable.\n\nThis game is Great fun, I honestly didn't expect it to be or to enjoy it as much as I have. It was a spontaneous buy as it was on deal.\n\nVery well made game. Graphics are great and it's fun.\nIt gets harder as you go with about 4 different jobs you do. And you repeat this but they get harder and more complicated.\n\nGreat game, addictive and fun for any age.\n\nHelpful | 1", "Tony.DiIuorioApr 3 at 1:03 AM\nA child's game! Not for adults!\n\nKids would love it, some easy stuff and some more challenging stuff. It's a good way for them to hone their dexterity in a fun way.\n\nThere's just nothing there to hold an adult's interest, even if they like kid's games.\n\nExcellent price though.\n\nHelpful | 9", "Benny_Chainz9 days ago\nFun and really Cool!\n\nThere's 4 factory type challenges. Each challenge or game has many different variables which is what keeps things fun an new. The game let's you assemble factory machine parts, control giant mechs and sort crates and almost every level has different looking layouts and challenges.\n\nBetween challenges you travel through the factory tunnel systems to get to new job sites. Little background elevator music during the ride is a nice touch. Great job devs! Definitely get this!!\n\nHelpful | 0", "BLZDPraetorianJan 16 at 10:51 AM\nPerfect for kids!\n\nI love its simplicity! Its easy to control, and my kids new fav game! Its a small game but priced accordingly! And the levels do get hard enough to test you. Easy 5 stars for--\n\nGreat music, cartoon like and silly.\nEasy to learn.\nGreat for kids.\nBeautiful cartoon graphics.\nCheap fair price.\n\nI would ask the devs to perhaps add voice? My kid is young enough to need it. And as i was playing the games before my kid, i imagined a multiplayer mode! Perhaps robot racing or block shooting competitions! Im sure its a done game and in its final form. But id deff enjoy playing with my kid! Thank you devs for putting time into this wonderful little game =)\n\nHelpful | 167", "StarDude560Jun 23 at 7:53 AM\nUnplayable\n\nIt always looks like Im too small and recentering the game is impossible! Its looks fun but I cant play it\n\nHelpful | 1", "simchiJun 29 at 5:18 PM\nA+ for its price\n\nSimple & fun. I hope the game adds more activities related to bot building.\n\nHelpful | 1", "jsivonenMar 2 at 1:11 AM\nFun, yet makes you wait\n\nThis game could be JUST the thing when you want to quickly hop into the game for a few minutes and do some action for those brief moments of boredom... EXCEPT FOR THE LONG WAITING TIMES BETWEEN THE ACTUAL PLAY TIME! \n\nThe cutscenes, animations and EVERYTHING takes WAY too much time. And there are no means to skip the cutscenes. Me and my kids JUST WANT TO PLAY the darn game, not wait for the elevator traveling or robot-bird babblings.\n\nBTW, the same exact reason why my kid is not playing Sports Scramble anymore, he's sick and tired of all those waiting times between the actual playtime. PLEASE fix both games so you can jump into the action in SECONDS! \n\nHelpful | 14", "haveyisbackMay 27 at 6:34 PM\nI'm a kid\n\nI might have not seen the desc but I dont think it's that fun and stuff. It's really boring to me. But maybe other kids will like it. Dont get this if your like me and not easily impressed\n\nHelpful | 0", "nouokFeb 16 at 11:55 AM\nFail factory? More like fun factory.\n\nSo I have had this game for a bit now, and first let me say the devs could have made this game 15 dollars. The graphics are sharp and pleasing to the eye, the amount of effort is tremendous, and its just fun. But you are wondering why I gave it 4 stars. Well, it just gets a bit repetitive over time. Sorting, controlling the robot, etc, are fun at first, but get a bit boring after a bit. However, dont let that keep you from getting this game, I mean, it is the price of 2 packs of gum.\n\nHelpful | 5", "AntySocialJan 16 at 3:03 PM\nGreat game\n\nI had this on the oculus go and it was fantastic there, one of the best games of the system, but on quest, it doesn't quite compare to some of the other games available.\nHowever it's still a great game on the quest and it's good to have, especially considering the relatively low price of it.\n\nHelpful | 32", "LEngbrecht_7Mar 9 at 7:04 PM\nWorth way more than $5\n\nSeriously this game is beautiful. I got it out of curiosity because why not, its only $5. And Im blown away. The graphics are beautiful, the design is adorable and the playthru is a blast. Its a great game to relax and destress. It puts your focus into something repetitive while making you have fun and laugh. Would be a great game for kids but honestly I love this as an adult. Great job.\n\nHelpful | 3", "Quest_user01Apr 10 at 10:56 AM\nvery funny game, fair price\n\nvery funny game, easy to play, some time I try to fail the game, suck everything up, fair price, looking forward to add more challenging...\n\nHelpful | 0", "NickMajora23 days ago\nNot quite a Quest game\n\nIt only uses one controller which feels odd on Quest and there's not much variety in what you do. It is polished though and could provide a few hours of seated entertainment for its low price.\n\nHelpful | 0", "JonnyAlt42Feb 29 at 3:41 PM\n\nFirst of all, I'm really loving the experience so far, and this developer *really* knows how to pack the virtual space with meaningful visuals. The games themselves are simple fun, and the presentation is just top notch.\n\nWhich brings me to my only issue, which I'm only mentioning because I sincerely want the developers to fix a simple thing:\n\nEvery single trip through the tunnels is accompanied by an ugly hitch the moment the cart hits the turn.\n\nI'm 90% sure this is a keyframe that needs an adjustment to its interpolation settings.\n\nAnd I'm 0% sure that it's not intentional, as some way of managing the loading.\n\nBut I'm 110% completely certain that I hate it every single time I see it. I know I can turn those trips off, but they're *great* within the context of the game.\n\nSo please do fix that, and you can keep the 5 stars you already deserved.\n\nHelpful | 2", "LC-088 days ago\nKinda cool ngl\n\nKinda cool ngl\n\nHelpful | 0", "NukemarineJan 23 at 5:18 AM\nFun game, but you'll beat it fast.\n\nI played this completely on the Oculus Go, and spent a couple of hours playing through it fully on the Quest. For it's price, I don't think anyone will be disappointed in the fun they'll have playing the levels, going back to get a perfect four cogs, then maybe going back to get higher scores especially on the sorting levels. The three types of play - sorting, assembly, QA - are fun with QA being the most tedious and low scoring while sorting is the most fast paced and high scoring. Assembly levels are in the middle and most you'll max out the score with some effort.\n\nThere's little to no change though the Quest controller is much better for playing no doubt, so let that be a warning if you're Go owner thinking of buying this again. If it matters, the high scores are still new so it's possible to climb the ranks fast. I'm not much of a gamer and still got up to #4 in the rankings though I'm sure I'll be bumped soon.\n\nIf you want similar mini-game play with robots, don't forget to look up \"They Suspect Nothing\" which is an Oculus Go cross play (you have to buy it on your Go account, then access on your Quest).\n\nHelpful | 3", "KeyboardDemonJan 17 at 4:26 PM\nI liked it on the Oculus Go.\n\nBefore getting my Quest I had demonstrations of various different VR headsets, Fail Factory was the game I tried on the Oculus Go.\n\nI really liked it on the Go but felt I was missing out as it wasn't available on the Quest, now it is and I would have pre-ordered it if the option was there.\n\nThe game is like the game I remember on the Go but much better.\n\nI'm really enjoying the game, it's something I'd recommend, at the price it is a good title to have on your Quest so first time players have a good first-time experience of playing VR when they try out your Quest.\n\nHelpful | 17", "messbrianFeb 11 at 8:45 AM\nNice fun game\n\nThis game is pretty cool. Its not very challenging but it is challenging. Fun to play.\nWell worth getting very game. Seems to have plenty of levels too. After Im done with it, Ill go back and see if I can get a perfect score on each level.\n\nHelpful | 1", "JWORKS3RDFeb 18 at 7:25 AM\nAddictive\n\nAddictive game...even when you complete a task you want to try again to beat your last score.\nYou can't go wrong with this game...this is also the same company that made Sports Scamble\n\nHelpful | 3", "Loudini12Jan 26 at 2:50 AM\nAffordable and Amazing -\n\nThis game has an amazing scenery and characters. The mini games are fun as you try and race up the leaderboard, the sorting game was my favourite as you pick up boxes and launch thumb into holes. I would of gave this full stars but I notice in game the audio crackles from time to time, casting it on TV or starting a stream caused the stream audio to create popping and cracking sounds. It would be great to have this bug fixed. \n\nOverall: Great game with nice understandable concept great replay ability.\n\nHelpful | 2", "kking177Jan 20 at 4:20 PM\nBoring...\n\nI bought this game just because there aren't many games on the oculus and it was new and wanted something new to play [please get more games on this thing oculus]. There was way too much filler dialog and the game is too simplistic and not very fun at all. I got 5 stars on everything I did and it wasn't even challenging. Seems like it's maybe a game for kids.\n\nHelpful | 10\nDeveloper ResponseJan 20 at 4:57 AM\n\nHello Kking177, We're Sorry you didn't enjoy Fail Factory!, if you are still within the refund period and would like to request one, please use the following link. https://tickets.oculusvr.com/hc/en-us/requests/new ~The Armature Team.", "glomc133Mar 15 at 12:13 PM\nfun\n\nlov this so much fun very colourful\n\nHelpful | 0", "RAGDTJan 19 at 2:44 PM\nJUST BUY IT ! ! !\n\nI have bought, played and unfortunately returned many titles on the quest, as I just did not like the game play or I couldnt see myself ever playing them again. This on the other hand is simple, fun, addictive and has tons of replay ability. The cheeky Characters really make this title and Im sure this will be a must have game to download for new quest owners. You really wont regret it, this game isnt just for kids.\n\nHelpful | 11", "BrendanRoyMay 9 at 6:46 PM\nUmm no\n\nNot a fun game at all\n\nHelpful | 0", "TVL1977May 8 at 4:05 PM\nCute little game\n\nMaybe it's not the most adult game on the quest.... But it's colorful, cheerful and just the amount of fun for a quick play. Enough levels to conquer to keep you busy.\nAnd for this price it's definitely a nice fun game to own.\n\nHelpful | 0", "Dr.FeynmanMay 21 at 10:12 PM\nFun, but needs some work and balance.\n\nThe game was fun, and simple, I think my nephews will enjoy it when I show them. Overly easy for adults. Without really tying I was able to get \"Perfect\" and sometimes 3-5x the required score for perfect on the first try.\n\nI knocked off a star for a glitch/mishap/notsurewhattocallit. In level 13, the guys in the background interfere with each other and cost you negative points. The robot knocked over an employee literally off the screen where you have no control and I just saw the negative red points flash, then boom you're in the red.\n\nIt came in a bundle with Apex, and so I gave it a wirl. Overall it's cute and I enjoyed the bit I played.\n\nHelpful | 0", "StaticCloudFeb 12 at 12:23 PM\nCheap, Fun, NOICE\n\nWhile I am aware that this is just a port from the Go game, I still really think it works well on the Quest. The games are easy to get the hang of, there's hours of playtime here, games get gradually more difficult as the game goes on, and the visuals are simple so no gritty 240p walls here folks.\n\nAlthough there are a few cons to this game. One being the cel shading. It makes it really challenging to see depth which I kind of understand as it makes the levels more difficult but at that point you might aswell be playing it on a flatscreen if there's no depth to anything. The only indicators of where something is in the 3D space would be a shadow underneath it but otherwise, it's quite a challenge to tell how far something is. Also after about ten minutes of recording footage the audio starting to clip and lagging (if that makes any sense) then after about an hour, the screen just went black and I had to restart the game. Not too much of an issue given I was playing for way too long but could be quite annoying for a full playthrough. ( Just looked back and the recorded audio is extremely broken. Grainy beeping throughout the entire thing so if you're planning on recording footage, good luck. )\n\nIn conclusion it's a cheap, fun, and noice game with hours of playtime and tbh no game breaking issues.\n\n+ points for transport tube loading screen and cross buy\n\nHelpful | 6", "diomarkJan 20 at 9:04 AM\nCute, but gave my kid motion sickness\n\nGame itself is pretty cute. But the tunneling to new sections gave my kid that normally has good vr legs motion sickness. Would love an option to skip those\n\nHelpful | 8\nDeveloper ResponseJan 20 at 1:13 PM\n\nHello Diomark, You can disable the tunnel loading in the options menu, the option is called \"Slip Pod Movement\" ~The Armature Team.", "AskjerryJan 22 at 8:42 PM\nGreat for the price!\n\nFor the cost of this game... I'm sure having a lot of fun! I bought it because I thought it would be a good kid's game... and it is... but as the levels get harder I was really getting into the challenge. Unfortunately an internet connection is required... so I can't play it if I don't have a good connection... but otherwise it's great. They do have one \"level\" that you click on which takes you to purchase another game... I don't care for that. But overall... if you want a fun game for a low price... don't pass it up.\n\nHelpful | 1", "DatIsaacJan 18 at 6:47 PM\nCasting Issues\n\nCasting this for my kids and it has terrible static like pops and noise. I dont know whats going on but its the only time I have these popping sounds. It loads and the first tunnel to the main menu is fine. Once I get to the main menu the unbearable noise starts.\n\nHelpful | 7", "MacPhyleMar 7 at 12:54 AM\nLots of Fun!\n\nGlad I bought this! So cute and funny, and not too difficult.\n\nHelpful | 0", "calforbJan 16 at 11:07 AM\nGreat fun for the price\n\nMore suited to children but still fun for adults. At this price its hard to complain. Well put together game!\n\nHelpful | 18", "DJLobo76Mar 2 at 3:38 AM\nLots of fun!\n\nEasy, yet challenging, can keep me entertained for hours!\n\nHelpful | 0", "Dotheboogey679Jun 6 at 8:38 PM\nSuper good GAME\n\nThis Was A SUPER FUN GAME AND I LIKE IT SO MUCH PLAY IT FOR YOUR SELF:D\n\nHelpful | 0", "Gilagassi1Jan 19 at 5:01 AM\n\nA great 3d vr experience. I am number one on the leaderboards\n\nHelpful | 7", "domingoriveravelezJan 17 at 5:13 PM\nVery nice\n\nI like the story!\n\nHelpful | 8", "gmn620Jan 20 at 11:15 AM\nSimple but Amazing\n\nHonestly a great game I have had lots of fun with it. Its simplicity is great in a fun way, and for the price of $5 it exceeded my expectations greatly and its definitely worth it.\n\nHelpful | 2", "Wknight76Jan 17 at 7:11 PM\nGreat little game !\n\nIts $5 and worth more nice little fast loading game runs super smooth. You go from game to game so you do different things it does repeat but changes a little. $5 dont pass it up.\n\nHelpful | 3", "Jake.70Apr 28 at 6:55 PM\nAwsome for the price\n\nThis game I 200% recommend one of the best games on the quest and they have an amazing customer service team. I cannot recommend you get this game enough. Its awsome just absolutely amazing\n\nHelpful | 0", "steve.fuller.71619Feb 8 at 2:01 AM\nHelp\n\nHas anybody got any idea what you have to do with the big robot facing you and two big floating ball things,i havnt a clue?????????\n\nHelpful | 0\nDeveloper ResponseFeb 10 at 2:36 PM\n\nHello Steve, There should be instruction panels at the beginning of each level indicating what is expected. ~The Armature Team.", "ViruZAngelFeb 23 at 7:36 AM\nGood,but\n\nThey made you get perfect on everything instead of adding more content.But its just 5 bucks but some of the levels are bad but again its only 5 bucks worth every dollar\n\nHelpful | 0\nDeveloper ResponseFeb 3 at 6:25 AM\n\nHello ViruZAngel, You can disable the tunnel transitions and use a teleporter type function by entering the options menu and turning \"Slip Pod Movement\" to off. ~The Armature Team.", "DAX_QcJan 19 at 8:13 PM\nFun little game\n\nFun but for kids in my opinion. The constant 'loading' from lvl to lvl is a bit annoying.\n\nHelpful | 3\nDeveloper ResponseJan 20 at 4:56 AM\n\nHello DAX_Qc, You can disable the tunnel loading in the options menu, the option is called \"Slip Pod Movement\" ~The Armature Team.", "demetria.bogard.92Feb 7 at 9:38 PM\nMy feedback\n\nI'm not enjoying this game I rather have Scrambled instead wish I could switch\n\nHelpful | 2\nDeveloper ResponseFeb 10 at 12:46 PM\n\nHello Demetria, We're sorry that you're not enjoying Fail Factory!, if you are still within the refund period, you can request one by following this link. https://tickets.oculusvr.com/hc/en-us/requests/new ~The Armature Team.", "Apple14Feb 15 at 8:02 AM\nOk\n\nIt's really fun for 5 minutes then it's boring and repetertive\n\nPurchase it, but only because of the price\n\nHelpful | 1", "debksurJan 25 at 6:57 AM\nfun for what I paid\n\nIt was only 3.99 & its ok but I don't like the long drive through the tunnels,just need work work work!\n\nHelpful | 1\nDeveloper ResponseJan 27 at 5:50 AM\n\nHello Debksur, you can change to a faster load method by going into the options menu and turning off slip pod movement. ~The Armature Team.", "KnightonheathJan 18 at 10:45 PM\nFun game, Great price\n\ngreat little game with loads of achievments to get too\n\nHelpful | 3", "brodoromoJan 17 at 5:44 PM\n\nIts graphics are good and perfect for me\n\nHelpful | 5", "KubikerJan 17 at 8:54 PM\nExcellent!\n\nSimple 100% fun!\n\nHelpful | 7", "roy.cole.5891Jan 23 at 8:01 AM\nRoy.cole.5891\n\nAwesome game! Unbelievable price!\n\nHelpful | 1"]