{"App Title": "FandangoNOW", "App description": "Why Youll Love FandangoNOW:\n Instantly stream and download over 100,000 movies & TV shows at home and on the go\n Level up your viewing experience with 3D content\n Watch the newest releases and classic favorites  no subscription needed\n Discover movies not currently available on Netflix, Hulu or Amazon Prime Video subscriptions\n Link your Movies Anywhere account to FandangoNOW and access your your movies anytime, anywhere\n Got a Fandango VIP account? No need to create a new account on FandangoNOW. You can sign in with your Fandango VIP email and password\n\nNow, lets find something awesome to watch.\n\nBy downloading, installing & using this App, you agree to Fandangos Privacy Policy (http://www.fandango.com/PrivacyPolicy.aspx), Terms of Use (http://www.fandango.com/TermsOfUse.aspx), Purchase Policy (http://www.fandango.com/PurchasePolicy.aspx) and Do Not Sell My Info (https://www.fandango.com/donotsellmyinfo).", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Movie", "Languages": "English", "Version": "1.2.2", "Developer": "Fandango", "Publisher": "Fandango", "Website": "https://www.fandangonow.com/", "Release Date": "September 25, 2019", "Developer Privacy Policy": "GOING BACK TO MOVIE THEATERS READ MORE\nGift Cards | Offers | Sign In\nFandango\nScreen Reader Users: To optimize your experience with your screen reading software, please use our Flixster.com website, which has the same tickets as our Fandango.com and MovieTickets.com websites.\n \nSkip to Main Content\n GO\nMOVIES\nNOW PLAYING\nSEE ALL NOW PLAYING\nOPENING THIS WEEK  = Limited Release\nBill & Ted Face the Music\nThe New Mutants\n The Personal History of David Copperfield\n The Eight Hundred (2020)\n Nomad: In The Footsteps of Bruce Chatwin\n Still Here (2020)\nSEE ALL OPENING THIS WEEK\nCOMING SOON\nTenet\nThe King's Man\nGreenland (2020)\nHonest Thief (2020)\nWonder Woman 1984\nCandyman (2020)\nThe War with Grandpa\nDeath on the Nile (2020)\nSEE ALL COMING SOON\nEXPLORE MORE\nWATCH TRAILERS ON MOVIECLIPS\nTOP BOX OFFICE\nNEW FOR STREAMING\n \nTHEATERS + TICKETS\nWHERE ARE YOU LOCATED? HERE ARE OUR TOP CITIES\nNew York, NY\nLos Angeles, CA\nAtlanta, GA\nChicago, IL\nAustin, TX\nMiami, FL\nSan Francisco, CA\nPhoenix, AZ\nWashington, DC\nBoston, MA\nSan Diego, CA\nSeattle, WA\nEdison, NJ\nHouston, TX\nTampa, FL\nFIND THEATERS + MOVIE TIMES NEAR\n FIND MOVIE TIMES + TICKETS\n \nMOVIE NEWS\nFEATURED MOVIE NEWS\nCheck Out This Behind the Scenes Look at 'Bad Boys For Life'\nREAD MORE\nWhat to Watch on FandangoNOW: The Secret: Dare to Dream, The Secret Garden, She Dies Tomorrow and More\nREAD MORE\nThe Week in Movie News: Spider-Man Spin-Offs for Olivia Wilde and J.C. Chandor, Ben Afflecks Batman Returns for The Flash and More\nREAD MORE\nEXPLORE CONTENT\nMOVIE REVIEWS\nSTAR WARS GUIDE\nAWARDS WATCH\nINDIE MOVIE GUIDE\nFAMILY GUIDE\nHOUSE OF SCREAMS\nWEEKEND TICKET\n \nJOIN FANDANGOVIP\nBUY MOVIES. GET MOVIES.\n\nEarn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies.\n\nLEARN MORE\nINSIDER PERKS\n\nGet your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore.\n\nLEARN MORE\nPARTNER REWARDS\n\nCollect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts.\n\nLEARN MORE\nREFUNDS + EXCHANGES\n\nWe know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime.\n\nLEARN MORE\nJOIN FANDANGO VIP FOR FREE\n\n(It only takes a few seconds to join)\n\nAlready a Fandango VIP? SIGN IN\nPRIVACY POLICY\nPrivacy Policy\nTerms and Policies\nTerms of Use\nTicket Policy\nPromo Code Policy\nGift Card Terms\nCookies and Tracking\nFandangoNOW and Vudu Policy\nVIP+ Program Terms\nDownload Translations\nen Espaol en Franais auf Deutsch\nLast updated: August 18, 2020\n\nThis Privacy Policy explains how Fandango Media, LLC and its subsidiary companies, including the businesses operating under the Fandango, FandangoNOW, Vudu, Rotten Tomatoes, Flixster, Movieclips, Movies.com, Activaterewards.com, MovieTickets.com, or M-GO brands (\"Fandango\", \"we\", \"our\" or \"us\"), collect, use, and share information from or about you when you use our websites, downloadable applications, interactive TV applications, voice-activated skills, other digital services, connected devices, and off-line services that link to this policy, or if you generate ratings/reviews/public comments/content on our properties or engage in business with us (the Services). Note that this Privacy Policy does not apply to our movie ticketing business that operates in Latin America, as that business has a separate privacy policy.\n\nOur Owners\n\nWhen the Services receive or collect information, that information is being received and collected, and will be owned, by Fandango and each of \"Fandango's Owners\" (i.e., each company that has an ownership interest in Fandango). While Fandango's use, handling, disclosure and practices with respect to that information will be governed by this Privacy Policy, each Fandangos Owners use, handling, disclosure and practices with respect to that information will be governed by that Fandangos Owners privacy policy. Fandango's Owners are currently NBCUniversal and Warner Bros. If you want to learn more about the privacy practices of NBCUniversal and Warner Bros., we encourage you to review their policies (linked below):\n\nNBCUniversal Privacy Policy\nWarner Bros. Privacy Policy\nYour Rights to Dispute\n\nYour use of our websites and our other services are subject to binding individual arbitration of any disputes which may arise, as provided in the Terms and Policies. Please read the arbitration provisions of the Terms and Policies carefully and do not use the Services if you are unwilling to arbitrate any disputes you may have with us as provided in our Terms and Policies.\n\nPLEASE READ THIS PRIVACY POLICY CAREFULLY TO UNDERSTAND HOW WE HANDLE YOUR INFORMATION. BY USING THE SERVICES, YOU ACKNOWLEDGE YOU HAVE READ AND UNDERSTAND THIS PRIVACY POLICY AND THAT WE WILL COLLECT, USE AND SHARE YOUR INFORMATION AS SET FORTH BELOW.\n\nTable of Contents\nPersonal Information We Collect and Purposes\nWhen We Share Your Information\nLegal Bases For Use of Your Information\nChildren\nYour Rights\nYour Choices\nHow We Protect Your Information\nInternational Transfers\nUpdates to Our Privacy Policy\nContact Us\n1. PERSONAL INFORMATION WE COLLECT AND PURPOSES\n\nThe tables below explain the categories of information we collect and the purposes for which we use them. Please note that we may use any or all of this information to comply with the law, detect or prevent fraud, and to defend our legal rights. Further detail about each of the purposes is set out in the Additional information on purposes of use table below.\n\nInformation you provide to us:\nCategories of personal information we collect\tPurposes of use\n\nContact information and account registration\n\nFor example: name, email, postal address, telephone number, account user name and password, business contact information, and any information you may provide to us at an event or in person.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nBuild and manage business-to-business relationships\nMarket and advertise for third parties\n\n\nIdentification and demographics\n\nFor example: date of birth, gender, nationality, ethnicity, interests, lifestyle information, photos, social media credentials, including identification information about friends, contacts or referrals you provide.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nSaved Preferences\n\nFor example: when you save on the Services your favorite theaters, favorite movies or genres, or city or zip code theater preferences.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nTransactional\n\nFor example: credit/debit card details, other payment details (e.g., PayPal, Venmo), purchase history, delivery address, membership information, reservations, loyalty program memberships or subscriptions for companies or services other than Fandango, and the personal details of any of your guests.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nUser-generated content\n\nFor example: photos, videos, audio, and other information you may submit to us, such as ratings/reviews or comments on our forums.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nResearch and feedback\n\nFor example: comments that you send us through online forms and social media platforms, by email, over the phone, by mail, or in surveys.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nBiometric identifiers\n\nFor example: facial scans or fingerprints.\n\n\t\nProvide the Services\nPersonalize your experience\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\n\n\nAudio and video\n\nFor example: audio recordings of a customer service call or security video footage if you visit one of our properties.\n\n\t\nProvide the Services\nPersonalize your experience\nProtect our users, Services and properties\nInformation we collect automatically from you and/or your device:\nCategories of personal information we collect\tPurposes of use\n\nDevice information and identifiers\n\nFor example: IP address, cookie IDs, browser type and language, operating system, platform type, device type, and advertising and app identifiers.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nConnection and Usage\n\nFor example: domain names, browsing activity, scrolling and keystroke activity, theaters searched, locations searched, movies searched, shows viewed, movie trailers or other advertisements viewed, forms or fields you complete or partially complete, search terms, whether you open an email, content you view and duration, quality of the service and interaction with the content, logs, and other similar information. If these events occur while you are offline, they may be logged and uploaded to us when you next connect.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\n\n\nGeolocation\n\nFor example: city, state and ZIP code associated with your IP address or derived through Wi-Fi triangulation.\n\nWe will ask for your permission before using your precise location from GPS-based functionality on your mobile devices.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nProtect our users, Services and properties\nMarket and advertise for third parties\nInformation we collect from third parties:\nCategories of personal information we collect\tPurposes of use\tSources of information\n\nInformation from public and commercial sources\n\nFor example: demographic and contact information, information about other members of your household, inferences about your preferences, loyalty program memberships or subscriptions for companies or services other than Fandango, and purchasing data.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nBuild and manage business-to-business relationships\nMarket and advertise for third parties\n\t\nAdvertising providers\nAnalytics providers\nMarketers\nPartners (such as for sweepstakes partners)\nConsumer data resellers\nPublic records databases\n\n\nSocial Media Information\n\nFor example: if you interact with us through a social media service or log in using social media credentials, depending on your social media settings, we may have access to your information from that social network such as your name, email address, friend list, photo, age, gender, location, birthday, social networking ID, current city, your comments about the Services, and the people/sites you follow.\n\n\t\nProvide the Services\nPersonalize your experience\nSend you marketing communications\nProvide seamless experience across platforms and devices\nMarket and advertise for third parties\n\t\nSocial media networks\nPartners of social media networks\nAdvertising providers\nAnalytics providers\nMarketers\nPartners (such as for sweepstakes partners)\nConsumer data resellers\nAdditional information that we collect for business relationships only:\nCategories of personal information we collect\tPurposes of use\tSources of information\n\nBusiness contact information\n\nFor example: company name, your name, email address, and job.\n\n\t\nBuild and manage business relationships\n\t\nYou\nYour company\nTrade associations\nSocial media\nBusiness data resellers\n\n\nDue diligence information\n\nFor example: contact information, nationality, job title, age, date of birth, gender, country of residence, employment and education information, public, religious, political or trade union roles, personal and professional affiliations, connections to criminal activities or offenses related to money laundering.\n\n\t\nCompliance and risk management activities for business relationships\n\t\nYour or your companys responses to our due diligence questions\nThird party compliance screening tools and databases, such as those provided by LexisNexis Risk Solutions. Click here for more information.\nAdditional information on purposes of use\nProvide the Services, for example:\nresponding to your requests or inquiries, including technical support\nsending you service-related communications\nproviding ticketing, payment services, mapping guidance, and offers\ndisplaying content you generate, such as video and comments\ncarrying out research and analytics for uses including improving the Services and developing new ones\nprocessing your information for promotional campaigns such as sweepstakes and contests, and for surveys, online and offline panels and focus groups\nPersonalize the experience, for example:\nproviding you with customized product experience, including personalized newsletters, viewing and other content recommendations from our partners and other organizations.\nproviding you with advertising based on your activities and interests including at a household level\ncreating and updating profiles and audience segments that can be used for analytics, interest-based advertising and marketing on the Services, television, third party services and platforms, mobile apps and/or websites, connected devices and offline\nusing inferences about your preferences and interests for any and all of the above purposes\nSend marketing communications (with consent if required), for example:\nsending you newsletters, surveys and information about products, services and promotions\nProvide a seamless experience across platforms and devices, for example:\nidentifying you when you log into the Services on multiple devices or web browsers to provide continuity and to match your interests across devices for the purposes of analytics, advertising, reporting and to improve the Services\nidentifying you if your devices have attributes suggesting that they may be used by the same individual or household for purposes of analytics, advertising, reporting and to improve the Services\nBuild and manage business relationships, for example:\npursuing potential business opportunities, including identifying and contacting the correct person within the company\nsending communications for business purposes\nsending event invitations, marketing emails and campaigns, and tracking the effectiveness of such communications\nproviding business contacts with access to our systems, and managing that access\nMarket and advertise for third parties, for example:\nsend you newsletters, promotional emails, surveys and information about products, services and promotions offered by our partners and other organizations with which we work\ncustomize content that our third-party partners deliver on the Services (e.g., personalized third-party advertising)\ncreate and update inferences about you and audience segments that can be used for interest-based advertising and marketing on the Services, third party services and platforms, and mobile apps\ncreate profiles about you, including adding and combining information we obtain from third parties and matching your interests across devices, which may be used for third-party marketing and advertising on the Services, television, third party services and platforms, mobile apps and/or websites, connected devices and offline\nCompliance and risk management activities for business relationships, for example:\ncompliance with laws and regulations\nmanaging third party and other risks to our business\nprotecting the reputation of our businesses\nfollowing the principles of ethical business conduct set out in our Code of Conduct\nProtect our users, Services and properties, for example:\nprotecting the safety and security of users and visitors to the Services\nprotecting our digital and physical properties\ndetecting and preventing other activities that may be illegal or in violation of our terms of service\n\nWe may combine all the information we collect from or receive about you for the outlined purposes. We may aggregate or deidentify your information and may use, share, rent or sell aggregated or deidentified information for any purpose, and such information is not subject to this Privacy Policy.\n\nSale of Personal Information: If you, or someone acting on your behalf, would like to request that we do not sell your personal information, you can either click here for such request, or send an email to donotsell@fandango.com. You will also need to clear your cookies and re-set your MAIDs, as referenced in the link. For more information about how to opt-out of receiving targeted advertising from certain third party advertisers, please see our Cookies Notice.\n\nFor Vudu (which Fandango acquired from Walmart), if you are a California resident and you, or someone acting on your behalf, would like to request that Vudu does not sell your personal information, you can either click here or call 800-925-6278 and Walmart will process your request on Vudus behalf.\n\n2. WHEN WE SHARE YOUR INFORMATION\n\nWe may share your information with:\n\nTheaters and Event Providers: We may share information so that they may admit you, or address customer service issues at the theater or venue, or help process your ticketing or transactions, or otherwise to fulfill the Services.\nAdvertisers, Advertising Networks, and Other Third Parties: We may share information about how you use the Services and interact with content or ads to better tailor services, products, marketing and advertising on the Services and on third-party platforms. To enable these purposes, we may share certain demographics information, user-generated content, device information and identifiers, connection and usage data, geolocation data, public and commercial information, and social media information. These third parties may use their own tracking technologies to collect or request information about you, please see our Cookies Notice.\nPartners: We may share your information with third party partners. For instance, if you enter a contest, promotion or sweepstakes sponsored by a third party, we may share the information you provide for that entry with the sponsor. Depending on the partnership, we may share certain information including contact information (at your direction), identification and demographic information, transactional information, user-generated content that you provide, research and feedback, device information and identifiers, connection and usage information, public and commercial information, and social media information. We may also share your information with third parties that provide video locker services if you purchase a movie or other show to view at home. Examples of such a third party would be Movies Anywhere. Similarly, we may share your information with the providers of loyalty programs if you take an action in the Services indicating that you would like to obtain a benefit under such a program through activity on the Services.\nSocial Networks: We may share your information with social media platforms for example, if you click on a Facebook like button on the Services, the like may appear on your Facebook account. To control this sharing of information, please review and adjust your privacy settings for the relevant social network. Depending on your privacy settings and actions on such network, we may share contact information, identification and demographic information, user-generated content, device information and identifiers, connection and usage data, and social media information.\nService Providers: We engage vendors to perform services for business purposes on our behalf and share information with them to enable them to provide us with such services, including research and analytics, hosting, transaction and payment processing, promotion administration, fraud prevention, identity management, acquisition and other services. Service providers may use such information for their operational purposes in order to provide their services to us.\nResearch and Measurement Companies: We may share information about content you view on the Services with video measurement services such as Nielsen TV Ratings, as well as other analytics providers. See Your Rights and Your Choices sections for more information.\nSearch Engines: You may be able to engage with other members of the Services or the public. This may make the name and photo associated with your profile and any comments or user-generated content you provide visible to other members of the Services or the general public. If the information is available to the general public, it may also be searchable by search engines.\nLaw Enforcement, Regulators, Anti-fraud Coalitions and Other Groups: We share any of the categories of information we collect, as appropriate, with these third parties in order to: protect and enforce the legal rights, privacy, and safety of ourselves and our visitors; protect against possible fraud or other illegal activity; respond to requests from government and other authorities; and otherwise comply with legal process.\nOther Sharing: We may share information about you, often along with a hashed or masked identifier, with third parties so they may better personalize your experience with them and the advertising and other offers they show or otherwise send you and to determine advertising effectiveness. With your appropriate consent when required, and consistent with applicable law, we may share your video viewing behavior with third parties including service providers, advertising companies, analytics partners, and social media sites.\nSale or Transfer of All or Part of Our Business or Assets: In the event that Fandango (or any Fandango business) is involved in a merger, acquisition, transfer of control, bankruptcy, reorganization or sale of assets, or diligence associated with such matters, we may sell or transfer the information described in this Privacy Policy as part of that transaction.\nSale of Personal Information: Under California law, certain of the information sharing described above may be categorized as the sale of personal information under certain circumstances. California law broadly defines sale in a way that may include allowing third parties to receive certain information such as cookies, IP address and/or browsing behavior to add to a profile about your device, browser, or you. This profile may enable delivery of interest-based advertising on the Services or other sites. Depending on what Services you use, we may share the following categories of information for such advertising which may be considered a sale (as defined by California law): identification and demographics; device information and identifiers, such as IP address, and unique advertising identifiers and cookies; connection and usage information, such as browsing history or app usage; geolocation information, such as city; and inference data. To the extent that it does constitute such a sale, you may opt out of that sale through the mechanism described below.\n3. LEGAL BASES FOR USE OF YOUR INFORMATION\n\nLaws other than the federal, state and local laws of the United States do not apply to our watch-at-home movie Services (e.g., FandangoNOW/M-GO and Vudu) as content from those Services can be viewed only in the United States. Similarly, for our movie ticketing Services (e.g., Flixster, Fandango.com and MovieTickets.com), the only laws that shall apply are the laws of the countries in which the theaters ticketed by each respective Service are located. The information set forth below in this section is applicable only to European Users of Rotten Tomatoes. It supplements certain sections of this Privacy Policy and provides additional information that should be read together with other sections of this Privacy Policy. To the extent there is any conflict between this section and another section of this Privacy Policy, this section shall govern.\n\nWhen this policy mentions \"Fandango\", \"we\", \"our\" or \"us\", it refers to the company or companies responsible for your information under this Privacy Policy (or Data Controller). This includes Fandango Media, LLC and Fandangos Owners (as defined above), currently NBCUniversal, LLC and Warner Bros (please see above for further information on these companies).\n\nThe laws of some jurisdictions, such as the European Union, require companies to tell you about the legal basis for using, sharing, or disclosing your information. To the extent those laws apply, we may rely on the following legal bases:\n\nPerformance of a contract: where use of your information is necessary to provide you with the Services under a contract, for example the terms of service.\nLegitimate interest: where use of your information is necessary for our or others legitimate interests and where the use is not outweighed by your rights and interests. Below are some examples of such interests:\nproviding the Services\nimproving the Services and developing new ones\nrecognizing and better understanding our users, including across platforms\nconducting security and fraud prevention activities\nmarketing and promoting our content and services\nbuilding and managing business relationships\nconducting compliance and risk management activities\nproviding and managing access to our systems\nLegal obligation: where use of your information is necessary to comply with laws and regulations such as those relating to anti-bribery and corruption and anti-money-laundering, complying with requests from government bodies or courts, or responding to litigation.\nWith consent: we may ask for your consent to process your information in a certain way. Where we rely on this basis, you have the right to withdraw your consent at any time  please see the Your Rights and Your Choices sections below to do this.\nHow Long We Keep Your Information\n\nWe will keep your information only for as long as it is necessary to fulfill the purposes described above, unless a longer retention is required or permitted by law. We may delete or de-identify your information sooner if we receive a verifiable deletion request, subject to exemptions under applicable law. The retention period that applies to your information may vary depending on the Services you use and how you interact with them.\n\n4. CHILDREN\n\nThe Services are not designed or intended for use by children under 13, and thus if you are under 13 we ask that you do not use the Services or provide us with any information. If we discover that we have inadvertently gathered any such information then we will, to the extent required by law, delete such information from our records. There is one exception to this: we may offer a Service that is directed to children under the age of 13, and if we do it will state that it collects information from children, and it will also have a separate privacy policy posted detailing the practices specific to that Service. If a parent or guardian becomes aware that his or her child under 13 has provided us with information without his or her consent, he or she should contact us at privacy@fandango.com.\n\n5. YOUR RIGHTS\n\nDepending on where you live, you may have certain rights with respect to your information. For example, under local laws, you may be able to ask us to:\n\nprovide access to certain information we hold about you, in some cases in a portable format, if technically feasible\nupdate or correct your information\ndelete certain information\nrestrict the use of your information\n\nWe will respond within the time period prescribed by applicable law. Please note that many of the above rights are subject to exceptions and limitations. You have the right not to be discriminated against (as provided for in applicable law) for exercising your rights under some local laws such as in California.\n\nSome Services can be provided only if we have your information, therefore deletion of your information will result in termination of such Services.\n\nWe will take reasonable steps to verify your identity, including authenticating you through the email address we have on file. We may require further documentation such as a password and user ID before granting access to your information. As you may be aware, we recently acquired Vudu from Walmart, and Walmart is still providing certain privacy related services for Vudu, including fulfilling California Consumer Privacy Act (CCPA) requests to the extent required by law.\n\nYou may submit the following types of requests as follows:\n\nRequest Categories of Information: If you, or someone acting on your behalf, would like to request that we tell you the categories of personal information we collect, the categories of sources from which personal information is collected, the business or commercial purpose for collecting or selling the personal information, the categories of third parties with which the business shares personal information, the categories of information about you that we sell, the categories of third parties to whom the personal information was sold, or the categories of personal information that were disclosed for a business purpose, you or someone acting on your behalf can either click here for such request, or send an email to accessdata@fandango.com.\nAs you may be aware, we recently acquired Vudu from Walmart, and Walmart is still providing certain privacy related services for Vudu, including fulfilling CCPA requests to the extent required by law. If you are a California resident and you, or someone acting on your behalf, would like to request that Vudu tell you the categories of personal information Vudu collects, the categories of sources from which personal information is collected, the business or commercial purpose for collecting or selling the personal information, the categories of third parties with which Vudu shares personal information, the categories of information about you that Vudu sells, the categories of third parties to whom the personal information was sold, or the categories of personal information that were disclosed for a business purpose, you or someone acting on your behalf can either click here or call 800-925-6278 and Walmart will process your request on Vudus behalf.\nRequest Specific Information: If you, or someone acting on your behalf, would like to request that we tell you about some of the specific personal information that we hold about you, you or someone acting on your behalf can either click here for such request, or send an email to accessdata@fandango.com.\nAs you may be aware, we recently acquired Vudu from Walmart, and Walmart is still providing certain privacy related services for Vudu, including fulfilling CCPA requests to the extent required by law. If you are a California resident and you, or someone acting on your behalf, would like to request that Vudu tell you about some of the specific personal information that Vudu holds about you, you or someone acting on your behalf can either click here or call 800-925-6278 and Walmart will process your request on Vudus behalf.\nRequest Deletion: If you, or someone acting on your behalf, would like to request that we delete information that we hold about you, you or someone acting on your behalf can either click here for such request, or send an email to deletedata@fandango.com. Note that certain information about you will not be deleted if you request such a deletion, as may be permitted by law. Also note that we will not be able to provide you with certain Services upon a deletion. You will also need to clear your cookies and re-set your MAIDs, as referenced in the link.\nAs you may be aware, we recently acquired Vudu from Walmart, and Walmart is still providing certain privacy related services for Vudu, including fulfilling CCPA requests to the extent required by law. If you are a California resident and you, or someone acting on your behalf, would like to request that Vudu deletes information that Vudu holds about you, you or someone acting on your behalf can either click here or call 800-925-6278 and Walmart will process your request on Vudus behalf.\nDo Not Sell My Personal Information: If you, or someone acting on your behalf, would like to request that we do not sell your personal information, you or someone acting on your behalf can either click here for such request, or send an email to donotsell@fandango.com. You will also need to clear your cookies and re-set your MAIDs, as referenced in the link. For more information about how to opt-out of receiving targeted advertising from certain third party advertisers, please see our Cookies Notice.\nAs you may be aware, we recently acquired Vudu from Walmart, and Walmart is still providing certain privacy related services for Vudu, including fulfilling CCPA requests to the extent required by law. If you are a California resident and you, or someone acting on your behalf, would like to request that Vudu does not sell your personal information, you or someone acting on your behalf can either click here or call 800-925-6278 and Walmart will process your request on Vudus behalf.\n\nPlease note that you may be located in a jurisdiction where we are not obligated, or are unable, to fulfill a request. In such a case, your request may not be fulfilled. In addition, the above requests do not apply to Fandangos Owners, who are currently NBCUniversal and Warner Bros. To send them requests, please visit their websites.\n\nIf you have any unresolved concerns, you may have the right to complain to your local data protection authority.\n\nAdditional Rights for California Residents: Residents of the State of California may request a list of all third parties to which the Services have disclosed certain personal information (as defined by California law) during the preceding year for those third parties' direct marketing purposes. If you are a California resident and want such a list, please contact us at Fandango, Attn: Privacy Officer, 407 N. Maple Dr., Suite 300, Beverly Hills, CA 90210. For all requests, you must put the statement \"Your California Privacy Rights\" in the body of your request, as well as your name, street address, city, state, and zip code. In the body of your request, please provide enough information for us to determine if this applies to you. You need to attest to the fact that you are a California resident and provide a current California address for our response. Please note that we will not accept requests via the telephone, email, or by facsimile, and we are not responsible for notices that are not labeled or sent properly, or that do not have complete information.\n\n6. YOUR CHOICES\nCookies and Similar Technologies\n\nWe and our service providers, advertisers, and other third parties use cookies and similar technologies (e.g., HTTP cookies, HTML 5, flash local storage cookies, web beacons, GIFs, embedded scripts, ETags/cache browsers, and software development kits) to recognize you on, off, and across the Services and your devices. For more information about the use of cookies and similar technologies on the Services (including your opt-out choices) please see our Cookies Notice.\n\nMobile App and Connected Devices\n\nDepending on the device you use, you may be able to manage your advertising and location preferences through your device settings and as outlined in our Cookies Notice. Many operating systems provide their own instructions on how to prevent the delivery of tailored in-application advertisements. We do not control how the applicable platform operator allows you to manage personalized in-application advertisements. You should review your device manufacturers support materials and/or the device settings for the respective operating systems for more detail on how to manage such preferences.\n\nYou may opt out of location data collection on our mobile app(s) by managing your location preferences in the \"My Account\" section of that app, or by disabling the GPS services for that app on your mobile device. Contact privacy@fandango.com for information about how to opt out from allowing us to have further access to your precise location data. Please include as much detail as possible when you make a request.\n\nYou can stop all collection of information by a mobile app by uninstalling the app.\n\nThird-Party Online Services\n\nThe Services may contain links to third party services. These other sites (even if co-branded as Fandango) may collect information about you and use this information in accordance with their own privacy policies and terms of service. We do not control those third parties policies or practices. Where Fandango collects personal information on a co-branded website or service, we will provide a link to our privacy policy as appropriate. In some circumstances, we may host some websites on behalf of others and those entities may place or permit the placement of cookies and other tracking technology. We are not responsible for these tracking practices.\n\nGoogle Maps\n\nIf you use Google Maps / Google Earth as part of the Services, you agree to comply with the Google Maps / Google Earth Additional Terms of Service (including the Google Privacy Policy). Further, you agree that Google, and not Fandango, shall be responsible for any of your information Google receives as a result of your use of Google Maps / Google Earth.\n\n7. HOW WE PROTECT YOUR INFORMATION\n\nWe maintain organizational, technical, and physical safeguards to help protect the information we collect and use. These safeguards vary depending upon a variety of factors including the sensitivity of the information we collect and use. Despite all reasonable practices, no security method is infallible.\n\n8. INTERNATIONAL TRANSFERS\n\nFandango is a global company and has its headquarters in the United States. We may transfer your information to those described in this Privacy Policy outside of your country of residence, including in the United States and other countries. This is necessary to provide the Services and for the purposes outlined in this Privacy Policy. Data privacy laws vary from country to country and they may not be equivalent to, or as protective as, the laws in your home country. We take steps to ensure that reasonable safeguards are in place with an aim to ensure an appropriate level of protection for your information, in accordance with applicable law. By providing us with your information, you acknowledge any such transfer, storage or use.\n\n9. UPDATES TO OUR PRIVACY POLICY\n\nWe reserve the right to amend this Privacy Policy at any time to reflect changes to our practices or the law. We will make the revised Privacy Policy accessible through the Services. Please check the Services periodically for updates.\n\nThe date at the top of this Privacy Policy tells you when it was last updated. If we make material changes to the way we collect or use your information, you will be provided with appropriate notice, including, but not limited to, by posting the updated Privacy Policy on this website, and providing notice in accordance with legal requirements. Any changes to this Privacy Policy will become effective when the revised Privacy Policy is posted. By continuing to use the Services following any changes to this Privacy Policy, you acknowledge you have read and understand the updated Privacy Policy, and you understand that we will collect, use, and share information as stated therein.\n\n10. CONTACT US\n\nFor any questions in relation to this Privacy Policy please contact us at privacy@fandango.com or Fandango, ATTN: Legal Department, 407 N. Maple Dr., Suite 300, Beverly Hills, CA 90210.\n\nWe have separate policies for workforce data, which is governed by the policies of our parent company, NBCUniversal. For example, please see the Candidate Privacy Statement to find out more about the information collected during our recruitment process.\n\nREFUNDS & EXCHANGES HELP FEEDBACK MY FANDANGO LIVE CHAT\nAbout Fandango Careers Advertising Link to Us Affiliate Program Fandango Rewards Site Index Your Privacy Rights - Privacy Policy Terms and Policies AdChoices Do Not Sell My Info\nFandango Affiliated Companies: FandangoNOW Movieclips Movies.com Flixster.com MovieTickets.com Fandango Latin America Ingresso\n 2020 Fandango\nClose\nWelcome Back to MovieTheaters\n\nFandango helps you go back to the movies with confidence and peace of mind.\n\nFind Open Theaters Near You\nCheck Theater Safety Policies\nContactless TicketPurchase\nContactless TicketEntry\nWorry-free Refunds & Exchanges\nSEE OPEN THEATERS NEAR YOU\nGOT IT", "Developer Terms of Service": "GOING BACK TO MOVIE THEATERS READ MORE\nGift Cards | Offers | Sign In\nFandango\nScreen Reader Users: To optimize your experience with your screen reading software, please use our Flixster.com website, which has the same tickets as our Fandango.com and MovieTickets.com websites.\n \nSkip to Main Content\n GO\nMOVIES\nNOW PLAYING\nSEE ALL NOW PLAYING\nOPENING THIS WEEK  = Limited Release\nBill & Ted Face the Music\nThe New Mutants\n The Personal History of David Copperfield\n The Eight Hundred (2020)\n Nomad: In The Footsteps of Bruce Chatwin\n Still Here (2020)\nSEE ALL OPENING THIS WEEK\nCOMING SOON\nTenet\nThe King's Man\nGreenland (2020)\nHonest Thief (2020)\nWonder Woman 1984\nCandyman (2020)\nThe War with Grandpa\nDeath on the Nile (2020)\nSEE ALL COMING SOON\nEXPLORE MORE\nWATCH TRAILERS ON MOVIECLIPS\nTOP BOX OFFICE\nNEW FOR STREAMING\n \nTHEATERS + TICKETS\nWHERE ARE YOU LOCATED? HERE ARE OUR TOP CITIES\nNew York, NY\nLos Angeles, CA\nAtlanta, GA\nChicago, IL\nAustin, TX\nMiami, FL\nSan Francisco, CA\nPhoenix, AZ\nWashington, DC\nBoston, MA\nSan Diego, CA\nSeattle, WA\nEdison, NJ\nHouston, TX\nTampa, FL\nFIND THEATERS + MOVIE TIMES NEAR\n FIND MOVIE TIMES + TICKETS\n \nMOVIE NEWS\nFEATURED MOVIE NEWS\nCheck Out This Behind the Scenes Look at 'Bad Boys For Life'\nREAD MORE\nWhat to Watch on FandangoNOW: The Secret: Dare to Dream, The Secret Garden, She Dies Tomorrow and More\nREAD MORE\nThe Week in Movie News: Spider-Man Spin-Offs for Olivia Wilde and J.C. Chandor, Ben Afflecks Batman Returns for The Flash and More\nREAD MORE\nEXPLORE CONTENT\nMOVIE REVIEWS\nSTAR WARS GUIDE\nAWARDS WATCH\nINDIE MOVIE GUIDE\nFAMILY GUIDE\nHOUSE OF SCREAMS\nWEEKEND TICKET\n \nJOIN FANDANGOVIP\nBUY MOVIES. GET MOVIES.\n\nEarn 125 points on every ticket you buy. Rack up 500 points and you'll score a $5 reward for more movies.\n\nLEARN MORE\nINSIDER PERKS\n\nGet your swag on with discounted movies to stream at home, exclusive movie gear, access to advanced screenings and discounts galore.\n\nLEARN MORE\nPARTNER REWARDS\n\nCollect bonus rewards from our many partners, including AMC, Stubs, Cinemark Connections, Regal Crown Club when you link accounts.\n\nLEARN MORE\nREFUNDS + EXCHANGES\n\nWe know life happens, so if something comes up, you can return or exchange your tickets up until the posted showtime.\n\nLEARN MORE\nJOIN FANDANGO VIP FOR FREE\n\n(It only takes a few seconds to join)\n\nAlready a Fandango VIP? SIGN IN\nTERMS OF USE\nPrivacy Policy\nTerms and Policies\nTerms of Use\nTicket Policy\nPromo Code Policy\nGift Card Terms\nCookies and Tracking\nFandangoNOW and Vudu Policy\nVIP+ Program Terms\n\nThese Terms of Use (these Terms) were last updated on: July 1, 2020. When we say our, us, we or Fandango in these Terms, we mean Fandango Media, LLC or its subsidiaries. When we say Services or Site in these Terms, we mean websites operating under the Fandango, FandangoNOW, Vudu, Rotten Tomatoes, Flixster, Movieclips, Movies.com, Activaterewards.com, MovieTickets.com or M-GO brands or other brands that we own, as well as those of our websites, applications, emails and other communications that link to or reference these Terms or other Terms and Policies, or the other services provided through any of these means. These Terms are subject to, and shall also include, the other Terms and Policies.\n\nNOTICE OF ARBITRATION PROVISIONS:\n\nYour use of the Services is subject to binding individual arbitration of any disputes which may arise, as provided below and in our Terms and Policies. Please read the arbitration provisions carefully and do not use the Services if you are unwilling to arbitrate any disputes you may have with us as provided below.\n\n1. ACCEPTANCE OF TERMS\n\nThese Terms of Use set forth the terms and conditions that apply to your use of the Services. By using the Services, you agree that you have read, understand and agree to be legally bound by these Terms.\n\nIf you do not agree to these Terms, please do not use the Services.\n\nFandango may, subject to the below, change these Terms from time to time on a prospective basis, and modify, add or discontinue any aspect, content or feature of the Services, at its sole discretion. Your continued use or accessing of the Services following the posting of any changes to the Terms constitutes your acceptance of such changes. To the extent that an arbitrator or court of applicable jurisdiction determines that applying any changes to these Terms would render this an illusory or unenforceable contract, such changes shall be applicable on a prospective basis only, with respect to events or circumstances occurring after the date of such changes, to the extent necessary to avoid these Terms being deemed illusory or unenforceable.\n\nAny form of transfer or sublicense, or unauthorized access, distribution, reproduction, copying, retransmission, publication, sale, or exploitation (commercial or otherwise), of any portion of the Services, including but not limited to all content, services, digital products, tools or products, is hereby expressly prohibited.\n\n2. PERMITTED USE\n\nOur Site and Services are for your personal and non-commercial use. They contain material that is derived in whole or in part from material supplied and owned by Fandango and other sources. Such material is protected by copyright, trademark and other applicable laws. Unless otherwise agreed to in writing by Fandango, you agree that you will not use the Services, or duplicate, download, publish, modify or otherwise distribute or use any material in the Services for any purpose, except for your personal, non-commercial use. You also agree that you will not link to any page on the Site other than the home page (for example, \"deep linking\"), without Fandango's prior written consent. Use of the Services or any materials or content on the Services for any commercial or other unauthorized purpose is prohibited. You acknowledge that storing, distributing or transmitting unlawful material could expose you to criminal and/or civil liability. You may not download (other than page caching) or modify the Services or any portion of them unless we have provided you with express written consent. You shall not make a derivative use of the Services (or any part thereof) for any purpose, nor shall you download or copy information of users, or otherwise engage in data mining or similar data gathering.\n\n3. REGISTRATION, ACCOUNTS AND PASSWORDS\n\nIf you establish a personal account with us, you agree to provide true and accurate data about yourself on our account registration form, and to update and keep such data current. You will receive a password and account upon completing the registration form. You are solely responsible for maintaining the confidentiality of your password and account, and you are solely responsible for all use of your password or account, whether authorized by you or not. You shall not allow other persons access to or use of such username or password. You shall not post your username or password on any website nor transmit it through unsecured sites. You agree to (a) immediately notify Fandango of any unauthorized use of your password or account or any other breach of security and (b) ensure that you exit from your account each time you use the Services. Access and use of password-protected and/or secure areas of the Services is restricted to users who have been given a valid password by Fandango. We may terminate your membership and access to the Services if we learn that you have provided us with false or misleading registration data. If we feel your username and password are insecure or otherwise problematic, we may require you to change it or terminate your account.\n\n4. MOBILE TERMS\n\nThe following additional terms are applicable to our mobile apps:\n\nFANTEXTS AND OTHER SMS MESSAGES\n\nIf you are a member of FanTexts, you may receive FanTexts and other promotional texts to your mobile phone using automated technology. You can unsubscribe at any time by texting 'STOP' to 36346 (FNDGO). If you have any questions, reply HELP to any of our messages, text HELP to 36346 (FNDGO) or Contact Us.\n\nYou can either request individual text messages (such as showtimes for a particular movie) or sign up for FanTexts (movie alerts and special Fandango promotions on a recurring basis) either on our website or on your mobile device. By subscribing to FanTexts, you consent to receiving, from time to time, text messages from Fandango, which may include movie alerts, promotions, polls, and giveaways. Message frequency varies based on user and other factors. Message and data rates may apply and, if so, are billed by and payable to your mobile service provider. We will not be liable for any delays in the receipt of any SMS messages as delivery is subject to effective transmission from your network operator. Data obtained from you in connection with this SMS service may include your mobile phone number, your carrier's name and the date, time and content of your messages. We may use this information to contact you and to provide the services you request from us and for other business purposes.\n\nFANDANGO MOBILE TICKETS\n\nRather than bringing a Print-at-Home Bar-Coded Ticket or confirmation number to the theater, some of Fandango's exhibitor partners give you the option of having your ticket delivered to your mobile device as a picture message (a \"Mobile Ticket\"). The Mobile Ticket contains a unique barcode and some accompanying text with details of the movie you are going to see. If you have questions about the purchase or use of the Mobile Ticket, please see the Fandango Mobile Ticket Delivery FAQ. Please note that Mobile Tickets are not available for MovieTickets.com mobile applications.\n\nYour purchase of a Mobile Ticket will be deemed your agreement to the following terms:\n\nMessage and data rates may apply and, if so, are billed by and payable to your mobile service provider.\nThe Mobile Ticket is in the form of a unique barcode sent as a text message to your mobile device or delivered on the confirmation page from the Fandango Movies - Times & Tickets Mobile App. The barcode and any accompanying text sent to you by Fandango is the entire ticket, and not the barcode in isolation from the accompanying text. Accompanying text includes any text stating the originating source of the barcode. Any barcode with non-original text is invalid.\nThe Mobile Ticket barcode cannot be forwarded to anyone else. Doing so invalidates your Mobile Ticket without the right to a refund.\nIf you purchase multiple tickets in a single order, your Mobile Ticket holds all of those tickets, and all of your guests must arrive at the same time to gain entry using your Mobile Ticket.\nFandango is not responsible for lost or stolen Mobile Tickets, except as required by law. Anyone attempting to gain entry with a Mobile Ticket reported lost or stolen, or cancelled for any other reason, may be reported to the authorities and may have their mobile device withheld as evidence.\nFandango shall have the right to void any Mobile Tickets that violate these policies.\n\nGOOGLE MAPS\n\nIf you use Google Maps / Google Earth as part of the Services, you agree to comply with the Google Maps / Google Earth Additional Terms of Service (including the Google Privacy Policy). Further, you agree that Google, and not Fandango, shall be responsible for any of your information Google receives as a result of your use of Google Maps / Google Earth.\n\n5. PRIVACY POLICY\n\nYour use of the Services and any information provided by you or gathered by Fandango or third parties during any visit to or use of the Services is governed by the Privacy Policy which is incorporated by this reference. You agree to Fandango's collection, use and sharing of your information as set forth in the Privacy Policy.\n\n6. USER CONDUCT AND SUBMISSIONS\n\nYou are responsible for your use of the Services and the Site, and for any consequences thereof, including any information or materials you choose to make available, public or private communications transmitted through the Services or the Site (including posts), usernames and passwords that you provide to the Services or the Site, including those usernames and passwords provided by you for access to various third party services ( e.g., social networking and other accounts that you wish to link with your account on the Site).\n\nIt is a condition of your use of the Services that you do not:\n\nInterfere with any other user from using and enjoying the Services;\nCollect information about other users or third parties via the Services or use any such information for the purpose of transmitting or facilitating transmission of unauthorized or unsolicited advertising, junk or bulk e-mail, chain letters, or any other form of unauthorized solicitation;\nEngage in the systematic retrieval of data or other content from the Services to create or compile, directly or indirectly, a collection, compilation, database or directory, without Fandango's prior written consent;\nSolicit other users to join, become members of, or contribute money to any online service or other organization, advocate or attempt to get users to join in illegal schemes or plan or participate in scams involving other users;\nAttempt to gain unauthorized access to other computer systems or networks connected to the Services; or\nTake actions for the purpose of manipulating or distorting, or that may undermine the integrity and accuracy of, any ratings or reviews of any service or product that may be presented by the Services.\nProvide fictitious information or conceal your identity or location, including, but not limited to, in an attempt to circumvent limits associated with promotional or other offers.\nUse the Services for unlawful purposes.\nUse the Services to commit an act of deception, fraud or abuse or violation of Fandangos or any other companys terms.\n\nAdditionally, you agree that you will not use the Services to upload, post, or otherwise distribute or facilitate distribution of any material that:\n\nIs libelous, defamatory or slanderous;\nIs sexually suggestive or contains explicit sexual content (including nudity);\nDoes or may denigrate or offend any individual or group on the basis of religion, gender, sexual orientation, race, ethnicity, age, or disability;\nDoes or may threaten, abuse, harass, or invade the privacy of any third party;\nIs fraudulent or infringes the rights of any third party, including, without limitation, patent, trademark, trade secret, copyright, right of publicity, or other proprietary rights;\nConstitutes unauthorized or unsolicited advertising, junk or bulk e-mail (also known as \"spam\"), chain letters, any other form of unauthorized solicitation, or any form of lottery or gambling;\nContains a software virus or any other computer code that is designed or intended to disrupt, damage, or limit the functioning of any software, hardware, or telecommunications equipment, or to damage or obtain unauthorized access to any data or other information of any third party;\nEncourages conduct that would constitute a criminal offense or give rise to civil liability;\nImpersonates any person or entity, including any employee or representative of Fandango; or\nViolates any applicable law or these Terms.\n\nCertain areas on the Services may allow you to provide us or others with photos and other images, commentaries, reviews, audio and video, \"Feedback\" (defined as suggestions, comments or other feedback you provide to us), posts, public or private messages or other content from you (\"User Materials\"). You alone are responsible for your User Materials, and once published, it cannot always be withdrawn. You assume all risks associated with your User Materials, including anyone's reliance on its quality, accuracy, or reliability, or any disclosure by you of information in your User Materials that makes you personally identifiable. You represent that you own, or have the necessary permissions to use and authorize the use of your User Materials as described herein. You may not imply that your User Materials is in any way sponsored or endorsed by Fandango.\n\nYou may expose yourself to liability if, for example, your User Materials contain material that is false, intentionally misleading, or defamatory; violates any third-party right, including any copyright, trademark, patent, trade secret, moral right, privacy right, right of publicity, or any other intellectual property or proprietary right; contains material that is unlawful, including illegal hate speech or pornography; exploits or otherwise harms minors; or violates or advocates the violation of any law or regulation. All User Materials must comply with these Terms. Specific additional rules or terms may apply to the submission of User Materials. In any event, any User Materials you send to us will not be treated as confidential.\n\n7. MONITORING\n\nFandango may, but has no obligation to, monitor the use of the Services by members. During monitoring, information may be examined, recorded, copied, and used for authorized purposes in accordance with the Privacy Policy. Furthermore, Fandango reserves the right at all times to disclose any information posted on any portion of the Services as necessary to satisfy any law, regulation or governmental request, or to refuse to post, or to remove, any information or materials, in whole or in part, that in Fandango's sole and absolute discretion are objectionable or in violation of these Terms.\n\n8. GRANT OF LIMITED LICENSE\n\nFandango may use User Materials in a number of different ways, including publicly displaying it, reformatting it, incorporating it into advertisements and other works, creating derivative works from it, promoting it, distributing it, and allowing others to do the same in connection with their own websites and media platforms (\"Other Media\"). As such, you hereby irrevocably grant Fandango and its affiliates and licensees a world-wide, perpetual, non-exclusive, royalty-free, assignable, sublicensable, transferable rights to use, including, but not limited to the right to copy, publicly perform and display, reproduce, distribute, modify, translate, remove, analyze, commercialize, and prepare derivative works of, any User Materials for any purpose. Please note that you also irrevocably grant the users of the Services and any Other Media the right to access User Materials in connection with their use of the Services and any Other Media. Finally, you irrevocably waive, and cause to be waived, against Fandango and its users any claims and assertions of moral rights or attribution with respect to your User Materials. You represent and warrant that you own such content or otherwise have sufficient rights in the content to grant to Fandango the foregoing license without infringing or violating the rights of any third party. You acknowledge that we are under no obligation to pay you or anyone else for any use or disclosure of User Materials. You hereby confirm: (a) your User Materials will be not be subject to any obligation, of confidence or otherwise, to you or any other person; (b) your posting of the content on or through the Services does not violate the privacy rights, publicity rights, copyrights or other rights of any other person; and (c) your posting is in accordance with these Terms and that we shall not be liable for any use or disclosure of such User Materials. We reserve the right (but do not assume the obligation) in our sole discretion to reject, move, edit or remove any User Materials that are contributed to the Services or Site. You acknowledge that we do not verify, adopt, ratify, or sanction User Materials, and you agree that you must evaluate and bear all risks associated with our use of User Materials or our reliance on the accuracy, completeness, or usefulness of User Materials.\n\n9. COPYRIGHTS\n\nFandango respects the intellectual property of others, and we ask our users to do the same. The Digital Millennium Copyright Act of 1998 (the \"Act\") provides recourse for copyright owners who believe that material appearing on the Internet infringes their rights under U.S. copyright law. Fandango, pursuant to the Act, reserves the right, but not the obligation, to terminate your license to use the Services if it determines in its sole and absolute discretion that you are involved in infringing activity, including alleged acts of first-time or repeat infringement, regardless of whether the material or activity is ultimately determined to be infringing. Therefore, in compliance with the Act, if you believe that any such third party materials infringe your intellectual property rights, please send a notice to the agent identified below to request a review of the alleged infringement. The notice must include the following information (a) a physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; (b) identification of the copyrighted work claimed to have been infringed (or if multiple copyrighted works located on the Services are covered by a single notification, a representative list of such works); (c) identification of the material that is claimed to be infringing or the subject of infringing activity, and information reasonably sufficient to allow Fandango to locate the material on the Services; (d) the name, address, telephone number and email address (if available) of the complaining party; (e) a statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent or the law; and (f) a statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. If you believe in good faith that a notice of copyright infringement has been wrongly filed against you, the DMCA permits you to send Fandango a counter-notice. Notices and counter-notices must meet the then-current statutory requirements imposed by the DMCA; see http://www.loc.gov/copyright for details. Notices and counter-notices with respect to the Services should be sent to:\n\nDMCA Agent\nNBCUniversal Law Department\n30 Rockefeller Plaza, Rm. 1087E\nNew York, New York 10112\n(212) 664-4444\nby email: dmca.agent@nbcuni.com\n\nFandango suggests that you consult your legal advisor before filing a notice or counter-notice. Also, please be aware that there can be penalties for false claims under the DMCA.\n\n10. PROPRIETARY RIGHTS\n\nFandango owns all right, title and interest in and to the Services and all materials and content contained in the Services, including, without limitation, all content, site design, logos, button icons, images, digital downloads, data compilations, text, and graphics are protected by copyright, trademark and other intellectual property laws. Any unauthorized use of such materials or content is strictly prohibited.\n\nPermission is granted to individual consumers to electronically copy and to print hard copy portions of the Services solely for personal use. Any other use of materials on the Services, including reproduction for purposes other than those noted above, modification, distribution, or republication, any form of data extraction or data mining, or other commercial exploitation of any kind, without prior written permission of an authorized officer of Fandango is strictly prohibited. You agree that you will not use any robot, spider, other automatic device, or manual process to monitor or copy our Web pages or the content contained therein without prior written permission of an authorized officer of Fandango.\n\nFandango's service marks/trademarks may not be used in connection with any product or service that is not provided or authorized by Fandango, in any manner that is likely to cause confusion among customers, or in any manner that disparages or discredits Fandango.\n\n11. CHILDREN'S ONLINE PRIVACY PROTECTION ACT NOTIFICATION\n\nThe Services and the Site is not designed or intended for use by children under 13, and thus all users must be at least 13. If you are under 18, you should use Fandango only with involvement and permission of a parent or guardian. Some of our Services or portions of the Site, including Movies Anywhere-enabled features, may require you to be over the age of 18 or the age of majority for your state; please see the terms and conditions of the relevant offer for more details.\n\nPursuant to 47 U.S.C. Section 230(d) as amended, Fandango hereby notifies you that parental control protections (such as computer hardware, software, or filtering services) are commercially available that may assist you in limiting access to material that is harmful to minors. Information identifying current providers of such protections is available at the Electronic Frontier Foundation Web site, http://www.eff.org. To view information on our policy regarding the privacy of children under the age of 13, please see our Privacy Policy.\n\n12. DISCLAIMER OF WARRANTIES\n\nWhile Fandango uses reasonable efforts to include up to date information on the Site and other Services, Fandango makes no warranties or representations as to its accuracy, timeliness, reliability, completeness or otherwise.\n\nFANDANGO PROVIDES THE SITE AND OTHER SERVICE ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS. FANDANGO, ITS AFFILIATES, AGENTS AND LICENSORS (COLLECTIVELY, THE \"FANDANGO PARTIES\") DISCLAIM ALL WARRANTIES AND CONDITIONS, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. WITHOUT LIMITING THE FOREGOING, FANDANGO DOES NOT WARRANT THAT THE SITE OR OTHER SERVICE WILL (1) BE UNINTERRUPTED; (2) BE FREE FROM INACCURACIES, ERRORS, VIRUSES OR OTHER HARMFUL COMPONENTS; (3) MEET YOUR REQUIREMENTS; OR (4) OPERATE IN THE CONFIGURATION OR WITH THE HARDWARE OR SOFTWARE YOU USE. YOUR USE OF THE SITE AND SERVICE IS SOLELY AT YOUR RISK.\n\n13. EXCLUSION OF DAMAGES\n\nNONE OF THE FANDANGO PARTIES WILL BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES RELATING TO LOST PROFITS, LOST DATA OR LOSS OF GOODWILL) OR ANY DAMAGES WHATSOEVER THAT RESULT FROM YOUR USE OF OR INABILITY TO USE THE SITE OR OTHER SERVICE. THIS LIMITATION APPLIES WHETHER THE ALLEGED LIABILITY IS BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR ANY OTHER LEGAL THEORY, AND EVEN IF FANDANGO HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THIS WAIVER APPLIES, WITHOUT LIMITATION, TO ANY DAMAGES OR INJURY ARISING FROM ANY FAILURE OF PERFORMANCE, ERROR, OMISSION, INTERRUPTION, DELETION, DEFECT, DELAY IN OPERATION OR TRANSMISSION, COMPUTER VIRUS, FILE CORRUPTION, COMMUNICATION-LINE FAILURE, NETWORK OR SYSTEM OUTAGE, OR THEFT, DESTRUCTION, UNAUTHORIZED ACCESS TO, ALTERATION OF, OR USE OF ANY RECORD. YOU SPECIFICALLY ACKNOWLEDGE AND AGREE THAT EACH OF THE FANDANGO PARTIES SHALL NOT BE LIABLE FOR ANY DEFAMATORY, OFFENSIVE OR ILLEGAL CONDUCT OF ANY USER OF THE SITE OR OTHER SERVICE. WITHOUT LIMITING THE FOREGOING, FANDANGO WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE ARISING OUT OF (1) YOUR FAILURE TO COMPLY WITH PARAGRAPH 3 (REGISTRATION, ACCOUNTS AND PASSWORDS) OR (2) CONTENT POSTED TO THE SITE OR OTHER SERVICE BY YOU OR ANY THIRD PARTY.\n\n14. LIMITATION OF LIABILITY\n\nIN NO EVENT WILL THE FANDANGO PARTIES' AGGREGATE LIABILITY TO YOU IN CONNECTION WITH THE SITE AND SERVICE OR THESE TERMS EXCEED THE AMOUNT (IF ANY) PAID BY YOU TO FANDANGO IN THE SIX MONTHS IMMEDIATELY PRECEDING THE EVENT WHICH GAVE RISE TO THE LIABILITY. FANDANGO SHALL NOT BE RESPONSIBLE FOR, OR HAVE ANY LIABILITY FOR, ANY ACTIONS, OMISSIONS, OCCURRENCES, INJURIES OR DAMAGES THAT OCCUR ON OR NEAR ANY THEATER OR OTHER LOCATION, OR IN CONNECTION WITH ANY SERVICE OR PRODUCT, TICKETED OR MADE AVAILABLE THROUGH FANDANGOS SERVICES OR SITES; YOU WILL LOOK SOLELY TO THE OPERATORS AND PROVIDERS OF SUCH THEATERS, LOCATIONS, SERVICES AND PRODUCTS WITH RESPECT TO ANY SUCH LIABILITY (IF ANY).\n\n15. APPLICABILITY OF DISCLAIMERS, EXCLUSIONS AND LIMITS\n\nBECAUSE SOME JURISDICTIONS DO NOT ALLOW FOR THE EXCLUSION OF DAMAGES, FANDANGO'S LIABILITY IN SUCH JURISDICTIONS SHALL BE LIMITED TO THE GREATEST EXTENT PERMITTED BY THE LAW OF SUCH JURISDICTION. IN ADDITION, BECAUSE SOME JURISDICTIONS DO NOT PERMIT THE DISCLAIMER OF CERTAIN WARRANTIES, THE DISCLAIMERS SET FORTH ABOVE MAY NOT APPLY TO YOU.\n\n16. THIRD PARTY WEB SITES AND FUNCTIONALITIES\n\nTHE THIRD-PARTY WEB SITES OR SERVICES LINKED TO OR FROM THE SERVICES ARE NOT CONTROLLED BY FANDANGO. ADDITIONALLY, THIRD PARTIES MAY PROVIDE TOOLS OR SERVICES (\"THIRD PARTY TOOLS\") THAT ARE MADE AVAILABLE TO YOU THROUGH OUR SERVICES (FOR EXAMPLE, BUT NOT LIMITED TO, FACEBOOK FEATURES). ACCORDINGLY, FANDANGO MAKES NO WARRANTIES OR CONDITIONS REGARDING SUCH THIRD-PARTY SERVICES OR WEB SITES OR THIRD PARTY TOOLS AND WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY YOUR USE OF OR RELIANCE ON SUCH THIRD SERVICES OR WEB SITES OR THIRD PARTY TOOLS. YOUR USE OF THIRD-PARTY SERVICES OR WEB SITES OR THIRD PARTY TOOLS IS AT YOUR OWN RISK. THE INCLUSION ON THE SERVICE OF A LINK TO A THIRD-PARTY SERVICE OR WEB SITE, OR INCLUSION OF A THIRD PARTY TOOL, DOES NOT IMPLY AN ENDORSEMENT BY FANDANGO. WHEN YOU ACCESS ANY OF THESE THIRD-PARTY SERVICES OR SITES, OR THIRD PARTY TOOLS, YOUR RIGHTS AND OBLIGATIONS WILL BE GOVERNED BY THE AGREEMENTS AND POLICIES RELATING TO THE USE OF THOSE THIRD PARTY WEB SITES OR SERVICES OR THIRD PARTY TOOLS.\n\n17. INDEMNIFICATION\n\nYou will indemnify and hold harmless the Fandango Parties, and at Fandango's option defend the Fandango Parties, from and against any damage, loss, cost or expense (including without limitation, legal fees and costs) incurred in connection with any third-party claim, demand, proceeding or action (\"Claim\") brought against any of the Fandango Parties arising out of your use of the Services or any alleged breach by you of any provision of these Terms, or the infringement by you, or any other subscriber or user of your account, of any intellectual property or other right of any person or entity. If you are obligated to indemnify any of the Fandango Parties, Fandango may, in its sole and absolute discretion, control the defense and disposition (including its possible settlement) of any Claim at your sole cost and expense. Without limitation of the foregoing, you will not settle, compromise or in any other manner dispose of any Claim without the written consent of Fandango.\n\n18. TERMINATION\n\nIn its sole and absolute discretion, with or without notice to you, Fandango may suspend or terminate your use of and access to the Services, terminate your account and/or remove and discard anything transmitted by you, or information stored, sent, or received via the Services without prior notice and for any reason, including, but not limited to: (i) concurrent access of the Services with identical user identification, (ii) permitting another person or entity to use your user identification to access the Services, (iii) any unauthorized access or use of the Services, (iv) any violation of these Terms, (v) tampering with or alteration of any of the software and/or data files contained in, or accessed through, the Services, (vi) failure to use the Services on a regular basis, or (vii) abuse, deception or fraudulent behavior. Such suspension or termination may include, but not be limited to, suspension or termination of access or rights to receive any content. You may terminate your account for any reason by emailing Fandango at unsubscribe@fandango.com. Fandango shall not be liable to you or any third party for any claims or damages arising out of any termination or suspension of the Services. Termination, suspension, or cancellation of the Services or your access rights shall not affect any right or relief to which Fandango may be entitled, at law or in equity, and all rights granted to you will automatically terminate and immediately revert to Fandango.\n\n19. GENERAL\n\nThese Terms and the relationship between you and Fandango shall be governed by the laws of the United States and the State of New York without regard to its conflict of law provisions. Subject to the arbitration provisions above, and other than small claims actions as permitted therein, any action or proceeding arising from, relating to or in connection with these Terms will be brought exclusively in the federal or state courts located in New York, New York, and you irrevocably consent to the personal jurisdiction of such courts and agree that it is a convenient forum and that you will not seek to transfer such action or proceeding to any other forum or jurisdiction, under the doctrine of forum nonconveniens or otherwise. Licensors of the Fandango Services are third party beneficiaries to these Terms. No failure or delay by Fandango in exercising any right, power or privilege under these Terms will operate as a waiver thereof, nor will any single or partial exercise of any right, power or privilege preclude any other or further exercise thereof or the exercise of any other right, power, or privilege under these Terms. Unless otherwise expressly provided herein, the invalidity or unenforceability of any provision of these Terms will not affect the validity or enforceability of any other provision, all of which will remain in full force and effect. You agree that regardless of any statute or law which establishes a different statute of limitations, to the maximum extent permitted under applicable law, any claim or cause of action (including any arbitration) arising out of, related to or connected with the use of the Services, or these Terms, our Privacy Policy, our Terms and Policies, or other Fandango Transactions or Relationships must be filed within one (1) year after such claim or cause of action arose or be forever barred. The paragraph or section titles in these Terms are for convenience only and have no legal or contractual effect. These Terms represent the entire understanding of the parties regarding its subject matter, and supersede all prior and contemporaneous agreements and understandings between the parties regarding its subject matter, and may not be amended, altered or waived except in writing by the party to be charged. These Terms are binding upon and shall ensure to the benefit of parties and their respective successors, heirs, executor, administrators, personal representatives and permitted assigns. You shall not assign your rights or obligations hereunder without Fandango's prior written consent.\n\n20. ARBITRATION\n\nBINDING ARBITRATION OF ALL DISPUTES\n\nWe believe that arbitration is a faster, more convenient and less expensive way to resolve any disputes or disagreements that you may have with us. Therefore, pursuant to these Terms, if you have any dispute or disagreement with us regarding or relating to (i) your use of or interaction with the Services, (ii) any purchases or other transactions or relationships with Fandango, or (iii) any data or information you may provide to Fandango or that Fandango may gather in connection with such use, interaction or transaction(collectively, \"Fandango Transactions or Relationships\"), you will not have the right to pursue a claim in court, or have a jury decide the claim and you will not have the right to bring or participate in any class action or similar proceeding in court or in arbitration. By using or interacting with the Services, or engaging in any other Fandango Transactions or Relationships with us, you agree to binding arbitration as provided below. Our rights and obligations under this arbitration provision shall inure to the benefit of each of Fandango's Owners (as defined in the Privacy Policy regardless of whether any of them are named as aco-defendant with us or named individually in a claim that would otherwise be subject to this arbitration provision if brought against us.\n\nWe will make every reasonable effort to informally resolve any complaints, disputes, or disagreements that you may have with us. If those efforts fail, by using our Services, you agree that any complaint, dispute, or disagreement you may have against Fandango, and any claim that Fandango may have against you, arising out of, relating to, or connected in any way with our Terms of Use, our Privacy Policy, our Terms andPolicies, or any Fandango Transactions or Relationships shall be resolved exclusively by final and binding arbitration (\"Arbitration\") administered by JAMS or its successor (\"JAMS\") and conducted in accordance with the JAMS Streamlined Arbitration Rules And Procedures in effect at the time the Arbitration is initiated or, if the amount in controversy exceeds $100,000, in accordance with the JAMS Comprehensive Arbitration Rules And Procedures then in effect (respectively, the \"Applicable Rules\"). The Applicable Rules can be found at www.jamsadr.com. If JAMS is no longer in existence, the Arbitration shall be administered by the American Arbitration Association or its successor (the \"AAA\") instead, and conducted in accordance with the AAA Commercial Arbitration Rules in effect at that time (which shall be the \"Applicable Rules\" in such circumstances). If JAMS (or, if applicable, AAA) at the time the arbitration is filed has Minimum Standards of Procedural Fairness for Consumer Arbitrations in effect which would be applicable to the matter in dispute, Fandango agrees to provide the benefit of such Minimum Standards to you to the extent they are more favorable than the comparable arbitration provisions set forth herein, provided, however, that in no event may such Minimum Standards contravene or restrict the application of subpart (e) or (i) below. Furthermore, nothing herein shall prevent any party from seeking provisional remedies in aid of arbitration from a court of appropriate jurisdiction. You further agree that:\n\nthe Arbitration shall be conducted before a single arbitrator selected in accordance with the Applicable Rules or by mutual agreement between you and Fandango (the \"Arbitrator\");\nthe Arbitrator, and not any federal, state or local court or agency, shall have the exclusive authority to resolve any dispute arising under or relating to the validity, interpretation, applicability, enforceability or formation of these Terms and/or these arbitration provisions hereof, including but not limited to any claim that all or any part of these Terms is void or voidable;\nthe Arbitration shall be held either: (i) at a location determined by JAMS (or, if applicable, AAA) pursuant to the Applicable Rules (provided that such location is reasonably convenient for you and does not require travel in excess of 100 miles from your home or place of business); or (ii) at such other location as may be mutually agreed upon by you and Fandango; or (iii) at your election, if the only claims in the arbitration are asserted by you and are for less than $10,000 in aggregate, by telephone or by written submission.\nthe Arbitrator (i) shall apply internal laws of the State of New York consistent with the Federal Arbitration Act and applicable statutes of limitations, or, to the extent (if any) that federal law prevails, shall apply the law of the United States, irrespective of any conflict of law principles; (ii)shall entertain any motion to dismiss, motion to strike, motion for judgment on the pleadings, motion for complete or partial summary judgment, motion for summary adjudication, or any other dispositive motion consistent with New York or federal rules of procedure, as applicable; (iii) shall honor claims of privilege recognized at law; and (iv) shall have authority to award any form of legal or equitable relief;\nthe Arbitration can resolve only your and/or Fandango's individual claims, and the Arbitrator shall have no authority to entertain or arbitrate any claims on a class or representative basis, or to consolidate or join the claims of other persons or parties who may be similarly situated;\nthe Arbitrator shall issue a written award supported by a statement of decision setting forth the Arbitrator's complete determination of the dispute and the factual findings and legal conclusions relevant to it (an \"Award\"). Judgment upon the Award may be entered by any court having jurisdiction thereof or having jurisdiction over the relevant party or its assets;\nin the event that you are able to demonstrate that the costs of Arbitration will be prohibitive as compared to the costs of litigation, Fandango will pay as much of your filing and hearing fees in connection with the Arbitration as the Arbitrator deems necessary to prevent the arbitration from being cost-prohibitive, regardless of the outcome of the Arbitration, unless the Arbitrator determines that your claim(s) were frivolous or asserted in bad faith;\nin the event you recover an Award greater than Fandango's last written settlement offer, the Arbitrator shall also have the right to include in the Award Fandango's reimbursement of your reasonable and actual out-of-pocket attorneys' fees associated with the Arbitration, but Fandango shall in all events bear its own attorneys' fees; and\nwith the exception of subpart (e) above, if any part of this arbitration provision is deemed to be invalid, unenforceable or illegal, or otherwise conflicts with the Applicable Rules, then the balance of this arbitration provision shall remain in effect and shall be construed in accordance with its terms as if the invalid, unenforceable, illegal or conflicting provision were not contained herein. If, however, subpart (e)is found to be invalid, unenforceable or illegal, then the entirety of this arbitration provision shall be null and void, and neither you nor Fandango shall be entitled to arbitrate their dispute, and must instead bring any claims in a court of competent jurisdiction.\nFandango may modify these arbitration provisions, but such modifications shall only become effective thirty(30) days after Fandango has given notice of such modifications and only on a prospective basis for claims arising from Fandango Transactions and Relationships occurring after the effective date of such notification.\nNotwithstanding the foregoing arbitration provisions, at your option, you may bring any claim you have against Fandango in your local small claims court within the United States, if your claim is within such court's jurisdictional limit; provided that such court does not have the authority to entertain any claims on a class or representative basis, or to consolidate or join the claims of other persons or parties who may be similarly situated in such proceeding.\n21. NOTICE FOR CALIFORNIA USERS\n\nUnder California Civil Code Section 1789.3, California users of the Fandango Services are entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 400 R Street, Suite 1080, Sacramento, California 95814, or by telephone at (916) 445-1254 or (800) 952-5210.\n\nREFUNDS & EXCHANGES HELP FEEDBACK MY FANDANGO LIVE CHAT\nAbout Fandango Careers Advertising Link to Us Affiliate Program Fandango Rewards Site Index Your Privacy Rights - Privacy Policy Terms and Policies AdChoices Do Not Sell My Info\nFandango Affiliated Companies: FandangoNOW Movieclips Movies.com Flixster.com MovieTickets.com Fandango Latin America Ingresso\n 2020 Fandango\nClose\nWelcome Back to MovieTheaters\n\nFandango helps you go back to the movies with confidence and peace of mind.\n\nFind Open Theaters Near You\nCheck Theater Safety Policies\nContactless TicketPurchase\nContactless TicketEntry\nWorry-free Refunds & Exchanges\nSEE OPEN THEATERS NEAR YOU\nGOT IT", "Space Required": "14.4 MB"}



["5 stars\n19%\n4 stars\n6%\n3 stars\n15%\n2 stars\n11%\n1 star\n48%", "ben121099Mar 26 at 11:05 AM\nDownloaded movies\n\nIve been trying to download How To Train Your Dragon in 3D. It finished downloading once but deleted itself before I could watch it. I tried to download it again and said it failed. I would just stream it but that keeps buffering and failing as well. My internet speed is capable of streaming 4K content on other devices and services. Why am I having such a difficult time here?\n\nHelpful | 10", "DuckmanlorenMar 9 at 2:08 AM\nDisappointed\n\nProblem # 1 no instructions on how to back out or back to previous, but luckily I figured it out after closing the app 2 times. If you want to back up from watching a trailer for example. HIT THE \"B\" bottom on the controller. Problem # 2 NONE I mean NONE of the movies that I want to watch are available. This app only shows movies that are not in theaters anymore. All the movies in theaters are not able to watch??? Says not available yet, or a date shows when it will be available. The date showing means it will be out of theaters. So what is the point of this app if I can't see movies currently in theaters??? Like invisible man, or Bird's of prey. Still in theaters but not available to watch on this app. I thought this app was, so you could go to the movies at home???? Problem # 3 the screen size is a joke!!! My tv is bigger then this. I don't mind the dimming of the light and sitting in you home room on the VR but make the dang screen so you can customize the size, like Netflix does. It's not that difficult to make happen. The sound and picture quality was fine when watching trailers. This app is basically a redbox app for VR NOTHING currently at the theaters can be watched. Charge the price of a normal movie ticket so we can watch it on the VR headset, so we can watch current movies in theaters. Heck even if you left the screen size the same but was able to watch current movies in theaters, I would give this 4 stars. 5 stars if you added screen sizing options, as well as being able to move the screen up or down, the ability to lay down and watch your movie. Problem # 4 I went to the 3D movies to see a couple trailer's and none showed the trailer in 3D leaves me sceptical to rent a 3D movie and it not playing in 3D. This makes no since to not show a movie that is supposed to be 3D in 3D for the trailer. I don't think Fandango really cares because I see nothing from them on reviews or feedback on the negative reviews. For as long as this app has been on the VR platform they haven't really made any changes from what everyone is telling them, which is pretty much all the samething.\n\nHelpful | 24", "clearsongFeb 10 at 8:44 AM\nNot bad but needs improvement\n\nInexpensive 3D rentals available and they play nicely. But - there are no options for resizing the screen. It feels like a 55 inch TV that isn't too far away. The 3D content looks great but there navigation is strange like you cannot point and click the trigger to select a movie, no back button that I can figure out and I somehow rented a movie I didn't want trying to figure out how to navigate. Asked for my money back but never heard a wordl Include some navigation instructions please\n\nHelpful | 17", "vanomaniaFeb 16 at 9:33 AM\nCan't get 3D if you already own 2D\n\nWhen I tried to checkout the 3D version of a movie that I've purchased in the past, the only option I'm given is to 'Watch' the 2D HD version.\n\nHelpful | 13", "mickknowlesApr 1 at 4:44 PM\nCan't even get it started\n\nWhen I try to open the app I get a message saying I cant run the app without an avatar. Then it gives me the option to create one which I do and then when I save and close I just get the same message again. It does save the avatar but I have yet to get into the app!\n\nHelpful | 2", "PlaneOrca238287Dec 15 at 10:42 AM\nGood start, but lacking in a few places\n\n(Updated,12/15) While it is great to now have so many 3d movies available at our fingertips (update: and even cooler being able to now download them for on-the-go viewing) the viewing experience is made poor by the fact you have to watch it in the oculus tv app which has a relatively small tv screen and is set in a bright environment. (Update: Oculus Tv app has been updated to take place in the dome environment and dims when you start playing a movie. Still the screen is small and there are no darker environments, but an improvement). Please give the option to watch in a cinema or void where it can be dark and have a large picture size. Maybe it needs a separate app...\n\nHelpful | 17", "KinkabillyJan 29 at 1:39 AM\nVery Underdeveloped App\n\n* Activation was a pain in the butt.\n\n* Movie theater environment would be nice or even a \"full screen\" option instead just a small hovering screen.\n\n* There is no back button or home button to return to when you're browsing movies. I had to close and reopen the app to browse again.\n\n* I purchased a movie, had to take the headset off then return. It began the movie all over again. When I forward to the place I left off, it was playing two soundtracks at one time.\n\nEither mark this app as a \"Beta\" or work the bugs out please. I don't want to waste money on movies that are just going to go wonky.\n\nHelpful | 4", "scott.lamb3Feb 24 at 3:27 AM\nAwful\n\nViewing screen size locked in to a single size that is too small. Sound quality was bad as well I kept hearing pops and clicks. Just an awful app.\n\nHelpful | 0", "TheBaronAaronSep 25, 2019 at 5:21 PM\nLack of movie theater feel..\n\nI was super excited to see this being added to the Quest. Finally a way to rent/purchase movies in 3D!! But incredibly disappointed to find out it was built in into TV app watching 3D movies in a bright room really takes away the effect. This app needs a stand alone app like Amazon Prime. With a large theater to watch movies in. Im disappointed. Probably wont use it too much until there are changes.\n\nHelpful | 93", "imurfatherNov 15 at 6:35 PM\n\nWhy would there be no void dark mode to watch 3D movies? Cmon guys lets get this act together. I bought a bunch and f movies in 3D from the Oculus store when it was around, then I lose all my movies, will have to purchase again if I wanna watch, then theres not even a dark room experience to watch them? Same with Netflix, who is overseeing this stuff?\n\nHelpful | 8", "neuraldaggerSep 26, 2019 at 8:20 AM\nDumb\n\nI agree, utter rubbish. I was intrigued by the idea of the 3d movies for rent, and i saw a lot of films that might be cool to watch in 3d, even worth the 5 bucks to rent it. Soo, why cant i at least see the preview in 3d? Only then might i be willing to spend the money. You can only see the same trailer in a small window not 3d, in sd, epic fail, the utter stupidity of this omission is staggering, yea.. good luck with this\n\nHelpful | 62", "mike592008Nov 12 at 1:51 PM\nI know there was a good app. On rift.\n\nI'm am still down loading this app.i love to see just like at the theaters up coming movies so that if I like what I see I would go there now days theaters have good food and beer now which is cool. On my rift it would show future up coming movies hope this is the same..\n\nHelpful | 0", "CartawampusSep 26, 2019 at 10:48 AM\nIt's a great start, not quite there yet.\n\nIt's about time we had a library of 3D movies on the Quest, and it even has support for Movies Anywhere. This should've been a day 1 app. I'm docking a star, though, because the press release touts \"hundreds\" of 3D titles, but there are only 60 currently available 3D titles (I counted them). John Carmack did mention in his Day 2 OC6 keynote that \"Almost every 3D movie\" will be available soon, and downloadable, so I'm looking forward to that. I'm glad to see this finally on Quest and I'm excited to see more 3D movies added. Once the library is fleshed out, I would easily give this five stars.\n\nHelpful | 20", "DDay619Sep 27, 2019 at 10:08 AM\nSeems fine. No 3D movies yet?\n\nIt's nice to have a movie rental app on the Quest. I really want the ability to download a rented 3D movie, such as Avatar. As of now, the 3D trailers are just 2D SD, which sucks big time. There should be a traditional movie theater viewing option and a Void theatre viewing option.\n\nHelpful | 7", "roculus99Oct 14 at 2:07 PM\nUndercooked\n\nEdit: 3D movies are gone. I've been waiting for a legitimate way to rent 3D movies on Quest. Right now, there is no theater environment, poor selection, and no 3D trailers. Hopefully this app will improve over time.\n\nHelpful | 7", "YazoonyDec 7 at 12:42 AM\nVery clunky\n\nThis is not user-friendly. Most of the times you can't click on anything. it does not tell you which one is three d and which one is not. No button to go back. Terrible design\n\nHelpful | 1", "TheWax70Sep 26, 2019 at 9:11 AM\n3D supported movies not working for me\n\nIt is nice to see 3D movie support coming from one of the main digital retailers. Unfortunately they don't seem to be working for me at launch. Only playing the 2D HD versions(They do have 3D logos in the descriptions, strange). Hopefully this is only a issue on my end. Anyways, the app is simple to use and easy to understand. If you have a Movies Anywhere account linked to Fandango you can access most of your movies from places like Google Play, Youtube, Vudu, Itunes, Microsoft, and Amazon digital stores. I do wish you could change the environment to a theater. For now all you have is the default oculus tv view and the dark void view(look up or down and press and hold the right oculus button to change to void mode).\n\nI'll give this app a higher score if they fix the 3D support.\n\nHelpful | 8", "ArtzfallSep 26, 2019 at 8:35 AM\nReiterate\n\nOk, so Im mainly here to reiterate what everyone else is saying, but on a fairer level while also being more true. I didnt watch the Oculus summit, but I read the changes, and while my new Quest is turning out to be a great investment, Im still seeing the whole secret motive to destroy the old Oculus we know and love throughout it. Oculus is a gaming platform, Im sorry. Virtual Reality is for the creative people, the outcasts, and the gamers, as I said before on Uservoice, and as much as Mark wants to moan and complain that his headsets arent being used as the next Facebook, guess what? Thats not what we want to use it for. Dont force VR to be something its not. If you continue to do this, youre just going to lose the fight. As for this app, its glitchy, should show 3D trailers, and this app should not be here; a game should be in its place, as it should be.\n\nHelpful | 7", "BrandonBlackwellSep 27, 2019 at 6:22 PM\nFandangoNOW on Oculus Quest needs work\n\nThis app needs a lot of work. FandangoNOW just spits you into the Oculus TV environment to watch content instead of allowing you to watch in a void or a dark, more theater-like setting.\n\nIm also unable to watch my owned content in 3D, even when I see a 3D label on the description. For example, FandangoNOW has Jurassic Park in 3D and recognizes that I own a digital copy  but the movie plays in 2D, with no indication of how to play it in 3D. Perhaps this is because I had a previously purchased digital copy and didnt buy directly through the app? Either way, FandangoNOW does not make this clear and doesnt give me the option of purchasing the movie since its already part of my library.\n\nIf the developers fix these issues, I would give the app a second chance. Until then, its not worth the download.\n\nHelpful | 14", "BobicusOct 1 at 11:26 AM\nReally convenient way to watch 3d movies\n\nI've washed to watch 3d movies on my VR headset since I got it but there really wasn't a way to do this without buying a Blu Ray. This app costs money to rent / buy movies in 3d but the convenience is well worth it. There are some features this app could really use like downloading purchased movies, making the screen bigger, and lowering the lights. Since this is developed as an \"Oculus tv\" app the surrounding environment and screen size is part of the Oculus backend so if they add the screen scaling and dimming feature this app will get even better\n\nHelpful | 5", "carlos_laOct 11 at 6:15 AM\n3d movies, but Netflix is better\n\nWish they put any effort at all into the theater, letting you zoom, or choosing the angle... the 3d does work and is kind of cool / cheap, but a bit more work into the player goes a long way\n\nHelpful | 1", "darwins.lastDec 11 at 9:49 PM\nGreat 3D Streaming\n\nJust wish they had more 3d movies.\n\nHelpful | 0", "BoBaker43Nov 17 at 2:30 PM\nno sound\n\ncould never get the sound to work and I made sure that my device volume was turned all the way up\n\nHelpful | 0", "IAmLogginsSep 29, 2019 at 6:26 PM\nIf you want to watch 3D...\n\nNot thrilled that there isnt a theatre environment to enjoy a rented or purchased movie. That said, its the only library of 3D movies readily available. If Fandango can manage to add more 3D titles (as promised), Ill definitely bump this to a 5 star review.\n\nHelpful | 5", "JWheezySep 26, 2019 at 3:08 PM\nThis review is based on THIS app :)\n\nI downloaded this because I wanted to watch a 3D movie. So I downloaded it and then watched a 3D movie. I had no issues and thoroughly enjoyed watching Jurassic Park in 3D If you want this app to watch movies or perhaps a television show, I think this app is worth a try.\n\nHelpful | 9", "justin.raper.76Sep 27, 2019 at 2:32 AM\nFinally A Good Rental App!\n\nI've been waiting awhile since the Oculus Go for a good rental app and it has arrived here with the Oculus Quest. This application has the familiar feel of a smart tv app and has an up to date library of movie and TV titles. The sign up process was easy and the sound of the movie was good. HD and SD options were offered along with review scores at the top of the menu. This is the perfect app for renting content that is the latest and greatest available.\n\nHelpful | 5", "LittleGideonSep 30, 2019 at 5:08 AM\nPretty Good\n\nThe variety is ok could have more stuff, the ambience is nice (its just the tv room but I like it), the 3D options are a great touch (would love more in the future), I was surprised to see things still in theaters (pretty cool could save me a trip and its cheaper), the prices were pretty nice (which I really appreciate), so overall pretty good app\n\nHelpful | 0", "InfoJunkieSep 25, 2019 at 4:46 PM\nNo Thank You\n\nWe need AAA games, not more of this money grubbing media player rubbish. We have Big Screen Beta and can watch whatever we want, with a whole theater of virtual people, for free. Just focus on bringing AAA, full length games (without microtransactions). As it stands, you can play through the entire library of legitimate Quest games in a few days. Thanks!\n\nHelpful | 267", "Zenik77Sep 26, 2019 at 1:39 PM\nWe need games\n\nThis app is not what we asked for we need games not media cash crab cunsumsion games. We paid 400 for this head set give us games\n\nHelpful | 6", "kay20caOct 1 at 1:48 PM\nNew release movies & TV\n\nFinally a way to watch new releases and can link my Movies Anywhere account to load my library with all the movies. Love the 3D movies, pretty sure this is the only platform theyre on in 3D so great opportunity for Oculus users!\n\nHelpful | 1", "mcbain788Sep 27, 2019 at 1:07 PM\nJust bad\n\nI dont see the point in this application. By the way, the interface is glitchy and wasted my time. Would give 0 stars if I could.\n\nHelpful | 8", "J_Rene1Oct 5 at 6:39 PM\n\nI just rented lords of Dogtown and I cant hear anyone talking its just background music?\n\nHelpful | 0", "Sp1ffmanSep 29, 2019 at 8:09 PM\nWorks great! Streams all my movies!\n\nI have purchased many movies for streaming through Vudu, Google Play, UltraViolet, etc. With this app I can stream all of them with my Quest. Love it!\n\nHelpful | 0", "MuffisSep 28, 2019 at 8:37 AM\nDoes not work\n\nCant connect. I am in Sweden, maybe this is only for US?\n\nHelpful | 1", "RiftmasterTVSep 26, 2019 at 9:26 AM\nGreat\n\nThis app does exactly what is says it does, so 5 stars\n\nHelpful | 5", "zonarypythonSep 25, 2019 at 11:53 PM\nWe need more games\n\nWe need less of these cash grab apps and more games\n\nHelpful | 9", "CanidooSep 25, 2019 at 12:40 PM\nBad\n\nIt make me watch the movie??? No no no, I must play the movie. Its like I can watch fortnite but not play it. Game is dummy dum dum\n\nHelpful | 12"]