{"App Title": "Firefox Reality", "App description": "Firefox Reality brings content from the web that you know and love to Virtual Reality headsets. Our browser provides an open, accessible and secure way for everyone to explore the web. Experience sharp text, high quality videos, and a seamless transition from 2D to 3D immersive modes. Now with multiple windows, tabs and Firefox Accounts integration, you can enjoy the best possible web browsing experience with Firefox Reality.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Movie, Productivity, Utility", "Languages": "English, Chinese (China), Chinese (Taiwan), Danish, Dutch, Finnish, French (France), German, Italian, Japanese, Korean, Norwegian (Nynorsk), Polish, Russian, Spanish (Spain), Swedish", "Version": "11.2\n(LIVE)", "Developer": "Mozilla", "Publisher": "Mozilla", "Website": "https://mixedreality.mozilla.org/", "Release Date": "July 25, 2019", "Developer Privacy Policy": "Mozilla\nDownload Firefox\nFirefox\nProjects\nDevelopers\nAbout\nMozilla Privacy\nMozilla Websites, Communications & Cookies\nFirefox Browser\nFirefox Better Web\nFirefox for Fire TV\nFirefox Reality\nFirefox OS\nFirefox Focus\nFirefox Private Network\nFirefox Relay\nMozilla VPN\nThunderbird\nFirefox Reality Privacy Notice\nVersion 1.1, effective July 23, 2019\nAt Mozilla, we believe that privacy is fundamental to a healthy internet.\n\nThats why we build Firefox Reality, and all our products, to give you greater control over the information you share online and the information you share with us. We strive to collect only what we need to improve Firefox Reality for everyone.\n\nIn this Privacy Notice, we explain what data Firefox Reality shares and point you to settings to share even less. We also adhere to the practices outlined in the Mozilla privacy policy for how we receive, handle and share information we collect from Firefox Reality.\n\nFirefox Reality by default shares data for:\nImproving performance and stability\nVoice Search\nCrash reports\nMozilla\nCompany\nAbout\nPress Center\nCareers\nDevelopers\nTest New Features\nMDN Web Docs\nTools\nResources\nPrivacy\nContact\nProduct Help\nSupport\nFile a Bug\nTwitter (@mozilla)\n \nInstagram (@mozilla)\n\nVisit Mozilla Corporations not-for-profit parent, the Mozilla Foundation.\nPortions of this content are 19982020 by individual mozilla.org contributors. Content available under a Creative Commons license.\n\nPrivacy Website Privacy Notice Cookies Legal Community Participation Guidelines", "Developer Terms of Service": "Mozilla\nDownload Firefox\nFirefox\nProjects\nDevelopers\nAbout\nBack to Legal\nAbout Your Rights\n\nFirefox Reality is free and open source software. There are a few things you should know:\n\nFirefox Reality is made available to you under the terms of the Mozilla Public License 2.0. This means you may use, copy and distribute Firefox Reality to others. You are also welcome to modify the source code of Firefox Reality as you want to meet your needs. The Mozilla Public License 2.0 also gives you the right to distribute your modified versions.\nYou are not granted any trademark rights or licenses to the trademarks of the Mozilla Foundation or any party, including without limitation the Firefox name or logo. Additional information on trademarks may be found here.\nSome features in Firefox, such as the Crash Reporter, give you the option to provide feedback to Mozilla. By choosing to submit feedback, you give Mozilla permission to use the feedback to improve its products, to publish the feedback on its websites, and to distribute the feedback.\nHow we use your personal information and feedback submitted to Mozilla through Firefox Reality is described in the Firefox Reality Privacy Policy.\nIn order to play back certain types of video content, Firefox Reality downloads certain content decryption modules from third parties.\nSome Firefox Reality features make use of web-based information services, however, we cannot guarantee they are 100% accurate or error-free. More details, including information on how to disable the features that use these services, can be found in the service terms (below).\nFirefox Reality Web-Based Information Services\n\nFirefox Reality uses web-based information services (\"Services\") to provide some of the features provided for your use with this binary version of Firefox Reality under the terms described below. If you do not want to use one or more of the Services or the terms below are unacceptable, you may disable the feature or Service(s). Instructions on how to disable a particular feature or Service may be found here. Other features and Services can be disabled in the application preferences.\n\nMozilla and its contributors, licensors and partners work to provide the most accurate and up-to-date Services. However, we cannot guarantee that this information is comprehensive and error-free.\nMozilla may discontinue or change the Services at its discretion.\nYou are welcome to use these Services with the accompanying version of Firefox Reality, and Mozilla grants you its rights to do so. Mozilla and its licensors reserve all other rights in the Services. These terms are not intended to limit any rights granted under open source licenses applicable to Firefox Reality and to corresponding source code versions of Firefox Reality.\nThe Services are provided \"as-is.\" Mozilla, its contributors, licensors, and distributors, disclaim all warranties, whether express or implied, including without limitation, warranties that the Services are merchantable and fit for your particular purposes. You bear the entire risk as to selecting the Services for your purposes and as to the quality and performance of the Services. Some jurisdictions do not allow the exclusion or limitation of implied warranties, so this disclaimer may not apply to you.\nExcept as required by law, Mozilla, its contributors, licensors, and distributors will not be liable for any indirect, special, incidental, consequential, punitive, or exemplary damages arising out of or in any way relating to the use of Firefox Reality and the Services. The collective liability under these terms will not exceed $500 (five hundred dollars). Some jurisdictions do not allow the exclusion or limitation of certain damages, so this exclusion and limitation may not apply to you.\nMozilla may update these terms as necessary from time to time. These terms may not be modified or canceled without Mozilla's written agreement.\nThese terms are governed by the laws of the state of California, U.S.A., excluding its conflict of law provisions. If any portion of these terms is held to be invalid or unenforceable, the remaining portions will remain in full force and effect. In the event of a conflict between a translated version of these terms and the English language version, the English language version shall control.\nMozilla\nCompany\nAbout\nPress Center\nCareers\nDevelopers\nTest New Features\nMDN Web Docs\nTools\nResources\nPrivacy\nContact\nProduct Help\nSupport\nFile a Bug\nTwitter (@mozilla)\n \nInstagram (@mozilla)\n\nVisit Mozilla Corporations not-for-profit parent, the Mozilla Foundation.\nPortions of this content are 19982020 by individual mozilla.org contributors. Content available under a Creative Commons license.\n\nPrivacy Website Privacy Notice Cookies Legal Community Participation Guidelines", "Space Required": "149.7 MB"}



["5 stars\n44%\n4 stars\n20%\n3 stars\n17%\n2 stars\n6%\n1 star\n13%", "j_aem_138 days ago\nFirefox is king\n\nI use Firefox on everything else and the main reason to use this browser is compatability with stuff like jitsi meet and other web apps, over Facebook's oculus browser. There are some privacy benefits too, but until support for extensions is added in, not many!\nThis seems to be the android version of Firefox and allows you to send your tabs from other Firefox instances to this... If you've signed on for a Firefox account like a pleb!\nNow that Mozilla has fired a lot of its staff I hope the cool vr stuff it was working on like this and hubs doesn't get flushed too.\n\nHelpful | 2", "ThrowdownTornadoJun 5 at 10:33 PM\nBeats Oculus Browser in one way\n\nI'm able to run a webpage-based Webex Meeting through this browser and not the default Oculus Browser. Oculus Browser only let me run the page as a VR or mobile client, not as a desktop client. Firefox did let me, and that was how I was able to join a Webex meeting on my Oculus. So, this browser is worth having around in case you visit some complex web pages that require a bit more of a desktop-like set of technologies or experience.\n\nHelpful | 33", "D33Mar 16 at 7:45 AM\nGreat.. but.\n\nGuys, this is awesome. But.. when im in full screen expanded. immersed. . mostly in a video.. why.. seriously why... does the bottom controls not fade out... it's destroyed immersion in any videos I watch. the bottom 4/5 icons... never fade .. make everything fade out if no interactions.. please\n\nHelpful | 150", "mrbrush1Jul 11 at 12:31 AM\nCan't exit the app\n\nCan't exit the app unless I restart the quest vr.\n\nHelpful | 4", "n8rozeMay 13 at 7:22 PM\n360 videos end up very blurry\n\nI love Firefox and want to use it for all my VR browsing. But streaming videos end up looking like garbage. I played with the settings and couldnt get anything to work. I Googled for solutions and also found nothing. If/when this gets fixed, Ill revise\nmy review. But for now, its unusable.\n\nHelpful | 4", "ChrisFromNZMay 25 at 5:17 AM\nJust use oculus browser\n\nCouldnt get into my fav sites only to realise I could just use oculus browser. Its just too buggy and dont see the point using this for my need\n\nHelpful | 3\nDeveloper ResponseJun 12 at 1:05 PM\n\nI'm sorry to hear that! If possible, please send any of the sites to either mr@mozilla.com or log bugs or file a web compatibility report in the browser.", "cropplycrabMar 27 at 2:39 AM\nNot great\n\nHas some nice features, I like the immersion and how the tabs can be placed and resized, but it doesn't perform as well as the base quest browser, barely plays videos smoothly or works with even the suggested webvr experiences, and won't launch videos in vr at all sometimes, as if the permissions pop up isn't displaying properly. Also it crashes all the time.\n\nHelpful | 14", "Boxy77Jul 8 at 7:26 AM\nVR content does not work\n\nTried different vr modes not show movie or clip just sound...help\n\nHelpful | 0", "leeonlMar 27 at 4:07 PM\n2kvr\n\nthe pornhub 360 video can not play in the vr mode\n\nHelpful | 25", "OcuLorneMay 13 at 4:25 PM\n????\n\nUnless I am missing something you can't enter a URL? everything pops up as a google search? Can you even change the search engine? Can't edit URL of bookmarks either.\n\nIf you are going to do half a browser don't even start.\n\nHelpful | 3", "mickey216381Jan 18 at 11:55 AM\nNice browser\n\nThis is a great browser and I use it moreso than the Oculus browser. My only issue is the controls don't allow for you to turn off hardware acceleration. There are a few sites where I start to get the green screen, which is a known problem for Firefox for which the fix is to turn off hardware acceleration, I believe. Spectrum TV is the one where this happens all of the time, making it unusable. I would give this 5 stars workout a doubt if not for this matter! Very nice browser!\n\nHelpful | 20\nDeveloper ResponseJun 12 at 1:07 PM\n\nHi! There should be an option in settings for disabling the hardware acceleration feature now. I hope that this helps!", "seikedonMay 5 at 7:20 AM\ngoogle chrome remote desktop\n\nPlease let me use \"google chrome remote desktop\" as a client in \"firefox reality\".\nPlease do.\n\nHelpful | 0", "Henrik-KjellbergJun 7 at 3:44 PM\nFills like beta.\n\nNetflix doesn't work.\n\nHelpful | 2\nDeveloper ResponseJun 12 at 1:04 PM\n\nThanks for the feedback! Unfortunately, Netflix blocks access to their service from web browsers on mobile platforms, including the Oculus Quest.", "HConrad2959Mar 28 at 11:23 AM\nDoesn't VR for me\n\nWhen I try to view VR sites it just doesn't. It did when I first purchased it. But it doesn't now. I've uninstalled reinstalled factory reset the headset to no avail.\n\nHelpful | 12", "roli_oliMar 27 at 9:35 PM\n5 stars if it had webxr support\n\nAlmost perfect browser. The best part is being able to watch videos sideways laying in bed!\n\nHelpful | 3", "z_c00lDec 28 at 7:49 AM\nPlease improve\n\nUpdate 28/12\nThank you for listening and taking action. Adding the dark room feature was a great improvement. I would think that other improvement would take place eventually, but would you be able to address a more critical one....take this actual case below.\nIn desktop mode, go to https://astrogo.astro.com.my .\nWhen I first used Firefox Reality (when it was first released), I was able to access the website, but now, it just shows:\n\nSecure Connection Failed\n- The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.\n- Please contact website owners to inform them of this problem.\n\nThe thing is, I'm able to access the website with Mozilla and also Chrome. Why can't it work on Firefox Reality?\nIs this something you can fix?\n\nThank you!\n_____________________________________\n\nGreat app developer! But a few areas to consider improving.\n1. Allow to use without guardian and dark. We won't be walking around while browsing would we?\n2. Some streaming sites can't be opened. I can't tell if it is your app or the website bcos I was able to run it in the past. I would like to share more details, can you share your developer email? Thanks\n3. Allow full screen...not sure why is it limited to 3x.\n4. Allow remember password\n5. Lock screen option. I have often accidentally moved the browser screen so often.\nKeep up the good work. I'll give 5 stars with improvement taken. Heck...I would even pay for the app.\n\nHelpful | 17", "ArmisisApr 1 at 3:34 PM\nNot Firefox\n\nThis is horrible. Sad when the default system browser beats Firefox for features and flexibility. I was expecting a real impressive vr browsing experience but it failed.\n\nHelpful | 2", "zohargross1Nov 7 at 5:20 AM\nVery Nice but....\n\nThe app is cool and working great. I just wish you can have an option to move the screen back. Yes you can make it bigger, but then its big but to close. Its like sitting in a movie Theater but in the first row. If you can make it bigger and push the screen little back it will be perfect. still big but not to close.\n\nHelpful | 33", "ToastyHereDec 25 at 2:12 PM\nNeeds dual controller typing\n\nCurrently only one controller can be used to interact and type on the virtual keyboard, which makes typing anything incredibly slow. Otherwise its a great browser\n\nHelpful | 8\nDeveloper ResponseJun 12 at 1:16 PM\n\nThanks! This has been delivered.", "norabbitsJan 14 at 12:33 AM\nOnly way to view Matterport on Quest atm\n\nOculus' browser wasn't recognized by Matterport when I tried view a virtual real estate tour stored there. Firefox Reality lets you do the tour, opening full VR mode, letting you even use controllers to navigate.\n\nHelpful | 5", "Shawn_ZhuangJul 25, 2019 at 6:40 PM\nMove the screen\n\nHow about add a function,which allows user to move the position of the screen? I like to lie in bed to see movie .Quest is too heavy ,we cant sit straight to see a movie .\n\nHelpful | 106\nDeveloper ResponseJul 26, 2019 at 4:31 PM\n\nHi! We support recentering the UI when you are reclined to adjust the screen to wherever your head is pointed. Check out our post on it: https://blog.mozvr.com/firefox-reality-1-0-1-with-recline-mode/", "MisterP16Dec 4 at 11:27 PM\nUnable to use with guardian disabled\n\nWorks great, but you can only use it if guardian is enabled. If you want to surf the Internet in low light you cant start it with guardian disabled.\n\nHelpful | 9\nDeveloper ResponseDec 27 at 6:29 AM\n\nThanks! I've added an issue for this so that we can look into adding support for it: https://github.com/MozillaReality/FirefoxReality/issues/2551", "DeepMellowFeb 17 at 5:30 PM\nBest browser in my opinion\n\nThey did a great job making this.\n\nHelpful | 2", "CheezeFPVNov 25 at 4:25 AM\nBetter than the Oculus browser\n\nI like the fact that you can make the screen really really big, and add a curve to it, this makes even normal websites seem immersive. sometimes I do wish I could make a single screen even bigger than just three times the size, and making it able to go lower would be welcome as well.\n\nAlso, where's the zoom? It would be nice to be able to zoom in on things on the website. sometimes there's a little block of text somewhere that I can't read, or an image I want to see bigger, it would be nice to be able to zoom in.\n\nHelpful | 2", "JJJIMJan 12 at 1:20 PM\nMoon rider\n\nMoonrider.xyz crashes when you hit a block, does not happen on built in browser\n\nHelpful | 0", "RequiemieroOct 4 at 6:38 AM\nNeeds more features\n\nI like that multiple windows can be open right next to each other, and it makes multitasking like having Spotify open while browsing the web possible. But there are still lots of limitations that make this browser annoying to use.\n\nPlease allow the screen to be moved manually. Yes, I know you can recenter the screen anywhere by holding the Oculus button, but this way would be much easier since I often have to recenter multiple times by tilting my head up and down to get the angle I want.\n\nAnother limitation that is annoying is the inability to use anything other than the trigger to click. Clicking with the triggers gets uncomfortable after a while, and I would like the option to use the buttons to click instead.\n\nI would also like to be able to type using both controllers like in the Oculus menus and browsers. Using only one controller to type one letter at a time is very tedious and annoying.\n\nIf you can add these features I will give 5 stars. For now, I can only give 3.\n\nHelpful | 8", "kdolphinSep 24, 2019 at 4:37 PM\nTruly great\n\nNow that something akin to tabs has been added, this is the best browser for quest. Wonderful to chill with music on YouTube while researching something in Wikipedia and taking notes in Notion, each app in a huge screen. Only things I'm missing: keyboard support and the ability to copy text from one screen to another\n\nHelpful | 16", "stevegamer4235Nov 19 at 5:29 PM\nGreat but..\n\nI can't play roblox!!! Please make it show popups like asking you if you want to open apps or something that will let me play roblox.\n\nHelpful | 1", "SebustOct 5 at 12:21 PM\nGood but not great\n\nGood that there is now more alternatives to regular browser in quest but this just need 3rd party add on support, ability to create multiple tabs and multiple screens.\n\nAlso resolution could be improved regular browser has edge on that.\n\nEdit multiple screens added in update! Now there is only adding add on support to get 5 stars!\n\nHelpful | 2", "Winston84Nov 25 at 11:10 AM\nNothing Happening\n\nI can get to the home page of Firefox but when I press to open a site, nothing happens. It seems stuck.\n\nHelpful | 5", "robloxgamertyrDec 15 at 12:47 AM\n\nThe hand-tracking is too good for firefox vr nice job oculus\n\nHelpful | 2", "awrytOct 25 at 3:38 AM\nOpen more tabs\n\nPlease let us open at least 5 to 7 tabs.\nThank you.\n\nHelpful | 2", "StarV10Oct 2 at 7:38 AM\nFreezes / locks Oculus Quest AVOID APP\n\nUntil they fix the VR mode, avoid this APP at all costs. It will soft lock the Quest meaning you will have trouble even turning it off with the power button. After I finally did, the Quest then had trouble even booting up. This is the 4th time it's happened with this app and happens only about 5 mins after starting a VR video.\n\nHelpful | 3", "y1084110202Oct 23 at 11:13 PM\n3dof support\n\nBattery will drain slow when quest is in 3dof mode.Skybox latest vision support 3dof mode.It is useful.If it possible that firefox support it?It will help a lot.\n\nHelpful | 2", "TroymazingSep 8, 2019 at 5:48 PM\nLove This!\n\nI am having issues with watching Netflix. I switched to Desktop, but it still says there is an error starting playing. I would love to watch Netflix in the browser rather than the Netflix app. I much prefer your environment over the default Netflix setting.\n\nHelpful | 8\nDeveloper ResponseSep 14, 2019 at 11:22 AM\n\nThanks for the feedback! Unfortunately, Netflix does not currently allow playback to our browser. We will continue to work with them in the hopes that they will stop blocking Firefox Reality in the future.", "JamesHeinsSep 15, 2019 at 7:02 PM\nPlease add Bluetooth keyboard support!\n\nFar better than the Oculus browser, it would be nice to have an option for multiple browsers to continue audio and or video, also it would be cool if each screen could have multiple tabs open but not necessarily running. Also it would be super awesome if you guys added Bluetooth keyboard support.\n\nHelpful | 11", "M0ckingbirdJul 26, 2019 at 3:14 AM\n\nDoes the app have extensions like adblock plus? if not, then will it in a future update? I noticed that the favorites section isn't available on youtube; I made sure to log into my account to confirm. It would be nice for the favorite videos section to be available in a future update. Overall, the firefox browser is a lot better than the oculus browser imo. 5 out of 5 stars.\n\nHelpful | 37\nDeveloper ResponseJul 26, 2019 at 4:32 PM\n\nWe do not currently have extensions, but adding support for them is high on our list, both for ad blocking and password management. Thanks for the kind words and feedback!", "edgel0rdAug 29, 2019 at 1:44 PM\nHmm\n\nWebVR and 3D content works well enough. But is there a way to set the home page, or even browse our history? It gets insanely tedious to use the \"keyboard\" one click at a time when I want to login somewhere and have to re enter my credentials every single time.\n\nHelpful | 6\nDeveloper ResponseSep 14, 2019 at 11:23 AM\n\nHi! Please download the latest release, which now supports browsing your history. We're working on solutions for improving login/credential entry in the future - we want this too!", "jestanleyAug 9, 2019 at 3:20 AM\nCan't change search engine or use addons\n\nDecent browser, but you can't change the default search engine from Google to DuckDuckGo.\n\nWould also be nice to be able to add uBlock Origin.\n\nHelpful | 7", "acegraphxAug 11, 2019 at 12:09 PM\nGreat, but still needs some work\n\nThanks for your hard work, it's almost perfect. Curved screen with maximum size looks marvelous, but it is bugged. Sometimes I can't click anything on the page and has to turn curved mode off to be able to clock on the page. Please have a look at it.\n\nHelpful | 3", "kipgAug 25, 2019 at 9:25 PM\nCant play VR video\n\nEvery VR video I watch on this freezes or plays very choppy. The native browser on the oculus is much better at playing videos but it has other issues. If you can get the video playback issues fixed Id be willing to pay for this but until then its not worth using even for free.\n\nHelpful | 3\nDeveloper ResponseSep 14, 2019 at 11:23 AM\n\nI'm sorry to hear that! Please try the latest version, which has several updates and fixes to common video playback issues.", "leoftmAug 6, 2019 at 12:01 PM\nwave of third-party browser development\n\nI want to save-image to oculus quest storage from right-click menus !\n\nHelpful | 6", "hack321Oct 3 at 3:33 PM\nStats bar cannot disappear.\n\nWhen I play full screen video in the browser.The status bar (Backward and brightness and zoom in)shows below the screen can not disappear. It is so annoying.\n\nHelpful | 1", "BloomPetersSep 1, 2019 at 11:19 AM\nVideo Playback Major Issue\n\nVideos on any website stop playing after about 3 seconds! On twitch streams and other video sites. This needs to be fixed ASAP! :O It's a wonderful browser nonetheless\n\nHelpful | 0\nDeveloper ResponseSep 14, 2019 at 11:23 AM\n\nI'm sorry to hear that! Please try the latest version, which has several updates and fixes to common video playback issues.", "JTubbrittAug 3, 2019 at 4:44 PM\nFantastic\n\nLove the ability to add my own environment. Now I surf in outer space. Thanks so much for bringing this to the quest. If extensions like AdBkock are supported in the future, that would be fantastic.\n\nHelpful | 5", "paulieFlomarJul 25, 2019 at 10:58 AM\nwhat is the bg music in the preview vid?\n\nlove that tune! i played it 3 times. please, what is the song title / artist? thx!\n\nHelpful | 21\nDeveloper ResponseJul 25, 2019 at 12:30 PM\n\nGlad you like it! The track is \"Simulations\" by Matt Smokovich, SmokeM2D6 on Youtube.", "ryan77627Aug 15, 2019 at 6:12 PM\nAlmost there\n\nIt's very nice, however I have two issues. I would like to see multi handed typing added to make typing easier. Also, VR video seems to lag when switching resolutions.\n\nHelpful | 1", "elsitherinoAug 15, 2019 at 3:28 PM\nGreat browser\n\nReally impressed with the efficiency and data management of the browser. I'd like to see the next update include support for Bluetooth keyboards so I can use my Android media controls and touchpad Bluetooth keyboard.\n\nHelpful | 4", "panthemusicalgoatAug 8, 2019 at 5:25 PM\nBuggy\n\nSo far this has been buggier and less responsive than the default oculus browser. The Webvr app especially havent worked for me. Hopefully this gets fixed because I like the desktop Mozilla browser a lot\n\nHelpful | 2", "etagimbel_gerAug 1, 2019 at 10:03 AM\nwhy?\n\nHave not noticed any advantages over the built-in browser. Except I noticed some 3D videos which do start for some reason in the Oculus browser, do start in Firefox.\n\nHelpful | 0", "darwins.lastAug 17, 2019 at 10:46 PM\nBrowser Focused on VR\n\nUpdated often by the developers who are working to make it the best. Easy transition in and out of VR. Very good app and getting better.\n\nHelpful | 1", "DAX_QcAug 30, 2019 at 10:32 AM\nThis is the best browser on Quest.\n\nSimple to the point and easy privatw mode.\n\nHelpful | 0", "frankasmith568Jul 29, 2019 at 3:55 PM\nOk, But needs work\n\nMany of the VR experiences did not work or locked up and required reboot to clear. It has potential, but needs some better testing. Equivalent to a Beta version of software.\n\nHelpful | 5", "CyberSonic716Aug 18, 2019 at 10:29 AM\nDoes not handle Toonami's page :(\n\nI tried to watch my Toonami lineup on Adult Swim's site and as soon as it loads, the app lags so bad that motion tracking gets delayed and I have to restart my Quest. Please fix this. :(\n\nHelpful | 0\nDeveloper ResponseSep 14, 2019 at 11:24 AM\n\nI'm sorry to hear that! Please try the latest version, which has several updates and fixes to common video playback issues.", "arleigh.anchetaJul 31, 2019 at 7:00 AM\n\nReally liked the music 3D videos, it was so impressive as is if your in the video itself. Can you guys get more videos like that from all the music artists?\n\nHelpful | 0", "MotifoeAug 5, 2019 at 10:06 AM\nI'm a fan now. Soooo gooood\n\nGreat experience. Top notch\n\nHelpful | 2"]