{"App Title": "First Steps", "App description": "Take your first steps in VR and get to know your controllers in this short experience that showcases the power of Oculus Quest.\n\nRelease Version 1.0", "Purchase section": "FreeAdd to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Arcade, Educational, Exploration", "Languages": "English", "Version": "1.0", "Developer": "Oculus", "Publisher": "Oculus", "Website": "http://www.oculus.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Privacy Policy\n\nLast Updated: December 27, 2019\n\nOculus is brought to you by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) (\"Oculus,\" \"we,\" \"us\") and is one of the Facebook Companies (https://www.facebook.com/help/111814505650678). We make virtual, mixed, and augmented reality (collectively, \"XR\") products and operate a platform where users can download, interact with, and submit content and obtain services related to our products. Collectively, we describe our products and servicesincluding our websites, mobile apps, platform, content, hardware and the services described further in our Terms of Service (https://www.oculus.com/legal/terms-of-service)as our \"Services.\" This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\n1. What kind of information do we collect?\n\nDepending on which Services you use, we must process different kinds of information from or about you. Heres how:\n\nInformation You (and others) Give Us. We collect the information you (and others) give us when using our Services. For example:\nWhen you register to use our Services, we ask for information such as your name, email address, and phone number.\nYou will have the ability to add information to your profile after registration.\nIf you buy something on or through our Services, we collect information about the transaction. This can include your payment information, purchase activity, and shipping and contact details.\nWe collect information about the people, content, and experiences you connect to and how you interact with them across our Services.\nWhen you post, share or communicate with us or other Oculus users on our Services, we receive and store those communications and information associated with them, such as the date a post was created.\nWhen you communicate with Oculus, you provide us with information like your email address.\nDepending on which Services you use, you have the option of submitting information about your physical features and dimensions.\nWe collect content and information about content you create using our Services, such as your avatar, a picture you post, or an object you sculpt.\nWe also collect content and information that other people provide when they use the Services. This can include information about you, like when they send us an abuse report that refers to or contains video of you.\nInformation Automatically Collected About You When You Use Our Services. We also collect information automatically when you are connected to our Services. Depending on how you access and use our Services, we collect information such as:\nInformation about your interactions with our Services, like information about the people, games, content, apps, features, or other experiences you interact with, including information collected through or from content provided by our third-party partners. For example, we may receive information about in-app purchases you have made in a game provided by a third-party developer;\nInformation collected in or through cookies, local storage, pixels, and similar technologies (additional information about these technologies is available at https://www.oculus.com/legal/cookies-pixels-and-other-technologies);\nInformation about how you access our Services, including information about the type of device you're using (such as a headset, PC, TV, mobile, or other connected device), its configuration (such as your operating system and graphics processing unit), your browser, Internet Protocol (\"IP\") address, and how your device is performing;\nInformation about the features you interact with on our Services. For example, when you use our voice-search features, we process your voice commands so we can deliver the content or feature youve requested;\nCertain identifiers that may be unique to you. These identifiers include device and other identifiers, such as those from games and apps you use;\nInformation about the games, content, or other apps installed on your device or provided through our Services, including from third parties;\nLocation-related information, which can be derived from information such as your devices IP address. If youre using a mobile device, some of our Services collect information about the devices precise location, which is derived from sources such as the devices GPS signal and information about nearby Wi-Fi networks and cell towers;\nInformation about your environment, physical movements, and dimensions when you use an XR device. For example, when you set up the Oculus Guardian System to alert you when you approach a boundary, we receive information about the play area that you have defined;\nInformation we receive through device settings you choose, such as your photos or audio content.\n\nThird parties may also collect information about you through the Services, as described below.\n\nRelated companies. Depending on which services you use, we receive information about you from other companies that are within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook, and combine that information with other information we collect about you. View a complete list of related companies at https://www.facebook.com/help/111814505650678.\nInformation from other sources. We also receive additional information about you from third parties, including partners that provide us information that is publicly or commercially available, and may combine that information with the other information we collect about you.\n\nYou can learn how to access and delete information we collect by visiting the Privacy Center (https://secure.oculus.com/my/privacy).\n\n2. How do we use information?\n\nWe use the information as set out below and to provide our Services to you and our partners. Heres how:\n\nTo provide and personalize our Services. We use the information we collect to provide you with our Services. For example, we use this information to:\nProvide you with hardware, content, games, apps, and other experiences;\nCreate accounts and user profiles;\nCommunicate with you about our Services;\nEnable user-to-user communications and other social services;\nProvide technical support;\nNotify you about updates to our Services; and\nCustomize your experiences based on your activities, including the content, games, apps, and other experiences you interact with, the other online services you use, and other information we collect. This allows us to make your experience unique and relevant to you, for example by showing you content that is most relevant to you.\nTo improve and develop your experience and our Services. We also use the information we collect to understand and improve our Services and to develop the XR ecosystem. For example, we use the information to:\nSolicit and analyze input and feedback about our Services;\nIdentify and address technical issues on our Services;\nConduct and learn from research about the ways in which people use our Services; and\nImprove services offered by others, such as third parties that offer content, games, apps and other experiences on our platform.\nTo market to you. We use the information we collect to send you promotional messages and content and otherwise market to you on and off our Services. We also use this information to measure how users respond to our marketing efforts. If you would like to opt out of receiving marketing emails, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\nTo promote safety and security. We use the information we collect to help promote safety and security on and off our Services, such as by investigating suspicious activity or violations of our terms or policies and protecting our or others rights or property.\n\n3. How is information shared?\n\nOur Services help you engage with the XR ecosystem and others that interact with it. To provide and support our Services, information we have about you is shared in certain circumstances. Here is who can see information about you when you and others use our Services.\n\nPeople and accounts you share and communicate with. When you share, interact, and communicate using our Services, you choose the audience for what you share. For example, when you post a photo on the wall in Oculus Rooms, other people who visit the room will be able see it.\nPublic Information. Certain information you post to your Oculus profile, such as your Oculus ID (also known as your Oculus Username), your system-generated user ID, and avatar, will be public and visible to people on and off our Services. Your Oculus ID is a unique identifier you choose to identify yourself on our Services. Your system-generated internal-ID is an opaque string of characters generated by the Oculus system that identifies your Oculus profile.\n\nInformation you post to public areas of our Services, such as a forum, blog, or other community tool, will also be visible to people on and off our Services. If you post information to these interactive features, it will be publicly available. Certain information associated with your public posts, such as the time of your post, may also be published and publicly available.\n\nContent others share about you. You should consider who you choose to share with, because people who are able to see your activity, content, or information on our Services may choose to share it with others on and off our Services. For example, when you interact with others in a multiplayer game, another player could choose to livestream that experience  including what you are doing in the game  to Facebook. People may also use our products to share content about you they have obtained from other sources. For example, people may share a photo of you with others in Oculus Rooms.\nApps, Developers, and Other Online Content Providers on our Services. You can interact with third-party content, games, apps, and other experiences through our Services. We may share information about you with these partners so they can provide you with the experiences you've requested, such as:\nInformation in your Oculus profile and about how you use our Services. For example, we may provide a third-party gaming experience with information about people you commonly interact with on our Services so they can offer to pair you in a social experience. We may also share information about individual abuse reports or abuse statistics on our Services, so we can help develop a safe and enjoyable XR ecosystem.\nInformation about your interaction with the third-party service, such as how long you have interacted with content or how far you have progressed in a game.\nAny other information you choose to share with the third party.\nThird-party content providers may also collect information from you directly through the experiences they provide. Please note that any information you share with these (or other) third parties will be subject to those third parties own privacy policies, not this one.\nSharing Within Related Companies. Depending on which services you use, we share information within the family of related companies that are legally part of the same group of companies that Oculus is part of, or that become part of that group, such as Facebook. For a list of our related companies, please see https://www.facebook.com/help/111814505650678.\nService providers. We share the information we collect with vendors, service providers, researchers and other partners, who work at our direction to support the Services (such as hosting our Services, fulfilling orders, facilitating payments, analyzing the way people use our Services, processing credit card payments, providing customer service, or sending electronic communications for us).\nOther parties in connection with certain business transactions. In the event that the ownership of Oculus (or any portion of our assets) changes as a result of a merger, acquisition, or in the event of a bankruptcy, information from or about you or your device may be transferred to another company.\nPermission. We may share information about you for any other purpose you choose.\nLaw enforcement or legal requests. We share information with law enforcement or in response to legal requests in the circumstances outlined in Section 7 below.\n\nWe also share de-identified or aggregate data with others. De-identified data means information where we have removed your name and other data that could reasonably be used to identify you. Aggregate data is data that has been combined with other data so that it doesnt identify any specific person. For example, we provide developers with aggregated statistics about the number of people from a particular region that use our Services, so developers can create content tailored for people in that market.\n\n4. How the Facebook Companies work together\n\nOculus shares infrastructure, systems technology with other Facebook Companies (which include Facebook, Instagram, and WhatsApp) to provide an innovative, relevant, consistent and safe experience across all Facebook Company Products you use. We also process information about you across the Facebook Companies for these purposes, as permitted by applicable law and in accordance with their terms and policies. For example, we use information about bad actors on Oculus to fight spam or abuse on other Facebook Company Products like Instagram. We also work to understand how people use and interact with Facebook Company Products, like understanding the number of unique users on different Facebook Company Products.\n\nFacebook also powers social features on Oculus. If you choose to log into Facebook on Oculus, Facebook will use your Oculus account information and information about your use of Oculus products to provide, personalize and improve Facebook Company Products, including to personalize the ads you see on and off Facebook Company Products. You can control what data Facebook uses to show you ads on and off of Facebook Company Products in your Facebook Settings.\n\n5. Third Parties that Provide Content, Marketing, or Functionality on Our Services\n\nSome of the content, marketing, and functionality on our Services may be provided by third parties that are not affiliated with us. For example, we work with companies that help us understand how people use our Services.\n\nOther companies may collect information on or through our Services to market to you on or off of our Services. These and other third parties may collect information about your use of our Services, including through the use of cookies, device IDs, local storage, pixels and other technologies, and this information may be collected over time and combined with information collected on different websites and online services.\n\n6. Data retention and deletion\n\nWe store data that identifies you until it is no longer necessary to provide our Services or your account is deleted, whichever comes first. This is a case-by-case determination that depends on things like the nature of the data, why it is collected and processed, and relevant legal or operational retention needs. For example, we may retain certain purchase information for accounting and tax purposes even after you have deleted your account.\n\nWhen you delete your account, we delete things you have posted and information about apps and entitlements you have downloaded, and you will not be able to recover that information later. Information that others have shared about you is not part of your account and will not be deleted when you delete your account. To delete your account at any time, or to learn more about deleting your account, please visit the Privacy Center (https://secure.oculus.com/my/privacy).\n\n7. How do we respond to legal requests and preventing harm?\n\nWe access, preserve and share information with regulators, law enforcement or others:\n\nIn response to a legal request (like a search warrant, court order or subpoena) if we have a good faith belief that the law requires us to do so. This may include responding to legal requests from jurisdictions outside of the United States where we have a good faith belief that the response is required by law in that jurisdiction, affects users in that jurisdiction, and is consistent with internationally recognized standards.\n\nInformation we receive about you, including financial transaction data related to purchases made on or through our Services, can be accessed, processed and retained for an extended period when it is the subject of a legal request or obligation, governmental investigation, or investigations concerning possible violations of our terms or policies, or otherwise to prevent harm. We also retain information from accounts disabled for violations of our terms for at least a year to prevent repeat abuse or other term violations.\n\n8. How we operate and transfer data as part of our global services\n\nWe share information globally, both internally within the Facebook Companies (https://www.facebook.com/help/111814505650678/), and externally with our partners and with those you connect and share with around the world. Your information may, for example, be transferred or transmitted to, or stored and processed in the United States or other countries outside of where you live for the purposes described in this policy.\n\n9. How will we notify you of changes to this policy?\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address youve provided, and/or providing notice through the Services. If we make an administrative change, we may update the \"Last Updated\" date at the top of this Privacy Policy.\n\n10. Contacting Us\n\nIf you have questions about this Privacy Policy, please contact us at privacy@oculus.com.\n\n11. Privacy Notice for California Residents\n\nIf you are a California resident, you can learn more about your consumer privacy rights by reviewing the California Privacy Notice.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Developer Terms of Service": "Oculus\nHeadsetsApps & GamesCommunitySupport\nLog In or Sign Up\nLegal Documents\nOculus Terms Of Service\nSpecial Provisions Applicable to Users Residing in Germany\nOculus Privacy Policy\nCookies, Pixels, and Other Technologies\nOculus Go/Gear VR Content Refund Policy\nOculus Rift/Quest Content Refund Policy\nOculus Video Terms\nLimited Consumer Warranty\nLegal Compliance and Disclosures\nConflict Minerals Policy\nHealth and Safety Warnings\nOculus Store Credit Terms\nOculus Promotional Offer Terms\nMusic Guidelines\nThird Party Notices\nProduct Information Sheet - Oculus Go\nProduct Information Sheet - Oculus Quest\n\nOculus Terms Of Service\n\nLast Updated: June 8, 2020\n\nBY ACCEPTING THESE TERMS OF SERVICE OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THESE TERMS OF SERVICE IN THEIR ENTIRETY. IF YOU DO NOT AGREE TO THESE TERMS OF SERVICE, DO NOT ACCESS OR USE OUR SERVICES.\n\nTHESE TERMS OF SERVICE CONTAIN IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SERVICES, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS. PLEASE READ THE \"DISPUTE RESOLUTION\" SECTION (SECTION 19) IN ITS ENTIRETY. IN ADDITION, CERTAIN TERMS AND CONDITIONS MAY BE APPLICABLE TO USERS THAT RESIDE OUTSIDE THE UNITED STATES. PLEASE REVIEW SECTION 27 TO DETERMINE WHETHER THESE TERMS AND CONDITIONS APPLY TO YOU.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THESE TERMS OF SERVICE. MAKE SURE TO REVIEW THESE TERMS OF SERVICE WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nOculus (\"Oculus,\" \"we,\" \"us\" or \"our\") is brought to you by Facebook Technologies Ireland Limited (formerly known as Oculus VR Ireland Limited) if you reside in the European Region (as defined at https://www.oculus.com/legal/territories) and by Facebook Technologies, LLC (formerly known as Oculus VR, LLC) if you reside anywhere else.\n\nWe are pleased to provide you access to the services described below in Section 1 (collectively, our \"Services\"). These Terms of Service (\"Terms\") apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with Oculus for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nOculus reserves the right to change or modify these Terms on a going-forward basis at any time and in our sole discretion. If Oculus makes changes to these Terms, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided and/or notice through the Services. If we make an administrative change, we may provide notice by updating the \"Last Updated\" date at the top of these Terms.\n\nYour continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services and delete (https://secure.oculus.com/my/privacy) your account. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\n1. Oculus Products and Services\n\nOur mission is to enable people to have meaningful interactions regardless of physical distance. To help advance this mission, we provide the Services described below to you. In order to provide these Services, we must collect and use your personal data as described in our Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy.\n\nProvide innovative devices, content and systems. We offer a variety of physical goods, platform services, software, websites, applications, and content that allow you to access and immerse yourself in virtual, augmented, and mixed-reality (collectively, \"XR\") worlds and obtain services related to our products. We use the data we have to provide you with these products and to enhance the XR ecosystem.\nProvide a personalized experience for you. Your experience with Oculus is unlike anyone elses. For example, any Oculus user may be eligible to see thousands of unique pieces of content. We use the data we have  for example, information about the connections you make, the choices and controls you select, and the things you share and do  to personalize your experience.\nConnect you with people and experiences you care about. We help you find and connect with people, groups, events, and other experiences that matter to you across the Services you use. We use the data we have to make suggestions for you and others  for example, rooms to join, events to attend, and people you may want to become friends with. Stronger ties make for better communities, and we believe our Services are most useful when people are connected to people, groups, and experiences they care about.\nEmpower you to express yourself and communicate about what matters to you. There are many ways to express yourself on Oculus and to communicate with friends, family, and others  for example, sharing photos, creating or participating in events or multiplayer experiences, or adding content to a virtual environment. We also have developed, and continue to explore, new ways for people to use technology like augmented reality and 360 video to share more expressive and engaging content on or through Oculus.\nHelp you discover content, products and services that may interest you. We may provide you with offers and other promotions to help you discover content, products, and services that are offered by Oculus and the many businesses and organizations that use our Services.\nCombat harmful conduct and protect and support our community. People can only have meaningful interactions if they feel safe. We employ dedicated teams and develop advanced technical systems to detect misuse of our service, harmful conduct towards others, violations of our terms and policies, and situations where we may be able to help support or protect our community. If we learn of content or conduct that misuses our Service or violates our Terms and policies, we will take appropriate action  for example, removing content, blocking access to certain features, disabling an account, or contacting law enforcement. We share information with other Facebook Companies (https://www.facebook.com/help/111814505650678) when we detect misuse or harmful conduct by someone using one of our Services.\nUse and develop advanced technologies to provide functional services for everyone. We use and develop advanced technologies  like artificial intelligence and machine learning systems  to enable us to offer a better and more useful service to everyone who uses Oculus. For example, we use information we have to develop models that will surface content that is relevant to you. We also develop automated systems to improve our ability to detect and remove abusive and dangerous activity that may harm our community and the integrity of our Services.\nResearch new ways to make our services better. We engage in research and collaborate with others to improve our Services. One way we do this is by analyzing the data we have and understanding how people use our Services.\nProvide consistent and seamless experiences: Our products help you find and connect with people, groups, businesses, organizations, and others that are important to you. We design our systems so that your experience is consistent and seamless across the different Facebook Company Products (https://www.facebook.com/help/195227921252400) that you use. For example, some of our Services help you connect with your friends on Facebook.\nEnable global access to our services: To operate our global service, we need to store and distribute content and data in our data centers and systems around the world, including outside your country of residence. This infrastructure may be owned or operated by Facebook Technologies, LLC, Facebook Technologies Ireland Limited, Facebook Inc., Facebook Ireland Limited, or their affiliates.\n\n2. Eligibility; Registration and Account\n\nThe Services are intended solely for users who are 13 or older. Any registration for, or use of, the Services by anyone under the age of 13 is unauthorized, unlicensed and in violation of these Terms. You represent and warrant that you (a) are not identified on the Office of Foreign Assets Controls Specially Designated Nationals List (\"SDN List\"), (b) are not placed on the U.S. Department of Commerces Denied Persons List or Entity List or any other U.S. export control list, (c) will not use IP proxying or other methods to disguise the place of your residence, (d) will not use the Services if any applicable laws in your country prohibit you from doing so in accordance with these Terms and (e) have not previously had your right to use the Services suspended or terminated.\n\nTo access and use certain features of the Services, you may be required to register for an account. By creating an account, you agree to: (i) provide accurate, current and complete account information; (ii) maintain the security of your password, not share your password with any other person and accept all risks of unauthorized access to your account; and (iii) promptly provide notice at https://www.facebook.com/whitehat if you discover or otherwise suspect any security breaches related to the Services.\n\n3. Equipment; Software; and Updates\n\nCertain equipment and software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our Code of Conduct (https://support.oculus.com/1694069410806625), agreements, laws, regulations, or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\n4. Your Use of the Services and Content\n\n4.1 Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (\"Software and Content\"), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by Oculus or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n4.2 Oculus Runtime Software. Subject to these Terms, including the license provided in Section 4.1, you may access, install, and use the Oculus Runtime Software (\"Runtime\"). In order to maximize your enjoyment, safety, and overall experience through our Services, the Runtime may only be used with Oculus approved hardware devices and with software developed using the Oculus Rift Software Development Kit, as specified in the Oculus Rift Software Development Kit license agreement. We also require that you use only the then-current version of the Runtime. You acknowledge that the Runtime incorporates proprietary information, and that you will not disclose it to any other person or entity.\n\n4.3 Third Party Content. Your use of services, applications, or content provided by third parties (\"Third Party Content\") made available through the Services may be subject to additional end user agreements. In the event that these agreements conflict with the provisions of these Terms, these Terms will govern. Oculus has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Oculus be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Oculus) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n4.4 Trial Access to Services. We may offer free trials or other limited versions of Services so you can preview Services before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n4.5 Availability of Services after Purchase; Updates. Some Services may rely on services provided by third parties for some or all of its functionality. Such Services may not function properly or may become inoperable if these third parties discontinue their services.\n\n4.6 Support. Oculus will be responsible for all billing questions related to the purchase of Services and for support with respect to the Oculus platform. Oculus has no obligation to provide support for Third Party Content. Please contact us through the support portal at https://support.oculus.com for assistance.\n\n4.7 Availability. The Services and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n4.8 Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n5. Purchasing Services\n\n5.1 Purchasing Services from Oculus. You may only purchase Services for your personal use or to give as a gift unless otherwise expressly permitted in these Terms. You may not purchase Services from Oculus for commercial use or resale, although you may use the Services to develop and test content, software, or applications intended for distribution by Oculus.\n\nWhen placing an order or making a purchase, you will be required to provide us with information, such as your address and billing information. You represent and warrant that all such information is accurate, and you will ensure that such information is kept current. Oculus will have no responsibility or liability for inaccurate information or information that later becomes outdated, and Oculus will have no obligation to make efforts to determine the correct contact or shipping information. For most Services, you can manage your information within your account settings. For product purchases pending shipment, you can update your information at any time prior to shipment at https://shop.oculus.com/history. We will not take payment for product purchases until Order Acceptance (see below).\n\nAfter you place an order, you may receive a communication from us acknowledging that we have received your order (\"Order Acknowledgement\"). Please note that receiving the Order Acknowledgement does not mean that your order has been accepted. We will confirm our acceptance of your order by sending you a communication that confirms that the order has been processed or the goods have been shipped  when applicable (\"Order Acceptance\"). The contract between us in relation to the applicable Services will be formed when we send you the Order Acceptance.\n\nAny shipping dates or times provided by us (or a courier) are estimates only and are not guaranteed. The risk of loss in physical goods you purchase and the responsibility to insure the goods passes to you upon delivery of the goods to you.\n\nNothing in these Terms shall affect your statutory rights to reject physical goods that, when received by you, are damaged or defective.\n\n5.2 Pre-Orders. In advance of a new Service launch it may be possible to place pre-orders.\n\nThe price of the Service you pre-order will be as quoted to you at the time you submit your pre-order, and may include tax and shipping when applicable. Placing a pre-order does not guarantee delivery of a Service.\n\nWhen the pre-ordered Service is ready for shipping or delivery we will contact you to provide you with your purchase confirmation (including shipping costs and any taxes where applicable). This shall constitute the Order Acceptance.\n\n5.3 Our Right to Reject Your Order. At any time prior to Order Acceptance, we reserve the right to decline or reject your order. If this occurs, we will attempt to notify you. Some reasons for rejection can include: (a) we are unable to supply you with Service, for example because that item is no longer available or because of an error in the price at the point of sale; (b) you do not live in a country or region from which the Services may be purchased; or (c) you order more than the permitted maximum number of Services. If you have already paid, we will refund you the full amount including any delivery costs charged.\n\n5.4 Your Right to Cancel or Return Physical Goods. You may cancel your order or pre-order of physical goods at any time prior to shipping and Order Acceptance. After shipping the goods to you, you have the right, within 30 days from the date of your receipt of the goods, to cancel our contract with you and return the goods. This right does not apply to any goods that have been used, or are stated by us to be non-returnable, including any items or goods that have been personalized or modified in accordance with your instructions. The goods must be fully returned in the original packaging with the applicable proof of purchase and you will be responsible for the cost of returning the goods to us. If, on return to us, it is determined that the goods have been used, damaged, are missing components, or are not in resalable condition we may charge a 15% restocking fee, or otherwise reduce the amount of your refund to take account of this damage, use, or missing components.\n\nTo cancel your order or return your goods, you must inform us of your decision by following the instructions at https://support.oculus.com\n\n5.5 Content Transactions. You may have the ability to purchase digital content through the Services. You also may have the ability to purchase additional or enhanced functionality or media content within certain Services (collectively, \"In-App Purchases\"). Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content or In-App Purchases and assume no liability for Third Party Content or Third Party In-App Purchases that occur within Third Party Content.\n\n5.6 Errors. We attempt to be as accurate as possible and to eliminate errors in relation to our Services; however, we do not represent or warrant that any Service descriptions or pricing information are accurate, complete, reliable, current or error-free. In the event of an error, we reserve the right to correct such error and revise your order accordingly (which includes charging the correct price) or to cancel the order and refund any amount charged. If we discover a pricing or other material error related to a Service that has yet to be shipped or delivered, we will contact you to inform you of this error and give you the option of continuing to purchase at the correct price or cancelling your order. If we are unable to contact you using the contact details you provided during the order process, we will treat the order as cancelled.\n\n5.7 Account. You may be required to be a registered user in order to purchase some Services. You are responsible for all charges incurred in connection with your account. Oculus may attempt to collect unpaid charges, including by attempting additional charges to your payment instrument, use of collections agencies and any other legal means. If you decide to cancel your account, Oculus reserves the right, subject to any limitations under applicable laws, to collect fees, surcharges, or costs incurred before cancellation. Any delinquent or unpaid accounts must be settled before Oculus will allow you to register again.\n\n5.8 Virtual Items. Your purchase of a virtual item or in-game currency within the Services is a payment for a limited, non-assignable license to access and use such content or functionality in the Services. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Services can only be used in connection with the Services where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Services for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n5.9 Pricing and Payment. We may accept various forms of payment, including credit and debit cards, and payments made through PayPal and Facebook Payments. Additional terms with your payment provider may apply.\n\nBy submitting an order or pre-order, you acknowledge that you are authorized to use the designated payment method and you authorize us to charge your order to that payment method. When you provide your payment information, you authorize us (or a third party payment processor) to process and store your payment and related information. Depending on where you are located or ask to have Services shipped or delivered, Oculus may utilize an agent, subsidiary, or affiliate (including Facebook Technologies Ireland Limited for orders outside of the United States and Canada) to process payment and shipping. In the event the payment method you designate cannot be verified, is invalid, or is not otherwise acceptable, we may suspend or cancel your order. You are responsible for resolving any problems we encounter in order to proceed with your order.\n\nPrices are subject to change without notice. We reserve the right to refuse or cancel orders at any time and in our sole discretion.\n\n5.10 Taxes. If your purchase or use of the Services is subject to any type of use or sales tax, duty or other governmental tax or fee (\"Taxes\"), then we may charge you for those Taxes. Applicable Taxes may be presented at checkout. You are responsible for any Taxes due with respect to your use of the Services.\n\n5.11 Content Cancellations; Returns. All purchases of digital content are final except as required by law, or as described in our Mobile (https://www.oculus.com/legal/mobile-content-refund-policy) and Rift (https://www.oculus.com/legal/rift-content-refund-policy) Content Refund Policies. Once you purchase Content, we encourage you to download, install and/or access it promptly. You consent that the supply of the digital content may begin immediately following the completion of your purchase, and you acknowledge that you therefore will lose any statutory rights you may have to withdraw and receive a refund. If you are unable to download, install or access purchased content, please contact us through the support portal at https://support.oculus.com.\n\n6. Acceptable Use\n\nBy accessing or using the Services, you agree that you will not: (a) access or use the Services in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Services, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Services in any manner; (c) access or use the Services for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, Code of Conduct (https://support.oculus.com/1694069410806625), or any other terms or policies provided in connection with the Services; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Services; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Services or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Services, or third parties; or (h) infringe upon or violate the rights of Oculus, our users or any third party.\n\n7. User Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send, otherwise transmit, or interact with content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, \"User Content\"). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. If you use content covered by intellectual property rights that we have made available through our Services (for example, images, designs, videos, or sounds we provide that you add to content you create or share on Oculus), we retain all rights to that content (but not yours). By submitting User Content through the Services, you grant Oculus a worldwide, non-exclusive, transferable, royalty-free, and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform, and distribute such User Content in connection with the Facebook Company Products (https://www.facebook.com/help/195227921252400) (subject to applicable Privacy Settings (https://secure.oculus.com/my/privacy)). This right ends when you delete your User Content or your account unless your User Content has been shared with others, and they have not deleted it. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content. If User Content includes music, you agree to our Music Guidelines (https://www.oculus.com/legal/music-terms).\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Oculus the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our Code of Conduct (https://support.oculus.com/1694069410806625/).\n\nOculus does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Oculus has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nIn the event you are a developer who submits User Content to Oculus, you acknowledge and agree that our agreements with you as a developer may supersede this section of the Terms.\n\n8. Privacy Policy\n\nOur Privacy Policy, which is available at https://www.oculus.com/legal/privacy-policy sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as developers of Third Party Content and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Services. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n9. Additional Terms\n\nThese Terms are in addition to, and do not replace or change, any other agreements you enter into with Oculus, which may include but are not limited to our developer agreements, special device terms of use, Code of Conduct (https://support.oculus.com/1694069410806625), and contest, competition, or promotion-related terms. In addition, if you purchase physical goods from Oculus, other terms of sale or promotion may apply from time to time.\n\nYour purchase and use of Third Party Content may be subject to additional terms, including but not limited to third-party end user agreements, and privacy policies. We encourage you to review any third-party agreements and policies carefully before accessing, downloading or using Third Party Content. You may also access services provided by other Facebook Company Products (https://www.facebook.com/help/195227921252400), which may be subject to additional terms.\n\n10. Ratings\n\nWe may display age, comfort, and content ratings for digital content that are based on information provided to us by the developers of such content. We cannot guarantee that digital content ratings will always be accurate, nor can we promise that you will not find some material harmful, offensive, indecent or objectionable.\n\n11. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Services are the property of Oculus or our licensors and are protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\nOculus, Oculus VR, Rift, Oculus Touch, Oculus Go, and the Oculus logo (\"Oculus Marks\") are trademarks or registered trademarks of Facebook Technologies, LLC. The Oculus Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, except as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder. For more information about our brand guidelines, visit our Brand Resource Center (https://oculusbrand.com).\n\n12. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials or other information about Oculus and our Services (collectively, \"Feedback\"). You agree that Oculus and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n13. Export Compliance and U.S. Government Rights\n\nYou will comply with all applicable export control laws of the United States and any other applicable governmental authority, including without limitation, the U.S. Export Administration Regulations (\"Export Laws\"). You will not, directly or indirectly, export, re-export or download any products, services or technology of Oculus, including, without limitation, the Services: (a) to any individual, entity or country prohibited by Export Laws, including by any U.S. sanctions program; (b) to anyone on the SDN List, the Denied Persons List or Entity List or other export control lists; or (c) for any purpose prohibited by Export Laws, including nuclear, chemical or biological weapons proliferation or development of missile technology. You further represent and warrant that no U.S. federal agency has suspended, revoked or denied your export privileges and you are not listed on the SDN List.\n\nThe Services, including all related software, technical data and documentation, are \"Commercial Items\" as that term is defined in 48 C.F.R. 2.101. We provide the Services for U.S. Government end use solely in accordance with the following: (a) the Services are licensed only as Commercial Items; and (b) the U.S. Government will have the same rights as all other end users pursuant to these Terms. This customary commercial license is provided in accordance with FAR 12.211 (Technical Data) and FAR 12.212 (Software) and, for U.S. Department of Defense transactions, DFARS 252.227-7015 (Technical Data  Commercial Items) and DFARS 227.7202-3 (Rights in Commercial Computer Software or Computer Software Documentation). If a U.S. Government agency has a need for any additional rights, it must negotiate directly with Oculus to determine if the parties can negotiate an acceptable license amendment that must be included in any applicable contract or agreement.\n\n14. Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (\"DMCA\") and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Services and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nIf you believe that anything on or available through the Services infringes upon any copyright which you own or control, you may file a notification of such infringement with our Designated Agent as set forth below:\n\nDesignated Agent\n\nFacebook Technologies, LLC\n\n1601 Willow Road\n\nMenlo Park, CA 94025\n\nPhone: (650) 543-4800\n\nEmail: IP@oculus.com\n\nPlease see 17 U.S.C. 512(c)(3) (available at http://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n15. Hyperlinks\n\nYou are granted a limited, non-exclusive right to create text hyperlinks to our websites for noncommercial purposes; however, you may not use our logos or other proprietary graphics to link to our sites without our express written permission.\n\nThe Services may contain links to third-party websites, applications or other third-party services, and you understand that by accessing third-party links, you may be exposed to content that is offensive, harmful, inaccurate or otherwise inappropriate. You understand and agree that we are not responsible or liable for the availability or accuracy of such third-party properties or the content, products or services made available through such properties. We do not endorse or control such third-party properties and we make no representations or warranties of any kind regarding such properties. If you access or use any third-party properties, you should also be aware that such third parties terms and policies will govern.\n\n16. Disclaimers\n\n16.1 THERE ARE IMPORTANT HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS THAT YOU MUST READ BEFORE USING THE SERVICES, WHICH ARE AVAILABLE AT https://www.oculus.com/legal/health-and-safety-warnings. BY USING THE SERVICES, YOU REPRESENT AND WARRANT THAT YOU HAVE READ AND UNDERSTAND THESE WARNINGS AND INSTRUCTIONS. WE MAY UPDATE OR REVISE THESE WARNINGS AND INSTRUCTIONS, SO PLEASE REVIEW THEM PERIODICALLY. ADDITIONAL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS MAY BE PROVIDED BY DEVELOPERS IN RELATION TO SPECIFIC THIRD PARTY CONTENT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS BEFORE USING THE SERVICES.\n\n16.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK. AS BETWEEN YOU AND OCULUS, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS, AND OCULUS EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, OCULUS DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS, (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY OCULUS WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n17. Indemnification\n\nYou agree to defend, indemnify and hold harmless Oculus and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, \"Oculus Parties\") from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Services; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Oculus or a third party in relation to the Services; (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n18. Limitation of Liability\n\nTHE OCULUS PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SERVICES, EVEN IF AN OCULUS PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE OCULUS PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SERVICES. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n19. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH OCULUS AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM OCULUS (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n19.1 Binding Arbitration; Disputes; Small Claims. You and Oculus agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in San Mateo County, California, or, if you reside in the U.S., in a small claims court in your county of residence. \"Dispute\" as used in this Section 19 means any dispute, cause of action, claim, or controversy arising out of or in any way related to Oculus, these Terms, the subject matter of these Terms, or access to and use of the Services, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Oculuss intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Oculus empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n19.2 No Class Arbitrations, Class Actions or Representative Actions. You and Oculus agree that any Dispute is personal to you and Oculus, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Oculus agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n19.3 Federal Arbitration Act. You and Oculus agree that these Terms affect interstate commerce and that the enforceability of Section 19 shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (\"FAA\") to the maximum extent permitted by applicable law.\n\n19.4 Confidentiality. The arbitrator, Oculus, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n19.5 Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Oculus, you agree to first contact Oculus and attempt to resolve the claim informally by sending a written notice of your claim (\"Notice\") to Oculus. The Notice to Oculus must be sent by certified mail addressed to: General Counsel, Oculus, 1601 Willow Road, Menlo Park, CA 94025. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Oculus cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 19, commence an arbitration proceeding or file a claim in court. You and Oculus agree that any Dispute must be commenced or filed within one year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Oculus cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Oculus shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (\"AAA\"). In the event AAA declines or is unable to administer the arbitration, you and Oculus agree to use an arbitration forum or arbitrator that you and Oculus mutually agree upon. If, after making a reasonable effort, you and Oculus are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (\"AAA Rules\") then in effect. The AAA Rules and other information about AAA and arbitration are readily available at http://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Oculus agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, Oculus will pay all filing, AAA, and arbitrators fees and expenses. If the arbitrator issues you an award that is greater than the value of our last written settlement offer made before an arbitrator was selected (or if we did not make a settlement offer before an arbitrator was selected), then we will pay you the amount of the award or US $5,000, whichever is greater, and pay your attorney, if any, the amount of attorneys fees incurred, and reimburse any expenses (including expert witness fees and costs) that you or your attorney reasonably accrue for investigating, preparing and pursuing your claim in arbitration. We waive any right to seek an award of attorneys fees and expenses in connection with any non-frivolous arbitration between you and us.\n\n19.6 Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Oculus can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within 30 days of the date that you first became subject to this arbitration provision, and must include your name and residence address, the email address you use for your Oculus account (if you have one), and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: General Counsel, Oculus, 1601 Willow Rd., Menlo Park, CA 94025.\n\nIf a court or arbitrator decides that any of this section's limitations cannot be enforced as to a particular claim for relief, then that claim (and only that claim) must be severed from the arbitration and may be brought in court. Unless you choose to opt out, this dispute resolution provision in Section 19 shall survive termination of these Terms.\n\nThe courts in some countries may not permit you to consent to arbitration. If you reside in one of those countries, your countrys laws will apply.\n\n20. Governing Law\n\n20.1 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Services. Your access to and use of the Services may also be subject to other local, state, national or international laws.\n\n20.2 To the extent the provisions in Section 19 do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the United States District Court for the Northern District of California or a state court located in San Mateo County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims to the extent allowed by law. The courts in some countries may not apply California law to some types of disputes or allow you to consent to jurisdiction in California. If you reside in one of those countries, your country's laws will apply to such disputes related to the Services.\n\n21. Modifications to the Services\n\nOculus reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will Oculus be liable for the removal of or disabling of access to any portion or feature of the Services.\n\n22. Termination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n23. Severability\n\nIf any provision of these Terms is be deemed unlawful, void, or for any reason unenforceable, then that provision will be deemed severable from these Terms and will not affect the validity and enforceability of any remaining provisions.\n\n24. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Oculus, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n25. Nonwaiver\n\nAny failure by Oculus to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.\n\n26. Contact Us\n\nIf you have any questions or concerns regarding these Terms or our Services, please contact us through the support portal at https://support.oculus.com, email at contact@oculus.com.\n\n27. Special Provisions Applicable to Users Outside the United States\n\nCertain specific terms that apply only for German users are available at https://www.oculus.com/legal/terms-applicable-to-germany/. Please review these terms carefully if you reside in Germany.\n\nPRODUCT\nQuest\nRift S\nGo\nRift\nGear VR\nApps & Games\nMedium\nOculus for Business\nDEVELOPERS\nDeveloper Center\nDocs\nDownloads\nTools\nDeveloper Blog\nDeveloper Forums\nABOUT\nBlog\nCareers\nBrand Center\nOculus Connect\nResearch\nCOMMUNITY\nVR for Good\nLaunch Pad\nCreators Lab\nForums\nSupport\nOrder History\nDownload Rift Setup\nNewsletter Sign Up\nBy signing up you are agreeing to Terms of Service and Privacy Policy. You can withdraw consent at any time.\n Facebook Technologies, LLC.\nEnglish (US)\nPrivacyLegal", "Space Required": "739.4 MB"}



["5 stars\n91%\n4 stars\n5%\n3 stars\n2%\n2 stars\n1%\n1 star\n2%", "TheWatcher84Jul 28 at 9:30 AM\nThank you! I want more...\n\nThank you for teaching me how to use my new oculus quest. But after 200.00 later from looking for a game I can say its my favorite... I cant yet.., can you make a full game like the shooting one that is in first step ??! Or can anyone tell me what and where can I similar shooting moving blocks game like that? Thank you !!\n\nHelpful | 16", "Doomzoom07Jul 2 at 1:46 AM\nThe greatest opening\n\nThe introduction to the Oculus Quest starts with this amazing Disney style opening bringing you to the most imaginative tutorial I have ever seen where you:\n\nStack blocks, steer a blimp, shoot blocks flying at you, teach a robot to dance and many more\n\nMy only complaint is it was too short but not for people who have never tried VR (Like me).\n\nHelpful | 13", "janet.woodvilleJul 1 at 7:41 AM\nFirst steps\n\nThis is so fun. And the little guy is so cute. I love the demos that Oculus made to help us get the hang of the Oculus Quest. What caught my interest in the Quest was 1. Watching people throw popcorn  tomatoes and drinks in in the lobby in big screen. And drawing in mid air. And also learning that the VR experience was more advanced then the Go. You can move around your subject see it at different angles. Then I also watched these ladies playing Beat Saber on YouTube. After my Go was paid off I went on Best Buy looking for an Oculus Quest. Because of COVID-19 it was hard to get. But I would not give up. All 128gig were sold out. By day 3 I was told I could get a 64gig. I told guy, Ill take it. I figured, my Go is 64gig so why not? I love the Quest. Im keeping my Go because it has been discontinued and It has stuff on it thats not on the Quest. So I can the best of both worlds.\n\nHelpful | 10", "Connacemox9 days ago\nBest introduction to the Oculus Quest\n\nCould not be any better to start off and introduce someone to the wonderful world of virtual reality. You learn in a fun way how to use your virtual hands and how to interact with different objects.\n\nThe robot at the end is the sweetest and quite an experience to remember. Very well done.\n\nHelpful | 0", "Bravo-November7May 28 at 8:03 AM\nLove this! But I want more!\n\nThis has some great replay value. But the shooter game with the guns was just pure fun! In fact, it's better than a lot of shooters that are currently available in the Oculus store, even Pistol Whip! But it was just a small sample, unfortunately. Please create that sampler into a much bigger and separate game. I would buy it in a heartbeat!\n\nHelpful | 23", "MrCanada18 days ago\nGreat fun and fantastic introduction\n\nI've had my quest for a while now and figured I should start reviewing games, this experience is fantastic and shows newbies what they might expect what playing the quest might be like.\n\n\nIt's free and can be replayed anytime, why wouldn't you give it 5 stars?\n\nHelpful | 1", "sixpointe10 days ago\nAstonishingly delightful\n\nI knew things were about to get weird when I took a robots metal hands and started swinging my hips. Nonetheless, I closed the blinds and played with a remote control blimp and sailed onto the night \n\nHelpful | 0", "N16H7M4R3Apr 24 at 12:07 AM\nGreat tutorial!\n\nThe tutorial tells you what you need to know and how to use your controllers, its completely free and comes with your Oculus VR. It launches automatically if youre playing the Oculus VR for the first time. You have 2 mini games to chose from so you can get used to playing with the controllers and stuff like that. Best part is you can replay the tutorial if you want to its not like if you play it one time youll never play it again. In my opinion its worth 5 stars how about you?\n\nHelpful | 70", "clinton.larsonJul 29 at 5:04 AM\nWonderful way to introduce VR\n\nThis app was my first experience with the Quest and it was awesome. Ive used this app every time I show VR to someone new, and watching them play around with the rockets and the robot never gets tired, and they always come out smiling.\n\nHelpful | 0", "midorimondayJul 1 at 8:10 AM\nGreat for Beginners!\n\nThis is my first VR headset and this 'game' (along with First Contact) are great for beginners of any age.\n\nI play it often because it's so cute and I also let others play it who are using VR for the first time and they always have a such a great time.\n\nEven if you already know the controls, this is such a cute way to relax and have some fun with no 'end goal' like other games.\n\nHelpful | 2", "AuraionJul 24 at 2:19 PM\nI like this.\n\nAs a tutorial this was pretty awesome.\n\nIt's simple, colorful and included all the information on the movement controls.\n\nThat I got to play with them at the same time was entertaining. I think I'll just go tinker with the minigames some more...\n\nHelpful | 0", "Andrewplayz9041Jul 23 at 8:05 PM\nPerfect for any new VR user\n\nI just got my Oculus Quest (7/22/20) and I got this amazing experience. Want I like about this is that you can use this app over and over I have family members who have never used VR and this helped them understand how great VR can be.\n\nHelpful | 0", "IsabelleDoe24 days ago\nPlease add this robot to quest home!!!\n\nYes, the best introduction and super cute robot. PLEASE add this robot, dog, cat or fox? to the main quest home. Let them walk around or sit on the couch.\nBtw whats name of this robot?\n\nHelpful | 0", "Gabe827317 days ago\nGreat Tutorial\n\nThis is seriously a great game. Came only for the tutorial and found myself messing around in it for over an hour. Please add more features.\n\nHelpful | 0", "Rick_R-347Jun 13 at 8:32 AM\nIndispensable.\n\nI delete it over and over,cause I'm a pro at this point,just to keep downloading it because there is NO BETTER INTRODUCTION. Point blank period. Best possible first experience. And even when I'm totally out of new people to show it off to, I'll still have to keep it. Because since she can't really reach bogo's apples :~D hahaha all she wants is \"the desk! Let me play on the desk!\" Lol she's 4. Hey little hands can't quite wrap so she can only use of button at a time, it's that or 360 videos. And she loves it. That and first contact. The first time i saw her drop down and i knew she was crawling under the table to go chase get new friend! The feels. And when she tried to go back, and there's a step under the table. She knew there wasn't one in the house. She didn't know what to do, and it was adorillarious.\n\nHelpful | 2", "MasterDecoySGJun 25 at 1:32 AM\nIt's a quest tutorial\n\nPros:\nInformative - it elegantly teaches players how to use the headset without overloading the player with information.\n\nPre loaded and auto runs - you don't need to do anything on your first boot to get this title working.\n\n\nCons:\nDoesn't cover some common facets of vr controls - it doesn't teach about moving around vr environments, or about how to mitigate motion sickness which are pretty important topics about long term vr usage.\n\n\nOverall:\nI boot this up every time someone wants to try vr for the first time, it takes less than 15 minutes and almost everyone has gone from total novice to competent in a single play through.\n\nHelpful | 1", "Plumpy_Chump7 days ago\nPee Pee Poo Poo\n\nBest app on oculus\n\nHelpful | 0", "DinoCake9 days ago\nThere are exactly 1000 reviews\n\nSo I ruined it.\n\nHelpful | 0", "IfanSOJul 29 at 1:00 PM\nIncredible intro to the worlds of VR\n\nThe gameplay works really well and this is one of the greatest ways to introduce new beginners to VR\n\nHelpful | 0", "HeatherKay67Jun 23 at 4:13 PM\nNeeds to support sitting\n\nAs a full-time wheelchair user, I bought the quest for therapeutic value. The ability to go places I can only dream of. However, this app starts upon first use of the headset, I set up a static Guardian and then found I was stuck after making a fist and pointing a finger, there is no button! I couldn't find a way out and had to press buttons madly ending up in the menu, only to discover that this app is useless for sitters to get the basics of VR. Please change this! I can't be the only one.\n\nHelpful | 8", "Spudmcd12322 days ago\nHad fun till my quest crashed\n\nWhen I put a cartridge in my quest froze so I went on Google and held down my power button and the volume buttons a it sent me to I bois menu click launch device and it was all back to normal never launching that app again\n\nHelpful | 1", "Pizzaboygame996Jun 29 at 2:58 PM\nGreat Introduction to the Controllers\n\nIt tells the user every single fact about the controllers and it also gives the user a lot of stuf to play with using your virtual hands! And my favorite part is playing the little mini games!\n\nHelpful | 1", "AlecjnJul 26 at 12:36 PM\nCouldnt be better, nothing else to say\n\n10/5 stars\n\nHelpful | 0", "FortIsSTillApr 14 at 1:18 PM\nOh. My. God.\n\nOk. Lets get this straight. This is a quest only title. But its a great one.\nI got my quest today. I saw enough setup videos. I set it up by myself and when I Put it on, I was introduced to the Oculus Quest. I danced with the robot. Cute little guy. And then I said goodbye. Its a short amazing experience and I highly recommend it.\n6/5\n\nHelpful | 7", "DiceHunt3RJul 14 at 8:04 AM\nPerfect\n\nPerfect for the first experience with VR!\n\nHelpful | 0", "AidenGamezJul 12 at 3:52 PM\nGood \n\nFour words. Dancing with a robot. Do I need to say more?\n\nHelpful | 0", "JakeconerMar 5 at 2:45 PM\nYou get what you get\n\nIt comes with your Oculus Quest and it the first thing that plays when you launch quest for the first time. It good when you consider that; however, dont expect anything great for long term. But amazing for first time users. However, I wish there was a bit more for long term use. Rather then it being one and done.\n\nHelpful | 22", "katie.bradyJun 10 at 8:10 AM\nBest place to start\n\nNot very deep in terms of things to do but its very simple, fun and a really good introduction to anyone trying VR.\n\nHelpful | 1", "WolfybitzJun 4 at 6:53 AM\nAmazing\n\nIt's really fun and great introduction\n\nHelpful | 2", "VRtuality23520 days ago\nNice Nice Nice Nice Nice Nice Nice Nice\n\nNice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice Nice\n\nHelpful | 0", "TheFithElement1997Jun 12 at 12:00 AM\n\nAmazing! Best game to introduce the oculus experience\n\nHelpful | 0", "TimmyVR007May 28 at 9:06 PM\nFun little VR demo game\n\nAs a demo of what VR can do this game is pretty good. The robot is cute and his dance moves are hilarious.\n\nHelpful | 0", "ducky2020Apr 16 at 11:44 PM\nBreathtaking\n\nFirst time using VR and I loved it. Made me feel like I was in the Tron movie. I loved dancing with the robot.\n\nHelpful | 5", "dvazanaApr 19 at 12:34 AM\nPerfect welcome to a new reality\n\nI cant believe Id never experienced anything like this before. The fact that it only gets so much better from here is almost frightening to me!\n\nHelpful | 3", "SeveremanykillsMay 24 at 12:38 AM\nAmazing first app\n\nFabulous\n\nHelpful | 1", "Salsaslayer05Apr 28 at 4:08 PM\nGreat way to start!\n\nGreat tutorial and overall it just looks beautiful\n\nHelpful | 4", "MR.MOMMY123Jun 1 at 10:30 AM\n\nLove it\n\nHelpful | 0", "MaelwolfApr 19 at 10:51 PM\nA Fine Intro\n\nWorks fine to introduce people into the system. I thought it could have explained hand movements a bit more as pretty much every new person I had try it struggled with that.\n\nHelpful | 4", "chad.hertlerMay 20 at 7:17 PM\nAbsolutely stunning!\n\nNuff said.\n\nHelpful | 1", "AnnaDozJul 19 at 8:49 AM\ni dont like your game\n\nit is not good it is the worst game i have aver played\n\nHelpful | 0", "KieranCollinsMar 21 at 2:25 AM\nLearning experience\n\nIts the first game you should play once you get your first VR. Besides it being a learning experience, its also a great looking game and also kind of fun and entertaining to the point where I consider going back to it once in a while to see all the great visuals again.\n\nHelpful | 2", "Quinn5545Jun 23 at 4:26 PM\nWow\n\nThis is hands down the best introduction to VR ever, it guides you through the fun world of VR while teaching you the simple mechanics. I show this too all my family and friends for their first experience of VR.\n\nHelpful | 0", "andyj99Dec 4 at 4:41 PM\nGreat to start the show\n\nSO immerse, and impressive off the bat. The mini games are a lot of fun, and I could just hang out at the main table figuring out how to hit a ping pong ball and throw paper airplanes. The dancing robot was surprisingly entertaining even though I heard about it beforehand. The lazer gun too! Definitely a good start to show off what vr can do.\n\nHelpful | 61", "AphariscFeb 2 at 1:30 AM\nMy First Look into 6DOF Roomscale VR!\n\nThis was my first proper roomscale experience, I have used Oculus Go and Gear VR but oh my god is this great! Right off the bat it shows you the power of the Quest and just how it works. To be honest, it shows you this game right when you set up your headset, you already know what it is and what it is about, but for me and so many other people this is a great introduction to standalone roomscale VR.\n\nHelpful | 2", "Brahma9Apr 1 at 3:08 PM\nGreat FreeBee!\n\nGreat starter game for when you first get used to the Quest!\n\nHelpful | 1", "Franziska_ConstanzeJun 12 at 10:25 AM\nFantastic and great to understand oculus\n\nI did this tutorial so many times! It is extremely intuitive and exact in your movement! We love it at home! Wish this world would be a proper game with more options! I would pay for this!!\n\nHelpful | 0", "KwadwoaaApr 2 at 8:18 PM\nFantastic intro to VR on the Quest\n\nGreat experience\n\nHelpful | 1", "StrangeFlameJun 27 at 11:45 AM\nTop Shelf Tutorial\n\nLove the capabilities of the buttons to mimic digits 4:1 and 'scale/flex.\n\nHelpful | 0", "grey_manJun 22 at 5:38 PM\nNeed headset but looks cool!\n\nIm going to need to get to know its controls better, so this looks helpful, though I dont know for sure because I dont have a headset.\n\nHelpful | 0", "HairybuttchinMar 27 at 1:26 AM\nGreat!\n\nThe perfect little Vr experience that show off what VR is..I really enjoyed it alot when I first fired up my Oculas Quest..I wish it wouldn't end so quickly.\n\nHelpful | 1", "crenmor1May 28 at 10:13 PM\nThis thing is sick!\n\nI've had a couple of vr gaming headsets but this thing is the bomb! Guardian, by itself, is worth the price of admission. This intro to serious vr is just great. Not enough adjectives!\n\nHelpful | 0", "SimJooMar 14 at 6:21 AM\nGreat introduction\n\nAlways start with this when introducing friends to the Quest.\n\nHelpful | 0", "Juness_spikeary09Jun 25 at 8:48 PM\nJuness\n\nCool game it sorta scared me at first\n\nHelpful | 0", "KrispyCabbage_Mar 12 at 2:27 PM\nBest tutorial\n\nNever seen a better start to getting a console in my life.period.\n\nHelpful | 1", "broly.jr2Feb 24 at 1:55 PM\nGreat way to introduce friends to VR\n\nWhen it comes to showing family and friends VR is great and watching them freak out is awesome and that is why I love this app\n\nHelpful | 0", "Rade0nFighterFeb 7 at 5:06 PM\nWhat an intro to VR\n\nGets you on you feet without even thinking about it. Too busy focused on the VR magic!\n\nMy go to first step when introducing someone to the quest - guaranteed smiles and gasps of awe and joy for any first timer!\n\nHelpful | 0", "felixableJun 14 at 12:42 PM\nMust have and re do like 1000x\n\nNo matter you are new to VR or not, this is a must do tutorial!\n\nHelpful | 0", "Black_NapalmFeb 5 at 10:46 PM\nMy First Experience in Quest...\n\nPick up the rocket\nPull back the pull-tab\nWatch it fly up into the sky\nWatch it fly back down\nCATCH IT IN MID AIR\n\nBuy Quest \n\nHelpful | 2", "cbain75Jan 6 at 2:09 PM\nAMAZING\n\nLiterally there is no point in even leaving a review because everyone gets this experience with an oculus quest but just to prove a point , this little experience wows anyone. Everyone who I let try this wants to get an oculus quest. Its a great way to introduce anyone to the quest.\n\nHelpful | 7", "VRMasterguyJul 2 at 1:40 PM\nI dont have a vr headset\n\nseems like a great totoria but sadly I dont have a vr headset I wants\nOne so baddddd\n\nHelpful | 0", "Nick2108Nov 22 at 7:25 PM\nIncredible\n\nThis was the introduction to the VR expire fr and was absolutely breathtaking. Im new to VR but this experience showed how amazing this will be. This excites me so much for whats to come. I might play around with this more often.\n\nHelpful | 21", "rattleheadxyzJan 5 at 7:52 PM\nTruly Magical and Absolutely Necessary\n\nSimply put: This needs to be the very first thing you or anyone else who will be using the Quest needs to play. It will help the user understand the capabilities of the Quest and VR in general. Also, the experience I had with the robot was nothing short of revelatory!\n\nHelpful | 2", "ninjabikelyfeJan 18 at 9:03 PM\nbest opening trainer!! i love it\n\ni love this tutorial and training simulation, the robot also one me over.\n\nthe airplanes and rockets and just everything. even if a person knows how to use the quest, i still think they should play this for pure fun lol.\n\nHelpful | 0", "nzdockerFeb 12 at 12:33 AM\nBloody awesome\n\nThis shows the quest has so much potential! Can't wait to delve further into this new world.\n\nHelpful | 0", "Vr_Girl2019Dec 26 at 6:57 PM\nGreat tutorial!\n\nI think this tutorial is just amazing! When I came in I saw the intro, I thought it was beautiful! First theres a ball of light that explodes (not like TNT)\nThen a beautiful world that forms and its just great! When you get into the real tutorial it shows you how to use the remotes and you get to interact with glowing cubes, ping pong ball and paddle, a punching bag, those little rockets that shoot confetti, and even a remote control air ballon! And after you have interacted with them, it gives you two in games for you to play. The first one is a target shooting game, second one is a game with a robot that you can interact with. I think this game is very helpful and I hope more people use this tutorial.\n\nHelpful | 1", "Husker1224Jan 25 at 7:41 PM\nGreat for first time players\n\nThis is a great first experience when I introduce people unfamiliar with VR. Its my go to game! Well done for both a fun tutorial and interactive experience!\n\nHelpful | 0", "SlickAustinDec 27 at 1:11 PM\nI can see why you like this so much\n\nMy parents got me the Quest for Christmas, and since my dad is already a gamer he wanted to try it out. Had him load this up, and he was blown away. He was absolutely immersed and had a lot of fun with the blimp! The title of this review was what he told me while playing it. Definitely let this be the first experience a new user tries, its perfect!\n\nHelpful | 0", "PauliuwJan 27 at 12:34 AM\nAmazing introduction\n\nThis was my first VR experience and I was stunned, also a great way to teach and introduce friends to VR as well!\n\nHelpful | 0", "tgckenJan 11 at 11:55 AM\nLives up to the charm of First Contact.\n\nPutting quest on for the first time and experiencing this brought back the magic of First Contact. The shooter mini game is great and I hope to see more simple pass and play games like it.\n\nHelpful | 0", "Jeff.May45Dec 19 at 4:52 PM\nFirst timer\n\nWhen I first turned on the Quest, I was so flabbergasted. I loved the whole intro and then to top it off the mini games to learn how to operate everything. I could have stayed there all night. This is my first VR experience and so disappointed I have not tried it before. I am so excited to see what the future will bring, it can only get better than what it is now and cannot wait.\n\nHelpful | 1", "rhino_0902Feb 8 at 9:05 AM\nGreat to get to know the controls\n\nFirst steps is great for beginners. When I first started this game really helped me . A lot of people think first steps is amazing but there is hundreds other games in the oculus store.\n\nThere is one thing they need to improve on like there isnt much thing to play with on the table .\n\nHope you like playing the Virtual Reality head set.\n\nHelpful | 0", "syberkittenMay 12 at 2:58 AM\nAmazing intro, feels like the matrix\n\nGreat concept as tutorial and really draws you in to stay.... !))\n\nHelpful | 0", "GiganorausJan 19 at 8:59 AM\nMindblowing\n\nFor a person who has only ever used google cardboard, this blew my mind. It is a great experience to get thrust into after setup.\n\nHelpful | 1", "sydneyann63Jan 4 at 1:47 AM\nSo joyous\n\nIve had my Quest for about a month and a half and hadnt gotten around to playing this, but its quickly become one of my favorites. Dancing with that little robot makes me so happy inexplicably happy\n\nHelpful | 0", "Conyazo06Feb 1 at 8:01 PM\nWonderful\n\nGreat way to start and introduce others to what is, Oculus.\n\nHelpful | 0", "adamkanderson03Jan 26 at 12:17 AM\nEpic\n\nI can fly the remote control blimp for hours ngl along with throwing the paper airplanes\n\nHelpful | 1", "dhenkeJan 26 at 5:32 AM\nGreat Introduction into VR\n\nThis is a go to app when introducing people to VR. I've played it like 5 times myself.\n\nHelpful | 0", "mrbannacowJan 31 at 4:01 PM\nHi\n\nMe havent play game yet Heheheheh\n\nHelpful | 0", "April-Attari_88Dec 25 at 2:11 PM\nGreat start\n\nThis is great to learn how to play and its even better to pass the time it may be a tutorial but it has lots of things to interact with, and I dont have to many games and just want something to play with\n\nHelpful | 0", "christianmooneyDec 25 at 8:24 AM\nthis was great\n\nright away it has an amazing intro and i spent about 5 minutes just at the table my dad and little sister found it great snd so did i my litttle sister adored the dancing minigame and my dad loved the shooter\n\nHelpful | 0", "doornMar 24 at 3:09 PM\n\nEver since I played there had been a red dot in my vision all the time, how can I fix this?\n\nHelpful | 0", "omidk414Dec 25 at 5:31 PM\nA Must for Beginners\n\nGreat starter game that teaches the user about how to get into vr. Easy to learn and have fun with, and is a great way to teach friends and family. Overall a must for newcomers.\n\nHelpful | 2", "alex.in.vr.9Jan 18 at 5:53 PM\nGreat intro to VR\n\nFantastic intro to VR!\nVery short but it's free so that's fine!!\n\nHelpful | 0", "DejaVu_VRDec 27 at 1:24 PM\nAmazing intro to the VR!\n\nIf you are new and never tried VR before, you HAVE to try this intro. It is simply mindblowing. Im new to VR and i was wowing the whole intro. Great job Oculus!\n\nHelpful | 1", "Carreiro_Nov 27 at 3:39 PM\nAwesome experience\n\nThis was the first VR experience I had for the Quest. It was and still is awesome. When showing people VR this is one of the things I have them do first. It teaches them some essential skills, and visually looks great. My kids enter this experience over and over...\n\nHelpful | 5", "TorebinApr 19 at 6:57 PM\nAMAZING FIRST EXPERIENCE\n\nI got an oculus quest today and I played this game when I put the headset on, it was AMAZING\n\nHelpful | 0", "spudwrenchJan 17 at 9:34 PM\nGreat to show new comers\n\nI was really surprised by this and the visuals are really nice and relaxing. For some reason I had more fun stacking the boxes and pushing buttons. Something to be said for pushing virtual buttons.\n\nHelpful | 0", "CircusErrorJan 7 at 1:54 AM\nPrecious Robot be Vibin\n\nIve only known robot bby for a day now but if anything happened to him id harm eveyone in this review\n\nHelpful | 1", "SpaceBoy619Dec 21 at 3:44 PM\nAmazing immersive experience\n\nI played this myself and showed it to other members of my family to try out. At the end of the experience , they felt so connected to Bogo !! Awesome free experience\n\nHelpful | 0", "MalteseF1Dec 29 at 6:05 PM\nAwesome\n\nWhat a great way to start your virtual reality experience with not just yourself, but with your friends and family!\n\nHelpful | 1", "jaydegeerDec 24 at 2:49 PM\nStart it up\n\nAwsome beginning or tutorial, I mean awsome. A must play before you take the adventure of a lifetime through the quest. Mind blowing fun.\n\nHelpful | 0", "Toir.E1Jan 13 at 11:13 PM\n\n\nRobot... FAINT\n\nHelpful | 0", "damianmoreno2009Dec 28 at 9:35 PM\nBest learning vr experience\n\nThis game is great for starter and sometimes I start playing it for fun this game is amazing\n\nHelpful | 0", "derpy_wolfi666Dec 25 at 4:58 PM\nGreat tutorial game!!!\n\nThis game is a great tutorial for the VR world! It will teach you so much,so if your new...PLAY THIS GAME!!!\n\nHelpful | 0", "getwreckedson11Dec 25 at 3:25 PM\nI feel like a Disney princess\n\nThis is so simple, but so cool and so immersive. I love showing this to people and seeing their reaction!\n\nHelpful | 0", "BossloreyJan 10 at 6:49 PM\nAmazing\n\nA great intro to VR\n\nHelpful | 0", "vandisarDec 25 at 3:59 PM\n\nAmazing introduction to the machine and controls that is still gorgeous visually and a lot of fun!\n\nHelpful | 0", "ColzzDec 25 at 4:13 PM\nFun\n\nThe gun game is fun the robot game is creative and charming it gave me and my family a ton of joy\n\nHelpful | 0", "ZapwagDec 26 at 11:23 AM\nGreat tutorial\n\nTaught me how to use VR super quickly and was really fun, I've replayed it a few times\n\nHelpful | 0", "rachel.lau.56863Dec 21 at 9:04 PM\nAwesome\n\nFor me I just got an early present and this is swell. I love how it explains it then gives two games with it\n\nHelpful | 0", "Darkshadow1578Dec 25 at 3:34 PM\nAmazing\n\nI think this game is perfect introduction for the quest really a good game \n\nHelpful | 1", "Smug_BabDec 25 at 10:52 PM\nHelp, I got attached to the robot\n\nI got attached to the robot in an instant when it wanted to dance with me :)\n\nHelpful | 0", "Duck_GamesDec 25 at 8:06 PM\nImmersive\n\nThe most immersive experience I have ever had in all my years\n\nHelpful | 0", "eigenlautDec 11 at 7:19 AM\nPerfect Entry Experience for Quest\n\nShow this to people new to VR, your friends, your family - this is the perfect first time experience for them.\nFREE but excellent.\n\nHelpful | 0", "keznathDec 3 at 8:07 PM\nIncredible\n\nWhat a way to introduce the quest to a new user, fully immersive and gives a great tutorial on pretty much all controls! Mind blowing how smooth everything runs!\n\nHelpful | 0", "HudsonYDec 22 at 7:33 AM\nSo GREAT\n\nIts Short but so Fun So Much Interactivity And Everything\n\nHelpful | 0", "FrankTheTankv90Nov 23 at 10:30 PM\nI am Spechless\n\nMy first ever VR Experience Will always be the best experience ever! After playing this my thoughts are the future is gonna be awesome more then we thought!\n\nHelpful | 4", "WilmatronDec 4 at 1:17 PM\nFantastic intro to VR\n\nGreat little app to introduce those not accustomed to VR. The shooting game is particularly fun and the dancing robot is great for the kids!\n\nHelpful | 0", "davidtshDec 19 at 11:16 PM\nBest intro\n\nIntroducing the VR experience with this is amazing.\n\nHelpful | 0", "ZixtleDec 3 at 5:41 PM\nGood for a first game\n\nIf any of you don't like dancing with that little CUTE robot, you need to rethink your life.\n\nHelpful | 4", "WhiteObamaJan 10 at 10:40 AM\nProblem\n\nCan you help me out, every time I try first steps Im like in the ground, it doesnt see me standing. Nothing is near me and I cant do anything because it thinks Im on a floor and i cant even have fun that way.\n\nHelpful | 1", "ExpGamer234Dec 25 at 11:01 AM\nBEST TOTORIAL ever\n\nEpic\n\nHelpful | 1", "rubyscarletDec 28 at 4:28 AM\nNcbrnsn s\n\nIhrbdbdbd\n\nHelpful | 1", "KingOfSlimesDec 25 at 5:52 AM\nGreat start\n\nThis is a great game to start with, it shows what you have to do and its so interactive and FREE!\nThat little robot is so fun and feels like your dancing with a real person!\n\nHelpful | 0", "Gavinps826Dec 24 at 1:34 PM\nTrk\n\nGig\n\nHelpful | 1", "steve1253Feb 15 at 1:30 PM\n\nI can't even get to the game so how am I supposed to have FUN!!!!!!!\n\nHelpful | 0", "medloulou2009Dec 9 at 11:41 AM\nEasy and immerse first steps\n\nFully recommend to start here and get to know your VR headset\n\nHelpful | 1", "Jackie1245Dec 1 at 4:52 PM\nEverything about this is amazing\n\nI was super excited to get the quest and I was not let down it is so amazing and especially this little game !\n\nHelpful | 0", "maazomaazoNov 24 at 9:55 PM\nExcellent intro for newcomers.\n\nDelightfully done. I start here with everyone new to the Quest.\n\nHelpful | 2", "atlas_531Jan 27 at 6:36 PM\nGreat, almost\n\nMy only complaint is the second game is very confusing\nAnd its not clear what to do. Otherwise its great,and teaches well.\n\nHelpful | 0", "bluecobleDec 10 at 8:06 PM\nFun\n\nFun way to get you used to the mo emebt and boundries.\n\nHelpful | 0", "Link29011Nov 29 at 5:01 PM\n1 problem...\n\nIt is great but... why is the comfort moderate if this is the first thing you see when y you get a quest?\n\nHelpful | 0", "wrubtubeOct 19 at 12:31 AM\nLittle robot buddy\n\nThis Quest is my very first VR experience. Never tried it on anything else, and i am so happy that the very first playable game, was this. I immediately became so emotional and uplifted after seeing my little hands in the beautiful digital scenery around them.\n\nAnd then...\n\nThe dancing robot.\n\nOh.my.god.\n\nI would take a bullet for this little bundle of happiness. This little dude is so adorable. Ive never danced so hard in my life!\n\nHelpful | 0", "Cookiecute516Oct 30 at 11:43 AM\nBeautiful\n\nThe opening blew my mind when I first saw it, it was like being in a Disney film. The tutorial was fun to mess with for more than several minutes and I enjoyed getting high scores replaying the mini Games. Great introduction to the Quest\n\nHelpful | 1", "BGPabloOct 15 at 5:23 PM\nShort & breathtaking\n\nAn absolute perfect way to showcase the immersion of VR. A real treat to experience, but the lack of depth depth seems to encourage and excited about what could be done in VR.\n\nHelpful | 13", "Lazer241Dec 3 at 7:16 AM\nAmazing\n\nTaught me all about using the Quest\n\nHelpful | 1", "EdigsSep 8, 2019 at 1:53 AM\nProbably the best introduction to VR yet\n\nIt's just perfect. It makes you familiar with Touch controllers and teaches you pretty much everything you need to know before you dive in further.\n\nAnd then there's this little robot... probably the cutest thing I ever saw in VR! He fully deserves his own dancing game! I and everyone else I demoed Quest to couldn't stop laughing and smiling through that part.\n\nHelpful | 6", "txskullmeisterNov 25 at 12:09 AM\nSweet little robot!\n\nMy daughter absolutely loves the little robot. Lots of fun and a great intro to VR.\n\nHelpful | 0", "sumoraoNov 26 at 8:52 PM\n\nBest way to introduce someone to VR\n\nHelpful | 1", "Captain_PumpkinheadOct 19 at 4:03 PM\nGreat tutorial!\n\nThis is what I show all my friends when I have them try VR for the first time. Great way to get your bearings on how to use this device!\n\nHelpful | 4", "DevilyanshNov 21 at 8:37 PM\nAbsolutely\n\nGorgeous\n\nHelpful | 0", "MoneybagvrNov 8 at 6:35 AM\nFree\n\nI love this help people understand vr controls\n\nHelpful | 1", "Manlyman21Nov 13 at 8:10 PM\nI love the robot it so cute\n\nThe title is my review\n\nHelpful | 0", "RickSanchez12Nov 14 at 12:40 PM\nYes\n\nThat was amazing\n\nHelpful | 0", "BlueCoderMBHDec 2 at 1:51 PM\nI can't push ...\n\nI can't push the red button with my index! The button goes below my couch, and I keep touching the couch first.\n\nHelpful | 0", "Sebulan2049Oct 9 at 1:08 PM\nBeautiful\n\nA short and sweet free VR experience that introduced me to the world of VR. I will never forget it and anyone who is new to this should definitely give it a shot.\n\nHelpful | 3", "YoanPerez82Oct 25 at 11:47 PM\nAmazing demo, first thing to do\n\nAmazing demo, this is definitely the first thing I will put for first time users!\n\nHelpful | 0", "Hazey113Dec 25 at 1:19 AM\nGood for people whove just started vr\n\nIts an amazing experience for beginners or really experienced people\n\nHelpful | 0", "StodgyKittyAug 24, 2019 at 1:11 PM\nFantastic\n\nThis game is an amazing first experience in VR, and it will blow anyones mind. I showed it to all of my family, and every one of them was amazed. If you want to show someone whos never seen VR before a game, this is the one.\n\nHelpful | 16", "Tekkers-Sep 12, 2019 at 9:59 AM\nAmazing first experience!\n\nGot myself an Oculus Quest today and it's the first thing I've done on it. Really shows off the 'wow factor' of VR. This is the first thing I'll be putting on for friends and family when they come round. Nothing too complicated or intense. Overall, a great little piece of VR fun \n\nHelpful | 0", "rusklas3408Oct 21 at 2:06 PM\nOculus did a great job\n\nThis is amazing, its a cute way to show new players how to use a VR system\n\nHelpful | 0", "BoatLordMay 23, 2019 at 3:57 PM\nI will protect that little robot\n\nWith. My. Life.\n\nAmazing work on the Quest in general and this experience is *literally* mind-blowing for a first time VR user. The awe and wonder of the scenery, the amazement at staring at my own VR hands, and the joy of picking up little blocks and paper airplanes takes you to such a happy childlike headspace - the dancing robot runs off on this feels and you're jumping around elated with them.\n\nGood job!\n\nHelpful | 212", "glass_spartanSep 28, 2019 at 9:09 AM\nPerfect first VR experience\n\nThis is the game I will make my friends and family play first. The interactions and physics are perfect!\n\nHelpful | 0", "frikiconsoleroAug 31, 2019 at 1:52 PM\nGreat start for new VR users\n\nA great way to start in VR. Nice graphics, you can grab a lot of things, learn the basics, you can feel the sensation to be in a new world. Special mention to the dancing robot, you feel he is your new friend on VR : )\n\nHelpful | 1", "EBattiSep 28, 2019 at 6:56 PM\nAmazing start/tutorial\n\nThis game needs NO introduction, it explains itself\n\nHelpful | 1", "judyy19Aug 8, 2019 at 2:42 PM\nDEFINITELY\n\nThis game is so fun. It lets you interact with objects that will get you prepared for the real world of VR. The robot, this little friend of ours will bring you so much joy. I will definitely want to back to dance with this little guy. The shooting game is great, it lets you choose between 3 (one weapon include 2 with a left and right guns) weapons. This is a fun game to go back to and introduce new VR players.\n\nHelpful | 1", "trebek4ssbuSep 27, 2019 at 6:08 AM\nGreat tutorial\n\nYou actually want to play it\n\nHelpful | 0", "blablablabla4Aug 10, 2019 at 11:50 PM\nUnder estimated\n\nPeople will think because this is just an instructional app for free it wont be as good but its a blast that I always come back to. It amazes me how many of the best apps are either free or less expensive. But this lets you feel VR more than others.\n\nHelpful | 1", "LoraleiBJul 19, 2019 at 9:34 AM\nAmazing!\n\nThis game lets a ton of people know how the Quest works. When you first get the Quest, You already have this game, so you dont need to forget stuff. When others play on my Quest, I set a requirement that you must play this game in order to understand the Quest. A ton of my family members were shocked when they played it. The looks of the game are so cool! I was even shocked by this game!!! The robot in the dancing game is super cute! Every time I saw the robot, I wanted to hug him! I nearly played with every toy connected to him and me! Anyways, This game is like how VR works and Oculus First Contact show different kinds of thing you can do! This game is really helpful to those who never played a VR headset before.\n\nHelpful | 7", "DicBacSep 11, 2019 at 8:10 PM\nAbsolutely amazing\n\nJust breathtaking to see all the things that come to life with the oculus.\n\nHelpful | 1", "timbusbeeJul 17, 2019 at 11:35 AM\nThe First App\n\nAnytime someone wants to play my quest for the first time I make them play this game/tutorial. When I tell them its a tutorial they always complain I just want to play man! Is what they say. 2 mins into this and they dont want to put it down. Kudos on making something that explains the Oculus and is super fun.\n\nHelpful | 5", "fieryspirit1Aug 24, 2019 at 1:33 AM\nBetter than First Contact\n\nFor introducing someone to VR, this app does a perfect job. Watching people's amazement as they pick up objects and play with them is incredibly satisfying.\n\nHelpful | 1", "lil_finnaJul 26, 2019 at 6:03 AM\nThe Best Opening There Could Possibly Be\n\nWhen I finished setting up my guardian, I thought I was going to be transported to some kind of home screen. What followed blew me away. It was then that I realized the capabilities of virtual reality. The simplicity of the tutorial and the fact that you had fun with it was astounding and surreal. The two mini-games included in the tutorial are equally as fun...\n\n\nAnd it made my dad laugh and grin when he tried it.\n\nHelpful | 0", "PeterJonesSep 8, 2019 at 12:25 PM\nPerfect to learn!\n\nEveryone needs to do this furst to learn Guardian and control. Perfect!\n\nHelpful | 0", "PhenoramJul 5, 2019 at 9:19 PM\nNeeds Work\n\nIt's mostly a good tutorial. I use it, but only because there's not another tutorial. There are a lot of positive reviews and I think they hit the main points so I'll focus on the negatives.\n\n-The touch demo is integrated into the app, so you can't teach the controls separately.\n-You have to interact with every kind of object in order to advance. If someone is struggling to work the controls there's no way to push through the tutorial to the next step.\n-The 2 demos (shooting and dancing) can only be accessed by completing the tutorial. You can't just show someone those without completing the rest of the tutorial.\n-The dancing is too long. It's fun and there's novelty to it, but everyone I've shown has shown signs of disinterest by the end. I've had dozens of people at different ages try this.\n\nHelpful | 27", "itsDavidDugganJun 16, 2019 at 5:54 PM\nSurprisingly Great!\n\nFor an intro game, this is incredible. The whole experience is fantastic and really shows off the quests capabilities. I have replayed this already and think it's a great experience to show off to friend for their first time in VR. With great music and surprisingly good graphics this experience is a joy to play.\n\nHelpful | 6", "robobbySep 1, 2019 at 4:37 PM\nTHE ROBOT IS MY FAVORITE\n\nHE DANCES WITH YOU AND DOES FINGER GUNS!!!!!!!!!! HE THE BEST\n\nHelpful | 2", "NSS-Aug 24, 2019 at 10:43 PM\nA beauty to the eye\n\nExcellent experience for a 1st timer. I found myself coming back to look at the beauty of this place.\n\nHelpful | 0", "sexsarAug 7, 2019 at 8:21 PM\nGreat first steps\n\nReally liked it, was the first demo played on my oculus quest, teached to hand and use the hand controllers and the space around me.. I really enjoyed 100%\n\nHelpful | 0", "Grizzy-TheKiwiAug 5, 2019 at 12:30 AM\na great introduction\n\nthis a great first experience to try before going into the market and trying other virtual reality games. it helps gives you a strong understanding of the basics.\n\nHelpful | 0", "Gazlfc6timesJul 19, 2019 at 3:28 AM\n\nI agree with all the other comments! As soon as I started this I knew my money for the quest was going to be worth it. Fantastic learning demo to start you off. And shows the potential of whats to come .Fantastic work from oculus.\n\nHelpful | 0", "pixelaiAug 3, 2019 at 9:11 AM\nGreat\n\nGreat great great Great great great Great great great Great great great Great great great Great great great Great great great Great great great\n\nHelpful | 0", "lexzzarre348Aug 21, 2019 at 5:10 PM\nPerfect\n\nWell it is perfect, nothing else to say.\n\nHelpful | 1", "FehgiustiAug 27, 2019 at 10:35 AM\nFantastic\n\nGame\n\nHelpful | 0", "obi2kenobiMay 21, 2019 at 5:09 PM\nBlew me away\n\nI thought this would be a boring tutorial but I was blown away and got super into it. I was beating some sort of \"tether ball\" and accidentally hit the ceiling with my controller. Hoping oculus can make some kind of vertical boundary for us tall folk. Dancing with the robot was fun too because no one is watching so no pressure at all lol the whole thing was a blast. Maybe not too much replay value but great way to show off Quest. My wife has been hating on Quest since I preordered it and I got her to put this on and she couldn't help enjoying herself.\n\nHelpful | 19", "lasmooopAug 24, 2019 at 4:15 PM\nI haven't played it\n\nI it looks nice\n\nHelpful | 0", "bigftamAug 22, 2019 at 7:38 AM\n\nExcellence!!\n\nHelpful | 0", "FollowWingsJun 16, 2019 at 9:59 PM\nSatisfaction\n\nWelcome from mid Europe, Hungary!\nThis thing is shocked me, at the First Steps! It was and still it is unbelievable Awesome!! Trust me I did and experienced many things (, bad things too) in my life, but this Gem beats down everything!\nI felt like I could live forever inside First Steps room, and its just the beginning. I can truly do anything inside what I want. At some point I wanted to set the headstraps, but take of the knuckles first and realized I wanted to take them off to the virtual table lol. :D Hilarious how easily your brain get used to it. Its a magic! My father said wtf you spent so much money to this piece sht... till I could speak him to try it on, and you should see his happy face after. He said it worth the money for sure! Insane technology, a real Magic!\n\nHelpful | 0", "Luggnutt612Aug 5, 2019 at 2:33 PM\nGreat intro to VR\n\nWell done. Appropriate complexity and duration.\n\nHelpful | 0", "ShouldYouPlayThisAug 12, 2019 at 12:20 PM\nYes\n\nYes, but the tutorial can be confusing for people new to VR, just make the intro skippable. Yes\n\nHelpful | 3", "BoyajianAug 3, 2019 at 12:04 PM\n\nAmazing experience\n\nHelpful | 0", "gem2113May 28, 2019 at 3:07 PM\nSo good!!\n\nA free tutorial type thing, but honestly this is better than some of the games Ive paid for. I loved learning about the controls while I played around with things in my world. At one point everything went too far out of my boundary and I was trying to hit a button that had conveniently been placed in my sock drawer. But once I managed to find a bigger room, I didnt have that trouble. I love this experience and I have shown it off to lots of people. Really great job!!! Maybe our little robot friend could have his own game??? I would buy that...just saying.\n\nHelpful | 3", "That1gamer1200Jul 30, 2019 at 3:43 PM\nGood\n\nYep\n\nHelpful | 0", "zachtech7May 20, 2019 at 12:48 PM\nAmazing\n\nA flawless introduction to the amazing features of the oculus quest.\n\nHelpful | 14", "BudapestiMay 28, 2019 at 11:31 AM\nA wonder-filled, Nintendoesque VR primer\n\nCreated as a tutorial for the new Oculus Touch controllers and, more broadly, for those new to VR, First Steps ends up being a surprisingly delightful introduction for first-time Oculus Quest users.\nTaking you from setting up your Guardian to the intricacies of the controllers could be - and often is with VR hardware - a rather dull experience. However, there's a real sense of imagination and playfulness in First Steps. From the expected tasks of stacking blocks and playing with a bat and ball, to firing off mini rockets and controlling an RC Zeppelin, there's plenty to do in the first part of the experience. What's particularly cool is realizing that you can combine any number of objects to create your own mini-games. Build a tower of blocks, then try to collapse it with the airship? You can do that. Swat rockets from the sky with a ping pong paddle? Sure, why not? Also included are two virtual games cartridges. One is a fairly standard shooting gallery, with three different weapons and some high-score chasing. The other introduces you to a cartoon alien with a love of ballroom dancing, who really wants to show you the advantages of an untethered VR experience - I'll leave you to imagine the rest.\nDefinitely worth downloading, especially at the great price of 'free!'. It's not a long experience, and you won't come back to it often, but it's absolutely one of the best things to showcase VR for the uninitiated. If you plan on showing off your Quest to friends and family, then this is the best place to start.\n\nHelpful | 1", "mixonesixMay 22, 2019 at 12:50 AM\nI had a blast, pun intended\n\nThe tutorial is fun in its own respect, offering up several mini games and an array of items on the desktop to play with, including a few toy rockets. I highly recommend doing the tutorial so you can get acclimated with the Oculus features.\n\nA+. Really had me in awe when I started controlling the blimp.\n\nHelpful | 3", "meandrozJun 2, 2019 at 1:34 AM\n\nIt's a wonderful introduction into vr. Officially suited from 3 yeas and on. However my kid can't play it because she can't reach all the places nor can I let her draw a guardian or can read all messages. Casting does not show the guardian. An age rating should include height requirements!\n\nHelpful | 4", "BobbiHereMay 25, 2019 at 12:47 PM\nFirst Steps\n\nUpdate: Figured it out  it was over my head, in sitting position could not be seen.lol  FYI for all in same situation. If possible, Stand up and youll see it. 5 stars!\n\nPlease help  dont see a button to push in the initial set up of virtual hands; pointing with index finger. Theres no button seen to push. Using stationary position. Thank you!\n\nHelpful | 1", "kline6666May 21, 2019 at 9:56 PM\nPerfection\n\nCouldnt have asked for a better tutorial. The people who made this are genius. It grabs your attention and wows you from the beginning, and the activities are fun, clear, well polished, and really illustrates what this headset is capable of. I believe this will charm even the blackest of hearts.\n\nHelpful | 3", "robertmingMay 24, 2019 at 9:30 PM\nTruly Amazing Experience\n\nThis was one of the coolest experiences I think I have ever had involving technology. Was so amazed by everything around me during the playtime. Also this was the first VR headset I have ever used. If someone is planning on trying out my Quest Im showing them this app. 5 stars.\n\nHelpful | 3", "SkyArcherJun 1, 2019 at 11:02 AM\nThe perfect intro to Quest\n\nEvery time I let someone try Quest for the first time, this is the app I launch. Its the perfect introduction to tetherless VR, and the look on the faces of these people is just priceless.\n\nHelpful | 2", "OKCSKYJul 8, 2019 at 1:18 PM\n\nAmusing and fun. It shows you how to use your controllers.\n\nHelpful | 0", "argerichJun 20, 2019 at 12:02 AM\nWow!!!\n\nThis is the tutorial and it is an amazing intro to the VR world. I recommend showing this to your friends and family before anything else.\n\nHelpful | 0", "R3DROOKMay 26, 2019 at 12:53 PM\nOutstanding First VR Experience\n\nThis was the first thing I have ever done in VR and I loved it!. It shows you how to you everything you need to know about the quest and then let's you free to have some fun and get used to the system. Highly recommend for people new to the System.\n\nHelpful | 1", "Crazy_SaneJun 2, 2019 at 3:15 AM\nThe Most Entertaining Tutorial Ever\n\nThis app is a tutorial intended to introduce new users to the Quest's controls. However, it is so much fun that I have played this several times. If you haven't tried this, why not! Thanks Oculus!\n\nHelpful | 2", "Tigy01May 23, 2019 at 8:22 PM\nRobot is my new best friend\n\nThis is a great first experece with vr it feels like a mix between space pirate trainer and that one dancing game. The dancing game if your wondering is where my waifu the reboot is from.\n\nHelpful | 2", "GubleMay 31, 2019 at 3:46 PM\nGreat first VR experience\n\nI had watched a playthrough of the app on YouTube, but actually being there and experiencing it yourself... mind-blowing.\n\nVery fun and creative tutorial. Highly recommend it to other first-time VR users.\n\nHelpful | 2", "Sebb82Jun 7, 2019 at 1:04 AM\nGood job!\n\nThe Oculus Quest is amazing! I think this is a new way to disperse VR to the most people. The Introduction gives me a WOW-effect. My own holodeck :p Greetings from Germany!\n\nHelpful | 1", "sirhc.ekralcJun 26, 2019 at 1:59 AM\nAmazing fun!\n\nGreat introduction to VR basics and techniques and some great mini games built in\n\nHelpful | 0", "EPICgamerCHILLMay 22, 2019 at 10:06 AM\n\nThis was a great tutorial and first experience for the Oculus Quest!\n\nHelpful | 5", "ricjeMay 21, 2019 at 1:13 PM\n\nIt feels like being instantly teleported in another dimension. Would be very hard to have a better VR intro than this.\n\nHelpful | 3", "Illusi0nalMay 31, 2019 at 9:42 PM\nGreat Introduction to Quest\n\nThis is a great introduction to the Quest. The robot is endearing, and the music and presentation are great. I got a kick out of seeing my family dance with the robot.\n\nHelpful | 1", "HollogramVRMay 21, 2019 at 4:18 PM\nDont skip this\n\nA delightful little experience which is well worth playing around in for some orientation to get used to the controllers . I was impressed and Ill be back in to do some more training .\n\nHelpful | 4", "bguyleJun 21, 2019 at 6:25 AM\nInternet connection REQUIRED\n\nDon't know why this says you don't need an internet connection. Tried showing the app off to colleagues at work who've never tried VR and they couldn't try it out. Fun when it works.\n\nHelpful | 4", "2Fast2ContrastMay 21, 2019 at 3:22 PM\nAwsomd\n\nCool to see all the features\n\nHelpful | 5", "DrozkMay 29, 2019 at 1:33 AM\nAwesome experience\n\nFirst headset I've own and I have to say this app made me enter the VR world in one of the best qays possible. As I've seen in other reviews tho, from the third time on that I used the app, my hands are invisible when they should appear. I'm playing in roomscale mode, is it a bug youmre currently fixing or...?\n\nHelpful | 1", "IRobot4EverJun 15, 2019 at 8:58 AM\nAmazing onboarding UX\n\nJust perfect, it has an amazing onboarding user exprience. A must have !\n\nHelpful | 1", "JTubbrittJun 15, 2019 at 6:00 AM\nVery enjoyable.\n\nSimply but, this is a perfect introduction to VR.\n\nHelpful | 3", "dariuszdziewa1984Jun 4, 2019 at 7:26 AM\n\nWow !\n\nHelpful | 3", "McMoistMay 23, 2019 at 12:18 PM\nAmazing Experience\n\nThe quest is my first VR headset and this tutorial was absolutely amazing! I recommend the quest to anyone who is curious about VR.\n\nHelpful | 5", "TenMcChucklesMay 24, 2019 at 11:36 PM\nGreat start to VR\n\nIncredibly immersive tutorial. Way to go oculus!\n\nHelpful | 3", "Chris_StaceyMay 26, 2019 at 8:21 AM\nWonderful!\n\nBlown away, great introduction and instruction on how to use the Quest. Watching friends dance with the robot never ceases to bring a smile to my face!\n\nHelpful | 1", "rob_CHJun 8, 2019 at 10:49 AM\nGreat introduction\n\nMany thanks, this is beautiful and very well made to explain the VR system.\n\nHelpful | 1", "KLX2020May 27, 2019 at 5:35 PM\n\nThat was an awesome experience and well done!\n\nHelpful | 3", "hookbeakMay 24, 2019 at 6:38 AM\nGreat intro\n\nUse this to demo your quest for everyone you show it to. A fantastic introduction.\n\nHelpful | 2", "GalaxyWizzardJun 6, 2019 at 6:31 PM\nSUPER FUN AND GOOD TUTORIAL\n\nGreat first game to show new people to VR. SO loved dancing with the robot :)\n\nHelpful | 1", "shadester88May 26, 2019 at 12:21 AM\nCool Tutorial!\n\nGreat intro to the oculus Quest. A game I have all newbies play!\n\nHelpful | 2", "SATactSKYPEtutorJun 2, 2019 at 10:38 AM\nSo great for introducing new ppl to VR!\n\nThe childlike awe comes back\n\nHelpful | 2", "alicia5Jun 16, 2019 at 5:06 AM\nIt good\n\nI like that robot\n\nHelpful | 1", "milo219Jun 10, 2019 at 10:32 AM\nA great gamr\n\nIt is quest game and come with quest\n\nHelpful | 2", "checkminerMay 26, 2019 at 7:09 PM\nGreat to introduce people into VR.\n\nThe robot dance was very fun for everyone I showed.\n\nHelpful | 2", "NVRflameMay 20, 2019 at 9:43 PM\nAwesome\n\nA must way to experience and learn the Oculus Quest features.\n\nHelpful | 9", "YeahWowCoolJun 5, 2019 at 5:48 AM\nLove it\n\nMy first quest experience that brought me even tears of joy.\n\nHelpful | 1", "BigelowedJun 2, 2019 at 1:50 PM\nWhat a beautiful intro to Quest\n\nI felt the magic all over again of when I first got my Rift years ago. No cable!\n\nHelpful | 1", "Coolman262Aug 6, 2019 at 12:41 PM\n\nMy height is completely messed up\n\nHelpful | 1", "abelinkMay 22, 2019 at 8:44 PM\nGreat starting point\n\nVery fun. Great tutorial. Felt incredibly personal first time dancing with the robot.\n\nHelpful | 3", "chibitofuMay 21, 2019 at 9:28 PM\nGreat introduction to vr\n\nWas a great first experience. I couldnt believe how happy I was to dance with a robot.\n\nHelpful | 3", "znanneyMay 21, 2019 at 11:22 PM\nBeautiful\n\nWhat a fun way to try on your VR hands. The robot is really heartwarming as well.\n\nHelpful | 3", "tinfoil_unicornMay 21, 2019 at 1:11 PM\nLook Ma - no hands!!!\n\nI was loving this experience until I got to the point when my virtual hands were supposed to appear - but they were invisible! They worked but I couldn't see them. Please fix this bug!!!!\n\nHelpful | 7\nDeveloper ResponseMay 23, 2019 at 2:13 PM\n\nHi Tinfoil_Unicorn! Thanks for the feedback, does this happen each time you play First Steps? And do you know if you were playing in a \"roomscale\" or \"stationary\" play space when this occurred? Thanks!", "darwins.lastMay 23, 2019 at 7:10 PM\nLove It!\n\nDancing with a robot has never been this much fun.\n\nHelpful | 3", "el_jergasMay 24, 2019 at 7:33 PM\nNice free introductory app\n\nIts enjoyable and free. What else can you ask for?!\n\nHelpful | 2", "IcebergJDJun 13, 2019 at 6:59 PM\nDance dance\n\nGood to show off with.\n\nHelpful | 4", "Kori97May 24, 2019 at 11:25 PM\nRobot dance\n\nThat scene was the highlight of my life. I would pay all of my money for a whole game of dancing with robots! \n\nHelpful | 7", "OnlyFourJun 18, 2019 at 7:31 PM\nFun\n\nReally impressive first experience. Good for the family to get a taste of why VR is so special.\n\nHelpful | 3"]