{"App Title": "FREEDIVER: Triton Down", "App description": "FREEDIVER: Triton Down plunges you into a capsizing research ship, the Triton, where survival means outmaneuvering the water's lethal surge.\nAs world-class diver Ren Tanaka, you must freedive through a sinking ship, overcome underwater chaos, and unlock your path to the surface, all while protecting your most precious resource: the breath in your lungs. Reworked for Oculus Quest, the FREEDIVER: Triton Down Extended Cut now boasts a deeper story, expanded gameplay areas, and all-new ways to explore them.\n\nUnderwater Adventure\nSurvive a harrowing nautical disaster as a world-class freediver\n\nFight for Breath\nOxygen is your only resource, the rising seawater your greatest adversary \n\nGestural Locomotion\nNavigate virtual spaces with intuitive dive and swim movement\n\nInteractive Puzzles\nStay calm, think fast, and use your environment to escape\n\nImmersive Soundscapes\nHandcrafted music and SFX from an award-winning audio team", "Purchase section": "$14.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Narrative, Simulation", "Languages": "English", "Version + Release Notes": "1.0", "Developer": "Archiact", "Publisher": "Archiact", "Website": "https://archiactvr.com/", "Release Date": "February 25, 2020", "Developer Privacy Policy": "None", "Space Required": "899.4 MB"}



["5 stars\n50%\n4 stars\n30%\n3 stars\n11%\n2 stars\n6%\n1 star\n2%", "purpleorsomethinglolJul 8 at 7:39 AM\nAmazing but one flaw...\n\nIve had this game on my wish list for a while now and I finally got my hands on it. The swimming mechanics are amazing and I have had my share of screams. The graphics are beautiful considering its a quest game and the puzzles require you to find oxygen but also do the task. When you are at the stairwell, there is a pocket of air at the top, you can breathe but eventually it FILLS UP! How nerve racking is that?! Anyways, to the point. The tutorial quest took longer than most puzzles and the game itself is really short, what happens when she gets to the surface? How does she get found? But I mean, thats part of the mystery. Thanks for reading my review :3\n\nHelpful | 62", "mjg298Jun 21 at 1:20 PM\nEnjoyable but ends abruptly\n\nThis is a good game which takes you on a roller coaster of an adventure navigating the inside of a sinking ship. Puzzles and challenges vary throughout but not too difficult, and at times feels very intense. Controls are simple and intuitive, and work well. The only downside is that it ends a little too soon and there isn't a good epilogue to tie it all up. Little real replay values sadly - shame there isn't a free play mode like the first scene to give lots more options to explore which would have significantly increased the value of this game\n\nHelpful | 4", "Ihrie3 days ago\nQuite a immersive experience\n\nDefinitely enjoyed this title and would often find myself holding my own breath at times, so definitely quite immersive.\n\nI do feel like the swimming should be tweaked a little bit, felt like the way they expected folks to swim is a bit slow and kind of exhausting. But there is definitely room in how the swimming mechanic works that I was able to find a technique that worked well enough.\n\nStory was honestly pretty interesting, but expect a pretty significant cliffhanger and the end. Id love to see a sequel or some DLC.\n\nHelpful | 0", "Gamertag_VRFeb 26 at 10:13 PM\nSHORT & INTENSE UNDERWATER ACTION\n\nI would describe this as a short & intense action adventure. Ive played the PCVR version which is a very very impressive looking game (currently 50% off on Oculus Store 26/2/2020) & I feel Archiact did a really good job with the oculus quest version. Everything that makes this game great & unique is still here. You are trapping within the ship Triton Down which is sinking, tumbling & taking damage. This will have you questioning which way is up and where to go pretty much constantly. The swimming mechanics have you using your arms to realistically swim is awesome and at times this game can make you feel claustrophobic & panicked. The combination of small spaces, confusing game world & constantly needing to monitor your oxygen levels adds to the intense sense of panic, but for me, thats what makes this game unique and unforgettable in VR. My only gripe is the lack of cross buy for oculus owners. The developers have said its because this is the extended cut & is offering more gameplay & deeper story but while doing my full play through live I did not notice any differences to the PCVR version from memory. This game will take you between 1-2 hours depending on how quick you solve the puzzles but for the price & new players its a must buy. However, I feel there is no need for owners of the Rift/Steam version to double dip for the extra content found in the quest version that went unnoticed by myself. Feel free to check out my 15 minute introduction video to FREEDIVER: Triton Down with no commentary. This will show you the game graphics, atmosphere & gameplay mechanics with minimum spoilers. Alternatively I have also completed the game on livestream. Just search Gamertag VR for this game or any Oculus Quest title. Thank you very much for your time.\n\nHelpful | 329", "phillyg2020Jun 22 at 11:30 AM\nAmazing VR experience!!!\n\nThis is an amazing VR experience! The controls feel like Echo without the boost. I like the grab and push and swim and dive and breath or drown. Great graphics too! Hey devs are you done with this game or will there be updates???A free dive or lap pool or some other mode would be awesome...\n\nHelpful | 2", "PurplemikeyApr 6 at 7:47 AM\nVery immersive and intense experience!\n\nThis game can be completed within an hour and a half on the hardest difficulty (first playthrough). I think this should be clear before buying it. But it doesn't take away it's very immersive world and very well done swimming mechanics.\n\nI have played it twice so far. The game really dive deep in your mind and make you believe you're there swimming and trying to find your breath. I am afraid of water because I really hate not being able to breathe. That game was a bit of a challenge for me and I found myself holding up my breathe sometimes.\n\nI can't say much without spoiling but this game offer some great little puzzles (finding your way out, unlocking a door, ...) And very pleasing visuals.\n\nHelpful | 24", "berickphilipMay 6 at 2:28 AM\nOverhyped. Disappointed..\n\nUnfortunately, not as good as I imagined. Especially after reading some over-enthusiastic reviews.\n\nThe good:\n- The swimming mechanic is somewhat fun (but can get awkward/clumsy for moving around some places).\n- Really feels like being underwater (good ambiance and lighting).\n- Apart from swimming you can grab surfaces to move around (like in Lone Echo for example)\n- Some places/objects look really nice, for Oculus Quest.\n\nThe bad:\n- the VERY short duration could have been ok if it felt like a complete short story, but it is only a very small portion of a story.. like stopping a movie after the first 25% and never getting to watch the rest.\n- even DISABLING hints on options.. the characters keep talking about what you need to do! And I guess it was necessary after all, because honestly some key points of the \"plot\" necessary for progression are not intuitive at all.\n- overdramatic voices/acting.\n-The way you overcome obstacles / situations is pretty basic, and feels more like a chore than rewarding puzzles..\n\nHelpful | 20", "Bone196512 days ago\nFree Diver Triton Down\n\nVery real game and Awesome!\n\nHelpful | 0", "bezzerbezJul 4 at 8:26 AM\nQuickly became tedious\n\nIt's starts off as a novel experience but then the controls start to become really annoying. I keep trying to go back to this but it's one of the very few VR games where I regret the purchase. The nature of the game means that it's easy to feel motion sickness as you move around even with the relevant comfort options switched on - this is possibly because you have to move around a lot to keep going back to the oxygen canisters. I've not asked for a refund as it was part of a bundle and it may be just personal preference but, for me, I just can't see what the attraction of this game would be over the many other puzzle solving games that are easier to control.\n\nHelpful | 0", "PerlmannecklaceJul 7 at 2:01 AM\n\nHad a panic attack in the first 5 min & peed myself a lil in front of my wife. 5 stars.\n\nHelpful | 2", "tamerrrMay 9 at 8:51 PM\nAmazing\n\nHonestly really enjoyed playing through this game. Very amazing and immersive experience which I feel is hard to find after playing a ton of vr already. To me personally this is what I love about vr, being immersed in a realistic environment and doing something you may never or will never be able to do outside of vr.\n\nHelpful | 4", "slapfuFeb 25 at 1:31 PM\nSecret release? Wow!\n\nFreediver, highly immersive game for the Oculus Quest, I own the PCVR version and was still blown away by this on my quest, plus it's the extended edition!\n\nOnly reason it didn't get 5 stars is because I think it deserves a slight graphics update, but still very impressive!\n\nHelpful | 70", "MightyQuinnJFeb 26 at 12:21 AM\nGame approved by a real freediver!\n\nIm so glad this was ported over to the Quest!!\nThat cord pulling on your head breaks immersion every time! The graphics and details are really good, also I love the swimming mechanics and that stressful Im running out of air feeling it gives you! Like when Im spearfishing and have to decide if I have time to take a shot or should I just go up for air!\n\nIts games like this that really show off the full capabilities for vr! I would recommend this game to anyone!\n\nExcept people who might be going on a cruise!\n\n...Although it could make for some good worse case scenario training! Lol\n\nGreat job on this game Archiact Devs!\n\nHelpful | 66", "pphenry1977Jun 25 at 11:56 AM\nWow\n\nQuite simply immersive and intense.\n\nHelpful | 0", "gaza2492May 17 at 6:55 AM\nIt looked good but wasn't sure\n\nThat's untill i played it have said it before will say it again\nA MUST BUY\nTh start is a bit slow but its also to make sure you know how to swim and mess about with Th setting i get motion sickness easily and Th game tells you not to free swim because it could give you motion sickness\nI did it to try it and i don't know how they pulled it of but No motion sickness at all so i said Th starts a bit slow just weight till your on Th ship and she's on her way down to Davy Jones's Locker that's where it takes of some rooms have air some rooms don't some hallways you can free swim but others have\nWater currents witch you have to climb on the floor but it really gives you that feeling you swimming and Th boat is on its way down i Cant weight to see what they bring out next maybe a space game where you need air to\nsurvive\nit took me about 2 hours to finish but left for a month or two would probably take me about 130 minutes maybe to finish but its an awsome game and also one for your family and friends to try out have said it before have to say it again\nA MUST BUY\n\nHelpful | 1", "eoinokMar 27 at 1:49 AM\nVery, very short. No puzzles\n\nThere's the makings of a fantastic game here. It looks great and the innovative movement mechanic works brilliantly. When I first started this game it felt really immersive and interesting and was I keen to get lost in it. But ultimately it was a massive disappointment. The bulk of the game is spent in the corridors of a ship and honestly it feels like each new area you enter is a copy-and-paste of the last. The \"puzzles\" are - let me be clear about this - not puzzles. Your average FPS will present you with more complex and engaging brain teasers than this does. Enter a new area, flip the only switch that can be flipped and - well done! - you solved a puzzle. One particular pseudo-puzzle is repeated three times. Also, anyone planning to purchase this game should be aware that it is *extremely* short. I know this is a pretty common complaint for story-based games on the Quest but this game is the worst offender, at least in my experience. And that's especially weird because a lot of work clearly went into setting up the story. And then... it just ends. I'm not exaggerating, the story is 100% setup and zero payoff. It's like \"A long time ago in a galaxy far, far away the end.\" There's really not much of a game here, and that's a shame because the foundation is good.\n\nHelpful | 19", "KurlyFriesFeb 27 at 11:51 AM\nFelt like I was in a movie!\n\nHands down one of the best experiences I've seen on the Quest. The storytelling in this is amazing and made me feel fully immersed. Ocean and water has always been one of the things I've wanted to experience the most in VR and this game did just that but with a twist. The price is definitely a bargain and I can see myself coming back to this or even showing it to friends and family to enjoy. I'm loving these random releases for the Quest. Thanks for an amazing experience and I hope to see some future updates for the game with new game modes possibly?\n\nHelpful | 33", "NightMonk3yJun 3 at 6:20 PM\nEnjoyable\n\nFantastix underwater experience completed it in over 2 hours. The graphics are amazing best ive seen so far on the quest\n\nHelpful | 1", "commander_nightmareApr 20 at 2:33 PM\ngreat game\n\nThe only missing part is a small free diving and exploration mode. Just for relaxing when the main game is done.\n\nHope this will come with a game update... :)\n\nHelpful | 5", "G3nkiFeb 26 at 5:24 AM\nAn Unforgettable Experience\n\nI'd like to start by saying that I was hoping this would come to Quest after hearing about the game on some podcasts and not having a PCVR setup myself.\nFollowing the Quest announcement almost every comment I saw was saying how it looked like trash compared to the PC version and that the commenters wouldn't buy it because the poor graphics would ruin the immersion.\nOH HOW WRONG THEY WERE!\nThis game is fantastic, the swimming mechanics are incredible, the gameplay intense and fun, the environment is so much fun to explore.\nYes, the graphics aren't as realistic as the PC version, but this is running on a first gen standalone headset. I find it wild that the graphics can ruin the immersion but spinning and getting wrapped in a wire doesnt  Baffling.\nThis game is fantastic and need I remind you it's a mere 10.99! We're practically robbing the dev team. Do yourself a favour, support this game and the effort the Devs went through to get it running in the Quest! You'll regret nothing!\n\nHelpful | 16", "BenjumanjiApr 12 at 11:31 AM\nFrustrating\n\nId love to give this a better review, but until profiles are added to Oculus or this game specifically (and I think the game SHOULD have them regardless), all of my game progress was lost when another person in my house started a new game. Rather than having chapters or an option for me to resume from the point where I was at, Im now left with the option to only resume from THEIR position, which puts me right at the start of the game again. And the opening mission/tutorial was a pretty boring time so I dont feel at inclined to replay it.\n\nHowever, once the game does get going in the sinking ship, its so much better.\n\nGraphics are the poorest Ive encountered on the Quest so far (and I own a lot of games for comparison). Im sure the devs did what they could, but the textures are very low resolution and it loses a bit of immersion as a result.\n\nThis seems like a good game with interesting puzzles and storyline, but until I have a chapter option I cant see myself replaying kit.\n\nHelpful | 3", "QuiGonJim75May 19 at 5:22 PM\nNot the best for me..\n\nI get sick at my stomach with this game. And I think its all about just getting off the ship, it needs different levels, different sceneries. Also it was very hard to maneuver, I just couldnt get used to the movement at all.\n\nHelpful | 0", "marvel99Feb 25 at 6:11 PM\nReminded me of one of my favorite games\n\nReminded me of Subnatica, and since I don't have a rift or Oculus link this reminded me of my favorite moments from the game, and how my adrenaline and heart were raceing when. I began to drown. The only complaint is that after an hour or so I began to feel sick and had to take a break. But still 9/10! Good job!\n\nHelpful | 14", "Mr_Oculus_Mar 9 at 10:27 AM\nMr Oculus Review\n\nI haven't had this much fun in a disaster game for a very long time and it's mainly thanks to the excellent controls. Around the halfway point i was alternating between swimming and grabbing onto objects so efficiently which made the search for more oxygen so thrilling. I just wish the game was longer, there are some audio logs to seek out, but the ships design is pretty linear overall and doesn't offer too much exploration off the main path.\n\nOverall, if a sinking ship scenario sounds exciting to you, then you really have to experience this, the movement along with the sound design just immerses you so much and although it is short, it's a thrill ride from start to finish.\n\nFor an in-depth video review of Freediver Triton Down and other Quest games, search for Mr Oculus on youtube.\n\nHelpful | 3", "Gondar1Feb 26 at 12:07 AM\nShort but sweet\n\nThis game is excellent. It's an adventure thriller under water. A lot of people on the internet bash it a bit for the downgraded graphics compared with the PC version, but really? I have not played the PC version so I didn't even think about that before I checked some reviews after I played the Quest version. The only thing bad I have to say about the game is that the ending could be better and it is a bit short. Expect 1-2h playtime with no real replay value. However, it's 1-2h I really enjoyed.\n\nHelpful | 5", "Sleepyninja101Mar 21 at 7:09 AM\nGreat but short\n\nThis game was a pretty good adventure really reminded me of Subnautica I just wish after you escape the boat there was more to it I know theres no real long games on the quest yet but I just want more, but since the price is decent. its a must buy if you like the water one of the best games I have played on the quest so far\n\nHelpful | 5", "broly.jr2May 31 at 5:13 PM\nGood but needs more levels or open world\n\nThis game is so fun and exciting but its so short pls add more.\n\nHelpful | 2", "Adam793Feb 25 at 5:26 PM\nWow\n\nThis game is fantastic! The visuals are very engaging, the movement is very creative and immersive, and the story is deep and interesting. The way they portray the story is very creative, having you relive her memories. Overall this is a great game, 5/5 for sure. \n\nHelpful | 14", "Ash_tagApr 22 at 11:31 AM\nStraight down the line review..\n\nReason why to go for this game:\n\nI purchased this game as the concept seem cool given the capability of 360 game play via oculus quest...\n\nQuest doesn't have many adventure/strategy games either. This games ticked all those boxes and the concept and storyline is creative and the game can be immersive.\n\nConclusion.. (why I dont like the game)\n\nUnfortunately, playing the game is extremely difficult. The function of the controls seem to be simple but the tracking is terrible causing half your body to be below ground or near a wall or surface..\n\nWhen attempting to swim, you find yourself amerged to the surface (if on or near it). The balance of swiming then becomes really odd and unnatural. There has been times i found myself static or couldn't move with ease..\n\nIn terms of game play: I'm only on the first chapter. As I've played over 2 hours game play (which most of it was trying to identify if the game function is terrible or it is me) im not able to claim for a refund...\n\nThe game is extremely frustrating.. i spent 90% of my time coming to terms with the terrible movement, battling the game terrible. The focus on trying to move correctly causes motion sickness.. (its just back to back issues and takes the fun factor away)\n\nOver all, I found myself battling myself and frustration of trying to play the game than actually playing it...\n\n2 star rating for me...\n\nHelpful | 2", "Cheatengine343Mar 4 at 12:51 AM\nShort, but Intense\n\nShort is the only complaint. Story was intriguing, gameplay was solid, and the environments made it feel way too real. The cave diving felt like entering a alien world(heavy Subnautica vibes) that could be calming in the open waters and claustrophobic in the caves that would turn and narrow suddenly. Could not get enough of it. The sinking ship however was the true test. The eerie feeling as you swim around your lost crew to the dodging of large objects attempting to steamroll you, and to top it all off, not knowing when your next oxygen supply made even the mundane moments have a sense of urgency. A truly terrifying experience. Then it just ended. Felt like there was going to be more, only for it to cut to credits. Hopefully more of this game will eventually get made, in the form of a sequel or maybe just a expansion of this one, but until then this has just left me wanting more.\n\nHelpful | 3", "ParadiseDecayFeb 26 at 11:16 AM\nWould Dive Again!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=JO7wCpNxlUc\n\nMy Initial Thoughts:\nNot as good looking as the PC version but still a cracking port.\nI actually preferred the movement system on the Quest as you don't get tangled up in any cables. And the game is a lot more fun and challenging to play using the recommended movement system.\nThe sensation of being under water is incredibly powerful in VR when done right and one of the BEST thing about underwater games in VR is the Headset feels like a real life SCUBA mask! :)\n\nHelpful | 4", "krisvdvijverFeb 26 at 3:25 PM\nVery immersive\n\nAn exciting and very immersive adventure game. Its the weirdest thing... when Im almost out of air, and I find a bottle and start breathing... I actually start breathing deeply :), every single time. Anyway, I love this spooky game and I cant wait to see where the story is going...\n\nHelpful | 8", "CaykeFeb 29 at 11:35 AM\nLooks amazing but it's frustrating\n\nGot stuck a lot playing through this and I gotta chock it up to bad design. Even with hints on I found it very hard to spot intractable objects. Or maybe it is purposely designed this way because it's pretty short and lacks a proper ending.\n\nThe storytelling felt very cinematic but by the end it's just gone, what happened there?\n\nMovement worked better than I expected except pulling yourself forward by grabbing things can be quite spotty.\n\nI was also expecting more of the sea exploration that you do at the very beginning of the game. Nope, after that you just escape the boat and then you're done.\n\nOverall I liked it but I wanted more.\n\nHelpful | 10", "RosalindaGamesApr 8 at 6:08 AM\nGreat immersion!\n\nUodate: thank you, thought that door was locked, didn't see it could be pushed. Now thinking I've missed several of these maybe :)\n\nGood game (loved the cave part more than the ship so far)\n\n\nPrevious:In boat, turn valve to turn off fire, enter room, breath O2 bottle,stop. Restart later, fire is back (wasn't saved as off by the game) and you're stuck in that room.\n\nHelpful | 0\nDeveloper ResponseApr 7 at 3:47 PM\n\nHey there, we're sorry to hear you ran into trouble in the fire section! We think we might be able to help. In the room with the O2 tank, there should be a door right next to the tank - if you push that open, are you able to progress? Hopefully that gets you on your way!", "NinjaMonkeyMarkFeb 29 at 6:01 PM\nGreat environmental story telling\n\nListen up devs! This is what we want. Good story telling, solid mechanics wrapped up in an engaging worth while single player experience. Despite its short length and trailing conclusion, Im still hitting this with five stars, as every moment I spent playing through this was awesome. Im excited to see what these devs have in store for us next!\n\nHelpful | 5", "StaticCloudMar 4 at 3:22 PM\nThat's it?\n\nTLDR:\nGood -\nRealistic swimming movement\nInteresting story\nBad -\nIncredibly short (35m-12m)\nAbrupt ending\n\nSorry if I come across as a bit harsh but there isn't really much to this game at the moment. It's mostly just 30 minutes of a sinking ship simulator with some OK graphics and a decent swimming mechanic. I managed to beat it the first time in only 34 minutes without any hints and then only 12 minutes on my second playthrough without any hints either.\nI never found the puzzles too challenging since they're more like find the switch or button then go to the next room challenges instead of actual puzzles imo.\n\nLike a lot of other reviews have already said, I think more should be added to the ending. Nothing is really explained and you don't find out any new lore.\nThe game itself is titled \"Extended Cut\" yet I didn't notice anything new compared to the Rift version so I'm not too sure what that's about.\n\nBut overall I think this is an OK game, but a little overpriced for what you get both graphics and length wise.\n\nHelpful | 7", "The_ElementalMar 1 at 7:14 AM\nShort game play but worth it\n\nAll In all I would say this is a fun game to play. A couple things about this game though. The game play is quite short and the escape room style puzzles are not hard to figure out. You will most likely complete this game with in an hour or two. Make sure that you have a big guardian area to play in because if youre tall like I am and play in a small guardian area your arms will hit the edges of your guardian wall when you swim and break the immersion. Secondly there are a lot of times were you feel like your body is glitching through the floor because your head is right at the floor level.\nEven though this game was rated at a moderate comfort level I personally had no problem feeling motion sickness moving around. There are different option to vignette your headset when swimming to limit the motion sickness. I ended up turning them off a few minutes into the game because the swimming felt natural enough to me I did not experience any motion sickness. The physics of this game are a little different and exciting in that you can grab just about any surface to help you push off or pull you through the water. Its a worthy game to check out but might feel a little expensive after you beat it so quickly. Im sure I will jump back in again and run through the story to feel like I got my moneys worth out of it.\n\nHelpful | 2", "william.malcolm.7798Jun 8 at 3:46 AM\n\nGood game but short\n\nHelpful | 1", "ikillzyaMay 2 at 3:20 AM\nHope for some dlcs\n\nVery immersive, didnt give me motion sicknes but may for some. Fought against the current and felt lie i was still moving at times.\n\nHelpful | 0", "jozsef.csorba.108May 2 at 1:50 AM\nFreedive\n\nThis is a attractive and exciting game.\n\nHelpful | 1", "CAD_BANEApr 11 at 1:18 PM\nPretty awesome game.\n\nlove the mechanics, Pretty awesome game, Ill give the game a 4.5 stars, the only gripe I have is.....wish theyre was more fish swimming in the game, but thats a small compliment.\n\nHelpful | 0", "kvg1988Feb 27 at 6:21 AM\nExcellent Adventure\n\nShort and sweet, this immersive adventure will have you holding your breath until the very end.\nHowever; if there was one recommendation I could make to the devs it would be to remove the 3rd person cutscenes during missions and allow the player to perform that final moment just before the credits roll. It'd amount to the same thing, but it'd just feel so much better if it was something the player did themselves.\n\nHelpful | 4", "ZooZooUwUMar 29 at 2:29 PM\nIt's a very well made game.\n\nI really enjoyed playing it and the style of the game. Everything was in the correct place and was pretty fun overall to play. The only issue I have is that it was a little too short. We want more! \n\nHelpful | 0", "fizheyezApr 22 at 12:56 PM\nShort & fully immersive\n\nI found the game short and was left wanting more.\nHowever its one of the most immersive experiences I've had on the quest to date.\n\nI would highly recommend this title.\n\nHelpful | 1", "JorgTheElderFeb 25 at 4:53 PM\nGreat experience, but no real ending\n\nI was able to play through it in a couple of hours and enjoyed it, but they need to give it a real ending. Like Apex Construct, the story ends in a lurch with no real organized ending. I find that really disappointing.\n\nHelpful | 18", "vr_warehouseApr 2 at 1:50 AM\nToo Short, Tech Demo (Couldve been 5)\n\nAmazing for what it is, buy it!\nIt is an experience that is well crafted!\n\nThat said, the experience is crafted so masterfully.. that you WILL be disappointed by how short it is.\n\nMost likely budget constraints on the devs side. I hope they get investors. This game has huge potential.\n\nSTORY PRESENTATION:\nOuter body story style is jarring and takes way too long which is akin to cutting the umbilical cord of immersion.\n\nThe long ness of it causes boredom.\n\nFuture iterations may need a new way to tell the story without pulling us out of the experience.\n\nMaybe a memory in her mind since it is a flash forward, that is explaining us, the player who is the flash back.\n\nMaybe let the flash forward occur in her mind as audio narration while we swim around during a moment nothing is happening or while we are doing a puzzle.\n\nAlso,\n\nYou probably could had replaced the long drawn out outer body story with maybe...\n\ntwo more scenes or two more puzzles?\n\nReplaced the loading buffer to the next level (which is what the outer body story was) with something else, something more creative and in thematic of your game, that does not pull us out of the immersion.\n\nWe have Freediver at our Arcade, and one of the reasons players kind of leave it, is that jarring outer body experience and it going on for a long time - as they pay by the minute.\n\n\nATMOSPHERE - MOOD\nI love the atmosphere & mood this game created excellent survival like game with puzzles.\n\n\nSWIMMING MECHANICS\nVery well done. After a few segments - youll get it and youll naturally find yourself immersing into the role of the character you are.\n\n\nLONGER THAN USUAL TECH DEMO\nI honestly feel this would had been a masterpiece!! I repeat a masterpiece!\n\nIf Triton would had gave it more substance.\n\nMore length, new environments, probably introduced a few more useful mechanics to enhance the breadth and interactivity of these intoxicating, addictive underwater environments.\n\nI prefer this over all the Vader Immortal games. Those do not provide no where near the freedom nor immersion this game offers.\n\nThat said, I understand Vader Immortal is a whole different game design, where its mostly moving from zone to zone while staying within your invisible designated play space. (Please move back to play space message ensues)\n\nThat said, this game is leagues better in my eyes (or could had been) if they made it a full blown game.\n\nSadly, this is a tech demo. Longer than most tech demos - but still thats what it is.\n\n\nMARKET SHARE - REVENUE\nSubnautica truly is walking away from revenue on the table by not stepping into the quest\n\nTake advantage Devs!\n\nThere is a underwater/ocean market genre - and it is huge! Ocean is part of human history & nature.\n\nTherefore, it naturally brings its own followers, cultures.\n\nThe one strikes this VR atmosphere right, is going to be in for a huge market that they will have unto themselves for a while, as the industry is still in its infancy and figuring itself out.\n\nHelpful | 0", "SkeletalHydraMar 4 at 4:33 PM\nGreat game, but a little short\n\nI loved this game. The visuals are amazing, and I loved the story. The swimming controls were new to me, so it was really cool and immersive. I almost gave it 4 stars because of the length, (it was a little short for me) but everything else in this game really made up for it. It was an overall fantastic game.\n\nNote: it might of just seemed short to me because I had the day off, and I finished it in one sitting.\n\nHelpful | 2", "JcPeacemakerFeb 27 at 2:59 PM\nPoseidon in VR\n\nTake a deep breath- tense and claustrophobic experience. Mechanics of swimming, grabbing to move works so good. Great visuals and sound to get you full involved in what feel like an interactive movie. Wish it was longer but still love this.\n\nHelpful | 2", "Ast2TheRegionalMngrApr 22 at 8:33 PM\nGreat Game\n\nI really enjoyed playing this game!\n\nHelpful | 1", "BadLarryNYMar 29 at 9:04 AM\nOriginal and decently executed. Short!\n\nAn original ice that has you moving in new ways similar to how the Climb is. Graphics are ok, and the interface works well. Overall very short with little variety, and an seemingly incomplete story. No follow up at the end to present any kind of closure. What ever happened to the whole interview thing of the story?\n\nHelpful | 1", "BLZDPraetorianFeb 26 at 8:58 PM\nGreat swimmer EXPERIENCE!!!\n\nThe onnnnly bad part is this game is short. Its becoming a sad expectation so its worth the price. But jeeez, I was really excited to play more and I just beat it. I played for about an hour last night, and another 20 min just now. Loved the story! Im afraid of deep waters so i was a little hesitant, but it does a great job of being suspenseful, but not overly scary. It was great fun! So 4 out of 5. Simply because i am an extreme gamer. And really like my games to give me content. Easily could be 5/5 for a diff person. For me it was to short. But again. You got what you paid for. All is fair, and it is amazing beside that. Wait i forgot, there was one point in the story, i got stuck on a door not opening (I think i glitched it by prematurely pulling a lever before story was caught up) and I could not get past, ended up drowning myself and Boom! I was past it. Strange. But meh. Didn't get hung up. Also the swimming mechanics are great! Good practice for echo arena I bet \n\nHelpful | 1", "VRvinbeanselMar 6 at 4:48 PM\nFantastic ! Loving it\n\nWhat a great change of gaming style very refreshing looks superb on the Quest better than I expected tbh. Really polished and a great price at 10.99 UK\n\nI love the controls (no blinders and free movement if you choose ) also ends up being a arm work out too lol.\n\nFantastic port of a great game so far\n\nDon't hold back Devs like this need support from the Quest community !\n\nWell done it's the best Quest game ive downloaded in ages !\n\nBUY IT\n\nHelpful | 2", "PDMarsayJun 21 at 6:37 AM\nI hope this is the future - excellent!\n\nExceptional use of VR. I agree with others that it is short, but the quality of the game and level of immersion sets a very high bar - I'll be first in line for any sequel. It feels like James Cameron directed an adaptation of a book by Michael Crichton - The Abyss meets Sphere. Not for the claustrophobic though!\n\nHelpful | 0", "langdreamerMar 10 at 6:26 AM\nVery unpolished\n\nThis still needs work. The rendering distance of the water surface is off. The texture renders at a distance much further away than the actual position of the water surface. The game gets randomly stuck. Sometimes it fails to load the next portion of the environment, and sometimes it fails to let you move after a cinematic sequence.\n\nHelpful | 2", "FamilyloweMar 15 at 4:00 PM\n3 out of 5 adults did not get motion sic\n\nJust like it says, 5 people played it, everyone thought it was cool, but two people could not stand the movement. So, be warned, but also be excited.\n\nAlso, if you like swimming... lot of that here.\n\nHelpful | 0", "cantennaMar 11 at 12:52 AM\nIt's a good buy!\n\nGreat experience and immersion on the Quest! I'm happy with what I got for what I paid; 5 stars earned.\n\nBut, having played this, you guys need to buckle down and make a much larger experience with more different environments now. You've tested the waters and you see that there is interest... So back to work on a new title please! lol\n\nHelpful | 0", "BURPINGHIPPO29888Mar 9 at 2:53 PM\nGreat but could use some fixes\n\nI said this because I believe that there should be sharks and other underwater creatures to give more action overall great game enjoyed it.\n\nHelpful | 2", "TheVirtualNickMar 13 at 1:16 PM\nShort but fun\n\nThis game is very immersive and can be kind of freaky at times. The way you have to use a flashlight to see where you are swimming, struggling for oxygen, and the swimming mechanics come together to make one of the most immersive VR experiences I have ever had the joy to play.\n\nHelpful | 0", "Atomix121Mar 19 at 4:20 PM\nQuite short\n\nThis game has good swimming mechanics, pretty good story, fun gameplay but only around an hour or to of it. Not great if you are looking for lots of of time in the game I suggest investing the little bit of extra money to get games like moss or journey of the gods.\n\nHelpful | 1", "leonardallen1Mar 26 at 1:49 PM\n4 Stars\n\nIt was fun really interactive but way too short left me wanting more!\n\nHelpful | 1", "swagmasta19942Mar 1 at 5:54 PM\nGreat game\n\nIt is a great game fun mechanics and gameplay. The only thing that could be better is graphics the water doesnt look very good and made me feel a little sick. Other than that great game.\n\nHelpful | 1", "JohnReeseEApr 10 at 8:25 AM\nRealistic experience\n\nI really felt like I was running out of air throughout the game.\n\nHelpful | 0", "Stealthboy111Jun 21 at 5:10 PM\nLooked bad, felt bad\n\nThe graphics looked consistently like ps2 era games which I can get past if it weren't for the horrible controls. To swim, you flail your arms around and to turn normally you have to paddle with one of your hands. You can use the joys stick but it is a single frame transition with a sharp judder. I've played a lot of vr but this is the only one that managed to get me motion sick. The controls to hold things are poor and it's very easy to loose what you are grabbing onto. All in all I didn't like this game but if you love vr and absolutely love diving then maybe give this a try, otherwise go play some echo vr, it's zero gravity controls are much better.\n\nHelpful | 0", "MikeHawkinbalzzFeb 27 at 2:54 PM\nToo real.\n\nThis game is as extream as it sounds! If your claustrophobic or just have a fear of drowning in a underwater cave, this is not a game for you. It's got me doin the 100 meter doggy paddle dash for air in my living room! Pluse the floating bodys are extra creepy!\n\nHelpful | 1", "peter_garciaMar 27 at 6:36 AM\nWorth a Try\n\nUnique experience and solid graphics\n\nHelpful | 0", "Zgamer92Feb 26 at 7:24 PM\nSomething great!\n\nIve really enjoyed playing this game it keeps me Entertained and is really addictive. The story keeps you engaged an wondering whats next.\n\nGreat story telling. This is the closest thing to uncharted For VR even tho its a free diving game lol\n\nHelpful | 1", "CharlessnowMar 22 at 7:56 PM\nIt amazing\n\nSome of the graphics could be better at times but over all a great game and a great immersive experience....! Its worth a try if your thinking about getting it do.\n\nHelpful | 0", "EwebechaFeb 28 at 7:58 PM\nSuperb!\n\nGreat graphics, mechanics, controls.\nOptions for sitting, different heights and those who do not want to use their arms to swim. Game is short and puzzles are easy, but nonetheless game was enjoyable!! Would love to see more games from this developer.\n\nHelpful | 0", "FatybatyMar 17 at 1:48 PM\nFun fun fun\n\nGreat game found myself holding my breath a lot. Lol Great game immersion\n\nHelpful | 1", "HalesaiFeb 29 at 11:15 AM\nEnjoyed the game mechanics a lot\n\nYou definitely feel like your emerged into the world but the game ends so abruptly you feel disappointed and lost like it you missed something.\n\nHelpful | 1", "John.Henry.MagicMar 3 at 12:48 PM\nGood but?\n\nA good game but the end is not good. They start a good story and never end it. I hope it will continue! I want a conclusion.\n\nHelpful | 1", "JogoLordFeb 27 at 1:08 PM\nGreat game, just wanted to mention...\n\nThe Tutorials graphics are not representative of the full game. It appears quite low quality and bland in the tutorial, but gets way better in the smaller, more concentrated areas of the actual game. Very good stuff regardless.\n\nHelpful | 0", "khairih100Apr 8 at 8:27 PM\nGreat game\n\nAwesome\n\nHelpful | 0", "Parzival-oneFeb 29 at 1:08 AM\nFabulous Experience\n\nAwesome mechanics fabulous Simulation into a world of free diving and Survival. thanks for the port congratulations to the Devs 5***** its a must buy.\nHoping some DLC come to this title please\n\nHelpful | 1", "DexieboiMar 1 at 11:35 AM\nA great game!\n\nHard life in Seacrets and was very entertaining. I really enjoyed it and my family has too. It was a little short though being an hour and a half long. It was fun and short.\n\nHelpful | 0", "aaron.sommers.1253Jun 22 at 7:34 PM\nI like to swim\n\nCome swimLike me\n\nHelpful | 0", "karatejayceeMar 1 at 3:31 PM\nGreat!!\n\nThis game is amazing the moment you put your headset on you will be immersed into the game fully .the graphics are good for quest and won't leave you disappointed great buy.\n\n\nHelpful | 0", "sunandsnow24Mar 9 at 8:37 PM\nGreat game!\n\nI felt like I was underwater, and got claustrophobic on the ship. It's not very long, but it's a great adventure.\n\nHelpful | 0", "calforbFeb 26 at 5:54 AM\nExcellent experience in VR\n\nIts half game/half experience but really great VR. I hope they will add another chapter\nexpanding on what happens at the end.\n\nHelpful | 4", "Powers-1Apr 4 at 7:50 PM\nExpected more\n\nWay too short. Was expecting more. The story leaves you handing.\n\nHelpful | 0", "paul.k.jenkinsonFeb 25 at 5:58 PM\nAmazing\n\nLove the story an experience wish there was more to it got through it too quickly having too much fun\n\nHelpful | 4", "Lucario_boiApr 14 at 6:54 AM\nAmazing for the price\n\nOkay its pretty short but what oculus quest story game is actually long the feeling of being alone while under water is a little creepy not going to lai but for the price of $15 us its definitely worth it ps if you have problems with motion sickness like me this game my cose that\n\nHelpful | 0", "Jdevlin-Feb 26 at 11:12 AM\nVery cool\n\nVery cool game. Takes about an hour. But if you want to feel like your scuba diving. This is it\n\nHelpful | 1", "ashram50Mar 11 at 3:23 PM\nJuste genial\n\nSuper immersion.\n\nHelpful | 0", "eric.sullivan.587268Mar 10 at 6:31 PM\n\nI don't like it much not much on this type of game I play it but still just lacks fun\n\nHelpful | 2", "endo11Mar 9 at 11:20 AM\nFreediver\n\nWasn't worth the money and was completed within an 2 hours.. would love a refund to buy a much better and longer game.\n\nHelpful | 0", "okeyoneFeb 25 at 8:18 PM\nLove my Quest\n\nAnother great fun time in VR!\n\nHelpful | 4", "Savage2680Mar 3 at 8:36 PM\nHold your breath.\n\nAnd take park in the ...\n\nHelpful | 0", "brynleycharleshillMar 28 at 5:54 AM\nIntense but short\n\nI loved this game from start to finish. Simple enough for people like me who aren't good at puzzle games. The only problem was that it was too short. Before I knew it, I was finished. Nonetheless, the exercise was just what I needed especially during isolation. I urge people to play this if you like games like this\n\nHelpful | 0", "MADMANinBLACKApr 2 at 12:53 PM\nShort underwater adventure\n\nA short but well executed underwater gaming experience. The water physics are pulled off well as you swim around, and I genuinely felt claustrophobic and short of breath in sections, if it had been a little longer I would have given it 5 stars\n\nHelpful | 0"]