{"App Title": "Fruit Ninja", "App description": "The juiciest, most action-packed burst of fruit-filled fun is here! Re-imagined by the immersive power of virtual reality, Fruit Ninja on the Oculus Quest brings you closer to the action than ever before. \n\nFrom backyard to battleground, transform your world as you compete against rival players in Four Diverse and Exciting Modes:\n\n Classic - The classic gameplay you know and love! You have 3 lives, make them count! \n Arcade - Pure mayhem. Slice your way through the madness and score insane combos! \n Zen - A more relaxing experience to hone your skills. Practice makes perfect. \n NEW Survival: Test your reflexes as waves of fruit are flung at your face! Dont flinch. \n\nLEADERBOARDS: Fancy yourself the ultimate ninja? Compare against friends and foe from all over the world! \n\nAction-packed bursts of fruit slicing mayhem, paired with the 'pick-up and play' nature of Fruit Ninja, allow for a seamless transition from district to dojo - no matter where you are. Play now!", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Casual", "Languages": "English, Chinese (China), Chinese (Hong Kong), Chinese (Taiwan), French (France), German, Italian, Japanese, Korean, Polish, Portuguese (Brazil), Russian, Spanish (Spain)", "Version + Release Notes": "1.7.0.547288\n(LIVE)", "Developer": "Halfbrick Studios Pty Ltd", "Publisher": "Halfbrick Studios Pty Ltd", "Website": "https://vr.fruitninja.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "English | Deutsch | Franais\n\nPrivacy Policy\nLast updated on 4th May 2018\n\n\n\nThank you for playing our game and taking an interest in privacy! This is our privacy notice. It sets out how Halfbrick handles your personal data. If you download/play our games, you agree to this privacy statement which also forms part of our Terms of Use.\n\nKids: Remember to be smart and safe online! Never give someone your information without first asking your parent/guardian if it is OK. Don't give anyone your photo, or tell anyone your name, email, home address, telephone, your school or any other information about you that they could use to contact you either online or in the real world.\n\nIf you want to enter one of our competitions, make sure you ask permission from your parent/guardian before you enter.\n\nParents: We are committed to the safety and privacy of the children who use our Services. We encourage parents/guardians to actively monitor their children's online activities. See more information below about children's privacy and our Child Safe Apps.\n\n1. What Information Do We Collect?\n1.1 Information You Give To Us\n\nWe receive and store any information you give to us, such as when you:\n\ndownload, update and play our games;\nenter our competitions;\nare involved in our special events (e.g. focus testing days);\ninteract with us via social media such as Facebook, Twitter, Twitch, YouTube, Instagram, Reddit and Discord;\nenter information on our Website;\npurchase our merchandise;\nsubscribe to our newsletters or other information feeds;\npurchase Services through an online store;\nmake an in-app purchase;\nrequest technical support, make a compliment or complaint, or otherwise contact us directly; or\ngive us your information in another way.\n1.2 Information Collected Automatically\n\nWe receive and store certain types of information automatically when you interact with us, such as:\n\ninformation about how you use our Services. We use this information to design new Services, improve our games, provide social features and to deliver our Services to you;\nwhen you sign-in to our games with Facebook, Twitter, Game Center or other platform providers, we gather from that provider your basic profile information such as name, age-range, your profile photo and friends list;\ninformation about the device you use to access our Services such as its make & model, operating system version, platform, language, time zone, device carrier, applications installed and IP address;\ncookies: You can disable cookies through your web or phone browser settings but you may find that you are not able to enjoy all of the features of our Services if you do so;\nthe advertising ID for your device. You can reset the advertising ID at any time through your device settings.\nyour general location location (ie. city/country) based on your IP Address, so we know what language to use and so that we can provide Services that are applicable to your location; and\nif you \"tell a friend,\" \"email this page,\" or use another similar features, we will collect information to perform this feature for you.\n1.3 Information From Third Parties\n\nSometimes we collect information about you from third parties, such as Apple, Amazon, Facebook, or Google. We collect this information so that we can deliver Servicesyou have requested. We collect this information:\n\nwhen you purchase our Services via the App Store, Google Play Store,or other Storefront;\nif you log into our Services through a social media account (such as Facebook) we will collect your basic profile information such as your name, current profile picture, age-range, and your friend list, this lets you interact with your friends who are also using our Services; and\nwhen you use in-app features such as Game Center we will collect information such as your user name and your gameplay information.\n2. How Do We Use Your Information?\nHow we use your personal data\nSo you can play our games\nEnjoyable games are a complex business. We work with vendors and partners who give us the technical abilities that let you play and enjoy our games, and to run the business that supports those games.\nFor product support, development and improvement\nWe use personal data to provide customer support, to improve our games, and to develop new games. We use personal data for playtesting as well as customer and market insight.\nTo provide advertisements to you\nWe use personal data to provide advertisements to you, both in our games and via related platforms. Sometimes we use personal data to deliver ads based on your interests.\nTo market our products to you\nWe use personal data to market our games to you such as by email, social media, push-notifications and other methods.\nTo perform our own analytics\nWe perform analytics on personal data we hold for business analysis and operations, business intelligence, product development and improvement, personalizing content, providing advertising, and making recommendations.\nWe may combine information about you that we have collected from multiple sources\nWhen we share your personal data\nTo deliver advertising to you\nWe share your advertising ID with our advertising partners. We may also share demographic information about you, and your likes and interests, to allow our partners to provide more relevant advertising to you.\nTo better understand our customers\nWe may share your personal data with our analytics & attribution partners. This allows us to better understand our customer base and improve product development and revenues. Our analytics & attribution partners may combine the personal data we provide to them with information about you from other companies, to create richer more meaningful data sets.\nTo help us run our business\nWe provide your personal data to partners who assist us run our business, such as hosting providers, platforms, and payment processors. We also work with certain partners, such as other game developers and advertising partners, and information collected from you may be shared through these partnerships.\nWhen you access social media when playing our games\nWhen you play our games you can choose to access social media platforms such Facebook, Twitter, Google+, Game Center and others. If you choose to connect with these platforms, we will share certain personal data with them to enable your access. Halfbrick doesnt control how you interact with these platforms and you should ensure that you agree to their terms of use and privacy policies.\n2.1 When Do We Disclose Information\n\nWe may disclose the personal information we hold about you in the following circumstances:\n\nif we are required or authorised to disclose by law or by a law enforcement agency;\nto our business partners in the course of providing our Services to you, or generally in the conduct of our business. This may include organisations who provide services to us, such as advertising, payment processors or hosting services. Please see below for more information about third party services; and\nto avoid, lessen or prevent a serious emergency or crime. If we use or disclose personal information about you in those circumstances we will make a written record of such use or disclosure.\n2.2 Childrens' Privacy\n\nChild Safe Apps\n\nIf your Halfbrick game is labelled a Child Safe App, it was built with child safety as a priority. Our Child Safe Apps have no advertising, no data collection, no in-app purchases and no links to external sites or apps.\n\nIf you permit your child to use one of our Services that is not labelled a Child Safe App, you should disable in-app purchases on your phone and actively monitor your childs use. You should also familiarise yourself with this privacy policy, as by permitting your child to use our Services you consent to this privacy policy on their behalf. If you dont agree, please do not permit your child to use our Services.\n\nWe do not knowingly contact or collect information from children under 13 without the permission of their parent/guardians. If you believe that we have inadvertently collected such information, please contact us so we can promptly obtain parental/guardian consent or delete the information.\n\n2.3 Third Party Services\n\nWhen you use our Services, you might also use third party services, such as Facebook, Twitter and Game Center. We do not control how they interact with you and you should ensure that you consent to the terms of use and privacy policies offered by the third party services before providing them with your information. You acknowledge that we are not liable when third party services use information you provide to them.\n\nWe encourage you to be careful about the protection of your own personal information when using third party services such as social media platforms.\n\nWe also work with certain business partners, such as other game developers and advertising partners, and information collected from you may be shared through these partnerships.\n\nSome of our business partners are outside Australia. Below is a list of some, but not all, business partners that we actively share user information and site usage data with (this list is subject to change):\n\nAdColony. Located in United States. Read their Privacy Policy;\nAdmob (Google). Located in United States. Read their Privacy Policy;\nAppLovin. Located in United States. Read their Privacy Policy;\nCampaign Monitor. Based in Australia with servers in United States. Read their Privacy Policy;\nChartboost. Located in United States. Read their Privacy Policy;\nFacebook. Located in United States. Read their Privacy Policy;\nHelpshift. Located in United States. Read their Privacy Policy;\nHyprMX. Located in United States. Read their Privacy Policy;\nironSource. Located in Israel. Read their Privacy Policy;\nMech Mocha. Developers of Jetpack Joyride India. Located in India. Read their Privacy Policy;\nMoPub (Twitter). Located in United States. Read their Privacy Policy;\nOneTrust. Located in United States. Read their Privacy Policy;\nUnityAds. Headquartered in the United States with offices throughout the Americas, Asia and Europe. Read their Privacy Policy;\nUpsight. Located in United States, United Kingdom and Canada. Read their Privacy Policy; and\nVungle. Located in United States, United Kingdom, Germany and China. Read their Privacy Policy.\n2.4 Marketing, In-app Purchases & Opting-Out\n2.4.1 Direct Marketing\n\nSometimes we will use your information to tell you about our Services and our news, such as new games we are launching, events we are running, or merchandise we sell. You can opt-out if you dont want to receive this information.\n\n2.4.2 In-app Purchase\n\nSome of our games offer in-app purchases. Examples of in-app purchases are items you can purchase (for real or in-game currency) or other additional features. If you dont want to make in-app purchases, dont use these paid-for options and consider disabling in-app purchases on your device.\n\n2.4.3 Advertising ID\n\nUnderstanding our players is fundamental to creating a fun game that our fans want to play. An advertising ID is a unique ID which gives users better controls and provides developers with a simple, standard system to continue to monetize their apps and ensure customers and given advertising for products and services which match their interests. You can reset your ID at any time via the settings on your mobile device. Collecting your advertising ID helps us understand what your interests are and how we can tailor your experience to match.\n\nApple iOS\n\nYou may reset your devices Advertising Identifier, which will result in your device being disassociated from ad targeting profiles based on the Advertising Identifier in effect prior to reset. You can do this by clicking on Settings -> Privacy -> Advertising -> Reset Advertising Identifier.\n\nGoogle Android\n\nYou can reset your advertising ID by clicking the menu icon to display the apps list, then find and select the Google Settings icon, then find and select \"Ads\" and selecting \"Reset advertising ID\".\n\n2.4.4 Opting-out\n\nWays to opt-out of our Services:\n\nif we send you an email, there will be an unsubscribe link;\nif we post updates via Facebook you can 'unlike' our page and you will no longer get updates;\nif you receive one of our 'tweets'you can stop following us on Twitter; or\nif we use another type of social media you can opt-out using that service.\n\nIf you need help opting-out please contact us at support@halfbrick.com\n\n2.5 Storage, Security & Data Retention\n\nWe store information on servers in Australia, United States, Singapore and Germany.\n\nHalfbrick uses a variety of security technologies and procedures to help protect your personal data from unauthorized access, use or disclosure. For example, we store the personal data you provide on computer systems that have limited access and are in controlled facilities. Because of the limitations of our systems, we do not have standardised retention policies. We try to delete or deidentify data when we no longer require it. We are working towards building new systems that allows us to better manage retention timeframes.\n\n2.6 Access, Correction & Deletion\n\nYou may request access to your personal information at any time by sending a written request to our Privacy Officer by mail at Halfbrick Studios Pty Ltd, 23 Musgrave Rd, Red Hill, Queensland 4059, Australia or by emailing privacy@halfbrick.com.\n\nIf your information changes, let us know so that we can update our records. If you would like us to de-activate your records that we hold, please tell us. Once de-activated your data will not be accessible. Please note data deletion requests can take up to 30 days for residents of the EEA (European Economic Area).\n\n3. Complaints\n\nIf you have any concerns or complaints about your privacy please contact us by:\n\nSubmitting a request through the in game support\nSending a written request to our Privacy Officer by mail at:\n\n\nHalfbrick Studios Pty Ltd\n23 Musgrave Rd, Red Hill\nQueensland 4059, Australia\n\nOur Privacy Officer will respond to your complaint within a reasonable time after we receive it, provided you supply return contact details. If you do not provide return contact details, we will be unable to respond to your complaint, although we will consider its content.\n\n4. Updates to this Policy\n\nWe will update this Privacy Policy from time to time. These updates, will take effect from the date of issue on our website at halfbrick.com. Please check back regularly for updates.\n\n5.Definitions\nAdvertising ID\nA unique ID that is generated for your device to track activity by advertising companies to improve their service in game. This is also known as Interest Based Advertising. You may be able to opt-out of this feature on some platforms. You may also be able to reset your advertising ID on your device.\nanalytics\nInterpretation and interpolation of unidentified data to predict and isolate trends relating to game play and app use.\nChild Safe App\nFruit Ninja Academy: Math Master\nin-app purchase\nAn in-game system that allows exchanging real money for virtual goods or in-game currency.\nIP Address (Internet Protocol Address)\nA unique string of numbers separated by full stops or commas that identifies each computer using the Internet Protocol to communicate over a network. These numbers are usually assigned in geographic blocks.\nHalfbrick (\"us\")\nHalfbrick Studios Pty Ltd ACN 109 693 227 its assignees, licensees, successors in title and subsidiaries.\nServices\nServices offered by us and includes our games, websites and related services.\nStorefront\nAn online business presence for sales. We work with Apple's App Store, Google Play and Amazon Appstore storefronts as our primary storefronts for sales but our games are also available on Windows Store, Xbox Marketplace and many others.\nTerms of Service\nRules and conduct standards that are defined that one must comply with to use the service.\nthird party services\nServices provided by a provider that is not owned or controlled by Halfbrick.\n\n\n\n\n\nReturn to Top\n 2017 Halfbrick Studios", "Developer Terms of Service": "Terms of Service\nLast updated on 16st November 2018\n\n\n1. Introduction\n\nThese terms of use (Terms) set out the relationship between you and Halfbrick Studios Pty Ltd (ABN 89 109 693 227) (us or we) regarding your use of our games and services.\n\nFor the meaning of certain words and phrases please see the Definitions below.\n\nBy downloading, playing or accessing our Services you agree to these Terms. You agree that the Privacy Notice and House Rules form part of these Terms.\n\nPlease read these Terms. If you do not understand these Terms, or do not accept any part of them, then you should not use or purchase the Services. By installing, using or accessing our Services you accept our Terms, Privacy Policy and House Rules.\n\nIf a child wishes to use our Services, the childs legal guardian agrees to these Terms as a precondition to the childs use.\n\nYou can access these Terms at any time at halfbrick.com. We reserve the right, at our sole discretion, to change, modify, add or remove portions of our Terms, Privacy Policy and House Rules by posting the amended terms at halfbrick.com. Your continued use of our Services confirms your acceptance of the updated Terms, Privacy Policy or House Rules.\n\n2. Right To Use Our Services\n2.1\n\nSubject to these Terms, we grant you a non-exclusive, non-transferrable, non-sublicensable, limited right to use our Services for your own personal, non-commercial, entertainment purposes. You agree not to use our Services for any other purpose. The rights granted to you are subject to your full compliance with these Terms.\n\n2.2\n\nExcept as set out in clause 2.2 above, you do not receive any other license and we retain all right, title and interest in and to the Services. This means we own at all times all copyright, trade marks, code, software, characters, themes, character names, game names, storylines, dialogue, settings, artwork, sounds effects, music, in-app items, gameplay recordings, trade secrets, patents, titles, and any and all rights in, or derived from, the Services. The Services must not be copied, reproduced or distributed in any manner or any medium without our prior written consent, which will be granted or withheld in our sole discretion.\n\n2.3\n\nThe licence ends on the earlier of your disposal of the Services or our termination of the licence in accordance with these Terms.\n\n3. Virtual Items\n3.1\n\nOur Services may include Virtual Items. These items can be earned through gameplay or purchased with legal currency or Provider Credits.\n\n3.2\n\nYou agree that Virtual Items only exist within our Services and can never be exchanged for real money, real goods or real services from us or anyone else. You do not own Virtual Items but instead you purchase a limited personal revocable licence to use them. Any balance of Virtual Items does not reflect any stored value.\n\n3.3\n\nWe reserve the right to control, regulate, change or remove any Virtual Items without notice and without any liability to you.\n\n3.4\n\nYou are not entitled to bring any Claims in respect of, and do not suffer, any Loss as a result of any \"loss\" of or \"damage\" to your Virtual Items. To the full extent permitted by law, we will not be liable to compensate you in respect of any matter whatsoever related to the Virtual Items, including but not limited to any Loss you allege to have suffered or any Claims you allege to be entitled to bring.\n\n3.5\n\nIf we suspend or terminate your Account due to your breach of these Terms you will lose any Virtual Items that you may have and we will not compensate you for this loss or make any refund to you.\n\n3.6\n\nIf you successfully request that your personal data be deleted in accordance with the Privacy Notice, you will permanently lose all your Virtual Items, and other Account information, will not have any right to refund. Once deleted, we can no longer associate such any Virtual Items with you.\n\n4. Your Obligations\n4.1\n\nYou will not:\n\nrent, lease, lend, sell, transfer, redistribute or sublicense our Services, or make our Services available over a network where it could be used by multiple Devices at the same time. If you sell or otherwise dispose of, transfer or assign any Devices containing our Services, you must remove any copies of our Services before doing so;\nuse or promote the use of any form of cheats, modifications, exploits or other unauthorised means to interfere with, or gain undue advantage in your use of, our Services;\nuse the Services for any commercial purpose without our prior written connect. Without limiting the foregoing you must not make our Services available for public use such as in a games arcade, use our Services within your own products or content such as in television programmes or films, use our Services in advertising, solicitation or transmission of any commercial advertisements in any way;\nattempt to disrupt or burden the normal operation of our Services, or any of our infrastructure or any of our other business activities;\nattempt to gain unauthorised access to our Services;\nmake any automated use of our Services;\nimpersonate any other person in your use of our Services;\npost another persons personal information or data through our Services without that persons consent;\nuse our services to distribute any information, content or materials that is in breach of our House Rules\nattempt to decompile, reverse engineer, disassemble or hack any of our Services, or to defeat or overcome any of our encryption technologies or security measures or data transmitted, processed or stored by us;\nuse our Services to harass, abuse, threaten or harm another person or to attempt to, or incite another, to harass, abuse or harm another person or group;\ncopy, distribute, make available to the public or create a derivative work from our Services or any part thereof unless we have first agreed to this in writing;\nuse our Services to gather, accumulate or otherwise aggregate information or data including, but not limited to, data or information about us, our Services or other users; or\nuse our Services in connection with the actual or attempted contravention of any laws.\n\n4.2\n\nYou are responsible for ensuring that your installation and use of our Services does not cause you to exceed any data usage quotas or other limitations that may apply to your internet service or other services acquired from third parties.\n\n4.3\n\nYou must comply with the terms of service of the relevant digital storefront where you obtained our Services, including but not limited to the Apple iOS App Store, the Google Play Store and the Amazon App Store.\n\n4.4\n\nYou must comply with any applicable third party terms of agreement when using our Services, such as Facebooks terms of use.\n\n4.5\n\nInformation that you provide to us must be true, accurate and complete at all times.\n\n4.6\n\nTo use our Services you must:\n\nnot be located in a country that is subject to an embargo by the government of the United States of America or the Commonwealth of Australia;\nnot be included on any list of prohibited or restricted parties by the government of the United States of America or the Commonwealth of Australia; and\ncomply with the laws that apply to you in the location that you access our Services from. If any laws applicable to you restrict or prohibit you from using our Services, you must comply with those legal restrictions or, if applicable, stop accessing and using our Services.\n\n5. User Interaction\n5.1\n\nTo use our Services you must:\n\nour Services may enable you to communicate with other users, or to post materials that may be made publically available;\nyou are solely responsible for the User Content that you post on, through or in connection with our Services;\nyou grant us a royalty free, worldwide, non-exclusive, sub-licensable right to use any User Content (including your Intellectual Property) created or submitted using our Services;\nUser Content is considered non-confidential and non-proprietary. If you have an idea or information that you would like to keep confidential and/or dont want others to use, do not post it on our Services. We have no obligation to evaluate, use or compensate you for any ideas or information you choose to submit;\nyou will comply with our House Rules at all times when posting material and interacting using our Services;\nwe may reject, refuse to post, modify or delete any User Content for any or no reason, including, but not limited to, User Content that in our sole opinion violates these Terms, our Privacy Policy or our House Rules. This may be conducted by our representatives or by technology that may monitor and/or record your interaction with our Service;\nyou are responsible for all risks associated with the use of any User Content available when using our Service. We are not responsible or liable for the accuracy or content of user posts or transmissions made by other users of our Services, and we are not liable for any Loss or Claim resulting from any action taken or reliance made by you regarding any User Content; and\nyou are solely responsible for interaction with other users of our Service and any other parties that you interact with through our Services. We reserve the right to become involved in these disputes at our sole discretion. If you have a dispute, you release us from claims, demands and damages of every kind and nature, known and unknown, arising out of or in any way connected with the dispute.\n\n6. Intellectual Property\n6.1\n\nYou agree that all Intellectual Property relating to our Services is owned by or licenced by us. Our Services are being licensed to you and you understand that no title or ownership in our Services is being transferred or assigned and these Terms are not a sale of any rights in our Services.\n\n6.2\n\nOur Services may allow you to create User Content. To the extent that any User Content created by you gives rise to any Intellectual Property rights, you will retain ownership of these, and you grant us a worldwide, perpetual, irrevocable, royalty-free, fee-free, fully transferable and sub-licensable licence to use, exploit or modify your User Content in any way and for any purpose, without compensation to you. You further agree not to enforce, and otherwise waive to the fullest extent legally possible, any moral rights that you may have now or in the future in respect of your User Content.\n\n7. Accounts and Login\n7.1\n\nCertain parts of our Services may enable you to create an Account or otherwise login to the Services. Where you do so you must take reasonable steps to protect your log in details and keep them secret. You are responsible for all activities performed using your Account whether the access is authorised by you or not. We will assume anyone using your Account has your permission to do so.\n\n8. Updates & Access To Our Services\n8.1\n\nWe have the right to withdraw or modify our Services (in whole or in part) at any time for any reason. For the avoidance of doubt, you understand that we have the right to alter our Services at our sole discretion.\n\n8.2\n\nYou understand that there may be times when our Services or any part of our Services are not available for technical or maintenance related reasons, whether on a scheduled or unscheduled basis.\n\n8.3\n\nYou understand that:\n\nwe may, at our sole discretion, provide Updates and we may require you to accept the Updates to our Services;\nyou may need to update third party software from time to time in order to receive our Services;\nit is your responsibility to update our Services and third party software when updates are available. We are not liable for any Loss that you may suffer as a result of your failure to update; and\nwe are not obliged to support our Service by providing advice, training, error-correction, modifications, new releases, enhancements, hosting, telecommunication, internet or other services in relation to your use of our Services\n\n9. Third Party Services\n9.1\n\nThird party services may be used when you:\n\npurchase, install or update our Services, including but not limited to digital storefronts such as the Apple iOS App Store, Google Play Store, Amazon App Store; and\nuse our Services, including but not limited to gameplay recording and sharing, social media connectivity and the like.\n\n9.2\n\nThese third party services are subject to respective third party terms and conditions. Please study these third party terms and conditions carefully as they constitute an agreement between you and the applicable third party service provider. We are not liable for the activities of any such third parties.\n\n9.3\n\nOur Services may contain links (including via advertisements) to third party websites or other third party content or services. Those links are provided for convenience only and may not remain current or be maintained. You understand that:\n\nlinks to third party content or services are not endorsements, approvals or recommendations by us of the third parties, or of any content or services provided by them;\nyour use of any third party content or services may be subject to separate terms and conditions; and\nwhen you provide data to third parties you are providing it in accordance with their privacy policy (if any) and our Privacy Policy does not apply in relation to that data.\n\n10. Advertising\n10.1\n\nYou understand that:\n\nour Services may feature advertisements from us and/or third parties;\nwe may at our sole discretion introduce advertising into any of our Services that do not presently contain advertising, unless we have explicitly stated that that Service will be an advertising-free Service;\nwe are not responsible for the content of any third party advertisements, nor the content of any website or other materials that may be linked to by third party advertisements, and you view those third party websites and materials at your sole risk; and\nwe provide information to third party advertisers in accordance with our Privacy Policy.\n\n11. Termination Of Account Or Services\n11.1\n\nWe reserve the right to limit, suspend, terminate, modify or delete your Account or your access to our Services or portions of our Services (including User Content) if you, or we suspect that you are, failing to comply with any of these Terms, our Privacy Policy or our House Rules or for any actual or suspected illegal or improper use of our Services, with or without notice to you.\n\n11.2\n\nIf we terminate your Account, other than for inactivity, you must not access any other Accounts, or create any further Accounts.\n\n11.3\n\nWe reserve the right to delete your Account if no activity is conducted by you in relation to the Account for 180 or more days. If your Account is deleted for this reason, you will no longer be able to access and/or use any Virtual Items associated with that Account and no refund will be offered to you.\n\n11.4\n\nYou understand that if you delete your Account, or if we delete your Account in accordance with these Terms, you may lose access to any data previously associated with your Account (including, without limitation, the level or score you have reached in our Services and any Virtual Items associated with your Account).\n\n11.5\n\nUpon termination, you must destroy any remaining copies of our Services and any associated documentation or otherwise return or dispose of such material as we direct.\n\n11.6\n\nYou agree to compensate us, according to law, for all losses, harm, claims and expenses that may arise from any breach of these Terms by you.\n\n12. Disclaimer & Release\n12.1\n\nTO THE FULLEST EXTENT PERMITTED BY LAW, WE ARE NOT LIABLE FOR ANY CLAIMS OR LOSSES ARISING DIRECTLY OR INDIRECTLY FROM:\n\nA FAILURE TO PROVIDE OUR SERVICES, OR ANY PART THEREOF;\nCORRUPTIONS TO OR LOSS OF DATA, ERRORS OR INTERRUPTIONS OCCURRING IN THE COURSE OF USING, OR AS PART OF, ANY OF OUR SERVICES;\nANY SUSPENSION OR DISCONTINUANCE OF ANY OF OUR SERVICES, OR ANY PART THEREOF; OR\nANY USE OF OUR SERVICES BY OTHER USERS, INCLUDING ANY USE OF OUR SERVICES BY OTHER USERS WHICH CONTRAVENES THESE TERMS.\n\n13. Warranty\n13.1\n\nOUR SERVICES ARE PROVIDED ON AN AS IS AND AS AVAILABLE BASIS FOR YOUR USE. YOU UNDERSTAND THAT OUR SERVICES CANNOT BE GUARANTEED TO BE ERROR FREE AND THE EXISTENCE OF ANY ERRORS WILL NOT BE A BREACH OF THESE TERMS.\n\n13.2\n\nEXCEPT AS EXPRESSLY PROVIDED TO THE CONTRARY IN THESE TERMS, AND TO THE FULL EXTENT PERMITTED BY LAW:\n\nWE WILL NOT BE LIABLE TO YOU FOR ANY LOSS, INCLUDING SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES (SUCH AS LOSS OF PROFITS), OR CLAIM, ARISING OUT OF BREACH OF THESE TERMS OR ARISING OUT OF THE SUPPLY OF DEFECTIVE SERVICES;\nOUR LIABILITY FOR ANY TERM, CONDITION, GUARANTEE OR WARRANTY THAT IS IMPLIED BY LAW AND CANNOT LAWFULLY BE EXCLUDED BY US, INCLUDING THE CONSUMER GUARANTEES SET OUT IN THE AUSTRALIAN CONSUMER LAW CONTAINED IN SCHEDULE 2 OF THE COMPETITION AND CONSUMER ACT 2010 (CTH) AND ALL SIMILAR OR EQUIVALENT LEGISLATION, RULES AND REGULATIONS IS LIMITED TO (AT OUR OPTION):\nIN THE CASE OF GOODS (TO THE EXTENT OUR SERVICES ARE CONSIDERED A GOOD UNDER APPLICABLE LAW)  REPAIRING, REPLACING OR SUPPLYING EQUIVALENT GOODS, OR PAYING THE COST OF ANY OF THOSE REMEDIES TO THE YOU; OR\nIN THE CASE OF SERVICES  SUPPLYING THE SERVICES AGAIN OR PAYING THE COST OF HAVING THE SERVICES SUPPLIED AGAIN; AND\nOUR MAXIMUM AGGREGATE LIABILITY TO YOU FOR ANY LOSSES YOU INCUR OR CLAIMS YOU MAKE AGAINST US IS LIMITED TO THE SUM OF AUD$10.\n\n13.3\n\nYOU AGREE THAT YOU HAVE EXERCISED YOUR INDEPENDENT JUDGMENT IN ACQUIRING OUR SERVICES AND HAVE NOT RELIED ON ANY REPRESENTATION WE HAVE MADE WHICH HAS NOT BEEN STATED EXPRESSLY IN THESE TERMS OR UPON DESCRIPTIONS OR ILLUSTRATIONS OR SPECIFICATIONS CONTAINED IN ANY DOCUMENT INCLUDING CATALOGUES OR PUBLICITY MATERIAL PRODUCED BY US.\n\n13.4\n\nIF YOU PURCHASED OUR SERVICES FROM THE IOS APP STORE, IN THE EVENT OF ANY FAILURE OF OUR SERVICES TO CONFORM TO ANY APPLICABLE WARRANTY, YOU MAY NOTIFY APPLE, AND APPLE WILL REFUND THE PURCHASE PRICE TO YOU. YOU AGREE THAT, TO THE MAXIMUM EXTENT PERMITTED BY LAW, APPLE WILL HAVE NO OTHER WARRANTY OBLIGATION WHATSOEVER WITH RESPECT TO OUR SERVICES, AND ANY OTHER CLAIMS, LOSSES, DAMAGES, COSTS OR EXPENSES ATTRIBUTABLE TO ANY FAILURE TO CONFORM TO ANY WARRANTY WILL BE DEALT WITH BY US IN ACCORDANCE WITH THESE TERMS.\n\n14. Security\n14.1\n\nUnfortunately, no data transmission over the internet can be guaranteed as totally secure. While we strive to protect such information, we cannot guarantee the security of any information you transmit to us. Accordingly, any information which you transmit to us is transmitted at your own risk. However, once we receive your transmission, we will take reasonable steps to preserve the security of it.\n\n14.2\n\nYou must take your own precautions to ensure your access to our Services does not expose you to the risk of viruses, malicious computer code or other forms of interference which may damage your Devices. We do not accept responsibility for any interference or damage to your Devices which arises in connection with your use of our Services.\n\n15. Privacy\n15.1\n\nWe will collect, process, use and share your personal information in accordance with our Privacy Notice, as set out in these Terms and as you otherwise consent. Our Privacy Notice forms part of these Terms.\n\n15.2\n\nBy using our Services, you agree to these Terms, including our Privacy Notice, and acknowledge that your agreement is a precondition to your use of the Services.\n\n15.3\n\nAny personal information that we collect may also be subject to the policy of any social network that you may agree to link our Services to. If you use our Services and you agree to allow them to interact with a social network you are giving us permission to use any information which that social network shares with us that will allow us to personally identify you. You are also granting us permission to help your contacts on that network find you so that you can play socially. This is intended to make our Services more enjoyable for you and others that use our Services on that social network. If you do not agree to these practices you should not allow our Services to interact with your social network.\n\n15.4\n\nWe may use cookies, or similar technologies to store certain types of information each time you use our Services. They may for example be used to help us recognise your device and to ensure that your Account is accessed by the person that inputs the correct username and password for that Account. You can find out more about how we use cookies and other similar technologies by reading our Privacy Notice.\n\n16. General\n16.1\n\nAssignment - We may wish to transfer all or a part of our rights or responsibilities under these Terms to someone else without obtaining your consent. You agree that we may do so provided that the transfer does not significantly disadvantage you. You may not transfer any of the rights we give you under these Terms unless we first agree to this in writing.\n\n16.2\n\nEntire agreement - These Terms, our Privacy Policy and our House Rules set out the entire agreement between you and us concerning our Services and they replace all earlier agreements and understandings between you and us.\n\n16.3\n\nSeverability - If any part of these Terms are found to be invalid or unenforceable, that part will be limited or eliminated to the minimum extent necessary so that these Terms will otherwise remain in full force and effect and enforceable.\n\n16.4\n\nWaivers - Our failure to exercise or enforce any of our rights under these Terms does not waive our right to enforce such right. Any waiver of such rights shall only be effective if it is in writing and signed by us.\n\n16.5\n\nGoverning Law - These Terms are governed exclusively by the law in force in Queensland, Australia. All legal actions in connection with these Terms shall be bought in the state or federal courts located in Queensland, Australia.\n\n16.6\n\nForce Majeure - Notwithstanding anything else contained in these Terms, we are not liable for any delay in or failure to comply with these Terms if the delay or failure is caused by circumstances beyond our reasonable control, including without limitation, fire, flood, act of God, strikes, lock outs, stoppage of work, trade disputes or any act of war or terrorism.\n\n17. Contact\n17.1\n\nIf you have any questions about these Terms or our Services you may contact us at:\n\nHalfbrick Studios Pty Ltd\nAddress: 23 Musgrave Rd, Red Hill, Queensland 4059, Australia\nTelephone: +61 7 3356 0429\nEmail: support@halfbrick.com\n\n\n18. Definitions\n18.1\n\nIn these Terms, unless the context otherwise requires, the following words have the following meanings:\n\nAccount means a user account registered in accordance with clause 3.1.\nApple means Apple Inc. of 1 Infinite Loop, Cupertino, California.\nClaim means any action, claim, proceeding or demand whatsoever, whether presently existing or arising at any time in the future and whether referable to events or circumstances which have already occurred or which may occur in the future.\nHouse Rules means the rules users participation in our various social media forums which is available for access at halfbrick.com/houserules.\nIntellectual Property includes all rights throughout the world in relation to patents, copyright (including moral rights), designs, registered and unregistered trademarks, trade secrets, know-how and confidential information and all other intellectual property and any right to register those rights, whether created before or after the date of this document, and in all cases for the duration of those rights and any renewal.\nLoss means all losses, costs, expenses and damages (including legal costs and disbursements) sustained or incurred, whether directly or indirectly or consequentially or in any other way.\nProvider Credits means currency-like credits held by you with a third party provider. Facebook Credits are an example of Provider Credits.\nPrivacy Policy means our privacy policy, as updated from time to time, which is available for access at halfbrick.com/pp.\nServices means services offered by us and includes our games, websites and related services.\nTerms means the terms set out in this document, as updated from time to time.\nUpdate means an update supplied by us that replaces or supplements the original Service and may include adding, removing, modifying or otherwise altering features of our Services at our sole discretion.\nUser Content means any content generated, created, made or otherwise brought about as a result of using our Services. In the context of user interaction, this includes any communications, images, sounds and all the material, data, and information that you upload or transmit through our Services, or that other users upload or transmit, including without limitation any chat text.\nVirtual Items means any virtual items or objects or other entitlements for use in the context of our Services, and includes any form of virtual currency.\n\n\n\n\n\n\nReturn to Top\n 2018 Halfbrick Studios", "Space Required": "748.5 MB"}



["5 stars\n40%\n4 stars\n27%\n3 stars\n17%\n2 stars\n7%\n1 star\n9%", "MasterDecoySGJun 25 at 1:22 AM\nCompetent\n\nPros:\nSimple - it's not a complicated game, I purchased it for my 5yo son (whom suffers from mild asd) to play to help him with his coordination. He picked it up within minutes and was even competently using both swords on Zen mode.\n\nQuick - each round lasts minutes at the most making it an hit at parties to see who can get the best score.\n\n\nCons:\nLacking content - it's simplicity is also it's downfall, honestly outside of a social setting, I would struggle to recommend this title long term, there is little to bring you back after the novelty wears off bar trying to top your high score.\n\n\nOverall:\nThe game is appropriately priced for what it is.\n\nIf you want to bulk out your party games, this one will serve you well.\n\nIf your looking for a title to play by yourself, probably give this one a miss.\n\nHelpful | 80\nDeveloper ResponseJul 1 at 1:10 AM\n\nHi MasterDecoySG, First of all, it's awesome to hear that this game is helping your son! This adds another great dimension for us on top of providing entertainment. We also appreciate the feedback - if there's anything you'd like to suggest that would help make the experience better, please feel free to send suggestions at FruitNinjaVRSupport@halfbrick.com or on our discord: https://discord.gg/VFv38s Thanks! -- Guillaume", "DagGrenvalJul 2 at 1:12 PM\nExcellent but needs more replay value\n\nGame is great fun for all ages, several game modes and good tracking makes this fun and also gives you a workout if you really get into it.\nSeveral different blades you can earn from play but once you have a few of those it loses some replay value.\nSome more levelling rewards would help keep it fresh in future updates.\nHowever for a relatively cheap game it is great fun and the kids love it\n\nHelpful | 11", "Brick0228Jun 22 at 11:49 AM\nWell done!\n\nThe game is enjoyable! The atmosphere and gameplay have been well designed, and its just flat out fun slicing up fruit! I do find myself looking for a settings screen where I can select some aspects of gameplay, like difficulty level, the ability to add another player and maintain a user specific scoreboard showing the achievements of different family/friends who use the VR. Other than that, though, I think its a worthwhile purchase. I recommend it.\n\nHelpful | 5\nDeveloper ResponseJul 1 at 12:59 AM\n\nHi Brick0228, Great to hear you're enjoying the game, and thanks for the suggestions too! If I can offer a bit of help, while in the main menu you can access the settings by pressing A or X on one of your controllers! A menu will appear near your hand and in there you can opt to use \"local\" leaderboards that will allow you to enter a name at the end of a game. Hopefully this makes it a 5-star game for you ;) Cheers! -- Guillaume", "DragoniatApr 29 at 12:05 PM\nGameplay is good,but it needs more stuff\n\nI love the gameplay in this game and I have so much fun playing it, but I think it needs more stuff you can unlock that dont affect gameplay. I love the blades, those are fine but I just unlocked the second to last one (the last one you have to slash 50,000 fruit which will take a long time) and I feel less motivated than before. Dont get me wrong, I still have so much fun, but I just dont have anything to unlock, so I dont need to grind fruit that much. I feel that you should add skins to the basket carriers and maybe a sword that you can customize, other than that the game is great and I would definitely recommend.\n\nHelpful | 50\nDeveloper ResponseMay 10 at 3:56 PM\n\nHi Dragoniat, Thank you for your review, and for the feedback - it's all very valuable to us. If you have more suggestions, please join our discord: https://discord.gg/VFv38s Thanks! -- Guillaume", "gmn620Jul 9 at 3:27 PM\nIt is a pretty good game\n\nI think this game is pretty good. Only 1 problem, the hit boxes. Not talking about the bomb hit boxes( Those were fixed ) but the fruit hit boxes. About 25% of misses still slice the fruit. I know the point of the game is to slice the fruit, but if I miss I feel like I should get a strike for it. I know the hit boxes are hard to make right and though, and its still a fun game.\n\nHelpful | 0", "JohnmcmuffinJul 4 at 9:08 PM\nGreat Game, but...\n\nThis game is a lot of friend and makes me remeber the original iPhone game. Great for new users and fun to play with friends your with, yet could use some fresh additions. Maybe add multi-player somehow? I feel like all VR games are 10x better with friends. Love the game and great fun for playing with friends.\n\nHelpful | 0", "DivineHandrail22 days ago\nFun and enjoyable\n\nLove the mobile version and love the vr version, but the bomb hit box and the lack of customization make it get old a little fast, improve this and it could go down in vr history, but until then we have what is basically just a paid mini game\nEdit: with the last update, it feels a lot less like walking through a literal mine field, pray not to make a wrong step by edging a little too close, and more like actual fruit ninja fruit hotbox is larger the faster you swing letting you get those long combos with how vr can works sometimes. And bombs are and easy to miss if you pay attention. That makes classic and arcade not only bearable(sorry if this is spelled wrong) but fun and enjoyable\n\nHelpful | 0", "Tfang24Jul 7 at 12:01 PM\nJust my opinion\n\nFruit ninja has been part of my childhood. I might not be that old but seeing fruit ninja transition from a mobile game to a VR game just blew my mind. When I launch the app. I was ver excited to play and the first few couple of game it was just amazing. But after a few minutes of game play. Ive noticed some mechanics that are kind of hard to use. For example you can deflect bombs in this game but you have to do it slowly and carefully. The issue with the mechanic is the fact that sometime the game does not register you deflecting the bomb but instead counts it as cut. So far I can only think of a few alternative to the problem and that is to make it easier for the bigger swords to deflect bombs, or you can make the swords cut only there blade side. I was playing around in the game to see how the swords will cut and the game will register cuts from the flat side of the sword. So if I was to hit every fruit with the flat side of the sword at a fast pace. It will cut every fruit that so Thrown at me. Lastly I feel like if you add tiers to the swords where you have to do certain challenges to unlock certain abilitys. That is would make grind fruit ninja more worthwhile. Other than that this game has not been disappointing to me. 10 out of 10 would recommend to others\n\nHelpful | 3", "ZethriaJul 22 at 9:18 PM\nAlright\n\nI wish I couldve rated this 5 stars like my other vr games but its just not that great, the game itself is fun and a good idea but if a fruit is outside your view which happens every game and every few seconds youll miss it most of the time. Extremely hard to have fun when this is a constant issue, I dont doubt there are people who master it and dont have to worry about this anymore but for me and for a lot of other people its a huge issue, if this happens to get fixed Ill happily change my rating to a 5 star, its the only thing holding me back from playing constantly and enjoying it\n\nHelpful | 0", "LizDianaJul 29 at 1:01 PM\nLove this game!\n\nThis is a well done game from the graphics to the content. Really enjoy this, especially Survival Mode. Would love to see a campaign/journey mode to enrich the game & motivate return play. Or new locations that you can unlock. Please continue to make FN better, my family & I love this game!!\n\nHelpful | 0", "dellrito16 days ago\nDoes not allow update\n\nI have tried to update, but it will not work. Im confused and it will only allow me to see play the first version, please reply developers and thank you for your time.\n\nHelpful | 1", "Fares_gamer2007Apr 26 at 7:56 AM\nAmazing But..\n\nGraphics are cool\nGameplay is amazing\nBut the swords are good but not in a good amount/they are not much\nEveryone wants the original swords from the original game on android and ios\nWe want the old Disco blade, the pixel blade, the Dragon Sword, mr. Sparkle, Old glory, Ice Blade, the piano blade, party time blade, the firecracker, The Bamboo Shoot, the rainbow blade, the water blade, the lightning bolt and we want new things like a lightsaber, a chainsaw and the ghostbuster proton blade (but Free) (   )\n\nHelpful | 15\nDeveloper ResponseMay 10 at 3:53 PM\n\nHi Fares_gamer2007, Thanks for the review, and the suggestions! If you have more, feel free to join our discord: https://discord.gg/VFv38s -- Guillaume", "DolphPunJul 16 at 11:01 PM\nDestroy Fruit. Workout upper body.\n\nVisually this is fun, has a number of modes depending on mood. Sometimes I want to be extra precise, dying after only one bomb. Other times I just want to slice indiscriminately in zen mode. Arcade mode was a workout also. The pink butterfly swords are great! You can use different types of swords on each hand for different play styles. Survival is funny as F. Flying critters shooting at you from above!\n\nHelpful | 0", "robvanhooseJun 29 at 7:10 PM\nOur whole family loves this\n\nWere not players of the phone version. We had Fruit Ninja on the Kinect and again on the Kinect 2. We still play it. Played it tonight, in fact, as a family. Were used to full body fruit frenzies and the Quest version doesnt disappoint. This is one of our go to favorites for family time. So happy this is on our Quests.\n\nHelpful | 2", "jobbie1kinobiJun 3 at 7:04 AM\nIts just fun!!\n\nNot overly taxing, no wow factor graphics or absorbing story, its just fun. You chop at fruit with a variety of cool swords. Thats it. And its great fun. If you only have a quick 5-10 mins to let off some steam or get some exercise, this is a nice little game to drop in on.\n\nHelpful | 2\nDeveloper ResponseJun 18 at 10:09 PM\n\nHi jobbie1kinobi, Thanks for the review, and glad to hear you're enjoying the game! -- Guillaume", "Nightflame4566 days ago\nJust like the original\n\nRemember those days where you were in a restaurant and youre waiting for your food, so you pull out your phone to play some classic arcade games?\n\nThis is JUST LIKE THAT!\n\nFully immersive, and a complete new perspective on a timeless classic. Especially the new Survival mode, where you fight flying robots that shoot fruit and bombs at you.\n\nAmazing gameplay and just perfect overall!\n\nHelpful | 0", "ChrisKycklingenJun 7 at 4:03 PM\nIt's fruit ninja. But in VR!\n\nNot much to say here. It's fruit ninja but in VR instead. It's fun and addicting. But there needs to be more content IMO to justify the price tag. But you get a lot of exercise from this, that I can tell ye! Just needs more content.\n\nHelpful | 5\nDeveloper ResponseJun 18 at 10:25 PM\n\nHi ChrisKycklingen, Glad to hear you're enjoying the game! And also thanks for the feedback - we'd love to hear your thoughts regarding what else you'd want to see in the game. Feel free to join our discord and offer suggestions https://discord.gg/VFv38s Hopefully we can work on making this a 5-star game for you :) Thanks! --Guillaume", "MavatooJun 6 at 3:13 PM\nFun in short bursts but could be better\n\nThis reminds me of this same game on other platforms. It is fun in short bursts and is a great intro party game for those new to VR. The two things I have trouble with are: 1) it is (too) easy to miss fruit that is out of you field of view. I think there should be an indicator that you are missing stuff you aren't looking directly at. 2) more haptic feedback in the controllers could make this game feel much better.\n\nHelpful | 2\nDeveloper ResponseJun 18 at 10:22 PM\n\nHi Mavatoo, Thank you for the review and the feedback! Very good suggestions, would love to discuss your them in more detail - feel free to join our discord: https://discord.gg/VFv38s Hopefully we can work on those improvements to make this game worth 5 stars to you :) Thanks! -- Guillaume", "Boom564Jul 9 at 3:15 PM\nSwords\n\nI remember fruit ninja always having hundreds of swords. In the game there is twelve. Otherwise it is a great game.\n\nHelpful | 0", "AK_12Jul 24 at 6:47 PM\nIts alright\n\nNot the best game but it was pretty fun\n\nHelpful | 0", "PhenoramApr 23 at 12:20 PM\nGood\n\nIts pretty much exactly what youd imagine. Its mostly Very well done. Good colors, graphics, no performance issues. Im pleased with my purchase and wont be returning it.\n\nI just bought this, because it was on sale and reviews have said much more positive things lately. Apparently the bomb hitboxes were awful. They clearly improved then because I feel like everything reacts very appropriately to the blade, spatially.\n\nHelpful | 6\nDeveloper ResponseMay 10 at 3:46 PM\n\nHi Phenoram, Thanks very much for the review - glad to hear you're enjoying the game! -- Guillaume", "TheFluffyDuckMar 19 at 6:09 PM\nFix the bomb hit box (Fixed)\n\nUPDATE: Yay, the hitbox issue has been fixed in the latest update. The game is much, MUCH better now. Good to see new content in the game now (although changing the time of day would be good). This is a good intro game for family and friends. It appears the developers listen too. It is fun as I remember it.\n\n--------------------------------------------\nCall me crazy. But perhaps the bomb should have a hit box the size of how it looks? Instead of the invisible 1.5 m sphere of death that they currently are? If you want it to be that huge, then make the graphic to fix the bit box. Its killing the game for me. It never used to be that bad on the steam version of the game.\n\nOnly two of the game modes are playable because the above issue is so broken. As such I wouldnt recommend the game in its current state until that hit box of the bombs is fixed.\n\nHelpful | 18\nDeveloper ResponseMar 29 at 5:08 PM\n\nHi TheFluffyDuck, Thank you so much for taking the time to play Fruit Ninja again and updating your review! Glad to hear you're now enjoying the game even more. Dynamic time of day and weather is only something we support on PC - you can play Fruit Ninja on Oculus Rift for free when you own it on Quest. Thanks! --Guillaume", "sqweepzzzJun 13 at 1:03 AM\nGreat Game for starters!\n\nThis is a good game to show friends or family when introducing VR. Fruit Ninja has some nostalgia to me from my gen1 ipod days and it made me happy to play it reimagined in VR on my Quest!\n\nHelpful | 0\nDeveloper ResponseJun 18 at 10:32 PM\n\nHi sqweepzzz, It's awesome to hear that this game is bringing an original Fruit Ninja fan like you a little bit of that nostalgia! Hope you keep having fun with it for many more years :) Thanks, -- Guillaume", "natiswisa320 days ago\nNo so clear\n\nTo many bugs\n\nHelpful | 0", "restricteddonkeyMay 26 at 12:42 AM\n\nReally good game to play with your family, But I believe that the game could use some more content, like challenges.\nBut overall, its an amazing game. Would recomend.\n\nHelpful | 4\nDeveloper ResponseMay 24 at 5:32 PM\n\nHi restricteddonkey, Thanks a lot for the review, glad to hear you're enjoying the game! We're always keen to hear suggestions on how to improve the game - feel free to share more details on our discord: https://discord.gg/fEPwAs Thanks! -- Guillaume", "jgold624 days ago\nLoved game in 2D, even more in VR!\n\nSwords... Fruit... a fateful meeting... what more needs to be said?\n\nHelpful | 0", "SlightlylessJun 20 at 7:53 AM\nLanguage\n\nFor some reason the game is in German for me. No idea how to change it to English. But besides the language its a nice game with nice graphics.\n20-06 update: got a reply on my review and by pressing A brings you in a pause menu. Look at your right hand and there you can change settings such as language.\n\nHelpful | 0\nDeveloper ResponseJun 18 at 10:39 PM\n\nHi Slightlyless, Glad you're enjoying the game, and sorry about the language issue! The game should use the system language on startup. There is also a settings menu where you can change the Language. While in the main menu, press the \"A\" or \"X\" button on your controller and the settings will appear near you hand. Navigate to \"Settings\" then \"Language\" (both are the bottom option). I hope this solves your problem - if so, please consider updating your review :) Thanks! --Guillaume", "victorepicgamerJul 2 at 9:46 AM\nMy son enjoys\n\nGreat simple fun game. Looking forward to unlocking better swords.\n\nHelpful | 0", "Rundownkiwi736Apr 5 at 10:16 PM\nFruit Ninja\n\nThis game is pretty good I really like it and it's a good game for my younger siblings to play but I hate to say this as you guys have already addressed it the bombs in the game are still kinda sensitive I'm specifically speaking about the game mode Survival I've been trying for hours to get the flame sword but no matter how slow and easy I go the bombs either blow up sometimes they just stop and hit the ground infront of me now I do get an occasional good swing in and fling it but they don't necessarily travel in the direction I fling them they sorta just flop 3-4 feet infront of me. I think a good fix to this doesn't have to be a change in sensitivity to the bombs but maybe have it so the game knows if the side of the sword and not the actual blade part it's the bomb so it's easier to fling back but all in all fun game\n\nHelpful | 5\nDeveloper ResponseApr 6 at 4:03 PM\n\nHi Rundownkiwi736, Sorry to hear the bombs are causing you some trouble. There is more tolerance when hitting the bombs with the side of the blade, but it is a tough balancing act to keep them challenging enough for everyone. The technique I use to destroy enemy baskets is to deflect the bomb with the side of the blade first, and quickly after as it drops closer to my feet, scoop it up to them. Bombs don't detonate for a short period after deflecting them. Thanks! -- Guillaume", "TrippHalpinJul 1 at 3:35 PM\nNice\n\nI like it\n\nHelpful | 1", "lamahunter5 days ago\nFun in moderation\n\nThis game is a blast however at times it can get old. I am also well aware of how it can at times be very addicting for others. Overall I say this game is a great purchase for the price point and would be fun to pass around and share with friends.\n\nHelpful | 0", "TOBIAHJETTMar 15 at 4:27 PM\n\nThis game is only 3 stars because there is only one type of sword. They should make it that you can unlock different swords like lightsabers and other swords. Five stars on gameplay.\n\n\n\n\nUpdate:\nI think you should totally add more custom sabers. I would love it if you could hit the swords together. That would just add realism to the game. I think you should also add that we can avoid bombs and not just hit them. I think you should also give us custom environments like in beat saber. You should also add new game modes. I bet if you give an update every month more people would buy this game.\nThis game is so much potential.\nAll of this would easily make this a five star game. thank you for adding what the community wants.\n\nHelpful | 24\nDeveloper ResponseMar 19 at 5:36 PM\n\nHi TOBIAHJETT, Thanks for your review! In a recent update we added 12 different unlockable blades to the game and also tweaked bombs to be less sensitive. I'm hoping this is what you were after? And I agree about being able to hit blades together, this is something we'd like to look at in the future. We'd love it if you could install the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "CompuChipMay 24 at 12:42 PM\nI love fruit ninja\n\nUPDATED REVIEW:\nThe developer responded that they have updated the games so I gave it another shot. Now THIS is the fruit ninja I have loved for many years and on the platform it was meant for - no wires! If you remotely like Fruit Ninja and you have an Oculus Quest, you owe it to yourself to buy this game right now and give it a shot!\n\nORIGINAL REVIEW:\nI have bought this so many times on different platforms. It is one of my favorite games on the Vive, but on the Quest, the bombs go off if the sword gets even remotely close. If that accuracy could be fixed, I would love this as well; however, I may submit a refund since that is so frustrating.\n\nHelpful | 1\nDeveloper ResponseMay 24 at 5:35 PM\n\nHi CompuChip, Thanks so much for giving the game another chance! The bombs were giving many people a hard time, awesome to hear they've improved for you. Thanks! -- Guillaume", "ADRUUJun 27 at 2:23 PM\nPretty good game!\n\nFrequent content updates so it keeps me coming back would be amazing\n\nHelpful | 1", "HexBlehMay 5 at 10:42 PM\nreally good ! but ..\n\nLove this game just because it's stupid easy to understand and it's really nice to put people into who have never played VR and are looking to give a shot . For that reason alone I would recommend this game but beyond that it's just really fun to play when you don't really want to do anything too intense but still want a fun challenge . everything looks real pretty and works as it should though if I'm nitpicking I could say that the interactions could be polished a little more .\n\nthe only thing I'd like to see is more customization options or maybe even minigames ? but I mean that's a bit of a stretch since the game is already as much as it needs to be at it's core , but there's definitely ALOT of potential for more Unlockables and swords and challenges to keep the game feeling challenging without being dreadfully repetitive IF there are fun and solid challenges to unlock those items .\n\nall in all id totally recomend this game , although I have to agree with most people that it's more of a $5 - 10 game than a $15 one .\n\nHelpful | 2\nDeveloper ResponseMay 10 at 4:04 PM\n\nHi HexBleh, Thanks for the review, and for taking the time to write all this feedback! It's definitely valuable to us. If you have any more suggestions or feedback, please feel free to join our discord: https://discord.gg/VFv38s Thanks! -- Guillaume", "mrmagicalmaxJul 13 at 1:16 AM\nBoring\n\nNo depth, I know it's just fruit ninja but it somehow manages to be more tedious and boring than the phone game\n\nHelpful | 1", "JaulecamposJul 2 at 8:20 PM\nNothing is like the iPhone fruit ninja\n\nBut its fun \n\nHelpful | 0", "ThatoneintrovertJul 8 at 12:09 PM\nLove it\n\nIts simple but good\n\nHelpful | 0", "PoloKnight1May 3 at 7:40 PM\nOK\n\nEdit: fixed some accuracy/sensitivity issues with bombs and have added a little customization. At the end of the day, you know exactly what youre getting- same FN thats been around forever (just w/more VR-ness)\n\nHelpful | 2\nDeveloper ResponseMay 10 at 3:58 PM\n\nHi PoloKnight1, Thanks for giving the game another chance after the update - glad to hear the issues with bombs were resolved for you! If you have any suggestions or feedback, please feel free to join our discord: https://discord.gg/VFv38s Thanks! -- Guillaume", "Xaal13Mar 27 at 1:44 PM\nWhat you think you know is wrong.\n\nThe reviews for this game mostly have teo things they complained about 1. Lack of customization. 2. The bombs hitboxes. As of 6 days ago (march 21st) the developers launched a new update fixing both issues 1. Now you can change what blades you use not just one default katana set. 2. The bomb hitboxes were abysmal to say the least, now admittedly it could be a little bit smaller but usually if you hit it now it is your fault not the game's. I personally have almost all unlockable blades (missing holiday and slice 50,000 fruit) this was only possible due to the bomb hitbox fix and it is I assure you, so play the dang game it's fun.\n\nHelpful | 8\nDeveloper ResponseMar 29 at 4:44 PM\n\nHi Xaal13, Thank you for your review! The bombs were a bit of a headache but I'm happy to see people agree they've improved now. And well done with your blade collection ;) --Guillaume", "EJBearBeckerApr 14 at 12:11 PM\nGameplay good, but...\n\nI have been playing nonstop to try to get the shadow blade and today I finally cut 50000 fruit so I can unlock it. The game says that if you cut 50000 fruit you unlock the sword, but for me, the progress bar disappeared but the lock Is still floating around the sword. Is this supposed to happen? Whenever I try to slice the bomb to exit the blade section it puts me back to a different blade and wont let me use the shadow blade. If there is a way to fix this, if so, please let me know.\n\nHelpful | 2\nDeveloper ResponseApr 19 at 5:45 PM\n\nHi EJBearBecker, Glad to hear you're enjoying the game! Also, sorry about the issues you're having with the shadow blade. A couple of people have reported problems with certain blades not always unlocking and we will be investigating them, hoping to have a fix in the near future. For the moment I can only advise to try restarting the game, play a round and head back to the blades menu. If you're still experiencing the same issues, please send an email to FruitNinjaVRSupport@halfbrick.com Thanks! -- Guillaume", "Darkness0428Jul 5 at 4:20 PM\n\nI'm addicted\n\nHelpful | 0", "TypicalBobMay 19 at 5:59 PM\nDEVELOPERS PLEASE RESPOND\n\nI Like the gameplay but it needs more like maybe a story mode where u are trained by the ninja from the mobile version I was bored within 30 mins but I like the swords I think this game is for new VR gamers now please FIX THE BOMB HITBOX PLEASE sorry lost my temper BUT THE HIT BOX IS HUUUUGGEEE IT DRIVES ME NUTS i did a test and hit one fruit with a blade and stopped way back from a bomb but the bomb and all of the fruit in between were sliced developers if you read my review I like your game and it is the first VR game I ever played but the bomb hit box needs to be fixed please respond developers AND FIX THE BOMB HITBOX sorry I also cant get the bomb to hit a basket bot it always blows up in my face can you also tell me how I got the butterfly blade I didnt do anything but I like your game and I know it has great potential thank you\n\n\nEDIT: thanks for responding!!!!! \n\nI cant do the website review because I dont know what email to use soooooooo sorry\n\nHelpful | 0\nDeveloper ResponseMay 10 at 4:10 PM\n\nHi TypicalBob, Thanks for the review! We've made improvements to the sensitivity of bombs in a previous update and most people seemed happy with the changes. If you're still experiencing issues with them we'd like to investigate, please send us more details at FruitNinjaVRSupport@halfbrick.com or on discord: https://discord.gg/VFv38s As for the enemy baskets, you have to block the bomb with your blade then scoop it towards them - it is definitely challenging, but possible :) Thanks! -- Guillaume", "VantageVR_YTMay 4 at 1:41 AM\nAwesome game\n\nI have had this game for about 2 weeks all I have to say its very fun the developers have made an awesome game but I have some recommendations you could add physics to the swords like they cant go through each other and another recommendation is maybe you could add a multiplayer slashing mode where you have to get a higher score then your friend they would be standing next to you and they could knock bombs into your area Awesome game though \n\nHelpful | 1\nDeveloper ResponseMay 10 at 4:00 PM\n\nHi VantageVR_YT, Thank you for the review, glad you're enjoying the game! Those are all very good suggestions, if you have more please feel free to join our discord: https://discord.gg/VFv38s -- Guillaume", "EdgY_Rxftz09May 22 at 5:21 AM\nNostalgic\n\nThis game brings back so many child memorys! It is a very fun, and great game.(not flexing)my highscore is 1056\n\nHelpful | 2\nDeveloper ResponseMay 24 at 5:32 PM\n\nHi EdgY_Rxftz09, Awesome to hear that the game is bringing back those sweet Fruit Ninja memories :) Thanks a lot for the review! -- Guillaume", "dark_mateo34Jun 10 at 8:17 PM\nA lot of fun\n\nI really liked the game and Ive been playing just this game for about a few days now\n\nHelpful | 0\nDeveloper ResponseJun 18 at 10:29 PM\n\nHi dark_mateo34, Thanks very much for the review - glad you're having a good time with the game! -- Guillaume", "DigitalDrittenMar 29 at 4:54 PM\nImproved\n\nEdit: The new sword skins look fun! Although, I would like a noise when the two blades collide, it seems unnatural when they just ghost through each other with no reaction. Accuracy seems to be improved. The leaderboard after each game is nice, but I still can't access the supposed local leaderboard through the settings menu. Clicking leaderboards, then any of the options, just acts like a back button. The settings menu could definitely still use improvements, but the rest of the game is better!\n(Previous review:\nDisappointing. It seems like you can't save highscores or view leaderboards at all. You can't unlock new sword skins or anything. The sword hitting the fruit / bombs isn't as accurate as it should be.)\n\nHelpful | 1\nDeveloper ResponseMar 30 at 4:02 PM\n\nHi DigitalDritten, Thanks for your review - glad to hear your experience has improved! When you select \"Local\" leaderboards it does return to the previous menu, but it should then remember to display your local leaderboard at the end of every game and prompt you for your name if you made it on the leaderboard. I agree the settings menu, could do with some improvements. Thanks for the suggestions - if you're interested to discuss more, please join the Fruit Ninja VR discord on https://discord.gg/sB8kWh Thanks! --Guillaume", "ixi87Apr 13 at 9:05 AM\nSurprisingly addictive!\n\nI didn't expect much seeing as I wasn't into the phone game much but the idea seemed perfect for VR and it is! Well implemented, swords feel very precise and I appreciate how fast it is to jump into a new game. I do hope they keep working on it, I'd like to see additional modes, maybe have the ability to start with more heli's when playing survival and getting special fruits like in the other modes to switch it up a bit. I'd also like to see the scores of my friends. Keep up the great work!\n\nHelpful | 2\nDeveloper ResponseApr 13 at 9:06 PM\n\nHi ixi87, Thanks a lot for your review, I'm glad to hear you're enjoying Fruit Ninja in VR! Good suggestions all round - if you have more, feel free to join the Fruit Ninja VR discord: https://discord.gg/AVfB66 Thanks! -- Guillaume", "Stained_OculusDec 23 at 10:29 AM\nBig improvements\n\nA very long time fan of Fruit Ninja myself, but the hitbox for the bombs are unbelievable. If you get even remotely close to them they blow up! This is a feature that REALLY needs to get fixed. Another thing I was let down about was no pomegranate at the end of arcade mode which gives you that good finished feeling at the end of the round. All in all I hope the people at Halfbrick Studios gets to read this for an ultimate improvement on this game, because I want it to be the best it can be.\n\nHelpful | 189\nDeveloper ResponseMar 19 at 9:18 PM\n\nHi Stained_Oculus, Thanks a lot for your review, and I must apologise about the bombs. I just wanted to let you know that we tweaked them to be less sensitive; and we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "RanfoxMar 24 at 2:29 AM\nPost-update bombs are improved\n\nI agree with most folks on here. The hitboxes from the swords are quite huge, making the bombs very brutal. Would be great to see an adjustment on this so it becomes a lot more playable.\n\nAlso I'd really love to see a local/party mode, something to register highscores from local friends playing the game together on one device.\n\n\nUpdate 24-03-2020:\nDev team, thanks for the reply! It's good to hear the bombs are tweaked a bit and the first playtest definitely shows a clear difference. At least the game is now a lot more playable.\n\nKinda too bad the local highscore switch is hidden in the pause/settings menu which is only accessed by pressing X or A. There are no visible hints of it existing and being there, until you're being told about it or by accidentally pressing it.\nThe rest of the update mentioned more content, but in a quick glance I haven't noticed any other new additions? I still see the same swords to collect from pre-update? Unless I missed out on a hidden scrolling option?\n\nHelpful | 0\nDeveloper ResponseMar 24 at 5:07 PM\n\nHi Ranfox, Thanks a lot for taking the time to update your review. I have to agree, those menus aren't obvious and we'll have to do better on that. As for the mention of content update - it was indeed the 12 new blades to unlock, released 2 weeks ago. Very happy to hear the bombs have improved for you though! -- Guillaume", "Jake.70Apr 28 at 6:57 PM\nAwsome game\n\nThis game I 200% recommend one of the best games on the quest and they have an amazing customer service team. I cannot recommend you get this game enough. Its awsome just absolutely amazing\n\nHelpful | 2\nDeveloper ResponseMay 10 at 3:55 PM\n\nHi Jake.70, Thank you very much for the review - glad to hear you had a good experience with our customer service team :) -- Guillaume", "Flame_SlingersMar 26 at 1:28 AM\nIs it worth it?\n\nThis game started off fairly disappointing at first and its what stopped me from buying it. Until a few days ago, when they released a content update and bomb fix. Ive played this game nonstop for the past couple days and I dont plan to stop anytime soon. Highly recommend that if youre on the edge about buying it I say go for it and play it. Especially with the new update youll see why its such a great game. Thanks devs for listening to your community of players, it has really shown what yall are capable of and I have high hopes for this game In the future.\nAll in all definitely worth it! 5 STARS from me!\n\nHelpful | 3\nDeveloper ResponseMar 29 at 4:38 PM\n\nHi Flame_Slingers, Thanks a lot for the kind words, much appreciated :) Glad you're having fun with the game now! --Guillaume", "Ender772Apr 5 at 6:57 PM\nA tad underdeveloped\n\nIts a fun game but the game itself is a bit underdeveloped. Fruit shoots out of the ground and one bomb and its game over. I find myself playing survival mode the most because it is the most fleshed out game mode and Its more like the vr arcade version that should have been.\n\nHelpful | 2\nDeveloper ResponseApr 6 at 3:59 PM\n\nHi Ender772, Thanks for the review - glad you're enjoying the game. Survival is also my favourite mode, but I do enjoy the madness of arcade mode too :) I take your comments on board though - we'll see what we can do in the future. If you have any suggestions, feel free to join our discord server here: https://discord.gg/hKyxGK Thanks! -- Guillaume", "TheSpikesterMay 17 at 9:30 AM\nGood\n\nGood\n\nHelpful | 0\nDeveloper ResponseMay 24 at 5:30 PM\n\nGood.", "JGP0101May 13 at 10:23 AM\nAmazing but needs a bit more...\n\nSo this is a very good game I think on my opinion the best fruit ninja ever made but after a few days it did get kind of boring and I think it could use some more game modes like arrow shooting or daggers as the arrows this will make the game liked a lot more and tournaments and if you can level up and get more swords as you level up so I am still giving this game a five star because my whole family liked it but can you at least ad more game modes and swords but this game is amazing though\n\nHelpful | 0\nDeveloper ResponseMay 24 at 5:32 PM\n\nHi JGP0101, Thanks for the review, and for the great suggestions! If you have more we'd love to hear them, please feel free to join our discord: https://discord.gg/fEPwAs Thanks! -- Guillaume", "katrinaukApr 28 at 12:48 AM\nSo much better now!\n\nThe free update added so much content! I can now easily recommend this game \n\nHelpful | 3\nDeveloper ResponseMay 10 at 3:54 PM\n\nHi katrinauk, Thank you for your review - glad you like the update :) -- Guillaume", "MyFavoritePersonMar 27 at 4:27 PM\nUPDATED- In LOVE again!\n\nUPDATE- Emailed IT support and game started working a few days later, like magic. So far its playing fine. This is back to being a favorite, but would love to see the sword sensitivity issues fixed. Would def recommend this game!!\n\nOld review: GAME WONT PLAY!! We loved this app when we first got it, but a couple weeks after purchase it started glitching and crashing constantly. Swords fly out of your hand, fruit machines crash to the ground etc. The game is unplayable except for one function, which isnt fun OR worth the cost. We tried to uninstall/reinstall, nothing works. Its the only game that does this. I WANT MY MONEY BACK!\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:19 PM\n\nHi MyFavoritePerson, Thanks for giving Fruit Ninja a second chance! Glad to hear you're having fun with the game now :) We'd like to investigate the issues you're experiencing with sword sensitivity, could you please send an email to FruitNinjaVRSupport@halfbrick.com? Thanks! --Guillaume", "Arcanine_JupiterApr 5 at 3:11 PM\nHitbox too big on everything\n\nJust swing your swords and everything remotely close will say you hit it, fruit and bombs alike. It is very annoying to watch your sword go next to something and see they counted it as a hit.\n\nHelpful | 5\nDeveloper ResponseApr 6 at 3:55 PM\n\nHi Arcanine_Jupiter, Sorry to hear about the issues you're experiencing, I understand that can be frustrating. Most people only reported issues with bombs and that is why we focused on fixing those first. If you could send an email to FruitNinjaVRSupport@halfbrick.com with a bit more details about what is causing you trouble (specific situations, game modes, etc.), that'd be really helpful. Thanks! -- Guillaume", "Master-3thanApr 6 at 11:54 AM\nGood but Sudjestion\n\nGood game, could go better with some music that played on the mobile version. Add backgrounds and swords that have little bonuses to them\n\nHelpful | 0\nDeveloper ResponseApr 13 at 8:47 PM\n\nHi Master-3than, Glad you're enjoying the game, and thank you for the review and suggestions. We will definitely consider the music for future updates but I can't make any promises on the other ones just yet :) Thanks! -- Guillaume", "TheBeast94YTJul 10 at 8:47 AM\n10/10 game, ideas here for updates\n\nI loved playing Fruit Ninja on my old iPad, and now that I can take actual blades and slice fruit with the same satisfaction, its SO MUCH FUN. However, there are some things Id add for an update. Here are my ideas:\n- 2 Fruit Combo on all modes\n- Minigames mode, like the minigames in the mobile version of Fruit Ninja.\n- Quick Blade Swap, where after you finish a game, thered be a Blades option to select, so you could change your blade quickly. It could also have a Return button on the right to return to the mode you were on.\n- Create a Blade, where you can make blades with simple 3D shapes, material and color. You can either save it, or submit it to go to a search area, where you can use blades from other people. It could also have a local search, where if you cant find a blade you made and want to use, you can look up its name in a search bar above the saved blades.\n\nI know, its a lot to take in, but these would help the game a lot, especially the last one.\n\nOverall, 10/10 game. Brought me from my age to 9. (What? Im not gonna say how old I am.)\n\nHelpful | 0", "cap10deeJan 26 at 7:30 AM\nSo excited to find Fruit Ninja BUT....\n\n...this isnt made for VR.\n\nAnyone who purchases this will be reminded of the nostalgia about playing fruit ninja and then stop playing it or play it on the App Store.\n\nWhat about being able to change your swords? You are missing opportunities about being able to reimagine your fire sword sizzling or your butterfly swords emitting butterflies.\n\nThe graphics should be legendary.\n\nHelpful | 27\nDeveloper ResponseMar 19 at 6:54 PM\n\nHi cap10dee, Thanks for playing the game and for your review! I just wanted to let you know that we recently released an update with 12 new swords that you can unlock through challenges. You might even find some of the swords you've been looking for :) We'd love it if you could install the latest update and let us know what you think- hopefully things have improved for you! Please feel free to reach out to FruitNinjaVRSupport@halfbrick.com if you're experiencing any issues. Thanks! -- Guillaume", "BabyKnifeMay 15 at 8:44 PM\nSkip\n\nYeah its a hard pass wish I could get a refund.\n\nHelpful | 2\nDeveloper ResponseMay 24 at 5:32 PM\n\nHi BabyKnife, Sorry to hear you didn't enjoy the game. We'd love to hear what didn't work for you so we can improve the game. Please feel free to share more details on our discord: https://discord.gg/fEPwAs Thanks! -- Guillaume", "josh.cobb.9279Jul 9 at 1:13 PM\nFun\n\nExcited when getting and was fun for a bit but found myself getting bored after 10 minutes. I also like the different unlock able swords\n\nHelpful | 0", "bobismybro232Apr 2 at 12:26 AM\nThey fixed the issues!\n\nWith the newest update and the changing of bomb sensitivity, the game is WAY more fun than before. Its a lot more enjoyable since your combos arent ended by oversensitive bombs :) Thank you devs!!!!\n\nHelpful | 2\nDeveloper ResponseApr 2 at 3:26 PM\n\nHi bobismybro232, Thank you for the updated review! Glad to hear you're having fun with the new update :) -- Guillaume", "P0L4R17YApr 1 at 5:38 PM\nNew Update\n\nThe new updates have really made the game better, I tried it out again and there was a lot less accidental bomb hits, the quality was also a bit clearer. Good improvements over all. From 3 to 5 stars\n\nHelpful | 2\nDeveloper ResponseApr 2 at 3:25 PM\n\nHi P0L4R17Y, Thanks a lot for giving Fruit Ninja another try - glad you're enjoying the update! -- Guillaume", "janet.woodvilleJul 7 at 9:51 AM\nFruit ninja\n\nWOW! This is so much fun. Its also good exercise. Thank you for putting it on sale. I even have the iOS version. VR is so Awesome. I also realize that this stuff takes a lot of work and I appreciate it very much. Thank you for all your hard work. God bless and stay well and be safe.\n\nHelpful | 0", "GobulinSlayaMar 26 at 2:49 PM\nUPDATE\n\nI really like what you've done with the game.\nI think that the bombs are harder to hit than before.\nThe modells textures detail maps and particle systems of the new swords are amazing.\nI think the halloween blade could use some darker colors/cracks around the area where the sword and the skull meets.\nThe ice sword's shder is nice but at the bottom of the blade you can see trough a bit.\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:40 PM\n\nHi GobulinSlaya, Thanks for your review - glad you're enjoying the new blades! We'll take a look at the ice blade and see if there's something to fix there :) --Guillaume", "FireScorpionApr 3 at 5:30 PM\n\nThe game is fun in general and the new swords look dope but it doesn't say how to unlock the butterfly blade.\n\nHelpful | 0\nDeveloper ResponseApr 6 at 3:47 PM\n\nHi FireScorpion, Thanks for the review - glad you enjoy the game! We've had a couple of people report issues with the butterfly blade and we will investigate. Getting a score of 200 in Zen is the unlock condition for it. Thanks! --Guillaume", "vanBlahJul 3 at 10:34 AM\nExceeded expectations\n\nI can hear where the fruit are coming from using headphones, despite what other reviews say.\n\nThe sword unlocks are really cool and keep things interesting. It definitely adds longevity because I didn't think I would enjoy the new swords this much. I have no idea what the requirements are for each unlock, but I guess that keeps it a surprise.\n\nSurvival mode was rewarding because I have to master deflecting bombs without detonating them. It's that kind of precision gameplay that makes it addictive, in a Flappy Bird kind of way.\n\nFive stars because I had no expectation for story or exploration or characters. I just expected Fruit Ninja, and it exceeded those expectations by being surprisingly immersive and more addictive than the original. I can't think of any negatives.\n\nHelpful | 0", "HerbsterKMar 24 at 3:41 PM\nI like it overall\n\nI was not a player of any previous versions so I have no expectations going in. I find the game fun and challenging. Avoiding the bombs in some modes are what can make the game more satisfying than just swinging. You have to control your swing. I would like to see them add upgrades like short defense or sword types. Our family enjoys it a lot.\n\n###UPDATE####\n\nThey have made the game more playable and I am now able to start reaching new scores. I feel like I can dodge the bombs much easier now with less sensitivity. The new swords are pretty cool looking. I am not sure yet if the swords play differently but will keep playing to find out.\n\nHelpful | 0\nDeveloper ResponseMar 24 at 4:33 PM\n\nHi HerbsterK, Thanks a lot for taking the time to update your review! Glad to hear you're enjoying the update :) -- Guillaume", "wreckinthebugMar 25 at 12:31 AM\nFinally fun\n\nThe new update is awesome, with the bomb issues fixed all modes are not just playable but really fun.. The new blades are a great addition but unlocking them is not easy... I read a reply that said to unlock the butterfly blade a score of 200 in Zen mode will unlock it.. How many times must that score be reached to unlock it ??? I have reached that score and a lot higher well over 10 times now and it still locked.. I guess I can wait till Halloween and Christmas to unlock those 2 themed blades but really why even display them if you have to be in a certain month to unlock them.. ????\n\nHelpful | 0\nDeveloper ResponseMar 24 at 5:10 PM\n\nHi wreckinthebug, Thanks for the review! Glad to see you're enjoying the game again :) We have heard a few reports of issues with certain blades/achievements and we'll be investigating - the blade should unlock if you achieve that score once. Thanks! --Guillaume", "its.reuben.irionMar 24 at 6:16 AM\nThe (almost) perfect simple pleasure\n\nIve been playing this game for a while and the most recent update fixes everything i had problems with. If youve been wanting to get this game but have been deterred by reviews, get it  its fantastic now.\n\nAs many other reviews mention, the hit box for bombs used to be enormous  however it is much more playable now as they can actually be avoided.\nAnother common gripe was the lack of a way to change swords, well now theres that too  the armory (or whatever its called) is a fun, immersive way to change your blades and they even have themed trails now.\n\nIt would be nice to see the ability to change dojo or even time of day or something, however I understand that this would be more of a challenge than a few swords.\n\nI always enjoyed this one but now theyve fixed the bombs and added blades its the perfect simple pleasure.\n\nHelpful | 1\nDeveloper ResponseMar 24 at 5:02 PM\n\nHi its.reuben.irion, Thank you for the kind words, very much appreciated :) Glad to hear you enjoy the blades and the bombs have improved for you! -- Guillaume", "AZNinjaMasterJul 1 at 10:31 AM\nIt's fruit Ninja in VR\n\nStill insanely fun after all these years. More content would be nice, but not bad for a hasty money grab vr port. Get it when it goes on sale.\n\nHelpful | 0", "brandichristineJun 22 at 7:54 PM\nGood app\n\nI enjoy the app! I like how you can upgrade swords. I wish we could also level up and play in different settings or have a different amount of fruit to bombs ratio with every level.\n\nHelpful | 0\nDeveloper ResponseJul 1 at 1:00 AM\n\nHi brandichristine, Awesome to hear you're enjoying the game and various blades :) Thank you for the suggestions as well, a few people have suggested something along the lines of a difficulty setting so we might look into it in the future. Thanks! -- Guillaume", "TigerShark0907Mar 22 at 5:38 PM\nButterfly blade\n\nI dont know how to unlock it, it doesnt say how.\n\nEdit: Thanks for the clarification, as there was no thing that said how to unlock it, and it was still locked. Definitely raising the review from 2 stars to 5 for the quick reply and Easy answer! I was really confused because all of the other blades had ways to unlock them, and I was trying to unlock all the blades that are still available.\n\nAlso, I love the fact that you can stab the fruit and it would stick to the tip of the blade, then you could either shake the blade to fling them everywhere (which I love flinging the bombs at the basket shooters, and in arcade you can just shoot them into the distance), or you could slice them with the other blade.\n\nHelpful | 0\nDeveloper ResponseMar 22 at 4:55 PM\n\nHi TigerShark0907, When you're in the blades menu and select a blade, a parchment scroll appears on top of the blades stand. At the bottom of this parchment scroll is the condition to unlock the blade. For the butterfly blade, it is \"Achieve a score of 200 in Zen Mode\". If there is no text there, you may have already unlocked it! I would only ask that you please consider updating your review if this has improved your experience in the game :) If you're still experiencing issues, please send an email to FruitNinjaVRSupport@halfbrick.com Thanks, --Guillaume", "thatguyiscool5May 18 at 8:51 PM\nthis game is yes\n\nyes\n\nHelpful | 1\nDeveloper ResponseMay 24 at 5:30 PM\n\nYES!", "Detective_SuperheroMar 13 at 5:03 PM\nMy 5 year old's favorite game\n\nThis game makes him feel like a ninja, and a good one at that. Other than him, none of us enjoy playing it too much. Still giving it 4 stars because it's his favorite game on the Oculus.\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:14 PM\n\nHi Detective_Superhero, Thanks for the review! Great to hear we've at least made one person in the family happy ;) -- Guillaume", "CatKing5Mar 21 at 4:09 AM\nVery good 1 issue\n\nVery good game. Its so cool to actually be there! The only problem...bombs.....so.....so....SO sensetive. Only issue though\n\nUpdate: Bombs fixed and blades are a cool addition but I have no idea how to get them....and there no explanation of how to get them. That would be nice!\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:17 PM\n\nHi CatKing5, Thanks for taking the time to update your review! The unlock condition for a blade should show on the parchment scroll above the blade stand when you select a blade. If there is no unlock condition there, it normally means you've already unlocked it. If that is not the case, please send an email to FruitNinjaVRSupport@halfbrick.com and we will investigate. Thanks! -- Guillaume", "sundrytimesApr 18 at 12:49 PM\nKids love it\n\nThey play it as much as beat saber. The 3 year old loves it.\n\nHelpful | 2\nDeveloper ResponseApr 19 at 5:47 PM\n\nHi sundrytimes, Thanks a lot for the review - glad to hear the game appeals to all ages :) -- Guillaume", "rescuebulktrashApr 8 at 5:25 AM\nGreat game\n\nMy son is 11 and he loves it!\n\nHelpful | 0\nDeveloper ResponseApr 13 at 8:51 PM\n\nHi rescuebulktrash, Thanks for the review, great to hear your small human is enjoying the game! -- Guillaume", "swordfish2207Nov 30 at 1:12 PM\nGood not great\n\nIts a decent game. Challenging because its not very accurate. Bombs go off if you keep the sword close to them but dont touch them. Tested it multiple times. Same goes for the fruit you dont really need to cut them accurately , just kind of swing in the vicinity. It is still fun to swing the sword from the VR aspect of things but this game should be free until the accuracy kinks are fixed.\n\nHelpful | 105\nDeveloper ResponseMar 19 at 9:47 PM\n\nHi swordfish2207, Thanks for your review, and sorry about the bombs! We realise they've been giving people a hard time. I just wanted to let you know that we've now tweaked them to be more accurate; and we also added 12 new collectable blades. We'd love it if you could check out the latest update and let us know what you think! Thanks! -- Guillaume", "MrDunceMar 20 at 5:54 AM\nGame fixed\n\nThe issue has been fixed.\n\n\n\n\n\nI liked the game in general, very reminiscent of the original but the hitboxes on the bombs\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:55 PM\n\nHi MrDunce, Thanks for giving the game another chance, glad you're enjoying it now! -- Guillaume", "KeyboardDemonJan 15 at 10:03 AM\nZen mode is great!!\n\nIf it wasn't for the Zen mode this game would be a complete let down.\n\nZen mode is so much fun, but in any other mode it is impossible to avoid bombs, they appear and explode, if I move my sword away they explode, if I try to dodge they explode and if I stand still they explode.\n\nIn short, when a bomb appears your doomed, it ruins what could have been a really good, fun game.\n\nHelpful | 20\nDeveloper ResponseMar 19 at 7:00 PM\n\nHi KeyboardDemon, Thanks for playing the game and for your review! I just wanted to let you know that we recently released an update improving issues with bombs. Hopefully this makes the other modes more enjoyable to you :) We'd love it if you could install the latest update and let us know what you think - hopefully things have improved for you! Please feel free to reach out to FruitNinjaVRSupport@halfbrick.com if you're experiencing any issues. Thanks! -- Guillaume", "Shadow61795Feb 9 at 5:00 AM\nGood\n\nIts a great game, would like different swords and the hit boxes need to be fixed something bad. That bad hit boxes are great for combos but bad when it comes to bombs. Id swing the sword far above the bomb and it would still go off making it near impossible to keep the combos going. I like that you can swat them away but its so touchy that is impractical. Thats another thing as well, sometimes I end up batting away fruit instead of slicing them even though I swung fast enough it should have sliced the fruit. Fix these issues and add new swords like the fire and shadow swords and it would be a perfect port to VR.\n\nHelpful | 0\nDeveloper ResponseMar 19 at 6:12 PM\n\nHi Shadow61795, Just wanted to give you a quick update as we've made some changes that you might like. We've added a bunch of new blades and also tweaked the bombs to be less sensitive! We'd love it if you could install the latest update and consider updating your review if things have improved for you. Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "War_FenrirFeb 8 at 7:26 PM\nLove it, buuuut\n\nSo, it is the best iteration of fruit ninja ever. The issues lie in the bombs hit detection and some minor problems with detecting what side the fruit is coming out on. It'd be nice to have an indicator for what direction the fruit frenzy was coming from. Maybe a pull the view back a bit more and that could help? I dunno, the biggest gripe tho is the hit box on the bombs tho\n\nHelpful | 0\nDeveloper ResponseMar 19 at 6:14 PM\n\nHi War_Fenrir, Thanks for the kind words, much appreciated! I just wanted to reach out to let you know we've added a bunch of new blades and also tweaked the bombs to be less sensitive! We'd love it if you could install the latest update and consider updating your review if things have improved for you. Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "ElizaHammond12Mar 1 at 3:37 AM\nI love it !\n\nI have played fruit ninja before on my phone but when I found out it was on Oculus I ran straight to buy it !!\nIts brilliant and my family love it as well! Well done \n\nHelpful | 0", "badnannerzMar 29 at 2:43 PM\nNewest Update, Much More Fun!\n\nI have been having a good time with the new sword update. It's nice having something to work towards. And the bombs don't feel as, sensitive. Thanks for listening!\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:52 PM\n\nHi badnannerz, Thanks for your review - very happy to hear you're enjoying the new updates! -- Guillaume", "WhoseverOdinMar 20 at 5:03 PM\nfun game but still full of bugs\n\ni really enjoy this game but with the new update you cannot unlock all the swords and some of the achievements are not unlocking when I complete them\n\nHelpful | 0\nDeveloper ResponseMar 22 at 7:10 PM\n\nHi WhoseverOdin, Sorry about the issues you're experiencing with achievements! I'd like to look into what's happening here. Would you be able to send an email with more details to FruitNinjaVRSupport@halfbrick.com? Specifically, which achievements/blades are causing trouble. Thanks! --Guillaume", "gof7gfuJul 8 at 10:42 AM\nOk fruit\n\nIt is good but not my campain game I was looking for and it has some problems and is not worth 11\n\nHelpful | 0", "LowBrowEntertainmentMar 13 at 3:30 AM\nIts ok\n\nFruit ninja, fruit ninja use to be one of my favorite games on mobile but its lost is flavor since the controls glitch out from time to time and has a slow pace, just not ment for vr\n\nHelpful | 0\nDeveloper ResponseMar 19 at 5:47 PM\n\nHi LowBrowEntertainment, I'm not entirely sure what issues you're experiencing with controls glitching out, is it related to bombs by any chance? Some users reported issues with bombs being too sensitive and I just wanted to let you know we released an update to improve that. We'd love it if you could install the latest update and consider updating your review if things have improved for you! Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "JelfkinMar 20 at 5:03 AM\nUpdate is a great improvement\n\nHitbox fix on those bombs is now much smaller and more enjoyable. Both I and my son have come back to this fruit slicing classic and having fun. Thanks for the update and listening to your customers!\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:56 PM\n\nHi Jelfkin, Thanks for taking the time to update your review! Very happy to hear you're both enjoying the game now :) -- Guillaume", "steven12345678901Mar 20 at 4:48 PM\nUpdate fixed\n\nThe update was fixed and it works now\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:53 PM\n\nHi steven12345678901, Thanks for giving Fruit Ninja another go - it's good to hear you're enjoying the update! -- Guillaume", "awinst21Jun 21 at 7:32 PM\nGet that fruit workout on\n\nFun game. Sitting down playing is good but standing is the best. Compared to the arcade version the vr version is the best. I played it with my girlfriend and she took it from me and played for hours....\n\nHelpful | 0\nDeveloper ResponseJul 1 at 12:52 AM\n\nHi awinst21, Thanks for the review - awesome to hear you're both enjoying the game! -- Guillaume", "RodOculusGameApr 22 at 4:52 AM\nBad Game\n\nThe bombs are still very sensitive and take away the urge to play. Come on game it's a poop\n\nHelpful | 0\nDeveloper ResponseMay 10 at 3:45 PM\n\nHi RodOculusGame, Sorry you're having a bad time with the bombs. We made them much less sensitive in recent update and most people noticed improvements. We'd like to investigate - could you please send us more details (game mode, blades you're using) at FruitNinjaVRSupport@halfbrick.com or on discord https://discord.gg/VFv38s ? Thanks! -- Guillaume", "JellyfishManiacMar 13 at 8:05 PM\nWow\n\nHarder for sure but entertaining. Love the new sword update.\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:12 PM\n\nHi JellyfishManiac, Thank you for the review, glad you're enjoying the new blades! -- Guillaume", "thorganDec 5 at 5:24 AM\nNot disappointing but gets old quick\n\nThis game is technically perfect.\n\nYou get sabers and you have to cut fruits and make combos, just like the mobile game.\n\nGreat showcase to make someone comfortable with vr.\n\nAfter a couple of games, its unlikely youll launch this game again. Despite a few different game modes, cutting fruits -how satisfying this may sounds- gets plainly boring compared to rhythmic games or things with pistols and robots!\n\nAnyway thats still a great work, I think devs pushed the concept to its maximum potential. I cant wait to see what other games are coming from these guys.\n\nHelpful | 20\nDeveloper ResponseMar 19 at 9:43 PM\n\nHi thorgan, Thanks for the kind words, glad to hear you enjoyed the game! We've recently released an update with 12 new blades that you can unlock through achievements. We'd love it if you could check out the latest update and let us know what you think! Thanks! -- Guillaume", "adamkanderson03Mar 18 at 5:55 PM\nSuper fun\n\nSuper fun game and glad they updated to have the different swords not a game that I play that often but fun every once in awhile\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:10 PM\n\nHi adamkanderson03, Thanks for your review - glad to hear you're enjoying the game and the new blades :) -- Guillaume", "king-kong23Mar 18 at 11:54 AM\nLove the new sord update\n\nWhen i first bought fruit ninja i always wished hou could have different swords just like the mobile game and my wish came true.....\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:12 PM\n\nHi king-kong23, Thanks for your review! Very happy to have made your wish come true ;) -- Guillaume", "stanky274Feb 11 at 4:20 PM\nDissapointed\n\n15 dollars is too much for something with lack of content. Honestly, the developers of this have a lot of potential, and they could add more. If more content is added I will change my view on this game completely.\n\nHelpful | 1\nDeveloper ResponseMar 19 at 6:03 PM\n\nHi stanky274, Thanks for your review - that is a fair point. I just wanted to let you know that we've now added 12 new unlockable blades and also tweaked the bombs to be less sensitive! We'd love it if you could install the latest update and consider updating your review if things have improved for you. Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "Rodritm2007Feb 15 at 5:47 PM\nReviews were wrong\n\nBefore I got the app I looked at the reviews and they all said that the bombs hit box were too big, however, I havent had a problem at all! My family loves it and I havent had any trouble. It is totally worth the price.\n\nHelpful | 2", "Arcade1957Apr 10 at 7:49 AM\nOne suggestion\n\nI like this game but it looks kind of plain when playing it. I think it would be great if higher graphic settings were added to make the game look more fresh and polished. I know the quest has limitations, but the graphics and textures could definitely be raised a bit. (Atleast I think). Anyways, a setting for graphics would be great, but if it turns out too laggy then you dont need to add it. A dev response would be appreciated. Also night time mode would be cool\n\nHelpful | 0\nDeveloper ResponseApr 13 at 8:55 PM\n\nHi Arcade1957, Thank you for your review! Valid point considering the graphics, this is something we put more effort into with the new blades, but could be extended to other areas. As for the night mode, it's already there! Every time the game starts up, it will pick between day and night. Try quitting and restarting the game a few times and you should get the night scene :) Thanks! -- Guillaume", "psychokillerelpJun 30 at 10:18 AM\nAmazing really fun and I love it keep it\n\nI play it every day ever since I got it\n\nHelpful | 0", "CJFireJan 28 at 12:08 AM\nVery cool\n\nIt is very enjoyable, especially as one who enjoyed it as an android app and a good one to introduce the kids to the quest with as they too were familiar with the app. The reviews about the bombs exploding prematurely are correct but one you allow for that it's great.\n\nHelpful | 2\nDeveloper ResponseMar 19 at 6:48 PM\n\nHi CJFire, Thanks for the review, glad you're enjoying the game! We have made some improvements to the bombs' sensitivity and also just released 12 new unlockable blades. We'd love to hear what you think - feel free to reach out at FruitNinjaVRSupport@halfbrick.com Thanks! -- Guillaume", "chiphychungaJun 30 at 11:05 AM\nIts great!!!\n\n#fruit ninja\n\nHelpful | 0", "ZayKingRabbitMar 30 at 2:45 PM\nRefund request\n\nWorst game ever, can I please have a refund\n\nHelpful | 0\nDeveloper ResponseMar 30 at 3:40 PM\n\nHi ZayKingRabbit, Sorry to hear you didn't have a good time with the game. Oculus handles the refunds so you would need to request it from your Purchase History. However, if there are any particularly issues you're having, please send an email to FruitNinjaVRSupport@halfbrick.com with more details and we'd be happy to investigate. And if issues are resolved for you we'd be very grateful if you considered updating your review! Thanks! --Guillaume", "NicLohJun 4 at 1:45 AM\nSimple Gameplay\n\nExactly what I expected so no surprises.. too expensive imo for such games.\n\nHelpful | 0\nDeveloper ResponseJun 18 at 10:16 PM\n\nHi NicLoh, Good to hear you enjoy the game, and also thanks for the feedback - would love to hear your thoughts regarding what else you'd want to see in the game. Feel free to join our discord and offer suggestions https://discord.gg/VFv38s Thanks! --Guillaume", "NickleToesMar 18 at 2:07 PM\nAwesome\n\nVery relaxing\n\nHelpful | 0\nDeveloper ResponseMar 29 at 5:11 PM\n\nHi NickleToes, Thanks for the review, glad you like the game! -- Guillaume", "J03K3RJan 5 at 2:48 AM\nFun for a bit\n\nOk it's fruit ninja in VR. It's exactly what you expect it to be. You chop fruit and avoid bombs.\n\nIt feels good to have swords in your hands and chop up fruit but that's all you're going to get.\n\nIt's not that the game lacks depth. I feel the Devs have done a great job but that's all this game is. Don't expect a story or mind blowing cinematics. You chop fruit and that's ok.\n\nHelpful | 3", "JWORKS3RDDec 30 at 6:42 AM\nJust needs a little tweaking...\n\nGreat game, but like others have said, the bombs are too sensitive...I thought it was me. I'm pretty sure the devs can tweak it with a patch...also maybe they can add a menu for different levels of play (easy, normal, expert) other than that, I have no complaints\n\nHelpful | 0\nDeveloper ResponseMar 19 at 9:01 PM\n\nHi JWORKS3RD, Thanks for the review and glad you're enjoying the game! I just wanted to give you a quick update since we have tweaked the bombs to be less sensitive. And we added 12 new collectable blades which you might also enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "brimdorMar 16 at 12:26 PM\nAlmost unplayable\n\nEvery swipe is inaccurate. It swipes wide and hits fruit/bombs far from the blades.\n\nHelpful | 0\nDeveloper ResponseMar 19 at 5:26 PM\n\nHi brimdor, Thanks for playing Fruit Ninja! I just wanted to let you know we tweaked the bombs to be less sensitive - I think this should help. We'd love it if you could install the latest update and consider updating your review if things have improved for you! Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "greningaFeb 11 at 4:53 AM\nGood but bugged\n\nVery nice grafiks but its bugged.bomb exploded with out touch it.u can do good score.developer need fix it\n\nHelpful | 0\nDeveloper ResponseMar 19 at 6:04 PM\n\nHi greninga, Just wanted to let you know we tweaked the bombs to be less sensitive. We'd love it if you could install the latest update and consider updating your review if things have improved for you! Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "DonnyVegas006Dec 26 at 3:49 AM\nA classic but needs work\n\nI read a lot of reviews about this game and some are complaining about the hit box for bombs, I love this game on mobile and looks fun for friends and family gatherings so I bought it anyway knowing this thinking it cant be that bad, theyre NOT wrong the bombs go off when you no where near them ruining score streaks and ultimately making it feel frustrating and cheated, please patch this ASAP and also please add the Pomegranate in arcade, only then I feel I can review and give this 5* it deserves.\n\nHelpful | 2\nDeveloper ResponseMar 19 at 9:15 PM\n\nHi DonnyVegas006, Thanks for the review, and sorry about the bombs! I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "staceycavDec 22 at 10:42 AM\nFun but lots of room for improvement\n\nI love this on iPhone and have played it for years. On the Quest, its fun but certainly not as enjoyable as on a smartphone. You get anywhere near the bombs and they go off... just seems it lacks some tracking accuracy. A little jumpy.\n\nHelpful | 7\nDeveloper ResponseMar 19 at 9:35 PM\n\nHi staceycav, Thanks for being a long-time Fruit Ninja fan! I just wanted to let you know we tweaked the bombs to be less sensitive, which should hopefully make the experience more enjoyable for you. We also added 12 new collectable blades :) We'd love it if you could install the latest update and consider updating your review if things have improved for you! Please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues. Thanks! -- Guillaume", "Ethan378Jan 23 at 1:33 PM\nHow good is fruit ninja\n\nIts really fun game the oculus quest is\nMy first VR . Tracking is pretty good\nNever gets boring there is no\nEnding to it really its technically unlimited fun 5 \n\nHelpful | 0", "runnow89701Jan 6 at 5:03 PM\nWont refund\n\nI played less than 20 minutes and asked for a refund and they said no and said I played more than two hours this is a scam dont buy this game!\n\nHelpful | 6\nDeveloper ResponseMar 19 at 8:55 PM\n\nHi runnow89701, Sorry that you couldn't get a refund, unfortunately that is out of our control as developers and something that only Oculus can help you with. To try to turn this not-so-ideal situation into something positive, you may want to check out our latest update which has 12 new collectable swords as well as improved bomb slicing accuracy! Hopefully this will help you enjoy the game more and we'd be grateful if you then consider updating your review :) Thanks! -- Guillaume", "ZlinkatZFeb 3 at 4:35 AM\nTerrible\n\nI played hours of fruit ninja on Xbox with Kinect, years ago. It was fun and a work out. This game is unplayable. Wasted money.\n\nHelpful | 6\nDeveloper ResponseMar 19 at 6:43 PM\n\nHi Zlinkatzzz343, Sorry to hear you didn't enjoy the game. We've recently released updates that we hope improve the experience: 12 new unlockable blades and we fixed issues with bombs. We'd love it if you could install the latest update and consider updating your review if things are better now. Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues, we'd really like to understand what isn't working for you. Thanks! -- Guillaume", "ExLawenforcerApr 25 at 7:42 PM\nHorrible glitching\n\nI cant ever fire the game up with out a bunch of pixelation. Ive uninstalled and resin stalled, same issue. Its like a big black square that pixelates in the middle of my screen, game is broke and no support available.... buyer beware\n\nHelpful | 0\nDeveloper ResponseMay 10 at 3:51 PM\n\nHi Lawenforcer, Sorry to hear you're experiencing some difficulties with the game. Similar reports to yours are rare, but they generally seem to be fixed by updating your Quest and/or reinstalling the game. If you're still having issues after those steps, please contact us at FruitNinjaVRSupport@halfbrick.com or on discord: https://discord.gg/VFv38s Thanks! -- Guillaume", "williambwb75Apr 6 at 6:18 AM\nGreat but needs more\n\nI love this game and its a easy way to show people vr but i would like to see more environments like a night option or something similar\n\nHelpful | 0\nDeveloper ResponseApr 6 at 4:04 PM\n\nHi williambwb75, Glad to hear you're enjoying Fruit Ninja! Every time you start it up, the game should already alternate between day and night - please give that a try and let us know if that's not the case :) Thanks! -- Guillaume", "messbrianJan 25 at 11:35 AM\nFred\n\nVery cool! Youre really in the game chopping fruit. The swords dont seem very accurate when you slice though. Still a fun game though.\n\nHelpful | 0", "yeeterboiiFeb 5 at 9:08 PM\nHorrible\n\nIf I could rate 0 stars i would because this game needs big improvements its nothin like the ads\n\nHelpful | 5\nDeveloper ResponseMar 19 at 6:43 PM\n\nHi yeeterboii, Sorry to hear you didn't have a great time with the game. We've recently released a couple of updates that we hope improve the experience: a bunch of new unlockable blades and resolved issues with bomb sensitivity. We'd love it if you could install the latest update and consider updating your review if things have improved for you. Otherwise please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues, we'd really like to understand what isn't working for you. Thanks! -- Guillaume", "EageRAssassinMar 25 at 10:09 AM\nGreat game after the fix\n\nAfter they fix the game, it is as good as those versions on PC. I hope there can be more blades add on and more game modes and levels in the future\n\nHelpful | 0\nDeveloper ResponseMar 29 at 4:37 PM\n\nHi EageRAssassin, Thanks for the review, glad you're enjoying the game now! -- Guillaume", "Duncster-swcJan 17 at 5:42 PM\nA VR staple\n\nThis is one of those must have titles for anyone with VR .... always a blast and fun for friends and fam of all ages.\n\nHelpful | 2", "mnevalaJan 8 at 6:46 AM\nSlightly better then on app\n\nThis game is about the same as the phone version. It seems kind of flat compared with beat sabor. It runs smooth, but nothing new.\n\nHelpful | 0", "BaseballTeddyDec 27 at 12:31 PM\n\nHit boxes on the bombs need major tuning, otherwise a very fun game to play!\n\nHelpful | 1\nDeveloper ResponseMar 19 at 9:05 PM\n\nHi BaseballTeddy, Sorry about the bombs, we know they've been giving people a hard time! I just wanted to reach out to let you know we improved the slicing accuracy with bombs; and we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "MatchaLiNov 27 at 10:49 PM\n\nThis game in VR is much harder then you phone app game. The bomb goes off if your sword is a little too close. You really need to be very accurate with the placement of your sword. It tends to get quite frustrating at times but I do think the hardness of the game gives it more of a challenge and makes you try harder.\n\nHelpful | 5\nDeveloper ResponseMar 19 at 9:48 PM\n\nHi MatchaLi, Thanks for your review, and sorry about the bombs! We realise they've been giving people a hard time. I just wanted to let you know that we've now tweaked them to be more accurate; and we also added 12 new collectable blades. We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "GODHEDJan 2 at 1:20 AM\nMeh but good\n\nIt's just fruit ninja with perks\n\nHelpful | 0", "thomasmaddoxFeb 8 at 1:50 PM\nBad\n\nWould not recommend, it shouldn't be on vr..\n\nHelpful | 0\nDeveloper ResponseMar 19 at 6:18 PM\n\nHi thomasmaddox, Sorry to hear you're not enjoying the game. Please reach out to FruitNinjaVRSupport@halfbrick.com - we'd really like to know what isn't working for you so we can improve it. Alternatively, we'd also love it if you could install the latest update and consider updating your review if things have improved for you! Thanks! -- Guillaume", "dionysus1117Dec 29 at 5:52 PM\nBombs too sensitive.\n\nThe hit box on the bomb is way too sensitive, if a piece of fruit comes anywhere close to a bomb you might as well just consider it a game over if you try to hit the fruit.\n\nHelpful | 7\nDeveloper ResponseMar 19 at 9:03 PM\n\nHi dionysus1117, Sorry about the bombs, you're not the only one having a hard time with them! I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy. We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "SamichmonkeyDec 26 at 1:34 PM\nDecent\n\nIts a good game but they need to fix the sensitivity of the bombs. If you get anywhere near them they blow up.\n\nHelpful | 1\nDeveloper ResponseMar 19 at 9:08 PM\n\nHi Samichmonkey, Sorry about the bombs, you're not the only one having a hard time with them! I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "fazed45Dec 8 at 4:18 PM\n\nMy first game I played on this system was this one and I had a great time and I feel like this game is worth to buy\n\nHelpful | 1", "SweetMan2612Nov 24 at 8:50 AM\nGood\n\nIt's not the best game on the quest but it's not meant to be. It is meant to be fruit ninja and to tell you what they did it almost perfectly. I say almost because nothing is perfect. This game is a class that even my dad played with me and loved it and wanted to continue to play. This game is good if you like fruit ninja.\n\nHelpful | 3", "Carlie33Dec 22 at 12:32 PM\n\nThe game itself is just not like the original.It is not fun and mine had something wrong with it where half the screen was just pixelated and gave me a headache. Overall dont waste your money.\n\nHelpful | 3\nDeveloper ResponseMar 19 at 9:32 PM\n\nHi Carlie33, Sorry to hear you had a bad experience with the game. We've recently released updates that we hope improve the experience. We'd love it if you could try the latest update and consider updating your review if things have improved for you. Please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues, we'd really to understand what isn't working for you. Thanks! -- Guillaume", "briverameloOct 4 at 11:40 PM\nBombs detonate too easily\n\nSwinging 3 feet beside bombs explodes them.\n\nI feel upset. Robbed. Cheated.\n\nI only truly enjoy Zen Mode, because there are no bombs in Zen Mode.\n\nPlease shrink the gigantic sword colliders, and let us ascend to true ninja status.\n\nHelpful | 25\nDeveloper ResponseMar 19 at 9:59 PM\n\nHi briveramelo, Sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be more accurate; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "k405wizardDec 3 at 12:55 PM\nWell its Fruit Ninja\n\n.. what could be bad? I have played this game for 10 years on all kind of devices. Its definitely cool in VR. I read some comments on oversensitivity of the blades near bombs, but I didnt experience that. My kids love it.\n\nHelpful | 0", "SpicyFriesDec 29 at 11:34 AM\nFamily\n\nThis game is really good for family its for for children and a good fun game to take turns on.\n\nHelpful | 0", "TitanUpSonDec 27 at 3:53 PM\nWorse VR game so far\n\nI wish I could pin point the problem. Bought cause I had a credit and it only cost 5$. Not even worth that. Immediately deleted from\nVR, dont buy!!!\n\nHelpful | 0", "ChrisJonesGamingOct 16 at 3:44 PM\nFun but not worth $15\n\nThe game has four modes and that's it. You get one blade skin and nothing else. It's a fun VR experience however it is not worth the $15. Bombs are very sensitive and will get hit when you don't even touch near them.\n\nIf they added skins to unlock for the sword, and fixed the bomb sensitivity then this game would be 5 stars.\n\nHelpful | 13\nDeveloper ResponseMar 19 at 9:56 PM\n\nHi ChrisJonesGaming, First of all, sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be less sensitive; and we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "NellyShredDec 24 at 9:32 PM\nGreat starter game\n\nWorks well, looks great, great starter game, can get old over time. I enjoy it a lot!\n\nHelpful | 1", "rmhunterDec 23 at 6:56 PM\nFun for the whole family\n\nAwesome game on all platforms. On VR it is very interactive and the best version of the game.\n\nHelpful | 0", "kerininOct 19 at 12:00 PM\nRecent update made the game unplayable\n\nThe collision detection in the current version is abysmal. Fruit slice when the sword did't touch them and bombs explode when the sword is feet away from them. I spent hours playing this , but I just can't any more. Please bring back the old version with uglier graphics and accurate physics\n\nHelpful | 6\nDeveloper ResponseMar 19 at 9:53 PM\n\nHi kerinin, Sorry about the bombs, you're not the only one having a hard time with them! I just wanted to let you know that we tweaked them to be more accurate; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "supergroulxOct 23 at 9:07 AM\nVery simple. Very fun\n\nAre you upset like me that you bought beat saber on the rift and it was not cross buy on the quest?\n\nThis is the poor mans low-cost solution while I pout in the corner\n\nI am very glad I Purchased this. Its even more fun than playing back in the day on the Xbox Kinect\n\nIts completely smooth and completely enjoyable and Ive had both kids and adults at my house Alike loving it\n\nHelpful | 8", "Skeletor628Oct 10 at 2:27 PM\nNot worth it\n\nI was genuinely excited for this game. I thought the concept of fruit ninja in vr would be awesome. I was wrong. There are 4 game modes. 3 of which are just the original game modes but in vr. I dislike them because bombs are WAY too over sensitive. And most fruit wont cut easily. Last game mode is fine but not worth $15.wpuld not recommended\n\nHelpful | 17\nDeveloper ResponseMar 19 at 9:58 PM\n\nHi Skeletor628, Sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "omg_florianaDec 2 at 6:54 PM\nNot worth $15.\n\nI have to admit this game is ok at first but literally after 10 minutes its nothing special and I dont choose to play this game out of the other games on this app that cost the same amount of money.\n\nHelpful | 0\nDeveloper ResponseMar 25 at 6:23 PM\n\nHi omg_floriana, Just wanted to let you know we recently released a couple of updates with 12 new blades to unlock and improvements to the sensitivity of bombs. Hopefully this will help make the experience more enjoyable for you :) We'd love it if you could install the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "absand06Dec 26 at 4:47 PM\nLots of fun !\n\nBetter than expected!\n\nHelpful | 0", "rozemarijnkSep 21, 2019 at 11:51 AM\nEven better than on the smartphone\n\nPlayed it a lot on my phone but this is so much better! Love it so so much!\nHope they will update the game with some more game modes. Especially modes like the last one. Maybe a mode where the tubes, where the fruit comes from rotates around you.\nOne point of criticism: the game is in German and I can't find the settings to change them to English..\n\nHelpful | 4", "gibbeshOct 21 at 12:04 PM\nAmazing\n\n*UPDATE*\nI have to revise my review, and say that all the complaints about the bombs being too sensitive are wrong. The accuracy of your sword decreases the faster it is moving. If you slow down and excercise more skill and precision the bombs aren't a problem. In actual fact, if you're gentle, you can flick the bombs out of the way with the side of your blade. Classic mode requires far more Zen than Zen mode if you want to succeed.\n---------------------------------------\nI'm pretty new to VR, but I have to say that this is one of the best experiences I've had yet. I do have to agree with some of the other reviews that complain about the bombs being over sensitive, and hard to not hit them. Otherwise a fantastic rendition of one of my favourite games.\n\nHelpful | 2", "Ninjacube690Dec 11 at 6:14 PM\nBad.\n\nRefund please\nI love the game in general just not ready for it to be on vr yet.\n\nHelpful | 0\nDeveloper ResponseMar 19 at 9:38 PM\n\nHi Ninjacube690, Sorry to hear you didn't have a great time with the game. We've recently released a couple of updates that we hope improve the overall experience: a bunch of new unlockable blades and resolved issues with bomb sensitivity. We'd love it if you could install the latest update and consider updating your review if things have improved for you. Please reach out to FruitNinjaVRSupport@halfbrick.com if you're still experiencing issues, we'd really like to understand what isn't working for you. Thanks! -- Guillaume", "TheRealSMCparkDec 12 at 1:11 AM\nFIX THE BOMBS\n\nLITERALLY UNPLAYABLE WITH THE BOMBS IN THE WAY\nFIX THE SWORD ACCURACY\nRIDICULOUS\n\nHelpful | 2\nDeveloper ResponseMar 19 at 9:36 PM\n\nHi TheRealSMCpark, Sorry about the bombs, a lot of people have been having a hard time with them! I just wanted to let you know that we tweaked them to be more accurate; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "SqueakinglyJenDec 14 at 2:58 AM\nNot great\n\nClumsy and not great on this platform - not much replay ability\n\nHelpful | 0", "gamertaggMar 10 at 12:29 PM\nNot as good as I thought\n\nDon't get me wrong, it's far better than the mobile game but if this game wants to survive at least bump down the price\n\nHelpful | 0\nDeveloper ResponseMar 25 at 6:16 PM\n\nHi gamertagg, Just wanted to let you know we recently released a couple of updates with 12 new blades to unlock and improvements to the sensitivity of bombs. Hopefully this will help make the experience more enjoyable for you :) We'd love it if you could install the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "leo1212parDec 9 at 3:16 PM\n\nIts sooooo good the best\n\nHelpful | 1", "HayjaywoOct 2 at 8:01 AM\nDecent party game\n\nIts a fun game to play when u have friends over to show them the experience, but as a single player game it can become boring quite quickly. Better than the mobile game however had some times when the bomb hit boxes seemed bigger than what the bombs looked like. Overall pretty good but other game modes would definitely bring it up\n\nHelpful | 2\nDeveloper ResponseMar 19 at 10:00 PM\n\nHi Hayjaywo, Sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "cmpmatthewsOct 12 at 2:21 AM\nI would love to love this game\n\nBut the issue with bombs getting hit when the blade never even made contact is off putting and a complete showstopper in terms of having fun with this game. Until I noticed how\nprevalent of an issue this turns out to be I was having a lot of fun so I hope it gets fixed.\n\nHelpful | 5\nDeveloper ResponseMar 19 at 9:57 PM\n\nHi cmpmatthews, Sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "Nienormalny_Oct 18 at 1:25 PM\nSick bombs!\n\nBombs in arcade mode are sooooo sensitive! This is insane! I will change my rating if you will fix that problem. They blow up even i did't cut the bomb. It will be nice to get fix!\n\nHelpful | 1\nDeveloper ResponseMar 19 at 9:54 PM\n\nHi Nienormalny_, Sorry about the bombs! We realise they've been giving our players a hard time. I just wanted to let you know that we tweaked them to be less sensitive; we also added 12 new collectable blades which you might enjoy! We'd love it if you could check out the latest update and consider updating your review if things have improved for you. Thanks! -- Guillaume", "hrtbrk11Sep 25, 2019 at 11:37 AM\nYou wanna smash some fruit?!!!!!!!\n\nI loved the smartphone game and this doesnt even compare. I freaking love this game!!! Get it!!!!\n\nHelpful | 3", "jaydmsrSep 25, 2019 at 6:30 PM\nFantastic\n\nI bought this for my son and he loves it, i havent tried it yet but whatever gets him moving around and off the couch good for me, graphics are good.\n\nHelpful | 2", "Mega4Sep 24, 2019 at 2:11 PM\nPlease help\n\nThe update broke it and now I cant play\n\nHelpful | 0\nDeveloper ResponseSep 24, 2019 at 5:19 PM\n\nWe are really sorry to hear that. To fix the issue, please uninstall and reinstall the game. Sorry for the inconvenience.", "johnsimpsonSep 7, 2019 at 5:31 AM\nUpdate\n\nCan't update. Goes through the update then says installing then goes back to update?\n\nHelpful | 12\nDeveloper ResponseSep 7, 2019 at 7:08 PM\n\nWe are really sorry to hear that. To fix the issue, please uninstall and reinstall the game. Sorry for the inconvenience.", "chrisdothtmlSep 10, 2019 at 7:21 PM\nZone out and work up a sweat\n\nWay better in VR than in smartphone app form\n\nHelpful | 4", "threepatSep 8, 2019 at 8:38 PM\nHow to exit?\n\nCan you tell me? Where is the exit button? I can't find it.\n\nHelpful | 4"]