{"App Title": "Fujii", "App description": "A serene, mystical journey that traverses a series of otherworldly, organic landscapes, Fujii is a respite for weary travelers.  The experience flows between an outdoor narrative journey and creative gardening, merging aspects of adventure and cultivation into a refreshing, musically enveloping whole.\n\nFeatures:\n* Hike through three diverse biomes, collecting seeds and exploring their enchanting flora and fauna\n* Collect seeds and grow vivid, surreal plantscapes, cultivating your own unique home garden \n* A meditative, musical gardening adventure that offers a unique and restorative VR experience \n* Relax in your garden with your companion gnome, and introduce critters and insect life sourced from the wild\n\nSupports cross-buy with Oculus Quest/Rift. Created by Funktronic Labs, the makers of the award-winning puzzle adventure game Nova-111, and VR titles Cosmic Trip and Starbear: Taxi. Technology support by RareFaction Interactive.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Exploration, Narrative", "Languages": "English, Chinese (China), Chinese (Taiwan), French (France), German, Japanese, Korean, Portuguese (Brazil), Russian, Spanish (Mexico), Spanish (Spain)", "Version + Release Notes": "1.0", "Developer": "Funktronic Labs", "Publisher": "Funktronic Labs", "Website": "https://funktroniclabs.com/", "Release Date": "June 27, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Home Works About\nLEGAL\n\nDeveloper Funktronic Labs (hereinafter called Funktronic) makes every effort in protecting our customers personal information related to their privacy. Funktronic may ask you to provide us with personal information. Only minimal information will be asked for, and we respect the customers choice whether or not to provide any other information.\n\n1. COLLECTION OF PERSONAL DATA AND PURPOSE OF ITS USE\n\nFunktronic will collect personal data from our customers by fair and appropriate means and will provide explanation on the purpose of its use.\n\nPurpose of Use: Collected personal information will be used for the following use and purposes:\n\nManaging and collecting of information, sending documents and communicating for processing tasks and other business conducts\nFor consultation with and responding to inquiries from our customers\n\n2. PROTECTING AND STORING PERSONAL INFORMATION\n\nFunktronic will appropriately process the collected personal information and will implement appropriate protection and security measures in order to ensure safety in storing the personal information. Funktronic will make every possible effort in ensuring prevention of loss, destruction, manipulation and leakage of personal information.\n\n3. PROVIDING PERSONAL INFORMATION TO THIRD PARTIES\n\nPersonal information will not be provided to third parties without your consent, unless such disclosure;\n\nis required by the law;\nis necessary in order to protect ones life, body and/or property;\nis necessary for the cooperation with the state or local authorities, or individuals or entities who has been appointed by the state authorities to enforce the law or legal procedure;\nis required to be submitted to the state authority in relevance with business conducts\n\n4. DISCLOSURE, TERMINATION, DELETION OF PERSONAL INFORMATION\n\nIf we receive a request from you to obtain disclosure, correct, terminate the use of, or delete your personal information, Funktronic will, by appropriate methods, verify that the request was made by you and then respond as soon as possible, unless it is appropriate to reject such request by law or business circumstances.\n\n5. CHANGES IN THE PRIVACY POLICY\n\nFunktronic may make changes in the privacy policy without notice in response to social situations, advancement in technology, and changes in the environment.\n\n6. COPYRIGHTS\n\nFunktronic reserves all rights over the contents (writing, pictures, data, images, graphics, etc.) and its presentation, edits and structure. No part of the content may be used (including transmitting, distributing, publishing, transferring, lending, translating, adopting, licensing, reusing, reusing, etc), reproduced, changed, altered, or used for commercial purposes without prior written permission.\n\n7. DISCLAIMER\n\nAlthough Funktronic makes every effort in caring for the information we provide, we will not be responsible for any loss or damage including without limitation, indirect or consequential loss or damage, or any kind loss or damage resulting from its use or changes in the law or any other causes. Please use the information at your own risk.\n\nCONTACT\n\nIf you have any questions, please feel free to reach us at support@funktroniclabs.com\n\nCONTACT US\n\nSay Hello!\n hello@funktroniclabs.com\n\nBusiness Inquiries:\n biz@funktroniclabs.com\n\n Pasadena, California\n\nABOUT US\n\nFunktronic Labs is a studio that focuses on delivering creative experiences through games, VR/AR and other interactive media.\n\n Press Kit Read More \nFOLLOW US\n \n \n\nJoin our Official Discord Community!", "Space Required": "425.1 MB"}



["5 stars\n70%\n4 stars\n21%\n3 stars\n5%\n2 stars\n3%\n1 star\n2%", "MinneliJul 8 at 1:21 PM\nYour own secret garden is a lovely place\n\nNo one ever talks about Fujii, which is a wonderful little game for all ages. The trailer doesnt really do justice for this little gem of relaxation, beauty and tiny wonders, so I almost missed it too, but Im so glad I got it after all. I have spent countless hours tending my virtual garden and exploring the strange worlds with even stranger plants with my little ukulele playing friend. If you want your own secret garden where you can just hide away for a while from this crazy old world and feel happy, Fuji is for you.\n\nHelpful | 58", "tacklinJul 21 at 5:01 PM\nGreat for kids\n\nWhile theres no shortage of serious games out there for the Quest, Ive struggled to find an experience for my 8 year old daughter. I bought it for her this morning and shes had to charge the Quest twice now for having run out of battery. Shes been having so much fun I can barely get her off it.\n\nA great & wholesome addition to the library\n\nHelpful | 13", "MargotTenenbaumJul 27 at 7:34 AM\nLove this game!\n\nThis game is so vibrant and colourful, you experience temporary colour blindness on taking off the helmet. The real works literally pales in comparison haha I was on the fence about this game as it seemed childish and I wasnt sure I would like it. And it sort of is, it in the best way. Its a little wonderland where you work to solve puzzles and bring hike seeds to plant in three separate epic garden rooms.\n\nMy only criticism is that I wish the game was longer, with more levels in play. That being said I have spent hours curating my gardens well beyond the game play hours, and its really quite meditative. I would consider this a great way to relax or unwind if youre feeling stressed, in an environment that is stress free by design.\n\nIm still not sure what the #2 pots are for though. Some light instructions for some things could be a good addition but most everything else is obvious I think.\n\nWonderful game!\n\nHelpful | 4", "sillydogeball22 days ago\nMost laid back time youll have\n\nIve collected quite a toolbox of meditative and relaxing games inside the Quest, and this one definitely is unique. Youll still feel accomplished in the small tasks you do and dont feel obligated to do anything thats part of the exploration outside your own area if you dont want to. I havent even ventured very far and Im still seeing places to go - its far bigger than I imagined it would be.\n\nThis is incredibly relaxing and stress-free. If I want to just tend to my own garden, I can do that. If I want to go explore, thats fine, too. And sometimes I just like to ride the flying boats so the cute, little guy can play the song for me :) I love this.\n\nHelpful | 2", "Mattplus097 days ago\nDone Buying Oculus Software!\n\nCute Zen-like game...worth a look for sure!\n\nHowever...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 1", "DroculahJul 25 at 1:04 PM\nFantastic, relaxing, visual delight.\n\nAbsolutely love this! I thought about purchasing this for a while, but was not sure based on the videos and screenshots. It seemed a little bit lackluster. However, after it went on sale I took the plunge and I have to say I am so glad I did.\n\nIf you want a creative night in just relaxing and being immersed in a visually appealing Wonderland where you can plant and create your own garden, get this.\n\nIt's fairly short, with just a few places to explore, but it's still worth it. You can go and explore the first 2 areas again if you'd like, but you also have a \"home\" garden where you can buy bulbs and pots and decorate how you'd like. There's definitely replay value in that I know I'll be hopping back in from time to time to experience this again.\n\nA few suggestions:\n\n1) I find it very frustrating when I've planted a bulb in the ground (not in a pot) and it wasnt the flower I wanted. Rather than some way to pick the flower and replant it somewhere else, or get it into a bulb form again to replant, I need to use the trowel to destroy it, which is a waste. Please give us some way to pick or replant a flower without destroying it.\n\n2) I can't always remember which bulb turns into which flower. Would be nice if there was some indication somehow. Maybe an animation that when you hover over or touch the bulb, it shows what it grows into? Or even if that only shows when you're in the room where you can buy the bulbs.\n\n3) Like others have said, please let us revisit the third area. It was a great experience, and I'd like to go there again without starting a new game\n\n5) I think this experience can benefit from more tutorials, not everything was obvious.\n\nHelpful | 2", "TVL1977Jul 22 at 10:29 AM\nMagical garden\n\nThis was a game I would never really consider on buying.... Didn't really know what to expect and the trailer of the game didn't really trigger me. But when on sale I just wanted to give it a go.... And what a nice surprise.\nThe game is so zen and magical. Finding seeds, planting them, watering them.... It sounds kind of lame but it's all set in a magical world and the environment opening up by the light you create is so beautiful.\nBeing in the little tiny boat setting of to new worlds to discover, stretching your arms, creating stars by the touch of your fingers.\nThe little tiny creatures hopping around, the path of flowers, the water bubbles..... And it goes on and on. It makes you want to discover more and more.\nOnly weird thing.... I couldn't find a menu in the game to close the game.....\nStill need to discover alot, but already very happy on buying this cute little game.\n\nHelpful | 2", "janejanet1221Jul 25 at 10:02 PM\nA wander land for the whole family\n\nLike this game. Everyone in a family including kids and grandparents can play this game. It's like a wander land for a young kid. Very relaxing and the way to collect seeds for the garden is interesting.\n\nHelpful | 1", "gregory.i.hayesMay 24 at 10:07 PM\nVery Nice Diversion\n\nI was going through games I hadn't yet viewed in my Oculus and was pleasently surprised with Fuji. It was engaging, relaxing, and rewarding to play. I liked the exploration and puzzles. The visuals were also very pleasent and the experience flowed well.\n\nHelpful | 11", "ryman647Jun 23 at 10:03 PM\nLovely but the plant cap can be annoying\n\nI logged in one day and a whole wing of plants had disappeared. I had kept them watered, so I can only assume that I planted a maximum plant amount and they got deleted.\n\nHelpful | 6", "valkarie42Apr 13 at 1:41 PM\nRelaxing and worth it, but missing...\n\nEnchanting and relaxing. The only downside is after you go through the third area you can't go back to it. I've seen other people mention this.to the developers please allow us to go back to the third area it was beautiful and extremely relaxing and as soon as I was done with it I wanted to go back and do it again. It would also be really nice if we could reset an area so we could see it light up all over again.\n\nThis game helps me relax and I keep finding new areas. If you take your time and really look around he will find quite a bit here. I have put several hours into this game and I'm not finished yet. I have to go back to the second area and search through several different sections in that area yet.\n\nI would give it five stars if I could just go back to that third area.\n\nHelpful | 44", "HevendemoMay 6 at 8:12 PM\nI love this game so much\n\n4 stars only because I want more adventuring. I love looking for new flora and solving puzzles!!! If there is DLC or something I will happily get it. This game is beautiful and wonderful I just wish there was more.\nAlso maybe a screen describing what things do? I cant find a manual anywhere.\n\nHelpful | 12", "SambaQJun 17 at 11:00 PM\nAmazing game, more people should try!\n\nSuper fun, beautiful, amazing puzzle game. You pretty much run around and collecting seeds. The graphics are very well made. Its shame there are no 2nd one. I totally buy it!\n\nHelpful | 2", "Sara421Apr 4 at 6:28 PM\n\nI love this game! Very relaxing and wanting to explore more! Please make a second one with more pretty flowers. maybe cute critters and I would love to share it through gmail and not just facebook! Thanks! P.S. A lot longer too would be awesome!\n\nHelpful | 22", "fnulpsApr 9 at 6:54 AM\nNo free Movement\n\nThis game is a masterpiece! Just love the beauty, art style, playfulness.\n\nOnly mayor dropback: there is no free Movement. You have to teleport and snap-turn in 45 degrees. This feels annoying and outdated. The world feels way less organic than it could be. Please fix this, and we would have a perfect game which fits in the ranks of Flower and Journey.\n\nStill giving 4 Stars for being so beautiful and relaxing.\n\nHelpful | 11", "kimbiecookieApr 8 at 9:07 PM\nCute and fun relaxing game!\n\nThis game is especially good for people new to VR and younger players. Very colorful and comfortable. Visually stunning and easy game play. Love the little ride to the other garden worlds! A great escape to a enchanted little world. Great game to destress from the real world with. Wish it was longer though with more levels to explore! Please give us more!\n\nHelpful | 11", "M3DIUMApr 27 at 10:19 AM\nMystical journey\n\nOne of my first and favorite games the Quest. Ive tried all the games worth trying and this one is a mystical journey. The sounds, visuals and exploratory nature of this game make it so unique. Its a relaxing adventure. Id gladly pay for more worlds to explore or Ive hopefully got my fingers crossed for a Fuji 2.\n\nHelpful | 2", "wf9000Apr 19 at 5:58 PM\nNot worth 15$\n\nSo I got this and it took me about a hour to beat so its very short but good, I think it could have been way longer and you cant go back to the 3rd place and there are 3 areas in the game so I think not worth it but it was super fun and relaxing I give it that.\n\nHelpful | 4", "EEK3Jun 29 at 6:25 AM\nChicken noodle\n\nI get a headache when I walk but it is very meditating\n\nHelpful | 1", "Fire_VortexJun 6 at 4:24 PM\nSo relaxing and a great vr experience\n\nThis game really shows what VR can do. The sound, touch, and beautiful labdscapes made me feel like I was there.\n\nHelpful | 1", "ScowlinMunkeh23 days ago\nPleasantly chilled\n\nThis is a lovely game if you want a break from zombie slaying or waving sabers about!\n\nExplore beautiful environments and solve some simple puzzles to find seeds for your garden. Grow some exotic plants and water them often.\n\nThe more you explore and collect, the more of the quirky and chilled landscape becomes available to you.\n\nThe ambient music is lovely and mellow. The gameplay is at your own speed. The graphics are vibrant and colourful. Your home garden is fun to grow in.\n\nYes, a definite recommendation from me. A bit of a surprise hit!\n\nHelpful | 0", "TheKenz11Jul 28 at 9:01 PM\nGreat game, VR viva pinata!!!\n\nGot this game on a whim, it was on sale. Imagine my surprise when i took my headset off an hour later with a smile on my face and some nostalgic feelings from the cute chibi animation to the calm bouncy music. Also an hour felt like 10 minutes not sure if that is good or bad but I definitely recommend this game!\n\nHelpful | 0", "mik3879May 17 at 4:08 AM\nRelaxing and enjoyable\n\nThe exploration keeps you interested and planting the seeds when you get back is the achievement. I'm not surprised this app has high ratings, you feel better after playing it.\n\nHelpful | 0", "hollyelizApr 6 at 2:14 PM\nSo relaxing\n\nI adore this game. It's a wonderful escape from everything going on in the world right now. Beautiful graphics and relaxing music. My only complaint is that my plants and stuff keep disappearing from my garden.\n\nHelpful | 3", "SPYKER-101Apr 22 at 10:59 PM\nWhat I have been waiting forever\n\nWhat a cool fun environment. Very gentle and interesting experience. One to show your friends for sure. Great work developers\n\nHelpful | 2", "GirlGeek101Apr 24 at 9:09 PM\nVery relaxing\n\nI am wanted to explore all day!\nThank you for such attention to detail.\n\nHelpful | 2", "Carter_VFeb 6 at 8:30 AM\nSooooo\n\nCan there please be more places added to this game? Its so beautiful I would love to see more gardens to traverse and perhaps more discovery based side ventures!!! I love the concept of this experience and would just like more of it. Holding back the final star and waiting for the day it expands into a few new places to explore!\n\nHelpful | 6", "NeverWrongDec 25 at 8:51 PM\nEnchanting\n\nMy husband and I PT the Oculus quest a few days ago for Christmas (opened it early of course). Of all the mind blowing games we have purchased, this is my first review. Just wow!!!! Why isnt this on the top list of suggestions for newbies? Although, this game is not action packed in the slightest, It is magical. It takes you to another beautiful world and I am thrilled I bought it.\n\nPs. If you have a kiddo dying to get his/her hands on your Oculus, but you dont want him playing a shootem up game, his is a winner.\n\nHelpful | 34", "LeggoMyMeggo1924Apr 21 at 10:20 PM\nVery cool.\n\nI really enjoy all of the things you can collect in the levels.\n\nHelpful | 0", "HavocfywMar 11 at 10:03 PM\nNEED MORE!!\n\nThe feeling of wonder I experienced playing this as one of my first VR experiences convinced me 100% that VR is the future of gaming and entertainment as a whole! This game is so beautiful! My only complaint is that there wasn't more.\n\nHelpful | 1", "SierraEchoFoxApr 24 at 12:09 AM\nall I hated about games in the past\n\nMoving around is clunky and unpredictable. Stuff happens but there really seems to be no point behind it. The graphics are painfully bright. The sounds annoy me.\n\nA complete waste of money.\n\nHelpful | 1", "slewis7Dec 26 at 3:46 PM\nPhantasmagoric!\n\nThis game drops you into a stunningly beautiful garden environment with lovely plants and cute critters. The game play is a zen gardening exploration with very little hand holding but none really needed. Controls are simple and intuitive and I found it to be a very comfortable VR experience.\n\nTo me this game represents what I love best about VR - it transported me to a new and enjoyable reality.\n\nHelpful | 8", "Yoona159Jan 21 at 10:52 AM\nBeautiful, non-competitive and relaxing\n\nOnce I played this game, I realized that this is the kind of games I want to play on Quest.\n\nIt doesn't give me motion sickness because it's teleportation based movement.\nIt's super relaxing and non-competitive. It's an exploration game, and not meant to be difficult. You're exploring a wonderful world of plants and creatures.\n\nWhen you finish the game in a few hours, you have rooms where you can plant the seeds you've found and make sure they're watered and growing. You can also revisit the areas again.\n\nA couple of bugs here and there but nothing is perfect. You might have to finesse going back up higher platforms by searching for a valid teleportation spots, but no big deal.\n\nIt's not a very long game, and I wish it was, but definitely worth the purchase either way.\n\nHelpful | 2", "shelbybowJan 1 at 7:30 PM\nConpletely Magical\n\nI've been wanting to try Fuji since it came out and finally got around to it. It's a beautiful, enchanting experience. The main story isn't very long, so it doesn't take much time to \"beat\" it, but I know I'll return again and again to cultivate my garden to my own personal paradise. I was impressed with the size of it, especially for how much it is. I think this gem is a steal. I do wish you could return to the third garden, and wish there was more plants and pots, but I'm very happy with my purchase and would support a sequel in a heartbeat.\n\nHelpful | 4", "SifuLisaFeb 9 at 7:24 AM\nFlower power\n\nThis app is adorable ! I love it! So beautifully made .if you enjoy gardening and flowers this is the game for you !\n\nHelpful | 1", "jademanFeb 4 at 12:53 PM\nMagical!\n\nI wasnt sure if Id really enjoy this game, but I am really glad I tried it. It is truly a magical, relaxing, and fun experience!\n\nHelpful | 2", "MalpunkJun 3 at 1:22 AM\nJust what I needed!\n\nIts fun, relaxing and you escape. I Wish they were more like this. Its worth the 14 bucks.\n\nHelpful | 0", "staceface82Feb 15 at 12:26 PM\nEntertaining\n\nThis game is adorable, the puzzles arent totally impossible, and its entertaining... worth the price!\n\nHelpful | 0", "ssixxJan 4 at 7:05 PM\nVery relaxing ...\n\nI wasnt sure what to expect, but this had been on my wishlist even before I got my Quest. I finally got around to adding it to my library over my Christmas break. The graphics are stellar and half the fun is figuring out the little puzzles. And can I just say theres a little ride in the game that is absolutely fabulous!\n\nHelpful | 1", "landonbrown33Jan 21 at 3:00 PM\n\nMost beautiful game on the quest. It is so satisfying, relaxing and very well put together. Its a masterpiece and my favorite game right now. 100% worth $15.\n\nHelpful | 1", "sumocateJan 25 at 3:38 PM\nBrilliant experiance\n\nMoney for value. Start caring your mind garden!\n\nHelpful | 0", "JustN3k0Jan 2 at 2:27 PM\nMagical\n\nVery kind and meditative exploration game\n\nHelpful | 0", "purdeyOct 31 at 10:21 AM\nVery good\n\nIt's such a shame we can't back again to the third garden so 1 star less.\n\nHelpful | 9", "MalibinoDec 2 at 11:32 AM\nLike being in a fantasy cartoon world\n\nNice colors and interesting puzzles. I have been enjoying myself.\n\nHelpful | 7", "this-is-temporaryNov 18 at 1:54 AM\nReally sells me on a fantastical space.\n\nEvery time.\n\nHelpful | 4", "sentientbeingAug 29, 2019 at 3:35 PM\nInner child wonder land\n\nIf my inner child wanted to play, this is the type of world she would create. Everything is so colorful, vibrant, and intricately designed. It reminds me of the land of Willy Wonka in it's interactivity and surprises. Enter the world of your curious imagination that you didn't even know you had :-)\n\nHelpful | 6", "bk227865Nov 12 at 1:42 PM\nTruly VR\n\nNice and refreshing virtual reality experience. I whish i could explore more worlds like this one.\n\nHelpful | 0", "galvanizedgazelleJun 28, 2019 at 8:54 PM\nBeautuful\n\nHi! I'm having an issue with the game. When my head is too close to a solid object like a stair or wall, I lose my 6 degrees of freedom and the world starts moving around me as if I was only in 3DOF, which is really disorienting. I dont know if this was a purposeful method of keeping people from clipping through floors or just a glitch but I would prefer if it was replaced with just telling me to take a step back or asking me to return to the play space like in shadow point. I'll write a real reveiw once I've actually played more of the game. All I can say right now is that its very pretty!\nUpdate: I've played more of the game and didnt have any more orientation issues. I wanted to update with a more positive reveiw because I'm having a great time after exploring 2 of the 3 areas. They're actually quite big, and there's plenty of secrets and hidden pathways. It feels like that scene in avatar when hes running through the forest for the first time, touching everything and watching it react. Definitely an experience that's only possible in vr\n\nHelpful | 63", "bguyleAug 1, 2019 at 5:01 PM\nFun, peaceful, albeit short\n\nFujii is a great experience, and like others have mentioned it's a great palette cleanser after more intense games. Really enjoy the art and music which carry the main experience.\n\nUnfortunately there are only two expansive areas to explore and grab seeds and currency from while the third and final area is a very short linear jaunt that can't be revisited.\n\nThe game is one of the few on the platform that offers multiple save slots so that you can keep your garden while sharing the main experience with friends and family.\n\nHelpful | 11", "psydzlJul 14, 2019 at 7:41 AM\nThe videos are misleading\n\nThe impression you get of this game from watching the videos is nothing like the experience of being in this world. I wasn't particularly impressed with what I saw in the videos, and only bought it because of the reviews. I'm so glad I did. It's definitely worth experiencing. It fulfills the promise of VR to take you inside an alien world of beauty. It's worth mentioning that in many ways it's an homage to Studio Ghibli's \"Totoro.\" I loved that movie, and stepping into its magical world through this game was a delight.\n\nHelpful | 18", "Gravzer333Jun 28, 2019 at 4:17 AM\nIntriguing\n\nSo i bought this game today and im having a really great time the weird floppy arms are really weird and the artstyle in general is amazing and beautiful.\n\nI found the gameplay to be really interesting and different to most anything Ive ever played before.\n\nSpecial mention to the inventory system by the way, its really interesting that its a buch of flower heads that act like pockets of sorts that you can place all sorts of things in, very cool design here.\n\nThe only feature this game needs is an option for smooth turning and smooth movement with the left thumbstick but keep teleportation on the right. Ive always found the teleporting and snapping rotation to be really immersion breaking for me, could we get these features as optional things devs? Pleeeeease =)\n\nOverall though Im having a blast this is fantastic if you like chill puzzle games\n\nHelpful | 44", "gallon422Oct 10 at 6:15 AM\nbest vr game 5 stars\n\neveryone must buy this gamethis is what you want in VR, and it is amazing beautifulthe game is almost ferfect. thanks the developers.\n\nHelpful | 0", "ZenburnJul 4, 2019 at 4:33 PM\nA Beautiful Floral Journey\n\nThis is one of the best experiences Ive ever had in any VR system. Its a feel good game, a la Nintendo or even Ghibli. It just make me happy to be there. Ive had some\nLost tracking issues (rare on Quest) and dislike the very ending of your arms positioned in a way that you can see inside the model, but those are my only complaints.\n\nI have a suggestion: How about a new character? Some creature that you can use to traverse this world floating around, just to chill and relax, maybe plant some seeds. A new way to experience it after you complete the main quest. I would also like to have more ways to interact\nto the little guy that follows you, I just love him.\n\nI think a lot of VR games are stressing, and those who arent usually have cartoony graphics that are too mobile like, generic cartoony art style. Fujii is visually sophisticated but in a really\nclean, optimized way. This game should be a vr category in itself. We should have more of this type\nof content on Quest, feels just perfect. I would buy DLC\nfor this game on day one. Keep the great work guys!\n\nHelpful | 10", "VRVEJul 24, 2019 at 5:02 AM\nThis is what VR is all about!\n\nBeautiful scerene experience in an otherworldly organic world. You set off on your adventure with your cute guide to spread light, planting seeds and helping them grow. It uses the medium of VR to the fullest extent, to transport you to an alternate reality, with no compromise. Highly recommend for a peaceful and positive adventure :)\n\nHelpful | 3", "MeatballmachineJul 21, 2019 at 6:30 AM\nEscapism!\n\nThis is a lot bigger than what I thought it would be. i got the impression this was just going to be some kind of visual passive experience but no! There are multiple worlds to explore and objectives if you want to pursue them. But mainly it is a beautiful and peaceful, relaxing place for you to escape to and explore. it seems possible you could be in here for many hours at a time. Awesome 14.99 well spent! After a stressful day, hang out in Fujii!\n\nHelpful | 3", "Grimlock_ArtsAug 1, 2019 at 1:56 PM\nPlease add a joystick locomotion option!\n\n(Update: thanks devs, I appreciate you responding to my review! Super happy that joystick movement is implemented, thanks!)\nOld review:\nI don't understand why so many recent VR releases neglect to add a joystick locomotion option. Warping around is just flat out disorienting and immersion breaking. I can't play games that only have this option to get around. The game looks like it has the potential to be a great experience but I just can't get through more than 5 to 10 minutes without getting fed up with warping everywhere. Shadow Point got it right regarding joystick locomotion. Please consider updating and adding it as an option for those who find warping an excessively poor game play experience. Thanks, I hope to get to really experience this game and bump it to a five star, as is the limited movement method ruins the experience.\n\nHelpful | 7\nDeveloper ResponseAug 1, 2019 at 12:04 PM\n\nHello! We've actually already implemented the joystick locomotion into the game, but unfortunately it is not clear at all and we have not created the tutorial-text on how to do it. To toggle between teleport and your desired smooth locmotion, just hold JOYSTICK BUTTON and TRIGGER BUTTON for a few seconds. please let me know if it works for you, thanks! we described it in detail here: https://steamcommunity.com/games/589040/announcements/detail/1598133636286691885", "hegesolOct 6 at 3:00 AM\nHow to save\n\nHow do i save the game?\n\nHelpful | 0\nDeveloper ResponseOct 9 at 10:46 AM\n\nThe game auto-saves during certain checkpoints and whenever you quit/suspend the Fujii application. So don't worry about having to save your journey. I hope that helps, thanks.", "NewmanMollyAug 29, 2019 at 6:16 PM\nBreathtaking\n\nGraphics and music combine to make this game a fantastic smorgasbord of wow. So very delighted with it that I dread finishing. GORGEOUS.\n\nHelpful | 2", "Nostromo-MattJul 28, 2019 at 8:44 AM\nLike a mini break\n\nThis game was an absolute joy to play. Just like having a little holiday on an alien planet. Although simple and without substantial depth, the games aesthetic does a pretty good job of making this less of an issue. That said, there's probably not enough here to keep me coming back either. Worth your time and money for the experience!\n\nHelpful | 4", "mrgreen72Jul 24, 2019 at 10:51 AM\nMagical!\n\nI know this sounds like hyperbole, and maybe it is, but this game is like nothing else. It almost feels therapeutic!\n\nCrazy talented devs! Can't wait to see what they do next!\n\nHelpful | 4", "notlionJul 1, 2019 at 12:13 PM\nCant stop bopping these plants!\n\nFujii is such a well crafted game. Funktronic really did an amazing job giving the game a sense of place. Nearly everything is super tactile and reacts to being touched in the most delightful way. It runs great on Quest, too!\n\nHelpful | 6", "VR2050Jul 23, 2019 at 8:53 PM\nObsessed\n\nSo great! Worth every penny. The visuals are stunning, especially on the Oculus Quest! And the home garden is amazing. Please come out with a part 2. I would buy it immediately.\n\nHelpful | 3", "b-twiceJun 28, 2019 at 8:45 AM\nA real visual treat on Quest and Rift\n\nI did not know what to expect and I am very pleasantly surprised - this game is very beautiful and the characters are so darn cute! Am not finished yet but he game play is fun and different from other experiences I have tried.\n\nLooks great on both of my HMD's too!\n\nHelpful | 4", "sebastian.kurz.583Jul 15, 2019 at 11:23 AM\nBeautiful immersive experience\n\nPure art: Get this if you love art and unique experiences. A true festival for the senses: The audio (Hello Jean-Michel Jarre) fits perfectly the magical visuals, you can interact with your hands with the environment which feels so vivid.\nI would love to have infinite play space to walk completely through those space gardens.\nFor the art loving explorer.\nHeadphones strongly recommended!\nFantastico!\n\nHelpful | 8", "steve13870Jul 2, 2019 at 1:40 AM\nRelax\n\nThis game is the most relaxing game I've ever played it's just pure joy .(best played with headphones)your not going to kill anything or save the galaxy but what this does offer and no spoilers is one of the most enjoyable times you can spend in a vr game\n\nHelpful | 3", "RequiemieroJul 20, 2019 at 4:17 PM\nA beautiful experience\n\nI'm loving being able to work on my garden and I wish I could experience going through each biome for the first time again. I was especially wowed in the third biome and I'm sad that I can't go back to visit it.\n\nHelpful | 2", "JJZabaJul 1, 2019 at 12:00 PM\nFor those who love getting immersed\n\nThis has to be the most I've felt really engaged with a VR game. Wandering around this magical forest is so much fun and you can interact with most things; flowers move to your touch, you can pick up slugs and even tickle the cute little creatures. If you rush through this you are missing out. There is probably not much replayability one your done, but this is a great demo to show people who have never seen VR so worth keeping.\n\nHelpful | 3", "ShouldYouPlayThisAug 12, 2019 at 12:15 PM\nYes\n\nYes, but gets repetitive after some time.\n\nHelpful | 4", "twistednipsJul 19, 2019 at 10:24 AM\nA perfect VR experience\n\nPrepare to be transported to a surreal world of wonder. Great use of VR and the interface is perfect, a fantastic unique experience\n\nHelpful | 2", "darwins.lastJun 27, 2019 at 5:25 PM\nGORGEOUS Experience!\n\nSooo relaxing and beautiful. It's like food for the spirit. Play at night to unwind and just breathe. An awesome game. Thanks devs!\n\nHelpful | 11", "dearest_daveyJun 28, 2019 at 11:10 AM\nAmazing\n\nGames like this are why I bought into VR. Its totally immersive and relaxing, and a great game to wind down at the end of a long day. And I love the mechaniques and unique environment as well.\n\nHelpful | 3", "uftarJul 2, 2019 at 5:12 PM\nIncredible experience\n\nRelaxing game, marvellous landscapes, exuberant alien forests and you are some kind of extraterrestrial gardener. Relaxing but addictive. You'll want to stay in this imaginary world\n\nHelpful | 2", "larsonmattrJun 27, 2019 at 9:23 PM\nBeautiful!\n\nThis game is wonderful. The music, the haptic feedback when you navigate, or music when you interact with flowers are all so nicely done. This should be a lot of joy!\n\nHelpful | 6", "aaron.sommers.1253Jul 6, 2019 at 6:53 PM\nFujii\n\nTruly a beautiful experience, love going to my world's to garden with my little friend :)\n\nHelpful | 2", "adamraraJul 7, 2019 at 12:06 AM\nAbsolutely stunning.\n\nThe art and sound design are amazing. The interactions with objects are amazing. I could spend hours inside Fuji. A beautiful piece of art.\n\nHelpful | 2", "DarandjeffJun 29, 2019 at 7:33 PM\nUnplayable for Me\n\n2 stars because its beautiful but I was about a half an hour in and came up against a seemingly impossible to solve puzzle. I was unable to find any hint, help, walkthroughs or gameplay videos to help me so I cant play any longer.\n\nHelpful | 12\nDeveloper ResponseAug 1, 2019 at 12:10 PM\n\ndang, sorry to hear about being blocked by the puzzle. there have since been a few youtube playthrus of the game, maybe it might be helpful to help unblock your experience? Thanks alot and hope you give Fujii another chance!! https://www.youtube.com/watch?v=19A-LC28CyM", "sammycatloJul 4, 2019 at 12:07 PM\nThis is what VR was made for\n\nExtremely immersive and trippy experience with a beautiful theme. You can play the game while sitting on the floor too.\n\nHelpful | 2", "Barryboi07Jul 3, 2019 at 3:23 PM\nGame working\n\nGreat got working think was tech problem ok Facebook Instagram was in panic but as always great graphics and happy now thanks\n\nHelpful | 1", "KLX2020Jun 28, 2019 at 1:36 PM\n\nGood tool to relax and refocus after a hard day after work.\n\nHelpful | 2", "Alex_VR_Jun 27, 2019 at 1:03 PM\nGood for a couple hours!\n\nNot as engaging as I prefer, this is a very passive but beautiful experience. Falls a little short for me. Check out my review at YouTube.com/AlexVR\n\nHelpful | 13", "KentashJul 2, 2019 at 2:40 AM\n\nGreat game! Creative and entertaining.\n\nHelpful | 2"]