{"App Title": "Gadgeteer", "App description": "Gadgeteer is a physics-based VR puzzle game where you build chain reaction machines to solve fun, intricate puzzles. Your machines will use gadgets to launch, bump, twist, and turncreating chain reactions that may even end up tearing apart the fabric of space-time.\n\nPrepare your wits because you'll need them to build your masterpiece!\n\nPUZZLE MODE:\nSolve 60 physics puzzles in endless ways.\n\nSANDBOX MODE:\nBuild your dream machine without any rules but the rules of physics. When you're done, share your masterpiece or experience the engineering marvels of others.\n\nFEATURES:\n- Build with freedom. No restrictions on where and how you build your incredible machines.\n- Chain together 50+ unique gadgets to build your crazy machines.\n- Create, edit, destroy with 3 powerful toolheads.\n- Painlessly undo your mistakes.\n- Infinite replayability with lots of depth.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Educational, Puzzle, Simulation", "Languages": "English", "Version + Release Notes": "0.5.5", "Developer": "Metanaut", "Publisher": "Metanaut", "Website": "https://gadgeteergame.com/", "Release Date": "October 24, 2019", "Developer Privacy Policy": "WORKS\n\t\nBLOG\n\t\nABOUT\n\t\n\t\nCONTACT\n\t\nCAREERS\n\t\nBUY GADGETEER!\n\t\n\n\nPrivacy Policy\nHomePrivacy Policy\nPrivacy Policy\n\nEffective Date: 4/20/2019\n\nThis Privacy Policy applies to the Metanaut Labs Inc. (Metanaut or we) software and services on which it is placed, including but not limited to metanautvr.com, gadgeteergame.com, and the Gadgeteer video game (collectively, the Service) and details data we collect, use and disclose about our users, including you.\n\nBy clicking I agree or similar or by using the Service you are agreeing to be bound by the Privacy Policy.\n\nHow we obtain your data\n\nThe Service collects and processes personal data, which is information about you or that identifies you, as well as anonymous data, which does not identify you. You may choose not to provide Metanaut with certain data or request the deletion of certain data, which may impact Service features available to you or operation of the Service.\n\nPersonal data we collect\n\nWe collect and process the following personal data:\n\nunique identifiers that identify you including your Gamer ID (and associated data and statistics), Internet Protocol address, MAC address and other unique device identifiers;\nif you sign up for an email list, your email address;\nif you use the voice features provided through the Service we may collect the details of your voice communications;\nif you interact with us on social media platforms, such as Facebook and Youtube, we collect personal data provided to us by such platforms; and\nif you contact us for customer support or for any other reason, we collect any personal data you choose to provide, such as your first and last name and email address.\n\nWe collect anonymous data from you, which does not identify you unless associated with personal data, including but not limited to responses to anonymous surveys, metrics and other types of statistical data, which could be derived from use of the Service, and diagnostic data concerning the Service. For example, when playing Gadgeteer, we collect anonymous information on how many times you have used a gadget and how many tools you use.\n\nProcessing of Your Personal and ANONYMOUS data\n\nWe process your personal and anonymous data primarily for our business purposes, such as providing the Service, to understand your needs and the needs of our users and to provide you with better service and information, particularly:\n\nto send Service updates, patches and related push notifications that may be of importance to you and if you do not wish to receive these types of updates, patches and notifications your use of the Service may be limited;\nproviding the Service to you, such as displaying and delivering content through the Service, authenticating users, facilitating voice communications with other users during multiplayer mode or performing services requested of us;\nmaintaining and analyzing Service functionality, such as backing up data, understanding how users use the Service and drawing trends and predictions based on this data;\nimproving the Service and future games we make\nprotecting the security and integrity of the Service and its users including but not limited to detecting and protecting Metanaut and other third parties against error, fraud, theft and other illegal activity;\nlegal or regulatory compliance;\nproviding customer and technical support and to resolve customer issues;\nprovide you with information or inform you of changes related to the Service such as confirmations, technical notices, updates, suspensions, outages or other material changes; and\ncontact you with surveys, marketing or promotional content or contests, if you previously consented to such contact or we have a basis for contacting you for such purpose under applicable law.\n\nWe disclose your personal and anonymous data to our parent companies, affiliates, subsidiaries, employees and contractors for the same purposes described above. We also disclose your personal and anonymous data to third parties, who may be located in a foreign jurisdiction and subject to foreign laws, as follows:\n\nto process your data as described above and provide or enhance Service features;\nfor customer support and feedback, analyzing Service functionality and technical issues, tracking use of the Service and generating reports and data models that we use to improve the service;\nto link or combine your information with other information from third parties to help understand your preferences and provide you with better services;\nfor payment processing and fraud prevention purposes; and\nto law enforcement or a government that has asserted its lawful authority to obtain the data or where Metanaut has reasonable grounds to believe the data could be useful in the investigation of unlawful activity, or to comply with a subpoena or warrant or an order made by a court, person or body with jurisdiction to compel the production of data, or to comply with court rules regarding the production of records and data, or to Metanauts legal counsel.\nTHIRD PARTY SERVICES\n\nThe Privacy Policy only applies to personal data that Metanaut collects, processes and discloses and does not apply to the collection, processing and disclosure of data by third parties through third party services, which may be broader than set forth in this Privacy Policy, and that may be embedded into the Service. For example, we may share aggregate or anonymous information about you with hardware manufacturers, platform hosts, publishers, business partners, and other third parties, to the extent permitted by applicable law. Please contact us using the information below if you would like to learn more about third party data practices.\n\nSERVICE COMMUNICATION FEATURES\n\nYour username and profile on the Service are visible to other users of the Service. We recommend you exercise discretion when selecting your username and when using the Service. Use screen names whenever possible to protect your identity. Personal data disclosed by you within our chat areas, instant message service, message boards or during use of the Service can be collected by other users and may result in unsolicited messages. We are not responsible for protecting such information that you may disclose to third parties through the Service. To the extent that you create a public profile that may be available to others on the Service, you are solely responsible for its content and accuracy. To edit, change, or delete the above information, follow the instructions provided in the Service.\n\nIf you are UNDER THE AGE OF 13\n\nMetanaut complies with the U.S. Childrens Online Privacy Protection Act and all other applicable laws and regulations concerning children and the Internet. If you are under the age of 13, you may not create an account on or use the Service. Metanaut will not knowingly collect, maintain, or disclose any personal data from children under the age of 13.\n\nIf you are BETWEEN THE AGE OF 13 AND 18\n\nIf you are between the age of 13 and 18, please have your parent or guardian read the Privacy Policy and any other legal document presented to you and obtain his or her permission before you provide any personal data and before you sign up for or use the Service. Never tell anyone online anything private about yourself or your family, including your phone number and address, unless your parent or guardian has approved.\n\nCALIFORNIA DO NOT TRACK DISCLOSURE\n\nDo Not Track, or DNT, is a web browser setting that requests that a web application disable its tracking of you. When you choose to turn on the DNT setting in your browser, your browser sends a special signal to websites, analytics companies, advertising networks, plug in providers and other web services you encounter while browsing to stop tracking your activity. Currently, there is no DNT technology standard and, as a result, the Service does not respond to DNT signals.\n\nCALIFORNIA SHINE THE LIGHT RIGHT\n\nIf you are a California resident, California Civil Code Section 1798.83 grants you the right to request our disclosure of the categories of personal data we provided to third parties, and the names and addresses of these third parties, for direct marketing purposes during the preceding calendar year. If you are a California resident and would to make this request, please contact us as set forth below.\n\nPlease note that you may only make this request once per year.\n\nObtaining, rectifying and controlling your personal data\n\nYou may contact Metanaut to obtain a copy of any personal data we have collected about you, the production of which may be subject to a fee as permitted by applicable law. In addition, you may contact Metanaut to correct inaccurate personal data or to complete incomplete personal data.\n\nYou may be able to opt-out of some or all of the ways in which your personal data is collected or processed, or request the deletion of certain personal data, except where the personal data is:\n\nnecessary for the performance of contractual obligations;\nto comply with our legal obligations;\nvital to protect your interests or those of another person; or\nas necessary for our legitimate interests or the legitimate interests of a third party,\n\nand may do so by removing such personal data from your account, turning off certain features within the Service settings or by contacting us using the information below.\n\nData Storage and Retention\n\nWhile Metanaut is a Canadian company, the data you provide through the Service is stored and processed by third parties in countries around the world. You authorize Metanaut and third parties acting on Metanauts behalf to process your data in any country of their choosing, which may cause your data, including personal and anonymous data, to be subject to privacy protections and legal rights that may not be equivalent to those in your country.\n\nYour personal data is retained until you request its deletion as set forth above or until Metanaut no longer requires such data for the purpose for which it was collected.\n\nChange of Ownership or Business Transition\n\nIn the event of, or in preparation for, a change of ownership or control of Metanaut or a business transition such as the sale of some or all Metanaut assets, we may disclose your personal and anonymous data to third parties who will have the right to continue to collect and use such data in the manner set forth in this Privacy Policy.\n\nSecurity\n\nWe are committed to ensuring that your data is secure. In order to prevent unauthorized access or disclosure we have put in place suitable physical, electronic and managerial procedures to safeguard and secure the data we collect and process.\n\nUpdates\n\nMetanaut reserves the right, in its sole discretion, to modify the Privacy Policy at any time (Updates) and shall make Updates available at metanautvr.com. You are deemed to accept any Update by continuing to use the Service. Unless Metanaut states otherwise, Updates are automatically effective 30 days after posting on metanautvr.com.\n\nContact Us\n\nIf you have requests, questions or comments about the Privacy Policy or Metanauts data collection in general, please contact Metanaut at legal@metanautvr.com.\n\n\n\n\nAbout us\n\nMetanaut is a small team of virtual reality enthusiasts who are passionate about building a better future.\n\nOur focus is developingvaluable VR apps that are exceptional in design.\n\n\t\n\nLatest Blog Posts\n\nGadgeteer is finally leaving early access on August 27th with these big new features\nGadgeteer will get nearly ONE HUNDRED gadgets to play with\nGadgeteer PCVR / Quest 0.5.5 Released  Cubes & Colors Update\n\t\n\nJoin our studios mailing list\n\n\n\n\n 2020 Metanaut. All rights reserved", "Developer Terms of Service": "WORKS\n\t\nBLOG\n\t\nABOUT\n\t\n\t\nCONTACT\n\t\nCAREERS\n\t\nBUY GADGETEER!\n\t\n\n\nGadgeteer EULA\nHomeGadgeteer EULA\nGadgeteer EULA\n\nGADGETEER\nEND USER LICENSE AGREEMENT\n\nEffective Date: 4/20/2019\n\nThis End User License Agreement (EULA) is entered into between you and Metanaut Labs Inc., its parents, subsidiaries and affiliates, (Metanaut) and applies to the release of Gadgeteer, a virtual reality game (the Software).\n\nBY CLICKING I AGREE OR SIMILAR OR BY USING THE SOFTWARE YOU ARE AGREEING TO BE BOUND BY THE EULA.\n\n1. VIRTUAL REALITY WARNING\n\nVirtual reality software creates an immersive experience that may cause nausea, photosensitivity, epilepsy, seizures or other bodily injury (including death or disability) or property damage. As with all virtual reality software, please follow the instructions provided with your virtual reality headset and be sure to use the Software in a safe environment away from people and property that you could come in contact with while wearing the headset.\n\n2. LICENSES\n\n2.1 License. Metanaut grants you a non-exclusive, non-sublicensable, non-transferrable, revocable, limited license to install and use the Software if downloaded from Metanaut directly or from an authorized third party. You may only use one copy of the Software at any time. If you wish to use the Software on two or more devices, you must acquire additional Software licenses. You agree that no title or ownership interest in the Software is transferred or assigned to you and that the EULA is not a sale of any right to the Software.\n\n2.2 Streaming and Social Media License. Metanaut grants you a non-sublicensable, non-transferrable, revocable, limited license to publicly display the Software on video streaming websites, such as youtube.com and twitch.com, and social media, such as tweeting a video (Social Content). Metanaut may terminate or modify the scope of this streaming and social media license granted to you at any time without notice or compensation and will not be liable to you or any third party for any loss you incur.\n\n2.3 User Content License. User content includes any information that you create, submit, transmit or upload while using the Software, for example, the chain reaction machines built by a user within Gadgeteer (Machines), Social Content and any submissions, comments, questions, testimonials, advice, suggestions, ideas, contest entries or other information you directly or indirectly provide to Metanaut whether by email, posting on its forums or Reddit page or through any other method existing now or in the future (altogether, User Content). By providing User Content you represent and warrant that you have all consents, licenses and rights necessary to provide and license the User Content and you grant Metanaut a non-exclusive, irrevocable, fully-paid, royalty-free, perpetual, sub-licensable, transferrable, worldwide license to User Content under all intellectual property and other rights you own or control to use, broadcast, disclose, display, distribute, modify, make derivative works of, publicly perform, publish, record, reproduce, sublicense (on multiple levels), translate, transmit or otherwise exploit for all purposes and in all formats and mediums and with any technology now known or hereafter developed and for all purposes without attribution, notice, permission or payment to you or a third party. Metanaut reserves the right to review, edit, delete or block access to User Content without notice.\n\n3. USE OF THE SOFTWARE\n\n3.1 Personal Data. Accessing the Software may require you to provide Metanaut with personal data, which is collected, used and disclosed in accordance with Metanauts Privacy Policy. You agree to provide accurate and complete personal data to Metanaut and to update your data if it changes. The Privacy Policy is available at metanautvr.com/privacypolicy.\n\n3.2 Age Restriction. You must be at least 13 years old in order to access the Software. If you are under the age of 13, you may not use the Software. If you are between 13 years old and the age of majority in your jurisdiction, you must have the consent of a parent to access the Software.\n\n3.3 Access. Access to the Software may require hardware including but not limited to a VR/AR compatible computer, mobile device and or headset (VR Hardware) meeting certain minimum specifications set by Metanaut and described on metanautvr.com and the store page from which you downloaded the Software, as updated on one or more occasions, and an Internet connection (Minimum Specifications). You agree to provide all VR Hardware and the Internet connection required to use the Software and to pay all fees incurred by you when accessing the Software through an Internet connection.\n\n3.4 Using Machines. Metanaut may allow you to share Machines with other users and to download Machines created by other users. Even if your VR Hardware meets the Minimum Specifications, Machines may not operate well (or not at all) on your VR Hardware. Additionally, users are free to modify Machines created by others, and share these edited Machines, so long as the original creator is credited.\n\n4. LIMITATIONS ON USE OF THE SOFTWARE\n\n4.1 Limitations. You agree that you will not use the Software in the following manner:\n\na. engage in conduct that Metanaut determines, in its sole discretion, to constitute improper use of the Software;\n\nb. decompile, disassemble or reverse engineer the Software or otherwise attempt to derive Software source code;\n\nc. except for Social Content or as expressly permitted by Metanaut, reproduce, rearrange, modify, translate, create derivative works from, display perform, publish or distribute the Software;\n\nd. sell, lease or remove/alter advertising in the Software;\n\ne. cheat or use, develop or distribute automation software (bots), macro software or other cheat utility software or knowingly exploit a flaw or bug in the Software;\n\nf. break, attempt or otherwise assist with the disruption of any computer used to support the Software or experience of another user;\n\ng. upload files that contain viruses, Trojan horses, worms, time bombs, corrupted files or data or other similar software or programs that may damage operation of the Software or the computers of other users;\n\nh. utilize the Software or any part thereof for commercial purposes, except pursuant to the streaming license set forth in section 2.2;\n\ni. promote or encourage illegal activity including, without limitation, hacking, cracking, distribution of counterfeit software, cheats or hacks for the Software;\n\nj. use profanity, including short forms for profanities, punctuation marks used in place of profanities and colloquial versions of profanities;\n\nk. engage in abusive, defamatory, libellous, threatening or any other conduct that is objectionable or offensive;\n\nl. communicate, link to, post, submit or upload content that contains nudity or other sexual material, violence or any other objectionable or offensive conduct;\n\nm. abuse, bully, harass or publish false or misleading information about users or encourage others to do the same;\n\nn. infringe or violate the rights of a third party including but not limited to: (i) contractual rights; (ii) copyright, patent, trademark or trade secret rights; (iii) privacy rights; (iv) publicity rights; or (v) confidential information;\n\no. collect or attempt to obtain user data, whether personal or anonymous; or\n\np. impersonate another person or an employee of Metanaut,\n\nas determined by Metanaut in its sole discretion.\n\n5. TERM AND TERMINATION\n\n5.1 Term. Metanaut may also suspend or terminate your access to the Software at any time for any reason including but not limited to your violation of the EULA, as determined in its sole discretion. Whether a suspension will be lifted is at the sole discretion of Metanaut. You may terminate your access to the Software at any time by ceasing to use the Software and deleting any Metanaut game you have installed. Data collected by Metanaut may be retained for a period of time after your access to the Software is terminated, as described further in the Privacy Policy.\n\n5.2 Effect of Suspension or Termination. Upon suspension or termination, you acknowledge and agree that Metanaut shall cease to provide you access to the Software and may delete data associated with your use of the Software, including Machines. You are not entitled to compensation of any kind as a result of suspension or termination, regardless of whether effected by you or Metanaut, and Metanaut is not liable to you or any third party for such suspension or termination and any related loss.\n\n6. METANAUT OWNERSHIP RIGHTS\n\nAll right, title and interest in and to the Software, including but not limited to copyrights, patents, trademarks, trade secrets, trade names, computer code (source and object), titles, characters, character names, character likenesses, catch phrases, concepts, dialog, settings, storylines, themes, animation, audio-visual effects, sound effects, musical works, look and feel, methods of operation and Machines (and mechanics and other components thereof) built within the Software by users, are owned by Metanaut. Metanaut reserves all rights in the Software.\n\n7. DISCLAIMER AND LIMITATION OF LIABILITY\n\n7.1 DISCLAIMER. THE SOFTWARE IS STILL UNDER DEVELOPMENT AND MAY CONTAIN DEFECTS AND COMPATIBILITY ISSUES AND IS PROVIDED BY METANAUT AS IS. METANAUT DISCLAIMS ALL WARRANTIES AND CONDITIONS, EXPRESS, IMPLIED OR STATUTORY, INCLUDING WITHOUT LIMITATION MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD-PARTY RIGHTS, TO THE EXTENT PERMITTED BY LAW. WITHOUT LIMITING THE FOREGOING, METANAUT MAKES NO REPRESENTATIONS OR WARRANTIES THAT THE SOFTWARE WILL MEET YOUR REQUIREMENTS OR THAT OPERATION OF THE SOFTWARE WILL BE UNINTERRUPTED, CONTINUOUSLY AVAILABLE, ERROR FREE, WILL NOT HARM YOUR VR HARDWARE OR RESULT IN LOST DATA OR BE SECURE AGAINST UNAUTHORIZED ACCESS. THE SOFTWARE IS UNSUPPORTED AND THE EULA DOES NOT CREATE ANY OBLIGATION UPON METANAUT TO DEVELOP, MAKE AVAILABLE, OFFER FOR SALE, REPAIR, SUPPORT OR RELEASE THE SOFTWARE. NO ORAL ADVICE OR WRITTEN INFORMATION PROVIDED BY METANAUT, ITS SUBSIDIARIES, AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES, REPRESENTATIVES OR ASSIGNS, WILL CREATE ANY WARRANTY AND YOU SHALL NOT RELY UPON SUCH ADVICE OR INFORMATION. YOU BEAR THE ENTIRE RISK AS TO THE PERFORMANCE, OPERATION AND QUALITY OF THE SOFTWARE.\n\n7.2 LIMITATION OF LIABILITY. METANAUT, ITS SUBSIDIARIES, AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES, REPRESENTATIVES AND ASSIGNS, SHALL NOT BE LIABLE TO YOU FOR ANY CLAIM, LOSS OR DAMAGE OF ANY KIND ARISING OUT OF OR RELATING TO THE SOFTWARE INCLUDING WITHOUT LIMITATION DIRECT, CONSEQUENTIAL, INCIDENTAL OR SPECIAL DAMAGES, EVEN IF METANAUT HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH CLAIM, LOSS OR DAMAGE.\n\n7.3 METANAUTS AGGREGATE LIABILITY. PLEASE NOTE THAT SOME JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF CERTAIN TERMS OR WARRANTIES OR EXCLUSION OF LIABILITY FOR CERTAIN DAMAGES AND, IF ANY DISCLAIMER OR LIMITATION OF LIABILITY IS FOUND UNENFORCEABLE, VOID OR DOES NOT FULLY SHIELD METANAUT FROM LIABILITY, YOU AGREE THAT YOUR SOLE REMEDY, AND METANAUTS AGGREGATE LIABILITY, IS FOR YOU TO TERMINATE USE OF THE SOFTWARE.\n\n8. UPDATES\n\n8.1 Updates. Metanaut agrees to notify you of an update to the EULA by an in-Software message and by a posting on metanautvr.com. You are deemed to accept an update by continuing to use the Software. Unless Metanaut states otherwise, updates are automatically effective 30 days after posting.\n\n8.2 Governing law. The EULA and Privacy Policy are governed by and construed under the laws of the province of British Columbia. If a dispute arises, you agree that such dispute be resolved by courts located in Vancouver, British Columbia and hereby submit to the personal jurisdiction of such courts.\n\n8.3 Severability. To the extent any section, clause, provision or sentence or part thereof of the EULA is determined to be illegal, invalid or unenforceable by competent authority in any jurisdiction, then that portion shall be severed and the remainder of the EULA given full force and effect.\n\n8.4 No Waiver. Metanauts failure to assert or enforce any right contained in the EULA shall not constitute a waiver of that right.\n\n8.5 Survival. Sections 2.3, 3.1, 5.2 and 6 though 8 survive termination of the EULA.\n\n8.6 Entire Agreement. The EULA constitutes the entire agreement between you and Metanaut with respect to the subject matter hereof and supersedes any prior oral or written agreements, communications, representations or undertakings provided.\n\n8.7 Contact. You may contact Metanaut regarding this EULA by emailing legal@metanautvr.com.\n\n\n\n\nAbout us\n\nMetanaut is a small team of virtual reality enthusiasts who are passionate about building a better future.\n\nOur focus is developingvaluable VR apps that are exceptional in design.\n\n\t\n\nLatest Blog Posts\n\nGadgeteer is finally leaving early access on August 27th with these big new features\nGadgeteer will get nearly ONE HUNDRED gadgets to play with\nGadgeteer PCVR / Quest 0.5.5 Released  Cubes & Colors Update\n\t\n\nJoin our studios mailing list\n\n\n\n\n 2020 Metanaut. All rights reserved", "Space Required": "2.22 GB"}



["5 stars\n75%\n4 stars\n18%\n3 stars\n5%\n2 stars\n1%\n1 star\n1%", "Itz_jalexJul 16 at 7:51 PM\nAmazing game\n\nI have had this game for two days and really enjoy it. The puzzles are challenging but fair and each level is incredibly satisfying to complete. The 60 levels create about 6-10 hours to complete and that is not including the hours you may spend in sandbox. This game is worth every bit of $15 and\nis easily one of my top 3 games on the quest. It deserves way more attention.\n\nHelpful | 10\nDeveloper ResponseJul 17 at 1:14 PM\n\nThis is such a nice review. Thank you!", "Awesome_SanzJul 23 at 2:45 PM\nMade me cry ngl\n\nWhen I for started this game I first noticed the music. How whimsical and playful it sounds. It reminds me of me and my dad playing toys after a long day of kindergarten. Now that hes gone it brand a little tear to my eye remembering him with this music. 10/10 would recommend.\n\nHelpful | 5", "marcodeadJun 12 at 1:49 PM\nA game made with love\n\n(Per gli italiani: se volete un gioco che dia libero sfogo alla vostra creativit, prendetelo subito. Vale ogni centesimo.)\n\nAs you start the game for the first time you might be a little disoriented by the controls, but the tutorial will immediately help you learn the basic.\n\nThen, if you are like me, when you will enter the sandbox mode you will be litterally amazed and full of delight. You can feel the care and the love put in the making of this game. This is the example of what VR can bring to videogames. You will have a house, some gadgets and total freedom to create what you want. You can get lost for hours and hours, for a very little price.\nAnd if you want a more guided experience, you have 90 (or maybe more) puzzles to solve.\n\nThis game deserve more than 5 stars, and the new cubes and colours update is such a great add on. The first time I saw the colours tool I felt like a child!\n\nSince this is an early access, I'll give some advice that from my point of view could improve the game even more:\n\n1) A redo button! I know it's not easy to integrate it in this type of game, but it can be usefull in a lot of situation.\n\n2) A marker to indicate where a ball landed, where to put a piece, ecc.\n\n3) The possibility to make the pieces fit properly. I imagine a lot of work will be needed to add this feature while maintaining the total freedom that this game offers. The greatest aspect of this game is the freedom to put the pieces exactly where and how you want, and I hope this doesn't change.\n\n4) More pieces! (I know, that's easy to say)\n\n5) An option to adjust a piece in order make it perfectly parallel to the ground.\n\n6) The movement and height regulation are not so user friendly, but I can't think of anything different.\n\nIn conclusion, I love this game.\n\nP.s. the ost is perfect :) relaxing but also a little melanchonic.\n\nHelpful | 27", "Mattplus096 days ago\nDone Buying Quest Software\n\nThis is VR at it's best (for what I enjoy). Puzzles with mulitple, creative solutions. There are occasional buggy issues but I've found that a quick relaunch solves most of them for me.\n\nHowever...I won't buy anymore quest software and will detatch from the oculus product line since they will make facebook membership mandatory by 1 Jan 2023 for current users and this year for new buyers. I no longer trust Oculus. Peace!\n\nHelpful | 0", "lancaster1849 days ago\nEndless possibilities\n\nThis game is great, it was my first game, I didn't even read the reviews I was so excited. I was not disappointed, the room so far has been fairly easy but I can feel it getting harder. I hope the devs are going to add more tools like candles, string, balloons, fans, maybe some timed items that trigger after a certain time, I may be speaking prematurely as they might exist later in the game. Ha anyway just buy Gadgeteer it's fun, relaxing and a great way to forget the world for a bit.\n\nHelpful | 0", "popatartJul 6 at 10:26 AM\nA game fit for a god!!!\n\nSo I love this game and I cant get enough of it and I think somethings should be added like:\n\nA snap button to snap marble tracks together to keep them aligned and straight.\n\nA leveler so I can make platforms straight over the air for my dominos so they dont fall.\n\nMaybe a lift hill for the marbles? Or maybe a looping track!\n\nMaybe a clean all button in sandbox because I like the feature of not needing to clean after my contraptions but when I am done I have to go and clear all the blocks and stuff and it takes a while too.\n\nAnd I am about to finish the puzzle mode I wonder if I get to the end what will happen, also if thats it the end when I finish can you dev team add more maps and items in the game?\n\n\n\nI also in the game when I select the different tracks and blocks something it wont show up, let me click it, or it will show a Ghost of the block.\n\nI hope someone in the dev teams sees this because I would love these items to be added and maybe fixed!\n\nThanks!!!!!!\n\nHelpful | 6\nDeveloper ResponseJul 7 at 4:44 PM\n\nThanks for the kind words. We've noted down your suggestions and will be discussing them with the rest of the team.", "udo.nink13 days ago\nLove on first sight\n\nThis is so cool, the chain reaction machines of my childhood elevated to another incredible level. And this is only version 0.55, really curious what is to come over the weeks and months.\n\nHelpful | 0\nDeveloper Response12 days ago\n\nThe full release is coming out on August 27, 2020! It'll include Online Sharing, Puzzle Designer, and 40 more gadgets. Join us on Discord for more news :) https://discord.gg/EqTDVmy", "Peopled_Virus26Jul 23 at 11:03 AM\nVery fun game! But big flaw...\n\nI love this game a lot. And I usually dont write reviews. But this game crashes way too much. Ive had it crash twice within five minutes. So I chose to write a review so the developers could maybe see this and fix this problem so I can play this wonderful game! I really do enjoy this game but it crashes too much to be able to really love it as much as I could.\nUPDATE: I reached out to the support team which by the way was very helpful and replied quickly. I no longer am having this problem and have updated my star rating for this game because it is such a fun game to play. I would highly recommend it.\n\nHelpful | 1\nDeveloper ResponseJul 23 at 11:01 AM\n\nUpdate 7-23-2020: We've spoken with this player and the crashing issue has resolved itself after a few days of playing. We're still investigating why this is happening. -- Sorry to hear your game is crashing! Can you send us an email at support@metanautvr.com so we can get more information? Thank you and apologies.", "CheesyColtJul 20 at 4:54 PM\nReally Enjoying It\n\nI'm really enjoying this so far. Graphics are great and game plays very very smooth. I can't wait for the community maps feature to be released, this is definitely one of those games that it's going to have some crazy cool community stuff!\n\nHelpful | 1", "blert23May 27 at 4:51 AM\nMy son is enthralled\n\nMy 14-year-old son has worked on Rube Goldberg projects over the years in school and is a hard sell on new VR apps as he tends to stick with the old standbys. But as soon as I saw this I knew that would change his mind and boy did it. He goes on for anywhere from 10 minutes to 20 minutes at a time throughout the day and I love seeing him do something creative like this. He was pleasantly surprised how many levels/rooms there are as well. He never complains about it being hard to manipulate, move the pieces etc. which is something he would usually get frustrated with in other games. Thank you to devs for stretching his imagination during this time.\n\nHelpful | 6", "rjcuda19 days ago\nFUNNIEST GAME EVER\n\nThis game is so fun. I love it but its limited. Im very disappointed that its harder to play because its so buggy.\n\nHelpful | 2\nDeveloper Response19 days ago\n\nCan you kindly contact our support team at support@metanautvr.com so we can get more information? We'd like to fix those bugs for you!", "GamerrangerbobApr 8 at 6:41 PM\nAwesome for Rude Goldberg machines\n\nMy 9 year old daughter loves Rude Goldberg machines. During Covid-19 Stay at home, this is a great way to let her escape and make them. It's a great thinking and physics learning experience for her (and me). To buy the actual marble runs etc. in reality wouldn't come close to this for options, cost and no risk of choking hazards ;-)\n\nHelpful | 55\nDeveloper ResponseApr 30 at 4:49 PM\n\nOur machines aren't rude! *Rube Goldberg machine :)", "MusetteVonWakenbakeJun 29 at 5:04 PM\nA perfect Rube Goldberg sim.\n\nComplex, yet convenient, unlike a real Rube Goldberg Machine, you don't need to: actually use your whole house, obtain tons of fancy marbles, metal rails, thousands of dominoes, and while you're at it, after setting your machine off, you instantly reset it. You of course can save any machine, and the house you're provided is amazingly laid out. Very very easy 10/10.\n\nHelpful | 1", "lily125Jun 9 at 4:31 PM\ngreat game, but a few suggestions\n\nthis game is great. you are given the ability to build chain reaction machines where you dont have to worry about if you have enough parts, or if you dont have anything to build it with. its very relaxing and fun, and the design of the game is pretty cool too. however, the reason i am giving this 4 stars is because i have some suggestions. in sandbox, it would be helpful to have that box that pushes your creations in puzzle mode. usually your chain reaction machine will end up differently than how you originally did it in sandbox mode, because you dont do the same thing every time. it gets annoying when that happens. another suggestion i have is for you to be able to freeze time and place things at the same time, because lets say your using the catapult thing to launch a tennis ball. you keep trying and trying to get the tennis ball to hit the blue blocks, but each time it doesnt work. it would be handy if we could freeze time midair so that we can determine where the ball will land and build something there so that it will hit it. overall, this game is great and i highly recommend it to people who like building things, solving puzzles, and having the satisfying feeling of watching your machine be complete. great job, metanaut!\n\nHelpful | 4\nDeveloper ResponseJun 11 at 5:53 PM\n\nWe released a big update today where the Start / End cubes are available in Sandbox mode!", "munimanmunimuniMay 23 at 3:15 AM\nI want more items.\n\nThere is a limit to what we can do with the number of items we have now. I think you need a variety of items to make various gimmicks.\n\nAlso, the store's language field only shows English, but other languages are also supported.\n\nHelpful | 7\nDeveloper ResponseMay 28 at 11:26 AM\n\nMore gadgets are coming!", "robashcorlettJul 1 at 1:54 AM\nUpdate makes this more stable !!\n\nI initially returned this game because of the numerous restarts I had to make. However as it does say early access I decided to give it another go. It is still very glitchy not only do you get screen freezes but sometimes you get this weird checker pattern across the screen which forces you to restart the headset to get rid of it!!! If you can accept these shortfalls there is a lot of fun to be had here. I have just got into the second room (level 21)!\n\n(Update the latest version is far more stable. I had my Quest replaced because is hardware fault so had to start again with Gadgeteer no freezes or glitches so far!!).\n\nThe mechanics are for the most part very good although there are times when you have to lay pieces down to readjust your grip to get the positioning just right and like others have said a snap feature would be good when when laying tracks. There is a great sense of satisfaction when you get a solution to work. It would also be great to see all of the solutions running from an overhead viewpoint like a massive domino run.\n\nThis makes a refreshing change from the high octane sabering and pistol whipping games and its nice to sit down and take time to work out the solutions. I hope the developers iron out the glitches and continue to add content. I am glad I re-purchased!!!\n\nHelpful | 0", "jeffrey.a.armstrongApr 16 at 4:26 PM\nWhat fun!!\n\nI own over 25 Quest titles and I saved my first review for this fun, challenging game. I just completed all the puzzles and, despite many hours of fun and still more to be had in the sandbox, I am sad to not have more puzzles to work through. I could not recommend this game more to those of you who loved getting on the floor and designing domino masterpieces.\n\nHelpful | 16", "Marano1Jul 6 at 6:39 AM\nIgnore this review. Game fixed.\n\nThe game got an update to fix bugs and it added new bugs to my game. It worked for the first day. My other games work great, but this ga,e worked for less than a day after the update. I cant save anything because my grabber/selecter hand wouldnt select/grab anything in the selection for bricks. It would still color, vacuum, grab previously taken out bricks, and thats pretty much it. Also, when I enter the game from my game selection menu, it starts up, freezes, goes black, and then shoots a blinding white light at my face that hurts even with my eyes closed, then starts up. I liked the game when it worked. In fact it was probably my favorite game until it stopped. If the makers could fix this even though they are busy with another update coming soon, that would be great. Game works after developers helped! Thank you!\n\nHelpful | 0\nDeveloper ResponseJun 15 at 9:14 AM\n\nI'm sorry our update caused more issues! We weren't able to reproduce this bug and other people haven't reported this issue. Can you try reinstalling the game? If it still doesn't work, can you kindly send us an email at support@metanautvr.com so we may help you further? Thank you and apologies.", "l3rianKJun 12 at 8:41 PM\nA lot of fun!\n\nIm here sitting on my comfy sofa just playing this game for hours. It makes me feel like Im doing something so important in my own secret lab \n\nHelpful | 3", "ToxicLack2314 days ago\nNearly perfect....\n\nI love the idea, already in the second room of puzzles but I can't play it too long: the movement style causes major motion sickness, with or without the vignette.\n\nHelpful | 0\nDeveloper Response14 days ago\n\nThere are two movement styles that fit different comfort profiles. Have you tried them both? 1) Hold the grip button and move the joystick. 2) Use grip button to \"grab\" the air and pull yourself towards where you want to go", "OcuLorneMay 21 at 10:13 PM\nGame is awesome, sandbox needs work\n\nI just finished playing through all the puzzles, and I have to say this is the best gadget game I have ever played. I've played the 2D games in the past and never really got into them, but in VR everything is so tactile it's just a pleasure to play through every puzzle. I also love that you don't have 'only one solution' or 'just enough pieces' to solve each puzzle - you can be creative and have fun.\n\nThe sandbox could be super fun, but it's missing the actuators from the puzzles, so it's really painful trying to set up gadgets with no easy way to start them. Also I had hoped to build marble machines, but there is no 'lift' (no way to get the marbles back to the top). That's kind of the core requirement for a marble machine, so at present you can't do it.\n\nThis is early access though, so hopefully they will fix the sandbox before version 1\n\nHelpful | 3", "RJ-D3Jul 26 at 12:54 PM\nNear perfect\n\nThis game is very high quality. My only problem is that it crashes a lot.\n\nHelpful | 0\nDeveloper ResponseJul 27 at 10:17 AM\n\nSorry to hear your game is crashing! Can you send us an email at support@metanautvr.com so we can get more information? Thank you and apologies.", "scottoculusMay 4 at 5:21 PM\nGreat game, big value\n\nIf youve ever used dominos, erector sets, tinker toys or rolling ball gadgets check it out. A lot of puzzles will keep you busy a long time and free form. Pleasant thoughtful break from shooting or slashing in other VR. Well programmed.\nWish list: teleporting instead of nausea endured pulling\nReturn to same place in Home rather than having to pull room over each time\nAccurate repeatable physics\n\nFuture: add on physics objects packs\nRelive & share solutions\nTimer for speed comparisons\n\nHelpful | 3", "justdavenJun 13 at 4:10 PM\nReally fun, good interface\n\nThis game is a lot of fun! Build those falling domino games, then push them over and you don't have to clean up. Just push reset!\n\nControls are easy to learn, and I like that you can operate it sitting down, if you want.\n\nHelpful | 0", "CalamityofWarMar 23 at 9:48 AM\nAll of the fun, none of the frustration!\n\nIf you're a creative or problem solving type who maybe enjoyed doing things like building domino rallies, Legos, or Lincoln Logs then you will love this game. Im don't usually play casual games but I love the challenges and feel of this game. The game is still in early access but I feel that I have already got my money's worth working through a few hours in the puzzle 'campaign'. This is also one of the few games that supports mixed reality.\n\nPuzzle mode: build Rube Goldberg machines from the initiating point/device to trigger the end point device (pressure switch).\n\nFree play: go nuts making whatever you can imagine.\n\nI just started streaming this game in mixed reality and first person on twitch if you want to see some gameplay @hifivibes.\n\nThanks for making such a game!\n\nHelpful | 18", "Loudini12May 2 at 5:09 PM\nRelaxing\n\nThis game helps you forget everything and relaxes you as you go through many puzzles will so many different solutions. The physics are perfect and fun for all ages. Can play sitting down and is perfect if you were to be on a plane. Underrated game. Please consider buying!\n\nHelpful | 2", "OmegaGamerEX110 days ago\nMust Have.\n\nThis game is adorable, first off, and second, INCREDIBLY fun. It really exercises creativity, which I can appreciate. It also allows me to do something I don't have the time to do in real life. After about maybe 20 levels, I had realized time had just flew by. This game is so much fun, and for an early access, it's actually pretty good. Can't wait for the updates! (As well as hopefully more levels...!)\n\nHelpful | 0", "Ender7728 days ago\nStill Needs a a better snap function\n\nThe pieces dont fit together. Its more fun to build in angry birds. There you can just build and go. But here you have to think about and plan everything so much it becomes very frustrating. Nothing works here.\n\nHelpful | 3\nDeveloper Response5 days ago\n\nWe agree with you! Gadget-to-gadget snapping would be a great feature. It's something we're going to consider for the next version of the game.", "june.faleiroJun 7 at 6:07 PM\nAmazing game with one fatal flaw\n\nI love this game, it's easy to pick up, fun and relaxing to play and satisfying to watch a chain reaction happen. HOWEVER, and most review don't mention this - on the quest I experience black screen crashes to the Oculus home every 10-20 minutes, which is so frustrating as you have to restart the headset and relaunch the game. I'm sure the Devs will eventually fix this, and when they do this game will get a 5 star review from me.\n\nHelpful | 1\nDeveloper ResponseJun 8 at 4:49 PM\n\nSorry this has been happening to you! This has been a tough problem to solve and we'll need more user data to fix it. Do you mind if you write to us with this problem at support@metanautvr.com?", "Iron_Ninja247May 9 at 4:05 PM\nTook me back to my childhood.\n\nThis game took me back to when I was a little kid Playing with legos, and marble machines. I havent felt this calm in so long. Although I think they should allow you to pick up items with both hands as that would make rotating items a little easier.\n\nHelpful | 1", "Davison57May 16 at 4:14 PM\nGet this game NOW\n\nA perfect game for those who love Rube Goldberg devices. It has both pre-set puzzles, and an open sandbox play area. This is a MUST HAVE for anyone who enjoys mechanical thinking.\n\nHelpful | 1", "MiAMiB3ASTMay 23 at 10:54 PM\nAwesome\n\nGreat Game, smooth easy controls and awesome puzzles! All around fantastic experience. Will recommend to any puzzle lovers \n\nHelpful | 0", "AskjerryJan 22 at 8:50 PM\nLike to topple dominos and play marbles?\n\nI was bored and felt like getting another game... I figured it looked good... so why not? It's pretty cool... the control is slightly glitchy when switching between grabber, eraser, and cloner... sometimes you click but it doesn't stick and you gotta do it again... not horrible... just something to expect. You can go to the sandbox mode and then you have an entire room and unlimited parts to play with... worth the price just for that... it would cost a FORTUNE to buy all those parts!\n\nStart with the puzzles... learn about more parts and methods as you build up your skill. I went to play for 20 minutes... pulled the headset off 2 hours later... addictive! The puzzle room is HUGE... it's going to take awhile to master them all.\n\nOh yeah... this game has PERSONALITIES... so your friends (kids) can have their own set of puzzles and projects. I wish more games would do this! For most games, someone goes in and plays it... then you go to play... and end up skipping levels... here... you have your OWN section. nice!\n\nHelpful | 46", "dgibb2000Feb 28 at 9:09 PM\nGreat for kids\n\nMy kids love engineering paths through the puzzles. Simple but challenging physics game. You have a different set of pieces for each \"level\" and need to figure out how to use them in just the right way to complete the puzzle. Of course each level could be solved an infinite amount of different ways.\n\nHelpful | 6", "Arkangel1224Mar 27 at 9:04 AM\nGreat game but...\n\nThis game is amazing and really fun to mess around on. My only complaint is that the movement is a weird and some physics are inconsistent. This means that of a block falls, it falls and hits differently almost every time which makes you reset and play the level over and over until it falls right. All of those small things are also not bad and can be worked around. I think there needs to be more levels and possibly more blocks and tools to use. It would also be cool if there was a challenge mode where it made everything a lot harder.\n\nHelpful | 3\nDeveloper ResponseMar 27 at 10:54 AM\n\nTry using joystick locomotion: hold down either of the grip buttons and move either of the joysticks to move around and up/down. Your suggestions are on our radar and some of them will even be making their way into the game soon!", "mrmarczykApr 23 at 1:24 AM\n\n2020-04-27: We were in contact with support recently. Very helpful. I gave them second chance and I think that I will not regret.\n\n2020-04-19: A Few days ago I sent you mail at support@metanautvr.com with problem description and there is no reaction from your site.\n\nFirst comment: I bought a game a few months ago, but now I have time to try it. Unfortunately, the game allows playing tutorial only, nothing more. No other option. You will lose money when you buy it.\n\nHelpful | 1\nDeveloper ResponseApr 20 at 2:21 PM\n\nUPDATE: Our support team is in communication with this player. We'll fix the issue as soon as we learn more about the issue from the player. -- Something must be wrong. We have two different modes for players to spend countless hours in: Puzzle mode and Sandbox mode. Have you tried pressing one of the buttons on the table? If you're having more issues with this, please contact us at support@metanautvr.com so we can help out!", "jaztrgregMay 1 at 11:00 AM\nGreat game with such potential\n\nI love the sandbox mode in this game. I just wish there were more tools to play with. I thought I read there is more coming but not sure. Even still I love how relaxing this game is and the creativity you can have\n\nHelpful | 0", "markamercurioApr 2 at 5:50 AM\nGagiteer is Amazing\n\nI love this game! I've lost hours sumersed in this alternate reality! With being stuck home with social distancing it's perfect for a person that needs to exercise their brain. Best to be saved for rainy days.\n\nHelpful | 2", "Ravioly_spiderMar 29 at 11:27 AM\nIts fun I like it\n\nThe game is fun it took some time to get the controls but after that it was straight forward placing stuff down was very easy specially dominos. I would say that the trickiest thing to place down is the ramps\n\nHelpful | 2", "Deadpool2896Apr 20 at 6:23 AM\nGreat puzzle game\n\nI was not sure about this game, after playing for an hour I found it to be very enjoyable. The puzzles are are not hard but some are a challenge and really make you have to plan your path.\n\nHelpful | 0", "Topher420247Feb 21 at 3:54 PM\nThis movement should be the new standard\n\nOnce you move around in this game you will never want to go back to the hop method. I love how easy it is to rotate and move up and down..... the up and down is fantastic. The gameplay itself reminds me of the incredible machine from back in elementary school. It's just so much fun to come up with new ways to do things\n\nHelpful | 4", "Horrorfreak78Apr 12 at 5:23 PM\nMeh...\n\nIf you werent a creative person but wanted to try this game, I would not suggest gadgeteer. I feel this way for a few reasons. One, the tutorial is NOT helpful. Two, if you restart the loop of your creation over and over again, it will not end up the same. And finally three, half of the materials you are given, you have NO IDEA how they work and I know this isnt just me. Im not saying that gadgeteer is horrible, Im just saying that, out of all the oculus games out there, this is not the best.\n\nHelpful | 2\nDeveloper ResponseApr 14 at 10:27 AM\n\nThe tutorial covers the basics such as grabbing and cloning gadgets. It's in the first several levels where we teach players how gadgets can be used. But feel free to use them however way you want! There is no prescribed way to use gadgets. We encourage players to be more creative with them.", "steve.nicklinMar 23 at 11:00 AM\nFabulous VR Game\n\nIf you loved the 2D PC game The Incredible Machine back in the 1990's then you will absolutely adore this beautiful recreation in glorious technicolor 3D immersive VR!\n\nHelpful | 2", "Derpy_ManateeFeb 13 at 2:15 PM\nVery fun\n\nI love this game with a passion, it has no issues running and the controls are very easy to use. I might be biased toward engineering based games but whatever. Ive only played a little bit of it and am already in love with it. It has a full 60 levels of gameplay and a sandbox mode with almost no limits. I recommend!\n\nHelpful | 3", "holger.ruscheDec 10 at 11:49 AM\nEndless Endless Endless Fun .....\n\nAll my childhood dreams come true! This was my first thought when I set foot for the first time in the magical building world of Gadgeteer. We needed this game. It is made for VR, it is really only really playable in VR.\n\nSo what do you get if you buy Gadgeteer? Maybe I'll tell you what you do not get. You will not get any opulent graphic-loving candy world with lootboxes and everything else that goes with it. Gadgeteer is not a shooter, it's not a zombie apocalypse, it's not a racing game. It is even the opposite.\n\nGadgeteer brings you down, it slows you down. It plays you in slow motion, as if you had smoked something. :) Here's just you and your bricks, ramps, tunnels, bullets, funnels, rails. Ok, I stop.\n\nThis game is the absolute relaxation, it is balm for the soul. Finally, build all the ball tracks you always wanted to build. The best thing is: In sandbox mode you have endless stones .... for endless fun.\n\n\nSo now you would like to know if I should buy Gadgeteer?\nIf you have read this far and still have not bought it, you can not help it.\n\n\nFinally, a little note for the developers:\nBe so kind and give us a snap mode so that the parts fit better together.\nAlso different colors would be great.\nIn addition, I would be pleased, if even more locations are inserted. For example, a warehouse with a lot of space or a location outside.\n\nHelpful | 44", "SamHamwichJan 20 at 1:06 PM\nIt may be the best game on quest.\n\nSetting up dominoes, pivoted bits of wood, ball bearing runs and other stuff (i havent found yet) to trigger a switch at the far end of a cluttered bookcase may not sound like your idea of fun, but youre wrong, it is.\n\nThe game is perfectly playable while seated but also very good in room scale as you spend quite a bit of time in each small room of the little apartment and the world begins to feel like a real place.\n\nGraphics are functional and sunny, the apartment is a nice place to hang out. Tools are well designed and make satisfying noises.\n\nHelpful | 6\nDeveloper ResponseJan 22 at 11:21 AM\n\nIn later levels, the lighting (and mood) of the apartment changes :)", "SadactJan 19 at 7:52 AM\nTicks so many boxes\n\nYou can play it plugged in (seated), while your Quest charges after you've drained the battery on Pavlov Shack. The, well-designed, puzzles have essentially an infinite number of solutions - my youngest son's, for example, are utterly different to mine (mine are intricate, his are brutally effective). Which highlights another boxed ticked too: multiple profiles, so several people can enjoy the game without interfering with each other. It's fun. It's challenging. It's satisfying. It's weirdly relaxing. There are many hours of gameplay. There are minor things: the locomotion (if you're playing seated) is counterintuitive; the physics engine is, let's say, not under the control of Laplace's Demon, so identical actions do not always produce identical reactions. But it ticks *so* many boxes, *so* well, that, if it's not in your library, then there's a hole in your life, and we all feel quite sorry you.\n\nHelpful | 7\nDeveloper ResponseJan 22 at 11:24 AM\n\nIt's great to see parents playing our game with their kids! Have you tried smooth locomotion for a better seated experience? Hold down any of the grip buttons and move the joysticks.", "1JJJMar 3 at 7:33 AM\nAlmost perfect\n\nVery few things that I would change. Sometimes the motion when you move seems a little jerky. Another thing In sandbox mode they should give you a start button like they have in the challenge mode so you could create your own challenges. I really recommend this game. It makes you think and plan your next move. Also you can go back and redo different levels to come up with different ways to complete the challenge.\n\nHelpful | 0\nDeveloper ResponseMar 3 at 12:14 PM\n\nThe start and end cube will be in the next few updates. With those cubes, you'll be able to remote start your machine from afar.", "emklettFeb 23 at 3:00 PM\nQuite nice but feels sad overall...\n\nFirst of all, I really like the principle of the game, and globally it's quite well made.\nBut, I stopped playing with it, not because of the few crashes or because of the game itself, but because it is quite dull.\nWalls are pure white and the interior is not made very joyful, the outside is more dead than an industrial zone in the north of Scotland, the background musics are not very happy to say the least...\n\nPlease bring colors and happiness feeling to this game, that will change everything :)\n\nHelpful | 8\nDeveloper ResponseFeb 20 at 1:27 PM\n\nNoted.", "Sully327Feb 20 at 7:49 PM\n\nThe controlls are amazing, everything feels so natural and I love the menu/level design. Very well designed and really easy to learn\n\nHelpful | 3", "Epicgamer4000Apr 13 at 9:24 AM\nNot as good as the reviews\n\nMade me feel dizzy with the movement the price of this is overpriced. The blocks wont stay in the air. Dont buy.\n\nHelpful | 4\nDeveloper ResponseApr 14 at 10:18 AM\n\nSorry to hear you got simsick while playing our game! Have you tried both locomotion methods to move around? Have you also turned on the \"comfort mode\" in the settings? Gadgets do not stay in the air because we wanted to simulate physics realistically. To give your machines more height, you can quickly build scaffolding using the 'freeze' feature. We're always looking for ways to improve our game. Feel free to contact us at hello@metanautvr.com if you have any further suggestions!", "Pooky1233Jan 22 at 3:34 PM\nLoads of fun\n\nThis game is amazing, you can play it anywhere and make these massive mazes and complex machines, there customizable options are massive too. Would like it if you could change the colour of parts and a level share system but even without these 2 it's a fantastic game\n\nHelpful | 3", "GabeBellFeb 19 at 1:02 PM\nEnjoying it a lot, with one minor cavaet\n\nI got this two days ago, and have been enjoying it a lot. The puzzle aspects are fun - solving, winding back and then solving again when the solution doesn't *quite* work as you want.\n\nBut the main part is the sandbox area, where I am creating grand masterpieces of machines - rolling balls and going all over the house. However it is here I am finding one problem - that might be just specific to me. My hands tend to shake a little when I am using the controllers, so I am having problems lining up the wooden blocks and metal runners exactly, which means the balls don't run as well as they could - they sometimes stall and stop. And trying to adjust them just makes it worse, because the minor adjustments are harder than the big ones (if you get what I mean). If there could be some kind of snap mode (even if it is optional) it would make life infinitely better - for me at least.\n\nBut - that aside - this is a lot of fun, and I see myself enjoying it a great deal for days and weeks and months to come :)\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 1:25 PM\n\nTrack snapping is something we've prototyped before and has worked well for our shaky hands too. We might add this feature in the future.", "CrustyPocketsFeb 12 at 3:45 PM\nWow\n\nThis is the game I never knew I wanted!\n\nI just wanted a few more games that could be easily played seated so I took a chance on Gadgeteer and it's the best decision I've made so far on the Quest store! I don't think I'll ever get bored of this <3\n\nHelpful | 1\nDeveloper ResponseFeb 20 at 1:26 PM\n\nThank you for such a positive review <3", "loulam06Mar 30 at 1:44 AM\nAmazing\n\nJust wow\n\nHelpful | 0", "cantennaFeb 6 at 2:57 AM\nBreath of fresh air right here!\n\nWas on the hunt for something different and here it is!\n\nGreat buy for me, thank you!!\n\nPlease endeavour to bring us custom music. The included sound track is fantastic but for a game like this it would be fantastic feature to add.\n\nPlay this for hours...\n\nHelpful | 1", "justingkentJun 23 at 10:20 AM\nImmersive and fun, but...\n\nFor me, the game crashes to a black screen every 5 mins or so meaning you have to quit the game and restart. A shame as it's cleverly thought out and torally enjoyable to play if you want a game that's not about shooting, screaming etc!\n\nHelpful | 0\nDeveloper ResponseJun 23 at 1:31 PM\n\nDo you mind sending us an email to support@metanautvr.com with details on what you were doing before the game crashed? We'll try to fix this for you as soon as we can but we need more information.", "wagnerstechtalkOct 24 at 2:49 PM\nAwesome Fun\n\nGadgeteer is one of those games that you will never get bored of. There are several levels, 60 in fact (Future: more levels are planned, more gadgets and online sharing). It starts out very easy but gets progressively more complex. Aside from the Tutorial, there are two modes which are Puzzle (game play) and Sandbox (build what you want). The puzzles are challenging, especially once you get beyond level 12 or so. They really begin to step up around 28 and will take about an 1-2 hours or so to get that far. There are several sample sandbox machines you can try too, which are pretty impressive and a good inspiration for someone wanting to exercise their creativity.\n\nThe sandbox mode gives you infinite replayability, I found it just as fun as the puzzles. There is also a hidden button that will unlock ALL of the levels without having to complete them all. If you're interested in a demo of this game/physics simulator, you can check out my review of Gadgeteer on my Wagner's Tech Talk YouTube channel (Link: https://youtu.be/sbzeD_WAgKk ).\n\nI really would have loved to have this about 3 years ago to help my daughter with her school project. She could have designed it in VR and then build the physical model. But, I'm happy to have it now and it is a very relaxing game to play. Check out the other comments here, watch the videos and I'm pretty sure you'll agree, Gadgeteer is well worth price of admission. In terms of price vs value, I rate it a 5-star game.\n\nHelpful | 90", "exjraordinaryDec 28 at 6:29 PM\ngreat title and depth\n\nwow this is a fun challenging game. I haven't played puzzle type games for years its been a long time and this is brilliant with tons of tools missions and sandbox mode. My nintendo switch has been collecting dust by these heavy hitter oculus games at 1.4 the price lol.\n\nHelpful | 4\nDeveloper ResponseJan 22 at 11:25 AM\n\nThanks for the kind words!", "PineappleBoy21Apr 29 at 7:03 PM\nNeeds a little more work, but good game\n\nVery good game, gets your mind filled with creativity for a good price. Much cheaper to do a puzzle in the game than in real life, you got everything you need in the game!\nI think the game needs a little more work on the moving mechanics, the freeze option a little more easy to use on builds up in the air, and making the menu of items a little smaller.\nBut other than that, its an engaging mind game that will keep your mind going for hours!\n\nHelpful | 0", "OliwerOlekSuchMay 28 at 1:43 PM\nVery underrated game\n\nIt's just awesome and I wish it was more popular! One thing I would add is more levels, but the game is in early access so I'm sure there will be more.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 1:19 PM\n\nMore levels are coming by way of player generated content in the upcoming online sharing feature.", "DotoliverFeb 9 at 4:45 PM\nVery amazing and fun!\n\nThis is the first day I have had this game, and I am loving it! You should totally get this game! There are pretty much endless possibilities, and you can make so much!\n\nHelpful | 1", "NeverWrongFeb 28 at 1:33 PM\nLove it\n\nIf you or your kiddo likes building chain reactions, this is a must have!\n\nHelpful | 1", "jdagdelenJan 22 at 10:23 PM\nGreat puzzle game\n\nVery fun. Controls for movement are wonky but the tools and tool changing mechanism are outstanding. Graphics arent anything special but they are a pleasant atmosphere. Overall very fun and worth getting!\n\nHelpful | 2", "Peezee05Apr 14 at 11:41 AM\nKeep the kids busy\n\nThis game is awesome. Both of my kids are creative and love challenges. They have been busy for the entire day today building and watching each other build via screencast. I have not even gotten a turn yet. The ease of the controls are perfect for my 7 year old and the amount of complexity that you can build with is great for my 11 year old. Highly recommend game.\n\nHelpful | 0", "GraphicsMonkeyOct 24 at 9:51 AM\nSimple... but ingenious\n\nJust been playing and loving it. Such a simple idea, but works so well in VR. Nice to have a game that doesnt involve me getting sweaty but challenges the brain.\n\nAlso has profiles so you can have friends try it without messing up your gameplay.\n\nReally nice music, graphics and levels:)\n\nDownload and chill with this puzzle game\n\nHelpful | 29", "ism1Dec 5 at 8:27 PM\nLove it\n\nAs a fan of sandbox games where youre only limited by your imagination, this has become one of my favorite Quest games. Its also surprisingly immersive and one that gives me more of a shock to the system when I take the headset off and return to reality. It really feels like Im in the space building to my hearts content.\n\nThe physics work really well, and theres a wide variety of tools to choose from. Its also very relaxing, giving you a nice setting to focus/concentrate, and a nice break from being chased by zombies or shot at. Considering the very reasonable price point and the hours and hours Ive spent playing this game, its one of the best values in the store for me.\n\nI agree improvements could be made by adding a snap-to feature for attaching pieces, but Ive grown used to how it works & there are some situations where youre better off without it. Still, it would be nice. The grab & pull movement does cause some motion sickness & I do wish you could turn it off completely when using smooth locomotion. However these are minor quibbles that I hate to mention for such a towering achievement. Bravo to the devs.\n\nHelpful | 4", "william.m.mills.1Feb 21 at 11:49 PM\nOk... I guess\n\nThere just isn't enough parts to build anything really cool... and there is so much potential here that isn't being realized... anyway, here's 3 stars for the effort...\n\nHelpful | 2", "kkuzma1982Oct 24 at 12:44 PM\nIn my top 5 games list on Quest already.\n\nI admire how brilliantly it was ported form the PC version.\nThe resolutions is pleasantly sharp. The controls are just brilliant, plus it has joystick locomotion as an option(hold grip button and then move using left joystick and turn with right joystick). Apart from the upcoming feature of sharing levels it only probably lacks option to play custom songs and probably multiplayer option would also be great if ever possible. Still I need to admire how fairly priced it is. It should be in every Quest owner library. Thank You for this gem.\nP.S. Developers, please consider adding option to play custom songs from the storage.\n\nHelpful | 19\nDeveloper ResponseOct 24 at 2:45 PM\n\nWe'll add playing custom songs to our list of things to consider!", "CATMAN2019Feb 25 at 2:47 PM\nFun\n\nIts fun and barely glitchy but start with the puzzles\n\nHelpful | 0", "banjo_vrDec 18 at 1:44 PM\nMust have game at a good price\n\nAn illegally addictive game, super relaxing, the levels are fun and the sandbox mode is a great addition. If you have a quest, YOU MUST HAVE THIS GAME! Helped me relax after finishing all of my work and I whiled the hours away solving fun puzzles on my quest to relaxing music and the satisfaction of finally making a working contraption is incomparable. I would rate this a 6/5 if I could. Bravo!\n\nHelpful | 3", "LarryLizzardDec 12 at 7:18 AM\nTinker, tinkering , tinkered\n\nNot many games deserve 5 stars. This one has a natural learning curve, unlimited solutions & you can leave and come back to it again without skipping a beat. If you are patient and MacGyver-like, this game is for you. The creativity is its own reward. This is a very complete game and will only get better in 2020.\n\nHelpful | 5", "steve13870Dec 5 at 1:43 AM\nJust have fun\n\nWow what a game at a fantastic price ,did you like to build things as a child ,well now you can ,easy intuitive controls .you can construct till your hearts content ,build preset machines or just have a massive sandbox to build whatever you want ,so you can see the value ,you are only limited by your own imagination and trust me you will be building great contraptions before you know it ,i cannot reccomend this enough ,relax build and a great antidote from shooting things and hitting coloured blocks ,in a word FANTASTIC 5 out of 5\n\nHelpful | 2", "stst1300Jan 15 at 4:39 AM\nVery relaxing at the end of a busy day\n\nGood way to wind down. It would be nice to have to solutions after you finish just to see how it could have been done by the pros\n\nHelpful | 3", "GoldenBudzzz420Jan 18 at 3:41 PM\nAwesome but\n\nThe game is absolutely amazing but sandbox mode needs a start/reset button its so infuriating to have to reset and start everything manually with the movement controls please add!!!!\n\nHelpful | 2\nDeveloper ResponseJan 22 at 11:25 AM\n\nThe start/reset button is coming soon!", "ZapWap132Dec 11 at 3:15 PM\nIt's impressive!\n\nIt's still in beta, but that app right now is impressive! It's enjoyable to play and it has many different objects to use when you solve the puzzles. It has a vignette to prevent motion sickness when moving, and it is clear that the Devs are listening to reviewers and implementing new features. Hats off to the Devs for listening to feedback! I highly recommend it for anyone interested in a unique open-concept game. I hope even more levels are added in the future! I didn't check yet, but online multiplayer and the ability to create a pack of courses would be cool.\n\nHelpful | 2", "TastyZombieSnackDec 11 at 5:25 AM\nOne of the best games I have played\n\n...on the Quest. Simple, engaging, challenging, immediate replayability, and a great pick up and go game.\n\nI was on fire to complete the puzzles toward the end, I loved the way the story built and was revealed, and I dont mind admitting that the end scene made me cry because it was so beautiful.\n\nHelpful | 2", "martin.oconnor.543Dec 19 at 1:52 PM\nBrilliant -\n\nThis is definitely the best puzzle game for VR. The physics is brilliant, I like that you sometimes don't get the same result when you start the chain. I hope they follow up with more content in 2020. (I have suffered a few crashes but nothing major)\n\nHelpful | 2\nDeveloper ResponseDec 24 at 3:02 PM\n\nThanks for the kind words! A couple of big features will be coming in 2020. Stay tuned on /r/gadgeteergame!", "MajinpootOct 24 at 4:09 PM\nEasy but so brilliant\n\nI have been wanting to play this game for awhile after seeing it on PC. After finding out it was coming to quest I was floored and the release date could not come fast enough. I downloaded the game minutes after release and booted it up with excitement. I have made it to the 35 puzzle and it has been a blast. So fun placing blocks, ramps, and marbles to get to the next puzzle. 5 stars. This could be 6 stars if the team added the feature to play my own music. If that happened I would get lost in the game making crazy contraptions. Great Job to Developing team. I love it.\n\nHelpful | 13", "joebccApr 2 at 12:44 PM\nOne of my first VR purchases - hooked\n\nHats off to the team that built this \n\nVery fun, simple but well executed concept, that's engaging and will surely keep me coming back for more. Can't wait to see what additions the finished version brings to the table!\n\nHelpful | 0", "maxvectorDec 21 at 12:06 AM\nGreat potential, needs work\n\nThis will definitely end up being one of my go-to games, beautiful sunny environment, clean design, all the good stuff. The mechanics of the game is great and a whole lot of fun to play. Well worth buying.\n\nOn the downside, in the sandbox area, you can rip out the bathroom and make the lounge area warmer; a nice big dining room table to work at is kind of essential.\n\nTo build something really useful SNAPPING is a must have! In RecRoom you can snap blocks in place in mid air, learn from that; maybe you want realism but in the words of Morpheus: In the Matrix...some rules can be bent... others can be broken.\n\nThink about the end goal of the ball, where is this going? Why am I going to spend hours building something in a sandbox? Because I want to set off a rocket that flies out the window, or maybe I want to shoot a ball into a plastic cup across the room, or I wanna be Dude Perfect, yeah lets set off a paper plane with a rubber band and hit a swinging pendulum 20 feet away. Were going to need a warehouse, or just knock down the walls, I wanna roll a bowling ball off the friggin roof.\n\nHelpful | 1\nDeveloper ResponseDec 24 at 3:01 PM\n\nWe're glad you're enjoying the game! Track snapping is an upcoming feature and we'll be adding a new gadget to the inventory soon. We plan on adding more gadgets to a future version of Gadgeteer so people can build wackier machines.", "olivertt123Nov 12 at 4:37 AM\n\nA fantastic and relaxing game! I love it already. I had a few issues with it crashing but it worked again when I reopened and it saved all of my progress perfectly. I'm sure this will get ironed out in the future and it doesn't impact my enjoyment. Can't wait to see what else gets added in the future!\n\nHelpful | 3", "CyberFernFeb 16 at 5:14 PM\nNot a lot of content.\n\nI got this game and i liked it when i got it. Then later, the game got more boring. I requested a refund but Oculus doesn't care about my refund request, so they declined it. Now im stuck with this boring game.\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 1:26 PM\n\nI'm sorry you didn't enjoy our game. If the 60 levels wasn't interesting enough for you, we have online sharing coming soon where you can play levels that other people have created. That should provide endless fun.", "MarvelChic911Apr 30 at 2:47 AM\nImmediately Hooked!\n\nExcellent game! Immediately hooked.\n\nHelpful | 0", "NickdeturtleJan 8 at 10:48 PM\nGreat\n\nIt great and endless it is so much fun!\n\nHelpful | 4", "highjump1993Dec 29 at 11:27 AM\nGadgeteer\n\nThis is the perfect game for those who like to use their brains and move at their own pace.\n\nHelpful | 3", "Masaru.KatoOct 24 at 9:53 PM\nNeeds better graphics and online sharing\n\nPlayed the first 8 levels and the tutorial in about 40 mins and really enjoyed it. Smooth gameplay, good mechanics, and $15 to own your own puzzle building tool set is great value.\n\nBut having watched the trailer, I was expecting the overall graphics renderings to be a bit more polished, especially when you look at the buildings outside the windows. Online sharing/multiplayer would add tones of contents to the game. MP3 player to play your own music though not essential, would be a plus. Btw, is there a way to rename your profile? Will review my comment and rating after more game time and software update.\n\nHelpful | 7\nDeveloper ResponseOct 28 at 3:11 PM\n\nWe're happy to hear you're enjoying the game! The exterior graphics will be improved in the next updates. There's no way to rename your profile right now. Sorry :(", "tuismOct 24 at 3:58 PM\nFirst insta-buy\n\nI kept thinking, I wish there were good games on Quest that wasn't so physical. The physical games were great for the tetherless setup, but it didn't have to be limited to it.\n\nWhen I heard about Gadgeteer, I thought it fit that desire. Bought it within the first 40 minutes of release, and wasn't disappointed!\n\nIt really harkens to the TIM (The Incredible Machine) days. The control scheme is *perfect* and intuitive, and everything works really well. Works equally well playing seated or standing, which is great.\n\nThese only gripe I have (minor) is that the basic puzzles feels WAAAAY too easy lacked variety. I get that there a progression, but the curve seemed too gentle. But that's really not a big deal for most people.\n\nHyper cerebral relaxation on a platform that traditionally over-emphasises action and reactionary, is a welcome change of pace!\n\nHelpful | 5\nDeveloper ResponseOct 28 at 3:13 PM\n\nThanks for the feedback! Revising earlier levels to ramp up the difficulty faster is something we're hoping to do soon.", "StaticCloudNov 28 at 3:24 PM\nSimple but still Early Access\n\nAfter beating just 20 levels and playing around a little with the sandbox presets I can say this game gets a 4/5 from me. The only improvements I would say are to polish up the textures on models in the environments a bit (as some objects looked like they had blurry textures and low poly models) And to make a snap to grid sort of setting. I had lots of trouble when trying to make a small trebuchet that would stay in the right direction whenever I moved a block around it in the sandbox. But otherwise, it's understandable given the game is in early access and I will make sure to update my review when the game is finished.\n\nHelpful | 2", "PoodsterNov 28 at 10:03 AM\nLots of Fun\n\nThis is an awesome game! If you love puzzles, you'll love this game. There are loads of levels that get fairly challenging and will take you a fair bit. There will also be 20 more levels and online sharing in early 2020 which will make the game have endless playtime. There is also a sandbox mode to let your imagining run wild and create anything you want. It also runs smoothly and has good graphics.\n\nThere are a couple of things I wish were added in future updates. I wish there was a toggle to either have locomotion with the thumbstick or using the grip buttons. Right now you have to hold a grip button and move the thumbstick to use smooth locomotion, this isn't the greatest since moving your hand will move you along with the thumbstick and can cause brief motion sickness.\n\nEdit: in response to the dev's response, the issue is that the other technique is still active when doing smooth locomotion. So while doing smooth locomotion, even if I move my hand a little bit, I'll end up flinging myself and move where I don't want to move.\n\nAs well I hope the devs ad the ability to manipulate the objects with both hands instead of one.\n\nHelpful | 3\nDeveloper ResponseNov 22 at 12:09 AM\n\nHi Poodster, the second locomotion technique in Gadgeteer includes moving the controller(s) while holding the one or both grip buttons. Think of it like you're pulling yourself towards where you want to go! Hope that helps!", "teddelerNov 8 at 5:13 AM\nAwesome game!\n\nStarted playing this yesterday. Was just going to solve a couple of levels and found myself just having to try the next one. It is amazingly addictive. When I was young I loved the idea of pushing over dominoes but setting them up, picking them up, and resetting them was a pain so I didn't do it too much. This game satisfies this desire nicely while getting rid of the messy clean up. I look forward to many hours of gameplay.\n\nJust a couple of complaints/suggestions:\nThe game did glitch and have to be restarted several times while I was playing. Usually when a puzzle was just completed but not every time a puzzle was completed. Please fix.\nThe other thing is sometimes while trying to place a piece, the angle I was holding my hand at to get it into place became awkward. I had to put the piece down and then pick it up again to adjust it. I would have liked to be able to use my other hand to adjust how I was holding the piece, the way one naturally tries to. If there's a way to do that, I didn't find it.\n\nAgain, wonderful game with great potential. Definitely worth the purchase.\n\nHelpful | 5\nDeveloper ResponseNov 22 at 12:05 AM\n\nHi there, glad you're enjoying the game! Sorry about the glitches, we're investigating them as we go. Feel free to tell us details at support@metanautvr.com, thank you!", "Chris_StaceyNov 13 at 9:28 PM\nSo much fun... with physics!\n\nHeld off reviewing this game until I got further into it. This is excellent! It's a slower pace than most Quest titles, but that's a good thing. At the time of writing the game is still in beta, so inconsistencies are forgivable. I can ignore variances in the same way I can ignore a breeze through the lab changing how objects behave. Really looking forward to updated content.\n\nHelpful | 2", "RyOculus91Oct 24 at 3:43 PM\nExcellent game! Buy it!!!\n\nThe physics in this game are absolutely incredible! If youve ever wanted to build a marble run or wanted to build a domino chaser, if you like puzzles or even just fancy a game that doesnt make you feel exhausted but still challenges you mentally, this is it!\n\nImagine making a huge marble run and not having to pick things up when you knock them over, imagine not having to tidy up and having the space to do what you want. This is probably my favourite game so far!\n\nWell done to the devs on this one, the movement feels good and allows you to easily adjust the height that youre working at, the physics are perfect. Ive played for a while now and not had a single glitch or issue.\n\nHelpful | 3", "zack.slotkowskiJan 3 at 10:31 PM\nFun!\n\nSo relaxing and such a good game! I love it.\n\nHelpful | 3", "eccentric_jNov 24 at 4:15 PM\nLots of fun\n\nAfter a few months of only using the quest for work through Immersed VR I found myself interested in trying out some games. First, I tried Pistol Whip. It's fun, but it's not a game I love playing for long or on days where I need to destress. Today, I decided to try Gadgeteer. I'm about an hour or so into the game and I am having a blast, it's great playing puzzle games with creative problem-solving. It's very relaxing and the best part is due to the location controls it's easy to play from a sitting or standing position, which is critical given I don't really have 3x3 feet of space in my tiny apartment. The one feature I feel that this game is missing is the ability to quickly erase blocks. Currently, you have to hold up on the right control stick then push your hand into the vacuum tool then press the trigger on the block you want to erase. More often I find myself wanting to stay on the pliers or clone tool and either shake the controller, toss it over my shoulder, or press a button on a controller to remove it without having to switch tools. That said it's more of a quality of life improvement than a major concern but it would speed up the process of trying new solutions.\n\nHelpful | 2\nDeveloper ResponseNov 28 at 6:32 PM\n\nThe undo button may be helpful in this case! (Left direction on your non-dominant control stick) Let us know if that fits what you're looking for!", "Blu-Dec 17 at 8:46 PM\nAmazing\n\nI love this game\n\nHelpful | 3", "UDontHaveMyNameNov 25 at 6:01 PM\nVery neat!\n\nI am really enjoying the puzzles and I feel like this game was made just for me, I also appreciate the price point its sold at. Thank you for making this game!\n\nHelpful | 2", "General_MutleyNov 6 at 12:04 PM\nGets the brain working!\n\nThe more I have played this game the more I have begun to enjoy it. This might be down to me getting better at being able to use the tools too as the tutorial did not really explain things too clearly. Its a very relaxing game to play although the music does get a little repetitive.\n\nThe learning curve in terms of using the freeze tool and I do etc was not exactly simple. For me at least it was trial and error to work the freeze tool. This could be made simpler for users with a more obvious tutorial maybe broken down into sections for different tool types.\n\nMovement around the play area is very easy and intuitive. Thumbs up for their method here.\n\nThe edges of dominos etc are a little jagged. Im not sure if this is a quest limitation or just how it was programmed as Ive not seen these sorts of jagged edges in other games. But then again usually the games are moving at a faster pace than Gadgeteer so it may be that.\n\nA button to hold to snap align objects would be useful. Save a bit of messing around lining up tracks etc. But again this does not really detract too much from the gameplay - just a nice to have.\n\nOverall I think this is a great game that was priced just about right. I hope the developers are able to add some new environments and tools over time as that would really freshen it up long term (think mini rockets and cycling toy monkeys etc!!!!!).\n\nWell done on this title - great work.\n\nHelpful | 3", "TiniestChimpNov 8 at 2:26 PM\nNearly perfect\n\nFantastic game! Simply, fun, immersive and if you like chain reaction machines then theres nothing more to say. Get it!! Puzzle mode is intuitive and very challenging at times and equally as rewarding when you do figure it out. My only negative is in the sandbox mode there is no start/finish boxes. With this addition it would be perfect. Please add\n\nHelpful | 2\nDeveloper ResponseNov 22 at 12:05 AM\n\nStay tuned for our next Quest update! You might just find what you're looking for", "Pieface45Nov 9 at 6:30 AM\nI will raise but we need one thing first\n\nThis is a near perfect game except for the lack of a toggleable auto attach so u can like up your tracks and stuff evenly if you like and turn it off when you don't im 1/2 way through the puzzles and do not plan on returning so don't get that feeling but I would not hesitate to recommend this game to anyone if that was implemented EDIT hope it's good!\n\nHelpful | 1", "DreamerOOct 25 at 6:01 PM\nSparks the Imagination\n\nBrilliant concept! Cool puzzles!\nThe zany machines you can create in sandbox mode is limited only by your imagination & physics\n\nNotes to the Developers:\nPlease add visual snap rotation the the joystick on at least one of the hands, or possibly 180 if you can. The grip-drag-move controls are fine for small puzzles, but if the whole room is usable in sandbox mode there should be a way to look around a little easier.\n\nIf a co-op mode were possible in Gadgeteer it would be incredible\n\nHelpful | 8\nDeveloper ResponseOct 28 at 2:50 PM\n\nVisualizing the snap rotation is a great suggestion! We'll consider adding that to future updates. For quicker movement, have you tried using joystick / smooth locomotion? To activate it, hold down on the grip button and press the joystick in the direction you want to move in.", "FrenslevenNov 2 at 12:20 PM\nAmazing experience\n\nJust finished level 41, and Im really enjoying this game. The sense of accomplishment you feel after completing some of the more intricate levels is awesome and feels earned. I have had quite a few freezes, sometimes for just a few seconds (which is very nauseating), and sometimes exiting out of the game. Every 2 or 3 levels the screen will freeze, then go dark, the music keeps playing. I can quit back to the home screen, but then if i go back into the game, i get the 3 loading dots. Im sure theyll get the bugs ironed out in updates. A few suggestions:\nLet us play our own music from the device. Also, it would be cool to be able to go back to the first puzzle (or any puzzle) and watch the ball or dominoes fall from the beginning up to your current puzzle as one long path. Since they are all connected...\nRemovable toolkit would be a nice option, as well as a better way to spin or rotate the pieces without having to twist your hand into strange positions. Perhaps use the joystick when you are holding a piece.\n\nKeep up the great work, Im looking forward to seeing how this game develops.\n\nHelpful | 4", "sebastian.kurz.583Nov 8 at 11:01 PM\nLove it!\n\nAwesome experience, endless options. Incredibly immersive if your physical space match the virtual one. Usability and physics are awesome as well. Calming music which nicely fits the relaxing creative atmosphere. All pieces fall perfectly together, love this more and more the longer I play it now.\n\nSome further suggestions: Either enable a two handed mode where you can change objects with your non dominant hand as well (switch to construction plate e. G. With thumbstick up) or make the swap hands function easy available with one user action (either button press or touch both controller bases like in tilt brush). Intuitively I always want to use both hands, and you are not building only but also rearranging a lot.\n\nThis is really worth every penny. For the patient creative Explorer.\n\nHelpful | 0", "TaltoonNov 4 at 12:42 PM\nBrilliant, worth every penny!\n\nA charming casual game which is very well made in my opinion.\n\nI went through the first 20 puzzles in my first sitting (standing) and had a blast, actually found myself cheers at some points when I sovled it :D\n\n100% pleased with this game, lots of replayability and fun to be had in sandbox mode also!\n\nHelpful | 2", "rmccaffray96Nov 4 at 10:36 PM\nFantastic Laid-Back Game\n\nVery relaxing and soothing gameplay makes this puzzle/chain-reaction title oddly satisfying. Would recommend to anybody curious about these machines and puzzle games in general. Lost myself for an hour or two just completing the first set of puzzles. Very unique game in the store and I recommend it a lot!\n\nHelpful | 2", "Webguy20Oct 25 at 9:13 PM\nVery Fun, Easy to Learn\n\nA nice light hearted game with fairly intuitive controls. You can rotate and raise or lower the play area to get that exact right view. The physics seem right on and everything acted how it should if it were real.\n\nAs a bonus the Dev is active on reddit and is open about coming features and to constructive criticism. Real nice to see!\n\nHelpful | 7", "oli70Feb 10 at 10:29 AM\nnot something i like to do in vr\n\ngets boring\n\nHelpful | 0\nDeveloper ResponseFeb 20 at 1:27 PM\n\nI'm sorry you didn't enjoy our game. If the 60 levels wasn't interesting enough for you, we have online sharing coming soon where you can play levels that other people have created. That should provide endless fun.", "tatecgNov 14 at 8:09 AM\nFun, Physics, VR\n\nThis game is all the fun of making Rube Goldberg machines with none of the mess (or time suck resetting when you accidentally knock something over/out of place). Its a perfect use case for VR, although I would appreciate some additional graphical detail (even though thats not the focus of the game) just to enhance the realism/experience. It looks a little basic.\n\nHelpful | 3", "SMODomiteOct 30 at 9:25 AM\nThe Puzzle Game Quest was waiting for\n\nI had been waiting for a good puzzle game since Quest came out and I got it with Gadgeteer. I have always been pretty fascinated by Rube Goldberg machines and being able to complete them in VR has been a blast. Only through 30 puzzle and can't wait to play more, this game is definitely worth the money\n\nHelpful | 3", "TomanoleOct 31 at 12:32 PM\nJust about perfect\n\nEdit: Updated to 4 stars. This game is great, even with its current flaws, and they are getting rid of the dogs barking next week.\n\nEdit 2: Updated to 5 stars. Doggonnit! These guys are good! Improved locomotion is great. They are working on glitches, and are adding machine sharing soon.\n\nI have really been looking forward to this game coming out, as I have loved Rube Goldberg machines since I was a child. This game brings me back to the times of setting up dominoes and balls and ramps and setting it into motion, for no reason whatsoever, except to see if it works.\n\nThat being said, the game could be almost perfect except for a few minor details. First, it occasionally freezes. I'm sure they will work this out, and probably why it still says \"Early Access\" when loading.\n\nNext, the music gets old quickly. An option to play songs from my storage would be great. It's one of the things that makes me love Real VR Fishing so much.\n\nAlso, if you turn the music off, you hear the neighbors dogs barking in the background. What?!? Really?\n\nFinally, it should be easier to lock pieces into place that normally fit together like ramps and such.\n\nGet rid of the dogs, and it's easily a 4 star game. Add mp3 player for 5 stars, imo.\n\nHelpful | 2", "JimBatmanNov 2 at 8:20 PM\nExcellent game but....\n\nExtremely glitchy. I had to open another profile because the game wouldn't let me proceed in the puzzle section. This game is extremely complex with many different types of moving parts so I would expect it to be a little buggy. I've had to restart a few times because of the game freezing.\nStill this is a solid 5* game. There is simply no other physics problem solving game like this one. I simply love it. So realistic that the components don't always interact the exact same way! I'm hopeful they'll add more puzzles in the future.\nUpdate: They fixed being able to progress after beating a puzzle, so great job with that! The game still freezes though... multiple times doing the last few puzzles. I'm sticking with 5* though, it's still huge fun.\n\nHelpful | 3", "SamaritanManOct 31 at 11:34 AM\n\nVr, is a dream come true for so many people.\nGadgeteer is a dream inside that dream: virtual rooms where you can do so many funny and so intresting things, playing with physics in infinite ways.\nIn reality it would not have been possible to set up a similar scenario to have fun this way, unless you are a millionaire and you have great environments to use for this.\nGreat job devs and great price!\nP.S: i would advice to do some little improvement to the physics and to the realism of the game, specifically to the ball bounce and general physics behaviour, some richer texture, but i repeat: this game is awesome and for the price is incredible.\n\nHelpful | 2", "stachowiOct 25 at 10:09 AM\nAlmost perfect\n\nOk, my second critique is my fault, they do have a great way to move around with the joystick.\n\nAnother suggestion for the dev... add haptic feedback when starting experiment (the same way the button works during first steps demo) and when locking in tools (this will add to the immersion imo)\n\nWhat a beautiful and ingenious VR game... I have two suggestions to the dev: 1) vacuum is cool, but allow someone to put the part back if the grabbed it by mistake (keep the vacuum too) 2) give option to move with grip (check out red matter bc they use the same controller concept), got a little motion sickness\n\nOtherwise it exceeded my already high expectations!\n\nHelpful | 5\nDeveloper ResponseOct 24 at 2:47 PM\n\nThanks for the kind words! Putting gadgets back into the library is something we'll be working on. Have you tried joystick movement or turning off the vignette? The vignette settings can be found in the settings. Joystick movement is available by holding down the grip buttons and moving the joystick. Let us know if this resolves it for you.", "hargisssOct 31 at 10:54 AM\nBrilliant!\n\nRemember how you played when you were a kid. What were you concerned with? What things meant? Did you play with action figures, spinning elaborate stories? How things looked? Did you paint, draw, build models to look like real things and places? Or was it how things worked - the cars really had to move, the LEGO gears really had to interlock, it wasn't enough for your toys to look beautiful, they had to do something beautiful as well. If like me you fall into the latter category, buy this immediately. Otherwise, consider it - it's a fantastic VR construction set, no cleanup necessary, no parts for you and your friends to step on.\n\nHelpful | 1", "stevejordan1stOct 27 at 8:19 PM\nAwesome game with insane amount of level\n\nLet me start with saying I love this game! I haven't written a lot of reviews but this game has potentially infinite levels once they get it updated. I heard they are planning on sharing of levels with other users. This will add unlimited levels basically as we can just make levels for each other. Thank you to the developers for porting this game over and I can't wait to see what you guys add with the next update. I have already invested numerous hours in this game in the last couple days! You guys rock!\n\nHelpful | 3\nDeveloper ResponseOct 28 at 2:34 PM\n\nThank YOU for supporting our game!", "aNigerianPrinceOct 30 at 6:21 AM\nStunning\n\nOnly played this for a short bit of time, but can already tell it's an amazingly well polished game. The controls are better than anything else I've played so far, with switching attachments being the most satisfying VR mechanic I've tried. Haven't finished all the puzzles but with the sandbox mode the replayability is practically limitless\n\nHelpful | 2", "GoonertuxDec 6 at 6:31 PM\nBrilliant\n\nIf your getting a Quest for your kids and it's Thier first VR experience then this should be Thier first game\n\nHelpful | 2", "MacAndSneezeDec 16 at 6:34 PM\nSuper fun, but so many crashes\n\nSeems to crash every 3-4 minutes, haven't been able to consistently reproduce. Just goes to a black screen, can still hear actions, bummer.\n\nHelpful | 0\nDeveloper ResponseDec 24 at 3:04 PM\n\nSorry! These crashes are caused by a firmware issue that will be patched out soon by the Oculus Quest hardware team.", "Zimtok5Oct 29 at 5:04 PM\nZIM hates puzzles\n\nSuits Quest so well. Performs excellently with intricate movements. Controls are easy. Tutorial is clean and gets you puzzling fast. I have to say I like puzzles now. Did the first 25 puzzles in one sitting; hooked me straight away.\n\nHelpful | 2\nDeveloper ResponseOct 29 at 5:35 PM\n\nLevels get more challenging and fun after the first ~20 levels. Have fun :)", "bryanloOct 27 at 12:14 PM\nFun ,smart and good value game \n\nGood work to the development team. I enjoy this game very much.\nThis is a happy game to play for everyone.\nSuggestion, at the end of each puzzle, should show difference animation out of the end box , for example flowers , balloons , fire work or colorful animation after you solve the puzzle . This is going to put a smile to your face.\nIn the sandbox mode , can the player create differences end box animation by the player.\nPlease keep up the good work because gamers will buy this fun game.\n\nHelpful | 2\nDeveloper ResponseOct 28 at 2:41 PM\n\nA variety of celebrations will be fun! We have a list of these celebrations already but we'd like to prioritize our time on adding some much requested features first like online sharing of machines. We'll get back to working on these celebratory events later on.", "VOYREOct 25 at 1:51 PM\nPossibly the best game on the quest??\n\nThis game reminded me of one of my favorite games growing up the Incredible Machine. Its super fun, challenging and easy to hand over to someone new to VR. I think I got addicted to it. Currently 40 puzzles deep and cant wait to finish it and play in the sandbox mode.\n\nHelpful | 3", "BookerBotNov 11 at 5:46 PM\nVery Fun\n\nGadgeteer has many puzzles to keep you playing and a sandbox mode which lets you build any machine you want. There are many puzzles as I have seen and I havent even competed them all. Great game overall\n\nHelpful | 1", "wildBcatNov 2 at 7:28 PM\nAmazing!\n\nLoads of fun! I like the physics of it, and they almost thought of all things. The only thing Id love to see is the ability to have to interactive controllers, instead of just switching. My kid found the Easter egg button in the drawer.\n\nHelpful | 2", "Nano27890Oct 24 at 10:35 AM\nAwesome must have!\n\nI have been waiting since this had come to the store. I instantly bought it when it came out and have been playing it. EXTREMELY fun and addictive to play. The controls can take a little getting used to. But I would 100% recommend it. Now I'll be getting back to playing. \n\nHelpful | 2", "anbokkusuNov 2 at 4:32 AM\nReally fun time out\n\nI enjoy playing this as a break from my busy day, Am hopping multiplayer becomes a thing where you and your kid build sandbox fun. perhaps a vr chat like experience with physics\n\nHelpful | 2", "Pandapan6766Dec 27 at 10:25 AM\nVary Fun\n\nVary Fun\n\nHelpful | 2", "Auld_PharrrtOct 29 at 11:59 AM\nMore addictive than I really expected\n\nI saw someone's video of one of the early puzzles on this and I quite fancied giving it a go. I truly didn't expect it so be so addictive, but I have been having a bit of an annoying issue with the game, my Quest screen freezes after every 3 or 4 \"levels\" and I have to re-start the game.\n\nOnce they sort that wee bug out, I think I'd give it 5 stars, I like the idea that we can build our own \"puzzles\" then apparently we can invite our friends to solve them ... At least, I *THINK* we can do this, I've only been playing it for an hour or so.\n\nHelpful | 2\nDeveloper ResponseOct 29 at 5:36 PM\n\nWe're currently investigating the issue and will try to fix the crash bug ASAP!", "robgirardNov 14 at 7:13 AM\nAwesome!\n\nReal physics, lots of fun for the creatively inclined. And best of all, when you knock all your stuff down by accident, hit undo. Take that, real life!!!\n\nHelpful | 2", "CaptainFrostOct 30 at 10:41 PM\nSuper fun game!\n\nI have been playing this game a fair bit, and have really enjoyed. I would say I'm biased: between having played the incredible toon machine as a kid to playing around with other physics-based games as well as enjoying puzzle games in general, it's fun! The music is calming and adds a nice ambience and the mechanics of the pieces seems to be good and function as expected. Be aware that due to the limitations of the game engine, pieces will behave randomly at times. However, from what I've experienced it appears that the variations when running the machines are predictable and realistic, so it actually helps in my opinion with the immersion.\n\nThe only thing I'm really not fond of is not being able to use both hands for manipulating pieces--I'd imagine maybe it could be possible for the inventory to be an attachment just like on the other hand? Sometimes you really have to contort your hand to place pieces down or set the piece down and pick it up again. If the interaction with objects were improved, my review would totally be 5 stars because an interface that feels natural is important to me in a game like this, and currently I feel it's leaving that a little bit.\n\nThanks devs for a really fun game!\n\nHelpful | 1", "RicePersonOct 29 at 10:22 AM\nOh so satisfying\n\nThis game pushes all of my buttons. It has them good dominos, marbles, and some (annoying) skinny things. I have some nit-picky things though (But Ill give this game a pass because it is in early access). The tools can be annoying sometimes, the vacuum especially. The sandbox needs some improvements (like a reset and starter boxes like in the puzzle mode). But otherwise, this game is great. It has plenty of levels, and you can go wild in the sandbox.\n\nHelpful | 1\nDeveloper ResponseOct 29 at 5:38 PM\n\nCan you elaborate on why the vacuum tool is annoying for you? Start Cubes will be available in sandbox mode very soon! With them, you'll be able to remote start and restart your machine more easily.", "BwadejsOct 24 at 12:22 PM\nLovely chill out game\n\nLove the game. Its a perfect vr concept and it's been carried out really well by having the clone tools and the freeze button. I've only played for a bit so far but really enjoy it and I know I will keep playing it and it'll be well worth having for myself and friends alike.\nI would like to note that I can't get past puzzle 14 as the game has crashed while I was placing blocks 3 times now. My quest is not on the newest update and maybe that's why? Hopefully it's a quick easy fix whatever the issue.\n\nHelpful | 3\nDeveloper ResponseOct 24 at 2:46 PM\n\nOh no! Crashes shouldn't be happening. Can you email us at support@metanautvr.com so we can resolve this with you? Thanks.", "ReBornTheFirstOct 26 at 1:42 AM\nAmazing!\n\nIf you have enough space and are able to walk around, it feels amazing. The tools to interact are simple and perfect for what they have to do. The physics feel right. The only thing that's a little annoying is the inventory. If you could \"undock\" the inventory from the controller and just place it somewhere in the environment, it would be much easier to pick the pieces you need. Oh.. And more level ;)\n\nHelpful | 2\nDeveloper ResponseOct 28 at 2:48 PM\n\nOnce we have online sharing, players will be able to create and share their levels. You'll have an INFINITE amount of levels very soon :) That's a good suggestion. We'll consider making the panel detachable in the future.", "mrj42093Nov 16 at 8:24 PM\namazing\n\nthis is my all time best vr experience and so much fun. I really hope they add more in later updates this is hours of fun\n\nHelpful | 2", "ZoxerisOct 28 at 3:33 PM\nPromising\n\nThis game immediately reminded me of the incredible machine, and I expect it to be absolutely amazing. It's beta release and they're still working out the kinks, give it time. Movement needs work and there's a pretty frequent screen freezing bug. But there's a lot of potential in this game if they can get it all running smoothly.\n\nHelpful | 3\nDeveloper ResponseOct 30 at 12:06 PM\n\nHi Zoxeris, We were also inspired by the Incredible Machine! Do you have any details to share about the screen freezing bug? We'd love to know when that happens. Feel free to get in touch with us at support@metanautvr.com, thanks!", "MoltastroOct 25 at 11:04 AM\nFatastic game, but missing one thing\n\nI have always loved Rube Goldberg machines and thats why I were super exited when this came out. Ive played this kind of games before, but the thought of playing it in VR got me really exited and thankfully my hopes were met.\n\nThe only thing I miss is a mechanic that a lot of these games have and thats the ability to snap pieces to each other as it really saves you the hassle of trying fanatically to make two pieces fit together. Now I know developing a mechanic like this so that it works in a good way is hard, but as Ive said Ive seen a lot of other games do this and it really helps. If you were to consider this feature, my tip is to make it toggle-able so that it wont stick to unintended pieces together\n\nHelpful | 1\nDeveloper ResponseOct 28 at 3:02 PM\n\nWe're working on a feature where players can snap together track gadgets. However, gadget-to-gadget snapping for every gadget is a big feature with lots of complications. A game like Gadgeteer needs to have absolutely the best physics simulation possible and so it'll take us longer to develop this feature. Thank you for your suggestions!", "teziOct 26 at 6:57 AM\nAmazing\n\nBrings me back to playing domino rally but this is so much more fun, so many awesome things including sandbox, just spent hours and hours playing this game and it's very relaxing and great fun to play. Would recommend to one and all.\n\nHelpful | 0", "Arthands_VRNov 3 at 7:46 PM\nGreat puzzle vr title\n\nIt's a great and entertaining title which reward creativity. So far I am 20+ puzzles in. Hope to see more contents\n\nHelpful | 2", "meatymarleyNov 16 at 7:50 AM\nGreat game\n\nIts a great game if you love puzzles and having to use your brain I played it for hours\nI\n\nHelpful | 2", "Rising_ZeusOct 27 at 9:15 AM\nEarn Brain XP\n\nStretch your imagination and brainpower in this fun and perplexing game. Super relaxing as well. No pressure at all. Lengthy campaign puzzles. Incredible sandbox mode. Looking forward to future content.\n\nHelpful | 2", "RadicalEdward_WyrdNov 22 at 11:46 PM\nPretty Good / occasional freeze\n\nIt's still listed as early access.\n\nThere's hours worth of puzzle building available.\n\nThe only downer is sometimes it freezes, and I have to press the Oculus menu button to get it back.\n\nBut on the plus side, it saves your progress so you don't lose anything there.\n\nHelpful | 0\nDeveloper ResponseNov 25 at 10:21 AM\n\nGlad to hear you're enjoying the game! Where in the game is freezing occurring? We would love to hear details at support@metanautvr.com, thanks!", "andrew_vrOct 26 at 4:04 AM\nFantastic game\n\nExtremely cheap, completely absorbing and the thrill of solving a puzzle by doing something stupid is amazing. One of the best games on the Quest for replayability I would say.\n\nHelpful | 4\nDeveloper ResponseOct 28 at 2:46 PM\n\nReplayability is what we're aiming for. Glad you're enjoying it :)", "Gondar1Oct 24 at 11:42 PM\nFamily friendly fun\n\nExcellent! A game that is fun for everyone without blood and gore, perfect for the whole family. Works brilliantly on the Quest and the best part is that it has a sandbox mode. The sandbox mode make it never ending fun.\n\nHelpful | 2", "BungoBoiNov 2 at 10:35 PM\nFun but Unrelyable\n\nI had so much fun messing around and beating levels in this game but it has already crashed 3 times in the first 30 minutes I have played it. I hope this gets fixed soon so I can have uninterrupted fun in this amazing game.\n\nHelpful | 1\nDeveloper ResponseNov 5 at 12:15 AM\n\nHi BungoBoi, investigating crashes is on the top of our list right now! We would love to hear details about when the crashes are happening. Feel free to get in touch with us at support@metanautvr.com, thank you!", "sean.boguniaOct 26 at 4:43 PM\nSeriously awesome!!\n\nI cant stop playing this game sooooo cool!!\nIts a creative persons dream!\nThe physics seem very accurate.\nMy favorite game I have purchased for the quest so far.\n\nHelpful | 3", "paulohotlineOct 24 at 11:12 AM\nTake my money now! This game is awesome!\n\nIt will hopefully keep me busy on my bus ride to Regina Saskatchewan as I go see the Winnipeg Jets play the Calgary Flames outdoors in -2 weather! Hopefully the NHL allows me to enter with the Quest on my head to keep it warm :) 9/10 Laine Bobble Heads.\n\nHelpful | 1", "goosepork24Oct 24 at 11:34 AM\nVery addictive!\n\nThis game is extremely fun, relaxing, genius, and addictive. Why play dominoes in real life when you could play this... with an undo button!\n\nOverall such an awesome game. Well done.\n\nHelpful | 2", "ReflectoOct 28 at 11:17 PM\n\nThis brings me back to being a kid! I use to set up traps with my dominos, pots and pans, marbles etc to capture my favorite hero toy! I cant wait to play the sandbox mode.\n\nHelpful | 0", "jbcavemanNov 7 at 8:46 AM\nOne of the best games in the store\n\nDelightful fun building and rebuilding. Quite a unique experience that you just can't get anywhere but VR!\n\nHelpful | 2", "willthewizarddNov 20 at 12:31 PM\nI love it\n\ngreat physics, cool puzzles, no bugs :)\n\nHelpful | 2", "MeowformebabyOct 27 at 6:34 AM\nAwesome!\n\nIve only played 5 levels but its amazing so far. I havent experienced any glitches and it actually runs really smooth and the controls are very intuitive\n\nHelpful | 1", "chris.bro.585Oct 24 at 12:34 PM\nAddicting!\n\nSimple at first but gets fun the more you go. Has a weird bug that turns you a little as move through the room. Can't wait to open the next door.\n\nHelpful | 3\nDeveloper ResponseOct 24 at 2:45 PM\n\nOur next patch will resolve this issue.", "fannaruto064Nov 5 at 10:32 AM\n\nOne of the best games I have ever played on my quest please keep supporting this great game.\n\nHelpful | 2", "jda996Nov 14 at 9:55 PM\nJust great\n\nRelaxing, fun, and easy to play anywhere!\n\nHelpful | 2", "verdemanOct 24 at 3:07 PM\nSimple and endless fun\n\nThis is pretty ingenious, frankly. I have barely scratched the surface here and I can tell I will get so many hours out of it!\n\nHelpful | 1", "nick.spence.71404Oct 30 at 6:15 AM\nGreat game\n\nI enjoy playing your game and it has a very interesting design.i would like to see the game go multiplayer and add some more gadgets but overall the game is fun and addictive\n\nHelpful | 1", "IsliandraOct 29 at 4:34 AM\nFun but need another movement method\n\nI love the concept and playing it is great except for the movement. The pulling and even the joystick moving makes me sick. It would be great if a teleportation option was added. Also the game glitches a lot and sends me up above everything. I am trying to decide if I can keep this game, but getting sick in VR is not my idea of fun.\nEdit: i have tried with and without Vignette no improvement\n\nHelpful | 1\nDeveloper ResponseOct 28 at 2:44 PM\n\nSorry that you're experiencing sim sickness! Have you tried turning on comfort options in the settings panel? Look for \"Vignette\" and make sure that setting is turned on.", "FlodahahnNov 1 at 12:31 PM\nCrazy!\n\nExtremely nice immersive experience, mind blowing.!\n\nHelpful | 2", "H20Killer27Oct 30 at 9:31 PM\nIf I could give it more stars i would\n\nThis is a great game for people that love puzzle games\n\nHelpful | 2", "Tylers_CornerOct 28 at 2:20 PM\nAwesome but...\n\nThis game is awesome but I wish I could change the dominos color in sandbox mode to make pictures when they fall down. Please try this.\n\nHelpful | 1\nDeveloper ResponseOct 28 at 2:33 PM\n\nA color changing tool is coming soon!", "DungewarNov 1 at 11:31 PM\nCool game\n\nIt has everything puzzle game needs, but the only thing is that it is hard to place things straight.\n\nHelpful | 2\nDeveloper ResponseNov 5 at 12:11 AM\n\nEchoing a previous reply for another player, we're working on a feature where players can snap together track gadgets. However, gadget-to-gadget snapping for every gadget is a big feature with lots of complications. A game like Gadgeteer needs to have absolutely the best physics simulation possible and so it'll take us longer to develop this feature. Thanks for the review!", "SomeNolanNov 2 at 5:41 PM\nBest game ever\n\nI love it.\nby Princess Lobster Bottoms\n\nHelpful | 1", "ThatCodingKidNov 13 at 5:58 PM\nLag glitch\n\nI love the game, but within a minute of entering sandbox mode, the FPS drops to around 0.5 and I cant move or do anything at all. If this was fixed, I would rate it 5 stars.\n\nHelpful | 0\nDeveloper ResponseNov 22 at 12:02 AM\n\nHi there, investigating crashes is on the top of our list right now! Feel free to tell us glitch details at support@metanautvr.com, thank you!", "Kobi_KobiashiOct 26 at 12:14 PM\nThis is why I love VR\n\nEasily one of my fav games on Quest. So. Fun. Lots of replay value\n\nHelpful | 1", "Jochends1988Oct 25 at 1:23 PM\nDoes everything it was made for!\n\nPerfectly made! Love the design and details they gave this. 5 stars\n\nHelpful | 1", "baspoonerOct 26 at 2:59 PM\nSo satisfying\n\nJust prefect problem solving, but anyway you want, do it your own way\n\nHelpful | 0", "Lucasw805Nov 2 at 12:24 PM\nGreat game\n\nI love it.\n\nHelpful | 1", "ledheadroxOct 26 at 4:44 AM\nREALLY FUN\n\nThe physics are incredible!!!\n\nHelpful | 3", "kasket22Nov 2 at 8:36 PM\nGood game\n\nIt's a crappy game\n\nHelpful | 0", "xk.cryptoNov 4 at 5:36 PM\n\n\nXKtm\n\nHelpful | 0", "nightowl8Nov 3 at 7:11 PM\nWhy cant I play this sitting down?\n\nGot bored during the tutorial. It shouldve been set up to let you use sitting on the floor and you just have a bunch of games to choose from and you can click on which one you want and play them. What a waste of $15.\n\nHelpful | 2\nDeveloper ResponseNov 6 at 3:00 PM\n\nTry using locomotion to drag yourself to whichever height or angle you prefer to support a seated experience! We hope this helps.", "spacetyler98Oct 24 at 8:38 PM\nMore props please\n\nLove the game but need more props\n\nHelpful | 1\nDeveloper ResponseOct 28 at 3:11 PM\n\nMore gadgets are coming!", "TidyWhiteeOct 26 at 2:32 PM\nEarly access 4 stars so far keep it up\n\nDope\n\nHelpful | 0", "DAX_QcOct 24 at 4:04 PM\nAwesome\n\nNorhing else\n\nHelpful | 0", "danocherisonNov 3 at 9:43 PM\nThe perfect game for Rube Goldberg fans!\n\nTheres enough depth in this game to keep you entertained for months. Definitely worth the price!\n\nHelpful | 3"]