{"App Title": "Ghost Giant", "App description": "As the Ghost Giant, you are the protector of the lonely little boy Louis, whos in dire need of a helping hand. Build trust with Louis by helping him overcome big - or even gigantic - obstacles. Discover Louis' world, meet its eccentric inhabitants and experience a heartwarming, and sometimes heartbreaking, story.\n\n- Step into Louis' world and break the wall between protagonist and player in a highly immersive VR story.\n- Maneuver a unique diorama world by opening roofs, grabbing cars or rotating a whole house! While youre at it - why not use a crane as a huge fishing rod?\n- Explore the cozy miniature village of Sancourt and help its citizens with all their quirky problems by using your strength and wits.\n- Experience a heartfelt adventure about friendship and courage, written by internationally acclaimed writer Sara B. Elfgren.", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Casual, Narrative", "Languages": "English", "Version": "1.0.32", "Developer": "Zoink Games", "Publisher": "Zoink Games", "Website": "https://ghostgiant.zoinkgames.com/", "Release Date": "February 20, 2020", "Developer Privacy Policy": "None", "Space Required": "1.96 GB"}



["5 stars\n70%\n4 stars\n14%\n3 stars\n7%\n2 stars\n5%\n1 star\n5%", "BearButton4 days ago\nAn absolute must-play.\n\nThis game gets full marks on every level. Story, voice acting, graphics, music and gameplay all worked together elegantly to make this game an unforgettable experience. I'm emotional at default, but this game still hit me harder than I have been in a long time. My quest is still wet with tears. To anyone who enjoys puzzle games and story-driven games, do yourself a favor and do not pass up on this one.\n\nHelpful | 6", "Alexl3422 days ago\nMasterpiece\n\nThis game is incredible. The story is one of the best Ive ever seen, the environments are insanely detailed, and the characters are the most charming Ive ever seen. This game is one of the most immersive Ive played. You bond with the characters as you help them overcome problems. While the gameplay alone is subpar, the incredible environments and heartbreaking storyline make up for it. This games story made me cry. It was clearly written by someone who knows what theyre doing. It just stands out from so many other VR games like Beat Saber or SUPERHOT. And I have to mention the soundtrack. I can listen to it for days and still love it. You have to play this game yourself to truly experience it. Its a 4 hour journey that will make you laugh and cry with every scene. Absolute must have for any Quest user.\n\nHelpful | 1", "lilhomienickMay 22 at 5:23 AM\nAmazing storyline\n\nThe mechanics of the game were great, very intuitive and unique. You literally manipulate the landscape and buildings to interact with the story characters, as well as looking for quest objects and Easter eggs. But the best part of this game is the writing and character development. It's a fairly short game and can be completed in just a few hours. But the writing and story telling was more than enough to get me heavily invested in the main character early on and throughout the game. I wouldn't say it's a game great to replay, but I'm sure in a few months I will be excited to play it again, and I have a few friends who want to play through it when they come over as well. Would definitely recommend this game.\n\nHelpful | 50", "IMoveCarJul 26 at 9:27 AM\nBeautiful\n\nA beautiful game from start to finish (around 3 hours). I loved seeing the surprisingly poignant story unfold and enjoyed the game mechanics. It was fun trying to find everything and help the main character. One of the best looking games on the Quest.\n\nHelpful | 3", "ncrfaxMay 26 at 11:03 PM\nVery cute and enjoyable!\n\nA lot about this game is enjoyable. It's fun to look around, the music is nice, the voices and characters are cute and expressive, and the story is something I am glad to have experienced.\n\nBut I don't think this would be worth the price for some people. It is quite a quick game to complete, and I tried my best to take my time and pace myself as to not run through it. But there wasn't much to do or solve. I wished there were more to do in every chapter.\n\nI also think, as wonderful as the graphics were, that it could had been sharper and clearer. Possibly brighter and more vivid.\n\nOverall, if you're hesitant on getting this game or not, I say get it if you're looking for an experience and something chill. If you're looking for an intense game with puzzles and stuff to do, this may not be for you.\n\nHelpful | 20", "PEBBLCLAPPJun 20 at 8:45 PM\nSuch an amazing game\n\nFor starters, i am a very emotional male teenager who is depressed. When i was going through reddit, I saw it and thought it looked fun. I got it and I was in awe about how good it looked. I played through it today and I broke down in tears several times. I wish that I could have the same experience as my first. But i am so glad that I played this. I'm just in awe\n\nHelpful | 6", "kristyprcJul 4 at 9:20 PM\nFun game with a story that resonates\n\nWhat an adventure I have just finished. Im not going to lie, I spent a significant amount of time on YouTube for the walkthrough. Its only my second Oculus game, so thats probably why. The game play is pretty intuitive, but I still got hung up. There wasnt any hint buttons or assists that I found. Even still I really enjoyed it. The world is quirky and fun. The mini games are not too difficult, but like I said, I did get stuck here and there. Theres no beginning where you left off. You must begin the entire scene again and that annoyed me, but not enough to not adore the game. Id buy it again in a heart beat.\n\nHelpful | 2", "awarth22Jun 28 at 8:48 PM\nAbsolutely Incredible .. but..\n\nGraphics A+\nPuzzles A+\nCharacter Development A+\nStory Telling A+\nSo whats the problem? Too deep. Straight up too deep for this girl to fully enjoy. Hit too close to home and if i wanted a dose of REALITY REALITY, Id save the money spent on VIRTUAL REALITY games and just call my mom. Its a very beautiful well done game. I just dont like feeling bummed after i solve a puzzle.\n\nHelpful | 2", "kmalik7864 days ago\nI CAN NOT START THE GAME!!!!!!!!!!!!!!!!\n\nHi Developer,\nI recently purchased this game and can't even start the game.\nI'm stuck in the serup \"MENU\"!!!!. The game intructs to press \"menu\" button to pause to continue the game, but when I press this button it switches back on the Quest screen. When I press \"Resume\" it go back in the game and ask to press \"menu\" button again. I have also unistall and re-install this game numerous times but no luck.\nI'M STUCK!!!!!!!. PLEASE HLELP!!!!!!!!!!!!!!!!.\n\nHelpful | 1", "mjeremy.millerMay 16 at 10:04 AM\nBest VR game ever\n\nSo when I first got this game and saw it wasn't too long, about 4-5 hours, I didn't think too much of it because that isn't that long but I got it anyways because I was surprised by how well the voice acting sounded and boy did I do the right thing! The story is amazing, also the story is flawless. But the best thing are the puzzles. They are pretty easy at the beginning but start ramping up at the end and take a lot more time. Over all, try it out. :)\n\nHelpful | 10", "kaiwan.kJun 25 at 1:32 AM\nI cannot even start the game.\n\nHi developer, it's ridiculous and I felt I am stupid. I still stuck in the setup menu! The game instructs to press \"menu\" button to continue but on the Quest when you press that button it will switch back to Quest home screen! Or if you press longer it will re-center the view... Then, please tell me how can I press the menu button properly. Thank you.\nI will come back to review the game if I can get into it...\n\nHelpful | 7", "PoodlePupJul 7 at 1:40 AM\nSuch a cute game!\n\nA very creative storyline and it's so fun to help the character through his world. I really like that the important parts of the plot were highlighted to help make the story easy to follow!\n\nHelpful | 0", "AllegroCorn614Jul 5 at 10:37 AM\nWhat can I say except beautiful\n\nThe story flows wonderfully and the characters are well thought out and are portrayed perfectly. The game is visually stunning and the art style that is used fits so well with the concept and story.\n\nHelpful | 1", "TimNikiasJul 3 at 6:45 AM\nUnplayably buggy\n\nSound placement is more often wrong than in the correct location, and quite frequently speech is suddenly very quiet, sometimes even too quiet to hear properly with all the other sounds or music around.\nSame applies to overall placement of the scenery. Every area starts with a small title, which turns to dust and guides you where to look. It's annoying and weird that this title text isn't directly in front of me.\n\nInteraction is really weird, the tip of the finger is where interaction is registered, even if I would obviously grab something with my palm. In Scene 1, I frequently get water noises as if my hands go in and out of the pond, even when they're both fully submerged and I'm not moving. Physics just don't work properly, so forget about throwing the Basketball.\n\nWhile Artwork and Models look really great, the mentioned issues really detract and annoy, and break immersion quite a lot, as I'm always reminded that intuitive interaction and cohesive sound design (placement and volume) seem to be something this game truly lacks. It seems littered with Bugs and is thus no fun and not worth the money. I tried getting refund, but it seems I took longer than 2 hours while googling how this game wants me to interact with stuff. Tried playing the game (paid for it, so might as well play it through) but the Bugs and issues are just too much.\n\nWhen Sound is always coming from the wrong place and Interaction is as buggy as it is here, I'd really like to give 0 Stars and get my money back.\n\nHelpful | 4", "Get_To_Da_Choppa_VRFeb 21 at 1:47 AM\nIM NOT CRYING! YOURE CRYING!\n\nI will admit, I am a bit of an emotional dude but no game has ever moved me in quite the way that Ghost Giant did.\n\nThe game oozes charm and character with a story that takes you through lots of ups and downs that will have you laughing with pure joy one minute and choking back the tears the next! (Im not crying, its just been raining on my face!)\n\nThe gameplay is simple but actually a lot of fun, with yo interacting with the world around you in lots of different and entertaining ways to solve puzzles and progress the story.\n\nThe Art design is stunning, the music is beautiful and the emotional journey this takes you on, left me with one of the most powerful gaming experiences I have ever had.\n\nHelpful | 463", "ViviPresaJul 7 at 3:20 PM\nBeautiful game, but it has its glitches\n\nI love the game, its very thoughtful, however there are significant glitches, I have to play on the top of my bed to be able to play and have a good view of the game. Also, they should have a way to skip the taking since I have been trying to figure out to pass the scenes so many times. Many times I cant see any instructions for the next step. Overall I am in love. I hope they fix it\n\nHelpful | 0", "DivconMay 15 at 2:34 PM\nBeautiful, but with faults\n\nThe storyline is both clever and touching and the locations are beautifully designed. The user interface, however, is a bit clumsy at times.\n\nThe main problem we found, however, is that there are occasions when you have to blow in the microphone to continue past an object or complete a scene. You cannot do this on a Quest while casting to a TV because in casting mode the Quest switches off the microphone.\n\nIf you stop casting and return to the game the microphone is still not enabled. You have to completely quit out of the game, switch off casting and re-launch the game for the microphone to work again. This restarts the scene from the beginning. Some scenes are quite long, requiring many actions to complete and it seems the \"blow in the microphone\" one is always last!\n\nThis happens a number of times and is very frustrating if two of you wish to share the game with one in VR and the other following along on the TV.\n\nSurely the Devs must have known of this and could have built in a workaround for people who wish to play in this mode? Do not buy this if you plan to play it with friend(s) watching.\n\nHelpful | 11", "Puppichu_cute404Jul 23 at 5:59 PM\nAmazing!\n\nGreat story, and tons of fun interacting with the main character, environment.\n\nHelpful | 0", "jay-z007Jun 21 at 11:16 AM\nBest story game\n\nThis game is the best story Ive ever played hopefully will be like that forever I do wish you all the games like this maybe even a part two if youre going to buy this game and youre reading my comment if I was you Id get it\n\nHelpful | 1", "Chickengamer8Jun 8 at 12:33 AM\nBest Story/puzzle game ive ever had\n\nI swear i love playing this. The world is amazing and you can interact alot with characters. The story is touching and your gonna feel happy with your friend but also sad. It really feels like hes your friend that your helping through with alot of things. If your doubting about wether you wanna buy this. Just do it, its soo worth it.\n\nHelpful | 1", "MistOfHorrorApr 12 at 9:43 PM\nSuch a beautiful, happy, and sad game\n\nThis game really changed the way I viewed VR. It showes the capability of what developers can truly make in VR. This story is so good not only showing you happy moments full of excitement, but also sad moments full of tears. Without giving any spoilers away, this story teaches you a lesson one that you always need to remember. It even shows the friendship and a bond a person can have with another (even a ghost giant). The art is so perfect for this game and it functions amazing on the Quest. 10/10\n\nHelpful | 13", "Greedsin21Jun 5 at 11:27 PM\nSo Charming It Hurts\n\nI heard allot of good things about this game before hopping into it and i was not disappointed.\n\nThe story isn't super long and there really isn't much of reason to go back once done playing it, unless you want to get all the little side quests done anyway, but the story its self so good that nearing the end I was actually a little sad it was ending already.\n\nThe art style for this game just pops out, you can easily tell they put allot of love into this game in each level you go to. On top of that the characters in this game are all charming in their own way. The voice acting with a mix of french makes it feel like a real place at times.\n\nGameplay wise its a puzzle game. Remembering your a giant ghost and your able to pick up, pull, twist and throw things is fun, makes looking around each area allot of fun to see what u can find hidden away. Once you figure out what to do you feel pretty smart.\n\nI very highly recommend this if you love story games and I also recommend this game for first time vr owners 100%. There's nothing in this game that will make you motion or anything.\n\nI honestly can not wait to see what they do next after finishing this game and im going to make sure when ever anyone wants to try out vr at my place this will be the first one i recommend.\n\nHelpful | 1", "Twissy-87Jun 24 at 12:52 PM\nGorgeous with a beautiful story but..\n\nIt's a nice fun game with some puzzles and an eye-catchy scenaries and a very meaningful storyline but the game is too short and very easy.\nA bit expensive for its length and degree of difficulty.\n\nHelpful | 3", "southpgJun 11 at 1:01 AM\nGood design.... but borjng\n\nI bought this game based on the high ratings and reviews. The good side of the game is that it is well designed, floats well between scenes and the interaction with the player is smooth and clever. HOWEVER... the story telling was way too much for me! There was time I wanted to fall asleep, listening tte quiet voice telling the story of this little character with a dying mother. You would play 5 min to solve a puzzle and then would have 10 min story telling, then 2 min play, 5 min telling. There should be a balance game-story. I felt I was watching a cartoon most of the time rather than playing a game. So I grew bored very quickly! Hence the 2 stars. Not for me. Moss remains the best game so far!\n\nHelpful | 5", "ConFrunkinJun 3 at 2:24 PM\nAmazing\n\nThis cute little heart felt game had me hooked from start to finish I don't give out five stars often so good job on pulling my heartstrings and making a memorable little story\n\nHelpful | 2", "zefferyJun 21 at 9:32 PM\nvery fun and cute\n\nplayed this with my girlfriend and we took turns playing and watching, she was so attached to the main character louie and loved the cute animations!!\n\nHelpful | 1", "Ashen_Slayer27Jul 27 at 3:14 PM\nNot worth the cost\n\nIt's a cute little game with mediocre characters and animation,the sound is often misplaced in the map and the interactions are inconsistent and buggy\n\nHelpful | 0", "viljo001Feb 21 at 2:15 PM\nThank You For This Experience\n\nAs a person with Bipolar Disorder, I know how hopeless and helpless family and friends can feel during my moments of crisis. This was expressed very well in the game; clearly written by someone who has been through the experience of mental illness within the family. It affects everyone who cares about you.\n\nThe art, music, and storyline were amazing and I hope to see more games like this in VR.\n\nThank you for this experience.\n\nHelpful | 59", "Blancs3030Feb 20 at 9:52 PM\nWished it was longer\n\nWould be a 5 if it was just longer. I saw psvr reviews where it was 5 hours and I thought that would be worth the price. Finished it in 2 hours going slow, taking it all in and collecting all the small bugs, pin wheels and basketballs. Besides that one flaw this is one of the best games on quest. What everybody else said on the 5 stars reviews on it is true, but no one is saying how short it is. With no multi player, this is pretty much a play through and done game, but you'll still wanna show it off to first timers because it's still a great game. With one of the saddest stories I've ever played in a video game.\n\nHelpful | 56", "Djentleman37Apr 24 at 1:29 PM\nMy poor Oculus is all sobby!\n\nWhat a masterpiece - from the heartfelt story and its lovely characters, the fantastic artistic visuals and beautiful soundtrack to the simple, but immersive game mechanics. Its not long, but boy, does it deliver. What makes it especially intriguing is the decision, to combine the very serious topic of depression with the viewpoint of a child. Its a game for everyone, who is willing to let go for a moment, for everyone who wants to shed a tear or two - for everyone that doesnt just want to play a game, but live through an experience youll never be able to forget.\n\nHelpful | 3", "BlackNeko067 days ago\nA cute little game ... but ....\n\nThe story, characters and style is very cute, very endearing - I even teared up a little bit.\n\nBut ultimately, its very short, controls are a little iffy - I'm not sure its worth the price.\n\nIts worth playing, don't get me wrong - but if I had known how short it was? I would have waited till it was on sale or something.\n\nHelpful | 0", "nobleAlchemistJun 23 at 10:17 PM\nHeadset soaked with tears\n\nWho makes a game like this? Just thinking about it depresses me, so I'll leave my review short. Great game.\n\nHelpful | 1", "HelloAlice2019Feb 22 at 4:59 PM\nBeautiful graphics with engaging puzzles\n\nI am in love with the visuals in Ghost Giant. The artists of this game are extremely talented. Every aspect in each scene is absolutely beautiful - the farm, the giant sunflower field, the square trees, the buildings. Absolutely stunning! I'd say it is one of the most beautiful games on Quest.\n\nThe puzzles are not too hard and lots of fun. And if you thought the little mouse in Moss was adorable, wait till you meet sweet little Louis (I guess that's how the name is spelled?) from Ghost Giant. I read the story is very touching too, but can't tell yet, since my kids took my Quest as soon as they saw I bought this game and haven't given it back to me yet :/\n\nPS. I was NOT given a pass or free key for this game. I bought it at full price today and in my opinion it is definitely worth the $24.99 I paid for it :)\n\nUPDATE: I finally got to the scene with Louis' mom and started to understand why this game is described as very profound and sad. So while visuals and gameplay remind me of Moss, Curious Tale of Stolen Pets and a bit an old PC game I played as a kid called European Adventures of Madeline, the storyline is much heavier. So far it seems to be touching on depression and effects it has on family members, especially children of depressed parents. I am really hoping the game theme does not end up as dark and hopeless as Little Misfortune about a sweet little girl who goes on a quest to find happiness for her mom and after a horrible tragedy (that left me in tears) says hopefully mommy will finally be happy now.\n\nHelpful | 46", "usuckas45Jul 12 at 12:15 AM\nGhost giant\n\nHad the makings of a beautiful game but it cannot be that challenging to blow air to make the birds fly away are give him a high 5, I'm so disappoint I what my money back\n\nHelpful | 0", "tiddlywink.jenkinsMay 5 at 5:14 AM\nHow do I put in a ticket?\n\nIn the graveyard the key separated from the back of the piano and os now connected to nothing so I can't use it to tune the piano. I'm loving this game but due to the bug I canto continue. It would be 5 stars if I could pay.\nEdit: I started the graveyard level again and the key was at the back of the piano where it was supposed to be.\n\nHelpful | 1", "FatSheamusMay 15 at 10:29 PM\nA beautiful, heart wrenching tale...\n\nThis experience has the outward appearence of an adorable fantasy children's book, however, the underlying theme of the story is tragic and real. The subject of morbid depression is very well handled here, and clearly told from experience. Definitely worth the purchase.\n\nHelpful | 1", "TanixKingtonJun 14 at 2:36 AM\nMonkey Island VR\n\nVery nice ideas, well made graphics. Nice Little Story. Great showcase, will show it too some friends too. Very recommendable\n\nHelpful | 1", "ericjmyerssrMay 9 at 9:27 AM\nTugs at the Heart\n\nI've never played a game that could make me tear up! I initially got this game for my son but found myself wanting to play to see what the next chapters story was. The main character is so adorable and you feel privileged to be a part of his story. I highly recommend this game, as it is just more than a game but an experience you will never forget.\n\nHelpful | 0", "Strawberry31Jun 27 at 2:32 PM\nNeed help\n\nI need help....why can't I pause in the beginning to continue. It just takes me out of the game\n\nHelpful | 2", "Koregan1591Mar 13 at 2:38 PM\nCutest Game Ever\n\nI'm certainly no hardcore gamer, and I very very rarely write reviews.\nWhich is why writing this one is important to me. I haven't been able to pinpoint exactly why, but this game struck me in a way no other game has. Maybe it's the fact that it's VR, and feels almost real. Some of those moments in-game were real tear-jerkers.\nI HIGHLY recommend this game; and not just for kids. I'm 28, and will probably play this numerous times while hoping for future installments.\nThank you, to everyone involved in making this game.\n\nHelpful | 12", "ParadiseDecayFeb 19 at 11:08 AM\nAn INCREDIBLE port!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=7DudF-KTHIg\n\nMy Initial Thoughts:\nTo think this was originally a PlayStation VR exclusive.... we now have an incredible port that does justice to the power of the Quest.\nI really enjoyed the game on PSVR but the freedom of the Quest makes this the best version to play.\nIt's simply an INCREDIBLE game that no Quest owner should miss!\nWhy are you still reading? Go get it now!\n\nHelpful | 35", "Ashley1226Apr 15 at 2:57 PM\n\n\nHonestly its not a long, difficult, or complex game, but its heartfelt and sweet and clever. I wish I could have more interaction with the environment, or my little friend. But this game made me cry and kept me occupied. And I played through the whole thing. So its a winner in my book.\n\nHelpful | 2", "belambaApr 12 at 7:08 AM\nAmazing\n\nThis game is so touching and fun too. Ive got stuck a few times but with some thought been able to move on.\nThe graphics are fab and the little guy is adorable.\nWish there were more games like this on Quest.\nLook forwards to whatever these devs have next to entertain us.\nReally recommend this game.\nI dont know how long it is as only on chapter 7 but its entertained for a week playing in hourly bursts.\nIll go back and do the game once it ends as I missed a lot of collectibles.\nGive it a go, you wont be disappointed.\n\nHelpful | 3", "DragoniatApr 10 at 1:16 AM\nGreat story and tough enough puzzles\n\nThe design of this game is fantastic, the detail of the buildings and the characters is phenomenal, and I love the environment that was created when playing this game. I really feel like a giant in a cartoonish magical world. The message this game sends, is\nvery serious, a real surprise when most of the game is heartwarming and joyful. At the end of the game I was sobbing, I had to take off the headset just to let my tears out. The puzzles are just right, they take a little while to figure out but there not too hard that you have to look up a guide. Great game, I definitely recommend, one of the best games Ive ever played.\n\nHelpful | 3", "elaineloueezyJun 6 at 7:25 PM\nGhost giant\n\nI love this game! So cute! The puzzles are tough but if you persist and listen you can figure them out slowly. Great graphics!\n\nHelpful | 1", "NeverWrongApr 18 at 6:43 PM\nGreat game, but slightly disappointed.\n\nOk, first off, I know the title of my review is a contradiction. I dont know what I was expecting, but after reading the promotional articles I could not wait for this to come to quest. I checked the store every day for it, followed release update announcements and downloaded it the moment it became available. The imagery is beautiful and the story is good, but also dare I say it...a bit boring at times. The controls are a bit buggy. For example, blowing into the microphone only works sometimes and I have to completely get out of the game and start the scene over again fix it.\n\nI am glad I got it. It is a beautiful game, but perhaps my expectations were too high.\n\nEdit: I am changing my rating from 3 stars to 4. I have finished the game and although my previous comments are still valid, the last few scenes are so beautifully done (Especially the magical piano duet scene), I had to bump up my original rating.\n\nOne scene did make me cry and may be a bit too heavy for young kids.\n\nAdditionally, although it ended up being shorter than I expected, I feel that the length was just right. Even though this isnt a game with a lot of replay value, which is what I like to see for a price tag over $20, its a unique experience and a gorgeous work of art.\n\nEdit: the microphone not working bug was fixed after I stopped screen casting.\n\nHelpful | 12", "NeuroiGenesisDKJun 21 at 11:30 AM\nGreat story.\n\nGreat story, got a tear in my eye\n\nHelpful | 1", "BarbersRusMay 19 at 10:13 PM\nThe microphone parts don't work....\n\nReally looked forward to playing this game but it does not work as intended. Dev's any chance you can fix th the issue looks like I'm not the only person who has a problem. Otherwise it's a waste of $25. Since I as well as other can't even get past the beginning of the game.\n\nHelpful | 3", "SloppyComic2523Mar 17 at 10:44 AM\nI LOVE IT\n\nI was looking for a game. I saw this and watched the trailer. It looked fun and cute so I got it. I played the game with a few stops. I finished it the next day. I almost cried it was so sad and so fun. The best game on the OQ. People with 5 stars are right. The people who say it is too short are wrong. It took me about 3 hours all together to finish the game. It is the best game ever.\n\nHelpful | 7", "jenprMay 2 at 1:55 PM\nVery fun\n\nThis game is fun to play. If you like RPG games youll like this game. Im still playing it, and its taking me a long time, Im glad that its not a quick game to beat. Highly recommend! \n\nHelpful | 2", "Flitch_1989Mar 18 at 12:15 PM\nHeart warming and stunningly done.\n\nOh Louie, I'm going to miss you.\n\nA beautiful game with a touching story. The puzzles can be a little infuriating because of how richly textured the world is, can be hard to spot hidden things but that's a good thing. The voice actors are superb and you genuinely feel like your helping him. I know there can never be a sequel, but I'd love to see another game is this style.\n\nOn a side note, the controls for touch are a little janky, you have to keep your hands wrapped around the controller's to have an open palm. Easy to get used to, but still a little odd.\n\nHelpful | 6", "erasmushurtMar 5 at 6:39 AM\n\nThis is a very good game. Although I do have a gripe with the new player experience. The lining up the eyes system for height seemed a bit unnecessary and needing to look down to press the button after doing it was confusing.\n\nThe worst bit though is the hold pause button to get to main menu to exit the tutorial. The kids gave up and thought it was broken because they kept pausing it. Not the best new player experience.\n\nAfter that though it was a good experience.\n\nHelpful | 20", "XSylvarXMay 28 at 3:46 PM\nOh my god\n\nI never knew a game could hit me so hard in the feels until I came across ghost giant. It was absolutely charming from start to finish!\n\nHelpful | 0", "mattqgravesJun 4 at 10:46 PM\nFantastic story driven game!\n\nIts not very long, but is a great interactive story game with puzzles\n\nHelpful | 1", "omni_shankerFeb 17 at 9:21 PM\nAMAZING!\n\nThis game is SERIOUSLY epically done. The hardware of the Quest lends it self SO WELL to the artistic style used in this game. Highly recommended.\n\nHelpful | 85", "ChikoiwangkoFeb 23 at 7:07 AM\nA Great Experience marred by minor flaws\n\nWhen I hear Ghost Giant was coming to the Quest, I was quite intrigued. Having been a PSVR exclusive previously, it was interesting to see how an actual tether-free experience will further enhance the game. But was it a good game? Let's find out.\n\nThings I Liked:\n\nMusic:\nwow the music. I tip my hat to Joel Billie and Bortre Rymden, as the music made the games emotional scenes even more impactly with the wave of string and wind instruments used.\n\nAtmosphere:\nSimilar to Moss or A Fisherman's Tale, Ghost Giant set you as an entity that can manipulate a diorama of tiny miniature that can only be experience well in VR.\n\nThing I Didn't Like:\n\nGhost Giant's Hands in relation to the controller:\nPerhaps it might be a case where the PS Move controller has only triggers to work with, but with the oculus quest having a trigger and grip button, it has made awkward to grab thing in game. This is especially prevalent where the animation spasses out when I'm just pressing the trigger, going from pointing to open hands to gripping hands. This also meant that grabbing objects can be chore as objects have weird physics and hitboxes, which results in multiple times where items clip through terrain and out of the world.\n\nSound:\nWhile I praised the music earlier, various sound cue can be oddly directed, especially with positional sound sources. Multiple times I have encountered issues where characters are talking to my right with the sound coming from the left channel audio.\n\nRecentering between scenes:\nWhile not a major issue, I find that every transition between scenes I would get confused in the black void where the the centre of the next scene would be, and almost all the time I would only catch a glimpse of the scene transition title before it faded into the scene proper.\n\nOverall, is Ghost Giant worth it's asking price? If you're a VR aficionado, it's worth it for the experience, but for the rest, I'd say it's only worth the price is similar to other titles at around USD15.\n\nHelpful | 8", "bcm123456Feb 22 at 2:18 PM\nCute\n\nYes, this game is cute. I do dislike a few features though. I cannot really move around without it telling me to \"return to your play area\". I had to go back to the main menu and restart level 3 for the mic to work (ps... you cannot be casting or the mic will not work).\nEvery game is going to have their downfalls, and for this game, their strengths over power their downfalls. I love all the little games, and their storyline is nice. It would be neat if every time you went into a level, the game would change up a bit. I feel like once I play this game through I probably won't play it again since I will know where to find everything and how to get it; it won't be challenging anymore.\nOverall though, great game. Purchase NOT regretted. Thanks!\n\nHelpful | 8", "AyeandusJun 20 at 9:38 AM\nI thought you could only use your hands\n\nI still have to use the controller to play this game my kids dont like it I played it less than a hour how do I get my refund\n\nHelpful | 1", "krisvdvijverFeb 25 at 9:49 AM\n\nA world so beautiful, once you arrive, youll never want to leave.\n\nGG will be loved by everyone who likes beautiful, enchanting, immersive and narrative-driven games. Especially if you like those cute 3rd person diorama games where everything looks small and toy-like.\n\nSo if youre looking for adrenaline-inducing, competitive-driven (multi-player) first-person action games with high replay-value, then this game will possibly not appeal to you.\n\nNothing is 100% perfect and for me theres one thing that could be improved and thats grabbing.. sometimes it takes a few attempts before youre actually holding the object that you need and it would be even easier to play sitting, if there was an option to point and click for grabbing things (magnetically). And this is really the only small complaint or wish that I have.\n\nIf you love the idea of an amazing (couch) game, that you need to play slowly so that you can absorb and enjoy the wonderful and amazing things around you, then you shouldnt hesitate! The level of detail that is provided here is simply stunning, and it all looks so incredibly beautiful.\n\nDefinitely in my Top-5 for Quest!\n\nHelpful | 11", "iphongxMay 17 at 9:36 AM\nBeautiful graphics but...\n\nI got stucked at scene 4 and dont know what to do next. No clues, no hints???\n\nHelpful | 0", "TeonisApr 17 at 3:11 AM\nSweet little story\n\nThis is a really great game, with a lot of sinple puzzles, beautiful sondtrack and lovely characters.\nMy only CON is that it was a little difficult to grab things with my hand, but maybe that's a problem only for me.\nOverall it worth every penny!\n\nHelpful | 1", "davemc1708Mar 15 at 1:59 PM\nGHOST GIANT\n\nLove the animations and story loads. Work needed in the interactions though especially if seated. Examples being some of the interaction falls outside of the set boundaries when seated and you have to change the camera frustratingly starting again.\nHowever the quality of the game is excellent and if you loved Moss you will love this even more.\n\nHelpful | 2", "Might_HydraMar 27 at 7:03 PM\nLoved it, just wish it had more.\n\nBy no means is this going to be a negative review. The only gripe I have with the game is the fact that there's isn't more of it.\n\nStory: The basic premise of the story is simple, yet, well executed with you as the ghost Giant helping your little friend along the way.\n\nGameplay: Basic world puzzles with little Easter eggs that make it fun to explore. You'll find hats to put people on or basketballs to try to shoot. Overall, the gameplay does what it needs to do to immerse you in the story.\n\nCharacters: The characters are wonderful and have a personality of their own, all with their own underlying stories (you just have to pay attention to what they say when not in focus).\n\nMusic: The music is whimsical and does well establishing the mood. Music plays an integral role in the game, so it's nice to see an emphasis in making the music beautiful.\n\nVisuals: The visuals are deceptive, you think they are simple but are quite unique and you can tell that love and passion went into making everything we see. It's charming to see the night stars, the fields and trees.\n\nIf you are contemplating getting this game and want to be immersed in a story driven world, then I highly suggest Ghost Giant. The game does feel like it ends a bit too soon, but the journey and experience are definitely worth it.\n\nHelpful | 1", "bigdisreallybigFeb 21 at 8:17 PM\nFun, Beautiful and Emotional\n\nThis is such a great game. The puzzles were fun, and sometimes difficult for me. The story, music and voice acting is top notch for a VR game. This is one of the better ones out there. I feel it's slightly, ever so slightly over priced, but other than that, the game is perfect and has wonderful messages throughout.\n\nHelpful | 5", "BlueEyes300Feb 23 at 11:30 PM\nAwesome game\n\nLike some other people said this game actually made me tear up.. it was that good.. graphics was awesome, the interaction was perfect... but one bad thing... it was short .. Im hoping itll have more story where the ghost comes back. Very nice job on this game!! Also for the Deaf... its subtitles Through the game!\n\nHelpful | 6", "BadLarryNYMar 29 at 9:10 AM\nWell done but way overpriced.\n\nI enjoyed the art direction and narrative overall. If you liked Mosss third person perspective with diorama style levels, then youll probably like this game. However, $24.99 is way too steep a price for a short game with limited replayability. Furthermore, youll spend more time watching and listening rather than doing things. Manipulating objects in the environment often feels clumsy. Sound could use some addressing too as characters speak low and the direction the sound comes from often feels way off. Grab it if it goes on sale cause this is a 10-15$ game.\n\nHelpful | 14", "EastCoastLosFeb 25 at 8:02 PM\nShort, Sweet, Hits the Feels.\n\nPROS\nRun time is ~2-4hrs but feels like a fun journey that doesn't overstay it's welcome.\nCharters and art style are cute.\nCutscene presentation style is great.\nStory covers subject matter not often seen in games.\nFun collectibles that take advantage of the hardware.\n\nCONS\nMany interactible key pieces active at once makes focus on the main objective foggy. Had to poke the character for hints.\nYou can solve puzzles long before charters finish dialogue and then have to wait for it all to play out.\nOften have to look somewhat down since you're giant But this goes against VR ergonomics and for this reason I don't recommend long play for this game.\n\nHelpful | 4", "JakakobMar 17 at 10:54 AM\nAmazing!!!\n\nThis adventure/puzzle game was the best game I have ever played! Its amazing! The puzzles were fun and creative. Secrets are hidden everywhere, and its fun to find them! The design was also creative and fun! I strongly recommend playing this game! Its awesome!\n\nThe game has many ups and downs. One minute youre happy the next youre crying. And as you shrink when sad and grow when happy, it makes a amazing atmosphere when you play. It is probably the most emotional vr game I have ever played.\n\n\nOverall the game is fun, creative, emotional, amazing, and the best vr game ever in my opinion. I would recommend this game more than any game out there.\n\nHelpful | 2", "brandon2965Feb 22 at 2:35 AM\nAwesome\n\nLove the artwork. Every level felt immersed in and the way they created depth as the background recedes I just couldn't stop looking around at everything. It seems like there was something interesting in every little nook n cranny. The characters and dialogue are very well done. Story is good so far. I think I'm on chapter 9 and I'm trying not to rush through cuz I dont want it too end. Props to the devs it's a pretty solid gem.\n\nHelpful | 6", "LifeOBrianApr 24 at 8:01 PM\nGreat game but suffers a bug\n\nI love this game and its story and its art style! The puzzles are engaging and the characters are charming.\n\nHowever, I discovered a critical bug that breaks the game. When casting to a mobile device, the microphone input is disabled when you need to blow on something. Since you cannot progress unless you blow on certain objects then you are completely stuck. The only resolution is to stop casting and restart the game.\n\nThis is completely sad because I bought the game for the sole purpose of showing it to my young son and now we cant share it together. I wish there was just a button to bypass that part, which may be handy for anyone who has no interest in enabling their microphone for whatever reason.\n\nHelpful | 1", "Rc3dFeb 22 at 1:07 PM\nStuck on gust obstacle\n\nI can't progress through Scene 3. UI says to lean in and blow into microphone to create a gust of wind to blow the birds off Luis' path. I allowed the game access to the microphone in the beginning prompts. Tried blowing upwards towards the HMD, cupping it with my hands, plugging in a headset with mic, and even just making loud noise to trigger it, nothing has worked. Would like to get past to see the rest of the game, but it seems there is no way. Any help?\n\nHelpful | 24", "GroovyGavsFeb 28 at 9:30 AM\nA Great But Sad Story >~<\n\nThis is a amazingly charming game. The storyline is great and sad if you are emotional I would not recommended. I played this game at the end and almost cried. Its a heartwarming story I think everyone should experience. This is definitely a great first game for the Oculus. If you are conflicted on buying this game or not, take it from me, you should. NOW GO HELP LOUIS ^-^\n\nHelpful | 4", "xxpistolpeteMar 29 at 12:42 PM\nCharming\n\nImagine you are standing amidst a model village, now times that by an intensity of ten, and imagination to boot. This title lets you explore a world of miniature villages and forests with endearing story telling combined with imaginative puzzle solving......a moving experience also ensues.\n\nHelpful | 1", "Generic_Fish_01Mar 20 at 9:29 AM\nTo short, but still sweet\n\nThis is a masterpiece, no doubt about it. But I wish there was more to do it only took an hour to beat and I wish I could play it more but there isnt anything to go back except an emotional experience with nothing new to add. Over all, an amazing game but I wish there was a little more content to entertain me for a bit longer. (like multiple endings)\n\nHelpful | 1", "WhiteThanosFeb 21 at 8:23 PM\nTouching\n\nIm amazed at this game. I originally heard of this game from the PlayStation vr store, however it was an exclusive to ps vr. So when it came to the quest I really wanted to try it. I played through the whole game and it is just amazing. I 100% recommend this game\n\nHelpful | 6", "Squirrel2000Feb 29 at 11:51 PM\nIt's a wonderful experience\n\nLook I'm not going to say I sobbed but I kinda ugly sobbed. This game got me so invested with everything!! So much to play around with and cute things to find and the story, it's so simple but investing. Its absolutely something to experience, the music is beautiful and the art style is so cute!! I could go on, this is absolutely one of my top favorites when it comes to games\n\nHelpful | 3", "TVL1977Feb 27 at 2:11 PM\nLove the charm of the game!\n\nSuch a cute charming game. The graphics are so beautiful, you almost want to start taking pictures of the environment. Everything is very nicely done and you get sucked into the world and story so easily.\nYou, being the ghost, watching everything from above, creates a heartwarming band with the little character Louis and his world.\nHelping him out is so much fun and the story has some deeper emotional layers as well.\nThe charm of it all makes it worth the buy if you like these kind of puzzle, story driven games but I do hope they fix the glitches when grabbing and dropping stuff and because it's kinda short I also hope they reduce the price to make it more attractive on buying it.... Cause it's definitely worth playing.\n\nHelpful | 3", "LazyActivistMar 3 at 7:07 AM\nBeautiful interactive story.\n\nThis is a beautiful interactive story. Charming visuals good voice acting and enchanting music. The puzzles are very simplistic which is why I would describe this as an interactive story and not really a game but it is a lovely world to inhabit for a short while . It oozes with style you and is worth the money one of the more polished adventures on Quest to date.\nI would give this an 8.5 out of ten but with a 5 stars option Im rounding it to 4.\n\nP.s Oculus if you are listening 5 stars is a terrible way of constructing ratings even if it is the fashion.\n\nHelpful | 2", "evandaganFeb 24 at 10:28 AM\nLooks great, bad controls\n\nAfter Moss, I've been waiting for another charming diorama-style game. While this is more narrative, less action, it hits many of the same notes. The artwork is really impressive.\n\nHowever, the control scheme is terrible. Grabbing objects only works about half the time, objects tend to fall through the ground surfaces and disappear without warning, and certain actions in the game are made almost impossible due to the broken controls. It's certainly still playable, but frustrating, and hopefully this will be fixed with a patch soon.\n\nHelpful | 13", "drakedash9 days ago\nI didnt even get to play\n\nI thought this game was so cute so I bought it. When I was adjusting my height I went way to high. I tried to go back down and fix it, but I cant cause Im too tall! I cant even start the game cause the button is too low to the ground.\n\nHelpful | 0", "killerfox333Mar 7 at 9:51 AM\nThis is the best game\n\nOmg ok so the graphics are on a whole new level and every thing in it is just so Beautiful its like you are actually there they did an amazing job with everything and the best part is the story there is so much and the music if that music is on Spotify I will get it. The game is just really good and if you are thinking about buying it then do it you wont regret it\n\nHelpful | 2", "Ihrie3 days ago\nAdorable and at times pretty emotional\n\nDefinitely a cute title that will probably pull on your heartstrings here and there. Overall quite well done even if I did run into a couple bugs that caused me to have to restart a level.\n\nWould definitely still recommend if youre into puzzle experiences with a good story and a unique visual aesthetic.\n\nHelpful | 1", "IkeTheOneRapperApr 1 at 1:17 AM\nRefund denied. Uninteresting.\n\nI thought that they give no holds barred refunds for the games you dont like within two hours of playtime in 14 days. But I asked for a refund an hour after I purchased it and they denied it. Not cool\n\nHelpful | 8", "Jayfox1990Mar 6 at 3:42 AM\nGiant Hugs included\n\nThis game is what it says it is you play as a Giant Ghost and you help an adorable little critter thru some rough times. You give him high fives and fist bumps and scritch him behind the ear i would love if there was more interaction and i love varying degrees of size difference.\nIf you want a heart warming story and need a new friend definitely give this game a try.\n\nHelpful | 2", "Termite-Feb 26 at 11:08 AM\nWorth it. Best VR emotinal experience\n\nIf you feel lonely or failed in life, I advise you to play this game.\nIt evokes strong feelings of compassion and sadness for the character, makes you think about your life and the lives of your relatives. The best emotional experience in VR.\nThe game is definitely worth a purchase. Recommend.\n\nHelpful | 3", "SoyLlamaMar 1 at 7:46 PM\nI would buy this a million times\n\nAs soon as I beat the game I broke into tears, this is the best game ive ever played. It hit way too close to home. To the person who made this.. you are the greatest person to ever live, please keep making stories because this is the best, im still crying.\n\nHelpful | 5", "singer.vincentFeb 27 at 3:27 PM\nShort but sweet\n\nJust my opinion but I felt the experience was a bit short. They do flesh out the characters pretty well but I did expect more from the story with all that character development. In the end I was thinking to myself... thats it? And yes... that was it. You dont get any type of reward for finding all the collectibles, that kinda seems like a lost opportunity to reward the player. I was hoping this would meet the bar that moss set. Its not quite that. Moss felt like a more complete experience and I enjoyed controlling quill much more than just watching as a ghost. This is a much more on rails kind of experience. I still tip my hat to the dev, I can tell care went into making the game.\n\nHelpful | 2", "sayodkzonApr 30 at 5:50 PM\ngame not working probably i want refund\n\nThe game is not working properly from the start till now its not working probably and not worth the money i spended on it i want a refund losed trust in something i trusted but not worth it\n\nHelpful | 2", "JAMs1969Apr 20 at 12:50 AM\nI Really Enjoyed This Game\n\nGreat story. Very immersive. The puzzles are creative. This game will tug at your heart strings a little bit. Im hoping for a part two.\n\nHelpful | 0", "ScorpionQueen51Feb 22 at 7:14 AM\nAmazing game!!!\n\nThe game and quality is just amazing and when you need to blow something allow the microphone on oculus and the game and BOOM! It works,I love the task this game gives you and how the story timeline goes. I reccomend this game for everyone that likes to helping people, likes to play any scene at anytime, and likes to do very fun task. Then this is the game for you!\n\nHelpful | 3", "emklettMay 23 at 3:02 PM\nNot bad, but not worth the price.\n\nThe game environments looks nice and cute.\nThe puzzles are quite easy but not the most interesting to solve imho.\nThe animation is very mediocre, which is a shame, it really breaks the immersion for me.\n\nHonestly, coming from Moss, where you are also a ghost giant helping a little creature going through its quest, I would choose Moss a million times. But the stories are different though and this is where subjectivity and tastes plays a strong role too.\n\nThe asked price for it is quite steep for what the game offers, both in quality and length. I think that half of the current price would have been a wiser choice.\n\nHelpful | 5", "aaronhowe78Feb 23 at 11:20 AM\nLovely but short for the price\n\nThis is a lovely gentle game with not-overly challenging puzzles suitable for most ages, but the theme is a little bit adult and may go over the head of kids.\n\nThough it is beautiful, well voiced and composed; it is short. For the money it feel just a *tiny* bit expensive as it doesn't have replay value - though it's good for anyone new to VR.\n\nOne gripe I do have is the height of the game, I had to reset several times to be above and below the eyeline of the game (which you can set at the start) to be able to reach the things I needed to get to. It would be better to allow a little more movement (especially for things below the eye line) without having to start the whole chapter over again. One of the bonus objectives is throwing a basketball into a hoop, and in one chapter it's almost impossible because of the placement of the items in the game.\n\nHelpful | 2", "AbyssstrikeFeb 28 at 10:25 PM\nLove it\n\nI honestly love this game so very much, it has left me with so much emotion, and I feel as though I've said good bye to an old friend. The story telling in this game is amazing, and every part of this game is amazing! My only gripe is that the grabbing mechanic isn't so great, but other then that it I think for me this has to be the best VR experience on the Oculus quest.\n\nHelpful | 2", "AlexLenMar 19 at 10:16 PM\nUpdate: Found out how to progress birds\n\nCould not progress the birds and the blowing ... the solution! You have to agree that aplications can record audio ... it works perfectly!\n\nAmazing game ... so beautiful environment and characters.\n\nThumbs up! Plese more.\nWorth the price.\n\nHelpful | 2", "ScootbreonFeb 27 at 8:14 PM\nEven giants have friends\n\nOh my god, the characters are absolutely beautiful, the voice acting is stunning, and everything is so happy and cheerful, until its not, but Im not going to spoil that. The puzzles arent as easy as they seem, managing to get someone who loves puzzles stumped, and it certainly makes me want to replay it. It might be short, but what you are given makes the replay value high. You want to replay it to find everything and experience the great story that was presented to you. Very well done!\n\nHelpful | 2", "Ridiculously.RandyFeb 27 at 11:57 PM\nBlowing problems\n\nThe game is adorable and cute. Eye candy and fun for the passive gamers. Im unable to blow the birds in chapter 3. Ive tried blowing everywhere and making noise and blowing up and all other suggestions made online. Help.\n\nHelpful | 2", "edshigakiMar 24 at 12:04 PM\nGood emotional journey but...\n\nThe stages are full of objects that you can't interact with. You can only interact with the key objects, it's frustrating! Your hand is odd, so the grab action is odd as well. You can't be sure if you are making the right movement. The game doesn't have good physics. The wind blowing with your mouth is a nice touch, but doesn't work so well.\n\nHelpful | 2", "CoffiGamingMar 8 at 10:17 AM\nAbsolutely phenomenal!\n\nI'm usually not a fan of puzzle or story games, but boy was this an amazing experience. Although the story was short, it was very emotional and moving. There isn't much to say, except that I am astonished.\n\nHelpful | 3", "VinziusFeb 24 at 12:15 AM\nGood but not polished\n\nWhile I want to put the max rating, I can't.\n\nIf you played Moss, you will see a big difference in the details.\n\nHere we can find several bugs:\n- 3D sound if often buggy (not coming from the proper direction)\n- interaction with objects is often broken\n- bugs that require you to start again a level\n\nPlus, you can't play sit down while it could be implemented (thanks to some rotations with the stick)\n\nMaybe it'll be a 5/5 in a few weeks, but in the meantime, you should wait.\n\nHelpful | 7", "Arthands_VRFeb 25 at 7:19 AM\nGreat adorable fun\n\nTook me about 4 hours or so to clear this title. Its a puzzle adventure game, where you help this little dude solve his problems, and there's a nice emotional story in it.\n\nWithout spoiler, there's one particular puzzle (its in Louis' house) that I trial and error, not knowing what to do and the hints ain't helpful. But in general, the game is great and I love it.\n\nThis game is rather similar to Moss, but with more puzzles and no action. I definitely recommend it.\n\nHelpful | 2", "PeteyPakFeb 29 at 1:19 PM\nBuggy, tedious, needs to pick an audienc\n\nIt's beautiful, there's no claiming otherwise,\nbut,\nIt's also a story for very young children couple with long dialog sequences that young children wouldn't sit through, especially since there's little or nothing to do while they play out. It's narratively shallow, problems appear for no reason except that you're there, instead of thinking up interesting ways a giant could help in general. And it's weird - is the player responsible for demolishing his treehouse? Why do we start the game by molesting him needlessly and destroying things, and why does it play out to be a good thing? Half an hour in and I'm l bored and annoyed and complaining here instead of playing it. Update: I gave it another half hour it only got worse. I dislike being shown a beautiful environment and cute characters and then having to tear their houses apart for the gameplay. That's the game working against it's own charm.\n\nBugs:\n- Relying on the microphone at all has turned out to be a mistake, based on my experience, and other reviews I've seen. Well this is an experimental medium, fair enough, but it's not working, as it wasn't for me, there needs to be a an alternative offered. Surely you can detect audio acquisition failure or perfect silence and do something about it?\n- The ghost hands are closed when your hands are open, and they open when you hold the controller. It's really annoying,\n- Surely gripping the grip controller should make the hand grip closed instead of moving the index finger?\n- In-game interaction is buggy as heck, things are really hard to try to get hold of, often end up sticking out diagonally somewhere. I can imagine this being extra frustrating for what seems to be a very young target audience. *This was the biggest experience killer to me*, interaction, frankly, is awful.\n- Audio kept cutting between directional or right in my ears.\n- The paintbrush/broom went freaking out all over the level and through the ground and eventually reappeared with the end stuck out 90 degrees from the broom, longer than the broom.\n- the docks level ended with Louis floating over to a rock and stuck half embedded in it, I think making car noises.\n\nI would be curious to hear what happens in this story that keeps getting mentioned, but not curious though to sit through five hours of this.\n\nHelpful | 9", "thomasbgoneFeb 27 at 10:40 AM\nThis game wowed the heck out of me!\n\nNot a lot of quest games have been very good on the quest in terms of immersion and quality. This game told a really good story and I havent cried like this in a very long time. The music was awesome and played a good part of the atmosphere of each scene and I hope that zoink decides to make another game like this one.\n\nHelpful | 2", "IsmasIsXmasFeb 22 at 11:20 PM\nVery very good game\n\nThis game is very intriguing. I couldnt get my hands off of it! The story is very emotional and progresses Well. There were some scenes that make me tear up and I usually dont get sad at a video game. The only very very small flaw is that there has to be a bit more to the game. The good thing is that you can replay all of the scenes as many times as you want. Overall, a very good game. It would be awesome to have more apps like this on quest.\n\nHelpful | 2", "Graythecatlover120Feb 21 at 2:24 PM\nMost great game ever play\n\nOk so love the game and very relaxing, but I dont know if its intentional but the audio wont come from the character. It just comes in a random place so if u fix that this game will be the best game i have played on the quest\n\nHelpful | 4", "owo_sunflowersApr 1 at 12:07 AM\nThis made me almost cry in my headset.\n\nSo, this was amazing. NO GAME HAS MADE ME ALMOST BURST IN TEARS! When Louie at the end was like \"Are you leaving?\" I legit almost bursted in tears. I got so attached to Louie.\n\nHelpful | 0", "CasualCheetahMar 4 at 1:33 PM\nThanks for porting it!\n\nEven if it is a little rough around the edges, it's great to see that the game got ported to the Quest.\n\nI enjoyed stepping into the warped yet cozy dioramas of each chapter. There's that distinct visual touch that's a part of why I love Zoink.\n\nJoel Bille's work on the music was a joy to hear. Listening pieces from the soundtrack every now and then helped to keep Ghost Giant on my radar.\n\nHelpful | 1", "kristin.sherwood5Mar 3 at 10:05 AM\nCharming and beautiful\n\nLoved this game! The characters came to life and the scenes were such fun to explore in all their detail. I loved the way that I as the giant occasionally changed size and perspective. The game is very beautifully designed and has a sweet (though somewhat sad) storyline. My only complaint is that it was so short - a few hours at most. Still well worth the money and highly recommended.\n\nHelpful | 1", "june.simpson.794Mar 5 at 1:36 PM\nAbsolutely delightful !\n\nWhat a lovely virtual place to be. A real fantasy. The scenery is stunning. This is a clever presentation and its so empowering to be the helpful giant. I love this game! I find it hard to choose between this and I expect you to die for the hour I can bear to wear the heavy head set.\n\nHelpful | 0", "calwa1960Apr 5 at 2:21 AM\nGhost Giant\n\nThe scene in the farm my little friend is trying to pull sun flower from ground. Can't find any clues. I'm stuck\n\nHelpful | 0", "NPCMiiApr 24 at 2:30 PM\nBeautiful & inventive game\n\nAmazing experience. Highly recommended.\n\nHelpful | 0", "OaksAndAcornsFeb 23 at 12:41 PM\nMeh - its ok\n\nSo having played Moss, which I really enjoyed, I was super excited to play Ghost Giant. However, so far Im actually finding it really slow (theres a lot of narrative) and the accents and voices are really quite grating! Also, there seems to be a few glitches when trying to grab things or interact with things in the game. Sometimes you can pick them up and sometimes not - for no apparent reason.\nUsually when I get a new game I get hooked and cant put it down but this one really hasnt grabbed me and I dont even have any desire to actually finish it.\nDisappointing.\n\nHelpful | 7", "GirlGeek101Mar 15 at 3:42 AM\nAmazing\n\nWorks beautifully sit or stand! I love the graphics and how immersive this feels. However it has a sad side to it in the story. Without giving away spoilers, everything will be ok.\n\nHelpful | 2", "highjump1993Mar 12 at 11:54 AM\n\nOnly began to play but I am already enthralled. Game has both easy and complicated tasks to solve. I am enjoying the story line and the graphics, happy to rate it four stars.\n\nHelpful | 2", "meepadeepFeb 22 at 10:40 PM\nHigh 3! Now bump it!\n\nBeautiful game. May make you cry. The story will grab onto your heart and never let go.\n\nI do have to say though that trying to throw objects in this game is a pain. I may or may not have done a cheatsy menuaver and walked past the bounds to smack targets while blind.\n\nHelpful | 2", "firedevApr 7 at 10:13 AM\nAmazing\n\nWho wouldve thought that this simple game could deliver such a punch. Graphics, animation, voice actors, it is amazing.\n\nHelpful | 1", "rottarmMar 27 at 8:52 PM\nMic?\n\nPretty cute little game, not as interactive as Moss (basically just a movie with the occasional thing to move to a specific place), but the narrative and art style is very cute. Got to a part where I needed to blow some birds off a bridge but it just didnt work. My wife and I both tried for about 10 minutes before getting winded and giving up. I double checked that the game has mic access and it does so I dont really know whats going on there but its a great opportunity to allow multiple ways of solving a puzzle.\n\nHelpful | 1", "mrFriedlandMar 4 at 8:05 AM\nA good experience\n\nI liked it alot. Only thing I need to tell devs is that the microphone input does not work when casting to oculus app. We cant play this as a family in this condition. Plz fix this tiny tiny thing. Love the game\n\nHelpful | 2", "RexmaxxFeb 24 at 8:18 PM\nI love this game!\n\nThis was an awesome experience the whole way through and by the end of it I didnt want to say goodbye, I know games are had to make but I still wish there was more in this game. Regardless of how short it may be, I will cherish this game!\n\nHelpful | 2", "JenspadFeb 24 at 10:01 AM\nI loved it but.........\n\nI'm not going to lie I absolutely loved playing this game and it is the first type of game like this that I have....... But as soon as I was totally getting into it, it was over. I understand it takes a long time to transition the platform to the quest and this is on other platforms but if it's going to be that short that's fine the price should reflect that. I have paid significantly less for far better....for example Shadow point. I am really hoping that the developers decide to add some additional content to it or replayability because at this point I feel like asking for some type of credit on my account. Apart from the length the story was great the graphics were amazing. I love the dollhouse type of environment it was relaxing and the perfect type of puzzle game for me as was Doctor Who (which I loved due to the puzzles not being so difficult that you're stuck for hours) Doc was also short but not even close to as short as this, but it cost less and I wasn't left feeling somewhat duped for my money. I probably would have rated this a 4.7 otherwise.\n\nHelpful | 4", "mdamurphyMar 16 at 2:11 PM\nAmazing graphics with story\n\nWonderful heartfelt story to puzzle you through the book. Would recommend to everyone. Fun and intriguing will leave you in wonder.\n\nHelpful | 2", "RockOn89Mar 10 at 11:01 PM\nBeautiful game with flaws\n\nFirst tue negative: the controlles\nIT's sometimes unresponsive and can be frustrating.\nOther Khan that i really like this game.\nVery creative, interesting characters, moving Story and a beautiful Soundtrack.\n\nHelpful | 1", "poetic_is_hereFeb 25 at 5:46 PM\nShort AMAZING experience\n\nThis was an amazing experience. Just when I was getting the groove of the game...Boom its over. I could spend hours upon hours playing this game. While I understand supporting the developers, this game is overpriced for only a couple of hours of gameplay with no replay value.\n\nHelpful | 0", "RowdyRocketFeb 20 at 8:12 PM\nVery enjoyable!\n\nLove the artwork and game style. Still a few glitches I assume that will be fixed soon. Audio direction is not very immersive. Often I'll hear things in my right ear though they are to my left. A few objects are harder to pickup or interact with then they should be. Hands always point, unless you slightly squeeze then they open and proceed to close as you squeeze tighter. The game overall is very fun. I enjoy the whimsical graphics and the details. Very cute game.\n\nHelpful | 1", "Nickel-VJul 18 at 10:45 AM\nA really good game\n\nI know Im late, but this was just really fun and had a great story 10/10 :)\n\nHelpful | 0", "UDontHaveMyNameFeb 22 at 7:19 AM\nWow!\n\nWords cannot explain how cool it is to peer into this world that you hover above, its a visual piece of art and tugs on your heartstrings. I have zero regrets about purchasing this title.\n\nHelpful | 3", "mikkirice98Mar 25 at 11:29 PM\nBeautiful!!\n\nA beautiful and wonderful experience. The ways you have to think and figure out the puzzles is so out of this world! Ghost giant has touched my heart!\n\nHelpful | 1", "PennychanbabeFeb 27 at 12:57 AM\nSo disappointed! More for kids and girls\n\nFor the price I paid, it is definitely not worth it! The game has too many conversations which is so draggy and it is taking forever to load from chapter to chapter. Hence, it is trying to drag the duration of the game in which the actual interaction or puzzle solving is darn too easy and direct. More suitable for kids.\n\nI agree that the visuals and storyline are beautiful but it is just not exciting.\nDont expect it to be like Moss, as it is more challenging in Moss.\nI feel like being scammed cos most of the puzzle solving games are really too short. Within 5 hrs or less I can finished the entire game. And once you are done, there are no more surprises for you to replay the game. And I am not the type who like to replay the game since I already knew the trick.\n\nShould you set the price lower at 15USD, maybe it is still fine.\n\nso dissappointed!\n\nHelpful | 3", "DanBlastFeb 23 at 6:10 AM\nIts ok but no Moss\n\nIf you play this before moss then youd probably think more highly of it. Its a nice game but not the emotional masterpiece some are rating it as.\nMoss was better, this is good but not for the price. $10 would of been ok but $25 is way over priced for an ok game thats a short one shot deal with no replay value.\n\nHelpful | 5", "visionarypigMar 6 at 1:13 PM\nFun, sweet, not too challenging\n\nI just started playing on any video games. I love the mental challenge of this game. I love solving the mysteries of this game. More please! I dont like shoot em up games so this is perfect for me and its sweet and emotional.\n\nHelpful | 1", "AlbuSumMar 4 at 12:48 AM\nAmazing story and game\n\nYes its short but in the short game i got more invested in the story than a game has got me in awhile, i do wish there was just a bit more though, maybe they'll add dlc or more content eventually, maybe a second game, either way highly reccomend\n\nHelpful | 1", "stuart.fisher.79Feb 29 at 7:25 PM\nCant get past the birds\n\nGot to scene 3 but cant get past the birds. The microphone is on and we allowed access at the start but no matter how much blowing / noise we make it doesnt work.\n\nHelpful | 14", "Balibird04Mar 29 at 4:28 AM\nBalibird\n\nBecause we are staying at home because of the virus. This game is wonderful and provides\nhappy times playing it.\n\nHelpful | 0", "sundrytimesMar 28 at 9:10 PM\nHeartfelt and Interesting\n\nIts a beautiful game with a sweet story. The two main characters are great together and develop a bond.\n\nHelpful | 0", "Bu77_KickerFeb 21 at 4:27 AM\nGreat game\n\nHave been waiting for the release of this on quest and love every bit of it. My kids love it too. Awesome game.\n\nHelpful | 5", "AvhaariMay 25 at 11:16 AM\nStill worth it even with audio problems\n\nThe audio direction is wrong at nearly every location in the game. People in front of you sound as if they're talking from behind or your side. Making it that you have to go out of your way to tolerate it.\n\nIf you can get past this the game is a wholesome emotional rollercoaster.\n\nHelpful | 0", "OstisomaFeb 27 at 5:17 PM\nGreat music okay story bad control\n\nEverything I'm holding would spin like crazy. The story is really short and the end feels rushed. Great music. The puzzle hints are useless. I wish the story could be richer and more immersive. There's not many meaningful interactions with the characters. I feel like more of a tool than a friend.\n\nHelpful | 1", "CobeWanApr 1 at 7:53 PM\nSuper adorable and fun!\n\nMy kids and I really enjoyed this interactive world! A must buy!!\n\nHelpful | 1", "TastyTheDogMar 18 at 5:39 AM\nLove these kinds of experiences\n\nGood game, though the directional audio is way off which is constantly distracting and presence-inhibiting.\n\nHelpful | 1", "ItsTm612Mar 5 at 11:25 PM\nThis game is the best\n\nThis game is my favourite virtual reality game EVER! It has a compelling story, cute characters, lovely sound design and so much more, I cant even put into words how much I love this game,\n\nHelpful | 1", "PeckachuFeb 23 at 6:14 PM\n\nGhost Giant is set in a stunningly pretty world, the puzzles are cleverly thought out although they can sometimes be frustrating due to glitches with picking up or holding certain objects. For the few hours it took me to finish this game, I was very immersed and enjoyed it but it has little to no replay value, especially if you've collected all the hidden items during your first play.\n\nHelpful | 2", "Francereviews4Feb 24 at 11:55 AM\nTrouble with the microphone\n\nI like very much this game but I'm having a lot of trouble with the microphone. I can't blow the birds. I've tried to reboot the headset, but it didn't worked. I'm very disappointed.\n\nHelpful | 8", "Askander1Mar 21 at 7:42 PM\nSo good\n\nNot through it all yet but I cant say enough good things about the game. The story is really well done.\n\nHelpful | 1", "BIackfaceMar 31 at 3:58 PM\nGreat game\n\nLots of fun. Immersive. Challenging at parts. Good buy.\n\nHelpful | 0", "emily69Mar 21 at 8:53 AM\nCool game but hard in bits\n\nHad to check a walkthrough twice maybe I just suck. Loved the game real cool\n\nHelpful | 0", "lubensFeb 20 at 10:33 PM\n\ngame look amazing, small glitches with objects but great graphics\n\nHelpful | 8", "ActedarrowFeb 27 at 6:00 PM\nBest VR game i played so far\n\nThe story is fantastic, the problem solving and the puzzle, the characters, graphics, and basiclly everything. This is a must buy for Quest. I was legit crying at the end, thanks for this amazing experience.\n\nHelpful | 0", "JANGO0Feb 22 at 10:38 AM\nLike being in a Pixar Movie\n\nThis amazing games puts you inside a moving story where you are a big character in a small world. Fun for all ages.\n\nHelpful | 3", "richcrandallMar 28 at 1:20 PM\nHighly recommend\n\nCharming and well-crafted story and game elements.\n\nHelpful | 0", "squanchedMar 29 at 11:11 AM\nStunning\n\nWorth every penny; such a great story and concept.\n\nHelpful | 0", "BintryinFeb 24 at 11:45 PM\nLove this game\n\nGreat game played it on ps4 now on the Quest great port well done to the devs\n\nOnly down side is some sound issues not in sync and direction with some of the scenes.\n\nHelpful | 1", "AudiofeverFeb 28 at 4:59 AM\nCant get the birds to go away.\n\nHave tried blowing at the birds but no matter what I do they wont move out of the middle of the road and as such cannot move forward in the game.\n\nHelpful | 9", "ibdashitMar 10 at 3:41 PM\nGhost Giant\n\nThe scenes are amazing, they are very immersive and intuitive.... Everytime I play this game I get lost in another world....\n\nHelpful | 1", "DaleCoopFeb 21 at 1:54 PM\nReally good game but with sounds bug\n\nGreat game, the story and gameplay, but after level 3 the sound dosnt fit with the position of the characters.\n\nHelpful | 8", "MerlinTN23 days ago\nrequires you to pause the game to start.\n\nrequires you to pause the game to start. it won't accept the pause... USELESS\n\nHelpful | 0", "darwins.lastFeb 20 at 9:35 PM\nGood, Pretty Game\n\nGraphics and artistry are exceptionally well done. Charming story with good characters. Gameplay is fine for game of this type. Sometimes seems like a chore or work though. Overall, good experience.\n\nHelpful | 1", "DeathWhinnyFeb 29 at 12:53 AM\nbeautifully designed scenes transport yo\n\nbeautifully designed scenes transport you into a colorful and magical world.\nthe character following gaze goes a long way to draw you in, but i am afraid that lack of interaction with the world and clunky controls (presumably hastily adapted from psvr controllers) break the immersion that could have been and make playing this game a bit of a chore.\nI really hope some of this will be addressed in future updates, and let this charmer really shine the way it should\n\nHelpful | 1", "camtheman109Feb 20 at 6:47 PM\n20/10\n\nWhen I saw the artisticnes of the game and the story makes you feel involved in luies life and you are like his emotion when he is sad you are smaller and big when he is happy\n\nHelpful | 3", "DragonsRage141Feb 25 at 3:47 AM\nAmazing game\n\nWhen it comes to interactive puzzles Im usually not very interested but this game is so interesting figuring out how to solve the puzzles and helping all of the characters\n\nHelpful | 1", "leif_blondellMar 5 at 8:28 AM\nGreat game\n\nLoved every bit in this great game! The characters, environments, puzzles, and the overall look and feel. Buy this, you wont regret it. And with the quest it is so good!\n\nHelpful | 1", "BATTLEKOTFeb 29 at 4:15 AM\nGreat experience and story!\n\nLitatelly I was crying at the end, the story is very good.\nI would like to have Russian subtitles in game, so I will able to share that story with my family.\n\nHelpful | 0", "Kyguy999Mar 26 at 6:56 PM\nAmazing\n\nPlease make a sequel\n\nHelpful | 1", "BarniiBFeb 21 at 7:06 AM\nLoving story\n\nI could not stop my self from crying I had to play the game twice please make more games like this I need to know how there live are now \n\nHelpful | 5", "VR2050Mar 23 at 10:39 AM\nLooks great!\n\nGreat looking and very entertaining!\n\nHelpful | 0", "SW33PSFeb 22 at 5:34 PM\nA 1 minute tutorial?\n\nIt may be a bug, but I cannot get past the intro tutorial? Am I to know a specific magical rune that needs to painted in the stars? I want to play this so bad, but nothing else happens once i hold the home button on the right controller. The menu stays up, and that is all.\n\nHelpful | 2", "TALONTMar 8 at 12:41 AM\n\nThis game was beautiful. It had a very touching story. Very relaxing, game play was great as well. I feel like it is a bit of a children's game. I enjoyed it a lot.\n\nHelpful | 2", "leeleonyFeb 26 at 7:00 PM\nHit or miss with it working with The Mic\n\nIt a cute fun game really I looked forward to playing it .But when it comes to parts of the game you having to blow into the mic its hit or miss it stays disabled even while its enabled very frustrating.\n\nHelpful | 2", "TheBeastRedHeadFeb 23 at 4:37 PM\nVery Emotional\n\nI have never seen a better way of telling a story about friendship and hardships in life. This game truly shows that friends come in different shapes and sizes.\n\nHelpful | 1", "avel228Feb 28 at 3:59 PM\nFun and cute\n\nVery pretty game, cute characters, on the easier side for puzzles. The story is good, but I dont feel like this game has great replay value.\n\nHelpful | 0", "SunnyD504Feb 26 at 6:35 PM\nGreat game, not worth the price.\n\nThis game is extremely well-made. A truly beautiful VR experience. A lovely story. But it's pretty short, with little-to-no replay value. Not really worth $30\n\nHelpful | 19", "Broom_GodFeb 25 at 12:24 PM\nShort, Sweet and to the .\n\nA touching game that is quite quirky. I blew through the game in about 2 hours, but it definitely has replay ability!\n\nHelpful | 1", "Felipe_jesseMar 10 at 3:23 PM\nAmazing\n\nEven though I havent finished it its amazing and has really amazing story arc\n\nHelpful | 1", "Jani1988Feb 21 at 11:56 AM\nWell made\n\nJust by looking at all the beautiful surroundings it's all worth it, very relaxing game! Don't rush, spend some time and enjoy ;)\n\nHelpful | 4", "MarmortronFeb 24 at 5:06 PM\nNot Moss\n\nIf you miss Moss this one wont help. It is visually pleasing and a lovely story. Puzzles are very easy, but sometimes it is difficult to make the solution work . A couple of times I was doubting that my solution was correct. I enjoyed it, but it was very short for the price.\n\nHelpful | 1", "BoringSupernovaMar 8 at 10:19 PM\nAmazing, astounding, phenomenal!\n\n'Twas a rollercoaster; cute, fun, sad, wholesome. I loved every second, it's a must-buy\n\nHelpful | 0", "LibertonyanFeb 26 at 11:19 AM\nGhost Giant\n\nThis is not a game, it's a 2 hr demo of VR tech you've seen and played before. A sweet story s does not compensate for the ridiculously short play time. Refunded.\n\nHelpful | 9", "FinnyWiggenJul 24 at 6:56 PM\nCan't play sitting down!\n\nIt says return trip your play area!! I literally can't stand!\n\nHelpful | 0", "lynnxfitnessMar 10 at 3:12 AM\nBeautiful... Perfect for children!\n\nJust beautiful... Charming. Not making you dizzy. Touching story line.\n\nHelpful | 0", "trotzkindvrFeb 27 at 8:25 PM\nBuy it!\n\nIts great, one of the best story driven games so far, like a 3h animation movie or as the old point and click adventures.\n\nHelpful | 0", "SwifxFeb 22 at 1:10 PM\nAwesome Game!\n\nLove the graphics and everything else, just not worth the price, I feel like $15 would be been good at least. :)\n\nHelpful | 3", "Gthang42Jun 5 at 2:18 PM\nAmazing!\n\nI just started playing this game and oh my lord is it amazing! Everythings so well done. Amazing work yall!\n\nHelpful | 0", "galaxynagaFeb 23 at 11:34 AM\nHeartwarming VR tale\n\nA lovely dive into how you can be both out and inside a story. So fun to follow the story i kept missing the fun collectibles!\n\nHelpful | 0", "55VanStormFeb 26 at 5:08 PM\nInteresting\n\nThis is a game with fun puzzles and interactions with a story that can tug on your heart strings.\n\nHelpful | 1", "dcallaway18Mar 6 at 5:16 PM\n\nA little bit of a learning curve but so cute and very fun.\n\nHelpful | 1", "jswitch808Feb 22 at 2:38 AM\nAwesome\n\nIts a nice break from the FPS games I love. Chill story and interesting dynamic game play. Well done!\n\nHelpful | 2", "NolanIreFeb 27 at 1:31 PM\nSuperb\n\nA beautiful and visually amazing game. Really good game that keeps you busy. Love playing it.\n\nHelpful | 0", "calforbFeb 21 at 12:23 PM\nMagical\n\nAmazing use of VR to create a beautiful game with beautiful environments. Looks stunning on the Quest.\n\nHelpful | 2", "Drb.danielFeb 20 at 11:09 PM\nGreat vr game\n\nAwsome in every way a must have if you liked MOSS\n\nHelpful | 7", "PoisonDoorFeb 28 at 2:06 PM\nIf your microphone doesn't work, ...\n\n... then you have to turn it on in the main settings of your Oculus Quest ;-)\n\nHelpful | 1", "AbashedOwl61May 17 at 12:41 PM\nToo cute to be alive\n\nHonestly the best game I've encountered in VR. Graphics was amazing, the atmosphere was perfect, the design was beautiful, and the story was very heart filling. Loved it 11/10\n\nHelpful | 0", "justanothervrdeviceApr 23 at 5:20 AM\n\nI don't see the point repeating what others have already said about this game so I will summarize it in a single word: Outstanding.\n\nI little tip for anybody who reads this - the quest is able to tell when you are pointing with you finger without needing to push a button ... might just be the information you need for one section late in the game.\n\nHelpful | 0", "GoodBurgerGamerMay 12 at 9:31 PM\nGreat game!\n\nThe art style is really cool and there is lots of stuff to do in the different levels even after you have completed your main task art style Id really nice and has good graphics overall great game\n\nHelpful | 0", "opnotproFeb 23 at 10:09 AM\nThis needs more levels\n\nI have complet all of the levels can sometime add extra levels plz or multiplayer\n\nHelpful | 2", "spooky_boiFeb 22 at 4:02 PM\nhonestly...\n\nBest game I've ever played. it is a little short but it makes up for it with its story.\n\nHelpful | 1", "charles.james.507Mar 7 at 6:29 PM\nAmazing scenery\n\nGreat game for all ages.\n\nHelpful | 0", "johnroper100Feb 25 at 2:08 PM\nVery good and enjoyable\n\nThe game was fun and entertaining.\n\nHelpful | 1", "tjelkeApr 26 at 9:23 AM\nGreat gameplay and story\n\nAt first I did not purchase this game because I thought it would be for kids. I read all the reviews and got it and I am happy I did. The storyline is great and the puzzles are entertaining enough to keep you engaged. And the tug at the heartstrings added complexity.\n\nHelpful | 0", "whatadumbscreenameFeb 21 at 6:00 AM\nIncredible!!!\n\nDidn't know if I would like it... But.. I Love it!!!!\n\nHelpful | 3", "kadenperkinsMar 27 at 12:08 AM\nShort\n\nMy kid completed all the scenes in 2.5 hours...that's ridiculous for the price\n\nHelpful | 1", "Emily55555Feb 21 at 1:48 PM\nAbsolutely magical\n\nI love this world the developers have created.\n\nHelpful | 3", "Mystic_0psFeb 27 at 8:15 PM\nAmazing\n\nBest game Ive played in a while\n\nHelpful | 0", "Golden_bread1776May 8 at 9:00 PM\nCute game\n\nReally cute and fun game to play on your free time\n\nHelpful | 0", "AhemCoughMay 22 at 3:12 PM\nGame not loading\n\nGame not loading past menu button instruction at beginning during game instructions. Not sure where you get hold of anyone to rectify?\n\nHelpful | 0", "MildlyIrksomeApr 18 at 11:35 PM\nWonderful title\n\nExcellent gameplay and a fun concept coupled with lovable characters make for an entertaining and unique title\n\nHelpful | 0", "kristin.mankosMay 21 at 2:56 PM\nCant get pass menu tutorial\n\nHelp i cant figure out the menu tutorial to play the game I try to follow but I am confused?? \n\nHelpful | 0", "charly80Mar 24 at 6:19 PM\nCute ans dreaming\n\nThis magical place will delight your children and the child in you. Some difficulties to apprehend the gestures with the joystick. A feeling of having to follow a story without being able to get out of it. No or little free will and simplistic puzzle. I would try again later to get a better opinion.\n\nHelpful | 0"]