{"App Title": "Gloomy Eyes", "App description": "When the sun got tired of humans and decided to hide and never rise again, darkness awoke the dead from their graves. Since then, the clash between man and zombie sets the pace of daily life.\n \nNarrated by Colin Farrell, Gloomy Eyes is an animated trilogy and emotional tale where fantastical animated dioramas twist and rotate around you. \n\nChase the nostalgic and heartwarming story of a zombie boy, Gloomy, and a human girl, Nena, that dare to play with love. Their star-crossed love might just be the last seed of hope.\n\nPremiered at Sundance Film Festival (2019), was awarded Best VR experience at the Annecy International Animation Film Festival (2019) and winner of the Jury Award for Storytelling SXSW (2019).", "Purchase section": "$7.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Casual, Movie, Narrative", "Languages": "English, Chinese (Taiwan), French (France), German, Spanish (Spain)", "Version + Release Notes": "33", "Developer": "3DAR, Atlas V", "Publisher": "ARTE France", "Website": "https://www.arte.tv/sites/webproductions/gloomy-eyes/", "Release Date": "May 28, 2020", "Developer Privacy Policy": "None", "Space Required": "2.78 GB"}



["5 stars\n68%\n4 stars\n12%\n3 stars\n5%\n2 stars\n7%\n1 star\n8%", "darkuniMay 28 at 6:26 PM\nThis isn't for everyone ... but ...\n\n... for those it IS for? You are in for a true treat.\n\nThis is not a game. There is nothing to DO here. You do not control the camera. You do not advance the story. This is a passive experience.\n\nGorgeous, touching - a neat bit of story-telling wrapped in an enchanting delivery which feels like Moss meets Tim Burton.\n\nIt isn't long; despite being in three parts. The second Act is superb - the carnival is my favorite.\n\nMy value-ratio is $5/hour - and this doesn't come close to that in a single viewing. But anyone that puts this Quest on is going to get to watch it and I think I'll get my money's worth.\n\nPlease, I'll take more. Going to go experience the other one now ...\n\nHelpful | 145", "TransJenderGalJul 5 at 9:11 AM\nVery good story and execution\n\nNon interactive story.\nAwesome narration, Atmosphere, lighting.\nIt's worth revisiting on occasion.\nHighly Recommend\nBest standing or on swivel chair.\n- But pricey. 8.00 is just a tad too much, but still worth it. Grab on sale if such a thing exists on Quest store :P\n\nGraphics 5/5\nSound 4.5/5\nStory 5/5\nFun 5/5\nColin Ferral 10/5\n\nHelpful | 3", "NukemarineMay 29 at 5:09 PM\nBeautiful passive storytelling\n\nImagine if you could watch \"The Nightmare Before Christmas\" or \"Caroline\" in VR, it would feel much like this experience. Surreal and fantastic with a touch of terror and despair fill out this short story. Other passive experiences like this: The Rose, The Matchstick Girl, The Line, and Henry. Active games \"Witchblood\", \"Along Together\", \"Eqqo\", etc. also build on to this diorama experience.\n\nRealize you will not get much viewing time out of this purchase barring replays. It's a short but beautiful experience. Keep that in mind but if you decide to buy you probably will not be disappointed.\n\nTo the developers: Consider a few changes to make this a hand tracking experience. Pause the scene at natural points and put a continue feature such as a line, circle, level, etc to start the next scene. This will also alleviate events where the scene continued behind the viewer and we don't realize it.\n\nAnother addition, during the pauses put visual scale areas where we're put on the scale of the characters somewhere in the scene. Heck, I imagine you could choose a few scenes that can be viewed at full scale. Make these options opened up after the first viewing. These small changes would increase the re-watch factor without any gamification gimmicks.\n\nHelpful | 28", "justanothervrdeviceJun 5 at 3:03 AM\nWent in expecting a game but ...\n\nIt has more in common with a high quality 3D movie ... which for all intents that is exactly what it is.\n\nIf I had of known that from the beginning I may have waited to purchase this but what I have seen shows that it does have a high level of quality - this is a great example of why you should read the full description and some reviews before purchasing something - I have no intention of getting a refund and will come back to this later when I want to watch something a little more unique.\n\nHelpful | 8", "marianairazuMay 30 at 12:25 PM\nBest VR Experience!\n\nThis is amazing!!!\n\nI saw the first episode last year at Sundance and it has been my favorite VR experience since.\n\nI love that Quest is finally integrating narrative stories into its selection, VR should not be limited to gaming.\n\nThe animation is strikingly gorgeous, its impossible to catch the intricate details in just one view. Ill be showing it next time I am introducing newcomers to VR.\n\nI can honestly saw its a must for any Quest owner.\n\nHelpful | 19", "NO-AJul 24 at 9:04 AM\nTim Burtonesque Short Film\n\nFor those who love Tim Burton Animation Movies.\n\nIt's one of those many little VR experiences, many are fascinating. This one comes in 3 Chapters and it's a more gloomy experience. It's for people love movies like \"Nightmare Before Christmas\" and co. Like me. I was quite fascinated by the Narrative and Animations.\n\nSo it's maybe not for everyone. There is also no interaction. It's a VR Movie, it's possible to walk around and look into things closer and from all angles, but that's it.\n\nHelpful | 1", "shashking404Jun 6 at 5:40 PM\nawesome spatial, lacks media controls\n\nthis is a non interactive experience... so GIVE Me option to skip ahead done non interesting areas. refer HENRY to understand how important it is to have option to skip few seconds.\n\nhand tracking support is crucial for passive VR but implementation needs work. CURIOUS CASE OF PETS have great buttons which can be touched by hands.\n\nwhere is the menu option for accessing buttons like back button, pause button, subtitles?\n\nthe environment in the game is awfully dark so half of the Characters and their animation is never visible. i wish this had been shaded lighting to overcome the LIMITATION OF QUEST platform.\n\nso much of the narration is lost over the noise of onscreen stuff, it is a shame, such a shame.\n\nHelpful | 4", "nscc_oculusMay 30 at 3:38 AM\nGreat animated short film\n\nThis is not a game but a great example of spatial storytelling in room scale VR. If you enjoy short animated films, great character design and quirky stories then this is a welcome break from action packed gaming. The choreography and composition elegantly moves you around your play space and allows you to literally stick your head into the characters world. The creative playground of VR has space for lots of new experiences and more like this are welcome to see where it can go in the future.\n\nHelpful | 11", "kippieq3 days ago\nFun Video\n\nIf youre just looking for a fun story without any actual gameplay then this is it for you. Definitely worth the pocket change!\n\nHelpful | 0", "Darkspaceinvader10 days ago\nGloomy Eyes and ears\n\nGloomy Eyes is a short Tim Burton-esque animated tale that is viewed as a diorama and is narrated by Colin Farrell. The animation itself looks lovely for the most part. However, as pretty as the visuals are, they are spoiled somewhat by the limitations of the Quest's lenses*. At times, especially in episode 2, the contrasts between areas of dark and light made it look like you were looking at the diorama through a sheet of fabric: it looked dreadful. Thankfully it didn't happen all the time but given that it didn't happen all the time I'm wondering why it had to happen at all? Perhaps the developers could adjust the lighting to negate these effects or at least reduce them?\n\nThe story itself is a rather muddled affair, presumably because it's such a short three part story. It's also as derivative as the style of animation it seeks to emulate. That's not necessarily a negative but if you don't like Tim Burton's films then you won't find anything that appeals here either.\n\nThe audio mix is not good at all. It sounded muddy like there was little separation between the different audio components. The narration was also too quiet, especially in the beginning. I tried headphones and the built in speakers to check if there was much difference. There wasn't and so I had gloomy ears.\n\n\nIf you like Tim Burton films, and can overlook it's shortcomings, then it's maybe worth checking out. I'd recommended waiting until it's on sale however.\n\n*Since writing this I've played Moss. That game has plenty of dark areas that do not suffer from the issues plaguing the visuals in Gloomy Eyes.\n\nHelpful | 1", "TigercaronJul 17 at 7:46 PM\nEntering into a wonderful dark world\n\nIf you loved Edward Scissorhands or the Corpse Bride movies, this is for you. Sit in a swivel chair and be prepared to follow the story as it leads you into the delightfully warped stop motion animation of Gloomy Eyes. There is so much going on you may have to watch it more than a single time to taste the rich flavor of the cryptic atmosphere. All I can say is, \"More? Yes please!\"\n\nHelpful | 0", "nishruu25 days ago\nwas for me\n\nwell done, well executed, nice little story.\nit is a passive story; you watch.....\ni like the experiences as well as the games.\n\nHelpful | 1", "blp7029 hours ago\nAmazing experience\n\nPerfect escape for anyone that enjoys good visuals and story telling.\n\nHighly recommend with an edible\n\nHelpful | 0", "BloomieBloom1Jun 17 at 1:51 AM\nWell worth the money\n\nThis is basically a wonderful, short film and a glimpse into the future of how we will watch an entire feature film. I recommend watching it on a swivel chair (certainly not important though) because when scenes end a new one starts 45 degrees to the side. Whats beautiful is that a scene will end with something moving or flying to the right, causing your eyes to follow it and then the next scene magically appears. The graphics are stunning and the story is inventive and charming. When you think how expensive most good games are its definitely worth owning. I just wish it was much longer even itll be three times the price so I could fully immerse myself into it. Hopefully the profits will allow them to make a new, much longer one.\nThank you for this beautiful experience, I eagerly await your next project.\n\nHelpful | 4", "Vanessa_TMay 29 at 7:31 AM\nA must !\n\nI first discovered Gloomy Eyes at the Anima film festival in Brussels and the story totally blew up my mind!\nI was amazed by this beautifully dark story, which reminded me the style of Tim Burton, by the dynamic of the story evolving all around me, and by these cute little characters which seemed almost alive!\nIt was an incredible experience and its actually because of that movie that I developed a new obsession: I had to have a VR headset one day (which I got a few months after) :)\n\nI only regret one thing: because of the limitations of the Quest (at the festival they used a Rift I think), the quality is not as good as on a PC. On the Rift it was so wonderfully detailed that I could almost count the stones on the pavement, but on the Quest the surroundings (floors, mountains) have been kind of smoothed.\nNonetheless its still a beautiful story which one has to see at least once!\n\nHelpful | 7", "j.t8-6Jun 4 at 9:48 AM\nA lovely unique story\n\nFrom a technical side, outstanding, the animation along with the 2D and 3D rendering makes you feel as if the story is physical occurring right in front of you in a way no other story driven game has done from what Ive experienced. Colin Farrell narration is perfect for the offbeat story and fits the story rather well. Although there are no words spoken the emotions of each character is perfecting drawn and render that you understand what each person is feeling whether it be a good or bad emotion. The overall story leads you to hope that what the two main characters have you will one day have yourself.\n\nHelpful | 4", "snappaheadJun 10 at 2:20 PM\nBeautiful!\n\nThis is a wonderful short story that fills a very real void in this new medium. A beautifully crafted tale that had me locked in all the way through. Cute, charming and always visually engaging. This was created with love and it shows. I can only hope that we see more from this team because this short really shows the potential of narrative driven VR experiences. Bravo!\n\nHelpful | 3", "wescotteJun 18 at 3:24 PM\nExcellent 6dof passive short film\n\nRuntime is just over 20 minutes and it looks and sounds amazing. The environments and atmosphere are top notch. Great way to demo a Quest/VR to a non gamer.\n\nThey did a good job of making it easy to follow the action and some interesting transitions between scenes/locations. My only gripe in terms of execution is I would have liked to see them experiment with world scale. We never really get close to the characters and even if you lean in they are still very tiny. I think letting the viewer adjust the world scale on the fly would have been a nice touch.\n\nThe sound is incredible but there are a few moments where it drowns out the narration. Also, a \"play all\" feature would have been nice as it's not really long enough where the average person wouldn't just watch the entire thing in one go.\n\nHelpful | 2", "someofamitchJul 29 at 6:53 PM\nFun story\n\nAt some points i didnt quite follow but overall its got a nightmare before X-mas fell!\n\nHelpful | 0", "TVL1977Jul 14 at 3:01 PM\nBeautiful story!\n\nAfter lots of bugs not being able to watch the last chapter I finally made it to the end..... And I must say, the story is very beautiful. Sometimes it's quite dark what makes it not the best of quality image.... But this is due to the performance of quest itself. (probably the bugs also were connected to the fact of update 18 on quest with lots of problems as a result)\nDefinitely well worth buying...especially as it's been nomitated for the Emmys!\n\nHelpful | 2\nDeveloper ResponseJun 9 at 12:21 AM\n\nHi TVL1977! Dev team is aware of that issue and we'll be pushing a new update very soon, stay tuned!", "krisvdvijverJun 10 at 12:53 AM\nBeautiful story and graphics\n\nThis animated short is right up there with the best, so If you like beautiful (non or semi interactive) animated VR shorts (featuring a diorama view) like The Line and Allumette, you will love this one for sure. For all kids 9-99y.\n\nHelpful | 4", "koolKatxxMay 28 at 4:13 PM\nUmm\n\nInteresting story but only handtracking there was , was in the menu to choose a chapter ... not worth money if you expect any handtracking playing , its pretty much just a story . I couldnt even get refunded and I wasnt even In it for a full hour .....\n\nHelpful | 16\nDeveloper ResponseMay 29 at 8:02 AM\n\nHi koolKatxx, I want to apologize for the confusion about the hand tracking capabilities. Weve arranged with Oculus to get it removed from this category to avoid it being misleading. Thank you for your comment, a lot of heart went into the creation of this project and we want to make sure those who have the opportunity to experience Gloomy are not disappointed, so we really appreciate the feedback. Thank you!", "mkrajeski09Jul 26 at 6:25 PM\nAn amazing experience but...\n\nIt's a wonderfully crafted experience. And definitely something you wouldn't expect. Beautiful narration and an interesting tale...however both the second and third acts crash the app. Hopefully this will be fixed with an update. Until then, it's a Unfortunately incomplete experience.\n\nHelpful | 1", "ROTOMONKEEJun 19 at 12:13 PM\nStorytelling Gem\n\nBeautiful, engaging, emotional. Masterful storytelling with a moving narration and score. Yes, it is a passive experience; the polar opposite of the \"shoot 'em up\" genre. However, it is also one of the most moving VR journeys I've ever had.\n\nAlthough short, I HIGHLY recommend sharing the adventure with these wonderful characters.\n\nHelpful | 1", "rpavonJun 13 at 3:19 AM\nGloomy Eyes redefines VR storytelling\n\nIt's hard to describe the impact of Gloomy Eyes without trying it. The way this VR story is told is a masterclass of inmersive narrative that makes you want to inhabit that world forever. Bring more like this, please!\n\nHelpful | 5", "Maud-ClavierJun 4 at 11:27 PM\nImpressive Graphics!\n\nIt's one of the best VR narrative I've experienced so far.\nThe graphics and staging are really aesthetic, it's a \"dollhouse\" Vr experience so you can turn around this cute little world.\nIt's such an original visual universe, it's definitly a \"must see\".\n\nHelpful | 3", "arikaplanJun 28 at 6:56 PM\nStunning and immersive story\n\nBeautifully rendered movie in three parts. The storyline great and the visuals engrossing. Loved walking around seeing different angles and moving closer and farther. If you enjoy storytelling youll\nlove it\n\nHelpful | 0", "SoulhikeJun 14 at 7:59 AM\nWhy not Crossbuy with Rift...\n\nfor people with gaming PC for better quality? The Quest Version is meh OK but the Rift version ist much much much better. Please do crossbuy for Oculus user. For Quest users third the price for the third of the experience.\n\nHelpful | 4", "BenGeskinJun 2 at 1:07 PM\nBeautiful Story\n\nIts like you are sitting and watching a puppet show going all around you. Its dark, but beautiful  Second chapter was something  Looking forward to more stories like this!\n\nHelpful | 3", "stephen-burnsJun 24 at 8:59 AM\nIt's Ok\n\nIt's a fun story but for me it was all just a bit too dark as in the lighting made it hard to see. Also the size of the characters and set made seeing them difficult too - they looked miniature. I was expecting something that was more full sized so it was a little disappointing to find it was scaled down so much. The sun was great character though and because he was bigger he was much easier to see. I'm glad i purchased this because i want to encourage more of these VR films, i think they have great potential and i appreciate we're probably at the start of this type of media. I think it will get better and more interesting as time goes by.\n\nHelpful | 1", "psydzlJun 21 at 9:15 AM\nWeighed down by a barrage of cliches\n\nThis is not a VR experience. It's a 3D movie that weighs on you like lead. It's unbearably pretentious. It tries to be profound, but all it does is pile on cliche after cliche. This would be ideal for someone who is deeply stupid. I found it unwatchable.\n\nHelpful | 2", "okeyoneMay 29 at 2:21 PM\nOculus must have.\n\nNo hand tracking .... was a mistake. Just enjoy the story and have a wonderful experience. Please don't buy then cry.\n\nHelpful | 5", "ZaphodBeeblebroxxJun 4 at 5:10 AM\nFantastic\n\nIt's not a game but a story. Get up close to each act so that you can enjoy the detail. I watched it seated the first time and stood and moved closer the second. Much better up close.\n\nHelpful | 2", "swaoJun 22 at 11:37 AM\nAmazing like walking in a dream !\n\nDo it as fast as you can, it's really a unique story conducted with a magnificent universe and such a cute character, it can be dark but so inviting.\n\nHelpful | 1", "wgdMay 31 at 11:20 AM\nGreat Story\n\nThis application takes you on a magical ride with its excellent animation and story. I would have liked to see more interaction with the story but very much enjoyed it nevertheless.\n\nHelpful | 2", "richards.113Jun 3 at 2:55 PM\nExcellent\n\nA film, no game. A great story with living claymation miniatures in the style of Tim Burton's \"A Nightmare before Christmas.\" Beautiful visuals.\n\nHelpful | 3", "Aaronb3434May 28 at 8:42 PM\nCool\n\nEven though I gave it 5 stars it would had been better if this was made into a actual game. also wheres the hand tracking?\n\nHelpful | 3", "NayaJun 1 at 12:53 PM\nBeautiful short animation\n\nImmersive living tiny world with great artistic universe\n\nHelpful | 4", "Lala-JoyrideJun 3 at 1:15 PM\nTruly an incredible experience\n\nA very unique and emotional experience to watch. Well done to the development team on this!\n\nHelpful | 2", "MightyQuinnJ2 days ago\nThe way all story telling should be!\n\nThis is an incredible & immersive 6dof animated story that has so much depth and heart! The way they bring the story alive all around you is simply mind blowing! A MUST HAVE EXPERIENCE\n\nAnd Colin Farrell does such a great job!!\n\nHelpful | 0", "JimZMJun 18 at 12:09 AM\n\nbeautiful, dark, eery, short\n\nHelpful | 0", "julien.mokraniMay 29 at 6:23 AM\nNarrative !!!\n\nFinally a story in VR ! Beautiful !!!\n\nHelpful | 1", "Mom2jJun 10 at 8:18 PM\nApp keeps crashing on chapter 2\n\nI love the graphics and story. But I am still having issues with Chapter 2 & 3. I gave no idea how the story ends!\n\nHelpful | 1", "chronictiaJun 1 at 7:17 PM\nUpdate froze my Quest!\n\nGloomy eyes updated and now my Quest is stuck on their loading page and can't move from there!! Tried turning the headset off but I cannot. GE has totally taken over my quest, and I don't know what to do! Can anyone help me???\n\nHelpful | 1\nDeveloper ResponseJun 9 at 12:19 AM\n\nHi chronictia! Thanks for reviewing Gloomy Eyes. Dev team is aware of that issue and we'll be pushing a new update very soon, stay tuned!", "TomC_963 days ago\nHow to enjoy when it keeps crashing?\n\nIt is difficult to stay immersed in the story when the whole things keeps crashing and you have to start all over again. It becomes pretty annoying when you see the beginning of episode 3 for the fifth time...\nFirst app for me on the quest that keeps crashing over and over ...\n\nHelpful | 0", "nickthompson35May 28 at 8:12 PM\nPart 2 wont load!\n\nPart 1 worked just fine and when I go to load up part 2 it glitches out every time and the game either crashes or my quest restarts.\n\nHelpful | 3\nDeveloper ResponseMay 30 at 8:28 AM\n\nHi! A new update correcting this issue is live! Thank you!", "beuno25 days ago\nThere is nothing quite like this\n\nGloomy Eyes is something special. The story telling traps you in a way that takes advantage of all the useful tools available in VR.\nIt's a story which you get to watch unfold in front of you, beautifully told.\nI hope there's more to come.\n\nHelpful | 0", "Funkybeat853 days ago\nVery cool\n\nSo cool how get to be close in a miniature world! The scenes are awesome! Best $7 I spent in a long time!\n\nHelpful | 0", "MrButterfly69.fl22 days ago\nBeautiful\n\nAMAZING !!!! ITS TOTALY A ONE OF A KIND AND it don't matter how old U are this is spectacular !!!and truly an experience I want to share with my friends !!Thanx Collin u did a Fantastic Job!!!\n\nHelpful | 0", "john.skipper.64May 31 at 11:14 AM\nPretty but crashes Quest\n\nJust bought this yesterday, but can only watch Act 1. Act 2 crashes on start up. Devs said this was fixed , but clearly not.\n\nHelpful | 1\nDeveloper ResponseJun 9 at 12:20 AM\n\nHi john.skipper.64! Thanks for reviewing Gloomy Eyes. Dev team is aware of that issue and we'll be pushing a new update very soon, stay tuned!", "Metalmanextreme24 days ago\nIf the 2nd and 3rd chapters worked\n\nIt would probably get a 4 or 5 stars.\nIt seems like a wonderful idea and is quite amazing for what I've seen of it, it has a simple story but the depth added by VR makes up for it.\nIt gives me hope that more main stream cinema will approach VR with the same inspiration. Hopefully an update will be pushed and chapters 2 and 3 will be functional so I can see how the story ends.\n\nHelpful | 0", "Harry_0May 31 at 1:58 PM\nCrashes when connecting to Chapter 2,\n\nSadly can't get chapter 2 to work.\n\nHelpful | 2\nDeveloper ResponseJun 9 at 12:19 AM\n\nHi Harry_O! Thanks for reviewing Gloomy Eyes. Dev team is aware of that issue and we'll be pushing a new update very soon, stay tuned!", "paulclementiJun 2 at 6:33 PM\nNot worth the money\n\nVery diapointing\n\nHelpful | 1", "JohnReeseEMay 28 at 3:19 PM\nWheres the hand tracking?\n\nIs the hand tracking that this app uses solely limited to the settings? Picking a language and chapter? Im 5 minutes in and basically just watching an immersive story\n\nHelpful | 6\nDeveloper ResponseMay 29 at 8:02 AM\n\nHi JohnReeseE, We want to apologize for the confusion regarding the hand tracking capabilities. Weve arranged with Oculus to get it removed from this category to avoid it being misleading. Thank you!", "erasmushurtMay 29 at 4:08 AM\n\nIt's good quality but pretty short.\n\nHelpful | 0"]