{"App Title": "Gravity Lab", "App description": "Build Your Incredible Machine - Gravity Lab would like to introduce our new range of gravity modifying appliances!\n\nNo matter how fast or how heavy your objects are, we can move them! Save money and time by replacing your entire human workforce with automated appliances from Gravity Lab. Currently awaiting regulatory approval, we invite you to visit our testing facility and give them a go! We have prepared a selection of test scenarios for you and we are certain you can solve them!\nAlso feel free to create your own test scenario and share them with fellow participants!\n\nPlease be aware that strong gravitational forces can cause a looming feeling of being observed! Never look directly at the emitted particles! While we tried our best to avoid the creation of micro wormholes, please never try to stack gravitational objects. All damages to the time and space continuum and all involved repair costs will be passed on to you!\n-- Gravity Lab Management", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Educational, Puzzle, Space/Universe", "Languages": "English", "Version": "1.10.21", "Developer": "Mark Schramm", "Publisher": "Mark Schramm", "Website": "http://gravitationaltestingfacilityandobservations.com/", "Release Date": "August 20, 2020", "Developer Privacy Policy": "Privacy Policy\n\nThis privacy policy discloses the privacy practices for the use of \"Gravity Lab - Gravitational Testing Facility & Observations\" henceforth referred to as \"Application\". This privacy policy applies solely to information collected by this Application. It will notify you of the following:\n\nWhat personally identifiable information is collected from you through the use of the Application, how it is used and with whom it may be sharedand what choices are available to you regarding the use of your data.\n\nThe application has the functionality to capture images via the built in screenshot camera and will store the files in your photo library.\n\nThe application has the functionality to load music from your music library and therefore requires access to it.\n\nBy using the Application, your public platform username or gamertag and level score will be transmitted for us in order to create highscore lists. The application submits a list of the usernames of your friends to our server infrastructure to retrieve friends highscore lists.The applicationuses Unity analytics to collect anonymized data such as what levels were played and items used.\n\nWe only have access to/collect information that you voluntarily give us by using the Application. We will not sell or rent this information to anyone.\n\nWe will not share your information with any third party outside of our organization, other than as necessary toprovide the services required to use the Application.\n\nBy using the application without an active internet connection, the application will not send your username or friends lists to our server.\n\nUpdates\n\nOur Privacy Policy may change from time to time and all updates will be posted on this page.\n\nIf you feel that we are not abiding by this privacy policy, you should contact us immediatelyvia email: privacy@gravlab-game.com", "Developer Terms of Service": "1. YOU MUST AGREE TO THIS TERMS OF SERVICE AGREEMENT BEFORE USING OUR WEBSITE AND/OR PLAYING OUR GAMES\n\nThis Terms of Service Agreement (Agreement) informs you of the terms, conditions, disclaimers, notices and policies (collectively the Terms) that apply to your access and use of the website of Mark Schramm. (Mark Schramm), located at the URL www.mark-schramm.com (Site) and any and all games and related products, including virtual goods, provided by Mark Schramm(Games). Collectively, the Site and the Games are referred to as the Services in this Agreement. Many of these Games may be playable by one or more persons simultaneously (each a User and collectively Users), and the conduct of all such Users while playing the Games or using the Site is governed by this Agreement.\n\nThis Agreement is a binding contract between you and Mark Schramm that provides for important rights and obligations. By accessing, browsing, and/or using the Services and/or playing, downloading or browsing our Games you represent to Mark Schramm that you have read, understood and agree to be bound by this Agreement and all applicable local, state, national and international laws and conventions, including without limitation all intellectual property laws. Mark Schramm reserves the right, at its sole and absolute discretion, to deny any User access to the Services, without notice. If you violate any of the Terms, we may, at our option, give you a warning notice of violation or terminate your account immediately for violation of the Terms.\n\nIF YOU DO NOT AGREE TO ALL OF THESE TERMS, YOU MUST NOT ACCESS OR USE THE SITE OR ACCESS OR USE OUR GAMES.\n\n2. ELIGIBILITY TO ACCEPT AGREEMENT AND USE THE SITE\n\nYou must be at least 13 years of age to access and use the Services. There is no exception to this requirement. Mark Schramm does not knowingly collect any personal information from children under the age of 13 that falls within the Childrens Online Privacy Protection Act and Rule. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legal parental or guardian consent, and that you are fully able and competent to understand and accept this Agreement as a binding contract and to abide by all Terms.\n\n3. MARK SCHRAMMS RIGHT TO MODIFY AGREEMENT\n\nMark Schramm may modify this Agreement at any time, with or without notice to you, by posting the modified Agreement on the Site. Your continued use of the Services after such modification shall be deemed to be your acceptance of any such modification. Any such modification will only apply to matters and events which occur following the date of modification. You may not modify this Agreement without the prior written authorization of an officer of Mark Schramm. It is your responsibility to check this Agreement regularly to determine whether the Agreement has been modified. IF YOU DO NOT AGREE TO ANY MODIFICATION OF THIS AGREEMENT YOU MUST IMMEDIATELY CEASE USE OF THE SITE AND UNINSTALL ANY GAMES YOU MAY HAVE INSTALLED ON YOUR COMPUTER OR OTHER INTERACTIVE DEVICE OR PLATFORM.\n\n4. MARK SCHRAMMS OWNERSHIP OF THE SERVICES AND PROPRIETARY MATERIALS\n\nThe Services contain copyrighted material, technology, trademarks, service marks, trade secrets and other proprietary information, which may include computer code, text, data, video, images, illustrations, animations, sounds, musical compositions and recordings, audiovisual effects, color schemes, business methods and methods of operation, concepts, ideas, know-how, moral rights, and any related documentation (collectively the Proprietary Material). All intellectual property rights to the Proprietary Material, including patent, copyright, trademark and trade secret rights, are owned or licensed by Mark Schramm. You agree not to copy, download, reproduce, republish, upload, post, transmit, perform, display, distribute or sell, or in any other way exploit the Proprietary Material, or to participate with or to encourage others to engage in such acts, without the prior written consent of Mark Schramm. Moreover, you may not reverse engineer, disassemble, decompile, or translate any computer software programs that comprise Proprietary Material, or otherwise attempt to derive the source code of such programs, except to the extent allowed under any applicable law. If applicable law permits such activities, any information so discovered must be promptly disclosed to Mark Schramm and shall be deemed to be the confidential proprietary information of Mark Schramm. Nor may the Proprietary Material, or any portion thereof, be modified or used for any purpose other than as expressly authorized in this Agreement. The Proprietary Material may include materials licensed by Mark Schramm from third parties. The licensors of those materials are an intended beneficiary of this Agreement and may enforce their rights in the event of any violation of this Agreement.\n\nALL RIGHTS NOT EXPRESSLY GRANTED TO YOU IN THIS AGREEMENT ARE RESERVED BY MARK SCHRAMM AND ITS LICENSORS.\n\n5. OWNERSHIP OF IDEAS INVENTIONS AND USER SUBMISSIONS INCLUDING USER-GENERATED CONTENT\n\nThe Services provide you with access to a variety of resources, materials and downloads, and may allow you access content made available by Mark Schramm and other Users. Such content may include, without limitation, game levels, content creation tools, audio, video, film, music, text, communications, software, graphics, images, and information. All such content made available by you or by other Users of the Services is referred to in this Agreement as User-Generated Content. As between Mark Schramm and you, you own the copyright in any User-Generated Content that is exclusively created by you. You expressly acknowledge and agree that any User-Generated Content that you make available through the Services may be made freely available by Mark Schramm to others, including without limitation for download by others.\n\nYou further acknowledge and agree that this permission is made and granted by you in consideration of your use of the Services, and that this permission constitutes a world-wide, nonexclusive, perpetual, royalty-free, irrevocable and transferable license to Mark Schramm to use, copy, perform, display and distribute such User-Generated Content, and to grant and authorize sublicenses of such User-Generated Content to others.\n\nAll comments, feedback, suggestions, gameplay features, level designs, and other submissions (User Ideas) disclosed, submitted, or offered to Mark Schramm shall be the exclusive property of Mark Schramm. Unless otherwise prohibited by law, Mark Schramm may use, sell, exploit, or create derivative works from these User Ideas and, further, Mark Schramm may disclose these User Ideas to third parties or the general public, without compensation to you.\n\nYou acknowledge that User Ideas and User-Generated Content are provided by you on a completely voluntary basis. Should you not wish to have your User Ideas or User-Generated Content incorporated into any game or website functions, you may choose not to share them with Mark Schramm on the Site.\n\n6. TERMINATION OF GAMES OR SERVICE\n\nMark Schramm may terminate access to any or all Games and/or Services at any time by giving you notice of such termination within the time period specified when you consented to the Services, or if no time period for notice of termination was specified, then no less than thirty (30) days of the date such notice is either provided to you, at Mark Schramms discretion, either by email or by posting on the Site.\n\n7. PROHIBITED USER-GENERATED CONTENT\n\n(a) constitutes or includes any illegal or unauthorized copy, in whole or in part, of another persons copyrighted or copyrightable work, discloses trade secrets without authorization, or otherwise violates the proprietary rights of a third party;\n(b) misrepresents the source or identity of any material;\n(c) is unlawful, obscene, defamatory, libelous, threatening, abusive, harassing, promotes racism, bigotry, hatred or physical harm of any kind against any individual or group, or encourages any other conduct that would be considered a criminal offense, creates civil liability, or is otherwise offensive to Users of the Services or is otherwise inappropriate;\n(d) violates the rights of privacy or publicity of any person;\n(e) is false or deceptive;\n(f) displays pornographic or sexually explicit material of any kind;\n(g) includes material that exploits people under the age of 18 in a sexual or violent manner;\n(h) is an advertisement or solicitation to sell a product or service to Users of the Site, or constitutes any other commercial use of the Site, without the prior written consent of Mark Schramm;\n(i) is unlawful under the laws of the United States or any individual state or locality, the laws of any foreign jurisdiction, or any international treaty or convention; or\n(j) interferes with the proper functioning of the Services or the Site, or violates any other of the Terms of this Agreement.\nYou should not post any User-Generated Content if you are in doubt about its legality or its prohibition by the Terms.\nYou acknowledge that Mark Schramm is a service provider that may allow Users to interact online regarding topics and content self-chosen by the Users. Mark Schramm does not endorse any User-Generated Content or any opinion, recommendation or advice that may be expressed. Mark Schramm generally does not regulate and shall have no obligation to monitor any User-Generated Content. Nonetheless, Mark Schramm and its agents shall have and reserve the right to monitor any User-Generated Content from time to time for any lawful purpose. Mark Schramm may, without notice to you, remove or block any User-Generated Content, including disabling access to such User-Generated Content. Mark Schramm also may terminate your access to the Site and refer the User-Generated Content to law enforcement if it is in violation of any state, federal or local law.\n\n8. PROHIBITED USER CONDUCT\n\nSubject to the permitted use of the Services granted in this Agreement, you may not, in whole or in part, copy, photocopy, reproduce, translate, reverse engineer, derive source code from, modify, disassemble, decompile, or create derivative works based on the Service, or remove any proprietary notices or labels from the Service. Failure to comply with the restrictions and limitations contained in this Section 8 will result in the immediate, automatic termination of your access to the Services and may subject you to civil and/or criminal liability.\n\nYou further agree that you will not, under any circumstances:\n\n(a) frame or otherwise display any portion of the Services or its contents that is not your User-Generated Content without prior authorization;\n\n(b) sell, grant a security interest in, or transfer reproductions of all or any portion of the Services to other parties in any way not expressly authorized herein, nor shall you rent, lease or license all or any portion of the Services to others;\n\n(c) exploit the Services or any of its parts for any commercial purpose whatsoever without the express prior written authorization of Mark Schramm;\n\n(d) host, provide or develop services for or using the Services, or intercept, emulate or redirect the communication protocols used by Mark Schramm in any way, including without limitation through protocol emulation, tunneling, packet sniffing, modifying or adding components to the Services, use of a utility program or any other techniques now know or hereafter developed, for any purpose, including without limitation unauthorized access in any form over the Internet;\n\n(e) facilitate, create or maintain any unauthorized connection to the Services, or any portion thereof, including without limitation any connection to any unauthorized server that emulates, or attempts to emulate, the Services. All connections to the Services, or any portion thereof, may only be made through methods and means expressly approved by Mark Schramm. Under no circumstances may you connect, or create tools that allow you or others to connect to the Services, or any portion thereof, other than those expressly provided by Mark Schramm;\n\n(f) to develop or allow any malware, adware, spyware, Trojan Horses, cancelbots, other automated bots, auto players, cheat utilities, spoofers, keyloggers, or other circumvention devices to be present on any machine used to access the Services; and/or to attempt to upload/utilize such devices against the Services;\n\n(g) use vulgar, obscene, pornographic language or other behavior while in the forums, chat rooms, or other public areas that will disrupt the User experience in those areas of the Site;\n\n(h) use the Services in connection with any contests, surveys, chain letters, pyramid schemes or other similar services, whether or not they are used for commercial gain;\n\n(i) collect, harvest, scrape or capture any User information, email addresses or other personal data of the Users to send unsolicited emails or any other communication, whether this is done for commercial gain; or\n\n(j) use the Services in a manner prohibited by any applicable law or government regulation, or by the Terms.\n\nMark Schramm expressly reserves the right to monitor any/all network traffic between the User(s) and the Services to prevent the use of said means to compromise the Services\n\n9. GENERAL DISCLAIMERS\n\n(a) THE SERVICES AND ANY ACCOMPANYING DOCUMENTATION AND MATERIAL ARE BEING PROVIDED TO YOU AS IS WITHOUT WARRANTY OF ANY KIND WHATSOEVER. WITHOUT LIMITING THE INTENDED GENERALITY OF THE PRECEDING SENTENCE, MARK SCHRAMM DOES NOT WARRANT THAT THE SERVICES OR ANY PORTION THEREOF (i) WILL BE UNINTERRUPTED, SECURE OR ERROR FREE, OR THAT DEFECTS WILL BE CORRECTED; (ii) IS COMPATIBLE WITH ANY SOFTWARE, INCLUDING WITHOUT LIMITATION INTERNET BROWSER SOFTWARE; (iii) IS FREE OF INFECTION BY VIRUSES, WORMS, TROJAN HORSES OR ANYTHING ELSE MANIFESTING CONTAMINATING OR DESTRUCTIVE PROPERTIES; OR (iv) IS FREE OF DEFAMATORY, DEROGATORY OR ADULT-ORIENTED MATERIAL, OR MATERIAL THAT SOME INDIVIDUALS MAY DEEM OFFENSIVE OR OBJECTIONABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, Mark Schramm DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE.\n\n(b) Mark Schramm IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OR OFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL Mark Schramm BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURY OR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATED CONTENT POSTED ON THE SITE OR TRANSMITTED TO ANOTHER USER, OR ANY TRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINE OR OFFLINE.\n\n(c) THE SERVICES ARE CONTROLLED AND PROVIDED BY Mark Schramm FROM ITS FACILITIES IN THE UNITED STATES OF AMERICA. Mark Schramm MAKES NO REPRESENTATION THAT THE SITE OR THE SERVICES ARE APPROPRIATE OR AVAILABLE FOR USE IN OTHER LOCATIONS. IF YOU ACCESS OR USE THE SITE OR THE SERVICES FROM OUTSIDE THE UNITED STATES, YOU DO SO VOLUNTARILY AND ARE RESPONSIBLE FOR COMPLIANCE WITH THE LAWS APPLICABLE TO YOUR LOCATION.\n\n10. LIMITATION OF LIABILITY\n\nTO THE FULLEST EXTENT ALLOWED BY LAW, Mark Schramm, INCLUDING ITS OFFICERS, DIRECTORS, SHAREHOLDERS, EMPLOYEES AND AGENTS, SHALL NOT BE LIABLE TO YOU FOR ANY DAMAGES OF ANY KIND, INCLUDING BUT NOT LIMITED TO DIRECT, INDIRECT, COMPENSATORY, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF THE SERVICES, EVEN IF ADVISED OF THE POSSIBILITY OF SAME. YOU UNDERSTAND AND AGREE THAT Mark Schramm CANNOT AND WILL NOT BE RESPONSIBLE FOR ANY LOSS OF YOUR USER GENERATED CONTENT OR ANY INTERRUPTIONS OF SERVICE, INCLUDING BUT NOT LIMITED TO ISP DISRUPTIONS, SOFTWARE OR HARDWARE FAILURES, OR ANY OTHER EVENT WHICH MAY RESULT IN A LOSS OF DATA OR A DISRUPTION OF SERVICE.\n\n11. LINKS TO THIRD-PARTY WEBSITES\n\nSolely as a convenience to Users, Mark Schramm may provide links on the Services to other websites ownedby third-parties. Unless otherwise expressly stated, Mark Schramm does not endorse or control these third-party websites and assumes no responsibility for them or the content contained therein.\n\n12. EQUITABLE REMEDIES\n\nYou acknowledge and agree that money damages would not be a sufficient remedy for any breach orthreatened breach of this Agreement by you. Mark Schramm shall be entitled to seek equitable relief, including a preliminary and final injunction and specific performance, as a remedy for any such breach. Such remedies shall not be the exclusive remedies for a breach by you, but shall be in addition to all other remedies available to Mark Schramm at law or in equity.\n\n13. INDEMNIFICATION\n\nTo the maximum extent permitted by law, you agree to defend, indemnify and hold harmless Mark Schramm, its offers, directors, employees and agents, from and against all claims, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to attorney fees) arising from your use of the Services, your violation of any of the Terms, your violation of any third-party right, including without limitation any copyright, trade secret, privacy or property right, or any claim that your User-Generated Content caused damage to a third-party. This defense and indemnification obligation will survive this Agreement and your use of the Services.\n\n14. GENERAL PROVISIONS\n\nYou agree that the Services shall be deemed exclusively based in the State of California, USA, and this Agreement shall be deemed to have been made and executed exclusively in the State of California. Any dispute arising out of this Agreement shall be resolved in accordance with the laws of the State of California without reference to its conflict of law provisions. You agree that any claim asserted in any legal proceeding by you or Mark Schramm shall be commenced and maintained in any state or federal court located in Los Angeles County, State of California, USA, having subject matter jurisdiction with respect to such dispute. You and Mark Schramm agree to submit to the personal jurisdiction of such court. The prevailing party in any such proceeding shall be entitled to reimbursement of court costs, including a reasonable attorney fee, in addition to any other remedy awarded. In the event any provision of this Agreement shall be held by a court or other tribunal of competent jurisdiction to be unenforceable, such provision will be enforced to the maximum extend permissible and the remaining portions of this Agreement shall remain in full force and effect. You may not transfer or assign any of your rights or obligations provided in this Agreement without the express prior written approval of Mark Schramm; Mark Schramm may assign this Agreement without restriction of any kind. No failure on the part of Mark Schramm to enforce any provision of this Agreement shall be deemed a waiver or consent. This Agreement constitutes and contains the entire agreement and understanding between you and Mark Schramm with respect to the subject matter hereof and supersedes any prior oral or written agreements or understandings.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ IN ITS ENTIRETY AND UNDERSTAND THE FOREGOING AGREEMENT. I AGREE THAT BY BROWSING, INSTALLING OR USING THE SERVICES I AM ACKNOWLEDGING MY AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS AGREEMENT.", "Space Required": "1.38 GB"}



["5 stars\n75%\n4 stars\n11%\n3 stars\n0%\n2 stars\n0%\n1 star\n14%", "hankyman6 days ago\nSci-fi Lemmings (for you older gamers)\n\nGreat puzzle game. Takes full use of the possibilities with room-scale VR.\n\nSandbox mode allows you to create, upload and play others' user-generated puzzles so there's virtually endless gameplay beyond the extensive inbuilt levels.\n\nNB: I've been playing this game for several months, I was fortunate enough to be one of the testers.\n\nHelpful | 23", "Gamertag_VR7 days ago\nSUPERB FRESH VR PUZZLER\n\nFIND MY OCULUS QUEST LIVESTREAM BY SEARCHING GAMERTAG VR GRAVITY LAB\n\nThis review is based on my first 90 minutes gameplay. Im pleased to say this game has zero glitches, multiple difficulties, leaderboards, great graphics, all the locomotion options you would expect & as much as everyone is saying lemmings in VR (I GET IT) I think the game is also quite unique.\n\nUpon starting a level I learnt you must study what the goals are, you make the answers in your mind and then test to see if its possible. I enjoyed streaming it but I think playing this solo will be the best way.\n\nThe game puts you in a abandoned testing factory on the moon with only the bases computer as company. Every level you finish has a Dominoes type of satisfaction to it & as you stand back and watch your masterpiece (The most efficient player gets the highest score) the satisfaction levels are amazing.\n\nHelpful | 7", "derpysanta7 days ago\nLove it!\n\nGreat game! Spent lots of time on it today! It requires you to really think. I find myself building a track all the way to the bin only to find that it is the wrong one. This is a great game and I plan on doing it whenever I want to have some brain time. Worth the money, couple things.\n1. Multiplayer, I know, the game came out like 9 hours ago, but I think multiplayer would be cool.\n2. When Im loading into the game the picture and words are a little glitchy but that may just be me.\n\nHelpful | 5", "AndreOpiats7 days ago\nFantastic\n\nIve been playing Gravity Lab for over a year now (in pre-release)- and its fantastic!\n\nGreat graphics, smooth gameplay, and great atmosphere.\n\nIve played through it on both PCVR and Quest and this is definitely my favourite version!\n\nHelpful | 8", "Mathhole5 days ago\nAn old favorite\n\nI first played this years ago on the Vive, and its better than ever on Quest! I took my Quest over to a long hallway and set up one puzzle to shoot balls 30ft across a room. I walked the entire path of the puzzle by orienting my hallway perfectly. It was awesome!\n\nHelpful | 5", "GlitchMaster4004 days ago\nReally fun. 1 issue\n\nI almost refunded this game. One glaring issue. This game strains my eyes more then any other on the quest by far. When I look at words in the game its like the letters are shifting around. They are not clear at all. Object are to fuzzy. The oculus quest is capable of great visuals. I have a few games where the visuals are great.\nSo anyways the visuals here dance around like a shimmer. So it is straining my eyes quite a bit.\nPlease clean up and sharpen the visuals a bit. No other game on the quest does this to me like this.\n\nOn the plus side I find it very interesting to play. I am stumbling a bit at times on why certain object do or do not react the way they do. Not the best in game explanations. Even though the visuals are annoying for me I kept it for the fun game play and the ability to download other peoples creation directly into the game. That was a very nice touch and added lots of replay value.\n\nPossibly come up with more puzzles and more tools to use in future update?\n\nAnyone trying it out make sure to point into your selection then press trigger to bring up the gadget you want to use from the menu. We are hardwired to just point into menu to activate and is why even though it is in the start up instruction we end up thinking it only applies to moving objects , picking something up.\n\nHelpful | 2\nDeveloper Response4 days ago\n\nThanks for playing the game! Better font rendering is one of the top priorities for the next updates. I am also planning a content update for December which will add more levels :)", "kkuzma19827 days ago\nVery good game, but please add fly mode.\n\nVery good game with online levels share feature which gives limitless replayability.\n\nThere is only a grab mechanics that could put you higher on the level for better suiting sitting mode.\n\nAlso a fair price is a plus for this game.\n\nHelpful | 6", "SoulSong156 days ago\nSupper fun mechanics\n\nAlthough I do really like the game the interface doesnt take advantage of vr, and the controls can be difficult. The games ideas and mechanics are great, some basic stuff like the fact that the thumbs are static can get annoying. However the game is definitely enjoyable and worth the $15 it costs, no regrets there.\n\nEdit: thanks for the quick response, I look forward to future updates.\n\nHelpful | 2\nDeveloper Response6 days ago\n\nThanks for getting the game! You can delete any object by just throwing it away. It isn't really explained in the game, I will add some extra hints in the next update!", "eagleloc7 days ago\nGreat game, fun physics based puzzles\n\nGreat game, best physics puzzles Ive played since portal 2...not that it is a portal game at all but some of the logic of figuring out different surface reactions to get the object from point A to B remind me of that game.\n\nHelpful | 4", "danrol7 days ago\nAmazing puzzle\n\nI'm really enjoying this puzzle at the times I want to use my brain in VR:) Graphics are beautiful and gameplay is smooth. Highly recommended for purchase!\n\nHelpful | 3", "onleyou7 days ago\nGreat puzzle - 3D incredible machines\n\nGood quality, fun puzzle game. Feels nostalgic and modern at the same time. Good fun!\n\nHelpful | 4", "martinidana04276 days ago\nCant press buttons consistently\n\nI got this game for my mom thinking she would like it and it looks really fun but she has to press buttons in the menu many many times before it finally registers that she pressed it. The menu and buttons play sounds and animate as if she pressed the button but nothing happens until she presses it over and over at least 6 to 10 times. Seriously considering a refund as it's pretty much unplayable for her\n\nHelpful | 2\nDeveloper Response6 days ago\n\nHi, this sounds like a weird bug. See if the buttons work when you don't try to \"press in\" but just stick the finger in until it becomes \"pointy\" and then just press the trigger. Feel free to reach out to me directly at gravitylab@mark-schramm.com", "eggleg7 days ago\nGreat physics, great game.\n\nFantastic way to spend an hour or two fiddling with tubes and bridges and levers to get all the balls from one side of a room to the other. Seems easy? Try and it and see!\n\nHelpful | 1", "jaymel016 days ago\nGreat puzzle game\n\nPurchased this is a enjoy puzzle games, played it and lost track of time in the enjoyment. Definately worth every penny spent.\n\nHelpful | 1", "NPCMii5 days ago\n\n\nSo much fun  Well done Mark!\n\nHelpful | 0", "diomark7 days ago\nIf you like to tinker, get this!\n\nThis game is really good.\n\nHelpful | 1", "Rockjock125 days ago\nWanted to like this but...\n\nThe hands are very spazy and uncontrollable. The menus dont interact with hands. Ive been looking forward to this one for a long time but quite disappointed. Holding off on the return until I see a sizable update. Crossing my fingers! This seems like it has a ton of potential but couldnt even navigate through the tutorial to actually experience the game play. Please o please polish this up!\n\nHelpful | 0\nDeveloper Response5 days ago\n\nThis seems really weird and shouldn't happen. It sounds more like something is broken with the tracking, but I dont know why that would be isolated to one app. Could you please try restarting the app? is the controller tracking broken consistently or only when you open the menu and try to select something (maybe one of the controllers is overlapping the other) Also feel free to reach out to me directly at gravitylab@mark-schramm.com", "zigzagmagoo8224 days ago\nTop physics\n\nThe physics are the best in this game!\n\nAnd it's really fun!\n\nHelpful | 0", "Ocu-Ray4 days ago\nNeeds to improve the button pressing\n\n...\n\nHelpful | 0\nDeveloper Response4 days ago\n\nHi, this sounds like a weird bug. See if the buttons work when you don't try to \"press in\" but just stick the finger in until it becomes \"pointy\" and then just press the trigger. Feel free to reach out to me directly at gravitylab@mark-schramm.com"]