{"App Title": "Gravity Sketch", "App description": "Think in 3D. Create in 3D.\n\nPreserve your design intent through the creative process! Communicate ideas in 3D at each stage, capture work as an image or model to use in other phases of your workflow.\n\nA powerful yet intuitive creation tool - express 3D ideas in real-time at any scale. Create loose free form sketches, detailed models, expansive scenes, and artwork unrestricted.\n\nThe ability to start in 3D and stay in 3D has been the most transformative aspect of the workflow provided by Gravity Sketch, allowing me to create a 3D napkin sketch straight from my brain. - Saiful Haque, Concept Artist, Avatar Sequels\n\n- 6 creation tools\n- Geometry types: Mesh, NURBS, and SubD\n- Unlimited layers\n- Custom environments\n- Image and video import (.jpg, .png and .mp4)\n- Snapshot tool (.png)\n- Import/Export (.obj)\n- Sync all content in the cloud using LandingPad (our asset management platform, accessible through a web browser)\n- Collaboration coming soon (sign up to LandingPad to stay informed)", "Purchase section": "$22.49-25%$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Art/Creativity, Productivity, Utility", "Languages": "English", "Version": "5.0.1-qc", "Developer": "Gravity Sketch", "Publisher": "Gravity Sketch", "Website": "https://www.gravitysketch.com/", "Release Date": "July 18, 2019", "Developer Privacy Policy": "Privacy Policy\nGRAVITY SKETCH PRIVACY AND COOKIE POLICY\n\nThis Privacy and Cookie Policy applies to the website www.gravitysketch.com (Website) and the associated Gravity Sketch software (Software) (together, the Platform) which are operated by Gravity Sketch Limited a company registered in England and Wales under number 09228527 with its registered office at 3 Space International House, 6 Canterbury Crescent, London, United Kingdom, SW9 7QD (Gravity Sketch, we, our or us).\n\nBy using the Gravity Sketch website or software, you consent to the data practices described in this Privacy Policy. If you do not agree with any part of this Privacy Policy, then we cannot make our Platform available to you and you should stop accessing and using it.\n\nGravity Sketch encourages you to review the privacy statements of websites you choose to navigate to from Gravity Sketch so that you can understand how those websites collect, use and share your information. Gravity Sketch is not responsible for the privacy statements or other content on websites outside of the Gravity Sketch website.\n\nThis Privacy Policy is provided in accordance with Gravity Sketch Limiteds obligations under applicable privacy and data protection law, including Regulation (EU) 2016/679 (GDPR) (Applicable Data Protection Law). Definitions in this Privacy Policy shall be as set out in the Applicable Data Protection Law. For the purposes of this Privacy Policy, the term personal data means any information which identifies you or which allows you to be identified when combined with other information. It does not include data where the identity has been removed (anonymous data).\n\nFor the purposes of Applicable Data Protection Law, Gravity Sketch Limited is a data controller (for example, when collecting personal data from users of the Platform, and collecting personal data from our staff and consultants) and a data processor (for example, when storing personal data uploaded by a client to our Platform or processing personal data on the instructions of a client or where they are a data controller). We may also be a data processor where it processes personal data belonging to another party under their instruction and control. This Privacy Policy primarily applies in the context where Gravity Sketch Limited is a data controller.\n\nCollection of your Personal Information\n\nGravity Sketch may collect and process personal data, such as your name and email address if you enter these on the contact form on our website or to fulfil our contractual obligations  to provide our software including the Platform, invoice and receive payment for software, send updates, news and information about our software and related services. We may gather additional personal or non-personal information in the future.\n\nWe may collect and process data about others that you provide us with, including (but not limited to) information that you provide by filling in forms on the Platform. You represent and warrant to us that you have obtained the express consent from the individuals whose data you provide us with. For the avoidance of any doubt, any reference in this privacy policy to your data shall include data about other individuals that you have provided us with.\n\nWe may collect, use, store and transfer different kinds of personal data about you, we have grouped such data together as follows:\n\nIdentity Data includes first name, last name, username or similar identifier, title, gender, and social media accounts.\n\nContact Data includes billing address, delivery address, email address and telephone numbers.\n\nFinancial Data includes bank account and payment card details.\n\nTransaction Data includes details about payments to and from you and other details of software you have purchased from us.\n\nTechnical Data includes internet protocol (IP) address, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, device model and other technology on the devices you use to access this website or our Platform.\n\nProfile Data includes your username and password, purchases or orders made by you, your interests, preferences, feedback and survey responses.\n\nUsage Data includes information about how you use our Platform (including the amount of internet data used).\n\nMarketing and Communications Data includes your preferences in receiving marketing from us and our third parties and your communication preferences.\n\nOther Data includes other personal data or information relating to such personal data that you have uploaded to the Platform.\n\nWe may also collect, use and share Aggregated Data such as statistical, dietary, health or demographic data for any purpose. Aggregated Data may be derived from your personal data but is not considered personal data in law as this data does not directly or indirectly reveal your identity. However, if we combine or connect Aggregated Data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this Privacy Policy. This information is used for the operation of the website and the software provided by Gravity Sketch, and to provide general statistics regarding use of the Gravity Sketch website and software.\n\nWe do not knowingly collect any Special Categories of Personal Data about you (such as details about your race or ethnicity, religious or philosophical beliefs, sex life, sexual orientation, political opinions, trade union membership, information about your health and genetic and biometric data) or information about criminal convictions and offences.\n\nHow is your personal data collected?\n\nWe use different methods to collect data from and about you including through:\n\nDirect interactions. You may give us your name, email address and contact details in person, or by filling in forms on our website or by corresponding with us by post, phone, email, social media or otherwise. This includes personal data you provide when you:\n\n access to our Platform;\n\n request or receive technical support;\n\n meet with one of our employees or consultants;\n\n participate in an event which we have organised;\n\n complete a form on our website requesting us to contact you;\n\n subscribe to our publications or newsletter;\n\n request marketing to be sent to you;\n\n enter a competition, promotion or survey;\n\n submit an application for a role within Gravity Sketch; or\n\n make a complaint or give us some feedback.\n\nAutomated technologies or interactions. As you interact with our Platform, we may automatically collect Technical Data about your equipment, browsing actions and patterns. We collect this personal data by using cookies and other similar technologies. We may also receive Technical Data about you if you visit other websites employing our cookies. Please see our cookie policy below for further details.\n\nAutomated technologies through the use of our website or software. In your use of our Platform (including receiving our newsletter), certain Usage Data is transmitted to us such as the device you are using, and other such data.\n\nThird parties or publicly available sources. We may receive personal data about you from various third parties as set out below:\n\n Technical Data or Usage Data from analytics providers or search information providers.\n\n Employment, Identity and Contact Data from third party recruitment agencies.\n\nIf you fail to provide personal data\n\nWhere we need to collect personal data by law, or under the terms of a contract we have with you and you fail to provide that data when requested, we may not be able to perform the contract we have or are trying to enter into with you (for example, to provide you with our software). In this case, we may have to cancel the contract you have with us but we will notify you if this is the case at the time.\n\nPurposes for which we will process your personal data\n\nWe may collect and use your personal information to operate our website(s) and mobile applications and deliver the software you have requested. We will only use your personal data when the law allows us to. Most commonly, we will use your personal data in the following circumstances:\n\n Where we need to perform the contract we are about to enter into or have entered into with you.\n\n Where it is necessary for our legitimate interests (or those of a third party) and your interests and fundamental rights do not override those interests.\n\n Where we need to comply with a legal or regulatory obligation.\n\nGenerally we do not rely on consent as a legal basis for processing your personal data other than in relation to sending third party direct marketing communications to you via email or text message. You have the right to withdraw consent to marketing at any time by contacting us.\n\nWe have set out below, in a table format, a description of all the ways we plan to use your personal data, and which of the legal bases we rely on to do so. We have also identified what our legitimate interests are where appropriate.\n\nNote that we may process your personal data for more than one lawful ground depending on the specific purpose for which we are using your data. Please contact us if you need details about the specific legal ground we are relying on to process your personal data where more than one ground has been set out in the table below.\n\nPurpose/Activity\n\n\t\n\nType of data\n\n\t\n\nLawful basis for processing including basis of legitimate interest\n\n\t\n\n\nTo register you as a new user\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n\t\n\nPerformance of a contract with you\n\n\t\n\n\nTo process and deliver software including:\n\n(a) Manage payments, fees and charges\n\n(b) Collect and recover money owed to us\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Financial\n\n(d) Transaction\n\n(e) Marketing and Communications\n\n\t\n\n(a) Performance of a contract with you\n\n(b) Necessary for our legitimate interests (to recover debts due to us)\n\n\t\n\n\nTo enable you to partake in a prize draw, competition or complete a survey\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Profile\n\n(d) Usage\n\n(e) Marketing and Communications\n\n\t\n\n(a) Performance of a contract with you\n\n(b) Necessary for our legitimate interests (to study how customers use our products/software, to develop them and grow our business)\n\n\t\n\n\nTo administer and protect our business, website and software (including troubleshooting, data analysis, testing, system maintenance, support, reporting and hosting of data)\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Technical\n\n(d) Other\n\n\t\n\n(a) Necessary for our legitimate interests (for running our business, provision of administration and IT software, network security, to prevent fraud and in the context of a business reorganisation or group restructuring exercise)\n\n(b) Necessary to comply with a legal obligation\n\n\t\n\n\nTo deliver relevant website content and advertisements to you and measure or understand the effectiveness of the advertising we serve to you\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Profile\n\n(d) Usage\n\n(e) Marketing and Communications\n\n(f) Technical\n\n\t\n\nNecessary for our legitimate interests (to study how customers use our products/software, to develop them, to grow our business and to inform our marketing strategy)\n\n\t\n\n\nTo use data analytics to improve our website, software, Platform, products/software, marketing, customer relationships and experiences\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Profile\n\n(d) Technical\n\n(e) Usage\n\n(f) Marketing and Communications\n\n\t\n\nNecessary for our legitimate interests (to define types of customers for our software, to keep our Platform updated and relevant, to develop our business and to inform our marketing strategy\n\n\t\n\n\nTo make suggestions and recommendations to you about goods or software that may be of interest to you\n\n\t\n\n(a) Identity\n\n(b) Contact\n\n(c) Technical\n\n(d) Usage\n\n(e) Profile\n\n\t\n\nNecessary for our legitimate interests (to develop our products/software and grow our business)\n\n\t\n\n\nGravity Sketch may also use your personally identifiable information to inform you of other products or software available from Gravity Sketch and our partners. Gravity Sketch may also contact you via surveys to conduct research about your opinion of our website and software. Gravity Sketch does not sell, rent or lease or provide in any other way its customer lists to third parties.\n\nGravity Sketch may keep track of the websites and pages our users visit within Gravity Sketch and which software our users access. This data is used to deliver customised content within Gravity Sketch to customers whose behaviour indicates that they are interested in a particular subject area.\n\nChange of purpose\n\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purpose. If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us.\n\nIf we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n\nPlease note that we may process your personal data without your knowledge or consent, in compliance with the above rules, where this is required or permitted by law.\n\nTransfer of Personal Data\n\nWe require all third parties to respect the security of your personal data and to treat it in accordance with the law. We do not allow our third-party service providers to use your personal data for their own purposes and only permit them to process your personal data for specified purposes and in accordance with our instructions and applicable law.\n\nYou agree that we may share data with the third parties set out below for the purposes set out in the table above:\n\n Affiliates of Gravity Sketch;\n\n Our third-party service providers who perform functions on our behalf in connection with the operation of our business such as email marketing/CRM providers, IT service providers and system administrators, third parties who host and manage data or provide programming or technical support, deliver our products and software, conduct reference checks on candidates on our behalf etc;\n\n Professional advisers including lawyers, bankers, auditors, and recruiters and who provide consultancy, banking, legal, insurance, accounting, and recruitment software;\n\n Our third-party analytics partners to analyse website traffic and understand customer needs and trends or our third-party marketing service providers to help us to communicate with.\n\nAll such third parties are required to maintain the confidentiality of your information.\n\nWe may also transfer your personal data to third parties to whom we may choose to sell, transfer, or merge parts of our business or our assets. Alternatively, we may seek to acquire other businesses or merge with them. If a change happens to our business, then the new owners may use your personal data in the same way as set out in this Privacy Policy.\n\nWhenever we transfer your personal data out of the EEA or UK, we ensure a similar degree of protection is afforded to it by ensuring at least one of the following safeguards is implemented:\n\n We will only transfer your personal data to countries that have been deemed to provide an adequate level of protection for personal data by the European Commission. For further details, see European Commission: Adequacy of the protection of personal data in non-EU countries.\n\n Where we use certain service providers, we may use specific contracts approved by the European Commission which give personal data the same protection it has in Europe. For further details, see European Commission: Model contracts for the transfer of personal data to third countries.\n\n Where we use providers based in the US, we may transfer data to them if they are part of the Privacy Shield which requires them to provide similar protection to personal data shared between the Europe and the US. For further details, see European Commission: EU-US Privacy Shield.\n\nWe may disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to:\n\n(a) conform to the edicts of the law or comply with legal process served on Gravity Sketch Ltd or the site\n\n(b) protect and defend the rights or property of Gravity Sketch Ltd; and,\n\n(c) act under exigent circumstances to protect the personal safety of users of Gravity Sketch Ltd, or the public.\n\nData security\n\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We have put in place procedures to deal with any suspected personal data breach and will notify you and any applicable regulator of a breach where we are legally required to do so.\n\nFor example, sensitive information between your browser and the Platform is transferred in encrypted form using Secure Socket Layer (SSL). When transmitting sensitive information, you should always make sure that your browser can validate the Platforms certificate.\n\nYour passwords and information are stored in the Gravity Sketch database in encrypted form. We do not disclose your account details, postal or email addresses to anyone except when legally required to do so. However, it is your responsibility to keep your password secure. Unfortunately, the transmission of information via the internet is not completely secure. Although Gravity Sketch will do its best to protect your personal data, we cannot guarantee the security of your data transmitted to the Platform, any transmission is at your own risk. Once we have received your information, we will use strict procedures and security features to try and prevent any unauthorised access.\n\nData retention\n\nGravity Sketch will only retain your personal data for as long as necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, accounting, or reporting requirements.\n\nTo determine the appropriate retention period for personal data, we consider the amount, nature, and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal requirements. Data reviewed regularly for relevance. Any data deemed no-longer relevant is deleted. Gravity Sketch may keep your personal data for at least six years from the date of the last interaction for insurance and liability purposes. Gravity Sketch shall keep staff and consultant personal data for at least seven years. Gravity Sketch shall keep emails of clients and prospective clients for as long as it has a legitimate interest to do so. You can request details of retention periods for different aspects of your personal data by contacting us at info@gravitysketch.com.\n\nAs noted above, where we have taken steps to anonymise your personal data (so that it can no longer be associated with you) we may use this for analytical, research and statistical purposes and to help us to improve our products and software, in which case this is no longer personal data and we may use this information indefinitely without further notice to you.\n\nUse of Cookies\n\nThe Gravity Sketch Platform may use cookies to help you personalize your online experience. A cookie is a text file that is placed on your hard disk by a web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you. Our Platform may use cookies and similar technologies to distinguish you from other users of our Platform. This helps us to provide you with a good experience when you browse our Platform and allows us to improve our Platform. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of the Platform may become inaccessible or not function properly. For more information about the cookies we use, please see our Cookie Policy below.\n\nChildren Under Sixteen\n\nGravity Sketch does not knowingly collect personally identifiable information from children under the age of sixteen. If you are under the age of sixteen, you must ask your parent or guardian for permission to use this website or our software.\n\nOpt-Out & Unsubscribe\n\nWe respect your privacy and give you an opportunity to opt-out of receiving announcements of certain information. Users may opt-out of receiving any or all communications from us by contacting us or selecting the Unsubscribe option on their email.\n\nYour Legal Rights\n\nYou have the right to:\n\nRequest access to your personal data (commonly known as a data subject access request). This enables you to receive a copy of the personal data we hold about you and to check that we are lawfully processing it.\nRequest correction of the personal data that we hold about you. This enables you to have any incomplete or inaccurate data we hold about you corrected, though we may need to verify the accuracy of the new data you provide to us.\nRequest erasure of your personal data. This enables you to ask us to delete or remove personal data where there is no good reason for us continuing to process it. You also have the right to ask us to delete or remove your personal data where you have successfully exercised your right to object to processing (see below), where we may have processed your information unlawfully or where we are required to erase your personal data to comply with local law. Note, however, that we may not always be able to comply with your request of erasure for specific legal reasons which will be notified to you, if applicable, at the time of your request.\nObject to processing of your personal data where we are relying on a legitimate interest (or those of a third party) and there is something about your particular situation which makes you want to object to processing on this ground as you feel it impacts on your fundamental rights and freedoms. You also have the right to object where we are processing your personal data for direct marketing purposes. In some cases, we may demonstrate that we have compelling legitimate grounds to process your information which override your rights and freedoms.\nRequest restriction of processing of your personal data. This enables you to ask us to suspend the processing of your personal data in the following scenarios: (a) if you want us to establish the datas accuracy; (b) where our use of the data is unlawful but you do not want us to erase it; (c) where you need us to hold the data even if we no longer require it as you need it to establish, exercise or defend legal claims; or (d) you have objected to our use of your data but we need to verify whether we have overriding legitimate grounds to use it.\nRequest the transfer of your personal data to you or to a third party. We will provide to you, or a third party you have chosen, your personal data in a structured, commonly used, machine-readable format. Note that this right only applies to automated information which you initially provided consent for us to use or where we used the information to perform a contract with you.\nWithdraw consent at any time where we are relying on consent to process your personal data. However, this will not affect the lawfulness of any processing carried out before you withdraw your consent. If you withdraw your consent, we may not be able to provide certain products or software to you. We will advise you if this is the case at the time you withdraw your consent.\nNo fee usually required\n\nYou will not have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we may refuse to comply with your request in these circumstances.\n\nWhat we may need from you\n\nWe may need to request specific information from you to help us confirm your identity and ensure your right to access your personal data (or to exercise any of your other rights). This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\n\nTime limit to respond\n\nWe try to respond to all legitimate requests within one month. Occasionally it may take us longer than a month if your request is particularly complex or you have made a number of requests. In this case, we will notify you and keep you updated.\n\nGRAVITY SKETCH COOKIE POLICY\n\nOur Platform may use cookies to help you personalize your experience. A cookie is a text file that is placed on your hard disk by a web page server. Cookies cannot be used to run programs or deliver viruses to your computer. Cookies are uniquely assigned to you, and can only be read by a web server in the domain that issued the cookie to you.\n\nOne of the primary purposes of cookies is to provide a convenience feature to save you time. The purpose of a cookie is to tell the web server that you have returned to a specific page. For example, if you visit the Gravity Sketch Website or App, a cookie helps Gravity Sketch to recall your information on subsequent visits. This simplifies the process of recording your personal information, such as billing addresses, and so on. When you return to the same Gravity Sketch Website or App, the information you previously provided can be retrieved, so you can easily use the Gravity Sketch features that you customized.\n\nYou have the ability to accept or decline cookies. Most Web browsers automatically accept cookies, but you can usually modify your browser setting to decline cookies if you prefer. If you choose to decline cookies, you may not be able to fully experience the interactive features of the Gravity Sketch Platform or websites you visit.\n\nGravity Sketch may also use other technologies with similar functionality to cookies, such as web beacons and tracking URLs. Gravity Sketch may also use web beacons and tracking URLs in emails to determine whether a recipient opened the email or accessed a certain link.\n\nGravity Sketch may use the following cookies:\n\nStrictly necessary cookies. These are cookies that are required for the operation of our website. They include, for example, cookies that enable you to log into secure areas of our website or make use of e-billing software.\nAnalytical/performance cookies. They allow us to recognise and count the number of visitors and to see how visitors move around our website when they are using it. This helps us to improve the way our website works, for example, by ensuring that users are finding what they are looking for easily.\nFunctionality cookies. These are used to recognise you when you return to our website. This enables us to personalise our content for you, greet you by name and remember your preferences (for example, your choice of language or region).\nTargeting cookies. These cookies record your visit to our website, the pages you have visited and the links you have followed. We will use this information to make our website and the advertising displayed on it more relevant to your interests. We may also share this information with third parties for this purpose.\n\nPlease note that third parties (including, for example, advertising networks and providers of external software like web traffic analysis software) may also use cookies, over which we have no control. These cookies are likely to be analytical/performance cookies or targeting cookies.\n\nIf you wish to view a cookies code, just open your cookie file in your browser and click on a cookie to open it. Youll see a short string of text and numbers. The numbers are your identification card, which can only be seen by the server that gave you the cookie. For information on how to do this on the browser of your mobile phone you will need to refer to your device manual.\n\nConsent to our use of Cookies\n\nThe law allows us to store cookies on your computer if they are essential to the operation of our website. We need your consent to set non-essential cookies on your computer.\n\nWhen you use our website for the first time we give you the opportunity to accept or decline cookies.\n\nBY USING OUR WEBSITES AND SERVICES, YOU ARE CONSENTING TO OUR SETTING COOKIES AND USING THE DATA COLLECTED BY THEM FOR THE PURPOSES SET OUT ON THIS COOKIE POLICY\n\nIf you wish to withdraw consent for any reason, please contact info@gravitysketch.com.\n\nDeclining Cookies\n\nSome of the cookies we use are essential if the website is to operate properly. If you decline them, some of the features of the website may not work as well as we intend and you may not be to access or use some features.\n\nUnless you have set your browser so that it will decline cookies, our system will set some cookies as soon you use the website.\n\nYou block cookies by activating the setting on your browser that allows you to refuse the setting of all or some cookies. For information about this you should look in your browsers help facility. However, if you use your browser settings to block all cookies (including essential cookies) you may not be able to access all or parts of our website.\n\nMicrosoft Edge:https://privacy.microsoft.com/en-us/windows-10-microsoft-edge-and-privacy\nInternet Explorer:https://support.microsoft.com/en-gb/help/17442/windows-internet-explorer-delete-manage-cookies\nChrome:https://support.google.com/chrome/answer/95647?hl=en-GB\nFirefox:https://support.mozilla.org/en-US/kb/delete-browsing-search-download-history-firefox\nSafari:https://support.apple.com/es-es/guide/safari/manage-cookies-and-website-data-sfri11471/mac\n\nIf you have previously used our website and/or software and no longer wish to accept cookies, you should be aware that some cookies will have been set. You may delete these cookies at any time by following the instructions at:https://www.aboutcookies.org/how-to-delete-cookies/\n\nMore information on cookies can be found onallaboutcookies.org.\n\nYou may be able to opt out of receiving personalized advertisements from advertisers or advertising networks who are members of the Network Advertising Initiative or who subscribe to the Digital Advertising Alliances Self-Regulatory Principles for Online Behavioral Advertising by visiting the opt-out sections on the websites of each of those organizations. Links to those sites are here:\n\nNetwork Advertising Initiative: http://www.networkadvertising.org/choices/\n\nDigital Advertising Alliance: http://www.aboutads.info/choices/\n\nGoogle Analytics\n\nWe use Google Analytics. The information generated by the Google Analytics cookie (including your IP address) will be transmitted to and stored by Google on servers in the United States. Google will use this information for the purpose of evaluating your use of our websites and/or software compiling reports on activity and providing other software relating to activity and internet usage.\n\nGoogle may also transfer this information to third parties where required to do so by law, or where third parties process the information on Googles behalf.\n\nTo see more information on the cookies set by Google Analytics see:Cookies and Google Analytics.\n\nToopt outof being tracked by Google Analytics across all websites visithttps://tools.google.com/dlpage/gaoptout\n\nChanges to this Privacy Policy or Cookie Policy\n\nWe may occasionally update this Privacy Policy or Cookie Policy to reflect company and customer feedback and any changes in data protection regulations. Gravity Sketch encourages you to periodically review this Privacy Policy and Cookie to be informed of how we are protecting your information.\n\nContact Information\n\nGravity Sketch Ltd welcomes your questions or comments regarding this Privacy Policy or Cookie Policy. If you believe that Gravity Sketch has not adhered to this Privacy Policy or Cookie Policy, please contact us at info@gravitysketch.com\n\nGravity Sketch Limited\n\n3 Space International House\n\n6 Canterbury Crescent, London\n\nUnited Kingdom, SW9 7QD\n\nEffective as of 4 March 2019\n\nTHINK AND CREATE IN 3D FROM DAY ONE\n\nIt all starts with a sketch\nGET IN TOUCH\nCo-Creation early access\n\nPlay a role in the development and design of the collaboration features coming soon to the platform\n\nJoin the waiting list\nGRAVITY SKETCH\nHome\nPricing\nWorkflows\nTEAM\nCareers\nContact us\nSUPPORT\nLearn\nFAQ\nCOMMUNITY\nForum (Discord)\nBlog\nLATEST\n\nFive questions on VR Design with Min Guen\n\nFunded by the Horizon 2020 programme of the European Union\n\nPrivacy Policy\nTerms of service\n 2020 Gravity Sketch\nClose this module\n\nBy continuing to browse gravitysketch.com, you agree to the use of cookies. We use cookies to make sure all your requests are secure and for advertising purposes. Learn more in our privacy policy.\n\nI understand", "Developer Terms of Service": "EULA\nEnd User License Agreement\n\nHey Skechers,\n\nWe are happy youve decided to use Gravity Sketch for 3D Design purposes. Before you go, please read the following legal rules.\n\nBy purchasing a License Key and/or downloading and using the Software, You agree, without reservation, to be bound by the terms of this EULA. If You do not agree with the terms of this EULA, please do not purchase a License Key and/or download and use the Software.\n\nIf you accept the terms and conditions in this EULA on behalf of a company or other legal entity, You warrant that You have full legal authority to accept the terms and conditions in this EULA on behalf of such company or other legal entity, and to legally bind such company or other legal entity.\n\nYou may not accept this EULA if You are not of legal age to form a binding contract with Gravity Sketch.\n\nDefinitions\n\n1.1  In this EULA the expressions below shall have the meaning assigned to them in this clause, unless the context requires otherwise:\n\nActivate turning the Trial version into the Full version of the same application with the License Key provided by Gravity Sketch,\n\nGravity Sketch Gravity Sketch Limited, 100A Eardley, SW16 6BJ London, United Kingdom;\n\nDocumentation the detailed information about the Software, its features and the system requirements as made available on the website of Gravity Sketch, Steam Store, Oculus Store and Vive Port, as amended from time to time,\n\nLicense Key a unique code provided by Gravity Sketch, which enables You to activate the Full version by entering the code into the Software and to subsequently use the Software during the applicable license term,\n\nFull version the license for the Software for the term specified on the webpage of the store where You purchase the license, or in any applicable agreement concerning the purchase of the license (as stand-alone product or as part of a subscription) to Use the Software,\n\nSoftware any software application and/or all of the contents of the files and/or other media, including software setup files, licensed to You by Gravity Sketch, including any Updates,\n\nTrial version the license for the Software for the term of 30 days to Use the Software for the sole purpose of testing and evaluating the Software,\n\nUpdates any modified versions and updates of, and additions to the Software (excluding upgrades of the Software),\n\nUse the access, download, install, copy or get benefit from using the Software in accordance with the documentation.\n\nYou you, the final and ultimate user of the Software or the authorized representative of a company or other legal entity that will be the final and ultimate user of the Software, and the company or other legal entity that will be the final and ultimate user of the Software, if applicable.\n\nGeneral\n\n1.2  This EULA applies to any licenses granted to You by Gravity Sketch for the use of the Software.\n\n1.3  By purchasing a License Key for the Software and/or downloading and using the Software, You enter into this EULA with Gravity Sketch.\n\n1.4  This EULA may be modified from time to time. Gravity Sketch will notify you of such modifications on its website or otherwise, e.g. by using the email address used for the provision of the License Key. Any modifications to this EULA shall only apply upon acceptance by You.\n\nLicense\n\n2.1  Gravity Sketch grants You a non-exclusive, non-transferable, limited, revocable license to Use the Software in accordance with this EULA. Gravity Sketch reserves all rights not expressly granted to You.\n\n2.2  Gravity Sketch is and remains the owner of any intellectual property rights with respect to the Software. You shall not acquire any ownership to the Software as result of Your purchase of the License Key or Your Use of the Software.\n\nPermitted use and restrictions\n\n3.1  In order to be able to install the Software and receive Updates and upgrades, Your computer shall have access to the Internet and shall meet the system requirements described in the Documentation that can be found on the web page and the links included in there to the Steam Store, Oculus Store and Vive Port :\n\nhttp://www.gravitysketch.com/beta/\n\n3.2  You may Use the Software on one computer only, unless You have purchased (a) a volume license or (b) more than one Full version or Trial version. In the event You have purchased a volume license or more than one Full version or Trial version, the number of computers You may Use the Software on shall not exceed the number of the Full version or Trial version purchased. If You exceed the limit, Gravity Sketch may block the License Key.\n\n3.3  You shall Use the Full version or Trial version in accordance with applicable laws and shall not:\n\nUse the Trial version on any system where the Trial version was previously Used and expired,\n\nrent, lease, lend, sell, redistribute, sublicense or otherwise commercially exploit the License Key, the Full version or the Trial version,\n\nassign the License Key, the Full version or the Trial version without prior written approval of Gravity Sketch,\n\nUse the Full version or Trial version for any unlawful or illegal activity, or to facilitate an unlawful or illegal activity,\n\ndelete or alter any disclaimers, warnings, copyright or other proprietary notices accompanying the Software, or\n\ncopy (except as otherwise provided in this EULA), adapt, translate, decompile, reverse engineer, disassemble, attempt to derive the source code of, modify or create derivative works of the Software and the License Key or any parts thereof, except to the extent permitted by applicable law.\n\n3.4  Gravity Sketch may modify the Software at any time at its sole discretion and without notice to You, for example to comply with applicable law or a court order, to avoid a third party infringement claim or to provide Updates and upgrades.\n\nMaintenance and support\n\n4.1  Gravity Sketch will notify You of any available Updates and upgrades.\n\n4.2  You will be entitled to receive Updates free of charge during a period of twelve (12) months upon purchasing the License Key for the Full version. In order to receive Updates after this twelve months period, You will need to renew your License Key for the Full version.\n\n4.3  You may need to pay an additional fee in order to be able to download an upgrade.\n\n4.4  Any maintenance and support provided by Gravity Sketch, including the provision of Updates and upgrades, will be provided in an adequate way on an as is basis without any warranty, as soon as reasonably practicable, subject to availability of personnel.\n\nUse of data\n\n5.1  Gravity Sketch and its subsidiaries may periodically collect and use technical and related data concerning the Software You have licensed, including about the version number of the Software You have installed and about the system You have installed the Software on. Gravity Sketch will use such data to facilitate maintenance and support with respect to the Software, to improve its products and to provide further services or technologies to You.\n\n5.2  Gravity Sketch may process personal data with respect to You, if and to the extent necessary to provide the License Key, to provide maintenance and support to You with respect to the Software and to comply with its obligations under this EULA. To the extent Gravity Sketch will process personal data, it will comply with its obligations under applicable data protection law.\n\nDisclaimer\n\n6.1  You Use the Software at Your own risk and the entire risk as to satisfactory quality, performance and accuracy is with You.\n\n6.2  The Software and accompanying documentation are provided on an as is and as available basis without warranty  express or implied- of any kind, and Gravity Sketch specifically disclaims the warranty of fitness for a particular purpose. No oral or written advice given by Gravity Sketch, its dealers, distributors, agents or employees shall create a warranty or in any way increase the scope of this warranty and You may not rely upon such information or advice.\n\nLiability limitation\n\n7.1 -The liability of Gravity Sketch and any third party that has been involved in the creation, production, or delivery of the Software for all damages arising out of or in any way relating to the License version, the Trial version, the License Key, the Software and/or this EULA shall in no event exceed the total amount of  75.\n\n7.2  Gravity Sketch and any third party that has been involved in the creation, production, or delivery of the Software are under no circumstances liable for consequential or indirect damages (including damage for loss of profit, business interruption, loss of data, and the like arising out of the use or inability to use the Software).\n\n7.3  The limitations of liability referred to in clause 7.1 and 7.2 shall not apply in the event that: (i) any negligence on the part of Gravity Sketch leads to death or physical injury or (ii) damages arise from the intent, willful misconduct or gross negligence of Gravity Sketch or the management of Gravity Sketch.\n\nTermination\n\n8.1  This EULA will continue to be in force until the expiry or termination of the Full version or Trial version.\n\n8.2  The Full version or Trial version will terminate automatically at the end of the applicable license term, unless renewed or Activated prior to the end of the applicable license term.\n\n8.3  Gravity Sketch is entitled to terminate the Full version or Trial version by blocking the License Key during the license term with immediate effect and without prior notice in the event You fail to comply with the terms in this EULA, in the event You fail to pay Your (subscription) fee for the License Key within the applicable payment term, or in the event Gravity Sketch is required to do so by law or an order of an applicable court.\n\n8.4  Upon termination of the Full version or Trial version, You shall cease all use of the Software and shall destroy all copies thereof.\n\n8.5  You acknowledge that the provisions of this EULA, which by their nature are intended to survive termination, will remain in effect after termination of this EULA.\n\nGoverning law and disputes\n\n9.1  This EULA shall be governed by and construed in accordance with the English law, excluding its conflicts of law rules.\n\n9.2  Any dispute between Gravity Sketch and You shall exclusively be submitted to the competent court in the English courts.\n\nTHINK AND CREATE IN 3D FROM DAY ONE\n\nIt all starts with a sketch\nGET IN TOUCH\nCo-Creation early access\n\nPlay a role in the development and design of the collaboration features coming soon to the platform\n\nJoin the waiting list\nGRAVITY SKETCH\nHome\nPricing\nWorkflows\nTEAM\nCareers\nContact us\nSUPPORT\nLearn\nFAQ\nCOMMUNITY\nForum (Discord)\nBlog\nLATEST\n\nFive questions on VR Design with Min Guen\n\nFunded by the Horizon 2020 programme of the European Union\n\nPrivacy Policy\nTerms of service\n 2020 Gravity Sketch\nClose this module\n\nBy continuing to browse gravitysketch.com, you agree to the use of cookies. We use cookies to make sure all your requests are secure and for advertising purposes. Learn more in our privacy policy.\n\nI understand", "Space Required": "218.6 MB"}



["5 stars\n75%\n4 stars\n14%\n3 stars\n4%\n2 stars\n2%\n1 star\n5%", "BionicLombaxJul 4 at 12:23 AM\nA creator's dream\n\nThis app deserves every price it cost ! I've never felt so free and in control of a 3D creation before, the feeling of decreasing in size the whole project with your hands is awesome. You can paint, draw by the grounds up but I personally prefer importing my blender projects ( as an .ObJ file ) and modifying it here, the possibilities are endless!\nI'm looking forward to make all of my models with this and then 3D print them, instead of surfing the net looking for a good and free model, or even rigging them for 3D animations.\nIt's so intuitive that I learned almost every feature in half an hour without any tutorial.\nIt was my first purchase on the store and I'll never regret it!\n\nHelpful | 39", "delvach10 days ago\nYou already know you're going to buy it\n\nThis is the design experience you've been hoping would be possible in VR. It's got room to grow, it could use more precision tools for the level of precision I need for 3d printing (you can export and print with one or two extra steps), guide lines and numeric entry, merge/add/subtract.. but in the two weeks I've had this they already added features and it felt like sci-fi on day one. I've been waiting for this to exist since I was a kid, now it's less than $20. If you read this many reviews, you already know you're buying it.\n\nHelpful | 2", "udo.nink13 days ago\nI can only guess the impact of this one\n\nStanding in a virtual designer space, snitching your tool pad in the left hand, choosing with the right (at least in my case) and then just drawing in mid air. Picking objects like donuts and growing shifting transforming those with both your hands, wow. And at every granularity from real sketchy to very fine penciled. This might be the future for designers.\n\nHelpful | 3", "matthew.duggan1Jul 1 at 1:23 AM\nNeeded feature.\n\nThis is a 5 star app no doubt. One thing that would make it even better is the ability to use the inbluilt camera tracking system to scan in assets from the real world. It just seems like a wasted opportunity. Learning to code so if your interested I don't mind making this one of my projects.\n\nHelpful | 14", "Kayston2 days ago\nFantastic - even for amateurs\n\nI am not an artist by any means but picked up gravity sketch because I like being creative. Its simple and easy enough for amateurs like me to understand and start creating, but also seems extremely powerful if you take the time to understand the more advanced features. There are many official and third party videos that can guide you through practically every feature in the tool. I am very glad I purchased GS and would definitely recommend it to others.\n\nHelpful | 0", "Ronin93 days ago\nLove it. Worth every penny and then some\n\nI am studying animation and character development.. What I was able to learn in Maya autodesk the last year teansgresss over to this perfectly. I was playing with this when last winter and it has come so far as far as not crashing and legit tool to actually model.. you can grab verts, add verts, take away verts, grab edges, extrude faces almost.. sculpt, light, its a bit tricky to navigate at first but what isnt ?\n\nI plan on making some video for this. I would love to work for you guys !\n\nHelpful | 0", "PartycusMay 9 at 4:48 PM\nThere is so much more to it!\n\nI originally downloaded this and only played around with it for a couple of minutes, then put it away as it seemed rather rudimentary to me Boy was I wrong!\n\nIm so glad that I picked it back up again and decided to watch some tutorials online. The developers have really made something special here. This is essentially a full feature 3-D vector drawing program. Theres so many bells and whistles hidden inside.\n\nGravity sketch has allowed me to express my ideas in ways that a flat piece of paper or screen never could.\n\nHelpful | 72", "CSGPhotos15 days ago\nI'm no artist...\n\nThis software gives me the ability to paint and design in a virtual realm. It's like nothing I've ever experienced before!\n\nI'm still learning the controls, but the more I learn, the easier it is to create!\n\nAt first I just jumped in to see what I could do. Then I watched a couple of YouTube videos. One of the videos showed me that there are tutorials built right into the app, and I can watch them and practice and play all at the same time!\n\nIf you ever thought you'd like to be creative, but didn't think you had any skill, you should get Gravity Sketch and give it a try. You will see your imagination start to flourish in real time!\n\nHelpful | 1", "captainxJun 16 at 2:26 PM\nThe best 3d modeling software.....period\n\nNever written a review before on anything , but gravity sketch has made me feel I have to just to say thankyou to its developers. Its sleek and simple to use, so easy to interact with the 3d world in a logical smooth totally makes sense way, anyone can use it, and yet it's so powerful and can do the most complex things while making it all look so easy, and theres the truth plain and simple...........it is easy to do very complex thing ..........the developers have taken 3d modeling and blended it perfectly with VR and humans and made the best software iv ever used, outstanding, creative, and how it's meant to be..........don't be tempted.........JUST BUY IT RIGHT NOW !\n\nI'm not an artist or a designer but I would buy an oculus quest just for this alone....... yes it's that good period !!!!!!! \n\nHelpful | 10", "EYDESIGNS17 hours ago\nA great 3D drawing app\n\nThis is what I always wanted for a VR headset. I love the app, but still a few bugs in it. Hope all the issues will be updated soon. Gravity Sketch is moving on the right direction. Keep up the great work. Thanks\n\nHelpful | 0", "TheRightman79Jul 27 at 12:45 PM\nRemove Texture limit from .OBJ import\n\nI have noticed inside the new July 2020 release on Quest a texture&visualization limit of 1024 x 1024 pixel.\nIn the previous Gravity Skecth version I was able to load a full OBJ model with a hight resolution textures of 8192x8192 on Quest without any problem. Please ad an option to remove the auto downscale of the textures inside Quest.\n\nHelpful | 14", "aka_anoopJul 16 at 11:24 AM\nArguably the best design app for Quest\n\ngravity sketch is by far the best design app. I have been using it for a couple of months now and the user experience is the best I have experienced in any app so far. The customization that is available for each of the tools is so thoughtfully crafted to be most intuitive even for a beginner user. The landing pad integration makes it easier to quickly bring reference images and allow for interoperability with desktop design software like Blender. I would highly recommend anyone who is looking for a great design app to give this a try.\n\nHelpful | 1", "ATMSPIDERTAO6 days ago\nPowerful fun and unlocks creativity\n\nIll be using this to allow employees to design their own products during creativity and innovation courses. Its amazing\n\nHelpful | 0", "wonkammoJul 20 at 7:03 PM\nAmazing 3D design app\n\nIts all about the subdivision mode of modeling. It makes on the fly modeling so intuitive and in real time. I just need to find out how to lock subdivisions centerlines to the vertical mirror so I wont keep moving off of the mirror line when I move it around.\n\nHelpful | 1", "billbeckerartJul 9 at 4:13 PM\nTricky at first, but great after a min..\n\nIt took about 3-4 hours to get the hang of it. Then after a few more hours its even better. Its a good all around app, worth the money 100%\n\nHelpful | 3", "osstrik3 days ago\nLove you guys\n\nBest product for designers\n\nHelpful | 0", "CaptainMcDonutsMay 19 at 8:03 AM\nSo Awesome\n\nI love Gravity Sketch. While I am not a designer, I am a lover of all things art. This program has so many features that I love, like the variety of brushes, the easy to use interface, and my favorite, the teleport tool shaped like a banana. I would like to see a Boolean, but I have heard that it is in the process of being added. Gravity Sketch will be in my library a long time.\n\nHelpful | 3", "sean.boguniaMar 3 at 7:23 PM\nI really love this concept\n\nVery easy to use plus plenty of tools to keep your interest I cant wait to see how far this design capability goes because it is quite amazing to be able to design and see your part real sized.\nIf this is just the first step then its a really big awesome step highly recommended!\n\nI would love in the future to be able to bring my client who also has a headset into the same design environment so my client could see the virtual design that would be so awesome virtual consulting from anywhere in the world this program makes me very excited!\n\nHelpful | 58", "adam_israelJun 5 at 3:10 PM\nHORRIBLE ON OCULUS QUEST\n\nBought it for quest, hoping to design and plan my summer building projects. Right as I opened it, it would glitch, prefabs wouldnt move properly, and almost no precision when forming or moving objects. Even with a good wifi connection, its a terrible software on the quest. Moving points of objects and lines is super glitchy and moves in random directions and positions, definitely not according to hand gestures. I was super disappointed 5 minutes after I started using it, I was expecting better from videos and creations I have seen online.\n\nHelpful | 6", "MaxSchelerMar 18 at 7:46 PM\nA must if you are designer or 3D artist\n\nThis isn't just a 3d drawing VR application, this is an easy to use cross platform 3D modelling software. Yes, of course you can have fun and use it for drawing and sketching... But that's only the surface. Buying this, I got more than I expected: the Quest and Rift apps and a subscription to Landing pad, a cloud service to save and share your creations between devices. Have you ever tried the mess that is to share something between your Quest and your computer? Landing pad makes it as simple as saving it in the cloud and open it in your browser or directly into your Rift. This simplicity shows the special care that developers took in every aspect: the nice and clear UI, the intuitive controls (and the new tool belt), the multiple workflows supported (curves, NURBS and polys) and the frequent updates. I love sketching or drawing more complex 3D shapes with this software because I know I can easily finish them in my computer (and if you don't want to use your headset it also has a non VR mode, i.e., you can use Gravity sketch as a normal 3d software). This is a solid app with a great development team that strongly believes in the project.\n\nHelpful | 21", "zackerychapJul 25 at 1:49 AM\nCrashing OBJ import\n\n200mb limit on imported objects\nKeeps crashing even when I import <50mb OBJ\n\nHelpful | 3", "CivilMuffinMay 13 at 8:37 AM\nFresh take\n\nJust picked up a quest and this title to start me off, so still learning. But from the surface and first impressions as someone working in the VFX field this is a super refreshing take on modeling, definitely going to spend many hours creating personal concept art in this and fitting it into my personal pipeline.\n\nWould be great to see co-op so that you can work together on a project.\n\nHelpful | 1", "nextekcarlApr 24 at 7:32 PM\nSo many options!\n\nIve found many really good tutorials on YouTube, both from the creators and from users. Which is great, since theres a bunch of tools with many different options and it can be pretty overwhelming. They are adding options pretty frequently, and they it seems very stable from the few times Ive used it so far. Im hoping to make some models for my 3D printer, but I have a ways to go before Im ready for that.\n\nHelpful | 1", "Sark_73Apr 18 at 3:05 PM\nThe only reason I am in VR\n\nI work as a professional designer and in gravity sketch.. all of a sudden I can see what I'm trying in modelling...it's immersion.\nIt's the next step...a powerful tool get a lot of potential I haven't quite mastered yet.... But I'm working on it in the after hours with a cold beer\n\nHelpful | 3", "phiam.ashJul 1 at 7:49 AM\nEssential new tool for design\n\nEndlessly rewarding\n\nHelpful | 0", "Fleagle1776May 31 at 4:17 PM\nAmazing\n\nTake the time to learn the features, you won't regret it. Not a single crash, ever (so far).\n\nHelpful | 2", "levyelilevyJun 10 at 3:24 AM\nJust what I needed\n\nI have a wood workshop and this tools is the perfect fit to my creations without getting dust in my lungs.\n\nHelpful | 0", "ztarzeedMay 30 at 5:18 PM\nNeeds character rigging\n\nI love gravity sketch but it needs character rigging and more object formats besides obj.\n\nHelpful | 2", "milanibeerApr 30 at 7:28 AM\nAmazing App to design the future!\n\nI am a professional product designer and I just love this super hot tool! It opens a whole new sphere of how to shape the future! I am really excited which new features the gravitysketch team will lounch this year!\n\nHelpful | 2", "jasargo23 days ago\nNot worth it\n\nI cant do much because not enough memory.\n\nHelpful | 1", "VRSugarBabyMar 14 at 6:53 PM\nVery well done\n\nA bit more technical than tilt brush and sculptris but the finished products have the potential to be quite a bit slicker and there seems to be more potential for very detailed perfect or nearly perfect realism with this program likw a 3d art program crossed with an auto cad type design program. Very cool!\n\nHelpful | 6", "BlueGhast03May 13 at 7:24 PM\nIf youre a graphic designer buy this\n\nIve made so many cool designs that I can transfer within 60 seconds to my computer to render absolutely amazing!! And makes my work slot easier \n\nHelpful | 1", "Bigfoot496Apr 30 at 7:16 PM\nGood but...\n\nThis game is really good in it you can create some amazing things  butt the controls on it are a little weird and its hard to create strait lines. So all in all this game is good all butt the controls.\nBTW I said the butt on purpose\n\nHelpful | 1", "maikmayers812 days ago\nSuper!\n\nI would appreciate a German translation. otherwise the application is great\n\nHelpful | 0", "PenelopeSaladfingersMay 23 at 8:35 AM\nvideo tutorial wont play\n\nNot too bad - annoyed that medium isnt available for quest , thats the only software I wanted . Oculus need to be more specific about which programs are available on each device .\n\nHelpful | 1", "andrewtekApr 20 at 9:11 AM\nAmazing design tool.\n\nThis works great on the Quest. It is unbelievable that a tool this great can work on such a portable device. Thanks for building this app and supporting it on Quest!\n\nHelpful | 1", "chad.hertlerMay 20 at 7:21 PM\nNot exactly a game.\n\nBut it is helpful for other things.\n\nHelpful | 1", "qantipMar 20 at 12:01 AM\nAwesome creative toll with great support\n\nI really love how intuitive this app is. It literally takes just minutes to be able to sketch in it. I have a recent experience in other modelling SW. But this is way most intuitive and still powefull. Of course there are limits and the best tools are kept for premium version (which is a greatest downside) but still enough for decent sketching in VR.\n\nHelpful | 1", "ReavoEndFeb 29 at 2:15 AM\nAmazing.\n\nBought this tonight and got lost in the app for four hours... And I would've kept going if my Quest hadn't died! I kinda forgot the Quest was on my face.\n\nIt is amazing the breadth and inuitive nature of all the features presented here. In a very significant way, Gravity Sketch takes many of the modern 3D modeling must-haves and reimagines them for the third dimension of freedom present in VR. I couldn't believe how naturally I was able to discover new features as I thought to search for them. The features I didn't think to search for are all so useful and cleverly-implemented, too.\n\nI can't wait to learn more, and eventually start designing for real in Grabity Sketch! I 100% can already tell: there will be no regrets with this purchase. Thirty bones is fully justified.\n\nHelpful | 2", "DownShift_StudioFeb 20 at 12:46 PM\nInvaluable design tool\n\nI bought an Oculus Quest just to run this piece of software on. It is extremely fun to use for visualizing your ideas. Think of this as the next evolution of your early design process. It doesnt replace paper sketches or digital sketching it just adds another valuable dimension to this process. I have no regrets with the purchase...\n\nHelpful | 3", "PeteyPakDec 2 at 9:51 AM\n*Very* well made. Totally lacks content\n\nI fell upon Gravity Sketch as a non-professional user, frustrated with the limitations of Tilt Brush, and wanting to draw for the sheer pleasure of it and to communicate ideas. Whereas Tilt Brush is slightly patchy tool with probably no future development, it has a reasonable user base and a decent library of publicly shared sketches where people can see new techniques and ideas and tricks. So it is popular.\n\nGravity Sketch is the exact opposite: The tools are technical and powerful and the interface immediately rights some of Tilt Brushs worst wrongs, its a pleasure to use. ...but it has no community pool of sketches or ways to share them, and almost no built-in content (and the models I load are matte black silhouettes - is that a bug?). So it is sterile and empty and for a limited audience only. I expected this from online reviews/videos, and I can confirm it. I recommend trying this app if youre willing to try a technical tool, you can always return it, but I dont think this is for non-industry users.\n\nDear makers of Gravity Sketch, an opinion from a casual user who loves the quality of what they see: If Tilt Brush is anything to go by, surely if you can just figure out *some* kind of Sketch sharing gallery, please. A beta test on your site would surely not be too hard as an experiment? Tilt Brushs limited half-app half-web system with only a couple of hundred sketches even after a couple of years, is already a rich collection of styles, tricks, ideas, inspiration, and shareable free assets. I strongly feel that a sharing atmosphere and demonstrations of cool sketches would attract more users the way it has for me, and I think for Tilt Brush. Im not saying you should add non-technical creative tools to the app, Im saying you should do this one most important thing to attract more creative users.\n\nHelpful | 139", "Peter.NimbleApr 13 at 5:21 AM\nGreat inspiring title\n\nFantastic app, workflow is quick, despite the low amount of knots the quest can handle without getting slow.\n\nHelpful | 1", "ionel.stan.71Apr 12 at 12:38 PM\nNice!\n\nSuper idea! I really appreciate if introducing the dimensions \n\nHelpful | 0", "kpeel27834Mar 21 at 11:04 AM\nGreat development\n\nI love how easy it is to use and now that I'm shelter to my home I'm learning how to use it very quickly. I would love to see the ability the add specific textures.\n\nThank you\n\nHelpful | 1", "dueddelDec 15 at 10:33 AM\nIt gets better the longer you use it\n\nI first tried Tilt Brush which is really cool in its own way. But that's just a tool for being creative (nothing else, but still it is pretty much since Tilt Brush has a lot of cool brushes with nice effects).\nGravity Sketch on the other hand is a tool for being productive (you also can and need to be creative as well, though). You can use a grid to snap points to. You can edit objects and you can snap its points to other points, e.g. to align surfaces to sketch lines. You can do so much more than with Tilt Brush (which is actually an unfair comparison because both tools have totally different purpose  I'm just comparing them because I baught them somehow for the same kind of reason  however, I already stop talking rubbish).\n\nI spent a couple of hours up to now in Gravity Sketch and I loved every single one. Sometimes I just didn't know how to do several things. Step by step you learn new controls and techniques or you find out on your own. Each time you get a new \"aha!\" moment thinking that you should have known before since most of the controls are intuitive in the end. And with each new learned feature your fun with the whole thing is gonna be increased.\n\nI can recommend everyone to watch all in-app-tutorial-videos. They're very helpful in the beginning and won't take a lot of time.\n\nThe videos don't tell you everything. Fortunately, there is a really good manual out there:\nhttps://docs.google.com/presentation/d/1M5Kt6qRMP_o-WOYwJkXifdAiedBv-E1B7zHw2T91GBA/\n\nThis should answer most of your remaining questions. Everything else can by sure be answered by googling and watching a short video on YT.\n\nAll in all the items in the menu (of your non-drawing hand) look like there's something missing. The tools seem to be incomplete when you once used Blender or other 3D modelers which are packed with lots of complex tools. A few of that features you might miss are there not all, but many.\n\nOh, oh! No more characters left\n\nLong story short: It's great! Would buy again.\n\nHelpful | 19", "chlronaldDec 25 at 11:30 AM\nFeatured missing\n\nI am a building envelope designer and I found this application does not have enough tools to meet my need.\n\nFirst of all, it needs boolean function, asap. I am surprised that a 3d modeling software doesn't have this basic function! I wanted to draw the structure , create a cut for penetration or demonstrate how to run wires and pipes while maintaining continuously of barriers.\n\nSecondly it needs a ruler measurement tools and the ability to create object with a set size. I wanted to create frame structure and different building components and stack it up lego-like to demonstrate ways to eliminate thermal bridges.\nI can kind of achieve it by using grid and eyeball the approximate size but really would like to have a precise way to build it.\n\nI am on the edge on returning this application. It is not perfect, I had to work around to barely do what I wanted. but it is the closest software on quest that can achieve what I want to do right now.\n\nHelpful | 50", "calebjadeFeb 6 at 2:59 PM\nIt's great it just needs to have more\n\nNeeds some sort of measurement funtion in the future along with other features to make this more like CAD software. If so, this would be one of the best vr tools on the market. For example, something simple but intuitive like iPads Shapr 3D cad would be amazing on this platform! Maybe even physics and turning gears, it would help so many people create. And I guarantee it would lead to more people buying vr just to access something of that quality and convenience. Set the new standard!\n\nHelpful | 8", "JackGaranziniFeb 7 at 8:27 AM\nFantastic for product design\n\nGreat for idea to 3D model in no time. Even without really knowing the controls I was able to make a chair with a figure sitting in it in under 20 mins. Now that I have learned more features, it has been a great addition to my work flow and I look forward to seeing what the updates have to come!\n\nHelpful | 2", "lumstudioJan 25 at 9:44 AM\nThis is great !\n\nI am a 3d designer and architect and was amazed by how fast and easy the gravity sketch is. For me it is the best app for oculus guest right now, waiting for an export formats update !!\n\nHelpful | 5", "Daddy_O_ShaunJan 6 at 8:56 AM\nAlex\n\nThis is an insanely powerful app. U are able to create almost anything relatively easily. I'm a student concept artist and just bought the quest, it runs very smoothly and is invaluable for my job and workflow. Would definitely recommend. Also it's super easy to get into for beginners as well as experts.\n\nHelpful | 4", "JaeElementalMar 4 at 12:15 PM\nBest Vr App for Real world Applications\n\nThe ability to export the models made in this app in addition to the SubD update make this app the most powerful for creating and using professionally.\n\nHelpful | 1", "MightyQuinnJFeb 23 at 12:33 AM\nIncredible vr art app!\n\nI love being able to create in vr, and this app opens up a whole new set of tools I can use!\n3D modeling for animating to use in videos or games and to build 3D prints for projects or gifts! The possibilities are endless!\n\nHelpful | 1", "lukasz.borosFeb 3 at 1:18 PM\nPortable sketch 3d modeler\n\nThis app is amazing - what you get here is a portable, wireless 3d modeller /sculpting app, with subobject controls. The interface is pretty innovative and efficient in vr. The only drawback is low performance in some more complex objects, but that is to be expected from snapdragon device.\n\nHelpful | 1", "jordan.caldwellFeb 12 at 2:28 PM\nAmazing app\n\nAs an interior designer who is doing a masters in VR this tool is incredible, exactly what ive needed to do my sketches in 3d with a sophisticated set of tools and abilitys to export and sync with pc. Highly reccommend for any designer\n\nHelpful | 0", "dome.nodeMar 22 at 7:01 PM\nAmazing\n\nSuper fun and intuitive\n\nHelpful | 0", "MinimalTechMar 11 at 4:36 AM\nAmazing App\n\nFeeling creative ? You can spend days using this app and letting your creativity go wild. Amazing\n\nHelpful | 1", "legozyJan 29 at 7:15 AM\nGood but still needs Improvements\n\nI look at this app as a beta version. Bc even if app is really good, there are a lot of potantial improvement ideas that can be done. I believe if i can think of these ideas, surely developers are thinking too. So i wait for the perfection. But still, good app guys\n\nHelpful | 0", "jamiefrasermcmurrayApr 30 at 7:24 PM\nGreat experience\n\nThis app really is a lot of fun. Manipulating your creations in 3D is easy and fun. Screen share and play pictionary with a group :)\n\nOnly thing that could be improved is screen share rendering doesnt include the entire view of the user. But its pretty close.\n\nHelpful | 0", "rubinkingmaApr 22 at 12:50 PM\nLove it\n\nAwesome app, it would be nice if you could lay the model flat down or an \"architecture mode\" so you can walk around in your design.\nHaven't found a way yet to walk around your designs other than actually walking around it.\nSadly I don't always have enough space to do this.\nYou can drag a model but that's not really handy with roomscale models.\nEspecially if at import the model scales weird.\n\nI'm hoping for alot of development on this one.\n\nHelpful | 0", "PhirmMay 14 at 7:19 AM\nJust Incredible\n\nI like SculptVR a lot, and I love Tilt Brush, but THIS is my desert island program. Its so well worth the money. (FYI, Im on Quest.)\n\nHelpful | 0", "fmls1989Apr 8 at 10:52 AM\nHow to polish a shape\n\nHello, I want to know how to polish a shape, when I grab the item and see the properties, I see the circles but if I pull, the shape increases, I want the oposite, when I push it, I dont see a hole, basically I want to polish a surface, i dont know if I explained properly. Thanks\n\nHelpful | 0", "ReesesbenJan 4 at 7:52 PM\nReally entertaining\n\nI made a tree. I forgot I was in VR. I got tired so I sat under my VR tree for a while. Great app a little glitchy. But I havent played in a while so maybe that got fixed.\n\nHelpful | 2", "sunandsnow24Jan 20 at 12:24 PM\nAmazing app\n\nFantastic for designing objects in VR. With the Object Export feature you can then load your objects into programs like Blender or Unity to use them in other projects.\n\nHelpful | 0", "Thr33shoesJan 13 at 8:57 PM\nCould use a few functions.\n\nNot too design savvy so not sure how complicated these suggestions might be. Distortions like grab/ pull, blend/smear, bloat/shrink designated spots not just individual part or entire piece.\n\nHelpful | 0", "wh1skyNov 8 at 2:27 PM\n\nI bought it to design things for 3D printing with the Quest but it's useless for me. Worked with some days, learned a lot. Nice to build things but useless if you want export OBJ files (the only possible format) If you export a sphere it has ~1012 faces. Looks more like a cube than a sphere. Not worth to buy to design for 3D printing / export objects.\n\n@developers, make possible to export high resolution OBJ files and/or other formats that support this.\n\nHelpful | 60", "ikeman420Jan 13 at 5:44 PM\nGod like\n\nI feel like aliens delivered a tool which has supercharged my creative process, overwhelming my senses flowing with inspiration! Gravity Sketch has transformed me. THANK YOU.\n\nHelpful | 0", "lemiron.starlingDec 12 at 8:13 AM\nMust HAVE for Designers\n\nIm still learning how to use all the functions but one can easily get started right away. Its already helped me on a life size project just in a few days of designing in the program. Also it feels very natural to sketch and build out your design and is now another tool Im going to use for my projects.\n\nHelpful | 2", "JT123457Jan 8 at 1:15 AM\nNeeds a cutting tool or rubber\n\nIt is great to use with many intuitive teachers that make it fun and easy to use but when using it no matter what I did I needed a cutting tool (like in photo shop) of if there is one Make it a lot easier to find. This would make even better than it already is.\n\nHelpful | 2", "TheGiftedOct 28 at 4:28 AM\nA must have for designers\n\nGravity Sketch was the reason I bought Quest in the first place. It is a software that once when you go through the understanding phase really expands your possibilities and bridges the gap in the workflow between sketching on paper and high fidelity 3d modeling. I recommend to watch some tutorials and get inspired by other artists. Mike Jelnek is my favourite.\n\nHelpful | 18", "ConarCDec 3 at 2:26 PM\nThe future of designing in 3D\n\nAs a concept artist, Gravity sketch allows me to design in 3D as fluidly as I could ever imagine, Gravity sketch is a must have, Ive recommended it to everyone on my team and now use it daily in my professional workflow. The addition of SubD is a game changer!\n\nHelpful | 2", "moberg1972Nov 28 at 3:46 PM\nProfessional VR workspace\n\nWith a creative approach to VR as a professional workspace, and with a clear understanding of the artists needs, the team behind GravitySketch has created a simple to use and powerful toolset that enables artistic expression and slots right into early phases of design and story oriented production. Amazing and inspiring!\n\nHelpful | 2", "adamraraJan 20 at 2:33 PM\nAmazing! Just wish we had sculpting!\n\nI don't mean subd either\n\nHelpful | 1", "MaxymvsNov 28 at 7:17 PM\nUncompromising modeling experience\n\nImpressive. As of right now this is the only Quest app that feels pro enough to use it in real life work. The only wish right know is to have more 3d file types to support for both import and export. Looking forward to SubD update and to see what is coming next\n\nHelpful | 1", "ArknangelMar 22 at 2:28 PM\nGreat for 3d object making\n\nI have been working on custom objects for a game im making and this is going to help me amp up the work flow a ton. Love the tool please keep addong features!\n\nHelpful | 0", "SlygetApr 5 at 8:44 AM\n\nVery nice, feels like ask for more performance on the quest. Think I will spend many Hours to this app\n\nHelpful | 0", "CrimsonZADec 8 at 10:51 AM\nGreat for creators\n\nThis is pretty great for creators especially since the new SubD tools, love that the developers are improving the feature set. And this being on Quest is just remarkable.\n\nHelpful | 1", "JustN3k0Dec 26 at 5:14 PM\nThe best VR app for 3D modeling\n\nVery well made and easy to use, especially comparing to competitors, definitely recommended.\n\nHelpful | 0", "TortoiseIsFasterNov 11 at 3:38 PM\nIt's very crashy.\n\nJust turn on grid and try to paint a scene using volumes and it crashes. Every time. Like clockwork.\n\nAlso the controls are rather unintuitive. The typing thing is a complete monstrosity, and some things you can point and click, while other things you have to reach out and grab (where point and click would make way more sense). I must have spent an hour trying to import something by pointing and clicking (like the rest of the menu around it), but it doesn't work, you have to reach out and grab it. Wtf guys, do some usability studies please.\n\nHelpful | 8", "ussturnipDec 28 at 11:56 PM\nthe one to beat for design\n\na very intuitive design tool. if it had boolean functions it I would be 5*.\n\nHelpful | 1", "GatadaNov 9 at 5:16 AM\nAlready Solid - with great potential!\n\nI havent used this app for more than an hour or so, however, I enjoyed the experience. I jumped right in and felt I figured it out. The user experience is solid, with possibly less polish compared to Tilt Brush - but also with (seemingly) more modeling functionality.\n\nWhen online collaboration is made available to all users in 2020, this app will be an amazing tool for ideation and conception iteration.\n\nI look forward to importing my models and start modifying them in 1:1 VR!\n\nHelpful | 2", "wagnerstechtalkJul 19, 2019 at 4:29 AM\nThis is the Quest Killer App!\n\nGravity Sketch is incredibly intuitive for designing objects in virtual space. I also took it so far as exporting the models created and 3D Printed a few of them (shown on my YT channel wagnerstechtalk). It also supports the ability to import/export reference images and objects to the cloud and share between your computer/Quest. Plenty of modeling tools for building just about anything you can imagine.\n\nIf you're wanting to bring your ideas to life, then Gravity Sketch is the killer-app. for this. By Killer-App, I mean it is the type of program that people will buy a Quest just so they can use Gravity Sketch. It's easy to learn and very powerful.\n\nHelpful | 165", "y1084110202Dec 2 at 3:23 AM\nReference image\n\nI put image in the ReferenceImage file in Android,and I can't find them.There is only the initial image guide for rift.Please fix this bug,thank you.\n\nHelpful | 0", "RuneHMFeb 24 at 8:47 PM\nNot fun\n\nI dont like it\n\nHelpful | 0", "furtinDec 16 at 12:35 PM\nUtterly useful thanks to SubD\n\nPhenomenal Tool!\nAmazing how good it performs on the Quest!\n\nHelpful | 0", "thomasmsawyerNov 23 at 12:16 PM\nI like it\n\nIts both easier and harder than it looks at the same time. Definitely takes some practice to get the hang of but extremely powerful and runs smoothly on quest thus far!\n\nHelpful | 1", "ReframeDesignDec 12 at 1:52 AM\nYes\n\nLove the intuitiveness when sketching. Looking forward to a better materials adding option.\n\nHelpful | 0", "RockyLiangiNov 26 at 12:06 PM\nGreat now Sub D has been added!\n\nI bought this before the Sub D feature was added and found it a bit limited. However, as soon as it was added bought it again and its great.\n\nHelpful | 0", "meilensteindigitalOct 23 at 1:16 PM\nLove it, its not a game ...\n\nSeriously, after watching some tuts and get more and more used to it I can say that gs rocks !\n\nUsing it on the quest makes a big difference to anything else I tried before.\n\nThe freedom of the quest is the big plus for it.\nI did not even tried it on the rift s because Im so amazed using it on the quest.\n\nAmazing how the devs got all these different options working with just two controllers.\n\nTop !\n\nHelpful | 1", "DimarinskiOct 14 at 12:23 AM\nCreativity unleashed\n\nI bought oculus quest just to use gravity sketch. GS is giving me incredible creative freedom, I don't have to think polygons and stuff I just create and later edit .I use it everyday as a professional concept artist in the game industry.\n\nHelpful | 7", "jim.stickley.3Oct 15 at 3:45 PM\nSuper awesome!\n\nThis is an awesome 3d modeling tool. I'd give 5 stars if you add a tool for parabolic surface. And I would give it six stars if I could do Boolean operations on volumes/surfaces. So that a volume could be modified by another volume (join, carve out) or create a closed volume from a set of surfaces.\n\nHelpful | 2", "VladimirMBOct 7 at 5:54 AM\nNice app..\n\nBut I dont find the way for\nImport OBJ files... maybe it is possible only using Cloud? And other thing is that It be better if include the option for draw lines in specific Degrees, it be nice for educational purposes. Thanks\n\nHelpful | 13", "MetaverseCatNov 3 at 11:19 PM\nMagnificent.\n\nUndo is always under your left thumb, where it belongs, groups work, and you can edit primitives and strokes.\n\nWhich is to say, wow, a real 3D app on the Quest! Loving it so far!\n\nHelpful | 0", "thedodeAug 29, 2019 at 10:19 PM\nMy fav app for Quest\n\nThis is what quest was built for! Im blown away again and again everything I sit down on my couch and sketch. You guys have shown us what the future like and its more freedom for creatives! Ive had some slight issues with memory on more complex shapes mainly while using the volume tool. If possible it would be great to get these tools more optimized, since the memory issue happens quite a bit and work very simple shapes.\n\nThanks for all your hard work!!\n\nHelpful | 5", "Darkcgi101Nov 13 at 5:48 AM\nGreat app. A must have.\n\nIt's amazing. Needs up to date tutorial videos. Cant wait to see where this app goes in the future.\n\nHelpful | 0", "simbr77Sep 24, 2019 at 1:07 AM\nNice curve based 3d modeling app\n\nIt works really well, is very intuitive and I like the no nonsense controls and feel. They seem to be updating regularly and I've noticed performance improvements( when making complex forms was previously causing the quest to jitter) its quite impressive given the hardware. One thing I find is that I would like a way to block out volumes better, but perhaps something like dynamesh/zspheres/sculptris is beyond the quest. Either way it's a great little nurb style modeler and worth the cash\n\nHelpful | 2", "GoonerJonSep 18, 2019 at 10:58 AM\nNo Eraser ?!\n\nHey Gravity sketch devs, this would be 5* if I could rub out small bits rather than just rely on undo.\n\nHelpful | 11", "12vdcSep 4, 2019 at 9:35 PM\n12vdc\n\nThis program has all the functions you could want but I'm finding a great deal of problems when it comes to building anything to speck along with some real big problems I am listing in this review.\nFirstly how is it that gravity sketch has no gravity? The grid is fantastic but the basic shapes don't snap properly the the grid and this is a real problem because the grid is the only way to measure anything. Importing images should not require the aid of another device. I will revise my review once I receive a response regarding the listed deficiency's\n\nHelpful | 12", "RowdyRocketNov 9 at 6:32 PM\n\nTook me a bit to get used to it but well worth it. Excellent app!\n\nHelpful | 0", "tacogalacticSep 23, 2019 at 1:06 PM\nVisualize and Create!\n\nThis is such a wonderful tool, with many more powerful features found lurking underneath. I've watched many videos on it's use and still learn new things regularly. I find my time spent in here is always productive in some way, and it's become a regular part of my creative process for some projects. I use Tilt Brush, SculptrVR and others (PC as well) but this is my go to for overall creative and prototype/3D style design.\n\nHop in, toss in some reference images and make something happen. :D\n\nHelpful | 0", "Guidance777Nov 16 at 6:54 PM\nUnbelievably powerful and easy to use!!!\n\nA+++++++++!\n\nHelpful | 1", "GNCHAPAOct 2 at 1:03 PM\nvery good\n\nthis app is awesome, reminds me of using solidworks for computer engineering. one problem i have is that when i try to get really detailed with modeling a surface it always tends to lag, like it stutters when i try to move a point of a surface that is very complex.\n\nHelpful | 0", "john.michael.5895Aug 27, 2019 at 7:22 AM\nFly, ride and chisel mode needed\n\nFantastic as you can import texture via landing pad.. But why not access via photos???\nIt would be great to include a chisel tool to mark and bore out bits\nFinally, think you could easily allow. Camera to move by itself to give a ride and a fly mode so you can explore world's you might created\n\nHelpful | 12", "steve353Aug 16, 2019 at 4:59 AM\nFantastic, but keeps crashing\n\nI was really getting into this. An amazing piece of software with tons of potential. But very frustrating because it's starting to crash on me a lot (about 5 times in the past hour and I keep losing my work, even after trying to save often, and given up). When it crashes, it usually takes me back to the library, and sometimes won't let me back in. I haven't really experienced this before (although sometimes it has 'frozen' on me, e.g. when using stroke or volume with polar symmetry) Up till now I've still been learning what GS can do, and trying fairly simple forms. But now I'm trying to create fairly complex architectural forms using surface. It seems the Quest isn't powerful enough to handle the algorithms this program throws at it.\nSo even though GS is the best program I've seen yet for the Quest, I sadly have to give it a 1. If these glitches can be fixed, then brilliant - 5 stars. But otherwise it's very frustrating to have a program that offers so much potential yet crashes when you begin to explore that potential. Hope you can fix it, because this kind of software is what I bought the Quest for.\n\nHelpful | 26\nDeveloper ResponseNov 24 at 5:45 AM\n\nWe fixed a few crash bugs in the latest update, give it another try!?", "zenmagnetsJul 21, 2019 at 10:05 PM\nThe most important app on the Quest.\n\nI you enjoyed tilt brush, gravity sketch multiplies your power of expression ten-fold. It has a learning curve, but once you are comfortable with the tools, tilt brush will feel like Microsoft Paint to Gravity Sketch's Adobe Illustrator. It does have a tendency to crash so save often.\n\nHelpful | 9\nDeveloper ResponseJul 27, 2019 at 4:33 AM\n\nSorry to hear that you are getting crashes! I would love to help you out. Are there any particular tools or features that seems to cause this? Please email me at daniel@gravitysketch.com", "SwaggybaggyboiiOct 31 at 7:21 PM\nGet it rn\n\nYes\n\nHelpful | 1", "LionAlexTAug 5, 2019 at 6:33 AM\nWow!\n\nIm used many PC and Mac based 3D design software before and now having experienced this in VR is incredible! Congrats to the creators of this new tool! Well done!\n\nThe workflow is excellent and well thought out. Took a little learning but everything including the hints over the controller buttons should be intuitive to people familiar with CAD.\n\nThe use of haptic feedback is excellent.\n\nThis feature might already be there and I will look for it but would be useful to have the ability to snap objects and perhaps guides when aligning them such as angles, distance, dimensions. Those are necessary for mechanical/architectural CAD but could be a higher priced product. As a 3D creation tool though, this is excellent and a great platform to build from. Working on 3D in a 3D environment is just such a natural experience.\n\nHelpful | 12", "utuli01Jan 2 at 10:24 PM\nExcellent\n\nThis was excellent game\n\nHelpful | 0", "stefanscheiderSep 1, 2019 at 9:48 PM\nThe missing link\n\nAbsolutely phantastic! Im working with Cinema 4D and was always looking for an organic and easy solution to create handpainted meshes. Found it here! The transfer to the landingpad is a bit unsteady - but - love this app!\n\nHelpful | 2", "brad.tucker1Jul 27, 2019 at 2:11 PM\nBetter Modeling than Tilt Brush\n\nIf you play with the tools and grid snap enough, you can make much more precise models in Gravity Sketch than Tilt Brush. If you want, it is still possible to export as an .obj to the cloud, transfer it on a computer from landingpad.me to Google Poly, then import it as an object into Tilt Brush to add final lighting and smoke effects.\n\nGravity Sketch has 2 bonus features that I did not see advertised...\n1.)It has a 3D text tool, no font choices, only 25 characters at a time, but still it's a start.\n2.)It has reference image tools built-in which support alpha channel transparency! With that, maybe your photo images could be part of the scene, not just a reference.\n\nHelpful | 12", "321MartianDesignJul 18, 2019 at 5:52 PM\nWhat an amazing app\n\nI've only scratched the surface in exploring this app but I can already tell that it is very sophisticated, complex and the most professional app available on the Quest to date. It seems geared towards industrial design, but I see great possibilities for many other disciplines as well. The ability to easily import and export models is a godsend. grouping of objects and layers are fantastic features. the video tutorials within the app did not play well for me and I'm hoping this will be fixed in an update. Great app for artists and designers.\n\nHelpful | 18", "navekioJul 18, 2019 at 10:55 AM\n\na fantastic, easy to learn, drawing and modelling experience, full tutorials, and help, exports to headset and to cloud. a very rewarding experience.\n\nHelpful | 31", "TheRealMadPenguinJul 21, 2019 at 4:19 PM\nImpressive but missing important options\n\nAn impressive app that works very intuitively. With things like boolean operation, fileting and chamfering it would even be better. Without it it is actually not usable in a (semi) professional environment. Hopefully these features will be added soon!\n\nHelpful | 19", "beyondbeliefJul 31, 2019 at 11:00 PM\nNearly there\n\nI am quite impressed with this app. Very fun to use once you get the hang of it. Being new to the 3d/vr world, I wanted to use GS for quickly throwing some models together. What I really miss are some coordinate indicators: how far away is the pointer from origin or the last point I set. Having that would add the missing star to the rating :-) Devs, any chance we can get a numeric display of those distance(s)? Maybe on the left hand controller?\n\nHelpful | 8", "el_jergasAug 14, 2019 at 9:33 AM\nAlmost the killer app for modelers\n\nYou cannot import files but as templates that you cannot modify. As soon as they fix this, Ill give it 5 stars. This limits the utility of the tool very much. That been said, this is the best 3D drawing app.\n\nHelpful | 11", "mdrazekSep 25, 2019 at 7:43 PM\nAwesome app\n\nLots of creative freedom allowed on this awesome app\n\nHelpful | 1", "RyusLightworksJul 22, 2019 at 12:40 PM\nProfessional 3d modelling tool\n\nFirst of all this is the app that you need if you are an artist.\nWhen I got the Quest I wanted to use it to create artwork and had high hopes for Tilt Quest, but that one let me down big time because it had a lot of essential features missing.\nGravity Sketch is much different. It offers all the key features you need for professional 3d modelling. It is also not so restrictive with file management, so you don't have to use some cloud service to share sketches to other devices. It also lets import and export obj files and reference images without any problem. The UI and controls are well designed, simple and to the point. True you don't have some fancy brushes like fire or sparkles but for what this app is meant for you don't really need such fancy effects.\nIt all depends what you want to do with it. If you want to dabble a bit and do some basic drawing with lots of eye catching effects then Tilt is great, but for any kind of sophisticated or professional work Gravity is the one you will want. Both are great, but for the purpose I want to use it only Gravity offers essential features.\n\nHelpful | 8", "PinkGreaseJul 29, 2019 at 1:13 PM\nMy best purchase yet!\n\nI never thought Id see this app here, apps for design requires a lot of ram, but magically it made it here. It didnt make any compromises, it is the full program, and I can use it and design in 3D wherever I am. I still take it to zbrush for some final touches, or surface painter for adding textures and rendering, but anyone can get into this app in no time at all and start designing like a pro.\n\nHelpful | 4", "GregMadisonJul 20, 2019 at 7:08 PM\nA game changer :)\n\nIt's incredible to me that a tool so powerful is now accessible to so many users. Could be the Adobe Illustrator of 3D, with almost no learning curve.\n\nHelpful | 7", "spenver64Jul 31, 2019 at 10:05 AM\nAmazing art tool\n\nI've always wanted to make 3d scenes but it was always to hard to figure out. I just made my first little scene in about 40 minutes witch I would never be able to do on a pc. Everything feels natural and all the tools are easy to learn how to use. I highly recommend it\n\nHelpful | 3", "aporwal01Jan 3 at 12:18 AM\nQuest best game\n\nBest game\n\nHelpful | 0", "oujingwenJul 19, 2019 at 11:31 AM\n\nthat being said, its a killer app, easy to learn and better than I expected. tutorials are not smooth, but its okay just go to website and read online. it would be nice watching tutorial directly in VR of course. overall its a very nice app. nice work!\n\nHelpful | 9", "tbhatnagar01Jan 3 at 1:47 AM\nGgb\n\nVyhb\n\nHelpful | 0", "Kobi_KobiashiJul 26, 2019 at 4:20 PM\nGreat but crashes\n\nIve always found 3D modelling tedious and frustrating. This is a game changer. I love it. However, it has crashed on me within ten minutes of launching the app, every time. Will be happy to increase my rating once I can work for longer than 10 min without having to relaunch.\n\nHelpful | 5\nDeveloper ResponseJul 27, 2019 at 4:33 AM\n\nSorry to hear that you are getting crashes! I would love to help you out. Are there any particular tools or features that seems to cause this? Please email me at daniel@gravitysketch.com", "abydosanSep 6, 2019 at 11:33 AM\nA perfect prototype designer\n\nHungarian review: https://www.vrhir.hu/bemutatok_tesztek/gravity-sketch-oculus-quest-rift-bemutato/\n\nHelpful | 0", "gupJul 18, 2019 at 11:10 AM\nA full experience\n\nI thought the limiting capability of the quest meant that it was going to have deep compromises. But I can barely find any! The number of features can feel overwhelming, but it just shows the power of this software.\n\nHelpful | 13", "danwhutchJul 19, 2019 at 12:42 PM\nBrilliant\n\nOnly had this a day but already having a lot of fun. I've noticed the tutorial videos are a bit jerky, stop half way through and audio cuts out. But for now I'm happy to read the tutorial online then jump back in but would be great if that got fixed!\n\nHelpful | 7", "alan.trulyAug 10, 2019 at 11:04 AM\nJust starting to explore, but wow\n\nThis is more than I was hoping for. Really amazing experience to stretch out a surface with VR hands.\n\nHelpful | 2", "ruxpe123Sep 21, 2019 at 5:35 AM\nCrashes a lot\n\nI just started using the app, But it crashes a lot and the save function is hit or miss. There is not eraser function so you have to undo a lot. The app has promise but still buggy.\n\nHelpful | 0", "pabloosplAug 7, 2019 at 11:00 AM\nAbsolutly must have position\n\nThis is what i was looking for! Its like a sandbox game, where you can create everythink. Easy to learn and easy to use. Good job\n\nHelpful | 1", "Lyre-eAug 3, 2019 at 4:34 PM\nAwesome\n\nOculus Quest becomes a tool with this app.\n\nHelpful | 4", "kubic_Jul 22, 2019 at 1:33 AM\nDemocratising Drawing\n\nIntuitive interface and great for learners !\n\nHelpful | 2", "grecolokSep 3, 2019 at 7:38 AM\nwhy always only shows need update\n\neverytime i try to open it just shows need wifi to update , but dont know what happen cant open it\n\nHelpful | 1", "MightyMcnuggetsAug 25, 2019 at 7:01 PM\nNot very fun...\n\nI couldnt find any tutorials so its very boring to me. Very frustrating and it crashes a lot:(\n\nHelpful | 1"]