{"App Title": "Guided Tai Chi", "App description": "Refresh your mind, body, and spirit with 200+ Tai Chi inspired workouts across 20 beautiful nature settings!\n\nExperience a modern reimagining of an ancient practice.\n\nRECHARGE IN BEAUTIFUL NATURE ENVIRONMENTS\nDiscover the wilds of nature, in the comfort of your own home, with 3-minute to 60-minute sessions.\n\nFIND YOUR FLOW\nLet go of tension and stress across 100 meditative sessions in FLOW MODE. A perfect gateway to the concepts of Tai Chi for beginners. Find yourself in the flow, refreshed, and energized.\n\nCOMPETE ACROSS THE GLOBE\nWin points for perfect form across 100 sessions in ARCADE MODE. Or challenge yourself with the randomized WORLD TOUR MODE, a 15, 30, or 60-minute Tai Chi endurance marathon. Strengthen and tone your body, while relaxing your mind.\n\nCUSTOMIZE YOUR WORKOUT\nMake your practice perfect for you through highly adjustable settings. Optional foot, teacher, audio, and vibration refinement to fit your unique needs\n\nFind your happy place.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Relaxation/Meditation, Simulation, Sports", "Languages": "English", "Version + Release Notes": "1.2.10", "Developer": "Cubicle Ninjas", "Publisher": "Cubicle Ninjas", "Website": "http://guidedtaichi.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Privacy Policy of Guided Tai Chi\n\nGuided Tai Chi collects some Personal Data from its Users.\n\nPolicy summary\nPersonal Data collected for the following purposes and using the following services:\nAdvertising\nGoogle AdSense and Google Ads Similar audiences\n\nPersonal Data: Cookies; Usage Data\n\nAnalytics\nGoogle Ads conversion tracking and Google Analytics\n\nPersonal Data: Cookies; Usage Data\n\nUser ID extension for Google Analytics\n\nPersonal Data: Cookies\n\nUnity Analytics\n\nPersonal Data: Usage Data; various types of Data as specified in the privacy policy of the service\n\nHosting and backend infrastructure\nAmazon Web Services (AWS) and DigitalOcean\n\nPersonal Data: various types of Data as specified in the privacy policy of the service\n\nLocation-based interactions\nNon-continuous geolocation\n\nPersonal Data: geographic position\n\nRegistration and authentication\nFacebook Authentication\n\nPersonal Data: various types of Data as specified in the privacy policy of the service\n\nRemarketing and behavioral targeting\nGoogle Ads Remarketing, Google Ad Manager Audience Extension, Facebook Remarketing and Remarketing with Google Analytics\n\nPersonal Data: Cookies; Usage Data\n\nFurther information about Personal Data\nThe Service is not directed to children under the age of 13\n\nUsers declare themselves to be adult according to their applicable legislation. Minors may use Guided Tai Chi only with the assistance of a parent or guardian. Under no circumstance persons under the age of 13 may use Guided Tai Chi.\n\nContact information\nOwner and Data Controller\n\nGuided Tai Chi is a product of Cubicle Ninjas LLC 800 Roosevelt Road D115, Glen Ellyn, IL 60137\n\nOwner contact email: privacy@cubicleninjas.com\n\nFull policy\nOwner and Data Controller\n\nGuided Tai Chi is a product of Cubicle Ninjas LLC 800 Roosevelt Road D115, Glen Ellyn, IL 60137\n\nOwner contact email: privacy@cubicleninjas.com\n\nTypes of Data collected\n\nAmong the types of Personal Data that Guided Tai Chi collects, by itself or through third parties, there are: Cookies; Usage Data; geographic position.\n\nComplete details on each type of Personal Data collected are provided in the dedicated sections of this privacy policy or by specific explanation texts displayed prior to the Data collection.\nPersonal Data may be freely provided by the User, or, in case of Usage Data, collected automatically when using Guided Tai Chi.\nUnless specified otherwise, all Data requested by Guided Tai Chi is mandatory and failure to provide this Data may make it impossible for Guided Tai Chi to provide its services. In cases where Guided Tai Chi specifically states that some Data is not mandatory, Users are free not to communicate this Data without consequences to the availability or the functioning of the Service.\nUsers who are uncertain about which Personal Data is mandatory are welcome to contact the Owner.\nAny use of Cookies  or of other tracking tools  by Guided Tai Chi or by the owners of third-party services used by Guided Tai Chi serves the purpose of providing the Service required by the User, in addition to any other purposes described in the present document and in the Cookie Policy, if available.\n\nUsers are responsible for any third-party Personal Data obtained, published or shared through Guided Tai Chi and confirm that they have the third party's consent to provide the Data to the Owner.\n\nMode and place of processing the Data\nMethods of processing\n\nThe Owner takes appropriate security measures to prevent unauthorized access, disclosure, modification, or unauthorized destruction of the Data.\nThe Data processing is carried out using computers and/or IT enabled tools, following organizational procedures and modes strictly related to the purposes indicated. In addition to the Owner, in some cases, the Data may be accessible to certain types of persons in charge, involved with the operation of Guided Tai Chi (administration, sales, marketing, legal, system administration) or external parties (such as third-party technical service providers, mail carriers, hosting providers, IT companies, communications agencies) appointed, if necessary, as Data Processors by the Owner. The updated list of these parties may be requested from the Owner at any time.\n\nLegal basis of processing\n\nThe Owner may process Personal Data relating to Users if one of the following applies:\n\nUsers have given their consent for one or more specific purposes. Note: Under some legislations the Owner may be allowed to process Personal Data until the User objects to such processing (opt-out), without having to rely on consent or any other of the following legal bases. This, however, does not apply, whenever the processing of Personal Data is subject to European data protection law;\nprovision of Data is necessary for the performance of an agreement with the User and/or for any pre-contractual obligations thereof;\nprocessing is necessary for compliance with a legal obligation to which the Owner is subject;\nprocessing is related to a task that is carried out in the public interest or in the exercise of official authority vested in the Owner;\nprocessing is necessary for the purposes of the legitimate interests pursued by the Owner or by a third party.\n\nIn any case, the Owner will gladly help to clarify the specific legal basis that applies to the processing, and in particular whether the provision of Personal Data is a statutory or contractual requirement, or a requirement necessary to enter into a contract.\n\nPlace\n\nThe Data is processed at the Owner's operating offices and in any other places where the parties involved in the processing are located.\n\nDepending on the User's location, data transfers may involve transferring the User's Data to a country other than their own. To find out more about the place of processing of such transferred Data, Users can check the section containing details about the processing of Personal Data.\n\nUsers are also entitled to learn about the legal basis of Data transfers to a country outside the European Union or to any international organization governed by public international law or set up by two or more countries, such as the UN, and about the security measures taken by the Owner to safeguard their Data.\n\nIf any such transfer takes place, Users can find out more by checking the relevant sections of this document or inquire with the Owner using the information provided in the contact section.\n\nRetention time\n\nPersonal Data shall be processed and stored for as long as required by the purpose they have been collected for.\n\nTherefore:\n\nPersonal Data collected for purposes related to the performance of a contract between the Owner and the User shall be retained until such contract has been fully performed.\nPersonal Data collected for the purposes of the Owners legitimate interests shall be retained as long as needed to fulfill such purposes. Users may find specific information regarding the legitimate interests pursued by the Owner within the relevant sections of this document or by contacting the Owner.\n\nThe Owner may be allowed to retain Personal Data for a longer period whenever the User has given consent to such processing, as long as such consent is not withdrawn. Furthermore, the Owner may be obliged to retain Personal Data for a longer period whenever required to do so for the performance of a legal obligation or upon order of an authority.\n\nOnce the retention period expires, Personal Data shall be deleted. Therefore, the right to access, the right to erasure, the right to rectification and the right to data portability cannot be enforced after expiration of the retention period.\n\nThe purposes of processing\n\nThe Data concerning the User is collected to allow the Owner to provide its Services, as well as for the following purposes: Advertising, Hosting and backend infrastructure, Registration and authentication, Analytics, Remarketing and behavioral targeting and Location-based interactions.\n\nUsers can find further detailed information about such purposes of processing and about the specific Personal Data used for each purpose in the respective sections of this document.\n\nDetailed information on the processing of Personal Data\n\nPersonal Data is collected for the following purposes and using the following services:\n\nAdvertising\nAnalytics\nHosting and backend infrastructure\nLocation-based interactions\nRegistration and authentication\nRemarketing and behavioral targeting\nFurther information about Personal Data\nThe Service is not directed to children under the age of 13\nThe rights of Users\n\nUsers may exercise certain rights regarding their Data processed by the Owner.\n\nIn particular, Users have the right to do the following:\n\nWithdraw their consent at any time. Users have the right to withdraw consent where they have previously given their consent to the processing of their Personal Data.\nObject to processing of their Data. Users have the right to object to the processing of their Data if the processing is carried out on a legal basis other than consent. Further details are provided in the dedicated section below.\nAccess their Data. Users have the right to learn if Data is being processed by the Owner, obtain disclosure regarding certain aspects of the processing and obtain a copy of the Data undergoing processing.\nVerify and seek rectification. Users have the right to verify the accuracy of their Data and ask for it to be updated or corrected.\nRestrict the processing of their Data. Users have the right, under certain circumstances, to restrict the processing of their Data. In this case, the Owner will not process their Data for any purpose other than storing it.\nHave their Personal Data deleted or otherwise removed. Users have the right, under certain circumstances, to obtain the erasure of their Data from the Owner.\nReceive their Data and have it transferred to another controller. Users have the right to receive their Data in a structured, commonly used and machine readable format and, if technically feasible, to have it transmitted to another controller without any hindrance. This provision is applicable provided that the Data is processed by automated means and that the processing is based on the User's consent, on a contract which the User is part of or on pre-contractual obligations thereof.\nLodge a complaint. Users have the right to bring a claim before their competent data protection authority.\nDetails about the right to object to processing\n\nWhere Personal Data is processed for a public interest, in the exercise of an official authority vested in the Owner or for the purposes of the legitimate interests pursued by the Owner, Users may object to such processing by providing a ground related to their particular situation to justify the objection.\n\nUsers must know that, however, should their Personal Data be processed for direct marketing purposes, they can object to that processing at any time without providing any justification. To learn, whether the Owner is processing Personal Data for direct marketing purposes, Users may refer to the relevant sections of this document.\n\nHow to exercise these rights\n\nAny requests to exercise User rights can be directed to the Owner through the contact details provided in this document. These requests can be exercised free of charge and will be addressed by the Owner as early as possible and always within one month.\n\nAdditional information about Data collection and processing\nLegal action\n\nThe User's Personal Data may be used for legal purposes by the Owner in Court or in the stages leading to possible legal action arising from improper use of Guided Tai Chi or the related Services.\nThe User declares to be aware that the Owner may be required to reveal personal data upon request of public authorities.\n\nAdditional information about User's Personal Data\n\nIn addition to the information contained in this privacy policy, Guided Tai Chi may provide the User with additional and contextual information concerning particular Services or the collection and processing of Personal Data upon request.\n\nSystem logs and maintenance\n\nFor operation and maintenance purposes, Guided Tai Chi and any third-party services may collect files that record interaction with Guided Tai Chi (System logs) use other Personal Data (such as the IP Address) for this purpose.\n\nInformation not contained in this policy\n\nMore details concerning the collection or processing of Personal Data may be requested from the Owner at any time. Please see the contact information at the beginning of this document.\n\nHow Do Not Track requests are handled\n\nGuided Tai Chi does not support Do Not Track requests.\nTo determine whether any of the third-party services it uses honor the Do Not Track requests, please read their privacy policies.\n\nChanges to this privacy policy\n\nThe Owner reserves the right to make changes to this privacy policy at any time by giving notice to its Users on this page and possibly within Guided Tai Chi and/or - as far as technically and legally feasible - sending a notice to Users via any contact information available to the Owner. It is strongly recommended to check this page often, referring to the date of the last modification listed at the bottom.\n\nShould the changes affect processing activities performed on the basis of the Users consent, the Owner shall collect new consent from the User, where required.\n\nDefinitions and legal references\n\nLatest update: May 13, 2019\n\niubenda hosts this content and only collects the Personal Data strictly necessary for it to be provided.", "Developer Terms of Service": "BUZZ\nMEDIA\nABOUT\nBUSINESS LICENSING\nDOWNLOAD\nEULA\n\t\nEnd-User License Agreement (Agreement)\n\nLast updated: February 02, 2017\n\nPlease read this End-User License Agreement (Agreement) carefully before clicking the I Agree button, downloading or using Guided Meditation VR (Application).\n\nBy clicking the I Agree button, downloading or using the Application, you are agreeing to be bound by the terms and conditions of this Agreement.\n\nThis Agreement is a legal agreement between you (either an individual or a single entity) and Cubicle Ninjas LLC and it governs your use of the Application made available to you by Cubicle Ninjas LLC.\n\nIf you do not agree to the terms of this Agreement, do not click on the I Agree button and do not download or use the Application.\n\nThe Application is licensed, not sold, to you by Cubicle Ninjas LLC for use strictly in accordance with the terms of this Agreement.\n\nLicense\n\nCubicle Ninjas LLC grants you a revocable, non-exclusive, non-transferable, limited license to download, install and use the Application solely for your personal, non-commercial purposes strictly in accordance with the terms of this Agreement.\n\nRestrictions\n\nYou agree not to, and you will not permit others to:\n\nlicense, sell, rent, lease, assign, distribute, transmit, host, outsource, disclose or otherwise commercially exploit the Application or make the Application available to any third party.\ncopy or use the Application for any purpose other than as permitted under the above section License.\nmodify, make derivative works of, disassemble, decrypt, reverse compile or reverse engineer any part of the Application.\nremove, alter or obscure any proprietary notice (including any notice of copyright or trademark) of Cubicle Ninjas LLC or its affiliates, partners, suppliers or the licensors of the Application.\n\nIntellectual Property\n\nThe Application, including without limitation all copyrights, patents, trademarks, trade secrets and other intellectual property rights are, and shall remain, the sole and exclusive property of Cubicle Ninjas LLC.\n\nYour Suggestions\n\nAny feedback, comments, ideas, improvements or suggestions (collectively, Suggestions) provided by you to Cubicle Ninjas LLC with respect to the Application shall remain the sole and exclusive property of Cubicle Ninjas LLC.\n\nCubicle Ninjas LLC shall be free to use, copy, modify, publish, or redistribute the Suggestions for any purpose and in any way without any credit or any compensation to you.\n\nModifications to Application\n\nCubicle Ninjas LLC reserves the right to modify, suspend or discontinue, temporarily or permanently, the Application or any service to which it connects, with or without notice and without liability to you.\n\nUpdates to Application\n\nCubicle Ninjas LLC may from time to time provide enhancements or improvements to the features/functionality of the Application, which may include patches, bug fixes, updates, upgrades and other modifications (Updates).\n\nUpdates may modify or delete certain features and/or functionalities of the Application. You agree that Cubicle Ninjas LLC has no obligation to (i) provide any Updates, or (ii) continue to provide or enable any particular features and/or functionalities of the Application to you.\n\nYou further agree that all Updates will be (i) deemed to constitute an integral part of the Application, and (ii) subject to the terms and conditions of this Agreement.\n\nThird-Party Services\n\nThe Application may display, include or make available third-party content (including data, information, applications and other products services) or provide links to third-party websites or services (Third-Party Services).\n\nYou acknowledge and agree that Cubicle Ninjas LLC shall not be responsible for any Third-Party Services, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality or any other aspect thereof. Cubicle Ninjas LLC does not assume and shall not have any liability or responsibility to you or any other person or entity for any Third-Party Services.\n\nThird-Party Services and links thereto are provided solely as a convenience to you and you access and use them entirely at your own risk and subject to such third parties terms and conditions.\n\nPrivacy Policy\n\nCubicle Ninjas LLC collects, stores, maintains, and shares information about you in accordance with its Privacy Policy, which is available at https://www.iubenda.com/privacy-policy/7856012. By accepting this Agreement, you acknowledge that you hereby agree and consent to the terms and conditions of our Privacy Policy.\n\nTerm and Termination\n\nThis Agreement shall remain in effect until terminated by you or Cubicle Ninjas LLC.\n\nCubicle Ninjas LLC may, in its sole discretion, at any time and for any or no reason, suspend or terminate this Agreement with or without prior notice.\n\nThis Agreement will terminate immediately, without prior notice from Cubicle Ninjas LLC, in the event that you fail to comply with any provision of this Agreement. You may also terminate this Agreement by deleting the Application and all copies thereof from your mobile device or from your computer.\n\nUpon termination of this Agreement, you shall cease all use of the Application and delete all copies of the Application from your mobile device or from your computer.\n\nTermination of this Agreement will not limit any of Cubicle Ninjas LLCs rights or remedies at law or in equity in case of breach by you (during the term of this Agreement) of any of your obligations under the present Agreement.\n\nIndemnification\n\nYou agree to indemnify and hold Cubicle Ninjas LLC and its parents, subsidiaries, affiliates, officers, employees, agents, partners and licensors (if any) harmless from any claim or demand, including reasonable attorneys fees, due to or arising out of your: (a) use of the Application; (b) violation of this Agreement or any law or regulation; or (c) violation of any right of a third party.\n\nNo Warranties\n\nThe Application is provided to you AS IS and AS AVAILABLE and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, Cubicle Ninjas LLC, on its own behalf and on behalf of its affiliates and its and their respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory or otherwise, with respect to the Application, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage or trade practice. Without limitation to the foregoing, Cubicle Ninjas LLC provides no warranty or undertaking, and makes no representation of any kind that the Application will meet your requirements, achieve any intended results, be compatible or work with any other software, applications, systems or services, operate without interruption, meet any performance or reliability standards or be error free or that any errors or defects can or will be corrected.\n\nWithout limiting the foregoing, neither Cubicle Ninjas LLC nor any Cubicle Ninjas LLCs provider makes any representation or warranty of any kind, express or implied: (i) as to the operation or availability of the Application, or the information, content, and materials or products included thereon; (ii) that the Application will be uninterrupted or error-free; (iii) as to the accuracy, reliability, or currency of any information or content provided through the Application; or (iv) that the Application, its servers, the content, or e-mails sent from or on behalf of Cubicle Ninjas LLC are free of viruses, scripts, trojan horses, worms, malware, timebombs or other harmful components.\n\nSome jurisdictions do not allow the exclusion of or limitations on implied warranties or the limitations on the applicable statutory rights of a consumer, so some or all of the above exclusions and limitations may not apply to you.\n\nLimitation of Liability\n\nNotwithstanding any damages that you might incur, the entire liability of Cubicle Ninjas LLC and any of its suppliers under any provision of this Agreement and your exclusive remedy for all of the foregoing shall be limited to the amount actually paid by you for the Application.\n\nTo the maximum extent permitted by applicable law, in no event shall Cubicle Ninjas LLC or its suppliers be liable for any special, incidental, indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, for loss of data or other information, for business interruption, for personal injury, for loss of privacy arising out of or in any way related to the use of or inability to use the Application, third-party software and/or third-party hardware used with the Application, or otherwise in connection with any provision of this Agreement), even if Cubicle Ninjas LLC or any supplier has been advised of the possibility of such damages and even if the remedy fails of its essential purpose.\n\nSome states/jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so the above limitation or exclusion may not apply to you.\n\nSeverability\n\nIf any provision of this Agreement is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect.\n\nWaiver\n\nExcept as provided herein, the failure to exercise a right or to require performance of an obligation under this Agreement shall not effect a partys ability to exercise such right or require such performance at any time thereafter nor shall be the waiver of a breach constitute waiver of any subsequent breach.\n\nFor U.S. Government End Users\n\nThe Application and related documentation are Commercial Items, as that term is defined under 48 C.F.R. 2.101, consisting of Commercial Computer Software and Commercial Computer Software Documentation, as such terms are used under 48 C.F.R. 12.212 or 48 C.F.R. 227.7202, as applicable. In accordance with 48 C.F.R. 12.212 or 48 C.F.R. 227.7202-1 through 227.7202-4, as applicable, the Commercial Computer Software and Commercial Computer Software Documentation are being licensed to U.S. Government end users (a) only as Commercial Items and (b) with only those rights as are granted to all other end users pursuant to the terms and conditions herein.\n\nExport Compliance\n\nYou may not export or re-export the Application except as authorized by United States law and the laws of the jurisdiction in which the Application was obtained.\n\nIn particular, but without limitation, the Application may not be exported or re-exported (a) into or to a nation or a resident of any U.S. embargoed countries or (b) to anyone on the U.S. Treasury Departments list of Specially Designated Nationals or the U.S. Department of Commerce Denied Persons List or Entity List.\n\nBy installing or using any component of the Application, you represent and warrant that you are not located in, under control of, or a national or resident of any such country or on any such list.\n\nAmendments to this Agreement\n\nCubicle Ninjas LLC reserves the right, at its sole discretion, to modify or replace this Agreement at any time. If a revision is material we will provide at least 30 days notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.\n\nBy continuing to access or use our Application after any revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, you are no longer authorized to use the Application.\n\nGoverning Law\n\nThe laws of Illinois, United States, excluding its conflicts of law rules, shall govern this Agreement and your use of the Application. Your use of the Application may also be subject to other local, state, national, or international laws.\n\nThis Agreement shall not be governed by the United Nations Convention on Contracts for the International Sale of Good.\n\nContact Information\n\nIf you have any questions about this Agreement, please contact us.\n\nEntire Agreement\n\nThe Agreement constitutes the entire agreement between you and Cubicle Ninjas LLC regarding your use of the Application and supersedes all prior and contemporaneous written or oral agreements between you and Cubicle Ninjas LLC.\n\nYou may be subject to additional terms and conditions that apply when you use or purchase other Cubicle Ninjas LLCs services, which Cubicle Ninjas LLC will provide to you at the time of such use or purchase.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n     Copyright Cubicle Ninjas. Made with Love.\n\nPrivacy Policy\nEULA", "Space Required": "1.67 GB"}



["5 stars\n43%\n4 stars\n26%\n3 stars\n11%\n2 stars\n9%\n1 star\n10%", "R_Steelman61Jul 13 at 3:55 PM\nJuly 2020 - New Update!\n\nJust wanted to add that even over just the past few weeks ive seen a few updates trickle out fixing small issues since the major update. So good to see the continued involvement and fixes coming out. Excited about the future of this app again!\nI've had this app since its release about a year ago. Used to use it almost every day but lost interest and feared it abandoned. I used to have a daily routine, do a 5 minute session, a 3 minute arcade and 5 minute stretch and meditate using the explore option. Now this update has rekindled my interest. Think of this as Tai Chi Lite but the environments, music and meditative atmosphere is where its at. And that's perfect for me. The new environments look great, more options have been added, new session lengths. And i hear hand tracking is on its way?! Very excited to get back into this! Going to start my routine back up! Don't forget at the opening menu -turn around 180 degrees and look behind you for the explore option. I like to use this just to sit in their environments and stretch and meditate.\nOne issue i have noted is that in Arcade mode the update cant seem to connect to the internet source for the leaderboards.\n\nHelpful | 66", "umbralstarJun 30 at 9:58 PM\nGood workout!\n\nI am a complete newbie to tai-chi, and thought I'd give this a go as I have arthritis, and wanted a gentle exercise. After a few 5 minute sessions and another day a 15 minute session I can feel the burn on my upper back. In these early stages I'm really trying to focus on getting the posture and position right, what brings me to my complaint with the game. It seems that whenever the teachers stretch out front, the footing below you moves backwards, so you have to readjust. There is also no auditory instructions on when the stance is changing, where your feet should be place or knee should bend. I would often find myself looking at my hands only to look up and see the teacher on one leg.\n\nIn all its enjoyable, and I will carry on in hopes of improvement of my upper body.\n\nHelpful | 16", "jobbie1kinobi14 days ago\nGreat app, updates are fantastic.\n\nI am a huge fan of Guided Meditation VR on the Oculus Go and was disappointed it didnt port to the Quest. This is the next best thing by the same developers. The environments are really well realised, the spoken guide is nice and mellow without being intrusive, I believe its the same teacher who did the Yoga Nidra on Guided Meditation and she is really good. As a stand-alone experience and a gentle introduction to Thai Chi this is great. If Im honest though it does make me wish that Guided Meditation VR could also be ported as the graphics and use of depth and detail in this makes me think they could really do an amazing job with it. In fact some of the environments in in this game are the same ones used in Guided Meditation, perhaps some of the audio from that app could be combined into this to allow it to fit both purposes or as a paid DLC.\n\nHelpful | 2", "Megami195Jul 25 at 8:49 AM\nGood overall\n\nI took Tai Chi years ago and always wanted to get back into it. This seems like a great way to get into it at home. It would be nice to enable hand tracking in the game so you can do the proper movements with your hands and not have to hold the controllers. I need to find a bigger space to do this because even on the small guardian mode, I still end up bumping into my virtual walls\n\nHelpful | 3", "DismalMoronMay 3 at 3:19 AM\nGood, with room for improvement\n\nThe game is pretty solid for relaxation and becoming more aware of yourself and your body. The movements are very similar to Tai Chi and, for anyone that is new to this martial art, will help them learn how to be comfortable while performing many of the major movements.\n\nWith regard to features: the music and environment are both pleasant, with many options to choose from. If music or nature are not your thing, you can turn either or both off. The only major distraction was the guide. At times, the voice was a welcome corrective alert, making me aware that I had moved too fast. Other times, being told to become more aware of the Earth was irritating, and highly repetitive. That aside, it did prove useful on some occasions, especially if I started moving into a form that wasn't where the guide was headed.\n\nOn the topic of forms, there did not seem to be any clearly labeled forms, which was a major detractor for me. Part of value in Tai Chi is connecting to others, and without those labeled forms, we lose some of the history and connections to the culture it came from.\n\nFor a virtual reality instruction set, this is one of the better experiences I've had, especially with the semi-transparent demonstration dummy. It addresses one of the major problems with learning at home in that you normally cannot see what the instructor is doing on the side facing away from you. This was a beautiful touch of ingenuity that I must applaud.\n\nOverall, this is a great addition to my library and I'd recommend it for anyone interested in body conditioning for Tai Chi or just plain relaxing. In the future, I would really appreciate the ability to turn off the voice-guidance. Putting in a visual cue, like gently fading the background to monochrome or having the controllers buzz only when moving completely out of the circles would be a good alternative and provide a more accessible experience for people with hearing impairments. An additional list with the names and movements for some of the better-known forms would also be a welcome improvement. Even without those things though, this is spot-on for an enjoyable 4 stars.\n\nHelpful | 107\nDeveloper ResponseJun 2 at 12:38 PM\n\nThanks so much for your detailed thoughts! Reviews like this help us make better experiences, so thank you again for your time. One challenge we've had is walking a line between respecting classical Tai Chi and modernizing it for where the technology needs exist. For most users, the 24 short form would require more space than in their living spaces, with complex hand and foot combos that would make their heads spin. We never want to frustrate, which is hard because we also don't want to show disrespect. So, this is often why we don't discuss the culture and move set names, as this is our interpretation of each. There is a fine, delicate, and very personal line we want to be mindful of, which we're happy on airing on the side of caution. Thank you for your guide feedback. This audio will be optional in FLOW MODE in an upcoming release. Regarding teachers, we have an update this month which will give much more granular control over these. The ability to turn off or on, change direction, as it seems many people prefer different things. Your hearing impairment accessibility ideas are wonderful. We've added these to our internal list for integration. This month's update will feature options around inverting vibrations so it may improve this experience. Movement list is quite clever and we've added this into our roadmap. This may allow us to share these in a way for those curious. Hand tracking is coming soon as well. But first, we're going to be adding 10 new environments (for a total of 21), new modes and new sessions, and dozens of new feature requests/refinements early this month. Thank you again and wishing you happy continued adventures in Guided Tai Chi!", "sandra.chung18 days ago\nRelaxing and enjoyable, most of the time\n\nMy only problem I have is it seems to lead with the right leg more than moving the left leg. That in itself isn't a deal breaker. Also, I used to take Tai Chi classes before the knee surgery,, so I would call this more like \"Tai Chi-esque\". Some of the moves are the same, but some, not so much. But still a good relaxing, 'soft' exercise program.\n\nHelpful | 0", "AspenScythe17 days ago\nNot for short people\n\nThe concept of this game is great. I really wish it worked for me. Unfortunately, even with calibrating my arm length, it's still not accounting for my short legs. This means all the movements are going out of reach for me, so it's not relaxing at all and I can't stand it. Please add some way to manually set leg / torso length too. Or maybe just a manual height calibration?\n\nHelpful | 2", "SnowSnail11 days ago\nEnjoyable but could use improvement\n\nIve been playing at least a five minute session every day since getting this app. Soothing music, environments, and helpful guide with the teacher. The foot tracking can be a little challenging to follow when busy paying attention to the hand motions. I wish it would calibrate for height since the teachers shoulder height seems to be above my head and I am 56, and when following the figure my arm positions are always higher than what the teacher shows relative to the body. I have arms calibrated but am occasionally still stretched beyond the guardian in small guardian mode. Excited to read that hand tracking is coming in future update since that would help feel more natural. As is, its still definitely worth the money for a good meditation and stretching session.\n\nHelpful | 0", "ArthurShagbrakeJul 9 at 10:09 AM\nRecent update\n\nHi, firstly I would like to say that I have enjoyed this app since I purchased my quest and have spent many a happy hour tai chi ing, if that is a thing.\n\nI am a big fan of the world tour and was pleased to see a 15,30 and 60 minute session in the update. However I tried the 30 min first and that lasted an hour, still I was pleased to finish it before seeing the message :- Cannot connect to leaderboard servers. Please check your internet connection. Which of course I did and everything seemed ok. The same happened with both the 15 and 60 min sessions so I would appreciate your advice on how this issue may be resolved?\n\nThe new locations are excellent however having got used to the various routines using a static backfoot and a moving front I am having trouble with the new routines which seem to move the backfoot outside the circle. Maybe this is just a case of me getting used to this but am confused as to why you made this change?\n\nI have tried a few of the old routines in the flow section and they seem to be as before which I find a bit confusing as I assumed the world tour would just select routines from the flow repertoire.\n\nThe other thing about the new routines is that they dont seem to encompass any lateral movement. This does tend to rather limit the extent of the benefit of stretching various muscles in various directions.\n\nLove the fact you can turn the clock off so you can just get lost in the routine. It maybe that the issues are mainly in the World tour section but would appreciate some feedback just to reassure myself that I am not going totally mad. I was joint leader on the world tour leader board before the update so hope to improve on that in the future.\n\nCant reiterate enough that I love this app and understand that there are bound to be teething problems. Still worth the money in my opinion.\n\nThanks in advance\nBob\n\nHelpful | 3\nDeveloper ResponseJul 13 at 9:42 AM\n\nThank you so much for your thoughtful feedback and kind words! Our sincerest apologies on the leaderboard bug. This was occurring if the connection was lost at any point during play. Since World Tour is longer it was much more likely to occur. We rewrote our system so it now will access and display properly even with a brief loss of connection. Again, this is a bummer and we apologize for this frustration. You are correct that World Tour selects a random set of sessions and environments that align to your ideal session time. But we'll look into which subset of these sessions are selected, as they might be pulling from arcade as well. If so, we will remove this so it is only Flow Mode content. This is a very sharp observation and we're grateful for your flagging it! We can't wait to share the upcoming Pure Mode, which is just you and teacher. No UI. No paths or balls. This will eventually contain the full 24 short-form. Wishing you many adventures ahead in Guided Tai Chi!", "JavrielJul 26 at 7:26 PM\nFun and useful app\n\nI've not played too much, but I found the app behaving like my arms are massively long. I fell once trying to reach forward (through my guardian) to follow the flow. Thankfully, no injuries.\n\nI've seen someone mention calibration for their arms on another review but I didn't see an option for this in the settings of the app, but I'll check it tomorrow.\n\nThe visuals are gorgeous and it's so useful having an instructor in front of me that I can see. However, I often miss foot placement changes as there are no indicators onscreen. I feel the app could be enhanced if there were audio or visual cues for this.\n\nIf I can get the app to believe I'm only 5'5 and the foot changes get cues, this app will be unstoppable for me. Great to dip into daily.\n\nHelpful | 1", "peterpieMay 24 at 1:55 PM\nEven better if with hand tracking\n\nI really like this actually. Beautiful and serene environments with a choice between relaxation mode or competitive mode focusing on accuracy of tracking the spheres. One thing left to be desired is the lack of hand tracking (not the game developers fault tbf). It is SO close to feeling like learning tai chi which is the main draw of this concept and yet you have to guide controllers instead. Makes it feel a bit like the board game Operation at times, which distracts from the tai chi itself. Great value for money and I would still recommend it.\n\nHelpful | 15\nDeveloper ResponseJun 2 at 11:50 AM\n\nThanks so much! Hand tracking is on the way. But first, we have a massive update hitting early this month with 10+ new environments, new modes, options, features, and much more. Wishing you happy continued adventures in Guided Tai Chi!", "GavBM20 days ago\nStill unusable\n\nI hate giving bad reviews but I have to here. I have had the application for a while waiting for a fix to the arm length issue. I read all their comments to this issue and nothing suggested makes a different. I really looked forward to using this when I got it but now just feel let down.\n\nHelpful | 2", "GoodMewJul 21 at 8:53 PM\nAmazing value, beautiful experiences!\n\nGuided Tai Chi is an incredible value for the Oculus Quest, I can only imagine how many hours of hard work has gone into the development of this app. Guided Tai Chi is not really a game, although there are some game-like elements. But as the title implies, it is an app that guides you through sessions and movements of Tai Chi. This app is a form of meditation and light physical activity, with dozens of beautifully crafted VR environments, foot placement maps, holographic animated teachers, soothing voice recordings, music, and a hand motion guide, that gets your whole body and mind immersed in Tai Chi. I highly recommend you try it for a few days, give it a chance, because during my first 2 sessions I did not enjoy it. Now I play it several times each day.\n\nNote to the developers: Please include the music tracks inside of the explore mode, me and my friends love to relax in your environments in explore mode, but it would be so much better with that soothing music too! Also, thank you so much for bringing this content to the world, it is a gift.\n\nHelpful | 3", "ansonort14 days ago\nLots of arms, but wheres the legs?\n\nHaving mastered the short-form many years ago, but my muscle-memory having forgotten the sequence I was looking forward to reuniting myself with the form using high tech. I have to say Im not finding this very relaxing right now. I follow the orbs for my hand/arm positions only to find that my teacher has moved his feet/leg positions while Ive been concentrating on the upper-half! The scenery is lovely, the music suitably serene. Maybe I just need to give it a little more time?\n\nTo be honest Id rather dispense with the controllers altogether and just follow the teachers in front and to the side of me which would actually be a more realistic Tai Chi experience. Is that possible?\n\nIm not using this anymore. Following the orbs around is actually stressful to me, more like a game that I must win instead of one of the finest methods for calming ever devised. The promised no-orb option hasnt arrived. There is no serenity in this for me. Im so disappointed since this was the first app I bought when I got my Quest and most of the reason that I bought it I the first place.\n\nHelpful | 2", "pungentplane920 days ago\nHas potential but disappointed\n\nMaybe I overlooked something, but I only experience one tutorial on hand movements. During the other sessions I was lost on feet position/movement. I was expecting sessions to build from the tutorial but I was lost in what I didnt know/understand. The potential is there but at the moment I would not purchase unless youre willing to be a beta tester.\n\nHelpful | 1", "LetoDKJul 12 at 3:34 AM\nBug report and feedback\n\nFirst of all: thank you for fixing the \"missing music\" bug.\n\nFeedback: 1) I feel like I often have to look up to the see instructor, especially when it comes to noticing a foot position change. Maybe you could add A) a set of mini instructors right in front of the player, so you don't have to look up as often. Or B) specific, subtle sound queues for when the instructor shifts foot position. Or C) make the UI with the feet follow the head, kind of like the UI in Pistol Whip. Or D) give the player a pair of lower legs and feet, similar to what the instructor has.\n\nAlso, I feel like a have to calibrate my arm length with slightly bent arms in order to avoid having to stand on my toes and reach outside of guardian. I feel like I'm always reaching almost outside guardian, even after recentering in \"the back corner\" and even after enabling small guardian mode. It just feels like the arms are too long.\n\nBug report: when you disable vibration, the white inner ball doesn't become transparent when the controller is in the center. The black ball works just like it does with vibration enabled.\n\nWhish: I wish the was a casual mode where you didn't have to use controllers or follow orbs, but where you could simply look at the teacher and follow in your own pace and style, like watching a yoga video on YouTube etc.\nAnd on the other hand I would also love a mode where hand position was tracked\n\nHelpful | 0\nDeveloper ResponseJul 13 at 9:25 AM\n\nThank you for your kind words and helpful feedback! We agree that foot position changes are tough, but we like your idea around option B. Having a sound or spoken audio cue would help a great deal, even if optional. Thank you for sharing this idea. Last week we launched an option that reduces pathing by around 30% distance. This is especially helpful if your guardian space is smaller on the left or right. Would you be able to test to see how this works on your end? Great find on the bug with disabling vibration! We'll push an update this week to fix this. Thank you for your thoughts on adding in the music for this mode. We also added in an option to play music independent of the spheres for those that might prefer it. And great idea for a mode with only you and a teacher, without orbs. We'll explore this! Finally hand tracking support is on the way. We're testing this internally now with an aim to launch this month. Thanks again for all of your great ideas to help be the best app it can be for your needs!", "BakerSophiaJun 26 at 7:01 AM\nGreat daily discipline.\n\nI studied tai chi with a master for two years and have been practicing the form for about a decade. This app will not recreate that experience as Tai Chi is as much about understanding the philosophy of the Tai Chi classics as it is about the movements. That being said, I absolutely love this app. It makes it incredibly simple to make Tai Chi a daily discipline as the sessions are between 3 to 5 minutes unlike the 40 minute form I learned from my instructor.\n\nThe health benefits of Tai Chi are scientifically documented, and I can guarantee for anyone who makes this app a part of their daily routine it will be the best money you ever spent. Used in the morning it will give you both more energy throughout the day and it will greatly improve your ability to concentrate.\n\nHelpful | 7", "nairocJul 23 at 3:27 PM\nMade for Orangutan's or a Troll's reach.\n\nEven when doing a T-rex impression when configuring my arm length this program thought I had 8 feet long arms. even when stepping like the mat said I should I was constantly leaning over trying to keep my hands on the \"rails\"... I have done Tai-Chi Chen family style (combat) - and this form as presented to me is WEAK, IMBALANCED, and reminds me of \"hamster style\" from Orgazmo - all the motion is in front of you, I did not turn in any of my sessions. where is the large circle hand movements to gather energy? where is the instructions for hip movements allowing you to sway with steady footing? even with the small mat setting the program makes assumptions about my body's movement capabilities I can't fathom. now if they were to show THE WHOLE MAT with the foot markers (like dance lessons) with more then 5 seconds ahead of the \"hand rails\" I might have been able to figure out the movements they are claiming are tai chi... 2 stars for the visual artist doing thier job, but I dont see this teaching what you see practiced in the park,,,, to bad that is not a option for me.\n\nHelpful | 3", "ShakeSanJul 29 at 5:21 AM\nWas great but not working anymore\n\nBeen using this daily for past couple months. Got through all the flow exercises and for the past two weeks I have been doing 30minute World tours daily. Everything was great but since a few days ago its not working properly anymore. The instructors feet are sliding way back out of the circle and pretty much every movement and the hand positioning is off as well. Not sure what's caused this but hope it is resolved soon as when it is working correctly this app is great and I really enjoy the 30minute world tours that I've built up to doing daily.\n\nHelpful | 0", "LostinIdaho9 days ago\nI want to like and use this, but . . .\n\nI continue to struggle. I've tried to complete the tutorial many times to make sure my problems weren't user error. Yet, the tutorial always fails saying I've veered off the target path, when I haven't. In regular sessions, options settings dont take or stick. I would like to have the instructor facing me and mirror the movements, yet selecting a forward-facing instructor works only half the time and, even when it does, the hand guides are not mirrored. In addition, I've recalibrated numerous times (even cheating on my arm span to make it shorter) yet the guides continue to span beyond my reach. I continue to hope that things will improve with future releases, but so far this has been a regrettable purchase.\n\nHelpful | 1", "Vr_prophetJun 22 at 3:25 AM\nWorks GREAT against chronic pain\n\nI am 38, experiencing chronic lower back pain (l5s1) since 6 years and this application represents in my opinion the best possible set of exercises. 15 minutes a day of this greatly improve my lower back pain and stability, both immediately and mid term, for a few days ahead. To the essence this is a music game based on coordination, not focused so much on skill and scoreboards but rather on the proper execution of the moves for self healing purpose. I am normally using it combined with other rythm and fitness games but this is the only app i am using nearly everyday. It works at least as well as full session of stand up stretches to me, even better due to the atmosphere and the gentle nature of the exercises, and with more efficacy than the following solutions: heat therapy, otc painkillers, electro stimulation, manual and mechanical massages, stretches from the ground. I consider this application alone enough to justify for buying an Oculus Quest for those suffering my same condition and probably others. I guess upper back, shoulders, knees and hips also greatly benefit from these movements.\n\nI hope this review will help someone looking for this kind of experience and/or pain relief.\n\nHelpful | 7\nDeveloper ResponseJun 29 at 1:04 PM\n\nThis really made our day. Thanks so much for your kind words and for sharing your feedback!", "bassowJul 5 at 5:25 AM\nVery forced experience\n\nIf you are old, like me, you have probably played one of those old-time games where you have to loop a ring on a stick through a wire track. If you touched the wire with the ring, a buzzer would go off and you would have to start over.\n\nThat's how this experience feels. There is nothing relaxing about it. Keep an eye on where the game wants you to put your hands, moving them sloooowly, and figure out how to keep track on what your posture is supposed to be by looking somewhere else as well. It's too much, too slow and not remotely like actual Tai Chi (for me, anyway).\n\nHelpful | 3\nDeveloper ResponseJul 13 at 9:34 AM\n\nThank you for your useful feedback! You might enjoy Flow Mode, where there are no points and posture is learned by watching your teachers. We'll also be launching a new mode called Pure, which is only you and the teacher without any orbs or paths for those looking for a more traditional experience. We hope you have a chance to try this and it is more your cup of tea!", "FantasmisterJul 23 at 6:30 AM\nKeep it simple devs...\n\nThis app would be improved without the ironic stress of following the spheres - just following the instructor without scores, allowing us to relax in the beautiful environment, experiencing true tai chi (I know we can remove the scores).\n\nTai Chi isn't a competition - the voice tells me to relax?! While I'm totally tense from the \"buzzing wire\" style gameplay.\n\nOn a positive note, the totally freeform \"explore\" option is simple and outstanding. I sat on a beach for 20 minutes. This is why I'm keeping the game. Just merge the two, or simply add a \"no spheres\" freeplay option (then I would give 5 stars).\n\nFrom a designer perspective, this seems like an instance of developers figuring out HOW best to use the controllers, rather than figuring out if they need them at all.\n\nHelpful | 1", "DrgnLadyMay 31 at 10:40 AM\nInstructional mode\n\nI am new to this form, and to vr for that matter, but I was rather disappointed that there weren't more instructions for each form-not to mention form names. It feels similar to taking a yoga class where the instructor doesn't call out the next posture and the only way to follow along would be to constantly focus on what they are doing. I think an \"instructional mode\" would be a perfect update or add on. One where the leader explains the focus of the form, the name, common mistakes in the form and especially verbal instructions for your feet! There were many times I was so focused on staying within the circles I didn't realize till much later where my feet were supposed to be! Overall, it's a beautiful program and experience, and fulfills a need I can find no where else. Adding any of the suggestions mentioned would only make this great program perfect!\n\nHelpful | 4\nDeveloper ResponseJun 2 at 11:37 AM\n\nThanks so much for your kind feedback! When we began we started by creating an instructional mode that focused on the moves, their origins, and repeating them. Strangely, people hated it! Most wanted to jump into Tai Chi and learn on the fly, so we've concentrated on teaching within a session. FLOW is focused on relaxing practice and dynamic feedback, while ARCADE allows you to test your competitive side when you feel comfortable with precision. We have a BIG update going live this month which will double the size of Guided Tai, with new sessions, modes, and environments. We are hopeful to explore this training mode again after we launch hand tracking with testers to see if they still react the same way. Thank you again for your ideas and wishing you happy continued adventures in Guided Tai Chi!", "RauelRualbeJun 28 at 4:40 AM\nArbitrary fixed point\n\nQuite like this and you get a good feel for the movement quite quickly. I have been doing a half hour pretty much every morning in some beautiful locations. The new update has a several great new locations. However the restart function at the end of the session now crashes the app. The mapping feels more solid also but it remains compromised. It appears this is to reduce the space required but that does impact on the flow of the movement and balance somewhat.\n\nHelpful | 0\nDeveloper ResponseJun 29 at 1:18 PM\n\nThanks so much for your kind words and helpful feedback! Great find on the restart functionality! We were able to recreate this bug on restart and pushed a new build live today to address this. Super appreciated. Great to hear that you notice the approach to guardian has been improved. It is now challenging to go outside of your playspace, unless you have a very small area. To revert to your preferred flow you can recalibrate in the 'Options' and it will remap the pathing scale to your height and wingspan. Wishing you many continued adventures ahead in Guided Tai Chi!", "kimbiecookieJul 26 at 11:48 AM\nGreat focus and meditation\n\nAt 1st I didnt like this game because I found it was a bit frustrating to keep the little balls in the spheres and the foot movement confused me but I did love the scenes and the woman's soothing voice. I decided to try again and practice and I'm so glad I did! I learned I have to be patient with myself and just concentrate , focus and go with the flow. I now find when I am in my beautiful scenario and focusing on the path of the orbs , the gentle flow of movement, and just breathe there is nothing but me and the peaceful serenity of the exercise. Although I use it mainly to calm myself down, the option is also there for those who like to challenge themselves in arcade mode! There is something for everyone in VR!\n\nHelpful | 0", "bryanloApr 24 at 4:42 AM\nGreat relaxing workout .. my suggestion\n\nFirst, thank you for this beautiful Tai Chi workout. My few suggestions are\n(1) to see the two hand images as my VR controllers better than the black and white ball image. Please use the hand images as controllers option.\n\n(2) show and display the outline of the play area on the ground floor as option.\n\n(3) can I able to do free style Tai Chi without follow the guided Tai Chi as option.\n\n(4) can I have a VR Tai Chi sword in my VR hand to do my free style VR Tai Chi. This will be fun Tai Chi exercise.\n\nThank you again for this great workout.\n\nHelpful | 17\nDeveloper ResponseJun 2 at 9:27 AM\n\nThank you for your kind words and feedback! (1) Good idea. We'll explore this and add in as an option. (2) Great suggestion. We'll explore this as well. (3) On the main menu, look behind you for a secret menu called 'explore'. This is a general free style mode where you can simply select your environment with no time limits. (4) I love this. We've added to our feedback board to review internally. Thanks so much for your awesome ideas! Later this month we'll be launching our biggest update, which will double the content in the app. New modes, options, features, and 10 environments, while working on hand tracking for a future update. We hope you enjoy it! Thank you again for your focused and actionable feedback. Wishing you happy continued adventures in Guided Tai Chi!", "SoshiyanetJun 18 at 3:42 PM\nI want to see my real hands\n\nWhy not to have an option which turns the background skybox to the headsets cameras? I would love to see my hands and body movements. Please add this feature. I love the App. Highly recommended\n\nHelpful | 3\nDeveloper ResponseJun 19 at 8:29 AM\n\nThanks for your feedback! Using the Quest's cameras isn't currently allowed within an app, just for the home environment. We will be adding hand tracking support within the next week or so. We're testing this now, alongside 11 new environments, new modes, and dozens of improvements. Thank you again for your feedback and wishing you happy adventures ahead in Guided Tai Chi!", "SHRUTHIJAIJul 3 at 12:09 AM\nHand Vidualization\n\nWhile doing the tai chi i found it difficult to track the hand movement. Instead of black and white ball movement guide it would be great if you incorporate a hand movement guide so that we can position our hand the same way how the guide performs.\n\nHelpful | 1\nDeveloper ResponseJul 2 at 9:03 AM\n\nThank you for your feedback! One of our goals has been to simplify Tai Chi so it can be pick-up and play for anyone. This comes at a few concessions, like de-emphasizing hand movement and making foot position optional. There is a fine line between being respectful to movement arts while considering what a novice might embrace within VR, and we're always exploring that balance. The next update will support hand tracking, but if there is greater interest we could absolutely explore an expert style mode which allows for full hand positioning guidance. Thanks again for your feedback and wishing you exciting adventures ahead with Guided Tai Chi!", "deljeeMar 19 at 4:07 PM\nRelaxing but is it really Tai Chi\n\nThe game is really good for a relaxing warm up or cool down before or after more intensive cardio games like boxing. I've only played short sessions. The arcade mode is quite fun and it's interesting to see where I lie on the leaderboards.\nThe Tai Chi experience itself is a bit fuzzy. A lot of effort goes into trying to concentrate on the 2 balls at once, so there's a lot of moving your head back and forth. This also makes it difficult to follow the instructions for the feet. So, I don't know how this actually would compare to a real Tai Chi experience and doubt that it would be the same. It's not really a criticism of the game since I wouldn't know how it could be improved. It might just be the limitation of playing this in VR. I also feel that I get better the more I play, so maybe it's just a matter of time before it feels smoother.\nIn short, it's fun and relaxing for short sessions but I can't really judge if there will e any health benefits.\n\nHelpful | 89\nDeveloper ResponseJun 2 at 12:38 PM\n\nThanks so much for your feedback! We have a big update going live early this month which will add more modes, environments (21 total!), options, and much more. Hand tracking is also on the way, which will help feel more natural. And you bring up a good point: what is traditional Tai Chi? Most people are unaware that Tai Chi short form was made in 1956. This isn't a slight, but more of a realization that this was made by actual humans (gasp!). Our goal was to respect this art, while optimizing it to work best for modern devices, just as those who came before us. We believe more people enjoying movement arts is a good thing. Wishing you happy continued adventures ahead in Guided Tai Chi!", "B.Lachele.FoleyMay 25 at 5:14 AM\nNeeds fine tuning for body geometry\n\nI like it a lot. I've been using it happily. In addition to things said in other reviews, these are the things that I think need some attention:\n\n(1) The balls often go outside the guardian. My play area is plenty large. The app seems to want me to be too far forward within the area.\n\n(2) The app thinks I'm taller than I am. I will be reaching far above my head but the instructor's hands are at his head's height. Later, my hands will be hovering at my waist, but the instructor's are down at his hips. The balls never have my hands go lower than my waist. I've tried calibrating for arm length. That changes the geometry, but doesn't fix it. I think I'll try to calibrate arm length with my knees bent next time, to see what happens.\n\n(3) Times between 5 mins and 60 mins would be good. Maybe 20 mins.\n\nHelpful | 3\nDeveloper ResponseJun 2 at 11:45 AM\n\nThank you for your actionable feedback!  1) The path size is dynamically determined by the height of the user, scaling the arm length accordingly. This height is captured on the start of a session, so if you see any issues this may be when transitioning from seated to standing positions. If possible, we would recommend manually calibrating your arm length in the options screen. This will then be saved to your exact arm measurements, versus an estimation. 2) Hmm, this sounds to be aligned to the first issue. If you're setting the arm length then it sounds like it may not know where your floor is. Would you happen to be on a reflective floor (wood or tile)? Another approach would be to try \"Standing Only\" mode to see what happens. If you are still too tall, then it sounds like the floor could be the culprit. We'd love to help troubleshoot further at gtc@cubicleninjas.com to fix this for you. 3) World Tour mode will be launching early this month with 15 and 30 minute session times. Thanks again for your helpful feedback and wishing you fun adventures ahead in Guided Tai Chi!", "kn03173 days ago\nGreat way to start and finish your day!\n\nReally really enjoy! Easy to follow. I start my day with this! Helps me to invite calmness and breath into my day.\n\nHelpful | 1", "sebastian.kurz.583Jul 17 at 11:18 AM\nBeautiful places\n\nUpdate: the latest summer update is great again! New scenes (love the fantasy jungle one with the fern).\nGreat app with much heartblood in, love this!\n\nBut in general: It might be easier and more relaxing to follow some ghost hands which are already performing the correct hand gesture. I use mamut grips, therefore I can release the controller and perform the hand postures. Not sure if the feet on the ground do help more than just watching the teacher.\n\nSo beautiful places, I wish I had more space to move around :-) like seeing the feet, and also listening to the music. In explore mode I would not need both black and white snakes (hands) for the pure beauty of the landscapes.\nAnd I would like to see additional ghost hands for proper hand pose.\nNevertheless wonderful experience.\n\nHelpful | 0", "stonecraftartsApr 8 at 10:06 PM\nAlmost perfect\n\nI really love this app. I have started using it 2 -3 times a week. The environments are beautiful, the music is great, it is surprisingly immersive. There are a few things that I think would make it tip top 5 star though. Firstly, I really wish you could add your own music. The music in game is fine, but I have a lot of ambient and new age music already on my quest for other apps it would be nice if the Tai Chi app could recognize them; also i wish there were volume controls for the voice instructions; the woman's voice is lovely, but sometimes distracting. Secondly, I wish there were a few more environments to practice in; the guided meditation app has over 100 of them. It would be great to practice in some of those environments. And finally, if ever there was an app that should take advantage of the oculus hand tracking system - this is it! Practicing Tai Chi with the bulky controllers in your hands is a bit off putting, it would be wonderful if you could just, you know, do Tai Chi\n\nHelpful | 23\nDeveloper ResponseJun 2 at 12:53 PM\n\nThanks so much for your helpful feedback! Volume controls will be in an upcoming update. You will also be able to turn off her audio as well, if preferred. This month we're adding in 10 new environments. These range from Santorini Greece inspired, to the edges of space. We hope you enjoy! Hand tracking is on the way too! It should be here within the month. Thanks again and wishing you happy continued adventures in Guided Tai Chi!", "ET3DJul 25 at 12:20 PM\nI have no idea how to move\n\nFrom the video it seems like there's supposed to be a guide showing how I should pose. But he's not there, and although I have spheres for my hands to follow and footsteps on the ground, there's of course no way to see them both at the same time. So although my hands can follow the spheres, it feels completely pointless as an exercise which I assume should teach me how I should move.\n\nHelpful | 1", "jimbert.3745Jul 12 at 7:44 AM\nAmazing and incredibly underrated\n\nThis app is incredibly underrated. It comes with 100 different sessions that are five minutes a peace and like 20 different locations. The app guides you through each session. It's regularly updated too. 3 different modes including a world tour mode with 15, 30 and 60 minutes of five minute sessions. There's a little kind of Easter egg that let's you go into explore mode so if you wanna just chill in one of the locations and meditate you can. 5 ++\n\nHelpful | 1\nDeveloper ResponseJul 13 at 9:18 AM\n\nThank you so much for the kind words!", "gavin_vrJun 20 at 12:10 PM\nSomething different\n\nGood app and I appreciate something different.\n\nThey seem to have updated this since I last tried with markers for your feet ( on the floor and above the front instructor ) if you turn them on in options, and more pronounced trails of where you are going to be moving your hands. That's made it a lot easier to follow for me and it's appreciated.\n\nIt took me a little getting used to before I felt the whole movements as fluid but I'm getting there.\n\nHelpful | 2", "john.napiorkowskiJul 5 at 1:29 PM\nI look forward to my time with this\n\nI think this game has really helped my meditation. I hope they add hand tracking support because I find holding the controllers throws me off a bit. You sorta have to grip the controllers but when playing I really want to relax my hands. Would make it even better! This one is worth the money, its one of the few I use the most.\n\nHelpful | 0\nDeveloper ResponseJul 13 at 9:35 AM\n\nThank you so much for your kind words!  We are bursting with excitement to share hand tracking support. It very much changes the experience for the better. We hope you enjoy it!", "rusty2064Jun 29 at 12:50 AM\nNOT Tai Chi\n\nIve had real Tai Chi training, but it was over 10 yrs ago and its not all just hand and arms. Its the steps, movement, placement of the feet along with how you hold your hands. You turn, move forward, pull back, have positions for hips, sliding your feet, raising them etc and you always end your session, lowering your hands, palms down with an exhale to help bring you back to centering yourself.\n\nI was surprised on how none of the instructions helped me remember anything of what I had been taught when I was younger. It just caused more stress on trying to keep my hands in the circles. Maybe having an actual person in front of you? Such as an instructor? Then when you understand the moves, use the VR areas to exercise in?\n\nHelpful | 2\nDeveloper ResponseJun 29 at 1:30 PM\n\nThank you for your feedback! When we started this project we learned something unsettling: it takes the average Tai Chi student a half dozen years to become well versed. For the average teacher, it can take decades, with daily practice. How could we allow someone to jump into Tai Chi right now? Our mission was to demystify what we could. Elements like placing palms down or raising feet are incorporated into the sessions, without someone needing to know this. The instructors can be seen in Flow mode, which are virtual mirrored teachers at your left, forward, and right. We've also had to optimize the traditional 24 form to work best for VR, where we have much less space and time. We hope you give Guided Tai Chi another try with this in mind!", "DaveSesameJul 2 at 8:31 AM\nLove it; my favourite app on the quest\n\nI really love the movements and the beautiful environments. I use the 5 minute sessions. The recent update added even more wonderful places to move within or just hang out. I can feel my physical and mental stress drained away even after only 5 minutes. Developers are very responsive too. Thank you!!! Well done!\n\nHelpful | 1\nDeveloper ResponseJul 2 at 8:57 AM\n\nThank you so much - this made our day!  We can't wait to share the hand tracking update soon!", "teetee-77Jun 3 at 5:59 AM\nNot a bad meditation game but need to...\n\nNot a bad game for meditation and relaxation after a workout. The only few things that I see so far that I would like to be added or changed is being able to adjust the movements to work with the individual's height or size. The movements seem to be set for one particular individual. Also the person that we watch for the movements, it would be nice to see him , if you are looking forward, from the side also. It's hard to follow the lines and have to look to the right or left to see the side view image. If I see any other things I would suggest then I will make another post but for right now that is it.\n\nHelpful | 1\nDeveloper ResponseJun 3 at 9:59 AM\n\nThank you for your kind kind thoughts! You are able to set your arm length manually in the option menu. By default the app does this dynamically at the start of each scene by estimating your arm length based on height, but manually setting this will overwrite these values. In the coming weeks we'll be launching advanced teacher options to adjust position and styling. It is clear that preferences here vary and we hope to allow much more customization to improve this further. We have a large content update coming next week which we hope you have a chance to enjoy. It will feature 10+ new environments, new modes, and new features. Wishing you many continued adventures in Guided Tai Chi!", "MiasorninJun 20 at 12:42 PM\nMeh..\n\nI am not sure what I was expecting, but I feel like this should be more smooth to use. Trying to follow both orbs around but they are not on the same smooth path is a strain on the eyes and body. I did not feel peaceful or relaxed attempting to keep both my paths on track. I had hopes for this app and am sad to have to return it.\n\nHelpful | 2", "RainbowCatLadiesMar 28 at 5:17 PM\nGood and room to improve\n\nI really like the game and experience. The backgrounds are stunning and the length of sessions are great.\n\nI'm glad I bought it and love to use it as a wind down session after playing very active / cardio games.\n\nI'd really like to see a few improvements -\n1) the instructor to be facing you in a mirror image so you can see what he is doing\n2) a \"free\" option, so you can just follow the movements without worrying so much about following the balls\n3) more flexible gameplay options, to reduce the frequency or remove the woman's voice, and to stop the music fading when you go out of the circles as this can be distracting\n\nController free tracking would be amazing but I appreciate this is still fairly new tech right now.\n\nHelpful | 20", "yolande254Jun 2 at 6:09 PM\nCould be so so great\n\nWhat a frustrating game! Great concept, amazing graphics... Except for those weird guys that surround you. And that's where the bad stuff begins... It's very hard to keep your controllers inside the targets when you are 5'7\". 90% of the time it's fine but then they float very high above my head and I just can't reach. It looks like the game loses track of where you are: I had to stop the game, take 3 steps back and start the game again because I was hitting the wall in front of me, way past the roomscale limits (which is large enough for supernatural). Then there's the issue of not knowing what you are doing and not getting much help: I'm not a specialist in Chinese martial arts but in Japanese martial arts, feet are pretty much the majority of the work. Now there aren't any sensors for your feet and you can't really see your own body so it's hard to know if you're doing things right. Then you see one of the ghost dudes and you're like wait, my left foot is supposed to be forward? Then you look down and sure enough, those little feet are opposite of what you are doing. Meanwhile, the voice is telling you bland things like \"feel the energy\" and \"be grounded\" and you're like woman, there's no energy to feel right now. Only the wall and my misplaced feet. If only someone could guide me through the movements instead of me having to keep one eye on the right hand, one eye on the left hand, one eye on the feet above, one eye on the feet under, one eye on the creepy ghost dude on my right, one eye on the creepy ghost dude on my left, one eye on the creepy those dude in the front, and a eigth eye on the scenery BECAUSE I MUST BE RELAXED RIGHT NOW SHEESH BRENDA.\n\nStill. I'm not going to ask for a refund because I really think that some major modifications will make that game extremely worthwhile. Having someone walk you through your foot positioning and seeing some real people moving instead of the creepy dudes would greatly help (for real, are they dead? Why do their bodies look so stiff? Like meat puppets or something)\n\nHelpful | 2\nDeveloper ResponseJun 3 at 10:29 AM\n\nThank you for your feedback! We'd recommend moving towards the back of center of your space and starting a session, as this will allow the practice to happen nicely within the guardian. Or you can return to center of your playspace and recenter. We've chosen to allow this to be user initiated versus defined by the app. We are also exploring ways to flag bad start positions based on guardian size to prevent this, but still allow some level of user control. A future update in the next month will allow you to turn off the teacher voice and have more control over teacher positioning, while activating hand tracking. For many people following the proper hand movements prove to be challenging. Since we cannot track feet, we lower this emphasis to general foot cues like the icon or teacher position. The icons of feet are mirrors of the teacher foot position, simply mapped in 2D. When we've tested audio foot positioning prompts it became more overwhelming for most, so our emphasis has been on showing this information without making it too heavy. But there may be a way for advanced training where we go into this in more detail. Wishing you happy continued adventures in Guided Tai Chi!", "D.Wells29Jul 15 at 2:17 PM\nLoved it at first....\n\nI got excited about the update & hoped for the best. Now it feels unusable. Trying to follow the footing guides is only possible if you are doing tai chi while hovering above the ground.\n\nHelpful | 2", "BathoboJun 27 at 1:33 PM\nLatest update is excellent\n\nThe experience is really good for a cool down or just a relaxing get away. It did feel a little light on content but the new update really fills out the app. You really get your moneys worth now.\n\nHelpful | 2\nDeveloper ResponseJun 29 at 1:03 PM\n\nThanks so much!", "Mr_BananaJul 15 at 12:32 PM\nLove your game, big bug in update\n\nSuch a well executed concept and the devs are super helpful and responsive. If you're on the fence, I definitely encourage anyone to give this experience a go.\n\nHelpful | 1", "gsmith1718May 7 at 5:25 PM\nA Waste of Time\n\nYou cannot start to relax until you learn to move and this app doesn't teach movement. It's called Guided Tai Chi but it isn't, it's a game where you try and watch three guide figures, footprints, and match the movement of two orbs making sweeping moves so far out only someone with arms as long as an orangutan could reach. In short, it sucks!\n\nHelpful | 10\nDeveloper ResponseJun 2 at 9:15 AM\n\nThank you for your constructive feedback! The best way to practice is to do! You learn the movements by following, just as in traditional Tai Chi practice. Guided Tai Chi calibrates the arm length based on your height. If you're unable to reach the balls, then it is likely you may have sat and then stood up before play (or vice versa). To manually set your arm length across the app you can use the options screen calibration, or choose \"seated mode\" which will make these movements smaller. Hoping you have a chance to try Guided Tai Chi with this in mind!", "sillydogeballJun 13 at 9:22 PM\nFantastic\n\nI had actually never done any tai chi before purchasing this. For me, I wanted anything that had the potential to get me in a relaxing and calming state outside the real world and in the land of VR. This was absolutely mind-blowing! I really feel so amazing when all finished up. After seeing some reviews and replies, I cant wait for the update!\n\nMy only suggestion would be that I would love the option to turn the menu off after a session is complete. Like, I want to stay inside the world before going back to the main menu. I want to take in the scenario for my final breath without the menu taking me away.\n\nWhat a beautiful app, thank you for this!\n\nHelpful | 1\nDeveloper ResponseJun 19 at 8:34 AM\n\nThank you for much!", "designbyshashaMay 14 at 11:57 PM\nGreat start, fingers crossed for more\n\nWhen I first played it I was slightly disappointed since its not really tai chi but of course I understand the hardware limitations. After turning off the vibration, turning on virtual foot position and playing non-arcade modes it was much better. The environment and music is gorgeous, love the Explore mode. Suggestions: hand tracking, ability to turn off the orbs completely and only leave in the paths our hands can follow so that we dont feel so much pressure and stress. Arcade modes points are super annoying for a relaxing app like this. Looking forward to more updates because I really believe this is a great app, wel done Devs!\n\nHelpful | 1\nDeveloper ResponseJun 2 at 12:00 PM\n\nThanks so much for your kind feedback! First, hand tracking is coming! We've been playing with internally for some time and it feels lovely. Also, we have a big update launching early this month which will double the content. More modes, more environments, more options, and more refinements. It pushes Tai Chi And honestly, I personally agree on Arcade. In our tests we found there were two types of users \"I want to relax\" and \"I want to measure/compare\". If you don't like the stress, we'd recommend FOCUS and WORLD TOUR as chill ways to spend some time. For those looking to a tangible goal, ARCADE is their jam. Thanks again for the kind words and wishing you happy continued adventures in Guided Tai Chi!", "PerlmannecklaceMay 20 at 11:07 AM\nWould love hand tracking!\n\nThis game is great to relax, but the tracking seems a bit wonky with your body. Feels like it thinks I'm way further forward than I am, leading to over extending. And the remotes feel unnatural and distracting. Now that hand tracking is in a good place, this should definitely include it.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 8:55 AM\n\nHand tracking is on the way! And before that goes live, we'll be launching a massive free update early this month. 10 new environments, tweaks to calibration, new options, new modes, and much more. We hope you have a chance to check it out!", "2KILLMay 7 at 2:21 PM\nLove it!\n\nSeeing what is coming to the oculus store over the years I would've never expected anything like this. And it is a very polished experience. I guess it's not exactly like Tai Chi would be in the real world, but it doesn't have to be. This is VR, and this app makes very good use of it. I'm using it almost daily. It's my perfect cooldown after the typical Synthriders, BoxVR, or Beatsaber session. Just one 5 minute lesson and the slow but distinctive motions make me feel really relaxed.\nIt seems to track my movements very well. I never get to follow the movements a 100% accurate, but I guess that's not possible and shouldn't be the goal to achieve anyway. Although I do think I got better over time in a sense that my motions got more fluent and more relaxed.\nI also love the background scenes. Sometimes I don't like the occasional sunset at the end of a lesson so I wish I could opt out of that. I mean it's VR, right? Oh and I would love to have something like the 5 minute lessons just a little longer, maybe 7 to 10 minutes? But besides that: love it!\n\nHelpful | 4\nDeveloper ResponseJun 2 at 12:42 PM\n\nThanks so much for your kind words! We have a crazy big update going live in the next week or so which will add 10 new environments, new 15 and 30 minute World Tour options, and much more. Hoping you enjoy! Opting out of the sunset is a cool idea and added to our list. Wishing you many continued adventures ahead in Guided Tai Chi!", "crubaccaApr 1 at 9:03 PM\nPlease add a mirror\n\nAdd a avatar to the person playing. Then put a really cool looking mirror in as a option and have the trainer face you so you can do exactly what he does and see your avatar it in the mirror. All without the black and white dots to follow.\n\nHelpful | 9\nDeveloper ResponseJun 2 at 1:11 PM\n\nGreat idea! We'll explore in testing to see user feedback. A future update has many other options around teacher customization to best align this with your specific preferences. Wishing you many continued adventures ahead in Guided Tai Chi!", "mogly.speixJul 21 at 6:03 PM\n\na perfect trip practice and learning\nand now hand tracking soon \n\nHelpful | 0", "HtoTheRescueApr 10 at 8:45 PM\nLooks great, lacking though...\n\nThis game looks good and has a great vibe but is a little too minimalist than necessary. I am new to Tai Chi. I know nothing. Im a fan of yoga and meditation... not afraid of that woo woo stuff and was hoping this would help relax me. I found it actually caused more anxiety. My back would tense up. The tutorial should tell something about Tai Chi. What is it? What are the benefits? Where do I focus my energy? It just says to follow the things with the things. Okay. But I need more backstory. The narrator says random things while youre going that assume you know this stuff, but I dont.\n\nMy biggest gripe is that this would be a PERFECT candidate for the hand tracking the quest can do, but when I tried I got controllers required. Why!? You move so slow that it could easily keep up and I found holding the controllers to be the opposite of freeing. I feel like (from what Ive seen on YouTube) the hand position is pretty important in Tai Chi. Developers... take my note and make that PART of it and I may be down for this. The settings and the music is great, but I find this highly un-replayable. Im gonna get the refund.\n\nHelpful | 7\nDeveloper ResponseJun 2 at 1:05 PM\n\nThanks for your helpful thoughts! Hand tracking will be launching very shortly, but beforehand we have a big update doubling the app's content. More modes, environments, features, and refinements. We've purposefully stayed away from spiritual elements of Tai Chi, as they are quite polarizing. Some want to know about Chi and others feel like their wellness app is trying to convert them. Because of this, we have avoided this, but we are hopeful to explore the history and origins of Tai Chi and other movement arts in time. Thanks again for your honest feedback and we hope we can win you over with improvements down the line!", "KnicksRIPMay 24 at 11:18 AM\nPhenomenal relaxation tool\n\nAs someone who suffers from anxiety (who doesn't these days?), I feel that VR is an invaluable tool for getting out of my own head. In that sense, Tai Chi + VR is a match made in heaven. As someone else noted, it's a shame that there isn't a more technical labeling of the different forms, but as a mind/body tool, it's one of the best purchases I've ever made.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 8:48 AM\n\n\"it's one of the best purchases I've ever made.\" Times are strange right now. As developers we spend a bunch of our time inside, poking at weird words on a screen hoping it makes someone happy. So, just wanted to say thank you for sharing your thoughts. It really means a ton to us! And good news: we have a super massive update going live this month which will double the environments, modes, features, and more, all for 100% free. We hope it makes your day a bit brighter!", "Kaybe825 days ago\nPatience!!\n\nI am one of those people who wants things to work right out of the box (like little kid although I'm 50 ish). The tutorial had me frustrated at first until I realized this is supposed to be relaxing . After a few flow levels I got better and the scoring gave me feedback. I can see how the stretching works muscles (I am a yoga fan ). I agree the foot positioning cueing is a problem , addressing it in he tutorial might help but practice may improve that as well .\n\nHelpful | 0", "chaoswhistlerMay 14 at 2:11 AM\nGood idea but lacking a lot\n\nFirst the good: the environments are very nice. If you do like it, there are lots of different \"levels\" with different Tai Chi movements, it would take a long time to go through all of them. The arcade mode is kinda fun, but not like Tai Chi.\n\nNow on to the bad!\n\nThe game often has you reaching your arms beyond what is possible to maintain good Tai Chi form (or even just your balance!), as if it was designed perhaps with only very tall people with long arms in mind. The game says it supports \"standing\" as well as \"roomscale\", but I don't think it is possible to play without moving around.\n\nThere are feet outlines on the ground right below you and also if you look up, but doing either one of those means that you can't see what your hands are doing, so it's extremely difficult to get the form right with your hands and feet at the same time. It would be very helpful if the voice guide would say \"move your right foot back\" and so on.\n\nThere is a figure in front of you to follow along with, but they are turned away, so it's hard to see what their hands are doing.\n\nThere are no names for the forms. It would be great to have a way to learn each form individually, then the voice guide could say \"next we're moving into the tiger form\", and you could properly learn some Tai Chi and know what to do next. Instead, you only know that you're moving your hands (and feet, if you're lucky), but you don't actually know *what* you're doing.\n\nRight now, I can't recommend this game and will be requesting a refund.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 12:15 PM\n\nThanks for your feedback! You can manually set your arm length in the options. It is dynamically set on the start of scene, so one common scenario is sitting down for menus and standing for the game can make you very tall. To clarify, you mentioned feeling overwhelmed by what to do, but also wanted more information on names. We found in testing that adding these was information overload and it was beneficial to focus on what mattered most: the fun of movement. We'd love to do a mode explaining the moves and their origin, but we've had to make some compromises for VR so we also don't want people to take our version as gospel. It's a fine line that we hope we can expand in the future. Hoping you try Guided Tai Chi again down the line!", "supersubraJun 12 at 9:27 PM\n\nExcellent software for relaxation.\n\nHelpful | 0\nDeveloper ResponseJun 16 at 9:42 AM\n\nThank you!", "AfroturtleJul 17 at 9:28 AM\nDon't like it.\n\nDifficult to follow and not relaxing at all\n\nHelpful | 1", "RidgeMApr 17 at 6:42 PM\n\nThis is why I love VR....get away, somewhere else, focus on slowing everything down. Coming out refreshed. This would be a great tool for rehab applications. The slow pace and tranquility would really help with healing. I find an improvement in my balance, and being 64 years young, that says something. Shooters don't do that for me. Great feel and emersion, resonably priced, I gotta recommend this one.\n\nHelpful | 4\nDeveloper ResponseJun 2 at 12:56 PM\n\nThanks so much! It is reviews like these that keep us excited to build apps like this in VR.  We have a massive update later this month which will add many more environments, modes, and options. we hope this allows for many new adventures ahead in Guided Tai Chi!", "ViporionMay 14 at 4:01 PM\nI... Just don't know\n\nI want to give a good review. The music and backgrounds are amazing. But that is where it stops.\nApart from the tutorial there are 3 game options.\nNormal, follow the orbs and know there are a few masters nearby doing the exercises with you. Though you can't see what they are doing and you keep losing track of the orbs you need to follow.\nArcade. Identical to the first apart from shorter and you get points.\nAround the world, full hour. Haven't tried that yet.\n\nHere is the big problem. I have no bloody clue what movements i need to do. The voice with pointless sayings gets on my nerves and i keep losing track on the balls cause i am not a chameleon.\n\nThis game could be great. Just add another game mode called training, remove the balls and turn the master infront of you around, then mirror him.\nLet us see what he is doing and learn the hand and foot work.\nThen we can always move on to touching the balls while not seeing anything else.\n\nAnd hearing the voice say good work when you have one hand on a ball while waving around to gind the real life location of the other is not helpful. It is grating and teeth grinding.\n\nI have never spend so much time cursing a non existing voice and while it is officially a calming game, i leave the game more stressed and pissed then i go into the game.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 12:10 PM\n\nThank you for your feedback! When we started this project we learned something unsettling: it takes the average Tai Chi student a half dozen years to become well versed. For the average teacher, it can take decades, with daily practice. Our mission was to demystify what we could. How could we allow someone to jump into Tai Chi right now? Your idea to remove the lines in FLOW MODE is interesting! We will be adding in an option soon to adjust the balls to hands and turn off the teacher audio, so adding lines wouldn't be a problem. Thank you! This month we'll be launching a massive update which doubles the features, modes, and environments. We hope you give Guided Tai Chi another try once this goes live!", "ThornBrierMay 24 at 4:07 PM\nLove what the features intend...\n\nBut we had to turn off almost everything because the arms are impossibly long even after calibration. What it says to do in a single step takes us three just to reach where the orbs are. And the audio warnings when you leave the circles are glaringly not zen and relaxing. Just caused frustration.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 11:48 AM\n\nThanks for your feedback! You can manually set your arm length in the options. It is dynamically set on the start of scene, so one common scenario is sitting down for menus and standing for the game can make you very tall. Leaving your guardian with a blindfold on while swinging your arms is dangerous for you and those around you! After a few bloody knuckles, we'd recommend fixing up your guardian and arm length and this will work wonders. Hoping you have a chance to calibrate arm length and fully experience Guided Tai Chi!", "freebird1973Apr 16 at 1:15 PM\nJust awful when in standing mode\n\nI can't use Roomscale mode, but I've got plenty of space to stand. If I can play frantic games like BoxVR or Beat Saber, there's no reason why this shouldn't work - but it's an awful experience. You're immediately dragged through the boundary.\n\nIt's not a relaxing experience when you're crashing through the red net.\n\nAlso: hands mode. Come on, it's a no brainer.\n\nThe annoying thing is this could be one of the best VR experiences ever with just a few tweaks. Do the devs actually play this?\n\nHelpful | 6\nDeveloper ResponseJun 2 at 1:01 PM\n\nThank you for your feedback! All Oculus apps must be verified that they work properly in standing mode, so if you're seeing any strange behavior this isn't as expected. What it sounds like is this is still in roomscale mode. We'd love to help troubleshoot at gtc@cubicleninjas.com. Hand tracking is in progress as well for launch later this month. Thank you!", "phillyg2020May 24 at 10:34 AM\nTime for hand tracking.\n\nDevs, there is no reason that this game does not have hand tracking support. Please incorporate this feature immediately. If you do this will be the most popular game on the Quest. Pretty please with cherries on the top and bottom...please\n\nHelpful | 0\nDeveloper ResponseJun 2 at 8:52 AM\n\nGood news: it's coming! But first, we'll be launching a free update with hundreds of new feature requests, 10 new environments, and new modes. We hope you enjoy it!", "TransJenderGalApr 23 at 3:25 PM\nRelaxing\n\nGraphics arent the best, but its a very well done app. Beautiful and relaxing. Motion control tracking works fine overall; not perfect, but gets the job done more than adequately\nHighly recommend for anyone looking for meditation and light exercise\n\nHelpful | 0\nDeveloper ResponseJun 2 at 12:56 PM\n\nThanks so much!", "thorhammer315Feb 20 at 11:30 AM\n\nGreat way to meditate. Would be better if ghost figure was facing you so you could mirror him. Difficult to see foot movements and floating orbs at same time. Hand tracking would be better too, but not bad with controllers but would be able to relax better not holding them.\n\nHelpful | 12", "celophaineMay 12 at 11:00 PM\nMisses the point of Tai Chi\n\nBeautifully executed but somewhere the developers lost sight of the experience of Tai Chi itself. Too much emphasis on following the trails. Trails obscure view of the instructor so overall form is lost. There is no way to track leg moments but thats okay if you are trusted to try and follow the instructors leg movements. However because the emphasis is on following the trails you are encouraged to just walk normally or do whatever to ensure youre on track. The vibrations when you fall off track is disruptive and takes you out of the calm contemplation thats supposed to happen. There is no real need to keep score on how accurate you were - Tai Chi is a meditation not a contest. Its a shame. I think they over thought this one.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 12:28 PM\n\nThank you for your honest feedback! Fans of traditional methods often find fresh approaches challenging because they don't align with their existing models. We respect that our stylized version might not be everyone's preferred approach and always encourage practicing however works best for you! Just as 24-short form was created in 1956, we see movement arts today as an ever evolving space. Ultimately, we want to have people enjoy Tai Chi in a fresh new form, without needing years of practice. If we stick to needing to stare at a teacher we don't feel we're maximizing the potential of VR. As for competing with Tai Chi, there have been competitions since creation. These are controversial within traditional internal arts communities, but adding a score to moves is the same. Some people learn best through competitive play and we encourage people to enjoy themselves. Seeing people play, relax, compete, and grow in Tai Chi is joyful, even if it doesn't compare to the past. We hope you have a chance to try our big upcoming update with this lens!", "cynonymDec 28 at 5:19 PM\n\nI love this; it's soothing but physically challenging, the graphics and audio are nice, and there seem to be a lot of flow options. I really really hope future updates will bring two things: controller-free, hands-only capability so you dont need to hold the controllers as you move, and some kind of audio instructions -- if all I'm doing is focusing on following the moving globes & feet, I'm never able to actually learn what I'm doing: I'd love the option to have a teacher's voice telling you what the movement is actually called and guiding you\n\nHelpful | 113\nDeveloper ResponseJun 8 at 8:31 AM\n\nThanks so much! Hand tracking mode will be going live in the next few weeks. We're also exploring different advanced training methods, using audio or video now for a future update. Thank you and wishing you many adventures ahead in Guided Tai Chi!", "romanefaureJun 13 at 2:34 AM\n\nI really like it but would it be possible to use hand tracking, it would be so awesome!\n\nHelpful | 0\nDeveloper ResponseJun 16 at 9:42 AM\n\nThanks so much! Hand tracking will be going live this month, along a bunch of new environments and features.", "wgdMay 31 at 11:30 AM\nNot what I expected\n\nI found the use of ghost figures distracting and not helpful. Using an instructor to lead your movements would be more useful and enjoyable. Environments and graphics also need work.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 11:32 AM\n\nThank you for your feedback! The teacher ghosts act as a traditional teacher would in a Tai Chi class, showing you the motions from multiple directions while practicing them. A future update will allow you to customize the teacher position and styling to best match your style, but we've found learning by doing is by far the most recommended (and enjoyable!) approach. We hope you have a chance to explore this update and share your thoughts!", "cutekittencat1Jun 15 at 9:57 PM\nVery fun!\n\nEasy to do with disability. Also very fun! Ed It! \n\nHelpful | 1\nDeveloper ResponseJun 19 at 8:35 AM\n\nYour kind words made our day. Thanks so much!", "BrendanRoyMay 9 at 6:53 PM\nIt is what it isss\n\nWant tai chi without fighting and just the exercise? This game is what you're lookin for!\n\nHelpful | 1\nDeveloper ResponseJun 2 at 9:07 AM\n\nThank you for your kind words! Big update going live this month with new environments, sessions, modes, and more. We hope you have happy continued adventures in Guided Tai Chi!", "Gary9364Mar 13 at 3:04 PM\nMy Daily Grounding\n\nI use this app each morning to center myself before a busy day in the rat race. The different modes are great and the gentle \"encouragement\" is relaxing. The environments are SO beautiful that sometimes I just want to sit in one of them and chill out, so the \"Explore\" function is great for meditation. This app is well worth the money!\n\nHelpful | 2", "SopdetMar 11 at 4:15 PM\nGuardian issue\n\nThere are two dark clouds on the horizon in a pretty world. The smaller cloud is that although you can change the volume for the environment and music, there is no slider for the voice. Sometimes, the voice says nice things. Sometimes, the voice is annoying. Choice is good!\nThe much bigger cloud that puts this deep in 1-star territory is that this app does not respect the guardian. I'm playing roomscale, in plenty of space (8ft x 7ft), and starting centred. It will put my hands outside the guardian for long periods of movement. If this was Beat Saber I would have put my hand through a wall. Unacceptable. Others have noted this but it is still happening (3 Mar 2020) and the devs reply to reviews is to play it standing instead because there is nothing they can do. The second routine I was doing was asymmetrical and could easily have been better centred around the starting point. Or scale the routines for the guardian, maybe? Or preview the whole routine path within the guardian so that the user can choose a starting point. (This would also help visualise the routine which would be a benefit.) Lots of options that could be tried rather than the problem being shrugged at.\nThis, and when I went to report to the devs less publicly, the devs' website doesn't exist.\n\nHelpful | 11\nDeveloper ResponseJun 3 at 9:52 AM\n\nThank you for your feedback! Audio options for voice will launch this month. In Guided Tai Chi, the start of the playspace is defined by the user. If you move to the edge of your guardian and start a new session you will then likely move your hands outside the boundaries. To correct this, you can return to the middle of your playspace and recenter. As with many roomscale apps, we prefer user choice versus forcing positioning within your guardian. Routines scaled against a guardian would unfairly hurt those with average playspace sizes. It is best to recenter, giving this control to users. We have been looking into flagging start positions that might place them out of bounds, but when we created this app that data was not available to developers as it is today. We do have a website and always welcome feedback at gtc@cubicleninjas.com. Our team is happy to troubleshoot together! Wishing you fun adventures ahead in Guided Tai Chi!", "Alex_GERMar 29 at 11:00 PM\nNice! But needs Hand-Tracking!\n\nA really very nice app! But it would be great with Hand Tracking. Please update the Hand Tracking support! THX\n\nHelpful | 4\nDeveloper ResponseJun 2 at 1:16 PM\n\nThanks so much! Hand tracking in progress and should be live in the next few weeks. Hoping you enjoy this and the other updates we have planned!", "alon.sabiMay 27 at 11:41 PM\nI love it\n\nVery relaxing. A variety of locations.\n\nI hope they add hand tracking support, that will make it perfect.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 8:43 AM\n\nThanks so much for your kind thoughts! Hand tracking is coming! But first, we're going to be adding 10 new environments, new modes and new sessions, and dozens of new feature requests/refinements early this month. Wishing you happy adventures in Tai Chi!", "puddlediver1May 26 at 9:36 PM\nReally really good\n\nIve been doing tai chi for about 8 years now and I really love this. Lovely scenery and music. Thanks devs\n\nHelpful | 1\nDeveloper ResponseJun 2 at 8:44 AM\n\nThank you for being you! We have a big update hitting this month which will add 10 new environments, which we hope you love just as much. Wishing you happy continued adventures in Tai Chi!", "Marco_GilardiApr 29 at 4:34 AM\nGood title but incredibly annoying voice\n\nThis is a great title, and I would have given 5 stars if it wasn't for the incrrdibly annoying guiding voice that makes it impossible to concentrate on the movements, breathing and exercises. The voice does not give any real guidance and constantly repeats nonsensical phrases that break concentration during the sessions.\nI will give 5 stars once an option to turn the voice off completely leaving only the beginning and end prompts is introduced.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 9:29 AM\n\nThank you for your feedback! We're adding in an option to turn off the voice in the next update, which will also add in 10 new environments, new sessions/modes, and much more. Thank you for your feedback in making Guided Tai Chi the best fit for your needs!", "FPVganJun 12 at 7:41 PM\nSimply awesome\n\nLove this app\n\nHelpful | 0\nDeveloper ResponseJun 16 at 9:42 AM\n\nThank you so much!", "Bainbridge9Apr 15 at 11:56 AM\nNelson in Tai Chi\n\nThis game helps a lot with your focus and energy! I have had the program for about two weeks. The best thing during this time of isolation. I was in a class that I was getting really frustrated . I completed one session and everything seemed more clear. I wonder if this would help kids in school. I am amazed and everyone should try this program.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 10:17 AM\n\nThis made our team's day. Thank you so much for the kind words! We hope you enjoy a free update launching the next week which will double the size of the experience. Wishing you happy continued adventures in Guided Tai Chi!", "Aaronb3434Mar 30 at 2:21 AM\nCool\n\nBeautiful relaxing environments and music. im a big fan of guided meditation so if possible devs please add more environments including night and a no time limit option. i also think more sea life should be added to the underwater environment like sharks and dolphins. so guys if you read this i look forward to really cool updates and features, thanks cubicle ninjas.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 1:15 PM\n\nThanks so much, Aaronb3434! We have a big update hitting early this month which has more environments, including a few night spaces. Secret: there is a no time limit mode behind you on the main menu. This is called \"explore\" and can be used for Tai Chi or just relaxing. On underwater, we had so much more but had to pull them due to performance. There was a massive whale that came up and over, alongside many other neat creatures like packs of dolphins. Sadly it caused heat issues, so we had to trim this back. I still miss them. Many thanks for the helpful feedback and wishing you many fun adventures ahead in Guided Tai Chi!", "AndulackaFeb 6 at 9:52 AM\nSurprisingly demanding\n\nThis was the first game I purchased after receiving my Quest, and it is every bit the exercise app that I hoped it would be. Recovering from some serious health problems I need something gentle but still effective.\nMy first try felt like I might never be able to master it, my balance was off, the dots were constantly out of reach and I was really able to feel the effort. However it does get easier the more you practise.\nEven so, I haven't even attempted the arcade mode yet, as my controllers quite often are nowhere near the dots that they're supposed to follow. To be able to hold my balance, follow the dots, breath deeply and move gracefully is still too much for me, but it's fun to see how it gradually gets easier. Done properly, it really puts your core to work!\nThe locations are beautiful, and there could be even more of them.\nI would also love to see the hand tracking feature here, as it would definitely make the experience more realistic.\nThe arm length calibration seems to be a bit off. I find that if I stretch my arms out completely when calibrating, I'm not able to reach the dots.\nI'd also like to be able to turn the voice instructions off and just listen to the ambient sounds.\nA couple of little tweaks and it's easily a 5 star experience.\n\nHelpful | 6", "NinjaXMApr 3 at 12:24 PM\nI feel different after playing this\n\nUpdate: Ok, so I just realized that if you look behind you in the main menu theres an explore option which I thought was missing. I wont even complain about if hiding behind you... its called explore so you need to explore first to see it. Also you can turn off vibration entirely or do as I did and reverse it. Now my controller will only vibrate when Im out of the sphere and as a nice reminder to stay focused and in form. Now I can finally give it 5 stars.\n\nIll be straight and say that this game probably deserves 5 stars but the only reason Im giving it 4 is how difficult and stressful it can get sometimes. I know, ironic, considering how its supposed to be a relaxation experience and all.\n\nThe good:\nI was surprised by the number of available tracks and environments. Its crazy how many there are and tells you that the devs really wanted us to never feel bored of the game. I think they have achieved that. Also the graphics are really great.\n\nThings the devs can do to get 5 stars:\n\n1- I would love to have the option to choose a more forgiving difficulty. Like bigger spheres so I can worry less about where my hands are and focus more on the environment and my breathing. I need this, at least as a beginner.\n\n2- have a meditation mode where I can just sit down and listen to the music with no motion required. I know I can do this before the game starts, but then Id have a huge menu obstructing my view. Please do this.\n\nThe environments are lovely and detailed and its a shame I cant just sit there like I do in Nature treks VR for example. I really hope you read this and think about it at least.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 12:45 PM\n\nThanks so much! Bigger sphere mode is heading in a future update. Glad you found explore menu hidden behind you.  We have a massive update hitting early this month with 10+ new environments, new modes, options, features, and much more. Wishing you happy continued adventures in Guided Tai Chi!", "damian.piesseApr 4 at 5:31 AM\nAnnoying voice and sfx ruin this\n\nThe whole point of this I thought was to be relaxing. Nice locations, soothing environment sounds and calming music. Instead there is a irritating woman mumbling psycho babble about emptying my mind plus Mario-style gaming sound effects - none of which can not be muted. This app fails 100% simply because your can't turn any of this off. Instead of being chilled, I was simply stressed out and frustrated.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 10:25 AM\n\nThank you for your feedback! In FLOW MODE we have a teacher who is providing feedback based on your form. This isn't psycho babble, but actual teacher feedback from the original creators of Tij qun (24 short form). But we understand how frustrating this sort of thing can be if you don't like it, and in an update this month you'll be able to turn them off too! The sound effects are in ARCADE MODE which was designed for fun, competitive play. These will also have options to adjust in this month's update if you dislike them - but they are meant to indicate when in a flow (aka multiplier point) state. We hope you have a chance to try out our big update hitting this month with hundreds of new sessions, new modes, new environments, and more!", "thefattyApr 6 at 6:20 PM\nNot one bit like Tai Chi\n\nI was looking forward to having an at home vr experience of Tai chi with this app, but was massively let down. Instead of the relaxing the mind, you're required to use it to keep some balls on a line at s specific point that keeps moving at different speeds. Can't even enjoy the surroundings as you need to constantly be looking where the banks need to be on the line. Rubbish.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 1:08 PM\n\nI'm sorry we have diappointed you, thefatty. Our mission was to make Tai Chi instantly accessible, and in doing that had to rethink its implementation. People familiar with traditional teaching methods may prefer more familiar approaches. Hoping you have a chance to check out this month's update which will add 10 new environments, new modes, options, refinements, and much more!", "sidarokMay 9 at 2:31 PM\nMeh\n\nThe guide by two balls is quite distracting. Hard to focus on feet and the guide.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 9:19 AM\n\nIt is challenging, isn't it? That is why Tai Chi is called a moving meditation. This focus on balancing softness of form and multiple motions creates a bit of a zen state that takes practice. If looking for something light and without any pressure we'd recommend FLOW MODE. This is just a way to have fun with a virtual coach sharing form and relaxation tips. Once you feel comfy with the idea, ARCADE and WORLD TOUR are nice to challenge your precision or endurance. This month we'll be launching a massive update with tons of refinements, features, new modes, and environments. We hope you have a chance to try it again with this in mind!", "SaiyaJin.VMar 6 at 9:30 PM\nRelaxing Experience\n\nI was happy with the relaxing environments in the game. Will definitely continue to use. The best update I can immediately think of is to have some changes to the weather as time passes/give the option to change the weather on demand. Maybe cloud movement, rain, night, etc. Would further add to the sense of immersion. I suspect the developers will continue to enhance as there are a number of possibilities assuming the quest hardware can support.\n\nHelpful | 1", "amin.hedjaziApr 13 at 2:58 PM\nControllers are annoying\n\nIt would be great to see the new oculus hand recognition in this game instead of using the controller.\n\nHelpful | 1\nDeveloper ResponseJun 2 at 10:20 AM\n\nGood news: hand tracking is being worked on right now! We also have a big update going live early this month with many new modes, environments, features, and more. Wishing you happy continued adventures in Guided Tai Chi!", "danny.r.pattonMar 7 at 8:46 AM\nDans Review\n\nI like the app overall. Think its well worth the investment. Some improvements/recommendations would be that Id like to be able to see the persons hands, or possibly have the silhouette in front be turned around so you can mirror them. A solution would be to change the balls that you follow to hands and show their orientation.\n\nHelpful | 1\nDeveloper ResponseJun 3 at 9:55 AM\n\nThank you for your thoughts! Options to turn around or change teacher positions is coming very soon. We've learned that this is a key area of customization where preferences vary. We will be supporting hand tracking in the coming weeks, which will allow you to use hand models instead of the balls. This will also be a new option in the menu area. Wishing you many relaxing adventures ahead in Guided Tai Chi!", "h2o2009May 5 at 9:33 PM\n\nLove this game! Please add Hand Tracking.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 9:57 AM\n\nThanks so much for your kind thoughts! Hand tracking is coming! But first, we're going to be adding 10 new environments, new modes and new sessions, and dozens of new feature requests/refinements early this month. Wishing you happy continued adventures in Guided Tai Chi!", "ATP10012 days ago\nNo Support & Wonky\n\nReally wonky in tutorial mode.\n\nAttempted to look up support or FAQ on app portal and website.... There r no resources\n\nHelpful | 0", "PenylaynJan 24 at 7:02 PM\nBeautiful but difficult\n\nI was so excited to see Tai Chi and was really.hoping to be able to enjoy it. The graphics are beautiful and it is a very relaxing atmosphere. The difficulty is trying to teCk the white and black balls. It takes away from.the experience because it doesnt allow for beginners. Great concept but difficult to execute :/\n\nHelpful | 4", "EmtRN77May 22 at 9:11 AM\nBalance\n\nLove it!!!\n\nHelpful | 0\nDeveloper ResponseJun 2 at 8:53 AM", "KeithTheEditorMar 24 at 7:15 PM\nThe controllers make it difficult\n\nThis game is well thought out, beautifully designed, and seems to have dedicated developers. My two issues are....it's hard to see the feet movement of the examples when you are staring at your hands the whole time because it's difficult to hold your controllers into the white and black balls. Sometimes I think it would help to have \"ghost feet\" below you so you can easier see where to land your feet. And legs.\n\nMy main question to developers is...are you planning on using the hand tracking feature as soon as it's made available? Seems like something that would be perfect for this type of VR experience, and will make the game so much easier and enjoyable without having to hold the controllers!\n\nHelpful | 305\nDeveloper ResponseJun 2 at 1:19 PM\n\nThanks so much! Hand tracking in progress and should be live in the next few weeks. We recommend simply looking at your teachers to understand the best foot position. The icons are often best when needing to look down within a move. Hoping you enjoy this and the other updates we have planned!", "AleregeliMay 2 at 5:43 AM\nNot recommended\n\nYoure concentrating on a white and black dot. You cant learn Tai Chi that way.\n\nHelpful | 2", "CiridaeMar 15 at 9:15 AM\nMissing a few key features\n\nI like the concept a lot. Unfortunately it needs more polish. It often will move the doors you are meant to follow outside the room boundaries which often means bumping into walls. It desperately needs more body tracking or at least a making to show where the game wants you to stand as a starting position to endure you'll have room.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 1:22 PM\n\nThank you for your feedback! If you see paths that extend outside of your tracking then the Quest is having a challenge detecting your floor. We recommend visiting 'Options' to set arm length to correct this. If you still see any issues please let us know at gtc@cubicleninjas.com and we can help troubleshoot together. Thank you!", "haiho200Jul 28 at 3:39 PM\nLove Explorer mode!\n\nI use this app to escape to the various 20 nature environments to relax and meditate. They are magnificent and dynamic with trees, river, and wildlife.\n\nHelpful | 1", "DalcohsMar 6 at 6:02 PM\nPretty good\n\nI really like this app overall, but the lack of clear foot directions and ability to adjust stance takes a star away. Im 52 and have to sometimes take 2 steps to keep my hands wheee they should be, which tKes from the flow a bit.\n\nHelpful | 0", "BaileyHouseApr 15 at 9:30 AM\nOne of my favourite apps\n\nThis has a great combo of beautiful relaxing places to go and enjoy just being in and a wide range of soothing tai chi to get you moving gently.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 10:18 AM\n\nThank you so much! Hand tracking coming soon and a massive (free) update launching this month. We hope you enjoy it!", "ASURAFI3NDDec 11 at 4:21 AM\nIts time!!\n\nHonestly, I bought this app as a martial arts fanatic. I was only disappointed because of the fact that there is no mention of what school of tai chi this app teaches(Yang,Wu,definitely not Chen.etc). But now that Hand tracking is available, I'm expecting and hoping that the developers are going to notice that this is the best time for a huge update!\n\nHelpful | 40", "CarelS072Feb 14 at 6:29 PM\nReally good but not there yet\n\nI think most of reviews already cover it , tai chi is a great 'game'? But the controls are a bit awkward. I just found the foot positioning option for in the HUD which is useful but i think it would be worth having it always in line of sight. I find it very disruptive to keep on focussing on where i should put my hands and then have to look up or down to see how i should be positionjng my feet.\n\nThe other thing i hope the developers can figure out is to make depth perception more obvious when following the circle. It is not always clear if you need to move closer / away or aside.\n\nOverall it might be worth of adding a few arcade sessions into the tutorial, this way you can focus on the skills individually (follow 1 hand, 2 hands, feet positions, body position and breathing) before going into the flow sessions. Making it less of an overwhelming experience by focusing on all things at once.\n\nIn short I really like it, but the instructions are not always that obvious and can use some work. Also i often feel that my arms are too short for the movement but that could be my body posture not following the example correctly.\n\nHelpful | 2", "TraveljackMar 15 at 6:29 AM\nFirst time\n\nI bever practiced Tai Chi before. A friend recommended it. Though I still don't see much purpose of it I will continue using it so I can understand what it does to mind and body. This program is very helpful and I enjoy the sessions. It is relaxing that I can say.\n\nHelpful | 0", "SunshineWarriorJun 27 at 10:22 AM\nStrip of blurred pixels\n\nIt seems like there's a strip of blurred pixels at the bottom of the display during game play. Is there a bug or is it my OQ device? Doesn't appear on the main user console, only in the game.\n\nHelpful | 0\nDeveloper ResponseJun 29 at 1:09 PM\n\nGreat question! There is a developer technique called fixed foveated rendering we use on Guided Tai Chi, which is a fancy way of saying we increase the density of pixels in front of your eyes at the reduction of those on the edges. This also helps improve performance. But thank you for flagging this and if bothersome we can look into toggling this as option?", "FelicityCJun 13 at 10:31 AM\nwonderful value for physical therapy\n\nI've fractured both my shoulders and between poor healthcare and other problems I've never really had good physical therapy until I got into VR. Finally I was able to do something with my shoulders, but either it's a constant climbing type thing or fighting. Tai Chi (learning alone is hard and idk where nearby to find anything for) and this app lets me have both a wonderful light shoulder/back workout as well as a nice meditative session that lets me satisfy much neglected benefits of Daoist writings :)\n\nwould like more control over the sounds/voices and volumes for them, what sorts of things they say (i would really only like reminders to breathe and not other filler lines in particular)\n\ni saw about an update this month and am looking forward to it for sure (or did that already happen idk) or at least looking forward to hand tracking since holding the controllers really kills my vibe\n\nHelpful | 1", "astartesM_41Jan 11 at 3:59 AM\nPost beat saber cool down\n\nRecently downloaded and Im finding it difficult to do but super easy to understand what I should be doing, so very good for training conventration. I know Ive done it afterwards do suspect the ache indicates Im improving my strength/stamina. I like it and recommend it, hoping to get my arms going the right way soon so as I can start working on my feet. Would love to see a similar oculus\nintroduction to yoga!\n\nHelpful | 11", "Chraven87Feb 23 at 7:06 PM\nonly for people who can stand?\n\ni'm in a wheelchair been like that since birth and where i come from every where worth going to can only gotten to by car, which i do not have due to medical reasons right now which means im inside ALOT and if im not watching tv or working on an art piece its video games, recently i got the oculus quest for christmas(or rather 2 months after.......) this was one of the many games i've bought since then..........unless theres something going on with the game turns out \"comfortable\" does not mean sitting down with this game, then there is also the voice that needs work......you guys are on the right track but its missing something.......\n\nHelpful | 2", "HeyDWApr 5 at 6:33 AM\nTool\n\nThis app is a wonderful tool for centering your body, focus, concentration and relaxation. Thank you \n\nHelpful | 0\nDeveloper ResponseJun 2 at 12:47 PM\n\nThank you so much!", "clearsongFeb 10 at 8:25 AM\nDon't get it\n\nPurchased this game but I don't see that it teaches Tai Chi at all. You get transported to a pretty place and then you're supposed to trace the yin and yang lines with your arms. So I move around a lot, stepping back and forth and trying to keep up. It actually hurts my back from leaning forward. There's a guy next to me, showing me how to do it but there's no way to watch him and follow the paths. Not much to it. Wish I could get my money back!\n\nHelpful | 3", "JcfravenDec 1 at 6:10 PM\nInteresting yet iffy experience\n\nI have not gotten too much into this product yet, but I have played around a bit with it. It is an absolutely beautiful game, and an interesting time.\n\nThere are some iffy elements though, two in particular:\n-The explore feature appears to have no way to exit or change environments, leading to one having to return to the Oculus menu.\n-The orb path following is a bit odd to try to do, and I think it may be nice to allow one to disable having to follow the paths and stuff, and have an option to just follow along with the ghost instructor.\n-The voice that talks to you has seemingly no way to be turned off, which is a bif disappointing. Having an option to just peacefully do it without a voice in your ear would be nice.\n\nOverall though, it seems like a wonderful program, and I may very well keep it and use it.\n\nHelpful | 30", "FiaskoLLCDec 26 at 4:35 PM\nGreat way to calm a hyperactive mind\n\nI wasn't sure what to expect but was pleasantly surprised with nice graphics, lots of environments, decent tracking and music that won't drive you nuts. Doing the excercises with arm weights is a great workout, i've had it for two days and im feeling better already :) Would give 5 stars but looking forward to hand tracking and a bit more info about tai chi in general. I was hoping I could learn more from the app. Some kind of workout tracker and acheivements would make this a daily training app for years to come. Playing your own mp3s would also be a dream. Defintely worth the price if you need something to calm down from beatsaber madness. Looking forward to future updates. Ps: any chance for a space environment?\n\nHelpful | 5", "XandersmashJun 13 at 3:00 PM\nNo foot or breath advice\n\nIn tai chi foot placement as well as breath is very important just like yoga unfortunately this app has no instructions on those and expects you to follow along with the ghost people beside you. It also goes out of bounds and has no idea of arm length. You end up spending more time focusing on keeping your hands in the circle then actually breathing or relaxing.\n\nHelpful | 0\nDeveloper ResponseJun 16 at 9:49 AM\n\nThank you for your feedback! Good news: Guided VR does provide foot guidance, with detailed foot settings within options. This is displayed both on the ground and at eye level when activated. Breath guidance is shared in Flow mode, alongside movement, grounding, flow, and other tips. Arcade mode does not feature a guide, so no breath feedback is shared. Arm length is calculated based on height, but it can also be manually configured within options to work best for you. To avoid going out of bounds it is best to begin a session in the center or back center of your space, as movements forward can be quite large. If looking to relax further and you're familiar with yoga or Tai Chi, you may enjoy \"explore mode\" which is hidden behind your starting view in the main menu. This allows you to simply be in a scene without guidance, at your own pace. We hope these tips help you enjoy your experience even further!", "tongaDec 26 at 2:35 PM\nVery nice but one feature is missing\n\nGreat locations, nice graphics, very relaxing, however for Tai Chi learning the approach is too gamified. My wife asked me how to deactivate the spheres and see the trainer in front of her to follow his actions and probably get some more guidance.\n\nHelpful | 7", "wolfchilde101Feb 14 at 5:32 AM\nTai tea\n\nThis is just my cup of tea. Gentle flow workout to start the day. The UI is ingenious and if you hook the hand controls over your thumbs you can do sticky palm matching the spirit form instructor. Only tried the short forms where you get to pick the mood. I have absolutely no complaints. Well worth the money.\n\nHelpful | 4", "KoolCat99Feb 25 at 2:55 PM\n\nNice application. As a user I would like to see the images on my left and right a bit more forward so that they can be easily viewed.\n\nHelpful | 0", "JCC08May 11 at 9:16 PM\nWould be 5 stars with hand tracking!\n\nBeautiful environments with nature sounds and love the Explore mode to meditate and relax. I like the music and the \"shadow figures\", just wish hand tracking was enabled because it is kind of hard to get into a good flow with the controllers.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 9:01 AM\n\nGood news: hand tracking is on the way! We'll also be launching 10 new environments, new modes, and hundreds of new features for free this month. Wishing you happy continued adventures in Guided Tai Chi!", "TLCloakJan 2 at 6:58 AM\nOn target, now if it could reach it\n\nA decade (and a half) ago I was learning Tai Chi. I got to the point of learning about a third to a half of a 30-35 minute form from a highly experienced instructor when a shakeup caused a switch to Qigong. So, at the time my practice was stable on about a third of the form, and I very much enjoyed the practice. When I see this app, I'm a bit excited to reconnect, however first experiences say that something (maybe a lot of things) is lacking.\n\nFirst, I want to say the vision or goal of the app is very good. I can really feel where the developers are trying to go and it's a good place. It just does not feel like it properly incorporates the energy of 'Chi' as I remember it. The problem I hit was that trying to stay on target with the two circles was totally, and I mean totally, counter productive to relaxing and working with the energy of the movements. It produced unavoidable tension and a touch of anxiety or angst. That issue then led me to three other issues with the app. The first is the support system within the app. I don't want to turn this review into a giant bug report so I'm not going to list all of the deficiencies that occurred to me. However suffice it to say that the tutorial treats the user-to-app interaction as a game, and a somewhat trivial one at that. Much much more is needed. The next issue that popped into my head was whether there was any experienced Tai Chi authority working with or alongside the developers. I was finding it hard to believe such an authority would signoff on the final product; mainly because of the energy conflict mentioned before. I could not find any indication that the developers were working with someone on the app. However in the process I stumbled upon the third issue, the insubstantial nature of the app's website, consisting solely of an image of a person practicing and the title of the app. It's hard to properly convey how many red flags were raised in my head when I got to that point. Let me just say to the developers that it is not a good public image; it is pretty much equivalent to having no website.\n\nSo, I'm not saying that I don't like the app, I actually do, or at the least want to. Like I said its vision has very good energy, and the app's price is very reasonable. The delivery still needs work, maybe a lot of work.\n\nHelpful | 5", "RedwaireJan 26 at 9:14 PM\nThe interface has a fatal flaw.\n\nIt's a game that traces hand movements.\nHowever, when the hand comes to the left or right on the face or body, it is not indicated where to move the hand.\nThere is no clue to that.\nIf you remember choreography completely, you can do it.\nHowever, no one knows such a thing from the beginning, so the game never progresses.\nNo matter how late you are, you will have to start over from the beginning.\nIt was uncomfortable.\n\nHelpful | 5", "f_roseberryDec 11 at 4:02 AM\nKing of the chill\n\nA hidden gem on the store ! So much content, and more than decent graphics. When looking for a peaceful app (not everyone wants to kill zombies in VR :p), this is the One. I mean, there are more active games out there, but given the very low price of this one, its a hell of a good bang for your buck !\n\nIve done some tai-chi with a real-life teacher before, and heres some suggestions I have for the app :\n\n- He always taught the moves of the left hand, then the right, then both. So, in order to not feel overwhelmed at first, Id propose the same in the app. Could be in the Flow menu, when you select a session, you could then choose if you wanna do it with left hand only, right hand only, or both. The spheres would be toggled on or off appropriately.\n- He always named the moves (the guitar, the monkey, the horse, etc.). I dont know if this is tai-chi standard or if he just made it up for his class. Anyway, could be great for the app to show move names, so you could be less focused on the spheres and the silhouette in front of you and just go with the flow. Now, I know this kind of goes against your beginner-friendly, nothing to learn branding, so it could be an option, by default it could be off.\n\nI heard hand tracking is coming soon on the Quest, this app could be a perfect use-case for it, as it would allow you to move even more naturally, in the flow.\n\nAnyway, great job guys, awesome use of VR !\n\nHelpful | 21", "meekster33Feb 11 at 3:33 PM\nGreat and relaxing\n\nThis game is great at presenting a relaxing atmosphere, which isn't 100% realistic, but is almost like being in an animation or a painting. And, if you really concentrate on the movements and your breathing, it's a nice de-stresser. Now, I have no idea what I'm doing, and I can't say I \"know Tai Chi\" as a result of the game, but taken as a way to relax yourself, it does the job. An idea for the developers would be to incorporate a tutorial for the 24 movements that are common to modern group-led Tai Chi and show how to do them and learn them altogether as a set. Then you would actually be teaching Tai Chi and there would be more of a point to the game. You could take what you've learned and join any group of Tai Chi enthusiasts at any park and fit right in. Even without this I love it. And for those complaining that they have to grip the controllers, install hand holders on your grips and you can let go and feel more controller-free. Looking forward to your updates developers (hopefully there are some). Thanks!\n\n**edit** Just read several other reviews and saw the developers are already planning on doing what I suggested. Awesome!!! What a day and age when you can make \"suggestions\" to game developers... and they respond back! A far cry from my days as a snot-nosed kid playing Space Invaders on my Atari 2600..\n\nHelpful | 1", "BreedanFeb 18 at 12:43 PM\nGreat app\n\nLove the concept, and it is well executed. I believe there are ways to improve this but none that are easy. Like, showing foot placement/tracking. I think the center balls need to be a bit larger or at least add me ur options to adjust the sizes of the balls.\n\nHelpful | 0", "crzyfrog2010Jan 29 at 1:23 PM\nNot there yet\n\nContext - I am 63 - and grandson is 9. As usual, he has mastered the Oculus Quest and I am scratching my head. I really want this technology to transform our wellness but this stuff takes time. I suspect some issues are in the apps but I need a training camp on the hardware and operation especially start/stoping or switching apps.\n\nHelpful | 0", "SpenceJTMay 28 at 5:22 AM\nFirst time trying Tai Chi\n\nIt's a great introduction, and I really enjoy what I have seen so far.\n\nI hope that they adapt this app for hand tracking. I find holding the controls to be a slight distraction, taking me out of the moment.\n\nHelpful | 5\nDeveloper ResponseJun 2 at 8:58 AM\n\nThanks for your feedback! Hand tracking is being worked on right now. We think it is a perfect match for Tai Chi and are excited to release this once fully tested. And just between us, we have a BIG update going live early this month. New modes, 100+ new sessions, many requested features, and 10+ new environments to relax within. Wishing you happy continued adventures in Tai Chi!", "PocketDeucesFeb 26 at 11:12 AM\nEnjoyable and relaxing\n\nGreat warm up and wind down app for other exercise apps\n\nHelpful | 0", "jamesgroteMay 11 at 9:08 PM\nBeautiful and relaxing\n\nI really like the Explore option. You can just move the balls around painting the air. The environments are really beautiful and relaxing.\n\nI would like to see other tracking options. Following the moving spheres is anxiety-inducing at times. Instead of moving spheres, how about hoops appearing and you just need to move through the next hoop. That would be simpler and more relaxing as an option.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 9:06 AM\n\nThank you for your feedback! We'll test hoops as a potential feature and if this works well add into the options area. Glad to hear that you've found the 'explore' mode! Many people don't find it. Hint for those reading: it is secretly behind you on the main menu. Simply sharing that we have a big update going live this month which will more than double the content in the app. We hope you have a chance to enjoy it!", "adam.duke.1422Feb 9 at 6:59 AM\nWorth 8\n\nNot a bad game, but I wish the target area was larger: maintaining contact with both arms is really hard.\n\nHelpful | 0", "cybergazzJan 5 at 1:53 PM\nJust about defenestrated the headset\n\nI can't follow the spheres - might be able to do it if a voice didn't repeat the same highly irritating phrase over and over and over and over with no way to shut it up. I just want to follow the shadow person. No way to get out of exploration without returning to oculus. I just can't cope with the sphere thing. And I dislike games with no point and click exit. Wish hadn't wasted money.\n\nHelpful | 4", "hayden1010Jun 6 at 3:35 PM\nWhat I have learned\n\nHow to break my back. Extend my arm passed its limit.The game doesnt have fighting. I am not learning 50 forms or whatever.How does the devs\nmemorize the sessions\n\nHelpful | 0\nDeveloper ResponseJun 11 at 8:21 AM\n\nThank you for your feedback! We might recommend calibrating your arm length in the options to scale the routines best for you. Our team would be happy to help further at gtc@cubicleninjas.com to troubleshoot together!", "XFrame34Feb 2 at 9:05 AM\nCannot Stay In Roomscale Boundary\n\nLike the concept. Want to practice this every day. However, I find it annoying and distracting that the motions are taking me outside the roomscale boundary. What am I doing wrong here???\n\nHelpful | 0", "FearTheArrowJan 25 at 10:26 PM\nGreat but needs scoring\n\nI'd like to have scoring so I can see how I'm doing in regards to being in the circle, like have a rating system to see progress\n\nHelpful | 0", "sponderbMay 15 at 5:38 PM\nSo far, really disappointing\n\nI don't find the activities or how they are guided to be user-friendly or much like the Tai-Chi I have practiced. i want a refund. totally useless\n\nHelpful | 3\nDeveloper ResponseJun 2 at 11:56 AM\n\nThanks for your feedback! We believe the best way to enjoy Tai Chi is to dive in. But for those used to a more traditional practice, they may prefer what is more familiar to them. If you don't love it, we encourage you to request a refund! Our only hope was to build an app that could help people allow people to enjoy Tai Chi in a fresh way.", "bencharlton20Mar 6 at 7:47 AM\nGreat\n\nRelaxing can really do it mad lol\n\nHelpful | 0", "VapoholicMar 15 at 2:26 PM\nHow\n\nHow does one go about getting a refund\n\nHelpful | 0", "VikingCatNov 27 at 9:31 AM\nMirror-guide option?\n\nI'm enthusiastic about the program, and with practice I'm confident it will get easier to keep centered in the hand position guides and also try to move my feet and shift weight appropriately. For now all my concentration is on the floating spheres.\n\nI found that even with a fairly large cage area (around 7'x7') I'm unable to stay in the guides because they breach the front of the cage. (My hands literally hit the wall.) If the foot position started slightly back instead of centered this may be less of an issue.\n\nI would also like an option to have the shadow guide facing instead of with his back to the player, to allow for mirror image guide. And finally, for a simpler experience (or really new beginners, or old folks like me) how about an option to ONLY follow a mirror image guide, without the hand controllers and floating spheres? After a few practice runs watching and following a person, it would be a logical progression to add the floating spheres, and progress from there.\n\nI'm grateful the program allows for a non-game experience to just meditate in the beautiful environments.\n\nHelpful | 6", "wargoddess7Dec 4 at 11:51 AM\nLove it\n\nI always wanted to try Tai chi so was ecstatic to be able to try it here and I love it. Like some of the other reviews I agree about the extension sometimes being too far for my arms ( I'm 5ft 2) and about being asked to relax with soft movements but I'm trying to keep a grip on the controller. Other than that, I am really enjoying this! Thank you \n\nHelpful | 2", "AntosharpDec 25 at 10:45 AM\nI guess I am two feet tall now\n\nI loved the game until the moment I messed with the arms length calibration.\nAfter that, the game thinks im a toodler 2 feet tall. Maybe im missing an option to calibrate my height but I don't see it. Shame. I wanted my mother to experience VR as a way to relax.\n\nHelpful | 4", "Street2Jan 23 at 9:14 AM\nGuided Tai Chi\n\nGood exercise, not too difficult if you dont want it to be.\n\nHelpful | 0", "hightechfoolDec 1 at 11:48 PM\nGreat value! Great meditation\n\nIt takes a huge amount of focus to trace the movements, so sometimes I don't get to enjoy the beautiful surroundings as much as I'd like. Be sure to take all that in before you start each round! Other than that issue... I really enjoy this one. They packed it full of music and tai chi, so for this price I almost gave it 5 stars. Definitely recommend\n\nHelpful | 0", "BokTheBoxFeb 1 at 4:48 PM\nHoly sh*t my arms ow f*ck my back\n\nHoly sh*t ow f*ck ow sh*t my back just fu*king broke but thats how you know its good exercise 10/10\n\nHelpful | 0", "Crowley_Jan 8 at 12:52 PM\nIt's not really tai chi\n\nI would call this more guided meditation than guided tai chi.\n\nHelpful | 5", "karen.wilbur.31Jan 22 at 3:37 PM\nGuided Tai chi\n\nI really like this app I am spending every day with it. It's well done and relaxing. Highly recommend\n\nHelpful | 1", "handshake051Nov 27 at 6:12 PM\nCalming?\n\nHow is this title supposed to be calming? The tutorial doesnt tell you what to do with your breath, where to place your focus (except on keeping the controller inside the spheres). Not calming or entertaining.\n\nHelpful | 9", "AmlbuzzerDec 15 at 4:49 PM\nMuch better than I expected\n\nAfter putting off this game although on my wishlist I decided to go for it on a quiet vr launch week , so glad I did , I'm really enjoying chasing the leaderboards in the 100 levels , really well made game at such a low price\n\nHelpful | 2", "punkgeekJan 25 at 5:42 PM\nI was skeptical but this is amazing.\n\nI hope lots more people try it.\n\nHelpful | 0", "CBBCCBBCDec 29 at 9:09 AM\nLovely relaxing game\n\nI really like this game. There are loads of sessions to try out, relaxing environments and its relatively easy to get stuck in. Fully recommend!\n\nHelpful | 1", "trieuroDec 15 at 1:51 PM\nHigh hope to learn Tai Chi\n\nI had been searching for few years for Tai Chi VR. Finally, it is here. I purchased Quest because I want to learn Tai Chi from home. So far, this is a very good program to learn basic about Tai Chi. I wish there are more moves.\n\nHelpful | 2", "SimsarolDec 29 at 11:34 AM\nFrench\n\nIs it ok to follow when you are fluent English or not ... too difficult ?\nThanks for answering, just bought it but never tried.\nMerci\n\nHelpful | 0", "thetntdudeDec 20 at 9:33 PM\nSo relaxing\n\nI struggle with so many mental problems and I wanted to get into tai chi. This is an amazing way to do tai chi and is so relaxing\n\nHelpful | 2", "RobotRisingOct 18 at 7:24 AM\nGreat relaxing experience\n\nHoping this will help with some back pain I have been having received. In either case it was very relaxing as a meditation tool.\n\nOnly change I would make would be to have the option to reset your standing position in relation to your guardian. It seems to start me too far forward so i end up pushing into my guardian and bringing up the fence which is distracting.\n\nGreat job and hope to see more like this!\n\nHelpful | 1", "noyhtisNov 14 at 1:04 PM\nFeels good!\n\nIve enjoyed the game a lot and have for a few weeks stuck with it. Putting in an hour of this regularly definitely has a huge positive effect on the body and mind.\n\nI would also appreciate the opportunity to myself move from a 3rd person view to better see the movement.\n\nHelpful | 1", "SpongiformOct 5 at 2:17 AM\nRelaxing, nearly perfect!\n\nI am greatly enjoying this app. It is well designed, easy to use and get into, and truly immersive. A few suggestions for improvement:\n- Allow to adjust the voice volume or mute it. I'd like the option to go through the sessions with just the environmental sounds and music, without the constant reminders to breathe.\n- Provide a \"form training\" section to allow users to learn each move/form and their names. This would allow users to improve them (for example using youtube videos) and practice them in real life.\n- The arm length calibration doesn't seem to be spot-on. During the sessions, it feels like my arm are too short to follow the moves without overstretching them. However, if I try to calibrate the app without fully extending my arms, the distance becomes too short; the app can't seem to find the exact length.\nOther than that, fantastic app! I now fully integrate VR tai chi sessions in my daily routine, and it really helps me keep balanced and fit.\n\nHelpful | 2\nDeveloper ResponseOct 10 at 11:48 AM\n\nThank you for your kind words and helpful feedback! Well be adding in volume control for teacher, environment, and music to a future update this year. Additionally, we have an update coming to the arm calibration which should help for your situation (who knew arm lengths were so unique!). Thank you again for sharing your ideas and wishing exciting adventures ahead in Guided Tai Chi!", "MyrddinDeCelestisJan 14 at 1:28 AM\nMeh\n\nNot very good\n\nHelpful | 0", "Peaceful_MindOct 27 at 6:25 AM\nHelps with both mental & physical health\n\nI have been hanging hopes for some modifications to be implemented to save this wonderful application as it has all the necessary elements for tai chi. I believe that developers can make it one of top apps by adding the option to remove the teacher so that not to get visually distracted and would help also adding free style, this together with adding colorful beams of energy flowing with hands plus an aura like and other effects 'like with a click you could send a wave of chi energy towards any direction your hand is moving towards' would make me use this app everyday to help my mind to synchronise itself with the Chi energy beams of lights.\n\nOther suggestion: consider adding foot steps on the grown (Alternatively and to avoid looking down you can signal the initiation of a foot movement by adding glowing light on the teacher's feet few seconds before and during the entire movement range' to make it easier to follow the right body posture. This might help in solving the problem mentioned earlier of getting visually distracted by trying to follow both the balls and the teachers moves, as a change in the teacher feet position is difficult to follow or predict at time focusing on the balls.\n\nI wonder if adding multiplayers is possible by having rooms in which several people can join?\n\nUpdate:\n\nI am very thankful for the developers' response as I could finally find the hidden 'explorer' menu which allowed me to do my freestyle technique 'awesome!'\n\nI feel very very excited awaiting some new features to be implemented 'especially the colour beams of chi energy we can send with hands move by a click' which will make this app a as number '1' in helping to boost both mental and physical health staminas as the mind will find it easier to synchronise its brain waves with what it creates of visual effects 'rather than just imitating teachers' as the former can activate a positive feedback system.\n'I imagine how wonderful 'shifting the clouds' freestyle will look like if my dreamful suggestions came true' <3\n\nupdate 27 Oct: Amazing edition by showing footsteps which made it easier to follow instructions; however, would turn much easier and less straining if footsteps are to follow my visual field or to run slightly above the energy balls.\nI very admire the developers kind response to our humble suggestions and their enthusiasm to bring a user-friendly experience so that many people would benefit from. This reflects a divine intention to help and connect with others peacefully.\n\n\nThank you from the depth of my soul and very well done !\n\nPeace _/\\_\n\nHelpful | 17\nDeveloper ResponseOct 10 at 12:42 PM\n\nThank you for your feedback! 1) Good news: teacher options will be coming in Novembers update, allowing you to turn off or mirror teachers to your preference. The current approach is modeled after traditional training rooms, which allow seeing the same move set from multiple perspectives. 2) If youre looking for a more open freestyle, there is an hidden menu option behind your start position in the main menu which sounds ideal for your uses. The goal of Tai Chi is to find focus in dedicated movement, mirroring the precision as a way to lose sense of self. If youre staring at the ball in focus youre achieving our goal! 3) Good idea! Well explore this further. We created this app to help people of all ages and experience levels experience Tai Chi. You might enjoy Flow Mode, which has no points, and is there to allow you to play without worries. Thank you again for your ideas and wishing you fun adventures ahead in Tai Chi!", "fowadmOct 18 at 1:40 AM\nExcellent for mind and body\n\nI use this app everyday, at least once.\nIt has to be the most unique , meditative and relaxing app I have ever used on any device.\nThe instructor gives clear and motivational advice that makes you feel as though you are actually with another person and the ghost characters allow you to see how to get into form.\nI love this app and it is very helpful for the back, which I am rehabilitating after a bulging disc.\nIf the technology allowed you to see yourself compared to the ghost characters, so you could check your form during exercises, it would be perfect.\nNevertheless, it is still excellent. Well done!\n\nHelpful | 7", "koobiluphiOct 3 at 5:54 PM\nGives me anxiety\n\nFor a game that is supposed to calm and relax me, this does the opposite. There are too many things to try to focus on. The floating orbs, the foot positions, the voices. Too much! I wished theyd get rid of the floating orbs and just put a teacher in front of me that I can mirror. Mirroring the teachers movements (like how people actually learn Tai Chi) would let me see their hands and feet at the same time. Currently the orbs are so close to my face that I cant see anything else. I was really hoping this would be better based on the reviews.\n\nHelpful | 4\nDeveloper ResponseOct 10 at 12:49 PM\n\nWe appreciate your ideas! Our November update will include an option to turn off the balls in Flow mode, if preferred. If the balls are too close to your face, you are wearing a 6 degrees of freedom headset, so the best approach would be to mirror your teachers body movements and lean away from them. This is simplified form of Tai Chi which removes steps and rotations to make it as easy as possible for new users. It also allows enhancements not possible in reality, like path tracing or Arcade mode. Wishing you exciting continued adventures ahead in Guide Tai Chi!", "geekgurrrlNov 13 at 2:41 PM\nJust started but like it\n\nI started with this app and I love it so far! I wish there were longer sessions!\n\nHelpful | 0", "rozemarijnkSep 22, 2019 at 1:45 AM\nLovely 'game'\n\nI really love the 'game'. It relaxes me a lot. I'm terrible in following the dots so I take a step back and just follow the dots in a distance in my own way and that works great. Because of this I never do the arcade mode.\nI have two points I miss in the game. The first is the possibility to disable the womans voice. Or at least change the volume of the woman. I really would like the possibility to hear the music louder than the woman.\nThe second thing is that I miss the option to choose for a 10 and 15 minute session. Ofcourse I can start a 5 minute session 3 times but every time it stops I loose my flow. So longer sessions would be great.\nThanks for the game!\n\nHelpful | 2\nDeveloper ResponseOct 10 at 11:55 AM\n\nThank you so much for your kind words and actionable feedback! A future update will allow full volume control of the teachers audio, music, and environment. This will allow you to mute or mix these to best meet your needs. 15- minute sessions will be part of our next update for World Tour mode. We see World Tour as a playlist, which allow you to refresh across a series of smaller sessions. Thanks so much and we hope you enjoy the future enhancements!", "ginger2245Oct 7 at 2:46 PM\nBeautiful but ....\n\nHow can I get rid of the time and points sign which blocks the view? You've made everything so beautiful why have those ugly black slashes there? Is there a way to get rid of them so I can fully emerge?\n\nHelpful | 0\nDeveloper ResponseOct 10 at 11:43 AM\n\nThank you for your feedback! Will do! The ability to remove the Arcade and Flow UI elements will be a toggle in Options in a future update. Later this month well be launching new environments and modes based on previous user request. Were grateful for your ideas so we can make this the best experience it can be. Wishing you happy continued adventures in Tai Chi!", "Emilian1978Oct 11 at 9:06 PM\nNothing to do with the real Tai Chi\n\nYou should just go to YouTube, search for Tai chi and watch taiflow. That is a great teacher.\n\nWhy this app doesn't have such a module, to learn real Tai chi from within the app? It would of been a blast for the beginners.\n\nRight now, your app is just a lame excuse to swing your body and hands thinking that you're doing some good with them.\n\n3 stars out of pity for an useless Tai chi app. You should change its name, since you're shaming the real Tai chi. Name it, let's say, follow the dots.\n\nHelpful | 9\nDeveloper ResponseOct 10 at 2:59 PM\n\nThank you for your honest thoughts. We may disagree, but we know your enthusiasm comes from a good place! When we created Guided Meditation VR we had many people (literally thousands) tell us that using virtual reality for relaxation and meditation was wrong. Today, with Guided Tai Chi, we see the same challenges from those with pre-exiting expectations of what is real or correct. If you are looking for traditional Tai Chi training, there are endless options available. If a youtube video makes you happy, then this is wonderful. We love Taiflow as well, spending hours with her work! But VR has the possibility to be more, and deserves to be. To not explore would be a true insult. We will never be ashamed of building apps that go beyond mimicking the past to explore new potential. Tai Chi is not (and never has been) a static art. It has evolved significantly over the past 100 years, adapting to the needs of the culture around it. 24-form was born in 1956. 42-form was born in 1989. Even your reference to YouTube as a teacher is in direct contrast to many of the past principles of Tai Chi training. Tai Chi is a constantly changing movement art, and VR is a new exploration of this, requiring a new way of thought. Late this year we will launch the simplified 24-form within Guided Tai Chi, which we hope you have a chance to try this to see if it better aligns to your aspirations!", "ChaonautMay 22, 2019 at 5:59 PM\nA great introduction to tai chi\n\nIve wanted to practice tai chi for a while now and this game finally gave me the push I needed to give it a go. There are a lot of sceneries and exercises available, and theres even an arcade mode with a leaderboard. Its all very peaceful and well presented.\n\nI only have two gripes. 1) Youre supposed to be relaxed, but your hands arent because theyre gripping the controllers. I had to hold them in such a way that my fingers were partly through the rings, but that never felt secure. 2) Maybe my arms are short, but some movements had me reach too far forward. There are ghost-like people around you and Id follow their lead, but even still, the path you trace was out of my reach.\n\nIf youre interested in tai chi, this is well worth your time and money. Its more gamey than I thought it would be, but in a very good way. Tracing the paths can be challenging and arcade mode can liven things up. Im definitely making this game a part of my regular exercise and meditation routines.\n\nHelpful | 213\nDeveloper ResponseOct 11 at 7:15 AM\n\nFrom everyone on the team: thank you for the kind words, helpful ideas, and actionable feedback! The session pathing is dynamically scaled based on HMD height, but we'll explore ways to refine this further based on your notes. Thanks again and wishing you fun adventures ahead in Guided Tai Chi! Update (7/5/19): the arm length update is live! This can be set in Options > Adjust Arm Distance. Launching today also include 150 new sessions, two new modes (World Tour and Explore), two new environments (Lost Falls and Dolphin Cay), and hundreds of enhancements. We hope you enjoy!  Update (10/11/19): Our new update will be hitting later this month which includes community requests like: refinements to modes, menu enhancements, new 15-minute sessions, and many new options to customize features even further. This also includes two new environments. Hope you enjoy!", "aawhystineSep 29, 2019 at 11:19 AM\nDangerous\n\nThe game completely disregards the guardian. I will be standing in the middle of the guardian (set to >6.5'x6.5', click to start, and it pops the feet at the very edge of the guardian right next to a countertop and potted plant. Just touching the dots initially gets at least 1 hand giving a guardian warning, then it immediately pushes both hands outside the guardian. EVERY TIME. I've repeatedly felt the leaves of the plant on the counter, which is well beyond the guardian.\n\nUnder NO circumstances should a GUIDED game be capable of guiding your body parts beyond that guardian. That's just dangerous.\n\nHelpful | 4\nDeveloper ResponseOct 10 at 2:20 PM\n\nGuided Tai Chi allows you to begin your session where ever you choose within your play space. If you choose a location near the edge of the guardian, the guardian will display. If youre seeing the guardian, take a step back from the center to allow your forward movements to not trigger this. Oculus apps have no control over the guardian display, or your physical placement within the guardian space. Guided Tai Chi also supports standing mode, which reduces the forward motion capture movements for those with smaller play spaces. Wed recommend testing both of these built-in options to find which works best for you.", "IloveVR86Nov 20 at 11:37 PM\nNice!\n\nThis App is an awesome experience. You should develop a Kung Fu App also\n\nHelpful | 0", "AmadhiaSep 6, 2019 at 1:51 PM\nLOVE the concept! (updated review)\n\nLove the concept, and love that the developers are so responsive! It really shows that they care about what they're creating and how it's being received!\n\n!!! Latest update now includes function to manually set arm length, (look in settings). Made a huge difference to my experience, (I guess I have short arms?)\n\nEnvironments are beautiful, (especially for Quest's limited abilities).\n\nBut at the moment, don't expect a replacement for true Tai Chi training. Look at this more of a great proof-of-concept: The concept is fantastic, and am so glad a developer is taking this kind of leap to really push the boundaries of what VR can be used for!\n\nI look forward to their continued development of this experience!\n\n\n______________________________\nThat being said, I'd still love to see a lot more options to bring this from what feels more like a GUIDED (moving) MEDITATION into actual Tai Chi practice.\n\nIncluding OPTIONS to en/dis-able:\n* Practice actual forms/poses/transitions (user chooses start & end in form list)\n\n* Mute new-age voice-over and/or repl. w/ movement/form name\n\n* V.O. choices, including Asian actor\n\n* Include hand rotations\n\n* Overlay target figure onto user's position instead of in-front of and beside player (thanks to proprioception, this would really help people learn).\n\nHelpful | 2\nDeveloper ResponseSep 3, 2019 at 9:28 AM\n\nThanks for your feedback! Guided Tai Chi session data automatically scales mo-cap data based on your HMD height from the floor. If you're running into any issues you can visit the Guided Tai Chi Main Menu and Options to manually re-calibrate your your arm length to work best for you. In an update hitting this week we're detecting if you're not able to reach the balls and will ask if you'd like to manually calibrate to streamline this flow. This will also come with new environments and features. As you might see from user comments, most people find the existing structure challenging! We found in user testing that hand rotation and listing moves made this especially frustrating, but hand rotation will be available in a future update for those who like extra challenge! Wishing you fun adventures ahead in Guided Tai Chi!", "TomiGotchiSep 7, 2019 at 6:29 AM\nGood but could be better easily\n\nGuided Tai Chi is a nice App but I'm missing some options like the following :\n\n- hear or mute voice of guide (for example I, and maybe some advanced too, do not need a voice telling me \"don't forget to breeze\", if I forget, I will be dead within about 128 seconds  \n\n- combine / listen to with my own music\n\n- show / hide points (on arcade session), because while showing it disturbs my concentration\n\n- adjust the position of the shadow-guide, I think it would be helpful to have the option, to see it in front of me. If I have to turn left or right to watch the guide, I will miss the view to the hand-guide\n\nTHANKS, and sorry for my bad english \n\nHelpful | 0\nDeveloper ResponseSep 9, 2019 at 10:24 AM\n\nThank you for your feedback!  We're working on an update for this week which will include all changes. Your English is great by the way! Wishing you fun continued adventures in Guided Tai Chi!", "alotus9Sep 18, 2019 at 8:40 AM\nI am INLOVE with this game\n\nI cant get over how beautiful the sceneries are. The main mountain, the cave, the beach, and underwater aquarium being my FAVORITES.I was walking around my room for 30 minutes trying not to look down because the scenes look VERY REAL. In terms of the options of the game and the music my expectations were greatly EXCEEDED. The main menu is easy and inspiring to work with. The music is beautiful as well. Everything about this game is beautiful. It would be even better if we had an option to switch the scenes to night time mode. Epic scenes like Pandora, snowy mountain, mountain with tornados swirling around, big waterfalls, over the clouds, seeing the Milky Way, next to the moon are all suggestions for upgrades\n\nHelpful | 6\nDeveloper ResponseOct 10 at 11:53 AM\n\nThank you so much! Night mode is a very cool idea and wed love this as well. Well add it (and your environment thoughts) to our list of future ideas. Later this month well be adding in new environments, modes, and features. We hope you enjoy new adventures in Tai Chi ahead!", "wirewigglerSep 7, 2019 at 7:13 PM\nDisapointed\n\nYou are supposed to follow spheres with your hands, however they just appear as circles witch makes depth perception impossible. Also it keeps moving you foreword until you start seeing the guardian. It should announce when you need to move your feet. I am pretty disappointed in this purchase. I see the VR platform as a real tool to help keep elderly moving but feel this application falls short.\nThanks\nBill\n\nHelpful | 3\nDeveloper ResponseSep 9, 2019 at 10:34 AM\n\nThank you for the feedback! We agree that VR is an ideal platform for Health & Wellness, especially for the elderly. If you have any ideas on how to better help differentiate the depth for this audience though we'd love to see how to implement. Please email gtc@cubicleninjas.com with your suggestions. The spheres are currently fully 3D objects, with 3D line paths to help showcase their depth. They are fully lit with a moving texture to better contrast them against the environment, but do you feel a different color or texture might better assist? If you're playing in a smaller roomscale space we'd recommend selecting the standing option in the Oculus home menu before you begin. This will help your session paths to become much smaller to better fit your guardian space. Or if you begin a session in a normal roomscale environment, please be sure to choose the center of this space to begin (versus the edge). Starting at the edge will push you out of your guardian boundaries. Wishing you exciting adventures ahead in Guided Tai Chi!", "JollyOrcAug 28, 2019 at 4:57 AM\nThis is nearly perfect.\n\nI really like the idea of this, and a lot of the game already nails things: The environments are beautiful, the music sets the mood and is not annoying, the voice prompts don't feel too artificial, this is a really relaxing but still challenging experience. This is becoming part of my daily routine already!\n\nThat said, there are a few things that could be better:\n* while there is an \"adjust arm length\" system, some of the assumptions it then makes don't quite fit my statute. I tricked the system by actually holding the controllers over my head during that calibration, but it still sometimes feels awkward at times, when I have to reach too far down, or too far outwards.\n* The ghost figures are really helpful in terms of stance, but you can't watch them when you're concentrating on a movement, and then I miss cues on foot stance, or how to hold my hands (palms up or down, etc.) Having voice prompts or even showing the hands instead of the spheres would be neat.\n* minor quibble: the grass models really jar me sometimes. I understand that this is due to hardware restrictions and all, but they are really regular crosses, and thus remind me of computer games from 20 years ago :).\n* practice makes perfect, but the level selection menu seems to start with different ones each time I go there, so I have to hunt for the one I want to repeat.\n* lastly: I'm really looking forward to 15 or 30 minutes sessions. The 5 minute ones are a bit too short for my taste, but 60 minutes is way too much. Right now I just do 2 to 3 5 minute ones in a row, but that feels a bit jarring.\n\nHelpful | 1\nDeveloper ResponseAug 30, 2019 at 10:01 AM\n\nThank you for the kind words and helpful feedback!  You make a great point about the \"adjust arm length feature\". It might help to show a path in this mode after calibration to ensure it works as preferred. Hmm, we'll explore further! Teacher options will hitting in the future as well, which will allow you to have greater control over their position (facing, non-facing). Good point on the session ordering! We'll see if we can adjust the listing so it defaults to random, but can be displayed alphabetically as well. Good news: 15-minute and 30-minute sessions will be launching next week, alongside new environments. They feel really nice! Thanks again for helping us make the best app we can. We hope you enjoy the upcoming enhancements!", "Tudou731May 24, 2019 at 4:02 PM\nVery impressive\n\nI had spotted this in the games list pre-launch and was cautiously optimistic as I had been hoping for a tai chi app in VR for a couple of years. Had confidence that it was stated to be developed by the same guys who did guided meditation.\n\nApp has exceeded my expectations. The presentation is really professional, and the idea of complimenting the hand movement guides with a ghostly figure showing the intended body positioning is really good.\n\nThe main thing is that this is genuinely relaxing.\n\nWorth the price, and hopefully will be supported given that guided mediations is packed with content now.\n\nHelpful | 63\nDeveloper ResponseJul 5, 2019 at 1:23 PM\n\nThank you for the lovely review! You're 100% correct that we'll be continuing to expand the app based on the awesome community's feedback, just like Guided Meditation VR. Next month we'll be launching dozens of new sessions, new environments, and maybe even an exciting new mode... Wishing you happy continued adventures in Guided Tai Chi! Update (7/5/19): our big update just went live for 100% free. There are now 200 sessions, 3-minute to 60-minute sessions, and over 11 environments custom built for the Quest. We hope you enjoy!", "HollywoodDR0Nov 9 at 12:16 AM\nLearn and practice and you can be master\n\nTo reach master level your mind body and soul must be one.\n\nHelpful | 1", "mrenno2006Sep 6, 2019 at 12:36 AM\nAmazing\n\nThis is an amazing app guys. I used to play BoxVR and than come to it for stretch myself and breathe. It is easy to use and beautiful. Really relaxing. =) I would like to request the developers to please create some way to move away the menu after finishing the session. The landscapes are so well build that I used to spend a long time just to appreciate it but with the menu in the way is difficult to see properly the whole nature around. Is that possible? It would be amazing and definitively an simple and BIG extra to the app. Keep it up guys!! thanks a lot\n\nHelpful | 7", "kalindejanNov 15 at 1:42 PM\nRelaxing\n\nNice music\n\nHelpful | 0", "NovelMakerAug 25, 2019 at 8:07 AM\nMixed feelings\n\nI love the beautiful sceneries but I find this game way too difficult for me (maybe because I'm not able to see in 3D?) I didn't ask for a refund because I want to support developers.\n\nHelpful | 2\nDeveloper ResponseAug 27, 2019 at 11:50 AM\n\nYou are an awesomely kind person. We might recommend trying Standing/Seated mode if in Room Scale mode. It can be activated in the Oculus menu before you launch the app and we have it constrain the paths so that they're a bit less challenging. It can also help to move your body slightly in a session (forward/back, side to side) as this can help clarify depth. And if you have any additional ideas on how we can help make this a better fit for you, please email us at gtc@cubicleninjas.com. We want you to be able to enjoy!", "jesse.melcherOct 31 at 7:41 AM\nAmazing\n\nJust got this but I love it so far.\n\nHelpful | 2", "NoPrivacyAug 23, 2019 at 9:47 PM\nThe lines stretch far away from my reach\n\nThe lines and orbs I'm supposes to follow with my hands stretch too far and I have to move my body to reach them. I assume these are supposed to be in hands reach but they aren't. Many times the walk so far and if I move I see the guardian.\nDevs please respond to my review once this has been fixed\n\nHelpful | 3\nDeveloper ResponseAug 30, 2019 at 9:55 AM\n\nHi NoPrivacy! Guided Tai Chi automatically sets arm length based on your height. To re-calibrate to better fit you, please visit the options menu and choose 'Calibrate Arm Length' at the top. Next week we'll be releasing an update which detects if you haven't touched either orb in 10 seconds and asking if you'd prefer to re-calibrate arm length automatically. This will only occur once per session, but should help for those running into any challenges. If you're seeing the guardian appear there may be another issue. The center point of a session will always be your feet on clicking both controllers at a session start. If you are walking to the edge of guardian at session, you will not be able to move outside of your guardian space. If you are starting in the center of your space and still see the guardian walls in a session, then it might be best to change your settings from Room Scale to Seated. Hope this helps a bit and wishing you happy adventures ahead in Guided Tai Chi!", "javajohnvrSep 2, 2019 at 11:37 AM\nNeed good depth perception\n\nI have poor depth perception similar to if I could see out of only one eye. This title really is unplayable for anyone like me. I could not get past the training mode. It would be nice if the game had a mode that reduced the dependence on keen depth perception.\n\nHelpful | 3\nDeveloper ResponseSep 3, 2019 at 9:31 AM\n\nThank you for your note! One of our team members also has limited vision in one eye, with inability to perceive 3D fully. They find slowly moving their head or body can help clarify pathing for them, especially when overlapping. If you have any ideas on how we could improve this though, we're all ears! Please email at gtc@cubicleninjas.com. Thanks!", "chef.tonileeOct 11 at 4:36 PM\nNeeds work\n\nThe experience leaves a lot to be desired. If you are looking for an introduction to Tai Chi, this isnt it.\n\nHelpful | 2", "Mr_ShadesJul 27, 2019 at 4:43 PM\nA Worthy Purchase\n\nI'm beginning to learn Tai Chi and this is an awesome supplemental program. The hand movements are easy to follow and while the foot positions can be somewhat more difficult to track, they are indicated three different ways (overhead, on the floor, and the ghost guides). There is, however, one thing lacking.\n\nPlease include basic tutorial elements for both breathing and posture as I currently have little to no idea how (or what) to adjust when the guide starts talking about them. That would make Guided Tai Chi just about perfect, I think.\n\nAll in all, it's an excellent program. I wish there were more available apps like this for disciplines such as dance and martial arts.\n\nHelpful | 7\nDeveloper ResponseAug 7, 2019 at 9:56 AM\n\nThank you for your kind feedback!  Good news: we are working on an update to the tutorial which include an addition about breath and posture, though it may not hit the next release. Our next update will also include multiple new environments, new mode options, and a bunch of options to better enhance your experience. Your feedback is very much appreciated to build the best app we can. Thank you and happy continued adventures in Tai Chi!", "frank.steinbachSep 23, 2019 at 9:49 PM\nNot real\n\nLearned Tai-Chi wenn I was living in China. There was a lot more turning and the poses and steps made sense. Maybe this should be called chi gong...\n\nHelpful | 3\nDeveloper ResponseOct 10 at 12:32 PM\n\nThank you for your thoughts! We will be supporting Chi Gong and other movement arts with time, but for today were aiming to make Tai Chi a bit more within reach for the current constraints of common play spaces. In our user tests, we found that multiple steps forward can be challenging within current VR because of play space restrictions, which are often under 6 x 6. We will be adding in the traditional Tai Chi 24 form with time, but this will require a space much larger than what we see in most users homes. Additionally, in our feedback sessions, turning really confused beginning users as they were disoriented quite quickly. Weve developed this around a single forward focus to help prevent this confusion. Our hope was to take Tai Chi forms and movements and reinterpret them for the average play space. We appreciate your thoughts and please know that weve weighed these decisions heavily to find the balance that made the most happy!", "betterworldmuseumAug 9, 2019 at 7:03 PM\nTriggers\n\nHi! Just finished my first guided meditation. I like it a lot!! However, Im using this app to help me with various forms of healing. Im a survivor of gun violence and wish the word Trigger wasnt used in a healing meditation app. Controller button or button, leaver, finger pad, index button, squeeze finger control, power activator, activator, actualizer all less triggering words that may be considered. Mindful practice and healing arts language can help VR industry and world be a better place. Thanks for thinking more on this. I personally teach drawing in VR. When I do the right controller is the Hand of All-Power and the left supporting controller is the Hand of Infinite Options .. perhaps you can see how much more empowering this is than squeeze the trigger.. Thank you!\n\nHelpful | 0\nDeveloper ResponseAug 23, 2019 at 1:16 PM\n\nThank you for your kind feedback! We're exploring ways to modify this language and appreciate you sharing your perspective. Wishing many fun adventures ahead in Guided Tai Chi!", "robvanhooseAug 24, 2019 at 8:14 AM\nNearly perfect and a must have!\n\nUpdate:\nThanks to the developers for their thoughtful response. It now makes sense to me why it is what it is, and given the strengths and limitations of the platform right now I think this is an excellent app. I recommend it constantly and use it almost every day. I like the addition of the world tour but still wish there was a way to do 10-15 at a time. From 5 mins to 60 is quite a jump. I have a Taichi workout set up on my watch and I use that to track my time. I start almost every day now with this and I feel better extension and coordination. Love it! Maybe 15 minute groups? Would help since some of the routines are left heavy and some right. Maybe some groups could bring even balance. :)\n\nOriginal review: I love this but was disappointed it doesnt include traditional Tai Chi forms. The developer response was great and I understand their choice now.\n\nHelpful | 5\nDeveloper ResponseAug 27, 2019 at 11:40 AM\n\nThank you so much! Great idea on mid-range length sessions! We'll be launching 15-minute and 30-minute sessions in World Tour in our next update. This new update will also include a few additional environments to explore and feature enhancements. Wishing you lovely adventures ahead in Guided Tai Chi!", "scintillaaJul 11, 2019 at 10:38 AM\nA good experience. Can be improved\n\nSo I waited about a month before writing a review of this app. Overall, its a great introduction to tai chi, but theres a lot of room for improvement. For one thing, the semi transparent dudes showing you how to hold your hands-you cant actually see what the front guy is hands are doing when the start the movement, because its blocked by his body. You have to look to the side, taking your attention off of those little dots that show you where to move your hands. Also, theres no real guidance with the feet.\n\nThere are about 20 different sessions to go through , each about 5 minutes long- I sort of wish there were levels...You knowquick refresh 5 mins, 10 and 15 minutes if you have more time and a 30 minute session If you actually know what youre doing.\n\nI wish there were more game like elementsthings you could unlock, levels easy, normal, hard and a way to manipulate your teachers: change the gender, or switch the front guy into mirror mode, so you can more accurately mirror his movementsand see the way his hands move...and sort of wish they too were gripping controllers, because Im not sure how to adjust my hands for that.\n\nBut overall, this is a great game. Very relaxing. Im a tai chi newbie and i play this at least once a day.\n\nUpdate 7/11/19: the developers did a great job responding to feedback (not just mine, as the last update was scheduled mere days after, but the update included a lot of new features. They added a bunch of new routines and a guide for the feet, both below and in front of you. They also added a 60 minute workout, which Ive started, but so far havent made it more than 15 minutes. I still cant see the hand positions of the guy in front of me, but the app is much improved.\n\nHelpful | 6\nDeveloper ResponseJul 11, 2019 at 11:08 AM\n\nThank you for the kind update to your review! We'll be launching a 30-minute version of the World Tour in the coming days based on your ideas. We're also working on your (very helpful) ideas on teacher options for a future update as well. Many thanks!", "maxyman771Oct 18 at 2:39 PM\n\nAwesome\n\nHelpful | 0", "HanappiJun 12, 2019 at 10:01 AM\nVery good but still room for improvement\n\nMost things already said by other users. First of all i would appreciate a german translation. And more scenes would also be nice. I have also guided mediation, but i like tai chi much more, so i hope there will come much new content for this experience. Maybe you make it possible to use all scenes from guided mediation, but mediation is only for rift, and thai chi only for th quest at the moment.\n\nIf the new content is good and useful, i dont even mind to pay as dlc.\n\nHelpful | 4\nDeveloper ResponseJun 12, 2019 at 12:55 PM\n\nThank you Hanappi for your ideas and feedback! Our upcoming release this month will double the number of sessions, add unique new environments, and debut a fun new mode. We're very grateful to nice people like you in sharing their feedback, so we can make the app the best it can be. Thank you and happy adventures ahead in Guided Tai Chi!", "leppermessiahJul 30, 2019 at 10:46 AM\nBeautiful execution on the concept, but\n\nThe guided meditation included does not talk you through the movements, and this is sorely lacking. I would prefer to be hearing the names of the different movements called out as well as instruction on using proper form and technique.\n\nMost newcomers will not \"learn\" how to perform Tai Chi on their own, but it is an accessible way to \"do\" Tai Chi on their own.\n\nHelpful | 1\nDeveloper ResponseAug 7, 2019 at 9:30 AM\n\nThank you for your feedback! One of our original ideas was to discuss each move's name, alongside 3D visuals to help players remember them better. In playtesting we found that people practicing Tai Chi for the first time found the audio to be confusing, especially for those looking to relax. They preferred more encouraging feedback on form, movement, breath, and balance. We are testing a traditional Tai Chi 24 form session mode, which would be for experts only. In this mode it may make much more sense to narrate the moves, so we appreciate this helpful guidance. Many thanks!", "datawitchJul 8, 2019 at 4:08 PM\nGood, but my arms aren't long enough\n\nI am enjoying the product, but the circles that I am supposed to keep the controllers in seem to be setup for someone with MUCH longer arms. Is there a setting that I am missing? I tried to find a support link, but the only place to get help seems to be in the review section.\n\nHelpful | 0\nDeveloper ResponseJul 10, 2019 at 8:04 AM\n\nThank you for your helpful feedback! At the main menu there is an Options menu, with the ability to Calibrate Arm Length at the top. This will replace the default arm scale values based on height and use your specific lengths. We will be bringing the options menu to the pause menu in the next update. Also, great point on the support link! We'll update our description so this links out to our team page/email so we can provide better guidance. Many thanks!", "mrfluke1Jul 15, 2019 at 8:49 PM\nOne of the main reasons i bought a Quest\n\n(1st, Thank you ALL SO sincerely much for your work on this amazing app)\n\nI'm a firm believer in the power of VR for fitness, and as a learning tool, so upon looking through the apps and to see that there was an app that teaches some of the fundamentals of Tai Chi, i was excited and it was what ultimately pushed me over into buying an Oculus Quest.\n\nAnd after a week, i must say that this app is fascinating. it takes a bit of getting used to, and you WILL feel a muscle strain in places you didn't think you would as your body adjusts to stretches it generally never makes, but once you really get into the \"flow\" of it all, you really do kind of just \"move\" and well, \"flow\", and i really left each session feeling more at ease (a couple of days i actually dived right back in for another session as it just felt good) and ive been meditating for over 3 years now, so id like to think the at ease i felt was genuine ;).\n\nI actually got way into each session to the point that i actually now put my hand through the \"rings\" on the controllers and grab them like if they were gloves (tough to describe in text) so that i can more accurately replicate the palm movements like the teachers in the game. (it messes with tracking rarely, but it definitely to me, sells the zen aspect of it all more being able to move my palms like the guides)\n\nWhich brings me to a couple of humble suggestions for the developers, I think having the options for \"ghost hands\" would be great, or having that at least be a toggle option would be great, as there are times, that i have to break focus for a bit to look over at one of the guides to make sure i was positioning my palms in the right position during one of the forms, and I think something along the lines of having ghost hands on the track that you have to follow would help.\n\nand having the ability to calibrate arms in the options menu, or directly before the session begins would be great. (like immediately before you click the triggers to start),\n\nHelpful | 6\nDeveloper ResponseAug 7, 2019 at 8:56 AM\n\nAs creators this sort of email is why we do what we do. Thank you!  Love your suggestions on the ghost hands and recalibration before start. At the moment we do a recalibration when you click the triggers before a session, unless you set a manual arm length in the options. But we're playing with the idea of adding this arm length reset in the options as well so this can always be there if needed. Will continue exploring this. Our team has been working on a large August update, which will debut new locations, many options, and 15-minute and 30-minute World Tour modes. Happy continued adventures in Tai Chi!", "SEACMANMay 26, 2019 at 11:47 AM\n\nGreat game. I studied Tai Chi for a couple of years and it's great to be able to so some exercises in VR with this game. Great job! There are only two issues I have with the product. First, as mentioned in another review, some of the moves don't seem to be scaled properly. For me (5 ft 10in) they require either taking much larger steps or trying to stretch my arms forward farther than they reach, . Being able to override the default scaling to prevent that would be useful. Also, I wish there was an option to turn off the vibration of the controllers. The vibration really takes me out of the peaceful flow of the flow exercises and is unnecessary since there are also music and visual cues to let you know if you're on track with your hand positions. For now, I've found it more useful to simply put the controllers down and play without them once I start a flow session. This lets me focus on proper posture and following the ghost guides (which are awesome) without potentially injuring myself trying to reach beyond what is proper or having the vibration distract me from the exercise.\n\nHelpful | 13\nDeveloper ResponseMay 27, 2019 at 10:20 AM\n\nThank you for your kind words and amazing feedback! Good news! Our next update, launching in early June, will feature an option to turn off controller vibration and to refine path scaling based on height as well as arm length. Wishing you happy continued adventures in Guided Tai Chi!", "ItoEnJul 28, 2019 at 11:56 PM\n\nIt's an awesome app. I love the idea but the balls of light are so ridiculously far away that I have to step forward two steps to reach them. I just wish I could they'd stay within my guardian boundary.\n\nHelpful | 1\nDeveloper ResponseAug 7, 2019 at 8:59 AM\n\nThank you for your feedback! The sessions begin at your start point, so it may help to take a step back if you're close to the edge of the guardian boundary. If this isn't helping please email taichi@cubicleninjas.com and we can help resolve together. Many thanks!", "wookiebaitJun 20, 2019 at 9:52 AM\n\nOne of my favourite experiences on the Quest. Not only is it very relaxing but the presentation is of a very high standard. Doing a couple of 5 minute sessions at the end of the day is a great utilisation of the Quest that stands apart from other more intense games.\n\nHelpful | 4\nDeveloper ResponseJun 20, 2019 at 1:04 PM\n\nYour kind words really make our day. Thanks so much!", "GeeBee2Jun 13, 2019 at 12:54 PM\nMindful VR\n\nI returned this app originally. I made the mistake of thinking you started with the tutorial which is very unforgiving and soul destroying. I read some of the reviews today and realised the arcade option is where to start and then to the exercises. So I purchased it again and lost myself for an hour, amazing. Quick tip, when you finish the exercises don't leave straight away, turn around and look at the beautiful scenery. Great app for relaxing and leaving the rat race for a while.\n\nHelpful | 4\nDeveloper ResponseJun 17, 2019 at 10:02 AM\n\nThis review made our day. Thanks for the kind words and ideas! Our next update will have a fun new mode, new sessions, new options, and even make the tutorial more forgiving. We're grateful for your feedback in making this app the best it can be!", "DickDastardlyJun 16, 2019 at 1:35 PM\n\nSome really nice environments and the Tai Chi stuff seems to work well. Distant scenery seems to be some kind of animated skybox but it looks really good (I thought the trailer might have been from a Rift version but it's from the Quest).\n\nWould be nice to have a mode where you could just view the different scenes without any UI (and with optional music), and switch between scenes using buttons on the Touch controllers.\n\nHelpful | 1\nDeveloper ResponseJun 17, 2019 at 10:00 AM\n\nGreat ideas! Building from the ground up for the Quest allowed us to really push the hardware in fun ways. We're glad you enjoyed the environments and Tai Chi sessions! There will be \"free mode\" in a future update where you can relax in the environments. Wishing fun adventures ahead in Guided Tai Chi!", "WenscaelJun 22, 2019 at 11:50 AM\nAwesome developers\n\nSo the game's obviously great, you can read about that in other reviews.\n\nBut I just wanted to say how awesome the devs are for not only actually reading through reviews and feedback, but replying to them so well and with great transparency on the development!\n\nThis game could've been a simple \"release and move on\", with a lot of people being just fine with that, but the devs are committed to refining the game!\n\nHelpful | 10\nDeveloper ResponseJul 3, 2019 at 3:52 PM\n\nThanks so much!  Our big update will be hitting any day now, increasing the amount of content by 5x. It also features our favorite new levels and modes yet. We hope you enjoy!", "mirrorman22Jul 24, 2019 at 1:02 PM\nGreat for anxiety\n\nVery nice app. If you have anxiety issues, the concentration, breathing and grounding suggested really helps alleviate it. Very good for mindfulness and focus.\n\nHelpful | 2\nDeveloper ResponseAug 7, 2019 at 8:57 AM\n\nThank you so much! We have two new environments debuting this month (Santorini and Dubai), alongside some fun new modes. Wishing you relaxing adventures ahead in Tai Chi!", "tmatteoJun 6, 2019 at 5:33 AM\nMore! More! More!\n\nI had a bit of trouble getting the hang of things in the beginning but in no time after a few sessions I was doing Tai Chi. It was like having an instructor in the room with me! I wish the developers would create a martial arts program with katas one could follow slowly. (The Tiger-Crane kata for instance.)\n\nHelpful | 5\nDeveloper ResponseJun 10, 2019 at 9:09 AM\n\nThank you for the kind words and feedback! We have a massive update hitting this month which will add new environments, new sessions, and even a very fun new mode. Love the idea of the martial arts program! While we're focusing now on the meditative side of Tai Chi, we'd love to explore the other aspect if we can. We very much appreciate the helpful ideas!", "R1PFakeMay 26, 2019 at 11:47 AM\n\nThe game is relaxing and beautiful.\nBut im not sure if im doing the flows \"correctly\". I know that you have to follow the path/balls with your controller, but I don't understand how the rest of my body should be moved with the flow, for example should my feet stay in the center or should they also be moved? Should my head look forward or at the balls?\n\nThe tutorial explains the controller movement, maybe you can make a additional tutorial which explains the body movement?\n\nI would also like a option to disable the controller \"rumble\" while the path is correct and only \"rumble\" when im missing the path, or is that already possible and I missed it?\n\nHelpful | 7\nDeveloper ResponseMay 27, 2019 at 11:36 AM\n\nThank you for the helpful feedback! Our next update will include an option to disable rumble completely, but inverting the rumble is a very clever idea! We'll test on our end to see how this feels, but I'm hopeful to add this feature in. Regarding body position, in Flow mode we've added in avatars which might help indicate body and head position. But you bring up a great point: this isn't addressed in the tutorial and it is an important question. We'll find a way to integrate this within our next update hitting next month. Thank you so much for the kind words and actionable feedback, and wishing you happy continued adventures in Guided Tai Chi!", "OducayenMay 26, 2019 at 8:33 PM\nNeeds refining\n\nThere isn't anything else like this in the app store. However, I really wish this app had more features like: a training dojo to learn and master new moves. a progression from beginner to master for each section. The lady speaking needs more focused lines for each section. Highlight the ghosts leg that is going to step forward before it moves and an arrow to show the direction. Better or customizable placement and direction of the ghosts. An option menu to turn on and off features an set height. Breathing training that times/learns your inhalations and exhalations and will customize sections speed/flow accordingly... And why not throw in some yoga poses to learn as well. Not worth 10$ in it's current state. I will update to 5 stars when anything significant gets updated or added. Wishing this developer the best as they have something close to unique, calming and useful for VR.\n\nHelpful | 8\nDeveloper ResponseMay 27, 2019 at 11:39 AM\n\nThank you for your feedback, Oducayen! When we started the seed of Guided Tai Chi three years ago, we'd envisioned something very close to what you shared. But when we tested these prototypes with players new to Tai Chi...they simply hated it. They left confused and frustrated, lost in UI and options. It was a challenging few weeks in our studio as we realized that Tai Chi in virtual reality needed to be something very different than what you might find in a traditional setting. Our mission then became to begin by making Tai Chi joyful and instant for everyone. In a minute you can mirror a master, seeing why Tai Chi is loved by over 250 million people worldwide. Your feedback is very appreciated and we hope our future updates help make this an even more useful tool in your daily life!", "DungeonquestJul 14, 2019 at 1:37 PM\nVery good\n\nI am totally new to tai chi, but not to some meditation techniques... I am surprised how relaxing the experience is. Keep up the good work.\nWill there be Guided yoga or guided kung-fu in the future?\n\nHelpful | 3\nDeveloper ResponseAug 7, 2019 at 8:51 AM\n\nThanks so much for the kind words! Guided Yoga is a really cool idea.", "twistednipsJun 16, 2019 at 10:10 PM\nGreat idea, average execution\n\nI was hoping to have a more serious guided tai chi experience, one that teaches you the individual forms and offers at least the 24-posture Simplified Form of t'ai chi ch'uan, and some longer sessions (up to 60mins).\n\nExpect a more 'arcade' experience with sessions lasting up to 5 minutes and the experience leaves you none-the-wiser about what you just did. I also experienced that I had to extend my arms much further out than the silhouette and what I was physically capable of, and I'm a tall guy. The constant rumbling of the controllers also drains their battery.\n\nHelpful | 1\nDeveloper ResponseJun 17, 2019 at 9:57 AM\n\nThanks for your ideas! Our next update will have a new mode which allow up to 60-minute sessions and options around controller vibration, as well as arm length, to adjust to your preference. When testing we found that the 24-posture was a challenge for most users because it required a very large play space, much more than they had available. This pushed us to explore how to remap Tai Chi within the boundaries of a common living room sizing. Happy adventures in Tai Chi!", "Its_SpinMay 31, 2019 at 11:18 PM\nRelaxing\n\nThe fact that you responded to each review has made me smile. Awesome job devs, very beautiful game. I haven't tried it for very long but I can definitely tell this will be a relaxing experience. Will be a nice change from playing beat saber constantly.\n\nHelpful | 6\nDeveloper ResponseJun 4, 2019 at 9:24 AM\n\nThank you so much!", "Beatr1xMay 25, 2019 at 3:13 PM\nI really like this.\n\nThis is the first thing I bought for the Quest and I'm not disappointed. It works great for me and the surroundings are beautiful. As a complete beginner, I make lots of mistakes and have a pitifully low score but I intend to keep it up and get a lot better at it. I find that I focus so much on keeping my controllers in the circle that I'm not really learning the forms very well. I hope that gets better with practice.\n\nHelpful | 4\nDeveloper ResponseMay 27, 2019 at 11:40 AM\n\nThank you so much! We're honored to be your first Quest experience. Wishing you happy continued adventures in Guided Tai Chi!", "NiolKJul 7, 2019 at 6:44 AM\nNOT for stationary. Roomscale ONLY.\n\nDon't bother unless you can do room scale VR. Wanted to like this but I have limited space and the in game guides were constantly directing me to extend my arms out past the guardian walls.\n\nHelpful | 3\nDeveloper ResponseJul 8, 2019 at 8:51 AM\n\nHello! We worked really hard to ensure that Guided Tai Chi worked as best as possible in stationary mode. All 200 sessions have a special stationary version, which won't lean forward and shortens the arm length. To see these you need to have stationary mode activated before you launch the app. But we'd love your feedback to make it better! Can you email us at taichi@cubicleninjas.com and we can learn more about your vision. We'd love to improve this so it can be most useful for your space!", "Neo.Ultraman.8Jun 11, 2019 at 6:39 PM\n\nAm adding this to my meditation routines. Calming after a stressful day or being beat down by beat saber. 5 stars when I include the mods you said are coming (thanks for those). However, it is difficult to have mindfulness because I look right and in front to follow the ghost masters. If he was at 45 I could see him peripherally and be able to follow him and stay mindful. Also, be great if there was an auto setting to play an exercise multiple times without leaving the environment...sometimes it takes 5 minutes just to push out life. Oh...I hold/hang the controllers on my fingers by the hoops. Eliminates vibration and helps with correct hand position. Thanks!\n\nHelpful | 5\nDeveloper ResponseJun 12, 2019 at 12:59 PM\n\nYour kind review made our team's week. Thank you!  Great ideas on teacher position adjustment and repeated sessions. Both have been added to our future roadmap, with teacher position likely living in the upcoming options menu. Thank you so much and happy adventures in Guided Tai Chi!", "javier.a.villalobosJun 18, 2019 at 4:58 AM\nUnfinished application.\n\nGood graphics but doesn't make any justice to Tai Chi discipline. All movements sequences are the same. Only changing backgrounds and music doesn't make it. You are better off mimicking a real Tai Class VR video. Refunding.\n\nHelpful | 4\nDeveloper ResponseAug 7, 2019 at 9:57 AM\n\nThank you for your feedback! There are 200 sessions, each is 100% unique. These utilize over 30 moves based on the Yang 48 Style Form. We encourage anyone who is exploring Tai Chi to see what works best for them though! Ultimately VR may not be an ideal fit for your preferred practice.", "doug_wareJul 6, 2019 at 8:40 AM\nGreat! Now with feet\n\nThe recent update is excellent. I use this app every day. It's great for balance and stretching and is a fantastic cool down after hard exercise like a long Box VR class.\n\nHelpful | 3\nDeveloper ResponseJul 8, 2019 at 8:47 AM\n\nThanks so much!", "Swainer16May 27, 2019 at 9:55 AM\nEffective and Fun\n\nFirst, I would say that the game is very well presented and the movements and actions well mirrored. I felt that I was being coached and guided and loved the ghost participants for extra visual support. I am loving this experience. Second, I always support developers who have the respect for their customers to reply thoughtfully to review comments. Very impressed. Thank you.\n\nHelpful | 10\nDeveloper ResponseMay 27, 2019 at 11:55 AM\n\nThis kind note made our team's day. Thank you for your amazing feedback and warm words!", "simon.dorfmanJun 5, 2019 at 11:39 AM\nLike it. Idea: add footprints.\n\nI like it so far. Idea for the developers: add footprints on ground to help me make sure Im standing in the right position.\n\nHelpful | 8\nDeveloper ResponseJun 10, 2019 at 9:13 AM\n\nGreat idea! I'm happy to share that footprints are coming in the next update!  Thank you and happy adventures in Tai Chi!", "theresa.granJul 27, 2019 at 8:35 PM\nIt wont work\n\nI have tried the game a few times and all I get is a black screen. Nothing loads. Any suggestions would be appreciate\n\nHelpful | 0\nDeveloper ResponseAug 7, 2019 at 9:20 AM\n\nThank you for reaching out! We're very sorry to hear about these issues. If you see a black screen Guided Tai Chi has not fully launched yet. We'd recommend contacting Oculus support, as this behavior isn't expected. Happy to help if we can on our side at taichi@cubicleninjas.com!", "AnalisaSATXMay 23, 2019 at 2:08 PM\nGorgeous app!!!\n\nWonderful! The scenery is gorgeous. While I appreciate the yin yang representation for the black and white buttons & trails, I think it would help if the buttons & trails were colors which are able to show shading for whether you are moving your hands in closer to you (lighter) or away from you (darker). Maybe its just me, but the current graphics make it difficult to tell (will increase rating to 5 stars when fixed). I found the tutorial extremely frustrating, but the 3-minute arcade section was more relaxing, which is what I came here for. Im finding it easier to learn the flow of the movements using the arcade mode over the tutorial, as the arcade mode does not break the flow and force you to start over if your performance is less than perfect, but encourages you by having music sync when your movements sync. I nearly had this refunded until I tried the much more user friendly arcade mode. Id recommend the dev work on the tutorial, or perhaps make it clear that the tutorial is for perfecting your moves, and not required for the game play...Overall a FANTASTIC app for VR!\n\nHelpful | 5\nDeveloper ResponseMay 23, 2019 at 3:07 PM\n\nThank you so much for the kind words and great ideas! Depth based shading is a VERY cool thought! We'll explore on our end to see how this might feel, as well as clarify that the tutorial is 100% optional. Thanks again and wishing you fun adventures ahead in Tai Chi!", "fyre7May 22, 2019 at 5:14 AM\nLove it\n\nWell done boys - just love this experience. Good to see such a great early start on the calmer side of life\n\nHelpful | 27\nDeveloper ResponseMay 23, 2019 at 3:22 PM\n\nThank you beyond words and we can't wait to share new sessions and calming new environments launching (for 100%) free next month. You are appreciated!", "JamesdarkwoodMay 30, 2019 at 4:43 AM\n\nI've meditated for 5 years now and this app is great, been wanting to learn how to do moving meditation i don't know the right term but yeah ive only used it for 5 minutes but and that's all I need to say this is great! Differently recommend this to can you one looking to do moving meditation\n\nHelpful | 4\nDeveloper ResponseMay 30, 2019 at 10:22 AM\n\nYour kind note makes our day! Thank you so much and we can't wait to share a massive update next month with new environments, sessions, and a very fun feature debut. Take care!", "HereMay 29, 2019 at 11:44 AM\nFinally can do Tai Chi\n\nI've been wanting to try Tai Chi for ages. This makes it simple, fun and convinient. I'm using it every evening. Thank you for this experience.\n\nHelpful | 5\nDeveloper ResponseMay 30, 2019 at 10:12 AM\n\nKudos to you for trying something new and rocking at it. Wishing you many adventures ahead in Guided Tai Chi!", "happy.astridJul 1, 2019 at 3:41 PM\nNo\n\nI did not like this game. If I knew how to refund for a different game I would. It is just not for me.\n\nHelpful | 0\nDeveloper ResponseJul 2, 2019 at 4:44 PM\n\nNo worries! Here's a quick link to the steps to request a refund with Oculus. https://support.oculus.com/964479930393572/", "MockingbirdWizardJun 5, 2019 at 7:34 PM\nGreat idea\n\nAny chance you can make a wing Chung version? \n\nHelpful | 8", "ohpumpkinspiceJun 8, 2019 at 12:24 PM\nThis app with Mamut grips\n\nIts great! Ive been using it for 10-20 minutes and its been really positive. Using the mamut grips lets you release your hold on the controller so its a lot more effective.\n\nHelpful | 3\nDeveloper ResponseJun 10, 2019 at 9:21 AM\n\nThank you for the kind review! Also, Mamut Grips look like a great accessory for Guided Tai Chi. We've ordered a pair and are excited to try them out. Thanks!", "vrkmarshallMay 23, 2019 at 7:57 AM\nGreat!\n\nAtmospheric and calm, while challenging your attention to follow with both hands doing different things at once!\n\nHelpful | 15\nDeveloper ResponseMay 23, 2019 at 3:18 PM\n\nThank you so much and wishing you happy continued adventures in Guided Tai Chi!", "criticalDJun 3, 2019 at 6:49 AM\nFantastic\n\nI wasn't expecting this much quality for the price.\nReally relaxing and tranquil.\nI can't wait to add a session a day to my schedule for better peace of mind.\n\nHelpful | 3\nDeveloper ResponseJun 4, 2019 at 9:24 AM\n\nWe appreciate you beyond words. Thank you and happy adventures in Tai Chi!", "carstenbMay 30, 2019 at 4:56 AM\nHow to move legs?\n\nAs far as I can see the game only tracks my hands and not my legs. So how do I move them?\n\nHelpful | 2\nDeveloper ResponseMay 30, 2019 at 10:09 AM\n\nThe Quest is only capable of tracking head and hand position, so be sure to mirror the leg and foot position of your ghostly teachers in Flow mode. To do this, you can simply move your body! Happy to help with any questions at guidedtaichi@cubicleninjas.com. Thanks!", "SoapySonJun 9, 2019 at 12:24 PM\nGreat\n\nAwesome title, a fun idea well executed with beautiful levels, nice tunes, a good selection to mix it up. Meditational\n\nHelpful | 3\nDeveloper ResponseJun 10, 2019 at 9:05 AM\n\nThanks so much!  Wishing you fun adventures ahead in Guided Tai Chi.", "goldo72May 24, 2019 at 8:28 PM\nNot working\n\nI was really looking forward to this, but it's not working at all. I first get the three dots for va few second, showing that it's loading, then nothing. It turns to black, looks as if I'm looking at the back of the Quest \"glasses\" and nothing.\n\nHelpful | 6\nDeveloper ResponseMay 25, 2019 at 8:26 AM\n\nHi Goldo72! We'd recommend contacting Oculus support to help troubleshoot, as this sounds possibly hardware related. Hoping you have a chance to experience Guided Tai Chi soon!", "darceyderosaJun 4, 2019 at 4:12 AM\nI don't like this game\n\nI tried to like this ga nbn e, but I can't even play it. How do you relax when a game keeps messing with your mind?\n\nHelpful | 3\nDeveloper ResponseJun 10, 2019 at 1:46 PM\n\nWe're sorry to hear this, Darcey! Our team has worked really hard to make Tai Chi easy to enjoy as possible. We hope you keep at it and are able to relax in VR with Guided Tai Chi soon!", "ASchweigsMay 24, 2019 at 6:23 PM\nStunning!\n\nIve always been interested in trying Tai Chi, but never had the guts to sign up for a class. This app gave me the opportunity Ive been waiting for...and more!!! I found myself transported to beautiful environments. I think I just stood there for a while, taking it all in. Immediately I felt my stress ease away and a sense of calm and serenity over-take me. This was all before even attempting the movements!!\n\nOnce I actually began playing and got the hang of it, I truly started to feel more in tune. It was so grounding. Challenging too, which I loved. I look forward to making this app a more regular practice in my life.\n\nHelpful | 7\nDeveloper ResponseMay 25, 2019 at 9:14 AM\n\nThanks so much!", "DrkittenJun 18, 2019 at 8:06 PM\nBeautiful & calming\n\nPerfect for relaxing after an expert beat saber level or boxvr workout!\n\nHelpful | 4\nDeveloper ResponseJun 20, 2019 at 12:59 PM\n\nThank you for the kind words!", "SikhnDestroyMay 24, 2019 at 10:00 AM\nBeats Expectations\n\nGraphics are crazy beautiful! Training is much more challenging and then expected in a fun way though. The relax mode is where I see spending my time but in arcade. Definitely a game I'll be showing my family!!\n\nHelpful | 12\nDeveloper ResponseMay 25, 2019 at 9:23 AM\n\nThank you for your kind words and helpful feedback. You are appreciated!"]