{"App Title": "Guns'n'Stories: Bulletproof VR", "App description": "GunsnStories: Bulletproof is a dynamic VR western shooter that fully immerses players into the ambiance of weird Wild West.\n\nStepping the tangled storyline, you will encounter many intimidating but comical enemies and fight Big Bosses.\n\nYou will have to shoot aptly and a lot using both hands as well as to use various covers and move actively, avoiding bullets of enemies.\n\nYou will visit many beautiful locations and will be able to try a big arsenal of weapons under the rhythm of the heavy music, jokes, and cynical humor!\n\nUnforgettably vivid cocktail from emotions, in which weve added everything to make a player fall out of reality for a while to receive exactly these bright and fresh emotions weve only experienced when were kids.\n\nMaximally comfortable and user-friendly. You will never feel sick or discomfort during the game. However, you will need a good physical shape to play on the high level of complexity.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Shooter", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Russian, Spanish (Spain)", "Version": "1.0\n(LIVE)", "Developer": "MiroWin", "Publisher": "MiroWin", "Website": "http://mirowin.com/guns-n-stories/en/", "Release Date": "April 2, 2020", "Developer Privacy Policy": "None", "Space Required": "1,017.2 MB"}



["5 stars\n47%\n4 stars\n22%\n3 stars\n13%\n2 stars\n8%\n1 star\n11%", "BMAN4561Jun 21 at 11:23 AM\nAwesome Experience\n\nMy absolute favorite VR game for quick, mindless fun. Not sure why people are leaving negative reviews. This game owns over the top weapons, non-stop action, and quick fun. You either love these types of games or you don't - I love them and this is the best one out there for that.\n\nHelpful | 30", "CycloneVrgamingJul 17 at 6:05 AM\nIts great but...\n\nThe last few levels seem very stupid but the rest of the game was amazing!!! Great game when people are around especially the arcade game mode the game is basic but still fun as you unlock new guns along the way !\n\nHelpful | 2", "StefNMattJun 16 at 10:38 PM\nAs a Dad having fun and playing games\n\nYeah I'm not your typical \"gamer\" but we this kind of tech and gaming from the quest it's a lot of bang for your buck and it's fun the storyline is what it is an old grandfather telling some stories.. it's great! Great play great game... But again I'm not a Gamer \"gamer\" just someone enjoying the Oculus quest.\n\nHelpful | 8", "Ender_BlackthorneJun 3 at 2:36 PM\nI Still Like It!\n\nIt is an older game, but it is quite charming. I played the heck out of it in PCVR and I was happy to see Bulletproof appear on Quest. It is a fun game.\n\nThe gameplay is rather basic but very solid. The various guns are a lot of fun to use. The story is very good and it draws me in. I never found the PCVR version of Bulletproof to be graphically impressive, but by Quest standards I think the game looks really good.\n\nIt is basically a wave shooter. As you play thru the various levels the Old Man responsible for the deeds tells the story of things as they unfold.\n\nI like the gameplay. Sometimes it is necessary to duck behind barrels or use a wall for cover to fight effectively. There are enough enemy types to keep me on my toes.....and they all look cool in a charming toybox sorta way. Bulletproof offers a fair challenge....tho I personally do not find the game overly difficult I also don't get bored.\n\nI find the whole experience to be very satisfying and I was happy to pay $10 to play it again out on the back deck without wires.\n\nHelpful | 11", "DAX_QcApr 2 at 10:37 AM\nOh boy...2020. 3 stars bc price.\n\nI get its a port and I should not judge this game with 2020 standard but I must. *sigh* When will we stop having ports like this?\n\nI guess at the price its okay even fun if you are drunk and bored but dang this game is basic.\n\nDont expect much more than 1990s arcade gun in 'vr'.\n\nFor 2020 this port rate on my scale at 1* not worth it but yah.. at 10$ for Quest port i guess ...3* is ok.\n\nHelpful | 213", "IMDEAD1234Jul 13 at 6:27 AM\nGreat game but .......\n\nSo its a very fun first person shooter with waves of enemies and cool stories but after you finish the game there is not really much to do but its still worth 10 dollars\n\nHelpful | 0", "bruno.gasliniJun 9 at 6:14 AM\nExpensive!\n\n 9,90 for this game are really too much. Basically is a good shooter program, but what a delusion! Only 8 level reached in few hours! On top of this even if you play at the most difficult level it will last max 3 days. As per my opinion there is one thing missed: the \"General\" health status. We know the %, but we do not know where we really are.\n\nHelpful | 4", "ChlasmaJun 21 at 2:53 PM\nSuper cool!\n\nI feel like most reviews dont give this title justice. Its a blast especially for that price!!! I totally would recommend it if you love just sooting the hell out of it. Nice enviroment changes and super cool selection of guns. I would just LOVE to play it together with my GF so pleeeeeease add multiplayer. I would pay easily again for a story coop DLC!!!\nThanks and cheers :)\n\nHelpful | 2", "JimZMJun 30 at 11:07 PM\nhectic shooting, fun weapons\n\nYou have unlimited ammo. Your trigger fingers get tired easily. I prefer more tactical shooting. The narration is interesting. I love eating the popcorn. The popcorn is 5 stars.\n\nHelpful | 0", "Midlife_Game-istApr 7 at 4:23 AM\nGuns n Stories - humorous wave shooter\n\nA wave shooter that doesnt take itself seriously, in fact takes the micky out of itself for most of the time you are playing it.\n\nGuns n Stories is a port over from PC and PSVR, so far it does not appear to have lost any of the graphical quality on other headsets. This is a cartoon style western story based shooter, that will have you smiling all the way through it.\n\nEach of the Acts has 3 stages ending in a boss battle, the story is told by a grandfather to his grandson, fabricating the story to impress him. Each location is nicely drawn, very colourful and will keep you on your toes as enemies can come at you from either side as well as in front of you. The enemies are all nicely animated, mostly repeated through each act, adding newer ones as you progress through the game, from simple thugs with metal bars to huge thugs with rocket launches and mechanical drones. Drones..... in a western setting? I did say earlier that this game doesnt take itself seriously. It feels a little steampunk in its style.\n\nYour weapons also range from your simple six shooter pistols to rocket launchers, tasers and machine gun style fast shooting guns, all are nicely designed and for the most part aim perfectly, on the odd occasion I did feel as if my shots werent doing any damage.\n\nI have been playing on the normal level setting and at first you feel invincible, but quickly you find yourself turning, ducking and working out which enemy to shoot first and by act 2 I definitely felt the difficulty ramped up to make more of a challenge.\n\nThis game is perfectly priced and puts a grin on your face as Grandpa narrates all the way through with his funny one liners and quips\n\nHelpful | 14", "ExcessPanacheApr 2 at 12:01 PM\nCrazily Basic\n\nThis might be worth a quarter of the current asking price (e.g. something akin to the price of a mid-range smartphone app) if you have played literally everything else on Quest to death, but otherwise this is impossible to recommend.\n\nThe weapons have no sense of weight and give you no feedback, which in combination with the lack of reloading, means that you may as well be hosing down stationary targets with an underpowered jet of warm water.\n\nIts insanely basic and simplistic even when compared to the numerous other Horde-style VR shooters. Its also simply not very fun to play.\n\nThe fact that Crisis VRGade cant get accepted onto the Oculus store and this can is a loopy situation. Pick this one up ONLY if youre extremely desperate for something to play.\n\nHelpful | 96", "TwitchyTwistJul 16 at 10:50 PM\nFun game\n\nFun game. I did pick it up for almost nothing. No reloads, lots of things to kill, funny story and fun characters. I think its a really fun game.\n\nHelpful | 0", "MichaelSanFranciscoApr 27 at 1:22 AM\nCome on guys, this is totally worth $10!\n\nI read some of the bad reviews, that's fine I hope on discovering its lack of appeal you were quick on the draw to get a refund. If you were flat footed on the refund draw, well then no wonder you were unhappy with the game.\n\nMe? I grew up in the quarter arcades. I would prefer to pump quarters into a machine rather than save my money to eat that night. So when I saw this game pop up I read the negative reviews and thought well that's exactly why I will like this game. And when I logged on you did not disappoint.\n\nI was amused by the corny plot, as told throughout the game. The variety of Weaponry was a hoot. I liked taking on progressively badder bad guys, while the Devs provided me with progressively bad a$$ weapons with which to take them on.\n\nYeah, the harmless dialogue is as corny as the overall plot, but this game is primarily designed for kids, and secondarily for adults like me who were once kids and like to relive those days.\n\nThis is a $10 game, and its a bargain at twice the price. Yes, so too were each Vader Immortal games, but I think we lucked out on Vader pricing. I suspect the series was priced at a loss. Admit it, we would have paid $30+ for each episode. I digress, forgive me.\n\nSo get this game. It's fast paced, easy to play, and will provide hours of moderately challenging entertaining fun.\n\nHelpful | 10", "AviboyApr 3 at 11:02 PM\nYou guys have just made my day!\n\nI used to play this on my quest via remote desktop but always had latency issues. I can't believe it's native now :) well done team!\n\nUPDATE: I was able to complete whole game in Epic mode on the first try. Developers: youve made it a bit too easy compared to pc version. PLEASE do something about this as this could really be something greater! \n\nHelpful | 27", "josephine.naicker.910 days ago\nCan't go to Next Act\n\nHi how do I go to Act 2, other than that, the game is enjoyable\n\nHelpful | 0", "NorasanApr 4 at 7:14 AM\nTombstone time...\n\nGreat title I've waited for since it was announced. Graphics and game play is simple but it draws y in and the Western setting makes a nice change. Good choice of levels and weapons and would be great for youngsters as not overly graphic. Definitely worth a shot for the price (sorry couldn't resist).\n\nHelpful | 5", "contentjayJun 5 at 9:03 AM\nFun Game\n\nI enjoyed the game and the story is fun. Wish the arcade was an actual arcade vs just the story. Fun to play though and not expensive.\n\nHelpful | 1", "TheHaminatorrApr 2 at 6:09 PM\nIf you liked Drop Dead - Try this\n\n*Im having a great time playing this, yes Drop Dead is better but also twice the price, for 15 dollars Australian i think it is worth the money.\nGive it a go! if you don't like it you can always get a refund but i think it's at a great price point.\nUpdate for Multiplayer in the future would make this game even better..\n\nHelpful | 15", "PENTAR0May 22 at 12:34 PM\nNot worth it\n\nI highly recommend to not buy this game.\nFirst of all, the gameplay is not as neat as in other shooting game. It's unprecise and doesn't give the sensation to hold a gun at all.\nThe levels are all the same and it's really too basic.\nNot even a classic 90's arcade game, no, it's a lazy game.\nI bought it during sales, so even if you can buy it for 5$ don't do this mistake.\n\nHelpful | 3", "AllisonDeereMay 23 at 7:29 AM\nIt's an alright wave shooter\n\nGuns&Stories is a port, I understand that, and its an alright wave shooter for VR at that. The pricing makes up for this though, 10$ for a 2-3hour wave shooter is fine <3\n\nHelpful | 2", "WheatbreadzApr 2 at 4:59 PM\nFun, but....\n\nNo multiplayer, definitely not what I was expecting. Funny story, good gameplay. My son and daughter will get a good kick out it which is good. But I was expecting a run around shooting pvp experience not really an arcade stand in one spot and shoot like drop dead. Still would rather drop dead dual strike. I'll complete the game but at this point it gets a 2 star because its worth only $5.\n\nHelpful | 13", "Emmett1057Apr 3 at 11:07 PM\nKind of a bummer\n\nI was excited about the arrival of this one because it looked clever and I like old west stories, even when theyre hokey.\n\nIts a shame because the gameplay is boring, the storyline is weak, and its extremely basic.\n\nWith that said, there were some funny lines and some of the guns are clever. The voice acting is pretty decent. It gets three stars because of those things and its pretty cheap.\n\nThere is zero replay value for me and I finished it in one sitting. Turns out even at $10, its too high.\n\nYou might like it if youre into silly, basic, arcade-style shooters. Maybe. If youre looking for any substance, save your money.\n\nHelpful | 4", "churchillis1Jun 25 at 6:54 PM\nGreat sense of humor\n\nAlthough the game is basic, it has many jokes that cracked me up. I recommend this as a beginner game.\n\nHelpful | 1", "nicolas.reynier.50Apr 10 at 11:32 PM\nFun game, amusing scenery, good graphics\n\nI'm going to temper the previous bad comments. Indeed, this game does not use all the VR functionalities, such as gun weight, recoil, etc. But nevertheless this game is a success. The fun for the money is good. Graphics are cool, the various guns are fun enough, the scenery is well done and amusing, and in the end it works for everyone.\nDevelopers, maybe you can use that as a plateform for updates and try to implement the feedback into the hands. No matter what, thanks and well done for this fun game.\n\nHelpful | 0", "RobDoyle8Apr 29 at 10:54 AM\nNot Great and Not Horrible\n\nThis game is average. It's kinda fun however gets boring after awhile. Seems like the exact same with a few different scenes and the odd gun update.\n\nGood pickup if you're looking for a basic shooter\n\nHelpful | 1", "CokeHeadApr 6 at 10:55 AM\nCould have been a great shooter game!\n\nPros:\nGreat story/ concept\nVisually decent game\nClever way of upgrading to new guns (Grandpa begins to embellish his stories)\n\nCons:\nExtremely over-hyped game\nGames needs a lot of refining\nBad voice acting\nGameplay mechanics feel very cheap & strange\nNo strategy at all\nNo Reload - No bullet count - No health bar?\nI dont think you can even die (unconfirmed)\n$10 US price point too high\n\nHelpful | 7", "VR_MartinApr 7 at 4:25 AM\nCowboy baby\n\nI got to review this on steam when it came out and I loved it,\nso now that it has been released on the Quest it's going to be even more fun .\nNo cables to restrict my movement ..\n\nhttps://youtu.be/ogXgokAVZ5AP\n\n\nCheck here for review\n\nMartin's VR Reviews\n\nHelpful | 2", "Harley-GJun 9 at 9:33 AM\nIts basic\n\nIt is a basic arcade game ,but my grandkids love it.They can have a shooting game that violent content is acceptable.\n\nHelpful | 0", "ANGERSNIPERApr 3 at 2:06 PM\nIm not feeling it\n\nIts.... Ok.\nOk graphics. Ok gameplay. Ok price.\nNo real satisfaction when you get a kill.\nNo real satisfaction when you clear a stage.\nNeeds refined.\n\nHelpful | 9", "AsgharAghaApr 7 at 10:09 PM\nFun for several hours\n\nIts a basic game but its fun for several hours. At $10 (less than a movie ticket) its worth being entertained for a while. Story is borderline funny/silly which goes well with game.\n\nHelpful | 2", "RWanderer68Apr 12 at 12:32 PM\nSimple..yeah!..FUN.. HELL YEAH!!\n\nSo yes it is simple . But a bargain at the price !\nSometimes simple is good and all you need to have a few hours of fun!\nDecent story ..with a few chuckles .\nGlad the guns stepped up a notch with some cool futuristic firing .\nWhile other reviewers didnt ,I found it to be A bit challenging after the first couple of levels.\nAll in all a bit of nostalgic fun for ten bucks . Well worth it!!\nPs.\nA\nNote to the devs great job .. keep them coming like this ..us old folks on the quest love nostalgia and btw\nI loved the popcorn trick .. I literally could almost taste it !!\n\nHelpful | 2", "geoffrey.milner.12Apr 4 at 8:49 AM\nSolid arcade fun\n\nIam not much cop at doing reviews but felt I had to try because of some of the low score reviews.for 7.99 this game is a absolute steal good fun shooter with a very funny story you get 3 acts split into 3 missions each act and arcade mode which is the same minus the cut scenes i can see myself coming back to this time and time again enjoyed very much bargain\n\nHelpful | 3", "preston.luberApr 27 at 8:28 AM\nHeight setting issues resolved\n\nThanks for getting back to me regarding the height setting issue I was having\n\nI reset the Guardian feature on the Quest. Apparently I did not have the floor setting completely down to the floor. Now all is well and I am once again enjoying the game. Thanks for getting back to me.\n\nHelpful | 1\nDeveloper ResponseApr 27 at 6:35 AM\n\nHello. Thank you for your choice. There are no settings for the game while sitting in the game. You can change the height in the settings of the HMD Quest itself", "TurboBoarApr 5 at 5:58 PM\n BEYOND RIDICULOUS!!! \n\nI was really hyped up about this game having seen the trailer. Appearances can be deceiving.\n\nYou're thrown into a thin storyline with animation boards that are much weaker than advertised.\n\nYou start the game and quickly find that little skill beyond pointing and pressing the trigger button as quickly and as much as you can, is required.\n\nEnemies shoot slow mo bullets that look like ping pong balls which you can block by shooting or hitting with your guns.\n\nNo reload, no skill, predictively repetitive and just plain lame! \n\nI should've listened to previous negative reviews. This game may be entertaining for trigger-happy minions but I'm getting my 8 quid back. \n\nHelpful | 6", "PonstApr 29 at 11:03 PM\nGreat game!!\n\nThis was my first Oculus game purchase and couldnt be happier. Exactly what I was looking for. Great with the kids, minus a little bit of a graphic story line. I like the campy cartoony feel. Good gameplay. I really get into it.\n\nHelpful | 0", "DrOculusVRMay 12 at 2:17 PM\nA great port\n\nPlayed on the quest, it's a fantastic port of a solid game. Short version it's a (wave?) shooter with a great story and interesting mechanics that means you rarely end up finishing a stage the way you start. Tracking on the quest is solid and if you own both PC and quest its cross buy so 2 in one. Well worth a try\n\nHelpful | 0", "Limitless_VRApr 18 at 7:33 AM\nA rootin', tootin' blast!\n\nGuns 'n' Stories: Bulletproof is an arcade-style wave shooter. You play as the grandson of an old wild west gunslinger who is telling his story. You relive the story through a series of chapters, as the old man. The object here is to re-create the daring deeds that the Grandfather wants his grandson so desperately to believe....\nThe cartoon-style graphics are a perfect fit for the Quest, making for smooth and slick gameplay. You begin with a revolver, but soon have 2 revolvers to dual-wield with. Not long after that, you get more weapons, but also more enemies to shoot down. The enemies attack from all sides, so you need to look all around you. They also throw sticks of dynamite that you need to shoot mid-air. One of the great mechanics of the game, is the ability to beat off incoming bullets with your weapon, or dodge them. The game gets really intense and exciting as more and more enemies begin to attack! This game is a lot of fun, and i am looking forward to playing through more of the game.\n\nHelpful | 0", "DadeeYodaApr 7 at 1:52 PM\nGuns & Stories\n\nFun game, and oddly addicting. My gaming time is short and at a premium everyday. I enjoy an immersive gameplay experience, when I have the time. But, if time is short, I need to jump into the \"down and dirty\" as quickly as possible, 'cause, the clock is ticking. Basic graphics, but creative and fun. Not top ten, or probably not on the most popular list, but in its own category, thumbs up and all stars\n\nHelpful | 1", "TnaknspnakApr 2 at 11:09 PM\nStand still shooter- comfortable and fun\n\nPretty fun. It's basically Space Pirate Trainer with Old Western style skins, and with a few other changes. Worth $10 for sure. You should get it.\n\nHelpful | 4", "JohSm67Apr 11 at 8:05 AM\nOk its a port\n\nIt works, but falls flat on the Oculus Quest!\n\nJust feels like a Oculus Go port and it dont deliver any feeling at all!\n\nDead & Burried II is delivering way better experience even if Rift version of Dead and Burried (First one) is the best western shooter out there until today!\n\n/J\n\nHelpful | 0", "thecreator2011Apr 23 at 4:56 AM\npossibly the most boring game ever\n\nI got nearly most of the quest games on the market, but I played this game for about 10mins before uninstalling it as I found it so boring not really much to grab you attention at all if im missing something ?? please someone let me know\n\nHelpful | 0", "darwins.lastApr 9 at 5:40 AM\nFun Story Shooter\n\nStory is good and funny. Voice actors are great. Game itself is very fun. The constant weapons upgrades, new enemy types, and different environments make you forget its waves. I very much enjoy this game. Great purchase.\n\nHelpful | 0", "PauldoggyApr 3 at 3:40 AM\nGreat Arcade Experience\n\nPersonally I enjoy this title. Some times puzzle games dont satisfy my game time. Good ol mindless fun is always welcome\n\nHelpful | 2", "Okami77Apr 7 at 4:28 AM\nA western fun game\n\nhttps://youtu.be/Lh891VKODC8\n\nIt s a craziest wave shooter with nice price !\n\nHelpful | 1", "Aaronb3434Apr 3 at 5:38 PM\nFun\n\nI like it its pretty cool It'll be great if this gets some cool improvements and updates.\n\nHelpful | 4", "cameron.torrey3Apr 7 at 7:51 PM\nGood game but...\n\nIts a good game but this game is free on steam I just wish it was free instead of it being $10\n\nHelpful | 2", "SpelingBeeApr 2 at 6:56 PM\nGreat game!\n\nThe old west environment is a lot of fun!!\n\nHelpful | 5", "BossBro111Apr 4 at 6:46 PM\nAmazing!!!\n\nThis is one of my favorite games on the quest. It has a good story, fun weapons, and funny humor. Definitely recommended\n\nHelpful | 2", "BanTan57Jul 5 at 9:13 PM\nWorth every penny\n\nThis game is great. I see people argue about the price when at 10 usd, thats a bargain. 9 levels and a fleshed out arcade mode. For a indie VRV game, thats a decent length. The guns are easy to use and unique. 5 stars.\n\nHelpful | 0", "Jones0531Apr 12 at 6:26 PM\nTotal let down- do not buy\n\nLooked forward to this game coming out forever. I love shooting games but this is just ridiculous. From starting with a baby bottle or whiskey bottle in hand and then to gun. Stupid. No point. Arcade game at the least.\n\nHelpful | 0", "88KKApr 5 at 4:01 PM\nworst vr game on oculus quest\n\nThis is the worst vr game on oculus quest, period. Save your time not to purchase it. It should be free, and i doubt anyone would play it even if its free. I still cannot believe how bad this game is, no contents, no surprise, no nothing. I would rather sitting on the chair doing nothing than playing this game.\n\nHelpful | 3", "Tiberius08Apr 16 at 11:26 AM\n10 $ it s ok\n\nLike i Said before ...10$ it s ok\nWe Need more buget games FOR This platform.\n\nHelpful | 0", "debksurApr 11 at 1:15 AM\nok\n\nThe graphics are good but finding my hands hurting firing the shots.\n\nHelpful | 1", "hollis.white.92Apr 14 at 2:21 PM\n\nFun but way to easy\n\nHelpful | 0\nDeveloper ResponseApr 27 at 6:39 AM\n\nHello. Thank you for your choice. Try to increase the complexity and you will like it more ;)", "matthew.daffronApr 5 at 10:00 PM\nLimited fun\n\nIt was ok went quickly and you are stationary so not what I was hoping for\n\nHelpful | 0", "Colton.H.10Jul 2 at 8:12 AM\nAwesome price\n\nThis game has a cool selection of guns and it is at a great price. Dont see why you could leave a bad review on this game.\n\nHelpful | 0", "First15MinuteGamerApr 10 at 8:19 AM\nGuns N Stories Bulletproof\n\nA great Western wave shooter setting, this is the story of a grandpa telling/embellishing his story of how he saved his loved one.\nAs the story goes along and the more whiskey he drinks the stranger and funnier his stories get. Highly recommended to all, great humour and later levels give you a bit of a workout.\n\nHelpful | 0", "ZedisnotdeadApr 4 at 9:12 PM\nThis is an arcade title\n\nWhat can I say.......this isn't going to be the best game you have ever played...by far. Neither is space pirate trainer.....that's kinda what this is. It has a story campaign mode and the arcade mode and they are both simply fun to play. Not much depth but that's really not what this game is about. It is fun. You could pick this game up and play it for 5 or 10 minutes and put it down. Super fun and simple. Think duck hunt on steroids with cowboys ....well worth 10 bucks!!!!\n\nHelpful | 2", "bjdrumQuest20Apr 6 at 11:54 AM\n\nCan not get the game started.\n\nHelpful | 0", "vrgirl2102Apr 18 at 2:49 PM\nExtremely fun shooting game!\n\nI got a chance to play last night and I had a blast! The storyline is funny and the crazy out of the blue guns keeps you interested. I tried playing it on normal and could not cut it. I had to lower my difficulty haha which I was able to do without having to start back at the beginning..which is a big plus. If you want to check it out yourself ..watch my video\nhttps://youtu.be/RtwxHAptKWU\n\nHelpful | 0", "Titan_GamerApr 9 at 3:08 AM\nGreat, funny game - lots of fun.\n\nSome people are rating this game based on it being a port which I think is really sad. I don't have a high end PC and have never played the original so I only base this review on the Quest game.\n\nFast paced, lots of guns and very funny - I love the Grandpa commentary.\n\nWell worth the 7.99 price tag.\n\nHelpful | 0", "danthemanukApr 7 at 12:54 PM\nGood but needs leaderboards\n\nThe game is fun for the price, but it needs leader boards to keep your interest after you have finished the story mode\n\nHelpful | 0"]