{"App Title": "Half + Half", "App description": "Half + Half is a multiplayer game about fun & connection. The game includes five unique multiplayer spaces that are designed to help you connect with people you know, and also to connect with people you dont, even if only for a short while.\n\nSwim in the ocean. Glide through clouds. Play human tetris with friends, or Hide & Seek where hiders are two inches tall, and seekers are as tall as buildings.\n\nEvery space in Half + Half is designed to be fun, but also to make you look as ridiculous as possible in real life. Half + Half is made to be fun for you, but also fun for everyone in the same room.", "Purchase section": "FreeAdd to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Multiplayer, Co-op", "Supported Player Modes": "Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Exploration, Social", "Languages": "English", "Version": "1.0.6.2", "Developer": "Normal", "Publisher": "Normal", "Website": "https://halfandhalf.fun/", "Release Date": "September 12, 2019", "Developer Privacy Policy": "Normcore.\nEnterprise\nPricing\nDocumentation\nDashboard\nPrivacy Policy\n\nLast Updated: April 18, 2019\n\nThis Privacy Policy explains how we at Normal VR, LLC (Normal, we, our, us) collect, use, and disclose information through our websites (including www.normalvr.com, www.normcore.io, account.normalvr.com, and our blog at www.normalvr.com/blog), our other online products and services that link to this Privacy Policy (collectively, the Services), or when you otherwise interact with us. This policy does not apply to the information of end users of our customers who may be using our Normcore plugin with their own application or product.\n\nWe may change this Privacy Policy from time to time. If we make changes, we will notify you by revising the date at the top of the policy and, in some cases, we may provide you with additional notice (such as adding a statement to our homepage or sending you a notification). We encourage you to review the Privacy Policy whenever you access the Services or otherwise interact with us to stay informed about our information practices and the choices available to you.\n\nCOLLECTION OF INFORMATION\nInformation You Provide to Us\n\nWe collect information you provide directly to us. For example, we collect information when you create an account to use our Normcore service as a developer, participate in any interactive features of the Services, submit a comment to our Normal blog, fill out a form, participate in a contest or promotion, make a purchase, apply for a job, communicate with us via third party social media sites, request customer support, or otherwise communicate with us. The types of information we may collect include your name, email address, company name and information, website address, payment information (processed by a third party), the name of your application, billing information, and any other information you choose to provide.\n\nInformation About Your Use of the Services\nUsage Information\n\nWe collect some information about your use of the Services. For example, when you make use of our Normcore plugin, we collect some information on your usage such as the IP address your usage originates from, a list of room names created by your application, a timestamp when a user connects and disconnects from our multiplayer servers, a temporary identifier for users connected to our Services, and bandwidth usage data for both statistical and billing purposes.\n\nAutomatically Collected Information\n\nWhen you access or use our Services, we automatically collect some information about you, including:\n\nLog Information: We collect log information about your use of the Services, including the type of browser you use, access times, pages viewed, your IP address, and the page you visited before navigating to our Services.\nDevice Information: We collect information about the computer you use to access our Services, including the hardware model, operating system, and version.\nInformation Collected by Cookies and Other Tracking Technologies: We use different technologies to collect information, including cookies and web beacons. Cookies are small data files stored on your hard drive or in device memory that help us improve our Services and your experience, see which areas and features of our Services are popular and count visits. Web beacons are electronic images that may be used in our Services or emails and help deliver cookies, count visits, and understand usage and campaign effectiveness. For more information about cookies and how to disable them, please see Your Choices below.\nUSE OF INFORMATION\n\nWe use the information we collect to provide, maintain, and improve our Services. For example, we use information about you to administer your Normcore.io account, validate that the users associated with your Normcore account usage are authorized, accurately bill you for your Normcore account usage, and to allow you to submit comments on our Normal blog. We may also use the information we collect to:\n\nSend you technical notices, updates, security alerts, and support and administrative messages and to respond to your comments, questions, and customer service requests;\nCommunicate with you about products, services, offers, and events offered by Normal and others, and provide news and information we think will be of interest to you;\nMonitor and analyze trends, usage, and activities in connection with our Services;\nDetect, investigate and prevent fraudulent transactions and other illegal activities and protect the rights and property of Normal and others;\nPersonalize and improve the Services and provide advertisements, content, or features that we think will be of interest to you;\nFacilitate contests, sweepstakes, and promotions and process and deliver entries and rewards; and\nCarry out any other purpose described to you at the time the information was collected\nSHARING OF INFORMATION\n\nWe will not share information about you except in the following circumstances or as otherwise described in this Privacy Policy:\n\nWith vendors, consultants, and other service providers who need access to this information to carry out work on our behalf;\nIn response to a request for information if we believe disclosure is in accordance with, or required by, any applicable law or legal process, including lawful requests by public authorities to meet national security or law enforcement requirements;\nIf we believe your actions are inconsistent with our user agreements or policies, or to protect the rights, property, and safety of Normal or others;\nIn connection with, or during negotiations of, any merger, sale of company assets, financing or acquisition of all or a portion of our business by another company;\nBetween and among Normal and our current and future parents, affiliates, subsidiaries, and other companies under common control and ownership; and\nWith your consent or at your direction.\nWe may also share aggregated or de-identified information, which cannot reasonably be used to identify you.\nAdvertising and Analytics Services Provided by Others\n\nWe may allow others to provide analytics services and serve advertisements on our behalf across the web. These entities may use cookies, web beacons, and other technologies to collect information about your use of the Services and other websites and applications, including your IP address, web browser, pages viewed, time spent on pages or in apps, links clicked, and conversion information. This information may be used by Normal and others to, among other things, analyze and track data, determine the popularity of certain content, deliver advertising and content targeted to your interests on our Services and other websites, and better understand your online activity. For more information about interest-based ads, or to opt out of having your web browsing information used for behavioral advertising purposes, please visit www.aboutads.info/choices or www.youronlinechoices.eu/ if you are a user in the European Economic Area.\n\nData Retention\n\nWe store the information we collect on you for as long as is necessary for the purpose for which we originally collected it, or for other legitimate business purposes, including to meet our legal, regulatory, or other compliance obligations.\n\nTransfer of Information to the U.S. and Other Countries\n\nNormal is based in the United States and we process and store information in the U.S. Therefore, we and our service providers may transfer your information to, or store or access it in, jurisdictions that may not provide equivalent levels of data protection as your home jurisdiction. We will take steps to ensure that your personal data receives an adequate level of protection in the jurisdictions in which we process it.\n\nYour Choices\nAccount Information\n\nYou may update or correct certain information about you at any time by logging into your account, or you can email us at privacy@normalvr.com and submit a request. If you wish to deactivate your account, please email us at privacy@normalvr.com, but note that we may retain certain information as required by law or for legitimate business purposes. We may also retain cached or archived copies of information about you for a certain period of time.\n\nCookies\n\nMost web browsers are set to accept cookies by default. If you prefer, you can usually choose to set your browser to remove or reject browser cookies. Please note that if you choose to remove or reject cookies, this could affect the availability and functionality of our Services.\n\nPromotional Communications\n\nYou may opt out of receiving promotional emails from Normal by following the instructions in those emails or by contacting us at privacy@normalvr.com. If you opt out, we may still send you non-promotional emails, such as those about your account or our ongoing business relations.\n\nEuropean Economic Area\n\nIf you are in the European Economic Area (EEA), you have certain rights and protections under the law regarding the processing of your personal data.\n\nLegal Basis for Processing\n\nIf you are in the EEA, when we process your personal data we will only do so in the following situations:\n\nWe need to use your personal data to perform our responsibilities under our contract with you. For example, we use personal data about you to accurately bill you, to process payments (through a third party payments processor) for your use of our Services, and to provide the Service you have requested.\nWe have a legitimate interest in processing your personal data. For example, we may process your personal data to communicate with you about changes to our Services, to provide, secure, and improve our Services, and to track usage of our Services to better understand how they are being used. Additionally, we may use personal data about you to send you promotional communications and news about product updates\nWe have your consent to do so. For example, if we intend to change the way we process your personal data in a material way or process it for a new purpose, we will request your consent before doing so.\nWe have a legal obligation to process your personal data. For example, we may need to retain certain personal data to comply with our recordkeeping and retention requirements or we may need to retain certain sales information to comply with applicable law.\nData Subject Requests\n\nIf you are in the EEA, you have the right to access personal data we hold about you and to ask that your personal data be corrected, erased, or transferred. You may also have the right to object to, or request that we restrict, certain processing. If you would like to exercise any of these rights, privacy@normalvr.com. Alternatively, you may contact us as indicated below.\n\nQuestions or Complaints\n\nIf you are in the EEA and have a concern about our processing of personal data that we are not able to resolve, you have the right to lodge a complaint with the data privacy authority where you reside. For contact details of your local Data Protection Authority, please see: http://ec.europa.eu/justice/data-protection/article-29/structure/data-protection-authorities/index_en.htm\n\nStay Normal.\n   \nPrivacy Policy", "Developer Terms of Service": "Normcore.\nEnterprise\nPricing\nDocumentation\nDashboard\nTerms of Service\n\nLast revised: April 18, 2019\n\nYour access and use of our plug-in (Normcore) is governed by these terms (Terms). Normcore is provided via normcore.io (Site).\n\nBy accessing Normcore, you acknowledge that you have read and agree to be bound by all of the terms and conditions set forth in these Terms. If you are accessing Normcore in your capacity as an employee, consultant or agent of a company (or other entity), you represent that you are an employee, consultant or agent of such company (or other entity) and you have the authority to agree on behalf of such company (or other entity) to all of the terms and conditions of these Terms.\n\nThese Terms constitute a legally binding agreement between you and Normal VR, LLC. (Normal).\n\nNormal reserves the right to change or modify any of the terms and conditions contained in these Terms (or any policy or guideline of Normal) at any time and in its sole discretion by providing notice that these Terms have been modified. Such notice may be provided by sending an email, posting a notice on the Site, posting the revised Terms on the Site and revising the date at the top of these Terms, or such other form of notice as determined by Normal. Your continued use of Normcore after any of the notices above constitutes your acceptance of such changes or modifications. Therefore, you should review these Terms when you access Normcore to make sure that you understand the terms and conditions that will apply to your use of Normcore.\n\n1. REGISTRATION AND PRIVACY\n\nIn order to access Normcore, you must register with Normal by completing the Normal registration form provided via the Site. You agree to (a) provide accurate, current, and complete information as may be prompted by the registration form via the Site (Registration Data), (b) maintain the security of your Normal account password, and (c) maintain and promptly update the Registration Data. Please notify Normal immediately if you learn of any unauthorized use of your Normal account or password.\n\nFor information about how we collect, use and share information about users of Normcore, the Site or other services, please see our Privacy Policy normcore.io/legal/privacypolicy.\n\n2. NORMCORE USE\n\nSubject to the terms and conditions of these Terms, Normal grants to you, a nonexclusive, worldwide, nontransferable, nonsublicensable, and revocable right and license to access and use Normcore solely in order to create an application (Application).\n\n3. PRICING AND PAYMENT TERMS\n\nNormal provides different pricing tiers as further described at normcore.io/pricing. Such pricing and payment terms are incorporated into these Terms by reference. In exchange for the use of Normcore, you are responsible for paying the fees applicable to the tier you select in accordance with the payment terms applicable to such tier.\n\nUnless Normal states otherwise, all payments must be made (a) in U.S. Dollars, and (b) by credit/debit card via an authorized Normal payment processor. You hereby (i) authorize Normal (or its authorized payment processor) to charge the credit/debit card number provided to Normal, and (ii) represent and warrant that you are authorized to use and have fees charged to the credit/debit card number provided to Normal. You understand that you may withdraw your authorization by contacting Normal.\n\n4. OBLIGATIONS AND RESTRICTIONS\n\nGeneral Obligations. Your use of Normcore must be in accordance with all of the following:\n\nall applicable law with respect to the use of Normcore (including as applicable, offering the ability to and honoring any unsubscribe or opt-out, complying with consumer protection laws relating to marketing or telemarketing and complying with privacy and security laws); and\nthe Terms and with any other terms, policies and agreements applicable to Normcore.\n\nProhibited Conduct. In using Normcore, you may not do any of the following:\n\npass Normcore off as a plug-in that you or any other individual or entity (other than Normal);\ndeveloped, modify, disclose, alter, translate or create derivative works of Normcore (or any components thereof);\nlicense, sublicense, resell, distribute, lease, rent, lend, transfer, assign or otherwise dispose of Normcore (or any components thereof);\ndecompile, disassemble, decode or reverse engineer Normcore (or any components thereof);\ntranslate Normcore (or any components thereof) or otherwise attempt to learn the source code, structure, algorithms or internal ideas underlying Normcore or reduce Normcore (or any components thereof) by any other means to a human-perceivable form;\nbypass, delete or disable any copy protection mechanisms or any security mechanisms within Normcore, disclose to any third party any performance information or analysis relating to Normcore;\nattempt to defeat or assist others in defeating any technical copyright or other intellectual property protections;\nuse or launch any automated system including, but not limited to, robots, spiders, offline and readers that accesses Normcore in a manner that sends more request messages to the Normal servers than a human can reasonably produce in the same period of time by using a desktop application or a conventional on-line web browse;\nattempt to use or access another users account without authorization or create a user account under false or fraudulent pretenses;\nuse any portion of Normcore as a destination linked from any unsolicited bulk messages or unsolicited commercial messages;\nimpersonate another person or otherwise misrepresent your affiliation with a person or entity;\ninterfere with the proper working of Normcore;\nbypass the measures Normal may use to prevent or restrict access to Normcore, including, but not limited to, registering for Normcore with a non-authorized email address;\ntake any action that imposes or may impose an unreasonable or disproportionately large load on Normcores infrastructure (as determined in Normals sole discretion);\nattempt to interfere with, compromise the system integrity or security or decipher any transmissions to or from the servers running Normcore;\ncollect or harvest any personally identifiable information, including account names, from Normcore;\nuse the communication systems provided by Normcore for any commercial solicitation purposes;\nengage in any activities that may interfere with the ability of others to access or use Normcore; and\ncause or permit any other party to do any of the foregoing.\n\nInvestigation and Removal of Content. Normal reserves the right, but is not obligated, to investigate any violation of these Terms or misuse of Normcore. Normal may, in its sole discretion, remove or disable access to any content for any reason or for no reason, including if Normal believes that such content violates these Terms or any other agreement we have with you for use of Normcore.\n\nEnforcement. Enforcement of these Terms is solely at Normals discretion, and failure to enforce these Terms in some instances does not constitute a waiver of Normals right to enforce these Terms in other instances. In addition, these rules do not create any private right of action on the part of any third party or any reasonable expectation that Normcore will be free from conduct or content that violates these Terms.\n\n5. REPRESENTATIONS, WARRANTIES, AND INDEMNIFICATION\n\nRepresentations and Warranties. You represent and warrant that (a) each Application is your original work, (b) none of the Applications (excluding Normcore) will infringe, violate or misappropriate any intellectual property rights, rights of privacy, rights of publicity or any other rights of any third party, (c) you will fulfill your obligations (and exercise the rights granted to it) under these Terms in accordance with all applicable domestic and foreign laws, the Federal Trade Commission guidelines or their equivalents, rules and regulations including, but not limited to, data security, spyware or adware, privacy laws, Childrens Online Privacy Protection Act and CAN SPAM, (d) each Application (and related content) will meet the terms and conditions of the Acceptable Use Policy, or (e) none of the Applications will contain any viruses, worms, date bombs, time bombs, or other code that may damage, interrupt or interfere with Normals or any third partys software or hardware.\n\nYour Obligations. You, at your sole expense, will defend Normal and its directors, officers and employees (Normal Indemnitees) from and against any claims, suits, actions, or proceedings (Claims) and indemnify the Normal Indemnitees from any related damages, payments, deficiencies, fines, judgments, settlements, liabilities, losses, costs and expenses (including, but not limited to, reasonable attorneys fees, costs, penalties, interest and disbursements) arising from or relating to the Applications (excluding Normcore), or any actual or alleged breach of any of your obligations under this Agreement (including, but not limited to, any alleged or actual breach of any of your representations or warranties set forth in these Terms). Normal will have the right to approve any counsel retained to defend against any Claim in which Normal is named a defendant and will not unreasonably withhold such approval. Further, Normal will have the right to control and participate in the defense of any such Claim concerning matters that relate to Normal, and you will not settle or compromise any such Claim without Normals written consent. If, in Normals reasonable judgment, a conflict exists between the interests of Normal and you in such a Claim, Normal may retain its own counsel whose reasonable fees will be paid by you.\n\n6. DISCLAIMER AND LIMITATION OF LIABILITY\n\nNORMAL DISCLAIMS ALL REPRESENTATIONS OR WARRANTIES (EXPRESS OR IMPLIED, ORAL OR WRITTEN) ARISING OUT OR RELATING TO THESE TERMS AND/OR NORMCORE, WHETHER ALLEGED TO ARISE BY OPERATION OF LAW, BY REASON OF CUSTOM OR USAGE IN THE TRADE, BY COURSE OF DEALING OR OTHERWISE.\n\nNORMAL WILL NOT BE LIABLE TO YOU OR ANY OTHER PARTY UNDER ANY THEORY OF LIABILITYWHETHER BASED IN CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, WARRANTY, OR OTHERWISEFOR ANY INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, PUNITIVE OR SPECIAL DAMAGES OR LOST PROFITS, EVEN IF NORMAL HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT WILL THE AGGREGATE LIABILITY OF NORMAL ARISING OUT OF OR RELATED TO THESE TERMS, NORMCORE, OR THE SITE (INCLUDING ANY INFORMATION OR CONTENT MADE AVAILABLE VIA THE SITE) EXCEED THE AMOUNT RECEIVED BY NORMAL FROM YOU UNDER THESE TERMS DURING THE 12 MONTH PERIOD IMMEDIATELY PRECEDING THE EVENT(S) GIVING RISE TO SUCH LIABILITY. MULTIPLE CLAIMS WILL NOT EXPAND THIS LIMITATION. THIS SECTION 6 WILL BE GIVEN FULL EFFECT EVEN IF ANY REMEDY SPECIFIED IN THIS AGREEMENT IS DEEMED TO HAVE FAILED OF ITS ESSENTIAL PURPOSE.\n\n7. TERMINATION AND EFFECT OF TERMINATION\n\nNormal may terminate these Terms if Normal reasonably believes that you have breached any of the terms set forth in these Terms.\n\nOn any termination of these Terms (a) all rights and licenses granted under these Terms will immediately terminate, and (b) you will promptly return to Normal all confidential information of Normal then in your possession or destroy all copies of confidential information of Normal at Normals sole discretion and direction. Notwithstanding any terms to the contrary in these Terms, this sentence and 3 (Pricing and Payment Terms), 4 (Obligations and Restrictions), 5 (Representations, Warranties, and Indemnification), 6 (Disclaimer, and Limitation of Liability), and 8 (General Provisions) will survive any termination of these Terms.\n\n8. GENERAL\n\nEntire Agreement. These Terms (including the terms and conditions incorporated into these Terms by reference) set forth the entire agreement and understanding of the parties relating to the use of Normcore, and supersede all prior or contemporaneous agreements, proposals, negotiations, conversations, discussions and understandings, written or oral, with respect to such subject matter and all past dealing or industry custom.\n\nGoverning Law and Venue. These Terms will be governed by and construed in accordance with the laws of the State of New York, without resort to its conflict of law provisions. The state or federal court in New York will be the jurisdiction in which any suits should be filed if they relate to these Terms.\n\nFeedback and Usage Stats. Any suggestions, comments, or other feedback provided by you to Normal with respect to Normcore or Normal (collectively, Feedback) will constitute confidential information of Normal. Normal will be free to use, disclose, reproduce, license, and otherwise distribute and exploit the Feedback provided to it as it sees fit, entirely without obligation or restriction of any kind, on account of intellectual property rights or otherwise. You acknowledge and agree that Normal may monitor, collect, use and store data (anonymous, aggregate or otherwise) regarding use of Normcore (Usage Stats).\n\nOwnership. As between the parties and subject to the grants set forth in these Terms, you own all rights, title and interest in and to the Applications (excluding Normcore) and all intellectual property rights (as defined below) embodied in the foregoing. As between the parties and subject to the grants set forth in these Terms, Normal owns all right, title and interest in and to Normcore, the Site, all Usage Stats, and all intellectual property rights embodied in the foregoing. Each party reserves all rights not expressly granted in these Terms, and no licenses are granted by a party to the other party under this Agreement, whether by implication, estoppel or otherwise, unless expressly set forth in these Terms.\n\nIndependent Contractors. Neither party will, for any purpose, be considered an agent, franchisor, franchise, employee, representative, owner or partner of the other party, and the relationship between the parties will only be that of independent contractors. Neither party will have any right or authority to assume or create any obligations or to make any representations or warranties on behalf of any other party, whether express or implied, or to bind the other party in any respect whatsoever.\n\nPublicity and Press Release. You consent to Normals use of your name and logo on any of Normals websites and Normals marketing materials identifying you as a user of Normcore.\n\nSeverability. If any provision of these Terms is invalid, illegal or incapable of being enforced by any rule of law or public policy, all other provisions of these Terms will nonetheless remain in full force and effect, so long as the economic and legal substance of the transactions contemplated by these Terms is not affected in any manner adverse to any party. On such determination that any provision is invalid, illegal or incapable of being enforced, the parties will negotiate in good faith to modify these Terms so as to effect the original intent of the parties as closely as possible in an acceptable manner to the end that the transactions contemplated hereby are fulfilled.\n\nRemedies. Normal is entitled to seek and obtain injunctive relief against any breach or threatened breach by you of any of the terms or conditions set forth in these Terms, from any court of competent jurisdiction, without being required to show any actual damage or irreparable harm, prove the inadequacy of its legal remedies or post any bond or other security.\n\nNotice for California Users. If you are a California resident, you may have these Terms mailed to you electronically by sending a letter to the address below with your electronic mail address and a request for these Terms. Under California Civil Code Section 1789.3, California Website users are entitled to the following specific consumer rights notice: The Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs may be contacted in writing at 1625 N. Market Blvd., Suite S-202, Sacramento, California 95834, or by telephone at (800) 952-5210.\n\nNormal Address and Questions\n\n69 Maujer Street\nFloor 2\nBrooklyn, NY 11206\n\nIf you have any questions regarding the use of these Terms, please email Normal at support@normalvr.com.\n\nStay Normal.\n   \nPrivacy Policy", "Space Required": "536.3 MB"}



["5 stars\n48%\n4 stars\n16%\n3 stars\n14%\n2 stars\n8%\n1 star\n13%", "AuraionJul 24 at 2:22 PM\nSo very adorable.\n\nThis is a very cute game.\nSimple and bright, it makes use of movement controls and comes at the best price point. The lack of talking means I don't have to worry about the people I'm playing with and the mini-games are fun. I particularly enjoyed hide and seek and the avatars are adorable blobs. XD\n\nHelpful | 35", "paw_pyrus12 days ago\nGood for those who are socially awkward\n\nIm a bit awkward when talking to people - so I definitely recommend this - if you are too - its a great conversation starter - and the other players voices turns into las.\nIts clear who this game is made for.\nSince its free - I say: Get it!\nAll of my friends (except 1), were made here - definitely recommend, Im actually going to make a Plush and Needle Felt of the avatars you play as.\nNot to mention, ITS SO PRETTYYYYYYYTTY (I barely use caps!)\n\nBut nothings perfect, this game has MANY (I barely use caps, again.) glitches and only 3/5 mini\ngames are actually games.\n\nHelpful | 3", "pain1918 days ago\nA nice calm experience\n\nOn days where I'm not in the mood to go crazy and try and do everything in shooter games or exploration type games, this is just really nice place to go to for a nice calm and fun experience with friends! Whether it's swimming or hide and seek, etc. it's just fun and cute game to play\n\nHelpful | 5", "Alexl3422 days ago\nFun but has issues\n\nThis game is pretty underrated, and deserves a bit more attention. But it is far from perfect. Its a fun, cute game with decent graphics, but the social aspect of it is lackluster. If you want something social, just download Rec Room or VRChat. Its an alright game, but I wouldnt put a lot of time in it.\n\nHelpful | 0", "Ashla_Night_Shade18 days ago\nI see why its free.\n\nIts honestly ok.\nBut you have to wait a long while to get into the other rooms and the two rooms that dont require at least 4 people are so bare its boring.\nI understand that its supposed to be relaxing but I was just wanting it to end.\nThe game doesnt tell you how to make friends either.\nSo Im gussying you can only play with friends you already have.\nWitch is ok if you have lots of friends, witch I dont.\nI bring that up because everyone I saw was just saying: La, La, La.\nNothing else.\nThe small menu you have does not help in the slightest.\nYou can basically forget its there.\n\nAnyway thats all Im going to say.\n\nHelpful | 2", "MiningMine09 days ago\nMore people need to play this\n\nThis game is stunning, cute and fun all the time. The only problem I encounter is it's rare to find as many players in the lobby as those playing VR Chat and REC Room. If you have friends you can meet up with great but you'll have trouble communicating in only la la unless you speak Teletubbie. In conclusion this game is great fun and safe for kids.\n\nHelpful | 1", "YeetNugget123Jul 24 at 6:21 PM\nYes\n\nI really like to play this when Im bored.\n\nHelpful | 8", "DiamondLD20Jun 26 at 8:25 PM\nMy oculus quest!!!!!!!\n\nThis game was the last game Ive seen before my oculus quest went blank..... sadly it never turned on again. the logo was the only thing I saw..... well, Im not blaming the game fully but I think it had part in the end of my oculus.... other than that its a really fun!!!\n\nHelpful | 35", "Latheon4Jul 20 at 5:52 PM\nHide + Seek\n\nHalf + Halfs Hide + Seek game is the cutest and most heartwarming game Ive ever played in VR. Im so happy I gave it a try because now its easily one of my favorites.\n\nHelpful | 4", "OculusSea5 days ago\nIdea\n\nI have an idea for this game. It is TAG.\n\nHelpful | 0", "Smithsonian30Mar 17 at 10:34 AM\nGreat little game with little to do\n\nIts simple fun and there arent too many games to play, but its free and its very solid. The controls for each of the games you can play is unique and feels good. Wish there was some more to do in the way of customization and perhaps a voice chat though.\n\nWhy not get it? Its free!\n\nHelpful | 114", "matirishhhJul 28 at 7:32 AM\nSmile\n\nThis one took me by surprise. I was not expecting such a a friendly, smile-driven game. There a couple of activities there, but Hide and Seek was my favourite one. This is a very nice little game that everyone should play. Presentation is spot-on and \"la la la\" is very cute. I really like it. 5/5\n\nHelpful | 1", "si.ning.10Jun 5 at 3:48 PM\nRelaxing and adorable\n\nFor a free game, this is honestly really impressive! Love how calming and musical it is; it was a great idea to have stranger speech be just \"lalala\".\n\nVoice chat works great between friends, and the blobby avatars with their funny motions worked really well for feeling like friends are right there with you. Minigames were very simple; coolest was definitely hide and seek, while the sea was great for just chilling and chatting. Can definitely recommend this!\n\nHelpful | 8", "StaticCloudApr 17 at 6:54 PM\nFree fun for anyone\n\nOk, updated review since the game is working now. Tbh sorry devs for not updating it sooner.\n\nIf you're looking for a small game to mess around in with either random people online, family or friends, then you've found it. The graphics are very simple yet colourful, and nothing ever looked low poly or low quality which works well for a game like this.\nWhile there is online multiplayer (which is required to play any minigame), there aren't really that many people on the game very often playing online anymore which could effect the game further in the future to even be unplayable without friends.\nI do think making the game free was a good decision though. Most of the reviews before were complaining about the price and the lack of content which I did agree with. There are only about five minigames, all of which can be played within half an hour with some of them being quite basic such as swimming or just paragliding while hitting a ball around. Although there are some more involved games like a hole in the wall like game and hide and seek which are loads of fun to play. But overall 10 was a bit much and I'm happy the game is now free to help boost online players.\nOverall it's a free, multiplayer minigame... game to play with friends or out of boredom.\n\nHelpful | 19", "NS1595May 27 at 5:20 PM\nAmazing Game - Absolutely Love Hide&Seek\n\nI think Half + Half is a great free game for VR beginners, however, there isnt too much to do. Ill admit that I really enjoyed playing hide and seek and the space game. I would recommend taking it one step further and adding more variety and other games. Also, I love the hide and seek map, however, I would suggest adding some more maps and making the controls a little easier to navigate and move. Overall, this game is one of my favourites and I would recommend playing Half + Half!\n\nHelpful | 3", "No3vA8 days ago\nWeird boring and LaLaLa!!!!!!\n\n1 activity that is good. No chat other than LALALALALALALALALALA which is supremely annoying. Made for kids too young to be able to play vr due to health. Ok for free but get rec room.\n\nHelpful | 0", "Pingu510Apr 15 at 9:49 AM\nFree fun for 20min\n\nIt's fun minigames but I feel it has issues with population. The mini games are very limited, only 4 or 2 players. Playig hide and seek 2vs2? Glider racing 1vs1? Hide and seek would be fun with 2 seekers and mulyiple hiders.\nIt's simply no fun unless you have already some friend to play it with. Also the lobby seems very restricted, I've only seen max 5 ppl there. No vc, just lalalala, but why put it in at all in that case?\n\nHave never had connectivity issues\n\nHelpful | 9", "Isaac_13flip17 days ago\nDont get this game\n\nI downloaded this game thinking it would be very fun but no. There was about 2 other players and the games were pointless. In my opinion its a waste of space on your VR\n\nHelpful | 1", "Auldstock17 days ago\nMeh\n\nNot much happening here\n\nHelpful | 0", "dingoflingMay 21 at 9:05 PM\nMagic\n\nLike when a witch casts a spell and everyone in Central Park is amazed that the spell worked and turned a frog into a toad this game is magic in the same sense except the nonsense of the review. I digress , its a great looking stylish experience that is waiting to feel lived in. From Sapiens to Ludens. KJP -Kojima\n\nUPDATE: QUESTION FOR DEVS: Much respect for creating such a great world , you can tell it was made with love. My main question is,\nDo you plan on adding more content to this such as things to do/cosmetic/regular updates to things like additions? I love it as is , but knowing it's going to grow would be a great thing . Thank you.\n\nHelpful | 5", "VladUngureanu125 days ago\nGreat but.....\n\nIt's a fun game, but after a while it gets really boring. No one really plays it so it's hard to find someone to play with.\n\nHelpful | 0", "TheLordnerdiousApr 11 at 9:09 AM\nAmazing, Needs more games.\n\nThis is great, with everything thats going on right now, I cant see friends for obvious reasons. But with this, I got to meet up and play games with one of them. The only issue I have with this is the lack of games. The ones it has are great, but theres only about 5 or 6, two of them are really similar, and one is more like an experience. Id just love more to do.\n\nHelpful | 8", "Evanboy81May 20 at 9:26 PM\nOh my god...\n\nI originally thought this title was going to be like Vrchat but was pleasantly surprised to see when I first booted it up it had its own beautiful art style, I cant get enough of this game and have been playing for hours with friends and random people I meet. I cant stress enough how much obvious hard work and thought was put into this game and is one of the best experiences Ive had on the quest. I love it\n\nHelpful | 6", "UltimateRRC123Jul 3 at 9:55 PM\nFun but it lacks some things\n\nTeleportation is fun but why no smooth locomotion\n\nHelpful | 1", "tobPLAYZvrJul 16 at 10:25 AM\nVery boring\n\nThere was nothing fun to do\n\nHelpful | 0", "theshinymonkDec 26 at 10:38 PM\nPerfect if you have kids\n\nMe and my wife planned on grabbing this for our kids and then they released it for free. When we started it I really didn't expect too much, but I must say I was surprised. While yes there is not a ton of content keeping you busy for 40+ hours of fresh content. However what it does it does well. I loved playing hide and seek with my little boy and the swimming was amazing. I think I swam in that open ocean for over an hour playing chase and I had an amazing time with my son who was giddy as all heck the whole time. My wife decided she wanted to jump in and honestly we had a great time goofing off together to the point that we lost track of time once again. I found myself literally with a smile from ear to ear and talking about how much fun we just had for hours. Thank you developers for making this game. It is awesome wholesome fun and gives me a great place in vr where both me and my kids can have fun without over complicating it for them or boring me. It only gets 4 stars for lack of being a top title, but once again what it does it does perfectly. Thank you again\n\nHelpful | 193", "gamingisflamingMay 7 at 4:56 PM\nBruh\n\nI mean I get that its a free game but there is really almost just 45 minutes of gameplay\n\nHelpful | 2", "Ender_MasterApr 27 at 8:23 AM\nPretty fun but not much to do\n\nIts really fun for the first half hour but then I only ever play hide and seek because that is really fun I wouldnt pay 20 dollars for it but I am glad I got it when it was free for Christmas\n\nHelpful | 1", "ChoppyPlanet71Apr 18 at 3:14 PM\nLove this game but...\n\nI love this game Ive had tons of fun with it but there is a downside. With us being quarantined and not having much to do I think that more competitive game modes would be a nice addition and also build a better community for this game.\n\nHelpful | 1", "THE_BUTTERApr 23 at 3:17 PM\nThats It??\n\nThis game is great and has a lot of potential, however i was disappointed when i realized just how little there was to this game. Dont get me wrong love it, but the game could be improved in many ways. Also the game outright lies to you in the pictures for the preview of the game, the hide and seek play does not look like that, however i would love it if it did\n\n1: more modes to games\nrather than having just 2-4 people in every game in either 1v1 or 2v2, have some variety like in Starball you could have one gigantic person on one team, then 2-5 small people on the other team. Or on Hide and Seek you could do the same, or have 3-5 giant people and then one small person but the orbs are all available right away.\n2: More variety in maps\nlike before i got bored with the same maps on every game over and over again and i would like variety in the maps that we play on, otherwise we get bored quick, and if not set maps then have completely randomized maps or at least have the option!!!\n3: interfaces\ni always thought that the thing in the middle of the map would give us something to do, rather then just tell us how many people there are, we should have the ability to change servers or change the time of day or change the weather or something.\n\nI love this game, so i cant see it like this, when i know it could be better 3/5 would recommend\n\nHelpful | 1", "HeyitsPolloFeb 15 at 6:57 PM\nLove this game but...\n\nI love this game. Its action packed, the weapons and combat is great but the only thing I dont like is the community\n\nI remember being annoyed by a 2 foot child but I knew what I had to do.\n\nI boot that little child like a football and he was gone\n\n\n5 stars\n\nHelpful | 47", "661c.sanabriaJun 10 at 10:06 PM\nFree fun\n\nThis game is free and its fun. No complaints\n\nHelpful | 1", "zhdjdksApr 3 at 7:41 PM\nWhat little it does, it does excellently\n\nIm not entirely sure what I expected when I opened this. Theres only a handful of things to do, but these are really fun and sometimes stunningly atmospheric. If you dont like it, its not like you lose anything, either. Its free, so why not try it out?\n\nHelpful | 3", "DarkfoghornMay 14 at 12:50 AM\nGreat multiplayer game\n\nI love this game, yes its simple and yes, it dosnt have the greatest games, but it is honestly one of the better free multiplayer games on the quest\n\nHelpful | 0", "jkaz0425 days ago\nThere is nothing to do.\n\nThe graphics is beautiful, but the gameplay is ok and it is just boring. There should be more mini games and fix this: I joined hide and seek and I got disconnected saying there was players unable to join. Some of the mini games are not that fun. Please fix the chatting because when someone talks to me, it doesnt translate what there saying. Please fix that too.\n\nHelpful | 0", "LoyganBDec 21 at 8:07 AM\nReconnect button of hell\n\nI got this game after seeing it was free this morning. I loaded the app and was met with a wonderful sight. It was a sign saying that I needed a WiFi connection. I was just playing online in Altspace and now it said I needed a connection. I quit out and checked my WiFi and after a bit of fiddling I finally accessed the game. I get in and it was pretty good. I got straight into a game of hide and seek and get chosen as the seeker. It was actually really fun until the reconnect button appeared. I quit out of the game and went back in and tried a different game but I couldnt get into any of them because I kept getting disconnected. There was nothing saying my connection was lost but I couldnt get into any games. I dont think my region was bad because Im in the US. So glad I got it for free. Devs please fix this. There is potential and I see it. I want to like this game so badly. Please fix this.\n\nHelpful | 133", "gaminglegend23Apr 12 at 4:19 PM\nGreat game compilation\n\nThis game is an amazing game compilation where you can play with friends, and I don't know if it's my settings but whenever someone talks they just say \"lalalala\"\n\nHelpful | 1", "kenekoKittenApr 17 at 2:58 PM\nI like this game but,\n\nI like this game but, I wish you can talk to others instead of hearing la la la and once I play two games, it starts to lag I want to play a different game keeps on saying I'm disconnected\n\nHelpful | 0", "soaring_potatoMar 3 at 4:56 PM\nYES\n\nWhen i first saw that it used the microphone, i was worried that my introverted self would have to be silent while others talk. To my surprise, all the stuff other people say is just high pitched mumbling and i enjoyed it very much. Its so fun to play with friends. Would recommend.\n\nHelpful | 5", "SimpleyIdiotMay 22 at 9:54 PM\nDont blame it on others not around!\n\nGreat game,dont rate it bad,its free!\n\nHelpful | 1", "jelwellJan 12 at 9:40 PM\nI dont get it But my kids do\n\nI struggle to understand this game. The physics, the controls, the different minigames. It just confuses me. My 7 year old - she LOVES it. Everything. Just waving her arms around. Playing Hide & Seek. And some of the minigames that I didnt even understand she figured out. My 10 year old likes Half & Half too.\n\nHelpful | 13", "scottrocket3Feb 9 at 5:40 PM\nCan't understand other players :X\n\nCan any one please tell me. How to understand other players on this app/game using an Oculus Quest when I put my hand up to my mouth with one of the controllers i see this : x <<< in a circlelike two eyes with an x over a mouth. I like the game and it has interesting games within in it. But until I figure that out all I hear other players saying is and I quote \"la la la la la la lalalalalalalalala\" It might be more interesting and I would be able to rate this better with stars if I knew how to understand other players using an Oculus Quest. Does any one know how to fix this problem? To the developers it would be something if I can point and trigger shoot the mouth to turn on and off the audio of other players rather then just here \" lalalalalalalah\" from other players.\n\nHelpful | 6", "RegretbearApr 18 at 1:10 AM\nSays I need wifi\n\nI have WiFi and have even turned off all other systems needing to try and load this game. But nothing. It needs to update itself or figure out why it wont connect to WiFi\n\nHelpful | 3", "JaimeVisserApr 9 at 4:17 AM\nNice little games\n\nPolished look and feel. Contains just a couple of mini-games. Fun for a bit but not much replayability.\n\nHelpful | 0", "TheTerraBlade42Jan 18 at 3:42 PM\nGreat, but LALALALA\n\nI love this game. It has a beautiful art style, creative and addictive games, and runs well. It took me a few tries to get my connection working, but it eventually worked. The only thing I would say is annoying is talking. It would be nice to have some sort of setting that you could actually hear other players talk and to talk yourself instead of the only communication methods are hand gestures and lalalala. Some suggestions that I would personally love would be character customization (hats, shirts, etc) and more gamemodes. A great gamemode would be platforming or obstacle courses.\nTl;Dr: Amazing games, but would like an actual speaking setting instead of lalala.\n\nHelpful | 25", "svenvandeperreFeb 20 at 1:38 PM\nHide & go seek\n\nA group of decent minigames, most of them to be played in multiplayer. All except one are fun, but nothing mindblowing... however, one of them kind of is. The hide & seek variant is really brilliant. Im not going to explain anything, as its better to go in knowing nothing.\n\nThey should turn this into a separate game, and create a bunch of variants on it. It is that good.\n\nAlso, this game is free. Stop reading this and go download it.\n\nHelpful | 4", "EdmCaperJan 26 at 10:03 PM\nEasy 5 stars\n\nI can understand people giving lower reviews when this got released about not many users online to interact with . In fact it deferred me from purchasing it. But this game cannot be faulted for lack of participation. It's available for free right now, so I had no excuse to not download. I went online during the day and played all the games and had a lot of fun meeting new ppl. Ran into someone called Sundog who went around with me playing all the games they had available. I especially enjoyed Spaceball the most but hid and seek was fun too. and here's why I recommend it so much . Many VR games don't necessarily make you want to jump back in the next day . I'm not a big fan of social experiences like rec room and I think it's neat that you can't hear people talk . Just la la la la la. Later on that night, late at night, I went into the lobby again. I could only find 11 users online and never actually seen any of them . So I stood outside the Spaceball game for about 5 minutes hoping someone would come online and join me . But no dice . I went out of the game and opened another game up. But a strange thing happened the next day, in the middle of the day . I went back again....58 ppl were online, and I got to play Spaceball and hide and seek right away ! And I had a lot of fun . I never experienced the connection issues of other users which makes me believe if it's an issue then it's not a common issue. This is an amazing filler game. When you're not sure what to play or only have 10 or 15 minutes. Getting to connect and dance and play goofy games is awesome fun. I'll certainly be coming back. Although there are never a ton of ppl online, I'm sure the ones that are online are like myself and will continue to come back. Great job developers! Now that this game is free, I hope you create the following you need to create more content and possibly new content can be paid for, like the pinball and roller coasters. I'm a 40 year old man .. and although this game makes you feel like a child, that's a good thing. I don't review many games, but this game deserves more stars and more awareness. 5 stars easy\n\nHelpful | 9", "cousinbeefytApr 18 at 7:40 PM\nBoring\n\nIt is very boring due to the lack of things to do\n\nHelpful | 1", "freddierigbyMay 10 at 11:58 AM\nAlright game, but theres not many ppl.\n\nThe game is okay but every time I play hide and seek theres only Like 1 person playing. :/\n\nHelpful | 1", "FoxyAbelMay 13 at 4:10 PM\nSkip it\n\nSo boring and pointless- little instruction on what to do. Huge waste of time\n\nHelpful | 1", "Decoy_ElementZJan 11 at 10:01 AM\nCan't even play\n\nI have tried to connect to this game and it doesn't even work. Yes I have checked my WiFi, yes it is full bars, yes I have tried connecting to another WiFi, yes I have disconnected other devices from WiFi, there is nothing I can do to play. If you can fix this is I will actually be happy, but for now, your game, is, not, playable.\n\nHelpful | 25", "CasualPlayJan 4 at 8:50 PM\nIt really has potential to be amazing\n\nThis game is really fun...when it works. I don't hate it, I actually really like it but it definitely needs work to be a great game. Firstly I'll do a short review of the mini-games the game offers.\n\nGlider - Im not sure what the objective of this game is, the description said that you could hit a ball into the rings but I never saw a ball when I was playing. Though it is really cool gliding around and enjoying the view. 2/5\n\nSpacewalk - This game is really fun! If you know the game show \"Hole in the Wall\" then this is it. You have to position your character to the correct pose as the \"hole\" comes towards you. The more accurate you are the more points you gain and whoever has the most points by the end wins. 5/5\n\nHide + Seek - This is probably the best mini-game out of the game! As the title suggests it is hide and seek with 2 teams of 2. The hiders are really small and hide in these little buildings in the play area while the seekers shoot litte \"gravity balls\" that explode capturing any hider in it's radius. 5/5\n\nStarball - Similar to glider, excepts now it's soccer. This can be really fun but the play area is so large that it takes forever for anyone to actually score. Also have visible borders showing how large the arena is since it's literally just an invisible wall. 3/5\n\nWind - This game has really good potential but it's just so plain and boring. It's supposed to be a race to the finish line using a glider but it's just so empty. The devs should add obstacles and boost pads to add some variety to it. 1/5\n\nSwim - This one is supposed to be a relaxed free roam but the controls to swim are so wonky and there's not much to look at to make it worth visiting, it's just an empty ocean with small schools of fish to see.\n\nAs many other reviews have said, connection issues are a problem. I sometimes disconnect mid-game or for the hide and seek game for example , one player would not be able to connect causing the game to be cancelled and having to wait again for the same issue to happen again. I don't think more mini-games should be added until connection issues are solved and the other games are updated to be better as there is still much room for improvement for them. The game is still very pretty and charming though. And the character design is really cool and cute! Overall, give this game a try. It may not be perfect, but it's not a waste of your time.\n\nHelpful | 10", "Redbone112759 days ago\n\nIt won't cotrnet\n\nHelpful | 0", "Jimmy_GreenMay 14 at 8:17 PM\nTerrible\n\nTerrible game. Dont download, it pretty boring and is not fun.\n\nHelpful | 1", "appleface57Feb 12 at 5:19 PM\nMeh...\n\nIts alright. Not many people play it, its confusing as heck, (for me) and you cant even hear other peoples mics. Its just replaced with La!s. The games are a little too easy, and its just weird in general. Like I get it, its made for kids, but its just weird. A few things that should be added is a way to change the color of your character, being able to walk as a moving option, (yes I know there is a way to walk, but it can make your arms tired and you walk pretty slow) and more games. Also, it reminds me of Teletubbies and that show with the colored aliens with ball bodies and mouthless faces that I cant remember the name of.\nFinal Review, 6-10.\n\nHelpful | 1", "Spikey_MikeyJan 19 at 9:55 AM\nPhenomenal!\n\nThis game is absolutely incredible for the low price of free! Im really impressed by the mechanics, and surprised that despite it being a free game, they dont try to plug in any expansion packs or other obnoxious purchases. My personal favorite mode is the hide and seek, and I love how they added the voice changers depending on your role, a great addition to the game! Ive been playing this with my best friend non-stop, and cant wait to try out the rest of the modes!\n\nThe only problem Ive encountered in this game is being disconnected mid game even though my internet is fine.\n\nAll-in-all great game would pay money for this!!!\n\nHelpful | 3", "timeat2Dec 24 at 5:20 PM\nAmazing game\n\nAfter seeing that this game was free, me and my friend got it and had so much fun. Hide and seek is amazing, and today we got an update and now in a party, me and my friend, when we would play hide and seek if we were hider our voices would get higher and when we were seeker they would get lower. All in all, an amazing game.\n\nHelpful | 13", "GrahamCracker-Apr 16 at 8:11 PM\nSuper boring and blinding\n\nThe title of the review says it all\n\nHelpful | 2", "boomclapFeb 10 at 12:03 PM\nDelight\n\nLove everything about this, joyful, creative, fun, lovely visuals, beautiful ambient music.\n\nAnd the chatter is great too imo, despite others criticising. Definitely prefer that over compressed microphone input cutting in and out from randomers!\n\nHelpful | 2", "M0ckingbirdDec 24 at 4:38 PM\nGood art style, communication needs work\n\nI like the art style of the game, but the gameplay needs a bit more variety. There needs to be some sort of update for more games, and the communication should include an option for voice chat rather than hearing lalalala or w/e the sound is when other people talk; it would make joining games a lot easier since you'd be able to guide other players towards a particular game, and I feel like it would encourage more people to add each other to their friend's list which could potentially motivate more people to play more often. 4/5 stars because the game is FREE for now; otherwise, I'd give it a lower rating. But, if a future update includes normal voice chat instead of \"lalalala\", then the game deserves a 4 or 5 stars. It gives me good studio ghibli vibes sometimes.\n\nHelpful | 3", "IhrieApr 24 at 12:49 AM\nNeat.....but\n\nThe idea is interesting, but fails to deliver on that idea In my opinion. Im sure some people will enjoy it, but it wasnt for me.\n\nHelpful | 1", "mama2alexnblakeMar 5 at 7:24 PM\nNice and relaxing\n\nI do recommend the underwater location\n\nHelpful | 3", "AlpacaWasTakenFeb 20 at 8:58 PM\nGood but needs more updates\n\nTo be honest when I first played this I felt like I did everything all I want is more games :)\n\nHelpful | 1", "ummwhatsureFeb 13 at 6:57 AM\nNever able to play.\n\nI have owned this game since it came out and every time I log in there are no other players. I mean the game looks great and I really like the concept but I would like to actually experience the game with other players. I feel like I am kinda missing the point just playing alone.\n\nHelpful | 25", "Yobro04Dec 21 at 11:27 AM\nNeeds more modes\n\nThis game is fun but needs more modes like skating on ice or climbing or sliding from a huge slide or coaster or a dance battle mode but its free so I cant complain if its for free its for me buts its cool and cute and its a nice idea but just needs more modes\n\nHelpful | 2", "Koloax_YTFeb 15 at 6:13 AM\nActually really fun\n\nBest for people who want to be social, play, and have fun! I love this game so much :D\n\nHelpful | 3", "goatboy999Jan 30 at 1:46 PM\nBroken\n\nI got this and I opened it ,next thing I knew my oculus stopped working ,now I cant turn it off or on.\n\nHelpful | 10", "SwordboyDec 16 at 12:38 PM\nWon't let me play the app\n\nI've bought this game about a month ago and it hasn't let me use it yet. Keeps telling me that it won't work without an internet connection and tells me to check my settings. Internet is fine, full bars and all other apps have no issues getting connected online. For some reason, this app just won't connect.\n\nHelpful | 16", "Cloudless_Rain_Dec 23 at 7:05 AM\nExtremely calming\n\nWhen I first heard about Half+Half, it seemed neat but I wasn't sure if I wanted to pay 15 dollars on it. So when I heard the game was now free I jumped on the opportunity to get it. All I can say is I'd be fully willing to pay the original price, now that I know what this is. It's such a surreal, dreamlike experience that I've never seen before. And I'm very glad the devs made this a free title, because now there are so many more people online, fixing the only real problem present before. If your wondering if this is worth taking up space on your device, I have no doubt in my mind that it definitely is.\n\nHelpful | 4", "kahunamooreJan 9 at 9:50 AM\nVery fun games and experiences\n\nI really enjoyed the playful and slightly quirky nature of this game. It brings a calming alternative to the more hectic VR content. The co-op mode is especially fun.\n\nIf you havent played it yet give it a try!\n\nHelpful | 1", "The.Doggo24Jan 5 at 3:47 PM\nVoices\n\nThis game is great but it can use more game modes but you probably working on that and also, I cant figure out how to turn voices on, whenever I play the game all Im hearing is other people go LaLaLa... its this a bug?\n\nHelpful | 1", "egon_oneDec 22 at 10:52 AM\nUnable to Connect\n\nUpdated Review:\nThe \"unable to connect\" problem seems to be solved. Now I can connect.\nOverall I think of the five available game modes only the \"Hide & Seek\" is fun. Would be nice if there where a few more maps to play hide & seek and/or bigger maps with more people.\n\nBut the four other game modes are very disappointing.\nYou can fly a glider in an infinite airspace or swim in an infinite ocean. Both gets boring after 2 minutes and feels more like a demo than a game.\nThen there is the \"gilder race\" which is a sidescrolling game.. Why the heck is it sidescrolling? Could be fun, if it where like the other glider mode in infinte air space but sidescrolling sucks and after 2-3 rounds it gets also boring.\nIn \"Spacewalk\" you have to mimic certain body movements. Feels like a poor adaption of some dancing games. Also gets boring very quick.\n\nI think the Devs should focus on the Hide & Seek part and provide more and/or bigger maps because thats the only game mode that actually is fun.\n\nHelpful | 9", "Topher-dunlapJan 7 at 9:47 AM\nBest Free Game on Oculus!!\n\nThe world is really aesthetically pleasing as well as the sound track (though simple and repetitive I like it). My absolute favorite games in half half are StarBall and Hide and Seek. I spent a good couple hours playing the first time. A MUST TRY. literally nothing to lose.\n\nHelpful | 2", "SJK1980Dec 24 at 5:54 PM\nUpdated review\n\nAfter the latest update I think half + half is a good multiplayer experience. I really like the hide and seek game. The new game star ball is great. And the infinite ocean is very relaxing to swim around in. Would be cool if there was an obligatory whale or maybe a squid in the lower part of the ocean to look at though.\n\nThe games art style is awesome, and it turns speech from strangers not on your friends list into cute gibberish. A good idea. The experience is free so theres no reason not to give it a try.\n\nHelpful | 6", "RayMan51681Dec 31 at 2:44 PM\nA few suggestions\n\nSo I really like the game I dont have WIFI problems (too often) and love to play it. I just have a few suggestions for you to add\n\n1.Maybe some costumes or singular clothing parts, it doesnt have to be much maybe just some hats or something but it would really help to distinguish players easier and would just look nice\n\n2. Maybe some more games. Yeah I like swimming and hide and seek but maybe something a little more, or at least just one game.\n\n3.Maybe have some setting to maybe be able so see other players or be able to hold hand with someone without them disappearing.\n\nThanks\n\nHelpful | 0", "Skia420Dec 21 at 10:00 AM\nSo far, no good\n\nI cant play. It will not connect to any internet connection. Keeps telling me to reconnect. There is nothing wrong with my connection. Signal is excellent. No problem playing any other game that requires internet connection. What is the problem?\n\nHelpful | 4\nDeveloper ResponseDec 24 at 11:10 AM\n\nheyo, we had a small outage last week. give it another shot :)", "jickstumpsJan 12 at 3:38 AM\nGreat games, annoying users!\n\nPart of the issue with this game starts when you get good at it. As soon as you are a challenge to other players the player quit before the end of a game. Out of every ten games you complete one game, there should be some kind of penalty for quitting early or you should be forced to stay in the game until the end. Being able to quit half way through is extremely frustrating.\n\nThe actual games are really fun. Hide & seek and Football are genius. Such good dynamics and hours of fun/frustration.\n\nOne way around it would be to be able to rate players. Or to be able to pull up their stats. If they quit regularly then its easy to bypass playing them.\n\nHelpful | 3", "CatsHSep 12, 2019 at 8:45 PM\nSuggestions!\n\nI really like this game, but I have a few suggestions!\n\n1. More game modes\n\n2. You can hold peoples hands\n\n3. I think it would be fun if the seeker could pick up the hider\n\n4. Wider servers\n\n5. User created games!\n\nThanks, I hope you read this!\n\nHelpful | 440", "JaskurJan 24 at 4:41 PM\nCouldn't even play\n\nEvery time I try to launch the game it says I have no internet connection. I close the game, I have full bars and every other app and game can use the internet just fine.\n\nHelpful | 2", "XkwizittDec 23 at 5:08 AM\nSo much fun with friends\n\nIf you can get two or three of your friends I highly recommend the hide and seek game! We all talk over Oculus Party which makes it a lot more fun to hear everyones reactions so maybe in future have a better VoIP in game but really Ive been playing for over an hour this morning with friends and we are just taking a fifteen minute charge and water break but it is a lot of fun! I base my five stars on this alone as I havent even tried the other mods in game yet! Too much fun playing and hide and seek!\n\nHelpful | 3", "icarus92966Feb 2 at 6:08 PM\nLiterally cant play\n\nThey need to fix the WiFi issue until they do Ill leave this up here it looks like a beautiful game but right now its unplayable.\n\nHelpful | 2", "djmas4444Dec 29 at 3:37 PM\nWholesome game!\n\nI really thought this game was enjoyable to play! There were a bit of rough patches like the game crashing all of a sudden, but it was good. I genuinely liked it, and saw a few suggestions to the game that were pretty good ideas. For one, seekers being able to pick up hiders would add a new level of fun to the game, and user created servers would really change the game for the better! Thank you for this chill game! (P.s, dev(s) are pretty chill too)\n\nHelpful | 1", "sh0ck3r34Dec 29 at 2:32 AM\n\nHow do u make friends in it ? My friends on my oculus list I hear fine in the app but people I dont know just say lalalala is there a way to add them in the app? Other than that it has good audio and potential..needs more game modes as well\n\nHelpful | 1", "TNTTimSep 12, 2019 at 1:21 PM\nCute, relaxing and absolutely beautiful.\n\nStarting up the game for the first time feels surreal, it tells you that you will join the others soon and to be nice to each other. Gameplay wise it's fun, you can explore a lot and you always have that \"what's over there? Can I go there?\" Feeling. The graphics are really nice and simplistic, it performs great. Very much recommend.\n\nHelpful | 152", "TheSmilingCrocDec 22 at 8:09 AM\nIt's free now but some problems\n\nSome connection problems when I first booted I moved closer to my router and it worked I got in and it was very tranquil and fun played with a friend wish there were more modes though\n\nHelpful | 0", "Studly_McSexfireDec 21 at 5:43 PM\nLike a weird dream\n\nIm surprised this only has 3.6 stars. Its so much fun and so creative. I love how everyone sounds like theyre saying la la la! Haha. Hilarious. Def one of the most unique social games Ive played. Really my favorite one yet. Pretty cool it was free today. Glad I got it. I def would have bought it when it was being sold had I known how awesome it was.\n\nHelpful | 2", "djicolesJan 1 at 9:58 AM\nLove it!!!\n\nIts a great game and you cant ask for more. However, you should be able to create games as well as playing them.\n\nHelpful | 0", "JimZMJan 21 at 12:25 PM\ncute, relaxing, too few players\n\ngood for kids\n\nHelpful | 0", "gaygewarren0703Jan 2 at 6:17 PM\nDumb\n\nIt does not let me download it says head set offline even tho I can play rec room and watch YouTube and download other games so plz reply\n\nHelpful | 4\nDeveloper ResponseJan 2 at 6:32 PM\n\nWill you email a screenshot of the error to max@normalvr.com? We don't see any outages on our end. We can help you debug your connection locally.", "DolfinoYTJan 18 at 9:55 AM\nDoesn't work\n\nI got this game to play with my friends but the game did not work. Have tried everything from restarting my quest to deleting the game. Please fix the reconnect screen and I might give a better review.\n\nHelpful | 1", "WillsQOct 26 at 7:52 AM\nAll this app needs\n\nis a way of alerting all owners that someone else has come online - even whilst in Oculus home or another app. Is that possible? The trouble is that it relies on multiplayer but the user base hasnt got to tipping point yet. As a result Ive not seen anyone in the app yet - which is unfortunate as I imagine its a lovely experience when with other players. Such nice design and originality seems a shame to waste.\n\nHelpful | 20", "evandaganDec 22 at 5:51 PM\nAnother \"demo\" experience.\n\nThis game consists of 5 (or so) different \"social\" experiences where you can interact with other players through gestures and a few lightly competitive games. There's a swimming environment, a hang-glider environment, a side-scrolling glider race game, a rhythm game where you put your arms in different positions in sequence, and a hide-and-seek game (best of the bunch) where two players get shrunk down and hide while two players get enlarged and have to find the smaller players, with a 5 minute time limit. These last two might have some replay value, but overall this comes across as an interesting experiment rather than a full-fledged game. But, for free, it's definitely worth checking out, and if more people were online at any given time it might be more enjoyable.\n\nHelpful | 0", "DuckithJan 19 at 5:32 AM\nCan't even get in\n\nCan't get past you need Wi-Fi connection. I'm standing right next to my router, I couldn't have a stronger connection other than Hardline. Fix this and maybe ill change my review\n\nHelpful | 1", "urix_auriApr 1 at 11:04 AM\nGood Game\n\nI personally think that being able to connect with people is a pretty good part of this game as well as being able to do things that you cant do in real life, for example swim for a long time (not trying to say its not that realistic).\n\nHelpful | 0", "slowlightingDec 21 at 3:45 PM\nFree game with lots of potential\n\nThe fact that its free for me is an instant 3 stars, matched with simple graphics and creative modes makes it very fun. Its a good game to take a break from beat saber and other fast paced games. Highly recommend!\n\nHelpful | 3", "PigredJan 8 at 3:21 PM\nFor a free game it's great!\n\nThis game looks amazing and is beautifully done there is lots of things to do for a free game and it's a great game for playing multiplayer with your friends.\n\nHelpful | 0", "BeesBeesJan 7 at 3:22 PM\nThe cutest game ever!!!\n\nThere are no downsides to getting this game. Its cute, its free and the interactions I have had on this game are truly beautiful. INSTALL IT NOW!\n\nHelpful | 1", "CrossCleaveApr 24 at 3:18 PM\nSo much fun\n\nBasic games but the hide and seek is EVERYTHING its sooooooooo funny and well done. Definitely get it\n\nHelpful | 0", "graycrawfordJan 9 at 8:05 PM\nThe kindest game\n\nThere are a lot of great touches in the interaction design, and the matchmaking consistently syncs me with other hilarious people.\n\nHelpful | 1", "oldeltaNov 9 at 10:09 AM\nBeautiful Game, So Lonely! Needs Update\n\nThis game looks really great and has a dream-like quality, especially the cute intro (which should be replayable so you can show friends). But as everyone has mentioned it is very difficult to enjoy it alone...and there are rarely any people playing when I hop on.\nThe other night I got so excited in the lobby to see six people listed as being somewhere in the game! But I had no idea where they were...and I still couldnt find anyone to play Hide and Seek with.\n\nI went into the Swim Room because it looked like someone was in there, but I never saw them...\n\nThe game needs better matchmaking capabilities...how about an option to alert other players that a person is searching for partners at a door. Just standing in front of empty doors waiting and waiting is no fun.\n\nGuys, can you please try an update that better matches players at the doors so that more people can enjoy your beautiful creation?\n\nOr maybe create an AI in the Hide and Seek Room for people to play against if no one is around. It would be great to demo that room for new VR players because the mechanics are awesome!\n\nGood luck with the game! It has a lot of potential, but I dont think you will solve the issue of having too few people playing by making it so challenging for current players to enjoy, demo and evangelize about the cool rooms.\n\nHelpful | 8", "cbain75Jan 29 at 2:04 PM\nSo funny\n\nYou are a literally a squid\n\nHelpful | 1", "jedfryDec 28 at 4:42 PM\nNeeds work\n\nI have a rule about giving free games one star so you get two, I noticed that you cant talk, no one can hear me and the only sounds I hear from other people is jibberish. Yes I gave the app permission for microphone\n\nHelpful | 2", "aghkoDec 6 at 4:27 AM\nPoor Content\n\nThe game looks cute. But the amount of games or actual interactions are quite low.\nAnd one is very dependent of finding other players to actually be able to enjoy it... still after a couple of minutes you would have seen and experience all what this app has to offer.\n\nHelpful | 2", "theoneandonlycadenpDec 29 at 5:43 PM\nDamm this game is good\n\nYall should get this game. I dont want to spoil it, but Ill just say 1. Its fun 2. You need other people 3. Please please play this\n\nHelpful | 2", "GabbehJan 18 at 11:44 AM\nSuper cute and chill.\n\nGreat to show off VR to new people. Very relaxed and cute.\n\nHelpful | 0", "WaggyTailDec 29 at 2:50 PM\nGreat game!\n\nWow, this is so wholesome. Claimed it for free, get it while it's hot because it definitely needs more players for matchmaking.\n\nGood work, devs!\n\nHelpful | 1", "v._.keyJan 21 at 1:33 PM\nAbsolutely brilliant\n\nNothing else to say\n\nHelpful | 1", "doinyamom989Dec 20 at 5:58 PM\nWorst vr game on the market\n\nIm not sure whats worst. The game its self or the fact that the developer thought that this game was actually worth $15 and people actually bought it.\n\nHelpful | 3", "bean1197Dec 23 at 3:37 PM\nQuestions\n\nIm currently downloading it but I was wondering whether or not I can play with a friend who's on the rift or the rift s when im on the quest?\n\nHelpful | 0", "blablargonMar 13 at 10:19 AM\nHide and Seek be on FLEEK\n\nAfter playing Hide and Seek with 4 random people for a few minutes I could not be happier with the VR experience. It's amazing. Thank you developers for making a beautiful experience in VR! Pretty art and sounds. Love this so far!\n\nHelpful | 1", "MadeinBrooklynGamesSep 12, 2019 at 1:24 PM\nVery Cool Social VR Game\n\nOne of the biggest problems with VR is the social component of playing with people. Half Half solves this with a bunch of awesome mini games that I can play with my VR friends. The games are incredibly fun and Half Half has such a unique world to step into! If you want to play a game with friends in VR, try this bad boy out.\n\nHelpful | 22", "DonVR19Nov 17 at 3:18 PM\nGreat but limited\n\nThis was super fun to play by myself and with my friends but there's only five things to do. Don't let that discourage you it's still 100% worth it.\n\nHelpful | 1", "BlueOrcaVRDec 25 at 12:54 AM\nVroom\n\nAll I have to say about the walking controls is *Vroom*\n\nHelpful | 4", "Aaronb3434Dec 23 at 4:25 PM\nIt's not bad\n\nBut needs more content, worlds, details etc.\n\nHelpful | 0\nDeveloper ResponseDec 24 at 11:11 AM\n\nwe just launched a new game mode called Starball. Let us know what you think :)", "larsonmattrOct 25 at 11:25 AM\nNeat feeling!\n\nI like Half and Half, really enjoy its unique feel and multiplayer. However, I agree it needs more solo options as the multiplayer community isnt constantly present. I have had the app for two weeks but several if the experiences I have yet to play because I cant find other people.\n\nHelpful | 5", "AlightCelery186Dec 21 at 5:20 PM\nGreat game but needs more modes\n\nThis game is visually stunning, has great gameplay, the hiding seek is great but needs more content.\n\nHelpful | 0", "Godislove4uDec 28 at 6:33 PM\nSuper heavenly\n\nFull of gentleness and kindness.Free and pleasant.\n\nHelpful | 1", "thatboi729363Mar 27 at 6:35 AM\nGood game\n\nIt is a very good game but i would like a lot more things in it it has many potentials for it\n\nHelpful | 0", "Kmc853Dec 25 at 9:18 AM\nAmazing\n\nThanks for making it freeeeeeeeeeeee\n\nHelpful | 2", "virtualytDec 21 at 10:58 AM\nFree!!!!!\n\nThis is such a good game and Im so happy I got it for free\n\nHelpful | 0", "KirigayaMarcDec 22 at 10:22 PM\nAmazing\n\nIt's Really Calm and Reminds me of Journey from PlayStation\n\nHelpful | 1", "benvrarSep 13, 2019 at 10:04 PM\nPure Fun!\n\nThis game is really a marvel. I hopped in with my friend the other day, and we just spent the whole night laughing and exploring these worlds that Normal VR has created. Although it did take us a while to actually get into one because we spent time in the main intro area just playing with the running mechanic and watching how the Wanda avatars wiggled as we moved around. I think that experience alone defines so much about Half + Half: every single mechanic was designed with fun in mind. Soaring around on hang gliders was beautiful and serene. The hide and seek game is wildly fun, and requires you to slingshot yourself across the play area to find glowing orbs while the seeker walks around the space 20 times larger than the hiders. Swimming is a very calm experience, and it feels so freeing to be in an endless ocean. I think one thing that people need to keep in mind is that Half + Half breaks the mold on what people should expect from a VR experience. This isn't a competitive shooter or deep narrative-driven RPG. This game hits the core of childhood gameplay- silliness, social interaction, and no-stakes competition. The goal isn't to win, but rather to have fun and laugh and spend time with one another. Most of the worlds are open-ended, and you have the freedom to enjoy them in whatever way you want. Can't wait to see how this experience grows over time, and I simply haven't been able to stop talking about it for days. Do yourself a favor and go enjoy this wiggly, silly, wonderful world.\n\nHelpful | 9", "FLAME_FLAKESep 12, 2019 at 3:05 PM\nBeautiful game\n\nThis is a game that you have to try to get the full picture. With so many fast pace action VR games out there, this is a nice change of pace. The mini games are delightful, weather you want to play soccer in the sky or swim in an endless ocean with friends. Or play hide and seek hunting as a giant and hiding as a miniature person. The use of scale makes it a joy to play on either side. The art style is very pleasing to the eyes and quite relaxing. This game is a joy to play and I can't wait to see what more they will bring to the table!\n\nHelpful | 28", "jmalmstenSep 26, 2019 at 9:58 AM\nNice visuals but desolate\n\nI saw the trailer and read a few reviews. I thought it looked interesting so I'll try it out.\n\nIn short. I liked the idea and concept and style. Definitely feels like something that can grow and become great. But right now? Lonely. I tried all doors. No multiplayer would connect. I tried going in alone and it just feels lonely without other players.\n\nSo yeah looks promising, but as I cannot find other players the social aspect is dead. :/\n\nHelpful | 12", "PeeweedidiSep 15, 2019 at 6:29 PM\n\nThis game is really fun and it has a lot of potential visually and just for fun. But there are 2 problems Im having so far since I got it\n1. Is that every time I join a game its only me, I have yet to join another person in around 2 hours of playing this. Please fix this\n2. The games are too few, adding more games along the sides of hide and seek would be a great addition, also fan made games would be an amazing addition to this game.\n\nHelpful | 3\nDeveloper ResponseSep 17, 2019 at 8:35 AM\n\nWe've recently made some improvements to our matchmaking. We'll now wait until we find another person for you to play with instead of putting you into a game by yourself. You can now also start matchmaking on multiple doors simultaneously. Give it another shot and let us know if that fixes anything :)", "KiraplaysOculusSep 15, 2019 at 7:58 AM\nPlease help, 1/4 always.\n\nHello,\n\nI purchased the game less than half an hour ago, but I can't seem to fix this problem. The game is absolutely beautiful, but everytime I start a game, it always says 1 out of 4 players, and that only player is always me. I dont know if this is just bad luck, or if something is wrong with my connection or something, but in other games, my connection works just fine.\n\nPlease help,\n\nThanks.\n\nHelpful | 2\nDeveloper ResponseSep 17, 2019 at 8:36 AM\n\nWe've just improved an update that should prevent this from happening. Our matchmaker will no longer put you into a game unless it's found another party for you to match with. You can also now begin matchmaking on multiple doors at the same time. Give it another shot and let us know how it goes :)", "AMyriadSep 20, 2019 at 6:02 AM\ntl;dr Half+Half is fun, but its lacking\n\nI love Half + Half. The characters are adorable, the environment is so surreal. I loved the intro at the start where the game welcomes you into a brand new world. And thats when I saw the doors.\n\nIn the first door was a gliding game where you control a hang-glider and have to push a ball in some hoops. I thought that was fun and the music the ball played was so relaxing, but after an hour of trying to get even one score, I noticed nothing happened. It became repetitive. Perhaps I needed to score more and was too impatient, or maybe its just better with more people, Im not really sure.\n\nThe second door was a mashup of Tetris Effect and a hole-in-the-wall type game. You were supposed to duck and lean to fit into 2d character silhouettes. This game was probably one of my favorites, because it let you take breaks, and it just kept on getting more and more challenging.\n\nIn the door in the middle was probably the most popular game: Hide and Seek! In this game, hiders are very small and can move around by loading a slingshot and firing at their destination. I thought this was an interesting and unique movement method, but it got annoying when it would accidentally bounce off a wall or ceiling if youre in a small space. Another part I wasnt really a fan of was that whenever you fire your slingshot you fire a character model that can be very easily seem by the seeker. I understand that this is a feature because it shouldnt be impossible for the seeker to spot you, but I think that its already tough enough.\nThe seeker, on the other hand, are gigantic compared to the hiders. The seeker moves by swinging their arms from side to side, a movement mechanic I thought was well implemented in this game. To catch the hiders, the seeker is equipped with a gravity ball (I think thats what its called) that they can throw. If a hider is hit with or caught in the blast zone of a gravity ball, theyre out. I hate the gravity balls, especially since the seeker can just spam them and throw them everywhere. If the developers added a short cooldown or something to the gravity balls, it would make life easier for anyone unfortunate enough to be a hider.\n\nThe fourth door is similar to the first door, whereas it involves controlling a hang-glider. However, the twist here is that the game is a 3rd person side-scroller. Players are given a horizontal bar that they must push down. Its like pumping gas into a bike wheel. Whenever you pump, your character flies up, and first player to the finish line wins. Oh\nand there are also small wind currents that can boost you and help you get to the finish line faster.\n\nThe fifth, and final door involves swimming.\nJust swimming.\nYou, fish, the ocean.\nJust peace and quiet, if you want to relax.\nIf you move your arms in a swimming motion, you move forward. You can go up, down, and all around.\nJust as long as youre not afraid of the ocean, youll be fine! (Youre fine anyways, its just a game)\n\nSo, in conclusion, I really like this game. I fell in love with it the second I saw the trailer. It seemed like a game Id love. And it was, kind of.\nI think that right now, as Im writing this, that..\nThis could be better, there could be more. I think this game lacks content right now, and theres not a lot to do. You can play through it all in a couple of hours, and sure, you can play with friends, but itll get boring after a while.\nI think this game is lacking right now, but I hope more will be added in the future! Keep on doing great things, Normal!\n\nHelpful | 8", "Littlemack02Sep 21, 2019 at 6:58 PM\nVery disappointed\n\nGreat idea! But sadly I believe the execution was lacking. I had fun playing it when I could actually get in a room with people. But it takes so long. I got tired of waiting. When I was in the game though I had a blast playing hide and seek. (The only game I could find players on). Yeah its just starting out but I think it could be a great game with a little work. I posted a Full Review on my YouTube channel: (LittleMack02) so if you wanna check it out go ahead. Any ways my review is a little harsh but in this industry you have to be honest. But its cute and I love the idea. Thanks developers.\n\nHelpful | 7", "justink9088Oct 24 at 6:44 PM\nNot worth it\n\nWould have gave it 1 star but a fun person in hide and seek helped.\n\nLooks nice\neasy to pick up\n\n\nTakes a long time to find people.\nNot enough modes\nboring\n\nHelpful | 2", "gary.towersSep 22, 2019 at 12:16 AM\nGreat but lonely\n\nThe game is great. It has a lot of potential. The graphics and the overall environment are captivating. The only issue I have is that it is hard to play with other people. You usually have to wait a lot to be connected to someone else to start a game. So all the excitement goes away because of the empty play rooms.\n\nIt would be great to have AI players when there are no real people to play around with.\n\nHelpful | 5", "topdude15Sep 12, 2019 at 7:04 PM\nAwesome Experience\n\nThis game is super simplistic which makes it the perfect multiplayer game to unwind after a long day. There are 5 different game modes each with unique ways to play and interact with the environment. My personal favorite game is the Hide and Seek minigame, as it puts a special twist on an already-loved game with friends. Overall, would definitely recommend purchasing this game to have fun and relax!\n\nHelpful | 11", "motionworksvrSep 12, 2019 at 1:50 PM\nA dream comes true\n\nFinally a poetic, well-designed VR experience made for kindness and gentle play. If you are tired of shooters and stroboscopic lights, the folks at Normal are probably the same. This is a suite of simple games, carefully crafted to foster calm and peaceful interactions with strangers. How lovely! It's fun and fulfills the real promise of VR: to live experiences that are not possible to have in the physical world.\n\nFans of James Turrell, join us in this sweet world. Everyone, come around!\n\n---\nwww.motion.works\n\nHelpful | 9", "willytay1005Sep 15, 2019 at 1:46 PM\nWheres the Co-op Multiplayer?!?!\n\nI had a friend able to connect with me but then it was only me and her. No other two players connected. And when I try to play by myself it stays 1/4players no one else connects. And when I press the Oculus left button and look through Mirrors Im getting a black screen??? Fix this!!!\n\nHelpful | 13\nDeveloper ResponseSep 17, 2019 at 8:35 AM\n\nThanks for the feedback! We've recently updated the game to wait until we find a match for you rather than throw you into a room alone. Give it another shot and let us know how it works out. You can also now begin matchmaking on multiple doors at the same time :)", "therealcheese28Sep 28, 2019 at 12:47 AM\nEasy going game..\n\nCalm game, uses movement well, really immersive.\nNo violence, nice atmospheric, sensory sort of game.\nLovely pastel colours, good to chill inside of.\n\nHelpful | 2", "Tacocat.exeOct 2 at 7:31 AM\nOk game\n\nIt is a good game, but the servers are WAY too small. There is barely anyone on, defeating the purpose of this \"multiplayer\" game. The 5 minigames are good, but they would be better with more people to play them with.\n\nHelpful | 1", "MidlandScreeSep 15, 2019 at 7:12 AM\nFun and beautiful but scarce\n\nThe actions and minigames in this are really nice and calming. In my playthrough of all the minigames however, I never once connected with another play, everything was solo. There is no onboarding for anything so half of the games Im still not sure how to play. The hide and seek one is a standout even if it took me most of the timer to work out what I was meant to do. If youre looking to buy, perhaps wait for an update, as Id guess this is a very early version.\n\nHelpful | 0\nDeveloper ResponseSep 17, 2019 at 8:37 AM\n\nheyo, max the developer here :) - we recently made some changes to matchmaking so you'll no longer be thrown into a match alone. You can also enter the matchmaking pool for multiple doors at the same time. Give it another shot and let us know how it goes :)", "AurookSep 12, 2019 at 8:08 PM\nWorth it!\n\nSuch a creative way to interact in VR while achieving a relaxed feel and atmosphere that makes you want to pop on the headset and dive back in.\n\nHelpful | 7", "McHoundSep 15, 2019 at 3:38 AM\nUser-friendly multiplayer fun\n\nFor experienced VR users, there is not a lot of content here, but this is a perfect game to show and play with your friends who are new to VR. Looking forward to new modes!\n\nHelpful | 1", "TgTravOct 12 at 8:48 AM\n\nI really like it very good game and cute graphics but the only thing is you should make bigger servers because most of the time I play alone it is still a really cool\nGame though:D\n\nHelpful | 0", "KarmaMoleSep 13, 2019 at 3:14 PM\nMultiplayer failed completely!\n\nTried to play, and cannot connect to any of my friends in-game. Nor did they connect well with each other. Ive spent more than hour trying to get it to work. If I click Leave Party, it says Joining Party. Absolutely failed to play with others. Refunding so i dont waste my two hour refund window trying to play!!!\n\nHelpful | 6\nDeveloper ResponseSep 17, 2019 at 8:39 AM\n\nheyo, developer here. I'm so sorry to hear that you were unable to get in with friends. We've recently pushed an update that addresses some of these issues. Let us know if it's fixed!", "goosepork24Sep 13, 2019 at 7:01 PM\nAwesome concept!\n\nSo far, from what Ive played, I really like the concept of this game, but think they could have executed it a little better. First of all, I think there should be the option to change your locomotion from teleporting to using the joystick to move around. It would also be cool if they eventually add more game modes as well, possibly a prop hunt type of game mode would be awesome!! Overall, such a cool game.\n\nHelpful | 1", "Redstar79Oct 5 at 5:06 AM\nWhere is everyone??\n\nSo I was really excited about this game but I couldnt play any of the mini games. Absolutely no one joined. Ill change my review if I can actually play it.\n\nHelpful | 4", "PuppetMan2019Oct 7 at 6:15 AM\n\nBag of poo not worth the money avoid I want my money back\n\nHelpful | 7", "ehmorrisSep 13, 2019 at 11:22 AM\nBeautiful, fun, and friendly\n\nI haven't played another game for Quest that has a better introduction, visuals, or soundtrack. When I played it I tried a few of the games with strangers, and it was just fun and friendly. I'll definitely be coming back.\n\nHelpful | 6", "cockzuckerSep 18, 2019 at 1:06 AM\nMultiplayer doesn't work\n\nEveryone I know and people I speak with on alt space cannot ever see anyone else in half half. Please fix this bug.\n\nHelpful | 6", "bad_hair_daySep 16, 2019 at 3:00 AM\n\nLove the vibe and animation but there's only one proper game here and that's hide and seek. Unfortunately this is almost unplayable when you're tall because of the glitching and clipping into buildings. Would buy again at 7.99 if fixed. Refund requested.\n\nHelpful | 2", "Nova212121Sep 22, 2019 at 3:19 AM\nI cant find any games\n\nDont get me wrong but I havent played a single game mode I dont know whats going on and I really want to play so bad\n\nHelpful | 1", "DAX_QcSep 18, 2019 at 2:36 PM\nNot for me.\n\nSuperb simplistic design. Very relaxing but oh boy boring. This game will put you to sleep better then morphine.\n\nHelpful | 4", "snickersnacksSep 17, 2019 at 8:40 AM\nCute, whimsical exploration\n\nLoved my time in this space with friends, Hide & Seek got a lot of mileage :) Very relaxing space to hang out and just exist inside of, explore or play or just chill. <3\n\nHelpful | 1", "mrgunmannSep 23, 2019 at 8:24 AM\nI hate it\n\nIt sucks i hate it. so much needs to be added to this game dont waste your money on this junk\n\nHelpful | 5", "PosborneSep 12, 2019 at 7:04 PM\nNot much more than a tech demo\n\nI wanted to love half and half... but its not quite landing. Hang gliding game is close to actual VR multiplayer fun, but the others are too thin to keep your attention.\n\nHelpful | 2", "glukasilSep 21, 2019 at 6:32 PM\n\nnot sure how to play with random people but played it with my friend...hide and seek is a hidden gem. even 2 people can have fun.\n\nHelpful | 1", "sierrawhiskeySep 22, 2019 at 11:46 PM\nNever connects to any other players!\n\nSounded like fun but it never connects with any other players and now I can't even refund it even though it had never worked even once \n\nHelpful | 3", "Demos76Sep 16, 2019 at 1:20 PM\nMore Games Like This Please\n\nFun. Wish there were more players though. And more game modes would be nice too. :)\n\nHelpful | 2", "dawn.french.961Sep 25, 2019 at 12:30 PM\nI read the 2 reviews and thought ok, so\n\nI'm confused, no others did not come.\n\nHelpful | 1", "deallocSep 19, 2019 at 10:56 AM\nBeautiful and fun!\n\nGreat job\n\nHelpful | 1", "mancintexasSep 16, 2019 at 5:20 AM\nNot Good Because is time to get to \n\nThanks for the message\n\nHelpful | 1"]