{"App Title": "Henry", "App description": "Narrated by Elijah Wood, and developed with former creative talent on the Brave and Toy Story 3 teams, Henry is the story of a little hedgehog with a big problemhe loves to hug! After ending up alone on his birthday, hell make a wish that changes everything.\n\nAn Oculus Story Studio production.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "", "Languages": "English", "Version": "3.0", "Developer": "Oculus", "Publisher": "Oculus", "Website": "https://storystudio.oculus.com/", "Release Date": "October 22, 2019", "Developer Privacy Policy": "None", "Space Required": "1.35 GB"}



["5 stars\n54%\n4 stars\n15%\n3 stars\n13%\n2 stars\n6%\n1 star\n12%", "Oculus8181Jul 15 at 8:28 PM\nHedgehog\n\nThis a cool experience you 2 year old can watch it its awesome its free and so cool you should get it so so cool and awesome\n\nHelpful | 19", "paw_pyrus12 days ago\nCan be better\n\nA nice - charming story and characters feel alive from the animation and voice acting - beautiful environments.\nAlthough - I have some critic below.\n\n1) The art style - generic, not to mention - it's highly Uncanny Valley, made me uncomfortable.\n\n2) Lack of 6 DOF - the screen moves with you - which is horrible - since I wanted to look around - as mentioned before - the game has some beautiful environments - I wanted to explore them - not to mention - this takes you out of the experience.\n\n3) The character designs -\nthey could've been more recognizable - not just animals that already exist.\n\nOverall - it's a short, fun experience - wouldn't recommend it if it was paid - but - since it is free - give it a try!\n\nHelpful | 1", "TheGrantJul 23 at 8:34 PM\nTHIS GAME IS AMAZING!!!!!!!!\n\nThis is literally the best game I have ever played!!!! It is soooo fun!!!! I am 15 and I am in love with this game!!!!!\n\nHelpful | 5", "AlexDexter14 days ago\nTeleportation\n\nI wish we can teleport anywhere in this\n\nHelpful | 0", "DavidArkApr 23 at 7:02 PM\nAwesome for kids despite the language.\n\nMy little nieces enjoyed this experience even though they don't speak english, although it would be nice to have this game dubbed in spanish as well, I know there's just not a big market here yet as to make that profitable. Still though, I have to thank you for having this experience on the oculus platforms for free. Keep up the incredible animations!\n\nHelpful | 42", "DrakshalaJun 27 at 10:42 AM\nFun little film.\n\nGreat short film, especially for the younger ones as no movement or control is needed.\n\nHelpful | 0", "jelwellMay 18 at 11:28 PM\ncute\n\nsuper cute.\n\nHelpful | 9", "nishruu2Jun 10 at 9:11 PM\nreally short but cute\n\nreally short but cute\n\nHelpful | 0", "mob-bossMay 19 at 4:54 AM\nGarbage\n\nMy 12 year old daughter played this and turned it off in less than 5 minutes. So I have it a try, video didn't run smooth, jerky and you can not move. If you do move it makes you feel sick asyou cannot move in the room or the room moves with you. This is just a poor example of a vr short movie.\n\nDeleted.\n\nHelpful | 7", "RowdyRocketMar 6 at 3:37 AM\nQuest is not Google cardboard!\n\nThe original was not a prerendered movie. I was actually able to walk around and be immersed in the story. Now the whole world moves with you like an old cellphone VR experience. Very disappointing. Love the story but very lacking. Bummer for sure! Devs, do it right please! It is worth the effort. Please fix it.\n\nHelpful | 27", "NukemarineJan 23 at 1:25 AM\nFun story told in amazing 360 3D\n\nWhile it's a pretty much a one watch and done sort of experience, this is a great app to get if you're likely to demonstrate your headset to kids. A good suggestion is have them sit on the floor to watch it. The trigger button pauses/play while the thumbstick fast forwards/rewinds through scenes.\n\nUnlike on the Rift, Henry for the Go and Quest is 360 video recording of the Henry experience that looks like it's in 5k resolution. I'm pretty sure it's using John Carmack's modified viewer though I don't know which one. The one weird artifact is the floor under you looking like a depression. Beyond that, you're seeing what only Rift users with beefy computers would see.\n\nHelpful | 86", "Elixzr_EndApr 10 at 5:35 AM\nMade me cry! \n\nIncredible story! The VR really suited it! We NEED A sequel!\n\nHelpful | 6", "PeteyPakJan 31 at 12:06 PM\nWrong format for this story\n\nThis isn't an app, it's a pre-rendered video. And if you move your head the world sways around you. And if you tilt your head you get serious eye strain and motion sickness. Real nausea that you thought you were completely immune to as a VR user.\n\nAnd the story is designed for very young children or toddlers, and there are good arguments to say that children that young shouldn't be dissociating what they see from the rest of their senses, so VR seems an odd choice for this particular story.\n\nSo:\n\n*Quality of animation*: Great, sure. It would make a fine TV episode. I see my two year old neice enjoying things like this a lot. I skipped through bits but liked the glowing balloons.\n\n*Appropriateness of the concept*: Poor. If it's for VR, need to aim at children at least grade-school age or higher (or with the pedigree of the makers involved, aim higher still!).\n\n*Experience of watching this format of thing in a Quest*: Very poor. Some adaptation or innovation is needed to make this work. It is not comfortable.\n\nHelpful | 27", "chrisluxMar 25 at 4:13 PM\nPretendered, so no 6DOF\n\nPretendered, so no 6DOF. This makes this experience very awkward and uncomfortable. The original on the Rift I would recommend a lot more than this.\n\nHelpful | 7", "Yobro04Jan 27 at 2:20 PM\nNeeds 6 D O F\n\nIts fun but needs 6dof because it makes me motion sick if its just 3dof so add it pls now\n\nHelpful | 20", "jeffkasJan 30 at 9:17 PM\nAbsolutely Loved It\n\nI'm left wondering if I saw a different short film than the other reviewers? I thought this was so well done and while very short, it was so fun! I felt like I had entered a world much like Winnie the Pooh lived in. The animation was beautiful and even at age 50, I found myself laughing and really enjoying the story. I'm someone who gets motion sickness a lot in VR experiences, but I didn't even slightly get it here. My only disappointment was that it ended so soon but at the price of free, I certainly can't complain about that! Thank you to the devs for this experience. I can't wait to show my 10 and 11 year olds tomorrow! More like this, please!\n\nHelpful | 8", "l3rianKApr 18 at 3:24 PM\nMore please!\n\nIt actually made me laugh. I love these types of VR stories. More please! I dont mind paying for them in the future.\n\nHelpful | 1", "KiratzoFeb 24 at 2:53 AM\nYou get what you pay for\n\nFor what its worth this is a good story, short, but a good one, something youd expect to see in one of those animated shorts on YouTube. Being in vr doesnt really contribute much to the story telling other than making you feel like youre really there.\n\nHowever a big drawback is how this is only 3dof, if youre prone to motion sickness skip this one\n\nHelpful | 1", "MLGCoachxXxFeb 11 at 4:32 PM\nCute for kids\n\nAll three of my kids sent through it and then we all laughed about it. It's really a cute video. I wish I were able to walk around. Inside the space Room scaling really would have made this. It is what it is and it was cute.\n\nHelpful | 2", "JimZMJan 27 at 2:47 PM\nnice short film for kids\n\nThis is pre-rendered stereo-360 3DoF video, therefore quite uncomfortable especially if your head doesn't stay completely still. Also, it's too easy to accidentally touch buttons which pauses the video.\n\nHelpful | 5", "ahawksJan 29 at 4:05 PM\nCute, great graphics, free! One bug.\n\nI immediately noticed a bug. It doesn't handle you tilting your head to the side. So you have to keep your eyes level.\n\nOther than that, it's cute and charming and is a great demo of the graphical capabilities of the quest.\n\nHelpful | 0", "L_etrangerJan 23 at 5:51 PM\nGood Film but bad experience\n\nI have a couple of big issue with this one, the parallax of the movie seems off, and the player used seems to not translate accurately the HMD rotation (beware of sickness).\n\nHelpful | 8", "TeonisFeb 15 at 3:09 PM\nCute\n\nAranyos, de tl rvid.\n\nWay too short, and the lack of 6 DOF is not the best thing...\n\nHelpful | 1", "KingFukiJan 29 at 2:37 AM\nunacceptable\n\n3Dof is never a good idea even for free content.was like watchinng cross eyed.Don't show this to anyone because will give them a bad impession about what vr should be.\n\nHelpful | 10", "shashking404Feb 3 at 1:27 AM\nit's not 3DOF but Awesome quality!\n\ni should be able to rotate the view by joystick and skip 10 seconds by any button on the controller\n\nHelpful | 2", "artefact_andreiFeb 28 at 3:43 PM\nnot comfortable for the eyes\n\nnice and cute animation, but quality like 30 fps in the white colors of frames(((\n\nHelpful | 0", "nshadovFeb 12 at 1:04 PM\nCute but drags\n\nSorry story of a hedgehog whoo wants to hug everyone. Non interactive and kind of predictable for adults but really fun to watch for younger audiences.\n\nHelpful | 1", "Bender_2112Feb 3 at 10:07 PM\nCute story\n\nThis isnt an app but a short cartoon about 5 min long. Theres no interaction. That being said its a delightful story.\n\nIts free. Download it and check it out. Kids will especially enjoy it.\n\nHelpful | 1", "foxdenworldFeb 11 at 12:46 PM\ncute, but awful controls\n\nSo i can pause, unpause, and skip forward and back.\nIf i skip to the end, it starts over.\n\nMaybe I just missed something, but how do you exit this thing?\n\nHelpful | 0", "MightyQuinnJFeb 28 at 10:50 PM\nGreat experience to show kids!\n\nWell made 3D 360 video that gets the emotions goin! Super cute!\n\nHelpful | 0", "RobDoyle8Apr 29 at 11:02 AM\nGreat little story\n\nMy kids loved the story. Wish more of these were around for the quest.\n\nThese stories would be great for kids instead of it mainly for games\n\nHelpful | 0", "eternalmattFeb 1 at 8:58 AM\nNot for Quest\n\nIt was okay on GearVR. Now on Quest, it is dated and disappointing they would release this again. Also can I say the story is quite sad and doesnt redeem itself by the end.\n\nHelpful | 3", "phvanderlindeFeb 12 at 10:32 AM\nFun\n\nAnimation was very good, specially the balloons part.\nHope to see more of this.\nRecommended highly, and its free.\n\nHelpful | 2", "beyondbeliefJan 26 at 3:11 AM\nLooks nice, but only 60hz\n\nThe animation looks interesting, but the game is in 60hz, so the whole experience is flickering. Would be nice if the devs set it to 72hz.\n\nHelpful | 3", "MalteseDadFeb 9 at 10:10 AM\nPoor experience\n\nMade me cross eyed and nauseous. Poor production values. A pity given the amount of money oculus is throwing at showcasing the platform\n\nHelpful | 2", "stormy034Feb 4 at 6:48 PM\nAwsome\n\nAwsome story with great animation. Would not recommend to moms and emotional people. Im a 12 years old and almost cried.\n\nHelpful | 0", "ambulanceman85Feb 10 at 1:31 PM\nBrutal\n\nPointless ,\n\nHelpful | 4", "dingofoxvrfoxJan 30 at 6:37 PM\nThis is adorable wish it was longer\n\nNeeded to be longer I want more stories and voices for the characters including the turtle\n\nHelpful | 0", "zack.slotkowskiJan 27 at 5:48 PM\nSuper cute\n\nI loved it. Short and sweet. Cant beat free.\n\nHelpful | 2", "GoldenG722Feb 21 at 1:56 PM\n\nBad you dont do anything\n\nHelpful | 1"]