{"App Title": "HouseFlipper VR", "App description": "Changes, changes, changes\n\nWe have ensured that House Flipper VR brings a unique experience, no matter if you ever tried virtual renovations. The veterans will definitely notice some items they have never seen before as well as a new graphic design. But all this is just the tip of the iceberg. The biggest revolution is in the gameplay itself. We have completely redefined all the mechanics: from now on you are not getting rid of all the dirt from the counter with a single click - swing that virtual brush yourself!", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Touch (as Gamepad)Supports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale, Sitting", "Supported Controllers": "Touch (as Gamepad), Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Art/Creativity, Casual, Relaxation/Meditation", "Languages": "English, Chinese (China), Chinese (Hong Kong), Czech, French (France), German, Japanese, Korean, Polish, Russian, Spanish (Spain), Turkish", "Version": "7.8", "Developer": "Frozen District", "Publisher": "Frozen District", "Website": "http://www.houseflippergame.com/", "Release Date": "August 27, 2020", "Developer Privacy Policy": "Purchase on\nbase:pcsteam\nPurchase on\nbase:psstore\nPurchase on\nbase:msstore\nPurchase on\nbase:pcsteam\nPurchase on\nbase:psstore\nPurchase on\nbase:msstore\nReady for some action?\n\nGrab a hammer and get ready for quite a teardown as it's time to give those crumbling properties a new life. Get rid of what's not needed and prepare solid foundations for a brave new... House!\n\nPlay it your way\n\nRegardless if you prefer working on interior designs, decorating them or taking care of technical problems and assembling various installations, in House Flipper you will find something for yourself! Thanks to the order system, you will slowly delve into the world of makeovers, to later use this experience when working for the most demanding customers.\n\nTo infinity and beyond!\n\nYou've finished the last order - congrats. In the meantime, our developers are preparing more of them! We're constantly implementing new updates for different occasions, including items and ideas received from our community. We're also working on DLCs which include new areas, mechanics, so that you'll always have something waiting for you in your mailbox.\n\nSlide 1\nSlide 2\nSlide 3\nCurrent DLCs\n\nThe sunbathed beaches of Massachusetts Bay will soon drag crowds of flippers from all over the world! HGTV DLC is not just new houses - it's a brand new area, mechanics, and tens of new items. If you're just like us and cannot wait - unleash your creativity in your backyard! Garden Flipper will let you create a garden of your dreams, no matter if you're an experienced gardener or just holding a shovel for the first time in your life.\n\nGarden Flipper DLC\n\nPurchase on\ngarden:pcsteam\n\nHGTV DLC\n\nPurchase on\nhgtv:pcsteam\nNEWSLETTER\n\nDo you want to stay tuned and receive information about our newest projects?\nSubscribe to our newsletter! No spam flooding!\n\nwww.frozendistrict.com\ncontact@frozendistrict.com\nEnglish\n\nCopyright  2020 HouseFliper. All Rights Reserved.\n\nOur site uses cookies More information on cookies and our Privacy Policy...\n\nACCEPT", "Space Required": "393.0 MB"}



["5 stars\n36%\n4 stars\n55%\n3 stars\n9%\n2 stars\n0%\n1 star\n0%", "BeatzCreations4 hours ago\nSo addicitve!\n\nWill keep this short and sweet!\n\n1. Never tbought cleaning and fixing up houses in VR would be so much fun!\n\n2. Game would be 5 star if it had smooth locomotion  tryin to teleport into the positions sometimes gets really annoying... hopefully this can / will be added soon as an option!\n\nHelpful | 29", "Droculah2 minutes ago\nCleaning in VR instead of real life....\n\n...and having fun doing it! I do not want to spray down my home, pick up trash, and put away dishes, but for some reason, it's fun in VR. Go figure!\n\nI have only played through a few jobs so far (I wonder how many there are), so I still have more to explore, but here is my review so far. And will update as I play more.\n\nThe graphics are OK. Not amazing, not horrible, and it's what I expected, so I'm fine with it.\n\nFrom the menu, you can shop for items from different categories, buy houses, or accept and complete jobs.\n\nSo far, I've cleaned up a writer's home, picked up after a woman's messy cat, and cleaned up the house of a woman who went on a business trip, only to find, once she'd returned, that her lazy husband trashed the house. \n\nThis has essentially consisted of picking up trash with a grabber, spraying and scrubbing dirty spots, righting items that have fallen over, and watering plants. There may be more as I take new jobs, but that's what I've gotten to so far. Each job seems to introduce another mechanic.\n\nWhen you accept a job, you are brought over to that location, and receive a list of tasks to complete.\n\nYou can still change things in the houses you visit, even if they're not part of your task list. For example, I still put dishes away in the cabinets, because they were all over and bothering me, even though it had no effect on the reward or the tasks whatsoever.\n\nCompleting jobs earns you money, and skill points. You can purchase items with the money through the shop menu, and level up skills in a skill tree with the points. I have not delved into the skill tree aspect yet, but you can up your skills in various cleaning categories. You can also purchase homes, through the menu, but I have not gotten there yet either. I assume you may be able to decorate these houses with items you purchase, once reaching that stage.\n\nI'm looking forward to cleaning up more houses, and then purchasing some of my own to decorate.\n\nAreas of improvement:\n\n- The controls are really touchy. If you want to open a cabinet or fridge, you often rip them out of the wall or pick them up, rather then easily being able to grip the handles. Placing the items back are touchy too. I'm sure there will be more tutorials as I play, but earlier on you can mess with object placement already. And because there hasn't been a tutorial yet at that point, it can be confusing. For example, I just learned about the grid placement system, which makes it easier to place things, but it took until my third job to discover that.\n\n- Currently, you can choose between seated, standing, and room-scale. You can teleport, or walk around. I think an option for free locomotion is needed. Most people probably won't have the space for walking around in real space. And teleporting is awkward and Immersion-breaking. Being able to love with the controllers freely would be a huge plus.\n\n- The tutorials (so far) can use some work and more explanation.\n\nMy thoughts so far is that this is going to be a fun title, and price point seems fair for what it is. But will need some updates, for sure. After having just played for a little, today, I'm already satisfied with my purchase, if that helps anyone decide on whether to get this or not.\n\nHelpful | 0", "LfanvrAn hour ago\nFun!.. with some hiccups\n\nLove this, tried it for PC a while back, wasn't that bothered about it but in VR it's a different story. Simulations like this are perfect for VR, I mean if your going to buy a game where your simulating real life how better than with VR.\n\nThe game is really fun despite being mainly cleaning, painting walls and placing furniture. If your like me and like to feel a sense of accomplishment in things your doing you'll love this. Buying your own house and doing it up is a fun aspect to it too.\n\nThere are some things that need improvement though. The movement for one as it's only teleport and can be tricky at times to get around, plus the sense of immersion would defiantly increase with locomotion for sure. I find it difficult to do things that should come easy like opening drawers and doors and find myself picking up things I didn't want to pick up far too often. Also placing objects is very sensitive when it doesn't really need to be, you should just be able to place them anywhere surely.\n\nAll in all its a great little game, it's cheap enough I'd say and I'm excited to see what updates they bring to it. Would love to see more ways to decorate your house and maybe some new tools. You could have different belts for different tools that would be cool. Oh and if anyone needs a longer brush, put it on seated mode lol.\n\nHelpful | 0", "ShankDaAlien2 hours ago\nGreat Game\n\nWas a fan of house flipper on console and got excited when it was announced it was coming to VR. Ok graphics but doesn't break immersion. Some items take some time to work out what they are.\n\nWould give it 5 star if you could have locomotion. Teleport gets quite tricky at times. Please developers add this feature.\n\nHelpful | 1", "Derpy_ManateeAn hour ago\nGreat so far\n\nNow I say so far because the game has been out for 6 hours and Ive been playing it for the last 2.\n\nI played the Xbox house flipper and I loved that so I assume Im going to love this one even more. Multiple mechanics have changed such as not having a long stick that you just wave around and clean dirt. Instead you have a small brush and a spray bottle.\n\nThere are more new mechanics like watering plants, and there appear to be infinitely more items in the store than on the Xbox.\n\nThe only problem I have is that I wish we had smooth locomotion instead of having to teleport but its still fun. Also sometimes you accidentally pick up an object so I wish you had more control over that. Just aiming a finger gun finger at an object for a second or two will pick up the object which I dont like. There have also been multiple times that I went to open the door of a shower and accidentally picked up the whole shower. But other than those two problems the game seems really fun.\n\nHelpful | 2", "shawn.labossiereAn hour ago\nGreat game\n\nLove the set up of the game but locomotion would be great cause teleporting every 5 seconds is really aggravating at times and I have to always have to keep adjusting myself cause of the snap turning with smoother turning it would def be 5 stars\n\nHelpful | 0", "Smugford122 hours ago\n\nGreat game for VR very relaxing to play through.. Only thing lacking is smooth locomotion which every game should have at this point as an option 4.5/5 worth a go if you're at all curious\n\nHelpful | 0", "aaron.sommers.125323 minutes ago\n\nLove it, but plz smooth locomotion.\n\nHelpful | 0", "darkwill435An hour ago\nWould be 5 but..\n\nWhen you buy a house the way to make it worth more is unkown it only add the price of the things you buy\n\nHelpful | 0"]