{"App Title": "I Expect You To Die", "App description": "** AGENT, YOUR EXPLOSIVE, FINAL MISSION 'OPERATION: DEATH ENGINE' IS NOW AVAILABLE **\n\nI Expect You To Die is a virtual reality puzzle game that places you in the well-polished shoes of an elite secret agent. You must attempt to survive deadly situations in immersive and dangerous locales. \n\nComplete each operation using problem-solving skills and wits oh, and the power of telekinesis that all our agents are equipped with. Use it and whatever resources you can find to escape each situation... or die trying.", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Exploration, Puzzle, Simulation", "Languages": "English", "Version": "1.0.141516", "Developer": "Schell Games", "Publisher": "Schell Games", "Website": "http://iexpectyoutodie.schellgames.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "NEWS\nABOUT\nAWARDS\nMEDIA\nSUPPORT\nBUY\nPrivacy Policy\n\nI Expect You To Die (IEYTD) is a virtual reality (VR) escape-the-room puzzle game that lets you step into the world of an elite secret agent. IEYTD is intended to entertain. This Privacy Policy describes how we use, share, and protect information that we collect from players of IEYTD.\n\nCOLLECTION OF INFORMATION\n\nWe may collect anonymized information from your play of IEYTD. Please note, IEYTD does not collect the players name, physical address, contact information, or any geolocation information.\n\nUSE OF INFORMATION\n\nWe use the information that we collect to analyze and improve our game and support the internal operations of IEYTD. We aggregate all information collected so that it cannot be used to identify any particular player.\n\nCHANGES TO THIS PRIVACY POLICY\n\nWe may revise this Privacy Policy, for example, to reflect changes in the law, our practices, or the features of IEYTD. These changes will be effective immediately upon posting. As a result, you should periodically review the Privacy Policy so that you are up to date on our most current policies and practices. By playing IEYTD, you agree to the terms and conditions of this Privacy Policy, and, by continuing to play IEYTD after changes have been made, you agree to the changes.\n\nSTILL HAVE QUESTIONS?\n\nIf you have any questions or concerns regarding this policy, please contact us at:\n\nSchell Games LLC\n\n220 W. Station Square Drive\n\nPittsburgh, PA 15219\n\nlegal@schellgames.com\n\n SUPPORT  MEDIA KIT  CONTENT CREATOR PROGRAM  PRIVACY POLICY  TERMS OF USE\nGAMES ABOUT CAREERS BLOG\n\n Schell Games. All rights reserved.\n\nOCULUS and the OCULUS Logo are trademarks of Facebook Technologies, LLC. All rights reserved.\n\n\"PlayStation\" and the \"PS\" Family logo are registered trademarks of Sony Interactive Entertainment Inc.\n\n \nFantasy Violence\nAlcohol Reference\nUse of Tobacco", "Developer Terms of Service": "NEWS\nABOUT\nAWARDS\nMEDIA\nSUPPORT\nBUY\nTerms of Use\nTERMS OF USE AGREEMENT\n1. YOU MUST AGREE TO THIS TERMS OF USE AGREEMENT BEFORE PLAYING OUR GAME\n\nThis Terms of Use Agreement (Agreement) informs you of the terms, conditions, disclaimers, notices and policies (collectively the Terms) that apply to your access and use of the game, I Expect You To Die (Game). This Agreement is a binding contract between you and Schell Games (Company, Schell Games, we, or us) and provides for important rights and obligations. By accessing and/or playing, downloading or browsing our Game you represent to us that you have read, understood and agree to be bound by this Agreement and all applicable local, state, national and international laws and conventions, including without limitation all intellectual property laws. Schell Games reserves the right, at its sole and absolute discretion, to deny any user access without notice. If you violate any of the Terms, we may, at our option, give you a warning notice of violation or terminate your account immediately for violation of the Terms.\n\nIF YOU DO NOT AGREE TO ALL OF THESE TERMS, YOU MUST NOT ACCESS OR USE OUR GAME.\n\n2. ELIGIBILITY TO ACCEPT AGREEMENT AND USE SITE\n\nYou must be at least 13 years of age to access and use the Services. There is no exception to this requirement. Schell Games does not knowingly collect any personal information from children under the age of 13 that falls within the Childrens Online Privacy Protection Act and Rule. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legal parental or guardian consent, and that you are fully able and competent to understand and accept this Agreement as a binding contract and to abide by all Terms.\n\n3. OUR RIGHT TO MODIFY AGREEMENT\n\nSchell Games may modify this Agreement at any time, with or without notice to you, by posting the modified Agreement on the Site. Your continued use of the Services after such modification shall be deemed to be your acceptance of any such modification. Any such modification will only apply to matters and events that occur following the date of modification. You may not modify this Agreement without the prior written authorization of an officer of Schell Games. It is your responsibility to check this Agreement regularly to determine whether the Agreement has been modified. IF YOU DO NOT AGREE TO ANY MODIFICATION OF THIS AGREEMENT YOU MUST IMMEDIATELY UNINSTALL ANY GAMES YOU MAY HAVE INSTALLED ON YOUR COMPUTER.\n\n4. POLICY ON PRIVACY\n\nThe Game includes a Privacy Policy relating to the collection, use and disclosure of your information. Please read the Privacy Policy provided on the Games website carefully. By playing the Game, you are consenting to the Privacy Policy.\n\n5. OUR OWNERSHIP OF THE SERVICES AND PROPRIETARY MATERIALS\n\nThe Services contain copyrighted material, technology, trademarks, service marks, trade secrets and other proprietary information, which may include computer code, text, data, video, images, illustrations, animations, sounds, musical compositions and recordings, audiovisual effects, color schemes, business methods and methods of operation, concepts, ideas, know-how, moral rights, and any related documentation (collectively the Proprietary Material). All intellectual property rights to the Proprietary Material, including patent, copyright, trademark and trade secret rights, are owned or licensed by Schell Games. You agree not to copy, download, reproduce, republish, upload, post, transmit, perform, display, distribute or sell, or in any other way exploit the Proprietary Material, or to participate with or to encourage others to engage in such acts, without the prior written consent of Schell Games. Moreover, you may not reverse engineer, disassemble, decompile, or translate any computer software programs that comprise Proprietary Material, or otherwise attempt to derive the source code of such programs, except to the extent allowed under any applicable law. If applicable law permits such activities, any information so discovered must be promptly disclosed to Schell Games and shall be deemed to be the confidential proprietary information of Schell Games. Nor may the Proprietary Material, or any portion thereof, be modified or used for any purpose other than as expressly authorized in this Agreement. The Proprietary Material may include materials licensed by Schell Games from third parties, and the licensors of those materials may enforce their rights in the event of any violation of this Agreement. ALL RIGHTS NOT EXPRESSLY GRANTED TO YOU IN THIS AGREEMENT ARE RESERVED BY SCHELL GAMES AND ITS LICENSORS.\n\n6. USER SUBMISSIONS INCLUDING USER-GENERATED CONTENT\n\nAll comments, feedback, suggestions, gameplay features, level designs, and other submissions (User Ideas) disclosed, submitted, or offered to Schell Games shall be the exclusive property of Schell Games. Unless otherwise prohibited by law, Schell Games may use, sell, exploit, or create derivative works from these User Ideas and, further, Schell Games may disclose these User Ideas to third parties or the general public, without compensation to you.\n\nYOU ACKNOWLEDGE THAT USER IDEAS AND USER-GENERATED CONTENT ARE PROVIDED BY YOU ON A COMPLETELY VOLUNTARY BASIS. SHOULD YOU NOT WISH TO HAVE YOUR USER IDEAS AND USER-GENERATED CONTENT INCORPORATED INTO ANY GAME OR WEBSITE FUNCTIONS, YOU MAY CHOOSE NOT TO SHARE THEM WITH SCHELL GAMES.\n\n7. GENERAL DISCLAIMERS\n\n(a) THE SERVICES AND ANY ACCOMPANYING DOCUMENTATION AND MATERIAL ARE BEING PROVIDED TO YOU AS IS WITHOUT WARRANTY OF ANY KIND WHATSOEVER. WITHOUT LIMITING THE INTENDED GENERALITY OF THE PRECEDING SENTENCE, Schell Games DOES NOT WARRANT THAT THE SERVICES OR ANY PORTION THEREOF (i) WILL BE UNINTERRUPTED, SECURE OR ERROR FREE, OR THAT DEFECTS WILL BE CORRECTED; (ii) IS COMPATIBLE WITH ANY SOFTWARE, INCLUDING WITHOUT LIMITATION INTERNET BROWSER SOFTWARE; (iii) IS FREE OF INFECTION BY VIRUSES, WORMS, TROJAN HORSES OR ANYTHING ELSE MANIFESTING CONTAMINATING OR DESTRUCTIVE PROPERTIES; OR (iv) IS FREE OF DEFAMATORY, DEROGATORY OR ADULT-ORIENTED MATERIAL, OR MATERIAL THAT SOME INDIVIDUALS MAY DEEM OFFENSIVE OR OBJECTIONABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, SCHELL GAMES DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE.\n\n(b) SCHELL GAMES IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OR OFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL SCHELL GAMES BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURY OR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATED CONTENT POSTED ON THE SITE OR TRANSMITTED TO ANOTHER USER, OR ANY TRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINE OR OFFLINE.\n\n(c) THE SERVICES ARE CONTROLLED AND PROVIDED BY SCHELL GAMES FROM ITS FACILITIES IN THE UNITED STATES OF AMERICA. SCHELL GAMES MAKES NO REPRESENTATION THAT THE SITE OR THE SERVICES ARE APPROPRIATE OR AVAILABLE FOR USE IN OTHER LOCATIONS. IF YOU ACCESS OR USE THE SITE OR THE SERVICES FROM OUTSIDE THE UNITED STATES, YOU DO SO VOLUNTARILY AND ARE RESPONSIBLE FOR COMPLIANCE WITH THE LAWS APPLICABLE TO YOUR LOCATION.\n\n(d) BECAUSE SOME JURISDICTIONS PROHIBIT THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\n8. LIMITATION OF LIABILITY TO THE FULLEST EXTENT ALLOWED BY LAW\n\nSCHELL GAMES, INCLUDING ITS OFFICERS, DIRECTORS, SHAREHOLDERS, EMPLOYEES AND AGENTS, SHALL NOT BE LIABLE TO YOU FOR ANY DAMAGES OF ANY KIND, INCLUDING BUT NOT LIMITED TO DIRECT, INDIRECT, COMPENSATORY, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF THE SERVICES, EVEN IF ADVISED OF THE POSSIBILITY OF SAME. YOU UNDERSTAND AND AGREE THAT SCHELL GAMES CANNOT AND WILL NOT BE RESPONSIBLE FOR ANY LOSS OF YOUR USER GENERATED CONTENT OR ANY INTERRUPTIONS OF SERVICE, INCLUDING BUT NOT LIMITED TO ISP DISRUPTIONS, SOFTWARE OR HARDWARE FAILURES, OR ANY OTHER EVENT WHICH MAY RESULT IN A LOSS OF DATA OR A DISRUPTION OF SERVICE.\n\n9. INDEMNIFICATION\n\nTo the maximum extent permitted by law, you agree to defend, indemnify and hold harmless Schell Games, its offers, directors, employees and agents, from and against all claims, damages, obligations, losses, liabilities, costs or debt, and expenses (including but not limited to attorney fees) arising from your use of the Services, your violation of any of the Terms, your violation of any third-party right, including without limitation any copyright, trade secret, privacy or property right, or any claim that your User-Generated Content caused damage to a third-party. This defense and indemnification obligation will survive this Agreement and your use of the Services.\n\n10. GENERAL PROVISIONS\n\nAny dispute arising out of this Agreement shall be resolved in accordance with the laws of the Commonwealth of Pennsylvania, USA without reference to its conflict of law provisions. You agree that any claim asserted in any legal proceeding by you or Schell Games shall be commenced and maintained in any state or federal court located in Allegheny County, Pennsylvania, USA, having subject matter jurisdiction with respect to such dispute. You and Schell Games agree to submit to the personal jurisdiction of such court. The prevailing party in any such proceeding shall be entitled to reimbursement of court costs, including a reasonable attorney fee, in addition to any other remedy awarded. In the event any provision of this Agreement shall be held by a court or other tribunal of competent jurisdiction to be unenforceable, such provision will be enforced to the maximum extent permissible and the remaining portions of this Agreement shall remain in full force and effect. You may not transfer or assign any of your rights or obligations provided in this Agreement without the express prior written approval of Schell Games; Schell Games may assign this Agreement without restriction of any kind. No failure on the part of Schell Games to enforce any provision of this Agreement shall be deemed a waiver or consent. This Agreement constitutes and contains the entire agreement and understanding between you and Schell Games with respect to the subject matter hereof and supersedes any prior oral or written agreements or understandings.\n\n SUPPORT  MEDIA KIT  CONTENT CREATOR PROGRAM  PRIVACY POLICY  TERMS OF USE\nGAMES ABOUT CAREERS BLOG\n\n Schell Games. All rights reserved.\n\nOCULUS and the OCULUS Logo are trademarks of Facebook Technologies, LLC. All rights reserved.\n\n\"PlayStation\" and the \"PS\" Family logo are registered trademarks of Sony Interactive Entertainment Inc.\n\n \nFantasy Violence\nAlcohol Reference\nUse of Tobacco", "Space Required": "897.8 MB"}



["5 stars\n87%\n4 stars\n10%\n3 stars\n2%\n2 stars\n1%\n1 star\n1%", "codesmajodes20 days ago\nAddictive!\n\nThis is my favorite VR game by far. If you love escape rooms and espionage, you need to play this game. The puzzles are a little tricky, but once you get the hang of what is POSSIBLE IN THE GAME (which is more than I expected!) it gets so fun. I love this game. I wish there were more levels or part 2!\n\nHelpful | 15", "DreaMonger6 days ago\nBest Game on my Quest!\n\nI absolutely love this game. If youre a fan of escape rooms, puzzles, and a James Bond style setting, you will love this game. There is about 6-8 hours of playtime, depending on how quickly you figure out the puzzles. I had a blast making new discoveries, figuring things out, and listening to the narrator quip about what I was doing. I cant thing of a negative thing to say about the game. Beautifully executed, and a seated experience, so no headache or motion sickness!\n\nHelpful | 6", "KMan1258Jul 26 at 5:02 PM\nBest game on Quest by far.\n\nIf you want to spend money on a new game or just qanting to find some game to start playing with your quest, this is the game you need to get! It may be short, but by the amount of difficulty in it, it feels like it goes on for avout 27 levels. The answers are like right in front of you but you get the lightbulb in your mind when you figure it out. That's what makes a game great!\n\nNot only is the game amazing, but this is one of the only games I've ever played, Quest or not, that has such a cool credits/introduction to the game. The song is so catchy, and the scenes that you go through are so real feeling like.\n\n\nI recommend this to anyone who wants to feel like a spy or anyone who likes escape rooms and breaking out!\n\nHelpful | 12", "Jedipotato1234May 25 at 8:48 PM\nAbsolutely amazing a bit too short\n\nI dont blame this game for being to short because most puzzle type games cant really have that much content.\nYou may have read reviews talking about how the 7th level is too hard because they have to rememberers code. the game is not that hard its fairly easy (for a puzzle game) but still challenging enough that you feel satisfied when you solve a puzzle.\n\nI love this game and its only real flaw is that its to short but all good things must come to an end.\n\nHelpful | 130", "BadgersIncJun 20 at 11:10 AM\nI don't review much but...\n\nThis has got to be one of the best \"casual gaming\" games of all time. I just couldn't let it go until I completed all the missions. I works so well on the quest sitting in a nice chair. Now I just have to forget all the solutions so I can play it again another time. Cheers to the crew behind this thrilling game.\n\nHelpful | 19", "ThomTom12 days ago\nOne word Incredible\n\nIf youre into escape rooms then this is definitely the game for you it is so immersive and even the Music is great. Some people argue that this game is short but to be honest this game has still given me hours of fun with me and my family.\n\nThis game is 10/10\nBut as a suggestion maybe a hints option for the levels.\n\nIf youre undecided you should just take the plunge and buy the game you wont regret it. :)\n\nHelpful | 0", "HotCoz3 days ago\nExcellent!\n\nVery original fun puzzle game with excellent humor, atmosphere and progression. Great to play with friends watching on a casted TV and solving puzzles together.\n\nOne request: please add a guest mode so friends can play and get the introduction/tutorial; otherwise I have to explain to them how to play!\n\nHelpful | 0", "OzDadGamer3 days ago\nFunny, kitschy, and fantastic!\n\nWith its 60s Bond setting and feel, this game is a series of super enjoyable VR \"escape rooms\". None of the puzzles are frustrating or obtuse enough to bring your progress to a grinding halt, and even when you die (which you will - a LOT), you usually understand why, and how to avoid it next time.\n\nGraphics are clean and crisp, the controls are straightforward and very well explained in the tutorial, and loading times are short, which is always a plus.\n\nHighly recommended.\n\nHelpful | 1", "paszekjJul 12 at 5:19 PM\nFavorite Quest Game\n\nThis game is so well-done. Fluid game play. Not a single bug. I think the puzzles are just the right challenge level: Hard enough that you will get stuck at times and need to take a break and start fresh, then all of a sudden youll figure out something you missed the first time. As others have said, its not the longest game. I felt like I got plenty of entertainment out of it for the price. Would love to see addiitional levels.\n\nHelpful | 6", "RobotMonkey189 days ago\nAmazing Game!\n\nThis game is great for people who like puzzles or escape rooms. Once you beat the game, you can still revisit the levels and have more fun. I would definitely recommend this game for anyone who is considering it.\n\nHelpful | 2", "ElectricFlash1012 days ago\nBest game ever\n\nWhen I first saw this game I did not expect how much fun it would be. I just got into V.R I played games like super hot Vacation Simulator but this takes the cake! Super fun to mess around and just play with everything and challenge your mind. If you are thinking about getting this game dont wait buy it now thank me later.\n\nHelpful | 1", "Saela111810 days ago\nOne of the best apps I own\n\nI finished this game a while ago but I just wanted to say how AMAZING it is. It was all I played for the entire time the story when on. I just completely plowed through it. Ive been waiting ever since for the second one to come\nout. They even said that it will return.\n\nHelpful | 0", "payam.pourghassem10 days ago\nAmazing game\n\nOverall amazing experience would recommend. My favorite part is doing the speed run challenges. I love this game. One of the best spy games Ive played on all of VR, and Ive played many spy games.\nHopefully you guys will make a sequel or more levels. Please Im begging you. But either way I LOVE this game and I wont stop loving it no matter what.\n\nHelpful | 1", "Manhopper17 days ago\nEscape room...amazing\n\nWhat a polished game. I am on the first stage where you need to find clues in order to drive the car off the plane. Terrific graphics, the puzzle is not easy, the playability is perfect. It really does what it says on the tin. You actually feel like Columbo, a cigar is included which you can actually smoke too just one more question! Splendid escape room game\n\nHelpful | 0", "RyderClan20 days ago\nIncredible\n\nThis game is quite possible my favourite puzzle game of all time (including PC and console games) - its challenging, interesting and great fun. Yes there arent tons of levels but the levels are so perfectly made and well polished that it makes up for it. Everyone that has played this game is praying for more levels so lets keep that trend up\n\nMORE LEVELS <3\n\nHelpful | 0", "blueey534820 days ago\nA wonderful and clever experience!\n\nEven after reading other reviews and looking at demo pics, I wasnt sure what the gameplay would be like. After starting the first mission, I realized it was like a brilliant Escape Room in VR.\n\nThis game is so clever, so fun, and challenging. You get a major sense of accomplishment after you solve the big and small pieces sprinkled all throughout the game. I hope they release many more missions in the future.\n\nHelpful | 1", "blister90Jul 12 at 10:10 AM\nAWESOME GAME MUST GET IT!!!!!!!!!\n\nThis is one of the best games out on the oculus quest!\nmost puzzle games are boring and dull but this game is not the puzzles are awesome and the story line is awesome too and the last mission is perfect and so are all the other ones!\n\n\nPS if the creators are seeing this just know Please make a number 2 of the game or something please?!?\n\nHelpful | 3", "VegasFritts4 days ago\nGreat game\n\nCan be a little stressful but comically so. Loved all the puzzles and its fun to watch others play thru the levels as well. Entertainment all around! Would love some more levels or another story line one day\n\nHelpful | 0", "PirogenX3 days ago\nShort but good\n\nGame is very short but the few levels are great. They are immersive and a little challenging.\n\nA couple of them I managed to get through on the first go.\n\nWould be great to see more levels released.\n\nHelpful | 0", "TanSnyde16 days ago\nAmazing!\n\nThis game is sooo fun and challenging, a bit short but the operations are challenging and take a while to complete so that makes up the shortness. Some of the operations where so challenging I had to look up a YouTube video walkthrough. Must have game.\n\nHelpful | 0", "willardsVR5 days ago\nAmazing!!!\n\nLoved this game! What the game sort of lacks in length it makes up for in the amazing puzzles and gameplay. If you really want a game that shows off what the quest can do and how well it can do it get this game!\n\nHelpful | 1", "IfanSOJul 29 at 12:55 PM\nThrilling\n\nThe games story is amazing the parts that make you think and just the hilarious plots about the enemies plan to end the world. Even after finishing the game you still get to do it again to complete the speed runs and collect all the souvenirs to mess around with your office. this is an easy 5 stars and really recommend getting it.\n\nHelpful | 1", "jrrrrrApr 4 at 11:06 PM\nLike No One Lives Forever, Evil Genius\n\nI'm a sucker for the 60's spy aesthetic of old Bond films and this game had its hooks in me immediately.\n\nI've had an itch that I haven't been able to scratch since Evil Genius and the No One Lives Forever games.\n\nI'm so happy to get anything new in the genre. The fact that it's in VR and executed so well is gravy on top. I could watch the intro and credits every day.\n\nHelpful | 173", "Hammad1988Jul 30 at 12:51 AM\nAwsome !\n\nThe challenge is when you get frustrated from dying multiple times from the same mistake or others, but you put the headset and keep playing until you solve it !\nThis is what i love about the game.\n\nHelpful | 2", "Ttarts6 days ago\nGreat puzzle game for the family!\n\nMy whole lives this game. It is like a virtual escape room but you have multiple experiences to solve. I highly recommend it, as has been one of our favorites.\n\nHelpful | 1", "BombchelleeeMay 1 at 7:36 AM\nAwesome Game\n\nThe story is engaging. The missions are challenging and creative. This game is so much fun! I have died so many times from blowing myself up to drowning myself. Eventually I figure out how to complete the missions, and I laugh at myself and all of the fatal mistakes I made along the way. I don't want it to end!\n\nHelpful | 40", "peter.lygo.489 days ago\n\nGreat game takes some working out lol  but that is the what gets you hooked  would highly recommend this game \n\nHelpful | 1", "LBC832Jul 18 at 6:21 PM\nVery professional high quality have\n\nI know saying a game is \"professional\" sounds boring, but it really makes a difference when you notice the little touches of a game. The main character's voice is great, and the script is peppered with just enough comedy to make this game shine. Thank you developers for your effort! Great game.\n\nHelpful | 1", "lost007license21 days ago\nLove this game\n\nThe puzzles and the feel of the game really line up. The intro is so creative. Ive watched it a few times just to go through it again and again. I cannot tell you how much I love this game. Just try it out.\n\nHelpful | 0", "YellowSh0rtBusA day ago\nHonest Review\n\nThis was a fun little experience with lots of clich Bond moments. I mean this high praise. I absolutely loved the intro sequences art style!\n\nThe game is overall great and you should definitely pick it up. I was never bored and enjoyed each mission. I never felt too challenged, but maybe having the player quickly progress past their failures was the intent of the developers.\n\nMy only problem is just as the game felt like it was getting good it was over. Its really the only reason for 4 instead of 5 stars. I was starting to really get into this universe and it was over. Sure, I could go back and try to get all the trophies but the end of each mission is the same. Maybe they have more plans for this game. Its certainly setup to scale easily, but I was just hoping for a little more play time.\n\nEither way, dont let this one slip past you. Its a fun, lighthearted game that almost anyone would enjoy.\n\nHelpful | 0", "SpringAnt20069 days ago\nAmazing you should buy\n\nSo if it is either this or another game like climb you should get this There a tons of missions and each takes a hour.\n\nHelpful | 1", "Yeetboygg5 days ago\nBest puzzle game ever\n\nI played this game for hours at a time it is the best puzzle game ever\n\nHelpful | 0", "sjbackho25 days ago\nFive stars for sure ... please add more\n\nA+ experience... Dev's please please keep adding on to this game. Begging you to add some additional missions so we cam all keep playing. Money well spent great job guys\n\nHelpful | 0", "HolmesJDJul 3 at 12:16 PM\nFun and creative puzzle game\n\nThis is a fun, spy-themed escape room game that you can enjoy sitting down. The different scenarios are not so hard that you get frustrated but are difficult enough that you enjoy the challenge (and dying multiple times) to solve them. My husband and I have discovered that we have used different methods to get out of our precarious situation and it makes me want to go back and try different things. In that regard, there is some replayability.\n\nDefinitely worth the purchase if you like a puzzle!\n\nHelpful | 1", "lolmaster586May 6 at 4:17 PM\nPuzzles and Achievements\n\nthere is a decent amount of levels each with their own amount of difficulty and challenges. Also even when you complete the game their is still so much to do. Like the speed runs and trying to figure out the achievements you can do. Also when the game is finished their is a commentary button which makes the game a little more fun and let's you see what the developers were thinking at the time of creation. Finally DO NOT CONSULT A GUIDE it ruins the whole experience and makes the game to easy. this game is a definite pick up for people who like puzzles and complexabilty.\n\nHelpful | 17", "godspeed20188 days ago\nA good game\n\nI really liked this game I hope theres going to be more of this game\n\nHelpful | 1", "Diecast6287 days ago\nAmazing game\n\nI'm giving it 5 stars because I really thought I was James bond\n\nHelpful | 1", "15doggoJun 23 at 6:40 AM\nBest game ever\n\nI love 60's spy movies and stuff like that, I already had my eye on that game even before I got my headset before I got a quest, and you can interact and play with nearly anything in the world and that makes the game so great and the story is very good as well.13/10\n\nHelpful | 2", "RustyBoy12057 days ago\nThe best game\n\nGreatest games in the oculus store easily worth 25 bucks\n\nHelpful | 1", "ABunchOHippies13 days ago\nAmazing game\n\nThe puzzling escape rooms and fun stories make this game an absolute must have.\n\nHelpful | 0", "CookieSquidJul 8 at 1:29 AM\nShort but incredibly Sweet\n\nThis may feel a bit like a very long demo, as does Untitled Goose Game and many VR titles. However, the experience is almost certainly worth it, and the spy thriller feel is basically perfect. This, despite being an escape room, is fairly replayable.\n\nHelpful | 1", "Perp-LexJun 2 at 9:49 PM\nVery good experience...\n\nThis was one of the first game I purchased after receiving my Quest, and it is one of the best standalone experience I have experienced on vr to date.\n\nI had one of my friends try it out right after Vader Immortal as his first games and he got totally hooked and played for 3 hours straight, finishing the first 3 missions.\n\nThe interactions are a lot of fun and you really have to work hard(ish) for every step of each situations. Some say they completed it in 2-3h but it took me about 4 or 5 in total, as I didn't finish it in one go.\n\nAll in all, if you enjoy vr and somewhat chaotic puzzle games then this one is a must.\n\nEnjoy yourselves !\n\nHelpful | 3", "SniperHobbezApr 28 at 4:13 AM\nOne of a kind ! One of the best !\n\nThis is one of the best games on the Oculus. Everything feels responsive and the puzzles really make you think outside of the box! The game only has a hand full of levels maybe around eight. I would say the lack of more levels is the only downside but from what Ive seen they have already added two levels within the last year. If you like doing puzzles and escape rooms this is the game for you!\n\nHelpful | 15", "joe90224 days ago\nJoe\n\nThis game is amazing gets you thinking a lot just wish there was more keep up the good work and bring out more cheers\n\nHelpful | 0", "NickthebrickJul 10 at 8:08 PM\nFavorite\n\nDude, I wanted this game for a lot of time, and when I was going to buy one, I forgot this one, until I did buy it, and it is amazing, if you guys do a sequel, I would buy it, this game is highly recommended in my part, good job\n\nHelpful | 0", "thrillmeup9 days ago\nAn escape room in your living room!\n\nSuch a fun game. Would pay for more levels!\n\nHelpful | 0", "f_ryb15 days ago\nAmazing entertainment\n\nFor those who like escape room like quests, this is a must have!\n\nHelpful | 0", "b._freddieJul 18 at 7:11 AM\nGreat game.\n\nThis game was a very well thought out game, and a real brain teaser. Ive been looking forward to playing it since I got my headset, and it surpassed my expectations by a mile.\n\nHelpful | 0", "yourfutureself6 days ago\nVery cool\n\nI love this app\n\nHelpful | 1", "XdBaconBoy0918 days ago\nGreat game.\n\nThis game is one of my favourites on the quest and I highly recommend it.\n\nHelpful | 0", "MikeyDidItJul 25 at 1:41 PM\nGreat escape room type game\n\nHope they make a second or more like it. Would love for more of an open continuous environment for the next one than small mini rooms\n\nHelpful | 1", "MajorDGamerJul 11 at 6:16 AM\nAmazing game with amazing story\n\nI had a lot of fun beating this game, and Im currently trying to get every achievement in the game! The graphics feel like youre really there, and the story is phenomenal!! Great job on this game!\n\nHelpful | 0", "PythenJul 28 at 5:45 AM\nBest game\n\nI must have played the game 20 times it never gets boring you always figure out new tactics and it gets you thinking\n\nHelpful | 0", "kelsbo1711 days ago\nLove it!\n\nThe puzzles are hard and take awhile to solve. Really entertaining. Love al the extra stuff you can explore and play with.\n\nHelpful | 1", "zoiks_ruhrohJul 17 at 12:16 PM\nFun fun fun\n\nGood humor and puzzles to work through to complete each mission. I'm not always the brightest so I had to look up how to get by a few areas that had me stumped lol.\n\nHelpful | 0", "ethan.wile16 days ago\nGreat game\n\nFun puzzles, I just wish there was more!\n\nHelpful | 0", "obi2kenobiJul 8 at 11:46 AM\nIncredible graphics, detail, immersion\n\nThe graphics are some of the best - maybe on par with Red Matter.\n\nThat combined with the incredible detail of each scene (readable notes/newspaper, many interactive objects, even ones that are just for fun) really help it feel like an actual virtual world.\n\nThe puzzles are fun, and make you think quickly which can pump your adrenaline. The narrator guy is pretty funny.\n\nI give it 4.5/5 is because I find it very tedious to repeat certain actions 100 times, as you restart each level when you die. I must have spent at least 15 minutes pouring stupid fuel into an engine because I kept dying on a certain level. I personally think the better solution would have been to allow a continue or a limited amount of continues per level try. I just don't see the benefit or point of having to restart the level over and over.\n\nIf this were fixed it would be an easy 5 stars. Easily one of the most polished titles on Quest.\n\nThere are some cool end-game features like optional commentary bubbles you can click to get a behind the scenes \"making of\" type view of the game. There are also achievements for every level. Only thing that bothers me about the achievements is some of them are vague and it won't tell you how you can accomplish it (I can't get make it rain or guns away, and I've tried things that make sense to me like throwing money out the window, or shooting out windows. Very frustrating)\n\nHelpful | 1", "OculusIggy90Jul 27 at 8:46 AM\nA nice puzzling experience\n\nI'm new to vr but this is a good experience when first getting into it. Not too much moving and the puzzles make you think outside the box here and there. Punishment is a bit harsh but there's not much slowing you down once you get the hang of each scenario.\n\nHumorous, challenging yet not too motion heavy and enjoyable experience when playing this game.\n\nHelpful | 1", "imperfect-key478Jul 26 at 9:43 AM\nAmazing, purely amazing\n\nStunning work on this game, it is great fun with amazing replay value with challenges on every mission. We need dlc for this because I honestly love it. If you love puzzles and spy movies, this is a must have for your oculus collection.\n\nHelpful | 1", "CrazyApe433Jul 14 at 1:51 PM\nThis game is great\n\nIt was sooo fun and the latest mission was amazing and cool. If I could give it more than a five star I would. I hope they make a new mission soon.\n\nHelpful | 0", "Badinga901219 days ago\nEpic\n\nVery cool and very epic me like\n\nHelpful | 1", "mrrealerJun 13 at 6:42 PM\nSo glad I bought this game. So engaging!\n\nThe game is very fun. I finished it in 2 days or maybe 4 hours, but it's really a lot of fun once you get a hang of the controls. The boss level was a bit confusing at the start, but I was able to finish it and will definitely play this one again to get the rest of the souveniers. I really think the devs took their time with this one and it shows. It's basically a James Bond type game from the 60's and maybe the 70's think Sean Connery and Roger Moore Bond.\nThey have an \"Octopussy\" themed challege, and even a \"Moonraker\" themed challenge as well. I really liked the one on the train in India. So fun! Anyway, this is my first review. Most of the games besides the fitness games, I play once and once I am done, I'm done. But this one, I think I will play again and again. Thanks for making this one! I am looking forward to the next one.\n\nHelpful | 1", "chris_supko21 days ago\nExcellent game\n\nI love this game, it is very engaging and fun\n\nHelpful | 0", "scottle9erJun 12 at 9:22 PM\nA Blast!\n\nThis was the first (and so far only) game Ive purchased on the Oculus. It sucked me in immediately. I love solving problems and the touch of espionage and thrill of not wanting to die made it that much better. The graphics are impressive and is comparable to any real life escape room. Hopefully they add more levels/missions or are working on a second one. Do not google any help tips; thatll ruin the fun! The extra features of collecting souvenirs and speed times makes it a multiple use play. Even playing a second time around its hard to remember exactly what was needed the first time to STAY ALIVE! This one is worth it!\n\nHelpful | 0", "turbojwmJul 25 at 7:50 PM\nOne of my favorites...\n\nI am starting this one again just a couple months after finishing and still enjoying it!\n\nHelpful | 0", "gbatterbee19 days ago\nGreat fun to play\n\nWish there were more levels\n\nHelpful | 0", "Duballer90715 days ago\nepic\n\nBig PP\n\nHelpful | 0", "AlmondAnthonyJun 11 at 8:52 PM\nAmazing challenging experience\n\nI expect you to die completely surpassed my expectations. Ive already seen this game on YouTube, and immediately wanted to give it a try. This game has a ton of replay value, and once you beat the final mission, youll find yourself coming back again and again. While there are only a few missions, the design and mechanics of these levels are spectacular. The challenge is amazing as well. When you die(and you will a lot(, you dont feel frustrated, you just learn not to to said thing again. The voice who guides you also has a great sense of humor. Overall, this game is Superb. 10/10.\n\nHelpful | 1", "BattleYellow16 days ago\nMy favorite game\n\nBest game ever\n\nHelpful | 0", "Dibz1977Jul 22 at 4:32 PM\nThe experience was amazing\n\nOverall a good game it was a little short but no bugs and I like the plot and achievements.\n\nHelpful | 1", "buckettssJul 7 at 9:30 AM\nFun and complex(for the most part)\n\nI loved it from start to finish. The last mission made my a little salty because I didnt know what it do but i figured it out but over all amazing game!!!\n\nHelpful | 0", "JackNCheese42Jun 30 at 4:35 PM\nI love this game!\n\nThis is a great game. Some of the challenges are harder than others, but is still satisfying when you figure it out. I highly recommend this game. The only problem is that it ends to quickly!\n\nHelpful | 1", "CharzamJul 18 at 4:58 PM\nWorth it\n\nOne of my favorite games on the quest. It has a lot of replay value, and the controls are wonderful.\n\nHelpful | 0", "Starman405May 15 at 8:18 PM\nPossibly the Best VR Puzzle Game?\n\nI am a sucker for puzzle games, like please dont touch anything, the room, and super hot VR. This game however, takes the proverbial cake. With the title alone, a reference to a James Bond movie, I was sucked in. When I purchased the game, I expected a run-of-the-mill puzzle game. What I did not expect however, was an incredibly made game in virtual reality, with countless solutions, some of which are ridiculous. In this game, if you can think of a possible solution, there is probably an achievement for it.\n\nHelpful | 3", "jimjimwaterJul 24 at 11:19 AM\nAmazing game\n\nThis game is one of the best vr games Ive played\n\nHelpful | 1", "Robertobob100Jul 18 at 5:47 PM\nOne of my favorite games!!!\n\nAll I'm going to say is it's well worth it. The developers clearly put a lot of time into making it and continue to add more content.\n\nWith the Quest's hand tracking becoming a bigger deal it would be cool to see an expiramental hand tracking mode for this game. I understand that it probably won't work the best but it would be cool to have it just for the fun of it.\n\nThanks again for an amazing experience!\n\nHelpful | 0", "shadowtrooperJul 3 at 8:51 AM\nMy favorite oculus game so far\n\nThis game is super fun! Its pretty laid back but stimulating. Has some replayability if you try to get all of the achievements. Highly recommended!\n\nHelpful | 0", "Proffeser_FlashJun 30 at 12:02 PM\nVery good game\n\nThis was a Great game. When I got my oculus quest the first game I bought was this because all the YouTube videos that I watched It just made me want to buy it more.\n\nHelpful | 0", "DanCool99Jul 17 at 9:45 AM\nBest spy game ever!\n\nIt is very fun and it is really interesting and I love these types of games\n\nHelpful | 0", "ElatedRandomnessApr 14 at 4:56 PM\nWould recommend for any oculus owner\n\nThe game is very fun and contains a surprising amount of content for the 7 or so missions. Its a very clever puzzle game with some humor and action mixed in. Even my friends who arent into puzzle games whatsoever love playing the game and finding Easter eggs. I would recommend this game for any oculus owner.\n\nHelpful | 9", "BexoloMay 31 at 8:45 AM\nFavourite experience on Quest\n\nI love this game so so much, and Im tempted to call it my favourite VR experience on Quest. Its kind of like a VR escape room., with a secret agent/classic bond feeling. You die so many times, which is frustrating, but its just part of the learning process to complete the mission so you know what NOT to do on the next try.\n\nIt took me a very long while to figure out the first level and the general idea of the game, but once you know what youre doing, everything falls into place. Also, its quite fun to play with friends/partners when youre casting.\n\nThe levels are challenging, engaging, and require you to think fast and plan ahead.\n\nEven the opening credits got me instantly hooked, and as soon as they started I knew it was going to be a quality game. A marvel of an experience, and super immersive.\n\nEXACTLY how VR should be! Thank you for making this game! I look forward to buying the sequel.\n\nHelpful | 0", "dpatel0509May 30 at 12:46 PM\nBest spy game\n\nAt first I was hesitant about pursuing this game, but read so many good reviews on it and decided to give it a try. And I am so glad that I did. I loved every level of this game. I probably died million times, got frustrated as well, but it was definitely well worth it. I just wish there were more level options. Otherwise the game overall is amazing.\n\nHelpful | 0", "Alexjr03Jul 14 at 12:22 PM\nAmazing\n\nThe game is amazing. It is really fun and immersive and also really funny!\n\nHelpful | 0", "LioPrimeJul 6 at 2:00 PM\nOne of the best games Ive played\n\nOK OK OK OK OK what uhh Yeet!!!!! Dont mind this part of the review just the title is important OK.\n\n\nHelpful | 0", "diamondE4gle22 days ago\nAbsolutely amazing but to short\n\nI got this game on my oculus and played a couple levels the next day I did 2 more. But that was it theres no more the first 7 levels where awesome but it just needs a couple more.\n\nHelpful | 0", "flyfourMay 29 at 2:43 PM\nA masterpiece\n\nI recently got my hands on an Oculus quest and so I started looking for games to play and one of the games that stood out was I expect you to die. It has an amazing James Bond film worthy sound track. Played extremely well and has many missions that were quite puzzling. Overall the game is worthy of a five star review and a buy if you don't have it yet.\n\nHelpful | 1", "ares466May 28 at 5:43 PM\nAwesome Escape the Room\n\nThis game was a lot of fun. You'll find yourself in unique humorous situations in which you need to escape.\n\nThe puzzles are hard without being annoying - it never relies on you finding some miniscule clue. Some of them are quite clever.\n\nThe souvineers - additional objectives - are a nice bonus as well.\n\nAll in all, this game was well worth the cost.\n\nHelpful | 0", "Lego22May 28 at 5:35 PM\nOne of the best VR games I've played\n\nFirst of all the starting sequence is great. This game is trial and erroresk you can beat it on your first try but you need to know how to think smart and quick. Even if you don't have those skills it has fun gameplay and cool puzzles that make you feel like a spy. The game has a lot of funny quips to give you and a pretty serious ending so far. I highly recommend this game.\n\nHelpful | 1", "FlexGod279Jul 15 at 8:36 AM\nMust Buy\n\nThis game is GREAT and 100% a Must have Oculus Title.\n\nHelpful | 0", "Tim.DowdingJul 11 at 2:10 PM\nFans of Evil Genius rejoice!\n\nIf you love Evil Genius, 007, or Austin Powers youll love this game!\n\nHelpful | 0", "DatevisMay 25 at 10:30 PM\nOne of the best VR experiences!\n\nThis game is one of a kind game and it only takes you until the opening credits to see why. The game in my opinion was worth the money already only after watching the credits and overall this is an extremely polished game with fantastic puzzle solving mechanics and an overall very intriguing story element to boot! Even if you know nothing about this type of game genre you will have a fun time, or die in the prosses.\n\nHelpful | 0", "AaronOQMay 26 at 11:56 AM\nNailed it..\n\nThis is one of my top rated games.. after very long time a game which engaged me so much that i keep thinking how to crack the level..\n\nEverything in the game is for reason.. you just need to use brain to know how to use them...\n\n\nOne of the best thing this give you flexibility to sit and recharge you and quest after heavy room-scale workout games\n\nLook forward to more levels ..\n\nHelpful | 0", "AetrozJul 4 at 2:32 AM\nSuper amazing game\n\nThe game made me jump in excitement. The puzzles were fun and difficult to do. Which is why it is fun.\n\nHelpful | 0", "seanhandleyJun 19 at 11:52 PM\nHilarious\n\nWe play this with Chromecast on the TV so the whole family can get involved. Its really entertaining and fun and becomes a collaborative effort figuring out the puzzles.\n\nHelpful | 0", "bhhsmikeFeb 29 at 9:05 AM\nTurn on the commentary!\n\nI absolutely loved this game and it was well worth the money. Play time was good. Do not look up anything online or use tutorials you will only rob yourself. There were so many times I came close to giving up, but it was so gratifying once I figured it out myself. The Devs did an amazing job. After I finished the entire game I was playing around in the office and found a button next to the radio that turned on commentary buttons throughout all the levels. I played the whole game again with the Devs commentary and it was really fascinating hearing why they did certain things, things they changed and where ideas came from. Hope they add more missions and would happily pay for more.\n\nHelpful | 64", "sueannecMay 25 at 4:56 AM\nLoved it and will play it again\n\nThis is one of my first games and I have been hooked. Ive literally played for hours until my fingers are cramping so bad that it forces me to stop! Very immersive and so well executed. The whole style and sound effects are old school spy which makes it really cool and unique. If you enjoy puzzle games or escape rooms you have to get this - its challenging, creative, engaging and FUN! I finished the last mission tonight and was sad to have completed them BUT I want to go thru them all again to collect all the souvenirs and beat my time. Desperately hoping they bring out another one!\n\nHelpful | 0", "Moist_Lettuce27Jul 6 at 5:05 PM\nGreat Game But...\n\nThis is probably one of if not my favorite puzzle game on the oculus quest. The level design, gameplay, mechanics, story, etc all are wonderful. The only problem I have with this game is the content. If this game had an extra level or two and each level had a little bit more added this would easily be a 5 star. I might just be picky and one of those guys but I feel as though there should be a little more content. Overall this game is easily a must have those are just my minor complaints.\n\nHelpful | 0", "Kleine_SophieJun 8 at 4:12 AM\nI love the game\n\nI am playing the game for a while now and still love it. There are plenty of levels, so it ot worth your money. Interacting with things could be a bit more precise, but that should not keep you from buying the game. I recommend.\n\nHelpful | 0", "LJFireMay 24 at 6:37 AM\nFantastic!!!\n\nEverything from the concepts to the interactivity to the puzzles are just top notch. I'm still new to VR and shelling out 30-40 bucks for a 4-5h game seems pretty daunting. But the object handling feels smooth and natural, the environments are interesting and really give off the old James Bond-esque spy feel. Puzzles are just challenging enough to creat those \"oohhh\" lightbulb moments.\n\nHelpful | 1", "mikeymike589May 24 at 2:20 AM\nBest Game on Quest so far\n\nAfter a year and about 15 games (many I've sent back) this is the most fun I've had on the Quest. Firstly, I've found I don't really like novelty games like Beat Saber - I prefer ones where you're transported to a different world. This one is a '60s spy thriller and basically comprises a number of escape rooms. They're pitched at just the right level: neither too hard or too easy. A couple of times I laughed out loud at having missed an obvious solution to a problem. A very slight drawback is you can't save where you get up to in a particular adventure which means every time you get killed (which is very often) you have to go back to the start. It usually only takes a minute to get back to where you left off but it can be a bit boring going through it twenty times in one sitting. It's also a bit on the short side - it lasted me a week. But that's part of the nature of this kind of game - unlike a shoot 'em up which you can play over years, once you've finished it it's pretty much ended. But apart from these slight niggles, a brilliant game\n\nHelpful | 1", "bill.kunstlerJun 4 at 10:05 AM\nThe best\n\nSimply the most fun game I've played on the Oculus. Addictive, clever, funny, challenging... again, just the best. I'm just praying they keep adding missions, because I don't want it to be over. Don't hesitate to buy, you won't be disappointed.\n\nHelpful | 0", "michelle.george.7169May 24 at 3:18 AM\nQuirky brain teaser\n\nIve only completed two missions but had so much fun in the process. The puzzles are great and can be solved via trail and error. The humour is also a nice touch as is its 007 references. The mechanics and use of the quest controllers is extremely clever and better than most other games Ive played on here. 5 star from me. Looking forward to my next mission\n\nHelpful | 1", "Steve1derJul 7 at 1:41 PM\nAmazing game\n\nEvery mission is challenging, but solvable. You will lose yourself in each one.\n\nHelpful | 0", "PaulAshbyJul 21 at 12:28 PM\n\nGreat fun\n\nHelpful | 0", "konfusionedJul 3 at 10:57 PM\nFun to watch others play.\n\nThis game is amazing to watch as a group. I wish there were more of these games available.\n\nHelpful | 0", "NickinadorJun 7 at 11:42 PM\nGreat Fun Puzzler\n\nWish there was more levels, hoping for a second one, but still enough levels for a decent length. Fun challenging puzzles and escape the room type spy games. Very fun experience for all levels of VR users. Plays seated.\n\nHelpful | 0", "tubaman66169Jun 18 at 6:43 PM\nLove this game\n\nFunny, challenging, and has more content than I expected! Definitely worth the price if you like puzzles or escape rooms. If you like snarky narrators, all the better!\n\nHelpful | 0", "Fergus1317 days ago\nLove the voice overs\n\nThe voice overs from your boss are hilarious and worth listening to however will be challenging because of the time limits\n\nHelpful | 0", "Sydney_RobsterJul 8 at 9:31 AM\nGood, but ...\n\nThe Good:\n- the game is funny overall, Bond/evil nemisis send-up style\n- varing scenarios/locations (7 levels - each having about half a dozen puzzles) with an adequate overarching story to connect them\n- I eneoyed the puzzles (mostly) they were well designed\n\nThe Lacking (I rated down because of this):\n- I got stuck/stumped on a puzzle several times. So after many sequential deaths or a long time examining/trying things out to no avail, I had to leave VR, look up a Youtube video until I found the puzzle's solution, go back into VR and replicate it. This was very unsatisfying.\n\nWhat this games design lacks is (1) an on demand contextual hint function and (2) a scoring system that takes into account the (i) number of attempts/deaths (ii) overall time taken to complete the level and (3) score deductions for providing hints.\n\nHelpful | 2", "bravo.delta.golfJun 5 at 2:50 PM\nBrilliant puzzler with some style\n\nPut the fedora on, pour yourself a drink, light up a cigar, and save the world. Simple, but watch out for the bear with a crossbow.\n\nAmazing variation of escape the room, executed with great sense of humor. Highly recommended.\n\nHelpful | 0", "F1ZEMay 21 at 1:51 AM\nGreat escape-room type of game\n\nFirst game i bought that i play while setting comfortably. I actually let a lot of my relaties try this game out because it is more familiair to them than other vr genres.\nThe game itself is really well-made with a cool storyline. Even the amount of missions is appropriate for me. I would recommend this game!\n\nHelpful | 1", "Hemo.liJul 2 at 4:35 AM\nIt is great 5 stars but I will give it 4\n\nThe puzzles doesn't work in this game because in real life situations can be solved easy because you know you can touch anything.\n\nHowever in this game solving the puzzles become boring because you may get stucked in one level because you have know what can be touched. I am a smart man I have civil engineering degree and working on towers now. I realized the puzzles is not mind challenging but it is knowing each thing on the game if it can be touched and related to the game or just a block which is waste of time.\n\nFor example first gameplay on the car inside the plane.\n\nCouldn't solve it till I watch it on YouTube. How do u know when u move ur head when lazer attack you solved one step. The paper bomb it says colours 1.2.3 to cut. I cut them in that order 1.2.3 How should I know the correct order is 3.2.1. It is like I am only limited to the game rules not logic rules. What if there was a mask hidden somewhere to use it for the smoke.\n\nHelpful | 1", "randomnesskidMay 20 at 7:20 PM\nBEST GAME IVE GOTTEN!!!!!!!!!!\n\nIf youre ever going to get this game I just want to let you know it is one of the best games I got. It exceeded my expectations so much from the intro credits to the last puzzle it was just so much fun, I really hope that the developers make a I expect you to die 2\n\nWhen the game first came out, I wanted to get it but I didnt have the VR headset.\n\nSo developers if you read this please make a I expect you to die 2 and make it the best game on the VR store.\n\nI had nothing wrong with my game it was really high-quality and really fun, so thank you developers\n\nHelpful | 1", "CorrectStevoJun 15 at 7:41 PM\nThe name's Bond, James Bond.\n\nFan of Bond films you're in one! Just missing a vodka martini, shaken not stirred but the field work is rather excellent. Hopefully they will have DLC's in the future.\n\nHelpful | 0", "gley_DJun 6 at 10:45 AM\nKeeps u thinking\n\nI love this game! I like that it's not so predictable, and that you can get out of certain situations that would normally kill you on another game. If you're fast enough, you can get out of dieing. So much fun!\n\nHelpful | 0", "BononciniJun 6 at 3:38 PM\nBest VR game\n\nThis needs to be your first VR game you get if youre new to this. I love the puzzles and just the environment youre placed in. It also would be cool if the devs keep adding more missions or even a part 2\n\nHelpful | 0", "SunburntJul 14 at 9:01 PM\nAwesome puzzle solving game\n\nSimply awesome\n\nHelpful | 0", "sub2pewdiepie246Jun 29 at 6:29 PM\nGreat game, a bit longer\n\nThis game would be absolutely amazing if they made it a bit longer, but its still really good\n\nHelpful | 0", "Trix08Jun 26 at 2:08 PM\nEPIC!\n\nThis game is absolutely GREAT! I really want a lot more levels! This was soooo much fun!\nThank you so much!\n\nHelpful | 0", "elentingMay 18 at 6:46 PM\nGreat fun. Just the right difficulty.\n\nFishermans Tale was our introduction to this genre and it was a great way to start. This kicks it up a notch with a little more difficulty. Im only through the first three levels but find them very fun. I dont know how people say they finished each level in just 10 minutes right off. Each one has probably taken me at least an hour so far, but I do think you get a little bit better as you get the feel of things. Has replay value to get souvenirs and awards too! Great value.\n\nHelpful | 0", "ConstanzzzeJun 26 at 11:01 AM\nGreat puzzle game\n\nLots if set interactivity, and novel experimentation required. Also had a refreshing comedic dialogue\n\nHelpful | 0", "stunginJul 13 at 3:26 PM\nWorth every penny i spent\n\nAmazing game\n\nHelpful | 0", "CronoseerJun 28 at 6:55 PM\nWish it were longer\n\nIt wasnt too long and Im hoping that they add more levels but overall great game!\n\nHelpful | 0", "TAHWAGGIN11 days ago\nNice\n\nIt's a fun and immersive spy game definitely worth it\n\nHelpful | 1", "chico.garcia2Jul 21 at 10:27 PM\nAddictive and brain fracking\n\nFrom beginning to end it's an escape the room type game(to me) I have had this game for a few weeks, I play as often as possible, since I can't sleep, I play this most nights, but I still am finding different ways of getting around and earning stamps for the wall. I bought this game to get my monies worth and help distract me from my PTSD(20+ Veteran), I'll hit this game again tonite, one of the b\nest things of this game is starting off where I left off. I'm still not finished with game, Thanks to the creators/programmers! Outstanding job!\n\nHelpful | 384", "zadensoculusMay 20 at 10:30 AM\nLoved it.\n\nFor a $25 game that was surprisingly good i really think it should've been $30 also one question when will the next update be because i want to see a mission where it is a boss battle with zor so you dont have time to think about what you have to do and just remember from past levels\n\nHelpful | 0", "melvaiMay 12 at 6:44 AM\nBeautiful brain teaser\n\nI love the physics in this one. Most things behave as they should in the real world. One of the scenes has you wearing an X-RAY set, and I actually took off the VR set instead of the X-ray set when the scene ended. The spy-assistant commentary is hilarious and the levels are very satisfying to solve. I love it.\n\nHelpful | 1", "rbristelMay 12 at 1:53 PM\nLoving it\n\nIm new to VR, so Ive explored a few games that I thought would best suit me. I enjoy being active, but that gets tiring and my mental gets neglected. So I looked for something to challenge my mental. This game does just that. I love this game. I love the challenges, and I feel like Im a real spy. This game is fun and rewarding.\n\nHelpful | 0", "GeekwarlordMay 11 at 9:09 AM\nPerfect VR puzzle.\n\nI Expect You To Die is a real must-have for all VR users out there. It has great puzzles, engaging characters, brilliant humor from time to time, good graphics and voice acting, magnificent level design. Even the opening credits is a masterpiece of its own. Clearly one of, if not the, best title on the Quest.\n\nHelpful | 1", "Banja78May 19 at 5:27 AM\nYour personal escape room\n\nThe game is basically a number (7) escape rooms all very well shaped with the Spy storytelling.\nIt is a fun game you can play seated, requires a bit a brain and curiosity to look around. I did fail a few time before finding the right approach. Overall between 3 to 5 hours of playing. It is hard to stop until game is finished.\nI would give 4 stars because of low replayability but here an additional bonus star is deserved for the great spy ambiance and because this is one of the only games ever where you can virtually smoke cigars.\n\nHelpful | 0", "SwagStar59May 8 at 1:16 PM\nI was skeptical... at first\n\nThis game never truly appealed to me, not really a puzzle person. But I got it discount in a puzzle game pack. I totally underestimated this game. So fun just get it. Worth it even without a sale\n\nHelpful | 3", "11scholeyApr 27 at 5:58 PM\nMy favourite game on quest!\n\nThis is an absolutely great game with fun and challenging puzzles, a proper British 60s spy aesthetic and great visuals. The levels feel real and are really replayable as you can unlock may souvenirs for your office. Overall well worth playing.\n\nHelpful | 3", "Dino_man_manMay 17 at 6:23 AM\nWorth it\n\nThis game is definitely worth the 25 dollars you pay because there are ten levels! All of them are really fun and challenging and if thats not enough there are achievements for each level so if you dont get all of them you can go back and try to get them.\n\nHelpful | 1", "cd4nysaJun 27 at 6:14 PM\nGooooooooood\n\nFreeeeking 555555555mill stars but it short if smart\n\nHelpful | 0", "KsawierS7Jul 14 at 3:19 AM\nIts ok-awesome.\n\nThis game is kinda short, kinda hard, not a lot to say. If you're a big fan of puzzles (I like them too but I'm not a giant fan) you should get this. Definitely worth the money.\n\nHelpful | 0", "Cartoonlover3000Jul 3 at 12:52 PM\nMy favorite game!!!\n\nFun and replay-able!!\n\nHelpful | 0", "Aurthor.MorganJul 11 at 12:20 PM\nAmazing but could use new features\n\nThe game is very well done for a spy puzzle game and could be played for hours but there is a bit of a flaw with the new hand tracking I believe that it should be implemented into the game\n\nHelpful | 0", "mochi_mtlJul 2 at 8:52 PM\nCreative and challenging\n\nHad so much fun!\n\nHelpful | 0", "TanixKingtonJun 14 at 2:39 AM\nWould be worth the intro alone\n\nIf the rest of the game was bad (which it definitely not), this would be worth it for the intro sequence alone\n\nHelpful | 0", "zachary.bills.376Jul 1 at 8:05 AM\nGood\n\nBruh so good doe\n\nHelpful | 0", "Golden_MindMay 16 at 3:54 AM\nI expect you to think\n\nEvery task required patience, and for me, assistance (cheating ) from YouTube to understand what I was doing wrong /not doing right.\n\nI enjoyed it but, at certain points, I had no idea what to do (YouTube homework). I now prefer zombie shooter games and sometimes the thinking game, however this reminded me of Johnny English but it was fun once I had the \"answer\".\n\nUpdate, now that I have completed the basic tasks, my challenge is to obtain souvenirs and hit 100%. It makes the game more enjoyable.\n\nI feel it is worth 5 stars.\n\nHelpful | 1", "DaveBromleyMar 31 at 2:36 PM\nI expected to die...\n\nAnd I wasnt disappointed, this game is fab. It's an escape room type game but where these can be boring in my experience this one definitely isn't! There is an underlying tension throughout the game and a sense that at any moment it could all go horribly wrong. What I loved though is that stages within each puzzle can be attempted in a number of different ways, depending who's playing and how you would deal with things. All round great game and one of the best I've played on the Quest!\n\nHelpful | 5", "MartinChasakMay 24 at 5:55 PM\nSo funny\n\nI have so much fun playing this game, i just jump in and finish, its so exciting and yet so frustrating if you stuck on one point and just keep dying, but when you finally crack it and its so satisfying.\n\nHelpful | 1", "Pepperw2Apr 18 at 8:43 PM\nBrilliant\n\nThis game was my first actual purchase on the Quest. I have purchased many others since this one and can honestly say it is among the best as far as quality. I was not prepared for how immersive this game is! I mean that in a good way. Very detailed and very interactive. The puzzles are challenging, but not unsolvable. Honestly if you take a second and look around, you start to see how things are connected.\nI really recommend this game to all of my fellow Escape the Room junkies.\n\nHelpful | 2", "poetgriotJun 20 at 1:23 PM\nDad keeps stealing my occulus\n\nWe both love the game, he keeps \"borrowing\" my occulus to play it\n\nHelpful | 0", "Brandon_IsNoiceJul 10 at 12:46 PM\nA good but short game\n\nThe puzzles are hard and can take a long time but the game is to short and not worth the 25 dollars I paid for it it should be 15 dollars or at least 20 I kinda want a refund\n\nHelpful | 0", "MunrizzleMay 31 at 6:52 AM\nGreat purchase!\n\nThe moment I saw the trailer I knew I'd enjoy it and I was right! From the opening sequence all the way through! It's a fun thinker that has wonderful replay value!\n\nHelpful | 0", "DABOM1530Jun 28 at 12:19 PM\nGreat game\n\nThis game was great\n\nHelpful | 0", "paulie3323Jun 14 at 11:05 AM\nAmazing game!\n\nI love this game because you dont even have to stand up to play it and its so fun!\n\nHelpful | 0", "butterscottJun 28 at 9:04 AM\nFun puzzle game!\n\nIts a must buy\n\nHelpful | 0", "JohnReeseEApr 17 at 2:37 AM\nOddly Satisfying\n\nI got a lot of satisfaction figuring out the puzzles by myself. So much stuff to interact with. Although I really did not like the submarine level very much because of how complicated it got and on a time limit too. I despise that. but overall I had tons of fun! I hope theres a part 2 to this game\n\n\nHelpful | 2", "Tekkers-May 9 at 5:31 AM\nOne of the best\n\nTop class title. Would recommend for anyone who likes puzzle games. The spy theme works perfectly with the game. Kept me fully engaged the whole time. The challenges and rewards add some replay value too. Good one to show friends and family what the Quest is \n\nHelpful | 0", "su_goJun 12 at 2:05 PM\nAmazing\n\nLove this game, and hope to see more like it in the future! Wish it had a bunch more levels.\n\nHelpful | 0", "odelay101Jun 26 at 11:41 AM\n\nbest game on Quest\n\nHelpful | 0", "Tigerlilly346May 17 at 3:13 PM\nGreat game for Oculus Wuest\n\nThis is a great game. It reminds me of a room escape game but for VR. If like Vacation or Work Simulator you will definitely like this game. The challenges are not too hard but appropriate for the level of difficulty.\n\nHelpful | 0", "ChrisJoshNowMay 5 at 12:57 PM\nBest international man of mystery sim\n\nGames puzzles are very challenging in a good fun and interactive way. Lots of replay ability that allow you to unlock souvenirs for your office. Only in this game will I ever be able to light a cigar with a stack of bills, while counting my money and gems, in a\nwinter lodge.\n\nHelpful | 0", "crazyjandro1007May 25 at 11:18 AM\nThis game is amazing\n\nI love the game and all and its a great game yeah Im only five serve you but I want thing I wish we could do hand tracking for this game because it seems so cool\n\nHelpful | 0", "GhostofDolemiteJun 20 at 7:52 PM\nCant wait for a sequel!\n\nHopefully the sequel has a squid fight.\n\nHelpful | 0", "leh3Jun 24 at 4:26 AM\nGood fun\n\nGreat game good fun\n\nHelpful | 0", "magnificentmelFeb 2 at 11:47 AM\nThe. Best. Game.\n\nI Expect You To Die is hands down the best game I have ever played on the Quest. This game is satisfying on so many levels.\n\n1. Youre in unknown territory with the expectation that you will die. Your body is on high alert and you immediately search for clues to complete the mission.\n\n2. Brain buster. You have your clues, now what? Figuring it out can take seconds to minutes and sometimes hours. Completing missions is gratifying.\n\n3. Need help? Cast to the TV and your friends can help! Its fun! And if you still cant get it, take turns! Its amazing to watch peoples thought processes. Theres many ways to get to the same result.\n\n4. Fun for all ages. Critical thinking skills is the name and not dying is the game. Enjoy it. Stop Dr. Zor and protect the world!\n\nHelpful | 54", "SalmonBelmontApr 16 at 1:44 PM\nPretty Good Game\n\nBeat it a few times, got every souvenir, immensely satisfying to find all the answers and then apply those answers to get the speedrun times for those sweet 7 scorpions. One level is like 90% preparation but thats one of the better ones. Great puzzle game, definitely worth your time\n\nHelpful | 2", "Faye32620 days ago\nPretty Fun\n\nI have been thinking about getting this app for a while based on the reviews. I have to say, though, I've only gotten through first mission(after dying a couple of times) this is a hoot. I couldn't stop laughing. Pretty fun. I hope more missions are added soon. It will be great if it was a little longer.\n\nHelpful | 0", "FlannelGamesMay 10 at 3:56 AM\nGreat game, too short for price\n\nMy wife and I love escape rooms so i picked this up for us. We have only played through the first few puzzles so far, but they have been relatively short (not counting the 1 or 2 deaths we have had, each mission has taken us 10 minutes so far; though i expect the later levels will get harder). Also, while I originally thought i would like the \"multiple ways to solve each puzzle\" concept, it does make some of the levels feel too easy (because if you miss one thing you don't have to figure it out, because you can jist use the other route).\n\nWe still enjoy the game, but with its 7 levels, if feels similar to Fishermans Tale, Time Stall, and other puzzle games on Quest, all of which are priced at $15. I think this does what it does well, but not well enough to justify the extra $10 over the other puzzle titles. i think somewhere between $15 and $20 would be just right.\n\nHelpful | 4", "XxdarkdeathxX21Jun 23 at 11:24 AM\nLove it\n\nMore levels?\n\nHelpful | 0", "wgdJun 2 at 1:12 PM\n\nThe story and missions are challenging and fun. This is an engaging and well crafted game that is well worth owning.\n\nHelpful | 0", "hendoooooooooJun 17 at 7:46 PM\nOnce you get into it it's insanely fun\n\nPretty difficult but really intuitive\n\nHelpful | 0", "McElroyFranklynMay 29 at 2:20 PM\nAmazing\n\nThis game had me\nLaughing from the start such a great experience I enjoyed every second of it please make more games just like this\n\nHelpful | 0", "parentwhocaresJun 23 at 6:50 PM\nCool\n\nCool\n\nHelpful | 0", "Twissy-87Jun 24 at 1:03 PM\nOne of the best escape rooms!!\n\nIt's super entertaining and will make you pay attention to every detail of the level you're playing on.\nIf you like to explore and beat puzzles, this is your game!!\nI wish it was longer though.. \n\nHelpful | 0", "BOMB45Jun 17 at 4:13 AM\n\nGood game, love the challenge.\n\nHelpful | 0", "talon.gagnon.1Jun 15 at 4:44 PM\n\nI really liked the directors commentary\n\nHelpful | 0", "VidhurrJun 1 at 9:51 PM\nAmazing\n\nThis game is amazing. Not too difficult, not too easy, really well balanced. Please add more missions\n\nHelpful | 0", "virtualmandalaJul 28 at 8:05 PM\nToo repetitive for me.\n\nLove the concept and the game\n\nHelpful | 0", "MrsChenJun 16 at 7:18 PM\nWow\n\nBest game on quest by far\n\nHelpful | 0", "Electric_zasApr 22 at 9:04 AM\nGreat game\n\nI started playing this game on my ps vr and I was amazed by this game. It is a seated escape room that you can show people that have played vr once or twice since showing people this vr game as there first experience may confuse them since when I showed one some of my friends that have never played vr the game was a bit confusing to them but never the less this is a great game and even better on the quest and I recommend getting it\n\nHelpful | 1", "KawaiiShortcakeMar 29 at 3:48 PM\nScavenger hunts. Clues? Spies?! YES PLZ!\n\nThis is the only VR game that my boyfriend loves playing. We both love the scavenger hunt to find clues and figure out what to do. When we clear a level it's SO SATISFYING! It's definitely a great game for friends and family visiting! You'll get a good laugh at them flailing around when something goes wrong. Great purchase!!\n\nHelpful | 3", "AsgharAghaMay 24 at 11:06 AM\nSo much fun\n\nGreat game. Funny. Right amount of difficulty. Nice visuals.\n\nHelpful | 2", "Joey2410Jun 8 at 5:42 AM\nBest quest game\n\nPull up a chair stop reading this review and play this game\n\nHelpful | 0", "gdizzle99May 21 at 4:03 PM\nMy first review ever\n\nThis game is amazing. Go slow. Only 7 levels. Its like a virtual escape room w things you cant do in real life. Awesome game. Really awesome.\n\nHelpful | 0", "DalraxMar 25 at 7:39 AM\nAwesome virtual escape room\n\nYou are a pseudo-James Bond who is put in various seated scenarios, e g. a car, a submarine, a train, a desk etc. And you have to figure out how to achieve some objectives. You can get up and walk around in the virtual environment but you don't need to. Difficulty is just right, not too hard not too easy. I'm finding it very fun to try to figure out what to do in each environment.\n\nHelpful | 6", "NoykeMay 12 at 11:33 PM\nAmazing\n\nEverytime I have someone play this, they solve the missions in a completely different way than I did. I live how the game makes it possible to complete missions in more than one way.\n\nHelpful | 1", "gimmethecheeseJun 1 at 9:05 PM\nGame mechanics\n\nThis game works better than any other game I have played i also love the style!\n\nHelpful | 0", "Cudaguy72Apr 18 at 11:44 AM\nFun, interactive and immersive\n\nGreat puzzle game that reminds me of old Goldeneye/No one lives Forever style games mixed with a room escape. Great way to work out the brain and has fun replayability. Dont get to frustrated because you should expect to die.\n\nHelpful | 2", "Flashbang2411Apr 18 at 3:31 AM\nBrilliant, Bond-spoof fun\n\nThis is worth every penny, a well thought, entertaining game with some brilliant content and entertaining and Brain-teasing puzzles and levels. It will keep you busy for a few hours and then keep you coming back. Honestly I was sad when it ended. If you like spy-themed games with a puzzle solving aim. Then get this game. Really, its amazing.\n\nWell done developers!\n\nHelpful | 1", "howard.batt.33May 24 at 12:45 PM\n\nIm finished the first three missions. Cant tell you how many times I died. But it was worth it. Great game\n\nHelpful | 1", "Freakshow-EApr 16 at 5:00 AM\nYES\n\nFinally a game that challenges me because honestly I don't just like shoot'em ups, I like stories and things that make me think and this has all three my, favorite being your \"vacation\" because that has every thing!\n\nHelpful | 2", "bluebird28Jul 23 at 3:05 PM\nGreat game\n\nJust more missions please\n\nHelpful | 0", "BooallenMay 29 at 4:51 AM\nLove this!\n\nIts quite the workout shooting and dodging bullets! Its one of my favorites!\n\nHelpful | 0", "LV-426_May 19 at 8:59 AM\nVery exhilarating\n\nThis game makes you think with your brain and its really fun to do all of the puzzles and levels. Definitely recommend!\n\nHelpful | 0", "HavocfywMar 29 at 2:06 PM\nNow we're talking!\n\nThis game was excellent. The style, the plot and especially the puzzles were such a great reminiscence of the 007/spy movies I loved as a kid. There are a ton of ways to die, secret passwords, hidden compartments, booby traps and tons of other fun surprises in this game, and beating it felt like a real accomplishment. This game is is mostly a once-thru game for with little appeal for me to return to it, but it didnt stop me from giving it 5 stars.\n\nHelpful | 2", "lewis.atheyMay 25 at 2:26 PM\n\nGreat game highly recommend for all ages the challenges behind the story line just get your blood rushing\n\nHelpful | 0", "MacMiskennMay 29 at 11:42 AM\nNo One Lives Forever VR\n\nThis is a great game. BUY!\nThe only issue is that it's too short!\n\nHelpful | 0", "GaydarrMay 6 at 5:14 PM\nI just wish it was longer\n\nIt is a perfect game but it took me only a couple hours to beat it. I hope they add more content soon.\n\nHelpful | 2", "Toby_Wan_KenobiApr 21 at 2:26 PM\nGreat VR experience! Highly Recommend\n\nThis is an extremely fun game that makes great use of the Oculus. The rooms are challenging but not frustratingly so. This has been a game that Ive shown to people who have never used a VR system before because its intuitive, fun and awesome.\n\nHelpful | 0", "SuperDPDJun 4 at 11:13 AM\nGreat game\n\nFun puzzle, I quite liked it\n\nHelpful | 0", "EngageObjectApr 16 at 12:11 PM\nAmazing Brain game\n\nThis game not only looks and plays beautifully, but it will keep you on your toes with wacky puzzles that are sure to get your heart racing. Definitely keep yourself from looking up answers because the satisfaction youll get from the Aha! moment is so gratifying.\n\nHelpful | 0", "loughrankMay 7 at 8:59 PM\nA must have for Quest starters.\n\nGraphics are great, gameplay is very engaging. If youre new to VR, this is a great place to start. Doesnt feel like a port from Go, like oh so many games.\n\nHelpful | 0", "ZenToadeMay 7 at 9:10 PM\nThey were already so many good reviews\n\nSo why write another one. Just to let you know that I am another satisfied customer. This game is a lot of fun to play and even more fun to watch my family try.\n\nHelpful | 0", "southpgJun 11 at 1:05 AM\nGood concept but too difficult at times\n\nI enjoyed the first few puzzles but got very quickly bored with it as there was little clue on how to solve them. The game is based on repeating the same actions over and over until you solve the whole puzzle. Got 1 step wrong, you start all over... get the next step wrong, hot start all over... at the end it feels you are playing a series of Simon meets spy game. It was okay for awhile but could be bothered to finish the whole game.\n\nHelpful | 0", "AnnVDRMay 21 at 10:13 AM\nGreat game, well worth the price\n\nHad way more fun with this game then I could have ever expected, would definitely recommend it\n\nHelpful | 0", "CraterMMar 25 at 9:28 AM\nWell crafted and addicting\n\nI absolutely loved this game! Even if you arent that into escape rooms or logical puzzles I think almost anyone could enjoy this game. Going on all the missions really makes you think and be creative. I enjoyed every puzzle, challenge and even the story itself. Id find myself thinking about my current mission trying to fall asleep each night just thinking of what I need to do and try to continue. Even my family was hooked! With a satisfying ending and hoping for more, I wholeheartedly recommend this game to anyone who hasnt tried it. I only wish there were more levels! Thank you for such a fantastic game.\n\nHelpful | 2", "WillymaryJun 3 at 4:32 PM\nLike escape rooms?\n\nThen youll love this!\n\nHelpful | 0", "bloodytouristsJun 3 at 2:21 PM\nGreat game\n\nComplete puzzles from the comfort of your chair. Good narration and good graphics. Look forward to more of these.\n\nHelpful | 0", "Jack717Jul 16 at 8:43 PM\nReally fun but its pretty hard\n\nYea the title\n\nHelpful | 0", "BossloreyJun 21 at 6:02 PM\nVery good\n\nSequel? Please? I want one. A lot of people do. Also, the commentary after the game was a nice touch. So if there is a sequel, please add a giant squid fight\n\nHelpful | 0", "Techno_Sheep1Apr 16 at 8:16 AM\nI expect you to die\n\nAlthough I had some trouble finished this game I LOVED it from start to finish the game had every possibility imaginable like for example putting a bowl on your head. I thought the ending was amazing and had a fun time experiencing these missions. 10/10 game\n\nHelpful | 0", "ChestnutzzApr 22 at 11:21 PM\n10/10 Best game iv played on VR\n\nThis is a great game to sit down and work your brain. I couldnt seem to take my headset off, I needed to get everything in the game. I highly recommend this game to everyone. Its completely worth your time and money.\n\nHelpful | 0", "pounder008May 11 at 4:36 PM\nOne of the best for quest\n\nGreat game.So far this and beat Saber have been been my best buys! Has kept me entertained over the last week.Well worth the money.\n\nHelpful | 0", "frozenfire01Feb 28 at 8:16 PM\nNo real plants\n\nALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE ALL PLANTS ARE FAKE\n\nHelpful | 132", "aggy.thomasMay 16 at 8:23 AM\nFully deserves the great reviews\n\nReally good game with nice variety in the puzzles! Good amount of levels for the price, highly recommend!\n\nHelpful | 0", "OtherbitsMay 23 at 5:23 PM\nDying in a puzzle game?\n\nThere's a lot to love about this game. The object interactions, the production values, the humour, its a wonderful experience. One of the best on the Quest.\n\nThat said, I hate the dying mechanic. I know its rather central to the whole theme, but it really brings the entire experience down. Its not like it happens rarely either. You'll often be in the middle of solving a rather entertaining puzzle, and suddenly you're thrown a complete curveball and given 4 seconds to solve it. I could almost never think that fast, and would die. This removes all tension and immersion from the level, and is incredibly frustrating because the level now needs to be replayed from the very beginning. If it happens several times, you'll quickly tire of listening to the same dialog and solving the same puzzles over and over. The game only gets away with it because the levels are so short and simple, but that just leads to another problem - the levels are too short and simple.\n\nIts still definitely an experience worthy of your time, but I can't help feeling it would have been so much better if they committed more to the escape room style and made the levels a little longer, made the puzzles a little harder, and made the dying much less frequent, if at all\n\nHelpful | 1", "GewoonDylan4 days ago\nIts an awesome good looking game\n\nIts a good looking game fun and interactive the graphics are pretty good and overall everything works! Awesome\n\nHelpful | 0", "june.simpson.794Mar 28 at 12:36 AM\nA great escape room game. Fantastic !\n\nI love this game!\nIm on the train section at the moment trying to get through the door.\nI kept skipping past this game as the title led me to believe that it was a shooting game which Im not interested in but boy was I wrong. It really makes me feel like Im a top secret agent.\nDevelopers... keep up the great work and make some more please.\n\nHelpful | 2", "linknzelda7Mar 13 at 7:46 PM\nGreat share/group game\n\nI love this game. Very simple to understand yet can be very challenging at times yet not so hard that almost any one could figure it out. This is a great game to do as a group (one person playing and other watching on another screen helping figure it out). Its also a great game to show to someone who is new to vr because its easy to pick up and wont make you motion sick. Highly recommend this game great game play great colors and every level is very unique.\n\nHelpful | 3", "SaintCrusader15May 15 at 10:09 PM\nThe best game ever\n\nI love the theme of spys. And I also like how it led up to the end. The best game I ever played\n\nHelpful | 0", "kjmsu1998May 11 at 4:12 PM\nAwesome game\n\nI love puzzle type games. This makes you use that thing in your head called a brain. It is challenging and makes you think.\n\nHelpful | 0", "SergeantSausage42May 20 at 12:03 PM\n\nGreat to just sit and work out how to solve the situation. Some great missions\n\nHelpful | 0", "ChiefGanMay 23 at 1:38 PM\nFun puzzler\n\nLighthearted fun. Played sitting down. A bit short but cool.\n\nHelpful | 0", "IkeaPieJul 14 at 6:27 AM\nVery good\n\nSimply amazing.The best spy game out there.\n\nHelpful | 0", "808NMagzApr 23 at 1:00 AM\nFun & Addictive\n\nI am not a fan of puzzle games, but this one sure got me addicted to trying to figure out how to get out of different situations. Even when I am not playing it, it just makes me think about how to get out of the current situation I am stuck on. Its so mind blowing!\n\nHelpful | 1", "SpicyFriedFriesApr 4 at 11:23 AM\nMust buy puzzle game\n\nThis is by far one of the best puzzle games on the quest. Even with the small amount of room this game has so much content. The story this game tells is funny and slightly dark at moments. I recommend showing friends a level or two if the come over. All in all this game is a must buy for any fan of puzzles.\n\nHelpful | 1", "Fil_WatertankMay 26 at 10:45 PM\nOne of the best VR experiences\n\nGreat game, good humor, few movements. Become an agent.\n\nHelpful | 0", "david.mctaggart.378May 4 at 2:10 PM\nMust buy\n\nA great game, really enjoyed working out all the puzzles.\nThe panic you feel when it all goes wrong is brilliant.\nPlease please release more levels.\n\nHelpful | 0", "Jeff4545tJun 2 at 10:52 PM\nGreat game!\n\nI want them to come out with more missions! It was so fun! Love it!\n\nHelpful | 0", "deafguy079Jul 25 at 6:50 PM\nNo subtitle\n\nI am deaf. I always rely on subtitles.\n\nHelpful | 0", "ieatavocadoMay 1 at 7:04 PM\nThis is the best game I ever played !!!\n\nLove it so much!!!\nAll details are excellent and you will feel smart when you finished every level.\nI am at my finish level, wish me luck agent!\n\nHelpful | 1", "MysticPotatoeApr 29 at 3:35 PM\nEpic as heck\n\nThis game is so much fun, its immersive, and the puzzles are fun but challenging, if you need a way to spend your time this is your best most epic option\n\nHelpful | 1", "Tony.DiIuorioApr 14 at 6:17 PM\n007 spoof with hilarious spy theme song\n\nSatirical and light hearted, this homage to the spy thriller is very fun. Expect to die - a lot. The puzzles are excellent: as soon as you think of a solution something else needs solving. It takes many tries at each level to figure out how to beat the villain traps and stay alive.\n\nEXCELLENT sitting down game. All picking up and manipulating objects is done through magnetic grip. Aim and pull things into your hands, and then put them down same way. Very smooth interaction with this virtual world.\n\nI just finished the game. It's long, about 6 challenging levels not counting tutorials. It took me weeks. If you get stuck don't cheat, just leave it a few days then come back fresh.\n\nIt's too good a game to rob yourself by googling hints!\n\nThis is still one of my favorite titles in this category. It's so smooth and polished. There's secrets and speedruns available after you're finished with the game story.\n\nHelpful | 8", "yeetboi42069May 24 at 6:25 PM\nTitle\n\nLove it very fun puzzle game\n\nHelpful | 0", "immike.forsureMay 19 at 4:57 PM\nEscape room esc game\n\nVery fun, exactly what you would expect from preview.\n\nHelpful | 0", "BravemercMar 31 at 3:18 PM\nInspector Gadget meets Escape rooms\n\nMy family and I enjoy the fun and light hearted gameplay. So many different scenarios to choose from. The train scene has to be my favorite, in the way that is builds up your anxiety. Great job, looking forward to more.\n\nHelpful | 2", "AssistingNutApr 27 at 10:02 AM\nI expected less\n\nIts really fun. Enjoyed every minute of the game. For the first time its took around 5 hours to beat.\nWorth it. First game to show unexperienced vr users.\n\nHelpful | 1", "ausskatApr 25 at 6:07 PM\nThe best game ever\n\nThe game give u the 007 feel and the rush of a strategic game the game has amazing graphics it has a lot of trophies that make u want to play the game over and over\n\nHelpful | 1", "Foxygamerggg12 days ago\nGreat game!\n\nIts easy fun and really long! But for me I completed it in 15 minutes! I still love it! I recommend it!\n\nHelpful | 0", "WhymypphurtMay 25 at 9:29 PM\nYep\n\nEmpic\n\nHelpful | 0", "archiebromyJun 4 at 10:12 AM\nGame is broken\n\nThe game is really fun and makes you feel like a proper spy. Until I got to the train mission. Whenever I put in the code to open the sender thing, it won't let me open it. It's really disappointing because I would love to get further into the game. Hope it gets solved.\n\nHelpful | 0", "RichAlexCleoMar 4 at 1:40 PM\nGreat Puzzles\n\nReally enjoying playing this game with DW. Cast it to the TV and figure out the escape rooms together, swap over when one of you dies! I also like that all the rooms are set with you sitting down, takes a lot of uncertainty out of the game. Love it! Hopefully nowhere near finishing it! Will be looking for more games like this one in the future...\n\nHelpful | 3", "liquidneckJan 21 at 5:03 PM\nI wish it had more\n\nDo these boards auto update and auto download? Man, I wish. What a fun game. I loved this game and played it non stop until i beat every board. Ill wait a few months and play it all over again. Its not too overly complicated but you do need a few brain cells to play this game. Its a fun challenge.\n\nHelpful | 26", "Whiskey749May 3 at 9:04 AM\nBest game\n\nI Expect You to Die is one of the best games you can get. The makers really did a great job creating an aroma of 007 spy theme. Whether it is the music or office you have. The voice acting was amazing. And the ending was the best ending I have ever experienced in any game. Intriguing me and keeping me on the edge of my seat, This game is definitely on my top list. I highly recommend you get it.\n\nHelpful | 2", "denis.marcil.92May 18 at 6:30 PM\nvery good\n\nI love this game a little bit difficult.\n\nHelpful | 0", "JustJoshinYa93May 15 at 9:32 AM\nAmazing game\n\nJames Bond + puzzles + Dr. evil. Really is a fun game\n\nHelpful | 0", "Cleve3000May 12 at 4:16 PM\nGreat game really fun \n\nThis game was clever and challenging enough to be fun for all ages.\n\nHelpful | 0", "XmanCVApr 22 at 4:24 PM\nFun Eacape Room type game\n\nThe game is very well done. The graphics have nice touches that give it a nice polish. No one would likely confuse the graphics for being life-like but the quality is much better than many other titles on the Quest so far.\n\nAnother nice feature - live streaming your attempts to solve a room. Friends on FB can watch and suggest things to try you may have missed.\n\nTo get that 5th Star - more levels via expansion packs please!\n\nHelpful | 1", "peachyleopard7May 23 at 6:10 PM\nVery fun\n\nVery fun\n\nHelpful | 0", "vjs1230May 17 at 2:55 AM\nPp7\n\nGreat game sick to this formula ...\n\nHelpful | 0", "kbrenApr 18 at 4:05 PM\nLove this game\n\nThis an amazing puzzle game that will get your brain working. Have already lost hours solving the puzzles. It's so easy to lost track of time and it's like an at home escape room.\n\nHelpful | 0", "DrewzThunderApr 20 at 9:21 AM\nThis game is beyond worth it.\n\nThis is probably one of the best games in the Quest store, sharing a place with Super Hot and Beat Saber. Must have, no regret, I love this game more than I love my mom!\n\nHelpful | 1", "A-FamMay 12 at 8:16 AM\nLove it\n\nLove this game I have no problems. Everyone should get it.\n\nHelpful | 0", "bartonhahn99Apr 16 at 4:36 PM\nTop 3 VR game\n\nAbsolutely loved this game. If you like escape rooms, this is your game. Lots of missions, plays well, good stories too. Even after beating it, there are still reasons to replay missions.\n\nHelpful | 0", "RodneyCodnerMay 20 at 3:41 PM\nIts perfect\n\nIncredible game!\n\nHelpful | 0", "galexygirlApr 13 at 3:42 PM\nVery fun and challenging\n\nThis game is overall fun and helps me solve things better it also helps me stop dozing off and forgetting things quickly (I have ADHD) would recommend for people who need better brain development\n\nHelpful | 0", "ss4george17 days ago\nFun game\n\nThis is a fun game that you can enjoy for hours on end. If you like puzzles then this is the game for you.\n\nHelpful | 0", "PaleoFossil25Mar 7 at 2:29 PM\nI feel like an actual agent\n\nThe game is awesome in so many ways. The puzzles are fun and though a couple of them are complicated you're never stuck on one part for very long. Sometimes you need trial and error to complete a puzzle but the game still makes it fun. It wasn't what I was expecting at all! The game is also incredibly immersive, I found myself on numerous occasions trying to use telekenises to grab something in real life after putting down my vr headset. I wish they would add more levels.\n\nHelpful | 2", "TheWeirdGuy27Apr 29 at 7:28 PM\nAmazing\n\nIts Amazing, In my opinion I personally love it. Its replay able and also its like a puzzle game,\n\nHelpful | 1", "agawasApr 1 at 7:30 AM\nGreat game\n\nI love this game, its great graphics, colours and all tasks. I needed help sometimes, but once finished the missions it felt it was not so difficult. Cant wait for a similar game or more missions in this one. Great game, I highly recommend\n\nHelpful | 0", "MrJapanicMay 6 at 2:27 PM\nHit the spot\n\nYeh, get it. Definitely a must have for new and seasoned players alike.\n\nHelpful | 0", "CrazyFlyingPig5Mar 21 at 5:32 PM\n12/10\n\nOne of the greatest games I have played in a long time, I Expect You To Die is a thrilling, action-packed puzzle/logic game that will keep you wanting more. Most of my family has tried it and now they wont let me play, due to them being completely hooked. The story, setting, feel, puzzles, and art style make the entire game come together into one awesome spy-themed escape room adventure. I would highly recommend to anyone who wants a true challenge, beautiful art style, and fun all in one game.\n\nHelpful | 1", "wfoster1216May 17 at 12:50 PM\nAustin powers and James Bond love child\n\nSuper fun game!\n\nHelpful | 0", "FergusandMar 8 at 7:10 PM\nIts not a short game...\n\nEveryone is complaining about how short it is, but they obviously never tryed to 100% it, if you try the game is like 3x longer an way worth the price.\nand it even has some amount of repeatability for the missions, and the ending was SICK and no one call tell me otherwise 5 stars!\n\nHelpful | 2", "jaxontoJun 22 at 10:15 AM\nGreat\n\nAwesome just needs a few more leveled\n\nHelpful | 0", "DwolfthegamerJun 4 at 10:52 PM\nPhenomenal\n\nThis is a great game, definitely a brain twister. Wish the game was longer, kinda short. Be good to add more stages later.\n\nHelpful | 0", "CaptainCrunch12Apr 1 at 7:45 PM\nA lot fun! Interesting puzzles\n\nIts kinda like escape room in that you gotta figure stuff out. Each step of the way you realize what you did wrong - when you died. Then you try again until you get it right. Lol. Its fun and interesting and a bit nerve wracking.\n\nHelpful | 2", "DustySock525May 3 at 12:51 PM\nGreat Game\n\nIs a bit tricky to figure out the levels but once you do it is a lot better\n\nHelpful | 1", "nasa0410May 13 at 8:14 AM\nAmazing\n\nDefinitely a game to get\n\nHelpful | 0", "jmadeiraJun 1 at 3:26 AM\nAmazing but short\n\nThe game is very immerse and challenging but some steps are too hard a not so logical to follow. It's too short, more levels are needed.\n\nHelpful | 0", "cjheverApr 28 at 11:43 AM\nAmazing Game\n\nIve finished the entire game and now going back to see the behind the scenes speech bubble\n\nHelpful | 0", "ILoveFNAFApr 23 at 4:48 AM\n):\n\nI messed up you could find a securit but one thang i will have for a hint is... under desk only seen buy a boton\n\nHelpful | 0", "JwleesMar 18 at 3:19 PM\nSuper Fun!\n\nThis game is incredibly fun! All the puzzles have the right level of difficulty and creativeness. Even if I was frustrated from not beating a level, I was always able to pick it up again and have more fun! I would recommend this game to anyone who needs a fairly long game with great puzzles.\n\nHelpful | 1", "StrangerfanJun 28 at 1:59 PM\nGood game\n\nGame made me uncomfortable I was motion sick for most levels but other than that it was good.\n\nHelpful | 0", "TheNutellaFilesMar 24 at 8:59 AM\nFavorite VR Puzzle Game\n\nThis game is amazing! Although it may not have an immense amount of levels, the game provides tons of play time. A DLC mission pack would probably be fun as an add on to the game. Maybe a new short storyline different from the original? Overall good game though!\n\nHelpful | 1", "rocker1milApr 19 at 3:22 AM\nAwesome\n\nIf you wanna feel like james bond trying to escape his inevitable death while also saving the entire world, this is your way to go.\n\nHelpful | 1", "reesebuckhalter123Jul 9 at 11:47 AM\nLevel 2 still blue...\n\nWell I am to still have failures with level 2 but the game itself wow its great and I feel like Im in bf in real life because when I picked up the tv remote a beam come out of it and I still se my play area grid lol\n\nHelpful | 0", "Teddy.ShervheimMar 25 at 8:39 AM\nA puzzle game within a spy game\n\nIts a great game and if you love the quest youll love this game.And with updates with new levels coming out often youll have an excuse to keep playing your VR \n\nHelpful | 2", "ichbineinplezMar 15 at 9:04 PM\n\nI expect you to die is my second favorite game up-to-date second to Vader immortal but anyways that's the beside the point this is an addictive puzzle game it is so much fun I have redownloaded it so many times just to get the amazing feel of unlocking your souvenirs which is so much fun it's fun and puzzling at the same time and with a few jokes thrown in definitely would buy\n\nHelpful | 1", "Thundersaber7May 6 at 9:14 AM\n\nAmazing game just great, fun and different!!\n\nHelpful | 0", "RadDuckling1022Apr 17 at 2:27 PM\nThe best game Ive ever played\n\nI love this game it is my favorite game on the oculus would like a sequel to this game it would be great hope you chose this game so fun\n\nHelpful | 0", "santasniffer12Apr 30 at 8:37 PM\nOne of the best games I have played\n\nThis was a really fun game I just keep playing it over and over\n\nHelpful | 0", "FrostLord29224 days ago\nBest Game Ever\n\nThis game is the embodiment of old James Bond movies, and is the greatest game I have ever played.\n\nHelpful | 0", "DeepThought55Apr 27 at 7:38 AM\nA VR Essential\n\nEasily one of the must-have VR games. So stylized and smart, funny and challenging.\n\nHelpful | 0", "DemizeMar 13 at 6:41 AM\nLoved it!\n\nWe really enjoyed playing this game. At half the cost of a single persons trip to a real escape room, it felt like a good value.\nWe took turns with the headset, switching each time we died, great fun.\nWe were disappointed when it ended after about 10-12 \"rooms\", but that's just because we were having so much fun.\nCan't wait for another installment...make more!\n\nHelpful | 1", "ZombiemanCPEPApr 21 at 4:29 PM\nGreat game lots of fun\n\nIts a great game well worth cost as long as you like a game that will make you think and solve puzzles\n\nHelpful | 1", "gazzageeMar 1 at 10:36 AM\nGreat but too short for th money \n\nBefore I spend money on a game I like to read the reviews and make sure Im getting value for my money, most the reviews were great so I got it.\nNow dont get me wrong great game  but for 19 I expected more than 8 levels, so in 2 hours I had completed it, is there going to be more levels added?\n\nHelpful | 12", "masterl3v3lgamrMar 15 at 8:43 PM\nSo addicting\n\nThis game is so much fun and with the devs coming out with more it stays for a constant playing game I one hundred percent recommend this game for first timers with the quest if you feel on the fence with getting this game, dont , this game is so much fun and\nconstantly addicting\n\nHelpful | 0", "TheCommander501stMar 29 at 6:59 AM\nAmazing!!!\n\nIve had endless hours of fun with this game. Its hard at times but when u get past the level u feel so satisfied. And u get to use guns grenades and cigarettes! One of the best games on vr. Could you make more levels?\n\nHelpful | 1", "lukercorpApr 17 at 7:45 PM\n\nI wish there were more levelsplz\nOther than the fact that there arent a lot of levels this is an amazing game.\n\n\nHelpful | 0", "69-_-69Apr 26 at 6:29 PM\nIt's time consuming\n\nIt is my favourite game and helps me when I'm bored especially in lock down\n\nHelpful | 1", "SMUG9884Mar 12 at 11:00 AM\nGreat Experience!\n\nIm new to VR, so I decided to grab this title since it was recommended to me. I gotta say I do not regret it! It was a very immersive experience. The only thing I dislike about it was the fact that you could often loose important items and be left very confused on what youre supposed to do. Overall this is a great game and if youre looking to buy it just know that you will most likely not be disappointed.\n\nHelpful | 0", "jelwellMay 21 at 10:30 AM\nDoes it get better?\n\nI only played the first couple of puzzles. I don't understand why so many people are willing to pay a premium for a 3DOF game. This might have been fun on my GearVR but I've got an Oculus Quest. Bring me a game designed for my headset.\nThe puzzles I played were interesting and enjoyable. But I gave up quickly because I wanted a VR game. Not this mix of VR and point and click LucasArts style game.\n\nHelpful | 0", "torvangerMar 15 at 5:27 AM\n\nBeen playing since the release and I'm glad they released additional levels so that I could pick it up again a few months later.\n\nNow that I've finished the game I'm pretty sad. This is my favorite game on the Quest.\n\nPlease release more levels. I wouldn't even mind paying for a DLC.\n\nHelpful | 0", "TakaiyaJun 21 at 10:23 PM\nGreat and humorous puzzle game\n\nThe game was quite enjoyable and the puzzles were clever. Also the voice talking to you is pretty funny. One of if not my favorite quest game so far. Yet, my only complaint is I beat it in about four or five hours, but this is a good complaint because all I wanted was more missions.\n\nHelpful | 1", "SyKadeMay 9 at 1:59 PM\nieytd is a great game\n\nAmazing\n\nHelpful | 0", "jujug420Apr 20 at 6:35 PM\nGreat game\n\nFun game and really makes u think not your usual puzzle game. Quest nails this game with easy tracking\n\nHelpful | 0", "aspart.ruApr 29 at 8:46 AM\nBrilliant\n\nPlayed many times, still enjoy watch my friends playing!\n\nHelpful | 0", "bigworld12Mar 25 at 3:55 PM\nFun and interactive\n\nThis game was an awesome experience there are so many levels. And they get more and more challenging. If you want an awesome puzzle game this is the one!!\n\nHelpful | 2", "artownsendMay 7 at 5:30 PM\nSuper fun, longer than expected\n\nLots of fun!\n\nHelpful | 0", "Luca9209May 9 at 2:40 PM\nAmazing\n\n.\n\nHelpful | 1", "TheMunroStoreyMar 22 at 3:19 AM\nI expect you to love this!\n\nThis is the first VR game that I keep coming back to - absolutely amazing! The thought that has gone into the game, the details, the graphics, the storyline - I love everything about this game!! Hope there are more like this out there .....\n\nHelpful | 0", "MintpopserFeb 23 at 7:28 PM\nThis Game is amazing\n\nNormally, since this is a seated experience Id think it wouldnt be that fun. Boy was I wrong! This game puts your mind, and your ptience to the test, It is set in a James Bond style spy game, and is by far one of the best VR games I have ever played. The intro credits scene represents the game so well and on it alone I would rate it 4 stars. The music, the setting everything is absolutely amazing.\n\nHelpful | 2", "Killian85Mar 8 at 10:55 PM\nOutstanding\n\nIve purchased many different types of games on the oculus quest and this has been by far the most engaging and fun. Wether your a first time VR player or a seasoned Vet this is the game for you.\n\n- I will note, (my own hopes) The game needs more levels. There is so much potential here for solid growth. Please keep it going! Otherwise once you beat all the levels its just another party favor you show your friends once in a while...\n\nHelpful | 1", "Kyson55Apr 10 at 11:03 PM\nNerve-racking\n\nEvery level always had a split second thinking part and got my nerves up to the sky like the level DeepDive you had to work super quick\n\nHelpful | 0", "ashley.theakstonMay 22 at 12:53 AM\nExcellent game\n\nVery clever game with puzzles that are challenging. Great setting too very quirky. I enjoyed it but was a bit difficult for my son (age 9).\n\nHelpful | 0", "eyal2007May 3 at 12:31 AM\nI recommend getting this\n\nIt's a really great game\n\nHelpful | 0", "DanlokiJul 18 at 1:33 PM\nWas sceptical\n\nBut what a fun game in vr to play. Spent 30mins and can't work out the car and I'm happy with that. Quest needs more games with longevity.\n\nHelpful | 0", "lemaire214Apr 28 at 4:47 PM\nLove it!!!!\n\nI am absolutely hooked on this game! Best ever!\n\nHelpful | 0", "cupcakepapiApr 17 at 10:25 PM\nSo good\n\nOh man, this game is very unexpected and challenging! Would love it more if they have more levels!\n\nHelpful | 0", "DrDoritoBurrito13 days ago\n10/10\n\nYes\n\nHelpful | 0", "clach04Jun 10 at 6:54 PM\nFun puzzle, clear graphics\n\nOccasionally annoying puzzle \n\nHelpful | 0", "greeedyJul 29 at 5:17 AM\nAmazing game wish there was more levels\n\nNot completely finished yet but I love it already would recommend buying\n\nHelpful | 0", "KodyDTaylorApr 28 at 6:13 PM\nAmazing\n\nOne of the best games on the quest!\n\nHelpful | 0", "chris.marello.5Nov 22 at 2:52 PM\nI Expect you to buy!\n\nI've been a vr gamer for about a year and a half and I've played dozens of games on 3 different platforms and only about 3 would get five stars and this is the only one I've bought twice. I hope that says more than I could put in words, but if you grew up watching james bond, if you love puzzles, if you love humor you will love this game. My only complaint is that it is over, great port, great job schell games!\n\nHelpful | 124", "CluelessMrZJun 25 at 3:55 PM\nKeeps you thinking\n\nWHAT A GAME.\nIve had so much fun playing this game. Its such a nice sit down and play VR game. The humor is clever enough not to seem too corny. Perfect for any puzzle game lover like myself. Not to mention replay-ability . 10 outa 10 would recommend .\n\nHelpful | 0", "EatonrebApr 16 at 8:59 AM\nHilarious and Witty Fun!\n\nI loved playing this. Even when I died, I laughed. Hope they make more of these soon!\n\nHelpful | 0", "Anti2644Jun 25 at 7:59 PM\nAmazing Game\n\nI Expect You To Die is an amazing game and with all 7 levels with achievements and speed run times there can be many hours of gameplay and to keep you entertained with the clever ways to solve the puzzles. 10/10 have recommended.\n\nHelpful | 0", "schmoo104Apr 12 at 7:38 PM\nLive this game\n\nYou should have a new level in which Zor takes control of a junkyard and you finally see Zors face\n\nHelpful | 0", "readyplayer808Mar 1 at 2:35 AM\nOne of the best games for oculus quest.\n\nA lot of love went into making this game. I think its the perfect game for someone just starting out in VR. Its a seated/stationary game but takes nothing out of the VR experience. For those of you looking for something that highly interactive without the motion sickness associated with other games then this is perfect for you. Its sad that they finally added the final level but I hope the developers have other games they are working on thats similar to the style of this game.\n\nHelpful | 0", "L14Mar 4 at 1:43 PM\nArguably the best Vr game\n\nBrilliant game. Perfect for those who love puzzles and James Bond type stuff. My favourite video game, probably of all time. And Im so in love with this genre. This game definitely sets the right tone, and I wish there were more like it. Definitely worth buying :)\n\nHelpful | 1", "ZabikaiFeb 29 at 3:48 AM\nAmazing, so much fun\n\nIll admit that a few of the puzzles were a little annoying, but theyre so satisfying to figure out anyway. All in all, its an incredible game, with so much interactivity and an incredible storyline. Its funny, its challenging, itll make you want to play for hours. So far, this is the best game I have played on the Quest\n\nHelpful | 1", "Bepis-Man1Apr 24 at 9:04 PM\nIs good\n\nRead the title\n\nHelpful | 0", "KeseyCassadyApr 11 at 4:42 AM\nOne of the best games\n\nJesse Schell is a genius. Need more levels soon please! Or better, another game!\n\nHelpful | 0", "Supermickey505Apr 28 at 5:55 AM\nI love but\n\nI love the game but I think it needs more levels or something. Once you beat it its now that fun to replay because you know how to beat every level. The game needs an update with more levels please.\n\nHelpful | 1", "JayBevApr 15 at 10:07 PM\nClassic 007 Themed Hilarious Puzzler\n\nSo much fun. Loved every level. Such a blast.\n\nHelpful | 0", "King_Of_EgyptJun 19 at 6:39 AM\nGreat\n\nIt's very great game for brain\nI'm an engineer and I am really in love with it\nPlease add more missions or make a new similar game and I will definitely purchase it.\nThank you\n\nHelpful | 0", "Jackman2000Apr 2 at 1:52 PM\n\nI like this game a lot but the thing is I completed it in less than a day. And I wish there were more missions to play because I think the game would be more fun if you added at least 4 more missions.\n\nHelpful | 3", "zachary.davis3May 11 at 9:36 AM\nPretty fantastic\n\nCouldn't hurt to be a bit longer, that being said the production quality and game play is flawless. Highly recommend this game!\n\nHelpful | 1", "wougnot600Apr 19 at 1:47 PM\n\nBest action and puzzle\n\nHelpful | 0", "ZultharJun 1 at 2:56 AM\nA spy-themed escape room\n\nFantastic puzzles, charming humor, good music and beautiful art style. Took me three hours to play through but I came back to get the achievements and listen to the commentary. The only thing Im missing is some kind of hints for the achievements, a few of them were hard to figure out by name alone.\n\nHelpful | 1", "SpryElmMar 15 at 8:54 PM\nAbsolutely amazing\n\nThis game has dry wit and wonderful puzzles thatll entertain you for hours upon end. Even when you finish the game you can still go for the cleverly hinted at achievements/ collectibles!\n\nHelpful | 1", "RadicalRobMar 19 at 3:43 PM\nVr escape room!\n\nEach scenario is different and takes some thinking in order to solve. Lots of fun to do with friends too as they can watch through casting. Only wish there were more levels!\n\nHelpful | 0", "JaunThonyMar 7 at 1:51 PM\nSit down, relax and exercise your brain\n\nI love action games, but theyre exhausting. Instead of giving up when I get tired I sit down and open up this game. It gives me a completely different experience - a mental challenge - but still in a beautiful VR world.\n\nHelpful | 1", "KrispyCabbage_Mar 12 at 2:32 PM\nAmazing but needs new lvls\n\nThis game is great and you can interact with basically everything and I love the little bits of humor it gives and the end had me in tears but then it's ok (sorry for mini spoiler) but it does need new lvls\n\nHelpful | 0", "vegardovicMar 30 at 12:45 PM\nMasterpiece\n\nGreat game! A lot of fun! Simple controls, intuitive and complex at the same time! Very interactive environment!\n\nHelpful | 0", "shotoninjaMar 22 at 11:10 AM\nPlease make more!\n\nThis has been my favorite game so far. I even go back and play the missions I hope you're working on another game like this one. I Expect You to Die 2 ?\n\nHelpful | 1", "andreiberApr 8 at 12:03 AM\nIt is a good game\n\nIn my opinion it was a bit short but it is a very fun game to play\n\nHelpful | 1", "TenTundra299Feb 18 at 9:00 PM\nHighly recommended\n\nWhen I first got the oculus quest I was looking for some new games to play and this was one of them and I dont regret it at all its a great game if I could change one thing I would want them to add more levels. Long story short if youre looking for a puzzle solving fun and immersive game to play this is it\n\nHelpful | 1", "Alexl342Feb 20 at 5:19 AM\nCant Stop Playing!\n\nThis game is a unique and fun attempt at puzzle games. Its premise is simple: youre trapped in an area, and theres a bunch of seemingly useless stuff in there to let you escape. Try not to die. I was on my toes throughout my entire playthrough, because the first thing you think when you spawn in is: Im gonna die. All the levels can be completed in under 3 minutes, but when you finally find out how to beat a level, hours have passed. The game is rewarding in a painful way. Whenever you complete challenges, you get new things in your office to play with. All of them were decently fair and simple to complete (except when you have to flashbang the plane, that was just cruel). Overall I had a great time playing this game. Definitely recommend it to anyone, wether theyre a veteran to VR or a brand new player, anyone can enjoy it.\n\nHelpful | 1", "DukeNCApr 14 at 5:56 PM\nI expect you to die\n\nFavorite of all games so far.\n\nHelpful | 0", "MewIsOGApr 18 at 3:23 PM\nGood\n\nGood\n\nHelpful | 0", "BeemBillzMay 29 at 12:24 PM\nGood game\n\nGood game\n\nHelpful | 0", "trost23Apr 2 at 8:19 AM\nIncredible\n\nThe game that made me realize VR had arrived and is the next big thing. Perfect.\n\nHelpful | 0", "dogscotApr 4 at 3:34 PM\nHighly entertaining\n\nNo regrets on this game, very entertaining and good price for value\n\nHelpful | 0", "matt1000_99703Apr 6 at 1:36 PM\n\nThis is the best VR game I have ever played in my life!\n\nHelpful | 0", "otters22Feb 17 at 10:22 AM\nBrilliant fun. Flawless gameplay.\n\nThe best game I've played on Quest to date. Levels are tricky enough to keep you busy for a good while, and the game has lasted longer than I thought (played lots over one weekend and still not completed it).\n\nEasy to go back to old levels to re-do them or to let a new player experience it from the beginning.\n\nThe controls work really well, they're very natural, and we haven't encountered a single bug or glitch.\n\nNarrative and theme is entertaining, even if you're not a Bond aficionado.\n\nIf you only shell out for one full game, and you like escape room type puzzles, make it this one.\n\nReally hoping the developers continue to release new levels, I'd happily pay for them each time!\n\nHelpful | 0", "BlackJesusKoolAidApr 6 at 7:18 PM\nAdd\n\nI believe you should add others missions then just 1\n\nHelpful | 0", "RG4PMar 7 at 1:51 PM\n\nEntertaining and frustrating at the same time. Very fun, but a short game for the price. Controls get frustrating at certain times and this is a game you dont do much movement with. It's all from the seated position. Still fun, but I think it could be a few dollars cheaper.\n\nHelpful | 9", "DethghostMar 19 at 7:51 PM\nLove this game one\n\nI love this game just one problem I think the little achievements should have a hint thats all and I still love it sorry about any errors\n\nHelpful | 0", "purpleneilsen2.0Feb 13 at 11:16 PM\nSuper fun\n\nThis game was totally awesome and really creative. The whole game is like an old spy movie with a goofy style that just totally adds to the great aesthetic of the game. Its very fun and totally replay-able. Its really easy to play to because your sitting, so you can play it for two or so hours at a time and your legs wont hurt like some other games. I would and do recommend this game to anyone and everyone. Overall though its a super fun game. I love it!\n\nHelpful | 1", "diestelhorstMar 6 at 12:23 PM\nDude, it's fun.\n\nA nice puzzle vr game. Has pretty crisp controls, multiple ways to complete certain objectives, and the narrator guy has a pretty nice voice. And you can eat a sandwich and catch a bear on fire.\n\nHelpful | 1", "benjaminthomasbyrneApr 1 at 2:14 PM\nVery very good\n\nBasically a whole series of escape rooms. Best game so far. Well done!\n\nHelpful | 0", "VanceTheWeebJun 12 at 10:30 PM\nAwesome!!!\n\nThere is not to many levels but there challenging and there is replay ability. Super fun. Would not suggest to anyone under 8 cause it might be to challenging but anyone above that would have a blast\n\nHelpful | 0", "brokentoofMar 16 at 8:58 PM\nVery fun\n\nVery fun puzzle game. No real story to speak of. Just enjoy it for what it is zero regrets for buying and recommend every one I show to try it.\n\nHelpful | 0", "japalmer1995Apr 20 at 9:37 PM\nI didn't expect to die this much\n\nPlease help this existence is pain my life is a lie I just expect to die. Games good play it, funny too\n\nHelpful | 2", "EvaSfezMar 23 at 11:54 AM\nI expect you to die\n\nThis is a very fun games ( one of my favorites). It is challenging and fun and I would love to have more levels.\n\nHelpful | 0", "hrdlukasMar 24 at 8:50 AM\nWohoo\n\nI need more... I was shocked when I found out that the game was over. Its one of the best games ever.\n\nHelpful | 0", "jleibsOct 2 at 7:18 PM\n\nWould give 4.5 stars if that was an option.\n\nThis game seems to be shorter than I was hoping for. I dont actually know how many levels there are  sounds like 4 or 5. We are now rationing the last few because we have been having so much fun and dont want it to be over. Delightful, surprising, laugh-out-loud gameplay. Would happily pay for more levels if they were available.\n\nHelpful | 69", "sl1mp1kk3nzMar 14 at 2:29 AM\nGreat game! Like a solo escape room.\n\nThoroughly enjoyed this game. I would say it's a must own. Wish there was more levels but I find that the case with most of the great games on Quest.\n\nHelpful | 0", "krxskyMar 19 at 11:34 PM\nSo so good for a puzzle lover\n\nThe experience is simply amazing and smooth. Really fun puzzle game. Right to the point and very intuitive control.\n\nHelpful | 0", "CondadobeachNov 10 at 7:32 AM\nMy favorite game of all!\n\nIve tried about 25 games in oculus quest, and this by far is my favorite. Creative puzzles, great graphics, and lasts quite a while. First purchase where I felt I got my moneys worth. If you like the app The Room, youll love this game. My only request of developers is to press a button to be able to see a plume of cigar smoke being exhaled!\n\nHelpful | 49", "2toesupMar 21 at 8:21 PM\nBest escape type game on VR\n\nFunny, clever, not too easy, creative, always interesting. By far the best game Ive played! Never tedious.\n\nHelpful | 0", "davetionaryJun 13 at 5:22 PM\nGreat even for newbies\n\nFun, funny, great to watch others puzzle it out. Even for people brand new to VR, what seems like a complicated control scheme quickly becomes second nature. This is a must have title.\n\nHelpful | 0", "kaiden909Feb 9 at 7:00 PM\nAmazing immersive game\n\nThis game knows how to really get you immersed into the game, its very interactive. Although if you binged this game you could get it done in les than 4 hours, but its longer if you try to find all of the extras. It brings challenging puzzles that could easily get you stumped. Its also a clever storyline, I have beat the game and now going back and doing all of the missions to get all of the Souvenirs. My only complaint is the ending is a little sudden, it gives you a so thats it? Thought. This game is worth every penny and I absolutely recommend it\n\nHelpful | 1", "LDCO07Feb 5 at 5:22 PM\nIts worth every penny\n\nThis game is sooooo fun I havent even finished the hole thing and I got it around Christmas time. The puzzles are super good and fun and the story line is great. I would have never thought I would have this much fun being a detective, the one problem is that I cant get past the train level other than that its totally awesome!\n\nHelpful | 3", "ruben.quintana101Mar 21 at 12:26 PM\nExcellent fun game\n\nGame shows how you react under pressure. Great graphics, story lines, and love the beginning credits!\n\nHelpful | 0", "3moose600Feb 27 at 5:50 PM\nWoah\n\n10/10 this game scratches your detective/spy itch. The puzzles are insanely fun and challenging and overall just makes you want to continue playing. I highly recommend this game for people just starting and veterans.\n\nHelpful | 0", "elcarrizoJun 27 at 2:16 AM\nNice Story\n\nI loved the puzzles, awesome music, awesome narration, had lots of fun, looking forward to a continuation.\n\nHelpful | 0", "King_of_MilkMay 19 at 6:46 AM\nMust buy vr game\n\nfantastic and fun! great to introduce others to vr with and very fun to play, it can also get the gears in your brain turning at times and really makes you think. Overall the story is ok, the graphics arent bad, it is super entertaining, fantastic puzzles, and there is a bit of humour too, but check it out for yourself.\n\nHelpful | 0", "createsureFeb 8 at 7:17 AM\n007 Themed Escape Rooms\n\nThis game is amazing. It is quite a feat to create escape rooms that are this difficult to solve, yet still possible to solve without help. The first couple levels took me a long time to solve, but I was able to figure them out on my own eventually... FUN!!! It gets a little easier as you learn the design style of the game, but is top notch fun throughout all of the six levels. Oh yeah, you play the entire game seated. I was a little apprehensive about this (since I normally like to stand with VR), but it actually works great for this game, since you are always in a seated, non-moving position in the game. (In a car, behind a desk, etc.) Buy this game, you won't regret it. And don't forget to watch the intro video if it doesn't play automatically, the song and imagery are awesome, just like the intro to a Bond film.\n\nHelpful | 1", "T-CroJan 5 at 7:35 PM\nIts Fun\n\nIts short, but Im gathering most of the titles on Quest are. Its a lot of fun too! Dont cheat and get walkthroughs, this is short enough to allow yourself some time to fight through the hiccups. This game performs nearly flawlessly as well - almost no problems at all. In fact, I cant even remember the problems that occurred.\n\nHelpful | 18", "Ray_RomanoMay 9 at 2:47 PM\nAmazing Game\n\nGreat game, the only problem would be that it's a bit expensive.\n\nHelpful | 0", "huntersp06Feb 9 at 4:18 PM\nBest game ever\n\nThis is the best vr puzzle game or puzzle room out there by far I managed to complete every level while some where short and others took hours there where no glitchs what so ever of 10+hours of game time the only challenge of it was trying to get all he sovereign and I still am I would recommend this game to any puzzle seeking person out there.\n\nHelpful | 0", "DotoliverMar 19 at 6:12 PM\nVery fun and immersive!\n\nThis game is a very clever, fun puzzle game. If anyone is looking at this, I suggest that you buy this!\n\nHelpful | 0", "CGalvaninMar 25 at 10:37 AM\nLove it!\n\nFun, single-player escape room with great spy theme. Highly recommend.\n\nHelpful | 1", "spacechase_08Jun 25 at 7:12 PM\nBest game on the Quest\n\nIf you like puzzles in any form this is the game for you. I found its length and playability perfect!\n\nHelpful | 0", "sambertFeb 5 at 11:20 AM\nClassiest game ever\n\nI Expect You To Die is one of the most amazing VR games I've ever played. Prepare to thwart nefarious plans, blow up heinous contraptions, and burn everything in sight all while being the classiest secret agent that has ever existed. It has smooth telekinesis mechanics that will make you disappointed when you have to walk to the other side of the room. The 60s comic book aesthetic is just amazing. The game's sense of humor continues throughout and just completes the game. And whatever you do, don't skip the opening credits .\n\nHelpful | 1", "FUSION_PANDA21 days ago\nPretty challenging but...\n\nEach level had a great obstacle that is hard to get over, but once you do there is no real sense of achievement and the game is far to short. It will only last about 2 and a half hours. Not really worth the amount of money they charge.\n\nHelpful | 0", "Knightmare1911Mar 25 at 9:19 AM\nFavorite game for Quest...so far\n\nI've only have a few games, but so far this is my favorite game.\n\nHelpful | 1", "ROCKETT06Mar 19 at 3:26 PM\nAmazing game.\n\nThis game is amazing and after downloading it quickly became my favourite game on the quest\n\nHelpful | 0", "unwant3dsinMay 15 at 3:36 AM\nFun & Frustrating....But in a Good Way!\n\nFun game where I could play with my GF. I would cast to the TV and we would both try to figure it out. As Escape Room fans this was right in our wheelhouse. Best part was in the comfort of our own home! Gameplay was simple yet challenging. Making you use your imagination to figure it all out! Don't sleep on this title! Definitely a must grab!\n\nHelpful | 1", "Helodog15TFeb 6 at 8:49 AM\nWhy buy an oculus?\n\nA buddy if mine had an oculus and let me play this game. I immediately ordered one after that experience. It's fun and funny. Challenging and rewarding. I cant wait for more episodes to come out. The game to me seems like it can last forever because I dont see how the developers could ever run out of ideas. It's a Must Buy. 5 stars\n\nHelpful | 0", "DailyVideosYTMar 17 at 12:01 PM\nFun, sad and RAGING GAME\n\nThis was a great game 5 stars definitely would reccomend\n\n\nSPoiler\n\n\n\nA sad ending where you die\n\nHelpful | 0", "ThatsALotOf_BeesApr 1 at 6:58 PM\nGood\n\nThis game is good\n\nHelpful | 0", "sguttbinderMar 6 at 11:54 AM\nA VR Escape Room\n\nThis game is worth every penny! Its mix of humor and puzzles make it exactly like a 'spy' themed escape room. Would highly recommend!\n\nHelpful | 1", "mschult13Mar 23 at 2:20 PM\nAwesome game\n\nCan't wait to see if a second title comes out. Fun game e\n\nHelpful | 0", "nmatteo17Feb 8 at 5:02 PM\nThe Names Quest. Oculus Quest!\n\nA clever and extremely entertaining game, I Expect You to Die is another example of how the spy genre makes for great entertainment! I would like to see a sequel to this game with more missions, more characters, and possibly some hand to hand combat with the skills of a spy.\n\nHelpful | 0", "ingurlundJan 26 at 10:37 AM\nI expect you to release more levels...\n\nThis was my first proper experience of the Quest, not mention VR in general, and I wasnt disappointed.\nThe great thing about this game is that it lends itself so well to group participation, which in this case meant the family all shouting at the one with the headset on and systematically turning them into a nervous wreck in the process.\nThis is a very polished package and a lot of time, care and attention to detail must have gone into it. I dont want to overdo things on my first review on here but there you go. If I could say anything to balance things out I would say that it perhaps wont be everyones cup of tea, but then what is?\nI was dubious, to say the least, about VR being anything but a solitary experience but, at least in the case of this game, I couldnt have been more wrong.\nThere was the odd crash involving the connection dropping (I doubt that was the fault of the game) but overall everything worked well.\nThe only thing to add is that it could do with more levels. I expect they will come in time.\n\nHelpful | 6", "dean.bridalJun 21 at 9:38 PM\nSo much fun!\n\nThis was actually challenging... and fun mirroring to the tv so others can help figure it out!\n\nHelpful | 0", "upalnightMar 31 at 8:00 AM\n\nShort but fun\n\nHelpful | 0", "Knarf76Mar 23 at 7:25 AM\nGreat game\n\nThis is game is fantastic. Great atmosphere and fun.\n\nHelpful | 0", "KaribeauFeb 8 at 6:52 PM\nEscape Room lovers dream\n\nSo much fun. My brother introduced this to me on his Vive. If you're looking for something for someone who is curious and loves escape rooms, have them play this .\nSitting down feels strange. You might end up with your hands in your dog's face. In that case just pet them.\n\nHelpful | 0", "RaqumupFeb 23 at 9:56 AM\nFun and challenging\n\nThis is a great game of like the kind of puzzle like stuff but it does not have many puzzles per say, but figuring stuff out. It has some shooting. They need to make a part 2. I would buy part 2.\n\nHelpful | 0", "dinomine3000Jan 31 at 4:11 AM\namazing game\n\nthe puzzles are easy enough to not get someone bored, and hard enough to get you thinking. the gameplay mechanics are great and the ideas behind the puzzles are smart. Schell games said they have released every free level, so im hoping they release more levels (even if paid, in packs) since the game is quite short for game, but long enough for a quest game\n\nHelpful | 1", "RocFlanaganFeb 2 at 3:13 PM\nFun Game\n\nI love the idea of this game. it is challenging and fun.\nThe challenges are tough but enjoyable.\nThe controls are a little glitchie.. Particularly, when it comes to dials. If you have to turn a dial it gets a little spastic. In their defense it could be that when it comes to certain types of articulation limitations of the Oculus controls themselves, or it just could be them, maybe half and half I don't know. but they put that movements in their game, when they could use buttons or keypads. that's a small issue in the game so it's only minimally impactful, all be it frustrating when you know what to do and the controls just aren't cooperating.\nWell I love the game and recommend playing it, you'll have lots of fun.\n\nHelpful | 0", "JigglyPuff69Jun 20 at 10:22 AM\nNothing else like it!\n\nJust bought the game and am addicted to it! New twists with each item you pick up! Very addicting!\n\nHelpful | 0", "RynotynoFeb 1 at 6:29 AM\nFantastic Game!\n\nThis game is hilarious and great fun for all! From zany gameplay and fantastic graphics you wont want to stop playing, and even once youve beat the game you can go back and get more achievements and prizes. Overall this game is perfect for someone who is bored and looking for a new game and wants to have some crazy fun!\n\nHelpful | 0", "NZL_K1W1Jan 29 at 10:19 PM\nI expect you to make more levels!\n\nWoah, dont really have a lot of words for this one.. This is probably the best Quest game I have played. Missions were exciting and loved the puzzle aspects to each level, at times I sat there completely lost! But overall this game is fantastic, only con is that it ended! Loved this game, would love more levels.\n\nHelpful | 1", "KidnapKermitFeb 28 at 9:31 PM\nTHIS GAME THOO.\n\nOk this game if FRIKIN amazing. Its one of the best games I have on oculus and its very entertaining. There are no words to describe how awesome it is. But the only thing that worries me, is that the last level is really, the last level. I hope that they make a sequel to the game because I was so sad that I had finished it \n\nBut it really is an amazing game.\n\nHelpful | 1", "MarkStirtonAberdeenMar 6 at 6:15 AM\nFantastic\n\nThroughly enjoyable game. Only seven or so levels, but each one is challenging and fun. A good seated experience, recommended.\n\nHelpful | 1", "JacobC1442Feb 24 at 9:45 PM\nWonderful!\n\nA must have on Oculus, this game immerses you in the life of a secret agent! It satisfies that urge everyone has when they watch a Bond film and wish they lived the spy life.\n\nHelpful | 0", "AzorthelawbringerMar 18 at 12:52 PM\nAmazing\n\nThe game is very difficult but is very rewarding at the end\n\nHelpful | 0", "DiscoDaveyJan 29 at 11:44 AM\nPolished game\n\nThis game makes you feel like James Bond trying to escape from the evil villains. Visuals are top notch and narration is informative and humorous. The levels themselves are tricky enough to give you a challenge and really think about how to get past the \"next bit\". They are never too hard that you feel frustrated at any point. There is plenty of content for the price and would be great to see more DLC levels In the future. Overall I would say one of the top 10 games on quest.\n\nHelpful | 1", "Faves83Mar 8 at 11:59 AM\nDope\n\nThis game is so much fun especially if you like puzzle games. I definitely recommend this game it's dope\n\nHelpful | 0", "NullicityJun 28 at 7:43 AM\nAmazing,\n\nU get what you pay for and much more\n\nHelpful | 0", "Clowers77Feb 15 at 2:50 PM\nGreat game\n\nGreat game, I love the puzzles and challenges. It was a good challenge for me and my son to play and talk about to get through the missions. We made it through them all, now we just wish there was more missions.\n\nHelpful | 0", "MICOXDFeb 17 at 10:50 PM\nGreat Atmosphere, Great Gameplay\n\nThe game I've had the most fun with on Oculus Quest. Lots of fun easter eggs. I can't wait for a sequel. Left me wanting one more level but they heavily imply a sequel is coming and I can wait.\n\nHelpful | 0", "AshewaJun 25 at 11:46 PM\nA wonderful game\n\nFun puzzles in a lot of interacting\n\nHelpful | 0", "RareBomber99Mar 10 at 4:34 PM\nThis is an essential game to play!\n\nOk, so I first played this game a while back, and its a lot of fun\n\nGet it!\n\nHelpful | 0", "sumoraoFeb 15 at 9:08 PM\nThe Perfect Combo\n\nThis game has puzzles that really make you think. But whats even better is the animation. Everything around you is so real. I can literally play forever. But can you please make more levels.\n\nHelpful | 0", "roguetravelerJan 24 at 11:37 AM\nGreat puzzle fun in a 007 kinda way\n\nThis game is great. Its a puzzle based game where you have to figure out what to do as a secret agent (think 007).\n\nIts not always easy to find the clues, but also not so impossible that you cant ever get passed a level.\n\nPlayed it for hours and its still fun.\n\nHelpful | 3", "jervoelzMar 19 at 3:48 PM\n\nGreat game! Really enjoyed it.\n\nHelpful | 0", "Frantheman121Mar 5 at 9:15 AM\nANGER\n\nit's great but I can't get oxygen is for the weak souvenir on the death engine IM SO MAD\n\nHelpful | 1", "deeepCMar 11 at 3:36 PM\nVery fun, however not very difficult\n\nThere are a few later levels that will take some time and thought to figure out, but other than those, pretty easy game. That being said, still a lot of fun, and many satisfying moments, not to mention very good graphics. Would love if it were a bit harder, and had more levels.\n\nHelpful | 1", "bigduckhunterFeb 16 at 8:30 AM\nAmazing\n\nMy second favorite game after SuperHot. Such good puzzles, production, and humor. A+\n\n\nJust wish it was longer but when you see the credits and how many people worked on this, I get it.\n\nHelpful | 0", "Rick_R-347May 2 at 4:00 PM\nTEAM VENTURE!\n\nI love this so much. I just bought the bundle and I'm playing the first level,listening to the evil dr Zorr's phone messages, and it occurs to me, who's this guy think he is, the mighty monarch? Cause i feel like rusty venture sneaking through his junk,laughing at him. Where's a henchman for me to shoot? That's all this is missing. A tranq gun and some sweaty out of shape bad guys for me to shoot at while Brock rampages. Have to keep them away from my useless kids cowering in the corner or something.\n\nHelpful | 0", "derekskins20Apr 14 at 5:26 PM\nGood game could be longer\n\nGood game with great mechanics but there is only 7, 10 minute games but otherwise super fun and exciting\n\nHelpful | 0", "curtis.bostedtJan 23 at 5:40 PM\nLevel3is to hard\n\nmake levels 3 in your game easier to do cuz I can't even get past the combine Nation thing I've looked up gameplay walkthrough and I've still not been able to do it in time so please give us more seconds to solve it like maybe give us like a minute cuz then we can try to at least get it right and stop exploding us if we get it wrong we should at least get like three or two tries until it blows up\n\nHelpful | 0", "eatgelatoFeb 28 at 4:35 PM\ncool game\n\nI just bought it today and I played for about an hour and a half, feels short but may just be how much fun Im having\n\nHelpful | 0", "BadLobsterMar 5 at 4:16 PM\nFreaking awesome\n\nAs soon as I got this game I played it all the way through, nonstop.\n\nHelpful | 2", "Drb.danielMar 10 at 6:15 PM\nExcellent!\n\nSo much fun ! Worth every penny! A must ! Can't wait for more!\n\nHelpful | 0", "CatKing5Mar 9 at 10:56 AM\n007\n\nOne of if not the best vr game I have ever played. Its amazing!\n\nHelpful | 0", "IcabodikaMar 11 at 12:10 AM\nJolly good romp\n\nFun for all the family. Love all the mini achievements\n\nHelpful | 0", "ROGUE-ONE1Feb 22 at 7:22 AM\nGreat Retro-Bond Themed Escape Room\n\nThe theme was a throwback to some of my favourite Bond films. The puzzles were awesome!! Cant wait for the sequel! Great job guys!!\n\nHelpful | 1", "oculusuzerFeb 26 at 7:38 AM\nGreat game\n\nThis game has constant free updates with new content, and is also the most high quality game on the platform in my opinion.\n\nHelpful | 0", "brandonhamMar 15 at 10:31 PM\nReally fun\n\nWish there were more levels!\n\nHelpful | 0", "PTP400Apr 17 at 8:08 AM\nLooking good\n\nI'm only a few levels in and enjoying it. Puzzles are challenging but logical.\n\nHelpful | 0", "comicwhisper773Mar 10 at 9:17 PM\nOne of the best\n\nThis is one of the best games in VR. Worth the money\n\nHelpful | 1", "MiniMe71Feb 11 at 6:08 PM\nGreat game\n\nThis is an awesome game, once you start, you just want to keep going.\nQuite challenging and frustrating in parts. My only gripe is that i wish it had more levels but it's still good value as is.\n\nHelpful | 0", "JenspadMar 6 at 8:44 PM\nGreat secret agent game!\n\nLet me first say I love this game it's tons of fun and quite humourous as well. I will say thank goodness I bought it after the added missions because even with them I believe it's at a higher price point than it should be. I wanted to buy this a long time ago but wanted to wait for a discount or promo code which never came so I was forced to pay more than I wanted to. I would like to suggest possible hints when you get stuck as I had to look up the final chapter for some help after frustration set in which becomes no longer fun and although very replayable for the extra trophies it would be nice to know specifically how to get them and some of the times trials are near impossible to achieve. Definitely recommend this to anyone who likes accounting+ as well as puzzle games can't wait for more missions in the future!\n\nHelpful | 1", "HarryPotter9Jun 26 at 1:27 PM\nGood\n\nGood Good\n\nHelpful | 0", "gamemasterpuppetMar 17 at 6:01 AM\n\nGreat game to play\n\nHelpful | 0", "kingofmath12May 8 at 6:25 PM\nTo hard\n\nLevel 7 is so hard sofar it has taken me 19. Trys to get half way\n\nHelpful | 2", "LonelyZealJan 18 at 7:11 PM\nMore levels please!!!\n\nAmazing, just amazing. I really love this game, even if I only have 6 hours in it, and am still stuck on the last level, I can genuinely say that I love this game and the mechanics it has in it. This game makes me feel like I am in these weird locations, and therefore I have hit my brother and desk trying to grab stuff. But worthy gameplay\n\nHelpful | 1", "LpsgchaserileyDec 27 at 6:01 AM\nGood fun, a little bit short\n\nI expect you to die is a great, great game. Every level has me thinking in different ways to figure out the puzzles and the setting nails the late fifties/ early sixties feel. My only criticism is length, and I would love for community created levels to be a thing. Other than that I absolutely love the game and would highly recommend it\n\nHelpful | 12", "five.eleven.88Mar 13 at 5:59 PM\nLove it!!\n\nHope more levels come out soon!!!!\n\nHelpful | 0", "StraberyLifgardJun 17 at 4:01 AM\nVery very fun\n\nWish it was longer. I could play this all day.\n\nHelpful | 0", "DoodooooApr 16 at 4:48 PM\nBug\n\nSo this game started off really fun but when I got to the airplane level it didnt let me shoot the gun in the truck and I did it over and over again I did it just like the video but still didnt let me shoot it.\n\nHelpful | 1", "Onitot00Mar 16 at 10:13 PM\nGood\n\nVery good\n\nHelpful | 0", "LucidDazeFeb 18 at 1:18 PM\n\nOne of my favorite games on the quest so far, levels are challenging and force you to have to really think. Definitely takes a lot of trial and error\n\nHelpful | 0", "mchsaJan 17 at 6:22 PM\nAmazing Game\n\nI enjoy all genre of video games and can say with 100% certainty that this is quite possibly one of the best games that I ever played. The intro song alone is just amazing. The levels are extremely challenging and this game shows the pinnacle of VR technology. You wont regret your purchase.\n\nHelpful | 1", "Alex_SizzlingYTJan 18 at 8:36 AM\nBest game ever and challenging\n\nOne of my main problems with games is that they are just straight forward and don't have a lot of you actually thinking out of the box with also being fun.\nWelp... This is just what I've been looking for. It has a good and mysterious story with adventures and challenges to do if you want more action.\nThis is my favorite game so far and I hope you buy it as well.\n\nHelpful | 0", "PR0JECTViperFeb 16 at 12:50 PM\nDont hesitate buying this\n\nThis game is just perfect in every way. Just buy the game and youll understand why. Please make a number 2 of this game and dont lose the morales!\n\nHelpful | 0", "jimmy.emmons.9May 22 at 9:12 PM\nUnexpected awesome\n\nI wasnt sure about getting this game. Ive done the first two missions its incredibly creative and so much fun! Easily 5 stars one of my favorite games!\n\nHelpful | 0", "lee.capiliFeb 20 at 10:36 PM\nFun twist on an escape room\n\nPretty fun so far. Its a spy-themed escape room with a sense of humor. It also makes decent use of the VR interactivity.\n\nHelpful | 0", "MoobertJan 13 at 7:51 PM\nAmazing game!!!\n\nI love this game. Everything from the art style, to the music, to the dev. commentary is wonderful. I always thought that it would be cool if you got to sneak around and be stealthy for one of the missions. Maybe that could be an option for a later game. Who knows. All that I know is that I love the game and the devs. have lots of respect from me, since it couldnt have been easy to make a game this good where you never move from your chair.\n\nHelpful | 1", "MopsinatorFeb 5 at 9:25 AM\nNext to Red Matter this is number 2\n\nAmazing game. Challenging but doable puzzles.\n\nImmersion was incredible but Red Matters ability to move around while solving the puzzles made you feel a little bit more immersed. Def buy and play!!!\n\nHelpful | 0", "Mommygang46May 29 at 9:45 PM\nGreat game\n\nThe levels are amazing crafted to just sitting down and its amazing how they designed the game around that mechanic\n\nHelpful | 0", "xxxRHINOxxxMar 1 at 10:06 AM\nGreat game\n\nThis is a great game and well worth the prices. Please add more levels!\n\nHelpful | 0", "JoedabombJun 21 at 3:48 PM\nYeet\n\nAwesome\n\nHelpful | 0", "MrDonnieXFeb 28 at 1:02 AM\nLove it. Pretty awesome\n\nA must play. Challenging puzzles. Great story. Like the developer commentary.\n\nHelpful | 0", "fernando.vazquezjrFeb 18 at 5:50 PM\nVery interesting very entertaining\n\nI'm not going to die this game is awesome.. it keeps you so intrigued it's awesome!!! Definitely enjoy every moment of it \n\nHelpful | 0", "Golfer725Feb 15 at 9:46 AM\nLots of fun!\n\nThis game is a lot of fun and can be quite tricky. It all has also has a wry sense of humor which makes you laugh a lot. I really enjoy this!\n\nHelpful | 0", "SplarkeeFeb 22 at 9:41 PM\nClever escape puzzle shenanigans\n\nI expect you to die is a series of fun escape room puzzles each scenario being a spy mission to thwart the plans of Dr Z the antagonist. You can grab distant objects with telekinesis and freeze them in midair making interacting the environment a breeze.\n\nWhile some puzzles are less interesting (particularly the first level), some of the final levels are creative and exciting and make you really feel like a spy.\n\nReplay-ability comes in the form of extra challenges for each level including a speed run.\n\nHelpful | 1", "ZweifelMar 6 at 6:30 PM\nExcellent seated experience\n\nThe levels are fun and witty.\n\nHelpful | 1", "MassMonster37Jan 12 at 10:30 PM\nIMMERSIVE\n\nGreat game, tons of fun puzzles and trying to get all the souvenirs is a blast, and then you have speed runs where you can try and get the different trophies, overall the game is a must have for all the heavy thinkers and James Bond wannabes (Because it has an early spy days feel ) All in all I would totally recommend it.\n\nHelpful | 0", "twangymosquitoMar 24 at 8:49 AM\nBrilliant!\n\nAbsolutely brilliant game! Even the intro scenes in a james bond falling/rolling to the next bit with the theme song singing I was blown away at. I was standing there smiling. I did have to Google for 1 or 2 of the parts of the puzzles but it was always a kick your self moment or not realising the capabilities/range of the game!\n\nI had an awful lot of fun playing this and was the first puzzle game I played in vr. Certainly wasn't disappointed and recommend for anyone who likes puzzles or escape room scenarios.\n\nHelpful | 0", "XelinorMay 12 at 6:16 PM\nBest intro ever!\n\nGreat game, and to top it off it also had a phenomenal intro sequence. VERY on-theme and just plain awesome! Puzzles were mostly easy, but there are a few tough ones. Just a really great time.\n\nHelpful | 0", "BigSlut77Jan 10 at 8:36 AM\nThe names Bond, James Bond\n\nI want to start off by saying this is one of the greatest games Ive ever played. To describe it as immersive would be an understatement, I felt like I was in a classic James Bond movie. Each puzzle had me dying over and over slowly piecing it all together until finally, mission accomplished. I have nothing bad to say about this game I just hope to play some more missions. The latest one in space was amazing and can only hope for another. Easily 5/5 stars!!\n\nHelpful | 1", "RagingredwoodJan 26 at 2:12 PM\nGreat time\n\nI was not sure about this game until I played it. I enjoy the clues and figuring them out. It is different in spy game. I do love the cigars and the glass of soothing drink as part of being the spy. I enjoy the game now and I hope it is more to come.\n\nHelpful | 0", "ChrisMartasMay 20 at 9:16 AM\n\nFan of Sean Conerry's James Bond and always enjoyed challenging my self with complex puzzles. And all these in VR. WHAT MORE COULD YOU WANT? LOVE IT!\n\nHelpful | 0", "RackersonApr 28 at 2:55 PM\nGreat puzzle game\n\nI was searching for a game thats challenging , then I found I expect you to die. I knew this game would be great from just looking but I went deeper and wont go into detail. But if your looking for something hard , play this. Its also worth the money\n\nHelpful | 0", "jericho2005Feb 7 at 9:23 PM\n007\n\nI felt as if I was James Bond, it was brain puzzling and made me determined to solve every level. I had so much fun with this game and would suggest it to anyone.\n\nHelpful | 0", "jediorder66Mar 9 at 4:39 AM\n\nSo much fun\n\nHelpful | 0", "unqDec 7 at 1:11 AM\nThis intro!\n\nIntro of this game is the best thing I have seen in VR. Wow! I'm astonished. And not only with this intro.\nThe whole game is super polished. Everything works smooth, and natural. I really enjoyed playing it and playing with it. Now, let's point some facts:\n\n1. You play the whole game in sitting position. This is nice change in VR games world. You can just sit down, play with some staff, and rest.\n\n2 You are sitting, but you can interact with things on a distance. For example you can pull some things just to catch them and play with them around. And there is a lot of things created just to play around.\n\n3. The whole game is like escape rooms with no math or complicated analysis involved. I found it challenging and relaxing at the same time (usually there is no time pressure).\n\n4. After you finish a level there is still replayability value: each level has achievements and you need to play with those levels a lot to unlock them all.\n\n5. If I count correctly there are 6 levels. The variety of locations is impressive in my opinion (even if many items are reused in each level): there is a plane, a train, a space station, etc. Each of them is unique in the context of puzzles.\n\n6. The theme is very solid, there is no plot, but everything is connected and consistent. It's a spy theme with a lot of humour. And everyone likes spy themes ...and humour. So stop reading this and buy the game already.\n\n7. I'm not the guy, who gives 5 stars easly, but this game couldn't be better. I find not a single element I would like to change. Ok, maybe those scorpions. I hate scorpions. And bees. I hate scorpions and bees. But I love everything else in this game. And I think you will love it too (excluding scorpions) if you buy the game already.\n\n8. Seriously, you could already play this game. Why bother in reading this? You need to finish everything you started, right? I bet you will listen all messages on Dr. Zor's voicemail, when you find it. There is a ton of messages there, because Dr. Zor is too busy doing staff for your attention. Seriously, who recorded all of those? ...you can check by yourself, because there is also a commentary mode in this game (after you finish it). But you need to buy the game first, and reading this is not helping you anymore.\n\n9. I could write more, but I want you to buy this game already.\n\nDo it.\n\nHelpful | 18", "Baxter3.0Jan 19 at 1:00 PM\nThis game drives me insane!\n\nI love this game but it irritates the life out of me I know people say this game is short but I could only just get past the second mission after around 20 million attempts! In all seriousness this is a great game and I swear on my life I will complete it.\n\nHelpful | 0", "Minty507Mar 3 at 5:37 PM\n\nIts just the best game\n\nHelpful | 1", "tmayo250Jun 8 at 2:01 PM\nPretty awesome\n\nIf you love puzzle games this is a must have!\n\nHelpful | 0", "Diezel544Jan 8 at 7:40 PM\nMust buy\n\nThis is the first game I played on the quest and I played it until my headset died, waited for it to charge, then played it some more. Great thought provoking puzzles and humor. I also love the office where u can sit and listen to old music while smoking a cigar and drinking some champagne. This is a must buy game. Definately worth the price.\n\nHelpful | 0", "eking1.2.3.Feb 22 at 3:31 PM\nAwesome\n\nFun. I got it in a bundle with the under. Enjoyed it very much. Would recommend.\n\nHelpful | 0", "BungoBoiFeb 17 at 10:17 PM\nI love this game so much\n\nI bought it and was instantly hooked. I got evey souvineer for each level before moving on to the next, and I love all the mechanics of this game.\n\nHowever, the game freezes and crashes frequently and some of the souvineers are very difficult to guess. Additionally the final level has a glich where you can pit a gravity crystal through the wall and instanly beat the level in about 30-40 seconds.\n\nThis game deserves a 5 star rating just from the story and amazing ending alone but I had to knock one off due to the crashing and slight bugginess.\n\nWould reccomend to anyone looking for a fun, replayable game. Worth every penny.\n\nHelpful | 1", "Jake4444Jan 11 at 5:56 PM\nFun game\n\nThis game is very fun its not short its not long my favorite mission was either the train or the lodge,I hope you guys make aI EXPECT YOU TO DIE 2. The graphics are amazing and the way that everything moves and works is really fun and cool. Thanks for the awesome game guys\n\nHelpful | 0", "Dossier-5Feb 20 at 5:33 AM\nSatisfying puzzles\n\nI enjoyed the style, the characters, and the escape room puzzle format. 5/5 would buy\n\nHelpful | 0", "KiNg_BiLlyJan 11 at 1:44 PM\n\nThis game is awesome and definitely worth the money! If you love puzzle solving games youll love this and somehow it manages to make the people that love action love this game too its a very well rounded game and its fun to try and get all the secrets to deck out your office!\n\nHelpful | 0", "unpopularwhaleFeb 15 at 1:19 PM\nITS AMAZING!\n\nOne of the best games I have ever owned on Vr. Hoping for more levels soon because I cant get enough of it\n\nHelpful | 0", "JakeyjujuJan 24 at 3:35 AM\nGreat puzzles and presentation\n\nThe art style and design is well done and emulates 50s/60s spy films flawlessly. A bit short given the price unless you try the souvenirs and speedrun challenges, which challenge you to solve problems in new ways.\n\nHelpful | 0", "OstisomaFeb 27 at 5:36 PM\nGreat level design + immersive experienc\n\nI suck at being an agent and yet I enjoy so much\n\nHelpful | 0", "PlayerNMay 3 at 4:17 AM\nFun Game\n\nNot usually a fan of puzzle type games, but decided to try the game anyway. So far only done a couple of the levels, but after the snazzy intro and those levels, I'm definitely looking forward to playing the rest.\n\nHelpful | 0", "scotty341Jan 28 at 12:18 PM\nOne of the best.\n\nA real must have for VR, only real criticism is that there isn't enough of the game. Despite there being a solid few hours for a reasonable price. Would recommend for new and seasoned VR players.\n\nHelpful | 0", "Not-DB-CooperDec 22 at 6:04 PM\nI don't like this genre\n\n...but this game is absolutely brilliant. The humor, atmosphere, and pacing of the game are done so well you feel like you're in an over the top spy movie. The existence of the puzzles makes reasonable sense, which is one of the things that has always bothered me in other games of this genre. Also, many of them have multiple solutions. Everything I tried that should've worked, did work. I hope other game designers are taking notes!\n\nHelpful | 8", "Link29011Mar 15 at 6:55 PM\nGREAT GAME... but...\n\nOne of the best oculus quest games... but this game I completed in less then 3 hours and this game needs more to it. If there is more to the game then I will rate five.\n\nHelpful | 0", "Dogey_Boi2Jan 24 at 4:26 PM\nGreat Game!\n\nThis game is a great game to play when you are bored. Its a puzzle game starters to vr should buy first. Last mission is a little difficult, not knowing what to do and lost, but game is great overall for a while!\n\nHelpful | 0", "spiff1281Feb 14 at 8:27 PM\nEscape room like experience\n\nI am really enjoying this puzzle game. A lot of puzzle and an escape room like experience. Recommend!\n\nHelpful | 0", "infurioMay 26 at 10:16 AM\nGreat idea, but too short\n\nFun game to play, but you'll be finished in no time\n\nHelpful | 0", "J4bberwockJan 4 at 2:46 PM\nEscape room puzzle fun!\n\nI love puzzles and escape rooms, so this was a must-buy for me, and Ive loved every moment of it. There are real think-outside-the-box moments, and the satisfaction of figuring out how to complete each level is immense. I love the theme, the feel, the excitement, and the stress. Its a perfect blend for me. Highly recommended.\n\nHelpful | 1", "butch.thompson.948Feb 18 at 12:19 PM\nFun..... But\n\nIs there going to be anymore maps uploaded soon I bet the game and we need more maps\n\nHelpful | 0", "BarbersRusFeb 26 at 4:21 PM\nSo good I wish there was DLC\n\nThe game was awesome. I wish there was more!\n\nHelpful | 0", "Zzippy77Feb 1 at 10:44 AM\nBest Game\n\nThis is by far my favorite game so far on the quest! Its something that keeps you thinking even when you arent playing it anymore. Really hope they add more levels\n\nHelpful | 0", "thecatisthebestJan 18 at 9:11 AM\nThe best vr puzzle game\n\nThis game is possibly the best vr puzzle game. The puzzles cannot be guessed at, and are very hard, but when you know what to look for it is a little more easy. However, all of the situations are different, and will keep you on your toes.\n\nHelpful | 0", "quetzal22Feb 16 at 9:20 PM\nVery fun\n\nI love this game all around because it is the focus of virtual reality and is very fun.\n\nHelpful | 0", "ksenter4Jan 30 at 6:26 PM\nBuy buy buy\n\nThis is one of my favorite games and I wish it never ended. I wish I was paid to solves these puzzles day after day, I love everything about it! Well done and keep them coming!\n\nHelpful | 0", "SuperTALLJan 5 at 5:52 PM\nBetter standing\n\nThis games makes you feel like James Bond, and puts you in high intensity situations. This games really tests you- and doing things in the right order or in the right way isnt always obvious. This makes for challenging levels that are replayable. Watching some speed runs on YouTube make you appreciate how you can really push and to play over and over again.\n\nHelpful | 0", "Jesse190Dec 31 at 11:33 PM\nbuy it\n\nIf you are not 100% sure about this game, watch a couple reviews and I strongly recommend buying this. From start to end this game is highly immersive and is graphically impressive. This game is also very replay able due to then many ways you can achieve the same outcome. The speed run aspect for this game is also very compelling. My personal best for level one is 29 seconds. I thought this was impressive until I was amazed by finding out that someone did it in 17. Overall this game is amazing and I recommend it.\n\nHelpful | 2", "SUPERHOT.exe.gamerJan 28 at 1:38 PM\nThis is the perfect vr game!\n\nHave you ever wanted to be a secret agent? Go on missions like James Bond? Well now you can! With this outstanding game you feel like a secret agent. So are you ready to save the world?\n\nHelpful | 0", "ShweatyTipsApr 29 at 1:16 PM\nGreat puzzle action game\n\nGreat game to play with 2 or 3 people. Try a mission and help each other get 1 step closer to solving it. New to vr and definitely a big fan of this style of puzzle vr gaming! Highly recommended first purchase of quest.\n\nHelpful | 0", "alexis.meyer.91Jan 30 at 8:48 AM\n\nThe best game so far if you want to play or share with family. I love escape games and i think the game is pretty intuitive and fun. So far the best I ve tried on oculus.\n\nHelpful | 0", "XMasterGunsXJan 2 at 1:49 PM\nJames Bond simulator\n\nLet me say this first, THIS GAME IS AWESOME! It is one of the best games Ive had ever played. I love that there is more things to do after you complete the game like collecting the souvenirs or listening to the commentary from the creators of the game. I really hope they make a I Expect You To Die 2 of some other title because this game was amazing. If the creators of the game read this, if you make a second part to this game try adding all the original ideas you were going to add to this game to the second part like the giant squid you were going to add to the 3rd level. Or add some extensions to this game like extra levels you can purchase. Love this game, I highly recommended this game to everyone.\n\nHelpful | 0", "CkempMar 1 at 10:32 AM\nAmazing.\n\nYes.\n\nHelpful | 0", "OliverOlsenFeb 18 at 11:49 AM\nIts so good\n\nSoa I axpact yuo to dei iss so LITTY.\nI roeally lieke the geame\n\nHelpful | 0", "mattamatesJan 17 at 6:45 PM\nAbsolutely the best vr game I've played\n\nDespite this being such a small game it came with a bunch of free updates that add maltipul levels and just expanding the world that the game makes this is probably my second favorite game on vr next to the climb\n\nHelpful | 1", "MisterSmoothFeb 16 at 10:33 PM\nPretty okay...\n\n... for a tech demo. It's a rather nice demo, but I don't appreciate paying $25 for a short thing like this. Love the quest, but wish there was an actual long-ish game for it. Graphics are nice and the puzzles are odd and interesting. But, that's about it.\n\nHelpful | 3", "matthewrosado21Feb 7 at 4:05 PM\nI expect you to try this\n\nAmazing intuitive and all around great game concept i think it may need more levels and stuff but its a great game\n\nHelpful | 0", "EAGLE_EYE_BrUhApr 8 at 9:11 PM\nGood game\n\nLove this game\n\nHelpful | 0", "CaptainZitroneMay 17 at 1:19 AM\nOne of the best games i ever played\n\nThis game is just perfect with its narrator and is the perfect Balance between a Agent game and a Film 10/10\n\nHelpful | 0", "balaji.santharamApr 28 at 11:41 PM\nI'm not a puzzle lover\n\nI'm not a puzzle lover\n\nHelpful | 2", "Assassin06000Mar 14 at 9:23 PM\nAmazing but not enough story\n\nI absolutely love this game, but there isnt enough story I think like I finished it in like 3 days. Other than that I love this game!\n\nHelpful | 0", "nshadovFeb 11 at 1:24 PM\nEntertaining, funny and unforgiving.\n\nThe game will give you plenty of time to think. But if you make mistake or push it a little to far it will demand thinking on the go while time is ticking.\n\nOften you will end up with something in your hands you would like to get rid of quickly. Puzzles are very logical and solvable on the first try.\n\nThe only thing that's missing for me - is short and doesn't contain additional levels or community level editor.\n\nHelpful | 0", "mbintxMay 25 at 10:54 AM\nPretty good so far!\n\nIve only played it for a few hours but I really like so far!\n\nHelpful | 0", "AxisWLFJan 21 at 6:16 PM\nHad a blast!\n\nGame was right on man! Controls felt great, story was fun, puzzles had the right amount of difficulty and you can even light up a cigar and toast with champagne! No gripes on my end!\n\nHelpful | 1", "SouthcatDec 27 at 8:04 PM\nWelcome to I Expect You To Die\n\nThis game is amazing from the intro to the finale. The theme of the game is amazing and the opening credits are so creative. Each level is beautiful, with puzzles around every corner and 6 additional challenges. If you love escape rooms, I HIGHLY recommend ou pick up this game, it is well worth $25 (less than the average cost of an escape room, I might add.) Pick up this title.\n\nHelpful | 1", "djmas4444Dec 30 at 7:06 AM\nIt was a cool game!\n\nThis is one of the best games for tight spaces. It is easy to play, and the puzzles are just difficult enough to make you want to look up the walkthrough but fun enough to keep you from doing so. The free updates once in a while kept me coming back and the souvenirs in each level are fun to get. I recommend this game for sitting down in a small room or to chill out from games that exercise your body instead of your brain. I couldnt put the headset down after one level! It was a funny, great game and I wont forget the experience.\n\nHelpful | 0", "cerebusfromhellApr 8 at 6:18 AM\nI expect u to die\n\nGrate game\n\nHelpful | 0", "komelishFeb 22 at 1:02 PM\nBest game\n\nI love this game... thats all\n\nHelpful | 0", "ddaystill78Feb 10 at 5:39 PM\nThe best\n\nA really fun puzzle game one of the best so satisfying to unlock new things a 5 out of 5\n\nHelpful | 0", "lattenwaldMay 4 at 2:54 PM\nNow this I did not expect.\n\nOne can hardly expect finding oneself smoking cigar while driving a car from a flying plane, filled with poisonous gas. Also I managed to survive, on the third try\n\nHelpful | 0", "OlivierTofuJan 25 at 11:35 AM\nIt feels agent 007\n\nI loved everything in this game.\n\nThe story, the graphics, the controls and the humour.\n\nIt's a good five star top notch game. There is nothing more to say about it.\n\nHelpful | 0", "mrnoone1216Feb 3 at 1:24 PM\nNate\n\nI love the game it is not like those games where it is just too impossible to beat and you have to search a YouTube video\n\nHelpful | 0", "secretNASA10Feb 14 at 2:29 PM\nBest game ever\n\nThats all I have to say\nIt is a great game\nI rate five stars\n\nHelpful | 0", "TurkishDlight94May 11 at 1:02 PM\nGreat VR intro\n\nGood way to jump in VR gaming and easy enough to use to introduce friends and family to VR! Definitely worth checking out.\n\nHelpful | 1", "starvinmarvin888Jan 26 at 8:33 PM\nLoved it\n\nI had a lot of fun playing this and I havent completed what I think the last one is but it is fun especially the second mission aka the cleaning one\n\nHelpful | 0", "DoominatorMJan 26 at 9:57 AM\nIts amazing\n\nI play this game as much as can. The detail that they put in to this game is amazing. Its very challenging but when you figure it out you say yess!\n\nHelpful | 0", "BwadejsDec 24 at 6:09 AM\nBrilliant\n\nUpdate. This is possibly my favourite game on the quest and my favourite puzzle game ever.\nIt isn't the longest and once you've played it a few times you know the solution and it doesn't have as much replay ability. But that said, the first time you play this is more than worth it.\nMost puzzle games are too simple but this game does not dissapoint and is truly worth the price.\nGame is not glitchy or buggy, well thought out.\n\nMassive thanks to the dev teams for all the extra levels and for being kind enough not to charge for them. I really really hope you will make a sequel\n\nHelpful | 2", "22Tman22Feb 18 at 8:18 PM\nBest game on quest\n\nBest game I have wish it was longer\n\nHelpful | 0", "Spike3o0oFeb 3 at 2:03 PM\nAgent Snooze\n\nClearly inspired by James Bond 007, I expect you to Die is a series of Escape Room like scenarios that each last for a few mins before you either figure out the particular way to escape or die trying. It's an interesting concept that unfortunately grows tiresome after a few missions. I wish the game allowed you to explore like a real secret agent rather than having each level take place in a completely stationary environments like a Car or outside a building's window etc. Buy it on sale it's definitely not worth the full asking price but it's a decent time killer nevertheless\n\nHelpful | 6", "TheGydeFeb 25 at 10:32 AM\nIts a game\n\nDope\n\nHelpful | 0", "CanadianMilkBearFeb 2 at 1:32 AM\nAbsolutely Amazing\n\nI loved every minute of this game. I honestly can't say anything more because you need to experience it for yourself.\n\nHelpful | 0", "Cain0zJan 17 at 12:41 AM\nAmazing fun and a great buy\n\nThis is an amazing fun game. Especially if you like escape rooms.\nI normally don't play single player games more then once. But I have on this one. The new levels are also a lot of fun.\n\nHelpful | 1", "goofyblocksDec 31 at 10:48 PM\nI love it\n\nThis is the perfect for all and any puzzle loving person, every time you do something right on your own you feel super awesome. Just the opening credits made the game worth it, it pulled you straight into what you will be dealing with. No more is to be said just get the game!\n\nHelpful | 0", "TheSharkManFeb 14 at 7:40 PM\nA must have on oculus\n\nThis game is really great for it's puzzle solving.\n\nHelpful | 0", "KabobMaster09Feb 17 at 11:08 AM\n10/10 - me\n\nJust a general blast to play.\n\nHelpful | 1", "BananaPoet14May 17 at 11:58 PM\nFun Game!\n\nI have had a lot of fun with this game! It is a game that gets you thinking!\n\nHelpful | 0", "ShibashroomFeb 6 at 9:36 AM\nAwesome game, just hoping for a bit more\n\nThis is without question one of the best games on the quest, but it was pretty short. Only a few levels for $30. Im just hoping for a bit more content to play through and not just replay the levels Ive already beaten to get souvenirs. Even 3 or 4 new levels would make this game all that much better.\n\nHelpful | 0", "Fixit_RogueFeb 14 at 6:06 AM\nNice\n\nI Love the last level in the space ship\n\nHelpful | 1", "TurtleDerpJan 26 at 6:06 PM\nThis game is so immersive.\n\nOnce I started up the app I knew I was in for a treat, it was so fun and immersive Id literally wake up in the middle of the night to play.\n\nHelpful | 0", "SventienialApr 18 at 2:37 PM\nThe only VR game I need\n\nI cannot stop playing, replaying, finding souvenirs, and expecting my death. A genuine masterpiece. The post-completion optional commentary bubbles that let you hear the developers process and plans are an amazing detail.\n\nHelpful | 0", "SRS-At-The-BeachMar 28 at 11:06 PM\nGood but not great\n\nI expected much more from this game. Compared to other games Ive purchased so far on the quest. I would say this game is just okay.\n\nHelpful | 0", "Llama10Feb 15 at 2:39 AM\nDis is amazing\n\nIt is puzzle game puzzle game fun\n\nHelpful | 0", "PackDaddy80Jan 26 at 8:58 PM\nCreative & Different from the norm.\n\nLove it. Insanely hard. But totally worth the agony and constant failing. Im only on the 2nd mission and its a doozy.\n\nHelpful | 0", "SeveredBear4445Mar 23 at 9:44 PM\n\nGood but the sub mission and train mission are HARD\n\nHelpful | 0", "NickWhiteK9Feb 6 at 7:46 AM\nLove it\n\nMy gf and I LOVE this game! Developers, keep coming out with more levels!!!\n\nHelpful | 0", "BowlerboyyyyyJan 23 at 12:21 PM\nJUST WOW\n\nI tried the demo at a convention and I loved it and when I saw it in the shop I had to buy it this is by far better than other spy games so get it already its so immersive\n\nHelpful | 0", "FatalSnuffDec 27 at 2:58 PM\nAmazing fun\n\nIve spent a TON of $$ searching for the best game, and this is by far the most fun experience Ive had in VR. Its a true escape room with so much to interact with. Im already dreading the day I reach the last mission. I hope they come out with expansions soon! 20/10\n\nHelpful | 0", "Stormbringer323Jan 29 at 11:31 AM\nShort and sweet\n\nThis game is amazing and is very challenging with fabulous puzzles but is a bit short PLEASE ADD MORE\n\nHelpful | 1", "RadJohnMasterFeb 14 at 5:00 AM\nGood game\n\nI expect you to add more levels\n\nHelpful | 0", "fluffywaffles93Feb 17 at 7:48 AM\nDope\n\nVery good game\n\nHelpful | 0", "reineggerFeb 9 at 11:12 PM\nAwesome\n\nFor me one of the best games on Oculus Quest!\n\nHelpful | 0", "mikedillonnzFeb 3 at 5:12 PM\nI Expect you to Buy\n\nOne of the most fun VR experiences I've had so far. Funny, challenging, and fun.\n\nHelpful | 0", "drbamoFeb 15 at 10:40 AM\nSo much fun\n\nMy wife and I love to play this together while casting. We love it. The only thing we don't like is that there are no checkpoints so when you die you have to start the mission all over. Some of the missions can get pretty lengthy.\n\nHelpful | 0", "Mandalorian100Feb 6 at 10:51 PM\nAmazing!\n\nI really liked it! Plus credit theme was pretty sick ngl..\n\nHelpful | 0", "ZACKATTACKS007May 21 at 9:24 AM\nBest virtual escape room I have played\n\nBest escape room game on oculus\n\nHelpful | 0", "FallenDownFeb 19 at 9:22 PM\nFun but controls is bad\n\nThe game is funny and keep you intensed about making any mistakes and having to do every thing all over again.\n\nBut the main issue that the control is a bit hard and messy as both index and side buttons do the same thing and sometimes if you accidentally grab something with the index you have to let it go to grab it back again with the side button to be able to trigger it with the index finger\n\nHelpful | 0", "chaseb2009Feb 12 at 2:40 PM\nThis game reminded me a book\n\nThis was also like James Bond\n\nHelpful | 0", "cheezeitsJan 8 at 6:53 AM\nAmazing! Worth every penny.\n\nThis is a very fun, complex, addictive, funny game. It has a high replay value and is the perfect level of difficulty. With just about no bugs, I cannot find anything wrong with this game. 10/10\n\nHelpful | 1", "KCMHammer80Feb 15 at 6:44 PM\n\nAwe some game\n\nHelpful | 0", "ttjackottJan 6 at 6:12 AM\nGreat 007 style game\n\nGreat game, really fun and especially great you can sit down the whole time! Great escape room style puzzles and really good for 2 players who want to take turns (one of us plays, the other watches via casting).\n\nHelpful | 0", "benmcnullyJan 8 at 4:20 PM\nNeed. More.\n\nMy partner and I had so much fun playing this game. The only disappointing thing is it's over now. Trying to find the next escape puzzle vr game to fill that void until the devs release something new!\n\nHelpful | 0", "OverlordPotato1May 16 at 9:36 AM\nA good challenge\n\nA good way to challenge yourself. Highly recommend\n\nHelpful | 0", "Jwosh_May 8 at 2:18 AM\nSo much fun\n\nYoull have so much fun trying to figure out what to do to get out of the missing alive\n\nHelpful | 0", "Ominous9May 1 at 5:28 PM\nDeep Dive\n\nSo far I love this game , but every time I get to the detonation sequence in the deep dive level my game crashes please fix\n\nHelpful | 0", "theoryofeverywhereDec 13 at 8:00 PM\nVR at its absolute best\n\nWow, I just finished the final level. Such a satisfying experience. Even my mom really loved playing this along with me by watching on my phone and helping me out, and she has never, in my nearly 30 years of playing games, ever showed any interest in them. This is really just one of the most fun and well designed game I have ever played. Great puzzles with just the right amount of challenge. No need for room scale play here too for those with small play areas. All you need is a chair (preferably one that rotates). Dont hesitate to buy this one. This is VR at its best. Cant wait for more!\n\nHelpful | 2", "HPPTUNDRAFeb 14 at 4:16 PM\nAwesome game!\n\nSpeechless\n\nHelpful | 0", "Hendo303Jan 20 at 6:56 PM\nOne of the best!\n\nA fantastic escape room style game. Funny and challenging with several solutions to the same problems, making it extremely replay-able!\n\nHelpful | 0", "awesome.lueJan 29 at 4:52 PM\nLove it But 2short, MORE MISSIONS?\n\nLove the game. Love the aesthetics & experiencing this world in vr is my happy place.\n\nPlease add more missions. It's just so short as is.\n\nMinor bug:\nIndex finger defaults to casual. User is required to grip all buttons, then let go & only then can u basically make finger guns, esp when you die & need to touch to make a selection\n\nHelpful | 0", "Dr_AAJan 29 at 12:33 PM\nWonderful\n\nA wonderful game wonderful songs wonderful animation and wonderful script/plot\n\nHelpful | 1", "JackH2O123Feb 1 at 5:40 AM\nBeautiful\n\nThis is an incredible game is a very challenging that are extremely fun!\n\nHelpful | 0", "Genji515Mar 14 at 11:24 PM\nGood\n\nGreat game but i wish they kept adding more dlc even if it was paid\n\nHelpful | 0", "Burn_ExpressFeb 10 at 12:44 PM\nAmazing\n\nMost fun and puzzling game\n\nHelpful | 0", "bornSwiftJan 9 at 12:06 AM\nWell worth the money\n\nIt's funny, thought provoking, and entertaining. I've been playing the missions with my brother and it's fun to share ideas as you maneuver your way through these virtual escape rooms.\n\nHelpful | 0", "WesinatorMay 15 at 2:55 PM\nIts good\n\nI like the game but there are no checkpoints within levels so every time you die you have to do every single piece of the puzzle again and if youre stuck on one segment you can end up doing the starting tasks waaay too much other than that perfect 4/5\n\nHelpful | 0", "AlltidandreasJan 19 at 6:53 AM\nClever and very polished\n\nOne of the huggets quality games out there. Would wish some further replayability, but this game is very well polished and quite fun.\n\nHelpful | 0", "hansolo2gFeb 8 at 3:38 AM\nI love it\n\nPls make more levels \n\nHelpful | 0", "bIgReDtHeMaN129May 15 at 6:55 AM\nPleased\n\nVery good game, I wish it had more levels!\n\nHelpful | 0", "Jsnyder40Dec 26 at 2:16 PM\nAMAZING\n\nSuch a comfortable experience that still challenges your brain and makes you feel extremely clever and smart. I recommend this game to everyone that plays VR and I cant wait for them to come out with more levels or better yet, a sequel!!!\n\nHelpful | 1", "vaitorFeb 3 at 6:19 AM\nbest VR game!\n\nI just really hope they make more levels... so much fun!\n\nHelpful | 0", "lettucegyyDec 10 at 11:16 AM\nGreat game\n\nThis has become one of my favourite games. It's perfect for people who like puzzles or escape rooms. Has an interesting story and loads of souvenirs you can achieve by doing the side missions or speedruns on every mission (which is 8 of them). You can mess around with little things you never thought you could use. 10/10 would play again.\n\nHelpful | 3", "GGMARSFeb 5 at 9:53 PM\nGreatest f*cking game\n\nGame was good but short\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n\nHelpful | 0", "rob.hiatt.75Jan 1 at 9:46 AM\nWhat i love about VR!\n\nThis is another great game for VR. It is fun to have to be able to figure the puzzles out. Not to difficult, just right. I really do feel like i am a super agent. Hopefully more scenarios to come soon. Great work devs!\n\nHelpful | 0", "BigBlakGlockApr 18 at 5:17 AM\nYou need this game\n\nIf you are looking for a game get this one it is so much fun, the levels are hard but not to hard and it has replayable as the is the secret achievement and dev commentary.\n\nHelpful | 0", "Mortal66Jan 26 at 6:42 PM\nFun puzzle game!\n\nThis game makes you think! The best puzzle game I have played on my quest so far! VERY fun!\n\nHelpful | 0", "dimsumtimeJan 25 at 12:06 PM\nCool for ages\n\nInteresting quest, easy to play, big fun for me and my son! :) Waiting for more levels\n\nHelpful | 1", "DoppioGangerNov 25 at 6:21 PM\nOne of my favorites for VR\n\nYou need, NEED, to get this game. Its super fun and amazing. The missions are quite smart and make you think. The puzzles are cool, and its got some humor. And trust me, this isnt just any puzzle game. Theres little to no bugs and there are lots of interactbles and cool stuff to do in each mission. Best part is devs are adding more levels with zero DLC and all free. Amazing\n\nHelpful | 10", "markfolgmann07Jan 26 at 3:38 PM\nAmazing\n\nIt a good game I spent so long on it but I still play I bad thing is when my vr goes off\n\nHelpful | 0", "AlexIsTheNameFeb 8 at 3:18 PM\nAwesome game\n\nBest spy game ever made!\n\nHelpful | 0", "Galahad_1Jan 16 at 7:46 AM\nAmazing game\n\nI love how I can just sit in my room and play this game for hours at a time, the mission and all so creative and the puzzles are next level\n\nHelpful | 0", "britlsrJan 18 at 10:20 PM\nWhat a hoot and a half\n\nSuuuuch a good game! So many nifty puzzles to keep you guessing, and each section is soooo different to the last! Love it\n\nHelpful | 0", "JuxadJan 17 at 9:24 PM\nGreat Game And Awesome Puzzles!\n\nThis game is frustratingly fun! And by that, I mean that I have fun getting frustrated at the puzzles in each level.\n\nHelpful | 1", "OgGuak420Dec 30 at 6:41 AM\nSo you think you can spy?\n\nGreat game beginning to end. Only complaints is its a tad short and I always got a headache cause I couldnt figure out the puzzles! So I guess the latter is actually a compliment haha would recommend as a VR novice.\n\nHelpful | 0", "FDM4PresidentDec 9 at 7:48 PM\nFirst Review\n\nAs the title suggests, I dont review ever. This game warrants a review. I have bought many games on the Quest and I always thought some shooter game would capture my attention, but no this wonderful game has. The attention to detail is palpable. The devs really worked hard on this game. They thought of everything in how youd attack the problems. The environment is really immersive and the puzzles are entertaining and challenging. I havent finished the game yet and Ill be sad when I do hopefully new content is added. Love this game and definitely recommend.\n\nHelpful | 2", "floraboyFeb 9 at 6:56 PM\n\nBest game\n\nHelpful | 0", "izzzyyyyyyFeb 9 at 2:43 PM\nIt good\n\nI like it\n\nHelpful | 0", "LenzomatoJan 20 at 10:07 AM\nSuper fun escape game\n\nIf there were only a few more missions... but hidden achievements and speed runs make it fun to replay them.\n\nHelpful | 0", "hh7Dec 27 at 3:52 PM\nBY FAR the best VR game ever\n\nTruly incredible experience. Challenging, fun, and the developers extreme attention to detail is just fascinating. Only wish there was way more content like this. I would literally solve a puzzle / level every day of my life.\n\nHelpful | 0", "TesseretteJan 11 at 11:28 AM\nGOAT\n\nThis is the best game Ive ever played in VR, hands down. If you like puzzle games, dont think about it- just buy it- this one is a rare gem.\n\nHelpful | 0", "hott_shottJan 19 at 12:40 PM\nBest game\n\nThis game makes you think in ways you would not before. This is the most with your money game on the quest.\n\nHelpful | 0", "stream1412Feb 7 at 12:03 PM\ni expectid you to rate 5 stars\n\nbest on vr\n\nHelpful | 0", "FilazaferMay 25 at 11:39 AM\nNeeds save points\n\nI got this in a bundle so it was really only a $5 add on, but honestly Id rather have my $5 back. If you really like puzzles then you might enjoy it, but I found it too repetitive. If you die you have to start over and solve the same puzzles over and over. There is really no reason for this than to make the game seem longer than it really is. If they changed that it would be much better.\n\nHelpful | 0", "AMWiniJan 22 at 12:03 PM\nGreat\n\nI like how we are spys trying not to die so I would totally five star rate this game\n\nHelpful | 0", "odon_associatesJan 26 at 1:49 PM\nFun game!\n\nFun puzzles and hilarious James Bond parody. Whats not to love?\n\nHelpful | 0", "Realm18Dec 10 at 3:20 PM\nWorth every penny\n\nThis game brought hours of entertainment. Very frustrating at times, but it never really felt unfair. Every time I died, I felt like I learned more and got farther almost every time (exept when there's an accidental grenade) There was also the opening, which has been watched multiple times. It had great lyrics, great graphics, and amazing instruments to go along with it. I really felt like a secret agent during this game. An immortal one, but a secret agent nonetheless.\n\nHelpful | 1", "DoomBladeXJul 13 at 7:56 PM\nLove the game, awesome puzzles\n\nSo the length is a little short once you figure out all the puzzles, which eventually happens from dying enough times perhaps 2 or 3 hours if you're good with puzzles. That aside, the controls are pretty intuitive once you pass the tutorial. Graphics are solid. I LOVE the voice actors in this game, the quips like Q in Bond movies, it's just perfect. The level of comedy is layered here for sure.\n\nIt has replayability in a few ways- speed runs doing the things as fast as you can, teasers that make you think how you could get the bonus finishes. Completing them results to more swag in the office, which makes it funnier. So you play them over fast and methodically trying to complete the added challenges.\n\nCurrently still racking my mind on how to finish a few there to 100% complete the game, but its my favorite stationary game thus far.\n\nHelpful | 1", "DajinnJan 15 at 9:31 PM\nSimple fun\n\nUnless you're trying to get the speed achievements. Still, we need more of these types of games on quest, for sure\n\nHelpful | 0", "DISTROJARJan 24 at 10:00 PM\nA good game\n\nThe game i good addicting and replayjable. The game has a lot to do\n\nHelpful | 0", "Derpy_ManateeApr 18 at 5:10 PM\nBest game on oculus quest\n\nThis is by far my favorite, it takes a lot of problem solving, so if you have a small brain, dont buy this game. But for everybody else, do.\n\nHelpful | 0", "Adam793Jan 31 at 4:44 PM\nFun\n\nVery interesting game, classic spy vr.\n\nHelpful | 0", "JBSwzzlsDec 9 at 2:21 PM\nHard, but fun\n\nThis game was the first game I have ever played in VR. This game is all about figuring out stuff to beat the level. Dont expect to do it in one go, you will die a lot of times before you get it. Also, dont watch videos on how to beat the level, it takes away a the fun of figuring out stuff. This game is also a great game to show off the family if they have never played VR before or are new to it.\n\nHelpful | 0", "zhao6518Nov 27 at 11:44 AM\nSo much heart from start to finish\n\nI don't tend to review games, but after finishing this game I couldn't help but praise everyone involved in building and refining this game.\n\nThe missions are very well designed! The interactions are so natural and addicting that I started trying to use telekinesis in other games that don't support it :p\n\nMy friends who have tried the game also share the same sentiment - even those who identify as non-gamers are deeply intrigued by the puzzles and story.\n\nOverall 10/10 game that I can't get enough of.\n\nHelpful | 6", "ArmyCPTGeoMar 17 at 9:37 AM\nPhenomenal game and puzzles\n\nThis game is amazing. Buy it now. You will get hours of enjoyment out of it. Beautiful theme and visuals. Not too tough but not too easy either. There was only one point where I got stuck and couldnt figure out how to survive. If this happens, take a break, think of whats at your disposal and what items havent been used or if there is document that may have the clue you need. There needs to be DLC or a sequel. Its so good.\n\nHelpful | 0", "kaumacDec 15 at 2:02 PM\nYou MUST buy this!\n\nI bought a number of games before this one. Beat Saber was my day 1 purchase and it's a great game, but honestly: I Expect You To Die is the best experience on the Oculus Quest so far!\nI rarely write reviews, specially positive ones, but this game deserves it!\n\nHelpful | 1", "Frish506Jan 30 at 6:41 PM\nAmazing\n\nIf you like escape rooms get this game\n\nHelpful | 0", "shawnersDec 30 at 1:57 PM\nGreat Game - So Much Fun\n\nGet ready to be a spy. This game is pretty fun. Fun puzzles each level. While levels may be quick to be completed, finding all the souvenirs for each level takes some time and puzzle solving.\n\nHelpful | 0", "SacciferousJan 10 at 12:37 AM\n\nWORTH IT!!!! enjoyed it so much... all the missions are well made. overall the experience si just so good. it s a must buy in my opinion\n\nHelpful | 0", "yummycake11Jan 24 at 6:24 AM\nAwesome\n\nThis game is so much fun! It has hours of entertainment within it!\n\nHelpful | 0", "Hoi64Dec 12 at 12:58 PM\nAmazing game\n\nThis has to be one of my favorite vr games. For me it was a really hard game but it felt so good when you realize what you are supposed to do. Also a really good looking game. Graphics look great. Hope new levels come out even, though the ending does make the story look complete.\n\nHelpful | 0", "stevowaringFeb 1 at 4:23 AM\nExcellent puzzle game!\n\nJust like an escape room!\n\nHelpful | 0", "sami.odermattJun 12 at 12:59 PM\nIts really good\n\nIve only played for about 40 minutes but the puzzles are so clever!\n\nHelpful | 0", "Firebrodude07Apr 27 at 7:14 PM\nFun trail and error\n\nThis game is amazing because of its trail and error and how much content is in each level\n\nHelpful | 0", "XNLightningApr 26 at 6:42 AM\nGreat game 5*\n\nIt is a really fun but difficult puzzle game you really need to use your brain worth the money\n\nHelpful | 0", "LoangunnerFeb 4 at 1:22 PM\nYes\n\nBuy now\n\nHelpful | 0", "dazltDec 17 at 12:48 PM\nWell worth it!!\n\nPlaying off and on for a couple of weeks. I like puzzle games and solving them always gives me a sense of achievement......well, this game really tests you on sequence and gets you thinking. Great game for me and would live to see a lot more like this.\n\nHelpful | 0", "steven.ohmertJan 2 at 11:59 AM\nOutstanding\n\nMasterfully creative with superb technical execution. Game play is immersive, engaging, and diabolically seductive. Best title in my Quest library. Want more like this!!!\n\nHelpful | 0", "FireTrout648984Jan 29 at 9:51 AM\nWorth it\n\nBut this it is absolutely worth it\n\nHelpful | 0", "BraydenthewhitewolfJan 18 at 9:03 AM\nAmazing\n\nI expect you to die is definitely worth the money its one of my favorite Oculus games.\n\nHelpful | 0", "Shuwei97Jan 19 at 9:15 AM\nOne of the best games I've ever played!\n\nIt's addicting and fun and also hard at first, but easy when you get the hang of it.\n\nHelpful | 0", "megamehmehoJan 30 at 12:01 PM\nAmazing game\n\nJust an amazing puzzle game\n\nHelpful | 0", "PokeMaster575Feb 2 at 10:51 AM\nIts fun\n\nIts fun\n\nHelpful | 0", "defaltvevoMar 16 at 10:20 PM\ninteresting puzzles\n\nalthough complicated, and it is tough having to redo things after youre almost there and die; the game has extremely fun puzzles. And its especially easy just redoing everything super fast after knowing wht to expect and do when you die. overall, one of my favorite puzzle games\n\nHelpful | 0", "eyalg29Jan 19 at 12:51 AM\nGreat game, not as easy as I thought ...\n\nVery well made, easy to control, with very good riddles and well worth buying !\n\nHelpful | 0", "Son-GokuApr 30 at 2:34 PM\nPuzzles\n\nI love the game because of the puzzles and I just love the game\n\nHelpful | 0", "Elf66Jan 20 at 7:38 AM\nI expect you to die\n\nAs a first timer to VR I'm loving it, I highly recommend it. I want more\n\nHelpful | 0", "henrik.broseniusJan 14 at 12:19 PM\nGreat idea\n\nSimple, yet genius game idea. Beautiful location and some interesting problems guarantee a good time.\n\nHelpful | 0", "thorganDec 5 at 5:14 AM\nThe best vr puzzle/escape game\n\nThe rules are simple, they expect you to die. And youll die a lot. And you want to prevent that by solving incrementally the puzzles.\n\nGame interactivity is the best. Environments are exactly what youd expect from an older James Bond movie. And voice actors are performing great.\n\nYou need to speak English to enjoy this game fully.\n\nHelpful | 0", "Dominic-GonzalezJan 31 at 5:38 PM\nNeeds more levels.\n\nNo description\n\nHelpful | 0", "Mr.SanboMay 9 at 9:27 PM\nVery good\n\nGet game\n\nHelpful | 0", "duncan.devoreMay 22 at 4:16 PM\nIts ok\n\nI thinks its good  but the down part is like its littered impossible to beat it first time because theres no clues for some of them like squeaky clean and I recommend getting it its worth your money but if it was 50 bucks no I wouldnt get it\n\nHelpful | 0", "PurelydigitalMay 1 at 4:47 PM\nWhat!?!?!?\n\nMan this game of pretty frustrating but gun as hell!\n\nHelpful | 0", "Rev0EmagJan 12 at 1:42 PM\nNice\n\nJust got the game, did not finish it yet but so far its great. Graphics are beautiful \n\nHelpful | 1", "RyanthecoolMar 8 at 6:42 PM\nHey,\n\nI love the game just put more levels\n\nHelpful | 0", "noticeddropJan 24 at 4:12 AM\nReally good and funny game\n\nI like the little joke here and there but I have been having some trouble with the second to last level I cant figure out how to get out off the seat of power and launched into the air the only thing that I put Into the booster seat was the film canister.\n\nHelpful | 0", "zack.slotkowskiJan 27 at 5:50 PM\nJames Bond feels.\n\nSimply amazing and super fun!\n\nHelpful | 0", "nathan.bock.716May 10 at 2:54 PM\n\n\nNice\n\nHelpful | 0", "thecaptain17Jan 14 at 6:05 PM\nA must have for any VR owner!\n\nEvery bit of this game is great, the look,the feel, the jokes and the puzzles are even better!\n\nHelpful | 0", "jnjustusJan 8 at 5:54 AM\nEscape the room, Mr Bond\n\nIts and escape room / puzzle game, but basically set in the James Bond universe with you being a super spy. Love the puzzles and the style!\n\nHelpful | 0", "Cbyrd400123Jan 9 at 6:22 AM\nAmazing game\n\nThis an amazing game and my only problem is that it ended. The story is incredible and the ending is even better.\n\nHelpful | 0", "Darkstone995Jan 25 at 8:16 PM\nFun\n\nIts rly fun thats all\n\nHelpful | 0", "TECC-2187Jan 19 at 5:29 PM\nBest Game Ever\n\nThis is easily the best video game Ive ever played period.\n\nHelpful | 0", "StuvvvMay 4 at 5:40 PM\nAwesome!\n\nBest escape game! \n\nHelpful | 0", "Weirdthing76Apr 12 at 12:03 PM\nAmazing\n\nIt has the right amount of difficulty and the name is very accurate. The style is great and it's a cool thing to let your family play\n\nHelpful | 0", "ElatreusJan 2 at 4:16 PM\nGreat game you can play sitting down\n\nI like that I can play this game when my husband is asleep on the other side of the couch and it doesnt wake him up. Very fun and immersive.\n\nHelpful | 0", "ArthurFrostbladeJan 11 at 5:22 PM\nAmazing\n\nEasily my favorite game I own, EASILY. AIf youre considering buying, them do, Im not kidding\n\nHelpful | 0", "slinkyukJan 12 at 12:31 PM\nAwesome fun\n\nIf you like locked in a room type puzzles but more interactive and fun this game is for you!\n\nHelpful | 0", "WaterBoi777Jan 2 at 3:57 PM\nReally fun game\n\nI like this game a lot but it does come to a end which is sad but in the future more levels will come but at the moment there is only 7 levels\n\nHelpful | 0", "MinskyBooJan 24 at 10:25 PM\nGreat game!\n\nJust needs more content!\n\nHelpful | 0", "ThePolarDec 29 at 12:09 PM\nVery Immersive\n\nIf you want a fun spy puzzle game this is the perfect game for you.I found myself dozens of times raging over the hard mission's that make you think hard.\n\nHelpful | 0", "wedge07Jan 11 at 7:33 PM\nVery Good\n\nI really like the game. A cross between Austin Powers, an Escape Room and Mission:Impossible, (but without Tom Cruise.) You can lose yourself for hours in this one. The physics are good, the scenarios arent (too) frustrating and the sense of accomplishment is nice. I would say a must-have game!\n\nHelpful | 0", "jcb256Jan 18 at 5:56 AM\nAmazing game!\n\nSuper fun and addicting! Like virtual escape rooms!\n\nHelpful | 0", "adramHereDec 28 at 7:10 AM\nReally love this game\n\nThis game is really good. You need to find the clues and then work out the steps to solve each mission. The quality and general feel of the game is superb.\n\nHelpful | 0", "starbuck2612May 4 at 10:06 AM\nSuper.\n\nOriginal\n\nHelpful | 0", "OwO_biscuitJan 7 at 1:28 PM\nThis app is brilliant\n\nI love it\nIts fun interactive and it has just a small amount of comedy that just adds that final touch\n\nHelpful | 0", "DeepMellowJun 18 at 9:51 PM\nDidnt really like it.\n\nYou cant play it sitting down in a lot of spots, the voice is annoying its a puzzle game. If you like puzzle games then well here you go. Except the voice acting is corny and lame.\n\nHelpful | 2", "OlafsenProJan 21 at 1:38 AM\nGreat game\n\nFun game, with lots too do\n\nHelpful | 0", "LivingThread6Feb 23 at 6:40 AM\nFun and entertaining but short\n\nWas a very fun game to play to pass an hour wish there were more missions\n\nHelpful | 0", "scott.trivignoFeb 26 at 3:22 PM\nGreat!\n\nGreat game\nBut too short! More challenges would be great!\n\nHelpful | 0", "leotkrolJan 9 at 6:21 PM\n\nAmazing game,\nExtremely fun and entertaining the whole way throughout, would recommend\n\nHelpful | 0", "Snox8Jan 3 at 10:37 AM\nDifficult to find a better game.\n\nEverything from the gameplay, to the intro is just amazing. If there was ever a sequel, I would get it when I could.\n\nHelpful | 0", "yimmer1Nov 16 at 8:01 AM\nChallenging !\n\nSo much fun. Like an 1 man escape room in VR. Funny and witty very comfortable. Love that they added missions. I have to pace myself so I dont finish them all too quick. Pls keep adding more missions!!! (Or some variation to old missions for replayability, ie sharks w lasers...)\n\nHelpful | 7", "me_garciaJan 11 at 3:01 PM\nTime not waisted\n\nI have played this game a lot and completed it it is a amazing puzzle game\n\nHelpful | 0", "DiamondBanana9Jan 9 at 12:13 PM\nI expect you to buy\n\nIts a good puzzle game and its a good challenge but you need a lot of patients\n\nHelpful | 0", "FallenDestructionJan 11 at 2:27 PM\nFantastic game\n\nFun to play anywhere, a great mix of difficult puzzles and exciting action\n\nHelpful | 0", "kyle2035Jan 12 at 12:39 PM\nNice\n\nAt the begining i was not sure but now i definitely love this game !!\n\nHelpful | 0", "SaintMDec 21 at 11:32 AM\nA must have\n\nDoes so much right for a VR game. Things work as youd expect them too, no crazy physics that defy sense, great humour, compelling puzzles and you can wear a hat. Top marks!\n\nHelpful | 0", "FwakDec 15 at 5:49 AM\nExcellent, a must buy!\n\nLove the opening credits.\nReally interesting and varied level design.\nNice and funny story.\nPerfect difficulty curve.\nGreat gfx, music and voice acting.\nFlawlessly done with no bugs.\nAnd its cross-buy!\n\nHelpful | 0", "captaincatJan 24 at 8:29 AM\nGreat game loved it\n\nGreat for people that like puzzles\n\nHelpful | 0", "dave.clarke.5070Nov 21 at 1:46 PM\nVR escapism at its best\n\nAbsolutely loved playing this with my daughter. Puzzles are complex without being too frustrating, and everything is done with a sense of humour that doesnt detract from the tension. Im going back to try and nail the timed runs and all unlock all the content. Thanks for a great game. Id LOVE more levels!\nUPDATE: I wished for more and it arrived (for free!!)  Just played the new final level. Brilliant! Thank you thank you! Ill be looking out for whatever you release next you are a very talented team. Congratulations on an absolute work of art.\n\nHelpful | 2", "debksurJan 26 at 10:21 AM\nA bit fraustrating.\n\nEven though the story line & graphics are very good,i'm finding I have to look on the walk throughs,which is fraustrating.When you find out what you were supposed to do i'ts quite annoying that people are supposed to figure that way out too,there is no way you know what to turn or use without help.\n\nHelpful | 1", "Jojobean66Dec 12 at 9:13 AM\nLOVE IT!!\n\nI love this game so much, its a perfect mix of challenging puzzles and fun VR mechanics. Also, the missions are very different from each other so each on is a new experience. I highly recommend this game!\n\nHelpful | 0", "a1a3a5a7a9qaDec 31 at 12:10 PM\nYou're gonna die.\n\nScared sh*tless multiple times. Annoyed to death when I couldn't find out how to solve it. Still want a part 2\n\nHelpful | 0", "FlamableNitroDec 26 at 7:23 AM\nFun and challenging\n\nSo it can be frustrating when you can't work out how to complete it but you eventually get there and it feels so rewarding when you do!\n\nHelpful | 0", "JaetheDec 7 at 2:57 PM\nGreat fun\n\nDying in the game, screwing up the puzzle, pushing the wrong button - is such a lot of fun because each one is more ridiculous. Even though I think I am close to the end of the game, I look forward to getting all the achievements.\n\nHelpful | 0", "WEHEIBA_AJan 22 at 11:40 AM\nAWESOME\n\nVERY AWESOME AND STRATEGIC GAME DEFINITELY RECOMMEND BUYING IT......BUT IF U WANNA HAVE THE FULL EXPERIENCE DONT SEARCH ON YOUTUBE FOR WALKTHROUGHS.....I gave it four stars because I heard it was too short\n\nHelpful | 0", "GoLuckyFlameApr 18 at 7:26 PM\nAmazing!\n\nThe missions are funny and intriguing. The game is great!\n\nHelpful | 0", "Octoplus156Jan 19 at 2:58 PM\nGreat plot\n\nJust amazing\n\nHelpful | 0", "Kingg_Jan 19 at 12:04 PM\n100% worth the money\n\ngood game\n\nHelpful | 0", "shawntburtDec 4 at 5:02 PM\nSo much fun and style\n\nHad a blast playing the game. It really felt like you were there in person interacting with the objects. Levels were a good challenge but not to difficult. Only wish there were more missions but it sounds like a follow up is in the works.\n\nHelpful | 0", "MotoMcFeb 14 at 9:36 PM\nLove it but\n\nI love it but it leaves something to be desired it is awesome but wish it had more\n\nHelpful | 0", "DragRacer6241Jan 3 at 10:12 AM\nAmazing\n\nMy first game, this thing is amazing and the challenges really make you think. Love it\n\nHelpful | 0", "Mr.PBHJan 13 at 7:49 PM\nFail until you memorise a sequence??\n\nThis game is underwhelming.\nIt is designed for you to fail numerous times until you can successfully memorise the sequence of tasks and complete the challenges.\nNot skill based or fun.\nJust an elaborate memory game.\nI tried to have it refunded but Oculus did not approve that, so I guess it will remain, unplayed, on my oculus quest.\n\nHelpful | 13", "cncn60Dec 23 at 7:18 PM\nBest game for the quest\n\nPerfect blend of puzzle solving, story, humor, and suspense. If you love classic James Bond or kingsmen, then chances are youll like this\n\nHelpful | 0", "NightescapeMay 18 at 1:27 PM\nA Seated Spy experience\n\nA room escape game with a spy twist with amazing narration. One of the best puzzle experiences that is seated.\n\nHelpful | 0", "ApeSlaveJan 1 at 8:20 PM\nWorth the money, but missed it's shot.\n\nThroughout the game there are many awesome moments worth going back and redoing. The diversity between each level and environment makes them feel very unique and exciting to explore. The graphics are good enough and its not uncomfortable action. But unfortunately the moments that you want the most end up being lazily done. Mainly the ending of every mission. The moment that is the most important which is the accomplishment of the task that you just worked so hard to achieve, is diminished by the lack of effort put into it.\n\nFor example. During one mission after you complete it successfully you are launched in a chair as an escape. Instead of it having you lift up and out into the air letting you get a view of the escape it just starts to go black and that's it, back to the headquarters. These moments are the moments that they left out that would make the game extra special. There are lazy things done in this game like this that disappoint me so much I can't give it five stars. If you want to be the best out there you have to put that extra effort in.\n\nBut that all being said. Definitely worth the buy.\nHave fun!\n\nHelpful | 0", "KillercatGemJan 3 at 12:32 PM\nExcellent\n\nGreat puzzles to solve, an intensive experience but short, sadly over too quickly.\n\nHelpful | 0", "Mr-Sh1beJan 9 at 3:48 PM\nGood game\n\nVery difficult. Just wish they added more levels.\n\nHelpful | 0", "Le_Epic_BorgarJan 15 at 11:19 AM\n\nVery fun and clever\n\nHelpful | 0", "xXDominioes119XxApr 9 at 3:48 PM\nMind Boggling!\n\nI love everything about this game. If you like puzzle games, this game is the way to go.\n\nHelpful | 0", "BossDoorJan 1 at 1:45 PM\nSatisfying\n\nI really liked it was very fun. The ending was really good and I hope their is a sequel\n\nHelpful | 0", "lamp2020Jan 5 at 3:39 PM\nAmazing\n\nAll the levels are amazing. Great story. Played at least 20 times.\n\nHelpful | 0", "Semi_Funny_KidJan 1 at 12:27 PM\nAmazing game\n\nFirst class level is broken for me but otherwise its been a phenomenal experience.\n\nHelpful | 0", "DeadlyDorito121Jan 8 at 7:15 PM\nBest escape room ver game\n\nVery immersive, great story. And great escape room\n\nHelpful | 0", "henryh123Jan 15 at 6:19 PM\nReally makes you use your brain\n\nFantastic game\n\nHelpful | 0", "FIXITMAXJan 3 at 10:09 AM\n\nIt's a very fun and intuitive game to play with your family andd friends.\n\nHelpful | 0", "PickleGITMar 17 at 11:50 AM\nAMAZING GAME\n\nThis game was one of the best vr games ive ever played the storyline is great and this game always had me at the tip of my chair truly amazing I hope more levels are added or a new game comes out\n\nHelpful | 0", "EKG999Dec 27 at 7:59 AM\nThe best Vr puzzle game\n\nFrom bombs to poisons gas,from submarines to rockets. If you want to become a secret agent, then play this\n\nHelpful | 0", "neepsandtattiesDec 31 at 11:16 AM\nLots of fun\n\nI really enjoy this game, and I always look forward to updates that add new episodes.\n\nHelpful | 0", "bhaynes22Jan 7 at 6:51 PM\nLove this game\n\nI is amazing and truly makes you feel like a spy\n\nHelpful | 0", "NirzDec 4 at 11:33 AM\nFun fun fun\n\nThough I considered giving it a 4...\nThe levels have nice flow and dynamics and I find myself going back to explore more. But they do not require a lot of thinking, just investing enough time trying things.\n\nHelpful | 1", "MrsmileyfacetwoNov 23 at 5:20 PM\nBeat game in the world!!!\n\nI love this game. It is challenging. It is funny. It is crazy. It is a short game but that does not mean it is bad. The new update is amazing with 3 new levels and even harder challenges. This game is great and is worth the price.\n\nHelpful | 4", "akrangerMar 18 at 3:56 PM\nBest I have played yet\n\nFairly new to the Quest as I have only had for a few months. Bought around an additional 6 games and this is my go to for pure relaxation. Game is fun and escape room style play.\n\nHelpful | 0", "JadeYTDec 26 at 7:37 AM\nVery well made\n\nThis game really captures the puzzle solving and comedy of any good spy game. Well enjoyed experience.\n\nHelpful | 0", "rescuedlocket91Mar 21 at 2:35 AM\nThe best game ever!!!\n\nI absolutely loved this game, it has so much interaction. You can accomplish things that you have no clue of, little hidden options are the best. I absolutely loved.\n\nHelpful | 0", "JX_17Dec 11 at 8:13 AM\nI expect u you to buy\n\nThis game is definitely taking room escape to a next level , the difficulty is just right, if you spend enough time you will be rewarded quite well for figuring things out\n\nHelpful | 0", "fjwilkes3Jan 12 at 5:29 PM\nSuper fun\n\nI have just played the first level but it was a blast\n\nHelpful | 0", "extraterrestrial1Dec 30 at 1:46 PM\nFun puzzles\n\nEscape room like puzzles. Some really nice interactions and surroundings.\n\nHelpful | 0", "SustasulMar 27 at 8:16 AM\nSuper fun and mind addictive\n\nOne of the first puzzle games bought and was worth it.\nPlaying life with life is suuper fun.\nA must have for new and old comers.\n\nHelpful | 0", "CryoDrakonJan 18 at 12:10 PM\nBasically impossible mission.\n\nFirst class is the worst mission ever, you get in a stuck loop because something doesnt activate the fast travel. Never opens always stuck, fix this please because Im never picking up the game again. 1/10\n\nHelpful | 6", "TipsyTopLightDec 5 at 8:19 AM\nGreat game only made better!\n\nThis review comes late from me, but I had to put it up. Since the release of this game, which was already fun, there have been 2 free expansion packs. This game is awesome and the developers rock!\n\nHelpful | 0", "SnaxesJan 11 at 2:04 PM\nI love it\n\nIt is good\n\nHelpful | 0", "Masterbuilder0216Apr 3 at 12:14 PM\nGreat game but...\n\nI had been waiting to be able to buy the game for a while, and when I eventually bought it I was super excited. It is a very well thought out game and super fun with quite a solid challenge, but I do have one big issue with it: it's way too short. I was able to sit down after I got the game and within about an hour-ish I had finished every level. It is nice that they have extra challenges so you will want to replay levels, but having even more levels would make it so I could give it 5 stars. Overall, it's a great purchase and I'm sure in the future there will be updates and those could potentially contain new levels or new challenges (ig we just have to wait and see)\n\nHelpful | 0", "Deathlock553536Jan 5 at 6:46 AM\nThis isn't because the game is bad.\n\nGame ain't bad but how do I refund.\n\nHelpful | 0", "temmiecat0Dec 28 at 7:47 AM\nProbably one of the best games on quest\n\nImmersive and should have an award in my opinion\n\nand also funny\n\nHelpful | 1", "ModestMyshkinDec 14 at 5:12 PM\nWorth it\n\nA little on the short side but definitely worth it. The puzzles feel like a great use of VR and the whole secret agent theme plays out well.\n\nHelpful | 0", "millsaaron255Mar 19 at 7:17 AM\nWorth the buy\n\nAll of the Plants are fake\nYou can smoke a cigar\nYou can light dynamite\nPour yourself a glass of champagne\nListen to the radio\nSolve puzzles\nStop the villan\n\nHelpful | 0", "mighty025Feb 1 at 11:28 AM\nLove it, but I wish it was longer\n\nAmazing game and I love the premise but I wish it had more levels cause I really enjoyed playing this game\n\nHelpful | 0", "RyanPiezoDec 24 at 3:16 PM\nExcellent game with questionable design\n\nThis game is a lot of fun and one of my go tos when showing off my quest to family and friends. The levels are challenging without being obnoxious and the individual puzzles really make you feel like you've accomplished something when you figure them out. There are also multiple ways to solve different puzzles. However, the game seems poorly optimized for the quest as it does crash more often than I would like. There are also some annoying design choices. For example, if you die in the level, you start over from the beginning with the narrator saying the same things over and over. I understand starting the level over from the beginning, but the constant loop of narration when you are trying to figure out a puzzle three quarters of the way through the level is infuriating.\n\nOverall though, excellent game and highly recommended for anybody looking to add to their quest library.\n\nHelpful | 0", "KDC_KoolaidManDec 29 at 9:43 AM\nExtremely fun game\n\nWho new a game where you just sit down would be so much fun\n\nHelpful | 0", "purplekarrot1Mar 3 at 5:52 PM\nBest game ever\n\nMy favorite game worth the money\n\nHelpful | 1", "winter88Feb 3 at 1:14 PM\nGood for parties\n\nIts a lot of fun watching the person playing and for the whole room trying to help.\n\nHelpful | 0", "HelloAlice2019Nov 2 at 10:40 AM\nWish for more games like this on Quest!\n\nI Expect You To Die is absolutely perfect (maybe a bit short, but everything else absolutely perfect). Beautiful graphics, immersive/fun puzzles, atmospheric music and narration, it is truly a gem on Quest. I love this game, and I don't even like Spy Movies (although I do like 50's/60's era films). Would be awesome to see similar Alfred Hitchcock inspired game. Uhh, one ne can always dream :)\n\nHelpful | 4", "joeruskDec 29 at 11:30 AM\nIT IS ABSOLUTELY PHENOMENAL\n\nI love it and theyre adding more stuff\n\n\n\n\n\nI think\n\nHelpful | 0", "LePainBenJan 5 at 12:55 PM\n\nJust buy it already\n\nHelpful | 0", "Covid2020Dec 17 at 5:34 AM\nMy favorite game!!!!\n\nThe best VR game in my opinion and the only game I constantly jump back into to try and win all of the souvenirs.\n\nHelpful | 0", "flamingface117Dec 28 at 9:03 PM\n\nMy favorite game on vr, good amount of gameplay time\n\nHelpful | 0", "J0rdan29Dec 1 at 2:32 PM\nGreat game\n\nFrom the moment I started playing, I haven't found any flaws. However, it would be great if level 5 was a bit more clear on what to do. Then again, that's the point of the game. \n\nHelpful | 0", "scottclayOct 24 at 9:12 AM\nBUY NOW BEST GAME EVER\n\nThe most fun in VR, buy it now and thank yourself later. Itll probably take you at least 4 hours to beat this game for the first time. Then you can replay missions and enjoy all the easter eggs and explore each item and how it interacts as well as collect items from completing objectives during missions. Then beat all the speed run challenges, you never stop finding ways to cut corners. I wish they would come out with DLC or a second game. I would pay atleast $5 per mission. EASY\n\nHelpful | 7", "mandalorian12Jan 4 at 6:28 PM\nAmazing\n\nI liked it\n\nHelpful | 0", "thomas.lyallDec 26 at 2:04 AM\nThe best game I've ever played\n\nIt's funny and comfortable because you get to sit down\n\nHelpful | 0", "ochojakersDec 20 at 8:20 AM\nAmazing\n\nThis game is a strait up must buy. Thats all I have to say it is just amazing\n\nHelpful | 0", "TheWitherNo1Nov 4 at 10:13 AM\nReally clever!\n\nI had to try the most stages multiple times until I figured out the solution and sometimes even had to look at a guide for the answers.\nI really had a blast playing it and the puzzles were fun and pretty difficult. But I really think if you like VR games and puzzles you should definitely buy it. I especially love the little souvenirs you get for completing certain tasks.\n\nHelpful | 1", "kimsabaFeb 3 at 10:22 AM\nIs there no plan to translate?\n\nI'm Korean.\nIs there no plan to translate or even make subtitles?\n\nHelpful | 0", "naveh4Jan 4 at 8:34 PM\nSolid But Not Perfect\n\nNot my favorite game but really solid. The first two missions were glitchy and each crashed at least once. Not moving at all was another negative, but challenging and humorous. Its definitely worth getting.\n\nHelpful | 0", "ZapperTrapper44Feb 10 at 5:53 PM\nMy son loves it\n\nIt is very addictive. And fun\n\nHelpful | 0", "ThedeathisrealtoAIMar 28 at 12:09 PM\nThe BEST game\n\nThis is the best game I have played on VR. An amazing puzzle escape room game!\n\nHelpful | 0", "blake1O1Dec 26 at 2:43 PM\nGreat\n\nA nice fun game when you dont have much room.\n\nHelpful | 0", "lewis2509May 8 at 10:17 AM\nAGENT!!!\n\nAll round great game I really like the storyline although its surprisingly short\n\nHelpful | 0", "Alex563Apr 9 at 1:24 PM\nThe best game ever\n\nI love this game\n\nHelpful | 0", "QuantumninjaDec 13 at 5:32 PM\nThe tension is real!\n\nIm several missions in, and fully addicted. If you like spy stuff and escape room games, youll love this!\n\nHelpful | 0", "malcolm080808Jan 28 at 3:19 PM\nGreat game!\n\nThe game is great but occasionally crashes. Some puzzles will have you thinking for hours!\n\nHelpful | 0", "XtcnsxDec 22 at 12:30 AM\nGreat Game\n\nLots of fun if you like puzzles and feel like Bond, James Bond\n\nHelpful | 0", "FunkyGamer101Nov 29 at 7:36 PM\nJust wow\n\nive already played this game for so long, it was fun, trying to figure out puzzles for hours. Im only on mission 4 and still enjoying it, easy ( sometimes) but satisfying.\n\nHelpful | 0", "ISeeSlysDec 26 at 2:07 PM\n10/10\n\nStunning experience with a really 007 vibe\n\nHelpful | 0", "420VirtualSlabberJan 2 at 6:08 PM\n\nSo good\n\nHelpful | 0", "KloppisKoolNov 16 at 11:16 PM\nSooooo good!\n\nThis game is so addictive and the puzzles are challenging. I read a lot of reviews saying there is not much content but there is plenty of it. It is basically like an escape room but way cheaper in a virtual world. Great game\n\nHelpful | 1", "Geb721Dec 26 at 5:23 PM\nReally good\n\nThe 5 level is hard but its really good\n\nHelpful | 0", "atirathaMar 22 at 12:54 PM\nIt's funny, engaging\n\nRemember No One Lives Forever? Our Man Flint? Austin Powers? This is the same kind of fun. Try it.\n\nHelpful | 0", "Nilorod28WPFeb 22 at 12:34 PM\nI expect you to die was to short\n\nThe levels were fun but the fun ended pretty fast\n\nHelpful | 1", "tzanzouriDec 26 at 5:46 AM\nThats VR\n\nI had the feeling I lived a movie !\n\nHelpful | 0", "HerbigAkMar 23 at 2:36 PM\nGreat game but short\n\nSo can't go out figured I'd buy a game to stay in and play. Overall it is a good game lots interaction I think 25 is a bit steep feels like about 15 would be realistic. Maybe I just got lucky but without using Google, walk through etc. I managed to get to what I believe to be the final level. chair of power. in under 3 hours of play. Seems that me be a standard for most games. I have no regrets tho just hope they keep updating with more levels.\n\nHelpful | 0", "PowerSmash06Nov 7 at 2:33 PM\nAll I got to say is..\n\nThe creators of this game are heading in the right direction and are releasing the right stuff for VR people, a couple things about this game is, its been crashing frequently and has a lack of levels but besides that its my #2 favorite game of all time!\n\nHelpful | 4", "steve123678Dec 28 at 7:56 PM\n\nMore levels please\n\nHelpful | 1", "Auckey702Dec 28 at 8:03 PM\nGreat starter vr game\n\nIts really good\n\nHelpful | 0", "bobthbakaDec 1 at 4:47 PM\nAmazing game to satisfy your inner Bond\n\nThis game is tons of fun with great writing. I have had many close calls, surprises and think quickly situations that make me feel like a real secret agent!\n\nHelpful | 0", "MiniSequenceMay 15 at 9:57 AM\nIts ok no glitches\n\nIf you have extra money buy this but the game has only 8 mission that are so what easy spoiler the last level is the only hardest\n\nHelpful | 0", "LiplessGem33Jan 15 at 5:16 PM\nGreat game\n\nLove the design, even though it can be infuriating, I enjoy figuring out each puzzle and progressing through it, and how stupidly you can die\n\nHelpful | 0", "ChaotykDec 2 at 5:28 AM\nFun, quirky, and overall very clever\n\nTitle says it all, not a very difficult game, but still poses a number of challenges, as well as certain problems having multiple solutions. Thumbs up\n\nHelpful | 0", "kingofsomeDec 19 at 8:15 AM\nLove it!\n\nMore levels!!!! :). I would buy a new level pack in a heartbeat.\n\nHelpful | 0", "Bdorfman17Mar 31 at 12:46 PM\nAwesome\n\nSuper puzzling levels and compelling story.\n\nHelpful | 0", "PvtOttobotDec 7 at 12:41 PM\nPerfect for what it is\n\nGreat escape room style action puzzles. Low on content, but the updates long after release made it earn 5 stars for sure.\n\nHelpful | 0", "TheCubingGamerDec 22 at 7:44 PM\nBrilliant\n\nGreat game if you like puzzle genres.\n\nHelpful | 0", "dapperdan1642Dec 25 at 12:52 PM\nFun\n\nVery well made game and fun\n\nHelpful | 0", "JakeFromStateFarmsDec 28 at 4:48 AM\nHi\n\nIt is fun\n\nHelpful | 0", "FabryzDec 2 at 12:34 PM\nI love it\n\nThis is a must if you like escape rooms: enigmas, comedy, happy deadly accidents... all in a nice, detailed and immersive spy setting\n\nHelpful | 0", "AmericanPsycho1776Dec 1 at 8:27 AM\nExtremely Fun!\n\nIve recently played this game for several hours and I must say it is nothing short of a masterpiece! A must have on Oculus Quest.\n\nHelpful | 0", "daddy1008Jan 11 at 12:24 PM\n\nI just beat the death engine mission and I hear that was the last mission so this is why I am eating 4 star the game is just kinda short\n\nHelpful | 0", "SuperJay1510Oct 24 at 4:04 AM\nJust blown away!\n\nIf you are looking for a puzzle game or a fan of mission impossible or a James Bond fan, this is a game for you.\n\nYou can interact with pretty much anything and will need you to think hard on some of the levels. It also has an amazing story line and around three to five hours worth of content. I cant wait for more levels!\n\nHelpful | 2", "danitemuNov 28 at 11:37 AM\nI LOVE IT\n\nIt is so challenging. It makes lost of FUN. But in the Holiday Lvl. I can't use the Canon pls fix it that it is easier to use. But its still fun\n\nHelpful | 0", "Double-O-JerryDec 1 at 7:19 PM\nreally good puzzles\n\ni thoroughly enjoyed the puzzles and thought there was a great amount of content and scenarios. I'd recommend this to anyone.\n\nHelpful | 0", "TMarioNov 21 at 11:44 AM\nThis Game is just Great\n\nYeah the title says it all. I love this game and I played it to death! Its kinda Sad to hear that the last Mission just came out... still a very good game though.\n\nHelpful | 1", "TrippyQ_4HunnidNov 10 at 4:39 PM\nCant wait till the next update,\n\nIdk who would rate this under 4 stars. This game is something else. Soooo fun i love the fact it doesnt tell you what to do. You gotta find out. Expect to die lots of time but you feel good when u finally get it.\n\nHelpful | 1", "jake.gilley.10Oct 17 at 5:43 PM\nGreat for the quest\n\nThis is an awesome puzzle/spy/survival game where you are a secret agent working your way through various puzzles, and yes just like the title says, you die. A LOT. But thats just the fun of this game, because it challenges you to solve a situation with limited resources. My one and only complaint is that I finished the game and want more levels to play!!! 10/10 would recommend\n\nHelpful | 4", "Risky_DingoOct 2 at 8:58 PM\nOMG\n\nThis game is really good! This was the very first game I got for my quest, and Im not disappointed. If youre considering getting a new game for your quest or rift, I highly recommend this game! If the other games on the quest are as good, I will be excited to play those games to, and I will review those games to!\nThank you so much developers for making this game!\n\nHelpful | 13", "SilverPhantom8Mar 27 at 4:39 PM\nGreat\n\nThis game is AMAZING!!!\n\nHelpful | 0", "Baby_g_lowlifeMar 20 at 7:15 PM\nAwesome\n\nIt was really good I beat it all like in one or two days\n\nHelpful | 0", "betterautoMar 10 at 11:22 AM\nBuy it please\n\nI thought that I wouldnt like puzzle games but i did and that bond intro ten out of ten times infinity\n\nHelpful | 0", "nico_gutierrezNov 24 at 10:01 PM\nFun\n\nActually really fun but shorter, but I think there would be more levels coming soon as the game progresses throughout the years.\n\nHelpful | 1", "htuckerxNov 28 at 11:42 AM\nExpect you to die\n\nThe game is alsome but last mission in spaces is harder than the rest keep it up make a new make me feel like James bond\n\nHelpful | 0", "TorhusDec 15 at 7:15 AM\nA must have game\n\nJust plain fun, and challenging\n\nHelpful | 0", "farmersam730Nov 30 at 7:57 AM\nFun but hard\n\nThis is a very fun game and has great game mechanics and is difficult. (I am not that good at puzzle games\n\nHelpful | 0", "DinnerBugNov 29 at 6:55 AM\nI expect you to di...(BUY)\n\nOne of the best VR titles I've ever played. If you are new to VR I really suggest you to start with this game\n\nHelpful | 0", "timbusbeeJul 19, 2019 at 7:47 AM\nSuper Fun Experience\n\nIts late a night. The wife and kids are all asleep, but I cant slumber. Not now. Not knowing what evil Dr. Zor has in store for my fellow man/woman. 2 hours later and I remove my headset to realize Im not smoking a cigar and siping whiskey, but alas I am still in my underwear.\n\nHelpful | 666", "FaKeFalconNov 26 at 5:37 PM\nJames who?\n\nThis game is by far the best game on quest and probably my favorite vr game of all time. Highly creative and oozes style.\n\nHelpful | 0", "sand114Nov 23 at 11:29 AM\nIts to hard\n\nIts to hard I rage and I LOVE IT its tricky so for any body who reads this your going to have to think our side the box\n\nHelpful | 1", "SlipperyGemDec 4 at 8:25 PM\nOne of the best\n\nHonestly a really enjoyable game thats challenging but not impossible\n\nHelpful | 0", "DmanicJan 19 at 4:18 PM\nThis is very fun\n\nIts a really fun sit down game. I recommend this game.\n\nHelpful | 0", "magicpug105Jan 5 at 10:47 AM\nGood game but...\n\nIts a great game i just wish that they had more levels because i always see myself doingbthe same level over and over again\n\nHelpful | 0", "Zensix6Jan 17 at 3:52 PM\n007 here you go\n\nIf you are a fan of retro espionage, this is goog beginning.\n\nHelpful | 0", "cold_shiversApr 19 at 1:55 PM\n\nGreat game I only wish it was a bit longer but it was amazing. Can you make a second one?\n\nHelpful | 0", "philippe35Jan 5 at 11:14 PM\nNice game but\n\nHello\nI just start to play, its very immersive And cool game.\nBut...\nCan you put french language pleaseeeee.\n\nHelpful | 0", "QUACKVRCNov 25 at 5:12 PM\nReally good but it now\n\n3 words \"hard but fun\" I need a walkthrough for some of the level but it was entertaining but it now\n\nHelpful | 1", "redalert33Oct 18 at 7:48 AM\nFun puzzle game.\n\nGreat game if you like puzzlers. The telekinesis mechanic takes a little getting used to, but the learning curve isn't that steep. Once it clicks, you can get to solving the puzzles.... and it's really fun. I don't really like \"secret agent\" stuff, but at the heart of this game it's just a puzzle game, so I still had a great time with it.\n\nHelpful | 5", "AhmJerryNov 29 at 9:14 AM\nI need help!\n\nI Expect You To Die is one of my favorites, although I have a big problem with first class. I eventually gave up trying to finish the level, and watched many playthroughs. Whenever I spam the room service button, the sender doesnt open. Because of this, I cant play any other levels ahead of First Class. Can I fix this?\n\nHelpful | 0", "ExtremeBrewer7392Oct 12 at 9:43 PM\nIncredible fun!\n\nFrom the opening sequence making you feel like you are living the opening sequence of a Bond film to the intricate, challenging missions, it makes you truly feel like a secret agent! Highly recommend!!\n\nHelpful | 3", "betsylNov 29 at 3:44 PM\n\nSuper fun and just the right difficulty. Just wish that more levels would be added.\n\nHelpful | 0", "matslnDec 7 at 11:13 AM\nLove it\n\nSuper fun experience!! Hours of playtime\n\nHelpful | 0", "Gondar1Oct 8 at 5:05 AM\nGreat escape room game\n\nI had this title for the PSVR and never liked it because the controls lost tracking too much. In this port to the Quest it's a whole other ball game however. Everything works and the game is really fun. It is a escape room type of game where you sit down (a few levels let you walk around where it makes sense). The puzzles are clever enough, without getting too frustrating, but \"I expect you to die\" a lot. There are usually more than one way to finish a level, which I appreciate. If you like escape room type of games this is a no brainer.\n\nHelpful | 4", "CumsterDec 17 at 5:14 AM\nGreat game\n\nGood\n\nHelpful | 0", "ZeHunter08Nov 22 at 9:45 AM\nAmazing\n\nThis game is a fun trip and very enjoyable no complaints besides the fact it ends.\n\nHelpful | 3", "JforssbladNov 21 at 4:28 AM\nThey added levels!\n\nIt's such a wonderful game. I have spent many hours in this game and the puzzles and humor is so much fun.\n\nHelpful | 1", "ryguytheflyguyNov 25 at 1:31 PM\nReally good game would recommend\n\nThis game has 6-7 really fun missions and challenges to complete after youve beat them all\n\nHelpful | 0", "RobustPaellaDec 4 at 12:26 PM\nImmersive, clever and difficult\n\nLove it! The only thing I'd wish they utilise more is the fact that I always turn around to all directions and look underneath tables, but there's never clues - and in the winter cabin level the table didn't have a back side so it was completely see through\n\nHelpful | 0", "GREY-Nov 25 at 6:17 PM\nAmazing game\n\nThis is an amazing game it is like a escape room and spy game in one I recommend this game\n\nHelpful | 0", "cjandrewNov 21 at 2:51 AM\n\nThis game is in it's on lane!!!!!!!This game takes alot of smart's to beat so be ready to think on your feet.\n\nHelpful | 0", "keith.i.deeJan 2 at 3:02 PM\nCool game\n\nIts a nice sit down and use your head game. Definitely worth the money especially if they ad more levels.\n\nHelpful | 0", "Cgamer5407Nov 29 at 3:01 PM\n\nReally fun some levels are really hard it takes a lot of thinking\n\nHelpful | 0", "Theamazinggamer26Nov 22 at 8:44 PM\nGreat game!\n\nThis was the first game I got on quest and still the best! I recommend it to anyone!\n\nHelpful | 1", "ham321Dec 8 at 9:28 AM\nAMAZING GAME\n\nI need more levels\n\nHelpful | 0", "Sheba-boi-2134Dec 11 at 1:37 AM\nBest seated be experience\n\n:D\n\nHelpful | 0", "tcippsNov 24 at 2:50 PM\nDefinitely worth your time\n\nIf you like escape rooms and puzzles, this is a must have\n\nHelpful | 3", "tzoldNov 20 at 7:56 PM\n007 Eat your heart out.\n\nIf you were ever just sitting there and thought hmmm I wonder what its like to be James Bond, this games got your number. The puzzles are actually pretty difficult to figure out and can be frustrating through parts but are oh so sweet when you get them correct. Visually well-crafted and lots of interaction with each world. It provides a well fed amount of content. If you wanna game that you can just sit down and think over get this gem now!\n\nHelpful | 1", "Gingey112Nov 24 at 2:01 PM\nGoood\n\nThis is very fun. The puzzles are awesome and clever. This is a must-buy\n\nHelpful | 1", "djdan158Nov 29 at 9:11 AM\n10/10 game\n\nPlayed over and over there is so much to do in this game\n\nHelpful | 0", "Evanis10ft2Mar 11 at 4:17 PM\nAmazing\n\nIt works well but needs more levels\n\nHelpful | 1", "ShadowbladepaladinDec 2 at 9:57 PM\nAbsolute blast\n\nWhat an amazingly fun puzzle game\n\nHelpful | 0", "lperovskayaOct 18 at 1:46 PM\nStylish and smart\n\nWhat a gorgeously detailed and entertaining puzzle game! Highly recommend. Makes you feel like a real secret agent - even if you fall from a real life chair once or twice. Would love to buy more levels, but now I need to focus on achievements\n\nHelpful | 2", "brauraOct 20 at 11:18 AM\nGreat game but too short!\n\nI think there are 5 or so levels to the game. Each is challenging and fun, and takes time to solve. None of them can be cracked right away, but they're all solvable. Now that I'm done, I just wish there was more!\n\nHelpful | 4", "ANGERSNIPERDec 7 at 10:24 AM\nVery Good.\n\nReally good fun after my first hour of play. Not 100% sold on the \"telekinesis\" ability but I understand its fundamental to how the game plays.\nLike other reviews have said, the controls are silky smooth. Would recommend.\n\nHelpful | 0", "Shadowhunter072Nov 21 at 4:34 PM\nThe Best Of The Best\n\nLove this game and everything about it! I hope they make many missions to come!\n\nHelpful | 1", "lmicNov 26 at 1:10 PM\nAmazing\n\nHonestly so much fun and by far my favourite game on the quest\n\nHelpful | 0", "yatzseDec 6 at 10:45 PM\nSo fun!!\n\nSo fun!!\n\nHelpful | 0", "perspicacitywaningOct 3 at 2:46 PM\nSuperb, funny, perfectly frustrating\n\nThis was a joyous game. It's humourous throughout. The puzzles are difficult enough that repeated deaths seem guaranteed, but the cycle through replay is tight so not usually a burden.\nI played through most of the game in one evening, and was left wanting more. I suspect there's enough alternate solved to some puzzles that it warrants a replay.\nWell done developers! Looking forward to more dlc!\n\nHelpful | 3", "rhinonickNov 22 at 5:26 PM\nIts amazing\n\nI love this game so much it has collectibles to find for the main menu\n\nHelpful | 1", "Pumpkin550Dec 6 at 10:06 PM\nYes\n\nYes\n\nHelpful | 0", "zSpencerDec 31 at 7:52 PM\nBest be game I've played\n\nBest game I've played on my quest so far I got mine on Christmas 2019 bit short though\n\nHelpful | 0", "sek3175Nov 20 at 12:43 PM\nAwesome\n\nThe interaction with game is amazing. Its so fun to pretend your a spy.\n\nHelpful | 1", "matthewfrank49Nov 5 at 3:27 AM\nLove it\n\nI definitely love this game. Wanted it since I first seen it, its hard at first takes a lot to get used to since each mission is always different.\n\nHelpful | 1", "TimmiszNov 29 at 11:49 PM\nYou expected I would die\n\nAnd I did a bit too many times :(\n\nHelpful | 0", "SicoSiberNov 18 at 9:09 AM\nIf youre on the fence...\n\nI went into this game pretty skeptical because all of the reviews said it had a 2 hr playtime. For me the game lasted way longer, but was fairly short if you were just going for level completion and not dramatic flair. Think of this game more like extreme VR escape rooms and not so much like a game. Id say that it is one of the best games VR has to offer and it is definitely worth the money.\n\n(If you are new to VR though, youre probably best off getting super hot VR first)\n\nHelpful | 0", "OBLOJan 19 at 10:10 AM\nNice... but not so long gameplay\n\nIts super fun but when you reach the end the game just stay in your library untouched\n\nHelpful | 0", "jeanmarc.messinaDec 3 at 11:44 PM\nOutstanding VR example\n\nSimply\n\nHelpful | 0", "phillipjamesOct 9 at 8:46 PM\nLoved every minute of it!\n\nWell produced, and great puzzles to solve. Excellent production quality! Like most titles on the Oculus, I wish it was a little longer for the price. Two more missions seems like it would be just about perfect and I probably wouldnt even question the price.\n\nHelpful | 2", "ChatErrorNov 21 at 3:03 PM\nAwesome\n\nThis is a great puzzle game. By far one of my favorites\n\nHelpful | 1", "ykbryanNov 10 at 9:11 AM\nVery Engaging\n\nMy wife and I took turns to solve each puzzle. Very enjoyable. Please add and refresh the puzzles too! :)\n\nHelpful | 1", "Longboard_StoneyDec 30 at 8:12 AM\nGreat game\n\nMy little brother and I loved this game, I just wish there were more levels\n\nHelpful | 0", "CassidyMcCombsNov 9 at 7:29 AM\nI wish there was more freedom\n\nAll levels come with their own set of problems you have to solve to live. I expected there would be multiple way to solve a given problem but theres really only one way to do things and finish the level. Its still a very fun game with great graphics and controls. I would recommend it to anyone who loves doing escape rooms or puzzle games. Honestly Id recommend it to anyone actually.\n\nHelpful | 3", "ken.pfoserOct 27 at 8:58 AM\nCool 50s spy vibe\n\nWonderful game! I liked the escape room feel with the possibility of different ways of dying if I made the wrong decision. It had a cool Cold War spy thriller theme.\n\nHelpful | 1", "kkslayer10Oct 9 at 11:09 AM\nJust get it.\n\nIts literally the best game I have. its such a good game for all ages.\nAnd its sooo Worth your money.\nIts good for the new and if youve the oculus quest for a while its easy simple and its just worth it.\n\n\n\nJust... Just get it.\n\nHelpful | 2", "narcisopangelMay 31, 2019 at 8:08 PM\nFantastic!!!\n\nA very well thought out game! Each level more difficult than the last, each puzzle was creative and enjoyable. Yes, there was perhaps one or two puzzles that I thought the level designer was reaching a bit far but all together, a worthy addition to my library!\n\nHelpful | 68", "80mirrorsOct 4 at 12:34 PM\nAmazing\n\nAlthough I said amazing Im not lying but I completed the game in one day so I was wondering if you could maybe get some more levels in there pretty quickly because this was 25 dollars and I was expecting way more levels than just seven. I think it was seven.\n\nHelpful | 3", "orange1691Nov 10 at 4:47 PM\n\nGreat controls, great gameplay, great everything. One of the best games I have ever played.\n\nHelpful | 1", "LilguipoSep 15, 2019 at 9:08 PM\nA phenomenal experience.\n\nIf you are on the edge of buying this game and not buying it. Go on ahead and buy it. This game is a outstanding piece of my library. From the befuddlement and confusion, to the satisfaction of completing a level. I was crying when i finished the game. Ive only weeped over a game a couple times. The puzzles are designed so that you may die, but then figure out the next piece of the puzzle. I thought I was a awesome spy, defeating doctor Zor with my trusty fedora, then I realize that its really late and I should get to sleep. Something fun to do that will make you scratch your head. Please dont watch any walkthroughs either. You should feel some satisfaction once in a while. I dont want to spoil a lot, but doing things like picking locks, defusing bombs, and driving cars of planes makes my heart race. 10/10 experience.\n\nHelpful | 7", "AtrusOfDni10Oct 7 at 7:53 PM\nFantastic puzzle game\n\nFavorite game on the quest so far (having also tried Superhot, Beat Saber, Space Pirate Trainer, and Vader Immortal). It's like a tiny escape room! Sadly, like most puzzle games, it's a bit short. But this one still definitely was worth buying!\n\nHelpful | 2", "ItsDanoNov 20 at 7:11 PM\nGood time for all\n\nEscape room puzzles fun as hell\n\nHelpful | 1", "an0maly321Oct 27 at 6:25 PM\nSo frustrating and yet so much fun!\n\nOne of the ideal games to feature the possibility of VR. Plus tons of fun with the unique control scheme they employed. Its fun to just play on the couch!\n\nHelpful | 1", "How_is_your_daySep 19, 2019 at 1:17 PM\nA Must buy!\n\nI was doubtful at first because of the price but soon after buying it was worth it. The little things like unlocking things in your menu. Just getting a new gun or even somethings else to do enticed me to not only get all the acheviment things but also the speedrun which was my favorite thing to do. Even watching my friends play was fun (It\"s very hard to not tell them what to do when they get stuck like you did when you first played). I can only think of a way to improve it, When you drink anything it should have more thenjust visual renforcement and should have a slurping sound like job simulator. Other then that, its flawless.\n\nHelpful | 5", "OfficialSammyGOct 1 at 4:59 PM\nHTC to Oculous\n\nThis game is awesome I have so much fun speed running levels and its a game you can replay the levels and have so much fun wether its speed running or having a Cuban Cigar in the gorgeous mountains this games for you and trust me I have been playing this game for 2 years\n\nHelpful | 1", "FlojobsOct 11 at 7:37 AM\nGreat challenging game\n\nThis game is a lot of fun and challenging. Longer than most VR games out there this game has a wide variety of missions that will challenge you. This game also had replay value as you try to beat your record or unlock challenges.\n\nHelpful | 0", "SmithySmithersNov 8 at 12:38 AM\nReplayability: Speed Runs\n\nIf you like quick thinking puzzles, you've found your game. I am unsure if they will be adding on to this game or will have a sequel or continuation. As far as getting this games worth for you, I definitely would have liked to see difficulty options and more challenges after completing the map/game. I enjoyed the Knick nacks but the sense of deep accomplishment was a bit lacking in my experience, perhaps since I was locked to one position.\n\nI really hope to see more of this type of game and from these creators.\n\nHelpful | 3", "harriboyNov 16 at 12:22 PM\nEntertaining\n\nI feel like James Bond in escape room.\n\nHelpful | 1", "Mr.FlufflesDec 23 at 3:23 AM\nHead thinker\n\nGreat game, it makes you think out side the box to solve the puzzles.\n\nHelpful | 0", "kittensayswhatNov 5 at 4:04 PM\n\nGreat game. I love how thought provoking it is. I enjoy the deaths that I have succumbed to lol\n\nHelpful | 1", "kikumarukikeOct 20 at 9:42 PM\nReally fun escape the room-ish adventure\n\nHavent played through the whole game but I get some really nice puzzle solving vibes from it. Totally enjoying it and if you like puzzle solving I recommend it 100%\n\nHelpful | 0", "Hooked0nPhonicsSep 18, 2019 at 6:03 AM\nOne of my favorite Quest games\n\nThere are plenty of games on the Oculus Quest, and plenty more on the way.. but I Expect You to Die is by far one of my favorites. The game is well made, and the challenges are very enjoyable. The game is not so hard that you'll never pass the first level, but not so easy that you'll fly through it. I had a great experience on this game. Truly worth every penny I put into it.\n\nThere weren't a ton of levels unfortunately, but I'm sure that Schell Games will be releasing updates which add new levels as they go in the future. If so, I Expect You to Die will be a absolute must have for any Quest gamer.\n\nHelpful | 3", "Virtualman13Oct 28 at 11:58 AM\nGET I EXPECT YOU TO DIE NOW!!!!!!!!!!\n\nI cant tell you how much fun this is. I am very picky with vr games and this is one of the 3 games I like\n\nHelpful | 2", "SuneDS82Dec 19 at 5:41 AM\nLoving it\n\nFun game. Not impressive graphics but the gameplay is great and its good fun.\n\nHelpful | 0", "Goheezy_Dec 16 at 10:26 AM\n\nIt was decent. It didn't blow me away with happiness but the game was enjoyable to play\n\nHelpful | 0", "psmitty09Nov 2 at 11:29 AM\nBest game\n\nI am 14 and this was the best game ever I couldnt put the VR down best game ever!!!\n\nHelpful | 1", "HexacolleyNov 10 at 3:39 PM\nGreat fun\n\nLove this game. So many different ways to win!\n\nHelpful | 1", "matthew.griersonOct 28 at 9:18 AM\nGreat title\n\nThis is a great game to play, fun and easily engaging. I use it to introduce my friends to my Quest.\n\nHelpful | 2", "MarriageHighFiveDec 28 at 7:15 PM\nFull Of Fun & Crashes\n\nSuper-fun when it works; super-frustrating when it doesn't. Crashes frequently on the Quest.\n\nHelpful | 1", "dannyjk360Oct 28 at 6:22 PM\nLove It\n\nPuzzles are challenging and fun. A lot of the dialogue is funny in a campy James Bond kind of way. Would buy it again.\n\nHelpful | 0", "LordVortexNov 11 at 8:06 PM\nAmazing\n\nThe puzzles in this are amazing\n\nHelpful | 1", "dani.dorfman.50Nov 21 at 6:08 AM\nAmazing\n\n.\n\nHelpful | 0", "Dr100percentOct 14 at 10:01 PM\nFun and engaging\n\nThis game is meant for play while seated but it manages to follow a good secret agent storyline and solve puzzles and dodge traps. Fun to play and has humor throughout.\n\nHelpful | 1", "Josh_B92Oct 28 at 4:39 PM\nCan't wait for more levels\n\nGreat game, hours of fun, each level like a little escape room. Can't wait for more levels to be added\n\nHelpful | 1", "yodaboi007Sep 20, 2019 at 6:53 AM\nWow, just wow\n\nNow this definitely isnt the best game Ive ever played, but as far as VR games go, on the quest? This is definitely one of the best. Its really fun trying to figure everything out in the 15 seconds you have before you DIE in almost every level. Its a fast paced puzzle game where you spring booby-traps and unlock secrets through puzzles. It really is a great\ngame. 10/10 would play again\n\nHelpful | 0", "GomaqNov 5 at 9:21 AM\nFun Group Play\n\nCast to a Big TV and this is a great group game. My wife inevitably winds up nose to the screen yelling directions. We have to play right after dinner, or she gets too worked up to fall asleep. Good problems to have! Taking to my next company retreat.\n\nHelpful | 2", "jda996Sep 24, 2019 at 5:23 PM\nExcellent quality, game play and story\n\nI really love this game is one of my all-time favorites it has a lot of everything action jokes a great game play telekinesis explosions is one of the best games out there for me and I would recommend this to be one of your must-have or the first games\n\nHelpful | 2", "Der_MountainOct 5 at 9:27 PM\nA new VR experience\n\nThat is a fantastic game. It was one of my first games on the Quest and I enjoyed it all the time.\nEvery level is great and well-thought-out.\nIn my opinion this game is a must play.\n\nHelpful | 2", "alberto_aapDec 17 at 6:23 PM\nExcellent game\n\nIts a really fun game! Just wished it lasted longer\n\nHelpful | 0", "BenAboutLondonAug 16, 2019 at 12:40 PM\nI expect you to die\n\nI love being James Bond! This was an amazing game that taught me to not give up no matter how hard it is. I also loved how it's still new and levels are still coming out. Every level made me better at solving puzzles and cracking codes. I also thought that it was narrated in an amazing way. Me and my brother called him Watson. Also, the game was fun because I could smoke a cigar and drink Champaign , whiskey and wine without worrying about anything.\n\nHelpful | 4", "lindseymgastOct 6 at 4:07 PM\nMore levels, please!\n\nThis is my all-time favorite game for VR! And this is the only game out there like it! Please, please give us more levels! I would buy updates 10 times over to keep playing!\n\nHelpful | 2", "Venstarx4Nov 6 at 6:15 PM\nAmazing game.\n\nIt really makes you feel like a spy.\n\nHelpful | 0", "KiraplaysOculusOct 16 at 7:33 AM\nAmazing.\n\nI had a lot of trouble finding a long term enjoyable game, and after a lot of buying and refunding, I finally found one. I love it.\n\nHelpful | 1", "ChrK2017Sep 26, 2019 at 9:26 AM\nFun and entertaining!\n\nIf you like puzzles and excitement, then I Expect You To Die is just the game for you!\nWith the many ways of die makes the game intense and makes you feel that you just NEED to solve the mission.\n\n5 stars rating from me!\n\nHelpful | 2", "kamaleon70Nov 8 at 7:43 PM\nbuy with money game\n\nGame is cool....o.k.\n\nHelpful | 0", "AllXanarchyNov 7 at 4:45 PM\nYeet\n\nCool\n\nHelpful | 2", "fieryspirit1Aug 28, 2019 at 7:07 AM\nAmazing puzzles and incredible fun\n\nI love everything about this game. From the moment the opening credits started, I was laughing already. The hard nosed spy aesthetic is really well done, and the puzzles are very well thought out and a blast to play through, while discovering all the hidden interactions throughout. A must play VR title.\n\nHelpful | 2", "ChimiedelameSep 3, 2019 at 7:57 AM\nBe a secret agent!\n\nHello, I apologize for my English.\n\nThis type of game \"escape game\" is beautiful. The sets are beautiful, the atmosphere is absolutely the situations encountered. And what about the liaison officer with his humor! Some solutions are not real in case you have very advanced knowledge in maintenance or chemistry / biology but nothing blocking so far. We would have loved the presence of subtitles in other languages, but a basic understanding of English is sufficient for the vast majority of quests (asked for help only for the mission in the train with the phone)\n\nThis is an excellent game and we hope that each mission is not the last, for my part I finished the missions and I still hope for an update for even more fun!\n\nHelpful | 4", "DDGAOct 15 at 4:23 AM\nNeeds more!!!!\n\nOne thing I found with this game and lots of others is they are to short, for a 30 dollar game u should have more then just 5-6 levels, make some dlc and get these games longer, or just make them longer from the start. They are vary fun and keeps u on ur toes but after an hour all ur doing is trying to beat ur best scores, the fun ends vary quickly when this happens.\n\nHelpful | 4", "AlgenardOct 14 at 8:16 PM\nEasy and fun!\n\nSuper fun and easy to learn. It just keeps crashing in the 2nd stage. I'm sure my experience is abnormal and a update can easily fix it. Definitely worth the purchase from a rookie VR user.\n\nHelpful | 1", "ElonDuskOct 12 at 4:58 AM\nGreat game\n\nPersonally my favorite part of the game is the credits because the song that it plays is just really good and I love it\n\nHelpful | 2", "zedmaster1122Aug 31, 2019 at 4:09 AM\nOne of my favorite VR games\n\nThis game is definitely one of the most polished, fun and immersive games I've played. Both me and my girlfriend finished it and loved every part of it. The levels and puzzles are creative, hilarious and engaging. The narration is funny and lovely, the soundtrack is gorgeous. I also like, that sometimes there are different ways to solve a problem.\n\nI wish there were more levels and I am super looking forward for future updates.\n\nTake a chair, sit down and enjoy this gem :)\n\nHelpful | 4", "guenter.baumann1711Oct 3 at 4:02 PM\nDying grinning or grinning only\n\nThis game is a puzzle inside an enigma - its creators must have a nice twisted sense of humor.\n\nIf you think of buying a mind twisting gane - buy it!\n\nHelpful | 2", "TheWiseOwl190Sep 22, 2019 at 8:37 AM\nBrilliant game!\n\nI loved this game a lot ! Wanted a good escape room type puzzle game and this fit every expectation. Took me about 5 hours to finish Id say. Please make more levels!! Ill buy any you release.\n\nHelpful | 3", "UncertainZeroOct 13 at 10:38 AM\nFun, Funny and a Must Own\n\nRuns well, lots of interesting interactions even beyond the game play.\n\nEasily a must own game for the Quest.\n\nHelpful | 1", "jacksparrow666Oct 16 at 6:12 PM\nI'd expect you to die\n\nAwesome please make a part 2 this was actually the first vr game i ever played and i love it.\n\nHelpful | 1", "DTTF_2.0Sep 18, 2019 at 8:05 PM\nAmazing gameplay But\n\nThe game was amazing to play the graphics were sync with everything else the interaction with objects was immersive .but I felt like there was a lack of levels. Also though the developers did an amazing job at creating a realistic immersive excellent graphics for a game\n\nHelpful | 2", "jellyfishmaiyaOct 10 at 3:46 PM\nI love this game\n\nThis game is like an escape room but like virtual. It is so fun. Extremely recommend if you like puzzle games.\n\nHelpful | 1", "TheHypeSlimeOct 29 at 5:14 AM\nThe first class mission\n\nIt is SOOOOO hard\n\nHelpful | 0", "yoavsilAug 29, 2019 at 6:02 AM\nMy favorite VR game ever!!!!!!!\n\nThis is the most amazing game I ever played in VR the story is excellent and the levels are not easy but not to hard that you need to look online for (except the first class level it was a bit too hard for me but it was still really good)\nI highly recommend it it's a MUST HAVE!!!\nThank you so much for this amazing experience!\n\nHelpful | 2", "haloharry97Oct 3 at 4:00 PM\nMust play\n\nI think it is one of the must plays on the quest.\nBut you will need to have a lot of patience for one or two of the mission.\n\nHelpful | 2", "LilCheezeySep 5, 2019 at 10:14 PM\nMy personal favorite\n\nThis game is just incredibly fun. Whether youre a completionist, or just looking for a casual puzzle to solve, this game is for you. Its charm and humor are paired with fun and interesting puzzles and make me wish there was more to play now that Ive finished.\n\nHelpful | 1", "THANKSforTHANOSSep 30, 2019 at 3:43 PM\nAmazing\n\nOn the Quest it has amazing gameplay. The story is fun and it's suitable for anyone. The different levels are fun to play and have great mysterys.\n\nHelpful | 1", "StormstrikesNov 30 at 11:35 PM\nA good Game.\n\nIts a good game, but the puzzles are not easy.\n\nHelpful | 0", "King_pepper_123Oct 8 at 2:42 PM\nAmazing\n\nThis game was so worth it I had a blast playing it, and it's something to do just sitting down\n\nHelpful | 1", "Augustpihl1Oct 25 at 4:16 AM\nGood\n\nVery good\n\nHelpful | 1", "Lord_GeniusAug 9, 2019 at 5:10 AM\nThe best game I have bought on Quest\n\nI think thats this game is the best puzzle game you can find in Oculus Quest store. If you like searching for objects and try to find the way to use it this game is definitely for you. You have 5 different levels and actually they added the level 6. I have finishes the game in about 5 hours but if you are quick enough you can finish it after 2-3 hours so dont expect for a long game play.\n\nHelpful | 10", "Laird_DixonOct 18 at 6:52 PM\nAmazing\n\nI'm absolutely in love with this game!\n\nHelpful | 1", "LolipopiboiOct 20 at 3:12 AM\nVery fun\n\nSuper fun and hard levels\n\nHelpful | 1", "HackletopOct 2 at 4:40 AM\nGreat game!\n\nI really enjoyed the puzzles and challenges. Overall it was a great experience and really immersed me into being a spy.\n\nHelpful | 0", "GuidryGamerOct 7 at 1:15 PM\nBest game EVER!\n\nThe is is a very fun game and is cool in every way, I just with it were longer.\n\nHelpful | 1", "Sudsiestmist375Oct 13 at 6:59 AM\nAmazing game\n\nI originally saw this game on YouTube and loved. It is a 9/10 and is perfect. It just needs more levels.\n\nHelpful | 1", "truthbynatureOct 12 at 1:15 AM\nVery fun and engaging!\n\nLoved it! Would love to see more levels added.\n\nHelpful | 1", "KenDod101Nov 4 at 2:55 AM\nJust too short a story mode for me\n\nThe game it self is brilliant and addictive! The only reason it doesn't get 5* is that the amount of missions the game offers are not enough for me.\n\nHelpful | 0", "AawooOct 13 at 1:41 PM\nI love it so fun!\n\nPlease make more levels!!!\n\nHelpful | 2", "APG3488Aug 19, 2019 at 8:12 PM\nBeautiful\n\nI originally got this on the vive and loved it. Then I heard this was coming to the Quest and got excited. I then bought IEYTD knowing how to beat most levels. I beat it within a day and felt good about myself so I did some challenges/achievements. In all I say five stars. A must have for the Quest.\n\nHelpful | 2", "AtomicMOct 5 at 5:58 PM\nGreat game\n\nLots of fun and very difficult. Really puts your mind to the test.\n\nHelpful | 1", "PennychanbabeSep 30, 2019 at 5:36 AM\nMakes your brain working!\n\nLove it ! But too few levels. Please add levels. Cant wait to have another similar games\n\nHelpful | 1", "LoraleiBAug 13, 2019 at 8:11 PM\nWell detailed!\n\nI can really see how much effort and detail you put into this! Trying to get the voice actors for 3 characters must have been tricky. Also, Coding it mustve been very tricky. My only issue is how pricey It is. But, I dont really care. The souvenirs are really interactive as well! Burn the bear, Wear the hat and burn the cigarette. Getting scorpions for the speed runs are really silly. But what the heck? Also, I know there is one for every speed run, but...There is one extra pedi stool for I know must be a speed run souvenir. Is there going to be a new mission in the next update? Still, Keep working hard!\n\nHelpful | 4", "PicoDeGattoOct 23 at 10:01 AM\nClosest thing to an escape room\n\nI love real life escape rooms and I definitely got my fill of that here. Lots of fun and very clever puzzles. I just wished there were more levels or the difficulty increased exponentially.\n\nHelpful | 0", "TwitchingBotAug 17, 2019 at 12:38 PM\nThe Ideal VR Puzzle Game\n\n\"I Expect You To Die\" is an outstanding puzzle game. Despite the low number of 6 levels, the game starts with an easy first level and each level gets slightly more difficult, and takes more time to figure out than the previous one.\n\nThe narration is both comedic and serious, and gives slight tips and hints that aren't always necessary, but still helpful. I also like the replayablility of the levels, so that you can earn more achievements by going back to a previous level to complete it in under 2 minutes or so.\n\nYou can definitely tell that the developers went for quality over quantity, seeing as how detailed the layout of the levels are and how the backgrounds have effort put into them as well. Even the story and narrations are done flawlessly!\n\nI can't wait for the seventh level to come out later this year, and I hope to see even more in the future!\n\nHelpful | 1", "AsiaanBoiSep 4, 2019 at 12:12 AM\nGreat Game But...\n\nIm a 1 or 5 star type of guy and there are some bugs that need to be addressed about this game.\n1. If you try to do speedruns and do anything too fast there is a high chance the game will crash. I experienced the most crashes on the winter level.\n2. VERY important items will sometimes not be highlighted whenever they are put below tables or my own chair. I dont want to spoil anything but to let others be aware. This glitch happens to very small objects.\n3. The amount of tracking fails I have experienced is phenomenal. I know this isnt a hardware issue because I only experience it in this game. Whenever Im delicately trying to move objects about. The objects will have spasms and cause me to fail.\n\nHelpful | 12\nDeveloper ResponseSep 9, 2019 at 8:57 AM\n\nHi AsiaanBoi- We're so sorry to hear about the tracking and glitching issues that you're having with the game. Can you email gamesupport@schellgames.com so we can record those bugs and see what's going on? Thanks!", "PaulyBirdmanAug 14, 2019 at 3:05 PM\nPerfect Balance\n\nThe puzzles are fun and not impossible. Each situation provides you with multiple paths to completion. Most importantly, the game was fun! I hope the makers come out with an expansion! Solving each situation left me feeling proud of myself.\n\nHelpful | 2", "JerachiSep 25, 2019 at 2:46 PM\nReally fun\n\nIt is a really fun and enjoyable game while still being difficult and funny\n\nHelpful | 3", "DavisMDeanOct 1 at 10:36 PM\nSuch an amazing game\n\nI love puzzles, this game is perfect for me and such an amazing game!\n\nHelpful | 0", "thomasfffDec 13 at 6:16 PM\n\nIts alright\n\nHelpful | 0", "HorseguardSep 28, 2019 at 5:20 AM\nGreat spy genre escape room puzzler\n\nGreat production quality on all fronts. Worth every penny. Smart, funny.\n\nHelpful | 0", "CroppAug 19, 2019 at 3:30 AM\nSuper fun, Great Intro Game\n\nFun brain teaser game with a spy twist. A perfect seater style for introducing folks to the quest, gaining confidence in using controls, and feeling out what being in a 360 VR environment entails.\n\nHelpful | 2", "laura.rostelatoSep 9, 2019 at 7:06 PM\n\nMy favorite game so far! My husband and I spent hours in the game and we didnt even notice. I just hope they add more episodes in the future.\n\nHelpful | 2", "Maui52Sep 8, 2019 at 3:50 PM\nBest game Ive ever played\n\nBest VR game Ive ever played, always something unexpected or amazing behind every story, Ive played this game over again at least three times\n\nHelpful | 2", "JTubbrittMay 25, 2019 at 9:58 AM\nFrom PC to Portable.\n\nDelighted beyond belief this is available on the Quest. My wife and I finished the original PC version and are looking forward to going through all the levels again on the Quest version. Please consider a DLC pack people can buy in the future that adds more levels. I'd buy them all in a heart beat.\n\nHelpful | 348", "TwinTurbo74Aug 7, 2019 at 3:19 PM\nExceptional Game!\n\nI really enjoyed playing this game. The puzzles are challenging enough but not frustrating. The interaction with objects is far superior to most other VR games I tried and the details are superb. I played through the free update as well. I hope the developers keep releasing new DLC because I want more\n\nHelpful | 2", "Capcap40Aug 10, 2019 at 11:36 PM\n\nI absolutely love this game. It's just perfect. Really makes you think, but not overly difficult. It can get frustrating when you get stuck, but there are enough clues as to what to do next. It's a must have. Even the opening credits are amazing, I make my friends watch it.\n\nHelpful | 3", "greybossSep 30, 2019 at 4:21 PM\nAmazing!!!!!\n\nIt's so fun it's all I can do these days\n\nHelpful | 0", "ibew.sparkyNov 2 at 7:23 AM\nGood game, short\n\nThe game is fun, has some humour, but is very short for $30.\n\nHelpful | 3", "saed.alqadi.58Oct 1 at 7:36 PM\nBest game on VR\n\nCant wait for new levels\n\nHelpful | 0", "Arnold73Sep 17, 2019 at 3:31 AM\nExcellent game\n\nGood looking, intelligent game. Nothing to add to the other reviews ^_^\n\nHelpful | 1", "KristaalosAug 13, 2019 at 9:21 PM\nEscape room with a James Bond twist\n\nThe game has fun puzzles to solve and has an impressive 1960s bond Art Direction. Despite my one criticism of this game, it still deserves a five star rating. I would have preferred that they do away with the telekinesis and better utilize 6-dof.\n\nHelpful | 0", "Hayday7606Oct 1 at 2:20 PM\n\nYes\n\nHelpful | 0", "mizzlekJun 13, 2019 at 1:21 PM\nYou expect me to talk?\n\nFirst time VR user thanks to the Quest. Absolutely fabulous puzzle experience. Immersive experience and you start to feel like an agent, albeit an incompetent one. 006 perhaps. I want MORE!. Controls are quick/easy to learn.\n\nADVICE: don't skip the opening credit scene. They're an experience on its own.\n\nReally well done game. Can't wait for the \"seat of power\" DLC in july\n\nThis is a must buy IMO. Its great for some casual sit down puzzle solving.\n\nHelpful | 25", "J13BarlowAug 31, 2019 at 8:38 PM\nExceptional\n\nIf your as fan of thinking then you will like this game.. Each level offers it's own unique twist without getting redundant and leaves you thinking about how to solve the situation even when you're not playing. This was the first VR game I played and it did not disappoint. I do wish they would drop a DLC pack, with a few more levels this is a 5 Star game!!! Do yourself a favor and purchase it.\n\nHelpful | 5", "jason.ezerskiAug 30, 2019 at 10:32 PM\nMust download!!\n\nMy wife and I love the game! Im a gamer and shes a puzzle gamer and we love playing this together. Bring on more levels please!!\n\nHelpful | 1", "Crazy_SaneJul 17, 2019 at 2:15 AM\nBrilliant game, but a little short\n\nThis is a super fun puzzle game that will especially appeal to fans of the early bond films. But thanks to the humorous tone, you'll feel more like Austin Powers than James Bond. Leaves you wanting more, and there is DLC coming soon.\n\nThe new level is here, and it doesn't disappoint. I can't wait for more, or even a part 2.\n\nHelpful | 4", "Branden1111Aug 31, 2019 at 11:12 PM\nImmersive and challenging\n\nIf you like puzzles and the concept of \"presence\" in VR gaming, then this is for you.\n\nHelpful | 2", "Squirrel-manSep 6, 2019 at 4:19 AM\n\nI highly recommended this will make your spy dream come true \n\nHelpful | 0", "theturkellerAug 31, 2019 at 11:16 AM\nGreat but short\n\nThe game is very well constructed and really satisfying to play, but there are far too few scenarios to justify the price tag. Even notwithstanding the short length of the game, the ending itself feels incredibly abrupt, not like youve come to the end of the story at all.\n\nHelpful | 3", "Soulsurfer83Sep 3, 2019 at 6:43 PM\nLive a spy thriller!\n\nIts like living a mission impossible scene with sooooo much great humor.\n\nHelpful | 0", "Cleaner33Oct 19 at 11:46 PM\n\nCool game i hope they add on or come out with more\n\nHelpful | 0", "UrchickshubbyJul 17, 2019 at 6:05 AM\nAwesome!\n\nThe game is a keeper. When u start playing it gives u little to know clue on what to do which makes it challenging. If your into do it yourself puzzle games this is the one.They need to keep making Updates with more levels. In comparison to the other puzzle games available right now this is the top puzzle game.\n\nHelpful | 3", "koneponeJul 21, 2019 at 6:19 AM\nFun and entertaining escape the room\n\nI love escape the room in real life, never liked those puzzles on pc. But I so really love them in VR. This game gave me many good laughs and a great time. It is pick up and play.\n\nIt is not intuitive to pick up things and drawers, but you pick it up quickly.\n\nLove it. 5 stars\n\nHelpful | 0", "spriterightsJul 29, 2019 at 8:22 AM\nIncredible\n\nThe intro sequence alone is stunning, I knew my purchase was justified before I even got to the game. Voice acting is great, controls feel natural and the levels are super fun. I just wish I could keep my cigar in my mouth at all times\n\nHelpful | 0", "MTilleyMay 25, 2019 at 3:50 AM\nPolished, fun first person puzzle game\n\nThe first thing you notice about this game is the sheer level of polish. The opening title movie set's the tone for the game fantastically.\n\nPlayed on the rift first, can hardly tell the difference for the Quest port.\n\nOverall, solid fun game that I think everyone with a Quest should try out.\n\nHelpful | 11", "aprillstrombergAug 19, 2019 at 10:12 PM\nI want more\n\nI love this game. I hope we get more missions. It was really fun, but not much there after you have beaten it.\n\nHelpful | 0", "PrestoniLCFCSep 5, 2019 at 7:47 AM\nFavourite game\n\nIts awesome get\n\nHelpful | 0", "andersonvalentineOct 12 at 8:17 PM\n\nAmazing game want more levels maybe a dlc\n\nHelpful | 0", "OrdinaryWorldJul 2, 2019 at 8:27 AM\nFun and stylish\n\nAs games have evolved from simply moving pixels around a screen to truly immersive, multifaceted, intelligent interactions, development studios have had to up their game (literally) in terms of providing an all-around entertainment experience. Beyond creating the logic for games and puzzles, they are required to tell stories, with wit and humor and style. This game excels in such an evolution and just watching the opening titles let's you know you're in for a treat - I was smiling before I had even started the game! I was also delighted to find that I can play this game while seated with extended actions in the space being achieved via your new telekinetic powers. A worthy addition to my Quest library.\n\nHelpful | 4", "Newfinator-Oct 13 at 8:36 PM\nGreat game but short\n\nGreat game but short\n\nHelpful | 1", "del3dJul 23, 2019 at 10:43 AM\nI love it!\n\nI finished all missions in a couple of hours. Some puzzles took some head scratching but with a few retries I got through. This game is so much fun I was sad when I got to the end. Please release more missions!\n\nHelpful | 2", "MonkFastAug 5, 2019 at 4:02 PM\nUsed all of my brain muscles\n\nWasn't expecting a mental challenge, but this game really makes you think. I somehow made it through the game without looking up tips online, and I died many times.\n\nHelpful | 0", "SuperBonAug 10, 2019 at 10:53 PM\nAddicted\n\nI hope developer can add more levels, this game is just too interesting and challenging, I dont want this game ended. I want more..\n\nHelpful | 0", "k1ng0fth3juNgl3Jun 17, 2019 at 9:10 PM\nThe BEST VR Game Out\n\nSeriously, this game is hands down the best VR experience/game available on the Quest right now. The levels are so clever, so well thought out, and so much darn fun. The only bad thing is that I wish there were more levels, I am HOOKED to this game. And Im the type to never write reviews for anything. You guys really nailed this.\n\nHelpful | 10\nDeveloper ResponseJun 18, 2019 at 10:15 AM\n\nStay hooked, Agent! Your 'Seat of Power' update is coming soon!", "CactusTonyOct 9 at 10:42 AM\nSecret agent man\n\nA game with a great atmosphere and humor.\n\nHelpful | 0", "FROPI_Oct 15 at 7:06 PM\n\nGood game\n\nHelpful | 0", "darwins.lastAug 25, 2019 at 1:55 PM\nFeel like a Spy\n\nAwesome game. Immersive and super fun to play.\n\nHelpful | 0", "ReesesbenAug 1, 2019 at 5:21 PM\nI could play this all day!\n\nThis is so much fun! The levels take a while until you understand what you need to do and then you can zip right through them! Fun game! I would highly recommend!\n\nHelpful | 0", "InventormilianoOct 7 at 1:49 PM\n\nGood game a little confusing at times\n\nHelpful | 0", "Jtizzel47Aug 26, 2019 at 9:11 PM\nExtremely fun\n\nI love this game but I think it is too short. All the levels are well polished and look exceptionally, espically compared to others on the Quest. However, five missions feel a bit short and I dont know what to do with the rest of my time!\n\nHelpful | 0", "TheBigTacoAug 24, 2019 at 11:37 AM\nVery happy this is on the quest!!\n\nI am surprised, I did not expect this to be on the quest!! I am really happy to see it here, I have played this once before, and Im happy I can play it again any time I want!! Yes it might be just a tiny bit pricy, but to me it was worth every penny!\n\nHelpful | 0", "theTaylorwailerJun 30, 2019 at 5:27 PM\nSurprisingly Fun!\n\nI thought I would be very anxious playing this game but its super entertaining! The whole secret agent theme is spot-on and thrilling! I love how the puzzles can be solved in different, sometimes unconventional, ways. I havent finished it yet however, I highly recommend it! Note: make sure youve got a good seat or you may fall off like I did, haha!\n\nHelpful | 0", "marcalangriffinMay 23, 2019 at 2:29 PM\nJust as great as on Rift :-)\n\nI have found nearly no differences to the awesome Rift version. Minor things only... fewer shadows and reflections... nothing that affects gameplay or atmosphere. Good job, Schell Games!\n\nHelpful | 16", "vickzzzzzJun 2, 2019 at 12:51 AM\nFun\n\nThis game was simply too fun to play as a couple. We had so much fun and laughs. But there were times when we hit a brick wall and needed some time to get through. I wish it had more than five stages. I gotta go back and get all the achievements.\n\nHelpful | 5\nDeveloper ResponseJun 11, 2019 at 10:43 AM\n\nGet all the achievements so you'll be ready for the updates!", "SadactJul 27, 2019 at 12:12 PM\nClass\n\nThis game just smacks your grinning face with style. So much thought and care has gone into making this little gem gleam, and that, combined with its simply being immense fun to play, means that if you don't love it you're worse than five Hitlers. A star off only because it's over too quickly. The difficulty is perfectly pitched - props to the Devs for that; lengthening a game by deliberately adding fiddly, tedious, and near-impossible bits is the mark of thugs and cowards - but it could have done with twice as many missions.\n\nHelpful | 5", "rowee270Aug 13, 2019 at 11:45 AM\nExcellent game, but needs more missions!\n\nLook i think this is an excellent spy themed scenario puzzle game with a beautiful design and style. The credits are an awesome mix of 007 intros and 60's cartoon styles. However I must deduct a star for there being only 6 missions. Hopefully they add more,!\n\nHelpful | 0", "LepsySep 9, 2019 at 3:05 AM\nIf it's what your looking for.\n\nIf your into escape room style games then this is for you. If not dont bother. It's fun but can get abit boring fast.\n\nHelpful | 0", "ShmeeBeeAug 21, 2019 at 4:25 AM\nIm speechless\n\n.\n\nHelpful | 0", "nastradamousJun 22, 2019 at 10:58 AM\nGreat experience, wayyyyy short\n\nI love this game it's extremely cool, intuitive, makes you think and it's a lot of fun. It's just way to short there's only a few missions and you're done. I'd pay more for many more missions. If it had more gameplay easy 5 star review because the game itself is amazing.\n\nHelpful | 23\nDeveloper ResponseJun 24, 2019 at 9:15 AM\n\nWe're glad you enjoyed playing the game, Agent! You'll be happy to know that more missions are underway!", "OversizeWizardJul 18, 2019 at 6:23 PM\nGreat little puzzler\n\nLive to play this game. Some good challenges but wish there were more. Hopefully in updates or DLC.\n\nPuzzles not too hard but not simple either. Really enjoyed so far.\n\nHelpful | 0", "Evans_Taylor_DigitalMay 29, 2019 at 1:52 AM\nPolished, fun and surprisingly addictive\n\nIve played quite a few VR titles now on Rift, Go and Quest and I think this is my new favourite ! Its a lot of fun and incredibly well designed. As a developer myself, I really enjoyed the commentary available after you complete the Game.\n\nOnly negative is I think its a bit short... theyve obviously sacrificed Quantity for quality however and that is rarely a bad choice, so it remains 5 stars in my opinion\n\nHelpful | 12", "jman0013Jun 22, 2019 at 7:12 PM\nJman0013\n\nFor me being new to the world of virtual reality, this game blew my mind. I enjoyed the feeling of really being in the house and all around the property exploring for clues and completing different tasks throughout the game. Great job to those that created this VR experience game.\n\nHelpful | 1", "DeadLikeMeJul 7, 2019 at 1:58 PM\nA must buy!\n\nThoroughly enjoyable puzzle game. Entertaining and sometimes frustrating. If you are going to buy anything for your Oculus Quest make it this game.\nRecommend using a swivel chair for the experience.\n\nHelpful | 1", "AymericB87Jul 18, 2019 at 6:15 AM\nExcelent\n\nJust the best VR game so far\n\nHelpful | 3", "leaper1981Jul 4, 2019 at 6:13 AM\n\nGood fun, humorous, brilliantly annoying & good use of telekinesis so you can play this sat down. Not a lot of VR games last very long but this has a lot of depth and is 1 of few games that can justify its price tag.\n\nHelpful | 0", "Azazel08Jun 2, 2019 at 8:25 AM\nthis Quest port is a marvel\n\nWhatever black magic they used to get IEYTD on Quest really worked. Now you can pretend to be a James Bond spy wherever you want. You can play the car level... in a car. Or the escape pod level... in an escape pod (if you have one). The ability to play this game anywhere on Quest is really cool when you consider that before the Quest you had to own an expensive PC or PS4 to play. The game is amazing and the soundtrack is superb as well.\n\nHelpful | 2", "argerichJun 19, 2019 at 11:55 PM\nWow!!!\n\nThis is one of funnest games I have ever played. Everyone I show it to is so impressed at how immersive it is. Puzzles are very fun and quite frustrating at times, definitely gets you thinking. I just wish there were more levels.\n\nHelpful | 5", "brutiusJul 18, 2019 at 8:51 PM\nFun group game\n\nWe had people watching on tv yelling out things to try. Very fun puzzle game / escape room game. The intro is the best one yet.\n\nHelpful | 1", "stardust418fJun 3, 2019 at 6:32 AM\nLove it\n\nI Know Some may be discouraged to purchase this due to it's short length, don't be, it's worth every penny and probably my favourite vr game, plus there's more content coming this year.\n\nHelpful | 5", "nils.andrae.7Oct 11 at 7:08 AM\n\nGood game\n\nHelpful | 1", "DAX_QcSep 3, 2019 at 8:35 AM\nFun\n\nA good siting experience. Can get very annoying to restart over and over but hey you gonna die.\n\nHelpful | 3", "KorbenCountyAug 2, 2019 at 1:34 PM\nBrilliant and Funny\n\nOne of the best experiences I've had on Quest so far.\n\nHelpful | 0", "BridgwilJun 11, 2019 at 4:38 PM\nSimply Amazing\n\nPersonally I am a fan of puzzles and this game made me feel a part of one in a cool secret agent way, the graphics are good, and the gameplay is great, bringing on new challenges and cool experiences, overall if you love a good puzzle and like the feeling of accomplishment then this is a perfect game. I would recommend it to anyone!\n\nHelpful | 1", "tim.cassidy.56Sep 7, 2019 at 5:59 PM\n\nGreat puzzler and my favorite Quest game so far. The visuals are glitchy though.\n\nHelpful | 0", "san71a9oMay 22, 2019 at 7:29 PM\nFun\n\nThis game is so much fun and probably one of the most comfortable\n\nHelpful | 23", "aj.seliga.5Jun 16, 2019 at 11:51 AM\nFun, Clever, Witty\n\nLove this game! Controls are easy to master and intuitive. The puzzles are really fun. I haven't played a game till the end in years but I had so much fun and beat all of the missions. I'm still enjoying the game and attempting to beat the bonus objectives.\n\nHelpful | 2", "Schnied723Jun 3, 2019 at 8:27 PM\nMini escape Rooms\n\nGame was very satisfying, each level was a spy themed mini escape room. Each mission was unique and satisfying once solved. Some replay ability involved by trying to meet additional goals or increase time. Over fun game and fun one to compete with friends\n\nHelpful | 2", "Datheo4EverJun 9, 2019 at 1:38 AM\nI expect you'll have a blast!\n\nThis game is so marvelous... The purpose is to solve deadly mission impossible like puzzles. Graphics are just great. You can interact with every object. Game design is ingenious. You play seated but still 6dof is great for leaning and grabbing objects with both hands. I loved the James bond like intro....well,i didn't expect such a good game... Very inspiring for the futur games!\n\nHelpful | 0", "TopoSolitarioMay 31, 2019 at 12:44 AM\nGreat but a little overprized\n\nI got hanged on the game just by looking at the intro in youtube... game is great, you really get in the mood of 60's spy cheesy movies. It is a scape room/puzzle game but well constructed and really enjoyable. A great app to show off VR capabilities to family and frieds.\nOnly problem I see is prizing, comparing to other Quest titles, this one is one of the most prized... a 15,99 price seems more fair to me, that's the reason of a 4 star rate.\nAnyway, game is uberfun and fulfills my expectations.\n\nHelpful | 12", "DonmadJun 4, 2019 at 9:13 PM\nBEST VR GAME EVER\n\ni was hesitant on buying this but boy am i glad i did. its so satisfying figuring out the puzzles and solving them, the levels are challenging but not to challenging, all the easter eggs makes a sense of immersion and the challenges to complete in each level give a reason to keep coming back for more its overall such a great game. if they made an extension to this game with more levels i would buy it in a heartbeat.\n\nHelpful | 1", "crazy_foxJun 18, 2019 at 11:35 AM\nJust awesome\n\nGuys can we please get a sequel ? The game is too good you got to make more levels\n\nHelpful | 4\nDeveloper ResponseJun 27, 2019 at 11:38 AM\n\nMore levels are on the way!", "KAKINBALLSJul 22, 2019 at 2:48 PM\nEscape Room VR\n\nI loved this game. I wish for many more levels to keep testing me!\n\nHelpful | 0", "SmokingthefunnyMay 27, 2019 at 6:33 PM\nso much fun!!\n\nLove this game, i hope they make more and more missions , id buy them all, its one of those go-to games for when youre just feeling lazy and get to play with your headset on the couch. You can figure most things out but the process is fun and addictive and everything i hoped For when i bought the quest, i really cant wait what this platform has to offer in the coming months/years , well done for a fun game , please make more :)\n\nHelpful | 4", "prabirjb.ranaJul 27, 2019 at 2:32 PM\nAwesome\n\nThis game is very fun 10/10\n\nHelpful | 0", "XxPriMa_NoCtAxXJul 16, 2019 at 4:18 PM\nGreat\n\nAmazing puzzle game, great graphics too, and they just added another level\n\nHelpful | 0", "wanderer1972Jun 17, 2019 at 12:19 PM\nAwesome\n\nI loved this game, graphics were great and clear and the puzzles were a challenge the only down side was it is very short for the amount they asked for. Would love some dlc for free.\n\nHelpful | 3\nDeveloper ResponseJun 18, 2019 at 10:16 AM\n\nFree DLC? Ask, and you shall receive! More free missions are on the way, Agent. Stay tuned.", "The_Skull_KidJun 18, 2019 at 12:49 PM\nSo good\n\nThe puzzles are challenging and super fun. Simply interacting with every day items can unlock clues or solve puzzles. Was worth it and more.\n\nHelpful | 2", "chrismkjJun 17, 2019 at 1:51 PM\nLike your own personal escape room\n\nThis is my personal favorite quest game at the moment. It is just packed with so much charm and wit youll never want to put it down\n\nHelpful | 2", "Elin69Jun 17, 2019 at 2:36 PM\n\nThis is my favorite game ever! The puzzle are fun and challenging. The only bad thing is that it's short, but still worth the money.\n\nHelpful | 2", "BiterJun 12, 2019 at 4:05 PM\nFantastic!\n\nIf you like escape games then this is for you. The game is like 6 escape rooms strung together. I beat it after many hours. I hope they design another.\n\nHelpful | 2", "shamzyJun 27, 2019 at 5:14 AM\nKeeps crashing\n\nI was trying to play today and the game kept crashing at least 5 times. It starts fine and I play for few minutes and then it freezes and crash and takes me back to my oculus home. What is happening.. could you please advise, developers?\nI am still waiting for any response for why the game keeps crashing!\nIt is the 27th today and none of the developers has bothered to give me any response.. what a customer service!\n\nHelpful | 10\nDeveloper ResponseJun 27, 2019 at 11:38 AM\n\nHi Shamzy! We are so sorry to hear that you're having trouble with the game. We really do want to help fix the problem so you can enjoy your missions. It sounds like we need a little more information so we can troubleshoot with you. Can you email gamesupport@schellgames.com? Thank you, and sorry again about the inconvenience.", "JayClintonMay 30, 2019 at 5:38 PM\nMy 2nd favorite VR game! Escape room fun\n\nIf you like escape rooms or even puzzle solving this game is for you. Great and instinctive gameplay. Perfect for those sensitive to motion sickness as well. Its stationary and can be played seated. I pray they come out with more ASAP!\n\nHelpful | 5", "letstangoJun 2, 2019 at 10:57 PM\nJust brilliant\n\nRight from the intro credits I was amazed at the sheer detail and thought that has been put into this game. For anybody that's a fan of escape the room type games, this is it-- on steroids!\n\nHelpful | 2", "ian.johnston.908132May 22, 2019 at 7:06 PM\nInteresting\n\nGood graphics and challenging puzzles definitely recommend\n\nHelpful | 11", "brand019Jun 4, 2019 at 7:54 PM\nOutstanding.\n\nEven though it's a bit on the short side, I was hooked from the intro and couldn't put the game down until I'd beaten it. Truly an outstanding testament to the potential of VR.\n\nHelpful | 2", "25westrobAug 19, 2019 at 12:58 PM\nReally good\n\nThis is an awesome game I love everything about it could you guys add more levels?\n\nHelpful | 0", "TheBearJew48Jun 9, 2019 at 5:36 PM\nABSOLUTELY LOVEEEE!!\n\nSo much fun for everyone. This game is so beautiful and entertaining to play with family and friends. For anyone first time vr i highly recommend.\n\nHelpful | 2", "galacticRebelMay 25, 2019 at 2:58 PM\n\nI havent even play the game yet\n\nHelpful | 28", "Il_GallaJun 15, 2019 at 6:58 PM\nA Must!\n\nThis is \"The VR Game\". A \"must\" in your collection, a game you will play again and again and you will let your friends play to.\nOne of the best games ever produced for Oculus.\n\nHelpful | 1", "bottlecapdaveJun 29, 2019 at 10:18 AM\n\nI enjoyed every minute of my experience. The moment the opening credits rolled taking advantage of the VR medium, I knew I was onto a winner. The only problem is I feel the price is a little steep for the length. However, they're adding a new level soon which might make the price better\n\nHelpful | 3", "9KingsJul 13, 2019 at 2:00 PM\nFun game, but it didn't last long.\n\nI thought that the game was great. Fun to play and the graphics are good. The only real drawback is that I bought it this morning, and I've beaten it four and a half hours into it. Hopefully more levels will be added with a later update.\n\nHelpful | 1", "tacomccaSep 28, 2019 at 12:00 AM\nFun to pass around\n\nNot too long of a game but we'll worth the price. I DIED A BUNCH. But I learned to smoke cigars and be a spy, so I think it was worth it.\n\nHelpful | 0", "timduruJun 29, 2019 at 9:15 AM\nExcellent game\n\nReally creative and varied missions\nA lot of fun to manipulate everything to solve the missions\n\nHelpful | 1", "FrizzylizzyJul 31, 2019 at 11:51 AM\ngot past the hovering!\n\noh boy, this is going to be fun! I'm new to gaming so big learning curve for this Harley riding grandma!\n\nHelpful | 1", "mike.lettmann.75Jun 8, 2019 at 6:32 AM\nBest Game\n\nPerfect fun. I want more please!!!\n\nHelpful | 3\nDeveloper ResponseJun 11, 2019 at 10:42 AM\n\nMore is on the way!", "Snowx32Jul 7, 2019 at 12:18 PM\n\nGreat:)\n\nHelpful | 0", "cookstar5596Jul 5, 2019 at 3:20 AM\nGreat Game\n\nThis is a great game. One of my first purchases I made when I got my quest. Maybe a bit short. Made me want more levels. More levels please..........!\n\nHelpful | 2", "spedy076233Aug 13, 2019 at 7:27 AM\nReseting\n\nI looked at the game and have it for quest but I want to reset my progress but I dont know how.\n\nHelpful | 2\nDeveloper ResponseSep 9, 2019 at 9:02 AM\n\nHello! Sorry for the late response! Right now, the best way to reset your progress is to uninstall and reinstall the game.", "LiviaLeoJul 15, 2019 at 2:11 PM\nGreat game!\n\nI love the idea of this game, its very enjoyable however there is room for improvement on the last two levels.\nI hope there are more coming which would change my opinion.\n\nHelpful | 0", "mrpjbJun 4, 2019 at 6:36 PM\nEncapsulating and mind bending\n\nTruly immersive and well thought out. Design is stunning and gets your brain cells working!\n\nHelpful | 2", "L.E.D.BLUEJun 9, 2019 at 12:08 PM\nCross-buy\n\nThank You\n\nHelpful | 4\nDeveloper ResponseJun 11, 2019 at 10:42 AM\n\n:-)", "rob_CHJun 16, 2019 at 8:20 AM\nSo great, so short\n\nThis would be 5 stars, would it be 50% longer and have an end sequence. Apart from that, great introduction and tutorial plus very funny and clever riddles. This is so good, we want more...\n\nHelpful | 3", "IcebergJDJun 13, 2019 at 6:44 PM\nGood game is good\n\nSmart, charming, cleanly executed.\n\nHelpful | 1", "tuismJul 15, 2019 at 10:53 AM\nReally fun brain teaser\n\nThe writing is pretty good, the puzzles are pretty good, only complaint would be the length. But it's still all pretty good. Enjoyed and thumbed!\n\nHelpful | 0", "Fenix337May 30, 2019 at 2:31 PM\nGreat Game and Experience\n\nMy favorite VR experience so far. Definitely wish it was longer, but love the detail and creative problem solving thats necessary.\n\nHelpful | 1", "ToxicityJun 8, 2019 at 10:19 PM\nEither Finickey, or Broken.\n\nThe game is pretty simple until the third level, at which point the game's flaws don't just come to light, they steal the spotlight and dance off with your expectations. The third level is outright broken, and features fun elements such as literally just waiting to solve certain puzzles, and broken buttons that don't respond when you click them, despite being critical to solving the puzzle, and time sensitive. I have tried multiple solutions, and despite there being hidden directions in the level, following them does nothing, and one certain other puzzle doesn't seem to work about 30% of the time, killing you and forcing you to restart. This would normally be fine, but other puzzles in the level force you to wait, which makes it very irritating. Avoid at all costs, not worth $10, let alone $25.\n\nHelpful | 5\nDeveloper ResponseJun 11, 2019 at 10:42 AM\n\nHi Toxicity- We are so sorry to hear about the issues you are having with the game. We want to help. Please email gamesupport@schellgames.com so we can troubleshoot the issues with you.", "BigelowedJun 2, 2019 at 1:49 PM\nA perfect port\n\nCould hardly believe I wasn't playing the PC version!\n\nHelpful | 3", "andyphillips99Jul 7, 2019 at 10:44 AM\nFun\n\nEntertaining :-)\n\nHelpful | 3", "BlazkoJul 18, 2019 at 5:37 AM\nruckelt auf der Quest\n\nleider ist das tracking durch sehr hufige Ruckler in der Quest Version sehr schlecht. Fr mich daher ungeniessbar. 25 aus dem Fenster geworfen!\n\nHelpful | 1\nDeveloper ResponseAug 15, 2019 at 1:29 PM\n\nHi Blazko! We're are so sorry to hear about the tracking issues you're experiencing on the Quest. Please email gamesupport@schellgames.com and we'll try to figure out what is going on.", "MBrandoJul 8, 2019 at 12:04 AM\nWAY Overpriced For What You Get\n\nDont bother with this one.\n\nHelpful | 5"]