{"App Title": "Immersed", "App description": "Immersed is your new virtual office!\n\nFree app to get your Mac/PC/Linux screens in VR (including additional virtual screens with no extra hardware) in stunning virtual worlds!\nImmersed Desktop is great for solo work with 2 virtual screens in a virtual coffee shop, or upgrade to Immersed Elite to collaborate with your team around even more screens and whiteboards!\nFree 14-day trial of Elite included with every download!\n\nimmersedVR.com\n\n FOCUS on your work with MASSIVE virtual screens in a distraction-free workspace in stunning virtual worlds!\n COWORK with people all around the world in a virtual coffee shop! \n COLLABORATE with your team by multi-screen sharing or whiteboarding as if you were in person!\n\nNOTE: For best quality/latency, use WiFi Direct: immersedVR.com/wifi-direct", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Touch (as Gamepad)Supports Oculus TouchInternet connection required for downloadable contents", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Touch (as Gamepad), Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Productivity, Social, Utility", "Languages": "English", "Version + Release Notes": "1.6.18", "Developer": "Immersed Inc.", "Publisher": "Immersed Inc.", "Website": "https://immersedVR.com/", "Release Date": "July 23, 2020", "Developer Privacy Policy": "DOWNLOAD FOR FREE\nHOME\nFEATURES\nPRICING\nCOMPANY\nFAQ\nPrivacy Policy\nLast Updated: May 15, 2020\n\nThis privacy policy (Policy) describes how Immersed Inc. and its related companies (Company) collect, use and share personal information of consumer users of this website, https://immersedvr.com (the Site). This Policy also appliesto any of our other websites that post this Policy. This Policy does not apply to websites that post different statements.\n\nWHAT WE DO NOT COLLECT\n\nScreen Content. We will not record your screens nor push any screen content to our servers. All of your screen content is 256-bit encrypted end-to-end and only visible to you and the peers you allow (direct peer-to-peer screen-sharing) on the local networks for the devices you first give permission to.\n\nAudio Content. We will not record any audio coming from your computer/headset nor push any audio content to our servers. All of your audio content is 256-bit encrypted end-to-end and only audible to you and the peers you allow (direct peer-to-peer conversations) on the local networks for the devices you first give permission to.\n\nWHAT WE COLLECT\n\nWe get information about you in a range of ways. Information You Give Us. We collect your username as well as other information you directly give us on our Site and desktop Agent. Information We Get From Others. We may get information about you from other sources. We may add this to information we get from this Site.Information Automatically Collected. We automatically log information about you and your computer. For example, when visiting our Site, we log your computer operating system type, how long you spent on a page, access times, Computer hardware specifications and information about your use of and actions on our Site.\n\nCookies. We may log information using \"cookies.\" Cookies are small data files stored on your hard drive by a website. We may use both session Cookies (which expire once you close your web browser) and persistent Cookies (which stay on your computer until you delete them) to provide you with a more personal and interactive experience on our Site. This type of information is collected to make the Site more useful to you and to tailor the experience with us to meet your special interests and needs.\n\nNOTE: We will never sell your data. Our business model is on our pricing page.\n\nUSE OF PERSONAL INFORMATION\n\nWe use your personal information as follows:\n\n* Operate, maintain, and improve our sites, products, and services.\n\n* Create, manage, and authenticate your account.\n\n* Conduct internal research and development.\n\n* Respond to customer service requests.\n\n* Debug our services.\n\n* Complete the transactions you request and perform our contractual obligations.\n\n* Send you technical notices, updates, security alerts, invoices and other support and administrative messages.\n\n* Communicate with you about products, services, offers, promotions, and events, and provide other news and information we think will be of interest to you (for information about how to opt out of these communications, see INFORMATION CHOICES AND CHANGES below).\n\n* Monitor and analyze trends, usage, and activities in connection with our services.\n\n* Protect the rights and property of Immersed, customers, and others and comply with our legal obligations and to enforce our agreements, policies, and terms of use.\n\nWe may use each of the categories of personal information we collect for all of the uses described above.\n\nSHARING OF PERSONAL INFORMATION\n\nWe may share personal information as follows:\n\n* We may share personal information with your consent. For example, you may let us share personal information with others for their own marketing uses. Those uses will be subject to their privacy policies.\n\n* We may share personal information when we do a business deal, or negotiate a business deal, involving the sale or transfer of all or a part of our business or assets. These deals can include any merger, financing, acquisition, or bankruptcy transaction or proceeding.\n\n* We may share personal information for legal, protection, and safety purposes.\n\n* We may share information to comply with laws.\n\n* We may share information to respond to lawful requests and legal processes.\n\n* We may share information to protect the rights and property of Immersed Inc., our agents, customers, and others. This includes enforcing our agreements, policies, and terms of use.\n\n* We may share information with those who need it to do work for us.\n\nWe may also share aggregated and/or anonymized data with others for their own uses.\n\nINFORMATION CHOICES AND CHANGES\n\nOur marketing emails tell you how to opt-out. If you opt out, we may still send you non-marketing emails. Non-marketing emails include emails about your accounts and our business dealings with you.\n\nYou may send requests about personal information to our Contact Information below. You can request to change contact choices, opt-out of our sharing with others, and update your personal information.\n\nYou can typically remove and reject cookies from our Site with your browser settings. Many browsers are set to accept cookies until you change your settings. If you remove or reject our cookies, it could affect how our Site works for you.\n\nCONTACT INFORMATION.\n\nWe welcome your comments or questions about this privacy policy. You may also contact us at our address:\n\nImmersed Inc.\nP.O. Box 40681\nAustin, TX 78704\n\nChanges to this Privacy Policy. We may change this privacy policy. If we make any changes, we will change the Last Updated date above.\n\nPRICING DOWNLOAD COMPANY FAQ\n  \n\n 2020 Immersed Inc. All rights reserved\n\nCode of Conduct Privacy Policy Terms & Conditions", "Developer Terms of Service": "DOWNLOAD FOR FREE\nHOME\nFEATURES\nPRICING\nCOMPANY\nFAQ\nTerm & Conditions\nLast Updated: May 15, 2020\n\nThe website located at https://immersedvr.com (the Site) is a copyrighted work belonging to Immersed Inc. (Company, us, our, and we). Certain features of the Site may be subject to additional guidelines, terms, or rules, which will be posted on the Site in connection with such features. All such additional terms, guidelines, and rules are incorporated by reference into these Terms.\n\n1. ACCOUNTS\n\n1.1 Account Creation. In order to use certain features of the Site, you must register for an account (Account) and provide certain information about yourself as prompted by the account registration form. You represent and warrant that: (a) all required registration information you submit is truthful and accurate; (b) you will maintain the accuracy of such information. You may delete your Account at any time, for any reason, by following the instructions on the Site. Company may suspend or terminate your Account in accordance with Section 8.\n\n1.2 Account Responsibilities. You are responsible for maintaining the confidentiality of your Account login information and are fully responsible for all activities that occur under your Account. You agree to immediately notify Company of any unauthorized use, or suspected unauthorized use of your Account or any other breach of security. Company cannot and will not be liable for any loss or damage arising from your failure to comply with the above requirements.\n\n2. ACCESS TO THE SITE\n\n2.1 License. Subject to these Terms, Company grants you a non-transferable, non-exclusive, revocable, limited license to use and access the Site solely for your own personal, noncommercial use.\n\n2.2 Certain Restrictions. The rights granted to you in these Terms are subject to the following restrictions: (a) you shall not license, sell, rent, lease, transfer, assign, distribute, host, or otherwise commercially exploit the Site, whether in whole or in part, or any content displayed on the Site; (b) you shall not modify, make derivative works of, disassemble, reverse compile or reverse engineer any part of the Site; (c) you shall not access the Site in order to build a similar or competitive website, product, or service; and (d) except as expressly stated herein, no part of the Site may be copied, reproduced, distributed, republished, downloaded, displayed, posted or transmitted in any form or by any means. Unless otherwise indicated, any future release, update, or other addition to functionality of the Site shall be subject to these Terms. All copyright and other proprietary notices on the Site (or on any content displayed on the Site) must be retained on all copies thereof.\n\n2.3 Modification. Company reserves the right, at any time, to modify, suspend, or discontinue the Site (in whole or in part) with or without notice to you. You agree that Company will not be liable to you or to any third party for any modification, suspension, or discontinuation of the Site or any part thereof.\n\n2.4 No Support or Maintenance. You acknowledge and agree that Company will have no obligation to provide you with any support or maintenance in connection with the Site.\n\n2.5 Ownership. Excluding any User Content that you may provide (defined below), you acknowledge that all the intellectual property rights, including copyrights, patents, trade marks, and trade secrets, in the Site and its content are owned by Company or Companys suppliers. Neither these Terms (nor your access to the Site) transfers to you or any third party any rights, title or interest in or to such intellectual property rights, except for the limited access rights expressly set forth in Section 2.1. Company and its suppliers reserve all rights not granted in these Terms. There are no implied licenses granted under these Terms.\n\n3. USER CONTENT\n\n3.1 User Content. User Content means any and all information and content that a user submits to, or uses with, the Site (e.g., content in the users profile or postings). You are solely responsible for your User Content. You assume all risks associated with use of your User Content, including any reliance on its accuracy, completeness or usefulness by others, or any disclosure of your User Content that personally identifies you or any third party. You hereby represent and warrant that your User Content does not violate our Acceptable Use Policy (defined in Section 3.3). You may not represent or imply to others that your User Content is in any way provided, sponsored or endorsed by Company. Because you alone are responsible for your User Content, you may expose yourself to liability if, for example, your User Content violates the Acceptable Use Policy. Company is not obligated to backup any User Content, and your User Content may be deleted at any time without prior notice. You are solely responsible for creating and maintaining your own backup copies of your User Content if you desire.\n\n3.2 License. You hereby grant (and you represent and warrant that you have the right to grant) to Company an irrevocable, nonexclusive, royalty-free and fully paid, worldwide license to reproduce, distribute, publicly display and perform, prepare derivative works of, incorporate into other works, and otherwise use and exploit your User Content, and to grant sublicenses of the foregoing rights, solely for the purposes of including your User Content in the Site. You hereby irrevocably waive (and agree to cause to be waived) any claims and assertions of moral rights or attribution with respect to your User Content.\n\n3.3 Acceptable Use Policy. The following terms constitute our Acceptable Use Policy:\n\n(a) You agree not to use the Site to collect, upload, transmit, display, or distribute any User Content (i) that violates any third-party right, including any copyright, trademark, patent, trade secret, moral right, privacy right, right of publicity, or any other intellectual property or proprietary right; (ii) that is unlawful, harassing, abusive, tortious, threatening, harmful, invasive of anothers privacy, vulgar, defamatory, false, intentionally misleading, trade libelous, pornographic, obscene, patently offensive, promotes racism, bigotry, hatred, or physical harm of any kind against any group or individual or is otherwise objectionable; (iii) that is harmful to minors in any way; or (iv) that is in violation of any law, regulation, or obligations or restrictions imposed by any third party.\n\n(b) In addition, you agree not to: (i) upload, transmit, or distribute to or through the Site any computer viruses, worms, or any software intended to damage or alter a computer system or data; (ii) send through the Site unsolicited or unauthorized advertising, promotional materials, junk mail, spam, chain letters, pyramid schemes, or any other form of duplicative or unsolicited messages, whether commercial or otherwise; (iii) use the Site to harvest, collect, gather or assemble information or data regarding other users, including e-mail addresses, without their consent; (iv) interfere with, disrupt, or create an undue burden on servers or networks connected to the Site, or violate the regulations, policies or procedures of such networks; (v) attempt to gain unauthorized access to the Site (or to other computer systems or networks connected to or used together with the Site), whether through password mining or any other means; (vi) harass or interfere with any other users use and enjoyment of the Site; or (vi) use software or automated agents or scripts to produce multiple accounts on the Site, or to generate automated searches, requests, or queries to (or to strip, scrape, or mine data from) the Site (provided, however, that we conditionally grant to the operators of public search engines revocable permission to use spiders to copy materials from the Site for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials, but not caches or archives of such materials, subject to the parameters set forth in our robots.txt file).\n\n3.4 Enforcement. We reserve the right (but have no obligation) to review any User Content, and to investigate and/or take appropriate action against you in our sole discretion if you violate the Acceptable Use Policy or any other provision of these Terms or otherwise create liability for us or any other person. Such action may include removing or modifying your User Content, terminating your Account in accordance with Section 8, and/or reporting you to law enforcement authorities.\n\n3.5 Feedback. If you provide Company with any feedback or suggestions regarding the Site (Feedback), you hereby assign to Company all rights in such Feedback and agree that Company shall have the right to use and fully exploit such Feedback and related information in any manner it deems appropriate. Company will treat any Feedback you provide to Company as non-confidential and non-proprietary. You agree that you will not submit to Company any information or ideas that you consider to be confidential or proprietary.\n\n4. INDEMNIFICATION\n\nYou agree to indemnify and hold Company (and its officers, employees, and agents) harmless, including costs and attorneys fees, from any claim or demand made by any third party due to or arising out of\n\n(a) your use of the Site\n\n(b) your violation of these Terms\n\n(c) your violation of applicable laws or regulations\n\n(d) your User Content\n\nCompany reserves the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate with our defense of these claims. You agree not to settle any matter without the prior written consent of Company. Company will use reasonable efforts to notify you of any such claim, action or proceeding upon becoming aware of it.\n\n5. THIRD-PARTY LINKS & ADS; OTHER USERS\n\n5.1 Third-Party Links & Ads. The Site may contain links to third-party websites and services, and/or display advertisements for third parties (collectively, Third-Party Links & Ads). Such Third-Party Links & Ads are not under the control of Company, and Company is not responsible for any Third-Party Links & Ads. Company provides access to these Third-Party Links & Ads only as a convenience to you, and does not review, approve, monitor, endorse, warrant, or make any representations with respect to Third-Party Links & Ads. You use all Third-Party Links & Ads at your own risk, and should apply a suitable level of caution and discretion in doing so. When you click on any of the Third-Party Links & Ads, the applicable third partys terms and policies apply, including the third partys privacy and data gathering practices. You should make whatever investigation you feel necessary or appropriate before proceeding with any transaction in connection with such Third-Party Links & Ads.\n\n5.2 Other Users. Each Site user is solely responsible for any and all of its own User Content. Because we do not control User Content, you acknowledge and agree that we are not responsible for any User Content, whether provided by you or by others. We make no guarantees regarding the accuracy, currency, suitability, or quality of any User Content. Your interactions with other Site users are solely between you and such users. You agree that Company will not be responsible for any loss or damage incurred as the result of any such interactions. If there is a dispute between you and any Site user, we are under no obligation to become involved.\n\n5.3 Release. You hereby release and forever discharge the Company (and our officers, employees, agents, successors, and assigns) from, and hereby waive and relinquish, each and every past, present and future dispute, claim, controversy, demand, right, obligation, liability, action and cause of action of every kind and nature (including personal injuries, death, and property damage), that has arisen or arises directly or indirectly out of, or that relates directly or indirectly to, the Site (including any interactions with, or act or omission of, other Site users or any Third-Party Links & Ads). IF YOU ARE A OHIO RESIDENT, YOU HEREBY WAIVE OHIO CIVIL CODE SECTION 1542 IN CONNECTION WITH THE FOREGOING, WHICH STATES: A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS OR HER FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM OR HER MUST HAVE MATERIALLY AFFECTED HIS OR HER SETTLEMENT WITH THE DEBTOR.\n\n6. DISCLAIMERS\n\nTHE SITE IS PROVIDED ON AN AS-IS AND AS AVAILABLE BASIS, AND COMPANY (AND OUR SUPPLIERS) EXPRESSLY DISCLAIM ANY AND ALL WARRANTIES AND CONDITIONS OF ANY KIND, WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING ALL WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUIET ENJOYMENT, ACCURACY, OR NON-INFRINGEMENT. WE (AND OUR SUPPLIERS) MAKE NO WARRANTY THAT THE SITE WILL MEET YOUR REQUIREMENTS, WILL BE AVAILABLE ON AN UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE BASIS, OR WILL BE ACCURATE, RELIABLE, FREE OF VIRUSES OR OTHER HARMFUL CODE, COMPLETE, LEGAL, OR SAFE. IF APPLICABLE LAW REQUIRES ANY WARRANTIES WITH RESPECT TO THE SITE, ALL SUCH WARRANTIES ARE LIMITED IN DURATION TO NINETY (90) DAYS FROM THE DATE OF FIRST USE.\n\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSION MAY NOT APPLY TO YOU. SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, SO THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\n7. LIMITATION ON LIABILITY\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL COMPANY (OR OUR SUPPLIERS) BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY LOST PROFITS, LOST DATA, COSTS OF PROCUREMENT OF SUBSTITUTE PRODUCTS, OR ANY INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL OR PUNITIVE DAMAGES ARISING FROM OR RELATING TO THESE TERMS OR YOUR USE OF, OR INABILITY TO USE, THE SITE, EVEN IF COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. ACCESS TO, AND USE OF, THE SITE IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR DEVICE OR COMPUTER SYSTEM, OR LOSS OF DATA RESULTING THEREFROM.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY DAMAGES ARISING FROM OR RELATED TO THIS AGREEMENT (FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION), WILL AT ALL TIMES BE LIMITED TO A MAXIMUM OF FIFTY US DOLLARS (U.S. $50). THE EXISTENCE OF MORE THAN ONE CLAIM WILL NOT ENLARGE THIS LIMIT. YOU AGREE THAT OUR SUPPLIERS WILL HAVE NO LIABILITY OF ANY KIND ARISING FROM OR RELATING TO THIS AGREEMENT.\n\nSOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.\n\n8. TERM AND TERMINATION\n\nSubject to this Section, these Terms will remain in full force and effect while you use the Site. We may suspend or terminate your rights to use the Site (including your Account) at any time for any reason at our sole discretion, including for any use of the Site in violation of these Terms. Upon termination of your rights under these Terms, your Account and right to access and use the Site will terminate immediately. You understand that any termination of your Account may involve deletion of your User Content associated with your Account from our live databases. Company will not have any liability whatsoever to you for any termination of your rights under these Terms, including for termination of your Account or deletion of your User Content. Even after your rights under these Terms are terminated, the following provisions of these Terms will remain in effect: Sections 2.2 through 2.5, Section 3 and Sections 4 through 10.\n\n9. COPYRIGHT POLICY.\n\nCompany respects the intellectual property of others and asks that users of our Site do the same. In connection with our Site, we have adopted and implemented a policy respecting copyright law that provides for the removal of any infringing materials and for the termination, in appropriate circumstances, of users of our online Site who are repeat infringers of intellectual property rights, including copyrights. If you believe that one of our users is, through the use of our Site, unlawfully infringing the copyright(s) in a work, and wish to have the allegedly infringing material removed, the following information in the form of a written notification (pursuant to 17 U.S.C. 512(c)) must be provided to our designated Copyright Agent:\n\n1. your physical or electronic signature\n\n2. identification of the copyrighted work(s) that you claim to have been infringed;\n\n3. identification of the material on our services that you claim is infringing and that you request us to remove\n\n4. sufficient information to permit us to locate such material\n\n5. your address, telephone number, and e-mail address;\n\n6. a statement that you have a good faith belief that use of the objectionable material is not authorized by the copyright owner, its agent, or under the law; and\n\n7. a statement that the information in the notification is accurate, and under penalty of perjury, that you are either the owner of the copyright that has allegedly been infringed or that you are authorized to act on behalf of the copyright owner.\n\nPlease note that, pursuant to 17 U.S.C. 512(f), any misrepresentation of material fact (falsities) in a written notification automatically subjects the complaining party to liability for any damages, costs and attorneys fees incurred by us in connection with the written notification and allegation of copyright infringement.\n\n10. GENERAL\n\n10.1 Changes. These Terms are subject to occasional revision, and if we make any substantial changes, we may notify you by sending you an e-mail to the last e-mail address you provided to us (if any), and/or by prominently posting notice of the changes on our Site. You are responsible for providing us with your most current e-mail address. In the event that the last e-mail address that you have provided us is not valid, or for any reason is not capable of delivering to you the notice described above, our dispatch of the e-mail containing such notice will nonetheless constitute effective notice of the changes described in the notice. Any changes to these Terms will be effective upon the earlier of thirty (30) calendar days following our dispatch of an e-mail notice to you (if applicable) or thirty (30) calendar days following our posting of notice of the changes on our Site. These changes will be effective immediately for new users of our Site. Continued use of our Site following notice of such changes shall indicate your acknowledgement of such changes and agreement to be bound by the terms and conditions of such changes.\n\n10.2 Dispute Resolution. Please read this Arbitration Agreement carefully. It is part of your contract with Company and affects your rights. It contains procedures for MANDATORY BINDING ARBITRATION AND A CLASS ACTION WAIVER.\n\n(a) Applicability of Arbitration Agreement. All claims and disputes (excluding claims for injunctive or other equitable relief as set forth below) in connection with the Terms or the use of any product or service provided by the Company that cannot be resolved informally or in small claims court shall be resolved by binding arbitration on an individual basis under the terms of this Arbitration Agreement. Unless otherwise agreed to, all arbitration proceedings shall be held in English. This Arbitration Agreement applies to you and the Company, and to any subsidiaries, affiliates, agents, employees, predecessors in interest, successors, and assigns, as well as all authorized or unauthorized users or beneficiaries of services or goods provided under the Terms.\n\n(b) Notice Requirement and Informal Dispute Resolution. Before either party may seek arbitration, the party must first send to the other party a written Notice of Dispute (Notice) describing the nature and basis of the claim or dispute, and the requested relief. A Notice to the Company should be sent to: P.O. Box 12725, Cincinnati, Ohio 45212. After the Notice is received, you and the Company may attempt to resolve the claim or dispute informally. If you and the Company do not resolve the claim or dispute within thirty (30) days after the Notice is received, either party may begin an arbitration proceeding. The amount of any settlement offer made by any party may not be disclosed to the arbitrator until after the arbitrator has determined the amount of the award, if any, to which either party is entitled.\n\n(c) Arbitration Rules. Arbitration shall be initiated through the American Arbitration Association (AAA), an established alternative dispute resolution provider (ADR Provider) that offers arbitration as set forth in this section. If AAA is not available to arbitrate, the parties shall agree to select an alternative ADR Provider. The rules of the ADR Provider shall govern all aspects of the arbitration, including but not limited to the method of initiating and/or demanding arbitration, except to the extent such rules are in conflict with the Terms. The AAA Consumer Arbitration Rules (Arbitration Rules) governing the arbitration are available online at www.adr.org or by calling the AAA at 1-800-778-7879. The arbitration shall be conducted by a single, neutral arbitrator. Any claims or disputes where the total amount of the award sought is less than Ten Thousand U.S. Dollars (US $10,000.00) may be resolved through binding non-appearance-based arbitration, at the option of the party seeking relief. For claims or disputes where the total amount of the award sought is Ten Thousand U.S. Dollars (US $10,000.00) or more, the right to a hearing will be determined by the Arbitration Rules. Any hearing will be held in a location within 100 miles of your residence, unless you reside outside of the United States, and unless the parties agree otherwise. If you reside outside of the U.S., the arbitrator shall give the parties reasonable notice of the date, time and place of any oral hearings. Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. If the arbitrator grants you an award that is greater than the last settlement offer that the Company made to you prior to the initiation of arbitration, the Company will pay you the greater of the award or $2,500.00. Each party shall bear its own costs (including attorneys fees) and disbursements arising out of the arbitration and shall pay an equal share of the fees and costs of the ADR Provider.\n\n(d) Additional Rules for Non-Appearance Based Arbitration. If non-appearance based arbitration is elected, the arbitration shall be conducted by telephone, online and/or based solely on written submissions; the specific manner shall be chosen by the party initiating the arbitration. The arbitration shall not involve any personal appearance by the parties or witnesses unless otherwise agreed by the parties.\n\n(e) Time Limits. If you or the Company pursue arbitration, the arbitration action must be initiated and/or demanded within the statute of limitations (i.e., the legal deadline for filing a claim) and within any deadline imposed under the AAA Rules for the pertinent claim.\n\n(f) Authority of Arbitrator. If arbitration is initiated, the arbitrator will decide the rights and liabilities, if any, of you and the Company, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim. The arbitrator shall have the authority to award monetary damages, and to grant any non-monetary remedy or relief available to an individual under applicable law, the AAA Rules, and the Terms. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and the Company.\n\n(g) Waiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration under this Arbitration Agreement. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in a court and are subject to very limited review by a court. In the event any litigation should arise between you and the Company in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND THE COMPANY WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge.\n\n(h) Waiver of Class or Consolidated Actions. ALL CLAIMS AND DISPUTES WITHIN THE SCOPE OF THIS ARBITRATION AGREEMENT MUST BE ARBITRATED OR LITIGATED ON AN INDIVIDUAL BASIS AND NOT ON A CLASS BASIS, AND CLAIMS OF MORE THAN ONE CUSTOMER OR USER CANNOT BE ARBITRATED OR LITIGATED JOINTLY OR CONSOLIDATED WITH THOSE OF ANY OTHER CUSTOMER OR USER.\n\n(i) Confidentiality. All aspects of the arbitration proceeding, including but not limited to the award of the arbitrator and compliance therewith, shall be strictly confidential. The parties agree to maintain confidentiality unless otherwise required by law. This paragraph shall not prevent a party from submitting to a court of law any information necessary to enforce this Agreement, to enforce an arbitration award, or to seek injunctive or equitable relief.\n\n(j) Severability. If any part or parts of this Arbitration Agreement are found under the law to be invalid or unenforceable by a court of competent jurisdiction, then such specific part or parts shall be of no force and effect and shall be severed and the remainder of the Agreement shall continue in full force and effect.\n\n(k) Right to Waive. Any or all of the rights and limitations set forth in this Arbitration Agreement may be waived by the party against whom the claim is asserted. Such waiver shall not waive or affect any other portion of this Arbitration Agreement.\n\n(l) Survival of Agreement. This Arbitration Agreement will survive the termination of your relationship with Company.\n\n(m) Small Claims Court. Notwithstanding the foregoing, either you or the Company may bring an individual action in small claims court.\n\n(n) Emergency Equitable Relief. Notwithstanding the foregoing, either party may seek emergency equitable relief before a state or federal court in order to maintain the status quo pending arbitration. A request for interim measures shall not be deemed a waiver of any other rights or obligations under this Arbitration Agreement.\n\n(o) Claims Not Subject to Arbitration. Notwithstanding the foregoing, claims of defamation, violation of the Computer Fraud and Abuse Act, and infringement or misappropriation of the other partys patent, copyright, trademark or trade secrets shall not be subject to this Arbitration Agreement.\n\n(p) Courts. In any circumstances where the foregoing Arbitration Agreement permits the parties to litigate in court, the parties hereby agree to submit to the personal jurisdiction of the courts located within Hamilton County, Ohio, for such purpose\n\n10.3 Export. The Site may be subject to U.S. export control laws and may be subject to export or import regulations in other countries. You agree not to export, reexport, or transfer, directly or indirectly, any U.S. technical data acquired from Company, or any products utilizing such data, in violation of the United States export laws or regulations.\n\n10.4 Disclosures. Company is located at the address in Section 10.8.\n\n10.5 Electronic Communications. The communications between you and Company use electronic means, whether you use the Site or send us emails, or whether Company posts notices on the Site or communicates with you via email. For contractual purposes, you (a) consent to receive communications from Company in an electronic form; and (b) agree that all terms and conditions, agreements, notices, disclosures, and other communications that Company provides to you electronically satisfy any legal requirement that such communications would satisfy if it were be in a hardcopy writing. The foregoing does not affect your non-waivable rights.\n\n10.6 Entire Terms. These Terms constitute the entire agreement between you and us regarding the use of the Site. Our failure to exercise or enforce any right or provision of these Terms shall not operate as a waiver of such right or provision. The section titles in these Terms are for convenience only and have no legal or contractual effect. The word including means including without limitation. If any provision of these Terms is, for any reason, held to be invalid or unenforceable, the other provisions of these Terms will be unimpaired and the invalid or unenforceable provision will be deemed modified so that it is valid and enforceable to the maximum extent permitted by law. Your relationship to Company is that of an independent contractor, and neither party is an agent or partner of the other. These Terms, and your rights and obligations herein, may not be assigned, subcontracted, delegated, or otherwise transferred by you without Companys prior written consent, and any attempted assignment, subcontract, delegation, or transfer in violation of the foregoing will be null and void. Company may freely assign these Terms. The terms and conditions set forth in these Terms shall be binding upon assignees.\n\n10.7 Copyright/Trademark Information. Copyright 2018 Immersed Inc. All rights reserved. All trademarks, logos and service marks (Marks) displayed on the Site are our property or the property of other third parties. You are not permitted to use these Marks without our prior written consent or the consent of such third party which may own the Marks.\n\n10.8 Contact Information:\n\nImmersed Inc.\nP.O. Box 40681\nAustin, TX 78704\n\nPRICING DOWNLOAD COMPANY FAQ\n  \n\n 2020 Immersed Inc. All rights reserved\n\nCode of Conduct Privacy Policy Terms & Conditions", "Space Required": "436.1 MB"}



["5 stars\n72%\n4 stars\n9%\n3 stars\n5%\n2 stars\n3%\n1 star\n10%", "KexcrumbJul 23 at 10:33 AM\nIt works! For both work and focus\n\nFor those who don't or can't have multiple monitors for having a bunch windows open at once. Or for those who feel like working on a multi-monitor setup is an essential to the digital lifestyle.\nThis review is for the college/university students out there who like me; belong to both categories. Some like to study at a cafe, other's at home. I like to study in immersed.\n\nImagine you're at home, looking at a blank wall... distractions in your peripheral view: dishes that need to be done, or maybe that VR headset you'd like to use to procrastinate instead.\n\nNot any more! With immersed, you're truly there, focused on what's in front of you. In space, in a black room, in a virtual caf, there's a lot of virtual environments where you can work where you want in a way you want. Want a cinema-sized secondary screen that conveniently floats above and in front of your head? Go ahead. You can even do it with friends, working or studying together apart from each other.\nDon't have a physical secondary screen? No worries, you can have up to five virtual monitors here.\n\nImmersed has been an absolute game changer for studying and focusing. I genuinely recommend this app, not only because it's cool to feel like an elite hacker with 5 windows floating in front of your face. But because in my opinion, there is no better way to zone out, focus and work/study. Especially on a laptop.\n\nHelpful | 161", "joecotelleseJul 25 at 12:47 PM\nWelcome to the future\n\nThis type of app is exactly what VR is made for. I'm completely blown away by how well I'm able to lose myself in a virtual computing environment.\n\nThe main tech works well, it streams your computer to your Quest. I'm running on a Macbook Pro, Orbi mesh network with one virtual display and am experiencing no obvious latency.\n\nWhere this app needs improvement is with it's own UI. A couple of things I'd like to see in the future:\n\n1. Hand support. I don't need to access the UI often, when I do, I'm fumbling around for my Quest controls.\n2. A better interface to setup the displays inside my environment. Moving displays around is to touchy.\n3. The ability to move around in the environment\n4. A better whiteboard. If this is truly going to be a collaborative experience, then a good whiteboard is essential.\n5. A way to blank my physical screen. If I'm sitting in a virtual environment I don't want someone looking over my shoulder.\n\n\nAll in all, this is an *essential* app if you want to use your Quest for more than games.\n\nHelpful | 34\nDeveloper Response20 days ago\n\nThanks for the thorough feedback! :) #3 is already available in the app today. Just hold down your thumbstick! We like the way you think! #4 should be done by the end of next week. #1 & #2 should be done in the next few weeks. #5 already works on most Mac models (it just turns the brightness all the way down). Let us know if #5 does not work for you. We'd love to speak with you at The Immersed Community: http://immersedVR.com/community Thanks so much! :)", "ThePaladinJul 23 at 1:16 PM\nDo your work in VR comfort\n\nThis app is amazing! With the current COVID-19 pandemic, many of us are having Zoom meetings like crazy. Well, how about not only having multiple VR screens (you can even turn some vertically!) to use in your meetings (whilst overlooking planet earth rotating outside of your beautiful VR living room window, or pick some other enticing VR environment), but also having your avatar attend the meeting in your place, with a movable VR webcam and lip-syncing (coming soon!) when you talk. It also supports viewing your multiple real monitors in VR if you like. Well, gee, this sounds great, but how much will it cost? It's free! You can't beat that!! I definitely recommend giving it a whirl, I don't think you'll regret it.\n\nHelpful | 32", "etrusco9311 days ago\nAudio in the headset, please!\n\nFirst of all, great app, the environments are really cool. It works great with my mac, it was really easy and fast to install. Easy to setup and to learn. First thing I did was to open a video expecting to listen to the audio on my headset, which sadly, didn't happen, even though I looked everywhere in the audio settings to fix it.\nSecond, my dock is hidden, and appears when you hover the mouse; however, I couldn't make the dock appear using the app. Also, I tried creating multiple desktops in my mac, but couldn't have them open simultaneously at the app.\nFinally, although it says it's free, it looks like this is a 14-day premium trial. Right now I'm not sure if I am buying the subscription, it depends on how much I end up using this, and if they fix the audio and the multiple desktops issues.\n\nEDIT: the guys at Immersed where eager to get in touch with me and address my issues, solving most of them.\n\nHelpful | 12", "preston.luber14 days ago\nTaking it to a whole new level\n\nEasy to set up and you can dive in right away! The rooms are beyond beautiful. You can get busy or just kick back and enjoy meeting others or just relaxing and enjoying the surroundings. Move over \"Virtual Desktop\"..there's a new sheriff in town! This will prove to be one of the best and most useful apps for the Quest.\n\nHelpful | 12", "austin.zwickelJul 24 at 3:12 PM\nAwesome!\n\nThis kind of application is the way of the future! Having multiple adjustable monitor screens in VR is fantastic! Environments are top notch as well. The only hinderance is the lack of hand tracking, it's difficult to type on your real-world keyboard since there's no representation of it in the virtual environment. Still, this app is a must-have for Quest owners!\n\nHelpful | 25", "unixnerd777Jul 6 at 7:17 PM\nAwesome\n\nSure there's other options like VirtualDesktop and ALVR, but immersed is the most polished and feature rich vr desktop app I've seen. Having MacOS support is amazing too - I use MacOS at work so this is the only option and it's seamless. The discord channel is very active and responsive too, which is icing on the cake.\n\nHelpful | 56", "tiantianisfox15 days ago\nHelp me focused\n\nEver since purchase the quest, I get distracted all the time by the nice games and experiences here. Immersed allows me to still use my quest, but also allows me to work at the same time. Also I feel more focused and comfortable just lying down and use my wireless keyboard to write my thesis. It's pretty good experience.\n\nThe app still has some bugs etc but the discord has many people who are willing to help.\n\nHelpful | 11", "Jadranko.K-KJul 28 at 9:56 AM\nTo date my only suitable Virtual Desktop\n\nThis is the only virtual desktop app for Oculus Quest that suports Linux as of today. It works flawlessly and it is actively supported and evolving as we speak. I haven't tested its multiuser features but I quite enjoy jumping into this app from time to time to work from a quiet isolated environment. I'm looking forward to trying the webcam/keyboard features once they become available in Linux and I wouldn't mind having a better whiteboard but still overall this is a great app.\n\nHelpful | 19", "nastyjmanJul 10 at 12:57 PM\nWorking from home? Work in VR instead!\n\nWorking from home isn't fun. You're distracted with the stuff on your desk, you're distracted with the people coming in and out of your office, which was previously the dining room/living room/kitchen months and months ago. With Immersed, you're stepping in your virtual office. You have your screen up, and you can add more if one is not enough (it's never enough). The reason why Immersed works is that you're zoned out. The distracting environment you were in seconds ago just melts away, so you attain \"flow state\" easily. You can compile your reports inside a virtual chalet; you can write your novel with a fireplace near you; you can code while overlooking planet Earth.\n\nSo instead of working from home, choose to work from VR. Home is sacred ground, and work should stay in the office. With Immersed, you can isolate that office to a virtual space (or outer space if that's more your motif).\n\nHelpful | 43", "YoshoLAJul 30 at 1:13 AM\nLove being immersed in MindNode\n\nI love this app. This is exactly what I was looking for. I love being able to immerse myself in whatever I am working on, on my MacBook Pro, but in a VR environment! It's perfect for apps like MindNode, where I like to get \"lost\" in my mindmaps. It helps me to think more clearly and make better connections when I am only focused or shall I say \"immersed\" in this world. Love it!\n\nHelpful | 17", "StlewisJul 27 at 12:24 PM\nThis is Too Cool\n\nI'm updating my review to incorporate feedback from a full day working inside Immersed. I'm a programmer, which means that my entire day is basically spent staring at computer screens, or otherwise at the four walls around me while I'm thinking. Immersed is a total upgrade for both experiences. Instead of the boring, white walls of my office, I can look out the windows of a spaceship as I orbit earth...Instead of my laptop and a single additional monitor, I've got 3 set up, including one arranged vertically for my code editor. This is the most comfortable working arrangement I've ever had. I'm super impressed, and when the trial ends, I will most definitely be giving these people my money :-)\n\nHelpful | 19", "bccarrJul 28 at 9:05 AM\nSimply Amazing\n\nI was counting down the minutes until this released and was not disappointed, this is a god send for development teams and a serious productivity booster. Setting up is easy, using is easier. Great job to the development teams, the only thing I would like is the ability to load your own 360 degree photos. Other than that, fantastic job.\n\nHelpful | 18", "jkurikeshuJul 28 at 12:57 AM\nThis is the future!\n\nAmazed that this is possible. Being able to have 3+ virtual screens and work in different virtual environments with others is incredible! Blown away, this is just the beginning, and its such a great start. The team is very responsive on Discord which helps if you face any issues. Looking forward to the future of Immersed!\n\nHelpful | 18", "ZippenJul 24 at 2:54 PM\nVery Good, Nice On Semi Decent Network\n\nI was testing to do VR with people in EURO countries. I have semi decent network here(IE: cable company router) and was getting 2MS latency, tried also the virtual monitor and works good to have a 3rd screen(I have 2 monitors) for Netflix. I will test the other features more by all in all this was decent, enough for me to even use just locally to code or watch TV. Nice environments etc.. Def worth a look, I have not tried gaming atc.. but the online for staff meetings with people is pretty painless for VR, A quick client download, A RESTART(prob not really required but install said, prob driver install for the virtual monitor), and simple code. This is the hardest part to connect people minus whether they have VR or not. Def worth your time. Get it .. Support more worlds, updates etc. :)\n\nHelpful | 21", "AmandrethJul 28 at 2:21 PM\nVery impressive Experience\n\nI almost never write reviews for apps, but this one is pretty awesome. When I got a VR headset, this is what I thought would be the ultimate use, and wow, this is pretty sweet. I'm sure over the coming years, things are going to progress more, and it will only be better.\n\n* Virtual desktops, It is really nice to have HUGE screens floating in front of you. It is easy to move them around and position them when you get tired. Too bad the free version is limited to a single virtual desktop, but the subscription price isn't so much that I won't consider it after the trial. Another positive thing to note is that you can adjust the overall resolution of the virtual desktop as well as it's \"physical\" size, so you can get really nice and readable displays going.\n\n* The virtual rooms are definitely a change from sitting in the same room or office all the time. Even though I work remotely anyway, this is pretty sweet.\n\n* Setup is incredibly simple and fast.\n\nI truly can't wait for the headsets to have much higher resolution displays themselves. This is certainly not a \"retina\" display like you'd get on a laptop these days, but the fact that you can resize and scale the desktop screen is awesome.\n\nHelpful | 17", "R_Steelman61Jul 23 at 5:45 PM\nGet work done in VR!\n\nImmersed makes it possible to do almost any desktop activity in VR. Want to knock out some emails from your star ship circumnavigating the globe. Sure. Take a video conference from your mountain chalet. No problem. Crank out some code from an isolated cavern away from all distractions. Yep. Or meet with some friends or co-workers in a coffee shop to whiteboard a project or have a meeting. Check! This really does set the bar for productivity in VR.\nCheck out my videos on Immersed on VR 4 Work on YouTube at https://www.youtube.com/channel/UCOPivLudusITkFvxUMzu3SA\n\nHelpful | 21", "TheProtoSmith20 days ago\nAwesome Productivity App\n\nI have no idea how this flew under my radar for so long. the product feels polished and works great! The multiple screens are a great way to augment your Mac or PC, the latency is incredibly low, and it blows me away every time. I think every quest user should have this downloaded! If you like to have ambiance while you work the social hubs are great and have a good user base that are more professional and kind than other users. 10/10. can't wait to see this app continue to grow!\n\nHelpful | 12", "visualkev21 days ago\nGreat VR work environment\n\nThe VR environments are excellent. the Immersed team is extremely responsive and helpful on their Discord channel. The #1 clincher for me, as a linux user, is they are developing an Immersed client for linux. I've been testing it and its working very well. Immersed is already my daily driver for work and play. It is exactly what I've been looking for - simple and functional with just the right amount of features. I recommend it.\n\nHelpful | 11", "RightyLoosey22 days ago\nBeneficial for multiple purposes\n\nThis application allows me to use multiple displays on a laptop with only one display, at a resolution that I choose, in my preferred orientation. Instead of using discord, I could use this application to speak with random people if I like.\n\nI do have some mild criticism, but it mostly has to do with connection.\n\nThe quality of the audio being streamed to your headset can fluctuate, with crackling and popping in some places. This is not particularly the app's fault, however, it just depends on your internet connection.\n\nThe webcam can sometimes lag, but that's a miniscule inconvenience, and not a problem at all.\n\nA complete recommendation from me. The features you receive for free are completely suitable for individual use, but if you have a large team of people working on one project, then this application becomes even more useful with the paid monthly/yearly versions.\n\nHelpful | 12", "Eliram20 days ago\nNicely done, works well with Mac & PC\n\nThis tool is really nice, works smoothly and the texts are easy to read on the quest, but it's a toy as long as the keyboard is useless. It's a \"mouse only\" experience, really.\nI'd love to see an option to place a virtual keyboard in the exact same location of my REAL keyboard, so I can type. It doesn't have to look exactly like my keyboard, a few skins will do, with resize and positioning options. Also marking the mousepad would be helpful. This will let people sit in front of small laptops and work as if they have large, multiple screens.\nAlso: You can auto-detect a macbook pro, for example, place it in the virtual env, and even project the virtual screen on the virtual macbook screen, that way, using the touch pad and keyboard would be a breeze.\n\nHelpful | 10", "Valman32Jul 30 at 11:07 AM\nGreat app ...\n\nI was pleased to see that the virtual screens are clear and readable on the Quest. For some reason, in my case, the sound did not work (I played a YouTube video in Immersed but I couldn't hear the sound in the headset, even though all settings were right) , but anyways it is a great app!\n\nHelpful | 14\nDeveloper Response25 days ago\n\nWe're super glad Immersed is working well for you! :) We just released the audio feature now. Go ahead and update the VR app and the desktop agent. Speak with us at the Immersed Community if you need anything else: http://immersedVR.com/community Thank you! :)", "B0nn1eJul 23 at 10:47 AM\nFantastic for workflow and general use\n\nI use it for software development all the time. It is fantastic to be floating high above earth while coding in the space environment. There are other environments to choose from also to suit your tastes. Highly recommended\n\nHelpful | 24", "HerrAdam10 days ago\nMy dream is finally real\n\nI am a software developer and business owner. Back in the times when VR was a new thing I dreamed about application like this. But being able to work in VR back in these days was something yet unreal. I didn't follow VR news for years then totally accidentally I stumbled upon Immersed. I just looked at the website for 10 minutes, read some comments and... I just went out and bought an Oculus Quest. I gave it a try and I TOTALLY LOVE IT. I am working in it for good 5 hours straight already and I totally don't feel any dizziness or any other negative effects. Thanks to beautiful virtual rooms I feel extremely relaxed. Working is great and my focus is surreal. I don't regret my compulsive decision to buy an expensive VR set just to get this app. It was more than worth it.\n\nHelpful | 4", "websco3 days ago\nCoders inception\n\nOk. For those who spend their entire day in front of monitors, this is for you. As a programmer, stuck at home as the rest of us, the ability to go from my crowded little home office to orbiting the Earth in an empty shuttle craft is incredible.\n\nYou guys have done a fantastic job. If I may add one or two suggestions, whether taken or not still a great product, But hopefully you'll consider it.\n\n1. Add X,Y,Z coordinate values to the monitor positioning, as well as numeric size values.\nI find I spend a lot of time with my OCD trying to match the size and distance of my left monitor to my right monitor, only to find out like the left monitor better now I have to adjust the right. :-)\n\n2. In addition, a cloning or mirroring option would be just as good so that I can clone the alternate monitor to mirror the other.\n\n3. Allow for an Oculus rift version, or Oculus link, that could perhaps allow for transparency of the monitor screens.\n\n4. Optional border for the monitors.\n\n5. Options to change the levitating camera design. Perhaps a floating go cube, a small orb or something less sci-fi. (Says the guy orbiting the Earth)\n\n6. 3D object imports to allow folks to create their own environments, or include additional objects in those you've already created.\n\nThe only downside is that I find myself closing my eyes while your immersed logo zooms past my eyes. Any chance on dimming to gray as it gets closer to the eyes?\n\nOther than that, I can't tell you how much I love this thing. I sold a few family members on the Oculus Quest showing them beat saber, a year ago. Now my tech friends went nuts when I showed them a video of my new home office, writing code from within code.\n\nSo, thanks for that. :-)\n\nHelpful | 3", "GalaxyEntity904Jul 25 at 3:43 PM\nAmazing, just two problems\n\n1) the free option only has 1 or 2 screens, I get that they wanna make money but can you add djsit one more and make it 3? 2) make it so instead of having to open multiple displays from your computer, make it so you can open them faster directly from your quest\n\nHelpful | 14", "msitarzewskiJul 23 at 10:25 AM\nHighly recommended for VR productivity!\n\nThis product has evolved so much. If youre looking for a way to increase productivity, ImmersedVR is it. Its not a gaming add on, its genuine cross platform social productivity in VR. Highly recommend.\n\nHelpful | 24", "ZombieePeanut25 days ago\nGreat app, Great supportive Team!\n\nHad an issue on Launch day for the Quest and got immediate support from the team over on their discord.\n\nApp itself works really well and look forward to audio in the coming updates!\n\nKeep up the good work!\n\nHelpful | 15\nDeveloper Response25 days ago\n\nWe're super glad Immersed is working well for you! :) We just released the audio feature now. Go ahead and update the VR app and the desktop agent. Speak with us at the Immersed Community if you need anything else: http://immersedVR.com/community Thank you! :)", "Chop.Chop1119 days ago\nThe Best Work App\n\nI download this because it was the only app that allowed you to connect your Mac I got it work but then it broke I spoke with one of the developers and we fixed the issue and then it happened again so I contacted him again and we fixed the issue for the last time.\n\n\nSupport\n\nThe support was quick and helpful they told me everything and I learnt some things off them about my Mac so good support they were very nice.\n\n\nApp\n\nThis app is great for working or just trying it out if you dont want to use it for work it is still a good app to have because I can lay on a bed on sofa and do my work or watch something in vr.\n\n\n\n\nConnecting Pc\n\nThat was the easy bit just go to the website then go to downloads then click on the Apple logo then it will show you the rest.\n\n\n\nWifi\n\nThe wifi thing you need a good connection there is some alternatives for it but I recommend you have good wifi.\n\n\nSummary\n\nThis is the best working app.\n\nHelpful | 3", "cybergr3g2 days ago\nAmazing! Really can write code with it!\n\nHaving 3 big screens even in train or plane is impressive (one for VS Code, one for the console, one for the output in Chrome).\nYou can really develop in Immersed for sessions as long as one or two hours.\nJust miss to see my real keyboard and a better Oculus screen definition and I never go back IRL ;)\n\nHelpful | 2", "PurplemikeyJul 23 at 12:20 PM\nImprove my productivity by large margins\n\nI use immersed mostly for work, boosting my productivity and creativity. It works very well with my art programs (Adobe suite) so I can do work or simply work on personal projects.\n\nHelpful | 22", "Joeri_Mages20 days ago\nGood stuff!\n\nReally like the multiple screens and am waiting for my coworkers to join so I can try the 'multiplayer' part :-)\nMind you running multiple screens will tax your laptop, also wifi better be strong ;-)\n\nHelpful | 10", "xoniqJul 27 at 12:56 PM\nIts smooth and simple\n\nEverything I start the app, it launches both my screens side by side directly, and I can change the screen individually, so the main screen is bigger. It works really great with almost no delay.\n\nHelpful | 15", "AlphaWithLoveJul 6 at 3:07 PM\nGreat app great support\n\nFinally! Using a VR headset to see my MacBook Pro screen. Works like a charm. Had a question during setup, asked the question in their discord server and got a response in truly under 1 minute. Easily a 5 star experience\n\nHelpful | 29", "stynakcz21 days ago\nThis is the future\n\nI was waiting for this for more than 10 years. When i am in Immersed, i feel my mind is free of any distractions, and i can properly focus on what i want to do.\n\nTruly fantastic.\n\nHelpful | 10", "Cytosin3Jul 24 at 8:17 PM\nIm impressed\n\nThis is a great app, and it is an amazing experience, but there are few things that could definitely be improved.\n\n1. I had a bit of trouble getting my pc and quest to connect at first. I figured out to problem with the help of a developer on the discord(super active btw) and even though it was a problem on my end and not a bug in the software, be prepared to do some troubleshooting, and if you are not very experienced with computers, it might get frustrating.\n\n2. The agent that you install on your computer is not very polished, and (in my opinion) has a poor layout, but it works nonetheless\n\n3. From the promotional videos or the app page on the oculus app, it doesnt make it clear that you only get a 14 day trial of one of the upgraded tiers, you are downgraded to the free version, in which you can only create one virtual monitor ( in addition to your irl monitors), and you cant host private collab rooms. I will still use this app after my trial ends, but I dont think I will pay a monthly fee to upgrade. If it was a one time payment then maybe, but I hate subscription payments.\n\n\nOne thing I LOVED about this app is the virtual webcam. I can now join zooms from within vr, and the virtual webcam with stream a video of my vr world to the zoom.\n\n\nTHANK YOU to the developers who have made this amazing app, and I hope to see more features in the future :)\n\nHelpful | 2", "Whetstone_Jul 23 at 4:31 PM\nGreat\n\nIts awesome for people who need multiple moniters or screens, and I love the zoom feature. Plus its free! So if you didnt like it, it didnt cost you any money! Overall great app.\n\nHelpful | 14", "MightyQuinnJJul 28 at 11:00 PM\nThis is exactly what we need in 2020!\n\nWith social distancing becoming the new norm unfortunately, we need tools like this to bridge the gap into making social distancing not so distant!\n\nHelpful | 16", "TechembraceJul 28 at 8:49 AM\nThe future of meetings\n\nExcellent graphics easy instruction a bit tricky getting through my own security on a mac but once up and running showed real potential.\n\nHelpful | 14", "jonarodeJul 28 at 5:28 PM\nAwesome virtual desktop app\n\nLove the virtual office space that actually works. Would be extra awesome if it had hand tracking for virtual keyboard\n\nHelpful | 15\nDeveloper ResponseJul 28 at 5:40 PM\n\nHand-tracking is coming in the next month! :) Stay tuned! If you have any other questions/comments/concerns, please speak with us at the Immerse Community: http://immersedVR.com/community Thanks! :)", "starkca316 days ago\nWorks great\n\nworks great on my i5 surface laptop as long as I use direct wifi/hotspot. would like my laptop screen to turn off though to save some heat.\n\nHelpful | 7", "Av10nJul 23 at 1:51 PM\nAmazing\n\nThis product will be revolutionary as it grows. In the future I hope it gets hand-tracking and user created environments.\n\nHelpful | 17", "MinisterofDOOMJul 23 at 6:07 PM\nClunky and barely functional\n\nI was pretty excited for this. The ability to array multiple monitors in 3D space around me is very appealing. Even with the very low resolution of the Quest (relative to, say, a 27'' 4k monitor) it seemed like a great opportunity.\n\nUnfortunately, the execution is spectacularly bad.\nFirstly, responsiveness is abysmal. Mouse inputs are jerky and laggy, regardless of connectivity. Enabling the \"VR Mouse\" option doesn't change the actual mouse functionality, it just fakes a cursor to make it look smoother. But it's clear from the GUI the mouse is interacting with that the actual mouse is not doing the same things as the nice, smooth VR Mouse.\nEven typing in text fields grinds to a halt. Videos and fast moving UI elements happen in single-digit frames per second.\n\nEven if it allowed me to seamlessly, smoothly, and transparently interact with my PC and multiple monitors via VR, though, it is missing virtually every important feature I could imagine for such an application--save for the webcam, which is still extremely limited.\n\nConfiguration options are very very limited. The onscreen keyboard is atrocious and non-configurable. Honestly, what where you thinking?! Even bad Android keyboards are better than this! No punctuation on the main keyboard?! Backspace is in an arbitrary spot. There's a random blank key?! But I still have to switch to symbols mode for a period?!\n\nThere's no configuration of your Virtual Webcam \"avatar\" and it uses your Quest avatar by default. Not great for those of us who were hoping to use to enhance our virtual workspaces in professional settings while working from home.\n\nYou can't (as far as I could tell, and there's not exactly any explanation in-app) move around the virtual environments. So you're stuck where it puts you.\n\nOverall, it's massively lacking in features and configurability, it's too opaque, very clunky, and doesn't even do what it says on the box very well. Even for free, it feels like a pre-alpha concept at best.\n\nHelpful | 14\nDeveloper ResponseJul 24 at 3:10 PM\n\nThanks for your feedback. It's super odd that you've had any latency at all. Most of our users have 0.005sec of latency. To fix this, try Wifi Direct!: http://immersedvr.com/wifi-direct Thanks! :)", "FrozztasticJul 28 at 11:52 AM\nAfter Dev Response...\n\nI would give this a 5 star. Great app and fantastic communication from the dev team!\n\nHelpful | 18", "ShadowProgrammer21 days ago\nNeeds hand tracking\n\nTitle says it all. Adding hand tracking would be excellent if you have a virtual keyboard so you can actually type. Maybe add a mouse too? A virtual one that you can slide around with your hands and click like a real mouse?\n\nHowever it does run pretty well and setup is easy\n\nResponse:\nOk good! How long will that take?\n\nHelpful | 1\nDeveloper Response21 days ago\n\nResponse to the response: We are hoping to have it done by the end of this month! :)", "zarumbaJun 2 at 2:58 PM\nFor VR enthusiasts!\n\nI think everyone that is curious about is it possible to use VR in the office will found Immersed as perfect companion. I need some better support for real keyboard and mouse (Oculus Touch controllers are.just not good enough for typing long texts) and frankly hand tracking will be furious add-on\n\nHelpful | 28", "XeeXeeJul 24 at 4:16 PM\nAwensome\n\nIt does what it say. This is the best thing ever; VR Webcam, i dont have a real Webcaam so this is great\n\nHelpful | 13", "NappySlapsJul 29 at 6:13 PM\nMultiple real and virtual monitors!\n\nI don't know why Windows hasn't made this standard. Using my headless HDMI plug, I was able to put away my physical monitor and just fully utilize 3 monitors just from my work laptop! I'm finally able to get up from working from the floor on my coffee table, to an actual chair... My back thanks you. Video conference is seamless, with the \"webcam\" working for both MS teams and Skype for business. The support behind this is great, they are quick to chat via their discord, Short one star, because I would really love if Oculus would allow use of the inside out camera (so I can at least align my fingers to the keyboard and locate my physical mouse) not the fault of the developer but really holds back my experience . I believe I saw in their discord that hand tracking is in the works though. Keep up the great work.\n\nHelpful | 0", "LipnoxJul 29 at 3:54 PM\nIt's Early access now, with caring devs\n\nEffort from developers has me adjusting my review, based on the aspect of it being free to use and the promise that PC audio is coming soon and I am just assuming that feature will work and be functional.\n\nIt occurred to me maybe the space environment looks kinda cool and being able to now teleport to other spots in the room add a lot more freedom to your experience not as much as I want but more. As something that costs nothing it works and it sounds like some cool updates involving hand tracking for keyboard are in the works... if you aren't into side quest styled early access apps this one likely wont be for you but I think if the people who are making this app are putting real effort into it and even 6 months from now could be a big deal.\n\nupdates I want that haven't been directly informed are coming very soon\n- free locomotion\n- screenshots I can easily share with others and write on the same way as white board\n- better custom environments suited for smaller work areas.\n\nKeep up the great work on this project and I hope to see a lot more updates going forward.\n\nHelpful | 0", "scott.osmond.96520 days ago\nSo much development needed\n\nI fully agree with MinisterofDooms review. The developers note that his problems are related to latency issues with fixes in wifi direct are not helpful since the issues he describes are not related to wifi latency. I have the same problems as he does and I have no latency issues.\n\nHe has many good points which I wont bother repeating but Ill add a few -\n\nWhy cant I share a whiteboard?\n\nWhy wouldnt you provide function keys on the keyboard?\n\nScrolling on displays is super sensitive when scrolling down or left or right, but scrolling up is often unresponsive and requires grabbing a slider bar on the side to go back up.\n\nSelecting icons above and to the right of displays feels more like a game than a tool if the display is far away. You feel like you scored points once you finally selected the icon with the oculus controller. Those icons need to be bigger and perhaps enlarge when the screen is selected.\n\nIm using a 2019 version of MacBook Pro by the way for my monitors in case that is helpful for developers. We cant use hot corners or see hidden application bars by using mouse control within the immersed app. You MUST use the computer keyboard and mouse to do so.\n\nIt feels like the developers spent far more time working on visual work spaces rather than designing functionality within the space. There is no way I could recommend this as a meeting option to a friend or coworker. It shows promise but I say go back to the drawing board and work on it some more. A lot more!!! If your looking for a virtual meeting room that emulates the functionality of a meeting room - this is not for you. If you are looking to see multiple displays at the same time on your own while using your own computer keyboard and mouse in a regressed graphic interface less crisp than your own monitor- this current version might be something you want to try - but I only found it to be frustrating and lacking functionality even for just that purpose.\n\nHelpful | 5", "MMgamez127 days ago\n\nAt first I had some problems but the discord support was very helpful and it works very well. I recommend this application\n\nHelpful | 3", "AStonedChefJul 25 at 9:32 PM\nHas potential: Updated\n\nUpdate:\nI added another star(3 to 4 with another coming after the PC-sound update) because after using this program for the last two days I have sort of fallen in love with it. I truly thought after my first use that this program was not for me but now that I have a nice layout and messed around with my settings in Windows it really has become amazing. I personally sit in a fully black room and I have been so focused on my work. Although the environments are very cool, they are also distracting to me so I'm very happy with the black void they provide. I just finished a 36 page code test document yesterday and another 24 page document today. I'm actually shocked how much I enjoy this program.\n\nBe warned the Quest's graphics kinda suck(compared to my actual monitor) so you may need to adjust some stuff to make everything easier to read(maybe just me), but this would probably be amazing on a better headset(sorry oculus).\n\nWhat I still would like updated:\nWhen I start my day, after turning on my PC and Quest my layout is semi-reset. What I mean by that is that I have to reopen virtual desktops and although they are in generally the right spot, the ones that should be in portrait mode are not. This wouldnt be that big of a deal, but(and maybe it is just me) I have a hard time deciphering which monitor is which when adjusting as the numbers on the monitors are off from the ones I see in the pc app dropdown menu. This is a minor gripe because after I get it going it is set for the day and works beautifully even if I disconnect and reconnect to my pc.\n\n\nOriginal:\nThis program has some serious potential, but is not quite what I expected.\n\nIf you are looking for a quite room to work in then this is for you and you will love it. If you are like me and like to work to music or enjoy background sounds but wanted to get away from visual distractions with resizable and moveable screens than this won't quite hit those goals. There is unfortunately no passthrough sound from the pc. You can get around this by using headphones connected through the pc though so you're not completely out of luck.\n\nThis app also doesnt utilize hand tracking, so it's best to setup your layout first then put the controllers down and get to work.\n\nDownloading/installing and connecting were a breeze. I personally had to adjust my firewall settings but no big deal.\n\nThe free version allows 1 virtually monitor. For $14.99/mo you can have 5 virtual monitors. If you are planning on going the paid version, I would suggest paying for the full year($119.99) as going monthly will cost you about $180 a year(almost the price of the two usb connected monitors that I purchased off amazon).\n\nHelpful | 1\nDeveloper ResponseJul 26 at 7:19 PM\n\nThanks so much for your updated feedback! We're excited to release passthrough sound for PC in the next week or so! :) If you need any other help, we'd love to speak with you at the Immersed Community: http://immersedVR.com/community Thanks! :)", "BlackHawk013110 days ago\nAmazing app!\n\nJust try this app out for yourself!\n\nHelpful | 7", "AbbaYoshMay 19 at 3:22 AM\nActive support via discord\n\nI'm in the same boat most of the 5 star reviews have been. Found myself nodding along with what they had to say. I heard truth in the lowest star reviewers as well, but my experience dramatically differed because I went to their discord channel and had near real-time support both from the actual developers and other users. Problems or difficulties were addressed quickly. I find myself on the discord channel conversations just to stay informed on solutions to problems others are having even though things are working for me. I've learned a great tip on having multiple monitors that makes the artifact/quality issue non-existent which is to keep your monitor quality in a low setting zoomed out far away but then expanded to be the size you want. I have like a 200foot monitor held at an appropriate distance away so it feels more like a 32in wrap around monitor. Putting two of these together plus a third vertical monitor for coding that I overlay in between them has been a dream! One monitor is for work related tasks and tools, the other for my testing and browsing and research and I keep the vertical for coding. Love it!\n\nHelpful | 31\nDeveloper ResponseMay 19 at 7:32 PM\n\nWe're glad you didn't give up on us and wanted to work through the process of optimizing your setup! :) Glad Immersed is working well for you now! We'd love for you to share with us on Discord about which particular steps really helped your setup.", "Sky-DancerMay 27 at 10:15 AM\nAmazing\n\nThe functionality is great (and getting better) and the discord community is responsive and insightful.\n\nMy setup completed smoothly and I now have two physical (headless) displays running on my Mac. I may try the virtual monitors later, but I like my current arrangement as is.\n\nI love the environments they have and the ambient noises are a great touch.\n\nMy only complaint is that I'm getting a bit of eye strain, but that's probably an issue with the way I'm wearing my headset and not with their program.\n\nWhile I think this is a viable product as it is, I'm excited to see where it goes as the development team continues to expand its potential.\n\nHelpful | 20", "kiingju10179 days ago\nNice\n\neven though its an app fpr productivity, its a great and immersive app for hanging with friends.\n\nHelpful | 3", "TrumboneXXL8 hours ago\nPerfect for work from home dads\n\nMy productivity has definitely increased. I've been working from home with multiple monitors for years and this makes it so much better to work from bed. Thank you!\n\nHelpful | 1", "CLNMJun 6 at 2:40 PM\nAwesome app!\n\nThis app is really great if you not only want to play in VR but also work! Its really awesome how reactive and instantanious the monitors feel. And even though everything is obviously not as sharp as in real live, its really enough.\n\nHelpful | 19", "ansonortJul 26 at 2:14 AM\nAt last - something for Mac users\n\nThis is a very nice, easy-to-set-up application that allows you to view your PC (and Mac!!!) in VR in a number of well-rendered environments.\n\nUsing the keyboard provided is a little remedial but VR still has its challenges. The ability to resize screens and change from curved to flat is smooth and very useful.\n\nIm just really happy to have something in VR that can be used by Mac users like me. Most other apps of this kind (like Bigscreen) are useless for us minority Macfans.\n\nSo overall, great. And I dare say I shall be using this a lot while Im working from home.\n\nHelpful | 1", "AcidDrop_DanHazzardJul 24 at 12:36 AM\nOption to use cable connection?Missing\n\nI was expecting to use my mouse and keyboard while having multiple screens using a cable connection...\nThe oculus controllers sometimes can be used to click on the screens, most of the times not.\nI was expecting to be able to go to some friend room and use my mouse and keyboard on his screen to help him correct some code or edit some video on his pc etc...\n\nDefinitely not worth the money after the free trial(for me)\n\nOh and i don't find any way to add multiple virtual screens, maybe I'm just blind, I'm sure there is a way but is not user-friendly at all.\n\nThe whiteboard... Tr*sh, at small size at least, you can find a better one on sidequest made by some kid\n\nHelpful | 4\nDeveloper ResponseJul 24 at 1:32 PM\n\nOculus doesn't allow cable connections. :) Remote control of a friend's screen is in development now. To add multiple screens, follow the steps here: http://immersedvr.com/multiple-monitors Thanks!", "trevorottsMay 23 at 6:10 PM\nThe support is ridiculously good\n\nSo do they have bugs yes but the upside of this app is clearly huge. Their update pace is rapid. Now listen as soon as you install join the discord. They have round the clock wizards to help you not to mention this program works on a Mac plus its a wireless solution with no latency issues .\n\nHelpful | 19", "mista009Jul 25 at 8:19 AM\nGreat app\n\nLove it!\n\nHelpful | 14", "KonradGamerTV15 days ago\nFun\n\nepic chill game I love it\n\nHelpful | 7", "iambenslaterMay 19 at 8:44 PM\nThe strength of Immersed is in its...\n\n...ability to change deeply ingrained work habits. There are many reasons to push back against working in a VR environment, but after a few short hours of adaption you will simply find yourself wanting to escape into working in VR.\n\nImmersed shows us a glimpse of the work environment of the future, and I can only imagine that as the hardware adapts, so will Immersed.\n\nHelpful | 20", "ariel.abramov.46A day ago\nLots of lag\n\nI like it in the beginning but after recent updates it starts to lag and lots of latency ... cant even watch video on Netflix its very choppy ... I have newest iMac and 5ghz high speed internet so shouldnt be a problem on my side ... please fix it so I can give that app all 5 stars back ...\n\nHelpful | 0", "RobsatoJul 26 at 2:43 PM\n\nUpdated review, had to remove the original one for more space to type.\nI decided to give it a bit more time and see if my experience would improve.\n\nI still really like to be in another environment, but most of the downsides still stand. I am not being productive and the frustration level is high. BTW I really love that there is a free trail!\n\nMain frustration sources for me:\n\nSetup is clumsy. E.g. the need for using the controller, try a setting, back to controller, etc... Maybe handtracking could improve on this?\n\nI find it hard to get the text is readable and the (virtual) screen not too big to avoid needing to rotate my head a lot. I guess this is due to the Quest resolution.\n\nGetting nice screen layout is hard. I don't want to put the screens to high to avoid neck strain, but lowering the screen makes it impossible to put the second screen next to it (seamless) without intersecting the main screen (because of tilting) which requires more left right movement from the head.\n\nI don't feel I have a suitable setup after spending quite some time tweaking.\n\nI find it hard to place my hands correctly on the keyboard all the time. The letters are ok to find, but special signs or doing shortcut key combos is hard. The mistakes I make all the time due to this really frustrate me. In contrast finding the mouse back was pretty easy.\n\n@developer, maybe show an actual workplace in the intro video so I was not steered the wrong way in assuming that people used the controllers to work.\n\nNext to these main points there are some other annoyances:\n* No PC audio so need to be able to hear environment (I like music, but not cars passing by), less immersion.\n* Interaction with environment requires to take off the headset (e.g. drinking).\n* Headset gets heavy, more annoying as when gaming.\n\nTL:DR; good idea, not working for me\n\nHelpful | 3\nDeveloper ResponseJul 26 at 7:28 PM\n\nThanks for the feedback! :) Audio passthrough for PC will be released in the next week or so. We will also be releasing hand-tracking in the next 1-2 months, so stay tuned! Most of the other issues are beyond the scope of Immersed, but if there's any other way we could help, we'd love to speak with you at The Immersed Community: http://immersedVR.com/community Thanks so much! :)", "Capital_IJun 30 at 7:15 AM\nWow this just works\n\nThis is so easy to configure and use. Holy cow what a joy to have.\n\nHelpful | 20", "Pr0YTJul 24 at 1:59 AM\nepic\n\neeeee\n\nHelpful | 13", "mark.dhasMay 11 at 10:56 AM\nThe BEST productivity app\n\nThis is hands down the very best productivity app that you can invest some money in. The ability to immediately render multiple \"monitors\" in VR space is awesome plus the ability to work in the clouds or at a coffee shop only adds to the experience. If you're a developer run, don't walk, run out there and buy this app. Or better yet just click on it.\n\nHelpful | 22\nDeveloper ResponseMay 19 at 7:30 PM\n\nThanks so much for the kind words! We're so glad you're enjoying Immersed! :)", "Joe-007Jul 26 at 9:03 AM\nKeep failed connection\n\nI am not able to connect my pc with immerse even when used direct Wifi option. There is plenty support given from discord community but the set up is really not beginner friendly. Plus there are still things to work on including audio bypassing and simple login. Will be coming back when the login can be simplified and more easy use of keyboard etc. As for now, because I cant use it. 1 star is given. By the way, dont change your username which will also affect the connection.\n\nHelpful | 3\nDeveloper ResponseJul 26 at 7:25 PM\n\nThis seems to be a different username from the one we recall we spoke with on Discord, so that could definitely be the issue. We'd love to help get to the bottom of this, as we have thousands of users every day connect with no issue. If you'd be willing, we'd love to offer you a free month of Immersed Elite if you let us work through this more thoroughly with you and get you connected as soon as possible! We'd love to speak with you again at the Immersed Community: http://immersedVR.com/community ! Thanks so much! :)", "Statesmen1013 hours ago\nAwesome product\n\nYou definitely immerse yourself for hours using this product. I find myself staying focused and engaged then in my normal work setting.\n\nHelpful | 1", "JaymifyJul 23 at 4:08 PM\nHas potential\n\nImagine sitting in a virtual cafe with your laptop in front of you with a broken keyboard. That's pretty much what this is.\n\nPros:\nSetting it up with the laptop was surprisingly easy. It synced with the laptop very well.\n\nI love the public rooms, in particular the coffee shop. I love the quiet jazz music playing in the background and seeing others giving it life.\n\nI appreciate the diversity of different private rooms - my favourite being the chalet. Would be nice to see more added.\n\nCons:\nThe keyboard in VR in general is tedious to use. It should include autocorrect to speed things up. You have to go into settings to open keyboard. Also there is a huge problem with getting the keyboard to actually type into the monitor (ie. Google search).\n\nWhen entering in the public room, multiple times I found myself spawn randomly outside a chair with no obvious way of moving to a chair. Sometimes people would spawn in that chair right in front of me!\n\nI had no idea how to set up virtual monitors despite going over all the settings. This should be made more obvious to newbies.\n\nI love the concept and appreciate that this has potential but for now I'll be sticking to my real life laptop to do my dissertation until you improve the keyboard and add better features.\n\nHelpful | 3\nDeveloper ResponseJul 24 at 4:28 PM\n\nThanks for the feedback! We're actively working on a solution to help with typing in VR! :) Also, we're deploying a fix for the seat-collision issue. Try it again tomorrow, and hopefully, it should be good to go! If you need any other support, please reach out to us at the Immersed Community: http://immersedvr.com/community Thanks! :)", "yuripower8500May 2 at 10:44 PM\nProductivity multiplier!!\n\nI tried immersed in the Oculus Go, and was very impressed. So ended up buying a Quest as a result. After my 1.5 week work in VR trial I can definitively say that this is the future. Having 3 large monitors in front of me while being in a relaxed position has completely cured my chronic neck pain and being able to look at the monitors in the distance (instead of a few ft away) has made my eyes feel much better. Im not out of shape, I exercise regularly, but the neck pain is there because I primarily write code on my laptop looking down at it.\n\nThe latency is non-existent in direct WiFi mode. 2ms is probably the lowest reading you can get and thats where Im at. There is NO LAG and it is completely wireless on a 18 MacBook Pro.\n\nIve taken a few Teams calls while in VR and seeing the participants on one monitor, sharing another monitor, and working / referencing the 3rd monitor has made my calls a lot more productive. Ive thrown together architecture docs in real time while in VR and shared those with clients.\n\nIve spent about 1.5 weeks working in Immersed for 8 hrs a day, and going back to just using my laptop or some stationary monitors fixed in an awkward permanent position feels like going back in time. This is the perfect multi-monitor solution, and a panacea for the loud distracting open office culture of the present day\n\nOh and one last thing. Like all things should, this software JUST WORKS. Fire up the app and youre connected and ready to work. Take your headset off, pause, engage passthrough - when you open it back up its there ready to roll. The Immersed dev team has introduced more new features in just the last 1.5 weeks that Ive been using it than most apps do in a lifetime. The discord community is very active too, and you can speak directly to the creators. I would not be surprised if Immersed gets scooped up by Facebook in the not so distant future and this becomes the killer reason to own a VR headset\n\nHelpful | 28\nDeveloper ResponseMay 19 at 7:29 PM\n\nSo glad that Immersed is working really well for you! :) We're going to continue to work hard to make the experience even better!", "vijilkiwi21 days ago\nGreat but missing features\n\nThe main one is that I'd like to be able to use this while away from my PC, however the lack of mic input for zoom etc. makes this tricky. The other one is the whole thing with mouse and keyboard, I'd really like to be able to connect a BT mouse and KB while working remotely since using the controller is rubbish. Am I missing something here?\n\nThe other big one is hand tracking. If I'm using a mouse and keyboard it's a pain to find the controller so I can do whatever else with the interface. It would be sweet if hand tracking were supported so that things like moving monitors and using the menu would have less friction.\n\nAt present the app is nice - much simpler and better interface than, say, Spatial, but missing some core features.\n\nHelpful | 1\nDeveloper Response21 days ago\n\nThese are already on the roadmap. :) Thanks for the feedback! If we can help with anything else, please speak with us at The Immersed Community: http://immersedvr.com/community Thanks! :)", "CylobJun 28 at 1:29 PM\nWorks great in my mac\n\nWorked very easily and had no problems. Really worth it\n\nHelpful | 18", "uriuletJul 29 at 5:12 PM\nMassively disappointing\n\nWhat a shame. I had big expectations on this, kind of Virtual Desktop VR but with improved features... Well, the dream lasted exactly 5 minutes:\nAfter connecting the app with my tablet, the system was pretty much useless. The mouse pointer keeps going everywhere when trying to surf through different windows, I opened one of the rooms and all of a sudden everything slowed down up to an inoperative point (plus someone else's avatar was literally on top of mine, blocking my screen). First reboot.\nThen I tried to watch a tv episode from the tablet. Nothing too fancy, 540p resolution to make things smooth and easy. Again, screen stattering and everything frozen. Second and last reboot.\nI went back to the main room and tried to play around a bit... warning coming up: \"Your free version will last 13 days, click here to upgrade to Elite\".\nWhat!? All I've seen is trouble for 5 minutes, and they are already asking me to pay? You lost me there.\nIt still looks promising, and the promised features seem awesome... but there's so so so so much work to do... Plus not a good idea asking already for money when everything is so frustrating raw still and you have the same thing at hand's reach with Virtual Desktop. Not sure I follow you guys...\n\nHelpful | 2", "krushit12 days ago\nTerrible\n\nWas able to connect desktop to my Oculus initially but when I upgraded to the premium (paid) subscription all hell broke loose. Does not work. Now my computer freezes, even after updating the app on my laptop. The instructions to contact support only landed me on the Discord website where the options to request help were about some Nitro app and other stuff I have no clue about and that have nothing to do with my problem.\n\nHelpful | 1\nDeveloper Response12 days ago\n\nThanks for the feedback! We have thousands of other users who are not having issues with this, so try to contact us again at The Immersed Community (and ignore all the nitro messages... go straight to the chat): http://immersedvr.com/community Thanks so much! :)", "BlooperTWOJun 26 at 7:21 AM\nAmazing\n\nSuper cool to show people your vr avatar\n\nHelpful | 18", "jrvfloresMay 26 at 5:04 PM\nAwesome for productivity/collaboration\n\nWhy work at home when you can work in space? Or a nice spacious beautiful scenery! I absolutely loved this app. i wish my coworkers had an Oculus to be able to collaborate.\n\nHelpful | 19", "TritonBossMay 26 at 9:55 AM\nAmazing app, works with Mac\n\nI am able to look at multiple screens, anaylyze data faster and browse through data more efficiently. runs smootly on my macbook air 2013 and oculus quest.\n\nHelpful | 20", "MVTERRYJun 16 at 2:48 PM\nITS HYPE\n\nEnough said. It's basically everything you want it to be.\n\nHelpful | 18", "malonsomxJun 7 at 6:19 PM\nGreat for Mac\n\nVirtual /Remote Desktop for Mac. Very very stable\nNice interface. Recommended\n\nHelpful | 20", "Vress280912 days ago\nRegistration is NOT user friendly\n\nI am getting endless messages on why I can't connect, I've been investing so much to get this to work with no success (and I'm not a newbie!) tackled bigger stuff than this :-(\nEven the submit button is not working now..\n\nHelpful | 1\nDeveloper Response12 days ago\n\nThanks for the feedback! This is definitely uncommon feedback. Were sorry you werent able to connect easily! Wed love to continue speaking with you at the Immersed Community to diagnose your connection issues: http://immersedvr.com/community. Also, check out https://immersedvr.com/connecting for immediate help. Thanks so much! :)", "Darthmonker218 days ago\nNever got connected\n\nPairing code was not sent by mail. I got this screen on the oculus quest asking me to enter my email address, wich I did... Then i hit submit and waited and waited... zero result... tried with 11 emai different email accounts and services.\n\nHelpful | 1", "phil.wessonMay 21 at 7:13 AM\nGreat product!\n\nWorking remotely is never easy, but being able to cowork with this software and work without distractions has been a major help for me\n\nHelpful | 20", "GustashMay 18 at 5:24 AM\nBetter than expected\n\nThis is great for productivity. I can have 5 screens, all in 4K. It works really well for gaming too, if you have a fast enough router!\n\nHelpful | 20\nDeveloper ResponseMay 19 at 7:31 PM\n\nGlad you've found a really strong setup! We hope to continue making this an even better experience for you! :)", "PartyfreakerJul 28 at 1:38 PM\nA monthly fee for regular users?\n\nI dont understand why there is a monthly fee of 15$ for standard users. If it is a big corporation I could understand, still it is too much for only a license to access to a desktop screen.\n\nHelpful | 2\nDeveloper ResponseJul 28 at 5:39 PM\n\nThat is not correct. The standard version is actually completely FREE! It's like Virtual Desktop, but you get TWO screens at no additional cost and with no extra hardware. :) Only if they want to collaborate with others and want extra screens do power-users need to upgrade to the subscription. Let us know if you have any questions here: http://immersedVR.com/community Thanks!", "davidtshJun 5 at 4:11 PM\nAwesome\n\nI tried 9n mac and the webcam works like a charm\n\nHelpful | 19", "VRHuntApr 2 at 5:03 AM\nBrilliant\n\nI am using VR for structural geology purposes and needed to meet up with various professors in order to share info etc.\nI had downloaded Virtual Desktop, but it kept glitching, messing with the display of my computer and then crashing it! Anxiously I downloaded this, expecting the worst. However, it doesn't just work.. I think it has more to offer! It is a shame it is a bit hard to find, as opposed to Virtual Desktop which is on the Oculus store by default. This is a hidden gem!!!\n\nHelpful | 22\nDeveloper ResponseApr 16 at 8:58 PM\n\nThanks for the kind words! I'm glad this serves your needs! If you ever need any help from our team, just click the \"Help\" button in VR, and our entire team and community will make ourselves available! Thanks! :)", "udo.nink13 days ago\ncontains malware, wants udp port opened\n\nAs soon as I installed Immerse on my PC I got malware warnings and the thing adds some exe I do not want on my machine and I do not trust. Won't use.\n\nHelpful | 1\nDeveloper Response12 days ago\n\nThanks for the feedback! Our software does not contain malware or any harmful aspects that could harm your machine. Oculus also heavily vetted the security & safety of Immersed before we launched on their store as well. Wed love to continue speaking with you at the Immersed Community to resolve your issue! http://immersedvr.com/community Thanks so much! :)", "obscurelyfamousMay 19 at 10:02 PM\nGreat productivity multiplayer\n\nMultiple monitors in VR with the lowest latency amongst all the other options\n\nHelpful | 19", "cccrrraaaiiigggJun 10 at 10:10 PM\nvery smooth\n\nWhen it has a hand-model-driven way of typing on a virtual keyboard, overlaid on my physical keyboard, I can see using this for real work. For the moment, its just a great way of giving presentations in VR.\n\nHelpful | 0", "hdi200May 11 at 3:46 PM\nIncredible Productivity Boost\n\nThis app has hugely boosted my productivity. I wholeheartedly recommend it!\n\nHelpful | 19\nDeveloper ResponseMay 19 at 7:30 PM\n\nGrateful to have you on board with us and active in the Discord channel! :) Glad Immersed is working well for you!", "sevvvMay 20 at 12:22 PM\n\nFree and perfectly working\n\nHelpful | 18", "FisherPaykel015 days ago\nIt Works with Microsoft Teams\n\nHaving tried multiple VR experiences, I was greatly impressed at just how easy this was to setup and get running. Very seamless!\n\nI agree with other comments on the need to allow for hand tracking as this would be ideal. I prefer to use my actual keyboard and mouse once everything's set up and knocking over my coffee as I look for my controllers is not great, but such a minor issue really.\n\nAlso agree with the comment on the whiteboard being a little useless currently, but no-one's managed this well yet IMO. I would think if hand tracking is enabled then conceivably you could hold something (a pen) and it could feel more natural.\n\nNone the less, I've given this 5 stars as 4.5 isn't an option.\n\nHelpful | 2", "jfreak2004Jul 24 at 9:59 PM\nDoes not work\n\nI tried Immersed with 2 different computers. A Mac and a PC. The desktop agent refused to start up on both.\n\n\nEdit: I am not stupid. I was using current Operating systems. And neither computer is very old.\n\nHelpful | 1\nDeveloper ResponseJul 24 at 9:42 PM\n\nThanks for the feedback! Make sure that you're running MacOS 10.14.6+ or Windows 10 64-bit. We try our best to be as backwards-compatible as possible, but older enough hardware just can't integrate with new Oculus Quests! :) If you do have an updated system, please speak with us at the Immersed Community so we can troubleshoot this with you and get it working: http://immersedVR.com/community Thanks so much! :)", "MikeyDalzellApr 11 at 12:10 PM\nExactly What Was Missing\n\nMac support. Cant thank you enough for it.\nCouple more environments, and some pretty tweaks and this will be perfect!\nAlready paying for the unlimited plan to help the developer.\n\nHelpful | 19\nDeveloper ResponseApr 16 at 8:57 PM\n\nThanks so much for the kind words! We REALLY appreciate your support!! :)", "niklas.hessApr 18 at 7:26 AM\nBest addition to my working day!!\n\nImmersed works perfectly and the team is extremely responsive. Makes working during COVID-19 a lot more fun and incredibly efficient.\n\nHelpful | 19\nDeveloper ResponseApr 27 at 6:40 PM\n\nThanks so much for your feedback! Glad you're part of this journey! :)", "suryamohan2 days ago\nSuper Cool\n\nThe virtual computing I was looking for, is this one.\n\nThe flexibility of sitting location and movable desktop/whiteboard/keyboard etc. was a great experience.\n\nPlease add picture adjusting features like colours, contrast and brightness.\n\nHelpful | 2", "Silverwarriorin9 days ago\nMy initial impressions\n\nI have yet to use this app with a computer, but standalone I dont like how there isnt free movement, as well and there being no option to use virtual hands to select stuff, as well as there being stuff to interact with, other than that I believe this app has a lot of potential\n\nHelpful | 0", "RusskiBear9 days ago\nWorks but there is one major problem\n\nImmersed works well, and does some things better than Virtual desktop, such as response times from pc to quest. However it seems to be suffering from some sort of memory leak problem, because sometimes it just randomly uses all 16 gb of DDR4 ram I've got on my pc. Please fix this\n\nHelpful | 0", "elbowedpainter512 days ago\nNo keyboard\n\nVirtual keyboard never apeared\n\nHelpful | 1\nDeveloper Response12 days ago\n\nThanks for the feedback! :) Your virtual keyboard is one click away on your Immersed Menu in VR. Just click the Keyboard icon at the bottom and youll be all set. Wed love to continue speaking with you at the Immersed Community to resolve this if youd like! http://immersedvr.com/community Thanks so much! :)", "tgfuwhimsical22 days ago\nIT SUCKS HANDS DOWN\n\nIt doesn't let me play steam VR games in VR\nDo not get this app it just takes your space up\n\nHelpful | 1\nDeveloper Response21 days ago\n\nThis isn't a video game. This is a productivity app as the description clearly states. Thanks! :)", "millssyApr 23 at 9:10 AM\nDid exactly what I wanted\n\nAfter struggling to mirror my imac to my quest this solved it in minutes.\n\nHelpful | 18\nDeveloper ResponseApr 27 at 6:40 PM\n\nGlad Immersed is working well for you! :)", "drunkennewfiemidgetApr 18 at 9:28 PM\nA good start.\n\nI'm not sure how this app has received so many rave reviews. It's just not there yet.\n\nIt's an excellent start, and I look forward to the future possibilities, but here's the way I see it:\n\nI've used it for one day.\n- it's crashed twice.\n- it's randomly lost its connection a few times\n- the windows rendered in VR are best described as \"poor\". They're tough to see, and just rife with moire artifacts, making using the app for a long period of time a difficult task.\n- it absolutely pegs the CPU of my x1 carbon.\n\nMaybe it's because I'm using the Linux version and it doesn't get the love other OSes do.\n\nI will continue to try to try it out and hope it gets better, but I suspect when my free trial is over, I'll give up, because this is certainly not at a point I'd be willing to actually pay for it.\n\nYet.\n\nEdit: plugged in my old Windows laptop to try that out; pretty much the exact same experience, which is actually a little encouraging in a weird way.\n\nEdit again: since posting my review, immersed responded. And now my review has been downgraded from 2 stars to 1. They suggest trying the newly pushed version, but their website is seven shades of useless and makes it impossible to just get a download link.\n\nThis is just app quality, nothing more, nothing less. I'm one of those morons who bought a usb wifi adapter so I could do the immersed thing via wifi direct.\n\nAnd the implication that I don't know what I'm doing with my computer \"because lots of programs can peg the cpu\" is frankly insulting. It's not difficult to type \"ps\" and see the Immersed process is what's eating the cpu time.\n\nAt this point, I see this product as a series of hacks and not a cohesive product. I might come back and try it another day, but probably not.\n\nHelpful | 15\nDeveloper ResponseApr 22 at 8:38 PM\n\nHi. I'm sorry your experience with Immersed wasn't as pleasant as it is for other users. We're in the middle of revamping our website, which should make downloading the agent much easier. Also, correct, we unfortunately just started working on the Linux agent recently and so it's nowhere near as robust as the Mac agent which has been around for a couple years. Our Linux agent is improving every week, so we encourage you to try the latest version. We'd love for you to work with us to get it working even better on your system!", "RonaldoSerranoJul 26 at 5:52 AM\nReally awesome APP! Only one complaint.\n\nI tested the app for some minutes only, to see how it works and I felt everything really good. the enviroments are super nice, and everything was pretty easy to set up. But as far I saw, there's no way to send the audio from the desktop straigh to the headset when using it on windows =( This really makes tons of difference for me. Are there plans to implement it? I could use just a bluetooth device connected to my computer, but this way I would loose all the environment audio that we have on the virtual spaces. Other then that. great APP!\n\nAlso, I could not find a way to move myself around the virtual environment, like sitting on other chairs and stuff like this. is it possible to do? Like we have on big screen, that we can teleport in new positions inside the world.\n\nHelpful | 0\nDeveloper ResponseJul 26 at 7:21 PM\n\nThanks for the feedback! Audio passthrough for PC will be coming out in the next week or so. Also, to move in the environments, click & hold down your thumbstick and aim at one of the red diamonds. If you have any other questions, we'd love to speak with you at The Immersed Community: http://immersedVR.com/community Thanks so much! :)", "GamingPortalsVR6 days ago\nWow!\n\nIf you need to use another type of computer, this is best one!\n\nHelpful | 3", "reinzneal7 days ago\nCool experience\n\nNice app to use to remotely your desktop\n\nHelpful | 3", "Lupin3000Jul 25 at 1:45 AM\nIt works perfect on MacOS\n\nI tried and I need to say it works perfect in combination with MacOS. After the email registration the link will be send to download the OS software and the 14 days trail with elite starts. I m surprised how easy it was.\n\nHelpful | 0", "NeosmoticMar 25 at 4:30 PM\nGreat tool!\n\nEasy to set up, no much latency, works great on Mac.\n\nHelpful | 19\nDeveloper ResponseApr 16 at 8:58 PM\n\nGlad it works well for you and that you're enjoying it! :)", "mrktrxJul 23 at 10:26 PM\nGood enough\n\nI went to the discord server cause I had some issues, I had to use Wi-Fi direct to make it work properly, I get some gray screen bug sometimes but after a second or 2 it goes away.\n\nHelpful | 0", "Ommmm_2486Jul 26 at 7:15 AM\nAmazing potential, need real typing\n\nThanks for the chance to try out Immersed. At my home office, plugging into the Immersed environments is a huge improvement. The adjustible/multiple screens are amazing. But until I can type comfortably from my keyboard in the environment, I cant use it for work. Controllers arent an acceptable solution. Also, I have security concerns about letting an outside party record my screen and voice. For me to trust this, I would want to get it through my employer, so I know proper security processes and reviews are in place. Also, the performance was glitchy trying out YouTube, etc., but I didnt try to adjust the settings. I look forward to seeing how Immersed develops.\n\nHelpful | 1\nDeveloper ResponseJul 26 at 7:23 PM\n\nThanks for the feedback! :) We are currently undergoing a certified security audit so that we can push it to Enterprise customers ASAP. Also, we'll be releasing a solution for hands in VR (no more controllers necessary!) in the next 1-2 months. Stay tuned! Also, to remove any glitchiness, try WiFi Direct: http://immersedVR.com/wifi-direct ! If you have any other questions, we'd love to speak with you at the Immersed Community: http://immersedVR.com/community Thank you! :)", "Sam_LowryJul 24 at 6:57 AM\nProblem with pairing work laptops\n\nWhat I tried of this looks great. Really polished etc BUT you need to download an installer to pair your laptop and it gets blocked by my company's installation policy. 46mb between me and a virtual desktop.... If only there was a way around this. Keep up the good work though guys.\n\nHelpful | 1\nDeveloper ResponseJul 24 at 1:32 PM\n\nThanks! Yea, there's no secure way to connect to a computer without some sort of way to verify authenticity. Sorry about that! We are working on VPN solutions to be released in the next 2-3 weeks! Thanks!", "SecretHippo1Jan 6 at 8:27 PM\nLoved it\n\nFirst test run with my cofounder was short, but sweet, as we learned the ins and outs selling around the Earth in a spaceship while physically in different countries!\n\nHelpful | 19\nDeveloper ResponseApr 16 at 9:00 PM\n\nVery cool! Glad it's working seamlessly for you and your team! :) Thanks!", "Jouni.RahjaJun 1 at 10:23 PM\nJoneS\n\nThis is excellent product, would like to use it more.\nBut incase you have to use VPN, this doesnt work with you.\n\nHelpful | 0\nDeveloper ResponseJun 2 at 6:49 AM\n\nHi, thanks for your feedback! I'm glad you love the product. :) This feature is actually going to be released in the next week or two.", "franciozzyNov 26 at 12:09 PM\nOne of the reasons I bought an Oculus\n\nTheres some room for improvement, but the app is excellent! Id say limited only by the hardware at this point, but they could offer more landscapes. If thats the only improvement left, you can guess how good it is.\n\nHelpful | 21\nDeveloper ResponseApr 16 at 9:01 PM\n\nThanks so much! We are now revamping the aesthetics of the entire app, including new environments! :)", "cforcalvinJan 31 at 12:50 AM\nlag, and no remote input support.\n\nI use this to do work on a macbook pro because I think its the only remote display app that works on mac.. it works if youre sitting in front of the computer youre working on to use the keyboard and mouse, and it lags consistently (the movement is choppy) on my 5g router.\n\nVirtual Desktop by contrast, is smooth and fast to the point where I constantly play pc games using it- and it also has bluetooth keyboard, mouse, and game pad support, which Immersed doesnt. I dont get it, it seems like Immersed is a startup with a team of developers? Why is it lacking remote input features and why is it so laggy?\n\nI might be mistaken but I think Virtual Desktop was made by 1 guy. How can 1 guy make something that performs way better?\n\nAnyways, you guys gotta hurry up and optimize the performance + add more features if youre gonna charge for the pro version which Im demoing right now and its not that hot. The interface is pretty amateurish too, way less polished than the competitors- it feels like a hackathon project.\n\nWhen Virtual Desktop comes out with a mac version, itll probably blow this out the water.\n\nHelpful | 1\nDeveloper ResponseMar 31 at 3:29 PM\n\nSorry to hear you've been having lag. Most of our users have less than 0.02sec latency. Feel free to try Wifi Direct: http://immersedVR.com/wifi-direct Also, Virtual Desktop has been around for 7 years. Immersed has only been available for download for 1 year. Virtual Desktop is for 1 screen and 1 user. Immersed works with 5+ screens, on Mac/PC/Linux, with 7+ collaborators. Immersed is primarily for remote collaboration, and not as much video gaming.", "jarland.donnellOct 3 at 9:43 AM\nThis is it\n\nThis is everything. This is the one that changed the whole game. Ive been dreaming of working in VR for years to improve remote life. The possibilities of immersion in my work, increased collaboration from a distance, and an elaborate desk that requires minimal space. This one app hit every point. Life changed.\n\nHelpful | 23\nDeveloper ResponseApr 16 at 9:06 PM\n\nWe're so glad that you've enjoyed Immersed so much! We're so grateful for your feedback and help! Thanks again! :)", "cvandyke1217Oct 5 at 3:09 PM\nAmazing Productivity\n\nI've been using ImmersedVR since its launch on Quest. What an amazing experience and productivity booster. It's great to have all my screens, even when I'm moving from hotel to hotel.\n\nHelpful | 21\nDeveloper ResponseApr 16 at 9:03 PM\n\nThat's so great that Immersed has brought you so much value! These success stories are what drives us to keep making Immersed better and better for users like you! Thank you! :)", "michal.matyasOct 23 at 3:53 AM\nIt just works\n\nNo issues, barely any lag, this app is amazing!\n\nHelpful | 19\nDeveloper ResponseApr 16 at 9:02 PM\n\nThank you so much! We're so glad it's working great for you! :)", "slvtrsSep 30, 2019 at 1:41 PM\nThe reason I own an Oculus\n\nNoise cancelling goggles.\nAn awesome team making constant updates to a product that has become an integral part of my daily workflow.\n\nHelpful | 21\nDeveloper ResponseApr 16 at 9:05 PM\n\nWe're so grateful that you're on this journey with us! Your feedback alone has made Immersed so much better! Thank you! :)", "eccentric_jSep 27, 2019 at 1:31 PM\n\nWorks as advertised! I saw this app a few weeks ago from their website. VR monitors has been something Ive been daydreaming about since February so I was completely blown away that it already exists. I was reasonably skeptical at first, as I wanted to know if its really a usable replacement for external monitors. Ive been using it for 4 days so far, and I Have to say I think it will work for me. However its not without some trade offs. For starters, you can only run so many virtual monitors at once. My 2017 Mac Book Air seems to handle about 3. Second, the pixel density of the Quest and Go are a bit limited in this iteration so the graphics are not as smooth and crisp as a regular monitor. For me its worth it, as I can do design work on the physical monitor when needed. The second trade off is that it is recommended to get a third party USB Wi-Fi dongle to support directly connecting your headset to a Wi-Fi signal broadcasting from your computer. That said the direct connection really does reduce input lag. Trade offs aside this is a really cool tool to use. I can view my terminal, Atom, Slack, and a couple of browser windows all within VR. This tech is not perfect yet but it is practical and very well on its way.\n\nHelpful | 1\nDeveloper ResponseApr 16 at 9:05 PM\n\nThanks so much for your support! Your feedback alone has made Immersed so much better in the past several months! Glad you're on this journey with us! :)", "xaustinxOct 12 at 10:20 AM\nWorks extremely well\n\nThe default settings can be tweaked for higher fidelity at the expense of battery life, but I recommenced doing so. Text become far clearer and crisper.\n\nNothing beats having two imax sized monitors other than have 8.\n\nHelpful | 1\nDeveloper ResponseApr 16 at 9:03 PM\n\nThanks so much for the kind words! We're so glad you're enjoying your experience in the app! :)", "ShortLukeAug 30, 2019 at 12:48 PM\nMac compatible\n\nOnly Mac compatible desktop app and a good one too\n\nHelpful | 19\nDeveloper ResponseApr 16 at 9:04 PM\n\nThank you so much! :) Glad it's working well for you!", "Godislove4uAug 19, 2019 at 3:46 PM\nThanks for this free trial\n\nJesusavesouls !\n\nHelpful | 20\nDeveloper ResponseApr 16 at 9:04 PM\n\nYou're very welcome! :)"]