{"App Title": "In Death: Unchained", "App description": "Grab your bow and rain down arrows against forsaken souls and angelic creatures that have taken over the afterlife, battle through the beautiful medieval fantasy levels of Heaven, Purgatory & Hell to restore Harmony\n\nMust-have bow & arrow action game with state of the art Quest graphics\n\n- Finally a great Roguelite on Quest, great replay value that adapts to the players skill level and progress as they play\n- Three beautiful and mysterious, procedurally generated worlds,  with infinite replayability + three epic boss fights, multiple optional areas with great loot\n- Outsmart and outplay the enemy through clever positioning and precision in tactical positioning focused gameplay\n- Unlock new enemies and magical arrows for increasingly challenging and diverse gameplay\n- Achievements and modifiers carry over to the start of your next game after you die\n- Full use of VR that makes the most of your Quest", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Fighting, Shooter", "Languages": "English", "Version + Release Notes": "1.0.11", "Developer": "Superbright", "Publisher": "Superbright", "Website": "http://superbright.org/", "Release Date": "July 23, 2020", "Developer Privacy Policy": "SUPERBRIGHT TERMS OF SERVICE AND PRIVACY POLICY\n\n1. Terms\n\nBy playing the game, you are agreeing to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using it. The materials contained in games are protected by applicable copyright and trademark law.\n\n2. Disclaimer\nThe materials in games are provided on an as is basis. SUPERBRIGHT makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.\nFurther, SUPERBRIGHT does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials in its games or otherwise relating to such materials or on any sites linked to this site.\n3. Limitations\n\nIn no event shall SUPERBRIGHT or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials in SUPERBRIGHTs games, even if SUPERBRIGHT or a SUPERBRIGHT authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n4. Accuracy of materials\n\nThe materials appearing in SUPERBRIGHTs games could include technical, typographical, or photographic errors. SUPERBRIGHT does not warrant that any of the materials in games are accurate, complete or current. SUPERBRIGHT may make changes to the materials contained in games at any time without notice. However SUPERBRIGHT does not make any commitment to update the materials.\n\n6. Modifications\n\nSUPERBRIGHTmay revise these terms of service for its games at any time without notice. By playing games you are agreeing to be bound by the then current version of these terms of service.\n\n7. Governing Law\n\nThese terms and conditions are governed by and construed in accordance with the laws of Poland and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location.\n\n8. Indemnification from harm, bodily or otherwise\n\nYou acknowledge that SUPERBRIGHT Team is not responsible directly or indirectly for any bodily or psychological harm and property damage you may experience while using its games.\n\nPRIVACY POLICY\n\nIt is SUPERBRIGHTs policy to respect your privacy regarding any information we may collect while operating our games. Accordingly, we have developed this privacy policy in order for you to understand how we collect, use, communicate, disclose and otherwise make use of personal information. We have outlined our privacy policy below.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\nWe will collect and use personal information solely for fulfilling those purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\nWe will only retain personal information for as long as necessary for the fulfilment of those purposes.\nWe will collect behaviour and gameplay information only for non-nefarious purposes\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. SUPERBRIGHT may change this privacy policy from time to time at SUPERBRIGHTs sole discretion.", "Developer Terms of Service": "SUPERBRIGHT TERMS OF SERVICE AND PRIVACY POLICY\n\n1. Terms\n\nBy playing the game, you are agreeing to be bound by these terms of service, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using it. The materials contained in games are protected by applicable copyright and trademark law.\n\n2. Disclaimer\nThe materials in games are provided on an as is basis. SUPERBRIGHT makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.\nFurther, SUPERBRIGHT does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials in its games or otherwise relating to such materials or on any sites linked to this site.\n3. Limitations\n\nIn no event shall SUPERBRIGHT or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials in SUPERBRIGHTs games, even if SUPERBRIGHT or a SUPERBRIGHT authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n4. Accuracy of materials\n\nThe materials appearing in SUPERBRIGHTs games could include technical, typographical, or photographic errors. SUPERBRIGHT does not warrant that any of the materials in games are accurate, complete or current. SUPERBRIGHT may make changes to the materials contained in games at any time without notice. However SUPERBRIGHT does not make any commitment to update the materials.\n\n6. Modifications\n\nSUPERBRIGHTmay revise these terms of service for its games at any time without notice. By playing games you are agreeing to be bound by the then current version of these terms of service.\n\n7. Governing Law\n\nThese terms and conditions are governed by and construed in accordance with the laws of Poland and you irrevocably submit to the exclusive jurisdiction of the courts in that State or location.\n\n8. Indemnification from harm, bodily or otherwise\n\nYou acknowledge that SUPERBRIGHT Team is not responsible directly or indirectly for any bodily or psychological harm and property damage you may experience while using its games.\n\nPRIVACY POLICY\n\nIt is SUPERBRIGHTs policy to respect your privacy regarding any information we may collect while operating our games. Accordingly, we have developed this privacy policy in order for you to understand how we collect, use, communicate, disclose and otherwise make use of personal information. We have outlined our privacy policy below.\n\nWe will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nBefore or at the time of collecting personal information, we will identify the purposes for which information is being collected.\nWe will collect and use personal information solely for fulfilling those purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make readily available to customers information about our policies and practices relating to the management of personal information.\nWe will only retain personal information for as long as necessary for the fulfilment of those purposes.\nWe will collect behaviour and gameplay information only for non-nefarious purposes\n\nWe are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. SUPERBRIGHT may change this privacy policy from time to time at SUPERBRIGHTs sole discretion.", "Space Required": "1.49 GB"}



["5 stars\n89%\n4 stars\n7%\n3 stars\n2%\n2 stars\n0%\n1 star\n1%", "kkuzma1982Jul 27 at 1:07 AM\nBest Quest game -played before release\n\nI was waiting for this game since I bought Quest a year ago. Exceeded my expectations. Nothing was cut out compared to PCVR version, but more things were included. Not only best looking game on Quest, but also first roguelike game with limitless replayability. Procedural levels, tons of upgrades and achievements. Superb locomotion options and gameplay mechanics. Plus free locomotion was added due to users request - developers listened to the community voice. More content to come, even with this already fully equipped version.\n\nP.S. I had chance to play before release - that is why I post this review so early.\n\nP.S. Please consider implementing the option allowing to play own custom music as it would be great way to spend time with this game listening to podcasts or custom soundtrack.\n\nHelpful | 235", "fireorfrogJul 23 at 7:36 PM\nA fantastic game\n\nI bought this game a while ago for my Vive, and it was one of my favorite games on there. I was excited to find out it was coming out for the Quest, although was worried that it may get somewhat downgraded in the translation.\n\nWell, nothing about it seems downgraded. In fact, some things seem more polished. It's a kickass game through and through - it's atmospheric, unnerving, exciting, and easy to pick up.\n\nMy problems are:\n1. There is sometimes a clipping issue with the floor - when you teleport, you are sometimes slightly lower than you really are, so you need to shoot a teleport arrow to re-orient yourself to the floor.\n2. The detection of the Oculus controller sometimes makes it that the arrow faces slightly off when pulled all the way back (although most of the time pulling all the way back is fine). When this happens, it can delay you by a crucial split second.\n\nIf those problems seem like nitpicking, that's because the game is excellent. Glad the Quest has it.\n\nHelpful | 52\nDeveloper ResponseJul 30 at 8:31 AM\n\nBtw the problem with the floor's been updated :) Along with more fixes, and there's a cool update coming out today also! Thank you for your kind words and hope to see you on the leaderboards in the ongoing Archery Contest!", "PineappleFrenchJul 27 at 8:41 PM\nMy new favorite by a mile\n\nIf I had to choose only one game to play on VR for the rest of my life, it is this one. This one has the best replayability, rewards system and everything. There is no \"experience points\", the experience comes from you and how you get better with a bow by learning and getting a feel for an arrow's arc through the air. You are rewarded for being more precise, faster, smarter, taking risks and so on. The game gets harder as you get better, and rewards are given to those who try new things. I've never daydreamed about playing a vr game as much as this one. Well worth the price, well worth your time.\n\nHelpful | 33\nDeveloper ResponseJul 28 at 7:35 AM\n\nWe love you too! This is incredibly nice to read, thank you so much for making our day!", "JCsMagicLinesJul 23 at 10:23 AM\nDownloading...\n\nIt's downloading.. so far, 5 star experience.\n\nUPDATE:\n\nIt's updating.. still 5 star experience.\n\nUPDATE:\n\nIt's beautiful. Team really worked hard on this one. Visuals are done well. Gameplay keeps the PCVR version well. It definitely is one of the games with infinite replay value.\n\nHelpful | 86", "ParadiseDecayJul 23 at 11:53 AM\nPlayed with a REAL bow!\n\nBow Impressions Video:\nhttps://www.youtube.com/watch?v=ZtAftpNH8Yk\n\nMy Initial Impressions:\nNothing beats playing VR with PROPS and other OBJECTS to ENHANCE your experience!\nOne of my favourite Rogue Like VR experience on PC is now on Quest and it's a perfect fit.\nPLUS so much more has now been added to the game, new weapons and new enemy types.\n\nHelpful | 35", "fer0nJul 26 at 4:55 AM\nBest Bow and Arrow Game\n\nHeres what I have to say about the game:\n\n# Unlocking new things\n\nIm a big fan of unlocking new skills and it didnt look like there was anything to unlock here. I was wrong. The game has achievements, but contrary to other games they are actually good for something in this one. An achievement can unlock the crossbow, the abiss (new map), new types of arrows, improve damage (headshots, fire damage, ice damage, ), but also unlock new types of enemies. So unlocking achievements both improves your abilities as well as introduce tougher enemies. So far, things are really well balanced for me. It feels like you can play forever until you unlocked everything, and youre always working towards something.\n\n\n# rogue-like\n\nIm also not the biggest fan of rogue-like games, but in this case it had the following effects for me:\nThe map changes everytime so it feels new and unexpected. Since enemies and basic building blocks stay the same, you do still get more familiar with it.\nYou can find special arrows and money while playing, but all that is gone when youre dead, so you might as well use whatever you have. Thats nice, because I often want to save the good stuff and dont dare to use it until it is really necessary. As mentioned before, the achievements remain and there are still things that can be unlocked so it doesnt feel like you have to start over every time and everything was for nothing.\nBasically, rogue-like in this game for me means endless replayability, always something new and a very variable game length (playing it for only 20min is okay, but playing for longer is fun as well).\n\n\n# Story\n\nAs far as I have played, there hasnt been a story apart from the setting. No characters, not a single word spoken so far. And I like it that way.\n\n\n# Gameplay\n\nWhen I first saw the game I thought there would be sword fighting and other things as well. There is not. Its just bow or cross bow, but that is done perfectly. The movement (shooting a special arrow), using the shild, ducking, or dodging feels very nice and sooner or later, youll feel the flow of it. Apart from the achievements, youll also simply get better at shooting. And you can turn around as much as you like since theres no cable attatched to your head! Surprise!\n\n\n# Graphics\n\nGorgeous.\n\n\n# Compared to other bow and arrow games\n\nI bought both Apex Construct and Elvin Assassin.\nCoop in Elvin Assassin was nice, but you are just too far away from the enemies and not in the game as much as here.\nApex Construct was more of an annoying puzzle game, where the shooting was not really a focus, so I returned it. To put it short: every other bow and arrow game on the quest is s**t compared to this one.\n\n\n# What could be improved\n\nCoop might be a lot of fun, but I dont expect this game to get it and its defenitly a ton of fun the way it is.\nSometimes enemies sound like theyre closer as they actually are. I read a bug fix is on the way.\n\n\n# Conclusion\n\nI love this game, and you will too if you even remotely enjoy archery. There are tons of things that can be unlocked. Rogue-like only brings good things to this game, like infinite replayability (play for only a few minutes or hours) and not letting you collect anything forever and rather just make you use it. There isnt really a story; its all about gameplay and it is perfect. The graphics are beautiful and the setting is extremely nice. While it can be a bit scary, its not as uncomfortable tense as other games are (but still tense enough). Hope this helps :)\n\nHelpful | 24", "FleshyMonkey7 days ago\nNever gets old to me\n\nThis is a really good game with immersive graphics and simple but satisfying game play. I didnt expect to enjoy a first person bow shooter very much, but I never lose interest in this game. Get yourself into an area where you can set a nice big guardian, and you can really enjoy the creeping aspects of this game. Teleport to a corner, then peek around it, recon the enemies, then lean around and shoot them, dodging back around the corner to avoid return fire. A big space also lets you retreat a step or two when youre getting meleed by some tanky crusader and you need to open the gap to take advantage of your ranged attacks. You can play in a stationary guardian, even seated if you want, but a bigger space is a lot more immersive and fun. You may even work up a sweat, feel the burn in your bow arm from holding it up for an hour straight, or scream out loud when an abomination sneaks up on you and jump scares you... Good tutorial actually teaches you everything you need to know in a short but enjoyable way.\n\nHelpful | 7", "livescan7 days ago\nBest on Quest\n\nI loved the pc version, and was my goto vr game. I thought I was downgrading my experience by buying this game on the quest, but getting wireless freedom. Well guess what? I got wireless freedom and a better game. Why? Because the graphics are great, the control is precise and with practice you become an assassin all with freedom of no wires. Iv been grinding this game and loving every minute of it. The sound is fantastic and has been very accurate letting me know where enemies are coming from.\n\nI just can't put the game down. Time Flys by while playing and before I know it its time for bed.\n\nThis is my favorite vr game, period. And the best port from PC to Quest so far. Do yourself a favor buy it, and give it a little time to get acclimated to the controls and you will be rewarded with a big smile and the craving to get back in when you put it down. Its been a long time since I loved a game this much.\n\nHelpful | 6", "terry.gold.77110 days ago\nAwesome!!!\n\nMy favorite game. So well executed and fun to play. Immersive experience and the bow is so accurate.\n\nAfter a couple weeks my appreciation for how well the developers executed this. Its very top notch immersion, mechanics, creativity and experience. They have been diligent about feedback and updates, their integrity is completely in this. Im sooo into this game, dont even want to touch another. As a life long gamer, I think this the best game experience Ive EVER had.\n\nHaving said this. Its a very hard game. Not because of any mechanics, just because of the layers and depth. The good news is that they carefully scale it so it gets harder as you get better but reward you. So this makes it interesting.\n\nUpdate: After a couple weeks Im still discovering new techniques, places, adversaries or how I deal wow them. Im surprised at how good Ive gotten with the bow. Usually Id get bored with a game but this is increasing my interest. I dreamt about it the other night... weekend is here and cant wait to dive into the other world. Cell phone OFF. Haah\n\nI hope they keep adding to this game, or sell update packs - I WILL BUY ALL OF THEM (hope youre listening SuperBright ;-)\n\nHelpful | 7", "Gamertag_VRJul 23 at 10:28 PM\nA GOOD GAME MADE GREAT ON QUEST\n\nWATCH MY GAMEPLAY BY SEARCHING GAMERTAG VR IN DEATH: UNCHAINED\n\nIn my livestream the free locomotion update was available, managed to kill 2 bosses and unlock the crossbow\n\nPlayed this game a while back on PSVR while it was under the original developers name Solfar studios. The new team have done incredible work with this port, sharp detailed graphics, extra content all the while keeping the original feeling of gameplay purity and in doing so, unchained is the best version of the game for me. They even listened to the community feedback and added free loco at launch! \n\nI do think the price is tad high but I also think the game is worth it. Lots of replayability and most players turn into leaderboard chasers after a short time.\n\nHelpful | 16", "VonDragan14 days ago\nPerfect\n\nI was one of the first ordering the Quest and until now I didnt wrote any review. For me this is the very first game on the Quest that deserves that honour. A rogue like done right in every aspect. The devs didnt try to develop a VR showcase but made a real and very replayable game that will draw you in, session after session. Well done!\n\nHelpful | 6", "robot_builder7 days ago\nA game above all the rest\n\nThis game has it all, the graphics, the excitement, the adventure, the scares, the atmosphere. This game will keep you coming back over and over and over with never disappointing you.\nP.S. To the developers of this game thank you for all the updates and bug fixes. You've outdone yourselves. I have numerous Quest games and this is the one I play every single day. I think being able to use a sword would be a cool future update.\n\nHelpful | 4", "RickK75A day ago\nStunning. Possibly perfection on Quest.\n\nUpdated review for V1.0.11\n\nI've got 95% of games on the Quest and this is far and away the best I've played.\n\nAbsolutely stunning game. Hands down the best game on the Quest by a long, long way.\n\nThe developers keep responding to feedback and improving this title to perfection.\n\nThe gameplay combination of atmospheric, procedural levels and achievements that unlock new enemy types and new power-ups as your skill improves keep the game fresh.\nIt just keeps getting better and better and inviting you back for more as the new toys drop and new fiends arrive to challenge you.\n\nIt takes the work done by Solfar on the 2018 title and revitalizes it with many extras. Also, this is no Arizona Sunshine or Onward visual disappointment... Superbright have done incredible work to allow In Death: Unchained to look stunning on the Quest including work on the UE4 engine itself. Compared to the PC this does not look compromised unlike other titles.\n\nMore people need to get this super addictive gem.\n\nIt really deserves to be the #1 best seller on the Quest as it's totally awesome.\n\nHelpful | 3", "andersonkodi19 days ago\nI hate when I'm wrong \n\nBeen observing the raves about this game and thinking \"Argh, I bet those are all paid reviewer or first timers. There's no way an arch and arrow game can get those great reviews. So, I've decided to give a try, already thinking that I would check it out for 5 min (enough to badmouth the game based on experience) and request a refund right away. Well, been playing a good hour every day since my purchase. How dare you Devs!! How dare you make this game so engaging?it's not complicated. It's actually quite straightforward, yet its complexity is so satisfying. I hardly spend more than 30 min per session. This one changed my mind. I guess, my only hope is that the Devs might start slacking off, leaving the game supportless but I'm afraid I'm probably wrong. The game is already Awsome at it is (NOOOOO, stop the updates, stop fixing bugs and making this game even greater. . Thank you for ruining my wallet!! \nREQUEST: C'MON DEVS!! How about at least one check point? or the ability to maybe buy one with our coins? That would be much appreciated by everyone \n\nHelpful | 7", "ReimerX14 days ago\nOne of the Best!\n\nDefinitely one of the top games available for the Quest. It is highly replayable and really shows what is possible on the Quest. You are honestly lucky to get a few good hours of play time out of most VR titles (with a few exceptions like Beat Saber and Pistol Whip). In Death has procedurally generated levels and dynamic difficulty adjustments that keep it challenging and fun. I have played many hours and there are still new types of enemies being introduced. Also, the devs are listening to the community and adding refinements and missing features. The most important latest addition is multiple player profiles. They have also added better visuals and a bit more variety to the generated levels. Many VR games kind of feel like fun demo experiences, but In Death is one of the few that feels like a full game to me. I love the visual style and audio. The precision is flawless. This game is really a testament to what is possible on the Quest. I have made thousands of shots and been shot at as many times and it has always felt accurate to me. It is just so immersive to be able to duck arrows flying inches from your head or to look out from behind a pillar and snipe a foe. After playing this on the Quest I can't imagine playing wired on PC VR since this game really benefits from the freedom of movement you get with wireless. The locomotion also works great. I am somewhat susceptible to VR motion sickness and with this game you have none of that. There is an option for smooth movement in addition to the teleportation and I have turned that on, but only use it occasionally for inching around cover.\nI expect to get many more hours of play time out of In Death (I only recently defeated the first boss and got access to Paradise Lost), but it also gets me excited because the game shows what is possible for titles that may still be coming. Playing something like In Death, but with a full adventure story would also be so much fun.\n\nHelpful | 6", "AlexLen8 days ago\nSublime Gaming\n\nWe were worried about how the game will be ported to the Quest but our worries were ... well, not justified! The Quest version is even better than the >original<. The extra level \"The Abyss\" is very well designed and the final boss an enjoyable enhancement. One or two more levels and the game will definitely be our new Nr. One Quest game.\n\nThumbs up for devs - we hope for more content soon.\n\nHelpful | 4", "Ihrie3 days ago\nSimply Spectacular\n\nA great game and getting stellar support from the developer.\n\nIts not easy by any stretch and it will get harder as you progress, but also quite addicting.......just......one......more run!\n\nWhile it only has a bow or crossbow the ammo system gives a fair amount of variety of preferred play styles.\n\nThe movement system is pretty easy to get used to but the addition of the free locomotion is much appreciated.\n\nDefinitely look forward to seeing what else they have in the future, and would happily pay for additional DLC if they ever decide to make any.\n\nHelpful | 3", "Gmanslim11 days ago\nSee what its like to be Legolas in LOTR\n\nWhat a game. This game is so much fun. The visuals in the castle are breathe taking. The game play is a blast. Once you get the controls down its a whole lot of fun. They arent hard to learn. I just made it to Anakim the Abominable on level one. Hes a big boy that doesnt go down easily. Cant wait to take him out and see whats next. You can hide behind walls to block arrows coming at you and you peak around and rip a couple arrows like a sniper from Medieval days. The guards are big boys and require a few arrows to take them out. The more I play this game the more I want to explore and shoot things with my bow. The accuracy of the bow and arrow system is very impressive. I found that if I use my established mark on my jaw like a normal bow I am way more accurate. If you are a fan of Medieval times or the LOTR and wondered what it would be like to live those adventures, GET THIS GAME!!!\n\nI now have about 10hrs into this game and it only gets harder. The more you accomplish, the nastier the enemies get. Literally as I have gotten better the game has gotten tougher. I love this game but boy is it challenging. Great replay value!\n\nHelpful | 4", "deliriumDrew_VRJul 27 at 7:52 PM\nTop 5 Quest Title for Gamers.\n\nThis game is amazing. Great use of roomscale. I already owned it on PC but being able to play this anywhere I travel is awesome. Its difficult but its addicting and some could get bored but its a challenge enough youll keep coming back to. Leaderboards are a great thing, and this gameplay is also.\n\nTop Notch Quest game. This is not an experience. This is something close to hardcore VR aka its like a dark souls game but a lite version of it. It is a rogue-lite. But it also lets you quit and save your progress at certain points.\n\nHelpful | 8", "TallWoman1989Jul 27 at 7:04 PM\nOMG I love this game\n\nI am rather new to VR gaming and have been using it for exercise and improving eye hand coordination as well as hearing testing for my one-sided deafness. I have been playing Elven Assassin, but this game takes it to a much higher level. And as much as the dead Crusader and his Zombie posse sneaking up on me scared the poop out of me, the startle added to the experience. I do agree with those that say there should be ambient noise - including the sounds of footsteps. I am using Oculus to test how much my cochlear implant is improving my ability to determine where sound is coming from - as well as for \"training\" the implant for determining sounds and direction. If they add ambient noise, it will catapult my efforts in this area. And it's just so much fun. Haven't gotten very far, but each time I die and start over I get a bit further. I'm looking forward to the journey.\n\nHelpful | 8", "Kewleo18 days ago\nin Death Unchained\n\nI have bought my share of games on Quest and this one is the most intense as it gets.\nEverything about this game from the mechanics to the scenery is amazing.\n\nThank you to the devs for being so creative and the price it's so well worth it.\nI'll be playing this game for a long time and I feel like I got my monies worth already!\n\nHelpful | 5", "belaclynch7 days ago\nBest game on the Quest\n\nI played In Death previously in PSVR, It's amazing how much they've improved it for the Quest. All of the new content really fits, tracking and graphics are great considering the quests limitations. There are so many achievements and with the gameplay being so addicting it's well worth its price\n\nHelpful | 3", "Dr.evilman7 days ago\nGreat game\n\nLet be honest want makes a great game,\nGood game play, a good story line, and a sense of being this game gives 2 of those options and no real story line just hardcore action game that will keep you on your toes feel free to check out www.facebook.com/drevilmansvr for me streaming the game.\n\nHelpful | 3", "Timperpedic3 days ago\nGets Better and better\n\nI highly recommend this game. Honestly I wasnt very impressed at the start but the more you play the better it gets. The increasing challenge but added weaponry and variety of enemies makes it so much fun! Graphics are also some of the most impressive yet for the quest.\n\nHelpful | 3", "lolnicoJul 27 at 8:15 PM\nThe dev's are here for us<3\n\nThis game is a real masterpiece for the Oculus Quest. I loved playing against the fallen angel for the first time haha or maybe I should say hated because I just got so scared of him I got hit three times in a row and died soon after. This game is a loved hategame for me in a good way don't get me wrong. Easy worth 50 for me just to show the developers my appreciation for this game <3 So if you like getting challenged and still have a fun time dealing headshots while you dance through the enemy hord you should get this game ^^\n\nBut let's get to my problem, the furthest I've gotten was to the fallen angel but still I have 0% progress. Do I have to do something first that I've overlooked or is it just a little bug?\n\nEdit: After I rode an email to the support of Superbright I hab my problem fixed within minutes. I just had to reinstall the game and agree to the permission to store on disk. Thanks to the developers! Now I can enjoy the hole glowry of this game.\n\nMuch love\n\nHelpful | 6\nDeveloper ResponseJul 28 at 10:19 AM\n\nThank you so much, this is a joy to read, happy we were able to help and we're always there for our players. Stay tuned for new updates and fixes, and there's an archery contest going on that you can read about on https://www.facebook.com/SuperbrightVR/posts/2666535786922944 !!!", "noah.lugeons15 hours ago\nKeep playing - It gets really fun\n\nI have to admit, I almost gave up on this game after the first couple of tries. I found it boring and repetitive and didn't see it holding my interest for very long. But I'm glad I didn't. After a few days of playing, I reached a point where I'd unlocked enough stuff to make the game fun.\n\nMy initial issues were a problem with the format: The game is filled with unlockables that you only get as you complete various achievements, and to load the game up with enough unlockable content, the developers have to strip the game bare of almost everything for the first couple of run throughs. The result is a really unimpressive game on the first couple of trials. But after a dozen games you'll unlock enough arrows, enemies, powers, etc. to keep it interesting.\n\nVisually, the game is really impressive. It's got some of the best graphics on the Quest. It doesn't reach five star status for me because the basic mechanic of the bow and arrow does wear thin pretty quickly. It's hard for a game to rise above its base mechanic, but to whatever extent that's possible, I think In Death manages it.\n\n---\n\nAdditional note: The developers are impressively responsive as well.\n\nHelpful | 2", "HYaekel8 hours ago\nWorth every death\n\nIve easily put 15+ hours into this game & have lost count on the amount of times I have died - but its worth it. I have yet to get bored with this game & I like how it shows you when you are close to another achievement. This game is challenging, fun & the graphics are great!\n\nOh & I love how it updates a lot! They really listen to the comments from the players \n\nHelpful | 2", "vrciraptor2 days ago\nI LOVE Streaming this game!\n\nI first played this candid during a stream and it was a great decision. The tutorial is clear and explains how to use the controls well. Super easy to get the hang of! The ambiance is on point and the basic sounds are all you need! It's like arrow ASMR. The more you play the more intense the workout gets. Well, I see it as a workout... I also love that you can have the option to add free roaming to the gameplay (makes moving attacks more fun). The map is easy to follow and the buildings in the distance are a nice touch. I have learned that you can jump the roofs and it feels authentic (like I'm a trained ninja-corny, I know, but legit). There are save points spread evenly around the game, and within them is a place to shop and load up on gear for the big bosses. Anyways, like I said, I LOVE streaming this game, so come catch me live: twitch.tv/vrciraptor\n\nHelpful | 2", "ycaleb242 days ago\nAmazing game and great replay ability\n\nI never write reviews but I have been really blown away at how great this game is. After watching the videos of this I was still on the fence but went ahead and gave it a shot. It is easily my favorite quest game and beyond that has become one of my favorite games period. The play loop is amazing and the bow mechanics are incredibly satisfying. I always want to play one more run to see if I can beat my high score. The devs have been adding to it constantly. My only complaint....my arms get sore from playing to long. The game is amazing go buy it. Off to try and move up the leaderboards!\n\nHelpful | 2", "Bengo8612 days ago\nYessssss!\n\nSo i got this hoping it would scratch my itch for a good roguelite that has that dark souls/demon souls difficulty and boy did this game deliver. All Im going to say is, is if you like those kinds of games then throw your money at this game. I have other games Ive been wanting to play on the oculus but i cant put this game down!!! That is all\n\nHelpful | 3", "RithmatistGuy12 days ago\nEasy to be drawn in by all its aspects!!\n\nI think the game is amazing personally!! When I was considering buying it I read reviews that talked about how the rewards for playing the game arent really stats but just better skill in general. I see that now and it really does feel better to do well based on my own skill.\n\nThe game doesnt really have a campaign like I originally thought it would. That kinda surprised me a little, but I actually love the game more the way it is... it goes at your own pace and it doesnt matter how often you die which is really nice.\n\nThe only thing I would say takes away from it is an occasional bug where the bow sometimes doesnt draw right. Other than that I would say the game is really epic and worth playing!\n\nHelpful | 3", "jun3bud4 days ago\nFlawless victory\n\nI own this game as well as its Rift counterpart.\n\nThis is the first time I have ever been able to say that the Quest version of a game is BETTER than the Rift version!\n\nThe devs have done a fantastic job of not just porting this title to the Quest but IMPROVING it!! This game is so buttery smooth and responsive.\n\nThe Rift version doesn't always respond to nocking another arrow when rapid firing at a large group of enemies; resulting in multiple attempts to nock a new arrow and unfortunate hp being lost.\n\nHowever, in Unchained I am able to confidently charge into a room and rapid fire my way to victory!\n\nMy ONLY qualm with this game is that it is single player. This means that when my friends want to play a game together, I have to stop playing In Death: Unchained. If we could get a co-OP mode added, i would never need another game in my library!\n\nHelpful | 2", "Exhonour24 days ago\nNot easy but rewarding\n\nSurprisingly enjoying the game. I was thinking it would be a another wave shooter, and it kinda of is except you pick your own waves, but there's something about it that sticks. The combat is great, the animations/rag dolls are perfect, the AI is actually pretty good.\n\nWhen people say 'these are the best graphics on Quest' for other games, I am disappointed when I got to try myself. However, with this game, the graphics are actually really solid. The visuals are simple but are really crisp and fit the theme. I love the audio elements, beautiful music.\n\nThere is a heavy element of repetition though. You unlock upgrades, new arrows, the map varies, but ultimately I think I'll get to a point where trying to push as far as I can will not keep me entertained. Until that happens, I'm sure I'm gonna enjoy it. The crossbow is one redeaming element that I have yet to explore.\n\nIf you're not patient, you probably won't like this game.\n\nEDIT: the game really gets more fun as you get better and unlock more things! Most importantly, the devs being on top of fixes and feedback deserves a 5 star rating.\n\nHelpful | 5", "c-crs12 days ago\nA Great Rogue-like\n\nOne of the things that I was most excited to play on my new Quest. When I was a kid (up until my teen years really) I ran round the woods with a real bow and arrows and pretended I was a rogue-ish hero slaying evil that lurked in very stump and pile of fallen debris. This reminds me of being that kid again, and I thank the developers for that. Perhaps a dark forest map? ;)\n\nHelpful | 3", "1vraj14 days ago\nSuperb!\n\nWhen I was a kid I still remember me fantasising killing demons with my Bow and arrow from D&D. This has bought this fantasy to life! Graphics are good and the game play is great! Its highly addictive and it can get rather difficult! At times you will get overwhelmed by enemies and you will feel like that shooter from Lord of the rings!\n\nWorth every penny.\n\nHelpful | 3", "Steve1der13 days ago\nBlew my mind!!\n\nBest game that I have bought so far! It was very challenging at first, and as I got deeper, I really thought it was going to be impossible. But, as the game gets harder, you get stronger. Now I routinely get deeper and deeper into the game. I can play for an hour and not realize how much time has gone by. I cant recommend this game enough. Also, designers are quick to make improvements and fix glitches. Just a beautiful game.\n\nHelpful | 3", "Brentastic5 days ago\nBetter than the PC version!\n\nSuperbright has pulled off something incredible with this title: theyve developed a port of a popular and quite good PCVR game, and improved upon it in many ways!\n\nIf youre a fan of the original, do not hesitate to pick this version up.\n\nIf you havent played the original, youre in for a treat with this game!\n\nHelpful | 2", "Waynolog6 days ago\nThis Game IS Epic!\n\nI am 22% in and this game has given me hours of the most intense and engaging VR game experience since I bought my quest. It has atmosphere galore and the game mechanics all feel really good. this really is a a high quality game in every way. One small detail I would like is for the hands to to be more textured and real than a phantom glow.\n\nHelpful | 2", "brandon.migliorisi15 days ago\nHooked on this amazing game\n\nIm completely addicted to noticing my progress with the bow and arrow. I went from terrible aim to sharp shooter in no time. And the different arrows you can find, and their powers seem to be limitless. Each time i play i reach a new achievement, this means new bad guys, new behaviors, new weapons and more.\n\nAt first it seems like you get stuck playing the first level over and over again. Hang in there, as you unlock achievements the game continues to grow and evolve.\n\nIve got many games from the quest store as well as a ton of side loaded content. This is by far my favorite game right now. I cant stop playing it and the more i play, the more i feel invested in my progress.\n\nHelpful | 3", "Shaun308714 hours ago\nBest game on the Quest store so far!\n\nI've played a decent amount of Oculus Quest titles and In Death: Unchained is the best I've experienced so far. Keeps me coming back to progress further and further. Awesome game..definitely recommend buying it!\n\nHelpful | 4", "Brandozo7 days ago\nAddictive and time consuming\n\nBest game on the Quest - no question. Ive had this game for 3-4 weeks, play it at least 2x/day for 20-30 minutes each...and I am still only at 22% completion. The game is somewhat different each time you play...and it definitely adapts to my skill - gets more difficult as I get better. It can be frustrating to die after 30 min and then have to go back to the beginning (although you do keep accomplishments) - but this ensures I will get my moneys worth and never get bored. The game is very fair...when I get killed, it is because I made a bad move/choice - never once felt that the game was unfair or that I was cheated or that it was too difficult. I improve my skills each time I play and now have figured out how to move on to the next level...at least in theory. Definitely great bang for the buck...Ive probably played 20 hours so far and figure it will be months before I make it to the end. Love it...\n\nHelpful | 2", "shaggybrak5 days ago\nGo to game\n\nI havent played much of anything else since playing this game. I can see a day coming when Ill burn out playing it but for now Im absolutely willing to be frustratingly thrown back to Sanctuary after dying because spiking evil monks in their face holes is so effing satisfying!\n\nHelpful | 2", "Darkspaceinvader8 days ago\nHeavenly archer\n\nIn Death looks fantastic on the Quest and is quite the achievement. The gameplay is excellent and can be incredibly nerve wracking and tense at times! Shooting the bow feels great and quite realistic. Bravo to the Devs!\n\nRegarding the audio: I like the music that occasionally comes into the game but I'd love to hear more. The game sounds a bit empty at times which is a shame given the grandeur of the visuals.\n\nIdeally, I think the game would benefit massively from extra game modes: perhaps a defend the relic -wave shooter/tower defence- mode (this in multiplayer would be heaven!). A pit fighter mode against a human opponent would be fun too. Also, more weapons like throwing axes, magic or dare I say it, a sword!\n\nI use a mixture of free locomotion and arrow movement but my character sometimes gets stuck and I cannot use free locomotion to move away so in those instances I'm forced to use arrow movement. It doesn't happen often though so it's a very minor niggle.\n\nSometimes there is some slow down when there are a lot of enemies on the screen. I mostly noticed it in the audio however, as the sound became very choppy.\n\nAt its current price I think it's a tad too much: $25 seems a fairer price point. However, there are other games on here that are charging a similar price and yet offer less gameplay value so I'd rather pay slightly over for this than be charged the same for a game offering much less in terms of replay value.\n\nOverall, I would recommend picking this up for fans of the genre it's very enjoyable.\n\nUpdate: Developer has listened to feedback and has fixed most of the niggles I had. I've found its a great game just to keep popping back into and having just one more go! I've given the game an extra star because of the ongoing polish, game play and replayability.\n\nHelpful | 2", "Alextorndj7 days ago\nGreat & Adictive Game !\n\nThis game is a must have for Quest owners !\nBeautiful graphics, good gameplay, immersive athmosphere and huge replayability.\nCongrats to the devs !\nSome multiplayer modes, like coop or pvp would be awesome and, if it happens, as we have two Quest at home, I would gladly purchase a second time the game for our other headset :)\n\nHelpful | 2", "The_Werdolf17 days ago\nUpdate 2: I would give it 10 Stars\n\nUpdate 2. It's getting better and better. The developers are listening to the players and already have improved so much since the release. First of all, Audio is now really spatial. If you hear the enemy but don't see him, you will know from what direction he's coming at you. The volume, ambiant sounds and music have greatly improved. Gameplay issues like player hight at some rare points have been fixed. Graphically it's so amazing to have it on the quest. Graphics are crispy and clear, enemies are not only smooth animated, they all act differently and look great. The helmet of the knights for example look really metallic. Even if dozens of monsters, monk's and knights are in sight, it still runs smooth as butter. Replayability is virtually unlimited.\nThis is exactly what I expect from a VR game, I would call it the king of all quest titles. If you want to get lost in a virtual afterlife for hours, learn and improve your skills with arrows and tactics. This is your game, don't hesitate - buy, buy, buy ... Now!\n\nAnd please forgive me for praising this game so much, it's just what I think and I'm not related to the developers. I own several games but this one sets a new mark and every game that comes after has to be compared with that. Thanks for reading and you may want to read the first review and update below too.\n\nA really great game... Ok, I don't want to praise it because other people have already done it and they are right. I would give it 5 stars if the music would be louder or adjustable and a short distance weapon like a sword could be a cool thing. Graphically it's really good apart from that the textures are missing any form of bump mapping so they look completely flat. Maybe that is due to performance and maybe it could be improved in the future. I think it's a rock solid game for a first release and hope for some improvements over time. Some final words, please buy this game or you would possibly regret it and many thanks to the developers for bringing a full game to our beloved vr device.\n\nUpdate1: I don't know why I haven't seen it the first time I've played it, but the wall textures have a shiny reflection effect. It doesn't seem to be as flat as the first time I've played it. It isn't very bump map like, but rather nice. I've played a little longer and came to a portal that brought me to a different location, but I will not give any spoilers. Anyway, there's still room for improvements. What I said before about the sound is not only that the music is not loud enough, somehow it doesn't seem to be positional. Sometimes I hear a monster near me, but the direction seems to be wrong. I'm also missing wind and echo effects that you would expect in an environment like this. Maybe its there but I don't hear it.\n\nSo I've updated it to five stars, because it is just amazing and with some work to the sound and graphics it could be even better...\n\nHelpful | 3", "rbchandler199317 days ago\nAbsolute Best for the Quest\n\nThink of this game as a hornet's nest. The more you poke it, the more pissed off and bad a** enemies they send at you. Don't worry they have a large arsenal of arrows to dispatch your foes.\n\nThe progression is similar to that of the Risk of Rain franchise. The more you play the more toys you unlock. Powerups can be found throughout the procedurally generated maps (beautifully done might I add), purchased with coin, or dropped from that poor b***h you shot in the head Legolas style with a 360 no scope.\n\nThis game is tough In all the right areas. There are layers to this onion. I've put in a good 6-8 hrs and have only managed 34% game completion. The percentage depends on your achievement progress (which is what adds new ammo types and enemies to the game) and honestly how far you've made it thus far.\n\nAll in all, the game looks great, smoother than a baby's bottom, and keeps me surprised and entertained at every step.\n\nThis game has single handedly made my Oculus Quest purchase worthwhile.\n\nWhat are you waiting for?\n\nBuy it \n\nHelpful | 3", "VRReviewsJul 23 at 3:30 PM\nQuick 5 Minute Video Review\n\nYou can find my 5 minute video review here: https://youtu.be/b8FAuN5qLFI\n\nOne of my favourite shooters on the Quest. You will die and die often. If you die it's usually because you need to up your game rather than because the game is unfair. This makes the game very addictive as you want to keep playing to improve your skill and eventually complete a stage which is hugely satisfying when it happens.\n\nHelpful | 9", "Libertonyan9 days ago\nEvolving Greatness....\n\nUpdated 8/5-\n\nSuperbright is leading the way developers, pay attention.\n\nAnd I'm not even speaking to the quality of their game, In Death Unchained, although it's excellent, I'm referring to their dedication to the gaming community. Superbright respects their audience enough to listen, engage in dialogue, and update their wonderful product to reflect the feedback, desires, and collective wisdom of us, the humble players.\n\nThis is a 21st century developer, using modern communication methods to engage with their base and improve their product. Constantly. Consistently. The version of In Death which I'm about to play today is heads and shoulders above the day-1 version, and that's a fantastic thing. Even more fantastic, is the fact that 90% of these improvements were called out by us, the players. Superbright is forging the path of developing a RELATIONSHIP with us, based on 2-way communication, with everyone involved laser focused on just shaping a really really good game. Ultimately, it's all about fun, right? Buying In Death on day-1, leaving a review and having Superbright leave a thoughtful reply, playing In Death again a few days later and seeing improvements implemented that I contributed towards.....that's all been a really fun, and rewarding, experience.\n\nGoing forward, I will be buying any Quest product produced by Superbright sight unseen, because I have confidence that they have my best interests at heart, and they have the humility to exist in a state of constant learning, change, and improvement. This is how you make a customer for life. Well done Superbright.\n\nTL;DR: Agile. Nimble. Responsive. Respectful of our time & passion. They listen, and they improve. Bravo Superbright. Five Stars.\n\nHelpful | 2", "WildhamstrJul 25 at 10:26 PM\nNo story. Just shooting stuff with bows.\n\nIncredibly incredibly difficult game. You'll be punished severely for every mistake you make, so it's not for those who expect an easy learning curve.\n\nThe bow shooting dynamics are done well. Environments are great too. Shooting enemies can get addictive (at least until it gets boring), esp with that satisfying thump of a head shot.\n\nMy biggest criticism is the lack of checkpoints Ala D2. i.e. Would like to go to Paradise Lost without having to play through the entire Purgatory and Anakim again and again.\n\nImagine - after six hours of shooting nothing but endless waves of monks and monks and monks and monks and monks and knights and abominations (regardless of how satisfying it is to shoot stuff with bows - still gets stale cos it's shooting the same stuff for hours) and a brutal battle with Anakim and his sidekicks leaving you with little health, you're finally able to start on a new level with a fresh variety of enemies..\n\nAnd you get shot once by a cupid and you have to start all over again. It's really frustrating and makes one feel like ragequitting.\n\nHelpful | 30\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "Azazel0810 days ago\nIncredible!\n\nThis was my go to game on the Rift for about a year. Superbright did a great job with the port to Quest. The texture pop-in is really the only downgrade. The game is so amazing without a cord that I can see this being my most played game on the Quest soon enough. I really like that they have added more content since the last time I played on Rift. I would like to ask the devs for 2 things...\n1) let me throw the shard and teleport there immediately instead of making it a dash feature please. It doesn't matter how far I throw it because the result is always dashing a set distant in the diection that I threw the shard.\n2) allow me to go to Oculus Home without kicking me out of my current run. I ran out of battery while playing so I used the Oculus button to go to Oculus home so that I could change out the battery, but there is no Resume button. The only way to get back in the game is start a new run.\n\nHelpful | 2", "Danshirou10 days ago\nFantastic rogue-like dungeon crawler\n\nIf you are into skill-based bow and crossbow mechanics, this is the game for you. The more I play, the better I get at mowing down enemies from a distance. I find this extremely rewarding, especially when you need to shoot accurately to penetrate well-armored enemies. Randomly generated levels and a nice progression of perks and better arrows matched with more difficult enemies and surprises keep this game fresh for a long time.\n\nHelpful | 2", "rikjamesBJul 25 at 10:28 AM\nAmazing Games\n\nThis is a great rogue-lite. Great graphics and random generated levels. The bow mechanics work great. I didnt think I would the arrow movement but I actually like it a lot. Highly recommended.\n\nUpdate: The one this this game needs is better audio queues. Guys teleport behind you and you dont know until they hit you. Improve the spacial audio\n\nHelpful | 5\nDeveloper ResponseJul 25 at 11:19 AM\n\nThank you! Audio updates are in the works, good feedback and it's important for us to hear from you guys.", "darkuniJul 25 at 7:24 AM\nThis is the game I've been waiting for!\n\nFinally, a game worthy of your time, money and a 5 star rating. Let the 8 year olds bump up FNAF; the men have Purgatory to conquer!\n\nThere isn't room here for my full review, so please read the entire thing here: https://medium.com/@darkuni/in-death-unchained-purgatory-never-looked-so-good-9571662db820\n\nGreat graphics, best bow work on any game, endless replay possibilities, good pricing. On my top 5 VR games list.\n\nHelpful | 6", "peteclarkelondon13 days ago\nAbsolutely Brilliant\n\nFor someone who has never been into rogues or rogue-lites or whatever you want to call them....well Im addicted to this. So moreish, live the constant upgrades and little changes each play through and it looks great and plays buttery smooth no matter how many enemies are on the screen at once. Its very impressive and a ton of fun too. I would write some more but I have to go back to play!!\n\nHelpful | 2", "ism123 days ago\nTotal fun\n\nOne of the biggest surprises for me since owning the Quest. I thought I might get bored of this quickly, but quite the contrary. Its just plain fun and unlocking upgrades and enemies only makes it more fun. Once I improved my aim and became more adept all the movement options (teleport arrows, movement shard, free locomotion), fights became thrilling and satisfying. Really nice graphics, above average AI for Quest, and lots of polish. This game was ready for release *ahem* yet theyve already been improving it with updates. Addictive play made it the first thing I thought about the morning after purchase.\n\nHelpful | 3", "GlowBox24 days ago\nAn Overwhelming 5 Stars.\n\nI will absolutely be playing this masterpiece for YEARS, or until the next Quest. Every run is fun and satisfying. I've had it for 4 days now and putting in about 6-8 hours each day since COVID-19 and everything. It helps me escape reality and puts a giant smile on my face every day.\n\nIf this dumb review pushes just one person to buy it, my purpose will have been served. This is a legit 10/10 game crafted perfectly for VR. It's endless.\n\nHelpful | 3", "KarmaMole9 days ago\nGreat Archery Game Keeps Getting Better!\n\n6DOF Reviews Video Review here: https://youtu.be/jMbSb2tsSC4 This review will be updated in the next few days :) We initially reviewed it on release, and its improved so much since then that we felt it was only fair to re-review the game and score it accordingly :)\n\nHelpful | 2", "nexus28935 days ago\nEasily a instant favorite\n\nIt takes a few games to get used to the bow and arrow mechanics and a lot of games to master. It's also super challenging which keeps me coming back. I love the option to unlock things as I meet checkpoints through multiple games. A must-have for sure!\n\nHelpful | 2", "basbunderJul 25 at 11:13 AM\nMost value game on quest\n\nBefore buying the game i had hard time enyoing a game for longer than a few hours. This game made me addicted, it is sooo good.\n\nBecause the game is constantly changing it will keep being a good chalange. But the charm lays in the moments you ace and feel like a demonslaying boss.\n\nThe game has a learningcurve but you can get the hang of it quick anough. Be creative there are a LOT of tactics you can use.\n\nOverall now my friends tryed this and can't stop boosting about how the have servived heaven and hell arfter taking off the headset.\n\nWorht every cent\n\nHelpful | 4\nDeveloper ResponseJul 25 at 11:18 AM\n\nThat's so amazing to hear. This is why we believed this was the genre and title the Quest needed, enjoy the game and thank you!", "Get_To_Da_Choppa_VRJul 25 at 2:59 AM\nI used to be an adventurer ....\n\nIn Death: Unchained is a Roguelite action game set in the afterlife with a focus on bow and arrow combat. The roguelite element comes from the fact that the levels are procedurally generated and when you die, you lose all level progress and any additional items you are carrying.\nThere aren't any difficulty settings and instead the game adapts to your specific gameplay skills, with the game starting off relatively easy (I say relatively, as for some, this will be tough from the get go) and progressively getting harder with more enemies, more verticality in the environments and more enemy types for you to overcome.\nNavigating around the environments feels awesome, as you use your bow to teleport from where you are, to pretty much anywhere you can see. There is a great sense of freedom and verticality in the level designs allowing you to teleport to the top of the rooftops to take a sneaky shortcut or to avoid enemies.\nWhilst making your way through these levels you will notice the theme and design of religious iconography with the buildings primarily being chapels and steepels, complete with stain glass windows. All of which have great textures and detail, making this one of the best looking games on the Oculus Quest.\nThe sound design is pretty decent as well and whilst sparingly used, the hymn singing backdrop is done to good effect. Also enemies have their own audio cues to alert you to their presence, which Is vital to listen out for, as enemies can and will appear above, below and behind you.\nThere is a good mix of enemies and the combat is super satisfying with solid bow and arrow mechanics.\nSo, in conclusion, I would recommend this 100% but not if you are someone that is looking for a varied or easy game to sink your teeth into. This is punishing and the lack of variety will not be for everyone but with satisfying bow and arrow mechanics, great visuals and sound design, awesome environments and fun navigation makes this one of my favourite Oculus Quest games.\nVideo Review on Youtube \n\nHelpful | 4", "fillupwinJul 25 at 8:49 AM\nI'll be playing this for a WHILE\n\nBeen playing this 3 nights in a row everytime down until the battery dies. Have never done that with a quest game! And I haven't even got to 20% progress and I'm still having a blast and constantly challenged. My oculus quest has been my goto lately with my 2 year old and work and quarantine taking alot of my time and energy through the day I usually have an hour or two at night to play. Lately I have been gravitating toward something short and satisfying, but alot have been getting super repetitive or having little to no replay value. Indeath ticks all the boxes! Also, amazing graphical achievement for the quest! Great bow physics! I have been crafting and shooting longbow, recurves, doublebow, compound for years, and this game has the best archery physics I've seen on the quest! Great job devs! If your reading, I would throw money at you for some longbow skins!\n\nHelpful | 4", "The_Grim_Fandango16 days ago\nOne of the best games on quest\n\nI had been waiting for this game for a while. And boy was it worth the wait! I can play this for hours at a time and not realize I been playing for that amount of time. It totally engages you and its easy to get sucked in. To the developers and all involved in the making of this game: keep up the great work and look forward to future updates and releases. You are masters of your trade.\n\nHelpful | 2", "GrayGray_UK19 hours ago\nBrilliantly Entertaining!\n\nI'm not usually a fan of the \"Dark Souls\" formula; replay, replay, replay', finding I get frustrated way too easily with the difficulty. However, \"In Death Unchained\" has completely converted me to this genre. I have found that over the past week, ive sunk more hours into this game than I have any other on the Quest. It's challenging, without being tooooo hard, the variety of enemies and special arrows are great, and the procedurally generated levels (I love the Abyss) really add to the whole experience.\n\nYes, there is a noticeable difference in the graphical quality compared to the PC version, but that's completely expected, and I don't find that it takes away from the game at all. I'd rather have excellent gameplay mechanics than excellent graphics. There's still a few bugs, such as the music freezing on a constant loop (only happened twice to me, and resets after death), but other than that, I really can't fault it.\n\nHonestly, a solid game for everyone, even if you're not a fan of the genre!\n\nI hope the Devs keep adding to the game, I'd happily pay for DLC maps, or even a co-op feature of some sort.\n\nHelpful | 1", "tet198119 days ago\nGreat game!\n\nThis is one of my fav games on Quest! While I refund Arizona Sunshine because it is NOT worth that price... THIS game is the opposite!\n\n- fantastic bow fights\n- scary moments\n- good graphics\n- endless rouge-like-fun\n\none of my top 3 games!\n\nHelpful | 3", "SANEWBERRY11 hours ago\nlove it but one problem....\n\nI bought this on the strength of other peoples reviews and Im very glad I did. I do however seem to have an issue. Each time I load the game the profile slots say empty 0% and it stick me in training. I can skip the training from the menu and it takes me to the start. I can see my name on the leaderboard and my achievements but it still says 0%. Am I missing something here?\n\nUpdate: Updating Quest to v19 has fixed the issue.\nHaving progressed further into the game now, Im enjoying it even more. Exploding arrows are fun!\n\nHelpful | 1\nDeveloper Response10 hours ago\n\nHappy the system update fixed the issue, enjoy the game! :)", "The.Magical.OxmanJul 30 at 10:53 AM\nAddictive, Engaging & Hair-Raising!\n\nI'm so glad I read the reviews! Initially, when I saw the pictures on my iPhone I was not at all interested. But with the rave reviews, I thought I gave it a try. Boy, was I ever glad! This is perhaps the best if not one of the best games on Quest. It gives me the satisfaction of battling with bow and arrows (realistically) while being scared all at the same time. The graphic is superb, I've no complaints there. The knights are terrifying; not only that they move fast but they're strong and hard to defeat and later in the stage the enemies get stronger and weirder, I kept swearing and dying all the time. The only complaint I have with this game is you only have 6 strikes before you have to restart the game all over again. There are no checkpoints and there aren't a lot of cups of blood where you can pick up and restore your health and heal. It's a game that forces you to play a couple of rounds and stop. It is also better if you've got more room for you to roam around, it helps tremendously with the gameplay. It is an engaging game. The music is eerily and the ambient noise and sound are disturbingly realistic and sometimes they weren't behind and suddenly they were. It's frightening! I hate that there is no map, unsure where I'm going and where and how this is going to end ....it's hell! I just have to battle my way through....and right now I just keep on dying still!\n\nHelpful | 3\nDeveloper ResponseJul 30 at 11:11 AM\n\nThank you for taking the time to write such an awesome review. Were going to have an update, hopefully next week, thats going to make things easier to navigate btw! Meanwhile enjoy the game and thank you again", "Frensleven18 days ago\nFantastic game - great developers\n\nThis game is really fun in small bites, or longer sessions. If you don't like it at first...practice a bit, and you'll soon see the depth and attention to details that the developers put in to this. It's only been out a week and it already has had a few updates and the developers are listening closely to the community about future updates. With the procedural levels, you won't get bored of this game quickly. It has an intense \"one more time\" aspect to it, and is very hard to put down. Can't wait to see where this game goes in the future.\n\nUpdate: The developers are really working overtime updating this great game with features the community wants. Already up to 1.09 as I write this. It's so refreshing when a developer listens to the players, and keeps adding features and tweaks to a game after release. I wasn't anywhere NEAR the scores on the leaderboard, but I'm still really enjoying getting better and more accurate with my shots, clearing out pits, and chasing those little orphans through crowds of bad guys...Keep up the great work!\n\nHelpful | 2", "OurMrReynolds18 days ago\nGetting more skillful never felt so good\n\nPure gameplay bliss, especially now in its wireless, expanded Quest port. Theres nothing else in my nearly 40 years of gaming that looks and feels quite like In Deaths creepy gothic architecture, wordless enemies, brilliant sound design, and beautiful Gregorian chant soundtrack.\n\nSince it's a Quest port there are slight simplifications to the graphics, but that's the only downside I can find. Practically everything else about the game has been improved or expanded. It's worth noting that this version's developer, Superbright, took the reins from the original developer, Solfar Studios, and went all out: it's a rebuild from the ground up with 50% more content, and refinements to the original's progression, enemies, and procedural generation systems. Its still super-sharp visually (arguably the new standard on Quest).\n\nThe archery is visceral and perfect in VR. Arrows have weight and physics, and there's nothing more satisfying than improving at a game because your body and mind are getting faster and more skillful with real-life movements (rather than button presses). Looking down the shaft of a nocked arrow, physically adjusting your aim for distance, and letting loose a perfect one-hundred-foot headshot feels incredible. Theres intricate and varied gameplay, with lots of strategic choices about when to use your precious upgrade arrows, and how to enter an area (the most fun answer for me is: rooftops whenever possible).\n\nAmple traversal and comfort options include smooth movement and a well-implemented teleport arrow. The game just sings in its wireless form on Quest: teleporting into the middle of a group and whipping around in a circle while firing a half-dozen short range head shots into enemies before they can even react...it makes you feel like a ghostly Hawkeye tearing up the afterlife.\n\nI'm about 20 hours in so far, enjoying an actual meaty Quest game with substantial replayability.\n\nSee you on the leaderboards!\n\nHelpful | 2", "DoMortas2 days ago\nAmazing game!\n\nThis is easily my most played Quest game, was a huge fan of it on PC and the Quest version just goes above and beyond pushing the limits and showing what the Quest is really capable of!\nAlso has a Discord so you can join and chat with an amazing community, get tips from the best players, and share your experiences!\n\nHelpful | 1\nDeveloper Response2 days ago\n\nThank you so much DoMortas!! <3", "Wolveon3 days ago\nGreat game!!\n\nTried to play this on psvr but the controls got in the way and never really gave it a chance. The quest version is brilliant. Graphics are great and controls make it more than easy to play, hard to master though but thats the appeal. If in doubt dont be, just buy it youll have a blast and there is countless hours of replay. Just great!!\n\nHelpful | 1", "Sir_Slaught3rJul 29 at 6:52 AM\nGreat game, highly addictive!\n\nI have hours into this game and its the one I cant wait to play again after I put my headset down. Extremely fun! Only feedback I have for the Devs is that it would be nice to have multiple player profiles to record progress for other players, some sort of multiplayer or coop feature where you either work together to get through a level or compete for a high score, and the ability to level select. If I made it to the Abyss, why do I have to start all over in Purgatory?\n\nHelpful | 3\nDeveloper ResponseJul 30 at 7:45 AM\n\nThank you for the feedback, multiple player profiles are coming. You can already unlock The Abyss permanently, and there is a new game mode coming for even more variety!", "Slipknotmaggot4419 days ago\nA port done right...this is a must own.\n\nOne of best looking quest titles I've seen yet, coming from playing this on my pc I was very surprised at how well it holds up in comparison. This is an action packed rogue lite with great atmosphere. To top it off the levels are proceduraly generated and new enemies and arrow types become available as you progress each run. The bow combat feels just as satisfying as its pc counter part. I 100% recommend, do not sleep on this excellent title.\n\nHelpful | 2", "hail2theking28Jul 28 at 3:58 PM\nIt's great\n\nI was on the fence on this title due to I Own the pc version.i was going to buy it anyway until I saw the price tag for admission. So I waited a few days to check out reviews,and I'll say it's totally worth it. I really like the pc version,but this one on Quest just feels better. I'll agree with others that a storyline to follow for in death would be nice,but that's just being picky(maybe just a cut scene just so the player knows why you are there and why you are doing what you are doing,would possibly be great). This is one of those games that if the devs kept updating and adding to,it could be legendary. I applaud the devs. The graphics are great, and the gameplay feels good..its totally worth the admission price. Don't go out to eat tonight and spend that Applebees money on this game.\n\nHelpful | 3", "Rockst3adyJul 28 at 7:42 PM\nAbsolute gold\n\nThis game is absolutely unreal. Graphics are fantastic. The gameplay keeps you wanting to play \"just one more round\" and mechanics are smooth and feel very intuitive.\n\nOne of the best games for quest and we'll worth the price tag.\n\nMy only hope is that they find a way to make this multiplayer (or even a 2 player Coop). A guy can dream.\n\nHelpful | 3", "KraznRazn19 days ago\nIts a great game worth every penny !\n\nI own this game on the PC and was blown away at this Quest version. Its amazing what developers can do with this headset. This is one Ill be going back to time and time again. The only thing I wish was different was the shard. Its what I used the most on the PC version to move around. I rarely use it on the Quest because of its limited movement. The game keeps its 5 stars even with that. Excellence!!!!\n\nHelpful | 2", "nelagalvez198420 days ago\nWonderful\n\nI played in the rift version, and this one is more polished. It is great to play this game without wires, and knowing that it has added extras, it's a complete 5 stars.\n\nIt will grant you a lot of replayability.\n\nUpdate: the developer continues updating the game and making it still more superb. I think that right now (30/07) this is the best game of the Quest in every aspect.\n\nUpdate 2: @Developers, sometimes I have put the quiver in the wrong place, \"filling\" a pack of arrows that were already full. May you cap the use of the quiver to just be used in missing arrows? (Like the blood of the lamb, that does not allow you to use it if you are full health). Thanks.\n\nUpdate 3: I am surprised about how fast they fixed the quiver :o they lasted less than 24h to patch it. the developers support is wonderful, Thanks!\n\nHelpful | 2", "Andgis4 days ago\nSuper bow game\n\nDie hard many many times ...quite difficult but keeps me returning. I was looking for a long time for a bow shooter with realistic physics. Not quite the same as a real bow but very near...if you blend out the pull force normally required...dont worry the hordes of undead will make you forget to think about it. Graphics very good for quest.\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThank you for the review, great to hear you're enjoying it! Feel free to send feedback to hello@superbright.org if you have any!", "slapfu9 days ago\nVery impressive, best graphics on quest!\n\nGreat job on this port of the already great PCVR version! Amazed to see it looking great and running smooth on standalone quest! My only suggestion would be to add slightly more shadows. Boss battles I'm just getting to but enjoying everything!\n\nHelpful | 2", "DesendantZero755 days ago\nA must have game.\n\nHands down the best game I have on my Quest. The changing maps, and challenges keep me coming back. I look foreword to seeing what the developers do with this game. i urge you to pick up this game, you wont be disappointed.\n\nHelpful | 2", "GuentherTheGeek18 days ago\nStarted playing this game on the vive\n\nI love this game and I'm clueless on how they have the graphics looking so good on the quest. It's a must have. And if you wanna show it off to friends you need this game. Kinda wish you could save your spots so you don't lose how far you got.\n\nHelpful | 3", "Drewcifer68Jul 26 at 10:17 AM\nExcellent ! Truely Excellent !\n\nIf Im showing off my Quest to friends who play modern consoles or PC games I often feel the need explain the systems graphic and processor limitations even with the best Quest titles. The graphics are somewhat limited but the immersion and game play more than compensate! Well theres no need for explanation here. The visuals are awesome! Movement is smooth and clean even with live motion. The controls are a little complex at first but soon become second nature. Immersion is complete. I havent had the slightest vertigo issue except maybe when standing at the edge of tower portico and looking down to rain death on the abominations below and thats because I felt like I was there! Never thought Id get into a bow and arrow game but this one is so smooth and perfect Im totally hooked. Buy it! Youll love it!\nQuick tip: if you ascend a stairway and your height isnt quite right (i.e. youre partially in the floor) use a shard or teleportation arrow at close proximity to correct it.\n\nHelpful | 3", "TorlorienJul 26 at 10:33 AM\nHighly Addictive!\n\nOne of my favorite games now. Graphics are awesome and gameplay is smooth and engaging. However I will probably stay stuck on the first level because this really is a challenging game. I'm ok with that because I enjoy this level and because it's different each time you rez, but it would be nice to see the rest of the game. For the devs, could you please add more options such as easy, med, hard modes? For easy mode, less enemies and no enemies at your back for example? Also more Gregorian music throughout would be awesome. Congrats on a great port!\n\nHelpful | 3", "Gramding22 days ago\nLove it\n\nCrossbow is my favorite so far. Have recently done the first boss and found a reliable way without taking damage its super amazing. Super high replay value. The unlocking of harder content and at the same time boons that really help you is interesting and fun. There are some really great arrow types out there. Have fun.\n\nHelpful | 2", "SuperDave12321 days ago\nBeautiful, Deadly and FUN!\n\nIm new to the Oculus. I was afraid to play a first person action kind of game because I usually cant get the hand coordination fast enough.\nNot the case with this game. The controls are easy to pick up. Bow and arrows are super fun to use.\nYou can go at your own pace. You can go anywhere in the game you want.\nIf you want to stay back and keep your distance (rooftop assassin) you can.\nIf you want to go straight forward up close and personal, you can.\nIt looks great, music and sound, excellent and when it wants too it will give you the shivers.\nI love this game.\n\nHelpful | 2", "kinny99923 days ago\nOne of the few must own games.\n\nThere's a few must own games for any vr platform, this is undoubtedly one of them. Alongside Beatsabre and Robo recall this game is without doubt, a game that every vr player needs to try. Great movement system which works with even the most vr intolerant players and a great level of depth and replay value. I played this in Rift shortly after launch and logged dozens of hours, the Quest version is every bit as good. I genuinely hope the dev keeps adding, even if by way of paid dlc.\n\nHelpful | 2", "ArcaneParadigmJul 24 at 9:43 AM\nAwesome new visuals- my new Favorite\n\nGot to try before it came out and have already spent way to much time playing . The new visuals are Epic :) - massive and Grand - a great transfer from the PC keeping so much from the orig game and adding amazing new content . They seperated the leaderboard one for bow and crossbow which is awesome cuz I'm not sure i ever used the crossbow on the pc version and it seemed like it was way easier to get a higher score. Definetly a must have game if you like Archery games - its the only free travel archery game on the Quest which is so much fun - its hard for sure but because you can travel wherever you have the choice on playing it careful or launching yourself into the fight areas and battle hard . Get it now you.\n\nHelpful | 3\nDeveloper ResponseJul 24 at 9:48 AM\n\n<3", "AzzamatBagatovJul 24 at 1:09 AM\nAwesome\n\nBought and played this for about four hours last night and I'm really impressed. Each reply added new modifiers as I began unlocking more achievements.\n\nThe map is randomly generated each play through so whilst the buildings might be the same , the layout differed each time. Once you get past the 3rd or 4th rest area the tile set changes too to introduce some variety.\n\n\n\nThe bow handles beautifully. Only thing I'd suggest is that the Devs have a go on the bows in the oculus home and try to emulate the haptic feedback from them as they're the most realistic feeling bows I've played with.\n\nThe crossbow needs an angle adjustment so that you don't whack the tracking rings together when reloading, so for now I'll stick to the bow.\n\nOverall worth the money \n\nHelpful | 3", "Evagrius77722 days ago\nAn epic and stylistic marvel\n\nFrom the rich fresh textures and neatly polished graphics, to the high quality audio and challenging, immersive gameplay, the developers have provided players with a fun, engaging and stunningly precise shooter that will compel gamers to press forward and keep coming back for more. Well done!\n\nHelpful | 2\nDeveloper Response22 days ago\n\nThank you so much <3", "mewaters16 days ago\nMy current favorite Quest game\n\nI play every day and it never gets old. The devs are great, very responsive to the community. The game stays interesting with new creatures and achievements, contests, and ways to improve your score. Great fun.\n\nHelpful | 2", "Amlbuzzer24 days ago\nOculus generous refund system\n\nWithout the oculus refund system I would never have bought this as wasn't sure I would like it , so glad I did as it is now my favourite game , the bow mechanics are spot on , I would love to see an archery mini game with leaderboard added (Wii sports style) however if nothing else gets added this game still deserves the 5 stars I have given it.\nWell done team.\n\nHelpful | 2", "RobInTheHood8 days ago\nAmazing game, but one selfish request:\n\nFirst off: please buy this game, you won't regret it. It is infinitely playable and you will see some of the best virtual environments in oculus. I would describe the game as \"competitively frustrating\", and it is easily one of the best, if not the best game I have played on the quest.\n\nTo the developers of the game: thank you for this beautiful game and for getting to see overweight frightening cherubs up close. I'm sure that you receive this request on a daily basis, but I would LOVE a co-op mode. Being able to see the other player's score is exciting, but it would be a level up in the game to actually be able to go through the waves and levels with someone else. To make it competitive, you can lower the lives of each player and only allow up to 2 arrow \"types\" for each player, adding a whole new strategic part to the game (one focuses on long shots with tempest and catalyst while the other goes head on with fire and ice).\n\nYou're probably working on it. Or you've tried and realised that it wasn't feasible. If cost is the problem, I would spare a few bucks for it.\n\nThanks for the frequent updates, and for this beautiful game.\n\nHelpful | 1", "Ryguy59917 days ago\nExcellent game. Just buy it\n\nBought this after reading a few reviews and don't regret it at all. So much replay value here and excellent gameplay. You unlock new stuff in the game as you earn more achievements. This has easily become my favorite quest game. So far have reached rank 65 with a bow\n\nHelpful | 2", "imodude9 days ago\nExcellent bow-based shooter\n\nFinally, this is a game that's got me coming back to the Quest time after time. Before this, nothing had enough substance. I just love this. I'm not particularly good at it - so far I've not been able to beat the first \"boss\" level. But I am still loving walking through the castle killing things.\n\nHelpful | 0", "SenSSi_25 days ago\nRaining Arrows\n\nGameplay 5/5\nGraphics are excellent. 5/5\nAudio 5/5\n\nThis game is excellent, and they updated, that smooth walking height problem. Edit. Audio is now a way better. Awesome devs.\n\nLove to see, what dlc brings to this game.\nBest and must own bow game on Quest.\n\nHelpful | 3\nDeveloper Response25 days ago\n\n<3", "TripleSubJul 30 at 10:00 AM\nWe are the knights who say 'Ni'\n\nWhat can be said for this one?\nThe whole aesthetic has a feeling of Dark Souls, except you only have arrows to defend yourself with.\n\nA maze of walkways and stained glass rooms wind upwards and around each corner something is waiting to attack you or be shot in the face by you. You get upgrades to your pointy arsenal by the way of item drops as you go.\n\nThe graphics and textures are really nice and sharp, there is a good use of distance fogging which I assume is to keep the game running nicely and hits a nice atmospheric balance for the created world.\n\nThe teleportation I was finding a bit too fiddly, but after a few games I did find the locomotion settings which for me saved me looking like a total n00b.\n\nThe price is more than fair for what you're getting here and it does feel a well polished and tight product with plenty of thought attached (keeping in mind that it has been on other platforms for a while).\n\n(48Hrs later) - I thought it worth adding my thoughts after a few solid evenings play.\nI can't actually put the game down right now, the experience has improved as I've progressed through the game. This game is quite addictive!\n\n*I've edited this again, to reflect the developers comment below, the one glitch in there has been fixed. I noted this last night as I'm still solidly playing and the game is adapting to challenge me as I continue.\nWell played devs!\n\nI stress, if you like the look of this as a game and like the concept, consider getting it in your library...I truly don't think you'll have any regrets with this one.\n\nHelpful | 2", "bvaughnyJul 30 at 6:06 AM\nFrustratingly Addictive Game\n\nHavent been able to stop playing this since purchasing. A little bit of a curve when stepping into the game, and the game scales very well when youre starting to get to grips with the movement and shooting. Huge sense of accomplishment when you actually get through to new areas, and the achievements system is really good to at least track where youre progressing when you die.\nOnly point so far Id improve is a description of what arrows youve already picked up on your bow as some look similar.\n\nHelpful | 2", "Partycus11 days ago\nMy favorite game on Quest!\n\nThis is definitely my most played game on oculus quest. It rewards you for upping your game just enough to keep it interesting so that the gameplay keeps changing. While you get new skills and power ups, the game also increases its challenges so that it always keeps you on your toes. The developers are also doing a great job with frequent updates and fixes. Ive really noticed a difference in the quality of the gameplay mechanics and detail since I started playing it a couple months ago. Keep up the good work! I cant wait to see what the developers add next.\n\nHelpful | 1", "offaxis53Jul 29 at 1:35 PM\nTerrifying!\n\nHonestly I didn't expect the game to scare me this much, and it continues to scare me even after hours of play. The procedural generation of most of the maps contributes to this, as you just never know where the monsters will pop out from. I try really hard to avoid turning my back to unexplored doorways, but that just makes the occasional surprise from the spot that I missed so much worse!\n\nI love the game, it's heaps of fun and the archery feels perfect. But I can only last about an hour at a time before I'm drained of energy by the stress of it all! Which I guess means the game is a pretty good mockup of supernatural medieval combat. :-)\n\nHelpful | 2", "Baka_B16 days ago\nAmazing!!\n\nEven though my aim is garbage i still enjoy the poop outta this game! the bow physics are amazing same with the crossbow and i love the diversity in the gameplay! also its pretty spooky like when they jump around the corner its sooo funny!\n\nHelpful | 2", "sammy_steez11 days ago\nThis is dope and worth buying.\n\nThe replay value is immense. Upgrades and enemy enhancements occur regularly enough to keep the standard unchanging path exciting.\n\nThe procedurally generated path also alters itself enough throughout that it stays fresh.\n\nYou can see yourself get progressively better and it is just a blast. I cant stop playing to be honest.\n\nIll put my headset on thinking Im gonna play something else and I end up back in ID:U.\n\nWorth buying 100%\n\nHelpful | 1", "ThatGreenGuy10 days ago\nSuper Immersive\n\nDevs really did a great job making the movement system very immersive. It works really well with the whole bow-and-arrow theme and it makes the game really immersive without making you motion sick. Well done!\n\nHelpful | 2", "ssoRgniKJul 27 at 2:43 AM\nCant fault it.\n\nA lone archer, among the stone angels a top a cathederal roof. The archer is hidden. Moving from statues to spires dispatching scores of demonic foes. The bow string draws back slowly with a deep creak (right trigger), a single arrow flies and meets its mark with a satisfying thud into the faceless hood of a lost soul.\nDecending from the roof, the archer makes through the keep to the next procedurally generated area but is met by a dozen ghouls or more accompanied by two knights templar. In panic the archer begins firing off arrows as fast as the bow will allow, the ghouls drop from a single arrow while some fly to the left and right of their target. An enchanted arrow, winters bane, finds the eye slit of a knights helmet, the knight is frozen but still alive. A second ice arrow meets the second knight, preparedly the archer makes distance with a teleport shard (right grip) before equipping a standard arrow (left A/B) and ceasing the pained wailes of the frost bitten knights.\nOnward the archer travelled, leaving zone 1 and proceeding to procedually generated zone 2.\nPassing a tower on a single pathway the archer ventured in. Here it seemed was similar to a campfire in dark souls, a safe area to leave the game or get some health.\nThe archer leaves, not having enough gold to collect any items and proceeds to kill everyone in purgatory the end.\n\nIts a really good game, looks great, has smooth loco plus a magic arrow for those hard to reach spots. Killing in this is fun and can be taken at your own pace with strategy, can get hectic if loads of putty men run at you just stay on target.\nBasically run through three procedurally generated areas then go through the fog door to the boss room. Die. Three more procedural levels. As you go you unlock perks/boosts for killing so many of X by doing Y then you unlock other zones such as the abyss.\n\nI thought this game may be lame, after playing it for a few days, its really good fun, it looks good, the AI arent stupid, can pretend youre legolas sometimes. Or that one bit just after gandalf falls in moria when everyones running away and aragon is dodging those arrows, well you can do that too.\n\nHelpful | 2", "Yennedtrebor8 days ago\nAbsolutly addictive\n\nThe scale to personal ability is very real, I have to get exponentially better to get any bit further, even with more weapons unlocked and my score creeping higher.\nIve playes uaing just the teleporting, and also running around on a soccer field and both are just great\n\nHelpful | 0\nDeveloper Response8 days ago\n\nRunning around on a soccer field? We want to hear more - please email us at hello@superbright.org please :)", "LeGoblinMagique12 days ago\nAmazing game!!\n\nEverything is so smooth and fun, I play more and more since... everything except one thing... is there a multiplayer upcoming? It could be amazing fight as coop with a friend. Thank you this amazing game 10 stars!\n\nHelpful | 2", "EispfogelJul 26 at 8:50 PM\nFinally on Quest!\n\nIn Death is just made for the Quest! Buttery smooth framerate at all times while featuring a high resolution.\n\nThis is the final Form of this game - wireless, polished and many improvements over the PC and PSVR Version. Tetris Effect, Red Matter, Space Pirate Trainer, Beat Saber, Moss, and now In Death - it makes the Quest complete for me ^^\n\nWhat makes this game great for me - the environments are always changing. you will notice the changes the more you play it and it will always be interesting and surpising! For some reason this game also reminds me of the very first Prince of Persia game. I don't know for sure but Lost Paradise feels like the later levels of Prince of Persia. I love that!\n\nPro:\n# High resolution - You can make out smaller enemies in the distance and arrows clear and sharp! Great Job! Everything looks sharp!\n# The Art Style - This game is a looker and the atmosphere is amazing!\n# Highscore Chasing - this is what makes you come back to the game! Very engaging and very fun :)\n# Bow and Arrow feels just right!\n# The devs are very engaged with the Community and are fast to fix bugs and improve the game!\n\nCon:\n# ONLY ONE PROFILE! This is a no go! I don't want my family, or friends to play with my progress. please make a system like in Coaster Combat!\n# The Crossbow - the way we have to hold it feels unnatural and makes the controller collide with each other when reloading. It would be great if this could be changed.\n# Sound - some enemies are hard to hear and the spatial sound is off! Some enemies sound like if the are just in the next room dead ahead, but the are above, or below you. There is no sense for direction\n# Music - when it is played it is great but this is very rare. On one hand this is great for the atmosphere, on the other hand - this is sometimes boring. An Option to use my own MP3 music(along with volume slider), or use more ambient sounds, which also don't overpower the enemy sounds would be nice - hard but you can do it ^^\n\nHelpful | 2\nDeveloper ResponseJul 26 at 2:07 PM\n\nHi, thank you for your feedback, plenty of good information! Audio is being worked on, and we'll be looking into making multiple profiles available, stay tuned and enjoy the game in the meantime :)", "BriWifiJul 25 at 8:31 PM\nIncredible!\n\nThe guy that gave the game 4 stars is a hater, this is clearly one of the smoothest, deepest, most replayable games available on the platform. I've been a fan of the PC version for awhile but was heavily disappointed when the previous devs completely abandoned the game right after release. The new devs added so much more content with plans for even more! Very much worth your time!\n\nEdit: A ton of people are rating this game low because either A. They didn't read the description and see that it's a roguelite, wherein you can't expect to just to quickly beat the game in a few hours and be done with it. You will have to practice and get better to progress, that's half of that makes it fun. Or B. The graphics, which are some of the best on the ENTIRE PLATFORM. Have none of y'all ever played a roguelike/lite before?\n\nHelpful | 2", "joedav811 days ago\nEasy 5 stars, maybe the best on Quest\n\nTop tier VR game on mechanics alone. Usually not the biggest fan of roguelite games but this one doesn't get old to me because of the simple fun. The shooting, blocking, dodging, taking cover while peeking corners, etc. It is exhilarating. Having everything revolve around the bow is pretty awesome. The selecting of different arrow types, teleport arrow feels very nice along with the dodging shard and shield.\n\nOh yeah and this game is very hard. Once I started taking a more patient approach, I found myself doing better. It is just so easy to get overwhelmed by large groups of enemies.\n\nOn the PC version, you used to be able to toss the dodging shard way further than now which I preferred.\n\nThe graphics are absolutely great for Quest, draw distance is a little low but kind of adds to the atmosphere.\n\nExperiencing a bug where after tossing the shard backwards I kind of glide around for a few seconds and sometimes float up a few feet or off the side of a ledge and stay hovering. Not all that common, but kind of jarring and could definitely cause motion sickness.\n\nHelpful | 1", "JulianLJ14 days ago\nA great game!\n\nI have been mainly playing exercise games after the initial novelty wore off. That's until this game. Time just goes by fast when I play this game. It is a bit repetitive to go back to the same starting point each time you die. But so far it doesn't bother me too much, as I can find easier way to pass the level. I usually get motion sickness when I turn on free motion. Luckily for this game I am fine!\n\nHelpful | 1", "jesse.fletcher44 days ago\nWorth it\n\nSo much fun and the game has serious replayability. I've been playing a lot for weeks now and have only completed 56% of the game. By far the best VR game I've played.\n\nHelpful | 2", "PippiTex15 days ago\nBest on the Quest.\n\n8% in, just reached 1st save point.\nMy new favourite after the brilliant Phantom and Red Matter.\nUpdates are frequent (cheers devs)\nI'm an old fella but VR has me 16 again.\nHours of fun in this demanding and beautiful game.\nBuy now!\n\nHelpful | 2", "OncomingStorm75Jul 25 at 6:51 PM\nThe best actio game available right now\n\nAs it stands right now this is the best action available on the quest and the only action roguelike. As a fan of roguelike I love this game.\n\nThe bow combat is very good. Its simple enough to hit enemies, but to nail headshots consistently it takes good practice. Its also a good work out.\n\nHelpful | 2", "SansGluten1322 days ago\nJust buy it already...\n\nVery well done game. Challenging enough to make you want to start another run right when you die. But not too challenging . Developer involvement is great, and it sounds like they are committed to make it even better. Do yourself a favor and buy it already!\n\nHelpful | 2", "hankymanJul 25 at 12:54 PM\nTop-notch (pun intended) archery game\n\nI wrote this review for two reasons:\n\n1 - To give it 5 stars.\n\n2 - Various bugs have already been pointed out and I wanted to raise the one I haven't seen raised. That is the \"picking up\" of special arrows and health. It's really hit and miss. Sometimes it's a REAL pain, twisting my hands in all directions, trying to get the open palm required to then pull the trigger and grab the pick up. Please fix this.\n\nHelpful | 2", "DirtyHarryNZ16 days ago\nBetter than PC version\n\nAfter loving this game on PC when it released, this was one of my must haves on Quest.\nI can say that the game has been improved upon and this is a no compromise port which plays and look great on the Quest.\nThe shooting mechanics are great, replayability is through the roof and an amazing in game atmosphere.\nThis is a must have title.\n\nHelpful | 1", "cpattonz15 days ago\nOne of the best games I have played\n\nThis is a great game that the quest offers. The developers are great and keep updating the already amazing game. They listen to the community and implement our ideas into the game. If you want a fun game this one is for you. Amazing graphics and fun mechanics. It is a challenging game but it is totally worth it. If you are on the fence about this game go ahead and buy it and thank yourself later. I am having a blast and you will too.\n\nHelpful | 1", "theshinymonk16 days ago\nA gem on the quest must have!\n\nI got this game after hearing all of the good reviews and I always have loved archery in vr. I figured it would be decent fun. This game is freaking mind blowing and addictive as all heck. The archery is top notch, the balance of defense and attack are nothing short of perfect. The level randomness gives this game fresh breath the second you die and go back in. The difficulty is amazing as it starts off ok. Then you get more skilled and a few buffs then BOOM the game throws more at you and you find yourself having to step it up a notch to keep up. I highly recommend turning on smooth locomotion though I still mainly use the arrows it makes turning corners and small adjustments way better. I thank the dev team as they keep updating and making this game better and better. If you are on the fence about this game, then do yourself a favor and grab it. It's so easy to just hop into have some fun and stop when you want, or to play for hours on end. Only thing I would want to see would be some kind of version or update with firearms this rogue lite style of game play with random levels is perfect on the quest.\n\nHelpful | 1", "lotok15 days ago\nI am loving this game\n\nThere are some highlights to it.\n\nFirst its replayability. Many quest games are short and this one will have you playing for many hours.\n\nIt is quite difficult and there is no respawning, if you die, its game over. But then your actions before death cause unlocks which gives new arrows or baddies and overall makes it more challenging/different next time.\n\nLevels are not the same each time. They look sameish, but the layouts are all different so you cant just memorise where things are.\n\nThe game is quite creepy, the music and the enemies will keep you on edge. Some are much harder to kill than others and each time around is a challenge. The bosses are difficult and with no respawning it can be a frustration, but keeps you going back.\n\nHelpful | 1", "gi11ian.parr8 days ago\nI love this game! Addicted!\n\nIn Death Unchained is so realistic and intense! Get it if you love shooting arrows at peoples heads! Haha you wont be disappointed! Enjoy\n\nHelpful | 3", "DingBoyVRJul 23 at 11:55 AM\nBest archery game on the Quest!\n\nJust buy it! I love the bow and arrow mechanics and close quarter combat. You can play the different worlds over and over because they are procedurally generates. Definitely a 10/10 game.\n\nHelpful | 6", "paulohotlineJul 24 at 8:35 AM\nIn Death Unchained... wear a man diaper!\n\nOh my goodness. I have played over 100 hours in on the PCVR version and wish the devs would release some DLC that I would gladly pay for. So glad to finally be playing an updated version of this VR Slayer on the Quest. Thank you so much! Please keep working on it and release future DLC to keep the game fresh and exciting.\nUpdate: Having played this game for almost 4 hours now and almost past paradise lost, this game is every bit as fun as its big brother with just a small lost in visual fidelity. The sound effects are primo, and there is enough new features added to make it worth the purchase price. This game will keep you on your toes and make you wish you never started. Prepare to be slain in hell you dirty sinner! 10/10 Resurrections\n\nHelpful | 2", "Henlar00712 days ago\nAwesome game\n\nThis is the first game I tried when I got my quest. Love playing it more than any other I have. Just did an update to it that made it even better. Try it. I don't think you will be dissappointed.\n\nHelpful | 2", "SimplexPL18 days ago\nVery addictive and beautiful roguelike\n\nDisclaimer - I got the review key from the developer. But after playing for over 5 hours I think the game is worth its release price. It's a great experience on Quest without the wire. Game is challenging but rewarding. If you struggle to make progress, use the crossbow. It makes the game much easier.\nAlso the devs are constantly updating the game and it is already leagues better than on release.\n\nHelpful | 1", "Roboticus17 days ago\nAwesome Game\n\nI love elven assassin but wanted it to go further. This game is a realization of that.\n\nNow that they added multiple saves and other users can try it on my oculus, its a definite 5 stars.\n\nIts different each time. You can become stronger overtime through achievements, but they make the game harder too, so youre constantly climbing a ladder with each run through. And you constantly feel accomplished with every inevitable beat down.\n\nHelpful | 1", "Zuezema17 days ago\nBest Quest Game\n\nIf you like grindy games that will leave you with a sense of satisfaction and a pounding heart then this is the game for you. I cannot say enough good things about this game it's the best rogue-lite I've ever played. Each death you unlock more tools/damage to progress but at the price of harder enemies. The Devs are incredible at listening to feedback and there is a growing community on reddit. r/indeathunchained\n\nHelpful | 1", "g0daig0daig0dai18 days ago\nHands down, the killer app for the Quest\n\nWhen the Vive first came out, I couldnt get enough of the archery mini-game in Valves The Lab. The first app I bought when I picked up my Quest was Elven Assassin, because I was looking for that same experience.\n\nIn Death: Unchained just proves how I had no idea how good an archery VR game could be. The setting, the graphics, the movement controls, and most importantly the roguelike mechanics, make this an endlessly replayable, thoroughly satisfying arrow shooter. Kudos to this dev team!\n\nHelpful | 1", "XanderDee18 days ago\nKiller game with some issues.\n\nI agree with most of the 5 star reviews, this is the game you've been waiting for. Hands down best game on Quest and I spend a few hours a day on it. Some issues are:\n\nI've been experiencing a noticeable problem with tracking, grabbing the bowstring specifically. Also, clipping in corners of castle rooms.\n\nHelpful | 1", "vrhomeov19 days ago\nGreat game\n\nBtw anyone know how to \"blow up exploding head\" ?\nThere is achievement to do that but i dont know how to do.. I shoot that heads smash it by shield, but achievement 0% progress.\n\nTo Devs: Whats about to implement that achievements to Oculus achievements? Not in game only..\n- Can be nice to compare it between Oculus friends..\n\nHelpful | 0\nDeveloper Response19 days ago\n\nHi, thank you for the review and suggestions, Friday Aug 7ths update will fix scoring the exploding heads achievements! Congrats for getting to The Abyss so quickly and doing advanced things like these :)", "abomb61919 days ago\nLove this game!\n\nIve had this game less than a week and Im already racking up the hours. The movement took a minute to get used to but now I totally get it! The feel of the bow is very natural, and the freedom of movement allows a very cool and strategic approach. The movement can be a little glitchy at times, but corrects itself easily. Every time I leave the gates and start a new adventure I get those excited butterflies! Definitely my favorite action game on the quest!\n\nHelpful | 1", "Zydis8026 days ago\nCo-Op\n\nI absolutely love this game! Ive been playing it since it launched on Quest and cant get enough. The only thing keeping it from being a 5 star game is a lack of co-op play. Please please please introduce this as a feature or separate game mode. Keep up the great work!\n\nHelpful | 4", "MusetteVonWakenbake20 days ago\nEasily deserves the rating you see.\n\nI'm surprised it's at 4.9 at time of writing, and not 5.0 average. The devs have been working VERY constantly on this even post launch, unlike the prior devs. The game looks amazing, and in a couple weeks of patches, they managed to make it look even better. The game is perfectly addictive, with satisfying headshots and ragdoll physics, great atmosphere, fun bosses, and a constantly building game that gets longer and more difficult with each playthrough. My only minor complaints would be, the framerate will occasionally hitch in the Pit sections due to enemy count, getting the quiver power up to actually go on the stack is a little jank and I genuinely don't quite grasp how it's done, and finally I wish the smooth locomotion speed was literally two times higher, and or that it would be adjustable. I'm a Quake player, see, I can take fast movement even in VR. The teleporting shot movement is already very fast, so it's a shame that the movement otherwise is a bit of a crawl. I could use the dodge dagger a bit more, but it's not the right feeling I'm looking for in my movement. To be fair, I've taken the slow speed as a means of making the player get good with the teleporting, but even being good at that, it would be nice to get a little more pep in the step.\n\nHelpful | 1", "hilltoppotJul 25 at 7:24 PM\nJust as good as pc version\n\nGreat game. If u played pc version u won't be disappointed. Only difference is their is not as many enemies in areas but still enough to make it challenging (I read that more will be added in updates) and there is no crossbow yet but hopefully it will be added later also.\n\nHelpful | 2", "Thrackerzod_20 days ago\nLots of fun!\n\nThis game has some super fun gameplay and mechanics, the levels are very fun and challenging! However I definitely think it could be more immersive, considering there is next to no ambient sound design, which is everything in an immersive vr game. You'll notice this in the tutorial, where you go through a church/castle like structure, and there are literally no sounds of the environment when you move through the map. When playing on other levels there is a little bit more ambient sound, usually a constant windy noise, but I feel like there could definitely be more depth.\n\nEither than that the gameplay is fun and you can really tell when you're beginning to improve at the vr archery!\n\nUpdate: The developer has since added more ambient sound and I after playing the game even more I'm very satisfied!!! 5 stars :)\n\nHelpful | 1", "JemmyVonJude21 days ago\nGreat game\n\nLoving this title, here's all the reasons why\n-difficulty increase and equipments tied to your progression in each achievement, feels great to face stronger enemies as you improve\n-bow and crossbow handling is on point, aiming feels very natural and the teleport arrow for movement is excellent once you get the hang of it\n-random levels are great, and do look very good, not too maze-y either and they do make the game replayability go sky high\n-interesting enemies and lots of situations with many at the same time - your average ghoul is a one shot kill, but when there's a dozen, monks shooting at you and a knight coming under cover of a shield... it gets tense pretty fast Haha\n\noverall a must buy, great value for such a long and repayable game, go for it !\n\nHelpful | 1", "Elwinbu21 days ago\nA true technical achievement\n\nA lot of great reviews have already been written about this game, so I won't go over the basics again. Yes, it's an excellent rogue-lite game, but I think what truly makes it stand out is that it's a real technical masterpiece by the devs.\n\nNot only are the graphics great for the Quest, but the loading times are super quick: Once you die, within less than 30 seconds you see the scores page (with a nice graphical display of the enemies you've killed), and then you can go straight to the entrance to the level and start a new run. And we're talking about a procedurally generated level, with both open and closes spaces, tons of enemies, and no other loading times! That's truly incredible piece of work by the devs to manage all that on the Quest. I play some indie roguelites on my pc that load even slower than this game does.\n\nTo top it all, the devs are super attentive to people's requests, and constantly dish out game updates. My one major gripe is that I wish there was a better way to learn where to go next in the level, but the devs already promised they are working on that, so It's truly one of the few games on Quest that deserve 5 starts in my eyes.\n\nKeep up the amazing work you're doing devs!\n\nHelpful | 0", "Studly_McSexfire20 days ago\nAwesome!\n\nI love it. Man its fun. Locomotion is so smooth and comfortable. I dont understand why some other developers cant get the locomotion smooth and comfortable like this. Love the music and atmosphere. Graphics are real Easy on the eyes. Bow and arrow feel great. Cant stop playing so far. I know the devs are working on audio update but aside from that I find that I sunk into the stairs when ascending via locomotion. Hopefully that can be corrected. If not its a small price to pay for a great game like this.\n\nAwesome. Developers are fast at making fixes. The fastest. Thank you guys. Pretty awesome.\n\nHelpful | 1", "kev.seg20 days ago\nAAA game on Quest\n\nThis is probably the hardest game you'll play on the Quest but it's very addictive. The physics and controls are incredible. The gameplay is unique, challenging and exciting.\n\nThese are the elements that I would add to this game to make it more complete:\n- A practice zone where you can shoot targets or wave of enemies\n- The ability to customize the bow\n- Faster movements with the joystick (or the ability to change the movement speed)\n\nHelpful | 1", "Marx894121 days ago\nGood live-and-die game...\n\nI was going to complain about there being no walk feature, but I can see why we have it.\n\nStill, its good, and I dont regret buying it because of one thing that keeps me playing, BECAUSE IT SEEMS LIKE THERE IS NO END...\n\nThe thing that makes me play the game forever is that the game doesnt end, because if your playing Job Simulator and complete everything, you think to yourself: what now. This game has seemingly no end, and thats why I like this game\n\nHelpful | 1", "NightKnight032721 days ago\nBest game in the store.\n\nHello everyone, I originally left a review basically saying great game ,but fix these bugs. Well less than a day after I left that review Superbright said were on it and in less than a week I had an update fixing everything I had mentioned in my review. They werent even really big problems just things I found annoying, but superbright jumped right on it.\n\nSo I will say not only is this the best game Ive played on the oculus store, but also the nicest and most communicative devs Ive experienced as well. Thanks guys, keep it up!\n\nHelpful | 1", "luketcas11 days ago\nThis is by far the best game I have play\n\nReally not much more to say than that.\nI don't hand it five stars very often but this one gets it.\n\nHelpful | 4", "FioraFelicia25 days ago\nHighly Addictive and Fun\n\nAs someone who's been a avid FPS fanatic, having a change of pace and style is always a win win for me. I never thought I will have so much fun with this game. After playing for hours, this is undeniably one of the best OculusQ game to date.\n\nHelpful | 2", "geoffrey.milner.1215 days ago\nWow\n\nwow I like can't stop playing got to be the most addictive game I've ever played got to be 5 stars thought the game was too hard at first but once I started to use a combination of physical and controller movement I started getting more into it and now I can't stol\n\nHelpful | 0\nDeveloper Response15 days ago\n\nThat is so awesome to hear because YES, if you can combine controller + physical movement YOU become a weapon yourself! That's the most fun, dynamic and rewarding way to play we think!", "Wolfram4218 days ago\nBest game\n\nI love this game and it is by far the game I'm playing the most. One point to add may be the possibility of buying one-time checkpoint with gold. So if you die, you have a second chance before starting over.\n\nHelpful | 2", "Madworldofgaming11 days ago\nOne of the best quest games!\n\nI was skeptical at first watching the trailer just seemed okay but you have to play to understand how fun and addicting it really is! I've had my quest for years now and this game is amazing for it finally something like this came out. I recommend buying it now!\n\nHelpful | 1", "SacredTorment24 days ago\nAbsolutely fantastic\n\nThis game is awesome. Maps are different every time you play, various types of ammo, graphics are great, unlimited replay value, extremely challenging in the fact you have one life and if you die you start all over. Where this game really shines for me is the mobility. They really took advantage of the Quest being wireless. You have locomotion on the stick, a teleport arrow that you can shoot, a dodge crystal you can throw....pair all this with a 10ft by 10ft or larger play area for actual physical movement and you have unparalleled mobility that feels so real you will absolutely lose yourself in the immersion. Fantastic job.\n\nHelpful | 1", "SpelingBee25 days ago\nWhat an Amazing Game!\n\nIve spent the past several days playing this game with absolute delight and enjoyment. Its so well done!\n\nUpdate: The developers followed through quickly. The audio has been updated and its so much better.\n\nLove this game!!\n\nHelpful | 2", "singer.vincent24 days ago\nIncredible! BUT!!!\n\nI love this game. It is a little yank at times but the city gameplay is phenomenal and the most engaging immersive experience Ive had in VR\n\nMy gripe is that if you take off your headset any time other than when your I. The designated circle, kiss your game goodbye. I lose the guardian every single time and the only thing I can do is hard reset.\n\nPhenomenal game. Must have. The foundation is there and I cant wait for further updates. But this one guardian thing... Please fix that because it really impacts the experience. I cant answer my phone.., what if I have to go to the restroom? I had beaten 2 worlds and was on the final one was w 300k ish with several achievements.... and now I cant get back into play and if I hard reset its gone. Ive lost data thus way several times. Oh well, back to playing!!!\n\nHelpful | 1\nDeveloper Response23 days ago\n\nThank you for writing the review and describing your problem, can we ask you to please get in touch by email at hello@superbright.org?", "3rr_five_hundoA day ago\nMy favorite\n\nI played this on rift before I replaced my rift with the quest. I always missed this game, but no more. It is EVEN BETTER on the quest! You jump and spin, feeling like a legit ninja.\n\nHelpful | 1", "kinChelo3Jul 30 at 5:17 AM\nAddicting!!\n\nThis is the first game Ive actually felt deserves the time to review. Graphics and game play are great. This is the right direction! Its fun and its challenging. Thanks for a great game. Well worth the money. The only one thing I would request is that you figure out another way to pull up stats. When I shoot the cross bow, I place my other hand under my shooting hand to support for aiming accuracy. But my score opens blocking my view.\n\nHelpful | 1\nDeveloper ResponseJul 30 at 7:29 AM\n\nHappy you liked the game enough to write a review, that means a lot! Good feedback with the hand supporting the crossbow, thank you.", "flojim17 days ago\nNo words\n\nExcept my expectaption have been over passed by far\n\nHelpful | 4", "armeddrexelJul 29 at 4:27 PM\nHits the spot\n\nI cant recommend this game enough, I'm new to the quest (two months) and already felt that if it wasn't a rhythm game or a fixed placed shooter, I was going to get motion sickness. 'In Death' has changed that and I'm using the quest's full charge in one gaming session. The movment is spot on and feels great. The combat is seamless and satisfying, whether your going for head shots at distance or teleporting next to a templer Knight and gouls for some heart pounding quick arrow action. A very clever part of the game is its difficulty it starts off slow but as you improve with your trusty bow, so do the enemies. If you have read this review, you have already wasted time not playing this game. Buy it and feel like robin hood.\n\nHelpful | 1", "gemini197622 days ago\nGood game\n\nI wasnt sure what this was exactly but i am glad i bought it. It is really fun, you get 1 life and try to last as long as possible to beat your score.controls are accurate and didnt notice any flaws.\n\nHelpful | 2\nDeveloper Response22 days ago\n\nThanks for the review! Happy you like the game!! Can you please ping us at hello@superbright.org, we'd love to help other players understand what the game is a little bit better", "Avhaari21 days ago\nTimesink massochist maker\n\nWill make your arms hurt. but the fun will force you to continue and then your battery is empty.\n\nonly missing a guest mode as they will get annihilated on your only save. still 5 stars though.\n\nHelpful | 2", "KrautlockJul 28 at 3:41 PM\nA Must Own Quest Game!!!!\n\nI am absolutely amazed at this game. It offers much Replayability and it looks beautiful on the Quest !!!! I almost bought the Rift version and while reading reviews about it, I found out that the original developers had stopped updating their game,\nSo Im very glad I waited for the Quest version to come out!!! The New developers are really kicking out the updates, I got the third one today!!! The physics are wonderful and shooting the arrows is really smooth and fast, teleporting with the arrows is also\nPhenomenal. Everything runs so smooth and graceful, and I have not experienced any glitches yet!!! I am definitely hooked on this treasure of a game, so far I am only at 14% and have a high score of 20,851. As soon as I get a full charge back on the Quest, I am going back in to try and get below 1,000 on the global rankings!!!! All in all it is definitely a must own for your Quest experience !!!! I LOVE IT !!!!\nPlease keep up the great work!!!!\nAnd Thanks for a Superb Experience !!!!! Sincerely Yours,\nKrautlock.\n\nHelpful | 1", "captainmonoclesJul 28 at 2:52 PM\nThe best on quest\n\nAlthough there are other titles that compete or even beat this game on rift or other VR platforms this is easily the best game specific to quest period. The ever increasing difficulty and range of upgrades make every run a bit different. The game never feels repetitive despite having to start from scratch when you die.... And you will... Often. I've probably spent 60 hours or so on this game already and i'll bet it'll be 60 more (probably more) before I can beat it.\n\nHelpful | 1", "sebastian.kurz.583Jul 27 at 11:38 AM\nAwesome, get it!\n\n5 stars no doubt this is completely awesome!\n\nThe game has indefinite replay value due to the randomized level design, and is a blast to play on the Quest.\n\nI have never seen that crystal clear farsight on the quest - you can clearly see enemies shooting, incoming, far far away without being blurry or low-res or whatever - awesome technical achievement.\n\nIt has mystical gothic-style environments, within the monasteries mystic fog and gothic crosses, which looks breathtaking. The enemies are really spooky and threateing! The visuals are top-notch.\n\nIf you are only interesting a little in archery or crossbow shooting performed in a lord-of-the-rings fantasy like environment, get it!\n\nHelpful | 0\nDeveloper ResponseJul 27 at 3:44 PM\n\nThank you so much, and you will be pleased to hear that we're still working on the visuals and they're going to get even better :) Our ambition is to be THE Quest title in terms of visuals and we've spent a lot of time getting to this point and we're not stopping!", "ZedisnotdeadJul 26 at 8:01 PM\nAmazing\n\nThis is the best game I have ever played. I have only had it for 3 days but it is literally all I think about for spare time ......I have a wife and seven kids add you so.....this game is absolutely fun and worth every penny ....brilliant and inspiring for future games to be this good\n\nEdit. I would love to see in the future updates that add the ability to add more profiles...if I want to show my wife or kids this game I want them to start where I started ....still the best game I have ever played\n\nHelpful | 1", "Meh-DJul 27 at 6:02 PM\nI want swords\n\nPls put swords in this game. i love it so much. and u should add different rarity weapons and loot. this game has the potential!!!\n\niloves it\n\nHelpful | 4", "JedalisJul 26 at 9:50 PM\nArchery Gauntlet in VR\n\nExcellent game. First review I have made and its because the game is hard to put down. Very satisfying to find an angle and get head shots. I love that your progression is linked to your skill. You want to come back for just one more round! If you are even remotely considering it, just get it.\n\nHelpful | 1", "mcmc9892 days ago\n\nWell executed, fun & addictive game play! You can play a quick pickup game or until ur battery runs out. The developers keep this game fresh with the constant updates.\n\nHelpful | 1", "adam3i4 days ago\nMy Favourite!\n\n100% my favourite game on the quest, make me feel like an archery bad@ss, this is how hawkeye must feel when he clears a room of bad guys with just head shots, i love it.\n\nHelpful | 1", "PurplemikeyJul 26 at 7:36 AM\nA game to own\n\nIn death is a loop where you constantly die, restart and do better than the previous run. The more you play, the more achievements you will unlock. They come with perks that will introduce new enemies, new levels, new items, new bonus, new skills... Basically you get more the more you play. Which is an awesome concept.\n\nThe visuals are great and doesn't look dated next to the other quest games. The presentation is very pleasing to the eyes and the sound track is subblte but very nice to the ears.\n\nAfter a few hours in the game I can say that this is a title to buy so you can jump in and have some fun when you don't want to/can't go online or don't need a game that involve too much thinking. The game is fairly simple to get into but very hard to master. Take your bow/crossbow and kill enemies until you die.\n\nThe smooth locomotion was added at the very last minute when launching. Saved a lot of complaints in my opinion. But it comes with flaws. Everything in the game is so well done that smooth locomotion shows it was rushed to get there in time. Sometimes you will see your arrow jumping back and forth, sometimes you get into the ground a bit (feel smaller),... Nothing that cannot be fixed with a patch.\n\nI really need to comeback on the fact that they added this based on testers feedback. Which mean they listen to feedback.\n\nGreat game, great devs. It's a buy now.\n\nHelpful | 1", "nick.traxler.94Jul 25 at 9:03 PM\nAmazing\n\nThe graphics and the gameplay is amazing and pulls you in. It will make you feel like a unstoppable underworld version of Robin Hood. Amazing sounds also made me feel so alerted all the time. Best game I have played in years. There is so much replay ability that its so hard to fathom. A must buy for any quest player.\n\nHelpful | 1", "Pburg45Jul 26 at 4:49 PM\nJust buy it!\n\nThis game is amazing! Do yourself a favor and buy it! It's so much fun. If you're on the fence, just pull the trigger. You get the 2 hours of trial time in case you decide to return it. You probably won't though and end up playing it for 4 hours straight because it's such a freaking awesome game! I give it 5 stars because it flat out deserves it!\n\nHelpful | 0", "stormshadow612Jul 24 at 11:25 PM\nAwesome game !!!!\n\nI literally wouldnt have bought this game if it didnt have free movement in it. so Im glad it does I cant stand teleport only in VR games. its a awesome game. Great job guys on bringing something new to the Quest. Also the audio needs to be louder its a little dim. Its the closest thing were gonna get to dark souls VR for now.\n\nHelpful | 5\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates which fixed all these issues, we also now have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "Qed0023 days ago\nMasterpeace\n\nThe game is on of the best rogue-lite title you can find, highly recommended.\n\n+ Well polished.\n+ Bow mechanic is very satisfying.\n+ Graphics are above average for the Quest.\n+ High skill floor and skill cap.\n\nIt is a shame that the devs let the PC version die.\n\nHelpful | 0", "KaystonJul 25 at 4:50 AM\nSimply excellent\n\nIm usually not a fan of bow games (Im just not that good / coordinated with them) but have this a shot because of the rouge-lite aspects and I am not disappointed! I love how there is no gear to collect, no grinding for upgrades, just you and your bow different arrow types that allow you to change your style of play (adding strategy). The bow mechanics feel great and the game strikes the right balance of forgiving and punishing. I can see myself playing this for months.\n\nHelpful | 1", "Robertobob100Jul 25 at 11:55 AM\nVery addictive! And great gameplay!\n\nI'm just going to say very addictive and great gameplay! I'm going to just jump straight to the feedback. Now understand that I could write a whole review about the positive stuff as well, but I just have some things I wanted to point out:\n\n-I understand that it's a large game so you had to cut back on graphics but I feel there could be more of a variety in designs of the levels\n\n-there is hardly any audio besides hitting enemies. I think there needs to be more background sound. Maybe it could change when you get close to enemies, I think that would add a lot to the game.\n\n-I feel like the behavior of the enemies gets repetitive. Like maybe there could be 3 or 4 different things for each type of enemy that they randomly chose.\n\n-and I also feel that there isn't enough enemies\n\nNow just remember that I rated this game 5 stars so there is plenty of good things about it right? I just wanted to point out some things that I hope get fixed.\n\nThanks for an amazing experience,\nRobert Turner\n\nHelpful | 1\nDeveloper ResponseJul 25 at 12:07 PM\n\nHey Robert, thank you for the review and the feedback. Well be updating the audio, its great to hear from our players and know were working on the things you guys want! Have a great weekend and see you soon in upcoming updates :)", "meganwalkerJul 24 at 6:06 PM\nAddictive game\n\nI had no experience with this game prior to it showing up on Quest. Before it did, I jumped between Arizona Sunshine and Death Horizon Reloaded. But for the last two days, I have been only playing In Death.\n\nThe way it regenerates every time you die means you are exploring everything all over again. I hour several hours in the game and I am only at 20%. It is different than other exploration style games, because you cant save your weapon upgrades. That took me a minute to get used to, but now I have adjusted and dont mind it. Finding ways to get a little further in is super fun.\n\nI only have two pieces of feedback- Give is a couple player slots (seriously) and I would love to see a multiplayer port.\n\nOverall, one of the best games on the Quest!\n\nHelpful | 0", "ddc7017 days ago\nA failed masterpiece...\n\nSo much about this game is great! Its immersive, exciting, atmospheric, but ultimately hugely frustrating...\nTheres no was to save progress and although that in itself is not necessarily a bad thing, if youre going to make that a feature, then progress MUST be more achievable than it currently is.\n\nI finally defeated the big bad at the end of level 1, which, let me tell you even for an experienced gamer is highly difficult; around 2 dozen archers and zombies coming at you from all directions in a confined space as well as the fireball chucking big bad. After somehow getting through to the next level I swiftly died via flying cherub archers!\n\nNow, all of this is fine. Difficult boss fights and new level surprises that whip your backside are part of the fun. BUT whats not fine is that after dying on the 2nd level guess what...? Thats right, you start right back at the very beginning.... Arghhhhhh!!!\n\nI thought it must be a glitch in the coding, but no, theres a new banner telling me that I must reach and defeat that big boss 7 times before the receiving the privilege of starting at level 2 after dying. You read that right, 6 times... six...SIX... S-I-X...!!!\n\nEven if I could (which I cant) do the level and defeat the boss 6 times...why would I want too? Wheres the fun in doing the same thing over and over? This really is lazy game design: Were worried that you might get through our whole game too fast, so well just make you do it all 6 times... ... ... ... ... ... ... ...\n\nNo... No i wont... ... Its at this point that I exited the game and purchased ONWARD (which also boasts multiplayer - something Death: Unchained lacks).\n\nI may have a quick look at Death Unchained from time to time in case they fix this horrendous decision, but as soon as my oculus needs storage space itll be the first thing I delete. A shame, because the game and playability is a real hoot, but they shouldve named it In Death: Groundhog Day...\n\nHelpful | 12\nDeveloper Response3 days ago\n\nUpdate - we have a discord now, come chat with us, we'd love to hear your feedback directly and we have a ton of nice and helpful players there too who are posting tips & tricks - https://discord.com/invite/9xMrHdp Hey ddc70... sorry to hear you didnt get much out of the game but thank you for taking the time to do the the review and feedback! While the main part might feel repetitive - its the property of its genre - roguelites... however, progressing in the game unlocks a ton of new things over time - new kickass dangerous areas with great loot, new enemies, weapon, arrows, even whole worlds. You can also unlock starting from the games two new worlds, theres a new contest going on and a new game mode coming up, were working hard on making the game interesting and evolving and just fun for our players... If you have any more feedback or thoughts please reach out to us at hello@superbright.org as we love hearing from our players, even if they dont like the game - were always trying to do better", "Rickbaron20 days ago\nIn Death\n\nIn Death may be the best game ever! The updates are making it better. DEVELOPERS, please make the shard throwable. If you want to play the best arrow shooting game, BUY THIS IMMEDIATELY! Very satisfying! Fun! Limitless replay ability!\n\nHelpful | 1", "BellringerQuinn18 days ago\nAmazing\n\nIt can be a bit scary at times but it is worth it. This is a great game.\n\nHelpful | 4", "34thughes12 days ago\nGreat game!\n\nA must buy! The only thing that could make it better would be some sort of multiplayer PVP mode! That would be insane!\n\nHelpful | 2", "SamiDaly22 days ago\nI love this game.\n\nI keep figuring out how to get better and better. Being able to advance as you satisfy achievements is great - gives you goals and increments your game play.\n\nHelpful | 2", "djblondon8 days ago\nAddictive!\n\nGreat game, very addictive and realistic elements. Also very atmospheric, very pleased I bought this one.\n\nHelpful | 2", "bornsideways8 days ago\nBEST GAME ON THE QUEST\n\nVery immersive and very addictive!\n\nHelpful | 3", "teamNONINAn hour ago\nThe way it was meant to be played.\n\nI bought this for PSVR awhile ago, mostly out of boredom, and doesn't expect to like it. It quickly became my most played game. It's such a challenging game, and the biggest drawback it had was PSVR tracking. It's an intense game that forces you to overcome the odds to play it. You can quickly become overwhelmed, and in that state, you (more specifically, me) unconsciously turn your body, and I died so many times because I was turned and the tracking would go haywire. There were also issues using the bow. I never beat the first boss on PSVR but on Quest, it only took me 3 tries. Beyond tracking, a great improvement is how the teleport works, which now generally assumes where you wanted to teleport even if your bow didn't hit the exact spot. If you shoot up towards a roof, and your arrow lands in the upper wall, the game assumes you were trying to move onto the roof, which was not the case before. A change I'm not a huge fan of is the teleport shard. In the older versions, you could throw it a pretty vast distance, but on Quest it will only move you about 2-3 feet. I'm fine not having the same distance as before, but this feels too short. Especially since if you start becoming overwhelmed, sometimes using you teleport arrow means death because you have to ready the bow, shoot it, and wait because it isn't instantaneous. It still takes a moment after landing. If enemies are in a 10 ft. distance, chances are you will get 1 or 2 hits before actually teleporting. If the shard could go 10-20 feet, I feel like that would be a happy medium between the two, because In its current state, I don't use the shard. Another gripe I have for all versions, is having the health pickup in the boss' quarters. If you go in with full health, you wont be able to use it because once the fighting starts, you can't reach the health pickup. It would be nice to use that as a reward for having full health, by making it reachable in the chamber, then you could use it when needed. - beyond that, I really do think this is one of the best Quest titles that deserve your attention. This has always been a game that I hoped would be ported to Quest.\n**UPDATE** I'M addicted to the game. I appreciate how attentive the developers are, who seem to be very responsive and open to suggestion. I would recommend this game to anyone. I will stick with this game through ups and downs because I have faith the developers genuinely care about feedback. With that said, the past update brought a few problems and I'm curious if anyone else is experiencing the same issues. I shy from going into too much depth because I wonder if it makes more sense to address these things in emails to the developers, because I'm not sure if they are issues unique to my experience. Without going into too much depth, I have been experiencing bugs with the movement, where sometimes after teleporting, standard locomotion becomes stuck, and the teleport shard becomes inoperable, and movement only becomes possible after shooting another teleport arrow. It can be really disheartening to have a great run, and then receive multiple hits because 2/3 of the movement options become unavailable. I don't want anyone to count this game out because of these issues because I know the developers to be responsive and have genuine care with how they handle the development of this IP. I would easily say this is in my top 3 on Quest.\n\nHelpful | 0", "YekkeMaximus12 days ago\nJUST WOW!\n\nThis game is amazing! Beautifully made and will keep you wanting more.\nDefinitely a must play!\n\nHelpful | 2", "MorrisParadiseJul 23 at 2:38 PM\nWow\n\nJust wow, great game incredible mechanics. Maybe some dialogue and background story could improve this impressive game.\n\nHelpful | 4", "mattwilkin24 days ago\nIn Death\n\nA great game for a quick game or spend more time in intensive archery training. The changing environment makes this game interesting every one you play. This is a reasonably high skilled game that is achievable with practice\n\nHelpful | 1", "635112 days ago\nEh, its alright\n\nIts not like its my favourite game or anything, with infinite playability and fun boss fights... oh wait.\n\nHelpful | 1\nDeveloper Response2 days ago\n\n:D At first our hearts sank but then... :) Thank you <3", "held0815juniorJul 30 at 3:18 AM\nVery good game\n\nI love the game. It's very good and I love it on the Quest. It's fantastic and everyone who likes rogue-like action games should defenitely try this game out\n\nHelpful | 2", "TlouskyJul 24 at 10:17 AM\nGreat procedural fantasy shooter\n\nIt's really amazing how such a simple game (compared to modern AAA shooters) can be so much fun on VR.\n\nI can totally see myself spending 30+ minutes a day playing this, even if more than anything it makes me really yearn nostalgically for a remake of ID software's Heretic and Hexen in VR.\n\nHelpful | 4\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "l3rianK11 days ago\nAwwsome game\n\nA lot of practice required to get better and better at this game. Be patient with the game and use your strategies! Youll end up loving it.\n\nHelpful | 1", "wskamounJul 27 at 5:30 AM\nGreat game\n\nGreat game, could benefit from more enemie types and more weapons, but base environment/ mobility is fantastic.\n\nHelpful | 3\nDeveloper ResponseJul 27 at 9:48 AM\n\nHi, more and different enemies unlock with progress and in the game's other worlds, including three bosses, and a ton of different arrows that make the game more exciting! Keep playing, it's all waiting for you :) Cheers", "SmallyBiggs23 days ago\nAmazing, my new fav game on quest!\n\nExcellent physics, beautiful environments, a variety of enemies, this game is AMAZING!!!! Easy to learn, hard to master, ive spent so much time in this game already. Buy it u wont be disappointed!!!\n\nHelpful | 1", "CaptainFandango6 days ago\nAn OUTSTANDING port of an amazing game !\n\nIn Death has been one of my favourite games in VR for quite awhile now, however thanks to a less than excellent PC yielding inconsistent quality and a natural hatred of the wire Ive always felt like the game was just short of brilliant. That is, until now...\n\nTo say that this port pushes the limits of what I thought was possible with the Quest is an understatement. The team at Superbright have done something truly magnificent here and I cannot applaud their work enough.\n\nGraphically, the game absolutely exceeds my expectations of what a quest port would look like. As far as gameplay, it is identical, if not better than the PC original. The audio is atmospheric and despite other comments that Ive read, the spatial audio has not let me down once. This game achieves on every metric that matters.\n\nIn short, not only is it every bit as good as the PC version, but with the few additional bits of content, a renewed commitment and energy from a new dev team, and the always beautiful removal of the wire, I would go as far to say that it is an improvement on what was already an amazing game.\n\nThe only word of warning I would put in this review is that the game is quite difficult, and you dont start to see the real payoffs in terms of the rogue like mechanics until youve played it for awhile. When I first bought the original I was initially underwhelmed and came very close to returning it. After a little bit of perseverance however I found myself enjoying one of the finest drop-in play session games available in virtual reality.\n\nAlso worth noting, In Death is a bow shooting rogue like game. If youre not into shooting bows, and/or you find the Perma death play system of a rogue light frustrating then you probably wont enjoy this. Everyone else, stop reading and buy it!\n\nFor my money this is an absolute gold standard in both bow shooters and rogue likes for the Quest. It is also a real clarion call to other developers as to the standards that we can now expect for quest titles. Well done superbright, youve done an amazing job!\n\nNB: Just as a final note I generally dont give five stars, but this came pretty darn close. Dont be put off by the four stars, the game is a 9 out of 10 if we could give more accurate scores.\n\nEDIT: Thanks for responding Superbright! Yes, the updates, competitions and challenge mode that youre putting in are taking an amazing game even further. I love it, keep it up. .\n\nI must say, the commitment to the game and the community that youve shown so far absolutely outstanding! Youve joined Mixed Realms in that gold standard catagory for engagement and aftercare, and youve got yourself a customer for life here. Out of curiosity, are there any thoughts on including support for the Bhaptics vest?\n\nHelpful | 1", "BoredSkydiver5 days ago\nGood thus far\n\nI've made it about 17 percent through the game so far and its been interesting and fun. Im holding out the last star for now-that may change- because the amount of health drops in this game is brutal. I've played dark souls and bloodborne but this game can just be totally unforgiving at certain areas! Will update when I progress further in game.\n\nUpdate:37ish Percent through the game. The weapon abilities/unlocks have definitely helped with progress with the game in general! Health is still an issue but less-so when you can destroy enemies with more powerful weapons at range. I stand by my 4-star rating for now but will update again when I get through the 40 percent marker/unlock section and play through it. Overall, I'd still suggest buying this game!\n\nHelpful | 1", "Rubeus-EdenJul 26 at 4:58 PM\nAddictive, but...\n\nThe PSVR version was very fun, and the Quest port is really good as well.\nBut after a while it gets too frustrating and a bit boring that you always have to repeat the first level, before you can reach the second (very hard) stage - and the first one is (and keeps on being) hard already.\n\nSo can you please unlock a direct gate to the second stage after reaching 20% or so - similar to the Abyss? Would appreciate it a lot. Otherwise I'll probably stop playing, because it's not fun enough, if you don't make progress and always see the same.\n\nHelpful | 3\nDeveloper Response9 days ago\n\nHave you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! The game also unlocks a lot of stuff as you play - new enemies, weapons, you can also start from a different world once you unlock them... Anyway, you can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "andresmgsl2 days ago\nMuy favorite Game un Quest\n\nThis is an amazing an extraordinary game, i really recommend it ti all the Quest user's\n\nHelpful | 1", "psully4114Jul 24 at 8:34 PM\nPretty good.\n\nI can honestly say that this is mostly what I had in mind when I bought a Quest. I've been waiting a rogue-like or an rpg of some kind for like a year and I havent played anything quite like this. My only issue is the lack of weapon variety. I get the game is really centered on ranged combat but the bow and arrow is a bit janky and unreliable cause you cant really hold the controller close enough to your face to properly aim with the tracking freaking out and I'll say it again for those that didnt hear me the first time. Give me a procedurally generated map with some skeletons or something to fight with a sword and freelocomotion and the $400 I paid for Quest was everything I hoped it would be.\n\nHelpful | 3\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming! Hi, thanks for the review and feedback! Ranged play is what In Death is all about, but the variety actually comes from the different arrows that drop when killing the enemies, you can actually hit the enemies with your shield, but whats the coolest to us is if you have some free space, your whole body becomes a weapon where you can shoot from behind the corners, dodge, duck, step back and so on! As for aiming and losing tracking, you will find that the bow doesnt need to be drawn too far back to reach maximum power....meanwhile, please know were listening and were definitely looking at making things better in this and other areas of the game. Thank you for the feedback again!", "Majestic7625 days ago\nInsane Death\n\nThis game is great it takes a bit to get in the zone but when you do oh boy. Its different and very challenging i love it.\n\nHelpful | 2", "Teardrop3D8 days ago\nSimple but addictive\n\nIt's pretty one note but somehow the more you play the more you want to keep playing. Even though the whole point is to die and keep trying. Kinda want to checkout the Roft version to see if the graphics are that much better but TBH once you're focused on killing the guys running at you pretty graphics is the last thing in your mind\n\nHelpful | 0\nDeveloper Response3 days ago\n\nSpeaking of the Rift version, the Quest version has the same numbers of enemies as the PC, while the Quest version has fixed a lot of the problems and added new things, like a whole new world, new enemies, arrows, contests. What do you think is missing for the full rating for the game btw? You can always email us hello@superbright.org and tell us what you think!", "qazityqazqazJul 27 at 5:19 PM\nAn Absolute MUST HAVE for the Quest!\n\nI'll just start off by saying this will absolutely become a 5 star review if the only real issue I have with the game gets patched.\n\nFirst the Pros:\nThis is a very easy to pick up but hard to master game with seemingly endless replay value. I found myself in my first ~10 lives missing shot after shot after shot and immediately getting swamped by enemies. Not fun, but it taught me real quick to work on my aim and positioning. Once I started actually landing a good amount of my shots, holy cow does that feel good! Progressing through achievements and getting more and more powerful unlocks feels incredibly rewarding, and most of all this game is SERIOUSLY addictive!\n\nNow the Cons:\nI think this game could definitely benefit from at least a very superficial level of lore in the form of notes found around the world or something to that effect. I found myself wondering why I was here and why the enemies were here and I would like to be able to find some understanding of that. That's just a small nitpick though my only real issue with the game is the sound design. A giant Knight of Templar in his chain mail should not be able to sneak up behind me! If enemies were more recognizable sonically, this would be a five star review without any question. The main complaint I heard reading through reviews before purchasing was about the ambient sound and I think I disagree with the people complaining about that. I think how quiet this world is really helps produce a feeling of loneliness and desolation, which I think is intentional. I know personally it contributed to me feeling on edge and very weary of any enemies I came across, which in my opinion is a very good thing due to the tone of this game.\n\nAll in all this is a game that you should have on your quest if you dont already!\n\nHelpful | 3\nDeveloper Response9 days ago\n\nHi, curious if youve had a chance to try the game again because weve updated most if not all of these issues! Would love to hear what you think now and you can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "Kissenschlachter9 days ago\nAlmost perfect game\n\nThank you so much! I love this game. Things missing for the fifth star:\n\n(1. Using the crossbow, it often happens to me that Quiver restocks ammunition to the wrong arrow slot (outer instead of inner). Please fix that bug. [Update: FIXED])\n(2. With smooth locomotion, after going upstairs sometimes I get as small as a hobbit. [Update: FIXED])\n3. Entering the tutorial with a crossbow should start a the tutorial with a crossbow. Important for guests. Please.\n4. I hate artificial turning, even by accident. Please have a third option to it which is just to turn it off.\n\nWonderful updates! Almost there for the fifth star!\n\nHelpful | 0", "mattqgraves9 days ago\nVery Quick and Straightforward review\n\nGood: Awesome game, great to come back to over and over, very addicting to progress. Love it. Very worth it\n\nBad: Glitches: arrows will sometimes go through heads after hit, when using the stick movement, if you fire a teleport arrow into a wall or something just above floor surface you cannot use the stick movement or the quick teleport to move at all, frustrating when dodging. Only way out is a teleport arrow.\n\nTeleport arrow can sink you into stairs while using stick movement.\n\nI understand you have a correction method for when people physically walk through a \"digital walls\" in game. But this has a bug that sends you outside the walls when fighting and physically dodging. But I guess that could be exploited to escape if overwhelmed \n\nOverall fantastic game that I didn't know of until it hit Quest. This is a real must have game, especially good to show your friends and have them jump in, they'll love it!\n\nThey also updated recently and pretty frequently. A+ developers too\n\nHelpful | 0\nDeveloper Response9 days ago\n\nHey Matt thanks for the updated review, we can see youre doing really well in the latest contest. Can we ask you to get in touch through hello@superbright.org to talk about those glitches? Wed like to fix them asap and it seems like your feedback could really help!", "49ersfan17231989Jul 25 at 6:10 AM\nMy fav psvr made my by a quest.\n\nIn death improved buy this game. Just beat the first boss no damage taken didnt count for my trophey and my one more health bar gain, the psvr with gabriel the fallen had the same problem hope it gets fixed love this game.\n\nHelpful | 1", "mrdeathwish9 days ago\nI got one issue!\n\n1 issue, just the one and it costs you a full 5 stars.....\n\nI love this game, the mechanics work well, the procedurally generated levels.\n\nIt looks good, feels good but,\n\nHow the hell are you supposed to get those kinda high scores? What is the score system? I've tried everything from going through it as quick as I can while completing pits and killing anakim and reaching paradise lost within 20 min while killing enemies with headshots multi kills, with almost all the arrows in the game and I still have only nearly reached a score of 200,000 is there something I'm missing here? Sometimes I go through it rapid, headshots all the way and get a score of 80,000....i don't get it.\n\nHelpful | 1\nDeveloper Response8 hours ago\n\nHi mrdeathwish - we now have a community-made discord channel where players are exchanging tips - https://discord.com/invite/9xMrHdp and the #1 player is even posting videos of their play, come check it out!", "MoonMilitia14 days ago\nArchery!\n\nAll ye bully rooks best ye run, best ye run, faster than mine arrows.\n\ndispatching foes with mine longbow of yew is some of the best fun I've had in VR.\n\nHelpful | 0", "CharlieBravo74122 days ago\nIncredible\n\nGreat graphics and gameplay and very fun. Can be challenging dont play if you rage quit often\n\nHelpful | 2", "HeadlessS3625 days ago\nLove the game\n\nIt is a really good game that I enjoy playing. My only concern is that even if the maps are different each time its more or less the same thing. If there was a chance for multiplayer or possibly more difference in the maps appearance with some more variety I think it could keep it a lot more fun. And Im not sure how this would work but possibly more weapon choices other than crossbow and bow? Or possibly upgrades for the weapons other than just different ammo?\n\nHelpful | 2", "Tannk100Jul 25 at 7:28 PM\nAddiction!!!\n\nLiterally makes you just never want to leave the game even do your arms start feeling like they weigh a ton. Love how the show your world wide place like nice im just 655 under #1. Simply Amazing\n\nHelpful | 1", "Slayden-The-2ndJul 24 at 5:05 PM\nAmazing Game!\n\nThe game is amazing but I think they could add a little more to the sounds in the game, besides that, it is an amazing game!\n\nHelpful | 2", "jdavispfg23 days ago\nGreat game\n\nThe game is good. The only thing I do not like is when I get to another level and die, I have to start over again. I do keep getting better and father each time.\n\nHelpful | 1\nDeveloper Response23 days ago\n\nIn Roguelites like Unchained you can expect start from the same place but get new unlocks that change the gameplay - permanent hp increases, new enemies, new weapons etc. However, if you unlock 40% progress you can start from The Abyss, and soon we'll have even more options and a new game mode!", "louisleblin8 days ago\nAwesome, co-op would make it perfect\n\nReally cool game which makes me want to share the experience through a co-op game mode\n\nHelpful | 1", "DEETZBOYWONDERJul 28 at 11:00 PM\nIt's a fun game but\n\nIt says it's a rogue lite but I don't feel that at all those games are all bout making builds and basically you just get different arrows and a crossbow so far no armor or skills or classes , you're an Archer that's your class option just wish I could make a sneak build or a warrior one or mage etc. But the archery physics are amazing I'll give them that which is why I won't return the game and hopefully there will be some updates because another thing that kills me is you have to pause to switch the hand you're using for the bow and a half hour in your arm will get tried and you'll want to switch which in many other games you just grab it with your other hand but maybe a dev will read this and fix that issue also dodge mechanic is gold definitely play the game if you want a challenge but don't expect to make your own build\n\nHelpful | 4\nDeveloper Response9 days ago\n\nHi, curious if youve had the chance to try the game again lately? Weve fixed and updated many things, we have a new awesome contest going on and a weve announced a new game mode on reddit and our social media! Ping us at hello@superbright.org - wed love to hear your thoughts! (Update - btw, magical arrows are the game's spells, just without the complication of more controls to learn! they're naturally easy to cast short and long-range - you can set traps, spread poison, cast AOE that amplified damage received by the enemies) Thank you for a detailed review, appreciate the feedback! We started as fans of the original IP and over time you get physically stronger and better and making those shots, it's FUN and you really get better, it's not 'stats' that make you hit targets! Oh and there are updates coming with a new game mode to keep things fresh, multiple player profiles and more. Stay tuned, we're working on more things!", "john-dick14 days ago\nGreat Game, with a few minor complaints.\n\nLove the game. I'm a huge fan of roguelikes, and was eagerly anticipating this title. The archery feels very fluid and natural. Before release, I was a bit skeptical when I heard it was arrows only. I really wanted to crawl through a dungeon with loot drops and weapon choices. But you sold me on it once I played it. Do one thing and do it well, right.\n\nMy gripes can probably be narrowed down to design choices and aesthetics. Trying to fit a game that pretty on the Oculus Quest has its challenges, I'm sure. Still, I would have loved to have seen more variety in the environment. Probably my biggest complaint, however, is the movement speed when walking. It definitely needs to be faster. I feel like I'm walking through tar or something. You can move quickly with the teleport arrow... but the free movement just feels out of place being so sluggish. I understand that many out there still don't have their VR legs, and might prefer a slower movement rate to avoid motion sickness. But there are a lot of us out here who enjoy twitch gameplay and quick speedy movement. Please, at the very least, consider a movement speed slider for us. As people become comfortable with VR, our numbers will only grow and this kind of movement speed will seem antiquated. I would love to see this game age well.\n\nHelpful | 1", "DingChing14 days ago\nGreat!\n\nIts very funMust have it\n\nHelpful | 2", "simonhughes22Jul 29 at 11:57 AM\nBest game on the quest\n\nI can't get enough of this game. First quest game that has consistently me coming back for more\n\nHelpful | 2", "ortim2316 hours ago\n\nI like it very much I play for hours\n\n\nHelpful | 0", "CrypticKiss15 days ago\nDeath of thousand arrows\n\nExcellent gameplay and exciting game!\n\nThis COULD be my new favourite quest game if it was not SO hard! I hope the developers are working on a solution for this problem. I'm not a young person anymore and I cannot spend 8 hours a day practicing. And at this stage I'm beginning to lose a bit motivation for the game already, because I will probably never be able to see the other levels and finish it!\n\nBesides that ( big) problem, I love the game...\n\nHelpful | 1\nDeveloper Response9 days ago\n\nHi, thank you for the review and feedback, we really appreciate it! We are working on a new game mode that's going to make it easier for players with less time to have fun with the game's most fun elements, shooting targets in beautiful environments (while giving more advanced players another way to push the game's limits). Stay tuned, and look out for the hints on the Oculus Blog, this is a game best played more cautiously in the beginning for sure :) Thank you for playing!!", "Bolsen.nzJul 27 at 1:28 AM\nEnjoyable and..\n\nIts challenging, has good enemy design and an interesting atmosphere. I havent put in more than an hour and a half yet because Im deciding whether to refund. Problem is, it seems more like a proof of concept rather than a self contained game. Its vaguely reminiscent of the pc Diablo 1 game with its randomised levels but these level layouts have no differentiation throughout each map generated. Its more like a base game engine that they could have built a world from and because of that, Im not seeing the price justified. Additionally Ive got lost and ended up at the start of the map more than a few times. Ive since assumed the little fairy light is to help with direction but it hasnt been explained as far as Im aware. Would feel better about keeping this if it was cheaper.\n\nHelpful | 4\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!! Thank you for the feedback! It might be interesting to know that the game adapts as you play, and progress unlocks more and different enemies, another weapon, and a lot more magical arrow types, and has two other large worlds and exciting bosses. Please let us know if you had a chance to play it more!", "Rize-19 days ago\n\nThis is a great game But PLEASE ADD MULTIPLAYER\n\nHelpful | 2", "themidgetsmanJul 23 at 4:09 PM\nVery fun game and never ending\n\nWe need multiplayer and free locamotion.\n\nHelpful | 3", "veryaltgaming17 days ago\nGood gameplay - no story\n\nChallenging and really fun to play, but no development or achievement other than keep going and killing.\n\n100% worth playing still.\n\nThe different arrows functionality and effective range is quite hard to gauge, I'd recommend including a shotting gallery where we could practice then as it's quite taxing doing that in the actual game.\n\nEdit: added another star to the rating for the super responsive develop team that keeps improving the game. You guys are rocking this.\n\nHelpful | 1", "brett.rutecky24 days ago\nGood port but lacking these days\n\nI loved In Death on the Rift and when I saw this game was finally available for the quest I was quick to pick it up. Unfortunately while it is still a great game I quickly realized that what was a great game a couple years ago is kind of behind the times these days.\n\nToday VR games have depth, a story, better graphics and sound. In Death Unchained adds next to nothing new and is exactly the same as the old Rift version, with all the good, and the bad (such as lack of story, graphics, and audio). The sad truth that what was a good game a couple years ago is now behind the times when held up to today's standards.\n\nHelpful | 3\nDeveloper Response9 days ago\n\nHi, have you had a chance to see the new updates, the new archery contest and the game mode weve announced? Were working hard on making the game better and varied, hope to see you there and were always super interested in hearing thoughts and feedback at hello@superbright.org !!! Sorry to hear you haven't enjoyed it, we think there's a lot of stuff that might not be self-evident initially, and then we've added extra weapons, enemies, a new world with two special areas and a kickass boss fight (we think) and actually a number of other smaller things since the PC version. We're also going to announce a new game mode to add more interesting ways to play, alongside even more graphics updates along the way. Have a great weekend!", "daniel.buttrey.915 days ago\nIn Death: Unchained\n\nExcellent game it's so well done and so much fun to play best game I've purchased for the quest so far.\n\nHelpful | 0", "kevinmmeltonJul 23 at 10:40 PM\nPoppin Templars like candy!\n\nYuppers that's a winner. Like an injection of digital snapple addictively simple devilishly fun.\n\nHelpful | 2", "EageRAssassin15 days ago\nWe may need more weapon choices\n\nGreat game overall. But a lot of improvement needed.\nMore weapons.\nSmarter check point.\nBetter graphics.\n\nHelpful | 0", "JordanPimyA day ago\nLove IT\n\nAwesome game.\n\nHelpful | 0", "Mr.Clean.Woosh19 days ago\nIts good but...\n\nIts a fun game but I played it for like 4 hours got the crossbow and such. So its very repetitive. As I said its good fun and very beautiful but it is repetitive unless you get to the pit or whatever it was called. Now that was a challenge I could enjoy. Would be awesome if you guys could add swords or daggers. Its a 3 star rating because after about 2 hours of playing the free locomotion starts to glitch out a lot. You for some reason hit a lot of invisible walls and just suddenly in combat I for some reason teleport in a wall. The screen goes black and the annoying ghosts kill me. It has a lot of space to improve and has infinite potential. You achieved something new with the quest and I respect your team for it. Thanks for reading\n\nHelpful | 2\nDeveloper Response9 days ago\n\nHi! Thank you so much for taking the time to write the review & feedback. Weve fixed those issues since and Id love to hear if your experience is better, could you please reach out to hello@superbright.org ?", "Taetoo_funnyJul 29 at 3:41 AM\nLoving it!\n\nI love every little tweak they make that adds a new mechanic to this already awesome game. All thats left is melee combat. ( Pleaseeeeee)\n\nHelpful | 1", "JohnKucz20 days ago\nVery fun game, needs direction.\n\nWhile I very much enjoy this game, I am at a loss on exactly what I need to be accomplishing. Ive been up and down the same area multiple times, killing everything in my path, but have only completed 13 percent of whatever it is Im suppose to be doing. Some sort of directional arrow or hint button telling me where I should be heading would be very helpful! Game is worth trying out for sure!!\n\nHelpful | 2\nDeveloper Response9 days ago\n\nThank you for the review & taking the time to write feedback! Can you try again? Weve improved things a bit, with more updates coming and wed love to hear your thoughts at hello@superbright.org if possible!", "Drb.danielJul 25 at 8:26 AM\nAwsome, bow and arrow,\n\nFantastic, great graphics, immersive, archery weapons while moving around shooting and blocking . FUN!!! MY FAVORITE GAME RIGHT NOW ! WORTH EVERY PENNY!\n\nHelpful | 1", "lsochiaJul 25 at 10:34 PM\nSo fun to play\n\nJust when you think it is getting old, something surprised you. I can't say enough about this game. It truly is one of my favorite games to play now.\n\nHelpful | 1", "Moonscythe6 days ago\nVery good game - but repetitive levels\n\nBought this game recently and I love it. At least the mechanics of it. Combat is fun, responsive and satisfying. The achievement progression is a nice way to add replayability. The feel of the bow is very addicting and is a joy to use. With practice, you can hit with precision and its a great feeling to do a headshot from half a mile away :)\n\nMy only big issue is the *severe* lack of variety environement wise. I hope you like monastery/church-type buildings because thats all youre getting. Even abyss is the same with some lava, different atmosphere and some recolored foes. As for whats there, even within one level, the layouts all feel the same very quickly. Adding more room layouts to the level generation would go a long way to lessen the  samey  feeling that seeps in way to quickly.\n\nHopefully the game doesnt get abandonned too quickly. The game is still fun and stands on its own because of the VR bow combat. I stay positive that some variety will come in the future *fingers\ncrossed*\n\nHelpful | 1", "DampSyrupJul 24 at 7:31 PM\nNeeds a Change to the Crossbow\n\nI have played my first hour of this game and somewhat enjoyed the experience. It delivers on the rogue elements and provides a good atmosphere...when youre not outside. Inside, the castle walls, torches, and religious imagery is immersive and engaging. Outside, however, is blindingly white with no structures what so ever. Complete immersion breaker for me. The castle is literally floating in a sea of white. The combat is great though. I had more fun with the bow and felt like Legolas from LOTR. The crossbow is what needs fixing. Around 10-15 mins in the game you receive the crossbow. It is beyond overpowered and makes the game way too easy. On my first run with the crossbow I made it all the way past Gabriel the Fallen and into hell (instead of a sea of white its a refreshing abyss of black) Whereas with the bow, I struggled getting past the first area. The aiming is easier with the crossbow since you can use your other hand to steady it and you can also spam it for full attack damage way faster than the bow. Its like having a six shooter and pulling the hammer quickly. I used the crossbow and cataclysm arrows to beat Gabriel in less than a minute. He didnt even get an attack off. For reference, using the bow I was ranked 1,250. After one run with the crossbow I was ranked 256 globally. Instead of making the crossbow worse, the enemies could be more difficult when using it. Ex. Faster animations and attacks. There is also a bug thats makes you shorter going upstairs and taller going downstairs.\n\nId say this game is good, but with the unbalanced crossbow and bugs its definitely not worth the $30 price tag. Youd be better off spending that money on beatsaber. I will be getting a refund on this game for sure.\n\nHelpful | 4\nDeveloper Response3 days ago\n\n*UPDATE* we've had many updates since you've tried the game and hopefully you could give it another try? there's also an archery contest going on in the game right now!! Your feedback was really useful, and how fast you've gotten this far in the game was impressive, could you please email us at hello@superbright.org we'd love to balance better for advanced players too.", "Learuto21 days ago\nBow to this game\n\nI stopped half way through half llife alyx to play this. Its been two weeks and im too addicted to this.\n\nHelpful | 1", "keloscaliaJul 29 at 2:01 AM\nVery immersive\n\nLove this game - got obsessed with it. Very immersive. Be sure to have good space around so you can escape from the enemy easily\n\nHelpful | 1", "andrea.demarco1Jul 30 at 7:57 AM\nA must to have!\n\nThe game is awesome. Just one problem: you need to finish the entire level without dying or you start from the beginning.\n\nHelpful | 1", "JenolinJul 23 at 2:39 PM\nFun\n\nThat's one fun game. Love it! :) OwO\n\nHelpful | 3", "LecksterLXXXVJul 28 at 6:07 AM\nLove it\n\nI normally prefer fitness games but loving this game. A bit scary at times but very comfortable controls once you get use to them.\n\nHelpful | 1", "OkiDokiLoki14 days ago\nIn death unchained\n\nLove it, after being very disappointed with onward I bought this and I love it the only reason it loses a star is it does get repetitive, could do with change of character or story line.\n\nHelpful | 2\nDeveloper Response7 days ago\n\nBtw come check out our community-made discord where players are exchanging tips and the #1 contest player is posting videos of his play!!! https://discord.com/invite/9xMrHdp Hi, thank you for the review - while the main idea of restarting the run might feel repetitive (thats roguelites for you I guess!), the game does unlock new enemies, arrows, extra areas that you can use to get a lot higher scores + great loot... theres a ton of fun stuff to be done in the game, we think! And were adding even more with the contest + upcoming game mode!!", "augustbranchesiJul 27 at 6:09 PM\nGreat game!\n\nOther than lack of backstory... perfect game\n\nHelpful | 2", "Yellowbeard69Jul 25 at 12:08 AM\nAwesome archery!\n\nBest archery and rogue action game on the quest. This game takes some skill to get those perfect kill shots.\n\nBeware of cupid's arrow!\n\nHelpful | 1\nDeveloper ResponseJul 25 at 12:52 AM\n\nBeware indeed! Thank you for the review :) Cheers", "BlircosJul 28 at 4:04 PM\nOne of the best VR games I've played\n\nThis game is most likely the best VR game on quest. Good graphics, amazing game play and replayability. What a gem!\n\nHelpful | 1", "darrentate25 days ago\nFavorite game so far\n\nCompletely addicting! Beautiful and intricate background and challenging but rewarding game play - love this game!\n\nHelpful | 1", "Dupontgoer15 days ago\nGreat Game for Most\n\nI really enjoy this game however for some I coild see the repition could be too much. That said it looks and feels great, would love to see more variety with enemies and levels. This is one of the few DLC i would happily pay for.\n\nHelpful | 0\nDeveloper Response7 days ago\n\nBtw we now have a community discord - please come talk to us at https://discord.com/invite/9xMrHdp Hi, thank you for the review and feedback! While the main part might feel repetitive, progressing in the game unlocks a ton of new things - new areas, new enemies, weapon, arrows, even whole worlds. You can also unlock starting from the games two new worlds, theres a new contest going on and a new game mode coming up! Hope the games fun and worth it! If you have any more feedback or thoughts please reach out to us at hello@superbright.org as we love hearing from our players :)", "benneconstant18 days ago\nGreat reply value\n\nBest game on the quest and the greatest bang for your buck!\n\nHelpful | 1", "drakomi6Jul 25 at 9:50 AM\nAmazing\n\nReally enjoy the game controls are really intuitive and the difficulty progression and enemy varieties are great\n\nHelpful | 0", "drunk.mike14 days ago\nAddictive, less grindy, but buggy/obtuse\n\nI'd give it 4 stars, but my character keeps flipping forward-backward at random times- Sometimes 20 times per second. It's insanely frustrating having half hour runs erased because suddenly I'm facing a wall and get shot in the back 5 times. (I think it's caused by the quest joysticks sometimes wobbling backwards.)\n\nBeyond that, I'm about 9 hours in and at the final boss. The bosses in general could use more explanation- It's not obvious how their damage or minion spawns work, which can waste many runs figuring out their mechanics. I just looked up strategy guides on the first two. I've also been killed by seeming glitches, like invisible/clipped enemies. And the dodge mechanic often fails silently if you're near anything, leaving you screwed.\n\nThat being said, it's less grindy than normal roguelikes. Yes it forces you to run through the same 3 levels many, many times, but usually you can just jump around rooftops to skip everything. I could beat the first level and boss within 7 minutes by the time his skip portal appeared.\n\nOverall it's a tense, lengthy experience that'll get you significant use out of your Quest. But expect frustration and repetition- Lots of it. Going by the leader boards, about 4200 people have completed one run, while only 350 have made it to the final boss. And holy hell does he spike the difficulty.\n\nHelpful | 0\nDeveloper Response9 days ago\n\nHey Mike, thank you for the review and feedback - sounds like youre inadvertently pushing the joysticks forward/backward and triggering a quick 180 degree turn... Please reach out to us at hello@superbright.org wed love to see if thats it or if we can help otherwise", "pjenness24 days ago\nGreat on rift, great on quest\n\nIf you like archery and medieval fantasy stop reading and start playing\n\nHelpful | 0", "LasBoss15 days ago\nDon't waste your money . . .\n\nAnother random shootfest that gets 5 stars for not being awful. The game is stable, and the graphics are not overly twitchy, but the mechanics are very subpar compared to a non-VR shooter, and the story/game-logic is non-existent - shoot, advance, enemies become slightly stronger, and your weapons become slightly stronger. After trying to give it a chance after several hours of game play, I didn't have a clue why I was bothering to master the button mapping to non-intuitive actions. VR games, to be better or different than the very good non-VR games, have to leverage the intuitiveness of motion and action that VR allows. This game does not.\n\nHelpful | 1\nDeveloper Response9 days ago\n\nHi LasBoss, thank you for taking the time to write your feedback! Repetition is the stuff of roguelites, but the game unlocks a ton of new things - new areas, new enemies, weapon, arrows, even whole worlds. You can also unlock starting from the games two new worlds, theres a second archery contest going on and a new game mode coming up, so we feel like skills will keep coming handy and just make things more fun not just now but in the future. Were working hard to make the game better and more varied, stay tuned and you can always reach out at hello@superbright.org with some thoughts or feedback as we love hearing from our players!", "CaptAARRGGHH23 days ago\nPerfect for quest\n\nThey did a great job on this fantastic looking and addictive game\n\nHelpful | 1", "peter_garcia15 days ago\nIts incredible\n\nLiterally incredible game\n\nHelpful | 1", "charlie.wilson.7737Jul 27 at 10:37 AM\nIn death\n\nCracking game\n\nHelpful | 2", "matteo311Jul 23 at 10:01 AM\nAn intense battle through the afterlife\n\nIn Death is one of the best new Oculus quest games available. My full review is here https://youtu.be/bQK7Puo73KU\n\nHelpful | 13\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!!", "Cakester12323 days ago\nAmazing\n\nTop marks on graphics, game play & replay value.\n\nHelpful | 1", "crankparasite24 days ago\nFull marks\n\nMy favourite game so far on quest a real must play.\n\nHelpful | 0", "scubasteve30314 days ago\nGreat game, poor instructions.\n\nSo far this has been a great game but it lacks sufficient amount of instructions on how to use the crossbow. It also desperately needs a story line. Why am I here and who am I fighting? Lastly, having to start completely over after death is ridiculous. It becomes more of a monotonous chore going over the same thing over and over to get back to where I left off. I look foreword to seeing these problems fixed in the future as this game has a lot of potential. Aside from that, its really fun game!\n\nHelpful | 0\nDeveloper Response7 days ago\n\nHey scubasteve303 - we now have a community discord for the game with players exchanging tips and even the #1 contest player posting his videos on how hes doing it, come join us at https://discord.com/invite/9xMrHdp. !!! Hi, thank you for the review and feedback! Stating over is written into the games genre but you actually unlock new ways to play - new areas, new enemies, weapon, arrows, worlds. You can also unlock starting from the games two new worlds, theres a new contest going on and a new game mode coming up! Hope the games fun and worth it! If you have any more feedback wed love to talk at hello@superbright.org", "DarkMatter5695Jul 26 at 7:34 PM\nGreat\n\nRoguelike bow shooter with great atmosphere. Highly recommend.\n\nHelpful | 1", "lostherzJul 26 at 7:23 PM\nWow\n\nIt's just plain awesome. Hope the developers keep improving.\n\nHelpful | 0", "DtcvJohnKimbleJul 28 at 2:55 PM\nAddictive\n\nEverything wants to kill you and it's good fun.\n\nHelpful | 1", "Pacy11Jul 28 at 5:18 PM\nAmazing\n\n100% Recommend. Super fast pace!\n\nHelpful | 1", "Tea2sugarsJul 25 at 6:54 PM\nAwesome\n\n...and now with locomotion, perfect!\n\nHelpful | 1", "everbeemJul 28 at 9:03 PM\n\nOnly played for a couple hours, but the main standout is that the sound is not great. Silent enemies, no music or much for other sounds at all. I need to figure out a way to listen to music or something while I play. Fun though!\n\nHelpful | 1\nDeveloper Response9 days ago\n\nHi, weve fixed many of these issues and would love to hear what you think !!! Could you please email us at hello@superbright.org once youve had a chance to try the game again with the new updates? (Btw check out the new archery contest going on right now!!!)", "rednic7925 days ago\nAwesome\n\nAwesome\n\nHelpful | 1", "thoeriJul 24 at 10:45 AM\nGreat game !!\n\nThe game is so good! just buy it\n\nHelpful | 1", "bigdoggy220 days ago\nhere is a review\n\ngot yea a review this game is pritty much a vr dark soals that you move a round in with arrows and yea its a pritty long but that time was not wasted\n\nHelpful | 0", "ThiccBrettonJul 25 at 6:52 PM\nGreat\n\nGreat\n\nHelpful | 0", "CharlieSayNoJul 23 at 12:06 PM\nHeaven..!\n\nTHIS is the game I have wanted on Quest ever since launch day.\n\nIn Death is one of my favourite VR games and I have played it for hours on PSVR and PCVR but am happy to buy it again for the benefits of wireless & portability.\n\nI read in the previews/reviews that this version had to have a significant graphical downgrade to be ported to Quest, but having now played the game myself I have to say that I can barely notice what has changed (so far, just a few superfluous fancy effects that have been dropped).\n\nBrilliant, brilliant, brilliant - many thanks to the devs for doing such a top job on what is about to be my most played Quest game!\n\nHelpful | 7", "OculusGameCatJul 23 at 11:19 PM\n40+ Quest games... this is my favorite!\n\nIn Death was my favorite PCVR game before HLA. When the announcement dropped that it was coming to the Quest, I was very excited and a little worried. I was afraid they wouldn't be able to pull it off and it wouldn't be nearly as good as the PCVR version... I was wrong.\n\nThe graphics/textures of course take a hit, but not nearly as much as I thought they would. It still looks beautiful. The bow and arrow mechanics are fantastic, even though my aim sucks. But I did three runs tonight and unlocked the crossbow and I am much better with my aim with the crossbow as that is what I used most of the time on the previous version.\n\nThe enemies are fantastic and true to the original as well. And having the shard for dodging, the shield for blocking, teleportation and full smooth locomotion is perfect once you get used to using all of these elements in tandem.\n\nIs it worth the $30? I definitely think so! Great gameplay with replayability makes it well worth it. There are many PC players that have logged 1000+ hours in this game. Every time you start a new run, everything is procedurally generated so it will be different than your previous run. If you like Bow combat games, you will love it. Plenty of in-game achievements to unlock and leaderboard chasing to be had.\n\nThanks for bringing this to the Oculus Quest Superbright!\n\nHelpful | 6", "treminator1966Jul 23 at 12:21 PM\nHighly Recommend\n\nI have been playing the original game for about a month now like a fanatic and I have been eagerly awaiting the quest version so it would be easier to get your neo on and dodge the arrows. Almost immediately I noticed the bow mechanics were tighter on this version i can definitely shoot straighter here. I can tell they had to make some graphical compromises to get it onto the quest but they definitely DO NOT compromise the gameplay which is every bit as good or better than the original. The only downside so far for me is the positional audio I tend to rely on the teleport sound to let me know when I'm being flanked and several times I had to look around a bit when I thought a monk had teleported instead of hearing them and instinctively turning to put an arrow in their face. Overall a fantastic port and easily one of the best quest games I've tried both graphically and in terms of gameplay. BTW a nod to the devs i love your sanctuary even if i can't snipe from it keep up the good work and i look forward to the DLC.\n\nHelpful | 6", "Blitz_krieg11 days ago\nAbsolute Masterpiece\n\nI bought this game with low expectations, the reason I bought it was because it was one of the highest rated games on the store. I looked at gameplay and it didn't look that interesting but I decided to see what the hype was about and was not disappointed at all. This game is FANTASTIC! Everything about this game is fantastic the gameplay is revolutionary and the graphics are amazing by quest standards. It's not just shooting a bow and arrow, you have a teleport move and a dash move to make gameplay more interesting and fun, you also have a shield and a crossbow you can use. There are a lot of enemies and interesting environments. I was overwhelmed by how long and repayable this game is. You can play for hours and hours and not get bored. This game is absolutely a masterpiece and a must have for the quest\n\nHelpful | 2", "Shopliftersunite11 days ago\nIf you were to buy only one VR title\n\nBefore I purchased the Quest this was my go to game on Windows Mixed Reality, so glad that it has come to the Oculus store. The archery physics, the gameplay and especially the graphics make this the penultimate VR game of the moment and arguably one of the most immersive game VR experiences to date, as groundbreaking as Superhot. Thanks developers, the updates have been impressive!\n\nHelpful | 2", "ARCHMOWiEJul 23 at 4:14 PM\nLove this game\n\nI truly love this game, and have played it since it first came out. However; Im very disappointed that if I try streaming to Facebook, they block my sound on the game. Funny thing was it was up for 2 hours before they did. I find this just arrogant. If you arent going to allow people to stream your game, then you shouldnt be on here. If you are looking for one of the best games on the quest this is it. However this situation really upsets me.\nIt says Sky Uk blocked my sound and owns the rights to it.\n\nHelpful | 5", "BeatzCreationsJul 23 at 2:08 PM\nMUST BUY!!!!!\n\nOk so i watched a trailer and a bit of gameplay (which is always a bad idea as videos of vr never ever does justice to being IN vr which i tell someone everytime i show them a gameplay video i recorded of me) after watchin the vids i wasn't too fussed to grab it straight away....\n\nTurned the Quest on today and thought ahh whats the worst that can happen.. if i dont like it i can get it refunded right.\n\nOH MY GOD this game is SUPER ADDICTIVE, looks SMOOTH & CRISP on the quest, the bow feels awesome! And getting headshots from range feels bad*ss!!!.. love the shield for defence, love the style, love being able to toggle on the smooth locomotion but you still can use the teleport to clear big spaces (and its needed for jumpin gaps anyway)\n\nJust a flippin awesome vr game in every way!\n\nWell... if it added CO-OP down the line then i would some how figure out how to give this game a 6 star rating out of 5!! Lol\n\n(But it is a good idea Developers right \n\nWorth every penny! Will be the game that kills my battery everyday for the foreseeable future lol.\n\nHelpful | 5", "KingFetus8725 days ago\ngreat game with one problem\n\nIts a great game and has become one of my favorites only problem is the teleport I prefer being able to walk rather than teleport\n\nHelpful | 1\nDeveloper Response9 days ago\n\nHi, you can turn on the free locomotion in the games menu (the menu button on the controller, settings > preferences). Let us know if that worked! hello@superbright.org <- always love hearing from our players especially if we can help!", "skiverstarlightJul 23 at 11:30 PM\nFirst PC now...Quest\n\nBefore you read on This is a game that is completely worth the $30.\n\nWhen I heard about this game being released on the quest I was super excited. I purchased this game on my gaming PC first and I was extremely satisfied with the design. I have over 80 hours of playtime on the PC version of this game.\n\nWithout giving it a second thought, I purchased this game again! It was a great delight to re-live the experience and progress all over again. Many things have been tweaked, the shadow affects of certain areas are much darker and creepier now. The pit of reformation is very scary because it is so dang dark now. Something else that I noticed was that when you shoot an arrow every enemy is turned to your attention and will come after you. I learned this in a later level that I will not mention because spoilers. This game still keeps you on your toes and Im glad it has been developed for the quest.\n\nI highly highly highly highly recommend this game to anybody that owns a quest!!\n\nHelpful | 4", "TVL1977Jul 24 at 11:16 AM\nDie, die,..... And die again. Addictive!\n\nWow. This game is amazing. It's a challenge, that's something I gotta admit. Only 8% through the game..... But the times I had to die to get there are countless. And every time you have to start at the beginning again. But the interesting part of it all is that the ground plan always changes..... But also the enemies are more numerous and are more diverse after every time you have to start again. On one hand it sounds frustrating but it also drags you into the game willing to go further and unlock more items.\nThere's only a two weapon choice, bow and arrow or crossbow. Besides that the only thing you can upgrade are the arrows, like fire or ice arrows. But the mechanics work great (although sometimes there are still some issues on hitting targets, as you can see the arrow go through the enemy but there is no hit.)\nOne of the downsides is the audio. Enemies can appear right behind you but audio wise it doesn't really warn you (footsteps or something). They appear sometimes out of nowhere and you only notice from the moment you get hit by them. Hopefully an update on the audio might resolve this issue. Also far or close hits sound the same I think.\nThe visuals had an expected downgrading but that's always the case with the Quest, but I think it's still ok. (besides the wooden door when you enter.... It looks very cheap like plastic almost)\nBut loving the gameplay and I think this one is gonna get a lot of replayability!\n\nHelpful | 4", "CaptainWiggly17 days ago\nLove in death, feels like a full game.\n\nLove this, just had to put the quest down after buying it because I needed to get some water.\n\nHeart pumping from trying to avoid packs of creatures... Really love this game.\n\nI've enjoyed elven assassin and that always felt like a tech demo... This is what the waist has needed for awhile. Great immersive game that lets you dive in and go deep.\n\nHelpful | 2", "avovJul 29 at 10:30 AM\nsword\n\nreally good but think how cool spells and swords whold be\n\nHelpful | 2\nDeveloper ResponseJul 30 at 7:44 AM\n\nmagical arrows are the game's spells, just without the complication of more controls to learn! they're naturally easy to cast short and long-range - you can set traps, spread poison, cast AOE that amplified damage received by the enemies. we are unlikely to have swords, this is very much an archery game, but you can use your shield to push enemies and even throw the flying skulls in The Abyss onto groups of enemies for chain reactions!", "DStubzJul 23 at 5:17 PM\nWow - now cable free really brings it on\n\nLoved the PCVR version, really love the Quest version allowing free movement, cable free. Was worried that it would look poor compared to PC version, developers should be very proud in their optimising the Quest graphics - looks fantastic, plays fantastic. Definitely a must have Quest game.\n\nHelpful | 4", "zylik4 days ago\nGreat first impressions and my thoughts\n\nJust got done with my first session of game play and had a blast. Love the atmosphere and the game play. Before i was going to rate this as a 4 star for not having smooth motion but before writing this i read some of the negative reviews and responses from the developers and saw that it does of smooth motion. I think a setup process during the tutorial for motion would be a good idea. I understand why though using a bow for every thing does give it a unique feel but people like to know they have options. I'm hoping ill be able to do a mix of both, i'd like to be able to teleport when moving long range and smooth motion for dodging. I think that would feel more natural to me. Gonna go see if I can do this but either way great game.\n\nHelpful | 1", "dawson.detherageJul 27 at 3:36 AM\nAmazing Game\n\nWhats better than playing something different every time? This makes it a game where you have to learn the skills, not the map. On top of that, the mechanics are great, the graphics are detailed, and the way you move around is different, but easy to learn. So far In Death is my favorite game on the quest.\n\nHelpful | 3", "tentrdus00017 days ago\nThe best oculus quest game\n\nOk so ive played alot of oculus games and by far this is my favorite i love all the evil creatures and the different type of levels and the bow is fantastic and the crossbow is fantastic the graphics are very good and the sound design is good also. if u have $30 around buy this game!!!\n\nHelpful | 2", "KP_VAN23 days ago\nStunning!\n\nI was expecting this to be a good game, but wow. But watch your locomotive arrows if you have a fear of heights. I ended up on the edge of a roof looking down... My fear was real :) The game play mechanics are awesome. I personally love the teleport arrow and shard combo. This is a very challenging game, which I love. The atmosphere is so good. Gothic underworld excellence :)\n\nGreat job Devs! This is a game to set the standards on the quest.\n\nHelpful | 2\nDeveloper Response23 days ago\n\nThank you so much <3 that was such a pleasure to read. And we'll continue to make the game better over time and have new content, stay tuned!", "SgtRamVRFit1961Jul 23 at 6:03 PM\nHighly Impressed !\n\nI played this on my Rift for PC and was always bothered by the cord, no more chains with the Quest. Looks amazing and plays great. Only one thing I hope the free locomotion is released soon, be better way to move. But I dont hate the bow and arrow teleport it is still amazing. Graphics are amazing and gameplay is on par with the PC version. 5 stars!\n\nHelpful | 3", "powney1991Jul 23 at 6:26 PM\nA phenomenal title!\n\nSo this was a game I was heavily anticipating for a while since it was slated for release during the upload VR showcase announcements. Before that I was tempted to get the PC VR version but thought Id hold out for the native quest version to see what it would be like and WOW this little gem did NOT disappoint and was well worth the wait! Its absolutely brilliant!\n\nThe visuals just to start off with are quite frankly SUPERB and amongst some of the best graphics Ive experienced on the quest natively to date! Massive amounts of credit to the devs in making a game like this look so incredible considering the system its running on!\n\nThe mechanics throughout the game are also as smooth as butter especially in terms of using the bow and how enemies fall when youve shot them.\n\nIn terms of the gameplay itself, I personally absolutely love it! Theres no big story to it or anything like that but what it gives you is a fantastic procedurally level generated bow and arrow shooter whereby you will go on runs at storming an abbey like environment up in heaven firing your bow at a wide variety of enemies along the way.\n\nThe real clever part about this game is each run or attempt you go on will adhere to how youve played already and what achievements and bonuses you may have obtained in the previous runs and will therefore influence the difficulty and content of your next run.\n\nSpeaking of achievements and bonuses throughout each run when you kill enemies theyll drop gold and you can use this gold at certain checkpoints where it will not only save your current progress of the run youre on but give you the chance to buy various arrows such as fire arrows, ice arrows, and exploding arrows just to name a few to aid your cause and cause some nice effects on the enemies when shot. Its worth noting that these arrows can also be dropped randomly by enemies through a run where you can pick them up for free and attach them to your bow.\n\nAt the end of each run youll be taken back to the sanctuary which is effectively a safe place you go back to where you can opt to choose between using a bow and arrow or a crossbow before going on your next run. Theres also leaderboards based on what weapon you used for your previous run and also an overall one which combines both. You can also use this place to view achievements which are basically like mini challenges you pass through each run such as killing 50 enemies in a short space of time for example.\n\nBesides this usual mode theres also an abyss mode which is something im yet to unlock but something else Im excited to explore when I do!\n\nAll in all a visually striking, smooth, roguelike bow shooter with really fantastic gameplay and heaps of replayability and challenges along with a few unlockables that really justifies the 4.9 rating its got in the store at the moment! I highly recommend it to anyone whos interested! Amazing game! \n\nHelpful | 3", "NavyDave5925 days ago\nGreat adventure!\n\nI'm enjoying it very much. I use it to keep burning calories after my workout.\n\nHelpful | 0\nDeveloper Response9 days ago\n\nHi, have you seen the new contest? That ones really intense, should be graet for cardio :) Let us know at hello@superbright.org", "pyrogunx24 days ago\nWorth it\n\nI wasnt even aware of this game until it popped up on the store. A roguelite fps with a bow sounded fun. So far it's been amazing. Really immersive. They did an awesome job with incredible natural controls (at least it's natural I've played so far). The movement is well done and thematic. The world graphics feel great. While I was skeptical originally, as a whole, worth the price.\n\nHelpful | 2", "IancoJul 23 at 5:21 PM\nA true to form Quest port\n\nHere we have it, THE killer app of the Quest. An amazing infinitely replayabe Rougelight with great graphics, phenomenal combat and unending progression. A must buy for every Quest owner! The leap to freedom of movement and the badassary that comes with it is a frightening thing to behold.\n\nHelpful | 3", "thememelord1Jul 26 at 8:08 PM\nSo far so death\n\nWhat a great looking game you guys have made and a right hoot to go with that as well\n\nKeep coming back time and time again to die more and more\n\nJust one thing the free locomotion is great but it's a tad slow any chances of being able to set your speed at some point would be great\n\nBut love the game even if I am useless with a bow and arrrow\n\nHelpful | 2", "DreamerOJul 24 at 7:12 PM\n5 on the rift 5 on the quest\n\nAs a VR vet I was so hyped when this became available for the quest. The game has endless replayability, but the developers did one better and added a bunch of new content & redesigned the entry experience!\n\nSuggestions for players: give the crossbow a go. It takes a little getting used to, but once youve got it youre just nonstop slaying\n\nHelpful | 1", "GothamsFinestJul 24 at 9:33 PM\nNon-stop heart pounding adventure\n\nI bought this game today because I wanted to try something different and something that wasn't too easy with the content completed so fast. I have already spent a full charge just playing this game and I didnt want to stop. Truly an immersive, addictive, and exciting experience! Haven't experience this level of amazement in VR since first playing star wars and I am very selective when it comes to purchasing games.\n\nHelpful | 2", "nightmare95Jul 25 at 10:22 PM\nEverything, I have been waiting for...\n\nThis game is everything I wanted when I bought the quest. The graphics are amazing compared to other games, someone wrote outside the castle should have more visual, all I have to say is if your in a limbo like place, this is most likely what it will look like. The game play is all about strategy, I love that you can take to the roofs and play like an assassin, and the levels definitely change as you play and die, my first round I played for 45 minutes and it was pretty easy-ish, then when I died and tried again I had way more enemies that were smarter this time around and I died in about 5. As I play it really challenges me, which I think is what we all want. Compared to firing a real bow, the aiming is just as accurate. So if you know archery, surprisingly it will come in handy.\nAlso someone said the game was super easy with the cross bow, I hate that thing, I dont think its easier, I think to each its own.\nThis is exactly what it would be like to be a fantasy type archer, and it is so much fun.\nIf you wondered what Shadow of Mordor would be like in VR, I would say like this!\nKudos to everyone who worked on the game,\nThank you.\n\nHelpful | 2", "Skaven7Jul 25 at 5:10 AM\nWhat an amazing game!\n\nJust bought this game today and it's easily one of the best games on the Quest so far. I really like how you can choose between teleport mode and smooth locomotion. If you've played Even Assassin then this game is for you. Elven Assassin is actually a good training ground as it works in pretty much the same way, apart from you can move around freely when playing In Death. You can teleport using arrows even with locomotion turned on and you can even teleport on to the roof tops to give you an advantage over some of the enemies. It's a great game with great gameplay and great graphics and I can highly recommend it.\nI also love how the game adapts itself you how you play and the monastic hymn music gives it a very eerie feel indeed.\n\nHelpful | 2\nDeveloper ResponseJul 25 at 8:48 AM\n\nHi! Thanks for the awesome feedback, the crossbow unlocks after killing 101 enemies using the bow. You can then actually switch between them in the Sanctuary if you'd like to go back to playing the bow. Cheers!", "itsjustsomeguyJul 24 at 6:11 AM\nMy arms get tired... because I love it!\n\nIt's a lot of holding a bow and shooting. But the physics are amazing. I love thst there is no computer assisted aiming. It's just you, a bow, unlimited basic ammo, and lots of bad guys. It's the only game, when I'm done playing I find myself facing a completely different direction from where I thought I was, because it's so immersive. More games need this experience.\n\nHelpful | 2", "gavsters23 days ago\nGood game but needs a new class\n\nSword class good game thou\n\nHelpful | 0", "noah.godwin13 days ago\nA must have\n\nWe can't get enough of this game! All the crazy long rave reviews are correct. You need this. The only way this could get better would be if there were multi-player, but it totally gets 5 stars.\n\nHelpful | 2", "DakkardJul 23 at 11:02 AM\nSimply Fun\n\nHaving the shard, arrow movement and free locomotion really works well together.\n\nI'm a terrible aim so far but it's not putting me off and really enjoying the experience.\n\nHelpful | 6", "yax20 days ago\nFabulous\n\nI never write reviews because who cares right? But this game is worth a moment to say, AWESOME!! one of the best games ever played on the Oculus by far graphics GREAT. Game play GREAT. Shooting Accuracy AMAZING. Deffo worth purchasing if you enjoy feeling like Legolas in a Devil May Cry atmosphere. Only frustrating thing, when you die, you start over but I guess thats allows for you to not complete the games too soon and get better at the playing with time. Well done to the creators. Fab job fab game!!\n\nHelpful | 0", "Vapormonkey20 days ago\nMy Favorite Title On the Quest by Far\n\nPerfect port of the PC version. The graphics are hands down the best of any quest game. The gameplay is rogue-like randomly generated maps, and it has a ridiculously addicting gameplay loop.\n\nThe bow feels natural.\nThe enemies are varied.\n\n5/5. I love this game. If your on the fence, watch some YouTube or something about it, because imo the 30$ price point is worth it.\n\nHelpful | 1", "TheMeatSweats9510 days ago\nPure garbage\n\nWhy would the developers program this game to where you have to shoot arrows to move? Ruins the game.\n\nHelpful | 0\nDeveloper Response8 hours ago\n\nHi, have you been able to use free locomotion? You can always reach out to us at hello@superbright.org btw!! Update - you're welcome to visit us on discord now, it's community driven and people are very helpful there - https://discord.com/invite/9xMrHdp Sorry to hear you dont like it - you can always turn on smooth locomotion in the game, maybe youll like it more? We think the arrow teleportation is actually a lot of fun once you get to it, and in a game about shooting you get really good at aiming and rhythm and shooting while the teleportation arrow is flying!! After a while you can get into an awesome rhythm of teleporting and killing enemies in a smooth way :)", "turbojwmJul 25 at 11:43 AM\nIn Death Unchained\n\nAwful Horrible game without free movement. I lasted five minutes. So disappointing. I have become very cautious now of future purchases.\n\nHelpful | 8\nDeveloper Response9 days ago\n\nUPDATE - have you been able to find & use the free movement? Sorry to hear about your experience - you can enable free movement in the game menu (using the menu button on the controller), we feel like this is an advanced player option in terms of comfort. Youc can always email us at hello@superbright.org for help!", "OlRoody23 days ago\nWell worth it\n\nI was really on the fence about buying this game due to a lot of reviews saying negative things about it (comparing it to other vr headsets) but i have to say this is my new favorite game on the quest.\nIts extremely addicting, and the environments are gorgeous. Completing a run (surviving as long as possible, then dying) is surprisingly fun. You are upset initially about dying, but then you see your progress, get new unlocks and get to see the massive body count you clock up.\n\nThis game is very challenging, and you are often overwhelmed by enemies. But picking them off 1 by 1, getting unlocks and conserving your best arrows for a time you need them is so dang fun.\n\nIf you are on the fence about this game but like dark souls, or if you like challenging games, pick this one up. Its well worth it, and my favorite game on the quest, hands down.\n\nHelpful | 1", "Mr.SanboJul 23 at 10:43 AM\nThe best game I have in my library\n\nOut of the 40 games Ive downloaded in my library this is the only one that truly gives me a sense of presence. Its truly terrifying as the knights run toward you!\n\nHelpful | 5", "vr303whodatJul 23 at 1:16 PM\nThis is what I've been waiting for.\n\nI had a Samsung gear. I had an oculus go. This is amazing, incredible, and immersive. Jaw dropping. Just buy it already!\n\nHelpful | 7", "RonnSwansonJul 28 at 9:20 AM\nIm Amazed \n\nThis game has awesome potential for hours and hours of replay. Not only does it change every time to make each experience unique, each time you die and gain experience you open up new aspects of the game including weapons, new enemies, attack bonuses and new upgrades. Ive already played for 3+ hours after buying the game a couple days ago and cant wait to get back into it again! Ive still only explored 8% of the first of three worlds in the game.\n\nI would suggest that you give yourself some time to adjust to using the bow and arrow before judging the game itself. After you get the hang of that its extremely fun!\n\nHighly recommended. If youre even slightly on the fence just DO IT! You wont regret it. Great experience.\n\nHelpful | 1", "kvg1988Jul 23 at 4:55 PM\nMaking Purgatory Great Again!\n\nIt's the Dark Souls VR rougelike you never knew you wanted! In Death: Unchained is both a devilishly difficult and heavenly rewarding game, that could leave you spending quite literally forever to play.\n\nHelpful | 3", "Skow0001Jul 24 at 11:01 AM\nBetter then the pc version\n\nI like the pc version a lot, but for me on this platform I am seeing no graphics downgrade. The biggest plus is the complete movement of freedom which makes my ability to react that much better. Good job to the development team on this one.\n\nHelpful | 2", "MeatballmachineJul 26 at 9:04 AM\nIts here!!!\n\nThis was def on my wishlist for Quest, because I knew the awesomeness that 6DOF would bring to this already legendary VR game. The replay value on this is infinite, the gameplay mechanics are perfect, and the loop is seriously addictive. Thank you so much to the new devs who picked this up after Solfar walked away. It looks and play better than ever. Great job guys.! (I asked Solfar and Ill ask you too, can we please get a slider in the settings for the bow draw length? My arms arent long enough lol to get a full draw on this one without going out of camera range.)\n\nHelpful | 1", "NachoCapoJul 26 at 8:12 AM\nExcelente Game, but...\n\n5 STARS Game for sure, best one you can buy for your OQ right now. The but is because sometimes you have no way yo realize an enemy is in your back untill he hits you. Don't know if is meant to be that way, but id like that you can actually hear enemys chasing you from behind or at least some kind of warning. Besides that, thank you for making such a great game for Quest. It's not an \"exoerience\" nor a simple downgraded port, it's a real full game and thats what we need for this standalone device.\n\nHelpful | 0\nDeveloper ResponseJul 26 at 8:25 AM\n\nHi, thank you for the feedback, this is why having great community is important! Much appreciated. Meanwhile, better audio for this and other cases are coming stay tuned for the upcoming updates", "cleveristJul 25 at 2:21 PM\nAmazing port of original Rift version!\n\nI played and loved on the rift, so far it seems faithful and even some small improvements like the ability to save the game. The crystal shard teleportation seems slightly inferior to Rift and a little less precise, but they explain its mostly for dodging in this version (on Rift it was my primary transport and I rarely used teleport arrows except for longer distances). Overall seems awesome, especially considering hardware differences developers had to work with!\n\nHelpful | 1", "konttoriJul 25 at 1:16 AM\nPhenomenal!\n\nPerfect port of a great game. Rogue -like design and one life to live really creates amazing tensio to this achery game. Endless corridors and stairs in hell force you to play always a bit longer and reach that next tower. Movement is sublime with teleport arrow and dagger. Runs flawlessly and looks as pretty as this grime world can ever look.\n\nHelpful | 1\nDeveloper ResponseJul 25 at 5:35 AM\n\nThank you for the kind words <3", "MaelwolfJul 25 at 2:50 PM\nBullseye\n\nLove it. Truly a game the Quest has been missing. Like others Id like to see more weapons, but I understand the bow is essentially a core mechanic. If the game is already this polished, I can only believe the developers will be adding some great stuff going forward. Awesome work everyone involved, this is likely the game I will use to judge the quality of future VR titles.\n\nHelpful | 1", "ChillahGorillaJul 25 at 6:03 AM\nThe crossbow makes a huge difference\n\nI struggled with this game at first because I have a hard time hitting much of anything with the bow and arrows. I had pretty much given up on the game, but for some reason I decided to play it for a little bit longer.\n\nThen I got the crossbow and it made such a huge difference it changed what I thought of the game. This and the free locomotion make the game playable for me, and that allowed me to enjoy all the good stuff in it, like the graphics, achievements, special arrows ect ect.. And now it is one of my favorite games.\n\nAbsolutely worth it and an easy 5 \n\nHelpful | 1", "DukefromearthJul 24 at 8:22 AM\nIncredibly fun!\n\nI like the way the game puts your dexterity on the line to provide exciting run.\n\nFirst time around, I play cautiously, die after the first tower.\n\nSecond run, the level is all changed thanks toel the randomization. I notice that the melee knight evolved and sometimes they have shields now. Trickier to hit...\n\nI like where this is going. Just unlocked the crossbow and this gives another completely different feel to your aim and behaviour in the world.\n\nI also like the way both hand influence aiming. It's not the the hand that holds the bow but also the string hand can adjust the arrow trajectories. I did some nice panicked corner shots that way!\n\nAs a lightgun game addict, this is an awesome addition in my vr library and will provide many more thrilling action filled runs.\n\nHelpful | 1", "calforbJul 24 at 8:06 AM\nGreat game!\n\nThe game play is amazing but I feel theres a few tweaks that need to be ironed out with an update. Height seems off when using locomotion along with teleport sometimes. Only corrects when you teleport again. Sometimes theres a little glitch now and again with scenery loading. Hopefully can be improved. But... Im only in the first level and I think Im going to have a blast with this game! Archery mechanics is flawless. Really great atmosphere. I notice the volume is maybe low but I think this could be since update 18 for Quest.\n\nAll in all, I definitely recommend this game!\n\nEdit: changed my score to 5 stars for the developer response \n\nThe replay in this game really makes me think its probably the top game at the moment.\n\nHelpful | 0\nDeveloper ResponseJul 24 at 6:41 AM\n\nHi, thanks for the feedback, there are fixes and updates coming shortly after the weekend, these are growing pains but we're going to smooth all of this out very soon. Have a great weekend and enjoy the game <3", "kaoscupcakeJul 24 at 1:42 PM\nWay better than I thought it would be..\n\nJust wanted to lay down a quick review of this game as I'm not very far in yet..\n\nAs a person that's fairly new to the Quest and VR gaming in general, I first want to say this title, along with a couple others, are literally the reason I made the quick purchase of the quest in the first place! Man! I mean after looking at the trailer and then coming into this game with absolutely no real expectations, I've got to say this game completely surprised me with how awesome it turned out to be. It's challenging, addictive, and the scenery alone is honestly more than enough to keep me playing!\n\nI'm still hoping to get more accurate though .\nAnywho if you're having doubts about being a noob and not finding this game...just go for it! This game is well worth every penny!\n\nHelpful | 1", "k405wizardJul 24 at 9:26 AM\nExcellent Archery Game\n\nPlayed it for an hour now. This game is really cool if you like archery. Unlike Elven Assassin you can move around in labyrinth like structures with gothic elements. The best thing is, even if you die the structures are randomly created new. Thats awesome! Potions for healing are dropping pretty rare and I am missing a difficulty adjustment. You level by unlocking achievements. The more you kill, the better you get.\n\nHelpful | 1", "lanrusmarJul 24 at 8:43 AM\nAnother great game in my arsenal\n\nAt first when I saw it I wasn't sure if it was something I wanted to purchase. But when I started reading more about it and how the game changes (not always the same) after you die.. Well my mind was made up.. Now I can't stop playing it. Another great game for the Quest.\n\nIf you're debating about getting it.. Just go for it. You will not be disappointed!!!!\n\nHelpful | 0", "chaoticlukeJul 24 at 8:44 AM\nOne of the best games on the quest\n\nOut of all of my oculus games, this seems to be the one Im playing the most. For a quest game the graphics are pretty great and the animations are pretty smooth. The games procedurally generated levels and the varied enemy types keep the game fresh. But Ive been sinking into the floor when using smooth locomotion and it would be great if the devs could fix that in the next update.\n\nHelpful | 0", "paul.mckendrey5 days ago\nOne more go!\n\nTough as nails but it keeps making you come back. Possibly my fav game on the quest.\n\nHelpful | 2", "DenL-VRJul 24 at 6:09 AM\nAmazing game by an amazing developer\n\nAnother one of these games that just wow me. The graphics, mechanics, gameplay all amazing. Great job, I have read many responses from this dev on reddit and they come across very passionate about this game, well it definitely shows, congratulations on bringing an amazing title to the quest!\n\nHelpful | 1", "Marirari89Jul 24 at 11:08 PM\nGreat game!\n\nThis game made me really feel powerful! The bow feels awesome, and moving around is as good as it gets. Dashing from side to side, or teleporting to a roof top to snipe an enemy far away. Extremely satisfying! One of those games I can easily see my self dumping many, many hours in to.\n\nHelpful | 0", "BintryinJul 23 at 9:29 PM\nFantastic Game\n\nWow I just love this game I own 3 versions of the game now . Just love this on the Quest so much better without a wired headset. The tracking is just spot on. The best bow and arrow game on the market.\n\nHelpful | 2", "Aktion24 days ago\nLooks easy but hard to master!\n\nReally enjoying playing the game. Dont be fooled with the simple look - Very challenging and brilliantly executed!\n\nHelpful | 3\nDeveloper Response23 days ago\n\nThank you! We keep working on making it better and adding more content, stay tuned and hope to see you on the leaderboards!", "darren.pyeJul 28 at 10:49 AM\nBrilliant fun\n\nThe bow mechanics are great. The atmosphere is immersive. The progression system is wonderful. The replay value unending. Get it now.\n\nPs: free movement option is in settings.\n\nHelpful | 2", "Jwa1287Jul 24 at 12:28 AM\nThis is my new favorite Quest game\n\nI love this game. I would not have stopped playing, if I had not run my battery nearly all the way down. This is my favorite Quest game so far.\n\nHelpful | 3", "JakeNBake52Jul 24 at 12:22 AM\nFINALLY!\n\nI have been waiting for this game to be added\nto the Quest since before the Quest was released. I played it in the Rift a long time ago and it still holds up. Love this game so much!\n\nHelpful | 2", "dancejohndance18 days ago\nBest game on quest\n\nThis game is soooo much fun, and the devs have done a phenomenal job of updating things as needed. Buy it NOW.\n\nHelpful | 2", "aaron.sommers.1253Jul 23 at 8:54 PM\nIn Death\n\nI Love this Game! I dont think theirs much of a down grade in graphics either, but what do I know This game is challenging, fun, and always different. Im so happy about this Drop, time to let my Arrows Fly In Death. DarkSoulsEsk\n\nHelpful | 1", "No0n3Jul 23 at 11:01 AM\nMy favorite Game now\n\nLove it!\nit is probably on of the best games on Oculus Quest :)\nHighly recommend.\n\nHelpful | 5", "phillyg2020Jul 23 at 7:52 PM\nVery Tight!\n\nIt reminds me of Wizards a little bit. But more crisp graphics... maybe you could share your algorithm... but definitely a buy! Go Quest! Thanks Devs! Great job!!!\n\nHelpful | 2", "MrKodijackJul 23 at 12:19 PM\nTerrific port\n\nThe developer has done a terrific job with this port. Beware leaderboard, here I come.\n\nHelpful | 4", "Thatoneguy17219 days ago\nBuy This Game\n\nThis game has potential. Yet it does so much right. Great graphics, gameplay, and Replayability. The game is nearly everything I wanted from a good quest game and Ive only played 30 mins so far. Procedural levels so your not bored and challenges. They do however need to add analog stick locomotion.\nIt would also be nice to have a weapon for close combat. A inventory and loot system and coop would be great as well\n\nHelpful | 0\nDeveloper Response8 hours ago\n\nHey Thatoneguy1721, have you found free locomotion that can be turned on in the games menu? You can always reach out to us at hello@superbright.org", "Rising_Zeus15 days ago\nBeautiful\n\nAmazingly fun, and an actual full game that doesnt feel like its just a tech demo like so many titles out there. Try it out!\n\nHelpful | 0", "NGdragon707Jul 24 at 8:28 AM\nLets just say\n\nBeen waiting for this game to come out on the quest ever since I purchased the device (which was at launch). I was obsessed with the original on the rift. They did not disappoint! Still my favorite game in VR.\n\nHelpful | 0", "xrflyerJul 23 at 10:21 PM\nGreat port of a great game plus more!\n\nHave wanted this on Quest forever and they did a really great job with the port and expansion. Looking forward to the DLC too!\n\nHelpful | 2", "veganmetalnerdJul 24 at 1:13 PM\nA new highlight on the Oculus Quest\n\nReally intensely satisfying game, keeps you coming back for more, plus I love the handling of the bow!\nTogether with Echo VR one of my favorite games on the Quest so far!\nA must-have title! \n\nHelpful | 1", "Rowan51616 days ago\nGreat but overhyped\n\nI went in expecting huge things with it's 4.8 star score. Although it is good, it is missing so many things.\n1. Multiplayer\nI don't know how hard it is to develop games but multiplayer is a no brainier for this game, it almost feels like it is missing a piece because of this.\n2. Horde mode\nThis needs to be in the game, if they added this I would up to 5 star instantly.\n3. Checkpoints or revival system\nIf you die you lose everything, you could be doing amazing and thengete caught in a horde and lose. I understand having death the end of the run for the story, but it feels horrible to have an entire run wasted because of one misstep.\n\nHelpful | 0", "ThreeCartJul 23 at 11:16 AM\nPretty fun\n\nYea Im a gamer\n\nHelpful | 5", "mdaquino23 days ago\nEasily the most polished game on quest\n\nAnd a blast too\n\nHelpful | 3\nDeveloper Response23 days ago\n\nThank you so much :)", "TelephantasticJul 24 at 6:33 PM\nArrow Souls?! Souls N Arrows? Dark Bows?\n\nCall it what you want. But I call it awesome. Definitely a fun thought out game. Just wish I could play it longer than 15 minutes at a time. Love this game! Great work devs!\n\nHelpful | 1", "PaulkfamilyJul 24 at 7:24 PM\nFinally a game that's longer than 10 min\n\nActually pretty cool game. Need skill to play. May have pooped myself a couple times. Wish the moving knife thingy had a further distance. Would absolutely recommend.\n\nHelpful | 0", "Twilight_ZoneJul 23 at 6:38 PM\nHours Of Fun\n\nYou can just spend endless hours on this game. Total blast and mechanics are done really well!\n\nHelpful | 2", "JoNxGJul 25 at 12:51 AM\nGood rogue-lite\n\nA immersive and addictive game. You choose either crossbow or bow. Good teleporting system with arrows that lets you position yourself almost anywhere. Thumbs up!!\n\nHelpful | 0", "thebrotherhoodofironJul 24 at 7:23 PM\nFun, just fun\n\nOne problem I have with be games is their short, but this game solves that problem by making it hard and replayable, but not repetitive. Great game.\n\nHelpful | 0", "nishruu2Jul 26 at 11:28 PM\nintense play\n\nintense play\nbut the aiming will take long then should to perfect. i hit my headset with the controller and there is no aiming reticle.\n\nHelpful | 1", "No1SaysKosm24 days ago\nSceptical at first, glad I bought it!\n\nI was on the fence about this game at first. Mostly cause I'm not a big fan of teleport style movement. Thankfully you can change to free movement in the settings, they just don't advertise it. The gameplay is hella fun. I've spent about 2 hours in the game, and that 2 hours flew by. Definitely recommend this game, some of the most fun I've had in VR so far!\n\nHelpful | 0\nDeveloper Response9 days ago\n\nUpdate - have you seen the new archery contest, the updates and the game mode weve announced? Very curious what you think !!! Thank you for the feedback, happy you liked the game, hope to see you on the leaderboards in the archery contest that's going on :) And there's more fun coming in the new game mode we'll be announcing.", "JMDFJul 26 at 3:52 PM\nAwesome\n\nGreat replayability, great graphics, great boe mechanics.\nNever was into rogoulites, VR + that game in combination changed that :)\n\nHelpful | 0", "kylekol94Jul 28 at 7:17 PM\n\nPretty good. It might just be me but the accuracy is pretty spot on the bow and arrow move in their own ways so you have to adjust both. The graphics are pretty good as well. Super hard to get used to and one world seems like it takes forever to get to the end. Definitely recommend to others\n\nHelpful | 0\nDeveloper Response9 days ago\n\nHi have you had a chance to try the game with the latest updates? Would love to hear your thoughts and latest feedback at hello@superbright.org !!!", "Redforrest1Jul 27 at 10:29 AM\nAim\n\nI enjoy this game with one exception, aiming the bow. Maybe a short tutorial or a short opening level with a red dot showing where the arrow will hit will help. If an on/off was used, one could not get on the leader board let's say. Just having it in a tutorial would work for me. Well made game though. Have a feeling this will be in top ten for me. Arizona Sunshine being my favorite so far. :-)\n\nHelpful | 0", "mark.burton22Jul 25 at 9:11 AM\n\nExcellent game, still leaning it but really enjoy it, spending far to much time in it!\n\nHelpful | 0", "georgi_petrovJul 24 at 8:21 AM\nYep, by far my favorite game\n\nPlayed it for 10-15 min so far and Im really impressed. \n\nHelpful | 1", "Wolvesbane36415 days ago\nGood game\n\nI like the game and give it a solid 4 stars. The mechanics are great. I wish there was more of an explanation on the storyline/premise; like prologue or something during the training tutorial.\n\nHelpful | 1\nDeveloper Response7 days ago\n\nHey cool idea, we might do it. Have you been playing the contest btw? Come talk to us at https://discord.com/invite/9xMrHdp", "nevzat.ersoy.75Jul 24 at 8:20 AM\nGreat but not yet\n\nThere are just so many bugs in this game right now. It really effects the gameplay but it can be my favourite game on quest after those bugs are fixed. Such an incredible game!\n\nTip: Try to use your teleportation abilities effectively during battles. They can be very helpful.\n\nHelpful | 0\nDeveloper Response9 days ago\n\nUpdate - have you had a chance to play the game again lately? Weve made many udpates and fixed most if not all of the early issues and added more stuff to the game, we have a great contest going on to mix things up, and we have a new game mode coming - all hoping to make the game worth the money! You can always reach us at hello@superbright.org and wed love to read your thoughts and feedback!! Hi, thanks for the friendly feedback - we're absolutely paying attention and we'll be fixing these issues soon.", "SynshadyJul 23 at 9:46 PM\nSo much fun\n\nI just bought this and not only is it challenging but super fun. I love the graphics\n\nHelpful | 1", "LASERTEETHJul 26 at 6:24 AM\nReally enjoying this\n\nSimple but evolving gameplay, captivating environments and solid combat.\n\nHelpful | 1", "DAX_Qc15 days ago\nUltra repetitive. Great in 2016 not 2020\n\nIf you want have a sore elbow go ahead buy amd play this game. Ultra repetitive. Graphics are nice.\n\nHelpful | 1\nDeveloper Response3 days ago\n\nUpdate - we have a discord now, come chat with us and we'd love to hav a chance to chat about your feedback - https://discord.com/invite/9xMrHdp Hi, thank you for the review and feedback! While the main part might feel repetitive, progressing in the game unlocks a ton of new things - new areas, new enemies, weapon, arrows, even whole worlds. You can also unlock starting from the games two new worlds, theres a new contest going on and a new game mode coming up! Hope the games fun and worth it! If you have any more feedback or thoughts please reach out to us at hello@superbright.org as we love hearing from our players :)", "MarknessTheDarkness5 days ago\nNot fun\n\nNo free movement you move with golden arrows.\n\nHelpful | 0\nDeveloper Response8 hours ago\n\nYou can enable the free movement in the game's menu (on the controller), please let us know if you have any problems - hello@superbright.org"]