{"App Title": "Ironlights", "App description": "*SCYTHE UPDATE* - Introducing a new class: the scythe-wielding Reaper!\n\nIronlights is a VR dueling game with skillful, fluid, slow-motion melee combat. Test your skills in multiplayer battles, or fight to the top of the league in the huge single-player campaign!\n\nSKILLFUL SWORDPLAY\nIronlights features dynamic back-and-forth swordplay thanks to a unique melee combat system. All weapons shatter on impact, and you have to swing them back behind you to reload them. You cant just wiggle your sword at your opponent. Instead, youll need to parry their attacks and cleverly slip past their defenses in a tense slow-motion fight scene!\n\nCHOOSE YOUR WEAPON\nFrom huge greatswords to quick rapiers, each weapon has its own unique weight and physics. Pick your favorite fighting style, whether youre a Knight or a Ninja.\n\nMULTIPLAYER\nFight online and climb the ranks to claim the title of Champion!", "Purchase section": "$19.99Add to WishlistShareOffers In-App PurchasesComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Roomscale, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Fighting, Sports", "Languages": "English", "Version": "97\n(LIVE)", "Developer": "E McNeill", "Publisher": "E McNeill", "Website": "http://www.ironlightsgame.com/", "Release Date": "April 9, 2020", "Developer Privacy Policy": "Home\nAbout\nThoughts\nContact\n\nPRIVACY POLICY\n\nLast updated January 23, 2019\n\nWhen you visit our website http://www.emcneill.com/, or applications, and use our services, you trust us with your personal information. We take your privacy very seriously. In this privacy notice, we describe our privacy policy. We seek to explain to you in the clearest way possible what information we collect, how we use it and what rights you have in relation to it. We hope you take some time to read through it carefully, as it is important. If there are any terms in this privacy policy that you do not agree with, please discontinue use of our Sites or Apps and our services.\n\nThis privacy policy applies to all information collected through our website (such as http://www.emcneill.com/), applications,(Apps), and/or any related services, sales, marketing or events (we refer to them collectively in this privacy policy as the Sites).\n\nPlease read this privacy policy carefully as it will help you make informed decisions about sharing your personal information with us.\n\n1. WHAT INFORMATION DO WE COLLECT?\n\nInformation automatically collected\n\nIn Short:Some information  such as IP address and/or browser and device characteristics  is collected automatically when you visit our Sites or Apps.\n\nWe automatically collect certain information when you visit, use or navigate the Sites or Apps. This information does not reveal your specific identity (like your name or contact information) but may include device and usage information, such as your IP address, browser and device characteristics, operating system, language preferences, referring URLs, device name, country, location, information about how and when you use our Sites or Apps and other technical information. This information is primarily needed to maintain the security and operation of our Sites or Apps, and for our internal analytics and reporting purposes.\n\nLike many businesses, we also collect information through cookies and similar technologies.\n\nInformation collected through our Apps\n\nIn Short:We may collect information regarding yourmobile device,when you use our apps.\n\nIf you use our Apps, we may also collect the following information:\n\nMobile Device Access.We may request access or permission to certain features from your mobile device, including your mobile devices storage, and other features. If you wish to change our access or permissions, you may do so in your devices settings.\n\n\nInformation collected from other sources\n\nIn Short:We may collect limited data from public databases, marketing partners, and other outside sources.\n\nWe may obtain information about you from other sources, such as public databases, joint marketing partners, as well as from other third parties. Examples of the information we receive from other sources include: social media profile information; marketing leads and search results and links, including paid listings (such as sponsored links).\n\n2. HOW DO WE USE YOUR INFORMATION?\n\nIn Short:We process your information for purposes based on legitimate business interests, the fulfillment of our contract with you, compliance with our legal obligations, and/or your consent.\n\nWe use personal information collected via our Sites or Apps for a variety of business purposes described below. We process your personal information for these purposes in reliance on our legitimate business interests, in order to enter into or perform a contract with you, with your consent, and/or for compliance with our legal obligations. We indicate the specific processing grounds we rely on next to each purpose listed below.\n\nWe use the information we collect or receive:\n\nTo facilitate account creation and logon process.If you choose to link your account with us to a third party account *(such as your Google or Facebook account), we use the information you allowed us to collect from those third parties to facilitate account creation and logon process.\nFor other Business Purposes.We may use your information for other Business Purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Sites or Apps, products, services, marketing and your experience.\n\n3. WILL YOUR INFORMATION BE SHARED WITH ANYONE?\n\nIn Short:We only share information with your consent, to comply with laws, to protect your rights, or to fulfill business obligations.\n\nWe may process or share data based on the following legal basis:\nConsent:We may process your data if you have given us specific consent to use your personal information in a specific purpose.\n\nLegitimate Interests:We may process your data when it is reasonably necessary to achieve our legitimate business interests.\n\nPerformance of a Contract:Where we have entered into a contract with you, we may process your personal information to fulfill the terms of our contract.\n\nLegal Obligations:We may disclose your information where we are legally required to do so in order to comply with applicable law, governmental requests, a judicial proceeding, court order, or legal process, such as in response to a court order or a subpoena (including in response to public authorities to meet national security or law enforcement requirements).\n\nVital Interests:We may disclose your information where we believe it is necessary to investigate, prevent, or take action regarding potential violations of our policies, suspected fraud, situations involving potential threats to the safety of any person and illegal activities, or as evidence in litigation in which we are involved.\n\nMore specifically, we may need to process your data or share your personal information in the following situations:\n\nVendors, Consultants and Other Third-Party Service Providers.We may share your data with third party vendors, service providers, contractors or agents who perform services for us or on our behalf and require access to such information to do that work. Examples include: payment processing, data analysis, email delivery, hosting services, customer service and marketing efforts. We may allow selected third parties to use tracking technology on the Sites or Apps, which will enable them to collect data about how you interact with the Sites or Apps over time. This information may be used to, among other things, analyze and track data, determine the popularity of certain content and better understand online activity. Unless described in this Policy, we do not share, sell, rent or trade any of your information with third parties for their promotional purposes.\nBusiness Transfers.We may share or transfer your information in connection with, or during negotiations of, any merger, sale of company assets, financing, or acquisition of all or a portion of our business to another company.  \n\n4. WHO WILL YOUR INFORMATION BE SHARED WITH?\n\nIn Short:We only share information with the following third parties.\n\nWe only share and disclose your information with the following third parties. We have categorized each party so that you may be easily understand the purpose of our data collection and processing practices. If we have processed your data based on your consent and you wish to revoke your consent, please contact us.\nAnalytics\nGoogle Analyticsand Unity Analytics\n5. DO WE USE COOKIES AND OTHER TRACKING TECHNOLOGIES?\n\nIn Short:We may use cookies and other tracking technologies to collect and store your information.\n\nWe may use cookies and similar tracking technologies (like web beacons and pixels) to access or store information.\n\n6. HOW LONG DO WE KEEP YOUR INFORMATION?\n\nIn Short:We keep your information for as long as necessary to fulfill the purposes outlined in this privacy policy unless otherwise required by law.\n\nWe will only keep your personal information for as long as it is necessary for the purposes set out in this privacy policy, unless a longer retention period is required or permitted by law (such as tax, accounting or other legal requirements). No purpose in this policy will require us keeping your personal information for longer than 2 years.\n\nWhen we have no ongoing legitimate business need to process your personal information, we will either delete or anonymize it, or, if this is not possible (for example, because your personal information has been stored in backup archives), then we will securely store your personal information and isolate it from any further processing until deletion is possible.\n\n7. HOW DO WE KEEP YOUR INFORMATION SAFE?\n\nIn Short:We aim to protect your personal information through a system of organizational and technical security measures.\n\nWe have implemented appropriate technical and organizational security measures designed to protect the security of any personal information we process. However, please also remember that we cannot guarantee that the internet itself is 100% secure. Although we will do our best to protect your personal information, transmission of personal information to and from our Sites or Apps is at your own risk. You should only access the services within a secure environment.\n\n8. DO WE COLLECT INFORMATION FROM MINORS?\n\nIn Short:We do not knowingly collect data from or market to children under 18 years of age.\n\nWe do not knowingly solicit data from or market to children under 18 years of age. By using the Sites or Apps, you represent that you are at least 18 or that you are the parent or guardian of such a minor and consent to such minor dependents use of the Sites or Apps. If we learn that personal information from users less than 18 years of age has been collected, we will deactivate the account and take reasonable measures to promptly delete such data from our records. If you become aware of any data we have collected from children under age 18, please contact us at e@emcneill.com.\n\n9. WHAT ARE YOUR PRIVACY RIGHTS?\n\nIn Short:In some regions, such as the European Economic Area, you have rights that allow you greater access to and control over your personal information. You may review, change, or terminate your account at any time.\n\nIn some regions (like the European Economic Area), you have certain rights under applicable data protection laws. These may include the right (i) to request access and obtain a copy of your personal information, (ii) to request rectification or erasure; (iii) to restrict the processing of your personal information; and (iv) if applicable, to data portability. In certain circumstances, you may also have the right to object to the processing of your personal information. To make such a request, please use thecontact detailsprovided below. We will consider and act upon any request in accordance with applicable data protection laws.\n\nIf we are relying on your consent to process your personal information, you have the right to withdraw your consent at any time. Please note however that this will not affect the lawfulness of the processing before its withdrawal.\n\nIf you are resident in the European Economic Area and you believe we are unlawfully processing your personal information, you also have the right to complain to your local data protection supervisory authority. You can find their contact details here:http://ec.europa.eu/justice/data-protection/bodies/authorities/index_en.htm\n\nCookies and similar technologies:Most Web browsers are set to accept cookies by default. If you prefer, you can usually choose to set your browser to remove cookies and to reject cookies. If you choose to remove cookies or reject cookies, this could affect certain features or services of our Sites or Apps. To opt-out of interest-based advertising by advertisers on our Sites orApps visithttp://www.aboutads.info/choices/.\n\n10. CONTROLS FOR DO-NOT-TRACK FEATURES\n\nMost web browsers and some mobile operating systems and mobile applications include a Do-Not-Track (DNT) feature or setting you can activate to signal your privacy preference not to have data about your online browsing activities monitored and collected. No uniform technology standard for recognizing and implementing DNT signals has been finalized. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically communicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in the future, we will inform you about that practice in a revised version of this Privacy Policy.\n\n11. DO CALIFORNIA RESIDENTS HAVE SPECIFIC PRIVACY RIGHTS?\n\nIn Short:Yes, if you are a resident of California, you are granted specific rights regarding access to your personal information.\n\nCalifornia Civil Code Section 1798.83, also known as the Shine The Light law, permits our users who are California residents to request and obtain from us, once a year and free of charge, information about categories of personal information (if any) we disclosed to third parties for direct marketing purposes and the names and addresses of all third parties with which we shared personal information in the immediately preceding calendar year. If you are a California resident and would like to make such a request, please submit your request in writing to us using the contact information provided below.\n\nIf you are under 18 years of age, reside in California, and have a registered account with the Sites or Apps, you have the right to request removal of unwanted data that you publicly post on the Sites or Apps. To request removal of such data, please contact us using the contact information provided below, and include the email address associated with your account and a statement that you reside in California. We will make sure the data is not publicly displayed on the Sites or Apps, but please be aware that the data may not be completely or comprehensively removed from our systems.\n\n12. DO WE MAKE UPDATES TO THIS POLICY?\n\nIn Short:Yes, we will update this policy as necessary to stay compliant with relevant laws.\n\nWe may update this privacy policy from time to time. The updated version will be indicated by an updated Revised date and the updated version will be effective as soon as it is accessible. If we make material changes to this privacy policy, we may notify you either by prominently posting a notice of such changes or by directly sending you a notification. We encourage you to review this privacy policy frequently to be informed of how we are protecting your information.\n\n13. HOW CAN YOU CONTACT US ABOUT THIS POLICY?\n\nIf you have questions or comments about this policy, you maycontact our Data Protection Officer (DPO),Edward McNeill, by email at e@emcneill.com,or by post to:\n\nE McNeill LLC\nEdward McNeill\nSTE 6 659\n9187 CLAIREMONT MESA BLVD\nSAN DIEGO, CA92123\nUnited States\n\nSign up to receive announcements about my games.", "Space Required": "760.5 MB"}



["5 stars\n66%\n4 stars\n17%\n3 stars\n6%\n2 stars\n4%\n1 star\n7%", "YamaGoon53Jul 2 at 11:45 PM\nAn Amazing Game... But With Flaws\n\nThis is an amazing game. The way it blends the attack and defense with the slow mo is incredible. If I could Id rate it 4.5 stars. However with that said, the projectiles of certain classes are to overpowered. Someone can spam projectiles the entire match and win, even if they are bad at defending. For example, the ninja class can fire extremely fast and you dont have to even be that good with blocking since you have 2 blades. Also the crusaders projectiles can be hard to hit since he can fire them so fast (I say this as a crusader main). If you are reading this developer, it would be nice to have a little cool down after a spurt of projectiles for those classes.\n\nAnother thing I have noticed is a way to make the crusaders life so much more painful. All you have to do is stand as close as possible. This makes it very hard for the crusader to hit you, sometimes causing them to walk out of bounds. I dont know the fix for this, but maybe the developer can think of something.\n\nOne thing that people should keep in mind is that there usually isnt many people online. THIS DOSENT MEAN YOU CANT PLAY MULTIPLAYER. Multiplayer still works, just be prepared to fight some of the same people, as there usually is 1 or more people online. With that being said, the highest number Ive seen is twelve. So please mess around on multiplayer if you buy this game. I do know that this does seem to be like a curse to a lot of VR games, so thankfully there is single player. However, that brings me to my next point.\n\nThe AI can be pretty dumb. I play crusader as mentioned before and... single player can be pretty easy because of one thing. The AI is horrible at blocking the flail. Im serious, sometimes they only successfully block it once, the *entire match*. I dont know what could be done to improve the AI but if you can improve it, it would really make my day.\n\nAll in all, it has some flaws here and there but its definitely worth the money. Its also one of my favorite oculus quest games. I highly recommend, and hopefully once these issues get fixed I can give a 5 star review.\n\nHelpful | 250", "HeadlessS36Jul 29 at 1:56 PM\nLove this game!\n\nOkay so I saw the trailer before it came out and was constantly checking the day it came out waiting. This game is absolutely amazing and it really gets past the main problems with be melee. Some people do use tactics that arent that fun to go against but thats bound to happen. The game itself is amazing but some things they could hopefully add is different arenas. The time change is definitely nice but I dont know if its enough of a change. And the other is the class system is cool but seeing the ai in campaign with different weapon combinations is really cool. And they have different weapons that arent available like spears and the one blades sword and axe and so on. I feel Changing that class system so the players can choose their load out to be more for them would make the game much more fun! Its amazing even on day one but those are just some ideas for possible improvement!\n\nEdit so now it appears they are going with the class system which Im fine with because it appears they intend to continue to add more classes like the reaper. My concern now may simply be lack of skill at the game but it feels like some people online can simply block any attack without fail. I may just not be good but it makes it hard to enjoy sometimes\n\nHelpful | 9", "Larsblom123Jul 16 at 3:42 PM\nreally stunning but...\n\ni bought this game with the 8 gift card that oculus gave us. and i can say. it is 100% worth it!! the graphics are amazing and it has so much good options. a really cool campaign for every single class that takes hours to complete! customizable characters. cool multiplayer system with a nice ranking system. and really cool slow motion fighting gameplay. but there are a few things that i would like to change in this game. the 1st one is making the classes a bit more balanced. there are 3 really overpowered classes (ninja, monk and crusader) and 2 pretty weak ones. (knight and duelist) <this is totally my perspective. the second thing is a sort of exploit which some people use. some people move there body way to much to behind. this makes it nearly impossible to hit especially if your playsspace is small. 3 classes have very small weapons and for those it is the most frustrating. (this exploit is not getting used so much tbh) but it is there! the last thing is maybe a bit sad but it is not always. sometimes there are 5 people online. if none of your friends have this game it will be getting really boring with time. this is not common but it is there. this whats my review! but i have some tips for the game to be seen more in the quest store: first tip. change your game their thumbnail. this thumbnail does not say that it is a 1-1 fightinggame for me. you got to research more in the game to know what it is. 2. i dont know how it works but maybe ask oculus if they can make a daily deal on your game.\n\nthis was my full review!!!\n\nHelpful | 10", "Kaden0102Jul 18 at 8:16 PM\nGreat Game but suggestions to developers\n\nThis game is wonderful but I would fluke to see more classes added in the future like maybe a double sided axe or even add custom paint jobs I would also like to see a endless wave mode and increase the stamina increase. More civil weapons would be scythe,crowbar maybe or even a double sided knife,spear,club,or even upgrades adding onto the weapons I understand that the game is early and I love it. Different maps would be very cool as well and also a game mode where you can fight in normal speed or even when you block you can attack as well. Mainly different classes or\nStuff to unlock would be great\n\nHelpful | 13", "Element1150243 days ago\nAmazing but with a little drawback\n\nThis game is one of the best games i have ever played in VR. The campaign feels so fun to play and the classes are an even better feature. I could go on for awhile but Im going to get to the issue. While there is a lot to play in the campaign There is not so much in the multiplayer and this is because not many people play the multiplayer. I dont think the developers can fix this but in time. So if your looking for a online dueling game this might not be the one. But it is definitely worth the money.\n\nHelpful | 0", "Rocket1359 days ago\nThis game is a childhood dream come true\n\nI've always wanted to have a game where you could duel people but there was never any VR games that were pvp dueling until this game came. It takes both a lot of skill and strategy and the time slow makes it so it isn't just spam and there are 4 PvP game modes and a campaign so there's a lot to do.\n\nHelpful | 2", "ElectroSpaghetti12 days ago\nFantastic with an even better community!\n\nI have owned this game less than a month, and I'm already loving it! The entire combat system is brilliant and makes the game very skill based rather than a DPS race. It has a very high skill ceiling, and each class as a different skill floor, but don't let that put you off! The low level ai is very easy and is great at letting you get used to everything and find your feet.\nAll classes are reasonably balanced: some just have effective techniques that can be pulled off more easily than others, but all are counterable! Some matchups are more favourable, with even some mirror matches being easier on offense than defence, but at the end of the day, it all comes down to skill.\nBut there's one thing I can't stress enough: this game has one of the best communities I have ever seen! Join the discord ASAP: all the pros are on there, and they are all very friendly and willing to give feedback and teach you a few things. No gatekeeping and no elitists, which is really rare in high skill games. Hell, it's a great place to express feedback, no matter your level of experience, and there's usually always someone willing to discuss said feedback with you. It's also proof that the Devs are listening: many features and tweaks suggested there have worked their way into the game. You see the \"community GIFs\"? Those were taken from the discord, which is how I ended up in 2 of them! It really shows everyone's respect when a gif of a fancy finish Vs the ai is taken seriously enough to be showcased in game, and not simply brushed aside with a \"lol noob\" comment.\nIn short, I am very proud to be part of the community, respected like all others, despite being not on par with everyone else there.\n\nHelpful | 2", "SuperLoverBoy12 days ago\nwoww\n\namazing game so far. music is great, combat is unique and tons of content for a arena combat game. dont listen to people giving it one star...they complaint is very very minor and its just players not knowing how to figure stuff out. sure, theyll always be some kind of imbalance but most of the time, it comes down to counter. I just got it but so far its been really fun trying to figure out what works and doesnt. Combat can actually be pretty deep too, theres alot of mind games going on. I also absolutely dig the power slashes for each weapons, makes me feel like a anime character bwahaha. and i can totally see what they were going for interms of the slow mo thing and i gotta say it works. this game can definitely branch out even more for sure given the time. keep up the great work dev! cant really think of anything to add except maybe upgrade a few hand textures and for sure more weapons (gloves, katana, spears) and armor customization, maybe even being able to design our own logo we can put on our front or back side (like in For Honor).\n\nHelpful | 2", "SwimUS2 days ago\nVery fun and smooth gameplay\n\nThis is overall a good game but I would like them to add a few things like more weapons like a katana or a spear. I would also like them to turn down the damage of the reaper class. Beside that stuff I think the game is very good runs very smooth and is very fun. I think this game is a need to oculus quest\n\nHelpful | 0", "freddie.searanckeJul 27 at 11:25 AM\nAmazing, but two minor problems\n\nTo be honest this game deserves a 4.5 stars but as I am sure these will be fixed I decided to give it 5 stars.\nThe game is great and offers (mostly as I will get to later) perfectly balanced kits with ranged attacks and Melee attacks as well. This makes playing in single player against the ai really fun. The devs are also updating the game (as far as I can tell) fairly regularly.\n\nProblem 1: the ninjer kit offers two short swords, which are fine, however they can charge up ranged attacks and end up doing over 2000 damage which is a lot more than any other attack from any other character.\n\nProblem 2: the scyth kit (which is fairly new so I think this one is likely to get fixed soon) is very hard to attack as it can block with the full length of its handle even if it isnt charged up. Secondly when it attacks it hooks around you so you cant disable the blade from hitting you, then all your opponent has to do is full it forward and you just lost a load of health. If this is repeated several times (which it can be) you just cant defend against this hooking manoeuvre as the scythe is so long. This could be fixed my making the handle unable to block strikes one hit, as well as deal any damage. That would stop people from being able to deal near impossible to block strikes (although no everyone does this) would be a lot more fun to play against a Sythe kit.\n\nHelpful | 3", "JustACrispJun 25 at 10:18 PM\nIronlights isnt bad\n\nI bought this game with a free 8 gift card from oculus thanks guys ;) and I have to say it was a steal I saw many controversial comments when considering it but since I have wanted it from when it first came out I got it anyway and I have to say its a really fun game the combat is absolutely perfect some guy was complaining about having to press a in the comments and he has no appreciation for good mechanics this games combat is great a fun game and your weapons fly towards you at the begging of the game making fee like Thor which never gets old however multiplayer is a bit messed up cant lie some classes are way too good and need to be nerfed but Im content playing single player if Im honest its not a waste if theres a deal get it!\n\nHelpful | 10", "TinyTexanApr 10 at 2:23 PM\nIm ecstatic! (One issue)\n\nI first saw this in the coming soon section of the oculus store, and immediately was interested. I saw in the video that he had a kickstarter, so I went to donate! I saw that unfortunately it was already closed, so I couldnt get into the beta. I then miserably waited while I couldnt play the game. Once it finally came out, I immediately bought it and started playing it right away. It is just as good as it looks! Each class had a unique pattern and style that you can instantly get better at. The multiplayer is outstanding, and is definitely the highlight! The only complaint (I wouldnt even call it that) is for the single player campaign menu. Its a little cluttered, and it took me a minute of looking at it to understand what I was looking at. There isnt anything wrong with it, but I would love a little simplification so its more aesthetic, like the rest of the game. Overall, fantastic game and for sure a must-buy for anyone. (Quest user)\n\nSide note, a couple things which dont affect the game very much, but do interest me:\n\nI think a very nice addition would be a simple physics based item, like a large glowing bouncy ball or something, if added to the multiplayer lobby would make a huge impact on the game. I think this simply because sometimes I dont really want to start a full single player match while Im waiting for online, so a simple interaction like a ball would be nice. Plus, the room you wait in looks perfect for throwing something inside of, and looks like it already has some kind of digital barrier because of the pointing laser, so a ball probably wouldnt be too difficult.\n\nSecond, I wondered what the reason was behind leaving the mic disabled? It doesnt affect the game incredibly, but I feel like if you could talk to your opponent before and after a match would work positively with the game.\n\nAgain, these are just ideas. Im a huge fan of this game, and for sure respect what you change or add. Thanks for the amazing game :)\n\nEdit: I found one major flaw with the game, which completely ruins the few games this happens in. I was in a multiplayer match, and was at roughly 3/4 health while he was at maybe 1/5. He was losing badly, so he decided he o take his headset off. Once he did this, he was unable to take damage from me and there was no penalty for him leaving. The only way for me to end the game was by me surrendering and him getting the coins for winning. This is an awful experience, although j blame it on the player, not the developer. So first I say, if you are a player that does this, please stop being toxic. And to the developer, I would highly appreciate if you added a countdown if a player took off their headset, so that if they remained inactive for a certain period they would immediately lose the game.\nThank you dev for creating a great game, sorry that the players are negatively influencing fans like me. Amazing game\n\nHelpful | 739", "Poptopmop7 days ago\nOne of the best games and communities\n\nHello, my names PopTopMop and youre here to wonder if this games worth your money, arent you? In both short and long, ABSOLUTELY. The game has an incredibly high skillcap which some other reviewers havent yet gotten even close to grasping the ceiling of, myself included. No class is overpowered, and everything has its eventual use. The games full flavor comes out if youre dedicated and play well. I highly recommend joining the Discord, the communitys lovely and theres channels to help you become far better at the game. This game is one of the best and one of the main reasons Im active on VR. A must buy for anyone who enjoys PvP. Also, dont fret about the comfort rating, theres\nnearly no locomotion.\n\nHelpful | 0", "LoadedandLocked14 days ago\nGreat game, few additions\n\nOverall, this is a great game, it has fluid combat and awesome weapons. A few suggestions would be:\n-A black accent\n-more armors\n-cleaner UI for the campaign\n-a way to defend against crusader\nAs I said, amazing game, I have spent hours and hours of this quarantine playing Iron lights. A cool addition I think would be nice is more customizable training/matches with a friend. Perhaps they could incorporate the axes or blasters from the campaign. Just a thought.\n\nHelpful | 0", "OreoGamingGeek16 days ago\nFantastic game if you want to feel cool!\n\nSo, I've heard this game compared a lot to Swords of Gurrah, and after playing the two, I'm only coming back to Ironlights. Why? Tl;Dr, it's much more fun. Swords of Gurrah is real time, and the swords \"reload\" over time, rather than being manually activated like here.\n\nWith the slo-mo and the much better reload mechanic in Ironlights, the fights are much more fraught, and you feel like a Jedi master, a ninja warrior, or someone in game 7 of the world series, with the fans cheering you on, the music over the loudspeakers, and it's just you and your opponent.\n\nEach class (ninja, monk, reaper, duelist, knight, and crusader) has a wildly different fighting style with unique strengths and weaknesses, to ensure that no two fights are exactly alike. Find a class to suit your own personal style, or try them all, there really is no wrong way.\n\nWith a full single player campaign added in a recent update, now you don't have to go online against the pros to just learn the game...get your feet wet in the tournaments and gauntlets against capable AI, then decide if battle against a real live human is for you.\n\nThe customization is also excellent, with hundreds of combinations of armor, helmets, and colors for each.\n\nThe developer is still very active on the community Discord, and updates are still coming quite frequently, so now is the time to jump on the hype train if you want a great experience for a long time to come!\n\nHelpful | 0", "2spookycatsJul 27 at 9:45 AM\nGreat start and fun!\n\nThis is the type of game I'm most interested in. Slow mo feature is really cool idea but the attacking defending still feels spammy somehow. I've only logged a few hours at the time of writing, so consider my opinions inexperienced. Overall this is one of my favourite and go to vr apps at the moment. I love the replay function and how easy it is to export the gif.\n\nLast few thoughts:\n\n- I wish i could do bare fists with hand tracking.\n- would be cool to have a throw weapon cooldown seperate from ranged attacks.\n- nunchucks when?\n- i accidently pause a lot when im trying to exit attacking\n\nFun game. Worth trying if you are looking for multiplayer melee vr experience.\n\nHelpful | 0", "alfalfJul 22 at 11:49 AM\nThis game keeps getting better\n\nI dont use my quest too often, but ironlights has been the only game I keep playing. While games like beat saber are built around levels, ironlights is built entirely around its combat mechanics, while it doesnt have the best UI or any out of this world graphics, it doesnt need anything like that. The combination of strategy, skill, and reflexes makes for something that simulates the feeling of combat better than any other game. Not every part is realistic, but almost every part is balanced, skill oriented, and amazing in its own right. And the developers are continuing to build this game from a combat system that functions in a multiplayer setting, to a game with ranked multiplayer, a campaign with rewards, a practice mode, and even a new classes! At its core this game is its combat system, if you somehow dont like it than this game isnt for you. But that system is robust, the community is active, and this game is becoming something that deserves to be on the top page. I can see the day when this game lands a permanent spot right next to Echo VR. Because this game isnt done getting better, and most of the other games Ive played already are.\n\nHelpful | 2", "TrueYeskada20 days ago\nGreat game!\n\nThe only thing I did not enjoy was the slow motion combat, but it does make it unique and add much more strategy than just flailing your arms around hoping to hit something.\n\nHelpful | 2", "darth_sav21 days ago\nGreat but the bots and range is stupid\n\nThe gameplay is great but the bots in the story mode are way to easy to kill if my meter is full I can kill the bosses in one turn pls fix this.range is to strong not only is there no repercussions to using range but it is almost impossible to block especially if it is Someone thats ninja or crusader simple fix for the range problem make it so slow starts whenever a range attack is fired or make it so that you can deflect attacks back at your enemies do either one or both of those suggestions but the online melee is the best sowed fighting experience ever awesome game.\n\nHelpful | 1", "DiabolicOutlaw3Jun 18 at 1:58 PM\nSolid fighting game\n\nI have almost 0 issues with this game. The only thing I would say is we should have a tutorial that shows you how each weapon works and how to really use it to its full advantage. I can use the double sided staff and dominate, but switch to the 2 handed sword and get obliterated. That all being said, its a very solid experience. Each weapon has its own characteristics that you have to learn, each opponent and online player has a different style. The most fun thing is learning on the fly is how your opponent fights and adapting your fighting style to them. Being able to sit back and really think about a plan while your energy builds up (as well as just doing funny stuff with your opponent) is great. The fighting requires you to be able to throw an attack, while simultaneously thinking about where youre throwing the next one. If you think youll remotely enjoy this game, youll love it.\n\nHelpful | 8", "DSpuds8716 days ago\nUpdate took away nearly everything\n\nTo be clear this game is awesome. But once I downloaded the update it took away pretty much all my armour and color options. To get them back requires a ridiculous amount of gold. I do not have time to play this for hours a day to try and slowly get it all back. Making things that are earned is great but I feel as though to take away what I already had when I purchased the game is a low blow. I would rate 5 stars if I got it back but until then I feel cheated and can't refund at this point.\n\nHelpful | 3", "HappyRogue120224 days ago\nThe Best VR 1v1 C[mbat Game! (Almost)\n\nLove this game to bits! Some of the classes have too much of an advantage over the other (ex duelist > reaper) but that can probably be ironed out by getting better at the game. Also, I wish that there were collision physics like the blades blocking each other until they break (like 3 seconds) and the defender might plan to dodge or the attacker have a creative counter to the block. Idk if thats what the game goes for so...yeah. Anyways I give 6/5 stars. Let's get more classes also! I'm sure the devs work hard so devs, thanks!\n\nHelpful | 1", "SupercodeVR16 days ago\nA bit under rated\n\nAlthough the weapons can be unfair sometimes. It doesnt stop it from being one of the best sword fighting games on the quest in my opinion. This is why I wish I knew about this game sooner. But if you are thinking about getting this game, it is a must buy.\n\nHelpful | 0", "aisen1309 days ago\nAmazing game but not 5 stars\n\nReally recommend this game, I have lots of fun with it, but something is just off, its great but it's not 5 star good, but it is a must have on your vr headset\n\nHelpful | 1", "lettucegyyJul 30 at 9:23 AM\ngreat game.\n\nThis is the first melee fight I have bought on the quest and Im happy to say that its actually a really good game. I like how you can customize your characters and need a certain amount of trophies to carry on to later levels. The multiplayer is definitely harder since the AI is kinda stoopid but there arent always a lot of people online. Thats fine though cause I like campaign more.\n\nHelpful | 1", "Deathhawkdown8 days ago\nSolid PVE. Horrible cheesable PVP\n\nSolid singleplayer a blast to play even. But horrible multiplayer. Unless you are going into a private match with a friend you can expect nothing but monks twirling their controllers via wriststraps or spamming bow shots without end. Do not buy for the multiplayer. But if you like challenging singleplayer games then this is perfect but stay out of the multiplayer until they remove the cheese.\n\nHelpful | 0", "FuzzyLegend52Jul 26 at 3:55 PM\nGood game!\n\nI have played this for a day and I'm in love! I just can't tell you how much it is fun to play! It controls very well and it has amazing graphics. I am really impressed and I would recommend for the multiplayer and the Campaign. The AI are a little boring but not to the point they are easy to kill. I would only say if you could duel in a different arena maybe over lava or you could duel in s dojo. I would also like to see some more classes as well. If you like to play a competitive game and changeling one you will enjoy.\n\nHelpful | 1", "eekboiWasTakenJul 10 at 5:28 PM\nAmazing game.\n\nAt first my experience with the game was bad, (you know, learning curve. Bla bla bla) But once I got used to the game and joined the discord server I immediately fell in love. This game is the perfect mix of not only fighting, but strategy and brainpower. You cant just swing your sword (or in my case 2 katars) or a stick all willy nilly. You need strategy for domination. But guess what, that's only half of the battle. You also need to know defense. But don't let the complex sounding review of this game run you off. This game is more user-accustomed (in strategy wise). But one thing I do have to say is if you're not up for a challenging first few matches you shouldn't get this game. But with all games this is true. Have a nice time gaming!\n\nHelpful | 2", "Zombieman_339Jul 26 at 7:09 AM\nVery fun, just have 2 tiny issues\n\nIve been playing this for about 2 months now and its amazing, i love it. The idea and execution are perfect. The only 2 issues i have with it are so small its not worth removing a star. 1. The hand tracking can be a bit out of wack so when you bring your weapon behind you it wont register that you did. But that could just be my oculus, not sure. 2. Playing with friends is easy, however it can only be 2 at a time and you have no way to see the fight. I would love to see a private lobby with more than 2 people so you can play against friends tournament style, and watch it in real time.\n\nHelpful | 0", "Twisted86Jul 25 at 11:01 AM\nAmazing!\n\nThis game is a great game with amazing tracking and gameplay! Whenever I had a problem the developers got back to me within a few hours and told me how to fix it! This game is overall great besides the people that exploit all the glitches they can find I have no problem with it! 10/10 would buy again!\n\nHelpful | 0", "edenkkApr 9 at 11:38 AM\nFun, but not for everyone\n\nI'll start off by saying the game feels very good to play. All the weapons feel unique and powerful in their own ways and along with the nice visuals it's something alot of people will enjoy.\nBecause your'e doing pretty much the same thing every match, it can get repetetive for some players. But every match is against a new player, each with his own playstyle and tactics, so you do need to learn his moves and adapt to the enemy in order to defeat them because the game is more tactic based than other of it's genre.\nOverall, I had a blast while playing, but some might get bored of it. I dare to say it is one of the best multiplayer games on the platform right now, So if you think you will like it, you probably will.\n\nHelpful | 122", "TheRealScooter3 days ago\nDisaapointing, really.\n\nI am a livid fan of all things related to melee weapons like swords, staffs, and spears. I downloaded this app because the trailer made\nIt look like the perfect game for me. I was sorely mistaken. The turn based combat and slow movement is aggravating, and I think its outrageous that your weapon breaks after coming in the slightest contact with your enemys melee of choice. If your a guy like me and just want a good hack and slash game, I would not recommend this app, you should try to find your fun in some other game.\n\nPS: I tried out Swords Of Gargantua, and that filled my needs nicely.\n\nHelpful | 0", "CarapaceiaJul 23 at 11:54 AM\nFun but punishing\n\nIf youre a casual gamer Id recommend staying to the single player mode due to how high the learning curve can be on the game. Tried multiplayer a couple of times and got slammed but still had the most fun Ive had in a while\n\nHelpful | 1", "DeTA_0Jul 10 at 6:48 AM\n4.5 A Game With Alot Of Potential!\n\nIronlights is right now a unrealistic fighting game with unique and cool classes, as well very fun combat and custom gear.\nThough it lacks a bit in the same things, custom gear and unique combat. Although fun, it can get repetitive BUT! As its in early stages I see the game having ALOT of potential as a fighting game.\nSo I rate this 4.5 stars, it easily has earned it.\n\nHelpful | 0", "CoffiGamingApr 7 at 7:58 PM\nTerrific gameplay\n\nThis game is so astounding! Taking my first look into the game, I loved the bright colors and the effects while in battle. Since the game is cross-platform, playing with my Rift friend was easy! Since fighting and blocking is slow motion, it gives the player more time to react, which makes it more strategy-based. This game takes skill, which is built throughout matches. Overall, this game leaves me astonished.\n\nHelpful | 160", "kaylan2010Jul 19 at 1:51 AM\nGreat but one issue\n\nThis game is outstanding! But my one issue is that I cant reach the enemies when I attack them but if Im the ninja it stops it so I hav no choice but to main the ninja\nOther than that this game is amazing\nEdit 1 they patched my bug I was having and now I main the reaper but, the one thing that annoys me is sometimes when you reload your wepon it gets rid of a lot of energy so the attacks are short some times.\nAgain other than that this game is a must buy if your a fan of swordfighting\n\nHelpful | 0", "derpysantaJul 18 at 7:45 AM\nAint nothin to say\n\nThis is an amazing game, and there is nothing bad to say about it! I keep on finding myself going back to it. One idea, there are people saying that their opponents in multiplayer that move around so you cant hit them, or move backwards so the shooter blades cant hit them, my idea is, you lock the characters in place when either are on the defending side. So if someone charged, the other couldnt real life dodge, put maybe if ur charging, you can sort of come in from the side and slowly make your way back to the center. And when you are attacking you can weave around to give your opponent an extra challenge. Again jut an idea but this could help!\n\nHelpful | 0", "IornMan23Jul 13 at 9:33 AM\nBuy with low expectations\n\nThis game was a great idea, it felt like I was playing my dream VR Multiplayer Lightsaber game. But the multiplayer sucks you get paired with high level people who just wreak you. Also the servers are never full with new people so like I said before you get wreaked buy these max players.\n\nHelpful | 7", "kvg1988Jul 16 at 8:11 PM\nBest. Duel. Ever.\n\nMelee combat in VR has always been lacking because there's no way to simulate contact between two objects, which leaves players feeling like they're swinging a wet noodle.\n\nHowever, with it's brilliant blade shattering mechanic, melee combat in this game feels real and intuitive in a way I'd never have thought possible with current VR tech.\n\nBest played with a friend, Iron Lights will satisfy your inner warrior and keep you coming back for more.\n\nP.S: don't be afraid to ham it up! While you'll undoubtedly look like an idiot in the real world striking poses and making hand gestures, you'll look like a champ in virtual reality!\n\nHelpful | 0", "OwlPalsJul 16 at 12:53 PM\nMy Personal favorite VR game, but...\n\nI love this game soooooooooo much! Its my favorite VR title. But the only problem that I have with it is that it is not very balanced. I think this game would be perfect if there was a balance update, and more classes to play as. (Super excited for sythe update).\nBUY WORTH 20 BUCKS FOR THIS!!!\n\nHelpful | 0", "Xanathar865Jul 2 at 11:30 AM\nVery fun game!\n\nI got this game when I saw that it was multiplayer so that I could play it with my friend who has it. The game feels great and runs really well. I only have a couple \"gripes\" about it. First of all I wish there was a way to disable the slow motion melee combat. It would be fun to do so in real time. And if not disable it in real time, disable it in the replay. I also wish there were a few more classes with some more flexibility. Like maybe a \"polarm master\" with a halberd or a \"brute\" with a battle axe or something. The game is lots of fun to play both online and offline. I highly recommend it to anyone thinking about getting it.\n\nHelpful | 0", "LoneWaffle1Jul 16 at 9:50 AM\nNeeds some tuning.\n\nThe singleplayer part of the game is pretty fun and feels great, but multiplayer is Basically flashy rock, paper, sisccers. It is still playable but needs some work. For now just play as a crusader, you'll win every match you play.\n\nHelpful | 1", "Rfite0119Jul 12 at 4:44 PM\nAmazing\n\nI was careful on buying this game to not get ripped and the comments helped a lot to make my decision and when I first plaid I was wondering how to play and when I first plaid after a hour I had the hang of it and felt like Ive been playing for more than a month so over all amazing game definitely worth it\n\nHelpful | 0", "OlliebeaniJul 16 at 5:12 PM\nSo this game is good BUT\n\nSo Im changing my review I originally said that this game has awful class balancing Yada yada yada but I now see this game has a meta and is pretty much vr for honor and it takes a lot to git gud so buy the game it should be an Esport and best graphics on quest\n\nHelpful | 0", "Zsabeast007Jul 16 at 10:10 AM\nLove it but some things could improve\n\nI love this game to death, the main flaw is that it has very little variety in classes, in the campaign the ai use cool classes but the player cant use them, I would like to see those classes come to the game.\n\nHelpful | 0", "Callan_VRJun 23 at 11:09 AM\nIronlights\n\nTo say the least, this game is outstanding. Im only a Silver II at the time of writing this, but Ive still had a lot of fun. I love trying out all the weapon choices and especially love playing the best out of 3 game mode in multiplayer. The campaign mode is pretty fun but I find myself playing online multiplayer a lot more.\nIve seen this in other reviews, but thought Id mention it too. After the tutorial on how to play, I was taken to the main campaign menu with the tournaments and all of that stuff. I was very confused for about a minute. Everything seemed super cluttered and wacky, but after I looked at it for a bit, I figured it out.\nThis game is a wonderful buy for $19.99 (and not to mention they add even MORE weapons to play with every now and then!). If you havent bought this yet, I dont know what youre doing. The concept is great and the gameplay is great, youd be doing yourself a favor to buy this.\n\nHelpful | 2", "Beans_73Jun 5 at 1:29 PM\n5 stars, amazing game and community\n\nNormally Im not one to write reviews at all. But I had to give this game 5 stars ( in numbers I would give 50/10 if I could) because it is overall just phenomenal, and easily one of my most played games. The combat feels so smooth, and I love how the slow motion is used. All of the classes are well balanced so that one is not more powerful than the other, and new strategies are always being discovered for every class. The developer (E McNeill) is super nice and always active on the discord, where the community is also very kind and helpful. I always enjoy organizing matches and participating in tournaments through the discord. Overall, thanks E for making such a great game!\n\nEdit: also, to some of the complaints I saw in reviews saying that they were randomly losing stamina and getting a damage sound, its because youre hitting yourself with your weapon. If you hit yourself in the head with any part of your weapon, you will lose stamina.\n\nHelpful | 5", "ToasterChan06Jul 23 at 5:07 AM\nGreat game\n\nI've been playing this for a long time now. The community on the discord is great, I have so many hours into this game, people dont give it what it deserves, the slo mo is great, great game 6 / 5 stars if I could\n\nHelpful | 0", "FirePrime2007Jul 5 at 7:30 AM\nBest VR fighting game I have played\n\nIt is a great game but there is some work that needs to be done.\nThe lobby look great and all but it makes me feel like Im playing as a millionaire rather than a gladiator, maybe make it look like some sort of barracks of the arena with some models of enemies.\nI also think that the weapons should have some skins/different looks to chose from.\nOne last thing I have to say is that there needs to be more weapons/classes to choose from.\nI think these changes would really help the game out with more people.\nOther than that this is the best fighter game in VR that I have played and thank you for making this game for people like me to play.\n\nHelpful | 0", "cake_runicMay 19 at 12:42 PM\nAMAZING GAME\n\nThis game has taken 20 hours out of my life and I loved it. The discord server is amazing and kind, and the fighting style is very satisfying and feels real to use. 50/10 amazing game buy this rn. Thank you E McNeill for making the greatest game in my VR library. I hope this game keeps getting better and better. I hope this helps! Bye!\n\nHelpful | 8", "Code.Killer0612 days ago\nI win\n\nThis is a game like\n\nHelpful | 2", "ElyVR5 days ago\nDefinitely worth buying!\n\nJust get it. You'll love this game! See you in the arena\n\nHelpful | 0", "MASTBBBJul 2 at 9:44 AM\nPlease add a class that dual wields\n\nI love this game I really love it I may even call it the best vr game on the quest but I have one request add more classes like a class that dual wields swords this is such a great car game and I love it so much it keeps me entertained in quarantine and the slow motion idea of the ga,e is so sick I love it keep on updating the game I will be waiting.\n\nHelpful | 1", "ReukifellthApr 9 at 11:22 AM\nsimply fun\n\nThis game really rewards you for maneuvering around your playspace. I've found myself ducking, sidestepping, weaving, and even jumping over peoples weapons at times, in addition to the standard \"block and parry\" system. This game really encourages you to show off and I think its a perfect title for the oculus quest, one that really takes advantage of the quest's roomscale tether-free tracking. Wired headsets are going to have a worse experience simply because you can't spin around like a madman like you can on the Quest. The combat might feel weird at first, but with enough practice you'll be the lightsaber gladiator you've always wanted to be...\n\nThe developers are super receptive to feedback and have shown that they are committed to making the best game they can, with regular content updates soon to follow. Can't recommend this one enough.\n\nHelpful | 41", "Aldo12345Jul 22 at 5:40 PM\nAwesome but needs more classes\n\nSome classes I think if is a class with a hammer,nunchuck,dual sided axe,trident and a lot more other stuff but another thing that would be cool is some mods like blades and sorcery\n\nHelpful | 0", "AslanTheLion62Jun 14 at 5:25 AM\nIron Lights Review !!\n\nI love this game !!!! I competed on a Fencing team in school so to find this game was exciting for me. The graphics are great the game quality is great like some one else said the only complaint I have is that the Chat feature is missing and the developer has assured us that that will be coming in the next update. I am 58 yrs. old and disabled now so I cant exercise as actively as I did as a teenager and this game along with a few other s I found for my Oculus Quest let me get some of that exercise!!!\n\nHelpful | 2", "MagnusHawkJul 21 at 5:20 PM\nNot my thing\n\nDont get this game if you expect a wild battle between armed foes in coliseum. Save that for some future gladiator game. This was surprisingly slow and tedious to me. I definitely struggled with the rules. Overall just not what I expected and I dont think that what gameplay was there was executed to a standard of structure that I would have expected.\n\nHelpful | 0", "freddie.greenJun 8 at 2:05 PM\nGood but can improve\n\nOverall a good game but some classes are a bit overpowered for instance Theres a class in the game that you can swing it around and since Im a kid they can swing it to the back of my head and so I cant block it but this is a good game and I do recommend it\n\nHelpful | 2", "Minimum_DosageJul 17 at 10:34 AM\nGreat take on melee but not comfy for me\n\nStanding positions between fighters is fixed (if you step outside the small \"ring\" of your position you get penalized) and in my opinon fighters are forced to stand far too close to each other. I feel like I'm forced to stand virtually chest-to-chest which I do not like, is hard to get used to, and feels wrong. I used to fence though, so what I expect is very different from how the game is built.\n\nShort version: As a former fencer, the spacing between fighters feels claustrophobic. Fighters are forced to stand far too close to each other. But I think the innovations and ideas in making melee work in VR are great ideas.\n\nHelpful | 1", "Sir_McCrabbsMay 21 at 11:42 PM\nGreat game!\n\nVery fun game. It has a bit of a sharp learning curve but when you start getting the hang of it you can go nuts with the game. It handles smoothly and doesnt make me motion sick like many VR games.\n\nIts easy to pick up depending of the class you pick, but if I had any complaint about the game its how going through the campaign mode is just more of the same of itself through the whole thing. Most of the replay-ability is in the use of different classes.\n\nOverall, the gameplay is spectacular, fluid, and smooth and has a multiplayer that I enjoy for a change...\n\nHelpful | 3", "Nightflame456Jun 30 at 5:05 AM\nOne of the Best Quest Games\n\nAfter about 14 hours worth of gameplay, it still hasnt gotten old. You are still able to fight opponents, even after every tournament has been completed. I do wish that the levels with Bosses were able to be revisited and replayed, but other than that, brilliant concept!\n\nHelpful | 0", "DontPvnicJul 25 at 2:55 PM\nDecent\n\nIt would be an amazing game but I dont like the slow motion and how weapons go through each other instead of bouncing off. I feel like it would be much better if the slow motion was removed and weapons when hitting each other would bounce off.\n\nHelpful | 0", "Mxnty24 days ago\nE\n\nYou should add a Spartan Class with a Spear.\n\nHelpful | 2", "Warconer19Jun 22 at 9:22 PM\nAstounding work\n\nI've played this game for a while, and it is fantastic! While the slow motion combat is akward when you first start out, you learn to slow down with your strikes. The multiplayer is awesome, and the modes it has are great! However, most of them feel the same. I had an idea for a very different mode. It would be a 1v3 gamemode, where the 1 player has extra health and damage, and maybe a special weapon like the dual axes or the triple bladed sword, like the weapons bosses use. Meanwhile, the team with 3 players can only use stuff like a one bladed sword, a short mace, a knife, or gun. Just a thought. Overall, this game is a joy to play, and I'm sure I will keep playing it for a long time.\n\nHelpful | 1", "vik.sharma.12Jun 11 at 3:04 PM\nDecent\n\nThe graphics in this game are great with the bright colours, shadows on players, huge stadium etc. Fighting feels really cool with the slow motion and when delivering the final blow the opponent shatters.\n\nHowever, it feels like something is missing with the fighting as it doesn't leave me fully satisfied. Most of the matches feel one sided. It's either some battles are too easy or you get completely obliterated...\n\nHelpful | 4", "ParzivalPlaysJun 14 at 9:47 PM\nGood game\n\nI like it a lot and love playing it for hours but I will say that it is not to easy to get used to the slow motion though cool dose make it hard to do things the way they you want however once you realize the limitations of slow motion the Benefits start to shine through over all it is a good game but maybe only worth $15 not $20.\n\nHelpful | 1", "UGC-ARCHANGELJun 21 at 3:02 AM\nTHIS IS SO WORTH IT\n\nI just have to say all those people who havent bought it yet or are haters yall are really missing out its super fun but one thing I dont like in the lobby instead of starting a single player game while you wait for a match make it to where there are activities while we wait besides that I love it\n\nHelpful | 1", "blak3th3lak3Jul 8 at 5:51 AM\nGood game\n\nI really like the game personally. It has good game mechanics and is just really fun to play. Its a me of those games you wont get tired playing this game either making it where you can play for a longer time.\n\nHelpful | 0", "DrySandshrewApr 8 at 7:00 AM\nThis is what you've been looking for\n\nI've always loved my Quest and the VR experience, but I have never found a VR game that I just couldn't put down. Until Ironlights. The single-player tournament style lets you build up your fighting skills and the 5 different classes (i.e., Knight, Duelist, Crusader, Monk, Ninja) are so versatile that most anyone can find a character they like. The multiplayer aspect was a huge selling point for me. With cross-platform capabilities, I can play with my brother on his Rift and other Questers. If you are on the fence about Ironlights, tip over and join the dark side.\n\nHelpful | 52", "GatorTazorMay 20 at 12:41 PM\nThe Game The Quest Needed\n\nThe oculus quest, if you ask me, has lacked quality. You know how Nintendo, PlayStation, and Xbox all have that one franchise or game you buy the console for? Oculus didnt have that.\n\nUntil now.\n\nI honestly think Ironlights is gonna be that game, the breakout game thats gonna make the oculus quest popular and push VR into the mainstream!\n\nI look forward to updates and being a part of this games community just as I look forward to playing the game every chance I can!\n\nHelpful | 3", "TigerEyeGTJun 29 at 11:56 AM\nHi there\n\nThis game is extremly fun and I say that you should try it. It hs a cool leveling system, fun weapons, and good graphics. When you first try it it's a little hard but after some practice it's extremely fun. A few things you should know is most of the weapons are for tour right hand and the staff is the only left handed one also make sure you have space to move around.\n\nHelpful | 0", "Danu_Jul 12 at 12:52 PM\ngreat game\n\nthe interface is a bit confusing but the gameplay is stellar. i absolutely lives the game and would highly recommend purchasing\n\nHelpful | 0", "wdwrightMay 22 at 6:23 PM\nNot at all what was shown\n\nThis game is probably not what you think. When you watch the trailer and it said that the time scale is 30%, thats not where they slowed the trailer down to see the action. Thats literally HOW THE GAME IS PLAYED. If you move your hands too quickly, your weapons literally trail them at an excruciatingly slow pace. In addition, you are not standing toe to toe in an all out battle like you are lead to believe. You cannot simply attack and defend. You have to grapple yourself to approach your opponent and when you do, you are attacking in slow motion. All they can do is defend. Then you run out of energy and they come to you, and now all you can do is defend. If I had known the combat was like this and it was only slow motion fighting, I would not have wasted my $20. So please dont be fooled by these developers and the trailer like I was and dont bother with this title.\n\nHelpful | 53", "VrMaster85Jun 15 at 1:37 PM\nAwesome but 1 dislike\n\nIt is a really fun game but I don't like something about the new update the armor I had was my favorite armor pair but now it cost soo much coins I think you should lower the price of the armor because it is pretty big amount that will take me forever to get and I am kinda a beginner but does it take long to get coins. I am sad that armor is soo much coins. But overall the game is one of my favorite games\n\nHelpful | 0", "sibi.nlg21 days ago\nGame mechanics is boring\n\nI have tried the game for couple of minutes and the game is not at all interesting..the game mechanics is boring.. The worst part is the developer refused the refund request.. Even though I returned a few minutes after purchasing the game.. Too bad\n\nHelpful | 2", "YT8BitFoxyJul 11 at 10:28 AM\nAmazing game\n\nI got this game not to long ago and I love it. Problem with me is that I get to sweaty and have to get off early. But that is totally fine, but everything else is amazing!\n\nHelpful | 1", "tacobottleJul 23 at 6:10 AM\nAmazing feel\n\nIm not sure how to explain it but it just is so fun to move around in this game, definitely recommend!\n\nHelpful | 0", "Narutoby218Jun 3 at 8:08 AM\nVery good game with one major issue\n\nWhen I saw this game I knew I had to get it and it was great. It had fun mechanics like super hot and a good multiplayer mode. For me the only issue is the hand tracking while when in slow motion. Basically in this game when you rush to attack it always goes to slow motion(Which is fun and a cool mechanic) but it makes attacking uncomfortable. Also some of the bots arent really in slow mo while defending from your attack. The only other thing that I would say is that the weapon for the knight can chip through other weapons\n\nHelpful | 0", "TalbotLeagueJul 11 at 10:24 PM\nthere is a lot of good in this game but.\n\nSo this game really is a good game and I play many games but this is one I sadly wouldnt recommend,and one of the reasons why is this:multiplayer I find it is lot of fun but people can find ways to fight without having to break a sweat. This is hard to believe everyone I faced in multiplayer had a cheap trick to defat me and I think this makes multiplayer unplayable in my opinion. For example I was against a guy with the knight class and he charged up his energy and charged in and swong his sword where it had no weak points and keep in mind Im trying to block it in SLOW MOTION and it made it near impossible to block it and I couldnt even fight back and that is why I dont play multiplayer. If there was a fix to this it would help and Im sure many people would play the game more. And campaign is great I like how it is different from any AI I have encountered so thats all from me.\n\nHelpful | 0", "StonesthrowApr 8 at 5:05 AM\nJust feels right!\n\nThe developers really nailed how to handle weapon duels between two players in VR. Above all, that's what they've done here. By slowing down time, separating who is attacking and who is defending into turns, and then adding a certain strategy to deciding when to attack, they did what I never thought I would see in VR... combat that just feels right! I've played through all of the classes and they are distinct enough that each one has it's own strengths and weaknesses that don't seem contrived or tacked on. I recommend this one!\n\nHelpful | 21", "david.martinez105 days ago\nBoring\n\nThis game doesnt require skill at all, its super boring wish i never bought i couldve bought a much better game.\n\nHelpful | 1", "Archimedes2.0Jul 10 at 1:02 PM\nNot a sword fighting game\n\nIf your looking for a sword fighting game this is not it. The melee is in slow motion which means that there is not real time sword or weapon movement. The reason I rate it so low is that i was expecting more of a duel game but it turns out to just be a gimmick that get super boring after around an hour or two.\n\nHelpful | 0", "Ronnie6079Jul 24 at 3:55 AM\nBrilliant\n\nThis is an amazing game I love the multiplayer and the campaign it teaches so much I love i\n\nHelpful | 1", "DiamondgamerkingJun 15 at 7:38 PM\nWARNING: BEST GAME EVER\n\nI had so much fun playing this game! It was super cool super amazing and even more addicting. When you pick it up you cant put it down. I love this game.\n\nAlso I actually just had one thing to ask if you could add it to the game. It would be amazing if we could actually do something with coins because right now they are completely useless. Other then that this game is amazing\n\nHelpful | 1", "UchidanApr 9 at 9:46 PM\nSadly not a Melee focused game.\n\nI was so excited for Ironlights! A multiplayer sword fighting game? Sign me up!\n\nProblem is there is hardly any sword fighting. People have quickly figured out that in multiplayer, all you need to do is shoot at someone constantly. You wont be fast enough to block every single one of them since some of the weapons are ridiculous. So theyll get your health down eventually because for some reason it does MORE damage than melee attacks. Played many multiplayer matches and every single player did the same thing. Shoot constantly. Hardly ever charged me. Really ruined the experience and theme of the game.\n\nI went into single player and found out you can cheese the AI opponents the same way with the Ninja class. Just constantly shooting at them and youll win every time. Shooting should take a lot more energy to use, and not do more damage than melee attacks.\n\nHopefully this is addressed and MELEE FIGHTING is the main focus, not shooting.\n\nHelpful | 80", "MaxVrGmApr 26 at 7:16 AM\nIncredibly addictive\n\nthe game is really fun to play and the sword fighting feels incredible\ni would recommend it to anyone new to VR. i would like to be able to use some of the weapons that the opponents get to use in the game\n( like axe, spear, mallet even the gun )\n\nim really happy with the game and have beat the world championship\nwith knight.\n\nHelpful | 5", "Pablo_69May 27 at 6:36 PM\nHeight problem\n\nI think the game is fun and all but there is one problem. Height , when my friend came over i let him play on my oclus, he is 6'4. Ince he tried to play, he kept taking damage because he was \"out of bounds\" all he was doing was standing up and died instantly. In order to play he has to get on his knees. THEY NEED TO FIX THIS. OverLl i thought the game was we fin untill i found this. If your tal, you cant play.\n\nHelpful | 7", "wargiantApr 25 at 9:36 AM\nDream come true!\n\nI've always wanted a good medieval experience where people dont just wiggle their swords for easy kills and this game does it perfectly with its many classes that all have strengths and weaknesses and the fact that this game takes actual skill and perfection to get good at. I hope in the future they add so much more and make the game even better.\n\nHelpful | 8", "spyknight2Jun 9 at 10:55 AM\nGreat game\n\nThis is a game for people who want strategy but also cool slo mo in the process. You pick from 5 or 6 classes and each have a unique shooting ability. The classes are knight who has a long sword, ninja with two daggers, a Valkyrie class which has a sword and small shield, a monk class which has a staff, and a heavy hitting mace class which shield. The multiplayer is fun although I am still in bronze so I dont know if it will turn annoying with higher ranks. The campaign is fun but challenging. You can rewatch any of your matches by da wing the replay at the end, and there are private matches for those who want to play with friends. It is only 1v1s no 2v2s which would be kind of cool if they added.\n\nMy only suggestion would be to add a class with twin battle axes. I see some reviews also saying that taking their headset off makes them immortal but I think they fixed it by making them take damage if they are outside of a certain zone.\n\nHelpful | 1", "Legend_Gamer780Jun 9 at 9:44 AM\nGood, but one issues I saw\n\nIts is a really great game, the different classes make it so fun! I play this game all the time, one issue I had is the lobby, I just wish for something a bit more than a box, you know what I mean? And a suggestion is to make, kinda like a story mode? I know it would take a lot of time, but I feel like the game would be so much more fun!\n\nHelpful | 1", "TheGridGam3rApr 27 at 12:51 PM\nOne of the best fighting games out rn\n\nFirst saw this game on coming soon. Slow motion fights and different weapons, against other people? Interesting! It does feel simple but each class has its own style and definitely hard to master and find new moves. This is definitely worth the price and im hoping for more content along the way. Sometimes it feels like the weapons dont want to replenish but that could just be me moving a little too quick for it to follow. All in all, great game. Get it and fight in the arena!\n\nHelpful | 3", "Iamme1Jul 16 at 7:36 PM\nGreat game\n\nIf you like a strategy game with swords and different classes this is the perfect game for you it is for me\n\nHelpful | 0", "God-of-memesJul 30 at 11:20 AM\n\nWould recommend to a friend\n\nHelpful | 1", "BanciuJul 28 at 12:17 PM\nThis game is absolutely horrible\n\nControls are clunky, mechanics are not what they should be at all, it shouldn't be a turned based game where one person has a massive advantage over another just for having a small shield.\n\nHelpful | 1", "ShadowHunter_313Apr 9 at 11:37 AM\nVery unique and fun! However...\n\nJust so you know, once you make an attack you have to lower your weapon down by your side and reset, this eliminates spamming and sword waving on multiplayer!\nMy only complaint is that multiplayer seems unfinished.. its almost pointless, all you do is matchmake and fight, after that nothing happens, there is no record keeping, no leader boards, no customization (except outfit and class type) at the end of a fight if you win it says you get coins, however I never received any.. hopefllly its a big but for now I rate a 4 for a cool, yet incomplete game\n\nHelpful | 8", "IsahootanJul 10 at 9:30 AM\nAbsolutely phenomenal\n\nBeing someone who played the beta i can say this game deserves an award. I always have a blast in all my matches even if i lose.\n\nHelpful | 0", "robotoverlord40Jun 17 at 12:43 AM\nOutstanding game\n\nI recently got a quest and saw this game and knew I had to try it. The gameplay is amazing and it really takes skill to get good at the game instead of waving your sword around and winning. So from me a 10/10 on this masterpiece.\n\nHelpful | 1", "aaron.sommers.1253Apr 14 at 11:49 AM\nIronlights\n\nI love sword fighting games, and the new style ironlights has to offer. So much fun, and really looking forward to seeing the online competition. Great job Devs, looking forward to everything else that is coming to the title. See you on the battlefield . Needs balance but still love, also we need working hands, and weapon slots, thanks.\n\nHelpful | 7", "GuyHeroJun 21 at 12:24 PM\nNeeds a samurai class!!\n\nI would love to be able to use a katana weapon in this game. Make it as strong as a knight and one durability like the rapier. Maybe not as strong but better damage than the rapier at least. But i think you should remove the slow motion part after you win. It kinda takes away from the immersion\n\nHelpful | 0", "I_Am_SpiffJun 19 at 8:02 PM\nCool weapons, meh combat\n\nTL;DR\nA star for costume customization\nA star for how cool the weapons are\nA star for scenery\nNo star for the combat system\nNo star for interaction with AI/Players\n\nThe way you can make your character look is awesome!\nEach \"class\" of weapon is amazing, aside from how annoying shields are.\nThe stadium setting is epic!\nThe \"slow effect\" for the combat is frustrating, especially the mechanic of having to pull your weapon back in order to use it again. The mechanic is good for offence, but terrible for defense.\nWhen you attack your opponent you get pulled in way too close at times and it gets overwhelming.\n\nHelpful | 0", "GREENnite490Apr 26 at 10:04 AM\nAmazing game but can be frustrating\n\nThis game as astounding, easily one of the best games on the quest and possibly oculus, but it has small quips that can be extremely annoying, example being, theres a chance the when attacking you will randomly lose chunks of energy slowing your attacks, while the enemy doesnt have the same problem, similarly, the difficulty may say balanced when in fact you are at a severe disadvantage. Highly recommended aside for the small quirks.\n\nHelpful | 3", "EleyonApr 9 at 11:23 AM\nE-Sports Worthy!\n\nThis game has nearly mastered what it means to have competitive melee combat in VR. The graphics are well polished, and the gameplay feels smooth. Each class feels so unique, and I've had troubles taking off my headset after loading up this game, it's a blast!\n\nHelpful | 14", "TinyNMay 29 at 2:02 PM\nSmall Complaints for a Great Game\n\nI was lucky to find this game. It was not in the spotlight or in any of the collections I could find. But spinning a staff or wielding a greatsword caught my interest, and I'm glad it did. The simple controls disguise the in depth gameplay and make this one of the best \"sword fighting\" games on Quest.\n\nComplaints:\nStaff spinning should block projectiles. It's unique to the staff and would add some flair to the gameplay.\nMonk arrows projectile speed needs a slight increase. It's much to easy to block the slow shots currently.\nCrusader class should be blockable by the chain. Just the ball of the morningstar makes it incredibly difficult to judge a skilled player's attack, especially with a small weapon like the ninja. Perhaps make the chain do damage on connect to make up for it, though less than the ball.\n\nThank you for making a great game!\n\nHelpful | 1", "FilazaferJun 2 at 2:22 PM\nRepeative with potential\n\nThis seems like a demo of an idea that one day might work, but right now I dont think its very fun. Unlike many VR games this doesnt feel real. It feels like slowly swinging your arms in different directions, but doesnt feel like swordplay. I can appreciate the developers thinking outside the box to try and make it work, but this is not for me.\n\nHelpful | 3", "narnooApr 28 at 10:20 PM\nMy favorite game\n\nThe combat is in slow motion and you take turns going offensive and defense. It's a lot like street fighter in you must adapt to your opponents strategy and adjust yours at the same time. Lots of variety in the classes and each matchup feels totally different. Try it out if you like fighting games, sword combat, or strategy heavy competitive games in general.\n\nHelpful | 4", "Lexworld6 days ago\nNot good do not buy\n\nSLO motion always on very slow and boring would be good if you could turn it off\n\nHelpful | 0", "ThedubyahJul 20 at 5:17 PM\nAmazing\n\nI just say this game is amazing\n\nHelpful | 1", "howtheturntables20 days ago\nGood game...sort of\n\nGot clickbaited but the children love all of you\n\nHelpful | 0", "astonthered25 days ago\n\nGood game and good graphics but hard to get the hang of and control\n\nHelpful | 1", "drew.dowdy50Apr 18 at 11:00 AM\nFeel like a cyber gladiator! A must have\n\nThis is by far one of the more polished games in the\nquest Ive tried so far since getting my unit last December. The graphics are some of the crispest Ive seen yet, even in the class selection and menu room. When you jump into a match, if its daytime check out your shadow. Its a small thing but its so clean and well done. The dev really put heart into the graphics here. The game play mechanics work seamlessly to provide the best melee combat in any game Ive seen so far. Its obvious that the dev really put a lot of thought and heart into this game! Need more like this to be sure!\n\nHelpful | 5", "M4ximlnApr 9 at 5:42 AM\nGreat game mechanics and developer team\n\nE McNeill created some of my all time favorite Oculus Go games. With this new game, he really shows off the results of his past experiences with (A) VR development in generell and (B) strategy games. Of course, Ironlights is no strategy game, but the 1on1 matches feel very tactical and the design of the vastly distinctive classes creates unique experiences while playing with each one of them. If you enjoy strategic, skill-based PvP (or PvE) and want to support a VR pioneer developer, buy this game.\n\nHelpful | 9", "KyoukiKuukiApr 14 at 8:31 PM\nLearning to fight!\n\nI had been watching for this release for months and wish I had chance to in beta. But the game play really fun and helps you train how to hold the weapon to block. Would be great for teaching lessons.\nIt takes a while to get use to slow down time. But you get the hang of it and that best way to help you learn your defensive stance.\n\nWhat I would love to see is co-op! You have two bad guys comming at you. 2vs2 might be fun.\n\nAlso sign me up for real PvP torments.\n\nAlso, be careful not to step back to much!\n\nHelpful | 4", "MoneybagvrApr 12 at 2:06 PM\nGame and discord\n\nUpdated review if u dont want to sweat not the game for u if u want to seat down not the game for u now thats said other then that one time on the discord I've never returned to I think my review stays the same but on a another note its funny to see a developer say u can ask questions now I'm glad to see that as changed\n\n\nThe game is fun there's a learning curve u going like it or hate for me I love it\nThere are so many ways of beating your opponent the A1 is refreshing it always look like a real person your fighting there's no leaderboards for now but coming I will update as I play more\n\nNow as for the discord if u like me and have alot of vr friends that ask me questions dont ask the developer question on the discord I got into trouble they really need to be alittle more friendly with the people that are paying and not getting the game for free\n\nBut i still recommend this game\n\nHelpful | 4", "stupidearthlingJun 8 at 7:29 AM\nWhy the slow mo\n\nThis game looks awesome and is everything I have been waiting for. But..... Why the slow motion in combat. It totally ruined it for me. I found it so frustrating that the combat was lagging behind I didn't even complete a match.\n\nMake it real time and it will be perfection.. if the slowmo is part of the training, then I'm sorry, but it lost me. I want straight in to the action.\n\nI will keep an eye and repurchase if that changes\n\nHelpful | 3", "CaptainMcLemonApr 14 at 11:11 AM\nA few quirks, but an amazing game\n\nTLDR: Amazing game, executed well, thriving Discord community, only a few minor issues.\n\nThis is an absolutely amazing VR combat game. If you enjoy any form of VR melee combat, buy this game. It has a class system with any weapon to fit your play style, from a giant sword to a staff. There are plenty of enemies to fight that make you switch up your tactics and give the game great replay value. However, I do have a few complaints, but they arent necessarily game breaking.\n\n-Blocking glitches out in single player (but not multiplayer) quite often, weapons will slip through blocks and attacks wont register (doesnt happen too often but sometimes)\n\n-Campaign is a little too short and max rank is too easy to obtain. The campaign is fun, but the multiplayer and community is really where its at. A campaign upgrade would be nice though.\n\n-Background is a little bland, but its not a big deal at all since youre focusing on the enemy most the time anyways.\n\nThis is really an amazing and impressive use of Quest hardware and I highly recommend it. Even if there are a few small issues, this idea was executed extremely well and deserves support. One of the best things about this game is the community. People are active all the time on the Discord (I was up at like 2am and there were 10+ people looking for opponents) so if you want to talk to devs and the community, check out the discord. Devs interact with their community often, so if you have suggestions, you can ask them and they usually respond promptly.\n\nTo anyone who read all the way, thank you so much!o\n\nHelpful | 7", "shawnathan42May 10 at 9:07 PM\nGreat game\n\nI just want to say that this game is amazing, it performs very well and it is extremely fun. It might not be for most people but its great for me. My only problem is that there is this crappy tactic a knight could do on multiplayer and it makes them immortal. Besides that, i think its awesome.\n\nHelpful | 2", "imtheApr 20 at 11:20 AM\nAmazing, with the exception of balancing\n\nThis game is honestly amazing. It has beat saber levels of immersion while bringing strategic combat into the mix.\n\nHowever, this isnt why Im writing this review. I wanted to point out an issue I have with the game that breaks a lot of the classes after a while. All of the classes in the game have a Rock Paper Scissors scenario, except once youre paired against the wrong class youre stuck fighting and losing for the duration of the game. Matchups such as duelist vs assassin, knight vs crusader, crusader vs monk all work very well.\n\nUnfortunately, fights that involve a knight and a duelist, for example, really dont work. Its extremely one sided when the duelists shield breaks, which is very quickly, which leaves the knight to get constant easy damage in due to the duelist having no way to defend against it.\n\nThis is just one example, and there are many other matchups that play out similarly. This may be hard to balance out, but I hope the devs do something about this (please do if youre reading).\n\nAgain, one of the best games available on the quest, well worth the money, I just want this issue to be seen.\n\nThanks for delivering such a great game to us!\n\nHelpful | 5", "ThermalTurboApr 10 at 5:17 AM\nLooking for swordfighting? You got it.\n\nIronlights is a brilliant game, with great yet simplistic visuals (real time shadows, multiple different arena lighting variants) making it a good game to just look at in general.\n\nAs for the gameplay you have adrenaline fueling, high octane duels with melee combat in slow motion, giving both players a chance to attack and defend in different ways, and is definitely a different spin on the genre, and also a change in how most VR swordfighting goes: rapidly swinging without any thought behind it. In fact, you can't even swing that rapidly sometimes, your weapons shatter on each hit and you need to bring yours back behind you to refresh it!\n\nThe gameplay elements make for a different take on the genre and it's extremely refreshing. The developer has more content and fixes coming down the line of course, and you can even talk to him in the official Ironlights Discord.\n\nIt's priced great at $20, and of course you have nothing to lose for trying it, if you don't like it, just refund it, but I can imagine you will like it!\n\nHelpful | 8", "ARandomGuy08May 8 at 1:09 PM\nPeople are confused (not me)\n\nI personally love this game, it is unique and different to other types of games and i love the new aspect it brings to vr fighting.\n\nMany people are rating lowly because the weapon lags behind ,this is in fact on purpose to add a sense of weight to the weapons. (Duelist weapons move faster than ninja and ninja is faster than knight etc) This is to add depth and more realistic gameplay, as in slow motion you obviously should move in slo motion otherwise it would be gamebreaking (as you could just spam and instantly win) Please do not rate Iron lights lowly because of this, and any players of thinking of buying this, i recommend you do as i find it amazing!\n\nHelpful | 1", "BlackysBroJul 13 at 7:14 AM\nGreat Game\n\nSwordplay is very fun and feels great. GET IT!\n\nHelpful | 0", "JMD123_Jul 16 at 11:57 AM\nYes\n\nYes very good fun game\n\nHelpful | 0", "xxae8Apr 9 at 12:40 PM\nBrilliant game so far\n\nAfter play around 1 hour of the game i thought it was very good. I enjoyed the physics and the easy way of controlling your actions. There 100% will be a character for you, mine is the ninja, the customisation options are amazing. The characters each have their specialties which is quite clear. its is very satisfying to finish someone in this game as they crumple to pieces. The different types of stadiums hype you up and the campaign is pretty good. I am yet to experience the multiplayer as i gave up after it took a while.\n\nCons\nDisclaimer: i know that this game is in the early stages and there are updates coming that is stated in the game.\nIt would be better if your hands werent as fists. The slo-mo mechanic for when you kill someone is not great as it takes you out of the emersion. Better multiplayer... And the area where you chose what you are going to do or wait, is too plain as it is just a box.\n\nApart from that it is a great game and one of the best that i have seen come out for a while!\n\nHelpful | 7", "RUN-N-GUNJul 11 at 6:35 AM\nGREAT GAMES\n\nSmaller player base but very good fun and intense\n\nHelpful | 0", "Material_ML_May 21 at 7:26 PM\nThis Game Is Awesome!\n\nSuch an amazing game! Absolutely Oustanding! I do have 1 complaint though, For the crusader class please shorten the distance the chain reaches i cant use my weapon to block it in time as it is already behind me but overall an amazing game!\n\nHelpful | 1", "KaterpiletApr 9 at 12:48 PM\nPoor execution on a solid concept\n\nI was really excited when I saw Ironlights since I had been mulling over a similar game design idea at the time. I backed the project on Kickstarter excited to see the game I wanted to play/make coming out. Unfortunately, the execution is really lacking. Fights take way too long, the turn based system does not really pan out to be fun, and lack of parrying makes defensive parts feel one dimensional. In general the game isnt fluid and that really sets it back.\n\nAlso the game causes quite a bit of discomfort for me, both in teleporting to each combatant, and especially the sometimes forced teleportation backwards. There are a lot more comfortable ways this could be implemented (narrowing fov or blinking), but its also an unnecessary gameplay conceit.\n\nThe game is also visually lacking, it is more impressive in screenshots and video than in headshot. This is from the sloppiness of the UI to the overblown metallic on the rough shading model for the enemies.\n\nI think there is a future where this game becomes more playable, but it definitely feels like early access territory still. For any interested in purchasing, I would wait and see what types of changes the developer implements in the future. The roadmap does currently seem more content focused than gameplay tuned focus though.\n\nHelpful | 41", "sephanie.delgadoApr 25 at 6:03 AM\nInnovative, and super fun. With ideas\n\nI'm not going to repeat what others have already said about gameplay or graphics that hasn't already been said. (Which is great)\nWhat I would love to commend the developers for is already updating the games mechanics to be much smoother and also updating the playback system to be much smoother and basic quality of life changes. With the addition of ranked play really pushes you to improve and learn.\n\nPossible improvements**\n\nWhat I would love to see though is some new class additions like they have in solo with axes or pikes. I feel like 5 classes (though fantastic and different) feels a bit stale after a while.\nAnd maybe once you already have versed an opponent once, you stay In the ring without having to go through the whole setting up arena (which takes about 45 secs each time to get set up)\n\nHelpful | 3", "CleenexApr 25 at 4:44 AM\nA MUST HAVE!!\n\nI had been excited for this game before I even had my quest! It lived up to my expectations and more! The combat is balanced and each class will have you playing in a different mindset. The game feels so unique compared to other games on the quest! It feels more like a challenging duel rather than swing til you win. The customization feature is very fun to play around with and the ranking feature makes every battle fair. I had it since day one and have no complaints! This game is a must have in your library!\n\nHelpful | 3", "thezachbrandonApr 17 at 1:57 AM\nI hated it at first but loved it later\n\nThis game is incredible! The mechanics are very fun. My suggestion is to give it a chance and play a short match rather than a long one at first( not knowing which was which at the beginning either its the ones on the bottom of the menu) I went from deleting this game to thinking, maybe Ill re- download and give it another shot. Now Im a big fan, the sky looks amazing always and the graphics are really cool. The thing I love is that you can save and send gifs of your coolest matches to all of your friends through email.\n\nThe one comment that I do have to the devs would be just that now Im ranked number one in the gold league, I just dont know what all these coins are for. I wish that I could buy new cool stuff.\n\nI love this game, Im a big fan and Ive spent a significant amount of time playing it even after my initial reaction was that it wasnt good.\n\nPlease give it a chance, its a great game, terrific multiplayer game, all of the AIs are very creative because from my understanding at least, most if not all of them were made from actual people playing. Some are very funny and some are very skilled.\n\nAs far as classes go, I think the crusader is much too difficult to guard against since the ball is somewhat difficult to track with the eyes. I would be interested in a mode where perhaps you could counter attack while defending as well. Overall I really have enjoyed this game and hope more is added in the future to increase my desire to collect this games currency! Thanks so much for making this! Its one of the coolest games Ive ever played. \n\nHelpful | 4", "travlamar7A day ago\nThe Stick Has GIRTH!!\n\nFirst of all, I know girth is being misused, but it sounds funny so Im saying GIRTH!!\n\nI love this game, the monk class is all Ive tried at the moment but its so awesome. I love the mechanics. The idea of duels, but your weapons break after you parry an attack and you regenerate it by putting it behind you is so cool. Keep up the good work devs. Keep the updates at a steady pace and dont overwork yourselves.\n\nHelpful | 0", "BrokenMikeMay 5 at 8:07 AM\nGreat game, but too much cheese\n\nThis game is a must play! The slow motion combat feels great. The two-handed sword offered the best gameplay in my opinion, with the flail in close second. the other classes feel a little lacking. The monk (staff) is entirely broken though. Do the motion of punching a virtual speed bag, and you unleash a constant flurry of unlockable attacks at stupid high speeds. Kinda breaks the game. A similar strategy can be used with the ninja. This needs fixing urgently!\n\nplaying against the CPU offers a great challenge (assuming you don't use the monk/ninja strategy) and PVP is also just as fun (until you run into people doing what I keep talking about)\n\nCustomisation is ok, could do with a little more. I wish there was a little more progression rewards too, like new weapon models/skins, or new techniques.\n\nOverall, it's a great addition to anyone's Quest library. If it's on offer, don't pass it up!\n\nHelpful | 1", "ChrempentoApr 11 at 4:25 AM\nYou NEED this game.\n\nIf youre into any type of close combat fighting, you need this game. Simple, balanced mechanics make the game easy to learn. Its fun and addictive and makes you feel like a Jedi. The classes are diverse and present different fighting styles for the player to adapt to. The campaign (against AI) is long and allows you to try things never done in VR fighting before. Customisation is a very nice feature as well, its extremely rare to match someone with your exact look. The replay system is easy to handle and exporting gifs to share takes one tap of a button. The community on discord is friendly, to put the cherry on top. I now have a lasting hobby for my lockdown, and Im glad I have an excuse to stay inside all day and play this. Amazing game, would buy again.\n\nHelpful | 4", "chaosKillshotApr 10 at 8:49 PM\nbest sword fighting game of all time\n\nThis game is amazing for where VR is at right now it may not have collision detection on the weapons this is because they made it so you don't have any hand separation from the blade. when you go into fight its in slow mo so you don't have weapons flying all over the place randomly hitting each other, yes it may seem like this would cause hand separation which they were trying to avoid with the no collision detection but it only takes about a hour of playing to learn how to fight in slow mo. There are tons of matches going on all day even though the game just came out. There is a quick-match and private match for playing online. When you don't want to play against other people there is a amazing campaign to play in. Guess what, when you complete the campaign with one weapon you can also do it with all the other weapons. Now the classes first class is knight its a big heavy sword and can be a little slow to move even when your not in slow-mo. It has two blades so your enemy has to block the weapon twice. Its ranged attack is a long energy streak that does a decent amount of damage if all of the streak hits. Next we have a duelist, he has a small rapier like blade and a shield. It moves fast in slow-mo and even faster in real time. The ranged attack is a streak of energy bullets. There also the monk a double sided staff which can be spun with one hand or two, if you let go of it while its spinning it will spin in midair but will get slower over time. Its ranged attack is a bow, you hold the staff with your non-dominant hand and press the fire button pull back and release. Next class is the ninja slightly slower than the duelist but makes up for it with its 2 short blades for each hand. Its ranged attack is basically a gun for each one that you can shoot as fast as you want. last but not least is the crusader. The crusader wields a flail and a shield. Since the flail is hard to block with the shield has a big size to make up the defense. Every attack uses stamina.\n\nHelpful | 5", "TelephantasticJul 6 at 5:43 PM\nI need practice.\n\nI really like this game. Well done.\n\nHelpful | 0", "powney1991Apr 9 at 4:10 PM\nA simply incredible game!!\n\nWOW! Blown away by how good this title is! I did the tutorial where it instructs you of the games mechanics and controls and from there I havent looked back! Incredibly well executed title from customising the way you look to choosing which class you prefer (sword and shield, giant sword, staff, two swords and a flail) theres a campaign mode where it runs you through different battles and the online multiplayer battle mode is smooth as butter and simply amazing to quickly jump in and melee battle with anyone. Its cross platform too (across rift, quest and steam VR users) which makes this mode even more appealing! The only two things I could possibly suggest to make this amazing title even better would be perhaps the option of having a voice chat option so players can choose whether they want to talk or not as currently theres no voice chat, you simply just battle your opponent and possibly incorporating a normal pace mode as the combat when you swing the sword is slowed down but having an option for two modes would make it even more amazing. Overall a 5 star game, having so much fun with it!\n\nHelpful | 4", "andachApr 17 at 11:15 AM\nPretty Good (One Issue)\n\nThis is an amazing game and it's my favorite game ever, but I have 1 issue; the monk vs. Knight matchup is really difficult for the Monk, and to fix it they should make the overlapping hitbox area of the two sides larger so the monk can hit the blade with the middle of his staff and break the 2 layers of the knights blade\n\nHelpful | 1", "nowgoyouJun 15 at 2:29 PM\nIt\n\nGood\n\nHelpful | 2", "QUEZWZRDMay 14 at 8:14 AM\nEPIC!!!!!!!!\n\nThis game literally makes me feel like a real life monk spinning the staff deflecting arrows and cracking skulls! I cant wait for more updates and hopefully new weapons to! If you like any type of weapon melee game look no further! This is definitely one game to add to the library and in my honest opinion this game is going to be one of the original classics for VR years from now! What are you waiting for!\n\nHelpful | 1", "ryangubJul 16 at 4:11 PM\nNot worth it.\n\nAs much as I wanted to like this game. I just cant get into it. The combat feels slow and fake. I wouldnt waste the time trying it out.\n\nHelpful | 0", "ShrewbeJun 18 at 7:25 AM\nUpdate\n\nReally now I have to pay with gold to get the same armor and colors that's been in the game since the beginning YOU COULDN'T EVEN ADD NEW SKINS TO THE ARMOR OR WEAPONS...TRASH UPDATE TRY BETTER NEXT TIME\n\nHelpful | 3", "zul.shah65May 14 at 4:59 PM\nPoor speed... Or bcos im on tutorial\n\nDear dev,\nIm really disappointed with the speed of ironlight. Is it bcos im just started?\n\nOmg, if this is the speed if ironlight throughout, pls advise, else i dont think its even worth for free.\n\nDissapointed fans\n\nHelpful | 16", "PoloKnight1May 9 at 8:03 PM\nEdit: Update1- AMAAAZIINGG!!\n\nDeleted previous review bc it doesnt matter now lol game is 10/10 must have for quest! Great balance, options, replay ability, immersion, etc. absolutely love this game.\n\nUpdate fixed main problems with self-hits (esp with shield).\n\n!!help!! ONLY THING I COUKD ASK FOR NOW IS MORE INFO ON ENERGY RECHARGE TIMES(why do some seem to charge must faster-w/o using boost???)\n\nBUY THIS GAME!! Trust me-and I need more fools to smack with my flail lol\n\nHelpful | 1", "Landonix9 days ago\nNo regrets\n\nI just bought this game, ngl I wasnt expecting much, but now I regret thinking that! I live this game, and would play for days and not get bored. The graphics on this are amazing for an Oculus Quest, and almost identical then pcvr. Reflective iron, and just awesome graphics I was NOT expecting for a stand-alone headset! I recommend this game 10/10 with no regrets and a well spent $20\n\nHelpful | 0", "Swordsman12Jun 15 at 8:20 PM\nAmazing\n\nBuy this game it is extremely worth it and has great levels amazing AI and a great team I plead you GET THIS GAME\n\nHelpful | 0", "devinbrosephApr 9 at 10:43 AM\nBest. Game. Ever!\n\nThis game is so fun, from the awesome visuals to the realistic weapon physics, its so much fun! You really need to master your weapon of choice and choose the right class for you. Speed? Strength? Range focused? Melee focused? Its also an amazing workout my body is so sore, but I cant stop playing! If it werent for the quests battery, I dont think Id ever stop! Definitely a must buy.\n\nHelpful | 4", "SlN-of-wrathMay 27 at 3:49 PM\nBest game in my library\n\nI just love the mechanics in this game its the best vr melee combat thats out there right now. nothing on my library compares to this game I just hope the developers keep supporting this masterpiece\n\nHelpful | 0", "imjeffMay 15 at 7:52 PM\nI love it\n\nOk i love the game but I feel like theres a few issues like devs what is the point of slow mo is there a way to turn it of Its really irritating and takes away the whole appeal other than that its great\n\nHelpful | 1", "SpeloApr 14 at 10:19 AM\nAmazing game I love it\n\nIt's a stamina based fighting game that allows reactions via slow motion and in game weapon weight, and it has amazing lighting, even on quest, the devs are very active in the discord too, the discord is a helpful place full of people willing to teach you, it's a must buy for anyone who wants a sword fight in vr\n\nAlso, in the lower star ratings you'll see them say they take damage randomly, what's actually happening is their weapon is reformed (indicated by a light of your colour on the screen closest to the weapon) or they are hitting themselves with their weapon, which reduces stamina, also, someone said the knight is overpowered, it's not, it's one of the hardest classes, and while it is very good, that is only in the hands of someone who knows what they are doing, it is the slowest class and is in no way op, someone also said that duelists just stay at range, this is possible for every class, to prevent it all you need to do is hit them with your ranged, which halts stamina regeneration\n\nSome things you should know; if you walk around too much (can still dodge duck and weave) you will take damage if you leave your oval (indicated by vertical lasers) your ranges attack is very useful, it stops stamina regeneration and increases your own, additionally, if you attack, leave some stamina left over and use it for ranged attacks so you can keep control of the battle\n\nHelpful | 3", "wolfman944xApr 29 at 7:15 PM\nAmazing concept\n\nI love the slow motion mechanics. I wish you could pick the time of day in the single player and it would be really cool to see the crusaders shield chip away like glass as it takes damage instead of getting smaller and to see more classes added as time goes on\n\nHelpful | 2", "ExwerksJun 1 at 8:59 AM\nAmazing game\n\nThis is such an amazing game, I'll just leave it at that. One thing I would add is a 2v2. And sometimes I block a hit but it still hits me anyway.\nJust buy it, you'll like it\n\nHelpful | 0", "ECHO-425Apr 21 at 7:30 PM\nFirst VR game to keep me coming back\n\nLike others have said - this is the first VR game Ive played where I keep coming back to try a new strategy or tactic, practice to hone my skills, etc. Theres tons of replayability, the fighting mechanics are not only unique but work WELL, and online multiplayer is smooth + relatively balanced.\n\nAND a single dev made it?? AND you can easily send GIF recordings of awesome fights?? Amazingly done!\n\nHelpful | 2", "Neeboy98Apr 25 at 4:02 PM\nGreat game (One problem)\n\nFirst of all, this game is AMAZINGLY fun to play and very immersive! I hate to report bugs in my review, but there isn't any way for me to report bugs for this game. The Duelist is able to attack and pull there sword back just far enough for it to respawn, but the blade respawns inside the opponent and instantly does more damage. Please nerf the Duelist in the next update.\n\nHelpful | 2", "tightEnd_House87May 6 at 8:14 PM\nBest game I have on the quest!!!\n\nThis game is so much fun me and my friend play it ALL THE TIME the only problem is the match making its a little strange and would also be nice to put mics in so U can talk to your friends but other then that the game is AMAZING the gameplay is smooth and you cant get bored!! Definitely a 5 star game and well worth the price!!!\n\nHelpful | 0", "BindedTVApr 16 at 3:51 PM\nMUST HAVE ON VR. few flaws\n\nAmazing multiplayer game to mess your friends up and to take up time which is good atm. (writing this during covid-19 outbreak and i must say this is a need on VR and amazing with friends, solo or just online.\n\nTHE TRAILER DOES NOT DO IT JUSTICE.\n\nMuch better than youd expect at first. but i gotta say its great to want to get higher in leaderboards and get the most trophies and wins in online. its a dope concept. all you need to do now is fix the blocking system a bit. its kinda buggy\nATM\n\nHelpful | 3", "TankManiaJun 16 at 6:52 PM\nThis game is amazing\n\ni absolutely love this game and it is so worth the money and i really recomend this game 10/10\n\nHelpful | 0", "spiffingsimmos3May 13 at 12:02 PM\nSuper smooth\n\nThe graphics and playstyle of this game amazed me for a quest game. There is a variety of classes that all have unique attacks although some a bit unbalanced. However, the slow motion fighting is a great take on vr combat. I would love to see more classes and maybe the slow motion changed so when you start to swing it goes slow and gets faster as you move it away. Definitely would reccomend.\n\nHelpful | 1", "ShinobylApr 23 at 10:14 PM\nAMAZING AND FUN GAME, BUT......\n\ni love this game immediately after buying it. but my issues are as followed:\n\nShields: I find it very hard to do damage when theres a shield covering 80% (specifically the crusader class) of the enemies bodies, yes the shield shrinks but only when damaged. Maybe make shields like weapons and break after one hit. or completely remove them. i remember a player simply putting the shield in front of him and standing back and i couldnt do anything.\n\nClipping: its hard to know where an enemys weapon is because its sometimes clipped inside their body. getting hit at the very bottom of your character is almost impossible to block, i even abuse it as the ninja class because only pro players can block it.\n\nBoundaries: players tend to stand as far back as possible and it doesnt activate the boundary, as a ninja class user this kills because i cant hit anyone without stepping out of mine because my blades are too short\n\nSlow Motion: sometimes i dont even think it works because of how fast i get hit. the crusaders & duelist reloads instantly and moves fast making it hard to block. in the tutorial it says the faster you move the harder you weapons can keep up, but that doesnt apply to the Crusaders or Duelist and i cant keep up with it because of that, its annoying to not be able to block something when you see it coming.\n\nReload: The duelist sword is WAY too long. the handle of the sword goes back and the swords is reloaded while the blade is extremely close to my body making it super easy to simply jab someone with no effort. i dont have a problem with the knight swords because its easy to block (for the ninja class) sometimes ill stand there and move my hand back but my weapons wont reload, this is frustrating when blocking because i wont have my blade available to block on which ever side they will attack me on. maybe change the sensitivity for every class. crusaders have it easy because all they do is swing and their weapon is reloaded i feel like the weapon shouldnt swing in general, because you barely have to move your hand and it does 400+ damage in one hit, and no other weapon in the game swings so it kind of ruins the vibe.\n\nFOV: the field of view needs to be increased, i can never see the swinging Mace as it flys over my head making it almost impossible to block (unless the player is bad) ...which brings me to my next point\n\nWeapon Balance: I play as the ninja class, thats my play style in every game but it seems to be the weakest in this game. i hate how the crusader (which in my opinion is the MOST overpowered class in the game) can do 600+ damage in one hit while i do 120 to the body. the crusaders weapon is so hard to block because it flys over your head way to fast. its annoying to hit someone 10+ times with the ninja class and do no damage but yet i get hit 5 times and half of my health is gone. i dont like how someone can do the damage of me hitting someone in the head twice in one hit. The duelist swords seems to never break and clips through the enemy making it easier for them to reload their weapon almost instantly.\n\nVoice Chat: there is none. i tried to help a player learn the game but it was hard to especially if i cant talk to them. i still got sum things thru with hand movements but it would of been nice to actually talk to them. even when you have the just for fun pop up it says to help new players but i dont know how you expect us to do that if we cant talk (maybe you are adding that in a future update)\n\nRanked: i remember winning like 10 games in a row and not ranking but i lose 3 (not in a row) and my rank goes down. i dont know why that is im a silver 2 and have been stuck there.\n\nLatency: theres a diamond in the game his ping is usually 170-250ms and its impossible to beat him because of that, i dont know how latency works but theres someone climbing the ranks because of it. he uses the knight which is the easiest to block but because of the 200ms latency almost none of blocks work even though i know his hit pattern and block before he gets to me.\n\nI LOVE THIS GAME ITS MY FAVORITE AND ITS THE BEST. i know the game is new and i never write reviews for things but this is sort of me trying to help from the players perspective.\n\nHelpful | 1", "chilithedoggoJun 22 at 8:44 AM\nMighty fine\n\nUnique way of fighting and I love the customization\n\nHelpful | 0", "Hyatt2006Jul 24 at 10:10 PM\n\nIt was a fun game but I am 6,1 and I have duck down to play\n\nHelpful | 1", "Sidx21Apr 19 at 12:39 PM\nLove the game, not getting cheesed\n\nI love the fluidity and strategy of the combat. It feels awesome finding my play style and adapting to others. This being said as with most games there are players looking for cheese tactics like the duelist sitting down and jabbing you under the belt or the crusader stepping close and swinging the mace behind your head for unblockable damage etc. that being said the majority of matches Ive played were legit. The only other request is to get some customization options with those infamous multiplayer coins and maybe a couple more weapons. Thanks for the great game devs!!\n\nHelpful | 1", "johnny1071722 days ago\n\nBoring\n\nHelpful | 1", "DoctoriApr 10 at 12:37 PM\nVery good\n\nVery good! Finally a title worth buying, something a little different too. I'm not sure yet, but could 3-4 of us join a private server and watch battle and loser goes to end of the line? This would really lead to fun times with friends. Please tell me they didn't overlook that....\n\nHelpful | 3", "psully4114Apr 20 at 4:25 AM\nA good bit of fun.\n\nI enjoy this game but I do have one major gripe is that the slow motion makes weapons feel slow and unresponsive. I realize this is probably a feature to make it more accessible for players new to vr...but I hate it. Much like teleport or being on rails has become a staple of vr for people that get motion sickness it just makes it feel unimmersive and ruins the experience.\nPlease make this optional. I appreciate the efforts to make things as palletable to new players as they can. For me this is the antithesis to everything I bought a VR headset for. I accept the risk. Please make a realistic melee combat game.\n\nHelpful | 0", "BeatzCreationsApr 18 at 4:26 PM\nBRILLIANT\n\nThis game is simple to pick up, hard to master and just pre brilliance... spinning the staff around me just isnt getting old! (You will understand when you try it)\n\nThe only reason i havnt gave it a 5 star is only having the few classea to choose from but playing against a lot more... hopefully more playable classes will be added soon or just weapon customisation to use other weapons in the catagories.. then it will be 5 ! :)\n\nHelpful | 0", "WentlleApr 10 at 2:55 AM\nNeeds work\n\nThis game, yes Im saying it, feels like a tech demo. Not enough classes. Unbalanced combat, frustrating mechanics, there are classes that enemies use that you cant use yourself what so ever, I have taken critical hits and shard things filled my view so I couldnt see jack shi t and I died, which has happened too many. yes the physics are impressive and yes the combat CAN be fun at TIMES. Until they fix add and fix most of the issues. But overall this is just a cluster fuc k of poorly executed ideas shoved into a physics engine. Not worth the $20\n\nHelpful | 11", "Baxter3.0Apr 18 at 4:47 AM\nGreat game however.....\n\nThis game is amazing the graphics are great and so is the game play but some of the characters need tweaking as some are nearly impossible to defeat. For example the crusader, this character is a beast to play as and when playing as it i have never lost but playing against it is insane its Shield makes it impossible to get any hits on it and his weapon itself is unbearable to try and defend. My only complaint is to work on the crusader\n\nHelpful | 1", "UrukeldreyhApr 10 at 12:43 AM\nToo Up In Your Face\n\nThe combat is too up in your face. You can hit the opponent's body with your weapon while your elbow is at the side of your stomach. That is how close to combat is. I kept finding myself taking a step back in real life, because of how uncomfortably your opponent is. If I hold a sword at resting position then it will already be touching my opponent, so the only way I can hold my sword at resting positing is either off to the side or vertically .\n\nHelpful | 9", "CyrreApr 17 at 7:16 AM\nDie die die!\n\nThis is a fantastically done game. The graphics and shines do it for me, the gameplay is NOT rl combat simulation but a playstyle of its own with fun physics and really enjoyable. (Play with weights and enjoy breaking a sweat) only giving four stars and not 5 because the single player and armory could be expanded. (Let me buy stuff with my coins and glory. Give me more to earn in single and multiplayer) otherwise, game is a great buy\n\nHelpful | 0", "TOGDoesStuffApr 17 at 11:20 AM\nGreat game, but...\n\nIt feels like it's missing a few things.\n\nFirst and foremost, Multiplayer feedback, I win a match, get \"+1000 coins\" but they don't do anything, they vanish into the ether.\n\nSecond would be the option to get more customizations via those multiplayer coins, since they don't currently do anything.\n\nThird would be purchasable custom weapon skins to spend said vanishing multiplayer coins on. (grips or something, maybe?)\n\nFinally, and this is more an annoyance than anything, penalties for idling out mid-match. (Taking off their headset, resulting in invulnerability.) Alongside being able to save replays when opponents disconnect/leave prematurely or right as a match ends.\n\nAnd of course I hope more weapons get added with time.\n\nLooking forward to where you guys take the game from here!\n\nHelpful | 1", "LaughingBorkApr 23 at 7:09 PM\nLoads of fun!\n\nI have enjoyed this game right from the tutorial. It gets you moving, I like the variety of weapons available, and it keeps me wanting \"just one more round.\"\n\nThe only con - it does get pretty repetitive. I would love for someone to make an a VR fencing game!\n\nHelpful | 1", "RossTrex1Apr 26 at 6:56 PM\nVery Good Game and Oculus Addition\n\nI really like this game. Good graphics, good game play and the game is re-playable. This game does not appear to be yet another purchased game you have in the Oculus Library that you do not click on. While not quite fully addictive like Thrill of the Fight or VR 2MD Football it is very re-playable and enjoyable. The multiplayer mode is superb.\n\nHelpful | 1", "Revol-RepaidMay 29 at 10:53 AM\nRevolRepaid\n\nLove this game. Though I wish you could use the coins you win after a fight to buy new style weapons for each of the different characters.\n\nHelpful | 0", "matteo311Apr 9 at 10:05 AM\nArcadey but cool\n\nUnless you are looking for realistic combat Ironlights is worth checking out.\nCheck out my full review here\nhttps://youtu.be/vL4LDWie5o8\n\nHelpful | 6", "chronozeromApr 14 at 5:46 PM\nGreat Multiplayer Games\n\nGame is awesome and really feels good when you get into a nice match but there are some matches (as with any fighter or multiplayer game) where the system seems to be \"gamed\" Players standing inside your player model and swinging in circles...... maybe I haven't figured out the \"counter\" to some of the cheese tactics but all in all the game is great still has some polishing to do but its definitely one of my faves right now and the devs seem to have a vision for the future.\n\nHelpful | 0", "Dream_WalkerApr 14 at 12:35 PM\nRoom for improvement\n\nEveryone doth be a critic. This game is fantastic, I love working up a sweat to it, the slo-mo is a really fun addition especially when you land that final blow. Really sends home the feeling of defeating your opponent. Personally I love playing the Knight, using him skillfully is a challenge I welcome, and oh boy is it!\n\nThere are definitely flaws at times, the sword breaking and having to \"recharge\" it is a creative concept that I hope stays. However sometimes even when putting it behind my back it doesn't register and wont allow me to block some critical strikes, that can be a huge damper especially when it's neck and neck.\n\nI nothing to say about the campaign that hasn't already been said, short and sweet, I've no doubt the dev's will make it longer and more worth while, it is seriously so much fun. The multiplayer I have a big issue with, I'm 50/50 in my win loss ratio. All the people I've lost to spam the range or are ninjas and flail like a windmill, impossible to block every hit.\n\nThe range shouldn't be stronger than the melee if you can spam it, on top of that it consumes next to no energy. The ninjas and the range need to adjusted as it makes the online incredibly unbalanced. It isn't a matter of getting good, as playing as the knight, you REALLY have to adjust for every battle. I welcome the challenge, I don't welcome an unwinnable battle.\n\nPlease play and support the game as it is a BLAST, but with everything there is always room for improvement. Thanks!\n\nHelpful | 0", "Shadowdrake88Jul 23 at 8:33 AM\nExcellent game but...\n\nIt would be 4.5 stars but I cant put that in so its 4 stars but anyway really enjoyable game Ive spent many hours on it but one thing I would like is if the enemies in the gauntlets had weapons that you could use, I would really like to use an axe or a spear but other than that great game\n\nHelpful | 0", "orphangononoApr 16 at 7:42 AM\nGreat game but one issue\n\nIn all, it has great mechanics certainly deserves to be on a best seller list, only problem is when your starting off its really frustrating to always be fighting cheap monks, however Im sure the monks will be nerfed to hell.\n\nHelpful | 3", "Dragoncroc101Jun 21 at 4:06 AM\nStunning\n\nMust buy for quest.\n\nHelpful | 0", "jmoxhApr 9 at 7:22 PM\nNot natural\n\nI really wanted to like this game, however the movement is not natural. After every hit you need to put your hand behind your back to recharge your sword and you can only block when someone is attacking. I can understand your sword becoming damaged but if after ever hit you need to recharge and the fact you cant damage when someone is attacking is odd at best.\n\nAlso the teleportation to attack is weird. You dont utilize the joysticks but the A button.\n\nHelpful | 5", "RRgamerJul 25 at 5:30 AM\nReally great game!\n\nThis game is amazingly fun! I only wish that its a bit easier to swing the weapons around (except the monk its perfect). Also I think the tutorials for each class could be better. And maybe there could be a bit more content but thats it. Overall this game is awesome!\n\nHelpful | 0", "DrewTheLovableApr 11 at 9:09 PM\nFun, but feels unbalanced\n\nThe game is a lot of fun, and each weapon is a blast to use both online and offline (as long as you are playing casually). The only complaint Ive had so far is that it feels like the shields are a bit overpowered. This imbalance could be because the broadsword (my personal favorite weapon) is countered by it, but it still feels like the only times I can beat one of the shield weapons is with one (which heavily limits my options).\nAside from this complaint, I have had a lot of fun and will be looking forward to any updates or DLC in the future.\n\nHelpful | 1", "nick.spoons.58Apr 11 at 3:00 PM\nGreat game, but people can easily spam\n\nThis is a great game, lots of fun and definitely worth the money, but its easy for opponents in multiplayer to spam. For example the ninja can just keep rapidly stabbing you until he run out of stamina, boost it up, and return to spamming, killing you in two turns. My suggestion would be to make each hit take less damage depending on how many hits occurred before.\n\nHelpful | 1", "KeyBladeLegendsApr 11 at 3:27 AM\nIts amazing\n\nBut far the best looking and feeling a\nQuest game I've played. The only reason I have given it 4 stars is because its lacking in the content area because it's new, but I know content will be out soon. My only gripe so far is some of the refresh rates (my lingo of saying how you swing your weapon to bring it back when defending) is sometimes off or with each class seems unbalanced. I play monk but when I defend against someone who is ninja the time it takes to recharge isnt enough. It might just be me being new/bad at the game though. Anyway I'm excited for new updates to come!\n\nHelpful | 0", "thejuggsterApr 12 at 6:04 PM\nFun but slo mo meh\n\n4 stars because It might just be that i enjoy more fast paced battles and dislike turn based systems which this isnt but kind of is in a way yet is necessary as it adds strategy to the game, so the complaint really isnt that\n\nI think slo mo shouldnt be in here everytime, some of us fast reflex folks need that real time, maybe add it so the defender can use up there mana bar as a skill with the trigger button maybe when they need dire help with whatever mana they have left, if anything its way too slow for comfort, moving in that pace really isnt enjoyable especially when it comes to a fight\n\nTheres something about the weapon shattering i dislike yet understand, might need some tuning, especially for defending, its like basically reloading a melee weapon everytime it touches the opponents weapon, a bit irritating\n\nAll in all its fun and the idea of having to pull the weapon basically behind you before you can actually do damage is great, but i think it was delivered in a boring way or lets say an annoying way, i hate the fast brushing attack style all sword games in vr have no realism, but the weapon shattering also sucks\n\nDefinitely worth the buy though, graphics are great, and you get a lil bit of a workout\n\n\n*update*. Lol guy named chunkylemons, was losing against me, he had a rapier, and at the end it seemed like he figured out something cheap in the game, he was rapidly stabbing me at the balls, his hand was goingback and forth like he was jerking someone off from his side, and it was unblockable and constantly rapidly reloaded doing 200+ damage atleast 3 times a second, he left quick after he won, he knew he had to be cheap to win\n\nHelpful | 1", "izaiahvyoMay 6 at 10:58 AM\nAmazing but one thing to add\n\nI was a bit worried that I was just going to hate the game and never play it but this game is one of my favorite multiplayer game and all I wish is that there was voice chat. And maybe some sort of lobby and it would be so cool\n\nHelpful | 0", "NekonaiApr 20 at 6:33 PM\nReally balanced do tutorial first\n\nDevelopers really put work on making every class balanced and they are almost perfect most time but problem is that some people go directly to multiplayer thinking it's a normal gameplay and get killed after 4 seconds reason is that it's slow motion you have to get used to how you and your weapon move in slow motion so you can control it best way is playing tutorial and some single player finding what you enjoy most and then go game feels realistic when you do it and if it wasn't slow motion it wouldn't be\n\nHelpful | 1", "LoonytoonyApr 18 at 5:42 PM\nGood but gets old after a little while\n\nThis is a very good duel-centric game with nice movement but it's more of a game you would play then play something else for a while and could back to this. With the multiplayer it is just like the single-player, a fluid dueling game.\nWould recommend.\n\nHelpful | 0", "EpicTurtleGamer3 days ago\nThis is amazing\n\nMan I have been playing this game the whole day, this is a good game and i would reccomend it if your bored! I can't wait till there is more classes, like a gun with sword class\n\nHelpful | 0", "iverflash25 days ago\nGood but glitchy\n\nI like the game all together but there is a glitch that kills me every time. The glitch is when Im trying to recharge it thinks I want to attack but since Im pressing x it does nothing. Can you please fix this thank you :3\n\nHelpful | 0", "ZueZSlayZApr 19 at 12:31 AM\nGreat game\n\nI love. The ninja class is my favorite. The bullets are incredible. Charging the bullet is a great feature. The only problems is when you repair your weapons, you hit your head and lose stamina sometimes. The colors are great and the tones are cool. My classes are ninja with carbon/orange and duelist carbon/purple. 4.8 star is the best rating I can give. Thanks for making a good $20.00 game. To make more to it. Make it custom colors and more material choices like diamond or ruby. If you beat the game, you should also be able to make your own class with any weapon and shield. Also a new class like juggernaut or ranged would be fantastic.\n\nHelpful | 1", "dsfieldsJun 9 at 3:34 PM\nYawn\n\nTurn-based dueling? Awful.\n\nHelpful | 8", "xGrayzillaMay 11 at 5:16 PM\nUnique Gameplay\n\nThis is a truly unique experience. Most games are created with fast paced action, but this game takes advantage of slow motion gameplay in the best way. Very fun and a steal at $20.\n\nHelpful | 1", "SenSSi_Apr 18 at 7:57 AM\nNew Update, New review.\n\nVery good slo-mo fighting game, with single and multiplayer. you need to be strategic and able to read enemys next attack.\n\nVery nice graphics, easy to learn basics.\nI give 5 stars, when they fix that ninja class. Pvp is best In this game, and i know dev fix these class OP problems, sooner or later.\n\nUpdate:\n\n5/5 now, i knew that this New Update fixed this game launch problems. Thank you and keep it going/coming. \n\nHelpful | 1", "Mongoos19Apr 19 at 1:33 PM\nPretty Good but multi-player is weird\n\nI don't know if it is just me but sometimes during a multi-player game people are able to move so fast that it does not feel as tho they are in slow motion.\n\nHelpful | 2", "RattleKatApr 17 at 4:31 AM\nAddicted.\n\nCannot stop playing this game! First VR multiplayer I've loved. Fights against evenly matched opponents are so tense! And with a surprising amount of tactics involved when fighting different classes which keeps things interesting.\n\nIt looks stunning and plays flawlessly. The slow mo melee takes some getting used to but once you get the hang it's a beautiful thing.\n\nCan't recommend this one highly enough but be warned: You won't be able to just jump in, hack away and win all your fights. You'll need patience to get the most out it. I've played for hours and am only comfortable with 2 of the 5 classes. Can't wait to start learning the rest though!\n\nHelpful | 1", "akyumurkovApr 20 at 1:51 PM\nLove the fluidity!\n\nI love that game. It is really involving and keeps the VR on. One small remark, if you dev guys can not separate the attack and defence phases, but they can happen simultaneously, like in real combat it would be even more realistic.\n\nReally I see great potential. Good luck guys!\n\nHelpful | 0", "therealu4eaJul 24 at 9:19 PM\nExcellent Game!\n\nThis is honestly such a good game I was first skeptical about the slow motion but after playing it, it made so much sense. Very satisfied.\n\nOne idea I have for this game which I think would be really cool is if you could spectate some other fights with friends and watch people battle it out in a tournament or something.\n\nI highly recommended this game for anyone interest in a melee combat game. \n\nHelpful | 0", "RhysandAzriel16 days ago\nOne of The Most Polished Games\n\nThis game is quite possibly one of the best experiences on the Quest! It feels fully fleshed out and not like a demo like many other titles, and with so many classes to choose from I feel like I can spend hours in game.\n\nHelpful | 0", "Why_4289Apr 25 at 5:08 PM\nAMAZING\n\nI love this game so much! You will easily find yourself losing countless hours in the fun and amazing combat. If it weren't for the Quests battery life, I would play all day. Swinging around a bow staff and draining your enemies health bar is so fun.\n\nHelpful | 1", "shadowninja0116Jul 22 at 3:25 PM\nAmazing game but with some small flaws\n\nThe game is all round amazing but there is two things Id like to address. 1: the Sythe hitbox. It is really complicated to block for new comers like myself. 2: The mace. Nothing really wrong with it I just feel like it could use a chain to give players an easier chance to block it.\n\nEdit:\nYou should make the hands more of a free type of hands and not stuck in one position and also you should add a mode where you can use your weapon to hit a ball around.\n\nHelpful | 0", "JuneWindApr 17 at 9:38 PM\nVery fun! Very buggy and unpolished.\n\nIf you're looking for a unique take on swordplay for vr, this could absolutely satisfy you! If you're looking for fluid and competitive fights, or a balanced assortment of classes, unfortunately this game may not be for you. The class selection is either very overpowered and abusive classes or unfortunately, underwhelming weak ones. The battle system, while unique, clearly favors other classes and can be very a usable and not fluid most of the time. Gameplay gets old really fast, and spam favors skill. The turn based combat really ruins potential for fluidity and an exciting combat experience. Couple that with many bugs, repetitive soundtrack and audio design, and lack luster graphics, and you have a very underwhelming and dull gameplay experience that leaves a lot to be desired. In the current state, the game is absolutely not worth $20.\n\nHelpful | 3", "Lampshade3557Apr 21 at 4:53 PM\nOverall great\n\nSuper fun gameplay, easy to start but hard to master. Singleplayer and multiplayer are both great, though I definitely recommend lots of singleplayer before you get into PvP duels. Overall very good.\n\nHelpful | 0", "Madhouse04Apr 12 at 7:35 AM\nAwful balance\n\nONLY PLAY ONLINE, in the campaign there is tons of bs that can get you killed. 1.you can get hit after you block way to often.\n2. if youre weapon breaks once then, youre screwed\n3. Some times youll take damage for no reason(challenge comes from gameplay, not bs)\n\n\nI dont know how it made it past play testing unless the devs where just lazy and didnt wanna play test, also this game is just shovel ware.\n\nHelpful | 16", "DaPugE1Apr 13 at 5:56 AM\nThe most fun I've had in ages, must play\n\nSo this game is... Amazing, it does everything right, it's easy to learn, hard to master. It looks amazing, has reflections, shadows and amazing looking details, it feels great and the amount of attention to detail honestly amazes me. Now, what is this game? It's a dueling game were you can verse bots or real players, there is 5 classes to choose from with different weapons, speed, and gameplay styles. There are different armours colours and helms, they are already planning updates already in there discord server where there is lots of active people to talk too. But my favourite part, the play time, this isn't one of those 4 hour games which you never play again, this game is never ending, you can finish the campaign but you can play the multiplayer can be played for 100 hours and still be fun to play. In other words, buy this game.\n\nHelpful | 0", "fisher.deason.7Jul 20 at 3:42 PM\nFinally a good Dueling game for Quest!\n\nThis game is one of the best vr Fighting games ive ever played, its smooth it runs great and it has a variety of playstyles. But even though im,giving 5 stars i can think of a couple improvements and things that i think you could add to the customization portion of the game. But i will list 2\n\n\n1: being able to grab anywhere on th scythe/monk staff\n\n2: (this is just a personal opinion) please add a variety of weapons for classes that you can unlock. Not as in entirely new weapons but....basically skins or small changes to how the weapon works, say instead of the knight having a double bladed sword, it starts with one and you can use coins to add a second.\n\nI hope you see this and think over my suggestion\n\nHelpful | 0", "ItsJustBobbyNowMay 9 at 6:36 AM\nLove it!\n\nThis game reminds me of the times as a youngling when I would sword fight in slow motion with my brother using the old cardboard tubes left over from gift wrapping paper.\n\nHelpful | 1", "scoot939Apr 12 at 6:18 PM\nGreat game(definitely an acquired taste)\n\nIm having an absolute blast with this. So far Ive been maining knight but Im thinking about changing things up and seeing how crusader plays. I could totally see how someone might not like this game so my best advice is get it and if its not your style just refund it. But its a game that definitely takes a lot of practice to really get. Also really looking forward to the ninja nerf I mean seriously its kinda ridiculous how easy it is to win as ninja.\n\nHelpful | 0", "pairudoxApr 11 at 8:09 PM\nBest melee weapon implementation in VR\n\nI love swords.\n\nHave studied a few Western martial arts a bit. SCA fencing and heavy. Love swords.\n\nThis will let you play, in a meaningful way, with swords and other melee implements. You can train and practice your style and then test your mettle in online duels.\n\nIt is challenging at first, but rewarding after you've spent some time with it.\n\nThe attack/defend dynamic mimics parts of Olympic fencing, and the energy/vulnerability interplay ensures it's more then rote form that determines the winner.\n\nMy two cents, if you've got the space and the wherewithal, try some ducking and dodging. And J-cuts.\n\nIt's also a blast watching people beat me doing spin moves :)\n\nHelpful | 0", "DaBeast2707Apr 11 at 12:38 PM\nVery fun, but overpowered classes\n\nThis game is great, definitely worth the price. I saw the preview in the oculus store and I immediately wanted to get it when it came out. I have really hardly been able to stop playing. It just keep hacking and slashing till my head is almost throbbing! However, I have a single complaint. In the hands of a good player and in some circumstances in the hands of an inexperienced player, the crusader is almost unstoppable. This may just be me, and Im just not good at the game, but also with a good player, the ninja is quite powerful as well. However, this game is overall very good and worth the money.\n\nHelpful | 0", "YO-MacApr 11 at 12:34 PM\nGreat Game. But needs communication\n\nThis game is worth the 20 dollars it's so fun and energetic, focusing on blocking your opponents swing and then the next. It feels like I'm an actual gladiator in some way. Highly recommend it if you like playing competitive multiplayer games or competing on leaderboards.\n\nA recommendation I have is that we get the option to talk to our opponents. I 1v1 my friend all the time and being able to hear him improves the game alot.\n\nI've heard the developers worry about this a little bit so I suggest adding an endgame chat after the game is done theres a quick chat that comes up that you can say \"pick same class\" or just a good game and a bunch of other chats that can convey a form of communication.\n\nAll in all this game is great, it's a finished professional game, I have yet to run into a bug or crash. If you're thinking about getting it you probably should. It was worth every buck\n\nHelpful | 0", "RevinJevApr 11 at 6:00 PM\nAmazing! But I have a few suggestions.\n\nNow I love this game, I have had it since yesterday and I have been playing it, and only it. Its probably the best game on the quest so far, but I have a suggestion. I dont know if you are working on it or not, but I have always wanted a game where you could do awesome tricks and twists with weapons like the staff - but I think it would be awesome if you could do stuff like twists or spins on swords. Say, for example, the duelist. If you could do a sword twist with the sword, it would be so cool! Thanks so much for your time reading this, and so far I think this game is a 10/10 must play!\n\nHelpful | 1", "Sean255Apr 11 at 4:24 PM\nFavorite Quest game\n\nKeep in mind, the game literally just came out like 2-3 days ago, so im giving it a full 5 stars for its launch gameplay, i get there will be small bugs and things that needs fixed, (i havent encountered any) thats expected with every new game. The developers did amazing and truly created a one of a kind vr game. I highly suggest starting off with tutorial as it will be hard to learn combat system right away with out so.\n\nSuggestion list\n(i know some of these are already in the devs roadmap probably)\n(caps lock are high priority)\n\nVOICE CHAT\nVIEW PROFILE(to add friends)\nmultiplayer stats\ncosmetics store for the coin currency. (buy new colors, weapon skins, armors)\n\nHelpful | 1", "CertainParsleyXApr 15 at 11:15 PM\nA fan of the campaign, but multiplayer..\n\nI should start by saying this game is really fun, love the different weapons and hope they add more eventually...but multiplayer is really easy to cheese. People fo out of their way to take advantage of anything that makes the fight one sided, such as many of the knight players who wait until you go for the attack and clip their weapon through yours to constantly break yours so you cant attack, and seeing as the knight sword is so large it's almost impossible to get any attacks off while they do this.\n\nHelpful | 2", "criminalmine62Apr 22 at 1:40 PM\nGreat time\n\nI dont know how to wrap up such a great game in such a short summary but i must say there have been a number of times where i lost track of time and my headset died.\n\nHelpful | 2", "BryceIsOnFireApr 21 at 1:59 PM\nWow!\n\nIve been looking for a game like this! I love the gameplay, super fluent, clean, and fun. The slow-mo lets you plan out every move as well. My only gripe is that there isnt weapon customization, if that were in this game would be even better!\n\nHelpful | 1", "LynnxxxApr 11 at 1:23 PM\nits good\n\nits okay dont get me wrong i like the game but there is a lot that will need to be balanced out because for example the Monk can just spin there weapon and dodge/attack easily and really all the ranged weapons are very powerful to the point where people dont attack normally just ranged attacks. There is balancing that needs to be done but i think once thats done it will be great fun. i know this game is like only just been released but im giving constructive feedback. Onto the good there are so many different classes with different play styles for a game that just released and all of them are different. There isnt one class that is just considered the best and the one you should always use(except the monk) and apart from the monk there all quite well balanced. Im impressed with the devs for how nearly everything is quite clean. now i know i said it all needs balancing but thats more the Monk class and ranked attacks. If you wanna have a multiplayer sword fighting game where you can play how you want this game is for you if you dont like repetitive games or tiring games then maybe not Anyway looking forward to what comes in the future of this game and hope it does well.\n\nEdit: Ive just come across a player who played monk and didnt use his staff a single time in the game he just sat there using the ranged attacks on me please remove ranged attacks overall they ruin the multiplayer\n\nTL;DR its ok well balanced but there are some things that are a bit OP\n\nHelpful | 2", "RetroDaisyApr 10 at 4:40 PM\nAmazing\n\nI dont even know where to start with this game! The graphics the gameplay and the ability to customize everything to your liking! This game is already a masterpiece and it just came out! I hope they add more characters to play as but for right now I think theres enough to keep me busy for a long while!\n\nHelpful | 0", "bradylouisApr 10 at 6:56 PM\nAn insanely fun game! But....\n\nI love this game so much! The graphics are high quality , and the mechanics are fluid. I could think this could use some more content like more classes , customization parts and colors , different arenas and more modes like an infinite wave mode so it would work like this...\n\nLike the mini guys you see in exhibition matches , there would be an infinite amount of those guys and maybe 5 per round and every 5 rounds there will be a boss.\n\nAlso maybe like a scrimmage mode like you can create your opponents and fight them\nBut I know its 2 or 3 days after release so I know Im asking for a lot but maybe in the updates\n\nHelpful | 0", "TTVDakuZZZsJul 18 at 2:59 PM\nAMAZING\n\nI got tired of playing all the crap shooter games and wanted some melee style combat and man let me tell you this game is AWESOME you can customize your own character theres different classes so you can play with your own play style really great game all around the slow mo is a bit annoying at first but once u learn it its quite good highly recommended\n\nHelpful | 0", "BigBeerusApr 10 at 11:04 PM\nAmazing game.\n\nIt could use voice chat. Thats about it. Amazing game though. People are 100% gonna complain though, but that's because their bad and would get destroyed irl. The only reason ppl complain is the 30% speed redux and weapon mechanics that stop cheesing. Played all day it really is about skill. Disregard those who complain. Their just bad and mad.\n\nHelpful | 0", "Mr.SanboApr 16 at 6:14 PM\nVoice chat please!\n\nLet me just say before I make a few comments, this game is amazing, and anybody with a quest should get it. Its the pvp multiplayer experience Ive personally been waiting for all year, and its by far the best sword fighting game on the quest yet. Great impact physics, particle effects, all the classes are unique. I just have a couple requests. Please please please add some sort of voice chat, or at least allow parties to chat while in game. Also the ninja class is a little broken, I see players just flailing their hands around and shredding health. Its a great game, but most importantly add voice chat!\n\nHelpful | 0", "dmarche88Apr 10 at 7:44 PM\nEverything I hoped for and more\n\nFrom the first time I saw this game on the \"Coming Soon\" section of the store, I realized that this is the type of game I had been looking for. I love the feeling of entering the stadium on a moving platform. I love the power I feel as my weapons fly into my hands. I love the subtle strategy of slow motion combat. I haven't had a duel that wasn't fun (even when I've lost). I love this game.\n\nHelpful | 1", "VRSantaApr 10 at 9:53 AM\nVR Sports: Competitive fighting\n\nI have had the game for three days and here are my first impressions. This game is great for a simple concept one on one fighting. There are different weapons, and each is unique in style of combat. This requires the player to learn how to fight with different weapons and to defend against them. My first match against another player was with a flail I was not prepared for the unpredictable directions the spike ball would come from and was defeated with ease. This is the kind of game that you will grow in your ability to play and in time there will players with some serious skills. I do like the competive play against real players, but the game does give you the option for AI where you can work out learning different weapons and has a number of different playing modes to keep it interesting.\nI could see this becoming an E-Sport with tournaments and such, and it will require more than just being able to use your fingers, you actually have to weild your weapons.\n\nHelpful | 0", "Legend50210Apr 9 at 8:31 PM\nFreedom Of Expression!\n\nMany VR games feel held back by what they can offer. This especially falls on what the game itself can do in terms of combat mechanics. When it comes to IronLights, you never come across the same fighting style twice. Everyone is unique in how they play as well as the games mechanics. The ability to fight in slowed time feels remarkably satisfying and a great alternative to the swing your arm until the target stops living method of combat. Its rewarding, challenging, and influences you to experiment on moves that do and dont work! I truly look forward to the future of this game and will continue to support it in its future endeavors! S\nIll see you in the arena!\n\nHelpful | 1", "UnusualthemedicApr 28 at 10:31 PM\nVery average\n\nWhen I heard of this game I was incredibly excited, real intuitive melee combat on quest for once sounded like a dream, its the execution that kills it for me. The graphics are nice and pretty (9/10) and especially good for quest. The music is bland as ever (3/10) same music all the time, gets old. Gameplay is where it really becomes; meh. The game has great ideas that fail miserably in practice. The weapon breaking is a good idea but is easily exploited and really glitchy. The slowmo is fun at first but quickly turns annoying. And the balance is WACK with monks dominating the matches, making it not fun to play. its alright and while it has its faults it still feels fun, NOT worth 20$ however overall this game is a solid (5/10) not terrible but not great. Could be something special in the future however\n\nHelpful | 0", "A1OverdriveApr 18 at 10:08 AM\nBlow away\n\nThis game is what Ive been looking for since I got my quest. The graphics are great, the combat is fantastic, and every single class has a way of making you feel like a boss. I wish there were more customization options, but wow, I love this game so much.\n\nHelpful | 0", "StarCobra229507Jun 6 at 7:46 PM\nDelicious\n\nIt good\n\nHelpful | 0", "MisterBearyt5Apr 14 at 8:40 PM\nPretty prefect\n\nAbsolutely dope game, lots of replay ability. The multiplayer can sometimes get a little cheesy, but there is always ways to counter them. No matter what class you pick you have a fighting chance. The developers seem dedicated to this game as well.10/10 would recommend\n\nHelpful | 0", "Watumba_MofassaJun 6 at 8:26 AM\nTrash. Compared to Swords and Sorcery.\n\nFighting in slow motion? Really?\n\nHelpful | 5", "mattjohnholmesJun 20 at 2:37 AM\nToo simple, not enough online\n\nGreat atmosphere and multiplayer\n\nHelpful | 0", "1-VRApr 11 at 5:47 PM\nCool game\n\nGraphics are really cool, really does feel like you're in a giant scifi stadium. Gameplay is fun, though a little repetitive.\n\nGame could do with some improvements though.\n1) if your opponent quits to lobby after an online match, it boots you to the lobby as well, stopping you from having a chance to save replay.\n2) the second class's (sword and shield guy) special attack seems to be calibrated wrong. You have to aim way to the left if the opponent. I thought maybe it was just me, but ai opponents seem to have the issue too.\n3) third and most importantly, why is there no global online ranking system? A game like this NEEDS that.\n4) online team matches would be neat. Like they are in the campaign where you fight two or three opponents, but balanced and online\n\nHelpful | 2", "AddziApr 14 at 2:12 PM\nNeeds Heavy Balancing\n\nCertain classes against others are impossible to beat. Needs rework to damage stats. When both of you are low on health and energy, there's a boring change of pace where you just wait for a gauge to partially fill up. Needs some special moves for more tactical play.\n\nOtherwise, very well presented and graphics are no issue. Runs well.\n\nNeeds more variety with soundtrack and environments.\n\nOnce balanced, this will be a 5 star game.\n\nProps for the amazing replay editor, too.\n\nHelpful | 2", "BK_RandyMay 21 at 7:13 AM\ndont expect skillful opponents\n\ni feel like everyone i fight is a bot they just spin their weapon like a windmill no timing or skill even attempted.\n\nHelpful | 3", "obi2kenobiJul 3 at 12:02 PM\nBasic fighting/dueling done well\n\nIf you can get past the fact that your sword won't bounce off your opponents (which is easy for me having no experience in real life) you should enjoy this game.\n\nThe graphics and environment are pretty darn basic, but this game is all in the creative concept/gameplay. It scratches my sword fighting itch and nothing else exists like this (Sairento is the undesirable sword waggle combat, and more fun w guns/other weapons).\n\nI give it 4/5 because I think it is a fun title and you should get it. I like to save 5* for something that truly blows me away. With the graphics/environment being so barebones (and i mean in creativity not rendering power) I just can't give it 5. I gave superhot 5 even with meh environments, but found the concept more mindblowing.\n\nI really like the classes they did. Monk is my favorite as you fight with a Bo staff (doubles as bow and arrow) which makes me feel like darth maul. The maul saber was also my favorite part of vader3, though I found it more impractical to use in that game vs here.\n\nThe one class that seems bad to me is knight. It seems to have way less defensive capability to me and is slower on offense. I haven't played a ton with any one class yet but its hard for me to imagine the extra damage making up for the disadvantages yet.\n\nOne small complaint is the tutorial doesn't really explain projectile attacks well. In my head it looks like i should be able to dodge them but that doesn't seem to be the case, however you can block them.\n\nHelpful | 1", "alex.dundasApr 23 at 4:45 PM\nSlow motion combat is boring\n\nI wish I could get my money back, but it took me more than 2 hours to give the game a chance. I like the PvP concept, but the actual game play is repetitive and lacks substance.\n\nHelpful | 6", "arnulf.gunturssonApr 12 at 9:54 AM\nHas nothing to do with swordfights\n\nI bought this hoping for an alternative to Blade and Sorcery over the Link. Sadly, I was disappointed.\nThis is not what I am looking for in a sword fighting game. The fluid combat is jaggy, unintuitive (I cant counterattack while parrying wtf?) and the shooting kills all ambitions at melee.\n\nThe setting and optics dont appeal to me at all, neither does the lack of movement.\n\nIf youre into melee combat with halfway decent mechanics and physics, IMHO theres (currently) no way around Oculus Link.\n\nHelpful | 3", "sawdawg77May 14 at 12:57 PM\nThis game sucks\n\nFirst why slo motion second your weapon breaks third you take damage for no reason\n\nHelpful | 9", "UhOhSpaghettiOApr 25 at 10:53 PM\nAmazing game but needs some work\n\nI previously put 5 stars, but then I realized the one flaw that is holding it back.It would be nice to be able to talk to people on multiplayer\n\nHelpful | 1", "cadu_vrApr 23 at 11:30 AM\nGood buy\n\nIts a lot of fun I enjoy the game a lot but the multiplayer can use some work it is not very fare putting new players vs some of the best players but I enjoy the game not a bad buy\nOverall great fun\n\nHelpful | 1", "DudeMan3525 days ago\nSo Fun\n\nI only give it 4 stars because some of the weapons are hard to control. But other than that it is super fun and I would love to play a4 player pvp.\n\nHelpful | 0", "floob1212Apr 12 at 2:21 AM\nIts decent\n\nThe only reason Im giving this game a three star review is that it is quite difficult even within the balanced matches within the campaign. It also takes a second to bring your weapons back into view to keep attacking or defending which can really mess up the flow of the game . It also seems the point of angle of which you have to reach back to recharge the weapons is too far back (for me anyway) and I feel like they should move that boundary further forward toward the front of the player.\n\nHelpful | 2", "maestro.phillipApr 30 at 3:44 PM\nAbsolutely Wonderful!\n\nJust one question, how do you see your health?? Am I blind? Hahaa it would be awesome if there was a health bar right below the energy. Overall great quality game!\n\nHelpful | 0", "SirKAPApr 15 at 8:34 PM\nIts a great game but..\n\nIm really enjoying the game so far, but I think that the crusaders shield is too big, and the hit boxes are broken for all the characters. Besides that the game is really good.\n\nHelpful | 1", "PrinceDongus9 days ago\nIt's lots of fun!\n\nIt's a really fun game to just fight and feel awesome, I've really enjoyed it until now and can't wait to play some more!\n\nHelpful | 1", "3lineMay 3 at 4:46 PM\nUnsatisfied (Terrible Tracking)\n\nCompared to many other games available, the tracking on this one is horrible, making the experience undesirable, and a complete waste of money.\n\nHelpful | 6", "Big_Ch1efApr 15 at 8:47 PM\nGood idea but just not fun\n\nThey way they decided to handle balancing is very unique are smart but you can still just wiggle a weapon around quickly and kill someone. The core idea of the game is good, a game where you fight with melee weapons against other players in VR is very unique but its just not fun to play. Its not one of those games that urge you to get up and play VR due to the fact that it isnt fun.\n\nHelpful | 2", "tEhanNoYinGcOwMay 7 at 4:04 PM\nEhh\n\nI got this game hoping it would be fun but found that your hand is very off sync with your controller. If you want a good fight buy vader immortal and play lightsaber dojo it is 100 times better(and cheaper.)\n\nHelpful | 2", "PandaDragon2020Apr 12 at 3:51 PM\nIs this going to happen?\n\nI know this game just came out but I do have a question. Is the game going to be adding new classes like assassin or something else? Also I love the game and what you should do, is add factions to battle others. I love the game and keep updating it!\n\nHelpful | 1", "Nova212121Jul 15 at 12:49 AM\nThis game is amazing\n\nIt really works well with the oculus quest it doesnt feel like theres a graphic downgrade but I feel like there should be a 2V2 mode or different modes it would be awesome hopefully this game gets updated and I hope hes developers make more games like this.\n\nHelpful | 0", "Pr0ximoApr 9 at 10:41 AM\nBest VR Fighting Game\n\nTruly unique and incredibly fun! I've been waiting for PVP sword fighting for a while so this was a great find.\n\nHelpful | 4", "Akshaw12Apr 14 at 7:54 AM\nGreat game\n\nThis game is amazing and the slow motion combat and shattering swords aspect works perfectly, but I hope that someday in the future they will make it so you can play with friends\n\nHelpful | 0", "SkyjoggerApr 9 at 3:27 PM\nHmmm slow mo??\n\nNot bad but I find the slow mo really really weird.. maybe some people will like it but its definitely a far cry from any kind of realistic sword fighting.\n\nHelpful | 6", "smokeygamezMay 3 at 8:51 PM\nLOVE IT\n\nGreat game lots of fun good fights and I hear its a lot of content coming to the game as well should definitely consider buying!\n\nHelpful | 0", "Resonantcloth48May 6 at 3:31 AM\nAwesome game\n\nThis game is great, there are some flaws but there is still a lot the developers could add to the game, I love it.\n\nHelpful | 0", "Shaun3087Apr 12 at 12:04 PM\nIronlights**\n\nGreat game so far..haven't noticed any flaws. Really enjoy the gameplay overall. Mainly been focusing on the campaign but I just tried my first online match and won with the ninja class! Would definitely recommend to anyone!\n\nHelpful | 0", "Rico4200Jul 5 at 10:57 AM\nThis game is great\n\nJust bought it today i really was looking forward to the game and the gameplay . Alot of things to do and classes to choose from . Hope they make more classes later on in the year or next year. I would.like to see alil bit of improvement when it comes to the combat. Seem that every time I pull close to the opponent I'm never close enough to hit him.but also really the only fixes I see that need fixing other than that the visual and gameplay is great  good job for a great game guys cant wait to see more of your work!!\n\nHelpful | 0", "aperson1214 days ago\nGreat game\n\nI ten out of ten rate this game for people that likes the block attack part about fighting part of sword fights\n\nHelpful | 0", "richardson2Apr 24 at 10:35 AM\nLooked good but let down\n\nWas expecting a cool duelling game but just found it aggressively boring\n\nHelpful | 11", "SadpotatoboiApr 11 at 5:51 PM\nOne of my favorite games\n\nThis game is awsome with fair duels which are so much fun, idea for future updates is make game modifiers for private matches (no slowmotion?)\n\nHelpful | 2", "Eseyer12Apr 13 at 3:42 PM\nCampaign\n\nI wish it was kinda like tournament style but everything else like multiplayer and customizing your class and all the different classes were amazing\n\nHelpful | 0", "MrFlowerXJun 26 at 11:19 AM\nPor gameplay, expected more from combat\n\nI expected more after watching the video\n\nHelpful | 0", "LaviosMay 3 at 1:41 PM\nGood but not user friendly\n\nThe title, its not user friendly at all, the tutorial doesnt explain anything\n\nHelpful | 0", "Jag11243Apr 14 at 1:53 PM\ngood game, bad execution\n\nWhy is this game turn based?? Literally ruins it for me, this game has a lot of potential but the turn based mechanic really makes me hate it. I cant give it one or two stars because its not a bad game, but its super misleading as I dont really consider it to be a fighting game.\n\nHelpful | 1", "Deboot42 days ago\nTHE BEST GAME EVER\n\nthis game is amazing best game ever\n\nHelpful | 0", "PAKMAN1015Apr 14 at 2:55 PM\nGreat\n\nIve been playing the game for a day or two and fantastic game play one question though how do I get more armor like the kickstarter one I dont have it but still a fantastic game\n\nHelpful | 0", "GameDruidJun 29 at 10:47 AM\nVery well done game!\n\nI recently bought this game, and Ive been having a BLAST. I would definitely recommend it to anyone who enjoys 1v1 combat. I will say that the point/coin system maybe shouldnt be localized to each type of fighter, but maybe overall?\n\nHelpful | 0", "HappyFace08Jul 6 at 8:43 AM\nGreat game\n\nI just got this game and I already like it. The campaign has a few problems, but its probably just me. The multiplayer is very fun and everyone is evenly matched. Great game and would recommend\n\nHelpful | 0", "Lets_playApr 26 at 1:28 PM\n\nVery fun lots of creativity and skill used in this game only thing I wish was that they had a samurai class\n\nHelpful | 1", "JonasDragonKingApr 19 at 5:07 PM\n\nFix the classes the Bosa and the fencing one r way too overpower I literally just hate finding people with those types of classes so stop with those two being too powerful\n\nHelpful | 3", "DAX_QcApr 9 at 10:41 AM\nAre you serious? Mp no chat/loco/hands.\n\nThis game is purely and simply a joke. 25$ (with tx canada) for a pseudo multiplayer game with no voice chat, no locomotion, no hand/finger movement. Are you serious?? Lol\n\nYou are stuck in place and press a button to dash to opponents. No parry with body or movement left or right nope. Also, your avatar has a fist.. thats it. No finger tracking what so ever. AND NO freaking communication..\nLol\nI tried it for 20 min and i was simply god smack. Wow just wow..in 2020. Avoid like the plague.\n\nPrepare for over hype reviews lol but I am giving it to you like it is.\n\nGet sairento or if you really crave knights get Sword of Gargantua at least it has real sword fight and voice chat etc.\n\nHelpful | 52", "masterblaster32Apr 14 at 6:55 AM\nFun game\n\nThe times it deals game is fun but some like the campane mode is rigged for the computer\n\nHelpful | 0", "i_hug_youApr 17 at 8:50 PM\nIts to difficult to the point where it'\n\nIve played it for hours and hours and I still couldnt win one match its to difficult for a game thats supposed to be easy, fix your game bruv\n\nHelpful | 8", "Darth_MaulerJul 22 at 5:13 AM\nI love swords\n\nI love swords and fighting and this game is amazing. I use a reaper as my main and its quite fun so far. I do best with the reaper and knight\n\nHelpful | 0", "Lachie_DanielApr 11 at 1:05 AM\nAmazing game but...\n\nI would love to see new unlockables for all characters to buy using the in game credits. I think this would add all the more reason to play. Awesome game though.\n\nHelpful | 1", "mrikgamingApr 19 at 1:33 PM\nGood game but...\n\nITS a general good game but i would like upgrading\n\nHelpful | 1", "jimbizzyboyfoxybizzMay 5 at 6:27 AM\nAbsolutely\n\nBy far my favorite dueling game\n\nHelpful | 0", "SpicyFriedFriesApr 19 at 5:54 PM\nFun game with a good community\n\nI've been waiting for a game like this on the Quest for a while and its finally here. gotta say its great!\n\nHelpful | 1", "PaladinLeeroy710Jul 19 at 7:28 PM\nGreat game\n\nThe only problem is that you can stand really close to the enemy and make it pretty much impossible to block the scythe with slower weapons.\n\nHelpful | 0", "Raizen325May 3 at 1:08 PM\n\nGreat game lots of fun \n\nHelpful | 0", "steamingpiranhaApr 14 at 7:27 PM\nAmazing\n\nThis game went over my expectations like my god the singleplayer mode is fun multiplayer is fun and its just amazing\n\nHelpful | 0", "i_ambeastatRDRApr 17 at 5:39 PM\nGreat game\n\nOne of the most innovative sword fighting games Ive played.\n\nHelpful | 2", "PaleCommanderApr 10 at 6:57 PM\nFun combat\n\nNice single- and multi-player melee combat that takes advantage of the VR format and gives a variety of styles and tactics to learn.\n\nHelpful | 1", "LAUNCEL0TMay 4 at 12:47 AM\nGood\n\nGood pretty good\n\nHelpful | 0", "WetRobotUnicornApr 12 at 6:22 AM\nRAD\n\nThis is probably one of my favorite games I have on my quest. It feels so BADA$$!!! All the classes play differently. Awesome\n\nHelpful | 0", "MousemuncherApr 12 at 3:08 AM\nGood melee\n\nWish there was a way to skip intro sequence at start of each fight.\n\nHelpful | 1", "ba55eMay 5 at 3:17 PM\nGood\n\nYes\n\nHelpful | 0", "FatherLuis98Jul 20 at 7:25 AM\nDecent game\n\nIts not a bad game. Theres always room for improvement.\n\nHelpful | 0", "IndymclassApr 25 at 10:30 PM\n\nNeeds more weapons to use but overall very good\n\nHelpful | 0", "Bigboy1020Apr 14 at 10:20 PM\nAmazing\n\nReally great game to play with a friend or just by yourself. Just make sure you dont hit anything!\n\nHelpful | 0", "StuperPancakeMay 3 at 3:01 AM\n\nVery nice\n\nHelpful | 1", "memejuceApr 21 at 2:21 AM\nGreat\n\nReally fun\n\nHelpful | 1", "AdroitFlameApr 13 at 3:38 AM\nAmazing must have\n\nThis game is amazing but there should be more character selections or upgrades that you can buy or weapons\n\nHelpful | 0", "xxUNOxMASxxJul 19 at 1:40 AM\nWelllllll\n\nI like it.. scyth guys projectile could be more useful\n\nHelpful | 0", "B00kWurmApr 10 at 11:35 PM\nAmazing!\n\nAlthough there are a few bugs, the game is still awesome! The physics are amazing and the gameplay is fun!\n\nHelpful | 0", "sp00n225Apr 14 at 12:57 PM\nFun to play no report functions\n\nVery fun and hard to play but the thing that makes it hard is the cheaters who hack their way out of slow motion which causes me to not wanna play. Hopefully I Can Refund it.\n\nHelpful | 1", "ItsBarry2024Apr 14 at 10:31 PM\nAmazing and fun\n\nIts great Im addicted so much I got to the top of the leaderboard \n\nHelpful | 0", "NyctosisApr 15 at 12:37 PM\nGreat game great implementation of strat\n\nGreat implementation of strategy love this game great mechanics.\n\nHelpful | 0", "vShadow7Apr 10 at 12:05 PM\n\nFinally, a game that got released when it said it would be released. Five Stars.\n\nHelpful | 1", "dante.cerasuoloApr 12 at 11:42 AM\nPerfect!\n\nIve been waiting for a while for this game and its outstanding!\n\nHelpful | 0", "Toblerone007Apr 29 at 1:25 AM\nBuggy\n\nCould be cool one day, but seems buggy most of the time including the upper and lower bounds being messed up upon starting the app.\n\nHelpful | 1", "LofusShrodingerApr 23 at 11:27 AM\nThe best competitive game on the Quest\n\nYeah... That\n\nHelpful | 1", "miketheswanApr 15 at 3:09 PM\nAmazing\n\nOne of the most fun games on the quest in my opinion\n\nHelpful | 0", "jhpleasantApr 11 at 4:15 PM\n\nAdd axes and spears and other weapons great game with room for growth\n\nHelpful | 1", "dommommaJul 30 at 8:32 AM\nfun\n\nvery very fun game\n\nHelpful | 0", "TheFlash4evaApr 10 at 10:40 AM\nAmazing!!!\n\nTruly outstanding game! This is the only game that I honestly can't put down!\n\nHelpful | 0", "king2beApr 15 at 9:35 PM\nIve never been more immersed\n\n100% best game Ive played on the quest\n\nHelpful | 0", "RayAllenTaylorJun 30 at 12:49 PM\nLike the game idea .. but motion sicknes\n\nI like the idea , it feels unique and cool.\nBut for me it has to many sequences, that are causing unneeded causing me motion sickenss.\nAlso, I think the menue ui Looks unpolished and confusing.\n\nI guess I will not play this game anymore... Just no fun.\n\nHelpful | 0", "King_KratosApr 22 at 12:44 PM\nGood\n\nGood\n\nHelpful | 1", "sandigreenawaltApr 18 at 5:40 PM\nAhhh\n\nAhhhhhhaaaaaaahhhhhh\n\nHelpful | 1", "sirplungeeJul 12 at 3:37 PM\nAmazing title more like this!\n\nI bought this game a few weeks ago and i already love it. Just needs more players online\n\nHelpful | 0", "Hurl3yJun 4 at 8:52 PM\nFun game, but just a thought\n\nI love the idea of the back and forth sword fighting. I think its a great game but Im not too big on the slow mo combat. I think you could implement a sort of Realism mode where everything moved in real time.\n\nHelpful | 0", "Tiberian_Apr 9 at 4:25 PM\nGreat fighter\n\nWhat I've been looking for in a multiplayer fighting game\n\nHelpful | 1", "IAMGROOTIAGApr 18 at 5:47 PM\nFun\n\nEven funner\n\nHelpful | 1", "Preston_boyohpalApr 17 at 9:23 PM\nBest game on oculus right now!!!!\n\nI love this game\n\nHelpful | 1", "css7645Apr 15 at 1:43 PM\nGreat multiplayer game\n\nWrite a review (Required)\n\nHelpful | 0", "DarkLord_040May 29 at 6:43 AM\nA VR experience like no other\n\nI bought Ironlights expecting a boring and shallow game but my friend wanted me to get it so we could play together. And after my first match I just had so much fun the gameplay is really unique and makes it really feel like your fighting in a futuristic arena. There are different classes which are very distinct from each over meaning no two classes act the same. The only problem I have is the fact that not many people are playing this great experience. But luckily you can do the campaign while you wait for a match so its not too big of a problem.\n\nHelpful | 0", "JadenthefrickiApr 16 at 2:50 PM\n\nIts really good\n\nHelpful | 0", "Brynaster58Apr 10 at 1:11 PM\nAmazing game\n\nIt is the best game I own\nI really recommend\n\nHelpful | 1", "Elementalgaming1987Apr 9 at 10:29 PM\nLaggy but very good\n\nThe gameplay is very nice but its to laggy on multiplayer also great graphics love the way it looks i hope this game will be updated more. Love it\n\nHelpful | 1", "Antfirewierd0Apr 18 at 11:24 PM\nIts lit\n\nYes\n\nHelpful | 0", "VotableVoidApr 18 at 6:32 PM\nGood Game\n\nYes\n\nHelpful | 0", "Cool_Dude9LAApr 11 at 10:42 AM\nAmazing\n\nGreat graphics and gameplay, love it\n\nHelpful | 1", "butterscottJun 23 at 4:22 PM\nOMG SOOOOOO FUUUUUUUUN\n\nI looooove this game. So immersive and fun and amazing. I love being the monk and using a staff because Im just naturally good at it. Its a must buy.\n\nHelpful | 0", "redoxofulMay 28 at 7:09 PM\nI love it!\n\nThe game is great! The mechanics are unique and really fun to play with, and the gameplay is super smooth when done well. The game has gotten the multiplayer curse, though. Theres just not enough people playing multiplayer.\n\nHelpful | 0", "Cowb0yApr 9 at 6:31 PM\nJust WOW\n\nMost fun game Ive ever played.\n\nHelpful | 1", "JordanNDJul 22 at 1:18 PM\nThis good\n\nThis good\n\nHelpful | 0", "Darkraven4908Apr 11 at 1:25 PM\nBest game\n\nBest game on vr\n\nHelpful | 0", "LighterChaff15Apr 13 at 9:19 PM\nIts honestly a great games\n\nI love this games so much definitely one of my new favorites Im so excited to see what weapons and cosmetics there going to add in the future \n\nHelpful | 0", "IronlightsApr 13 at 5:22 AM\nit's ok\n\nyes\n\nHelpful | 1", "jokull.sigrjonson.9Apr 11 at 5:00 PM\nCool\n\nIts fun\n\nHelpful | 0", "AquaDark-YTMay 22 at 8:43 AM\nAwesome game!\n\nI have been playing this game for one day now and have been having a fantastic time! The multiplayer and campaign game modes are perfect. If i could change one thing though it would be that when you pull your weapon back to reload it, it hits your head and takes some energy away from your bar which is merely annoying. Other then that this is a wonderful game!\n\nHelpful | 1", "Mr.N1r0Apr 12 at 6:34 AM\nWow...\n\nWowww\n\nHelpful | 1", "DAEdude16Apr 11 at 12:09 PM\nAwesome\n\nGold\n\nHelpful | 1", "LinYao2008Apr 10 at 10:23 AM\nVery fun\n\nVery fun\n\nHelpful | 1", "septic38rpMay 7 at 9:01 PM\nVery solid with minor issues.\n\nThis game is very fun to play and even to watch, the classes feel unique and interesting and overall the gameplay and AI are solid.\n\nMy only complaint is that the campaign menu is all over the place and some weapons are seen in the campaign but nowhere else, (Spear) it would be interesting to add some new classes with these weapons or even mismatch weapons in a custom battle.\n\nHelpful | 0", "JHTVMay 16 at 9:47 AM\nAbsolutely great.\n\nThis game is phenomenal, it makes you feel like a king. Great classes to choose from with their own unique style and has a fair bit of challenge to it, the only thing I would add would be watered down version of the bosses as classes, aka spear class, axe class etc. All around great game for this price and I would recommend it to anyone who wants to never get bored.\n\nHelpful | 0", "TPNCatsterApr 10 at 12:23 PM\nNeeds to be fixed\n\nThe monk is super fun to play as but everything else is op the monk needs a buff\n\nHelpful | 1", "Doom243BoomApr 13 at 2:29 AM\nFive out of Five, just one other thing\n\nOne of my FAVORITE games. I recommend it for new players, Like it says, do the tutorial for each weapon you use so you can use them in multiplayer! I hope you like the game as much as I do! Also, Add Multiplayer Duos mode, thats all!\n\nHelpful | 0", "PsychoDog2002Apr 27 at 7:26 PM\nCouple suggestions, but a fantastic game\n\nThis is amazing and makes you feel awesome! But, a couple suggestions;\n1. When playing offline (like I do mostly) why do we have to have coins to play? Like, Im trying to learn the class in an actual fight, then lose once and cant play anything but the tutorial again..\n2. The menu is very cluttered, but not too confusing so long as you take a second to look.\n3. Sometimes the bots can block a lot, making you have to cheese by just spamming your shots... and this is bronze league, I just started!\n4. There should definitely be a punishment for going afk too long, and a casual mode for either single or multiplayer.\nBut this is fantastic, a great game thats cheap-ish and has a lot of replay-ability :)\n\nHelpful | 0", "toddjodiApr 9 at 6:44 PM\nMeh\n\nNot bad\n\nHelpful | 2", "AdmTeaApr 9 at 1:47 PM\nJust the game Ive been waiting for\n\nAs an avid fantasy nerd, Ive been looking forwards to a quest game where I can fight with swords that isnt a buggy pile of errors. Ironlights is that game for me. Its probably the first sword combat game that doesnt feel like Im waggling my weapon at my opponent to win.\n\nThe slowdown of close up fights is an awesome mechanic that helps you feel like a graceful dealer of death as you face down your enemies. This coupled with the shatter/charge mechanic leads to thought out attack patterns and counters. Finding the class that just meshes with you is incredibly satisfying, and recognizing the subtleties of combat is incredible.\n\nI will say its probably not for everyone. The focus is on the combat system, as well as the look of the armor. Thats the whole game. For some, that might feel like not enough. For me, it has the right amount of customizability to where I can feel satisfied but not overwhelmed. The lighting system is also one of the best Ive seen on the Quest.\n\nAll in all, I would gladly recommend this game to anyone who is a fan of swordplay, gladiator fights to the death, and hearing the roar of the crowd.\n\nWhat is best in life? To crush your enemies, see them driven before you, and hear the lamentation of their women!\n\nHelpful | 3", "PGDVenomMay 1 at 11:32 AM\nBest multiplayer game on quest.\n\nThis is by far my favorite multiplayer vr game. The combat is fluid and multiplayer has no lag even at high ping. The main thing I would like added is open mic and more classes. An open mic would really improve the game and make it less repetitive sense it's a new person every time. Each class is extremely fun and balanced. There are enough classes right now but a few more would be amazing! The campaign features classes that I really wish were playable such as a guy with a spear and a shield. Please add more classes! NOTE: I just read a lot of reviews talking about the game being unbalanced. This is not true. If you actually practice and get better at the game you can beat any class. There is no OP class.\n\nHelpful | 0", "RvilleMay 1 at 6:36 PM\nFabulous game!! Try it for sure.\n\nExcellent job by the dev, great mechanics. Win a few matches in the Tutorial before moving on to live matches/tournaments and online play - and youll be all set. Tons of fun. I like how you gradually move up in skill/level as you learn and get better, and you can be matched against equals as you advance. Online play matches you against similar skilled players. I spent hours upon hours playing this right from the start. I was hooked. My new favorite game!\n\nHelpful | 0", "tuismApr 20 at 8:36 AM\nA great start\n\nThe presentation is solid, the gameplay interesting.\n\nBut like all good fighting games, it takes iterations on balancing.\n\nAs it is now, it took me all of the first 30 minutes to find that the monk is probably brainlessly overpowered. Second to that is the crusader's double blade.\n\nAnd that long wait to get into a fight is really annoying.\n\nBut really, I hope it gets good. Because it had potentials to become something really special. But if the way to win is to spam a single move, well, that's not very interesting. I thought the whole point to go into slow mo was to get around that...\n\nHelpful | 0", "TheDestroyer3113Jun 5 at 3:19 PM\n\nIts awesome and I love the combat style plus the fact that its multiplayer just takes it to the next level\n\nHelpful | 0", "AudreyHenryMay 1 at 2:43 PM\nThis. Game. Is. Amazing.\n\nI just got this game and it is in my opinion the best one in VR. A big thing for me is motion sickness in VR, but this game has no motion sickness at all, and this is coming from a person who also threw up in the fruit ninja game! Completely worth the price, and there are no issues.\n\nHelpful | 0", "AmericaIsMyCity69Apr 16 at 3:23 PM\nFantastic game but a few issues\n\nThis a great game and definitely worth more than 20$ however though my problems are that first of all when you start a match I TAKES SO LONG TO ACTUALLY PLAY THE MATCH. That is my main issue and also I wish there were more characters in the game there is only 5-6 (I cant remember). And make the fencer stronger that is by far the weakest character in the game. I have put this on my wishlist since it went in the shop and it is a good game. (Oh and btw, when is Echo coming out)\n\nHelpful | 0", "Roadh3adApr 16 at 3:35 PM\nFun game, could use better tracking\n\nThis game is dummy lit. All of the classes (except knight) are super fun to play and have counters and strengths unique to their class, the armor customization is really cool, and the fighting mechanics are well done. Only issue is the knight had questionable weapon tracking and is very hard to use\n\nHelpful | 0", "seanlazerApr 14 at 3:18 PM\nEPIC GAME with a note to the developers\n\nLet me just say that this games fighting is for the most part EPIC! Getting to choose from different characters with different weapons is awesome! The developers of the game have created a very unique and fun fighting technique unlike any other quest fighting game. The only reason I gave it four stars, is because the game can get kind if old after a while, along with its slo mo, but neverless is still worth it! Like i said in the title of the review, the game has so much potential to become a classic like super hot and beat saber. I do have a couple of fixes and suggestions to the developers to make the game an even more fun experience.\n\n1. Is it possible we could get more music choices, maybe like gladiator epic fighting music. I also think it would be really cool if we could listen to our Spotify playlist while in the game. If i could listen to Hamilton while fighting, man that would be an amazing experience.\n\n2. I love the slo mo fighting technique, but would love to see what i could do in real time. Maybe in multiplayer, there could be fighting arenas in the future that are not slo mo. Just a thought!\n\n3. As much fun as the game is right now, i wonder what could happen if you could move around freely on the arena. Right now all you do is stay in the same spot and advance in one direction toward your enemy, which is still really cool, but i wish there was a way to use the controller sticks to move around the arena. I think others could agree that would be cool! If this were to happen, maybe you could actually die falling off the arena which could add a dramatic experience too! It could be like the movies, where the enemy is dangling off the cliff, holding on for dear sake.\n\n4. When I go to attack someone, its really fun, but its kind of is just slashing them with your sword randomly, and i wonder if in the future, i could attack them with my sword in different ways. Idk, just thought it might be cool. Someone else in the comments suggested being able to do backflips and stuff.\n\n5. The gloves and graphics are really good, but maybe developing hand tracking in the future would make it more realistic.\n\n6. Maybe could their be a commentator?! Maybe just someone who introduces your name at the beginning! In the red armor we have... Idk just another suggestion.\n\n7. Also the Monk is a spammer that is really hard to deflect when you have to keep regenerating your weapons. Its sometimes impossible for me to deflect them when they keep spinning their stick at me, as it seems one cannot regenerate fast.\n\n8. This is the last suggestion that is the most important! When you defend, it would be really nice if you didnt need to regenerate your weapons.\n\nAll these suggestions are not because the game sucks, but because the game right now is really cool and could develop in the future to be the best fighting VR of all time! Its a blast to play, and if anyway is looking for hand to hand combat in a game, IronLights is for you!!\n\nHelpful | 0", "JetPackJudApr 25 at 10:18 PM\nGreat potential\n\nThis game has some absolutely fantastic ideas. Having to \"reload\" your weapon allows you to have balanced combat and can lead to some satisfying blocks and attacks. The game unfortunately has some things it could do better. Ranged attacks for example are way too strong. My first online match was with someone who rarely approached me and mainly used his ranged attack. Some classes are also way too overpowered compared to others. I play as a duelist and it's extremely easy to win playing as this class, some classes can have their strengths and weaknesses but some of them are severely unbalanced. The last thing, maybe this is more just personal taste, but, slow motion combat is a good idea, however I believe it should be in a separate playlist or an option in the menus to decide whether or not you want slow motion combat, it could allow for people of higher skill levels to fight and really show off their reflexes. Otherwise this game is great, five stars because it's such a good idea and I've had nothing but fun playing it, I hope to see it improve in the future and possibly become one of the first VR esports games, but before then it needs some work.\n\nHelpful | 0", "ContentCashew18Apr 13 at 6:11 PM\nGame is okay\n\nFirst of all, the fighting and everything is cool. I wish there was an option for weapon changes like different flails for the Crusader. I do not like the damages from certain characters. Some of them are way to powerful even at your level and are nearly impossible to defeat ( probably my fault). Overall game is good. Multiplayer is not okay at all how you can use your play space size to your advantage, you can go to the edge and not be hit by certain classes. Overall, great game.\n\nHelpful | 0", "Sky-0_0Apr 9 at 8:25 PM\nAMAZING\n\nJust to sum up the review because its kind of long and I dont want to subject you to read the whole thing I feel like the game is great dont listen to the 1 & 2 star reviews because it clearly seems like they didnt put the time in the game to learn the mechanics and get used to things. Also regarding the ninja spam technique it can easily be blocked with all classes maybe not the knight class but thats why the class is rated as a hard class. Also there is skill-based matchmaking\n\nSorry for the lack of commas im really tired right now from playing the game\n\nThe Review\n\nDont listen to the 1 & 2 star reviews about slow motion they clearly didnt spend enough time in the game to adjust to it once you get used to it it is absolutely amazing and the graphics are stunning they are on par with Red Matter in my mind also in regards about the ninja spamming technique it doesnt work you can easily block all the bullets with each class it may be harder for the knight class but thats why the difficulty level on that class is hard The campaign is good I usually just use it for practicing multiplayer is quick I even tested it at 10:00 PM and I found somebody instantly and by the way in a interview with the developer he said that there will be skill-based matchmaking like how good you are doing in games determines who you get matched up with they dont have it set right now since the game just came out and again it takes a while to get used to be game dont write a bad review because you spent 20 minutes in the game And think its terrible because youre bad at it it just takes time to get used to It\n\nmechanics in the game are great I really feel like The knights sword is heavy and all in all I think this is an amazing game\n\nHelpful | 1", "EEE_is_Me_123Apr 24 at 7:46 PM\nGame that Ive been looking for!\n\nWith the Oculus Quest its limited in graphics and overall ability to run games, but this game runs smoothly and doesnt try to push the graphics so it looks very nice. With gameplay it has a very strategic energy bar where you can choose to maybe wait to charge it up, but that could leave you vulnerable, shoot ranged projectile though your enemy could block, or just attack which can damage but they can block, every choice you make will affect you and haunt for the rest of the match, and I was worried that a person could just flail a sword around but the game has a mechanic for preventing people from doing that, overall if you like fighting games with swords and whatnot you should definitely check this game out.\n\nHelpful | 0", "Co0pMay 20 at 6:44 AM\nAwesome!\n\nThis game is fun. I love the idea of slow motion fighting. There is one issue. The lobby is so confusing to find out what to play. Other than that I love this game.\n\nHelpful | 0", "ambeo321Apr 10 at 12:36 PM\nReally good.\n\nGreat melee game overall but the multiplayer is lacking key features. You cant talk to your aponent. To play with friends you need to type in the same name to join and host there should be ranking or lobbys. Also if your aponent leaves before you save the mach video you cant save it. Lastly the 1000 coins you get from winning an online match are nonexistent you cant see or use them in any way. But this is still a great game that I recommend buying. These changes I hope are likely to come in future updates.\n\nHelpful | 0", "4rachnidKidApr 10 at 5:37 PM\nGreat game\n\nI love this game, its the type of game Ive been looking for since I got the quest. Theres just one problem, in the campaign, I feel as if the bosses on the stages are too accurate with their blocks when you go to attack them, making it so that I have to go up to them many times hitting them one to maybe ten times if Im lucky. This also makes it so I spend a longer time. But I have to be honest that doesnt really bother me, the game is really really fun, its just I fear other players will have a hard time with that.\n\nHelpful | 0", "iluveogzJun 6 at 3:18 PM\nBUY IT NOW!!!\n\nTheres not much to say except you must get this game its awesome\n\nHelpful | 0", "TheVirtualNickApr 17 at 10:58 PM\nCant stop thinking about this game\n\nFrom the wide and unique choice of characters to the ease of using the game and navigating the menu screen, this game runs smoothly with a lot of opportunities for the user to make the best of their experience. The wide selection of weapons and armour makes the character unique to you and the game physics of the fighting is perfect, it does take a bit to get used to the while slow motion thing but once you do you will be playing this game non-stop!\n\nHelpful | 0", "AwwyeeahApr 16 at 11:12 PM\nAmazing : Stunning Combat\n\nThis is everything I wanted when I thought of a competitive melee type VR game.\n\nVisually Satisfying Combat\n\nUnique Classes (cant wait for more)\n\n\nThings I would like to see :\n\n1. Unique Colors/ Armor available to spend coin on\n\n2. Spectator Mode\n\n3. A simple skill tree maybe with 3-4 interchangeable talents (example):\n\nDefensive , Offensive , and Shoot Style talents , you can slot these with different abilities (1 each ) to customize how your class plays .\n\nThis would help distinguish play styles a bit , especially against mirror matches.\n\nOverall , Love this game !!!!!!!\n\nHelpful | 0", "hightechfoolApr 9 at 12:38 PM\nControls a lil tricky...but awesome\n\nThere is a tutorial for EACH class in this game, be sure to remember that. And if you miss any details (like swinging back your weapon to recharge it) your first few matches will hurt. otherwise, there's lots of stuff to do and it's got great replayability. almost 5/5\n\nHelpful | 1", "GamerGissApr 14 at 6:07 PM\nNot bad, Kid\n\nThis game looked amazing when I first saw it because its one of the first real good sword fighting games on the quest but the combat that was displayed where your weapon breaks when it hits something put me off. I looked at the reviews and decided to buy it and it was a great decision! The combat is actually one of the better systems than anything else I have tried. Very fun game, easy to learn.\n\nHelpful | 1", "RudacrissApr 13 at 1:01 AM\nFlow Arts in VR!\n\nAs a Fire Spinner and Flow artist and Martial Artist...I just got a quest before this quarantine, and this game (out of the many I have bought and played so far, is by far the best in form of combat flow. Each character and various weapons perform just like in real life, it's a delicate speed of flow you need to be in while attacking, which is challenging...a natural surrender to the flow type of movement ;) Its unreal as is. A potential improvement could be a selection of settings for the speed variance of when attacking in future updates :)\n\nI played each character once thru, tried all the weapons and then played 1 game of multiplayer....WOW! I'm not big into multiplayer games but this one was one of the best experiences I have had on the quest so far. I felt to be matched up with someone so unique in their own style and it felt so human and connected....while battling each other and trying to make the other one explode of course! ;) In a niiice slow mo finale blow. This game delivers. Replay value the highest maybe? Everybody has a unique fighting style and this game really displays that well and it translates a huge amount through the headset. Multiplayer is really fun here ;)\n\n*Developers, You knocked it out of the park. So amazing. I realized while playing around with the battle axe (after a fight)...that the movement is like holding a single pair of Poi. I just imagined having another one, in the other hand and being able to go into a game or tiltbrish type space where it's a flow jam kind of thing... more colorful flow with effects (control amount of trails from prop etc..) and laid back flow jam. Dope music...WITH, MOST IMPORTANTLY your video capture and recording capabilities that are used in this game. Would be an epic creative space for people. It seems like you got the mechanics down for someone to be able to get lost In the flow and create amazing art with it! Just saying, maybe a future idea...? Could be pretty dope.\n\n*Especially since festivals aren't really happening for the foreseeable future. LED flow art and fire spinning app anyone?\n\nGet this game btw, major FOMO you have no idea about if you dont ;p\n\nHelpful | 0", "nateion7Apr 12 at 9:42 PM\nAbsolutely incredible\n\nThis game is exactly what you want in a dueling vr game. The gameplay is amazing and the slow motion segments slow things down enough to allow the players to strategize and look for openings. This prevents the frantic swinging you'd find in other games. The characters are so different that anyone can find one to match their play style. Some characters also counter other characters quite well. If you're considering getting this game, you absolutely should, it's the best sword fighting game on the platform, in my opinion.\n\nHelpful | 0", "CottonIsDeadApr 12 at 11:07 AM\nI cant stop playing\n\nI literally got this game yesterday and cannot stop playing. The concept alone is just beautiful. The gameplay is always fun and I can wait to play after writing this review. Whoever thought of this game must be genius because I stayed up until 2:00 in the morning just playing this game. I highly recommend this game unless youre scared to become addicted to it.\n\nHelpful | 0", "Batman587w784Apr 11 at 3:08 PM\nBy far my favorite game on Quest\n\nI have played Arizona Sunshine, Beat Saber, and other games. But my favorite game of all time is this. There is a bit of learning curve (if you dont take the tutorial) but once you get ahold of this games mechanics you can really have a great time. The only thing I wish they would add is voice chat with opponents but besides that it has all you would expect. (Awesome multiplayer, awesome immersion, stunning maps, custom matches, campaign)\n\nHelpful | 0", "DreigonixApr 11 at 10:00 PM\nAbsolute essential!\n\nOne of the best games on the Quest right now! Crusader is my favorite class the spiked flail is seriously fun. (Also, I love doing the DBZ Super Saiyan pose and scream when charging power... it seems fitting.)\n\nI would love for there to be more customization options in the future maybe different weapon skins for each class as well as more classes and potentially other arenas! Cant wait to see where this game goes!\n\nHelpful | 1", "chettawanApr 11 at 5:20 AM\nWhen you understand it...\n\nIronlight slowmotion battle may not appeal to some people but after you've tried and accept it this is great mechanic for dueling in VR. No one benefit from quickly slashing sword but need to think of how to land a hit on target.\n\nGraphic is great, may need more arena or just have some decorations to make it different each time. GIF export and sending mail is brilliant.\n\nThe rest is how to make people keep playing it as tournament or rank match. May be season reward such as exclusive armor/helmet colors etc.\n\nHelpful | 0", "TheBunnyGamerApr 11 at 4:52 AM\nGood combat with both AI and PvP\n\nI like this game a lot and it really does give you exercise. Five classes is quite a lot to choose from, and it's really interesting how this game utilises a PvP system without including wild shaking of your controllers. However, I dislike how flimsy the weapons are and also how little there is to the game - it's just purely battling. Spectating would add so much to the game! I think this game has a lot of potential. Good work!\n\nHelpful | 0", "ZamaLlamaApr 10 at 10:19 PM\nWow.\n\nI usually dont write reviews, but I just got sucked into this game for 2 full hours on accident. I thought it was going to be super hard, but it was surprisingly easy to pick up. I can already tell, however, itll be tough to master. The combat is fluid, the replay engine is fantastic, and the classes feel mostly balanced. Id love to see more classes in the future, and some kind of ranking system. Otherwise Ill definitely be playing this often.\n\nHelpful | 0", "Seirra1ProphetApr 11 at 10:44 AM\nReally fun game only one issue\n\nSuper fun have already played it a bunch the only problem is in the later parts of the campaign as the boys get more difficult the fact the I'm 6'6 starts to make it difficult. The enemy is able to hit up high then low much faster as well as its low hits are around my shins. If there was a way to adjust the enemy hight would make it a lot more comfortable.\n\nHelpful | 1", "Gabriel192_LyxApr 9 at 3:46 PM\nA game like no other\n\nFor me this is almost the perfect VR game. It features perfect 1v1 fights and has a nice set of classes to choose from. Tho it has a few little things that could be changed like the ability of actually using your fingers which would make taunting a bit more fun as well as an optional voice chat. Another thing is that NPCs have weapons which you yourself can't choose so it would be a nice addition to the already existing choice of weaponry like the Speer or the mace. These problems don't take away from the pure fun an challenge this game presents.\n\nHelpful | 1", "z3bra_pandaApr 9 at 4:30 PM\nIts not for everyone....BUT ITS SO GOOD\n\nIf you dont hate it You. Will. LOVE IT.\nIve been expecting this game for a while and it functions EXACTLY as advertised.\nNo tricks. No lies. No glorifying. There is a slight learning curve to the combat mechanics, BUT THATS WHY THERES A CAMPAIGN!!!! Its as simple as get in, learn, play. Over all, Id recommend it to everyone. And believe it is a very valuable purchase.\n\nHelpful | 0", "SayianPrincess11Apr 10 at 12:24 AM\nOne of the best looking Quest titles\n\nFantastic graphics and a fantastic game. I havent really touched single player but the online is so addictive and engaging. I love being able to wave and dance with my opponent and the fighting mechanics feel so good. Only complaint I have is that I really wish there was female armor, it's always annoying when the boys get all the customization options. If you could add some female avatars thatd be amazing!\n\nHelpful | 1", "ZapzivalApr 9 at 7:13 PM\nBest Game Ever!\n\nHonestly this game could not be any better. The graphics are stunning and its just wonderful! The classes are pretty balanced (maybe a little more balancing could do, but its a brand new game) and each class is so fun to play. Playing as a monk feels amazing! It is so immersive and is so much fun! The community here is great and I am so glad to be a part of it as well! Every single game I joined, the opponent waved to me and I waved back. It made me smile every time seeing them wave.\nHonestly, this game is amazing, give it a shot!!!\n\nHelpful | 0", "JosephTheJockApr 9 at 2:46 PM\nVery strategic\n\nCombat is interesting, alot of strategy goes behind each move and good judgement is a large factor in that strategy, the slow motion combat was a clever idea, although some fights specifically boss fights were rather lengthy i still enjoyed them, only makes it more satisfying when you land a hit, i don't imagine this kind of game would appeal to EVERYONE but i recommend it regardless, visuals are clean and nice with good lighting and shadows and overall just a good game.\n\nHelpful | 0", "MrAbioticScootApr 10 at 9:01 AM\nFighting game done right\n\nMany melee fighting games on vr are just hack and slash games and are a test of who can swing their arms the fastest. This game fixes those problems and gives a strategic and balanced gameplay along with good multiplayer servers and allows you to play with your friends in private matches. I have had so much fun playing against other players along with the fun but short campaign. Would highly suggest to buy and is worth 100% worth the price.\n\nHelpful | 0", "Craftr4LifeApr 9 at 11:41 AM\nMust Buy!\n\nThis is a must buy for sure! The fighting style is unique and brand new! I have been anticipating this game for a while and I wasnt disappointed. The only thing thats missing is finger tracking and the ability to speak. Other than that, its worth the $20. This game makes you think and strategize. Everybody is different making this a game where you need to adapt on the fly. The single player has super responsive AI. The graphics are also great and I love the shadows. The night levels feel amazing and the lighting is beautiful. I know that the devs are working on adding more classes, armor, and probably more stages. This game is a work in progress but its worth buying. I cant wait to see what else the devs have in store.\n\nHelpful | 1", "Xx_Legends_xXApr 9 at 3:40 PM\nThis game is Amazing !!!\n\nWhen I saw the game trailer I was weary weather to buy it or not. Thank God I bought it !!! The slow motion mechanics work great and the controls are easy to learn and it makes me feel like a Gladiator in an arena. So if you are into the melee PvP Genre then I highly recommend you buy this masterpiece of a game\n\nHelpful | 0", "Wesley0044Apr 10 at 9:55 AM\nIts just so good\n\nEverything in this game looks and works like a dream. And its not even fully done yet! Definitely worth the price. This game is sure to become up there with the big title vr games. If you get it and enjoy it, leave a review so this amazing game can get the recognition it deserves.\n\nHelpful | 0", "EPack102006Apr 24 at 9:47 PM\nI love this game but I hate two things\n\nSo I found out Im pretty good at crusader which is awesome but I hate the fact that the shield gets smaller than a buckler then its like oh well I lost or when I swing my flail at someone and they come towards me and the flail goes through their body I thing you should add where if the chain hits you on the flail you still take some damage not as much but atleast some so Crusaders dont get cheesed every hit I also think you should make the shields be a little bigger like a buckler instead of a tiny puny shield when the durability goes down\n\nHelpful | 0", "edward.campuzano.1Apr 9 at 6:41 PM\nIron Lights...\n\nI was excited for the release of this game. This far it was disappointing.\n\nAs a 1V1 fighter, the slow motion melee ruins it. That needs to go away, or be a switchable function. I understand that the idea was to make the game strategic, but Id rather something closer to a button masher feel but through VR without the slow motion fighting. The lack of ability to shoot at close range also takes a potentially cool feature and kills it.\n\nThis game could be very cool, but for now Ill keep playing star wars Vader 3 dojo rounds before I play this.\n\nHelpful | 3", "GameMaster2006Apr 9 at 11:20 PM\nAddicting / Fun\n\nWhen I first saw the preview for this game it looked great so I got it and it is so much fun. The different weapons you can pick from and the way you can customize your characters armor and color. I totally recommend and I dont see getting bored of this game anytime soon.\n\nHelpful | 0", "monkeybut4000May 29 at 7:13 AM\n\nGud very gud recommended\n\nHelpful | 0", "CreatedShadowApr 14 at 10:02 AM\nPretty Good\n\nBecause of the lack of sword fighting experiences on the quest, I give an extra star. My biggest problem is the Duelist class. If it got nerfed, I feel like I would enjoy it slightly more.\n\nHelpful | 0", "Tylerpriddy637Apr 13 at 9:33 AM\nThe best action game\n\nReally fun to play I really recommend it because its a great way of a strategy game to be fun like when you kill your enemy little shards go everywhere which I think is pretty cool\n\nHelpful | 0", "bradon.quinbyApr 15 at 12:14 PM\nYeet and delete\n\nTo be honest when I first saw this game I thought it was a mortal combat game but now since I played it, it was EVEN BETTER!! PLZ come out with more stuff like this\n\nHelpful | 0", "cabandab775Apr 10 at 10:52 AM\nI absolutely LOVE this game, but....\n\nNinjas are far too powerful, they are fast with two swords that deal significant amounts of damage, rendering it impossible to dodge so you die within one or two attack phases from an enemy.\n\nHelpful | 0", "grmacyMay 25 at 9:56 PM\nBest game I ever played\n\nEnough said.\n\nHelpful | 1", "nfch3131Apr 9 at 12:29 PM\nmy favorite game on the quest now\n\nIt's simply fun enjoyable and the best balance between fun vs. skill I have ever seen might be a little confusing when you start it but the tutorialz are really good\n\nHelpful | 2", "adrain.homesApr 9 at 1:37 PM\nCool game\n\nIt's awful.............ly good, the graphics are terribly smooth and the lighting was sounds just suck ...........me in I will never play this game the same way again, huh good by.\n\nHelpful | 1", "michaloM13Apr 10 at 7:03 AM\nWow, just wow\n\nThis game is really good. It's strategic game with slow motion. Controls are really good and comfort. And you can make gif from your battle!\nWARNING: This is not for everyone and it is not hack 'n' slash and you must train to be better!\n\nHelpful | 0", "Nicholas0725Apr 9 at 2:34 PM\nAmazing game one of the best\n\nAmazing game to play really fun and intercut to play hope they add more customization to the game and more weapon classes but other than that I would highly recommend buying this game for the people who love fluid gameplay and more\n\nHelpful | 0", "diablos74Apr 11 at 6:09 PM\nTHE BEST SWORD HANDS\n\nI'm a fan of sao and this game actually feels like I'm in a real battle. graphics are amazing, it's a fast paced game where you have to make split second decisions. my favorite game so far and I can barely put it down!!\n\nHelpful | 0", "quegueyMay 16 at 2:42 PM\nVery fun\n\nLike the title says, very fun\n\nHelpful | 0", "VerselDarastrixApr 9 at 8:08 PM\nThis game is amazing.\n\nThe game is amazing. Shields should deplete faster with larger weapons but other wise its amazing. Imo it's a must buy for the quest. The slow motion seems slow at first but you will forget about it while fighting\n\nHelpful | 0", "plastictrashcanApr 9 at 11:58 AM\namazing\n\nI was very impressed with the shadows and graphics overall, one of the most realistic experiences I have experienced on the oculus quest\n\nHelpful | 2", "RavrickApr 9 at 10:03 AM\nA must get\n\nIf you are new or old to Vr this is a perfect game for you!\n\nHelpful | 4", "KrazyKoenApr 9 at 11:29 AM\nAmazing but hard\n\nThis game has smooth fun gameplay but if none of the 5 classes suit you, the game is very hard but overall solid 5 star game\n\nHelpful | 2", "babysittingUApr 29 at 9:25 AM\nSo fun!\n\nIts the best game you can get for twenty bucks\n\nHelpful | 0", "Firedragon0729Apr 13 at 10:33 AM\n\nIt is a fun game but can be challenging and can take some getting used to but if your willing to practice I reccomend it\n\nHelpful | 0", "ZakLivyApr 9 at 12:26 PM\nAmazing well made game\n\nThis game is wow, I just played 10 games of multiplayer and it is a lot of fun. You really need to think about which category to go to counter your opponent. Definitely a 5 star game\n\nHelpful | 1", "09073159291Apr 10 at 7:55 AM\n\nAbsolutely outstanding. Great game, howeve the weapon breaks when you hit something is a bit irritating. I would love if the weapons wouldn't break as this will make the gameplay better\n\nHelpful | 0", "Spencer4404Apr 9 at 9:51 PM\nSo fun\n\nIve only played this game for a little while, but once i started i had to play for like 3 hours. Once you get the hang of it and understand how to beat each class its so fun\n\nHelpful | 0", "OculusNathan2019Apr 13 at 9:47 AM\nGreat game for some but not everyone\n\nIt's a great action game and you like fighting games (mostly melee) than this is the game for you but if you like calm games you probably won't like it\n\nI love it\n\nHelpful | 0", "oikka676Apr 10 at 2:38 AM\nVery good game\n\nIts 4.5 stars for me because its no room scale as advertised well not advertised but it says in the litle ikon deskription thing that it is\n\nHelpful | 0", "Thunder0tterApr 9 at 4:58 PM\nSo enjoyable\n\nImagine knights fighting with swords or maces in a big stadium watched by thousands (NPC not real people). WELL that is exactly what this game is. So fun and worth the money.\n\nHelpful | 0", "FFAD3LTAApr 9 at 11:27 AM\nWoah\n\nI honestly dont know what to say about Ironlights. Its a new experience in VR and is a must have for new Quest or any VR user in general. Well worth the wait!!\n\nHelpful | 1", "Mr_TrinidadApr 9 at 12:09 PM\nExcellent game\n\nBeen waiting for this one for a while now. Really happy to finally get my hands on it. Plays really well I just have to get accustomed to the different classes now \n\nHelpful | 1", "mcbobster600Apr 25 at 8:39 AM\nThis game is amazing!\n\nHands down this needs to be an ESports event, overall a great game and super energetic\n\nHelpful | 0", "MrDunceApr 10 at 12:55 PM\nUmm... yeah\n\nJust wow, I do wish there were some sort of communication, an online leaderboard and some unlockable/buyable gear/cosmetics but either than that, just wow.\n\nHelpful | 0", "CoolerBonesApr 11 at 10:24 PM\nSuper cool!\n\nHoly crap this game is amazing! The gameplay is great, the graphics are great! This game is just great! Its completely worth your time and money!\n\nHelpful | 0", "TheTerraBlade42Apr 9 at 8:38 PM\nTerrific\n\nThis is amazing. The sword fighting game we have all been waiting for. Beautiful graphics, fluid swordplay, and fun classes. Its just perfect all around.\n\nHelpful | 0", "delston98Apr 10 at 4:03 AM\nI just got this game and it is incredibe\n\nIts not a hack n slash game which is perfect you have to use your skill and each class has weaknesses and advantages. Its the perfect fighting game\n\nHelpful | 1", "swagmasta19942Apr 19 at 2:52 PM\nOMG\n\nThis game is probably one of the best sword fighting games for the quest you definitely should get it.\n\nHelpful | 0", "MystyTideseekerApr 15 at 9:46 AM\nDa*n this is fun\n\nThis is a surprising amount of exercise, and is honestly a total blast. Only thing lacking is an active multiplayer base \n\nHelpful | 0", "WildWest1024Apr 18 at 11:22 PM\n\nSuper fun some characters are really cheap\n\nHelpful | 0", "WhereIsTheExitApr 13 at 12:02 PM\nControls felt wonky at first, but great!\n\nI LOVE this game, at first I thought controls were weird, but I get it now. Its definitely recommend and very creative!\n\nHelpful | 0", "AJL1308May 3 at 2:24 PM\nAmazing Truly incredible!\n\nReally gooooooooooood\n\nHelpful | 0", "Wee_Woo_Wagon699Apr 9 at 10:44 PM\nAwesome\n\nIts tough, all the characters have their own personalities, and different style of attacks. This game is freaking awesome, just as expected\n\nHelpful | 0", "TadobaApr 16 at 4:58 PM\nAbsolutely a buy\n\nThats it, this game is perfect, but I can see some changes happening to the weapon,\noverall perfect\n\nHelpful | 0", "PocketMnkyApr 9 at 8:05 PM\n\nA very skillful sword fighting simulator that brings forth the feeling of having to outsmart and out move your opponent in a sword fight.\n\nHelpful | 0", "j70610Apr 9 at 10:52 AM\nBest game ever\n\nPure gaming gold.\n\nHelpful | 3", "CallmeTheoApr 9 at 2:21 PM\nthis game is great\n\nwhile playing this game you feel cool fighting (not when you loose) and its fun meeting people and fighting overall\n\nHelpful | 0", "GrimmghostsApr 9 at 11:27 PM\nNearly perfect\n\nThis game is great except for the crusader class I think it is too over powered and I die to them every time\n\nHelpful | 0", "shadowchild789Apr 11 at 3:29 AM\nOmg\n\nMy god this is amazing all Im gonna say is buy this if u love sword fighting and just fighting games\n\nHelpful | 0", "ZedisnotdeadApr 10 at 8:13 AM\n20 bucks it's a steal\n\nGreat job devs!!! This game is on point!!!! So much fun. 20 bucks .....this game is worth every penny.\n\nHelpful | 0", "VR_Vinnie468Apr 11 at 6:06 PM\nGreat game\n\nI decided to buy this game thinking it was going to be awesome. And I was right! Very fun.\n\nHelpful | 0", "olieshwasApr 10 at 10:30 AM\nAbsolutely amazing\n\nAt first I was a little worried about the slow motion but it is so fun when you get used to it\n\nHelpful | 0", "fluffywaffles93Apr 9 at 11:04 AM\nMust have\n\nBest game ever\n\nHelpful | 2", "Cornierclover43Apr 9 at 1:51 PM\n\nThis game is the best but it takes time to get good at it it just a great game\n\nHelpful | 1", "OGGRANDETACOApr 14 at 12:04 PM\nAmazing!!\n\nOne of the most fun VR games I bought on oculus\n\nHelpful | 0"]