{"App Title": "Journey of the Gods - Demo", "App description": "The chaos moon is coming, threatening the peaceful inhabitants of the land. Its up to you to unlock the power of the gods in your battle against the encroaching darkness. Become the hero in this legendary VR quest against the forces of evil.\n\nBefore completing this epic journey you will:\n- Explore a wide and wondrous new world.\n- Engage in ranged and melee combat with the sinister celestial servants of the chaos moon.\n- Solve the mysteries of the ancients and gain the mystical power of the gods!\n\nWe are proud to support Cross-Buy - buy the game once and play it on Quest or Rift/Rift S!", "Purchase section": "FreeView Full VersionAdd to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade", "Languages": "English", "Version + Release Notes": "1.0.444989", "Developer": "Turtle Rock Studios", "Publisher": "Oculus Studios", "Website": "https://www.turtlerockstudios.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "STUDIO\nGAMES\nVR\nCAREERS\nCOMMUNITY\nNEWS\nSOCIAL\nTURTLE ROCK STUDIOS, INC. END USER LICENSE AGREEMENT\nLAST MODIFIED ON NOVEMBER 12, 2019\n\nPLEASE READ THIS AGREEMENT CAREFULLY; THIS IS A BINDING CONTRACT.\n\nThis End User License Agreement (this EULA) describes the terms and conditions between you and Turtle Rock Studios, Inc. and its affiliates (TRS, we, our, or us), and governs your use of any online service location or application that posts or provides you a link to the EULA, including, without limitation, the applications Face Your Fears, Face Your Fears II, Other Worlds, The Well and Journey of the Gods (each, the App), and all features, content and other services that we own, control, and make available through such online service locations and the App (collectively, the Service).\n\nYOUR USE OF THE SERVICE SIGNIFIES THAT YOU AGREE TO THIS EULA AND CONSTITUTES YOUR BINDING ACCEPTANCE OF THIS EULA, INCLUDING ANY MODIFICATIONS THAT TRS MAKES FROM TIME TO TIME.\n\n1.EULA Updates. We reserve the right, at any time in our sole discretion, to modify or replace any part of the EULA and will provide you with notice for any material changes to the EULA. If you object to any such changes, you agree that your sole recourse is to cease using the Service.\n\n2.Service Use.\n\n2.1Content. The Service contains: (i) materials and other items relating to TRS and its products and services, and similar items from our licensors and other third parties, including all layout, information, databases, articles, posts, text, data, files, images, scripts, designs, graphics, instructions, illustrations, photographs, sounds, pictures, videos, games, applications, advertising copy, URLs, technology, software, algorithms, interactive features, the look and feel of the Service, and the compilation, assembly, and arrangement of the materials of the Service and any and all copyrightable material; (ii) trademarks, logos, trade names, trade dress, service marks, and trade identities of various parties, including those of TRS (TRS Marks); and (iii) other forms of intellectual property (all of the foregoing, collectively Content). All right, title, and interest in and to the Service and the Content is the property of TRS or our licensors or certain other third parties, and is protected by U.S. and international copyright, trademark, trade dress, patent and/or other intellectual property and unfair competition rights and laws to the fullest extent possible. A list of credits and notices for third party components of the Content is set forth in Exhibit 1.\n\n2.2 Limited License. Unless stated in another written agreement between you and TRS, and subject to your strict compliance with the EULA, TRS grants you a limited, non-exclusive, revocable, non-assignable, personal, and non-transferable license to download, display, view, use, and play the Content on a personal computer, browser, laptop, tablet, mobile phone, or other internet-enabled device (each, a Device), in each case for your personal, non-commercial use only. The foregoing limited license (i) does not give you any ownership of, or any other intellectual property interest in, any Content, and (ii) may be suspended or terminated for any reason, with or without cause, in the sole discretion of TRS, and without advance notice or liability. Your unauthorized use of the Content may violate copyright, trademark, privacy, publicity, communications, and other laws, and any such use may result in your personal liability, including potential criminal liability. \n\n2.3 Availability. TRS may suspend or terminate the availability of the Service and Content, in whole or in part, to any individual user or all users, for any reason, in the sole discretion of TRS, and without advance notice or liability. Upon suspension or termination of your access to the Service, or upon notice from TRS, all rights granted to you under the EULA or any applicable Additional Terms will cease immediately, and you agree that you will immediately discontinue use of the Service and Content.\n\n2.4 Reservation of Rights. All rights not expressly granted to you are reserved by TRS and its licensors and other third parties. No right or license may be construed, under any legal theory, by implication, estoppel, industry custom, or otherwise. Any unauthorized use of the Content or Service for any purpose is prohibited.\n\n2.5 Virtual Reality Devices. You must have an Internet-enabled third party virtual reality headset device (a VR Device) that is compatible with the Service in order to access and use the Service. You are solely responsible for ensuring that your VR Device is compatible with the Service. The applicable third party provider of the VR Device, and not TRS, is solely responsible for any warranties, liabilities and all other matter relating to the VR Device.\n\n2.6 Health and Safety Warning. You understand and agree that the Service is designed for use on a virtual reality platform and that there are inherent risks of personal injury, discomfort, and/or property damage that may be associated with virtual reality platforms and the Service. To reduce these risks, it is important that you read, evaluate and follow all health and safety warnings, guidelines, and instructions with respect to the virtual reality platform that you are using. By using the Service, you represent and warrant that you have read and understand all such warnings, guidelines, and instructions. Be aware of your surroundings when using the Service. You may injure yourself or others if you do not properly clear the space in which you may use the Service. You are solely responsible for your use of the Service and assume all risks associated with your use of the Service and any activities related thereto. The Service may contain flashing lights, realistic images and simulations. Some people may experience side effects such as motion sickness, epileptic seizures, momentary loss of consciousness, dizziness, or nausea when viewing certain types of flashing lights or graphics that are included in the Service. This may happen where a person has not previously suffered in this way and has no known symptoms or history of these side effects. If you have a condition which makes this possible or you have experienced similar symptoms, please consult a doctor before using the Service. If you feel dizzy, tired, fatigued or uncomfortable when using the Service, please stop using the Service. If these symptoms continue after you have stopped using the Service, please consult a doctor. Nothing herein shall be construed as an admission or a waiver on behalf of TRS.\n\n3.Disclaimer of Representation and Warranties.\n\nTHE SERVICE IS PROVIDED TO YOU ON AN \"AS IS,\" \"AS AVAILABLE,\" AND \"WITH ALL FAULTS\" BASIS. NEITHER TRS NOR ANY OF ITS OFFICERS, DIRECTORS, MANAGERS, EMPLOYEES OR AGENTS (COLLECTIVELY, THE \"TRS PARTIES\") MAKE ANY REPRESENTATIONS, WARRANTIES OR ENDORSEMENTS OF ANY KIND WHATSOEVER AS TO THE CONTENT OR OTHER SERVICES, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, OR ARISING FROM COURSE OF DEALING, COURSE OF PERFORMANCE OR USAGE OF TRADE, INCLUDING, TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE IMPLIED WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT AND FREEDOM FROM COMPUTER VIRUS. BY ACCESSING OR USING THE SERVICE YOU REPRESENT AND WARRANT THAT YOUR ACTIVITIES ARE LAWFUL IN EVERY JURISDICTION WHERE YOU ACCESS OR USE THE SERVICE.\n\nNOTWITHSTANDING THE FOREGOING, AND TO THE MAXIMUM EXTENT PERMITTED BY LAW, THESE DISCLAIMERS DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n4. Limitations of Our Liability.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL THE TRS PARTIES BE LIABLE TO YOU FOR ANY LOSS, DAMAGE OR INJURY OF ANY KIND INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, CONSEQUENTIAL OR PUNITIVE LOSSES OR DAMAGES, OR DAMAGES FOR SYSTEM FAILURE OR MALFUNCTION OR LOSS OF PROFITS, DATA, USE, BUSINESS OR GOOD-WILL, ARISING OUT OF OR IN CONNECTION WITH (A) THE SERVICE, (B) THE EULA OR (C) YOUR MISUSE OF THE SERVICE OR ANY CONTENT AVAILABLE ON OR THROUGH THE SERVICE, INCLUDING, WITHOUT LIMITATION, THE TRS MARKS. THE LIMITATIONS SET FORTH IN THIS SECTION SHALL APPLY REGARDLESS OF THE FORM OF ACTION, WHETHER THE ASSERTED LIABILITY OR DAMAGES ARE BASED ON CONTRACT, INDEMNIFICATION, TORT, STRICT LIABILITY, STATUTE OR ANY OTHER LEGAL OR EQUITABLE THEORY.\n\nNOTWITHSTANDING THE FOREGOING, THESE DISCLAIMERS HEREIN DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n5. Indemnification.\n\nYou agree to defend, indemnify and hold harmless the TRS Parties from and against any and all claims, liabilities, damages, losses, costs and expenses (including, reasonable attorneys fees and costs) arising out of or in connection with any of the following: (i) your breach or alleged breach of the EULA; (ii) your misuse of the Service or Content; (iii) your violation of any laws, rules, regulations, codes, statutes, ordinances or orders of any governmental or quasi-governmental authorities; (iv) your violation of the rights of any third party, including any intellectual property right, publicity, confidentiality, property or privacy right; or (vi) any misrepresentation made by you. TRS reserves the right to assume, at your expense, the exclusive defense and control of any matter subject to indemnification by you. You agree to cooperate with the defense by TRS of any claim. You will not in any event settle any claim without the prior written consent of TRS.\n\nThis provision does not require you to indemnify us for any unconscionable commercial practice by us or for our fraud, deception, false promise, misrepresentation or concealment, suppression or omission of any material fact in connection with the Service.\n\n6.Restrictions and Conditions of Use.\n\n6.1.Use of Service. TRS permits you to view and use a single copy of the Service for your personal, non-commercial use. You agree not to license, create derivative works from, transfer, sell or re-sell any information, Content, or services obtained from the Service.\n\n6.2.No Violation of Laws. You agree that you will not violate any applicable law or regulation in connection with your use of the Content or Service. The Service is operated by TRS in the United States. Those who choose to access the Service from locations outside the United States do so on their own initiative and are responsible for compliance with applicable local laws.\n\n6.3.No Commercial Uses. You agree that you will not use the Content or Service for any commercial purpose or the benefit of any third party or charge any person, or receive any compensation for, the use of the Content or Service.\n\n7.Children. The Service is not directed toward children under 13 years of age nor does TRS knowingly collect information from children under 13. If you are under 13, please do not submit any personally identifiable information to TRS.\n\n8.Agreement to Arbitrate Disputes and Choice of Law.\n\nPLEASE READ THIS SECTION CAREFULLY  IT MAY SIGNIFICANTLY AFFECT YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO FILE A LAWSUIT IN COURT AND TO HAVE A JURY HEAR YOUR CLAIMS. IT CONTAINS PROCEDURES FOR MANDATORY BINDING ARBITRATION AND A CLASS ACTION WAIVER.\n\n8.1 We Both Agree to Arbitrate. You and TRS agree to resolve any claims relating to the EULA through final and binding arbitration, except to the extent you have in any manner violated or threatened to violate TRS intellectual property rights (for example, trademark, trade secret, copyright, or patent rights). Under such circumstances TRS may bring a lawsuit solely for injunctive relief to stop unauthorized use or abuse of the Service, or intellectual property infringement (for example, trademark, trade secret, copyright, or patent rights) without first engaging in arbitration or the informal dispute-resolution process described herein.\n\n8.2 What is Arbitration. Arbitration is more informal than a lawsuit in court and seeks to resolve disputes more quickly. Instead of a judge or a jury, the case will be decided by a neutral arbitrator who has the power to award the same damages and relief that a court can. If any provision of this arbitration agreement is found unenforceable, the unenforceable provision shall be severed, and the remaining arbitration terms shall be enforced.\n\n8.3 Arbitration Procedures. The Federal Arbitration Act governs the interpretation and enforcement of this dispute resolution provision. Arbitration shall be initiated through JAMS. Any dispute, controversy, or claim arising out of or relating to the EULA, except as otherwise provided herein, shall be referred to and finally determined by arbitration in accordance with the JAMS Streamlined Arbitration Rules and Procedures in front of one arbitrator. If there is a conflict between JAMS Rules and the rules set forth in the EULA, the rules set forth in the EULA will govern. The JAMS Rules and instructions for how to initiate an arbitration are available from JAMS at www.jamsadr.com or 1-800-352-5267. To initiate arbitration, you or TRS must do the following things:\n\n(1)  Write a demand for Arbitration. The demand must include a description of the claim and the amount of damages sought to be recovered. You can find a copy of a demand for arbitration at www.jamsadr.com.\n\n(2)  Send three copies of the demand for arbitration, plus the appropriate filing fee to your local JAMS office or to JAMS, 5 Park Plaza, Suite 400, Irvine, CA 92614.\n\n(3)  Send one copy of the demand for arbitration to the other party.\n\nPayment of all filing, administration and arbitrator fees will be governed by the JAMS Rules. If travelling to Orange County, California, is a burden, you may participate in the arbitration by phone or via document submission to the fullest extent allowable by the arbitrator. Each party will bear their own costs of arbitration unless the arbitrator directs that bearing such costs would be an undue burden and in that case, we will pay for your portion of the arbitration administrative costs (but not your attorneys fees). Arbitration under this agreement shall be held in the United States in Orange County, California under California law without regard to its conflict of laws provisions. The arbitration may award on an individual basis the same damages and relief as a court (including injunctive relief). Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction.\n\n8.4 Authority of Arbitrator. The arbitrator will decide the rights and liabilities, if any, of you and TRS, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim. The arbitrator shall have the authority to award monetary damages and to grant any non-monetary remedy or relief available to an individual under applicable law, the Arbitration Rules, and the EULA. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and TRS.\n\n8.5 Waiver of Class Actions. You waive any right to pursue an action on a class-wide basis against us and may only resolve disputes with us on an individual basis, and may not bring a claim against us as a plaintiff or a class member in a class, consolidated, or representative action. Class arbitrations, class actions, private attorney general actions, and consolidation with other arbitrations are not allowed.\n\n8.6 Waiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in court and are subject to very limited review by a court. In the event any litigation should arise between you and TRS in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND TRS WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge. YOU ACKNOWLEDGE THAT YOU HAVE BEEN ADVISED THAT YOU MAY CONSULT WITH AN ATTORNEY IN DECIDING TO ACCEPT THIS AGREEMENT TO ARBITRATE.\n\n8.7 Choice of Law/Forum Selection. In any circumstances where the Agreement to Arbitrate Disputes permits the parties to litigate in court, the EULA shall be governed by and construed in accordance with the laws of the State of California, excluding its conflict of law rules. You further expressly consent and agree to submit to the exclusive jurisdiction and venue of a court of competent jurisdiction located in Orange County, California.\n\n9. Waiver of Injunctive or other Equitable Relief.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, YOU AGREE THAT YOU WILL NOT BE PERMITTED TO OBTAIN AN INJUNCTION OR OTHER EQUITABLE RELIEF OF ANY KIND, SUCH AS ANY COURT OR OTHER ACTION THAT MAY INTERFERE WITH OR PREVENT THE DEVELOPMENT OR EXPLOITATION OF ANY WEBSITE, APPLICATION, CONTENT, SUBMISSIONS, PRODUCT, SERVICE, OR INTELLECTUAL PROPERTY OWNED, LICENSED, USED OR CONTROLLED BY TRS OR A LICENSOR OF TRS.\n\n10.General.\n\n10.1.No Partnership. You agree that no joint venture, partnership, employment, or agency relationship exists between you and TRS as a result of this EULA or your use of the Service.\n\n10.2.Assignment. TRS may assign this EULA, in whole or in part, to any person or entity at any time with or without your consent. You may not assign the EULA without TRS prior written consent, and any unauthorized assignment by you shall be null and void.\n\n10.3.Severability. If any part of this EULA is determined to be invalid or unenforceable, then that portion shall be severed, and the remainder of the EULA shall be given full force and effect.\n\n10.4.No Waiver. Our failure to enforce any provision of this EULA shall in no way be construed to be a present or future waiver of such provision, nor in any way affect the right of any party to enforce each and every such provision thereafter. The express waiver by us of any provision, condition or requirement of this EULA shall not constitute a waiver of any future obligation to comply with such provision, condition or requirement.\n\n10.5.Notices. All notices given by you or required under this EULA shall be in writing and addressed to: Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491 Lake Forest, CA 92630 ATTN: President.\n\n10.6. Email Communication. When you communicate with us electronically, you consent to receive communications from us electronically.\n\n10.7. Survival. The provisions of this EULA and any applicable Additional Terms, which by their nature should survive termination of your use of the Service, including sections on Service Use (except for the limited license), Submissions, Copyright Infringement, Third Party Services, Agreement to Arbitrate Disputes and Choice of Law, Disclaimer of Representations and Warranties, Limitations of Our Liability, Indemnification, Waiver of Injunctive or Other Equitable Relief, and General Provisions, will survive.\n\n10.8.Entire Agreement. This EULA, including the documents expressly incorporated by reference, constitutes the entire agreement between you and us with respect to the Service and supersedes all prior or contemporaneous communications, whether electronic, oral or written, between you and us with respect to the Service.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ AND UNDERSTAND THE FOREGOING TERMS OF USE AGREEMENT AND AGREE THAT MY USE OF THE APP IS AN ACKNOWLEDGMENT OF MY AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS TERMS OF USE AGREEMENT.\n\n\n\n\nEXHIBIT 1\nTHIRD PARTY COMPONENTS OF CONTENT\n\nUnreal Engine 4\n\nUnreal Engine Copyright 1998-2019, Epic Games, Inc. All rights reserved. Unreal is a trademark or registered trademark of Epic Games, Inc. in the United States of America and elsewhere.\n\nWwise\n\nPowered by Wwise  2006  2019 Audiokinetic Inc. All rights reserved.\n\nKhronos Group Inc.\n\nCopyright (c) 2007-2018 The Khronos Group Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and /or associated documentation files (the \"Materials \"), to deal in the Materials without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Materials, and to permit persons to whom the Materials are furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Materials.\n\nTHE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE MATERIALS OR THE USE OR OTHER DEALINGS IN THE MATERIALS.\n\nMesa3D\n\nCopyright (C) 1999-2007 Brian Paul  All Rights Reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS >OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nAndroid Open Source Project\n\nCopyright (C) 2008 The Android Open Source Project\n\nLicensed under the Apache License, Version 2.0\n\nZLib\n\nCopyright (C) 1995-2017 Jean-loup Gailly and Mark Adler\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nICU\n\nCopyright  1991-2019 Unicode, Inc. All rights reserved.\n\nDistributed under the Terms of Use in https://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Unicode data files and any associated documentation (the \"Data Files\") or Unicode software and any associated documentation (the \"Software\") to deal in the Data Files or Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, and/or sell copies of the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that either\n\n(a) this copyright and permission notice appear with all copies of the Data Files or Software, or\n\n(b) this copyright and permission notice appear in associated Documentation.\n\nFreetype\n\nThis software is based in part of the work of the FreeType Team: https://www.freetype.org/\n\nHarfBuzz\n\nCopyright  2010,2011,2012,2013,2014,2015,2016,2017,2018,2019 Google, Inc.\n\nCopyright  2019 Facebook, Inc.\n\nCopyright  2012 Mozilla Foundation\n\nCopyright  2011 Codethink Limited\n\nCopyright  2008,2010 Nokia Corporation and/or its subsidiary(-ies)\n\nCopyright  2009 Keith Stribley\n\nCopyright  2009 Martin Hosken and SIL International\n\nCopyright  2007 Chris Wilson\n\nCopyright  2006 Behdad Esfahbod\n\nCopyright  2005 David Turner\n\nCopyright  2004,2007,2008,2009,2010 Red Hat, Inc.\n\nCopyright  1998-2004 David Turner and Werner Lemberg\n\n\n\n\nFor full copyright notices consult the individual files in the package.\n\n\n\n\nPermission is hereby granted, without written agreement and without license or royalty fees, to use, copy, modify, and distribute this software and its documentation for any purpose, provided that the above copyright notice and the following two paragraphs appear in all copies of this software.\n\nIN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFTWARE PROVIDED HEREUNDER IS ON AN \"AS IS\" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.\n\nVorbis\n\nCopyright (c) 2002-2018 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nCopyright 2001-2011 Xiph.Org, Skype Limited, Octasic,\n\n          Jean-Marc Valin, Timothy B. Terriberry,\n\n          CSIRO, Gregory Maxwell, Mark Borgerding,\n\n          Erik de Castro Lopo\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nPNG Reference Library\n\n* Copyright (c) 1995-2019 The PNG Reference Library Authors.\n\n* Copyright (c) 2018-2019 Cosmin Truta.\n\n* Copyright (c) 2000-2002, 2004, 2006-2018 Glenn Randers-Pehrson.\n\n* Copyright (c) 1996-1997 Andreas Dilger.\n\n* Copyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.\n\nThe software is supplied \"as is\", without warranty of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose, title, and non-infringement. In no event shall the Copyright owners, or anyone distributing the software, be liable for any damages or other liability, whether in contract, tort or otherwise, arising from, out of, or in connection with the software, or the use or other dealings in the software, even if advised of the possibility of such damage.\n\nPermission is hereby granted to use, copy, modify, and distribute this software, or portions hereof, for any purpose, without fee, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated, but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This Copyright notice may not be removed or altered from any source or altered source distribution.\n\nCurl\n\nCopyright (c) 1996 - 2019, Daniel Stenberg, daniel@haxx.se, and many contributors, see the THANKS file.\n\nAll rights reserved.\n\nPermission to use, copy, modify, and distribute this software for any purpose with or without fee is hereby granted, provided that the above copyright notice and this permission notice appear in all copies.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Software without prior written authorization of the copyright holder.\n\nIntel(R) Metrics Discovery Application Programming Interface\n\nCopyright (c) 2019, Intel Corporation\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nOpenSSL\n\nCopyright (c) 1998-2019 The OpenSSL Project. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit. (http://www.openssl.org/)\"\n\n4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to endorse or promote products derived from this software without prior written permission. For written permission, please contact openssl-core@openssl.org.\n\n5. Products derived from this software may not be called \"OpenSSL\" nor may \"OpenSSL\" appear in their names without prior written permission of the OpenSSL Project.\n\n6. Redistributions of any form whatsoever must retain the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (http://www.openssl.org/)\"\n\nTHIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n====================================================================\n\nThis product includes cryptographic software written by Eric Young(eay@cryptsoft.com). This product includes software written by Tim Hudson (tjh@cryptsoft.com).\n\nSSLeay\n\nCopyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)\n\nAll rights reserved.\n\nThis package is an SSL implementation written by Eric Young (eay@cryptsoft.com).\n\nThe implementation was written so as to conform with Netscapes SSL.\n\nThis library is free for commercial and non-commercial use as long as the following conditions are aheared to. The following conditions apply to all code found in this distribution, be it the RC4, RSA, lhash, DES, etc., code; not just the SSL code. The SSL documentation included with this distribution is covered by the same copyright terms except that the holder is Tim Hudson (tjh@cryptsoft.com).\n\nCopyright remains Eric Young's, and as such any Copyright notices in the code are not to be removed.\n\nIf this package is used in a product, Eric Young should be given attribution as the author of the parts of the library used.\n\nThis can be in the form of a textual message at program startup or in documentation (online or textual) provided with the package.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgement:\n\n \"This product includes cryptographic software written By Eric Young (eay@cryptsoft.com)\"\n\n The word 'cryptographic' can be left out if the rouines from the library being used are not cryptographic related :-).\n\n4. If you include any Windows specific code (or a derivative thereof) form  the apps directory (application code) you must include an acknowledgement:\n\n \"This product includes software written by Tim Hudson (tjh@cryptsoft.com)\"\n\nTHIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nOpenSubdiv\n\nCopyright 2013 Pixar\n\nLicensed under the Apache License, Version 2.0 (the \"Apache License\") with the following modification; you may not use this file except in compliance with the Apache License and the following modification to it:\n\nSection 6. Trademarks. is deleted and replaced with:\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor and its affiliates, except as required to comply with Section 4(c) of the License and to reproduce the content of the NOTICE file.\n\nYou may obtain a copy of the Apache License at\n\n  http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software distributed under the Apache License with the above modification is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the Apache License for the specific language governing permissions and limitations under the Apache License.\n\nLibtiff\n\nCopyright (c) 1988-1997 Sam Leffler\n\nCopyright (c) 1991-1997 Silicon Graphics, Inc.\n\nPermission to use, copy, modify, distribute, and sell this software and its documentation for any purpose is hereby granted without fee, provided that (i) the above copyright notices and this permission notice appear in all copies of the software and related documentation, and (ii) the names of Sam Leffler and Silicon Graphics may not be used in any advertising or publicity relating to the software without the specific, prior written permission of Sam Leffler and Silicon Graphics.\n\nTHE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nOpenEXR\n\nCopyright (c) 2006-2019 OpenEXR a Series of LF Projects, LLC. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nAMD\n\nCopyright (c) 2016 Advanced Micro Devices, Inc. All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nVorbis Quality Improvements\n\naoTuV - Copyright (c) 2003-2008 Aoyumi\n\nlibvorbis - Copyright (c) 2002-2008 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLibwebsockets\n\nCopyright (C) 2010 - 2019 Andy Green <andy@warmcat.com>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nMikktspace\n\nCopyright (C) 2011 by Morten S. Mikkelsen\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nCopyright  2020 Turtle Rock Studios. All Rights Reserved. Privacy Policy | Terms of Use", "Space Required": "451.6 MB"}



["5 stars\n42%\n4 stars\n17%\n3 stars\n0%\n2 stars\n25%\n1 star\n17%", "pineapplesquadFeb 23 at 7:22 AM\nBeautiful game, looks fun\n\nLove the graphics and it seems like it would be really fun, but 5 minutes into the demo the motion sickness was way too much for me. I tried adjusting my headset and a different mode but it was still too intense. Otherwise I'd love to play it\n\nHelpful | 1", "steve-01351Sep 27, 2019 at 5:52 PM\nI'd probably buy it but\n\nBut, as with other Oculus games, I get totally lost and there never seems to be an easily accessible settings or help menu. I bumbled through in Journey until I got told to switch into my God [something] and had absolutely no clue how to do it. None of the controls on either controller did much of anything, so after a few minutes I got frustrated and just quit. That seems to be a pretty common thing with these games. I never know what control does what and there's no easy way (that I can find) to find out, so I get frustrated and quit. Seems a shame, but the Quest is really just a movie viewer for me the vast vast majority of the time.\n\nHelpful | 3", "natka.pskaJun 18, 2019 at 8:24 AM\n\nit looks really beautiful and the idea is nice too but there should be teleportation mode, it causea too much motion sickness and unfortunately I wasn't able to play it.\n\nHelpful | 4", "YHXJun 4, 2019 at 3:50 PM\nSold!\n\nWithout that demo I would probably not have bought the game Now I think I would have missed something great!\nA word to the wise: any studio making good stuff could benefit from publishing demos...\n\nHelpful | 4", "TsuyoiRaionMay 26, 2019 at 10:27 PM\nFun and creative\n\nThis is a really fun and creative demo that definitely makes you want more! Offering creative yet familiar gameplay and easy to understand instructions.\n\nI almost fell over one time by moving and rotating too fast :P but cool thing is you can adjust those settings to make things as comfortable for you as you'd like them, among other vr options.\n\nDefinitely worth playing through and checking out the full version!\n\nHelpful | 1"]