{"App Title": "Journey of the Gods", "App description": "The chaos moon is coming, threatening the peaceful inhabitants of the land. Its up to you to unlock the power of the gods in your battle against the encroaching darkness.\n\nBecome the hero in this first-person, legendary VR quest against the forces of evil.\nBefore completing this epic journey you will:\n\n- Explore a wide and wondrous new world.\n- Engage in ranged and melee combat with the sinister celestial servants of the chaos moon.\n- Solve the mysteries of the ancients and gain the mystical power of the gods!\n\nWe are proud to support Cross-Buy - buy the game once and play it on Quest or Rift/Rift S!\n\nFor sensitive players or those new to VR, make sure to check out the pause menu movement options. You can walk around in that area and experiment to find the most comfortable configuration!", "Purchase section": "$29.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Puzzle, RPG", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Argentina)", "Version + Release Notes": "1.0.479431", "Developer": "Turtle Rock Studios", "Publisher": "Oculus Studios", "Website": "https://www.turtlerockstudios.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "STUDIO\nGAMES\nVR\nCAREERS\nCOMMUNITY\nNEWS\nSOCIAL\nPRIVACY POLICY\nTURTLE ROCK STUDIOS, INC. PRIVACY POLICY\n\nEffective May 18, 2017\n\nINTRODUCTION\n\nThis Privacy Policy describes how Turtle Rock Studios, Inc. (\"TRS,\" \"we,\" \"us\" or \"our\") collects, uses, and shares information about you and applies to your use of any online service location that posts a link to this Privacy Policy and all features, content, and other services that we own, control and make available through such online service location (collectively, the \"Services\"). It also details the rights and choices you have regarding the use and disclosure of information about you collected through the Services.\n\nBy using the Services, you agree to our Terms of Use and consent to TRSs collection, use, storage, deletion, transfer to the United States, and disclosure of information relating to you as set forth in this Privacy Policy. For information on our compliance with the Privacy Shield Framework, please see \"Privacy Shield and International Transfer\" below. This Privacy Policy is effective as of the date set forth above and is only applicable to the Services and not to any other websites or online service locations that you may be able to access from the Services which may have their own data collection and use practices and policies.\n\nTYPES OF INFORMATION WE COLLECT\n\nInformation You Provide\n\nWe and our Service Providers (defined below) may collect information you provide directly via the Services. For example, we collect information when you create an account on the Services; subscribe to our newsletter; participate in Services feedback, questionnaires, surveys, contests, sweepstakes, or other promotions; receive customer or technical support; play our games, or otherwise communicate or transact with us through the Services.\n\nThe information we collect may include personal information. \"Personal information\" means information that can be used to identify you personally (whether alone or in combination), such as your first and last name, email address, phone number, postal address, and payment card information.\n\nIf you do not disclose certain personal information to us, you may not be able to access certain aspects of the Services. For example, to create an account, we will require you to provide certain information, including your email address, user name, and password. If you sign up to the Services through a Third Party Service (defined below) such as Facebook, Twitter or Google Plus, we may also collect personal information during the sign-up process. For information on our relationship with social media platforms, please see \"Social Media Features\" below.\n\nYou may choose to voluntarily submit certain other information to us through the Services, including personal information, but you are solely responsible for your own personal information in instances where we have not requested that you submit such information to us.\n\nPersonal information once \"de-identified\" is not subject to this Privacy Policy and we and our Service Providers may treat it as non-personal information and use it without obligation to you except as prohibited by applicable law.\n\nInformation We Collect Automatically\n\nIn addition to any personal information or other information that you choose to submit to us via the Services, we and our Service Providers may use a variety of technologies that automatically store or collect certain information whenever you visit or interact with the Services (\"Usage Information\"). Usage Information may include IP address, device identifier, browser type, operating system, domain names, access times, and other information about your use of the Services. This Usage Information may be stored or accessed using a variety of technologies that may be downloaded to your personal computer, browser, laptop, tablet, mobile phone or other device (a \"Device\") whenever you visit or interact with the Services. To the extent we associate Usage Information with your personal information we collect directly from you on the Services, we will treat the combined information as personal information.\n\nThe methods that may be used on the Services to collect Usage Information include:\n\nLog FilesLog files may record and store your Usage Information.\n\nInformation Collected by Tracking Technologies: Cookies, web beacons, tracking pixels, embedded scripts, location-identifying technologies, device fingerprinting, in-app tracking methods, and other tracking technologies now and hereafter developed (\"Tracking Technologies\") may be used to collect information about your interactions with the Services or emails, including information about your browsing and activity behavior.\n\nCookies\n\nCookies are small bits of electronic information that a website sends to a visitors browser and are stored on the visitors device. Like many websites, we employ cookies in certain areas of the Services to allow us to provide information to make your online experience more convenient and to enhance your experience with the Services. For example, when you return to the Services after logging in, cookies provide information so that the Services will remember who you are on subsequent visits, speeding up or enhancing your experience of the Services by, for instance, tailoring content to you. A user may configure his or her web browsers to accept or reject or delete the cookies, or notify the user when a cookie is being set, as further discussed in \"Your Rights and Choices\" below.\n\nWeb Beacons\n\nWe employ third party tracking utility software technology called web beacons or clear gifs, that help us better manage content on our Services by informing us what content is effective. Clear gifs are tiny graphics with a unique identifier, similar in function to cookies, and are used to track the online movements of users. In contrast to cookies, which are stored on a users device, clear gifs are embedded invisibly on web pages and are about the size of the period at the end of this sentence. In short, clear gifs enable two websites to share information with one another.\n\nTracking Pixel\n\nA tracking \"pixel\" is a transparent graphic image (usually 1 pixel x 1 pixel) that is placed on a web page and allows for the collection of information regarding the use of the web page that contains the tracking pixel.\n\nLocation-identifying Technologies\n\nGPS (global positioning systems) software, geo-filtering, and other location-aware technologies locate (sometimes precisely) you for purposes such as verifying your location and delivering or restricting relevant content based on your location.\n\nDevice Fingerprinting\n\nDevice fingerprinting is the process of analyzing and combining sets of information elements from your devices browser, such as JavaScript objects and installed fonts, in order to create a \"fingerprint\" of your device and uniquely identify your device and applications.\n\nIn-App Tracking Methods\n\nThere are a variety of tracking technologies that may be included in mobile apps and games, and these are not browser-based like cookies and cannot be controlled by browser settings. Some use device identifier, or other identifiers such as \"Ad IDs\" to associate app user activity to a particular app/game and to track user activity across apps/games.\n\nTracking Technologies Usage. We may use Tracking Technologies for a variety of purposes, including:\n\n- Strictly Necessary. We may use Tracking Technologies that we consider are strictly necessary to allow you to use and access the Services, including cookies required to prevent fraudulent activity, improve security or allow you to make use of shopping cart functionality.\n\n- Performance-Related. We may use Tracking Technologies that are useful in order to assess the performance of the Services, including as part of our analytic practices or otherwise to improve the content, products or services offered through the Services.\n\n- Functionality-Related. We may use cookies or other tracking technologies that are required to offer you enhanced functionality when accessing the Services, including identifying you when you sign in to the Services or keeping track of our specified preferences, including in terms of the presentation of content on the Services.\n\nSome information about your use of the Services and certain Third Party Services may be collected using Tracking Technologies across time and services and used by us and third parties for purposes such as to associate different devices you use, and deliver relevant ads and/or other content to you on the Services and certain Third Party Services.\n\nFor further information on Tracking Technologies and your choices regarding them, please see \"Analytics and Advertising\" and \"Your Rights and Choices\" below.\n\nInformation from Other Sources\n\nWe may obtain information about you from other sources, including Service Providers and Third Party Services, and combine such information with information we have collected about you. To the extent we combine such third party sourced information with personal information we have collected about you on the Services, we will treat the combined information as personal information under this Privacy Policy. We are not responsible for the accuracy of any information provided by third parties or third party policies or practices.\n\nHOW WE USE YOUR PERSONAL INFORMATION\n\nWe may use your information, including personal information:\n\nTo manage our Services;\nto process your registration with the Services, including verifying your information is active and valid, and to allow you to log in to the Services;\nto send messages to you in response to your request to perform an activity in connection with your use of the Services, and to contact you regarding any customer or technical support issues;\nto contact you with regard to your use of the Services and, in our discretion, changes to the Services and/or any of the Services policies, or when necessary;\nto prevent and address fraud, breach of policies or terms, and threats or harm;\nto monitor and analyse trends, usage, and activities;\nto conduct research, including focus groups and surveys;\nto improve the Services or create new service offerings, to customize your experience on the Services, or to serve you specific content that is relevant to you;\nto send you commercial or marketing messages including, newsletters, promotions, updates, special offers, and email communications about our products or services (for information about how to manage these communications and marketing efforts, please see \"Your Rights and Choices\" below);\nfor internal business purposes; and\nfor purposes disclosed at the time you provide your information or as otherwise set forth in or as permitted by this Privacy Policy.\n\nUse of Information for Recruitment Purposes: Where you have provided us with personal information as part of an online application for employment or internship, we may use that information in order to allow us to make an informed decision about whether to proceed with your application. We may, as part of this recruitment process, collect information about your education, employment history and similar matters. Where this personal information is considered to be sensitive, you expressly consent to our processing of this information for recruitment purposes by submitting it to us.\n\nHOW WE SHARE YOUR PERSONAL INFORMATION\n\nWe may share the information about you, including personal information, under the following circumstances:\n\nService Providers. We may share your information with our agents, vendors, consultants, or other service providers (\"Service Providers\") that we engage for the purpose of fulfilling product orders, processing information on our and your behalf, operating or hosting the Services, or providing services related to the online components of our games. For example, we may engage Service Providers to process payments for the Services. Additionally, we may engage Service Providers to process consumer surveys, fulfill prizes, or to process, analyze, and/or store data, including, but not limited to, analytical data. While providing services for us, these companies may access your personal information. These Service Providers are prohibited from using your personal information other than to provide this assistance and are required to maintain appropriate confidentiality and security measures.\n\nPartners. We may provide your information, including personal information, to our publishing partners and their affiliates in connection with the online components of our apps and games.\n\nProtection of Rights. We must disclose your personal information in response to lawful requests by public authorities, including to meet national security or law enforcement requirements. We may also share your information, including personal information, if we have a good faith belief that (i) access, use, preservation or disclosure of such information is reasonably necessary to satisfy any applicable law, regulation, legal process, such as a court order or subpoena, or a request by law enforcement or governmental authorities, (ii) such action is necessary to detect, prevent, or otherwise address fraud, security or technical issues associated with the Services or violations of our Terms of Use, or (iii) such action is appropriate to protect the rights, property or safety of TRS, its employees, clients, or users of the Services or others.\n\nAsset transfers. If we become involved in a merger, acquisition, bankruptcy or other transaction involving the sale of some or all of TRSs assets or a line of business, user information, including personal information collected from you through your use of the Services, could be included in the discussions and transferred assets. Should such an event occur, TRS will use reasonable means to notify you through a prominent notice on the Services after the deal is complete.\n\nInternal Business Purposes. We may share your information, including personal information, with our affiliates for internal business purposes.\n\nDirect Marketing Purposes. We may share your information, including personal information, with our affiliates, business partners, and other third parties for their own business purposes, including direct marketing purposes (for further information regarding your rights, see \"Your California Privacy Rights\" and \"Your European Privacy Rights\" below).\n\nConsent and Pursuant to this Privacy Policy. We may share your information, including personal information, with third parties with your consent or for any purposes consistent with our statements under this Privacy Policy or as permitted by applicable law.\n\nWithout limiting the foregoing, in our sole discretion, we may share aggregated information which does not identify you or de-identified information about you with third parties or affiliates for any purpose.\n\nSWEEPSTAKES, CONTESTS, PROMOTIONS\n\nWe may offer sweepstakes, contests, surveys, and other promotions (each, a \"Promotion\") jointly sponsored or offered by third parties that may require submitting personal information. If you voluntarily choose to enter a Promotion, your personal information may be disclosed to third parties for administrative purposes and as required by law (e.g., on a winners list). By entering, you agree to the official rules that govern that Promotion, and may, except where prohibited by applicable law, allow the sponsor and/or other parties to use your name, voice and/or likeness in advertising or marketing materials.\n\nPUBLIC INFORMATION\n\nThe Services may permit you to submit ideas, photographs, user profiles, writings, music, video, audio recordings, computer graphics, pictures, data, questions, comments, suggestions or other content (collectively, \"User Content\"), such as on blogs and message boards. We or others may store, display, reproduce, publish, distribute or otherwise use User Content online or offline in any media or format (currently existing or hereafter developed) and may or may not attribute it to you. Others may have access to this User Content and may have the ability to share it with third parties. Please think carefully before deciding what information you share, including personal information, in connection with your User Content. Please note that TRS does not control who will have access to the information that you choose to make public, and cannot ensure that parties who have access to such publicly available information will respect your privacy or keep it secure. We are not responsible for the privacy or security of any information that you make publicly available on the Services or what others do with information you share with them on the Services. California residents have additional rights set forth in \"Your California Privacy Rights\" below.\n\nADDITIONAL INFORMATION YOU SHOULD KNOW ABOUT THIRD PARTIES\n\nThis Privacy Policy does not cover the information practices of third party websites, locations, platforms, and services linked to the Services and/or technologies embedded in the Services (\"Third Party Services\").\n\nAdditionally, when you click on a third party logo or URL displayed on our Services which links you to a Third Party Service, our Privacy Policy no longer applies and you must read the privacy policy of the Third Party Service to see how your personal information will be handled on their service. If you cannot find their privacy policy, then you should contact the respective webmasters of those websites to obtain information regarding their information collection, use and disclosure policies. We are not responsible for their collection and use of your personal information.\n\nTo the extent we combine information we receive from third parties with personal information we collect directly from you on the Services, we will treat the combined information as personal information under this Privacy Policy.\n\nSOCIAL MEDIA FEATURES\n\nOur Services may interface with Facebook, Twitter, Google Plus and other Third Party Services. If you choose to log in to your account on the Services through those Third Party Services, then TRS may access your information on those Third Party Services and import, use, and share your \"friends\" list or contacts from those Third Party Services. If you choose to \"like\" or share information through those Third Party Services, you should review the privacy policy of those Third Party Services. In addition, we may provide Third Party Service interfaces or links on our Services to facilitate your sending a communication from our Services through the Third Party Services. When you use Third Party Services, you are using their services and not our services and they, and not we, are responsible for their practices. You should review the applicable Third Party Services privacy policies before using such Third Party Service tools on Services.\n\nANALYTICS AND ADVERTISING\n\nThird parties may use Tracking Technologies in connection with the Services. For example, analytics services may use Tracking Technologies on our Services to help us analyze your use of the Services, compile statistic reports on the Services activity, and provide other services relating to Services activity and Internet usage. Similarly, ad serving services, advertisers, and other third parties may use Tracking Technologies on our Services and Third Party Services to track your activities across time and services, and tailor ads to you based on your activities, which may include sending you an ad on a Third Party Service or third party device after you have left the Services (\"Interest-based Advertising\"). We may not control those Tracking Technologies and we are not responsible for them.\n\nPlease click on the links below to learn more about some of these third parties and their privacy policies:\n\nGoogle Analytics: https://www.google.com/policies/privacy/\n\nSumoMe: https://help.sumome.com/customer/portal/articles/1963436-privacy-policy\n\nFor further information on Tracking Technologies and your choices regarding them, please see \"Information We Collect Automatically\" above and \"Your Rights and Choices\" below.\n\nYOUR RIGHTS AND CHOICES\n\nAccessing, Reviewing, Correcting and Deleting Your Data\n\nYou have the right to access the personal information that you have voluntarily provided to us through the Services, and to review, correct, or delete it. To access, review or correct your information, please send an email to: privacy@turtlerockstudios.com or write to Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630; Attn: Legal Department. To delete your account, please send an email to: delete-account@turtlerockstudios.com. We will make good faith efforts to make requested changes in our then active databases as soon as reasonably practicable (but we may retain prior information as business records). In some cases, we may not be able to delete your personal information, and will retain and use your information as necessary to comply with our legal obligations, resolve disputes, and enforce our agreements.\n\nTracking Technologies Generally\n\nRegular cookies may generally be disabled or removed by tools available as part of most commercial browsers, and in some instances blocked in the future by selecting certain settings. Browsers offer different functionalities and options so you may need to set them separately. With respect to our apps, you can stop all collection of information via the app by uninstalling the app. Also, you may be able to exercise specific privacy choices, such as enabling or disabling certain location-based services, by adjusting the permissions in your mobile device.\n\nPlease be aware that if you disable or remove these technologies some parts of the Services may not work and that when you revisit the Services your ability to limit browser-based Tracking Technologies is subject to your browser settings and limitations.\n\nYour browser settings may allow you to automatically transmit a \"Do Not Track\" signal to online services you visit. Note, however, there is no industry consensus as to what website and app operators should do with regard to these signals. Accordingly, we do not monitor or take any action with respect to these \"Do Not Track\" signals or other mechanisms. For more information on \"Do Not Track,\" visit http://www.allaboutdnt.com.\n\nAnalytics and Advertising Tracking Technologies\n\nYou may exercise choices regarding the use of cookies from Google Analytics by going to https://tools.google.com/dlpage/gaoptout or downloading the Google Analytics Opt-out Browser Add-on.\n\nYou may choose whether to receive Interest-based Advertising by submitting opt-outs. Some of the advertisers and Service Providers that perform advertising-related services for us and our partners may participate in the Digital Advertising Alliance (\"DAA\") Self-Regulatory Program for Online Behavioral Advertising. To learn more about how you can exercise certain choices regarding Interest-based Advertising, visit http://www.aboutads.info/choices, and http://www.aboutads.info/appchoices for information on the DAAs opt-out program for mobile apps. Some of these companies may also be members of the Network Advertising Initiative (\"NAI\"). To learn more about the NAI and your opt-out options for their members, see http://www.networkadvertising.org/choices/. Please be aware that, even if you are able to opt-out of certain kinds of Interest-based Advertising, you may continue to receive other types of ads. Opting out only means that those selected members should no longer deliver certain Interest-based Advertising to you, but does not mean you will no longer receive any targeted content and/or ads (e.g., from other ad networks). TRS is not responsible for effectiveness of, or compliance with, any third-parties opt-out options or programs or the accuracy of their statements regarding their programs.\n\nCommunications\n\nYou may opt-out of receiving marketing emails from us and our Service Providers at any time: (i) as provided in any email to click on the unsubscribe link; (ii) by sending an email to: privacy@turtlerockstudios.com; or (iii) by mailing us at: Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630; Attn: Legal Department. We will try to make the requested changes in our active databases as soon as reasonably practical. Please note that you cannot unsubscribe from non-promotional emails from us, including messages relating to your account transactions, servicing, or TRSs ongoing business relations.\n\nWe may send you push notifications until you remove our games or mobile applications or opt-out by adjusting the permissions on your mobile device.\n\nYour California Privacy Rights\n\nUnder California law, California residents who have an established business relationship with TRS may receive certain information upon request about TRSs disclosure of personal information as defined by Californias \"Shine the Light\" about them to third parties and/or affiliates for such third parties and affiliates own direct marketing purposes.\n\nIf you are a California resident who has an established business relationship with TRS and wish to obtain information about our compliance with this law, please send an email to privacy@turtlerockstudios.com or write to Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630; Attn: Legal Department. Requests must include \"California Privacy Rights Opt-Out Request\" in the first line of the description and include your name, street address, city, state, and ZIP code. Please note that TRS is not required to respond to requests made by means other than through the provided email address or mail address.\n\nAny California residents under the age of eighteen (18) who have registered to use the Services and have posted content or information on the Services, can request that such information be removed from the Services sending an email to us at privacy@turtlerockstudios.com. Requests must state that the user personally posted such content or information and detail where the content or information is posted. We will make reasonable good faith efforts to remove the post from prospective public view.\n\nYour European Privacy Rights\n\nIf you are a resident of Europe, including Switzerland, you have the right to ask us not to process your personal information (or provide it to third parties to process) for marketing purposes or purposes materially different than for which it was originally collected or subsequently authorized by you. You can exercise your right to prevent such processing at any time by contacting us in the following ways: Postal Mail: Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630, Attn: Legal Department; By email: privacy@turtlerockstudios.com. We will try to make the requested changes in our active databases as soon as reasonably practical.\n\nPRIVACY SHIELD AND INTERNATIONAL TRANSFER\n\nThe Services are operated in the United States. If you are located outside of the United States, please be aware that information we collect, including personal information, will be transferred to, and processed, stored and used in the United States. The data protection laws in the United States may differ from those of the country in which you are located, and your personal information may be subject to access requests from governments, courts, or law enforcement in the United States according to laws of the United States. By using the Services or providing us with any information, you consent to the transfer to, and processing, usage, sharing and storage of your information, including personal information, in the United States as set forth in this Privacy Policy.\n\nTRS complies with the EU-US Privacy Shield Framework and the Swiss-U.S. Privacy Shield Framework as set forth by the U.S. Department of Commerce regarding the collection, use, and retention of personal information from the European Union and Switzerland to the United States, respectively. TRS has certified that it adheres to the Privacy Shield Principles of notice, choice, accountability for onward transfer, security, data integrity and purpose limitation, access, and recourse, enforcement and liability.\n\nIn accordance with our obligations under Privacy Shield, and subject to the investigatory and enforcement powers of the U.S. Federal Trade Commission, we hereby affirm our commitment to subject to the Privacy Shield Principles all personal information transferred from the European Union and Switzerland in reliance on Privacy Shield. This means that, in addition to our other obligations under the Privacy Shield Principles, we shall be liable to you for any third party agent to which we transfer your personal information and that processes such personal information in a manner that violates the Privacy Shield Principles, unless we can demonstrate that we are not responsible for the resulting damages.\n\nIn the event that you have any inquiry, dispute, or claim arising out of or relating to our compliance with Privacy Shield, please send an email to privacy@turtlerockstudios.com or write to Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630; Attn: Legal Department. If we are unable to resolve your complaint directly, you may submit your complaint at no cost to you to JAMS at https://www.jamsadr.com/file-an-eu-us-privacy-shield-or-safe-harbor-claim. In the event there are residual complaints that have not been resolved by JAMS, or any other means, you may seek a non-monetary remedy through binding arbitration to be provided to you in accordance with the Privacy Shield Principles.\n\nTo learn more about the Privacy Shield Framework, and to view TRSs certification, please visit https://www.privacyshield.gov/.\n\nCHILDREN'S PRIVACY\n\nWe are a general audience service and we do not knowingly collect any personal information from children under the age of 13 as defined by the U.S. Childrens Privacy Protection Act (\"COPPA\") in a manner that is not permitted by COPPA. If you are a child under 13 years of age, you are not permitted to use the Services and should not send any information about yourself to us through the Services. We take childrens privacy seriously and encourage parents to play an active role in their childrens online experience at all times. We urge parents to instruct their children never to give out their real names, addresses, or phone numbers, without parental permission, when on-line. If you have any concerns about your childs personal information, please contact us at privacy@turtlerockstudios.com.\n\nWHAT SECURITY MEASURES DO WE TAKE TO SAFEGUARD YOUR PERSONAL INFORMATION?\n\nThe personal information that you provide to us is stored on servers that are located in secured facilities and protected by protocols and procedures designed to ensure the security of such information. However, no server, computer or communications network or system, or data transmission over the Internet can be guaranteed to be 100% secure. As a result, while we strive to protect user information, we cannot ensure or warrant the security of any information you transmit to us or through the Services and you acknowledge and agree that you provide such information and engage in such transmissions at your own risk.\n\nNOTIFICATION OF CHANGES\n\nThis Privacy Policy may change from time to time and we will post all changes on the Services. You understand and agree that you will be deemed to have accepted the updated Privacy Policy if you use the Services after the updated Privacy Policy is posted on the Services. If at any point you do not agree to any portion of the Privacy Policy then in effect, you must immediately stop using the Services. To the extent any provision of this Privacy Policy is found by a competent tribunal to be invalid or unenforceable, such provision shall be severed to the extent necessary for the remainder to be valid and enforceable.\n\nQUESTIONS? CONTACT US\n\nIf you have any questions about our privacy practices or this Privacy Policy, including our compliance with Privacy Shield, please contact us at https://www.turtlerockstudios.com/contact-us or Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491, Lake Forest, CA 92630; Attn: Legal Department.\n\nCopyright  2020 Turtle Rock Studios. All Rights Reserved. Privacy Policy | Terms of Use", "Developer Terms of Service": "STUDIO\nGAMES\nVR\nCAREERS\nCOMMUNITY\nNEWS\nSOCIAL\nTURTLE ROCK STUDIOS, INC. END USER LICENSE AGREEMENT\nLAST MODIFIED ON NOVEMBER 12, 2019\n\nPLEASE READ THIS AGREEMENT CAREFULLY; THIS IS A BINDING CONTRACT.\n\nThis End User License Agreement (this EULA) describes the terms and conditions between you and Turtle Rock Studios, Inc. and its affiliates (TRS, we, our, or us), and governs your use of any online service location or application that posts or provides you a link to the EULA, including, without limitation, the applications Face Your Fears, Face Your Fears II, Other Worlds, The Well and Journey of the Gods (each, the App), and all features, content and other services that we own, control, and make available through such online service locations and the App (collectively, the Service).\n\nYOUR USE OF THE SERVICE SIGNIFIES THAT YOU AGREE TO THIS EULA AND CONSTITUTES YOUR BINDING ACCEPTANCE OF THIS EULA, INCLUDING ANY MODIFICATIONS THAT TRS MAKES FROM TIME TO TIME.\n\n1.EULA Updates. We reserve the right, at any time in our sole discretion, to modify or replace any part of the EULA and will provide you with notice for any material changes to the EULA. If you object to any such changes, you agree that your sole recourse is to cease using the Service.\n\n2.Service Use.\n\n2.1Content. The Service contains: (i) materials and other items relating to TRS and its products and services, and similar items from our licensors and other third parties, including all layout, information, databases, articles, posts, text, data, files, images, scripts, designs, graphics, instructions, illustrations, photographs, sounds, pictures, videos, games, applications, advertising copy, URLs, technology, software, algorithms, interactive features, the look and feel of the Service, and the compilation, assembly, and arrangement of the materials of the Service and any and all copyrightable material; (ii) trademarks, logos, trade names, trade dress, service marks, and trade identities of various parties, including those of TRS (TRS Marks); and (iii) other forms of intellectual property (all of the foregoing, collectively Content). All right, title, and interest in and to the Service and the Content is the property of TRS or our licensors or certain other third parties, and is protected by U.S. and international copyright, trademark, trade dress, patent and/or other intellectual property and unfair competition rights and laws to the fullest extent possible. A list of credits and notices for third party components of the Content is set forth in Exhibit 1.\n\n2.2 Limited License. Unless stated in another written agreement between you and TRS, and subject to your strict compliance with the EULA, TRS grants you a limited, non-exclusive, revocable, non-assignable, personal, and non-transferable license to download, display, view, use, and play the Content on a personal computer, browser, laptop, tablet, mobile phone, or other internet-enabled device (each, a Device), in each case for your personal, non-commercial use only. The foregoing limited license (i) does not give you any ownership of, or any other intellectual property interest in, any Content, and (ii) may be suspended or terminated for any reason, with or without cause, in the sole discretion of TRS, and without advance notice or liability. Your unauthorized use of the Content may violate copyright, trademark, privacy, publicity, communications, and other laws, and any such use may result in your personal liability, including potential criminal liability. \n\n2.3 Availability. TRS may suspend or terminate the availability of the Service and Content, in whole or in part, to any individual user or all users, for any reason, in the sole discretion of TRS, and without advance notice or liability. Upon suspension or termination of your access to the Service, or upon notice from TRS, all rights granted to you under the EULA or any applicable Additional Terms will cease immediately, and you agree that you will immediately discontinue use of the Service and Content.\n\n2.4 Reservation of Rights. All rights not expressly granted to you are reserved by TRS and its licensors and other third parties. No right or license may be construed, under any legal theory, by implication, estoppel, industry custom, or otherwise. Any unauthorized use of the Content or Service for any purpose is prohibited.\n\n2.5 Virtual Reality Devices. You must have an Internet-enabled third party virtual reality headset device (a VR Device) that is compatible with the Service in order to access and use the Service. You are solely responsible for ensuring that your VR Device is compatible with the Service. The applicable third party provider of the VR Device, and not TRS, is solely responsible for any warranties, liabilities and all other matter relating to the VR Device.\n\n2.6 Health and Safety Warning. You understand and agree that the Service is designed for use on a virtual reality platform and that there are inherent risks of personal injury, discomfort, and/or property damage that may be associated with virtual reality platforms and the Service. To reduce these risks, it is important that you read, evaluate and follow all health and safety warnings, guidelines, and instructions with respect to the virtual reality platform that you are using. By using the Service, you represent and warrant that you have read and understand all such warnings, guidelines, and instructions. Be aware of your surroundings when using the Service. You may injure yourself or others if you do not properly clear the space in which you may use the Service. You are solely responsible for your use of the Service and assume all risks associated with your use of the Service and any activities related thereto. The Service may contain flashing lights, realistic images and simulations. Some people may experience side effects such as motion sickness, epileptic seizures, momentary loss of consciousness, dizziness, or nausea when viewing certain types of flashing lights or graphics that are included in the Service. This may happen where a person has not previously suffered in this way and has no known symptoms or history of these side effects. If you have a condition which makes this possible or you have experienced similar symptoms, please consult a doctor before using the Service. If you feel dizzy, tired, fatigued or uncomfortable when using the Service, please stop using the Service. If these symptoms continue after you have stopped using the Service, please consult a doctor. Nothing herein shall be construed as an admission or a waiver on behalf of TRS.\n\n3.Disclaimer of Representation and Warranties.\n\nTHE SERVICE IS PROVIDED TO YOU ON AN \"AS IS,\" \"AS AVAILABLE,\" AND \"WITH ALL FAULTS\" BASIS. NEITHER TRS NOR ANY OF ITS OFFICERS, DIRECTORS, MANAGERS, EMPLOYEES OR AGENTS (COLLECTIVELY, THE \"TRS PARTIES\") MAKE ANY REPRESENTATIONS, WARRANTIES OR ENDORSEMENTS OF ANY KIND WHATSOEVER AS TO THE CONTENT OR OTHER SERVICES, WHETHER EXPRESS OR IMPLIED, STATUTORY OR OTHERWISE, OR ARISING FROM COURSE OF DEALING, COURSE OF PERFORMANCE OR USAGE OF TRADE, INCLUDING, TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE IMPLIED WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT AND FREEDOM FROM COMPUTER VIRUS. BY ACCESSING OR USING THE SERVICE YOU REPRESENT AND WARRANT THAT YOUR ACTIVITIES ARE LAWFUL IN EVERY JURISDICTION WHERE YOU ACCESS OR USE THE SERVICE.\n\nNOTWITHSTANDING THE FOREGOING, AND TO THE MAXIMUM EXTENT PERMITTED BY LAW, THESE DISCLAIMERS DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n4. Limitations of Our Liability.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL THE TRS PARTIES BE LIABLE TO YOU FOR ANY LOSS, DAMAGE OR INJURY OF ANY KIND INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY, CONSEQUENTIAL OR PUNITIVE LOSSES OR DAMAGES, OR DAMAGES FOR SYSTEM FAILURE OR MALFUNCTION OR LOSS OF PROFITS, DATA, USE, BUSINESS OR GOOD-WILL, ARISING OUT OF OR IN CONNECTION WITH (A) THE SERVICE, (B) THE EULA OR (C) YOUR MISUSE OF THE SERVICE OR ANY CONTENT AVAILABLE ON OR THROUGH THE SERVICE, INCLUDING, WITHOUT LIMITATION, THE TRS MARKS. THE LIMITATIONS SET FORTH IN THIS SECTION SHALL APPLY REGARDLESS OF THE FORM OF ACTION, WHETHER THE ASSERTED LIABILITY OR DAMAGES ARE BASED ON CONTRACT, INDEMNIFICATION, TORT, STRICT LIABILITY, STATUTE OR ANY OTHER LEGAL OR EQUITABLE THEORY.\n\nNOTWITHSTANDING THE FOREGOING, THESE DISCLAIMERS HEREIN DO NOT EXCLUDE ANY PRODUCT LIABILITY CLAIMS, STATUTORY CONSUMER RIGHTS, DAMAGES ASSOCIATED WITH PERSONAL INJURY OR RESULTING FROM TRS INTENTIONAL MISCONDUCT, RECKLESSNESS, FRAUD, OR GROSS NEGLIGENCE.\n\n5. Indemnification.\n\nYou agree to defend, indemnify and hold harmless the TRS Parties from and against any and all claims, liabilities, damages, losses, costs and expenses (including, reasonable attorneys fees and costs) arising out of or in connection with any of the following: (i) your breach or alleged breach of the EULA; (ii) your misuse of the Service or Content; (iii) your violation of any laws, rules, regulations, codes, statutes, ordinances or orders of any governmental or quasi-governmental authorities; (iv) your violation of the rights of any third party, including any intellectual property right, publicity, confidentiality, property or privacy right; or (vi) any misrepresentation made by you. TRS reserves the right to assume, at your expense, the exclusive defense and control of any matter subject to indemnification by you. You agree to cooperate with the defense by TRS of any claim. You will not in any event settle any claim without the prior written consent of TRS.\n\nThis provision does not require you to indemnify us for any unconscionable commercial practice by us or for our fraud, deception, false promise, misrepresentation or concealment, suppression or omission of any material fact in connection with the Service.\n\n6.Restrictions and Conditions of Use.\n\n6.1.Use of Service. TRS permits you to view and use a single copy of the Service for your personal, non-commercial use. You agree not to license, create derivative works from, transfer, sell or re-sell any information, Content, or services obtained from the Service.\n\n6.2.No Violation of Laws. You agree that you will not violate any applicable law or regulation in connection with your use of the Content or Service. The Service is operated by TRS in the United States. Those who choose to access the Service from locations outside the United States do so on their own initiative and are responsible for compliance with applicable local laws.\n\n6.3.No Commercial Uses. You agree that you will not use the Content or Service for any commercial purpose or the benefit of any third party or charge any person, or receive any compensation for, the use of the Content or Service.\n\n7.Children. The Service is not directed toward children under 13 years of age nor does TRS knowingly collect information from children under 13. If you are under 13, please do not submit any personally identifiable information to TRS.\n\n8.Agreement to Arbitrate Disputes and Choice of Law.\n\nPLEASE READ THIS SECTION CAREFULLY  IT MAY SIGNIFICANTLY AFFECT YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO FILE A LAWSUIT IN COURT AND TO HAVE A JURY HEAR YOUR CLAIMS. IT CONTAINS PROCEDURES FOR MANDATORY BINDING ARBITRATION AND A CLASS ACTION WAIVER.\n\n8.1 We Both Agree to Arbitrate. You and TRS agree to resolve any claims relating to the EULA through final and binding arbitration, except to the extent you have in any manner violated or threatened to violate TRS intellectual property rights (for example, trademark, trade secret, copyright, or patent rights). Under such circumstances TRS may bring a lawsuit solely for injunctive relief to stop unauthorized use or abuse of the Service, or intellectual property infringement (for example, trademark, trade secret, copyright, or patent rights) without first engaging in arbitration or the informal dispute-resolution process described herein.\n\n8.2 What is Arbitration. Arbitration is more informal than a lawsuit in court and seeks to resolve disputes more quickly. Instead of a judge or a jury, the case will be decided by a neutral arbitrator who has the power to award the same damages and relief that a court can. If any provision of this arbitration agreement is found unenforceable, the unenforceable provision shall be severed, and the remaining arbitration terms shall be enforced.\n\n8.3 Arbitration Procedures. The Federal Arbitration Act governs the interpretation and enforcement of this dispute resolution provision. Arbitration shall be initiated through JAMS. Any dispute, controversy, or claim arising out of or relating to the EULA, except as otherwise provided herein, shall be referred to and finally determined by arbitration in accordance with the JAMS Streamlined Arbitration Rules and Procedures in front of one arbitrator. If there is a conflict between JAMS Rules and the rules set forth in the EULA, the rules set forth in the EULA will govern. The JAMS Rules and instructions for how to initiate an arbitration are available from JAMS at www.jamsadr.com or 1-800-352-5267. To initiate arbitration, you or TRS must do the following things:\n\n(1)  Write a demand for Arbitration. The demand must include a description of the claim and the amount of damages sought to be recovered. You can find a copy of a demand for arbitration at www.jamsadr.com.\n\n(2)  Send three copies of the demand for arbitration, plus the appropriate filing fee to your local JAMS office or to JAMS, 5 Park Plaza, Suite 400, Irvine, CA 92614.\n\n(3)  Send one copy of the demand for arbitration to the other party.\n\nPayment of all filing, administration and arbitrator fees will be governed by the JAMS Rules. If travelling to Orange County, California, is a burden, you may participate in the arbitration by phone or via document submission to the fullest extent allowable by the arbitrator. Each party will bear their own costs of arbitration unless the arbitrator directs that bearing such costs would be an undue burden and in that case, we will pay for your portion of the arbitration administrative costs (but not your attorneys fees). Arbitration under this agreement shall be held in the United States in Orange County, California under California law without regard to its conflict of laws provisions. The arbitration may award on an individual basis the same damages and relief as a court (including injunctive relief). Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction.\n\n8.4 Authority of Arbitrator. The arbitrator will decide the rights and liabilities, if any, of you and TRS, and the dispute will not be consolidated with any other matters or joined with any other cases or parties. The arbitrator shall have the authority to grant motions dispositive of all or part of any claim. The arbitrator shall have the authority to award monetary damages and to grant any non-monetary remedy or relief available to an individual under applicable law, the Arbitration Rules, and the EULA. The arbitrator shall issue a written award and statement of decision describing the essential findings and conclusions on which the award is based, including the calculation of any damages awarded. The arbitrator has the same authority to award relief on an individual basis that a judge in a court of law would have. The award of the arbitrator is final and binding upon you and TRS.\n\n8.5 Waiver of Class Actions. You waive any right to pursue an action on a class-wide basis against us and may only resolve disputes with us on an individual basis, and may not bring a claim against us as a plaintiff or a class member in a class, consolidated, or representative action. Class arbitrations, class actions, private attorney general actions, and consolidation with other arbitrations are not allowed.\n\n8.6 Waiver of Jury Trial. THE PARTIES HEREBY WAIVE THEIR CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR A JURY, instead electing that all claims and disputes shall be resolved by arbitration. Arbitration procedures are typically more limited, more efficient and less costly than rules applicable in court and are subject to very limited review by a court. In the event any litigation should arise between you and TRS in any state or federal court in a suit to vacate or enforce an arbitration award or otherwise, YOU AND TRS WAIVE ALL RIGHTS TO A JURY TRIAL, instead electing that the dispute be resolved by a judge. YOU ACKNOWLEDGE THAT YOU HAVE BEEN ADVISED THAT YOU MAY CONSULT WITH AN ATTORNEY IN DECIDING TO ACCEPT THIS AGREEMENT TO ARBITRATE.\n\n8.7 Choice of Law/Forum Selection. In any circumstances where the Agreement to Arbitrate Disputes permits the parties to litigate in court, the EULA shall be governed by and construed in accordance with the laws of the State of California, excluding its conflict of law rules. You further expressly consent and agree to submit to the exclusive jurisdiction and venue of a court of competent jurisdiction located in Orange County, California.\n\n9. Waiver of Injunctive or other Equitable Relief.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, YOU AGREE THAT YOU WILL NOT BE PERMITTED TO OBTAIN AN INJUNCTION OR OTHER EQUITABLE RELIEF OF ANY KIND, SUCH AS ANY COURT OR OTHER ACTION THAT MAY INTERFERE WITH OR PREVENT THE DEVELOPMENT OR EXPLOITATION OF ANY WEBSITE, APPLICATION, CONTENT, SUBMISSIONS, PRODUCT, SERVICE, OR INTELLECTUAL PROPERTY OWNED, LICENSED, USED OR CONTROLLED BY TRS OR A LICENSOR OF TRS.\n\n10.General.\n\n10.1.No Partnership. You agree that no joint venture, partnership, employment, or agency relationship exists between you and TRS as a result of this EULA or your use of the Service.\n\n10.2.Assignment. TRS may assign this EULA, in whole or in part, to any person or entity at any time with or without your consent. You may not assign the EULA without TRS prior written consent, and any unauthorized assignment by you shall be null and void.\n\n10.3.Severability. If any part of this EULA is determined to be invalid or unenforceable, then that portion shall be severed, and the remainder of the EULA shall be given full force and effect.\n\n10.4.No Waiver. Our failure to enforce any provision of this EULA shall in no way be construed to be a present or future waiver of such provision, nor in any way affect the right of any party to enforce each and every such provision thereafter. The express waiver by us of any provision, condition or requirement of this EULA shall not constitute a waiver of any future obligation to comply with such provision, condition or requirement.\n\n10.5.Notices. All notices given by you or required under this EULA shall be in writing and addressed to: Turtle Rock Studios, Inc., 25422 Trabuco Road #105-491 Lake Forest, CA 92630 ATTN: President.\n\n10.6. Email Communication. When you communicate with us electronically, you consent to receive communications from us electronically.\n\n10.7. Survival. The provisions of this EULA and any applicable Additional Terms, which by their nature should survive termination of your use of the Service, including sections on Service Use (except for the limited license), Submissions, Copyright Infringement, Third Party Services, Agreement to Arbitrate Disputes and Choice of Law, Disclaimer of Representations and Warranties, Limitations of Our Liability, Indemnification, Waiver of Injunctive or Other Equitable Relief, and General Provisions, will survive.\n\n10.8.Entire Agreement. This EULA, including the documents expressly incorporated by reference, constitutes the entire agreement between you and us with respect to the Service and supersedes all prior or contemporaneous communications, whether electronic, oral or written, between you and us with respect to the Service.\n\nI HEREBY ACKNOWLEDGE THAT I HAVE READ AND UNDERSTAND THE FOREGOING TERMS OF USE AGREEMENT AND AGREE THAT MY USE OF THE APP IS AN ACKNOWLEDGMENT OF MY AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS TERMS OF USE AGREEMENT.\n\n\n\n\nEXHIBIT 1\nTHIRD PARTY COMPONENTS OF CONTENT\n\nUnreal Engine 4\n\nUnreal Engine Copyright 1998-2019, Epic Games, Inc. All rights reserved. Unreal is a trademark or registered trademark of Epic Games, Inc. in the United States of America and elsewhere.\n\nWwise\n\nPowered by Wwise  2006  2019 Audiokinetic Inc. All rights reserved.\n\nKhronos Group Inc.\n\nCopyright (c) 2007-2018 The Khronos Group Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and /or associated documentation files (the \"Materials \"), to deal in the Materials without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Materials, and to permit persons to whom the Materials are furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Materials.\n\nTHE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE MATERIALS OR THE USE OR OTHER DEALINGS IN THE MATERIALS.\n\nMesa3D\n\nCopyright (C) 1999-2007 Brian Paul  All Rights Reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS >OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nAndroid Open Source Project\n\nCopyright (C) 2008 The Android Open Source Project\n\nLicensed under the Apache License, Version 2.0\n\nZLib\n\nCopyright (C) 1995-2017 Jean-loup Gailly and Mark Adler\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nICU\n\nCopyright  1991-2019 Unicode, Inc. All rights reserved.\n\nDistributed under the Terms of Use in https://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Unicode data files and any associated documentation (the \"Data Files\") or Unicode software and any associated documentation (the \"Software\") to deal in the Data Files or Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, and/or sell copies of the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that either\n\n(a) this copyright and permission notice appear with all copies of the Data Files or Software, or\n\n(b) this copyright and permission notice appear in associated Documentation.\n\nFreetype\n\nThis software is based in part of the work of the FreeType Team: https://www.freetype.org/\n\nHarfBuzz\n\nCopyright  2010,2011,2012,2013,2014,2015,2016,2017,2018,2019 Google, Inc.\n\nCopyright  2019 Facebook, Inc.\n\nCopyright  2012 Mozilla Foundation\n\nCopyright  2011 Codethink Limited\n\nCopyright  2008,2010 Nokia Corporation and/or its subsidiary(-ies)\n\nCopyright  2009 Keith Stribley\n\nCopyright  2009 Martin Hosken and SIL International\n\nCopyright  2007 Chris Wilson\n\nCopyright  2006 Behdad Esfahbod\n\nCopyright  2005 David Turner\n\nCopyright  2004,2007,2008,2009,2010 Red Hat, Inc.\n\nCopyright  1998-2004 David Turner and Werner Lemberg\n\n\n\n\nFor full copyright notices consult the individual files in the package.\n\n\n\n\nPermission is hereby granted, without written agreement and without license or royalty fees, to use, copy, modify, and distribute this software and its documentation for any purpose, provided that the above copyright notice and the following two paragraphs appear in all copies of this software.\n\nIN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFTWARE PROVIDED HEREUNDER IS ON AN \"AS IS\" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.\n\nVorbis\n\nCopyright (c) 2002-2018 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nCopyright 2001-2011 Xiph.Org, Skype Limited, Octasic,\n\n          Jean-Marc Valin, Timothy B. Terriberry,\n\n          CSIRO, Gregory Maxwell, Mark Borgerding,\n\n          Erik de Castro Lopo\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of Internet Society, IETF or IETF Trust, nor the names of specific contributors, may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nPNG Reference Library\n\n* Copyright (c) 1995-2019 The PNG Reference Library Authors.\n\n* Copyright (c) 2018-2019 Cosmin Truta.\n\n* Copyright (c) 2000-2002, 2004, 2006-2018 Glenn Randers-Pehrson.\n\n* Copyright (c) 1996-1997 Andreas Dilger.\n\n* Copyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.\n\nThe software is supplied \"as is\", without warranty of any kind, express or implied, including, without limitation, the warranties of merchantability, fitness for a particular purpose, title, and non-infringement. In no event shall the Copyright owners, or anyone distributing the software, be liable for any damages or other liability, whether in contract, tort or otherwise, arising from, out of, or in connection with the software, or the use or other dealings in the software, even if advised of the possibility of such damage.\n\nPermission is hereby granted to use, copy, modify, and distribute this software, or portions hereof, for any purpose, without fee, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated, but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This Copyright notice may not be removed or altered from any source or altered source distribution.\n\nCurl\n\nCopyright (c) 1996 - 2019, Daniel Stenberg, daniel@haxx.se, and many contributors, see the THANKS file.\n\nAll rights reserved.\n\nPermission to use, copy, modify, and distribute this software for any purpose with or without fee is hereby granted, provided that the above copyright notice and this permission notice appear in all copies.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Software without prior written authorization of the copyright holder.\n\nIntel(R) Metrics Discovery Application Programming Interface\n\nCopyright (c) 2019, Intel Corporation\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nOpenSSL\n\nCopyright (c) 1998-2019 The OpenSSL Project. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit. (http://www.openssl.org/)\"\n\n4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to endorse or promote products derived from this software without prior written permission. For written permission, please contact openssl-core@openssl.org.\n\n5. Products derived from this software may not be called \"OpenSSL\" nor may \"OpenSSL\" appear in their names without prior written permission of the OpenSSL Project.\n\n6. Redistributions of any form whatsoever must retain the following acknowledgment:\n\n \"This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (http://www.openssl.org/)\"\n\nTHIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n====================================================================\n\nThis product includes cryptographic software written by Eric Young(eay@cryptsoft.com). This product includes software written by Tim Hudson (tjh@cryptsoft.com).\n\nSSLeay\n\nCopyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)\n\nAll rights reserved.\n\nThis package is an SSL implementation written by Eric Young (eay@cryptsoft.com).\n\nThe implementation was written so as to conform with Netscapes SSL.\n\nThis library is free for commercial and non-commercial use as long as the following conditions are aheared to. The following conditions apply to all code found in this distribution, be it the RC4, RSA, lhash, DES, etc., code; not just the SSL code. The SSL documentation included with this distribution is covered by the same copyright terms except that the holder is Tim Hudson (tjh@cryptsoft.com).\n\nCopyright remains Eric Young's, and as such any Copyright notices in the code are not to be removed.\n\nIf this package is used in a product, Eric Young should be given attribution as the author of the parts of the library used.\n\nThis can be in the form of a textual message at program startup or in documentation (online or textual) provided with the package.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software must display the following acknowledgement:\n\n \"This product includes cryptographic software written By Eric Young (eay@cryptsoft.com)\"\n\n The word 'cryptographic' can be left out if the rouines from the library being used are not cryptographic related :-).\n\n4. If you include any Windows specific code (or a derivative thereof) form  the apps directory (application code) you must include an acknowledgement:\n\n \"This product includes software written by Tim Hudson (tjh@cryptsoft.com)\"\n\nTHIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nOpenSubdiv\n\nCopyright 2013 Pixar\n\nLicensed under the Apache License, Version 2.0 (the \"Apache License\") with the following modification; you may not use this file except in compliance with the Apache License and the following modification to it:\n\nSection 6. Trademarks. is deleted and replaced with:\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor and its affiliates, except as required to comply with Section 4(c) of the License and to reproduce the content of the NOTICE file.\n\nYou may obtain a copy of the Apache License at\n\n  http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software distributed under the Apache License with the above modification is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the Apache License for the specific language governing permissions and limitations under the Apache License.\n\nLibtiff\n\nCopyright (c) 1988-1997 Sam Leffler\n\nCopyright (c) 1991-1997 Silicon Graphics, Inc.\n\nPermission to use, copy, modify, distribute, and sell this software and its documentation for any purpose is hereby granted without fee, provided that (i) the above copyright notices and this permission notice appear in all copies of the software and related documentation, and (ii) the names of Sam Leffler and Silicon Graphics may not be used in any advertising or publicity relating to the software without the specific, prior written permission of Sam Leffler and Silicon Graphics.\n\nTHE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nOpenEXR\n\nCopyright (c) 2006-2019 OpenEXR a Series of LF Projects, LLC. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nAMD\n\nCopyright (c) 2016 Advanced Micro Devices, Inc. All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nVorbis Quality Improvements\n\naoTuV - Copyright (c) 2003-2008 Aoyumi\n\nlibvorbis - Copyright (c) 2002-2008 Xiph.org Foundation\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n- Neither the name of the Xiph.org Foundation nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLibwebsockets\n\nCopyright (C) 2010 - 2019 Andy Green <andy@warmcat.com>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nMikktspace\n\nCopyright (C) 2011 by Morten S. Mikkelsen\n\nThis software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source distribution.\n\nCopyright  2020 Turtle Rock Studios. All Rights Reserved. Privacy Policy | Terms of Use", "Space Required": "970.1 MB"}



["5 stars\n77%\n4 stars\n16%\n3 stars\n4%\n2 stars\n2%\n1 star\n2%", "TH3_M3D1CJul 30 at 1:22 PM\nGreat Story Game!\n\nAs many have said before, its the Legend of Zelda of Oculus, and I think that holds true. Great gameplay, pretty good story, and good immersion. Great title to pick up, just make sure you are used to VR. New players can get a little dizzy or nauseous I have found from showing it to others.\n\nHelpful | 39", "powney1991Apr 21 at 3:54 PM\nThe Zelda of Oculus Quest!\n\nI got my quest on launch month last year May 2019 and remember playing this once only briefly jumping in as it was an opening day title. Fast forward to 2020 and I questioned why I ever put it down to begin with! I cant get enough of this game right now! The ability to wield a sword and shield and a bow and arrow all of which are upgradable through power ups you can find in each level while you venture across distant lands battling your way past many enemies all with different abilities and collecting feathers to enable god like abilities! (Which are extremely fun) is quite frankly awestriking! Its also super colourful, super immersive and its also got a great story which is rather lengthy. Its about as close as youre gonna get to feeling like playing Zelda in VR! Im on the final level now and cant wait to see how it all ends. A stunning clever masterpiece of a game!\n\n\nEDIT: Ive now finished the game and my mind is blown ever further! Its absolutely incredible! Anyone who wants a fantasy adventure title it doesnt get any better than this!!!\n\nHelpful | 264", "javiwear8 days ago\nPretty Good Game\n\nDespite the very cartoony graphics, I gotta say the story and gameplay are flawless, every attack,block, and shot are very unique and the game doesnt feel unfair. I also happen to love its way of upgrading your weapons instead of just upgrading them on levels you gotta collect stuff to upgrade your sword/shield/crossbow which I believe is very unique. Also the whole gameplay itself I get a really good Legend of Zelda vibe from it, that being said this game still has its difficulty and puzzles, but thats what makes this game so fun\n\nHelpful | 1", "MargotTenenbaumJul 4 at 4:07 PM\nOne of my favourite games on oculus\n\nIf you liked the legend of Zelda, youll love this game. Action/puzzle game thats hours of fun. I was sad when I finally finished the game, but so impressed with the whole thing. I hope they put out more games like this. The only thing I suggest they would add mini games too. Like they used to do with Zelda back in the game cube / Nintendo DS days. I loved the little capture the triforce mini game for the DS.\n\nHelpful | 7", "a_random_ladJun 3 at 12:56 PM\nFinally a full vr game\n\nI had been looking for a full game experience for oculus quest yet I couldnt find any. I started looking online and saw that this game was recommended, and decided to give it a try. I finally got it and oh my god this game is the most amazing vr game Ive ever played. Its like windwaker for vr, its got everything I love. Cartoony graphics, a fun storyline, upgradable weapons, good combat, and more. Honestly if youre looking for a Zelda-like experience on vr, give this game a spin.\n\nHelpful | 29", "madscyJul 12 at 4:53 PM\nA Great Adventure!\n\nLooks good, plays well. Reminiscent of a great Nintendo adventure. The game is lengthy and imaginative. Very immersive, with great game design. This is not Asgards Wrath - but a very fun adventure nonetheless. Very recommended for anyone that wants a cool, immersive adventure game in VR.\n\nHelpful | 6", "Ihrie4 days ago\nWonderfully well-made\n\nDefinitely the closest thing youll get to A Zelda like game on the quest as of writing this review.\n\nA fun experience, even if some of the levels/encounters didnt feel as flushed out as they couldve been. Some spots of the game felt more like proof of concepts and a bit short, but still enjoyable overall and not bad for a Quest launch title.\n\nDefinitely appreciate the harder difficulty option for a little bit of replayability as well.\n\nWould love to see a sequel.\n\nHelpful | 0", "MrBlitzVrJul 6 at 1:17 PM\nGreat if youre a Zelda Fan\n\nI havent finished the game yet but Id say that Im about halfway through and its a pretty good game.\n\nI found it hard to pick up seeing as games like journey of the gods arent really my type but I was pleasantly surprised by how fun and immersive the game actually is.\n\nEven though the graphics are cartoony it felt real somehow and the god mode is one of my favourite aspects of the game.\n\nQuality game. Would definitely recommend\n\nHelpful | 8", "DanteLuigiJul 9 at 3:06 PM\nZelda VR!\n\nI had this game for a long time but never wrote a review so I decided I will. Well anyway this game is like Zelda in vr. There are boss fights and you can upgrade your shield, sword, and crossbow. This game is a lot of fun to play! It is definitely a five star!\n\nHelpful | 3", "BjornH27Jul 30 at 1:27 PM\nGreat game\n\nMy son begged to get this game after trying the demo and he loves it now that he has it. I enjoy watching him having so much fun playing.\nI might try it myself someday when he is off to bed ;-)\n\nHelpful | 2", "udo.nink13 days ago\nvReal hero stuff\n\nWho doesn't want to try at least once to be a warrior with sword and shield and crossbow. Or change to your other god being, wow. Yeah, graphics could be better, admitted. But, what a game play and so smooth. Love it.\n\nHelpful | 0", "skittle02112 days ago\nGreat Game, Ending Far Too Long\n\nI loved this game. The characters were great, the story was great, the controls were great. It is all around a really good game. However, the ending drug on for far too long. The ending couldve taken place in at least half the time that it did. It felt like repeated missions that you would have to do over and over again for no real purpose. This game was borderline perfect up until that point, but the ending seriously should have been shorter.\n\nHelpful | 0", "TheLavenderClown23 days ago\nReally cute, really immersive!\n\nDefinitely has that Nintendo-style magic that makes it just a thrill to play. I dont write reviews, but the art, gameplay, and atmosphere really make it a stand out.\n\nHelpful | 2", "cabiad3 days ago\nGood game\n\nIf you put all the comfort settings on it is great if your motion sick I tried it for like two days and I really get motion sickness now\n\nHelpful | 0", "CamTheAdventurer11 days ago\nGodlike experience\n\nThe story progresses as you do where you are the character, you start with no backstory, but with a whole story ahead you of you. Absolutely love this game, it is fantastical!\n\nHelpful | 0", "HutwolfJul 24 at 2:27 PM\nZelda on Quest? Not anywhere close.\n\nThe reviews hype this game up pretty high, so I admit, I did look forward to this - more than I should have. In the end, it's just kind of medicore and really, really short. The combat doesn't feel satisfying and the puzzle design barely has time to expand its ideas into anything noteworthy. Most mechanics blow over to fast, that they barely scratch the surface of what was possible with this game. There are a few cool parts, but again, blink and you miss it, it's not even worth mentioning.\n\nIt's also suprising how stiff and lifeless the world feels. The barest minimum of interactivity, no bashing enemies with the shield, no picking up random objects, no pulling levers, no climbing, just swing your sword and shoot your crossbow. The god powers don't make up for that, since they are mostly used for the few beginner level puzzles. The story is pretty simple too. Charming, I admit, but still not enough to make this an outstanding experience.\n\nWhat is here, is still enjoyable, but overpriced and overpromised.\n\nHelpful | 5", "jeffgreen21Jul 16 at 4:57 PM\nAs good as Zelda\n\nFirst adventure game on my Quest and it was well worth the price. Very similar to Legend of Zelda, but way more fun in the VR world. Loved the whole adventure.\n\nHelpful | 2", "brycegaming123Jul 7 at 7:03 PM\nPretty good game\n\nThis game is pretty fun you should definitely buy this game its worth the $30 It may seem a lot of money but the gameplay and story is amazing I did the same thing thought it was a lot for a game but really it was fun.\n\nHelpful | 3", "OhNefariousJul 13 at 9:20 PM\nSurprise around every corner\n\nI had this game in my library for soooo long and just ignored it,got bored and decided to give it another try.After the first mission, I couldnt get enough! It was actually so surprising how much this game was jam-packed with good stuff.Fun and threatening enemies,exploration and collectible upgrades scattered through the map,thats my favorite part! Trust me you wont regret buying this\n\nHelpful | 0", "jsmith72902Apr 21 at 10:38 PM\nBetter than I expected\n\nWhen I tried the demo I found it fun but I thought it wasn't worth $30. Fast forward several months and I am loosing my mind in quarantine and I thought \"might as well\" I've had tons of fun and I haven't even finished the game. I came so close to losing several times and I am only playing on normal, so I can't wait to try hard once I finish it the first time. Definitely a must play\n\nHelpful | 36", "RednalokinJul 3 at 8:11 PM\nReally Fun\n\nIf you don't have too much motion sickness and are into games like this, it's quite fun to play, i enjoyed all the abilities and thing you do in the campain, for some it might not have much replay-ability but personally it's very fun and replayable.\n\nHelpful | 2", "lord_luciferJun 14 at 10:45 AM\nAmazing\n\nUpdate:\nAfter playing for an hour I almost threw up  the demo was fun because it only lasted so long. Where as the actual game has too much walking around with not much to do except feeling sick to the stomach from the disorienting motion\n\n----------------------------\n\nI tried the demo and this game is definitely my favorite rpg on vr. Everything just works. The game is visually pleasing and you can wield sword or shoot arrows in first person view while explore fantasy lands and fight monsters. I wish there are more games like this but seeing how this game works I have high hopes for future vr games! It's the nino kuni + legend of zelda of VR. Love \n\nHelpful | 3", "NinjaXMJun 14 at 5:37 AM\nI feel like a lonely god\n\nThe game itself is good, but it could have been better. For starters I think my really high expectations somewhat lead to my disappointment, I was hoping for a Zelda like experience, but the only similarity I see here is in the style of the shield.\n\nMy biggest issue however is how distant from the people I feel while playing. The characters have no faces and they speak a very repetitive and annoying language, and therefor I have not connected emotionally with any of them.\n\nPros:\n- Combat feels great\n- Scale is phenomenal (tower-tall enemies phenomenal)\n\nCons:\n- The legend of Zelda has puzzles to solve, this doesnt.\n- Zelda has memorable characters that add to the story, this doesnt.\n\nI wish I felt more connected to the people of this world instead of feeling like Im the only person with a story to be told. Just makes me think that being a god must really feel very lonely.\n\nHelpful | 8", "BearBitMeJul 9 at 3:07 PM\nFish\n\nFlop flop\n\nHelpful | 15", "taylor.hill2003May 9 at 12:40 AM\nJust a great game\n\nHonestly this was my first actual VR full game experience and it is well worth it. I enjoyed each level and you can see the care the developers put into the game. The puzzles are fun and the enemies are very diverse. I love it! The art style and music are also wonderful!\nI plan on going through again on a harder difficulty to get all the collectable items. I would recommend this game to anyone just starting out or used to VR.\n\nHelpful | 14", "Aliasaustin6288Jun 3 at 12:33 AM\nLike the good old games...\n\nIts the donkey Kong 64, Mario 64, legend of Zelda, and or banjo kazooie of Oculus. I really like how every character is different and that you must find everything to level yourself up. Its a great length of a story for any game on the Quest I have played. I would like to suggest something in an update or second game, have more bosses. Maybe each boss can have a special key or something to go to the next level. This would make it more like the games I compared this one too, but I can not help but feel it would make the game even just a little more fun than it already is which is already really fun. The graphics are great for the type of designing it is. I am hoping and looking forward to another update and or game! If you are hesitant, I dont think its possible to be disappointed by this game!\n\nHelpful | 4", "Mr_Stache9 days ago\nGreat game\n\nHonestly, I was looking for a game like this to remind me of the days when Zelda was still a thing. I love the way you can earn different abilities to blast some MoonBeasts\n\nHelpful | 0", "Luke_Skywalker1221Jun 17 at 6:21 PM\nLOVE THIS GAME!\n\nalright so ive had my quest since december of 2019 and it has been AMAZING. Mine came with the vader immortal series but i saw this game and decided to try it out. Its a little hard at first but super fun and i love the cartoon style of the game. in short this game is a must have for people who are just beggining vr or are a seasoned veteran and it will keep you entertained for hours. Can't wait to see more!\n\nHelpful | 2", "ajaswinski11 days ago\nGLAD I BOUGHT IT BUT..\n\nGets redundant and the protect the egg level is pretty annoying because it's very vague about what to do. Also, I love a game for how it personally makes you feel. For what it is, Superhot definitely made you feel like Neo from Matrix. This game is chill and fun, but I definitely don't feel like some needed hero. Finally, it feels kind of kiddie game but I don't fault the devs for that. Lots of adults like the zelda nostalgia. Just hoping Asgards Wrath will find a home on the Quest 2.0.\n\nHelpful | 0", "scruggs10117 days ago\nAmazing\n\nThis game is so fun and I love it so much! It really is creative and the story is great! I recommend this game.\n\nHelpful | 0", "Sydney_RobsterJul 12 at 7:56 AM\nPerfect\n\nI can't find fault with game. I luv the colourful environment, toggling between the sword/shield to the crossbow for some biffo, and the story is surprisingly good given it's conveyed via text bubbles. The game is a descent length too.\n\nHelpful | 1", "FF-Vanguard22 days ago\nA great RPG!\n\nFeels like great fun to play, good combat and cute yet sometimes scary enemy designs.\n\nHelpful | 1", "steve.estrada.73307617 days ago\nLove it\n\nIt is like legend of Zelda just that it is better NVR\n\n\nHelpful | 0", "KasumoJul 21 at 4:23 PM\nFun game\n\nReally fun game. I just wish that there was a free play mode so that we can continue playing once we finish the storyline\n\nHelpful | 0", "eloysalas2Jul 27 at 2:14 PM\n\nGg well made\n\nHelpful | 2", "wesley.leamanMar 4 at 11:02 PM\nA full colorful game\n\nThis game is quite the experience. I'm not finished with the levels yet but I can tell you that, choose this one if you're considering a new game. I have had such a blast along the levels and I gave so much love for the colorful yet simple art style. You need to have this game in your library. It's not a short experience, it is a full fledged game with an intuitive combat system. Oh, and you can pet the owl, thank you for that devs.\n\nHelpful | 128", "Starman405Jun 13 at 3:27 PM\nIm the CHOSEN ONE\n\nThis was an awesome game I played 100 times over. It was one of the most interactive games Ive ever played and the use of gestures was really amazing. My dream is for this game to have hand tracking, This would truly make it the most incredible game ever. It was a perfect combination of adventure puzzle and mystery games, it made me feel like Zelda combined with Sherlock Holmes!!!\n\nHelpful | 1", "Dragon19802Jun 27 at 4:59 AM\nGood experience\n\nLet's get this out of the way, yes it's graphics are like Zelda and the weapons and even what you wear BUT it does not feel like Zelda.\n\nIts a good mix of levels but it does feel like they just put in a few unnecessary parts that really are not needed and take away from the game, The game taken me around 6 - 7 hurs.\n\nThe puzzles are easy and the god mode is fantastic I only wish you have to use the powers more.\n\nThe weapon upgrades where is a good addition really have no effect long term in the game.\n\nIt would have been nice if it had a mode where you can go back and replay any level if you wish too, add hidden parts to levels you have to unlock or put an arena mode in the game with challenges.\n\nI would say its a must play but wait till it goes on sale as 22.99 is alot for what it is.\n\nHelpful | 1", "Sunshine_55Jul 18 at 11:02 AM\nI'm addicted\n\nThis game is soo much fun! I am addicted to playing it. I cant wait until it's time to play again.\n\nHelpful | 0", "Sutty279Jul 11 at 2:31 PM\nA must play Quest game\n\nOne of the most interesting & fullest VR games I have played. Some great intuitive mechanics that make for an enjoyable game.\n\nHelpful | 0", "Skypirate77Jul 9 at 1:03 PM\nAwesome game!\n\nBeautiful and fun! An awesome adventure. Very highly recommended. One of my first Quest games, and will always be one of my favorites!\n\nHelpful | 1", "ANicePieceOfToastMay 27 at 10:29 AM\nTHE #1 VR GAME EVER\n\nIt makes me angry that people dont know about this stunning game. It is by far the most amazing game on quest. It may not have a lot of replay ability but it has hours and hours of fun. If your thinking about getting it DO IT! I couldnt want a better game. I say this is literally the best VR game of all time. Its stunning graphics make me think I am the character. I would recommend taking your time in this game and not rushing through though. The graphics are the best part of the entire experience there are so many small things that you dont notice your first time around so playing it twice is amazing. The amount of work that went into this game and there are only a few people who even know about it.\n\nHelpful | 2", "rudy86Jun 26 at 8:25 AM\nMotion sickness\n\nThis game has a great story and one of the best gameplay Ive ever played and I would give it five stars but there is one thing, motion sickness. After playing the game for 10 min my stomach started to hurt and I started to get dizzy. This isnt oculus fault though the game was one of the first games ever to be released so you have to give them credit for this amazing game they made.\n\nHelpful | 3", "Gabe_26Jul 3 at 7:57 AM\nMotion sickness\n\nThis game is amazing! No doubt about it! But, if youre prone to motion sickness, you will most likely not be able to play this game.\n\nHelpful | 1", "SILOWILLJun 13 at 7:36 PM\nJust incredible!\n\nThis game is a masterpiece. Buy it! It really picks up the pace in the last few chapters/levels. Possible the most memorable video game experience of my life so far. The developers have done such a great job here. Just awesome!\n\nHelpful | 1", "xCHAOSxHOLLOWxJun 13 at 2:31 AM\nBeautiful and amazing game\n\nThis game truly does have the feel of Zelda in VR and is just one of a kind! I love this game and I am going to go back and play it through again. I highly recommend this game if you was ever a Zelda fan... Amazing gameplay.\n\nHelpful | 1", "acesor99Jul 19 at 1:17 PM\nGreat game\n\nThis is one Of the Best vr game i ever played\n\nHelpful | 0", "PhilDchampJun 28 at 9:25 PM\nOutstanding game!\n\nOutstanding game! The graphics might be simple but the overall look is beautiful! I really enjoyed playing this game, it took my mind off covid!\n\nHelpful | 1", "sovereign620Jun 20 at 9:07 PM\n\nThis game was incredibly fun and I have no regrets spending the money on it at all. I do wish the developers would have given the option to replay certain missions after they are done.\n\nHelpful | 1", "PepeTheCactusJun 19 at 8:17 AM\nYes\n\nYes it no no\n\nHelpful | 5", "sippy_cupApr 1 at 2:41 PM\nAmazing! Truly amazing!\n\nThis game is incredible! It's Zelda type graphics are so charming, and the overall story and fantasy gameplay are what make this game stand out. It has great combat and monsters, one of the best and most beautiful environments I've ever seen in VR, a fantastic UI, and is possibly the best game on the quest right now! This is definitely my current favorite game on quest, and if you're a fan of fantasy then you should definitely get it too!\n\nHelpful | 16", "mikemagneticJul 20 at 7:50 PM\nZelda Vr\n\nLiterally like Legend of Zelda\n\nHelpful | 0", "Golden_MindJun 6 at 6:17 AM\nJourney of discovery\n\nOk, interesting point of view from a YouTuber relating to finishing a game quickly, and it's not a quote direct but I'm referencing a view made.\n\nThey said that (the room vr: a dark matter) was shorter than expected but maybe it would be longer if they didn't use the tips available. Their fellow 'presenter' said that not following tips wouldn't make the game longer but it would take longer to finish the game.\n\nI've noticed that YouTube gives away a lot of spoilers, or how to do it correctly, and this helps me personally to finish games quicker. Sometimes I wonder if spoilers ruin games but then I ask how far will I go again and again without progressing forward.\n\nI needed YouTube to finish this game and although, without YouTube, I doubt I would have ever finished it... It didn't spoil it for me, I was relieved/happy to finish the game. Next time I play this game, it'll be easier and probably I will collect more stuff.\n\nSo yeah, it'll be nicer to replay the game and correct my own missed opportunities.\n\nHelpful | 1", "Mr.ChuddlesJul 17 at 8:42 AM\nGreat game for first VR experience!\n\nThis game has a Zelda feel to it. It has a decent story and immersive gameplay. If you are just starting VR I highly recommend this game!\n\nHelpful | 0", "Puck_DavisJul 10 at 3:15 PM\nLove it\n\nSatisfying on so many levels especially for an older gamer like myself\n\nHelpful | 0", "CampMar732May 23 at 12:14 AM\nGreat game\n\nHonestly, I really wish more games were like this one! This is a fun, entertaining, but addictive game. I wish it was longer; Id pay a little more if it was longer or part two came out. One thing that I wish it had though, is like a tally of the things you have to collect throughout the game. Otherwise, this game is absolutely amazing!\n\nHelpful | 1", "AcingMauvMay 21 at 6:02 AM\nAbsolutely blown away\n\nI just finished this game and I have to say it blew me away!! The story is fun, the gameplay intuitive and with a good learning curve. It let's you choose your comfort setting, which is nice. I normally get VR sick very easily, but even I could play this game in the immersive setting, as long as I took breaks. I played about a level a day for the first half but just now finished the second half in 1 session. It's SO GOOD you guys!! The level by level build up as you get your powers does a great job at getting you accustomed to the fighting and then the second half brings it home with great fantastical environments and tying together all the fighting you've learned so far. It is just the right amount of tense and fun. 10/10 would recommend and am definitely gonna play again, maybe try out hard mode.\n\nHelpful | 0", "GoGoOreoJun 18 at 8:28 PM\nBoi\n\nWho would have thought to make such a good story and characters with the coolest monsters and just being able to be a giant god with super powers\n\nHelpful | 1", "RipkenatorJun 29 at 6:11 AM\nLovely\n\nThis game has everything you could ask for. Closest thing to Zelda in VR Ive seen yet.\n\nHelpful | 0", "Shark_finJul 21 at 12:45 PM\nGreat game\n\nIts amazing the movement is a light buggy but otherwise amazing\n\nHelpful | 0", "DarthkaVader25 days ago\nJourney of the Gods\n\nI Loves It! 1+\n\nHelpful | 1", "VR-PeanutGuyJul 19 at 9:18 PM\nPlease, replayability!\n\nYou play through the story once. After that, your save file is useless.\n\nHelpful | 1", "HackyosacJul 6 at 11:41 AM\nfun adventure.\n\nIt's like VR version of Zelda.\n\nHelpful | 1", "Raff01May 26 at 10:25 AM\nAmazing !!!\n\nThis game is VR Zelda...everything is well written and executed. It all fits together. Story, graphics, voices, pace, puzzles, musics...\nIt made me emitional when I finished the game.\nI was spellbound by it.\nEasily top 3 occulus game.\n\nHelpful | 1", "benneconstantJul 3 at 10:02 PM\nAmazing Game\n\nMy only complaint is that it is too short.\n\nHelpful | 0", "TP1001Jul 20 at 10:07 AM\nMaybe\n\n4.5 for the 15 offer 3.5 for the 23 normal\n\nHelpful | 0", "SomerandompokemonJul 1 at 8:17 PM\nNot bad\n\nThe game itself is very good. But when you finish it, you cannot do anymore and that kind of makes me sad just a tiny bit, but i enjoyed it.\n\nHelpful | 0", "PaleoFossil258 hours ago\nBest VR Game ever\n\nI love transforming into my godly form in this game and playing with my powers. The design of everything is so cool! The monsters, the gods, the weapons, I could just stare at them for hours. It's beutiful and it's incredibly fun, but it gives me motion sickness really easily. I've found myself having to take long breaks while playing to avoid vomiting but the fact that, despite this, I still sat back down and kept playing should be a testiment to how great this game is.\n\nHelpful | 22", "sdouhneJun 19 at 8:32 PM\nGreat game the Zelda of VR!!\n\nGreat game the Zelda of VR!! Lots of game play and you get to be a God really enjoyable\n\nHelpful | 0", "Fire_VortexJun 6 at 4:20 PM\nAmazing\n\nPlaying this game was like playing Zelda, the graphics were beautiful, the storyline was entertaining, and the ending was amazing. I teared up a little.\n\nHelpful | 1", "MarakmMar 20 at 7:57 PM\nBeautiful mechanics, graphics, and story\n\nAs someone who doesnt play VR daily, I played this game in my free time for several weeks. The game design is very nice. I always knew the general direction for what I should do, but the game wasnt TOO easy, keeping it very fun and taking more time to complete. It made me jump a couple of times, but in a great way, and it kept me very immersed/engaged. In spite of a lack of dialogue, I became attached to each character, and it was bittersweet to leave them in the end. I would absolutely recommend this game to anyone. In fact, itd even be a very good starter game for those who arent too freaked out by virtual reality mechanics and want a good several hours of entertainment. Well crafted, treasured developers.\n\nHelpful | 9", "TheMoonLandingApr 1 at 5:00 PM\nNot good for motion sickness but good\n\nThis game is super good and it is a really fun and unique VR game. I definitely want to play more of it, but i cant because of my extreme motion sickness. Not even the comfort settings on the game itself work for me. Im sure there are some people with a similar problem. What helps for me is what most VR games have, an option where you teleport yourself around instead of moving with your character. If that could be implemented into the game, that would be great and many people would be able to enjoy it comfortably.\n\nHelpful | 12", "NocturnalissMay 22 at 7:43 AM\nAwesome, but 1 huge problem\n\nNot even 5 minutes into the game, I got so motion sick I had to throw up. Without a teleport function, I may have no choice but to get refunded, much as the demo and what little I played have me convinced I'd love this game. The comfort settings don't suffice. I could play as long as my Quest lasted on Wizards because of the teleport function, so please think of adding one. I want to play this game, but I need to be able to.\n\nHelpful | 1", "Goldenfireball123May 8 at 9:39 AM\nAdventure Awaits!\n\nThis game has so much replay ability with all of the secrets and ways to play, with all of the freedom in the game you feel a sense of power and adventure through the whole game! Give this game a try if you are looking for a little challenge with puzzles, and adventure!\n\nHelpful | 0", "AweculusLife7 days ago\nAmazing!!!\n\nI dont right reviews often, but this game deserves a solid 5 stars. I was shuddering with the feeling of pure joy and awesomeness of this game. The power of turning into a god and slicing evil creature makes this game my favorite game on the Oculus Quest\n\nHelpful | 4", "cliffmerrellJun 2 at 5:57 PM\nGreat game\n\nFun puzzles. Good action. Fun story line. I really enjoyed this game. Reminds me of legend of Zelda. Not too challenging which I appreciate.\n\nHelpful | 0", "HiiragiDionMay 20 at 7:38 PM\nGreat game...but a bug kept me from end\n\nBeautiful and fun game, about as close as you can get to playing legend of zelda in vr! However, I experienced a bug that allowed me to continue the game without getting a particular feather/bird with the power to move lava which I could not go back and get and it wouldn't let me finish the game towards the end. There wasn't much left to see, merely 10 mins which I watched in a YouTube video, but it is just unsatisfying to get so close to the end and not being able to finish...The developers should have let you go back and replay levels to make sure you can get all your feathers and collect whatever upgrade items/eggs you could find (cause I missed an egg very early on before I realized what it was and could not go back and get it). They also should have put more roadblocks in to ensure that you cannot go to the final boss fight before you have all your feathers/God powers. Regardless of that, pros to the devs for a very fun and interactive experience! Loved the 99% of the game I did get to play to the fullest!\n\nHelpful | 1", "E.Menzel215Apr 24 at 10:42 AM\nGreat Game\n\nThis is a really fun game to play. Makes you feel like youre in the Legend Of Zelda video game. Very colorful and pretty well made. Great game if youre into exploration as well. Nice graphics good storyline. Hope everyone enjoys it as much as I do.\n\n-E-\n\nHelpful | 2", "Hawkeye4082Apr 14 at 12:52 PM\nGreat and immersive game but\n\nThis game took my breath away\n\nIt is executed wonderfully and the story is incredible. The graphics are great and colorful. The music is always a treat when I start up the game and the combat is executed well. I love the puzzle solving and all the gods and god powers are always wonderful surprises to see and use. The upgrades are always handy to use and you get used to them instantly. The final level is incredible as you utilize all your god powers weather it be fighting the boss or saving everyone. I have to compliment the world as well as I was legitimately scared to move at times or eager to explore the colorful terrain. Every enemy has there strengths and weaknesses and I love that detail\n\nThe few problems I have with this game are simple ones. 1. I wish that you could replay levels rather than having to start a new save 2. I dont appreciate how there are only two upgrades for each item as you get fully upgraded gear halfway through the game. Finally I have to point out the most common problem: the movement can make you very nauseous (I have gotten used to it though) and it can make a bunch of people appreciate the experience a whole lot less.\n\nThis game is amazing though and Im currently playing the story for a second time it was so good. Thank you so much for this beautiful masterpiece devs.\n\nHelpful | 5", "FreddyC227May 28 at 3:26 PM\nVery interesting and easy to play\n\nIt is a very interesting and fun and easy game to play. It just gives me a little of motion sickness but I got used to the game after a while of playing it.\n\nHelpful | 0", "AnnitaBonghitJun 13 at 9:59 AM\nBeautiful vibrant game\n\nIt's almost like playing a VR version of Zelda. Awesome game can't get enough\n\nHelpful | 0", "MetalNekomataApr 29 at 12:50 AM\nUniquely beautiful.\n\nThe artists truly make a simple color pallete and basic shapes that immerse and captivate you. I felt pretty enthralled with the way they deliver the story and it was fun the entire way through. The only thing negative here is the somewhat short play time. The price is fair for the experience.\n\nHelpful | 1", "Ulfric2008May 31 at 6:42 AM\nLove this game!\n\nI almost didn't buy this game because the demo doesn't even come close to showing how fun it is. The combat is truly addicting.\n\nHelpful | 0", "anonymousqwertzJun 7 at 10:58 AM\nGreat game\n\nIf you want an immersive RPG, buy this game. I dont think I have to say anything else.\n\nHelpful | 0", "PurpleOnionMay 10 at 6:09 PM\nMy favorite!\n\nI thought I wouldnt like this game but I played the demo like everyone and loved it. The best part is how the more you play the better it gets! Would strongly recommend as I have tried a bunch and this is the best!\n\nHelpful | 1", "MisterJW2Apr 8 at 2:47 AM\nI approve it!\n\nAs with many VR titles I had mixed feeling at first. Mainly because of the demo version which is in my opinion weak / mediocre. After I went through the tutorial level (which is almost like demo version) I fell in love with everything. Graphics are quite bizarre jet interesting, slaying monsters is satisfying as heck, story is shallow but engaging. During the entire gameplay I was never bored!\n\nThis is fine addition to my games gallery and it should be in others as well.\n\nHelpful | 2", "RMJ67Apr 25 at 3:43 AM\nAmazing VR experience!!\n\nJourney of the Gods is a GREAT GAME for a VR beginner or Pro! Ive only just begun playing and Journey of the Gods has already caused me to loose hours just drawn into the game and it KEEPS GETTING BETTER!!!! Give this game a try!!! You wont regret it!!!!!!!\n\nHelpful | 1", "BuddhaRickJun 27 at 10:16 AM\nI am a huge RPG fan.\n\nThat being said this is a very cute kids game.\n\nHelpful | 0", "ohad.maromJun 27 at 9:39 AM\nFun game...\n\nNot my top ten... But fun to play\n\nHelpful | 0", "AxallApr 4 at 10:18 PM\nA great, one time experience\n\nThis game has a ton of charm and enjoyed the experience throughout the whole game, but the lack of content and the catch when you beat the game left me feeling like I had been cheated (jump to \"The Ugly\" to see why)\n\nThe Good:\nThe art style and music are charming and give the game its unique style. Combat is smooth and simple. The abilities you gain throughout the game are unique and interesting, while only used in niche situations. The worlds you explore all have different themes and provide a decent amount of variety to the game. I found it challenging and engaging exploring each of these worlds for upgrades to my weapons and powers. And the last level is a great way to end the game, no spoilers for how it goes, but it was amazing and the feeling of conquering the last area gave me a feeling of accomplishment. The overall experience was very polished and complete. But...\n\nThe Bad:\nEnemy types are lacking. While bosses are unique and engaging, the basic enemies you encounter feel repetitive after a while, and honestly fairly easy to beat (and I played this game on hard). I wish that enemies became harder or at least gained a few more mechanics throughout the game. The hub area you explore in between missions is WAY to big for what it offered. Looking back I can see why it was so big (no spoilers), but it was a pain visiting every place to get upgrades for my gear. The game is also fairly short, only 7 hours long\n\nThe Ugly:\nYou cannot replay previous levels. This is an EXTREMELY poor choice on the developer's side. This almost completely destroys the point of trying to find all the secrets in the levels. And when you beat the game, you CANNOT go back to play levels. If you try to play a game file you've beaten, all you get is the final cutscene. THAT'S IT. If you want to replay any levels or search the levels for secrets, you need to start a new game file. THIS is the reason why the game left such a bad taste in my mouth. The thrill of searching for secrets is gone.\n\nHelpful | 11", "theshorthipanic_yani14 days ago\nThis is one of the best games yet\n\nThis is very immersive and is so much more than I thought it was. The levels are actually longer than expected. The company who made this game, props to you! Make more games please!!!!!!!!\n\nHelpful | 0", "ChefAnthonyyMay 1 at 12:00 PM\nZERO replay-ability (literally)\n\nIll try to keep this spoiler free\n\nThe campaign isnt great. There are only 9 levels if I remember correctly, but there are probably less. Each level makes you solve som puzzles using the power you gained from the last level, which gets very repetitive. Mix in some monster spawn regions and a few on-rails shooter sections and you can duplicate the campaign of this game. There are upgrades, but the game gives everything to you by the last boss battle. This game plays with the bosses pretty safely, but theyre not easy. The ceiling gang squid is the second to last level, and could have easily been the final boss due to its difficulty spike. The game also has a numerous amount of bugs. When I was playing through the last section of the last level, (spoilers) all of the NPCs that you have to save disappeared. I had to restart my game, and I lost all of my progress in the final level. The biggest issue though is the save lock. After you beat the game on one save, you cant go back and replay it. The save gets locked in the final cutscene. Overall, I wouldnt recommend this game. The game has difficulty spikes, numerous bugs, and a really bad save lock feature.\n\nHelpful | 5", "phylum_sinterDec 13 at 6:08 PM\nThe Demo doesn't do it justice!\n\nHOLY SHNIT, i completely undervalued how much fun this game is, how clever and simple it is at the same time, how gorgeous and vast it can be based on the demo alone.\n\nDemo? Yeah if you haven't yet noticed, there is a Journey of the Gods demo... and it barely scratches the surface of the full experience. I wish it ended with a slideshow of the different levels and everything you can see, because the impression the demo left me with was a \"how is this a $30 game?\", thinking it would all be based around saving tiny people with my simple god grow-trees power, crossbow and sword.\n\nThe good news is that the demo doesn't show even 10% of what you'll see in the game. Some of the levels are much more detailed than that first farmyard in the demo, they have different mechanics, there's a boat ride at night and a level that is purely tower defense with magic powers -- and the god powers you get later in the game are so much more fun to use than the two you get in the demo.\n\nI passed this game up almost solely on the demo and price of the full game, and i'm betting a lot of us did. But if you're at all aching for a \"full game\" experience, we may have to adjust our budget gauges. Yes, this game is more expensive than a good half of the stuff on the store -- but let me assure you that the budget of the game, the quality of the experience and for people like me who all too often equate game length with value, it wins that one too. I'm a good 5 hours into it, and the game tells me my save is at 33%.\n\nThe game has everything you'd expect from a full game - upgradeable weapons, exploration, a wide variety of levels with varied objectives, great art and sound. In conclusion -- if you've run away from this one because the demo didn't have you smiling from ear to ear, still try the full game, because it's the most complete Action Adventure game i've played on the Quest even this far into it, and every time i put it down i hope they make a sequel. Recommended!\n\nHelpful | 532", "wolfhunter1224May 12 at 2:50 PM\nLegend of zelda VR\n\nI love this game its so fun its preaty much legend of zelda in VR\n\nHelpful | 2", "WalmartWayApr 19 at 11:50 AM\nVery fun must buy\n\nThis game is a must buy. It is so fun to play every single time and it probably uses most of my battery too. If you have not gotten this game yet, then please consider buying it.\n\nHelpful | 2", "Spike3o0oFeb 6 at 12:00 PM\nA Must Own for Zelda Fans!\n\nJourney of the Gods is what you would get if you blended Zelda with Oculus Rift's Asgard's Wrath. It mixes Zelda like combat and graphics with the added bonus of morphing into God mode ala Asgard's Wrath to give you and experience that's 2nd to none on the Quest right now. If you can only buy one game on the Quest this gets my vote as it's Taylor made for the platform. Highly recommend!\n\nHelpful | 22", "longshot08137 days ago\nGREAT GAME\n\nThis is a very good game but I dont really suggest it for new players because it can cause some motion sickness but overall a great game\n\nHelpful | 0", "TacoGames_YTJul 16 at 2:43 AM\nBruh quality vibes\n\nI wasnt expecting to have this much fun playing a story based game I really think you guys should give it a try even if you dont usually play these games and so what I say still buy it because if you dont like it just refund it! At this point I have no idea why your still here buy the da## game...\n\nHelpful | 0", "Morrow_AzureJul 16 at 10:41 PM\nFlawless. Zelda mixed with Tribal themes\n\nYou have a sword, shield, and bow. Every combo you could do in real life, is fully translated into the game, even at high speeds. 1 to 1 aiming with the bow as well. Never had any problems with aiming. The shield works well but because of how fast paced you can make the game, I usually just DODGE instead of blocking with the shield.\n\nThe art and music in this game is phenomenal. If you ever wanted to feel like an action hero, this game is perfect for that. Very immersive.\n\nNever have any bugs or problems in the game. This game is a MUST buy and I really hope this gets a sequel. It deserves one, 100%.\n\nThere's a \"God Mode\" but I'm not going to go into what happens with that, as it really is best left to experience it for yourself. (Its awesome.)\n\nWell done to the devs for creating such a masterpiece.\n\n100% must buy and play. Try out the demo first, if you are skeptical. You won't be disappointed.\n\nSide note: if you walk/jog in place and play this in roomscale, it makes a good workout.\n\nHelpful | 0", "5tanMar 27 at 9:09 PM\nDont hesitate\n\nThe demo already had me, but the game was a little on the expensive side for me. Now its on sale.. PEOPLE THIS IS A MUST HAVE! The story is great the gameplay is amazing everything is just great!! The god mode makes you feel so powerfull everybody should have this game! By far my favorite of all time!!\n\nHelpful | 2", "HotBushMeatFeb 21 at 12:29 PM\nSo worth the money\n\nI love love love this game. Its fully immersive, and the graphics and colors are perfect to the point to where you can play for hours with no discomfort. Im probably 1/3rd of the way through the game, and I have invested many hours. This is the kind of game that you pick up and play when youre not sure what you want to play, and before you know it, youve been playing for hours. You just get lost in a good way.\n\nHelpful | 10", "Cinderheart52May 3 at 2:24 AM\nGood game\n\nReally good but, you cant go and replay levels, which means you cant collect all of the upgrades. Other than that really good game\n\nHelpful | 3", "Happybullfrog25Apr 23 at 11:03 AM\nLove this game\n\nThis game has scales of heights. And you can upgrade equipment too. And get different abilities. The music is not so bad either\n\nHelpful | 2", "Critical_Joe24 days ago\nWow\n\nMy oh my I only played the demo so far and wow the game is just so vivid and I loved it so much. Mom said she would buy it for me to play the next day (today) but still the demo itself was amazing.\n\nHelpful | 0", "DragonDefendersMar 7 at 12:11 AM\nReally Good Game\n\nThis game is actually way more fun then the demo. It involves some puzzle solving but you also get to fight monsters. I also think the design is amazing. When you hatch the birds from the eggs they have really cool designs. I would recommend this to you if you like fighting and puzzle solving.\n\nHelpful | 4", "RaizleMay 18 at 1:24 PM\nFun experience\n\nI enjoyed the game quite a bit there are some collision issues when entering God form that made things difficult but otherwise a very solid and fun game\n\nHelpful | 0", "Deadpool2896Apr 3 at 12:18 PM\nWow!!\n\nThis game has a lot to it and its so much fun to play. The story is really nice and easy to follow, the characters you meet are funny, and the gameplay is a ton of fun. Great game for everyone to play!\n\nHelpful | 2", "Rayray072315 days ago\nIts Zelda on the quest\n\nIm in love with this game Ive always loved the Zelda games and for this to feel like Zelda but in VR its absolutely amazing\n\nHelpful | 0", "Mr_BeastOApr 9 at 11:45 AM\nSuper Dope!\n\nWith all due respect to the creators of the game. Im not sure if they were fans of Zelda, but man this brings me back to Zelda on N64. Feels like Im playing that game but in person. Super Dopness!!! 10 stars in my book. Highly recommended.\n\nHelpful | 1", "Pilotpup7Feb 23 at 2:35 PM\nAmazing game\n\nThis game is amazing in its exploration, combat mechanics, and its unique graphics. The game emerges you into a fantasy world where you have to protect you village, eggs etc. overall the games animations and mechanics put me in awe. I recommend this to everyone, it is definitely worth the money.\n\nHelpful | 5", "BananaPoet14Apr 16 at 11:18 PM\nAMAZING GAME\n\nI love the adventure in this game! It was so much fun to save villagers and fight off evil. I would definitely recommend this game!\n\nHelpful | 2", "greenelf91Apr 1 at 4:52 PM\nZelda esc puzzle sword fighting game\n\nShort, sweet. If you have a quest there should be a demo for this, there is probably like 8 god powers like the tree one you get from the demo\n\nUnlike Zelda where your tools get used often. I find I only use certain god powers like.. once or twice in the entire game\n\nSome puzzles can be a bit confusing and took some googling but\n\n\nAll in all solid game, wouldn't pay anything more than 25 bucks for it tho.. probably a 6 hour game\n\nHelpful | 2", "acethebaseMay 1 at 4:56 AM\nIts ok...\n\nNow I dont know if the bugs have been fixed but there was so much bugs I couldnt get past the level where you fight the octopus or something because the lightning wouldnt work. But Very good game overall.\n\nHelpful | 1", "BlazekinzzJul 4 at 3:50 PM\nNear Perfection\n\nIm a relatively new virtual reality player, and this game takes the cake I knew it was going to be good from the demo but this game was a amazing experience! Cool weapon upgrades, mobs and bosses, visuals and story. And hours of Zelda like gameplay! Dont regret my purchase\n\nHelpful | 0", "mr.sandman222Feb 29 at 12:44 PM\nThis is a really good game\n\nThis game is very good and the puzzles leave you thinking really hard. There are also a bunch of god things that you can you can do that I think makes it way more fun. The Demo only shows the most simple power so don't judge it by the demo.\n\nHelpful | 5", "astorer37Jun 28 at 3:07 PM\nA true vr masterpiece that is a must buy\n\nI really wanted this after playing the demo as the gameplay was unique and the combat was fun, then I finally splashed out and bought the full game and was surprised to discover that it has so much more to offer including different arrow types and god powers as well as a weapon upgrade system that makes the whole experience so enjoyable and I found myself smiling the whole time I was playing, I cant recommend this game enough even at full price and I hope that everyone buys it so we can get many sequels!\n\nHelpful | 0", "SaltyShaker728May 16 at 3:58 PM\nIncredible\n\nThe last level blew my mind. Also to those with of you having trouble with lightning bolts, I found that dragging them at an angle with your wrist pointed up is more affective, also dont drag the bolt into the ground, keep it at the surface.\n\nHelpful | 0", "MaynardthecatJan 28 at 11:11 AM\nConsole quality\n\nJourney of the Gods is a proper adventure game where you complete levels using a sword and shield along with a crossbow. You use your weapons to defeat many different enemy types through linear levels and solve the occasional puzzle. You are also given god powers that give you an aerial perspective of the area around you and those powers give you various abilities to solve puzzles and defeat enemies. The game starts off slow but as you reach the later levels and get deep in to enemy territory the game takes a darker turn and the visuals are great in VR. Journey of the Gods is the most complete console like game I've played on the quest so far. It took me around 5-6 hours to complete.\n\nPros\n-Great enemy design\n-Visually pleasing\n-Console like experience\n\nCons\n-Little replayability\n-Power ups and some abilites are underutilized\n\nHelpful | 12", "ChkenNugsMay 2 at 3:28 PM\nSo far so good\n\nIm only 11% into the game and Im already in love I highly recommend\n\nHelpful | 0", "Jayfox199018 days ago\nSome ascension required\n\nAs is the common comparison this game is a Zelda like vr game however some of the late game is buggy and abit upsetting falling off the area your fighting in and having to restart your multiphase battle over again when you still had lives left over. (You know who you are) the ending could have used more validation for your journey its unclear what becomes of you.\n\nI bought it when it was on sale and im glad i didn't spend $30 on it.\n\nHelpful | 0", "kristian.boekerJun 21 at 10:42 PM\nVery Very very cool!!\n\nThis game is a blast! Its like Zelda but first person, swing your sword, shoot a crossbow, explore, kill crazy creatures. I thought it was cool they had three different save files and A bunch of settings like easy normal hard, left hand right hand options, stuff like that. The only thing I wish it had was jumping, But that doesnt Really matter at all. I also think it has high replayability value. I have only played it for an hour so far . Super fun and challenging.\n\nHelpful | 0", "The_GAMER10May 27 at 4:03 AM\nThe definition of a hidden gem\n\nAbsolutely incredible.\n\nHelpful | 0", "Asiancorg12 days ago\nSo far so good\n\nIm played little over an hour of the game and so far Im impressed\n\nHelpful | 0", "dariusmusicJan 3 at 7:40 PM\nVR RPG AMAZING\n\nIf youre looking for a VR adventure RPG thats not an easy 1hr play through, THIS is your game. Bought this about 2 months ago but its challenging I had to take breaks from it. Was certainly worth the money and also this is a game you can play sitting or standing up equally. Games like Journey of the Gods are the reasons I bought a Quest. 9/10 rating.\n\nHelpful | 29", "RustyToothpasteMar 16 at 8:03 PM\nAmazing\n\nI recommend this game the demo dosnt do I t good and I love this game I never not had fun while playing the game and it's very beautiful the game start to finish I a new experience and I could not recommend this game enough. But this game you will not regret it trust me\n\nHelpful | 1", "Harcourt.MuddApr 3 at 10:30 AM\nIt's like a VR Zelda!\n\nLove this game! Great combat, great level designs, great story.\n\nCurrently playing through again to try and find all the hidden powerups. Just as fun as the first playthrough!!\n\nHelpful | 1", "fantombikerApr 24 at 6:42 AM\nAwesome experience!!!\n\nReally subversive experience. Challenging and entertaining. Love it!!!\n\nHelpful | 1", "cameron.white.1996Feb 22 at 5:44 PM\nWOW!\n\nThe demo is NOTHING compared to the full game. If there is someone who is skeptical about spending this much on a game, its me. Im not a gamer, by any means (except for the Sims), but this is totally worth the money. Crazy graphics. Its entertaining and challenging. This game is really worth the $30.00 if you have it to spare!\n\nHelpful | 2", "CrystalCorgiMar 17 at 11:44 PM\nBeat it\n\nI beat the game and i loved it but i found a glitch that you guys should fix with the last bird where i mad a pile over a barrier where the leadgr is and i glitched over it by making huge sand pile to a point it shoved me out and i had replay everything\n\nHelpful | 1", "thewilsonixMay 23 at 3:43 AM\nGood story\n\nSlow start\n\nHelpful | 0", "kileyffMar 7 at 3:20 PM\nI need help!!!!\n\nSo for the level where you need to move the lava around the end I didnt end up collecting the feather because I used the sand to get into the tunnel left to the lava. So now at the end I cant finish the quest where the guy wanted you to get fire. So is there anything I can do??????????\nBut anyways its a good game lol\n\nHelpful | 1", "KiwiUnderollMar 30 at 10:19 PM\nBest Vr game I have played yet\n\nThis game is amazing, the exploration is so fun. I wish it a little longer. There are some bugs but just restart the game and it fixes itself. Over all outstanding game.\n\nHelpful | 0", "REAPERebornMar 11 at 9:59 PM\nWow!! Just.. Wow!\n\nThis game is definitely a must for anyone who has a VR.. The demo does it zero justice. There's so much more to it. Don't hesitate buying!!\n\nHelpful | 3", "cantennaFeb 15 at 5:09 AM\nYes, Yes, Yes, Yes, Yes, Yes, Yes, Yes,\n\nTotal immersion and such a great experience....\n\nMake a sequel please (or just any other RPG adventure like this on the Quest..)\n\nIt was soo good. I've bought pretty much the whole catalogue and I have to say, this was a fantastic VR experience on the Quest... EPIC! Sad its done but will definitely play this again.\n\nHelpful | 2", "skullflashFeb 14 at 4:35 AM\nOverlooked Gem\n\nI tried the demo a while ago which was good but the full game is wicked, this is now one of my top titles.\nIt has a great mixture of first person, Zelda style and a god sim.\n\nThe sound of electrical crackles when you wave of your sword is pretty satisfying when cutting up your foes. Really vibrant environments and plenty of freedom to explore.\n\nThanks Devs.\n\nDon't miss this often overlooked adventure. :)\n\nHelpful | 1", "SicariusIgnisApr 14 at 5:22 PM\nHella fun\n\nIts so much fun striking down my foes with the wrath of the gods\n\nHelpful | 1", "mattmaticMar 10 at 6:48 PM\nI love this game!\n\nI really liked the demo but the full game is amazing. I can tell that I'm getting close to the ending and I don't want it to stop. Great job guys!!! \n\nHelpful | 2", "Estephens2002Apr 10 at 8:07 AM\nThe name fits the dam title\n\nThis game is godly its better than super hot 10 out of 10\n\nHelpful | 1", "VINIOApr 16 at 12:56 PM\nGreat\n\nSum it up in 2 words Zelda VR\n\nHelpful | 0", "TaderFamilyMar 30 at 5:48 PM\nAMAZING\n\nI love this game! Beautiful, fun, challenging to an extent! And very evolving. Very enthusiastic two thumbs up!\n\nHelpful | 1", "BrostoyevskyFeb 26 at 12:26 PM\nRegretful purchase\n\nThis review is coming from a person who never played Legend of Zelda before (which I see very often referenced in other views), with around ~5 hours of gameplay and 44% game completion.\n\nI would've rated this game 5 stars as well if I would've written this review with just 2-3 hours of gameplay. However, not very far more into the game, you realise just what a poor decision has been to buy it.\n\nYou encounter very many issues with collision boxes (i.e. you hit something and it not registers) which is especially a massive issue when you're in God Mode and you want to strike something with lighting. What makes it worse is that regardless of whether the hit registers or not, your belief (i.e. mana) is still being charged an x amount for each lighting bolt. While this usually happens with lighting bolts, it does sometime happen with other attacks as well.\n\nThis would've been a little more bearable if you weren't stuck in an amazingly narrow way of how you should play this game and what you should do. \"Have to teleport an old man out of a cage and the only intuitive place to do so is the literally large land a few meters from the cage? No, you absolutely can't do that for reasons, teleport him on the tree on which the cage is hanged.\"\n\nAlso, the atrocious interplay between the two issues mentioned above is that very many times you're put in an awkward position in which, for example, you have to destroy something with a lighting bolt, but the hit doesn't register and you assume you might need to do it in another way, but just after a while you realise you just have to spam lighting bolts until something connects since there's no other conceivable way to achieve the said objective.\n\nThere are nice things that can be said about the game, sure. There are many things which are done alright and which are nice. But at least for me, the issues which I talked about were simply too frustrating to enjoy the game. They really sucked all of the enjoyment from my experience.\n\nHelpful | 19", "ian.shaffettApr 18 at 8:51 PM\n\nVery fun game!\n\nHelpful | 0", "sagi77Mar 25 at 10:17 PM\nI love this game\n\nClosest thing currently to a VR RPG on the quest to my knowledge and has high replay ability. Overall amazing game would recommend.\n\nHelpful | 0", "LDCO07Feb 5 at 7:44 AM\nTOTs love it but it is a little short\n\nThis game is totally amazing the graphics, the story line, and the fighting. But I do have some problems: at first I was a little motion sick but I got over that real fast, the game is a bit short, and the final boss is pretty hard and it takes super long to kill but it might just be me tho. Other than that this game is completely AMAZING and I would totally recommend it\n\nHelpful | 2", "SmilecentaurMay 26 at 11:07 AM\nGreat Game play\n\nI spent a good couple hours playing this game. The way the mechanics work makes it really fun to play in vr and makes it feel more like you are appart of the world. And even with the low res models it is a beautiful world. The birds themselves arent all carbon copies of each other either. I loved this game and would highly recommend it to others.\n\nHelpful | 0", "SquareTreasureApr 28 at 2:20 PM\nGreat game\n\nFun but cant replay levels...\n\nHelpful | 1", "JophesSpreasFeb 24 at 6:14 PM\nZelda Like Fun\n\nThis is an excellent VR game that reminds me of Zelda in visuals and game play. Swing swords and shooting crossbows while solving puzzles makes for a fun and immersive experience.\n\nHelpful | 1", "chinesetoesellerFeb 29 at 9:42 PM\nBEST GAME EVER\n\nThis game is the best game I have ever played it is perfect for anyone with any type of play style for example, I am more of an pvp and pve but this game change how I viewed puzzle games this is THE GOLDEN BUZZER OF GAMES!!!!!\n\nHelpful | 1", "KingDodoki3000Jul 15 at 5:00 AM\nAmazing\n\nIts great to have Zelda vibes\n\nHelpful | 0", "elliot_is_beansMar 18 at 10:37 AM\nIts perfect and really fun\n\nI was not expecting this game to be this fun. Its beautiful its not repetitive the fighting is perfect and the puzzles are fun.\n\nHelpful | 1", "DudeCoganMay 8 at 10:35 AM\nGood game, bad devs\n\nThis game has an amazing story. The story is longer than in most games, but that's just to justify the fact that it has no replayability. Also, the devs have never ever responded to a comment. To the devs: please prove me wrong.\n\nHelpful | 21", "FwakJan 20 at 4:50 AM\nExcellent!\n\nRPGs are not my thing, never played Zelda etc. Loved this game! Couldnt stop playing, and when I finished went straight in and started from the beginning again.\n\nArt style works great, combat is very satisfying, levels are good with nice variety, story, characters etc everything excellent. Runs perfectly smooth as well!\n\nI imagine this is a slightly simplified more linear RPG, more mass market, which for me is perfect\n\nHelpful | 3", "Kentalon1981Jul 2 at 6:04 PM\nOne of the best games for vr\n\nI tried the demo and fell in love with this game. It does have a Zelda windwaker feel to it.\n\nHelpful | 1", "Autumn.SkylightMar 18 at 7:25 PM\nMotion Sickness, refund rejected\n\nPlayed it for maybe 20 minutes, and it made me SUPER motion sickness. Even after I took of the headset, my sense of balance was thrown off and the room was spinning for hours. This has never happened to me before with any game... so, after paying $30 for a game that I have no desire to experience again, I requested a refund. Rejected. No clue why, but it's not right. Disappointed.\n\nHelpful | 10", "Mr.NukinfutserJan 20 at 2:17 PM\nVery fun but can be disorienting\n\nThis game is really interesting, it reminds me or Legend of Zelda because of its art style and enemies. But, if you are new to vr this could give you motion sickness. If you start to feel any symptoms stop playing. Its better to play for short periods (15 minutes) at a time to get your vr legs before you go hard. But overall amazing game, cool concepts, and pleasant graphics.\n\nHelpful | 3", "HavenPMar 24 at 5:57 PM\nENCHANTING\n\nWhen I first stepped into this game I couldn't believe my eyes, and it only got better.\n\nHelpful | 0", "ken.hutchJan 30 at 12:03 PM\nGood, one big issue though\n\nThe game looks good and is enjoyable to play.\n\nMy only issue is that the power up items are not really options once you get near the end. So if you play the game without searching every nook and behind every rock, once at the end you will likely not be strong enough to win. I did not immediately see a way to go back to previously beaten areas so failing to spend the time to look everywhere ruins the end game. I started over to be able to find everything, but it gets boring trying to cover every inch of every level.\n\nHelpful | 4", "goodbyeDeskJan 30 at 11:33 AM\nTotally worth it\n\nIt's true what everyone has already said about the game:\n-The visuals are stylishly and at times brilliant\n-The game play is Zelda-esqu action packed fun\n-The puzzles are simple but are great for the pacing\n\nMy main aim with this game was to get an action adventure feel I was use to in console games in a VR experience AND I GOT IT! I played about half hour at a time and must have pick up and jumped in about a dozen times.\n\nThere is an adjustment period for the VR comfort but you will get passed it.\n\nHelpful | 4", "PapobotApr 7 at 4:27 PM\n\nIt was good\n\nHelpful | 1", "im.oliviaJun 22 at 9:19 PM\nYeah its a fine game.\n\nI just bought it a few hours ago, and I got my oculus like 4 days ago. Its not the best game, but its still pretty good!\n\nHelpful | 0", "garciaalychaMar 24 at 6:03 AM\nYes\n\nYes good game and i really like it and i will give you something a 5 star rating\n\nHelpful | 0", "VanceTheWeebJun 12 at 10:18 PM\nGreat but one problem\n\nIts super fun and there is a lot of gameplay but the only thing I dont like is that most of the fighting has to do with projectiles and not a lot of hand to hand combat\n\nHelpful | 1", "DrywallJacksonMar 13 at 11:38 PM\nBest game I know of on Oculus\n\n...although I haven't played all that many. I'd love it if there was more replayability, but it's fine as a once-through game too.\n\nHelpful | 1", "tim.cassidy.56Feb 25 at 9:40 PM\nMuch better than the demo\n\nI tried the demo 6 months ago and wasnt interested. Without anything else to play, I decided to chance a purchase. I wasnt disappointed. Its the most engaging game Ive played so far.\n\nHelpful | 2", "TheGamingDragon178Mar 7 at 3:51 PM\nJourney of the gods\n\nGet it!\n\nHelpful | 4", "King-Ry-RyJan 19 at 10:02 AM\nBasically VR Zelda...ITS INCREDIBLE!!\n\nLike most people I got really excited about this game When I saw the trailers. The price tag looked a bit steep in comparison to the rest currently in the store and so was a bit hesitant at first. Most games in the store dont usually give a very long experience and so I was uncertain this would deliver a game length worthy of its price tag. I went to check out the demo first. This gave me a good sense of the amazing mechanics of the game and the world it was set in. But the level seamed very short and gave me the impression that the full experience would be brief one. I left it alone for a few months and decided to go for it after reading some reviews explaining how the demo didnt do it justice.\n\nIm so happy I decided to go for the full version as its easily one of the best games on the quest so far!! And that demo level was a fraction of what the level in the real game actually is! This game is basically Zelda in VR and its incredible! The mechanics are smooth and weapons feel great to use. Especially the crossbow! In the demo the God state felt a bit gimicky but in the full version it brings great variety and tactical choice to the puzzles and monsters you encounter in the game. The puzzles are again very Zelda like which is great! Never bog down the pace of the game and satisfying to complete. The monsters that you come up against are wonderfully varied and put up a good fight when theres a few of them. What I like most about them is the sound design! Some of the most incredible noises they make really add scale and atmosphere to a fight. The big walkers that tower over remind me of the walkers in half life 2 and sound so good! Well done to whoever was involved in that.\n\nThe level design is also very impressive and varied! And start to get really trippy towards the end levels. They are open enough to make you want to explore but are tight enough that you dont feel like your wasting your time exploring. The colour scheme and art style are perfect for the Quest. The colours are bold but not too bright so they dont become fatiguing on the eyes. They help give a comfortable experience to quite an action packed game. The art style is beautifully simple and full of character without feeling dumbed down. Its the kind of design thats perfect for the Quests limited processing power which I hope other developers go for in future games.\n\nTheres not too much text reading when interacting with characters which is great as it lets you get on with the fun stuff! That said the story is light also, its enough to give flavour to the world and a sense of purpose In The game but doesnt dump heaps of info on you that you have to remember which Ive always found too much in other games.\n\nAnd finally the length of the game is exactly what I was hoping for! A well fleshed out lengthy adventure thats well worth the asking price. Sure Id always want more levels, but as it is, it doesnt disappoint. The game is well polished and deserves more content for it in the future. More like this please! Lots more!\n\nDEVELOPERS\n\nApart from the strange ending this game is amaze balls!! Please please make a Journey Of The Gods 2 with a good 60 hrs of gameplay!! Id happily pay 50 or 60 for an epically long sequel! Like our favourite classic adventure games we all used to play. \n\nHelpful | 8", "Marine4305Mar 24 at 8:23 PM\nSo far so good\n\nUpdate 3/24/2020 - So I finally finished the game and man this isn't fair. I want more. This was a crazy whirlwind of a ride. The story line was cool, the puzzles are just challenging enough to keep you guessing and then when you figure out what you're supposed to do you're like, ahhhhhhhhh I got it lol. I can't wait for your next game. Please bring us something soon to help pass the time with this whole Covid-19 thing going on. Thanks for such a great game and your hard work.\n\nOriginal Post -\nI'm extremely new to the Oculus Quest and VR gaming overall and so far I'm extremely impressed with the visuals of this game. I truly hope that other developers take note of what it requires to have a game that's actually worth the price tag they are using. I would suggest watching a few YouTube videos to help with motion sickness as this game has some really cool movement but if you aren't aware of your surroundings it can make you feel a little nauseous. Play the demo and if you like it, then I'd jump in a buy it.\n\nHelpful | 3", "questloverJan 25 at 3:10 AM\nWow, just wow\n\nThis game is absolutely phenomenal, everything about it is great, the graphics are relatively simple but fantastic aswell, the gameplay is flipping fantastic and impossiblie immersive, but in my opinion the best things about this game is number 1 the voice acting is great and the god mode when you can grow and shrink trees and lunge crackling bolts of purple lightning at evil enemies below, it's just fantastic, keep up the great work guys\n\nHelpful | 4", "JimmmertunMay 22 at 8:10 PM\nLove this game!\n\nI would totally recommend this to anyone new to the oculus quest looking for a good adventure-type game. I haven't played the game in it's entirety but so far, it's very good! If you are new to the quest, this is definitely the game for you!\n\nHelpful | 0", "R0R_GuyMay 28 at 1:10 AM\nGreat game I just have one probem\n\nWhile this game is beautiful and amazing, to me the ending seemed a little anticlimactic, being earned about a difficult boss the only has two attacks, and then not being able to replay through the levels and finish unlocking items without creating a new save. Other than that its a wonderful game.\n\nHelpful | 0", "IMRAJSAN02Mar 19 at 5:11 PM\n\nIts a great game, but theres nothing to do after you complete it. And there should be more upgrades for the weapons. But other than that, I love it\n\nHelpful | 1", "TheDarkSide519Dec 31 at 6:59 PM\nAmazing\n\nI'm not that far into it but from the first few minutes I was in love it's just beautiful the controls are nice and eas. It really feels like a zelda game like another review stated but has a really cool god mode mixing up the play style I know I look silly irl but in game I feel like a warrior. Seriously this game is my favorite on my quest honestly\n\nHelpful | 4", "Michael10504Mar 27 at 7:02 PM\nLook at the stars\n\nIt says it all\n\nHelpful | 0", "Toasty_GambitMar 21 at 9:20 PM\nLove it\n\nThe abilities are really unique and fun\n\nHelpful | 0", "LoudWRDMar 27 at 6:15 PM\nOmg\n\nAmazing\n\nHelpful | 0", "UltraWolfLIVEJun 12 at 7:45 PM\nReally really good\n\nThis game is really amazing with combat and god forming, and it has really amazing birds, and a cute owl you can pet\n\nHelpful | 0", "DogePowerCZJul 3 at 6:41 AM\nYe\n\nYes yes yes\n\nHelpful | 0", "avrg.boiFeb 16 at 8:16 AM\nA BEAUTIFUL game\n\nI had only seen the trailer and the screenshots of this game and knew Id enjoy it. Holy mole though this game is a lot of fun! This game has it all! Compelling story, fun gameplay, charming art!\n\nHelpful | 0", "AriziaMar 22 at 4:49 PM\nawesome!\n\nabsolutely beautiful.\n\nHelpful | 0", "CameraLenzFeb 16 at 7:40 PM\nIncredible! Soooo original and Immersive\n\nThis game is like nothing Ive ever experienced before. The graphics are amazing and it is so much fun. One of the most original games Ive ever played on any gaming system, let alone oculus.\n\nHelpful | 0", "Stuntmanmike52Mar 2 at 6:14 PM\nBotw for the Quest\n\nGreat game with wonderful graphics. Definitely a must have for the quest. If you get motion sick play in comfort mode.\n\nHelpful | 0", "Jack_1213Jun 23 at 12:37 AM\nGreat game\n\nNothing to say. Just a seriously awesome game\n\nHelpful | 0", "Ominous_Jun 29 at 7:36 AM\nPretty good\n\nThis game is very charming. The art style is comfortable and gorgeous. The levels have variety and the action is always immersive. There are puzzles for those who are interested in them too. This game is incredibly polished, fun, and has something that nearly everyone will admire. However, an issue I have is that this is a one time experience. Your can replay through the game, but not certain levels, which is quite annoying. The story mode is the only mode there is which means this game is just a one time experience. I dont think its worth 23.\n\nHelpful | 2", "ABSOLute5150Feb 5 at 10:47 PM\nAbsolutely one of the greatest\n\nThis game is so amazing the story and art work combine to make a truly remarkable experience. If youve ever wanted to play a story driven rpg in style with your sword, shield and bow this is a must buy definitely in the top 5 for me.\n\nHelpful | 0", "Grand_Admiral123Jun 12 at 4:01 PM\nGreat game great story\n\nI love a good game with a nice story and this game gives both.\n\nI highly suggest the game\n\nHelpful | 0", "Fireboy678Jun 10 at 11:08 AM\nI love it!\n\nThis is an awesome game. A game you can play while sitting down which is nice at times.\n\nHelpful | 0", "djmas4444May 29 at 12:55 PM\nBlaaaaah!\n\nThis game is a fun and very unique idea, but the motion sickness is off the charts! I feel like puking, and Ive only ever had motion sickness twice! Its a great game, but if your going to play it, sit down and change the settings.\n\nHelpful | 0", "imwithno1Feb 9 at 7:19 PM\nMan, the demo is nothing!!\n\nThe demo only compared a fraction of what you can do in the game. The full game is very satisfying and it has very cool and interesting graphics. 5 stars, would recommend for quest owners.\n\nHelpful | 1", "EatThatPasta445Jan 3 at 6:08 PM\nJust Wow.\n\nThere was so many occasions in this game where my jaw dropped in awe and fear (in the case of the giant diamond spiders) the gameplay is amazing, the visuals are amazing, and the demo I played before I bought it was fun I guess but felt bland and simple, the actual game is so much larger and fun than it and every single god power is so unique and the implementations of them in the levels feel very useful. (Except the npc teleport one) but overall I have sunken hours into this game and I plan to play it even more.\n\nHelpful | 8", "alex.in.vr.9Jan 18 at 5:52 PM\nMagical.\n\nSo immersive and magical. Really felt like stepping into another world without needing ultra realistic graphics. After spending too much time shooting zombies in darkened rooms it was nice to have a different experience. Brought home to me the power of VR. Well done on a magical game! (Played on Quest)\n\nHelpful | 0", "mayoscauseFeb 12 at 4:20 AM\nAmazing game\n\nThis game was really fun when you play for a while and it makes you feel different in a weird way like a hero and the battles are very fun and the art stile is pretty cool\n\nHelpful | 0", "EyeballPrincessOct 18 at 9:21 AM\nNothing but love for this title!!!\n\nThis is one of the most immersive and fun vr games I have played on Quest. I love everything about it. The motion is great. The fight mechanics are a hell of alot of fun. Running up on giant frick frackin monsters and slug demons with your sword drawn sucks you into the world. You have upgrades. You have secrets to find. You have pig birds. You can activate a god mode and pluck lightning bolts from the sky to hurl at your enemies. If you are a fan of Zelda, you owe it to yourself to give this one a shot. If you are not a fan of Zelda, you owe it to yourself to give this one a shot.\n\nHelpful | 66", "Simply_TanikaMar 9 at 8:40 PM\nLove this game!\n\nIf you forget something, you have to start over. That's the only con about this game. Other than that, this game is so much fun!\n\nHelpful | 0", "jonny.milicevicFeb 18 at 4:08 AM\nZelda VR\n\nThis game is stunning, I love the plot, and I love how you can switch between god mod and normal mode adding that next level of strategy.\n\nHelpful | 1", "decoecoMar 7 at 1:19 PM\nSimply amazing\n\nThe scenery and every thing else is spot on\n\nHelpful | 1", "SleepDeprivedIdiotDec 17 at 12:46 PM\n\nI absolutely love this game. It's one of my favourite games on the quest but the only reason I didn't give it five stars is I wish there was something else to do after you finished the game like a free play mode or a sandbox mode. Overall it's an amazing game that kinda reminds me of Zelda and I love the art style but I wish there was more to do after you complete the main story.\n\nHelpful | 9", "box_scrapyMar 5 at 9:23 AM\nRequires some work\n\nHonestly ots a good game but you cannot backtrack to previace lvls and when you are done you still can not go back also replayabilaty is. Weak\n\nHelpful | 0", "DeliriousHD21Mar 12 at 3:41 PM\nVery nice\n\nGood\n\nHelpful | 1", "erik_segs_Feb 4 at 6:23 AM\nFantastic game.\n\nA lot I can say about this game but I'll keep it simple! Controls are great. Physics and graphics are super fun and on point. Story keeps you coming back for more. It's just so fun. Get it.\n\nHelpful | 0", "Filup06Feb 17 at 1:40 PM\nGreat experience\n\nOne of the best VR games I've played good graphics great level design and the best combat you can get in a VR game.\n\nHelpful | 0", "CommanderDawg95Jan 26 at 11:24 AM\nGreat\n\nThis game is very beautiful, it was animated very well, and the story is great! However, the reason I gave it four stars instead of five, was because the final boss was just too easy to defeat. If the final boss had been more challenging, then I would have given it a five. But overall very good.\n\nHelpful | 2", "VerselDarastrixFeb 14 at 4:01 PM\nHoly. Frickn. Jesus.\n\nThis game is basically Zelda in VR (I love Zelda) the demo ain't telling you nothing! The game is amazing would buy again\n\nHelpful | 1", "DukefromearthJan 13 at 2:15 PM\nNice action adventure game!\n\nSimple and accessible, I enjoyed my time in this world that reminded me a bit of the Windwaker Zelda game. I'd say I has a decent lengths for it's depth, about 4-5 hours. Would've liked a bit more secrets and rewards for curiosity, like mini games or a hidden dungeon but overall I had a good time. In my case this will probably be a single playthrough experience but I was a fun one nonetheless.\n\nHelpful | 2", "DogamicJan 7 at 8:06 PM\nSo very good\n\nThis game is fantastic. The levels seem short at first, you are constantly getting new abilities. I recommend spending time in each level finding all the collectibles as they lead to weapon and health upgrades. Once you've done all the levels you are only half way done. The endgame section is long and exciting. Very much recommend this game.\n\nHelpful | 1", "oblivmar12Feb 21 at 4:55 AM\nAwesome game\n\nIts a really good game but they should ad modes of transportation like horses.\n\nHelpful | 0", "ColzzFeb 13 at 11:43 AM\nVery hard\n\nIm not good at it but in the 3 level there is a massive difficulty spike its still very fun and worth your money!\n\nHelpful | 0", "Mark-BlissJan 26 at 8:36 AM\nFun\n\nA fun game but if youre prone to motion sickness not a good one to get. I enjoy it a lot but I can only play it for five or six minutes before Im too dizzy to play on any farther and have to quit. It is well written very enjoyable but the motion can make you ill so proceed with caution\n\nHelpful | 1", "BrandyonTXJun 5 at 12:39 PM\nLove it.\n\nThe first game of Oculus to really draw me in.\n\nHelpful | 0", "DrendinMar 1 at 5:40 PM\nSo good\n\nDemo doesnt due it justice.\n\nHelpful | 0", "ThePilgrim666Dec 22 at 4:00 AM\nSuperb\n\nThe game is well made and well designed. It also allows you to choose your difficulty if youre a bit new to the Quest or just VR in general. If u have spare money and its enough to buy this game, buy it. In my opinion, this game is a must have for anyone who has a headset compatible with Journey Of The Gods\n\nHelpful | 10", "11alualhatiFeb 14 at 11:24 AM\nAbsolutely Gorgeous\n\nGameplay is super quirky and fun. Design is gorgeous. Would absolutely recommend for any experience of VR.\n\nHelpful | 0", "CasualCheetahJan 2 at 12:02 PM\nCharming Bird Questing\n\nIt gives off the atmosphere of a classic or fan-made adventure game with its minimalistic visuals, special abilities, and a nameless hero who does what they can to protect a source of good. Combat and puzzles are simple and satisfying with god mode making for a clever inclusion that led to plenty of 'ah-ha' moments. JotG's strength is in its exploration of new ideas. With the sale prices leveling out the expectations for the game, I'd definitely recommend trying it out.\n\nHelpful | 2", "Golden_bread1776Jun 4 at 12:57 AM\nGreat game\n\nGreat fun and heartwarming ending, must play\n\nHelpful | 0", "Colli3rJun 11 at 11:13 PM\nI like the bow\n\nbow fun\n\nHelpful | 0", "Ember4288Feb 10 at 3:01 PM\nFreaking Awesome!\n\nIts like Minecraft, Vader Immortal, RPG, & Zelda had a sweet, sweet, love child! Just buy it and play. Trust me!\n\nHelpful | 1", "jtk_10invrFeb 17 at 6:14 PM\nPlz make a 2\n\nI have played this game all the way through twice and loved it every time\n\nHelpful | 0", "MousemuncherApr 12 at 3:05 AM\nAverage game\n\nHas a Zelda feel\n\nHelpful | 0", "H8RT8RJan 1 at 8:49 PM\nBest VR RPG I ever played\n\nIts so immersive and fun, blocking enemy fire and slashing down enemies feels so good! Same goes for freezing time, and striking lightning down on your foes like Zues did. The creators clearly did a good job and I hope there will be more to this game and more games like this to come!\n\nHelpful | 2", "mrepic222222Mar 2 at 2:36 PM\n\nGood game not very exciting combat and it makes you feel a bit sick but overall good game\n\nHelpful | 0", "Jaboi01Feb 12 at 11:46 AM\nGood Gameplay\n\nThe story and gameplay are really fun to enjoy and I most definitely recommend this game\n\nHelpful | 0", "RattleKatFeb 6 at 8:04 AM\nPerfect game\n\nThis game really stands out. Looks beautiful, plays perfectly and lots of fun. What more could you want?!\n\nHelpful | 1", "VR_GURUJan 17 at 10:33 AM\nRPG!!!\n\nfinally a RPG on the quest that is extremely immersive and has awesome gameplay.\nonly played it a little while so far but it has all the elements including what seems to be a good story line.\nrating 4 stars only because of the cheap graphics but the gameplay is top notch!\nall RPG's gameplay should be based off of this!\n\nHelpful | 0", "xChr1sTh3Gr8Feb 15 at 8:18 PM\nMy God, ITS THE BEST GAME\n\nGeez I just got this game and Im addicted already, I highly recommend this game for starters. (You dont have to be a starter...)\n\nHelpful | 0", "clintlandonJan 14 at 11:05 AM\nAmazing, But Has a Comfort Flaw\n\nI thoroughly enjoy this game in a way few VR games click with me. This game not only captures my attention, but also my imagination, and thats no small feat.\n\nHowever, I can only play a level at a time before I get uncomfortable and have to stop. Since I just finished Boneworks, I cant say motion sickness is a problem for me anymore, but for some reason this game wears me down.\n\nI think theres two reasons this game might make my head hurt. One is how the vignette opacity cant be raised to be more solid. I honestly dont think the vignette is much of a factor, but its unique and so is this problem for me, so \n\nThe major problem is locking movement to your head. When a game is built to encourage looking around, having your movement tied to your perspective means youre kinda punished for taking in the sights without totally stopping movement. I get combat would cause their own movement issues with how you block and reload your crossbow, but I usually lock my defensive stance anyways, having gotten used to this kind of combat in Skyrim VR. I just wish I had the option to have movement locked to my hands so I could look around if thats what I wanted.\n\nOverall, this is a truly great game. Its just hampered by limited comfort options.\n\nHelpful | 1", "mgzsmanDec 28 at 4:35 PM\nPurely fantastic!\n\nPlayed the demo multiple times, now Ive bought the game. The graphics, the story and the sounds are heavenly! I guess thats why we play a god! The fact it was on sale when I bought it was even more amazing! I really hope more content is added, because Im going to need it just in case playing the game as much as possible might get repetitive (note I havent actually played it all the way through!). Can not wait to play more!\n\nHelpful | 0", "Forgotten_2Dec 28 at 7:37 PM\nNot even 20% through and lovin it\n\nThis game is awesome many people compare it to Zelda and to that I say it isnt that much like it but its insanely fun to play with simple mechanics and great visual view the only down side is you can play the game again but there isnt anything else other than the story mode the demo was fun but really underestimated what this game actually is and a lot of people got turned down by this outstanding game that is a must have.\n\nHelpful | 1", "supermom40Feb 15 at 4:59 PM\nGreat game!\n\nMy teen daughter finished the game and loved it!\n\nHelpful | 0", "victorkyhlFeb 22 at 2:47 AM\nGreat game\n\nNo comment\n\nHelpful | 0", "LionugeDec 20 at 2:04 PM\nWhat a Fantastic game !\n\nUpon starting my quest, I had all these downloads that I thought Id give a try. I did not know what this game was about before starting the demo but I was intrigued. The demo of this game was really good so I decided to buy this.\n\nThe game has great gameplay, graphics, puzzles, upgrading system, enemies, and I especially liked using the god powers (imagine black and white 2), I loved everything about this amazing game. It is definitely worth the just over 20 price.\n\nVery well done and thank u to the developers of this game for creating a breathtaking game !\nAm now waiting for DLC or a sequel\n\nHelpful | 3", "TheRealBroBossFeb 1 at 1:39 AM\nA game to buy at the start\n\nThis game is very good its if the legend of Zelda was a vr game but a bit glitchy but other all it is a fun game to play.\n\nHelpful | 1", "slipperystixFeb 10 at 7:11 AM\nWtf\n\nThis is one of the best games out there for ANY CONSOLE!!!!wtf!!!\n\nHelpful | 0", "GOATATHDec 25 at 7:09 PM\nThis has to be one of the best be games\n\nThis game is awesome the controls and gang lay are smooth with a great story I recommend buying Iran so if you like Zelda than this game should be the number 1 on your list to buy it is great the graphics are really great and the sounds are really really good and the gameplay is amazing you really should buy\n\nHelpful | 1", "MizudaDec 27 at 7:26 PM\nThe demo sold me, but..\n\nthe full game has surpassed all of my expectations! I couldn't believe how beautiful and smooth it felt. This game feels like an open world and as I've progressed, it continuously gets more and more exciting. Get this game! It's worth it!\n\nHelpful | 5", "DSpuds87Jan 2 at 5:42 PM\nIncredible\n\nThis game is not just a game but rather a completely artistic and smooth immersive experience. I cannot begin to describe how awesome this game is. The full version is much better than the DEMO and the DEMO was incredible. It is worth every penny.\n\nHelpful | 1", "SANEWBERRYJan 11 at 2:54 AM\n\nJust finished playing through on medium difficulty and really enjoyed the game. I love the simple yet beautiful graphics and the gameplay is as smooth as butter. I will definitely be replaying this.\n\nHelpful | 1", "Wind_FallJan 23 at 8:02 PM\nIt was great\n\nIt was amazing. Great gameplay and amazing story. The only thing that is missing is being able to do more because so far all you can do is the story\n\nHelpful | 0", "Ducky25Feb 1 at 7:04 AM\nStory games\n\nOne thing the oculus store is missing is some good story games, this however is a massive exception.\n\nHelpful | 0", "maddoxfultonFeb 19 at 4:31 PM\nThe end game\n\nOk so I thought at the end you would get a thing like in superhot where you can replay levels and get the things you missed and one were you can get an endless mode but no and the gameplay made no sense at some point.\n\nHelpful | 1", "Jcpepe123Apr 4 at 6:10 AM\nVery repetetive\n\nToo Much repetetive for this price\n\nHelpful | 0", "DunlaplyFeb 11 at 5:54 PM\nWonderful!\n\nDefinitely worth your money and time, I personally felt the game started to lose steam around the 2/3 mark but that's just me\n\nHelpful | 1", "Wknight76Jan 17 at 12:05 AM\nZelda like game\n\nRuns great and looks great! I put it down for a bit as I bought many games over the holidays. Just picked it up again. Great game almost to the end that will be sad.\n\nHelpful | 1", "theoryofeverywhereFeb 20 at 2:03 AM\nProbably my least favorite game so far\n\nThis game is BORING! The demo was boring, but I purchased based on people saying it is so much better than the demo. Its not. You just run around and hit enemies. Its also buggy. At the last level, I faced an enemy impossible to kill as all of the bubbles on its sides were gone, and there was no way to do damage to it, and it needed to be killed to progress. This game has no charm and is not fun at all. What a waste of money (at least I got in on sale).\n\nHelpful | 0", "Zenn69Feb 3 at 2:31 PM\nSimply the best RPG on the quest\n\nNever mind the demo, just buy it and youll see how beautiful and fun it is.\n\nHelpful | 0", "pop4Dec 25 at 3:47 PM\nYou need to get this game!\n\nThis game is amazing! Its so calming and immersive. The graphics are beautiful and you cant stop playing. Its kind of like a first person Zelda game. But instead of saving some lame princess, your saving the whole world. 1000000/10. Would definitely recommend.\n\nHelpful | 0", "psully4114Dec 11 at 10:05 AM\nIts pretty great.\n\nI was skeptical about playing it. It is more or less Zelda for VR. The scope of the game is not huge and epic but its easy to pick up and plays well. Theres some great character and level design on display. Some great visual story telling. To me it reminds me a lot of old school platformers on the PS1 and 2. There are few bugs here and there but they're largely negligible and for the price I think its a great experience overall. Highly recommend playing it if you haven't done so yet. If I have one complaint is there is not a lot of replay value. I beat it a while back and I picked up once after to 100% it and it didnt take me very long. Its a short game but its a work of art and even if something I would pick up and play every day I think this will go down as a VR classic that really showed the scope of what could be accomplished on something like the Quest.\n\nHelpful | 3", "oculusicemanFeb 1 at 8:59 AM\n\nThis game was so awesome and probably the best game I have\n\nHelpful | 1", "TheSharkManJan 21 at 4:43 AM\nAmazing.\n\nI really didn't think this game would be so great but boy was i wrong! After i played the demo i was hooked.\n\nHelpful | 1", "LeoH606Apr 11 at 10:07 AM\nGreat game.\n\nThe idea is great, but the game is just too short, and after completing the story, you have to start a new save file, and there's nothing to do after completing the game. A good game, but it's too short for it's price. The concept was great I wish there was a way to replay levels after completing them without starting a new save file, and that's why it's only 4 stars.\n\nHelpful | 0", "GlaubsJan 26 at 3:05 PM\nMust have\n\nI really hope they continue making games like this. Lots of fun, hopefully they make more.\n\nHelpful | 0", "Adub424Jan 9 at 12:07 AM\n\nStarts off like a happy little Zelda clone. Then it becomes an RTS. If I wanted to handle bureaucracy I would play job simulator. Plus many of the powers require exact movments. Stuck for hours for not using the exact gesture. I solved the problem I was just pulling the wrong way. Frustrating for the wrong reasons. Play something else first.\n\nHelpful | 2", "idontkn0wDec 27 at 8:06 AM\nBest game ever.\n\nThe abilities are great, The graphics are amazing, the gameplay is epic and my favourite thing in this game is The owl because it's so cute i named it 'hoolio'\n\nNamed after a pet of mine called 'julio'\n\nHelpful | 2", "bubba.turpsFeb 7 at 10:59 AM\nReal good\n\nSuper good\n\nHelpful | 0", "grotheringJan 8 at 4:27 PM\n\nThis game is stunning and extremely fun to play. The mechanics work great and gives you a challenge but also let you enjoy the game and have fun.\n\nHelpful | 1", "carbonites_cold_2Jan 8 at 7:32 AM\nThis game is amazing\n\nThe game was an amazing vr experience for someone who was very new to the whole thing I truly enjoyed the game and the story it came with.\n\nHelpful | 1", "BrocktogonDec 24 at 11:52 AM\nBest Adventure Game I Have Played on Que\n\nThe world and characters make you truly feel like a hero as you battle a variety of enemies with their own unique mechanics.\nA must have for someone looking for a Zelda like game you can really sink your teeth into.\n\nHelpful | 1", "YaBoiMatJan 16 at 6:43 PM\n\nIt's a good game but you guys really need to learn how to make some of your levels at least decent. Like that giant boss fight was complete a*#. My lightning bolts weren't hitting 99% of the time. And that last mission just makes zero sense.\n\nHelpful | 3", "KrytikelDec 27 at 12:52 PM\nGreat game, but..\n\nReally good game. So far have only got up to the level after you get the power to pick up certain things, I already love it. But, sometimes the fighting can get quite repetitive because you can take down simple enemies in 1-2 strikes, and anything big is killed easily with the OP lightning strikes. The sound will sometimes produce a static beep, the screen will occasionally turn partly black, and sometimes the game can be quite unfair (e.g on the 4th level, the rising lava is hard to cross on its own, and a strong creature guards the other side, which will most likely push you back in and kill you straight away. I have 6 lives at the moment and can die from just that in about 2 minutes.) Apart from that, really enjoyable game, the first game i got after playing that amazing demo!\n\nHelpful | 0", "spm199316Jan 14 at 11:02 PM\nAbsolutely amazing\n\nThis game is a ton of fun and has an amazing story. The only thing is I wish the story was longer.\n\nHelpful | 1", "L3thal_uwuDec 30 at 8:25 AM\nA World Worth Exploring\n\nNothing feels too easy or too difficult. Each level is balanced in its own way. The design is incredible. Each new power is fun and useful. Any quest owner should buy this game.\n\nHelpful | 1", "adamsherlock979700Jan 6 at 1:45 PM\nAmazing\n\nIncreasingly challenging throughout each level and does make you a little dizzy sometimes but an amazing game 10/10 will try again\n\nHelpful | 2", "H11577Jan 1 at 11:53 AM\nWow...\n\nSuch a beautiful game. Don't let the price tag keep you from experiencing one of the most amazing stories of any VR game out there today. I cannot recommend it more\n\nHelpful | 1", "GrititJan 2 at 1:24 PM\nStunning feel\n\nVisuals make you feel you are actually there. The feeling of the firing crossbow is amazing. When your fighting you the movement is fluid and the challenges feel real\n\nHelpful | 0", "Mystical6112Dec 29 at 12:24 PM\nHands Down One Of The BEST Oculus Games\n\nWell Done! This Game Is Way Better then The demo Makes it seem. The story is immersive and the art is breathtaking. It's worth every penny of that $30 you pay for it.\n\nHelpful | 2", "Sync_172May 1 at 8:17 AM\nIts really good\n\nThe game is really cool but the game is shot but i love it\n\nHelpful | 0", "Turtle.exeJan 4 at 1:59 PM\nGreat game\n\nThe game has great graphics works smoothly and is just fun to play and has an art style that kinda reminds you of Zelda breath of the wild but in VR\n\nHelpful | 0", "Harryenic2007Jan 23 at 11:28 AM\nGreat Game\n\nThis game was very fun to play, can be frustrating at times. I did find it the story was quite short but there was a lot of other stuff to unlock.\n\nHelpful | 0", "Platoscave9012Mar 27 at 1:46 PM\nOld-school gamers will love this\n\nIm a sucker for anything that resembles Zelda and this game really touches home for me. Im OK with the graphics because thats part of the nostalgia. If youre looking for a game thats worth your money this is it.\n\nHelpful | 0", "txlcobraDec 2 at 7:28 PM\nSo good I cant believe it\n\nI can barely even describe this game it has all the fundamentals I want in a game if this had a top part 2 I would buy it for $60 this game is the best I have ever played on my oculus quest if you need a game and you play for hours of fun please buy this game please\n\nHelpful | 4", "Thread78Dec 30 at 1:03 AM\nA simple but effective rpg\n\nHello !\nA simple but effective rpg. Some improvements would still be welcome, for example, displaying a life bar, the level of faith, a map. Thank you devs!\n\nHelpful | 1", "Ghostphantom28Jan 19 at 6:29 AM\nGreat game\n\nI thought it was a boring game but I tried the demo and loved it\n\nHelpful | 0", "weejpDec 27 at 2:43 PM\nMesmerising\n\nAmazing game. Stop comparing it to zelda or skyrim. It's a completely different and engrossing experience. More of this please developers. The future of the quest relies on it.\n\nHelpful | 0", "JackH2O123Jan 2 at 12:56 PM\nIncredible game\n\nThis game has stunning graphics and marvellous gameplay is in one of the best games on request and it is sad that not many people know about it\n\nHelpful | 0", "NT111006Mar 20 at 4:12 PM\nAmazing\n\nThis is the 5th game Ive played on my quest and its my favorite so far. This game is a wonderful adventure in a world you can get lost in. Its not open world but its big enough to feel like it. 10/10 great game its like VR Zelda\n\nHelpful | 1", "FireStreamerJan 8 at 8:18 AM\nSimply amazing\n\nWow. Just wow. Finally not tech demo or short experience, but a truly full game. Almost cried at the end.\n\nHelpful | 0", "zmashkaJan 2 at 5:56 PM\nWonderful little adventure game\n\nSimple graphics, but really fun and immersive gameplay. One of my favourite games on Quest. I wish there were more VR games like this.\n\nHelpful | 1", "Known47Dec 25 at 5:58 PM\nIts not Zelda VR\n\nIts a complete different feel than Zelda once you get into the story and understand how the game works. Yes it is extremely close but its it one game for sure\n\nHelpful | 1", "andrej.fokin.92Dec 29 at 3:29 PM\nOne of the best!\n\nThis game is amazingly well made and worth every penny. I encoradge everybody to buy this game, as it has a lot to offer and a very fun VR experience!\n\nHelpful | 0", "ze.n3585Jan 18 at 9:27 AM\nOkay game.\n\nFirst tried it without the comfort settings and it made me motion sickness. Turned them back on and it was fine. The gameplay just got really repetitive, graphics are really basic. There's no story to speak. I guess if you're wowed by everything VR you be enthralled by this game. I found it quite full and repetitive.\n\nHelpful | 2", "Brownie37Jan 15 at 5:05 PM\nJourney of the gods\n\nThis game is so fun. Anyone who has a vr, Get this game first\n\nHelpful | 0", "shrinkrogersNov 30 at 10:04 PM\nVR Zelda-esque\n\nIf you are looking for an experience analogous to Link exploring Hyrule I think you will be impressed. God mode is superb and artful. Excellent pacing and immersive throughout. I am 75% through and will be sad when I finish. And probably start over immediately.\n\nHelpful | 3", "IlDioUccisoreDec 31 at 8:47 AM\nWow\n\nYou got the pigducks you've got the big floppy winged birdos ya got the stabbin and the shootin. Buy this. Play it. And get outta here.\n\nHelpful | 0", "Firestar9000Jan 25 at 8:56 AM\nGreat adventure\n\nThis game is a solid Zelda like game. And I would love a sequel to go more down the Zelda feeling game.\n\nHelpful | 0", "gabriel.saldana.5817Jan 20 at 1:05 PM\n\nThis game was really awesome\n\nHelpful | 0", "stealthcaster1Feb 8 at 7:11 PM\nSoft lock\n\nAt the last level I managed to accidentally soft lock my self at the spinning cylinder other than that I liked it you need to restart if this happens\n\nHelpful | 0", "AbyssalismsDec 1 at 7:11 AM\nAwesome game\n\nI love almost everything about this game, the art style, gameplay etc, the only thing Id say this game is somewhat disappointing in is the replayability.\n\nThat, and I find that theres such little guidance in the levels. I was stuck on the third level for two hours before giving up. I found that this happened often, in the level before too, where the enemies seemingly just kept coming and coming and nothing was happening, so I figured something was bugged.\n\nIt lacks in telling you whats going on, but the rest of the game is fantastic.\n\nHelpful | 7", "thebestman12333Jan 12 at 9:20 AM\nSooooo goood\n\nThe game is so well made with minimal glitchs and a great story\n\nHelpful | 0", "Jake-RyanDec 26 at 1:50 PM\n\nGreat game. Lots of fun. Great combat system and amazing art style. I definitely recommend this game for new players of the quest and other systems.\n\nHelpful | 0", "TheBunnyGamerMar 22 at 12:59 PM\nA true adventure\n\nIt was a great experience of moderate length, with unique enemies, a fun God mode and difficult but interesting puzzles. It's just a shame that it had little storyline and is not very replayable. Worth the 22 pricetag? Maybe. If you're looking for a game like The Legend of Zelda, this is like a demo of that in VR.\n\nHelpful | 0", "TheBestUsernameEverDec 25 at 10:41 PM\nReally creative and fun!\n\nSso far, I'm really enjoying the creativity behind this game. Firing arrows and pulling lightning bolts from the sky to smite your enemies is a lot of fun! I just hope the difficulty and depth increase a bit more as I get more into it.\n\nHelpful | 0", "RigmorMalmsteenJan 10 at 6:39 PM\n\nBeautiful game, lovely story, and the scenery is outstanding\n\nHelpful | 0", "Cancer_CellOeffJan 14 at 3:42 AM\n\nFor me this might be the best game\n\nHelpful | 0", "KinderDiamondJan 17 at 4:31 PM\nAmazing game\n\nWorth every penny\n\nHelpful | 0", "getgud2114Dec 26 at 8:53 AM\nEpic\n\nThis game provides awsome visuals and a good story its the closest thing to gorn and blade and sorcery on the quest.\n\nHelpful | 1", "olahebJan 8 at 12:59 PM\nWorth it\n\nRuns smooth Nice artstyle and good combat, Worth it.\n\nHelpful | 0", "GeeeBenjaNov 5 at 11:52 AM\nTHANK YOU!!!\n\nThese developers are so talented. I have so much appreciation for the creative use of VR in this game. The puzzles were the perfect level of difficulty for me (almost got stumped a couple times!) This is everything i love about Zelda in an exciting new and highly immersive platform. Im sad that i finished it!!\n\nHelpful | 7", "BeanezJan 1 at 8:10 AM\nAwesome\n\nVery smooth, lots to explore and you get stuck in the world for hours :)\n\nHelpful | 1", "SaIadDec 24 at 7:41 PM\ngood game\n\nhonestly it's a little bit off-sense putting because I got so dizzy after playing it but it was very fun! loved it\n\nHelpful | 0", "Bananaman10YTJan 4 at 3:05 PM\nFricking Zelda level crap!\n\nThis game is fricking amazing play it!\n\nHelpful | 2", "RageingEmpireDec 27 at 3:12 PM\nReally Fun! Be weary\n\nDont take rating on the apps lightly, if your a VR newcomer like I was take note of these rating and use them to your advantage or you might get sick. Super fun Zelda like game.\n\nHelpful | 1", "Just_a_PearDec 21 at 1:13 AM\nFun Puzzles!\n\nJust started this game, wonderful visuals and interesting unique gameplay! Definitely recommend, absolutely beautiful and fun\n\nHelpful | 0", "vikechikFeb 22 at 1:12 PM\nMakes me sick\n\nUsually doesnt happen. Might be the unnatural way it walks.\n\nHelpful | 1", "solomon208Nov 29 at 12:45 PM\nIts just great\n\nI have just bought the game but I have played the demo and it is amazing and fun.i think when it is done downloading Ill play the game till my fingers cant feel anymore.10/10 game,would highly recommend.\n\nHelpful | 2", "skygod_BFSKMar 1 at 8:37 AM\nBoring\n\nPoor graphics, boring gameplay\n\nHelpful | 0", "vrabbitsNov 30 at 7:31 PM\nReally the best.\n\nI've played all freaking day and,still haven't completed it. The game is amazing. It kinda,starts out slow but as,it goes on you get so much stronger an ,the boss fights rocks. 10 out of 10 stunning experience.\n\nHelpful | 1", "LeopardonDec 28 at 11:22 AM\nGreat little Adventurer\n\nGood little game, great world and better than the demo suggests\n\nHelpful | 0", "Approved_StudiosNov 30 at 7:42 PM\nHOLY MOLY\n\nThis game was truly amazing, I just started vr, and Im a bit of a Zelda fan and this game is truly amazing, it was intense and beautiful. I recommend this game to a lot of people.\n\nHelpful | 2", "baller8706Mar 22 at 1:48 PM\nEverything\n\nThis is an awesome game for the price it is really long but really good graphics and good for a weekend that you have nothing to do\n\nHelpful | 0", "JulijaJDec 29 at 6:02 AM\nAbsolutely amazing!\n\nThanks for this unusual and attractive game! I love it!\n\nHelpful | 0", "ollievic1Dec 29 at 7:20 PM\nAmazing gameplay\n\nThe whole family likes this title def worth trying out.\n\nHelpful | 0", "qIl5ytFeb 18 at 11:03 AM\nWhy cant I refund\n\nWont let me refund and said I play 2 hours with it and didnt even play one!\n\nHelpful | 0", "Atomix121Jan 1 at 4:54 PM\nGreat game\n\nImmersive experience, lots of fun!\n\nHelpful | 0", "Salty_potato9090Dec 27 at 8:35 PM\nSo good\n\nStory is amazing and does not get boring\n\nHelpful | 1", "kingofcardgamesDec 29 at 10:55 PM\nI love this game!!\n\ni just love this game!! really pretty!\n\nHelpful | 0", "ger87410Dec 29 at 5:52 PM\nFun, cute\n\nRuns smooth on quest. Quite enjoyable.\n\nHelpful | 0", "Demon_of_Wolves_6226Dec 27 at 6:20 AM\n\nI love the graphics the art style and many more\n\nHelpful | 0", "anthonshJan 17 at 9:09 PM\nKey Mechanic is broken\n\nI'm having extreme difficulty getting lightning hits to register. Once you try a couple times, you're out of magic, the game auto saves, and you either lose or you're stuck. I'm past two hours and giving up without finishing.\n\nHelpful | 0", "MatthblueNov 6 at 2:57 AM\n\nThe game is great and I recommend it, but the problem is the story. Now the story itself is fine, but the levels don't link together. For example, one level your deep in some woods, the next level your suddenly fighting a big kraken thing in a lake. (Not a spoiler by the way, it's in one of the images). Aside from this, it's an amazing game that I really do reccomend if your into this genre.\n\nHelpful | 5", "basspro9218May 8 at 6:30 AM\nWill go down as a quest all time great\n\nThis game is great! At first I was skeptical because the graphics didn't look so great but I'm glad I bought it! The graphics are extremely polished and the lack of detail in them allows the game to run smoothly and enemies to be great looking. I had no glitches or problems for the duration. The game is challenging and occasionally took me some time to figure out what to do, which is nice they dont hold you hand. Killing enemies stayed satisfying till the end.\nStory is simple but concrete and I agree with other reviews that say this feels like one of the only full size games for the quest. Probably took me around 8 hours to complete on normal but I take my time and find everything. I've been craving more RPG games for quest and for the time being this game scratched the itch. A must have for the quest! Hopefully we get a sequel\n\nHelpful | 2", "SilverBeeGamingNov 30 at 10:02 PM\nWell made\n\nI had a ton of fun playing this game and it was very satisfying to progress through the game and gain more abilities to make the player more powerful.\n\nHelpful | 3", "BcbubblesJan 1 at 4:37 PM\nGreat\n\nLove the game\n\nHelpful | 0", "UDontHaveMyNameNov 25 at 6:14 PM\nWow!\n\nThis is like a first person Zelda in VR! Its great, and I couldnt be happier with it. I was sad when it was over ;)\n\nHelpful | 2", "Lazer241Dec 25 at 8:50 AM\nGreat game\n\nIts like Zelda VR. Cool art style\n\nHelpful | 1", "tom.rediferJan 10 at 7:54 PM\nReally fun, but...\n\nGives me a lot of motion sickness, even on immersive\n\nHelpful | 0", "Danrock72Dec 1 at 10:44 PM\nIt wont work?\n\nWith the little amount that I have already played, it seems like a really fun game already, but it wont start. I cant find the full version in my library and when I try to buy it on the store again, it says you already own this title. Maybe they are updating it and I started playing at the wrong time, but please try to have it fixed soon if possible\n\nEdit: now it works, thanks\n\nHelpful | 8", "LinusTechDecksDec 25 at 2:42 PM\nOH MY GOD ITS COOLIO\n\nI cant stop playing this amazing game\n\nHelpful | 0", "farmersam730Dec 25 at 8:51 PM\nLove it\n\nGreat game\n\nHelpful | 2", "DrukulusDec 27 at 4:31 PM\n\nFantastic fun game!\n\nHelpful | 0", "tms_brogang90Apr 4 at 9:50 PM\n\nAmazing game\n\nHelpful | 0", "Gman101905Dec 27 at 5:29 PM\nGood game\n\nGood game but if played in the sitting mode the camera moves too fast and I got motion sick\n\nHelpful | 1", "kristiandubaiOct 15 at 11:53 AM\nOne the best vr games I have ever played\n\nI dont want to write a Wikipedia worth of words so Im just going to sum it up for you the games art style is simple yet beautiful the game is like 10 hours long the game has a pretty good story the gameplay is smooth as hell only problem a had is when I enter god mode i had to hold the lightning in werid way to throw it\n\nHelpful | 7", "KoltonSimons123Nov 21 at 4:56 AM\nAmazing\n\nThis game is a great game, it has great quality and has a great plot. The only thing I would change is how much health someone has. But overall one of my favorites.\n\nHelpful | 2", "DudeurmyheroFeb 24 at 7:58 PM\n\nI hate my oculus.. such a waste of money\n\nHelpful | 0", "JamesTwoThreeDec 17 at 2:21 PM\nGood game.\n\nI just wish there was more of it.\n\nHelpful | 0", "JakeconerNov 24 at 9:01 AM\nJust Disappointing\n\nGraphics and sound are amazing, even for Quest! The way you hold you sword is also very believable and convincing! However, this makes the game feel even more disappointing. The combat is not very good. Sword play feels awkward. Some with Bow play. Some enemies are a pain sometimes. Sometimes you need wide space for some, but the game doesnt give you that space. It doesnt help when you struggle to take down one, but then the game casually throws 2 more at you. These elements make the game more frustrating then fun! To simplify, if your expecting Zelda or Skyrim gameplay and combat, dont expect it here!\n\nHelpful | 10", "AbleboyzMar 23 at 7:01 PM\nLoved it!\n\nAll the things you can do is just amazing.\n\nHelpful | 0", "clouds-cryNov 24 at 4:18 PM\nIts good!\n\nEver since I got it Ive been playing it nonstop. Just so you know dont skip the tutorial trust me. Dont do it.\n\nHelpful | 2", "Spicy_DoggoNov 8 at 9:24 AM\nThe vr RPG I needed\n\nThis game has everything a good game would need. Beautiful visuals, good soundtrack, endless amount of hacking and slashing, and a good narrative story. Overall a must have for the quest.\n\nHelpful | 3", "Mandalorian100Jan 26 at 2:56 PM\n\nNot bad, not great\n\nHelpful | 2", "PandaDragon2020Dec 24 at 7:24 PM\nMake more\n\nYou need to make it so you can go back on some levels please\n\nHelpful | 2", "Roxtar73Dec 21 at 1:26 AM\nSo far so good\n\nGameplay is fun. Graphics are decent. Is it worth the $30 that has yet to be determined.\n\nHelpful | 0", "redalert33Oct 18 at 7:52 AM\nLike Zelda? Buy this now.\n\nZelda VR. Or at least the closest thing to it currently. But seriously, if you like Zelda-esque games, get this. I had a blast playing through for probably about 5 hours. It easily feels like one of the deepest, most complete games at launch. Really fun swordplay and shooting mechanics, as well as a neat style that takes advantage of what the Quest can do, really feels immersive and puts you in the world they've created. Would love to see more games like this, or a sequel!\n\nHelpful | 6", "XaSeMar 23 at 1:35 PM\nGreat\n\nIts great\n\nHelpful | 0", "AnubisXtremeMar 24 at 12:33 AM\nAwesome\n\nTry it\n\nHelpful | 0", "isaacandalexNov 9 at 3:51 PM\nI love this game\n\nClever game designers had me trolling Reddit for clues on some of the levels. Its like having god-like powers and using them to get out of an escape-room-like level.\n\nHelpful | 2", "memester86Jan 3 at 9:59 PM\nMmmm yes\n\nIndeed\n\nHelpful | 0", "mango_powpowDec 15 at 7:44 AM\nYes\n\nYes\n\nHelpful | 0", "BDrangedNov 20 at 11:51 AM\nGreat game\n\nGreat game, tons of fun, not too short like many others, enjoyed it all the way through. :-) Highly recommend\n\nHelpful | 1", "RogueMadaraDec 2 at 9:44 AM\nSo much fun\n\nSuch an amazing beautiful game cant stop playing\n\nHelpful | 1", "UhluhtkNov 9 at 11:02 AM\nSurprised me\n\nI did not have high expectations for this game after watching the trailer and playing the demo, but boy did I love every minute of it. I wish I had gotten it sooner.\n\nHelpful | 1", "tzoldOct 7 at 6:38 PM\nJourney of the ages\n\nWhen I play an oculus game I want immersion and this is one of those titles that you cannot help but feel it. Its easily in the top three best games Ive played on the system. I love the Zelda like environments that burst with colors and action. It is the first I have given 5 stars. It is one of the most memorable titles I have played and everyone should own this on the quest.\n\nHelpful | 4", "RavageRaiderJan 19 at 6:12 PM\nIdk\n\nIt got rid of one of my save files\n\nHelpful | 1", "MedicBagDec 6 at 7:17 AM\nThe game is so much more then the demo.\n\nLiked the demo but the actual game is great. My 14 years old is in love with game\n\nHelpful | 3", "Redacted99Oct 20 at 4:36 PM\nAmazing!\n\nI just finished the game and I found both the overall story and the gameplay to be amazing!! I honestly wish there was more in the game just so I could hop right back in and keep playing. Amazing work! Best game I own on my quest ^^\n\nHelpful | 1", "Wooozyw000zNov 15 at 8:13 AM\nThis game reminds me of Legends of Zelda\n\nFirst of all it's a great game. The bow can take some practice but after looking around and exploring there's so many little secrets and collectables making me want to journey out from the quest.\n\nHelpful | 1", "personinfrickAug 20, 2019 at 7:32 PM\nplease update.\n\nI would give it a 5 if there was more content, like returning to a 100% save file without a final boss sequence happening. And I really want to see some dlc levels that add more abilities to the armory. And returning to levels that are already completed would be nice. Overall, Would recommend as first game to buy, just please put in new content.\n\nHelpful | 34", "MattyIce1166Oct 5 at 11:15 PM\n\nI bought this game, because it reminded me a lot of Zelda, which is one of my favorite games of all time, but I digress. This game is worth $29.99. Its very immersive and fun if you are into RPG games. The graphics are nice, considering the art style. Give it a shot, you wont be disappointed.\n\nHelpful | 0", "colton97Nov 22 at 8:28 PM\nGame\n\nRuns smooth really like the game make more like it\n\nHelpful | 0", "RelicOFwarOct 15 at 12:41 PM\nGreat artistic games\n\nCaptures the feel of adventure with each new level. Not only do you feel emerald with the fighting, but also with the God mode. Being a God in a game has always been a dream. I would say that lots more was good planned for the game, but I guess they ran out of time. For example the village in the mountains. Very big space but a very little amount of things to be filled with. Felt like a creative space not a home town. I would suggest to get. Very cool and very unique.\n\nHelpful | 3", "waterzipperOct 18 at 7:20 PM\nReally good!\n\nIt has a Zelda feel to it, the art style reminds me of skyward sword the only difference is the controls actually work. My only real complaint and it's very minor is the lack of attention to detail, for example in the main hub world there are tents that look like you can crawl into them but when you get down on all hands and knees and try to crawl into it it tells you that you are out of bounds. Very minor complaint. It's linear but I'm all right with that.\n\nHelpful | 0", "thebardassSep 27, 2019 at 3:39 PM\nCreative and Attractive Game\n\nThe plot and progression of the game is well thought out. Gameplay is immersive and fun without being too overwhelming for new players. The weapons you can world are well designed and easy to use, and the powers you unlock throughout the game are very I testing and make you feel all powerful.\n\nIf you like fantasy and sword and sorcery style stories and games, this one is worth picking up.\n\nHelpful | 1", "BeopereOct 15 at 1:40 PM\nA wonderful beginning to VR adventure\n\nBeautiful environment, fun gameplay, a lovely little setting. Not an enormous amount of content, but that is my current expectation for such games.\n\nDid feel like the chosen one, would pursue world saving again.\n\nHelpful | 0", "Channel.XiroNov 30 at 10:09 AM\nI've always wanted to be Link\n\nThe best Zelda game ever... even if it doesn't start Link\n\nHelpful | 0", "dingoflingSep 15, 2019 at 5:28 PM\nThe Age Of Zeus's Vest Is Upon The Court\n\nAs a game its great and fluid, sword swings aren't all wigglle jiggly each enemy has a key way of swings and blocks [Like in real life maybe]\nThe crossbow handles really well and fun, it has iton sight's but i like to gauge my shots and fire quick, switching between the melee and crossbow to defeat enemy's in a puzzle like way. Its satisfying reloading the bow, you pull a lever like the ones you see in the bathroom in New Mexico I always dream about. The god mode makes it unique and the David Bowie part is great, rest well Bowie.\n\nGreat game, great devs, fun to play on an airplane, great buy for you and your son. Yeah , you.\n5/5 \n\nHelpful | 4", "tacolibre67Oct 20 at 9:32 AM\nAmazing\n\nThis game is amazing especially if youre new to vr like myself. The mechanics are fun and animation especially with the weapons is really cool\n\nHelpful | 0", "ThatLazyGuyXDOct 8 at 3:23 PM\n\nThis one of my first few vr games and it was an enjoyable expierence loved the mechanics and storyline one of my favorite games and was allways excited to get a new tool keeping making games like this.\n\nHelpful | 0", "DuckStockNov 13 at 11:27 PM\nA+\n\nThey get it\n\nHelpful | 0", "PiratongOct 1 at 5:05 AM\nAAA Game\n\nA real game with several hours of gameplay, amazing graphics, funny gameplay. When you change into God mode you can see the world as if it was a scale model. Its so beautiful that I spend a long time just looking at it.\n\nHelpful | 0", "CoolCreeper300000000Oct 25 at 3:06 PM\nBest Fantasy Story Game!!!!\n\nThis game was soooo much fun. You can have amazing god like powers. I just wish it was replay able.\n\nHelpful | 0", "Rawr_HarleyNov 27 at 2:27 AM\nReally enjoy it\n\nLove the graphics\n\nHelpful | 0", "KrymBaltimoreNov 22 at 4:28 PM\nawesome!\n\ni gotta thank the devs for this one! great game. reminds me of zelda. it has combat and problem or puzzle solving to satisfy the type of people that need that kinda thing in a game as well as a unique looking cast of characters and interesting environments that are not repetitive like some games can be. the enemies are not too hard to kill but also not incredibly easy to kill either. they are pretty much the same on each mission with a few exceptions here and there as you progress but that's not a problem in this game. the game is awesome! if you enjoy games like Zelda, this will be one of your favorite games. get it.\n\nHelpful | 1", "will.brenesOct 9 at 11:07 PM\nFun but gives me motion sickness\n\nIm having a lot of fun with the game but within 5 minutes every time I get motion sickness unfortunately. Ive tried changing the settings to make it more comfortable and nothing seems to work.\n\nHelpful | 6", "MoneybagvrNov 5 at 10:51 AM\nLove it\n\nI'm a fan of Zelda so this was the easy must buy for me keep up the good needs downloadable content\n\nHelpful | 1", "SoapySonSep 7, 2019 at 6:39 AM\nBest production game on Quest\n\nThis is a full game, like the Zelda's and other platformers using a sword, shield and crossbow through some amazing levels, storyline, artwork, also a long game with tons of content. Easily worth the $30\n\nHelpful | 9", "AydinaldaameOct 1 at 2:28 PM\nThis game is very adventurous\n\nIts really cool because of god mode and all the nice upgrades but I am also thinking that this game needs more levels and feathers cause we all like all the adventures and boss fights so we want more adventures and boss fights.\n\nHelpful | 3", "Apexi7May 21, 2019 at 11:07 PM\nNumber on my list.\n\nPlay the demo and experience in my opinion one of the oculus quest best launch titles. If you like Zelda with a bit of Skyrim then this is the game for you. Great controls, story and action rpg adventure. You wont be disappointed.\n\nHelpful | 287\nDeveloper ResponseMay 22, 2019 at 4:00 PM\n\nThank you so much Apexi7. Really glad you enjoyed it!", "Festive121Oct 17 at 10:17 AM\nSuper fun\n\nI just got it and have spent about an hour on it. I love it. So much fun\n\nHelpful | 0", "CaptainFrostJul 10, 2019 at 10:37 AM\nGreat Zelda-esque adventure\n\nI just finished this game, and I have to say it was really fun! The environments are really fun to explore and the mechanics work well. I enjoyed using each of the weapons and powers, and I felt there was just enough variety to make it interesting without being overwhelming. I spent around 7-10 hours playing this game (I also died a bit with the later levels on hard difficulty which added time to my play through) which felt like an okay amount of time. There isn't a replayability factor unless you want to go through the story another time, but even with that I feel like I got my money's worth with this game.\n\nHelpful | 10\nDeveloper ResponseJul 10, 2019 at 4:42 PM\n\nThank you for the great review and feedback!", "jacoby.cisnerosSep 24, 2019 at 3:39 AM\nDope first rpg vr game.\n\nSomeone said it looked like Zeldas wind waker and I couldnt agree anymore. Just bought my quest and Im all ready half way through.\n\nHelpful | 3", "KyleTranOct 9 at 8:57 PM\nMy adventure\n\nThis is the game that I feel so immersive. Great story and amazing abilities in the game!\n\nHelpful | 0", "tanner.mcenteeOct 26 at 9:21 AM\nFun\n\nFun game, immersion and controls could be better. Im just not a fan of the controller movement.\n\nHelpful | 0", "SukMyDiglett06Jul 30, 2019 at 4:05 PM\n\nReally good game. As others have said reminds you of Zelda. Only thing I would ask for after beating the game is some hints in the main menu about the God Powers and reminders on how use them. Unless I just missed it. Sometimes you forget certain ones. Other than that great game beautiful environment and excellent story with about 10 hours of solid game play. No glitches. Satisfying combat.\n\nHelpful | 7\nDeveloper ResponseJul 31, 2019 at 3:16 PM\n\nThanks for the feedback! When you are stuck on a puzzle that requires a certain God power the coinciding feather will start to glow a bit. However, we know that's pretty subtle and appreciate the request for a more obvious tip!", "jacemcdermottSep 13, 2019 at 10:46 PM\nGreat game\n\nPlease add more content, because there is only about 7-8 hours of content, so please add more like a sandbox after you finish the game!???!!!\n\nHelpful | 7", "Ed.paulleyAug 14, 2019 at 6:59 PM\nAwesome!!\n\nThis game will put you in another world!! The demo itself got me to buy this game! I love how you have to take the cross bow and reload with your other hand.. and the shield and sword wow!! Look down and see what your wearing!! I recently came to a protect the egg mission when enemy's spawn in 2 different areas!!! That was so intense.. graphics awesome.. I would rebuy this game any day!!\n\nHelpful | 6", "Eremite_EJun 2, 2019 at 7:10 AM\nThoughts after finishing the game\n\nThis is a 7-10 hour game with low replayabilty. The controls, experience, audio, etc. are all outstanding. Many comparisons to Zelda have been made, but it should be noted that the game is quite linear, not free-roaming in the way that many Zelda games are. Over all, I enjoyed the game quite a bit, but wish there was an arena mode or some such to extend the experience.\n\nHelpful | 172", "IamhamOct 12 at 8:14 AM\nLove it\n\nHas a good and original story line and is very well planned\n\nHelpful | 0", "SARABIA619Oct 10 at 5:29 PM\nReminds me of zelda\n\nGreat graphics, smooth buttery 60fps, and great story and gameplay\n\nHelpful | 0", "Havoc123Oct 6 at 4:52 PM\nVery good\n\nAn amazing immersive experience with clean cut graphics that work perfectly and simply\n\nHelpful | 0", "MeTheMan287Oct 20 at 9:15 AM\nAn Adventurous Adventure Game\n\nJourney of the Gods is a great game and the first adventure game in my opininion you should get in VR\n\nHelpful | 0", "DarkotanOct 4 at 7:58 AM\nLove it\n\nIts really good. I didn't expect it but its a perfect puzzle adventire game. Well done\n\nHelpful | 0", "NathanDevilleNov 8 at 1:46 PM\nNot worth the money\n\nThe price for this game was certainly not worth it\n\nHelpful | 2", "obi2kenobiAug 17, 2019 at 5:54 AM\nThis game is a reason to have VR\n\nI am pretty discriminating when it comes to game prices. So generally I hesitate to buy a $30 game. In fact the only other $30 title I have is beatsaber. But the quality and fun factor here does not disappoint.\n\nIf you are a fan of a Zelda like action/adventure/fantasy games, this is a must-own title. Along with training to be a Jedi, becoming a sword wielding hero is another king among nerd fantasies. Isn't that why we love VR? To make our dreams come true?\n\nNot that the game is about swordplay, at all. But it gives a great fantasy/magic feel with the visuals and unique God powers which to me are a great innovative use of VR perspective. The sense of scale is awesome too, the environments and enemies get huge.\n\nThis is miles beyond a generic hack and slash game. Very pleasing picturesque visuals and creative gameplay set this game apart from the rest. Oh and there are multiple save slots so you can share with friends and family :)\n\nUpdate: now 44% of the way through. It is still awesome, but I have to complain about the lightning mechanic. I have had an extremely tough time getting it to work. And its required to advance through certain areas.\n\nI will also comment that the coolest and most unique part of this game is the scale. Monsters and bosses look huge and fighting against things that appear 10-60ft tall is incredible. Plus there is this one monster that charges at you and it gets my heart racing. Great immersion! Just wish i had the space to walk around instead of relying on joystick movement. Would make it truly epic.\n\nHelpful | 11", "SithTimeLordOct 3 at 4:32 PM\nNeed more games like this\n\nWe have enough shooters or at least way more then games like this\n\nHelpful | 0", "SemdenijsOct 12 at 5:27 AM\nArena mode\n\nVery nice game but I think it could be 10x better if there was a arena mode of something like that\n\nHelpful | 0", "NickMajoraSep 22, 2019 at 6:49 PM\nGreat Game\n\nIt's the best example of a 'full' game on Quest right now. 10 hour long action/adventure with baddies to fight and collectibles to find. Recommended.\n\nHelpful | 4", "20BatteriesOct 13 at 4:42 PM\nNice\n\nGreat atmosphere, but very nauseating. Overall a amazing game\n\nHelpful | 0", "GrimLightAug 7, 2019 at 1:33 PM\nVR Zelda\n\nZelda has always been of my favourite games this is as close as you can get to a VR zelda. The graphics are truly beautiful really nice world. Great control mechanics so much fun stunned when I posses my first golem. Buy this game and be taken to a zelda land of beauty and fun.\n\nHelpful | 2", "DekueiAug 21, 2019 at 6:36 PM\nAn actual adventure game\n\nWhen you go to sleep and cant stop thinking of a game you know its good! Journey of the gods is an adventure in the vain of legend of Zelda series just a bit lighter on content. My only two gripes would be its a bit to linear and your characters body is static like meaning you cant crotch down to dodge an enemies projectile, I would like in a future sequel the ability to either pick my character or not see them as its weird seeing myself in a dress lol. I do hope dlc is added and am more then willing to buy any and all the dlc for this game as it would benefit from some dungeons with cool tools.\n\nOverall I cant stop thinking about turning the game back on and love the world turtle rock created!\n\nHelpful | 2", "Muti95Aug 6, 2019 at 7:36 PM\nBro! Sick game\n\nI played the demo for the first time last week looking for a game to buy and fell in love with it. I bought the game and play when I have the time. The world is very beautifully designed. The game itself has a lot you can do and it doesnt disappoint. The motion is smooth and the collectibles throughout the levels make it more fun to play through and find. Great game \n\nHelpful | 0", "ElyrthalJul 26, 2019 at 7:45 AM\nSo sadly insipid...\n\nWell... Really difficult to fairly evaluate Journey of the Gods, as my opinion will sound too subjective when compared to overall very positive evaluations.\nIndeed,\n- The game is technically very polished, should you like the artistic direction or not\n- The gameplay is good, though very repetitive\n- There is a certain variety in levels, even if really boring\n\nLong story short: I did not asked for a refund as I exceeded the 2 hours of play while waiting too long for things to click into place for me, in vain.\nSo I literally had to force myself to complete it (discovering no replayability at all of course) in order to somehow get a return on investment.\nWhich I couldnt obtain, since Journey of Gods is definitely too expensive in terms of enjoyability vs. pricing... IMO.\n\nHelpful | 16", "GeneralAntillesMay 22, 2019 at 10:06 PM\nExcellent and fun!\n\nThe game play is fun and challenging enough to be engaging without being punishing. The combat mechanics have good variety without being complicated. The levels offer interesting layouts, visual themes, and objectives. The art design, which reminds me of Windlands, is well-executed and plays excellently to the Quests limitations, as it is one of the best running experiences among the Quest launch titles.\n\nIt's an enjoyable, engaging game and I highly recommend it.\n\nHelpful | 31\nDeveloper ResponseMay 23, 2019 at 11:30 AM\n\nThis is awesome feedback. Thank you so much the dev team here appreciates you!", "Coolbot25Aug 7, 2019 at 9:58 AM\nTons of fun!\n\nI was shocked when I first played this game, I seriously did not expect to enioy it as much as I have. The games is relatively simple, you get a sword, shield, and a crossbow at your disposal to take out your enemies. As well as an interesting god form that grants special abilities, such as smiting your enemies or growing trees. Your equipment is upgradable, using various equipment piece found throughout the game. You also unlock different god abilities as you progress through the story. The game is not an open world game as I had expected with more linear styled levels to traverse through. The corssbows reloading system is quite finicky, you are supposed to pull a lever to reload the bow, but many times it doesn't get pulled all the way. Its especially annoying when I'm surrounded and trying to reload quickly only for the bow not to reload, causing me to die. Other than that, its a quite pretty, and entertaining game that I enjoyed slicing and dicing my enemies to bits. Certainly a must have for the Quest.\n\nHelpful | 2", "ArtTheVampireAug 4, 2019 at 10:02 PM\nLove the game but stuck\n\nSuper fun action makes you feel strong and tewards exploration im just upset im stuck after the first boat ride the driver of said boat points into a direction and has a bubble of a theif i think but i want as far as i was allowed to in that direction and saw nothing\n\nHelpful | 1\nDeveloper ResponseAug 5, 2019 at 2:58 PM\n\nThere's a giant red crystal blocking a cave entrance, break the crystal! Hope that helps :)", "PhadesJul 13, 2019 at 9:19 AM\nOne of the best VR games available.\n\nThis is easily one of the best games you can get in VR right now. The graphics and sound are great and the game plays extremely well. It reminds me a bit of a more linear Zelda, but that works well with the graphical limitations of the Quest. The mechanics are fun and it is one of the few experiences woth a decent length to it (7-10 hours). All that and it supports cross buy! Support this dev for their great work and don't hesitate, buy it now!\n\nHelpful | 2", "KyleKawolskiJul 19, 2019 at 11:57 AM\nHOLY SH** THIS GAME IS SO FUN!\n\nFantastic game, played the whole demo 3 times and finally bought the game. It us super immersive and I feel as if I am the main character. The feeling of reloading the cross bow feels so real. This game is a first person Zelda but better! 100% reccomend this to anyone looking for a different game that makes you feel like your the hero.\n\nHelpful | 0", "oculusnate12May 29, 2019 at 9:24 PM\nOh my god, that was amazing\n\nI just finished the whole game and it was fantastic, amazing art and I love how the moon beasts were designed, (I was actually scared at some points)there was so much content and I love all the powers in god mode. I am actually really sad now though because I finished it and it was such a fun game, I cant wait until you guys release your next game because I love the low poly yet beautiful style, I mean seriously the whole game had stunning surroundings and was just amazing. Journey of the gods 2 or something else with this god warrior concept would be amazing and take all my money I would buy it in an instant. I would recommend this to everyone that likes vr and adventure. This is such a great game and you can play for hours and hours, I will probably start a new save file tomorrow. I think this is my favorite game right now and will be for a very long time. Again I would love more games with this concept.\n\nThank you for amazingness.\n\nHelpful | 10\nDeveloper ResponseJun 3, 2019 at 3:48 PM\n\nThank you for such a positive and enthusiastic response, the team was really touched to hear your kind words. We're so happy you enjoyed it :D", "Brownstreak12Jul 17, 2019 at 9:44 PM\nLevel 3\n\nThe game is a lot of fun but Im stuck on level 3 and I dont know how to beat it. At the beginning it says I have to protect the egg by killing enemies and I do that but it gets repetitive after a while and starts to become boring. I dont know if Im doing something wrong or if I have to continue just killing enemies.\n\nHelpful | 1\nDeveloper ResponseJul 18, 2019 at 4:34 PM\n\nHey there! Thanks for reaching out. Sorry that it's a bit confusing but essentially yes- you have to keep doing it. The whole level is protecting the egg. Just keep powering through! Teleporting seems to be quicker than just guarding the egg if that helps.", "OccurosAug 6, 2019 at 12:37 AM\nBeautiful\n\nFrom the game mechanics to the visuals, this one is a real gem, and incredible to work so smooth on the quest. Highly recommended if you look for a little deeper experience on the quest or Rift\n\nHelpful | 1", "MrKodijackMay 21, 2019 at 11:59 AM\nZelda VR\n\nLovely Game, beautiful style. Runs smooth on Quest.\n\nHelpful | 445\nDeveloper ResponseMay 22, 2019 at 4:00 PM\n\nThank you so much for the feedback. Amazing compliment!", "MestynJul 13, 2019 at 10:00 PM\nSo amazing, immersive and beautiful\n\nThis was my first game on the quest and I'm glad I found it. This is exactly what vr needs and you guys nailed it. Please continue making masterpieces like this and my life will be complete.\n\nAmazing work guys, thank you for making the virtual world a better place.\n\nHelpful | 3", "GabeNewelIMay 25, 2019 at 2:18 PM\nEnchanting and empowering\n\nThis game is the closest feeling you'll get to playing Zelda in VR today. The environments are simple but beautiful, the gameplay is smooth as silk with satisfying combat and God powers, the enemies are intimidating and interesting. The art style and animations make the NPCs super charming even if they're pretty simple polygons with no spoken dialog. The entire time I have spent playing I just keep thinking to myself that this is a really good foundation for a series.\n\nWhile it's a great start all is not perfect. I can't help but feel like the level based design constrains the feeling of completeness of the world, and there's an overemphasis on combat over puzzles so far imo. The lack of written or spoken npc dialog is also a missed opportunity, because I think it could help make the world feel more fleshed out and lived in. The story is kind of ho hum as well, but servicable and lends itself well to the gameplay.\n\nOverall I definitely recommend this game to anyone looking to catch some Zelda vibes in VR, and really hope it's not the last we see of this world. I think a sequel/expansion with more emphasis on adding story and puzzles could be fantastic.\n\nHelpful | 24", "red2lucasMay 22, 2019 at 12:19 AM\n2d videos dont do this game justice\n\nYou must experience this game in all its VR glory. I wasnt going to get this game at all but luckily theres a demo available. Runs so smoothly and look really sharpe. Game mechanics work really well. Zelda in VR.\n\nHelpful | 21\nDeveloper ResponseMay 22, 2019 at 3:59 PM\n\nSo awesome to hear that. Thanks!", "Zodam777Jul 2, 2019 at 2:35 PM\nBuy this game now!\n\nThis game was an extraordinary experience, easily my favorite thus far. From the combat to the feeling of immersion, this what VR is for.\n\nMy only complaint is finding myself at the end. Here I am, unlocking all these incredible weapons and abilities, and I can only use them all on like the last 2 levels. Please allow me to play levels again with my full abilities! Feels like a waste otherwise!\n\nHelpful | 12", "Rocman88Sep 1, 2019 at 6:04 PM\nReally good but makes me sick\n\nIf your a Zelda fan this is for you but movement make me what to throw up but other then that its amazing\n\nHelpful | 1", "Comrade_IvanAug 7, 2019 at 9:51 AM\nGood potential but can be janky\n\nIt's not a bad game overall, but it fails on a few fronts. Namely it's very reminiscent of old-style games where you have to figure out a specific sequence for killing each boss, then repeat it ad nauseum. Also, killing enemies gives you items that are often out of reach (some will let you fetch from 30 ft away, but some end up hovering just a foot beyond my ceiling IRL and there's no way to grab them). Lastly, the color scheme makes for a poor design choice - environment elements blend together and lack contrast\n\nHelpful | 6", "ahernandez411Jul 5, 2019 at 9:16 PM\nSo far so good.\n\nI purchased this game after being on the fence. I have played the demo a few times and have to say the full version is so much more. I have only played the first level. (11% in about 45 minutes) The first level seems to be the demo level, but with so much more content and things to do. I bet the demo is and early rendition of the level before anything was polished out.\n\nI can't wait for the rest of the levels. I like the look of the levels and the details of the environment. Looking around in the environment, you can see the plants being blown around by wind and there are butterflies and other wildlife to keep it from feeling lifeless.\n\nI have experienced a couple of times where I was getting too close to my guardian boundary and it went to the pause and/or home screen, i'm hoping this is fixed with the next quest update.\n\nOverall, I'm having a fun time with this. I plan to explore and go outside the beaten path and see what is there. I do see that there are 3 save slots so it looks like it supports multiple save places, so that's good too!\n\nHelpful | 0", "franky.cole.902Aug 31, 2019 at 5:15 PM\nSuper glitchy keeps kicking me out\n\nSuper glitchy kicks me out constantly a lot of lag. I wish I could play this game especially for home much I spent on it. I want a refund! But I've tried it for over two hours but those two hours sucked!!!\n\nHelpful | 5", "NinjaMonkeyMarkJun 25, 2019 at 1:05 PM\nA Grand Adventure Awaits!\n\nThis game delivers. A wide sweeping adventure though multiple stages, where you uncover secrets, components to upgrade your gear and unlock new powers. When you enter god mode you are treated to a new view of the world and can utilize your gained abilities and powers. The sense of scale the game conveys is second to none, and the art style is a great compliment to that. Only one stage threw me for a loop, where you had to defend against waves of enemies. While still fun and more strategic than the other stages, I personally preferred the light puzzle solving and exploration of the other stages. Ill be looking forward to playing this again soon and really looking forward to a follow up in the same vein from the developer.\n\nHelpful | 4", "steve13870Jul 2, 2019 at 9:46 AM\nA great adventure awaits\n\nThis is a fantastic adventure which has some epic scale ..the monsters seem absolutely huge and it has a good progression system it is a vibrant world and one of the best fighting mechanics . Don't forget to load that crossbow...see this is why I love vr flat games just don't compare .a must buy for the quest\n\nHelpful | 0", "DAX_QcAug 30, 2019 at 10:40 AM\nOkay, fun.\n\nI own it since release in may and didnot had the heart to finish it. Its cool but i dunno. Miss something. The level where u need to run around ans defend the eggs omg NO.\n\nHelpful | 3", "ProphettJun 29, 2019 at 8:02 PM\nGreat Game\n\nI really enjoyed this game and I definitely want more games like this for Quest. Very Zelda-esque and quite charming, immersive and fun. Its one the games that really kept me coming back for more. Hope the developers are working on a sequel. Really would love to have more of it.\n\nHelpful | 0", "Jesiah_LawsSep 12, 2019 at 6:20 PM\nA must buy for quest\n\nLove this game would definitely recommend, the developers did a wonderful job on the combat and the enemie engagements. I cant help but wish for a wave based mode on some of the different environments to add more replay ability\n\nHelpful | 1", "Ditzeee22Jul 28, 2019 at 1:28 PM\nAmazing Game\n\nBeautiful style and easy to play. Only problem Ive had is with motion sickness but other then that really enjoyed!!\n\nHelpful | 0", "huiyinMay 23, 2019 at 5:46 PM\nSpectacular\n\nThis game has completely absorbed me into its world. Theres other VR games I love, but dont pass this one up, its special. The artwork is great and the mechanics feel wonderful.\n\nHelpful | 11", "tobisluAug 20, 2019 at 3:48 PM\nQuest's most compelling action-adventure\n\n.\n\nHelpful | 0", "rocky-Jul 29, 2019 at 8:48 PM\n\nI loved it I I have it 4 stars because at the end I was a bit disappointed because it ended so quickly what I recommend is a post game where you do more quests and go to more places and fight new monsters\n\nHelpful | 0", "VulpineyesJun 4, 2019 at 7:03 PM\nImaginative, challenging and innovative\n\nAwesome game. Took several days of hour long sessions to complete. The design is perfect on the quest and the characters/ enemies were engaging. Would have loved to see more re playability, more abilities and more secrets but all in all, a very well built game. Transitioning from mortal to God is super satisfying. This title is perfect for any fan of The Legend of zelda as all of the weapons and emenies are very reminiscent of that series.\n\nHelpful | 2", "Azazel08Jun 2, 2019 at 7:43 AM\nyour adventure awaits\n\nI am halfway through this game and I must say that it has far exceeded my expectatioms. Each level is varied and feels like a grand adventure. The settings options are fantastic. I wish all devs would allow this many options so that more players can find the best available settings for their individual comfort and fun\n\nHelpful | 2", "MaskaveJul 14, 2019 at 11:55 AM\nFun, but it's over now.\n\nI had lots of fun beating the game, story was nice, lots of different ways to fight, the movement gave me a few headaches, but that's just me. I wish there was more than just the story, since now that I beat it, what's left to do?\n\nHelpful | 2", "Aidens12May 27, 2019 at 4:41 PM\nFeel the power of gods\n\nDont let the simple graphic style fool you. This game has got it where it counts. The game is charming, combat is satisfying (I do particularly enjoy the whooshing and crackle of energy as you swing your sword), the enemies are varied and fun to fight, theres a sense of progression to your normal weapons(crossbow and sword/shield) and your god powers, and theres light puzzle elements to mix up the gameplay. The game makes great use of vr switching between your characters normal state and god state on the fly and you really makes you feel imbued with power every time you transform into your god form. I havent finished the game yet, but as Im going along I get the sense that (from the percentage of progress completion on my save file) my only complaint is that I would like it to be longer. Great job with this game, as it really shows you dont need super amazing technically impressive graphics to make an excellent vr experience, and it does makes good use of the art style thats there to suck you into this world . Heres hoping we get more of the same quality in the future from the developers!\n\nHelpful | 3", "torvangerJul 12, 2019 at 8:39 AM\n\nBought the game after playing the demo. I really wanted to play a game with an art style like this one in VR. Stunning graphics and great game play.\n\nI wish you could replay levels though. If I missed something I have to restart the whole game to retrieve it.\n\nHelpful | 3", "yjgaming231Jul 16, 2019 at 4:27 PM\nBest game of the century\n\nI be been playing vr since 6 years ago and Ive been waiting for a game like this to come and gives me the best experience ever\n\nHelpful | 1", "abeesen22Jun 7, 2019 at 9:38 PM\nA truely great experience\n\nHaving bought many titles I can highly recommend Journey of the Gods. JOTGs is the first Vr experience that made me feel like I was playing a full fledged game. The art style is absolutely beautiful and works perfectly with the quest. I have about 10 titles now and I can say this is my favorite. Cant wait to play more games from turtle rock.\n\nHelpful | 2", "BattleProgrammerJun 10, 2019 at 3:23 PM\nGood game\n\nThe graphics aren't very detailed and don't look amazing on screenshots, but they work well enough while in the actual game. The mechanics are good -- a lot of variety both in the player's abilities and the enemies. The plot is a bit \"meh\", not bad, but nothing amazing either, but this is a game one plays for the gameplay and not the plot.\n\nI only count two annoyances during the entire game:\n\n1. There's one section where one needs to put weight on a beam to raise the player to the right place. This happens exactly once in the whole game, and isn't hinted at all that it's even possible. Given the rest of the game it seems a bit of an oversight as every other mechanic is well explained. This one comes out a bit out of the blue, and is only used once to boot.\n\n2. Sometimes the game uses icons over characters' heads to tell the player what they want. This is sometimes confusing and obscure, and seems odd given how the game is perfectly able to give me a dialog with text. It doesn't happen a lot, but it's a bit weird and annoying -- a character that formerly could speak to me suddenly needs me to play a game of charades as if they had lost the ability to speak. There's one part where a bunch of characters stand in a circle and seem to want to shake hands. Turns out they want me to turn around and leave. That got me a bit confused for a bit.\n\nOverall none of this is a big deal, and they're the only minor details I think could be improved.\n\nHelpful | 1", "EdmCaperJun 10, 2019 at 1:29 AM\nWorth every cent\n\nA lovely game to come home to and play for an hour. Getting to explore and upgrade and fight is very satisfying. A few hours in and there's nothing I would even change about this game . The developers did a fantastic job and I'll be looking forward to any other games this studio produces. Lots of love to this game\n\nHelpful | 0\nDeveloper ResponseJun 10, 2019 at 3:07 PM\n\nThank you so much for your review! We are so glad you enjoyed the game.", "L00kingGlassJun 3, 2019 at 11:12 PM\nThe Best VR has to offer.\n\nThis game deserves to be a #1 best seller. I wasnt sure what to expect when starting it, but it immediately caught my attention. Its the most robust VR game Ive played to date. No bugs, no glitches, beautiful art and thrilling action. My only complaint is that the thumbnail on the store page doesnt do this title justice. If any devs read this, please make a more captivating thumbnail and title, youve created something really special... help other people find it!\n\nHelpful | 3", "shung1209Jun 9, 2019 at 8:21 PM\nNice game but too straight forward\n\nI mostly played a door(stage) every day and finished it in a week, I liked the game style and how it played, but there were no side quest or stories and no new game+ (progress turns into 87% again if you enter your 100% progress save), no roaming, wish the world was more bigger.\n\nHelpful | 2", "StarV10Oct 22 at 4:03 PM\n5/5 a must have for quest owners\n\nFantastic visuals and gameplay. An actual RPG for the Quest and not just a demo type game. I highly recommend it.\n\nHelpful | 0", "Rocky2234May 30, 2019 at 4:48 PM\nBest game ever\n\nThis is the Best VR game Ive ever played! If your a fan of the Zelda games you need this game as its very similar but does have its own unique style at the same time. The game is very beautiful and its world feels alive. I cant believe a mobile headset like the quest can run this, job well done to the developer\n\nHelpful | 3", "SNERTTTAug 16, 2019 at 3:34 AM\nI want to enjoy this game\n\nI honestly want to enjoy this game, its got ah great style and works great on the quest, but I just found it boring and repetitive.\n\nHelpful | 2", "StandAtlanticMay 26, 2019 at 11:02 AM\nHow single player should be made\n\nWow, I'm absolutely brown away. Unlike most single player games, this one actually tells a story and has many different features for you to play with. I just beat the first boss and I'm in love. Hurling lightning like zeus made me feel so excited. Also has a great upgrade system as you progress. I can't recommend this game enough!\n\nHelpful | 4", "elviscridMay 29, 2019 at 7:30 AM\nGreat game, but confusing at times!\n\nI'm really enjoying this game so far. Bought it after being suprisingly impressed with the demo. It's got the balance between the 2 weapons just right and they feel quite natural (although successfuly reloading the crossbow in a tight spot can be annoying at times. I'm hoping an update solves that little quibble). It does involve a bit of experimentation on the players part at times, to figure out how to move on as the game doesn't really hold your hand while playing through it, so you are left scratching your head at times and wondering what you're supposed to do next or if you have missed something! It's not too hard to figure out usually but some bits do become a bit frustrating (I am stuck at the man in the cage over the lava at the moment! Can't figure out how to get him out for love nor money!). It's quite easy to lose a good few hours in VR with this game, which is always a good sign. I tend to use the 2hrs (give or take) battery time as a sign to have a break, but if you're the type who gets engrossed in the world of VR, then you'll probably need a good battery pack, because this game seems a decent size for a mobile VR game. I'm probably 4hrs in, and I don't think I'm even half way yet. The actual levels are broken up into stages though taking place in different areas, so it's also perfect for a fairly quick (20/40min) blast of a level or two at a time. Although the art style is quite basic, the animation does an amazing job of bringing the game world to life, and the audio (especially the natives jabbering) is superb. At times the game world can be quite breathtaking with a tremendous sense of scale. I'd definitely recommend Journey of the Gods to anyone owning a Quest at the moment. The game does truly do the headset justice.\n\nHelpful | 3\nDeveloper ResponseJun 3, 2019 at 3:49 PM\n\nIf you are stuck at a puzzle, we do have a subtle hints system. After a short period of time, your controller should buzz and if you look down at your feather, you should see a flash from the god power feather that can help with that particular puzzle. Sometimes there are multiple solutions. If only there were some way to move the man out of the cage...Keep an eye out for that and see if it helps :) Feel free to hop in our Discord for more help if you need it - https://www.discord.gg//turtlerockstudios", "Tigy01May 26, 2019 at 8:44 PM\nDelightful\n\nThis is a delightful game that I cannot recommend enough. It is fairly short, but you can tell the developers were going for quality over quantity. Although it is short I do believe it has lots of replayability 5 stars.\n\nHelpful | 3", "Stryder121May 31, 2019 at 2:04 PM\nAMAZING\n\nThis is a beautiful game. A lot of effort has clearly gone in to this game and it shows. Like some of the other reviews say this is very much Zelda VR. If Zelda is your thing then this is a must buy. Lovely scenic views with a wonderful atmosphere with great exploration and combat makes this one of my favourite launch titles.\n\nHelpful | 1\nDeveloper ResponseMay 31, 2019 at 4:41 PM\n\nThank you so much for the kind words and support!", "Lawson11May 27, 2019 at 2:26 PM\nGreat VR game, a must buy\n\nI want to start off by saying this game completely changed the way I thought about VR RPGs. As someone who enjoys Zelda and other games alike, I thought this wouldnt nearly come near to being as good as them, I think its the most wrong Ive been in terms of VR games! Even if you dont like Zelda definitely give this a go. Its worth all the money and more!\n\nHelpful | 3\nDeveloper ResponseMay 28, 2019 at 3:27 PM\n\nThank you so much.", "SublimedJun 2, 2019 at 7:55 AM\nBest title I've played on quest so far.\n\nThis game is something special. It's challenging yet rewarding, calm yet chaotic, and a good balance of story and mayhem. I definitely suggest giving journey a test run with the demo before you purchase. It will get you even more excited to push that install button.\n\nHelpful | 3", "DaveThePsychoJun 8, 2019 at 12:20 PM\nTruly amazing adventure game!\n\nThe game itself is amazing. As someone who enjoys games with a bit of a challenge through various difficulty modes, the ONLY problem I had was that the last phase of the last boss was a total bs in terms of hit frames (a total of 0.3sec window to hit). Other than that, combat is great and evolving, very Zelda-like. Graphics adequate to the game, not needed for something high-end. It's definitely a worthwhile couple hours of gameplay.\n\nHelpful | 1", "alexusssJul 15, 2019 at 1:20 AM\nGood start\n\nI dont get why this game is rated so good. Yes its made well and there are some good mechanics within the game, like good mode. But the story could be explained in two sentences. Basically you have to save some birds to save the sun which gets covered by the moon.\nI think the biggest problem in vr is that developers dont have much experience on how to get into storytelling.\nAbsolutely not comparable to zelda for me.\nAs nearly every vr game in the moment i think it could be 30% cheaper compared to real videogames.\nThere are quite some bugs too:\nWithin goodmode the display gets dark if you are standing to close to a rock or something.\nMy quest has some tracking problems within this game from time to time and quits the game for some seconds, this kills the immersion for me.\nWhen you get into the pause menu within the game or if you start the game in a new session the character always looks into a direction no one needs to look, i then have to move by 90degrees to the right side to see what i want to see, this is for me a major problem within this game, especially if you dont have endless space in your room.\n\nGraphics:\nthe graphics here are absolutely not made with a lot of love, compared to zelda. I mean other characters do not even look like humans as they are constructed with some triangles, squares and they dont even have a face. I really didnt feel like saving these people as they feel ridicolous.\nOn the other hand the monster types are designed well, even though there could be a broader variety of them.\n\nSummed up: this is another techdemo for me. Story, graphics, design, bugs and othere issues that need to me worked on for a 30 dollar game. You made a good start here but i wont remember this game for very long.\n\nHelpful | 0", "MihaiDinulescuJun 16, 2019 at 2:53 PM\nTerrible tower defense bit\n\nThe game runs great, and playing it on hard is really satisfying, but there are some bits that feel tacked on, and the piece loses strength and focus as a result. The Moss philosophy of a shorter but stronger game applies here. You have a great concept here, but it doesnt seem confident in itself and its ideas enough to shine.\n\nHelpful | 0", "SnowBoundHarpyJul 21, 2019 at 7:13 AM\nGood\n\nMuch good fun\n\nHelpful | 1", "MayaviGVRMay 29, 2019 at 3:17 AM\nExcellent Experience\n\nThis was one of the first games I bought and had to say this one is amazing, the gameplay is unique and innovative the storyline and open world experience is first class, must play for the first time VR users\n\nHelpful | 2", "Efr3tJun 5, 2019 at 7:43 PM\nQuite good\n\nThis is NOT Zelda VR, but it is an entertaining game in which you can stay 7+h easily, so, plenty of content for your money. It is an overall nice experience, and even if graphically it is simple, artistically it compensates a bit and in VR it looks much better.\n\nHowever it has several issues that could be improved.\n- Soundtrack felt lacking, so minimal that you might even think, there isn't one. Some moments could have been much better with some good tracks behind.\n- Quite empty.\n- Few puzzles, and because of that, the use of some powers is very rare. A bit wasted chance.\n\nHelpful | 4", "DeadlyDestroyerJun 15, 2019 at 4:09 PM\nExcellent\n\nI've been waiting for an adventure type game like this since I bought my Rift two years ago. The moment I realised Turtle Rock was behind this title I went ahead and purchased without hesitation.\n\nHelpful | 0", "andrea.belli.359Jun 2, 2019 at 1:15 PM\nBeautiful\n\nMy only complaint is that it can cause a little bit of motion sickness. Definitely a 5 star experience, but I need to take a break after 1-hour of gameplay. It doesn't detract from the experience and there is a seated gameplay mode if needed :)\n\nHelpful | 1\nDeveloper ResponseJun 3, 2019 at 3:46 PM\n\nGlad you're enjoying the game, but sorry to hear about the discomfort. Make sure you're adjusting the movement settings from the pause menu (ie. turn vignette on, screen shake off, adjust strafe, etc.). We put a lot of options in there so hopefully people can find a configuration that's comfortable. Thanks for playing :)", "souldreamsJun 3, 2019 at 11:32 PM\nGreat game but it comes with a few flaws\n\nEnjoy the world, not an overly hard game to play and as much young and old will enjoy the game. My only gripe is that when you get to the 4th stage and after, a glitch appears where you'll periodically get stuck where you can't move, and have to restart the quest, highly annoying, but if it wasn't for that, the game would get a 5 star.\n\nHelpful | 4", "BennyQuestMay 25, 2019 at 4:03 PM\nI love it\n\nBeautiful game with the zelda vibe. Finally a full polished game again. Do not hesitate and buy it. Its a must have for the quest. The mechanics are fun and well realized. I knew I could count on the devs. They proofed themselves with left 4 dead already.\n\nHelpful | 3", "RogueJalapenoMay 21, 2019 at 11:05 PM\nBreath of the Wild VR!\n\nLove that the movement wasnt teleportation in this. If you like Zelda youll like this game\n\nHelpful | 21\nDeveloper ResponseMay 22, 2019 at 4:00 PM\n\nSo glad to hear that!", "MichaelDotJun 27, 2019 at 3:08 AM\nDecent start\n\nVisuals are ok.i think they could be much better, but they do have a decent feeling to them. Several parts you can see were rushed. Faces missing on objects that reminds you it's a game. Sometimes the pause button will not function until you hit the Oculus home button and return. I wouldn't say this is Zelda. The puzzles aren't puzzles. Anyone could figure out what they call a puzzle in no time at all. I did feel presence at one point, but only once. I think it was the first time I started getting overwhelmed by the amount of attacking characters. The ones with the tower like body and hit points all around them. Having to move around them seemed to cause more interaction. God mode is fun and could be used throughout in more ways. I really wish it were more complex. Harder puzzles. Bigger world. The sand was probably the most Zelda like, but even then it was too easy to know what I should do. The visuals though, need to be better. I'm hardly certain that the system is more capable than this. I get it's a style, but it's too low poly. Reminds me of cardboard games from years ago. They just finished the game instead of making a promise to finish and never doing it.\nIf they were to make a second one, with much more puzzles, I would but it. I think it's worth buying more, but do not think you're getting into Zelda. It's not Zelda. Although they straight up took the style of twilight princess and crossed it with windwaker. I think they could pull off a more windwaker store than they did though. Again, too low poly. Everything looks lifeless and the disjointed characters and their overlapping textures distracts. It's simple, and with the money Facebook has, they could have afforded more development than what this is.\nUpdate: finished the game last night. The last level is by far the best example of the game. The rest are not as well done. The rainbow effects are pretty amazing in the final scenes. The materials used in the final egg battle are real cool. What happened with the rest of the game? Needs to be polished.\n\nHelpful | 4", "SlappieJun 8, 2019 at 6:27 PM\nBlown Away\n\nThis game when you load in you are like whoa wait wait wait whaaaaaat! Its so intense and full of action if you get scared easily and get motion sickness fast I recommend NOT playing this though\n\nHelpful | 1", "Quest787Jun 10, 2019 at 6:02 AM\nMagical and fun\n\nGreat Zelda inspired world that also reminded me of the original and best Tomb Raider during the indoor stages. Superb combat and gameplay mechanics. A must own game for the Quest.\n\nHelpful | 0", "ArrestedDMay 22, 2019 at 6:06 PM\nNicely done\n\nGame mechanics and asthetic are engaging and enjoyable. Very happy with purchase and looking forward to playing other titles from dev.\n\nHelpful | 14\nDeveloper ResponseMay 23, 2019 at 11:29 AM\n\nMeans a lot to us. Thank you so much for your review!", "Killbot4of1May 29, 2019 at 2:34 PM\nFinally!\n\nWhen I was a kid I dreamed of being the hero in the NES rpg games I played. I have had the biggest grin on my face since I got this game. It's beautiful and a lot of fun. It controls wonderfully. Well worth the money.\n\nHelpful | 2", "stoggycakesMay 26, 2019 at 11:37 AM\nFantastic game\n\nThis game is wonderful. It definitely takes queues from Zelda, some designs and sound effects. So far it's very emersive and the locomotion of pressing up on joystick and turning where you want to walk should be a VR standard.\n\nHelpful | 1", "adinjohns2005Jun 30, 2019 at 8:55 PM\nGreat game without vr\n\nThis game is absolutely beautiful and it has a really good story as you unlock the power of the gods its great and I played it for 2 hours straight\n\nHelpful | 0", "vrgamingboyJun 21, 2019 at 5:38 PM\nBest game EVER\n\nI almost cry at the end of this game pleas make a part 2 or a free play it's so AMAZING\n\nHelpful | 1", "596772291May 27, 2019 at 5:15 AM\nGood game but sometimes dizzy\n\nIt is a wonderful game for most of people I think. However it is sometimes too dizzy to continue to play. If you have travel sick, or even slightly, please consider about it. All in all, fantastic.\n\nHelpful | 3\nDeveloper ResponseJun 3, 2019 at 3:50 PM\n\nSorry to hear you've been getting a little dizzy. Have you tried turning on the vignette and slowing your movement speed? We have a ton of options in the settings/pause menu to help everyone find something they're comfortable with.", "Inferno117May 29, 2019 at 2:13 PM\nSomthing a little new\n\nRuns great on the quest! Amazing art style, fun gameplay. The transition to godishness is a fun element! Nothing like hurling lightning down on your enemies!\nMust have for the quest!\n\nHelpful | 2", "nonrev321Jul 10, 2019 at 2:51 AM\nNeed help guide\n\nIt stops becoming fun when you are stuck to long. Needs Help guide. My wife and I had to quit playing cause we are both stuck. No more purchases until games start coming with a help guide. Be aware players.\n\nHelpful | 0", "The_Skull_KidJun 18, 2019 at 1:02 PM\nZelda nostalgia\n\nGreat story, smooth graphics and challenging enemies. Feels like ocarina time. A must buy.\n\nHelpful | 1", "JiggyPopJun 5, 2019 at 4:21 PM\nWow\n\nThis game was well worth the purchase. The scenery, visuals everything was over the top. Boss fights were epic. Here's hoping for Journey of the Gods 2!\n\nHelpful | 1", "NGdragon707Jun 5, 2019 at 9:09 PM\nRecommend to everyone\n\nThis game took my breath away with everything it has to offer. I wish it never would of ended. I nearly cried when I got to the end.\n\nHelpful | 1\nDeveloper ResponseJun 6, 2019 at 11:50 AM\n\nWow. That's an amazing compliment. Thank you for sharing that with us <3", "stijn.zaalbergJun 4, 2019 at 2:27 PM\nAmazing!\n\nThe game is amazing! Ik really really hope you will make a mode where I can use all my Powers which I had in the end and battle horde again like in chapter 2! You will get my 5 stars rating ;) Keep up the good work!\n\nHelpful | 2", "boiletteJun 4, 2019 at 3:43 AM\nVery amazing game\n\nIts a very amazing adventure game, makes a lot of fun! But does anyone know how to beat the kraken? I dont want die anymore :-)\n\nI got it, thank you very much !\n\nHelpful | 2\nDeveloper ResponseJun 3, 2019 at 3:50 PM\n\nSo happy you're having fun with the game, but sorry to hear the Kraken is proving a fearsome opponent. Spoiler warning: hints incoming. Have you been using lightning to destroy his tentacles when the big pink crystals come out of the water? You also have to make sure to keep all of your little villager friends alive. Don't forget your teleport ability! If you still find that you're stuck feel free to hop on our Discord - https://www.discord.gg//turtlerockstudios", "ZeeTheWarriorMay 29, 2019 at 8:03 PM\n\nThis was a fantastic experience and one if the best I've had in VR in the past three years!\n\nHelpful | 2", "Florayne45Jun 13, 2019 at 1:56 PM\nAwesome on Quest\n\nThis game is awesome and plays incredibly well on the Quest. I definitely recommend!\n\nHelpful | 0", "HughJorgenMay 26, 2019 at 9:56 PM\nBest Game Yet!\n\nOne of the best VR games I have ever played...its like being inside a Zelda game! Controls are perfect and the combat feels so natural! Definitely recommend!\n\nHelpful | 1", "larsonmattrMay 31, 2019 at 9:11 PM\nEnjoying this greatly!\n\nI am only partly through but the world feels large and wonderful to explore. Great title and would recommend this to try!\n\nHelpful | 1", "drewhunt32May 25, 2019 at 5:44 PM\nGreat Game\n\nPlayed it for about 40 min and had a good time. Scratches that RPG itch. Really enjoy the style and sound design. Can't wait to play more.\n\nHelpful | 2", "Sebb82Jun 7, 2019 at 1:12 AM\nSchn gemacht / Beautiful\n\nNice game and feeling. But why no spoken text? A game is better with direct speeching and atmosphere. Greetings!\n\nHelpful | 2", "sixpackulesJun 29, 2019 at 9:54 AM\n\nGreat game when it comes to graphics or game play however, the movement system is extremely nauseating.\n\nHelpful | 2\nDeveloper ResponseJul 8, 2019 at 4:14 PM\n\nSo sorry to hear that. Have you tried using vignette and slowing your movement speed? Sometimes turning snap turning off or on can make a big difference too. We have a bunch of comfort settings exposed in the pause menu if you haven't checked those out yet. I hope you find some settings that make it more comfortable!", "Aqua-VRJun 8, 2019 at 7:18 AM\nDemo doesn't do this game justice\n\nBuy it, trust me, just buy it. It's magical.\n\nHelpful | 2", "mykamunMay 25, 2019 at 9:35 PM\nGreat game!\n\nSimple graphics but gameplay is fun. Enjoyed it a lot. Totally get all the Zelda references when people talk about it.\n\nHelpful | 1", "shadester88May 26, 2019 at 12:20 AM\nCool Game!\n\nI like the content, but it makes me feel a bit nauseous :(\n\nHelpful | 5\nDeveloper ResponseJun 3, 2019 at 3:50 PM\n\nWe're sorry to hear that. Have you tried using vignette and slowing your movement speed? Sometimes turning snap turning off or on can make a big difference too. We have a bunch of comfort settings exposed in the pause menu if you haven't checked those out yet. I hope you find some settings that make it more comfortable!", "Masterblaster5Jun 11, 2019 at 10:38 AM\nGreat game\n\nGot the help I needed. Thanks\n\nHelpful | 1\nDeveloper ResponseJun 10, 2019 at 2:54 PM\n\nHey there! Sorry to hear that you're stuck. There are several god abilities you have at your disposal right now, so if you take a look at your wrist where your feathers show your abilities, one of them should be flashing to give you a hint. If you're still stuck, please join us in our Discord channel and we'd be happy to help you! https://discord.gg//turtlerockstudios", "mattdelliottMay 23, 2019 at 8:13 PM\nWow!!\n\nBy far one of the most impressive games Ive ever played in VR.\n\nHelpful | 6", "Yobiwan29Jun 23, 2019 at 12:49 PM\nPlease fix stuttering !\n\nGreat game, great ambiance. But not as smooth as the demo. I tried on 2 different Quest and same thing : the hand movements show some stuttering and break a little bit the immersion.\n\nHelpful | 0", "panthertrain1984May 23, 2019 at 7:13 AM\nGreat!\n\nLove it\n\nHelpful | 11\nDeveloper ResponseMay 23, 2019 at 11:05 AM\n\nSo glad you do! Thanks so much.", "j.c.d.williamsMay 30, 2019 at 2:06 PM\nOne of the best games Ive played\n\nI played the demo so much I paid for the full version I love this game\n\nHelpful | 1", "brand019Jun 4, 2019 at 7:47 PM\nQuest needs more like this!\n\nJust a solid single-player fantasy adventure game. A bit short (6-ish hours), but really fun.\n\nHelpful | 2", "sundaybaitoMay 24, 2019 at 2:19 AM\nWorth it\n\nCool controls, cool visuals, feels quite epic, but too basic story telling\n\nHelpful | 3", "darwins.lastMay 23, 2019 at 7:12 PM\nZelda\n\nLove this game. Deeper than I thought!\n\nHelpful | 5", "aaron.sommers.1253May 28, 2019 at 5:33 PM\nPerfect Game\n\nFor me, this game can't be better, my type of game, I Love it!\n\nHelpful | 1", "Graptor00May 27, 2019 at 6:37 PM\nImmersive fun\n\nLots of fun, sitting or standing.\n\nHelpful | 2\nDeveloper ResponseMay 28, 2019 at 3:27 PM\n\nAwesome to hear you've tried both!", "OccidusJun 3, 2019 at 6:39 PM\n\nAmazing game\n\nHelpful | 0", "angiejr1979Jun 7, 2019 at 9:40 AM\nBeautiful and immersive\n\nI tried the demo out of curiosity with zero intention of dropping yet another 30 bucks on a game after the obligatory Beat Saber purchase. From the first moment in game, the movement and combat is intuitive and engaging, the environment is stylized but beautiful and the mechanics can evoke a sense of wonder (ie: first time in \"god mode\" pulling on a tree to make it grow). The boss fight at the end of the demo required strategy and movement and provided a real sense of accomplishment on defeating it. Had no qualms buying it immediately and can't wait to see the rest of the game.\n\nHelpful | 2", "derpythekiddJun 8, 2019 at 6:22 PM\nIncredibly good\n\n5 stars all the way. Rocket man more like pocket man. Because those pockets are full of spaghetti. I sure love spaghetti. Back in 1883 I ate nothing but spaghetti for 9 months straight. Pregnancy sure is a doozy. The baby came out and it looked like a meatball. We named him Obama. On the topic of king George the 4th, he was really fat, but he cured it with spaghetti. There is a meatball sized spot on his forehead, as he resides in Beverly Hills *Italian noises*\n\nHelpful | 204"]