{"App Title": "Jurassic World", "App description": "Jurassic World: Apatosaurus \nThe Jurassic World: Apatosaurus VR Experience allows the viewer for the first time to see what it feels like to be in the presence and close proximity of a living dinosaur and to experience a sense of connection with it - with the mixture of awe, striking beauty and danger that this implies.\n\nJurassic World: BLUE \nDinosaurs have overtaken the turbulent Isla Nublar, but the threat of a natural disaster erupting looms eerily over the island. Follow Blue, a highly intelligent Velociraptor, on her quest for survival, using VR to experience her extraordinary sensorial abilities and awareness as she scours for food and water, searches for signs of life, and fights against some of the islands most threatening predators.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Adventure, Movie, Narrative", "Languages": "English", "Version + Release Notes": "1.00.5", "Developer": "Felix & Paul Studios", "Publisher": "Felix & Paul Studios", "Website": "https://www.felixandpaul.com/", "Release Date": "January 9, 2020", "Developer Privacy Policy": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\nABOUT\nTEAM\nPRESS\nJOBS\nCONTACT\nPRIVACY POLICY\nLICENSE\n \n\nFelix & Paul Studios Inc.  Privacy Policy (the Policy)\n1. Introduction & Overview\nIn general, Felix & Paul Studios Inc. collects personal information from the following sources:\nOur website\nCommunications with our company by telephone, email, etc.\nOur apps\nThe information we collect is of two types: information which you personally provide, such as via a web form or personal communications (User-Provided Data) or which is automatically collected, such as information sent by your web browser or our application (App Data).\n\nFelix & Paul Studios Inc. will use User-Provided Data only for the purpose for which you have provided it, as specified in the applicable web page, application screen, or other medium of communication. For example, if you contact us via a link or form on any of our websites or distribution platforms we will use the information you provide to respond to your request.\n\nMinors (people under the age of 18 in most jurisdictions) must obtain the consent of their parent or guardian before providing any personal information.\n\nApp Data does not identify you as a user, nor is App Data associated or stored with your User Data (except when you specifically ask us to do something which requires that combination, such as for troubleshooting).\n\nFelix & Paul Studios Inc. will use App Data for the purposes above and for other purposes relating to the business of the company, such as (but not limited to) understanding how users make use of our Experiences, evaluating and improving our technology, etc.\n\nFelix & Paul Studios Inc. does not generally share any personal information and uses appropriate security and technology measures to protect your information. Exceptions and details are listed below.\n\n2. Information Collection\nFelix & Paul Studios Inc. collects and stores User-Provided Data only as that information is explicitly provided or approved by the user. For example, if you send us an email, we collect the email address and content of that email. Similarly, if you fill out a web form, we collect the information you provide on that form.\n\nExcept for purposes of billing (see below), any payment information, such as credit card, billing or similar information will be treated as User-Provided Data.\n\nFelix & Paul Studios Inc. collects App Data from your web browser and from your use of our Experiences, which is likely to include some or all of the following: the IP address, current status (including for example processor performance and temperature), technical characteristics of your device, your use of our Experiences (including performance data, your viewing direction and other user behavior) and software. These are examples of the information we may collect; we may collect additional information as our content, software, or analytics develop.\n\nWith your explicit consent, we may also collect information about you from social media or other sources, such as Facebook, Twitter, etc. We will treat such information as User-Provided Data and/or App Data under this Policy.\n\n3. Cookies\nOur website uses cookies, a mechanism through which our website is able to identify you when you return to our site. This allows us to provide a more personal experience, such as helping us provide content relevant to your prior use of our site.\n4. Information Use\nWe will use User-Provided Data for the purposes communicated as part of the web form, app screen or other communication with the user. Examples include responding to user requests and/or providing personalized content to the user.\n\nWe may use User-Provided Data for marketing purposes. You may opt out of such use by contacting us (see below). We will use App Data to understand our users interaction with our Experiences and to improve our Experiences.\n\n5. Information Sharing\nFelix & Paul Studios Inc. does not ordinarily share personal information with any other party. The following are exceptions where Felix & Paul Studios Inc. will share personal information:\nWhere we are required to do so by law, regulation, or when sharing is part of our response to a legal claim or action.\nWhere we believe, in good faith, that sharing is appropriate to protect the rights of others, such as (but not limited to) the rights of other Studios Flix & Paul Inc. clients, third party intellectual property rights, etc.\nAs to Billing Data, as may be reasonably required for us to receive payment, such as sharing Billing Data with our bank or credit card processor.\nFelix & Paul Studios Inc. may use the services of third parties for the collection, storage, management, and analysis of personal information. If Felix & Paul Studios Inc. uses the services of a third party, it will use reasonable efforts to assure that the third party substantially complies with this Policy.\n\nIf Felix & Paul Studios Inc. is acquired by or merges with another company or otherwise transfers part of its business, it is likely that the personal information held by Felix & Paul Studios Inc. will be combined with that of the other company.\n\n6. Compliance with Law, Contact Details, Disputes.\nIn any case where applicable law requires us to deviate from this Policy, we will, of course, follow the requires of such law.\n\nIf you which to contact us in regard to a privacy issue, please write to us at our Montreal office or email privacy@felixandpaul.com.\n\nThis Policy is governed by and construed in accordance with the laws of the Province of Quebec and the laws of Canada applicable therein. In case of any dispute with Felix and Paul Studios Inc. in regard to or arising from this Privacy Policy, you agree that the exclusive venue for any such dispute will be the courts of the Province of Quebec, judicial district of Montreal.\n\n7. Changes\nWe may modify this Policy at any time by posting a new Policy at http://www.felixandpaul.com/privacy. If you disagree with any such modifications, contact us immediately and we will use reasonable efforts to remove any User-Provided Data being understood that we may then continue to use any App Data in accordance with the then-governing Policy.\n8. Definitions\nFelix & Paul Studios Inc. means the Canadian corporation bearing this name and having its head office at 350 rue le Moyne, Suite 100, Montreal, QC, H2Y 1Y3, Canada.\n\nExperiences means content, software, and/or other materials created by or for Studios Flix & Paul Inc.\n\n \n \nEN \nFR", "Developer Terms of Service": "ALEGRA\n\nA SPARK OF LIGHT\n\nGYMNASIA\n\nTRAVELING WHILE BLACK\n\nMARSHALL FROM DETROIT\n\nJURASSIC WORLD\n\nBLUE\n\nSPACE EXPLORERS\n\nNARRATED BY BRIE LARSON\n\nISLE OF DOGS: BEHIND THE SCENES\n\nTHE CONFESSIONAL\n\nCIRQUE DU SOLEIL\n\nTHROUGH THE MASKS OF LUZIA\n\nMIYUBI\n\nTHE PEOPLE'S HOUSE\n\nINSIDE THE WHITE HOUSE WITH BARACK AND MICHELLE OBAMA\n\nCIRQUE DU SOLEIL\n\nDREAMS OF 'O'\n\nCIRQUE DU SOLEIL\n\nK\n\nTHROUGH THE AGES: PRESIDENT OBAMA\n\nCELEBRATES AMERICA'S NATIONAL PARKS\n\nINTRODUCTION TO VIRTUAL REALITY\n\nLEBRON JAMES\n\nSTRIVING FOR GREATNESS\n\nPRESIDENT CLINTON\n\nINSIDE IMPACT: EAST AFRICA\n\nJURASSIC WORLD\n\nAPATOSAURUS\n\nINSIDE THE BOX OF\n\nKURIOS\n\nNOMADS\n\nSEA GYPSIES\n\nNOMADS\n\nMAASAI\n\nNOMADS\n\nHERDERS\n\nWILD\n\nTHE EXPERIENCE\n\nCIRQUE DU SOLEIL\n\nZARKANA\n\nSAMSUNG GEAR VR\n\nINTRO TO VR\n\nSTRANGERS\n\nWITH PATRICK WATSON\n\nALEGRA\nGYMNASIA\nTRAVELING WHILE BLACK\nMARSHALL FROM DETROIT\nJURASSIC WORLD\nSPACE EXPLORERS\nISLE OF DOGS\nCONFESSIONAL\nLUZIA\nMIYUBI\nTHE PEOPLE'S HOUSE\nDREAMS OF 'O'\nK\nTHROUGH THE AGES\nINTRODUCTION TO VIRTUAL REALITY\nLEBRON JAMES\nINSIDE IMPACT\nJURASSIC WORLD\nKURIOS\nSEA GYPSIES\nMAASAI\nHERDERS\nWILD\nZARKANA\nSAMSUNG GEAR VR\nSTRANGERS\nABOUT\nTEAM\nPRESS\nJOBS\nCONTACT\nPRIVACY POLICY\nLICENSE\n \nIMPORTANT  PLEASE READ CAREFULLY BEFORE USING FELIX & PAUL MATERIALS (AS DEFINED BELOW). THE DEFINITIONS ARE SET OUT AT THE END OF THIS AGREEMENT.\n\nFor all licensing inquiries, please contact licensing@felixandpaul.com\n\n1. Parties\n\nThis Agreement is between you (You or Your) and Felix & Paul Studios Inc. (Felix & Paul). You must agree to the terms of the Agreement in order to Use the Felix & Paul Materials. This Agreement is not available to any corporation, partnership, or other form of business entity. This Agreement sets forth the entire understanding and agreement between You and Felix & Paul with respect to the subject matter hereof.\n\n2. Users, User Items, and the Experiences\n\nFelix & Paul grants You a limited, non-exclusive and non-transferable licence to Use the Felix & Paul Materials, in accordance with the terms set forth in this Agreement. You may not Use the Felix & Paul Materials (directly or indirectly) for any commercial purpose and You are not allowed to provide the Felix & Paul Materials to any third party (except that you may allow others to experience a Felix & Paul Experience on your personal User Item without charging a fee). For the avoidance of doubt, any public exhibition of Felix & Paul Experiences is prohibited. You acknowledge that You will not Use the Felix & Paul Materials in any way or for any purpose that is unlawful or prohibited by the terms of this Agreement. Felix & Paul reserves the right to terminate Your Use of the Felix & Paul Materials at any time if you do not abide by these conditions. You agree to obtain any Felix & Paul Materials (including Experiences) only through a Distributor or Felix & Paul and to comply with terms and conditions set by the Distributor, as applicable. The Experiences require User Items, such as specialized hardware, software, and/or other items (usually specified by the Distributor). You are solely responsible for selecting, obtaining, maintaining, and using the User Items. Patches, updates, upgrades and other modifications to the Felix & Paul Materials will be installed on the User Items in accordance with terms and conditions set by the Distributor. This Agreement is effective from the moment you first Use the Felix & Paul Materials until it is terminated. This Agreement is terminated automatically by Felix & Paul if You fail to comply with the terms and conditions of this Agreement.\n\n3. Fees\n\nYou agree to pay the published fees for the Felix & Paul Materials, as those fees are shown on the web store, app store, or other distribution point operated by either a Distributor or Felix & Paul. You agree that You will not make any claim against Felix & Paul in regard to any fee or related matter and that Your claim will be solely against the Distributor. You agree to pay any taxes and/or other costs (such as bandwidth, equipment, or other expenses) associated with Your Use of the Felix & Paul Materials.\n\n4. Intellectual Property\n\nYou agree that all IP in the Felix & Paul Materials is owned by and/or licensed to Felix & Paul (except as explicitly otherwise stated by Felix & Paul pertaining to specific elements of the Felix & Paul Materials), and that you have no rights in that IP. You agree not to Use any part or element of the Felix & Paul Materials except in connection with the private exhibition of an Experience as contemplated by this Agreement. Except for the non-exclusive rights to view the Experiences (including the right to Use Software in connection with viewing the Experiences), you do not have and do not obtain any IP rights whatsoever in the Felix & Paul Materials or Experiences. You agree not to or attempt to (1) reverse engineer, decompile, disassemble the Felix & Paul Materials; (2) distribute, transfer, sell, lease, sublicense, assign or otherwise make available, directly or indirectly, the Felix & Paul Materials, in part or in whole; (3) copy, reproduce, modify, adapt, translate, or create derivative works from the Felix & Paul Materials; (4) remove any copyright or other proprietary notations from the Felix & Paul Materials; (5) obtain any information about any aspect of the IP in the Experiences and/or Felix & Paul Materials; or (6) extract any portion or element of the Felix & Paul Materials for any purpose whatsoever. In some cases, the Software contains free and/or open source software (FOSS), which is identified as appropriate to each licenses terms. You agree to comply with any applicable FOSS terms. In some cases, the Experiences and/or Felix & Paul Materials include the IP of other parties. You agree that you will comply with the rights of such other parties.\n\n5. Updates and Changes\n\nThis Agreement may be changed and/or updated from time to time by posting the changes on the Felix & Paul website. You agree to accept such changes unless you (1) stop using any Felix & Paul Materials and/or Experiences at the time of the change and (2) notify Felix & Paul that you reject such changes.\n\n6. Privacy Policy\n\nYou agree to the terms and conditions of the Felix & Paul privacy policy, located at http://felixandpaul.com/privacy, and to the privacy policies of any Distributor which you use.\n\n7. Health and Safety\n\nYou are solely responsible for the health and safety of owning and operating the User Items and/or the Experience, including the selection of a safe location and set-up. Felix & Paul makes no warranty whatsoever of any kind or nature with regard to the Experiences and/or Felix & Paul Materials including (but not limited to) personal injury, illness or property damage of any kind or type.\n\n8. Indemnification\n\nYou hereby agree to defend, indemnify and hold harmless Felix & Paul, its shareholders, affiliates, directors, officers, subsidiaries, employees, agents, suppliers, licensees, Distributors, successors and assigns and other users of the Felix & Paul Materials, from all damages, liabilities, claims and expenses, including without limitation attorneys fees and costs, arising from relating to any breach of this Agreement by you, or from your Use of the Felix & Paul Materials and/or Experiences, except regarding the IP in the Felix & Paul Materials.\n\n9. Limited Warranty and Limitation of Liability\n\nFELIX & PAUL ASSUMES NO RESPONSIBILITY FOR THE SELECTION OF THE FELIX & PAUL MATERIALS TO ACHIEVE ANY INTENDED PURPOSE, FOR THE PROPER USE OF FELIX & PAUL MATERIALS OR FOR THE RESULTS OBTAINED FROM USE OF THE FELIX & PAUL MATERIALS. FELIX & PAUL LICENSES THE FELIX & PAUL MATERIALS, INCLUDING USE OF THE FELIX & PAUL MATERIALS, AS IS. FELIX & PAUL MAKES NO WARRANTIES, EXPRESS OR IMPLIED, AND EXPRESSLY DISCLAIMS AND NEGATES ALL OTHER WARRANTIES, INCLUDING WITHOUT LIMITATION, IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. FURTHER, FELIX & PAUL DOES NOT WARRANT OR MAKE ANY REPRESENTATIONS CONCERNING THE ACCURACY, LIKELY RESULTS OR RELIABILITY OF THE USE OF THE FELIX & PAUL MATERIALS OR OTHERWISE RELATING TO THE FELIX & PAUL MATERIALS OR ANY MATERIAL ON ANY WEBSITES LINKED TO THE FELIX & PAUL MATERIALS. FELIX & PAUL DOES NOT WARRANT THAT THE FELIX & PAUL MATERIALS WILL BE UNINTERRUPTED, SECURE OR ERROR-FREE OR THAT THE FELIX & PAUL MATERIALS ARE FREE OF COMPUTER VIRUSES OR OTHER HARMFUL MECHANISMS. IF YOUR USE OF THE FELIX & PAUL MATERIALS RESULTS IN THE NEED FOR SERVICING OR REPLACING EQUIPMENT OR DATA, LICENSOR IS NOT RESPONSIBLE FOR THESE COSTS. IN NO EVENT WILL FELIX & PAUL, ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS OR THIRD-PARTY SUPPLIERS, BE LIABLE FOR ANY INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO, ANY DAMAGES WHATSOEVER RESULTING FROM LOST DATA OR THE MISUSE OF DATA OR PERSONAL INFORMATION, HOWEVER ARISING, WHETHER FOR BREACH OF CONTRACT OR OTHERWISE, INCLUDING NEGLIGENCE, INCURRED BY YOU OR ANY THIRD PARTY, IN ANY CASE, REGARDLESS OF WHETHER FELIX & PAUL OR ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS OR THIRD-PARTY SUPPLIERS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU AGREE THAT, IN ANY EVENT, THE MAXIMUM AGGREGATE LIABILITY OF FELIX & PAUL, ITS OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, SUB-CONTRACTORS AND THIRD-PARTY SUPPLIERS UNDER THIS AGREEMENT, OR OTHERWISE IN RESPECT OF THE SUBJECT MATTER OF THIS AGREEMENT, FOR DAMAGES, REGARDLESS OF FORM OF ACTION, WILL BE EQUAL TO THE GREATEST OF (1) CDN $100.00, OR (2) FIVE TIMES THE AMOUNT RECEIVED BY FELIX & PAUL FROM YOU IN RELATION TO THIS AGREEMENT. BECAUSE SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR LIMITATIONS OF LIABILITY, THESE LIMITATIONS MAY NOT APPLY TO YOU. THESE PROVISIONS WILL APPLY TO YOU TO THE MAXIMUM EXTENT PERMITTED BY LAW.\n\n10. Governing Law and Forum\n\nTo the fullest extent permitted by applicable law, this Agreement shall be governed by and construed in accordance with the laws of the Province of Quebec and the federal laws of Canada applicable therein. Any actions at law or in equity arising out of or in relation to this Agreement may be filed only in courts located in the Province of Quebec, Canada and You hereby consent and submit to the personal jurisdiction of such courts.\n\n11. Definitions\n\n1. Content means the images (including moving and virtual reality images), audio, text, logos, and/or any other files and creative output (in any form whatsoever, including any derivatives), other than Software, owned and/or controlled by Felix & Paul.\n\n2. Distributor means any business entity which provides distribution of the Felix & Paul Materials and/or collects fees for such distribution (such as, but not limited to, Oculus VR, SONY, YouTube, Microsoft, etc.) in accord with an agreement with Felix & Paul.\n\n3. Experience means the virtual reality experience as created by Felix & Paul, including all video, audio, and other elements, and implemented through User Items. Experience includes Felix & Paul Materials.\n\n4. Felix & Paul Materials means the Software and Content provided or made available to You, whether by Felix & Paul or by Distributors.\n\n5. IP means all intellectual property rights of every type and nature, including (without limitation) all inventions, patents, trademarks, trade secrets, copyrights, moral rights, or other intangible rights.\n\n6. Software means the computer code and/or software (in any form) which is used for the creation, delivery and/or exhibition of the Experiences, owned and/or controlled by Felix & Paul.\n\n7. Use means to install, use or to possess the Felix & Paul Materials on the User Items.\n\n8. User Items means the hardware, software, and other items necessary for the viewing and use of the Experience.\n \n \nEN \nFR", "Space Required": "64.1 MB"}



["5 stars\n51%\n4 stars\n13%\n3 stars\n9%\n2 stars\n10%\n1 star\n19%", "joesquestMay 8 at 7:41 AM\nIts free and it has dinosaurs!\n\nAfter having trouble loading up the Blue experience, I tried once more by uninstalling and reinstalling. It worked when I downloaded and stayed on that same screen until it was ready (previously exited the app to wait). Is it worth it? Yeah, it's free, it's an experience and it had dinosaurs.\n\nHelpful | 157", "TweekCMJul 27 at 9:18 PM\nA poor experience.\n\nAfter waiting through a 3GB download, I tried the blue experience.\n\nFirst off, this app will give you a terrible case of VR sickness if you don't have your VR legs.\n\nSecondly, the blue experience that I tried was short and low fidelity, despite being 3GB in size. Don't waste your time.\n\nHelpful | 5", "shashking404Jun 5 at 1:14 PM\nwhen is hand tracking support update?\n\n...holding controller while watching VR content is not fun. i really hope you are thinking to include hand tracking support.\nButtons can be clicked with hands in Oculus Quest like shown in Hololens 2 demo!\n\nAlso, there is no option to reset the view.\nNo button to tap to skip 10 seconds.\nWithout the \"mind blowing dinosaur content\" this app itself is not designed for a perfect User experience.\n\nHelpful | 5", "Bonzai_BadgerJul 3 at 8:31 AM\nClose but could be better\n\nIt has amazing detail, but there needs to be a phone companion app option to pre-download the experiences instead of waiting on 3GB to download. Hopefully they add more experiences also, because currently it's only two dinosaurs to watch.\n\nHelpful | 2", "StratogonJun 13 at 8:33 AM\nDinosaurs in VR !!!\n\nFirst of all yes, its a very short experience, but its also free so i can not understand why anyone would complain about the lenght.\n\nThe App contains two seperately downloadable 360 Videos. One is ca. 3 min. long and the other ca. 8 min. (Including credits). Due to the very slow forward movement ( second video, first video is static) i felt no motion sickness, except if i move my head too far to the sides or back and forth, but this is a general problem of 360 vids. So as long as you sit still and only rotate your head there is no problem. I recommend sitting while waching, because the ground hight feels a little wierd when standing.\nBoth videos look great, i think the dinosaurs are scaled correctly and their movements look very natural which makes the experience super impressive. The only negative thing i can think of is that it looks like the sky is kinda flickering, but your attention will mostly not be on the sky ;)\n\nAll in all it is an awesome experience and it made me realise that i want a jurassic park/world game in VR sooo badly. Just like the \"Jurassic World: Evolution\" for PC/Console but in VR. Create your own Park and be able to run around as a visitor or drive in one of those Gyrospheres. That would be EPIC!\n\nHelpful | 6", "RoreoOreo10 days ago\nNot good\n\nEven though this is free it was incredibly boring and it felt like something you would watch in a google cardboard if there was a few more videos or the ones already in it were more interesting this would of been a lot better\n\nHelpful | 1", "djspencer777Jul 21 at 3:03 AM\nCool, but not the best\n\nThis game is really cool, has amazing detail but just isn't very entertaining. If you have a kid, this would probably be great, but not for people that play games like vrchat, gunclub, and so on.\n\nHelpful | 0", "kawaski8821 days ago\nNot bad for free\n\nNice demo for the oculus if shown it to people.\n\nHelpful | 1", "Darkspaceinvader23 days ago\nNothing is free, least of all your time.\n\nYes, it's free but no, it's not worth your time. Huge 360 degree video files to download that don't look all that great. If you want good free video content use the YouTube app on your Quest instead.\n\nHelpful | 0", "donkey.xoteJul 11 at 5:15 PM\nFree + Dinosaurs = Win\n\nThere's just two small vids to experience. The longest video with Blue was, by far, the best. It was a huge download for such a short film, but it was a pretty cool experience for a VR noob like myself.\n\nHelpful | 0", "EdmCaperMay 8 at 11:51 PM\nNice new short film\n\nDon't understand why this is less then 5 stars. It's free and done very well. I downloaded the videos vs streaming cause I read that improves the quality. There are two short films . One is a few years old and nothing spectacular for 2020, but there most recent short film is fun to watch sitting down. Nice job developers\n\nHelpful | 19", "HyperMushrambo13 days ago\nLiterally nothing\n\nGod this sounded cool but it's literally nothing. No gameplay, no interaction, nothing to do. You can experience all this app has to offer in under 5 minutes and that's genuinely pathetic.\n\nHelpful | 1", "ravewaterMay 8 at 6:39 AM\nBrilliant Quality VR videos\n\nI recommend downloading the content instead of streaming as the quality is noticeably much better. Worth the download.\n\nThese guys have really set the bar high for free VR content. Well thought out stereo placement and depth.\n\nHope there will be more videos like this to come.\n\nHelpful | 15", "chewevacaJul 16 at 5:10 PM\nDownload videos fail\n\nI try to download the two videos and downloads never starts, always was at 0%.\nI try to uninstall and install 4 times, and the result is the same. Can you help me, please?\nIts possible that we need to erase directory manually on quest device.\nRegards. I hope your answer.\n\nHelpful | 0\nDeveloper ResponseJul 27 at 11:43 AM\n\nHello chewevaca, Could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!", "Bravo-November7May 7 at 10:25 PM\nGreat concept but bad resolution!\n\nBlue was stuck in limbo on a black screen, so I reloaded the game and it worked. Great concept, but it's just a cinematic, lackluster experience. The resolution was terrible. Everything was super blurry from beginning to end. It has to be one of the worst VR presentations I've ever seen. And thank goodness it was free and easy to uninstall.\n\nHelpful | 9\nDeveloper ResponseMay 8 at 10:55 AM\n\nWe are sorry you experienced this issue. It is now resolved. We recommend you download the experience for a higher quality. If you have downloaded the content and experiencing the prolonged black screen, you will need to delete the data and download it again. Sorry again for this inconvenience.", "robbieloseeMay 14 at 7:36 AM\nWorks now!\n\nPrevious comment retained below but both videos now work properly for me. All it took was a redownload of the 2nd one as the developer said.\n\nPrevious comment:\n\n\nThe Apotosaurus (360 vr) video is great. Downloaded and watched it a couple times. Pterodactyl is a nice touch. The Blue video downloaded but didnt play at all (black screen, no white loading rings). Didnt work on streaming either. Hoping its fixable as Id love to see it.\n\nI think their video compression errs on the side of high quality. If they set it down to medium it would still look awesome but would be easier to load and play. (Im thinking in terms of CRF for h264 encoding.)\n\nThose complaining of motion sickness need to know that this is\na limitation common to VR video (until volumetric video gets properly invented). Just look around but stay in one spot and you will be fine.\n\nHelpful | 8\nDeveloper ResponseMay 8 at 9:26 AM\n\nWe are sorry you experienced this issue with Blue. If you have downloaded the content and experiencing the prolonged black screen, you will need to delete the data and download it again. Sorry again for this inconvenience.", "InTheCards35May 8 at 4:02 PM\nFun, but short.\n\nPretty good experience. I recommend sitting while watching to reduce motion sickness. Hopefully they add additional dinosaurs/content along the way.\n\nHelpful | 8\nDeveloper ResponseMay 8 at 9:25 AM\n\nWe are sorry you experienced this issue. If you have downloaded the content and experiencing the prolonged black screen, you will need to delete the data and download it again. Sorry again for this inconvenience.", "MaelwolfMay 10 at 8:32 PM\nVR didnt find a way\n\nI downloaded the videos to get a better experience. First off, they are not interactive. Second, I found the graphics so blurry I couldnt enjoy the experience. Ive watched plenty of VR videos and played lots of VR games and experiences, and this just didnt do anything for me.\n\nHelpful | 3", "ScottandEmmaJul 2 at 6:54 AM\n\nVery cool. All movies should be made like this. Won't ever happen, I'm shocked VR isnt exploding, I dont get it. Truly amazing potential\n\nHelpful | 2", "zoiks_ruhrohJul 17 at 12:36 PM\nWorth the watch\n\nI appreciated this very much. Looks like a few had issues running it but it was pretty smooth for me. Its free...check it out!\n\nHelpful | 0", "That_Colin_Kid15 days ago\nBad\n\nBad VR effect made me sick\n\nHelpful | 0", "Banja78May 10 at 1:46 PM\nThanks\n\nPlease keep us the good work. Two great movies and two great VR experiences to see and show friends. As a movie fan, I believe VR can provide incredible emotions.\nFully appreciated to be able to see those in good quality free of charge. I would be happy to pay a small fee to download more movies of this quality. Thanks.\n\nHelpful | 4", "RayGhost91915 days ago\nDisappointed\n\nFelt cheated! Subpar experience!!!\n\nHelpful | 0", "miguel.dipp.14Jun 23 at 9:25 PM\nBAD QUALITY HD\n\nToo bad this good idea is not accompanied by good video quality! I also don't understand how people say it looks good ?? video quality is very poor. It gives me a lot of anger! 7 dollars and not in HD. FOR MOMENTS PIXELA. DO THINGS WITH QUALITY FOR OCULUS QUEST !!!!!\n\nHelpful | 1\nDeveloper ResponseJul 13 at 11:11 AM\n\nHello miguel.dipp.14, This application is free. Please download the experience for a higher quality rather than streaming it. Thank you", "BeatzCreationsMay 7 at 12:05 PM\nBroke\n\nDownloaded... selected the first dinosaur experience.. (warning do not move at all as gave a very motion sickness feeling) .. cancelled and chose other experience... stayed on black screen for a minute or so.\n\nUninstalled.\n\nHelpful | 15\nDeveloper ResponseMay 8 at 9:23 AM\n\nWe are sorry you experienced this issue. If you have downloaded the content and experiencing the prolonged black screen, you will need to delete the data and download it again. Sorry again for this inconvenience.", "Rhyees_PiecesMay 29 at 10:57 AM\nAwful\n\nI came into this thinking it could be a very cool experience but BOY was I wrong... First off the game didnt have 6 degrees of freedom so I got sick very fast after looking around and it reminded me of google cardboard. If youre into dinosaurs then this isnt the game for you because it is short and is a pathetic installment of a vr game.\n\nHelpful | 3", "sdwyer80Jun 15 at 4:51 PM\nNot working\n\nI wish this would work for me. I have uninstalled and reinstalled it is still not working. Very frustrating because it looks like it would be amazing. I will keep trying but no luck in about 4 days of trying.\n\nHelpful | 0\nDeveloper ResponseJul 13 at 11:14 AM\n\nHello sdwyer80, Could you send an email to qa@felixandpaul.com explaining the issue? Our team will take it from there. Thank you!", "MitchMaestroMay 9 at 4:04 AM\nFree, awesome close dinosaur encouter\n\nThe bad reviews here are soley because some problems occured, I had no troubles downloading the two video's. Blue video is AWESOME other one also cool!! It's free, fun and you can have a close encounter with F'IN DINOSAURS!! This was a childhooddream coming true! Hopefully more videos coming!!!\n\nHelpful | 2", "DireWOLFSMay 27 at 11:05 PM\nYou get what you pay for\n\nThe only reason it even got a 3 is because it's free.But it has only 2 things and both are very short.If they made more like the actual world that you can do different things in then I would give better rating.\n\nHelpful | 1", "cookie13sosweetJul 1 at 6:33 PM\nBlue is AMAZING!!!\n\nJust an unforgettable experience... download for just a moment to escape from EVERYTHING.\n\nHelpful | 1", "david.powers.33May 9 at 6:16 AM\n\nExcellent experience. The experience with Blue is every dinosaur lovers dream. I can only hope that they add more dinosaurs or experiences to this in the near future.\n\nHelpful | 6\nDeveloper ResponseMay 8 at 9:27 AM\n\nWe are sorry you experienced this issue. If you have downloaded the content and experiencing the prolonged black screen, you will need to delete the data and download it again. Sorry again for this inconvenience.", "cprachJun 18 at 10:15 AM\nMy prophetic journey\n\nThe other day I was playing another game and thought, you know whatd be perfect for the oculus? Jurassic World! And literally an hour later, this was there. Free! Yeah its short but did I mention its free? And definitely gave me chills when I played. A great experience to share with others and revisit when you have a few minutes and dont feel like shooting or swinging at anything. Id LOVE a full VR experience from Jurassic Park but Im happy with this for now.\n\nHelpful | 1", "PeentMay 22 at 11:22 PM\nEveryone loved it\n\nI got this for my family game night, and everyone turned out to love it. It was short enough for us to take turns passing around the quest. Although my grandad did have a stroke and die, but that doesnt matter because all that matters is that we got to see dinosaurs.\n\nHelpful | 1", "jelmer_s2May 20 at 1:38 PM\nReally great but really too short\n\nThis is a very nice experience that makes you long for more\n\nHelpful | 2", "mcwhorterbryanMay 9 at 12:49 PM\na visit to your local Jurassic Park!\n\nI just watched both dinosaur experiences. They are amazing. I know some have had trouble playing them. I streamed them without any issues. I am a fan of the Jurassic Park movies and this put me right next to some of the creatures I love on screen. Well done!\n\nHelpful | 2", "MightyQuinnJMay 12 at 10:49 PM\nEver dream of living in Jurassic Park?!\n\nThis is INCREDIBLE!! Really makes me want a full length Jurassic Park 360/3D film and/or game!\n\nI know from experience with 360 videography that its tricky to tell a story and keep the audience focused where you want, but this short film nailed it! Great work and Im looking forward to more!\n\nHelpful | 1", "HometMay 27 at 8:18 AM\nGet Your Casting BS Out of Here\n\nCan't show this to my little one because I can't use casting to select resume. Get over yourselves with taking away casting.\n\nHelpful | 5", "MarkarooMay 20 at 8:02 AM\nAbsolutely stunning\n\nReally fun to watch, and an amazing technical achievement. Visual effects have come so far since the first JP and this experience was better than the last few movies. 5/5, did its job.\n\nHelpful | 2", "TAZ2020Jun 16 at 6:03 AM\nTotally Amazing!!\n\nHats of to these Devs that made such cool experiences to enjoy!! These experiences are brilliant in VR! Thanks Guys!!\n\nHelpful | 0", "Twissy-87Jun 24 at 12:26 PM\nWE WANT MORE OF THIS.\n\nFree + great quality dinosaurs (when downloaded) = goosebumps \n\nHelpful | 1", "FatDoodleMay 13 at 4:24 PM\nDefinitely cool!\n\nIts a cool thing to watch but just make sure to download the movies because the stream quality is not very good.\n\nHelpful | 1", "memejesus123Jun 11 at 12:31 PM\nHorrible\n\nIts basically just a series of YouTube videos. They are poor quality. The biggest problem is that it lack 6 DOF, causing motion sickness unless completely still.\n\nHelpful | 0", "Jazzman44May 22 at 12:57 PM\nBest thing on here\n\nAs a big Jurassic park nerd this is everything I want, had me smiling from beginning to end. And its Free, how can you complain!\n\nHelpful | 2", "0ops1eMay 19 at 11:02 PM\nRun but similar available without app\n\nGood videos but no reason for a dedicated app\n\nHelpful | 0", "mob-bossMay 9 at 2:38 AM\nBored\n\nPut on for less than a minute. Blocky poor content. Deleted\n\nHelpful | 7", "mikebedolla1985May 17 at 9:43 PM\n\n\nWish they had more scenes\n\nHelpful | 1", "SublimedMay 28 at 7:23 PM\n5 stars before play\n\nDinosaurs in VR. FOR FREE??\n\nFIVE stars untill I actually boot it up and try it.\n\nHelpful | 0", "rfuentes4Jun 3 at 4:58 AM\nFantastic\n\nGreat job!!! A must see for yourself!!!\n\nHelpful | 0", "TrevordabestJun 11 at 12:41 PM\nBad studf\n\nI thought it was and actual game of Jurassic world\n\nHelpful | 0", "thiccieJun 9 at 2:06 PM\nIts fun but isnt what i expexted\n\nI expected an actual game not two 3 minute 360 videos.\n\nHelpful | 0", "element1013 days ago\nLove it, awesome simulation, so real\n\nIt feels like you are in the Jurassic park in the middle of all the action. So real. Would like to see more videos.\n\nHelpful | 0", "Sbeard1May 15 at 8:12 PM\nFantastic\n\nVery short but really impressive. Keep up the good work and make some new movies, but make them longer.\n\nHelpful | 1", "asifjabinMay 30 at 9:49 PM\nAmazing !!!!!\n\nI love it!!\n\nHelpful | 1", "REDDISHwolf11Jun 4 at 5:01 AM\nReally cool, really short\n\nThis is such a cool experience. It looks great, it feels great, all around very well done. My main issue is how short it is. There are only 2 parts, one of which is 3 mins and the other is 7 mins. I understand that, since its free, they dont need to put that much stuff into it, but I would happily pay money if I got to experience a much longer version of this\n\nHelpful | 0", "egglord667Jul 8 at 1:48 AM\nNot very imerssive\n\nThey basically stuck a 360 camera into the world and made the movie. Its not very good and when you move around with your headset the camera doesn't move either. I understand they want to control the experience but if you're going to do that just make a movie. Making something 360 does not equate to VR. Its a very unimmersive experience and disorientes you consistently. Its never clear where you're supposed to look. Not recommend.\n\nHelpful | 0", "Sanders4301May 19 at 2:03 AM\nDisappointed!!!\n\nDidnt download content!!! Wasnt worth it\n\nHelpful | 2", "urmom2019Jul 26 at 9:22 PM\nGreat stuff...\n\nReally need to get so close to dinosaurs. It's like a time machine. :-)\n\nHelpful | 0", "lil-napsJul 9 at 6:05 PM\nRooooooooaar\n\nIts dinosaurs and free I like Dino I want to be a paleontologist when I grow up :]\n\nHelpful | 0", "ShemhamJun 7 at 5:55 AM\nMotion sickness sufferers beware\n\nWanted to love this but even moving slightly the scene moves with you. This is a massive issue for me and it doesn't take long for me to start feeling sick. It looks nice enough and I understand its free but it's a no from me. Uninstalled\n\nHelpful | 0", "FrankTheTankv90May 28 at 9:18 PM\nMore!! More!\n\nThat was the most fun I had in a while. Its very short but its also very free. I wanted to download blues video, but it would cost me 3GB so I just stream it. Ps I love dinosaurs and I think the future is gonna be wild if we slowly got this going.\n\nHelpful | 0", "lewshez2602Jul 2 at 5:47 AM\nGood experience, terrible quality\n\nGreat experience as it has dinosaurs but the graphics are terrible.\n\nHelpful | 0\nDeveloper ResponseJul 13 at 11:13 AM\n\nHello lewshez2602, The download option in the application offers a higher quality over streaming. Please try to download when time permits to see this makes for a better experience. Thank you", "davisjones92Jun 14 at 1:35 AM\nVisually Stunning\n\nFree experience, with action, suspense, and dinosaurs!!\nA lot of work and effort went into this experience and it shows.\nWell worth it\n\nHelpful | 0", "DonCurleonJun 24 at 12:32 PM\nWonderful and free\n\nWonderful\n\nHelpful | 0", "661c.sanabriaJun 10 at 10:08 PM\nAmazing\n\nThis 3D 360 VR clip will make your jaw drop\n\nHelpful | 0", "joekinney100May 9 at 9:36 PM\nReally cool\n\nI hope they do more. I loved it. I would like to have been in the back of a truck while it chases you. Really cool experience.\n\nHelpful | 2", "jk3dMay 7 at 9:24 PM\nBoth download just fine\n\nGreat experience , worth taking the time for the free dowload\n\nHelpful | 4\nDeveloper ResponseMay 8 at 9:27 AM\n\nWe are glad you enjoyed both experiences."]