{"App Title": "Keep Talking and Nobody Explodes", "App description": "In Keep Talking and Nobody Explodes, one player is trapped in a virtual room with a ticking time bomb they must defuse. The other players are the Experts who must give the instructions to defuse the bomb by deciphering the information found in the Bomb Defusal Manual. But theres a catch: the Experts cant see the bomb, so everyone will need to talk it out fast!\n \nFeatures:\n Challenging puzzles  Test the limits of your communication skills and friendships?\n A different bomb every time  Procedurally generated puzzles keep the action fresh.\n Local multiplayer party game  A great way to experience VR with all of your friends!\n Only one copy of the game needed  If you can talk to the bomb Defuser, you can be their Expert. Try using your favorite voice chat service to play remotely.\n Requires 2 or more players  Bomb defusing is a team endeavor. Going solo is not an option!\n \nRequires free Bomb Defusal Manual available at www.bombmanual.com", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Puzzle", "Languages": "English", "Version": "1.8.3", "Developer": "Steel Crate Games", "Publisher": "Steel Crate Games", "Website": "http://www.keeptalkinggame.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "About\nManual\nFAQ\nContact Us\nPress Kit\nMore Languages\nCommunity\nBUY NOW\nPrivacy Policy\n\nLast Updated: May 22, 2020\n\nThis Privacy Policy sets out how we, Steel Crate Games, use and protect any information that you give when you use any of our websites and our games. We may change this policy from time to time by updating this page. You should check this page periodically to ensure that you are happy with any changes.\n\n\n\nWebsite\n\nOur website uses Google Analytics and Google Tag Manager including cookies and IP anonymization to collect activity data and track session information that we use to improve the user experience of our website. Find Googles privacy policyhere.\n\n\n\nEmail Newsletters\n\nWe use Sendy to manage our email lists and email forms. If you sign up for our mailing list, your email address and preferences will be transferred to Sendy for processing in accordance with theirprivacy policy.\n\nWe want to make sure we are sending content that you find useful and enjoy reading, so we may collect and analyze some types of data like, opening emails or clicking links, to determine the quality of our email content.\n\nYou can always view, update, or unsubscribe from our mailing lists using the link at the bottom of any email we send you.\n\nVideo Policy\n\nCan I make videos/Lets Plays/live streams of Keep Talking and Nobody Explodes?\nYes! We love it when people do that. Steel Crate Games, the developer, hereby grants you permission to make videos of Keep Talking and Nobody Explodes for video services such as YouTube and Twitch, and to monetize them if you wish. You can reference this page to show you have our permission.\n\nHave fun!\n\nBuy\n\nWhere to Buy\nPlay Remotely\n\nFAQ\n\nGeneral\nSupport\nCommercial Licensing\nNon-Commercial Use\nEducational Use\n\nContact\n\nPress Kit\nContact Us\n\nLegal\n\nPrivacy Policy\n\nBUY NOW\n\nView Trailer\n\nJOIN THE FAN CLUB, BE FIRST TO GET NEWS & UPDATES\nAll rights reserved Steel Crate Games, Inc. 2018  PS logo and PlayStation are registered trademarks or trademarks of Sony Interactive Entertainment Inc. Nintendo Switch is a trademark of Nintendo.", "Developer Terms of Service": "About\nManual\nFAQ\nContact Us\nPress Kit\nMore Languages\nCommunity\nBUY NOW\nPrivacy Policy\n\nLast Updated: May 22, 2020\n\nThis Privacy Policy sets out how we, Steel Crate Games, use and protect any information that you give when you use any of our websites and our games. We may change this policy from time to time by updating this page. You should check this page periodically to ensure that you are happy with any changes.\n\n\n\nWebsite\n\nOur website uses Google Analytics and Google Tag Manager including cookies and IP anonymization to collect activity data and track session information that we use to improve the user experience of our website. Find Googles privacy policyhere.\n\n\n\nEmail Newsletters\n\nWe use Sendy to manage our email lists and email forms. If you sign up for our mailing list, your email address and preferences will be transferred to Sendy for processing in accordance with theirprivacy policy.\n\nWe want to make sure we are sending content that you find useful and enjoy reading, so we may collect and analyze some types of data like, opening emails or clicking links, to determine the quality of our email content.\n\nYou can always view, update, or unsubscribe from our mailing lists using the link at the bottom of any email we send you.\n\nVideo Policy\n\nCan I make videos/Lets Plays/live streams of Keep Talking and Nobody Explodes?\nYes! We love it when people do that. Steel Crate Games, the developer, hereby grants you permission to make videos of Keep Talking and Nobody Explodes for video services such as YouTube and Twitch, and to monetize them if you wish. You can reference this page to show you have our permission.\n\nHave fun!\n\nBuy\n\nWhere to Buy\nPlay Remotely\n\nFAQ\n\nGeneral\nSupport\nCommercial Licensing\nNon-Commercial Use\nEducational Use\n\nContact\n\nPress Kit\nContact Us\n\nLegal\n\nPrivacy Policy\n\nBUY NOW\n\nView Trailer\n\nJOIN THE FAN CLUB, BE FIRST TO GET NEWS & UPDATES\nAll rights reserved Steel Crate Games, Inc. 2018  PS logo and PlayStation are registered trademarks or trademarks of Sony Interactive Entertainment Inc. Nintendo Switch is a trademark of Nintendo.", "Space Required": "123.5 MB"}



["5 stars\n80%\n4 stars\n14%\n3 stars\n2%\n2 stars\n0%\n1 star\n5%", "MasterDecoySGJun 24 at 11:54 PM\nExcellent game if you only own 1 headset\n\nPros:\nExcellent theme - The games theme shows through at every level of the experience, fromthe omnipresent dread of ever growing panic as the timer clicks down, to the frustration of ineptitude while you attempt to communicate clearly as fast as possible.\n\nEngaging: even though only one player has the headset, it's genuinely fun to play as either role. There is no down time for any of the players as your always either asking questions, frantically trying to find the correct page or scrutinizing the bomb for minor details\n\nGreat tutorial - the tutorial levels (basically the non random levels) do a great job of slowly ramping up the difficulty while introducing new module's concurrently so you don't get overwhelmed by information overload\n\n\nCons:\nNeeds 2 players minimum - I understand that this is a social game, but if you don't have any friends to play with, you cannot play this game.\n\nRequires clear communication - once again, I understand that this is a social game, but if you suffer from communication difficulties (say a stutter, Tourettes ect) you will struggle with this game whether your the defuser or the expert and there is no getting around that.\n\n\nOverall:\nI purchased this game for a game night I was hosting, some of the players where very new to vr and found the controls a little difficult to get the hang of, but everyone had a great time regardless.\n\nMy wife and I have since spent a few date nights taking turns defusing bombs.\n\nThe game is brilliant if it's what your looking for, just make sure it's the game your looking for.\n\nHelpful | 55", "VeryBigBoiJul 12 at 11:16 PM\nGame\n\nAyy bro is that keep talking and nobody explodes the game that gives a very immersive, intense and interesting take on defusing a bomb which is one of the most dangerous jobs in the world, the game that I really enjoyed playing because basically anyone can learn to play it in an instant which made it enjoyable for my family when they usually get frustrated with video games because they lose instantly but for this game you learn the game as you go with the tutorial in your hands at all times. One of my favourite games EVER because the pressure of having multiple things happening around you at all times (flashing lights, multiple puzzle and some that need attention at all time taking focus off your main objective and alarm clocks ping off all the time) unlike other games *cough cough Vader immortal cough* which sure has multiple objectives to focus on but only has one target attacking at once which makes this game 10x more immersive and when you blow up it just gets you more motivated to complete the objectives and when you fianally do the feeling is AMAZING ya wanna play yes\n\nHelpful | 6", "FrozztasticMay 16 at 9:04 PM\nAmazing Two Player\n\nMy lady and I got this game on a whim, as we both love puzzle games.\n\nTwenty minutes later I had the manual printed out, she had it placed in plastic sleeves in a notebook and we were on our way.\n\nThat was yesterday, we are almost done the campaign and starting to look at the Freeplay mode.\n\n5/5, if you are on the fence, love puzzle games and have someone to play with...get it. I am sure we have all spent more on games we ended up hating, and you shouldn't hate this one! (Personal opinion and experience, your milage may vary)\n\nHelpful | 82", "SyncoliMay 30 at 9:18 PM\nGreat party fun.\n\nThis game is fantastic party fun. Be prepared for your friendships to be tested..\n\nOne person takes control as the 'Bomb Defuser' they sit in virtual reality with the bomb. Every bomb they see is different from the last. They have no instructions on how to defuse the bomb.. They must communicate to the other players what they see on their bomb.\n\nThe other players play as the 'experts' they have a printed manual.. Available as a pdf from the creates website. They have the answers to everything that the defuser could ask in a 20+ page manual. They how ever can not see the bomb so must explain step by step on how to defuse the bomb from going off what the defuser sees.\n\nThe game consists of a campaign mode and a free play mode.\n\nPros -\nGreat immersion.\nTimer makes you sit on the edge of your seat.\nGreat replay ability.. Every bomb is different.\nGood to play with any player count over 2.\nFantastically written out manual.\n\nCons -\nNo online multiplayer.\nOnly one environment.. Would be nice to be defusing bombs in different environmental situations..\n\nHelpful | 23", "Allen276624 days ago\nFun to play\n\nI couldnt fit this in the title but its fun to play with people that dont like vr. Because I wang to play with my cousin but she didnt like ve so I looked for a game that had one person on the inside and another on the outside and this was perfect. We spent hours playing. Overall very good concept and idea.\n\nHelpful | 0", "HolmesJDJul 3 at 12:47 PM\nGreat group game!\n\nI bought this game so we could enjoy the Quest with a group and it did not disappoint. My husband and I have played it with just the two of us and it wasnt so hard on the earlier levels, but as you progress it is hard when you just have one person working the manual. It was so fun with a group of four or five furiously tearing through the manual to help disarm the bomb before we ran out of time. As you begin to get familiar with the different aspects, you would think it would get too easy, but then it gives you more elements at once and creates conditions that challenge your ability to do what needs to be done. Trying to beat your time or just playing with a different group of people will keep this game fresh and fun.\n\nHelpful | 3", "vrhomeov4 days ago\nGreat game for two\n\nA classic party game for two in VR. Even though only one player has the headset, its really fun to play as either role. The only thing you need is to print out a manual from web.\n\nHelpful | 0", "darvd29Jun 30 at 5:07 AM\nWhere are other languages?\n\nThe game was originally released in 2015. It has many officially supported languages, including Polish. I have printed the Polish official manual from the official page. When I bought the app I discovered that there is no language choice, only English! This is a major flaw and I do not understand it. The translations are ready, there is no work to be done - Steam version officially supports numerous languages. Oculus version does not. This game is a party game and language support is crucial. Please consider this and add another languages to the game.\n\nHelpful | 14", "nicolebell928Jul 11 at 11:09 PM\nAddictive\n\nThis game is so addictive! Its good to be able to play with others without having multiple headsets, we love it! I also love challenging games so this is right up my street!\n\nHelpful | 2", "KloppisKoolJul 16 at 3:11 PM\nBest game for showing off your quest\n\nThis game is flawless with the exception of a few minor things. 1 the table is too high and is hard to adjust. 2 the bomb is a bit of a a pain to flip over. 3 you cant float items like to you can in I expect you to die\n\nHelpful | 0", "Fluiditic_Dream83Jul 16 at 10:50 AM\nAmazing party game\n\nAbsolutely love this game and its ability to make people work together although somehow i always end up blowing up but i guess thats what you get for trusting your life to a 11yr old\n\nHelpful | 0", "scertelMay 31 at 6:12 PM\nFantastic for most people\n\nThis game is great, but only if you either A: have friend available whenever you want to play or B: are able to remember the whole manual. I feel the only missing part is a way for it to be single player. I know its meant to be Co-Op but I wish there was a practical way to play alone.\n\nHelpful | 3", "WorldplaysJul 2 at 8:10 AM\nMy teammate sucks at reading.\n\nI blew up. Still fun though\n\nHelpful | 4", "samykite13Apr 20 at 1:21 AM\nBest game ever\n\nI play this with my girlfriend, she isn't into vr at all, so I m defusing and she s telling me what to do. The increasing difficulty will keep you on your toes. The Morse code bit is really difficult. Probably the best boardgame/vr game ever.\n10/10 would play again\n\nHelpful | 7", "DoomBladeXJul 13 at 7:55 PM\nAn interesting way to do a VR party game\n\nThis game is a challenging puzzle solver. It requires getting on the same page to communicate for sure. Once you get over the hurdle of communication, it's fun on both the headset wearer and manual reader's sides.\n\nHelpful | 1", "WittyJokeJul 6 at 9:39 AM\nLove it\n\nGreate cooperative family or friends game, real fun, highly recomended.\n\nHelpful | 1", "twEEkerzFeb 2 at 5:14 PM\nAmazing local COOP game!!!\n\nMe and my wife love this game and keep coming back to it! I am usually the one with the headset on and she has the printed manual out on the table and scratch piece of paper and pen. The bomb defusing manual is no joke and really keeps you on your toes on the higher levels. Mentally the game can get pretty intense so if you hate thinking too hard I would probably avoid this. The going price is a steal at $9.99 and I hope this company makes another game similar in the future!\n\nHelpful | 76", "lexandersmith85Mar 7 at 3:52 AM\nAmazing cooperative game\n\nSuch a wonderful game for playing with friends when you only have 1 oculus headset. One of your can see and interact with the bomb, your teammate can see the defuse manual - but not the bomb. Its a fast paced description and communication game with so much fun and enjoyment to it.\n\nEasily one of the best games I own on the Quest\n\nHelpful | 14", "RYNO_423 days ago\nExcellent, challenging party game\n\nI've only played it a few times (COVID and party games don't mix), but it's a blast. The puzzles are all distinct and challenging and fun (except Maze, that's no fun), and there's so much replay value. Overall, absolutely love this game.\n\nHelpful | 0", "Rafster123Apr 3 at 8:00 AM\nGreat Game, missing one thing\n\nThis is a phenomenal game, and it's half the reason I got a VR headset. I played it a ton on PC, but trying it on my friend's Vive was breathtaking. The best part was the hidden \"elevator of doom.\" Once you best the first level, you could look under the desk and find a switch. If you flipped it, all custom levels would then be inside an elevator, with three of the four sides covered in modules. I am very sad to say that, despite that feature being limited to VR, it is not in the Oculus Quest version. Everything else about the game is great, but as someone really experienced with the game who was looking for more, I'm disappointed. If you don't think you're going to pour tons of hours into this game, then feel free to get it, because all the levels will be more than enough for you. But if you plan on really getting into it, I would get it on a different platform.\n\nHelpful | 16", "JoeXJoeMar 25 at 8:31 PM\nGreat cooperative puzzler.\n\nWork on your listening skills before you start this game. This game can really turn friends into enemies if you all don't get a system in place to figure things out. Such a great game, I own in on Steam and on Quest. You can't play it alone, but two people is very fun.\n\nHelpful | 6", "dwoodsy90May 24 at 9:20 AM\nGreat Co-op experience\n\nReally good co-op experience and a good challenge. Never too easy and never too difficult. Always come back to playing this\n\nHelpful | 1", "GoldRadioApr 14 at 4:29 AM\nGreat Game For Communication\n\nThis is a amazing game, this game is great for playing with friends that dont have a vr headset. It is a very fun game, I highly recommend it.\n\nHelpful | 4", "mogul.fat.catJun 6 at 11:05 AM\nWhere's the elevator?\n\nMore fun than playing on the iPad but there's no elevator and that's the main reason I bought the quest version...\n\nHelpful | 3\nDeveloper ResponseJun 18 at 6:37 AM\n\nHello there. The elevator room is not available for the Oculus Quest.", "NoamitoofMay 2 at 9:48 AM\nGood party game\n\nGood party game\n\nHelpful | 3", "GodlyGamingFeb 22 at 2:01 AM\nEoD (Elevator Of Doom)\n\nI Love This Game SO SO SO SO SO MUCH... But What Ever Happened To The Elevator Of Doom? The Lever Isnt Showing Up Even After The First Bomb Is Complete... Do I Have To Complete Exotic Or Not... Please Respond Soon Because I'm Kinda Afraid I Didnt Get The EoD And Everyone Else Got It\n\nHelpful | 6\nDeveloper ResponseFeb 24 at 12:09 PM\n\nHello there. The elevator room is not available for the Oculus Quest.", "ingurlundJan 26 at 10:50 AM\nNerve Shredding\n\nTwo games down and Im beginning to reassess my view that the Quest is a solitary experience.\nThis is a great game for family/friends and I now have a family of nervous wrecks. Im sure theyll be back to normal in a few years time.\nNo real criticisms spring to mind, but I should add we are very, very new to all this.\nThere have been a few comments about it all being a little in-your-face (the bomb, that is) but I cant say I noticed that.\n\nHelpful | 10", "zeewildFeb 24 at 9:23 AM\nChallenging and Fun\n\nI am so happy that some developers are working on multiplayer games for the quest that dont require more than one VR headset. This is what really drew me in and why I bought the game.\n\nThis is not an easy game, and certainly isnt for everyone. If you and your friends are up for a (sometimes stressful and frustrating) team-building challenge, I definitely recommend this game.\n\nIts fun, but know what you are getting into before you buy it.\n\nHelpful | 4", "bird_brosJun 25 at 3:53 PM\nSooo good!\n\nThis is a top notch game. A MUST HAVE! where is the golden buzzer cause you belong on America's got talent! This is a great game to play with friends. Also a fantastic party game. I can imagine it now. We set up a game night, i bring my headset, it's my turn to pick the game, I say let's play, keep talking! I boot up the game, go into the first bomb, give the headset to someone, and in a worried voice they say something like, why are there buttons, wires, and a timer? Then I say, oh did I not mention? The full name of this game is, keep talking... and nobody EXPLODES! The pure stun and shock would be perfect! Then I gather the rest of the group with the manual in hand and say, we will need this. 11/10, would FOECE YOU TO BUY!\n\nHelpful | 0", "Spikey_MikeyJan 19 at 10:15 AM\nSo much gameplay...\n\nThis game is literally the pinnacle of VR. The gameplay is an incredible conversion from the pc version, and Im happy to say that this is easily my favorite VR game. Boy how I wish there were mods, because even with the something 50+ levels, this game feels to short!! This game seriously blows every other game out of the water. I wish there was more to say, but in all honesty, there are NO problems or bugs, the game is perfectly smooth, and the game is awesome!!\n\n5 out of 5 stars is an understatement!\n\nHelpful | 7", "NSG_Imminent2Dec 17 at 9:01 AM\nBetter than I expected!\n\nIm very surprised at how fun this game really is. Paying 15$ for the game I was expecting one of those (fun for the first hour) games but Im happy to say it definitely is not that. Me and my buddy had an absolute blast playing this game. Its very fun trying to beat your past record and trying to beat each others times. However, there is 1 slight issue. You do get used to the bombs, sometimes I could just remember the instructions without even having to be told what to do, I think this could be avoided if the devs added new modules to the game, just to add some new twists. Other than that the game is very immersive, some bomb effects would be nice but its not a big deal. I would definitely recommend this to anyone who is looking for a game to play with friends or family.\n\nHelpful | 54", "Box1eApr 14 at 3:41 PM\nAmazing for family\n\nThis brought me and my dad closer together\n\nHelpful | 0", "imperfect-key478Jul 8 at 4:29 AM\nStressful fun\n\nI have a great time playing this game. I actually sweat as the timer ticks down, getting close to exploding.\n\nHelpful | 0", "mentis98Jan 12 at 6:57 PM\nAmazing\n\nUnbelievable party game. Great when you are with other people in real life or even through a call on discord. Great team building exercise and actually improved my communication skills a bit. Its great how you form little phrases with people that mean different things to save time. Amazing game all around, have had zero problems.\n\nHelpful | 4", "Mister_FonzieJan 19 at 2:11 AM\nGreat party game\n\nThis game is fun with groups of all sizes. It can be a bit confusing at first, but once you've a solved a few puzzles, you start to develop a groove.\n\nAlthough it's a group game, I don't recommend streaming the headset to the TV. You'd think it would be easier if the non VR players could see the bomb, but you end up with everyone shouting competing commands at the headset wearer about which part of the bomb to focus on.\n\n\nWe found success by letting the VR player describe a section. Without the distraction of looking at a TV, the helpers could focus on the defuse manual. We passed the headset around every couple of puzzles. It was fun both as the VR player or as a helper.\n\nHelpful | 3", "KawaiiShortcakeJan 29 at 10:46 PM\nHilarious Party Game\n\nThe game is simple, but what really makes it unique is the players involved. Communication. Is. Key. It sounds easy but when there's only so much time on the clock you have to hope your partner(s) have good communication/describing skills! It's hilarious to see your friends frazzled because they can't describe what they see or know how to read the manual. Super fun! Great buy!\n\nHelpful | 1", "Memer-gamermanJun 9 at 3:51 AM\nIts hard but fun\n\nSome levels of disarming are really hard and when it said it was two players I thought you could see the disarming manual in game and I thought you can play with online players but otherwise it good\n\nHelpful | 0", "WolfPower616Jun 21 at 8:32 AM\nReally fun\n\nPlayed it with my dad and had great fun trying to solve all the puzzles\n\nHelpful | 0", "LukeJones_13Jun 23 at 10:31 PM\nAmazing game\n\nThis game helps you bond with your friends and family\n\nHelpful | 0", "redalert33Oct 18 at 7:41 AM\nFantastic party game!\n\nOne player uses the headset to defuse a bomb, and the other play use their phone, ipad, etc. to guide the VR player by using the bomb defusal manual. Easily the most fun I've had playing a party game before. We all can't wait to get together and play it again to progress through some of the harder puzzles and levels. Must buy if you want a game you can play with a group of people, with one headset.\nNote: This game REQUIRES at least 2 people. If you want to play it solo, you can't.\n\nHelpful | 75", "TritonBossMay 16 at 2:19 AM\nWow!! Super fun game!!!\n\nI though it would be boring. A friend recommend it, but wow!!! This game is amazing. Really fun.\n\nLove that you can interact and play with my family and friends.\n\nTop 5 games in my oculus quest for sure!\n\nHelpful | 0", "dawest58Apr 7 at 10:01 AM\nU need 2 know this is a multi-player gam\n\nI've played this on my Go and GEAR so wanted to try it on my Quest. However after downloading it couldn't play it by myself 2 days ago and 2 late for a refund it sucks. The GO and GEAR share apps & I think we should at least get a discount if we purchased previous versions as the Quest games aren't cheap. I'll b more vigilant with my next purchase.\n\nHelpful | 5", "callmesolidsnakeJan 20 at 5:52 PM\nyeah\n\nawesome game but you know how a game with only one thing to do is a little boring after a while and i cant quite find people to play with. it should also have a online thing so it would actually be more fun playing with an absolute stranger or have a code thing so you can play with friends. TL;DR lots of fun but would be better online\n\nHelpful | 1", "ryanc13Mar 14 at 9:51 AM\nGood but some modules don't make sense\n\nThe developers need to sort the Simon says module out because I dowhat it tells me to do but the bomb explodes anyway\n\nHelpful | 2", "alun.hurstJan 7 at 1:33 PM\nWOW!!! What a game\n\nBest game Ive played so far. Hours of fun. Me and my daughter play on a regular basis and cant get enough. NO two games the same each puzzle is different. Definitely have to think about every move you do together and brilliant for speeding up the old brain matter. For the sake of 10.99 and some paper I would highly recommend to anyone.\n\nHelpful | 0", "goodboyfFeb 4 at 8:22 PM\nParty Game\n\nWe had a dinner party and bought this game for after dinner. We had a Blast! I never thought seeing my brother in law explode could be so much fun!!\n\nHelpful | 0", "robert.jacobs.79Feb 21 at 12:30 PM\nFun game for friends and family. But...\n\nThe controls can be a tad clunky depending on the angle you hold the bomb. Other than that, its been great.\n\nHelpful | 0", "Seth_vinFeb 8 at 12:38 PM\nWay better then expected!\n\nThe printing of the manual were annoying but the overall game was great. Playing it with your friends is the best part!\n\nHelpful | 0", "rattleheadxyzJan 5 at 7:45 PM\nTerrific Fun!\n\nI brought this over to my friends place and we took turns playing for hours! The tension and need to communicate clearly make this an outstanding multiplayer game. My only complaint is that the manual can be too confusing for its own good, to the point of being needlessly frustrating at times.\n\nHelpful | 2", "PacxDragonJan 1 at 3:57 PM\nGreat party game\n\nGreat exercise in attention to detail, giving accurate descriptions and carefully reading instructions! How much faith do you have in your friends? Everything you need is right there but can you work together against the clock? VR needs more titles like this!\n\nHelpful | 0", "JTNY23Dec 27 at 7:58 PM\nGreat fun!\n\nWhat a fun game. My wife and I play for a few minutes every night. Great way to argue with your spouse and threaten to divorce if the bomb blows up! . Seriously, we both enjoy playing this game together.\n\nHelpful | 6", "DasknockerDec 28 at 10:36 PM\nOne of the best party games!\n\nWithout a doubt one of the best games to get for get-togethers and couples that want to test the strength of their relationship. Game has a simple concept and executes it well, with a great learning curve. The manual is intimidating as heck for new players and results in such a great feeling when it finally clicks.\n\n100% blast to have people play.\n\nJust needs a online co-op mode native to the Quest (and customizable bombs) to make 5/5.\n\nHelpful | 0", "BowlerboyyyyyJan 30 at 4:35 AM\nFun\n\nI enjoyed the game and loved how its team building\n\nHelpful | 1", "kaos_nightmareJan 9 at 12:32 AM\nGood\n\nFun game, good for parties but after playing for a while I started to remember the rules slightly ruining the fun but otherwise it is very good for multiple people.\n\nHelpful | 0", "omgkurtisApr 10 at 1:45 AM\nGreat game\n\nIt's a great party game but also still fun with just 2 people. With a lot going on and differences each attempt it keeps things fresh and exciting as the bombs evolve.\n\nHelpful | 0", "psully4114Dec 11 at 10:41 AM\nIts a good puzzle game\n\nIts not a hand holder, its pretty funny at points. Its really engaging. Its replayable. Its not janky. It can be challenging without being unmanagable. It is a bit short though. I beat it in like 2 afternoons but its still got a few extra challenges in there to keep you interested. Its a good experience.\n\nHelpful | 3", "KiratzoJan 25 at 6:25 PM\nStressing in a fun way\n\nIts the title and oculus made me write a review\n\nHelpful | 0", "pheurteDec 28 at 4:00 PM\nAwesome family/group game\n\nBought this on my sons recommendation. My family has had so much fun playing this, my wife is completely addicted.\n\nCommunication skills and puzzle solving with a time limit. Great way to involve groups!!\n\nHelpful | 1", "PixelWitchDec 28 at 11:19 PM\nGreat social VR game\n\nIt can be hard to find ways to get a whole party engaged in VR games at once, since only one person can wear the headset. But this game had everyone shouting answers and solving puzzles\n\nHelpful | 0", "unRAIDJan 5 at 7:19 PM\nA blast!\n\nIts frantic fun at a party and a great teamwork exercise. The most fun part is failing and working out how to do better next time\n\nHelpful | 0", "likeaboss668Mar 31 at 11:34 AM\nGreat game\n\nThis game is really one of the funnest games to play, definitely worth the money. It gets really hard later on and requires very good communication skills. I would say this is a MUST HAVE game.\n\nHelpful | 0", "FlippinjeansDec 13 at 11:56 PM\nSo much fun!\n\nJust bought the game today after hearing about it since my PC days. Ended up playing with a few people for 3 hours! The pressure is real and the VR feature really brings you into the game. Working out strategies really helps save time.\n\nHelpful | 0", "Knarf76Mar 29 at 5:07 AM\nGreat family game\n\nThis game is perfect to play together with the kids and wife in time of Corona quarantaine. That the bombs are generated and always different is a massive positive point to keep coming back.\n\nHelpful | 0", "chaostubeJan 13 at 10:02 PM\nGreat\n\nBrings frends together with alot of fun\n\nHelpful | 1", "chet4dDec 20 at 8:13 PM\nGreat game\n\nThis is one of my favorite games. I can play with my kids and they really enjoy it too. Minus 1 star because the table physics are off and the book falls through. Otherwise its challenging and fun.\n\nHelpful | 2", "Walkingsticks7777Jan 11 at 6:17 AM\nAwesome\n\nIts a great game to play with family and friends\n\nHelpful | 0", "Viky16Dec 26 at 10:40 AM\nSo much fun\n\nIts a great game to play with friends and family. You will definetly have an amazing time and get some sweaty palms!\n\nHelpful | 0", "buzzvoltNov 30 at 3:49 AM\nGlad I decided to take a punt!\n\nDebating if I should get this or not for a little while then decided to take a punt, had a few family members round and everyone had a great time as we all joined in on various forms to defuse the modules. I agree the controllers would visually add a little extra by being hands or tools but the playability and sometimes panic people display means you are all immersed in the goal or outcome of the challenge. The manual download is a good idea, although initial frustration flicking through pages to find the right module actually adds to the panic! There is a simple look to the game but that is all it needs the objectives and functionality outweigh the design. Im not sure if you can choose a sitting position but my only downfall is the more modules you have the more you are looking down at what you need to do and for long periods physically this can put pressure on your neck, this generally can be circumvented by moving the bomb to another position but not in all cases and not with bomb sensitively increased. That leads me to the final part, the options on the game are a welcome addition depending on who is playing and how many or how challenging you want. Well worth the money for me and could replace a family board game at xmas. A Recommended buy\n\nHelpful | 0", "7amnerApr 8 at 11:41 AM\nAwesome!\n\nAs long as you have a friend or family member to do this with, you will love this game!\n\nHelpful | 0", "abelinkDec 31 at 11:01 PM\nLaughed so hard\n\nSo much fun to play in a group! Trying to communicate the morse code was hilarious.\n\nHelpful | 0", "RiceyRoniCatMar 26 at 2:55 PM\nYeah its a bomb\n\nThis game, this amazing game. The ammount of teamwork is incredible.\n\nBut, the one thing i want to see is a multi player timetrail or race.\n\nHelpful | 0", "LifinnApr 7 at 4:10 PM\nGreat game, but...\n\n...it seems you can't reset table height relative to your position in the Quest version, which means you can't play on the couch, only standing or seated on a higher chair. This really is a shame since it's such an amazing party game.\n\nHelpful | 0", "Alpharick12Dec 5 at 10:16 AM\nSuper but need some improvement\n\nCool game in coop but it needs to do some improvements like to see our hands instead of a controller. Having some tools like scissors to cut the wires will be great too.\n\nHelpful | 6", "brandondacookieNov 11 at 1:40 PM\nExactly what it says it is\n\nThis game is amazing for parties and can really work with almost anyone. It is really fun to have to communicate with others about something that they know and you dont and that they have to explain to you. It is also super entertaining to watch others try to test their communication skills and see how fast they can defuse the bomb!\n\nHelpful | 0", "RPNT_Dec 9 at 12:23 PM\nGreat port from the real life game\n\nIve played this game irl a lot as a party game and this is basically a very good port of the popular party version of this game.\n\nHelpful | 2", "derek.o.koopDec 28 at 9:38 PM\nBest party game\n\nBy far my most played VR game and a must purchase\n\nHelpful | 0", "DeviousNo0dSOct 11 at 12:43 PM\nADD ONLINE PLEASE\n\nThis is a great game for local get together as with friends and family and i dont k or if it will be too much or just too hard but i think being able to make a party with a friend and give them a digital manual to look at or somehow make a co-op bomb. Again a really fun game i just wish i could play with people that are just next to me.\n\nHelpful | 7", "dustinphillipsDec 22 at 1:30 PM\nGreat for small groups\n\nFun game! A lot of variety and enjoyment for groups of friends and family.\n\nHelpful | 0", "WVbrUNov 10 at 7:58 AM\nGreat co-op game\n\nThis is a great co-op game AND it's fun for the people not in VR. It's a favorite of mine to show a group of new players because of this. I'm even talking with my parents about playing over the phone when I'm away.\n\nHelpful | 2", "finius_lynOct 15 at 8:00 PM\nGreat group game. High replay value.\n\nThis is one of, if not the, best g and in oculus quest for groups of two or more players. It is the only have that I know of that is designed for as many players as can fit in a reasonable sized room. The have allows you to follow along a set of levels that steadily progress on difficulty or to pick the level of difficulty that you want in free play mode. This gives it a very balanced learning curve with a high degree of replay value. This have is fantastic for groups of friends and you can readily play while less than sober.\n\nHelpful | 5", "spknechoOct 19 at 9:59 PM\nGreat game for more than one!\n\nThis game is super fun. My wife and I have been playing it for the last week, and it's awesome. We have a family gathering planned soon, this is guaranteed to be a hit.\n\nI'm a casual gamer, was a way bigger gamer in my 20's, now I'm in my late 30's, not so much. Wife doesn't like video games because they're too difficult to master. She's always just watched me play games. With this game neither of us has a leg up on the other. No need to be an amazing gamer, it's just a fun puzzle solving game to play with 1 or more people.\n\nWe've only played it with us 2, but we can only imagine it'd be even better with a large group. If you don't have a large group you won't be sad though. 2 players is awesome, and we can't wait to get our dumb real life stuff done so we can play this game.\n\nHelpful | 4", "daz-23Oct 27 at 12:06 AM\nGreat Team Building Exercise!\n\nVery enjoyable game. Gets you talking and working as a team.\n\nOnly request to the developers - when the bomb goes off, it would be great if it was a bigger effect. Vibration on the controllers, and more exciting visual. But definitely a great purchase!\n\nHelpful | 0", "BosliMay 30, 2019 at 11:01 PM\nLocal multiplayer with only one device\n\nThe concept of this game is amazing and works perfectly for the portable Quest.\nOne player wears the headset and describes what the bomb in front of him looks like while everyone else has to search through the printed manual to tell which wires to cut or buttons to press.\nWhen I first downloaded the game, me and my 2 siblings played it for two battery charges straight, taking turns on who wears the headset.\nIt's crazy fun when a new module pops up, nobody knows yet how it works and you don't have a lot of time remaining. The later levels get really hard to beat and you need some good communication skills and teamwork to beat them, which is why I'll let coworkers try to get as far as they can.\nThe way the \"solutions\" are written in the bomb defusal manual reminds me of the Einstein puzzle but in smaller scale and it's almost impossible to remember them on your own since there are so many possibilities. The simple way to get better is to know which informations are important so the manual reader doesn't need to ask you too many questions.\nAll in all a fun local multiplayer game that you can keep coming back to and is a blast to play with others that know nothing about it.\n\nHelpful | 68", "brodin.greenDec 1 at 10:37 PM\nJust bought!\n\nCant wait to play it!\n\nHelpful | 0", "CasperbpDKNov 23 at 3:54 PM\nGreat fun\n\nA cool game to test your teamwork skills.\n\nHelpful | 2", "TacodeOct 21 at 1:09 PM\n5/5 would blow up again\n\nI love this game even more than I do on the PC! The graphics are simple so they work great on the Quest, and it feels even more stressful! Great if you have someone to play with often.\n\nHelpful | 1", "Clephton_ZyrekOct 4 at 8:16 AM\nAwesome fun\n\nMultiplayer with just one VR headset.\nThis game is so much fun. No matter if you are in VR or the one with the diffusal manual.\nHigh stresslevel but oh so enjoyable.\n\nI bought it on steam 2016 (pre-VR),\nI bought it again for Google Daydream.\nNow I got it for Oculus Quest.\n\nHelpful | 1", "IMoshchopsISep 29, 2019 at 9:31 AM\nFun and challenging Party game\n\nThis is a great game to play with your friends or family and is a lot harder than I expected. Dont get me wrong..the fact that it is hard is what makes it challenging and has replay value. Once you learn the different types of diffusal puzzles it becomes easier, but still not easy. Definitely worth the money and great to play with friends\n\nHelpful | 0", "alexbell78Nov 22 at 6:46 PM\nGreat game\n\nFun for the whole family\n\nHelpful | 0", "sakura6791Sep 14, 2019 at 6:24 PM\nTons of fun! Definitely recommend!\n\nthis game keeps my friends and me occupied for a long time\nwe have a ton of fun trying not to die\ngreat setup and layout\nyou dont need a ton of space, the bomb is just on a table in front of you\nconstantly changing puzzles\nmultiple levels\nHIGHLY RECCOMMEND\ngreat party game\n\nHelpful | 4", "therajmisterOct 5 at 11:01 PM\nAMAZING\n\nI have never had so much fun, here's a suggestion though, set up online multiplayer, one person is talking to the defuser, the other is the defuse, it would work just like real life, kinda.\n\nHelpful | 2", "jelwellJan 11 at 3:41 PM\nGreat party game\n\nMy friend's and I LOVE this game. I want to say a special thank you for the Developer for allowing me to upgrade my GearVR version of the game to the Quest for free this last Christmas season. Thanks!\n\nHelpful | 0", "qvaLarssonMay 23, 2019 at 11:48 PM\nThe most pure FUN Ive had in VR\n\nSo this is a really good game, the design is flawless and the gameplay is spectacular. The only reason this isnt getting five stars is because:\n\n* Physics can be a bit sloppy and unnatural, sometimes your bomb can fall under the table.\n\n* I'd rather have animated hands instead of an oculus controller mesh.\n\n* I wish I had to use tools, like scissors or anything like it for different tasks.\n\nHelpful | 269", "nitDragonAug 30, 2019 at 2:20 AM\nFun and unique VR game\n\nThis is a great game to play with your friends and family. It feels like playing a board game but with VR as a tool. Everyone can have a go either at helping with instructions or actually disarming the bomb. The game takes you through a tutorial and there are levels to progress through so its an easy start even if you never used a VR before. There is also a free play mode where you set your own difficulty and time needed to solve the bomb. Your success at levels is also saved and you can compare it with friends which is great. Before you first play it I do recommend going through the manual and maybe have different people study parts of it and be responsible for solving specific puzzles.\n\nWe ended up color coding parts of the manual which helped us a lot :)\n\nHelpful | 0", "BrandnOct 19 at 7:02 PM\nReally fun\n\nPlayed with dad and brother\n\nHelpful | 0", "N3m3sis-Q2Oct 4 at 1:58 PM\nGreat Game!\n\nI just have one question. Do other manuals actually exist and if so where can I find them all?\n\nHelpful | 2", "K1ngR0ttaSep 6, 2019 at 2:15 PM\nSuper fun game that challenges you\n\nThis game is super fun and gets harder and harder with each level. Only thing i wish it had was a mode that you could still defuse the bomb when laying down, i currently place the bomb on the chair if i am laying down in bed and trying to defuse it\n\nHelpful | 1", "gemini1976Oct 11 at 3:15 PM\nFun\n\nPlay with a group.\n\nHelpful | 0", "xRSxAug 14, 2019 at 4:13 AM\nI Love This Game\n\nI honestly didn't know If I was going to like the game or not. And i love it i like how easy it is to get the manual. How easy it is to understand what your supposed to do. Dont get me wrong it's still is a pretty hard game but it's a fun hard. It gave me a good bonding time with my brother and I know it will be just as fun with other people. It also has a replayability which I love. Sure it would be nice to have hands and scissors to cut things. But that not essential it doesn't take away the experience from the game. It's really fun. Great for partys and yeah.\n\nHelpful | 0", "BrodycodezSep 19, 2019 at 12:47 PM\nBest puzzle game on the headset !!\n\nThis game is great if you love escape rooms. It is a puzzle solvers dream game to play with friends and family!\n\nHelpful | 0", "itsDavidDugganJul 17, 2019 at 6:16 PM\nVery Fun\n\nWith a group of friends this game is fantastic. With hours worth of content and lots of replayability, and sharing the headset with others (switching roles from bomb defuser to bomb expert) this game is a must buy as a party game. I would love if this game got a new game mode of some sorts to further add to the experience.\n\nHelpful | 4", "redrulsSep 4, 2019 at 1:28 PM\n\nVery fun to play with multiple people defusing using the manual takes lots of communication and teamwork\n\nHelpful | 1", "guenter.baumann1711Sep 19, 2019 at 1:02 AM\nI seldom exploded laughing :D\n\nGreat game - my family loves playing it\n\nHelpful | 0", "z_c00lJul 7, 2019 at 8:07 PM\nYou can't play alone\n\nHi...this really is a great and fun game. I like the puzzle and the idea that you play as a bomb difuser depending on another person to tell you what to do next.\nMy only problem is that I can't play alone.\nSo, when I play with my wife, she can't figure out to even read the manual. So, you kinda need to find someone with knowledge of the game to play with you.\n\nSuggestion to developers....it would be great if you enable players to play online with other players. You get to play as difuser and someone else online play the intelligence unit. Manuals can also be viewed online...like those books you have on the pages allowing players to turn pages. It would really bring this game up a notch... receive a 5 star then.\n\nHelpful | 3", "ben.day.5836Aug 15, 2019 at 4:10 AM\nGreat fun!\n\nRecently bought this and spent 3 of us spent over 2hrs taking it in turns to be the bomb diffuser and experts. Really good fun! (Be prepared for the odd argument lol).\n\nHelpful | 0", "SkyArcherJul 7, 2019 at 11:26 PM\nGreat game, great fun\n\nI knew this game before, but this is my first time playing it. Tried it with my sister and my brother, and we had huge fun. The game is very chill and cartoony overall, but sometimes things get very tense and cooperation becomes extremely important. Its a greatly accomplished game.\nI believe it just needs a bunch of things to get a perfect score:\n\n* Make the player height adjustable. Its easy to sit on a chair that doesnt match the VR height, so the game table is either too high or too low.\n\n* Make it possible to grab the bomb and physical objects with two hands. It comes natural and breaks the immersion when you see its not working...\n\n*Physics needs a bit of refinement, things can go through the table sometimes.\n\nHelpful | 2", "obi2kenobiJul 7, 2019 at 4:38 PM\nFun game to play with my VR skeptic wife\n\nMy wife tends to hate on VR, so it was great to find a game that we can play together that she really enjoys. As usual when I've had her try something (beatsaber, first steps) she grimaces for a few minutes as she muscles through her disdain for VR, and after a few more minutes she is smiling and having a great time.\n\nI wish I could give it 5 stars just for making a fun group game, with clever puzzles that are randomly generated to provide near endless replay value. But as the top review from martin.larsson98 states, there are a few interface issues that really need attention.\n\nI agree with everything he says:\n-needs better physics (stuff drops through the table which is inconvenient)\n-needs hands instead of controller silhouettes for increased immersion\n-needs tools present like scissors for cutting wires to increase immersion\n\nMy understanding is that this was originally a 2D game that got ported to VR and that shows. It seems like minimal effort was put forth in taking advantage of the VR perspective, which is disappointing.\n\nStill, this is a great party game, and for $15 this is something you can do with your family/friends and you will get way more mileage out of this than \"walking the plank\" for the same price (which is another great party experience, just with zero longevity for the price tag). Wish we could do half stars and I would put this at 4.5*\n\nHelpful | 5", "ShouldYouPlayThisAug 18, 2019 at 7:57 AM\nYes\n\nYes\n\nHelpful | 2", "JC007Jun 9, 2019 at 9:13 AM\nVery clever group puzzle\n\nNot sure what I was expecting but very pleasantly surprised. Best when played with group of three or four. Not optimized for Quest, though - should definitely use animated hands and improve colliders of bomb and table so they ca t overlap.\n\nHelpful | 5", "RSP_SynarchyJun 23, 2019 at 8:34 PM\nAmazing, and pure fun.\n\nEverything about this game is so fun! From the local multiplayer, new and challenging modules, and the levels are never the same so if you die its completely different, which allows for enjoyment even after the game is completed. This game is a must-have.\n\nHelpful | 0", "argerichJun 19, 2019 at 11:51 PM\nFun and Challenging\n\nI would definitely recommend this for everyone. It is as fun as it is frustrating. My family and I have had some intense shouting matches over this game, you'll understand when you play.\n\nDeveloper recommendations: Virtual hands and tools would be very welcomed on a future update.\n\nHelpful | 5", "TheGermanChiefJul 28, 2019 at 5:26 AM\nAwesome\n\nThe funniest multiplayer game for online and offline use with friends.\n\nHelpful | 0", "FurryimbicleJul 17, 2019 at 3:14 PM\nWooooo\n\nReally fun if u uave a friend either on discrd or with u totally recommend\n\nHelpful | 1", "GubleMay 31, 2019 at 3:37 PM\nMy favourite game by a long shot\n\nIts a VR experience that everyone can join in on. Theres three great ways to experience this game:\n- as the bomb defuser, trying your best to communicate what you see with the bomb expert\n- as the bomb expert, trying to find and voice the solution as fast as possible\n- and as a spectator, watching the defuser and bomb expert(s) (especially when the bomb expert isnt much of an expert.)\n\nBecause this game is so inclusive of those around you, its by far my favourite game. The bombs being procedurally generated gives this game a lot of replayability and always keeps you on your feet.\n\nId love to see some future expansion packs with new modules for an even greater challenge, but the game is great even if it stays in its current state.\n\nHelpful | 4", "ryanrutanMay 24, 2019 at 7:08 PM\nAmazing Puzzle Party Experience\n\nExcited to see where they take this game! My daughter wishes it wasn't a bomb, but more of a chest that you have to unlock in a time to save the treasure inside or something. #LoveIt!\n\nHelpful | 11", "DaveBowlesJul 2, 2019 at 11:24 PM\nAwesome.......MORE CONTENT!\n\nLove this game......great with friends. Bring in more content with new bombs and environments\n\nHelpful | 0", "dgrgichJun 5, 2019 at 10:04 AM\nGreat group/team-building game\n\nI enjoy playing with kids and co-workers alike. I printed and laminated five manuals and now have a party in a box with my Quest. Absolutely great game.\n\nHelpful | 2", "travis.balmelliMay 27, 2019 at 10:19 AM\nSO FUN!\n\nIve only been playing for a day but I cant stop thinking about it. So well done. I watched a couple videos and there are different modules out there. Will those come to quest as well?\n\nHelpful | 3", "JahudoJun 3, 2019 at 4:46 PM\nA great party game!\n\nThe game works great on the quest. There is a fun learning curve to the campaign with different puzzles and time limits. This is a great way to introduce new people to vr!\n\nHelpful | 1", "brand019Jun 4, 2019 at 8:00 PM\nA perfect multiplayer title.\n\nThere really isn't anything like this game. It's a great way of using VR's exclusive nature as a tool for multiplayer fun.\n\nHelpful | 1", "pixelericJun 2, 2019 at 8:45 AM\nVery fun\n\nPlayed it at school with a group of friends, tons of fun.\n\nHelpful | 2", "dorsal_f1nMay 23, 2019 at 5:04 PM\nSolid Party Game\n\nThis is a must-have game for VR. Best played at a party or with a group of people on teams. This game never gets old!\n\nHelpful | 6", "IcebergJDJun 13, 2019 at 6:55 PM\nTeam building\n\nPlayed at work with my coworkers. Great experience.\n\nHelpful | 1", "Andrewman03May 28, 2019 at 7:08 PM\nExtremely fun\n\nEverything about this game is great and I love being able to take it wherever I want\n\nHelpful | 1", "mturekMay 26, 2019 at 6:32 PM\nGreat puzzle game to play with others\n\nBest multi-player VR game yet\n\nHelpful | 2", "NoWhereMan1019May 21, 2019 at 4:21 AM\nThe best local multiplayer VR game yet!\n\nGet ready to test friendships with this game. Awesome devs for supporting cross-buy!\n\nHelpful | 24", "pizzalover333Jun 6, 2019 at 7:13 PM\nDont download\n\nWont download on my oculus quest!!!!!\n\nHelpful | 3\nDeveloper ResponseJun 13, 2019 at 6:18 AM\n\nHello cortkaufmann. This sounds like an issue that may require Oculus's help to fix. But before doing that, we'd love to help try to get your game running as it should. Please email us at support@keeptalkinggame.com and we'll get back to you shortly.", "MiniMan876May 26, 2019 at 12:17 PM\nPaid without imformation of a headset\n\nAfter I paid for it, it said can't install without headset after I paid for it which sucks\n\nHelpful | 6"]