{"App Title": "Kingspray Graffiti", "App description": "Create amazing street art with VR. Sharpen your skills or learn new styles with thousands of online artists from around the world. Up to 4 simultaneous players collaborating at once. Customize your in game avatar by designing your own hat, mask and spray can. Use True to life Ironlak Aerosol colours to design and develop skills and bring your concepts closer to reality. Feel immersed in 12 realistic environments including a trainyard, Alleyway, dusky city rooftop, and an abandoned subway station! This is just a fraction of the awesomeness you will find in Kingspray. Can't WAIT to see what you make!", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Art/Creativity, Casual, Simulation", "Languages": "English, English (US)", "Version": "71.5", "Developer": "Infectious Ape", "Publisher": "Infectious Ape", "Website": "http://www.infectiousape.com/", "Release Date": "October 17, 2019", "Developer Privacy Policy": "None", "Space Required": "1.36 GB"}



["5 stars\n82%\n4 stars\n13%\n3 stars\n3%\n2 stars\n0%\n1 star\n2%", "data_daveJun 23 at 6:04 PM\nAwesome, but...\n\nI love KingSpray, I do! I love the music, I love the sound of the spray, I love the ability to make art on a wall.\n\nBUT... (at least on the Quest) there's no way to get it out of the app. The only option to share is within the game. I really don't understand this, because the first thing I wanted to do was post it on Insta or at least make it my profile pic on Facebook.\n\nThis won't stop me from making graffiti, but it will stop me from showing you what I can do.\n\nHelpful | 91", "PhantomHazard10 days ago\nThis made me write a review (Buy it!)\n\nThis is one of my favorite experiences in virtual reality or otherwise. It is something that MUST be experienced to understand just how good it is. It has extremely realistic spray simulation, and AMAZING atmosphere. Switch on the built in radio, pick your colors, and get lost in the moment. You forget you are in VR sometimes. I dont write reviews nearly ever, but this application made me write one so that I can tell you to buy it now.\n\nHelpful | 2", "upscaledonutJun 21 at 9:19 PM\nGreat game to learn!\n\nIve wanted to try doing graffiti since I was a little kid at the local skate park, I saw this game and immediately bought it and spent 3 hours on a work night learning the basics, I noticed some complaints of no sort of tutorial but to me that made the experience all the better because I really had to improvise and use my own ideas! I highly recommend it!\n\nHelpful | 20", "4nqtJun 10 at 3:45 PM\nFun game just one suggestion\n\nOverall this game is awesome for people who are having a tough time finding legal spots to express their art. People who want to get into graffiti but dont know how its more difficult in this game. I suggest to have tutorials on bubble letters, maybe just even outlines of pro graffiti to trace over.\n\nHelpful | 24", "pain1918 days ago\nAmazing game\n\nThis game is awesome and I can never get bored while playing it, there's just endless things to make when it's thought of and although it would be nice to have an undo button, I like how it stays true to only spray painting and provides a challenge to get as many details you want to have without a mistake\n\nHelpful | 1", "lbcotton05Jul 6 at 9:23 AM\nGood for doodling\n\nHas great and realistic feel to it and gives u the graffiti experience u always wanted. its realism is incredible and not to mention that there are hundreds of colors to choose from. not gonna lie it does get boring after about an hour but its still a fun game when all u want to do is express ur imagination. 10/10 most definitely.\n\nHelpful | 4", "2spookycatsJul 16 at 8:19 AM\nIts great!\n\nOn the real, exceeded expectations. Only had quest for a couple weeks, and this is my most played app. I'm amateur at graf, but known fundamentals, and I've already improved so much by mucking around in kingspray.\n\nIf you are into getting up and wondering if its worth it to buy, yes, yes it is. Response is amazing and feel is near perfect.\n\n\nCritiques:\nAlll are quality of life, none keep me from enjoying the app.\n\n1. The online mode seems iffy. I've only been able to join 1 other persons game. I wish there was an auto join whoever function, and maybe an auto accept invite toggle when you host.\nMaybe I'm doing something wrong.\n\n2. It would be cool if I could stream music via a YouTube playlist for anyone in my \"room\" to hear.\n\n3. Having a hard time getting reference pictures to work on quest. In game instructions don't make sense to me.\n\n4. Save feature and choosing if im publicly sharing the image or not seems vague. Like sometimes i save something in progress but I not sure if that save is being shown in the lobby.\n\n\nLove this app. Ty kingspray crew.\n\nHelpful | 1", "TydenceJul 29 at 1:47 PM\nI lose myself in this one\n\nIv used this program more than anything else Iv purchased. Multiplayer is fun. Its quite realistic. (No undo! And you dont get much more than a cellphone photo when you are done) But, its a good way to lose an hour or so. Im kind of glad this wasnt around when I had access to a train yard. But, if it was... my work would have looked great!\n\nHelpful | 0", "LigmaTidz6 days ago\nExcellent Game\n\nThis is such a nice tool for graffiti writers and creative types. Probably the easiest way you could ever practice spray painting a wall. I hope they keep adding more content to this game.\n\nHelpful | 0", "kronzilah19 hours ago\nPretty Dope\n\nIts a wicked game, takes a little getting used to, and sometimes gets a little laggy when playing hours on end. Also I truly wish you could paint everything, not just a specific wall within your location. Other than that, its pretty dope, and one of my favourite games for the Quest.\n\nHelpful | 0", "AugvisionJul 25 at 5:54 PM\nA Great App\n\nIve done a lot of art but never graffiti in real life, Ive used spray paint. The physical reaction of the paint can feels very realistic from my experience and the freedom of full motion is great.\n\nWhether or not I actually do graffiti the art practice has actually helped with my regular drawing.\n\nHelpful | 0", "Marioboy1Jul 25 at 6:25 PM\nIm no artist\n\nI was looking for a creative game on the oculus, and I found this, and decided to give it a try. It is totally worth it! Even you can hardly draw stick figures like me, look up some tutorials on YouTube and youll find yourself creating really amazing art that you didnt think you could create. Great game!\n\nHelpful | 0", "billbeckerartJul 9 at 4:09 PM\nDont hesitate. Worth the money...\n\nI've been using spraypaint regularly since 1992, and this would have changed my level of skill by leaps and bounds back then. It's a phenomenal app.. I love it more every time I play it.\nMy one request is the ability to remove young bucks that youve accidentally accepted into your room..\n\nHelpful | 2", "pittbullpuppieJul 21 at 5:37 PM\nI Am 48 ....now 19 again.\n\nI love it ...Im 48 ..and I feel like Im in my teems again...no sneaking out at 3am to paint ...i can spray up a piece when ever I want..I even found myself shaking the can when thinking on what to,paint next....I love the sound of the can rattle ..I raise my glass to you devs..well done...burp..\n\nAll I need is a undo last spray/stroke button...not realistic I know ,but would help...\nI try to save a lot ,that way if its a big boo boo (mistake) I just reload last save\n\nAlso a feature where u can upload a sketch to in game phone to be used as a reference pic. Would be awesome..\nWell my quest is charged ,and Im off to rattle those cans..\n\n\nI LOVE THIS APP......THAK YOU DEVS!\nCHEERS....\nD.TEKT (MY LEGAL TAG)\n\nHelpful | 1", "GummybearPopperMar 28 at 1:00 PM\nAwesome game!\n\nGraphics are great! Color selection is plentiful! Different caps to get a variety of sprays are fun and useful. You even get to listen to some music while you make your art. The concept is simple and very well executed!\n\nThis game is awesome! Much better than I anticipated and definitely a keeper.\n\nIf the developers are reading, I have a few suggestions to this already awesome game that would make it SUPER awesome!\n\n1) I'm not a graffiti artist, nor do I have any art background. It would be nice to have a \"tutor\" program, or stencils, \"tips and tricks\" or something that could help guide beginners to be able to start creating art out of a blank canvas.\n\n2) For us beginners, it would be nice to have a setting where we could \"undo\" a mistake. I get frustrated when I've been working on a piece for awhile, then mess it up with a stupid mistake and have to start over.\n\n3) Is there a way we could play our own music? I didn't see that option. That would be very cool.\n\n4) Not sure if this is doable, but it would be awesome if we could upload a picture and pull it up to reference while we paint. I know this is not realistic, but for all us non-graffiti artists, it would make the game much more enjoyable.\n\nHelpful | 173", "shadow44519 days ago\nAmazing game but please add these\n\nThis game is great for practicing without wasting paint but I just have some requestssssss a Astrofat cap would be amazing for those T H I C C tags and a roller would be really cool to mess around with\n\nHelpful | 1", "Puerto-the-RicoJul 16 at 10:24 AM\nVR tagging at its best\n\nSo far I have been very very happy with this purchase. With a wide range of colors, caps, local, and a variety of trip hop tracks it really brings out the inner creative genius. A few things Ive come across that would greatly improve the experience\n\n1. Found a bug in the game where is I scroll through the gallery to far back everything goes black and I have to close out and restart the game to get it back.\n\n2. Allow for more climbable items. For instance when painting up the delivery truck I can only access so much out it and have yet to find anything that can elevate me.\n\n3.Easier way to track your artwork and the likes its got. A black book would be cool.\n\n4. More areas to cover. I wanna be able to bomb the ground to. I had an idea to do a piece that starts from the wall to the ground.\n\n5. More stages and tracks or the option to upload our own.\n\nAll and all this was money well spent and hours can fly by when you get lost in your art work. Easily worth the money spent!\n\nHelpful | 1", "MegaCole1904Jul 15 at 8:47 AM\nAmazing\n\nThis has been one of my favourite games as an artist since I first downloaded it. The attention to detail is amazing and the controls make you feel like your using a spray can. I was glad to see an update including the ability to make yourself taller with various objects as well as the ability to customize your look to other. That being said I have noticed some lags and glitches to the game that made it feel less real, some examples are the ladder disappearing through the floor and not coming back, this is especially frustrating after working on a piece of art for a while and having to restart due to the ladder disappearing. In the future my only suggestion to the game would be the ability to make customs stencils and the ability to upload reference pictures.\n\nHelpful | 0", "azneyesJul 14 at 11:13 AM\nTo whom it may concern;\n\nThere is no other game available cross platform to land the quality that's been handed to us for a near 15 bones. All of the aspects with an unlimited amount of resources is what's going to grow the graphitti community online and hopefully for the streets to see!! This ones for the big apes in development that made this all possible!! Peace love and empty cans \n\nHelpful | 0", "thomas.seidl13 days ago\nSo much fun...\n\nEndless supply of every color? Yes, please! Environments are good but not overdone, spray is very realistic and satisfying, feels like realz. Def a blast!\n\nHelpful | 1", "RichyRammington22 days ago\nKingspray's the bees knees\n\nSuper dope. Use a link cable to put a reference picture on your in-game phone so you copy that bad boy like a champ.\n\nHelpful | 2", "skewoopJul 23 at 4:41 PM\ni love this game... but...\n\nthis game is amazing. i just wish there were a few extra features added to it...\n\n1. walking option, teleport is ok but i often find it puts me either too far forward of my mark or not close enough, mostly too close. it seems to want my head planted in the wall quite a bit. making the wall impossible to pass through would also fix this issue but i still want a walk option so i can gradually move smoothly as i progress.\n\n2. i also vote for a day/night mode... with possible lighting options on phone, maybe ability to pick and set lights around a night scene for some raw graffiti feeling or head lamps or flashlight that can be placed somewhere.. just saiyan..\n\n3. i would love to see something along the lines of tools. things that could help change texture like a sponge or brush. maybe make a brush capable of being sprayed and then flick it at wall for dots or brush in a fine detail.. i know thats probably a bit out of the realm of graffiti but options are a great thing, versatility... hell even a crumpled piece of news paper would be great...\n\n4. i would love to have more stencils, better organized stencils and the ability to create stencils... currently the stencils are very laggy when loading and it seems the stencils i can pick from change constantly like it loads chunks of stencil selections at a time.. i will scroll through the same 10 like 3x before it decides to load another batch of them but then all the previous ones i saw disappear...\n\ni cant think of anything else off the top of my head but anything like what i mentioned i feel would be a great addition and i hope others think so too.. if you read this, thanks for taking the time. i still absolutely love your game.. hope to see more updates for it in the near future... maybe some crazy new locations?\n\nHelpful | 2", "netstan13 days ago\nLearning curve, but excellent\n\nBecame a lot simpler once I discovered you can pull up hello from the left controller button. Excellent, realistic, painting experience.\n\nHelpful | 0", "Ironbug78Jul 9 at 6:55 PM\nRelaxing app\n\nThis app makes you feel like you are outside really tagging. The stress just melts away getting lost in this app for hrs. Its one of the few VR apps that lets you paint amazing looking 2D images on to 3D surfaces.\n\nHelpful | 2", "BlackDragon7643Jul 21 at 1:24 PM\nGreat game!!!\n\nGreat game. The painting mechanic is great. It's really accurate. If you need help with a painting then you could go on multiplayer and get help from other people. Highly recommend the game to people who like to paint or draw.\n\nHelpful | 0", "MaddoMakkusu21 days ago\namazing\n\nAlmost perfect, I'm enjoying it so much!\n\n2 feature request:\n\n1: ability to go up\n2: ability to use tape to mask areas.\n\n\ncheers!\n\nHelpful | 1", "GrippaJun 15 at 3:06 PM\nGreat app\n\nBeen a graff writer for a number of years. This is a app sent from the graff gods themselves. Too old and fat to run away from the transport police now and free walls just get buffed before I've made it to the car. For the price of three cans you can get this app so it's a no brainer. It takes some adjustments coming from real cans but if you put the hours in you can bang out some quality pieces or just put up a quick throwie. Lots of fun and it's a great way to learn the craft if your new. Great community online (mostly). Wish they had a way of making simple stencils for backgrounds and maybe a roller but other than that I've got no criticism\n\nHelpful | 2", "SalmonHead18 days ago\nVery fun\n\nI like it a lot and I like how they have a radio system so that when I am painting I dont listen to silence\n\nHelpful | 1", "Not_Yo_Average_JJul 27 at 2:07 PM\nGreat!\n\nI really like this game! My biggest problems are the fact that you have to add reference images to the files manually, you cant get as close as youd like to a wall because you'll be 'out of bounds' and sometimes you'll spray randomly by mistake because of the screen blacking out, and there isnt enough color palette slots for my liking\n\nHelpful | 0", "Microwavable_bananaJul 22 at 6:45 PM\nGood but one issue\n\nIts an amazing and realistic game. Love it. you can add reference pictures BUT you have to go threw a bunch of trouble to do it. Why not just ask for our permission to access our photos so we can pic whats in the gallery. Its stupid that such a great game has such a weird and annoying thing like that.\n\nHelpful | 0", "ScowlinMunkeh23 days ago\nKeeps crashing\n\nI am so disappointed that this keeps crashing when Im just getting stuck into a creation.\n\nEvery time.\n\nI have not been able to complete one painting yet. The game freezes, throws me out, and when I return all progress is lost. So for me this game has been a total waste of money.\n\nIt is such a shame - it showed such promise, and I really wanted to get stuck into some artwork.\n\nI am quite sad about this. A refund would be nice. Or maybe a promise of a bug fix from the developers.\n\nHelpful | 1", "5tanFeb 27 at 9:38 AM\nAwesome but i have ideas\n\nIm a industrial spray painter so i know how paint and spray paint reacts and this is spot on! I would like to see more music maybe connect it with spotify or something maybe some more scenes to paint and maybe (this might be stupid) a undo button to quickly fix your mistakes ! I would also love to have a pro mode where you need to shake the can to improve the way it works for the rest i recommend this game to everyone who likes art or paint\n\nHelpful | 230", "parorange62Jul 23 at 11:19 PM\nI always wanted to try graffiti\n\nI always wanted to do graffiti and now I finally have the chance to do it, now I know Im not the greatest but its only uphill from here\n\nHelpful | 1", "akademikerpunkJul 14 at 12:14 PM\nPerfect\n\nThis game is the sole reason i bought my Oculus Quest. I tried it at a friends and was just blown away. So addictive so realistic. I can spend an entire session just doing flared out tags\n\nHelpful | 0", "pentaphobeJul 18 at 9:58 PM\nAbsolutely Amazing, but save often\n\nThe whole experience is just bogglingly good, I could lose days to this but thankfully I am forced to take a break when my headset needs to charge\n\nBe careful though - there's seemingly no autosave functionality, I spent an hour prepping a piece and just as I began to detail it the app crashed.\nThe Oculus itself was fine and continued to track, menu was available, but Kingspray was DOA - and it was pretty crushing to discover my work in progress was just vanished\n\nOtherwise absolutely great, I hope the developer keeps adding content as this is truly one of the few VR experiences that will definitely be a staple of your diet\n\nHelpful | 0", "bukra-sertJun 23 at 8:01 AM\nFun!\n\nFun game, Im a beginner to spraying grafitti zo it would've been nice if I could place a translucent stencil on the wall to trace and practice grafitti :) game is 5/5 tho\n\nHelpful | 3", "mrmagicalmaxJul 17 at 9:15 PM\nGenerally awesome\n\nThis app is sick, heaps of fun and really addictive. Problem is the little bugs. I can't figure out how to save mask designs; spent an hour on a mask, saved it on my \"phone\", went back to the bunker and it was gone. Not only was it not available to wear, when I went back into the mask editor it said I had nothing saved. The internet access is iffy; my quest will be connected to the internet and other games will connect fine, but in Kingspray I'll randomly have no access to online/stencils. Also when I take photos of things on my phone there's no way to access them again. They don't show in the oculus images app and they're nowhere to be found in the game itself. This is fine because I can just take a screenshot through the quest software but it's worth noting regardless. Overall this is still one of my favourite quest experiences and the one that probably consumes most of my time, but it would be great to get some of those things sorted.\n\nHelpful | 0", "OculusBoshJul 9 at 11:06 AM\nShort review\n\nThis game is really well done, be great if they implemented some tutorials but certainly one of the best games Ive bought so far.\n\nHelpful | 2", "tainowarrior0311Mar 11 at 6:32 AM\nReally turn out to be a great buy\n\nSo Im a military veteran with ptsd and suffer with night terror lack of sleep depression anxiety I just spray painted a Anatomically correct heart and my anxiety just went away or dormant and I feel so much better very therapeutic thank you for this Ill be using it to make a lot more art and less mess lol\n\nHelpful | 105", "LvsprkJul 12 at 7:57 PM\nAwesome tool.\n\nThe ultimate way of practicing; no waste of resources, able to create large scale works from your own bedroom or anywhere else.\nSuper fun and freeing platform to create in.\n\nHelpful | 0", "Taser-FaceMay 16 at 11:09 PM\nGreat Game - Just a few ideas\n\nAwesome layout, but a few ideas that could vastly improved the game. First and foremost, I wish there were more areas to paint on, if you can roam a location you should be able to spray where ever. Activating that texture/surface to be applicable.\nI love that you can listen to music, but after 8-10 hours of play, you hear the same music over and over. FM hip hop seems to be cycling but still hearing a lot of repeats, would be nice if you could sync Spotify, Pandora or Apple Music.\nIve seen in other versions users are able to undo a line if they choose, but I like it this way as you need to be more careful. Being able to hang from a bridge and paint, or the side of a building would be. Nice addition, maybe having to climb scaffolding or a rope down. Having a billboard to paint would be a great one also. Aside from that, I still play daily only been on a few days, but can not get enough.\n\nHelpful | 4", "TheBootyWarriorJun 16 at 6:52 PM\nThis is so immersive!\n\nIt feels so real the pressure is awesome and the color selection is infinite. The texture is awesome as well but I wish there are going to be a few more features thats why Im writing this.\n1. The colors you used in a pallet or a color recall system.\n2. Basic stencils to make sharper points\nThats pretty much it I would love to see those.\n\nHelpful | 0", "DimeVeckJul 21 at 6:08 PM\nWhere can i see Patch note?\n\nI saw the reverse-spinning Chizzle bug is fixed. and stencil, new maps, etc..\nwhere can i see the whole updated changes?\n\nHelpful | 0", "Zengal13Jul 27 at 2:41 AM\nAwesome and chill\n\nThis is my new favorite game alongside beat saber. I love having the many customizable options for painting, music, and the avatar. It is super chill and relaxing, with a surprising level of realism too. You just have to play around with it and get used to the functionality of it.\n\nHelpful | 0", "WesRlz22 days ago\nGreat Just Great\n\nIts just incredible thats all I have to say\n\nHelpful | 0", "ben.walgateJul 23 at 1:47 PM\nAMAZING\n\nAs a graffiti artist myself for over 14 yrs I can honestly tell you that this game is incredibly real. My only gripe if I had to pick one is that I cant upload Any reference pictures. I own a Mac and the quest, someone please help\n\nHelpful | 0", "JogimusJul 18 at 3:01 AM\nInitial impressions..\n\nFrom first time trying this I managed to get it crash when trying to use stencils, stencil loaded ok but when painting using it app freezed and did not recover from that. Back to Quest menu and back to app, just black screen.\n\nAlso as not being real graffiti artist it is not pleasure to twist arm&controller to to get paintcan to proper position. Please add basic \"pistol style\" grip to be able to spay more relaxed hand positioning. Authentic index finger positioning simulation is not important for me, comfort is.\n\nAll other functionality is good, works fine.\nI'll update this initial review when needed (and if possible)\n\nHelpful | 2", "CherryBomb_xoApr 2 at 7:49 PM\nGreat but needs one fix\n\nThis is absolutely amazing! I have only one complaint tho..\nI was working on an epic piece with a stranger, after about an hour an a half, it disappeared! The red circles came up, he could see it but I couldnt. I had saved it, but when i went to look thru my saved work.. every.single.thing i ever made was gone. I laid on the floor defeated. I didnt even take a pic :( Please fix this. I should have screen shotted with oculus but i didnt.\nOther than that, this is the best purchase Ive made. Fkn love it\n\nHelpful | 25", "riffdoggMay 26 at 4:41 PM\nSPRAYCAN ART\n\nIf you have a like for graffiti or have been graffiting for years \n\nThen You need this in your black book. It's a great tool for a graff artist. Once you have mastered the use of your tools. With a selection of spray can colour's attached to your right wrist and a colour chart attached to your left with the ability to save the colour you create from the colour chart.\n\nYou get a vast range of colours in gloss matt and metallics .\n\nyou're also able to adjust your spray nibs by selecting them from your left wrist at the side of your colour chart.\n\nMy only points that are needed to be added are an ERASER and also it would be a great feature to have a BLACK BOOK to save your art work into like a real graffiti artist would . Rather than on your phone on your left joy stick in the game. You could then make the blackbook accessible in the games lobby making it a fourth option at the beginning\n\nIt's a great game and you can spend hours on it. And I'm sure at some point updates will be available that could only advance the game.\n\nWe'll done on this one guys great game \n\nI rate this game at a very good\n5.0\n\nHelpful | 2", "zoroeApr 12 at 11:39 PM\nLOVE IT!\n\nIve been writing graffiti since 93 but since Ive gotten older and not as active its a pain to find legal spots to paint and keep my skills up. This has opened up a huge world for me, to be able to paint again! Im so excited to be able to paint whenever I want again. Thanks devs, this was worth the Oculus Quest just for this game!!!!\n\nHelpful | 12", "Dr_OctobossJul 26 at 4:03 AM\nMy favorite VR game right now\n\nUse it every day. Works great. Tons of fun.\n\nHelpful | 0", "NewtusJul 4 at 7:55 PM\nReally awesome game!\n\nAwesome game and so life-like. Love making art and letters, and tagging, in this game. So nice and the added music on the radio is just so bad@$$!\n\nHelpful | 1", "FreebyrdJul 8 at 10:07 PM\nRelaxing and fun all in one\n\nI love it and hanging out with others while creating art is nice. Im no artist but I am learning from watching others.\n\nHelpful | 0", "ConcreteSniperMay 2 at 4:34 PM\nRealistic Simulation!\n\nHighly recommend this for those missing them good ol days taggin. I love the social aspect of it but can be a little annoying as there are some limited space. Also, wish there was a was I can sideload an image for me to use as a reference. Hopefully in a future update.\n\nBeing able to stream music is also a plus, makes the time pass by while blending in those lines. Other than space and having an image reference. I still rate this game 5 stars.\n\nGood job developers :)\n\nHelpful | 4", "Jokerinkx3Jul 15 at 10:52 PM\nAwesome\n\nAlways a great time! Feels amazing to just start tagging everywhere\n\nHelpful | 1", "ross.mcadam.98Jul 8 at 2:35 AM\nAmazing\n\nI found the game quite relaxing and it was fun just to go in and spray paint without consiquences\n\nHelpful | 0", "AbtimeboyJul 10 at 9:27 AM\nKingspray graphitty\n\nIts an AMAZING game and I totally recommend it! You just get lost while making art!\n\nHelpful | 0", "mister_swishaJun 8 at 11:58 AM\nAwesome\n\nReally good game really realistic you can play online with other people. The wall space is limited. 100% recommended My only downfall is you have to point and move by pressing a button why not just use the joystick instead to walk.\n\nHelpful | 1", "LiQuickApr 16 at 7:52 AM\nFinally I can do Graffiti!\n\nI really love innovative applications and this is one of them. Really stands out from the crowd of other VR applications. Things I would like to see in an update:\n- spray anything, now you can only paint parts of the scenery (this is the only criticism)\n- quick undo, I know this is silly but will really help beginners\n- quickly share a photo without having to do a screenshot\n- import image that you can project on a wall as reference\n- slide around instead of teleport\n- third person time lapse video export of making the graffiti\n- cops patrolling the scenery (no just kidding, I don't want this)\n\nHelpful | 6", "saltysixJul 14 at 6:08 PM\nExcellent, looking forward to more!\n\nExtremely creative, immersive environment for graffiti artistry, for newcomers and advanced users alike. Intuitive play, good physics, excellent environments. Has not been updated though in a long time, feels abandoned, missing out on very important social components and overall potential as a result. Highly recommended regardless though, very good although socially isolated in its current form. Recommended updates: In game tutorials, perhaps in the form of templates and narration, would be extremely helpful to newcomers. Also, I don't see a way to export work from the game to social media or email, GDrive, etc. The website did not appear to import the work I created, so for now it seems as though sharing your work with the world is a bit difficult (and I apologize if I'm missing something). Would like to see this. Would also be helpful to allow DIY images like sketch jpgs, etc. to be brought in as project reference (as photos on the in-game phone would be good, or even superimposed on walls; although this would reduce realism, it would be great for practice). I found myself taking off the Oculus frequently to check against my external design concept. Third party radio stations and/or Spotify playlists, and an in-game real-world clock to keep an eye on the time would be great. Game elements would be welcome as well, such as objectives (contract work by NPCs to earn currency to open secret areas, etc.).\n\nHelpful | 1", "HumberTag2Apr 24 at 6:36 PM\nAmazing Game!!\n\nSo I have always liked graffiti ever since I saw some some on walls but I never really got into it that much until just recently. Got my headset 2 days ago and got this game and although I'm not that good the content and what you can do is amazing. And I am getting better at it each time I play it.\n\nHelpful | 4", "Eye8ballMay 31 at 6:49 PM\nKingspray = great\n\nIve been waiting to get this game for awhile and I was blown away I recently tried the multiplayer and making art with others and getting tips from pros really helped my art, the spray paint is realistic, great graphics and you wont run out of things to make in this game!\n\nHelpful | 0", "NicoClikoJul 15 at 9:13 AM\nAccurate & fun\n\nReally nice game that feels real.\n\nHelpful | 0", "amazing_magmaJul 12 at 2:24 AM\nGreat\n\nSo realistic and easy to use AND great for fun\n\nHelpful | 0", "Taco_Tuesday_17Jun 28 at 7:16 PM\nEasy\n\nFor someone that has no idea how to draw let alone spray paint, the colors in the game make anything look amazing.\n\nHelpful | 1", "NamaslayJul 13 at 12:20 AM\nGraffiti saved my life\n\nThis is bringing me life! True to life and so much fun.\n\nHelpful | 0", "LemonCurdd6 days ago\nNot really playable in small space\n\nMy room scale is 10x5 feet and the wall is always just outside the boundaries making any intricate designs impossible.\n\nHelpful | 1", "AlechjoJul 9 at 1:48 PM\nMissing feature\n\nThe projector feature from the same game in other platforms is missing here. I was hoping that feature could help me create, since I'm a beginner, but it doesn't exist. I hope the devs include it some day.\n\nHelpful | 2", "SchizomiMay 1 at 7:37 AM\nNeeds more updates!\n\nI am in love with this game, but I took noticed that it isnt as updated as the PC version. I hope more updates come out soon. Also a cool idea would be to use the items in your surroundings to cover parts of the wall to make shapes when painting. For example if I hold up the basket to the wall If love to see paint reach through the holes and make a cool pattern. Anyways, love the game! Hope more updates soon!\n\nHelpful | 6", "Staga75Jun 7 at 7:27 AM\nNice app but needs some development\n\nWhy movement is only by teleporting? Feels very clumsy jumping back and forward even ehen space around the room. You either too close to the wall or too far - its hard to fine tune location and move along the wall. It would be nice to able to have continious movement like using the thumbsticks (check Alyx for reference) ... or have i missed out something?\n\nThe other thing is that the line from the spraycan is very shaky. I have a lot of experiece from real word but still getting shaky line.. not sure if its the oculus tracking but maybe you could add option for smoothiness of the line.\n\nThe caps also could be more taken from real wold, gettig soft fade seems to be tricky.. but not using the presure option so maybe i just need practise. It would ve cool to be able to to paint on everything on the location. Also why not have online locations that are public - so basically the art stays there forever or until someone else paints over - like hall of fames\n\nGood job - just keep developing it. Lower pricerange could bring more players... 15eur feels quite high if youre not really into graffiti.\n\nHelpful | 1", "Joey2410Jun 20 at 5:45 AM\nPerfect but,\n\nIt needs more places to spray on and more interactable items otherwise its perfect for art lovers\n\nHelpful | 0", "RodOculusGameJul 11 at 9:16 AM\nExcelent\n\n4 stars because the new languages are only in some features was a mediocre update and The sound is very poor you don't hear\n\nHelpful | 0", "sonny68xxJul 14 at 6:04 PM\nOk, but...\n\nI wish there were things like outlines for things like tigers or letters so we wouldn't mess up\n\nHelpful | 0", "Carl_Wheazer420Apr 14 at 3:55 PM\nArt\n\nThis is a nice game to chill and draw on a wall get the creative itch scratched.\n\nThis game is worth every penny and I can see a lot of people getting lost in the world of graffiti using this.\n\nIf you are tossing up weather to get this game dont hesitate. you wont regret buying this game.\n\nHelpful | 3", "nate_crateJul 8 at 3:54 PM\nVery challenging and fun\n\nVery good\n\nHelpful | 0", "SaugaKingMay 2 at 7:50 PM\nRelaxing and Rewarding\n\nThis game was the reason I pulled the trigger on getting a Quest, and im so happy I did. The game feels very responsive and has options to help new people like myself. Ive improved alot in graffiti and art in general, considering I dont draw.\n\nHelpful | 2", "dumpster.baby.vrJun 21 at 9:51 PM\nGood, with some improvements, great\n\nIm a real novice, so Ill defer to the other writers for realism.\n\nThe biggest improvement would be adding more surfaces to spray.\n\nPlease add undo.\n\nA tutorial would be great.\n\nStencils? Id like that.\nMaybe a pen or pre drawn tags to practice on.\n\nIts a lot of fun. Use a rap name generator for spraying ideas.\n\nHelpful | 0", "Daz2Jun 22 at 3:29 AM\nGreat game\n\nThis game is very realistic and helps you learn graffiti.\n\nHelpful | 0", "cragone3342Jun 29 at 4:45 PM\ngood\n\ngood and flares great\n\nHelpful | 0", "Aaronb3434Jun 4 at 3:54 PM\nCool\n\nIs it possible to let users go inside the subway train to spray paint just like the rift version if updated and add more environments and music?\n\nHelpful | 0", "xXCuda-HBXxMay 22 at 12:09 PM\nBest graff game yet !!\n\nFeels like im actually painting in real life i give it 10/10 for how realistic it is amd cool they used real spraypaint companys like ironlak and have all the real graff caps for the cans \n\nHelpful | 1", "LordKizaJun 6 at 2:28 PM\nGood game\n\nNeeds an update or am add on pack though I've gotten alot better and that's amazing but the same 5 walls make me wanna hit the street\n\nHelpful | 3", "yeetermynameisntpeteJun 5 at 10:31 AM\nPerfect game\n\nThis game has many physics of graffiti that you can use in this game like pressure of the cap different caps you can fade\n\nHelpful | 0", "underzerogravity5 days ago\n\nMore of a painter and sketcher, never actually used spray paint as a medium but it's really fun.\nI got lost for hours, easy controls and the mechanics of how the spray paint behaves, so realistic. It arcs just like real spray paint, so cool.\n\nHelpful | 0", "FINbitMar 26 at 8:18 AM\nOne of my favorite VR experiences\n\nLet me start by saying Im not an artist. I downloaded this non a whim and I love it.\n\nNo other VR game/app has immersed me so deeply. I watched a couple YouTube tutorials on tagging and it 100% translates.\n\nI have lost countless hours just hanging out on a rooftop steaming the in-app radio and playing around with the different paints/nozzles. The graphics and feel is incredible.\n\nFirst night I figured Id be in there for 10 mins so didnt really bother clearing my VR space completely. I tripped over my computer chair 3 different times, completely forgetting I was even in my computer room. Took of the headset and it was 3 hours later. Glad I have this a shot!\n\nHelpful | 5", "gmb9191967Jul 15 at 11:39 AM\ngood game but\n\nits a really good game. but theres one flaw when you take a picture of your artwork it dose not save It. Over all the games pretty good\n\nHelpful | 0", "T1MB0Feb 26 at 6:02 PM\nGAME NEEDS AN ERASER\n\nThis game is awesome for both letting off steam , expressing your creativity and meeting some pretty cool people/artists. But as a new user I am not as skilled as some of the pros and know that having a spray paint color that erases would be so helpful even if it does take away from how realistic the game is. (After all you are a floating blue head and hands)\n\nHelpful | 17", "zombies.null.1Jul 15 at 10:36 AM\nCool\n\nAs Good as discribed, very realistic\n\nHelpful | 0", "Chazz715Jul 28 at 12:51 PM\nI hate the game\n\nI dont like it because of how laggy it is and I cant even start on any walls Im retiring this\n\nHelpful | 0", "QuadGalaxyYTMar 27 at 12:43 PM\nNeed google images\n\nI have been playing your game for a good bit and I want to add google or something long those lines with you basically in the phone there can be Google images and you could search up an image like a reference sheet\n\nHelpful | 7", "georgejr.8016 days ago\nAwsome\n\nThis game is actually really good. I never really got into graffiti style art but know I can't stop it's so much fun. With different setting the the play back feature is amazing 100% recommend.\n\nHelpful | 0", "osornoartJun 5 at 11:59 PM\nLove creating art here.\n\nI Need a 90s hip hop station though. I teach Graffiti..hit me up.\n\nHelpful | 0", "craxklesJun 16 at 10:22 PM\nbest\n\nthing ever\n\nHelpful | 1", "criticalpeanutJul 6 at 6:22 PM\nPlease Add Support For LIV\n\nI'm enjoying the app, it would be really great if you could add support for LIV https://store.steampowered.com/app/755540/LIV/?utm_source=LIV\n\nHelpful | 0", "damien.elmJun 27 at 10:50 AM\nPerfecttt\n\nPerfect\n\nHelpful | 0", "RNG_chaseJun 22 at 8:11 PM\nCritical\n\nNot the tutorial also not the maps that the pc be has no 360 camera no replay system to se yourself\n\nHelpful | 0", "vincent4161Mar 24 at 6:53 PM\nGreat Game!\n\nThis game is amazing...The only thing that I think could make it better is if you could pull up an image on your left hand for reference so you dont have to take off the headset if you're using a reference\n\nHelpful | 6", "crazyralityMay 20 at 4:29 PM\nGreat game but!\n\nThis is a very good made software but projector functionality is missing in Quest and it makes really hard to see others can do it than you purchase the game and has different settings than others. Will you work on updating this function for the next realise?\n\nHelpful | 1", "TomatoKing51May 29 at 9:46 PM\nI finally know\n\nIve been searching for so long to find an art style and Ive found one\n\nHelpful | 0", "RagEthegodMay 6 at 8:46 AM\nKing spray\n\nI suck at graffiti and this game was my first try at graffiti and I ABSOLUTELY love this game if you dont have it I feel bad for you because it is a really special and fun game.\n\nHelpful | 1", "PowerFRMay 20 at 8:22 AM\nGood game, but\n\nNeed an option to undo\nNeed more objects on \"rooftop\"\nNeed an option to change video quality because there is a difference between the steam version.\n\nAdd more wall in maps, for example in the subway we can't paint the wall behind us.\n\nHelpful | 1", "Ray_RomanoMay 9 at 2:58 PM\nHyperrealistic\n\nSuper realistic graffiti sim. I just wish that you could paint on all walls and floors, or at least paint on a lot more areas. Otherwise, there is no point in being able to teleport to so many places. I also wish you could hover, so you could reach places you normally couldn't.\n\nHelpful | 1", "DoxologyMay 3 at 1:08 PM\nSo addicting\n\nI'm horrible at art and I still manage to find this game fun, it's by far the best game on vr to play during quarantine. If you have a quest you absolutely need this game!\n\nHelpful | 1", "kingg1715Apr 30 at 4:24 PM\nGreat!\n\nI don't paint at all I haven't even been into art almost at all in my life and this game is super fun. If you're on the fence remember as long as you don't put 2 hours into it and it hasn't been 2 weeks you can get a return. Give it a shot.\n\nHelpful | 2", "CrispyCrabMay 29 at 4:22 PM\nSave problems\n\nAll in all a pretty cool game, but it does have one glaring flaw for me. Perhaps this glitch is only affecting me, Im not sure, but it really does make the game tough to like. The game employs a method of taking photos to save your art, but the problem is it doesnt work.\n\nWhenever I take a photo, I go to check if it saved and looks OK. However, it keeps saying no saved artworks Im not sure how to fix it.\n\nHelpful | 0", "DENWIESEJun 19 at 1:22 AM\n\nSlighty overpriced, but still worth it, top 5 games for quest\n\nHelpful | 0", "Stryder7Mar 23 at 8:27 PM\nDevs please make game cross platform\n\nTo all the guys and girls at Infectious Ape,\n\nThis app is awesome on Oculus Rift, if it had a few more larger multiplayer oriented painting spaces then it would be GOLDEN. HOWEVER, on the Oculus Quest I find it to be severely lacking. Which is why Im rating it 4 stars.\n\n1) Mainly, the paint mechanics are nowhere near as good as on the rift. The fades come out splotchy no matter what distance, pressure, or trigger pressure that is used. The standard cap is the only cap with good fade. On the rift the painting mechanics felt very on point, fading was smooth and trigger sensitivity was excellent.\n2) Its missing many of the awesome features that were added to the Rift like ladders/lifts and an undo button\n3) Multiplayer with Rift users is impossible!! This was the whole reason I bought a quest. I thought I would be able to paint with crew mates that are far away.\n\nDevs, Ive been painting graffiti for going on ten years, and this app has SO MUCH POTENTIAL! Please dont abandon it! I would be willing to pay more for the app if these things could be addressed, ESPECIALLY the Quest paint mechanics. Please feel free to contact me if more elaboration is needed!\n\nHelpful | 8", "dmkey25 days ago\nSo good!\n\nI was pleasantly surprised to find familiar radio stations in the player! Devs if you read this, please add the 'gtronic' radio stream, it's the only thing missing: oldschool underground hip hop.... ;)\n\nHelpful | 0", "LeoMadnessApr 2 at 8:54 PM\nAwesome! TOTALLY GET THIS!!!\n\nI bought this game and when I started to get the hang of it I had a awesome time. This is a GREAT stress reliever! Whenever Im stressed I turn on my headset and play. Theres music and and drawing everything you could need!!! The music cools me down and drawing with spray paint cans are literally so cool to draw with or paint haha, so you should totally get this! Also you can play with other people and paint with them :)\n\nHelpful | 1", "BLAWCULUSJul 10 at 3:25 AM\nBANKSY's world of vintage gift shop!\n\nA lot of reviewers wrote about several features they wish this Quest version had, which they saw falsely advertised. Well maybe those reviews were before a recent update or something because I just got the app and as soon as I started playing instantly noticed practically all of those features are in fact options: projected stencils, custom reference art, night locations, and you can save your work and share it in several ways. So yep, the Quest version has all that good stuff for sure.\n\nIt also has an odd amount of Banksy-centric references throughout the game, like an enormous amount of stencils feature their work and even their signature tag. Exit Through the Gift Shop imagery is everywhere you look. I'm a bit confused how all of it is even legal, or not causing trouble with Pest Control. How curious...\n\nThe reality is: The gift shop has no exit. You know the one on Spaulding with my favorite wall ever! And one must consider the World of Vintage art that shop deals with, such truly amazing and serious art which one day the world will discover. Oh, Hi Marc.\n\nHelpful | 0", "jennasoard23 days ago\nThis experiential game is amazing!\n\nIm not a graffiti artist but I spent hours in here doodling with paints in urban settings. It was very real feeling, and so fun. It will be even more fun when I learn how to join a crew\n\nHelpful | 0", "lemmeholdsomethingMay 23 at 9:51 AM\nGreat game!\n\nAs a non-active graffiti writer this game is great. Being able to touch up on your skills without leaving your home. I would give the game 5 stars if a few issues where fixed.\n\n* Some form of hue slider so that you more easily can select different shades of the same color.\n\n* Being able to export high resolution images of your pieces. This is KEY! I emailed the developers and they told me they are working on this for the Quest and that it will be fixed within a few weeks hopefully. Fingers crossed!\n\nOther than that I love it.\n\nHelpful | 2", "MakixxMay 21 at 2:28 PM\nRealistic\n\nThis game is really realistic it has many caps\n\nHelpful | 0", "ds369gemApr 24 at 10:08 AM\nLove it....would love it more if....\n\nPlease please please sort out the projection for quest, its not fair, said on release that it was doing that....reading loads of reviews....its a must, thanks in advance :)\n\nHelpful | 1", "MilkyDDec 21 at 9:23 AM\nPhenomenal\n\nWhen I bought this, I knew almost nothing about the world of graffiti. I started out with a few simple art pieces, and then took interest in actual lettering instead of pictures. It looked really daunting at first, but I got the hang of it quickly. Im still not the best but I have a few impressive pieces that feel great to make. If youre on the fence about this game, I promise if you put time into it, youll enjoy it.\n\nHelpful | 118", "razorbacksTXJan 29 at 7:37 AM\nThis game is AWESOME!\n\nThis game fills the art/creativity void for me. I really enjoy the online multiplayer where there have been multiple sessions of having 3-5 people in a lobby all tagging together. I love seeing better artists and trying to mimic their stuff live.\n\nThey always end up doing some cool mural of my name (Razor) and all I can do is draw a =) to show my appreciation.. But I've already improved leaps and bounds from my first time. Eventually I'll be able to keep up with the best of them!\n\nHelpful | 14", "OcuQuesterMar 25 at 7:24 PM\nReally cool\n\nIf you like graffitis this game is great. Diffferent cool places to paint on. Possible to save to work on a project later. Im not a big fan of painting and still I find this game very relaxing. Only thing Im not a big fan of is the music but you can turn it off and listen to yours... Awesome!!\n\nHelpful | 0", "nikoguitaroMay 14 at 9:41 AM\nVery misdirecting\n\nIs this game good? Yes it is. But they are not updating it at all. The paint effects could be upgraded to at least what the trailer video was with the light reflections off the paint. It was far more detailed. And dont say it because it's the quest. The quest is more than capable of being more detailed. I've seen it on plenty of other games. It would be one thing if it was just the game in general, but on the vive and rift the graphics are on another level. Now I'm not asking to match that level but at least make steps towards it with updates I dont care if you triple the size of the game to add more details.and modes, I dont care if you want 30 bucks I just want the devs to make an attempt to upgrade this game closer to what it could be.\n\nHelpful | 0", "debksurJan 29 at 11:05 PM\nGreat without the mess !\n\nThis as got to be my favourite vr game at the moment.You have to practice to get used to it ,you can save your work but would be great if you could send to your mobile to print. I'm having to look down under my headset to see the picture I want to draw from my phone,drawing or photo,it would be great adding your photos ect to it to draw.\n\nHelpful | 12", "SIGALIZ3RMar 25 at 10:43 AM\nSo angry\n\nI spend 4 hours creating a birthday present for a friend tomorrow in multiplayer mode - just to figure out that it takes the photos, but won't save them for whatever reason in the gallery. I couldn't select the gallery button/icon and went back in the end to the bunker. Nothing there either... when leaving the garage, it even said \"saving\". Now I can't even go back there...\n\nProbably in solo it would be no problem, but I'm still extremely angry about this game. What a wasted time! At least I made a short video about it through my Quest lenses, but that's bs of course. God damnnnn you guys...\n\nHelpful | 17", "DrSleetosJun 4 at 11:04 AM\nAmazing\n\nThis game has amazing graphics and everything looks realistic. The only thing i would add is a fill tool because it can be really annoying to spray it in.\n\nHelpful | 0", "Sniffa1275Apr 14 at 1:49 PM\nVery entertaining\n\nBought this to work some more art in to the kids routine during lockdown. Very entertaining and engaging. The kids soon had the basics down and got creative. I can highly recommend!\n\nHelpful | 1", "kishore.jhumatMar 5 at 12:56 PM\nCreative, I love it\n\nI often find myself having to find my charger in a rush, solely because I lose myself into trying to perfect my terrible tags and pieces.\nHaving watched other versions of this game with different headsets I did get a little jealous with their additional features. But they are not fully wireless so win some lose some.\n\nHelpful | 2", "TheRyGamingApr 14 at 6:10 PM\nEasy to Use\n\nI am a person who typically draws on paper with pencils, and even though I have neverused spray paint before I found this to be enjoyable, and fairly easy to pick up\n\nHelpful | 0", "TJ_N1C_06Jul 21 at 11:33 AM\nJust about perfect!\n\nIve been playing this a good bit and I love it. Nearly everything is perfect. Its very well put together with the colour selection and cap variety. Its all great. The one thing I would change isnt even much of a change its just an improvement. Id personally change how you move around. Teleporting is annoying so using a thumb stick would be easier. And one last thing would be the range and spread or the paint. But overall, incredible game\n\nHelpful | 0", "ShadyMagicianApr 15 at 6:27 AM\nNew Favorite !\n\nBest game on oculus, Ive killed my battery countless times already spending time with this! So much so that Ive started playing while plugged in \n\nHelpful | 0", "elvenmaster96Mar 17 at 6:19 AM\nNo eraser, however roller is a MUST\n\nWhen I went in, I went in blind, knowing nothing about graffiti other than it being art. Now I see, its inspiring, it made me look up videos on how to get better at graffiti. So I say roller because its true to graffiti and because it is technically an eraser to the painters mind. And if you have the common courtesy, please add the inside of the subway as a level, Maybe timed, adds some realism. Thank you\n\nHelpful | 1", "Rubber_BunJun 24 at 4:38 PM\nFun and Calming\n\nSo... First off. I am in absolutely, definitively, not an artist in any way. I can even draw a convincing stick figure... But this app/game/program... Is the most calming, relxing thing. The paints are fun, and the music just lets me vibe and lose track of time. Could spend days just chilling and painting a wall with terrible doodles.\n\nOnly reason Im taking a point off; well there clearly was a lot of thought put into the menu designs, and how they are presented is well conceived. It just doesn't click with me. But its a super minor thing. And should definitely not prevent you from trying this yourself.\n\n9/10\n\nHelpful | 0", "PENTAR0Apr 9 at 12:05 AM\nNot perfect but a good game\n\nI had really good time playing this game.\nYou can try the art of graffiti without the risk of getting caught by the cops.\nThe gameplay is intuitive and you really have the sensation of painting with a spray can.\nI highly recommend this game.\nI don't give 5 stars because the Quest Version is 15 like the PC version, but we don't have \"Undo\", \"Projector\", our own music and some other features. It's not normal to pay the same price for a game with less features.\nAnd also because on my 2 first paintings I experienced 2 bugs. For the first, I couldn't climb on the ladder after 1h or so because the ladder went under the floor, the second I couldn't climb on a barrel after 2h and I don't know why. So in both cases I had troubles finishing my painting because it's was impossible to reach the top of my Graf. I had to use a real chair but I was limitated by my ceiling, and climbing on a chair with a VR headset is not really safe.\n\nHelpful | 3", "jericho2005Apr 1 at 8:18 PM\nChill\n\nLove getting to make your own art and you get to chill to a playlist built into the game. Maybe expand the playlist so we can pick our own songs, but thats not that big of a deal. Highly recommend it for relaxation\n\nHelpful | 0", "frankbob8Apr 20 at 6:24 PM\nThe soul reason I use oculus every day!\n\nI absolutely love this. It has honestly made me a better artist and it is a great time. Fun to paint with other creative people. I am a 10 year tattoo artist so to find a new avenue in art is so exciting! Make a portal to the iPad!!\n\nHelpful | 1", "T_dizzyMar 24 at 11:48 AM\nKing is king\n\nI watched a lot of videos and read lots of reviews before purchasing. One common theme was it needs a bigger soundtrack\n\nThat to me says people spend a lot of time playing it.\n\nThe YouTube videos from professionals are awesome.\n\nThe price is awesome.\n\nI go to restaurants and use the kids menu and crayon to graffiti up, so had to try this. Its my fav game so far.\n\nIt could use more stages, but thats not the reason it gets 4 stars.\n\nI would have gave 5 but the thing missing is a tutorial.\n\nA simple walkthrough of the can tips, how to use the color pallet and maybe even a small here is how to use them and make this generic piece, would have been super awesome. Either way\n\nI figured it out and its amazing. Thank you devs!\n\nHelpful | 2", "OutPizzaTheHutJul 20 at 11:57 AM\nGreat game\n\nIt is really fun but you should do a little graffiti/art research if you aren't skilled. You should find out what buttons do what and then have fun\n\nHelpful | 0", "LandonZXMay 26 at 9:24 PM\nBest creative app for the quest!\n\nSo to start off I went on buying this game cause I found graffiti very interesting and I wanted to try it out... And I need to tell you this is the best app in my opinion! The community is very helpful and kind which is nice for beginners like me. I always find myself coming back to this game and I love that! If you think your interested in anything related to art buy this game it's worth it! (PS: haven't found a single bug yet )\n\nHelpful | 3", "CryptleshMar 7 at 5:30 PM\nGreat stress relief\n\nI bought this without any experience in Graffiti. But now I am hooked to it in a day. It is peaceful and great relief from all the stress. You just start with something and it will eventually take you to evolve some ideas and put that on wall.\n\nHelpful | 2", "BrooksMack_Apr 7 at 2:27 PM\nI love this game\n\nI personally have never spray painted but this is my favorite game on my quest because you can just play with anyone and it is just amazing. Also very underrated\n\nHelpful | 0", "Gimney6 days ago\nGreat game\n\nI'm a artist that was just looking for some art related VR games and this game right here takes the cake \n\nHelpful | 0", "artkrimezApr 26 at 4:00 PM\nTRAINS\n\nMore locations and more trains please please please \n\nHelpful | 0", "Emily0204Feb 27 at 5:32 PM\nSo amazing\n\nI love art but hate that you can't see all the possibilitys. With this game you can I love this game so much. Never wanna delete is. Hope you enjoy it to reader. I have a suggestion can you add it to where you can import a photo.\n\nHelpful | 3", "SuperNinja9000Jul 22 at 3:53 AM\nSo Much Fun!\n\nI love the game and how it works! It can be confusing at times, but other than that this game is amazing.\n\nHelpful | 0", "ShashSavageJul 28 at 6:36 AM\nVery very very *indian accent* good\n\nI like de paint when go wall or odder map and den it paint good when spray\n\nHelpful | 0", "Ted-wardJul 23 at 5:53 AM\nGreat game!\n\nThis game is very realistic and lookss great! It's really fun but I kinda suck at it haha. 10/10\n\nHelpful | 0", "evieganleyJul 25 at 11:32 AM\nAmazing\n\nThis game is worth the money and is a brilliant way to show off your art skills\n\nHelpful | 0", "N1tr0BladeJul 21 at 10:00 PM\nGame is good\n\nGame is pretty nice but heres a suggestion: Be able to play tour own music by accessing the we\n\nHelpful | 0", "kfixx82Jun 10 at 1:15 AM\nWriters will appreciate this\n\nHonestly....this blew my mind. I paint in real life....and this is crazy. I just wish you could battle other crews. Maybe in the future? Or maybe you can and I just havent figured it out yet. Either way....theres been night where I would love to go out painting..but cant due to weather....and this helps me stay creative.\n\nHelpful | 0", "SuperCoolPandaApr 12 at 3:34 PM\nAmazing!\n\nI got into graffiti because of this and its my favorite app right now! Its so realistic!\n\nHelpful | 0", "superstaroneApr 21 at 4:54 PM\nHow can i revert ?\n\nHey! I mainly bought my Quest because of this game. So now, the main and an must have function i am really missing: How can i revert (undo) my latest step? Thanks in advance :)\n\nHelpful | 1", "MadwackerJan 18 at 2:10 PM\nAmazing\n\nIf you've ever wanted to try your hand at being a graffiti artist, this is a great way to go! The paints, nozzles, drips, etc are so much fun. Even my kid loves to go in and draw.\n\nWould be cool if you could save your artwork externally like a screenshot to your email or something.\n\nHelpful | 10", "ninjack1372Jun 7 at 6:31 AM\nKingspray is boss!!\n\nSo I really wanted to draw on the quest so I decided to look at art apps and found this game. At first I was skeptical about this game due to there was other art games but the other art games where rated lower so I thought to myself, \"Why not.\" Let me tell you this game is now my number 1 favorite app!! What's not to like! It's very realistic, runs pretty well, there's solos and multiplayer, and tons of maps as well as a gallery which you can rate others artwork! This is the best quest app everyone should play! They just need to fix a tiny bit of bugs and it's perfect! So to sum it up this is an app you won't regret buying.\n\nHelpful | 0", "Kristian.HaasMar 30 at 11:19 PM\nI didnt expect this to be this amazing.\n\nI can honestly say ive spent more time w this app than any other. Its addicting and i can easily spend hours getting lost w this app..\nIts realistic, and wo a doubt well money spent!\n\nHelpful | 1", "unknownanonymous101Mar 24 at 8:37 PM\nAmazing but I got some ideas to help\n\nI love the game so much but you could like have an option to make yourself higher up to make bigger stuff and I would like more music pls anyway but overall an amazing game\n\nHelpful | 1", "YO-MacJan 28 at 8:00 PM\nEPIC game but it has one problem\n\nThis is a tremendous game, I love it and I've played it for about an hour each day for a month.\n\nBut at the moment the multiplayer and phone UI are glitchy and kinda bad.\n\nSometimes I'll get put into blank lobbies or stuff will just go wonky on me. So I hope this will be patched quickly.\n\nIgnoring those bugs this is a great game. When I started I had no back ground with art at all! Like I sucked. But after just messing around in game for a while I started learning more and more and soon started getting it down.\n\nThis game is so much fun, it has opened the door to a new hobby for me. Now once the summer comes I'm gonna buy some cans and get to spraying.\n\nPlease just buy it. I've bought 30-40 dollar games and I always pick this one up. The worst case if you dont like it you can refund it but I promise you, you wont be let down\n\nHelpful | 4", "GamingoosApr 19 at 1:21 PM\nGood game for the family\n\nI loved this game and so did my family\n\nHelpful | 0", "SincerestSawaJun 25 at 8:19 PM\nLove this game\n\nGives me the opportunity to do graffiti without the cost of materials and jail time, just watch out for little kids ruining your hard work, find a group that is respectful to share a room with.\n\nHelpful | 0", "Lando300Jul 20 at 12:59 PM\nBest. Game. Ever.\n\nThis game is epic. Best spray paint game ever.\nAnd super cheap!\n\nHelpful | 0", "DirtYFranK525Apr 17 at 1:27 PM\nWorth every penny\n\nCant get enough of kong spray!\n\nHelpful | 0", "FiskcreationsApr 3 at 8:39 AM\nLove it\n\nI'm a graffiti writer and this is so amazing I will make a video on my you tube channel <fiskcreations>\n\nHelpful | 0", "VR_MNOApr 19 at 9:42 PM\nVery impressive.\n\nPlease add a wider variety of trains!\n\nHelpful | 0", "JMcilroyJul 20 at 8:40 AM\nNoice\n\nVery very satisfying and accurate, will play again\n\nHelpful | 0", "NicholasOngMar 9 at 8:57 AM\nLoved it but just need a bit more music\n\nI didn't experience spray paint until I bought this game and guess what I enjoyed it, but it needs a bit more music, maybe connect it to Spotify or something else will be a big plus to this wonderful game.\n\nHelpful | 1", "E_vabMar 1 at 8:22 PM\nArt for anyone\n\nI personally have been very interested with art and this has just been an outlet to do just that. You can create whatever you want and you always can fall back on the fact that you can just clear everything, and draw whatever you want.\nThis game is great for anyone, not just artists. Just hopping into one of the locations, and painting my cares away is just so much fun.\nMy only complaint is that the controls can be a bit finicky at times but, if you played for long enough, youd get used to it.\nAll in all, if you want to pick up a game that you can show to, VR enthusiasts, those who have dabbled in it, or those who are completely new to it, this is great for you.\n\nHelpful | 2", "Ace_007Jun 23 at 3:21 PM\nWorth every penny\n\nThe controls are intuitive, and the multiplayer works a lot better than most other games on the quest. It has a wide selection of caps, pre-made colors, and... Music? This game has a music player, with a few solid songs. If I were to come up with one nitpick, its that theres no way to erase a small part of your art, and not the the entire wall.\n\nTl;dr It works how you would expect. Its worth the money.\n\nHelpful | 0", "ShibashroomFeb 6 at 9:31 AM\nOne of the best games on the Quest!\n\nThis game is awesome. Period. Awesome graphics, infinite colors, super intuitive controls, and so many customization options. There are tons of areas to do graffiti, and different caps for different spray types. Super polished, almost no bugs at all. Great replay value and awesome price for how good it is. One thing that would make this game better is adding a way to favorite colors, and have a quick menu to switch through them. Thanks for the awesome game, devs!\n\nHelpful | 2", "BoatstoryOct 17 at 4:04 PM\nPerfect. Game. Period.\n\nI want to start this review off by saying I knew nothing about this game before I bought it. It looked pretty fun, so I decided to get it. This review is not biased on me waiting for this game. Let me start with, the game is perfect. Not close, its there. Graphics, feedback, control, fun. The amount of maps was very pleasantly surprising. I saw someone say you cant teleport, you can. The way the paint drips down when you hold it in a spot for to long. How intuitive the game is. I jumped right in and started spraying. I dont know if there is a tutorial but really you dont need one. Its simple yet super versatile and not constricting at all. After finishing a drawing I looked up to see a flock of birds and could hear a car driving by. I usually look out of the hole by the nose every few minutes with other games, not once with this one. It had my full undivided attention for my entire 2-hour session I just finished. That was my first time ever playing it. If you need games to sink serious hours into, this is the one. This is a system seller right here. Incredible fun. And one more thing, Im not artistic, you dont have to be, its just fun. I dont recommend you buy this game, Im telling you to.\n\nHelpful | 596", "TheBirchWoodTreeJul 11 at 7:26 PM\nGreat physics but stencils are iffy\n\nIn my experience, all the spray painting physics worked really well. The problem came when I wanted to try stencils. There were plenty to choose from, but every time I used one and spray painted on it, the final product looked like a pixelated version of the actual stencil shape. On top of that, even though there are tons of stencils, they lack basic shapes, like squares, circles, ect. If you don't want to use any stencils, great game with amazing spray paint physics.\n\nHelpful | 0", "GigthemonsterMay 23 at 7:36 AM\nBrings me back!\n\nThis is simply the most immersive video game experience Ive ever had hands down. The mechanics and realism to real painting is unreal and spot on. Also, no motion sickness and its super comfortable for hours of painting. If your an older guy that still occasionally gets the itch to paint this will scratch that itch. Its almost no compromise to the real thing. Only thing I dont like is they should make it clear that you have to go to the spot that the art was created to load a saved file. And the teleport function that allows you to move around should be replaced with a smooth thumb stick navigation so you can be more precise with your movements. These are very minor complaints, buy it now, you will be blown away.\n\nHelpful | 1", "kpeel27834Jul 3 at 6:57 PM\nI need more battery power\n\nThis app is so awesome. I ha've burnt 1 set of batteries up playing it... Great job developers\n\nHelpful | 0", "F2mrlizardMar 21 at 1:16 PM\nLove this amazing game but\n\nI absolutely love this game but it does need an eraser tool and they need to add a sort of guide line thing you can do\n\nHelpful | 0", "Immaseagull_May 29 at 8:49 AM\nWow just wow\n\nThis is like real graffiti Im amazed and I am happy about this purchase everyone should get it even if youre bad at drawing like me I learned how to draw from this with graffiti I hope this game adds more maps and like some game modes or something\n\nHelpful | 0", "evnzdadApr 4 at 11:20 AM\nAmazing touch and feel\n\nRelaxing and fun. Must buy!!!\n\nHelpful | 0", "YoYo_BoBoFeb 26 at 8:39 PM\nSo Realistic!\n\nOnce I bought the game at first it was odd to control, but then I got the hang of it. Now, the environments are SOOOO Realistic! I love also how good the spray is on the cans. I'd recommend it, its very nice!\n\nHelpful | 1", "NigzillaJun 14 at 9:21 PM\nOne problem\n\nAmazing game I love it Im not a creative person but this brings the creative side of me out ONE PROBLEM I wish you could walk with the joystick theres two ways to access menu so make the start button for phone and colour panel therefore you can free up the usage of the joystick for movement if one would like instead of the joystick being another menu button please that would honestly make this game 10 times better it would prevent me from stepping out of my guardian zone and having a smoother experience considering I dont have the biggest space still super fun though\n\nHelpful | 0", "WickedCocobirdMar 25 at 4:38 PM\n\n\nThis game is really good now I am obsessed with graffiti yes yes yes good\n\nHelpful | 0", "Joseph426Mar 24 at 9:18 AM\nLove it\n\nQuality game, would recommend. You dont even have to be good to enjoy it!\n\nHelpful | 1", "Sammy_BoiiJun 11 at 1:52 AM\nLove the game but have 2 big suggestions\n\nThese probably won't be big to some but I would love to have a dual spray option. Like to make Hearts easier or to be more semetrical. My second suggestion is to make everything in the level customizable. I was very disappointed to see that I couldn't spray on a few walls. I'd like to have as much spray space as possible. And one more suggestion, (ik I said two but this ones pretty important) add in a virtual ladder. We can crouch but just out everyone can do that in real life. But not everyone has a ladder lying around. I would love to be able to reach those spots I'm not tall enough to reach (mind you im 6 ft) But other than those three things, the game is amazing and I'd recommend it to just about any friend. Please like the review so the devs can see\n\nHelpful | 0", "KrispyCabbage_Mar 12 at 2:25 PM\nBest game\n\nI mean what can I say, this game found me a new hobby in spray painting and has brought out the inner artist in me well done\n\nHelpful | 1", "horror_landMar 13 at 4:29 PM\nBest game\n\nThis is one of the beat games I have ever played it makes me happy that I can practice somewhere without wasting paint\n\nHelpful | 1", "Virtual.Foo.X3Jan 29 at 3:55 PM\nHighly recommended for artists\n\nThis game is so ADDICTING. I have barely spent less than an hour playing and all I keep thinking is what to tag next. It's not a game limited to just tagging letters. One can basically use this as an art canvas. If you don't know how to draw I don't recommend you buying this game. Creativity is required. So if your kids suck at drawing, don't buy this. I've seen some of the uploads and there are really awesome graffiti tags and then you have those wack taggings most likely uploaded by kids with no drawing skills. Which will probably lead to them getting bored with the game. So, like I said if you have no creativity and can't draw, don't buy this. That being said, I would like to see some additional updates like:\n\n1- adding Old English letters on the left hand screen so one can see the letter they want to sketch out. Im those type of artist that have to be staring at what I'm drawing. I don't want to keep taking off the headset to glimpse at the letters and then putting it back on. Plus I love old English letters. Also other cool letter fonts would be nice.\n\n2- the white color needs more white. I don't know if there is a setting for this\n\n3- we need a public level where we can all cross each other's tags out lol\n\n4- a way to upload an image to your left hand screen so you can see what you want to draw. Simple images would do.\n\n5- would be cool to have a level where you can climb a billboard and tag it within a limited time before cops show up and you are made to re-start.\n\n6- add fat tip markers and a bathroom stall room\n\nI had to cast my VR to my cellphone and then screenshot so I could have pics of my taggings. Is there a better way?\n\nUpdate: I would really love to upload an image and be able to see it on my left hand so I can see what I'm drawing. I don't mean clear pictures of people or places but images like cartoon characters. Though pictures of faces would be nice for portraits. Hope you guys read this because I suck at freehand drawing.\n\nHelpful | 5", "ECreeper10Jan 31 at 11:18 AM\nIncredible game Love it.\n\nI saw this game and it looked really good so I decided to buy it. As soon as I pressed start I was blown away. I don't know much about graffiti or even art but this got me addicted to graffiti. I love this game because I can express myself freely and not have people judge. This game is one of the best art games I've ever brought. 10/10 would buy it again.\n\nHelpful | 2", "aidan3455Jan 27 at 2:25 PM\nPerfect in every way.\n\nIve played this game for a little while now and have managed to not only get better at graffiti and art but have also made some friends along the way with the multiplayer mode.\n\nHowever i would like to see smooth movement as teleporting can be immersion breaking at times, other than that small thing I love it!\n\nHelpful | 3", "Spen_OneFeb 2 at 4:55 AM\nGreat game..almost perfect.\n\nWhether you're a seasoned vet or a just interested in learning how to paint with cans, this game is amazing. It's super fun and you can literally spend hours playing. I've not only gotten great at it, but I've also made worldwide friends. The only issue seems to be that the devs have abandoned the game.\n\nHelpful | 2", "Jakerika17Mar 9 at 11:10 AM\n\nI love this game. The effects of the paint are spot on and I love the variety of colors! Just needs better music!\n\nHelpful | 0", "VirgileGamesMar 17 at 12:45 AM\nPerfect\n\nRealistic, Fun, Cool Radio Stations and endless replayability\n\nHelpful | 0", "McbugerkingMay 12 at 2:27 PM\nGreat game\n\nI recently bought this game and thought to myself Im not very good at graffiti. Why would I buy this?But when I met other people they gave me tips and videos to watch and it really helped me. Im not the best still but I have gotten better. Over all it is a great game\n\nHelpful | 0", "Prophet1975May 6 at 6:24 AM\nPlease give us an undo or eraser option\n\nBEST game for creativity out there if you are into painting (especially with spray paint or airbrushing. Get this game and let your creative juices flow. To the devs, you have a masterpiece of an experience please give me an undo button or eraser so I dont have to restart everything again\n\nHelpful | 0", "siamese605Oct 22 at 9:01 AM\nGraffiti Artist since 1992..\n\nI took a couple of days to really soak in this app so I could give honest feedback about it. I started painting graffiti in 1992, so I would consider myself someone who can spot issues with the simulation.\n..My honest opinion is that this app is far better than it has any business being. I've played with a couple other true Graffiti artists on there, and at many points we found ourselves geeking out about the accuracy of a certain thing here and there, from the tracking control, to the flares (a style of tag involving wrist movement to manipulate the width and spray of the can), to the lighting and shadowing of the environments, to the pressure sensitivity when holding down the cap (this is finicky in real life, so the fact that it feels natural in the simulation is a miracle.)\nI find that the same quirks and deficiencies I have painting on a wall in reality that I have to work around end up organically translate to my experience painting in the game, which is something that can only be achieved by a nearly perfect simulation of the experience.. Even the social experience is eerily similar. The emotions and interactions you go through painting a legal wall feel the same as painting a spot here.\nSo as far as painting practice, yes, it is that closely aligned and achievable. I remember another artist from Denver saying to me \", think of how good these kids are going to be and how much quicker they will advance because of this!\".\nYes, you could develop some bad habits that could mess you up on a wall a bit too if you get lazy, but overall, it is definitely a great and accurate way to develop your skills, and it's extremely addicting. Basically a perfect experience.\n\nHelpful | 100", "SilverwarriorinJun 28 at 8:23 PM\nAmazing\n\nJust amazing\n\nHelpful | 1", "ModsloverMar 5 at 7:45 AM\nGood not great.\n\nSo what's good about it: It makes graffiti cheaper and easier for people of all ages. It helps noobs and pros build their skills if they decide to go on the streets. It is good practice for future pieces. Wide range of colors and nibs.\n\nBut what makes it not great: There are a few features in the game that I fill should be worked on or even added. First when I said wide range of colors I did mean it but you are very limited on saturation values, I feel that another colorpicker should be added that has sliders or if you click on the numbers then input for RGB with addiction of Saturation, opacity, and metallic. Also idk if it's just the Quest but sometimes lines will look pixelated when you pain and it really takes away from the art.\n\nHelpful | 2", "Naushua_333Feb 8 at 2:32 PM\nExcellent app. Very realistic!!! \n\nThis app is amazing for anybody who is creative or trying to. Start up in the graffiti. I've only had it a couple days but is very realistic and if I could give this 10 Stars, I would fire guys keep it up. .\n\nHelpful | 1", "CandourFeb 13 at 12:54 AM\nLove it...\n\nExcellent game. A brilliantly therapeutic way to waste time. Lose yourself for hours just creating your masterpiece. My only request, would be that they allow its you can pick up, to be used as 'stencils'. This would be a great way to create straight lines or curves in a negative.\n\nOther than that, well worth the money.\n\nHelpful | 2", "ReptileMkFeb 3 at 12:16 PM\nAmazing simulation of Graffiti\n\nReally good. Im not the best at it to be honest but can certainly see an improvement from the first time I tried it. This isnt a game more a tool I cant see why anybody wouldnt enjoy it. Highly recommend.\n\nHelpful | 2", "NerfensteinJan 7 at 12:46 AM\nFun for all ages!\n\nThis app managed to bring all the fun of graffiti right to the Quest. Even if you cant draw / paint, everything here is so intuitive youll find yourself fully immersed in no time. Its accurate almost to a fault, with plenty of paint options, including caps, colors and even metallics.\n\nI said fun for all ages, because this game has appealed to everyone in my family, from my 69 year old mother in law, down to my 6 year old grandson (who was able to play no problem, showing just how good the UI is). Bravo to the developers.\n\nHelpful | 7", "betonosMar 7 at 8:43 AM\nGreat sim, lacks graphics export\n\nIt works great in terms of simulation, however two issues:\n\n1) you cant directly export your graphics to file\n2) the graffiti resolution is too low, you can easily see pixels when drawing from close.\n\nHelpful | 0", "BeefeastwoodDec 28 at 8:11 AM\nAmazing!\n\nThis game is gorgeous!! Its a very good looking quest title, and performance is amazing! I used to spend hours in the steam version, and the quest version seems just as easy to do so. Game is fun for non graffiti writers too!!! Its basically a drawing game that is super user friendly as you have a whole wall! If you do paint graffiti, then you will be shocked how well the developers did this. Its got ironlak cans, ny fat caps, drips, metalic paint, wonderful music, great locations, and you can smash bottles!!\n\nHelpful | 3", "Harrymac05Jun 10 at 12:33 PM\nAmazing game\n\nVery realistic and quite fun and the multiplayer is a fun way to make great art pieces.\n\nHelpful | 0", "OtherbitsJan 24 at 1:20 AM\nSets the standard\n\nThis is the game that convinced me buying a Quest was worth it. Its hard to explain what makes the atmosphere so perfect. Its the chilled out soundtrack, the gritty environments, the way you save your level by pulling out an in-game phone and taking a photo of your work. That last one is an entirely pointless feature. A simple 'save' button would have been enough. But its one of many tiny details that help build the atmosphere of the game. I'm a terrible artist and I still found myself loving every chill minute of creating my terrible art.\n\nThat said, the game falls apart if you try to do anything other than what you're supposed to. There's not much in the way of things to discover or explore in the environments. For the most part, that's fine. Its not the point of the game, after all. But why on earth would you include a dj turntable that I can't interact with? You must have known its literally the first thing I'd try to do.\n\nStill, aside from my short attention span, there's not much I can even think to criticize. This is, by a wide margin, my favourite game on the Quest\n\nHelpful | 0", "Hobbitgy8Jun 22 at 10:05 PM\nPretty gud\n\nIts pretty gud \n\nHelpful | 1", "spacedfishermanJun 20 at 12:02 PM\nChill\n\nSuch a lovely game; so chill.\n\nHelpful | 0", "CheesyColtOct 17 at 3:55 AM\nGraffiti Writers Dream Come True!\n\nWhat a phenomenal game! If you are a graffiti writer, you will instantly fall in love with this game! If your an artist in general or just some one curious about spray paint art, you will really enjoy the authenticity this game provides!\n\nHelpful | 154", "unclejr92Feb 9 at 4:33 PM\nGreat! Except for 1 thing..\n\nI love using this. The infinite selection of colors is amazing, the music always has me feeling it. It's unadulterated freedom!\nI only have 1 big problem. Big enough I feel to merit 3 stars.\nMy problem is what you're able to do with your art after it is done. You can screen cap and share it on Facebook or you can upload to the cloud. Neither of the options make it easy to put your art in your actual phone. I've uploaded onto the cloud and tried to access via the site but couldn't find my piece. And I don't want to post every piece I make. Frankly, both of these routes are a little tedious.\n\nWhether the fault falls on Oculus, KSG, or a combo of the 2 I do not know. But I feel having easier access to the artwork either through the oculus app, or making a companion app for Kingspray can really improve its worth by leagues! Even if there were a function to use the Bluetooth connection from the phone to the Quest to transfer to file; this would be a great improvement too.\n\nThat being said, this is my only qualm with this app. It is AMAZING and I encourage anyone and everyone to use it.\n\nHelpful | 2", "ZowlTheAssasonFeb 5 at 10:02 AM\nCreativity unleashed\n\nI dont do graffity, yet probably alot of people who play this dont but yet having to just stand in a quiet room while creating art makes this a very enjoyable game to let your creativity be used\n\nHelpful | 1", "knights-of-kyleFeb 26 at 4:08 PM\nNeeds more!!\n\nAwesome game but there should be a tutorial. Where you are taught how to do lettering,colors and throw ups. Maybe an out line of basic letters and how to make everything flow. Please update! Will gladly pay for something like that.\n\nHelpful | 0", "SashVrJun 6 at 10:24 AM\nSo goooooood\n\nThis game is super realistic and so much fun with or without friends 5 star all the way.\n\nHelpful | 0", "extremegametrailer12Feb 5 at 12:26 PM\namazing love it\n\nI have wanted to get my hands on this game since I first heard of it finally with oculus quest. I literally was late to work because my quest arrived before I had to leave. Omg. Great game\n\nHelpful | 1", "WillowtheoverlordJan 15 at 1:56 PM\nOne of the best\n\nKing spray is a graffiti game that really FEELS like youre doing a crime, the rush of getting caught, finishing your peace. Its so fun to join others or have others join you and collaborate on a peace together, me and 4 others filled an entire area of space which we could use. There are multiple different object in levels that can get you higher up e.g. the ladder or a barrel. The vast amount of colour and contrast, flaring and shading can be LIFE LIKE!\n\nI dont wanna go on forever so Im just gonna say ; buying this game will NOT be regretted.\n\nHelpful | 0", "nugynugsMar 4 at 10:36 PM\nThe big ooof\n\nThis is just amazing get this game do it u wont\n\nHelpful | 0", "STEALTHRAVENJan 14 at 5:12 AM\nGreat Game!\n\nFreedom to do whatever you want with a can of paint! Kingspray is very smooth, had all kinds of different techniques/ spray styles you can do, its the most fun Ive ever had with paint but without the mess! A must play for anyone that likes drawing, painting, or just to mess around and make something cool!\n\nHelpful | 0", "tatt2frogJan 17 at 3:17 PM\nYou need this\n\nLess than 24 hours after opening my quest, this is my first review of anything on it. Having said that\n\n\nThis is easily the coolest experience. Today, I brought it around my coworkers who are familiar with a rattle can but never used VR, and they were all amazed at the genuine feels you get. Deserves 10 stars!\n\nOnly complaint, need a ladder on every wall!\n\nHelpful | 0", "DVID2006Jan 14 at 11:06 PM\nFeels so real\n\nI love it , this game is amazing when i first started graffiti I had a book I wrote ideas in like most graffiti artists then I started graffitiing the walls of my room because I dont want to do anything illegal then I saw this come out and and bought it with in seconds. This game is amazing if you like to spray paint or do graffiti buy this game because this is what you want\n\nHelpful | 1", "AvyannaFeb 11 at 6:16 PM\nGame will not download :(\n\nOK game did eventually start working not sure why it didn't want to download but it did. This game is actually quite cool and now that we found the lefty mode its awesome :)\n\nHelpful | 0", "B-MinusFeb 26 at 10:11 PM\nNot as fun as I thought\n\nI bought this game thinking it was gonna be really fun and creative but its not as fun as I thought I hope I can get a refund for store credit, because this wasnt worth my money.\n\nHelpful | 4", "SwagStar59Apr 2 at 11:12 PM\nNot that fun\n\nWith a 4.8 I thought this game was where its at but I picked it up for about 15 minutes then got board  add eraser?\n\nHelpful | 2", "ACMEBANDITJan 26 at 6:35 PM\nGraffitti\n\nI really love this game. As real as you can get to actual spraypainting. Smooth and addictive. Wish there was more places to paint something multi stories high would be cool. You can use your imagination and create...what's better?\n\nHelpful | 0", "idoravivMay 1 at 3:29 PM\nNot simple\n\nDont like it at all so far I cant make it to work\n\nHelpful | 0", "deliriouspigJun 20 at 12:04 PM\nThis game is amazing\n\nThis is hard for me put I got insanely good at it\n\nHelpful | 0", "BigSlut77Jan 10 at 8:12 AM\nAbsolutely 5 stars\n\nI have tinkered around with spray cans before and have always wanted to try to make graffiti art on a larger canvas, but do to the obvious fact that in most places its illegal I never got the chance. With this game I was given the opportunity, with just about every color and every spray cap you could imagine. The game includes some great canvases ranging from rooftops to subway cars. It was an awesome experience and the inclusion of a radio with real songs made for a great environment to vibe out and just paint. Their isnt much more the game could include however I think the inclusion of stencils could make a great impact on the game and create the opportunity to make some street art style works, like ones you see on Instagram and Twitter being sold on the street corners in Manhattan. I would highly recommend this game to anyone looking to have a fun relaxing VR experience.\n\nHelpful | 1", "SpaceChick3Feb 2 at 3:59 PM\nSO MUCH fun!\n\nSave $$$ on real cans and get this game! I used to spend SO much $$$ on cans and now I get to wake up out my VR on and I'm in the studio. Love this game it's friggin Amazing!\n\nHelpful | 1", "DonnyDanger78Feb 3 at 2:21 AM\nOutstanding ,with a couple of issues\n\nFirst off I have always loved graffiti but never had a go at it.\nThis is a brilliant program to allow you to give Graffiti a go. Easy to pickup and get started and the skys the limit.\nAn issue with online though,\nIve tried a good 20/30 times on a Sunday to join other peoples rooms but most of the time I join an empty room. I managed about 4 times with people and it was great. Also I have accepted requests to join me but no one ever appears.\nA couple of things Id like to able to do,\nImport a drawing to work off and also export to some where( maybe this is possible and Im just clueless) other than the oculus.\nI know you can post to Facebook but I dont want it to go on there.\nAnyway great game absolutely worth the money, I get lost in it for hours and fine it rather relaxing\n\nHelpful | 1", "B0NK4ZJan 11 at 2:41 PM\nKing!\n\nYou can really step your real life game up with this Im sure. Cans, caps, surfaces - everything feels as it should. If theyld release a spraycan controller for this, I would 100% get it and say this is the nr 1 workshop to the artform. If you are into graff or just want to get a taste of it - Kingspray is the way to go. Its in my top 3 apps for the quest ever - and it will stay that way! 5/5\n\nHelpful | 1", "mzziggyFeb 18 at 7:26 PM\n\nReally great experience. As a writer, its the closest you can get without being on a wall.\n\nHelpful | 1", "LearutoMar 2 at 6:06 AM\nGold\n\nMust have for anyone with vr.\n\nHelpful | 0", "B3ARUSHAApr 15 at 12:40 PM\nI always wanted to tag iRL\n\nI can't tell you from experience if this feels like really tagging, but it seems pretty legit 2 me. This is not for everyone. I can see people getting bored with this app when they start painting because they can't make a coherent piece. So, purchase at your own risk(but try it for 30 min if u don't like it ask 4 a refund). 4 me tho this purchase was worth the money (I got it on sale btw) I think it's worth the standard price as well.\n\nThere's a couple things they could fix or add 2 the app though. Like a better way to move around instead of teleporting. Also, an easier way to pick color shades and to manipulate the shade of the color you have selected. Another thing I would like is maybe a way to elevate yourself so you can really fill a wall up from top to bottom. Adding layers would be great too (I know it's not realistic and prob would take more processing power).\n\nOverall I'm happy with my purchase it's just another app where I can express my art in a different way. I tried tilt brush but it wasn't for me. I enjoy painting 2d things.\n\nAlso when you save your work you have to go to the location where u painted it to load it. Just fyi\n\nHelpful | 0", "xEagle360xApr 15 at 2:57 PM\nOddly Entertaining\n\nBefore I write this, I am not a big art person nor have I ever done graphitti. Whenever I opened this game I instantly got so immersed. Just getting in and painting with my friends is so therapeutic. Definitely one of the best games on the quest whether you like art or not. The music in the game is alright but if they could add more tracks or give an option to add your own that would be great. Also if there was a way to use the oculus browser to pull up images to use as a reference or inspiration that would also be handy.\n\nHelpful | 0", "Ghost_zPhantomJun 2 at 1:26 PM\nNice App\n\nKingspray is a great app and it is also a lot of fun.\n\nHelpful | 0", "SSDkoChanJan 18 at 1:21 PM\nPerfect UI\n\nThis is the only quest game that I have zero complaints with. Everything handles perfectly, the ui is super intuitive and easy to learn and master. The social features are great and awesome for sharing techniques. True 10/10 mastahpeece.\n\nHelpful | 0", "BANKSSOTATTEDMar 7 at 7:45 PM\nBEST F IN GRAFFITI GAME EVER\n\nAdd me bankssotatted , PDX , 27\n\nHelpful | 0", "MaestroAntonio70Feb 10 at 10:57 AM\nAmazing\n\nUnbelievably realistic and detailed. My new favorite game. Ive been playing every chance I get!\n\nHelpful | 2", "brandon1680Jun 10 at 9:06 AM\n\nAmazing\n\nHelpful | 0", "itzphantomzzzMay 14 at 4:15 PM\nVery accurate\n\nThere is so many accurate things about this game like paint drip when you apply to much paint and differences between dry paint and wet paint.\n\nHelpful | 0", "Luc1enApr 12 at 6:47 PM\nRevived my VR experience\n\nI haven't picked up my Quest in over a month and saw this deal pop up. I used to graff in my younger days so this was an instant buy. Also looking at the positive reviews it seemed a no brainer, and it doesn't disappoint! Thoroughly enjoying it, ..my only feedback would be to add a undo feature for quick errors made. Nice work devs this has brought VR back to life.\n\nHelpful | 0", "Wallz_Jun 20 at 9:47 PM\nSmooth\n\nVery impressive. It would be much cooler if we could tag up more than just one wall.\n\nHelpful | 0", "Superfish00785Jun 7 at 7:48 PM\n\n 10/10\n\nHelpful | 0", "FroggiWaifuFeb 6 at 11:52 AM\nAmazing game\n\nI love this game and has a wide variety of ways to spray paint but I would give it a 5 stars if there were more location and being able to spray paint on any surface for more creativity. If there were more props as well but still a great game and I recommend it\n\nHelpful | 0", "CaptainWigglyDec 31 at 6:49 PM\nIncredible fun\n\nI am not good at art... Yet! This is an incredible...game? I'm not sure if it's a game or what but it's engrossing. I love the full body art that you can create. Unlike anything I've ever done.\n\nI understand why people would tag IRL now. This is way better without the mess, vandalism, fumes, etc.\n\nPick it up, you'll have a blast!\n\nHelpful | 1", "abreurey5Feb 10 at 2:06 PM\nImpressive\n\nVery inpressed...i waste so many hours on this game...and the music makes it 10 times better enjoyable\n\nHelpful | 0", "jayisspillz94Jan 14 at 7:57 PM\nAwesome game realistic\n\nUpdate......i found out how to load...my bad..\nlove the game no complaints I just wanna know why I cant save my art? Is there something im missing? I take the pic it says it saved and when I go to load nothing there.....\n\nHelpful | 1", "Skny_BoyyMar 1 at 7:11 PM\nMuch creative\n\nMuch creativity\n\nHelpful | 0", "MorphApe9497Jan 2 at 7:33 PM\nGreat game\n\nThis game is a blast to play, feels like you are really in the streets spray painting. I can create whatever i want and it looks super cool, i just wish there was more for options, i dont care for teleportation, the hand for the caps and color needs to be more of a watch and not what it is, I find it uncomfortable. And a tutorial would be really cool, but an awesome game.\n\nHelpful | 1", "your.ghost.hostFeb 7 at 6:19 PM\n!!mind blown!!\n\ncouldnt of got any closer to the real thing. amazing job. mind blown. more walls coming soon?\n\nHelpful | 1", "melonlord123Feb 15 at 12:47 PM\nAmazing\n\nThis game is so relaxing even if your not good at graffiti.\n\nHelpful | 0", "joscrogJul 6 at 11:10 AM\nMissing features\n\nGame is missing the \"projector\" from the PC version, so you can't look at any reference material in the game.\n\nHelpful | 0", "TheLemming19Jan 23 at 7:20 PM\nFlippin' legendary!\n\nThis game is fantastic! The physics of the paint and the styles you can replicate are breathtaking. King spray has helped me improve my grafiti art a ton! Thanks game devs!\n\nHelpful | 0", "monstermatt.markusFeb 16 at 9:39 AM\nWow\n\nThis is really good ..the can control is on point !!\n\nHelpful | 0", "callmecordeliaApr 24 at 3:11 PM\nGreat app\n\nAt first i was rusty but now im getting the hang of it. but please add markers or drip markers for tags\n\nHelpful | 1", "VRdudeDec 28 at 8:46 PM\nGreat Zen Creative Space.\n\nBuy it... Its a secret Personal Space where you can unleash your Imagination. Try some patterns and vibrant colors. There are no rules, just draw... even if you think you got no Talent. With this App you, have. Cool Locations and atmospere, press play on the music player and relax. Join others and draw something together, Chat a little with great people, if you want. The controlls are easy, wish there was a undo Button for the last drawn line. Otherwise Its perfect.\n\nHelpful | 1", "IronReplicaApr 5 at 1:50 AM\nAmazing for artists\n\nIf you are looking for a new medium to use in vr then this app is the best. I only wish they had a better erasing tool but other then that the game is flawless.\n\nMultiplayer is spot on and great for meeting new artists or hanging out with friends.\n\nSpray paint has many different options for colours, nozzles even pressure.\n\nMultiple maps allow you to try different canvasses for your work.\n\n10/10 would reccomend for artists\n\nHelpful | 0", "YrhinoJun 1 at 3:28 PM\nRlly good\n\nIts really good\n\nHelpful | 0", "DaggarLanceJan 12 at 7:26 PM\nGreat app!\n\nYou can make terrific artwork with this app is seems to work great I have had a few bugs trying to take pictures and the app crashes and ruins everybodys session hopefully that is fixed soon other than that it was terrific\n\nHelpful | 0", "RawbeighFeb 11 at 7:24 AM\nDefinitely a Favorite\n\nOne of my top 2 go to games on Quest. Just wish exporting your work was less restricted.\n\nHelpful | 0", "CommonMemezFeb 7 at 5:05 PM\nGreat game\n\nMe and my friend can play this game for hours and not get bored love the game\n\nHelpful | 1", "LDCO07Feb 5 at 5:30 PM\nDang\n\nThis game is awesome no complaints, Id give this app more stars if the limit wasnt 5 \n\nHelpful | 0", "ashleighaleceJan 27 at 7:44 PM\nBuggy and too many missing features\n\nWas working on 3 separate pieces in the warehouse on the same save and setting the paint to 75% opacity cause my spray to cover all 3 walls for some reason, ruined my first piece.\n\nAlso, I understand the Oculus Quest is less powerful and some features had to go away, and it definitely sucks learning this the hard way, but not being able to have a reference photo in game is a total deal breaker for me.\n\nHelpful | 3", "Amor.X.Jan 20 at 1:30 PM\nThis is cool\n\nCan't stop painting, totally legal and really realistic. Dream for all graffiti painters. Had chosen to have more rooms and maybe some better resolution on the spray jet.\n\nHelpful | 0", "icedapolloDec 25 at 3:15 PM\nAmazing fantastic game\n\nAmazing game. It just all feels so natural. Wish there other modes like limited spray or super realism but base game is fantaistic. One major issue is mulitplayer. Its very janky joining a world or having someone join you. 7 out of 10 times you would load in to a empty world or go back to the lobby. I'm giving a 5 star cause its all around ( besides multiplayer ) a wonderful graffiti game and I believe that the devs can fix the mutiplayer problem. Then again it could just be my Wi-Fi so whatever. This game is sure to keep you coming back to create and strength artistic instincts.\n\nHelpful | 0", "richbklynApr 2 at 3:10 PM\nKeeps me out of jail\n\nI would really hope this game could turn into an open world, like nyc in the 80s. Climbing skills, markers, rollers everything. I would pay top dollar for a game like this. Battles between other players. This game has so much potential to expand. Music i would like a different playlist but its tranquil.\n\nHelpful | 0", "lawnmowerman1984Feb 12 at 7:10 PM\nFun to play\n\n\" It's the Most fun I've had on the quest so far. \" tw\n\nHelpful | 0", "IIIO.OOO.IOII.OIOFeb 2 at 9:43 PM\nBeyond my expectations\n\nHard to find a decent graffiti game period, and to find one this awesome and in VR. I'm blown away.\n\nHelpful | 0", "keebzOct 18 at 7:56 AM\nAn impressive port\n\nI really loved the original title for desktop, and this version holds pretty true to that. Sure some of the finer touches are missing to get it on the Quest hardware, but there are zero sacrifices to the core of the system. I'd dare say that the radio and multiplayer works even better on the quest. It's amazing they got this on such limited hardware. Five stars if your a VR art fan.\n\nHelpful | 22", "Bobby12312May 16 at 5:48 PM\nBest VR game Ive played in a while.\n\nSo fun I recommended my friends, they are all having a blast and so am I.\n\nHelpful | 0", "AllijahBoiiJun 24 at 8:00 PM\nGood\n\nI like it\n\nHelpful | 1", "DexieboiJan 25 at 9:22 AM\nGreat Game!\n\nI have no experience with Spraypaint, and I've all ways wanted to do it in real life. Kinda sad it's illegal. Still really awesome fame!\n\nHelpful | 0", "BagelsAreDopeMay 25 at 2:18 PM\nBest art game!\n\nIt's a lot like real life\n\nHelpful | 0", "blake_wiggins14Dec 17 at 1:42 PM\nAmazing Calming Game\n\nI would like to start off by saying, this game is beautiful. It is immersive and I never want to take my eyes off of it. When I was playing this game, a quick hour went by without me even realizing it. This game is perfect after a heart racing game to just stand there and draw what you want. Im not an artistic person but you start to notice that the ideas come to you right when you spray paint for even just a second.\n\nHelpful | 5", "cvclegitFeb 5 at 6:42 PM\nGreat game but it needs some improvement\n\nThe game lags and when it does it kicks you out of the game\n\nHelpful | 2", "reBiancoJan 9 at 7:16 AM\nEasy To Pick Up. Difficult To Master.\n\nWhile the game can be a little shy to instruct you how to play, its not very long until youre just going to town on a masterpiece of your own. Once you start getting the hang of it, theres no limitations.\n\nHelpful | 0", "deadeye66Mar 9 at 5:01 PM\nNot bad\n\nPretty good, could use a couple updates\n\nHelpful | 0", "RomeoSquareDec 25 at 4:40 AM\nMissing some features\n\nI agree with other reviews that this is a really good graffiti simulator. However, I really miss the opportunity to share a picture. I read six weeks ago they were working on a patch, but nothing heard since. Also an undo feature would make for less frustration.\n\nHelpful | 10", "st112010Apr 15 at 11:51 PM\nAwesome\n\nIt is so good it feels like your actually outside doing graffiti on the walls before I got this I really wanted to try graffiti and then I found out about this.\n\n5 star\n\nHelpful | 0", "maxvectorDec 17 at 1:08 AM\nFantastic\n\nAbsolutely fantastic, well designed, smooth and refined game. The social element is amazing too, its much more fun to paint side by side with someone than hang around a room full of strangers. The immersion is totally out of this world but well grounded, real enough to let you drift off while avoiding uncanny valley. I think this is the most challenging aspect of VR and the designers have really executed it well. Tip: stand in front of a real wall so you can anchor your elbow or guide your hand against the wall.\n\nFeature request: Id like the ability to fly up against the wall, or teleport to a higher area because smooth lines rely on arm movement which require bigger space; like scaffolding. How much fun it would be and how many hours would be spent painting the side of a skyscraper?Also a piece of cardboard with a straight edge for masking would be awesome. The realism is fantastic but the joy of VR is really about overcoming physical constraints and going beyond what is possible in real life. ...and finally, how about an integration with Instagram or Pinterest?\n\nHelpful | 4", "DevichiJan 5 at 12:20 AM\nDynamic\n\nFrom the splatter, types of cans, paint pressure, this game is top of its game and really allows you to create. Its also got tons of adjustable awesome music to listen to so you arent creating without inspiration.\n\nHelpful | 0", "waterjediJan 1 at 11:18 AM\nSomehow my new favorite\n\nI purchased this thinking back to my youth... I thought this could be fun. Boy was I wrong!! Its fing awesome. So realistic and very therapeutic for me. Best app purchase to date. Well this and Vader of course. Love it.\n\nHelpful | 1", "ax3artistMar 25 at 5:27 PM\nFun but ...\n\nThere needs to be a way to import templates!\n\nHelpful | 0", "hargisssOct 17 at 12:55 PM\nA great visual art app for Quest\n\nThe visual art apps for quest are my favorites. There's Sculptr, Tiltbrush, maybe Gravity Sketch... that was just about it, until now. All those apps are 3D, so I jumped on the chance to do some 2D painting on quest... and it's great! The experience feels highly interactive, as there are many degrees of freedom... moving the spray can closer to the wall makes the stroke smaller, backing away changes the texture, squeezing the trigger different amounts gives you different intensity, and spraying at an angle changes the shape. Every now and then the paint drips for realism. The app runs great, and loads reasonably fast.\nAlso speaking as someone who has never actually held a can of spray paint, this app is a great look into a world I've had little firsthand experience with. Now when I see graffiti I'll have a better idea of the methods the artists had to use to achieve the effects they did.\n\nHelpful | 31", "Joey114Feb 14 at 8:08 AM\nGood\n\nVery fun\n\nHelpful | 0", "Mortal66Jan 26 at 6:53 PM\nVery cool app!\n\nVery cool! You can get to be VERY creative in this app! I know nothing about graffiti but this is fun!\n\nHelpful | 0", "MysticMushMar 2 at 3:43 AM\nBuy this !\n\nReally good all round, is what it is but does it well.\n\nHelpful | 0", "JessXeOct 17 at 11:44 AM\nSo far so good\n\nFrom my time in game so far it is absolutely amazing for the most part. However I am giving 4 stars right now. My only complaints at the moment are a few quality of life things. For example there is no smooth locomotion, which I feel should be included in every game by now. My next issue is there is no thumbstick turning, many of us just dont have a large enough play space to physically turn around in. My last issue is that only certain walls can be tagged.\n\nOther than those things I am loving the game, thanks for bringing it over to the Quest! :)\n\nHelpful | 57", "vBrainzDec 12 at 8:33 AM\nWorth the wait!\n\nFirst off, I saw this VR game when it was first released and it instantly made me want to purchase Oculus Rift. Well I waited sometime to purchase a VR rig. I recently bought the Quest & King spray. First session I played lasted 4 hours....yea. It sucked me into VR land hard. I love this game/simulation but I do wish there was more spray caps to choose from as well as more of a variety of music to jam to! 5 stars all day everyday!!!\n\nHelpful | 2", "FutsziApr 13 at 9:43 AM\nLove this app\n\nSo Im not an artist in any way but I love to draw and copying so I wish I can pull out a picture from the browser I saved if I want to and put it on the wall so I can copy or something like that.\n\nHelpful | 0", "KEMIKILFeb 9 at 11:57 AM\n\nFun and addictive.\n\nHelpful | 0", "dusitn_Jan 11 at 5:57 PM\nSo relaxing\n\nI love this game because it has beautiful scenery, realistic spray paint, and you can just listen to music while sitting down instead of making amazing murals.\n\nHelpful | 0", "OculusQwackJan 11 at 10:57 AM\nCreative\n\nSuch a great game, so much creativity so could put in a virtual world. Its just like real life, the reason I rate 4 stars instead of 5 is because there are certain walls that you can tag. If all of the walls were coded for tags this would definetly be my favorite and 5 starred.\n\nHelpful | 1", "tonyartisanJan 9 at 11:29 PM\nGood Vibes. On of my Faves.\n\nFYI: Hold, aim, teleport using A or X depending on which hand you are holding your paint can.\n\nVery cool game/creative tool. I really enjoy it! Good job, Devs!\n\nHelpful | 0", "ZordoneDec 27 at 7:03 AM\nGreat game, couple missing features\n\nI love the game. The painting is very realistic. But as a beginner, not having undo is a pain. I understand that there is no undo in real life either, but when I accidentally ruin my piece with a bad line, and I have to spend 10 minutes to fix it, I always die inside a little.\n\nThe ladder on the rooftop is a nice touch and very useful. I'd love to have that on all locations.\n\nThe paint cursor that can be turned on in the settings is also a big help, but it can be hard to see when it has the same color as the background.\n\nWhen I tilt the can and spray in an angle, it should paint in an ellipse with some gradient, but it still paints a circle and uniform color/transparency.\n\nHelpful | 6", "TheGryphon227Jan 20 at 10:29 AM\nAwsome\n\nThis game is so fun I love to draw\nAnd I love vr, Ive always wanted to use spray cans and now I can!\n\nHelpful | 0", "GamerPugPupApr 29 at 3:54 PM\nLove it\n\nLove the large option for colors and tips. Very relaxing. Would love to see an undo button though.\n\nHelpful | 0", "monkeyman200798Jan 9 at 4:30 PM\nIm no artist\n\nIm not a artist and not good at drawing but this game is amazing in made me want to draw more and it helps its also really realistic dope game\n\nHelpful | 1", "danejustinMay 1 at 3:20 AM\nNot bad\n\nThis is pretty cool !\nI couldnt find a tutorial\nI wish you could paint everything\n\nHelpful | 0", "MintpoucheDec 7 at 4:01 AM\nGraf writers dream\n\nThis game is so amazing. In hindsight, if oculus quest was just a $500 graffiti simulator with Kingspray and nothing else, I would have to have it. 25 years of writing graffiti and my entire style has apparently been based on factors like a paint budget, laying low, painting fast, packing only what cans can fit in a backpack or milk crate. No fumes here, unlimited paint, no security guards to outrun. Spraying paint can take a little getting used to as a new medium for any artist. It takes reps to develop technique. Kingspray maximizes this ability. Thank you to the developers, this game is absolutely perfect.\n\nHelpful | 2", "patrik.w74Jan 15 at 4:06 AM\nAbsolutely amazing!\n\nAs an oldtime graffiti painter, This was absolutely amazing, the realism is mindblowing! I Give it a 10 of i could.\n\nHelpful | 1", "DimotroscovtichApr 13 at 3:44 AM\nReally surprised\n\nThis game is amazing. The levels are beautiful, the spraying woks absolutely perfect. I really recommend this game to anyone. It's really like you are there in real life.\n\nHelpful | 0", "SamuraiPanda31Feb 17 at 3:22 PM\n\nVery realistic, could use some way of getting taller, and cardboard for hard edges\n\nHelpful | 0", "aPARTtimeASTRONAUTApr 20 at 11:08 PM\nIt's cool but there's bugs\n\nIf there was a way for the lobby host to be able to kick people, that would fix a lot of the issues since it's just kids joining, dumping paint on the wall with a chisel then leaving\n\nOther than that, the game is great. It's helped me develop my art style into a more defined and direct form and I use this every day. I used to be big into graffiti and this allows me to get back into it at no risk wich is pretty cool too\nNo worries about how much paint I have or improvising with a budget.\n\nThe radio turns off on its own\n\nBTW if anyone reads this, listen to party vibe radio\n\nJoining someone's lobby loads me into an empty lobby like 3/5 times\n\nEverything else is awesome\n\n\nEDIT:as of April 2020 this game has completely gone off line for me as well as the radio and music not being loaded. All my saved work is gone, I then tried uninstalling, the game refused to uninstall, I was no longer able to download or uninstall anything else since it would get queues behind kingspray.bhad to factory reset. Still not solved\n\nHelpful | 9", "Stevenitro3200Mar 16 at 9:18 AM\nTotally awesome\n\nMy only complaint is the movement can be a little sketchy. I do however like the point and click to exactly where you want to go. That's really a small portion of the game too. Everything else is awesome. The variety of colors and spray patterns gives your creativity an ego boost. Your imagination is the limit. I've always drawn \"graffiti style\" artwork so I feel like I'm in my element without having to keep an eye out for cops lol.\n\nHelpful | 0", "redrum033Jan 14 at 4:52 AM\nGreat!!!!!\n\nIf you love the art of graffiti then you will love this, perfect for getting down ur work before u hit the streets\n\nHelpful | 0", "PadiwonDec 26 at 9:04 AM\nPADI - LRS KREW\n\nLove it! Literally bought Oculus Quest just for this, it's pretty close to the real deal, I paint for many years and this simulator has blown my mind away, with a couple of extra update this can be next level \n\nHelpful | 2", "Mr_LuFeb 14 at 4:57 AM\nrealistic\n\nrealistisches sprayfeeling\n(but like in every game on the quest resolution is bullsh*t)\n\nHelpful | 0", "SnowySiameseMar 15 at 9:04 AM\nSeriously Amazing\n\nI cant express how cool this game is. Its such a simple concept: heres some spray paint, heres some caps, go wild.\n\nYou can sink so much time into improving your skills and having fun that you feel like you time traveled into the future.\n\nThe multiplayer is fun, and on the underpass map you have two sides, so you can paint together or separately. I wish I could interact with the people you play with, like shaking hands or high-fiving like in rec room, but I am satisfied with the experience I have had so far.\n\nA few suggestions would be objects you could play with, beyond just picking them up. Like glass bottles break, or cinderblocks can be painted. That could make for some really interesting pieces of art. Being able to customize your character would be fun too.\n\nOverall, I cant get enough of this game and highly recommend it to not just artists but anyone looking to relieve stress and have a good time.\n\nHelpful | 0", "LoDivinoJan 8 at 7:35 PM\nAmazing Graffiti Simulation\n\nAbsolutely blown away by the realism of this game, i cant wait to spend hours designing pieces and taking my sketches to virtual reality.\n\nHelpful | 0", "MickmanNov 29 at 11:56 AM\nThe Good the Bad and The UGLY\n\nGOOD-\nhigh level of articulation in terms of flow, paint dispersal and general feel of each cap ie. Fat CaP vs a Thin Cap.\n\nHardness\nWhen spraying a line, the edges can be very hard (e.g. with a Universal cap on ironlak), or they can fade out and look fuzzy. There are a couple of Softcaps.\n\nCaps that produce hard lines are good for outlining. For hazes and shadings, softer caps are generally preferred.\nSize:\nSpraying from the same distance with a NY Thin and a NY Fat will result in a much wider dot for the NY Fat. This also defines the minimum width of a line.\nCaps which produce wide dots are called Fat Caps.\nReaction time\nThe Skinny Pro does in fact respond rapidly: When you stop spraying, the paint stops flowing. This does not necessarily need to be the case;\nDot pattern\nThe dot pattern is the pattern that is produced when spraying on a single point from medium distance.\nConsistency\nOr Quality. Every cap will produce a slightly different pattern. Consistency is important if you rely on the pattern, e.g. for visual effects & being a digital application its always consistent.. There's no change in temperature or have to deal with enviro. concerns or cops for that matter ;)\n\nTHE BAD - No ability to import your own sketches you create in pre-production. It really sux having to take of the VR headset just to view your sketch.\nNo ability to paint wall corners... all walls a flat. I'd like to have the ability to try out foreshortening, and more 3D designs ie. wrap around corner walls or paint a side walk. It's all flat land I'm afraid.\nNo ability to Put down a quick base canvas... using a roller.\nThe lobby area ( called \"The Bunker\" ) is lack luster in terms of interaction. There's a DJ console but no ability to spin some vinyl... There's a few assets lying around the bunker that have no purpose.\nLimited navigation areas. Would be better to move across the street onto other roof tops etc..\n\nThe Ugly -\nMy art still sux ;)\n\nHelpful | 12", "keith.talbotDec 29 at 5:44 PM\nCool app, shame it's not cross-buy\n\nGot this on the Quest and I have really enjoyed my first hours play around with it.\nBit disappointed that there seems to be no way to share your artwork outside of the game though.\nAlso I was hoping this might have been a cross-buy app as I also have a rift and the ability to connect the Quest to my PC but when I logged into my PC oculus it appears I need to buy the game again if I want to use it on the Rift :( Shame.\n\nHelpful | 3", "egarner321Jan 25 at 6:48 PM\nSo amazing\n\nI wish I had this as a kid. I would never have actually graffitied buildings. I got lost into this game right off the bat. So much goodness.\nWish I could smell the paint\n\nHelpful | 1", "corker2000Jan 10 at 7:14 AM\nWell impressed\n\nIm an old school writer been into Graffiti since mid 80s and this is mind blowing.\nMore maps please and a free roam option\n\nHelpful | 0", "TomTheThotSlayerJan 16 at 9:14 AM\nLove it\n\nNever done real graffiti but this game in my opinion gives me the full experience so just buy it\n\nHelpful | 0", "kreedlee12Apr 15 at 8:30 PM\nMust have!!\n\nThis game is so fun and I have spent countless hours the multiplayer is amazing and allows people to collab and produce incredible art work.\n\nHelpful | 0", "GoldtriaDec 6 at 2:13 PM\nI'm amazed!\n\nI'm not a graffiti artist nor do I have skills for that. But I was interested in it and that's why I bought this game.\n\nI have to say this: It woke up my interest to learn graffiti :) I've met and seen some people in the game that are doing fantastical work.\n\nIt's absolutely fun even if you're not skilled at graffiti. The other night I wanted to create something good and once I pulled out the VR headset, I recognized that I played for 1 hour. I did not feel that at all.\n\nIf you want to test your artistic side, I highly recommend this game.\n\nHelpful | 0", "NomiuDec 14 at 12:58 PM\nAmazing\n\nThis game is honestly amazing and I was let down by tilt brush in the art VR categories but my joy was brought back with this masterpiece, awesome colors, tons of features and originality and the painting feels realistic and comfortable, great game\n\nHelpful | 1", "BenduckFeb 15 at 4:57 PM\nAmazing but...\n\nSuper amazing game. Really fun. But the artworks wont save.\n\nHelpful | 1\nDeveloper ResponseFeb 17 at 2:48 PM\n\nWhen you save artwork, you can only see that saved artwork when you go to the location that you saved it from. So if you saved a piece in the underpass area, you must return to the underpass to see it again on the phone menu. Hope that helps.", "DoomBoyIIIIDec 27 at 12:31 AM\nGreat game!\n\nI bought this game for $12 and i am very impressed! Not only does the game look good but its fun and a great social experience. I highly recommend especially if you are on the oculus quest.\n\nHelpful | 0", "NSG_Imminent2Dec 17 at 8:32 AM\nIm not artistic at ALL, and I LOVED it\n\nI have absolutely ZERO artistic ability, yet I found myself coming back to Kingspray Graffiti. A lot of the pieces Ive done have turned out WAY better than I wouldve expected. If I ever get mad or sad I would just come to the game and just spray paint, it really gets your mind off the real world and is oddly soothing.\n\nHelpful | 7", "mrdeathwishFeb 2 at 8:02 AM\n\nCan we just have a undo button function please? I'll love this app forever if you can give us that...\n\nHelpful | 2", "jtcope555Jan 14 at 5:22 PM\nYou wont be disappointed\n\nWhen you loose track of time, you know its a good one. This game is Aces.\n\nHelpful | 0", "DatCartoonDec 19 at 9:09 PM\nIncredible game\n\nThis game is off the chain I have a few complaints there isn't a undo button and I wish I could upload a reference pic so I can go off of when writing and also a auto save feature I have lost a few murals cause I was so immersed into the game that my headset died and when I logged back in it wasn't there.\n\nHelpful | 4", "SolarShockNov 30 at 12:06 AM\nJust buy it\n\nFirst off, if looked at this game since it was originally released. But I still did not know much about it. Now that I have picked it up, it's a great add to the collection. Listen to some music while a tag a street car or just create some cool art. I'm not really into drawing or anything like that and I was no pro when I got the game. But I do think i have gotten better and i enjoyed every second of it. If you are on the fence or just want to get lost in vr again to create some cool stuff. I would definitely pick this up.\n\nHelpful | 0", "duane.reeves.9DSROct 17 at 3:28 PM\nDuane Reeves\n\nIt was a really Jolly and Joyful (J&J) experience. I got to use my creativity in an Astounding and Astonishing (A&A) way. I enjoyed this App, for one of many reasons, and that is because it was; therapeutically relaxing, to Use and Utilise (U&U) the selections of Spray Colours and textures, along with the Variety, Of Musical Hip-Hop, Reggae & R&B instrumental Sounds, to work along-side with. The Technology is truly at its best, for 2019 and We should look forward, for positive possibilities, that are yet to come, beyond this point. . . .\n\nHelpful | 26", "CycomeDec 31 at 12:37 PM\nBeautiful\n\nAs soon as I saw it on store I was hooked. It looked amazing and when I tried it I wasnt wrong. It looks like real life. This game is awesome.\n\nHelpful | 0", "ommmmmnDec 20 at 12:55 PM\nGreat\n\nA great simulator and you can make real art for sure. Easy and fast to create with a nice feel. Let.me also be clear, it is a great buy for anyone into any art.\n\nI have two issues. Firstly it is quite pixelated and sometimes this is in the way of immersion. Even if hardware is the issue and not the game it is worth taking into consideration. Secondly, since there is no undo and not any kind of free creativity mode at all (only painting with save and load) it is not good for learning. It also means that when the location of your face goes through the wall and all around you goes black, you keep painting in the dark and cannot undo. When the tracking fails and you accidentally draw a line all over your art, there is no undo. He VR ultimately does bug out as well which means that this is a continuous problem. This sucks for beginners and makes me use it less.\n\nI'll hit you up with the last star if these issues get fixed and I am definitely happy I supported this app and whatever the company will make in the future.\n\nHelpful | 3", "BloomPetersDec 16 at 11:35 PM\n:O\n\nStunning cool and amazing. I just started and I am gonna fall in love!! This app is the best drawing app ever and is on quest wow! The simulation is spectacular. Sounds and all. Would love to see own MP3 playback\n\nHelpful | 0", "oliactivateNov 29 at 3:05 PM\n\nI always wanted to have the guts to try out graffiti when I was younger and now I can. I love that you can play hip hop on the radio and really get into the zone throwing up some paint. My only gripes are that there isnt an undo (I end up ruining so many paintings) and that its hard to get a light dusting of colour texture by spraying from a distance. It seems like the spray has no effect at a certain distance from the wall and then closer than that it is too heavy. I still give it 5 stars though, I can spend hours playing this and it feels like minutes.\n\nHelpful | 0", "JustANonJan 2 at 10:40 AM\nThe best game! Just want a undo button\n\nEverything is sick in this game, the only thing I want in this game is a undo and redo button other than the clean wall option.\n\nHelpful | 0", "LogDog187May 16 at 2:53 PM\nLove it but...\n\nI think that you should be able to use stencils, ones you get off a menu or even make your own, itd make it a million times more fun to do\n\nHelpful | 0", "YoDogYTJan 2 at 11:55 AM\nGreat Game for Artists and the Normal\n\nA realistic game that brings the artistic abilities out of everyone and feels satisfying to spray paint without limits.\n\nHelpful | 0", "brotherazariasDec 25 at 10:44 AM\n\nAwesome! Worth every penny. The spray paint feels so realistic. I find it very relaxing to go into and just let loose with color for a bit. Great job tram!\n\nHelpful | 0", "KrisVRNov 25 at 2:02 PM\nFeels real :)\n\nHighly recommend : )\nFeels very real , unlimited paint is what we all need :)\n\nBut is difficult, if you think art it's your thing you can buy it without over thinking.\n\nIf not quite ... do not exept any tip, help, any easy mode from it. Only you and your imagination/skill really matter there. You will need ideas and a lot of patients to bring them on the wall.\n\nGame is very relaxing and samilar to meditation like many other artistic areas.\n\nI like very much so far :) shouldn't change\n\nVRManiaQ - DIY VR Channel\n\nHelpful | 0", "Creed136Jan 10 at 3:16 PM\nGreat, love it\n\nIt's a great game I love it very realistic how the spray cans work too\n\nHelpful | 0", "ibenji05Jan 14 at 8:08 AM\nBeautiful\n\nAmazing game stunning graphics and very realistic\n\nHelpful | 0", "defierrojMar 29 at 5:09 AM\nNeeds more scenarios\n\nThis simulation is incredible, multiplayer co-op works awesomely, and I understand the concept devs tried to replicate, but is it necessary that scenarios are abandoned and so dirty? I mean, just give us a nice wall without so much garbage around. The only clean scenarios are places where you'd never make a graffiti in real life. A movie theater? Really? Am I too old fashioned? lol.\n\nWhat I don't like about this game is this association of graffiti = something forbidden you gotta do hidden from police. The rest is said. It's really really well made and I'm happy I bought it because it's really relaxing. Just less garbage, please. Graffiti art doesn't necessarily have to be something you do under a bridge.\n\nHelpful | 0", "potroast.thursdaysApr 16 at 8:39 PM\nGraff artist\n\nSuper cool for everyone especially if you have done Graff before. must try\n\nHelpful | 0", "lildanzigDec 14 at 11:03 AM\nWow.\n\nAs an ex-vandal, I can thoroughly recommend this app. As close as youre gonna get to writing in real life without the fumes and the constant threat of arrest. Big ups.\n\nHelpful | 3", "ImNinjaNicholsDec 16 at 7:43 AM\nReally Good Fun\n\nIll start by saying Im not at an artist by any stretch of the imagination and this is the first creative game Ive bought. Ive used a spray can once in my life when I was about ten to write my initials on our garage wall.\n\nBut this game is still such good fun, I spent about an hour just shading some different colours together.\n\nThe only reason I havent given it 5 stars is that theres no way of getting high up on a wall without an object (of which there are few), and I cant seem to find a way of saving a custom colour which would make that process much easier.\n\nAll in all, great fun and I can see myself coming back to this for an hour or two every week as its pretty therapeutic.\n\nHelpful | 2", "NinjaNoah09Apr 13 at 7:19 AM\nReally good game\n\nIt is so immersive I think it is perfect and a legal approach for actual spray painters\n\nHelpful | 0", "CoumeNov 23 at 8:36 AM\nBest Simulator on the planet\n\nI would like to start out by saying big shouts out to the team out in Sunny Brisbane! Fantastic job! I've been doing graffiti ever since elementary school born and raised in The South Bronx NYC. Soon as I stumbled upon this game i had to have it! Not only did I buy it but i convinced two of my other buddies i used to do graffiti with back then to get it too! And thanked me and they love the game. Once again fellas amazing job, we the community look forward to new updates.\n\nHelpful | 0", "JJSLAYERJan 18 at 3:20 PM\nBest relaxing game\n\nI love this game\n\nHelpful | 0", "ImPurgeNov 24 at 9:05 PM\nGreat game\n\nI never really was into graffiti art but once I actually started playing this game it has been something Im really getting into and it is very accurate to actual graffiti so I definitely recommend this game to anyone trying to get into graffiti art or just likes art in general\n\nHelpful | 1", "ILikeYaCutGNov 22 at 8:47 PM\nGreat game\n\nIve never really done Graffiti before this and after 10 minutes it was super fun and I played for hours, its very realistic and after a while you forget your in a virtual world, one thing I would say is one time I tried to save my painting it didnt save and also its hard to get to the higher places for bigger peices,(note that I am 51 so it may not be a problem for others lol)\n\nHelpful | 0", "DEATH2118Dec 5 at 10:35 AM\nSketch?\n\nLoving kingspray so far! Just wondered if there is a way you can view a sketch on the quest rather than painting from memory all the time? Or is there any ideas to bring something like this to the game?\n\nHelpful | 3", "Crazy_SaneNov 16 at 9:24 PM\nGreat Creative Tool\n\nWhether you're into street art or just love painting, this game is a must have. I'm hooked on this. There are some amazing creations in the gallery to inspire you, all of which you can download. An assortment of colours, spray nozzles and detailed environments make it feel very realistic.\n\nA couple of things I thought it could use are a back button for when you make a mistake and rollers for getting nice straight lines for things like \"blockys\".\n\nHelpful | 2", "SlothmachineMar 31 at 2:54 PM\nOne of the best Quest experiences\n\nMade new friends while painting graffities in online mode. Im so glad the game has this feature.\n\nI wish there were synced music option.\n\nHelpful | 0", "drkhrseDec 16 at 11:16 AM\nGreat port of an awesome game\n\nThe graphics and painting quality really carried over from the PC game. It's the third platform I have bought this game on and don't regret it at all! keep up the great work.\n\nHelpful | 1", "MLG1234Dec 31 at 1:00 PM\nAwesome!!\n\nThis app is very easy to get into and fun to play with. I my self made many  art pieces  \n\nHelpful | 0", "Bomber16693Mar 23 at 8:10 PM\nNot really for me\n\nI was recomended this game from a friend i find it ok but its not my style of game ill give it 5 stars as it foes do what its supposed to but to be honest i have buyers remorse.\n\nHelpful | 0", "InformaticoreNov 18 at 3:11 PM\nAwesome Game!\n\nI thought - what a cool Idea, lets see how good they did... and they did very good! It would be cool to have a feature, where I can place an image somewhere to look at as a reference to draw from. But still a super nice game which calms me down after a stressfull day. I am glad there is no police to run from :-D\n\nHelpful | 1", "Bdog138Dec 31 at 12:22 PM\nHelp!! (Fixed)\n\nEdit: Devs responded quickly and I am no longer having any problems. Love this game and you should definitely try it!\n\nHelpful | 0\nDeveloper ResponseDec 29 at 2:33 AM\n\nTo see your saved work you just need to go back to the scene that you saved it in. For instance, if you were on the Rooftop scene when you painted and saved a piece, you'll need to return to the rooftop before you can see it and reload it.", "JACKBOYS_Dec 26 at 6:04 AM\nThe best game ever\n\nThis game is a bless of vr games. Its really realistic and the online is fun and the community is not toxic at all\n\nHelpful | 0", "TarqiNov 27 at 5:23 PM\nLeave the spray cans at home\n\nIf you've ever fantasised about what it would be like to do graffiti, this will quell your curiosity. With the advent of multiplayer, Kingspray turns into a creative and social app, making murals alongside others. Definitely recommend for any artist out there!\n\nHelpful | 0", "MissionReneJan 17 at 10:55 PM\nAwesome\n\nJust simply amazing.\n\nHelpful | 0", "futurewulfNov 17 at 11:13 PM\nNEEDS ONE THING !!!!!!\n\nAll I would say it needs is a way to take a pic of a sketch or reference pic and be able to display it in a corner of the screen or even in the watch phone screen . But love how real to life the experience it otherwise I think its pretty much perfect\n\nHelpful | 5", "Jordon_VRJan 4 at 3:48 AM\nSO REALISTIC\n\nTHIS GAME IS AMAZING, SO REALISTIC AND YOU FEEL LIKE YOUR THERE SO REALLY IMERSIVE\n\nHelpful | 0", "spanmanspazNov 11 at 9:57 AM\nAwesome experience\n\nThis game is great! The only thing I would ask was for a tutorial mode to help get started easier. I figured everything out on my own but would have been quicker with a simple tutorial. The other issue is that I spent an hour working on a project and saved multiple times only to not be able to load my saved work... is this a bug?\n\nHelpful | 3", "BabyYoda328Mar 18 at 11:20 PM\nGreat!\n\nThis is a great game for people who like art a lot or just want a relaxing game to play. Im a complete amateur when it comes to spray painting, but I still had fun making art.\n\nHelpful | 0", "ThatOneGuyBJNov 16 at 5:44 PM\nGreat!\n\nLove this game so far. I felt very immersed when playing it that I waked my hand against my door. The single player is fun for a full mural experience. But the fun is in the multiplayer. Told someone that I was new at the game and next thing I know hes teaching me how make my drawings better. Great overall experience\n\nHelpful | 0", "LazyLimeNov 27 at 2:17 AM\nAwesome!\n\nFirst of all, i have no skills at all in arts. Still, i REALLY think this game is one of the best! It feels so natural and looks so beautiful. Prepare your imagination and unleash you arts skills! This game is a must for sure, no denie to that.\n\nHelpful | 0", "Neostar6Nov 14 at 11:13 AM\nLoving this game\n\nI got this on a whim thinking that maybe I just suck at drawing on paper. I was very very wrong but that hasn't stopped me from spending a few hours spraying. While at first I thought a tutorial or at least a quick run through of features would be appreciated, I find that the process of figuring it all out made me even more interested in continuing to play. I've gotten so into some pieces that I have had to find a real world stool to stand on to get at some out of reach areas. The music is fantastic, the options are far deeper than you could guess at from first glance, and I've never had more fun \"art-ing\".\n\nHelpful | 0", "eithanjsmithJan 1 at 10:22 AM\nGreat\n\nThe game is good and fun to use with easy to learn controls and no tutorials are needed but...\nWe need a seated mode so people dont have to stand up to play it would make me play the game\n\nHelpful | 0", "KrymBaltimoreNov 12 at 10:48 AM\nLike it but..... Ok...i love it now\n\nI really like this game a lot but everytime I use it, I start something that I begin to like (which takes a lot because I have no experience with spray paint or graffiti at all irl) and after a while I get to a point where I want to stop and come back fresh to finish. The problem is that, when I save the work, I think it means that I can come back to the same work to finish but it really means you'll never see your work again. I have to start from scratch everytime I do anything in this app. That shyt is real frustrating. It has happened at least three times now. Does save mean something else in this app or what? Other than that, I enjoy it. Fix or add a save and resume function and I'll love it.\n\nUpdate:\n\nAfter the response from the devas, I found out that you have to go to the place where you saved your art for it to show up which means I gotta change my review to 5 stars and love instead of like! This is a great app! I highly recommend it. Whether you are into tagging or always wanted to be but never did, (like me) this will satisfy you I'm sure! Stop wasting time reading reviews and get this NOW!\n\nHelpful | 1\nDeveloper ResponseNov 11 at 4:07 PM\n\nThat shouldn't be happening. One thing that catches people off guard sometimes is that you can only see your saved work when you are in the level that you saved it in. For example, if you were working in the underpass and saved a piece using the phone, you'd only see that piece in the \"Load\" screen of the in game phone if you were in the Underpass while looking at the menu. And if you look at the \"Load\" menu on the phone while in the Bunker, you'll only see pieces that were saved in the bunker. Right after you take a picture with the phone, go to the load menu and make sure you see the preview of the picture you just took. If not, could it be that your device is running out of space? If you're still having troubles, hop on the discord and we'll help you to get it going (https://discord.gg/Yc2B5av).", "MMM182Jan 19 at 9:12 PM\n\nWonderful game for the artistic-minded. Very relaxing, and great people online.\n\nHelpful | 0", "salmaansayilJan 25 at 4:33 AM\nGreat needs improvement\n\nIt is really good but it needs some improvement if they add better way around on the phone and if it was less laggy it would be better\n\nHelpful | 3", "waldemort.pandaDec 27 at 12:39 AM\nGreat game!\n\nThis game is great and very realistic and good for practicing!\n\nHelpful | 1", "rabidredratNov 3 at 2:20 PM\nOutstanding\n\nNot sure I can call it a game its a highly responsive graffiti simulator. Very realistic and functional.\nFrom the welcoming screen you can go in to solo mode and choose your wall. You teleport to your required position and start getting creative with the range of different spray cans. All feels very realistic, there is a music selection of cool tunes to paint to and sound great through the quest.\nVery easy and happy to lose hours as time flies inside this quest experience.\nSave your work by taking a picture of it.\nIf you don't like what you done you can wash the wall clean and start fresh.\nPlease note as of yet there is not back function(like real life) so any paint put on the walls sticks and you need to be careful with any mistakes made. Start with a background colour instead of fresh wall is a helpful tip for this.\nThere's an online experience where you can work on projects together with other players and meet other taggers. Some very talented people out there who share there knowledge.\nThoroughly enjoyable and although I've never tagged a wall in my life I think I'll be great at it with my VR graffiti skills.\nYou'll save 1000s in real paint, avoid a criminal record, not suffocate on spray fumes and still improve your skills.\n\nHelpful | 4", "NicJames411Nov 27 at 2:03 AM\nBeyond Immersive!\n\nOne of the best I've experienced so far! You forget your in VR. You just lose yourself in what your painting, it's so life like it's crazy! Love this and recommend it to all people no matter your artistic ability.\n\nHelpful | 0", "69AsparagusJan 2 at 11:03 PM\nGreat game\n\nI tagged e-coli on a wall\n\nHelpful | 0", "Colea1235Jan 4 at 10:03 PM\n\nJust try it...\n\nHelpful | 0", "ShouldYouPlayThisNov 7 at 9:35 PM\nI had doubt at first\n\nI played yesterday for fifteen minutes, didn't seem like the game for me.\nI didn't understand the controls and didn't know the phone existed.\nI tried to play it today and it was so good, especially with the music. You have to buy this.\nJust a little suggestion for the developer: Adding a tutorial or at least telling the Y button can open the controls menu would be so much better for new players.\n\nHelpful | 0", "kaleb.O.05Apr 7 at 10:31 PM\ngreat asf\n\nits awesome great for me users\n\nHelpful | 0", "Wollfgang333Nov 29 at 9:15 PM\nWOW\n\nI got lost in this game. You can do flares!! I had so much fun playing! I paint in real life the color secletion is fire. Im pretty sure the game is sponnored by iornlack. \n\nHelpful | 0", "sebastianreloadedDec 29 at 1:22 AM\nfantastic\n\nthe game you never knew you wanted!\n\nHelpful | 0", "hcreyes0910Oct 26 at 11:06 PM\nGraffiti artist\n\nIve been writing on walls since I was 12 and still at 47 I love spray cans. Ive had my fair share of subways, vandalism, ultimately to a paid artist. Best app ever for you graffiti artist out there BY FAR. It is now 2am. and Im sad my quest shut down because of no charge left. I used it all!!!!!, lol. Spray cans were on point, the music had me going , the noise had me looking over my shoulders, lol. I even kept thinking about the smell from time to time would it effect me, lmao. YO !!! Cant wait for a full charge. Im going back in.\n\nHelpful | 5", "JU5T1N_06Dec 25 at 11:12 PM\n\ngReAt gAme. rEaLly gOt mY cReAtIvE jUiCeS fLoWiNg\n\nHelpful | 0", "casey.whitney.33Nov 30 at 6:51 AM\nDope game!\n\nIm a graffiti writer in real life an this was a great experience. The spray tips are very similar to a real spray can. Textures are great too! Add my tag name dalogoplug ;)\n\nHelpful | 0", "12vdcDec 9 at 10:33 PM\n12vdc\n\nman this game is like a vacation but you can take anywhere with you. just relax listen to chill vibes and spray.Love it\n\nHelpful | 0", "lexusantNov 3 at 6:01 AM\nBrilliant\n\nWhat can I say about this app, absolutely excellent, the devs have put a lot of work into this and the realism is mindblowing. I have a grafitti artist background and used to paint everywhere from warehouses to track sides. The 1 thing that would make this PERFECT would be the ability to upload my own sketches to have a reference when painting. If you like art get on this, it's just sik...\n\nHelpful | 0", "Is_MoogDec 11 at 3:44 PM\nThis is a great game\n\nIt everything i wanted it to be and all of the sprays are really accurate, also i like that i can listen to music, it really makes me get lost in the virtual world and i love that.\n\nHelpful | 0", "LanePizzaOct 20 at 2:19 AM\nI've changed.\n\nBefore I tried this game out, I hardly made any drawings/paintings/art; but now I can't stop! \nI'm getting on Kingspray everyday now, spending hours making crazy and fun art.\nTaking that spray paint and just going with my imagination has been so fun. It's also very relaxing to put on the in-game radio and listen to your style of music while you work.\n\nI am VERY proud that I bought this game!\n\nI only BEG the developers to put in more locations. There are a fair amount now(and they are beautiful, even for the Quest), but I would be extremely grateful to see more in an update. \n\nThank you so much for putting in quality work for this game!\n\nHelpful | 2", "dawson.shaver.9Dec 9 at 10:29 PM\n\nOne of the most satisfying games Ive ever played and just cant stop playing highly recommend !!!\n\nHelpful | 0", "toddkeebsDec 24 at 7:16 AM\nGreat app! (tho not perfect)\n\nOverall the game is great. Realistic spray can control, great interface, and cool features.\n\nThat being said, a couple areas for improvement:\n-resolution degrades when close to wall\n-can only spray designated areas (come on, half the fun of graf is breaking the rules!)\n-not very clear what you can and cant pick up/use to stand on (I couldnt get any of the lifts running)\n-some features from main game not available on quest (unless Im stupid and just cant figure it out)\n\nHelpful | 4", "Royce_Coolidge80Oct 30 at 3:07 PM\nWonderful !\n\nIve experienced some other art based VR games like Sculpr VR, Cool Paint & Google tilt brush - and they are all excellent and fun to play with. This however is up there with them, but delivers something new and unique, a legal version of graffiti for one , but seriously its just genius. You just pick up the cans and start creating, you dont have to be an artist to enjoy it, after all art is a form of self expression and is subjective, so do your thing regardless!\nThe variety of paint & nozzle effects combined with realistic paint physics and urban canvases make this something really special and again I repeat, unique. Only suggestion I would make as an improvement would be an opposite function to the crouch, to reach higher ground, other than that, PERFECT!!! great job guys!!!\n\nHelpful | 0", "GeeBee2Oct 18 at 9:30 AM\nGreat Fun\n\nI've already got Tilt Brush and Sculpt VR so wasn't sure about getting this. I am so glad I did. It's amazing fun, so realistic. I've never sprayed graffiti in my life but I can really see how addictive it could be. Working on a small part of a wall, moving across, adding to your masterpiece then standing back and admiring your work. Even after 20 minutes play I have created some good looking stuff. Watch out Banksy! Buy it, try it, you'll probably love it!\n\nHelpful | 6", "holger.ruscheOct 19 at 2:35 PM\nWow. This is VR ....\n\nThis is one of the best ... Maybe the best Titel ATM on the Oculus quest. The experience is immersive ... The feeling is real. You ARE that guy ... Hearing your favourite music while colouring the grey walls of your neighbourhood... But one details is missing .. you do not fear of the cops.. and this is it. You can do your thing everywhere everytime. And hey .. take a photo or a selfie and share your pics... Or meet your crew members online and spry together ... It's hard to find something to criticize .... Maybe the missing \"undo\" function... But hey eventually we are getting an update that makes thing boom Titel a super boom Titel ... Seeing you on the street dudes ...\n\nHelpful | 5", "MondoSamuOct 21 at 6:04 PM\nDream come true!\n\nI grew up when hip-hop and graffiti were just becoming popular. Ive been a fan since I was a little kid, and dreamed of one day doing it myself. I never did for legality reasons, and when I saw this and tried it out it was literally a dream come true for me! I absolutely love this and its also sparked a renewed interest in learning it in real life as well. This game is near perfect!\n\nHelpful | 4", "idontkn0wDec 3 at 12:26 AM\nDecent game\n\nI'm too tired from playing this all day to write a review so I'm just gonna say it's a great game no improvements needed.\n\nHelpful | 0", "CornNuttDec 25 at 4:19 PM\nBeautiful\n\nBEST GAME!\n\nHelpful | 0", "purplekarrot1Dec 7 at 5:03 PM\nBest game created\n\nI play this game daily as close as you can get to real life amazing graphics I play this game daily\n\nHelpful | 0", "SloppyJoe2008Oct 26 at 10:26 PM\nImmersive!\n\nThis game is great, I love art and I really wanted to try art in VR, gravity sketch wasnt too appealing to me so I tried this and I love it. An other review said that they normally look through the nose holes in the headset but this game kept me distracted. I spent hours making graffiti and its so fun, the only complaint I have is that there should be a ladder on every level and some sort of eraser that erased in the same form as the standard cap. Love. This. Game.\n\nHelpful | 0", "one3rdnerdOct 23 at 11:52 PM\nOne of those unique experiences in VR\n\nKingspray provides one of those unique experiences in VR that are otherwise a lot more difficult or expensive for a lot of people.\n\nFor the price of this app you get infinite paint and surfaces to tag and graphiti.\n\nId rate it 6 stars if they found a way to add\n\n- Stencils - and a way to use a craft knife in the game to create your own shapes out of card (or side load them as svg shapes)\n\n- Sketchbook (reference images) - the ability to have a sketch book I can put on the floor and look at reference images I have downloaded or sideloaded of my own sketches or other peoples for inspiration and to learn lettering styles. This might also work nicely on the phone you have in your left hand.\n\n- More boxes or objects to stand on so they are available in every scene and easy / obvious you can use them\n\n- Tutorials would be good for some things.\n\n- A web browser in game to watch youtube tutorials would be awesome.\n\n- It's unfortunate the undo isn't an option due to the Quest's hardware so we will have to live with it. Fortunately I also own it on Steam so I can try it with Oculus Link when that comes out.\n\nHelpful | 1", "Sanctums_AsylumOct 18 at 6:48 AM\nSo addictive\n\nWatched some YouTube vids using this program, and oh my god its exactly like the PC / rift version.\nNever drawn something with spray paint, only pen and paper. So bit of a learning curve but easy to get over. No tutorials, just get in and spray (which I prefer). Love how fluid the movement is, no stuttering or glitching.\nOnly brought this last night and all I have been mostly doing is exploring the different areas you can spawn in, throwing stuff around and just enjoying some of the views while listening to the boombox indie station. \nIf you have always wanted to do some graffiti but had no money for real spray cans or didn't know anywhere to do it, this is the next best thing.\nCan't wait to show my sister, nephew and niece. They are gonna love it.\n\nHelpful | 4", "therealcheese28Oct 26 at 12:40 PM\nAwesome game\n\nReally enjoying this game, nice immersive game, it really feels like you're in a different place.\nme and my boy having a great laugh drawing all sorts of random things .\nThe hip hop tunes are well nice and chilled out, and really nice quality.\nDeffo a different style of game, and one I wasn't expecting to be this good to be immersed in.\nCasting to a Chromecast V2, works really well, even get the tunes going over.\nNice one!\n\nHelpful | 0", "exjraordinaryDec 16 at 6:45 PM\nI agree a system seller\n\nAs the first review said this is a system seller and in my opinion the best art creative app on the system. functionality wise tilt brush is more advanced but this app is powerful and I think the varied environments and great music and interface on vr phone makes this a top game on quest. so fun just graffiti normal areas then share online. And so many uploads of great work online in the game like this whole solar system I saw. Seeing others works really has me thinking to up my game double entendre. lol\n\nHelpful | 0", "Rabbithole1979Oct 25 at 7:52 AM\nAmazing\n\nExcellent graphics. We can spray graffiti without getting in trouble with the law. One major flaw. When I accept the invitation for someone to join my graffiti session and if we are both spraying graffiti at the same time and I decide to cleanup my graffiti, it cleans the other persons graffiti too. Please fix in the next update.\n\nHelpful | 0", "NinjaVanishingOct 25 at 12:30 PM\nDope!!\n\nMy first time writing a review and this game deserves it! Ive been in a creative funk lately and this is breathing new life into me.\nSo nice!\nSide note for any dlc stuff in the future..being able to tag a flying saucer at area 51 or some random corn field would be cool ;)\nOh and being able to pull up and suspend reference images from your own library would put this into full throttle...just saying\n\nHelpful | 0", "snap6kpOct 25 at 1:31 AM\nLove this game!\n\nI love this gAme I use to do a little graffiti back n the day but never got really good at it, playing this game took me back lol online is awesome met a couple of really talented individuals. Really felt that homie vibe. I just wish they added a watch on the wrist haha , i lose track of time also i wish they had a option to upload ur image so u can tag it on the wall.\n\nHelpful | 0", "MrBenj4minOct 20 at 8:52 AM\nAwesome!\n\nFinally a game that lets me return to the early 80s and graffiti painting! Now with all kind of caps, colors and without the smell.\nJust love it! I only wish there was a ladder in game for those tall paintings. My physical roof is in the way...\n\nHelpful | 2", "llaffaOct 24 at 9:20 PM\nDelightfully simple\n\nIt is exactly what you imagine, perfectly executed. The mechanics of the spraycan work extremely well, it is very satisfying and relaxing to use. I spent around 3 hours working on my first graffiti around other people, and I almost feel that if i get good here I'll be good IRL aswell (never done it ). the community is super nice aswell.\n\nHelpful | 0", "ChillitzkdOct 24 at 1:23 PM\nAwesome Game! But...\n\nI think it would be a great idea to be able to upload your own concepts to the game via appstore app. The concept would be found on the in-game phone. This would be a great feature because with this, we can easily put up some concepts that we had without having to keep taking the headset off to look at it.\nNot all surfaces allow you to paint on them which kinda buged me when I first started, but I've gotten used to it.\nThis is an AMAZING game and I never get tired of it. I'm so happy you guys took the time to put it on quest. Thank you so much, keep up the outstanding work\n\nHelpful | 0", "bayzee55Oct 18 at 10:28 AM\nJust wow!\n\nIve had the Quest since day one and never wrote a single review until now. Of all the apps I have this one actually makes me giggle with excitement every time I use it. Its now my favorite app and one Im dying to show to others. It might have been out for awhile on PC but the Quests portability makes this an absolute must have carry-along city canvas. Love every bit of it!!\n\nHelpful | 3", "DoofusDoofOct 18 at 12:53 PM\nTraining grounds for graffiti writers\n\nA almost exact replica of graffiti in real life. Amazing experience where you wildest imagination can come to life. Its amazing to be able to practice a price and perfect it before doing it in the real world without having to waste any paint. I would 110% recommend this to people whom wish to try out graffiti, like art, want to practice a piece or just want to spray a wall without any consequences. Good job guys!\n\nHelpful | 5", "MPGOCULUSOct 24 at 5:57 PM\ntrue to life\n\nI was a graffiti writer growing up, unfortunately I haven't had to do with graffiti in a long time other than occasionally enjoying them when I'm traveling to different cities.\nYesterday I bought this game and blowing away how good it is. The only thing I miss from this game is the smell of the fresh paint! :D\nThe music, the vibration when I'm holding on the caps, just the whole vibe game of the game is A+ !\n\nI would like to thank for the developers for this masterpiece!\n\nHelpful | 0", "ZeroGradientOct 18 at 7:17 PM\n3 Hours of Bliss\n\nHad my Quest since early September, first game i have played that has made me want to write a review... Coz this is sooooo good.\nWhen first picking it up it took me a while to get use to the controls, what buttons did what, moving round the space etc. After about 30 mins though i found myself totally immersed within the game. Ive been doing graffiti/street art properly for around 8 years now, and if anything im better in the game then i am in real life, mainly becasue of the freedom it gives you to just paint and experiment. Not having to worry about having the right colours, enough cans, costs etc etc is worth it alone. But for me, the little details, like the change in shine from fresh to dry paint, the way the paint follows the texture of the walls, the little rattle the can makes, it all adds up to a truly great experience that i know im gonna get hours upon hours of gameplay out of. The ability for me to practice my designs and try out new things will no doubt help to improve the work i do for real.\nSo far ive explored 4 of the levels, and spent half of my time in the multiplayer mode, which is great for seeing, sharing and chatting with other users.\n\nIt would be nice if there was the possibility to go up, to bring in a platform or something in so you can reach higher. Even if it was just a single level which was geared towards tall rather then long images. I also find the drips to be a bit hit and miss, appearing when i wouldnt expect, or not being able to force more of a drip when i want it. But these are so far my only 'complaints' as the overall experience is amazing.\n\nHelpful | 3", "KytoxOct 30 at 6:40 PM\nReally fun\n\nThis game is very entertaining to play if your an artistic person. I always wanted to try spray pain as a medium but had nowhere to do it, at least legally that is. Whether youve never used spray paint before or are a seasoned professional youll love this game.\n\nHelpful | 0", "Niceone206Oct 21 at 5:04 AM\nAmazing!\n\nHad some issues a little bit ago but the developer promptly responded to explain the controls. Still don't know how to export my art to my phone or computer but I expect that's possible somehow. This desperately needs an undo button or an eraser. Currently the only option is to erase an entire project and start over. I've seen a few other people requesting this feature and I think someone explained that it couldn't be accomplished on the Quest but I'm still gonna cross my fingers. I know it's less realistic but I'd trade that little bit of realism if it made the process of creating something dope a lil easier and less aggravating.\n\nAmazing job Dev team!!!\n\nHelpful | 1\nDeveloper ResponseOct 21 at 3:40 AM\n\nI think the solution to your first issue is teleporting. To activate the teleport laser, hold down the \"A\" button (or \"X\" if you are in left-hand mode). That will give you a sort of laser pointer. Point that at the wall or ground and you should see a circle appear on the ground. When you release the teleport button, you will be transported to that spot. That's the quickest way to get around. For the second problem, there are objects in the worlds that you can pick up, move around and then teleport on to so that you can spray higher up. Keep an eye out for ladders and barrels and such. You teleport or walk up to them, put your hand into them and then use the grab buttons on the controllers to pick them up (the button that is under your middle or ring finger on the controller). To teleport on to the objects just aim the teleport laser at them until you see the circle appear on top and let go. Not sure about the turntable height. If you also feel a little too close to the ground when in the levels, it may be that your floor height isn't set properly (that'll be in the oculus settings). If you're able to, join up to the discord: https://discord.gg/Yc2B5av . We're on there along with lots of very helpful people. We can help you out a little better if we can have a two-way conversation :) If not, you can send an email via our contact page (http://infectiousape.com/contact/) and we can help you through there. If neither of those communication methods work for you, hop in to multiplayer mode and join a session with someone and they should be able to show you in person how to navigate the levels.", "sami.leskela.9Oct 19 at 11:08 PM\nPerfect idea for a VR game !\n\nI purchased this game couple of days ago and I can highly recommended it to everyone. What makes this game outstanding, is the fact that the game idea will work perfectly in VR and Quest version utilizes the unique features of the device. With a room scale tracking enabled, it really feels like you are doing this fine art in the real locations. Graphics, controls and music are very good and the game itself leaves a lot of room for personal choices and imagination. I do not know why, but I also got a bit of extra excitement from the fact that painting graffiti's is not allowed in real life :-) Big thanks for the developers for making a great and unique virtual reality experience. 5+ stars!!\n\nHelpful | 2", "Tatt00DaveOct 21 at 2:28 PM\nHighley Recommend This Game\n\nLove this game my go too now , So Ive been into art for a long time the controls are very close to real spraying. But can take some getting use too.\n\nMusic is good although more selection would be good.\n\nNice multiplayer modes 2days of playing and Ive just mastered controls give a go its well worth the money highly recommend\n\nHelpful | 1", "DevKingJamesOct 21 at 12:45 PM\ntag and chill\n\nI grew up exploring abandoned buildings and tagging on corners, rooftops and underpasses. I'm super rusty, but the virtual can felt great in hand. paint color selection is wide and vibrant, spray pattern and weight is beautiful. cops are nowhere to be seen. it's paradise for an artist wanting to throw up a piece and chill out for an hour or so. multiplayer is fun, music is good, check it out. (only con so far is that the paintable surface area is a bit limited, I wish more surfaces would be paintable, but I respect the level at which their painting sim works, so I don't mind the limit much.)\n\nHelpful | 1", "retropathsNov 15 at 4:14 PM\nbest game in the world\n\nfav part of the game is the music u guys actually have like 2019 music thats good and a rlly good variation of diff kinds of hip hop music, also the graphics are so mint amazinngggg\n\nHelpful | 0", "tastysoapDec 20 at 8:39 AM\nman this game\n\nis good\n\nHelpful | 0", "BradHerman3DOct 27 at 9:30 AM\nExactly what it says it is.\n\nI have used kingspray in VR before and I was already a fan. The quest port makes it easy to access and always in your bag. Wish it had export options like the desktop but maybe those will come soon. Also could use a tutorial for new people. That said, 5 stars. Its awesome.\n\nHelpful | 0", "Littlemack02Oct 20 at 9:54 PM\nWOW JUST WOW\n\nThis surprised me. Genuinely. Im not a artist by any means. I can draw a stick figure and thats an accomplishment in my book. So I was skeptical about this title. But eventually I got bored enough and gave it a shot. And I was SO IMPRESSED. This is an actual finished game. I couldnt believe it. This wasnt a prereleased game. This wasnt a bug filled simulator. This game was almost perfect. I lost track of time in there. I ended up plugging up my headset to continue playing. Money well spent. I will be doing a full review of this title on my YT channel: LittleMack02. Great job devs Im impressed.\n\nHelpful | 1", "noobslayer123Oct 26 at 5:41 PM\nVery good\n\nIm speechless I cant get enough to do it I just got to go home Ill see yall when you wanna Ill see yall when you wanna Ill see you when yall go to the new game I love to play it and get it done Ill get you to the house I can go to the new one I can get you something to go to do you want me or I wanna I was just like you said I was just like I was like I wanna was the time I wanna\n\nHelpful | 0", "Yt_ToastySkaterOct 20 at 2:50 PM\nClosest game to real spray paint\n\nOk this game is just about one of the best looking and best preforming game on oculus first off this game has about every color and shade of spray paint possible and has every cap you need to make tags or murals even though the thin line cap is very pixelated you can make just as thin lines with any other cap there is also the best pressure mechanism Ive ever seen for when you want a thin almost transparent layer of paint you can also go to lots of very realistic areas around the map including my favorite place rooftops all of the locations in the game are things you would find in real life which makes it much more realistic and fun the online mode in this game make the game way more enjoyable to social people trying to make separate art and talk or to get help on a giant tag or mural Ive been using this game for over 10 hours now and I have experience with real spray paint so if you are someone that is looking for a fun creativity game this is it\n\nHelpful | 1", "sisco.yeOct 22 at 1:43 PM\n5 star please fix bugs\n\nCrazy problems with joining others rooms and painting with them. Being accepted to paint but then know body is there. Blank galleries. Not just me as we are all talking about it. People come to my room start painting over my art, but they see nothing but a blank wall. Nothing wrong with the product as solo artist Just online is buggy big time.\n\nGood ideas for future\n\n1) be able to load a sketch or design to your phone so you can paint from a design in game\n\n2) point with cursor then press crouch and that will be the level of the crouch height. Coff coff. Got a bad back\n\n3) that will be all. Cheers\n\nHelpful | 0", "IAmPerryTDec 22 at 2:26 PM\nGreat but\n\nIt's a great game but if its possible to add a paint roller so it doesn't take 5 minutes to spray a wall for a backing colour.\n\nHelpful | 0", "Zef_GedeOct 18 at 11:24 PM\nFirst impressions...\n\nI am not artistic by any means. I used to draw when I was younger but I have no skill with paint for airbrushing tattooing or drawing these days. I would consider myself an amateur I will say that first.\n\nGraphics are amazing in this game. The UI interface is intuitive and pretty easy to understand once you get the swing of it.\n\nmy first impression within the first 20 minutes of the only thing I could really wish this game had and it would be genuinely perfect. Is the ability to import photos as reference photos to paint stuff!\n\nHelpful | 1", "TheHamster767Oct 19 at 12:22 PM\nThis game is great!\n\nI love this game. I put a lot of time and effort into my artworks without the risk of getting into trouble. They only wish I have is that they would add a ladder that allows you to paint higher up. Yes you can get your own ladder, but it would be easier for them to add it in themselves. I also dont have a big space to play VR, so I find myself bumping into walls trying to get to the VR wall. Thank you anyways!\n\nHelpful | 1", "KnifehandmediaNov 1 at 7:57 PM\nBest chill out space\n\nI know everyone gives altspace the love when it comes to just chilling with other peeps, but for me this trumps it hands down. I love collaborating with friends and randoms alike in this art wonderland and I couldn't be happier with my purchase.\n\nHelpful | 0", "Flying_Llama274Nov 13 at 11:50 PM\nIncredible for beginners!\n\nI didnt know a thing before i purchased this game, but it is an oculus must-have. I know nothing about graffiti art, but ive always wanted to learn. This app makes it fun and easy\n\nHelpful | 0", "VRMatic0124Dec 31 at 6:04 AM\nAwesome experience\n\nThe experience is realistic!\nBut the graphics on the quest isnt that good\n\nHelpful | 0", "LozengeSausageDec 2 at 6:28 AM\nLove the game, hate the bugs\n\nIf you love the game in rift, sadly , you are going to hate it on the quest .\nEverytime I joined a lobby or played music from the jukebox, it froze and kicked me out.\nWhats the purpose of multiplayer if it crashes?\nI want to support the developers and I will NOT ask for a refund, but I will leave a low review until you fix these bugs.\nI have faith in you, dont lets us down.\n\nHelpful | 2", "jessej0Oct 17 at 5:15 PM\nSurprisingly my new favorite game\n\nSo ive been waiting for a 2d art application on here and this was almost bthe perfect one. I'll start with cons first. Multiplayer is very difficult. It's hard to find a specific person I want to join. I can't mute or block someone. I can't find how to kick someone when they join. Just in case they mess with the piece in working on. And the lobby is pretty jankey. I wish there was a smooth locomotion system. I hate teleporting when I'm just trying to get one last detail and then I over shoot. The drips were kinda wonkey. They didn't appear when I held the can and wanted drips but appeared when I'm sweeping quickly and don't want them. Changing stations on the boombox could use some help. Some buttons in the menu are kinda confusing. And I like the colors of the premade cans but I wish when I chose one I was able to tweak the colors very slightly just to get it exactly how I want it. Right now when I select a can the color wheel doesn't tell me where that color is so I can't find it exactly how I want bro change it. I know it seems like a lot of cons. But just relaxing and throwing up some paint is so amazing I have been using it for hours. I think it was well worth the 15 bucks\n\nHelpful | 4", "xamalotesNov 27 at 12:19 PM\nAwesome\n\nI am not experienced with graffiti at all and I was still able to create some awesome stuff. I love this game!\n\nHelpful | 0", "Farewell_MythOct 20 at 8:09 PM\nI just wanna know\n\nI have this on quest and Im pretty sure its on rift, I just want to know if rift players can join up with a specific quest players or vice versa. But this is a great app and as someone who used to tag before this is a great alternative although I still to actual art for people. This is great practice for people who want too learn basics or pros who want to brush up and practice before a legitimate project\n\nHelpful | 0", "MRFINGERSOct 31 at 3:07 PM\nGRAFFITI KINGS\n\nLove this game, would be nice to have your own gallery so you can view graffs you have done without scrolling endlessly to find one. Apart from that no major issues. Please add more levels soon, some famous locations would be cool. Also an option to colour the whole background wall with a click and maybe a colour scrool then set. Great work\n\nHelpful | 2", "EightWallJun 5 at 10:17 AM\nMore maps and caps\n\nThe game over looks great has lots of different colors. But I would like to see some more maps maybe like a freight train, a highway underpass, or a billboard. And I would definitely love to see some more caps like the cyclone or Astro fat. I think if you added cars passing by it would give the game a different feel I think a lot of people would like\n\nHelpful | 0", "mason.letotoOct 22 at 8:12 AM\nSo good..but\n\nThis game is so amazing, but I find it crashes on me, usually if I spray a decent amount of layers and get up close to the art to do finer detail. It freezes up and crashes and I lose my progress :/ it would be nice to have an auto save function in solo or something!\n\nHelpful | 2", "checkminerNov 10 at 1:13 PM\nGame is awesome.\n\nI've been interested in spray paint / graffiti for a while now. This was just the perfect opportunity, and it is really well made. Graphics are very good. I wish it included tutorials though.\n\nHelpful | 0", "aghkoDec 6 at 4:37 AM\nGreat, But Multiplayer!\n\nFor some reason I experience some problems when trying to play with more friends and get disconnected.\n\nOther than that, is quite close to actually painting in the street... but without cops.\n\nHelpful | 0", "T-nasty81Nov 14 at 2:12 PM\nLove it\n\nI have always been interested in grafitti art. I draw a little bit myself. After this game purchase my hobby and interest has been resparked. There are times I feel like I am playing Microsoft paint in VR. Without much exposure with real paint cans I cannot deny the authenticity of the spray can mechanics. But I question it and I am looking into buying a board and paint to see of my skills are true. Good game\n\nHelpful | 0", "thebluenoobOct 17 at 10:46 AM\nGreat\n\nOne of the best creative games I've ever played highly reccomend to people that love painting or doing graffiti\n\nHelpful | 6", "ParadiseDecayOct 18 at 8:42 AM\nJust as good as the Rift/PC Version!\n\nMy Initial Thoughts:\nA Superb and beautiful graffiti simulator that lets you unlock your inner Banksy! - And a fantastic port from the PC version of the game.\nA must for any budding artists.\n\nQuest Gameplay Video (Using a real wall!):\nhttps://www.youtube.com/watch?v=KwMHki4UtcI\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise decay VR Kingspray')\n\nOculus Rift S 1st Impressions Video with commentary:\nhttps://www.youtube.com/watch?v=Fc9AnuQGoHE\n\nHelpful | 2", "giantgeorge99Nov 13 at 12:57 PM\nGreat!\n\nThis game is great its very accurate and enjoyable and is also amazing for the price.I would definitely recommend this game to any one who has an interest in graffiti.\n\nHelpful | 0", "ArtsaberOct 18 at 6:02 PM\nArt, Freedom, & Graffiti Simulation\n\nPhenomenal. Works better than you can imagine. Instant gratification for artists. If you ever wanted to try graffiti art without the burden of breaking the law & going to jail, this is how you do it. Good looking environments and awesome music selections in the boom box will get you submerged in this game/simulation for hours. The price is right as well. I have only played Solo, and it is awesome. Infinite replay value as your only limits are your imagination.\n\nHelpful | 0", "ltf308Oct 19 at 1:47 PM\nLove it\n\nI couldnt wait to get this after seeing the videos, wow it was worth the wait. Now it is my top favorite over all my apps. Well worth the money and I hope they have future updates to make it even better ,although Im not sure they can improve on an all ready great app.\n\nHelpful | 2", "dougerzOct 24 at 8:48 AM\nNot sure if this is a game...\n\nNot much of a game, but VERY well done and fun to play around with. I have limited art skills but had a lot of fun trying to create a masterpiece. It would be fun if there were templates you could apply to the walk and trace to practice before freestyling\n\nHelpful | 0", "h1rleyMar 12 at 9:31 AM\nmikall\n\nawesome game neally as realistic as the real thing\n\nHelpful | 0", "MarziabunnyDec 8 at 12:49 AM\nBest game\n\nWell worth the purchase\n\nHelpful | 1", "hunter139Nov 30 at 8:06 PM\nLove the game\n\nVery fun game I recommend for people who are patient and like art/crafts\n\nHelpful | 0", "jerseyhurricane7Nov 11 at 6:46 PM\nThis App is a dream come true...\n\nI love this App. What Graffiti artist wouldn't want an unlimited amount of spray paint in any color you want not to mention all the wall space as well. Great App.\n\nHelpful | 0", "HAMYgamerOct 17 at 1:23 PM\nBad*ss but...\n\nThis game is absolutely addicting and Ive only just played it for 25 mins! The only problem Ive seen is if theres a spot I need to spray thats too high up (#5,10 gang) then it doesnt get as precise as I want it. Thats it, EPIC masterpeice.\n\nHelpful | 3", "cturn3rOct 21 at 7:03 PM\nMy new favorite game for the Quest\n\nIf you enjoy being creative/have any art experience in your past you have to download this game. Throw on some music and find yourself with an endless canvas to create. Its a blast. Couldnt recommend it more.\n\nHelpful | 5", "spanishrose2129Nov 18 at 6:22 PM\nAwesome game\n\nIt's an awesome game love the environments you get to choose from I know I've seen Oculus vive gameplay and they have an undo and a projector option this one does not this would make it so much easier and fun for people like me that like to undo a lot\n\nHelpful | 0", "BumperSolutionOct 17 at 3:10 PM\nBest submersive real experience so far\n\nThis is brilliant. The detail of the wall through the paint and the reflection in wet paint is astonishing. Completely realistic can feel - was 45 mins in to one wall before I even paused 10/10 \n\nHelpful | 7", "beyondbeliefOct 19 at 4:39 AM\nAddictive\n\nI have no art / painting / writing experience, and mostly bought the game for a friend. Of course I had to try it, and it is soooo much fun. I did not know that drawing using your whole body length is so gratifying. Now I have to recharge the headset... :-)\n\nHelpful | 1", "Evan_wowNov 6 at 9:33 PM\nAwesome!\n\nOut of all my VR experiences, playing this game has to be one of my favorites. The background of the setting is amazing, and I love how you can play music in the background. My only complaint is that you start a little too far back. My room is pretty small, so some of the levels were unreachable. This game is simple, realistic and fun! I think its definitely worth a try.\n\nHelpful | 0", "ProCasualOct 18 at 1:41 PM\nDoesn't work\n\nEdit: this is great and I'm a tool! Disregard the below you can teleport with A. Still not quite 5 stars because a few PC features are missing but I'm hoping to put a lot of time into this. Definitely worth it.\n\nGame looks amazing, but the only way to move up to the wall is by walking up to it. Can't move with joysticks or teleport. If you don't have a big room to play in you won't have enough space to approach the wall and won't be able to play this.\n\nHelpful | 18\nDeveloper ResponseOct 18 at 3:03 AM\n\nThat's no fun. You'd need a pretty large room to work without teleporting. Join up to the discord (https://discord.gg/Yc2B5av) or send an email via our contact page (http://infectiousape.com/contact/) and we'll track down the problem. Teleporting should work (works for everyone else). If you're in right-hand mode then the \"A\" button on the right controller should bring up the teleport laser... if you're in left-hand mode then the \"X\" button on the left controller is the one to use. Make sure the headset and controllers have the latest updates installed and fresh batteries and all that, just in case.", "MoneybagvrNov 5 at 10:27 AM\nIF Only I Can\n\nMan I love this game it's so relaxing it take me back to a time just me and art a most buy u can do so much just buy the game and find out This is what VR is all about\n\nHelpful | 0", "AGreatUsernameNov 22 at 4:30 PM\nIt good...\n\nThis is not suppose to be helpful, I just wanted to support the game so the game good\n\nHelpful | 0", "TheKrimlinOct 18 at 9:12 PM\nGreat game. Realistic.\n\nSpray control is great, only thing missing is that intoxicating smell. Some very minor graphics need attention like the drip, doesnt quite feel real but that very minor. Great game overall and I feel with a few update versions itll be perfect.\n\nHelpful | 1", "randomnoob1837Oct 23 at 4:22 PM\nbest game ever\n\ni had no idea how cool spraying graffiti was until now and this game displays it perfectly. it's just so good like a stress reliever or something. i've loved graffiti art style as long as i've seen it and this game is just awesome...\n\nHelpful | 0", "therealandyleeNov 26 at 9:59 AM\nI wish online was more populated\n\nNo one ever goes online which makes me sad, but the rest of it is like IRL, anyone can learn to legally and illegally spray paint all over walls with this spray painting simulator game!\n\nHelpful | 1", "PymseNov 5 at 1:56 PM\n\nI really enjoy the feel of the spraycan. The devs have made it very close to the real thing. The slight buzz the controler makes when you push down the nozzle shows the attention to detail.\nBut Im a bit dissapointed that there are no train scenes. Was a big selling point to me. Ive seen some screenshots of it but none in game. I dont know if its because Im on quest or not. It ould make my day if you could add a freight or train scene. Otherwise spot on!\n\nHelpful | 0\nDeveloper ResponseNov 6 at 3:09 AM\n\nSorry about the freight train. The screenshots you saw were probably from the PC version. The night time freight train looks awesome on the PC but didn't perform well on the quest (lots of dynamic lights and things that is a bit too much for the quest to handle). Join up to the discord if you can (https://discord.gg/Yc2B5av). There's a section in there for suggesting new levels and if there's enough demand you may see a freight train on the quest in a future update :)", "hankymanApr 4 at 3:37 PM\nSo near to perfection....\n\nExcellent app except for one major flaw.\n\nWhy does it make it ZERO difference when spraying straight on and at a much shallower angle? For example, straight on gives me a perfect circle, while virtually sideways to the surface STILL GIVES ME A PERFECT CIRCLE......\n\nAlso, could we have the ability to create and save stencils so the we can release our inner Banksy?\n\nHelpful | 13\nDeveloper ResponseOct 21 at 4:00 AM\n\nThe short answer to the first question is performance. We have a technique for making the paint \"shape\" more realistic but the performance on the quest takes a hit. When we get the performance to a more acceptable level we'll integrate that into the quest and pc builds. We also have a technique for the stencils but we want to sort out how that'll work over multiplayer before we put that in. It'll all just take some time. There's a channel on the discord for suggesting features as well: https://discord.gg/Yc2B5av . Join up and log any other suggestions you have there. We try to focus on the most frequently suggested suggestions first.", "computeryOct 17 at 6:57 PM\nLove it\n\nIs the best art game on the quest, although a undo button could be nice. Oh and on the sub-way map is good but the thumbnail of the map looks like me can go in the train. Thank you for this great game.\n\nHelpful | 6", "Gamer-KinOct 18 at 10:33 AM\nGreat game quality\n\nIve been watching videos of it.\nSo my parents surprised me with an Oculus Quest!\nAnd a few days ago I got a notification about the game being available on the Quest and I got the game right there and then.\nMost definitely for people any age.\n\nHelpful | 1", "itschriscollinsOct 19 at 3:46 AM\nGreat but missing QoL\n\nSo, first off a tip: press Y to see all the controls, and you can pick up objects like ladders in some levels and stand on them to reach higher.\n\nNow, four stars because it's a good game but. Cans feel great, paint system is good, very satisfying. Lots of caps and clever menu choices. But there's a lot of quality of life missing and the developer communication is really lacking on the PC version and this release.\n\nNot all levels have something you can climb. One has a ladder but one has nothing, so if you're under 6\" or can only sit down then you're going to be limited in what you can spray. Some levels have objects like crates that you can pick up but you can't stand on them - why the hell not? There's no indication on the controls or guidance at all which could've been easily fixed by just saying \"Press Y to see the controls\". The developers put in a cool control map and then never tell people how to use it. There's no undo - now this is very realistic but I didn't buy a virtual reality headset and a game to be super realistic, I expect some convenience. The developer has said it isn't possible because of how they handle textures, unlike say Tilt Brush, but there's a PCVR app ViveSpray2 that does spray painting and undo just fine.\n\nThis is a finished app. It works great. I'll recommend it. But beware it's missing QoL features and the developer communication is bad. Period. Hopefully once the dust settles I can update this review.\n\nHelpful | 8", "JanOQNov 5 at 12:22 AM\nFantastic\n\ngraffiti and vr matches perfectly!\nthe lack of an undo-button just adds realism and lets you get creative with your mistakes...\nthe music is great. its flawless!\n\nHelpful | 0", "CatsHOct 17 at 9:33 PM\nAMAZING GAME!\n\nI feel so cool just doing graffiti and stuff, also multiplayer is pretty fun because I can usually take inspiration from them as well! Ive been so many friends and its only been a couple of hours! This game is a must buy for any Quest user.\n\nHelpful | 1", "SiFiGuy619Nov 22 at 4:02 AM\nGreat art game\n\nThis game let's you discover a (mostly) illegal art form, legally! Worth 15$\n\nHelpful | 0", "GhoulDoomNov 16 at 9:15 AM\nVery fun for all ages worth it by a mile\n\nVery fun for all ages, and I love the old music on the boom box very old fashion and I love it myself\n\nHelpful | 0", "Holy4DNov 2 at 12:30 PM\nExcellent, minor improvements welcomed\n\nI love art, I love graffiti, the simulator is great fun. The online presence makes it super fun to work with others & show off your work. Minor enhancements could greatly improve this title. What about importing pictures to work off of? What about exporting your artwork so you can print them out? A better way to show your demonstrate your art online , be able to categorize? What about contests? Maybe the lobby could hold events where you can get together with other artists who specialize in certain styles. What about being able to organize classes, where one can schedule a day and time to present to others? The lobby could demonstrate some of the top voted works. Its endless, devs reach out to me for more ideas!\n\nHelpful | 0", "cboynj1184Apr 14 at 7:36 AM\nCboy\n\nPerfect game its like ur really taggin I catch myself lookin around sometimes make sure I dont get caught haha dope game\n\nHelpful | 0", "peoples174Nov 23 at 6:44 PM\nTruth is...\n\nIt doesnt get any better than this. Thank you guys for this\n\nHelpful | 0", "Redrex73Oct 23 at 3:16 AM\nBetter than Bear Saber?\n\nThis is fantastic. Best VR game yet that has come out of nowhere to challenge Beat Saber as the best game in VR. Love it, spent hours playing it and the spray physics are amazing. The music streaming is awesome also.\n\nHelpful | 0", "shiftychrisOct 29 at 7:38 AM\nAwesome Experience\n\nAs an ex writer from the 90s, I can tell you, this game is worth every penny and every minute. I love every aspect of this game. The Soundtrack, the physics and the vibe. 10 stars plus!\n\nHelpful | 0", "JohSm67Oct 19 at 12:04 AM\nWow\n\nGet it now!\nThis is cool, feeling and control is perfect!\nCould be even cooler with a big openworld/map whith more users at the same time! (Where paintings would be merced in to walls/objects after a day)\nMaybe a new mode/addition to a future release :-)\n\nHelpful | 0", "BesoBerlinNov 7 at 1:45 AM\nExpected a little more!\n\nfirst of all: this app is good. But regarding Google Tilt brush it is not really worth the price.\n\nTo get 5 stars you should:\n\n1. Implement a feature which counts the number of used cans in relation to the time and pressure one can was used.\n2. The whole spraying behavior should be a bit more realistic! The colour isn't nearly dripping realistic, when the can is used close to the wall, as well as the opacity when used from far away.\n3. It should be possible to spray on objects and the floor as well!\n\n\nI really hope you'll update at least one of these points.\n\nBest regards from Berlin\n\nHelpful | 8\nDeveloper ResponseNov 6 at 2:59 AM\n\nThanks for the feedback. Regarding point 1, we've been thinking about implementing an \"Advanced\" mode for the people that want a much more true to life experience where the cans lose pressure and need to be shaken to keep the spray smooth and eventually run out and you have a limited supply of paint or things to that effect. So perhaps you'd choose one milk crate full of cans before you start a piece and lock in colours and all that and then that's all you have to work with (having a \"used can\" counter or maybe even a \"litres of paint\" counter could work as well). It's good to know that there are people who want that more realistic experience (who want more of a graffiti simulation than a regular paint program). But there are also a lot of people who are trying to learn and want to be able to hone their style without having to deal with the hassles of using real paint. That is why we'd probably lean towards having an \"advanced mode\"; so people can choose a simpler or more advanced experience as they want. For point 2, I totally agree about the drips. Originally the drips were much more realistic (the paint was much more drippy when up close) but beta testers preferred having it less drippy so we scaled it back. Perhaps we can put in a slider for drippiness so people can get the feel that they prefer. I'll play around with that when we do our first feature update. It's nice to know that someone else likes the drips, too :) For point 3, performance is a limiting factor on the quest for many of the features that we'd like to implement (we had to scale things back quite a bit compared to the PC version). We have a prototype that does exactly what you are asking for that we may be sneaking in to the PC build on the next update. If that goes well I'll see if we can get at least one level working like that on the quest (you're not the first person to ask about that)... but again, it all comes down to performance. If we can't get the performance right on the quest, it doesn't make it in. If you're able to, join up to the discord (https://discord.gg/Yc2B5av). It'd be nice to get some more conversation happening about some of these things.", "russell.careyOct 23 at 12:43 AM\nAmazing\n\nThe best game I own on oculus quest.\nIf you like art or drawing or anything like that, but this game.\n\nThe paint is so accurate, there's people to multilayer and paint with which is super fun.\n\nIT'S AMAZINNNGGGGGG\n\nHelpful | 0", "D2THEK85Nov 1 at 2:52 PM\nVery pleased!\n\nthis has been mentioned before but in location, i would like to see more surfaces to paint on. at some locations, there is only one wall that you can paint on and this does not work well when there are multiple people in the room. Ultimately, i would like to see a more open world experience, where you can paint on any surfaces.\n\nlove the game overall!!\n\nHelpful | 0", "jtaniwhaOct 17 at 11:24 AM\nTaught me a lot!\n\nThis is a good way to train muscle memory and as authentic as it can get virtually! A++\n\nHelpful | 4", "GxM42Oct 28 at 11:07 PM\nReally Fun!\n\nIll take the word of the more experienced graffiti artists that have commented here on the authenticity of Kingspray. As someone who has never tried spray painting a subway train, it feels super realistic to me, or at least as realistic as I imagined it would. You can shake the can and hear the clackety crack of whatever goes inside it, the can vibrates as you spray it, and the sound of the paint spraying is very authentic. The metallic paints all reflect light. The wet paints look... wet. The textures of the brick walls and the windows come through the paint just right. The environments are well detailed and fun to look at. Birds fly around, water shimmies, neon lights flicker around you. The game is truly immersive. But what does it do best? Its just plain fun! I was tagging every wall I could within minutes of starting the app. Its a joy to use and Im really glad I took a chance on it!\n\nHelpful | 1", "john.bruin.9Oct 21 at 11:05 AM\nI feel like 16 again...\n\nWow this is the best! I have always wanted to be a graffiti artist but I was too chicken. Now after more than 20 years I can live that dream to the max! Very realistic and very nice people online!\n\nHelpful | 2", "R7DOct 20 at 11:05 AM\nThe Perfect Game\n\nThis game is overall perfect, no bugs, no issues, and no problems while playing. Im not artistic but this game makes me feel like a modern day Picasso. Its worth the price of admission. Trust me.\n\nHelpful | 2", "Stumpydumpy07Oct 21 at 8:50 AM\nYee\n\nGame is very entertaining and I can spend hours upon hours on this game just for the fun of it. You can spend hours on this game by drawing whatever you want. As long as it is not bigger than your \"canvas\"\n\nHelpful | 1", "AntimatterNovaOct 25 at 3:48 PM\nGreat game!\n\nI am not a good artist but still enjoyed the game. The controls are simple and the game is fun. Just pick your canvas weather it be a brick wall or the side of a subway train and start painting.\n\nHelpful | 0", "TravisbeddoesDec 21 at 1:52 PM\nAmazing but in need of one feature\n\nIts amazing but needs an eraser option\n\nHelpful | 0", "thobodOct 30 at 3:54 AM\nLots of fun, yet misses some features\n\nthe spraying itself is awesome, insanely realistic (from a novices perspective), and it is relatively easy to pick up even for a non creative person like myself.\nhowever there are some oversights, like only being able to to load a saved work from the level you are in at that moment, meaning if you dont remember which artwork you did in which level, you have to load every level and search for it multiple times. @Devs, please make an overview in the main menu where i can see all the artworks i made\nwhen starting multiplayer you will be put in a room with random other people at just the push of one button, and the multiplayer tutorial starts after your already in that room, that just weird design, @devs load the room with tutorial single player please, and have the user explicitly confirm they want to go online.\nalso a feature i really missed was exporting works to your phone, the only way i found was taking a screenshot trough the oculus menu.\na feature that could be added is an undo button, but i understand that might take away from an original \"graffiti experience\", it is insanely frustrating though if you just painted something to want to click something in the color menu or phone, miss by an inch an have an enormous spray right over your artwork, so if you dont implement a undo button, please change the select button to another button than the spray button.\nanother feature which would be nice is to duplicate colors in the color menu, and be able to tweak colors, EG select a certain red, duplicate it and darken it a bit, so you can use it as a shadowcolor.\njust a brightness slider on the colors would already help a bunch, also being able to put in hexidecimal colors would be perfect.\nanother thing: the galary is just a mess, there is no way of sorting, searching, or catagorisation, it is unclear how to get you work there, or what \"share your work online means\" first time clicking it i though it might just have put it up on my facebook or something (it doesnt but is is just insanely unclear).\noh and auto save should be in the game , the game crashed on me once and i lost 2 hours of progress, and now i am saving my game every 10 minutes (what year is it?1995?)\n\nthough this review has been mostly negative, these are all minor complaints, the game is amazing! i just hope it will be perfect some day, would highly recommend!\n\nHelpful | 0", "vrsumoOct 18 at 12:09 PM\nPhenomenal\n\nA total MUST for writers, a MUST for creatives, an INSPIRATION for kids and just a very compelling piece of Software that will hopefully grow into AR...\n\nHelpful | 2", "jimboeyOct 21 at 1:59 AM\nWooow!!\n\nI have never written a review but I'm going out of my way to write one for this game. Everything is on point I cannot fault it, the drips, the paint shines, the maps and the online it's insane!! 100% get this!!\n\nHelpful | 1", "Chris_StaceyOct 22 at 2:47 PM\nGreat realistic street art!\n\nOnly been playing with this for an hour and really liking the realism and flexibility of this art game! I can easily imagine spending hours playing. There are a few things I'd like to see though:\n1. Ability to import a reference image,\n2. Better height adjustment (I can crouch, so why no step ladder?),\n3. Ok, it's not realistic (but neither is turning drips off) - an undo function!\nOther than that, for the price, this is excellent! Highly recommended.\n\nHelpful | 3", "DeyboOct 22 at 8:45 PM\nThis is the Art App I was looking for!\n\nIm a street photographer... meaning I see a lot of graffiti around the streets. Ive met countless taggers. Ive always wanted to understand and get the culture! I now can! Thank you guys.\n\nHelpful | 0", "shadowtech0520Nov 20 at 11:55 AM\nUndo button\n\nLove it but.... please add a undo button. I know in real life there wasnt one but it would be so much more helpful if there was one in the VR world lol.\n\nHelpful | 3", "gentch707Nov 2 at 8:36 AM\nOne of the best art tools out there\n\nKingspray is great to practice or try out your graffiti skills. However\n\nPros Cons\nReally well made Lags sometimes\nNice music Takes a while to load rooms\nSingle+multiplayer .\n\nHelpful | 0", "KreismanismNov 10 at 11:43 AM\nBest vr game\n\nHonestly the best... could use some different venues and music but other than that its beautiful\n\nHelpful | 0", "zabergauOct 18 at 8:46 AM\nEasily my favorite quest app now\n\nOmg, painted all night, live-streamed for fb friends and family - they loved it. Hands down my favorite VR experience right now - if you like to paint - get this and thank me later\n\nHelpful | 3", "LtAldoOct 21 at 5:13 PM\nWow\n\nJust wow. The level of realism is unmatched. Worth the $15 without a doubt, especially if you have any artistic ability at all. One of the best apps in the store for sure. Awesome job!\n\nHelpful | 1", "rogairOct 22 at 10:34 AM\n\nThis title has been one of my favourite apps on my Oculus Rift, so I was disapointed this wasnt a crossbuy. The quest version is less realistic looking than on the rift, which is to be expected. But what I miss the most from the rift version is the boombox with its 3D spatial sound, and the variation in radiostations with real music. That really make me feel like I am on that rooftop. I hope for an updated version with spatial sound.\n\nHelpful | 2", "carli.susuOct 20 at 12:11 PM\nLove, love, LOVE!\n\nI'm a Tilt Brush fanatic, so was excited to try out 2d VR art. I have experienced Kingspray on PC, so waited with baited breath for the version for my Quest.\nLOVE THIS!....but....\nMissing a few bits on the Quest version.\n1. The ability to climb up different levels. I remember this from PC, but seems to be missing here. And some buttons/handles look like they might activate something, but dont seem to do anything.\n2. The ability to import sketches as templates.\n3. How to communicate in multiplayer mode? Everyone seems to be talking, but I can't seem to join in. Am I missing something?\n4. How to customise my avatar for 'selfies'/ multiplayer. We all look alike. This would be a nice touch.\n5. How to export my pics so that I can share on FB, Insta, etc.\n6. A tutorial, which might ecplain the above things. I may be missing something.\nAside from this, I've already spent quite a few hours lost in a subway station, turning the train psychedelic. Could become addictive! LOVE the music, too. Very relaxing, and immersive, without getting high on paint fumes!\n\nHelpful | 3", "ludusvrOct 22 at 12:07 PM\nAmazing Just Amazing!\n\nImagine spray painting freely without having to travel to different places. You can colour in different ways. Metallic. This is amazing!\n\n5/5\nEveryone should buy!\nWorth the money\n\n\nHelpful | 0", "igorkuvNov 8 at 8:31 AM\nNext update ideas\n\nI love this graffiti app. But i want developers add time limit mode. As a gamer i want a mode, wich i can be connected with random players, and bomb a 4 caridge train for 10 min. In the end running towards the exit from the police.\n\nHelpful | 1", "ianxgamer05Nov 26 at 1:26 PM\nIts good\n\nNever really spray painted before but I really love to draw a lot and its hard to find a good drawing game or painting and just like spraying around and just adding to it and it turns really good hope this review helps thanks for reading\n\nHelpful | 0", "premode0Oct 24 at 9:42 PM\nBecoming A Street Artist\n\nThis Game Is Amazing, Plus It Wont Get You In Trouble haha I Recommend It If Your Look For Some Time To Spend And If You Love Any Type Of Paint, Draw, or Even Spray. A++\n\nHelpful | 0", "TheRPGG123Nov 2 at 10:51 AM\n\nNot exactly like real life but infinite spraying buys that back. Good to try out how the graffiti are going to look like. 10/10\n\nHelpful | 0", "Dat_Vegan_LosNov 8 at 5:08 PM\n\nBest game Ive bought so worth it if your a creative you gon love it super addictive\n\nHelpful | 1", "Ballzack2020Nov 13 at 9:17 AM\nTruly Great!!\n\nEverything about this game is perfect. Fun for anyone into street art.\n\nHelpful | 0", "IndigoogoNov 4 at 3:56 PM\nAmAzing Awesome\n\nI love drawing on stuff this is perfect, great spray graphics and mechanics. I really enjoy it and I just started.\n\nHelpful | 0", "jkoufilesNov 9 at 8:11 PM\nalmost perfect\n\nim not a spray paint artist but still it's fun. the only thing weird is the mist fx doesnt match real time surface i pray on. i see mist expecting it to stick to the wall but the spray and mist are seperate fx at times.\n\nHelpful | 0", "OhHeccOct 24 at 11:25 AM\nFrom the newbie perspective\n\nHello! So far the game plays nicely, Ive had a few tracking issues but thats just my oculus. Im new to graffiti and for some reason my game hasnt given me any tutorial but I thought Id seen a tutorial somewhere. If its a possibility, maybe devs could add a sort of graffiti class? Showing how to block out, how to fill or make super sharp lines and all. Really fun though. Thanks!\n\nHelpful | 0", "JemmyVonJudeOct 28 at 5:10 AM\nFantastic game for the casual artist\n\n100% fiddle with unlimited various spraycan on a textured wall that you can insta clean and doodle on again and again and again, never tried graffitis irl, but I enjoyed it a lot in VR, minus the paint smell. Felt great getting to try a whole range of angles, nozzles, light pressures on the triggers as much as I'd like without payin for a truckload of paint haha. Definitely recommended\nOnly missing things that would make it perfect ? thumbstick locomotion and the ability to display a reference picture on your ingame phone\n\nHelpful | 3", "ChristianyoboiOct 27 at 4:08 PM\nGreat\n\nI spent a 3 hour sesh on a really great piece and through out making it i took pictures using the camera in the game. At the end i took a final picture and left the lobby came back to show a friend and there was no saved work to be shown. Idk what happened but im really sad about it\n\nHelpful | 0", "stachowiOct 25 at 8:26 AM\nI wish I could be artistic!\n\nThis is exactly what you think it would be... unlimited spray paint and no cops.\n\nThis is an example of what VR experiences are possible out there, well done.\n\nHelpful | 0", "snipeasy69Oct 25 at 10:20 PM\nAMAZING\n\nThis game is amazing! Feels pretty realistic and reminds me of my old days of hitting up walls. Dont hesitate to try this out, you wont regret it.\n\nHelpful | 0", "Luke90123Nov 22 at 1:31 PM\n\nI really enjoy this app, I cant wait for my friends to get vr so we can create together. Pretty relaxing too. 4 Stars only because it isnt cross buy.\n\nHelpful | 1", "singmikeMay 21 at 3:18 AM\nKingspray\n\nWhat amazing games love it only wish you could upload a picture like you can do in tilt brush and scupture vr\n\nHelpful | 0", "Mini_VannNov 6 at 1:35 PM\nOne of the Best games\n\nIts great cause it doesnt just die out once youve tried everything because its art\n\nHelpful | 0", "MtnDew.WoohooOct 20 at 3:23 PM\n\nI dont draw or paint, but this game is a blast. I wont even know where to start and then end up spending hours trying to perfect my newbie artwork lol\n\nHelpful | 2", "teziOct 19 at 12:57 AM\nBeautiful\n\nLove using spay cans, love the colours and the caps you can choose from, but I can't draw, please could we have some stencils included in the game\n\nHelpful | 3", "The_Guini_PiperOct 20 at 9:52 AM\nGreat graffiti game\n\nI have this on PC as well. I'm horrible at spray painting. Wish they would bring a way to bring an image to trace over like in pc with the projector.\n\nHelpful | 2", "andrew_vrOct 18 at 3:27 AM\nGreat looking experience\n\nThe environments look gorgeous and the paint sprays onto the walls in a very satisfactory manner. The only gripe I have is that having seen the PC version I was hoping for a tutorial and the ability to use your own reference images/stencils in-game (the projector). But if you know what you're doing (or like learning by trial and error) and have artistic talent or want to develop it then this is another no-brainer purchase at 11.\n\nHelpful | 1", "unknown3Nov 8 at 2:41 PM\n\nIt is perfect if you are a graffiti artist only can control is bit hard\n\nHelpful | 1", "ZanyZarlyOct 24 at 9:29 AM\nLimited but fun spray painting sim\n\nI'm not an artist and I've never doodled any graffiti on anything other than a notebook. This is a well presented painting application that is missing some highly desired bells and whistles.\n\nI've never come across a drawing or painting app that is missing an undo feature, until now. Some might argue that this makes the experience more realistic but it's incredibly frustrating when one little slip up can ruin a potential masterpiece.\n\nIt's also lacking smooth locomotion and the ability to play your own music.\n\nIt's all about as exciting as it sounds. You have a wall, train or van and a multitude of spray cans to do whatever you want. Given that it has extremely limited appeal unless spray paint art is your \"thing\". It's certainly no tiltbrush but it's still a fun visit for a few minutes.\n\nHelpful | 7", "Cpt_CustardOct 17 at 1:31 PM\nAwesome\n\nI dont generaly write reviews but this is a great app with unlimited replay value. Really simple idea done really well. 2 gripes so far, controls dont feel very intuative and paint drips dont seem to work as well as on the PC version. But yea the paint looks and works great!\n\nHelpful | 3", "WhiteBoiJared76Oct 31 at 3:26 PM\nIts really good\n\nIt is better than tilt brush in my opinion. The multiplayer makes it great. Very peaceful as well.\n\nHelpful | 1", "Hitmark3r24Oct 17 at 4:07 PM\nAmazing game!\n\nI've never done any graffiti in real life so I have been looking forward to this game for a while. I've only had this game for a little while and I'm in love!\n\nHelpful | 1", "sickfitOct 17 at 5:56 PM\nAwesome Game\n\nBest art game on the Quest by far - add an undo button and Spotify functionality and I will never play anything else!\n\nHelpful | 5", "brennanhattonOct 19 at 5:20 PM\nGreat game for learning a new skill\n\nIts a safe space to practice as someone who doesn't spray irl. My experience with the community in online play has been confidence building. Love it.\n\nHelpful | 1", "KingFukiNov 2 at 7:50 AM\nIt has potential\n\nMissing key features.Unfortunately there is no option to export your work as .png pbr maps .Edit.11/2/2019:changed my initial 2 stars review to 4 stars after developer made possible to export/convert your work to .png files.\n\nHelpful | 5\nDeveloper ResponseNov 2 at 1:18 AM\n\nUPDATE: The converter I mentioned previously is now available on our website here: http://infectiousape.com/ape-image-converter/ We changed the format of the save files for performance reasons. The same data that is exported on the PC version is still being saved, but as .ape files. Several people have asked for the same data you're looking for so we're writing up a stand alone converter to get the data back into .png format. If you would rather have the data in a different format, let us know. If you can, join up to the discord: https://discord.gg/Yc2B5av . That's where the conversation is happening. I'll update this response when the converter is ready if I don't hear from you on the discord (I'm \"mr_growl\" on the discord... send me a PM if you join up).", "DiamondDutyOct 25 at 12:53 PM\nAmazing game!\n\nI just wish you could tag more than the specified wall. They give you all this space to walk around, but that part is just for show since you cant spray anything other Han the main wall area.\n\nStill amazing though, and the game looks beautiful.\n\nHelpful | 1", "zacknuggetNov 6 at 6:13 PM\nthis is the game to get.\n\ni played half an hour and wish i had this game sooner!\n\nHelpful | 1", "AffluentPizzaNov 16 at 2:06 PM\nGood\n\nYee\n\nHelpful | 1", "i82l8Oct 21 at 5:18 PM\nA painters dream come true\n\nwhat more could you want than unlimited paint and unlimited walls? this game is all i wanted and more.\n\nHelpful | 3", "DrukulusOct 24 at 7:26 PM\nGreat relaxing time killer\n\nJust buy this game it's fantastic I love to doodle and this is a lot of fun plus you dont have to smell spray paint.\n\nHelpful | 1", "duckbill_Nov 14 at 6:18 AM\nyes!!!!\n\nyes!!!!!!!\n\nHelpful | 1", "CrustmonkeyOct 18 at 4:20 PM\nWOW\n\nA total immersive experience. Forgot I was in VR, a must buy for anybody who likes painting,drawing,colors and of course graffiti\n\nHelpful | 1", "stone_rock_goldOct 24 at 3:56 AM\nNoice\n\nIt's a really good game but there is no undo except for cleaning the entire wall but it's great besides that\n\nHelpful | 1", "TRULYALIYAHOct 18 at 6:10 PM\nIs there a height setting?\n\nI love the game but I am short and I think if there is isnt a height setting I think there should be one\n\nHelpful | 3", "jan.welnickiOct 24 at 3:18 AM\nBest ever\n\nBest ever simulator, u will get everything except police and painted clothes what is like a dream come true\n\nHelpful | 1", "marcus.waltonNov 6 at 12:14 AM\nWow\n\nIncredible. Intuitive. Amazing. Perfect.\n\nHelpful | 1", "h.r.gargiOct 18 at 11:23 PM\nAwesome!\n\nThis game (is it a game?) is so immersive you are lost in it after a few minutes. Worth every Cent!\n\nHelpful | 3", "tully.travellerOct 21 at 10:58 AM\nThe smell of paint is missing... but...\n\nFrom the moment you set foot on the rooftop (or underpass, or subway station) you can feel that this is a special title. The graphics and lighting are great with many small details in over six different environments. The sound of the spray can when you shake it and the vast array of colours and metallics available leaves a wonderfully open palette for creativity. Spraying too long on one spot can cause the paint to drip, further deepening the experience and really making you feel as though you're actually spraying. Selecting some music to play on your \"Boombox\" made two hours of 'gaming' slip away and I only left Kingspray then because the battery expired.\nSo why only 3 stars for such a brilliant execution of grafitti spraying in VR? In real life, once you've sprayed, there's no 'undo'. Unfortunately, they've also omitted an 'undo' feature in VR. And while there is a good assortment of locations, you can only paint on certain surfaces within these environments. The ability to mask or stencil is also lacking and I found it difficult to \"share\" my work to show it off to non-VR users. Being able to play your own music would also be a nice feature. The \"replay system\", \"director system\" and projector feature mentioned on the website are noticably missing from the Quest version.\nThis, I believe, is a must-have application for Quest owners, even if you're not artistically inclined. It's just too bad there are these noticable omissions in the features of this otherwise brilliant execution of VR grafitti.\n\nHelpful | 7", "Theo.GravityOct 26 at 8:47 PM\nAmaizong\n\nMore levolzoz please, and big plain canvas pleazoz, more objectoz to standz on pl3as3\n\nHelpful | 1", "littlehornsOct 17 at 6:30 PM\nBest oculus app. Period.\n\nNuff said.\n\nHelpful | 3", "Alex-LOct 17 at 11:27 AM\nOne of the two reasons i buy a quest.\n\nOne of the two reasons i buy a quest. The other being Racket Fury, keep-up the good work.\n\nHelpful | 4", "Rocko_da_tacoOct 17 at 8:00 PM\nBruh...\n\nLegendary\n\nHelpful | 3", "deep_fried_chickenFeb 11 at 2:28 PM\nCant download\n\nI cant download the game\n\nHelpful | 1", "WillsQOct 26 at 7:55 AM\nAwesome!\n\nPut on a bit of music and its a great way to relax. Nice level of realism too.\n\nHelpful | 1", "Kaliber_1Oct 27 at 4:37 PM\nBest art app\n\nJust wow! Feels real, look great. Better then I ever thought it would.\n\nHelpful | 1", "XletalisNov 9 at 12:30 PM\nPERFECT EVERYTHING\n\nWOW\n\nHelpful | 1", "patrick.wellborn1Oct 17 at 6:26 PM\n\nIt's been a while, but this feels very realistic! Awesome job, developers! Only wish it also had stock caps!\n\nHelpful | 1", "dueceball1027Oct 17 at 11:17 AM\nYup\n\nThis is everything youd want it to be. On the quest it looks amazing. I love this!!\n\nHelpful | 3", "BadBadgerzOct 26 at 5:28 PM\nI love this game\n\nI am so happy this got ported to quest. Thanks to the kingspray team.\n\nHelpful | 1", "tommypantanoOct 20 at 6:51 PM\n\nBest game for the oculus. Super realistic. Once I got into it I was spraying for hours .\n\nHelpful | 1", "samuel.cross.121Oct 21 at 3:23 PM\nSoooooo gooooooddddd!\n\nThe best game its so realistic and am loving the creativity !!!!!!\n\nHelpful | 2", "8sidedOct 25 at 8:48 PM\nThis game is well worth the price.\n\nReally well done. More accurate than I expected. Super fun and chill.\n\nHelpful | 1", "Pieface45Oct 19 at 9:44 AM\nNo doubt best game ever\n\nSo clean and after 30 muinites I was joining multiplayerwatching others make crazy tags\n\nHelpful | 1", "trippycikOct 18 at 2:54 AM\n\nLove this game so much fun\n\nHelpful | 2", "Sneeaky_BoiOct 19 at 1:55 AM\n;)\n\nHippity hoppity this game should be your property\n\nHelpful | 4", "SirDominikOct 19 at 11:58 AM\nBest game on quest\n\nGreat Game!!\n\nHelpful | 2", "Ninjafrog15Oct 24 at 5:44 PM\nGood Game\n\nI really suck at spray paint but this game is just really fun!\n\nHelpful | 1", "JayPea02Oct 24 at 12:47 PM\nSo much fun\n\nI dont know how to draw but its so much fun just trying\n\nHelpful | 1", "wookrottOct 18 at 3:07 AM\nawsome\n\nsimply awsome\n\nHelpful | 2", "KiraplaysOculusNov 1 at 2:40 PM\nAMAZIIING\n\nTHANK YOU FOR THIS\n\nHelpful | 1", "McGlOcKeDOct 19 at 3:21 AM\nBest game ever\n\nThe best game ever if u like Graf and painting. So realistic. 10 stars!\n\nHelpful | 1", "Palosh23Oct 26 at 11:31 PM\nBest game ever\n\nAbsolutely amazing game,must have titul.\n\nHelpful | 1", "Skyrimgamer655Oct 17 at 7:19 PM\nLove it\n\nI love it much\n\nHelpful | 2", "oliverpickleDec 3 at 5:30 AM\nI LOVE THIS GAME\n\nThis is the best game ever having the freedom of spray painting is great\n\nHelpful | 1", "Crackman45Oct 19 at 12:05 AM\nI DO GRAFFITI\n\nI love this. This is why I bought the quest in the first place. Thank you.\n\nHelpful | 1", "steven.goggin.1Oct 22 at 11:29 AM\n\nI just bought this game and I am mostly impressed with it. How do I get to share what I paint other than on the gallery what are the steps to do this how do I get onto the Oculus Quest Cloud?\n\nHelpful | 1", "vShadow7Oct 19 at 11:35 AM\nYes\n\nYes\n\nHelpful | 2", "AndyLokerOct 26 at 2:33 AM\nLove this game!\n\nI just love this game.... Done...\n\nHelpful | 1", "that_dead_island_dudOct 29 at 7:17 PM\nIts good\n\nIts good\n\nHelpful | 1", "martin.wood.5036Oct 17 at 3:40 PM\nDammed impressive\n\nGotta admit this is quality well worth it for the quest\n\nHelpful | 2", "xRyan2008Oct 18 at 4:17 AM\nAwesome\n\nThis is probably what Ill being playing for along time\n\nHelpful | 1", "gouldingNov 2 at 9:26 PM\n\nWhere do the saved photos go? This is super unclear and frustrating. Otherwise a super fun experience!\n\nHelpful | 3\nDeveloper ResponseNov 4 at 2:25 AM\n\nRight now the phone just saves the actual paint data and a thumbnail so that you can load up the paint again and keep working on it. BUT, we're going to put out an update that'll get it to actually give you a hi-res version of the thumbnail (a bit of an oversight on our part). We're collecting bug reports to do a bug fix update so hang on to your saves and once it's updated you should be able to re-take those shots and get a nice output image. In the mean time, if you press the oculus button on your controller while in game you can use the \"Sharing\" feature in the oculus home to take an in game screenshot. Not the greatest images, but works in a pinch.", "frogger14853Oct 19 at 12:42 PM\n\nVery fun dont have to be good at art to have a good time\n\nHelpful | 1", "DontDropTheJuiceOct 19 at 11:12 PM\nWow\n\nPretty cool game. Needs more music\n\nHelpful | 2", "MrFrankFontaineOct 27 at 7:09 AM\nAwesome!!\n\nExcellent port.\n\nHelpful | 1", "brendan1227Oct 22 at 10:02 PM\nAmazing\n\nAmazing quest port to an amazing VR app.\n\nHelpful | 1", "The_LionOct 19 at 10:14 PM\nMust Have\n\nMy favorite way to chill in VR\n\nHelpful | 2", "juan202Nov 26 at 1:03 PM\nThe game is pleasing but...\n\nMany times it fails to save, to be precise even with the cursor and even crashes out of nowhere.\n\nHelpful | 1", "daddymx5Oct 18 at 10:28 AM\nGreat if you like art\n\nHad a great experience although it kind of dumps you in and only has smooth locomotion. Sat in a lobby and drew dicks with 2-3 13 year olds and had a fun time just messing around\n\nHelpful | 1", "harlekingzOct 20 at 4:02 PM\nAmazing\n\nSuch a amazing experience. Love it!\n\nHelpful | 1", "N1ghtmar333Oct 17 at 10:56 AM\nFun\n\nIf you like art you will like this game!\n\nHelpful | 4", "forksiOct 27 at 2:12 PM\nGreat app\n\nAmazing\n\nHelpful | 1", "mafikesOct 17 at 4:09 PM\nNot bad\n\nNot bad\n\nHelpful | 5", "xcom93Oct 19 at 1:09 PM\nIts good ................LIKE bad thoug\n\nIt bad jk it good or is it JUST BUY IT\n\nHelpful | 1", "nutterbutterboiOct 23 at 11:39 AM\nI love it\n\nI love all of it\n\nHelpful | 1", "EcCETNIkOct 24 at 6:54 PM\nIts good\n\nIts good\n\nHelpful | 1", "PashotoOct 23 at 2:01 PM\nKingspray Graffiti\n\nIs worth buying.\n\nHelpful | 1", "ADDVROct 19 at 12:53 AM\nBetter than expected!\n\nI love playing with the metallics!\n\nHelpful | 1", "PureifydeOct 22 at 9:20 AM\nKingspray\n\nThis app is amazing\n\nHelpful | 1", "richblackhatOct 30 at 12:37 PM\nGood but it can be improoved\n\nI love the game but I wish I would be more competitive and with options to share your work across the web\n\nHelpful | 1", "ccrider05Oct 22 at 8:56 AM\nAmazing\n\nJust amazing\n\nHelpful | 1", "eyeohdiceOct 18 at 1:55 AM\nFun and creative\n\nLove the realism when you get lost in throes artistic flow, please add head turning with joystick in conjuction with teleport, or simply add locomotion.\n\nHelpful | 1", "IringoOct 29 at 3:23 PM\n\nVery nice experience. I just miss support tools for absolut beginners like myself. A sketchbook for example would be helpful.\n\nHelpful | 1", "Monk-EOct 20 at 6:07 AM\nI love it\n\nI wish you could find people you recently played with, and walk freely, the teleporting somewhat breaks the emersion\n\nHelpful | 2", "clov3rOct 19 at 5:49 AM\nAmazing game\n\nOne thing though, when I sit the can horizontal it tends to glitch out so I can't do my out lines nice and clean other then that grouse game\n\nHelpful | 1", "Tummie555Oct 17 at 12:18 PM\nNo Cross buy!!!\n\nThis was an instant buy for me on the Rift. And unfortunately, again on the Quest.\n\nHelpful | 6"]