{"App Title": "Knockout League", "App description": "Welcome to the Knockout League, a single player arcade style boxing game built from the ground up for Virtual Reality. Its intuitive gameplay involves moving and dodging with your body and 1:1 punch movement that lets you attack how you want without relying on buttons for main gameplay. Train up with various boxing drills to take on a crazy cast of characters with different fighting styles and gameplay in order to become the champion of the Knockout League!\n\nOculus Cross-Buy enabled!", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Fighting", "Languages": "English, English (US)", "Version + Release Notes": "1.0", "Developer": "Grab Games", "Publisher": "Grab Games", "Website": "http://www.knockoutleaguevr.com/", "Release Date": "October 17, 2019", "Developer Privacy Policy": "Skip links\nSkip to primary navigation\nSkip to content\n\nGrab\n\nheader-right\nMain navigation\nGAMES\nGAMEVIEWAR\nKNOCKOUT LEAGUE\nAR AND MR\nJOHN WICK CHRONICLES\nEXTREME WHITEOUT\nMOBILE APPS\n360 VIDEO\nCOMPANY\n \nCONTACT\nPrivacy Policy\n\nGRAB GAMES PRIVACY AND INFORMATION SECURITY POLICY\n\nEffective Date: February 6, 2017\n\nThis Privacy and Information Security Policy (this Policy) discusses the personally identifying information (PII) that we collect about you when you use our website http://www.grabgames.com/ (the Site) and the software, games and other services we provide (Service).\n\nWho We Are. We are Grab Games LLC (Grab Games Grab, GrabGames.com, Site, Service, we, us, or our). Grab Games develops and publishes games across platforms. In conducting our business, as further described below, we collect information, including PII, about the individuals who use our Service.\n\nThis Policy and the Terms of Use. This Policy is part of and incorporated into the Terms of Use (collectively, the Terms).\n\nBY PROVIDING PII OR OTHER INFORMATION TO US OR BY USING OUR SERVICE, YOU AGREE TO THIS POLICY AND THE PRACTICES DESCRIBED IN THE POLICY.\n\n1. INFORMATION YOU GIVE US\n\n1.1 The Types of Information Grab Collects. We collect any information you enter on the Service or provide us in any other way (such as through an email, survey, or letter).\n\n2. AUTOMATIC INFORMATION COLLECTION\n\n2.1 No PII. Grab does not automatically collect any personally identifiable information (PII).\n\n2.2 Cookies & Pixels. Grab reserves the right to place Cookies and Pixel Tags on our owned web sites, including GrabGames.com. Cookies are alphanumeric identifiers that we transfer to your computers hard drive through your Web browser to enable our systems to recognize your browser. We use cookies & pixels to remember your information, to link your activities to you, and for retargeting and remarketing. While you can take steps to warn of, block or disable cookies, if you do, the Service may not function and appear as we have designed it. Nonetheless, if you want to take these steps, you can do so by following the instructions associated with your browser.\n\n2.3 Device Information. Grab may collect information about your current device, such as operating system, device type, manufacturer, and headset, either directly or through a third party.\n\n2.4 IDFA, IDFV, and Advertiser ID. Our mobile games may use mobile device identifiers for install attribution, attributing action, tracking user events, or displaying ads in game, either directly or through a third party service. These are used in accordance to Apple and Google developer policies. You can limit this by following the instructions associated with your device operating system.\n\n2.5 Promotions, Sweepstakes, and Contests. From time to time, we may host a promotion, sweepstake or contest on the Service. You may be asked to provide personal information or permit the transfer to a third party of your personal information in connection with such promotion, sweepstake or contest. It will be disclosed at the point of collection or transfer who is collecting or transferring the information and whose privacy statement applies, and it will be your choice whether or not you wish to permit such transfer to or collection of personal information by a third party.\n\n3. GRABS USE AND RETENTION OF YOUR INFORMATION\n\n3.1 Use of PII. We use your PII for such purposes as responding to your requests; monitoring and providing the Service; updates, newsletters, and similar communications about our games and services; enforcing our rights; and investigating and ensuring compliance with the Terms.\n\n3.2 Use of Other Information. We use non-PII for purposes such as measuring the number of visitors to sections of our Site, making the Service more useful to visitors and delivering targeted advertising and non-advertising content. We use non-PII to analyze trends, administer the site, track a users movement, and gather broad demographic information for aggregate, nonpersonally identifiable use.\n\n3.3 Retention of Information. We retain information for as long as required, allowed or we believe it useful, but do not undertake retention obligations. We may dispose of information in our discretion without notice, subject to applicable law that specifically requires the handling or retention of information. You must keep your own, separate back-up records.\n\n4. GRABS SHARING OF INFORMATION\n\nGrab shares information with third parties, but only as described in this Section 4.\n\n4.1 Advertisers and Others. We may share non-personally identifiable information with advertisers, service providers, and other persons with whom we conduct business.\n\n4.2 Service Third Parties. We contract with third parties to provide services to us or to you on our behalf. Examples include providing marketing assistance, providing customer services, sending Grab email to you, removing repetitive information from customer lists, and analyzing data. These third parties have access to personal information needed to perform their functions.\n\n4.3 Business Transfer. As we develop our business, we might sell or buy businesses or their assets, or engage in acquisitions, mergers, restructurings, changes of control, or similar transactions. In such transactions, customer information generally is one of the transferred business assets, and your PII is subject to such a transfer. Also, in the unlikely event of a bankruptcy, customer information may be transferred to a bankruptcy trustee or debtor in possession and then to a subsequent purchaser.\n\n4.4 Compliance and Safety. We may release PII when we believe release is appropriate to:\n\n(a) comply with applicable law, and to respond to legal process, including subpoenas, search warrants and court orders, and to respond to or otherwise address written complaints of copyright infringement;\n(b) make disclosures under programs intended to prevent potential crimes or investigate persons;\n(c) enforce or apply agreements, including the Terms; or\n(d) protect the rights, property, or safety of Grab, our users, or others, including exchanging information with other companies for fraud protection and credit risk reduction.\n\n5. INFORMATION SECURITY\n\n5.1 Your Obligations. You must protect against unauthorized access to your password and to your computer. Please sign off when finished using a shared computer. Your e-mails to us are not necessarily secure against interception so do not include sensitive information in them  we generally will not ask for passwords in an email and you should assume that if you get such a request, it might be fraudulent. YOU MUST DO WHAT YOU REASONABLY CAN TO ENSURE THE SECURITY OF YOUR PERSONAL INFORMATION.\n\n5.2 Our Security Measures. We have physical, electronic, and managerial procedures to help safeguard, prevent unauthorized access, maintain data security, and correctly use your information. HOWEVER, WE DO NOT GUARANTEE SECURITY. Neither people nor security systems are foolproof, including encryption systems. In addition, people can commit intentional crimes, make mistakes or fail to follow policies. If applicable law imposes any non-disclaimable duty (if any), you agree that the standard used to measure our compliance with that duty will be one of intentional misconduct.\n\n6. LINKS\n\nThe Service contains links to other sites. We are not responsible for the privacy practices of such other sites. We encourage you to be aware when you leave our Site and to read the privacy statements of every website that collects your personally identifiable information. This Policy applies only to information collected by the Service.\n\n7. CONDITIONS OF USE, NOTICES, AND REVISIONS\n\n7.1 Privacy Concerns. Your use of the Service and any dispute over privacy is subject to the Terms. If you have any concern about privacy at Grab, please send us a thorough description by using the contact support form at, and we will try to resolve it.\n\n7.2 Notice Required by Law. In those jurisdictions that permit email notice, if we are required to disclose or provide notice of invasion of certain security systems, we will do so by notifying you through our preferred channels. This may include our websites, social media, or email to the most current email address provided by you to us.\n\n7.3 We reserve the right to update this Privacy Policy at anytime.If we do this, we will post the changes on this page and will indicate at the top of this page the date those terms will be effective. We will attempt to give you advance notice of any substantive changes, but reserve the right to make such modifications immediately if required.\n\nGrab is a trademark or registered trademark of Grab Games LLC in the United States and other countries.\n\n\n\nCopyright 2020 Grab Games, LLC. All Rights Reserved.\n\nTerms of Use\n \nPrivacy Policy\n \nContact", "Developer Terms of Service": "Skip links\nSkip to primary navigation\nSkip to content\n\nGrab\n\nheader-right\nMain navigation\nGAMES\nGAMEVIEWAR\nKNOCKOUT LEAGUE\nAR AND MR\nJOHN WICK CHRONICLES\nEXTREME WHITEOUT\nMOBILE APPS\n360 VIDEO\nCOMPANY\n \nCONTACT\nTerms of Use\n\nGRAB GAMES TERMS OF USE AGREEMENT\n\nEffective Date: February 6, 2017\n\nWelcome to Grab Games. By accessing and using our games, content, activities and services (Service or Services), you signify that you have read, understand and agree to be bound by the terms and conditions set forth below (the Terms).\n\n1) License to Use the Services\n\nSubject to your acceptance with these Terms, you may use the Services solely for your own non-commercial entertainment purposes. You may not use the Services for any other purpose.\n\nThis license is subject to certain limitations. Any use of the Services in violation of these limitations will be considered a breach of this Agreement, and may result in disciplinary or legal action against you or your account. You agree that you will not:\n\nCheat or use, develop or distribute automation software programs (bots), macro software programs or other cheat utility software program or applications which are designed to modify the Grab experience to the detriment of fair play;\nDisrupt, attempt to, or otherwise assist in the disruption of (i) any computer used to support the Services or (ii) any other players experience;\nUpload files that contain viruses, Trojan horses, worms, time bombs, corrupted files or data, or any other similar software or programs that may damage the operation of the Services or other users computers;\nExploit the Services or any of its parts for any commercial purpose;\nPromote or encourage any illegal activity including, without limitation, hacking, cracking or distribution of counterfeit software, or cheats or hacks for the Services;\nReproduce, translate, reverse engineer, modify, disassemble, or decompile, in whole or in part, or create derivative works of the Services, except to the extent permitted by applicable law\n\n2) Usage Rules\n\nAs a condition of your use of and access to the Service, you agree to comply with these Usage Rules, which are provided as an example rather than as a limitation, and any application or game specific rules published within the Service.You agree that your use of and conduct on the Service shall be lawful and your User Content will not:\n\ninclude any offensive comments that are connected to race, national origin, gender, sexual preference or physical handicap;\ninclude profanity or any obscene, indecent, pornographic, sexual or otherwise objectionable content or language;\ndefame, libel, ridicule, mock, disparage, threaten, harass, intimidate or abuse anyone;\npromote violence or describe how to perform a violent act\nviolate the contractual, personal, intellectual property or other rights of any party, or promote or constitute illegal activity; or\nbe in violation of these Terms or the game rules of conduct (collectively Content Restrictions).\n\nYou and your activities on the Service will not:\n\nreveal any personal information about another individual, including another persons address, phone number, e-mail address, credit card number or any information that may be used to track, contact or impersonate that individual;\nattempt to impersonate any other party;\ncreate user accounts by automated means or under false pretenses or mislead others as to the origins of your communications;\ntrick, defraud or mislead Grab and other users, especially in any attempt to learn sensitive account information such as passwords;\nmake improper use of Grabs support services or submit false reports of abuse or misconduct;\nengage in any commercial activities, including, without limitation, any attempt to raise money for anyone or advertise or promote a product, service, website, pyramid scheme or other multi-tiered marketing scheme;\ndisparage, tarnish, or otherwise harm, in Grabs opinion, Grab and/or the Service;\nviolate these Terms or any local, state, federal or international law, rule or regulation or any other requirements or restrictions posted by Grab on the Service;\ndisseminate or transmit viruses, worms, Trojan horses, RATs, keyboard loggers, time bombs, spyware, adware, cancelbots or any other malicious or invasive code or program;\nupload or transmit (or attempt to upload or to transmit) viruses, Trojan horses or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text) that interferes with any partys uninterrupted use and enjoyment of the Service and User Content or modifies, impairs, disrupts, alters or interferes with the use, features, functions, operation or maintenance of the Service, the User Content;\ncopy or adapt the Services software including but not limited to Flash, PHP, HTML, JavaScript or other code;\nreverse engineer, decompile, reverse assemble, modify or attempt to discover any software (source code or object code) that the Service create to generate web pages or any software or other products or processes accessible through the Service;\nupload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including, without limitation, clear graphics interchange formats (gifs), 11 pixels, web bugs, cookies or other similar devices (sometimes referred to as spyware, passive collection mechanisms or pcms);\nexcept as may be the result of standard search engine or Internet browser usage, use or launch, develop or distribute any automated system, including, without limitation, any spider, robot (or bot), cheat utility, scraper or offline reader that accesses the Service, or use or launch any unauthorized script or other software;\ncover or obscure any notice, banner or advertisement on the Service;\ndisguise the source of your User Content or other information you submit to the Service or use tools which anonymize your internet protocol address (e.g. anonymous proxy) to access the Service;\ninterfere with or circumvent any security feature of the Service or any feature that restricts or enforces limitations on use of or access to the Service, Collaborative Content or the User Content;\nsell the Service or any part thereof including but not limited to Virtual Goods or Virtual Currency, user accounts and access to them in exchange for real currency or items of monetary value; or\nengage in cheating or any other activity deemed by Grab to be in conflict with the spirit or intent of the Service.\n\nGrab does not control or endorse the content, messages or information found in User Content portions of the Service or external sites that may be linked to or from the games or their forums and, therefore, Grab specifically disclaims any responsibility with regard thereto.\n\n3) Privacy\n\nView our Privacy Policy:http://www.grabgames.com/privacy-policy/\n\nGrab respects the privacy of visitors to our site and games. Information collected from you is subject to the pertinent social networks policy. By visiting our website or playing a game, you may be granting your social network permission to share your e-mail address and any other personally identifiable information with Grab. Please see Grabs Privacy Policy for more information on the collection and use of your information. You acknowledge and agree that this Privacy Policy, including, but not limited to, the manner in which Grab collects, uses and discloses your personally identifiable information, is incorporated and made part of these Terms. If User does not agree to each and every part of Grabs Privacy Policy, then you should not play the game or submit any personally identifiable information through this game.\n\nGrabs Services are intended for users aged thirteen and older. We do not knowingly collect information from users under thirteen years of age.\n\n4) Charges and Billing\n\nIn some cases, you can use the balance in your Steam account, iTunes account, Google Play account, or other such service; credit or debit card, PayPal, Mobile Carrier or other similar accounts (each referred to herein as Payment Information) to pay for games, virtual currency, upgrades, and/or other Services. When you provide Payment Information to us (or our designated licensees or subcontractors), you represent and warrant that you are the authorized user of the Payment Information that is used to pay such charges. You must promptly notify us of any changes to your Payment Information. You are responsible for all charges incurred, including applicable taxes, and all purchases made by you or anyone that uses your account, including your family or friends.\n\n5) Links to Third Party Sites\n\nThe Service may contain advertisements, offers, or other links to websites of third parties that we do not control. Advertisements and other information provided by third parties may not be wholly accurate. Grab is not responsible or liable for (i) the availability or accuracy of such sites or advertisements; or (ii) the content, products or services available from such sites. The inclusion of any link on the Service does not imply that we endorse the linked site. You use the links at your own risk. Grabs Privacy Policy is applicable only when you are on our Site. Once you link to another website, its privacy statement applies to any personal information you supply.\n\nWe may provide links on the Services to third party websites, or vendors who may invite you to participate in a promotional offer in return for receiving optional Services and/or upgrades (such as in-game currency). Some of these web sites may charge separate fees, which are not included in any fees that you may pay to Grab. Any separate charges or obligations you incur in your dealings with these third parties are your responsibility. We make no representation or warranty regarding any content, goods and/or services provided by any third party even if linked from one of our Services, and will not be liable for any claim relating thereto. The linked sites are not under the control of Grab and may collect data or solicit personal information from you. We are not responsible for their content, business practices or privacy policies, or for the collection, use or disclosure of any information those sites may collect. We are providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Grab of these linked sites.\n\n6) User Content\n\na) The Service may invite you to chat or participate in blogs, message boards, online forums and other functionality and may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute or broadcast content and materials to Grab and/or to or via the Service, including, without limitation, text, writings, software, video, music, sound-clips, likenesses, photographs, graphics, comments, suggestions or personally identifiable information or other material (collectively User Content). Any material you transmit to Grab will be treated as non-confidential and non-proprietary.\n\nb) You agree that your User Content is wholly original to you and you exclusively own the rights to your User Content, including the right to grant all of the rights and licenses in these Terms without Grab incurring any third party obligations or liability arising out of its exercise of the rights thereto granted herein by you.\n\nc) You grant to Grab the unrestricted, unconditional, unlimited, worldwide, irrevocable, perpetual fully-paid and royalty-free right and license to host, use, copy, distribute, reproduce, disclose, sell, resell, sublicense, display, perform, transmit, publish, broadcast, modify, make derivative works from, retitle, reformat, translate, archive, store, cache or otherwise exploit in any manner whatsoever, all or any portion of your User Content to which you have contributed, for any purpose whatsoever, in any and all formats; on or through any and all media, software, formula or medium now known or hereafter known; and with any technology or devices now known or hereafter developed and to advertise, market and promote same.\n\nd) Grab has no obligation to monitor or enforce any intellectual property rights that may be associated with your User Content, but Grab does have the right to enforce such rights through any means it sees fit, including bringing and controlling actions on your behalf.\n\ne) Grab has no obligation to accept, display, review, monitor, or maintain any User Content. We have the right to delete User Content from the Service without notice for any reason at any time. Grab may move, re-format, edit, alter, distort, remove or refuse to exploit User Content without notice to you and without liability; provided, however, that Grab reserves the right to treat User Content as content stored at the direction of users for which Grab will not exercise editorial control except to enforce the rights of third parties and the Content Restrictions set forth below when violations are brought to Grabs attention.\n\nf) You acknowledge that you do not rely on Grab to monitor or edit the Service and that the Service may contain content which you find offensive and you hereby waive any objections you might have with respect to viewing such content.\n\n7) In-Game Currencies/Goods\n\na) The Service may include a virtual, in-game currency (Virtual Currency) including, but not limited to coins, cash, or points, that may be purchased from Grab for real world money if you are a legal adult in your country of residence. The Service may also include virtual, in-game digital items (Virtual Goods) that may be purchased from Grab for real world money or for Virtual Currency. Regardless of the terminology used, Virtual Currency and Virtual Goods may never be redeemed for real world money, goods or other items of monetary value from Grab or any other party.\n\nb) Other than a limited, personal, revocable, non-transferable, non-sublicenseable license to use the Virtual Goods or Virtual Currency in the Service, you have no right or title in or to any such Virtual Goods or Virtual Currency appearing or originating in the Service, or any other attributes associated with use of the Service or stored within the Service.\n\nc) Grab has the absolute right to manage, regulate, control, modify and/or eliminate such Virtual Currency and/or Virtual Goods as it sees fit in its sole discretion, and Grab shall have no liability to you or anyone for the exercise of such rights.\n\nd) Transfers of Virtual Currencies and Virtual Goods are strictly prohibited except where explicitly authorized within the Service. Outside of the game, you may not buy or sell any Virtual Currency or Virtual Goods for real world money or otherwise exchange items for value. Any attempt to do so is in violation of these Terms and may result in a lifetime ban from Grab Service and possible legal action.\n\ne) You agree that all sales of Virtual Goods and Currencies are final. No refunds will be given, except in our sole and absolute discretion. All Virtual Goods and Currencies are forfeited if your account is terminated or suspended for any reason, in Grabs sole and absolute discretion, or if Grab discontinues providing the Service.\n\n8) Termination\n\nWe reserve the right to terminate or suspend your account or your access to any or all of the Services at any time, for any reason and we have the right to terminate your account for what is, in our sole discretion and determination, deemed to be a violation or breach of these Terms of Service.\n\nIn the event your account or access to the Services is terminated, suspended or canceled, whether by you or by Grab, you will not be entitled to any refund nor will any credits or in-game items (e.g., points in an online game) be credited to you or converted to cash or other form of reimbursement, and you will have no further access to your account or anything associated with it (such as points or in-game items). If your account is terminated or suspended by us, we also have the right to terminate or suspend any of your other accounts.\n\n9) The Services are Available AS-IS\n\nThe Services are provided on an AS IS and AS AVAILABLE basis and we do not warrant that the Services will be uninterrupted or error-free, that defects will be corrected, or that the Services will be free of viruses or other harmful components. WE EXPRESSLY DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION THE WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR USE AND NON-INFRINGEMENT. Your access and use of the Services is at your own risk. We cannot assume responsibility for any damages suffered by you, including, but not limited to, loss of data, game play, items or characters from delays, non-deliveries, errors, system down time, misdeliveries or service interruptions caused by us, or by your or by any other users errors and/or omissions.\n\n10) Limitation of Liability\n\nGRAB AND ITS LICENSORS WILL NOT BE LIABLE IN ANY WAY FOR DAMAGE OR LOSS OF ANY KIND RESULTING FROM (A) THE USE OF OR INABILITY TO USE THE SERVICES INCLUDING WITHOUT LIMITATION LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION; (B) THE LOSS OR DAMAGE TO CHARACTERS, ACCOUNTS, STATISTICS, INVENTORIES OR USER PROFILE INFORMATION; OR (C) INTERRUPTIONS OF SERVICES INCLUDING WITHOUT LIMITATION ISP DISRUPTIONS, SOFTWARE OR HARDWARE FAILURES OR ANY OTHER EVENT WHICH MAY RESULT IN A LOSS OF DATA OR DISRUPTION OF SERVICES. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL GRAB OR ITS LICENSORS BE LIABLE TO YOU OR ANYONE ELSE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES, EVEN IF THEY HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGE, AND EVEN IF A REMEDY SET FORTH HEREIN IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE.\n\n11) Exclusions\n\nSome jurisdictions do not allow the exclusion of certain warranties or the exclusion or limitation of liability for consequential or incidental damages, so the limitations above may not apply to you.\n\n12) Indemnification\n\nYou agree to defend, indemnify, and hold Grab harmless from and against any claim, liability, loss, injury, damage, cost, or expense (including reasonable attorneys fees) incurred by Grab arising out of or from your access and use of the Services, your violation of these Terms or any Content posted, transmitted or provided by you or on your behalf.\n\n13) Waiver and Severability\n\nThe failure of Grab to enforce any right or provision of these Terms will not be deemed a waiver of such right or provision. In the event that any provision of these Terms is held to be invalid or unenforceable, the remaining provisions of these Terms will remain in full force and effect.\n\n14) Injunctive Relief\n\nYou acknowledge that the rights granted and obligations made hereunder to Grab are of a unique and irreplaceable nature, the loss of which shall irreparably harm Grab and which cannot be replaced by monetary damages alone so that Grab shall be entitled to injunctive or other equitable relief (without the obligations of posting any bond or surety) in the event of any breach or anticipatory breach by you.\n\n15) Controlling Law and Jurisdiction\n\nThese Terms and any action related thereto will be governed by the laws of the State of California without regard to its conflict of law provisions. All claims, legal proceedings or litigation arising in connection with the Services will be brought solely in Los Angeles County, California, and you consent to the jurisdiction of and venue in such courts.\n\n16) Other Jurisdictions\n\nGrab operates and controls this application from its offices in the United States. Grab makes no representation that this application is appropriate or available in other locations. The information provided on this application is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject Grab to any registration requirement within such jurisdiction or country.\n\n17) Complaints and Notices\n\nThe Digital Millennium Copyright Act (DMCA) provides copyright owners who believe that their rights under the United States Copyright Act have been infringed by acts of third parties over the Internet with ways to protect their rights. If you believe that your copyrighted work has been copied without your authorization and is available in this game in a way that may constitute copyright infringement, you can provide notice of your claim to Grabs Designated Agent listed below. For your notice to be effective, it must include the following information:\n\nA physical or electronic signature of a person authorized to act on behalf of the owner of the intellectual property right that is allegedly infringed;\nA description of the copyrighted work that you claim has been infringed upon;\nA description of where the material that you claim is infringing is located in this game;\nInformation reasonably sufficient to permit Grab to contact the complaining party, such as address, telephone number, and, if available, an e-mail address at which the complaining party can be contacted;\nA statement by you that you have a good-faith belief that the disputed use is not authorized by the copyright owner, its agent, or the law; and\nA statement that the information in the notification is accurate and, under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of the exclusive right that is allegedly infringed.\n\n18) Modification of Terms\n\nWe reserve the right to modify the Terms at any time. If we do this, we will post the changes to these Terms on this page and will indicate at the top of this page the date those terms will be effective. We will attempt to give you advance notice of any substantive changes, but reserve the right to make such modifications immediately if required. Your use of the Services after any such changes become effective constitutes your acceptance of the new Terms. If you do not agree to abide by these or any future Terms, do not use or access (or continue to use or access) the Services. It is your responsibility to check to determine if there have been changes to these Terms and to review such changes.\n\n19) Entire Agreement\n\nThese Terms are the entire and exclusive agreement between Grab and you regarding the Services, and these Terms supersede and replace any prior agreements regarding the foregoing\n\nCopyright 2020 Grab Games, LLC. All Rights Reserved.\n\nTerms of Use\n \nPrivacy Policy\n \nContact", "Space Required": "1.02 GB"}



["5 stars\n55%\n4 stars\n17%\n3 stars\n8%\n2 stars\n5%\n1 star\n15%", "wootsiebeezerJun 25 at 6:16 AM\nGreat game, but a few problems\n\nI give this game four stars because it is really fun to play, but there were some problems in the beginning. Apart from all that, I think this game would be worth 5 stars if we did some updates.\n\nHelpful | 16", "Hard_Bodied_Dope_BoiJul 19 at 2:41 PM\nWorth the Training Mode Alone\n\nThe campaign in this game is very arcady and quite fun, but far from a sim. The training modes however, are worth the price of admission alone. Reflex alley and the heavy bag are incredible workouts and you will get FIT grinding those out.\n\nHelpful | 4", "Jonnyrad1973Jun 30 at 9:13 AM\nAwful\n\nI cant even get past the tutorial. It looks really nice but Im getting sick and tired of hearing, dont dodge, I want you to block! over and over again. Im sure theres a great game in here somewhere but if the timing has to be this precise then I havent got time for this game. Looking at the reviews, Im not the only one finding this problematic. I urge the developers to take note and fix this issue ASAP.\n\nHelpful | 6", "Flerken1222 days ago\nLove the game!\n\nThis is a awesome and challenging game and that is what makes it fun. The only thing I would have you change is to add more people to fight.\n\nHelpful | 1", "Knarf76Apr 28 at 1:34 AM\nGood but not on the level of Punch-Out\n\nI am a massive fan of Punch-Out. For sure the Wii version.\n\nThis game has good graphics. Nice sounds. And is well polished.\n\nMain thing lacking is some gameplay stuff. Too many instances when you slap your oponent on the face and nothing happens. I am aware this is part of the arcade style of the game. But in Punch-Out the characters will just block any shot you take. The fact that you can just punch your opponent full in the face without any effect breakes immersion.\n\nGreat workout. Good game.\n3.5 stars would be appropriate.\n\nHelpful | 20", "Gummydaredevil24 days ago\nAwesome Moves...\n\nThe game is great the opponents have cool moves likes great magician, show, volt its a five star for me.\n\nHelpful | 0", "reebob21 days ago\nWhiplash simulator\n\nI hate showtime I just delete the game all in getting rid of showtime I hate this game so much I would rather stick my d!ck on a cactus instead this garbage of a game\n\nHelpful | 1", "yolo22222654Jul 28 at 10:22 AM\n\nI hate it I cant tell if it is even possible to get passed Octopunch\n\nHelpful | 0", "virtually_happyJun 5 at 4:37 AM\nIssue\n\nI usually love this game but it is not loading in I have been stuck on the loading 3 dots for ever its just straight up not working I have tried everything\n\nHelpful | 2", "SRGSUNSETJul 4 at 7:27 PM\nFun Game\n\nThis game was really fun for my family, and I like the mechanics of the opponents\n\nHelpful | 0", "MrTrendzformerFeb 3 at 11:02 PM\nFun Game, BUT...\n\n... the fact that you can not reset your Position while the fight lasts is dumb. I am a taller guy and have a more than 2x2 m guardian. Still when dodging some attacks when I have to step aside and duck I am pushing the boundaries due to my height. I just smashed my Head against the wall pretty hard!\nThat could have been avoided of I had the opportunity to reset my play area (the green field) during the fight. Add this feature and its a five Star game. My head hurts.\n\nHelpful | 47", "BrennBoy7030May 14 at 9:26 AM\nIt was a great game\n\nI Thought it was cool because they showed you when they were going to attack dodge and parry\n\nHelpful | 3", "MopzeeFeb 26 at 9:49 AM\nA disappointing purchase.\n\nI purchased this game because I was looking for a boxing game that was more fun and less hyper realistic. And so I landed here with Knockout League.\n\nAnd then came the tutorial.\n\nNever have I gone from excited and hopeful to frustrated and disappointed so quickly as I did in my first steps into this game.\n\nFirstly the play area positioning is dreadful. I spent around 10 minutes alone fighting with it and trying everything I could to get my designated zone where I wanted it. This alone started me on the wrong foot. A future quality of life improvement would be allowing players to pick up or click and drag their designated center point where they want it, not where ever the game decides to plunk it down. I shouldnt have to struggle just to stand where I want to.\n\nThe tutorial fight made sense enough to me based on instructions, however, it was relentlessly unforgiving. I had many issues with the game claiming I dodged instead of blocking when I had only moved my hands up to block. My husband was in the room with me and saw I wasn't moving anything but my hands/arms. Leading to me being chastised over and over and over for my supposed \"dodging\".\n\nThe window of time you have to block is very small, and I found myself barely bringing my hands up before it was deemed blocking for too long by the game. The follow up of blocking and returning a punch right after had a similar issue. I was swinging as fast as I could and still wasn't good enough for the game's demands of perfection. (Before I get the dev comment telling me to hit his hand, I know. I was hitting his pad. Apparently some people didnt get that but I assure you that was NOT my problem)\n\nFinally the nightmarish tutorial was over and though I was pretty thoroughly upset by this point I still went for the first fight. And... well. It sure didn't make up for or change much from the tutorial, aside from the absence of being consistently and repeatedly berated.\n\nReading through these reviews and comments has both helped and not helped. I plan to try the mini games to see if there is anything worth salvaging from this, or if asking for a refund is my only remaining option. I've never played punch out so sadly I seem to be lacking the nostalgia goggles that many others see this game in. It seems most reviews are \"just like punch out, I love it\" or \"makes you sweat!\", with the rest mentioning similar issues to what I am facing.\n\nIt's a shame the gameplay is so fickle, the art style and idea of some fun opponent characters was really appealing to me, but I felt so defeated and frustrated with the gameplay I honestly don't want to open the game up again. When I play this, I had a frown plastered on my face from 5 minutes in to well after i closed the game.\n\nFor some people this would be good I am sure, especially if you like punch out, evidently. It just is not for me.\n\n2 stars awarded purely for aesthetics.\n3 stars deducted for the gameplay and positioning issues.\n\nHelpful | 22", "jadyn.carter.144 days ago\nGreat\n\nIts pretty good, I like how it tracks your weight and helps you get fit but all that sweat makes my oculus stink\n\nHelpful | 0", "keaton.hull.1May 18 at 9:10 PM\n\nThis app sucks donkey balls\n\nHelpful | 9", "gringJul 29 at 9:25 AM\nTutorial too hard, cannot refund game.\n\ni played this game 2-3 minutes, came too the tutprial on blocking and its too hard to get it right for being a game, this aint real life you morons you can make the game a bit easier. i then uninstalled game and tried to refund, it tells me refund not available, it tells mei can play 2hrs and not after 14 days of purchase. i bought the game today and played it under 10 minutes.\n\nHelpful | 0", "SuperSnackFeb 24 at 1:01 PM\nBest boxing game on oculus\n\nSo this is as close as you can currently get to punch out on the quest. Its great. the training part/mini games are very underrated! I dont like having to reset my position and sometimes the hits are off. Also the characters seem just a little too close to me. also I wish there were a few more characters to fight. Overall great game and worth the price!\n\nHelpful | 7", "MoonFetusFeb 22 at 3:06 PM\nI only play training games\n\nMain game isnt fun. The mechanics are really clunky. However, most of the training mini games are perfect for a workout.\n\nHelpful | 6", "ben9809May 11 at 4:16 PM\nRefund please\n\nHow do I get a refund\n\nHelpful | 2", "BaseballevanFeb 17 at 7:36 PM\nLove it\n\nI love this game.anyone who doesnt is just jealous they cant get past the great magician. But this isnt made to be some creed rise to glory type game. Its made to be a fun arcade game. It would be cool if you add more people,but thats just me getting picky. Continue making games like this\n\nHelpful | 3", "DanGar0803Feb 16 at 8:40 PM\nHitboxes\n\nSo I was doing very well until I got the Iron Maiden. And let me just say that you need to fix her hitbox because I hit her on her left side (exposed) and somehow my glove ends up on her right shoulder. Keep in mind that I'm hitting her with the correct glove. Also in her special attack , if you lose both gloves she does a chain of attacks, I'm supposed to get my glove back but when I lose my other glove the timer apparently restart. Fix now plz\n\nHelpful | 3", "jenevieve.daveyApr 18 at 9:33 AM\nAAAAAAAAAAAAAAAAAAA\n\nTHIS GAME IS IMPOSSIBLE!!! BARAGE IS THE HARDEST FIGHTER!!!! WASTE OF MONEY!\n\nHelpful | 2", "Not-DB-CooperDec 22 at 4:43 PM\nTop tier game\n\nThis title has 2 main sections. The first is the game itself, where you box your way up the ranks against cartoon opponents. It's not meant to be a realistic boxing simulation, but something more akin to the game Punch-out in VR. Each opponent has a different strategy to use to beat them. Once you figure it out, that opponent loses a lot of replay value. It's fun while you're moving up the ranks the first time though.\n\nThe second section, and what really makes this game stand out, is the training areas. Most notable of these is the reflex alley, which is currently my favorite way to get in some quick cardio. There's also a heavy bag you can hit targets on which can be fun, an option to train with the coach using pads that is said to actually teach real boxing skills, and a speedbag area that is pretty forgettable.\n\nAll in all if this game looks like something you'd find fun, it is.\n\nHelpful | 14", "FaceTrashMay 20 at 9:07 AM\nNostaliga in VR\n\nAs a kid I used to play a LOT of Punch Out. When I saw that game I immediately understand the love letter to this well loved franchised. I was wondering how this would work out in VR and the answer is: perfectly! This is a very arcade gameplay (and it's exactly what it need). The characters are unique and very funny. The art style is on point. Everything about this game screams nostaliga for Punch Out, but now YOU have to play Little Mac (I know, it's not his name, I am actually called Vengeance Cactus). And that brings me to the humour. This game is jam packed with funny things. I love this game a lot. I can't play for too long though, as it is one hell of a workout. Which is only a bonus in my book.\n\nHelpful | 0", "WhiteVanManMar 8 at 3:01 PM\n10/10\n\nGood\n\nHelpful | 3", "chaoswhistlerJan 2 at 7:54 AM\nNot very good compared to others\n\nI was looking forward to this, but found it disappointing. You can only block at certain very specific times and it's very unforgiving if you don't get it right. You can only punch if you've blocked at that exact time, otherwise your punches don't land. You have to stay in one spot. These things kill any sense of immersion.\n\nThe training mode is decent, with the heavy bag being actually great (different spots show up on the bag which you have to punch), but it's let down by the rest of the game. Some people seem to love it, but I'm asking for a refund after about 30 minutes of playtime.\n\nI've been playing a lot of Thrill of the Fight recently, which is a great workout and plays more or less the way you'd actually expect boxing to be, and Knockout League is very poor compared to that.\n\nHelpful | 5", "JaboticalDec 28 at 8:16 AM\nFantastic arcade boxing game\n\nAs others have noted, this is VR Punchout -- it's not a realistic boxing simulation, rather it's a series of boss fights where you learn when to effectively block or dodge, in order to have opportunities to pummel your opponent.\n\nThe cast of characters is delightfully zany, with varied styles and difficulties. The graphics are excellent and the game runs smoothly, even when the opponent has (for instance) a whole mess of undulating limbs.\n\nIt's an effective workout, having to move and punch so much, especially while learning to defeat each new opponent. Of course its replay value is affected somewhat by the fact that fighters become easier to dispatch once you've internalized their patterns and timings. Then again, there's still something satisfying in a fight you've really gotten good at. There are also some bonus training modes that can really wear you out (as if the main game didn't already do that considerably)\n\nThe whole thing is impressively polished, and I've had a great time with it. If you don't go into it expecting something like Thrill of the Fight (also a great game, in an entirely different way), and take the time to learn how to play it (if you've played Punchout it should be pretty intuitive), it will be a worthy and entertaining addition to your library. Definitely one of my favorite games.\n\nHelpful | 3", "liam-123May 13 at 10:08 AM\nKnockout Laugue\n\nIts great I love the game. But I think some hits boxes should be fixed : )\n\nHelpful | 0", "SloppyJoe2008Jan 15 at 5:09 PM\nFitness, Fun, And Showtime.\n\nThis is my favorite game on the quest so far, it feels like your in real life NES Punchout, not to mention the exercise you get from playing it, Ive been playing for about 2 hours straight and have burned about 700 calories, great game. (Edit)\nIm discovering that the game is really, really hard. I got stuck on almost every boss for about an hour until showtime, where I got stuck for about 2 hours and still havent beat him, but every boss was fun, interesting and cool looking, except for showtime, his smug attitude when you mess up his patterns is actually rage inducing, hes a huge upgrade in difficulty from Iron Maiden. I really wanted to beat knockout League but since showtime is so hard I gave up, Its just not like most games to go from not having a trigger finger to having more rules to remember. Everything was great except him. Thanks for the advice, I beat him.\n\nHelpful | 1\nDeveloper ResponseJan 15 at 4:45 PM\n\nHey there! Showtime is designed to be tricky and throw you off your game defensively. Without knowing exactly what's giving you trouble, I can at least offer some general advice to help you get your revenge. Look out for something he does before he attacks that can tip you off into the timing of his punches. It'll still be on you to dodge or block in response but you'll have an idea of what's coming so he won't be able to catch you acting too early or too late. Let me know if you want any other tips. He's tough (and a little punk), but it'll be that much sweeter when you put him down. You can do it!!", "JCsMagicLinesOct 17 at 10:28 AM\nYou will get sore! 5* Replay Value!\n\nYour heart rate will increase. You will get great cardio exercise and your arms will get tired. You will get sore. But you will get fit while having fun! I love this game. Now, don't go in here expecting full simulation boxing. It's more like Punch Out game style but in my opinion, it's a bit better than Creed in the workout category since you actually have your own stamina. Yes, it's not as free-form and is somewhat more about pattern recognition but you are not stuck to an artificial stamina here which mean you get GREAT cardio and training in your arms. The mini games are also a blast to play and are some of the best ones!\n\nAlso, dare I say the Mit training will actually help your real-world boxing skills. If you do some boxing training on the side, that mini game will definitely help you get your boxing chops - so long as you use the proper forms and not just try to get the points.\n\nHelpful | 87", "damianmoreno2009Jan 22 at 9:29 PM\nGets boring\n\nWhen I started this game it was fun but after some time I got bored of it and its tireing\n\nHelpful | 1", "SkyjoggerOct 19 at 9:08 AM\nGreat fun!\n\nPunch out in real life, its a blast!\n\nSeriously, other reviewers, if youre removing stars because:\n\n1) you couldnt figure out that you had to punch his pad instead of him in the training\n\n2) you had a one-off glitch\n\n3) you cant understand that this is cartoon vs realistic boxing\n\nthen you shouldnt even be allowed to leave reviews!\n\nHelpful | 30", "JimZMDec 27 at 6:27 AM\nquicktime game disguised as physics sim\n\nThe graphics are amazing, but the gameplay has nearly zero value to me. The gameplay is extremely unintuitive and unrealistic. Most of the time my gloves just go right through the opponent without registering any action. After much research on the internet, I learned that when my gloves turn white (which is most of the time), they are practically non-solid. You can't just hit whenever it seems like it should be possible in real life, and I'm not sure how the game determines when it's okay to hit. According to my internet research (because the in-game tutorial is useless), the possible actions you can take are pattern based, and they are very inflexible (like games 30 years ago). The only fun/useful part of the game is the training mini-games. I would price that at $5 and rate it 4 stars.\nbtw I've never played Punch Out, and I've played Thrill of The Fight.\n\nHelpful | 2", "benkesmithOct 17 at 3:30 PM\nPromising start\n\nFor those who got stuck at the beginning of the tutorial: you have to hit the trainer's hand pad after dodging, not his face! I've spent 8 minutes cursing till I accidentally found it out. :-)\n\nThen I've played a match, and now I have muscle fever... It will be a great app for my cardio excercise!!! :-)\n\nHelpful | 11", "08GamezYTMay 7 at 7:23 PM\nBasically vr punch out\n\nIts fun as hell\n\nHelpful | 0", "BMFSHOWOct 17 at 11:38 AM\nA True Arcade Style Boxing Game\n\nI really love this game. It reminds me so much of the older arcade boxing games from Punch-Out to Ready 2 Rumble. It's fun, looks great, and it plays great as well. Plus you get a good exercise and I love the training mini games.\n\nHelpful | 55", "ScottyDean77Nov 22 at 8:34 PM\nGloves DOWN\n\nThis game is not worth the money. You cant hit when you want. You can only hit when you block correctly. Then can only hit for a few times in a flurry. Just swinging like little kids. No form, no style. I kept trying to hit when there was open shots. But it wouldnt let me. Very frustrating. Id like a refund. Wont be playing this anymore. Huge waste of $$$\n\nHelpful | 14", "RussTheIconFeb 16 at 11:34 AM\nHorrible gameplay\n\nTerrible fighting engine and gameplay. You have to wait to be hot before you can punch? The reflex alley training is a fun mini game .\n\nHelpful | 0", "BottledBaconOct 20 at 4:49 AM\nGood but so far inconsistent?\n\nThe game does exactly what I would want it to do. Sensibly tries to put you at the edge of your guardian boundary facing in so you can punch forward and have as much space ahead of you as possible. Fighters have personality that is on a level with punch-out.\n\nOnly big problem so far is I feel like blocking only works 20% of the time. In the tutorial it worked basically flawlessly but in fights enemy punches are constantly just sailing through my block. I only win by basically ignoring blocking and only dodging and stunning them mid attack since blocking results in being hit all the time. Maybe what counts as blocking should be made more loose?\n\nHelpful | 5", "Pinner4life17May 17 at 8:54 AM\nThe game is challenging and tiring\n\nWhen ur playing harder people it can be really hard and tiring\n\nHelpful | 0", "NeoScootersApr 27 at 8:06 PM\nGreat game\n\n.\n\nHelpful | 0", "rabksajDec 2 at 1:59 PM\nGreat game for work out\n\nI wish in the mini games fitness gym the dumbbells thrown at you was aimed at you so you can duck or dodge them because they are thrown above the head and the medicine ball is also thrown above the head so you cant take real evasive action therefore you do miss out in leg workout. The fights are weird though unrealistic but nevertheless fun however I am enjoying the gym workout more at the moment. The instructors pad workout is confusing when he calls out the numbers and cant seem to understand it. Still very enjoyable game. I tried the advise given to me by the development team but I am still getting same problems. The training in reflex alley the dumbbells and medicine ball are too far above the head. I adjusted the height and stood in the green spot however the green spot is hip high. Does it have to be flat level on the ground ? Please reply\n\nHelpful | 0\nDeveloper ResponseDec 2 at 7:28 PM\n\n*UPDATE* The green spot should be significantly lower than that, so it seems that height calibration is not working properly. Can you please try re-calibrating your headset's play area via the built-in Oculus software to ensure that the ground is being properly tracked? The in-game height calibration will not work properly if the headset's ground height calibration is not accurate. Once you re-calibrate via the Oculus software, height calibrate again in-game and it should work properly. Thanks for reaching out! *OLD* Hello! Glad you are enjoying the game. For the problem you are having in Reflex Alley, can you try re-calibrating your height to see if it fixes the issue with the dumbbells going over your head? You can find this option by going to the main menu of the game and heading over to the settings menu. If you are not at the main menu, you can also find the option within the pop-up menu (the one you opened to finish the tutorial). In addition, when launching Reflex Alley, try to stay centered within your play space (in the \"ready-up\" screen, there is a green circle under you that shows you your playspace's center). Moving too far forward or back will negatively affect the trajectory of the objects. Hopefully that helps!", "xanerkingJan 20 at 10:04 AM\nGreat game\n\nGreat game to get exercise while having fun but if you do not want to be sore then dont get this game\n\nHelpful | 0", "angel.howell2Dec 8 at 12:00 PM\nMy favorite exercise game\n\nSo far Ive played creed, thrill of the fight, and this one. Knockout league is by far my favorite boxing game. I love figuring out how to beat characters. Just when you finished everything, then comes grudge level where it got harder. Ive been playing this game almost everyday in place of my normal cardio session. This is by far the most fun way of doing cardio that Ive ever done! Give this game a chance, you wont regret it.\n\nHelpful | 1", "StrayBullet11Jan 18 at 7:02 AM\nBest version\n\nOk so Ive tried the ps4 version but I couldnt lean all the way to the left now I can so 5/5\n\nHelpful | 0", "GraemeEvansOct 17 at 3:59 PM\nGreat boxing game with one issue\n\nLove this game on pcvr and very glad its come to the quest. Plays just like the original and doesnt feel like a downgrade. Anyone who liked Nintendo's punch out games will like it.\n\nThe one thing i think this game needs to make it perfect though is something i hope they add, hand tracking.\nPlaying with vr controllers on any platforms feels like a liability and it is always in the back of my mind that playing this i could accidentaly destroy my controllers at any moment. Even from briefly playing this i smacked the headset with the controller ring. To really be able to play this game and feel like i dont have to hold back or be worried it needs to make use of the oculus hand tracking thats coming up. If the developers add this then its a 5/5 game for me.\n\nHelpful | 4", "Jude2011Jan 23 at 11:02 PM\nJudes com\n\nI like this game make another game like this plz thx\n\nHelpful | 0", "aherbezNov 1 at 1:25 PM\nOverly-gamified, not real boxing\n\nI really wanted to like this game, but was ultimately really disappointed. The fight mechanics are extremely gamified and arcadey- most of the time, you're forced to sit there with your guard down waiting for just the right moment to throw up a block. Have your guard up too early and you might as well just give up the fight. I eventually got through the first opponent, but didn't enjoy it anywhere near as much as I had hoped to.\n\nThe training minigames are really fun though.\n\nHelpful | 4", "ReconV2Oct 19 at 3:44 AM\nTake time to appreciate.\n\nFirstly, if you dont like the fighting switch to training like heavy bag and the alley game, those two are amazing. Anyways, I bought this with the idea that Id probably return it since I own it on PCVR and could not really get into it. Ive decided that I have to keep this one because Ive been having a blast ducking, punching, dodging, and sweating. The fighting frustrated me for a bit until I started to find the tells that help me win. Every time I play this game I break it a good sweat and the calorie counter is a nice touch. As someone who will also be buying Thrill of the Fight and owns Creed, this game compliments the other two just fine and the training is actually a blast.\n\nHelpful | 8", "Artificial_HousewifeOct 17 at 12:13 PM\nPlease fix the tutorial.\n\nIt is bad enough that you went back to 2007 with annoying, unskippable tutorials but you also make them super sensitive as well? I am punching the trainer and nothing is registering. Why waste people's time by assuming that they are morons, in the first place? I am in a well lit room. There is a super small window where it accepts punches after the slow mo dodge and each time, it won't accept the punch until the last second. Then after the overheads, it refuses to respond to any punches at all. He just keeps saying over and over again that I have to punch after blocking. I end up just flailing my arms inside the model of the trainer until something registers. If this is not a glitch, than this game has serious issues as I have never encountered any problem like this with Creed (which was also nice enough to leave you alone and let you play the game)\n\nI am giving a 3 star only to allow for the possibility that this is a technical issue and will be fixed at some point.\n\nHelpful | 21\nDeveloper ResponseOct 17 at 1:02 PM\n\nReally sorry about that. During that part, Doug wants you to punch his pad when he holds it up, not him directly. There's currently an issue where the indicator meant to direct the player's attention to Doug's pads is not implemented (Doug's pads are supposed to flash green during those parts). We're looking into addressing this indicator issue.", "lukas.nemy.1Nov 11 at 2:13 PM\nStill in beta?\n\n- game mechanisms are unfair....most of the time you need to do really full squad to dodge an attack..results in ridiculus boxing style.\n- half of the time hitting spot is not detected just because your punch does not landed at perfect distance.\n- no time to read fighting tips before match..I would like me to press \"fight\" when I am ready\n- overprized considering amazing \"Thrill of the fight\" is now on the market\n\nHelpful | 4", "supergroulxOct 23 at 9:01 AM\nLots of potential once the bugs are out\n\nDefinitely fun to play and has all the trappings of a great workout game But the physics of the game are still suspect\n\nWhen my virtual gloves make contact with the opponent I expect there to be a reaction\n\nLiterally at times my fist will go right through the opponent\n\nBasically there are rules to how the physics in the game works That are currently very strict and not intuitive. Right from the initial training session it becomes a lesson in agony to time youre blocking down to the microsecond to satisfy the needs of the AI\n\nIm sure things like this and other little bugs like a momentary accidentally hit the X or Y button will exit you right out of the match against your will\n\nHelpful | 5", "PieMan69Oct 22 at 4:23 PM\nNeeds a rework\n\nThe beginning of the game was very fun and active and had some very interesting and fun combos from the opponents. This is not the case when it comes to Showtime, the showtime fight is not fun, interesting, or active at all. This fight relies almost entirely on blocking and reaction time which would be fine...if the blocking mechanic wasnt so mediocre. You need to perform perfect blocks all the way through showtimes combos or dodge the first parts and perfect block the last hit; but, the gloves arent very sensitive so youll block one move, move to block the next, and it will turn to a weak block and you will most likely get hit due to the block stun. So to make the endgame and more specifically, please rework the Showtime fight, or increase the sensitivity on the gloves movement in order to block properly.\n\nHelpful | 4\nDeveloper ResponseOct 22 at 7:38 PM\n\nHey there! I'm glad you were enjoying the game initially but I'm sorry to hear that Showtime has dampened your enjoyment so much. To help with blocking multiple hits in a combo, a tip I want to give you is to \"reset\" your hands fully after a block to ensure your next one will start strong. I like to do this by bringing my hands down to around chest level before blocking again. If you accidentally keep your hands too close to your head for too long then your block becomes a weak one. Now, that can be a bit harder to do against someone with quick combos like Showtime but it's definitely possible. If that doesn't help (or you're already doing that) then I have some other tips. Feel free to update your review as a response and I'll respond as well. Thanks for the review and best of luck against Showtime!", "Emilian1978Oct 21 at 12:24 PM\nFun but almost 0 workout motivation\n\n2 stars basically divided between the good graphics of the unreal engine and the good tracking implementation.\n\n-1 star because the fights are lame. You could just stand there, block and hit back. If you actually try to attack, you're often gray and you're only hitting the air. This bad feeling took 1 star away. If I want to fight, I fight . To the developers : try the PS boxing games and learn. Remove the gray nonsense.\n\n-1 star because I cannot see a total of my burned calories today and this week. No goals settings and ... I want to set my workout to 8 minutes but it jumps from 5 to 10... WHY would you do this? Ffs\n\n-1 star because on normal and hard training levels the balloons are coming on top of eachother and your actually hitting the Quest controllers with eachother if you try blocking and punching. This will cause physical damage to your controllers.\n\nMy conclusion? Update your game! I will not refund it just to support the developers. Maybe they will update and improve this title in the future. I will change my review accordingly.\n\nThank you for reading.\n\nHelpful | 19", "HalldinOct 17 at 12:30 PM\nGreat cardio\n\nThe training mode alone is worth the money. If you want to earn 5 stars, throw in a very hard mode for even faster punches in Heavy Bag, and add some more mini-games.\n\nHelpful | 4", "ParadiseDecayOct 22 at 2:22 PM\nAs good as PC/Rift Version!\n\nMy Initial Thoughts:\nAnother fantastic port from PC and another great arcade title.\nMy Initial CV1 Thoughts:\nViewers of my channel will know I'm not a fan of sports titles in computer games, however I am constantly being surprised by the immersive nature of them in VR.\nKnockout League is another VR sports title that has blown me away. The realism of being in a boxing ring, with a real AI player is amazing and oppressive and should be experienced by everyone.\nA really good workout as well, I managed 2 hours in Sprint Vector before being tired out, in Knockout League I was whacked in 20 mins. :)\n\nOculus Quest Gamepaly Video with Commentary:\nhttps://www.youtube.com/watch?v=bNmrPpr1XJQ\n(Please Note: Links might not work from oculus so please search YouTube for 'Paradise Decay VR Knockout League')\n\nMy Initial Impressions Video Here (Oculus Rift CV1):\nhttps://www.youtube.com/watch?v=-n6bEDv3vv0\n\nHelpful | 1", "getwreckedson11Dec 25 at 3:31 PM\nMy dads favorite!\n\nHe hasnt played much, but when he played this he was sweaty after one match, its good!\n\nHelpful | 1", "ezesippinteaOct 26 at 6:20 PM\nPlease fix the out of bounds zone\n\nPretty fun game and very polished except it is too easy to get out of bounds during a match. The game just freezes and your hits dont register. At the least please draw a box on the ground so the player would know if they are too close to the line. Otherwise well made and worth it. Has mini games, leaderboards, and everything else to make it feel like an actual game.\n\nHelpful | 2", "just73grayOct 18 at 11:17 PM\nFun game overall!\n\nIt really is an enjoyable game but the tutorial is incredibly frustrating!! There were zero instructions to hit the trainer's pad after you dodge. Finally after 5 straight minutes of hearing \"nice dodge but you have to punch\" I figured out what to do! It beyond frustrating and not only did I want to throw the remote at the trainer...I almost considered asking for a refund! It also logged me out for no reason in the middle of a heavy bag training session and sent me to the Oculus home screen.\nSuggestions: It would be nice it there was a way to fast forward or skip through intros. Also I have only fought first boxer so I'm unsure if you have the ability to go back and fight the first fighter again? It would be a nice feature, so I can let my friends try the first level and not have to go through the entire intro all over again. But even with these few minor inconveniences I would definitely still recommend this game! It has a sense of nostalgia and makes you feel like you are right in the middle of the action! And if you enjoy the Ready2Rumble style boxing games you will most definitely enjoy this title. If the developers address the intro and the other few minor issues I would rate it 5 stars.\n\nHelpful | 0", "InfoJunkieOct 20 at 8:38 AM\nNot good, wait for Thrill of the Fight\n\nFighting is linear and pre determined, more like a puzzle game than a boxing game. Also, the game is horribly optimized for the quest as it glitches out when you try to dodge half the time. Once you get to sir octopus, dodges don't work and you lose. No replayability value. Save your money for Thrill of the Fight, it's a real boxing simulator, not a linear puzzle game disguised as a boxing game.\n\nHelpful | 6", "JazzelXOct 21 at 6:19 AM\nWow but.... out of bounds\n\nOk so the our of bounds should be a setting (on, by default) because when Im getting into the immersion the out of bounds mechanic ruins the immersion. In conclusion 5 stars if that can be a setting\n\nHelpful | 1", "Rubyroo276Oct 24 at 1:50 AM\nLot of fun\n\nIts like being in MT's Punchout when I was a kid. I have to take break after each opponent....not a kid anymore. Great way to grab a workout without leaving the house. Heart racing and breathing hard. Was even sore the next day. Definitely recommend. Just make sure no one walks by while your playing or they might get whacked.\n\nHelpful | 0", "tdB36Oct 21 at 5:23 PM\n11/10\n\nI'm finally glad that we are getting out of tech demos for the quest, this is one of the best exercises, and it is truly a wonderful experience. I may extend on this review once a I play the game 100% but im on the 7th boss of the game and I'm having a great time. Ps. To all you punch out fans, this is defiantly a need to buy\n\nHelpful | 1", "vkalitkinOct 23 at 3:25 PM\nEnglish subtitles\n\nPlease add option to enable English subtitles in game.\nI from Russia and can't understand English speaking when voice only, so I can't catch what to do in training. But if you add English text on screen when trainer speaking it will be possible for me to translate it and understand.\n\nP.S. Thank you very match for adding subtitles. Now I can read and understand what trainer said. Five stars now. Your game is great !!!\n\nHelpful | 0\nDeveloper ResponseOct 29 at 5:57 PM\n\nGlad you are enjoying it! We just put an additional patch out that adds English subtitles to the Focus Mitts training game too.", "John-De-RienzoOct 18 at 5:02 AM\nAmazing\n\nMuch better than Creed, love it so far, a few niggles that need ironing out but i'm certain the developers will listen and update. If you are unsure which to buy between Creed and this then it's a no brainer. Get this now. You will love it, burn calories, sweat and ultimately lose weight.....Win Win Win\n\nHelpful | 4", "ookeesOct 19 at 11:02 AM\nKnocks me on my butt\n\nI'm so out of shape. This game is killing me. Lol. It's a great workout. Takes a small learning curve for the unathletic but once you get it you start having fun. Definitely worth a purchase if you enjoyed super punchout back in the day.\n\nHelpful | 2", "MASTBBBOct 18 at 6:50 PM\nA really good game\n\nIts such a good game they even have a weight tracker the training is very fun and tiring also its a good balanced game of hardness and easy Im a short guy and I love how I dont have to struggle to reach stuff and theres a height messier it helps me a lot its a great game for the price you should buy it.\n\nHelpful | 1", "EastBayBossNov 8 at 9:33 PM\nMutha-effin-10\n\nI give this experience a mutha-effin 10! By far, the best workout, time spent per calorie, and realest I have ever experienced. Great sim, bobbin and weaving, speed technique and power. Great work team\n\nHelpful | 0", "KenyehWestOct 17 at 6:05 PM\nSolid sweaty boxing game\n\nDoesnt disappoint. Art style is cartoony and fun. Boxing mechanics are fun, and more complex than creed during fights.\n\nStay patient with the initial matches, youll need to learn the game mechanics.\n\nYoull have to manage block timing and when you can/cant block. Not as intuitive as Creed, but I feel it makes for depth and strategy, think Super Punch Out.\n\nThe training games are a lot of fun and varied. They get pretty challenging when you start cranking up the difficulty.\n\nLast but not least, yes youll be sweatin and youll be having a good time.\n\nHelpful | 1", "GeorgeCaruthersOct 19 at 12:36 PM\nA real workout! You'll be sore!\n\nI've played this game for about 5 hours so far and I'm having a lot of fun. I enjoy training on the hitting mitts because it feels like a real boxing workout. I've had no issues with this game and still continue to play this for a long time. I haven't made it through the story mode yet because some of these bosses are truly challenging before I learn their pattern. This is the first app to make my quest uncomfortably sweaty. Highly recommend. Only criticism I have is that I feel like dodging needs some fine tuning. Works 95% of the time but sometimes I swear I'm out of the way of a punch!\n\nHelpful | 0", "OldowlOct 21 at 10:39 AM\n\nThis games graphics are some of the best on the quest. Its also has a cool calorie burning counter as you play if you want to use it for fitness. Anyone who could not understand that you have to hit the pads in the tutorial in a boxing game... should not be allowed to leave reviews.\n\nHelpful | 0", "elcomodinOct 25 at 11:03 AM\nNeeds serious mechanics updates\n\nNot convinced. The idea is good the mechanics not so much.\nYou cant move within the ring. Half of the punches its like nothing.\nIts an initial release definitely needs serious updates\n\nHelpful | 4", "VRFnaticOct 18 at 5:15 PM\nPremium VR\n\nI love this VR Game. Most stuff ive played feels like demos, but KO League is a full game with lots of features. Ive actually been spending most of my time playing the mini games, thats my new workout. It took me about 6 hours to complete the full game, but I will still go back and fight the characters on a more difficult setting. I highly recommend this game!\n\nHelpful | 0", "Dittoman17Dec 4 at 1:16 PM\nFun alternative to other boxing games\n\nQuirky,fun and alot of exercise. Reminds me of punch out.\n\nHelpful | 0", "sumoraoDec 15 at 9:48 AM\n\nVery intense and exciting\n\nGives me a VR workout\n\nHelpful | 0", "DrPeestainOct 18 at 8:56 AM\nPunch Out! in VR\n\nAwesome game. I loved it on the PSVR, and it's even better here without those pesky cables. Just remember, this is a not a boxing sim. It is an arcadey rhythm/pattern based boxing game just like Punch Out.\nPretty good training modes, too....to get the blood flowing\n\nHelpful | 1", "Jasekopi9Oct 20 at 8:43 AM\nIncredible experience\n\nOMG I love this game! The fact that you have to learn about how your opponent acts and time your attacks, blocks, and dodges reminds me so much about a classic arcade game called punch-out! I dont know how you view this game, but I think its incredible!\n\nHelpful | 1", "KillahKonceptZNov 2 at 3:09 PM\nLove it!\n\nReminds me a little of Punch Out ...but waaaaay better because you are the controller. I'm only two fighters deep but so far I'm really diggin it. Nice graphics and fun/challenging gameplay!\n\nHelpful | 1", "IKnoWLiquorOct 20 at 1:12 PM\nSuper fun workout\n\nThis game is basically Mike Tysons Punchout in VR. You are in one spot the whole fight but even not moving this game is gonna break your body if u arent in shape. I havent had any issues with tracking or anything also major. Definitely worth the money\n\nHelpful | 1", "B055M4NNov 5 at 12:03 AM\nFinally fixed!\n\n(Updated Review) - thanks to the developer the issue with my fights were the game would freeze but game sounds would continue has been fixed in the new patch. Great game!\n\nHelpful | 1", "NickMajoraOct 19 at 12:52 AM\nOkay\n\nA boxing game that punishes you for keeping your guard up is insane but the presentation and training options are great.\n\nHelpful | 2", "Chris180Nov 17 at 9:06 PM\nAwesome arcade boxing workout\n\nPlease add DLC wit additional opponents\n\nHelpful | 2", "TwomixOct 23 at 2:46 PM\nLess realistic more fun!\n\nI actually prefer Knockout League as a VR workout app than Creed although when it comes to fight realism Creed is much more realistic. It would be cool if somehow you can play custom music during the workout.\n\nHelpful | 1", "clubamericalaraOct 17 at 9:05 PM\nThe successor of arcade boxing\n\nThis totally reminds me of old school boxing games with storylines and coach. The gameplay makes this the most enjoyable boxing experience on the quest.\n\nHelpful | 2", "Azazel08Oct 23 at 2:09 PM\nGreat game for fun and a workout!\n\nIf you liked Mike Tyon's Punch Out then you will happily enjoy sweating in this game. Crazy characters, a fun story, good training mini games, and well written trainer dialogue = a winning combo.\n\nHelpful | 1", "djman345Oct 26 at 12:52 AM\nCreed is better\n\nIt doesnt feel as fun or exciting as creed\n\nHelpful | 2", "dustywebsOct 24 at 3:31 AM\nVery fun!\n\nI agree with most other comments here, this game definitely gets you really active. I really enjoy the mini games over the specific fighters. Overall way better than the Creed game.\n\nHelpful | 1", "KJ-_-Oct 17 at 11:04 PM\nWorth it\n\nVery arcade style game. Training was really fun. Theres lots of different moves to dodge and overall a good experience so far.\n\nHelpful | 2", "kelly309Oct 20 at 1:03 PM\nKnock out league\n\nI just bought my game two days ago and it keeps repeating its self like it is stuck or something I dont know about anyone else game but thats how mine plays and if the problem is fixed I would like to keep my game but if I dont get a response from oculus soon I will request my money back.\n\nHelpful | 1\nDeveloper ResponseOct 21 at 11:18 AM\n\nSorry about the issue you are having. If this is referring to your trainer in the tutorial telling you to punch back, but then seeming to be unresponsive when you punch at him, try making sure to punch his hand when he holds it up. For training purposes, he wants you to punch his mitt after dodging or blocking. If you're having a separate issue, let us know by adding more info to your review and we'll try to help you out.", "MisterTucoOct 23 at 2:19 AM\nCan not start the game\n\nWhen i launch the installation on my quest, the system announces me 35 mo of data to download. This volume is largely exceeded, to go to 1GB. Then the system tells me that the game is installed.\nOnce this installation done, when I try to launch the game, I have a message that appears \"update in progress - leave the device connected to the wifi and leave it plugged in\". The game pauses and nothing happens. Can not start the game.\nI tried uninstalling the game, reinstalling it ... uninstalling the oculus app on my phone, reinstalling it and restarting the installation ... nothing works.\n---------------\nThanks for your response.\nI fixed the problem. It come from the update of my quest. I made some reboots of the device yesterday with no succes and this morning, i don't know why, the update finish during the new reboot. And the game work perfectly. Thks.\n\nHelpful | 1\nDeveloper ResponseOct 24 at 1:06 PM\n\nGlad to hear it's fixed! If you've had a chance to play the game a bit, we'd love to hear your updated thoughts.", "darkescoOct 23 at 10:52 PM\nReally Good!\n\nExercising in VR is not as odd as it sounds. This game is great cardio. I love the characters and the style. Definitely deserves 5 stars!\n\nHelpful | 1", "Okami77Oct 24 at 1:45 PM\nPunch out league !\n\nOne of the best Vr games, speed, technical and addicted. See it here https://www.youtube.com/channel/UCR42q7521MpdYsF-DYi-bmA\n\nHelpful | 1", "diomarkOct 22 at 2:55 PM\nToo reactionary!\n\nPunch's don't register unless you actively block which is annoying.\n\nHelpful | 3", "hud101Oct 28 at 3:23 PM\nSuper fun!\n\nMy 9 year old son loves this game! He gets a great workout and has fun while doing it!\n\nHelpful | 1", "jayisspillz94Oct 19 at 4:35 AM\nIt's a k.o\n\nI own Creed and this game. Both fire af. A must buy if ur a punch out fan.ready to rumble meets punch out. Awesome.\n\nHelpful | 1", "Wario_FartsOct 18 at 4:28 PM\nReminds Me of Punch Out\n\nThis game is just like Punch Out with every opponent you have to figure out there moves. Also a very good workout.\n\nHelpful | 1", "GetVRFitOct 22 at 6:57 AM\nGreat Game\n\nFun game and makes you sweat. Make sure you have a towel and a sweat guard on your Oculus Quest.\n\nHelpful | 1", "E-ZOct 20 at 9:19 PM\n\nBest boxing game on vr its just like punch out Amazing;)\n\nHelpful | 1", "StevenKazooieOct 20 at 8:55 PM\nAnother great workout game!\n\nHeaps of fun and itll make you sweat! :-)\n\nHelpful | 1", "Bullkiller839Oct 23 at 10:25 AM\nThis game is awesome\n\nIt hard but good\n\nHelpful | 1", "NrSevenOct 22 at 11:19 AM\nGreat workout game!\n\nYou will get sore!\n\nHelpful | 1"]