{"App Title": "Last Labyrinth", "App description": "SAW meets ICO in this haunting and intimate title.\n- Experience a unique relationship with Katia, a girl who speaks a language you cannot understand (Stefanie Joosten, Quiet from Metal Gear Solid V: The Phantom Pain) and music by Hiroki Kikuta (SECRET OF MANA, SOULCALIBUR V)\n- 10+ hours of escape-adventure puzzle-solving, multiple endings.\n- Veteran team alumni from classic titles such as ICO, The Last Guardian, Shadow of the Colossus, Puppeteer etc.\n- Cross-Buy between Rift S/ Quest\n\nEscape a merciless mansion alongside a girl words cannot reach, in a tale that can only be experienced in VR.\n\nDirector/Producer: Hiromichi Takahashi (Doko Demo Issyo, 1999),co-creator of Toro\nCo-Director: Tetsuya Watanabe (Puppeteer, The Last Guardian (in-game physics))\nLead Animator: Atsuko Fukuyama (ICO, Shadow of the Colossus)\nLead Environment Artist: Michiko Kusaba (Gran Turismo 3:A-Spec, Gran Turismo 4)\nSound Designer: Takuya Hanaoka (Monster Rancher, Super Robot Wars series)", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Puzzle", "Languages": "English, Chinese (China), Chinese (Hong Kong), Chinese (Taiwan), Dutch, French (France), German, Italian, Japanese, Korean, Portuguese (Brazil), Russian, Spanish (Spain)", "Version": "1.02", "Developer": "AMATA K.K.", "Publisher": "AMATA K.K.", "Website": "https://lastlabyrinth.jp/en/", "Release Date": "November 12, 2019", "Developer Privacy Policy": "None", "Space Required": "1.69 GB"}



["5 stars\n55%\n4 stars\n20%\n3 stars\n10%\n2 stars\n6%\n1 star\n8%", "MagnumVonEviltonMay 14 at 5:23 AM\n2spooky4me, but a fantastic base\n\nI love puzzles and escape rooms, but I have a low tolerance for spookums. But I heard great things about this game, so I thought I'd give it a shot.\n\nI've been very happy with my play time (I've just past the 'ratio' puzzle, which was difficult but enjoyable), although I admit to quitting and restarting when I fail a puzzle because I'm a coward.\n\nThe core concept of the game, you are locked in one place and guide a little girl around with your laser forehead have nodding, is really cool. The girl is well designed and immediate triggers the PROTECC! instinct, which gives even simple puzzles additional gravitas.\n\nAs I said in the title, this game might be a bit too spooky for me. The way you are locked in place makes death scenes incredibly intense, hence me quitting instead of sitting through them. As a note to other potential players like me, sometimes competing a puzzle correctly will still trigger things like you failed, but will stop short of killing everyone. This makes sense from a thriller game perspective, but makes little sense in the context of the game. (If the girl isn't fast enough jumping out of the way, does she just die? Even though she did everything right?)\n\nIn summary, this is a really cool concept for a game with great puzzles and is highly effective at creating a spooky/scary atmosphere. It may not be the perfect game for me, but if you like spookums and puzzles you'll probably love it. I plan to finish the game, but I'll probably keep restarting when I know I've failed like a little baby. I hope to see more games of this style, but maybe with the spooky toned down.\n\nHelpful | 62", "Mark-Bliss10 days ago\nTo difficult\n\nThis game is very unique and starts out showing very good graphics but as the game progresses the puzzles become so hard that theyre almost impossible. There is one room with lasers, a room with scales, and a room with a game similar to a checkerboard and they are terribly difficult. It takes the fun out of the game. I had to get online and look up the answers and I still cant find anyone who has posted anything about the laser room or the Checkers room.. I wanna game I can actually play and win not one that I get frustrated with and just quit\n\nHelpful | 1", "2forflinchingMay 10 at 11:47 PM\nSuper creepy and fun!\n\nIm not finished playing the game but just got so engrossed in the first attempt that I ran the battery out on my Quest. Ive never done that before.\nAfter the second room I purposely started to fail rooms at least once just to see how many different ways they were going to kill me. Inventive to be sure! The puzzles are mostly engaging. A few super hard ones, a few relatively easy ones, but most of them are just kinda perfectly challenging. I love the concept and execution for the most part.\nThe downsides of the game are that- I dont like anime- so the girl kinda annoys me. Mostly because I dont understand what shes saying. Which- is actually built in as part of the game play- which is rather clever- but Id still like a subtitle option even if she doesnt understand me. The 2nd sort of annoying part is having to go through all of her wandering around and not paying attention to my laser pointer when weve already died however many times. Id like to be able to just skip back to the beginning of the puzzle and get on with it. Overall though- neither of these issues are enough to seriously detract from the game. Fun, clever, a bit gruesome and surprising, and thoroughly enjoyable so far! SOOOO glad I have tomorrow off work and run my battery out a few more times if need be!!\n\nHelpful | 3", "Mar_Coeur_AnApr 23 at 9:56 AM\nUnique and challenging experience\n\nSuch an odd game, extremely violent and unforgiving as well. Graphics are great and the story is one you have to peice together, gathering more insight depending on the actions you take during certain impasses in the game. I like how they correlated the puzzle and story progression with the major arcana from the tarot and the main story points with the kabbalah, there's a lot of depth here and metaphors for what the labyrinth is are there for you to uncover. It's personally one of my favorites for the quest, you can tell the developers put a lot of effort into this, with it's own beautiful but creepy theme song sung by the voice actress for Katia, the girl. You really feel like you're a mute prisoner in a wheelchair looking down at your bound hands and motioning to the girl with your laser! Amazing game, challenging puzzles and many paths to take and choices to make to get all the pieces to the story. I've put in over 8 hours and haven't uncovered it all. I did buy it on sale, and would recommend you do the same, got it for 30 instead of 40, 30 is worth it for sure. Either way, such an amazing experience!\n\nOne thing I would like is to have english subtitles for the girl, as I know she's saying things that would serve the storytelling, I dont know much Japanese but I understood her talking about flowers at one point when I motioned to a painting of them. Still, the story can be understood without words. Also perhaps a level select once you finish the game so you can more easily go back to make different choices during the face-offs with Katia and the phantom character instead of playing through puzzles you've already beat before and having to remember which paths lead to which encounters. But I suppose that is the purpose of a labyrinth...\n\nHelpful | 12", "robyescombeMay 27 at 12:08 AM\nTraumatising! But still excellent!\n\nI prefer my puzzles a little less intense, but the concept is so compelling, I keep coming back to sit in that darn chair... A really fascinating and really weird jaunt.\n\nHelpful | 2", "HexBlehMay 19 at 10:25 PM\nFantastic game\n\nexcellent puzzle game with fun and tense interactions. I'm too tired to write a full review right now but I'd give this game a 9/10 plays lovely , you get attached to this character which adds a stronger sense of something to lose during challenges. My only complaint would be (SPOILERS) about the dobutsu shogi segment with the syringes. Most of the game was held in a stalemate between me and the bot , and when this would happen they would just end the game and poison either myself or the girl . And even when winning the first round , the girl still got stuck w the needle and I ended up losing on purpose just to see what would happen . From what I've seen it doesn't seem like there's any way for both of the characters to survive this scenario and it just ended up really confusing me as to what's actually happening in the story since it rolled the credits after this whole scripted sequence and then places you back and ready for a new level. Maybe I'm just not far enough into the story to understand ? either way it just didn't feel rewarding to play knowing that no matter what I did , all that time I put into playing this childrens board game against a bot that refuses to lose would just be rewarded with a punishment ? that's really my only complaint , I felt kinda cheated in that moment and had I had known a stalemate meant she would die , I would've just lost over and over on purpose .\n\nHelpful | 2", "equal2uMar 28 at 9:09 PM\nAwesome Game\n\nExcellent game. However, if you didnt like blood and gore, this game can be disturbing. The escape room puzzles are great. They are challenging and stimulating. However, I would have liked if there was a skip button if you cant solve a puzzle. However, I eventually solved all of the puzzles because I couldnt skip them. This gave me a good feeling of accomplishment.\nI hope this developer creates another game similar to this one.\n\nHelpful | 21", "JimZMApr 10 at 2:47 AM\nslow and frustrating\n\nPros:\n- good graphics & atmosphere\n- cute character/voice\n\nCons:\n- you are confined to a wheelchair (can't even tell the girl to push you around)\n- you likely have to watch the girl (and yourself) die in gruesome ways\n- awful controls, with super-slow unskippable animations, which artificially stretches playtime by about 5~10 times, which might be fine if you like a casual experience, but it often makes the puzzle a frustrating experience.\n- mediocre puzzles (plus a few good ones), and you have to solve them in your head before you direct the girl to take actions, because the actions are super slow, and any mistake causes you to restart the whole level all over again, and you can't use pen & paper to help solve it (because VR).\n\nHelpful | 8", "MrDonnieXApr 21 at 11:37 PM\nDisturbing but amazing!\n\nDefinitely SAW meets ICO. Some parts are disgusting, especially when I am forced to go head to head with the girl to see who survives. The puzzles are so hard. There's no instructions on how-to, so trial and error as you go. Die lots. The Quest version doesn't have subtitles so I can't understand what she is saying. Don't know if that's part of the game. This is the longest VR game I've ever played because you actually have to take the time to figure out the answers to the puzzles. The girl is pretty slow though, wish I can control her, directing her with a laser is a pain, she can be a bit stupid, ha ha, get killed. But overall, it's pretty good. Amazing!\n\nHelpful | 2", "michael.heinen.5602Jan 17 at 4:16 AM\nEscape room with japanese horror\n\nIf you love escape room adventures as much as japanese anime and horror movies, then this game is definitely for you.\n\nThe game doesnt need much explanation at first since the controls are very basic. Most of the riddles can be solved within a few minutes. But some can be really tricky, esp. since there are no real hints or walkthroughs on the internet.\n\nThe fact that you will have to witness several times how a cute, little girl gets executed in all kinds of brutal ways, might be disturbing for some. If you die you get the chance to try the same puzzle again or to choose a different room which you visited before.\n\nThe graphics could be a bit sharper, but its sufficient for the main purpose of the game: to solve different puzzles in a spooky horror theme atmosphere. If you are very much into that, even 40  seem to be worth it. Compared to other Quest games it might be a bit overpriced though. Maybe it would have been wiser to offer a basic version for half the price but also fewer rooms and to add some storylines as dlc for those who are willing to enjoy and pay for the full experience.\n\nHelpful | 37", "Kaosgamer40Feb 28 at 11:08 PM\nTied up\n\nWell we all love VR and recently I had surgery done that regulates me from gaming. All except this game. I like a little of the dark side and getting your brain to work a little bit. But I even liked this game before my surgery. So if you think your good at brain teasers give it a shot. But beware, if your wrong your gonna pay the price!\n\nHelpful | 5", "rharrell1969Apr 15 at 8:02 AM\nLast Labyrinth\n\nExcellent title with great replay ability\nThe puzzles are challenging but not too hard\nI really enjoy this title\nDefinitely one of the better puzzle games on the Quest\n\nHelpful | 2", "NeroFyreMay 21 at 1:06 AM\nGood concept\n\nI like the idea and hours it works. I hate how looooong it takes to get back to a point after restarting. 5 stars anyways for great set up.\n\nHelpful | 1", "anthony.bartolusMay 29 at 8:07 PM\nsuper slow game play\n\nthe game play throughout the puzzles are slow, and the puzzles aren't teally that tough. I was very disappointed when they wouldn't refund my money.\n\nHelpful | 0", "smsme2222May 24 at 12:12 AM\nExcellent game\n\nI absolutely love the interaction in this game its challenging and fun!\n\nHelpful | 1", "RaqumupMar 21 at 8:52 PM\nEntertaining\n\nYou really get the sense of being strapped into a wheelchair and not able to move. Good, challenging, creepy, scary, WTF, moments throughout this game. If you like figuring things out and puzzle type challenges. This game is for you.\n\nHelpful | 3", "madvoyerJan 4 at 10:18 AM\nGreat immersive puzzles, but 1 big flaw\n\nI have played and greatly enjoyed Last Labyrinth from beginning to end. I thoroughly enjoyed the puzzles which I thought were very creative and unique. I enjoyed the variety of them a lot, as well as the, *cough*, cinematic sequences.\n\nAs you'll read in other reviews, the game can turn out to be quite slow. Meaning you'll ask the little girl to do actions and they're going to take quite a bit of time to execute. This in itself isn't too much of a problem, as it contributes to the mood and the suspense of the scene and I think it helped make the game feel a lot more immersive. Where it becomes a problem is when you have to redo entire series of puzzles to get the various ending. This process is very tedious, especially if you forgot the solution of a problem you previously solved and seeing a puzzle progress slowly a 2nd, 3rd or 4th time can be excruciatingly slow.\n\nAll that said, for people pondering if they should buy the game despite this issue, I really think you should. For the simple reason the game has great puzzle design, is very immersive and that those alternate endings are completely mandatory. There is no experience like it at the moment, and it definitely IS an experience worth living. I would just recommend not going through the grunt work of getting every ending, and I think you'll have a good time.\n\nA big shout out to the devs for creating this very neat game. I'm definitely going to be looking to your future projects.\n\nHelpful | 19", "galangelMar 18 at 12:02 PM\nfun game\n\n4 stars because a lengthy part of the game i had to look down playing that board game , uncomfortable...\n\nHelpful | 3", "borisb.borislavMar 24 at 1:01 PM\nVery addictive\n\nFour star and its only because no matter what languge you select the girl keep speaking Japanise (or at least I think it's Japanise). The game is great, puzzels are very thoughtful.\n\nHelpful | 1", "jaydegeerMar 27 at 9:16 PM\nToo pricey.\n\nGames is a good brain teaser escape room fun. But sorry way to overpriced, waited to long for refund. Never got it, but now I have what seems endless puzzles to solve.\n\nHelpful | 3", "DarknesspawnNov 13 at 1:43 AM\nBe careful. This game can be disturbing.\n\nIf you are anything like me you'll hop into this game and immediately become attached to the mysterious girl you find yourself with. Even if she somehow managed to scare you at first. Even if you restart the game thinking you got the language settings wrong but then realize she just speaks gibberish.\n\nThat's where the good and the bad of this game lies. The puzzles for me so far haven't been too difficult, but doing them with her make them all something bigger than they would be if I was alone. Though, if you do get attached you need to know that this game will put her in very dangerous situations while you sit there chained to your chair hoping everything works out. I've had to nope out of my quest a few times already when I've endangered her because of my lack of foresight. My guilt and distress almost made me stop playing the game when i started, and I wouldn't say i'm the easiest to disturb. So just be prepared to be made uncomfortable if you buy.\n\nHowever despite that uneasy feeling I get any time I enter a room. Despite the guilt I feel when i mess things up. Despite the times I throw my quest off my head and across the room to just to decompress. I find myself coming back to the labyrinth... So i can watch the waves crash against the cliff side with her just one more time.\n\nHelpful | 166", "KENDO60Mar 31 at 4:44 AM\nLove it.\n\nReal head scratcher at times takes me back to the saw films when I go to lift the quest this first game I think on determined to complete it .\n\nHelpful | 2", "Xxsummertime_9Feb 29 at 8:24 PM\nReally good\n\nIt's a really good game ,and if your not claustrophobic and doesn't have a weak stomach for seeing a lot of intense... .intense... montages I believe this game is for you\n\nHelpful | 4", "OlivierTofuJan 25 at 11:25 AM\nA really good escape game. Finally!\n\nI have been looking for good escape games on VR and never got satisfied... until I found this one. It's only 4 stars to me, because the limited movement contributes to diminishing the fun. I understand that it's part of the scenario, but the lack of movement is a bit disturbing. Furthermore, the game soon comes to an end. The difficulty of the puzzles is good, but there should be more of it.\nNevertheless a great game.\n\nHelpful | 2", "DalcohsApr 4 at 3:36 PM\nGreat puzzles!!\n\nFor me the first puzzle was hard because I way over thought it. Lol. It has been great so far and am over an hour in.\n\nHelpful | 1", "Wraith2021Nov 12 at 12:50 PM\nWay Better Than Expected\n\nWhen I saw this game advertised, I wanted it to be a traditional escape room game, something like this, but where you are the one solving the room by hand.\n\nI bought this not expecting it to be as good as it actually is. The sense of helplessness while strapped in a chair is really played on, and the mortality of the girl is always toyed with, even when completing a room. It is challenging, but not impossible, and there seems to be a backstory which unfolds as you get further through the game. Well worth a buy.\n\nHelpful | 176", "mentele27Apr 15 at 9:13 PM\nFor the price it's a waste of money\n\nA short rather silly game I wish I hadn't wasted my money on. It's not nearly as fun as Moss, Down the Rabbit Hole or Ghost Giant.\n\nHelpful | 1", "jzaslawDec 18 at 8:38 AM\nGreat Puzzles / Not Great VR\n\nThis game has a lot of great puzzles so far, which is what keeps me coming back to it, but as a VR game it is lackluster and feels lazy and clumsy. You would think that at the very least you would experience being pushed from room to room by Katia, but sadly you are removed from the immersive experience and simply left to watch it on a staticky tv screen. Solving the puzzles can be painfully slow at times because of the lack of responsiveness and slow movement by Katia. God forbid you make a mistake on one of the multi-phase puzzles and have to start over... ugh! They boast about 10 hours of playing time but that's only because of the slow as molasses movement through this game. Overall the game is worth playing if you like puzzles but I feel it's overpriced and not a great VR game.\n\nHelpful | 16", "GeorgehelenNov 18 at 8:04 AM\nFrustrating & annoying\n\nIm not one for writing many reviews but I felt the need on this game.\nIts disturbing and dark, very dark and probably not suitable for very young players. Its more like saw the movie with gruesome deaths scenes. So be warned.\n\nHaving said that shes an annoying obnoxious character, I find myself shamefully wishing she would just die and a new more compliant character appear, the constant nodding to give her approval when for the hundred times Ive pointed the laser in a certain direction is extremely frustrating and makes the game very slow, not to mention it gives me neck ache and a headache as the quest is heavy, Dont keep asking me to confirm by nodding or shaking my head when Ive pointed her in that direction in the first place for the umpteen time !\nThe concept of her babbling on and on in her language I get, its more to do with sign language and a nonsense language your not meant to understand .....but you could have made her deaf and dumb! I would had more empathy for her but instead I just wish she would do what I ask and shut up, I just mute the game I cant take her rambling on when Im trying to concentrate.\nAlso the character is very very slow at taking commands, which in turn leaves you bored and frustrated at the slowness of her reaction to comply. I find myself shouting at her to do as shes told or hurry up and die.\nSo the high price is not in my opinion justifiable....moss by comparison is visually stunning and would have and could have commanded a higher cost, republique is the same sit down gameplay and its half the price and visually the same (and you have more empathy for Hope than this girl!!) yet labyrinth is visually dull, even though the concept is dark, theres no music or verbal interaction...its boring, the puzzles are good and most quite challenging , but the girl is just plain annoying maybe if she wasnt there I may enjoy it more.\nIf it were half the price It maybe worth it but for the money I was expecting to be wowed and entertained but all I feel is frustration and I would gladly push this obstinate child over the cliff!\nShame,I did have high hopes for this game, its just in my opinion not an enjoyable game to play.\n\nHelpful | 31", "yanoty3DNov 13 at 8:26 AM\nSimple but effective\n\nIt is hard to define what this game is. The central game mechanics is a series of puzzle-solving, but the major catch of this game is the horror factor. You are constantly frightened by what will happen when you push \"that\" button. Definitely not for faint-hearted, but if you are brave enough, you will enjoy the fun of overcoming your fear.\n\nHelpful | 19", "BobbiHereJan 11 at 9:29 AM\nEnjoying ! Interesting concept\n\nFive star for the different concept in the gameplay. Enjoying the puzzles. Character is interesting. Not sure yet, hopefully without giving anything away, why she speaks in this manner. But, as I continue to play, maybe it will be clear. I havent completed the game yet. Thus far, great game, very enjoyable and different.\n\nHelpful | 1", "beauregardenerNov 15 at 5:06 PM\nFirst impression...\n\nWeird laser beam from forehead control, no hand controller use, language selection does not work, dialog is not in English, movement very restricted - you are literally bound to a chair. Game feels like long cutscene. Not worth $40.\n\nHelpful | 31\nDeveloper ResponseNov 15 at 10:15 PM\n\nHi! The in-game language options are for UI and Menu only; Katia (the girl you work with) speaks in a made-up, unique language, so not understanding her is perfectly normal, as one of the games main themes is \"non-verbal\" communication.", "BigFootStickNov 28 at 6:33 AM\nJuice Not Worth The Squeeze\n\nIts one of, if not the most expensive game on the quest and i was a little underwhelmed, cool puzzles, good story, exactly as creepy as i wanted, semi reminiscent of Silent Hill but my apologies for lack of enthusiasm for just a meh experience. Not happy i spent over 40$ for it hence the title of my review but Im just one man and one mans opinion. I hope the evolution of these games takeoff with more substance. I feel like this game was a little clunky too for only having a head pointer.\n\nHelpful | 4", "Der-DummyDec 5 at 3:24 PM\n\nThis game has a good variety of brain teasers and when you get them first try, you feel like a genius. I am already past the first part of the game and it has a lot of twist and turns where you feel like as the puzzle starts to make you doubt your answer.\n\nThe game is basically full of death traps that require a variety of problem solving tactics, attention to detail, and foresight. This game is honestly, pretty horrifying. Knowing that your life and a young girl's life is at stake.\n\nAlso, spoiler warning, the girl is speaking Japanese. Who knew?\n\nHelpful | 2", "h3dg3h0gNov 23 at 4:12 PM\nWas sceptical but pleasantly surprised.\n\nWhen I read the reviews saying you are bound to a chair I thought I'm gonna try this and then get the refund..... that never happened as got too engrossed in the game. The puzzles are becoming more challenging as I delve deeper in the game and the threat to the little girls life feels too real. Imagine a puzzle game where if you are not smart enough an innocent girl dies. Will leave the deaths as a suprise but as others have said this is not for the faint hearted.\n\nHelpful | 3", "dvt7Jan 17 at 4:22 PM\nDoing the same thing over and over\n\nThe game tricks you to go thought the same set of puzzles over and over again. By the time you realise it's all the same, it's too late to refund. It's still interesting to finish as a challenge, but not really worth it.\n\nHelpful | 1", "skm2Nov 19 at 6:34 AM\nDisappointing\n\nI had high expectations for this game. The result is mixed. A bit slow , puzzles sometime unclear and annoying. Especially when you have to start a room over and repeat the many steps again and again.\n\nHelpful | 11", "ChanelJoJan 10 at 2:19 AM\nA little scary but lots of fun.\n\nThis game is amazing. The fact that you just have to move your head to make the little girl do what you want is unbelievable. Please make more games like this one\n\nHelpful | 1", "friah.ogawa.5Nov 30 at 4:02 AM\nGreat concept\n\nThe game is great, it's painful to see her die since she's a child,,, but then it makes the game very interesting, she's the motivator to survive,,, she's speaking in Japanese but it's backwards, so I can feel very well how innocent she is. Simple game but for me, it's one of the best  you must try\n\nHelpful | 2", "VehjeNov 16 at 11:57 PM\nVery expensive\n\nVery expensive for what you are getting. Easy problems and quickly played through. Very annoying to play again as everything takes so much time. But i its pretty.\n\nHelpful | 15", "thoeriNov 13 at 9:36 AM\nVery well made game!\n\nI have just start the game\nand it is allready blow my\nmind, I do feeling sad everytime\nI am doing a misstake lol\nBut it make me more careful\nbefore I let her do someting.\nThank you for a great\nGame\n\nHelpful | 7", "erasmushurtDec 25 at 12:26 PM\n\nCreepy and original. It definitely has the feel out of something like Saw. As you kill the little girl repeatedly through your own blunders you can't help but feel a little bad about it.\n\nHelpful | 1", "sinkkingNov 17 at 2:30 PM\nGood brain exercise with a creepy twist.\n\nThis game made me aware of how underused my brain is and after a few levels I remember how to think again. The creepiness keeps you going and doing more puzzles. I can see this kind of thing being used in schools to keep the naughty kids entertained. Having the reward of progressing through the story is quite motivating compared to working on paper.\n\nJudging by the walkthroughs on youtube there is roughly 12 hours of gameplay which is good to know after spending 30 on this game.\n\nHelpful | 7", "veneniferDec 27 at 2:07 PM\nWonderful puzzle to play sitting\n\nI love how you think you have it figured out but it can still find a way to supprise you :) not enjoyed a game (either vr or non-vr) this much in a while!\n\nHelpful | 1", "steve-01351Dec 3 at 5:07 PM\nQuick waste of $40.\n\nI just bought and started this. It asked for a language and the controllers seemed to do nothing, so I hit the Oculus button to reset the view. It decided that I really wanted menus displayed in a completely unintelligible (to me) language. There doesn't seem to be any way to reset preferences. At least no way displayed in English, so I just spent $40 on something I have no idea how to use - or even decipher.\n\nHelpful | 3\nDeveloper ResponseDec 25 at 5:03 PM\n\nHi! We apologize for the issues; are you still having trouble switching menu languages? Please contact us with the details at pr@amata.co.jp if you're still having trouble and we'll follow up directly.", "Jayix_92Nov 18 at 12:59 AM\nPLAY THIS GAME\n\nVR is awesome, as we all know, but oh my gawd, this game is pronominal, its pretty dark, but still really good, I played for a straight hour and loved every minute.\n\nIts worth the money, trust me if you dont buy this your missing out big time.\n\nIf worse comes to worse you can always refund, but after you play I know you wont want to\n\nJust get the game and stop reading lol\n\nHelpful | 4", "SirRealDealNov 13 at 6:23 PM\nUnfortunately, She Will Die Horribly\n\nAnd you will too.\n\nI've never been a fan of escape room games but the gaming history of those involved in the making of this title piqued my interest.\n\nIt doesn't disappoint.\n\nExcellent presentation. You'll feel for this girl. Just get out of the rooms. If you don't... you both die.\n\nHorrible, GRAPHIC deaths.\n\nNot for the squeamish AT ALL.\n\nOne final comment.. always look for the blood spatter when entering a room for the first time. That's where she'll die when you fail. Good luck. You'll need it.\n\nHelpful | 13", "duked17Jan 1 at 4:44 PM\ntoo slow\n\nDecent game, but way to weird and slow for my taste.\n\nHelpful | 1", "MissirRayNov 16 at 7:26 PM\nBorderline snuff film\n\nThe violence against the young girl is intolerable. Puzzles aren't all that interesting.\n\nHelpful | 14", "sp4rk1ngc0m3tDec 26 at 12:36 PM\nVery dependent on the player\n\nLuckily, I love it, but it might not be the game for you\n\nHelpful | 1", "catnipmanNov 20 at 5:06 AM\n\nThis is a great game. Be warned though it's very dark and scary at times.\n\nHelpful | 3", "BtomaekNov 14 at 9:46 AM\ni got this because it a puzzel game\n\nthis game is a good-ish puzzle game and doesn't make you dizzy by moving about\n\nHelpful | 2", "soulripper1Nov 13 at 12:38 AM\nthanks\n\nThanks for sorting my query out about language the game looks good given it a 5\n\nHelpful | 26\nDeveloper ResponseNov 12 at 11:28 PM\n\nHi! The language the girl (Katia) speaks in game is actually a unique, made-up language for Last Labyrinth; you're not supposed to understand what she's saying, as one of the themes of the game is \"non-verbal communication\". The language options in game are for menu/UI only. Hope that clears things up! Please reach out to us anytime if you have any other issues.", "warrenlampkinNov 18 at 2:22 PM\nIt's good\n\nI like it\n\nHelpful | 1", "VorySoftNov 12 at 10:15 PM\ncrazy\n\ntoo uncomfortable\n\nHelpful | 20"]