{"App Title": "Layers of Fear VR", "App description": "Layers of Fear VR is a psychedelic horror game that pulls you into the depths of insanity. Now its constantly changing Victorian mansion can be explored without limits thanks to the all-in-one Virtual Reality experience of Oculus Quest.\nDelve deep into the mind of an insane painter and discover the secret of his madness. Uncover the visions, fears and horrors that entwine the painter and finish the masterpiece he has strived so long to create.\nRedesigned with Quest in mind for greater interactivity and immersion, Layers of Fear VR is a first-person horror game built on a rich, dark story. Explore an environment overflowing with macabre artwork and unravel secrets through twisted puzzles. Take control of a painter seeking to create his magnum opus before losing his mind in the process.\nThe psychological horror of Layers of Fear will leave you questioning your own eyes and mind. Dare you help paint a true Masterpiece of Fear? Put on your Quest and discover what awaits", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Exploration, Horror", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Polish, Portuguese (Brazil), Russian, Spanish (Spain), Turkish", "Version": "1.1", "Developer": "Incuvo S.A.", "Publisher": "Bloober Team S.A.", "Website": "https://www.blooberteam.com/layers-of-fear", "Release Date": "July 9, 2020", "Developer Privacy Policy": "None", "Space Required": "1.72 GB"}



["5 stars\n68%\n4 stars\n10%\n3 stars\n6%\n2 stars\n8%\n1 star\n8%", "powney1991Jul 9 at 3:15 PM\nLayers of fear! And they aint kidding!\n\nOk wow... as someone whos tried a lot of horror experiences and games in VR such as dreadhalls, affected the manor, the exorcist and what not I went into layers of fear tonight expecting another typical horror experience but nothing too exceptional... boy could I EVER have been more wrong!!!  Im just going to come out and say it this horror game/experience whatever you want to call it is UNBELIEVABLE!!! And a straight up psychological head wreck!!! From creepy sounds to crying, to slamming doors, to seeing dark figures walking around, dolls, darkness, hallucinations, things falling, going around in circles and feeling like youre going mad, my god this thing throws THE LOT at you!\n\nThe thing that separates it for me though from so many other horror experiences and games and what makes it stand out is the fact that when theres a horror scene theres multiple things happening around you! Its very easy in a horror game sometimes to miss something if you look the wrong way or in the wrong place but this actually registers where youre looking and will execute a scene based on that! Its clever and creepy as heck!! Theres parts for example where you might go down a corridor and reach a door. You then turn around and the scene may change then turn around again and its changed again which really makes your hairs stand on end and gets the blood pumping as youre expecting a scary scene to follow! Its crazy good and a real head wreck!\n\nAnd it isnt short! The game is LONG and there comes a point where sometimes it gets so scary and intensely psychological a part of you just wants it to be over but another part is telling you to plod on and keep going! I did about 5 chapters in one play though and Im absolutely exhausted from the horror and psychological factors behind the game!\n\nIt really gives you a sense and interpretation of why this is all happening too and sucking you into the story behind it! I cant recommend it enough to anyone who is interested and for me I now think this is the best horror experience on the quest money can buy! I really believe its that good! Just prepare yourself when you go in! Its not for the faint hearted! \n\nHelpful | 258\nDeveloper ResponseJul 14 at 5:41 AM\n\nWooow! Just woow! We are proud that we gave you so much fun and emotions with our game. Best regards from the whole team!", "kem423Jul 17 at 4:45 AM\nEerie, mind twisting but glitchy\n\nI am on chapter 4. I have played about 1.5 hours. The game starts out pretty calm with an eerie ambiance. As you gather pieces to the picture you are completing the levels of insanity increase. You feel like you are in the twisted mind of a madman. The story is grim and the visuals are good for a Quest port. There is a constant building of tension. You will often look one direction and then turn and look back to find that everything has changed.\n\nIt is not the heart pounding hide or run away feeling of Dread Halls. It is a great psychological mind game. You almost start feeling like you are the one going insane. I recommend playing with headphones.\n\nThe glitches: doors will often get stuck or not be able to grab handles and/or objects easily. Clipping is pretty bad in many areas and you end up not being able to move or the visuals jump around when trying to move. Object interaction isnt the smoothest.\n\nI would also turn off subtitles as it helps with the immersion when you pick up items to be read. If you need to read them more easily you can press your trigger and the subtitles for the object appear in type. Press trigger again and they are gone. Otherwise you can hold notes closer to your face and try to read the cursive handwriting and notes (better immersive feeling)\n\nI also turned off the tunnel vision as it breaks immersion for me. I dont usually get VR sickness so was fine.\n\n5 stars if they fix the screen stuttering, getting stuck and glitchy object interaction that break immersion.\n\n**Developers: are there multiple endings in the Quest version of LoF? I only get Endless. Before I keep going over and over and over again can you please verify if there are multiple endings? Great game just dont want to waste time again and again. Tried a walk through after beating it a few times and I still only get the one ending. Thank you.\n\nHelpful | 31", "exjraordinaryJul 9 at 1:10 PM\nResident Fearful\n\nWow just played about an hour so far and this is an extremely tense game. I would say the best way to describe it is Transference meets RE7, a great compliment. The graphics are fantastic 9/10 most of the items are interactive and the environments have a great amount of detail. Especially when the environments start changing and playing tricks on you. The audio is a 10/10 very atmospheric and great positional sound, the sound of lightning sounds just like the real thing and I like how the clock in the room gets louder as you get closer. I highly recommend a nice set of headphones as you really get sucked into the game. Horror games are my thing and this and fnaf in the same month is awesome. Its amazing getting big PC level games on the quest and cant wait to see how this story plays out.\n\nHelpful | 30", "Gamertag_VRJul 9 at 11:51 PM\nPSYCHOLOGICAL HORROR COMES TO QUEST\n\nFULL LIVESTREAM WALKTHROUGH AVAILABLE BY SEARCHING GAMERTAG VR\n\nIve played this game on PCVR well over a year ago and the transition to the oculus quest is both welcome and impressive. Lots of detail, good controls, lots of options and is one of the most mentally intense scare games in VR. Its nice to have a lengthy VR game that isnt just about the jump scares, there is a good story here too (read the notes left around the house in game) and moments you wont forget for days afterwards.\n\nThe game has lost of darkness & the quest version suffers from ghosting in thesesections, its not overly pronounced & I personally didnt mind it but it was one of the questions that popped up in my live-stream a few times.\n\nOverall if your looking for a lengthy, great looking physiological horror experience to mess with your mind, youve found the right game\n\nHelpful | 18", "BossloreyJul 9 at 12:19 PM\nGreat\n\nI havent played a ton so far, but the environmental horror is awesome. At first I was out off by the graphics, but they quickly left my mind. Most VR horror is just a jumpscare simulator. While this game does have a few really well placed and timed jump scares, some of which arent very obvious, its mostly the building sense of tension and dread. Recommend\n\nHelpful | 15", "dogbert7425 days ago\nLayers of Terror more like\n\nMy first foray into horror games for my Quest was Affected: The Manor, which I thought Layers of Fear was going to be like.\nBoy was I wrong.\nWhere Affected focuses on quick playthroughs and intense jump scares, Layers slowly throws terrifying slow burn moments at you over a much longer period of time, meaning that when the scare drops you're already on a knife edge, making it even scarier and more impactful.\nThere's also a deep backstory that unravels the further in you go, and the hairs on the back of my neck were on end pretty much the whole time I was reading the mysterious notes, letters and newspaper articles that reveal the lore.\nI played a solid two hours in one go and I'm only at the third chapter. The game feels tremendously polished, there's a LOT going on here.\nI would encourage anyone to give this a go, you won't regret it.\nIf you have the nerve, that is...\n\nHelpful | 5", "ZanyZarlyJul 11 at 5:02 AM\nScratches the itch..\n\nI consider myself something of a VR veteran, I've been through PCVR, PSVR and now I'm a Quest obsessor. I've always been attracted to the horror/haunting genre because in VR it's absolutely terrifying - if you've never tried being scared in vr before then this is the title to try. It's darn spooky and will send shivers down your spine.\n\nGraphically it's one of the Quests prettier games - it'll be a title that you'll probably use to showcase your headset to. Although, I can't imagine playing through it more than once but don't let that put you off this purchase. Apparently you can expect 3-4 hours of game play, which is acceptable for the price of the game.\n\nJust buy it, the spooks and scares are worth every penny. Hopefully they'll be some form of dlc or expansion packs further down the road. It makes me yearn for a Resident Evil 7 clone on the Quest that little bit more...\n\nHelpful | 9", "Erabus14 days ago\nNot bad!\n\nAs you will have read by now this is a bit glitchy and you can get into situations where you need to reboot but they havent happened too often to me. The story is good and the game is atmospheric and so l personally feel that its worth the money that you pay to enjoy the experience. It has a lot of potential and some interesting puzzles. If horror and puzzles are your thing you could do worse!\n\nWith a little attention Developers l would rate this a 5.\n\nHelpful | 1", "virtualnonie4 hours ago\nWow!\n\nThis game blew me away on so many levels. Visually Id say its one of the best games on the quest, and the mind bending nightmarish effect of it all really makes you feel like youre the insane painter and really immerses you into the experience. Id definitely recommend to anybody looking for good quest horror experiences. Id say for your money, this is probably the best you can play\n\nHelpful | 0", "meridith.ennyJul 16 at 8:48 AM\nLove it!\n\nI loved playing this game on my PS4 so I couldnt wait to try it in VR. Its awesome and more scary. The visual effects arent as good, but its a Quest not a PS4 so Im fine with that. I wasnt disappointed at all!\n\nAnyway, I was playing this while my husband was in the room. I actually got scared enough to let out a scream. I nearly gave my husband a heart attack. This game is much scarier in VR.\n\nEnjoy LOL!\n\nHelpful | 8", "ailtsJul 25 at 3:03 PM\nGreat but flawed\n\nDo not think of this as a horror game in the vein of Silent Hill, but more appropriately a visual novel or a game like Gone Home. The game does a fantastic job creating tension, there are some times you are going to be terrified to turn around because you just know theres going to be some thing there. This is a fun game to play with other people watching because you will jump. Some complaints though, some of the graphics are a little awkward, many of the places you can explore are simply reusing assets which make exploration tedious and feel padded out. I would have liked to have seen more atmospheric sounds. That said, the story is fantastic, and it is incredibly fun to get through.\n\nHelpful | 2", "ParadiseDecayJul 11 at 4:48 AM\nHow horror should be done!\n\nI played the game in a REAL Haunted Cellar for FULL IMMERSION and I even get pushed by a REAL Ghost in my video! - Scary stuff:\nhttps://www.youtube.com/watch?v=uHn0UayHNsw\n\nMy Initial Impressions:\nJust as good as the PC version but with some dumbing down of the graphics.\nThis is still a great and atmospheric experience, and yet another game to show just how poweful the Quest can be.\nYou're going to be in for a Horrific time!\n-------------------------------------------------------\n\n*Rift Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=caWSak8IxU4\n\nMy Initial RIFT Thoughts:\nThis is how a VR horror game should be done, plenty of tension with unexpected jump scares and a PT/Resident Evil Vibe.\n\nHelpful | 11", "fernando.vazquezjrJul 26 at 5:23 AM\nI was doubting this game but I was wrong\n\nI got to say starts off with a slow burn.. but eventually it works up to something you'll see.. worth the money and worth the time.. it definitely got me a few times. Terrific job you guys !!!!\n\n\n\n\nOkay I am in serious need some help.. I get to a certain part of the game where I fall behind the walls and I cannot do anything from there on I'm looking from the outside-in to the game.. I went online and a couple YouTube videos and I seen that for everybody else is different you open up the door you see the picture you turn around you see a small picture then blinks off and on and then you're back in the hallway for me I fall behind the walls it's complete darkness and I can see the game from the outside but I am in a lower level what do I do???\n\nHelpful | 4", "BeanoTheWarcow4 days ago\nCreepy!!\n\nI'm fairly new to the quest, less than two weeks. I had my eye on this game and decided to go for it. Wow!! Another review called it a slow burn and that is very accurate. There are parts that make you feel anxious...in a good way. I thought I was near the end but I was wrong. It gets really dark and scary and I still have further to go. Awesome game! So glad I jumped in. Very immersive and fun!!\n\nHelpful | 1", "ChillahGorillaJul 13 at 7:17 AM\nIntense!\n\nTL;DR: Get this if you want to be scared!\n\nThis game was so scary at times that I swear I could only play it a couple rooms at a time. I'd go into it all ready to go, and I'd nearly panic and have to turn it off to catch my breath. I've played many horror games, but this experience is something I've never seen before.\nThe use of VR and how quickly things change in the environment caused such a deep sense of constant dread that I would turn around with my eyes closed at times because absolutely anything could be there behind me.\nI think my complaints are the same as everyone else's. Many, many times I was transported out of the environment after turning, I would have to reset the game and it would completely ruin the immersion. Thankfully, it would start back at whatever room I was at so I never lost any progress.\nAlso, I was expecting more of an actual game, and while there a few light puzzles it is much more of an immersive experience than an actual game. However, the experience and the environments were so intense and unique that I still think it's still worth 5 stars for the trauma and terror the game puts you through. Definitely worth it for horror fans!\n\nHelpful | 6", "ZedisnotdeadJul 12 at 7:38 PM\nGreat game but has some small glitches\n\nSo on chapter 5 after figuring out 2 of the phones the 3rd one begins to ring and the screen goes black. You can still see your hands and have movement but the atmosphere is void. Am I missing something? The black screen is the only thing for me not giving this 5 stars. Other than that it is amazing\n\nHelpful | 3\nDeveloper ResponseJul 14 at 5:38 AM\n\nThank you very much for your words. I will report this problem to devteam!", "jonathan.t.marsh22 days ago\nGood experiance but not jumpy\n\nWhilst I enjoyed Layers of Fear i was expecting it to be more jumpy. There are a few jumpy bits but nothing that really got me scared.\nThe story lone was confusing and I didnt really know what was going on but i followed the game anyway.\nThe way the rooms change on you is cool and plays with your mind a bit.\n\nOverall it was ok but could be a lot better.\n\nHelpful | 0", "AssassinBlasterJul 9 at 7:45 PM\nONE OF THE SCARIEST GAMES IVE PLAYED\n\nI never got to play this game on console, but once I saw it was coming to Quest I knew I had to get it and play it. I played for only an hour and I was terrified. Even though the graphics are downgraded, its still so great. Thanks so much for putting one of the best VR horror games over here. Cant wait to play the rest!\n\nHelpful | 4", "slickwilly1021Jul 10 at 5:41 PM\nGreat Quest port .\n\nI'm only about an hour in , but really liking it already . Love horror games in vr , and this one is right up there for me way more immersive and interactive than Affected Manor .\n\nHelpful | 5", "ickydimeJul 25 at 7:22 PM\nMovement Controls make me Nauseous\n\nThe movement makes me sick. I wish there were a teleport option. Even putting tunneling up doesn't make it better.\n\nAlso, the inability to reach things far away is annoying. I've been spoiled by other games like Half Life and I expect you to die. You really have to get right on top of things to interact. And then the hitboxes aren't great as you will see an indicator over item A but then pick up item B.\n\nIt also gets jumpy at times. It particularly happens sometimes when you try to interact with something(camera jumps backward). I'm on the quest without wiring to a PC.\n\nTo me and my wife it seems unplayable. I don't understand all of the high reviews. Perhaps if you don't get sick then you can get into the story.\n\nHelpful | 5", "Saboo2724 days ago\nPlayed on xbox and now VR\n\nI absolutely loved this game when I played it a few years back so when I saw it came out VR I was ecstatic. Like other reviews say it's completely psychological horror, but it just keeps you in this consistently tense and anxious state. You'll be terrified of turning around and who doesn't love that? If you love horror this is a MUST OWN. Even if you don't, get it so you can scare your friends and family lol.\n\nHelpful | 1", "Studly_McSexfireJul 23 at 7:47 AM\nNot sure what to think\n\nThe game seems great aside from the feeling that the refresh rate is low and choppy when I locomote. Also when I approach areas and stop at them, I spring backwards a couple feet. These things make the game uncomfortable enough to play that I havent gotten very far. Id like to give it a chance and hopefully the developers can fix these issues.\n\nHelpful | 3", "Dsa213425 days ago\nThe most amazing awesome horror game!!!!\n\nThis game is so fun and amazing!!! Layers of fear is an amazing game the puzzles are fun and awesome but beware of the scares they did get me and Im going to say that this is the best horror game out there on VR! The mind twisting stories make the game even more fun as you uncover the truth. Overall experience is awesome love the graphics and detail and also love the storyline. The storyline in this game is far more interesting and I say its for the right price and the best horror game out there!!!!\n\nHelpful | 1", "Sol1dSnapeJul 21 at 9:09 AM\nA lot of promise but very VERY buggy\n\nI started the game today maybe played 30 minutes, firstly it kept moving me back as I was trying to interact with an item, managed to get past this then went to interact with a 3 digit padlock and got telephoned outside of the map. It was unplayable, will try it again this evening before I ask for a refund. Really hope it works better a second time around\n\nHelpful | 5", "Kelinore13124 days ago\nHORRIFIC MOTION SICKNESS!!!!!!!!!!!!!!!!\n\nNot even 3 minutes into the game I thought I was going to throw up and I have been playing VR games for quite some time. I turned up the tunneling to high, which ruins the experience. Tried all settings and the movement is not smooth it's absolutely AWFUL! I don't understand the high ratings for this game. I so wanted to like it, and now the Oculus page won't even allow me to do a refund for it as it's stuck in some weird glitch.. Where is my Dramamine?!?!\n\nHelpful | 3", "missgnarlymarleyJul 20 at 7:20 PM\nGreat game but not ready for VR\n\nI love this game, I've played through at least 5 times on my nintendo switch! The VR however needs more stability. I've never been one to get motion sick but I couldn't play longer than 10 minutes before I started getting nauseous. Such a bummer because this game has potential and will be AMAZING in VR.\n\nHelpful | 4", "Capt_Quint620Jul 11 at 11:21 AM\nNever played the console version and wow\n\nIt was this or Affected. I think I selected wisely, here. Only an hour in and I was already feeling the \"NOPE\" parts creep in. I have a decent tolerance for horror games and haunted houses, so this is giving me a run for my money already. Nothing too bad so far, but I dread what is coming.\n\nAside from that though, the story looks promising. Tragic, actually, if you haven't played it. The artist is clearly an alcoholic, and I suggest you read everything and look at everything. There's a sad story somewhere here. Worth the money so far. Much more of a game, too.\n\nHelpful | 2", "andyblake31.abJul 18 at 10:14 PM\nA mixed experience\n\nI was hoping alot for this game due to the reviews but have found it a little buggy and repetitive. Moving from one room to the next with small distractions, I found after a while it was more of a repetitive wandering game lacking focus. I am sure there are others out there who will enjoy it and give it a try if you wish. The graphics are impressive for the quest and it is worth giving it a try if you like a slow pace.\n\nHelpful | 4", "RainSilverMoonJul 25 at 5:25 AM\nScared Out of My Mind\n\nI had this game on another platform and thought it was pretty cool, but thats doesnt even compare to actually walking around the mansion and experiencing all the freaky, twisted things directly in your face! I dont scare easily, I enjoy horror movies, ghost hunting, and things of that nature, but Ive had to tap out of the game a few times for the night for the sole purpose of being too freaked out! And of course I cant wait to calm down and dive back in later! Im hooked!\n\nHelpful | 1", "InvidFlower10 days ago\nKeep having to start at the beginning\n\nTo echo some other reviews, this is pretty buggy. Had issues like getting stuck in the floor, or a black screen, or even just wanting to take a break and always end up at the beginning the next time I go in. I know it wasnt a total reset because it started up with inventory I last had, but I still had to start again.\n\nAfter the third time or so I just gave up. I would have refunded but was already past 2 hours I think.\n\nI dont know.. there was some neat moments in what I did play but it also felt a bit boring at times. I cant help comparing it to Red Matter. That has a lot of similarities in terms of a creepy vibe, exploring an abandoned place to see what happened, things slowly getting less sane.\n\nBut Red Matter had a more unique story and I ended up getting invested into the characters. Plus it felt much more polished. Even in smaller ways this game felt clunky. Playing for the first time made select the painting and select load instead of having new or similar, some of the first items you interact with dont do anything, the inventory system is awkward and I wasnt sure if it was a bug at first, etc.\n\nMaybe Ill give it another shot eventually once theres been more bug fixed and some of the details are less fresh again.\n\nHelpful | 1", "vinegarshotsJul 29 at 10:49 AM\nA Door, Drawer, and Cabinet Simulator\n\nThere are some decent creepy elements in this game, but it's hindered by incredibly repetitive gameplay. Most of the time is spent opening drawers, opening cabinets, and opening doors, and too many of the objects you find are just generic props (like bottles, etc) that don't advance the story. It starts feeling tedious after a while. In addition, the controls need a lot of work, as there seems to only be a small active area on these drawers and cabinets where it actually lets you pull them open, so a lot of time is spent trying over and over again to pull them open. Some of the areas are way too dark (not in the good creepy way, but in the can-barely-even-play-the-game kind of way).\n\nHelpful | 2", "cLuMsY-BoYJul 9 at 11:53 AM\nI keep forgetting how scary this is!\n\nI started playing and I knew how scary it would be as I played on Xbox but every time a take a break I keep forgetting how scary it is!!!!! You will love it!!\n\nHelpful | 4", "MikemccaulayJul 17 at 9:59 PM\nAbsolutely terrifying\n\nI have had my fare share of VR horror experiences on various types of headsets, and this game is a force to be reckoned with!!!!!! I strongly suggest investing in a pair of skull candy crusher ANCs and the sound ALONE will make you think twice about advancing through this game. Within the first 2 minutes of playing, the vibration of the base will make you feel the energy in your ears!!! The rumble will knock your socks off with fear!!!!! I dont think I can finish this game lol. Way too creepy.\n\nEasily 5 stars and a must have for horror fans\n\nHelpful | 0", "apvizionJul 20 at 4:24 PM\nA VR horror masterpiece!\n\nA very terrifying and immersive experience. Really gets under your skin, and gets really trippy and surreal. I highly recommend to fans of horror!\n\nHelpful | 3", "edshigakiJul 18 at 8:19 AM\nLazy VR port\n\nThis is an ok horror game, but there's a ton of objects in the game you can't interact with. You don't feel like you are in the game, in virtual reality. It feels like you are holding a mouse looking for a shining object to click.\n\nHelpful | 3", "HeyImOJiiJul 12 at 5:30 PM\nBest horror game Ive played!\n\nAt first I wasnt scared of much horror games but this gives me the chills everywhere I go. I have run through some glitches that but it didnt bother me much. I 100% recommend this to you if you want to be scared.\n\nHelpful | 2", "tiefenboiJul 20 at 5:42 AM\nso much wasted potential\n\nlove the game as it was released in 2016 and was very excited for the VR version. first of all: the lack of graphic .. oof .. especially the bad light setting is killing a lot of the atmosphere. (i know its quest hardware - but think about red matter for example)\nalso, you cannot interact with objects properly and the physics are horrible .. so here is a lot of the immersing experience is just misspent.\nsadly they removed almost every nice detail, that is in the regular game: no interaction with light switches, the working mouse traps in the pantry at the beginning, etc.\nstill the best game for horror on quest - but what does that say about this genre \nat least the repeatedly occurring jump scares of layers of fear are now working with more instense in VR ..\n\nHelpful | 2", "ThunderBoxxJul 15 at 9:05 AM\nCREEPY!!\n\nI'd picked this one up on XBox a while ago and it creeped me out then. But when I saw this Oculus VR version it was an immediate grab. This is a very well crafted story with just enuff \"What the hell was that...!?!?\" mixed in with, \"Alright that's about 9\n\nHelpful | 0", "kevinrodgers20 days ago\n10/5\n\nI played the original game so much over the past few years and this is absolutely nothing like it. Its so insane. I almost cant even believe it.\n\nHelpful | 1", "sienna2702Jul 12 at 2:28 AM\nAmazing\n\nI was hoping this day would come. Ive waited so long. This was definitely my favourite horror game when it was on the Xbox. They did a good job. Its terrifying\n\nHelpful | 2", "chronictia22 days ago\nGroundhog day game\n\nI have gotten so frustrated with this, and of,course, it's too late to get a refund. I don't know what I am doing wrong. I started the game, and went through all the empty rooms downstairs. I found no puzzles. I went and exited. The game. The next night I hit the load button and selected what I thought was my portrait. My game did not load, and I had to start all over again  this time I redid the rooms downstairs and went upstairs. A door slammed, and I was seeing fleeting shadows. Again I closed the game and I thought I saved it. The next time I went to play, bam, no game loads. I'm supposed to start again. By this time I am heartily bored of the first floor. Any suggestions on how to correctly exit and also to sign back in and have my game in progress saved?\nCan someone or one of the devs help me with this, please? Thanks!\n\nHelpful | 1", "agitokazuJul 22 at 10:59 AM\nLove it!!!!\n\nIt's been quite a few since a VR game caught my interest & this was the one. ^_^\n\nI love the scare factor & Roaming around the building anticipating when something would pop out at me lol\n\nHelpful | 1", "gemini1976Jul 26 at 1:41 PM\nNot scary\n\nI have been playing for about an hour and all i have seen are some rooms move and paintings animate. The graphics are good an gameplay is good, havent noticed much glitches.even after playing for 2 hours nothing really happened, i uninstalled.\n\nHelpful | 0", "sweetlady20622 days ago\nAnd then it crashed....\n\nI was loving this game until the latest update and now I am probably going to have to uninstall it. After the newest update I cant get it to run at all after the title screen.\n\nHelpful | 0", "AyeandusJul 11 at 1:21 PM\nLess layers but still enough\n\nAfter playing it on a more powerful platform the first thing are the graphics definitely dont look as good. I feel they could have done better but respect. Controls were better after adjusting setting but I couldnt adjust the speed in which he moves only how fast he turns. The blue ring beneath you is distracting and unnecessary and its obvious it was not native VR but all together its a great experience still. Full physiological thriller and worth every penny.\n\nHelpful | 1", "SWEATYVRJul 13 at 6:39 PM\nScary as hell!!!\n\nProb the scariest game if you want a spoke you should buy this its also great to play in night time and in silence makes the experience worst but better 10/10 for me...\n\nHelpful | 1", "thoeriJul 20 at 12:16 PM\nOk I have to change it to 1 star\n\nThe game dont work cant play at alI, I fall out of the game true the floor all time, and stuck on the outside of game. Sorry but the game is broke !\nFix that and I will review it again\n\nHelpful | 3", "intheair1987Jul 21 at 10:25 AM\nLong and boring\n\nAll the reading really irritates me. Nothing scary. Boring story.\n\nHelpful | 5", "NikatornJul 28 at 1:25 AM\nDon't get it\n\nFor me Layers of Fear is not so much actual gameplay as i hoped for. It's more an exploration of the mansion. The feeling is creepy. But i lost interest playing after a couple of hours.\n\nHelpful | 1", "NightMonk3yJul 11 at 6:30 PM\nBig lump of mess!\n\nGood game nearly completed it however i got stuck between a door way glitch. And had to quit and restart it again. Only to find out i had been bounced back to the part where you have to find the pucks. It was at that point i had enough as i couldnt be bothered to find them all again.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 1:19 AM\n\nCan you show us where this problem occurred? At support@blooberteam.com. We are working and developing the game all the time - will you help?", "Majestic76Jul 22 at 6:29 PM\nWow\n\nThis game is both mentally and visually crazy. love it!!!!\n\nHelpful | 0", "TheHorseWithNoNameJul 17 at 12:26 AM\nScary\n\nScary\n\nHelpful | 2", "Luke117Jul 10 at 2:00 AM\nLooking forward to it!!\n\nSo I've played the first and second on the Xbox and I loved them.. I'm a big fan of horror and this game was great on that system, now that it is playable on the quest.. literally blows me away!! The fear and scares that awaits me  I'll come back and update this once I've had a good run through it!\n\nY.T (Stingrea follower) I'm uploading the full game if you want to see what this has to offer!\n\nHelpful | 17", "Benny_Chainz15 days ago\nTrippy Creepy and Awesome\n\nExcellent, excellent game. I cannot recommend this game enough. It's so insanely trippy. It's like the Twilight Zone on steroids. It's basically a gigantic Haunted House that just wont quit. So much creepy creativity was put into this game I love it!\n\nHelpful | 1", "Ethoz787Jul 9 at 4:53 PM\nAmazing\n\nI played this on Xbox one and loved it so when I saw it was getting a quest port I immediately put it on my wishlist and it has not disappointed. Being put into the world on VR was incredible and definitely scary. This game has jumpscares but it's not a main tool they use to scare you. Most of the horror is purely atmospheric and is built to make you feel tense and unsettled. I highly recommend this game if you like atmospheric horror or want to try VR horror for the first time without being bombarded with jumpscares. The game also runs really well and looks beautiful. Definitely a must buy 5/5\n\nHelpful | 2", "jujug420Jul 10 at 11:29 AM\nGreat horror game\n\nPlayed the flat version a while back and I said it seems like this is more of a vr game in mind then a flat game. Still was absolutely awesome although in the vr its a whole new level of freaky. Everything flows perfect and I'm only an hour into the game. LOVE IT\n\nHelpful | 1", "l3rianKJul 13 at 12:01 PM\nCreative and CREEPY\n\nAbout an hour into the game and Im curious to find out what will happen next but also scared to continue because the game gets creepier and creepier as it progresses...the game plays mind tricks on you and there are some jump scares but its not one of those obvious jump scares. Youre in for a surprise. I cant play this game without people around me lol. Great job Dev team and looking forward to future updates!\n\nHelpful | 0", "KyrendareJul 12 at 4:28 AM\nBUY IT NOW.\n\nI watched my wife complete this game from the start to the end in PC so I knew this game would be a great experience. I went to buy it thinking it would to have it in my collection to show to any friend and I didn't expected to feel any true weird feeling when playing it myself since I already saw most if not all the game before in PC. I WAS VERY WRONG AND ALMOST GOT A REAL HEART ATTACK, game in PC is awesome but in VR it's another level of fear and horror. (Playing with Headphones is a must for a true immersive feeling).\n\nHelpful | 0", "LeogamerextraJul 11 at 2:18 PM\nLAYERS OF FEAR VR!\n\nthis game is really scary !!!\nThe most striking thing is certainly the atmosphere, which is really well cared for in detail. The jumpscares are initially few, but always effective, but going forward the anxiety for the game increases considerably, and therefore also the jumpscares. The sound of the game is absolutely immersive with melodies that change according to the situation and that create a very tense atmosphere. In my opinion it is an excellent game for friends to try to have fun (also because alone I wouldn't be able to play it too much) In conclusion: for me it is perhaps the best horror game on quest.\nRecommended\n\nHelpful | 0", "Aaronb3434Jul 9 at 5:16 PM\nCool\n\nGreat horror game for the quest, it kind of reminds me of rise of insanity. although the graphics are really good but i think it can use some polishing but other than that i like it.\n\nHelpful | 3", "Ironbug78Jul 10 at 8:45 PM\nEven more creepy in VR\n\nThis is a great game. I own the 2D copy as well and enjoyed it, but this in VR is the next level of creepy and scares. If you are looking for a game that will make your skin crawl this is it.\n\nHelpful | 0", "jackboydoughJul 12 at 12:37 AM\nBUY THIS HORROR VR TITLE!\n\nIf you loved layers of fear on console this is a great way to experience it in all vr glory! if you are new to the game, you will be taken on a TRIP!\n\nHelpful | 1", "JinxxSpeaksJul 10 at 6:09 AM\nSCARY\n\nSo far so good. Scared the hell out of me so that's a great sign! Would recommend! Buggy but fun.\n\nHelpful | 2"]