{"App Title": "Let's Create! Pottery VR", "App description": "Go through all the stages of creating ceramics. Choose the color of the clay. Shape it on the potter's wheel with your own hands. Add the necessary elements, burn and decorate like a real artisan, choose a variety of colors or use ready-made color palettes. Give them a unique style and character. You can refer to classic art patterns or create individual projects yourself.\n\nComplete tasks and special orders or imagine it, and create it in your way.\n\nExpress yourself with Let's Create Pottery VR and give relaxation to your soul.\n\nCreate many unique thematic ceramic collections grouped by styles, patterns, and levels of advancement.", "Purchase section": "$17.99-10%$19.99Add to WishlistShareSale ends in24:28:04ComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Art/Creativity, Casual, Relaxation/Meditation", "Languages": "English, Chinese (China), French (France), German, Italian, Japanese, Korean, Polish, Portuguese (Portugal), Russian, Spanish (Spain)", "Version + Release Notes": "1.0", "Developer": "Infinite Dreams sp. z o.o.", "Publisher": "Infinite Dreams", "Website": "https://www.idreams.pl/our-products/show/product/21-Lets-Create-Pottery", "Release Date": "April 30, 2020", "Developer Privacy Policy": "None", "Space Required": "965.8 MB"}



["5 stars\n49%\n4 stars\n28%\n3 stars\n12%\n2 stars\n8%\n1 star\n2%", "dreamertoo94 days ago\nI am stuck in the game\n\nI like it but I have been stuck on the chalise challange and no matter where I put the aplications it is not right even though it looks excactly like the picture it is very frustrating and would like to find out why this one is so difficult to do it is not relaxing\n\nHelpful | 9", "JcPeacemakerApr 30 at 5:46 PM\nVery addictive. And relaxing.\n\nSurprise hit in my house. Very relaxing. Plenty of challenges and unlockable extras. Great sense of achievement when you 5 star a commission or sell high at auction. On wish you could redo orders to better you score and needs update for 2 hands this is a must for 5 stars.\n\nHelpful | 92", "GRACLOUGHJul 8 at 10:17 AM\nGood but ultimately frustrating\n\nWhilst I enjoy the experience I am getting frustrated and having to make the same pot over and over again. I have 14 out of 15 stars ticked and just cannot get the 15th. Without any hint I just don't have the time to keep making the same pot, getting the same result and not progressing.\n\nI really enjoyed being able to make my own pots and experiment. Unfortunately I'm going to have to give up on this as its now just wasting my time. Pity there isn't a hint or override so you can just create pottery (as the name implies) rather than make one pot over and over and over again.\n\nHelpful | 7", "l3rianKApr 30 at 11:33 PM\nTwo hands please?\n\nLike all the other reviews, I surprisingly enjoyed this app and played it for longer than I expected! Im sure there will be more updates coming soon but please add two hands features and more rooms we can purchase to create and place pot s for great presentation.\n\nHelpful | 49", "LowKeyMoneyMay 19 at 10:17 PM\nWe're sad \n\nI think we \" all \" would agree... we would give the game .. stars  if the game has two hands..if it did make it similar to the other games to if we want to open a menu we could flip one of our hands ..We're all humans we come ready with twohands  or it would be a BONUS if it were hand tracking due to the oculus update with it.THIS GAME WOULD STAND OUT AGAINST ALOT OF GAMES. Because this game is for mature adults it would be ideal if it you update it very soon it is 2020 ! Other than that WONDERFUL GAME !!!!! we all thank you !!!!!! P.s why isn't the developers saying anything to us like other developers are with the people who buy there games in the review section??? We're important too!! \n\nHelpful | 17", "Mikey_FerrelliMay 1 at 11:57 PM\nAnother surprise\n\nJust like color book... another release out of nowhere ...didn't know what to expect especially with a $19.99 price tag...so with that said, great surprise and game... I enjoyed it, let my mom and couple other people try. They loved it. Especially with the auction and special orders, 4 outta 5 stars only because they should add 2 hand sculpting which isn't necessary, but nice, and a custom mp3 player or youtube/spotify like reel fishing vr and it's a 5.\n\nHelpful | 20", "ClemitJul 2 at 2:41 PM\nSurprisingly good game!\n\nRelaxing and addictive game. Making and selling your own pottery! Great while the emails are coming in with challenging commissions for you to create!\nLost its appeal slightly now the emails have stopped!\nIm hoping theyre going to send some more!\n\nHelpful | 1", "MADMANinBLACKMay 3 at 3:03 AM\nChilled out fun\n\nReally good fun, as an ex professional potter I was very sceptical about buying this, however I think the devs have done a great job of translating how clay works on a wheel, even if its simplified\n\nIts easy enough to pick up and play, but tricky enough that you wont be 5 starring every piece you create\n\nTwo things I would like implemented are the use of both hands and hand tracking\n\nOver all, a nice chilled relaxing creative experience\n\nHelpful | 28", "JTubbrittApr 30 at 4:58 PM\nVery enjoyable.\n\nCan see myself spending a lot of time in VR making pots with this app. Its very enjoyable and relaxing. The clay looks amazingly realistic. If I had one wish it would simply wish it could play local mp3 files so I could spend hours making pots and listen to my own tunes. I will use this app a lot.\n\nHelpful | 19", "GordonMarcJun 27 at 10:25 PM\nGordonMarc\n\nHave experience with pottery but you dont need it to enjoy this game. At this time, it is my favorite. Very relaxing and gets better as you collect more patterns with money from auction sales. You can keep your favorites in a gallery display, store them or sell them later. Enjoyable way to explore your creativity.\n\nHelpful | 0", "AllotaFaginaApr 30 at 1:54 PM\nImpulse ..\n\nWell ya was for shiggles but honestly its really relaxing. Only thing I would love is using 2hands , not gonna lie. I understand choosing clay and etc but what do I know lol\n\nHelpful | 15", "skipchicagoMay 12 at 3:53 PM\nRelaxing and creative\n\nThis is the first review Ive written on any of the Oculus games Ive purchased. I hesitated to buy this game but then I hesitate spending money on anything. But I did get it and Ive been making pots and selling them. ive completed a few challenges and have earned some money to buy more colors and patterns. Even though its not real, it feels like Im actually creating something, which is very fun. I still havent found the outdoor gallery that shows up in the video, but I assume I have to reach some level or other before I can see it. I agree with others that say the game needs hand tracking and Id also like to be able to put my hand down into a pot to mold it from inside. Also id like to use both hands. All in all, this is a very fun game.\n\nIts now several days from getting this game so I want to add another note. This game continues to fascinate me. I changed my rating from four stars to five stars now that I have more experience with it. The challenges get progressively harder but also teach how to play the game. Im currently stuck on an Egyptian challenge but Ill solve it eventually. I have learned how to make some really lovely virtual pots. The only other thing I would really like to have in this game is the opportunity to see what other players have been making. Perhaps a large online gallery could become available after a certain level where players can put one or two of their own best pieces and be able to walk around and see what others have been making.\n\nHelpful | 8", "DrCheeseHeadMay 1 at 3:11 PM\nLove it!\n\nI agree with others that this is a relaxing game. I just bought it yesterday and I found this so much fun because it's calming and I can sit and play it. I know it's terrible, but I enjoy games that I can just sit down and just play.\n\nThis is a very good port from the iPad and Android version. I own both and I find that they adapted this to VR very well. I agree with the other reviewer who said it would be nice to have other rooms and such. I think that would be a good touch. Like, maybe I want a manual wheel in a messy room... Or in a historical setting! Something different. Maybe make it a little more interactive with previous pieces that you have done. You should be able to pick them up and maybe smash them! (But have them regenerate). Oh! Maybe a bonus smash game!! And two hands, please! I kept wanting to use my other hand!\n\nAnother reviewer said that they did not see any designs. In order to get to them you will have to read your email from your aunt. She will send you tasks to do. Once you do those it opens up more things for you to buy. The caveat is your aunt is literally ripping you off. I found that I can get more money if I sell my pieces at the auction than just giving them to her. Who knows? Maybe she is old and thinks that she's giving me a lot of money?? Between you and me, she's holding us back! On the flip side, she is being supportive of our craft so there's that. She seems very proud of us! But for the most part at least in the beginning, you have to sell the pieces that she asked you to make in order to open up colors and decorations and such. Hope this helps!\n\nHelpful | 10", "phaneronZMay 19 at 12:34 PM\n\nJust about keeps you interested for over the 2 hour mark.\n\nNeeds more patterns. You quickly have to start grinding to buy patterns from the shop that arent really that interesting. My suggestion is tonnes more to buy in the shop. A lot of filler would actual work if you had (unless Im missing something) a half decent way to edit them when creating your pots. Please point out if Im wrong but is there really no way to flip or mirror designs?? No resizing tool?? I actually expected there to be way to customise your own. A creative game needs the tools for the user to really feel like theyve put their mark on something. With the customisation tools really lacking, youre trying to enjoy this game with one hand ride behind your back, literally, you only use one hand. Its such a shame.\n\nThe auction part is a nice idea but again, after a while you see how hollow the judging system is.\n\nCould be a really good game and Im hopeful there will be updates as I look forward to really getting lost in this game taking time to create something unique.\n\nFor now though, Im not sure its worth the money.\n\nHelpful | 4", "NovelMakerMay 4 at 5:26 PM\nAwesome, awesome, awesome, awesome\n\nI wish more games like this would be on Quest. For people like me who don't absolutely love shooting up living dead. One of the many great things about this game is how the patterns get applied to the pots. They often don't look that much like pattern you think you're applying: they look much better! The quality of the graphics of the actual pots is great. In time, I hope the quality of surrounding sceneries can be improved a bit, unless keeping them inferior was a deliberate decision in order to make the pots look better by contrast. If so, then maybe leave it this way. They could also increase the size of the apartment so that eventually you can walk in various rooms and see your pots all over the place. Anyway, thank you for creating this game! I tried playing it while on my stationary bike and it's not quite as effective to get you to pedal quickly as Beat Saber or even VRFishing are, but it's very pleasurable to play, maybe too pleasurable--like, if you need to get some work done but feel like making yet another pot instead. :)\n\nUpdate: New pros and cons I just discovered. Pro: The red clay is mind-blowing. It makes the pots shiny in the most exquisite way. Con: I've been using the Oculus Quest to take photos of my pots but then I realized it only lets me keep a certain number of photos and then deletes the oldest ones. And unlike Tiltbrush, there is no way to e-mail them to myself, which is a huge flaw. The only option the game (and Oculus) give you is to link to your Facebook account and send the photos there. Already, Oculus always trying to force people to link to Facebook (who owns Oculus) is totally obnoxious and makes us hate them and want to go to whatever competitor comes up with the next good VR goggles. Then when I did link to a rarely used FB account, they wanted my cell number. No way. So I'll lose my pots. And I'll lose my interest in this otherwise lovely game. :(\n\nHelpful | 6", "preston.luberMay 26 at 11:17 AM\nA great concept\n\nI have owned my Quest for almost a year now and frankly became bored with killing zombies, shooting , fighting in outer space, flying a glider and wingsuiting. For the most part after too many hours engaged in this type of game the thrill had flown.\n\nThis app lets you be creative in VR rather than destructive. Even having no experience in making pottery this app makes it intuative and easy to create beautiful pieces which, after you admire your work you can auction off and earn enough to buy more patterns, colors, etc.\n\nI will admit that after creating my first 10 pieces I was hesitant to sell them off but the possibilites are endless and I know that better things were ahead as I acquired more supplies from the store.\n\nTime flies by so quickly when you are engaged in shaping and decorating your masterpieces.\n\nI have read other reviews asking for a two handed solution but I find that after some experimentation one hand works just fine as the pot is spinning. I like how sensitive the \"clay\" is in reacting to the slightest hand movement.\n\nThis and \"Color Space\" and \"VR Fishing\" have proven to be my favorite apps so far on the quest. These are well suited for seniors like myself. I recommend this and the other 2 mentioned very highly.\n\nHelpful | 2", "DaveThePsychoMay 1 at 9:48 AM\nGreat potential and really addictive\n\nTbh I rarely write reviews but this game is insanely addicting and I've never done pottery in my life. I think what would be a great idea is to somehow implement a feature of exporting created vases as 3D projects for printing or other uses. The game has great graphics and slick UI, I can definitely see it going far with some additional mechanics like changing colors of patterns or even hand-tracking.\n\nHelpful | 6", "Chef918Jun 25 at 7:27 AM\nWould be more but...\n\nI can't even complete the first contract because the vase won't go into the box. Ive tried 4 times. Remaking each one and still nothing. It can go to the auction block for 6 dollars all day long but not in the box to complete the goal. Because of this I can't progress any further. Even upon rebooting the app. This is almost identical to the android game pottery, which was a ton of fun, this could be too except for this bug.This bug kind of ruins the game for me... Seems like a waste of money now.\n\nHelpful | 1", "sheLiebJun 7 at 3:11 PM\nFun and relaxing!!! LVE!\n\nGreat experience! Allows you to be creative in a way not many people can from the comfort of their own home - and without a mess or expenses! With either directed commissions or self-guided projects, this is an enjoyable and somewhat addictive app that gets played in my house at least once a day. Would definitely recommend!\n\nHelpful | 0", "ShadowHunter_313May 2 at 10:20 AM\nLittle bit of a let down\n\nThe one game that could put the hand tracking gimmick to use doesnt do it... definitely not a deal breaker but it would be awesome to sculpt your pottery with your own hands instead of holding a controller. And you can only use one hand to do it.. everything else is pretty good though\n\nHelpful | 7", "stevesilk51May 5 at 2:59 AM\nVery impressive use of VR.\n\nVery relaxing . You can get quite creative but hoping that a future update allows free form, i.e non potters wheel sculpting and also the possibility of using your creations as building blocks to produce more intricate creations. Great first release though.\n\nHelpful | 2", "GatadaMay 12 at 5:54 PM\nRelaxing One-Hand Simplified Pottery\n\nWife and I played the predecessor on the iPad. This release is even more relaxing. Love it.\n\nOf course its simplified. Without the tactile feel of physical clay, I think it has to be. Dont buy this to learn pottery, buy it because you would like to wind down and relax.\n\nSuitable laidback music, very nice scenery, cool interaction, perfect sound effects.\n\nWould love to see this game support controller free play.\n\nHelpful | 2", "westley93May 2 at 5:07 PM\nA worthy take at pottery\n\nI actually am enjoying this surprise title, although theirs a few things that I think are needed to make this feel more immersive, which I will say should have been common sense things, example the fact your virtual hand cannot grip or move it's fingers, also I would like to expand my pot via inserting my hand into said pot.\n\nHelpful | 4", "EeveekittyMay 29 at 1:37 PM\nGreat! But....\n\nThis is a great game! Its relaxing, but right now, to get an order, I have to make 4 pots. It takes really long. Then, sometimes, when I make requested pot, it wont into the furnace and when I shop it of, it doesnt go into the box, it just stays in my hand and I have to do it over! Also, the height and shape tools are right on but the coloring, I get 2 starts for a pot that looks exactly like the requested pot! It angers me. Also, why doing a requested pot, you need only 3 stars for height and shape but 4 stars for coloring? So unfair! Hopefully you take these flaws into account and fix them, thank you! :)\n\nHelpful | 0", "xan_draMay 3 at 4:30 AM\nReviews are misleading\n\nThe reviews feel misleading. This felt really basic and without a second hand this game belongs as a title for the oculus Go. Not a $20 quest game.\nI will likely be waiting for a refund.\n\nHelpful | 10", "izura21May 2 at 9:05 AM\nPoor game\n\nThe game is really poor. It is totally not  simulation for pottery i can assure that. You can create matter from nothing. Get moree heigh and more volume from nothing. It is not what i was expected\n20 euros is clearly a steal and it seems I can't get a refund yet. I don't know why.\n\nHelpful | 10", "ikeman420May 6 at 11:13 PM\n\nWas looking for nore of the real thing as this is nothing in comparison. I guess if u never experienced it ,it could be enjoyable but it would be completely wrong.. devs it takes two hands to throw clay. One need most perspective. Start with the procedure of preparing the clay. Next water. Ect. Make it REAL.\n\nHelpful | 4", "SakurachaekMay 21 at 4:22 AM\nI wanted to give this 4 stars.\n\nGreat game, with fun customisation options- until you get to letter 08 in the campaign- however much I try, it just says 3 stars for the decoration. It wont let me complete the order or skip it. If this is rectified Ill give it 4 stars!\n\nHelpful | 2", "kristin.sherwood5May 5 at 2:07 AM\nSurprisingly relaxing and addictive\n\nThis has become one of my go-to games when I want to relax and unwind. I love the combination of creating specific pieces based on photos and making whatever I like to sell at auction. As satisfying as it is to manipulate the clay, my favorite part is painting each piece afterwards. It's fun to see what emerges!\n\nTwo requests for new features: first, as others have mentioned, it would be nice to have the option to shape the clay with two hands, which I assume is what one does with an actual pottery wheel. Second, I would love to be able to see a gallery of all the pieces I made. Sometimes I am really proud of a piece and it's sad that I'll never see it again!\n\nThank you to the developers for a fun and relaxing experience.\n\nHelpful | 1", "billy.rockstar56May 3 at 12:00 PM\nLet's create pottery vr\n\nLove this very relaxing love making stuff . Can not send one item in the box cant get enough stars in the width area of one of the items to recreate getting frustrated any advise would be appreciated but it is truly an amazing hands on game. It is the special orders I'm having trouble with, would like to have a folder to see all the auctioned items you sell\n\nHelpful | 0", "ChipylunaMay 25 at 5:30 AM\nSo chill\n\nI love this game, I have honestly lost hours just sitting and being creative. The missions are a great break from designing your own pots and vases, and also give you inspiration. Very fun game indeed\n\nHelpful | 0", "ryman647Jul 2 at 12:10 PM\nGood\n\nBut a second hand would make it even better\n\nHelpful | 0", "SojoAmMay 1 at 10:49 AM\nNeed clearer instructions\n\nAlthough Im enjoying playing on the wheel, I kept thinking there was bound to be a way to paint/decorate it. I dont see it. In the description it says you can decorate it, but I dont see how. If I can figure that out, Ill enjoy it.\n\nHelpful | 5", "Aquamariana12Jun 16 at 10:29 AM\nPottery\n\nReally enjoying this app very relaxing g\n\nHelpful | 0", "jkampfMay 28 at 5:24 PM\nNeeds 2 Hands\n\nI would find this much more relaxing if I were able to use 2 hands.\n\nHelpful | 2", "kernelpanic3May 6 at 6:33 PM\nVery enjoyable - I have a wish list\n\nAgree with others here, this app is very relaxing. Allows creativity with the pottery shape, colors, patterns, and more as you advance. I am enjoying it immensely.\nI have made beautiful works and dont regret there purchase at all!\n\nHelpful | 0", "scpowellsrJun 5 at 8:52 AM\nAwesome\n\nVery Relaxing and creative\n\nHelpful | 0", "Aaronb3434May 5 at 11:59 PM\nCool\n\nBut please devs can we be able to use two hands instead to make it easier to make the pottery? and add more environments maybe to choose from, a house will be nice etc.\n\nHelpful | 1", "KozMSwarriorMay 20 at 3:27 PM\nAmazing\n\nI wanted to do a pottery course now i have my own pottery business\n\nHelpful | 0", "VR2050May 4 at 10:43 PM\nVery relaxing! 5 stars!\n\nVery relaxing. Love this title. Two hands would be great. Hand tracking would be out of this world!\n\nHelpful | 0", "Bjar5232Apr 30 at 2:35 PM\nA relaxing experience\n\nThis game is good and relaxing but it does have some issues. The concept is great but there can be some problems with the\nsculpting and putting patterns on pottery can be a bit unresponsive, though other than that ist great and for the price ita very worth it!\n\nHelpful | 10", "Gilagassi1May 1 at 5:40 AM\n\nA great vr experience\n\nHelpful | 2", "mandy7788May 1 at 9:23 PM\nSo much fun!!\n\nI had so much fun playing this game! I have zero complaints.\n\nHelpful | 1", "ssixxJun 26 at 5:31 AM\nVery relaxing!\n\nThis is way more relaxing than I expected, my first time in I didnt want to quit! I look forward to many more hours. Im hoping theres a gallery of all my pieces and I just havent found it yet. Otherwise that would be my suggestion for a future release.\n\nHelpful | 0", "zdoMay 8 at 12:14 PM\ngood\n\nIs good\n\nHelpful | 0", "lj.proctor2May 4 at 9:01 PM\nRelaxing\n\nI love it\n\nHelpful | 0", "Tumtums1414May 13 at 6:03 PM\nGreat and fun game\n\nI used to have this game on my phone and when I saw it for oculus I had to try it. It is definitely a lot more fun than the app and the gameplay is super fun. I sat playing the game for hours. Like others though I would have gave it 5 stars if they had it where you had two hands for sculpting. Other than that it is a great game that I would suggest to others.\n\nHelpful | 1", "cjthomas31May 18 at 6:57 PM\nGreat Game and Extremely Relaxing\n\nMy wife and I have been trading off playing for the last several hours. We've already racked up well over several thousand dollars to buy new colors and patterns. Definitely worth the money.\n\nStill 5 stars but I would definitely recommend similar things to what other reviewers have said. A way to add or change the style of music or stream your own and different room styles and backgrounds to give the room different atmospheres.\n\nOverall, it's extremely relaxing and fun.\n\nHelpful | 0", "sohlemacMay 23 at 10:23 PM\nRelaxing\n\nThis is a fun, relaxing escape from, well, anything! Worth the price. Would love to see a two handed mode as well.\n\nHelpful | 0", "lorenzomattei91May 16 at 2:52 PM\nVery nice, I would add...\n\n... More music\n\nA hint of vibration when touching the pot would help a lot with sensitivity\n\nPossibility to paint freely\n\nVery nice\n\nHelpful | 0", "Haduken93Jun 7 at 9:58 AM\nPlease add hand tracking!\n\nSurprisingly relaxing and addictive. This game definitely needs hand tracking in the next update, then it will be 6/5!\n\nHelpful | 0", "DonskibearMay 3 at 6:21 AM\nGreat lock down antidote\n\nAlways wanted to do this in real life. This is cheaper, cleaner and just as rewarding. Love it.. super relaxing. Made a ton of pots in my first evening. Would be great to export them as STL files and 3D print them... music might get a bit samey after a while but you can turn it off :)\n\nHelpful | 1", "hgamer48Jun 25 at 2:18 PM\nPoottery\n\nI like to pootter.\n\nHelpful | 0"]