{"App Title": "Lies Beneath", "App description": "LIES BENEATH is a single-player survival horror game with a heavy dose of action! Something's gone horribly wrong in the sleepy town of Slumber, Alaska. Now, returning college student Mae must fight to save her father (and her sanity) from the terrifying townsfolk and creepy creatures infecting her hometown. Experience a living comic book full of frightful scenarios as you uncover the secrets of Slumber and Mae's past.\n\nWith a full arsenal of melee and ranged weapons, Mae will fight monsters across the menacing remnants of her hometown. Along the way, she'll need to solve puzzles in her surroundings and find lore objects that uncover hidden truths. LIES BENEATH features several difficulty levels and comfort options so you can tailor the experience to your preferences.", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Horror, Shooter", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Spain)", "Version + Release Notes": "1.0-55578\n(LIVE)", "Developer": "Drifter®", "Publisher": "Oculus Studios", "Website": "http://driftervr.com/", "Release Date": "March 31, 2020", "Developer Privacy Policy": "None", "Space Required": "1.74 GB"}



["5 stars\n83%\n4 stars\n11%\n3 stars\n3%\n2 stars\n1%\n1 star\n2%", "BuddyBrosJun 30 at 9:15 AM\nJust buy it already!\n\nIm not a big horror fan, I mean sure I like the occasional horror game but Ive never even considered a VR horror game. But I looked at all the games action and decided to take a shot in the dark, and Im glad I did!\n\nThis game isnt very scary, I mean sure it has some tense moments but they dont end in something horrific, I only found one Jumpscare that scared the socks off me and my brother who tried the game. Anyone who has played will know which one Im talking about.\n\nThe melee weapons are a treat. You can alter the direction you hold them, and you can even hold weapons like axes with two hands which (coming from someone who has never experienced this) is an absolute treat to be able to swing at enemies while holding on to my weapons in an awesome and new way.\n\nThe ranged weapons are also very cool, each and every one of them has a specific way of reloading them and they all have their pros and cons which can make it difficult to decide whether you want to take a pistol or a revolver.\n\nNo one gonna read this all the way but I like writing so eh, but if you did then you are a certified cool kid :D have an epic day frend.\n\nHelpful | 370", "theoryofeverywhere24 days ago\nOne of the Most Complete Games on Quest\n\nI love this game. It is brutally difficult at times, even on the Normal difficulty level. This is one of the few games on Quest which feels complete. Its a long game by VR standards and has an intriguing story. The presentation is excellent and the tension you feel during the game is so intense at times. The music coupled with the sound effects make for a very unsettling experience. There are only maybe one or two times I had a proper jump scare in this game so one does not need to worry too much about that. But the game is creepy. I have played Exorcist and Dreadhalls, and this is a far better, scarier horror game. I have also played Journey of the Gods and this is a far more satisfying adventure/action game. I cant recommend this game enough, but be prepared for a challenge!\n\nHelpful | 20", "Robertobob100Jul 17 at 10:52 PM\nYou should make lies beneath 2!\n\nThis game was so well though out in that it has chapters and an amazing storyline that keeps you \"reading to find out more\" or should I say surviving to find out more. I wish there was a second game with more chapters.\nIt could be like in a series and \"Lies beneath 2\" would be the same thing with the monsters and amazing combat but a different story. I think it would be another hit!\n\nI hope the developers can reply on this review and let me know their thoughts on this idea of a second lies beneath game. I have some cool storylines in mind that would make a great lies beneath 2 game.\n\nI do a bit of game design myself but I can't imagine how much time, dedication, effort and patients it takes to make something like this.\n\nThank you for providing an amazing vr experience. Well worth the price.\n\nHelpful | 17", "Dopho20 days ago\nI never write reviews but...\n\nIll start off by saying this is probably one of the best oculus quest games out there. Its really good as a game in general, the graphics are some of the best on the quest and work together so nicely. I will be honest this game scares me $hitless every time I play, but it does so through atmosphere, not jump scares. Im on chapter 6 and have been through 2 jump scares, which fit well and were scary. Basically just buy this game because you wont regret it.\n\nHelpful | 6", "BennyHaunna3Jul 6 at 3:06 PM\nGeez man\n\nWhat a great game. This game is my favorite game on the oculus quest store hands down. Great story, check. Great gameplay, check. Great weapons that are all fun to use, check. This game has everything, its so fun. Worth every penny. If you are thinking about getting it, I will warn you. It is a bit scary, so if you arent into that, then maybe think of something else, if you dont mind it, then get it for sure. I love this game so much and I am excited to see more. Devs, if youre reading this, this game is awesome, but there is some things that I do want.\n\n-more weapons\nCome on, who wouldnt want more weapons. I havent played through the whole game yet but maybe something like a bow would be really cool.\n\n-modes\nI know this game is story based, but maybe there can be some type of other endless arena mode that you kill a lot of monsters then burn a doll to move onto the next round or something. You should also have more than enough ammo, enough to where you run out so you can still melee and have fun with that, but enough to where you dont have to really worry about losing ammo. I just thought that would be cool.\n\n-customization\nHear me out. I know a lot of things in this game do not need customization but maybe something like changing the color of your gloves would be cool.\n\n-co-op mode\nThis would be so fun to go through the whole game in co-op. Maybe even a different story that you have to play in co-op.\n\nThis game is awesome so keep adding more things, I love it so much and you put a lot of work into this game. Thank you and I hope to see more in the future.\n\nHelpful | 16", "Balakae.exeJun 8 at 1:22 PM\nOh my god....\n\nThis game is hands down, my new favorite vr game (and Ive played boneworks!). The story is amazing even though I was confused with the ending Im gonna go back so I can figure it out. The graphics are insane for the quest, they are very simple but the way the drifter team pulled it off is amazing. The mechanics, dont even get me started... THEYRE SO GOOD! you can hold 2 handed weapons, the 9mm can be reloaded like an actual gun or you can just push the mag, THEY GIVE YOU CHOICES! The interactivity is amazing, although I wish there was a bit more, I know its not easy so the games still amazing. This game is by far the best experience on the quest from the graphics to the len- oh yea, that too: the length of the game is about 5-6 hours, for me it was longer cause Im bad XD. Anyway its a truly amazing game and I cant wait to see future updates. Speaking of that hear is a recommendation:\n\nHorde mode: There should be a horde mode so there can be replay ability in the game, the further you go the more guns and ammo, maybe with multiplayer but if no multiplayer, thatll still be awesome.\n\nKeep up the great work guys and thank you for this memorable game :)\n\nHelpful | 52", "Evagrius77720 days ago\nA graphical marvel!\n\nA VR experience that deserves a 5 star rating! This title has a mysterious and eerie story line, engaging and creepy action, and some of the best graphical quality the quest has to offer. I originally purchased and deleted this app almost immediately because I found it too far scary for my taste. After reading numerous reviews and watching recorded play through videos, I decided to try the game again. Apparently the exposure better prepared me to work through the fear and enjoy the game. Im not a horror fan by any stretch, but once you get conditioned to the frightening music and small number of jump scares the unique art style, creative narrative, and incredible gameplay make it well worth it!!!\n\nHelpful | 4", "Brownstreak126 days ago\nAmazing just one thing\n\nI absolutely love this game because of its mix of action, horror, and great art style. It has an okay story but its still lots of fun. Im stuck on one part and i cant remember what chapter but its around the 39% mark. its right after you see the witch woman with no head in the tunnel and then burn the doll. Once the doll is burned everything goes back to normal but when I flick my lighter it just goes straight up. I walked up the stairs where at the top it says something about a good luck charm, and then I went past all the spider creatures onto the boat and killed that one big dude. After all that it sill kept going straight up and then led me back to the save barrels right before you enter the town. I dont know what to do and if I could have help that would be very helpful thank you.\n\nHelpful | 0", "Ferret4209Jun 18 at 10:34 AM\nFantastic experience!\n\nDisclaimer: I am NOT a horror veteran. I love the genre and have a lot of knowledge about horror games, but this is the first true \"horror\" game I've owned.\n\nI've only played this game for about 2 hours, but I've loved every second of it! The art style is perfect for the Quest, really maximizing the art with the graphics available. The story so far has been excellent, and I'm constantly searching for secrets in every chapter. Combat has been really smooth, and I have no complaints about gameplay. The audio design is also amazing!\n\nAs far as horror goes, this is not the scariest game out there, partially because the weapons help you have some measure of confidence. This means that even if you're not the biggest fan of scary, you can probably handle it. It is scary, and it does deliver some good jumpscares and does keep you constantly on edge, but it's not to the point that most people can't handle playing it. It does give me some Resident Evil vibes both in the gameplay and in the general level of scariness (comparable to RE7, maybe?)\n\n*I have never played the Resident Evil games, but I have watched complete playthroughs of 1,2,3 and 7*\n\nI haven't explored many of the horror games on the Quest, but this is certainly the best one.\n\nAll in all, this is a must- buy for any fan of horror, a great story, or even fans of FPS games. It's easily been the most engaging and immersive experience I've played on the Quest. Definitely my favorite game available. Thank you to the developers for making such an amazing game! !\n\nHelpful | 16", "BeamyRacccoon24214 days ago\nVery spooky\n\nI think the game looks absolutely amazing!! It gives me that borderlands/ comic book feel.\nIt was so scary that I needed a friend to play it with so I wouldnt feel alone. Very scary maybe to scary, I dont even want to play it by myself anymore. Overall its a good game and worth a buy.\n\nHelpful | 0", "fresh_sombrero4 days ago\n\nThere is just a right amount of horror and calm moments when you can breathe and think about what you just saw.\nCool weapon system, atmospheric environments, engaging story, nicely stylised graphics - this game is great, among the best on Quest.\n\nHelpful | 0", "LyimJul 23 at 10:21 AM\nSend help please!\n\nArguably the best horror game on the platform (even better than FNAF), this game doesn't rely on jump scares to terrify you, they use the atmosphere and creepy enemies to send chills down your spine. From outside of the headset the graphics had me skeptical but from inside the headset, they look amazing and the graphic effects really blew me away.\n\nHelpful | 2", "TheAwesomeBrosJul 22 at 10:15 PM\nKeeps you on the edge of your seat/feet!\n\nI am typically not a huge fan of the horror genre, but this game is a MUST have. The artwork, music and use of lighting/atmosphere is truly fantastic! The story builds throughout the game (20 chapters-Long game play :) which always keeps you guessing and piecing it together as you collect items, etc. This Psychological horror/survival game was way better then I originally intended it to be.\n\nRecommend wearing headphones while playing to get full surround sound.\n\n10/10 would recommend!! \n\nHelpful | 2", "devinbrosephApr 2 at 5:12 AM\nWow...\n\nThis game is the first game Ive been excited for in a while, and for good reason. Ive played for 2 hours and Im only on chapter 5 of 20! This game has an awesome minimalist art style that allows for some things i never expected to see on the quest. This is for sure a classic that anyone and everyone needs to play! Two handed weapons, guns, rag doll physics, and a super cool story, this is a must have. UPDATE: Just finished the story, easily 8-10 hours of playtime, amazing storyline\n\nHelpful | 363", "Deaf_PandaJul 16 at 9:42 PM\nIf you like half life, you'll like this\n\nIt reminds me of half life in that it's supposed to scare you (think Ravenholm), but its sole purpose isn't just to be a horror game. Like half life, its a very story driven game that involves shooting plenty of enemies. As a bonus, its got some cool melee as well. The graphics are fantastic and beautiful in their own right. If you like comics or manga, you'll like this for how the story is portrayed. It is absolutely scary, but also exciting and fun for the combat aspect. It honestly gave me one of the biggest adrenaline rushes in my entire life, and I'm only 5 chapters in. I'm definitely looking into the developers who made this, looking forward for more games!\n\nHelpful | 2", "ColdTurkeyJul 9 at 8:03 PM\nBest game on quest\n\nThis game is amazing if you are into the action and shooter genre then just get it. I you like horror just get it. There are a couple jump scares but if you look up where they are then you will be fine. It took me 12 or so hours to beat and it is super challenging but fun. Not to mention but the story is also one of the best leaving you to piece it together until the very end.\n\nHelpful | 3", "PrinceCarnivorJul 6 at 9:39 PM\nA strong story that struck me.\n\nThis whole game. I mean all of it. Has dark and beautiful story telling. I felt what the main character felt the whole way through, mainly because I mentally went through the same thing, but not as fun. When I was getting to the end of the story. I felt familiar pains. I wanted to cry at some points because the story was told in a way that I could connect it to when I went through it. The developers did a beautiful job.\n\nIf anyone that's interested in trying the game reads my rating just buy the game. It's filled with action and a story.\n\nAnd to the devs. Thank you for such an emotional ending. I loved it even though it was so heart felt. I'm trying not to spoil anything and I hope I didn't for the new players that experience this game.\n\nThis is one that hit me hard and kept me on my toes. This is the first scary game I played in vr and I'm so happy I chose this one to start off the horror games.\n\nHelpful | 3", "Kylemlgboss21 days ago\nTop 3 quest games\n\nI love this game so much, and I havent even finished it yet! Theres not much to say, other than the gameplay is smooth, can be challenging at times, and the artstyle is incredible! Not many jumpscares, if thats not your thing, and if it is, then its still very spooky\n\nHelpful | 1", "tonicbreaksMay 24 at 2:28 PM\nBest game I have so far\n\nDont be put off by the genre. Yes its scary but its not too scary to stop you playing it. Also, the game helps you build the courage to keep going.\n\nI got the Quest for complete immersion and this game is the most immersive game I have played so far. You dont have a moment to think about anything outside of the headset as you are kept on edge throughout. Its well balanced between tension and action, with a story that compels you to keep going. Not to mention an art style that looks amazing and good sound track that brings the atmosphere.\n\n5 stars and more! Great game!\n\nHelpful | 25", "Thebeanmachine122 days ago\nWhat a great experience\n\nThis is by far one of my favorite games on the quest right now. If you have been debating on getting it you should just go for it you will not be disappointed.\n\nHelpful | 0", "nate.busch4 days ago\nA bug on the last chapter\n\nOn chapter 20 right before the end of the game youre supposed to read the comic and my guns were out I couldnt holster them or anything just stuck with guns in my hands unable to progress. The game was fun but man a bug right at the end sucks. Please fix this so other people dont have to deal with it.\n\nHelpful | 0", "JoeySnozzJul 10 at 9:02 PM\nHorror but not horror\n\nI HATE ANYTHING HORROR, but this game is the best game Ive played on the quest. Its the perfect blend of tense moments and action, I love chopping the heads off of zombies and making my family play so I can watch them get scared. I highly recommend trying it even if u dont like horror.\n\nHelpful | 2", "geodashaddictJul 25 at 2:28 PM\nI loved it\n\nThe game was amazing i loved everything about this game. The puzzles were fun and simple yet challenging. The weapon designs and just the way it looked was amazing. I had no issues or glitches playing this. It was the best experience on the quest I had and if i could i would give it a 10/5\n\nHelpful | 1", "Droculah7 days ago\nGreat Atmospheric Game\n\nI love horror, but don't like horror games in VR. Go figure! Too immersive. That said, I have had this game on my wishlist for a while. I just thought the style seemed very cool, and I liked that it was a full game with a story. So I eventually bit the bullet and bought it.\n\nThis game is very creepy and atmospheric. I forced myself to play through it in short bursts. I appreciated that there were varying difficulties you could choose from, because I played it on easy and was happy with that. That way I could play through the story, be creeped out, but not overwhelmed.\n\nI like the comic book style, and although linear, the game is really fun to play. I did find inventory management difficult to handle in pressured situations, though.\n\nThat said, this game took me somewhere between 6 to 10 hours to play, and I enjoyed it. I'm not entirely sure because I lost track of time while playing. I do wish there was more story explanation though, because by the ending, it still wasn't clear to me.\n\nThis would be five stars, but I removed one start due to a bug that I experienced. At the very end of the game, you read a comic book, but I could not do that to complete the game because the weapons from the previous scene were stuck in my hands. I have read reviews, and other people experienced similar. I had to replay the final fight scene all over again just to beat the game.\n\nBut overall, this game is definitely worth your money. And even if you don't like or play horror in VR, force yourself to experience this one!\n\nHelpful | 0", "ZethriaJul 22 at 7:32 PM\nAmazing\n\nPerfect game, the environment is nice and creepy and the gameplay is fun. There isnt a lot of pop ups but it still manages to creep you out with the nice soundtrack and monsters coming after you. This game is addicting and I recommend it to anyone looking for a fun game to play with a nice story\n\nHelpful | 1", "Connacemox11 days ago\nCaptivating\n\nWonderful story line, art style is phenomenal. It emmerses me to the fullest. One of the few games on here that manages to terrify and enchant. I have not a single negative comment.\n\nHelpful | 1", "bobman2232Jun 20 at 9:24 AM\nGreat game!!\n\nThis game is awesome!\nThis is the first time I have felt compelled to write a review!\nNormally horror games really spook me but this one just did it so nicely. The fact that you can actually fight back helps!\nI saw another review saying don't be put off by the genre and that is so true! Yes, it's a horror game but the game play and the art style is just great!\n\nWell done \n\nHelpful | 4", "Marirari89Jul 20 at 3:15 PM\nAtmospheric to the brim!\n\nThis has to be one of the most beautiful games I have ever played! The cartoon style is so well done, that I never felt done with it, and the art style continued to captivate me to the very end.\n\nThe game had a creepy feeling, and at times it scared me, but I never felt that it was too scary. It had a sort of throw back feeling to good old horror entertainment. Something I do not often see. The game is overflowing with originality and beauty. The weapons and enemies are awesome, the environments are awesome and the story is awesome.\n\nOnly thing I did not like as much is that there were some bugs in the game. At the end I had to retry the final chapter because my character would not let go of her weapon and lighter at the end, which hindered me in grabbing things.\n\nHowever, the bugs were few and far between. I would easily recomend this to any and every horror fan. I give it 5 stars without hesitation!\n\nHelpful | 1", "Liano_VJun 25 at 10:19 PM\nDefinitely reccomend.\n\nI haven't felt so immersed in a game before. It's thrilling it's fun and it keeps you pulled in. I've wanted a semi scary game for awhile but all I get reccomended is cliche zombie shooters that really aren't that great (yes I mean the one in the store). I'm not even 5 chapters in and I'm in love. The art style feels modern but indie and I couldn't imagine it any other way. It's got a quirky comic book style that I thouroughly enjoy. I absolutely reccomended this game to anyone looking for a not too scary game with a good story and action. It's amazing.\n\nHelpful | 3", "ashton.gee.94 hours ago\nReally good game\n\nOnly a few jump scares, but youll be on edge the whole game. Has a good amount of content for a VR game\n\nHelpful | 0", "lotsotech15 days ago\nFull-length horror action\n\nTo its credit, this is a pretty dark and thematic horror title. I'm playing on easy and given the bugs with the controls I'm glad I did. At least at this difficulty this isn't a \"survival\" game where you never have enough resources, instead you're typically tearing through the enemy hordes until you find the next save point/cache where you can restock your ammo.\n\nGraphically, the flat pulp style graphic do a decent job of covering the very low poly count. Occasionally you might catch yourself looking at some blobby thing not totally sure what it is.\n\nI gave this 4 out of 5, but it's probably more like a 3.5/5. Despite what I like about it, the control are pretty awful. I've literally watched weapons just fly away, switch hands or just disappear altogether. Dropping something on the ground is a death sentence for it as the terrain just gobbles it up. Also the game bases your \"back\" as behind your POV and not between your hands. So when you look to your side you weapons move even futher, more awkwardly behind you. Playing seated is a challenge, I'd recommend a low back chair with no arms. Otherwise you'll be in the middle of combat and not be able to reach your holster.\n\nOne more plus, melee combat is pretty satisfying. Weapons still like to fly away or get stuck in enemies (this is probably intentional if not poorly implemented). However there are some satisfying thuds and what not which makes hand to hand feel really immersive.\n\nI definitely weighted the overall package moreso than the control issues, but I think if you're prepared for the worst, you'll know what you're getting yourself in for.\n\nEdit: Also forgot to mention that I find the smooth movement to be a little worse than Half-Life: Alyx. I can't seem to ever quite get to a point where I'm not nauseous. Guessing there's probably some tracking that's just not quite dialed in. Be prepared to chew off 30 minutes or so at a time until you need a break.\n\nHelpful | 0", "HAMMYham3.014 days ago\nIm so sad\n\nThe game is really good love the art style of the story love the action but my dumb deleted message me when I finish the game so now it looks like I did\n\n\n\n\n\n\n\n\n\n\n\nHelpful | 0", "Meh_AustinJun 29 at 5:53 PM\nBest Game Ive Played on Oculus Quest\n\nThis game is just baffling, and it has 6-7 hours of gameplay. Despite one of the categories of this game being horror, do not think of this game as a full on horror game, Yes it has scares but they arent so bad that you would hate this game if you dont like horror. In short, buy this game it has an amazing story, its immersive, and once you play it you wont want to stop.\n\nHelpful | 2", "vr_warehouseApr 4 at 4:47 AM\nHalf Life Alyx of the Quest\n\nTl,dr:\nBuy it now. Stop wasting time reading these reviews. You already know. Buy now \n\n\nLONG BREAKDOWN POST:\nI was compelled to review.\nNo Spoilers. I wont even tell you what color the sky is!\n\nThis game has showed me, these devs are finally understanding the hardware.\n\nWhat they can do with these shaders given the system limitations - is insane. Talent \n\nThis game revealed to me.. a whole new generation of *getting us hooked* games are on the way.\n\nLies Beneath in my eyes is the Half Life Alyx for Quest. (As in a groundbreaking game for this limited, constrained, hardware)\n\nWhat I am saying... the cohesiveness of the mechanics & design make some fluid in-game systems, and because of that, its ground breaking.\n\nLies Beneath has sent out warning shots   to all other game studios.\n\nThis title, is going to force all other game devs to step their game up, now that we consumers know whats possible on this hardware.\n\nBefore the review..\nLets get the ugly bugs out the way 1st.\n\nDrifter studios is reading and they move swift! See updates below.\n\n\n- - - - BUGS OR DESIGN OVERSIGHT - - -\n\nBLACK SCREEN BUG [FIXED]\nAppears when we are within the invisible colliders of an object. It seems way off, I am no where near said object and black screen triggers. This really needs to be addressed. Happens a lot.\n\n*UPDATE 1*\nApril 2nd - Dev responded fix will be incoming soon via update!  Fast response. They are on it!\n\n*UPDATE 2*\nApril 3rd - Devs released TWO micro updates in the last two days. WOW! I am happy to report BLACK SCREEN is now fixed! Player will no longer experience an abrupt screen blackout instead.. your screen will granularly fade to black. Non intrusive, non ajarring. Very natural and gentle.\n\nBasically the further you move into a solid object (wall, table, chair.. etc) the game slowly blackens out your screen. This is letting you know, back away.\n\nQUAINT ROOM CHAPTER BLACK SCREEN BUG [FIXED]\nFixed via second update. See above^\n\nTHROWING WEAPON BUG:\nGame thinks we are throwing or releasing melee weapon sometimes, grip button was never released, therefore Axe, Knife.. etc gets stuck onto the object we strike with weapon.\n\nCROUCHING HEIGHT BUG:\nPhysically crouching in the game makes you taller, thanyour real world height.\n\n\nCONTINUE QUAINT ROOM BUG:\n(extra lite spoiler)\nWithout spoiling exactly whats going on, for players that are reading, let me be as vague as possible.\n\nWhen you die, and restart..\n*Players will be spawned back in mid battle*\n\nwith barely any ammo, none of the *setups* you put in place, when you died, no longer there when you spawn back in.\n\nPlayers if you encounter this bug, heres what you do to bypass it. To start over without being spawned inside mid battle:\n\ngo to main menu/ choose your save/ choose quaint room chapter/ and you will start at the beginning of quaint room pre-battle.\n\n\nPAUSING GAME OR ENTERING MENUS BUG:\nWhen player pauses game, then resumes.. player looses orientation, they resume game facing an entirely different perspective. Extremely jarring. Creates confusion.\n\n\n\n\nREVIEW TIME..\n\n-INTUITIVE SMART DESIGN & MECHANICS-\n\nNATURAL HUMAN PERCEPTION & SENSATIONS:\nAll of these are activated when in the act of doing something. Many games on the Quest fail at triggering these immersive receptors as significantly and dramatically as Lies Beneath does. (I own about 70% of the top selling quest games)\n\nLet me explain...\n\nIm chopping wood in the game, the haptics are so perfectly aligned with my swings, it communicates with my mind and says.. HEY! this is the end point of your axe downward swing dont you feel it? So go ahead pull it out and chop down again.\n\nThe haptics do an amazing job conveying the realistic physics into the mind, thus, letting the mentals create the rest of the illusion for your body to feel.\n\n\nThis is NOT easy to speak onto a players mind in VR and as I am saying this.. do keep in mind they are doing this on 2-3 year old snapdragon chipset and with limited hardware capabilities. They are within constraints.\n\nLies Beneath has done what you would call Art of Code this is some Picasso type of code levels. When its all said and done - Drifter needs to place this code block on a art gallery and frame it   This is that good.\n\nLot of games, do not provide this kind of physical organics feedback because of its difficulty. Hence, most games feel as if youre swinging at air, gliding across the ground or just not quite in tune with realitys version, of said sensation, to that action you are committing. Basically.. uncanny.\n\nThe only other games that I feel come close in this regard is Simulator Series, Red Matter and the recently released The Room to name a few.\n\nDrifter, I bend the knee, and pledge fealty you killed it here.\n\n\n\n3D AUDIO\nYou will pull up an ear muff because you think its in your house.\n\n\n\nFEAR FACTOR\nLegit! All those franchises you recall when going down memory lane:\n\nH.P. Lovecraft Cthulhu, Resident Evil, Alien Isolation, Dead Space, Amnesia the Dark, Outlast, Five Nights at Freddys... whatever is your cup of tea;\n\nbest believe Lies Beneath will be sharing that same shelf alongside those titles.\n\n\n\nPACING\nMan oh man! I have always said pacing in VR is wicked important.\n\nStick close to the human perception and familiarity when it comes to the physics of pacing/movement and watch how quick the human mind dips itself into your lake of immersion.\n\nThis game oozes with perfect pacing. There are some splashes of above normal speeds every here and there, but thats ok. You want to sprinkle Intensity around to keep the cadence fresh and spontaneous.\n\n\nSOUND - ATMOSPHERE - MOOD\nTake your time.. dont rush, take in the scenery, the sounds and watch how this world will *absorb you*\n\nThey did such an amazing job with the atmosphere, mood. Dont waste your *1st contact experience* by speeding through.\n\nGood job here Drifter. Give your level designer, 3D Artist and Sound Crew MAD PROPS\n\nThey set the stage!\n\nThis symphony of audio & visuals - grabs everyone upon first contact.\n\nYoure immediately hypnotized. No hype. Just excitement from being on the ride.\n\nLook at the overwhelming response by most.\n\nYou got a few haters.. but thats everywhere. What matters is the ratio. This game has pleased the majority of those that invested into it.\n\nThats a good sign and they deserve it!\n\nWhen you play, you can tell a lot of soul, passion and labor went into getting this developed for us to enjoy this gift... of a vision.\n\n\n\nSURVIVAL\nThey nailed this one. For all you survival heads (play this on hard) thats where I started and still in there. Its perfect. Especially if you have 10x10ft or more. A wonderful, engaging, surreal experience.\n\nHard difficulty is not hard because they just made the Ai more difficult. What Lies Beneath hard difficulty, is hard because resources are truly scarce. Doesnt handicap you. Makes you rely on all youve learned\n\nHaving to use your mind and manage resources... while in the middle of fear! In case you havent survived in real life.. This is exactly what it feels like! Managing while in fear!\n\nThat said.. scarcity is the mother of all skill & invention, which leads to my next bit...\n\n\nORGANIC LEVELING\nNo, there is no progress and gaining abilities. The skills come from when you gain understanding of the mechanics they put in place. One of those, easy to learn but hard to master type deals. Yea, thats in here.\n\n\nYou will find yourself at first **kind of ** understanding whats going on because the simplicity of the mechanics is so well done, it touches your minds spectrum of familiarity.. so.. yea you get it.\n\nYoull quickly recognize the weapons, a little while after youll gain insight on enemy attack patterns, a little while after youll come to realize not all the eerie music means something is going to creep up on you.\n\nThen eventually youll attain techniques on holding more weapons than the slot limit allows. 2 on hand, 2 in the slots. You then learn to throw those melee weapons and create combos, even learning how to get assassination instant kills.\n\nAbout 2-3 hours in, all these systems creep into your minds crevice and your body eventually grabs on to that knowledge.\n\nYoull find yourself *on reaction* start performing all these physical actions you learned, that they built you up for slowly as you progressed. Again - on reaction, straight gangsta!\n\nAnd its at this point, though in fear, you will recognize your skills and you will confidently rely on them, because yea.. you just found out - you are about that life.\n\nJust dont get arrogant these monsters will lay you out. So many patterns to look out for, when they start arriving in groups.\n\nWithin 4 solid hours of me playing. I started feeling like a demon hunter (still scared asf) for I knew, it could be over at any moment.\n\n\nCOMBAT\nHas a splash of Dark Souls, Bloodborne or if you play iOS games - Pascals Wager. Its in here with combat. So yea, gear up!\n\nLook for patterns, get yo combo strings together.\n\nPlant those axes & wood daggers onto neighboring tress or wood surfaces. Theyll stay there.\n\nUse them as grab and throw combo tactics or keep nearby while in middle of combat in case you need to grab something real quick because out of ammo.\n\nDont forget, that weapon you threw at enemy.. that got stuck in their body, you can retrieve from them when they die afterwards or you can pull it out of them while in battle.\n\nSo many combo options here. Experiment!\n\n\nSTORY\nMasterpiece for what it is. Very well done. Nicely opens up for you a bit, at a time. No overwhelming you with it.\n\nDo get the lore pieces so you can delve further, in small chunks on what is going on.\n\nFINAL THOUGHTS\nIf this game does not sell Superhot or Beatsaber numbers. I have no idea whats going on with people.\n\nThis is a classic. I look forward to this becoming a franchise and seeing future parts to this.\n\nBuy this game, support talent when you come across it. I assure you, you will not be disappointed.\n\nCast it on your TV, have someone watch you play and theyll be in tears  as you start letting out high pitch yells! This game will do it to you.\n\nHelpful | 132", "quanster7621 days ago\nKeeps you on your toes\n\nI love the concept of this game and I feel a sense of unease throughout. This is what Id hoped. I find the only thing that lets it down is the ease of using and arming the weapons. It maybe me and it just takes a bit more practice but a lot of the time I feel I want something to respond in a mini second and it feels a bit fiddly. The developer has restrictions with the hardware and I can see a game like this improving tenfold on the next generation OQ. Loved the game overall.\n\nHelpful | 0", "gerblooshJul 9 at 5:44 PM\n\nI constantly play horror games and I dont know if its just because its vr but this game is constantly scaring the piss out of me.from the subtle noises to the straight up in your face jump scares I am constantly punching walls when I get spooked.get it if you like horror and dont have any heart problems.\n\nHelpful | 1", "PyrowhoJul 8 at 9:25 PM\nMommy\n\nYou better have tour mommy next to you holding your shoulders. This game is sick, itll make you jump and scream. The level design is really good, the music and sound effects are top notch and the monsters are fun to take down. There are some areas where youre our numbered and it gets frustrating but once you make it out alive its rewarding. Im only half way through but its been intense all the way. If you like horror and want to crap your pants this is a must buy.\n\nHelpful | 0", "CanniveltJul 5 at 11:41 PM\nVR Survival Horror Done Beautifully\n\nAfter first laying eyes on this game, I immediately thought of it as something inspired by Silent Hill or Resident Evil, and if you like any of those titles or any kind of survival horror than chances are youll love this experience.\n\nThe games has a very unique form of storytelling that is seamlessly combined with the art style akin to a comic book. The monsters are creepy and often unsettling, resulting in a decent verity of foes. Bosses are also very enjoyable and satisfying to defeat. The Protagonist you play as also has her way of lifting scared spirits with a snarky comment here and there.\n\nShooting mechanics are great, ditching the whole manual loading system for something more arcade-like. Sure that was a bit of a turn off when hearing that you dont manually load shotgun shells or pistol rounds but it works really well and helps amp up the action.\n\nIf youre looking for puzzles, you might be disappointed. However there are a few head scratchers the puzzles are very straight forward; put the hook on the loop. Even though they are a bit upsetting its still a very welcome part of the gameplay between exploring and shooting. There is also a decent variety of guns in this game. Just enough to level out the playing field and make the experience special.\n\nEnvironments and ambiance is key to making a good horror game and this game delivers ten-fold. There were parts I found myself imagining things in the fog that werent there (like seriously, no enemies or scripted figures, just imagination). Although there is a few stock-sounds and jump scares, nothing is scarier than having to enter the dark armed with a lighter and a pistol while hearing sounds coming from god knows where. The world is also pretty big and beautifully designed, even on the Quest I found the graphics to be top tier.\n\n\nOne of the few problems I had with the game was accidentally dropping stuff. Inventory is scarce, giving you only 4 slots. Two for melee weapons, pistols, and healing items. Two for larger firearms. And 1 other but its only for the lighter (the best item in the game! Seriously use the lighter any chance you get). The placement of these spots are in great places, pretty much holsters on your hips and back, but Ive found myself going to place back a pistol or healing item into the holster and waking a fair distance, encountering an enemy and reaching for my gun only to realize its not there and the holster never detected it when I went to place it. Its easy to misplace items and accidentally leave them behind, but lost items always return at some checkpoints so its not all bad. Ive only had it happen to me a few times so its not that big of a deal.\n\nRegardless, if youre looking for something action packed, story driven, unique in terms of art direction, and scary, then buy this game. Its well worth the money. Not only was it one of the best VR games I love played, its one of the best horror games Ive played in general. Youre not going to find Resident Evil or Silent Hill on the Quest (at this time July 2020), but this is the closest you can get!\n\nHelpful | 0", "LASERTEETH7 days ago\nGreat art style, great game\n\nHats off to the developers for this one. Truly unique, engaging and lovingly crafted\n\nHelpful | 0", "michael.laplante.90Jun 30 at 10:55 AM\nIn the tradition of the Silent Hill...\n\nVery reminiscent of the original Silent Hill that I played on the PS2 way back when.\n\nPROS:\ni. Graphics and environments are well done. The monsters are creepy and quite creative. Random jump scares will keep you on your toes too. The sound effects and the soundtrack also ratchet up the tension.\nii. You can tailor the difficulty to your liking. I tend to play on the easiest settings because I'm more interested in exploring, and getting on with the story than button mashing.\niii. There are lots of opportunities to save your game.\n\nCONS:\ni. The story is vague. There's an initial setup, and then you are just wandering around locations and dealing with waves of monsters. Along the way there nods to the story, but I couldn't put it together. Maybe some exposition scenes to more clearly explain things?\nii. You are the only character. It could have used some secondary human characters to interact with.\niii. It needed some periodic humour to lighten it up. After awhile the perpetually gloomy settings started to become oppressive.\niv. It could have used more puzzles to add some variety. There are a few as you get deeper into the game.\nv. I encountered a few glitches in the game...looping animations that required a re-boot, one time all my weapons inexplicably disappeared...\nvi. Illogical changes to the game play. Sometimes you can grab the rag dolls with your hands, other times you have to use your spear gun even if they are right in front of you. Similarly, you'll encounter a boarded door where your axe suddenly won't break it open... but the spear gun does?!\n\nHelpful | 4", "ArtFaceMar 31 at 1:32 PM\nThis is what I've been waiting for!!!!\n\nI love quest games, but so far this is the best one I've played so far. Still not done with the game, but this is a lot more of what we need on the quest. You won't be sorry you got this game because it's so much fun. The gameplay is so smooth and fast, and feels right....I've been playing VR games for years on the rift, but this run so well on the quest, it blows me away. Please make more games like this Oculus!!!!\n\nHelpful | 97", "yoseph99915 days ago\nThe Best Game On Was Quest\n\nThere is no other game that has the perfect combination of weapons, horror/tense moments, and story. Just buy it already. Thank me later.\n\nHelpful | 1", "jayph72Jul 2 at 7:12 PM\nThe Greatest, Yet!\n\nIf the title doesn't tell you, nothing I say will. But here it is: this game rocks from beginning to wherever you find yourself; too afraid to continue, headset died on you or you came up for air. It will have you rocking on your tippy toes; literally jumping, ready to run, swinging and shooting these crazy figures of Drifter Entertainment's imagination running at you, popping up out of nowhere on you.\n\nThe mechanics are great once you learn what it is requiring you to perform. There weaponry has what I call a secret compartment (your back on both sides).\n\nFound it to be challenging when you take the time to complete each level. Trust me it gets much harder to fight them off. It's okay to scream men, I have!!!! Many scare jumps, jump scares, however you wanna say it, they are there! Looking forward to an multiplayer update that allows for the venture to be shared, like drop dead but with it's current story and venture play.\n\n*The gun reload action does get stuck when being heavily rushed and you have to suddenly load to fight them off of you. Just calm down and not press the trigger when reloading and you'll be firing again. Just recover health next wave.\n\nHelpful | 0", "ummwhatsureJul 1 at 12:19 AM\nBest game on the quest\n\nI loved this game start to finish. The art style was really cool and there is enough varied weapons to keep the action fresh. The mood and atmosphere were perfect. Probably the only quest game I'll actually replay.\n\nI would love it if there was a post game activity like how starwars has the jedi dojo. Being trapped in one of the cabins fighting hordes of monsters would make this perfect game even more fun to revisit.\n\nHelpful | 1", "hunterevans1Jul 26 at 12:15 PM\nGreat Atmosphere with Sub-Par Gameplay\n\nRead my full review here: https://www.reddit.com/r/OculusQuest/comments/hycjlr/lies_beneath_review_great_atmosphere_with_subpar/?utm_source=share&utm_medium=web2x\n\nPros:\n-Atmosphere: Perfectly creepy and keeps you on your toes.\n-Graphics: I love the comic book art style. It drops you right into a mysterious horror comic book and I love it.\n-Guns: All of the guns are varied and fun to use. Especially the speargun that you get near the end of the game. Although it is useless in combat, it feels great to use it to open up paths and pull dolls towards you.\n-Boss fights: I loved the boss fights. Each one was unique and a lot of fun.\n\nCons:\n-Inventory: It limits you to four inventory slots. Two of them can only hold a shotgun or speargun. The other two can hold pistols and other items you find in the world. This is not enough. Limited gun ammo as well.\n-Difficulty: This game is unnecessarily difficult. limits supplies and throws too many enemies at you at once. Enemies do too much damage even on normal.\n-Melee combat: Mostly useless. You don't do much damage and enemies kill you in a few hits. Not a good combination.\n-Grab mechanic: very hard to grab what you want to in some situations, costing you precious time.\nBugs: some very frustrating bugs that can kill you instantly. And one game-breaking bug at the end that is preventing me from completing the game.\n\nYou can tell the devs put a lot of love and care into this game, but missed the mark in terms of gameplay. Only buy if it is 1/2 off or more.\n\nHelpful | 3", "Bataille2020Jun 14 at 7:57 PM\nGenuinely Horrifying!\n\nThis game is an entirely immersive and stylish adventure game with strong, nightmarish visual design. The horror element is quite good throughout. The art reminds me of something between Mike Mignola and old school Ralph Bakshi rotoscope films.\n\nThe story is not overly linear. The combat is incredibly satisfying and packed with gratuitous and visceral violence. The smooth movement is great and I have not had a single tracking issue.\n\nThis game is best played in short bursts. There are three modes of movement but the smooth movement is remarkable and satisfying. If you are not a heavily acclimated VR game player, I would suggest using the easiest movement mode.\n\nHelpful | 2", "DankishmemeJun 29 at 4:38 PM\nJust wonderfull\n\nThe game is incredibly well made and constantly keeps you on your toes. It does have a few jumps scares but the are placed well throughout the game. The story was very intriguing and the sound design is fantastic. There was only one point where I felt like the game just didnt give you enough to actually make it through the area but other than that it felt like as long as I paid attention to what was going on and how much ammo I had I would be fine. My only other small complaint is the grabbing which can be a bit wonky at times as it tries to grab wherever your hand is facing so sometimes if you try to grab something it just wont work.\nAll in all its a great game that I totally recommend, none of the enemies feel to powerful and it keeps a very haunting vibe as you slowly uncover what happened. It also highly encourages playing multiple times over as there are tons of lore objects to find.\n\nHelpful | 0", "DukefromearthJun 28 at 5:04 AM\nSurprising!\n\nAwesome horror action experience. Never thought I get in this much. The mood is so creepy with headphones. Provides a solid 8+ hours of epicness. No regrets for getting this full price as is doesn't feel like a mobile game at all. Great graphic design and use of sound. Got my heart pumping and got me the thrills I was looking for.\n\nHelpful | 0", "MYSTERIOVRMar 31 at 8:02 PM\nWow I hate horror but love this\n\nBest game on Quest. I don't do these kind of games I don't do scary, but my god was there parts of this that are scary. Exhilaration is not the feeling I always want in games but I just wanted more and more of this. I'm only chapter 13 so I dunno what the hell this master piece is but Oculus Studios you have nailed it with this game. Don't expect the interactivity of half life alxy but prepare to be scared and to enjoy an art form that truly works in VR. Scared Yet?\n\nHelpful | 68", "ajaswinskiJul 9 at 1:31 PM\nONE OF THE BEST FOR QUEST\n\nHalfLife Alyx meets Silent Hill by way of Tales From the Crypt horror comic aesthetic. This is what happens when art, design and tech come together within their playing ground. Just get it.\n\nHelpful | 2", "xxVertualKingxxJul 11 at 1:59 PM\nMY FAVORITE GAME!!!\n\nThis game give you a sense of survival while going through creepy experiences. As you go through the story and unlock new weapons, you start feeling more and more awesome. On top of that, the graphics for the quest is great!\n\nHelpful | 1", "ty.cobb.967Jul 5 at 9:33 PM\nTerrifying...\n\nAnd an incredibly well done and engaging story. Mostly linear gameplay but it makes it difficult to put the headset down as I just want to dig deeper and deeper into the story.\n\n20 chapter story, well worth the costs. Dozens of hours of game play.\n\nHelpful | 0", "TheoGuedes17 days ago\nBest horror shooter on Quest.\n\nA complete game. It's not perfect but worth every dollar spended on it.\n\nHelpful | 0", "lombad11 days ago\nGreat game!\n\nGreat game. I would highly recommend.\n\nHelpful | 0", "ziad99wa19 days ago\nGood\n\nGood game but difficult and little scary a must have for quest users\n\nHelpful | 0", "matthewdt14Jul 1 at 5:12 PM\nTime well spent\n\nThis game not only has a fantastic animation style that pulls you into another world and the story is very easy to grasp as you are given multiple secret items that help you piece together what happened. Definitely worth buying and enjoying.\n\nHelpful | 0", "sdouhneJul 7 at 6:41 AM\nWow what a trip!\n\nI really don't like scary things nor do I like scary movies BUT this is a great example of what can be done in virtual reality lots of Fun and yes super scary first time I've been scared in a game LOL\n\nHelpful | 0", "Jordan0510Mar 31 at 4:07 PM\nWow. Easily my favorite Quest game!!\n\nThis game is AMAZING! The game is so fun and enjoyable. I saw another review that said don't let the horror hold you back. I totally agree to that, however, if you are EXTREMELY sensitive to horror then of course I would steer clear. I myself am not sensitive to it, I just get pretty scared when playing horror VR games and while I have had a few anxious moments I loved them! The game handles them sooo well.\n\nThe combat is very very good, the gunplay is very solid, the reload for the revolver (the only firearm I have so far, will update later) is not super realistic, you flick the cylinder open, it displays your ammo count, you flick it shut and it loads. Pretty simple, easy to do, and fits the game well. The melee combat is awesome, there are some quirks to the hitboxes but eventually you learn to handle melee weapons well. I did have an issue with two handed melee where say I swing an axe with two hands the axe will rotate and the blunt side will connect not doing much damage. Stick to one handed, it works great.\n\nThe visuals are amazing. Obviously they are not photo realistic but the art style that is attempted, comic book art, is PERFECTLY executed. The atmosphere is great, the comic book dialogue is great.\n\nThe movement is well implemented, you have snap movements, teleport, smooth, I personally use Smooth Locomotion and it works great. The only odity is crouching. When I tried to crouch it readjusted my height and when I stood up I was about 12 feet tall, don't fret though, it takes about 2 seconds for the game to correct itself. I just wish I could crouch even if it does nothing mechanically but for immersion but it doesn't matter to me.\n\nMy honest opinion is this is the best game on Quest currently. It feels like a complete experience. The game I enjoyed most closely to this one is Super Hot VR. I can't wait for this to come to Rift, I will more than likely be replaying it on the Rift S. I can't recommend this game more.\n\nHelpful | 43", "HM9723 days ago\nOne of my bwst game ever\n\nI wish all horror games like this, sor sure its the best game ever\n\nHelpful | 0", "j_aem_13Jul 12 at 3:31 AM\nAdvanced zombie game\n\nTo address some of the other views expressed here (and as somebe who has played these) no this game is not in the same league as Half life Alyx or Boneworks. Both of those beat this hands down in terms of interactivity, weapon variety, graphics and so on.\nThis is a good game with a decent (around 3 hour) length. It's a sort of arcadey survival horror with a good melee system. Sharp objects react to being swung and hitting things realistically, a great step up for quest zombie games (Arizona sunshine's main game omits melee). It's very scary and the enemies and jump scares (of which there are lots - not sure why some other reviews claimed there's only one) are very strong.\nPart of this though is due to the foggy, muddy graphics. I'm not sure if it's due to the quest's processing power or an attempt to use the short draw distance to hide enemies, or both. Textures as always aren't great and the game did crash on my set multiple times.\nThe graphics are a sort of cell shaded 13 homage which looks cool. Levels are really odd in my opinion, with small open areas and linear gauntlets. The indoors areas are terrifying and intimidating due to their use of poor light.\nEnemies are not the most inventive - they're lovecraftian zombies - and once you get used to dying (and you will a lot, because of your low health) it takes some of the immersive fear out.\nI personally prefer Arizona sunshine as an experience. This is a great effort, but like AZ, would not command its asking price if it was not in VR.\n\nHelpful | 3", "igniteboiJul 20 at 9:45 PM\nLove the graphics and the gameplay\n\nNot a true horror fan but love intense action? This game is for you! The graphics makes you feel like you are in a comic book!\n\nHelpful | 0", "zoli.sauntMay 31 at 12:33 PM\nScary as f...\n\nSo as a huge fan of the resident evil franchise (movies and games), other types of seriously freaky games and classic horror films (hellblade senuas sacrifice for the Xbox, dead space etc. hellraiser, exorcist, the shining etc.) I feel like I have a pretty strong threshold when it comes to being creeped out. I can honestly say this is quite possibly the scariest game Ive ever played. I only recently started it and theres already been multiple times where Ive had to take a break and set down the goggles from being too freaked out even though I wanted to see what was next. And its not all just jump scares either. Despite its somewhat primitive graphics, it still somehow manages to convey the feeling of being in a horror movie better than anything Ive ever experienced before. The soundtrack is almost perfect and only adds to the intensity. There are times where you can see what youre going to have to deal with ahead of time and youre still scared sh..less when you come face to face with it. If the next one has better graphics and fixes some of the minor movement/control issues (which really arent bad at all compared to some other be games Ive played) it could quite possibly be a perfect game. Ive heard that The Exorcist VR is the scariest game there is so thats next on my list but for now, this will keep me peeing my pants into the wee hours of the morning for the foreseeable future. Get it if you like to be creeped out (which I do obviously). Dont if you dont. Youll hate it.\n\nHelpful | 2", "42ApplesJul 10 at 2:56 AM\nGood but not perfect\n\nI would give this game 4.5 stars I could but it is not quite worth a 5 imo. The game has a lot of creepy moments without relying too heavily on jumpscares. The art style and music is great too. The game took me longer than I expected and has even more replay value with its collectibles and difficulty levels if you want to go there.\n\nThe 2 main issues I have with the game however is 1) The melee combat and 2) the grabbing mechanics. The melee weapons themselves feel great and the throwing works very well; the problem I have is simply that the player hit-box is way too big for melee attacks. It feels like you can dodge completely out of the way of an attack and still get hit. Also sometimes the weapons that are thrown at you can get stuck on your hand and insta kill you which is very annoying.\n\nThe grabbing mechanics are what really put a bad taste in my mouth with this game. In the early stages everything works fine but once you get into the second half of the game where your inventory is full, it can be a nightmare. The reason is that the developers decided to implement a kind of force grab so you can grab things from a distance which is fine except for the fact that it is at a really awkward angle to even try to use it and they chose to prioritize the force grab even if your hand is right next to the thing you want to grab. This means that you can be trying to pick up something that your hand is literally touching but then end up just grabbing some 10 feet away because it was at just the right angle. This makes the end game really annoying because of all of the things you have do manage in your holsters. Still a great game and I would definitely recommend.\n\nHelpful | 1", "Ondre1234Jun 26 at 12:21 AM\nOne of the best games on quest\n\nTo be honest the game is the perfect mix between horror and action and a whole lot fun to play. Nearly every scenario is so immersive you completely forget where you are in the real. This game deserves 5 stars by right. Definitely recommended it.\n\nHelpful | 1", "xCHAOSxHOLLOWxJun 13 at 2:23 AM\nReally long and kept me on my feet\n\nThis game was really good and exciting. It was by far one of the longest games I have played on the oculus quest so far it was more than I expected and I definitely recommend getting this game. I honestly didnt want to put the controllers down and keep playing. Five stars mainly for the length and being one of the best games Ive played on VR.\n\nHelpful | 0", "CornnFlaek100Jul 1 at 10:06 AM\nLies beneath\n\nThis game is awesome, probably in my top 3 games. I wish the game was a little Longer, but even though it was short I was thoroughly invested in the story. Cant wait to see what Drifter does in the future.\n\nHelpful | 0", "ManhopperJul 3 at 12:44 PM\nAn amazing adventure in VR\n\nExtremely immersive..will literally make you jump at times...a stunning adventure through spooky environments looking for your father. Great controls and very addictive. Def worth a purchase\n\nHelpful | 0", "TheLastSenseiJun 11 at 9:46 AM\nFun, interactive, horror, & great story!\n\nAs a horror fan I found myself actually enjoying this title due to the story as well as the atmosphere of the game. You will begin a journey into quite the tale well worth the cash youll pay for this title. There is quite a lot to find to enhance the lore in game which means there is quite a bit of reading but the style they use is amazing because if you dont care to read or collect the somewhat hidden lore you can enjoy the game as is. Your fight or flight will be tested quite often and you can do everything about it... or can you?\n\nHelpful | 1", "MarkStirtonAberdeenJul 9 at 7:21 PM\nTerrifying and brilliant\n\nOkay, so now I know how it feels to have a huge monster burst out of the ice while other horrors try to eat me. Finished it, will never play again! Shudder.\n\nHelpful | 1", "Justcallmedoc90Jul 9 at 4:16 PM\nAmazing game!\n\nIf you want to feel fear at a somatic level...then this is the game for you! From jump scares to just creepy baddies, everything about this game is awesome!\n\nHelpful | 1", "KurlyFriesApr 2 at 9:13 AM\nThe First True Horror Game on the Quest!\n\nFinally, we have something special here. The storyline so far is the best and the comic-like cutscenes help be more immersed in the story. The creatures in the game are down right scary at times. Also, I say this is the first true horror game for the Quest because so far all we've gotten were experiences and not actual horror games with a storyline. I definitely get Resident Evil and Silent Hill vibes from this which makes it twice as better. For $30 it is a steal considering how long this game is. I've only played about an hour or two and I'm only 1/3 of the way done. THIS IS A MUST FOR ALL HORROR FANS!\n\nHelpful | 26", "Gamertag_VRApr 3 at 12:53 AM\nA Stylish Must Buy Nightmare Shooter\n\nThis game has surpassed my expectations in terms of graphics, sound and value for money with regards to play length and challenge. Im 68% through the game on normal and thats taking me 4 hours. Its a beautifully twisted experience. The gunplay combined with cool melee attacks will stay in memory for quite some time. I love Duel wielding 2 axes, seeing a nightmare creature in the distance, throwing them at a hideous monster which by the way make a really satisfying stabbing noise!! then pulling a pistol from your hip for the follow up finishing headshot feels very very cool. Oh! And the pump action shotgun dude! Oh and the machete man. All very very cool. Quite a few weapons can be found in the game along with secrets too. The Comic book cel shaded graphics not only suits the quest, but separates it from all other FPS games and drifter entertainment have really delivered one of the best nightmarish survival shooters in VR. All this VR goodness and more can be found on YouTube, Facebook, Twitter and Twitch just by searching Gamertag VR  Good Hunting..\n\nHelpful | 23", "100waterbares18 days ago\nBuy it\n\nJust do it\n\nHelpful | 0", "jackboydoughJul 26 at 1:05 AM\nTerrifyingly Amazing!\n\nExcellent game for the Quest! The combat is very smooth and very scary. I was constantly on edge and paying close attention to my surroundings, while being fearful I would run out of resources and get killed. The comic book theme is also a huge reason the game looks great graphics wise. The scares, story, and mechanics are amazing dont miss out on this one.\n\nHelpful | 1", "AlegotronJun 28 at 6:21 PM\nFantastic!\n\nI'd compare it to RE4 but it's got an identity all it's own. Creepy atmosphere, great graphics. Not too scary, more like a jalapeno than an habanero but its consistently a lot of fun and very tense\n\nHelpful | 1", "juan.comstock.50Jul 18 at 11:28 PM\nAmazing\n\nThis is the most amazing best game I played on here I love you and the reloading on it is amazing\n\nHelpful | 0", "lavonne.beach.714 days ago\nI dont regret getting it.\n\nIts terrifying and it's a good puzzle game. It's one of the first games I've ever liked on the quest. This is definitely a five star! But there was one bug I found. On the first boss fight he wouldn't appear but I heard him. And I tried going back but the barrier was still there. Please fix it. Thank you.\n\nHelpful | 0", "vrgamer228May 13 at 12:57 PM\nscary, amazing survival!\n\nthis game is great but it's not for everyone try playing for 40 minutes or so if it's not for you refund but it just might be something you would love it's one of the best games on the Oculus quest and I'm saying full game I still haven't finished I'm just too scared on the last part\n\nHelpful | 3", "LouisObviouslyApr 2 at 4:50 AM\nWhat VR needed! *Updated*\n\nThis game is hands down the best VR game to come to oculus quest. The graphics are amazing and so clever! I didn't think I would like the cartoonish art style but it really works! It's still terrifying and immersive.\n\nThe controls work perfectly and it's well explained at the start.\n\nUnlike other horror games there's actual gameplay elements to this game which is amazing! You don't just feel like you're on a conveyor belt of jumpscares. You actually have to think about how to play the game which is great.\n\n* The only problem I've found is that the sound doesn't work when I cast (via Google Chrome cast) to the tv. It's definitely a problem with the game rather than the Google Chrome because all the other apps with sound other than this game. Can this be fixed so I can share the experience with friends\n\nHelpful | 18\nDeveloper ResponseApr 2 at 10:39 AM\n\nHi Louis! We are aware of the issue with sound during casting/recording and are working on it. Unfortunately it is a bug at the operating system level that we are working with Oculus to fix. Fingers crossed the fix makes it into OS16. Thanks the feedback, and enjoy! :)", "phillyg202025 days ago\nWay to many miss hits\n\nFor the price these miss hits throughout the game are extremely frustrated. Like shotgun to the face and no damage. The controls and graphics and everything else are good, but it's frustrating with poor shots with such an unforgiving game. Tighten up Devs, I know you can fix this\n\nHelpful | 1", "G3nkiMar 31 at 2:45 PM\nA Must Have!\n\nI've played this game for about 3-4 hours and think I'm nearing the halfway mark. I've played a lot of VR and must say that I think this is one of the best and most immersive games I've played. I hope that this being a horror game doesnt put people off, the devs have done such a phenomenal job with this, from general design and how the story is portrayed to you, the player. The comic aesthetic is something to be adored and I hope more games take note from this, it's truly stunning. The gunplay and melee combat are both so satisfying, be it limb shooting/chopping or head popping/lopping, it all feels bloody fantastic (excuse the pun).\nMy only gripe with the game is that you can 't use your hands or the guns to knock back enemies so when you run out of ammo and have no melee weapons, you're quite the sitting target which I feel is the only thing breaking the immersion for me. I dont know about replayability yet but given the price, even if this game is a one play and done, it's beyond worth it!\nOh and did I mention that you're actually rewarded for your exploration! The lighter embers are great gameplay mechanic to show you the critical path, go the other routes first and find collectables and ammo etc, love it! Also the collectibles being interactive and lore driven, fantastic.\nA lot of care, love and passion has gone in to this game and it shows. I really hope the genre doesnt stop people from playing one of Quest's best games.\nI cannot wait to get back to it and see how crazy this game gets!\n\nHelpful | 16", "ShoNuffx32xApr 1 at 7:31 AM\nNext Level for VR Gaming on Quest\n\nThis artistic thriller/ horror game feels like it was made for the quest. Every detail starting with the menus and tutorials feel like they were crafted with passion which leads to a more immersive experience. It sounds simple but things like hitting a plank board with an ax just feel great!\n\nHelpful | 16", "OldmanpuzzlesJun 3 at 6:31 PM\nLies beneath: Best game on quest by far\n\nLet me tell you friend, I think there are some very good games on quest, however, this game blows them out of the water. This is bar none the best game on quest and I sincerely hope they make a sequel. This is a full game experience, with a full story line. The art and style are amazing. The game play is extremely intuitive. I can't say enough good things about this game.\n\nPlay. This. Game.\n\nHelpful | 0", "AzaelArzateJun 8 at 12:10 AM\nTWD saints and sinners for the quest\n\nThis game feels like a saints and sinners game, im not calling it trash im just saying its just like twd saints and sinners, the physics are not brought up, the double hand grip isnt too, and how scary and fun the game is with around 10 hour game play.\n\nHelpful | 0", "BigBeerusJun 3 at 8:43 PM\nSo far the best game I've played.\n\nManaging resources is actually a thing in this game, same with remembering the fastest way to dispatch something. The weapon physics are on point. Something in the comic style with these physics against human enemies would be great. Especially with a horde type mode\n\nHelpful | 0", "Yourmomgay181725May 26 at 4:22 PM\nNot into horror this changed that\n\nSo when this game was on the coming soon list. I thought. This game looks cool. And when it came out i was hesitant. If I should pay the 30 bucks. Maybe I wont like it. But I figured. What the hell. One of the best choices of my life. Its so fun. Im on chapter 19 out of 20. When I beat it Im going to be sad. Because no game will be like this again on the quest. And one of my favorite thing about this game. It is soo long. It takes my like 1 day to beat anygame. The fact that it took me 2 weeks to get to where Im at amazes me. Or Im just bad and cant kill the zombies lol. I HIGHLY recommend getting this. Trust me its worth it\n\nHelpful | 1", "Dookus_MaximusJun 5 at 8:38 AM\nGreat Game, One Gripe\n\n+ Combat is fun and satisfying.\n+ Atmosphere is appropriately creepy with the occasional jumpscare.\n+ Graphics are perfect. The comic book art style and level design help to create that creepy atmosphere that is also very stylish.\n+ The game offers various movement settings to accommodate any player.\n\n/ Difficulty does seem inconsistent at times, but perhaps it's just me. Can just lower the difficulty for certain parts but if you're stubborn like me, it can get frustrating. Not removing a star for this as it's entirely personal.\n\n- Casting to a Chromecast does not stream audio. Disappointing for when you want to show off your Quest and this game to friends and family. This game could be perfect for sharing! This is my single gripe and if I could rate 4.5 stars I would. I don't know how difficult it would be to stream the audio, but I know other games can do it.\n\nOverall I consider this to be an essential buy for the Quest, and it could be the perfect game for sharing with others if audio would stream too!\n\nHelpful | 2", "DaDansterApr 2 at 12:51 PM\nHoly crap\n\nThis is one of the best games ive ever played in my entire freaking life. People say vr doesnt have any good full fledged games. Well Asgard is one, walking dead is one, alyx is one, and you know what. So is this. Big words. But this is the big game for the oculus quest. Its a must buy. Im 40 percent done with the game and i can already say its worth 30 bucks. Imagine how ill feel after getting the other 60 percent done. Game is about 8 hours long. Incredible value. Better than THE OTHER ZOMBIE game. You know one. ARIZONA SUNSHINE. This one actually is beautiful to look at. Has a better story. More twisrs and turns. Etc. Definitely pick this game up.\n\nHelpful | 10", "WentlleApr 1 at 3:08 PM\nFLAWLESS\n\nTHIS GAME MAKES ME SO HAPPY! Please add dlc add more I want it. I NEED IT\n\nThe combat:fluent and fun\nHorror:scary well designed\nStyle:beautiful creepy\nLength: took me about 5-7 hours to complete\nPrice:SO WELL PRICED FOR THIS MASTERPIECE\nPLEASE BUY IT\n\nHelpful | 18", "BigEZWeezJul 4 at 7:41 AM\nSlow and boring\n\nPlayed for about 10 minutes and almost fell asleep. Have to keep clicking on a stupid lighter over and over again to figure out where youre going, then get attacked my a monster with no weapon and no way out? That makes a lot of sense. Atmosphere is good but thats about it. Slow, boring gameplay and everything looks washed out. Requesting a refund now.\n\nHelpful | 3", "mr_suav3Jul 3 at 5:18 PM\nGreat game\n\nAbsolutely 10/10 horror experience. One of the best pieces of VR ever made for sure\n\nHelpful | 0", "ken666Mar 31 at 4:12 PM\nWow !!! Like a PCVR !!!\n\nCongrats to the Drifter team! The game is fantastic, it doesn't look like a mobile vr game but like a pcvr game ! The artistic direction, the strong atmosphere, the awesome gameplay... Great job !!! This is the best VR game on the Oculus Quest by far for me!\nPs: By the way if you think about making one day a procedural roomscale game and non euclidian like Tea For God but with this universe, take my money! :)\n\nHelpful | 10", "KeytothecityzMar 31 at 7:51 PM\nBest Horror Game on the Quest\n\nHands down one of the best games on the quest.\nThe vibe is crazy and the gameplay is spicy. Enemies look great and movements look very smooth. 20 levels for $30 is decent Id definitely check this out if your a fan of Resident Evil or Evil Within. Id love to see a multiplayer wave mode like Cod zombies possibly and def would also dig an expansion of some kind Id def pay extra .\n\nHelpful | 10", "SlasherflixxMay 20 at 11:00 AM\nCall of Cthulhu\n\nwhat we have here is a perfect example of a development team using imagination ,creativity and style to remove perceived barriers of hardware limitation.Phantasm,evil dead,the Gate,Alien,carpenter's the Thing all movies made prior to the use of CGI and yet all masterpieces on film,not hindered by limitations of technology and budget,but enhanced by low tech solutions to high tech problems...but i digress...\nLovecrathian with a dash of late 60's early 70's comic book horror(hat tip to EERIE and Creepy franzetta and Boris Vallejo cover paintings...folks should google that stuff,how i miss those days)..would describe this Oculus experience in a nutshell.Your looking for your father with whom you were separated with after a tragic car accident,through a sometimes surreal environment that evokes the style of those old horror comics,the colors are awash in cryptic greys ,browns and dark reds almost like the yellowed pages of 1971 copy of Tales of the Zombie marvel horror rag.You encounter Tentacled and misshapen Dagon like Deepfolks.The sound and tense music is phenominal,a nice large pair of headphones plugged in to the side of the Quest makes the wind howl in your ears.The denizens populate a whaling village that wouldn't be out of place near Dunwich.But you are not unarmed.Many of the common tools of an out the way whaling/fishingtown become the weapons of choice.Machetes,Meat cleavers,Hatchets and Kitchen knives are deadly at Melee range or can be thrown and retrieved from not so dead bodies,they can be lodged into nearby wooden enviros to be retrieved on the quick in the heat of battle.Firearms also findable and ammo is strewn through the levels.Food and fire heal your wounds from insane encounters with these nasties.A lighter,gifted to you by your father leads you through the dark madness.I wont ruin the experience ,you have to play it for yourself..Thank You Drifter studios! ...just add a sandbox,where i can chase horrified townsfolk with a tenatcle and cleaver!\n\nHelpful | 1", "JuwannaPlayApr 2 at 10:28 PM\nBUY THIS GAME NOW! \n\nWhat do I have to say about \"LIES BENEATH\" ?\n\n*This game is absolutely mind blowing!\n*My favorite Quest game so far.\n\nQuiet and suspenseful!\n+\nLoud and terrifying!\n\n*SILENT HILL\\MEETS/RESIDENT EVIL*\n\n*A truly chilling experience\n\nIts like if Stephen King & M. Night Shyamalan\nHad a kid, and that kid wrote a story,\nStraight out of a \"Creep Show\" comic book,\nThat takes place in a \"Silent Hill\" nightmare,\nThat's twisted into the Further from \"Insidious\"\n\n*Get lost in this mysterious\nslaughter fest sure to make the hairs\non the back of your neck stand at attention!\n\n\nI HAVE A FEW REQUESTS,\nTO IMPROVE THE GAME EVEN BETTER.\n\n1. Change liquor bottles to molotov cocktails,\nthat can be lit using your lighter!\n\n2. Add 1 more belt holster on back!\n\n3. Make an online multiplayer hoard mode!\n\n4. Add future DLC content! (New comics)\n\n\n\nHelpful | 9", "v._.keyMay 27 at 10:35 AM\nBrilliant for horror fans\n\nI've been waiting for a horror game for some time now on the quest and it's finally here. Having completed this game, I feel like I can rightfully review it... unlike some of the 1 star reviewers. This game is brilliant, terrifying, but brilliant.\n\nHelpful | 1", "c3sourJul 5 at 8:47 AM\nIncredible!\n\nBlown away. No words really. A must for horror fans!\n\nHelpful | 0", "vik.sharma.12Jun 21 at 3:01 PM\nOne of the Best Quest Titles!\n\nThis game is amazing and so fun to play. The comic style graphics are fantastic. The ominous atmosphere really immerses you and the jump scares gets your heart pumping!\n\nThis game has an awesome storyline and one of the longer Quest titles. Most reviews say it takes around 6 hours to beat. I am the type of player who likes to explore every possible area/path before moving on. So for me the game took over 8+ hours.\n\nI would rate this game 5 stars but there are a few bugs that need to be addressed:\n1 - I know the dark effect is part of the atmosphere but sometimes the game becomes irregularly dark. So much so when I press start I can't even see the pause menu.\n2 - Sometimes the orientation and tracking is off when you resume the game (gun are backwards in holsters and hard to grab).\n\nOverall, I really enjoyed playing this game and definitely recommend it! Thanks developers for making a great game and vr experience.\n\nAfter beating the game, I wish I could replay certain chapters without overwriting the data.\n\nHelpful | 1", "tylerkilpJun 13 at 4:58 PM\nThe Refreshing game quest OGs needed\n\nReviews are all true. This game is one of the best on quest!! Played it twice through now, campaign is at least 5-6 hrs with great story graphics and gameplay.\n\nHelpful | 0", "Northern.LanceMay 11 at 7:20 PM\nGreat Story\n\nDefinitely an immersive game that reminds me of the borderlands animation style. The combat feels a bit janky, especially without defense. Im also not the biggest fan of games that reset you back to the last checkpoint, where you can be two steps from the next section for an hour because the last piece is tough but it takes 15-20 minutes to get there. Its the only thing that breaks the immersion for me (and then this guy comes around a corner, find the sandwich, then ten paces for the next to spawn, like the last three times). Some great bits of gore, realism, and suspense: Its great that a headshot to undead isnt a guaranteed kill! Having a one armed stump flail at you is quite unnerving when you only have a hatchet... which can get stuck! Ive had to soak a hit several times just to get my weapon back so I can live another moment. Great creativity in environment interaction and well pathed. Keeps me coming back and definitely worth the experience!\n\nHelpful | 4", "edzanaly.rodriguezMar 31 at 10:19 PM\nAbsolutely worth the wait\n\nSome people don't seem to understand the comic book style but I'm in love with it, I absolutely love that the weapons and other utilities get better and stronger as you go, I've only played a handful of hours in since it was only released today. If you're not a great gamer or into horror, this is still for you! There's difficulty levels that make it super fun and customizable to your preferences. Definitely pick it up if you get the chance\n.\n.\nSome pros-\nIf you aren't a superfan of horror or having to memorize a reload pattern for your gun, you're just like me. I don't love jumpscares but when they come around I find them exhilarating. I enjoyed the Silent Hill franchise and I find this in that ball park. It's incredibly fun to kill enemies and wonder around complete environments. This game has lore, I haven't gotten through it all but it's only just launch day so I will soon. The gameplay seems like it could definitely last a while and it does have replayability for me as I will be going back to play the higher difficulty playthrough. The music adds to the already great atmosphere, definitely play with headphones if you have a pair. Some areas are scarier than others but it's always at least a little tense to add to the drama. The atmosphere is thrilling. You start memorizing things you didn't even realize you were memorizing like atmosphere changes and their meanings. THIS IS NOT A WAVE SHOOTER, it's a story! BUT you will get to shoot guns along with fun mechanics like shooting gas tanks for explosions. This has been my favorite game and overall experience on the quest.\n.\n.\nSome (not really) cons-\nThere aren't many for me if I'm honest. This however is for cons for me personally, these will be different for everyone. I wish I could carry more things (even though the limit does add to the challenge) Sometimes you'll see a black screen for a split second and I'm sure it's my fault but I'm not sure what I'm doing exactly . Lastly, I absolutely wish this game had some voice acting, it would be a whole different level with some voices! I don't know if this is possible as an update in the future but if it is, I think it would boost the game tremendously.\n\nHelpful | 8", "Ashrod01Apr 15 at 12:22 PM\nBEST VR GAME!\n\nThis game is terrifying, but at the same time it's also fun. Really fun. I love it. The graphics are amazing, love the comic book look. I highly recommend to any horror fan, or if your just want a fun adventure. The story is also amazing. Haven't finished it yet, I'm only on chapter 5. Cant wait to see what happens next.\n\nHelpful | 4", "erasmushurtMay 15 at 11:17 PM\n\nI put off buying this until now because to be honest the graphics style and Turok level sight distance offput me. I also didn't like the idea of having to read all the comic book style writing. But after so many good reviews I picked it up today and I have to say that I was pleasantly surprised with how good this game is.\n\nIt has an engaging enough story. Great music. Spooky setting, all in all it's probably my favorite Quest shooter.\n\nHelpful | 1", "ParadiseDecayApr 1 at 1:46 AM\nBe a Comic Book Hero!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=8pNU5FDYvCg\n\nMy Initial Thoughts:\nA cool and unique looking action shooter with horror elements. You feel like you are wandering around the cool world of a comic book and the art style in this game reminded me of a classic FPS shooter called XIII.\nI think Quest fans are going to love this one and reports coming in... the game has 20 Chapters with around 8 hours of gameplay.\n\n*IMPORTANT NOTE FOR CONTENT CREATORS:\nIf you try to record gameplay in your Quest, there might not be any sound, this happened to me and a few other content creators. So do a test first.\n\nHelpful | 37\nDeveloper ResponseApr 2 at 11:34 AM\n\nHiya! Thank you so much for the video review and all your feedback. Just wanted to let you know that we are aware of the issue with sound during casting/recording and are working on it. Unfortunately it is a bug at the operating system level that we are working with Oculus to fix. Fingers crossed the fix makes it into OS16. Thanks for the feedback, and enjoy! :)", "ANGERSNIPERJul 28 at 10:54 AM\nGood\n\nOver complicated storyline but good fun and hella scary\n\nHelpful | 0", "DancesWithNoobsMay 14 at 7:29 PM\nDevs got a good handle on the platform!\n\nThis is one of the few games Ill actually recommend. Its not extremely long, but long enough for its type. The graphics really accentuate the story device amazingly well! The Lovecraftian meets Cronenberg style story will make your skin crawl and give you enough of a creeping anxiety that youll nearly scream at the sparsely but excellently places jump scares. Finally, like I said in the review title and others have previously stated... the devs REALLY have a phenomenal grasp of the platforms strengths and weaknesses! For the first time, swinging a melee weapon feels like it has a hint of substance!!! (Good job ladies and gents! Cant wait to try out your next title!) \n\nHelpful | 1", "ChillahGorilla22 days ago\nScary af\n\nLoved this game! I have spent many years playing horror games and this is one of my absolute favorites. This is the first horror game I've played on VR and I'm amazed at how immersive it is. Playing it with earbuds in and the sound up is intense. Only problem I had was that certain sections were difficult to the point of frustration, but that could've just been me. Absolutely worth it if you are a fan of the genre.\n\nHelpful | 0", "GodWestJun 4 at 9:45 PM\nBeautiful\n\nWell crafted game top 5 on the quest for sure ranging from beautiful comic-like graphics to an intelligent story with a decent number of weapons, if you love survival horror this is a must try.\n\nHelpful | 0", "justarandomname333Jun 30 at 5:27 PM\nOne of a kind and its amazing\n\nThis game does a amazing job with sound atmosphere and graphics its thrilling and horrifying\n\nHelpful | 2", "headhunter2929Jun 15 at 4:51 PM\nThis game though\n\nI'm talking like a lot of scares even though its not meant to be a scare in that exact place and the atmosphere though good game\n\nHelpful | 0", "itzzzAGJul 7 at 3:52 AM\nCant miss this one!\n\nBuy it already\n\nHelpful | 0", "TheBeanLettuceMay 11 at 1:01 AM\nHard difficulty is Hard. Really hard.\n\nThis game is just excellent. Despite its hardware limitations it has made one of the most beautiful vr games I've seen besides the really recent ones.\n\nI started off on hard for my first playthrough, I RECOMMEND YOU DO NOT DO THIS. Holy F*** its hard (no s***, lmao). Dont get me wrong, I'm having tons of fun but its reminiscent of trying to play games like doom or the evil within on the hardest difficulty: I.E if you're anything like me you got your cheeks repeatedly clapped and would get caught on certain fights for an extended period of time. I wish there was a dodge option or something so I could avoid getting hit so much. I'm gonna try a bigger play area so I can literally dodge in real life. I recommend this game to ANYONE who considers purchasing it.\n\nHelpful | 1", "moguildMay 10 at 11:54 PM\nH0ly Cr@p\n\nYoure gonna need several sessions to beat this game.. Which is great!\n\nPROS:\n- Awesome atmosphere of dread\n- Great weapon gameplay\n- Great inventory management\n- Difficulty is great Leaves me huffing but I cant wait to go and try to beat the chapter Im stuck on again.\n\nCONS:\n- Enemies can have wonky hit detection. Theyll swing and miss but somehow still hit you.\n- The revolver is kinda useless a lot of the time. Melee weapons are the wave in this game.\n\nHelpful | 0", "RigmorMalmsteenJun 23 at 6:21 PM\nAmazing!\n\nThis game is today worth 30 dollars, the game is scary but so incredibly fun!\n\nHelpful | 0", "GreatUsernameMar 31 at 9:02 PM\nA MUST have game!\n\nThe game is so enticing and captivating all the way through, to the point where you cant help but want to do it ALL over again. The combat is solid, game is SPOOKY, the story is fine tuned to perfection, and the graphics work wonders. This game is worth WAY more than its intended price, so not only is this game a MASTERPIECE, up there with the likes of Job Simulator and SUPERHOT, but the entire experience feels like it should cost WAY more than $30. Thats what we call a MASTERPIECE, for your wallet!\n\nHelpful | 6", "GlacialanMar 31 at 7:28 PM\nEssential.\n\nAn absolute must-have for every quest owner. Never once have I enjoyed being terrified this much. Everything about this game feels so polished and perfect. If you're on the fence of buying it because it happens to be a horror game, ignore that and get it already. This is an absolute gem and I couldn't recommend it anymore.\n\nHelpful | 7", "tatertot2006Apr 15 at 1:20 PM\nGREAT HORROR TITLE THAT WAS NEEDED\n\nThis game is so great and when I got it for my first time I played until my headset was at 15% and I dont feel like Im even close to the end. Also, as great as it is a horror game it is a great shooter. I got scared so many times but the game is so great and is a need for any thrill gamer\n\nHelpful | 2", "dgaskill710May 7 at 8:46 PM\nDevelopers take note of immersion!!\n\nThis game is fantastic!! All I can do is think about playing it when Im not doing so... it is Challenging but possible for newbies, atmospheric, and very detailed. The stuff that you can do/HAVE TO DO in this game should be the new standard for VR.. it increases immersion.\n\nYou cannot just walk around with two weapons in your hands and like open doors and interact with objects/items while your weapon disappears. It is more realisticYou have to have a free hand to do so. So you have to either drop the weapon, put it in your side holster, OR YOU CAN DIG THE HATCHET (or whatever melee item you have) INTO WOOD OR SOIL for exampleso you can interact with the object and then pick your weapon back up!!! Like real life.. This is bad***!! It brings out the physicality that is required for immersive vr!\n\nI hope developers take note of this immersion and interactivity... I love Arizona sunshine but the extra steps that this team took with immersion in Lies Beneath makes me regret spending $40 or whatever on sunshine!\n\nSince the game is working with lower graphicsONLY due to the comic book style, it allows the quest to focus on other things like tracking and gameplay performance...\n\nThis game is a must own for horror fansits like SILENT HILL x EVIL DEAD x That actually cool looking game from that bad movie Stay Alive. For real it looks like a game somebody would play on VR in a movie where you think yeah right I wish VR was actually at that point now\n\nThat being said I wish they would patch some of the glitches that make you have to restart the game from a checkpoint. I encountered 3 glitches that made me restart... one was toward the beginning after a checkpoint you lose what weapon is in your hand. Another time that happened was I believe toward chapter 10 when you go through a dreamlike sequence... I also lost the weapon in my hand. Both times it was frustrating because I lost the only GUN I had so i wanted to go back to the checkpoint so I could have it. These problems honestly seem to be related to the adaptive controls (switching from holding button down to hold melee weapon to pressing button to toggle holding melee weapon).. another glitch was just during the part where you get the harpoon gun it disappeared and I had no way to get the dolls to burn and had to start at checkpoint! Please fix because they are a little game breaking but it is also understandable as it was with a weapon in each hand while switching between adaptive and toggle controls...\n\nHelpful | 0", "eoinokJun 6 at 11:17 PM\nThis is a bad game (updated)\n\nUpdate: If you read the novel below you'll see that I did not have a good time with this game. I haven't gone back to it since, so I can't say my impression of it has changed. But, to be fair, the odds are it's probably not that bad. Maybe I was just unlucky. It's got tons of positive reviews, so there must be something to it. I've added some stars but I'll leave the original review as well, because perhaps it will provide succor to the next poor soul who has an experience like mine.\n\nOriginal review:\nOK, apologies in advance: this is going to be a long one. Will anyone read this? Who knows.\n\nThis game is getting glowing, fawning, exulting reviews. It is a bad game.\n\nGood things: nice graphics, interesting story, good holstering and reload system. I don't doubt that a lot of love and hard work went into this.\n\nSo why is it bad? In short, much of the game is a cheat. It's more like an interactive narrative than a game. It puts you in situations where you have to fight for your life but in reality you have far less control over the outcome than you think. For example, in Chapter 4 there's a big horde battle in which countless waves of monsters attack you over and over and over again. I could write a novel about everything that's awkard and unpleasant about this scene in practice but suffice it to say that it's basically a cheap death event - a moment designers put in a game knowing that a first time player has no real chance of surviving. OK, this happens in games. The thing is though, when you die the checkpoint system doesn't put you back at the start of the fight. It reloads you mid onslaught. So, if you were screwed before you're probably still screwed. I retried this I don't know how many times. Let me tell you: there is no good way to win, no strategy, no skill involved. It's all luck. It's mostly RNG stuff. If you try to stock up on ammo the game will *instantly* tell you can't carry anymore. If you try to use your ammo the game will *instantly* tell you you're out of bullets. If you think \"OK then I'll use my ax\" the game will decide you're too weak to grip an ax handle and your character will simply let it go. This battle is so cramped, awkward and annoying that any semblance of strategy or skill evaporates after 2 seconds. It's so badly designed that you literally have to eat a sandwich while demons are actively mauling you to survive. The really, truly irritating thing though is this: it's not a real fight. It's a scripted sequence. It turns out that after you've gone through the cycle of instantly-full-and-instantly-depleted ammo for about 86 waves and eaten 42 sandwiches while 967 demons absorbed infinite ax blows, yet more demons swarm in by breaking down the doors. And, it turns out, if you run through the right door at that point the scripted sequence ends and the demons just aren't there anymore. To be clear, there is nothing in the game telling the player to abandon the protection and supllies of the cabin. I just randomly stumbled upon this script-changing moment after wasting way too much time on this bad game.\n\nI slogged on. I got to Chapter 7. It looked like another big fight/scripted moment was about to happen. Now I'm thinking \"At least if I die here I'll go back to the start of this chapter\". I died. The game sent me back to Chapter 5. I'm not kidding. Now in this boss fight in Chapter 7, at first you think you need to do a particular thing that the game taught you to do earlier in this kind of situation. But it turns you can't. Again, the player has no control. So while I was working back to Chapter 7 after dying I thought \"OK I'll give this game one more chance. I'll do the survival game thing and save as many bullets as I can. I'll melee every monster till I get to the boss fight in Chapter 7 so I can hit him with everything I have. So I get to Chapter 7 ready to give this boss hell. Turns out that, again, this is not a fight but a scripted moment. At least, it seems that way because all of my ammo did nothing to even stagger this boss.\n\nSpeaking of ammo, the player character's extremely limited ability to carry bullets (doesn't she have pockets???) is another example of how the player has no choice or power in this game. You can't choose to build up a good store of ammo and supplies over time. The designers want you to have X supplies at X time. If you try to build up more the game just says no you're not allowed to.\n\nIn VR, lots of games make you accidentally punch your wall. This is the only game that has ever made me *want* to punch a wall.\n\nHelpful | 3", "fifteenplagueMay 6 at 11:41 PM\nFinally a full length vr game\n\nFor the longest time I've waited for a decent sized game on the oculus that takes longer then 30 minutes, this beast of game has excellent graphics combat, realistic melee and thrilling gunplay, if you want to feel powerful, yet weak at the same time I reccomend this game, it truly lives up to its price tag\n\nHelpful | 1", "tjrossinApr 2 at 11:53 AM\nA new benchmark for the Quest\n\nHighly stylised thematic game. Don't play this is you expect a relaxing experience, it's creepy, stress inducing but compulsive once you start. The design is matched by solid mechanics, the physics are spot on, everything has weight, axes thud and stop when hitting objects, all very polished. It's good! It's really good!\n\nHelpful | 5", "joel.boedigheimerApr 29 at 3:45 PM\n\nThis is by far one of my favorite games on oculus. They did such an amazing job on this game. Exactly what I'm looking for in vr. The way you can interact with almost everything, the storyline, just the overall mechanics of this game, amazing . Good job guys!\n\nHelpful | 2", "DalraxMay 5 at 7:04 AM\nOutstanding\n\nthis is a great game, and much longer than most Quest games. Cool variety of weapons and scarcity of ammo makes you have to be careful. There's lots of fighting, but it is not a shoot em up where all you're doing is fighting endless hordes. Occasionally it is scary (in a good way), often it is creepy too. But it is far from being just a horror title. I'm in chapter 5 and so for most of the game has been outdoors with fog so you can't see an expansive world at all times, but I think that allows the gameplay to be very smooth because it doesn't have to juggle millions of bits of graphics. So far this is my favorite game on quest.\n\nHelpful | 0", "MattThePotatoJun 1 at 8:46 PM\nMy favorite\n\nVery well made game. If you are a fan of survival horror game just go for it. It's not just a game that uses vr as a gimmick . Definitely worth your time and money.\n\nHelpful | 0", "sinkingtrack27Apr 4 at 10:29 AM\nBest and favorite game on quest but...\n\nThis game is absolutely amazing, the looks, gameplays, and thinking about saving ammo. The story is magnificent and interesting and has me drawn in the whole time. Although I would like to see a pushing or blocking physics. There was so many times I ran out of ammo and died because I threw my axe and could not get it back.\n\nHelpful | 4", "LeGrandMecMay 4 at 12:47 PM\nToo spooky for me!\n\nBut really. If you love jump scares and hate the feeling of being chased, this is the game for you. I actually had to take a break from it for a while because it stressed me out so much (in a good way)! Very immersive and interesting plot. The only warning I would give is that your fingers might be sore after prolonged playing times because you have to keep the gripper buttons pressed to hold things.\n\nHelpful | 0", "issac_sweatJun 29 at 2:11 PM\nBest game on oculus\n\nIts good buy it\n\nHelpful | 1", "GrayWolfWoodsJun 25 at 9:59 PM\nVery amazing\n\nI've showed this to 2 of my friends and they loved it like I did\n\nHelpful | 0", "smartasscoyoteJun 3 at 9:22 AM\nWorth every cent\n\nI have put in 2 hours or so into this game and am only a quarter of the way through this is one of the best vr games I have played to this day.\n\nHelpful | 0", "daniel.katz.May 8 at 9:48 AM\nWoW only wow\n\nOk so i am only at the start of the game c 4 but it so scary and like u feel the you are walk the that world\nok if u are looking for a long game that is fun get it DO not get it if you get scared easily but of u really want u can ok i am looking forwards to the play more but i get home school i dont know if u can be replay a lot but for now idk i will update if i find bugs and stuff like that\n\nHelpful | 0", "djidid.usuduApr 20 at 4:55 PM\nBest of the quest\n\nUnlike face your fears 2 this game does not have jump scare after jump scare but when they have a jump scare bet your dollary doos your gonna crap your undies I played for about an hour today and got 15 percent into it this game is great its the best of the quest on Fortnite cuh\n\nHelpful | 1", "LilMathFlashJun 18 at 2:57 AM\nI like it yes yes\n\nIt is very good yes yes but I didnt earn any bells yes yes\n\nHelpful | 0", "JemmyVonJudeMay 1 at 5:10 PM\nBest VR adventure\n\nAmbiance is on point, be it by sound, scenery or the chosen art style for the graphics, deliberately comic-booky but oh so well done. Top notch controls too, never once I struggled to do what I wanted, except in a few panic moments but I feel I would have dropped my gun IRL at these times too haha. Which leads me to the horror levels, this game relies more on steady pressure and high tension moments, and a very gloomy story rather than resort to easy jumpscares all the time, which is, I must say, a refreshing take on horror. So go for it, you won't regret... also, enjoy the satisfying \"Tchunk\" of melee weapons on any wooden surface, I know I for one loved it :)\n\nHelpful | 1", "T-J4EverJun 16 at 10:15 AM\nBest horror game ever!\n\nUsed to think Resident Evil was the greatest horror game. Not anymore!\n\nHelpful | 0", "Xris520Jun 25 at 8:19 PM\nWow\n\nYou put the Gordon Ramsay of game development to shame\n\nHelpful | 0", "scertelMay 31 at 6:05 PM\nThe first time a video game scared me\n\nIt is very hard to make me jump or get scared. This game got me many times and I LOVE IT!! It give me the adrenaline rush that no other game does.\n\nHelpful | 0", "Biggles1977Apr 15 at 1:28 PM\nBanged into a fridge!\n\nWas super excited to finally get the game! Am playing it with a friend of mine because we both are too scared to play it by ourselves! We take turns when the other one dies and on my turn I hit the fridge trying to get away from the ghoul! The graphics are impressive, love the comic book style! The storyline pulls you in and the action is challenging, for me anyways! It's a nice balance and the scares aren't overkill.\n\nHelpful | 2", "Gamer4Life137May 18 at 8:11 PM\nSo great\n\nGameplay has right amount of tension and enjoyment. The art style is perfect for a Quest game because the technical limitations are made up by the amazing art style. My personal favorite Quest game. A must buy.\n\nHelpful | 1", "GaymernoltardMay 9 at 9:32 PM\nIncredible\n\nIm not much of a horror fan, so I didnt know what to expect from this, I just saw a lot of hype around it, and by golly does it sure live up to it. This games art style is utterly stunning and had me more scared than I actually thought an art style like this could make me. The story is truly fascinating, and although being $30, the amount of hours that this allows for gameplay and replay ability on harder difficulties is great. I highly recommend getting this, a must have on the quest!\n\nHelpful | 2", "The.Strange.SongsJun 8 at 4:51 PM\nI loveee this game. I really do but..\n\nThere is a little spoiler am about to give out so warning.\n\nSPOILER: after you beat that squid boss with the cracked face and the one read eye, the game will fade out and then bring you a comic book with the next chapter. After I finish the book the game freezes and then makes an extremely loud buzzing sound. I'll even close out the game and the buzzing will still continue. I've tried everything to fix it and it still doesn't work. It really sucks because I was looking forward to beating this game but now it kinda just feels like I lost my money to a game I actually can't beat without it breaking. I really hope this can be fixed soon. Much appreciated if anyone took the time to read my review\n\nHelpful | 2", "john.sebiApr 6 at 5:20 AM\nA fantastic game that I love BUT...\n\nFirst of all, I am so impressed by everything in this game : the art style gives it a unique atmosphere, the sound design is amazing, the scares make me gasp and The tension is as present as the fog that surrounds you in this game, where creatures of the Night lurk...\n\nBUT\n\nThere is one thing that could be upgraded: the close quarter fighting. Very often the weapons will simply go right through the ennemies with no impact, resulting in a very messy catfight of frantically swinging an axe or club like a baby rattle rather than giving commited strikes since these dont work. Another thing I dont get is why we can punch in the tutorial but cannot do it in-game, I understand that this Might be done to avoid anyone going Mortal Kombat on the monsters, but If we could push or punch the creatures without doing any damage to them, basically just stunning them, I feel like this would give the world an even more real feel. These are my only complaints, I feel like we should feel hopeless when the ghouls come very close of course, but when you die because of a glitchy weapon or not being able to use a very instinctive move, it is frustrating ! If the developers could patch this, it would be my favorite game on the Quest !\n\n\nBut like I said earlier, this is a fantastic game that you absolutely need to try ! So put on your headset, hold onto your lighter and have a steady hand... And dont let the Forest take you.\n\nHelpful | 9", "Masa1607Apr 12 at 6:19 AM\nImmersive!\n\nWhen I started playing VR years back, I remember when I would take my headset off my brain would have to adjust back to reality, it was kind of a shock to your eyes to see reality.\n\nTo be honest fast forward to the present and that feeling doesn't happen any more, my brain usually understands that I am looking at some screens in a headset, sadly it knows this isn't real.\n\nHappily though that level of immersion does happen with this game! I'm sucked in, I'm looking behind my back, what was that noise? I'm looking around corners and fighting for dear life. You never get a break in this game, every moment is unsettling and the brief moments you get to rest will soon be broken by the sound of a distant groan.\n\nOculus can't say I don't support them, I have purchased many games for the quest but this gem is the best game on the quest store by a long shot. Many games for the quest are short demo like experiences, this is not. This game is a full 9 hour game that obviously is a labor of love. Truth be told $29.00 is a bargain. I would have easily paid $40.00. These devs should be proud, I wish there were more games like this.\n\nHelpful | 2", "VantageVR_YTApr 27 at 2:13 AM\nA day one game\n\nSo first of all the graphics are amazing the game mechanics are smooth its a awesome game. I was thinking if there could be like a online horde mode because that would be great I would recommend this to people that dont get scared easily there are a lot of horror elements like jump scares and more the developers have done a amazing job and I cant wait to see what will happen to the game In the future\n\nHelpful | 0", "Demonoid27May 24 at 2:49 AM\nA must have\n\nGreat title from the eerie atmosphere and comic stylized graphics to the controls and balanced action thru out the story. Can't wait for the Drifters next title\n\nHelpful | 0", "JioxxApr 11 at 9:32 AM\nA true masterpiece from start to finish\n\nI've been using VR on almost a daily basis since November of 2016 and Lies Beneath is one of the most impressive games I've played on any system.\n\nWith this game Drifter has put itself among the best VR developers on the planet. Everything about it is so well crafted and thought out. The way it feels to use your hands in the game, the physics, level design, creature design and animation, sound effects, and art direction are all fantastic.\n\nI'm really blown away.\n\nWhile the description says it can be played sitting, standing, or roomscale, my advice is to play it in roomscale and map out the largest space you can find in your house, turn with your body instead of the controllers, and try to immerse yourself in the game physically as much as you can.\n\nHelpful | 2", "Brennan999Apr 26 at 7:27 PM\nBest game yet, little complaints\n\nI start with the pros:\n- I love the style and setting, it's perfect for this game\n- Its a great story and love that you have to collect items to get different endings.\n- It takes a long to to beat the game on one difficulties unlike other games that take at most an hour and a half\n- I like how they organized the game into chapter\n- I like there are different difficulties for you to choose\n- I love fighting on there and how you can shoot certain spots on enemies to do more damage or take a arm off\n\nNow I'll do the cons:\n- The storage system is pretty bad, you can only store two things and you need 3 essential things on this game: Food to heal, melee weapons to open things, and guns, here's the problem, you have two guns and in my hands I have my lighter (It's so you can see to shoot demons in certain spots to kill them fast) and one gun and so I have a melee weapon and gun in the two slots but no room for food so I have to try to kill them without getting hurt too much, so I think you should have at least 3 slots so you can at least have food and while I'm one the topic of storage I find it stupid you can't hold gas cans or bear traps in your two slots\n- Now the melee weapons are good for opening box for ammo but are plain bad in combat because the demons charge at you without stopping sometimes when you hit them with your ax or whatever so you get hurt and they don't do much damage at all\n- My last complaint is the ammo system, you can't stock up on it because it says it's full and you can hold only 6 bullets in the shotgun which is ridiculous\n\nOverall this is truly a five star game and I would definitely get it especially since we're all cooped up and got nothing better to do so you should get it right now because in my opinion it's the best game on the quest right now but like everything nothing's perfect and I hope they consider my opinion.\n\nHelpful | 0", "giulytheboyApr 18 at 5:27 AM\nA wasted opportunity\n\nThis game could have been great. It is a shame that it is completely ruined by gameplay choices. I'll try to explain because there is really a lot that represent a complete turn off for me. Let's begin with simple stuff : equipment management. It is a pain. You have only 2 slots that you have to manage to put everything you need. And I could have been okay with that. It seems like Half life Alyx style, right? Absolutely not! Because those 2 slots are occupied by your weapons too. You have to choose to bring with you a sandwich to heal or a gun. A gun or an axe. Most of the monsters are unstoppable death machines and bullet sponges that runs towards you to beat you to death, and most of the time they spawn so close to you that you don't actually have the time to kill them before they reach you and hurt you. So you need a source of healing and a lot of fire power in this game to go through. You would say : well okay you have 2 slots, one for a gun one for the food, you are okay. No I'm not. I only briefly mentioned the melee weapons. Those are completely useless in combat (because as I said the enemies are unstoppable death machines careless about an axe hit on the head, so they reach you and beat you no matter what, if you go melee), but you need to bring one with you to break wood obstacles, and to break crates where you can find ammo and food. So the math is simple : to proceed in the game we absolutely need 3 things (a gun, some food and a melee weapon) but we have only 2 slots to manage all of that. Great! At this point you could say : \"you can always have your weapons in hand and put something else inside the 2 slots.\" That would be in perfect Alyx style and would be great. But it doesn't work like that. If you want to take something from a slot you need to drop your weapon on the floor. And if you are in the middle of a fight you can't even think about dropping a weapon to take your sandwich to heal yourself, because that weapon will always drop inside the floor pixels, or fly miles away from you for no reason. Or if you are lucky enough that it drops on the floor near you, good luck on take it up from there. While 2 or 3 foes are surrounding you, you have to struggle with the \"not so precise\" items grabbing behavior. And what about if I want to grab a two handed weapon from my back? I have to drop on the floor both my gun and my melee if my hips slots are full. And what about collectibles composed by multiple parts? You have to hold those in your hands bringing them with you looking for other parts... This items management system just doesn't work. But all of these things I mentioned are not the worst part. The worst, obnoxious, degenerate, toxic thing of all : the cursed dolls section. Oh boy. In the middle of those \"dreams\" sessions you have to run around the map looking for those floating dolls, while a never-ending wave of enemies spawns from everywhere around you. And while you are there, in front of a doll, surrounded by monsters.... You have to drop both your weapons, grab the doll with one hand, take the lighter with the other and burn the doll. Than grab your weapons from the floor, kill everyone around you and go chase the next doll... Absurd... Another thing that I can't understand is monsters respawn. It completely shuts down every form of exploration of the map. Because there is no reason to go searching for ammo or food if when I come back I have to consume what I just found, killing respawned monsters. It has just no sense in my opinion. About the weapons. There is a great variety of weapons. But unfortunately most of those are useless or have a weird concept behind them. Traps and gas cans are fun, so are the throwing knifes or spikes, but this game is not made for single use weapons (due to the awful slot management system we already talked about) so I've never used those. As we already stated melee weapons are useless in combat, but needed for other stuff in the game, and that makes them even more annoying... So what remains are the guns, the shotgun and the harpoon. The guns are cool and handy. Love those. The shotgun ammo management is a mistery to me. For every other weapon you can store more ammo than what the magazine can handle and reload the weapon when needed. Not the shotgun. You can just have those 6 bullets. Why? And than there is the harpoon. Oh boy I loved it. That is really brilliant. You can use it for open hidden paths, to reach dolls from distance, to grab hooks away from you... but you can't use it as a weapon... What a shame... It just stuns the enemy, it doesn't kill him. Why?... there is no point to stun the enemy if I have to waste time to put the harpoon behind my back and take another weapon to kill him. Anyway... Well this was a hell of a long message but I wrote it because I really think that this game could shine in incredible ways. The graphic is phenomenal, the atmosphere is great, the world is intriguing and well designed, the story is simple but cool. I just can't stand these gameplay choices. And for me the gameplay is the most important thing of all, that's why I had to give the game 1 star. I'm sorry. Of course all of my complaints comes from my personal taste and I can understand if the game works great for others.\n\nHelpful | 30", "SnowUseApr 30 at 12:52 PM\nCROSS BUY!!\n\nThis is the best game I've played on the Quest in a long time. It's closer to Silent Hill spooky l. Rather than a zombie wave shooter. The mechanics on it are genius. Using hooks to open doors, your lighter embers show you the way. This game is so much fun. And it's cross buy!!\n\nHelpful | 1", "Exper_mentJul 14 at 2:36 AM\nhands down the best game on the store\n\ntry to ignore the horror elements, the story, combat, and literally everything is great. but it does fall off a bit at the end and spike in difficulty\n\nHelpful | 0", "Shreader87Apr 24 at 2:55 PM\nEasily a must have.\n\nAt first I played the game for 30 mins, and I was instantly hooked! This is because of the interesting story and mystery at this small town, the weapons and combat system everything. This game is a must have on quest, it is titled a horror which I was not super excited about, but there is not to many scares theirs a perfect amount, you always have a chill run down your spine because the town is so freaky! There are small glitches but nothing that should push you away from this awesome game!\n\nHelpful | 1", "ultraelitebruteApr 24 at 9:26 PM\nI love this game but...\n\nI've been playing it for awhile now and it's a blast to play. Between this and pavlov it's all I play now. Storyline is great the enemies are impactful and spooky. Now for my main issue, I was hoping to stream the game but anytime I do I have no game audio. I spoke to oculus and they recommended that I not use headphones or uninstall and reinstall.\nI did both and I lost all my game progress. It didnt work and oculus should fix this. I spoke with someone on reddit and they recommended going to settings and enabling storage permission. I havent tried it but if I can I'll update this review on how it went. If it doesnt work I'll just remove the review entirely to not confuse people.\n\nHelpful | 0", "TeonisApr 24 at 4:30 AM\nSooo goooooood...\n\nDear Devs: Thank You!\n\nDear Questers: Buy it!\n\nSeriously,I was hesitant because of the bad reviews.\nBad game elements, never ending fights, used item by mistake.\nNon of these were present at my gameplay.\nThis game is amazing. The fights, the weapons, the ambience, the sounds (!!!) were spot on.\nIf I could change anything, I would not use two pistols, since there is no place in the inventory for a meelee weapon. I could've just drop one of the pistols, but I didn't dare, since I thought i will need it later.\nBut honestly? I played 95 percent of the game with an axe in my right hand (great to throw) and with a spikey stick in my left hand (the longest reaching meelee weapon), and I was slicing through everybody. It was great. And this was my first game, where my throws were really accurate, I don't know why. In Super Hot I always missid with everything that I threw, but not in this game. Throw the axe, chop with the stick, if it still breathes. Awesome. The story isn't bad either, good 6-7 hours of gameplay, the menu is great (don't turn around!), but yeah, I would add another slot for a meelee weapon in the inventory (or instead of the 9mm).\nThat's it.\nNow I have to replay it on hard.\n\nHelpful | 0", "IhrieApr 24 at 1:14 AM\nExcellent survival horror\n\nA more than worthy entry in the survivor horror genre. Reminded of my time playing the original resident evil back in the day. Love the tight inventory system, makes you have to really think about what youre bringing with you, food or what sort of weapons etc.\n\nThe difficulty option is a welcome for replay ability, as are the secret lore items as you play.\n\nI love the comic book aesthetic, though Im not certain about floating text In VR. Reading panels of text does feel a little janky, but does a decent job getting the point across. Works well enough in the interlude between chapters, though the floating text while playing a game is odd at times (mostly due to its static nature).\n\nRegardless great game, highly recommend!\n\nHelpful | 0", "DAX_QcMar 31 at 6:37 PM\nNot bad but as usual over hype!\n\nI dunno what the other dude in the reviews did to have spent 3hrs to get only to level 5 but i played literally 12 minutes and i am at level 3. So... yah. And the other one comparing to Hl Alyx... COME ON lol physics in this is less good or equal to job simulator. Environment interaction is barebone, this game is 2015 vr level of interactivity.\n\nEDIT: good quest title for sure. Must own? I dunno. So many horror game already. Its surely different but A.Sunshine is better imo for a fps stand point.\n\nCome on in 2020, do the dang narration in your game! I know its cellshading comic book style but still.\n\n20$ would be right price imo. I dunno if its a keeper for me. At 35$ canadian (40$ with tx) i simply dunno. As usual Quest owner pay 5 to 10$ too much for a title\n\nHelpful | 39", "PsychoDove30054Jun 18 at 6:41 AM\nEpic stuff\n\nGreat game, WAY better than that trash Resident Evil 3 remake.\n\nGood for my self torture\n\nBad for my sanity\n\n4/5 stars\n\nWish it was longer\n\nHelpful | 0", "UrFavritAssholeApr 6 at 12:49 PM\nFirst review Ive ever wrote\n\nThis is the most complete game made for the quest. If youre not a fan of horror dont worry, there arent too many jump scares. Theres a ton of action and the graphics are amazing. The game is about 8 hours long. I beat it on easy and now Im replaying it on normal for a more challenging experience.\n\nTo the developers: the game is perfect, but would it be possible to use your gun as a weapon to pistol whip enemys? That would be really cool. Great job on raising the bar in VR. Hopefully the quest will get more games like this\n\nHelpful | 2", "FutsziApr 6 at 12:46 PM\nI just love ut-Buy this game right now!!\n\nIf u are a VR -horror-action game fan buy it right now.Im a big vr/vr-horror fan. Im a vr user since playtation vr launch and I trough lots of ps and quest game but I have to tell I never saw anything like this one.I love the art style. Im just started but Im in love with it allready. I hope it can keep up the hype it build up and its going to be my next favourite.\n\nI have found one bug-in the cave after the crash there was no sound. In the menu I had but not in the game. As soon as I left the cage the sound came back. I missed the first jump scare because of this :( but thats ok hopefully more to come lol\n\nHave fun guys and buy this game immediately\n\nI only have 2 questions now dear developers. What is going to be your next title and when its coming??\n\nOhh and dear players with the one and two starts review. The game is not broken just u dont know how to play it. Before u blame someone else check yourself first.\n\nDont believe in people who gave 1-2 oe even 3stars. Its definitely at least 4 out of 5 if not 4.8 lol\n\nHelpful | 2", "Kamakazi2891Apr 6 at 9:51 PM\nBest game on quest by far imo\n\nIt's scary and packed full of fun. There are really cool features as well. I love the style of the game as well. It contributes to the fear at every corner. I highly recommend getting this game. Some say it's a 6-8 hour experience and it's highly replayable. I was hooked within seconds. I'm now on chapter 7 and cant wait to finish it all. From what I've played I havent run into any bugs or glitches. As of now its flawless in my opinion\n\nHelpful | 2", "Luke117May 30 at 9:03 AM\nBrilliant!!!\n\nPros - It's Atmospheric\nFeels like you're Playing out a comic book\nIts Creepy\nThe Mechanics\n\nCons - Little repetitive\nCombat could be better\nSome bugs\n\nWhy the 4/5? Well for those reasons listed above (cons) it's as stated in my opinion a brilliant game but now that I've finished it I can't really see myself revisiting this anytime soon. Do check it out however.\n\nHelpful | 2", "GrassTastesBadApr 21 at 12:43 AM\nAll around awesome\n\nThis game is cool on so many levels. It's scary, but not so much that you feel like you need to yank the headset off, and the comic book style makes it feel a little artsy.... while you kill monsters. The story is interesting, and in the world of VR games there is a long campaign. Frankly this is the first game with a storyline I didn't finish in one session. It's great. Get it. Enjoy it.\n\nHelpful | 0", "Psycho_retros_2Apr 20 at 10:34 AM\nIncredible Horror Game!\n\nI heard good things about this so I downloaded it recently. As of this writing I am on chapter 4, after about an hour and a half of gameplay. This game is not for the faint of heart, as it survives off its beautiful jump scares. However, the living comic art style and mysterious story prove it to be one of the best games I own on the Oculus Quest.\n\nHelpful | 0", "Justin123555Jun 10 at 2:43 PM\nLove it\n\nI just started playing and I love it so far!\n\nHelpful | 0", "rbhoutonJun 4 at 3:19 PM\nAmazing!!\n\nTotally immersed from start, loads of DAAAMMMNNNNNNN!!! moments!! Buy it\n\nHelpful | 1", "SkippyVRApr 20 at 12:48 AM\nOutstanding! \n\nThis thrilling horror game is not for the faint of heart and certainly delivers on the jump scares. It took me over 6 hours to get through all 20 chapters on the easiest difficulty, and I still missed some lore objects so its not even 100% completed yet. Visuals are beautifully creative & incredibly immersive. Intense music along with creepy sound effects blend paranoia & panic, peaking my adrenaline with every surprising moment. As I progressed through levels, the environments changed regularly providing refreshingly different stigmas for each atmosphere. The story is mysterious, entertaining, & addictive. I highly recommend Lies Beneath to anyone who thinks they are brave & mentally stable enough to survive a pure nightmare!\n\nHelpful | 0", "thermalsockApr 19 at 9:46 AM\nBest on Quest\n\nThis is a great game. Not too scary although there were some creepy moments and maybe 1 or 2 jump scares. The gameplay was excellent and i loved the different weapons on how they felt. There was a real feel of holding the bladed weapons and the guns all felt great.\n\nI can't really fault the game without being extra critical. It really is a top class game and put others to shame with the quantity and quality of gameplay. The graphics show what can be done with the hardware, not going overboard on trying to be super realistic. Changing weapons in game was a challenge, i think i will try hard mode next. I really hope there is more content on the way for this game or another comes along like it.\n\nSummary is you have to buy this game, great value for money.\n\nHelpful | 0", "FatherfizzApr 19 at 8:24 AM\nCreepy, and creative.\n\nI wont do spoilers for the game, or the story but I will give my two cents on the game. Long and short of it is stop reading this, and go do yourself a favor by buying this game. The game isnt perfect, sometimes grabbing for your inventory is tricky and you end up grabbing something else. Stuff can bug out in the game yada yada yada, but when you see the enemies, combo your different weapons just right in order to barely make it out alive with 1% health is amazing on its own. On top of the combat, and lore this is a freakin horror game. There are segments where I completely forget Im in vr after playing so long so I peak around corners, and even open my mouth to eat the food. The monsters leave me terrified, parts where I just wanna do a complete 180 to get out of dodge, amazing boss fights, and challenging game play. Ive died at least 20 times throughout the 20 chapters of the game. I very much enjoyed it, and will probably play it again on the harder difficulty because its just that good.\n\nHelpful | 0", "UpstreamLotus0May 14 at 8:56 PM\nAlmost perfect\n\nThis game is one of the best be shooters for the quest right now. The way the guns work and the feeling they provide make just shooting them feel great, the mechanics of the weapons feel on the tear of Pavlov. And the melee weapons are very well, as they can be stabbed and sliced into enemies and they can be thrown at walls to stick in place. I played through the game on normal all the way until the 19 section (spoilers ahead) where you have to gather all the doll pieces and put them together, but there being no saves in that level hardly, meaning I had to restart the process all over again, and I would have to kill the most annoying enemies all over. Besides the ending areas and enemies, this game is flawless and I recommend it 100%.\n\nHelpful | 1", "Mtaker22May 21 at 9:51 AM\nLies beneath\n\nI think this game is really amazing because of the intense story graphics and bosses . I think this game is amazing sincerely Mtaker22.\n\nHelpful | 0", "Limitless_VRApr 18 at 7:46 AM\nA solid, great looking game!\n\nLies Beneath has really set the bar high for native Quest games. The art style in this game is superb, and goes so well with the Quest's hardware. As well as the graphics, the sound design is also top-notch and helps provide a very eerie atmosphere. Expect some jump scares along the way, and lots of action. A very impressive game!\n\nHelpful | 0", "basspro9218Apr 18 at 7:15 AM\nAwesome!\n\nEdit to my review: after playing more hours....I cant say enough good things about this game. Pinnacle of quest right now. Forget being a good VR game, this is a great game period! I've seen some on the negative reviews and those people appear to just suck at video games so dont listen to them.\nGet it you wont regret it\n\nI've only played for like 2 hours and love this game. I dont scare easily but this got me bad one time so far but isn't generally frightening. More action than I expected and its challenging at times too. Reminds me of dead space 3.\nFor the quest this game has the best graphics of anything I've played and everything interacts really well. All the good reviews dont lie, get this game!\n\nHelpful | 1", "BossloreyApr 18 at 7:34 AM\nBreathtaking\n\nThe pinnacle of horror and action on the Quest. This sets the standard for future games. And nobody else has talked about this that Ive seen- every achievement in the game is a movie reference. Scream, Evil Dead, Psycho, Ghostbusters, Tremors, Childs Play, I Know What You Did Last Summer, Pet Sematary, probably more that I dont get or Im forgetting. Just a really cool little detail in an already awesome game.\n\nHelpful | 0", "mr_g-forceApr 18 at 10:40 AM\nUh YES\n\nWere do I start this game is great its the perfect mixture of Horror and Combat which doesnt really mix well but they did it. This game shows you that drifter really understands the quest its great and this is the best graphics Ive seen on the quest its not like Boneworks or Half-life but the graphics are great. If I was you STOP READING THE REVIEWS AND BUY THE DANG GAME ALREADY\n\nHelpful | 0", "HutwolfApr 18 at 11:06 AM\nEasily the best horror game on Quest\n\nI was hungry for a fully feature rich video game on the Quest, which doesn't feel like a tech demo and isn't just 1-2 hours long. Lies Beneath delivers in that aspect. The combat is satisfying, the atmosphere is amazing and the story overall is delightfully creepy. Also great use of a comic book artstyle in order to create a good looking game on limited tech. For about 8-10 hours of playtime? That's still pretty rare on the patform. Either way, the developer Drifter did an amazing job and I can't wait what they work on next!\n\nHelpful | 0", "lj.vancuranMay 19 at 8:08 PM\nIncredible\n\nAddictive, amazing raw comic graphics..Scared the bajesus outta me a couple times. Definitely one of my favorite vr games  well spent!\n\nHelpful | 0", "TabletopbreakJun 7 at 3:24 PM\nBeautiful\n\nThis game is stunning and beyond belief\nAAA game\n\nHelpful | 0", "Darkfr0gApr 2 at 10:27 PM\nExactly what the Quest needed!\n\nThis game is exactly what the Quest needed right now. Cool mechanics, great gameplay, nice graphics and a long campaign story.\nShooting an enemy in the chest and throwing an axe in their face never gets old! Being able to wield almost every melee weapon with 2 hands for more power is a great touch.\n\nAlso the fact that you can hold knives and spikes both ways, either for slashing effect or for maximum stabbing feels really cool! And when I need to pick something up, I just smack my axe in the nearest tree and let it sit there. I mean, this game is amazing! And I dont even like horror games at all but please dont worry its not that scary, only had one jump scare so far.\n\nIf you too enjoy games that are good, and also of a high quality, get this absolute gem of a title!\n\nHelpful | 2", "aflippinwalrusApr 2 at 5:49 PM\nBest vr game I've played to date\n\nThis game has an atmosphere that will drag you in and make you sh*t your pants at parts, the horror is in that sweet spot where its creepy when it needs to be and scary as hll when you let your guard down. First vr game thats ever made me yelp, and the first one to keep me invested till the very end to the point i was begging for more. The combat is spot on making me feel the satisfaction when i hit an enemy with a well placed axe or cleaver throw, the gunplay was amazing as i felt like a badss pumping a shotgun and shooting a pigmans head off or firing a 1851 colt navy revolver from the hip like a western monster hunter. Some of the areas were a bit winding and i got lost in them at some points but dmn were they beautiful. The comic book style was a surprise but a welcome one being a fan of these types of games like a vr revision of a telltale game. Theres really nothing else to say but please buy this game right now, best experience ive had since the last of us.\n\nHelpful | 2", "SirSpartacusApr 2 at 3:43 PM\nProbably the best on the Quest!\n\nSuper awesome game.. 9.5 out of 10!\nBiggest issue for me and I don't think it's the developers fault rather than Oculus.. The audio won't record or stream.. So, when I try to stream the game to Facebook or record gameplay for a YouTube video there's no audio. I've looked up a fix but it would be nice if this wasn't an issue at all..\n\nBesides that, really great game and I dare say that it's the best game on the Quest right now and it definitely set the bar for future games.\n\nShout out to Drifter and everyone who made this game a reality. Appreciate it!!\n\nHelpful | 2\nDeveloper ResponseApr 2 at 6:34 PM\n\nGlad you are enjoying the game! Just to confirm; We are aware of the audio recording issue and are working on getting it fixed. Sadly it's down in the operating system layer, but Oculus is working on a fix. Hopefully we will see this fixed in OS16. Enjoy!", "clayton.douglasApr 6 at 4:50 PM\nReally well done\n\nAlthough gameplay is kind of basic, I am playing the easy route. Just don't have time to do it the hard way. That said this has just the right amount of horror, combat and puzzle solving. The graphic design is awesome and the use of 2D and 3D is well applied. I don't know how far I'm in right now, but so far I'm loving it.\n\nHelpful | 2", "crashtendoApr 17 at 11:03 AM\nPhenomenal\n\nWhen I first got this game I was so excited to play it that I beat it in 10-13 hours, but that's still pretty good for a vr title. The smooth gameplay is one of the best things about this game. When you defeat the monsters in this game with a melee weapon, it makes you feel like the coolest person. If I had to be honest, this is the best oculus quest game. A must buy for anyone looking for a great game.\n\nHelpful | 1", "FrWaJun 11 at 2:42 PM\nExcellent game\n\nHappy with my purchase.\n\nHelpful | 0", "GeekwarlordMay 11 at 9:12 AM\nGood horror with terrible gameplay.\n\nLies Beneath is a nice game for the Quest, it has a decent storyline, great graphics and horrifying atmosphere. The enemies really bring terror to your soul, locations are varied and have great sound design behind it and even interface brought smartly to the game, like with health, that is shown with blood on your hands and with lighter, that shows you hints.\nBUT. I cant say, that its really great at the end. There is some really broken mechanics.\n\nFor example, there is really not enough place in your inventory which should force you to choose between weapons and food, for example, but in truth it just makes you choose the wrong gun and not having the right ammo till the end of the chapter, or not having food, when its really needed, and die frustrated. Melee combat is quite questionable too. Instead of some blocking mechanic you just have to dodge enemys attacks, by moving away, which feels janky and not intuitive for me.\nThere is really little place for ammo which makes it very confusing, when you find twice the amount you need, or twice less, then you need.\nThe last issue, while being the most engaging from the storys perspective is has really overpowered enemies from gameplays perspective, which makes it really frustrating too.\n\nAt the end, i cant say, that i recommend Lies Beneath. Its gameplay feels confusing and frustrating, but its design, atmosphere and graphics almost brilliant. I can say, that you should try it, if you are interested in a event horror for the Quest, but otherwise its not really worth your time and money.\n\nP.S. Sorry, if my english had mistakes.\n\nHelpful | 7", "TrethousandApr 2 at 7:21 PM\nOculus Quest Masterpiece\n\nI've been waiting for a AAA level game for the Quest, not just another Tech Demo. This not only scratches the itch, but it has a challenging story that progresses very well, putting you in tense situations with no ammo and just an axe. Thanks Driftor.\n\nHelpful | 3", "DiddyJoestarApr 3 at 5:26 PM\nGreat game but immersion breaks...\n\nI was intending to leave a longer, more detailed review but it seems as though in the recent patch the blackout/out of bounds has been fixed. With that being said, everyone has already sent out their love and appreciation for this game, as I shall do by compiling hours into it. So far, however, I've encountered some immersion breaking moments in this game that I can't look past\n-Bullets will not register upon contact with enemies at a certain distance. Not an issue with being too far, but if an enemy is inches away from the gun, the bullets will not hit. You have to stay at a certain distance to deal damage, which is especially frustrating when you have to fight the masses in the cabin scene where you first get the shotgun.\n- Not something you can exactly fix in a patch, and it's more nitpicking if anything, but ragdoll. In the VERY beginning, in the empty tutorial room where the faceless zombie is standing, you get to punch away and feel the responsiveness of that. That is never used in the game. You can't punch or shove enemies away, even to stagger them. I've tried many times just to see and your hands just phase through\n-Finally, staggering in general. I love guns and all, but using the melee weapons in a game such as this where you can stick knives and wooden shards into the enemies, THIS brings the immersion. But when I stab an enemy somewhere like the chest, the vast majority of the time they don't even stagger, they just rush forward right after. The biggest problem with this is that you don't get to combo the stab/melee or react, because even when you back up the enemy will float forward the extra distance needed in the animation to hit you.\n\nNow I know the only real bug listed is the first thing, and the other two are just me being picky; aside from all that however, this game has showed the groundbreaking talents of everyone who has worked on it, and what they can do with this relatively new technology. From the very moment this game showed up on the coming soon page, I've done all my research (although there was very little coverage) on it, and everyday I kept checking the page until there was finally a settled release date. God speed to all of you, and I can't wait to see what this era of vr and game development brings to us all\n\nHelpful | 6", "Hydravert_Jul 24 at 12:11 PM\nCould be the best horror game in VR\n\nAt first I wasn't sure if I'd buy it or not, but I'm very happy I did. I love that there's so much action and stressing moments in the game. I only played it for like an hour and got so much fun out of it. This game kind of reminded me of outlast 2, because of the story and stealthily going around the enemies. The game isn't super scary, but I can promise you that you'll have the most fun out of this game than any other horror game.\n\nHelpful | 0", "weejpJun 1 at 2:11 PM\nWow!\n\nJust about the best horror game on quest or vr at the moment. Amazing. Great story so far. I'm only on chapter six. Never before has a game made me afraid to look behind me.\n\nHelpful | 0", "andreiiiiiiMay 10 at 5:45 AM\nHaunted and memorable journey\n\nGame is great. It's like a journey back to the old Silent Hill that we all love back in the day. The game won't scare you much with gory visual or jump scare, but with excellent ambient sound and haunting lore. It's a great and scary journey till the very end and you have to go through it to understand. Even then, there are some question still linging...\n\nThe only bad side is the difficulty. Some levels are just too hard and sometime you die too many time just to pass it. I like challenges, but when it suddenly ramp up too much, it breaks the flow.\n\nIt's still a great game overall.\n\nHelpful | 1", "FuzeMacApr 14 at 9:47 AM\nGreat experience\n\nSure, jump-scares can make your heart jump and leave you a little shaken, but there is nothing like atmosphere alone sending shivers down your spine. This game puts you in a world and holds you there, twisting your gut the whole time. With a good story, amazing art, and even solid game mechanics/hours of gameplay, this is an obvious quest must-have that I strongly recommend.\n\nHelpful | 0", "kerseyhardingApr 14 at 7:33 PM\nFor Horror Fans\n\nI have been looking for an action horror game for Oculus for a while and this one satisfies on every level. It's creepy where it needs to be, the action is addicting, and the comic book aesthetic is awesome. I have been dissapointed with some Horror in VR as it relies a lot on jump scares. This one has a few but they are well placed and they try to use atmosphere to set the tone. I would say my only complaint is that the bosses are too easy. Other than that I love it and I really want to watch someone else play it.\n\nHelpful | 0", "jacksonthetrashyboiMay 6 at 8:09 PM\nBest scares\n\nI've been waiting for a really good survival horror game on the quest for a long while and after playing though up to chapter 6, I can say this exceeded everything about horror games for me.\n\nHelpful | 0", "topguntopJun 27 at 7:05 AM\nLie\n\nAll I can say is av play it for 5 minutes. Makes me feel sick with the walking then if you do it a different way on setting the game just not good for that kind of movement. Why not have a game were your just sat down in a cart which moves and you just shoot that would be better\n\nHelpful | 2", "The.Yeet.ManJun 15 at 10:56 AM\nReally freakin good\n\nWhat can I say. Its just that good. The game truly does speak for itself. You just gotta give it a chance. 9/10.\n\nHelpful | 0", "StonedOrange69Apr 14 at 7:50 PM\nGreat game!\n\nI am loving this game so far, the only issue I have is sometimes the world eats your weapons if you happen to drop them while trying to burn the dolls, yeah you get them back, but sometimes its a decent bit before finding them again. The only other thing is, when I try to use oculus itself to record the game, it records perfectly just no audio and Im unsure as to why. Other than that the game is amazing, the comic book/cel shaded style is amazing, the controls are simple and easy, its super smooth, scary as all hell! The music is eerie and keeps you on your toes in some place, there are hidden things inside toilets and other areas to give you a quick scare too! The story, the gameplay l, is phenomenal. We need more games such as this to quest!\n\nHelpful | 0", "BigBoiBiggApr 14 at 8:22 AM\nGood, not great - still worth a purchase\n\nI feel like this game is the definition of a 7.5/10 - good, but not amazing.\n\nLet's start with the good first - this is a full-featured shooter with a 6-8 hour campaign, which is awesome to see on the Quest. The guns feel great. The EC Comics-inspired visuals look great and are a very smart way of working around the Quest's visual limitations. The developers were clearly inspired by Resident Evil 4 (the cabin chapter especially), which is a pretty good template to work from.\n\nThe negatives - the game is extremely linear and could benefit from more exploration, as it gets repetitive pretty quickly. The melee combat feels janky and never clicked for me. The draw distance often feels too short and I'm left staring at a blue void. Also, I realize the devs were likely constrained by budget, but a voice over for the text narration would've done wonders to make me more invested in the plot.\n\nLies Beneath is a little rough around the edges but I'm still very much enjoying my time with it. I think the Quest desperately needs more of these kinds of games that feel like a full complete product rather than a tech demo or something that is more or less early access, so I hope we get more games like this.\n\nHelpful | 3", "farruggia2020Jul 22 at 8:36 AM\nBrilliant\n\nThis is the only game Ive ever actually taken the time out of my so precious quarantine day, to write a review about. Ive hesitated to buy this game first because of the price tag but second because i thought i was not going to be able to handle the horror. But I bought it and Ive only played like 15% and this game pushes the limits of what the oculus quest can do. I just finished playing Red Matter, that is too brilliant, and this game competes right up with red matter so props to you devs!, anyway the horror is perfect enough for me to enjoy a spill chill and a light childish scream and frantically fight for my life which is so much fun and what I live for. My only issue is when i use the axe or sword to frantically slash for my life nothing really happens? Maybe its just me not doing anything right since its my first time but just thought i would let you guys know. Also sometimes when you pause the game and go back in , it disorients you from the position you originally paused in and i get flustered and scared while i hear growls as demons run at me, doesnt take away from the game or anything, but i love what you guys have done to push the boundaries of the quest further with great mechanics, graphics, and horror with good action. If you are debating this game because of the price tag, buy it, you already know you wasted money buying the crappy 7 dollar games, invest in this game for spine chilling horror with great action or, Red Matter for great puzzles and stories, but i already recommend Lies Beneath over Red Matter. Devs congratulations and Im sure the rest of this game will be as fun as Ive had already. Buy it. Now.\n\nHelpful | 0", "JackWilson4NeverApr 12 at 12:33 PM\nBest VR game I've played\n\nI loved it to death, after reading reviews it sounded amazing. Now I realize it just doesnt SOUND amazing, it actually is! I always feel like vr games are experiences. This is a jouney! I hate horror games but this is so good and does it so well! Honestly might be the best vr game I've ever played. People keep calling it a disappointment to the horror aspect, but it's honestly a survival horror, adopting the same aspects of Resident Evil. Graphics are great considering it's on a quest. People who use a quest and are disappointed the graphics aren't revolutionary, maybe shouldn't have bought a quest. This game, to anyone who truly want's a great experience, buy this, it's pretty costly but worth every penny in my eyes.\n\nHelpful | 0", "Jag11243Mar 31 at 10:25 AM\nA must have!!\n\nThis game is super fun and has some pretty scary moments! The graphics are great and the story is really immersive, and it doesnt feel like they are shoving plot down your throat. Combat feels fluid and natural and the enemies look really menacing. The game definitely is scary but dont opt out on that just because you are afraid to play horror games. The game doesnt have many jump scares and the horror element gets really fun after you get used to it: overall the game is super fun and polished and I highly recommend it!\n\nHelpful | 159", "Noor_AzzonyJun 8 at 4:38 AM\nWhat VR is made for!\n\nSo I played a lot of VR games both on PSVR and Oculus, But by far, this has been one of the most amazing titles that Ive ever played. The gameplay, the story, the action, the mechanism of the game, and the amazing response of the devs to the bugs when they launched, is absolutely brilliant.\n\nI dont usually rate or review games, but hands down, this is a must play!\n\nYou wont regret it.\n\nHelpful | 1", "jason.bryan.96742Apr 11 at 4:49 AM\nExcellent\n\nReally didn't know what to expect with this title. I'm 48 years old and just started playing the quest 2 months ago. I have not been frightened by anything in the past 20 years. What an awesome job you guys have done with this game and Congratulations on scaring the crap out of me. I'm looking forward to your next title and hope for possible DLC for lies.\n\nHelpful | 0", "matthew.sellers.7543May 10 at 1:22 PM\nAmazing!\n\nThis is how VR is done! The ambiance is so delightfully creepy! It's pretty fast paced at times and gives plenty of great scares and a great mix of action.\n\nHelpful | 1", "dantiriApr 10 at 1:56 PM\nExcellent!\n\nIn my opinion this is the best vr game to date. I was waiting for something like this since I got into vr with the GearVR years ago. Lies Beneath looks and feels so polished.. the developers really pushed the quest to the max even with obvious hardware limitations. I would call it the love child of silent hill and resident evil 4, combining creepy, spine chilling moments with hectic action that makes you feel like you're constantly in danger. I liked it so much I'm going to play through it again. Unfortunately I can't play in smooth locomotion, it makes me extremely sick, but the developers figured out a very efficient teleport system. Still a little buggy, sometimes it's hard to grab objects on the ground and gas cans have weird physics when holding them, but overall nothing too annoying. I wish there was an inventory upgrade, opening up slots to carry more stuff! Anyway, Great job guys!\n\nHelpful | 1", "VRvinbeanselApr 11 at 1:49 AM\nBest game on the Quest imo\n\nFirstly this game looks and runs better than pretty much all of the Quest games before it !\nThe visual style works really well with the limited hardware and it's one of best graphics I've seen on the system simply becuase it's rare I'm not normally distracted by the low quality often on a lot of Quest games and with this one I was more impressed than not. The art style is stunning\n\nThe game is dark creepy and very atmospheric it's really well implemented.\n\nThe controls are superb from holding the shotgun with two hand to chopping through wood with an axe !\n\nLots of OMG jump out my skin moments (for me anyway)\n\nReally recommend headphones the sound quality really adds to the immersion!\n\nI love this game and its a credit to the development team and just the kind of quality I want to see on my Quest\n\nHelpful | 0", "TurboBoarApr 11 at 6:24 AM\nHORROR COMIC COME TO LIFE \n\nInstead of a trigger-happy body-count overload, you are dropped into a fluid storyline that balances the suspense of a creepy journey keeping you on your toes at all times, with outbursts of intense, deadly defense on against the threat charging at you from any direction. It doesn't take much to die but progress is very reasonably saved. Even re-attempting the same sequence a third or fourth time, gave me a queasyness of unease and discomfort in having to confront the ghoulish zombies and creatures in the gloomy winter forest. I have played for only an hour and look forward to immersing myself for the remainder of the ride! Will come back with an update. Definitely worth a shot %\n\nHelpful | 0", "280zApr 10 at 9:45 PM\nDeserves 6 out of 5.\n\nComic Book Action Survival Horror at its finest.\nThe game starts off good and it progresses to great! I'm several hours in and not even halfway through all the chapters. It offers quite a lot of content with replayability. Different difficulty settings change this game from story mode to action to survival themed gameplay. The game is scary at times and you will panic but not because of jump scares which I am thankful for. Using the guns and melee weapons feels very natural. This game makes me feel like a child again playing resident evil 1 for the first time on my PlayStation. This is the most well-rounded game I have played on my quest and I highly recommend.\n\nSide note: I purchased this game on release day and initially there was an issue with ducting and appearing 10 feet up in the sky. For anyone wondering there was an update and this issue is resolved.\n\nHelpful | 0", "DevilishMannyApr 10 at 11:45 AM\nFinally some good fu**ing food\n\nMy goodness if you think you will get too scared your wrong its not that bad atleast the chapters ive played its more action after a while i was having fun just slinging my axe at the enemies but more of all bang for buck i played for hours and am still not that far it seems the the first few chapters are fast but the father u get the longer they will take i would 10/10 buy again best game so far\n\nHelpful | 0", "jean.comeau.963May 5 at 7:24 PM\nI need help!\n\nHi all! This game looks great! It is scary and full of promises. My only issue is I always get killed at level 2 right after I see the big animal carcasses. The only hint I have discovered is the poster showing the two missing teenagers. I should have something to defend myself with at this point no? I have no gun, no sharp piece of wood I can use, nothing!\n\nWhat am I doing wrong? Should I be able to open the big boxes or step into the few camping tents?\n\nThank you for your help.\n\nJean\n\nHelpful | 1", "berickphilipApr 29 at 2:06 AM\nBoring, plain, and close combat is awful\n\nI cannot believe how many 5 star reviews this has. Cannot recommend it at all.\n\nAt first, sure, it seemed like a fun or interesting game. Nice ambiance and pacing.\n\nBut after the first few chapters, it goes downhill because it starts relying on close combat and guess what, it sucks.\n\nNot only that, but the atmosphere and surroundings barely change. It gets boring fast.\n\nUnfortunately I stopped plaing it, because you know.. there are other more fun games out there, and I do not have endless time to keep repeating the same sections due to clumsy close quarters \"fighting\" with repetitive monsters.\n\nI just wanted a good, interesting, eerie story/situation VR game.\n\nI wish I could return this, but I have played it for more than a couple of hours. And I have bought it a long time ago.\n\nSo the least I can do is tell other people how I feel disappointed about it.\n\nHelpful | 6", "m.cody.simsApr 9 at 8:35 AM\nLiterally hair raising!\n\nThis game is very well done. The art style does a great job of squeezing out creepily beautiful scenery from the Quest hardware. This game is very creepy and made me yell in fear and literally had the hair stuck up on my arms almost every time I played it. There is a lot of gameplay here too, very much worth the price!\n\nHelpful | 0", "jacoballen.bakerApr 9 at 1:01 PM\nAmazing\n\nTruly amazing game! Runs smooth, its refreshing and is better than all the first person shooters Ive played on the quest, the story is interesting and it keeps you on your toes, not to mention how satisfying it is to blast a monster away with a shotgun in this game. Love it. Probably one of the best games on the quest!\n\nHelpful | 0", "AlynnfarrellyApr 9 at 9:41 PM\nMore of this, please!\n\nI love horror games. I will admit, I almost gave this a pass because of the comic book style (even though I like graphic novels). I thought it wouldn't feel immersive or eerie enough. I'm happy to say I was wrong!\n\nI'm really enjoying the artistry of the comic book style, and it lends well to creating an eerie environment. As for the dialog, I'm actually really glad there is no voice acting for the player as it keeps the 'voice' internal and personal, as if they are your own thoughts. The soundtrack is fitting.\n\nThe gameplay is incredibly smooth, melee weapons are quite satisfying to use!\n\nThe lighter is unique and an interesting mechanic. Use it.\n\nOculus & Drifter, please, more of this!\n\nHelpful | 0", "banyon.zerger17 days ago\nJust a fantastic game\n\nI'm not one to enjoy horror very often let alone vr and this game is not for the faint of heart. But it was just such a fun scary and difficult experience. So you should definitely get this game.\n\nHelpful | 0", "DurpybananaApr 9 at 5:52 PM\nThe new top game on the Quest...\n\nOut of all the games on the quest this has got to be the best one I have played. From crapping yourself whilst wondering down a dark hallway to shooting a pig headed man in the face this game has heaps in it. The art style is great and there is always a creepy mood with it. It takes ages to complete this game. The first few levels tou dive through quick but as you get further in the levels get harder and longer to complete. I would say it took me from 7 to 9 hours to complete on normal. But there is always the ability to go back and try it on hard.\n\nHelpful | 0", "meilicke808321 days ago\nGreat but..\n\nThis game is great its fun the puzzles are challenging the horror aspect is about a 9 but there needs to be not weapons more specifically melee weapons .\n\nOver all great horror game 10/10 would play more!\n\nHelpful | 0", "skillo77Apr 8 at 6:53 PM\nspaventoso/scary kill app!\n\nspaventoso.sia per genere che stile, grafica e difficolt.la killer app tecnica e di gameplay su oculus quest.come chi ha un index deve comprare Alyx,chi ha quest deve comprare lies beneath.un grado sopra qualsiasi altra produzione.spero supporti il cross buy visto che lo vorrei provare anche sul il mio rift s.\nfrightening. both by genre and style, graphics and difficulty. the killer technical and gameplay app on oculus quest. like who has an index must buy Alyx, who has quest must buy lies beneath. one degree above any other production. hope it supports the cross buy since I would also like to try it on my rift s. with the latest update improved melee weapons (maybe even too much), no more flash black screen. easier to attach objects to the belt. difficulty lowered.I would recommend adding the consumption and breaking of edged weapons!please support italian subtitles.\n\nHelpful | 0", "Mentor2018Apr 28 at 5:11 PM\nAwesome\n\nI love where Oculus is going with this one, I hope they keep adding more chapters to this game l, Not that it doesn't have a 6-7 he gameplay its just after you complete the fame you really want more..\n\nHelpful | 0", "psully4114Apr 8 at 10:11 AM\nIm struggling to think of any criticisms\n\nThe story is very compelling. Honestly I've beaten the game twice now and I still don't think I understood what happened but whatever. I enjoyed it. The atmosphere is great and creepy and much like the orihinal Silent Hill uses the limited hardware of the Quest to add ambience that works great for this title. There is a good variety of weapons, enemies, and areas. The UI is intuitive and the physics work great. The gameplay is fun and engaging and theres a good blend of both isolation thats appropriate for the horror vibe and enough freedom that it doesn't feel hand holdy. There are enough suprises, unlockables and a good sense of progression that even on multiple playthroughs I still feel a sense of discovery on my 3rd time. Its definetly not for the feint of heart or the weak of stomach. Its comfortable for a VR vet but I probably wouldnt recommend if youre prone to motion sickness but I love this. I want more of this. This is the standard for VR on the Quest in my opinion. Great job guys! Can't wait to see whats next for you! A must buy for the Quest.\n\nHelpful | 0", "fepalalApr 8 at 11:59 AM\nOculus Quest needs more games like this\n\nI have tested a lot of quest games, and this is one of the greatest. At this moment, there is nothing similar to this in Oculus Quest. It achieves a good balance between action and horror/creepy atmosphere. In that sense, it remembers me to Dead Space (an action game with a creepy horror atmosphere that keeps up the tension).\nHighlights:\n- Excelent creepy atmosphere.\n- Good graphics (with a stylish comic tone).\n- Excelent sound and music.\n- Long singleplayer campaign: about 8 hours. Not very common in Oculus Quest.\n- Great variety of enemies\n- Intriguing plot\n- Good physics: semi-realistic reloading for guns and shotgun, melee weapons can actually hit the environment, axes can be wielded with one or two hands, knives can be wielded straight or reverse...\n\nThings that can be improved:\n- Close range melee combat: While sometimes it can be entertaining (mainly when the weapon gets stuck in the enemy or a limb is severed) most of the time it feels weird to swing axe fast in any direction.\n\n\n****** POTENTIAL SPOILERS *******\n\n\nAlso, I have found some bugs, or at least I think that they are bugs:\n- Enemies weak spots: When you use the lighter and a gun to shoot at the enemy weak spots, there are certain enemies for whom it doesn't work properly. Most of these enemies are the ones near the end of the game (the ones with tentacles in the upper body), and when the weak spot is located in the legs. When the weak spot is on the arms, I can remove them, but when it is located on the legs, I end spending a lot of bullets as I was shooting on any other part of the body and dying a lot. I'm not sure if this is intentional (so I didn't find the good strategy) or if this is a bug.\n- Enemies respawning: When you complete an objective in a chapter (for example burning a doll) and you do backtracking (i.e. go back to explore a previous zone of the level) enemies that have been killed respawn again. This is particularly the case when you die and restart on the last lamp lightened\n\nHelpful | 0", "calebjadeApr 8 at 9:42 PM\nMan, oh man...\n\nI never write reviews. Games on here are good but I usually stick to Pavlov. Until this game came along.. I'm not all the way through but Im hoping this game is longer than most games. It's challenging, actually scary and intimidating at some points (given the other \"scary\" games on here). Best game to come to the quest thus far and ive already spent maybe 8+ hours on it maybe more, and I plan to play again after I'm done on a higher difficulty.\n\nHelpful | 0", "elgandinoApr 13 at 3:54 AM\nBest vr game to date\n\nThis is the best vr game I have played. It's extremely hard even on normal and keeps making you go back for more. Still only on chapter 9 of 20 and its so annoying at parts and very scary but I'll keep going back to it. Would be good if there was a horde mode in the future.\n\nHelpful | 0", "UndeadMongrelMay 6 at 5:11 PM\nA must have\n\nIf you just got your quest, you want this. With awesome action, a decent story, and a nice horror setting, its a game absolutely worth $29.99 and your time\n\nHelpful | 1", "natividad.marinivMay 3 at 6:32 PM\nLove the game but so sad with the crashs\n\nI bother game over the recommendation of one of my friends. I thought it was comical how he told me that in this game your main asset is a lighter however upon paying and playing the game for quite some time I had to say that I loved it and the story was amazing. However I'm only going to give it 4 stars because it crashed on me twice and I was maybe 40% through the game and it did take me quite some time to get there which is amazing but it crashed completely and I'm really sad. Please help\n\nHelpful | 0\nDeveloper ResponseMay 5 at 2:23 PM\n\nHey there, We're so glad you're loving the game, but bummed about the crashes you mentioned. There isn't quite enough info here for us to help you out, but if you hit up our discord and provide some more details we'll see what we can do. https://discord.com/invite/YasABJN", "RockOn89Apr 20 at 9:43 AM\nWhat a brilliant game\n\nI love this game so much.\nIT's creepy, disturbing and so much fun.\nDefinately in the Top 5 of my favourite VR and Horror games.\nI hope this game gets so much Attention, it definately deserves it.\nThank you Drifter for this Masterpiece.\n\nHelpful | 0", "VR_MarksmanApr 7 at 6:29 PM\nLong storyline and freaking awesome!\n\nThe longer I played, the more I was hooked on this game. The developers did a fantastic job of adding content and variations over the different episodes. The fright factor also got to me at few points in the story. Overall, I'm very impressed with the game play and the length of this game. I spent about 7 hours for my first playthrough on normal, buy I plan on playing again on the hardest difficulty.\n\nHelpful | 1", "jswitch808May 24 at 12:19 AM\nSick\n\nPerfect amount of horror and challenge. Im a big fan of Arizona Sunshine too. Keep making adventure shooters and Ill buy em. Props!\n\nHelpful | 3", "Alex_DrakeMay 20 at 12:54 PM\nWow\n\nThis game has a great story, good mechanics, and overall hella scary. Worth the $30.\n\nHelpful | 0", "teamNONINApr 9 at 8:22 PM\nLike it a lot, hate it a little.\n\nFirst off, I do like this game. But with some adjustments, I would love this game. It could be great. The atmosphere is foreboding, and the comic book aesthetic works great in the headset. Kind of reminds me of Borderlands 2 vr, where I noticed a big bump in fidelity of the graphics, that I wasn't expecting. Everything speaks to me for this game as a fan of Tales from the Crypt. It's not gut punch scary, it's definitely more along the Crypt, where it's creepy, but also has a dark sense of humor, but it won't likely give you nightmares. == the bad is managing your inventory. Is it just me, or is the stand-off at the cabin, insanely difficult? You get 2 holsters on your hip and 2 by your shoulders. If you hold the Hold Button and let go, the weapon drops. But if you tap the Hold Button, I it will keep in your grip. This becomes a problem when becoming overwhelmed by enemies, because switching weapons fast could mean you tapped the Grip Button, but maybe tapped a little too long, and that means your weapon will drop, and you will think its in your hand. You cant grab a weapon without holstering, instead of just swapping weapons, and in the heat of battle swapping a gun for an axe, or another gun that has ammo, mistakes can easily be made, and those mistakes leave you without a gun or melee, and once that happens, there is no way to attack or defend. Not to mention you cant really use your shoulder holsters because it is reserved for the shotgun and another weapon that doesnt turn up until half way through the game, and has very limited applications. Before it shows up, is just an empty holster. So this means that with all the melee weapons, and the several guns, you have to choose wisely because you can only place them in your hip holsters. You cant use 2 guns because if you run out of ammo, you have no defensive or offensive abilities, so you need a melee weapon. It would be nice to be able to choose which weapons go on your shoulders. Even if it was just the long melee weapons weapons But it's is really easy to drop them in battle without you realizing it. Other VR games will have your weapon return to your holster. I can't tell you how many times I ran out of bullets and realized I didnt have my axe at my side. This becomes mind numbing when you are dealing with a wave assault. When you have so many monsters coming at you from all sides, it's easy to get lost in the moment, and the moment you run out of bullets, that lengthy time of swapping weapons will usually be your demise. When you have a shotgun, you have to load in each shell individually, and you can't really swap to a melee weapon, because you need to pump the shotgun, and it can only ever carry 6 rounds. It would also be nice to block attacks with the shotgun if you need to reload. If you drop the gun, or melee weapon , you're done. because, as I said earlier, there is no way to block incoming attacks. When you look down to your empty holsters during a horde, it's comparable to holding a grenade and noticing you accidentally pulled the pin. it feels like the combat becomes unintuitive, especially with tracking issues here and there, swapping guns, loading them, and holstering becomes way to cumbersome. With that said, I do like reloading weapons because it adds to the immersion but switching weapons is terrible. --- on that note, I hate the cabin standoff with all of my heart. -- but this game is still worth getting.\n\nHelpful | 9", "VirtualWaypoint16 days ago\nCreepy and welcomed breath og fresh air\n\nSo there's plenty of shooters out there some more generic than others. I think Lies Beneath with its melee combat and ok variety in guns will satisfy any VR FPS fan out there. I was first hesitant to buy this because I'm not a horror fan. This game is scary but its more like resident evil scary than a jump at you kind of horror game. I havent played through the game yet but I've flinched several times already. But you're always well enough equipped to defend yourself from all the creepy guys scattered around.\n\nI love the art style of the game, it looks sharp and the cel shaded guns and lighter looks sooo good and is a great contrast from the muddy grey enviroments.\n\nSoundesign is great, and the enemies give their position away by grunting and making noise its both creepy but also a good way to prepare yourself for \"battle\"\n\nWeapon handling is almost as expected, reloading is different, but good. Magazines never fall out of the gun, instead you pop them out half way to inspect your ammo count push it back in. You can also rack the gun, and shotgun infinite number og times without loosing shells or bullets. I thinks its cool to have the option. You can also toss the gun to your other and or do a hot swap with the melee weapon. This game is very ambidextrious friendly. Placement of weapons is very well thought out. Big guns on shoulders, smaller at the hip.\n\nOnly 4 stars though:\n\n- The fog, not sure if its an effect or just a way to make it more creepy but sometimes i feel like the enviroments are too foggy.I guess to save on performance.\n\n- I know there's only a campaign here, would love some DLC or a different mode. To keep med coming back when I've finished it.\n\n\n- Story is a bit meh? You read the story and progress by looking at comic captions in the level and turning pages in a comicbook. A different way of storytelling but i would have preffered some narration/voiceacting aswell.\n\nShould you get it?\nYes, but bare in mind that it will spook you a couple of times. But while spooky its also very well executed. And guns and melee weapons feel really good. I'm looking forward to the rest of the chapters in the game.\n\nHelpful | 1", "VictorSpawnApr 26 at 4:09 PM\nLies beneath\n\nA must have! Graphics are good, very immersive! I would recommend some spooky voices, maybe having the character be the narrator, instead of having or in addition to the comic book pop ups. Great game!\n\nHelpful | 0", "TheBagelBoiApr 7 at 12:53 AM\nTo horror fans\n\nThis to me is a long needed addition to the quest, I originally bought the quest hoping for horror games and scares and honestly so far this is the best available, there is nothing I didnt enjoy about the game, Im not saying everything is amazing but there is nothing that makes the game in any way negative. All of the characters are mysterious the story is fun to uncover the secrets arent hidden to the point that its tiring to look for them but they also arent in plain sight. This game has very strong silent hill vibes but it feels completely original unlike games that copy other ones this one was inspired and honestly its amazing. If you really are a fan of horror games you need to play lies beneath, and even if you arent a fan of horror the game is still very enjoyable as a action/survival game. Also the game is large which is nice because there are a lot of quest games that seem to be short, but this game is long and filled with entertainment all throughout it took me maybe 3-5 hours to beat the game and that was without taking and significant breaks other than to eat and take the headset off for a moment. In my opinion this game is worth way more than the price and i would trade it for all the games i already have so definitely its a good choice. I would give it more than 5 stars if I could.\n\nHelpful | 1", "Pot_Shot_420Apr 5 at 8:23 PM\nVery good\n\nThis game has an amazing plot, dynamic graphics and fluid gameplay. My only issue is a reccuring glitch where my height gets placed too tall. I would like to know if others are experiencing this issue, and encourage the devs to fix it.\n\nHelpful | 2\nDeveloper ResponseApr 3 at 4:56 PM\n\nHi there! Thank you for the feedback, and thanks for playing Lies Beneath! If you are so inclined, we would greatly appreciate more info about what is happening leading up to the height being incorrect. If you have time, Jump over to our discord https://discord.gg/YasABJN and ping one of the driftervr folks in there so we can pick your brain a bit about what's going on. Cheers!", "sboekeApr 15 at 10:50 AM\nFrightningly Fun\n\nReally truly amazing sound and atmosphere. The story is great, and has plenty to uncover if you look deep enough. Graphics and art are really fun and allows for some great stylish choices. I really enjoyed this game. My only gripe is with the controls. Some things can really glitch out on you. This is very minor, and is pretty normal for this style of game.\n\nOverall, youll have a fun experience. Its a longer game, with plenty of difficulty.\n\nHelpful | 2", "kentonmcrApr 15 at 10:03 PM\nLove the game, but its crashing!\n\nI wanted to notify the developers that my game repeatedly crashes after the Nadia battle.\n\nI finish the comic to return to the lighthouse before crashing to a black screen with an obnoxious buzzing on the right side of the Quest speakers.\n\nOther than that I would say that this is a must have on Quest! Lies Beneath has a great comic book aesthetic, an intriguing story, is genuinely scary; and has a nice progression of upgrades, spooky locales, light puzzle solving.\n\nHelpful | 2\nDeveloper ResponseApr 16 at 1:55 PM\n\nHey kentonmcr, Thanks for the heads up about the issue you're having. Try restarting your Quest and see if you are still running into the issue. Do you happen to be streaming when this happens? If the restart doesn't help, please head over to our discord page (https://discordapp.com/invite/YasABJN) and we might be able to figure it our if we ask a few more questions. Thanks!", "XxdarkdeathxX21Jun 23 at 11:13 AM\nIts good\n\nCould use a little improvement\n\nHelpful | 0", "singer.vincentApr 7 at 11:43 AM\nGreat\n\nUpdated review: I have now beaten the game on normal and hard and have reached 100% What a fantastic experience. I definitely feel I got my moneys worth out of this title. Even on normal there was a decent challenge to it. Some portions in hard mode are downright nasty but in a good way. This is a must have for your quest library right alongside superhot, moss, drop dead, dread halls and robo recall.\n\nMy only gripe or major feedback is that you should get some kind of reward for achieving 100%. Maybe a BFG or something I dunno.\n\nThis is seriously one of if not the best games on quest. Really looking forward to more work from drifter. Great job, guys!\n\nHelpful | 0", "Crewsy.123Apr 4 at 5:10 PM\nGood Game...\n\nThis game does what it is setting out to do really really well and I like it, however it does not feel like the masterpiece that some of the reviews are making it out as. Still that being said it is a very good title for the quest.\n\nIt took me to the end of the third chapter before I really started to get a feel for the game, so dont bin it off until you have given it a good try.\n\nThe pace and the feel is fantastic and some of the boss type bits are great. The game feeds you the next step up in the combat/weaponry/ and puzzle challenges at just the right pace, because of this you will go to play for 10 mins and 1hr later youll still be playing.\n\nA decent pair of headphones will bring the atmosphere alive.\n\n\nThe couple of points I did have against this game the developers have already jumped on and fixed.\n\nGreat Work...\n\nHelpful | 0", "FlaminRooster8 days ago\n10/10\n\nReally good visual style. Honestly it would be cool if they sold like physical version of the comic used in the game.\n\nHelpful | 0", "Smithsonian30Apr 29 at 10:09 PM\nGreat game - Bad bugs\n\nOverall, this game is a blast. The atmosphere is perfect for what it is trying to achieve: unnerving and a slight overwhelming feeling at times. This is just as much of an action game as it is a horror game, so if fighting off whatever is chasing you puts you off, then this game isnt for you. Id put it in line with games such as Resident Evil where you get chills down your spine while also being able to fight back and take control of a situation before it gets out of hand.\n\nAll that being said, there are definitely some game breaking bugs that feel like could be polished in a future update. Occasionally pausing the game would not show the menu screen. Other times taking the headset off for a second would completely crash the game. This led to a few frustrating moments where I found myself replaying the same chapter because I had to take the headset off for a minute before continuing.\n\nThere are also occasional difficulty spikes that seem out of place? Maybe I just need to git gud but there were some parts (specifically in the school) that I needed to turn the difficulty down a notch to get past.\n\nOverall though, these are all things that can be fixed and the gameplay is definitely on the higher end of spectrum for most Quest games, and a variety of enemies and environments definitely keeps you on your toes. There were some parts that genuinely made me uncomfortable when having to walk around in the dark with only the dim brightness of my lighter to guide me.\n\nPros:\n- Excellent unsettling atmosphere\n- Gameplay is solid\n- Enemies and environments are beautiful\n- Comic book aesthetic comes across very nice\n- Weapons feel good to use\n\nCons:\n- Several game breaking bugs\n- Random difficulty spikes\n- Occasionally would render slowly\n\nWould definitely recommend to most Quest owners. This is a necessary game to own if you like action or horror games. 4/5\n\nHelpful | 0", "IanKaynorJun 5 at 7:17 PM\nGreat but a little short\n\nIt's a great game but it last for 4 hours tops. Also multiplayer would be cool. Still really good. I recommend it.\n\nHelpful | 0", "CaptainCircleJerkApr 3 at 8:36 PM\nThis game compelled me to write a review\n\nLet me start by saying I never write reviews ever!\n\nI literally just finished the game on normal and got 90% complete definitely going back to get all the Collectibles I missed and find more lore on what's going on in the story\n\nThis game by far is the funnest most intelligent most gripping game I have played! The story is INCREDIBLE! The art style is BEAUTIFUL! The storytelling is next level!\n\nThis game had me on edge when I wasnt playing it......I had to know more about it....more about the lore! I needed to know what was going on in this epic story!\n\nI have theories about this game, about what is going on but I'm not completely sure and that is why I love this game! because the developers left it open just enough, they gave us just enough breadcrumbs and story to know what's going on but also left the rest to our imaginations!\n\nI felt like a bad a@# demon hunter! Or the slayer if you're a buffy fan!\n\nGreat job guys! Go BUY THIS GAME! SERIOUSLY, DO IT NOW!\n\nHelpful | 1", "ryman647Apr 4 at 12:19 AM\nTop notch!\n\nI was almost turned away by the horror aspect, cause I'm a total weenie, but, and take it from a weenie here, the horror aspect is super doable. (On a scare level, it's like resident evil 1&2 remake scary). And the combat is wonderful too! It only took one comic for me to be tossing knives with the best of em! (One bug tho, and slight spoilers, sometimes after using the harpoon, the shooting noise tends to continue for long after I shot it)\n\nHelpful | 0", "DF7Apr 8 at 12:16 PM\nGreat Game\n\nThoroughly enjoying the game so far, really immersive and good jumps along the way.\n\nWould love the devs to make a setting to set run as the default movement, find the responsiveness between walk and run a little annoying, otherwise no complaints and a big thumbs up.\n\nHelpful | 1", "mntonyApr 4 at 12:25 PM\nAverage game with lots of bugs\n\nThis is a average scripted shooter with tons of bugs. Bats come out of nowhere, restart in the middle of a battle when you die, the thing you're grabbing for is never what you want, can't hit something if it's too close to you, die for what seems like no reason, etc etc.. Not sure if these reviewers got the game for free or what but definitely not 5 stars.\n\nHelpful | 14", "SC077YJul 10 at 3:37 AM\nSilent Hill meets Resident Evil...\n\nAs a massive horror fan Ive been wanting to try this, but my VR legs arent as good as some. However I am now on chapter 5 Ive jumped, been on edge, felt empowered, and been in awe!\nThis game is amazing, the devs have done so well I cant recommend this enough - survival horror meaning you will face enemies without bullets!\nWhy are you still reading buy this game and show its recommendation it deserves!\n** note to new people** Im playing on teleport mode as its easier on the eyes and Ive had no issue with feeling ill.\n\nHelpful | 0", "OG_ReaperJul 10 at 11:38 AM\nPlease developers, hear me out\n\nI havent finished it but its fantastic so far, its totally unrealist because i know i can beat a monster hord with a axe alone, but well its a videogame, but all jokes aside, interactivity is fantastic, as are the graphics, the story look intrigin so far, but something that came to my head was that it xould use some form of horde or arena mode like arizona sunshine witch would add to the replayability, or even better (although i know it most likely wont be posible) a multiplayer horde mode\n\nOverall, im loving the game so far and hate myself for diyin to a slap or a spike\n\nHelpful | 0", "damnedcaptainApr 2 at 10:56 PM\nBest game on the Quest so far...\n\nHands down, this is the one. Great story, excellent control, killer stylized graphics, and heart racing fun! If you like survival horror and first-person action, buy this game now. Even the melee combat is better than most VR games. Theres heft and feeling to nearly everything you do. The soundscape is super immersive. And there are some jump scares that will make you break into cold sweats. Im only a couple hours into the game and I keep playing literally until my headset runs out of juice. Its THAT good.\n\nHelpful | 1", "Dr_Fate_81Apr 2 at 6:15 AM\nCreepshow Come to Life!\n\nThe graphic novel/creep show vibe is compelling and awesome. I love the use of the lighter and the thunking of a thrown axe into a zombie skull. Glad I purchased. I do have a slight issue when reloadingthe wrist flick is cool but does not always close the chamber on my pistolnot sure if it is user error or my Quest headset setup. Everything else has been quite responsive. I am loving the horror and minimalist atmosphere. Great!\n\nHelpful | 1", "sundrytimesMay 6 at 4:54 AM\nInteresting, Scary, and Hard\n\nCool game, the controls are sometimes a problem. The game is legit scary and the most challenging Ive played on Oculus so far.\n\nHelpful | 0", "cantennaApr 3 at 4:14 AM\nMy journal thus far...\n\nBeginning of Chapter 3; Had a Resident Evil moment...\nEnd of Chapter 3; boy did I ever grow a pair trying to light that doll...\nSomewhere in Chapter 5??? Now I'm having an Evil Dead moment... LOL!\n\n(Money well spent)\n\nHelpful | 2", "SaM-i-aMMApr 8 at 5:42 PM\nBest game on the Quest\n\nI never ever ever write a review. This game is by far the best game on the quest in my honest opinion. Graphics are great. Awesome gameplay and this game is scary as hell. Do not think. Buy it.\n\nPs.\n\nIf you play in hard level, beware, Its reeeeeally Hard!\n\nHelpful | 1", "kaleb_cornApr 1 at 11:44 PM\nThis is a game changer for quest!\n\nWhile I can't begin to touch the top review on here, I just have to say WOW! I'm absolutely amazed with this game. Looks and feels amazing and is scary as hell. Love the physics that the weapons have...really sets the bar for any new quest games. This is what we've been waiting for...the most impressive game on the quest! You devs nailed it! Thank you.\n\nHelpful | 1", "Baffled_DadApr 26 at 11:34 PM\nGreat aesthetics, weighty gunplay\n\nA survival lite type narrative that has you tracking your pa after a nasty car crash. Enemies are suitably in your face from your first encounter, and the sound of multiple shambling horrors coming at you from somewhere close will lead to plenty of fumbled reloads and more brown trouser moments than i usually encounter on quest titles. The wepons are decent olde worlde variants of pistols/rifles, ammo is of course scarce, but the melee options are my favourite way of pummelling the hordes, you can also throw them for a very satisfying head cleave if you have the skill. My thanks to the devs, another great title for the quest\n\nHelpful | 0", "DeepMellowJun 2 at 6:17 AM\nPoor graphics. Washed out.\n\nGame is washed out looking. Blocky with terrible graphics. Same throughout. If you played 5 minutes youve played the whole game. The quest doesnt have the power to produce a decent game. Be careful how many refunds you do they will ban you from refunds. Not worth trying out. If you dont like it you may get stuck with it.\n\nHelpful | 4", "ken.hutchApr 4 at 9:32 PM\nMuch hyped mediorce play\n\nI played for 1 hr and was on level 6, so maybe a 4 hour title, certainly not the 8+ being mentioned in other reviews. The graphics are fine, but it all looks kind of washed out. The story is very boring and has little in the sense of scary or creepiness...its more like oddities instead of fear inducing. The gameplay gets really boring and repetitive...I don't feel like I am missing out not playing more.\n\nThe lighter is used creatively in the game. The game runs well for the most part.\n\nThere are spots where the game flickers, as if going between 2 sections of the game. Being forced to run through narrow paths with no way to cut the spikes, causing you to lose health, is kind of dumb...let me cut the spikes with my axe. There are spots where the lighter does not work properly and points to nothing...for instance in that first castle thing...the lighter embers were pointing towards a spot next to the fire and nothing was there...I had to go down the hallway while the lighter was showing this to be the wrong way.\n\nIts not a bad game, its not a fantastic game either like current reviews are making it out to be.\n\nHelpful | 8", "LordSkelApr 19 at 4:59 PM\nAbsolutely amazing! Until...\n\nI was hooked on this game the moment I started playing. Seeing the Tails from the Crypt style comic book at the start of the game and immediately getting thrown into a very thematic and terrifying wooded area dripping with impending doom and cult vibes... I knew I was in for an amazing game.\n\nHowever, as I began the second to last level of the game, it suddenly became a frustrating grind through areas with glitched walls/ doors that enemies can throw objects through. Not to mention how scarce the checkpoints became, Id spend half an hour making progress not seeing a single checkpoint just to die to an enemy and be sent ALL the way to the checkpoint I left HALF AN HOUR AGO. Currently I am stuck on a checkpoint where you have to gather pieces to a doll. The enemy spawns are dense and dont register hits on limbs. Creatures can throw objects through walls. And just to top it off.. even after you fully assemble the doll... NO. CHECKPOINT. Just more enemies that swarm you immediately with one goal in mind... to send you back to the checkpoint BEFORE you even knew to assemble a doll! I understand Im getting close to the end of the game and its supposed to be tough, but this is OBSURD. The game had been lush with checkpoints that made sense.\n\nAfter a long and tense walk through an area.\nCheckpoint.\n\nAfter a tough but balanced fight with some enemies.\nCheckpoint.\n\nAfter solving a puzzle.\nCheckpoint.\n\nThen you have this level:\nFind doll pieces.\nFight enemies\nFind more doll pieces.\nFight more enemies that can hit you from around corners and through walls.\nAssemble more of the doll with barely any health left and ammo sparse.\nFinally assemble the doll just to have it float away and immediately get flanked by swarms of lunging enemies that hit me even if they are facing the wrong direction.\nOh yeah... still no checkpoint.\nDead.\nRepeat.\n\n\nI want to give this game 5 stars SOOOO bad... but I just cant right now. Even if I beat this level, Im not sure if I even want to play the final one for fear of how little checkpoints and frustration it might cause me.\n\nHelpful | 5", "taylor.huynh2Apr 3 at 6:39 PM\nBEST GAME EVER!!!\n\nJUST STARTED PLAYING THIS. I LOVE IT.. ALREADY CANT WAIT FOR PART 2. PLEASE MAKE A PART 2. LOVE THE GRAPHICS N THE COMIC BOOK FEEL. ITS PERFECT SINCE QUEST DOESN'T RUN ON A COMPUTER TOWER. AWESOME!!!!!\n\nHelpful | 2", "DougyFresh19Apr 8 at 12:53 AM\nLies beneath\n\nThank you oculus. Your hard work really shows Really appreciated. Great game excellent mechanics. Overall a blast to play. Cant wait to see whats next!!!! Thanks again \n\nHelpful | 2", "S4LTYSH4RKApr 2 at 12:58 PM\nNot a horror game type of person but man\n\nI'm not much of a horror fan in any aspect. Dont enjoy horror movies or games because 90% of the time you can kinda figure out when something is going to happen and it breaks you away from the experience. This game does a wonderful job of suspending those \"somethings going to pop out of there\" moments and then laying on the horror pretty thick when your just kind of exploring the world and you turn around to see one of those ghouls in your face. Only on chapter 7 but man am I excited to finish this.\n\nHelpful | 1", "betterautoApr 11 at 10:12 PM\nStop readin start a buyin\n\nIf you still reading I recommend this to everyone buy it now its a must have you should buy it the comic book style is REALLY GOOD gameplay Godlike story see for your self once again BUY IT BUY IT NOW thank you\n\n\nSincerely-\nbetterauto\n\nHelpful | 0", "JakesAMistakeJul 6 at 10:39 AM\nAmazing game, worth the money.\n\nThis game has the perfect mix of scary with only a few jump scares and the combat feels amazing. The art style works so well for a vr game, its amazing how well it runs on the quest. Combat feels bad a, the style is a masterpiece, the mechanics are fun, its scary when it need to be, and its overall just an amazing game.\n\nHelpful | 0", "Logty677Apr 24 at 2:03 AM\nWow\n\nI went into this game expecting a simplistic experience, and came out of it everytime terrified and wanting to come back. Lies Beneath uses simplistic graphics and mechanics to deceive the player into a false sense of comfort, and then it starts scaring you more and more relentlessly. As the game progresses, more gameplay elements are introduced representing the slow descent into horror. My only real issue with the game is some minor bugs that can easily be fixed. I recommend this to any horror-lover (or anyone who just likes to make family members scream.)\n\nHelpful | 1", "SalyderApr 22 at 12:09 PM\nControls lack impact\n\nThe melee feels really floaty and lacks any weight. Its not satisfying at all and kind of required since ammo is scarce. Enemies dont react to being hit and slicing through them feels like cutting through air. The guns also dont sound powerful and lack punch. Yes, I used headphones. They sound like toy guns. I can forgive a lot but when the main mechanics arent well executed I give up on a game pretty fast. The art style is very neat though and it has a very nice up.\n\nHelpful | 4", "Ayeandus17 days ago\nWhat am I missing because i cant see\n\nThe comic style graphics look great when you see anything but the see one foot in front of you foggy atmosphere just doesnt work for me.\n\nHelpful | 0", "panconpinga305Apr 26 at 3:28 PM\nLooks great\n\nHavent finished it yet but its rediculously fun, smooth, and will scare the shat out of you. Looks really good too, we need more games like this one.\n\nHelpful | 0", "joepayne79Apr 2 at 10:38 AM\nLove It!\n\nIll love it even more when I dont turn into a 10 foot monster every time I pause the game and have to restart to the last save. :) Im sure this is an easy patch fix.\n\nGreat job guys...very creative game.\n\nHelpful | 2", "NoblePharesApr 5 at 5:43 PM\nAn experience for sure\n\nThis is a very linear game, laid out in a comic book fashion, typically not my genre but this title does make this style potable. This game is very well made; out of the selection the quest has to offer this title is definitely in the top 5 best games.\n\nHelpful | 1", "JackKehoe69Apr 21 at 5:18 AM\nBest single player on quest?\n\nFirst of all , its an expensive game. However the game is long with a total of 20 chapters I think and each chapter can take a good while to complete, so the price is right imo. It is a hard and creepy game with amazing visuals which make it unique. The storyline was engaging with its comic-like theme and its difficulty makes it somewhat satisfying when completing certain parts. Only downside I have is , the game is long enough but I wish there was something to do after completing the game, I want to keep playing it but I cant bring myself to do the campaign again, maybe some free dlc content would come in handy.\n\nHelpful | 1", "Lucid_Dreamer21Jul 4 at 12:31 AM\nBEST GAME IN THE QUEST\n\nI recently just purchased the Quest because of all the commotion that was being stirred up about VIRTUAL REALITY a few games I played were okay but I wanted something that really grabbed my attention...WELLLLLLL THIS IS THE GAME. It allows you to be scared but still have the confidence to keep moving forward. The graphics in this game are UNBELIEVABLE the way you interact with NPCs and the SMOOTH MOTION IN THE GAME IS SO CLEAN!\n\n\nPS: I would love to see more jump scares I havent completed the game yet, but there is one that is unexpected as ever\n\n...and to anyone who reads this just know your awesome.. and Buy the game you wont regret it.\n\nHelpful | 0", "whydowexistJul 28 at 5:53 AM\nNot perfect, but great.\n\nOk first of all, for this review I have to say I LIKE this game, because after reading this review you may think otherwise. SPOILER FREE\n\nI have played the game on normal difficulty, so your experience may vary.\n\nTHE GOOD:\nThe comic artstyle is executed amazingly, with beautiful (and horrifying) enviroments, vastly different from each other, from snowy forests to a boat cementery. The guns feel great to shoot and the melee is incredible from throwing knives to lodging a pickaxe in an enemys head. The story is simple, yet it is surprisingly deep with a lot of care given to it. The lore pickups not only give you more story, but they unlock ammo and weapons at checkpoints which is a really smart way to encourage world exploration. Explorating every nook and cranny of the world is a treat. The sound design is one of the best Ive had in a VR game. There is 1 mini boss and 2 bosses which are all designed really well and feel fair.\n\nTHE BAD:\nOnly 2 inventory slots, not counting the two back slots as those are reserved for a specific weapon and tool. This makes the game really frustrating at times, especially at the end chapters, as you need minimum 2 guns (melee is pretty much useless at this point of the game) and as much healing items as you can get. Melee is only good for stealth early-game and breaking planks and boxes, most of the time you hit an enemy, theyll probably hit you back twice as hard, as there is no way to block, only dodge, which is a shame as the melee feels great. Chapter 19 is full of enemies which 2 shot you and tank your bullets, and some are glitched which make it impossible to blow up their legs to 3 shot them, so they just use their ability (unless its a feature in which case please remove it). If you die in chapter 19 you go back to the beginning, except for a checkpoint near the end. I havent even played the game on hard mode and I dont think I want to.\n\nOverall the game is great, but it really, really needs some balancing in the end chapters.\n\nHelpful | 0", "NeoVangelionApr 28 at 9:54 AM\nSuspense Horror Action done well.\n\nClever use of weather and lighting with a polished comic book style. Great sound and music. Family have a good laugh at me when I jump from scares. A few hours long with ok replayability. A bit linear at times. Well worth it, if you like horror / action games.\n\nHelpful | 0", "dalostprofit-kiddApr 14 at 8:20 AM\nWorth the $\n\nYes this game is worth the money. It is a full length game with great concepts. The sounds are scarier then the visuals to me but enough action to keep it interesting. Five star is my opinion!!\n\nHelpful | 0", "lorenzomattei91Apr 8 at 9:41 AM\nBest game on quest for now\n\nTried a lot of games on quest, this is the first game that is both original, well done AND have an appropriate length for the price, started it in hard mode and playing it for a week now, visually stunning and entertaining.\n\nHelpful | 1", "AskingsoupApr 6 at 12:24 PM\nwow, just wow\n\nthis game was easily one of the best vr games i have ever played, hands down.\nif you're a fan of games life resident evil just give it a try. this game makes me wish i had alzheimers so i could re-play it without knowing everything.\n\nHelpful | 1", "jdodds1Apr 3 at 7:07 PM\nStop comparing it to alyx\n\nIts really unfair to compare a quest game to the best pcvr title yet. It sets up an unfair standard that the game was never trying to reach in the first place.......now on to my review\n\n\nIs it worth 30$? Possibly, but right now I'm saying \"not really\".\n\nThe graphics are on the bad side of \"ok\", but the atmosphere is actually pretty good. Sort of a sin city meets resident evil vibe\n\nThe gameplay is incredibly basic. Instead of iron sights the revolver has a laser pointer, the axe was pretty fun but not the best I've seen, and I haven't unlocked any other weapons\n\nIt's very hand holdy, it sort of feels like babies first VR horror game. It's like it really wants to be half life or resident evil, but doesn't have any faith in the player to figure things out for themselves.......to be fair I'm still in the first parts of the game, so that could change\n\nThere have been multiple points where I was supposed to be scared and just wasn't, and I'm very susceptible to horror, I actually think My niece could handle this game and she was afraid of the mouse in Moss lol\n\nThere's definitely potential in the story, I'm intrigued for sure and will definitely keep playing, and whether or not it's worth 30$ relies ENTIRELY on the story, because the graphics/gameplay/horror elements definitely aren't, even for the quest\n\nHelpful | 6", "stockXuser123Apr 13 at 12:24 PM\nFavorite quest game so far\n\nI wish I could rate this more than 5 stars because Ive never really been a horror person but playing this game has made me love it. This game plays really well and looks creepy and amazing.\n\nHelpful | 0", "MoguTTApr 3 at 7:55 AM\nGood Game,but we need Chinese,thanks;)\n\nThe game art style is very like, the battle is also very exciting, the first time to buy the game, although there are some bugs, but still can't stop my love for the game, but I hope you can update the Chinese, we need Chinese, thank you\n\nHelpful | 1", "KrymBaltimoreApr 1 at 3:13 AM\nLove the art style!\n\nThis is a great game! The art style is awesome and works well with the abilities of the quest. It gives an old horror comic book vibe that makes it unique in the horror genre. The creepy feeling can't be denied as you're going along in the different environments hoping to make it to the next save point without getting caught by the monsters that lurk in this place. I intended to give it about half hour after it finished downloading you know...to feel it out. Two hours later (would've been longer if my quest didn't crash for some reason) i realized that this game would have to be in heavy rotation! I don't know how close to finishing i am but i hope there a lot more game left to go. I'm giving 4 stars for now because i can't judge the fullness of the story yet but everything points to this being a 5 star game to me! The feel of swinging the axe and other sharp handheld weapons is satisfying. They seem to get stuck in wood planks or whatever you chop with them and they can be left in the monsters too if you're not careful. You can almost feel the chops! If you know vr games, you know that even some of the really popular titles miss the mark there. The gun is good too and using the lighter with it is a good way to add to it's usefulness and accuracy which is important because ammo is limited. This is a great game and i highly recommend it! Get it NOW! Join my fb group called me and vronica I'll be posting some gameplay snippets from time to time of this and other games and the other group members do also. I'm gonna avoid posting any spoilers to the game so you'll be safe when you watch my vids lol. I'm sure that once i finish this game, I'll be able to give that 5th star! BIG thanks to the devs on this one! You brought me back to my quest native game library with this game! Great job!\n\nHelpful | 2", "driddle3301Apr 1 at 5:06 PM\nAbsolutely Brilliant!\n\nThis game is all-in-all amazing. From the visuals, to the atmosphere, to the combat. This is certainly no run of the mill vr experience. This is brand new, and takes the oculus quest to it's limits.\n\nThis game is gonna be remembered with the other survival horror greats, RE, dead space series, and other classics.\n\nAnd yes this is indeed survival horror. I didn't expect mich going into this game, and it far exceeded my expectations. This game makes you micromanage your inventory, ammo, health, all while scaring the absolute sh** out of you.\n\nThe only reason i didnt give the game 5 out of 5 stars is because of a few bugs, which is certainly to be expected from a game that is so new. The most abnoting of them being the game black-screening randomly. I believe it's meant to do that when you come too close to obstacle and in-game structures. But it feels like it does that even when i am 5-6 ft away. This can be annoying and can mean a game over if you're in the middle of a right.\n\nThe second bug I came across was slightly less annoying but still troublesome nonetheless. Whenever you pause the game and unpause, you will start facing a different direction than when you started. Even if you remain standing the same direction. You also lose tracking briefly when this happens, the pause menu screen may be 10 ft. Away from you when you pause and you have to re-center.\n\nSo all-in-all this game is NEARLY flawless, as long as the devs fix these bugs, it WILL be flawless. A first of it's kind, must-buy game!\n\nHelpful | 2\nDeveloper ResponseApr 2 at 10:42 AM\n\nHi there! Just wanted to respond quickly about the black screen fade issue you mentioned. This functionality occurs to prevent players from room scaling through walls, but it was activating in situations it should not have been. We've fixed this issue internally and expect the fix to make its way into a patch for everyone soon. Thanks for your patience and feedback!", "caseypinApr 4 at 6:19 AM\nThe quality weve been waiting for\n\nBought the game. As soon as it dropped. Only just got a go as my son hasnt stopped playing it. Great game. Love the styling. Finally something that is really high quality with a great story of full length. More like this please.\n\nHelpful | 0", "butterscottJun 28 at 2:56 PM\nI am amazed\n\nSuch a good game. It holds the perfect amount of scary and the right amount of shooting and action. It feels so real and it is just perfect. Its a must buy in my opinion. I would definitely say not to play this if you are below 13, for the horror. But everything else is just really great. If your looking for a good horror game, this is the one for you.\n\nHelpful | 0", "boybrownApr 3 at 11:12 PM\nLies Beneath on Top\n\nA fantastic horror/ stealth/ shooter. Presentation is top notch, sound design causes the 50p/20p effect. Drifter have quickly fixed a few bugs(screen blacking out and being 12ft tall). The best Quest game? I think so. Purchase now!\n\nHelpful | 0", "ShadowtaderApr 12 at 4:28 PM\nGreat\n\nBy far the best vr game I have ever played. There is a great story along with fantastic gameplay and amazing scares. Its not very cheap but I can assure you its worth the money.\n\nHelpful | 0", "TheRedSharkApr 9 at 4:34 PM\nSooo good\n\nI didn't expect much from this game in the beginning, bought it only because of the good reviews but then I started to play and wow, this is absolutely one of the best game for the quest right now!\n\nHelpful | 0", "lilboomerMay 22 at 8:38 AM\nMust have!\n\nFinished the game and it's a must have on the quest. I definitely recommend this game.\n\nHelpful | 0", "MichaelTries18 days ago\nF my life\n\nSo yeah thats scary as F**k. Granted I suck at all things scary. Why did I buy this again?\n\nHelpful | 0", "robot_builderApr 2 at 12:39 PM\nDont miss out on this great game!\n\nThe art style and the graphics are perfect for the quest. It makes everything look so great. The game play is fun and alluring. I highly recommend it!\n\nHelpful | 2", "Deadpool2896Apr 1 at 3:55 PM\nGreat game\n\nA little scary when you first see the characters, good gameplay and cool story so far. As Im writing this Im just starting chapter 3\nHighly recommended!!\n\nHelpful | 2", "michael.middy.21May 15 at 11:08 PM\n\nSweet AF\n\nHelpful | 0", "MeatballmachineApr 21 at 7:34 AM\nJust buy it\n\nIf you were waiting for the must have AAA title for Quest- this is it. Amazing. Devs take note, this is how you get my 30 bucks\n\nHelpful | 1", "sebastian.kurz.583Apr 12 at 11:22 AM\nImmersive comic horror survival\n\nReally good game, interesting comic style, and scary moments. Inventory system with weapons works really very well, reload, weapon switching feels awesome! It is really a difficult (!) survival game that let you feel the survival in a very strong way as you run and battle for your life, always searching for food and ammo - definitely something that is unique so far on the quest. Unfortunately it is also very buggy - I had to restart the game several times, in game collision and item pickups are also a bit inaccurate. It seems not thoroughly tested, more like an advanced beta. Hopefully the issues will be worked out over time.\nNevertheless recommended if you want to discover an unique horror game in resident evil/silent Hill style and want to have a real challenge.\n\nHelpful | 0", "shashking404May 11 at 1:21 PM\nYes, Oculus Medal Of Honor can wait...\n\nReading reviews for this game is a time waste , this game needs to be experienced right from the splash screen to the Action-horror gameplay. 5/5 stars\n\nAfter seeing Robo Recall Quest port i really had a great expectation from Driftor. You Sure have delivered and managed to give out an update even in this horrid Coronavirus Outbreak time. i tip my hat to your commitment towards us VR players out there.\nLies Beneath is a gift to Oculus Store in the wake of Half Life Alyx\n\n2 negatives though:\n1) i CAN'T avoid enemy projectiles my physically ducking! why? WHY? Games like Pistol whip has enemies targeting the Player headset area and this makes the Players dodging natural but Lies Beneath game has no reward for Players ducking at right movement at all.\n2) i thought to record the gameplay to share it but there is...no audio...\n\nHelpful | 0", "SchnooginzApr 21 at 10:26 AM\nStory did nothing to explain\n\nGame play was fun. Combat was fun. Atmosphere was creepy unique and fun. But I bought this game because other reviews had indicated that it was a long game and that it had a great story. This game was not as long as other reviews would indicate.. I beat it and about two charges of my headset. I guess it's about as long as I would have expected for the price. However my biggest complaint is the story.. Everyone raved about the story to this game.. it's hard to voice my complaint without spoilers. So I'll just say the story did nothing to explain the situation at all.. it just didn't make any sense why you had to fight all these monsters.. it didn't explain why the monsters exist or what the significance is of the lighter.. it drops enough hits that by chapter 10 you get a general idea Of how the story is going to unfold. In the end instead of a sense of satisfaction that most games give you you get an overwhelming sense of frustration.. your left thinking what that was it seriously? And if you plan on buying ( and in all honesty it is a fun game so you should give it a try) this game stop reading now because the last sentence or two will be a spoiler. SPOILER ALERT ****** while losing someone close to you can be very depressing and cause some deep rooted psychological problems in some people it doesn't create hallucinations of monsters on this level. The ending was both frustrating and disappointing they could have done so much more they were so close to creating a truly epic game....\n\nHelpful | 2", "l3rianKApr 22 at 3:54 PM\nEnjoying every moment of it!\n\n\n\nHelpful | 0", "CarkusApr 20 at 12:52 AM\nAmazing\n\nI knew this game was good but i didnt know it would be this good. Its so scary i haven't felt truly scared in years buetiful game 10/10\n\nHelpful | 0", "Aqua-VRApr 1 at 11:25 AM\nFirst high quality 8 hour game on Quest\n\nI don't think there's been a game out that's this long yet, very well produced\n\nHelpful | 4", "L0n3w01fApr 11 at 6:57 AM\nIts great\n\nThe game is overall great and poses a challenge to even experienced VR players like me. The comic book style narration though makes the story less compelling but in every other aspect the game is great. If you enjoy playing Resident Evil, this is a game to get for VR if you want to see the scares up close and personal.\n\nHelpful | 0", "stealthgunner95Apr 4 at 11:04 PM\nIm not easily scared by games, but...\n\nThis game really had me on edge most of the time. It has been awhile since Ive played a really good horror game and would definitely make this a must have game if you are into survival horror. Well done!\n\nHelpful | 0", "FluxRyanMar 31 at 2:21 PM\nWashed out with blackouts\n\nCant get into this game until I find out why everything appears so washed out... Contrast is markedly bad - blacks are grey.\n\nAlso, you cant physically move very much in this game without the entire screen flickering to black and then back. And after each of these blackouts the camera seems to be moved. Whats up with that?\n\nHelpful | 22\nDeveloper ResponseApr 2 at 10:49 AM\n\nHi Ryan, Just wanted to respond quickly about the black screen fade issue you mentioned. This functionality occurs to prevent players from room scaling through walls, but it was activating in situations it should not have been. We've fixed this issue internally and expect the fix to make its way into a patch for everyone soon. Thanks for your patience and feedback!", "italktorobotsMay 7 at 6:31 PM\nNeeded lots more testing before release.\n\nEveryone seems to be raving about this game. I had 3 different fatal glitches in the first 2.5 hours of gameplay, where I had to shut down and restart (from checkpoints thankfully). I quit playing after 3rd glitch.\n\nHelpful | 2", "OctopiWallStApr 10 at 3:00 PM\nNot as good as made out to be but good\n\nI wanna start by saying mechanically this is a pretty good game and its really impressive what theyve done with the hardware. That being said I feel that this game is overhyped. Its enjoyable enough but the hit boxes are weird and the AI is kind of finicky. Some of the textures would have benefited from some more cell shading as they look kinda crappy at times. All-in-all I would highly recommend this game at the price offered.\n\nHelpful | 1", "ben_jammin1985Apr 14 at 9:00 PM\nLove it\n\nThis game is perfect. The movement is smooth. It is suspenseful and scary at times. I would recommend to anyone who loves to shoot and be scared.\n\nHelpful | 0", "recyclopsApr 1 at 5:58 AM\nA must in your library.\n\nBelieve me you should experience this.\n\nHelpful | 5", "SweetMan2612Apr 23 at 12:16 AM\nAmazing\n\nHoneslty it is just a good game, a bit creepy but it is just a great game! I'm very picky and this is good\n\nHelpful | 0", "Jeff2021Apr 13 at 9:03 AM\nBest game I have played on Quest\n\nThis game is a lot of fun and the kind of experience that will give the Quest staying power. I have put multiple hours in and am only halfway.\n\nHelpful | 0", "odiousego65Mar 31 at 3:18 PM\nWow\n\nIt's worth what you pay I love a good horror game and by golly it's a good horror game\n\nHelpful | 3", "2PumpTrumpMay 8 at 2:10 PM\nWow!\n\nEverything about this game is phenomenal highly recommend. Bit I steam games and people cannot hear the game audio I wonder why this would be.?\n\nHelpful | 0", "nelagalvez1984Apr 11 at 1:52 PM\nAwesome\n\nThe game is 6/5 stars.\nIt is long enough for its price, and it is a mix of story + shooter. It remembers me a lot the rpg \"kult\" from the 90s.\n\nHelpful | 0", "Divine_Potato1Apr 2 at 5:54 PM\nLove it!!!!!\n\nAmazing game! Please make more like this in the future! Maybe something like a multiplayer survival game \n\nHelpful | 2", "theporktornadoApr 8 at 11:25 AM\nWell Done\n\nA perfect blend of fear, art, and action. The holster system is incredible. Lots of fun and Im only hand way through. Careful - you will sweat in fear!\n\nHelpful | 0", "JSTP831Apr 12 at 12:33 PM\nSo  good!!!\n\nI like it a lot. The comic style concept works very well and they have some jumpscares put in the game too! Nothing more to say!\n\nHelpful | 0", "alexandern83Apr 2 at 5:29 PM\nNeeds brightness adjustment\n\nIt feels like a great game, polished and story driven, but the dark areas in the game doesnt feel dark enough, they all seem too bright. Destroys the vibes of the game, a cave doesnt feel like a cave. VR revolves around immersion and due to incorrect brightness in the game this game lacks immersion unfortunately\n\nHelpful | 10", "D-2007Apr 3 at 7:03 AM\nWe need more games like this\n\nThis game had me on my toes for the entire time! I was excited to fight zombies and that lived up to my expectations! Great job in this game and hopefully we get more by them!\n\nHelpful | 1", "Maus7Apr 2 at 2:35 PM\nMust have\n\nBuy, play, come back here after a few hours to give 5 stars.\n\nHelpful | 3", "kentnetMay 5 at 2:47 PM\nSuper nice\n\nSuper nice.\n\nHelpful | 0", "ClutchCrutchApr 1 at 1:00 PM\nBest VR Game For the Quest\n\nThis game is impressive. I would love to see a multiplayer feature. That would make this game unbeatable!\n\nHelpful | 2", "GarbulansApr 3 at 2:59 PM\nBe part of a horror comic!\n\nThis game has an incredible atmosphere, the comic art is original, polished and scary, perfect for quest. Although, it would be great to have the option to limit the field of view when moving or running. Specially when you have to escape I feel motion sickness. With teleport I get lost when escaping and the immersion is not as good.\n\nHelpful | 3\nDeveloper ResponseApr 3 at 3:05 PM\n\nThank you for the feedback, we'll look to include some additional comfort options in a future update.", "EdmCaperApr 18 at 10:31 PM\nMy favorite Quest game so far\n\nI have nothing but good things to say about this game. It surpassed every expectation I had.\n\nHelpful | 0", "omeggsApr 2 at 7:38 PM\nGod, yes. Just, buy it.\n\nI normally dont write reviews for games, but this one just absolutely deserved it. This game has blown me AWAY from playing it. The comic book art style is absolutely stunning and works perfectly with these creepy monsters you have to fight off. You can choose to shoot your way through this hellish nightmare or swing at demons with a variety of melee weapons, which is my personal favorite. Not only is it satisfying to hack off the limbs of these creatures, but a quick shotgun blow also gets the job done.\nAn absolute must have for any survival horror fan. The way your weapons and hands interact with the world around you only adds to the realism, and the story is more than long enough to get you replaying.\nOnly giving it 4 stars because Ive noticed a FEW bugs; When knife throwing enemies throw a knife at you, sometimes the knife will get stuck on you and youll take a hit from it about 5 or 6 times before the knife hits the ground. Also, the grabbing is a finicky. Alas, this game has just come out, and it really doesnt take away from how incredible this experience is. Highly recommend! :)\n\nHelpful | 0", "SPENGAApr 2 at 7:21 PM\nIts a good game\n\nI dont get scared much. But when you seeing it run torwards you. You feel it in your stomach.\n\nHelpful | 2", "CodyhcrApr 2 at 8:48 AM\nEpic, Terrifying, and I love it!\n\nSuper cool game. If you want a VR game that steps outside of the arcade genre, this is for you. Cool story, smart progression, and its just a blast. Worth every penny.\n\nHelpful | 0", "heytheredelApr 4 at 7:08 PM\nAmazing! Immersive!\n\nThis is probably one of the best horror/action game Ive ever played on quest. It keep you on your toes! Same creators from Red Matter. Definitely worth it!\n\nHelpful | 1", "SenorZeroApr 2 at 3:48 PM\nAbsolute must buy survival horror!\n\nWhile there are some kinks Im sure theyll be worked out, but Jesus Christ I love this game The art style along with the silent hill/ lovecraftian mood is awesome!\n\nHelpful | 1", "leonardallen1Apr 10 at 7:02 PM\n4 stars ONLY CAUSE..\n\nWe can all use room for improvement but yes this game has it lil bugs such as accidentally grabbing your pistol trying to reach things on the ground or table etc. But this game probably gave me the biggest scare in vr but not the scariest game iv played\n\nHelpful | 1", "rugameApr 13 at 7:29 PM\nAmazing, immersive experience.\n\nEvil Dead meets Silent Hill in a comic book art style. You can feel the terror. The environment sucks you in.\n\nHelpful | 0", "abeesen22Apr 5 at 9:35 PM\nGreatest game yet\n\nEasily the most entertaining game on the quest. The graphics are perfectly suited for the headset and the gameplay is in a league of its own . BRAVO!\n\nHelpful | 1", "colten.willisApr 1 at 9:52 PM\nLove love love\n\nBest game to date  thank you drifter  can we possibly get multi playerr one day?\n\nHelpful | 2", "Eat_ElderlyMar 31 at 9:18 PM\nEpic\n\nbest game on the quest\n\nHelpful | 4", "garrett_tubbsJun 12 at 11:10 PM\nOne of the best in the oculus store\n\nBought this for my friend to do a lets play in vr and expected it to be less than immersive and not at all actually scary but to my surprise it left me with chills and a racing heart. It runs well and has different settings depending on your level of experience in vr to prevent motion sickness . I highly recommend it if you even slightly like horror games or movies .\n\nHelpful | 0", "DoomdriverXDnoscopeApr 19 at 4:14 AM\nHighly imerssive\n\nIt is the perfect game for be immersion and horror action packed experience\n\nHelpful | 0", "SkoutyApr 28 at 4:53 PM\nThis game is awesome\n\nWowowowowowow intense stuff\n\nHelpful | 0", "bronan666Apr 22 at 5:25 PM\nPerfect game\n\nMore games with this type of perfect execution. Flawless!\n\nHelpful | 0", "gsimmons87Apr 1 at 12:07 PM\nWanted to give the game 4 1/2 stars\n\nIm loving the game so far. Im Definitely on edge when playing (thats a good thing). I have notice a few times were my axe would go through the enemy and not register the hit. Something the dev may be able to fix with future updates perhaps .. other then that an amazing game so far\n\nHelpful | 1", "KENNYVALENTINEApr 29 at 11:20 AM\nLies beneath\n\nA must!\n\nHelpful | 0", "Brandon3pApr 26 at 6:21 PM\nGreat game\n\nSuper immersive . Great mechanics\n\nHelpful | 0", "Arch281May 3 at 5:54 AM\nGreat game but...\n\nThis is a fantastic game and I am enjoying it but it does need some bug fixes. Also I would like it if they made more levels!\n\nHelpful | 0", "Blitz_kriegJun 4 at 11:18 AM\nWOW\n\nBest game on the quest.\n\nHelpful | 1", "fulldeckApr 9 at 12:18 PM\nLies beneath\n\nBest game by far made me jump loads of time and quite challenging as well a must buy, might give u nightmares lol\n\nHelpful | 0", "Sidx21Apr 8 at 7:13 AM\nAmazing\n\nTotally worth every penny, only on chapter 4 and already Im in awe, love the mechanics, graphics and the story!\n\nHelpful | 1", "JohnnyDosageApr 14 at 9:31 AM\nAmazing horror survival\n\nThis game has fantastic action, awesome atmosphere and a great length for a VR game\n\nHelpful | 0", "aaron.sommers.1253Apr 1 at 12:00 PM\nLies Beneath: Mae\n\nAlex who, no my frinds there's nothing else right now, except. Lies Beneath:Mae.\n\nHelpful | 5", "LoneSoloMemerApr 17 at 9:42 PM\nVery good\n\nThe graphics are amazing, gameplay is great, and story is great\n\nHelpful | 0", "TrapDaddyDustinApr 7 at 4:32 PM\nResident Evil VR\n\nMy new favorite VR game! horrifyingly good with a steady pace of action and fear, a must play for any horror fan.\n\nHelpful | 0", "Beachjim48Apr 14 at 12:19 PM\nScary fun\n\nLoved this up to the cabin. I am stuck here and having a hard time passing this. Any suggestions?\n\nHelpful | 0", "MoreReesesPlsApr 12 at 10:31 AM\nGreat game would recommend\n\nThis game is so freaking scary try this game out its best 30$ ive spent in a while\n\nHelpful | 0", "MitcheMooApr 2 at 9:56 AM\nBest Quest Game\n\nSo.. Went into expecting good Things- BOOM!\nCame out of that game with blood on my hands and a Game boner.\n\n//THIS SH*T GOOD NI***\\\\\n\nHelpful | 1", "mattjohnholmesJun 20 at 2:36 AM\nEh. Nothing special\n\nToo simple\n\nHelpful | 0", "jking015Apr 1 at 4:42 PM\nAn Oculus Quest Masterpiece\n\nMiss out if you want too! Great game! Great mechanics! 10/10\n\nHelpful | 2", "JackA88Apr 23 at 5:19 AM\nBest vr game on the quest\n\nI love this game so much\n\nHelpful | 0", "SaiseApr 10 at 3:27 PM\nA must have\n\nI loved this game, it's a good mix of horror and action with some amazing art direction.\n\nHelpful | 0", "Wildcard999Apr 7 at 8:16 AM\nExcellent game\n\nIf you love comic books and horror games, you will absolutely love this game. Highly recommended.\n\nHelpful | 0", "VibeTalkerApr 7 at 12:54 AM\nHoolly Crap!\n\nThe art style, beautiful. The gameplay smooth and quick. The story and atmosphere absolutely chilling!\n\nHelpful | 0", "Hamburger555Apr 12 at 1:57 PM\nAmazing\n\nLooks amazing, its scary, and really makes you want to keep playing\n\nHelpful | 0", "WEHEIBA_AApr 5 at 7:27 AM\nBEST HORROR GAME IN THIS STORE\n\nThe game/ the story / the physics/ the gameplay.....its other worldly ....it is truly a good game\n\nHelpful | 1", "peter_garciaApr 2 at 6:54 AM\nGive it a try\n\nGet it.... you have nothing else to do\n\nHelpful | 2", "Abomb84Apr 25 at 6:35 AM\nFun, tense, full game!\n\nReally great game! Hope to see more from this studio. Gets bumped to 5 stars when audio for Stream/Video recording gets fixed.\n\nHelpful | 0", "ultimateguy322Apr 20 at 5:27 PM\nGoo game but should be rated intense\n\nVery good game only reason I rated 4 is cause it should be rated intense as there is multiple jump scares and more But overall very very good game\n\nHelpful | 0", "FguillotineApr 3 at 5:24 AM\nA cult classic!!!\n\ncongrats to Drifter for such an amazing game. One of the best VR games i've played in the last five years.\n\nHelpful | 1", "shuttlerApr 5 at 5:06 AM\nIntense great 6-8h Action horror\n\nWow, i love the artstyle, the shooting and ... its not to scary and worth it. Go get it...\n\nHelpful | 1", "TheAwsomeMudkipApr 10 at 2:33 AM\nOutstanding\n\nIm not the biggest horror fan, but even this game was able to give me a terrifying experience filled to the brim with subtle and extroverted storytelling. If you own a quest, this is a must play.\n\nHelpful | 0", "krisvdvijverApr 1 at 2:17 PM\nbest horror on Quest\n\nThe new king of horror on Quest!\n\nHelpful | 2", "pinknoise2077Apr 7 at 7:14 AM\nDevelopers read john.sebi's review\n\nThe close quarter combat system should be improved and would definitely give 5 stars.\n\nHelpful | 3", "SharkBiteGamerApr 7 at 3:48 PM\nGreat\n\n10/10 best horror game on here best action without a headache Ive played\n\nHelpful | 0", "OrdernJul 19 at 1:51 AM\nMust buy\n\nNot really that scary but interesting storyline and gameplay\n\nHelpful | 0", "RodOculusGameApr 28 at 2:30 PM\nIt Closses many times\n\nIt closes many times. A message that has been unexpectedly closed stops coming out. And when you can play you don't see the blacks are gray. The time of return has passed because if not, I claim the money\n\nHelpful | 2", "reflemx21Jun 27 at 12:38 AM\nBest oculus quest game so far\n\nThis is the half alyx of quest and if ur waiting for walking dead to come out get this game to pass the time BEST oculus quest I played right now.6-8 hours of play time\n\nHelpful | 1", "SW_CelerityMay 30 at 7:39 AM\nIncredible\n\nThis game is so much fun. The game looks amazing and the comic book feel works perfectly for the scares in this game. It feels and plays extremely well and the story is very engaging. Id have to say that probably the craziest/most fun Ive had in this game so far is when youre running through a wooden maze from a huge human-like monster. It got my adrenaline going and made me feel like I was actually in danger. 10/10\n\nHelpful | 0", "KnittelManApr 9 at 6:41 PM\nFun but some issues\n\nOriginally I wrote how the random black screens made this game almost impossible to play but luckily they updated that! But theres still some issues.\n1. The biggest one is the Force Grab. The only way you can grab certain objects is by waiting until you look at it just right and have your hand just right so it can fling to you. This was very annoying when an object is within actual grabbing distance but I couldnt just... Grab it... then objects that you want to force grab.., like a particular doll thats relevant in the game, you cant.\n2. You cant melee with guns. Sometimes I ran out of ami with my shotgun or pistol and I wish I could have done a last minute bash or throw with the weapon. Would be great if you could find bayonets or just blunt force with your fists, etc.\n3. Some things I still dont understand like the skulls in the chapter select. It will say 3/4 etc. but I have no idea what its referencing.\n4. I wish there was a mode to play multiplayer or just be in an end ness horde mode to just kill things as long as possible\n5. I wish there was some puzzles along the way.\n\n\nBut those issues are very minor in the grand scheme of the game. Overall the comic book style was great, the story Sooners wss creepy, etc! The difficulty settings felt like they really did make a difference. You could be clever with things like bear traps and gas cans, or just run and shoot. I wish there was some voiceover or at least the option for it instead if having to read everything but again, minor gripe. Overall it was a good length game and I had a blast and I plan to keep playing in a harder difficulty!\n\nHelpful | 0", "Fredd32Apr 12 at 9:19 AM\nVery good\n\nGood balance between horror and action. Loving it so far. A few stutters here and there keep it from 5 stars but still amazing this is running on a mobile platform\n\nHelpful | 1", "MadJay94Apr 1 at 3:29 PM\nAwesome\n\nJust awesome\n\nHelpful | 2", "ZeroStaticJun 22 at 9:01 AM\nGreat style, great game.\n\nDespite the age of the Oculus Quest' Snapdragon chip, it's still able to put our amazing graphics. Although the graphical fidelity of the environments are not the greatest, the animations, sounds and models are of good enough quality to really create a tense atmosphere.\n\nTogether with the sometimes hectic action scenes, it creates one hell of a Standalone survival horror title.\n\nHelpful | 0", "UBSERDApr 8 at 3:04 PM\nI really love this game.... but\n\nIn a good portions of this game when the action picks up, the game becomes a chugfest with uneven frames that are disorienting. The sad thing is for the most part when walking around the environment things are much smoother and you wish the whole game ran like that. When there are multiple enemies on screen, or a scripted event happens things take a turn for the worst. Small encounters dont cause much performance drop but the uneven frames exist there as well but on a smaller scale.\n\nOkay that was a bunch of issues I have with this game, but other than those, this game is great and is definitely a tense challenge. The ability to swing weapons around and throw them at enemies including axes and stakes is pretty darn cool. You can also flip the weapons in the air really fast and catch them again and depending on when you catch them they will be facing a different direction which I thought was pretty awesome. The shotgun is awesome as well!! The racking and sound effects while doing it are spot on!\n\nTo add to what I love in this game, the art style is like a comic book. Even the shadows have stylized edging that you would see on comics which impressed me.\n\nAlso there are some genuinely scary moments that surprise you, you wont see them coming trust me lol.\n\nSo to finish this review, I think this game is amazing especially on the Quest but I think it needs some more optimization first to be a must buy for everyone that loves horror games, especially if your bothered by poor optimization like me. I am trudging though it because I do really dig it. If you dont care about drops in frames for a mostly smooth experience give it a buy, youll get your moneys worth in content.\n\nIf these problems are addressed then yeah pick it up definitely if you like RE, or Silent Hill.\n\nIf a future update fixes the performance drops I would give this  and give my full recommendation.\n\nHelpful | 1", "zombieruckspinApr 5 at 9:19 PM\nDUDE...\n\nThis game is great. If you like crazy horror things give it a go.\n\nHelpful | 1", "PotatoSaladaladsApr 13 at 12:14 AM\nMakes all other quest games shameful\n\nMakes you feel like Batman\n\nHelpful | 1", "DrLovefingerApr 4 at 8:44 AM\nAmazing game, when you can see of course\n\nBeautiful game, great story, plenty of bugs. I can look past the guns dropping randomly and the grabbing things I dont want instead of things I do. But when Im knee deep in battle in the cabin and my screen keep going black as Im about to beat it I lose my interest in it. Not sure whats causing this glitch but it has never happened on any other game. This could easily be my favorite game but Im not touching it again until it gets some updates.\n\nHelpful | 2\nDeveloper ResponseApr 4 at 7:04 PM\n\nHi there! We recently pushed an update which should address the black screen issue. Double check you have version 55566 or later as that version seems to have fixed the black screen problem for other users.", "aun427726Mar 31 at 8:03 PM\nIts a lie\n\nThis is just.another stupid first.person.shooter.It no voice acting.gun fire feel not right and not satisfy.everything is just normal.wait for review.This is a trap.\n\nHelpful | 10", "fuxiangyuApr 10 at 8:32 AM\nWorth the Scare\n\nVery stylish and polished game\n\nHelpful | 0", "abreurey5May 2 at 12:53 PM\nIs ok\n\nIs best because the quest doesnt have much games like this...is good because is a good story and gameplay...is ok because is worth playing but not worth the price...\n\nHelpful | 1", "marcetmarcetApr 13 at 11:05 AM\nLies beneath\n\nGreat game\n\nHelpful | 0", "luckylife299Apr 13 at 6:31 PM\nGood\n\nStill good\n\nHelpful | 0", "Hermes_triApr 3 at 5:24 PM\nThe best game on Quest\n\nThis is a masterpiece. Buy the game, you won't regret it.\n\nHelpful | 1", "BerryTheThiefMay 23 at 3:58 PM\nGreat so far\n\nIll update this later as Im only in about 6-10 hours (I lost track of time). Its great, creepy, and is a good survival horror game. Ive been playing with a friend for a lot of this and can say that as a newcomer to VR he had a blast. As for the story It seems interesting and Id like to explore further on my own time soon along with the updated review. The art style is awesome and has wondering if the devs will make another game with this art style or just a similar comic/graphic novel type style for another game, maybe one where you play the monster.\n\nHelpful | 0", "HmongaXyoojApr 3 at 3:30 PM\nGood game!\n\nGood game pretty creepy and cool art. However when recording current game play after sharing the game, it has no audio figured it was the game after trying out other games to share.\n\nHelpful | 0\nDeveloper ResponseApr 3 at 4:57 PM\n\nIt's unfortunately an issue in the Oculus OS that Oculus is working on fixing (and it does apparently affect some other titles using similar audio solutions). We don't have an ETA from Oculus on a fix yet, but it hopefully it's resolved as part of OS16.", "jthreadApr 7 at 1:21 PM\n\nOne of the best on the quest\n\nHelpful | 0", "iH8KTApr 3 at 2:25 AM\nLowkey one of the scariest games out\n\nDefinitely did their thing with this one\n\nHelpful | 1", "TACODADDYJul 1 at 3:55 PM\nAmazing\n\nGraphics are fun gameplay is immersive and i got scared so many times in the first 30 min\n\nHelpful | 0", "Noah20coolApr 8 at 12:49 PM\nY E S\n\nHedjdbfjcixjbd\n\nHelpful | 1", "maximum6001Apr 6 at 10:39 PM\nBest horror game\n\nI got scared by a bird\n\nHelpful | 1", "Butter-UPApr 14 at 7:42 PM\nSuch Fun\n\nThis game is a fun, spooky, and great time consumer. It can be boring at times but I do highly recommend this.\n\nHelpful | 1", "Meatman420Apr 3 at 3:05 PM\nGood so far\n\nAlmost done I think, but good so far\n\nHelpful | 1", "cygnyApr 7 at 11:34 PM\nGOOD!\n\nOooooooh~Good!\n\nHelpful | 1", "devinjosueApr 4 at 7:53 AM\nQuestion\n\nWhats the discord link?\n\nHelpful | 0\nDeveloper ResponseApr 4 at 7:06 PM\n\nhttps://discord.gg/YasABJN", "ICameForVaderMay 18 at 1:49 PM\nTerrifying and fun\n\nThis game has a driving story with very creepy imagery and good scares. This game is not fully reliant on jump scares and gore, now it does have a lot of gore but it achieves being creepy by having it almost always be foggy and having terrifying looking enemies. It also makes you feel hopeless even when you have a gun and an axe. Overall a great horror action game.\n\nHelpful | 0", "The.Goobster.Apr 5 at 8:57 PM\nGood game\n\nGood game. Was fun\n\nHelpful | 1", "TheKillerWhale707Apr 3 at 9:09 PM\nWow!\n\nJust play it already!\n\nHelpful | 1", "Will5757Jul 2 at 5:47 AM\nSpooky AMAZING !!!\n\nI just bought this game and I think its amazing and terrifying\n\nHelpful | 0", "Supadupa74Apr 3 at 11:09 AM\nPrice\n\nWorth every penny.\n\nHelpful | 1", "Techno3601ytMar 31 at 11:01 AM\nBest game on quest in a while\n\nIve only had a chance to play through the first 4 chapters but it is amazing, the art style, the environment, the sounds, and the controls are all  phenomenal. Definitely a must have for any quest user.\n\nHelpful | 19", "TimNikiasJul 4 at 7:21 AM\nMovement bug\n\nIt seems there is a small movement Bug. Sometimes after movement, I have a slight drift towards the left, even though I'm not even touching the Joystick. A small movement towards the right then gets me standing still again. But it's really causing me discomfort due to motion sickness. I don't have this problem in other games.\n\nThat aside, really like the artstyle and mood of this game, but have yet to play a little more for a more valid Review.\n\nHelpful | 0", "derek.brown.754Apr 2 at 2:16 AM\nLoving the game but....\n\nThe game is awesome. But is anyone else having the height adjustment in game make you way to tall?\n\nHelpful | 2\nDeveloper ResponseApr 2 at 4:58 PM\n\nWe've just released a small update which should hopefully resolve the height issue. Please let us know if you're still seeing the problem after updating, thanks!", "electromoonMay 13 at 9:05 PM\nSpook mode\n\nSo I played this game, and not even past the first chapter this game is terrifying. Like spook factor 9/10. I almost punched a wall and fell over a few times, but thats good cause its a horror game. 5/5 would recommend, but i wish there was a survival mode, so once you beat the game you could see how long you could last. Or so you could practice your aim\n\nHelpful | 0", "sam6664Mar 31 at 12:11 PM\nWorth the wait :)\n\nMy opinion? Better than robot recall :) perfect work on it! The one and only problem is the hard difficulty with 6 bullet you need to kill 10 monster... and the mele weapon disapear sometime\n\nHelpful | 17", "fernando.vazquezjrMar 31 at 6:15 PM\nLove the game amazing\n\nLove the graphics Love the story and love the mechanics of the game.. The only thing I find this should be different should be the running part.. I think you should have an option to change the way that you run.. it's kind of difficult double tapping it doesn't really work all the time.. I think if you press down on the joystick facing the direction you are going it should run and when you let up on it and just navigate normally without pressing it down it should walk.. That's the only thing I would change running is not easy on this game.. other than that amazing game great job\n\nHelpful | 6", "ROBYER1Mar 31 at 4:30 PM\nPolished Horror Action\n\nThe quest needs more games like this, truly great story focused design with some neat visual tricks created by it's graphic novel/comic book art style. I was already impressed by the imagination put into the introduction/tutorial section and at Chapter 5 already I'm constantly second guessing what will happen next.\n\nThe enemy designs are creative and allow for some very tense and fun encounters with slick combat mechanics. Anything that you can stab with feels visceral and reloading the pistol by whipping it left to right feels spot on.\n\nI highly recommend this even if you aren't a horror fan the gameplay itself puts many combat and exploration focused titles to shame!\n\nHelpful | 6", "InBed.247Jul 2 at 9:06 AM\nAmazing\n\nThis game is AMAZING!!\n\nHelpful | 0", "Rev0EmagApr 12 at 1:34 AM\nGreat! but having problems\n\nThe game is amazing. Im only having trouble streaming/recording audio for this game only. I can hear myself talk through the mic but no game audio. I dont know if its just me?\n\nHelpful | 1\nDeveloper ResponseApr 13 at 10:21 AM\n\nHi there! Sadly the bug you're talking about is a known issue at the operating system level. Oculus is aware of the bug and will be rolling out a fix into an OS update soon. Hopefully the fix will make OS16, but that is not yet for sure. Thanks for your patience, and enjoy Slumber, Alaska :)", "SANEWBERRYApr 1 at 12:49 PM\nwhat sort of sorcery is this?\n\nIve had my quest a fair while now and know what to expect graphically in games and am blown away so far with what has been achieved here. Its like Ive put on a VR headset for the first time again. Ive spent ages just looking at the trees and rocks and even the ground. Ive barely even gotten into the game yet having only just got to taking the gun and killing a few things. The sounds are also brilliant and really make the experience feel real. I never thought Id be standing purposely listening to flies. This game has set the bar now for all future quest games and its been set extremely high. Amazing job, very much looking forward to my next gaming session. Maybe I can make some progress instead of admiring the scenery!\n\nHelpful | 5", "jayisspillz94Mar 31 at 4:59 PM\nWow from the start option....\n\nFrom the start option I felt a tingle in my bones and a evil in the air. I played for like 15 mins tops and I've felt fear just walking through the first corridor. The music the sounds are from your favorite horror flick they pressed the horror button on this one.\nThe comic book style is the icing on the cake by far. great game and tool for staying home during this pandemic thanks devs. Worth every penny\n\nHelpful | 5", "ZedisnotdeadMar 31 at 12:54 PM\nAmazing Game\n\nThis is a beautiful game ....reminds me of silent Hill meets the walking dead in VR. The developers should be proud. I am only a portion of the way through and I can already say I am just blown away..the Polish and graphics are superb to be playing on something like the quest ....this may be a masterpiece\n\nHelpful | 5", "jetneverMar 31 at 3:22 PM\nListen to me u must have this right now\n\nAs like as two peas, this is a very exciting time. I predict the final price is exactly the same.\nTalk about the game. I love it. No matter from the atmosphere, music, scenes and so on, it's incomparable. My brother was too scared to play after playing for a while\nThe story flow is also very long. Don't worry. I originally set an hour. In order to prevent the game from not worth the price, I can refund it. But when my time comes, I don't realize it. God!! I will never refund this game. I like it. I hope to add Mandarin version in the next update, which will make many Chinese players fall in love with this game\n\nHelpful | 5", "ChildishBambinoMar 31 at 7:11 PM\nFantastic game\n\nThis game has a lot going for it. A great art style, amazing combat mechanics, and an impressive atmosphere. If youre worried about length, Ive already sunk 8 hours in and Im about halfway done. It seriously feels like a lot of time and effort was put into this.\n\nI generally cant play horror games because they freak me out too much. I put down Outlast in like 30 min. But this has a great balance of action and horror. If youre on the fence, just get it! This game is wild\n\nHelpful | 5", "Jorge_ClooneyMay 13 at 3:06 AM\nMust Buy!\n\nThis game is incredible! So immersive and beautiful graphics. Like youre right inside of a comic book. Keeps you on edge the whole time. Dont hesitate to get this game! Well done to the developers. Looking forward to whatever you do next.\n\nHelpful | 0", "PurplemikeyApr 1 at 5:38 AM\nBest game on quest as of today\n\n**overall**\nLies beneath is taking you into a beautifully crafted world looking like a comic book and so well done it is very believable.\nThe story is high quality, the visuals are perfect, the sounds and ambiance are adding a lot to the game. I can say without a doubt that this game is the reason why I love VR so much.\nI am clearing the game on hard difficulty as I love challenge. And a challenge it is! The game can be very hard and unforgiving. Which is exactly what I am looking for. A lenghty title with something to learn from and be a better VR gamer at the end of the day (or week I should say! This game can last anywhere between 6 and 10 hours for a single run through the story).\n\n**Graphics**\nGame is gorgeous, textures look hand painted with a huge attention to details, enemies are original, levels are gorgeous. I haven't seen any visual issue playing this game. The color palette makes the game even creepier.\n\n**Sound**\nMusic is very tense and well designed. The game audio is very great and some of the best ambiance I've got to experience in VR.\n\n**Gameplay**\nFaced some bugs. The two major being crouching seems to make the game think you're sitting so it put you back normal height and when you stand up you're a giant for a few seconds. And the other bug is that the game is way too sensible and often think you're going in an object and will make screen goes black and push you back. It can be quite frustrating but it is bugs that I expect to be fixed pretty quick. For a launch day, this is nothing! And it doesn't break the game at all. I am having the most fun I ever had and each time I play it I get out only when oculus is telling me I need to (low battery). Weapons are fun - both close and distant combat - and the game runs very smooth.\n\nBuy it. It worth every penny.\n\nHelpful | 4", "luka83Apr 16 at 7:56 AM\nSmooth gameplay and nice story\n\nOne of my favourite games on quest so far. I feard that the strip like graphics will be a problem, but it ends up great and smooth on rather weak oculus quest hardware. I wish they had speech instead of just boxes with text, but it falls nicely into the whole strip like atmosphere. So far I never felt the need to check out a walkthrough and this is a giant plus. And yes you will die. Highly recommended.\n\nHelpful | 2", "shadowchild789May 9 at 12:34 AM\nPrice\n\nCome on 22.99 for basically 5-8 hours of gameplay really\n\nHelpful | 0", "SamuraiSockMar 31 at 3:45 PM\nFantastic game!\n\nOne of the most polished vr games on the quest yet, very fun and creepy and the combat is easy to learn. Even with how limited the quest is on the graphical side this game still looks great because the art style really helps give it a unique look and feel. Highly recommend if you like horror and action games.\n\nHelpful | 4", "0neEyedSnakeApr 1 at 12:39 AM\nPolished and Tense\n\nI had been eagerly waiting for this game with high expectations after enjoying Robo Recall. This game didn't disappoint. It feels a lot like Resident Evil where you are guided through a carefully crafted story and have to be careful with your ammo which raises the tension, as opposed to games like Arizona Sunshine where ammo is very plentiful. The game looks very polished for the Quest and the mechanics work well. I am still early in the story and there have already been some slightly challenging moments (not playing on easy of course), though nothing overly frustrating. There is a slight issue where the screen blacks out for a second every 5 min or so (not too often) if you turn your head too fast without using the turn control, but I imagine that will get fixed very soon. Overall it is a very solid presentation with action, story, and jump scares. If anyone is wondering, it is very different from Arizona Sunshine or other zombie games. I would definitely recommend Lies Beneath for anyone interested in hacking monsters in the head with an axe or using your lighter as a red dot/aim assist for your revolver (what?!?).\n\nHelpful | 4", "EatGazellesApr 30 at 3:22 PM\nI feel like a comic book character\n\nI havent had the quest for a long time but I have already tried out many games. I have a hard time when a game doesnt bring the world to life due to limitations on the headsets performance. This game however is perfect. The comic book textures are rendered beautifully and Im fully immersed in the comic book story. The game keeps me on edge,but Im scared and yet oddly empowered to fight back. I have a curiosity to keep going, like all the main characters in horror flicks when you keep yelling at them to turn back. This has easily become my favorite title so far.\n\nHelpful | 0", "NoSKApr 11 at 4:00 PM\nCould you make text larger?\n\nThe smaller font pages are difficult. Good work!\n\nHelpful | 0", "keith.binaMar 31 at 10:53 AM\nUnique Art Style with Great Gameplay!\n\nJust started the game, and it immediately sucked me in with its unique art style and great gameplay. Cant wait to play more tonight when the lights go down! This is a must own for Quest!\n\nHelpful | 11", "chriskortonApr 18 at 8:01 PM\nI dont get what the fuss is about this\n\nBoring with occasional jump scares. Waste of money\n\nHelpful | 3", "COOPERDUDESApr 4 at 7:30 AM\nPlease buy it\n\nLies Beneath is a single player, comic book styled game with interesting and good graphics, and gameplay that will keep you hooked.\n\nTHIS REVIEW MAY CONTAIN SLIGHT SPOILERS\n\n\n\nGAMEPLAY\n\nLies Beneath is a combat based game, with a touch of spookiness. I want to start by saying this is certainly not a horror game, but does have creepy vibes. So you begin with an awesome looking tutorial, and instantly after you get straight into the action.\n\nYou are in some town in alaska where the protagonist grew up, and stuff gets weird quickly. You find yourself in a dark cave, using your trusty lighter to try find your dad. And then stuff goes from 0 to 100 real quick. And then goes back down again.\n\nThe spoopy stuff is good - it can be intense, but in short moments. I also want to point out, I am not talking about jumpscares, just sudden build ups of atmosphere. After a while you find your first weapon, but are always reminded that you won't just be able to storm through the game with what you've got - you'll need to be on your toes. It becomss clear that their is something stronger than the average run of the mill zombie. Something has been stalking you, since the very beginning.\n\nBut you feel prepared. When the moment comes, you feel like a god compared to how you ran away from this 'thing' at the start of the game. After probably some tries, you find their weaknesses and exploit them - this beast has been defeated! However, things take a dark turn - your still not safe in this place. Its not over yet.\n\nCOMBAT AND MECHANICS\n\nIn the tutorial, you learn that your lighter has a variety of uses. You can not only burn evil dolls, but it is used to activate checkpoints as well as telling you where to go.\n\nYou can see much damage you've taken from blood on your hands, and as you eat food, this blood goes away in a extremely satisfying effect.\n\nYou have a range of melee and long range weapons, which have their own advantages and disadvantages. The way you can combo attacks together is brilliant - throw your axe into a zombies head, shoot them with a revolver and proceed to pull your axe out of them and bash them on the head with it. It is rewarding for trying creative things - you often have very little ammo so using a gas tank and a bullet to kill enemies instead of using 6 on one saves you resources and time.\n\nAll melee weapons can be thrown, and actually stick into enemies, like boneworks or walking dead:saints and sinners which makes it feel much more realistic.\n\nYou start with two weapon/food slots and a lighter, then later on gain an extra two weapon slots on your back.\n\nGRAPHICS\n\nThis game is beautiful, and really shows what the quest can do. Enemies have interesting designs and the environments/locations fit the theme of the game perfectly, other than one or two bad textured walls. I'm surprised it runs as well as it does!\n\nVERDICT (No, I'm not from IGN.)\n\nThis is certainly my favourite game on quest, has a decently long story (6-7 hrs) as well as a range of difficulty modes, and even multiple endings! It does what it does brilliantly, and has interesting, different style of graphics that I haven't seen on quest before. The combat is fun and rewarding for pulling off creative combos. Therefore, I would give this game a 9.6, and certainly my favourite quest game atm.\n\nHelpful | 3", "Gravzer333Apr 26 at 4:51 AM\nI was sceptical but this is incredible!\n\nSo with VR games Im always hesitant to buy anything because most feel like mini games. Stand here and shoot enemies or interact with physics stuff, and ill be honest, Im bored of those games.\n\nSo then lies beneath showed up and it claimed to be a horror shooter, my first thought was i bet its an on rails shooter....like always\n\nBOY WAS I WRONG!!\n\nThis game has\nA COMIC BOOK INTRO\nA STORY\nA HUGE EVER EXPANDING ENVIRONMENT(though linear in fashion)\nACTUAL AAA GAMEPLAY\n\nTHIS THING IS AN ACTUAL GAME GAME BUT IN VR\n\nThese, (to me at least) are rare, you just interact with things as you would in reality but the music is there, the graphics are there and it feels like a top tier video game.\n\nYOU HAVE TO PLAY THIS, so go go hit that buy button and experience a REAL VR game for a change\n\nHelpful | 1", "MakoDrakoApr 1 at 5:24 AM\nLet me guide you to the buy button\n\nFirstly, I have to say Im only 5 of 20 chapters in atm. However, based on my experience so far, I feel I can say this... If youre looking for a fun, well designed, and polished and seemingly lengthy experience with interesting plot to keep you going. Yeah, you found it. The mechanics feel good, the atmosphere is intense/gripping and DONT even get me STARTED on the art style! This game is so easy to get immersed in. It feels like the developers really took advantage of what VR can do as a story telling medium. Fair warning tho\nYou will jump and maybe even scream... I know I did haha. Definitely a stand out title on the quest!\n\nHelpful | 3", "MrGaMeFAcEMar 31 at 8:56 PM\nNow this is an Oculus Quest real title!\n\nAs the first five minutes of gameplay. All I will say is....they are gonna purchase this game. I look forward to the devs work. The controls corralates very well with the weapons. Tossing the melee weapons from hand to hand and throwing at enemies felt real nice. The quality overall is very well executed. A needle in a hay stack great production ever found on Quest.\n\nHelpful | 3", "withercoolJun 17 at 9:48 PM\nEpic\n\nActually kinda spooky and fun\n\nHelpful | 0", "Bdog2121Jun 13 at 4:28 AM\nWow\n\n\n\n\n\nNothin bad to say..\n\nHelpful | 0", "mark.testaseccaJun 5 at 4:41 PM\nLies beneath you scary\n\nReally impressive graphics to run on the quest. Fun game cool comic book tone !\n\nHelpful | 0", "Jani1988Mar 31 at 12:46 PM\nRecommendes\n\nI have played for 1.5 hous. I like the game but I miss some changes in scenery (maybe the trailer made too high expertations here?). Maybe it will come :) I like the art of the game. It's exiting and not to scary. It fit well in my various library of games\n\nHelpful | 4", "joehenry11Apr 5 at 6:23 AM\nWow! Just awesome\n\nI gotta say im 1 hour in and this game is the bomb! The comic vibe is perfect and doesnt take away from the horror ive already been scared a few times. One time i let go of my gun and it floated away couldnt figure out how to get it back had to restart from last saved. I love hacking up monsters with the axe. Get some!!!\n\nHelpful | 2", "the_voyagerApr 20 at 10:16 PM\nOculus Quests baby\n\nIf you couldn't already tell this game is absolutely PERFECT for the quest leading you through winding paths as you are afraid to aim around every corner. This game is perfect in every sense of the word the horror is fantastic they get the ambiance amazingly set right from the get go the comic book styling IS SO WELL DONE I was a little worried about that but these designers are f*cking geniuses. I was instantly attached to the main character and I could no joke feel what she was feeling. VR is horrors future in that aspect. Please make more I am absolutely in love with this game.\n\nHelpful | 0", "vegas.markApr 21 at 8:18 PM\nNo Game Audio during Commentary\n\nGame Audio doesn't play when I go live. Fix it!\n\nHelpful | 0", "adam.stanley.25303Apr 18 at 11:12 PM\nAll I have to say is wow\n\nArt style is awesome, game play is top notch, and it definitely has its wtf moments, reminds me of telltales walking dead meets silent hill. Controls are smooth, weapons are easy to use and enemies are challenging but not impossible. Will definitely keep you on your toes at every step and sound and not gonna say much more except try this out you will not regret it\n\nHelpful | 0", "tipatatMar 31 at 6:33 PM\nA must buy in Quest\n\nA lot of scary fun, with impressive stylish visuals that really immerse you in the comic book world. One of the few narrative driven games on the Quest showing off some great game play fluidly mixing gun and melee combat to make a satisfyingly deep vr gaming experience.\n\nHelpful | 3", "taylortekApr 2 at 11:59 PM\nBy far the best vr game I've ever played\n\nI have never played a vr game (on any headset) that feels so immersive and fun (it's still terrifying) it feels like the saints and sinners of oculus, but having played saints and sinners I still like this game more! Definitely buy it, because not only is this the best vr game I've ever played, its cheaper than all of its competitors. (By the way Drifter if you see this can you please tell me whether or not your planning on making any DLCs?)\n\nHelpful | 2", "cenoquestApr 17 at 3:58 PM\nThis is the real deal\n\nThis isnt a tired old port from 2016. Not another silly haunted house demo full of jump scares. This is the real deal. Its a high concept horror game, incredibly well executed, with hours of gameplay, solid writing, intricate level design and gorgeous art direction.\n\nIts more of a shooter than a puzzle game. If this turns you off, like it does me, set the the difficult to easy and just enjoy the ride!\n\nJust one last thing, big shout out to the developers for following quest conventions and best practices for controls and locomotion. I cant tell you how wonderful it is to have my expectations met every single I use my intuition to perform an action like run, or eject a cartridge. Seriously, its amazing. The only thing they dont do exactly right is teleport, but I think its in support of their combat mechanic so it gets a pass from me. Everything else is _exactly_ as it should be.\n\nHelpful | 0", "kevink808May 25 at 9:55 PM\nI need Dude Wipes for this.\n\nHave mercy on me, Im only on Chapter 3! This should come with a warning for people with heart conditions.\n\nHelpful | 0", "StrangeghostApr 22 at 12:50 PM\nMy new favorite quest game\n\nIf you like games like Resident Evil 4, Silent Hill, and Evil Within this is the game youve been waiting for. Highly recommended! Shooting monsters, using melee weapons, and managing items all feel great.\nPerfect amount of scary without being too terrifying.\n\nHelpful | 1", "DeatheaterplayzApr 1 at 5:40 PM\nOne of the best\n\nThe games on quest that feel like an actual triple A game are few in number but this game reaches that spot haveing an incredible art style and story with combat, physics, and great 3d models. this game also reminds me alot of the old resident evil games so if you like those well here you go.\n\nHelpful | 2", "hi_i_am_sinJun 7 at 10:34 PM\nYeps\n\nGreat that's it that's the game\n\nHelpful | 0", "BossbeastMar 31 at 2:50 PM\nQuests Resident evil\n\nits like a cross between resident evils 4&7 and here they lie on PSVR with some genuinely tense and scary moments and a story that kept me intrigued. Well worth playing.\n\nHelpful | 6", "John-De-RienzoApr 13 at 8:38 AM\nAmazing\n\nHave played for about 2 hours and this is absolutely amazing. Everything is spot on, and lets not forget the audio score, it is soooooo impressive.  I literally jumped out of my skin when chased by that strange creature on chapter 2. Not much further on and a long way to go yet, but the devs should be extremely proud of what they have achieved on the quest. Please add more in the future in the form of dlc add ons, more than happy to pay... Best game on quest. \n\nHelpful | 0", "Defualtyboi6000Apr 1 at 12:30 PM\nWow just wow!\n\nIve been waiting for this game since the start of March and its amazing. I am 12 years old and I love survival horror and this really makes me feel like I am playing a resident evil game within vr! Thank you drifter entertainment for this masterpiece!\n\nHelpful | 3", "andyfruchApr 9 at 2:58 AM\nLovecraftian Action Horror Pure Goodness\n\nThis game somehow snuck under my radar until a out a week before it's release. Now that it's out, I can't get over how amazing it is. The cell shaded comic book graphics look fantastic, the tone and setting draw you in and unsettle you at the same time.\nThere is a lot of presence in the game. I get so drawn in I often forget I am in quarantine. The minimalist HUD really adds to it with little features like the health being nothing but blood on your gloves.\nThe weapons and gameplay are more than satisfying and the sound effects and background music are ominous and creepy.\nI have a little over four hours of play time in and am at chapter 8 of 20, so this is definitely a full game.\nThis is a hands down must buy.\n\nHelpful | 1", "Pavlov625May 17 at 11:20 AM\nSuper fun\n\nIts really fun especially for a horror game just because its scary doesnt mean its not worth it\n\nHelpful | 0", "UlchioraApr 8 at 2:08 PM\nBest horror game I've played in awhile.\n\nDelivers a fantastic horror experience and has just enough gross out or creep out moments to make your skin crawl. Doesnt take too much effort to get into and plays like a dream. Only shortcoming is the text sometimes disappears too quickly especially with lore based items but that's easily overlooked compared to the rest of the game.\n\nHelpful | 0", "tony.ermakovApr 7 at 12:22 PM\nVery cool game.\n\nIn my opinion this game is super awesome, I beated it ones on normal difficulty and it was kinda challenging. Game has huge vibe of resident evil 4 with monsters like in the silent hill and with borderlands graphics. Must have. Awesome story. Playing it on easy now. I want to enjoy brutality of weapons without experiencing ammo crisis. The revolver in the game is to satisfying to use, shotgun is devastating.\n\nHelpful | 0", "mackersNglueApr 7 at 1:44 PM\nFinally a quest game I can get behind\n\nI picked up a quest at Xmas and beyond 1or 2 games I kinda regretted my purchase well until now! Not too far into it at the moment but it's amazing, my 2 favourite franchises are Resident evil and Silent hill and my god does this game give me serious SH vibes\n\nThe devs have done something special here and goes to show the power of this machine and other devs should take note\n\nCan't wait to get stuck into more\n\nHelpful | 1", "ChristianLissaApr 4 at 2:14 PM\npiece of s...\n\ngame is not able to calibrate neither in a sitting or standing position i want my money back\n\nHelpful | 2\nDeveloper ResponseApr 4 at 3:45 PM\n\nApologies you're running into issues - height should auto-calibrate as soon as you start moving in the game. Can you please share some more information about the issue you're seeing, how you have the guardian configured and any other possibly related information so that we can investigate further?", "exjraordinaryApr 5 at 12:39 PM\nStunning quest title\n\nUnlike most games on quest this game feels tailor made and optimized for the quest. the graphics are like borderlands meets resident evil. it seems the designers like resident evil and silent hill as this game reminds me of both. The sound effect are great and really get you jumping with monsters climbing trees or a nemesis type enemy following you. Seems about 10 hours from what I see and pretty big for a quest title. A must buy in my book\n\nHelpful | 0", "aaron.crouse.39Apr 5 at 9:53 AM\nMechanics are realistic\n\nKinda reminds me of Arizona sunshine but with a scary twist. When you are playing you actually get sucked into the game and feel like its real life even though it is cartoonish. There are moments that make you scream. Definitely a favorite on my oculus. I like when I have company over and stream it to the tv for the family to see.\n\nHelpful | 1", "Lawolf-QuestApr 4 at 12:05 PM\nBest vr Game Ive played but...(Pls read)\n\nFor me this was a flawless game, the art style, the physics, and the horror. But Im a YouTuber and I really wanted to do a video on this game but oculus has 2 flaws with that, 1 you cant record straight to YouTube, I recently had the psvr and I did videos on there and with no problems but I switched to the quest for the better games and accessibility, but I cant even record to YouTube, and adding onto that I dont even own a PC, Number 2 THE AUDIO, If youre recording on the oculus quest, microphone audio does not show up but you can hear everything else. That is a big drawback because doing reactions to video games on the quest is a really big part of being a YouTuber. I know the developers cant really do anything from this game but it would mean a lot to me if you would messaged oculus about this because this is kind of heartbreaking. Thank you for reading this and have a great day!\n\nHelpful | 0", "jimmy.bryant1Apr 12 at 7:24 AM\nWhat lies beneath\n\nI fell and maybe broke my back playing this\n\nHelpful | 10", "endlesskiller432Apr 3 at 2:30 PM\nAmazing amazing amazing\n\nThis game is something special it truly truly is devs you guys did an amazing job and yes your work is appreciated very very much this game is like resident evil the walking dead and call of duty zombies (if you buy the game youll know why) along with almost every horror movie splashed in from the music to the monsters to the sense of immersion that comes with it I bought a quest to get lost in the worlds it had to offer and congratulations you guys have finally given me what I set out for if your thinking about buying this game buy it its worth every single penny without a doubt :side note devs I have an idea about a survival game mode just re use the cabin chapter add some new features to it of course and and boom (or you could use a giant house or something and just give the players timers to see how long they last with limited ammo and weapons scattered through the map (but thats just me talking) this game is amazing and even without anything else it rocks If your looking to get lost in a vr world and become completely immersed then this game will finally do that 10/10 five stars out of five bravo this game is going into my top 5 right next to console games\n\nHelpful | 1", "Microwavable_bananaApr 3 at 7:11 PM\nHow is it this good?\n\nIts exactly like the trailer. Horrifying, action packed, and filled with a great story. The fact that you are the one who is hiding, scared, and underpowered to some characters yet also powerful, and dangerous to other characters at the same time really makes you feel like your in the middle ground. Yet its still full of scares.\n\nHelpful | 1", "WelchFruitSnacksApr 3 at 8:04 PM\nBut It Great Game\n\nIm just going to ask you why the heck are you reading the ratings just buy the game it is totally worth the $30 and you just never get bored of it! But I will tell you your going to pee your pants a couple times because this game scary af! Anyway you can tell they put a lot of effort into making this game! Im not even going to tell you anymore because I want you to be surprised at how amazing this game is!\n\nHelpful | 1", "Trig9Apr 2 at 8:04 PM\nMakes everything else look like crap.\n\nOnce you play this you'll realize the potential of the format. I had no idea this was even possible. What a wonderful surprise. Makes everything else look like child's play. Well done. Rejuvenates my excitement for vr gameplay.\n\nHelpful | 2", "Olibrrr2005Apr 2 at 11:06 PM\nSpoooooky!\n\nI almost never get scared in any kind of game, but I have to admit my heart skipped a few beats on those jump scares. There are also lots of REALLY tense moments where you're being chased or when several creatures are running at you at once. The graphics are beautiful and make you feel like you've stepped into a comic book! Gameplay is awesome and hitting things with your axe is especially cool as it gets stuck in wood and enemies, and the haptics when pulling it out give it a cool feeling of weight I haven't seen in any other games.\n\nThe one small problem I've noticed is that the scenery gets a little boring in the first couple chapters, but they make up for that with awesome gameplay and lots of tension! Otherwise, the game is beautiful and polished and definitely worth checking out!\n\nBefore buying, I got hung up on the length of the game vs the price, but I can tell you now that the length and quality of the game is 100% worth the price! If you're on the fence... I was too, but I have no regrets at all!\n\nHelpful | 1", "davididillApr 2 at 7:40 AM\nAdrenaline Pumping VR Masterpiece\n\nI dont normally write reviews but I had to when it came to this game.\nIm currently on chapter 4 and Im already blown away.\nI usually research each game I buy and read all the reviews but when it came to this game, I bought it DAY ONE and have ZERO plans on returning, its that good.\nIf you are on the fence, just get it.\nYou are getting hours of a heart racing action story with tons of combat and high pressure situations.\nTheres tons of settings for both vr newcomers and veterans alike.\n\nHelpful | 0", "ObakerApr 2 at 7:21 AM\nAmazing buy\n\nI dont get scared by much but some of the scares in this game are out of this world. The feeling of a monster coming for you and then you chopping the monsters head clean off is exhilarating. The game flows like a dream and the graphic style is amazing. 10/10 would recommend! Anyone who rates this under 4 stars is a brain dead schmuck.\n\nHelpful | 1", "liamlochApr 1 at 6:10 PM\nWhoa.\n\nJust 45 minutes and 3 chapters in i feel so submerged into the gameplay and the amazing graphics. Not often do I forget im in VR, even with top titles that I play like pavlov and drop dead. As a quester from day one, i can confidently say this is the best game available on the quest store, for beginners and experts alike.\n\nHelpful | 1", "HellmoeApr 1 at 9:48 AM\nLacks replay value and still worth 5 *\n\nFairly long game for 35$ but once you go through it it's pretty done. I have been waiting for this game for a while, was not disappointed but the quest really lacks games in general so any type of replay value mode would be so great. Still the best game on the quest BY FAR. Cell shading is amazing for the device. The interactivity with the world is also limited.\n\nHelpful | 1", "JcPeacemakerMar 31 at 3:00 PM\nA must have horror title\n\nJust been playing and wow this is awesome. Clever use of art style that the quest can handle. Super exciting gameplay. Cool store and the comic book flow of it is just perfect. 5star\n\nHelpful | 3", "BrendanRoyMay 10 at 9:12 AM\nAwesome game!\n\nYou can tell they actually put work into this game I love it! Good graphics great gameplay very cool.\n\nHelpful | 0", "ThunderGunExpressMar 31 at 5:15 PM\nTerrific\n\nWaited on this one for a while and it is worth every minute. Fun to play, scary, and interesting story (so far). Also loving the comic book aesthetic. Five stars unless something makes me hate it later in the story.\n\nHelpful | 2", "Lyndenthebeast99Mar 31 at 1:25 PM\nAwesome\n\nI was really excited when I first saw the trailer and it was even better than I expected. I am only on 7 out of 20 and I already love it.\n\nHelpful | 4", "Aro3891Apr 1 at 2:10 AM\nAmazing Horror game on Quest\n\nAmazing Horror game, in creepy enviroment with great mechanics, this game is well polished. Graphics are great in this game. Such graphics suits Quest very well, i cant imagine how great it also would be to have call of duty game with such graphics, it would work very well i think.\n\nHelpful | 1", "Trashman_XLApr 24 at 1:18 AM\nFirst game in VR, bar set very high\n\nSolid game my dudes, honestly, got all the horror staples wrapped up in a sweet comic book bow and a great story tag. It has me panicking, blasting, slashing, running, and the jump scares I've seen (first book done, but I expect the rest will be just as impressive) are rare and far enough apart to have an effective scare on me everytime. I love horror and always wanted to see it in VR, am not disappointed.\n\nSo why 4/5?\n\nThe only reason I didn't give it 5 stars is the fact that streaming to Facebook, or taking video, the game audio won't get picked up, which SUCKS because the game audio is absolutely fantastic. I looked around online and it seems the same problem is happening for everyone, mic works, I can hear the game, but streaming or recording seems not to work. I don't think it was the dev's fault, but that was a huge disappointment for an overall awesome game. Please keep pressuring Oculus to get that fixed!\n\nHelpful | 0", "emmigeebeeMar 31 at 6:51 PM\nScared the hell out of me!\n\nThree chapters in and this game has me hooked, I've never played a horror game quite like this. There are several jump scares so not for the light of heart \nMy new favorite game on the OC, hands down...\n\nHelpful | 2", "EddpumpkinMar 31 at 2:13 PM\nGood spooks good action\n\nThis is my 1st VR horror game I would say this is a must play if you like horror or spooks it feels smooth and looks really nice\n\nHelpful | 4", "DUKERULES007Mar 31 at 3:14 PM\nMasterpiece\n\nWow! An amazing game! The perfect mix of horror and suspense! This game is a must have in your collection. Cant wait to show to friends once Covid is Kaput\n\nHelpful | 3", "ArsoulApr 4 at 11:13 PM\n10/10 Game Design\n\nIn terms of all aspects of game design this is seriously a master piece. The art style, the direction, the gameplay mechanics, the music and the story are all fantastic and work so well to draw you in. If HL:A is PCVR's killer app, this is it for the Quest.\n\nHelpful | 1", "slapfuMar 31 at 11:52 PM\nThis is what quest games can be!\n\nHaving just beat HL:A, I been playing everything in my VR list... Everything has been played to death or boring after that game until I played Lies Beneath!\n\nHelpful | 3", "DJandyrMar 31 at 4:30 PM\nAmazing\n\nAbsolute must buy for the quest. Amazing game and my favourite so far since having my Oculus quest\n\nHelpful | 5", "ScooberCoaster525Apr 3 at 1:57 PM\nI LOVE THIS GAME\n\nThis game is simply amazing. The art is so good the game is so smooth and simply scary. I was blown away by this game it brought a whole new world to the quest so good\n\nHelpful | 2", "Cream_SicleApr 26 at 4:12 PM\nAmazing game\n\nGreat graphics with the quest, great gameplay, but one small thing. When you pause the game sometimes you cant see the menu and it fades in and out when you move your head. Idk if its because Im not center with my boundary or a bug. But great otherwise!\n\nHelpful | 0", "andersonkodiApr 18 at 2:07 PM\nA must have!\n\nBeen quite disappointed with Quest games since I've been playing with VR Headsets for a good 7 years and they all look the same to me, but this game is easily one of the best in this platform. It's tense, it's scary but not that off putting scary, immersive and engaging. Sometimes the scenarios look alike and a bit repetitive but overall, it's pretty good. Money well spent.\n\nHelpful | 1", "VilrosApr 4 at 4:07 PM\nConsole Seller\n\nThis game is a must, I was skeptical at first because Im not a horror fan but its really a thriller shooter. Only one jump-scare so far. Its an absolute hit, and should provide hours of game play. Also easy isnt super easy. Have fun!\n\nHelpful | 0", "LordVOLCANOMar 31 at 4:14 PM\nNearly Perfect\n\nIts very good story game but I have some problems,Sometimes i cant use my right hand to hold something from the floor and sometimes i have black screen on a just second.\n\nHelpful | 7\nDeveloper ResponseApr 2 at 4:57 PM\n\nWe've released an update that should greatly reduce the black screen issues, please let us know if you're still encountering issues after updating - thanks!", "hubjaMar 31 at 12:35 PM\nWow!! Just wow!!\n\nAmazing use of mechanics and comic book style! It reminds me of anime horror. Great job to the developers! Im only at chapter 6.\n\nHelpful | 3", "markypyApr 2 at 10:05 AM\nAmazingly Scary\n\nI really enjoy this game. The graphics, storytelling, and gameplay are top notch. But it is seriously a horror game and I honestly didnt expect to feel so immersed in it. Great and definitely worth a purchase, but also pretty dang scary.\n\nHelpful | 1", "MORGOTikMar 31 at 3:24 PM\nGreat game!\n\nGreat game. Only thing I dislike is is blackouts when you clip something, gets a bit annoying when you try to reach for something.\n\nHelpful | 3", "pieduke8May 3 at 2:09 PM\nBest game for Quest at the moment\n\nIts a captivating and well executed experience. Its totally worth the money\n\nHelpful | 0", "Azazel08Apr 2 at 12:24 AM\nThe Horror game the Quest deserves.\n\nThis is a fantastic and crazy horror game that gives you real agency in the game. The graphics, weapons, action, story and scare moments are used in perfect tandem to create a masterpiece. I hope this sells very well and spawns a sequel.\n\nHelpful | 0", "kevin.streisantMay 6 at 8:29 PM\nSoooo goood\n\nThis game is too freaky! Comic book theme is amazing. 5 stars\n\nHelpful | 0", "Mr_TrinidadMar 31 at 6:42 PM\nMy favourite Oculus Quest game!!!\n\nThis caught me off guard.\n\nNo spoilers buy the game people !!\n\nHelpful | 5", "sparkfly123Mar 31 at 6:52 PM\nAbsolutely a must buy\n\nAll Im gonna say is melee and throwing is perfected along with guns and Im hoping that it doesnt stay quiet\n\nHelpful | 3", "tnmklmApr 6 at 12:07 PM\nAmazing!\n\nI just started playing this game recently and it is absolutely one of the best Ive played in awhile. This game can be so horrifying and suspenseful. I love this game and 100% recommend this to anyone.\n\nHelpful | 1", "Aaronb3434Apr 1 at 2:09 AM\nAwesome\n\nVery fun and scary game the graphics are great and gameplay as well. this is a lovely gem to add to your oculus quest library. i highly recommend this one.\n\nHelpful | 2", "SOLRipperApr 1 at 12:47 PM\nAwesome\n\nThis is the type of game I have been waiting for! It was kind of hard at first, but once I found the axe, I have been having a great time\n\nHelpful | 2", "Mixer1207Apr 10 at 9:06 PM\nSo Far So Good\n\nHard to rate it five stars when I am only in Chapter three but it is an awesome game that I hope will keep getting better. The Scares are just good enough to keep you on your toes but not so bad that a person that wasn't into scares and horror wouldn't be able to handle it. The shooting is pretty good but after playing Gun Club shooting is never quite as good in any game is it. The melee weapon(s?) are fun but don't always hit the first time and I don't feel like I am getting the full impact n every swing of the ax. This game is well worth the full price admission and I could see me going through it again on a harder level once I am done. It is creepy enough to keep all horror fans interested. I can't wait to see what lies ahead, er I mean beneath\n\nHelpful | 0", "i_am._.braydenApr 21 at 5:59 PM\nI hate the pig monsters\n\nThis game is honestly really scary, and also really good! But if you get scared easily, would recommend not getting.\n\nHelpful | 0", "ChlasmaMar 31 at 3:01 PM\nLove it!!!!\n\n...and i just finished alyx yesterday ;)\nAnything mire to say? Well, if you like the screens and the footage, just go for it, you wont regret ita\n\nHelpful | 2", "AppleHead101Apr 12 at 6:43 PM\nMagnificent\n\nThis game is of pure perfection, its gripping, fun, exiting, ect. I could(and have) played this for hours on end, this deserved infinitely more than 5 stars!\n\nHelpful | 0", "karlapseyMar 31 at 4:50 PM\n\nReally cool game,best I've played in quest so far,hope this will set the trend for games to come!\n\nHelpful | 3", "legion.lamereMar 31 at 5:37 PM\nVeary cool\n\nThis game has a real cosmic horror chathulu vibe, the first game ive found like this in vr. One of the most coolest expiriences on the quest!\n\nHelpful | 2", "bbbrrromezMar 31 at 2:15 PM\nWow scary!\n\nJust smashed my picture in my real house! Scary action- love it!\n\nHelpful | 4", "Timmccauley84Mar 31 at 12:36 PM\nReally enjoying this game\n\nIm only 2 hours in to this game but I am really enjoying it. Good graphics and some scares.\n\nHelpful | 3", "Mrsalt4503Apr 8 at 11:14 AM\nGreat\n\nThis game is terrifying and awesome. The combat is really good and the atmosphere is so creepy and perfect. This game is definitely worth the $30 but be ready to get scared\n\nHelpful | 0", "roy.azoulayApr 12 at 9:51 AM\nWow\n\nThis game really draws you in. Visuals, artistic flair and attention to detail are all super impressive. Only a few chapters in, but highly recommend.\n\nHelpful | 0", "eric.sullivan.587268Apr 6 at 8:34 PM\nIt's fun\n\nIt's fun but when you go live there's a nasty sound that mutes all the game sound or when you cast it does the same thing other than that theses guys get how to make a awesome game\n\nHelpful | 0", "axelcoleApr 2 at 10:16 AM\nSo great\n\nPretty much what Ive been waiting for as far as new experiences go. I dont write reviews but felt compelled to do so on this one. Easily worth the money. Thanks for making something great!\n\nHelpful | 1", "VRfinaticApr 21 at 5:23 AM\nTotally recommend!!\n\nThis was the best VR game I have ever played!\nI have played like 4-5 hours and I am at chapter 10!\n\nHelpful | 0", "mikeclarkmusicApr 1 at 6:40 PM\nBest game so far!!!!\n\nAbsolutely amazing! I have almost every game you can buy for Quest. This is what I have been longing for. It has everything you want a VR game to be. Graphics, story, intuitive etc. incredible!!!\n\nHelpful | 1", "SiphonCloud1Apr 17 at 5:09 AM\nWow...just...wow\n\nThis game is more than worth the price. Best horror game on the Quest. Great gameplay, story and... scares .\n\nHelpful | 0", "Jackson217Mar 31 at 4:16 PM\nGreat\n\nJust fantastic\n\n\nI especially love the comic style look and feel\n:)\n\nHelpful | 3", "ioloswagginsApr 3 at 7:43 AM\nIncredible game bar a few bugs\n\nReally good action horror game, can be really challenging and will get your heart racing. A must have.\n\nAt the time of writing there's still a few bugs though (even after updating). The bug where you're super tall when you come out of pause is still there sometimes. And I've encountered issues with shooting enemies that are super close to me. My gun like goes through their head and comes out the other-side. Other times the physics from them sometimes pushes my gun up into my body and I can't get a clear shot. Maybe that's on purpose come to think of it.\n\nThe game has only been out a few days so these sorts of things are to be expected, and the devs are actively updating (they've been posting change logs on the Oculus subreddit. Although I've still experienced bugs they claim to have fixed. So either the latest update hasn't reached me yet or they didn't fix them fully.\n\nBugs aside, honestly blown away by this game so far (Im about 1/4 through). They've gotten a lot of power out of the Quest and they've created a world that, whilst nothing new in the horror genre, is done well. The controls are solid in most circumstances but get a little bit frustrating under pressure. Or maybe the human in this experience is the issue...\n\nThis is a developer to watch.\n\nHelpful | 1\nDeveloper ResponseApr 3 at 10:47 AM\n\nGreetings ioloswaggins! Thanks for playing Lies Beneath :) If you're still experiencing height correction issues we would love to pick your brain a bit about what is happening so we can get it fixed. If you have time, jump onto discord https://discord.gg/YasABJN and ping one of us. We would greatly appreciate it! Thanks for playing!", "beamer2131Apr 4 at 3:26 PM\nAlready amazing\n\nI've barely gotten far into this game and it's already amazing. I love this. I hate scary stuff and horror but this game just does everything Right. It's super good.\n\nHelpful | 0", "mrguziorApr 4 at 7:56 PM\nDAAAAMMMNNN\n\nThis is a FANTASTIC game and absolutely terrifying! The looks make it seem like a comic book ( which was a cool idea) and the enemies are pretty cool too! 10/10\n\nHelpful | 0", "ToastyToesApr 9 at 9:12 PM\nAmazing\n\nGreat immersion, I played the first 5 chapters that felt like minutes but in reality it was 2 hours. Must play game. 100% recommend.\n\nHelpful | 0", "matsterApr 7 at 12:36 PM\nGreat game\n\nI'm having an absolute blast with this game very immersive unique experience definitely worth the money as it has a great storyline to it\n\nHelpful | 0", "DanieltheDanApr 17 at 5:20 PM\nJust awsome\n\nI hate horror and this scares the heck out of me..I would recommend this game..\n\nHelpful | 0", "AustinGodKingApr 3 at 10:27 AM\nPretty sick\n\nNot real far into it but hooked already. Visual masterpiece if anything!\n\nHelpful | 2", "SeymoreHineyApr 25 at 9:22 PM\nAwesome but...\n\nId love to play but Im wanting to stream the game as I play to Facebook. For some reason tho ur game wont let the game audio into my stream, just my mic audio. I tested it and its only your game this is happening on. Please fix so I can start playing and stream through it.\n\nHelpful | 0", "xrflyerMar 31 at 8:22 PM\n\nHOLY F.\n\nHelpful | 4", "IGoByManyNamesApr 17 at 7:20 AM\nThis game scary\n\nI was screaming the first five minutes and I dont get scared easily\n\nHelpful | 0", "AlpynApr 30 at 12:41 PM\n\nFun\n\nHelpful | 0", "buzzin247Apr 2 at 8:46 PM\nGreat\n\nSo far havent completed it but great game just perfect for quest\n\nHelpful | 2", "slickwilly1021Apr 2 at 6:48 AM\nSolid !\n\nPeople need to chill out with the Half Life comparisons . I mean this is a very good Quest game but it's nothing revolutionary . You follow a linear path battle some monsters , continue walking battle some more monsters etc. Not saying it's not good it is\n\nHelpful | 1", "aidien.hann.96Mar 31 at 12:23 PM\nTHIS GAME IS SOOOOO FUN\n\nThat's all I have to say, it's really fun and you should get it\n\nHelpful | 2", "flexwoodsMar 31 at 6:54 PM\n\nGreat VR game!\n\nHelpful | 3", "Tomtom1101Apr 2 at 10:12 PM\n\n\n not gonna spoil anything. Go buy it.\n\nHelpful | 2", "PickleRick2020Apr 5 at 3:02 PM\nExciting!!!\n\nThis was way more than i expected. Getting into the game was fast and really keeps you wanting more!\n\nHelpful | 0", "RoYaLKiNGToBsApr 3 at 6:59 AM\nVery good\n\nErm if you want to crap yourself a lot you best get this. Sorts blocked rear a treat.\nAlso a very good game!!\n\nHelpful | 1", "jesseman144Apr 2 at 11:39 AM\nGreat!!\n\nJust begin the game today.\nAlready a good show of controls at begin.\nComic style is realy cool love it!!..\n\nHelpful | 1", "Decal7xApr 3 at 6:31 PM\nAddictive gameplay\n\nI gotta admit, this game is great! Lies Beneath looks and feels great. A definite must buy.\n\nHelpful | 1", "mikeberry29Apr 5 at 2:56 PM\nWow\n\nWow just wow best game on the quest hands down\n\nHelpful | 0", "ScsundApr 4 at 4:39 AM\nIts just great\n\nJust buy it.\n\nHelpful | 0", "DaqiMakuraApr 3 at 7:30 PM\nStatic noice when casting\n\nWhenever I cast this game to the ChromeCast it becomes extremely staticy.\n\nHelpful | 0\nDeveloper ResponseApr 3 at 7:34 PM\n\nUnfortunately there is a bug with the OS that is causing audio issues when streaming or recording. Oculus is working on a fix and we will update once we have more info from them regarding an ETA.", "kinobacaApr 3 at 5:43 PM\nawsome so far\n\nthis game is fantastic and difficult\n\nHelpful | 1"]