{"App Title": "Mini Motor Racing X", "App description": "Welcome to the world of Mini Motor Racing X! Jump into a nitro fuelled world where little cars mean BIG fun! Spanning across reclaimed ruins and scorched outbacks through to rain soaked docks and sun-kissed tropical islands - Mini Motor Racing X will take you on a micro driving journey across the globe like no other.\n\nFEATURES:\n\nHUGE CAREER: Collect dozens of cars and race on over 50 tracks in hundreds of races with vibrant, rich visuals, day and night and in varying weather conditions. \n\nUPGRADE YOUR RIDES: Pump your hard earned winnings into upgrades to help give you the edge.\n\nMULTIPLAYER: Full online multiplayer with up to 4 friends and campaign co-op.\n\nMULTIPLE WAYS TO PLAY: Play from in-car, top-down, track-side or anywhere else that takes your fancy! Packed with comfort and control options including Virtual Wheel, RC Controller, motion controls and more!\n\nBUMPER BALL: Play online with friends and score some goals in this and other frantic party modes.", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Touch (as Gamepad)Supports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Touch (as Gamepad), Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Racing", "Languages": "English", "Version + Release Notes": "1.1.2", "Developer": "The Binary Mill", "Publisher": "Nextgen Reality Pty. Ltd.", "Website": "https://www.thebinarymill.com/", "Release Date": "May 14, 2020", "Developer Privacy Policy": ".\n.\n.\n.\n.\n.\n      \nThe Binary Mill\nPrivacy Policy\n\nThis privacy policy sets out how \"The Binary Mill\" uses and protects any information that you give \"The Binary Mill\" when you use this website. The Binary Mill does not collect personal information about you if you only browse this website. Should we ask you to provide certain information by which you can be identified when using this website, then you can be assured that it will only be used in accordance with this privacy statement.\n\nUses:\n\nWe only use your personal information you submit to us via our contact form for the purposes for which you give it to us and for related, internal management purposes.\n\nWe do not give (or sell) information about you to government agencies, organisations or anyone else unless one of the following applies:\n\nyou have consented\nyou'd expect us to or we have told you we will\nit is required or authorised by law\nLinks to other websites\n\nWhen you send us an email, we use your email address to thank you for your comment and/or reply to your question, and we will store your communication and our reply for any future correspondence. Beyond our initial reply, we will never use your email address to send you any unsolicited message or information, nor will we share it with or sell it to anyone else for such use.\n\nYou may request details of personal information which we hold about you under the Data Protection Act 1998. If you would like a copy of the information held on you please write to Level 1, Suite 4, 328 Scottsdale Drive, Robina 4226, QLD Australia.\n\nIf you believe that any information we are holding on you is incorrect or incomplete, please write to us and we will promptly correct any information found to be incorrect.\n\n\n\n\nMailing Policy\n\nOur website may contain links to other websites of interest. However, once you have used these links to leave our site, you should note that we do not have any control over that other website. Therefore, we cannot be responsible for the protection and privacy of any information which you provide whilst visiting such sites and such sites are not governed by this privacy statement. You should exercise caution and look at the privacy statement applicable to the website in question.\n\nWhen you accept to receive information about our services, promotions, newsletters, press releases, and/or new offers, we use your email address and any other information you give us to provide you with the information or other services, until you ask us to stop (using the 'unsubscribe' instructions provided with each email communication.\n\nWhen you request information or other services from us, we use your email address and any other information you give us to provide you with the information or other services that you requested, until you ask us to stop (using the 'unsubscribe' instructions provided with each email, and/or on the site where you signed up, and/or as we otherwise provide), or until the information or service is no longer available.\n\nWe will never use your email address or other information to provide you with any unsolicited messages or information (unless that is part of the service you are requesting), nor will we share it with or sell, rent or lease it to any third party for such use.\n\nWhen you sign up for our forum you may receive emails from other users if you wish to allow them to send you emails, administrative emails as well as emails when you receive private messages.\n\n\n\n\n\nCopyright  2011 The Binary Mill. All Rights Reserved.\n\n \n\n\nContact Us \nPress \nTerms \nPrivacy \nSitemap \n  \nGun Club Mobile Site", "Developer Terms of Service": ".\n.\n.\n.\n.\n.\n      \nThe Binary Mill\nTerms Of Use\n\nWelcome to our website. Your use of the information, graphics, text, software and materials (Content) on the The Binary Mill Site is governed by these Terms of Use and our Privacy Statement. By using this website you agree to be bound by these Terms of Use.\n\nThe term \"The Binary Mill\" or \"us\" or \"we\" refers to the owner of the website whose registered office is Level 1, Suite 4, 328 Scottsdale Drive, Robina, 4226, QLD, Australia - ACN 78 099 716 499. The term \"you\" refers to the user or viewer of our website.\n\nAll work showcased within the site has been worked on by The Binary Mill employees both inhouse and at external facilities.\n\nThe use of this website is subject to the following terms of use:\n\nThe content of the pages of this website is for your general information and use only. It is subject to change without notice.\nNeither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and we expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law.\nYour use of any information or materials on this website is entirely at your own risk, for which we shall not be liable. It shall be your own responsibility to ensure that any products, services or information available through this website meet your specific requirements.\nThis website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance and graphics. Reproduction is prohibited other than in accordance with the copyright notice, which forms part of these terms and conditions.\nAll trademarks reproduced in this website which are not the property of, or licensed to, the operator are acknowledged on the website.\nUnauthorised use of this website may give rise to a claim for damages and/or be a criminal offence.\nFrom time to time this website may also include links to other websites. These links are provided for your convenience to provide further information. They do not signify that we endorse the website(s). We have no responsibility for the content of the linked website(s).\nVideos provided on the site are not to be linked to externally without prior written consent from us.\nYour use of this website and any dispute arising out of such use of the website is subject to the laws of Queensland, Australia.\n\n\n\n\nCopyright  2011 The Binary Mill. All Rights Reserved.\n\n \n\n\nContact Us \nPress \nTerms \nPrivacy \nSitemap \n  \nGun Club Mobile Site", "Space Required": "1.55 GB"}



["5 stars\n78%\n4 stars\n11%\n3 stars\n5%\n2 stars\n1%\n1 star\n5%", "EddieBarsh92Jul 6 at 9:33 PM\nAmazing game with potential\n\nGonna give it 4 stars. It is INCREDIBLY fun! Its absolutely essential to any Quest headset.\n\nPros:\n- Very very deep: Quick Race, Multiplayer, surprisingly deep Career Mode. Each mode has normal race mode and also race + combat modes (basically Mario kart combat) But where the developers really hit the home run is with several other games modes such as Bumper Ball (its basically Rocket League except you cant fly)\n\n- Ranking Up system: They nailed the right balance of non-excessive grind/reward system of ranking up. I felt like I really earned the money to buy upgrades but I didnt feel stressed/worn out from grinding.\n\n- Great Menu layout: youre in a garage with your car on a lift. Its really neat that you can grab a control panel dangling from the ceiling with 2 buttons on it that you can press to switch cars. Another thing I like is that you can grab the tablet and move it around and adjust it ! Great feature !\n\n- Camera Angles: Amazing selection of different angles.\n\n- Superb Racing: Its very hectic at times and intense and Ive had many heart pounding finishes at the line where I won/lost by a fraction of an inch!\n\n- HUGE selection of tracks !\n\n- Pretty great selection of cars: They have trucks, jeeps, semis, various sports cars, sprint cars, they even have a Delorean !\n\nCons:\n\n- Better Customization - currently you can switch paint schemes but a paint booth where you can design your car is ideal. Custom decals, stripes/designs would be HUGE and give players more attachment to cars they personally designed\n\n- Add Multiplayer Button on the menu: Currently how you get into a MP lobby is a little tacky.\n\n- Races are too short: most races are usually 1:30 and some even quicker than that. I think we should shoot for a 2 or even 3:30 minute race would be better.\n\n- Combat overhaul: The combat is GREAT ! But it needs work:\n- add more weapons (get creative and crazy!)\n- give greater penalties to combat hits (such as wrench or tornado hits) imo they arent effective enough often times im just a car length or 2 behind someone and hit them with a wrench and still I cant pass them. Also, I dont believe Tornados are effective enough. The lightning in Mario Kart was devastating to the whole field and allowed you to catch back up big time and I just dont think the tornado is strong enough. It isnt very effective imo.\n- Another (big) issue in Combat is the ghost effect. So I shoot a rocket at the leader, he starts to blink as he becomes a ghost car temporarily but then someone else shoots a tornado at the perfect time and it hits the leader but because hes a ghost it has no effect on him. It should stack up. It sucks but its like Uno where someone throws a draw 4 and then another draw 4 on you. It happens.\n- another issue I noticed is that if someone shoots a tornado as the leaders are trading positions, the tornado hits only one or none at all.\n\nIdeas: I dont necessarily endorse any/all but theyre just ideas that I hope you consider\n\n- random weapon boxes (similar to Mario kart): I wouldnt like to see a copy/paste but more of a twist on how to obtain weapons/powerups.\n\n- Boost Zones on track: some games like PSVRs Wipeout Omega have boost zones randomly scattered around the track. Im not sure how well this would work but its something to think about.\n\n- alternate routes on tracks: some racing games have tracks where for example cars could go in one tunnel while others go in another tunnel before they all merge back together.\n\n- bigger wider tracks\n\n- nascar style tracks with banking\n\n- speed traps - maybe youre trying to hurry up and race to the door before it closes. Or maybe like on Bowsers Castle on Mario Kart theres boulders that are moving left and right and often times players crash into them. Maybe theres a bridge that raises/lowers so if you dont catch it at the right time you could get stuck waiting for a couple seconds. This would make racing even more exciting and increase the mental aspect of it.\n\nJust a couple ideas...\n\nHelpful | 85", "cantenna10 days ago\n\"Zip-a-Dee-Doo-Dah\"\n\n\"zip-a-dee-ay... My, oh my, what a wonderful time im having ripping it up around these tracks!! This is some seriously impressive in-car VR fun being had here!!\n\nI've disabled all the comfort options, windows wide open and having an absolute BLAST RIPPING IT UP!!!!\n\n#WHOOOHOOO\n\nHelpful | 6", "justn8917 days ago\nNearly perfect\n\nAwesome game play. But please change the menu to allow us to aim at buttons rather than physically have to push them.\n\nNumerous times, I have gone to push a button on the menu table, but have my range of motion obstructed by the chair Im sitting in. Im left to resort to mash my hand into the couch in an attempt to reach the button\n\nWill give five stars when this issue is fixed.\n\nAlso, theres a glitch where if you change the color of your car, sometimes you cant change it back. Trivial issue but worth looking into.\n\nHelpful | 2", "jasonduncan1976May 14 at 11:05 AM\nFun Game\n\nGraphics - Clear and Crisp, Audio - Sounds Are Perfect , Game Play - Very fluid and fun. The cars are easy to control, there are several different modes you can play from, inside the car, outside, above, or WAY above! There are also several mods for all cars and a lot of maps to choose from. Good game, 5 stars, would buy again.\n\nHelpful | 148\nDeveloper ResponseMay 16 at 7:27 PM\n\nThanks for the great review, jasonduncan1976! 5 stars, would appreciate again :)", "Robertobob100Jul 18 at 5:43 PM\nOne of the most completed games on quest\n\nThis game is an easy 5/5 stars! The courses are short but there are so many! There are a lot of customizable options to make the game as comfortable as possible.\n\nOne of my favorite parts is that you can play the game from sitting inside the car, hovering above, hovering way above, or multiple views of the whole map.\n\nI am a huge fan of mario kart and this is the closest thing to it for vr!\n\nHere is my little criticism. When you change the view to inside the car you sometimes get motion sick. Now I understand that pretty much any car game in vr does that. I'm wondering if there is a way to make it a little less motion sickening. That is still a very minor issue.\n\nThat doesnt stop me from giving 5 stars though. AMAZING GAME!\n\nHelpful | 5", "CloudTurtle27May 18 at 8:34 PM\nThe racing game quest has been waiting 4\n\nMini Motor Racing X is the racing game the quest has been waiting for. Not only is it the best racing experience to date, its one of the best games currently on the quest! Yeah I said it.\nMMRX is a masterpiece. The environments around the tracks are absolutely stunning to say the least. Sound FX are spot on. Interacting with menus is incredibly polished. The racing just feels right. Incredibly easy controls and each car has a different feel. There are a bunch of different viewing angles which all give the game a totally different feel. All 3 game modes are different from each other and are a blast. 3 games in 1, the value is pure madness.\n\n***PRO TIP*** Try all the different angles out! Different angles give the game a totally different feel. Top down view provides the best visuals, overview of the track and surroundings. First person (driver seat) and third person view provide better control of the car and are more intense. First person/3rd person views might take some time for your body/eyes to get used to. Try it out on tracks without too many curves/turns and if you feel uneasy, take a break and come back to it later. You should eventually adjust. Also another thing that helped me was adjusting the body roll. Go to Options > Comfort > Smoothing (Car Body Roll) and slide it all the way to the right.\n\nIf you have even the slightest interest in a racing game, get this! Hands down the best racing experience and one of the best experiences on the quest to date.\n\n*UPDATE*\nAfter playing daily here are some changes in order of importance I think MMRX could benefit from.\n\n- Increase total laps for Multiplayer/career mode (aim for 3-4 minute matches)\n\n-Multiplayer seems dead right now. Perhaps rather than seperate the two modes just have one queue to pull all players together and offer classic, type x and bb voting.\n\n-While racing top down angle, Ive noticed its extremely hard to compete with someone racing via in car view. If possible tweak controls for top down\n\n-Speed up nitro respawn rate and randomize nitro location\n\n-Bumper ball mode - ball occasionaly randomly flies off in a random direction.\n\nLooking forward to what future updates bring. Keep up the good work.Will update if I see anything else.\n\nHelpful | 56\nDeveloper ResponseMay 17 at 3:45 PM\n\nWoah! Thanks so much, CloudTurtle27! Amazing review and really appreciate you providing some top tips there for other players. We're stoked you're enjoying the game and hope to see you in there sometime! :)", "RickK75May 14 at 6:18 PM\nCrazy surprise after in-car fail...\n\nPlayed the game starting in-car and found it to be a vomit-inducing nightmare.\n\nI was about to go for a refund, but thought I'd quickly try the external track view mode out of curiosity.\n\nHow wrong I was about this game. Racing via the track views changed everything.\n\nNot just a bit, I realized this is an absolutely superb game! Can't believe I missed that by diving straight into in-car without thinking :/\n\nIn this mode I could really appreciate the beautiful graphics and wonderful gameplay. In VR it's like taking Quill's toy car out for a spin. If she had one - Stuart Little did... Boomers like me will have flashbacks to Micro Machines on PS1 or even 16 bit wonders like Super Sprint.\n\nJust realised how many tracks the game comes with too. Absolutely loads!.. and they're all finely modelled with great attention to detail. It makes picking a vantage point to control the car from at the start of a race a real joy.\n\nMy initial impressions were totally wrong about this game. The developers have worked really hard to create value for money and a real work of art here.\nI might not like the in-car view, I don't like any stop/start motion in VR -- but this game is not all about that, it's just one of its many features and can be easily switched off.\nThen, beyond that lies a total masterpiece model arcade racing game which is easily 5/5 and the best Quest game in a while.\n\nAwesome job The Binary Mill. Love it!\n\nHelpful | 43\nDeveloper ResponseMay 16 at 7:18 PM\n\nWoah! Amazing review, RickK75! So glad to hear that you were able to find the love! The game is massive with so many camera and control options that it might take a try or two to find the options that are right for you. Great to hear you having such a great time after a rocky start. Thanks for sharing! :)", "sandrock3922 days ago\nFantastic!\n\nThis game is so much fun and made me laugh constantly, in single and multi-player modes. The graphics are brilliant and the different racing modes and tracks are fantastic and varied. The 3 different car control options are great, especially the RC version and you can choose from about 10 different viewing positions on each track. The career mode is really long too so you have plenty to keep you coming back to the game.\n\nI would probably add a longer race mode/option to the races as some of them are a bit short in terms of laps/time.\n\nOverall, this game is hilarious fun and is a must have for any Oculus.\n\nHelpful | 1", "james.repullo13 days ago\nBest game EVER!\n\nThis is the best game ever. I wanted a game like Mario cart and this is the closest to it. I played this game for 2 hours straight and it was AMAZING! LOVE IT!!!\n\nHelpful | 2", "mopar_zak22 days ago\nFun but takes a while to master\n\nWhen I first bought this it made me sick but I got used to it. Once I got over it is what a lot of fun!! There are a lot of tracks and cars.\n\nI just wish it didn't take so long to earn money to upgrade to a decent car. I had more fun in the arcade mini car racing than the campaign.\n\nHelpful | 1", "leaper1981May 18 at 2:23 AM\nSTOP READING THIS AND JUST BUY IT!!!!\n\nI've decided to update my initial review that was here as I had an issue with it crashing and losing all my progress. I ended up reinstalling the game and it hasn't happened since but if it happens again I will contact the devs to see if they can do something as I'm even further into the game now. But hopefully it won't happen again.\n\nSo now you've heard my issue it's time to get down to the review. This game is 5 star! Even with the issue I had its impossible not to give this game 5 stars. Quest has been waiting for a game like this and it delivers!\nThe graphics for quest are great. The courses look really detailed and well themed. The playing options are part of the magic here. You can race from countless perspectives, birds eyes, track sides, in car, outside car, you name it. The sense of scale when one player is playing birds eye and another is in the car can be a lot of fun. It's a great aspect of the game as depending on your VR legs there's a view for you. I don't know anyone that can drive in car but many play sat on top, I personally go for the furthest out car view. So have no worries about comfort whatever your level of VR legs. There are also different ways to steer the car which is really fun. The multi player is great but we need more people so jump in, seriously its worth it!\n\n\n\nIMPROVEMENTS:\nThe music is sometimes overbearing and loud and prevents u from being able to hear the other players. The volume should dip or something for mutliplayer.\n\nThe rocket league game is great just 1 issue, sometimes the ball will randomly move to a new location without anyone hitting it, hard to explain but it's like an invisible car just knocked it.\n\nThe courses are short & I kind of understand as it can't be too big for players in birds eye view etc but it would be nice if there was maybe some way round this or maybe tracks for just playing in car? Just a thought.\n\nThanks to the devs for replying to me but it shows how good this game is as I couldn't wait to hear back from them so I just started the game again!\n\ngreat game, keep up the good work guys!\n\nHelpful | 28\nDeveloper ResponseMay 18 at 4:11 AM\n\nHello leaper1981 - sorry to hear about your issues. The syncing you're seeing at the start of the game is cloud save syncing (since the game is cross-buy, the saves work on both Quest and Rift) so it seems that something has gone wrong for you there. If you would be so kind as to contact us direct via https://thebinarymill.zendesk.com/hc/en-us/requests/new we'd love to help you out and get you back up and running ASAP. Many thanks!", "AlechjoJun 5 at 4:48 PM\nSO GOOD. One suggestion for devs. [EDIT]\n\nI thought I wouldn't like it because of how short the laps are, but in the end that didn't bothered me at all, and you can even adjust the number of laps in some modes. While playing inside the car you can get a bit sick and your eyes can hurt, specially in curvy maps, but I guess no VR racing game can avoid that. The view outside the car doesn't have this problem.\n\nA suggestion for the devs would be to allow us to circle through the camera position BACK AND FORWARD by pressing the left and right joystick respectively, instead of just circling forward and forward no matter which joystick you press.\n\n[EDIT: The devs actually read my suggestion and implemented it in the last update! Wow, that's a cool dev team. And it works.Thank you for listening!]\n\nI would also like they add more weapons for the combat mode, but the current ones are still cool.\n\nIf you are doubting to buy this game, don't. Go ahead and buy it RIGHT NOW. It is really really well done and it has so much fun. Thanks to the devs for a great racing game for oculus quest!\n\nHelpful | 7", "mattnasl98Jul 24 at 1:20 AM\nCool but nothing too crazy\n\nCool game, I like the idea of virtually drive in the cockpit of a car.\n\nHowever, it has miniature scale tracks which really makes the game loose its purpose because it is too short of a track for you to gain speed or have fun.\n\nAlthough I did buy this for my dad, and he did enjoy it.\n\nIt is an alright start to a VR racing game, but I would like to see games similar to Forza or Midnight Club coming out on VR Quest.\n\n\nId rate this a 3.2 (Should be lower $)\n\nEdit: I realized it said mini moto . Therefore, I shall rate this a 3.5.\n\nHelpful | 3", "tgckenMay 16 at 4:48 AM\nAmazing Game - Executed Perfectly\n\nBig fan of racing games and I was really worried this game would disappoint - instead I received one of the best arcade racing games I've ever experienced. Makes excellent use of VR to the point that I sometimes forget I'm playing in VR (in a good way). Visuals vastly exceeded expectations, was originally excited to try via link since it comes with cross buy but now I'm not as motivated because of how well it plays on Quest.\n\nSo much content: couldn't believe how many tracks and cars there were. Top down, 1st person car, and 3rd person car views make it feel like at least two completely different games in one. Complete career modes for racing-only and combat racing. Bonus modes let you play car soccer (not a clone of other, no flying/jumping but a lot of fun for its own thing), race with even tinier cars, and customize race opponents and number of laps. Just about everything can be done online with 4 player multiplayer.\n\nTON of customization and options, almost to a fault (but really lets you play how you want). Top Down view is very cool, like having a tiny RC car set. I also very much enjoy 1st person in car view and 3rd person follow view. Mixing in-car view and joystick control is potentially uncomfortable as the default setting on the joystick feels a bit sensitive (but may be necessary for tight drifts).\n\nRacing feels unique and perfectly suited for VR - very enjoyable in both modes. so far my favorite setups have been joystick control in top down view, joystick control in 3rd person, or virtual wheel in first person. The races are very fast and the tracks are small, but everything feels like it is the right scale and would be particularly enjoyable for those who get bored in racing games (short races also help prevent arm getting tired from using virtual wheel setting).\n\nTLDR: One of my favorite arcade racers across any platform. Take a few minutes to find your favorite combinations of camera and steering (and comfort).\n\nHelpful | 14\nDeveloper ResponseMay 16 at 6:12 PM\n\nThanks so much, tgcken! These are the reviews we live for! Thanks again and hope to catch you in a race someday! :D", "Captain_Papa_BearA day ago\nMotion sickness on all settings\n\nThere are no instructions on how to change the settings to avoid motion sickness, and apparently since I bought it as a bundle, I can't return it. Regret the purchase. And now I have vertigo (so much for a \"Comfortable\" rating). I own a lot of other Quest games, and this is the first that I tried to get a refund on. Waste of $20 since I will never play it again! Will also never buy a bundle since you cannot request a refund on those (watch the fine print buried several pages in)\n\nHelpful | 0\nDeveloper Response7 hours ago\n\nHi Captain_Papa_Bear - have you tried enabling the many comfort options in the menu? Or perhaps tried outside the car or from above? We've worked hard to find a way for everyone to be able to play the game comfortably so we'd encourage you to explore those extra options. If you like any specific assistance with the comfort options, please feel free to reach out to us directly at https://thebinarymill.zendesk.com/hc/en-us/requests/new", "Texanboy06Jun 24 at 6:55 AM\nReview\n\nOk lets get this straight this is by far the best racing game on quest and it was just released and so far no bugs or glitches. The graphics are crystal clear and I can read clearly. But I have 1 suggestion for you. Make it to the point where we can take off our helmets and we can see our avatars face. Either than that awesome job binary mills\n\nUPDATE:\nOkay I have another suggestion, custom paint jobs. TAH DAH!!! You can paint your own car how ever you want (no inappropriate paintings) and you can share to the mini community and every time someone uses your paint job you get 100$ every time someone uses your paint job. I hope you put this in the game because that sounds cool and I think that other people would think that to.\n\nUpdate 2:\nOkay so if you played gun club there was a sandbox right. So why not add in either a sand box mode or a create a track mode where you get all the tracks, scenery, etc. and you can post in the mini community where you show off your track and let other people know play it. And if your doing online modes like quick play you can click a button saying race your own track and in the track or sand box you can add in nitro/cash to track it whatever youre doing. That sounds fun right if so make this helpful\n\nHelpful | 5\nDeveloper ResponseJun 7 at 7:18 PM\n\nThanks, Texanboy06 - glad the camera update is to your liking! :)", "Pauldoggy20 days ago\nSlot car Heaven\n\nI just love this game, so many options and levels and Im just getting started. All play no puzzles, cut scenes, stories or boring narrative just PURE FUN\n\nHelpful | 0", "KagesdadJul 8 at 6:44 PM\nFantastic!!! A must buy for VR!!\n\nThis is the first review Ive ever written on a game. I have been having so much fun with this game I felt I had to write something to let everyone know how awesome it is!! I love VR, I bought the Quest on day one and there are a bunch of amazing games I own for it but this one is the game I keep coming back to and playing all the time! There are so many viewpoints when playing and car options and play options, they are all so very well done!! You can burn a couple of laps from inside the car or chill in the blimp overhead or sit trackside and drive whatever you want. You can play for 10 minutes or an hour and have a blast! Multiplayer is even better, get with your friends and work together in career mode or race them head to head. So much fun!\nTrust me, if you like fun racing action this is a must buy!!\n\nHelpful | 1\nDeveloper ResponseJul 14 at 11:26 PM\n\nMany thanks for taking the time to write a review, Kagesdad - and your first no less! Too kind. Always great to hear this type of feedback. Thanks again! :)", "kaboobaschlatzJun 7 at 11:20 AM\nIt's incredible right from the start\n\nI've only played Quick races so far and not even turned the weapons on and I'm already in love with this game. Everything is so well done, from the menus, to the races.\n\nLooks like plenty of tracks, plenty of cars and so many different viewing angles.\n\nEven navigating the menus is fun.\n\nNew favourite game to replace Space Pirate Trainer and Pistol Whip.\n\nThank you for making this.\n\nHelpful | 4\nDeveloper ResponseJun 8 at 6:41 PM\n\nGreat to hear, kaboobaschlatz! Thanks for the review :)", "brutiusJul 14 at 4:45 PM\nPolished and good\n\nBest racing game for Quest. Nice to have so many options. Fun. But I wish First Person didnt make me sick, I wonder if it is the curve bounces? Super cool to be IN the car, but I cant . But I gotta tell ya, I was grinning ear to ear the whole time.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 11:21 PM\n\nHi brutius - great to hear you've been enjoying the game! :) As for your desire to play in-car, have you played with the many comfort options in the game? We found that we could have just about anyone play in the car with the correct settings attuned to them. Also, we highly recommend playing with the Virtual Wheel while in-car ;) Good luck!", "carl.perez.58Jul 3 at 12:30 AM\nPhenomenal!\n\nThis is a game that you must have in your library.\n\nThe amount of love that was poured into this game is astonishing. So many tracks, cars and options.\n\nI cannot do the first person view from inside the car. Theres no way due to how easy I get dizzy. But I dont need to. 3rd person views are more than enough and you can pretty much get any view of the track you want. Close up, far away, corners, you name it. I feel like a kid controlling my old hot wheels driving them through tunnels around corners and over jumps while launching rockets.\n\nI cant say enough except - thanks for showing the love developers. Love this game \n\nHelpful | 1\nDeveloper ResponseJul 2 at 11:15 PM\n\nThanks, Carl - much appreciated! :D", "djnoelbJul 14 at 6:01 PM\nGreat game!\n\nAt first I was worried about the motion sickness but after playing a while I dont seem to have any. Really love playing this game and have been looking for a good racing game. Graphics look great and game play and feel is awesome!\n\nHelpful | 0\nDeveloper ResponseJul 14 at 11:28 PM\n\nStoked to hear it, djnoelb! Appreciate the review :)", "ChikapacooJun 20 at 9:50 AM\nWhoa....AWSOME....BUT.\n\nI will give this game high credits for gameplay and mechanics.love and can't stop playing. Here's what I don't like. The multiple different views ,I get motion sickness if my view is in or very close to the car. I have a much better experience above the track and outside the car. Here's my biggest issue w the game. There needs to way to lock the view you set to. I find I toggle through views in the middle of a race, get lost trying to find where I am and take a first place position to a 6th place position because the view changedI understand its me ,with the controller but can you set in a fix to hold a view in the excitement of a race...... Love this game otherwise\n\nHelpful | 2\nDeveloper ResponseJun 21 at 11:03 PM\n\nHey Chikapacoo - there's an option in the game called \"VR Camera\" which you can set to 'Double Click' which will prevent any unintended camera switches mid race :) Hope that helps!", "hhammer57May 26 at 12:17 PM\nMini Motor Racing\n\nThis is one of the best car racing games ever. So many courses, so many cars and exotic tracks. Had a problem with pushing the joystick button (used for steering) down by accident which changes the view, however, quickly found a setting to require double click for changing views and the problem was solved. Wonderful courses, quick learning curve. Played every track until I was able to win almost every time, then went on the next one. Just love this game, one of the best ever. If you like car racing games, this is your answer. The more you play the better the game gets. If you have any doubts purchasing this game, just buy it, and you won't regret it. Hope this review helps, have fun. Happy racing and a heartfelt \"thank you\" to the developers, fantastic job.\n\nHelpful | 5\nDeveloper ResponseMay 26 at 5:40 PM\n\nAnd a heartfelt \"thank you\" to you for such a terrific review, hhammer57! We love to hear about positive experiences like this :)", "john.michael.5895May 18 at 1:41 AM\nDeveloper Developer\n\nBrilliant... But please allow infinite laps on time trial. What makes you think everyone like what you like..such as five laps only? For everyone else who like infinite laps this can be only done by running reverse direction. Buy it guys, ln car on slow mode is as good a feeling as going go kart as I have done in real life. I hope the developers can have more and more add on tracks.. These small tracks are brilliant and I will be happy to pay more money for more tracks. I hope the developers will get back on these points\n\nHelpful | 7\nDeveloper ResponseMay 18 at 4:08 AM\n\nHi john.michael.5895 - many thanks for the review! It sounds like our 'Custom Race' option might be a good fit for you - you can select all sorts of race parameters (track, reverse, day/night, multiple AI difficulties etc.) and while you can't set the lap count to infinite, you can go as high as 20 :) Hope that helps and thanks again!", "dankani05Jul 6 at 10:45 AM\nMy best game on quest\n\nTon of fun and contents smoth gameplay so creative and innovative, no doubt 5* hands down!!\nUpdate: this is the best game for me on oculus quest has a nice gameplay, excellent graphics, awsome multiplayer and highly replayatability value ever, any race episode you play when you come back you will have a different feel and different experience because there are alot of camera views that will give you different experience while playing.\nI'm a new quest user budgeted almost $150 usd for my new quest games bought almost all high rated titles but could you immerging that the only game i found my self coming back to it happily playing until my battery runs down is this game apart from bit saber. No regret for buying it.\nPlease I hope to see soon more updates to keep this game shinning.\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:33 PM\n\nMany thanks, dankani05!", "flippababyJun 24 at 3:22 PM\nArcade racing fun\n\nI thought twice about buying this - but Im really glad that I made the plunge in the end!\n\nOkay - if youre looking for GT realism this isnt it... but if youre looking for a fun arcade racer in VR, youve come to right place.\n\nPerfect for me for either a quick pick-up and put-down race - or you can play extended sessions with a great championship, with upgrades awarded with the in-game currency.\n\nPlenty of vr display modes - 3rd person, 1st person, top-down view etc etc (the variety of options in the settings are exceptional and theres a view to suit pretty much anyones level of vr legs).\n\nI havent even tried the football variation of the game (cant remember what its actually called... Bounceball, maybe...). I keep thinking I will, then find myself getting sucked back into the championship.\n\nA great value game for the sheer amount of gameplay and options available (not to mention a 10/10 fun-factor!).\n\nTo the Devs - whats next? If the quality of this game is anything to go by, I cant wait for your next game on the quest! Your hard work is appreciated! :)\n\nHelpful | 0\nDeveloper ResponseJun 25 at 10:49 PM\n\nThanks, flippababy! Very kind of you :) Rest assured we're busy cooking away on all new VR games...", "VictorVanNedMay 21 at 5:02 AM\nMust have!\n\nI was waiting for an amazing racing game and i'm so glad this game came out!\n\nThere are enough reviews telling you how great the camera system is or how great the tracks and gamemodes are, so i'll keep it short.\n\n\nThis game belongs up there with the big players like Beatsaber, Moss, etc.\n\nIt's a must have! Buy it!\n\nHelpful | 5\nDeveloper ResponseMay 21 at 11:50 PM\n\nToo kind, VictorVanNed! Really appreciate the review :)", "perez67Jun 25 at 9:34 PM\nExcellent Game\n\nThis game is amazing. I didn't think I'd like it as much as I do. It is well done with plenty of levels and vehicles to keep you entertained for quite some time. My one and only complaint is that there needs to be a way to stop the cameras from switching mid play. Maybe it's there and I'm missing it, but I will be having the best race ever and suddenly my camera angle changes because I put too much pressure on the stick. Completely takes me out of the race. Aside from that...worth every penny.\n\nHelpful | 1\nDeveloper ResponseJun 25 at 10:47 PM\n\nHey perez67 - thanks for the review! You'll be happy to learn that there's an option in the menus called 'VR camera' which you can change to 'double click' which should be the end of the accidental camera changes. Thanks again! :)", "evandaganJun 4 at 9:19 PM\nArcade Rally Racing!\n\nThis is great. Reminds me of 90s arcade racing games - nothing too realistic, just good high-paced fun. I tend to play with the in-car viewpoint, the virtual wheel, and the classic racing mode with no weapons, which scratches that classic arcade itch. Switching up the viewpoint or control system makes it a totally different experience, more like the old micromachines game or a real RC car. It's really nice to see a game like this give you so many different options to customize to your preferred play style.\n\nThe tracks are really cute - just the right level of realism, and plenty of detail to appreciate. Each track has its own unique style - including the different background objects/buildings/textures, and subtle music selections match the aesthetic. I do wish the tracks were a little longer, and adding shortcuts would be an interesting twist on the gameplay.\n\nIf I could make a few suggestions to the developers - it would be nice to have a brake on the controls and a mode that's pure racing - without the cash and nitro items - to add a little more realism; maybe this could be a new 'arcade mode?\n\nHelpful | 2", "meduzoMay 17 at 5:34 AM\n$3 mobile game ported to VR for $22 more\n\nThis game had a debut in 2011 for iOS, later on they've released ports and versions (with updates) to different platforms.\n\nI really enjoyed the game, it does have a lot of content, and many ways of playing it, which is awesome! but there are several things that I just get tired of while playing it:\n\nMUSIC\nMusic is so obviously made for a mobile game, I can't stand it, it's generic, it lacks \"flavor\", it's just stale and sometimes it feels like it's too short... a better soundtrack would have an incredible amount of positive impact on the game experience.\n\nMENUS\nThis is mostly a seated experience, so why would you make me reach the menu to select the car/stage/mode I want to choose? It would make more sense to me to have also a way of just clicking the menus with a laser pointer, the lack of 3D buttons and feedback make the menus difficult to navigate.\n\nPRICE\nDon't get me wrong, this game has $25 worth of content and with multiplayer maybe even more. However I kind of regret not waiting for this to be on sale, I think that with $5 off this would have a \"GRAB IT NOW\" price.\n\nResponse to Devs:\nThank you for the response, I have done that, moving the huge tablet around to have it wherever I want, swiping, using the physical arrows menu, etc.\n\nHelpful | 32\nDeveloper ResponseMay 16 at 6:31 PM\n\nHey meduzo - thanks for taking the time to share your thoughts! Couple of tips that may make things for enjoyable for you; you can actually 'grab' the menu screen and position it in a place that's super easy to access. Also, here's a tip that we haven't seen anyone do yet - you can swipe the screen to select tracks in many of the game modes - sure beats tapping those arrows! :)", "powney1991May 18 at 4:16 PM\nBest racer on the quest by several laps!\n\nI have to be very honest here, I was highly sceptical when this title came out! I thought it was just gonna be some toy car knock off racing game or something based on what I had seen but I took the plunge yesterday and boy how wrong I was to judge a book by its cover! This is the best racing game on the quest by a considerable distance! Im not much of a racing fan but I couldnt stop playing this last night. It has tons and tons of content including a load of tracks, (night and day) a load of vehicles, a ton of different ways to control your vehicle and what perspective you take on. For example you can drive the car from the inside or just use the analog stick and trigger and race from the outside as you control it and take in the different environments around you!\n\nTheres also a lengthy career mode where you can unlock gloves; helmets and extra vehicles (vehicles can also be customised in terms of speed acceleration handling etc)\n\nand if all that wasnt enough you can play online multiplayer races as well as a bumper ball mode which is heavily inspired by rocket league so it almost feels like youre getting two games in one!\n\nOverall I cant recommend this highly enough for anyone whos considering it! A simply amazing title!\n\nHelpful | 4\nDeveloper ResponseMay 18 at 10:44 PM\n\nThanks for the review, powney1991! Glad we were able to surprise you (in the good way!) :) Really appreciate you taking the time to share your thoughts. All the best!", "VR_BirdJun 18 at 9:39 PM\nLove this game\n\nThis is probably one of my favorite games on the Quest. Its not perfect, navigating the menu system is a bit cumbersome but its perfect where it really matters, the racing. This is such a fun game to play. There is an upgrade system with the cars thats not too complicated. Just right for someone like myself just wants to have fun racing. Would definitely recommend getting this game. Super fun!\n\n\nUpdate: I FRICKIN LOVE THIS GAME!!! This is probably my favorite game on the Quest so far. I had previously rated this game 4/5 stars but I gotta give it to The Binary Mill for making such a fun racing game and VR experience. I was never a big racing game fan until I got this game. Looking forward to Mini Motor Racing II\n\nHelpful | 2\nDeveloper ResponseJun 2 at 1:48 AM\n\nThanks, VR_Bird!", "t2p21Jul 26 at 7:34 AM\nGreat Game!\n\nGraphics are great controls are good, just a little touchy with camera view sometimes (but that may be me) would recommend this to anyone!\n\nHelpful | 0\nDeveloper ResponseJul 26 at 8:44 PM\n\nHi t2p21 - thanks for the feedback. In the options menu under 'VR camera' you can change to 'double click' which will prevent accidental camera switching. Hope that helps! :)", "Skyhawk613May 24 at 9:56 AM\nAmazing! Buy it!\n\nThis is an amazing racer!\nI bought this game day one when it first released on PSVR. I loved everything about this racing game and was so very angry when Polish Paul VR gave it an unjustly bad review causing other copycat reviewers from PSVR to undermine this amazing racer!\n\nI bought a VR ready PC and the Oculus Quest, and so happy Mini Motors has now released on the oculus platform and is receiving the positive reviews and ratings it truly deserves. I'm loving every moment racing in this game.\n\nI love all the different views provided for racing and particularlyI love racing inside the cars in first person on hard difficulty. Working mirrors would be welcome addition please.\n\nRegardless of mirrors, this game is a true AAA perfect five star racer , if you have any doubts - don't think just buy it!\nIt's a must have for any VR Racer fan!\n\nI would love to see a track editor added to the PC version that could share tracks on the quest please.\n\nI'm also a great fan of futuristic racing like Wipeout VR and would love to see a VR futuristic racer from this wonderful developer as dlc for Mini Motors or even as a new separate title please.\n\nThank you developers for a fantastic racer\n\nHelpful | 3\nDeveloper ResponseMay 25 at 5:13 PM\n\nThanks for the fantastic review, alan.mendelsohn.7524! So pleased to hear you've been enjoying the game and thanks for the suggestions! :)", "LyonzVrMay 21 at 11:58 AM\nBest Racing Game On Oculus \n\nGrowing up extremely addicted to mario kart ,crash bandicoot , and rocket league this game took the cake for me man....I mean i'm literally sitting inside the car DRIVING! The scenery is so vivid and colorful. so don't want to spoil to much all i'm going to say is after one race you will never want to take a break lol! -ps I just went number #1 on the two tracks on quick race see if you can beat that \n\nHelpful | 3\nDeveloper ResponseMay 21 at 11:55 PM\n\nGreat to hear you're enjoying the game, LyonzVr! Thanks for the awesome review :)", "mcpishMay 22 at 3:13 AM\nSuper Sprint & Super Off Road Racer VR\n\nThis is a fantastic title. This game is very much in the spirit of the classics like \"Super Sprint\", \"Super Off-Road Racer\", and \"R.C. Pro Am\". I loved those classic games for their overhead view and fortunately that's exactly how you can play this. The difference is that this actually feels like a large tabletop model spread in front of you with toy cars on it. It's really quite delightful. I hear some comparisons to Mario Kart but I wouldn't say that. I get a feeling it's mostly the young'ins that had never actually played the 3 games mentioned earlier (which are all over 25+ years old) that are saying that (I'm 42). I didn't care much for the 1st person view myself as it DOES make me sick, plus I really don't think it actually fits with the vibe of this game in my opinion. To me, it doesn't feel like this game is \"supposed\" to be played in a 1st person view but that the developers probably felt the need to tack that on to be considered a \"modern\" game. In my opinion, this game is best played in the 3rd person view similar to the old Super Sprint, Super Off-Road Racer, and RC Pro Am games. It's like the ultimate version of those games. In this context, the short courses make sense since it's like you're literally looking down on a big tabletop that could, in theory, fit the whole course on it if it was built out of paper mache` and other materials. You look down and left/right around the big virtual racetrack board in front of you as you play, as if you were playing it at some big comic-con convention booth or something. One suggestion, I'm glad the game has a variety of pre-set 3rd person views of the course, but if you could allow people to teleport to any arbitrary spot around the board to watch the race, at any particular distance, that would be swell :-).\n\nHelpful | 3\nDeveloper ResponseMay 22 at 3:47 PM\n\nThanks, mcpish! Super Off-Road and other games of it's ilk were certainly big inspirations for the game :) So many great memories playing them in the arcade back in the day...thanks again!", "iphongxJun 14 at 12:45 AM\nShut up and just buy it\n\nBest game i've played on the Quest ever. If you fimiliar with RC car racing you will love the top down view. Lots of beautiful map to choose from. I wish there is a multiplayer mode, so i can challenge people around the world.\n\nNote to the dev: it's very hard to press the virtual ui button to select cars and tracks.\n\nHelpful | 0\nDeveloper ResponseJun 15 at 4:54 PM\n\nHi iphongx - thanks for the review! The entire game can actually be played in multiplayer, either random or via invite - from co-op campaign to quick race and Bumper Ball - everything can be enjoyed online with friends :) Thanks again!", "flemdog169Jul 1 at 5:18 PM\nFun game!\n\nReally liked this one! Many play options! Very addicting! If anything could improve it would be showing car damage however that maybe does not apply to this game theme. Will be playing this one awhile!\n\nHelpful | 0\nDeveloper ResponseJul 2 at 11:14 PM\n\nGreat to hear, flemdog169! :)", "Rayla840Jun 12 at 1:07 PM\nVery Fun Game\n\nI really like this game. Only issue I have is that the camera view switches too easily. I'll be racing along inside the car and out of nowhere, I'm above the course like I'm watching the race from a blimp or hot air balloon. So that gets frustrating. I just started playing it. So I'm hoping I'll find a way to fix this problem.\n\nHelpful | 0\nDeveloper ResponseJun 13 at 4:17 PM\n\nHi Rayla840 - there sure is! In the options you can change the VR camera switch option to 'double click' which should prevent accidental switching :)", "michael.alcoverMay 19 at 1:53 PM\nGreat Game for everybody\n\nGreat menu, a game with a lot of content, many cars and circuits, and different game modes, a great online and a good learning curve and difficulty, it also comes with comfort options for all types of player. If you are looking for a simulator you will not find it here, but if a great arcade with touches of strategy can help me to improve your vehicles. My only regret is having a circuit with some design difference, some slopes up or down, or with longer lines at certain times, which would provide more contrast between circuits. But its shortcomings are very few and I think it is one of the most compact games in the catalog to this day. many hours of fun and competition\n\nHelpful | 3\nDeveloper ResponseMay 21 at 11:40 PM\n\nThanks for taking the time to share your thoughts, michael.alcover! Appreciate the feedback :)", "ParcivaleJul 22 at 3:32 PM\nRandom view changing ruined this game\n\nI wanted to absolutely love this game! It's a riot to play and fun to customize the different cars. The tracks are full of detail and the closer your view to the track is, the more vivid those details become. However, I can't tell you how many times I would be in the lead in a race, only to have the view randomly changed to something reversed or \"in car\" and it totally disorients me and I get booted to the back of the pack. The developers MUST have a way to lock in a view! Every time the view changes I'm frantically hitting the view button trying to get back to where I once was, sometimes cycling through 8-10 different angles, all while maintaining my position in the short 3 lap races. I just can't play this game anymore until this is corrected... waste of $25!!\n\nHelpful | 1\nDeveloper ResponseJul 23 at 4:11 PM\n\nHi Parcivale - indeed we do. In the options menu under 'VR camera' simply change to 'double click' which will prevent accidental camera switching. Hope that helps!", "GeeBee2May 18 at 10:45 AM\nBrilliant!\n\nI've had the Quest since launch day and what I really want is a great flight sim and a great racing game. This ticks the latter perfectly. I knew it would be good as it comes from the studio that produced Rush, one of my all time favourites. I tried in car view and was a bit overwhelmed, I moved to the view just above the car and wow! Stunning racer. My favourite bit is pushing the nitro on the last hill on the Monaco circuit, a real woohoo moment. Haven't tried weapons yet but I love pure racing anyway. I'm trying the in car view now, trying to get used to it. Longer circuits would be good but that's just my petrol head asking. Can the devs please bring us a flight sim using the same game engine, perhaps even a space sim? Thankyou for a fantastic game!\n\nHelpful | 3\nDeveloper ResponseMay 18 at 2:59 PM\n\nThanks, GeeBee2! Appreciate the long-time support! We've certainly got more things cooking for Quest ;)", "Tolien9 days ago\nThe tracks are way to short!\n\nAs great as it could be, the tracks are the size of my living room.\n\nHelpful | 2\nDeveloper Response6 hours ago\n\nHi Tolien - try giving the Micro Motor Racing mode a shot, it'll make the tracks seem twice the size :)", "Makatak_May 20 at 3:17 AM\nWow\n\nThis is so fun to play. I never realized how interesting it would be to have the option to drive the car from a gods eye view. Plus there are 3 different control options and they each have their advantages.\nWish the tracks were a bit bigger but whatever this game is still awesome!\n\nHelpful | 3\nDeveloper ResponseMay 21 at 11:44 PM\n\nThanks, Makatak_! Glad you're enjoying all the possibilities :)", "Low_BatteryMay 17 at 12:39 PM\nGreat fun with friends\n\nFinally a great kart racing game on the Quest.\n\nThe physics of the cars is superb. Very easy yet rewarding to get the feel for how to drift through corners.\n\nSome really unique driving perspectives, like viewing from just above and behind the car. It limits motion sickness while evoking the feeling of driving a kart racer. You have transparency on the perspective your opponent is using based on the position of their helmet.\n\nHUGE inventory of cars and tracks. Cars are customizable with different livery, and tracks offer both daytime and night time settings. Tracks are short, but rewarding to master. Great for casual gaming.\n\nHigh quality graphics with some really nice subtle touches like lens flare from the sun and light beams coming through the garage door when selecting your car.\n\nThrow in multiplayer action with friends and this is a no-brainer to buy.\n\nEDIT:\n\nA few nits after extended gameplay.\n\nThere is a huge advantage to leading the pack. You collect more turbos which extends your lead, and collect more cash to upgrade your car. In battle mode the leader gets just as powerful weapons as anyone else. There should be more balancing like Mario Kart, to help keep these races tight and fun for everyone. Avoid placing turbos on the track where the leader can get them and dont give land mines to the leader.\n\nWith upgradeable cars it can be difficult to create a fair race in multiplayer, especially when bringing in new players. Limit the dollar amount of upgrades and let people tweak their cars based on a budget.\n\nCo-op multiplayer only delivers achievements to the host, which disincentivizes participants.\n\nHelpful | 3\nDeveloper ResponseMay 16 at 6:24 PM\n\nThanks for the fantastic review, Low_Battery! Very much appreciated :)", "NamaslayJul 13 at 12:18 AM\nMust Have\n\nI was hesitant to get the game....BUT something said get it. Omfg Im a race car driver!!! Lol amazing game...great scenery.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 11:27 PM\n\nThanks, Namaslay!", "KnittelManMay 18 at 1:56 PM\nReplay value!\n\nUPDATE: I have to add another con. They have the controls set to where you push the right thumb stick and it changes your view and if you hold it it moves as well. The problem is that also the thumb stick I use to steer so Ill be driving in ankk no intense race and BAM all of a sudden Im completely thrown off because my perspective has changed and I lose the race. There needs to be a way to modify the controls.\n\nNot a lot of VR games on the quest have a ton of replay value. That is until this game! Lots of pros and I only have one negative that kept me from giving it 5 stars!\n\nPros\n-TONS of tracks and environments.\n-Different perspectives to play with (in the car, behind the car, multiple angles above\n-MANY ways to play! With the controllers, a steering wheel, an RC controller, etc.\n-just race or use weapons!\n-day, night, weather, each track can feel different depending on those types of things!\n-tons of vehicles, plus customization of each vehicle both within performance and look\n-customize your own look woth headgear, gloves, and steering wheel\n-SO many modes and games like bumper ball!\n\nWhen you take into account play style, perspective, customization, weapons or just racing, just one track can be played a billion different ways, and theres so many tracks!\n\nCON\n-tracks are to small and short. This is my one issue with this game and its decent. I remember the days of Mario Kart and having these huge epic tracks! You can do one lap with these tracks in less than a minute and the races are sooo short! Wouldnt be an issue but for me it can cause some motion sickness because you are flipping a U turn every half second about 1 million times. If the tracks could be much longer or at least have a couple tracks that were much bigger, it would be less strenuous on the eyes sometimes.\n\nOverall though, this game is a blast, and you can play it over and over again! DEFINITELY worth a purchase!\n\nHelpful | 4\nDeveloper ResponseMay 18 at 2:49 PM\n\nHi KnittelMan - thanks for the review! Just a note about the stick control camera changing, we have already developed a method to prevent this happening which will be rolled out in our first patch coming soon :)", "djeli1Jun 5 at 1:28 PM\nBest driving game on Oculus Quest\n\nNot many driving games on Oculus quest but I played about 3 and I really didn't like then I'm not gone back into them but this one I actually like it the campaign is good driving good cars that you can boost up your cars and new cars best car game on the quest not played multiplayer yet but will do if like me you didn't really like the other racing car games on the quest try this one you won't be let down very good game\n\nHelpful | 1\nDeveloper ResponseJun 8 at 5:12 PM\n\nThanks, djeli1! Appreciate it :)", "vanfanelMay 17 at 3:44 PM\nDecent RC Racer\n\nIf youre a fan of blazerush on the rift/go this may scratch that itch a bit.\n\nPositives:\n\n+ graphics are top notch\n+ sound/music is nice for this type of game\n+ 52 total tracks! 26 locations with day and night cycles\n+ career mode with wide variety of upgrades\n+ lots of options whether you want to race in cockpit or out\n\nNegatives:\n\n- could use a few more weapons and have them laid out on the track. Waiting for an entire lap to get a weapon makes them less useful.\n- multiplayer issues. From what I can tell once you get matched up with at least one person a timer starts and once that ends no other players can join in. New players cant join your current matches game and you cant invite anyone else in either. With a small player base itll be difficult to play with more than one other person unless you party up with your friends. Let us join in session games!\n- the rocket league mode in the game is only 2 vs 2.\n\nThis is a great single player game with a career mode that should keep you entertained. If you were hoping for the next blazerush you could be disappointed. The multiplayer part of the game needs improvements to get larger games going. As it is the multiplayer aspect will die down quickly with this match making system.\n\nHelpful | 3\nDeveloper ResponseMay 17 at 5:48 PM\n\nHi vanfanel - appreciate the review! Actually, when it comes to multiplayer, all the features you requested are in fact implemented :) Once a random party has been created, new players can join however only at the end of a race and before the next one starts (this makes sure we don't have players waiting around for races to finish). If you create a private party, you can invite any of your friends any time and they can come and go as they please. In addition to these features, we have the cue system where players can join an online random cue (if there is currently no game available to join) and continue playing any of single player content in the game while they wait. Also, Bumper Ball supports as few as 1v1 right up to 4v4 in either single player with bots or with friends. Hope that helps! :)", "davidmmxJun 21 at 12:10 PM\nNot my cup of tea\n\nI bought this right away because of the premises:\n- Different cars that you would unblock by progressing in the game\n- Weapons :D\n\nI was a big fan of Mario Kart and Rock & Roll Racing (SNES game, I'm a little bit old), and this game looked like the future of those games.\n\nThe bad points are:\n- You'll get sick to death. This is not that bad, as I think it's something that you can train. If I kept playing I'd overcome it for sure\n- Circuits are very short. Apparently some people see this as something good, but I don't. Maybe if they were double their current size they would be ok, but not as they are now.\n- Not so many weapons. I haven't played many races, TBH, but from what I've seen there aren't that many weapons (not talking about variety, but even their anecdotical presence)\n\nSo, to sum it up, I regret buying it. I'm still giving it 3 stars because at technical level it's quite good; it's just the mechanics of the game what I think are lacking.\n\nHelpful | 2\nDeveloper ResponseJun 21 at 11:06 PM\n\nHye davidmmx - try giving the Micro Motor Racing mode a try, it'll make the tracks seem twice the size :) Also, we spent a lot of time creating dozens of comfort options for those users keen on playing in-car; be sure to give those a try.", "Flame_SlingersJun 2 at 11:58 PM\nNot enough people tho! \n\nI love this game like I absolutely love it! It gives off cartoonish Forza vibes and its awesome! I just wish I didnt have to wait in a game queue for like 15 minutes just to play with only 1 person. I dont know if Im trying to queue up super late and there arent any people on or what, but I just wish there were more people to play online with! \n\nHelpful | 1\nDeveloper ResponseJun 3 at 12:23 AM\n\nThanks, Flame_Slingers - we're working on building the community as the game is still new but things should improve over the coming weeks :)", "MR.KING.KJun 3 at 8:08 AM\n9/10\n\nFor me, like wow this game is a gem, as a kid I was in love with scale electrics and this game kills it on so many levels and the controls on this game is sooo sweet and the camera angles  amazing. Please VR GAMERS BUY THIS GAME \nPs Ive not said enough \n\nHelpful | 1\nDeveloper ResponseJun 2 at 1:46 AM\n\nReally appreciate the support, MR.KING.K! :)", "ZedisnotdeadMay 30 at 4:46 PM\nGreat game. Had a small glitch but fixed\n\nSo I have had this game for a week or two and love it. Play it everyday only this morn when I got up to play it there was this black block in the middle of the screen and the background was all glitched out. Can't play it. It will load but then goes right to this glitched out screen with a black block in front of me. Please help....I would love to give 5 stars\nEdit....devs got back to me quick ....I restarted my quest and the issue was fixed\n\nHelpful | 0\nDeveloper ResponseMay 30 at 4:04 PM\n\nHi Zedisnotdead - sorry to hear of your issue. Have you tried to restart your Quest? If you could kindly reach out to us via https://thebinarymill.zendesk.com/hc/en-us/requests/new we'll be better able to support you directly. Many thanks.", "YT_V.R.CJun 9 at 1:20 PM\nBUY IT!\n\nThis is the BEST racing game on the quest!\nThe controls/game modes/loads of maps are the icing to this game!\nBut the BEST part is the different camera angles giving you each a very different perspective then the other! Great game BUY IT!\n\nHelpful | 0\nDeveloper ResponseJun 13 at 4:21 PM\n\nGreat to hear, YT_V.R.C! Appreciate the review :)", "pfrfMay 21 at 7:16 AM\nfun game but...\n\nNice game (tracks are too short) but it has decent graphics and sound, not top level but okay.\n\nI give it four stars but I think it's a three and a half star game. It's a fun game to play top down, but the view from inside the car made me feel sick instantly. I've never felt this bad playing a Quest game before. I got a little dizzy using the ISS app, but other than that I've been happily flying and zooming around in vr without any motion sickness trouble. I set the controls for slow speed and followed instructions to make the game less dizzying, but the nausea hit hard after just a few seconds.\nI've had some headaches from the uncomfortable Quest headset that almost made me give it up. After experiencing the vr motion sickness I've decided I've had enough, I don't want to try again. I'll check back in a few years but for now, headset for sale.\n\nHelpful | 2", "Hoshi82May 16 at 11:59 PM\nFinally A Top-Down Racer In VR\n\nGrowing up with games like Racing Construction Kit (C64), Super Cars (Amiga) or the Micro Machine series on pc and consoles I just love these top down racers. Always wanted this kind of racer in VR where you look down on a small (toy)model with a racing track on it and...well race with some minature cars. With this game I can finnaly do this in VR.\n\nKnowing that the original game was for mobile it is no suprise it runs well on the Quest. Also the graphics are really crisp for a Quest title and compared to the pc version you don't really miss out on that much details (sharper textures, some more reflections, more shiny water).\n\nBut one little nitpick I have...many of the tracks I wish would have been longer and can feel pretty short. Not lap wise the actual lenght of the tracks but maybe the areas would get to big. But due to really fast loading times on the Quest the game has a good flow to it.\n\nHelpful | 2\nDeveloper ResponseMay 16 at 2:30 AM\n\nHi Hoshi82 - many thanks for the feedback! Just so you know, the game does support cross-save across Rift and Quest so you should be good to go there :) Let us know if you have any issues with it here https://thebinarymill.zendesk.com/hc/en-us/requests/new and we'll get right back to you. Happy racing!", "joedav8May 25 at 10:53 PM\nSo diverse and fun\n\nThe amount of different options and ways to play is pretty staggering. From steering controls being motion vs analog to the 3rd person (with even being able to choose your spot around the map) vs 2nd person vs 1st person viewpoints to being able to toggle modes with powerups on/off. Very well done. The graphics are solid and the maps are pretty cool. The topdown 3rd person mode is awesome but seems a little more difficult than Blazerush but just as fun (controls feel different). It legit feels like racing RC cars (or even hotwheels depending on the scale you choose).\n\nIt's true that the maps are pretty small and laps kind of fly by without any real straight aways but I really didn't feel like that was an issue once I was actually playing. In fact the frequency of turns as well as the angles makes it feel more fun and arcade like, almost like racing go karts IRL. So while it is different than Mario Kart in this respect, it fits the game better imo, Dash Dash World seems more similar to Mario Kart so both will have their place.\n\nHelpful | 0\nDeveloper ResponseMay 26 at 5:38 PM\n\nThanks so much, joedav8! Really appreciate you taking the time to share your thoughts on the game :)", "OcuQuesterMay 25 at 6:59 AM\nBest game on Oculus Quest\n\nI fell in love instantly with the game. I have tried a lot of games and I am and avid VR gamer. Many ways to pilot the cars, many cars to chose from, many tracks, nice graphics, absolute fun. Multiplayer makes it really exciting. You can pilot a RC vehicle from many points around the map or you can hop in the car directly. A lot of fun with the bumper ball which is a soccer game but you push the ball and try to score with your car. Waesome game. Nohesitations if you like driving games. I LOVE this game!\n\nHelpful | 1\nDeveloper ResponseMay 25 at 5:17 PM\n\nThanks, OcuQuester - LOVE this review! :D", "ParadiseDecayJun 9 at 11:19 AM\nTracks too short and dizzying!\n\nImpressions Video with Commentary:\nhttps://www.youtube.com/watch?v=UtmjhOZJpJM\n\nMy Initial Impressions:\nThis game is from one of my favorite developers, gameplay and quality is solid but I long for longer tracks.\nIt sometimes feels like you are just going round in circles.\n\nHelpful | 3", "jayokayatgames25 days ago\nEhh\n\nIt's not the best game. i feel like i wasted $10 in store credit on a game which made me feel motion sick in the first hour of gameplay.\n\nHelpful | 1", "dodgehawkMay 18 at 1:48 AM\nVR Arcade\n\nThis reminds me of one of those large sit in console racers in an arcade but more immersive in VR. Its done well. Its purely fun. I mostly enjoy simulation type games, but this is just undeniably a blast to play.\n\nHelpful | 3\nDeveloper ResponseMay 18 at 4:14 AM\n\nThanks, dodgehawk - got to love those classic Sega arcade racing cabs! Thanks again for the review :)", "SkynyrdFPVMay 18 at 2:04 PM\nJust what I was looking for...\n\nIve been waiting for a fun driving game and this is it...whether a quick blast or a good session its just a fun game with loads of tracks and cars, graphics are brilliant. Hats off to the devs on producing an awesome fun packed game, Highly Recommend\n\nHelpful | 2\nDeveloper ResponseMay 18 at 2:58 PM\n\nThanks, SkynyrdFPV! Great to hear your feedback :)", "phaneronZMay 19 at 12:15 PM\nHas potential...\n\nThe single player career gets boring very quickly. The many tracks dont feel different enough to make a new track you havent raced before feel fresh at all. Its all very repetitive.\n\nHowever, I feel where this game shines is the multiplayer. Too bad youre waiting so long for a race you turn it off after 5 races against the CPU.\n\nAs its still pretty new, Im hopeful therell be more players joining but even with that, this game couldve been so much more with a bigger range of weapons and more thought put into track design.\n\nA bit of a let down.\n\nHelpful | 6", "bruceo2May 24 at 8:35 AM\nGet it now!\n\nPlayed many multi-player hours of this on mobile with my son and was awesome. This takes it to another level. With the depth and variety added to this version it makes it an A rated title worthy of the price. Another great job by Binary Mill.\n\nFeedB It would be nice to disable change camera on primary steering stick to prevent inadvertent camera change. Using this model to create a demolition derby style racing game like the old Playstation destruction derby would be amazing. You had to manage the racing as well as the damage you took that made it tougher to race with a debilitated car.\n\nHelpful | 1\nDeveloper ResponseMay 24 at 3:28 PM\n\nHi bruceo2 - many thanks for the great review. Always great to hear from people whom have been enjoying the franchise since the mobile days! :) In regard to the accidental camera switching, there's an option to change this to a double click in the menus which should solve that problem for you. Thanks again!", "alextron69May 25 at 8:25 AM\nGreat racing game\n\nFirst impression after 60 min of gaming.I only played on the side of the track mode since I'm a fan of RC Pro-Am. Everything is great from A to Z like most of reviews report .What stands out the most is that the game runs very well with insane graphics in vr. It's hard to believe It runs so nice on the Quest. Just buy the game period! A few suggestions to the developers about choosing and setting the camera angle on the side of the track. 1- each camera should have a height adjustment. Let's say from 3 different levels. For example, there's a camera angle that I like but the view is to low so I have to stand up to make it perfect. 2- before the start of a race, we should be aloud to use the right controller to teleport between cameras or doing anything else instead of having to look for the left controller to do so. 3- once I chose my favourite camera and It's height, It should stay as the default one for that same track.Having to choose my camera again even on a RETRY race was kind of annoying. Finally, when our car is hidden by objects , can you make these objects become more transparent instead of just drawing that section of the track with orange lines? Also, It would be nice to have buttons configuration so we can , for example, press the grab button for the nitro instead of the A button when playing with the controller. That way, we can keep our thumb on the analog stick. Right now, I have to use my left thumb to press on A so that I can keep the right thumb on the analog. I hope you can do something about those suggestions. Thanks.\n\nHelpful | 1\nDeveloper ResponseMay 25 at 5:30 PM\n\nMan thanks for the review, alextron69! Great to hear the RC Pro-Am vibes are shining through :) In regard to some of your feedback; 1) we are looking into even more camera flexibility though we need to be careful we don't overwhelm new players with too many options. 2) we are looking into ways to allow for custom button mapping which would allow you to set this up to your desired configurations 3) Agreed - we'll address this in a future patch. Thanks again!", "awesomeness0133Jun 24 at 9:54 AM\nAmazingly immersive\n\nThis game is just like youre driving a real car! There are so many different view modes that the options are endless. Totally worth the $25!!!\n\nHelpful | 0\nDeveloper ResponseJun 25 at 10:47 PM\n\nAppreciate that, awesomeness0133! :)", "Greekspartan121May 24 at 9:08 AM\nThe Quest needed this,Great.\n\n24th May Update again,lol.\nBack to 5 Stars,as the new camera view button that was recently added works a treat,very difficult to press whilst driving.Thanks Dev for the quick reply and updating me that you just dealt with this 8ssue and added a function to resolve it and it has.5 stars.Thank you.\n\nUpdate,been playing for a while now and one thing that's really annoying me now and that's why my review has dropped 2 stars.While your playing and the views switch and puts you right off as I sit in the last position outside the car.Next minute your looking at an air view.\nAs a suggestion, can't you make it that that steering controller doesn't activate the different views?? So they work the opposite for left and right handed.\n\nI was looking forward to this rc racer to be released once I heard about it.Quest does not have any decent racing games,it's like micro machines but so much better and vr.\nIt's fun, it's colourful and the environments around the tracks have so much detail.\nSmooth game play,loads of different angles and loads of levels,get your money worth,well worth the price.\nThis is a must buy for any racer.\nLook forward to future updates,thanks Dev for a great little fun racer.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 3:42 PM\n\nHi Greekspartan121 - we actually added an option for this exact issue :) In the menus, there's an option called \"VR Camera Change\" so simply select \"Double Click\" for this option and it will be far more difficult (hopefully impossible) to accidently change camera views while racing. Let us know how you go!", "richleesonMay 20 at 7:48 AM\nJust what ive been waiting for!\n\nIve been waiting for a fun little racing game to come to the quest and this absolutely ticks all the boxes.\n\nVery fun gameplay, nice graphics, huge amount of tracks, multiplayer. Could not ask for more really!\n\nIve just beat the beginner championship and im absolutely loving it! If you have any appetite at all for a racing game on the quest then you need to have this in your library.\n\nHelpful | 1\nDeveloper ResponseMay 21 at 11:45 PM\n\nAwesome to hear, richleeson! Thanks for the review :)", "Tuxedo-CharlieMay 20 at 1:28 PM\nReally fun relaxing game\n\nI was not sure what I was getting into, it feels like an RC game with plenty of tracks, way plenty. It also has a behind the wheel view which is also fun. The rocket league game is fun also, it's in VR so it's better already.\n\nEdit: I know this has nothing to do with this game, but what are you thinking at Facebook/Oculus on the approval system? This game got accepted but an equally good game called \"Touring Karts\"that takes a whole different approach, is denied quest store access. I have to say stupid move, both games would pitch each other, I think It is a terrible idea to keep denying the developer of Touring karts.\n\nHelpful | 1", "SurfheartMay 19 at 12:54 AM\nGreat racer with heaps of depth\n\nThis has become my favourite racing game on the quest. I love the diorama style views but it is so cool to race in the first person view. At first I thought this would be a simplistic arcade racer but there is a lot of hidden depth here with a car upgrade system, heaps of tracks and environments and lots of different cars. The attention to detail like birds and wildlife, hot air balloons, boats and so on really help bring the environments to life.\n\nHighly recommended!\n\nHelpful | 0\nDeveloper ResponseMay 19 at 1:27 AM\n\nMany thanks for the kind words, Surfheart! Much appreciated :)", "eapleasantJul 9 at 3:53 PM\nSo cute\n\nI really wanted a first person driving game and this is perfect.\n\nHelpful | 0", "xxae8May 19 at 9:33 AM\nAmazing, probably the best game however.\n\nA great game! It as so many modes and doesnt make me feel to sick personally. You can change the sickness settings. It has so many maps to go through and each one is really high quality. Its also awesome that you have the option of what view you want to be in whether your inside the car or outside. The ways you can drive is awesome also. I like the ball bump game mode, and the other game modes also.\nIt would be better if there was a race map that you could see where the other players are. It would also be good if the interior looked different for each different car as they all look the same unless you customise them. It would also be good if you said how to pick up the power ups in the non-classic game mode because i still have no idea. Also could you add a multiplayer option as there isnt one yet.\n\nHelpful | 1\nDeveloper ResponseMay 17 at 3:34 PM\n\nHi xxae8. Many thanks for taking the time to post a review! In answer to some of your questions, in Type X races (combat), players receive a random weapon each time they complete a lap. Note that this power up is weighted depending on your position in the race; i.e. if you're in 1st you're more likely to get something less useful like a wrench, but if you're coming last you're more likely to get something very useful like the tornado. The weapons are designed to bring balance to the field to ensure everyone has a chance of winning :) As for multiplayer, I think I can confidently say we currently have one of the most complete and robust multiplayer offerings on Quest! :) If you look at the bottom of the screen in the lobby, you'll see the Party Bar. You can invite your friends into your own party (for competitive or co-op) or simply join some random players in any of the modes the game offers. Good luck out there and thanks again! :)", "Bender_2112May 17 at 11:55 AM\nAddictive\n\nIm usually not into racing games but this is pretty fun. Lots of cars and tracks to choose from. I also like the many camera angles. One minor complaint though... I like steering with the thumb-stick but sometimes i accidentally click it and the camera angle switches and throws me off. Is there a way to lock the camera angle?\n\nAnyways, still very enjoyable.\n\nHelpful | 1\nDeveloper ResponseMay 17 at 3:20 PM\n\nHi Bender_2112 - many thanks for the feedback! I'll be honest, we've done that same thing more than once in testing...we'll see what we can do about it in the next patch :) Thanks again!", "InTheCards35May 16 at 4:52 PM\nFantastic...\n\nGreat game. Beautiful and vibrant graphics. Awesome soundtrack. My only complaint is the in-car view (and view from roof). As a vr racing game, Im not sure if anything can be done to help, but it causes serious motion sickness due to the jerky camera. Wish it was a little smoother. Outside of that, sweet game!\n\nHelpful | 1\nDeveloper ResponseMay 16 at 5:40 PM\n\nHi InTheCards35 - appreciate the feedback! When racing in the cockpit were you using the analogue stick or the virtual wheel? For maximum comfort, we recommend using the virtual wheel when playing in-car. Also of note, the steering sensitivity can be adjusted in the menu for your preferred control style which will help with feeling 'smoother'. Hope that helps! :)", "AlabasterSlimMay 21 at 4:31 AM\nFun on a Bun\n\nThis game is fun on a bun. I like to play it with my friends. We sometimes have trouble getting connected, and once we are connected we can get lost in the menus and can't get back to party mode. However, the fun of the game itself overshadows everything else.\n\nHelpful | 0\nDeveloper ResponseMay 21 at 11:48 PM\n\nHey AlabasterSlim - thanks for the review! You'll also be happy to learn that today's patch has made it easier to access Party Mode with a new menu option :) Thanks again!", "hawkenMay 21 at 9:55 PM\nReally great\n\nThe developers have pulled out every last trick to make this a 1st class game on the Quest.\n\nMy only gripe is that brake doesnt override accelerator if both pressed at same time.\n\nHelpful | 2\nDeveloper ResponseMay 21 at 11:58 PM\n\nThanks hawken - Great to hear you're enjoying the game! I've passed your suggestion onto the team :)", "Red_RoninMay 24 at 2:11 AM\nRoad to Redemption\n\nI bought this shortly after release and had severe motion sickness from both the in car and follow car cameras. To the point where I requested a refund and didn't want to use the Quest again for two days.\n\nOver the next couple of days I wondered if I'd just got off on the wrong foot with the game, so to speak, especially given the majority of reviews are overwhelmingly positive. Knowing I wouldn't be able to refund again if I re-purchased, I decided to trust my instincts and give MMRX a second chance. I'm happy to report that I'm glad I did!\n\nI set all the comfort options to maximum and have been using the various third-person camera views, which has been far more enjoyable. This game is clearly a labour of love from the developers, and it shows - from the wealth of game modes and options (giving players the option to choose how they want to play is something many other devs could learn from) to all the little graphical details. Plus the devs responsiveness here to feedback on the reviews.\n\nIdeas / Areas for improvement:\n\nA \"Le Mans\" / \"Formula 1\" style game mode:\nPremise: Longer races (possibly even endurance races) which require \"pit stops\" - to add an additional layer of strategy. This could be done either through \"degradation\" of tyres, fuel consumption, or, if that's too big a change to the game code, simply through a requirement to \"pit\" every (x) laps (perhaps calculated as a % of total laps in the race). Once the driver enters the pit lane / area, they must stop on a car sized \"zone\" in order for the pit stop to activate. This added skill-factor required by the player would be the difference between a quick, medium or slow pit-stop, and could change the outcome of the race!\n\nMusic:\nMore variety to the track list would be very welcome!\n\nComfort Settings:\nIf there's anything else you can do to make the in-car / follow cams viable for peeps like me, even more of us can fully appreciate your game.\n\nOverall a great game!\n\nHelpful | 1\nDeveloper ResponseMay 23 at 4:11 PM\n\nHi Red_Ronin - this is great to hear! So glad you decided to give us another shot :) There's actually another follow camera option available that is a bit more hidden which might be even more comfortable for you (it certainly was for some people in our studio). Under the comfort settings, there's a setting called \"Car Camera (Follow Mode)\" and you can change it from \"Action\" to \"Fixed\". This camera acts like a 3rd person chase camera that you can also cycle through to find one that might work better for you. It's worth a look and can always be changed back should it not suit you. Appreciate all your suggestions - we have a big list of things we'd love to add over time so we'll be sure to keep them in mind. Thanks again!", "neomilee3May 14 at 11:04 PM\nLoads of fun\n\nFeels like when you go to a Amusement park and youre riding on go carts or bumper cars its really cool\n\nHelpful | 5\nDeveloper ResponseMay 16 at 7:13 PM\n\nThanks, neomilee3! :)", "Karaste3Jun 1 at 3:18 PM\nPure... Octane... Pure addiction\n\nOne of the most polished funny and addicting games of Quest...  When you say to your self one more race.... And 1 hour is passing. Cheers from Greece \n\nHelpful | 0\nDeveloper ResponseJun 2 at 1:45 AM\n\nMany thanks, Karaste3! Greetings from Australia :)", "LesterFreamon2 days ago\nLots of fun, great perspective options\n\nId put this in my must have category of games. You cant go wrong with this; its the type of game everyone will love. Retro oldschoolers will feel nostalgia for RC Pro Am and Offroad but the graphics are new fresh and outstanding. Theres some MarioKart essence in this game too. Having said what I just said, this game is fresh and outstanding.\n\nWhat I love is this game is packed with things to do. Its basically unlocking tracks, cars, and upgrades, but theres a lot so itll take hours and hours to unlock everything. Another phenomenal aspect to this game is the perspectives. RC Car perspective is great, and also the 1st person view from inside or above the car is great. Its almost as if its two full completely different racing games, just being able to change the perspective. Additionally, I love the control of the car, from both perspectives. The above the track view and the 1st person view have no advantage over the other (I had thought initially that the abovetrack view had an advantage over the 1st person racer, but after many races, all views are created equal).\n\nFor anyone without VR legs: This is an excellent game to play to work on raising your tolerance. 1st person driving, its intense comfortable. The designers did a great job making it as comfortable as possible. Its a sensation of driving in a car, and not the usual forward-but-still feeling. The races are short, so if you want to actually train to build up your VR legs, this is a perfect game to work on it. One race, 1st person, and after take your headset off and take a few breaths.\n\nThese arent complaints below, but I could see this game expanding far beyond where its at now. I think throw in even more things to unlock; some longer playtime achievements (beat all tracks in 1st place, hit 5 cars in one race, etc). All kinds of interesting extra achievements, add em in!! and when theyre achieved, the player finds even more things to unlock. For me, I think this game can go overboard with more achievements and more things to unlock.\n\nId love for there to be an option to watch a replay of a race. What id like to see is after I race a race in first person, Id love to rewatch the race in third person. Maybe thered be a few slots to save race recordings in the game? Maybe be able to pin a best race video into our profile?\n\nOf course, user created tracks could be a big breakthrough. User tracks could be submitted, and the best tracks would be voted up by the players. A hangout lobby/sandbox with online racers and just a bunch of cars driving around people editing tracks and chatting would be great.\n\nId love to see a few multilevel tracks, a few 4x the length tracks, some loops, ramps, pits, shortcuts. And especially this one: Id love for there to be a track where you have to change camera throughout the race; the course is designed so the racer will have to click for a camera change because the course is designed so the next click camera view moves to that spot of the course.\n\nMultiplayer is currently confusing for me. Theres a friends list in the game, and theres an invite friends button.... but I dont see a public lobby with a bunch of random people looking for races. Is public multiplayer racing rooms in there and Im not seeing it? If multiplayer exists, or when it comes, I suggest tons of tracking stats, leaderboards,\nextra achievements. Showing off active drivers, their stats, etc, would keep the competition flowing.\n\nHelpful | 0", "GotPalmerMay 18 at 1:18 PM\nfun!\n\ndont read those reviews, just BUY. youll not regret it! Loved when they provide many different view options. Graphics are overqualified - beautiful work!\n\ntwo reasons I rated this 4...\n- career races (difficult levels) - HARD is still too easy. Make it harder somehow.\n- multiplayer (need to add social lobby where we can chat and vote which map)\n- multiplayer (categorize in-car views only, top view with RC control, etc) but this might be a problem if we dont have enough players playing on multiplayer :/\n\nHelpful | 1\nDeveloper ResponseMay 18 at 2:53 PM\n\nHi GotPalmer - appreciate the vote of confidence! :) Just a note regarding a social lobby - we already have a mode called 'Party Mode' which is I think exactly what you're after. You can invite friends (or join with random players) and hang out in a lobby chatting while everyone gets to vote on which race is next. Give it a try! In regard to difficulty, we're keeping a close eye on things and will tweak as required moving forward. Thanks again!", "flojim1Jun 25 at 11:07 AM\nWhose the best driver you ever saw\n\nThe first real deep race on the quest at this point\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:37 PM\n\nGlad you're enjoying the game, flojim1 :)", "DiggyP89May 18 at 5:11 PM\nGreat game with a ton of variety\n\nYou can upgrade your car and tune it up\nLobby is cool everything looks great\nTons of ways to play this game.\nIn the car\nTop down\nOr behind the car.\nMultiplayer is great\nThis game definitely wont get boring any time soon\n\nHelpful | 1\nDeveloper ResponseMay 18 at 10:47 PM\n\nGlad to hear it, DiggyP89 - thanks for the review! :)", "adrain.homesJun 2 at 10:48 PM\nWhat the hey!\n\nI love this game with all my heart but what does the NGR stand for on the barrel of old use oil can?\n\nHelpful | 2\nDeveloper ResponseJun 2 at 1:44 AM\n\nHeya adrain.homes - it stands for NextGen Reality, which is our parent company :)", "hankymanMay 24 at 6:15 AM\nSuperb Fun\n\nAn utterly charming RC racing game. The visuals are a joy, the controls are perfect, and the fun in trash talking your opponents whilst passing them on the outside in multiplayer cannot be overstated.\n\nHelpful | 1", "TigerShark0907Jun 15 at 4:55 PM\nUnfair\n\nThe game is super annoying and unfair. Im on EASY! And in a FULLY UPGRADED super car, and EVERY SINGLE RACE the stupid formula car will pass me no matter what I do. I dont crash or even take turns wide. I just drive around then OUT OF NOWHERE, the STUPID FORMULA JUST BLAZES PAST. How??????\n\n\nI might refund because this happens every race and when I try to pass the formula cars, they go full idiot mode and slam into me like pretty much every car does when you are around them because the AIs dont get any penalty or slow down when slamming into you\n\n\nEdit: I tried the same thing with the touring, sports car, and racer yet no change\n\nHelpful | 1\nDeveloper ResponseJun 15 at 4:52 PM\n\nHey TigerShark0907 - sorry to hear about your frustrations. Have you considered swapping to a different car? Each car has strengths and weaknesses for each of the tracks so it might be an idea to either spec up another car, or you could respec (refund your upgrades on the Super Car) and simply upgrade another. We encourage players to explore the different vehicles on offer :) Good luck!", "TimLee1223May 22 at 3:04 PM\nGood racing game\n\nI like this racing game because its fun, awesome, and fast. The music is awesome, the controls are good, the cars are so great!!! And I like the cockpit view too!\n\nHelpful | 0\nDeveloper ResponseMay 22 at 3:45 PM\n\nGreat to hear, TimLee1223! :D", "KidFromWiganMay 17 at 8:46 AM\nPrivacy\n\nI will not play a game that requires me to give it access to my personal files, photos etc. on my computer in order to play. Its a racing game, no reason for me to agree to such a ridiculous requirement.\nI will be asking for a refund.\n\nHelpful | 9\nDeveloper ResponseMay 20 at 12:39 AM\n\nUPDATE: This has been fixed in the latest hotfix. Hello KidFromWigan - we totally respect your position on this. To clarify, the permissions we request are required to enable cloud saves since the game is cross-buy with Rift/Quest. It's a blanket permission warning that sounds really scary from Android, but I assure you the game only reads/writes save data. That being said, there is currently a bug in the game that if these permissions are not accepted, the game doesn't load for some players. This is being addressed and will be fixed in our first patch to be released shortly. Apologies for any confusion caused here.", "strykermelehes17Jun 27 at 4:54 PM\nGreat game\n\nIt's just a solid game\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:33 PM\n\nAppreciate that, strykermelehes17 :)", "RvilleMay 17 at 6:22 PM\nAny suggestions?\n\nWas very excited for this game for the in-seat (Mario Kart-type) experience, but Im using the steering wheel and immediately getting bad motion sickness. Ive tried adjusting speed, roll and tried other comfort settings to no avail. Can you explain/suggest the best combination of settings and comfort controls to reduce motion sickness? Thanks! I hope that I can get this to work for me because it looks fabulous otherwise. Will post Update.\n\nUPDATE: Thank you for the feedback below. I did each of those things and it helped a little, but not enough for me to be comfortable and get through a race. If anyone is having motion sickness, try the recommendations below, they may work - I guess I just have more sensitivity on this one than normal. Thank you very much for your time, and for trying. Take care.\n\nHelpful | 2\nDeveloper ResponseMay 17 at 6:28 PM\n\nHi Rville - thanks for the review. There are lots of things you can try if you really want to race from the in-car view. First, make sure you're in the second camera position in the car - it's further back which gives you more cockpit to anchor yourself on. Second, change the 'Car windows' setting to 'covered' in the options. Then in the same options panel bring the 'comfort' and the 'smoothing' sliders all the way up (comfort will increase the vignette effect and smoothing will reduce -- in this case eleminate -- the body roll). Also, in the Controls options, you can reduce the steering sensitivity which can help a lot, too. Lastly, when in the car it helps a lot to use the Virtual Wheel and not the stick - just reach out, grab hold and steer! If none of those help, then we'd suggest moving to outside the car making sure the comfort slider is still all the way up. Hope that helps and happy racing! UPDATE: Sorry to hear that, Rville. This is part of the reason we have so many other ways to play. Hopefully you're having fun with one of the many other camera views available. All the best and happy racing! :)", "NightMonk3yMay 31 at 3:33 AM\nFun!\n\nGreat game but the racing tracks need to be extended\n\nHelpful | 2\nDeveloper ResponseMay 31 at 4:41 PM\n\nGlad you're having fun, NightMonk3y :)", "westley93May 19 at 1:13 PM\nOne of the best graphically and gameplay\n\nBy far my fav quest title to date, I would love this developer to make more racing games maybe some more derby based would be wikid cool but yes this is dope for sure\n\nHelpful | 1\nDeveloper ResponseMay 21 at 11:40 PM\n\nMuch appreciated, westley93!", "jmman44Jun 2 at 8:09 PM\nGreat, re-playable fun!\n\nSo many cool little details and fun tracks and different game modes make this title great fun.\n\nHelpful | 0\nDeveloper ResponseJun 3 at 12:21 AM\n\nAppreciate that, jmman44 :)", "BeatzCreationsJun 8 at 11:59 PM\nAwesome\n\nUpdated after developer replied with query i had... AWESOME GAME! Must buy!\n\nHelpful | 1\nDeveloper ResponseJun 8 at 5:11 PM\n\nHi BeatzCreations - when your sister loads into a single player game after having played with you, she will unlock all of the same progress you earned together. Hope that helps! :)", "N1tramMay 15 at 7:54 AM\nAwesome!\n\nThis game is pure fun! Amazing that it runs so well on the Quest, must be some kind of black magic!\n\nHelpful | 2\nDeveloper ResponseMay 16 at 6:27 PM\n\nThe dev team have a bubbling cauldron that I'm too scared to ask about... ;) Thanks for the positive feedback, N1tram!", "aaron.sommers.1253May 26 at 9:59 PM\nFantastic Game\n\nThis game is so good, tons of tracks, and the graphics are amazing. I am really happy with my purchase.\n\nHelpful | 0\nDeveloper ResponseMay 27 at 10:32 PM\n\nThanks, Aaron! Always great to hear :)", "buzzin247Jun 7 at 7:04 PM\nGreat\n\nLove the game best racing game\n\nBut Needs more cars\n\nHelpful | 0", "PX4StormZ33May 20 at 10:13 AM\nGreat fun and replay value!\n\nAwesome game, tons of tracks, cars, upgrades. Definitely worth the price in replay value alone. You wont regret this purchase!\n\nHelpful | 0\nDeveloper ResponseMay 21 at 11:45 PM\n\nAppreciate that, PX4StormZ33! :)", "X_IAN_XMay 23 at 7:19 AM\nGreat graphic\n\nThere's a lot of modes to try. Nice graphic, but the gameplay is a bit hard to beat other opponents. Still, this game deserve 5 stars.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 3:44 PM\n\nHi X_IAN_X - appreciate the review! Just a note regarding difficulty here, you're actually able to change the difficulty in the career (upper top left of the screen when in a championship) from easy through to hard. Hopefully that helps you out :)", "Aaronb3434May 16 at 12:37 AM\nCool\n\nBut the reason i gave it 4 stars cause i think all the environments need a whole detailed backgrounds not void. but other then that i love it and its a pretty cool racing game. cant wait for cool updates and improvements.\n\nHelpful | 1\nDeveloper ResponseMay 16 at 6:17 PM\n\nThanks, Aaronb3434. We're already pushing the Quest pretty hard so there were some concessions we had to make ;) Glad you're enjoying the game!", "Deadpool2896May 24 at 8:35 PM\nRacing\n\nAs far as racing games this is a great title, its fun and shows off what can be done in the future\n\nHelpful | 0\nDeveloper ResponseMay 25 at 5:16 PM\n\nThanks, Deadpool2896! :D", "omega911Jun 2 at 11:50 PM\nNailed it\n\nFun game Mario cart meets twisted metal good times\n\nHelpful | 0\nDeveloper ResponseJun 3 at 12:22 AM\n\nHigh praise indeed - thanks, omega911!", "agomez559May 18 at 11:16 AM\nGood racing game\n\nI like it but just one thing. The a.i. racers are to strong the push me into walls I tryed to push them and they dont budge\n\nHelpful | 0\nDeveloper ResponseMay 18 at 2:57 PM\n\nThanks, agomez559! We'll keep an eye on balance and a.i. aggression moving forward and tweak as required...", "BritainthomasMay 16 at 9:26 AM\nGreat game\n\nThis is fun, really well done, and has a lot of good view/control options. Lots of game modes and unlockable stuff to explore too.\n\nHelpful | 0\nDeveloper ResponseMay 16 at 6:05 PM\n\nThanks, masterdogelord! Appreciate the succinct review :)", "dante.cerasuoloMay 15 at 9:12 AM\nGreat racing game\n\nIf your on the edge of this game buy it now its awesome\n\nHelpful | 2\nDeveloper ResponseMay 16 at 6:26 PM\n\nAppreciate the support, dante.cerasuolo! :)", "hieroaplusJun 7 at 6:19 PM\nFun!\n\nI love this game!\n\nHelpful | 0\nDeveloper ResponseJun 8 at 6:42 PM\n\nGreat to hear, hieroaplus :)", "Nasty75May 21 at 8:16 PM\nmini motor racing\n\nThis game is awesome!!!\n\nHelpful | 2\nDeveloper ResponseMay 21 at 11:57 PM\n\nGreat to hear, Nasty75! :)", "TuvivavalMay 15 at 1:28 PM\nAwesome\n\nJust buy it. It is AWESOME!!\n\nHelpful | 3\nDeveloper ResponseMay 16 at 6:21 PM\n\nThanks, btwvr - appreciate it!", "erasmushurtMay 14 at 10:07 PM\n\nThe camera mode switching when you first start seemed to confuse and annoy everyone who tried it here. Once you get past it though its a pretty cool game. My favorite racing game on the Quest to date.\n\nHelpful | 1\nDeveloper ResponseMay 16 at 7:16 PM\n\nAppreciate that, erasmushurt! The game is massive with many different control and camera options so it can be a bit overwhelming at first. Glad to hear your perseverance paid off :)", "DiamondbackDave069May 17 at 8:26 PM\n\nGreat Game, worth the price of admission\n\nHelpful | 2\nDeveloper ResponseMay 17 at 9:08 PM\n\nAppreciate that, DiamondbackDave069!", "DJandyrMay 23 at 7:10 AM\nMust buy\n\nAnother one of my favourite games since buying the quest. Definitely worth getting!\n\nHelpful | 0\nDeveloper ResponseMay 23 at 3:43 PM\n\nGreat to hear, DJandyr - many thanks for the review! :)", "delonielJul 16 at 4:20 PM\nFINALLY!!! a car race game we can enjoy\n\nIts fun, looks good, plays intuitively, tons of cars and maps, upgrades for your car, a bit challenging, has multiplayer, co-op, a game mode like soccer but with cars so much fun, can play campaign while waiting for a matchup, campaign mode gets intense too because you get to the point skills isnt enough anymore so you have to upgrade your car to get that extra second to win the race with 3 stars and theres SOOOOO much more!.\n\nClearly this is one of the better looking and well polished games on the quest. Oh yeah one more amazing thing is whatever comfort level your at theres no worries because you have so many point of views you can drive from. For people who have good VR legs you can get really into it where its so fast and immersive that you feel adrenaline pumping. You can drive 3rd person view like your on top and a little behind, here you still feel the intensity and being in the heat of the race. This is better for people who only have decent VR legs.\n\nThe only thing I wish they could add is nitro appearing in the track for the last placer maybe even just one extra for him per lap just to give hope to catch up cause lets face it the slow effect the tornado does doesnt give any hope.\n\nTo the Devs thanks so much for this game. I hope you guys keep it up and continue to bring out amazing quality games to the Quest.\n\nIve played and bought about 20 games on the oculus store and this is the 1st time I made a review because I truly believe this games deserves the support of the Quest Community. Lets help this game become one of the best games on the Quest.\n\nHelpful | 0\nDeveloper ResponseJul 17 at 3:31 PM\n\nThanks so much, deloniel! This type of feedback motivates us hugely for all future titles :) Thanks again!", "dave.jackson.505May 21 at 8:48 PM\n\nI luv it\n\nHelpful | 2\nDeveloper ResponseMay 21 at 11:58 PM\n\nShort and sweet! :)", "bibbicusJul 30 at 12:56 AM\nGarbage\n\nDoesn't work. Black splotch prevents play.\n\nHelpful | 0\nDeveloper Response25 days ago\n\nHi bibbicus - this obviously is not intended behaviour so we'd love to work with you to get you up and running ASAP. As a possible quick fix, have you tried turning off and restarting your Quest? Sometimes that's all it takes to sort out gremlins like this. If no luck there, please do reach out to us direct via https://thebinarymill.zendesk.com/hc/en-us/requests/new and we'll dig deeper into what might be happening here. Thanks!", "ChrisUnderoathMay 24 at 8:24 PM\nPerfect\n\nI wanted Blazerush on Quest. This is better. Freaking love it.\n\nHelpful | 0\nDeveloper ResponseMay 25 at 5:15 PM\n\nAppreciate that, ChrisUnderoath!", "kyle.gouletMay 20 at 1:51 PM\nAmazing\n\nThis is an amazing VR update to the similar old iPhone game. Super job!\n\nHelpful | 1\nDeveloper ResponseMay 21 at 11:47 PM\n\nThanks, kyle.goulet! :)", "morganlynJun 12 at 2:12 PM\nUnable to play\n\nI was so excited to get this but the first 3 minutes I got really bad motion sickness and had to stop.\nI dont get motion sickness with any other app.\nWish I could have my money back because its expensive!\n\nHelpful | 0\nDeveloper ResponseJun 13 at 4:16 PM\n\nHi morganlyn - have you tried enabling the many comfort options or tried outside the car from above? We've worked hard to find a way for everyone to be able to play the game comfortably.", "beavis28Jul 10 at 9:17 AM\nAnother underrating game\n\nOk,, I didnt buy this until now then bought and played,,, really amazing game!!\n\nThanks for making this epic game!\nWould be disaster if I didnt play this while I have oculus quest..\n\nOne of the reason why I didnt buy is this package image,, compared to actual game,, this is little bit cheap,, I think if the developer makes this package screen better,, I believe more people will come and play\n\nHelpful | 0\nDeveloper ResponseJul 14 at 11:24 PM\n\nThanks for the feedback, beavis28. Glad you're enjoying the game :)", "JoanneLoveSpringbergJun 17 at 2:09 PM\nToo hard to turn and too many tight turn\n\nJust not at all what I wanted and I had to buy it twice , once for my oculus and once for my husbands. Terrible motion sickness too!\n\nHelpful | 1\nDeveloper ResponseJun 19 at 4:34 AM\n\nHi JoanneLoveSpringberg - have you tried enabling the many comfort options or tried outside the car from above? We've worked hard to find a way for everyone to be able to play the game comfortably.", "eric.dieme.37Jun 5 at 5:54 AM\nIt's ok\n\nIt's ok\n\nHelpful | 0", "L66EVN2 days ago\nMini motor racing x\n\nBrilliant game well worth the purchase well recommended.\n\nHelpful | 0", "ShadowX80016 days ago\nGreat\n\nGreat game! Definitely wish for long races and more like Mario Kart plz!\n\nHelpful | 0", "Funky8oyJun 25 at 9:29 AM\nGreat graphics but\n\nI did not enjoy playing it with my friend :(\n\nHelpful | 1", "MOLEY79Jun 30 at 8:15 AM\nFun\n\nThis game is purely belter mate...Fun Fun Fun love the 3rd view behind the car using the rc control havnt even done the 36 begginer tracks yet in career mode..Not played multiplayer on mini ball and cant wait to dive into them...This game is 10/10 easy...The top views of the tracks are brilliant too...Im playing on hard in career mode i suggest you do that to...stop reading reviews you love car games and having fun then this is for you\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:35 PM\n\nGreat to hear! Many thanks for the review, MOLEY79 :D", "mermaidmorgMay 15 at 11:07 AM\nBest racing game\n\nIts Mario cart in Vr.\n\nHelpful | 1\nDeveloper ResponseMay 16 at 6:23 PM\n\nThanks, mermaidmorg! High praise indeed :)", "dionte.barneyMay 16 at 1:50 PM\n\nI love it ...\n\nHelpful | 0\nDeveloper ResponseMay 16 at 6:01 PM\n\nThanks, dionte.barney! :)", "pilotequestMay 16 at 12:01 AM\nFun fun fun fun!!!!\n\nFUN!!!!!!!!!!!!!!!\n\nHelpful | 1\nDeveloper ResponseMay 16 at 6:18 PM\n\nThanks, pilotequest!", "eddie.henderson.735May 14 at 3:02 PM\nThis Is What Ive Been Waiting For\n\nThis is truly it.....There are many great games for the Quest, but not many has brought excitement like I had with the first days of getting the Oculus Go (Go figure). This is one of the exceptional games that reminds me of why I talk my Non-VR friends ears off about. Great game, Great job!\n\n\nThanks.\n\nHelpful | 7\nDeveloper ResponseMay 16 at 7:19 PM\n\nThanks so much for the amazing review, eddie.henderson.735! We love reading these! :D", "GTHobbesMay 14 at 12:22 PM\nA+\n\nHad a chance to check out career and rocket league modes and both are outstanding.\n\nLove all the different available camera angles and control options.\n\nRacing from inside the vehicle is awesome but my favorite way to play is trackside or up in the blimp/hot air balloon and controlling the car (tons of different varieties) like like racing matchbox cars back in the day.\n\nLove it!\n\nHelpful | 6\nDeveloper ResponseMay 16 at 7:24 PM\n\nThanks, GTHobbes! A+ for your review also :)", "james.mendrick.7Jul 5 at 4:11 PM\nGreat game ; must have\n\n1st person VR mode is actually manageable and fun. Its like playing the top end sit down arcade machines. The top down mode reminds me of classic games like Sprint. Handles extremely well, great visuals. Im glad I bought it!\n\nHelpful | 0", "YNW_PhatKakesMay 30 at 9:07 PM\nGreat purchase!\n\nI got the quest about 4 months ago and have been playing it constantly. Its my first experience with vr, and i can say after playing super hot, echo, bait, king spray and many other games, this one is one of my favorites! the graphics are amazing, and the different game modes keeps it fresh. The different cars are awesome and multiplayer just makes it even more immersive. i wasnt sure if i wanted to spend $25 on it considering im 13 with a limited budget, but its definitely worth every penny. Its a great game, has great graphics, and has great modes and variety. This is one game on the oculus store that you dont finish in a day or two. its something you can play all the time. Overall, I would recommend it!\n\np.s, if youre prone to seasickness take it easy at first\n\nHelpful | 2\nDeveloper ResponseMay 31 at 4:40 PM\n\nAppreciate the review, A_to_the_veryy10! :)", "MoulderFaulkerJun 14 at 11:23 PM\nGreat racing game with so many options!\n\nI love this game! You can be in the driver seat or you can control it from a bird's eye view. I used to play this game on my mobile phone and to see it and play it in VR is amazing! I haven't played multi-player yet, but I'm sure I'll love it! I did have a hard time figuring out how to start the game and there should be a tutorial for that. There is a tutorial for playing the game, but just to start it was a bit confusing. When you select your car, make sure you hit next on the bottom right corner. There should be a \" Start Race!\" button instead of \"Next\". Little minor details, but this game is solid. There's a lot of replay value for sure. I love games that can hold value. There are games out there that requires you to be online and depends on players in order to play the game. This has a career mode and online mode so you'll never be stuck with a game you can't play when support for it is gone. Great job on bringing this to VR! I hope to see a lot more updates to this game and maybe see a DLC?\n\nHelpful | 0\nDeveloper ResponseJun 15 at 4:56 PM\n\nThanks, MoulderFaulker. There's actually a key that you can turn to start the race as well - we'll look into ways of making the onboard clearer in future updates. Thanks again! :)", "ExpoDevJul 26 at 2:21 AM\nRocket League VR and more\n\nThe closest ill get to rocket league in vr and other cool stuff! Definitely worth the money!\n\nHelpful | 0", "JWheezyMay 16 at 2:50 PM\nYou think you know? You Have No Idea!\n\nThis game is incredible. 100% was expecting an hour rental and return. Not a chance! Best looking, performing and the most complete game Ive spent a dollar on to date. I was expecting a cute overhead racer with gimmicky controls and an unserviceable in car cam. Nope! Its pitch perfect. You can race your vehicle from dozens of possible viewpoints and the in car experience is so freakin cool. Ive tried (and mostly kept) A LOT of Quest games over the past year and its mostly been great, but once this app finished installing, the value of my Quest doubled Thank you devs!\n\nHelpful | 3\nDeveloper ResponseMay 16 at 6:00 PM\n\nHi JWheezy - many thanks for your kind words - we love to read these kinds of reviews! :)", "wenbofanMay 23 at 1:28 PM\nCant really play\n\nI bought it today and when I start it, theres always a black blank in front of me. Dont understand why and I tried to restart it but nothing get better.\n\nHelpful | 1\nDeveloper ResponseMay 23 at 3:34 PM\n\nHi wenbofan - sorry to hear about your issues running the game. If you would be so kind as to reach out to us at https://thebinarymill.zendesk.com/hc/en-us/requests/new we can assist you directly with getting the game running. Many thanks.", "Eric.StormMay 17 at 9:49 PM\nWhat I expected\n\nIts pretty good especially the bumper ball its graphicluly good but some places are low quality\n\nHelpful | 0\nDeveloper ResponseMay 18 at 4:10 AM\n\nHeya Eric.Storm - thanks for the review! It can be tough to balance detail from bird's eye all the way down to in-car but we're glad to hear you're enjoying the game :)", "nickhollMay 15 at 12:30 AM\nMy dream driving game\n\nIts just about my perfect driving game. Charming little worlds with lovely little touches. Super polish and loads of fun. There are so many modes and variations Ive given up count! (I wouldnt recommend the cockpit view though as its very tiring on the eyes - all other views are ace though)\n\nHelpful | 3\nDeveloper ResponseMay 16 at 7:11 PM\n\nThanks, nickholl! Appreciate the kind words :) In-car can be a bit more extreme however we suggest using the Virtual Wheel for maximum comfort. Also worth noting, there are steering sensitivity options in the menu that can help to make it less intense also. Thanks again for the review! :D", "sinkkingJun 6 at 3:18 AM\nRocket league in vr\n\nI wanted a sitting down game that I can play in bed in the morning to boost my energy levels and this does a great job. Bumperball is what I play and it's quite chaotic but the nitro boosts allow you to use some amount of skill tap the ball into the goal. Having rocket league in vr would be a dream come true having 360 degrees of awareness but this is quite fun. Recommend.\n\n4.6/5\n\nHelpful | 0\nDeveloper ResponseJun 8 at 5:13 PM\n\nGreat to hear you're enjoying Bumper Ball, sinkking! :)", "darkescoJun 3 at 8:00 PM\nAbsolutely AMAZING!\n\nBig thanks to the developers! Don't expect the graphics from a high end racer, but they are simple, clean, and beautiful. Just the cartoony water shaders in the first track blew me away. This looks like a scaled down render pipeline, but there is a lot of love here. The feeling of racing in-car is great! And bumper ball was really cool. It is an add-on mode, but started to feel a little like Rocket League. I hope they expand this mode out a little, or better yet, make a separate game like this with jumping and flying. In-app purchases for this mode could be very lucrative for the designers. That game would be worth an easy $30 to me an many other people. This basic arcade style racing game is on point and it blows games like VR Karts away! I'll be looking for more titles from this developer. We need more fun games like this to keep VR going.\n\nHelpful | 0\nDeveloper ResponseJun 4 at 3:44 PM\n\nMan thanks, darkesco! We're keeping a close eye Bumper Ball as more players get into the action :)", "SenSSi_May 14 at 12:41 PM\n5/5 best racing game on quest\n\nShortly, easy 5/5 stars.\nBEST Oculus Quest racing game.\nCockpit (1st person) view needs good \"vr legs\".\nLots of content.\nLots of camera options.\n\nRecommended.\n\nHelpful | 9\nDeveloper ResponseMay 16 at 7:21 PM\n\nMuch appreciated, SenSSi_! :)", "stephen_jamesMay 22 at 9:05 AM\nDidnt enjoy, straight to refund.\n\nControls werent good for me, kept changing the camera view accidentally making it unplayable.\n\nHelpful | 1\nDeveloper ResponseMay 22 at 3:41 PM\n\nHeya stephen_james - there's an camera option in the menus called 'VR camera change' where you can select double click which will prevent you from accidently changing view when not intended. Give that a try :)", "SmallMangosJun 28 at 3:52 PM\nHot wheels baby\n\nJust a straight up great time, in car view is amazing and smooth, you can really hug those turns, the x mode feels like Mario cart but in VR which is hilariously fun.\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:33 PM\n\nGreat to hear, SmallMangos! :D", "danjohnston1201Jul 26 at 3:17 PM\n\nAmazing all I can say\n\nHelpful | 0", "RetroDaisyMay 31 at 9:18 PM\nOne of the best oculus games Ive played\n\nIll start off saying thank you for adding a variety of camera angles because I get very dizzy from playing vr game like this. And there is so many missions to play and so many maps that there is basically no repetition in this game and I find myself playing it all the time. I highly recommend this game to anybody reading these reviews!\n\nHelpful | 0\nDeveloper ResponseJun 2 at 1:47 AM\n\nYou bet, RetroDaisy! Many thanks for the review :D", "PsycheloneMay 15 at 11:47 AM\nQuest finally has its Kart Racer!\n\nIf youre looking for a great racing game for Quest, look no further. This is a fantastic arcade racer that gives a ton of different ways to play with a great amount of content. Everything has a nice polish to it and looks very good on the Quests mobile hardware. However if youre easily prone to motion sickness, you may experience it especially with the front seat first person view. I did not experience any, but i dont get motion sick easy. Nevertheless, if youre on the fence I'd say youre not going wrong with this one and its the definitive racing game on Quest right now.\n\nHelpful | 2\nDeveloper ResponseMay 16 at 6:23 PM\n\nMany thanks, Psychelone! Appreciate the tips for new players. We recommend using the virtual wheel while in-car for maximum comfort and also suggest adjusting the control sensitivity should things feel a bit too wild :) Thanks again!", "eric.sullivan.587268May 14 at 10:32 AM\nJust bought it\n\nHope it's amazing just bought it been waiting for a good looking racing game tired of all theses punch balls and swing flash lights to music\n\nHelpful | 8", "kingjakerules01Jul 11 at 8:04 PM\nBy far my favorite game\n\nFun to get into played like two races and knew I needed this game in my life. Amen!!\n\nHelpful | 0\nDeveloper ResponseJul 14 at 11:22 PM\n\nThanks, kingjakerules01!", "EvolvicMay 14 at 11:50 AM\nGorgeous\n\nThis is what I have been waiting for.\nMore fun than sim but my word it is FUN.\nFantastic performance too, devs deserve great credit for this.\nLoads and loads of options and gameplay modes.\nTop notch!\n\nHelpful | 5\nDeveloper ResponseMay 16 at 7:24 PM\n\nMuch appreciated, Evolvic! Always great to hear positive feedback like this :)", "M1cahXDJun 24 at 10:58 PM\nOne of the best for sure!\n\nI love this game! So many different maps, modes and customization! I'm not gonna write a full review since there are many others, but get the game if your on the edge.\n\nHelpful | 0\nDeveloper ResponseJun 30 at 6:35 PM\n\nThanks for that, M1cahXD! :)", "jeremy.deatsMay 24 at 7:13 PM\nLots of options, great fun.\n\nThere aren't too many racing games on Quest, but as it stands now this one is the best. Don't be fooled by this being an older mobile title. Mini Motor Racing X has been reworked for Quest. The developers give you every interface mode possible for driving (my favorite mode is the distance chase cam with d-pad control), add multi-play and Oculus cloud sync and everything lines up here even the asking price. Buy it!\n\nHelpful | 0\nDeveloper ResponseMay 25 at 5:15 PM\n\nThanks, jeremy.deats! Always great to hear this from players - the game is similar to the mobile title only in name as everything was recreated (and expanded upon) for this VR version. Thanks again! :)", "yukky369Jun 3 at 7:58 AM\nThis is no good\n\nI was too drunk and didn't last 10 minutes\nI want you to refund...\n\nHelpful | 1\nDeveloper ResponseJun 3 at 4:13 PM\n\nHey Mario_oiraM - is it any better after sobering up? ;)", "MandJquestMay 22 at 2:06 PM\nHorrible\n\nIts not very accurate and makes me very dizzy. Really hard to steer and start the game\n\nHelpful | 1\nDeveloper ResponseMay 22 at 3:36 PM\n\nHi MandJquest - there are literally dozens of different ways to play the game using virtual wheel, RC remote, tilt/point or even the analogue sticks from 1st person, 3rd person or multiple views from above and trackside. We'd suggest starting with an overhead view as most people find playing from above the most fun anyway. Hope you can find your way to play! :)", "Stackingchips74May 23 at 1:31 PM\nOMG 5 STARS 10 OUT OF 10\n\nI read the reviews first and jumped right into the purchase. This game is nothing short of amazing. So many different camera angles, the backgrounds and environments are soooo nice. Seriously I could just sit in the game without playing and just enjoy the environment and music, its that good. I use to play Sprint and Micro machines as a kid and this is like those on steroids. The fish and stingrays in the water look so real, depending on your camera view you can be above the clouds or in the cockpit. My recommendation is to not do the inside car view for your first drive, try it above the car it made me motion sick at first. The gameplay is exciting and has online multiplayer which is really fun and so many maps. Dont think about it just buy it if you like racing games. Thank me later!  Developers-you have outdone yourself really.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 3:48 PM\n\nThanks so much, Stackingchips74! Love to hear reviews like this :) Super Off-Road, Micro Machines and others of that ilk were definitely a huge inspiration in the development of MMRX - great to hear some of that core spirit is shining through :) Thanks again!", "Poliwrath85May 23 at 3:46 PM\nSimple, fun, racing game\n\nNot complicated. But really grindy for $ to get better cars and upgrades. Standard career has two modes, classic race, then battle race. Each mode has 4 chapters. Each chapter has about 8-14 pages. Each page has four races to clear. Lets just call it 36 races a chapter times 4 chapters = 144 races times both modes = 288 races to completely finish the career mode (again, estimations, not actual numbers). Most tracks are small and only a few laps so you finish each race within 5 minutes. But you need all these races again, to grind for $.\n\nThe best part is the loading time. It's really good, seconds to load anything- maps, back to garage, end race screen, its all quick.\n\nEasy learning curve for your parents who don't know VR at all. The camera behind following the car is best for not getting motion sickness, though they have the in car one for you extremists who want to feel the car shake as you hit the nitrus or hit a mine.\n\nCross buy was awesome. Bought on the Quest- played heavily on the quest. Installed on my computer Rift S. However, the game doesn't forward your information. Well, I wasn't going to start from scratch. So I uninstalled it. The graphics don't look much more detailed on the computer at high settings ($2400 laptop with 2070ti). Not a big deal, almost dinged them on a star, but nah. I'm sure they will figure that out later.\n\nAll in all, very solid non-complicated game. Would be awesome if you have 3 other friends and just race in the game.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 4:49 PM\n\nHi PiNoYeBoY85 - many thanks for the review! Interesting that cross-save to your Rift did not work because that absolutely should. If you would be so kind as to reach out to us direct at https://thebinarymill.zendesk.com/hc/en-us/requests/new we'll be able to better help with what might be happening there. Thanks again :)", "CugalMay 17 at 5:15 AM\nGreat game but please.....\n\n....put the change view to the off hand only. Its so annoying half way through a game you accidentally click the thumb stick and then the view point changes. I think this is a must update ASAP. Apart from that this game is well worth the asking price.\n\nHelpful | 2\nDeveloper ResponseMay 17 at 3:39 PM\n\nHi Cugal - thanks for the review! As for your request, you're not the first to request this so we'll definitely be looking at ways to perhaps lock the camera (optionally) once you're happy with it. Thanks again for the reivew :)", "JoeGermanMay 19 at 2:04 PM\nWOW!!!\n\nThis is all the fun I had as a kid playing RC Pro Am, but it's modern. There's so many different views from which you can play. Classic top down view - CHECK,\nPlay from inside the car - CHECK, Wanna do classic view with a steering wheel - CHECK, wanna do classic view with an RC controller - CHECK. If it looks good to you then JUST BUY IT!\n\nHelpful | 1\nDeveloper ResponseMay 21 at 11:41 PM\n\nGreat review - CHECK! Thanks, JoeGerman :)", "slayermax77May 20 at 3:16 AM\nMust have as a vr player\n\nAs being a vr fan since the psvr times this game blows my expectation of the quest this has some of the best graphics and gameplay Ive seen,Iam a professional go kart racer and this game some how uses actual driving abilities to this if you want a normal a Mario kart type experience to a game like rocket league its all there I would say if your on the edge of this game its a must have for vr users as the game is smooth and me being a racer I dont have any problems driving itself so its one of those you just wing it and buy it thanks for reading this review :)\n\nHelpful | 1\nDeveloper ResponseMay 21 at 11:42 PM\n\nThanks so much, slayermax77! Great to hear from your pro karting perspective! :)", "MrPain1970May 14 at 1:16 PM\nMario Kart in VR, only better!\n\nBetter than Mario Kart. Fun without ends. Smooth control and perfect race feeling.\n\nHelpful | 9\nDeveloper ResponseMay 16 at 7:20 PM\n\nToo kind, MrPain1970 - thank you!", "CosmicGhostVenomMay 31 at 12:34 AM\nInsanely great game\n\nAs good as Super Hot. Better than Robo Recall. The different viewpoints are really incredible. This is a game that you buy the Oculus just for. RC Pro-Am and Off-Road in VR. Take a break from punching and shooting stuff and grab this ASAP.\n\nHelpful | 0\nDeveloper ResponseMay 31 at 4:41 PM\n\nHigh praise indeed! Many thanks, CosmicGhostVenom :)", "calforbMay 17 at 10:23 AM\nVery fun with lots of options\n\nI read a review saying the racing is a bit slow but I dont know what they were playing! Maybe at the start but once you begin upgrading and changing modes it really becomes a lot more difficult. There is tons of gameplay options so plenty to keep me coming back. Really great and it brings back Micro Machines vibes from the Sega Era.\n\nHelpful | 0\nDeveloper ResponseMay 17 at 3:21 PM\n\nThanks for weighing in, calforb! Really appreciate the review :)", "MrD666May 17 at 2:52 PM\nAwsome!\n\nJust wow, I was a big fan of the iOS game and this is just better in every way.\nIf you like micro machines its got it\nIf you like Mario Kart its got it\nIf you like slot racers its got it\nAnd you can swap between these modes on the fly during the race It really is that good.\n\nGraphics clean and crisp. Good progression, arcade and championship modes. And Multi player!\n\nAll I can say is just buy it if you like any racing game this will put a massive smile on your face.\n\nThank you devs a good clean game no hidden dlc or micro transactions.\n\nHelpful | 1\nDeveloper ResponseMay 17 at 3:53 PM\n\nThanks for the review, MrD666! The game lives on in spirit from the mobile days however every element has been completely rebuilt and improved upon for this VR version :) So glad to hear you're enjoying the game! Thanks again :)", "elfriendoMay 16 at 11:33 AM\nNot as expected\n\nPlease send a refund\n\nHelpful | 3", "BDogg1024May 16 at 9:07 AM\nSo fun\n\nThe best part about this game is all the different ways you can play. Multiple overhead views. Multiple in car views. Choose to drive with your controllers, a steering wheel or a classics rc car controller. The visuals are pretty cool. A little like Mario Kart with some more realistic scenes thrown in. Fun to race with friends.\n\nHelpful | 0\nDeveloper ResponseMay 16 at 6:06 PM\n\nThanks, BDogg1024! The team worked hard to ensure there was a comfortable and fun way for everyone to enjoy the game. Thanks again :D", "AmlbuzzerMay 17 at 6:03 AM\nBest game on quest\n\nGorgeous visuals , great gameplay with lots of game choices , lots of replay ability with the online leaderboards which to me is essential yet some games don't have them.\nHaving a blast , only minus for me and not enough to knock a star off is I would love to be able to turn off / down the music as struggle to chat when the music is playing in multiplayer.\n\nHelpful | 0\nDeveloper ResponseMay 17 at 3:36 PM\n\nHi Amlbuzzer - many thanks for the review! You can actually turn down the music in the options before entering into a multiplayer party/race right now, however we are working on a patch now that will enable you to change this setting at anytime in-game, regardless of if you're in multiplayer or not :) Thanks again!", "BANKSSOTATTEDMay 17 at 1:18 AM\nDeath Lap is Better (TO ME)\n\nREAL TALK FROM OG QUESTER: HOW TF do you make this game 25$ and death lap is 20$ and way better than this android game ported to quest , the quest has Fin death lap and nobody cares , thats a VR death sport in its self lol. Add me if u wanna play DEATH LAP add me \n\n\n\nlove the graphics and the different views you can play from very nice but made me sick very easy than any other game and I never get sick in VR (EVER) .\n\nHelpful | 0", "Aris_veneMay 17 at 3:10 AM\nGreat fun, lots of courses and cars\n\nI was really missing a good racing game. Had tried a different one that really disappointed me (too hard, unfocused). Somehow I had overlooked this Mini Racer Game until I saw a cast on Facebook by somebody. I bought it and didnt regret doing so. Colourful, fluid, lots of very different tracks and the cars handle well (a bit of drift, just enough to be fun around the corners without being super difficult). Loving this game.\n\nHelpful | 0\nDeveloper ResponseMay 17 at 3:40 PM\n\nThanks, Aris_vene! We're doing our best to get the word out there :) Really appreciate the review - it's always wonderful to hear people's positive experiences. Thanks again!", "A5041May 15 at 6:07 AM\nThe Binary Mill has done it again!\n\nOnce again, the binary mill has created a truly immersive VR experience. First, they let us experience soaring in a wing suit; now we can sit behind the wheel of a racecar. This type of game/experience is why I bought the quest. Great graphics, hours of gameplay, and awesome multiplayer options make this game a must have. If you dumped rolls of quarters into Pole Position as a kid, stop reading, start playing.\n\nHelpful | 1\nDeveloper ResponseMay 16 at 6:32 PM\n\nThanks, A5041! Don't forget Gun Club VR as well ;) Many thanks for your kind words - we look forward to developing many more great games for Quest!", "HexBlehMay 15 at 2:44 AM\nThe Racing Game Quest Needed\n\nthis is one of the nicer games available on the quest , the graphics are genuinely impressive and the game runs very clean and crisp . no stutters . map design is amazing and I love the game references within then ;) if youve been on the fence about its seriously just go for it , you won't regret it . my only suggestions to the devs would be maybe just polishing up the vehicle collisions , also some more variety to the 'X Mode' weapons would be amazing . while the current ones do what they're meant to , I think you guys can get ALOT more creative with the overall design of the attacks(mostly speaking about the wrench and missile) but also maybe making a better way of obtaining them while playing like some sort of mystery crate ? other than that this game has just surprised me at how polished it looks and feels , 10/10 would buy again\n\nHelpful | 1\nDeveloper ResponseMay 16 at 7:04 PM\n\nHi HexBleh - many thanks for the thoughtful review! We certainly have ideas on how to refine the type X systems more - we'll be keeping a close eye on things as we progress. Thanks again! :)", "frrrrunkisMay 19 at 5:11 AM\nAs great as you hope it is\n\nThis has been the best game Ive played on the Quest. Graphics...great. Gameplay...great. Just fun and it works at everything it tries to do. Im telling all my friends to pick it up.\n\nHelpful | 2", "noneedtotalkMay 15 at 3:30 AM\nGet this game\n\nIt's pretty fun with a lot of different modes and a lot of different camera options they really care about your comfort but I'm having trouble finding an online match taking a long time but it's new so get the game so I can kick your butt!!!\n\nHelpful | 2\nDeveloper ResponseMay 16 at 6:36 PM\n\nHi noneedtotalk - thanks for the kind words! We're working on building the community for multiplayer but the game is only a few days old :) We added cross platform support for Rift and Quest and will have announcements about adding others in the future. Having a healthy online player base is super important to us. Thanks again!", "DimotroscovtichMay 16 at 11:45 PM\nMost fun game on the quest\n\nThis game is amazing! The levels are so crisp and beautiful , there are lots of modes, cars, levels and even camera angles to choose from.\n\nThis game is worth every penny! Kudos to the developers! This is the most polished game I played so far.\n\nHelpful | 1\nDeveloper ResponseMay 17 at 3:42 PM\n\nThanks muchly, Dimotroscovtich. Appreciate you taking the time to share your experience - the dev team loves hearing this type of feedback :D", "Taetoo_funnyMay 15 at 6:15 PM\nThe quest racer\n\nThis is the perfect racing game simply put. If you wanna race with friends you can. Offline? You can. Dont wanna race? You dont have to with the other game mode available all for one price. Amazing job guys, Im excited for your next app.\n\nHelpful | 0\nDeveloper ResponseMay 16 at 6:20 PM\n\nThanks, Taetoo_funny. Too kind! :)", "Guvner57May 15 at 11:28 PM\nAmazing Little Racing Game\n\nThe developers are to be congratulated for what they have achieved with this game, the graphics are pretty amazing and there is so much content.\nThis one thoroughly deserves its 5 stars and is such good value for the price.\n\nHelpful | 1\nDeveloper ResponseMay 16 at 6:18 PM\n\nThank you, Guvner57 - much appreciated!", "Timsters25Jun 4 at 3:38 PM\nGreat game\n\nThis game is awesome everything for customizing is amazing! I just get a little motion sickness from it so be mindful\n\nHelpful | 0\nDeveloper ResponseJun 4 at 3:45 PM\n\nThanks, Timsters25! Be sure to have a look over the many comfort options available in the menu if you are finding yourself a little uncomfortable. We spent a lot of time making sure the game can be a comfortable experience for all :)", "Alex_ScovilleMay 15 at 9:57 AM\nAwesome!\n\nBattle arenas like Mario 64 please!!!!\n\nHelpful | 4\nDeveloper ResponseMay 16 at 6:25 PM\n\nHmm... :) Thanks, Alex_Scoville!", "kowboys7May 14 at 10:33 PM\nBest racing game on Quest\n\nI was hesitant at first to spend $25 but after I got use to the controls and changing the views this is the best vr racing game imo.\n\nHelpful | 2\nDeveloper ResponseMay 16 at 7:14 PM\n\nMany thanks, kowboys7! Glad you found your groove :)", "mylkohrlyMay 23 at 2:39 PM\nSo cute!\n\nCars and tracks are REALLY CUTE! The in-car camera was uncomfortable to me. That may be normal for others, as I don't use to play racing games in VR.\n\nHelpful | 0\nDeveloper ResponseMay 23 at 3:51 PM\n\nHi mylkohrly - thanks for sharing :) The in-car view is definitely more intense than playing from above, however if you ever decide to try in-car again, remember there are many comfort options available and we'd suggest turning them all on/up when starting out. Also, I'd highly recommend playing with the virtual wheel anytime you're in-car :) Thanks again!", "SaltKnightJun 7 at 7:24 AM\nWow, well crafted!\n\nReally great game. Gets all the little things right.\n\nHelpful | 1\nDeveloper ResponseJun 8 at 6:41 PM\n\nThanks, SaltKnight :)", "Sir_Slaught3rMay 16 at 6:27 PM\nFun game!\n\nAwesome gameplay and graphics! Must have for any person who likes 3rd person racing(my favorite) but also offers first person as well.\n\nHelpful | 0\nDeveloper ResponseMay 16 at 7:28 PM\n\nAppreciate the review, Sir_Slaught3r! :)", "Wayned45May 16 at 3:02 PM\nBrilliant, Ive been waiting for this\n\nBuy it,\nyou wont be disappointed, graphics are great and just so much fun. I played this and just couldnt stop\n\nHelpful | 0\nDeveloper ResponseMay 16 at 5:58 PM\n\nThank you, Wayned45! Glad you're enjoying the game :)", "NamelessBadGuyJun 8 at 8:13 AM\nCool Game but\n\nAll the tracks seem so short with so many sharp turns which make first person view sooo bad. Motion sickness to the max and I was expecting to mostly play in First Person.\n\nHelpful | 0\nDeveloper ResponseJun 8 at 6:43 PM\n\nHi NamelessBadGuy - have you tried using the many comfort options for the cockpit views? Also, we'd highly recommend using the virtual wheel from that position - it'll really help!"]