{"App Title": "Mission: ISS", "App description": "Take a trip into orbit and experience life on board the International Space Station!  In this Emmy-nominated simulation, learn how to move and work in zero-gravity using your controllers.  Dock a space capsule, take a spacewalk, and let real NASA astronauts guide you on the ISS through informative videos and images.\n\nGamepad not supported.", "Purchase section": "FreeAdd to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Documentary & History, Educational, Exploration, Simulation, Space/Universe, Travel", "Languages": "English", "Version + Release Notes": "1.2.55", "Developer": "Magnopus", "Publisher": "Oculus", "Website": "http://missioniss.magnopus.com/", "Release Date": "July 12, 2019", "Developer Privacy Policy": "None", "Space Required": "1.07 GB"}



["5 stars\n64%\n4 stars\n18%\n3 stars\n9%\n2 stars\n3%\n1 star\n6%", "661c.sanabriaJun 4 at 10:42 PM\nFree and amazing\n\nThis little demonstration of the ISS will just make you go wow. BUT there is this annoying lady that talks in the background repeating the same crap over and over. You are going the wrong way bla bla bla. Thats what she says over and over.\nPlease allow us to mute this annoying voice, then Ill give it 5 stars\nIt can get a little disoriented because we are not use to float in space and this might cause motion sickness because its very immersive and the brain is basically saying what tf, how come you are standing and floating at the same time?\nBut youll get use to it. Sitting first will help then try standing later\n\nHelpful | 155", "peter.wrightson.1621 days ago\nGreat game\n\nBought this as I'm interested in space and the iss .\nLooks absolutely great and feels great as you float throw the station .even the space walk was fantastic.\nBeing able to click on objects and learn information on what that item is used for is always interesting.\nWARNING to those who suffer motion sickness this game makes you feel like you're in zero gravity. I nearly lost my balance twice.\nThe only gripe I have is that sometimes when you are pulling yourself along you tend to end up half way in the walls which can be a little annoying but apart from that worth playing.\n\nHelpful | 6", "vrhomeov4 days ago\nGood experience but maybe bugged?\n\nIts a great experience for a game thats free.\nBut the Quest version has some problems with gameplay. In the mission where you are coming back from spacewalk, the narrator doesnt tell you what to do next. It doesnt matter where you go in the spaceship or what video you watch, its just silent and you have no idea what to do to finish the game.\nIf any of you managed to finish the game, feel free to add me as friend and let me know.\n\nHelpful | 0", "Banja78Jun 14 at 10:25 PM\nUnforgettable\n\nThe first time I got out of the station for a space walk was the best VR experience ever for me. This is why VR is made for. Feeling the sensations of doing something you would never do in real life. The first minute I was so afraid to be lost in space that I was hanging the station and then I tried some moves and jumps and then I discovered a little jet pack and moved around for 20 minutes like in the movie Gravity, floating and turning around the station, admiring earth and the sun reflects. Hard to believe this is a free software.\nOn top of that the visit of the station is very interesting even if it gives a bit of motion sickness.\n\nHelpful | 28", "knucklepuck90720 days ago\nOH MY GOD.....\n\nI cant get enough of this game it is one of my favorites and I love the space walk it is the best part of it and it is a little freaky wen you get to far. But luckily the game wont let you get more than 100 feet for the I.S.S. It is a must. And its free so why not. Also if this game went as far as hand tracking it would be sooo much better.\n\nHelpful | 2", "Papatroll95Jul 18 at 4:38 PM\nIt will blow you mind\n\nWhen I bought this game I was thinking can this make me feel like in zero gravity so I lad down on my bed and opened the game up it was amazing it really felt like it was real and it was so cool that blowed me away .I fell some time off my bed because how amazing it is so far it bin one of my favorite .\n\nHelpful | 2", "sad7aniJun 29 at 5:23 AM\nI love it\n\nHow is this game free? It is so good!\n\n\nHowever i need help from one of the developers, i cant seem to figure out how to get into my space suit, can one of the developers respond and help me out?\n\nThanks!\n\n\nIf you want to buy this game and are checking the reviews, what are you doing? Its free you have nothing to lose, it is one of the best free games ever! This should cost money!\n\nDownload for free now! \n\nHelpful | 5", "udo.nink13 days ago\nBest of no cost\n\nThe combination of ISS shots mixed with artefacts for playing around or grabbing and this weightless vreal experience is so much appreciated. Definitely more of this and thank you so much!\n\nHelpful | 0", "Justinp050106Mar 29 at 1:39 AM\nMOTION SICKNESS WARNING\n\nThis is the most in depth tour of the ISS that I've ever seen. It has everything from pictures, to information, to even tutorials. All of which are more in depth than I ever thought. This is the most fun simulation/educational game I've ever played. I recommend this to everyone who would like to be an astronaut, or anyone who currently is. The only problem is for those of us who have motion sickness. I've had my Quest for a year and no game has ever given me motion sickness (I almost threw up 4 times.) You should start out playing while sitting, and after you get used to it, then try standing. This is the only problem I've found. And I still give this game 5 stars, because I feel like that problem is subjective. To all my aspiring astronauts, YOU NEED THIS. Trust me on this one.\n\nHelpful | 167", "syk0788 days ago\nVery cool, but it makes me sick\n\nZero gravity makes me sick. Cool experience tho. I couldn't be an astronaut.\n\nHelpful | 0", "donkey.xoteJul 11 at 5:09 PM\nFun and free\n\nSo this was the first app i tried after first steps and my mind was blown. Beautiful views make me extremely jealous of our astronauts and cosmonauts. Controlling the canadarm was alot tougher than i would have expected. I've watched so many videos of ISS and it was super cool to feel like i was actually there for a few moments. This app will likely never get installed!\n\nHelpful | 1", "scotty341Jul 7 at 3:29 AM\nThis is what experiences should be.\n\nI expected this to be another VR 'experience' where a narrator talks to you for 10 minutes and you stand still listening until you find out whatever boring message they are trying to convey. Instead I found a gem which allows you to be immersed in being an astronaut and gives you multiple different missions which are all fun.\n\nHelpful | 1", "Itz_CherryBlxssom23 days ago\nlovely game \n\nthis game is super cool! if you just want to explore space, there is an option for that. if your the type of person that like to do missons, theres also an option for that?\n\nHelpful | 1", "RoreoOreo10 days ago\nAwesome\n\nIt was really cool to actually go to space and see the space station would definitely recommend\n\nHelpful | 0", "rachael_fletcherJun 28 at 9:34 PM\nThis is awesome!\n\nI can't believe this is free! This simulation is full of little informational videos and facts about the ISS. The space walk is really cool and navigating the space station really makes it feel like you're floating! I will say motion sickness came a lot easier with this than a lot of VR games but its worth it! Very informative and very cool!\n\nHelpful | 1", "jkaz04Jul 15 at 7:41 PM\nThis was cool and fun.\n\nMy mind was blown when I first played this. I felt like I was in a elevator moving up or down and it was weird. It is the best free experience when going to space. Keep up the good work.\n\nHelpful | 0", "williamk007Jul 22 at 3:45 AM\nAwesome!\n\nThis is an absolutely incredible experience on the Quest. But the motion sickness can get a little intense. ..... I love it.\n\nHelpful | 0", "JaimeVisserApr 9 at 4:26 AM\nVomit Comet initially\n\nWithout any actual orientation this experience will always be one of the less comfortable ones on the Quest. Snap rotation made it a lot worse though. After I turned on two handed rotation in settings it became a lot more comfortable for me and I was better able to enjoy exploring the ISS!\n\nHelpful | 16", "Hardcoredude137Apr 14 at 1:51 AM\nOut of this world (Get it? Im hilarious)\n\nThis is by far the best space game I have ever played, I have spent HOURS just floating around or inside of the ISS. It is in an insane amount of detail and good physics. BUT I have to warn you, motion sickness is very bad for sensitive people, sure when your just floating it aint that bad, but when you use your right thumb stick to rotate your body, just.....prepare yourself......cause things about to get dizzy. Even though I have pretty good resistance to motion sickness, I got pretty nauseous, but after playing for 10 minutes or so the nauseousness died down a bit and I could rotate without feeling complete nausea. Motion sickness aside, this is a game I would recommend everyone to try. It really puts you in the perspective of Wow, Im in freaking space! And it is really fun and interactive. With educational videos and pictures to operating the CanadaArm and docking a supply ship to the Space Station, this game is a future astronauts dream. You should try it!!\n\n\n\n\nYeah.......uh.....okay, I guess...........bye?\n\nHelpful | 18", "thiccieJun 9 at 2:01 PM\nOne of the best free games to explore on\n\nWe all really love this at my house. But... we all felt nauseous after 15 seconds of playing the game..\n\nHelpful | 4", "YEAHTOASTYJun 27 at 5:19 PM\nGreat to relax\n\nThrow yourself into space, lie down on the floor, and stare into the unknown\n\nHelpful | 3", "i8cookieMay 10 at 2:28 AM\nAmazing and very exciting but needs work\n\nIts absolutely incredible to be able to float around on the space station, looking at all the stuff and controlling the robot arm, going on an Eva, so cool! But this needs some better testing. I was being told I was going the wrong way constantly. The message somehow got stuck on, very annoying. Also when you're watching a video about some equipment and the guy on the radio can speak at the same time, you can't pause either of them, shouldn't be possible. Also it should be possible to slip training steps, I anticipated being about to grab the walls but not being able to do it until told feels very unnatural and frustrating. All these things are small issues that I'm sure are easily fixed, they damage an otherwise fantastic experience. (I also think the textures and lighting could be a lot better)\n\nHelpful | 2", "RaventheGraveApr 30 at 12:20 AM\nDefinitely interesting\n\nGraphics wise it's not the greatest but being able to move throughout the station and watch videos about different things on the station was very informative and educational. Space walking had my anxiety going through the roof. The one fear I always had if I was ever in space is floating away due to carelessness and being lost to Oblivion. So yea I was sweating and breathing hard just through that portion of the game and couldn't wait to just get it over with. Still amazing experience tho\n\nHelpful | 5", "Fantasma_103Apr 13 at 5:09 PM\nAmazing\n\nI loved this experience. I have a few recommendations:\n1. I would like to interact with more objects.\n2. I want to put on a space suit and open the airlock, instead of just clicking a button to start a space walk.\n3. I want earth and the stars to feel a bit more 3D and less like a 360 image.\nI know these are a bit ambitious, but it would make this experience even better.\n\nHelpful | 7", "jaxhoMar 25 at 10:50 AM\nMotion sickness!\n\nJust tried this out, and underestimated the possibility of motion sickness. I don't usually suffer from this, so was very surprised. But otherwise, it is quite mind-blowing. I plan to go back in for shorter periods and build up some resistance for my first space walk.\n\nHelpful | 13", "MassoudMyDudeMay 22 at 7:50 PM\nGreat Experience\n\nJust moving around the space station is a once in a lifetime experience.All I want the devs to do is add a few more missions and this game will be amazing.\n\nHelpful | 3", "sayrithJun 16 at 4:40 PM\nThe motion sickness\n\nEverything was going great until I started turning, it isn't not smooth instead you get a jump cut which is where I think the motion sickness is occurring. I'd explore it more but I can't get past this sickness.\n\nHelpful | 1", "ben3522 days ago\nOh god no\n\nMy culvers did not taste good the second time through\n\nHelpful | 1", "RadicalRobMay 9 at 11:39 AM\nFree and educational app\n\nDidn't have high expectations but this app turned out really cool! Will probably take you anywhere from 30mins to 2 hours to complete the experience, depending on how in depth you go. Does get quite dizzy at times as you try to orient yourself so be careful of you get motion sickness easily.\n\nHelpful | 1", "icymcyMay 6 at 12:21 PM\nNow I Might Become and Astronaut\n\nSo To Begin Im a HUGE Space Finatic\nAnd Have been interested in the ISS Scene I Was 6. Overall When I Saw This Was Free And Immediately Got it. And Was Happy To Find Out that There Were videos of the different elements of it. And Really Nice Graphics. So Yeah Might Become An Astronaut Now!\n\nHelpful | 1", "nishruu2Jul 9 at 2:52 AM\ncool\n\nreally disorienting if standing..\nbah \"you're going the wrong way\" shut up\n\nHelpful | 1", "reece2112Jul 4 at 8:27 PM\nReason its free\n\nVery average game with pretty poor graphics. Theres a reason this game is free\n\nHelpful | 1", "OculusBoshMay 16 at 11:03 AM\nReally good\n\nBrilliant experience, although the controlling the crane took some time which was a little frustrating!\n\nHelpful | 2", "NikorasuMar 15 at 12:29 PM\nThe best free educational VR experience!\n\nThis is a MUST see! Even if you only try it once, IMO this experience should be shown to all kids in school, it's that valuable of an educational experience. I'd seen videos of the ISS before playing this, not really knowing the internal layout or how big things were, but this is like actually being there, floating around, tricks your brain. I never thought I'd have a mental layout of the inside of the ISS, as if I'd been there myself, but now when I see videos or photos of the ISS, I know exactly where they are!\nMy local library has the Oculus Go, and this is one of the apps I suggested they load on them, and they couldn't believe this was available for free, it's one of the favorites now.\nMy only real suggestion is that I'd like to see an update to this someday, that includes the Russian side of the ISS. I'd even buy that as a DLC if that's what it'd take! I'd love to be able to explore the entire thing, even if the 2 sides had to be separated by a loading screen.\n\nHelpful | 4", "MELOGRAPHICSApr 19 at 8:05 PM\nEven if you dont get motion sickness...\n\nWarning: this game easily makes you feel nauseous, even if youre not one to get dizzy/ queasy easily. Its really cool and well thought out but make sure you take it easy as first (and dont play right after eating).\n\nHelpful | 2", "TeamHosMar 7 at 8:31 PM\nDownload now!\n\nThis is, without a doubt, the best free app that I could find on the quest store, and left me wondering, how come we dont see more titles like this on the quest? Its not perfect, but i would still pay the 20-25$ price tags that I judged it to be worth. It is slightly nausea inducing, and this exploration style of game may not be for everyone, but its free and deserves some time.\n\nHelpful | 5", "OB-1Dec 18 at 10:43 PM\nWow!\n\nThis game blows people's minds! I played with a relative of an astronaut who had lived on ISS for a while. We spoke to her (she had tried this after returning from ISS), and she told us this is as close as you can get to feeling like you're there.\n\nDO IT. It's free! What's the risk? But - be ready to have your mind BLOWN. And don't play near sharp objects LOL. You may fall over, as it's very disorienting at first (seen it happen on more than one occasion).\n\nHelpful | 187\nDeveloper ResponseDec 19 at 4:38 PM\n\nSo happy to hear that! We did actually develop and test the experience with a lot of astronauts who spent years on station, to recreate that same feeling. Cady Coleman told us it was the cure for her homesickness. A Shuttle Commander told us it made him so happy because in all the shuttle missions he ran, he never got to go on ISS. Honored we got to pass that experience on to civilians!", "cobb1Jul 27 at 10:21 PM\nOculus Entitlement check failed?\n\nI downloaded this app and it wont work! Thats the message I keep getting, Oculus Entitlement Check Failed! Please help!\n\nHelpful | 1", "little.cayApr 16 at 9:21 AM\nEasiest way you'll ever get into space!\n\nEasiest way you'll ever get into space! Great visuals, microgravity physics, sound effects and clever UI to share data, hints and tutorials. Thank you NASA and Quest for making this available at this level of quality, for free.\n\nHelpful | 0", "BigJoeyJoeJan 29 at 8:19 AM\nAwesome but too Much for us\n\nMy wife and I tried playing this. Conceptually and graphically we found it beautiful! It was cool to have a glimpse into a the ISS. However, we couldnt move at all without feeing motion sick. If you can handle the experience then try it! Just beware it can be a bit much for some.\n\nHelpful | 14", "christophercarbJul 4 at 10:36 AM\nToo amazing!!\n\nThis game is so cool. You get to explore with other Astronauts and know what it feels like to be in space :D but there are 2 things that only bother me. When you are doing training the lady keeps repeating the same thing over and over again do you cant hear anything! And then I do get a little motion sick so I am trying to get use to it. I recommend this game it is too amazing.!! :D\n\nHelpful | 0", "delve202Apr 2 at 2:01 PM\n\n3 minutes in, found the cupola, lost my mind. Amazing, now if only I could be weightless! :)\n\nHelpful | 5", "Widerneptune7Feb 28 at 6:29 AM\nAwesome experience but\n\nI dont know if it was my oculus quest but mine lagged so bad and some how I got motion sick from how much it lagged for me and I never get motion sick probably my oculus quest being weird but still also when ever they said dont let go I was legit terrifying\n\nHelpful | 3", "chad.hertlerMay 21 at 6:53 PM\nIts like a really cool museum.\n\nNot a game.\n\nHelpful | 0", "Boom564Jun 10 at 3:36 PM\nMotion sickness\n\nOnly use if you dont get motion sickness at all.\n\nHelpful | 1", "Rydert24Jun 27 at 8:19 AM\nTerrible\n\nDo not get this game\n\nHelpful | 0", "nathan.cheetah.20 days ago\nMotion sickness\n\nI have played quite a lot of VR games on my oculus quest and never have I gotten motion sickness, but when I played this game for some reason I got motion sickness really bad. So for that reason I don't recommend playing it\n\nHelpful | 0", "SilentHashassin7Mar 3 at 9:20 PM\nWas skeptical but immediately was blown\n\nThe details are amazing, I had low expectations coming from PSVR and playing their space games I thought this was the same experience, I was wrong. The visuals are so crisp and seem photo realistic. You may experience mild disorientation depending on how use you are to VR and your sensitivity to motion sickness but I think this is the closest I will ever get to experiencing whats its like to be an Astronaut. I can only imagine a game using these graphics and technique into a science fiction space game. I highly recommend downloading and experiencing what this is like.\n\nOne major complaint I have tho, I cannot push off from objects with my hands. My body goes through the floor or whatever device. The only way I can push off objects is if I use the grab and push feature. Realistically we not only would be able to go through the floors, our hands would be able to stop us or push off from an object like most physic based VR games. This issue isnt enough to take away a star but it does stand out a lot and I hope the Dev team realize this is a major issue. Also a smooth turning option would be a great idea as well.\n\nHelpful | 2", "CoolcatmanMay 9 at 4:03 PM\nGood\n\nNo motion sickness\n\nHelpful | 1", "natedoggs5Apr 29 at 3:18 PM\nAmazing\n\nThis game is so fun and it shows what and how people live in space\n\nHelpful | 1", "minercraftmmMar 20 at 1:12 AM\nVery brilliant and weird\n\nAbsolutely brilliant for a free game did feel a bit sick afterwards but I now know what it's like to be in space so thumbs  up from me \n\nHelpful | 2", "jacob.lemus.313Dec 27 at 8:04 PM\nAwesome but made me kinda sick\n\nI think that this game is amazing with its real life things like being in a spaceship. It was so realistic though after 5 minutes I started to feel a little bit sick and I was walking around and turning upside down. Overall if you have a love for spaceships and dont get motion sickness then this is the game for you!\n\nHelpful | 16", "maragokFeb 15 at 3:56 PM\nWould recommend it, but far from perfect\n\nIt's definitely worth a visit if you are interested in space at all. Unfortunately, only a part of the station is modeled (for example, the entire Russian section is missing) and small bugs, glitchy controls and overall unpolished feel hurt the experience.\n\nMild space sickness potentially included if you spend a long time on board, but that just adds to the realism :)\n\nThruster-based movement would benefit from adding an up/down translation option (e.g. via the controller buttons).\n\nHelpful | 2", "UnbelievableFlavourApr 16 at 11:45 PM\nAchievement is bugged\n\nIve completed the game a lot of times now but the professionel astronaut achievement wont pop. Very annoying. Rest of the game is pretty fun though!\n\nHelpful | 0", "rhino_0902Feb 8 at 4:07 AM\nThis game blows peoples minds!!!\n\nI have all ways wanted to go to space .if your not going to be astronaut this is as close as your going to get.\n\nThere is a couple of things they have to improve on like your always hovering above one place also you should be able to go to any planet you want in the solar system you can operate some things on the space station.\nThis is one of my favourite games.\n\nHope you like playing this game\n\nHelpful | 1", "joe.tromblee.2005Apr 6 at 11:35 PM\nIt made me fell like Spider-Man\n\nLay on your bed and play and just climb around its awesome\n\nHelpful | 0", "SquidDaddy81Feb 5 at 1:55 PM\nFantastic!\n\nThe opening sequence for the app blew my mind, as you truly experience the immensity of the space station and orbiting high above Earth. It was an incredible experience indeed being able to set foot (or hand) in the ISS and learn about the various aspects and facets of astronaut life. I think its just the pure scale of everything that really makes this app shine. The missions are pretty fun as well! Ill echo everyone else and warn that you really need to be careful and move slowly while using the app... other wise youre inviting almost instant nausea. And god help you if you decide to enable two hand rotation... Lol. Cant say enough good things about the app! Well worth a try, simply for the experience of being in space.\n\nHelpful | 7", "RauelRualbeMar 6 at 9:08 PM\nAwesome\n\nGreat experience. Took me a good hour to work through the training exercises. I was deliberate and careful though. Could have easily spent more time there but I ran out of battery. And it's free!!!\n\nHelpful | 0", "mintygurlMar 23 at 12:58 PM\nGood visuals, bad control\n\nThe game has a great visual design, who wouldnt like to explore the space station? Unfortunately, it got me veryyyy motion sick in a matter of minutes. The controls didnt help and were hard to manage.\n\nHelpful | 0", "RayC_DOJun 2 at 8:14 PM\nWhat a rush\n\nFrom the opening flyby (no Soyuz though) to just the training level where you just navigate ... man oh man that is a rush!!!! I'm gonna have to add another room to my house just for VR. No furniture, just padded walls, and a recessed doorknob.\n\nHelpful | 0", "katie.bradyJun 10 at 8:07 AM\nPretty good\n\nAs other have said, motion sickness is a possibility with this. Inside the space station i couldnt really enjoy as the motion sickness was was too much, the only way to minimise it was to just move about by grabbing and pulling, drifting alone was quite nauseating. Outside on the space walk however it felt a lot better. Biggest thing to deal with outside was there initial fear of lecturing go and drifting away from the space station. After taking it slowly I managed to take more chances and it became very freeing. Quite mind blowing. Graphics and level of detail felt a bit clunky. Would have been nice for more educational details, like what various parts are etc.\n\nHelpful | 0", "TheFuturist47Feb 11 at 9:27 AM\nA little bit confusing but interesting\n\nThe mission objectives are a little confusing and I kept having this thing where they'd be trying to give me the objectives, but I'm holding a tablet and listening to it talk and both sources were talking over each other. The motion is a bit rough and moving around is a bit frustrating, but I suppose that's not unrealistic lol. One thing I found irritating is that you can't rotate or pick up the information tablets that appear when you click on something highlighted to find out more info about it. So I was like turning my head to weird angles trying to see the video rightside up. We should be able to pick those up. I will update this in the future because I haven't tried all segments of the app yet.\n\nHelpful | 2", "GanglorMar 14 at 7:10 PM\nNOPE!\n\nI literally played this game for 5 min and got a NOSE BLEED from playing it thats just how bad the motion sickness is as soon as I turned it on and started moving I got a head ache\n\nHelpful | 5", "matdaviesJun 1 at 9:26 PM\nAmazing\n\nFirst: turn on the two handed free rotation.\nThis is incredible, I explored the station docked a resupply module and sat next to the Canada Arm on an EVA just watching the world spin by for what seemed like forever.\n\nHelpful | 0", "vulpiosJan 25 at 10:55 PM\nAmazing\n\nThis thing is amazing. It really feels like you are in space doing actual missions. Loved the content and media, really rich information. Though, as a developer, I couldnt be here without talking about bugs .\n\nBug? (Most likely) so in the training session there is this step in which the lady voice tells you to go to the destiny module, since I was excited of being there I ignored it and went other ways, then she keep telling me that Im going in the wrong direction, so far so good.\nFirst bug, this instruction (going in the wrong direction) is a non stop. If you open any video (pointing finger) the audios overlaps\nSecond bug even after I went to the Destiny module it didnt stop couldnt find what/where I should do or go to it to stop there is no direction (yeah I know, there is the blue arrows though it stops outside of destiny module)\nThird one, I gave up on the training mission due the non stop wrong direction (even when I was inside the module it was telling me to go) . So I entered the mission (second screen in main menu) the first mission being a space walk. Aaaand guess what, the lady was there telling me I was going in the wrong direction, even though my mission was to go in a space walk.\nLet me know when you guys fix this or need any more help on testing it. It is the least I can do for you since you provided such amazing thing for free! \n\nHelpful | 0", "HopingDiamond32Mar 7 at 1:09 AM\nThis is amazing\n\nMy dream job is to be an astronaut but this game really helped me like get over my fears although i know it helps me if I do become an astronaut\n\nHelpful | 1", "LauramacMar 10 at 10:50 AM\n\nI love the idea of it and it really looks great when playing, but it I had to stop as it made me feel dreadfully sick, even for an hour afterwards, which I'm disappointed about as I won't go back to it now.\n\nHelpful | 0", "ronnietuckerJan 22 at 9:10 AM\nFreaks me out every time\n\nGreat VR experience. Floating through the ISS always freaks me out, and I don't get motion sickness in anything else. Just this one.\nGreat for the experience, but also for the knowledge of seeing how things work on the space station.\nDefinitely a must have.\n\nHelpful | 2", "KieranCollinsMar 21 at 2:40 AM\nPretty cool\n\nIts decent, could be a bit better, it was a little confusing trying to navigate around and gave me motion sickness for sure.\n\nHelpful | 1", "Wildcardspade58Jan 15 at 5:51 AM\nIncredible\n\nThis is an amazing experience to navigate through ISS. Maneuvering through the corridors was a little disorienting but I think it should be. And doing a Space Walk!! Holding onto the station and letting go for the first time my stomach tightened. Wow.\n\nI give 4 stars. Its a great experience but I would love to see this improve over time. Grabbing items is a little hit or miss and would love to interact with the station more. Hopefully, this experience gets some updates for the views too. Feel like the world isn't truly rotating but mostly staying stationary over Italy. I would love to see a more accurate starscape and occasionally the Moon. The educational videos are awesome too. I would like to see more hands-on examples, like squeeze this tube of food and watch how it behaves.\n\nHelpful | 1", "Mark-BlissJan 26 at 8:52 AM\nInteresting\n\n this is interesting and gives you some insight as to what its like to be in space, however go slowly through the game because it will make you dizzy. Its worth the purchase price just to get the feel of zero gravity\n\nHelpful | 1", "RockyandRamboFeb 1 at 2:19 PM\nAwesome Game\n\nWOW is right. This is such an amazing \"game\" or better yet learning experience. The controls for interacting is well thought out and flows like you think it would while in space. I had a blast, no pun intended, while playing. Only request would be, DO MORE, DO MORE.\n\nHelpful | 0", "Davidc13203Feb 6 at 2:41 PM\nUnbelievable!!!!\n\nI was left speechless This is one of the most amazing things I have ever experienced in my life. I am not exaggerating\n\nHelpful | 3", "shaun.walmsley1Dec 25 at 9:32 PM\nWow,amazing\n\nA great educational tool,Awsomne its free too 5 *****,5 stars, love the spacewalk in vr ,its amazing, realistic too, beautifull views of earth in earth orbit, thank you to who developed this simulation , love it\n\nHelpful | 6", "TalkingBurritoFeb 23 at 7:19 PM\nCool boy in this boy\n\nWhen I play ISS I cant get over the fact that they took SS and just put an I in front seriously what are you doing my dudes. This game doesnt feel like very much of a mission what the frick. I had to give my dad a blowjob to buy my quest and this is the first game I downloaded it ruined the experience for me completely. When i play games like drunkn bar fight and super hot I get to punch the dudes in the face like WAPOW and BAM but on here Im lonelier than shannon the frickin loser. This is the silliest game of all time like when I play the game it doesnt give me a boner like it does when I punch girls on drunkn bar fight.\n\nHelpful | 2", "keeperofkeysJan 28 at 2:32 PM\nAbsolutely Amazing\n\nA review cannot do it justice. ITS AMAZING AND FUN. Must must must try. Zero.Gs so people who suffer from motion sickness may experience nausea. Ease yourself into it before flying around. I cannot believe how great this is.\n\nHelpful | 0", "TexbevoFeb 23 at 8:13 PM\nGreatness\n\nThis is a great simulation for those fascinated by ISS and space. Highly recommend it.\n\nHelpful | 0", "Tripp_EJun 6 at 8:49 AM\nBEST\n\nThis hame is one of the BEST VR experience iv had\n\nHelpful | 0", "AleforgeOct 1 at 12:08 PM\nVery cool but made me a bit sick.\n\nThis is a really neat and realistic experience. If you ever wanted to learn more about the Space Station and get to experience what it feels like to float inside pick it up. Through out the journey you can highlight and bring up videos that explain most pieces of equipment. The game also has further \"missions\" that allow some pretty cool immersion, so there is much more here than a museum like experience. BUT be warned, even if you have had no issues yet with VR sickness this game might cause you to experience it. Such as right away when I started to move I began to feel a bit uncomfortable. It got worse once things started to rotate as I lost my bearings and had to close my eyes several times to steady my balance. Funny enough you can grab onto the rails to stop things from spinning and move around, so the immersion of \"saving\" yourself via holding on is kind of neat I guess. After about ten minutes though I started to feel the need to pull off the goggles, which was the first time ever using VR. I pushed myself through it and things got a bit better but afterwards I felt a bit nauseous. Just a bit of caution.\n\nHelpful | 46", "charhashopeJan 25 at 12:22 PM\nOh the nausea\n\nI love space. This is a really cool experience as far learning and getting an idea of what its like. But boy was I nauseated from the quick turns and motion controls. I guess thats realistic though, huh?\n\nHelpful | 0", "ImAHuman5Feb 5 at 2:45 PM\nSo Great!\n\nThis game is AWESOME! Its so neat to actually feel like youre in space. I would pay real money for this game, but its free! Amazing experience.\n\nHelpful | 0", "JuiceHavocApr 26 at 6:34 PM\nAmazing\n\nI thought I would give it a try and when I went in I felt like I was in zero gravity and the trip outside the space station was so beautiful\n\nHelpful | 0", "bovinusJan 1 at 5:33 PM\nVery, very good\n\nA really nice recreation of the space station with excellent controls and loads of detail.\nControlling the arm to dock a supply ship was a genuine wow moment, the immersion is incredible, you really do feel like you are operating the controls and trying to coordinate the arm via monitors and looking out the window.\nI couldn't suss out how to open the hatches, maybe you can't and the outside of the station looks a bit smaller than the actual one with less detail than inside but these are small complaints compared to how awesome the rest of it is.\nWould love to see some more missions like damage repair or emergency situations.\nI didn't suffer from the motion sickness other reviews mention so I guess some people are more sensitive to it than others.\nDownload this amazing experience, it's free and better than quite a few paid apps on the store.\n\nHelpful | 0", "TrickiMar 7 at 8:15 AM\nEhh\n\nIt makes you very motion sick and controls are very difficult to use.\n\nHelpful | 0", "cdjones2720Feb 23 at 1:34 PM\nGreat\n\nOne of the best vr experience\n\nHelpful | 0", "Monkey46404Jan 18 at 2:02 PM\nI love it but\n\nMotion sickness and I dont think you can use the wrench or flash light unless Im missing something. Other than that great game!\n\nHelpful | 0", "BlzDeep420Feb 8 at 7:52 AM\nOnly game I still get motion sick from\n\nIt took me a few months to stop getting motion sickness from any game that I walked and couldn't teleport in however, this game still gets to me within minutes of playing. :( I will say this however it's visually stunning\n\nHelpful | 0", "robert.vojcikDec 7 at 2:27 PM\n\nIf you are the space and NASA fan, you will love it. Great idea and I wish for more missions and tasks. Great potential is there, i hope there will be upgrades or addons in the future.\n\nHelpful | 4", "WrathFulMyerFeb 11 at 3:30 PM\n\nI was looking at this game and it looks awesome\n\nHelpful | 1", "KeeganKraze12Jan 3 at 7:30 PM\nMy Dream Come True\n\nI LOVE space! Its been my dream to do what I can in this game. Flying around, putting in packages, checking up on a satellite, even operating the Canadarm! GET THIS NOW\n\nHelpful | 5", "DaZombieSlyerJan 13 at 9:15 PM\nBe warned\n\nFun educative game however I have had to stop playing because of the nausea it produces. This is more and likely due to the zero gravity but over all its fun!\n\nHelpful | 1", "IzDaPeanutFeb 20 at 8:42 AM\nI get the idea\n\nI understand this is for education and all but its not at all fun to play \n\nHelpful | 0", "CommanderDawg95Jan 26 at 11:34 AM\nGreat game\n\nIve always wanted to go on the ISS, and I got to! I really love the experience, and I love being able to explore! However, I really wish there were more things to do, like some more experiments.\n\nHelpful | 3", "ll_Tech_llJan 12 at 9:11 PM\nPretty good with a couple issues\n\nI'm gonna start off by saying if you like space grab it.\n\nFor me the game was pretty to look at. The zero gravity was fun. The information was great. But it got pretty glitchy sometimes and I got motion sick. I have a pretty good stomach but it got to me.\n\nHelpful | 1", "Adam603kirJan 31 at 1:09 AM\nIt's Amazing!\n\nThis is great game, i could even pay for it!\n\nHelpful | 0", "SankyuDec 20 at 8:57 AM\nTerrible Navigation\n\nNot only do I get motion sick. I also get haunted by a crazy lady, telling me every 15 seconds that I'm going the wrong way even if I'm heading in the right direction. Even when I started to travel in space. Already from the first 3 seconds I enter the other level, the crazy monotone lady keeps pestering me about going the wrong way. Don't bother installing this.\n\nResponse to developer: I did try to do the mission, and tried many times every solution I could think of to progress. Looked through every doorway I could find. Looked for blinking objects, markers (even on map), etc. I used the map for every step and turn, but to no avail. I even followed the arrows that floats in mid air, but suddenly they tell me to go back again when I follow them after a little while.\n\nI'm honestly not sure if your response was partly an insult, or not. Or maybe you view me as dumb? I can understand by the way I wrote my review because I was so tired, but believe me, after a significant number of times with the same voice line repeating in your head over and over, who wouldn't go nuts? xD\n\nI didn't mind that specific line the first few times, but by the gods, at least give clearer instructions on where to proceed :) I had no intentions to write this review to act like a jerk, and by the looks of it, my review does not reflect the amount of tries I did before posting said review. I should've gone into details the first time.\n\nOn the other hand, telling me that I'm going the wrong way in each direction ain't helping me at all. If the voice had told me I'm getting colder, or hotter towards my destination, now that would've been helpful (and entertaining) :P\n\nI'm sure the rest of the game/experience is cool, but the thing I mentioned was the specific one that is terrible. And because I couldn't get around your confusing navigation system, you assume I didn't know I was doing a mission? Like, honestly? ^-^ Please, don't jump to conclusions, cuz it's unprofessional. But feel free to ask me.\n\nHelpful | 6\nDeveloper ResponseDec 19 at 4:42 PM\n\nI think you wanted to do it in free play, not mission mode. If you're in Free Play the crazy lady quits trying to help you finish missions you didn't know you were doing. :)", "EliteFireJan 11 at 6:16 PM\nMade me really sick, very quick\n\nI liked this game but only the first minute of it because once I started moving around I kept falling on the ground because of the bad controls, so I had to play the rest off it sitting on the ground. Then the tutorial introduced moving around with your hands and it took me about 15 seconds of that before I started to feel nauseous and ran to the trash can. Now just thinking about the game made me not want to use the oculus quest ever again.\n\nHelpful | 1", "ezingJan 31 at 9:19 PM\nOnly if you dont puke\n\nGreat experience if you dont suffer from motion sickness. Gave me VR hangover. Other than that, looks pretty good.\n\nHelpful | 0", "Brownin89Dec 25 at 7:19 AM\nMotion sickness\n\nThe experience was great for the first 5 minutes but then I started to feel really sick. I stopped playing but the motion sickness continued for a good 30 minutes. This is the first app Ive used that has caused this. Id say if you can stomach it then great, otherwise AVOID!\n\nHelpful | 0", "Crowley_Mar 30 at 12:55 PM\nBeautiful game- massive motion sickness\n\nLoved the concept of the game, it's fairly intuitive and runs smooth. Visuals are very nice and it is very immersive. However, it's not for me, I normally do not get motion sickness at all and this game had me feeling awful for quite a while after playing it for only 20 min.\n\nHelpful | 0", "jedd.lawrenceDec 31 at 5:14 PM\nWow\n\nWow just wow things you would never get to see great. Little disorientated at first zero g but got used to it\n\nHelpful | 2", "zachklippNov 19 at 8:29 AM\n\nI became 10 years old again as soon as I grabbed the Canadarm joystick. My childhood dreams have been fulfilled.\n\nThere aren't that many modules to explore, but it's still incredibly fun to turn on 2-handed rotation and zoom around the cabin.\n\nHelpful | 9\nDeveloper ResponseDec 19 at 4:52 PM\n\nGlad to hear that Zach! It's funny because a lot of other reviewers clearly don't like the freedom of two-handed rotation and zooming around. But we made it for people who want to push their boundaries, and you're one of them!", "PeteyPakDec 20 at 6:40 AM\nPoor implementation\n\nI cant comment on the content itself, I quit in frustration after the introduction, over the controls. When teaching you how to move, the movement controls are disabled, preventing you from trying it out yourself. You need to listen through a description of how to move while being prevented from moving. Its unpleasantly frustrating.\n\nMovement uses the control stick direction, but the direction of the movement depends on where youre looking, and ignores the control stick orientation. It would seem to be more natural move in the direction the controller moves in.\n\nThe action of pointing and selecting things is done with the grip button, (which is already used for gripping), instead of the trigger button thats universally used for selecting things in the Quest menus and in the menus of this game.\n\nI appreciate the full 3D orientation of the ship around you, but it clashes with the 2D diagram on the info palette, and the game cant seem to decide what to go with - you appear for the first time oriented with the station looking flat around you, then the world is thrown off-kilter while you are trying to learn the movement controls, which is not the right time for that. Making the first trip from one end of the station to the other, constrained in the plane of the diagram, would be better for concentrating on learning movement, then tell users theyre ready to explore and give them a slight kick off kilter after controls are learned, *that* would be a wow-moment. But also just appearing with the station already at an angle around you would be an improvement I feel.\n\nI would definitely have preferred some visual aids, and give verbal descriptions only when needed.\n\nThe clunkiness of interaction makes this feel like an educational game rather than something intrinsically interesting. Repeat: Im not complaining about the content, which looks very good, Im complaining about the usability and experience which could definitely be improved.\n\nHelpful | 2\nDeveloper ResponseDec 19 at 4:48 PM\n\nHi Petey! Thanks for the feedback, we struggled with this, and did a lot of what you suggested first, but we found that people skipped everything and got right into it too quickly and got themselves sick. So we kinda had to force people to slow down and take it one step at a time. Everyone has different comfort levels and different ages, and a lot of our users were school kids, so we had to play it safe. HOWEVER, we did add the free play mode in the first menu for exactly that reason. Skip the missions and tutorials and get right into the action.", "ZFORCE08Jan 8 at 9:24 AM\nNice\n\nVery good game the only downside is you might fall down.\n\nHelpful | 2", "MistacaperDec 8 at 10:31 PM\nGreat game\n\nThis game is so realistic I had to take off the VR head set just to make sure I wasnt in space.. educational, and very fun!!\n\nHelpful | 0\nDeveloper ResponseDec 19 at 4:44 PM\n\nMISSION ACCOMPLISHED!", "pitlady2012Dec 13 at 10:38 AM\nNice job!\n\nIve always wanted see what its like to be an Astronaut. Very cool!\n\nHelpful | 3\nDeveloper ResponseDec 19 at 4:38 PM\n\nIt's never too late to change careers...:)", "KnittelManNov 23 at 1:28 AM\nI see the potential\n\nI really do see the potential for some awesome educational stuff in the future with this. The biggest reason I gave this 2 stars was just because I played for a while and I never found an easy time navigating. What I DO like is that theres multiple options to move. Use your hands, using the joysticks, etc. but I also just found myself getting a bit disoriented where I had to stop because it just got a little annoying.\n\nI hope more educational stuff like this comes out though. I like seeing the experimentation.\n\nHelpful | 4", "xendarqSep 29, 2019 at 8:13 PM\nWorth getting a VR headset for\n\nThis is the kind of experience for which VR was made. It's educational and opens up a space (and actual space) in a way that seems unimaginable without a 3D immersive environment. Here I am, floating in (and out of) a tin can, far above the world. Incredible.\n\nHelpful | 6", "tuismJul 15, 2019 at 10:51 AM\nAmong the best in VR Edutainment\n\nReally great production, great feel, the navigation is *chef's hand* magnifico. Great use of media and great information.\n\nOnly complaints are that I would have liked a little controller vibration when a hand touched a surface, and a close button for the video panels. And maybe a little bit more obvious goals during the missions (like the target for the arms mission)\n\nAnd it's FREE?!? Get outta here! :D\n\nHelpful | 226", "karlalansandersDec 10 at 7:18 PM\nMakes you feel sick but nice idea\n\nI really like the idea of this app however it very disorienting and made me feel really sick, I had to take my headset off to have a sit down for a bit to feel good again!\n\nHelpful | 1\nDeveloper ResponseDec 19 at 4:44 PM\n\nThe butterflies and disorientation are something that Astronauts train for months to deal with, and we're putting you right in it. We definitely suggest making sure two-handed rotation is turned off, if you don't have your space legs yet.", "orestes.vega.63Oct 18 at 5:05 AM\nThis is a must get app!!!\n\nThis is exactly what I was hoping to experience with my Quest. ISS is a wonderful example of what VR can truly be. It is a lot of fun, very informative, challenging and a visual delight. This has been an all around great experience. I use it all the time when showing my Quest to my friends and the reactions have always been fantastic. The EVA outside the station is amazing, plus the station has some missions and accomplishments to perform so it has you coming back for more. I hope they continue to develop this to even more things like coming in to dock with the station so you can board the station and simulate departing the station or making repairs or performing some on board experiments would be great. Congratulations to all who worked on this wonderful VR experience.\n\nP.S Did I also mention that this is FREE!\n\nHelpful | 4", "jobbie1kinobiNov 12 at 1:25 AM\nThe reason for VR\n\nThis experience is outstanding and so realistic, to the point that I completely lost my real world bearings and actually thought I was upside down! The micro gravity is so convincing and its an extremely educational and fascinating app. It did give me realistic motion sickness as well though! Still worth getting and free!!!\n\nHelpful | 3\nDeveloper ResponseDec 19 at 4:57 PM\n\nWe aim to be the only app that can give you motion sickness on purpose and still get 5 stars. Victory!", "DeepchargerDec 11 at 8:09 PM\nits a ok\n\nthe game itself is actualy pretty cool but i cant play it for longer than 10 minutes with out getting sick and i dont get motion sick but this game made me sick the rest of the day so just be warned\n\nHelpful | 0\nDeveloper ResponseDec 19 at 4:40 PM\n\nThere's two ways to get sick in VR. One is bad performance, and one is an experience that would make you sick even if you did it in the real world. We were worried we fell into the former category even though the performance testing said it should be fine, but then actual astronauts tested it and told us \"nope, that's how I felt the first week I was on station. When you don't know where UP is, and you can float and drift, your body takes a while to get used to it.\" Hope you recovered!", "Stampy2330Jan 2 at 1:00 PM\nThis is crap\n\nTo me it is boring there isnt anything much to do developers can you add more to this game\n\nHelpful | 1", "soccerstud703Dec 11 at 3:08 PM\n\nI think that it was amazing\n\nHelpful | 1", "olivierccNov 17 at 4:47 PM\nThe only game that made me sick so far\n\nI wanted to like it, it seems nicely done and it's free, but I could not make it past the training as it was giving me motion sickness, I had to turn off the oculus for a while. There is too big of a disconnect between the motion of your body moves and the motion your eyes perceive\n\nHelpful | 0", "adyan2015Nov 30 at 3:15 PM\nAdyan\n\nIts nice games\n\nHelpful | 0", "invisibledig266Dec 4 at 6:13 PM\nI would pay for this!\n\nCant say a bad thing about it!\n\nHelpful | 0\nDeveloper ResponseDec 19 at 4:49 PM\n\nThat's what we aim for. Thanks for leaving a nice review!", "Crazy_SaneSep 24, 2019 at 5:41 AM\nAn Amazing Experience\n\nFor anyone that dreams of being an astronaut, this experience is a dream come true. It's fun, educational, and at times, terrifying. The level of detail is impressive and you get a great sense of what life is like for the astronauts. Moving around in micro-gravity is a blast and there's short missions to complete. Best of all, it's free. Thanks, Magnopus/ Oculus!\n\nIt reminds me of Lone Echo, which I hope will come to the Quest.\n\nHelpful | 57", "NathantakesLsJul 15, 2019 at 9:11 PM\nIts free?!\n\nLet me save you some time so that you dont have to read my review, get it, its fricking awesome.\n\nThis game feels like a a full game that you could buy and yet it is free! When I was floating around in the space walk, using my boosters to fly around and climbing around on the ISS I felt like a little kid again.\n\n\nCrazy how it is free\n\nHelpful | 44", "MightyQuinnJOct 30 at 10:29 PM\nThis is INCREDIBLE!!!\n\nSo I will say maybe play this seated so you dont get off balance and fall over. But this game is crazy cool how it makes you feel like your actually floating in space\n\nHelpful | 0", "bruce460460Oct 13 at 6:49 PM\nAwesome but bad motion sickness\n\nI really wish I could play around in the game longer but after 10 minutes or so I was feeling really sick. It looks amazing for those not prone to motion sickness. Feels like youre really up there!\n\nHelpful | 0", "How_is_your_dayOct 22 at 10:00 AM\nShort, free, and fun!\n\nSpace is a pretty cool topic, but the way you can zip across and pull yourself to places is great. Not much to say really. IT IS A MUST GET! Its free so why not?\n\nHelpful | 1", "QUIX1986Oct 12 at 3:00 PM\nThanks!\n\nIts free, its beatyfull, its cool, its informative, and you can fload endless in space to enjoy the lonelyness ;-)\nIts awesome!\nThanks!\n\nHelpful | 0", "backup30132Oct 27 at 5:58 AM\nGreat game\n\nThis game is awesome the movement I great and also I wanted to say that I did get a little sick but that is not there fault\n\nHelpful | 0", "ChangeMyMindSep 18, 2019 at 5:42 PM\nAwesome experience, and its free!\n\nReally fun, especially for a free game. The only issues I have are that vr users who get motion sickness easy will be very uncomfortable and not much replay ability (its a bit short)\n\nIts FREE! So get it, its very fun and worth it.\n\nHelpful | 2", "djoz123Oct 22 at 5:51 PM\nAn absolute MUST! and free to boot?!\n\nSo very cool! I mean the most fun you can have while learning so much! Now when I see stories about the space station, I know\n\nHelpful | 0", "satishgodaOct 7 at 10:23 PM\nOne of the best examples of VR\n\nI love this experience. I can never be an astronaut in real life, but can be in virtual life. Thank you for making this.\n\nHelpful | 2", "EBattiSep 14, 2019 at 8:09 AM\nBEST EXPERIENCE EVER!!!\n\nThank you, oculus for blessing us with this AMAZING game, me and my family LOVE it!!! PLEEEEEEASE announce that LONE EHCO AND LONE EHCO 2 are coming to the quest, because this feels VERY similar to LONE EHCO!!! (Not calling it cliche or anything)\n\nHelpful | 3", "blocker_5417Nov 27 at 2:28 PM\nOMG\n\nmake me dizzyness i know its free . this not my game\n\nHelpful | 0", "CasualCheetahSep 8, 2019 at 7:19 PM\nGreat VR Museum Piece\n\nVery entertaining and insightful! The chance to navigate the ISS and see equipment demonstrations from astronauts was a blast. (The missions/'content' however aren't particularly engaging.)\nZero-G locomotion is a tad difficult to get the hang of, but it ultimately makes for a more immersive time.\n\nHelpful | 0", "mystickidSep 1, 2019 at 9:19 AM\nUnglued at Last\n\nIm still learning how to maneuver the Canadian Arm on the International Space Station. Theres a cargo vessel floating out there almost within my grasp waiting for me to bring it in to dock. Its not as easy as it looks. Once in awhile I cant help but loose my grip on the joystick and marvel at the curve of the Earth below me out the window.\n\nIt only took 50 some years to get here. Its just yet another unexpected gift that gaining 3-dimensional sight and access to virtual reality has given me. All thats missing from this once shattered dream is weightlessness. It Is right outta a childs dream. One often played with, loved at, lost to adulthood but never quite forgotten. The very first Space Camp ended it the day when our instructors, Lieutenants John and Andy, brought a docking simulator into our classroom. It was really just a rough-looking box of wood with a couple of levers in the front and a little rectangular window to look through, but to us it was the nose cone of a Gemini capsule looking out into space. Through the cross hairs was the docking grid on the snout of an Agena spacecraft, standing in at the time for a yet to be tested lunar module.\n\nIt wasnt known yet how the real objects would react in weightlessness. How would they come together? Would they repel or bounce off or just float apart? How does one guide them in and grapple them together? Maybe it wasnt even possible! Still every future mission depended on astronauts being able to dock in space. All the kids took the simulator very seriously. Everyone in turn tried it, some were uncoordinated, others too slow, but eventually they would all center the target and dock successfully.\nThen it was my turn.\n\nI couldnt do it. Everyone else went on to the next project; we had our final competition coming up, an egg reentry vehicle design contest. But I kept trying and failing, trying and failing the docking maneuver. Why cant I do this? For the first time, living in a 2-dimensional world instead of a 3-dimensional one wasnt just about bumping into full-length mirrors and saying excuse me. Everyone else would look at television, or a movie, or through a camera viewfinder and see one less dimension than they usually did. For me there had never been any difference. There had never been more than 2 dimensions. Was that why I couldnt dock the simulator?\n\nOver and over again I tried until Lt. John shooed me away from it without saying a word. I went back and tried again. He put a table cloth over it. I snuck back under it to try again. They moved it out of reach in another room. Please, please, Lt. Andy, please let me try it again. I can do it. There must be a way. I dont wanna wash out. Please Lt. Andy, I can do it! Up close he seemed as tall as one of the rockets at the NY Worlds Fair. The young mans expression told me everything I didnt want to know. He added: Im not going to be an astronaut either, you know, honey. Im not a pilot. Im just a soldier. What he said glued me to Earth for sure. It reminded of a much more important reality than mine. More important than just my being earthbound forever. We were at war in Vietnam and Andy was a soldier.\n\nHelpful | 3", "jaumemussons79Oct 15 at 10:34 AM\nFantastic\n\nA free title that competes face to face with the best paid ones\n\nHelpful | 2", "dz1000Sep 28, 2019 at 6:12 AM\nTerrible motion sickness\n\nI can see how well made and interesting this app is but unfortunately i am very prone to motion sickness and this was terrible for that. Oculus, in their wisdom, rated it as moderately comfortable, which is a load of baloney. It is bad, really bad for someone like me. If you don't suffer from motion sickness then I'm sure you will find this app interesting.\n\nHelpful | 2", "BudapestiJul 16, 2019 at 4:54 PM\nSitting in a tin can.\n\nOriginally, I misread this as Mission: ISIS, and thought you got to take down Middle-Eastern terrorist compounds from an orbital death ray platform. After my initial disappointment, I found it to be quite good.\nAs someone who is too old, too fat, and too guilty of writing dodgy things about the United States on Twitter, this is probably the closest they'll ever let me get to the International Space Station.\nVery good simulation. I'm docking (pun intended) it one star because there isn't a mode where you're being terrorized by an Extraterrestrial Biological Entity. However, if you just want to experience the awe, majesty and l'ennui of life in space, this is a great way of feeling even more insignificant than you actually are.\n\nHelpful | 8", "TylerCReevesAug 24, 2019 at 8:57 PM\nThis is free!?\n\nHonestly this is crazy impressive for a free game. I have no complaints and would love for them to update this with more modules added... and maybe make everything to scale, I dont know for sure, but it feels at least 20% scaled down. Just looking at the dragon capsule and sleeping quarters, it all feels to small. But serously, this is dope! Taking me to a place id never think id be able to go to is what VR is all about!\n\nHelpful | 2", "BtomaekOct 27 at 12:16 PM\nIt good and bad\n\nThe movement can be the worst thing depending on the player\n\nBut the remake of the Iss is the best\n\nHelpful | 0", "Xdgaming101Oct 20 at 5:00 PM\nThe game bro _\n\nCant wait to play when my oculus quest comes.\n\nHelpful | 0", "itsDavidDugganJul 17, 2019 at 6:26 PM\nFantastic\n\nA great introduction into VR with an engaging 'story'. The experience is quite unique and obviously unbeatable as it's free. I would've loved if there was even more to do within the game such as more missions and tasks as I would've spent much more time in the game as it looks and feels very good.\n\nAlthough I did find the controllers loosing tracking multiple times and switching from hands back to the controller icons when they got too close to the virtual walls within the game. This was very immersion breaking as your vr hands would no longer be able to grab onto the walls when they switched back to the controller icons. Hopefully this will be fixed with an update, creating a much more immersive experience.\n\nHelpful | 3", "christianhotdogOct 9 at 3:51 PM\nQuestion.\n\nI have it but there's always an error like \"entitlement check failed, press any button to exit\" and idk how to fix it. When it gets resolved then I can give it a review. Deeply confused.\n\nHelpful | 1", "LeventDJul 20, 2019 at 12:21 PM\nA prison in the sky\n\nBefore that, I couldn't think all those astronauts were confined in a space that small for years. Their mental stability must be enormous.\n\nAlso I want to point an interesting thing: While traveling inside the station with control stick make me sick, grabbing a ledge and pushing myself to destination feels perfectly normal. This approach may be an important key to travel in virtual places without creating a discomfort, a way to trick the brain to better accommodate the situation.\n\nHelpful | 4", "Spike_VR_Sep 26, 2019 at 6:17 PM\nAwesome!\n\nGreat experience that has a couple hours of educational content. Relaxing and Fun!\n\nHelpful | 1", "esalsaAug 23, 2019 at 11:12 AM\nFantastic\n\nInside the ISS is good, but the spacewalking is amazing (and beautiful). Cant believe its free. Illustrates that the best bit of virtual reality is being able to go where its unlikely for most of us to go in actual reality.\n\nHelpful | 3", "hargisssAug 14, 2019 at 8:31 PM\nDisorienting, in a good way!\n\nBeing in VR can sometimes be disorienting. When in VR I sometimes lose track of whether I am pointing north, south, east or west. I sometimes get confused about where I am. But I never get confused about which was is up and which way is down. Or I didn't, until now!\nThe ISS feels a lot closer than it did 20 minutes ago, zero-gravity less theoretical.\n\nHelpful | 0", "HoogVaalsOct 6 at 4:24 PM\nMotion sicknessy awesome\n\nyou can really feel the no gravity\n\nHelpful | 0", "SheepismAug 27, 2019 at 8:55 AM\nIncredible but\n\nThis is amazing for a free game but their are problems that might be a me problem. Sometimes the hands turn into the controllers and sometime i can't grab something but instead I grab on too the air like a foot away from the object\n\nHelpful | 0", "Hawat1Aug 11, 2019 at 7:00 AM\nFantasic Experience\n\nWow. One moment you sit in your lounge and the next you float in space onboard the ISS 380 km above the earth. Very immersive experience - the movement in zero g is very well emulated. Its fun to float around and explore the ISS with nice educational videos to watch.\nThe details are impressive and the graphics hold up even if you look closely. The only criticism I have is that the view of the earth doesn't change. Would be nice just to look thru the observation window to see the earth go buy - maybe even with real time day/night cycles.\nBest of all - its free ! This is running circles around the Apollo 11 experience which costs money. Thanks Oculus - it seems you really care about your customers.\n\nHelpful | 1", "mason.letotoJul 29, 2019 at 11:44 AM\nThumbstick movement gets me \n\nI avoid using the thumb sticks to move as it makes me motion sick real fast, the combination of a tilted space and navigating through it is painful(especially the right thumb stick)\n\nMaybe I shouldnt blame the game, as Ive heard motion sickness goes away with time and practice! I couldnt get past the first part where I needed to take a bag somewhere, so I quit and played super hot and gun club vr:) seems like a good game though and Ill give it a try again to get my vr space legs!\n\nHelpful | 2", "entangled_mintAug 22, 2019 at 4:40 PM\nNot that easy to master lol\n\nI could only take 15 minutes first try as motion was getting much. It's quite hard to not spin and lose control. Have to perfect grip lol! And I will continue on. It is very well made\n\nHelpful | 0", "KittyLand2004Aug 10, 2019 at 5:29 PM\nAND ITS FREE???\n\nIts amazing!!! Its just so good! Its a lot of fun to mess around with as long as you arent super prone to motion sickness. If you do get motion sick and dont want to throw up inside your headset, this is not for you. Other than that, CEASE THE FREE OPPORTUNITY!\n\nHelpful | 1", "robin2832Jul 27, 2019 at 2:36 PM\nCould use an online mode\n\nHonestly, I think this is perfect in entertainment but, it would be cool if like you can talk to other people or play tag and stuff like that. Also, it would be cool if it had a little story and events occur or like you go to the moon and get to put the American flag in the moon. If you are thinking Im adding something to the game these are some ideas that would make the experience longer Thank you for reading.\n\nHelpful | 4", "CBBCCBBCJul 25, 2019 at 4:48 AM\nEye opening experience\n\nI really enjoyed the experience of floating around the ISS and floating around outside the space station. It really put the scale of the craft into perspective! It was also nice to watch the earth rotate beneath you. The game has its limitations but for a free game it is a really nice production. A lot of thought and effort has gone into it!\n\nHelpful | 1", "pmgahanSep 6, 2019 at 10:15 PM\nAwesome\n\nGreat experience to be able to be in the ISS for free!! You do get dizzy but thats what I would expect where there is no up or down!\n\nHelpful | 1", "lanhawx33Sep 5, 2019 at 1:26 PM\nCool idea\n\nI think it it so cool that you can go into space in VR. And VR looks like your really in it so you can feel like your in space. As a kid that likes space, this is going to be perfect for me.\nIm definitely going to play this in my free time\n\nHelpful | 0", "wildBcatJul 24, 2019 at 7:30 AM\nAnother game I think is worth more\n\nWhen the Anne Frank game came out I thought the experience was amazing and educational, and it was surprising that it was free. I have had Oculus games that I didnt think was worth the money, and I felt that game was too good to be free. I thought it was an amazing one time thing, but then this game comes along. It blows me away! Not only is it educational, but it is well made and continues to be fun to use. My only complaint is I wish I could have paid for it. If anyone knows a way to provide financial support for the people making these free, awesome apps, please let me know!\n\nHelpful | 5", "GeeBee2Jul 16, 2019 at 5:32 AM\nWeightless and Priceless\n\nI've never been to space and never been weightless but this is the closest I will probably get. We've all seen the ISS crew propel themselves through the station by pushing off the walls. Now we can all get that feeling. I haven't got to the space walk yet but I can't wait. I can't believe this is free, it's much better than some of the 10 apps on here. Buy it, try it, hope you love it like I do.\n\nHelpful | 9", "vaibekJul 18, 2019 at 12:52 PM\nDream come true.\n\nif you are a astronomy/space fan and enjoy learning about what humans are doing in space this is a great experience. If you have always followed iss news and watched the live feeds from the iss this game is for you. With this game you are transport to the iss. A dream come true. This doesn't seem to be full game but more of an experience. Basicly the only negative is you will want more.\n\nHelpful | 8", "Ch0derockJul 23, 2019 at 8:27 AM\nGreat but could use some tweaks\n\nFirst of all great app. Its wonderful to be able to experience the layout of the ISS and a spacewalk first hand. The training explains everything very well and the mission waypoints get you where you need to be. The view of the Earth from the station and space is spectacular.\n\nI only have two problems though, both relating to the controls and I really hope the developers read this as I dont know how to otherwise contact them. The major problem is the inability to invert the y axis on the right thumb stick. I am so used to this configuration in every game I play and the lack of an option is a startling omission in a first person experience where the view can be controlled with a thumb stick. A minor problem also has to do with the view controls and its the lack of a smooth movement option when controlling the view. I can work with the 30 degree snap movement but it is somewhat disorienting because this is quite obviously not how looking around works in real life and it makes controlling the experience more difficult than it has to be. I understand that snap movement helps some people with VR sickness which is why this and the ability to invert the y axis should be options.\n\nOtherwise excellent experience especially for free and I encourage everyone to try it out. I do hope the developers read these reviews though and that theyll maybe address these concerns in an update.\n\nHelpful | 0", "obi2kenobiJul 20, 2019 at 8:41 AM\nToo bad I'm stuck with gravity\n\nBecause the rest of it is pretty convincing! The inside of the ISS is quite detailed, and it's neat to watch a video about something on the ISS like the exercise bike then go check it out in VR.\n\nLocomotion around the station is pretty awesome. You just grab rails or push and pull off any object or wall. Pretty fun to float around.\n\nThere are two \"mini-games\" associated with the experience. One is controlling the canada arm, and the other is going on a spacewalk (no walking of course, you just jetpack around). The spacewalk did reveal to me that the outside of the ISS looks quite rough compared to the inside, but its all still very beautiful and looking down at earth almost makes it feel like a star wars planet.\n\nThe spacewalk was probably the most unrealistic part physics wise. If i launched myself by grabbing hold of the station and pushing off, hitting my jets would instantly stop my momentum. Same if I was moving and grabbed the station i would stop instantly which isn't realistic.\n\nBut overall pretty fun experience. I didn't even 100% it but still spent at least an hour. Probably a $10 value here comparing it to other apps.\n\nCheers\n\nHelpful | 1", "JohanTEAJul 18, 2019 at 1:26 PM\nSit down!\n\nSeriously, sit down! At least the first time you start this app. Floating around in space, controlling 3 directions, made me a bit nauseus in the beginning but after a while I got used to the controls.\n\nThis is a really nice experience! It's really interesting to float around and explore the ISS. It's both big and small, but you really get a good sense of scale of it this way. The outside parts are huge but the available living space inside is really not that much.\nAlso, I'm proud to have only destroyed the station once while doing the docking mission. Ehrmmm... []-)\n\nHelpful | 1", "EllouJul 18, 2019 at 2:02 AM\nGood & instructive experience !\n\nI cannot reach Mission 3. After Mission 2, I have congratulations from mission control, professional job blabla... But then, it keeps relaunching mission 2 endlessly when I go to mission tab, I am never asked to perform mission 3.\nThat's why I removed 1 star.\nStill some issues as well (I recentered view with Oculus button during mission 2, and I was teleported outside space).\nBut overall, a great experience, nicely done and very instructive (I really appreciated the small NASA videos explaining stuff, only regretting there are not more of them).\nNicely done!\n\nHelpful | 0", "obsouleteJul 23, 2019 at 9:39 AM\nPeople ranted for a wireless hmd\n\nPeople always complained they wanted a wireless hmd so they could utilize the freedom of 360 degrees turning to look around.\nYes they could have a smooth turning option , I think all new coni g vr games should have both smooth and snap for turning and also to walk or teleport, but that's so no more complaints on that.\nWhat people done realize on this experience that they complaining bout the turn and ing is..... your in a WIRELESS HMD , and I dont get why they con ok laining bout how camera rotation is when if they want smooth turning just turn in real life , the whole need rotation on thumbstick complaint might as well stick to PC tethered since they playing the same as if they was.\n\nAnyway developers I found this experience to be very entertaining the feel of zero gravity and maneuvering through like that , even though I in real life had full gravity, felt like I was actually threre.\nI also like the option of two hand turning g for added realism , where it put you upside down and suck was cool.\nThe graphics was amazing, the whole thing very realistic, only thing I would want but not complain bout ,is if y'all do update maybe a couple more missions. Great work tho is was neat.\n\nHelpful | 2", "stachowiJul 16, 2019 at 5:30 AM\nYes!!! One of my favs and its free!\n\nThis is an EXACT port from the rift... but better because youre not tethered.\n\nThis was one of the experiences I was hoping for and here it is, for free too!\n\nIf youre into space, learning, or just experiencing what VR is all about then you have to try this out!\n\nHelpful | 8", "franciozzyJul 22, 2019 at 4:37 PM\nAmazing experience\n\nI am really enjoying spending time in this app. It is informative, fun and very engaging! The missions are awesome. Im only holding a star back because the navigation could be better; turning goes 30 degrees at a time which breaks the illusion a little bit.\n\nHelpful | 0", "Kitba5hSep 20, 2019 at 6:11 PM\nWow\n\nMagnificent!\n\nHelpful | 0", "YotieSep 29, 2019 at 9:13 AM\ncomfort : severe.\n\nI wouldn't rate this game comfort as \"moderate\" - it's very sickening for me and friends too.\n\nHelpful | 2", "etagimbel_gerJul 21, 2019 at 10:44 PM\ngreat experience\n\nVery good experience and for free. I wished the station would move so you could see different parts of Earth. But this would probably take too much resources. Maybe at least the Earth surface picture could be downloaded dynamically from a server and be updated from time to time? But that's probably too much to ask from a free app.\n\nHelpful | 3", "DAX_QcSep 6, 2019 at 6:30 PM\nNice\n\nPretty cool.\n\nHelpful | 0", "l0gan9999Jul 17, 2019 at 12:13 AM\nIt's FREE!\n\nWith everything going on the at the moment 50 years on from the Moon landings what a perfect time to drop this app on the store. Within seconds it was wow, crazy cool to be propelling myself through the space station. The cherry on the cake was the space walk... how I wish I could do that for real!\n\nHelpful | 2", "vin_the_tacoJul 21, 2019 at 6:26 PM\nI cant even play the game\n\nWhen I start the game it says oculus entitlement check failed. Press any button to quit I have no idea wut to do\n\nHelpful | 22", "TimmyoppopJan 24 at 5:50 PM\nThis broke my vr\n\nIts stuck on loading screen and I cannot get out\n\nHelpful | 0", "philg7onr123Jul 17, 2019 at 9:31 PM\nAmazing\n\nThis is an amazing experience, already have this on my GO, but delighted it's now on my Quest, and it's free !\nI would suggest any space or science fans try this app, truly what VR is all about. Graphically excellent, a very real taste of the ISS and space walk.\nMany thanks for this amazing experience.\n\nHelpful | 1", "crazymurdock77Aug 7, 2019 at 11:47 PM\nHuge visual downgrade over Rift\n\nI'd played the Rift version, and really enjoyed it. Great bit of edutainment. So decided to have another play through on my Quest. This is without doubt the biggest visual downgrade between the formats that I have witnessed (and I've played Robo Recall, even that looks good in comparison to this).\n\nStill interesting, but if you have a Rift, then play it on that.\n\nHelpful | 1", "Tidep0d_1Jul 17, 2019 at 1:37 PM\nGreat experience\n\nI think this is a cool and fun experience . However I would like to see more interaction with objects and being able to control the big arm in explore mode. also there should be more space, more rooms, and more missions. 5 stars if added.\n\nHelpful | 1", "PrestoniLCFCSep 14, 2019 at 10:57 AM\nOnly game that makes me sick out of 8\n\nMoving around makes me feel sick terribley\n\nHelpful | 3", "rockinandroidJul 17, 2019 at 3:55 PM\nBest realistic space adventure!\n\nThis is a real nice simulation. Its as close as its going to get, near perfect. I had this on the Go and spend many hours exploring space. Love the cupola, great spot to chill. Looking forward to exploring it all over again, haha. If I had this when I was a kid I would be an astronaut now!\n\nHelpful | 1", "davereynoldsJul 21, 2019 at 7:28 PM\nFree!!\n\nWow!! Thank you to the powers to be for creating this program. The realism is fricking awesome. And it's free? This would have been worth paying for but thank you for giving it to us for free!. The tutorial videos are worth a watch. Did I mention it's free!!!\n\nHelpful | 1", "theoldwaybenJul 18, 2019 at 1:16 AM\nIt great\n\nIt the best free game ever I got dizzy I dont recommend standing up while playing but the move ment controls getting better\nIf oculus see this review make the look around (right trigger). It like more Smith not lik 30 degrees just like camera movement in call of duty\nGet it now\n\nHelpful | 0", "CaptainLukeAug 18, 2019 at 10:48 PM\nAmazing\n\nGreat experience for just a free game but warning if you easily get motion sickness this is not the game for you but otherwise brilliant experience\n\nHelpful | 0", "Godislove4uJul 17, 2019 at 1:44 PM\nNice free space travel\n\nIt is nice to get a treat for free.Obvious made it affordable to get into vr and made it possible too by launching the original dk1.Jesus said what is impossible for man is possible for God.It is the wisest decision and choice to choose to call upon Jesus as your Lord and Savior !\n\nHelpful | 1", "chrisxdeleonJul 22, 2019 at 1:46 AM\nBreathtaking!!!\n\nA definite MUST HAVE. And it's FREE! Spent hours on a space walk just admiring how beautiful the scenery was. I did not experience any glitches and everything ran smooth. Keep it up Oculus Studios. I can't wait to see what comes next.\n\nHelpful | 2", "hunterungerAug 15, 2019 at 7:41 PM\nThank you Oculus\n\nAn absolutely amazing experience. Its a must have for anyone with a Quest. Just be ready to get motion sick.\n\nHelpful | 2", "ionel.stan.71Aug 14, 2019 at 11:00 PM\n\nVery nice app! I like to see in the next update the real position of ISS around the earth ;). Thank you very much for great app!\n\nHelpful | 0", "hkubotaJul 20, 2019 at 5:02 AM\nAmazing Experience\n\nThis type of experience is what the Quest is made for: free movement freely looking around. What better to see how it might be at the ISS?\nTip:. Move slowly and don't rotate too much. I had to turn off the two-handed rotation as I was feeling queasy.\n\nHelpful | 0", "JakobakerJul 15, 2019 at 10:42 PM\nOne of the Best VR Experiences to Explor\n\nThe move mechanics are great but you really have to be careful or you will get dizzy. Such a cool experience! I love Super Hot and Tea for God but this is crazy and you feel like you are actually there.\n\nHelpful | 7", "elsitherinoJul 15, 2019 at 1:36 PM\nThe VR experience I've been waiting for!\n\nNo more having to watch a YouTube VR video, I can finally float around in space in VR. Relax a bit on an exercise ball or in a hammock to feel as close as you can to free floating.\n\nHelpful | 6", "jlivers09Jul 23, 2019 at 7:08 PM\nNever been motion sick before\n\nIve never been motion sick before but Im pretty sure this application did it to me. It was totally worth it thought!! Learned a little and had a lot of fun with the little missions.\n\nHelpful | 1", "jjugglerJul 15, 2019 at 10:57 AM\nBest Space Experience Ive had!\n\nThis tops the chart as one of my favorite experiences on quest so far. Its fun, educational and awe inspiring, plus simple and intuitive enough to share with VR newbies. Nicely done developers!\n\nHelpful | 4", "KC5000Jul 19, 2019 at 9:51 AM\nMakes Me Feel Really Sick..\n\nImpressive game But I cant spend more than a 5min because I get really nauseous from floating around. I guess thats why astronauts train years before they go up to space. Great free Content must have!\n\nHelpful | 1", "CODER41Jul 22, 2019 at 10:54 PM\nEducational but buggy\n\nI enjoyed the educational value of the game. They laid everything out with a decent amount of accuracy and injected educational information into the entire experience.\n\nI did get annoyed with the voice telling me I was going the wrong way when I was in the precise position and pod I was supposed to be in. Small complaint. However, the controls feel a little too loose. I was almost getting sick. And trying to hook up the canarm or whatever it was called, seemed impossible. Maybe Im dumb, but I could figure it out after 30min of trying.\n\nWould have been 4 stars if they reduce the movement sensitivity.\n\nHelpful | 0", "yamooseyJul 20, 2019 at 3:02 PM\nAmazing\n\nI have been waiting for a VR ISS game, and this game made it worth the wait. The fact you can pull your self around, grab objects, and go on spacewalks is just amazing. Plus, it's free, just get it.\n\nHelpful | 1", "Agent-MothmanJul 22, 2019 at 10:22 PM\nVery cool\n\nWhat can I say for the free experience it was amazing it's not perfect, and controlling the canada arm is super hard but it is such an amazing experience it's almost like being up there!\n\nHelpful | 1", "SalikenJul 25, 2019 at 5:32 PM\nNeeds gravity boots!\n\nThis free educational game is great! But, did make me motion sick. I think if the had a setting where you could put on gravity boots and then walk through the store ace station\n\nHelpful | 1", "HybridAlienJul 20, 2019 at 8:02 PM\nIncredible!\n\nGet this now it's free and your only chance to ever experience what it's like on the station. You will get motion sickness but that's a good thing. One word WOW\n\nHelpful | 2", "diablo944Jul 18, 2019 at 5:09 PM\nHow do I change snap view?\n\nOut of the starting gates it looks good on quest. Gentle movements on left analog saw it move well. But the right analog is doing snap views. I spent a few minutes bouncing off walls and falling to the floor as I couldn't get on with the snap view control. That same lack of real world feel was knocking me sick. A quick search hasn't yielded results on how to make the right analog stick smooth instead if snap. It looks awesome. Just that control method is killing me\n\nHelpful | 1", "agitokazuJul 16, 2019 at 10:26 AM\nBloody Brilliant\n\nThe Immersion in this interactive game in Brilliant, it's also good practice for when Echo Arena launches for the Oculus Quest in the Future ;)\n\nHelpful | 5", "magicbandzJul 25, 2019 at 4:53 PM\nWoah\n\nThis is awesome. Always wanted to know how it felt to be in zero G. The docking mission in the cupola was my favorite. Wish there was more of that.\n\nHelpful | 0", "ichirorabbitJul 17, 2019 at 8:32 PM\nBlown Away By The Scale\n\nI never knew just how big the ISS is or how small the dragon capsule is. Go outside the ISS and go from one end of the dollar array to the other. Very fun.\n\nHelpful | 2", "LusoWolfJul 25, 2019 at 3:23 AM\nAmazing!\n\nAbsolutely brilliant, simply the best experience on Quest, so far! I hope we'll get more space exploration apps and games.\n\nHelpful | 1", "polka_pandaJul 22, 2019 at 12:47 PM\nLike youre there!\n\nThis program is amazing, Ive never felt so familiar with the space station! Its almost like I really went for a visit.\n\nHelpful | 1", "Mr_ShadesJul 20, 2019 at 10:35 PM\nDoesn't Work\n\nAll I get is an \"Oculus Entitlement Check Failed\" message and then I get returned home. Until this is resolved, it's a waste of space on my device.\n\nHelpful | 10", "darwins.lastJul 22, 2019 at 9:54 PM\nVery Immersive\n\nI had to go a little slow on this one. Can be disorienting. Just like real space. Heck of an experience.\n\nHelpful | 1", "aaron.sommers.1253Jul 17, 2019 at 11:39 AM\nGreat App\n\nVery nice free app for the Quest, thanks development :)\n\nHelpful | 2", "bloodyagentJul 17, 2019 at 11:28 AM\nVery cool until I almost threw up\n\nMaybe it's only me but I'm disappointed with the game. Only because I cant play it! Just wanna throw up everytime I try.\n\nHelpful | 1", "N1ghtmar333Jul 25, 2019 at 3:32 AM\nAstonishing!\n\nThis is a must play. I can't put it into words you just have to play it.\n\nHelpful | 1", "darran.wikeepaJul 20, 2019 at 7:57 PM\n\nUnbelievable immersive experience the closest I'll get to space. Highly recommend this to anyone\n\nHelpful | 1", "sheppie73Jul 18, 2019 at 11:50 AM\n\nA fantastic informative application which really plays with the senses and free...brilliant.\n\nHelpful | 2", "lee.nicholsonJul 23, 2019 at 10:16 PM\nLove being in Space.\n\nA Good VR experience. A Good Orbital experience. But, does not follow the directions taught to us in 'First Steps'. Fails to take advantage of what the Quest can do.\n\nHelpful | 1", "jlapenoJul 19, 2019 at 7:52 AM\nRIDICULOUSLY SICK!!!! MUCHO FUNO!!!!\n\nGreat little app. Completely immersive. 27 stars.\n\nHelpful | 2", "ELECTRICT0MAT0Aug 1, 2019 at 12:31 AM\nMeh\n\nThe game could have been better. It makes you dizzy and doesnt really have to best and most enjoyable forms of transportations. The detail was pretty good. Yet I dont recommend.\n\nHelpful | 2", "dave.s.mcgJul 23, 2019 at 4:28 PM\nGreat\n\nThe space station is very cramp\n\nHelpful | 0", "dragonfruit123Jul 18, 2019 at 4:14 PM\nGood,but made me sick\n\nThe visuals for this game is impressive. Especially for a free game. But after a few minutes playing I didnt feel so good. Its probably because you just float in space.\n\nHelpful | 0", "mancintexasAug 23, 2019 at 5:13 AM\nNASA\n\nNot good enough to get to work and I m going to slop\n\nHelpful | 1", "computeryJul 17, 2019 at 6:02 AM\nCool\n\nIt's fun\n\nHelpful | 3", "Hero.of.HemelJul 21, 2019 at 12:03 PM\nAmazing\n\nAmazing\n\nHelpful | 1", "Havoc25cJul 21, 2019 at 1:26 AM\nCool\n\nCool\n\nHelpful | 1", "ianxgamer05Jul 18, 2019 at 12:37 PM\nNot good but not bad\n\nWhen I am pulling my self forward I fell like am about to fall so I sat down i feel like am going to be sick\n\nHelpful | 1", "Xanda1234Jul 21, 2019 at 3:18 AM\nIt makes your head feel weird\n\nIt makes you feel sick and it is bad dont waste your time on it !!!!\n\nHelpful | 1", "NINJINCARROTJul 22, 2019 at 11:31 PM\nThe lame poopoo\n\nI really think this game needs toilet training\n\nHelpful | 1"]