{"App Title": "République VR", "App description": "Developed over five years by industry veterans (Metal Gear Solid, Halo, F.E.A.R.), RPUBLIQUE is a thrilling and topical stealth-action game that explores the perils of government surveillance in the Internet Age.\n\nYou receive a call from Hope, a woman trapped inside a mysterious totalitarian state. By hacking into the nation's elaborate surveillance network and taking control, you guide Hope through a web of danger and deception across five thrilling episodes.\n\n Immersive puzzles and strategic choices\n Innovative, interactive developer commentary \n Incredible voiceover performances, starring:\no Rena Strober\no David Hayter (Metal Gear Solid)\no Jennifer Hale (Mass Effect, BioShock Infinite)\no Dwight Schultz (killer7, Star Trek)\no Khary Payton (Metal Gear Solid 4)", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Horror, Puzzle", "Languages": "English, Chinese (China), French (France), German, Japanese, Portuguese (Brazil), Russian, Spanish (Spain)", "Version": "1.2", "Developer": "Camouflaj", "Publisher": "Camouflaj", "Website": "https://camouflaj.com/republique-vr/", "Release Date": "July 25, 2019", "Developer Privacy Policy": "NEWS\nGAMES\nCAREERS\nCONTACT\nBUY\nNEWS\nGAMES\nCAREERS\nCONTACT\nBUY\n\nRPUBLIQUE PRIVACY POLICY\n\nThis page is used to inform Google Play users ofRpubliqueof our Privacy policies with regards to collection, use, and disclosure of Personal Information if anyone decided to use our Service.\n\nIf you choose to use our Service, you agree to the collection and use of information in relation to this policy. The Personal Information that we collect is used for providing and improving the Service. We will not use or share your information with anyone except as described in this Privacy Policy.\n\nThe terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, which is accessible at Rpublique unless otherwise defined in this Privacy Policy.\n\nInformation Collection and Use\n\nFor a better experience, while using our Service, we may require you to provide us with certain personally identifiable information, including but not limited to default device specification information in order to allow the Service modify quality settings based on optimal performance specific to your device. We do not store, send, or otherwise analyze any private data outside of device default configuration profile.. The information that we request is will be retained by us and used as described in this privacy policy.\n\nSecurity\n\nWe value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security.\n\nChildrens Privacy\n\nThese Services do not address anyone under the age of 13. We do not knowingly collect personally identifiable information from children under 13. In the case we discover that a child under 13 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us so that we will be able to do necessary actions.\n\nChanges to This Privacy Policy\n\nWe may update our Privacy Policy from time to time. Thus, you are advised to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately after they are posted on this page.\n\nContact Us\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us atprivacy@camouflaj.com.\n\n2019 Camouflaj LLC All rights reserved.\nAll trademarks referenced herein are the properties of their respective owners.\nFOLLOW US\nCONTACT US\nwhatsup@camouflaj.com\nPRESS INQUIRIES\nNA.PR@camouflaj.com", "Developer Terms of Service": "NEWS\nGAMES\nCAREERS\nCONTACT\nBUY\nNEWS\nGAMES\nCAREERS\nCONTACT\nBUY\n\nEND USER LICENSE AGREEMENT\n\nLast Updated: [7/12/19]\n\nThank you for your interest in Camouflaj, LLC (Camouflaj, we, our or us), the game you have purchased or access (the Game), and any of our related mobile applications (including headset device applications), websites, downloadable software, virtual reality products, and other products and services provided by us (together with the Game, the Service). Please read this End User License Agreement carefully, as it is a legally binding contract between you and Camouflaj regarding your access and use of the Service. BY DOWNLOADING, ACCESSING, OR USING THE SERVICE, YOU ACKNOWLEDGE THAT YOU HAVE READ, UNDERSTOOD, AND HEREBY AGREE TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS END USER LICENSE AGREEMENT, AS WELL THE CAMOUFLAJ PRIVACY POLICY [https://camouflaj.com/republique-privacy-policy/] (PRIVACY POLICY) AND ANY OTHER ADDITIONAL TERMS MADE AVAILABLE TO YOU WITH THE SERVICE (ADDITIONAL TERMS) (COLLECTIVELY, THE EULA).\n\n1. ELIGIBILITY.\n\nBy agreeing to this EULA, you represent and warrant that: (a) you are at least thirteen (13) years of age, and if you are a child between the age of thirteen (13) and eighteen (18) years old, that your parent or guardian has read and agreed to this EULA and to your use of the Service; (b) you have not previously been suspended or removed from the Service; and (c) your registration and use of the Service is in compliance with all applicable laws and regulations. If you are using the Service on behalf of an entity, you represent and warrant that you have the authority to bind that entity to this EULA and you agree to be bound by this EULA on behalf of that entity. Camouflaj may, in its sole discretion, refuse to offer the Service to any person or entity, and may change its eligibility criteria at any time.\n\n2. GAME TERMS.\n\nThe terms of this Section 2 govern your acquisition and use of the Game:\n\n2.1 Third-Party Accounts.\n\nIn order to use the Game, you may be required to create a separate account by the third-party app store or distribution platform that is distributing or providing you access to the Game, such as Valve Corporation, Gamele, Inc., Google Play, or the Amazon Gamestore (each, a Distributor). You are solely responsible for maintaining the security of any logins, passwords, or other credentials for your third-party account with any Distributor. Your use of any third-party account with a Distributor is subject to any terms, conditions, and policies of that Distributor. Later versions of the Game may require that you establish a different account with Camouflaj, and additional terms and restrictions may then apply.\n\n2.2 License to the Game.\n\nThe Game is licensed, not sold, to you for use only under the terms of this\nlicense. Subject to your compliance with the terms of this EULA, Camouflaj hereby grants you a limited, non-exclusive, non-transferable, non-sublicensable, revocable license, for your personal and non-commercial use, to (access and use (i) one copy of the Game and (ii) the Service, as required to use the Game. You may not reproduce, distribute, publicly display, or publicly perform the Game or any part of the Service. Except if, and solely to the extent that, such a restriction is impermissible under applicable law, you may not (i) decompile, reverse engineer, or otherwise access or attempt to access the source code for the Game, or make or attempt to make any modification to or derivative work of the Game; or (ii) interfere with or circumvent any feature of the Game, including without limitation any security or access control mechanism. You may not use the Game or the Service for any purpose other than a purpose for which the Game and the Service are expressly designed. The term Game as used herein includes any update or modification to the Game made available to you by us (unless provided with separate terms). If you are prohibited under applicable law from using the Game or the Service, you may not use them.\n\n2.3 Access to the Game; Third Party Fees.\n\nCamouflaj does not provide you with equipment to access and use the Game. You are responsible for all fees charged by third parties to access and use the Game, including any charges by device or headset manufacturers (Manufacturers), mobile network operators (Carriers), or Distributors. By accessing and using the Game, you may be subject to separate third-party terms, conditions, and policies of any Distributor, Manufacturer, or Carrier. You are solely responsible for all such third-party terms and conditions, and Camouflaj is not responsible for any act or omission of any Distributor, Manufacturer, or Carrier.\n\n3. HEALTH AND SAFETY.\n\nThis Section must be reviewed and understood prior to accessing and using the Game, and failure to do so may result in bodily harm or property damage. If you are a child using the Game as permitted under Section 1, then this Section must be read and explained to you by your parent or guardian. The health and safety precautions in this Section are not intended to be an exhaustive list, and use of the Game may involve other health and/or safety risks not contained herein.\n\n3.1 Children.\n\nChildren using the Game must be supervised by an adult at all times. Adults should monitor children both during and after use of the Game for any adverse health symptoms, as further described below.\n\n3.2 Health Warning.\n\nUsing virtual reality headsets, playing virtual Games, or accessing virtual reality experiences (including this Game) could have adverse health effects for some users that may occur both during and after use of the Game , including but not limited to: motion sickness, nausea, dizziness, poor balance, weakened hand-eye coordination, decreased multi-tasking ability, loss of or impaired consciousness or awareness, eye strain, altered vision, skin irritations, muscle soreness or twitching, convulsions or seizure, involuntary movements, disorientation, and discomfort. You or your child must stop playing the Game and consult a doctor if any of the foregoing symptoms or any other adverse symptoms occur during or after use of the Game. Camouflaj does not give medical advice. You must consult a doctor before using the Game if you are pregnant or if you have, or your child has, any pre-existing health condition that may be affected or worsened by using the Game, or if you have any other concerns about the health impact of using the Game.\n\n3.3 Play Area Precautions.\n\nAs the Game is an immersive virtual reality experience, you must take necessary precautions to ensure your own safety (as well as the safety of others) while you or others are using the Game. While using the Game, users may be moving around the surrounding area, including making hand gestures or other movements. Before playing the Game, users must ensure that the surrounding area is free of all potential hazards and must maintain a reasonable distance from other individuals in the surrounding area. Users may not use the Game near objects, stairs, balconies, windows, walls, furniture, or other objects that may pose a danger or that could be damaged during or immediately after using the Game. Due to the immersive nature of the Game, sound volumes should be kept at low enough levels such that you are able to maintain awareness of your surroundings while using the Game.\n\n3.4 Other Prohibited Uses.\n\nDo not use the Game when you are tired, under the influence of alcohol or drugs, hung-over, experiencing digestive problems, under emotional stress or anxiety, or suffering from cold, flu, headaches, migraines, earaches, or other health issues which may increase your susceptibility to adverse symptoms or reactions, including as described in Section 3.2. Do not drive, operate heavy machinery, or engage in other demanding or strenuous activity while playing the Game or shortly thereafter, or while you are experiencing any health-related symptoms or illness. Never handle sharp or dangerous objects while playing the Game.\n\n3.5 Disclaimer.\n\nCAMOUFLAJ IS NOT LIABLE TO YOU OR ANY THIRD PARTY FOR ANY BODILY HARM (INCLUDING, WITHOUT LIMITATION, DEATH, INJURY, SICKNESS, AND HEALTH COMPLICATIONS) OR ANY PROPERTY DAMAGE THAT MAY OCCUR DURING, AS A RESULT OF, OR IN CONNECTION WITH YOUR USE OF THE GAME.\n\n4. Personal and Non-Commercial Use.\n\nThe Service is for your personal and non-commercial use, and unless expressly authorized herein, you agree not to display, distribute, license, perform, publish, reproduce, duplicate, copy, create derivative works from, modify, sell, resell, exploit, transfer or upload for any commercial purposes, any portion of the Game and/or Service (including any Materials, as defined below), or other information, software, products, and/or services accessed through the Game and/or Service.\n\n5. Ownership.\n\nThis EULA does not grant you ownership of any intellectual property rights in the Game and/or Service or any content made available through the Game and/or Service. The visual interfaces, video, audiovisual content, characters, sound effects, music, animation, images (including the image, name, and likeness of certain individuals), graphics, designs, lay out, compilations, information, data, code (including source code or object code), products, software, services, branding, logo, copyrightable materials, technology, and all other elements made available on or through the Game and/or Service (Materials) are protected by intellectual property and other laws. As between you and Camouflaj, all Materials are the property of Camouflaj, its affiliates, licensors, and suppliers. Except as expressly authorized by Camouflaj or the applicable owner, or otherwise permitted by law, you may not make use of the Materials or any other content accessed on or through the Game and/or Service. As between you and Camouflaj, Camouflaj reserves all rights to the Materials not granted expressly in this EULA. If you provide Camouflaj any feedback regarding the Game and/or Service, you hereby assign to Camouflaj all right and title to such feedback, without any additional compensation to you.\n\nFor the avoidance of doubt, this EULA does not grant you the right to use any branding, logos, trade dress, or trademarks (Marks) made available through the Game and/or Service. All goodwill generated therefrom will inure to the exclusive benefit of Camouflaj or the applicable third-party owner of the Mark(s).\n\nWithout limiting the foregoing, certain portions of the Game and/or Service may include, display, or make available certain third-party content, data, information, or materials. Camouflaj makes no representations or endorsements, nor are we liable for, any such third-party content, data, information, or materials.\n\n6. Use Guidelines.\n\nYou agree not to:\n\n6.1 use the Game and/or Service for any illegal purpose or in violation of any local, state, national, or international law;\n\n6.2 violate, or encourage others to violate, any right of a third party, including by infringing or misappropriating any third-party intellectual property right;\n\n6.3 interfere with security-related features of the Game and/or Service, including by: (a) disabling or circumventing features that prevent or limit use or copying of any content; or (b) reverse engineering or otherwise attempting to discover the source code of any portion of the Game/or Service except to the extent that the activity is expressly permitted by applicable law\n\n6.4 use, display, mirror or frame the Game and/or Service or any individual element therein (including any Marks) or other proprietary information without express written consent;\n\n6.5 interfere with the operation of the Game and/or Service or any users enjoyment thereof, including by interfering with or disrupting any network, equipment, or server connected to or used to provide the Game and/or Service, or violating any regulation, policy, or procedure of any network, equipment, or server;\n\n6.6 attempt to do any of the acts described in this Section 6, or assist or permit any person in engaging in any of the acts described in this Section 6.\n\n7. TERM AND TERMINATION.\n\nThe EULA is effective until terminated by you or Camouflaj. Your rights under the limited license granted herein will terminate automatically without notice if you fail to comply with any term of this EULA. In addition, Camouflaj may suspend or terminate access to the Game and/or Service at any time without notice. We also reserve the right to modify or discontinue the Game and/or Service at any time (including by limiting or discontinuing certain features thereof) without notice to you. We will have no liability whatsoever with respect to any change to the Game and/or Service or any suspension or termination thereof. You may terminate this EULA by notifying Camouflaj via email mail and ceasing use of the Service (including the Game). Sections 1 through 5, 7 through 11, and Sections 13 through 16 will survive termination of this EULA for any reason.\n\n8. EULA MODIFICATION.\n\nWe reserve the right, at our discretion, to change this EULA on a going-forward basis at any time. In the event that a change to this EULA materially modifies your rights or obligations, we will make reasonable efforts to notify you of such change, such as a notification through a pop-up or banner within the Game and/or Service, as applicable. Additionally, if the changed EULA materially modify your rights or obligations, we may require you to provide consent by accepting the changed EULA. If we require your acceptance of the changed EULA, changes are effective only after your acceptance. If you do not accept the changed EULA, you must cease use of the Service. All other changes are effective upon publication of the changed EULA. Disputes arising under this EULA will be resolved in accordance with the version of these EULA that was in effect at the time the dispute arose.\n\n9. INDEMNITY.\n\nTo the fullest extent permitted by law you agree that you will be responsible for your use of the Service (including the Game), and you agree to defend and indemnify Camouflaj and its officers, directors, employees, consultants, affiliates, subsidiaries and agents (together, the Camouflaj Entities) from and against every claim, liability, damage, loss, and expense, including reasonable attorneys fees and costs, arising out of or in any way connected with: (a) your access to, use of, or alleged use of, the Service (including the Game); (b) your violation of any portion of this EULA or any applicable law or regulation; (c) your violation of any third-party right, including any intellectual property right or publicity, confidentiality, other property, or privacy right; or (d) any dispute or issue between you and any third party. We reserve the right, at our own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you (without limiting your indemnification obligations with respect to that matter), and in that case, you agree to cooperate with our defense of that claim.\n\n10. DISCLAIMERS; NO WARRANTIES.\n\nTO THE FULLEST EXTENT PERMITTED BY LAW, THE GAME, THE SERVICE, AND MATERIALS ARE PROVIDED AS IS AND ON AN AS AVAILABLE BASIS, WITHOUT WARRANTY OR CONDITION OF ANY KIND, EITHER EXPRESS OR IMPLIED. THE CAMOUFLAJ ENTITIES DISCLAIM ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, RELATING TO THE GAME, THE SERVICE, AND MATERIALS, INCLUDING: (A) ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUIET ENJOYMENT, OR NON-INFRINGEMENT; AND (B) ANY WARRANTY ARISING OUT OF COURSE OF DEALING, USAGE, OR TRADE. THE CAMOUFLAJ ENTITIES DO NOT WARRANT THAT THE GAME, SERVICE, OR MATERIALS WILL BE UNINTERRUPTED, SECURE, OR FREE OF ERRORS, VIRUSES, OR OTHER HARMFUL COMPONENTS, AND DO NOT WARRANT THAT ANY OF THOSE ISSUES WILL BE CORRECTED.\n\nYOU ASSUME ALL RISK FOR ANY HARM OR DAMAGE THAT MAY RESULT FROM YOUR USE OF OR ACCESS TO THE GAME, THE SERVICE, AND MATERIALS. TO THE FULLEST EXTENT PERMITTED BY LAW, YOU AGREE THAT YOU USE THE GAME, THE SERVICE, AND MATERIALS AT YOUR OWN DISCRETION AND RISK, AND THAT YOU ARE SOLELY RESPONSIBLE FOR ANY BODILY HARM, DAMAGE TO PROPERTY, OR LOSS OF DATA THAT RESULTS FROM SUCH USE.\n\n11. LIMITATION OF LIABILITY\n\nTO THE FULLEST EXTENT PERMITTED BY LAW, IN NO EVENT WILL THE CAMOUFLAJ ENTITIES BE LIABLE TO YOU FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES (INCLUDING DAMAGES FOR LOSS OF PROFITS, GOODWILL, OR ANY OTHER INTANGIBLE LOSS) ARISING OUT OF OR RELATING TO YOUR ACCESS TO OR USE OF, OR YOUR INABILITY TO ACCESS OR USE, THE GAME, THE SERVICE, AND MATERIALS, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), STATUTE, OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT ANY CAMOUFLAJ ENTITY HAS BEEN INFORMED OF THE POSSIBILITY OF DAMAGE.\n\nTO THE FULLEST EXTENT PERMITTED BY LAW, YOU AGREE THAT THE AGGREGATE LIABILITY OF THE CAMOUFLAJ ENTITIES TO YOU FOR ALL CLAIMS ARISING OUT OF OR RELATING TO THE USE OF OR ANY INABILITY TO USE ANY PORTION OF THE GAME, THE SERVICE, THE MATERIALS, OR OTHERWISE UNDER THIS EULA, WHETHER IN CONTRACT, TORT, OR OTHERWISE, IS LIMITED TO $100.\n\nEACH PROVISION OF THIS EULA THAT PROVIDES FOR A LIMITATION OF LIABILITY, DISCLAIMER OF WARRANTY, OR EXCLUSION OF DAMAGES IS TO ALLOCATE THE RISKS UNDER THIS EULA BETWEEN THE PARTIES. THIS ALLOCATION IS AN ESSENTIAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN THE PARTIES. EACH OF THESE PROVISIONS IS SEVERABLE AND INDEPENDENT OF ALL OTHER PROVISIONS OF THIS EULA. THE LIMITATIONS IN THIS SECTION 11 WILL APPLY EVEN IF ANY LIMITED REMEDY FAILS OF ITS ESSENTIAL PURPOSE.\n\n12. INTERNATIONAL USE.\n\nThe Service is controlled and operated from within the United States. Camouflaj makes no representation that the Service (including the Game) is appropriate or available in locations outside the United States. Those who choose to access the Service (including the Game) from other locations are responsible for compliance with applicable laws. All users must comply with all applicable law, and any software made available in connection with the Service and the transmission of applicable data, if any, is subject to United States and other applicable export controls.\n\n13. GOVERNING LAW.\n\nThis EULA is governed by the laws of Washington without regard to conflict of law principles. If a lawsuit or court proceeding is permitted under this EULA, then you and Camouflaj agree to submit to the personal and exclusive jurisdiction of the state courts and federal courts located within King County, Washington for the purpose of litigating any dispute.\n\n14. DISPUTE RESOLUTION AND ARBITRATION.\n\n14.1 Generally.\n\nIn the interest of resolving disputes between you and Camouflaj in the most expedient and cost effective manner, you and Camouflaj agree that every dispute arising in connection with this EULA will be resolved by confidential, binding arbitration. Arbitration is more informal than a lawsuit in court. Arbitration uses a neutral arbitrator instead of a judge or jury, may allow for more limited discovery than in court, and can be subject to very limited review by courts. Arbitrators can award the same damages and relief that a court can award. Our agreement to arbitrate disputes includes all claims arising out of or relating to any aspect of this EULA, whether based in contract, tort, statute, fraud, misrepresentation, or any other legal theory, and regardless of whether a claim arises during or after the termination of this EULA. YOU UNDERSTAND AND AGREE THAT, BY ENTERING INTO THIS EULA, YOU AND CAMOUFLAJ ARE EACH WAIVING THE RIGHT TO A TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION.\n\n14.2 Exceptions.\n\nDespite the provisions of Section 14.1, we both agree that nothing in this EULA will be deemed to waive, preclude, or otherwise limit the right of either of us to: (a) bring an individual action in small claims court; (b) pursue an enforcement action through the applicable federal, state, or local agency if that action is available; (c) seek injunctive relief in a court of law; or (d) to file suit in a court of law to address an intellectual property infringement claim.\n\n14.3 Arbitrator.\n\nAny arbitration between you and Camouflaj will be governed by the Commercial Dispute Resolution Procedures and the Supplementary Procedures for Consumer Related Disputes (collectively, \"AAA Rules\") of the American Arbitration Association (\"AAA\"), as modified by this EULA, and will be administered by the AAA. The AAA Rules and filing forms are available online at www.adr.org, by calling the AAA at 1-800-778-7879, or by contacting Camouflaj.\n\n14.4 Notice; Process.\n\nA party who intends to seek arbitration must first send a written notice of the dispute to the other, by certified mail or Federal Express (signature required), or if we do not have a physical address on file for you, by electronic mail (\"Notice\"). Camouflajs address for Notice is: Camouflaj, 110 110th AVE NE STE 350, Bellevue WA 98004. The Notice must: (a) describe the nature and basis of the claim or dispute; and (b) set forth the specific relief sought (\"Demand\"). We agree to use good faith efforts to resolve the claim directly, but if we do not reach an agreement to do so within thirty (30) days after the Notice is received, you or Camouflaj may commence an arbitration proceeding. During the arbitration, the amount of any settlement offer made by you or Camouflaj must not be disclosed to the arbitrator until after the arbitrator makes a final decision and award, if any. If our dispute is finally resolved through arbitration in your favor, Camouflaj will pay you the highest of the following: (i) the amount awarded by the arbitrator, if any; (ii) the last written settlement amount offered by Camouflaj in settlement of the dispute prior to the arbitrators award; or (iii) $1,000.\n\n14.5 Fees.\n\nIf you commence arbitration in accordance with this EULA, Camouflaj will reimburse you for your payment of the filing fee, unless your claim is for more than $10,000, in which case the payment of any fees will be decided by the AAA Rules. Any arbitration hearing will take place at a location to be agreed upon in Santa Clara, California, but if the claim is for $10,000 or less, you may choose whether the arbitration will be conducted: (a) solely on the basis of documents submitted to the arbitrator; (b) through a non-appearance based telephone hearing; or (c) by an in-person hearing as established by the AAA Rules in the county (or parish) of your billing address. If the arbitrator finds that either the substance of your claim or the relief sought in the Demand is frivolous or brought for an improper purpose (as measured by the standards set forth in Federal Rule of Civil Procedure 11(b)), then the payment of all fees will be governed by the AAA Rules. In that case, you agree to reimburse Camouflaj for all monies previously disbursed by it that are otherwise your obligation to pay under the AAA Rules. Regardless of the manner in which the arbitration is conducted, the arbitrator must issue a reasoned written decision sufficient to explain the essential findings and conclusions on which the decision and award, if any, are based. The arbitrator may make rulings and resolve disputes as to the payment and reimbursement of fees or expenses at any time during the proceeding and upon request from either party made within fourteen (14) days of the arbitrators ruling on the merits.\n\n14.6 No Class Actions.\n\nYOU AND CAMOUFLAJ AGREE THAT EACH MAY BRING CLAIMS AGAINST THE OTHER ONLY IN YOUR OR ITS INDIVIDUAL CAPACITY AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS OR REPRESENTATIVE PROCEEDING. Further, unless both you and Camouflaj agree otherwise, the arbitrator may not consolidate more than one persons claims, and may not otherwise preside over any form of a representative or class proceeding.\n\n14.7 Modifications\n\nIf Camouflaj makes any future change to this arbitration provision (other than a change to Camouflajs address for Notice), you may reject the change by sending us written notice within thirty (30) days of the change to Camouflajs address for Notice, in which case your account with Camouflaj will be immediately terminated and this arbitration provision, as in effect immediately prior to the amendments you reject, will survive.\n\n14.8 Enforceability\n\nIf Section 14.6 is found to be unenforceable or if the entirety of this Section 14 is found to be unenforceable, then the entirety of this Section 14 will be null and void and, in that case, the parties agree that the exclusive jurisdiction and venue described in Section 13 will govern any action arising out of or related to this EULA.\n\n15. GENERAL.\n\nThis EULA, together with the Privacy Policy and any Additional Terms, and any other agreements expressly incorporated by reference herein, are the entire and exclusive understanding and agreement between you and Camouflaj regarding your use of the Service (including the Game). Except as expressly permitted above, this EULA may be amended only by a written agreement signed by authorized representatives of all parties to this EULA. You may not assign or transfer this EULA or your rights hereunder, in whole or in part, by operation of law or otherwise, without our prior written consent. We may assign this EULA at any time without notice or consent. The failure to require performance of any provision will not affect our right to require performance at any other time after that, nor will a waiver by us of any breach or default of this EULA, or any provision of this EULA, be a waiver of any subsequent breach or default or a waiver of the provision itself. Use of section headers in this EULA is for convenience only and will not have any impact on the interpretation of any provision. If any part of this EULA is held to be invalid or unenforceable, the unenforceable part will be given effect to the greatest extent possible, and the remaining parts will remain in full force and effect.\n\n16. OPEN SOURCE SOFTWARE.\n\nThe Game and/or Service may include open source software or third-party software. Any such software is made available to you under the terms of the applicable licenses.\n\n17. CONTACT INFORMATION.\n\nCamouflaj, LLC is located at 110 110th AVE NE, STE 350, Bellevue WA 98004. You may contact us by sending correspondence to that address or by emailing us at whatsup@camouflaj.com.\n\n18. OBTAINING A COPY OF THIS EULA.\n\nYou may have this EULA mailed to you electronically by sending a letter to the address in Section 17 with your electronic mail address and a request for a copy of this EULA.\n\n19. NOTICE TO CALIFORNIA RESIDENTS.\n\nIf you are a California resident, under California Civil Code Section 1789.3, you may contact the Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs in writing at 1625 N. Market Blvd., Suite S-202, Sacramento, California 95834, or by telephone at (800) 952-5210 in order to resolve a complaint regarding the Game and/or Service or to receive further information regarding use thereof.\n\n2019 Camouflaj LLC All rights reserved.\nAll trademarks referenced herein are the properties of their respective owners.\nFOLLOW US\nCONTACT US\nwhatsup@camouflaj.com\nPRESS INQUIRIES\nNA.PR@camouflaj.com", "Space Required": "3.61 GB"}



["5 stars\n56%\n4 stars\n15%\n3 stars\n12%\n2 stars\n3%\n1 star\n15%", "SimonRigotJun 11 at 5:24 AM\nhard to get on but astonishing\n\nI bought the game at Christmas and tried it out a bit, then stopped because I didnt understand the right way.I tried back in March because of Corona confinement, and again didnt get any clue. I was truely desperate and frustrated until I got back in may and slightly began to understand the gameplay. And the more I get into the story the more I am astonished by the gameplay, storytelling , and puzzles are pretty enjoyable to. I am not yet finished , already in the beginning of level 4 and pretty sure when Ill reach the end Ill try again with other profiles . Congratulations to the developers team it is a masterpiece\n\nHelpful | 22", "TeonisJul 14 at 12:08 AM\nA pretty good stealth game\n\nI was not disappointed. I started to play this on my smartphone, but never finished it. It was a great game on mobile, and an excellent experience in VR. The gameplay is great, the stealth part is working, the story is deep, has a ton of collectible background info. The actors (David Hayter!!!) are really good.\n\nI can only recommend this game! Not for everyone, but give it a try!\n\nHelpful | 4", "FatSheamusMay 15 at 10:43 PM\nPretty but...\n\nHonestly I grew entirely bored after about an hour of gameplay. Maybe it was the subject matter, maybe it was the slightly convoluted plot and drab characters. Whichever the case, I just wasn't thrilled with how it all played out.\nI don't know, maybe its just me.\n\nHelpful | 34", "Golden_MindMay 23 at 6:26 AM\nThere is hope?\n\nOriginally dubious about playing a game where you do nothing except guide someone.\n\nOh but you mentally guide them, you care for them and you fear for them.\n\nThere are moment when you have to strategise and plan your move really carefully, one wrong move and back to the confinement room.\n\nEither standing or sitting but very little movement apart from pointing and turning your head.\n\nIt's absorbing of time.\n\nWonderful storyline, the ending is lacking a bit of hope but, she wants to be free.\n\nFinal thoughts.. strategically tough but an ending of hope.\n\nWorth more than 10.99.\n\nHelpful | 9", "Faye32620 days ago\nFun and Addictive\n\nUpdate: Pretty cool game. Not sure if I cared for the ending. Hope more games are created like this one, Fun and lengthy.\nI really enjoy this game. Took me a while to get pass episode 1, but once i did, I started rolling. I really like it, it is very addictive. Long but fun enough to keep you entertain as you try to get past the Prizracks. Pleeeze develop more games similar to this one!!\n\nHelpful | 2", "LadyBugMegzJun 22 at 3:27 AM\nGreat Game\n\nIve been playing this game since it came out on IOS. Waited months for each chapter to come out. I even bought an IPad with more space just so I had enough space for each chapter as they came out. Im definitely a fan. I was not disappointed when I bought and played this game on VR. Visually its so much more in depth than on the IPad. You can immerse yourself for hours just playing and really following the story. Each time I play it I challenge myself to do something like pickpocket every Prizraak or find every tape etc. The devs really did put a lot into this game and it shows. Ive not had any issues with crashing or losing my game on the Quest. You can play this sitting the whole time if you choose. I do recommend this game and Id definitely buy another Camouflaj title.\n\nHelpful | 1", "Vladtheimpaler6911May 23 at 3:38 AM\nRepublique VR\n\nI enjoy playing the game. I found it interesting. I have played it a few times just to see the different endings.\nYes, there could have been more to the storyline and more items to find and take/read. I would play a sequel if that became available in the future.\n\nHelpful | 5", "jamiebbyApr 26 at 10:00 PM\nWarning: Casting is blocked\n\nI would not have bought this if I knew casting was blocked on this game. VR is usually an activity that friends and family watch and take turns playing and it sucks that you can only play all by yourself.\n\nHelpful | 22", "GroeneDraekMar 9 at 5:09 AM\nMust have !!!\n\nRealy nice story line and lots of fun and puzzling.\nLots and lots of hours to spend. Where lots of VR games are much fun, always the same issues....too short of gameplay. Well not with this one. Multiple chapters to finish, great puzzles and lots of interaction.\n\nGreath value for money, and therefor a big applaus.\n\nHelpful | 30", "danny.r.pattonMar 7 at 8:29 AM\nI would give more Stars\n\nI would give more stars but when I got to the 5th and final level, the game would crash after the opening scene. I tried resetting/restarting my oculus, but it still repeated the crash. Only thing I could do is delete and restart from the very beginning. Very frustrating not being able to complete, save my progress, or start at level 5 after reinstalling. I tied email game developer but no response back. There is no support if you have issues.\n\nHelpful | 21", "ThunderSun1972Feb 2 at 11:40 AM\nLong game\n\nIf you are looking for a longer game to play, this is it. I wasn't sure I would like the game when I first started playing...but then I really got in to it after I figured it out. I like the concept of playing 2 characters. This was a interesting story line. I thought the game play was really good. Puzzles were good. Overall this game is now in my top 5. Thanks for a longer game play! I didnt want to stop playing because I wanted to find out how it ended. I think I had about 9 hours in the game or more.\n\nHelpful | 26", "Leviathan5Feb 4 at 4:26 PM\nIrritating to say the very least\n\nI'm tired of devs blocking the ability to cast their games, it's extremely bad customer service. I don't care if the game is decent, if it does not cast I will give it 1 star and advise all against it, vr is mostly a solo experience that will remain in the dark to alot of people due to this selfish constraint, the ability to cast can bring a game to a group experience and allow people that have little to no experience in vr to see, and learn.\n\nHelpful | 57", "ChimiedelameFeb 3 at 2:51 PM\nTo buy urgently !!\n\nFirst games I want to replay! All the other games that follow a scenario that I had played did not really offer possibilities to change the history or the difficulty of the game without having the impression to do exactly the same thing!\n\nThe end I got is absolutely not the one I expected, and I would start this game over again with other settings and choices to get a different end!\n\nRpublique VR is well worth its price, and I would even say that it is the best ratio of playing time / price that I have been able to take advantage of since the release of the oculus quest!\n\nHelpful | 9", "paulciJan 20 at 1:54 PM\nVery repetitive, non-existent support\n\nStarts off promising, until you realise the save feature doesnt work and you have to start from scratch no matter how much progress you make before you need to sign off or get captured. Camouflaj support non-responsive.\n\nGraphics nothing special, Cooper incredibly annoying. That might just be having listened to him repeatedly play the same message with no way to skip.\n\nWorth a punt if its going cheap, but be prepared to invest the time to complete.\n\nHelpful | 21", "Kaosgamer40Feb 7 at 4:44 PM\nAwesome\n\nI love this game! the concept, the different objectives that need to be completed. Absolutely one of my favorites. This game is a must gamers!\n\nHelpful | 4", "kkuzma1982Feb 7 at 3:53 AM\nThis is rich content full campaign game\n\nI really recommend this game for people who wants a rich content full campaign game that can be played seated. The voice acting, graphics and gameplay makes it really good value for the price.\n\nHelpful | 5", "ElyrthalJan 24 at 7:53 PM\nToo repetitive...\n\nRealization is decent and game duration vs price tag very good, but unfortunately mechanics and scenes are way too repetitive to be truly enjoyable and make it more than an average game.\n\nHelpful | 7", "eric.sullivan.587268Mar 16 at 1:00 PM\nIt's ok\n\nIt's a ok game kinda of a yawner kind of game just wouldn't buy it if your looking for a good game stay away from this one\n\nHelpful | 1", "Ihrie3 days ago\nAn overlooked gem IMO\n\nPersonally I feel like this is a bit of an overlooked title, and its definitely worth the purchase.\n\nIt may be a mobile port to VR but it is well done and theres a lot of content here to enjoy.\n\nHelpful | 0", "teziOct 3 at 4:02 PM\nAwesome\n\nAlthough point and click from camera to camera, I find myself playing this for hours and hours and I have only just started chapter 3, the game is great and would recommend to anyone. Really good value for money based on the fact about 10 hours later I'm still completely engaged. Thank you all who made this game.\n\nHelpful | 51", "Autistic-WatcherFeb 7 at 11:57 AM\nIts good 2 be god\n\nI want to see more games that are not in the first person all the time\n\nHelpful | 1", "FriskHoneySep 21, 2019 at 6:18 PM\nMajor bug prevents play\n\nThis is great game. Plot, dialogue, VR immersion, mechanics are all very well done. Unfortunately, something about game saves consistently reset unlocked upgrades purchased from the data broker. I've repeated chapter one several times because I find the Email or Eavesdrop ability Locked again! What BS! I find advancing in this game to be seriously crippled and the game not playable for this reason.\n\nHelpful | 27", "furtinOct 4 at 1:38 AM\nGreat Port to Quest\n\nI actually played Republique the first time on an iPad, long time ago. When it was brought to VR, I played it again on the GO. Now I enjoy it again but this time in perfect VR with 6DoF on the Quest and let me tell you, its a great port and finally the game how it is meant to be played.\n\nMake no mistake, its not a AAA game with state-of-the-art production values but for what it is, it has lots of creativity going on and is actually a very well made game (wonky animations aside).\n\nThanks to the developers (or publisher) I can now play it with no additional cost because I already bought it for the GO. Thats awesome!\n\nHelpful | 18", "ChlasmaOct 15 at 7:24 AM\nWTF??\n\nPlayed like3 hours, doin good. Went back to the menue and back to the game just to find out it did not safe any progress?!!!!!!!!!\n\nHelpful | 33", "JimZMJun 7 at 4:05 PM\n\nVery high quality and fun, though switching between cameras is often disorienting.\n\nHelpful | 0", "Dittoman17Dec 4 at 1:20 PM\nUnique but not my cup of tea\n\nIt's an awesome concept but hard to keep me engaged still pretty cool.\n\nHelpful | 3", "technoticJul 25, 2019 at 11:39 AM\nA different take on VR immersion!\n\nI pre-ordered this game because the trailer was well put together, and it looked like something different than anything available on the Quest so far. It was released a little over an hour ago, and I only stopped playing to take a break and write this review.\nCost: 5 stars - I would have paid twice as much for this game. Worth every penny\nGraphics: 5 stars - The devs put this together beautifully. They put the detail where it needs to be.\nStory: 5 stars - The game jumps you right in and the story just flows and draws you in perfectly.\nImmersion: 5 stars - the game comes together seemlessly, with the graphics, story, controls, characters, and use of VR.\nThis isn't a full locomotion type of experience. I've been sitting on my couch comfortably. Yet the VR is critical in making this game what it is. The view is 3rd person and 1st person at the same time; you are remotely hacked into the environment, security cameras are your eyes, and you are the main characters eyes. You direct her, and you'll need every camera view to see every angle, to know what's ahead. Some things you can directly interact with by hacking. some, you interact with using Hope. The object is to NOT get caught, to avoid detection and be a ghost.\nIf I were to compare this to any other game, I would say Metal Gear (the classic) combined with Hitman in VR. You're playing 2 people at once, and you can feel them each independent yet seemless.\nGreat job, devs. I don't think the newness will wear off for a while.\n\nHelpful | 223", "stuart.fisher.79Aug 28, 2019 at 12:05 AM\nMore 3D than VR\n\nIll start by saying I didnt get further than the second chapter but this feels (mechanics and visuals) like a game from several console generations ago (early 2000s generation).\nThe distinction for me between 3D and full VR is that with the flip between fixed camera perspectives the game feels more like a nice 3D experience than a full VR one (where you can move about freely in a full virtual world).\nUltimately I got frustrated quite early on in the second chapter when evading the guards the main protagonist didnt go where I wanted her to resulting in numerous lengthy trips back to the cell.\n\nGood story but just not enough of a VR experience and too fiddly to keep me playing.\n\nHelpful | 14", "Georgiagirl7Jun 2 at 9:42 PM\nLots of drama and interactions\n\nI love the game I was on the edge of my seat the whole game and I love solving puzzles and figuring things out the only downside was I hated the ending the character went through all of that just to kill herself I thought that was just a kill joy\n\nHelpful | 2", "GeorgehelenJan 14 at 12:34 PM\nBest game Ive ever played\n\nObviously its subjective and totally a personal choice but for me its my favourite game so far of all the quest games Ive tried. Ive downloaded quite a few games, l get frustrated or bored and end up switching to this one. Ive lost count the amount of times Ive started over a new game and have become quite the expert at dodging the prizraks. If only the developers would bring out a part two........ with hope ? PLEASE!?\n\nHelpful | 20", "obi2kenobiAug 31, 2019 at 5:42 PM\nDecent enjoyable game with no VR appeal\n\n3/5. If this was a pancake game I'd rate it higher. The game is engaging, looks good, no performance issues, but due to the lack of VR element I find it gathering dust while I go back to more immersive titles even if I've played them a bunch already.\n\nIt has good story, and I still want to finish it eventually. Actually has the best story of any VR game I have played. But like I said there is no real VR element to it. I also find the point and click movement controls frustrating at times.\n\nI still recommend it as a game though, and if you like the stealth/puzzler concept and don't mind lack of immersion elements then its a must buy.\n\nHelpful | 5", "brasiliansoxfanNov 18 at 9:11 PM\nSUPER underrated\n\nDeserves more love. It's simple but effective game mechanics, incredibly well fleshed out world with likable characters and compelling narrative make it an underrated gem in the quests catalog\n\nHelpful | 5", "Marvin_MaverickOct 12 at 6:31 PM\nVerry dense story\n\nI really like the game. The story is very dense and there is so much to revile in the game. I like the outcome of all the work that went into the game. I think its a good value for the price\n\nHelpful | 2", "JWheezyAug 11, 2019 at 4:19 PM\nMOSS style experience Quest perfection!\n\nI recently finished Moss and I Expect You to Die and was looking for another high quality sit down game and Republique VR delivers. This game seems fully optimized for VR to me. You are able to control your 3D character in a 3D environment similar to the perspective in Moss. In Republique however you will have much more variety in perspective as you take control of security cameras and navigate the beautiful map and phone interface. The character interaction is point and click and offers a variety of stealth and tactical options. Lots of fun. Vivid story and voice acting. Headphones are a must for me. Playing as a hacker whos viewpoint originates from various security cameras in the environment really lends itself to the Quest field of view for a more naturally immersive experience.\n\nHelpful | 7", "harrisbiAug 4, 2019 at 10:28 PM\nWorst developer and support\n\nI bought this game the day it came out and loved it. I got to mission 3 and lost all upgrades. I emailed support multiple times with no response.\n\nWord to wise: you cannot\ncount on support..buyer beware if you have an issue with game you are out of luck, to bad I cant get my money back.\n\nDays later still nothing, I have deleted game and will never buy from developer again due to worst support ever!\n\nHelpful | 29\nDeveloper ResponseAug 8, 2019 at 3:11 PM\n\nHi Billy! Apologies for the delay in our response. We've responded to your issue and are waiting to hear back. I think we can get your issue resolved, so keep in touch! Thanks so much.", "MausKJul 25, 2019 at 12:21 PM\nVery Interested in the game\n\nBut it Crashes on me, I was playing with hope but somehow the game crashed on me several times, and lost Gameplay and started in the beginning all over again. I really hope this will be patched in the future because I really like stealth games but dislike starting all over again time to time, it was by the first where you can upgrade your hacking skills\n\nHelpful | 25", "jeanmarc.messinaAug 12, 2019 at 12:17 PM\nGame doesn't work\n\nI've preordered the game and can't play it. I have the same problem as someone Go commented here, no sound in the start menu and when I pick up the phone to start the game, nothing happens. I have sent a mail to the support 10days ago, still no answer. I can't even be refunded cause the game was bought too long ago. Would gladly change my comment if I could play this!\n\nEdit : reinstalling the game fixed it, still no answer from the support though..\n\nHelpful | 7", "chrisrules9955Aug 27, 2019 at 8:53 PM\nExplore a Futuristic Dystopian World\n\nThis game is underrated in my opinion. There's hours and hours of game play, lots of detail, a good storyline and decent graphics. Those who like Moss will like the 3rd party role in this and the fact that you can play this game seated. This game plays like Moss w/ less music and more fascism. Get it, you won't be disappointed. I've been playing about 3-4 hours and the game has not crashed or had any major errors. Those complaining about the game asking them to move into the play area should reset their guardian view. Given the surveillance cameras you navigate are by the wall, you will need to make sure the play area is in front of you. Once the game begins you will not be able to sit back much as a result.\n\nHelpful | 4", "BeiriannyddJul 28, 2019 at 10:50 AM\nStrong Story for 3DOF\n\nThis game looks like it will be amazing once the kinks are ironed out. I am hooked by the story so far but have not made much progress because the cameras are placed perilously close to the edge of the displayable area and as soon as you move your line of sight even slightly outside the modeled world the screen turns black with a message to move back to the play area. Meanwhile I am sitting on the couch and my posture is becoming more and more hunched.\nPhysically uncomfortable to play right now and if that can be fixed then this will be a 5 star game.\n\nHelpful | 4", "OrdinaryWorldJul 26, 2019 at 1:51 PM\nGreat port\n\nI bought this for my Gear VR a few months ago but as soon as I heard the rumour of a Quest release I stopped playing and have eagerly awaited release. Great game made all the better with the superior port to Quest. My only gripe is that there's no real tutorial phase and you're just kinda thrown in to it.\n\nHelpful | 7", "RealCamazotzAug 3, 2019 at 7:19 AM\nI made the right choice?\n\nIt all started when I saw it for pre-order. When it came out, I decided to play it. Which put me through an interesting and dark stories, puzzles, and a couple of choices as well! I was even talking to Hope sometimes, and screamed at the top of my lungs when a Prizrak saw her. Long story short, I made the right choice!\n\nHelpful | 8", "LiviaLeoAug 3, 2019 at 9:21 AM\nIts made for VR\n\nI first played this game on iOS back in 2013 and I fell in love with it so when I saw it was coming to the Oculus Quest, I just HAD to buy it.\nFirstly, the price is so much cheaper than I was expecting - I definitely wouldve paid much more as I remember spending hours laid on my bedroom floor playing on my phone so I knew itll be just as good.\nSecondly, this game translates so well into VR! The controls are easy and you feel much more involved in the game (it even had me jumping out of my seat when I had some close calls with the Prizrak).\nLastly, I cant recommend this enough, I have been raving about my excitement to everyone I know when I saw it on pre-order and waiting for it to be released and it really has not failed me!\nLove love loveeeeeeeee this game!\n\nHelpful | 2\nDeveloper ResponseAug 8, 2019 at 3:21 PM\n\nthanks for such a nice review, and for being such a dedicated fan! :)", "ig-88Aug 6, 2019 at 9:23 PM\nGreat game!\n\nI played this years ago when it was first released on iOS. I really enjoyed the game then and feel that this gives you such a richer experience. I love the noir 1984 feel to the story. I have run across a few bugs along the way that caused the game to crash, but I was able to relaunch without any issues. I would definitely recommend this game for those who enjoy long form story telling games.\n\nHelpful | 5", "tvanilliAug 1, 2019 at 10:32 AM\nIt's ok and not too expensive\n\nNice to have a game that is playable in nearly any position and it has a relative good story. On the other side it has some bugs like missing walls on some camera views. It would be easy to check that for the developers. It never crashed for me. I spend 7 hours to finish that game, 4 hours normal play and 3 hours on a stupid, unfair situation towards the end which was frustrating. Not really special to be played in VR, but if you like to lay down while playing on your Quest, this is the only game I know of that allows it.\n\nHelpful | 6", "WILTAYJul 29, 2019 at 7:15 AM\nFantastic first impression\n\nI bought this game yesterday and have only played it briefly but the first impression was so good I felt I'd post it here.\nThe first thing that grabbed me about this game is how slick and polished it feels, right from the opening credits. The storyline hooked me straight away and there is immediate empathy for Hope's predicament. The sound and the graphics are great too.\nI've yet to encounter any of the issues described by other reviewers so may well return to this and update it once I've played the game more thoroughly but first impressions are five out of five.\nWell done to all involved.\n\nHelpful | 2", "RobbizaseJul 25, 2019 at 7:09 PM\nGood game but glitchy\n\nOnly played the game for an hour but it has locked up on me and kicked me out of the game 2 times already, not sure how this game made it past QA. Hopefully developers will release a patch to fix this soon. Considering returning this one.\n\nHelpful | 14\nDeveloper ResponseJul 26, 2019 at 2:01 PM\n\nHi Robbizase, I'm sorry to hear that you're experiencing some issues. We'd love to try and help. Please reach out to support(at)camouflaj(dot)com and we'll try to work through it with you. Thanks so much!", "Buster_7fireAug 15, 2019 at 4:17 AM\nReal reviews?\n\nIm not sure about the reviewers giving this ga\nme stellar reviews? Are they real? Not my style of gameplay and it looks like rehash of on old Nintendo game. With that said not stellar. Ill give it three stars for the people who like this kind of gameplay.\n\nHelpful | 1", "Nostromo-MattJul 28, 2019 at 7:00 AM\nEngaging!\n\nThis game is wonderful. It takes a little while to get your head around the mechanics and gameplay but once you do it's a quality experience. Fantastic value for money due to its engaging gameplay, a detailed and rich story and the fact that its not all going to be over within a few hours. The control method needs updating so you can use the sticks to move but hopefully this can be addressed with a future update. I'll stick at 5 stars for now but if the aforementioned update doesn't arrive, I'll most likely reduce to 4. Worth your time and money all day long though!\n\nHelpful | 4", "erasmushurtJul 25, 2019 at 5:51 PM\n\nStoryline and graphics are good. It seems some people are having some crashing or glitching issues. I haven't experienced any problems though and was happy with the purchase.\n\nHelpful | 5", "Seadog64Sep 1, 2019 at 7:51 PM\nExcellent\n\nVery fun stealth game. Been playing for many hours and still not even half way. Best value I have seen in a Quest game.\n\nHelpful | 3", "liottaAug 5, 2019 at 1:00 PM\nDoesnt load\n\nI was asked to email the developer a couple weeks ago which I did multiple times and have yet to receive a response. Disappointed with the game and the lack of help, certainly wont be purchasing anything from these developers anymore.\n\nHelpful | 23\nDeveloper ResponseJul 26, 2019 at 2:01 PM\n\nI'm sorry to hear that you're experiencing some issues. We'd love to try and help. Please reach out to support(at)camouflaj(dot)com and we'll try to work through it with you. Thanks so much!", "calforbAug 6, 2019 at 12:01 PM\nExcellent\n\nOne of my new favourites. Same sort of idea as Moss where you are participating as the viewer but controlling the character. Storyline is very good as well. On episode 3 now. Episode 1 and 2 probably took 5+ hours, so plenty of gameplay.\n\nHelpful | 3", "DoctoriJul 27, 2019 at 11:54 AM\nsave doesnt seem work\n\nhey guys, great game!! but i just seen the first data broker, which i think safe room, and quit to main menu. it didnt save. Ive played the first area several times. Can we please get a save button, why are we dealing with this ?\n\nHelpful | 9\nDeveloper ResponseAug 8, 2019 at 3:14 PM\n\nHi Doctori, Sorry to hear you're having difficulty saving. Are you playing with the \"Student\" costume? Wearing the Student costume forces players to manually save by collecting video tapes strewn throughout the game. If you were *not* using the Student costume and are having issues saving, please contact support at camouflaj dot com and we will try to get your issue resolved. If you were wearing the Student costume and this information resolves your issue, please update your review and let us know - we'd really appreciate it!", "HypnoEyeJul 26, 2019 at 9:47 AM\nFun So Far\n\nHaving a lot of fun with this game. I an used to shoot em ups and this is a refreshing change. Fingers crossed so far I have not experienced any crashes or glitches. The graphics are very good, the story line in creative. So far, so good!\n\nHelpful | 5", "dale.thatcherJul 27, 2019 at 11:33 PM\nFantastic Stealth Game\n\nDemonstrates a really great way of moving the Stealth genre into VR. With an engaging plot, upgradable abilities and plenty of backstory items lying around.\n\nJoins Moss as one of my favourite games on the Quest.\n\nHelpful | 2", "ojuuujoJul 31, 2019 at 9:50 AM\nGame turns black, unplayable\n\nThe Game is starting, after choosing a save slot the game is telling to press the A button to pick up the phone.\n\nThe screen immediately turns black, even after minutes nothing is happening... please fix the game!\n\n\nOriginal Review:\nWhat's up with this? The download stops all the time and instead of continuing it will restart... by a game with more than 3GB I seemingly can never play this! You either give me my paid game; which btw I preordered the very day the preorder were possible; or you can issue the refund till you sort out your shi*** network! It's 2019, how about a 'Resume Download' instead if starting over and over again? Already downloaded more than 10GB and still cannot play! Do you think i'm preordering for fun? ...\n\nHelpful | 10", "TickbaitAug 1, 2019 at 9:12 PM\nAmazing Use of VR\n\nOutstanding premise with a very intuitive method of controlling the game and interacting with the environment. Definitely recommend!!\n\nHelpful | 0", "RobertPhoenixAZJul 29, 2019 at 10:55 AM\nGreat game\n\n5 hours in. No crashes, impressive graphics and voice acting. Very addictive\n\nHelpful | 2", "nbhardwaj01Aug 8, 2019 at 2:47 AM\nGood\n\nVery good\n\nHelpful | 3"]