{"App Title": "SculptrVR", "App description": "Create smooth, polygonal, and cubey sculptures and worlds of any size. SculptrVR's 10,000x zoom enables massive creations with tiny details! SculptrVR gives you almost unlimited space so your imagination is totally free!\n\nSculptrVRs intuitive and fun tools let your imagination turn into real creations.\n\nGet a better view of your sculpted landscapes by Hang gliding through them.\n\nJoin an online game with 4 friends (cross platform with Go and Rift!) to build massive monuments together or have a sculpt-off!\n\nWhen you're happy with your creation, you can upload to the SculptrVR content gallery and let others see the incredible things you've made. You can also browse the gallery with hundreds of creations!\n\nCreations made in SculptrVR can be exported to OBJ or FBX formats for 3D printing or sharing online!\n\nIn your world, anything is possible.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required for downloadable contentsOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Art/Creativity, Exploration, Productivity", "Languages": "English", "Version + Release Notes": "2.80", "Developer": "SculptrVR, Inc.", "Publisher": "SculptrVR, Inc.", "Website": "http://www.sculptrvr.com/", "Release Date": "August 29, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Multiplayer EULA\t\n\nSCULPTRVR, INC.\n\n\n\nEND USER LICENSE AGREEMENT\n\n\n\nPLEASE READ THE FOLLOWING END USER LICENSE AGREEMENT (AGREEMENT) BEFORE INSTALLING SCULPTRVR (THE GAME SOFTWARE). BY INSTALLING, COPYING, AND/OR OTHERWISE USING THE GAME SOFTWARE, YOU AGREE TO BE BOUND BY THE TERMS OF THIS AGREEMENT AS SET FORTH BY SCULPTRVR, INC. AND ITS AFFILIATED COMPANIES (COLLECTIVELY, SCULPTRVR).\n\nYOUR USE OF THE GAME SOFTWARE IS ALSO SUBJECT TO THE TERMS AND CONDITIONS SET FORTH IN THE STEAM SUBSCRIBER AGREEMENT AND/OR ANY OTHER TERMS SET FORTH BY VALVE CORPORATION IN RELATION TO THE STEAM SERVICE.\n\nIF YOU AGREE TO THE TERMS SET FORTH IN THIS AGREEMENT, select I ACCEPT to install the Game Software and to indicate your acceptance of these terms and your understanding of the conditions of use of the Game Software.\n\nIF YOU DO NOT AGREE TO THE TERMS SET FORTH IN THIS AGREEMENT, select I DO NOT ACCEPT and SculptrVR shall not grant to you the License (defined below) to the Game Software.\n\nLIMITED USE LICENSE\n\nThe term Game Software includes the software included in or associated with this game, the associated media, any printed materials, manuals, any online or electronic documentation, and any and all copies of such software and materials. SculptrVR grants to you the non-exclusive, non-transferable, limited right and license to install and use one (1) copy of the Game Software on one (1) personal device at any given time solely for your personal use (the License). All rights not specifically granted under this License are hereby reserved by SculptrVR and, as applicable, by its licensors. The Game Software is licensed to you, not sold. This License does not give you any title or ownership in the Game Software, and should not be construed as a sale or transfer of any intellectual property or other rights to the Game Software.\n\nOWNERSHIP OF GAME SOFTWARE\n\nYou agree and acknowledge that all title, ownership rights, and intellectual property rights connected with the Game Software and any and all copies thereof (including but not limited to any derivative works, titles, computer code, themes, objects, characters, character names, stories, dialogs, catch phrases, locations, concepts, artwork, graphics, animation, sounds, musical compositions, audio-visual effects, text, screen displays, methods of operation, moral rights, applets incorporated into the Game Software, and any related documentation) are owned by SculptrVR or its licensors.\n\nThe Game Software is protected by the copyright laws of the United States, international copyright treaties and conventions, United States and common law trademark laws, and other laws. All rights are reserved worldwide. The Game Software contains certain materials licensed by SculptrVR from others, and SculptrVR and SculptrVRs licensors may protect their rights in the event of any violation of this Agreement.\n\nLICENSE CONDITIONS AND RESTRICTIONS\n\nYou agree to only use the Game Software, or any part of it, in a manner that is consistent with this License and you SHALL NOT:\n\nwithout written permission from SculptrVR, use, advertise or exploit in any manner the Game Software or any of its parts commercially;\nwithout a separate, additional license from SculptrVR, use the Game Software or permit the use of the Game Software, on more than one personal device at the same time;\nmake copies of the Game Software or any part thereof, except that you may make one (1) copy of the Game Software for backup or archival purposes, or make copies of the materials accompanying the Game Software for non-commercial backup and reference only;\nsell, rent, lease, license, distribute, upload to any Internet server or web site, or otherwise transfer any portion of this Game Software or any copies without the express prior written consent of SculptrVR;\nreverse engineer, derive source code, modify, decompile, disassemble, or create derivative works of the Game Software, in whole or in part (except as the applicable law expressly permits, in which case all and any lawful modifications, adaptations, improvements, etc., and all copyrights and morale rights therein, shall be deemed assigned to, and shall belong to, vest in and be the exclusive property of SculptrVR and/or its licensors on creation, in any event);\nremove, disable or circumvent any security protections or any technical measures that control access to the Game Software;\nremove, modify, deface or circumvent any proprietary notices or labels contained on or within the Game Software;\nexport or re-export the Game Software or any copy or adaptation in violation of any applicable laws or regulations; or\ncreate data or executable programs that mimic data or functionality in the Game Software.\n\n\n\nHEALTH AND SAFETY WARNINGS AND INSTRUCTIONS\n\n\n\nHeadset. Before you use or permit anyone else to use the Game Software or any headset in connection with the Game Software (Use), you agree to take the following steps:\n\n\n\nRead and follow all setup and operating instructions provided with the headset.\nReview the hardware and software recommendations for use of the headset.\nAdjust the inter-pupillary distance (IPD) for each user before use of the headset to reduce the risk of discomfort.\nUse the headset and only with an authorized device, accessory and/or software.\nDo not use the headset when you are tired, in need of sleep, under the influence of alcohol or drugs, hung-over, under emotional stress or anxiety, or suffering from cold, flu, digestive problems, headaches, migraines, or earaches, as this can increase your susceptibility to adverse symptoms.\nSee a doctor before Use if you are pregnant or elderly, have a pre-existing binocular vision abnormality or psychiatric disorder, suffer from a heart condition or other serious medical condition.\nSee a doctor before Use if you have had a seizure, loss of awareness, or other symptom linked to an epileptic condition.\nEase into Use to allow your body to adjust (i.e., for only a few minutes at a time at first and gradually increase as you grow accustomed to virtual reality).\nTake at least a 10-minute break every 30 minutes during Use, or more frequent and longer breaks if you feel discomfort.\nDo not use the headset while in a moving vehicle such as a car, bus, or train, as this can increase your susceptibility to adverse symptoms.\nDo not use the headset with the sound at a high volume, so that you can maintain your awareness of your surroundings and reduce the risk of hearing damage. Listening to sound at high volumes can cause irreparable damage to your hearing.\nDo not use the headset or any associated sensor or remote if any such device is broken or damaged. Repairs should only be made by an authorized servicer.\n\n\n\nChild Use. The Game Software should not be used by children under the age of 13, particularly because the headset is unlikely to be sized for children under the age of 13 and improper sizing can lead to discomfort or health effects, and younger children are in a critical period in visual development. Adults should make sure children (age 13 and older) use the headset and Game Software in accordance with this Agreement. Adults should closely monitor children (age 13 and older) during and after Use. Adults should limit the time such children spend and ensure they take breaks during Use. Prolonged Use should be avoided, as this could negatively impact hand-eye coordination, balance, and multi-tasking ability.\n\n\n\nSeizure. Some people have severe dizziness, seizures, eye or muscle twitching or blackouts triggered by light flashes or patterns, and this may occur while they are watching TV, playing video games, or experiencing virtual reality, even if they have never had a seizure or blackout before or have no history of seizures or epilepsy. Anyone who experiences any of these symptoms should discontinue Use and see a doctor.\n\n\n\nMedical Devices. The headset, associated sensor, and/or remote may contain magnets or components that emit radio waves, which could affect the operation of nearby electronics, including cardiac pacemakers, hearing aids and defibrillators. If you have a pacemaker or other implanted medical device, do not use the headset without first consulting your doctor and/or the manufacturer of your medical device. Maintain a safe distance between the headset and your medical devices, and stop Use if you observe an interference with your medical device.\n\n\n\nGeneral Precautions. You hereby agree to observe the following precautions:\n\n\n\nUse only in a safe environment: The Game Software and headset produce an immersive virtual reality experience that distracts you from and completely blocks your view of your actual surroundings.\nAlways be aware of your surroundings before and during Use.\nRemember that the objects you see in the virtual environment do not exist in the real environment, so dont sit or stand on them or use them for support.\nClear the surrounding area before Use, as serious injuries can occur from tripping, running into or striking walls, furniture, or other objects.\nTake special care before and during Use to ensure that you are not near other people, pets, stairs, balconies, open doorways, windows, furniture, open flames, ceiling fans, light fixtures, or other items that you can bump into or knock down during or immediately after Use.\nRemove any tripping hazards from the area before Use.\nDo not handle sharp or otherwise dangerous items during Use.\nMake sure the headset is level and secured comfortably on you head, and that you see a single clear image.\nMake sure the headset and any sensor cables are not choking or tripping hazards.\nDiscontinue Use if you feel symptoms such as tingling, numbness, burning, itchiness, stiffness, or skin irritation. See a doctor if any of the above symptoms continue after Use.\nImmediately discontinue Use if you experience any of the following symptoms: seizures; loss of awareness; eye strain; eye or muscle twitching; involuntary movements; altered, blurred, or double vision or other visual abnormalities; dizziness; disorientation; impaired balance; impaired hand-eye coordination; excessive sweating; increased salivation; nausea; lightheadedness; discomfort or pain in the head or eyes; drowsiness; fatigue; or any symptoms similar to motion sickness. If you experience any of the above symptoms, do not drive, operate machinery, or engage in any other visually or physically demanding activities until you have fully recovered from any symptoms. See a doctor if you have serious and/or persistent symptoms.\n\nUSER CONTENT\n\n\n\nThe Game Software may include interactive features and areas where you may submit, post, upload, publish, email, send or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Game Software, you grant SculptrVR a worldwide, irrevocable, perpetual, non-exclusive, transferable, royalty-free and fully sublicensable right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Game Software. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\n\n\nYou are solely responsible for the User Content you make available through the Game Software and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to SculptrVR the rights specified in this section; and (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations.\n\n\n\nSculptrVR does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. SculptrVR has no responsibility or liability for User Content made available through the Game Software, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\n\n\nFEEDBACK\n\n\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials or other information about SculptrVR and our Game Software to us (collectively, Feedback). You agree that SculptrVR shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n\n\nACCEPTABLE USE\nBy accessing or using the Game Software, you agree that you will not:\n\n\n\nAccess or use the Game Software in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Game Software, including, but not limited to, defamatory, harassing, predatory, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content;\nDamage, disable, overburden or impair the functionality of the Game Software in any manner;\nPromote or advertise products or services other than your own without appropriate authorization;\nImpersonate or misrepresent your affiliation with any person or entity;\nAccess or use the Game Software for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates this Agreement, or any other terms or policies provided in connection with the Game Software;\nUse or attempt to use another users account without authorization from such user; or\nInfringe upon or violate the rights of SculptrVR, our users or any third party.\n\n\n\nUSER COMMUNICATIONS\n\n\n\nSculptrVR may make email, messaging, blogging, or chat (collectively, Communication Software) available through the Game Software, either directly or through a third-party provider. SculptrVR is not responsible for communications made by other users via the Communication Software. We are not responsible for communications made by you via the Communication Software. You acknowledge and agree that your communications made via the Communication Software are public and not private communications and that you have no expectation of privacy concerning your use of the Communication Software. You acknowledge and agree that personal information that you communicate via the Communication Software may be seen and used by others and may result in widespread distribution of such information. We strongly encourage you not to disclose any personal information in your public communications via the Communication Software unless you wish such information to be made permanently available to the public.\n\n\n\nGAME SOFTWARE UPDATES AND PATCHES\n\nSculptrVR may provide updates, patches and other modifications to the Game Software that must be installed for the user to continue to play the game properly or at all. SculptrVR may update, patch or modify the Game Software remotely and access the Game Software residing on your personal device for such purpose, and you hereby grant to SculptrVR the right to deploy and apply such patches, updates and modifications. All provisions of this Agreement that refer to the Game Software shall also include all such patches, updates and modifications.\n\nDISCLAIMER OF WARRANTIES\n\nOTHER THAN EXPRESSLY SET FORTH IN THIS AGREEMENT, THE GAME SOFTWARE IS PROVIDED AS IS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTIES OF CONDITION, UNINTERRUPTED USE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NONINFRINGEMENT. NO ORAL OR WRITTEN ADVICE OR INFORMATION GIVEN BY SCULPTRVR OR ANY OF ITS AUTHORIZED REPRESENTATIVES SHALL CREATE A WARRANTY. You are aware and agree that use of the Game Software is at your sole risk.\n\nSome states and jurisdictions do not allow the exclusion of, or limitations on, limited or implied warranties, and in such states and jurisdictions, SculptrVRs and its licensors liability shall be limited to the maximum extent permitted by law. You may have other rights that vary from state-to-state or from jurisdiction-to-jurisdiction.\nLIMITATIONS ON DAMAGES\n\nIN NO EVENT SHALL SCULPTRVR OR ITS LICENSORS BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES RESULTING FROM POSSESSION, USE OR MALFUNCTION OF THE GAME SOFTWARE OR ASSOCIATED HEADSET, INCLUDING WITHOUT LIMITATION ANY LOSSES OR DAMAGES CONNECTED WITH OR CONSISTING OF LOST PROFITS, DAMAGE TO PROPERTY, LOST OR CORRUPTED DATA OR FILES, LOSS OF GOODWILL, COMPUTER OR HANDHELD DEVICE FAILURE, ERRORS AND LOST BUSINESS OR OTHER INFORMATION AS A RESULT OF POSSESSION, USE OR MALFUNCTION OF THE GAME SOFTWARE, OR PERSONAL INJURIES, EVEN IF SCULPTRVR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGES. FURTHERMORE, IN NO EVENT SHALL SCULPTRVR OR ITS LICENSORS BE LIABLE FOR SPECIAL, CONSEQUENTIAL OR INCIDENTAL DAMAGES RESULTING FROM THE BREACH OF ANY EXPRESS OR IMPLIED WARRANTIES OR ANY OTHER TERMS OF THIS AGREEMENT. SCULPTRVRS TOTAL LIABILITY IN ALL CASES SHALL NOT EXCEED THE ACTUAL PRICE PAID FOR THE GAME SOFTWARE. THE FOREGOING APPLIES EVEN IF ANY REMEDY FAILS OF ITS ESSENTIAL PURPOSE.\n\nTERM AND TERMINATION\n\nWithout prejudice to any other rights of SculptrVR, the License shall remain in effect for as long as you use, operate or run the Game Software. The License shall terminate automatically if you fail to comply with its terms and conditions. In such event, you must uninstall and destroy all copies of the Game Software. You may also terminate the License at any time by uninstalling the Game Software from your personal device. The Sections entitled Ownership, License Conditions and Restrictions, Limitations on Damages, Term and Termination, Injunction, Indemnity, Choice of Law and Jurisdiction, and Miscellaneous shall survive any termination of this License.\n\nINJUNCTION\n\nBecause SculptrVR would be irreparably damaged if the terms of this Agreement were not specifically enforced, you agree that SculptrVR shall be entitled, without bond or other security or proof of damages, to take such action as may be required, including seeking an injunction and other equitable remedies, in addition to any other remedies available to it under the applicable law.\n\nINDEMNITY\n\nYou agree to indemnify, defend and hold harmless SculptrVR, its partners, affiliates, contractors, licensors, officers, directors, employees and agents from all claims, damages, costs and expenses (including reasonable legal fees) arising directly or indirectly from your acts or omissions in connection with using the Game Software or any breach by you of the terms of this Agreement.\nRESOLVING DISPUTES\nCustomer service is a priority, but if theres an issue that needs to be resolved, this section outlines what is expected of both of us.\n\n\n\nInitial Informal Dispute Resolution. Before filing a claim against SculptrVR, you agree to try to resolve the dispute informally by contacting us via email at info@sculptrvr.com. We will try to resolve the dispute by contacting you via email. If a dispute is not resolved within thirty (30) days of submission, you or SculptrVR may bring a formal proceeding.\n\n\n\nArbitration Agreement. You and SculptrVR agree to resolve any claims relating to this Agreement, whether or not such claims involve a third party, through final and binding arbitration, except as set forth under Exceptions to Agreement to Arbitrate below. Arbitration is more informal than a lawsuit in court. Arbitration uses a neutral arbitrator instead of a judge or jury, allows for more limited discovery than in court, and is subject to very limited review by courts. Arbitrators can award the same damages and relief that a court can award. This arbitration agreement will survive the termination of your relationship with SculptrVR.\n\n\n\nArbitration Notification. If either of us intends to seek arbitration under this agreement, the party seeking arbitration must first notify the other party of the dispute in writing at least thirty (30) days in advance of initiating the arbitration. Notice to SculptrVR should be sent to us via email to info@sculptrvr.com, with a duplicate copy sent via registered mail, return receipt requested, to the mailing address specified on our website. The notice must describe the nature and basis of the claim and the relief being sought.\n\n\n\nArbitration Procedures. You may bring claims only on your own behalf. The American Arbitration Association (AAA) will administer the arbitration under its Commercial Arbitration Rules and the Supplementary Procedures for Consumer Related Disputes. The arbitration will be held in San Mateo California, or any other location we agree to. In the event that the American Arbitration Association is unwilling or unable to set a hearing date within one (1) year of filing the case, then either SculptrVR or you can elect to have the arbitration administered instead by the Judicial Arbitration and Mediation Services. Judgment on the award rendered by the arbitrator may be entered in any court having competent jurisdiction. Any provision of applicable law notwithstanding, the arbitrator will not have authority to award damages, remedies, or awards that conflict with these Terms.\n\n\n\nArbitration Fees. The AAA rules will govern payment of all arbitration fees.\n\n\n\nExceptions to Agreement to Arbitrate. Either party may bring a lawsuit solely for injunctive relief to stop unauthorized use or abuse of the Game Software, or intellectual property infringement (for example, trademark, trade secret, copyright, or patent rights) without first engaging in arbitration or the informal dispute-resolution process described above. You may opt out of this agreement to arbitrate, but to opt out, you must notify SculptrVR in writing within 30 days of the date that you first became subject to this arbitration provision. You must provide notice to us via email to info@sculptrvr.com, with a duplicate copy sent via registered mail, return receipt requested, to the mailing address specified on our website. You must include your name and address, the primary contact and account administrators name and address, and a clear statement that you want to opt out of this arbitration agreement. IF FOR ANY REASON A CLAIM PROCEEDS IN COURT RATHER THAN THROUGH ARBITRATION, YOU AND SCULPTRVR AGREE THAT THERE WILL NOT BE A JURY TRIAL. You and SculptrVR unconditionally waive any right to trial by jury in any action, proceeding or counterclaim arising out of or relating to this agreement in any way.\n\n\n\nProhibition of Class Arbitrations. YOU MAY ONLY RESOLVE DISPUTES WITH US ON AN INDIVIDUAL BASIS, AND MAY NOT BRING A CLAIM AS A PLAINTIFF OR A CLASS MEMBER IN A CLASS, CONSOLIDATED, OR REPRESENTATIVE ACTION. Class arbitrations, class actions, private attorney general actions, and consolidation with other arbitrations are not allowed. This agreement does not allow class or collective arbitrations even if the AAA procedures or rules would allow them. Notwithstanding any other provision of this agreement, the arbitrator shall not have the power to determine that class arbitration is permissible. The arbitrator also shall not have the power to preside over class or collective arbitration, or to award any form of class-wide or collective remedy. If for any reason the prohibition of class arbitrations set forth above cannot be enforced, then the agreement to arbitrate will not apply.\n\n\n\nJudicial Forum for Disputes. IN THE EVENT THE AGREEMENT TO ARBITRATE IS FOUND NOT TO APPLY TO YOU OR YOUR CLAIM, YOU AND SCULPTRVR AGREE THAT ANY JUDICIAL PROCEEDING RELATING TO THESE TERMS OR THE GAME SOFTWARE MUST BE LITIGATED EXCLUSIVELY IN THE FEDERAL OR STATE COURTS OF SAN MATEO COUNTY, CALIFORNIA. BOTH YOU AND SCULPTRVR CONSENT TO VENUE AND PERSONAL JURISDICTION THERE.\n\n\n\nCHOICE OF LAW AND JURISDICTION\nThis Agreement is governed by and construed in accordance with the internal laws of the State of Delaware without giving effect to any choice or conflict of law provision or rule. Any legal suit, action or proceeding arising out of or related to this Agreement or the Game Software shall be instituted exclusively in the federal courts of the United States or the courts of the State of California in each case located in San Mateo County. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.\nAMENDMENTS\n\nSculptrVR reserves the right to amend this Agreement at any time, at its sole discretion, but will post such changes on the SculptrVR website and/or will communicate such changes through the Steam service. If we make changes to this Agreement, we will provide notice of such changes by updating the Last Updated date below. If any such future changes to this Agreement are unacceptable to you or cause you to no longer be in compliance with this Agreement, you may terminate this Agreement in accordance with the above Termination provisions. Your installation and use of any updates or modifications to the Game Software or your continued use of the Game Software following notice of changes to this Agreement will constitute your acceptance of any and all such changes to the terms of this Agreement.\n\nMISCELLANEOUS\n\nThis Agreement represents the complete agreement between you and SculptrVR concerning the License and your rights to use the Game Software, and supersedes all prior agreements and representations, warranties or understandings between you and SculptrVR, regarding the same subject matter. If any provision of this Agreement is illegal or unenforceable under applicable law, the remainder of the provision will be amended to achieve as closely as possible the effect of the original term and all other provisions of this Agreement will continue in full force and effect.\n\nIf you have any questions concerning this Agreement or the License, you may contact us at info@sculptrvr.com.\n\n\n\nLast updated: June 20, 2016.\n\nUsing exMinimal WordPress Theme by YayPress", "Space Required": "288.6 MB"}



["5 stars\n77%\n4 stars\n16%\n3 stars\n3%\n2 stars\n1%\n1 star\n3%", "nick_riffell_Jun 28 at 7:32 PM\nONE FLAW\n\nNow, this game is amazing. I love sculpting. However, you guys need to add a TUTORIAL. Some things I still dont know how to do. And some Im in the process of learning how to use them. You need a tutorial.\nAlso, on a separate note, you guys need to monitor the online content. Some of them are very.... not good. Pls monitor some. Good overall game but you need a tutorial\n\nHelpful | 92", "Pepperw2Jul 11 at 10:41 PM\nI am so horrible at this game\n\nIt is still pretty awesome. Today I discovered how to fly...in my empty landscape (except the random basketballs I created). If you like to learn and discover how to work things on your own, I really recommend.\nI am 51 years old and I feel like it is important to keep the old brain juices flowing. This game has forced me to use parts of my mind that I feel like I have not activated in years.\nSeriously guys, get this. At first you will think it is dumb, but then you realize there is so much to discover. Suddenly it clicks... its not so much the game thats dumb. hahaha\n\nHelpful | 11", "Littengamer999Jul 30 at 11:22 AM\nWe need a tutorial\n\nThis is an amazing game, with ONE flaw.\nWe need a tutorial, many others want this too but I personally want it because I dont even know how to move around properly! Please for the love of bacon add a tutorial\n\n\n\n\n\n(Edit) Thanks for replying and sending me that link, also here is your bacon \n\nHelpful | 3\nDeveloper ResponseJul 30 at 7:21 AM\n\nfor bacon, you say? this youtube tutorial has been great so far: https://youtu.be/u16zmV62-6w", "Camos101117 days ago\nBest asset app!\n\nI'd recommend this app to anyone who wants to rapidly make assets for a game. Unlike a lot of other apps you can just form the general shape procedurally and go back and smoothen it out and then quickly zoom rotate and sculpt out the details. The Export option is a major and powerful because, from there you can export an .obj or .fbx and open up what are generally primary 3D programs to just basically touch them up or leave as is and skip the other programs entirely. It's like using a scanner without the hassle of photogrammetry or expensive scanning equipment to make instantly game ready asset. Game Changer!\n\nHelpful | 1", "xXAstroCatYTXxJul 18 at 4:50 AM\nNot what I expected\n\nDefinitely not what I expected, I thought it would be easier to sculpt stuff but thats on me for being bad at sculpting so it wont affect my review, also not what I expected as in I thought it would be way worse because of the price tag. Also got it because of the price tho so, thanks for making the game so cheap and so great.\n\nI love the game so far and the concept and Im still new so I might change up my review later.\n\nThree things that if added would make my rating a 5 star review:\n\nPlease, please, omg so many pleases in hopes that you can add an age restriction thing where there is an NSFW section where all of the NSFW sculptures are put, make it so you have to change something on a settings page saying, 18+ or something so its harder for little children to see these things. I know so many people who would love to show their kids this but Im worried they will find some NSFW sculptures. You could also hire people to review sculptures to see if they are NSFW or not when somebody tries uploading a sculpture and appropriately mark them as NSFW or not.\n\nThe second thing I would like to see changed is moving, please make it so you can move while you are sculpting. I hate being in mid sculpt then not being able to reach somewhere because of the limitations of my room.\n\nThirdly please add some tips and stuff or like a tutorial or something, its a pretty big learning curve otherwise...\n\nOne last thing, if either of the last two are changed or if I get a response from the devs (or dev?) saying he or she will change one Ill change my review to 4 stars. Although with the first one Im gonna need the feature to be implanted into the game before I give 5 stars.\n\nP.S.\nI understand that there isnt too many devs working on this game unlike other games and it is most likely incredibly difficult to fix stuff and respond to everybodys reviews.\n\ntl;dr\nMake NSFW section, be able to move while sculpting, add a tutorial or some tips.\n\nBig thanks to the devs (or dev? Idk) for making this game :), bigger thanks if you have read this far and even bigger thanks if you respond.\n\nP.P.S. Holy moly I just noticed how long this review is, thats like 20 minutes of whoever is reading this reviews life that they will never get back.. :/ sry lol.\n\nUpdate:\nOne last thing pls add naming and search function in the online sculptures? Im sure ur already working on that though. Once again sorry for such a long review, I know you have much better things to do than read stuff like this.\n\nHelpful | 13", "Virtual_KlaarJul 25 at 2:45 PM\nAmazing\n\nThe ability to first build a giant land with villages and stuff, or a giant hippopotamus, or whatever. And then being able to get really small and feel like you live there, and being able to jump of a giant mountain and then fly away with a glider. Just totally amazing\n\nHelpful | 2", "Shea7TDMJul 26 at 11:27 AM\nGreat!\n\nLove it! The controls and options are amazing. I like the multiplayer options as well where you can create art with friends or just random people. Although you could add a small tutorial where you can learn the controls and all options. I still trying to learn all the controller options and editing but overall good work!\n\nHelpful | 1", "OwenP11Jul 19 at 11:12 PM\nAmazing apart from the bugs\n\nSo when you go to a team build sometimes it takes an awfully long time to load. Now the bugs you can get flicked and then you have to teleport to someone , and it will take you away from the bit you are building for the team. Really need Tutorials for the tools and how to build.\n\nHelpful | 1", "No3vA8 days ago\nJust buy\n\nWas sceptical to by because of the fact I allready own tilt brush, but dang this is awesome. And for 10 dollars!!! Just get it.\n\nHelpful | 0", "FlomflomflamingoMar 27 at 7:45 PM\nIm a teen artist.\n\nFirst right off the bat this game is amazing its really fun and five star recommended it but I wish they would add water or glass or either would be great and I wish they added something where it would make the area direct, not tilted not low just a perfect angle. This is a far shot but please add animals and life forms wouldnt it be cool to come home from school or work put on a headset and easily just become a god of your own world sculpt the land use natural disasters or play with friends and sculpt whatever I would pay extra for animals and water like what if you got to design a full person, build them a house, and sculpt the land and then watch them prosper. But thats probably just me if you read to here thank you and please have a great day. \n\nHelpful | 145", "staptus22 days ago\nOutstanding!\n\nAll the tools easy to learn how to use, and the possibilities are endless! Based off of my experience, I definitely recommend you this app to satisfy your sculpting needs.\n\nHelpful | 0", "Jadranko.K-KApr 22 at 10:09 PM\nThe magic of sculpting in VR\n\nThis app is simple and powerful. Simple because it boots almost instantaneously with no nonsensical intros and just drops you in a virtual environment ready to start creating stuff. The tools are intuitive and easy to learn, some may miss a tutorial but I'd rather simply watch a YouTube video. You can sculpt pretty impressive 3D models. As with any other art/craft it takes some time to master. I was very proud of the first model I created on day 1 but it is taking me some time to get to the level that I want. Exporting models to the computer or importing reference images is possible and easy but you need to connect to your computer with the USB cable, which I find a bit tedious (this is a general complaint about Oculus Quest, though). Check the online creations by other people, some are childish and basic but some are incredibly good. The multiplayer mode is a plus: join a random gane with strangers and enjoy sculpting some nonsense.\n\nHelpful | 14", "Gri5in_ytJul 25 at 10:12 PM\nNice\n\nThis is the best game Ive played on my quest so far so nice job :D but it would be nice to have a tutorial\n\nHelpful | 1", "wzhang100818 days ago\nYour limitation is your own imagination\n\nYou can spend countless hours here. So much fun\n\nHelpful | 0", "StrayceMay 21 at 3:06 AM\nGreat value!\n\nI cant figure out if this is a really basic tool, or an incredibly powerful toy. Either way, its well worth the price. I havent done 3D modelling since a six month college course in 2006 or so, but armed with this and a bit of inspiration I was able to get satisfying results incredibly quickly. I understand there have to be limitations because of Quest hardware, but a few more primitives would be nice. How can you not include pyramids? Maybe proper splines for extrusion. Some distort tools. Freehand drawing is great for immersion, but not super precise. I absolutely love that objects can be exported for 3D printing or editing elsewhere. I can see myself spending a lot of time with this.\n\nHelpful | 3", "abwbtbJul 22 at 12:58 PM\nLove the game\n\nThis game can be used to make gorgeous creations but at the Same time is extremely user friendly\n\nHelpful | 1", "Morgus123Jul 18 at 9:57 AM\nCreative in vr\n\nA lot fun to draw but if your under the age of 13 then never go online you will regret it\n\nHelpful | 0", "sh0ck3r34Apr 26 at 7:03 PM\nBeginner sculpting for the price\n\nThis app is pretty cool decent amount of content and I like that u can host sessions up to 4 in a room it not no Oculus medium or masterpiece vr those are more advanced apps but this is a fun relaxing good start... my only issue so far is there is no straight draw line tool also in multiplayer when u host a room u can't lock it to have options for public or friends only so u will get people that come in and pester ya and try messin with ur sculpting yes u can kick them but they can keep coming back in so thats annoying ..please change that option there's alot of kids on there\n\nHelpful | 10", "simchiJul 14 at 1:21 PM\nNo updates\n\nMy daughter likes it but there hasn't been any updates on it for some time. Even their fb page hasn't had any posts since 2018.\n\nHelpful | 0\nDeveloper ResponseJul 14 at 3:29 PM\n\nThe last post on FB is me saying I will no longer post on FB, so please join the discord or follow me on Twitter :-). The last update for SculptrVR on Quest was 11 weeks ago. It added transparent layers! You're right that updates have slowed, though. I haven't had as much time to work on SculptrVR since covid began..", "bigjayt2227Jul 29 at 10:47 AM\nChange hands\n\nHow do I access file/settings to change hands?\n\nHelpful | 0\nDeveloper ResponseJul 29 at 2:32 PM\n\nopen the file/settings tab and click settings. Handedness is a setting in there.", "doubleheadMay 16 at 9:51 AM\nCool. But not for your 3-D printer.\n\nWhat made me by this is that they mention you can design for your 3-D printer. My eyes lit up hoping it was something like tinker cad. Something where I can actually make use of VR to fine-tune Stuff for 3-D printing. It is extremely not that. It has no tools for proper extraction or shaping of some thing that will be stable to print. That being said its a nice sculpting tool. Just very much not what I hoped it might be.\n\nHelpful | 5", "ZeerkFeb 3 at 9:27 PM\nRe-created my apartment in vr!\n\nI've never written a review for the few months that I've owned a Quest, but this game was so much fun. Me and my cousin recreated my apartment one day and it felt so weird to be able to go sit at the table with the headset on!!\n\nWhile we were making it the only problem we encountered was having to take the headset off and on to compare what what it was we were sculpting. It would be great if there was a feature to import a photo into our world.\n\nThanks for the great game!\n\nHelpful | 95", "TinkleFairy1396Feb 20 at 2:15 AM\nPhenomenal Game\n\nI dont consider myself an artist. If you asked me to sculpt with clay, youd get a bulge stick figure with disproportionate limbs. However, as of the last few months Ive been feeling this creative artistic vibe and Ive gotten into a lot of drawing and coloring type things lately. So when I saw this game come across my Oculus app, I just had to try it. The screenshots and videos dont do it justice.\n\nAt first I was just waving a sphere tool around and wondering how I could make anything other than a family of worms... Theres little to no explanation to how the game works but if you just mess around with the tools, it is a quick and easy thing to learn.\n\nWith my other favorite games like Super Hot, I play for 30 mins to an hour and Im ready to take a break. When I put on my headset and enter the world of SculptrVR, I find myself being nagged by the device to connect to a charger. Ive spent hours playing around in this game and losing track of time, its so easy to get lost in it. Im currently writing this review at 5 am after playing all night and deciding between sleep or playing some more.\n\nIf you have a creative mind and enough patience to teach yourself how to use the tools, the possibilities are nearly endless with this game. Ive never rated a game or written a review, but this game absolutely deserves the 5 star bump because any rating less than that is from someone who just hasnt learned how to use the tools yet.\n\nHelpful | 37", "CalebTheUnimpressive13 days ago\nWonderful game, but one question.\n\nI really like making things with this game. The tools are useful and its fun to imagine and draw up whatever you like. But my one question is, how do you add backgrounds? Ive tried searching up the website it told me to, but it never shows the right one. Maybe its because I have an iOS device? Id really appreciate it if you answered this for me.\n\nHelpful | 0\nDeveloper Response12 days ago\n\nyou can change the color of the sky by selecting the Sky grabber tool and then picking a color on your color palette. to make an actual background, you would have to build in another layer, detach it with the key symbol, and the scale it up big.", "CommandBlockGuruA day ago\nAmazing App But One Problem\n\nI love this app- I may usually be a 2d artist, I like making 3D models of my characters in very for a better idea on proportions and such, but the app has one flaw- I dont believe theres a way to disable the delay with the tools. I really hope this becomes an update soon. Thank you.\n\nHelpful | 0", "Kasumo21 days ago\nAmazing game\n\nNo complaints, it was better than I expected. To the people complaining that it needs a tutorial or that its too difficult to sculpt, it takes trial and error  you have to learn yourself. This isnt a toddler coloring book game, its a 3D sculpting game. If youre that inept to where you cant learn the basics within a couple hours, then sculpting isnt meant for you\n\nHelpful | 0", "eictoApr 5 at 3:16 AM\nNice\n\nThe game is nice, it is very easy to create full scale epic scenes. But it would be nice to add some features\n1. Export stereo photo.\n2. Export to somewhere, where device can get files itself, without pc app (sharing is a big problem in oculus always)\n3. Triangle tool, to draw triangle shapes\n4. Make not connected blocks movable.\n5. More social things - likes, artist teams, etc.\n\nHelpful | 3", "Oculus_TLJul 27 at 4:46 PM\nSuprisingly one of ny favorite games\n\nWhen i got this game i just thought it was gonna be a cheap game that is a single player game just to draw when you are bored but I was surprised to see that this game is amazing to hangout with friends and make memes and laugh and make new friends too and I say its a great game\n\nHelpful | 1", "Meaty_May 24 at 4:47 AM\nGreat app\n\nIt's great I've had it for a week now and ever single day I've played it and it never gets old.\n\nHelpful | 1", "turtlehedgehogMar 18 at 10:56 AM\nFun, but has problems\n\nI liked this game, and thought it was fun, but it definitely had problems. It felt a bit like it was in beta. First of all, it would be nice to have a tutorial to help you out at the beginning. It launched me in and I had no idea how to play, and Im still figuring it out. Also, it would be nice to have pre-made landscapes that you could build on instead of having to build something in the middle of no where. It was also a little strange how you could only build something in a certain 3-d cube and no where else, but is also kind of cool. It would be nice to build anywhere. I would also like to have an easier way to move what you make. Holding the grip button works, but when you are trying to drag something towards you it feels awkward. Lastly. It would be nice to edit what you make in three dimensions. For instance stretching what you make out or making it more flat. There are minor glitches, like when you hit something nearby with a rocket you can get stuck in the ground. Apart from those, I loved the game and had tons of fun with it! Thank you for the developer for doing such a great job! I ended up using this for some school projects.\n\nHelpful | 6", "outlawsquash632Apr 26 at 12:04 AM\nGood.\n\nIm gonna be honest here, the game is really good but for me its quite hard to sculpt good sculptures because of the space you have to sculpt but honesty its a really cool game, the graphics are good, the physics are pretty good, and its multiplayer so you can build things with friends or random people. But i would like them to fix of the rendering issue, and i would also would like a glass material or a water material, but overall its a great game and i do recommend getting it.\n\nHelpful | 1", "llinosd2Mar 29 at 9:29 PM\nSculpt vr\n\nI love this when I first got it I did not know what to do. I saw a party I could join and I joined and these nice people helped me to start sculpting.now I can't stop. Great once you know good to check out you tube as well for tips xxx happy scultping\n\nHelpful | 2", "Wjames33Feb 14 at 3:56 PM\nThis is great\n\nThis game is very fun to mess around in. I have never been good at art or been a super artsy person, but when I make something in this I feel accomplished and impressed. At first I did not know how I was supposed to use most tools, but after making something big I realize they are all very useful.\n\nI would appreciate an option to set the size back to normal after zooming in or out though.\n\nHelpful | 9", "HaotleMay 14 at 4:38 PM\nCreativity engine\n\nMy 6 year old loves it! She has caught on quick and sculpting houses and animals. It's a moment of inspiration, and worth the $5!\n\nHelpful | 1", "TreyBroMar 28 at 12:24 PM\nMore than I hoped for\n\nGreat game, but I wish there was a tutorial. The way I learned the game is I went online and somebody else taught me. So easy to build any of this that you see in the video. make your own head, five stars\n\nHelpful | 2", "WheatbreadzApr 6 at 8:42 PM\nAwesome!\n\nLove all the stuff you can do! I hope they eventually add finer brush details like a pencil carve would be nice. More paint brush styles. Other than that I have a blast playing it. I'm not artistic but I can make a cool ocean wave :) and a town. Haha I like it. Multiplayer is cool. I've found some cool people at times just all collaborating together making stuff.\n\nDefinitely worth it. Kick back. Relax and make some stuff. :]\n\nHelpful | 1", "cotheturtleMay 13 at 1:12 PM\nCould be better\n\nEither i dont know how or you cant make something without it messing up something around it please fix this\n\nHelpful | 1", "PayneSculpturesMar 4 at 11:57 PM\nDeceptively powerful yet simple\n\nTonight was my first night using SculptVR. At first blush it seemed so much less refined than Medium but soon I was creating and refining shapes to begin to create something I can be proud of. The key is to bulk out with cube or sphere and then carve and smooth. Using this process I was able to make better and better sculpts. Its amazing how detailed it can get on quest hardware!\n\nHelpful | 4", "Kaelin24Mar 22 at 9:41 PM\nSuper fun\n\nThis game is super fun, it has a nice selection of tools to use and is very easy to use, the only downside in this game is how whenever you make something with a little bit of high detail or small, it has a hard time rendering your sculpture, other than that this game is amazing\n\nHelpful | 2", "debksurFeb 29 at 7:06 AM\nneed age categories\n\nI have not got the hang of it yet,a bit confusing,needs like a pen to do really small details.You can be doing something & you let other people join or you join them but end up them being kids & some younger than 13. I really think you need age categories,as one they mess your work up or doing something very babyish & two it's really weird getting young kids talking to adults.\n\nHelpful | 12", "nb20522Mar 20 at 10:46 AM\nFun and big Posebilities\n\nI can really build whatever I want and it is fun you can draw with friends and I like the 3d it makes it easier to get 3d pictures becouse it is a 3d space\n\nHelpful | 3", "Nastyfox23Apr 8 at 11:35 AM\nBrill app\n\nI wanted a sculpting app that was cheap but I heard bad things about this from friends but this is BRILL\n\nHelpful | 2", "felix330Jul 13 at 8:26 AM\nImpressive\n\nThis works really well and seems to be quite a powerful and fun tool for digital art. Everything is very intuitive. No performance problems on Quest so far, nice that it's crossbuy.\n\nHelpful | 1", "K-CrewApr 9 at 4:16 PM\nGreat game\n\nThis was an amazing game I loved the graphics and how it really is good for children!\n\nHelpful | 2", "Memes_are_goodyeet14 days ago\n...\n\nAmazing just amazing\n\nHelpful | 0", "pjlaiJul 10 at 7:19 PM\nAmazing, created a world\n\nI just purchased it today. Read a lot review and watch youtube tutorials on sculptrvr tiltbrush and gravityScretch. This one fit me the most for entertaining purpose.\n\nHelpful | 0", "mike.east.9619Feb 16 at 2:49 PM\nThis is by far the best vr game\n\nI only have a handful of games but this is by far the best! There is so much you can do! The possibilities are endless. You can let your imagination run wild! I can finally express what my mind sees in 3D form! And it is cheap for the quality of the app. If I didnt know the price I would guess at least 25$ not 10$!\n\nHelpful | 2", "Stoplight001Dec 28 at 11:55 AM\nEVERYTHING AND THEN MORE!\n\nI am a sculptor but this is so much more! Theres no limit and no boundaries and what more could you ask for! There is so many options and love love love the generate an idea tool. I cant tell you how manny times I have prayed someone would tell me what to sculpt to start the creativity. But my first experience was with a stranger and it was the coolest moment to sculp and make something with someone. If you love art this is 10000% a must own. Trust me you womt regret it. I wish there was a tutorial just to make sure I understood how to use all the tools. Lucky enough the kid i was sculpting with was able to show me how to use a lot. The flying is amazing and I didnt have a problem with the triangle. Love that you can even change the time of day like wwwwwhaaatt. I probably said how cool and even squealed a couple times in excitement form how cool it can be! Thank you xoxox\n\nHelpful | 23", "joedav8Jan 28 at 2:30 PM\nIncredible (even for awful artists)\n\nI have no artistic ability whatsoever so I can't take advantage of all the possibilities but still loved messing around in there. It does a great job of adjusting how much detail is shown (a limitation of the Quests low power) to make sure to fully render whatever you are currently working on/looking at. That worked better than expected, you can clearly see things go in and out of detail but to me that makes the game even more impressive as they had to make the algorithm to do that so it could run smoothly in the Quest.\n\nHelpful | 5", "TijmensJan 26 at 4:23 AM\nI love this app, but exporting on Quest.\n\nThank you Nathan for this piece of gold. Im an artist that uses your app as a sandbox for sculpting and feel like a child again in doing so. But when I want to export an object, I get an extremely long link that is impossible to copy-paste. Where can I find my exported .obj files??\n\nHelpful | 5\nDeveloper ResponseJan 26 at 9:28 AM\n\nthe export is on your quest hard drive. to find it you need to connect to computer via USB. i can never remember the exact location either, but its something like android/com.sculptrvrvinc.sculptrvrapp/data/exports", "QueefTacosFeb 9 at 5:38 PM\nJust pure fun and the multiplayer system\n\nLove the game and use this more than the other art apps I have (tilt brush and graffiti) would love some more abilities but at $5 its a steal and easily worth 4 times that right now....soooo much potential...love the game and keep it up Devs\n\nHelpful | 3", "Maddox081277Apr 14 at 8:44 AM\nPlease add this feature it be better\n\nCan you add a   search tool and age setting so kids dont run in to the design stuff please I would appreciate it and than Ill give 5 stars that all I have to say\n\nHelpful | 2", "Happy-BeeFeb 19 at 5:09 PM\nthis isnt what i expected at all.\n\ni read a few reviews and videos before making my purchase, but is still disappointed. I was under the impression that there'd be tools to help us create basic things like head sculptures, or models,but... In a nutshell, I cant seem to sculpt things properly with such limited tools. the tools are too rough, or unwieldy...i cant smoothen, press or pinch the \"clay\" in this app. basically you can only create clay out of thin air, or make them disappear with another. while the rest of the tools available are mostly gimmicks or gaming type (like a rocket that blows up things). if there's just 1 tool i could ask for right now that might change the whole experience for me, that would be a precision pen or knife tool. a sharp pointed tip for chiseling or merely cut away things on the virtual clay. that might just be the most needed tool to add. All that said, I will not ask for a refund, as I feel the price is justified for the amount of work the dev has put into the app, and seeing how things are still being improved, I will say the dev deserves our support. Thank you.\n\nHelpful | 2\nDeveloper ResponseFeb 20 at 2:30 PM\n\nThere is a smoothing tool, and a bulge/deflate tool next to the sphere! I'm planning to add a \"stamp library\" in a future update that should help you get started with more complex shapes, but that might not be for a while..", "hansthemanJan 23 at 10:34 PM\nWow just wow!\n\nI've been doing digital sculpting for years and finally my dream app has arrived! Now it actually feels like standing in front of a real life sculpture!\nThe current price is a no brainer, get it before it costs what it is actually worth!!\nHint : if you have a powerful pc you might consider the steamVR version played through virtual desktop or Oculus Link(unlocking some additional features).\n\nThe developer is just 1 person who actively engage with his community inviting you to his Discord challenge to give suggestion and report bugs etc..\n\nI haven't looked into the multiplayer part but I can see there is potential to actually teach sculpting through this app in a virtual school setting! Or just play together in your virtual worlds!!\nI had my nephew who is 12 play it - he prefers to just dig tunnels and blow things up with rockets \n\nHelpful | 0", "loqkloqksonJan 29 at 3:30 AM\nSeems limited by hardware\n\nExcellent program, once you've added enough detail to your avatar, it's too much detail to render in real time.\n\nSomeone said that there are no fine brushes, but you can draw and paint with the tips of cones, which are pointy, so I'm not sure what they mean.\n\nHelpful | 0", "CkempJan 17 at 11:59 AM\nAmazing!!!!\n\nThis game was very amazing and it is so much fun! I would recommend that when you walk in the walking mode, that you can walk on all sides of things without having to reorient yourself like if you were walking on something round and you want it to almost have gravity on it. But the rest of the game is SO COOL! I play it all the time.\n\nHelpful | 0", "kkuzma1982Feb 7 at 4:01 AM\nMaking sculptures multiplayer is amazing\n\nThe whole experience of sculpting little world's in multiplayer and later flying glider or climbing makes this experience like no other. I really recommend it especially for the price.\n\nHelpful | 0", "TheDarkSide519Jan 6 at 5:34 PM\nHaven't tried online but I'm happy\n\nThis is awesome this is what I boot up to relax its perfect no complaints at all (have not been online but I'm happy on my own) basically it's an art program where you can build the preview shows it all but despite sounding simple its actually a lot of fun building tiny towns with mountains in the back or trying to recreate famous landmarks or as someone who has mental health problems just making my own little happy play for my self to be alone no complaints at all suggestions maybe but no complaints\n\nHelpful | 2", "john.michael.5895Sep 24, 2019 at 3:47 AM\nKiller app but get rid of the triangle!!\n\nGreat you can fly.. But with a stupid lazy rendered triangle??? . Developer is not listening. The triangle glider thing on top is out of place, blocks view. How hard would it be to put it right? After saying that.. It is the very best tool out there. People buy it!! Just sack the idiot who who designed the glider.. He must be working for the opposition\n\nHelpful | 170\nDeveloper ResponseDec 6 at 5:20 PM\n\nOk, you've definitely got passion. SculptrVR is built by one person, so I can't exactly fire myself for the graphical representation of the hang glider. I will consider adding an option to hide the glider locally so it doesn't block any of your view :-)", "saikenyaFeb 16 at 9:58 PM\nFun tool\n\nFun tool with multiplayer functionality. Good for learning the basics of sculpting. I wouldn't expect more than the basics but people have done some cool stuff.\n\nHelpful | 1", "psully4114Dec 11 at 10:21 AM\nIts a great tool\n\nVery functional and very intuitive. I made some great stuff in my first few minutes. The only drawback is the limitations of the Quest become pretty apparent pretty quickly and it doesn't take long for the game to start scaling back details in whatever youre making so whatever you make has to be pretty low poly to very pretty for very long. Its good though. Really cool.\n\nHelpful | 11\nDeveloper ResponseDec 11 at 9:46 PM\n\nIve done my best to maximize visible detail, but theres more to do. For now you can get up to ~4x detail in large worlds when zoomed way in! Also theres a screenshot mode that shows 3x detail temporarily.", "CoffenDec 30 at 2:06 AM\n\nThere are three reasons I love this application:\n1) It accomplishes something I almost didn't know I wanted from VR. The ability to quickly and easily create 3D sculptures, and then shrink down really small and explore around them.\n2) The more you play with it, the more features you discover. It's honestly impressive how pretty simple tools, can be used many ways when 'drawing' in 3D.\n3) Multiplayer is neat.\n\nHelpful | 1", "OinkOinkPiggyGoDec 28 at 5:14 PM\nI love it!!!\n\nI love this game. There is endless possibilities and you can create nearly anything, like a volcano, a city, a river or even a dog! I love this app and use it nearly every single day. It also lets you interact with other people! Build, sculpt and enjoy! Its that simple. I hope this review was helpful. Have a good day!\n\nHelpful | 2", "kloudificDec 31 at 6:40 PM\nAmazing, such a low price\n\nLow price for such an awesome game. The shrinking and enlarging feature makes the game even better, plus MULTIPLAYER! That's what really sold me on this game. Really good, one slight issue. When I make a full wall of cube with the fixed cube it shows some areas not completely filled in, but that's my only slight issue. Only other thing is not an issue but maybe just a few more items to play around with would be fun!\n\nHelpful | 0\nDeveloper ResponseDec 31 at 9:52 PM\n\nhmmm Ill look into that cone bug.. Thanks for the bug report !", "MetaverseCatDec 23 at 4:27 PM\nSculpting in VR is Wonderful\n\nSculptrVR feels pretty crude at first, but after some practice you start to understand the hidden power of what at first feels like a big: dynamic voxel density.\n\nShapes seem muddy and ugly at first, but refining them into real models is a simple matter of running finer tools over the model, and with practice this becomes a natural first step to making something.\n\nThe interface is simplified perhaps a bit too far, and some tools like undo being right there under your non-dominant thumb aren't obvious at first.\n\nAll of which to say first impressions can be deceiving, and SculptrVR is a tool that started at the bottom of my list for 3D, but is now on top!\n\nHelpful | 4", "JimZMNov 29 at 11:47 AM\n\nI'm no artist, but it's still quite fun/wonderful to experience drawing/sculpting/zooming in 3D VR. It would probably worth way more than $10 for someone with art skills. I wish the scene does not shake so much when being resized by my unsteady hands, because it reduces the feeling of weightiness when I zoom it up.\n\nHelpful | 4\nDeveloper ResponseNov 30 at 3:19 PM\n\nAh thats an interesting suggestion.. add a bit of smoothing to the zoom operation.. Ill try it and see if it makes me sick.", "Jake.70Apr 28 at 6:54 PM\nGet it now\n\nThis game I 200% recommend one of the best games on the quest and they have an amazing customer service team. I cannot recommend you get this game enough. Its awsome just absolutely amazing\n\nHelpful | 0", "hargisssNov 7 at 5:22 PM\nFeels like magic\n\nThere's only one app on Quest which lets you make 3D-printable sculptures. There's only one app that lets you make sculptures collaboratively with people across the globe. There's only one app that lets you create a planet, zoom in and sculpt a mountain, shrink down and sculpt a house on the mountain and a table in the house and a five-course meal on the table, then blow the whole planet up with a missile. It's built for fun but it's so good you can use it as a professional tool - I've used it with Blender to create professional-looking work. There is no substitute for Sculptr, it's got a rich feature set no other program has and is a fraction of the price of Tilt Brush or Gravity Sketch.\n\nHelpful | 25", "basementjackJan 2 at 6:47 AM\nGreat Community\n\nSculptrVR is an interesting tool in that you can sculpt in real time with others.\n\nThe developer is active on discord and regularly interacts with the community.\n\nAlso a special mention is that SculptrVR supports Cross buy - so you can use it on both your quest and rift with a single purchase!\n\nScultprVR is still under active development and I look forward to seeing future updates and improvements.\n\nHelpful | 4\nDeveloper ResponseJan 1 at 10:04 PM\n\nthe floor grid bug is fixed, but I wont be able to push an update for a couple weeks. Im taking my first vacation in about a year :-) Id love to have you join the discord and share deeper feedback there. http://discord.gg/qEX5ZKG", "JettAEDec 24 at 6:53 PM\nWow... just wow.\n\nSo one of the reasons I bought a Quest was for one of the art programs. I am so blown away by this app. It's battery efficient, its memory efficient (though I do get why some say the low-load poly stuff can get annoying if you go too big), and it's crazy fun. The tools, once you learn how they work are powerful enough to make pretty much whatever you want. And thanks to the \"zoom feature\" you can make incredible worlds to walk through. I am excited to make worlds my D&D players will be able to walk through. Thank you for making this app, and making it cheap! My only complaint is I wish the brushes would remember the last size you used, or an option to enable this.\n\nHelpful | 1", "TwistedTaco2000Dec 26 at 7:59 PM\nWow!\n\nThis is an AMAZING drawing tool! I really like it because unlike the expensive ones like tilt brush, it is relatively cheap. It is very simple, and easy to use, once you learn how to use it. There are no fancy particles or anything like that, which I really like, and there are a lot of things that are just fun to play with, like the rockets or shrinking features. There are to negative things to note before you buy:\n\n1: there are a few bugs with voxels\n\n2: there is no tutorial, so you may need to look up a tutorial video online\n\nAll in all, its a really great tool! 10/10 would definitely recommend over most other drawings platforms.\n\nHelpful | 0\nDeveloper ResponseDec 26 at 8:17 PM\n\nif you care to report the voxel bugs youve encountered, please drop me a line! info@sculptrvr.com or hop in the discord!", "WhyNot258654May 14 at 7:40 PM\nAmazing but I have one issue\n\nIm thinking all the same things that everyone else is but im having quite a lot of trouble uploading a reference image, anyone know anything?\n\nHelpful | 0", "xxae8Feb 9 at 5:23 AM\nGreat game but...\n\nThis is great for drawing with many options and things you can do with your would but nobody is online so it is kinda boring when you dont have a friends to play with. Great work on the game and i like the tools you can use within this game.\n\nHelpful | 1", "timeat2Feb 17 at 8:39 AM\nThis game is very amazing\n\nAmazing\n\nHelpful | 0", "keith.talbotDec 29 at 4:00 PM\nPretty good little sculpt app for Quest\n\nSo coming from sculpting with Medium on a powerful pc this app is a little basic, but the great thing is it runs native on the Quest and after a little play around it has some nice tools and big potential.\nAt first I was looking at how to add finer details then I realised you have to zoom in which kind of works.\nIt runs smoothly and I can see with a bit of practice with the tools you could sculpt some pretty cool stuff in it.\nNote to the developer. One thing that would make the sculpting so much nicer would be pressure sensitivity on the trigger for clay size with the basic sculpt tool.\n\nHelpful | 2", "zacnooDec 3 at 3:27 AM\nOnly title worth the money on Quest\n\nThis thing is amazing. I bought it because it was cheap and was gonna mess around with multiplayer for 30 minutes or so.\n\nI ended up spending like 6 hours that day creating little worlds and zooming in and adding more and more detail. The 10000x zoom is amazing, not having to worry about scope or starting too small. I love the graphics and lighting, keep up the awesome work.\n\nEdit: I just saw it was cross buy as well?! Just buy it, best value on the Oculus Store hands down.\n\nHelpful | 5", "AdventurousBunnyFeb 8 at 9:02 PM\nNot what I thought.\n\nYou cannot sculpt fine detail. Not enough tools. I also thought you could walk around and sculpt kind of like tilt brush. A few updates and it would be great.\n\nHelpful | 2\nDeveloper ResponseFeb 8 at 10:20 PM\n\nDid you discover that you can zoom in by holding both grips at once? You can get pretty detailed :-)", "AF07Jan 28 at 5:17 PM\nJust perfect\n\nDont know what to say just perfect\n\nHelpful | 0", "terrible.monsterJan 6 at 12:23 PM\nMy Favourite App\n\nI seriously like the experience and the freedom it gives when I come up with ideas. Thank you, dev. Don't stop adding features, please.\n\nHelpful | 1", "marek2005Jan 13 at 4:48 AM\nGreat app over all\n\nThere is one problem : I am lefthanded and in some cases I have to swap my controllers . Is there any solution\n\nHelpful | 0\nDeveloper ResponseJan 13 at 5:18 AM\n\nyep! go to settings (in the file/settings tab) to switch handedness", "penguindowsDec 3 at 8:17 AM\nFast learning curve, very fun\n\nI am 3 hours ish in. I absolutely adore sculpt VR. Even with such little time I have already started up the rapid proficiency curve. Right now I am building DnD maps for my group and it is going great! I need to figure out how to copy and paste. Maybe with layers? Maybe it doesnt exist yet? Either way I'll figure it out. Love this thing!\n\nHelpful | 0\nDeveloper ResponseDec 3 at 2:13 PM\n\nthe copy/paste tool is one of the tabs on your left hand! its the most complicated tool in SculptrVR, but you can get great results if you master it.", "stevejordan1stDec 13 at 7:26 PM\nLove this!\n\nLove this app just wish there was more tutorial included. I love building with this but feel I could do even more with better techniques. Still this is a very well made sculpting program. Thanks for bringing this to the quest!\n\nHelpful | 2", "DAX_QcAug 30, 2019 at 7:29 AM\nAt this price + export to 3d printer?\n\nPlus multiplayer?? Lol, Its a no brainer.\nI had so much fun in MP. Creating stuff and messing around. If you have a large play space, create a scene zoom in and explore it in real life azaming. NOTE the artistic option is very limited. Its more for fun than real 3d design but some have created really good looking things. If u have kids.. let them try.\n\nHelpful | 95", "Ender772Jan 5 at 9:13 AM\nPhenomenal but terrible menu\n\nThis game is a lot of fun. You suddenly find yourself inspired once you realize what you can do. But it loses 2 stars for the truly awful menu layout. Which is similar to tilt brush but the icons are so small you will be trying to press it 4 to 5 times every single time you choose another option. Which is a lot. I bought this when it first came out and here it is 6 months later and the layout has not changed in the slightest.\n\nHelpful | 2\nDeveloper ResponseJan 7 at 8:28 PM\n\nthis is a very good criticism. Youre wrong that nothing has changed in 6mo, though. the recent update refactored the menu to get rid of the back-of-the-hand menu and make it just another tab on the front of your hand. this doesnt address your issue directly, but it did allow me to increase the size of the color picker menu by ~50%. Im trying :-)", "MoneyMan234Nov 1 at 7:26 PM\nNew must buy\n\nIm so glad I waited to buy tilt brush this is way cheaper and from videos Ive seen looks better Ive only had it for two days but Ive made 4 settings that I actually put effort into a garden, beach and tsunami, sand monster, and house of course there are flaws but I mean the pros outweigh the cons i hope there are more exploration modes in the future and ways to sculpt and build even bigger and better things so honestly If youre on the edge about this game get it, its only 10 bucks\n\nHelpful | 4", "Mortal66Jan 26 at 6:50 PM\nBrings out creativity!\n\nAmazing app!\n\nHelpful | 0", "JohnnyWLNov 25 at 11:46 AM\nWow.\n\nIt seems so simple when you see it. But, when you get into it, it is absolutely incredible. It is so intuitive. Especially just the simple idea of quickly scaling the environment to make you brush smaller or bigger. I was making ridiculousness in no time. I love it. I have no excuses to be bored anymore.\n\nHelpful | 2", "Playguy09Jan 8 at 12:03 PM\nNot an art Tool but it's still fun!\n\nSo not for sculpting real good 3d model. Like animating, rigging and 3d printing exetera!\n\nHelpful | 0", "kalnaellisDec 2 at 2:26 AM\nyou must have this app on Quest!\n\nSupper! Well done! Look forward for continious updates! I could not found possibility to grab and move around single objects? But all the other features that are implemented is just a heaven for creativity is you want to create 3D artwork. \n\nHelpful | 0\nDeveloper ResponseDec 2 at 4:58 PM\n\nYou can move individual objects if you make them on a separate layer and \"unlock\" the layer by clicking off the key icon. Thanks for the kind words! :-)", "ronfar623Oct 26 at 12:51 PM\nAwesomely powerful little sculpting app!\n\nContains all of the tools needed to create organic 3D models quickly and easily, and even some tools for hard surface modeling (though Gravity Sketch is maybe a better choice for that?). However, given the price, and the hilariously fun multiplayer option, this is an amazing app.\n\nMy son and I spent hours the other night sculpting a cat together, and then burrowing into it's nostril to carve a tiny house inside of it's head, because why not? Not sure if the dev(s) read these reviews, but thank you for creating this! It's pretty close to a killer app on the Quest for me, and crossbuy/crossplay with the Rift is icing on the cake.\n\nHelpful | 3\nDeveloper ResponseOct 26 at 7:40 PM\n\n<3", "StaticCloudNov 22 at 10:20 AM\nGreat price\n\nBeing one of the few cheaper games for the quest, this is a must buy. It may take some time to learn how everything works but once you figure it all out, it takes no time to start making some awesome creations. But one thing I will say is that it does have it's limits. While you can make complex creations within the boundary box, if you try and make something TOO detailed it will go all blocky and low poly which can sometimes make it really hard to add small details.\n\nHelpful | 3", "DrunkenMaster2731Dec 28 at 8:53 PM\nWell worrh it\n\nThis app doesnt allow fine detail but it is great to play around in!\n\nHelpful | 2\nDeveloper ResponseDec 28 at 9:58 PM\n\nhmmmmm.. did you notice that you can zoom in by holding both grips? you can zoom by a factory of 10,000, and put micron size details in the world :-)", "JerviNov 12 at 11:54 AM\nGreat app!\n\nEasy to use and quite complete. Only limit is your fantasy.\nOne question: in this Quest version I don't see theme environments where sculpt, such as space that I've seen in other version. You'll insert them in next update? Thx.\n\nUpdate:Reply to devs\nYes devs! I had seen sky settings with day and night. Do you can insert stars in next update? Thx\n\nHelpful | 1\nDeveloper ResponseNov 11 at 10:49 AM\n\nTo change the skybox between day and night, you use the \"Sky Grabber\" tool which is beside the rocket. The nighttime sky on Quest is simpler than on PC and doesn't show any stars.", "P0rthosDec 31 at 9:30 PM\nWonderful\n\nFantastic multiplayer experience\n\nHelpful | 2", "flyboysiAug 30, 2019 at 3:49 PM\nFantastic art/ sculpting app\n\nI have used the pc based version of this app for several years now and I have to say that on the quest it's amazing. This app is awesome for making simple models to detailed ones, to huge massive scale worlds and then go explore them with a variety of means. The quest version is brilliant able to take it places to show creations in it or simply sculpting out doors and not having to be tethered is so cool. And the multiplayer is great being cross platform to pc based version. Cant wait to build some wacky worlds with all you creative types out there.\n\nHelpful | 25", "y1084110202Nov 28 at 7:01 AM\n\nIt has lots of potential.If it have tools that can operate dot,string or face like in those professinal software like maya,3dmax or blender,it will be not only fun but useful.\n\nHelpful | 1", "explosivelimesOct 25 at 11:09 AM\nThis is a fantastic app for creatives!\n\nI absolutely love SculptrVR, and the dev is incredible active and responsive on social media. I spend 99% of my time in VR using Tilt Brush or SculptrVR. It takes a little bit to get used to the level of detail you can work with in this app, but once you've got it the sky is the limit really. Multiplayer is super cool too. Highly recommended.\n\nHelpful | 1", "obi2kenobiOct 25 at 7:23 AM\nPerfect for casual creation\n\nIt is incredible what the more serious folks can do with this app, but I love all the game type elements it incorporates to make this fun even for the casual or less talented artist.\n\nYou can do multiplayer, create a huge scene, then fly and climb all around it, or just blow it up with rockets. If that doesnt sound fun what does?\n\nThe fun elements in addition to the powerful art tools are why I chose this as my \"art app\" over other apps which seemed more pure on their focus.\n\nThey updated to include reference images which will be handy for a novice like me. I am also excited that my creations can be 3d printed.\n\nAll at the price of just $10. No brainer!\n\nHelpful | 0", "loregnumSep 1, 2019 at 8:02 PM\nAwesome\n\nI'm not artistic at all and usually wouldn't bother with apps like this but the dev seems like a good guy and the price was nice so I bought it and wow, it's fun! All I have done so far is create a giant pillar probably 60 or 70 feet high and climbed up it using the nice climbing feature. You could theoretically create a Richie's Plank experience in this app and then walk the plank, complete with the feeling of falling since I walked off my giant pillar and fell in the app. I plan to make another pillar to see how high I can make it and then fall off that.\n\nWhile the hand gliding is pretty cool, I'd LOVE to see the ability to use something like rocket hands similar to what's in Richie's Plank, as well as general thumbstick movement.\n\nI can easily recommend this app to anyone as again, I am not artistic at all yet had fun creating my crude pillar and I imagine most people would have fun messing around in it. That you can move around your creations is what really makes it great and gives so many possibilities and makes it more than just an app to sculpt objects to look at. The fact you can export to 3D print is also very cool.\n\nI look forward to attempting to sculpt a big house and moving around in it and I'll also try my hand at creating a mountain with a big cave and moving around in that. Should be a blast.\n\nHelpful | 13", "troy.gilbert.88Oct 19 at 5:22 AM\nGreat\n\nI've used this a lot now. Kinda an interactive design tool but also a fun game.\nIt took a little while to get used to but what started off as a serious design session quickly turned into a heap of fun.\nI'd highly recommend it for some creativity but also an interesting multiplayer environment.\nI particularly liked that I could shoot rockets and destroy thing but also undo the destruction.\n\nHelpful | 2", "Poly-BlankJan 25 at 9:14 PM\nBoring\n\nI dont know what else to say, its just... Boring\n\nHelpful | 0\nDeveloper ResponseJan 26 at 9:29 AM\n\n:-( did you get a chance to try out multiplayer? i have the best time when hanging out with other people.", "yeat69Dec 5 at 3:18 AM\n\nOculus you guys need to add Medium to the quest\n\nHelpful | 2", "nllovettSep 11, 2019 at 1:41 PM\nPlease add mirroring!\n\nI love this app. The fact that I can model something in VR\nthen export to an OBJ to print with my 3d printer is awesome. One addition I would love to see is mirroring mode for sculpting.\n\n*UPDATE*\nI am an idiot the one feature I wanted was already a thing.\n\nHelpful | 8\nDeveloper ResponseSep 11, 2019 at 12:45 PM\n\nMirror mode exists! It's located in the layers panel.", "Soulsurfer83Sep 3, 2019 at 6:29 PM\nNew worlds for the making\n\nThis is such a simple, yet wide open game. Its amazing to be able to create anything you can dream of and the enjoy it in VR.\nThere isnt much instruction that comes with it, so Id recommend watching some YouTube videos. Once you get the hang of it, its easy to create.\nThe best thing is enjoying it with my children. Each night after my kids go to bed, I go into one of our many worlds and create something new (rainbow, palm trees, rocking climbing wall, their names written huge across the sky, a log cabin, pink monkey bars, etc...)\nThe next day after school, the kids cant wait to finish their homework so they can dive in and see the new creations. One loves to use the glider feature to fly around the world, the other loves to climb. For someone with zero artistic ability, it brings me such joy to be able to create something for them to experience.\n\nHelpful | 20", "stefanosbOct 18 at 11:58 AM\n\nHas so much room for improvement. I miss the ability to be able to select the strength of the current tool (Sculpt, carve, paint transparency amount etc). Being able to attend sculpting events and browse online content and rate it would also be nice. I don't know if it's possible to sculpt quads instead of triangles. Could produce smoother polygons I suppose. Just saying. Otherwise I enjoy the app.\n\nHelpful | 3\nDeveloper ResponseOct 19 at 12:25 PM\n\nIn the layers panel you can switch from a flat polygonal look to smooth with blended normals. Ive been intending to add trigger strength sensitivity to tools for a while now, and I think it will come soon. The online galley pretty basic. adding ratings and search will be a huge help, and i hope to get that working eventually, too.", "johnxeNov 6 at 7:14 PM\nMust-have game for VR\n\nThis game is a blast. Its an amazing sketching/sculpting tool that will have you constantly in awe of the physics and the worlds that you can create.\n\nHelpful | 1", "BillCOct 12 at 2:31 PM\nAmazing.\n\nI love this app. Being partially immobilized at the moment it's great to have a place to go. I can remain seated and still create until my heart's content.\n\nIf you are an amazing artist, someone who just doodles or a vr explorer this is for you.\n\nHelpful | 4", "TheSwirlingBrainDec 6 at 8:45 PM\nI'm enjoying the app\n\nI like the app.\n\nHelpful | 1\nDeveloper ResponseDec 7 at 7:55 AM\n\nGlad you like it :-) thanks for updating your review!", "ShadowpizzacatOct 6 at 1:29 PM\nThis is amazing\n\nI love this game. It takes a bit to figure out all the controls and stuff. That is literally my only problem with the game. I love making a mountain, and climbing up it. You can see everything below you, its incredible. I have a suggestion. Maybe we could customize the glider?\n\nHelpful | 1\nDeveloper ResponseOct 6 at 6:58 PM\n\nwhat kinds of customizations do you mean? please email me at info@sculptrvr.com or join the discord (link on the website). Thanks!", "GustavMaulerSep 24, 2019 at 11:58 AM\nMust buy for Quest\n\nThis is the most fun of the three creative apps on Quest. Great for artists and non-artists too! Sculpt an amazing sculpture and then fire missiles at it!\n\nBuy this right now!\n\n\n\nWould be nice if you could steer the missiles by holding the button and tilting the controller.\n\nHelpful | 6\nDeveloper ResponseSep 30 at 7:45 PM\n\nOh my god I love that idea! I'm going to try it right now! Update: holy shiiiiit", "Crazy_SaneOct 14 at 6:55 AM\nGood creative tool, great value\n\nIntuitive controls, file exporting, fun multiplayer mode and cheap price make this my pick of the available modelling apps on the Quest.\nMy only criticism is about the way shapes interact, even when seperate, and some tools never come out smooth. It can be hard to create fine detail. And I thought it could do with a few more tools. Otherwise, a great app. Defs worth it.\n\nHelpful | 0", "TartanstormAug 30, 2019 at 12:23 AM\nSo many ways to have fun with this app\n\nThis is app is really a joy to use , it makes 3D sculpting a fun activity and brings out the creative and fun side of users. The developer has done genius things with the voxel engine behind it so you feel like you can model Minecraft size worlds on this very efficient engine. Modeling in multiplayer is a hoot, especially as it has a great implementation of multi scale. The new exploring mode makes you want to sculpt more and more so you have things to teleport around, climb and fly through. Jump into a multiplayer session it has to be experienced !\n\nHelpful | 4", "CoyerAug 29, 2019 at 2:59 PM\nOne of the best VR creation apps out.\n\nI had this game on my Google daydream a few years back, and it's even better on the quest. You can create full landscapes seemingly miles wide thanks to the zoom feature, then fly around it in a paraglider. Truly amazing\n\nHelpful | 7", "SkyArcherSep 9, 2019 at 3:50 PM\nTotally worth it\n\nThis app is really enjoyable regardless if you are an art person or not. Tools are super easy and intuitive, they work quickly and predictably. Sculpts can get really huge without hiccups, since the app will dinamically render details or hide them when needed. Online mode with chat is a blast with random people and works as seamlessy as single player.\n\nThere are some sporadic issues with online play (the game rebooted and I couldnt rejoin a previous room) but still, this works really well most of the time. Absolutely worth trying.\n\nHelpful | 2", "NotUrProfileSep 13, 2019 at 5:24 PM\noverall 10/10\n\nthis game has multiplayer that has voice chat (which can be turned on and off). you can zoom in to 0.10 and out to 166.6. my favorite part is the gliders and climbing. the fact that theres a teleport feature makes it easier to fast travel when your zoomed in.\nlove this game. i would recommend it.\n\nHelpful | 2", "FatLeaderSep 1, 2019 at 1:51 PM\nBest game on quest?!\n\nBest climbing and multiplayer experience at the moment!\nBuild your own worlds or destroy a procedual one with a friend or two.\nMake up games as you build. We did a climbing course and then blew up a couple of holes through the mountains and flew through them as a paragliding competition.\nEndless ideas and limitless possibilities!\n\nHelpful | 2", "etagimbel_gerSep 10, 2019 at 1:28 AM\nfun and surreal\n\nFun-oriented artistic app. Its like playing in a sandbox as a kid. While some people come up with some very impressive stuff, its not really meant and suited for serious 3D modelling. Everything created has its special clumsy look because its practically impossible to work precisely. Its strength, working at extremely different scales, is also its weakness, because it is very hard to keep the mesh at a consistent scale. I wished there was a tool to equalize the density of the mesh (I dont know the proper terminology). The bulge/deflate brush can be misused cumbersomely for this purpose, though. Unfortunately, the smoothing brush does not change the mesh density. Online play is probably the most surreal experience you can have with the Quest at the moment.\n\nHelpful | 3", "PurplemikeyAug 29, 2019 at 10:05 AM\nAmazing app for artist-hobbyist-family\n\nI am a sculptVR user since the oculus Go one year ago. Me and my son love to jump in VR together and create arts, role play in our newly created scenario and hide and seek. It is a super great app for multiplayer fun or even more serious creations.\nFor solo work it is also a very unique app. You have enough to create really good looking art wether it is for fun or to showcase.\n\nAt this price - you can't go wrong. Grab it and let the fun begin!\n\nHelpful | 8", "JakJakkuSep 7, 2019 at 6:30 AM\nMust have for 3D printing\n\nThis is the app I was waiting for. Incredibly easy to start sculpting and export for 3D printing.\nThe selection of tools is nice, but I wish there was a way to change the tool size without changing zoom levels.\nExport to .obj for 3D printing works, but for some reason I need to convert the exported file before Prusa Slicer will import it.\n\nHelpful | 3", "jtranAug 29, 2019 at 1:18 PM\nAwesome VR 3D modeling app\n\nTons of options for 3D modeling and locomotion so you move around in your sculptures. Also includes online multiplayer for Co-op modeling!\n\nHelpful | 8", "glitchenSep 16, 2019 at 9:19 PM\nFantastic app but some issues.\n\nAmazing for newbies and creatives. I like the scalability but the rendering is a bit glitchy when zooming in/out. On Quest, the lobby seizes up when a new player joins in multi and will freeze or lag until the world renders on their end. I like joining other people when they're available. The community is still very small and sometimes nobody is on. It's fun to show people with some VR experience this app and mess around with it in my spare time.\n\nHelpful | 4", "MeowformebabySep 2, 2019 at 8:03 AM\nVery different than tilt brush. GET BOTH\n\nAbsolutely amazing.\nI only purchased because I just got a 3D printer and thought it might be handy having a VR app around where you can export the 3D models to the printer.\nI already had tilt brush so I wasnt really expecting anything much different, content/gameplay wise. But wow, I was wrong.\n\nSculptVR actually held me for a lot longer than tilt brush did.\nI believe they both have earned their place in my limited 64gb library.\nTilt brush definitely seems more paint inspired, where as sculpt is well, like the title says, sculpting.\nAs someone who isnt into painting or sculpting, I thought theyd be quite similar, but quite the opposite.\n\nI love all the different tools and shapes. I love how intuitive the UI is. I love being able to adjust the sunlight.\nI was impressed with myself for being able to sculpt a castle that actually kinda looked like a castle, in my first attempt. And even more besotted when I managed to give my originally dusty grey and gloomy castle a fresh white coat of paint, which inspired me to turn it into a castle birthday cake instead.\nThe way the brushes work really added a layer of realism I wasnt expecting.\nI do wish we could have a reference photo on the screen, as oculus doesnt allow you to open the browser without closing the app.\n\nItd also be great if we could access a gallery of other players artwork.\nBut even how it is right now, its a 5 star app.\nThose things would be an added bonus.\nThe price is an absolute steal.\n\nHelpful | 3\nDeveloper ResponseSep 11, 2019 at 1:08 PM\n\nI'm glad you're enjoying SculptrVR! The first update adds av reference image system so you can add images to your Quest in a specific folder and view them in game. Also, there is an online gallery! in the loading screen, there are three options: local, demo, and online. online is stuff uploaded by users using the Save Online button in the save menu. enjoy :-) -Nathan", "OrdinaryWorldAug 29, 2019 at 7:17 PM\nGreat fun at a great price.\n\nI have no need for this title and had it been $20 I wouldn't have considered it. However, at $10 it was hard to resist and I'm so glad I bought in on this. I've only played with it briefly (search virtual alien girlfriend on YouTube) but was impressed by the simple yet powerful software. I didn't have time to explore all of the features and now my daughter has discovered the app, it could be a while before I get another chance. Great value and unlike some other lower priced Quest titles, this is of high quality.\n\nHelpful | 5", "Landman99Sep 1, 2019 at 7:19 PM\nThis game is a must have!\n\nI bought tilt brush a while ago, and thats a fun game, but it didnt give me what I wanted. It was more flat lines than 3D sculpting. SculptrVR is amazing. You create in 3D, you can zoom in A TON and get loads of detail, you can export to a 3D printer(need to try that at the library), and multiplayer! All for $10? It was at the top of my list since before it came out.\n\nHelpful | 3", "M2theT2theBOct 2 at 3:24 AM\nMy current addiction\n\nWhy is it my current addiction? Because I just found out I'm a pretty good sculptor. Easy to learn the tools. Once you do your imagination won't run out of ideas.\n\nHelpful | 1", "NicoredaFRNov 5 at 12:10 AM\nThat gud dope\n\nYes\n\nHelpful | 0", "RobbyMarioOct 27 at 4:43 PM\nGood\n\nIt has no tutorial but still great\n\nHelpful | 0", "Pierre_FRAug 30, 2019 at 5:52 AM\nA great surprise!\n\nI'm used to use Medium on Rift and was waiting for a software for the Quest. What a great surprise, now I can sculpt everywhere and export easily with this software. I'll try multiplayer next time :)\n\nHelpful | 3", "JonnyCleanSep 8, 2019 at 7:15 PM\nThis was my quickest app purchase so far\n\nAnd for the most part its quite good. It offers some tools that Tilt Brush is missing (smoothing,additive/subtractive sculpting) and it improves on the zoom/scale which is really nice. The only real gripe I have is that objects can easily loose clarity in unexpected ways. As an artist, once I have lines in place and looking just the way I want, I expect them to stay just where I put them. Instead, I found that painted surfaces lost quality as I moved around the piece and worked on other elements. So, while I love some of the tools, like the smoothing brush, I cant imagine putting a lot of time into any serious, detailed piece knowing that parts might get arbitrarily blurred away or removed as I continue to work. That said, for casual sketching and painting (which is really the focus here), its a lot of fun, and I look forward to trying multi-player.\n\nIf paint strokes could be preserved just as they are painted and a method for quickly selecting and duplicating strokes could be added, (the stamp tool is awkward and copies do not have the original resolution) This would be 5 star for sure.\n\nHelpful | 4\nDeveloper ResponseSep 11, 2019 at 12:49 PM\n\nthank you so much for the feedback. I've thought about ways to make a \"detail adjustment brush\" for a while, but it's a tough one. The Level of Detail system hides details that aren't near the player in order to maintain framerate. Oculus allowed me to add a \"screenshot mode\" (in settings) that increases visible detail as the cost of framerate. I hope that helps! -Nathan", "ThatguychrisOct 9 at 9:22 PM\nAbsolutely love it.\n\nI'm using it to make models for a game and collaborate with friends. Good way to visually draw ideas.\n\nHelpful | 1", "andrew_vrSep 1, 2019 at 8:31 AM\nEasy to jump in\n\nThis feels much easier to get started with than gravity sketch or tilt brush and having subtractive tools as well as additive just makes it so much better. Excellent fun even for an artistic dunce like me. If nothing else you can just build big walls and blow them up with rockets!\n\nHelpful | 2", "TimeScoutOct 9 at 5:07 PM\nLove to see creative games in VR\n\nMade even better with multiplayer. Would love to see support for a larger play area!\n\nHelpful | 1", "SpookySpiritsSep 1, 2019 at 7:53 AM\nThis is what VR was made for.\n\nToday, at 40 years old, I sat down on the floor and sculpted my childhood bedroom I haven't seen in decades to the scale I remember it. It's incredibly intuitive. No tutorial required. Great job devs, this one's a keeper.\n\nHelpful | 13", "immortalmonkeyySep 28, 2019 at 5:47 AM\nThe best\n\nThis is great and cheap I would recommend this to any one who wants to make thing not draw things\n\nHelpful | 2", "DatLoganSep 20, 2019 at 8:55 AM\nLove the game 10/10 if\n\nIf someone could tell me how to join and invite people for multiplayer please send me a friend request and talk in a party or in a message\n\nHelpful | 1", "lernlinkSep 18, 2019 at 9:25 AM\nLove it, but can not start multiplayer\n\nSo much fun alone, but I want to share, I started on oculus go, now we have a oculus quest, but they seem to live in parallel Universes and can not reach each other.\nIs it possible to connect?\nOr just share models?\n\nHelpful | 1\nDeveloper ResponseSep 20, 2019 at 9:02 AM\n\nThe two platforms can play together! But unfortunately not from the same Oculus account. I'm using Oculus sessions for multiplayer, and Oculus automatically prevents two people with the same account from joining the same sessions. I wish I could disable that :-(", "VRFrontierSep 2, 2019 at 12:42 PM\nMakes it all easy\n\nAt first I was a bit confused then literally 10min into the game I made my own farm with all the tiny details. It's great, $10 is so low for the quality of this game. Good luck with your own creativity!\n\nHelpful | 2", "NitoFPVSep 17, 2019 at 5:49 AM\nLove this!!\n\nGood for the plane, good for bed, good for anywhere!! I wish they could add the ability to do pot sculpting and shaping.\n\nHelpful | 1", "fathomableSep 1, 2019 at 4:42 PM\nImpressive feat.\n\nTechnically astounding, very performant and fun social collaborative creation app, perhaps the best social Quest app so far even.\n\nHelpful | 2", "KingFukiOct 6 at 9:02 AM\nNo reference geometry import option ?!\n\nNot interested in gamification and multyplayer mode of this app.It has the potential to be a professional productivity tool but it lack a few key features .Also user interface looks very unprofessional.\n\nHelpful | 0\nDeveloper ResponseOct 6 at 10:29 AM\n\nWell if you don't care for gamification, you're unlikely to get much out of these next updates :-) 3D reference import is becoming a more common request, but it's not something I'm likely to take on any time soon. I hope you enjoy the rest of the tool, though!", "EvillienAug 31, 2019 at 10:53 AM\nI was surprised!\n\nFor ten bucks this is a no brainier. The multiplayer is fun :) I only miss a tutorial or something but ofcourse you can find some stuff on YouTube.\n\nHelpful | 4", "samsonite312Aug 31, 2019 at 11:02 PM\nMind blown!\n\nThis is one of the most amazing VR experiences I've had. Being able to zoom into sculptures on such a detailed level is mind blowing. Huge value for $10!\n\nHelpful | 2", "abydosanSep 6, 2019 at 11:41 AM\nA must have Voxel editor for Quest\n\nThis app is absolute amazing\n\nHungarian review: https://www.vrhir.hu/bemutatok_tesztek/sculptrvr-oculus-quest-bemutato/\n\nHelpful | 1", "arif1022Sep 7, 2019 at 9:39 AM\nSo much fun. Much more than I expected\n\nYou dont have to be artistic to love this game. Im not at all, but it makes me feel very creative\n\nHelpful | 2", "teylerSep 5, 2019 at 7:01 PM\nReference image support!!! Only app:)\n\nYes it has reference image support and private multiplayer mode! This developer is world class! Godsend!\n\nHelpful | 2", "ruxpe123Aug 29, 2019 at 7:56 PM\nAmazing creative playground\n\nLots of fun, can create so many different things, looking forward to the private lobbies so only friends can join.\n\nHelpful | 3", "DungeonquestAug 31, 2019 at 3:38 PM\nYes...\n\n... an ad a jump&run and Mario Kart Mode, please.\n\nHelpful | 5", "21_activealAug 30, 2019 at 8:46 AM\nNot loading\n\nMy internet has NEVER failed me when it comes to my VR, but when I try to login this game, it never EVER lets me go on. I've tried going on my VR with a hotspot but that doesn't work either. And just to clarify, this only happens with this specific game. All my other games let me login perfectly fine. Is it something I'm doing? I haven't been able to go on the game and I downloaded it yesterday.\n\nHelpful | 4\nDeveloper ResponseAug 30, 2019 at 9:29 PM\n\nThis was caused by some sort of temporary bug with the Oculus servers. Reboot your headset and give it another shot. Unfortunately I have no control over this issue, but it seems like it's fixed for most people now.", "LuisfromschoolAug 30, 2019 at 3:38 PM\nGood game\n\nNow were back baby \n\nHelpful | 3", "steveob83Sep 11, 2019 at 10:57 AM\nVery hard to figure out\n\nA tutorial would be a nice feature\n\nHelpful | 4\nDeveloper ResponseSep 11, 2019 at 12:44 PM\n\nThanks for updating the review. I've tried to resist adding a tutorial because it would prevent me from making major changes moving forward. Here's a fantastic tutorial video made by an active user: https://youtu.be/Q0dHB_l66Ao", "cjesqipSep 12, 2019 at 8:44 PM\nmarry this with Tiltbrush\n\nplease\n\nHelpful | 2", "Bradls27Aug 29, 2019 at 10:51 AM\nGreat App, Great Developer Amazing Price\n\nReally great program with some exceptionally designed tools. The Developer is responsive and deserves all of our support for bringing this to us at such a fair price. I look forward to creating some unique items. Thanks again for bringing this to the Quest.\n\nHelpful | 9", "HooverFlyAug 30, 2019 at 12:31 PM\nGreat fun in multiplayer\n\nOnly 4 stars as there's more to come I imagine.\n\nHelpful | 1", "dingoflingSep 1, 2019 at 10:04 AM\nGreat Way To Speed Up Time\n\nWhen you're having fun time flies, when you're in a VR world focused on creativity and tools/accessibility time goes 5x Faster. Great for when I need to Speed up time 5x. And making 3D printed masks for My kindergarten students. Also great tool to play while in a car in the backseat , as it adds to the level of fear making it a horror game in some regards. One time I was car playing and accidentally broke my friends nose who was driving on a road trip to LA and we crashed head on with a motorcycle but everyone was okay. We gave the guy a free quest (we had a few with us) and all was well, he had bad head injury and he seemed sort of comatose but its fine, he rode off slowly into the sunset in VR on the i-95. I hope he made it. If he did it was 5x the speed for him, so cool for real. 10 out of 10. 5 out of 56000kjp\n\nHelpful | 6"]