{"App Title": "Shadow Point", "App description": "Built for VR, Shadow Point is a story-driven puzzle game set between a mountaintop observatory and an ever-changing fantasy world. Explore a vibrant kingdom, cast shadows and solve mind-bending puzzles as you uncover the mystery of missing schoolgirl, Lorna McCabe who vanished from Shadow Point Observatory twelve years ago.\n\nYou are Alex Burkett. Guided by the journal of Edgar Mansfield  narrated by Sir Patrick Stewart  you will ascend via cable car to the abandoned summit and discover a portal to another realm.\n\nAs your adventure unfolds, you will manipulate gravity, play with your own reflection, walk on walls, peer through a magical lens to reveal an alternate reality and much more.\n\nFeatures:\nOver 80 mind-bending puzzles\nFull freedom of movement and hand tracking\nA powerful and compelling story\nFull voice cast featuring Sir Patrick Stewart (English)\nVoice over support for French, German, Spanish, Japanese and Korean\n\nThis game is cross-buy on Oculus Quest and the Rift Platform", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Exploration, Narrative, Puzzle", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Argentina), Spanish (Chile), Spanish (Colombia), Spanish (Mexico), Spanish (Peru), Spanish (Puerto Rico)", "Version": "1.1", "Developer": "Coatsink Software", "Publisher": "Oculus Studios", "Website": "https://shadowpointgame.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "Skip to content\nOpen toolbar\n\nAccessibility Tools\n\nIncrease Text\nDecrease Text\nGrayscale\nHigh Contrast\nNegative Contrast\nLight Background\nLinks Underline\nReadable Font\n Reset\n \nABOUT\n \nGAMES\n \nCAREERS\n \nPARTNER\n \nBLOG\n \nCONTACT\nPRIVACY POLICY\nME LIKE COOKIES\n\nTo complete a GDPR Data Request, please click here\n\nPRIVACY POLICY NOTICE\nIntroduction\n\nThis notice sets out the basis on which any personal data we collect from you, or that you provide to us, will be processed by us. Please read the following carefully to understand our views and practices regarding your sensitive information and how we will deal with it. For the purposes of the Data Protection Act (the DPA) and the EU General Data Protection Regulation (the GDPR), sensitive information includes what is defined as your personal data.\n\nBy visitinghttps://coatsink.com(the Website) you accept and consent to the practices described in this Privacy Notice including the processing of your personal data under this lawful basis.\n\nIn this Privacy Notice, we seek to abide by the letter and spirit of the guidelines laid out by the UK Information Commissioners Office in the document Privacy Notices, Transparency and Control.\n\nWho We Are\nWhat we do with your information\nInformation we collect from you\nInformation we collect about you\nWhere we hold and what we do with your information\nInteraction with Social Networks of Platforms\nWhat we do to ensure the security of your personal information\nYour rights regarding your personal information\nYour Rights\nHow long we hold your information for\nChanges to this Privacy Notice\nOUR COOKIE POLICY\nIntroduction\n\nIf youd like to manage your use of cookies or completely turn off cookies then you can find out how to do so by using the linkhere. Please note that if you do limit or block cookie use on our Website the functionality of both the Website and our services will be affected.\n\nOur Website uses cookies to distinguish you from other users of our Website. This helps us to provide you with a good experience when you browse our Website and also allows us to improve our site. By continuing to browse the Website, you agree and consent to our use of cookies.\n\nA cookie is a small file of letters and numbers that we store on your browser or the hard drive of your computer if you agree. Cookies contain information that is transferred to your computers hard drive.\n\nAs part of our overall approach to privacy and transparency, this section describes what cookies are in the context of our web and mobile interfaces, and what their use means to you. At the end, weve included some links to help you research cookies and their impact, and how you can use your web browser to control the way it manages cookies.\n\nWe use the following types of cookies\nCookie purposes\nMore information about cookies\nIf there is a problem\nSUBSCRIBE TO RECEIVE A DRM-FREE COPY OF CHIP\n\nPlus, get access to exclusive news and sneak peeks of games from us and our trusted partners.\n\nData stored as outlined in our Privacy Policy.\n\n I have read and agree to the terms & conditions\n\nABOUT GAMES CAREERS PARTNER BLOG CONTACT\n\n 2011 - 2020 COATSINK SOFTWARE LTD. ALL RIGHTS RESERVED.\nAll trademarks referenced herein are the properties of their respective owners.\n\nLEGAL PRIVACY POLICY\nThis website uses cookies (not the tasty ones - sorry) to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish Read More\nRejectI'm cool with this!\nMore Information\nPrivacy Overview\nThis website uses cookies to improve your experience while you use the website. Out of these cookies, the ones that are classed as necessary are stored on your browser as they are required for the basic functionalities of the website to work. We also...\nNecessary\nAlways Enabled\nNon-Necessary", "Developer Terms of Service": "Skip to content\nOpen toolbar\n\nAccessibility Tools\n\nIncrease Text\nDecrease Text\nGrayscale\nHigh Contrast\nNegative Contrast\nLight Background\nLinks Underline\nReadable Font\n Reset\n \nABOUT\n \nGAMES\n \nCAREERS\n \nPARTNER\n \nBLOG\n \nCONTACT\nTHE LEGAL BITS\nOUR TERMS AND CONDITIONS\n\nCongratulations! You found our secret page of legalese. Think of it like some stern, corporate easter egg. If you have questions about any of these Terms and Conditions, feel free to contact us.\n\nOCULUS GAMES END USER LICENSE AGREEMENT\n\n// BEGIN OCULUS EULA\n\nCoatsink games available on the Oculus store (referred to as GAMES hereafter) are licensed to you free of charge for use with the Oculus hardware or Samsung Gear VR hardware and for no other purpose.\n\nAll intellectual property rights in our GAMES belong to Coatsink Software Limited (or our licensors) and the rights in the GAMES are licensed (not sold) to you. You have no intellectual property rights in, or to the GAMES other than the right to use it in accordance with these terms.\n\nThe ways in which you can use our GAMES may also be controlled by theOculus Stores rules and policies.\n\nOur GAMES require Oculus hardware or Samsung Gear VR.\n\nYou may not resell or redistribute our GAMES, nor may you disassemble or reverse engineer our GAMES save as expressly provided by law. You may not use GAMES for commercial purposes save with the written permission of Coatsink Software Limited prior to any such use.\n\nWe may need to change these terms to reflect changes in law or best practice or to deal with additional features which we introduce. We will give you at least 14 days notice of any change notifying you of any change when you next start our GAMES. If you do not accept the notified changes you may continue to use our GAMES in accordance with the existing terms but certain new features may not be available to you.\n\nWe provide games as is and any express or implied warranties, including, but not limited to, the implied warranties of satisfactory quality and fitness for purpose are hereby excluded. in no event shall Coatsink software limited be liable for any direct, indirect, incidental, special, exemplary or consequential damages (including, but not limited to, procurement of substitute goods and/or services; loss of use, data or profits; or business interruption) however caused and on any theory of liability, whether in contract, strict liability or tort (including negligence) arising in any way out of the use of the games, even if you have advised Coatsink Software Limited of the possibility of such damage arising from your use of the games.\n\nIn particular, Coatsink Software Limited does not warrant that the use of the games will be error-free and without interruption.\n\nCoatsink Software Limited is a company incorporated in England & Wales (registered number: 07567431) whose registered office is at Sunderland Software Centre, Tavistock Place, Sunderland, Tyne & Wear, SR1 1PB.\n\nLast Updated September 2019\n\n// END OCULUS EULA\n\nBACK TO HOMEPAGE\nSUBSCRIBE TO RECEIVE A DRM-FREE COPY OF CHIP\n\nPlus, get access to exclusive news and sneak peeks of games from us and our trusted partners.\n\nData stored as outlined in our Privacy Policy.\n\n I have read and agree to the terms & conditions\n\nABOUT GAMES CAREERS PARTNER BLOG CONTACT\n\n 2011 - 2020 COATSINK SOFTWARE LTD. ALL RIGHTS RESERVED.\nAll trademarks referenced herein are the properties of their respective owners.\n\nLEGAL PRIVACY POLICY\nThis website uses cookies (not the tasty ones - sorry) to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish Read More\nRejectI'm cool with this!\nMore Information\nPrivacy Overview\nThis website uses cookies to improve your experience while you use the website. Out of these cookies, the ones that are classed as necessary are stored on your browser as they are required for the basic functionalities of the website to work. We also...\nNecessary\nAlways Enabled\nNon-Necessary", "Space Required": "2.16 GB"}



["5 stars\n75%\n4 stars\n14%\n3 stars\n6%\n2 stars\n3%\n1 star\n2%", "bflyrnJun 15 at 11:52 AM\nYou would not believe how good this is.\n\nIts puzzles layered on mindbending puzzles. I would say 8 hours or more of playtime here. It's just a ton of fun. There is a story in this game but it really takes a backseat to the excellent puzzles. I've bought more than a dozen titles for quest and this one is probably only second to beat saber. Dont be suspicious of the high rating. The game really is that good.\n\nHelpful | 60\nDeveloper ResponseJun 18 at 6:36 AM\n\nThanks for the stellar review, bflyrn!", "DreaMonger6 days ago\nGets Better as you Play!\n\nI started off with high expectations, and the game did not disappoint. The puzzles started off easy and ramped up from there, and by the end, I was doing some awesome and mind-blowing stuff. The only negatives I can think of are that sometimes the sound effects drowned out the voice-over, and after about 30 minutes of playing, I would get a headache, but thats just normal for me and VR games. It has a good 8-10 hours of gameplay, which is a lot for a VR game. The end of the game had me floored and wanting more! Such a great puzzle/narrative game!\n\nHelpful | 1", "corryrJun 20 at 11:05 AM\nVery relaxing and enjoyable puzzle game\n\nGreat story. Feels a bit like Myst. Loved that game. Patrick Stewart narrates. Almost finished.\nHowever it gets a bit buggy when your accidentally 'in' something. Most of the time, every with the arrow, you can't get out. But you can 'left oculus button' back to the observatory then go back in and find your place.\n\nHelpful | 23", "Reaper3O7 days ago\nFun immersive puzzler & compelling story\n\nMy first immersive story driven experience was \"A Fisherman's Tale\" which I enjoyed but felt was too short (still challenging though). \" Shadow Point\" was recommended through the Oculus store because I played the prior game.\n\nIntrigued, I watched the trailer and thought I'd give it a chance. I am so glad I did and would further recommend to others with the same interest.\n\nThe difference between the two games is that \"Shadow Point\" felt more like an eexpansive experience as you are able to explore more and think more deeply about how and when to use th he objects you find as an escape room type experience. Without taking too deep a dive, as I dont want to spoil the experience whatsoever, you enter a world with little knowledge of who uou are, the \"reality\" you've entered or the characters you happen upon throughout the game.\n\nThe story evolves from that unknown beginning and after further interactions you start to anticipate/welcome the advancement of the game.\n\nThe controls were rather simple to master with little struggle. Just had to practice movement and button presses to understand it. Overall I didn't any issue other than getting used to being in that vr world. Switching movement to teleport made it easier (great gor those that have motion sickness).\n\nLength of time for the game will take as long as you wish. I took my time to explore everything (and my own personal time permitted). There's the main story which I suppose could be beaten anywhere from 8 - 10 hrs if I didnt slow down to look/enjoy. Main levels also offer an additional part to complete, but not necessary to complete the game. Then there are bonus levels that extend the experience slightly and offer an achievement im interested in. I have two bonus levels remaining to see an additional ending. Not sure if there are multiple endings but will see soon.\n\nIf you enjoy ghe type of game I've described above, llease don't overlook this gem. You won't be disappointed!\n\nHelpful | 0", "AnnaLeighBananaJul 10 at 10:31 AM\nThis Story is BEAUTIFUL!!\n\nA lot of people talk about the puzzles in the game, and they are fantastic kind of broke my brain a few times! But what this game really does well is the story!! Oh my goodness, by the end your heart is breaking and your desperately want to make things right!! I dont want to spoil, but after looking at the pictures and reading the description and reviews I was skeptical about how good the story would be. So many games focus on the puzzles and the playing aspects and neglect story almost entirely, but I loved how every puzzle in this was story driven, especially towards the end!! They start off easy but as you go they get more interesting and in each new setting the different puzzle help emphasize the characters, your character included!! Some of the story-driven VR games Ive played tend to have the climaxes fall flat, this one does as well a little bit, I didnt feel the impact however the epilogue immediately after it is perfect for the story and ties it all together in a very satisfying end!! Theres also a few super neat twists towards the end which make me definitely want to replay it!! Its a longer game, which is awesome, and I would recommend it to anyone whether its your first game in VR or you 100th game!! Love love love it!!!\n\nHelpful | 6", "Doomday_Lenny10 days ago\nMindbending story telling at its best\n\nMost Oculus games only take me a few hours to play through but this one took me a few days. Loved the puzzles and the story was great! Puzzles are not too difficult but I did have to look up a walkthrough once or twice to get past some of them. Completed 100% of this game and loved every minute of it and will most likely pick it up again in a few months to see if I can remember how to solve of the puzzles and try a speed run at it.\n\nHelpful | 1", "hyperbunny10 days ago\nIncredible puzzles and very fun\n\nPatrick Stewart narrating? Win\nChallenging puzzles? Win\nLong game? Win\n\nThis is really a fun one. The puzzles are just . So many times I was just yelling in my living room going noooo, NOOOOOO cuz I was surprised by how some of the levels worked. Like I was amazed and taken aback, in a good way! If you love puzzles, like fisherman's tale, you'll love. This.\n\nHelpful | 1", "jbowmas11 days ago\nWow\n\ni've played a good number of puzzle games on multiple platforms and have never really cared about the story. truth be told i'm not sure the developers did either. this game is different. you are solving the puzzles because you really want to help the characters. i'm not one to write reviews, in fact this is the first game i've ever written one for. because it deserves one.\n\nHelpful | 0", "poshporcupine4 days ago\nExcellent game\n\nThis is a great game and well worth the purchase, I got a lot more gameplay than expected, and it does a great job of telling a story as well as having challenging but solvable puzzles. Patrick Stewart narrating is a nice perk as well.\n\nThere were a couple of problems. Far too many times I teleported and landed slightly outside the game world, which goes black and gives you an arrow to go back. The arrow never leads you to the right spot, and more often than not you have to quit the level and then rejoin the level. This is connected to the other problem, if you stick your head over a ledge more often than not you face the black screen, although without teleportation involved you can easily pull your head back and get back to the game. The problem is there are many tantalizing spots that beg you to look over ledges and going black takes you out of the game world.\n\nIt's a great game even with these flaws, I would highly recommend it.\n\nHelpful | 0", "TSMAC13 days ago\nLevel 10\n\nI finished the game and it was a fantastic experience.\nI need more games like this.\nI read a lot of Comments that people can't find level 10 that there was no level 10 because of some kind of a glitch or something like that.\nWell I found it,I finished with 100%.\nKeep looking its there.\nThanks for a great game.\n\nHelpful | 1", "IvyAndPearls13 days ago\nLOVED it....\n\nI'm new to VR, but not new to gaming. My son got a Quest, and I was asking to play with it so much that I decided to stop being a nuisance and buy my own. I LIVE for puzzle games, and this one DELIVERED. Not only is it a good story, but the puzzles are challenging enough to have kept me engaged for literally days. The length of the game is excellent compared to some of the other games I've purchased, and the story comes to a somewhat unexpected (at least for me), but very satisfying end. There's unlock-able bonus content which is ALWAYS a plus, and that content is very good as well. The graphics are, \"nicely done\" (that doesn't sound right; but I'm old, so I don't know the proper gaming language to use...bear with me, LOL) and the \"worlds\" all gave me enough of a sense of other-ness that I felt like I was on a great adventure! Very stimulating. My only issue was that I felt a tiny bit of motion sickness at times. I played sitting in an office chair so I could turn freely, but for \"walking\" through various areas I used the controller. I found that the motion sickness can be minimized or even eliminated by using the teleportation feature of the game; so don't let that be a deterrent, I'm just being honest about my experience. If you like to explore, and you like mind-bendy puzzles, BUY......THIS.....GAME. You'll not be disappointed, I promise. I'm going to start the game over from the beginning this weekend, I'm not even kidding.\n\nHelpful | 0", "WreckFromTech17 days ago\nBeautiful Game, Great Puzzles\n\nThis is a beautiful puzzle game stitched together with a dream-like missing person narrative. Every level has stars (required to proceed), and moons (optional challenges) which are a blast to solve, with some designed to only really be played in VR. The music is fitting and never repetitive, and the game offers a host of motion controls based on your motion sickness preferences. I look forward to seeing what the developers are cooking up for us next!\n\nHelpful | 0", "TheBellaRush10 days ago\nBuggy but brilliant and really fun!\n\nWonderful story! Not unlike Doctor Whos The Girl in The Fireplace. Patrick Stewart brings gravitas to the narration that really resonates. The puzzles are phenomenal and at times impossibly confusing-until you resolve to solve them out of sheer spite. However, as many other reviewers mentioned, the bugs are relentless and cumbersome. You are constantly met with the erroneous Return to Play Space grey screen of death which makes you have to reroute the level to the beginning. There are glitches that freeze you in many of the wells and portal spaces. I played on party with friends getting the same issues and we hadnt run into this repetitive problem in any other games. That being said, the game is fun, interesting and enjoyable-so it makes the glitches worth it! Really a wonderful game!\n\nHelpful | 0", "candr21 days ago\nVery good\n\nI have enjoyed several puzzle games but this one is my favorite so far. The others maybe had better graphics but this one had a lot more puzzles. They were challenging (for me anyway) but not so difficult that I had to cheat. I occasionally got stuck in the portals but just backed out and went through again.\n\nHelpful | 1", "skittle02111 days ago\nLove it - great story\n\nBought this game for my wife and she loves it. It reminds her of Rime - a similar game for Switch and PS4. Shes always talking about the story and cant get enough of it. Highly recommended for fans of a casual, story driven game\n\nHelpful | 0", "zipsync16 days ago\nEngaging but some frustrating issues\n\nThe puzzles were really engaging, the background music fits very well to the theme.\n\nThe story and the puzzles don't connect to each other but it does not detract from the game. The story seem to be a backdrop for the puzzles.\n\n3/4ths of the way, I started having return to play area issues when teleporting to spaces that the Dev didn't intend the user to be. I think they should've prevented teleportation to the area if it is out of bounds or at least love the user to a space within the boundary. Imagine the frustration of having to repeat a puzzle over and over because you are in the middle of solving and unfortunately, teleported somewhere weird. The game puts you out of bounds and you have no recourse except to go out of the game and restart the puzzle.\n\nThe other issue is sometimes when picking up items, they won't let you get to the edge of where the item hang, the item becomes out of bounds.\n\nHowever, all in all I'd still recommend the game. Hoping the devs fix the issues of return to play area. Looking forward to other games created.\n\nHelpful | 0", "TheDialingRookJun 16 at 3:45 PM\nWOW!!!\n\nGoing into this I thought that it would just be a puzzle game. But this game is more than a couple puzzles, the story is soooooo good!! You really get attached to the characters, I felt like I WAS Alex. There were even little details I missed on my first play through!! My experience with my first run through was amazing, the puzzles were challenging and I figured out the whole story near the end, which is why I recommend putting on subtitles at the beginning, to fully understand the storyline as the game progresses.\n\nHelpful | 9\nDeveloper ResponseJun 18 at 6:34 AM\n\nThanks for the excellent review, TheDialingRook :)", "SquadalooJun 28 at 6:57 PM\nExcellent Puzzles, Great Story\n\nI bought this on sale and having now beaten the main story and cleaning up some optional side content, I'm surprised I haven't heard more about it. It's an excellent puzzle game that takes a simple concept and constantly expands on it in brilliant ways.\n\nThe puzzles are a good mix of Portal's spacial mind bending and the Witness's perspective challenges. It also has a great story that doesn't overstay its welcome and is surprisingly engaging.\n\nIt's also meatier than most Quest games. I wouldn't call it long: I think I cleared the main story in roughly 5 hours but I've still got a bit more side content left.\n\nI did run into several minor glitches along the way but overall I'd say this is the best game I've played on Quest yet.\n\nHelpful | 4\nDeveloper ResponseJun 29 at 2:49 AM\n\nThank you so much for the review Squadaloo!", "Z_Girl333Jun 3 at 8:13 PM\nPlease Read\n\nBuy this game. If not for the compelling storyline or the beautiful scenery, buy it for the puzzles. Buy it for the amazing detail the developers put into it. Experience how real it all feels. Great for kids and adults alike. This game offers unique puzzles that are different from any other game Ive ever played (and Ive played a lot of games). I was practically moved to tears at the end scenes. I would recommend this game to anyone with a VR.\n\nHelpful | 9\nDeveloper ResponseJun 18 at 6:41 AM\n\nHi Z_Girl333, thank you so much for the review!", "AlphaWolfJamin101608Jun 8 at 5:39 PM\n5/5, Amazing and heartwarming\n\nThe game mechanics are awesome and the story line is great, I have one thing to complain about which is the fact that there isnt much to theorize about. The story is really straight forward and the puzzles arent too hard but thats just me over thinking a lot about it, other than that the game is amazing the story might make you cry and all the levels showed by tiles have hidden levels that can be unlocked. The creators really thought of everything and made sure that a lot of people will love this fantastic game, I would love to play a sequel or even just another game. P.S. Its really hard to talk about the hidden levels without spoiling them because figuring out how to find the hidden levels is really fun and I didnt figure it out until after the second or third level.\n\nHelpful | 6\nDeveloper ResponseJun 18 at 6:40 AM\n\nHi AlphaWolfJamin101608, the secret levels are a bit more challenging than the main ones. Happy to hear you liked those!", "ZackydooJul 27 at 10:29 AM\nWhat we needed.\n\nThis game is a great example of what we can make in VR. Most games have the issue of being something you could port to a computer and still enjoy, but the unique mechanics of this game prevent that, making it truly special, and is phenomenal all around.\n\nHelpful | 0", "Breaks23Jun 29 at 7:40 AM\nAmazing game but major bug\n\nIt starts out easy, but the puzzles get mind-bendingly difficult and are extremely satisfying to solve. I also love Patrick Stewart so having him as the narrator is a nice plus. One of my most enjoyable and addictive experiences on the Quest. Edit: I dropped 1 star because I ran into a known bug whereby you lose your entire game, and Id finished all but one level! Still a great game but pretty horrible to lose your entire game right before the last level and Im not the first its happened to. That being said, the game was so good, that I actually played it all the way through again so I could finish it. The story is great but a bit of a time travel mystery, so it was actually more clear the second time around. Just wish I hadnt been forced into doing that due to a lost save.\n\nHelpful | 3", "MasterDecoySGJun 24 at 11:30 PM\nFairly lengthy by vr standards\n\nPros:\nRich lore - the game is a joy to witness, including some truly wonderful game effects that transcend both time and space.\n\nCompelling story - could be considered cliche, but I truly looked forward to seeing how the weight of time and isolation affected the main character.\n\nInteresting puzzles - Although some where not obvious what the puzzle was asking for, the difficulty steadily ramps up with a lot of those lightbulb moments that change how you perceive the game world.\n\nCons:\nGameplay physics glitchy - sometimes it was necessary to throw objects from one place to another in order to complete a puzzle, but the items acted inconsistently and required resetting the puzzle in order to complete\n\nArea of play poorly defined - more than once I was ejected from the game world for moving into a space outside of the intended area by accident as I turned around or was moving backwards.\n\nTests your comfort endurance: as someone who never experienced motion sickness before experiencing VR, I had finally built up a tolerance. But good game pushed me to my limit after about 40 minutes of play.\n\nOverall: I picked this title up from the daily deal, but in hindsight I would have been happy with my purchase if I'd paid fill price.\n\nDefiantly recommend if your after an adventure game.\n\nHelpful | 3", "CurareDartJul 10 at 6:20 AM\nWell worth the money\n\nLike other reviewers, when I started I thought, geez, this is ridiculously easy. But as you progress the puzzles get more difficult. I did have a few frustrating times when I could not figure something out (in particular in the professor puzzles) and there really isnt much out there in the way of hints. I did eventually clear them, though I had to take some breaks. Overall I would definitely recommend this game for puzzle lovers.\n\nHelpful | 0", "LaggniapeJul 10 at 2:21 PM\nImpressive\n\nImpressive game with beautiful graphics and narration. It has an interesting and well thought out story line. The puzzles are not so hard you can't solve them, but complex enough to really challenge you. The game play is obviously the work of careful, intelligent developers with a keen eye to creating an immersive environment that draws in the player to make you feel like your part of the game, more than just playing a game.\n\nHelpful | 0", "eltimorJul 15 at 11:26 PM\nLight and shadows puzzle game\n\nAudio excellent\nPuzzles: simple but the light play is intriguing and enjoyable\nStory: interesting but disconnected from puzzles\nVisuals: bright, fantasy style though low poly\n\nOverall if you want a low stress puzzle game with a slightly emotional story and good voice acting, might be a good pick!\n\nHelpful | 0", "GamerKMJul 4 at 11:42 PM\nThis game is a genre definining game!\n\nThis game is a hidden gem, and oh boy does it deliver. The gameplay is focused around shadow puppet styled puzzles. You need to use held objects to cast shadows on outline drawings. Over time the puzzles become more challenging. As you progress the developers used more inventive gameplay mechanics and complex puzzles.\n\nThe level design is so well built, some puzzles are hidden in plain sight. I found my self getting incredibly nostalgic for portal 2 while playing this as well finding many parallels. I ended up solving all the chapter puzzles. If you complete all a levels puzzles you open a bonus story chapter that gives context to the main story.\n\nThe game design was very innovative. The level design is minimalist but in a artistic way. I always felt fully immersed.\n\nThe narrative had me so invested that I could not put this game down. The ending of the game had me shaking from how overwhelmed I became emotionally. I was so invested in the story that I felt like I could just sit down and talk to the main character for hours.\n\nThe score is breath taking and nostalgic. It had a music box children charm much like the movie coroline.\n\nThe voice acting and animation work is top notch too, during certain points of the story I found my self wanting to hug the main character, it was that believable.\n\nIf you have trouble with motion sickness I highly recommend using teleport blinking. Most be experiences allow teleportation now and I always use it. trust me simulation sickness is no joke.\n\nMy only complaint is that I did have issue with world collision after teleporting. A few times I would find my self teleporting close to a wall or object to grab something, only to have my player either clip into the wall and getting stuck or not moving closer at all. Im assuming this could get patch or an issue with unity code. That being said it was not at all a big issue and over all this did not effect the core gameplay and was easy to ignore for me.\n\nOver all this game is a once in a life time experience. Its a fully original title and uses puzzles and narrative story telling in a seemless and enriching blend that keeps you invested and does not cheapen gameplay. Story exposition is given to you often while you solve puzzles or other tasks. If you are looking for a genre defining game that demonstrates great vr puzzle gameplay using environments and telling you a story this is your game. The developers made something special with this. Thank you for this experience truly!\n\nHelpful | 1", "SnaXxXxJul 2 at 9:47 PM\nBUY THIS!\n\nFIND AND COMPLETE ALL OF THE SECRET LEVELS! (it's not THAT hard to figure out). I makes the game hours longer and the story even better! This game is AWSOME. I can't believe this is a launch title. DO NOT let that suede your decision to purchase. Even tho there is nothing to intteract with in the environment, it doesn't matter (and if so would DEF just make the game way too difficult).\n\nI was skepticle about buying bc I read that the puzzles are all the same type, they just increase in dificulty. I thought it was a kids game. I was wrong. Some puzzles took me 2 minutes, but others made me feel inferior and took hours (i had to put it down). I have at least 20 games and I have had the quest for 6 months or more. I DID NOT expect to be playing this game for almost 2 weeks (hour or so a night).\n\nHelpful | 1", "dvc2112Jul 2 at 4:59 PM\nExcellent Game\n\nVery much enjoyed this game, and the graphics are clean and well done. Storyline was a bit hard to follow at first, given somewhat cryptic narrative glimpses into the events timeline, but makes sense later on and has no effect on the puzzles.\n\nIt felt like a great length to me, with 10+ chapters -- not too short, not too long. Good value for the $ and a great experience. Thanks!\n\nHelpful | 1", "MisterJW2Apr 14 at 7:13 AM\nJust great!\n\n--- SEE UPDATE! ---\n\nI wasnt sure about this game. Long initial loading, confusing (for me) tutorial and introduction level was a throw off for me. There was to much information to remember at once, I didnt know what to do. I think tutorial should be incorporated into the gameplay. But that was just a small obstacle for a newbie like me.\n\nEverything else about his game is magnificent. The environments, storyline, challenging puzzles are just great! I often found myself just admiring the details of the surroundings, like perfect recreation of old house feeling (old times feeling) in the hub of the Shadow Point. Beside that, this was the first game in VR that gave me true roller coaster of emotions, especially in that one point near the end.\n\nThis game is worth playing, has long runtime and great gameplay.\n\n--- THE UPDATE -\nThis might be considered a spoiler so be warned! So apparently there is another half of the game that I was not aware of. In every level you can find extra hidden moon, it enables you to go to extra levels in hub area. If you dont have them, doors in the hub would take you back to normal level. It is weird that this wasnt pointed out. Anyway Im extra glad, I can play more Shadow Pont\n\nHelpful | 83", "LooseFootGooseJun 27 at 5:32 PM\nCame for puzzles, stayed for the story.\n\nThe voice narration by Patrick Stewart is really good. Puzzles are top notch, they all focus around the concept of casting shadows using various objects found in an area. Every level something different is introduced to the formula to make it more engaging in fresh ways and not get boring.\n\nWhat really surprised me was how invested I got in the story, particularly about 2/3rds of the way through which really drove my desire to 100% this game.\n\nLooks and plays great, well worth the price, 5 - 7 hours long.\n\nHelpful | 1", "DragonsteedJun 26 at 8:42 PM\nVery compelling story!\n\nShadow Piont had me intrigued from the moment I first played it up until I finished it. I was always wanting to know what happens next I was emotionally invested in it. The story made me feel happy and sad (especially sad) for the characters. Patrick Stewart and the other voice castings all did a fantastic job and the visuals are stunning. I highly recommend it I wish it was talked about more I'd love to see it get more recognition.\n\nHelpful | 0", "lolo998Jul 25 at 7:57 AM\nWow\n\nThe story it's just so good , the graphics are amazing and the way the dev use all the controller ability it mind blowing,\n\nGreat work guy\n\nHelpful | 0", "janetann100Jul 20 at 1:58 PM\nBrilliant\n\nThis game is just amazing, so clever, good story line too. I enjoyed every minute of it. The puzzles are so clever. Definitely worth getting without a doubt.\n\nHelpful | 0", "Virtual-catJun 27 at 7:35 AM\n\nInteresting story. Nice mechanics. The game implements a mechanic that I wish all games had which is a faded ring on the floor indicating the center of your guardian defined physical room. I wish more games had this so you could keep tabs on where you were in the room. I tend to end up on the edges as I like to explore environments.\n\nNow for the most frustrating things. It's possible, in some scenes, to get \"go back to the play area\" in the game where the the virtual space doesn't align with your physical room space. Oculus won't let you leave your physical space without fade out and the game won't let you continue unless you walk to a space outside of your guardian space (on the other side of physical wall)! Ugh! Oddly, the recenter mechanism (right controller Oculus button) doesn't fix this! You have to leave your game, press continue and just be very careful with that portion of the game. This might be teleport specific, but the Oculus recenter button should always fix things and align the physical and virtual spaces.\n\nFinally, VR is about exploration. I can't seem to inspect extra things in my backpack in the beginning of the game. Many times I pick up something only to drop it to floor, but is in fact still in the backpack. I'm looking at it on the floor but it's still in your backpack so you haven't lost it. A little confusing.\n\nOverall, this could be a top tier 5 star adventure with some simple bug fixes. Graphics remind me of the Campo Santo game Firewatch, stylistic and fun. As it is, just beware of the issues and know you have to work around them.\n\nHelpful | 4", "Jackaboyo11 days ago\nBest puzzle and adventure game!\n\nJust finished the game. This is the best game that i have ever played!! Such good storyline if you havent bought this game yet then your missing out\n\nHelpful | 0", "mopsigmorumJun 19 at 2:50 PM\nDefinitely worth it\n\nThe very start of this game didnt wow me; the intro and first chapter gave the impression that this game would be the same throughout. But I was very wrong. By the end of the second chapter I was getting hooked; it felt varied but at the same time was consistent to itself which gave a feel of realism; the puzzles were challenging but made sense within the physics of that world. The aesthetics are beautiful; the narration is wonderful. When I finished I had that bereft feeling that comes with finishing a great story. I would definitely recommend it, but have to say that the first twenty minutes wont show the best of it.\n\nHelpful | 1\nDeveloper ResponseJun 18 at 6:36 AM\n\nHi mopsigmorum, I am happy to hear that you played through the whole game. Thanks for playing!", "ist0Apr 6 at 11:42 AM\nA longer, narrative, puzzle game\n\nA lot of oculus games you can play through relatively quickly (about a week/weekend). This game has a good amount of content and challenge combined with a compelling storyline that feels very immersive. This game neatly breaks into smaller sections that you can pick up over time. It doesn't feel like it flies by as fast as other games do. The puzzles themselves really play with the nature of VR technology, which makes it an enjoyable introductory game as well. Absolutely worth the purchase.\n\nHelpful | 19", "AxidelMay 17 at 2:08 PM\nMagical experience\n\nI like this experience. It's really magical ! The game really likes to play with your senses of Time Space and other stuff that simply doesn't exist in real life. The naration and story is kinda moving and catchy. The devs made a good job It's a soft and magical experience. I love it.\n\nHelpful | 3", "DocsOcsJul 28 at 12:21 AM\nRecommended.\n\nGood game but needs a bit more variety and much more Patrick Stewart.\n\nHelpful | 0", "gsmith1718May 18 at 10:43 AM\nNice Game and Story, A Few Annoyances\n\nMany have written about the game and story so I'll just point out the annoyances... Most of the shadows align when you are \"close enough\" but a few are so bloody fussy as to be an extreme annoyance. The other issue is that someone seems to think it's necessary to keep putting you so close to the edge you actually have to have one foot over the edge to do something sometimes. The Garden has examples of both. These annoyances ruin an otherwise pleasant experience.\n\nHelpful | 3", "maxc137Apr 17 at 2:31 AM\nAwesome game, but lots of bugs\n\nFirst of all, this is a really great puzzle/narrative game and I highly recommend it (sort of like \"The Witness\", but less open world and more narrative based).\nPS: I complected all main and additional puzzles, and earned all achievements.\n\nThat said, it has many flaws:\n1) I was never made nauseous by any VR game before this one. An advise: first thing to do when you open this game is to set \"Teleport only\" locomotion method. Thank me later\n2) You cannot interact with anything that is not plot-related (even things like pen on a table, or box on the floor)\n3) When you phase yourself into textures everything turns gray and an arrow points out where your last valid location was. And that happens even if you try to lean above the table or something. A bit disorienting, but ok. The issue is, sometimes (3-4 times during my play of about 8 hours) you cannot escape this sate. Move whenever you want, but gray area with an arrow never disappear. The only escape is the exit the level.\n4) I had to start game from scratch 2 times!\nFirst time because of the corrupted save state. I've completed 3 (of 8) levels and exited the game when I was on 4th one, but when I returned to the game I couldn't continue the level because all my items were inaccessible (purple), and one them was required to go to the place in the level where I left them. There is no way to reset individual level, so I had to start a new game.\nSecond time I completed like 5 or 6 levels and my battery died. No big deal I thought, there must be an autosave right? Wrong.. Turns out game saves only when you manually exit the level. (by the way to properly exit the game you need to do like 6 steps and wait around 30 seconds. first - exit the level to main area, second - exit the main area to main menu, and finally - exit the game). Sooo, when I changed my Quest, I was greeted with \"New game\" option without \"Continue\" one.\nOn my third play-through I always exited the game only in intended (30-second-taking) way\n\nHelpful | 10", "PhirmJul 9 at 4:14 PM\nOutstanding\n\nSo good! Beautiful aesthetic, incredible story, and INSANELY clever worlds and inter-dimensional puzzles. I was bummed when it ended.\n\nHelpful | 0", "Il_GallaJul 3 at 8:29 AM\nSome tech probs prevent to solve game\n\nThe game is very good and uses the VR in a great and unusual way but I'm sorry cannot give more stars for two reasons:\n1) In the Huntress level is almost IMPOSSIBLE to take the key in the well. The real floor is higher than the virtualized one, so you never can reach it (Quest. Did not try with Rift).\nI've spent about one hour (setting bounds everytime) and finally did it but... in another well you have to reach an apple... that was impossible for me. Stuck there... forever!\nDid I miss something? I tried Room Scale and sitting.\n\n2) Please translate in italian... in the game there are languages less spoken than it. Thanks.\n\nHelpful | 0", "RCarmitageJun 30 at 2:42 PM\nMostly good\n\nI was really enjoying this game until I got stuck on the 4th (or 5th?) chapter, which involves a lot of going back and forth through the same rooms/walls etc, and I got motion sickness trying over and over again to do a particular puzzle-no matter how often I tried, I just couldn't do it although I understood what was wanted-and to be honest I got bored of trying....I wish I could have skipped to the next chapter. The puzzles are similar to one another in each chapter, so once you have figured out what you are supposed to do, for me, after 4 or 5 similar puzzles, I got a bit bored in a couple of chapters.\n\nHelpful | 0", "2many2countApr 6 at 12:15 PM\nA true VR world\n\nWow. This is my favorite of all VR experiences. I could stay in here for days on end. The overall tale is wonderful  and then add in the colors, ambient sounds, voice acting, fluid movement, set designs, sound effects, lighting Perfect!\n\nBeing in Shadow Point [note I did not write playing] strongly reminds me of my first journey through Myst; another place where I could easily spend hour upon hour just taking it all in  and then going on with the story.\n\n...and then returning when youve gotten all the pieces together and the story finally  and fantastically IMHO - becomes clear!\n\nPlease make dozens and dozens more just like this.\n\nYour pal, Findley ;p\n\nHelpful | 6", "soulevans07Feb 2 at 10:32 AM\nYou need to experience this for yourself\n\nThere are touching stories in film and then there is this game. You can't compare the difference in the effect it will have on you to a movie you just saw.\n\nThis game started slow and seemed like just another puzzle game but after 2 or 3 chapters in as the story starts to unravel you realize how entangled and attached you got in the story and to it's characters because you are not just a spectator but an acting part of it. Soon you will keep doing \"just one more\" puzzle just to see what happens next (or what happend before).\n\nIt will take you to an emotional rollercoster with tragedy, joy, loneliness and greatfullnes. And when it all comes to an end and the credits roll - with the beautifull song of \"I've got time\" - you just stand there not sure what happend and what to feel.\n\nI still don't know what is this complex feeling I feel right now but I'm sure I will remember this experience for a very very long time!\n\nYour friend... and hers,\njust another greatfull player\n\nHelpful | 105", "OcularMigraineApr 2 at 5:38 PM\nFantastic puzzle game\n\nI really enjoyed this game and glad I spent the the time to finish it. I loved how they built the puzzle mechanics over time. It fit with the story, in that Lorna held on to her past by creating the shadow puzzles, but that they became more complicated and convoluted as she got older. I found the story interesting, and I really wanted to help her to get back home if I could. (Witnessing the psychological effects of long term isolation both in her story and in the changing environments she created was powerful.) The last puzzle before the ending was a little different from the ones prior to it, and was amazing.\n\nLike other reviewers, I did have some problems with getting into the black hole from teleporting in the wrong places and having to restart, but eventually I found that I could avoid that happening by not teleporting through doors or portals, and by not teleporting too close to walls.\n\nI haven't played many puzzle games, and I was challenged by this, but I never had to watch any videos to figure things out, and got only a couple of hints from a friend who had completed the whole game before. Many times I had to get creative to come up with solutions, so that made it feel like a real accomplishment when I could fully complete a level. Sometimes it felt like I sort of stumbled onto the solution, so I might go back at some point to try again and understand why everything I did worked. A couple of times there were bugs, and I got stuck for a long time. That's where my friend helped me a lot. And sometimes you have to be just at the exact right place for something to work, too, so be sure to experiment if you're stuck.\n\nOverall, it was a great game, and I can tell a lot of work went into creating the touching story, the puzzles, and the amazing environment. Highly recommended!\n\nHelpful | 6", "NukemarineMar 7 at 5:59 AM\nIt's Like a Great Episode of Doctor Who\n\nShadow Point Observatory opens doors across time and space throughout the life of a little girl lost in a pocket dimension who doesn't want to leave until she realizes she cannot. You explore this girl's fantasy kingdom solving puzzles of shadows, gravity, and parallel dimensions which unlock the mystery of young Laura's fate. All throughout, Patrick Stewart offers calm words from the past to guide you in an effort to also help save Laura from tragedy.\n\nThis game offers 9 main levels and 8 sub levels that revolve around shadow puzzles. To accomplish this, you gather objects that cast light or shadow while traveling through portals that bend space, dimensions, or gravity. Each level offers narration from Patrick Stewart's character or one way dialogue with Laura who you meet throughout her life as you make your way through the main levels. While there's little in the way of scares, expect to feel emotion as the fates of characters get revealed. The levels can be visited in any order, once unlocked. After level 1 you unlock 2, 3 and 4 while after level 5 you unlock 6, 7, and 8 with level 9 being the final level. The sub-levels require \"moon puzzles\" to be solved in each of the main levels. Progress is saved as you play levels and they're not dependent on each other aside from the unlock requirements, but each level can be reset by pressing a red button near the access handle if you want to start over for fun or missed dialogue. While the puzzles can get quite complex, they should all be doable without help. Expect 6 to 10 hours of game play though there's little to demand replays as the story does not offer any branches.\n\nShadow Point is an amazing game that you should experience.\n\nHelpful | 18\nDeveloper ResponseMar 9 at 4:33 AM\n\nHi Nukemarine, thanks a lot for the review.", "0g1dn3wMay 3 at 10:59 AM\nLove this game!!!!!\n\nWhat a spectacular game this is. Inventive puzzles., mind bending mechanics in some places, and a really great story to discover that unfolds as you play. The graphics are a bit cartoon-ish but Id say they suit the game and get the job done. Definitely one of my favorite VR experiences. If you like games that test your brain and not your reflexes then this one is for you!\n\nHelpful | 1", "Kyarmo68May 2 at 7:07 PM\nLOVED this game!\n\nArtwork: brilliant! Story: compelling. Music: perfection. Puzzles: plentysome easy, some quite challenging. The experience of Shadow Point has sold me (a newbie) on VR, and I hope Coatsink has more games like this in store for us. I will always be interested in this type of VR game/ experience. It was super satisfying to work my way through this world. Bravo! Also loved hearing from Patrick Stewart!\n\nHelpful | 0", "gvonfangMay 2 at 1:53 PM\nSo good it gave me chills.\n\nIt took me a few times to really get into it, but once I did I was hooked and didnt want to put it down. I was worried the puzzles would be too simple, but they were fun and challenging. Each level has different twists that keep it interesting. The story sent chillls down my spine ( in a good way ). I really enjoyed this experience.\n\nHelpful | 0", "Ihrie4 days ago\nFun puzzler with a unique story/setting.\n\nDefinitely one of the more mind bending puzzle games Ive played on the quest.\n\nThe story is interesting and I look forward to seeing how it ends, who doesnt like a good Patrick Stewart narration lol\n\nNot as visually striking as Red Matter but has maybe a bit more meat on its metaphorical bones.\n\nHelpful | 0", "DaeymonApr 13 at 5:35 AM\nAmazing game and story. Save bug issue\n\nI've now finished this game and its amazing and certainly a fun experience. So my review has gone to 1 to 4 stars. I have to mention though thag there is an unfortunate bug that you can randomly lose your save progress. Its quite a frustrating bug that really spoils the experience. This is a critical bug, and thus my review is one star less than it should be.\n\nHelpful | 3", "GeezerinoJun 3 at 3:28 AM\nWhy all the fuss?\n\nThe reviews made me overlook the underwhelming screenshots. Well, I wish I hadn't. Overall it felt like an interesting concept but just kinda boring all around. I kept playing waiting for the \"a-ha\" moment that was responsible for the great reviews.... yeah, that never happened.\n\nThe graphics in particular are very disappointing. Maybe they felt extra bad due to playing Moss before I got Shadow Point.\n\nAnyway, if you're on a budget, skip this one. You aren't missing much.\n\nHelpful | 1", "williamruneApr 18 at 12:25 PM\nGame stories ARE important - A+\n\nExcellent game. It's been a long time since the story and voice acting (Sir Patrick Stewart) actually out shined the game mechanics itself (which are also great). It takes a few levels to get \"hooked\" ... but once you're in the game ... you constantly keep playing to see where the story leads. Amazing. I actually felt emotionally tied to the game at the end.\n\nHelpful | 0", "Conrad-RoqueApr 17 at 8:49 PM\nJust AWESOME\n\nI could only play for ten minutes at a time at first. Made me sick. I hot used to it. In settings you can take hints off, highly recommend. And you can play sitting. Puzzles are great. Twice I wanted to cheat and look on youtube, but I did not and figured them out after 5000 exacduated hours. Great game and highly recommend it for puzzle people.\n\nHelpful | 0", "Tony.DiIuorioApr 14 at 5:39 PM\nI was worried it wasn't puzzly enough...\n\n...But the worry was unfounded!\n\nIt's very reminiscent of \"Legend of Zelda\" dungeon puzzles. Only with better environments, and in VR.\n\nThey called it SHADOW POINT for a reason - much of the work is done using light to cast various shadows! Quite uniquely 3D and suited to VR. (Do you remember LOZ switches which were light activated? Remember charging lights, and placing mirrors to reflect lights?)\n\nOf course there's more to it than just puzzles, but mostly your going to be finding solutions to unlock the next door. Gravity and light behavior is tweaked in this reality, very fun.\n\nI only wish it lasted longer. Well done.\n\nHelpful | 1\nDeveloper ResponseApr 15 at 4:32 AM\n\nThanks for the great review, Tony.DiIuorio!", "HalfAlrightFeb 22 at 12:23 PM\nMy favorite quest title, but.\n\nI got the quest as a beat saber machine, but when I got this game I really enjoyed myself. The amazing storyline will drive you to progress, and the challenging puzzles will leave you fulfilled after completing. The only note I have for this game is that it is one of the worst games for motion sickness I have ever played. The puzzles that have you changing your point of view or changing gravity force me to close the game, I have a very high tolerance to motion sickness, but I cant play more than 1 portal before I get sick.\n\nHelpful | 11\nDeveloper ResponseFeb 24 at 3:19 AM\n\nThanks for your review HalfRight. Increasing the vignette and slowing down the movement speed helps a lot of players who struggle with motion sickness. Please watch our video on comfort options for more information: https://www.youtube.com/watch?v=QBSyZmTGgRQ&t=1s", "TimNikiasApr 12 at 4:07 PM\nGreat Art and Story, but...\n\nThe Art style, music and Voice actors are really great. And as others have mentioned, building shadows as Puzzles could get boring, if there weren't frequent additions with new mechanics set in place - and these add a lot of fun.\n\nBut some puzzles suddenly require you to make a leap in thinking or even handling of the game so far. Warnung, spoiler-question: How should ANYONE guess, that to continue, you should attempt to move your head INTO a well you can't move into?\n\nI was especially frustrated with the Bonus levels, which you can enter once you've solved the moon puzzles and was faced with mechanics of which an explanation/introduction actually came later in the normal levels that I hadn't even tried yet. I was especially annoyed with Bonus Level 5 where a Portal suddenly behaved completely different than they do in the rest of the entire game.\n\nThose annoyances aside however I really enjoyed the world, story and style.\n\nHelpful | 0", "LetoDKApr 14 at 10:35 AM\nBreathtaking!\n\nI rarely write reviews, and I almost never get caught up in the story of games, but this game was the first to give me goosebumps! Incredible experience! The puzzles are genius. The difficulty is perfect!\nThank you so much for this experience!\n\nHelpful | 0\nDeveloper ResponseApr 15 at 4:33 AM\n\nHi LetoDK, we're happy to hear you had a great time with Shadow Point.", "papyruswarriorMay 22 at 6:48 AM\nLong campaign puzzler\n\nGreat story great puzzles well worth the money\n\nHelpful | 0", "michael.kohlwegMar 24 at 8:19 AM\nIs what it is\n\nI really enjoy puzzle games and this is an excellent one.\nSir Patrick Stewart narrates sections of it in an attempt to crowbar a story into the game. The story is irrelevant to your actions. There's only one path you can follow so the story and it's cut scenes are more of a hindrance to gameplay, your solving of each puzzle doesnt really have anything to do with the story. Nothing is really added from there production. It's simply a match the shape game with a lot of difficult brain bending puzzles which are great fun and well worth the price. Would definitely recommend it. Worth the money. Got plenty of hours out of it, it's not a quick title you get plenty of play out of each level.\nGive it a go !\n\nHelpful | 2", "LundymanApr 19 at 9:02 PM\nGets boring after a while\n\nIt pains me to leave this review as I typically love puzzle games. This one just didnt stick with me.\n1) It made me VR sick almost every time after play (even after owning for 6+ months)\n\n2) the puzzles werent hard necessarily but more random and frustrating at times. The shadow making is fun at first but gets kind of old quickly. Then you get stuck in places that provide no hints and the actual answer is so random that there were areas I solved and had no idea how I ended up doing it. Haha\nI REALLY wanted to like this game but found myself taking longer and longer breaks from it to eventually deciding to just not finish it and remove it from my Quest (for more space).\nNot trying to throw shade- just being honest with this review.\n\nHelpful | 3", "Tommy96GunMay 12 at 10:23 AM\nLost game progress\n\nOn my first play I finished 3 of the chapters and then I quit the game being told that my progress will be saved. On the next launch there was no option to continue my game just \"New game\" and \"Quit\" and indeed I had to start again from square one. Uninstalled it right away.\n\nHelpful | 1", "HutwolfApr 12 at 3:28 PM\nSolid puzzle game with a few missteps.\n\nI wasn't expecting too much, when I first got the game, but it turned out to be an enjoyable puzzle experience. While the puzzle design isn't too outlandish, there are a few interesting mechanics and concepts, including gravity and mirrors, to form different shadows in order to progress. Two major weaknesses do prevent this game from becoming great though.\n\nFirst, any cool mechanic they introduce gets used for maybe one slightly more difficult (optional) puzzle, before it gets dropped completly. Don't expect Portal-like build up to truly interesting challenges. Second, the story and the gameplay don't seem to connect at all. Yes, the story is quite interesting, but at no point I understood why I had to unlock doors with random shadow puzzles or what it even achieves within the narrative frame.\n\nThe visuals are fine. Pretty minimalistic, but cute. What suprised me is how the movement in the game makes me feel queasy pretty fast. I had to take breaks for my stomach to calm down. It's weird, since it's the first VR game on the Quest to make me feel uncomfortable while playing, despite it being a rather slow paced puzzle game. But something about the movement just ain't right.\n\nAll in all: I'm enjoying my time with Shadow Point, but it doesn't feel substantial enough to recommend to everyone.\n\nHelpful | 3", "AbballeMar 30 at 6:47 PM\nA must buy\n\nhave a game everyone should buy. Its called shadow point. It has a mystery storyline, and you have to solve shadow puzzles. I only owned it for 2 days and I cant stop playing it. The graphics are cartoony but great too. I give it .\n\nHelpful | 0", "nicolas.reynier.50Mar 29 at 11:14 PM\nGreat story, great graphics, fun but...\n\nReally the kind of experience I'm s happy to enjoy with VR. The graphics are fun and make you feel in a different world, quite cute. The narrative voice, the story, are really good. The length of the game is also quite nice. You will play for a while ! Really good job !\nThe reason why I don't rate 5 stars is because of the puzzles. Initially too easy, they quickly became fun,but then as the game lasts, I would like to see more variety of enigmas. It's always the same game play with lights and objects and in the middle of the game I got a bit tored of it. I needed something different. So I stopped playing for a while and then went back into it after having played other stuff. Actually towards the end the puzzles become more fun,and the world surroundings more astonishing. So that made me happy to get back into it.\n\nWeel done to the developpers. Smart, surely difficult to create. You deserve success.\n\nHelpful | 1", "Lincoln422Jul 7 at 10:10 AM\nWorth a play\n\nReally good game! Fun to look around and the puzzles are interesting. Super cool story and so fun in VR. When lining up your hand movements, you have to be very still and very specific. I have shaky hands and sometimes find this very difficult to match everything up. Takes me extra time which can be a little frustrating. Other than that, a great game!\n\nHelpful | 0", "nobleAlchemistJun 26 at 10:25 PM\nGreat puzzles. Not just shadow puppets.\n\nI actually passed on this the first time I saw it on sale because I saw a gameplay review that showed some puzzles from the first chapter and I thought the whole game will just be variations of casting shadows that get progressively harder to form. But that was not the case, it gets progressively harder by introducing other fun and complex puzzle mechanics (e.g. gravity defying, physical barrier breaking etc.).\n\nGreat for anyone who likes puzzle games.\n\nMy only complaint was that the story, while intriguing, was hard to understand, and it was hard to see how the puzzles that I was doing had anything to do with the storyline. So there seemed to be some disconnect there.\n\nHelpful | 0", "notyouagainMay 6 at 2:41 PM\nSave yourself the frustration ...\n\nThe game has some clever puzzles but I have spent more than an hour on trying to solve one again. Matching up a head and key is not easy and once passed, make sure you save. It is not easy nor simple to line up the two to look like a shovel hanging from a dragons mouth.\nI have enjoyed most of it. It would be at least two more stars if not for this problem.\nDropped another star after looking for ways to get by the key and skull.\nUp to this point most of the game is cool. This part is NOT worth the hassle.\n\nHelpful | 0\nDeveloper ResponseMay 13 at 2:51 AM\n\nHi Notyouagain, we uploaded a full walkthrough of Shadow Point that could help you when you can't find the solution to certain puzzles: https://www.youtube.com/watch?v=8A_xKmDN_nw&list=PLCdqKtRjMl-sP8KIPt_OCocagZpeAV9sr", "DeepMellowJun 2 at 6:21 AM\nWorst boring game ever.\n\nDont even bother with this one. Its just a bunch of the same old boring puzzles. Dont waste a refund on this. Too many refunds and you get banned from refunds. Not worth it.\n\nHelpful | 0", "TigerTerritoryFeb 20 at 3:05 PM\nLove this game, except for two issues\n\nFirst off, this really is a great game. The puzzles are fun and sometimes pretty challenging. The storyline was wonderful, and the narration was fantastic. A couple things I didnt enjoy:\n\n1) there are many objects that you simply cannot interact with, which takes away from some of the immersion.\n2) motion sickness. Im not prone to motion sickness, as Ive owned my quest for about 5 months now, but this game can be pretty sickening...I had some relief by not using the locomotion at full speed. Even still, I couldnt play this game for more than an hour each time because I had to rest.\n\nOverall, I really did enjoy the game, and would recommend it to everyone...except those who get motion sickness.\n\nHelpful | 5\nDeveloper ResponseFeb 24 at 3:21 AM\n\nThanks for your review HalfRight. Increasing the vignette and slowing down the movement speed helps a lot of players who struggle with motion sickness. Please watch our video on comfort options for more information: https://www.youtube.com/watch?v=QBSyZmTGgRQ&t=1s", "Toad962Mar 17 at 8:52 AM\nEngaging VR experience\n\nAs one of the first VR experiences that Ive played through Id like to commend the developers on presenting an experience that was both challenging and touching. The scenery and characters were so engaging I found that I didnt mind the frustration I felt trying to figure out the puzzles. I really felt a part of the story and that kept me going.\n\nI appreciate this title most because Im trying to introduce my friends to VR and Id rather not scare them away from VR with all the horror or rollercoaster games. I will be looking for more titles from this company. One thing I would like, which Ive only seen on one other game so far, is a way to save game progress for multiple players.\n\nHelpful | 1", "DziQsMar 1 at 6:51 AM\nOne to test the noggin!\n\nWonderful game! Love the puzzles and animation. Really gets you thinking about problem solving, and Sir Patrick Stuart's smooth voice guides you through the story. Decent amount of gameplay for the price. You could probably complete it all in one day if you smashed it but I did a level or 2 at a time at it lasted me 2 weeks. I absolutely loved it.\nWould be better if you could have multiple save slots though - had to tell my partner not to touch it until I'd done :-P\n\nHelpful | 2", "Hoshi8219 hours ago\nNo left hand support\n\nThis may be a slow paced game but why I am forced to use the left stick to move and have no option to switch to the right stick as a lefty? This long after release and leftys are still ignored in so many vr games.\n\nHelpful | 0", "cara_amiraFeb 29 at 11:21 AM\nOne question..\n\nI have one question: If I start a new game, will it clear my earlier game? Or can I have more than one game open at the same time? I'd like to keep my progress saved (100% with all the moons), but also to start a new game to show my friends. If it's not yet possible, could you add such option? But for now, I dont want to risk my game by starting a new one. :)\n\nHelpful | 2", "GozasanApr 29 at 12:45 AM\n\nLovely little puzzle game...Patrick Stewart narrating is sooo good!\n\nHelpful | 0", "mparrigan62May 1 at 4:34 AM\nShadow point\n\nThis is a fun game with a lot of great puzzles some that will keep you intrigued for a long time.\n\nHelpful | 0", "SuperstinksJun 28 at 6:36 PM\nWas not expecting to enjoy it this much\n\nSo far I have done 4 world's and I've got to say I did not think i was going to like this as much as I am.\nThe puzzles are fun and I just wanna jump back in as soon as I take off the headset, very happy with purchase. Will update when I finish it\n\nHelpful | 0", "nixon118Apr 29 at 4:16 PM\nFun and challenging!!!\n\nVery pretty game with great puzzles and mechanics!\n\nHelpful | 0", "LadyCapt_JacksApr 16 at 6:59 PM\nGood concept, experience is meh\n\nBeen a fan of the puzzle games experienced in VR. There are plenty of options on Oculus, however, having played different games, Shadow Point execution could use some improvement.\n\nPROS:\nUnique puzzles for each \"chapter\" constellation. Seeing the map light up is a good indicator you completed that section.\nImmersive environment that I ended up \"triggering\" my guardian as I forgot I'm in my living room, not in fantasy, dreamy space.\n\nCONS:\nToo easy to step out of boundaries, this is my biggest MEH/problem! Screen goes black and despite the arrow with feet circle, following it does not allow me to enter back. My workaround is to simply press the center button to \"Return to Shadow Point\". which is annoying. since I have to restart.\n\nBugginess in the mirror/transport, example after transport, the hands transport is not responsive.\n\nWould be nice:\nAdd some verbal nudges. I would hear sounds happening not knowing what I did triggered an action.\n\nHelpful | 1", "Blossom911Apr 18 at 3:03 PM\n\nThe shadow casting is a pain in the rear sometimes. I wiggle too much. Long load time. Pretty neat artwork. The more I play the more I like it.\n\nHelpful | 0", "VaeldiithiaDec 13 at 9:22 AM\nCame for BeatSaber, stayed for this\n\nI bought my Quest as a BeatSaber-machine, did not really plan to play other games at all. I decided to try this game, not even sure why. After the first level I wasn't sure yet, but decided to give it 1-2 more hours. Then I was hooked. I was actually excited to come home and continue this game for days! It took me more than 10-12 hours to finish this game, I spent a lot of time just enjoying the views in some levels, exploring the details. I ended up liking the story a lot. This game totally changed my mind about vr gaming and now I'm excited to try other games as well.\n\nI loved the puzzles, the views, the story, the narration, everything. This game also really takes adventage of it being a VR game.\n\nAlso, we don't have enough space for roomscale games, so all the different options to move around was a huge plus for me. I usually teleported around to avoid motion sickness but adjusing my position with the controllers was really helpful.\n\nHelpful | 59\nDeveloper ResponseDec 16 at 9:06 AM\n\nHey Vaeldiithia, thank you for the review. Great to hear that you had so much fun with Shadow Point. Welcome to virtual reality :)", "kristin.sherwood5Mar 14 at 9:06 PM\nGreat game with a few technical glitches\n\nThis is a great game for exploring multiple worlds. The concept is creative and each chapter features a new type of puzzle. I'm almost to the end and it's given me many hours of gameplay in beautiful environments. My only complaint is that the game often tells me I've left the gameplay area and prompts me to return; yet, given the constraints of my guardian, I'm unable to do so. I have to return to the Shadow Point observatory and then enter that particular world again. Sometimes this has happened multiple times in the space of a few minutes. The problem seems to be that the teleporting doesn't always take me exactly where I point; instead it might land me in the middle of a wall.\n\nI'm also not a big fan of the music, but that's more of a personal taste thing. The above glitch is the reason I didn't give the game 5 stars.\n\nHelpful | 1", "hanah580Jun 28 at 5:47 PM\nVery beautiful and challenging game\n\nIt was hard for me to figure out at first but once you get in the swing of things its a really fun game. The story is also intriguing and interesting. The visuals are also beautiful with lots of detail.\n\nHelpful | 0", "thebaconbaronMar 25 at 5:54 PM\nGreat Concepts\n\nFun puzzle concepts which continue to change so that they're kept interesting. Lovely design and graphics. The story didn't really land with me, but overall a great experience.\n\nHelpful | 0", "CluelessDadGamerMar 31 at 8:41 AM\nMyst vibes\n\nReally enjoyed this.i.was looking for a Myst like game in vr and as obduction was not available this certain scratched that itch.well worth it.\n\nHelpful | 1", "PeteyPakMay 13 at 7:45 AM\nPortal meets Myst but controls are awful\n\nThe puzzles don't get interesting until the second half of the game, but when they do they genuinely get fun.\n\nUnfortunately this is the buggiest game I've played and twice I got stuck because it turned out I'd got into an illegal game state or something had disappeared from my inventory and I had to reset a level (luckily they have reset buttons!) before I could continue.\n\nUnfortunately x2 this has the worst movement controls I've seen anywhere, and for no good reason except bad design. The teleport button (that you use the most of any control) is that one on the controller farthest away from your thumb past the Analog stick. It is not remappable. And this is a game where the trigger button is unused! And the Analog stick *always* does snap turning, it cannot be disabled despite this being a title for a headset that needs no wires!\n\nMovement accelerates by default (instead of constant speed), no wonder so many other reviews complain about sickness.\n\nWhen teleporting, sometimes you're turned around. And sometimes you're clipped into a wall. And sometimes you're stuck in a doorway/portal and have to walk around before you can teleport again. I have a small apartment this was a problem for me a lot.\n\nIt's bad. It's ridiculously bad and 90% could be solved just with some game options and more sensible defaults. There's no reason for basic navigation to be so bad here, and to be causing so much discomfort that even five star reviews are saying \"love this, but...\".\n\nThen there's the stupid backpack implementation. I restarted the game twice because the book in the first room disappeared when I thought I was meant to be able to read it. It's meant to just disappear, right? Because it happened to me three times and I gave up. It's really really annoying, one minute into the game and I'm swearing bitterly with irritation instead of enjoying it. Then later, objects you don't need, don't disappear into the backpack, they hang around. What's with that? It's weird. The book I want to see disappears into the backpack and I can't take it out, the ball I'm not interested in but will need is apparently in there but not actually so I have to leave it behind? Even the tutorial for this was weird, the ball in a hamster cage and in your hand at the same time isn't even how the gameplay works. I got used to the system with time but I never thought it was sensible.\n\nThese are irritations that stick with you all through the game.\n\nHelpful | 2\nDeveloper ResponseJun 18 at 6:33 AM\n\nHi PeteyPak, sorry to hear that you weren't happy with a couple of things. The diary at the beginning just fades away, instead of having the player read what's happening, Edgar Mansfield tells you the story. Also, all objects that are in your inventory are needed to solve puzzles. We made the decision that additional objects may lead to player confusion which is why you can only pick up and use objects to solve the next puzzles. I hope this was helpful :)", "Smashley_91Apr 12 at 7:14 PM\nDissapointed\n\nThe idea of this game is fantastic and I love all the graphics.\n\nMy issue is that there were many glitchy problems I ran in to. I spent more time trying to 'return to the play area' than actually playing half the time. I walked around my entire room once and it still would not accept that I had returned to play area. I had to restart the game, as I was stuck in a black blanked out game. The teleporting was not always working as it should either.\n\nI would have loved to give this game a higher review, as I am not one to usually leave bad reviews but I made it all the way to the last level, 'the garden' and was getting dizzy and frustrated just trying to get the game back. I finally gave up and will delete off the quest.\n\nHelpful | 0", "Redalt99May 19 at 10:55 AM\nOverwhelmingly average\n\nHas a pretty interesting premise but if the game was not in VR it would be very bland.\n\nHelpful | 0", "LostLabrysApr 10 at 4:55 PM\nCould be 5 star without bugs\n\nStory: amazing. it breaks my heart, i want to know how to save her <3\nlanguage: the subtitle are so fast that without italian is a little hard apreciate 100% of the story\npuzzle: they become more and more tricky, according to the story. i like them\nsshadow game: MH sometime the solution is right but i need to spend 10 minute to adjust shadows in the perfect way.\nand the THE LABORATORY:\nWTF?!?!? why the game did not save in the laboratory progress???????\nYou need to go on and back from the portal (i move with teleport) and 1 time in 10 the games decide that \"you left the game area\" and that \"the game area is out of your real house for about 40 meter =_=\". So you must go back to shadowpoint, lose everythings and start again.\nIn the pendulum laboratory i crash 4 DAMEND TIMES. is so so so frustrating!!!!\ni need time to understand why the **** light don't go in the right direction and then i need to start again and \"have fun\" tryng to throw object that appear in the other room 1 time in 20. And the \"oh you are out of gaming area\", start all again. are you serious?!?!?!?!? really??? make the items appear in the right room if you make the right choice and fix the teleport bug, please!\nI wanna know how all the story will end!\n\nHelpful | 0\nDeveloper ResponseApr 15 at 4:35 AM\n\nHi LostLabrys, could you reach out to us on discord.gg/coatsink please? We would like to look into this and help you!", "sage.bond.2000Apr 13 at 8:32 PM\nGreat game.\n\nOne of the few real games on the platform.\n\nHelpful | 0", "SirFlakMar 1 at 5:02 PM\nExcellent Puzzler\n\nI enjoyed this game and the story woven through it. High quality voice acting through out. Difficulty was appropriate. I think there still a few optional moon puzzles I didn't complete. Highly recommended.\n\nIt would be handy if it had a few save game slots. My kids reset my progress several times. I think many people who own a quest will have a family of users. Luckily once you've solved a level it doesnt take long to rush through it again.\n\nHaving played through the early levels several times, the white well with the dragon and the apple is very glitchy. Often it doesnt transport you as it should. Instead you stand there like a doof contorting to try and trigger the transition while avoiding the \"off the map\" black screen. The well earlier doesnt have this problem. Maybe I just dont understand what the trigger is supposed to be (bending down into the well?).\n\nOn the subject \"off the map\" indicators, I did occasional get trapped in inky blackness. The arrow was generally useless. Perhaps a wiremesh of nearby terrain would help the player back more than the arrow. Or use the boots in the circle to show where i could stand to make it stop.\n\nThese small issues didnt happen often, and are common to free locomotion. They did not significantly detract from gameplay.\n\nHelpful | 0", "ElbarkeroVRJun 29 at 1:49 AM\nBrilliant\n\nOnly an hour into it but seems brilliant and worth it. Looking forward to playing more. Teleport to avoid motion sickness from walking around\n\nHelpful | 0\nDeveloper ResponseJun 29 at 2:49 AM\n\nThank you for playing ElbarkeroVR!", "kimbiecookieFeb 26 at 8:00 PM\nIntriguing puzzle game!\n\nThis is a great game if you like puzzle games or escape rooms.Beautiful new world to discover! Intriguing story and mystery that unravels as you progress. Easily a five star as far as play but I have to give it 4 because the teleport movement often knocks you out of the play area and sometimes out of the game completely. Regular smooth movement can make you feel dizzy. The transition from PSVR to Oculus must've created a bug. It would be awesome if an update could be made to fix the teleportation movement so that it doesnt knock you out of alignment and out of the game occasionally. Good replay value though and immersive fun!\n\nHelpful | 1", "ROGUE-ONE1Feb 16 at 12:52 PM\nPut Puppet Shadows & Portal In A Blender\n\nGraphics : 4/5\nGameplay : 4.5/5\nNarrative : 4/5\n\nThis game should be a case study to show Disney the potentially fun future of their VR Games. Its filled with a beautiful story, magical locations and mind bending puzzles inspired by the Portal series.\n\nThe only improvement I would suggest is a better grab and hold design. Picking up objects took a lot of trial and error in some cases. Also I never understood the division of the side grabs. Left vs Right. How it worked or what the benefit was?\n\nAside from that, the game was great! Cant wait for more from this studio.\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 3:22 AM\n\nThank you Rogue-One1 for the review. We're pleased to hear that you liked Shadow Point!", "polka_pandaFeb 25 at 9:30 PM\nBest puzzle game on Quest\n\nThis game is very well done, I think its the best puzzle game on Quest (mind you, the others are also worth playing!). The puzzle difficulty is just right, the narration is great, and the environments are beautiful.\n\nDont miss this one!\n\nHelpful | 1", "huggsbosonMar 7 at 1:12 PM\nWonderful environment, wonderful puzzles\n\nLove Patrick Stewart. The setting the music and the puzzles were all revolutionary for me. There's even a whole hidden set of story and puzzles to complete when you get the moons in each space.\n\nHelpful | 1", "JohanTEAFeb 20 at 10:46 PM\nchallenging and comfortable\n\nIn general I like this game. The puzzles are sometimes a bit hard, which is good. The storytelling is beautiful but I have had issues understanding the goal. I realized after three or four levels that locks are opened on a specific door after each level. That could have been much clearer, but perhaps that was as planned.\n\nAnyway, if you like puzzles, this is worth a buy.\n\nHelpful | 0", "felixableJun 25 at 7:18 PM\nBest relaxing game\n\nIf you are looking for something relaxing while playing a game at the same time. This is the game of choice.\n\nHelpful | 0", "Grand_Admiral123Jun 24 at 11:40 AM\nAmazing story\n\nI loved the story and fell in love with characters. Really a amazing game I highly recommend this purchase.\n\nHelpful | 0", "ImASquirrelYipeeJun 28 at 3:40 PM\nGreat for everything but room scale\n\nThe content of this game is great and controls are aswell, yet when you play roomscale it doesnt like you walking around.\n\nHelpful | 0", "Klippy5Feb 11 at 12:55 PM\nMagical\n\nA really nice experience, the story and puzzles really come to life in VR.\nCharming graphics, don't expect anything that will blow you away, but it works for the story.\nThe puzzles are nice, varied and not too hard or too long.\nA really fun game, you won't be disappointed.\n\nHelpful | 0", "LogancwFeb 12 at 8:24 PM\nEmotional Story And Cool Puzzles\n\nJust finished this game. This is definitely one of the better VR experiences Ive had. What sold it for me was the plot and emotional investment that the player eventually puts into it.\n\nI wouldve liked to see more and be a part of Lornas adventures inside the fantasy world and develop a stronger relationship with her. It feels like some of the potential there was not fully realized.\n\nThe voice actors were fantastic. Another outstanding performance by Sir Patrick Stewart, and the voices of Lorna were excellent too. The music was beautiful as well.\n\nThe puzzles themselves were interesting and made me think outside the box. They werent repetitive, which kept the game interesting.\n\nGreat work on this Coatsink! Looking forward to more experiences of this caliber.\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 3:24 AM\n\nHi Logancw, thanks for the review. Have you seen our documentary about Shadow Point? We think it might be the right thing for you to learn more about Lorna. https://www.youtube.com/watch?v=JVrI5xUgkGs", "PunisherFeb 3 at 10:20 PM\nGreat puzzler!\n\nI was pretty sure that I was gonna like this game after reading some reviews. The puzzles start very easy and I wasn't sure about how fun the game was going to be, but when new mechanics are introduced the game really starts to shine. It took me a while to 100% it and had a lot of fun. This game is pretty lengthy and it offers great value!\n\nHelpful | 1", "UnfixingInk627Feb 29 at 1:20 PM\nWhat a story\n\nThis game is probably one of the nicest and interesting stories on the quest and is easily one of the most whimsical and puzzling environments ever in VR history\n\nHelpful | 0", "PineappleFrenchMar 9 at 6:41 PM\nI like it, but...\n\nSo the who gimmick of the game is to hold objects in front of a light source to make a shadow fit on an image to progress. If it weren't for the story and supporting gimmicks, to the shadow puzzles, it would have gotten old real quick.\n\nThe was also the first game that gave me mostion sickness.\nThe story was interesting, but not super immersive. The way it the game messes with your perception of time and space is fun.\n\nI got this game as a discount, worth its money. Not my favorite game.\n\nHelpful | 1", "A5041Jan 30 at 2:13 PM\nSkipped over it many times!\n\nThe trailer does not do this game game justice. I have owned a quest since release, and skipped over this title many times . My mistake!!! At about 3 hrs in, I am hooked, and just waiting for my quest to charge, so I can dive back in. The storyline is as engaging as the gameplay itself. If you are a fan of puzzle adventures, this is a MUST HAVE for your collection.\nP.S. I've paid twice as much for games that only took a couple of hours to finish. Great bang for your buck.\n\nHelpful | 0", "DrBanana30Jun 8 at 8:34 PM\nMind blowing\n\nI mean actually mind blowing this game is the most confusing and incredible game its countless illusions, puzzles, and illusion puzzles.\n\nHelpful | 0", "dinomine3000Jan 31 at 4:08 AM\namazing puzzle game\n\nthis games story its amazing and the puzzles are awesome. when you think you cant stop the story (because you discover something bad) you stop it. i havent played the extra levels because of the saving feature. i finished the game, only to exit and not having anything saved (i forgot, oops) but i will be getting that back. the loading time is also quite long, but coatsink must have its reasons\n\nHelpful | 0", "jadiaconuMar 23 at 11:33 AM\nVery nice game\n\nA must buy on Quest.\n\nHelpful | 0", "Hex2906Mar 12 at 3:04 PM\nNo Words\n\nSome people made this. I want to remember all of their names.\n\n- Homer\n\nHelpful | 0", "adamdaxuspriceMay 4 at 10:37 AM\nOne of the best Quest games yet\n\nI loved this game. LOVED IT! Puzzles upon puzzles, and a story that actually made me a bit emotional at the end. You'd think that the same sort of puzzle over and over again would get boring, but each level they added a twist to it to make it unique and fresh again. And then you towards the end they start messing with gravity and it gets awesome!!!\n\nThe game is also family friendly, with no jump scares or tense moments that can put younger players off. It's just a wholesome story, with a great ending.\n\nThis game was worth every penny I paid for it and then some. I'll be watching for more games from this developer.\n\nHelpful | 0", "rae999Mar 24 at 6:40 AM\nOutstanding\n\nIntricate well crafted story. Outstanding visuals. Unique spatial puzzles. Well done.\n\nHelpful | 0", "FreezingToadJan 25 at 7:24 PM\nRiveting story and fun puzzles\n\nIll firstly say that the puzzles were fun. I love puzzle games and this was my first VR one. Not too challenging, but just right in my opinion. And the story...as you progress you want to find out more of whats happening. The ending was exactly what I wanted to happen and made it all worth it. 10-of-10 for sure!\n\nHelpful | 0", "valkarie42Jan 27 at 5:11 AM\nShadows\n\nSome of the puzzles are difficult to get to work. A lot of times the game kicks me out of the play area after I move, leaving me to try to walk around the room trying to get back in. Sometimes the play area is outside my guardian so I have to go back to Shadow Point and go back in, or go out of the game all together. This doesn't happen if I walk using the slide motion, but I don't like doing that too much because it makes my eyes hurt.\n\nOther that that, this is a fantastic game with a great story and challenging puzzles.\n\nHelpful | 1", "RobertAllenPayneJan 13 at 3:04 PM\nI love it and I hate it\n\nI love this kind of game. Actually I love this specific game. Which is why it just kills me that the one flaw in this game basically prevents me from playing the game all the way though about 1/2 the time. Regardless of how you put the game down to walk away, about 1/2 the time when you come back your only options are New Game or Quit Game. The games ability to reliably store your progress seems entirely hit or miss. If I just take the headset off and walk away, sometimes I can pick back up where I left off and sometimes there is only the New Game option. When I try to carefully exit the game, and am asked are you sure - your progress will be saved and I say yes, half the time its good and half the time my progress is lost. And heaven forbid your oculus loses tracking for a minute. Your game is gone. I was at the final encounter and boom. Game lost. Ive played the game through probably 10 or 12 times. And Ive started the game probably 20 to 24 times. This should be simple. Once you hit a way point, the game should save. Theres no need to ask me if it should save. It should just save. And if something goes wrong, the next time you come into the game it should just load your last way point. In the last three days Ive tried to play through the game 4 times. And only got through it once. Would totally be a five star game except for this.\n\nUpdate - Dev reached out and asked me to contact them on Discord. Sigh.\n\nSorry folks, I dont discord. If we cant deal with this over email, then thats even more of a strike against.\n\nEveryone has email. You have to have it to sign up for anything these days. But it is silly to ask customers who are having issues to let us help you on discord, or Facebook, or twitter, or whatever the next thing is. You have to meet your customers where they are. Not try to pull them into your own special little universe. Leave that for the VR. If the Devs need to keep track of issues on Discord servers, then they can handle that on their own. But no. No discord.\n\nHelpful | 14\nDeveloper ResponseJan 14 at 3:07 AM\n\nHi RobertAllenPayne, sorry to hear that you had issues with Shadow Point! Our QA team is currently looking into this. Feel free to reach out to us on info@coatsink.com. We'll be happy to help.", "DankMemeMasterJan 18 at 4:09 PM\nFantastic puzzle game\n\nI went into this game blind, and as soon as I got to the first puzzles. I was disappointed, \"the puzzles are just lining an object up with a frame?\" I thought, \"This is going to get old quickly\". But I liked the story and was curious where it would go. Then the puzzles kept getting better and better, with new worlds being added, and new puzzle features making that simple concept more fun. The story was amazing and really kept me motivated to do more puzzles. For the price, it's a fantastic value. I urge everyone to try it out if you like puzzle games at all, with a great story to back it up.\n\nHelpful | 1", "KazzrJan 29 at 11:19 PM\nGreat\n\nThis game is a must-have on Quest. The story is entertaining and the complexity of the puzzles is just right. Add to that great visuals and immersive music and you're on for several hours of an adventure that will leave you satisfied.\n\nHelpful | 0", "spriggen_theifFeb 14 at 3:25 AM\nAmazing\n\nThe game is amazing along with the plot that really can pull at your heart stings. Sure at some points it can get dizzy but all in all a great game.\n\nHelpful | 0", "globberlokJan 10 at 4:34 PM\nFantastic all around\n\nThis game is fantastic in every area. Hours of interesting, challenging puzzles, each level bringing new and exciting mechanics of play.\n\nOverall image quality is great, and gives a very surreal experience in a world of fantasy.\n\nThe story was by far the best part. Its constant twists and turns are wonderful and mind bending.\n\n10/10 would recommend\n\nHelpful | 1\nDeveloper ResponseJan 13 at 3:27 AM\n\nThanks for the fantastic review, Globberlok! We're happy to hear that you had fun with Shadow Point.", "s-ynthJan 22 at 3:14 PM\nBetter than expected\n\nI was expecting it to have simpler puzzles, story and to be shorter but I was completely wrong. The story is very nice, places are beautiful (for Quests capabilities) and puzzles are challenging but not blocking. It also contains some puzzles that reminds me of Portal, one of my favourite games. If you like puzzles, surreal places and a good story this game is a must.\n\nHelpful | 5", "theoryofeverywhereJan 24 at 9:38 AM\nSave bug\n\nI played the game for about an hour, getting through the second area. I then go to quit the game, notifying me the progress will be saved. I get to the title screen and there is no continue option. I read about other people having issues with their saved games as well. I find this unacceptable, hence the one star review. The game is an easy 4 stars, probably 5 if the game would save properly. Are there any resolutions here?\n\nUPDATE: I played through the entire game (except for the Mansfield Puzzles) by never exiting the app. Sure enough, after I beat it, back at the title screen after the credits rolled there was no Continue option. I thought the game was pretty easy so I wanted to try the extra puzzles but I would now I have to go back and redo all of the normal and moon puzzles in each level to access them. The developer response below was not helpful. This save issue is common enough that it should not be ignored!\n\nHelpful | 6\nDeveloper ResponseJan 22 at 12:48 AM\n\nHi mattkrems, please enter the level and go where you stopped playing. You should be able to continue from there.", "AMiller42Jan 5 at 7:20 PM\nExceptionally Unique Game\n\nThis game is one of the best (and one of the only) vr titles Ive played. The puzzles get pretty difficult as you get farther in the game, but once you figure them out, its so satisfying. I accidentally did a couple levels out of order, but with the way that the game bends time and space, it actually worked quite well and the storyline still felt cohesive. This is one of the only vr titles to give me a headache, but in the best possible way.\n\nHelpful | 1", "robvanhooseApr 15 at 7:07 AM\nA great puzzle with intuitive interface\n\nThe game has a long initial load; that threw me off but on the flip side I found it much more stable than many. Ie no jerkiness or signs of loading happening and making tracking jittery. If this is the trade off then its a win.\n\nThe tutorial was brief and simple. If youve played anything in VR before, all the controls you expect are there. Very short and easy to take in.\n\nGame play is pretty intuitive. You search small areas for objects and clues then solve shadow based puzzles. Its fun and the story is engaging. Definitely recommend and I wish Id gotten it sooner.\n\nHelpful | 0", "oli70Apr 9 at 2:10 AM\nNice game\n\ngets boring with the time...\n\nHelpful | 1", "Demon-76Jan 14 at 11:43 AM\nFun Puzzles with a few glitches\n\nVery much enjoyed the game. Found a few bugs in the Pendulum section and after completing the main story line. A bit frustrating as you dont know if you are just not solving the puzzle correctly or there is a problem with the game. Had to deal with a good bit of stomach upset with things being inverted and such, but just let the game rest (and me too) and came back to it the next day. Hard to stop playing, however, as the story line draws you in. Actually got emotional when I saw the body on the bed. Keep these games coming!\n\nHelpful | 0", "junger2000Mar 3 at 11:31 PM\nGood but not exciting\n\nGraphics are good but not exciting. Having the puzzles absolutely spelled out for you makes progression easy but not particularly challenging. Being in a strange world all alone is a little weird.\n\nHelpful | 0", "ApddragonJan 8 at 2:30 PM\nExcellent use of hardware/technology\n\nMy girlfriend played through this game in its entirety and, as someone who does not play many games, loved it. The music, level design, and overall story were very satisfying for the both of us, making the game an easy recommendation. Great tech demo for what the Quest can do.\n\nHelpful | 1\nDeveloper ResponseJan 9 at 3:45 AM\n\nHi Apddragon, thank you for the review. We're happy to hear that you both enjoyed playing Shadow Point!", "exploshawnJan 9 at 2:15 AM\nWorth playing if you enjoy narratives\n\nPretty good game, it has a pretty touching story and unique gameplay with a very satisfying ending the bonus moon objectives make for a nice extra challenge as well. My only real complaint is with most objects you cant really change the side your holding it from which means some puzzles cause you to hold your wrist at an awkward position which is fairly annoying but overall a great game,\n\nHelpful | 1", "FireProphetApr 10 at 3:46 AM\nAmazing\n\nI was worried at first but then I played chapter one and immediately fell in love with this game the puzzles are great the story is great the graphics are great! And there is so much more that is amazing so what is the point of this review you are reading this most likely because you are thinking of buying it let me get straight to the point buy it it is so worth it\n\nHelpful | 0", "TurboBoarDec 25 at 11:25 PM\nKids game\n\nDespite having an A list of actors doing character voice overs, this game seems to offer little mystery in terms of solving puzzles. The first 15 minutes was placing objects against projected light to fill a gap with the shape of their silhouette's shadow in order to unlock the next stage of the mystery... again, and again, and again... You are prompted right away where to stand and you cannot even pick up random objects lying around rooms or spaces, so it's very elementary to figure out that the only mobile thing will be a lever of some kind.\n\nPerhaps fun for kids or parhaps it's just me who doesn't find puzzle games on the Oculus very challenging. But having already tried Red Matter and I Expect You To Die this one definitely doesn't match up to the level of intrigue of those titles, and since they were refunded, this one is going back as well. Also, the graphics are far from mesmerising.\n\nI adored playing Moss, however, and if there is a sequel to that I will definitely buy it, so I do have an inner child and I do like a puzzle come to think of it.\n\n\n\nHelpful | 10\nDeveloper ResponseJan 6 at 3:10 AM\n\nHi TurboBoar, sorry to hear you didn't enjoy Shadow Point. The first level introduces one of many mechanics in the game. As you progress in the game, puzzles get more and more complex.", "ism1Dec 5 at 8:38 PM\nOutstanding\n\nIm ashamed of myself for waiting this long to review this, one of the my favorite games.\n\nAs others have noted, it has a great atmosphere and engaging story. The puzzles gradually increase in difficulty, and there are certainly some mind-benders eventually, particularly involving gravity and mirrors. Its also quite long compared to other Quest games. I played it in approx hourlong bursts or more over several weeks, sometimes putting it down to think through a puzzle or play something else, but always returning.\n\nI loved entering a new room & just looking around and taking everything in at my own pace. Growing up loving the puzzles in games like Zelda, it was amazing to stand in rooms like those, freely moving around and figuring out what to do.\n\nShadow Point will forever be one of the best gaming experiences Ive had, and I thank the developers (and Sir Patrick Stewart) for their outstanding work.\n\nHelpful | 3", "IcySlayerJan 4 at 9:31 PM\nVery entertaining!\n\nUnexpected pleasure from this game when solving puzzles. There was a little motion uneasiness but switched to stationary and it went away. Sometimes clues are not visible so get stuck at times but still had a nice time. Patrick Stewarts narration is spot on. Made the game more enchanting.  enjoyed very much!\n\nHelpful | 1", "JimZMDec 16 at 1:06 PM\nbeautiful graphics, clever puzzles\n\n(played for 1 hour so far)\nThe environments are very beautiful. Patrick Stewart's narration is beautiful. The controls are intuitive. The puzzles are much too easy, and only start getting interesting after an hour. The game is very linear (in where you can go) and limited (in what objects you can interact with), and yet it isn't obviously so, leading to many disappointments. For example, most objects can't be picked up, and switches that look like they should work often don't work (and don't show any visual/audio feedback). The story is a little confusing (am I the Patrick Stewart voice?). The girl in the castle is not very real (doesn't seem to care much about my presence). There's an ever-present pair of foot prints below me, which is quite useless and is a distraction, and yet the floor circle indicating the center of my play area is often hard to find (only shows up when I'm almost directly looking at it) and therefore quite useless as well. Overall, most of the value I get from this game is from the beautiful environments and occasionally hearing Patrick's soothing voice.\n\nUpdate:\nThe puzzles are good, and has a Portal vibe...\n\nUpdate:\nWow..... This is a great game...\n\nHelpful | 2", "june.simpson.794Feb 15 at 3:16 PM\nShadow point\n\nTook a while to understand the game but Im finding it very interesting now. Clever really!\n\nHelpful | 0", "Happy-BeeApr 10 at 5:44 AM\npromising but...\n\ndue to the way the puzzles needs to be solved, picking objects and standing in certain specific points and angles, i find it hard to rely on teleportation for movement. so many times i had to use the locomotion to move around... and thats where the trouble began. this game made me motion-sick! its a shame because i really wanted to enjoy the game and the story...\n\nHelpful | 0", "andythwApr 11 at 6:42 AM\nVery involving\n\nI bought this on offer because I had read good things about it. The introduction contained a lot of information to take in. The initial loading sequence seemed a bit long. The puzzles although simple in concept really drew me in to the game.\n\nHelpful | 0", "DdefinMar 15 at 10:54 AM\nFun but a bit random\n\nArtistically it could have more creativity its themes and mechanics\n\nHelpful | 1", "GravityMxNov 29 at 6:54 AM\nVast and beautiful\n\nThis game is absolutely amazing with it's story telling. While other games force you to sit down and listen to a long monologue or read a bunch of text, this game cleverly told you about its world while you are doing puzzles or though the items and settings it presented you with. This made every step of the game a joy to play through. The games writing is also different from any other game I've played. In games like undertale or the original Paper Mario their was mainly one overarching story with a bunch of little stories for each area. While this game has something to say about each area, it almost all circles back to the main story. This makes the world see you very real and fleshed out.\n\nThis game also had some great gameplay. It all revolves around casting Shadows, but that is far from all you are doing. Most puzzles revolve around one or more game mechanics that the game gives you and ending with casting a shadow. This kept the game feeling very fresh. I also thought that it had a fair amount of challenge. Nothing too crazy like spending almost an hour on one or two puzzles, but definitely not so easy that I'm just breezing through it. The base game supports a solid six to seven hours of gameplay. But, the game also has a fair amount of replay value. There are a few extra puzzles in each area that one done unlock something. I don't want to spoil it, but let's just say it had me over the MOON. Doing all of the extra puzzles will result in some amazing world building and character Revelations, as well as an extra 2 or 3 hours of gameplay.\n\nOverall, an amazing experience that there is way more credit than it's getting.\n\nHelpful | 12", "thobodDec 18 at 4:09 AM\nReally cool experience\n\nFairly long story for a vr game, spent almost 3 hours and im just halfway trough. Though puzzles all have the same kind of lay out, they are really enjoyable, and most of them arent too hard. The characters are really well played, which neatly puts the entire experience together.\n\nThe only thing i really missed was an option to have multiple saves, my quest is regularly used by family members, and the lack of this feature means that they will have to wait untill i fully complete my playthrough.\n\nAlso, with smooth locomotion, forward should be relative to the controller, not the headset. It can be really nauseating looking to one side while moving, because your momentum changes unexpectedly.\nNot a big deal in this game though, teleporting also works fine.\n\nHelpful | 0", "CannedOlivesDec 9 at 5:59 PM\nPhenomenal\n\nThis game alone makes me feel like the Quest I recently purchased was more than worth it. The movement and controls are intuitive and fluid. Although the graphics are heavily stylized, its one of the very few games Ive played that has moments that absolutely take your breath away and make you glad to be alive. The storytelling is done masterfully and the narration and voice acting is amazing. The soundtrack is so full of mystery and wonder. I would buy the soundtrack in a heartbeat if I could find it. This is by far the best VR game I have ever played and actually one of the best non-VR games Ive played. Highly recommended to absolutely anyone and everyone.\n\nHelpful | 2", "AtrinaxDec 15 at 5:13 AM\nMagnificent experience\n\nMysterious story, great puzzles (except gravity ones), magical soundtrack and the narration by Patrick Stewart is superb.\n\nShed a manly tear at the end (more like a couple of them actually).\n\nHope my girlfriend will enjoy this experience the same as I did.\n\nHelpful | 2", "noam.gordonJan 19 at 12:12 PM\nGreat game marred by comfort issues\n\nAn original, well-designed, well-presented, captivating, and enjoyable puzzle game. While it was pretty easy (almost too easy) pretty much all along, including the bonus \"lab\" levels, it was still satisfying (and not too short). I think that the puzzle mechanics and elements are great and not utilized to full potential. I will gladly buy and play a DLC expansion, assuming that it will contain more challenging levels.\nMy main gripe about the game, though, is with comfort issues. While it is possible to get by using teleport exclusively, it is much more natural and immersive to move using the thumbstick. However, it is poorly implemented. I would expect more at this stage of VR game evolution. First, movement commences and stops abruptly with no initial acceleration/deceleration. This is very nauseating, at least to me. Devs should look at how smooth locomotion is done in other games, e.g. Daydream's Eclipse. Second, there is no vignetting/tunneling option. This could help immensely without disturbing gameplay.\nAll in all, recommended.\nUPDATE: Regarding the developer's response below, I was initially puzzled. How could have I missed that vignetting option?? Indeed, it is there in the menu! Well, I guess that I did try it at the beginning, saw no effect, moved on, and totally forgot about it. The issue is that the effect is very sublime - barely noticeable even on the highest setting. Unfortunately, it is also ineffective at improving comfort. Walk Speed is another barely effective setting, with the abrupt acceleration being the main source of discomfort in the game.\nOn a more positive concluding note, I'll say that despite the comfort issue, I loved the game and had a lot of fun with it. I also forgot to mention that Patrick Stewart did a superb voice job which added a lot to the experience. Well done!\n\nHelpful | 1\nDeveloper ResponseJan 17 at 4:22 AM\n\nHi noam.gordon. Thanks for your review. There are vignette options in Shadow Point. Please take a look at our guide on comfort options here: https://www.youtube.com/watch?v=QBSyZmTGgRQ&t=1s", "karla.pelletierJan 11 at 1:27 AM\nLoved this game!\n\nSuch a great game! I loved the story, the magical world and the awesome puzzles. Please make more games like this soon! Can't wait!\n\nHelpful | 0\nDeveloper ResponseJan 13 at 3:28 AM\n\nThanks for the review, Karla.Pelletier. Please take a look at our games Esper and Esper 2 if you're looking for more puzzle games to play.", "Aqua-VRDec 25 at 2:17 PM\nHidden gem\n\nMany hours of top quality content, it isn't short like other titles. I think it's the best puzzle game on Quest so far. Very high production value as well. The first level is easy but it picks up quickly after that\n\nHelpful | 0", "krxskyDec 23 at 9:03 PM\nBeautiful puzzle game\n\nI really enjoy the puzzles in this game. It feels so nice when you solve something or suddenly get it. Sometimes, the controls are a little bit buggy (ie. teleport gets stuck), but overall the game is awesome.\n\nHelpful | 1", "zack.slotkowskiJan 19 at 1:31 PM\nBeautiful\n\nAwesome experience so far. Love the puzzles and keeps me coming back for more.\n\nHelpful | 0", "Mark-BlissJan 26 at 8:38 AM\nDifferent and fun\n\nAnd enjoyable slow paced game with lots of tricky puzzles which are fun to solve\n\nHelpful | 0", "RedHornet101Dec 2 at 1:13 PM\nAmazing!\n\nThis was one of the first games I had bought on my quest and as the quest was my first Vr headset I wanted a quite relaxing game.\nI am so glad that I bought shadow point as it has amazing narrative, the puzzles are simple yet difficult and it is all made better with the narrating voiced by Sir Patrick Stewart.\nThis is an amazing game that I think is a must have for the quest.\n\nHelpful | 1", "abelinkJan 11 at 6:39 PM\nLoved it\n\nStarts off easier but quickly gets much more complicated. Pretty long VR game, nice story, and fun.\n\nHelpful | 0", "EletrunksJun 10 at 2:11 PM\nHorrible\n\nMade me feel sick to my stomach after playing ten mins of this.\n\nHelpful | 0\nDeveloper ResponseJun 18 at 6:29 AM\n\nHi Eletrunks, sorry to hear that you were experiencing motion sickness. We have uploaded a guide that may help you (increasing the vignette and switching to teleport only is very helpful) https://www.youtube.com/watch?v=QBSyZmTGgRQ", "athousandyearswideNov 15 at 11:59 AM\nAbsolutely beautiful\n\nShadow Point is a little treasure of a game. With an intriguing story, soft soundtrack, beautiful visuals, and fantastically designed puzzles, this game kept me enthralled for weeks. There were even times when I'd take breaks after solving one puzzle and sit down to enjoy the view and listen to the music.\n\nCoatsink, you've created a brilliant work of art. Please keep on making games.\n\nHelpful | 3\nDeveloper ResponseNov 28 at 2:54 AM\n\nHi athousandyearswide, thanks for your stellar review!", "unqDec 14 at 2:32 PM\nThis is a good puzzle game\n\nThis is a good puzzle game. I am not talking about VR experience. It would be as good on PC.\n\nPuzzles:\nPuzzles are great, evolves, some of them require out of the box thinking, difficulty grows. Game is not very difficult, but it's not super easy neither. Some puzzles are harder and optional.\n\nGraphics: I like it. See a trailer.\n\nUI: Inventory is not intuitive. Every available item you found is in your inventory. Did you throw it away? It's in your inventory. Is it laying under your feets? It's also in your inventory. Do you hold it in hand? Yes, it's in your inventory as well. This is very handy: you don't need to move around to found the item you droped somewhere and don't really remember where. But it's presented as a backpack, and backpacks don't work this way ...at least my does not. It super confusing at the beginning of the game, if nobody explained it to you, so you if you are reading this: you are welcome.\n\nPlot: who cares?\n\nHelpful | 2", "Moxis787Dec 26 at 10:13 PM\n\nAbsolutely love this game. Magical and fantastic. My only regret is waiting so long to finally buy it!\n\nHelpful | 1", "k405wizardDec 3 at 12:48 PM\nNice Experience\n\nThis is a nice experience in a beautiful surrounding where solving of riddles lets you progress through the story. The interaction mechanisms are explained in the beginning. Overall a nice game that I can recommend.\n\nHelpful | 1", "UDontHaveMyNameNov 25 at 6:12 PM\nVery creative and hearfelt\n\nI really enjoyed this title. I only took off 1 Star because for one reason or another I didnt want to finish the last 25% of the game. I just didnt feel like the emotional reward would be worth it.\n\nThat said this is a great puzzle title and you can really tell there was heart put into it\n\nHelpful | 0\nDeveloper ResponseNov 28 at 2:53 AM\n\nThanks for your review UDontHaveMyName! The last part of the game reveals more about Edgar Mansfield and the events at Shadow Point Observatory. If you need help with the moon puzzle don't hesitate to reach out on Discord. discord.gg/coatsink", "Mschief007Feb 26 at 12:55 PM\nSounds cool but lame\n\nBoring .\n\nHelpful | 1", "wikidangerNov 9 at 11:01 AM\nEnjoyable but a little buggy\n\nDecent puzzles, not too challenging but enough to give you a pang of satisfaction when you crack them. Story is enjoyable, good voice acting all round. One very frustrating bug where you can get stuck \"outside of play area\", forcing you to restart the level, which is frustrating when it keeps happening. Developers site mentions it but doesn't seem like there's plans to fix it, which is disappointing given how frequently it occurred for me.\n\nHelpful | 4", "NinJunDoOct 7 at 2:54 AM\nGreat Puzzelgame, nice story, good value\n\nIf you like puzzels this game is well worth the prize. It has a good amount of content for a 20 VR game.\n\nONLY THING I want to complain about is that the game forces you to stay in one specific spot during cutsence, If you try to move only a little bit outside your circle, the screen fades to black. THATS BULLSH!! IT Takes you completely out of the story and reminds you hey you are in VR, right when you don't need it at all. A circle in the floor as recommendation would have been enough. I was really disappointed that I couldn't get closer to the characters and felt like an uninvolved observer dispite VR. I think done right, VR has the potential to make you feel part of the world around you, with the characters being like good friends you really care about. This game misses this opportunity by making you a silent protaganist locked in a glass Box.\n\nHelpful | 14", "AntySocialDec 24 at 8:23 AM\nPretty epic\n\nPretty epic\n\nHelpful | 3", "FanTaz1986Nov 10 at 10:15 PM\nWow\n\nThis game is great, story is so good i cried, and game play is realy good too, last levels was realy rewarding to solve, and best part you have extra hard moon levels, it took me about 5 h to done story and few more for moon ones\n\nHelpful | 2", "GlowBoxJun 14, 2019 at 8:57 PM\nMagical experience.\n\nYou've probably read many other positive reviews at this point and they're all correct in their praise of this title. So instead, here's a fun and brief story:\n\nMy 68 year old father, visiting for a birthday, had never played any \"video games\" of any kind and always regarded them a waste of time, money and energy. He's a avid Star Trek fan, so they way I reeled him into trying this I told him it as narrated by Patrick Stewart. That tiny bit of celebrity endorsement perked him into putting \"that stupid box\" on his face, and I also stated if he didn't like it I'd stop playing video games for the rest of my life. Now my father agreed to it with a big smirk on his face while putting on the Quest for the 1st time.\n\nI handed him the controllers, and helped him through a few basic tutorials. After about 10 minutes he had completely forgotten about everything prior and was totally immersed in what he described later as a \"lucid dream\" (As having never tried any VR, obviously)! I helped him through the first hour figuring out the shadows, puzzles and other interactive elements.\n\nAll of my hopes for his experience came true! I sat next to him outside my 6x6 play area and watched, as I live and breath, my father as he smiled, laughed, waving hands, asking me questions, etc. Over the afternoon and evening he finished the game.\n\nI quote my father, \"That sure as hell wasn't a video game! Hahahooo! Are there any more things like this?\"\n\n10/10\n\nHelpful | 773", "ET3DOct 10 at 1:59 AM\nWould have loved some Coatsink humour\n\nI'm not far into the game, but so far I find it a little frustrating. I'm sometimes not sure if I don't understand what to do or I'm just not holding the objects right.\n\nAlso as a fan of Coatsink from their Oculus Go games, I'm missing the humour that can be found in They Suspect Nothing and Esper 2. Much as I respect Patrick Stewart, the gravitas that he adds feels to me out of place, or at least against my preference for more lighthearted games.\n\nThe game does have the Coatsink graphical signature, with good looking colourful art and nice touches of details.\n\nAll in all, it doesn't dethrone Esper 2 for me as my favourite Coatsink game, but it looks like a decent game and thankfully I've yet to encounter a bug (Esper 2 had a couple of annoying bugs).\n\nOne small thing that did bother me was the main menu, where I always worry that I'll select something else instead of 'continue'. I would have liked to have some more space between the options. (And I'm never sure why 'new game' is present in such an accessible place in the first place, something that many other games do.)\n\nHelpful | 2", "redalert33Oct 18 at 7:51 AM\nBEST game on Quest, period.\n\nThis game has hours and hours of content, especially if you try to 100% it. You basically twist and turn objects in order to get their shadow to line up with an outline on a wall, in order to complete the puzzle. Starts simple, but gets VERY complex. Incredibly rewarding when you spend so much time on a puzzle and you figure it out. I would give this game 10 stars if I could. There are some other solid puzzlers on Quest, but for me this was a fantastic experience, rivaling some of the best console games I've played through the years. Note: The story is ok... it's cool that Stewart provides the voicework, but this is really all about the puzzles.\n\nHelpful | 4", "Ivanator2May 23, 2019 at 7:14 AM\n\nIm a first time VR user and went straight for this game. I have never experienced such a unique puzzle game that leaves me wanting for more. The VR experience within a puzzle world is awesome. Not sure how long the game is but i hope its a long one. I will pray that the devs make more content and longer hours of play! Good job people.\n\nHelpful | 73", "BADCanonNov 16 at 2:34 PM\nExcellent Game\n\nThis game is worth every penny. Clever puzzles and excellent use of VR to tell a tale of wonder and mystery, loss and hope. Highly recommend.\n\nHelpful | 0", "Symon_231Oct 19 at 8:17 AM\nWe need more of this\n\nThis is the kind of game that VR needs right now. Fair price for a fair amount of gameplay hours.\n\nThe puzzles are easy enough to solve yet challenging so that you don't feel you are just placing objects around. Some of them require some proper thinking others are just meant for you to get the hang of it. The puzzles feel progressive and slowly increase in difficulty.\n\nThe mechanics are solid and well implemented. I was particularly impressed about the portals and their implementation which feels flawless. I loved their use in the game and how they make sense in the theme of the game.\n\nThis is overall a must play even if you don't like puzzles, if you do then you are gonna love it even more. Graphics, atmosphere, music, acting, puzzles and mechanics all work together so well. Thanks for the incredible game and well done.\n\nHelpful | 1", "BDrangedNov 21 at 8:35 PM\nFun game\n\nWasnt too short, fun puzzles dealing with perspective and casting shadows. Worth the money and time.\n\nHelpful | 0", "DrFathomNov 13 at 10:46 AM\nGood game.\n\nInteresting puzzles and pretty to look at.\nLong playtime for the cost, compared to a lot of other Quest games at the same price (or higher).\n\nHelpful | 0", "richardsayerDec 27 at 1:43 PM\nUgh motion sickness\n\nWaited too long to try the game and exhausted the 14 day return window. The game gives me really bad motion sickness and I cant get a refund. Bummer.\n\nHelpful | 0\nDeveloper ResponseJan 6 at 3:08 AM\n\nHey richardsayer, sorry to hear that you are experiencing motion sickness. In the options, you can slow down the movement speed, increase the vignette or change to teleport only. For more comfort options please watch this video https://www.youtube.com/watch?v=QBSyZmTGgRQ&t=1s or reach out to us on Discord! We're happy to help you. discord.gg/coatsink", "chiquita.barrazaOct 4 at 8:04 PM\nGreat game if you can navigate bugs\n\nThe teleport in this game is so glitchy it's almost unplayable. I'll teleport into walls instead of where the indicator was on the floor. Sometimes to the point I have to restart levels. Using the freedom of the quest to combine 360 degree movement and some walking with the teleport for large distances is just impossible in this game, which also effects immersion.\n\nOtherwise, it's amazing. Patrick Stewart is always wonderful in every way, puzzles are innovative and require time to figure out, but in a good way, and the story is intriguing.\n\nSuper sad it just doesn't work better, best I've gotten out of it was slightly frustrating sessions mingled with game breaking bugs that made me unable to finish the game.\n\nHelpful | 8", "Noti0NSep 15, 2019 at 7:19 AM\nGreat Puzzles - Needs to Share\n\nThis game is very well done and engaging. If you are into puzzles I strongly suggest purchasing this game. I would have given it 5 stars if it supported mulitple players - My family purchased the expensive Quest, but we are unable to share the VR for games like this because if my family plays the Shadow Point game, it can only be from where the last player progressed.\nThe lack of game sharing is a major flaw in Facebook/Oculus software strategy. As expensive as the Quest is, enabling families to share would extend the adoption - Most other games on consoles have at least 2 or 3 data save files.\nOculus, for games you ought to include the requirement for multiple user data sets.\n\nHelpful | 14\nDeveloper ResponseSep 23, 2019 at 6:30 AM\n\nHi Noti0N, you can restart levels by pressing the big red button on the teleport machine. This way you don't have to restart the whole game if someone else wants to play it.", "jpayanoNov 5 at 12:36 PM\nSo far my favorite VR game\n\nChallenging and mysterious, great graphics and leaves you mind blown. I do wish at the end it would explain the storyline a bit, just so customers arent left with any questions\n\nHelpful | 0", "ornerybuddhaSep 26, 2019 at 6:20 AM\nBeautiful and poignant\n\nThe story was completely captivating. The world is beautiful and engaging. By the end you'll find yourself drawn into the puzzles as you try to understand what happened and if it's possible to help Lorna escape this world. I was even a little choked up at the end. Highly recommended.\n\nHelpful | 2\nDeveloper ResponseSep 30, 2019 at 1:32 AM\n\nHi ornerybuddha, thanks for your review :)", "calforbSep 16, 2019 at 2:45 PM\nWow\n\nI am amazed by this game. Great story and great puzzles. I wish that more of the object not connected with gameplay could be interacted with as it would make the game even longer trying to figure out the correct objects. Also the bow and arrow in the 3rd level if Im correct?! please add the ability to pick it up and shoot some of this sand bags - even if its just for target practice.\n\nOverall 9/10. One of the first one the quest and I cant believe Ive waited this long to download it.\n\nHelpful | 4\nDeveloper ResponseSep 23, 2019 at 6:27 AM\n\nHi Calforb, thanks for the review. During development, we realised that making items interactable which are not used for puzzles added more confusion to players. This is why you can only interact with objects that are needed for puzzles.", "ceasetraceOct 14 at 8:01 AM\nBest game experience on quest\n\nFrom story telling to game play. This game never let me down. Wish there was more quality games such as this one. For the price it an excellent game. My number one rated game.\n\nHelpful | 2", "steve-01351Oct 30 at 1:53 PM\nFrustration....\n\nI've no idea at all how to get out of that first room - or even how to retrieve things from my backpack. As it stands now, I just paid $20 to watch a tutorial that didn't tell me much of anything.\n\nHelpful | 5\nDeveloper ResponseNov 5 at 3:37 AM\n\nHi steve-01351, you have to pick up Edgar Mansfield's journal which you can find on the desk. You can open your backpack by pressing the A button on your right controller. If you need more help, please reach out to us on Discord: discord.gg/coatsink", "CasualCheetahSep 11, 2019 at 10:14 PM\n\nA charming and artistic puzzle game that's tied together by a sincere story with themes that speak to my fears of age, purpose, and isolation. Even though the puzzles take a while to develop and a few elements could use more intuitive introductions, later mechanics wonderfully deceive the unique perspective of VR. It's in these moments of creativity that Shadow Point, with its stirring plot and whimsical settings, distinctly conveys the visceral nature of its medium.\n\n(Despite the game's aptitudes, it's difficult to ignore how a saving error tarnished the experience for two of my friends. Both of them lost all of their progress after playing large sessions. From what we could tell, leaving the game by quitting directly to the Quest's home created the bug.\n\nAdditionally, the game frequently placed each of us into vast and unnegotiable 'return to play area' states. This was fixable by quitting to the hub with minor progress loss.)\n\nHelpful | 5", "MobileNPCOct 20 at 9:29 PM\nPotentially 5 star game\n\nThe game could be really amazing if not for a few fatal flaws. First - there is only one save file. VR Devs in general are under some illusion that VR is only played by one person. That's a big fail. Second - there are tracking issues that come up. I get booted to a black screen and told to move back to the play area, which is now out of my boundary line. There are occasional times where the game just freezes as well.\n\nFix those things and I would give this 5 stars.\n\nHelpful | 10", "CornyCobDec 25 at 9:13 PM\nThat voice!\n\nSir Patrick Stewart voice guides you through your journey, what more can you ask ;)\n\nHelpful | 0", "bmo22Aug 23, 2019 at 1:15 AM\nWhite loading screen kills me\n\nIt's a truly amazing game, everything is positive about it but what really disturbs me is the white loading screen. I think I'm the only one who has this problem but that bright light for that long period of time almost always ends giving me a headache. I have blue eyes and I'm quite prone to headaches, so if you are the same as me, you've been warned! (buy the game anyway, but while it loads just take the headset off)\n\nHelpful | 5", "TheMettaurSep 5, 2019 at 10:34 PM\nWonderful Narrative Puzzler\n\nBefore I gush, I have to say, many of the puzzles were needlessly frustrating. The main style of the puzzles is holding up objects to create shadow puppets, basically. However, the object's orientation in your hand is locked; what I mean is, whenever you pick up an object, no matter what direction your hand is facing, the object will always snap around as if you picked it up directly looking at it. This means that for many puzzles, you have to hold your hand at an awkward angle to get a shadow right, and you'll find yourself twisting your wrist and holding your hand uncomfortably for minutes just to get the right angle. I wish the game had more of the innovation from the later puzzles in the early sections, so it relied less on twisting your hands around.\n\nThat said, this game is like just stepping into a beautiful fantasy world. The art is wonderful, the character models are a little weak but they are used somewhat sparsely and the art for the world is just gorgeous. The story was a little incomprehensible to me at first, I was rushing through and not paying much attention to the dialogue. But, just like with figuring out the puzzles themselves, all the twists and turns in the plot start to fit together towards the end. Make sure you clear all of the puzzles, even the extra ones. This story moved me much more than I ever expected. I love Finlay, and everything about him just made me cry. Oh yeah, be warned: if you are sensitive, or easily moved by stories, this one might just make you drown your headset! The biggest reveals/twists at the end definitely got tears flowing from me, especially when the beautiful credits song kicks in.\n\nOverall, some slightly frustrating but overall very manageable puzzles, a beautiful world, and a moving and even thought-provoking story make Shadow Point easily one of the best experiences on the Quest (and Oculus in general) that will ever be made. In a sea of shallow narrative-driven experiences in VR, Shadow Point prevails.\n\nHelpful | 5", "Zimtok5May 20, 2019 at 12:04 PM\nMagical combination of puzzle and story\n\nA lovingly detailed journey which gave me summery, indie vibe like that of Firewatch; but with a flair of more magic and science. The intro by Sir Patrick Stewart fits the game well and the introduction is truly lovely. Not beaten it yet but what I have played is masterfully crafted. The score emanating from a particular box nearly brought a tear to my eye. I dont hesitate to recommend it.\n\nHelpful | 200\nDeveloper ResponseMay 23, 2019 at 3:38 AM\n\nHey Zimtok5, we're happy to hear that you enjoy Shadow Point :)", "cookstar5596Aug 24, 2019 at 1:29 AM\nGood. Would have been great. But bugs\n\nI really like this. It was entertaining and puzzles challenging. This would have been great except for the constant bug of when I left the play space and tried to get back I just couldnt get back, so I had to quit the game and go back in which meant having to start that section again. With this bug happening multiple times a session it was very frustrating and took the shine off the experience. Apart from that bug it was ok game worth the money spent.\n\nHelpful | 11", "larry_legendSep 5, 2019 at 5:31 PM\nWonderful\n\nI was initially on the fence about this since there wasnt much buzz about the game, not a ton of hype or high on those lists when youre looking for your next purchase. Ive had my quest since launch day and just picked up shadow point the other day. I highly recommend it. Think Resident Evil 7 shadow puzzles minus the psycho family chasing you. Patrick Stewarts awesome narration, a lively colorful world, great puzzles that really make you think and the satisfaction of solving the tougher ones are well...satisfying. Im so glad I gave this a chance.\n\nHelpful | 0", "brasiliansoxfanSep 16, 2019 at 1:26 AM\nOkay story, Great puzzles\n\nOn the narrative end, it's lacking in originality and effective storytelling. Even though the voice work is on point, it's a challenge to feel emotionally invested. It does however succeed in giving a lengthy campaign with a large variety of challenging and fun puzzles to complete\n\nHelpful | 0", "jpeeziousAug 27, 2019 at 9:29 PM\nAmazing\n\nJust blown away. Challenging and rewarding puzzles in a magical experience. This was my first download after Vader immortal. While that was great, this is more of a true game with some real challenges to overcome! The puzzles are really well designed and dont get repetitive. Mix in just a pinch of portal and you cant go wrong with this one.\n\nHelpful | 1", "Lokvar79Oct 16 at 3:00 AM\nCrazy experience!\n\nOne of the games you cannot miss in Oculus experience!\n\nHelpful | 1", "CharpieJul 19, 2019 at 8:50 AM\n\nClearly the one of the best games available on quest in my opinion.\nI mean ... the puzzles, the beautiful environments, the voice acting, and the stellar use of non euclidean geometry as a storytelling tool ... just incredible.\n\nI just wish they would let us lean a bit more over ledges before blacking up the screen...I love exploring ^^\n\nHelpful | 6", "IIEarlGreyIISep 1, 2019 at 6:30 PM\nAmazing Story, Though A Bit Buggy\n\nThe story of this game is something that I will remember for awhile. The voice acting, the visuals, the feeling of the game. Yeah, it's going to stay with me. It was a nice long game that was challenging without being frustrating.\n\nI was a bit disappointed that every puzzle was a shadow puzzle. Every puzzle. I guess from the trailer and from what I had heard I assumed there would be more types of puzzles, and constantly lining up shadows did get old about midway through. Luckily the last third of the game they introduce some new mechanics which make the same types of puzzles seem way more interesting.\n\n\nBut there are a few bugs that really almost ruined the experience for me. The game somewhat froze up several times, which is REALLY confusing in a puzzle game. The first time it happened I stood in a room for about an hour before deciding to restart my game and it turned out a door didn't open when it should have. And every time I encountered a well I had to restart as well. Even worse was this created an atmosphere of \"did I do that wrong, or is it just glitched again?\"\n\n\nThat being said, it's such a beautiful game. I might even replay it. I still have to recommend it.\n\nHelpful | 1", "paul.bache.98Sep 16, 2019 at 6:43 AM\nHow do I save the game\n\nIts a great game but every time I switch on my quest it never saves from where I last left the game and I have to start all over again- HELP\n\nHelpful | 1", "ashfrj77Aug 10, 2019 at 4:14 AM\nAmazing\n\nThis is such an amazing game, actually an amazing experience full stop. The use of light, gravity and parallel worlds is so inventive. The Quest is my first exposure to VR and Shadow Point is the first game Ive played to completion. A perfect match. Thanks to the production team for doing such a fantastic job!\n\nHelpful | 3", "SadactAug 10, 2019 at 8:36 AM\nCharming and atmospheric\n\nThis is a lovely little game. It's not little in the sense of 'small' - there are many puzzles over different, themed levels, and it'll take you a good long while to solve all of them - but little in the sense of feeling intimate and personal rather than loud and brash. The puzzles are pitched mostly difficult enough to take some deep thought and be satisfying, but not so hard as to be frustrating and bring you to a halt for hours. (The makers are doing a series of walkthroughs on YouTube now too, so if you're totally stuck you're not, you know, totally struck.) If you're after something on the Quest that's engaging, absorbing, but the very opposite of frantic, then Shadow Point fits the bill wonderfully.\n\nHelpful | 1", "s-m-nAug 9, 2019 at 2:58 AM\n\nI love adventure games and myst like puzzles are my favorite. Too bad this doesnt feel like a place to explore and solve misteries: you find puzzles scattered around and you solve them. The puzzles themselves are nice and original, but all of them use shadows and reflections making them feel repetitive. Overall a good game but I didnt really get into it.\n\nHelpful | 5", "farbluestarSep 30 at 6:26 PM\nGood game but\n\nGraphics can be little better. My big problem, however, is alignment is really awkward to achieve. My arms hurt :)\n\nHelpful | 3", "RedSpeedsAug 8, 2019 at 6:22 PM\nPure magic\n\nThis game is so amazing. The story was touching so much even that at the end I let out a tear the puzzles where extremely fun however there is 1 level that wasn't much fun it was the pendulum moon level as it was extremely difficult getting the items thru the compass perhaps you could find a more elegant way to do this. But everything else was amazing\n\nHelpful | 0", "CoachDavidJul 30, 2019 at 10:11 AM\nTo The Motion Sensitive...\n\nFirst, let me say that it took me three days to complete these mind-bending puzzles. They were unique and original and wonderfully themed. At each step in the game, I was amazed at the depth and creativity involved. There was also a learning curve that allowed me to evolve with the game so that, at the end, I knew exactly what the creators were asking of me. Then, to take those challenges and immerse the user into such a beautiful and interesting world... when it ended, I wanted to stand and applaud. One reviewer said this game gave them chills and I remember privately rolling my eyes. Then that moment in the game came... and I got chills. I privately apologized.\n\nNow, I am extremely sensitive to motion. Even casual movement causes my vertigo to go haywire so I read the reviews and watched the suggested videos and they didnt help me understand what to do, so I had to undergo the dizzying task of experimenting myself and this is what I learned: Use the Teleport Only setting and the Snap Turns setting. This will eliminate any sense of motion and allow you to fully explore this magical world.\n\nThis was easily the best $20 Ive ever spent.\n\nHelpful | 6", "NickMajoraAug 15, 2019 at 10:17 PM\nSuperb Puzzler\n\nI would describe Shadow Point as the best quality per hour game on Quest (took me 8 hours to 100%). It's an atmospheric story-based puzzler narrated by Patrick Stewart. It's very good and also the only game I felt I didn't pay a 'VR Tax' on.\n\nHelpful | 1", "Toothless_Aug 25, 2019 at 4:36 AM\nJust magical\n\nIm not finished yet but I still already wanted to review this wonderful piece of art!\nBeautiful story, awesome puzzles and the fact that the bird reacts when you pet him is absolutely heart-warming <3\n\nHelpful | 0", "teddelerAug 4, 2019 at 9:10 AM\nBuy this now!\n\nI am a lover of puzzle games and VR. This is the best one I've played so far to combine the two. The environment is beautiful. The storyline kept my interest, pulled me forward, and brought a (small) tear to my eye. The puzzles were delightfully twisted while not being so difficult to make me give up in frustration. All in all an awesome experience. Please make more.\n\nTwo (very small) quibbles:\nMore than one person uses my Quest headset. It would be nice to be able to save more than one game at a time so they don't have to wait for the one person working on the game to finish it before starting a new one.\nAt the end, with the beautiful music playing during the credits I thought it would have been cool if it was more like a music video, showing scenes from throughout the game, instead of just the static scenery.\nBut these are just small quibbles. Awesome job, well done. More, more, more! :)\n\nHelpful | 0\nDeveloper ResponseAug 5, 2019 at 2:00 AM\n\nHey teddeler, thanks for the review. In the hub, press and hold the red button on the left side of the portal machine for the chapter you wish to reset. You can only reset a chapter once the main puzzles within it have been completed. This way another player can play the level that you just finished :)", "Darchangel3Jul 4, 2019 at 1:20 PM\nCouldn't get enough of it!\n\nI practically blazed thru this game in 5 days. I did get stuck rather quickly after the first hour. As with certain puzzle games, sometimes you just have to put it down, walk away and return fresh. You can sit or stand, which might help to take a different perspective if you feel lost. It's always a joy when visuals, tone, great storyline, superb voice acting, evocative music and challenging puzzles come together as one and invite you to keep going for more! Hats off, Coatsink. MOAR PLZ!!!\n\nHelpful | 4", "vrabbitsAug 3, 2019 at 12:48 PM\nMade me cry\n\nI love this game so much!. It has that perfect flow that I've never seen before In a game! The ending made me literally cry. And the entire storyline made me get the weirdest goosebumps feeling. It's so good and just long enough that you dont get tired of it. Would definitely recommend this game as it's the best on game on the quest and I would know I uave every one available atm. Please make another one developers!!\n\nHelpful | 0\nDeveloper ResponseAug 5, 2019 at 2:01 AM\n\nHey vrabbits, thank you so much for the review! Very happy to hear that you like Shadow Point.", "xmap12Aug 6, 2019 at 10:03 AM\nGreat game , but it gets a bit trippy\n\nThe game has a very interesting concept and requires a lot of experimentation and thinking. I enjoyed the scenery and the game play mechanics. But certain levels messed me up a bit and I dont get nausea very easy . The levels involved the room to rotate and you had to use gravity to orientate objects . The rotation really gets you as your floor is the walls and you walk on the ceiling . But everything falls away from your point of gravity . Its really jaunting and takes you out of the game. I havent beaten the game yet but I keep going back because its really good . The story is a bit co fusing as you pop back in and out of time steps but the premise works and just needs some fine rooming. And the walking animation as well as the teleportation animation needs some work and didnt help with the nausea thing. I wouldnt recommend this if you get car sick easy but if you can handle the mechanics and movement issues its a really great and beautiful game thats long enough and challenging enough to make it worth the cost.\n\nHelpful | 2\nDeveloper ResponseAug 8, 2019 at 1:53 AM\n\nHi xmap12, did you try switching to teleport only or did you increase the vignette? These options help a lot if you're experiencing motion sickness. Check out our video for more comfort options, I am sure you can enjoy Shadow Point even more after adjusting the settings :) https://www.youtube.com/watch?v=QBSyZmTGgRQ If you have more questions, please reach out to us on Discord. discord.gg/coatsink", "AlabasterSlimSep 9, 2019 at 11:29 AM\nFantastic Experience!\n\nA fantastic mind bending experience from start to finish. If you like puzzle games this one is for you!\n\nHelpful | 0", "Grimlock_ArtsJul 28, 2019 at 12:53 PM\nLove it!\n\nI really enjoyed this game. The look and feel of the environments, the storyline, the clever puzzles! Just a great experience! I enjoyed the pace of the game, I took my time, wasn't rushed, and enjoyed traversing the various environments. I managed to solve 100% of the puzzles and achieve the best ending (I assume there's multiple endings). Great job Devs!\n\nHelpful | 1", "CaptainFrostAug 7, 2019 at 3:44 PM\nMind bending puzzles and fantastic story\n\nI just finished playing Shadow Point. I have to say, it is one of the most clever and fun puzzle games that I have had the chance to play. I really enjoyed all the mechanics involved and the way they make you look at your environment super closely. In addition to that, the story is really well done and engaging, and I even had chills down my spine with how the ending came together.\n\nThe reason why I am giving four Stars instead of 5 is there are times -- particularly noticeable at the end -- where the frames drop/stutter because of how much is going on. It doesn't affect the experience too much because of the nature of the game, but it did occur while I was playing through it.\n\nHelpful | 0", "TheSwirlingBrainJul 24, 2019 at 9:49 PM\nMind bending puzzle adventure game\n\nI really enjoyed this game and liked that it had a satisfying ending. Play is like trying to pick up things and cast a shadow to match the outline displayed. Sometimes you really have to think since depending on mirrors or lenses it can make the situation and objects be different. The story is trying to find and save a little girl that disappeared and throughout the game you catch up with her and she talks to you sometimes. There's also her pet bird that you can pet. Neither the girl or the bird really help you out, tho, you're sort of on your own to figure out stuff. The game is challenging and makes you really have to put on your thinking cap but I managed to get thru the whole game without cheating so try your best to figure it out and you can do it but if you can't I'm sure you could find a playthru on youtube! When moving around I found that it could make me sick but if I used \"transportation\" it didn't make me sick, so try the transport method of locomotion if the other sliding method makes you sick. I'm glad I bought this game and I feel it's a must buy if you like puzzle adventure games.\n\nHelpful | 1", "EdigsJul 11, 2019 at 7:47 AM\nWonderful game\n\nWow, what can I say. This is such an amazing title and probably my favourite VR puzzle/adventure to date (on PC or mobile VR).\nFor starters, it's just beautiful to look at. Colours are dreamy and the world is a joy to explore. I sometimes just pause, look around and marvel at beautiful surroundings. Each new world surprises me with different colour palette. Just another example of how number of polygons and special effects don't matter if the style is good.\n\nStory is fantastic as well (though I haven't finished it yet). Great storytelling and the game really grabs you once you realise what's going on. Beautiful and a bit bitter sweet (at least that's my impression of it so far).\n\nAnd last, but not least, puzzles. Main mechanic is very interesting, but I thought I'll get tired of it soon. I was wrong! Devs found a way to keep puzzles fresh with additional twists to shadow casting in every chapter, making them more challenging with some out of the box thinking. Love them!\n\nOne of the highlights from Quest launch selection. Really, really recommend it and I hope we'll get more games like this on Quest.\n\nHelpful | 2\nDeveloper ResponseJul 12, 2019 at 2:01 AM\n\nHey Edigs, thank you so much for the review! We're very happy to hear that you had fun with Shadow Point :)", "neepsandtattiesDec 31 at 11:18 AM\nFantastic experience\n\nI really enjoyed this game. The mechanics are great, as well as the plot and the atmosphere.\n\nHelpful | 0", "mattman6886May 22, 2019 at 12:56 PM\nWonderful Game!\n\nExcellent puzzle adventure game with a simple yet beautiful art style and great visuals. The production values are really excellent all around and of course it doesnt hurt that its narrated by Sir Patrick Stewart. A huge THANK YOU to the devs for doing a live stream of the game which led me to winning a key to download it. But that of course does not affect my review and I wouldve most definitely paid full price for this one!\n\nHelpful | 18", "DeclannHayessJul 16, 2019 at 4:33 AM\nIncredible\n\nAn absolute joy to experience from start to end. Fantastic level design with a perfect learning curve, so many different puzzle variations to keep things fresh and keep you on your toes, a deep and mind bending story that constantly made me want to push forward and a beautiful art style to accompany it along the way. Coatsink really nailed this one, and I am so excited to see what comes next from them! Cannot recommend this enough for puzzle fans or just anyone looking a neat VR experience; even novice puzzle players will have an amazing time because it does such a great job teaching you the mechanics and never fails to make you feel smart! \n\nHelpful | 1\nDeveloper ResponseJul 16, 2019 at 6:51 AM\n\nThank you DeclannHayess!", "GregMadisonJul 8, 2019 at 6:13 PM\nA dream come true\n\nWhen I was a teenager, I was dreaming of walking freely in the world of Myst in order to interact my self with the contraptions. I can't thank you enough for this incredible moment I spent up there. There is so much mind bending mechanics, that was delightful.\n\nHelpful | 2", "NoWhereMan1019May 22, 2019 at 8:19 AM\nMust play launch title\n\nShadow Point is a fantastic puzzle game with some of the best visuals I've seen on Quest yet. The visual style is perfect for the limited hardware and it runs great. Really clever puzzles and voice acting by Patrick Stewart make this a must play!\n\nHelpful | 15\nDeveloper ResponseMay 23, 2019 at 3:39 AM\n\nHey NoWhereMan1019, thank you for your review! We're happy to hear that you enjoy playing Shadow Point :)", "flurpbossJun 15, 2019 at 6:33 PM\nIs there a 6 star option?\n\nWow, this game is amazing!!! The time and detail put into the art, puzzles, and story is CRAZY. it was so heartfelt, never been so emotionally involved in any game as much as this one. By the end of it I felt like I should be thanking the devs for taking my money and letting me play this game. Seriously great job.\n\nHelpful | 11", "ZoggerJun 7, 2019 at 2:20 PM\n\nA really good puzzle game with some clever puzzles that are not so difficult as to be annoying but difficult enough to be fun.\n\nAt first I was a little disappointed because of the lack of physical interaction with most things in the world and the main game mechanic seemed to be lining things up. In some cases this exposes the limitations of the quest's tracking and it can get frustrating to hold things in the correct position.\n\nHowever these issues quickly diminished and as the game progresses the puzzles quickly become more interesting, and in places particularly later on it's quite reminiscent of games like monument valley. The use of tricks like impossible world geometry is definitely worth experiencing in VR.\n\nI did find in a couple of places I had to reach quite far to get things into the right place or to grab them out of places, which may present a challenge for people with shorter arms or people with physical disabilities.\n\nI have reached the end but still have two of the 'moon' puzzles to solve so will be going back to work those ones out.\n\nUpdate: I've changed from 4 to 5 stars because I discovered the bonus puzzles that I didn't even realise existed. I thought I was done with the game and there's a whole couple of hours extra I had missed. I would guess a lot of people may think there are only 9 levels and put the game down without noticing the bonus ones.\n\nThe seated mode mentioned by the developer helps with some things but there were sections that involved gentle throws that were a bit frustrating to get right. Overall just a minor issue though.\n\nHelpful | 6\nDeveloper ResponseJun 4, 2019 at 4:32 AM\n\nHey Zogger, thank you for the review. When you go to options and then click height mode, you can choose between seated and standing. This way we wanted to make sure that everyone can enjoy Shadow Point. If you have difficulties picking up items, try to recalibrate or redraw the play space if the game is telling you that you've moved too far. We hope this helps. Thanks for playing and good luck with the last two puzzles!", "Branden1111Jul 24, 2019 at 11:34 PM\nSimply amazing\n\nWhen I think of this game, it feels like one of the better chaoters of my life. I wouldn't be surprised if I confused the realms in this game for memories of my life when I'm on my deathbed.\n\nHelpful | 2", "NinjaMonkeyMarkJul 5, 2019 at 6:50 AM\nEngaging Story. Great Puzzles.\n\nShadow Point walks a fine balance of challenging the player with complex puzzles without spoiling the experience with frustration. The game does a wonderful job of guiding you and training you how to use its mechanics without holding your hand. The narrative is solid and pulls you through each section. A joy to play from start to finish. Im looking forward to this developers next offerings!\n\nHelpful | 0\nDeveloper ResponseJul 8, 2019 at 7:05 AM\n\nThanks for the review NinjaMoneyMark!", "qvaLarssonMay 23, 2019 at 11:42 PM\nBeautiful, good audio, missed opportunit\n\nDisclaimer: I havent yet played the full game, and I will finish it, if my oppinions have changes by then, I'll update my review.\n\nAlright, so the games audio first or all especially the voice acting, might be the best Ive heard in a VR title. The art style is so beautiful as well, I could just spend so much time in this visual style. On the technical side, it works well as well, the interactionsystem is for the most part flawless, I just wish I could turn some levers with two hands as well. The physics in this game is also top notch, and the performance is super smooth, no hick ups what so ever. What I just mentioned brings three stars alone. Also, the inventory works flawlessly, it only tracks the currently relevant items, which makes inventory manegment so easy.\n\nAlthough, when it comes to gameplay, it seems like the main mechanic isn't that thought out, even though I know what to do, it's annoyingly difficult to match the shadow LITERALLY EXACTLY to the patterns, and that gets more difficult with when you have to match two objects at the same time. Additionally, nothing BUT the puzzle objects are interactible, not even physicobjects that move when I throw a ball at them, that's pretty immersionbreaking.\n\nWith that said, I will finnish the game, and update my review if my oppinions change.\n\nUPDATE:\nPlayed a lot longer, and the main mechanic has for sure grown on me, I still think it can be annoying sometimes; it's many times you've in theory solved the puzzle, but you got to manage to hold that object still. Which, wouldn't be so bad if I could pick up the object anywhere I wanted, but currently every object has anchored points which sometimes are not really in your favor. Also, I really miss that I cant pick up and play with non puzzle objects. And to end my update on a positive note, the story is really good! :)\n\nHelpful | 25", "GhostfpvJul 3, 2019 at 7:43 AM\nAmazing!\n\nSuch a great game!! I love puzzle games but the voice acting, story line and emotional connection in this one bring it to a new level! Bravo!! After a quick how to in game you are straight into it. The swapping back and forth between times and mirrors are simply magical!! I had to do them all several times more than I needed to cause its so cool and trippy at the same time. I felt sad\nleaving each level for the next one! Come for the puzzles stay for the amazing story and voice acting! An absolute must buy!\n\nHelpful | 0\nDeveloper ResponseJul 4, 2019 at 1:32 AM\n\nHi Ghostfpv, thanks a lot for the review. We're happy to hear that you enjoyed playing Shadow Point.", "PurplemikeyJun 26, 2019 at 9:57 AM\nMost beautiful puzzle I ever played\n\nFirst few words really should be the following...\nI rarely play puzzle games and I am not liking this kind of game on flat screen... I didn't knew if I was going to like it or not buying it. But the arts are so beautiful I felt like I needed to see this in VR. And the devs... Such a great team! I watched them on live stream and they answered all my questions... I left not to spoil myself and bought the game.\n\nVisuals : this is one of the many strenght of the game. It is gorgeous and is the best style of arts to fit the Quest. Not trying to be realistic... so it is more immersive because all you see around is from the same art style. - not like watching a cartoon world on a flat tv in real world.\n\ngameplay : the puzzles aren't THAT hard to solve... (you even have hints - that can be turned off) but they are so brilliant! Still require some thinking to resolve them though. I don't want to spoil you but this is a game that can only happen in VR because of the mechanics and it is simply amazing...\n\nReplayability : I'd say close to zero since it is a puzzle game... but maybe if you take a few weeks off and try it again and turn the hints off! and there's an alternate ending (haven't tried it so I can't talk about it yet).\n\nOverall : I'd buy this game again. Love it and pretty sure you will enjoy it too!\n\nHelpful | 1\nDeveloper ResponseJul 4, 2019 at 1:34 AM\n\nHi Purplemikey, thanks for watching our stream and playing our game. Feel free to join our Discord server if you have more questions about the game: discorg.gg/coatsink", "HorkthaneJun 3, 2019 at 7:22 AM\nLike the first time I played Myst\n\nI do still remember the first time I played Myst. A buddy of mine had a computer with a CD-ROM, and he showed off this incredible new game that caught on like nobody's business. It was gorgeous and it showed off what CD-ROM could do. But beyond the stunning multimedia presentation were some rock solid and devilishly clever puzzles.\n\nShadow Point is taking me back to that. It makes clever use of impossible geometries and dream worlds, and being in VR utterly immerses you in it. And while you might come for the art style and Patrick Stewart's dignified narration, you'll stay for the puzzles.\n\nPuzzle games are hard. They often end up being too easy, or requiring you to think just a little too exactly like the guy who came up with it. Now Shadow Point has some filler puzzles. It doesn't go as far as Braid where there are virtually no repeats. But it does quickly get into new mechanics and new solutions, as well as some wickedly clever head scratchers.\n\nThere are one or two puzzles I'm slightly dissatisfied with, as I don't feel like I found the \"correct\" solution, instead opting for an agility based solution of just chucking items where I wanted them to go. But who knows, maybe that actually was what I was supposed to do. Just felt a little wrong.\n\nI guess in closing, this is one of the best puzzle adventure games I've played in recent memory. Up there with Talos Principle, Braid and The Witness. Highly recommend it if that's your thing.\n\nHelpful | 3", "LordMoonJun 22, 2019 at 10:36 AM\nFantastic! Worth every minute\n\nAbsolutely fantastic game. Great storyline, challenging & well thought out puzzles, and beautiful all around. Amazing VR experience - the world created is very suited for VR interactions. And surprising amount of gameplay. Took me quite a while to beat the game. If you're a puzzle enthusiast, get this.\n\nHelpful | 2\nDeveloper ResponseJun 24, 2019 at 7:45 AM\n\nHi LordMoon, thanks for the review. We're delighted to hear that you enjoyed playing our game.", "hperrinJul 2, 2019 at 11:15 PM\nFantastic Puzzle Game\n\nThe worlds are very immersive, and the storytelling is fantastic. So many cool puzzle mechanics. If you like escape room kinds of puzzles, you'll love this game. I just beat it today, and I'm sad that I won't get to play it anymore. It really does feel magical.\n\nHelpful | 0", "LftsyAug 8, 2019 at 4:19 PM\nA nice and real video game\n\nI cannot see how you could not like this fancy video game that last a while\n\nHelpful | 0", "ueadianJun 1, 2019 at 9:41 AM\nAmazing\n\nReally amazing game overall. The graphics left me giddy and looking around like a child sometimes the screenshots do not do it justice. The story was amazing, the puzzles were a bit finicky sometimes but overall challenging and fun. Steal of a deal for 19.99 compared to other games I've brought.\n\nHelpful | 3", "Ommmm_2486Aug 12, 2019 at 8:06 PM\nGreat game\n\nGreat graphics, story and puzzles!\n\nHelpful | 0", "tuismJul 15, 2019 at 5:32 AM\nOne of the better story titles\n\nGreat voice acting, great mechanics, a great head-scratcher, with a surprisingly well-written, directed and narrated story. A hidden gem on the level of Virtual Virtual Reality!\n\nHelpful | 0\nDeveloper ResponseJul 15, 2019 at 6:24 AM\n\nHey tuism, thanks for the review!", "earthberthSep 23, 2019 at 4:56 PM\nBest game on the Quest so far\n\nShadow Point will keep you busy for quite some time and the game rewards you with a lot of great content and crazy ideas which show the magical potential of VR at its best.\n\nPro:\n- great puzzles\n- great story\n- great voices\n- great graphics\n- great immersion\n\nContra:\n- sometimes you glitch out of the play space even if you dont leave it\n\nHelpful | 0", "pagey935Jun 4, 2019 at 5:39 PM\n\nFinished the game. Voice work excellent. Really liked the story and how it all wrapped up. Puzzles were very good also but I suspect I glitched through one of the early ones. I have a large play space and occasionally it would tell me I had left the play area when I was still in the middle. Only minor issues though. Overall, my favourite VR game in quite a while. Looking forward to the next Coatsink release!\n\nHelpful | 2", "CliipJun 16, 2019 at 7:41 PM\nShadowy Puzzles - Brilliant Storytelling\n\nHeading into this game I knew there would be puzzles and narration by Patrick Stewart. Then you become completely invested as a compelling story develops. The various locations you visit are imaginative and capture a real sense of scale. Suddenly you get caught up in some time travel and inter-dimensional gateways. The portals produce an effective illusion of a cohesive world rather than the usual segmented levels and hub world. The puzzles start off simple and become progressively harder. They are broadly accessible but overall not too challenging, however very entertaining. As you solve more puzzles, you get more story dialogue and cut scenes that motivate you around every corner. Completing all the puzzles in each major section yields new extra areas with increasingly difficult challenges. A major story revelation occurs at the end of the game as a wonderful reward for completing all the extra areas. This yields a satisfying conclusion to the story which elevates the entire narrative. Given the endgame revelation and the anachronic nature of the story, the game surprisingly warrants a second play-through to fully grasp what truly happened at Shadow Point Observatory.\n\nOne negative  When moving using teleportation, it would on a few levels kick me out of bounds. It appeared to clip me out of the environment and suggest that I return to play area which was impossible. This mostly occurred when I would teleport through a portal in levels with multi-directional gravity (Pendulum). Hopefully an update will eventually fix this issue. Regardless, this game is absolutely worth the price of admission. This is a must-play if you are a fan of puzzle games.\n\nHelpful | 1", "GabeNewelIMay 26, 2019 at 7:15 PM\nFantastic game, needs of multiple saves\n\nI absolutely adore this game. I'm absolutely blown away how smoothly this place, and how good this looks on the Quest. I'm only on world 3, but so far the world, characters, and graphics ooze charm, and the story is pretty interesting. Sir Patrick Stewart's voice acting is phenomenal as always, and the rest of the cast is excellent as well. The shadow casting mechanic, and inventory system are extremely well done, probably the best I've seen in a VR game.\n\nI'm not sure how long the game is, but I could keep playing these puzzles forever. I really hope this isn't the last game of this type we see from the devs.\n\nI do have one major complaint though. We really need multiple save files, or at the very least a way to reset/replay levels! I really want to demo this game to my friends & let my SO play, but with only one save I don't really feel comfortable dropping them in halfway through the game.\n\nHelpful | 11\nDeveloper ResponseJun 4, 2019 at 4:33 AM\n\nHey GabeNewell, if you do wish to re-play the game at any point, once you have completed the chapter, you are able to press a red button on the side of your portal machine within the game. This resets the puzzles and cut scenes in that particular chapter.", "BenMusakMay 31, 2019 at 10:19 AM\nPhenomenal game\n\nThis game gets everything right: The music, characters, world building, puzzles, voice acting, interactions and much more!\nI would recommend this game for anyone who owns a VR headset, this is what VR story driven games should be, a new standard has just been set!\n\nHelpful | 3", "ryanallen_comJul 14, 2019 at 8:32 AM\nFun, great story, and great looking\n\nWhat a great game. It looks and runs great, the puzzles are fun and just challenging enough without being too hard, and the story kept me interested all the way through.\n\nHelpful | 1", "LiviaLeoJul 15, 2019 at 1:59 PM\nAwesome concept\n\nI love the concept behind this game but in reality, it didnt give me that WOW factor which is a shame. No doubt Ill continue to keep an eye out for other games Coatsink though!\nAlso, I have played countless VR experiences and games and never experienced motion sickness but this one left me tired, in bed and feeling sick after half an hour despite taking all the precautions to try and prevent it.\n\nHelpful | 5\nDeveloper ResponseJul 16, 2019 at 6:50 AM\n\nHey LiviaLeo, did you slow down the movement speed and increase the move fade? This usually helps players who struggle with motion sickness. We also uploaded a video that fully explains the comfort options in Shadow Point: https://www.youtube.com/watch?v=QBSyZmTGgRQ We hope this helps!", "JamesterCKMay 31, 2019 at 5:19 PM\nMy favorite VR puzzle game\n\nThis game was amazing! I knew it was a puzzle game before I started playing, but I was pleasantly surprised by the variety. Each \"level\" introduces a new puzzle type, which definitely keeps it interesting. I got stuck several times (and there are no full walkthroughs at this point), so it forced me to sit and think to figure them out. My biggest piece of advice to future players is, if you get stuck, take off the headset and relax. This is when I had my lightbulb moments and was able to get past the tough spots; it just took me taking a step back to see it. I was able to completely finish the game, which includes all of the moon puzzles and the very final (optional?) puzzles, in a few days. Can't tell you exactly how many hours, but it was definitely worth the price because it was so fun. The story was really interesting too. 100% recommend this game and look forward to playing more games from Coatsink.\n\nHelpful | 2", "poulsboJun 13, 2019 at 8:14 PM\nGreat AAA VR title\n\nSome VR games are fun BUT you feel like youre repeating the first five minutes of the game over and over. Not so with Shadow Point!\n\nShadow Point is a traditional adventure title that happens to take place in VR. Theres a story to piece together, great voice acting, variations in the puzzles, amazing environments. Looks great. Solid controls.\n\nSimilar in spirit to: Apex Construct, Farpoint, Red Matter, Torn. (But its not a shooter.)\n\nIf you like Myst  or MC Escher  you should check this out!\n\nMy favorite Quest game hands down.\n\nHelpful | 1", "Chris_StaceyJun 11, 2019 at 3:12 PM\nA very worthy story-driven puzzle game!\n\nSo glad I purchased Shadow Point. This is a very immersive and challenging puzzle/escape room style game with a beautiful aesthetic. It begins with simple brain teasers which teach you the mechanics, and then it gets harder (yet more satisfying) as you go along. The trailer almost doesn't do it justice - it becomes more like the game Portal, requiring four-dimensional thinking to solve each level. There's many hours of content and the quality of the story will keep you hooked. If you dislike having to use your brain too much you will hate it, otherwise a must purchase!\n\nHelpful | 2", "KingKarl1967Jun 13, 2019 at 7:07 AM\nExcellent game but needs a save system\n\nBrilliant game but not having the option to let other friends and family try it out after I have started my own game is a major problem.\nSo I am a fair way into the game and not being able to let new people try it out is crazy.\nIt's either start a new game and lose all my progress or not let anyone else try it.\n\nHelpful | 5\nDeveloper ResponseJun 14, 2019 at 5:01 AM\n\nHi KingKarl1967, in the hub, press and hold the red button on the left side of the portal machine for the chapter you wish to reset. This way you don't have to restart the whole game :)", "OathbinderJun 4, 2019 at 11:03 PM\nA Treat From Beginning To End\n\nI was in love the moment I started hearing Sir Patrick Stewart's narration. The twists and turns of the puzzles and story kept me entertained with a smile on my face and scratching my head from start to end.\n\nIt was a blessing to step into Alex Burkett's search for answers at Shadow Point Observatory. Between the mind bending puzzles, beautiful environments, and heart melting every time I crossed paths with Lorna really helped me feel like I was a part of Illyria and the observatory.\n\nAll in all, fun romp from start to finish with excellent storytelling and amazing puzzles. I can't wait to see what's next from everyone at Coatsink. Will definitely be looking out for your next title!\n\nHelpful | 4", "lucasdidthisJul 8, 2019 at 6:11 AM\nA magical experience for a good price\n\nOne of the most overlooked games for the oculus quest in my opinion: Nice story, clever puzzles, beautiful graphics and a superb job on the storytelling. A must have for sure!\n\nHelpful | 0", "err404Jun 10, 2019 at 7:10 PM\n\nWhat a wonderful game. It is filled with charm and magic. Sadly this is the first game on the Quest to give me VR sickness. Admittedly the first thing I did was disable all comfort settings, but freely walking is just too immersive to use teleportation. Dont take this as a negative. Comfort settings are available and well implemented. I would just rather spend a few days getting my legs.\n\nHelpful | 1", "piebootsMay 30, 2019 at 12:10 AM\nGreat Puzzels Confusing Plot\n\nAfter spending around 5 hours or more beating the game 100% Ive still got no clue what this game is about. Its some girl but she keeps getting older every stage and then you have to save her at the end. The way you save her from going through the portal is incredibly not exciting at all. Seems like a missed opportunity to me. I played all those hours for a 10-20 second ending that left me thinking seriously, thats how you stop her??\n\nAs for the gameplay, I can say I did enjoy most of it. Though trying to line up the shadows perfectly got a little annoying after a while, I feel like that could have been more user friendly especially if you have shaky hands. Also one gripe I had is literally nothing in this game is interactive unless its part of the puzzle, which is kind of a bummer. At least in the quests lobby I was hoping for some stuff. I cant come up with an example off the top of my head but there was a lot of times I was really wanted to interact with things, especially in the quests lobby, but its impossible.\n\nThere are many creative levels that really had my brain working hard and some levels that were pretty easy. It was a nice balance and I much enjoyed it. My favorite by far was the mirror that transitions into two words. It had me wanting more. Its quite a unique experience I havent had in VR.\n\nIn conclusion I really enjoyed the game but just wish I knew more of what it was about. Im sure if the price was a few dollars cheaper and the story was more clear I would be willing to rate 5 stars. If your into puzzle type games you should definitely check this game out. If its a story your looking for I would say pass on this one honestly.\n\nHelpful | 15\nDeveloper ResponseJun 4, 2019 at 4:33 AM\n\nHey pieboots, thank you for the review. The reason you can't pick up other objects is that we wanted to minimize confusion for the players as to how to solve the puzzles.", "Glass_breakerJun 24, 2019 at 12:14 AM\nA Professional Experience\n\nThis was my first VR purchase and it did not let me down. The puzzles are easy at first but gradually get more difficult and rewarding. The acting, story and music is fantastic. This is a great one to get lost in.\n\nHelpful | 2\nDeveloper ResponseJun 24, 2019 at 7:44 AM\n\nHi Glass_breaker, thank you for the review. We're happy to hear that you enjoyed the puzzles in Shadow Point.", "jeremy.deatsJul 8, 2019 at 9:01 AM\nWarning! This game has a save bug!\n\nHave played through over half of Shadow Point. Very polished game from graphical stand point. You will feel like you're in a Disney animated feature. The overall mechanic is to reposition lights and then use objects you gather in the game world to cast shadows on specific canvases. If that sounds like it gets old, well.. They do a pretty good job with the shadow puzzles but some are just annoying and others boring. My main issue with this game right now involves the design of the save mechanic. When you continue your progress from a save state at times you respawn near where you left off. At times you have to journey a bit to return... The developers made the decisions on how save would work for a reason, but I don't think inconsistency is ever a good thing. It sure has annoyed me every time I start the game. In fact, this ability to not just hop right back in has led me to avoid playing Shadow Point many times. I'll just pick another Quest title to play that I can hop right into without a lot of wasted time. In my opinion this is a design flaw that brings this title that would otherwise be a perfect five stars down to three. It's a pity, because it's such a small thing they could have done right.\n\nHelpful | 2\nDeveloper ResponseJul 8, 2019 at 7:04 AM\n\nIn the main chapters, Shadow Point saves automatically after each puzzle you solve. Should you quit the game, you might return to the hub but you will be able to access the area again by using the portal machine. It will then take you back and you can continue where you last stopped playing. It's different for the bonus puzzles at the end of the game. These puzzles will reset if you haven't finished them in one sitting. If you have more questions or need assistance, please join our Discord server. We're happy to help. discord.gg/coatsink", "JioxxJun 11, 2019 at 6:50 PM\nExcellent Puzzle Game!\n\nI haven't finished it yet but I've put in enough hours to give it a rating. It easily deserves a five star rating.\n\nThe puzzles are interesting and varied, and gradually increase in complexity and difficulty. The world is beautiful and pleasant to be in, and the artistic style is a perfect match for the Quest's capabilities.\n\nThe developers give you great control to balance comfort vs immersion. VR veterans like myself can explore the world in roomscale with full locomotion, while those who are just getting their \"VR Legs\" can comfortably play the game using teleportation.\n\nI don't know how long the game is, but I've put many happy hours into it and I still have several more areas to explore.\n\nThere are excellent launch games for the Quest like Robo Recall, Beat Saber, and Space Pirate Trainer that are deservedly getting a lot of press. Shadow Point is just as deserving of your time and money.\n\nUpdate: I just completed the game tonight after talking a week away from it. (One night I played too long when I was too tired and ended up with \"VR Fatigue\" for almost a week! My VR Legs weren't as strong as I thought. :D)\n\nI'm happy to say the game was interesting and innovative all the way to the end. :)\n\nHelpful | 3", "rikokunMay 27, 2019 at 10:21 AM\n\nThis is exactly my kind of game. Myst series are one of my favorite games and this reminds me of them so much. That and the Witness, but that seemed like myst homage as well\nMy only 'complaint' is that it's way too easy :) i want to find puzzles i have no idea how to solve only to figure it out half a game later and to go back to finish it :) Granted, haven't finished it yet. I just went through the mine area and i liked that you had to use one element in the scene two times to finish all puzzles. I hope there is more of that in later levels.\nThe story is intrieging, can't find out what happend.\nMore of thease please, i'll buy them :)\n\nHelpful | 5", "manbearpig7777Jul 13, 2019 at 5:12 PM\nBroken\n\nSo after it gets through explaining how to move it tries to go to the next part of the game but instead it just tells you to back to the center and where ur in the spot u can look down and tell ur in the spot it doesn't move past this point\n\nHelpful | 4\nDeveloper ResponseJul 15, 2019 at 4:09 AM\n\nHey manbearpig7777, I would really like to help you with this. Please make sure to be in the play space, you can also recalibrate the game in the in-game options (settings-height mode-recalibrate). Also, feel free to join our Discord server at discord.gg/coatsink. You can then reach out to our Community Manager Selina who will help you resolve this issue.", "DeadlyDestroyerJun 15, 2019 at 4:06 PM\nBest game on the Quest\n\nI've been interested in this game since getting my Quest and finally decided to pull the trigger. I regret not buying this game on day one. The simplistic graphics lend well to the system. If you are a Portal fan purchase this game right away.\n\nHelpful | 1\nDeveloper ResponseJun 24, 2019 at 7:47 AM\n\nHi DeadlyDestroyer, thanks for the review. Portal was, in fact, one of many inspirations for the game.", "Starship_HermitMay 27, 2019 at 12:55 AM\nWorlds of Wonder and Mystery\n\nI just completed Shadow Point, 100%, and I must say I enjoyed every bit of it. The narration, the artistic style, and most important of all: the puzzles.\n\nFrom start to finish (across a handful of sessions, an hour or so each), Shadow Point continuously introduces new and interesting twists on the core mechanic: shadow puzzles. I will not go into detail here, as I am a firm believer in exploration and discovery for oneself. However I must say, from the first puzzles to the very last, I was thoroughly entertained.\n\nIf you are looking for an adventure wrapped in a few layers of puzzles, and don't mind a good story along with it, I would highly recommend to you Shadow Point.\nWorlds of wonder and mystery await.\n\nHelpful | 6", "RashalduranJun 19, 2019 at 6:35 PM\nExactly the VR Experience Needed\n\nThis game is amazing - clever puzzles that are just difficult enough for pause but not roadblock. I loved the story and felt connected to Lornas tale. Worth every penny if you are a fan of puzzle games.\n\nHelpful | 1", "crazygirlie89May 30, 2019 at 2:54 PM\nGreat game!\n\nI have just completely finished Shadow Point!\nI love a good puzzle game and this one was really challenging at times!\nI bought it on launch day and so far it's still the only game I have bought for the Quest. I made a good choice. I highly recommend trying this one out if you haven't already!\nI like the inventory system! You don't need to physically carry everything with you, yet you can still access it from wherever you are.\nAs for bugs, I had a bit of trouble with one of the earlier puzzles where it didn't recognize that you lined up the shadows correctly, but looking at their Discord it seems like they are aware and it will be fixed in the next patch.\n\nHelpful | 2", "jaydel_birdJun 4, 2019 at 4:09 AM\nA Must-Play for any Quest Owner\n\nThey werent kidding when they said story-driven. Well done Coatsink for proving how fantastic games and virtual reality can perform as story-telling mediums. One of the best and prettiest VR experiences Ive played through in years.\n\nHelpful | 2", "bstenzel85Jun 14, 2019 at 9:24 AM\nVery fun and a Great Story\n\nLove the puzzles and freedom! For some reason I am getting motion sickness from some of the controller settings I configured, adjusting that made it better. Great game and immservoce experience!\n\nHelpful | 2", "L00kingGlassJun 16, 2019 at 1:50 PM\nA wonderful game\n\nI had a great time with his game. The otherworldly visuals and soundscape alone are worth checking out, but the story is also really compelling. I cant recommend it enough!\n\nHelpful | 2", "shannajo03Jun 16, 2019 at 10:54 AM\nChallenging without being frustrating\n\nI love this game. The story is very interesting, the scenery is beautiful and I have not gotten bored of the puzzles. Will definitely keep an eye out for more games by these developers.\n\nHelpful | 1", "FguillotineJun 13, 2019 at 3:55 AM\nI really love the game\n\nbut low resolution and not so good optimization is killing me. I'm sure that Coatsink can do it better, and Oculus Quest can perform better too. Please, make this game shine like it deserves.\n\nHelpful | 1", "theVRmangJun 18, 2019 at 12:02 PM\nMust own\n\nOnly question you must ask yourself is, do I like excellent games? If you answered yes, then purchase this game.\n\nWonderful puzzler adventure game.\n\nHelpful | 1\nDeveloper ResponseJun 24, 2019 at 7:46 AM\n\nHi theVRmang, thanks for the high praise!", "Actual_SaltJun 2, 2019 at 5:45 PM\nBest game Ive played on the quest yet\n\nThis is one of the games that just leaves you wanting more. The puzzles are inventive, the plot is interesting, and the ending is great. This game feels like a steal at 20, definitely a must buy.\n\nHelpful | 2", "ThankfulCarpJun 22, 2019 at 3:16 PM\n\nThe game was amazing but the story was even better. I got chills from some of the scenes.\n\nHelpful | 2", "hellaryJun 19, 2019 at 12:19 PM\nSuch a lovely game\n\nThis is really such a great game in VR and really feels like it was designed *for* VR. Highly recommended!\n\nHelpful | 1", "dale.thatcherJun 24, 2019 at 3:21 PM\nFantastic puzzler\n\nIf you like brain bending puzzles buy this game now.\n\nHelpful | 1", "Godislove4uJul 8, 2019 at 2:27 PM\nHaven't tried it yet but...\n\nWow the game seems really put together.I got to say God's Son who He sent because He loves mankind.It's Jesus and He is mankind's sole hope ! Jesus saved my life and soul...He is my Lord and Savior !\n\nHelpful | 1", "clclclJun 6, 2019 at 2:42 AM\nAtmospheric and clever puzzle game\n\nShadow Point combines great stylised graphics with a central puzzle mechanic that stays entertaining by adding twists.\n\nHelpful | 1", "CoveropMay 27, 2019 at 9:05 AM\nRelaxing game\n\nTake your time to enjoy it.\n\nHelpful | 3", "ocu_curiousJun 18, 2019 at 5:37 PM\nPuzzles Not Intuitive\n\nStuck on \"The Huntress\", have no clue what I'm supposed to be doing, game could be providing a bit more guidance, this kind of frustration is not fun, may not return to this game for more, leaves me wondering if Oculus gives refunds for this sort of thing.\n\nHelpful | 0\nDeveloper ResponseJun 19, 2019 at 4:19 AM\n\nHi ocu_curious, I'm sorry to hear that you find Shadow Point frustrating. Feel free to join our Discord server, I can then help you solve the puzzle. See you there! discord.gg/coatsink", "mikeukfan69Jun 20, 2019 at 9:58 PM\n\nSadly . I got dizzy while playing standing up. When I'm not squeezy any more i will try playing while sitting down .\n\nHelpful | 4\nDeveloper ResponseJun 24, 2019 at 2:56 AM\n\nHi mikeukfan69, did you try switching to teleport only or did you increase the vignette? These options help a lot if you're experiencing motion sickness. Check out our video for more comfort options, I am sure you can enjoy Shadow Point after adjusting the settings :) https://www.youtube.com/watch?v=QBSyZmTGgRQ If you have more questions, please reach out to us on Discord. discord.gg/coatsink", "muchamusedJun 22, 2019 at 10:41 AM\nCaptivating gameplay but technical issue\n\nI was enjoying the game until it became unstable(cutting in and out) and ultimately crashed. My saved game is now nowhere to be found.\n\nHelpful | 0\nDeveloper ResponseJun 24, 2019 at 2:53 AM\n\nHi muchamused, I would like to help you with this issue. Could you please join our Discord server and explain the issue to the best you can tell to one of our caretakers, please? discord.gg/coatsink"]