{"App Title": "Shooty Skies Overdrive", "App description": "Escape the arcade in Shooty Skies Overdrive, an action-packed VR shoot em up designed for Oculus Quest. Dodge and weave your way through dynamically generated enemy waves and blast them at point-blank range. An incredible journey through colorful retro worlds and ridiculous alien invaders. \n\n A room-scale BULLET HELL shooter experience, inspired by 1980s arcade RETRO classics.\n With your spare hand, snatch a POWER-UP out of the air to get the jump on your enemies. A CHAINSAW? A YO-YO? Is that a SHARK ON A FREAKIN STICK?\n Want to just chill in your armchair? Thats OK! Switch to CHILL difficulty and take it easy, couch potato.\n Want an extra challenge? Just switch the game difficulty to OVERDRIVE! (Nice knowing you BTW)\n But youre not done yet... Go back and fly challenging side missions to unlock an entire SQUADRON of diverse pilots.\n Shooty Skies Overdrive is cross-buy enabled for Oculus Rift and Oculus Quest.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Shooter", "Languages": "English", "Version + Release Notes": "1.02.66030", "Developer": "Mighty Games Group", "Publisher": "Mighty Games Group", "Website": "https://shootyskiesoverdrive.com/", "Release Date": "July 2, 2020", "Developer Privacy Policy": "BUY\nPRESS KIT\nCONTENT CREATORS\nCONTACT\nMighty Games Group Privacy Policy\n\nAt Mighty Games Group Pty Ltd (Australian Business Number: 98 164 842 933) (defined here as We or Our), We value your comments, suggestions and feedback. Our Privacy Policy sets out how we collect, use and disclose personal information and other non-personal information we have gathered about you in relation to our game Shooty Skies Overdrive, (Game which term includes the associated websites).\n\nBy using our Game, you acknowledge and consent to the terms of this privacy policy.\n\nThis policy will let you know:\n\nWhat information (often referred to as data) is collected from you;\nHow your information is used;\nWith whom your information may be shared;\nHow you can access, update, or delete your information.\n\nWe will comply with all relevant and applicable legislative requirements, and, in the event of any inconsistency, the legislative requirements will override the provisions of this document.\n\nUser Age Limits\n\nOur games and our website are not aimed at children under 13 years of age. Nevertheless, we acknowledge that our Game may unintentionally appeal to children.\n\nWe do not collect any personally identifiable information within the age gated part of our Game for children, nor do we intentionally direct interest-based advertising to anyone under the age of 13 years.\n\nIf you believe that We have inadvertently collected information from a person under the age of 13, please contact us at the email address below and the information will be permanently deleted. We do not permit bahaviourally targeted advertising to children under the age of 13 years.\n\nWhat data do we collect?\n\nWe collect data in three ways.\n\nData collected automatically;\nData you provide us; and\nData collected by our partners\n\nThe basis for collecting data is legitimate interest under GDPR (Global Data Protection Regulation) and to support internal operations of the game under COPPA (Children's Online Privacy Protection Act). Any data collected is done solely for internal uses that are reasonably and directly related to your relationship with Us, in accordance with the California Consumer Privacy Act (CCPA).\n\nA.Data collected automatically\n\nCertain data is collected automatically. This includes\n\nData about your game progress;\nData about your device, such as device name and operating system, browser type and language;\nData about your use of the Service, such as gameplay data and your interactions with other players inside the Service; and\nSteam User ID Hash that identifies the player in Steam if Steam is enabled for the user's account.\nOculus User ID Hash that identifies the player in Oculus store if Oculus is enabled for the user's account\n\nB.Data you provide us\n\nWe collect and store your email when you sign up for our newsletter, or where you nominate to specifically allow our games to collect your player name and your email. We will also keep your contact details if you contact us for a particular purpose.\n\nNewsletters Mail-Outs and Promotional Materials\n\nWhen you opt in to join our mailing list for the purpose of receiving our newsletter, we will use that to provide you with direct marketing communications about upcoming games, features or our websites and other events and promotions related to our products.\n\nYou many unsubscribe from our newsletter at any time. All you need to do is unsubscribe from the link in the letter, or let us know in writing that you want to be removed.\n\nIf you wish to receive promotional information, you will be asked to provide your email address to us. This information is gathered by a third-party partner that collects and compiles that information for us so that we may undertake mail outs to large numbers of people. The MailChimp Privacy Policy can be found here:\n\nhttps://mailchimp.com/legal/privacy\n\nC.Data we collect from our third-party partners.\n\nTo operate and manage our services we need to use third party service providers from time to time. A list of those parties can be found in this privacy policy The type of information we might collect from them includes:\n\nData we receive if you link a third-party tool with the Service (such as logging in via Facebook, or Google);\nDemographic data (to determine the coarse location of your IP address);\nData from platforms that the games run on; and\nData for advertising and analytics purposes.\n\nHow do we use the data we collect?\n\nData collected can be personal to you or non-personal, and sometimes data that doesn't appear to be personal can become personal if certain other facts are learned. No matter how we come to collect your data, we will always treat it in accordance with this document, and any applicable legislation.\n\nWhat is Personal Information?\n\nPersonal Information is information that identifies you as an individual. This is only collected by us if you submit it to us directly.\n\nPlayer Feedback\n\nIf you contact us with a comment or query, We keep a copy of any personal information you provide. This is so that we can respond to your comments and questions as a part of our commitment to providing you with player support. If you contact us directly for any reason, we also keep a copy of that correspondence.\n\nWhat about Sensitive Information?\n\nSensitive information includes information about such things as an individual's racial or ethnic origin, political opinions, membership of a political association, religious or philosophical beliefs, membership of a professional body, criminal records or health information.\n\nWe will not attempt to obtain nor record any sensitive information.\n\nThird Party Service Providers\n\nCollection of other Non-Personal Information\n\nSome non-personal information may be gathered while you use Our games. Non-personal information is general, non-identifiable and anonymous information that is gathered for statistical, analytical and research purposes such as the improvement of our games (for example, bug fixes).\n\nThough We do not use cookies in order to track your movement around the web, Our websites (https://mightygamesgroup.com, https://shootyskiesoverdrive.com) use Google Analytics to help analyse how users use these sites. The tool uses cookies to collect internet log information and general visitor behaviour information in an anonymous form. The information generated by the cookie about your use of the website, including your IP address, is transmitted to Google. This information is then used to evaluate use of our website and to compile statistical reports on website activity.\n\nThe Google Analytics privacy policy can be found here:\n\nGoogle Analytics: https://policies.google.com/privacy\n\nOur websites and apps may also contain APIs from other third parties. As with Google, We do not control how they interact with you and you should ensure that you consent to the terms of use and privacy policies offered by the third party services before providing them with your information.\n\nOur third-party partners, and their privacy policies are as follows:\n\nFacebook Analytics: https://www.facebook.com/about/privacy/update\nFacebook data use policy: https://www.facebook.com/full_data_use_policy\nUnity Analytics: https://unity3d.com/legal/privacy-policy\n\nAccess to Your Data, and Permanent Deletion of Your Data\n\nWe will retain your data only as necessary for our legitimate business interests, such as to comply with our legal obligations, resolve disputes, and enforce our agreements.\n\nNo matter how we come in contact with your data, you have the right to access the data We hold about you and to update and/or correct it, subject to certain exceptions.\n\nData Subject Requests\n\nIn the event that you send a data subject request to Us, or one of our third-party partners informs us that you have contacted them directly about your personal data they collected while you were using our service, We will respond to that request in accordance with any applicable legislation.\n\nIf you wish to know what data we hold about you, if any, please make out your request to us in writing at the address listed below. Please be aware that in order to protect the information in Our database, We will require identification from you before releasing any information.\n\nDisclosure, and Security of Your Information\n\nWe will not sell, trade, rent or disclose any of the personal information you provide to us for any reason, without your prior consent. Otherwise, your Personal Information will only be disclosed where required or allowable by law.\n\nYour Personal Information is stored offsite in a manner that reasonably protects it from misuse, loss, unauthorized access, modification or disclosure.\n\nPolicy Updates\n\nThis Policy may change from time to time. The most current version of our Privacy Policy can be found at https://shootyskiesoverdrive.com/privacy/index.html. We will always keep this up to date so that you know what information we will collect from you, how we may use it, and when we may disclose it.\n\nComplaints\n\nYou can lodge a complaint with us about any breach of our Privacy Policy at the address below.\n\nPrivacy Policy Contact Information\n\nIf you have any questions about our Privacy Policy, please contact us at:\nprivacy@mightygamesgroup.com\n\nPrivacy policy last updated 9 June 2020.\n\nPress Kit  Privacy Policy  Terms of Service\n\nMighty Games, \"The Mighty Games Arcade\" and the Mighty Games Logo are trademarks of the Mighty Games Group Pty Ltd.", "Developer Terms of Service": "BUY\nPRESS KIT\nCONTENT CREATORS\nCONTACT\nMIGHTY GAMES GROUP PTY LTD TERMS OF SERVICE - SHOOTY SKIES OVERDRIVE\n\nThis is the end user licence agreement for Mighty Game Group Pty Ltd (Australian Business Number: 98 164 842 933 (defined here as MGG or We).\n\nThis software product entitled Shooty Skies Overdrive (Game) is owned by MGG and is protected under copyright laws, international copyright treaties and other intellectual property laws. This Game is licensed, not sold to you. This Game is provided under the following license which defines what you may do with the Game and contains usage restrictions and limitations on warranties and/or remedies.\n\nYou must read the terms and conditions of this Agreement carefully before downloading, installing, or otherwise using the Game. If you are a minor (below the legal age of majority in your country), please have the agreement reviewed and agreed to by your parent or legal guardian. By downloading, installing, using, or otherwise accessing the Game, you acknowledge that you have read this Agreement, that you understand it, that you agree to be bound by its terms and conditions. If you do not agree to the terms and conditions of this agreement, promptly exit this page without downloading and/or using the Game.\n\n1. LICENSE\n\nSubject to the terms and limitations set forth herein, MGG grants you a limited non-exclusive license to use the Game in accordance with the terms of this Agreement. All rights not expressly stated herein are reserved by MGG, and MGG disclaims any and all implied licenses. The copyright and all other rights to the Game will remain with MGG.\n\n2. GRANT OF LICENCE\n\na) MGG grants you a non-exclusive revocable licence to install and use one royalty free copy of the Game on a single computer (or device) or network for personal, non-commercial use of the Game in accordance with this Agreement.\n\nb) You acknowledge that MGG owns all right, title and interest, including without limitation all intellectual property rights, in and to the Game and that you will not acquire any right, title or interest in or to the Game, except the limited license expressly set forth in clause 2 a) above.\n\nc) For the avoidance of doubt, the grant of licence in this clause 2 allows individual content creators to use gameplay vision from within the Game in their streams or videos to be used on third party platforms, including Twitch and Youtube.\n\n3. LIMITATION OF LICENCE\n\nYou must not:\n\na) make copies of the Game except as expressly permitted in this Agreement;\n\nb) translate, reverse engineer, decompile, or disassemble the Game;\n\nc) remove or alter any copyright, trademark or other proprietary rights notices contained in the Game or any other MGG content;\n\nd) rent, lease, loan, sub-license, distribute, assign, or transfer the Game;\n\ne) use the Game for any unauthorized purpose or in violation of any applicable laws or regulations; or\n\nf) modify the Game or merge all or any part of the Game with another program.\n\ng) be impolite while using any online feature of the Game, especially when communicating with other players.\n\nh) choose a rude or offensive user-name or any user-name infringing rights of others, especially personal rights.\n\n4. TERM\n\nThis License will continue for as long as you use the Game. However, this License will terminate automatically without notice from MGG if you fail to comply with any of its terms or conditions. Upon termination you must immediately cease using the Game and remove the Game from your computer or device. The Limitations of Warranties and Liability set out below will continue in force even after any termination.\n\n5. HEALTH AND SAFETY\n\nVirtual Reality Games can be physically and mentally draining. Always consider your state of health before you start playing. Take breaks regularly and stay hydrated. Always be mindful of your environment prior to commencing game play with the Game. Make sure there is enough space for you to play safely and that there are no obstacles or dangerous objects around you.\n\n6. LIMITATION OF WARRANTIES AND LIABILITY\n\nThe Game is provided on an as is basis, without any warranties or conditions, express or implied, including, but not limited to, any implied warranty of merchantability or fitness for a particular purpose, or any warranty arising by law, statute, usage of trade, or course of dealing. You assume all responsibility and risk for the use of the Game and for the use of any third-party website or service, and MGG disclaims all liability for any loss, injury or damage resulting from use of the Game and any third-party website, whether direct or indirect.\n\nIn no event will MGG have any liability to you or any other person or entity for any compensatory, indirect, incidental, special, consequential or exemplary damages whatsoever, including, but not limited to, loss of revenue or profit, lost or damaged data or other commercial or economic loss. MGG's total aggregate liability with respect to its obligations under this agreement or otherwise with respect to the product or the software will not exceed $AUD1.00. The limitations in this section will apply whether or not the alleged breach or default is a breach of a fundamental condition or term or a fundamental breach.\n\n7. INDEMNITY\n\nYou agree to indemnify and hold harmless MGG, and its subsidiaries, affiliates, officers, agents, and employees, advertisers, licensors, and partners, from and against any third party claim arising from or in any way related to your use of the Game, violation of this Agreement or any other actions connected with use of any content, including any liability or expense arising from all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature\n\n8. GENERAL\n\nThis Agreement is the entire agreement between us with respect to the subject matter hereof, superseding any other agreement or discussions, oral or written, and may not be changed except by a signed agreement. This Agreement will be governed by and construed in accordance with the laws of Victoria, Australia. You agree to be bound by the laws of that state.\n\n9. PRIVACY\n\nThe MGG Privacy Policy in respect of the use of this Game can be found at\nhttps://shootyskiesoverdrive.com/privacy/index.html.\n\nPress Privacy Policy Terms of Service\n\nMighty Games, \"The Mighty Games Arcade\" and the Mighty Games Logo are trademarks of the Mighty Games Group Pty Ltd.", "Space Required": "1.52 GB"}



["5 stars\n85%\n4 stars\n12%\n3 stars\n2%\n2 stars\n0%\n1 star\n1%", "GUNGUNM4NJul 2 at 11:35 AM\nA must have!\n\nIf you have ever played the original ShootySkies or space pirate trainer this is a must have, it is very retro and super fun, the only thing I wish they added or should add in future updates is an endless mode and the claw machine to earn more pilots. But other than that, this is one of the best games ever.\n\nHelpful | 43", "TripleSubJul 2 at 1:05 PM\nFluffy bullet hell\n\nI didn't play the mobile version of the game, so really have nothing to comment on in that respect.\nThe best way to describe the game is bullet hell in 3D with boxes of kittens and stuff.\nThe graphics are really crisp and the environments are well thought out.\n\nAt the asking price, it's got replayability, 5 play arenas and unlockables - it looks to be a good bang for your cash.... Especially if you like voxel kittens and things that puke rainbows in your general direction.\n\nFor me this was truly a no brainer on vfm.\n\nIf it gets added content, it's a no brainer x2\nAn Immersive sugary Nyancat apocalypse.\n\nHelpful | 22", "SPLaTTm4nJul 3 at 10:23 AM\nFun, Retro , colourful , challenging ...\n\nI have about 40 games on Quest, and as good as alot of them are none has made me want to write a review until I played Shooty Skies. I'll try not to over hype this but when I first loaded it up I could tell this is what VR is made for.\nIt's basically just a little fun shooter. However, your gun ( plane/spaceship/aircraft ) is in one hand and you point at enemies and it shoots them down. All the time you have to avoid what is being shot back to you. It's not just dodging left, right, up and down but also back and forward too as it's all in a 3D area. In the other hand you collect power up and aids to help your plane / gun thing. You get various aids such as shields, extra gun , bullet vacuum and even a trumpet that if you raise to your mouth it fires kittens at the enemy.\nThe enemies you may recognise from retro classics such as Joust and pacman. A boss you fight might be something like a pinball machine. It's all fun retro styled with bold vibrant colours. I cant tell you how much all this adds to the fun and enjoyment of it all.\nAll I can say for the price of it if you dont buy it then more fool you.\nFun retro colourful challenging shooter fit for all the family or just be selfish and play it by yourself. Buy it !\n\nHelpful | 17", "hargisssJul 3 at 12:32 PM\nBullet-Hell Tai Chi\n\nI was surprised that Shooty Skies is less about quick reaction time and more about careful precise and fluid movement. It's as much Tai Chi as Space Pirate Trainer. You play by focusing most of your attention not on the bullets or the enemies but on the space between and around them.\nIt's a ridiculous amount of hedonistic fun which borders on intoxicating.\n\nHelpful | 12", "l3rianKJul 2 at 3:25 PM\nJust ran out of battery on my Quest\n\nHaving way too much fun with this game! I wish they added more levels or endless mode in the future.\n\nActually, I really really want endless mode in chill difficulty. Just a fun game to play forever until we die while sitting on a comfy couch and play this arcade game. That would be nice.\n\nI repeat, ENDLESS MODE PLEASE!\n\nThis game is definitely worth having because its a game you can come back to play again.\n\nENDLESS MODE. Thanks :)\n\nHelpful | 12\nDeveloper ResponseJul 11 at 9:53 PM\n\nIt's already in the works. We're got it on the slate for a future update!", "RickK75Jul 4 at 5:04 AM\nCouldn't put it down\n\nPlayed the chill campaign to the final boss in one session. I like sitting games on the Quest and this was great.\nDon't think I've ever played a Quest game continuously in one session for longer and I have bought most games available on the Quest.\nI'm a Space Pirate Trainer fan and as a wave shooter this has similar gameplay I love.\nFor anyone with PC VR this game plays a bit like the Xortex arcade in Valve's The Lab - unlike SPT \"you\" are not the target of bullets, your handheld plane is.\n\nI only hope the developers add to this over time because it has just left me wanting more.\n\nHelpful | 9", "danesacdalan1999Jul 3 at 3:07 AM\nSuper fun!!!!\n\nLove the game it kept me really entertained. The graphics are truly amazing and unique. XD really good workout for your arms since you had to move your hands around and also if your left handed the trick to switch is put the control close by and press the trigger and thats how it would switch. Im looking forward for more updates soon.\n\nHelpful | 6", "BertHalfpint17 days ago\nAnd breathe ......... Awsome Fun 10 \n\nNow I am back in the arcade circa 1981 and trying to imagine what video games could evolve into ?\nThis is what they evolved into. Pure unadulterated hilarious laugh out loud brilliance , with a kitten in there somewhere ?\nA giant technicolour VR kaleidoscope of joy \n\nGames should be , well , just fun sometimes. No strategy, no planning ahead , no stealth wizardry . Just you and your square bricky creature in a bi-plane gun.\nThis is literally a \" blast\" and you actually feel happy to restart a check point , just to keep the fun going \n\nIn the original film TRON Flint gets sucked into the game-grid. Here you are sucked into an arcade cabinet of surreal lunacy and it is flipping fab !\n\nPLEASE can we have something like Space Invaders or Gallaxian to run about in.\n\nNeed a break from the serious RPG game that's got you all wound up  Here it is . Enjoy .\n \"Meow\"\n\nHelpful | 1", "Corky1961Jul 13 at 11:24 AM\nUpdated - No obvious Left handed mode\n\nVery additive shooter now I know to change hands. I leave my original review, incase there's other left handers who can't get the game to play like you hoped.\n\nI really like the game but my main hand is only the shield or extra gun. In the options menu only adjustments for sound but not to change Left or Right for the main shooter. Please fix this. Will change to 5 stars when the game is updated..\n\nHelpful | 4\nDeveloper ResponseJul 11 at 9:51 PM\n\nYou can swap hands by bringing your hands together and pulling the triggers. Our main programmer is a leftie so that's been in there from the start. We just hid it too well! Sorry for the inconvenience.", "Tacoma197521 days ago\nBetter than Space Pirate Trainer\n\nVery cool game and I find it more engaging than the must own Space Pirate Trainer. This game is definitely more colorful. You can unlock a lot of pilots which keeps giving you reasons to go back. Some weapons you like more than others but then some challenges will force you to use that one you may not like as much forcing you to improve with it. Your hand being the plane is unique and the amount of bulletscoming your way sometimes seems impossible but yet you manage to find your way thru the asteroid field! .... Fun!\n\nHelpful | 1", "mike_schwartzJul 5 at 6:34 PM\nWell worth the money!\n\nI normally dont review games but this game deserves it. If youre reading this, just go ahead a buy the game. Its well worth the money! I cant believe a game of this quality is only $10. This game is beautiful! Its also great for a completionist. There is plenty of content to unlock. The developers did an amazing job with this title! Hopefully more content is added in the future.\n\nHelpful | 3\nDeveloper ResponseJul 11 at 9:52 PM\n\nUpdates are already in the pipe! Keep Shooting those Skies!", "ZippernoseJul 9 at 10:15 PM\nAmazing campaign but...\n\nI have played this game a little bit on chill and normal mode on the campaign and I love it.\n\nI like how the game reminds me of me playing the game on mobile but with these cool bosses and challenges that unlock cool characters\n\nOne thing i wish was in the game was endless mode, just like the mobile game it was all endless. When i play this i think of space pirate trainer which is fun with its arcade endless mode. I feel that if the added that the game would be better than 5 stars.\n\nHelpful | 2\nDeveloper ResponseJul 11 at 9:47 PM\n\nWe totally hear you. The endless mode is coming in future updates. Keep Shooting those Skies!", "ChlasmaJul 23 at 5:33 PM\nTop for that price!\n\nAs an arcade shmups fan (mainly cave games) and VR enthusiast i can highly recommend this one as its the only bullethell style game on the quest. And for 10 bucks its actually a steal.\nHope for more,even deeper games like this in the future but i can highly recommend it :)\n\nArcade mode using an advanced score system please!\n\nHelpful | 0", "JDeblerJul 25 at 5:45 AM\nThe best value for the Quest!\n\nFor $10, this is a true winner. Anyone can play this one and the learning curve is minimal. There's tons of little humorous audio and visual treats like classic gaming elements, funny sounds, lots of imaginative and even satirical enemies, lots of bosses and enough challenge to keep you playing a long time. The graphics are super clear and immersive, controller tracking is buttery smooth. It is simple, fun, and an incredible value. I mean...TEN BUCKS! I have spent three times that on games that were half as fun and I played half as long.\nI am glad that updates are coming including an endless mode. Please, add more levels too!\nQuick hint... If you want to swap your shooty hand from right to left, pull the trigger of the one you want to use when you are on the main menu and it will switch. I am not a lefty but it is nice they thought of that. It also makes for an additional level of challenge to use your non-dominant hand to shoot. Makes it an ever better value. :)\nNice job, Mighty Games Group! Make more!\n\nHelpful | 0", "tx_brandonJul 5 at 3:46 PM\nLove it despite one minor gripe.\n\nThis game is very unique for the Quest. It uses the play area very well and the floor tiles in the play area actually represent the guardian.\nYou can actually move quickly around while playing and have peace of mind about being safe.\n\nThe variety in power-ups are absolutely fantastic and very creative.\nThe sound effects are also funny and really add to the immersion especially when headphones are worn.\n\nI just *really* wish there was an option to turn off auto-fire. It's so frustrating to not eh able to control the rate of fire myself. The default could still be auto fire and just the option to turn it off would be great for those that don't want the training wheels on, along with the laser.\n\nHelpful | 5\nDeveloper ResponseJul 5 at 4:54 PM\n\nWe hear and were going to be adding in an update pretty soon!", "SenSSi_Jul 2 at 1:34 PM\nVery good arcade game\n\nThis is kinda game, what you can play with your entire family. It is difficult, but not too difficult except overdrive mode.\n\nGraphics are nice for this kinda game\nLots of stuff happens in the screen and it is very well made / designed.\n\nI played four levels before I wrote this review.\n\nNot must have, but i recommend it. Crazy FUN 4/5.\n\nHoping more content / updates in the future. \n\nHelpful | 5\nDeveloper ResponseJul 3 at 8:25 PM\n\nUpdates are in the works! Keep flying the Shooty Skies", "Tommetal17 days ago\nPew pew pew love this game\n\nSo many fun things in this game. Most of them are being shot at your head. Its simple yet extremely addictive to play. Love the metal concert level wish it had more metal.\n\nHelpful | 1", "thejuggsterJul 4 at 9:05 PM\nYahyahyahyah!\n\nCouple shots of that good ol makers! And then shooty skies like bah bah bah bah bah! Best experience is on normal and overdrive, intense fun, MURICA! Happy independence day to my fellow americans! The rest of the world i hope your weekend is a blessed weekend!\n\nHelpful | 2", "BriWifi24 days ago\nSuper fun!\n\nExactly what it looks like, a fun shootemup/bullet hell game! Gorgeous visuals, very interesting enemy design, and you can't beat that price! The reason I'm not giving it 5* is just because I believe the game could be so much more! I want to see more depth in the weapons, give us several different upgrade paths for the blue powerup boxes after each boss. Instead of just giving us one more bullet per shot, it would be so cool if you also gave us options throughout! Faster shooting speed, an extra life, tracking bullets, different bullet types like elemental effects, etc. I truly believe this would give the game SOOOOOO much more replayability and would also merit a huge price increase! You could also then add more difficulty levels to still give the player a challenge with the additional upgrades.\n\nFor inspiration, I highly recommend games like Enter the Gungeon, The Binding of Isaac, Neon Abyss, Gunfire Reborn, etc. I would KILL for a game with that kind of depth and synergistic effects. This game has such a perfect backbone for it already!\n\nHelpful | 0", "carl.perez.58Jul 20 at 2:19 PM\nGreat game!\n\nOld school, arcade, retro mayhem here. A colorful, vibrant shooter with explosions all over the place and in your face. As challenging or easy as youd like. Definitely worth $10 dollars.\n\nBut whats up with the music being so low in the lobby?\n\nHelpful | 0", "SmallyBiggs13 days ago\nCrazy fun and amazing visuals\n\nIts amazing seeing 300 3D pixel enemies flying at me at once. Runs smooth even in those moments. This game is worth every penny!!!!\n\nHelpful | 0", "ParadiseDecayJul 2 at 10:16 AM\nAn 80's retro shooter, very cool!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=EflLo2G3Uto\n\nMy Initial Impressions:\nThis game is a nostalgia trip into retro video games and it gave me some cool Robotron style vibes.\n\nHelpful | 12", "FreddyC227Jul 10 at 8:45 PM\nIt is lots of fun and addictive\n\nAt first it seemed like it would be hard to get used to so many things happening at one time but I guess I still have what it takes to play this game at the age of 60. This will keep my brain active and young.\n\nHelpful | 2\nDeveloper ResponseJul 11 at 9:48 PM\n\nRock on Freddy", "alastair.hartfieldJul 5 at 5:00 PM\nGreat Game, great price\n\nGood little game brining the arcade shooter my kids used to love to VR. They love it :)\n\nUpdated review following response from developer on left handed support - appreciate the feedback thank you :)\n\nHelpful | 3\nDeveloper ResponseJul 5 at 4:56 PM\n\nYou can totally swap hands by putting the controllers together and pressing the oposite trigger button. Our main coder is a leftie so its been there from the start. We should just tell people. Our bad on that. Have a great one!", "Boom_KingJul 2 at 11:12 AM\nCrazy fun!!!\n\nSpace Pirate Trainer on LSD! Well done Devs you brilliant loons! :D Loving it so far, really good fun! Would have been 5 stars but except for there seems to be no pause/ menu button to exit the current session and return to the main menu? If there is it's not working for me! Also I'm right handed which suits me fine but at one point the game randomly switched my dominant hand to left, thought no issue I'll just change it back in the settings but no, the settings comprise of only two options: one for music volume, the other for SFX volume. Had to restart the game to fix this. Fix these things and it's 5 stars easy!\n\nHelpful | 2\nDeveloper ResponseJul 3 at 8:36 PM\n\nYou can swap hands by touching the controllers together and pulling the trigger. We're going to explain that better in an update. Thanks for the feedback!", "virtual_boi2020Jul 21 at 2:52 PM\nSimple and challenging\n\nThis game is perfect! I love the art style and the gameplay is on point! Also, you can play this game has a lot of gameplay. So this is a good first choice for Vr beginners.\n\nHelpful | 0", "BattleCat77Jul 8 at 11:08 PM\nColorful and fun.\n\nSimple but effective controls and classic gameplay make it easy and fun for people to pick up and enjoy right away. It has a fun and vibrant color palette that reminds me of neon meets Lego Movie. I would strongly recommend this game.\n\nHelpful | 0", "aaron.sommers.1253Jul 12 at 8:49 AM\n\nGreat game, a lot of fun. I actually love this type of game, just pick up and blast away your daily stress. The graphics are also very colorful and fun. Just a great arcade game, and the Devs are Awesome \n\nHelpful | 0", "RodOculusGameJul 7 at 10:47 AM\nGood Arcade game\n\nGood game. Fun, colorful and very dynamic. Maybe something difficult at first but then he catches the trick. The only flaw for me is the sound is very low as soon as you hear. But I recommend it and at a reasonable price\n\nHelpful | 0", "Bender_2112Jul 24 at 4:27 PM\nAddictive!\n\nSuper fun shooting gallery style game with an 80s vibe. Simple to play but challenging. You cant play this game without smiling.\n\nHelpful | 0", "Quaxi8224 days ago\nAwesome Game\n\nReally love it, its one of my favorite quest games!! Hope there will be many more levels soon :)\n\nHelpful | 0", "virtualscumdogJul 23 at 9:25 PM\nKeep going back\n\nIt keeps you returning for more and more ,just the right amount of difficulty and it's a good price get it play it and enjoy\n\nHelpful | 0", "n8tron76Jul 3 at 7:55 AM\nGreat Fun for the $$$\n\nGood price, good Fun, highly recommend\n\nHelpful | 4", "jujuface647Jul 2 at 11:15 AM\nVery fun bullet hell\n\nIts not like any oculus game and its cheap it very fun and and can get really hard\n\nHelpful | 3", "PauldoggyJul 2 at 1:37 PM\nLove it\n\nJust sit back and have fun, this is a true game\n\nHelpful | 3", "Anthony-fJul 13 at 7:34 PM\n\nA great game to play love the all the little details and how the game plays fantastic game for everyone\n\nHelpful | 0", "AdamothJul 6 at 4:07 PM\nA must own oculus title\n\nColourful , easy to play , fun , it's that simple . This is one of the new must buy's for the oculus and I can't agree more\n\nHelpful | 3\nDeveloper ResponseJul 11 at 9:51 PM\n\nRock on", "NPCMiiJul 2 at 11:03 PM\nFun!\n\nSo fun! Cheers to the dev team.\n\nHelpful | 3", "FordE13Jul 11 at 10:53 AM\nVery Fun\n\nI found this game very fun. With all the pilots you can unlock, it can be hours of fun shooting enemys\n\nHelpful | 0", "PixelatedDanJul 2 at 10:57 PM\nAmazing.\n\nTook everything from Shooty Skies and made it better. (And in VR!~)\n\nHelpful | 2", "noah.godwinJul 6 at 2:46 PM\nDoes not disappoint\n\nCrazy scenes, frenetic game play, call backs to the old days, what they're doing here really works.\n\nHelpful | 1", "49ersfan17231989Jul 15 at 12:48 AM\nBest 10$ game you'll find\n\nLoved it quit a challenge on hard very retro and awesome.\n\nHelpful | 0", "astypeJul 7 at 6:53 PM\nFun\n\nA short but fun fun shooter.\n\nHelpful | 1", "TuvivavalJul 4 at 10:43 AM\nAwesome!\n\nIt is a must buy\n\nHelpful | 1", "TeletubbyWithAGun14 days ago\nAmazing game\n\nThis game has a very unique stance in the quest in that your controller is your player and you have to move your arms instead of dodging and ducking. I loved the mobile version of the game and to see it get an oculus debut makes it an excellent addition to any library. The only thing that could be a bit better would be a sort of daily challenge mode where you have to complete a certain level with a certain pilot on overdrive (Unlocking maybe a gold or special variant of the pilot).\nHopefully this game keeps on getting updated to bring more content to an already amazing game!\n\nHelpful | 0", "CloudTurtle27Jul 2 at 3:38 PM\n10 bucks! Are you kidding?\n\nOne of the best displays of color you will see on the quest. This game is absolutely GORGEOUS. Gameplay is hectic, unique and super fun. The sound design is fantastic. Extremely impressed so far. All this for $10? What a bargain!\n\nHaven't gotten thru all levels yet, but hopefully there is an endless mode with a leaderboard.\n\nHelpful | 6", "Sunnyside_downJul 8 at 5:35 PM\nSo much fun\n\nTwinkle Star Sprites meets Zaxxon.\n\n3 stars.\n2 thumbs.\n10/10 dollars.\nIndefinitely replayable.\nActual Eye Exercise.\nInoffensive music.\n\nWont refund or regret.\n\nHelpful | 1\nDeveloper ResponseJul 11 at 9:56 PM\n\nZaxxon is the best! Glad you liked it!", "Ormond.PlynthJul 23 at 2:46 AM\nDare I level up?\n\nI'm doing the \"chill\" level. It's insane! I'm pretty skeptical about leveling up. I'm still waiting to see what the side missions are about, but, man, the main missions get very dense, even on the easy level. A fun game that you play entirely with your reflexes, and not your brain. I think the \"bullet vacuum is my favorite defensive weapon, though the chainsaw is also a fave.\n\nHelpful | 0", "brandon.migliorisiJul 5 at 9:00 AM\n ADDICTIVE!!! \n\nSo much action and so many bullets flying through the air, this game is an absolute must have for the wireless freedom of the Oculus Quest. Graphics are Minecraft like, which means everything is very clear and simple. Lots of beautiful colors and the worlds have truly been created with an atmospheric feel in mind.\n\nThe use of a character being controlled like an action figure brings an ENTIRELY NEW 6DOF EXPERIENCE!!! \n\nDo you LOVE Space Pirate Trainer? Then youll LOVE this!! Must have!!!\n\nHelpful | 2", "chettawanJul 4 at 6:11 AM\nGreat fun!!!\n\nLove all of the game, style, items, soundtrack etc. There should be a mode for those who not motion sickness that the background is moving toward. Let's say its a endless mode flying in dark space and star particles moving toward player like we really fly the pilot forward.\n\nHelpful | 2", "tylerdurdan-jack13 days ago\nGood fun so far!\n\nI grew up with graphics like this which is a lot of fun. My first game with Oculus and feeling happy with my first journey into VR world\n\nHelpful | 0", "xSICAPxJul 2 at 11:19 AM\nGood game\n\nIts a great game, good graphics, fun characters, but the automatic shooting thing annoys me, it makes me lose immersion and makes the game too easy and less interactive, If you add a toggle button or remove this feature, I would gladly add 5 stars, other than that, this is a great game.\n\nHelpful | 4\nDeveloper ResponseJul 3 at 8:24 PM\n\nThanks for the feedback. We've been having a chat about that idea and we'll take it on board. Good luck and good flying!", "TVL1977Jul 8 at 4:22 PM\nInside the Arcade game\n\nJust pure nostalgic arcade style game.\nThe graphics are super colorful and it takes you back to the early days of arcades.\nThe cats and sounds are so hilarious.\nIt's fast paced, and in the end it can get quite addictive.\nIt's simple but effective.... And for this price it's pure fun.\nA good game to have a bit of fun with when you don't have alot of time. A quick pick up!\nDefinitely puts a smile on my face!\n\nHelpful | 0", "mark.testaseccaJul 2 at 2:21 PM\nVr Bullet hell shooter\n\nThe number one thing I look in a vr game is the immersion and for a 10 dollar game it does a good job of putting yourself into a traditional arcade shooter! A on rails option like pistol whip would be cool! \n\nHelpful | 2", "xXROSSXxJul 4 at 1:23 AM\nExcellent Game!!!\n\nOne of the best shooting game in oculus quest. Looking forward for future updates. We hope that developer of this game continue making great games for oculus quest! Did not feel any dizziness after few hours playing this game! Kudos!\n\nHelpful | 2", "surfousJul 3 at 10:33 PM\nBullet hell the way it wants to be\n\nI loved the mobile version of Shooty Skies, and this version keeps whats great and soaks you in it! This is the kind of game that will keep me coming back for another round for a long time.\n\nAdd endless mode, and Ill give it six stars! (Pending an upgrade to the Oculus store rating system that allows this)\n\nHelpful | 1", "alextron69Jul 3 at 2:25 AM\nExcellent game\n\nIf you like arcade shooters, this is the game for you.Except this time around, it's in VR with scale room movement.Sharps and colourful graphics.Tons of enemies during gameplay and still running smooth.Non stop action and easy to pick up.All it needs is an ENDLESS waves or levels and extra lives to make it a classic VR arcade shooter and therefore a Great game.\n\nHelpful | 0", "jayisspillz94Jul 3 at 12:02 AM\nBest $10 i ever spent!\n\nOk first off I gotta say......this game is fricking awesome. Yea I hear about the endless mode but how about mature mode? Some blood splatter a couple of furry arms and legs flying. Even if u dont add anything i still love this game. Lots of replay value. And for 10 smackaroons come on skip the bananna split with sprinkles for one day and vrab this game. Its rediculously fun!!!\nOh yea ps press the side button while both hands are touching to switch hands.\n\nHelpful | 1", "Smugford12Jul 5 at 9:58 AM\nGreat game to show friends VR\n\nI normally don't like wave based standing still shooters as I feel they don't offer much after a few hours. However this retro inspired shooter has my full attention and a game I'll show to others when showing off the quest. For the price it's a great buy and not easy at all imo\n\nHelpful | 1", "GForce7360Jul 17 at 9:47 AM\nOldskool Japanese Shooter in VR\n\nThis game has blown me away it's super hectic and you have to pay attention to the bullets(which is all kinds of stuff from cassette tapes to walls of blue blocks) you must dodge through the hail of incoming bullets as you shoot down oldskool ghetto blasters who shoot cassettes at you, then there's ghosts from pac=man and lots of other crazy stuff going on. Like the 1st boss is a pinball table. Awesome to see a developer go all out like this as you have a air plane in your right hand for a gun and your left is used to grab power ups. It's original has lots and lots of replay value, yeah we could all buy the big name games but this is definitely the diamond in the rough with so many games on quest now(and I've only owned mine a week or two) I am really happy to find a super Shooter that I could have easily missed.\nThis is a definite must have for anyone but oldskool gamers who love Japanese 2D wave shooters will love this too. I have only finished level one as I have only had this game a day but I had to tell others how mad this is.\nTo the Dev Team, well done awesome original crazy Shooter. 4/5\n\nHelpful | 0", "rbristelJul 28 at 4:40 AM\nFun\n\nThis is the most fun that Ive had since I purchased the Oculus Quest. I thought Beat Saber was the best, now I have a new #1.\n\nHelpful | 0", "GRex70Jul 2 at 11:37 AM\nOne of the cheaper good games\n\nA good game for the cheap price of 10$. Looking forward to more updates!\n\nHelpful | 5", "Paul81Jul 6 at 3:35 PM\n*This* is why I love VR\n\nLooks great, sounds fantastic.\nIt's games like this that make me love VR.\nComparisons to Space Pirate Trainer are unfair - I found SPT boring and refunded it after about 15 minutes.\nThis is pure, unadulterated fun.\n\nHelpful | 1", "EnphaseJul 3 at 3:55 AM\nLoving it\n\nThis a great game .\nGets challenging quickly .\nMake sure you have some space to move around the slow bullets/space invaders ect that seem to fill the your room .\nVery quirky , very cool .\nRecommended if you love the old school games .\n\nHelpful | 1", "captain_meow-vel16 days ago\nFantastic gamd\n\nEverything space pirate trainer should be\n\nHelpful | 1", "BlazingAndrewJul 6 at 7:21 PM\nAmazing\n\nWell worth the price for what youre getting. A very fun and challenging bullet-hell experience. Please continue to support the game with further updates!! I will pay lol I just want more\n\nHelpful | 1", "jacob.lehi.harwoodJul 23 at 11:51 AM\nBuy it\n\nGood game\n\nHelpful | 0", "Kinky_Winky69Jul 7 at 4:34 PM\nAmazing\n\n8/10 game brilliant game however hurts eyes after long plays\n\nHelpful | 0", "El-Franco22Jul 7 at 11:40 AM\nCool game\n\nIts pretty awesome, I have played like 3 hours non stop!\n\nHelpful | 0", "kirisuz132Jul 11 at 4:11 PM\nReally fun\n\nIts fun\n\nHelpful | 0", "JeanOculus78Jul 4 at 4:51 AM\nGood Beautyfull and Cheap\n\nThis is the best and most fun game in the store!\n\nHelpful | 1", "Gilagassi1Jul 4 at 9:16 AM\n\nA great 3d vr shooting game\n\nHelpful | 1"]