{"App Title": "Shooty Fruity", "App description": "THE AWARD WINNING MULTI-TASKING SHOOTER\n\nA fun shooter with a twist 8/10 THE SIXTH AXIS\nan experience that should be in the top tier of VR games 9/10 GAMING NEXUS\n\"Silly, funny, demanding and absolutely unique\" PSVR WITHOUT PAROLE\nas much fun for the VR fanatic as it is for the casual player 8/10 GAMING TREND\n\"Definitely a hidden gem\" NATHIE\n\nDo your job whilst shooting guns! Shooty Fruity combines job simulation with exhilarating combat that makes you feel like a true action hero - whether McClane, Wick or Rambo. Take on new roles and unlock weapons to fight your way through your career. Scan shoot repeat!\n\nSHOOTER MEETS JOB SIM\nFrantic multi-tasking gameplay only possible in VR\nEXHILARATING COMBAT\nShoot hordes of enemies with an expanding array of guns\nHIGH OCTANE ARSENAL\nIncluding flak cannons, gatling guns & missile launchers\nPOWER UP\nWield bullet-time slow-mo, exploding ammo & more\nYOUR NEW CAREER\nScan, serve & pack across countless missions to rise the leaderboards", "Purchase section": "$19.99Add to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Shooter, Simulation", "Languages": "English, French (France), German, Italian, Japanese, Russian, Spanish (Spain)", "Version": "1.0", "Developer": "nDreams/Near Light", "Publisher": "nDreams", "Website": "http://www.ndreams.com/shootyfruity", "Release Date": "August 27, 2020", "Developer Privacy Policy": "titles\nphantom: covert ops shooty fruity the assembly ndreams vr bundle\nview all titles\n \nPhantom: Covert Ops\n \nShooty Fruity\n \nThe Assembly\n \nnDreams VR Bundle\n about us\ncompany info working with us contact press\n careers\nworking here vacancies\n blog\n facebook twitter youtube pinterest\n\nThis page has information on the following areas:\n\n Customer Support\n\n Privacy Policy\n\n Recruitment Privacy Policy\n\n Tracking and Analytics\n\n Terms of Service\n\n Waiver of Liability\n\n Refund Policy\n\n Copyright\n\n Contact Details\n\n\n\nCustomer Support\n\n\n\nIf youre having a problem with any of our games or experiences, please contact our customer support team by emailing support@ndreams.com, contact us on Twitter (@ndreamsVR) or on Facebook (www.facebook.com/ndreamsVR).\n\n\n\nPrivacy Policy\n\n\n\nWhat personal data do we collect?\n\nWe collect the personal data you provide to us when signing up for newsletters, applying for a job at nDreams or to otherwise providing your data to us, along with any further personal data you provide from time to time. This personal data may include your name, email address, job title, organisation address, land and mobile phone numbers and other contact details.\n\nHow we use your personal data\n\nWe use your personal data to:\n\nsend you our newsletters and updates if you have subscribed to our mailing list\ncontact you about vacancies that you have applied for, or similar vacancies that come up in future\n\nHow long we keep your personal data\n\nWe will keep your personal data for as long as reasonable for the purpose it was provided. We will periodically review our interactions with you and will delete your data if we have not interacted for some time.\n\nWho we share your personal data with\n\nWe will not share your data with any third parties.\n\nThe lawful basis for processing your data\n\nWe rely on your consent to process your data.\n\nWhat happens if you do not provide us with the personal data we request or ask us to stop processing your personal data?\n\nYou may withdraw your consent to our processing your data at any time. You are able to opt out of our newsletters at any time by selecting unsubscribe at the bottom of the email. You may also ask us to remove your details from our Applicant Tracking System at any time. Please be aware that if we do this, we will be unable to contact you about jobs or vacancies that you have applied for.\n\nHow we contact you\n\nWe will communicate with you via email, telephone and post. Youmay also update your contact details at any time by contacting us.\n\nProcessing data outside of the European Economic Area\n\nIn some cases we may process your personal data outside the European Economic Area (EEA) where countries may not have laws which protect your personal data to the same extent as in EEA. We are obliged to ensure that your personal data is processed securely and is protected against unauthorised access, loss or destruction, unlawful processing and any processing which is inconsistent with the purposes set out in this privacy notice.\n\nCurrently we use Mailchimp, part of The Rocket Science Group, to send some of our emails. We use Workableto store our applicant information for recruitment. We will update this privacy notice from time to time to reflect any changes to our ways of working. Please contact our data protection officer if you would like more information about the safeguards we have in place.\n\nYour rights\n\nBy law you have a number of rights when it comes to your personal data.\n\nRights\n\n\t\n\nWhat does this mean?\n\n\n\n\nThe right to be informed\n\n\n\n\t\n\nYou have the right to be provided with clear, transparent and easily understandable information about how we use your personal data and your rights.\n\n\n\n\nThe right of access\n\n\t\n\nYou have the right to obtain access to your personal data that we are processing and certain other information.\n\n\n\n\nThe right to rectification\n\n\t\n\nYou are entitled to have your personal data corrected if it is inaccurate or incomplete. Please inform us of any data which you would like rectified and we will usually respond within a month of the request. We will pass on the changes to any third parties who need to change their records and let you know this has been done.\n\n\n\n\nThe right to erasure\n\n\t\n\nThis is also known as the right to be forgotten and enables you to request the deletion or removal of your personal data where theres no compelling reason for us to keep using it. This is not a general right to erasure; there are exceptions but where possible we will comply with your request.\n\n\n\n\nThe right to restrict processing\n\n\t\n\nYou have rights to block or suppress further use of your personal data. When processing is restricted, we can still store your personal data, but may not use it further. We keep lists of people who have asked for further use of their personal data to be blocked to make sure the restriction is respected in future.\n\n\n\n\nThe right to data portability\n\n\t\n\nYou have rights to obtain and reuse your personal data for your own purposes across different services. We will do our best to provide the information in an easy to read format.\n\n\n\n\nThe right to object to processing\n\n\t\n\nYou have the right to object to ask us to stop processing your data however this may prevent us from fulfilling our contract with you.\n\n\n\n\nThe right to lodge a complaint\n\n\t\n\nYou have the right to lodge a complaint about the way we handle or process your personal data with a supervisory authority. The supervisory authority for the UK is the Information Commissioner.\n\n\n\n\nThe right to withdraw consent\n\n\t\n\nIf you have given your consent to anything we do with your personal data, you have the right to withdraw your consent at any time (although if you do so, it does not mean that anything we have done with your personal data with your consent up to that point is unlawful).\n\n\n\nChanges to our privacy notice\n\nAny changes we may make to our privacy notice in the future will be posted on our website and, where appropriate we will notify you by email. Please check back frequently to see any updates.\n\nSubject access requests\n\nWe are legally required to act on requests and provide information free of charge with the exception of requests that are manifestly unfounded, excessive or repetitive. If we determine this to be the case we may charge a reasonable fee or refuse to act on the request. We will respond to acknowledge your request and provide the information within one month of receiving your request. Please send your request to our data protection officer at the email address below with subject access request in the subject line.\n\nOur data protection officer contact details\n\nOur data protection officer is Patrick OLuanaigh. If you have any queries, questions or concerns about your data, how we are handling it, wish to ask us not to process your data or wish to ask us to erase your data, please contactenquiries@ndreams.com.\n\nWe are registered as a data controller with the Information Commissioners Office and abide by the UK Data Protection Act and GDPR.\n\n\n\nRecruitment Privacy Policy\n\n\n\nIf you have applied for a role here and sent us your CV and/or contact details, then nDreams has collected and stored your resume and/or contact details.\n\nWe process this data for recruitment purposes only. We are storing this data in our secure Applicant Tracking System (Workable), which stores data in the U.S and is fully compliant with EU data protection laws, and we will not share it with anyone else.\n\nWe would like to keep this data for a two-year period. This is so we can contact you if similar roles come up in future, and to help us ensure that there is no age, sex or other forms of discrimination in our recruitment process. When that period is over, we will delete your data.\n\nOur privacy policy is shown above. In this policy, you will find information about our compliance with GDPR (data protection law). You can find how to send us a request to let you access your data that we have collected, request us to delete your data, correct any inaccuracies or restrict our processing of your data.\n\n\n\nTracking and Analytics\n\n\n\nOur website\n\nIP addresses, URLs visited, and related information is recorded for all site visitors for the purpose of site traffic analytics and captured as part of normal operation in our server logs. Cookies are used to track logins, sessions, and collect anonymous traffic data. You have the options to enable or disable cookies for this site when you first visit it.\n\nThough nDreams itself does not use cookies in order to track your movement around the web, our websites and apps may contain APIs from third parties. Specifically, our websites use Google Analytics to help analyse how users use the site. The tool uses cookies to collect internet log information and visitor behaviour information in an anonymous form. The information generated by the cookie about your use of the website, including your IP address, is transmitted to Google. This information is then used to evaluate use of our website and to compile statistical reports on website activity.\n\nOur third-party partner, and their privacy policy are as follows:\n\nGoogle Analytics: https://support.google.com/analytics/answer/6004245?hl=en\n\nOur games\n\nNone of our games or experiences store any personal information. We only store anonymous, aggregated information, which uses our own internal analytics system.\n\nOur mailing list\n\n\nThe information for our nDreams mailing lists is stored securely with Mailchimp, who are fully compliant with EU data protection law. You can unsubscribe from the list at any time by clicking on the link on the bottom of each newsletter. Our mailing list only contains people who have consented to being on the mailing list, and where we can confirm that consent has been given.\n\n\n\nTerms of Service\n\n\n\nnDreams grants to you a non-exclusive, non-transferable, revocable limited license to use and display the games and related software (excluding source and object code) for your personal (or household) non-commercial use by any machine(s) of which you are the primary user. You agree not to use the Service for any other purpose, or to copy or distribute the content of the Service except as specifically allowed in this agreement.\n\nYou do not acquire any ownership rights by using our games, downloading material from or uploading material to our site, or by purchasing any virtual goods.\n\nYou agree not to copy, redistribute, publish or otherwise exploit material from the Service, except as expressly permitted herein, without the express prior written permission of nDreams.\n\n\n\nWaiver of Liability\n\n\n\nYou expressly agree that use of nDreams games is at your sole risk and is provided on an as is basis without warranties of any kind, either express or implied, including, but not limited to, warranties of title or implied warranties of non-infringement, merchantability or fitness for a particular purpose (except only to the extent prohibited under the laws applicable to terms of use with any legally required warranty period to the shorter of thirty days from first use or the minimum period required). Without limiting the foregoing, neither nDreams nor its affiliates or subsidiaries, or any of their directors, employees, agents, attorneys, third-party content providers, distributors, licensees or licensors warrant that the service will be uninterrupted or error-free.\n\nUnder no circumstances will nDreams be liable to you for more than the amount you have paid nDreams in the ninety (90) days immediately preceding the date on which you first assert any such claim.\n\n\n\nRefund Policy\n\n\n\nFor any purchase of digital content products, you agree that nDreams makes those products available to you for download and use immediately after we have accepted your order and once made available, as far as permitted by law, you will have no right to cancel your order or to a \"cooling off period\".\n\n\n\nCopyright\n\n\n\nAll website content is copyright (c) nDreams Ltd.\n\nAny questions or complaints about our websites, games or items can be resolved by emailing us at support@ndreams.com.\n\n\n\nContact details\n\n\n\nCompany number: 4362105\n\nRegistered office: Spectrum Point, 279 Farnborough Road, Farnborough, Hampshire GU14 7LS, England, UK\n\nEmail: support@ndreams.com\n\nFacebook Twitter Youtube Reddit Pinterest\n\nTerms & Conditions / Privacy Policy\n\n nDreams 2020", "Developer Terms of Service": "titles\nphantom: covert ops shooty fruity the assembly ndreams vr bundle\nview all titles\n \nPhantom: Covert Ops\n \nShooty Fruity\n \nThe Assembly\n \nnDreams VR Bundle\n about us\ncompany info working with us contact press\n careers\nworking here vacancies\n blog\n facebook twitter youtube pinterest\n\nThis page has information on the following areas:\n\n Customer Support\n\n Privacy Policy\n\n Recruitment Privacy Policy\n\n Tracking and Analytics\n\n Terms of Service\n\n Waiver of Liability\n\n Refund Policy\n\n Copyright\n\n Contact Details\n\n\n\nCustomer Support\n\n\n\nIf youre having a problem with any of our games or experiences, please contact our customer support team by emailing support@ndreams.com, contact us on Twitter (@ndreamsVR) or on Facebook (www.facebook.com/ndreamsVR).\n\n\n\nPrivacy Policy\n\n\n\nWhat personal data do we collect?\n\nWe collect the personal data you provide to us when signing up for newsletters, applying for a job at nDreams or to otherwise providing your data to us, along with any further personal data you provide from time to time. This personal data may include your name, email address, job title, organisation address, land and mobile phone numbers and other contact details.\n\nHow we use your personal data\n\nWe use your personal data to:\n\nsend you our newsletters and updates if you have subscribed to our mailing list\ncontact you about vacancies that you have applied for, or similar vacancies that come up in future\n\nHow long we keep your personal data\n\nWe will keep your personal data for as long as reasonable for the purpose it was provided. We will periodically review our interactions with you and will delete your data if we have not interacted for some time.\n\nWho we share your personal data with\n\nWe will not share your data with any third parties.\n\nThe lawful basis for processing your data\n\nWe rely on your consent to process your data.\n\nWhat happens if you do not provide us with the personal data we request or ask us to stop processing your personal data?\n\nYou may withdraw your consent to our processing your data at any time. You are able to opt out of our newsletters at any time by selecting unsubscribe at the bottom of the email. You may also ask us to remove your details from our Applicant Tracking System at any time. Please be aware that if we do this, we will be unable to contact you about jobs or vacancies that you have applied for.\n\nHow we contact you\n\nWe will communicate with you via email, telephone and post. Youmay also update your contact details at any time by contacting us.\n\nProcessing data outside of the European Economic Area\n\nIn some cases we may process your personal data outside the European Economic Area (EEA) where countries may not have laws which protect your personal data to the same extent as in EEA. We are obliged to ensure that your personal data is processed securely and is protected against unauthorised access, loss or destruction, unlawful processing and any processing which is inconsistent with the purposes set out in this privacy notice.\n\nCurrently we use Mailchimp, part of The Rocket Science Group, to send some of our emails. We use Workableto store our applicant information for recruitment. We will update this privacy notice from time to time to reflect any changes to our ways of working. Please contact our data protection officer if you would like more information about the safeguards we have in place.\n\nYour rights\n\nBy law you have a number of rights when it comes to your personal data.\n\nRights\n\n\t\n\nWhat does this mean?\n\n\n\n\nThe right to be informed\n\n\n\n\t\n\nYou have the right to be provided with clear, transparent and easily understandable information about how we use your personal data and your rights.\n\n\n\n\nThe right of access\n\n\t\n\nYou have the right to obtain access to your personal data that we are processing and certain other information.\n\n\n\n\nThe right to rectification\n\n\t\n\nYou are entitled to have your personal data corrected if it is inaccurate or incomplete. Please inform us of any data which you would like rectified and we will usually respond within a month of the request. We will pass on the changes to any third parties who need to change their records and let you know this has been done.\n\n\n\n\nThe right to erasure\n\n\t\n\nThis is also known as the right to be forgotten and enables you to request the deletion or removal of your personal data where theres no compelling reason for us to keep using it. This is not a general right to erasure; there are exceptions but where possible we will comply with your request.\n\n\n\n\nThe right to restrict processing\n\n\t\n\nYou have rights to block or suppress further use of your personal data. When processing is restricted, we can still store your personal data, but may not use it further. We keep lists of people who have asked for further use of their personal data to be blocked to make sure the restriction is respected in future.\n\n\n\n\nThe right to data portability\n\n\t\n\nYou have rights to obtain and reuse your personal data for your own purposes across different services. We will do our best to provide the information in an easy to read format.\n\n\n\n\nThe right to object to processing\n\n\t\n\nYou have the right to object to ask us to stop processing your data however this may prevent us from fulfilling our contract with you.\n\n\n\n\nThe right to lodge a complaint\n\n\t\n\nYou have the right to lodge a complaint about the way we handle or process your personal data with a supervisory authority. The supervisory authority for the UK is the Information Commissioner.\n\n\n\n\nThe right to withdraw consent\n\n\t\n\nIf you have given your consent to anything we do with your personal data, you have the right to withdraw your consent at any time (although if you do so, it does not mean that anything we have done with your personal data with your consent up to that point is unlawful).\n\n\n\nChanges to our privacy notice\n\nAny changes we may make to our privacy notice in the future will be posted on our website and, where appropriate we will notify you by email. Please check back frequently to see any updates.\n\nSubject access requests\n\nWe are legally required to act on requests and provide information free of charge with the exception of requests that are manifestly unfounded, excessive or repetitive. If we determine this to be the case we may charge a reasonable fee or refuse to act on the request. We will respond to acknowledge your request and provide the information within one month of receiving your request. Please send your request to our data protection officer at the email address below with subject access request in the subject line.\n\nOur data protection officer contact details\n\nOur data protection officer is Patrick OLuanaigh. If you have any queries, questions or concerns about your data, how we are handling it, wish to ask us not to process your data or wish to ask us to erase your data, please contactenquiries@ndreams.com.\n\nWe are registered as a data controller with the Information Commissioners Office and abide by the UK Data Protection Act and GDPR.\n\n\n\nRecruitment Privacy Policy\n\n\n\nIf you have applied for a role here and sent us your CV and/or contact details, then nDreams has collected and stored your resume and/or contact details.\n\nWe process this data for recruitment purposes only. We are storing this data in our secure Applicant Tracking System (Workable), which stores data in the U.S and is fully compliant with EU data protection laws, and we will not share it with anyone else.\n\nWe would like to keep this data for a two-year period. This is so we can contact you if similar roles come up in future, and to help us ensure that there is no age, sex or other forms of discrimination in our recruitment process. When that period is over, we will delete your data.\n\nOur privacy policy is shown above. In this policy, you will find information about our compliance with GDPR (data protection law). You can find how to send us a request to let you access your data that we have collected, request us to delete your data, correct any inaccuracies or restrict our processing of your data.\n\n\n\nTracking and Analytics\n\n\n\nOur website\n\nIP addresses, URLs visited, and related information is recorded for all site visitors for the purpose of site traffic analytics and captured as part of normal operation in our server logs. Cookies are used to track logins, sessions, and collect anonymous traffic data. You have the options to enable or disable cookies for this site when you first visit it.\n\nThough nDreams itself does not use cookies in order to track your movement around the web, our websites and apps may contain APIs from third parties. Specifically, our websites use Google Analytics to help analyse how users use the site. The tool uses cookies to collect internet log information and visitor behaviour information in an anonymous form. The information generated by the cookie about your use of the website, including your IP address, is transmitted to Google. This information is then used to evaluate use of our website and to compile statistical reports on website activity.\n\nOur third-party partner, and their privacy policy are as follows:\n\nGoogle Analytics: https://support.google.com/analytics/answer/6004245?hl=en\n\nOur games\n\nNone of our games or experiences store any personal information. We only store anonymous, aggregated information, which uses our own internal analytics system.\n\nOur mailing list\n\n\nThe information for our nDreams mailing lists is stored securely with Mailchimp, who are fully compliant with EU data protection law. You can unsubscribe from the list at any time by clicking on the link on the bottom of each newsletter. Our mailing list only contains people who have consented to being on the mailing list, and where we can confirm that consent has been given.\n\n\n\nTerms of Service\n\n\n\nnDreams grants to you a non-exclusive, non-transferable, revocable limited license to use and display the games and related software (excluding source and object code) for your personal (or household) non-commercial use by any machine(s) of which you are the primary user. You agree not to use the Service for any other purpose, or to copy or distribute the content of the Service except as specifically allowed in this agreement.\n\nYou do not acquire any ownership rights by using our games, downloading material from or uploading material to our site, or by purchasing any virtual goods.\n\nYou agree not to copy, redistribute, publish or otherwise exploit material from the Service, except as expressly permitted herein, without the express prior written permission of nDreams.\n\n\n\nWaiver of Liability\n\n\n\nYou expressly agree that use of nDreams games is at your sole risk and is provided on an as is basis without warranties of any kind, either express or implied, including, but not limited to, warranties of title or implied warranties of non-infringement, merchantability or fitness for a particular purpose (except only to the extent prohibited under the laws applicable to terms of use with any legally required warranty period to the shorter of thirty days from first use or the minimum period required). Without limiting the foregoing, neither nDreams nor its affiliates or subsidiaries, or any of their directors, employees, agents, attorneys, third-party content providers, distributors, licensees or licensors warrant that the service will be uninterrupted or error-free.\n\nUnder no circumstances will nDreams be liable to you for more than the amount you have paid nDreams in the ninety (90) days immediately preceding the date on which you first assert any such claim.\n\n\n\nRefund Policy\n\n\n\nFor any purchase of digital content products, you agree that nDreams makes those products available to you for download and use immediately after we have accepted your order and once made available, as far as permitted by law, you will have no right to cancel your order or to a \"cooling off period\".\n\n\n\nCopyright\n\n\n\nAll website content is copyright (c) nDreams Ltd.\n\nAny questions or complaints about our websites, games or items can be resolved by emailing us at support@ndreams.com.\n\n\n\nContact details\n\n\n\nCompany number: 4362105\n\nRegistered office: Spectrum Point, 279 Farnborough Road, Farnborough, Hampshire GU14 7LS, England, UK\n\nEmail: support@ndreams.com\n\nFacebook Twitter Youtube Reddit Pinterest\n\nTerms & Conditions / Privacy Policy\n\n nDreams 2020", "Space Required": "2.68 GB"}



["5 stars\n50%\n4 stars\n25%\n3 stars\n25%\n2 stars\n0%\n1 star\n0%", "HNT0076 hours ago\nReally fun but it needs better graphics\n\nThis game is sooooo fun and I love the sound design, the guns sound amazing but wooow the graphics are really really bad, especially for a 2020 version....so much aliasing!! Its almost painful to play it just because of that. It could easily be a 5 stars with better graphics! Like it would be so much better with a cartoonish style, much sharper, less aliasing! Other than that, its a fantastic game with really funny commentaries.\n\nHelpful | 10", "Nicholas07256 hours ago\nAmazing game\n\nI have been waiting and hoping that this game would come to the oculus ever since I first played this on the psvr I would highly recommend this game it is amazing funny and chaotic all in one it is great\n\nHelpful | 7", "HelloAlice20192 hours ago\nSo glad to see it on Quest!\n\nI bought this game on my Rift a couple years ago and thought it was lots of fun. There were 3 games I bought on Rift that I really hoped to see ported to Quest: Virtual Rickality, American Dream and Shooty Fruity.\n\nIt's no Half Life Alyx or Walking Dead, but it is very entertaining and funny shooting game that seems absolutely perfect for Quest. It is great for short, wireless, jump right into play, arcade-style game play. Using a big variety of colorful cool weapons to kill giant fruit charging at you from dark store isles while scanning in a bunch of stuff is surprisingly enjoyable vr gaming experience.\n\nThank you so much for bringing this game to Quest :)\n\nHelpful | 2", "Mr_OCDC2 hours ago\nGreat shooter\n\nForget the cartoon fruit enemy, this is a great wave shooter meets a job sim game and the shooting feels great, one of the best out there. Plenty of ridiculous over-the-top weapons, power ups and it has that must have one more go. Supermarket voice very funny too. Great party game for friends and family. Given the price, definitely worth purchasing.\n\nHelpful | 0", "Robertobob1002 hours ago\nI feel like there needs to be more\n\nIt's good but gets repetitive. Also the graphics could use some work. Their good but the fruit doesn't look 3d enough. I like the cartoonish style but their could be more design in things. Hopefully you come out with a big graphics update or something.\n\nGreat game but could use more\n\nHelpful | 1", "El_Dudeness12 minutes ago\nGreat game\n\nYeet\n\nHelpful | 0"]