{"App Title": "Showtime Anytime", "App description": "SHOWTIME ANYTIME is available on your Oculus Quest at no additional cost as part of your existing SHOWTIME subscription through participating providers. To sign in to the SHOWTIME ANYTIME app use the username/password you received from your provider and stream SHOWTIME.\n\nCalifornia Privacy/Info We Collect https://www.showtime.com/#privacy/california\nCalifornia Do Not Sell My Info https://ca.privacy.cbs/donotsell", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Media Player, Movie", "Languages": "English", "Version": "1.0.1.9", "Developer": "Showtime Networks, Inc.", "Publisher": "Showtime Networks, Inc.", "Website": "https://www.showtimeanytime.com/", "Release Date": "June 20, 2019", "Developer Privacy Policy": "SERIES\nMOVIES\nSPORTS\nCOMEDY\nDOCUMENTARIES\nAFTER HOURS\nCOMING SOON\nLIVE TV\nACTIVATE\nABOUT\nHELP\nFREE EPISODES\nLOG IN\nPAGE NOT FOUND\n\nWe couldn't find the page you requested.\n\nGO HOME\nABOUT\nAbout Showtime Anytime\nProviders\nHelp Center\nContact Us\nDEVICES\nActivate a Device\nSAMPLE SHOWTIME\nFree Full Episodes\nLive TV Schedule\nLEGAL\nTerms of Use\nPrivacy Policy\nVideo Services Policy\nMobile License Agreement\nClosed Captioning\nCalifornia Privacy/Info We Collect\nCalifornia Do Not Sell My Info\nMORE SHOWTIME\nTwitter\nFacebook\nInstagram\nVisit Sho.com\nSHO Store\n2020 Showtime Networks Inc. SHOWTIME and related marks are trademarks of Showtime Networks Inc., a ViacomCBS Company. All rights reserved. Showtime Anytime is accessible for viewing solely in the United States and its territories and possessions.", "Developer Terms of Service": "SERIES\nMOVIES\nSPORTS\nCOMEDY\nDOCUMENTARIES\nAFTER HOURS\nCOMING SOON\nLIVE TV\nACTIVATE\nABOUT\nHELP\nFREE EPISODES\nLOG IN\nPAGE NOT FOUND\n\nWe couldn't find the page you requested.\n\nGO HOME\nABOUT\nAbout Showtime Anytime\nProviders\nHelp Center\nContact Us\nDEVICES\nActivate a Device\nSAMPLE SHOWTIME\nFree Full Episodes\nLive TV Schedule\nLEGAL\nTerms of Use\nPrivacy Policy\nVideo Services Policy\nMobile License Agreement\nClosed Captioning\nCalifornia Privacy/Info We Collect\nCalifornia Do Not Sell My Info\nMORE SHOWTIME\nTwitter\nFacebook\nInstagram\nVisit Sho.com\nSHO Store\n2020 Showtime Networks Inc. SHOWTIME and related marks are trademarks of Showtime Networks Inc., a ViacomCBS Company. All rights reserved. Showtime Anytime is accessible for viewing solely in the United States and its territories and possessions.", "Space Required": "16.0 MB"}



["5 stars\n20%\n4 stars\n20%\n3 stars\n0%\n2 stars\n0%\n1 star\n60%", "alilarsJan 12 at 11:53 PM\nNo activation\n\nCouldnt find any place to let me activate this app on my quest. I tried web, I tired my iPhone app... NOTHING\n\nHelpful | 15", "hollmrlJun 24, 2019 at 9:05 AM\nCannot Activate Quest Devices\n\nTheir Website will not allow Quest devices to be activated. It lists various device options, but Quest is not listed. A case where one side of Showtime does not know what the other side is doing. They need to add Quest as a activation option on their Website. Will update review when problem is corrected.\n\nUpdate: I also tried activating using the iPhone app with Xfinity, and Quest does not show up as an activation option. With an iPhone (IOS) you are not allowed to use Web based activation. Success from other people must be with Android devices or other service providers. Cannot tell if this is a Showtime issue, Apple App issue or Xfinity issue, but I Still cannot activate.\n\nUpdate 2: You cannot activate using Xfinity (Comcast) because they do not support activation with Oculus devices. I upgraded my rating to reflect that, because I did not want to penalize Showtime for Xfinity issues.\n\nHelpful | 21", "JamesBVRJun 21, 2019 at 2:07 PM\nActivate from a phone or tablet with app\n\nWorks fine if you activate with the Showtime Anytime app on a tablet or phone. Just use Oculus as device to activate then enter the code displayed on the headset when you try to watch your first show or movie. The app itself works ok just wish we could have a way to see this in a larger screen environment like a cinema simulator. The influded Oculus video environment is ok but very limited. Please allow other environments and locations including void for example. Then it will be 5 stars.\n\nHelpful | 6", "jojasJun 21, 2019 at 10:18 AM\nWorks Perfectly\n\nThis app works perfectly. Just log in to your account on your phone app, go to menu, select activate devices, and pick oculus. Enter the code shown on the screen of the showtime headset app (enter code from the headset into your phone) and you are good to go. Thanks showtime!\n\nHelpful | 5", "KillahKonceptZJun 22, 2019 at 5:10 PM\nWorks great!\n\nSolid app that I can watch showtime on my Quest with! Wasnt able to active through the browser but downloaded the phone app and was activated and watching my fav shows in no time\n\nHelpful | 3"]