{"App Title": "SKYBOX VR Video Player", "App description": "SKYBOX is an ultimate local VR video player which supports video playback from local storage and network shared servers. \n\nAny Feedback is highly appreciated: \nBug Report & Join Beta Testing to support@SKYBOX.xyz \nDiscussions: https://forum.SKYBOX.xyz \nFAQ: https://SKYBOX.xyz/en/support/ \n\nWith SKYBOX, enjoy videos from your UPnP/DLNA media server or SMB share in the same Wi-Fi. A easy-to-set-up PC Client is available to support streaming from PC = Save your Storage! \nNo need to manually set the stereo mode such as 180 or 3D side-by-side; SKYBOX would recognize the correct format for you = Save your Life! \n\nFeatures include: \n1. Automatically recognize video stereo mode ( 180 / 360 / 2D / 3D ). \n2. AirScreen: stream videos to multiple headsets (download here: https://SKYBOX.xyz/en/download/)\n3. Support DLNA media servers and SMB (1.0 & 2.0) shares. \n4. 5K local and streaming playback. \n5. Simple and intuitive UI; Spectacular VR environment. \n\nRelax and enjoy SKYBOX :)", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Media Player, Movie, Productivity", "Languages": "English, English (US), Chinese (China), Chinese (Hong Kong), Chinese (Taiwan), French (France), German, Japanese, Korean, Russian, Spanish (Spain)", "Version + Release Notes": "1.0.0\n(LIVE)", "Developer": "SKYBOX STUDIO", "Publisher": "SKYBOX STUDIO", "Website": "https://SKYBOX.XYZ/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "SKYBOX\n\nBuy now\n\nPRODUCT\nSUPPORT\nROADMAP\nFORUM\nPrivacy Policy\n\nThis Privacy Policy is effective on January 24, 2017.\n\nWelcome to SKYBOX (\"SKYBOX,\" \"we,\" \"us\" or \"our\"). SKYBOX is an easy to use, powerful multi-platform VR player.\n\nOur Privacy Policy explains how we and some of the companies we work with collect, use, share and protect information in relation to our mobile services, website, and any software provided on or in connection with SKYBOX services (collectively, the \"Service\"), and your choices about the collection and use of your information.\n\nBy using our Service you understand and agree that we are providing a platform for you to create content, including sand artwork, comments and other materials (\"User Content\"), to the Service and to share User Content publicly. This means that other Users may search for, see, use, or share any of your User Content that you make publicly available through the Service, consistent with the terms and conditions of this Privacy Policy and our Terms of Use (which can be found at legal@SKYBOX.xyz).\n\nOur Policy applies to all visitors, users, and others who access the Service (\"Users\").\n\n1 . INFORMATION WE COLLECT\n\nWe collect the following types of information.\n\nInformation you provide us directly:\n\nYour username, password and e-mail address when you register for a SKYBOX account.\n\nProfile information that you provide for your user profile (e.g., profile picture).\n\nUser Content (e.g., sand artwork, comments, and other materials) that you post to the Service.\n\nCommunications between you and SKYBOX. For example, we may send you Service-related emails (e.g., account verification, changes/updates to features of the Service, technical and security notices). Note that you may not opt out of Service-related e-mails.\n\nAnalytics information:\n\nWe use third-party analytics tools to help us measure traffic and usage trends for the Service. These tools collect information sent by your device or our Service, including the web pages you visit, add-ons, and other information that assists us in improving the Service. We collect and use this analytics information with analytics information from other Users so that it cannot reasonably be used to identify any particular individual User.\n\nCookies and similar technologies:\n\nWhen you visit the Service, we may use cookies and similar technologies like pixels, web beacons, and local storage to collect information about how you use SKYBOX and provide features to you.\n\nWe may ask advertisers or other partners to serve ads or services to your devices, which may use cookies or similar technologies placed by us or the third party.\n\nLog file information:\n\nLog file information is automatically reported by your browser each time you make a request to access (i.e., visit) a web page or app. It can also be provided when the content of the webpage or app is downloaded to your browser or device.\n\nWhen you use our Service, our servers automatically record certain log file information, including your web request, Internet Protocol (\"IP\") address, browser type, referring / exit pages and URLs, number of clicks and how you interact with links on the Service, domain names, landing pages, pages viewed, and other such information. We may also collect similar information from emails sent to our Users which then help us track which emails are opened and which links are clicked by recipients. The information allows for more accurate reporting and improvement of the Service.\n\nIn case the Service should malfunction, the web page or app may send diagnostic information about the user session to our or third party servers to be analyzed.\n\nDevice identifiers:\n\nWhen you use a mobile device like a tablet or phone to access our Service, we may access, collect, monitor, store on your device, and/or remotely store one or more \"device identifiers.\" Device identifiers are small data files or similar data structures stored on or associated with your mobile device, which uniquely identifies your mobile device. A device identifier may be data stored in connection with the device hardware, data stored in connection with the devices operating system or other software, or data sent to the device by SKYBOX.\n\nA device identifier may deliver information to us or to a third party partner about how you browse and use the Service and may help us or others provide reports or personalized content. A device identifier together with log files may also be helpful when tracking down errors in the Service. Some features of the Service may not function properly if use or availability of device identifiers is impaired or disabled.\n\nMetadata:\n\nMetadata is usually technical data that is associated with User Content. For example, Metadata can describe how, when and by whom a piece of User Content was collected and how that content is formatted.\n\nUsers can add or may have Metadata added to their User Content including a hashtag (e.g., to mark keywords when you post a photo), geotag (e.g., to mark your location to a photo), comments or other data. This makes your User Content more searchable by others and more interactive.\n\n2 . HOW WE USE YOUR INFORMATION\n\nIn addition to some of the specific uses of information we describe in this Privacy Policy, we may use information that we receive to:\n\nHelp you efficiently access your information after you sign in\n\nRemember information so you will not have to re-enter it during your visit or the next time you visit the Service\n\nProvide personalized content and information to you and others, which could include online ads or other forms of marketing\n\nProvide, improve, test, and monitor the effectiveness of our Service\n\nDevelop and test new products and features\n\nMonitor metrics such as total number of visitors, traffic, and demographic patterns\n\nDiagnose or fix technology problems\n\nAutomatically update the SKYBOX application on your device\n\nSKYBOX may run contests, special offers or other events or activities (\"Events\") on the Service. If you do not want to participate in an Event, do not use the particular Metadata (i.e. hashtag or\n\n3 . SHARING OF YOUR INFORMATION\n\nWe will not rent or sell your information to third parties outside SKYBOX without your consent, except as noted in this Policy.\n\nParties with whom you share your User Content:\n\nAny information or content that you voluntarily disclose for posting to the Service, such as User Content, becomes available and searchable to the public.\n\nIf you remove information that you posted to the Service, copies may remain viewable in cached and archived pages of the Service.\n\nParties with whom we may share your information:\n\nWe may share your information as well as information from tools like cookies, log files, and device identifiers and location data, with third-party organizations that help us provide the Service to you (\"Service Providers\"). Our Service Providers will be given access to your information as is reasonably necessary to provide the Service under reasonable confidentiality terms.\n\nWe may also share certain information such as cookie data with third-party advertising partners. This information would allow third-party ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you.\n\nWhat happens in the event of a change of control:\n\nIf we sell or otherwise transfer part or the whole of SKYBOX or our assets to another organization (e.g., in the course of a transaction like a merger, acquisition, bankruptcy, dissolution, liquidation), your information such as username and email address, User Content and any other information collected through the Service may be among the items sold or transferred. You will continue to own your User Content. The buyer or transferee will have to honor the commitments we have made in this Privacy Policy.\n\n4 . HOW WE STORE YOUR INFORMATION\nStorage and Processing:\n\nYour information collected through the Service may be stored and processed in the United States or any other country in which SKYBOX, its Affiliates or Service Providers maintain facilities.\n\nSKYBOX, its Affiliates, or Service Providers may transfer information that we collect about you, including personal information across borders and from your country or jurisdiction to other countries or jurisdictions around the world. If you are located in the European Union or other regions with laws governing data collection and use that may differ from U.S. law, please note that we may transfer information, including personal information, to a country and jurisdiction that does not have the same data protection laws as your jurisdiction.\n\nBy registering for and using the Service you consent to the transfer of information to the U.S. or to any other country in which SKYBOX, its Affiliates or Service Providers maintain facilities and the use and disclosure of information about you as described in this Privacy Policy.\n\nWe use commercially reasonable safeguards to help keep the information collected through the Service secure and take reasonable steps (such as requesting a unique password) to verify your identity before granting you access to your account. However, SKYBOX cannot ensure the security of any information you transmit to SKYBOX or guarantee that information on the Service may not be accessed, disclosed, altered, or destroyed.\n\nPlease do your part to help us. You are responsible for maintaining the secrecy of your unique password and account information, and for controlling access to emails between you and SKYBOX, at all times.\n\n5 . YOUR CHOICES ABOUT YOUR INFORMATION\nYour account information and profile/privacy settings:\n\nUpdate your account at any time by logging in and changing your profile settings.\n\nAs noted above, you may not opt out of Service-related communications (e.g., account verification, purchase and billing confirmations and reminders, changes/updates to features of the Service, technical and security notices).\n\nHow long we keep your User Content:\n\nFollowing termination or deactivation of your account, SKYBOX, its Affiliates, or its Service Providers may retain information (including your profile information) and User Content for a commercially reasonable time for backup, archival, and/or audit purposes.\n\n6 . CHILDRENVS PRIVACY\n\nSKYBOX does not knowingly collect or solicit any information from anyone under the age of 13 or knowingly allow such persons to register for the Service. The Service and its content are not directed at children under the age of 13. In the event that we learn that we have collected personal information from a child under age 13 without parental consent, we will delete that information as quickly as possible.\n\n7 . OTHER WEB SITES AND SERVICES\n\nWe are not responsible for the practices employed by any websites or services linked to or from our Service, including the information or content contained within them. Please remember that when you use a link to go from our Service to another website or service, our Privacy Policy does not apply to those third-party websites or services. Your browsing and interaction on any third-party website or service, including those that have a link on our website, are subject to that third partys own rules and policies. In addition, you agree that we are not responsible and do not have control over any third-parties that you authorize to access your User Content. If you are using a third-party website or service and you allow them to access your User Content you do so at your own risk.\n\n8 . HOW TO CONTACT US\n\nIf you have any questions about this Privacy Policy or the Service, please contact us at support@SKYBOX.xyz.\n\n9 . CHANGES TO OUR PRIVACY POLICY\n\nSKYBOX may modify or update this Privacy Policy from time to time, so please review it periodically. We may provide you additional forms of notice of modifications or updates as appropriate under the circumstances. Your continued use of SKYBOX or the Service after any modification to this Privacy Policy will constitute your acceptance of such modification.\n\nTerms of UsePrivacy PolicyContact Us\n\n 2020 SKYBOX All Rights Reserved.\n\n English", "Developer Terms of Service": "SKYBOX\n\nBuy now\n\nPRODUCT\nSUPPORT\nROADMAP\nFORUM\nTerms of Use\n\nI READ THROUGH THE COMPLETE DOCUMENTATION OUTLINING THE TERMS AND CONDITIONS REGARDING THE SKYBOX WEB PAGE PRIOR TO ACCESSING THE SKYBOX WEB PAGE. BECAUSE THE SKYBOX WEB PAGE IS FREE TO ACCESS, THERE ARE CERTAIN TERMS AND CONDITIONS THAT ARE REQUIRED FOR USERS TO COMPLY WITH, YOU MUST READ THROUGH THEM. REVIEW THEM AND DISENGAGE USAGE OF THE SKYBOX WEB PAGE IN THE EVENT THAT YOU DO NOT AGREE TO THE TERMS AND CONDITIONS OF THE SKYBOX WEB PAGE.\n\nACCEPTANCE OF AGREEMENT\n\nYou agree that you will abide by the full terms and conditions text as outline within this Terms of Usage document, which is a legally binding contract, with respect to the SKYBOX Web Page. This agreement is the exclusive contract between you and SKYBOX with regard to the SKYBOX Web Page, and it supersedes all prior agreements, understandings, representations, and warranties with regard to the SKYBOX Web Page and its content. SKYBOX may alter the contents of the agreement or any portion of the SKYBOX Web Page at the sole discretion of SKYBOX.\n\nCOPYRIGHT\n\nAll content found on and regarding the SKYBOX Web Page are under the exclusive ownership of SKYBOX .\n\nALTERATIONS AND TERMINATIONS\n\nSKYBOX is within its full, total, exclusive rights to alter or entirely terminate this document or any documents and content that may appear on the SKYBOX Web Page, and not under the obligation of specifically notifying you under such circumstances\n\nINDEMNIFICATION\n\nYou agree that you will indemnify, defend and hold SKYBOX, its employees, its attorneys, its partners, its shareholders and its officers free from any kind of liability, claim, loss, expense and damages when it is related to your violation of usage of the SKYBOX Web Page or violation of the SKYBOX Web Page agreement.\n\nDISCLAIMER\n\nALL OFFERS, SERVICES, PRODUCTS AND CONTENT OF THE SKYBOX WEB PAGE ARE OFFERED TO YOU ON AN AS IS BASIS WITHOUT ANY SORT OF WARRANTY, WHETHER OR NOT IT IS EXPRESS OR IMPLIED. SKYBOX DISCLAIMS ALL WARRANTIES, WHICH INCLUDES BUT IS NOT LIMITED TO THOSE THAT ARE IMPLIED REGARDING FITNESS FOR A PARTICULAR PURPOSE, TITLE, QUALITY, MERCHANTABILITY, AND NON-INFRINGEMENT WITH COMPLETE RESPECT TO THE SKYBOX WEB PAGE. THE INFORMATION THEREOF MAY BE SUBJECT TO PROBLEMS AND BUGS, BUT SKYBOX DOES NOT ACCEPT LIABILITY SHOULD THESE AFFECT YOU IN ANY WAY, REGARDLESS OF ANY INDIRECT, INCIDENTAL OR EXEMPLARY DAMAGES, WHICH INCLUDE BUT ARE NOT LIMITED TO LOSS OF PROFITS, LOSS OF BUSINESS, LITIGATION OR LOSS OF MONEY, WHETHER THEY ARE BASED IN BREACHES OF CONTRACT OR WARRANTY, PRODUCT LIABILITY OR NEGLIGENCE, EVEN IF SKYBOX WAS PREVIOUSLY ADVISED OF SUCH POSSIBILITIES.\n\nLIMITS\n\nThe responsibility and the liability of any damages you may suffer due to viruses that are contained within any file of the SKYBOX Web Page that contain a document or a forum are entirely disclaimed. SKYBOX refuses to be liable for any indirect, incidental or exemplary damages that arise due to your use of or your inability to use the SKYBOX Web Page.\n\nSUBMISSIONS\n\nAny and all concepts, suggestions, notes, ideas, and submissions that you provide to SKYBOX of your own free will are deemed and will become and remain the exclusive property of SKYBOX, and SKYBOX is not to be subject to confidence regarding the submissions on behalf of SKYBOX. SKYBOX will not be under any obligation at all to compensate the person who has provided the submission to SKYBOX through the SKYBOX Web Page.\n\nTerms of UsePrivacy PolicyContact Us\n\n 2020 SKYBOX All Rights Reserved.\n\n English", "Space Required": "264.1 MB"}



["5 stars\n79%\n4 stars\n12%\n3 stars\n3%\n2 stars\n1%\n1 star\n4%", "wxtact11 hours ago\nNice app but an improvement'll be better\n\nA very nice VR video player that supports many file formats, with different environments, tilt screen and different scales of the screen. I really enjoyed watching movies with it.\nOne thing that can be improved is the \"scale\" function. Currently if you make the screen larger, it will become closer. Is it possible to enlarge the screen without pulling it closer?\nThanks for the excellent work of the developers.\n\nHelpful | 0", "ansonort19 hours ago\nA lovely cinema to watch my movies\n\nReally simple to set up and - THANK GOODNESS - it is Mac-compatible. The cinema environment is really lovely and the ability to control the aspect ratio etc is well designed and effective.\n\nOne thing: Im lonely. It is a bit strange watching a movie on a big screen in an empty cinema. Any chance of creating a different cinema skin with more people in it? Not interactive people - Id just like the feeling that Im enjoying the movie with other folk, like a real movie theatre.\n\nThank you developers. And thank you very much for thinking about Mac users in your design.\n\nHelpful | 0", "TomMhClJul 20 at 3:31 PM\nWorks perfectly\n\nThis video player works exactly as I had dreamed it to. It flawlessly streams videos from my network drive I can't even get my pc to run without jitters. The ui doesn't get in your way. It just works - perfectly. If you're wondering if this app is worth your money.. it most definitely is\n\nHelpful | 5", "AlexandreOlv2 days ago\n3D movies in it's perfection\n\nI've tried other players, but Sky is the best 3D video player I've found. The \"moon room\" is perfect for movies. The only thing I'd pay for a change is the ability to move the subtitles. It's always below the video. Besides that, it's just the best!\n\nHelpful | 0", "alanchowJul 22 at 10:33 PM\nThe solution to NAS stores movies!!!\n\nThis is a really good media player. Plays pretty much everything I have thrown at it including 10bit encoded 1080p H265 encoded videos and 3D MOVIE!! I even tried 4K videos steaming from my NAS and it was great.\n\nI do have a few suggestions though which would make it even better\n\n Ability to utilise hand tracking to control\n Ability to favourite network folders so you dont need to dive into the folder hierarchy every time.\n Ability to relock the screen in a different position permanently (so when you are lying down you can watch from a static position rather than it follow you)\n\nHelpful | 3\nDeveloper ResponseJul 27 at 11:52 PM\n\nHi there, regarding your suggestions: 1. Hand tracking: we are working on it. 2. Favorite network folders: we test it but it could easily cause crash, so we won't support it unless we find other satisfying solutions. 3. Lock screen: you could reset screen to your front by long pressing the B/Y on your controller (works for non-VR and VR 180 videos). Hope it helps. Cheers.", "joecotelleseJul 21 at 6:52 AM\nOMG I'm in a movie theater\n\nThis is a VR killer app for me. I've always wanted to experience a true movie theater experience in my home. This is as close as it's going to get.\n\nI love the way this app performs with my Plex server setup for DLNA. The in-theater lighting effects are pretty sweet too.\n\nThere are a couple of things that keep me from giving it 5 stars.\n\n* I'd like to walk around my environments. The living room looks pretty sweet, let me check it all out!\n* I can't seem to favorite movies that are on the network.\n* When I launch I should see a list of my recently played so I can pickup where I left off regardless of what the source of the file is.\n* CC always seems on when I start a movie. I'd like a way to turn it off globally.\n* I'd like to have different movie theater models.\n* I like the preset theater seats but I'd love to be able to get up and walk around.\n\nHelpful | 1\nDeveloper ResponseJul 28 at 1:35 AM\n\nHi there, thanks for the review. Regarding features that you suggest: 1. Walk around in the environments: it will take 3D artists a lot of working hours to build the whole environments for user to explore (like in games). As a small studio we don't have such resources to achieve that. We'll try to add more theatres in the future. 2. Favorite movies on the network will easily cause crash. We won't support this feature until we find another solution around. 3. On the right side of the tab there is a \"History\" tab where you could choose the video from last time. 4. CC always turns on: it's a bug that we will fix in the next release. Thank you for your understanding and support. Cheers.", "dean.langley.910 days ago\nSkybox\n\nGreat app 3d films r ace in all formats well worth the money and I sit in a realistic cinama great even got curve screen as well if u like they sort of thing\n\nHelpful | 1", "simon654May 31 at 3:45 PM\nGreat a must buy\n\nThis app has been around for years on a number of VR platforms and it's still stunning and just works. I've used this on long haul flights, with local content and with DLNA from Plex on my local network it always works.\nIt works with 360 videos recorded from LG360 cam and insta 360.\n\nI've not had any codec issues\n\nI'd love WebDAV support.\n\nHelpful | 7", "AlleyGuy3 days ago\n\nI think I would buy the Oculus Quest just to use Skybox. Watching movies and concerts is phenomenal.\n\nHelpful | 0", "Alfamonk2 days ago\nThis could be a 5 stars player\n\nUnfortunately, it is missing a lot of features you can find on other VR players. What's really strange is that even basic things like image settings are missing. Not even you can't set the contrast, sharpness and stuff, but even the one you set, can't be saved. So if I like a more vivid colour in my movies, I will have to go to do the setup for every single movie, every single time. Please add a \"remmember settings\" or something...\n\nAlso, it's unbelievable you can't set a bookmark or a favourite folder on network. Every single time you have to manually browse for that file. Please make it more user friendly. Maybe even automatically save the file and movie position, so when you start the app again, you can simply click resume movie.\n\nIt would also be perfect if it could be able to play 3d Blu-ray movies without the need of riping them. I understand it's a HDCP issue, so I will get over that. Although, there are ways that some players could just render the Blu-ray movie as a side by side or top bottom, and then merge them for 3D. That would be lovely to see...\n\nAnd maybe it would be great to add antialiasing, texture, resolution modes. I've noticed it goes in 3072 x 3072 if I set the pro mode. I would like to see some more options. Thank you!\n\nHelpful | 0", "Ormond.PlynthMay 10 at 8:33 PM\nAmazing, fast video player\n\nAfter trying to run movies off my laptop's external drive with Virtual Desktop, I thought the idea was out of reach out my hardware and network. Enter Skybox. This thing just works. Man! Crazy fast with nothing but wireless at both ends. Wow! I like the theater setting, too.\n\nI'm not bothered by the solo experience. That's fine. The only thing I'd ask for is De-interlacing, built in to the viewer. That's probably a lot to ask for, and may require more horsepower than a Quest had to spare.\n\nBut, solid, five star effort. Thanks!\n\nHelpful | 15", "nightslashs9 days ago\nGreat app with a single gripe\n\nThis app works great my only problem with it is you cant use it at all in offline mode which is frustrating for car trips or things of the sort\n\nHelpful | 1", "Banja78Jun 9 at 9:15 AM\nThis works fine !\n\nI downloaded skybox as I needed a player to watch 2D and 3D360 videos and was not disappointed.\nWether they are charged on my Quest or streamed, it just works.\nI like when a product has a clear and simple purpose and does it with no trouble. So 5 stars.\n\nThe environnements available are more than great (watching favorite bands concerts in the the space station is amazing !), a few more rooms would be always welcome.\nI like the home lounge too but strangely I cannot stay in it to watch a video. Maybe I did not find that option.\n\nHelpful | 3", "ATP-FloJul 10 at 6:00 PM\nStill the best\n\nUsed it on the Rift, still use it with the Quest. [Basicalle just the same experience.]\nIt got better and better over the years. Still the best videoplayer you can use in VR.\nRecommend 6/5.\n\nHelpful | 1", "Xtv16 days ago\nVery good for video\n\nExcellent tool to view video, but needs improvement to support pictures.\nOne of the best uses of Oculus Quest is to view travel panorama pics on a large curved screens.\n\nHelpful | 1\nDeveloper Response15 days ago\n\nSupport picture format is on our roadmap :) Just need time to develop the features one by one.", "YangYangYannngJul 19 at 11:00 PM\nBest app for streaming videos from PC\n\nVery solid for streaming videos from my PC. However, it can't play 5K (5400X2400) 60fps 180 LR videos smoothly, although I have a stable 5Ghz Wi-Fi and sit within 1m by my router. I'm not sure whether it's the app's limitation or Quest itself or Wi-Fi connection.\n\nHelpful | 1\nDeveloper ResponseJul 19 at 11:43 PM\n\nHi there, this is the limitation of the Quest. According to our test, Quest could play 5k (up to 5760x2880) 180 videos at 30fps. 60fps will be stuttered on Quest. Hope this helps.", "Ekemp27Jun 10 at 5:35 PM\nGreat with NAS\n\nWorks very well if you download content and transfer it to the unit its self or stream from a PC on the same network or a NAS. I love my loaded NAS and being able to stream from it is fantastic. I can't express how easy it is to use. If you have 3D movies they look better then in the theater or on my 3D TV. It's the way to go!\n\nA PS. The ability to adjust the sound track time is great. If the mouth isn't lining up you can fix it under soundtrack settings. Fantastic as wifi can be glitchy when streaming off internal systems. Great feature!\n\nHelpful | 2", "shashking404Jul 5 at 5:10 PM\nit's only missing Hand tracking support\n\nbut 5 stars!\nGreat features include\nwatching videos from desktop.\nWatching stuff while cooking in moon!\n\nSide note: High frame rate, 60 FPS looks amazing in VR\n\nHelpful | 2", "TelliaxJul 28 at 3:02 AM\nOK player\n\nThe player works fine, both for local files and through airplay (did not get a chance to test other streaming options). The player is missing some basic features though, hence the 3 star. What comes to mind straight away:\n1) Can't center screen vertically. So it forces you to sit while watching. You can use tilt, but it is inconvenient and some times not enough (can't tilt more than 90 degrees)\n2) Can't flip video vertically\n3) Can't refresh airplay library. You basically select a folder when you first launch a streamer and that's it. Want to add a new file to this folder? You are out of luck.\n4) Thumb button constantly screws screen alignment and I have no idea how it works. No description anywhere in the app, let alone controler mapping settings.\n5) Settings in general are very minimalistic.\n\nWould have rated it 4 or 5, if it was a free app, since the bar would be lower . But as a paid app it feels unfished and unpolished.\n\nHelpful | 1", "elliotgraytho10 days ago\nJudder makes films unwatchable\n\n24p content is 100% unwatchable as the system has no support for native 24fps conent display at 24hz, or correct interpolation. Bought to watch high quality side by side Bluray rips. Oculus gallery can handle this if you're looking for an alternative apparently.\n\nHelpful | 0", "emklettJul 22 at 12:39 PM\nGreat player overall but bit bloated\n\nThis player is not perfect, it seems that it has a lot of dependencies and not the most optimized code which drains performances, but so far, it is quite satisfying to use.\n\nPros:\nGreat UI\nNeat cinema environment\nGood feature set\n\nCons:\nDrains battery very fast (optimizations welcome)\nScrolling the timeline is really not smooth (optimizations welcome as well)\nVideos regularly pause with no reason ?\n\nHelpful | 0\nDeveloper ResponseJul 28 at 1:25 AM\n\nHi there, regarding the cons: 1. Battery drains very fast: depending on what resolution you watch. If you stream 5K videos then it's possible the battery drains fast. It's the limitation of Quest itself. 2. Scrolling timeline: what do you mean please? 3. Videos pause for no reason: it's unusual and we don't encounter such problem during testing. We really appreciate if you could share with us more details at support@skybox.xyz regarding 2&3 so we could provide further help. Cheers.", "wazap87Jul 25 at 5:06 AM\nGreat for watching 3D movies\n\nA lot of settings and supported video formats. My favorite app for a cinema like experience :)\n\nHelpful | 1", "Tru187Jul 15 at 9:26 AM\nStutter video playback\n\nPlaying vids in 180 sbs resolution of 2700p getting a lot of stutter on all videos. Lowe ees video play back fine. I do have very high bandwidth. This be fixed with and update?\n\nHelpful | 0\nDeveloper ResponseJul 17 at 5:03 AM\n\nWe appreciate if you could share with us one test video at support@skybox.xyz so we could test it on our side. Cheers.", "SnPR_KamJul 6 at 10:44 PM\nCan't play files via DLNA server\n\nSo I use my phone as a DLNA server, but can't watch anything. I can watch videos from my headset, but when I try to watch one from my phone it just crashes. This isn't a problem with my dlna server, as I've tried 2 different server apps and they both work fine on my PC and Xbox. It is, however, a good media player. Until the issue is fixed I'm rating it 2 stars.\n\nHelpful | 1\nDeveloper ResponseJul 14 at 1:56 AM\n\nHi there, what DLNA server do you use please? Please write to us at support@skybox.xyz so we could provide further support.", "Aurel74-FR14 days ago\nCan t watch movie without internet now\n\nIt was really nice but now i can t use it to watch local video on my quest without internet connection. So it s totally useless when i m on travel. Please bring it back like it was\n\nHelpful | 0", "Harcourt.MuddApr 23 at 10:27 AM\nFantastic!\n\nThis is the media player to use, awesome to be able to watch my videos off of my computer and not need to transfer them to the quest first. Only improvement would be to be able to watch with friends. My partner bought a quest and there aren't any good apps like this that let us watch together. We can both press play at the same time but I can hear the audio from her quest and we're always a little out of sync. I thought watching things together was a big part of VR, come to find out the quest is completely devoid of apps that let you watch together. And yes, I tried big screen, doesn't support watching together unless I have a good gaming pc connected (which I do not have).\n\nHelpful | 9", "donkeyhighFeb 24 at 4:49 AM\nThere's just ONE missing feature. ONE!\n\nThat's it. Just one missing feature.\nAfter using SkyBox, I wanted to watch a movie with a friend who lives right next door, we thought we could meet up in SkyBox, but quickly discovered that, well, we couldn't. So we tried some other mediaplayers, and obviously found BigScreen. Well, after being used to SkyBox, anything else was just bad. The picture quality was horrible compared with SkyBox. We both have 500mbit/s fiber-optics connections and high-end routers. And the PC we used to stream is connected with an ethernet cable. In the end we just gave up on BigScreen and instead both started the movie at the same time in SkyBox and had open mic so we could talk during the movie. So that's it. My one request, being able to host rooms and invite a friend or two.\nOther than that, the SkyBox experience is flawless. I love being able to stream movies/series from my Raspberry Pi directly to SkyBox without any middle-man. 11/10, would download again! And of course recommend to all my friends that are getting into VR.\n\nHelpful | 74\nDeveloper ResponseMar 20 at 12:40 AM\n\nThanks very much for the feedback. It's always nice to hear people enjoying SKYBOX. Right now we focus more on offering the best experience of watching higher quality videos (potentially 8k in the future). Social features, such as inviting friends, are not our primary focus. We have only a few people working on this project and we are trying hard to bring more features alive in the future. Please be patient with us. Cheers! PS Say thanks to your friend next door for us also ;)", "eapleasantJul 9 at 3:48 PM\nOk\n\nI really want to love this. While the theater, sound and ease is amazing it just doesnt work. The only reason I purchased this was so I could watch 3d movies, they play for 20 minutes and then stop. I have looked everywhere to fix this issue but no one seems to have an answer. I would really love to watch an entire movie.\n\nHelpful | 0\nDeveloper ResponseJul 14 at 1:55 AM\n\nHi there, we didn't encounter this and you should be able to play the entire movie without any trouble. We appreciate if you could write to us at support@skybox.xyz with more details so we could provide further help.", "mcpishMay 8 at 10:33 PM\nTerrific Media Player + some suggestions\n\nThis is a fantastic media player. I play my videos shared from an SMB (Samba) share from my Linux server. It lets you enter authentication details (username/password) for your shares, so that's all good. Love the option to have either a curved screen or flat screen. I love the way the video affects the lighting in the theatre. A few suggestions: I'd LOVE to see an option for old school CURTAINS over the screen, when you start a film it would project all distorted onto the curtain until they slide open (left/right) to reveal the regular screen behind it. Just like the way old movie theatres used to be. I'd also like to see some steeper/stadium style theatres. I feel the default theatre places you too low (below the screen). This can be resolved by using the other environments by placing yourself higher up, but not in the theatre environment. I'd rather be higher up in the centre vertically than below.\n\nHelpful | 2", "jinwypJul 18 at 3:34 AM\nnot working on system upgrade 18\n\nGood player But after I upgrade to system 18, It can't play any videos, show unknown error\n\nHelpful | 0\nDeveloper ResponseJul 19 at 11:41 PM\n\nHi there, please contact us at support@skybox.xyz so we could provide further help. We didn't encounter any issues when upgrading our device to v18.", "RMajereJun 30 at 7:54 PM\nWorks as intended\n\nI use it to watch videos of the games I record as well as play video on my home sever. All works well.\n\nHelpful | 0", "Neo_and_Morpheus13 hours ago\nShould be included as standard app\n\nThis should be included with the quest as a default app. Really annoyed I had to purchase an extra app for this but plays most of my videos and is easy to connect to my local file server that stores all my movies. Oculus, please buy this company and include as standard app, so much better than your default video app!\n\nHelpful | 0", "TrashyPanda_Jun 3 at 10:37 PM\nFantastic media player\n\nI don't often write reviews on here, but I use this app enough that I figured I'd write one. This may just be my favorite thing in VR.\n\nHelpful | 2", "AlextorndjJun 18 at 3:40 AM\n\nA really great player !\nEasy to use, high compatibility with most video formats, nice user interface...\nHighly recommended.\n\nHelpful | 1", "hoefnixJun 10 at 6:59 AM\nGreat media viewer\n\nDoes what is expected and does it great. Both Plex streams or media files on a NAS are played perfectly. The surroundings are fun, I like the movie theatre best.\n\nHelpful | 0", "mjcukJun 27 at 9:55 AM\nGreat media player\n\nPerfect for streaming from Plex and any other source you can think off.\n\nHelpful | 0", "william.mcknight828Apr 29 at 9:09 PM\nCan I just be honest?\n\nSkybox is just the perfect way to experience my home made porn videos. Thank you!\n\nHelpful | 16", "bryanloMay 7 at 11:15 AM\nGreat video player and more please\n\nFirst, thank you so much of this .\nMay I ask for more if possible ..\nwhat if this can view 360, 180 video and photos image formats in 2D and 3D as well if possible, please\n\nAble to import photo ( movie posters ) into the environment , able to select different frame for the photo and hang it up to the wall inside the environment.\n\nThank you again.\n\nHelpful | 0", "AszakalMay 18 at 1:47 AM\nReally good app but...\n\nEvery thing is like in description, I really like this app but I have one problem with my hard-drive connected to wifi router, skibox won't save password for my wireless hard-drive, Every time when I want to watch some movie on my hard-drive I need to log in first and app wont save password, very annoying.\n\nHelpful | 1\nDeveloper ResponseMay 18 at 5:59 PM\n\nPlease check if you are using static IP address or a dynamic one. If you are using dynamic, then SKYBOX cannot save your password because the IP address changes every time. For more support, please contact us at support@skybox.xyz", "Skeebo123Jul 13 at 7:04 PM\nGUI needs work\n\nThe movie player controls cover nearly half of the image on Oculus Quest. It does do a few things nicely but the clunky interface is a big drawback.\n\nHelpful | 0\nDeveloper ResponseJul 14 at 2:04 AM\n\nThe interface could be hidden while playing the video.", "algerpixelMay 13 at 10:29 PM\nDLNA is how I watch, but ..\n\nI have a local Plex server that I access through Skybox on my Quest.\nI love doing this, and it is the main reason I had in mind when ordering the Quest in the first place.\nOf course, now that I have had one for awhile, I use it for much more than just movie watching.\n\nDLNA makes it all possible. However, it would be even better if Skybox had the option to grab IMDB meta-data, either a'la carte, or to build an index of a folder of movie and tv shows.\n\nI know Skybox has a ways to go before you will consider it completely \"done\", and I hope you will give this some consideration.\n\nHelpful | 0", "TAZ2020Jun 16 at 6:05 AM\nAbsolutely the best!!\n\nSeems to work perfectly with everything!!!\nNo hassle. No Fuss. Thanks Guys!!\n\nHelpful | 0", "shmukalab12 days ago\nGood product but ...\n\nGood idea. Works well, when it works. Interface is clean and functional. All would have been great if it did not crash. In my first half hour of use it crashed 3 times. I mainly use to access my media files stored on NAS. (Linux based SMB). Hopefully developer will be able to track down these issues.\n\nHelpful | 0", "paul.horton.568Apr 21 at 2:19 PM\nExcellent movie player!\n\nUpload you movies and 3D movies to your Quest and you have your very own cinema! Superb performance and ease of use. Make sure you move yourself down to the front of the cinema for the ultimate experience! Recommended!\n\nHelpful | 2", "inceptionalMay 9 at 12:10 PM\nStellar quality\n\nI love the quality here. And, unlike some people, I actually like that it doesn't have all the \"social\" crap that bloats the likes of Bigscreen. Great stuff.\n\nHelpful | 1", "Mr.EwmanJun 1 at 10:28 PM\nWoks great\n\n\n\nHelpful | 0", "Sn_kusMay 30 at 3:17 AM\nCool media player! Recommend It!\n\nGood media player for quest. Can much)\n\nHelpful | 0", "myversiteeJan 11 at 5:01 PM\nSpectacular ... and free\n\nI rather doubted a completely free player could be that powerful.\nThanks to all the good reviews and the description I noticed it even plays SMB shared files. So I gave it a try.\nIt comes with a full own environment similar to the ones in the Quest Home. And it literally played anything I gave it.\nI tend to store files on my file share, which is a samba share on Linux now, but I also gave a genuine Windows SMB share a try.\nThis player seems to be able to play anything that contains valid video and audio, even DTS and Dolby multichannel, from local storage, SMB, DLNA ...\nAnd it makes the experience so immersive.\nIf the file is a 180 or 360 degree video, it will of course cover your entire field of view.\nIf it is a 2D classic video, you can watch it in a cinema environment you can customize, such as a modern cinema, space, a void ...\nIn the cinema environment you can even choose whether to be in the front, middle or back, and dim the light as far as you wish. And it is 6DOF, so you lean back in your virtual premium leather chair, dodge to the sides .. whatever.\nI was wondering what the magic is that movies and the environment look so crisp and seemingly sharper than any other content on the Quest. It is so fantasticly polished and has realistic textures. It is so much fun watching mobile phone recordings and old TV series in ... a real movie theater.\nThe best thing is you can let the player auto detect the video type which works almost any time, or you can manually adjust so many things, like keep te screen fixed in the center of view or at the wall so you could look away, if it is a sbs/topbottom 3D movie, manipulate the angle and distance in a 180 degree clip ...\n\nIt is the all in one player that can do anything,\nSo I will most ertainly never look out for a replacement.\n\nHonestly, you should charge a few bugs for it,\nGorgeous work!\nI can recommend it to anyone at any time,\nit is even great when showcasing VR experiences to newbies carefully.\n\nHelpful | 43", "Theobald93Apr 24 at 2:03 AM\nGood network VR player\n\nGood free VR player that works with SMB Network Storage, but if the HDD is in Standby sometimes the App crash because it does not wait very long for the HDD to response.\nNot every video is recognized properly so I have to change the VR settings often.\nVideo does not loop very well, there is a huge gap between end and the begin.\nWould love to see this problems being fixed.\nEdit: When using loop (of one video) there is no need to recognize the correct format again.\n\nHelpful | 0\nDeveloper ResponseApr 23 at 12:34 AM\n\nThe gap is to prep the app for recognizing the correct format of the next video. Given that we could use SKYBOX to watch not only flat videos but also 180 or 360 videos, SKYBOX would need time to switch to a different screen in order to display the right format. It's not a bug. Thank you for your understanding.", "King_Of_EgyptMar 27 at 2:50 PM\nAmazing app\n\nThis is the best cinema app I ever used soooo far\nI like everything thing\nGreat atmospheres\nVery professional tools\nI'm in love with this app\nThank you for making this easy\nThis is a great job really great\nI appreciate that and also very happy to use this great app for free\nGuys, you are simply amazing\n\nHelpful | 1", "DarthFrancoMay 4 at 10:46 AM\nThe best way to watch movies in VR\n\nIf you have your own content this is a great app. With they added more environments but still awesome\n\nHelpful | 0", "yates07Jul 24 at 11:03 PM\nWorks great\n\nSeems to work very well once connected to my NAS. Would be awesome if I could link with other VR headsets so a group could all watch a movie together with the movie being synced with all the headsets. Otherwise I really enjoy the app. Great job.\n\nHelpful | 0\nDeveloper ResponseJul 28 at 1:18 AM\n\nCurrently our focus is more of playing high-res video smoothly instead of supporting multiplayer modes. Cheers.", "curtis.sammyApr 28 at 11:10 AM\nUpdate 16 brightness\n\nWith update 16 the screen brightness don't adjust with the left side it remains bright in app\n\nHelpful | 0\nDeveloper ResponseMay 12 at 5:56 AM\n\nLooking into it. Thanks for the notice.", "y_310Apr 11 at 11:37 PM\nAwesome! But one missing feature\n\nThis app is just awesome. Video quality is nice, UI is simple and easy to use. But I hope it supports chapters. Its very convenient when watching live video.\n\nHelpful | 0", "steve.streeter2May 4 at 3:25 PM\nNice, but\n\nLove the quality, but could really enjoy it more with multiplayer capabilities\n\nHelpful | 0\nDeveloper ResponseMay 12 at 5:55 AM\n\nThere is a tradeoff between good streaming quality and multiplayer mode. If you watch videos with several friends on your server then you cannot really watch a 4k VR video. Our primary goal is to guarantee the immersive viewing experience for single user now. Cheers.", "rculusoiftJun 26 at 7:08 PM\nDoesn't support most jpeg/pgn/mp4!!?\n\nHardly supports anything. There are free versions that are less hassle.\n\nHelpful | 0\nDeveloper ResponseJun 28 at 5:23 AM\n\nMp4 is definitely supported. We will support jpeg and png in the future. Currently SKYBOX remains a video player.", "Lens_CrafterFeb 10 at 11:18 PM\nOnly has ONE downside...\n\n...and thats, that every other streaming app you use after Skybox will be disappointing.\n\nSkyboxs developers really got their screen controls down RIGHT!\n\nThe ability to lock the screen to the headset orientation is GREAT! And, their screen controls for 180 and 360 video is amazing. You have TOTAL control over the zoom, tilt and pan of every video. The environments are awesome. The way the brightness and color of the images on the screen effect the virtual environments is spectacularly well done and incredibly immersive. I almost feel greedy, wishing there were more of them to look at and admire.\n\nIve figured out how to download content from my computer to the headset memory. Now Im hoping that I can play from an On the Go USB thumb drive. I havent tried yet, but Ive got my fingers crossed that it will be added as a feature, if it cant already.\n\nHelpful | 2", "WhiskyWarriorApr 8 at 12:58 PM\nNeed help!\n\nMy app is stuck uninstalling for days... i need to reinstall it but it wont let me!\n\nHelpful | 1\nDeveloper ResponseApr 17 at 4:24 AM\n\nPlease contact Oculus directly for further help. We as developer cannot help with issues related to install/uninstall apps from Oculus store. We suggest you to switch to reboot Quest to see if it helps.", "WalvisophetdrogeMar 19 at 11:26 AM\nBeautiful media player\n\nwanna watch your content on the moon, in space,... let's go than. put your content on your quest and take it on a plane or a car maybe even in the bathtub ? make the screen as big as your heart desires, this is to good to be free ;)\n\nHelpful | 0", "BeefyBeans4U13 days ago\nCasting\n\nDisappointed air server app on Xbox is much better\n\nHelpful | 0", "car2nrFeb 26 at 12:43 PM\nThe quality just PERFECT\n\nSeriously. If you want to watch your own media, this is the app to do it on. I tried the default player and Bigscreen but Skybox is the clearest out of all of them. It looks as if you were watching your video in real life and just as sharp. If you run a media server, this is the app to watch your media on. Its so simple to setup! The only reason Im giving it 4 stars is because I wish it had the ability to invite friends. Other than that, its the best at what its supposed to do!\n\nHelpful | 0\nDeveloper ResponseFeb 27 at 1:32 AM\n\nThanks for the feedback. Right now we focus more on offering the best experience of watching higher quality videos (potentially 8k in the future). Social features, such as inviting friends, are not our primary focus. We have only a few people working on this project and we are trying hard to bring more features alive in the future :) Please be patient with us. Cheers.", "jaystar.ramosFeb 13 at 3:23 PM\nAwesome app but missing one thing\n\nIm rating 4 stars until or if even possible to launch an app with in this other then just a video file would be absolutely amazing and by app I mean side loaded app such as remote play for ps4 streaming , reason why this would be such a great feature is to be able to take advantage of the environment features sky offers if we can open up an app with in sky then remote play can be played with a bigger screen like in a movie Theater etc would be awesome until then or even if this feature is possible even tho I know it is possible I will change my rating to 5 stars\n\nHelpful | 1\nDeveloper ResponseFeb 16 at 12:38 AM\n\nCurrently our focus is to improve SKYBOX as a video player and offer users the option to play even 8k videos on Quest. What you suggest, ps4 streaming, is not our priority now. We will talk about this feature in our product meeting and see if we can plan it in our roadmap. Thank you for your understanding.", "SpottedcowMar 16 at 5:55 PM\nRuined By Foveated Rendering\n\nThe ugly pixelation due to fixed foveated rendering (FFR) ruins this player. If I wanted to watch horridly pixelated videos, I'd use my Sega CD. Sadly, everything else about the player is top-notch. WiFi streaming from my PC works perfectly, and the player seems to be able to handle just about any format I can throw at it.\n\nBut the developers need to either disable FFR or give us the option to disable it. I can't believe that a mere video player needs to resort to using FFR. It just looks incredibly ugly and bad, making this player useless. It's a shame, since everything else about this player is just about a perfect 5 out of 5.\n\nHelpful | 0\nDeveloper ResponseApr 8 at 3:00 AM\n\nHi, SKYBOX Quest version supports adjusting FFR. In the main hall where you could see the mountains outside, look up and a hidden bar would appear with time, battery and a gear icon. Click the gear icon and you will open the Global Setting tab. There you will find the option to disable FFR. If you still see pixelation after you turn off the FFR, please contact us at support@skybox.xyz so we could provide further help. Cheers!", "Rade0nFighterFeb 7 at 5:14 PM\nFlawless streaming/local player\n\nCant fault it to be honest, plays 2d and 3D videos great.\n\nLibrary management is nice, no lag when streaming, and I havent touched any other players (including gallery/tv) since installing.\n\nThe server app (streamer) works well on Oc and Mac. Nice one!\n\nHelpful | 0", "GigithJan 29 at 11:46 AM\nBest VR Player EVER\n\nIt's crazy how much better this free video player is than every paid one I've ever purchased.\n\nI've tried countless video players, tried most ones on Steam and Oculus PC, and on Quest there's mostly just the Oculus Gallery, Pigasus, and this.\n\nSkybox is still number 1.\nYou used to have to choose between a powerful, functional player or a simple one with good enviroments; Skybox somehow has both.\n\nUpdates have been sparse lately, but they said they're planning to have an 8K 180 video update + hand tracking in, I believe, March 2020.\n\nOnly thing I wish it had was an Android server app like its PC server, as getting SMB working on Android is very tricky.\n\nHelpful | 1", "hootie976Nov 27 at 1:19 PM\nBest player Ive used\n\n11/10\n\nIn this day and age, its sad that Im so impressed that the app works as advertised, isnt laggy, and doesnt crash! Please dont bog it down in future updates with pointless enhancements that ruins it. Please!! Ill pay you real $$. Just ask for them.\n\nThis player is great! It easily let me stream from my SMB server on my pc, from which I have already been streaming to my boxee box connected to my TV for ten years. No additional configuration was needed. It will also find my 4TB WD NAS drive that is directly connected to my router, let me browse the file structure, and stream from that.\n\nMy favorite feature is the Lock Screen option that keeps the screen directly in front of my face at all times. If I move my head while sitting in a rocking chair, or turn from side to side in bed, the screen follows my face with a very comfortable floating animation. This also lets me make micro-moves (like a normal human being, not a statue) and the screen isnt jarringly fixed in front of me. Youll see. Its awesome on the Quest!\n\nI wish the menu would also lock with the screen, so if Im lying on my back watching Avengers and need to access the menu, I wouldnt have to sit up, but come on... Am I really complaining about having to tilt my head down 45 degrees for three seconds?!\n\nThis program is awesome. Just get it and watch your stories! It doesnt disappoint.\n\nOh, one other thing... is it possible to download my content into skybox so I can watch it when on the go? If so, I just must be missing it.\n\nUpdate 11/27/19: Connected the Oculus to my PC and copied videos to it locally. They play perfectly. Thanks.\n\n- Houston\n\nHelpful | 28\nDeveloper ResponseNov 28 at 12:45 AM\n\nYou are welcome. Thanks for your support!!", "SunRayNomadOct 28 at 10:46 AM\nStill unbeatable!\n\nWhenever a new video player is released my first thought it always but will it be better than SkyBox?\n\nThe answer is always no. This app will play practically any combination of formats. The cinema environment is beautiful with incredible attention to detail. Every app claims to be your own private cinema. This one actually is!\n\nHelpful | 62", "NappySlapsMar 11 at 11:47 PM\nEasily the best player on the Quest.....\n\nExactly as the title says, one request would be to utilize hand tracking controls in a future update. Keep up the great work\n\nHelpful | 0\nDeveloper ResponseMar 18 at 2:50 AM\n\nThanks for the review. As hand tracking is still an experimental feature on Quest, we find it still too unstable to implement and hard to use. We will definitely support it once it's a finished and officially released feature. Cheers.", "Crazy_SaneJan 6 at 7:12 AM\nWhy didn't I get this sooner?\n\nI loved the original gear VR native video player. I thought the Quest was lacking in that department.\n\nAnd then I tried Skybox. Wow! This is a beautifully polished video player that runs flawlessly. Why didn't I get it sooner? For some reason I hadn't looked at it closely enough. I didn't realise what this app offers.\n\nYou can play any sort of video, including 3D movies. You can stream media from a PC. There are several \"cinemas\" to choose from. And the level of detail in those cinemas is realistic and immersive.\n\nI love this app. Now I've discovered it, I'll be spending a lot more time watching videos with my Quest. The first movie I watched... Ready Player One in 3D. Man... give it a try, you'll thank me.\n\nI'm sure this review will get lost in the sea of opinions. But if you're reading this, download this app now. It's a must have.\n\nHelpful | 7", "devzen23Jan 17 at 2:59 PM\nBrilliant design philosophy\n\nClean and elegant media player, I've streamed VR and regular videos from my PC to the Quest and the playback quality is very good. There are useful features to configure and detect different types of VR video. Love all the viewing environments also! they really add a dimension of realism. Very useful features to lock, move and zoom the display. All the necessary features are there and none you don't need. I love this app so much I'd like to support the developer but there's no donation link on their website.\n\nHelpful | 1", "Duncster-swcJan 17 at 5:59 PM\nMy theatre of choice\n\nThis is where I watch my 3D movie collection.... sooo good, wonderfully detailed theatre, easy to use menu & controls.... nothing bad to say..... thanks for such a great player....\n\nMy only disappointment was that no matter how big I set my guardian I couldnt walk around the house at the main menu. Lol. :)\n\nHelpful | 0", "nr6542Apr 25 at 8:29 AM\nStunning visuals\n\nI guess since there's not much else going on, they can afford to have awesome lighting on the chairs in the movie theater or... on the moon. Personally, I still like the movie theater the most - finally not having to have obnoxious people around you or overly bright emergency signs, etc.\nThe only thing I find missing is to be able to elevate the seating area, so you don't have to look up as much when choosing to sit in the front. I guess it's realistic for most rates but if we're in VR, we might as well experience something more ideal.\n\nHelpful | 0", "Lukasz_TFeb 6 at 5:22 PM\nI love this video player\n\nIt's a good player, the problem I have found is that it zooms in too much, you have to zoom it out manually in settings, I make Space Engine Videos 3D and 360% for Vr and I am able to see my work\n\nHelpful | 0", "GermanTMar 5 at 10:31 PM\nBest Player\n\n..I would pay for it to support the Developers :-)\n\nHelpful | 0", "dave.parry.1953Feb 25 at 8:42 AM\n\nAn excellent video player with a ton of options. Very pleased with it.\n\nHelpful | 0", "UndertokerJan 5 at 5:53 PM\nAstonishing\n\nSkybox VR is easily the very best movie player I have ever experienced and probably one of the best reasons to buy an oculus quest in my honest opinion.\nHow anyone can make such a fantastic app/program and then give it freely for people to enjoy is certainly as amazing as the app is itself.\nSo far it has played back every movie format I have thrown at it and the quality of that playback is superb.\nYou can toggle through a number of different environments to sit in and watch a film, you can then adjust loads of variables in that environment till it is just right for you - easily and quickly.\nYou can watch it in any screen size format even curved, theres an awesome screen lock feature and the varied environments even include sitting on the moon!\nYou can even choose where in your virtual cinema you want to sit (front middle or back) and then even invite your mates to watch your film on their headset remotely !!!\nI would have happily paid 30 for this in honesty and still felt Id got a bargain.\nGet it guys, every quest owner really should - its totally free and you to will be amazed.\nI dont think Ill ever go to the cinema again now as the detail in this player of the virtual cinema surroundings is actually better than the real thing - thank you so much guys.\nI also can never imagine wanting to even look for another movie player - it really is that complete for me.\nIm amazed - bravo guys.\n\nI would like to see a few more environments simply to marvel at them \n\nHelpful | 2", "sindredNov 22 at 9:07 AM\nAbsolutely the best out there\n\nI have really been getting into 3D VR videography and this app is everything you need to play VR footage correctly with so many settings. It even autoplays when you put the headset on, which is perfect when you want someone who is not VR savvy to watch a video. It's absolutely brilliant.\n\nThe developers are also very responsive and helpful. Keep it up guys. Skybox is what I recommend to any new headset owner.\n\nHelpful | 7", "lraidenFeb 12 at 10:21 PM\nVery buggy\n\nGreat interface. Extremely buggy. Dont know how people who are writing great reviews are using it. Maybe they are using locally downloaded files. I use it to play files in a network due to the limited space. I have go and quest. Crashes every time. The only place its stable is on Steamvr... makes me think how skybox handles wifi is the problem. This and pigasus are the only software that plays network files. Sucks.\n\nHelpful | 1\nDeveloper ResponseFeb 16 at 12:35 AM\n\nSorry for your inconvenience. We appreciate if you could reach us at support@skybox.xyz and tell us what network option you are using (via SMB or DLNA) and what bandwidth of your network so we could provide further help in your case. Looking forward to your email.", "hashamsandhuJan 20 at 7:09 AM\n\nDear Oculus plz add more features in skybox adds more rooms sometimes download YouTube vr videos works sometimes not plz added more features update thanks love and support from Pakistan \n\nHelpful | 0", "JovianAUMay 17 at 5:16 AM\nNetwork share support (chef's kiss)\n\nPerfect. Precisely what I was after.\n\nIf I was being needy, Image support with slideshows would be cool.\n\nHelpful | 0", "AlexNashZemlyakVRFeb 22 at 11:27 PM\nNeat, plays everything and free!\n\nBest player for Quest so far\n\nHelpful | 0", "ManDudeDogFeb 6 at 10:26 AM\nMultiplayer and More Environments Needed\n\nI love this for its ease of use and being able to stream with my Mac. Id use this so much more if there were a multiplayer feature, otherwise I wont use this much or at all. I want to invite my friends to watch movies, and am not able to do this. Id also love some other environments similar to Bigscreen too.\n\nPros: Works great! Looks good!\nCons: No multiplayer. Limited Environments.\n\nThis would be a Bigsrceen competitor if you added invitation features. Please updates soon! Also maybe some objects to interact with as well while watching.\n\nHelpful | 0\nDeveloper ResponseFeb 7 at 1:41 PM\n\nThanks for the review. Multiplayer: due to the hardware limitations we do not want to rush into multiplayer solution. One will experience a lot stuttering when trying to stream a 5k video with remote friends/families. We focus more on watching as high resolution as possible on Quest, for example 8k. Environment: right now we don't have 3D artists working with SKYBOX project. As you know currently we don't make money from SKYBOX (it's a FREE project) so we want to keep our focus on optimising the performance of SKYBOX. If we make money one day we will consider adding more environments :) Thank you for your understanding.", "ShapewareDec 30 at 4:02 AM\nBest video player by far\n\nGreat video player, I can just load from an SMB share from my desktop or copy the files to the oculus storage. It has all the options youll ask for in a video player. Im still surprised how good it is, and Ive played a lot of content so far.\n\nHelpful | 1", "alanjawebApr 22 at 1:11 PM\nNetwork File Error\n\nOculus Quest Network File Error Example: https://youtu.be/kEeauwhBqpc\nhttps://forum.skybox.xyz/d/670-skybox-oculus-quest-network-file-error\n\nHelpful | 0\nDeveloper ResponseApr 23 at 12:31 AM\n\nHi there, sorry for your inconvenience. Please contact us at support@skybox.xyz so we could provide further help. We have never encountered such issue. Looking forward to your email.", "Joered05Dec 22 at 12:21 PM\nAmazing!\n\nI really like this app! It offers many options for viewing video and where the video comes from. Like either from the quest or maybe a USB, or even a home media server! Amazing!\n\nHelpful | 3", "brandon.abbott.1694Dec 12 at 12:24 PM\n\nAble to play what Oculus gallery can't. Gives you a virtual cinema experience like the other streaming apps (Prime, Hulu, Bigscreen) and works on your local and network media. Allows you to download too\n\nHelpful | 3", "binkleymanDec 25 at 5:22 PM\n\nIts great but would be awesome if you could invite friends for that reason i give 4 stars please add the ability to invite friends to watch with you vs invite a to install the app\n\nHelpful | 4\nDeveloper ResponseJan 1 at 1:36 AM\n\nWe plan to support this feature in future releases. Please be patient with us :)", "dariuszdziewa1984Jan 15 at 6:18 AM\nAmazing app!\n\nWow! The quality of this app is incredible!\n\nHelpful | 1", "feelpillDec 31 at 7:48 PM\nThe best so far\n\nThe only app that allows you to zoom in and reoriente 180 or 360 vids that I know of so far.\n\nHelpful | 3", "ChiliMangoOct 22 at 3:22 PM\nPhenomenal Video Player\n\nI just have to say the creators of this app should be proud of themselves. It is a well developed, great looking system with a lot of settings for the user to customize. I'm now in the market for the giant pillow you find yourself on when entering the main room after opening the application! It would complete the experience for sure. My only real feedback is that it would be awesome to see audio files be playable in the app as well with possibly an accompanying environment? I know you guys would do a killer job if you added something like that. I'd sit on that big pillow and listen to my music library all day if that became available! Cheers!\n\nHelpful | 16\nDeveloper ResponseOct 23 at 12:59 AM\n\nThanks for the review. Regarding the feature request (see audio files be playable in the app as well with possibly an accompanying environment) we will talk about it in our product meeting and see what we can do :) Cheers!", "Scott.Yang.0402Dec 24 at 4:04 AM\nBest VR player\n\nBest VR I used\nNot perfect but still best\nSome vedio not able play via SMB share but playable in local , if possible please fix it ,\n\nHelpful | 0\nDeveloper ResponseDec 25 at 4:35 AM\n\nRegarding the video that cannot be played via SMB share, would you please share with us one at support@skybox.xyz so we could test it? Thank you for your support and looking forward to your email.", "sak3rDec 11 at 4:06 AM\nIt's good at what it does\n\nThe VLC of vr. It does it all, subtitles different viewing modes from cinema to 3d to 180/360 plus it can access SMB shares so It's effectively an alternative to Plex/kodi\n\nHelpful | 1", "FireRMNov 9 at 3:46 AM\nThe Only And the best\n\nThis is the only VR Quest (and not only) player that supports local network streaming, you can watch 3D Movies , VR Videos easy and fast.\nTo the developers :\nMany Insta360 EVO users has problem to play/watch - .ins files - from Insta360 EVO camera as no official app exist for the Quest will be fantastic if you support these files.\n\nKeep your fantastic work !\n\nHelpful | 3", "tjgr17Nov 9 at 5:28 PM\nBest VR video player hands down!\n\nI love skybox. I use it more than any other app on my headset. The environments are very emersive and videos play flawlessly. I went into owning my Oculus Quest thinking Big Screen would be my theater app and I was wrong. The only change I would make to this already incredible app would be more environments. I would love maybe a drive in theater environment in a car or a living room with a giant screen. Thanks for the amazing work and making watching my personal movie collection so enjoyable to watch in VR!\n\nHelpful | 2", "PiperyeNov 6 at 8:02 PM\nKeeps crashing\n\nLove this app, but every 2 to 10 minutes, the video just exits saying it encountered an error, or something like that, if it makes any difference, all the video's I've tried are on my plex server, the same video's play fine in the Oculus Gallery.\n\nUPDATE:\nThe problem seems to have fixed it's self, don't know if it was the latest update, or something at my end, but it's great now :o)\n\nHelpful | 3\nDeveloper ResponseNov 7 at 10:29 PM\n\nThank you for the update! Really appreciate it. If you encounter any issues please feel free to drop an email at support@skybox.xyz. Cheers.", "CystasyOct 12 at 6:14 PM\n3DoF Mode missing\n\nit's a good player but it don't have 3DoF support yet like other video players on the store. if I'm in bed without light i want to be able to use this app to watch movies, but it isn't supported yet. please developer..update it and add support for the new \"tracking disabled mode\" oculus added a while ago for apps.\n\nHelpful | 8\nDeveloper ResponseOct 27 at 10:35 PM\n\n3DOF mode is supported now :) Enjoy!", "star5kyJan 5 at 2:46 AM\n\nIt works as advetised.\n\nHelpful | 0", "supersubraNov 22 at 11:15 AM\n\nExcellent Video player. Environment scenes can be increased. Option to play m3u files or m3u8 stream required. Zoom in zoom out can be additionally put on menu also. Joystick zooming is difficult for some people\n\nHelpful | 1", "fangyitaoDec 3 at 9:57 PM\nsubtitle file problem\n\nSometimes the subtitle file is not recognized, even if the video and the subtitle file are in the same path and have the same name, they are still not detected.\n!! !! !! Seeking to optimize this problem! !! !!\n\nHelpful | 0\nDeveloper ResponseDec 5 at 12:49 AM\n\nThanks for the feedback. Please send the subtitle file to support@skybox.xyz so we could test it and help you more on this issue. Cheers!", "mostlyatnightNov 11 at 10:04 AM\nNice one\n\nAll great, but it would be awesome if I could change screen size and distance separately. Now only size is changeable but distance stays the same, if I understand correctly.\nI use void and moon mostly, because i can't change seat in cinema so just feel cornered.\nI guess in Virtual Desktop used to be an option to change screen size and distance separately.\n\nHelpful | 0\nDeveloper ResponseNov 10 at 7:13 PM\n\nHi there, which theatre do you use (cinema/void/moon/space station) please? And we appreciate if you could give us an example of app which supports both change screen size and distance so we could compare. Thank you.", "Wilson2bNov 7 at 9:55 AM\nAlmost awsome.. Please add import Codec\n\nNeed to play Blue-Ray disks directly off disk on Android ? Using Oculus Quest. I currently am successfully LAN Network sharing DVD drive and see DVD/folder using SkyBox app on Quest. But disk media file insn't recognized to play, must need a aacs codec. I believe MX Player w/ Codec plugins on Android works. So much easier to just rent the movie and play it on a Network Shared system \"\n\nHelpful | 0", "VRcuklikMar 12 at 4:04 AM\nPERFECT\n\nPerfect video player! Beautiful backgrounds .. Plays my video files ..\n\nHelpful | 0", "8egoMay 10 at 5:12 AM\nNo support for 5-8k videos\n\nAfter waiting a year, moving on\n\nHelpful | 1\nDeveloper ResponseMay 12 at 5:51 AM\n\nWe appreciate your patience. 5760x2880 30fps h265 videos are supported now. Regarding 8k support, we indeed have postponed the release for several times and are still working on it. This is the kind of feature which requires many hours of research and trial and error. With the hardware limitation, I suspect if any other player would ever support 8k playback at all. For a small studio with limited fund like us, the development period could be long. Still, we dedicate to it and hope to give our users the most immersive viewing experience in VR world. Thanks for your understanding.", "eppo67Oct 22 at 8:37 PM\n10 out of 10\n\nHands down the best VR Media Player just get it don't bother with anything else it's absolutely sensational.\nThese people know what they are doing. The fact is is free really is incredible when you see what some developers charge $$ for.\nAmazing.\n\nHelpful | 1", "ERINRUSHNov 23 at 11:53 AM\nAmazing\n\nThis is the best video player on vr ever! You should really be proud of yourself!\n\nHelpful | 0", "BeiriannyddMay 25, 2019 at 9:42 AM\nAll the features you want\n\nI downloaded a few movies to my Quest which I had ripped from my collection. I wanted to watch lying down and it had me covered. It automatically detected my OU/TAB 3D movies. The cinema environment is really beautiful. It is replaced by a completely black border if you choose to have the movie follow your gaze. Everything worked as expected.\n\nHelpful | 68", "Tott_DonettaOct 8 at 6:32 AM\nIt Works!\n\nit works and its easy! the app is installed on my laptop and skybox plays everything on there without issue, it also connects to my NAS drive without any additional configuration and it plays all of my media on a lovely big cinema screen in my own front room.\nif i had a wish list it would be to allow me to add folders to my favourites, but i think thats about it!\n\nHelpful | 0", "guchiNov 7 at 7:06 PM\nGreat VR video player\n\nIt's great to watch videos on a local network without stress.\nOculus quest's sounds are delayed when using bluetooth earphones. I think it will be better if the timing of the sound can be adjusted.\n\nHelpful | 0", "arbitor54Nov 10 at 3:20 PM\nAwesome\n\nI tried all media players and found this one to be the most complete and easiest to use. Streams easily from PC.\n\nHelpful | 0", "Jenko4starNov 25 at 4:38 AM\nBest vr player\n\nBest vr player for the Quest so far!\n\nHelpful | 0", "strellyOct 27 at 11:47 PM\nPerfect!\n\nThe app is fantastic, all the options you need, a easy UI and stunning settings for watching your favourite media. Developers very supportive and friendly. Thank you\n\nHelpful | 0", "nastypigJan 13 at 6:19 PM\nFrustrating\n\nFinally got it to load and not freeze, but it cant find my iPad or computer. So pretty useless .\n\nHelpful | 0\nDeveloper ResponseJan 13 at 7:41 PM\n\nHow do you mean \"it can't find iPad or computer\" please? Have you set up DLNA share on your iPad please? If so, which DLNA server do you use? On computer, you could set up either DLNA/SMB/AirScreen(https://skybox.xyz/en/support/how-to-use-airscreen/) and use SKYBOX to access them no problem. If you have any question, please reach us at support@skybox.xyz so we could provide further help. Cheers!", "YeahWowCoolNov 9 at 5:10 AM\nSkybox rocks\n\nMost useful VR app to date. Cant imagine any better media player - its the VLC of VR.\n\nHelpful | 1", "andythwSep 26, 2019 at 3:16 AM\nVery useful\n\nI have a 3D movie on my Quest. Skybox finds it with no issues and plays it as it should be as it has left and right side by side. You can select the audio stream and subtitles if the movie file contains them. There are several different environments you can select from as well as having a flat or curved screen. I really enjoy the fact you can see the time and battery capacity within the app. I have just tried to link to an SMB share on my Windows 10 PC. To my surprise it worked with the correct sign-on and played files over my local WiFi. Best of all it is free.\n\nHelpful | 0", "oldskool6805Jan 2 at 6:21 PM\nCan't get it to download\n\nWon't download. Says headset not connected, but it is.\n\nHelpful | 0\nDeveloper ResponseJan 8 at 10:39 PM\n\nPlease try reboot your device or switch to another Wi-Fi to download SKYBOX. If neither of above helps, please contact Oculus directly for further help. It's been a common issue for nearly all apps from time to time. Thank you for your patience.", "georgie-hSep 23, 2019 at 4:10 AM\nJust what I needed!\n\nI was somewhat disappointed that my Quest would not play my purchased videos directly from my NAS drive. Then I found Skybox. It plays all my videos and has many viewing options and was exactly what I wanted. Hopefully future updates will give me options to view photographs and listen to my music collection as well.\n\nThank you developers!\n\nHelpful | 0", "Hawat1Aug 11, 2019 at 6:53 AM\nJust Wow\n\nWow ! This actually works. And it works well. The ability to stream 3D / VR videos from an SMB share is fantastic. And it plays everything you throw at it, even 4k / 60 Hz. etc. The UI is slick and intuitive and the VR lounge room gives it a nice touch. Very well done. This is how a VR video player should be and frankly I don't think I need any other app for this.\n\nHelpful | 20", "reptile8488Oct 27 at 8:01 PM\nThe best video player\n\nIt's fantastic. For some reason it can no longer access the shared files on my network. It used to be so cool\n\nHelpful | 0\nDeveloper ResponseOct 27 at 10:34 PM\n\nAre you using DLNA/SMB/AirScreen? Please reach us at support@skybox.xyz so we could provide further help. Thank you!", "jeff.krantz.54Sep 7, 2019 at 1:03 AM\nUnbelievably amazing\n\nI have had my Oculus for only a few days now and this app is one of the most amazing programs I have tried for it. This program really makes you feel like you're transported into a movie theater or in outer space if you want. I love the real movie theater like quality. It is truly amazing.\n\nHelpful | 1", "tony777Sep 27, 2019 at 1:00 PM\nSkybox\n\nI love sky box ,this is the best ...I have a projector and dont use it anymore for watching 3D it skybox looks great I hope they have a few more update s ...\n\nHelpful | 1", "ArmisisMar 8 at 2:43 PM\nSky owns nowtv..\n\nSooo why isn't my nowtv account accessable? Please fix this.\n\nHelpful | 0\nDeveloper ResponseMar 11 at 10:17 PM\n\nThis is SKYBOX STUDIO, an indie studio specialized in VR and Game. We are not related to NowTV. Please contact Sky Group for further infos.", "Zero_comedySep 24, 2019 at 3:16 PM\nThe greatest app on the quest\n\nThis is an easy to use app that lets you watch movies and tv shows. I just wish you could invite friends to watch the movie with you\n\nHelpful | 0", "johnsoncpSep 19, 2019 at 9:19 AM\nBest movie player Ive found\n\nThis one plays everything I try to watch. Its the only one Ive found that plays sound and video and copes with everything I throw at it.\n\nHelpful | 0", "GoogolkhanAug 13, 2019 at 10:08 PM\nThe perfect video player!\n\nThis player does everything right. It has all the features you ever wanted to watch your movie files. An easy2use file browser. Different environments including a nice and big movie theater. Our just the void environment with a scalable screen you can position freely - perfect to watch your movie while you lie down comfy! 3D movies of any kind... different codecs... This player supports them all!!!\n\nDo yourself a favour - get this wonderful player and be happy :)\n\nHelpful | 2", "CatchanchanOct 5 at 1:52 PM\n\nThe interface is good and easy to use, but it doesnt work while I laying down on bed.\n\nHelpful | 1\nDeveloper ResponseOct 9 at 7:07 PM\n\nIf you are watching 180 or any flat videos, then you could reset the screen to wherever you look at by holding Button B. For 360 videos, you could tilt the angle in the Advanced Setting. Hope this helps. Cheers.", "Tuan_MudaOct 9 at 4:44 PM\nAnything you need\n\nBest Video app on Quest\n\nHelpful | 0", "conanthegreatOct 19 at 10:22 PM\nCan't access any files\n\nI do not own a PC I just have a Chromebook can't access any files I download the app on my pixel 3 it goes straight to daydream VR this app is just junk if you cannot access any files other than by owning a PC\n\nHelpful | 3\nDeveloper ResponseOct 20 at 8:02 PM\n\nHi, if you would like to stream videos from your Chromebook to SKYBOX on Oculus Quest, then you could set up a DLNA server (ex. Plex) and SKYBOX would access it with no problem. On the other hand, SKYBOX available on Play store on Pixel 3 is a Daydream-ONLY version. It has exactly the same features as the one available on Oculus store for Go/Gear/Quest. If you want to stream videos from your Pixel 3 to Quest, then please install a 3rd-party DLNA server on your Pixel 3. Hope this info helps. If you have any questions, please reach us at support@skybox.xyz so we could provide further help. Cheers!", "lexzzarre348Aug 21, 2019 at 5:12 PM\nIt has all\n\nIt supports a lot of format, the room are mixed and immersive. Very simple to use.\nI hope they might had additional room to it but it a free apps so even if they don't do any updates, it already has everything needed.\n\nHelpful | 2", "Aaronb3434Sep 24, 2019 at 11:09 AM\nGreat\n\nLove skybox can u guys add drive in, bedroom, imax cinemas?\n\nHelpful | 0", "Scruff_CPacJun 13, 2019 at 4:17 PM\nAWESOME Application\n\nSkybox VR is the real deal! The theatre environment is extremely immersive and comfortable setting to watch a movie in. I love that Skybox VR allows me to play movies directly from my internal storage rather than streaming as the only option. My only gripe (which is more of a wishlist thing) is that itd be great if you could watch movies with other headsets from your friends list, since as of now its a very solitary experience. Maybe thats a feature planned for a future update though. Still, use Skybox VR, youll thoroughly enjoy it. Two thumbs up!\n\nHelpful | 26", "NinjaXMAug 7, 2019 at 2:55 AM\nBest way to watch anything on the quest\n\nThe four stars are for the lack of one very basic yet important environment. A living room, that is.\nI believe the home menu area works perfectly well, theres no need to design a new environment. Just make sure to add a night sky mode.\nEdit: Thank you for your reply. As soon as it gets updated you will have my five stars. Really appreciate your response.\n\nHelpful | 4\nDeveloper ResponseAug 7, 2019 at 2:43 AM\n\nWe will add the home menu area as an environment possibly in next two updates. Will definitely consider a night mode. Cheers.", "JBRO1Sep 18, 2019 at 10:36 AM\nAWWSOMEMUST HAVE FREE APP!!\n\nSKYBOX HAS THE BEST AND MOST REALISTIC THEATRE TO WATCH MOVIES OR VIDEO IN, ALSO 3D , 360, 3D-360, 180 DEGREE VIDEO OR YOU COULD WATCH FROM A SPACE STATION OR IN A MOON ENVIRONMENT ETC... IT HAS SO MANY GREAT SETTINGS. YOU CAN WATCH FROM THE BACK OR MIDDLE OR FRONT OF THE THEATER , YOU CAN ADJUST THE BRIGHTNESS OF THE THEATRE OR THE BRIGHTNESS, CONTRAST OR COLOR SATURATION OF THE SCREEN, IT REALLY LOOKS AND FEELS LIKE YOU ARE IN A REAL THEATRE AND NOT A CARTOON ONE. I HAD THIS ON THE GEAR VR AND IN THIS VERSON ON THE QUEST YOU CAN EVEN WALK AROUND IN IT. ANY VIDEO I HAVE MADE MYSELF OR DOWNLOADED TO MY PHONE I EASILY WATCH BECAUSE ITS BACKED-UP IN MY GOOGLE PHOTOS APP AND SIMPLY USING THE OCULUS BROWSER ON THE QUEST I CAN QUICKLY OPEN MY GOOGLE PHOTOS APP OR OTHERS TO DOWNLOAD MY CONTENT DIRECTLY TO MY QUEST AND START WATCHING! YOU DONT EVEN NEED A COMPUTER THANKS TO THE DEVELOPERS FOR AN OUTSTANDING JOB!\n\nHelpful | 0\nDeveloper ResponseSep 18, 2019 at 11:18 PM\n\nThanks for the feedback :) We really appreciate it!", "BlackThanosl18Oct 2 at 11:44 PM\nCant find videos\n\nAny video I've downloaded to Quest cannot are not visable in Skybox. Worked great before update. My videos can only be accessed via Oculus Gallery. Please fix. This is my favorite app.\n\nHelpful | 0\nDeveloper ResponseOct 15 at 11:18 PM\n\nHi there, in which folder do you store your videos? Please reach us at support@skybox.xyz with more details so we could provide further support. Cheers.", "Derek6SJul 30, 2019 at 9:38 AM\nThe feature is good, however.......\n\nwhen I watch VR movie and shake the head, the picture will move away a little bit . Moreover, it cannot play video more than 10 GB through air screen\nReply: I use the 180 degree mode and 3D side by side, I nod the head, the picture go down a little bit, when I raise one's head, the picture go up.\n\nHelpful | 2\nDeveloper ResponseJul 30, 2019 at 3:53 AM\n\nThanks for the feedback. 1. Picture moves away a little bit: does it happen to every VR video you tried? When you shake head, does the Quest become loose attached to your head? 2. AirScreen does not have limitation on video size. It all depend on the bandwidth you use. We highly suggest to use 5G wifi signal. Hope this info helps. Cheers.", "jianhuizSep 5, 2019 at 12:02 PM\n\nOnly hope that eye following can be enabled globally\n\nHelpful | 0\nDeveloper ResponseSep 8, 2019 at 7:58 AM\n\nAre you referring to the \"Lock Screen\" in the \"Advanced Setting\" please? What do you mean by \"globally\"? Please share with us more details at support@skybox.xyz so we could improve :) Cheers.", "freemind.suJul 16, 2019 at 8:26 AM\nBest stereo experience ever\n\nWith SKYBOX you dont have to wear stereo glasses which darkens the screen but you get a perfectly clear vision. And the watching experience is 100% close to in theater(except you couldnt see your legs).\nTo me its the only acceptable way to watch stereo movie from now on.\n\nHelpful | 2", "ralphael_ninjaJun 24, 2019 at 12:22 PM\nThe killer app for quest!\n\nI guess to each their own but this app is the main reason that I bought an oculus quest and that is to watch movies lying down. The icing is that this app plays 3D movies and even recognizes 180, 360 movie formats too! You can stream your movies from a nas or copy the movies into your oculus to watch. Now if you are ever bored when shopping with your better half, instead of watching movies on your phone, whip out your quest for a more immersive theatre experience.\nIt is the tv box for your quest.\n\nHelpful | 6", "m4koJun 3, 2019 at 1:53 PM\nThe best video player on quest\n\nAll videos work flawlessly (2D / 3D)\nSupport for streaming videos directly from PC (WOW!!!)\nSupport for hidden files ;-)\n\nIt can't handle 5K video because the hardware doesn't support it. Other than that it's perfect and I would pay 20$ for it because it's awesome!\n\nHelpful | 6", "etagimbel_gerJul 4, 2019 at 1:36 AM\ngreat start\n\nGreat start but still some work to do. Settings (for example curved screen) are not saved, sometimes 2D movies are detected as 3D and vice versa. Clicks with the controlIer are registered very sluggishly. I very much like how conveniently the screen can me moved around and resized. I wished, it could be used to view pictures, too.\n\nHelpful | 3\nDeveloper ResponseJul 5, 2019 at 1:32 AM\n\nThanks for the feedback. Please use Button A instead of trigger button. Support for Picture format is in our roadmap and we will develop it later this year. Cheers.", "adyan2015Nov 30 at 3:27 PM\nAdyan\n\nYes its nice\n\nHelpful | 0", "Awestin74May 30, 2019 at 7:10 PM\nFree doesnt mean basic\n\nI assumed seeing that this was free that Id be getting a barebones or unintuitive experience. That is definitely not the case. The environments are beautiful and are honestly graphically impressive. The lighting is gorgeous and it seems to have all the settings you could need for 3D, 360, aspect ratio, etc. very clean design and easy to navigate and use!\n\nHelpful | 3", "JohSm67Jul 5, 2019 at 12:25 AM\nPerfect\n\nOk playing from my NAS without problems!\nHandles 3D 1080p material without issues, alot of settings kan be made! User friendly!\nWish it could handle movies on a USB stick with a OTG adapter but that may be Oculus needing to fix support for it!\n\nHelpful | 1", "MikkoISJun 28, 2019 at 7:19 AM\nIt's the best player on Quest!\n\nSlower videoplayer than oculus gallery but this has more options. You can flip, tilt, zoom and do much more to your video content so it looks just right. It makes this videoplayer superior if you want to watch adult VR videos 24/7 just like me.\n\nHelpful | 2", "GotSebAug 14, 2019 at 12:27 PM\nPerfect\n\nEverything you need.\n\nHelpful | 0", "thealgorithmMay 23, 2019 at 10:02 AM\nEager for a 60hz mode on quest\n\nGreat application. Would there be a problem to switch to 60hz mode on the oculus quest when playing back 60fps videos. Even though head tracking is smooth, the frame changes have some jitter due to 72hz screen and 60fps update. On all other devices such as the mirage solo and vive focus, there is the same issue. Oculus Go I believe has a 60hz switch when playing back 60fps content in the gallery.\n\nHelpful | 5\nDeveloper ResponseJun 11, 2019 at 11:35 PM\n\nHi there, just want to update on the 60Hz mode on Quest. Currently Oculus Quest does not allow us to change the refresh rate, unlike Go. We have reported this bug to Oculus and are waiting for them to respond. Cheers.", "Lord_NectonJul 18, 2019 at 4:55 AM\nGreat app\n\nLove this app on the Quest hope we see more movie theatres like a iMax screen added and the choice to sit in any seat you want \n\nHelpful | 1", "Spamcan01Jul 3, 2019 at 10:36 PM\nBest option for watching videos in VR\n\nI use this app almost every day on the oculus go, the quest version is equally fantastic for watching 2D and 3D movies. Its had zero problems playing every piece of content Ive tried regardless of its locally stored or streaming from plex.\n\nHelpful | 1", "KraalisMay 28, 2019 at 11:12 PM\nAwesome app\n\nThis is a awesome app to watch streaming content from my local network enabled drive. I would love to be able to see a screen sharing in the app so I can watch Hulu and amazon prime using the iOS skybox app on my iPad. Would it be possible to enable a screen mirroring option across platforms that support the skybox apps. It is more portable and easier to use a tablet or phone than using a computer like the Remote Desktop in Bigscreen beta. Especially with the quest.\n\nHelpful | 7", "jphughanMay 27, 2019 at 10:03 PM\nExcellent VR movie theater experience!\n\nThis is exactly what I was hoping for, and maybe its just an illusion created by the surrounding environment, but this app creates a much more convincing experience of big screen viewing than even the official Netflix app  too bad I cant use it for Netflix! The default movie theater setting is beautifully done, and the ability to switch between front, middle, and rear seating in the theater is a very nice touch, and I was surprised at just how true-to-life those changes felt. The customizable ambient light level is also nice. I can use this app to stream from my Windows 10 PC using the media streaming functionality built into Windows. I just had to enable it and then list my existing video folders in the Libraries folder called Videos. Well done!\n\nHelpful | 6", "JTubbrittMay 25, 2019 at 10:22 AM\nAlmost perfect.\n\nHave this on my GO, Quest and Rift. It's a great app for watching movies over our closed network. Lacks support for some common audio codecs though such as DTS. If that could be fixed it would be perfect. Would also like to see photo support added, but that's probably outside the scope of this projects intentions.\n\nHelpful | 3\nDeveloper ResponseMay 26, 2019 at 11:40 PM\n\nHi there, thanks for the feedback. SKYBOX does support DTS. Would you please share with us one video clip which lack of audio support at support@skybox.xyz so we could test it? Thank you for your support and looking forward to your email. Cheers.", "BitskreamJun 9, 2019 at 9:13 PM\nExcellent\n\nThis media player is just great. The network ability allows access to my NAS, PC and Dropbox as well as local media. This will be great for movies on long flights! :) It has crashed a couple of times, but is mostly solid and easy to use.\n\nHelpful | 5\nDeveloper ResponseJun 11, 2019 at 2:26 AM\n\nHi there, thanks for the feedback. How often do you encounter the crash and under what circumstances do you encounter it please? We would like to help to fix it. Please share us more infos at support@skybox.xyz so we could provide further help. Thanks and looking forward to your email. Cheers.", "nnsenseMay 27, 2019 at 4:11 AM\nBest VR player\n\nIve tried many other player for rift, quest and go. This is by far the best player and I was so happy to see it released for the quest. There are plenty of options to set your experience as you like, many environments and even a secret folder feature. It can stream local content or remote. Im usually not a fan of free apps because you pay by advertising but this one is free with no adv whatsoever!\n\nHelpful | 2", "Graham808Jun 4, 2019 at 7:54 AM\nPerfect\n\nThe best media player on quest. Everything works absolutely superbly. The ability to play local files on the move in a cinema is fantastic. A MUST for all movie lovers. Can praise this software enough brilliant ... thanks to the devs\n\nHelpful | 2", "Azz81Jul 25, 2019 at 1:26 PM\nBest in store\n\nThis is my go too app when watching movies on quest.\n\nHelpful | 1", "steven.richardson3May 27, 2019 at 2:08 PM\nBest video player\n\nEven though I have a 4K TV in my living room watching a 3D movie in my own personal cinema is mind blowing. You completely forget your sitting at home as it transports you to your own personal space. Video playback is awesome, 3D movies are spectacular and the surrounding cinema experience is there is with light bleeds on the wall and ceiling.\n\nThe only issue I have found is subtitles will start automatically and never seem to be in sync. Playing with the resets can be a bit distracting but I dont use them anyway. Be good if there was a setting to never start with subtitles.\n\nHelpful | 3", "IstopMay 25, 2019 at 4:34 AM\nBest local movie app\n\nI normally dont write reviews, but apps like this deserves more attentions. Its very easy to use and movie quality is pretty good, 3D movies are way more immersive. I like the function you can zoom in and out and tilt the screen up and down. There are more settings to tweak, overall extremely satisfied. Thank you\n\nHelpful | 1", "vanfanelJun 1, 2019 at 6:15 AM\nbest app for movie watching\n\nThis has the best looking theater environment out there on the quest. It also is the only theater app with spatialized audio. Must have for movie watchers!\n\nHelpful | 3", "stevenhslvJul 25, 2019 at 6:58 AM\nMore locations\n\nFantastic. Need to add even more places to watch movies.\n\nHelpful | 0", "roculus99Jun 8, 2019 at 4:50 PM\nExcellent media player\n\nI've been using this, along with the PC app to stream movies to Quest. Very easy to setup, great interface, and great watching environments.\n\nHelpful | 2", "BulletMagnetEdMay 26, 2019 at 7:15 AM\nVery good media player\n\nI really enjoy watching streaming movies off of my NAS with this player. One issue for me though is it occasionally crashes out of the movie requiring you to restart it, and it doesnt restart from where it stopped but at the beginning. Other than that, I like it.\n\nHelpful | 7\nDeveloper ResponseMay 26, 2019 at 8:04 PM\n\nHi there, we want to fix this issue and optimize SKYBOX. Please contact us via support@skybox.xyz and send the log file located in Android/Data/xyz.skybox.player/Files/PersistentData/OutLogs.txt so we could check it. Thanks for your support and looking forward to your email.", "Lust4BlodMay 27, 2019 at 5:42 AM\n\nA real good video player. The player don 't keep track of hoe dit in the video jou are. Geen jou close app and go back in the video plays drom the beginning. I have a probleem with srt subtitles doch I can not select in the subtitel icon menu on the left. I need to look into this further although I do this how it supposed to be.\n\nHelpful | 0", "z_c00lJun 9, 2019 at 8:21 PM\nGood simple straight forward\n\nGood and easy app to use.\nBut if you could add in field to allow users to type in the folder file path it would be great. Instead of just navigating. This works especially when streaming with NAS in SMB mode.\n\nHelpful | 0\nDeveloper ResponseJun 11, 2019 at 1:37 AM\n\nThanks for the feedback. We will support this feature in the later releases (no ETA at the moment). Please be patient with us. Cheers.", "mdcwhitakerJun 8, 2019 at 3:17 AM\nSolid video player\n\nThis app is, in my opinion, more intuitive than the stock Quest video player. I thus turn to this app whenever I want to watch a film.\n\nHelpful | 2", "nsuniverseJul 2, 2019 at 9:27 AM\nThank you\n\nAlways the best.\n\nHelpful | 1", "jhillestadJun 14, 2019 at 4:02 PM\nGreat app\n\nBest movie theater experience app . Plays my 3D collection ..\n\nHelpful | 3", "abcde398Jun 10, 2019 at 11:29 PM\n3D subtitles\n\nWhy is it so long ? From the computer age to the present ,there are still no 3D subtitles.\n\nHelpful | 1", "Godislove4uJun 7, 2019 at 8:55 PM\nWill we get full movie rental/purchases?\n\nWe had different theaters on oculus video. Jesus Christ is my Lord and Savior !\n\nHelpful | 2", "DDay619May 25, 2019 at 10:14 AM\nBetter than Oculus Gallery.\n\nWorks great and has a solid feature set. Love the hidden folder with number lock for porn.\n\nHelpful | 2", "GubleMay 31, 2019 at 3:07 PM\nEasy streaming solution\n\nWorked flawlessly and required no setup for streaming videos from my Mac. Great quality and easy to use.\n\nHelpful | 1", "jaden.sylvanMay 21, 2019 at 1:52 PM\nBest Video Player for the Quest\n\nWatching movies on the surface of the moon is pretty AWsum.\n\nHelpful | 8", "ACE787Jun 9, 2019 at 1:20 PM\nAmazing\n\nA must have !\n\nHelpful | 2", "RocketshipDudeJun 4, 2019 at 1:06 AM\nGreat for 1 person\n\nIt's awesome. Sitting on the moon watching Dredd 3D was amazing. However, I really wish it supported inviting friends. That's my only downside. As soon as Big screen implements loading movies straight from internal headset storage, I won't have any use for sky box.\n\nHelpful | 0\nDeveloper ResponseJun 4, 2019 at 6:23 PM\n\nHi there, we will add support for multiplayer later this year. Thanks for your support.", "akaimizuMay 21, 2019 at 8:12 PM\nLove this on the Go, but has Quest bugs\n\nI have this running on both the Oculus Go and the Quest and the Quest version has some bugs with the Samba interface. When it finds the Samba drive, it cant seem to find directories on the Samba drive. No problem on the Go version.\n\nHelpful | 6\nDeveloper ResponseMay 22, 2019 at 9:11 AM\n\nSorry for the inconvenience. We have to temporarily disable the SMBv1 on Quest because of the instability of the software during the final testing phase. We will bring this feature back in later release. Please check this subreddit for more info: https://www.reddit.com/r/OculusQuest/comments/brm1ji/a_confession_to_make_about_skybox_vr_player_on/. Thank you for your understanding.", "theRileyMay 29, 2019 at 11:42 AM\nLove this app\n\nGreat experience and intuitive controls.\n\nHelpful | 2", "zsnowboarderMay 27, 2019 at 10:32 PM\nawesome!\n\nthis is awesome. please add netflix streaming. :)\n\nHelpful | 1", "CombatGerbilJun 19, 2019 at 1:39 AM\nDistortions in portions\n\nYour app badly distorts audio in several videos that other apps play perfectly. Especially bad for the ears if using headphones.\n\nHelpful | 0\nDeveloper ResponseJun 19, 2019 at 7:51 PM\n\nHi there, thanks for the feedback. If possible please share with us at support@skybox.xyz the video with distorted audio so we could test and fix this. Thank you for your support and looking forward to your email. Cheers.", "huntsman360Jul 12, 2019 at 1:29 PM\n\navatar 3d sbs stutters all the time\n\nHelpful | 0\nDeveloper ResponseJul 14, 2019 at 6:52 PM\n\nHi there, sorry for the inconvenience. Are you watching from local storage or via DLNA/SMB/AirScreen please? If you watch it via streaming, then please load the video into Quest and test if it's stutter. If possible, please share with us the source of the video at support@skybox.xyz so we could test it and fix this. Thank you for your support and looking forward to your email. Cheers.", "tombs359May 25, 2019 at 3:26 AM\nVuze CR 180 3d\n\nUnwatchable, 360 works fine, but 180 3D filmed on vuze XR is just bad the eye adjustment doesnt help. Same video on vive is fine. I hope its fixed.\n\nHelpful | 0\nDeveloper ResponseMay 26, 2019 at 7:58 PM\n\nHi there, we want to fix this. Please share with us one video filmed on Vuze XR at support@skybox.xyz so we could test it and improve SKYBOX. Thanks and looking forward to your email. Cheers.", "olaf666Aug 7, 2019 at 10:35 AM\nPerfect\n\nNice app\n\nHelpful | 0", "tbhatnagar01Jun 3, 2019 at 2:53 PM\nHeader\n\nThis is the review section\n\nHelpful | 6", "DomitrescuAug 9, 2019 at 3:27 PM\nNot possible to download the app\n\nIt is not possible to download the app, it gets cycled..\n\nHelpful | 0\nDeveloper ResponseAug 11, 2019 at 8:05 PM\n\nHi there, please contact Oculus directly to solve this issue. We suggest you to reconnect the internet and try reboot the device to see if it helps. Hope it helps. Cheers."]