{"App Title": "Skyworld: Kingdom Brawl", "App description": "All is fair in love and VR! Friends turn foe as you set foot in the VR battle arenas of Kingdom Brawl. From the creators of Arizona Sunshine, set in the universe of Skyworld, comes an action-packed real-time multiplayer game, exclusively for VR.\n\nIn Kingdom Brawl, you collect and upgrade dozens of cards to build a powerful deck, and watch your cards come to life as you cast spells and summon forces to wipe your enemy off the map. Join a clan, take on opponents from around the globe in regular online tournaments, and claim your place on the global leaderboards. This is no friendly battle this is war!\n\n\tPlay dozens of cards to deploy troops and cast spells\n\tChallenge friends worldwide in cross-platform multiplayer\n\tCompete in over 20 unique battle arenas\n\tJoin a clan, battle for glory and claim your rewards!\n\tClaim a place on the global leaderboards\n\tMake a name for yourself in regular tournaments\n\tVanquish your enemies with dragons and fireballs!\n\tWage war and be victorious!", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Strategy", "Languages": "English, Chinese (Hong Kong), Chinese (Taiwan), French (France), German, Italian, Japanese, Korean, Spanish (Spain)", "Version + Release Notes": "1.22", "Developer": "Vertigo Games", "Publisher": "Vertigo Games", "Website": "http://vertigo-games.com/", "Release Date": "September 12, 2019", "Developer Privacy Policy": "Vertigo Games\nHome About Jobs Contact Press Kits EULA\n \nVertigo Games Privacy Policy\n\nJuly 13, 2016\n\n1. OUR COMMITMENT TO PRIVACY\n\nScope.Vertigo Games, B.V. a company formed under the laws of The Netherlands (Vertigo, we, our, or us) respects and protects your privacy. This privacy policy (Privacy Policy) discloses the information that is collected by Vertigo or its third parties, the ways in which Vertigo, or our third parties processes and, sometimes, shares such information, and your rights and options with respect to such information.\n\nServices.This Privacy Policy covers information collected from users of any of Vertigos websites, applications, online services and other interactive properties, including for example, World of Diving, Arizona Sunshine, and Skyworld, that links to this Privacy Policy and all features, content, and other services that we own, control and make available through such websites, applications, services and properties (each a Service and collectively, the Services). Before using or submitting information to the Services please review this Privacy Policy carefully, as well as the terms of use related to each of the specific Services, which governs your use of the Services. A specific Service may have additional terms and policies regarding privacy for that specific Service, so in that instance, those additional privacy terms and policies will also apply. Should there be a conflict between this Privacy Policy and those additional privacy terms and policies, then the additional privacy terms and policies will control.\n\nAdvertisements, Content, Promotions and Services.The Services may include, without limitation, advertisements and promotions, displayed on or through such Services (collectively, Advertisements), text, images, photos, audio, music, videos, materials, comments, or other content displayed on or shared through the Services, whether provided by or on behalf of Vertigo, or uploaded or posted by users (collectively, Content), and sweepstakes, contests, rewards programs, special offers or other promotions (collectively, Promotions).\n\nOther Websites and Mobile Applications.Except where otherwise expressly indicated herein or on the Services, this Privacy Policy applies only to information collected on the Services and does not apply to information collected outside of the Services by other websites or mobile applications or by other third parties for which you may have a contractual relationship. Before using or submitting information to other websites or mobile applications or such third parties, please review their privacy policies carefully.\n\nMembers.Certain areas of a Service contain information intended only for users who create an account, join or otherwise register to use these areas on such Service (Members) and Vertigo reserves the right to limit these areas to Members. This Privacy Policy addresses Vertigos privacy practices relating to general use of the Services, as well as use of the Services by Members.\n\n2. INFORMATION VERTIGO COLLECTS\n\nVertigo collects the following types of information from users of one or more of the Services:\n\nPersonal Information.Vertigo may collect and process any information that you choose to enter on a Service or provide to Vertigo in any other way that would allow Vertigo to identify you or contact you (collectively Personal Information). The Personal Information that you provide will be used by Vertigo only in accordance with this Privacy Policy. Examples of Personal Information Vertigo may collect from you and use are:\n\na. the information you provide to become a Member;\n\nb. the e-mail addresses of those who upload, post or share Content on a Service;\n\nc. the names and e-mail addresses of those who communicate with Vertigo by e-mail;\n\nd. information you provide to Vertigo in surveys and polls on a Service;\n\ne. information you provide to Vertigo in an entry form for some Promotions offered on a Service and information provided by winners or recipients of those Promotions for a required background check or for tax purposes;\n\nf. in certain circumstances, payment and identity verification information, such as credit card number or other payment information in connection with a purchase made through a Service; and\n\ng. information about other people that you provide in connection with your use of a Service or Services or sharing Content.\n\nYou can choose not to provide Vertigo with certain Personal Information, but then you may not be able to take advantage of many features of a Service, such as posting comments, uploading or sharing Content, registering to use certain restricted areas of a Service, participating in Vertigos online community, entering or participating in Promotions, or receiving e-mail alerts or newsletters.\n\nAutomatic Information.Vertigo may collect and process certain types of information whenever you interact with Vertigo through the Services. Vertigo automatically receives and records your browser information, gameplay activity, motion sensor information, motion tracker information, operating system information, IP address, device ID, type of virtual reality equipment used, specific virtual reality platform, cookie information and the page you requested. This information will not be stored in a manner that is personally identifiable with you.\n\nAggregate Information.In connection with your visit or use of the Services, Vertigo may automatically collect usage information, such as the numbers and frequency of users and their characteristics and information about similar groups of users, certain age groups or users that live in a particular geographical area. This data is only used in the aggregate as a statistical measure and not in a manner that would identify you personally. Aggregate information generally is collected through the use of cookies and Web Beacons as discussed below.\n\nE-mail, Sharing and Communications.When you send an e-mail to Vertigo, either through the button on a Service or otherwise, Vertigo may retain your e-mail address and the contents of the e-mail that you send. When you post, upload or share Content through the Services or communicate with other users through a Service, Vertigo may retain copies of your Content. If you want to keep the information in your e-mail(s), posting(s), upload(s), share(s) or communication(s), private or proprietary, please do not send, post, upload, share, or communicate, such information or Content to Vertigo or through any Service. To help Vertigo make its e-mails more interesting and helpful, Vertigo also may receive a confirmation when you open e-mail from Vertigo if your computer or device supports this type of program.\n\nPurchases.If you interact with a Service which allows for the purchase or goods or services, Vertigo may retain the information regarding your purchase, but Vertigo will not retain any credit card information (although such credit card information may be retained by a third party which processes transactions for Vertigo).\n\nSocial Network Profile Information.If you interact with Vertigo, a Service, Content, Promotions, through a social network or by connecting your Member account with your social network account, then you may be permitting Vertigo to access certain information from your social network profile (such as your name, e-mail address, your friend list, photos, age, gender, location, birthday, social networking ID, current city, or the people/sites you follow). If you dont want to allow a social network to share such information with\n\nVertigo and other third parties, please review the privacy settings and instructions of the applicable social network before you connect your Member account with your social network account.\n\n3. INFORMATION COLLECTED BY THIRD PARTIES\n\nVertigo may allow third parties to display or provide Advertisements, Content, Promotions or other services on or through a particular Service, such as, for example, our website. Vertigo, its partners and/or advertisers, or social networks, may use third party servers to serve or present the Advertisements, Content, Promotions or the Services and to conduct research about the Advertisements, Content, Promotions or Services. Any of these third party servers may collect non-personal information, such as your browser, operating system, date/time of viewing, IP address, device ID, or clickstream data. Vertigo cannot control the activities of such third parties, websites or social networks.\n\nFurthermore, Vertigo may use third party services to enable online purchasing or e-commerce functionality, which involves the sale of Vertigos or third party products and services. These third party services may provide credit card or other payment processing services where they collect Personal Information and other financial information from you.\n\nPLEASE NOTE THAT THIS POLICY DOES NOT COVER THE COLLECTION AND USE OF INFORMATION BY SUCH THIRD PARTY SERVICES, SERVERS OR SOCIAL NETWORKS. PLEASE REFER THE PRIVACY POLICIES OF EACH SUCH THIRD PARTY.\n\n4. TRACKING TECHNOLOGIES\n\nVertigo or its third parties may use tracking technologies, such as cookies and Web Beacons, to collect information about users who visit or use the Services and view or interact with Advertisements, Content, and Promotions.\n\nCookies.Vertigo uses cookies to help you access and navigate the Services more efficiently and to statistically monitor how many people are using a Service.\n\na. A cookie is a small file or tool stored on your computer or device containing information that allows Vertigo to deliver customized information to you. Vertigo uses both session and persistent cookies on the Services. Session cookies are temporary bits of information that are erased once you exit your web browser or turn off your computer or device. Persistent cookies are more permanent bits of information that are placed on the hard drive (or other storage media) of your computer or device and stay there unless you delete the cookie. Persistent cookies store information on your computer or device for a number of reasons, such as retrieving certain information you have previously provided (i.e., username and password), helping to determine what areas of a Service you find most valuable and customizing such Service based on your preferences on an ongoing basis.\n\nb. You may set your browser to notify you of or decline the receipt of cookies. Certain features of a Service, including certain Content, or Promotions, may not, however, function properly or be available if your browser is configured to disable cookies. Many companies offer programs that help you to visit websites or mobile versions of such sites anonymously. While Vertigo will not be able to provide you with a personalized experience if Vertigo cannot recognize you, Vertigo wants you to be aware that these programs are available.\n\nWeb Beacons.During your use of a Service, you may encounter Web Beacons, which may come from Vertigo or from third parties that display or provide Advertisements, Content, or Promotions or services on such Service.\n\na. A Web Beacon (sometimes also called a web bug or clear gif) is a small graphic image in a web page, a web-based document or an e-mail message that generally allows the party that set the Web Beacon to monitor certain information about the viewer of the web page, web-based document or e-mail message and may allow access to certain cookies. Web Beacons are usually invisible to the user because they are very small (generally 1-by-1 pixel). In general, however, any electronic image viewed as part of a web page, including an Advertisement or Content, can act as a Web Beacon.\n\nb. Web Beacons on the website typically collect the URL of the page from which the Web Beacon originates, the type of browser requesting the Web Beacon, the IP address of the computer or device ID of the device to which the Web Beacon is sent and the time that the Web Beacon was viewed.\n\nc. Certain Web Beacons used by third party advertisers, content providers or other service providers may collect information that allows such third parties to determine how many people are viewing and/or clicking on certain Advertisements or viewing certain Content, Promotions or Services for purposes of helping these parties serve and manage their Advertisements, Content, Promotions and Services. These Web Beacons do not collect or store Personal Information but they may, however, be used in conjunction with cookies to identify certain aggregate information about users.\n\nDO NOT TRACK DISCLOSURES\n\na. Vertigo or its third parties may also use tracking technologies to collect information about your visits over time and across third-party websites or other online services. The Network Advertising Initiative (NAI) is a cooperative group of ad serving providers. The NAI has developed a set of privacy principles to which its members adhere. The NAI is committed to providing consumers with clear explanations of Internet advertising practices and how they affect you and the Internet generally. For more information about the NAI, third party ad servers generally and the opt-out options offered through the NAI, visithttp://www.networkadvertising.org/index.asp.\n\nSimilarly, for residents of the European Union, Your Online Choices athttp://www.youronlinechoices.euis written and funded by the internet advertising industry and supports a pan-European industry initiative to enhance transparency and control for online behavioral advertising. Please visit the website and select the country option for which you are a resident to find out more information about your opt-out options.\n\nb. California Business & Professions Code Section 22575(b) (as amended effective January 1, 2014) provides that California residents are entitled to know how Vertigo responds to Do Not Track browser settings. Vertigo does not currently take actions to respond to Do Not Track signals because a uniform technological standard has not yet been developed. Vertigo continues to review new technologies and may adopt a standard once one is created.\n\n5. HOW VERTIGO USES INFORMATION\n\nWhen you provide Vertigo with your Personal Information, Vertigo may use it to manage Vertigos registry of Members, facilitate communication between Vertigo and you and/or between Members of a Service, notify you of features or special events and provide you with other information Vertigo feels may be of interest to you. Vertigo also uses information collected to customize, analyze, adjust and improve our Services, Content, and Promotions and to meet Vertigos users needs and expectations. Vertigo also may use the information to oversee adherence to Vertigos guidelines for user content which are provided in the terms of use for the Services to enforce Vertigos agreements with you, to prevent fraud and other prohibited or illegal activities and for other legally permissible purposes. These uses of your Personal Information may include, without limitation, the following:\n\nPublic Areas.A Service may feature groups, discussions, member profiles, comment areas, blogs and similar areas where users can share information about themselves and their opinions, as well as post questions and Content that may contain Personal Information (Public Areas). Other visitors to a Service may view information posted in Public Areas. Further, Vertigo may include all or a portion of the information posted in Public Areas in the newsletters described in this Privacy Policy. By using the Public Areas, you hereby acknowledge and agree that any information you share in a Public Area (including, without limitation, Personal Information) is available to the public. Information you post to a Public Area may be viewed, accessed, or collected by, or disclosed to, third parties and may be used by others in ways neither you nor Vertigo are able to control or predict, including, without limitation, to contact you for unauthorized purposes.\n\nEmail, Sharing and Communications.A Service may offer the ability to share Content or communicate directly with other users via e-mail and other communications. If you use e-mail or other communications, Vertigo will use the recipients e-mail address or other means of identification in order to send the Content and Vertigo will also ask for your e-mail address or other means of identification. Vertigo does not use the recipients e-mail address or other means of identification for any other purpose unless the recipient gives Vertigo permission to do so.\n\nMember Areas.If you have access to certain areas of a Service because you are a Member (Member Areas), the Member Areas may contain groups, discussions, member profiles, comment areas, blogs and similar areas where Members can share information about themselves and their opinions, as well as post or share Content. Personal Information or Content you post or share through a Member Area may be viewed, accessed, or collected by, or disclosed to, other Members and may be used by other Members in ways neither you nor Vertigo are able to control or predict, including, without limitation, disclosure of your Personal Information or Content to the public or to contact you for unauthorized purposes. Vertigo uses the Personal Information you provide when registering to become a Member to send you Vertigo publications, information about Member benefits and special offers, features included in the Member Areas and other information that Vertigo believes is relevant and useful to its Members. By using the Member Areas, you hereby acknowledge and agree that any information you share in a Member Area (including, without limitation, Personal Information) is available to other Members and to Vertigo for use as provided herein.\n\nProfiles.If you register to become a Member of a Service, the information that you provide to Vertigo may be associated with one or more profiles, which may be stored on our or third party servers. These profiles, or a portion thereof, may be viewed by other Users of a Service, including, but not limited to those who are not Members of such Service.\n\nE-Newsletters.If you register at a Service or subscribe to any features or services, you may choose to receive a newsletter via e-mail from Vertigo or other notifications via a mobile application which may include information such as highlights from different areas on a Service, and information about new features, Content, Promotions or other Services. You can unsubscribe from the newsletter at any time by clicking on the manage your preferences link at the bottom of any e-mail newsletter sent to you and following the instructions. You also may unsubscribe at any time by logging in to the applicable Service where you created your profile and changing your preferences. Furthermore, you may elect to turn off notifications in a mobile application.\n\nPromotions.Often times, Promotions offered on a Service are sponsored by unaffiliated third parties. Information that you provide as part of an entry into a Promotion sponsored by an unaffiliated third party will be shared with the sponsor if Vertigo advises you of such in the Promotions official rules. Some Promotions also may require consent to the release of information contained within the entry form for background check purposes or tax purposes if you become a winner. You should carefully review the official rules of each Promotion that you enter as they may contain additional important information about Vertigos or the sponsors use of your Personal Information.\n\nFeatures and Services.Vertigo may retain other third parties and individuals to provide features and Services consistent with Vertigos Privacy Policy on Vertigos behalf. Examples include customer support specialists, web hosting companies, fulfillment companies (e.g., companies that fill product orders or coordinate mailings), data analysis firms and e-mail service providers.\n\nEditorial.Vertigo also may use your Personal Information in response to a solicitation for editorial, online or for marketing and promotional purposes in connection with such solicitation. If such information is used online, on a mobile application or in a telecast, no Personal Information, other than name, city and state, will be disclosed without your consent.\n\nSocial Network Features. Vertigo and the Content, Promotions and Services, may include features that connect to social networks and allow you to share or like Content, Promotions or Services with your friends or other users of the social networks. These social networks may collect information, such as your IP address, which page you are visiting on a Service, the videos you viewed, or the Content, Promotions or Services that you shared, and may set a cookie to enable the features to function properly. The social network providing the features on a Service may be able to collect information about you, even if you dont use those features. To control this sharing of information, please review the privacy policy of the relevant social network.\n\nEcommerce and Subscriptions.Vertigo may also use cookies to enable you to use a shopping cart if you want to enroll in a subscription or purchase goods or services while on a Service, to store your preferences associated with purchased goods or services or other Content offered from a Service and to offer you products, programs, or Promotions based on purchases, subscriptions and Service usage behavior that you and/or other customers have exhibited. If you purchase a subscription or goods and services through a Service, your Personal Information and payment information (other than credit card or debit card information) will be collected and stored by us with your account.\n\nVideos. Certain cookies that are set when some video products are accessed on a Service, called local shared objects or Flash cookies, may not be managed using the settings in your web browser. If you set your browser options not to accept cookies or local shared objects, you may not be able to take advantage of certain ecommerce Services, videos on a Service. You agree that Vertigo may share your viewing of videos with, or obtain information about your viewing of videos from, analytics providers and advertising partners and third-party social media sites unless you withdraw your consent.\n\nReports.The aggregate information collected by Vertigo may also be used to create profiles of the audience for a Service that include anonymous statistical demographic information but no Personal Information. This aggregated information is used to, among other things, determine trends and needs and supply market research to potential advertisers and partners to help them understand our Services audiences. For example, Vertigo may create a report that tells advertisers that thirty percent of Vertigos Members are females under forty years, so that they can determine which of their Content, Promotions or Services are most appropriate for Vertigos Members.\n\nAdministration.From time to time, in Vertigo s sole discretion, Vertigo may use your Personal Information to send you important administrative information regarding the Services or changes to Vertigos terms and policies. Because this information may be important to your use of the Services, you may not opt out of receiving such communications.\n\n6. WITH WHOM VERTIGO SHARES INFORMATION\n\nVertigo may share your Personal Information with third parties, as follows:\n\nAdvertisers.If you opt in to receive information about identified advertisers or their services or products, Vertigo may share your Personal Information with them. If you have questions about how these companies use your Personal Information, Vertigo encourages you to review and understand their respective privacy policies. You may at any time opt out of having your Personal Information as part of Vertigos marketing mailing list or otherwise.\n\nYou can send an e-mail tolegal@vertigo-games.com; or you can send mail to the following postal address:\n\nVertigo Games B.V.\nWeena 723, 3013 AM Rotterdam\nNetherlands:\nAttention: Legal  Privacy\n\nAdvertising Partners.Advertisements appearing on a Service may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer or device each time they send you an online Advertisement to compile information about you or others who use your computer or device. This information allows ad networks to, among other things, deliver targeted Advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by the Services and does not cover the use of cookies by any advertisers, each of whom maintain their own privacy policy.\n\nService Providers.Vertigo engages service providers to perform functions and provide services to us or on our behalf, including Promotions, Advertisements, and other programs. Vertigo may share your Personal Information with such service providers subject to obligations consistent with this Privacy Policy and any other appropriate confidentiality and security measures, and on the condition that the third parties use your Personal Information only on our behalf and pursuant to our instructions.\n\nPayment Processors. Vertigo shares your payment information with payment services providers to:\n\na. process payments,\nb. prevent, detect and investigate fraud or other prohibited activities,\nc. facilitate dispute resolution such as chargebacks or refunds, and\nd. for other purposes associated with the acceptance of credit or debit cards.\n\nIf such information is stored with Vertigo, Vertigo may share your credit or debit card number with payment services providers or card networks to monitor card transactions at participating merchants and track redemption activity for the purposes of providing card-linked services.\n\nGovernment, Law Enforcement or Third Parties.Vertigo may disclose any information, including without limitation Personal Information that Vertigo deems necessary, in its sole discretion and without your prior permission, to comply with any applicable law, regulation, legal process or governmental request. Vertigo also may exchange information, including without limitation Personal Information, with other companies and organizations for credit fraud protection, risk reduction and related activities or to protect the rights, property of safety of Vertigo and its agents, employees or affiliates or others. Vertigo reserves the right to disclose a users Personal Information if Vertigo believes the user is in violation of Vertigos terms of use, even without a subpoena, warrant or other court order.\n\n7. SALE OR TRANSFER OF INFORMATION\n\nIn the event of a sale, merger, liquidation, dissolution or sale or transfer of substantially all of the assets or equity of Vertigo or the Services, Personal Information and/or other information collected about you from the Services may be sold, assigned or transferred to the party acquiring all or substantially all of the equity and/or assets of Vertigo or the Service(s) in order to permit the party to continue the operation of the applicable Service or Services. Subject to your ability to opt-out, you consent to the sale and transfer of your information as described in this paragraph.\n\n8. ACCESSING, CORRECTING OR REMOVING YOUR PERSONAL INFORMATION\nIf you are a Member and would like to review or update your profile, please log in to and select the profile in which you would like to review, modify or delete information (i.e., the Personal Information you have provided to us). If you would like to delete your profile, please contact us at legal@vertigo-games.com.\n\nChoice.Vertigo respects the privacy of your Personal Information. If you tell Vertigo that you do not wish to have this information used as a basis for further contact with you, Vertigo will respect your wishes. You also may choose not to provide Vertigo with certain information, but that may result in you being unable to use certain features of a Service. You may instruct Vertigo to stop sending you certain promotional materials (e.g., e-mail messages, newsletters, postcards and letters) by following the unsubscribe instructions provided in those materials or by turning of the notification feature on a mobile application. Vertigo may, however, continue to contact you to provide service to your account. Please note that if you use more than one name or e-mail address when communicating with Vertigo or participating on a Service, you may continue to receive communications from Vertigo to any name and/or e-mail address which you have not specified in your opt-out request.\n\nCorrecting or Removing Your Personal Information.For Personal Information Vertigo holds, you can request that we correct the data if it is inaccurate or remove the data if we are not required to retain it by law or for legitimate business purposes. For example, under the Data Protection Directive (European Union Directive 95/46/EC of October 24, 1995) you are entitled to obtain information (a) confirmation as to whether data relating to you is being processed and information as to the purposes of the processing, the categories of data, and the recipients to whom the data are disclosed; (b) communication of the data undergoing processing and of any available information as to their source; and (c) knowledge of the logic involved in any automatic processing of data concerning you.\n\nVertigo may decline to process requests that are frivolous/vexatious, jeopardize the privacy of others, are extremely impractical, or for which access is not otherwise required by local law. Under the Data\n\nProtection Directive, we may charge you a 5 fee to comply with your request.\n\nVertigo provides you with the following options for correcting or removing your Personal Information from Vertigos database for marketing purposes:\n\nYou can send an e-mail tolegal@vertigo-games.com; or you can send mail to the following postal address:\n\nVertigo Games B.V.\n\nWeena 723, 3013 AM Rotterdam\nNetherlands:\nAttention: Legal  Privacy\n\nCanceling Your Account or Subscription.To cancel your account or subscription, you can: (a) e-mailcustomer@vertigo-games.com, subject Cancel My Account or Cancel My Subscription and include the e-mail address that you registered your account or subscription with (if different from the e-mail address youre sending the e-mail from); or (b) via your online Member account page. Remember that even after you cancel your account, copies of some information from your account may remain visible in some circumstances  where, for example, you have shared information with a third-party application or website. Vertigo may also retain backup information related to your account on our servers for some time after cancellation for fraud detection or to comply with applicable law or our internal security policies. Because of the nature of caching technology, your account may not be instantly inaccessible to others, and there may be a delay in the removal of the content from elsewhere on the Internet and from search engines.\nData Retention. Vertigo will retain your information for the period necessary to fulfill the purposes outlined in this Privacy Policy unless a longer retention period is required or allowed by law or unless otherwise limited by law.\n\n9. IMPORTANT DISCLOSURES, PRACTICES AND CONTACT INFORMATION\n\nThird Party Links.The Services may contain links to third-party web sites. Please be aware that Vertigo cannot control and is not responsible for the information collection practices of such web sites, which may differ from those of Vertigo. Vertigo encourages you to review and understand the privacy policies of these websites before providing any information to them.\n\nData Security.Vertigo (either itself or through third party service providers) maintains a variety of commercially reasonable physical, electronic and procedural safeguards designed to protect your Personal Information from unauthorized access and disclosure. For example, Vertigo uses accepted tools and techniques to protect against unauthorized access to Vertigos systems. You should be aware that Vertigo has no control over the security of other sites on the Internet that you might visit or with which you might interact even when a link may appear to another site from one of the Services. Vertigo wants you to feel confident using the Services but no system can be completely secure. Therefore, although Vertigo takes steps to secure your information, Vertigo does not promise, and you should not expect, that your Personal Information, searches or other communications will always remain secure. In the event of a breach of the confidentiality or security of your information, including your Personal Information, Vertigo will notify you as necessary and if possible so you can take appropriate protective steps. Vertigo may notify you under such circumstances using the e-mail address(es) that Vertigo has on record for you and/or by regular mail (if available). You also should carefully handle and disclose your Personal Information.\n\nChildren.The Services are intended for general audiences and are not intended for children under thirteen (13) years of age. Vertigo requires that only persons thirteen (13) years of age or older use any of the Services. By using any Service, you hereby represent that you are at least thirteen (13) years old. Vertigo does not knowingly market to, solicit information, accept service or collect information from children under the age of thirteen (13). A Service may ask users for their birth dates to ensure that such Service is not collecting information from children under age thirteen (13) or to identify when additional steps may need to be taken in connection with information collected from children under age thirteen (13). When a Service has actual knowledge that it collects information from children or offers a service directed toward children, it will comply with applicable laws, including the U.S. Childrens Online Privacy Protection Act of 1998. In the event that Vertigo learns that we have collected Personal Information from a child under age thirteen (13) without parental consent, we will delete that information as quickly as possible. If you believe that we might have any Personal Information from or about a child under thirteen (13), please contact us at:legal@vertigo-games.com.\n\nCertain Minors in the Netherlands.If you are a resident of the Netherlands, and you are a minor under the age of sixteen (16), then the consent of your legal representative is required for this Privacy Policy. Therefore, if you are under the age of sixteen (16), you represent to Vertigo that by using any of the Services, your legal representative has agreed (on your behalf and on behalf of such representative) to be bound by the terms of use for our Services and also consents to this Privacy Policy. If Vertigo learns that we have collected Personal Information from a minor under age sixteen (16), who is also a resident of the Netherlands and your legal representative has not provided consent, we will delete that information as quickly as possible. If you are a legal representative of a minor under the age of sixteen (16), who is a resident of the Netherlands, and believe that we might have any Personal Information from or about such minor, please contact us at:legal@vertigo-games.com.\n\nChanges to this Privacy Policy.At any time without prior notice, Vertigo may update this Privacy Policy to reflect changes in Vertigos practices. When Vertigo posts changes to this Privacy Policy, Vertigo will revise the Last Updated date at the top of this page. Vertigo encourages you to bookmark this Privacy Policy and to periodically review it to inform yourself of changes to it or any of Vertigos other policies. Any changes to Vertigos Privacy Policy will become effective upon Vertigos posting of the updated policy.\n\nUse of any Service that inks to this Privacy Policy constitutes your acceptance of the terms of this Privacy Policy then in effect.\n\nCalifornia Privacy Rights.If you are a resident of the State of California, United States (California Users), in addition to the rights set forth in this Privacy Policy, you may have certain additional rights. You generally have the right to request information from Vertigo regarding the manner in which Vertigo shares certain categories of Personal Information with third parties for their direct marketing purposes. California Civil Code Section 1798.83 permits you to request information regarding the disclosure of your Personal Information by us to third parties for the third parties direct marketing purposes. Under the law, however, a business is not required to provide this information if it adopts and discloses to the public (in its privacy policy) a policy of not disclosing customers personal information to third parties for their direct marketing purposes unless the customer first affirmatively agrees to the disclosure, as long as the business maintains and discloses this policy. Rather, the business may comply with the law by notifying California Users of their rights to prevent disclosure of personal information and providing a cost free means to exercise that right.\n\nPlease note that whenever you opt in to receive future communications from a third party, your information will be subject to the third partys privacy policy. If you later decide that you do not want that third party to use your information, you will need to contact the third party directly, as Vertigo has no control over how third parties use information. You should always review the privacy policy of any party that collects your information to determine how it will handle your information.\n\nPlease note that Vertigo is only required to respond to one request per customer each year. Vertigo is not required to respond to requests made by means other than through this e-mail address:legal@vertigo-games.com.\n\nCalifornia residents who are minors under eighteen (18) years old may request the removal of any information that they posted to a Vertigo Service by contactinglegal@vertigo-games.com. Upon such request, Vertigo will anonymize or remove from public view any content posted by a minor to a Service, unless required by law to retain such content or information.\n\nUsers from Other Jurisdictions.By visiting a Service, submitting information or using any of Vertigos Content, Promotions or Services, you acknowledge that you accept the practices and policies outlined in this Privacy Policy and consent to having your data transferred to and processed on computers located outside of your state, province, country or other governmental jurisdiction where the data protection laws may differ from those in your jurisdiction. If you do not accept this Privacy Policy, please do not use the Services. The Services are controlled and operated by Vertigo from the Netherlands. If you are not a resident of the Netherlands or you are located outside the United States and choose to provide information to Vertigo, please note that Vertigo may transfer the information, including Personal Information, to the United States and process it there unless otherwise prohibited by law. Your acceptance of this Privacy Policy followed by your submission of such information represents your agreement and consent to that transfer. Vertigo does not represent or warrant that any Service, or any part thereof, are appropriate or available for use in any particular jurisdiction. Those who choose to access a Service do so on their own initiative and at their own risk, and are responsible for complying with all local laws, rules and regulations. Vertigo may limit the availability of the Content, Promotions or Services, in whole or in part, to any person, geographic area or jurisdiction that Vertigo chooses, at any time and in Vertigos sole discretion.\n\nNo Rights of Third Parties.This Privacy Policy does not create rights enforceable by third parties.\n\nContacting Vertigo.If you have any questions about this Privacy Policy, the practices of the Services or your dealings with us, please feel free to contact Vertigo at:\n\nVertigo Games B.V.\nWeena 723, 3013 AM Rotterdam\nNetherlands\nAttention: Legal  Privacy\nlegal@vertigo-games.com\n\nCopyright  2008  2018 | Vertigo Games B.V. & Vertigo Arcades B.V. All Rights Reserved | Privacy Policy\nHome\nAbout\nJobs\nContact\nPress Kits\nEULA\n Vertigo Games B.V. 2018", "Developer Terms of Service": "Vertigo Games\nHome About Jobs Contact Press Kits EULA\n \nEULA\n\nVERTIGO GAMES  END USER LICENSEAGREEMENT\n\nLast Updated: December 4, 2016\n\nBY ACCEPTING THIS END USER LICENSE AGREEMENT (EULA) OR USING OUR SERVICES, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THE EULA IN ITS ENTIRETY. IF YOU DO NOT AGREE TO THE EULA, DO NOT ACCESS OR USE OUR SERVICES.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13 AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SERVICES WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THIS EULA. MAKE SURE TO REVIEW THIS EULA WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nVertigo Games, B.V. (Vertigo, we, us or our) is pleased to provide you access to, and use of software, websites, applications, and content (collectively, the Services). These EULA (Terms) apply to your purchase, access to, and use of, any Services. These Terms do not alter in any way the terms or conditions of any other agreement you may have with Vertigo for products, services or otherwise. If you are using the Services on behalf of any entity, you represent and warrant that you are authorized to accept these Terms on such entitys behalf and that such entity agrees to be responsible to us if you or that entity violate these Terms.\n\nVertigo reserves the right to change or modify these Terms on a going forward basis at any time and in our sole discretion. If Vertigo makes changes to these Terms, we will provide notice of such changes as appropriate, such as providing notice through the Services and/or updating the Last Updated date at the top of these Terms. Your continued use of the Services will confirm your acceptance of the revised Terms. If you do not agree to the revised Terms, you must stop using the Services. We encourage you to review the Terms from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Services.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with theEnglish version, the English version controls.\n\nEligibility\n\nYou must be at least 13 years of age to access and use the Services. There is no exception to this requirement. Vertigo does not knowingly collect any personal information from children under the age of 13. By your use of the Services, you agree that you are either 18 years of age or older, or an emancipated minor, or possess legal parental or guardian consent, and that you are fully able and competent to understand and accept this EULA as a binding contract and to abide by all Terms.\n\nSoftware Updates\n\nCertain software may be required to access and use the Services. In addition, we may need to automatically update some of the software you obtain through the Services or provide you with new software to keep the Services functioning properly, which could include bug fixes, patches, enhanced features, missing plug-ins and new versions. By using the Services, you agree to such automatic updating.\n\nWe reserve the right, in our sole discretion and where technically feasible, to disable your access to or ability to use Services that we believe present a health and safety risk or violate our community standards, agreements, laws, regulations or policies. We will not incur any liability or responsibility if we choose to remove, disable, or delete such access or ability to use any or all portion(s) of the Services.\n\nYour Use of Services\n\n3.1Content and Software License. Except as otherwise agreed upon, if we enable the use of software, content, virtual items or other materials owned or licensed by us (Software and Content), we hereby grant you a limited, nonexclusive, non-sublicensable license to access, install, and use the Software and Content solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software and Content, except as expressly permitted by Vertigo or as permitted under applicable law. Any unauthorized use of the Services is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n3.2Availability. The Software and Content may not be available in all territories and jurisdictions, and we may restrict or prohibit use of all or a portion of the Services and Content in certain territories and jurisdictions.\n\n3.3Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Services and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\nPurchases\n\n4.1Account. You may be required to be a registered user in order to purchase some Services. You are responsible for all charges incurred in connection with your account. Vertigo may attempt to collect unpaid charges, including by attempting additional charges to your payment instrument, use of collections agencies and any other legal means. If you decide to cancel your account, Vertigo reserves the right, subject to any limitations under applicable laws, to collect fees, surcharges, or costs incurred before cancellation. Any delinquent or unpaid accounts must be settled before Vertigo will allow you to register again.\n\n4.2Virtual Items. Your purchase of a virtual item or in-game currency within the Services is a payment for a limited, non-assignable license to access and use such content or functionality in the Services. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Services can only be used in connection with the Services where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Services for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n4.3Pricing and Payment. We may accept various forms of payment, including credit and debit cards, and additional terms with your payment provider may apply. Prices are subject to change without notice. We reserve the right to refuse or cancel orders at any time and in our sole discretion.\n\n4.4Taxes. If your purchase or use of the Services is subject to any type of use or sales tax, duty or other governmental tax or fee (Taxes), then we may charge you for those Taxes. Applicable Taxes may be presented at checkout. You are responsible for any Taxes due with respect to your use of the Services.\n\n4.5Content Cancellations; Returns. All purchases of digital content are final except as required by law. Once you purchase Content, we encourage you to download, install and/or access it promptly.If you are located in the EU, you consent that the supply of the digital content may begin immediately following the completion of your purchase and you acknowledge that you therefore will lose any statutory rights you may have to withdraw and receive a refund. If you are unable to download, install or access purchased content, please contact us atsupport@vertigo-games.com.\n\nCode of Conduct\n\nYou agree to abide by this code of conduct during multiplayer or co-op gameplay sessions:\n\n(a) Do not use derogatory, demeaning, malicious, defamatory, abusive, offensive, hateful or discriminatory language.\n\n(b) Do not harass, bully, threaten, harm or cause discomfort for other users. For example:\n\nUse of hate speech or racial, ethnic, sexist, homophobic or religious slurs;\nHarassment of a specific person (repeated flaming or personal attacks); or\nDisclosing any personal or private information of another person, or any confidential information pertaining to a business, without consent.\n\n(c) Do not promote, plan, glorify or engage in any illegal activity or otherwise make available content that would encourage or provide instructions for an illegal activity. These topics include but are not limited to crimes relating to drugs, drug paraphernalia, rape, solicitation of a minor, computer hacking, counterfeiting and fraud.\n\n(d) Do not impersonate other persons, including fellow users or Vertigo staff or attempt to obtain sensitive information from other users. For example:\n\nFalsely claiming an official title or to hold position relating to Vertigo;\nFalsely claiming the representation of another business or websites;\nFalsely claiming to be a law enforcement officer; or\nSoliciting passwords or personal information from other users.\n\n(e) Do not engage another user under false pretenses or otherwise defraud another user.\n\nVertigo, at its sole discretion, may issue a warning or expel User from the Services for violations of the Code of Conduct.\n\nUser Content\n\nOur Services may include interactive features and areas where you may submit, post, upload, publish, email, send or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Services, you grant Vertigo a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Services. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Services and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Vertigo the rights specified in this section; (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations; and (c) your User Content does not violate our community standards.\n\nVertigo does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Vertigo has no responsibility or liability for User Content made available through the Services, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\nServices Ownership and License\n\nUser acknowledges that Vertigo retains all right, title and interest to the Services, the Services design and documentation, and the intellectual property rights therein and thereto (including without limitation, all patent rights, design rights, copyrights and trade secret rights).\n\nUnless otherwise indicated, the Services are the property of Vertigo or our licensors and are protected by copyright, trademark and other laws of The Netherlands and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Services.\n\nVertigo Games and the Vertigo logo (Vertigo Marks) are trademarks or registered trademarks of Vertigo Games, B.V. The Vertigo Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, including as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder.\n\nDisclaimer of Warranty\n\nYOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK. AS BETWEEN YOU AND VERTIGO, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN AS IS AND AS AVAILABLE BASIS AND VERTIGO EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, VERTIGO DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS; (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY VERTIGO WILL CREATE A WARRANTY.\n\nYOU FURTHER ACKNOWLEDGE AND AGREE THAT VERTIGO IS NOT RESPONSIBLE FOR THE CONDUCT, WHETHER ONLINE OR OFFLINE, OF ANY USER OF THE SERVICES. UNDER NO CIRCUMSTANCES WILL VERTIGO BE RESPONSIBLE FOR ANY LOSS OR DAMAGE, INCLUDING PERSONAL INJURY OR DEATH, RESULTING FROM YOUR USE OF THE SERVICES, ANY USER-GENERATED CONTENT IN THE SERVICES OR TRANSMITTED TO ANOTHER USER, OR ANY TRANSACTIONS BETWEEN OR AMONG YOU AND OTHER USERS, WHETHER ONLINE OR OFFLINE.\n\nTHE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\nIndemnification\n\nYou agree to defend, indemnify and hold harmless Vertigo and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, Vertigo Parties) from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Services; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Vertigo or a third party in relation to the Services, (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\nLimitation of Liability\n\nTHE VERTIGO PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SERVICES, EVEN IF AN VERTIGO PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE VERTIGO PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SERVICES EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SERVICES. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU.\n\nPrivacy\n\nUser accepts and agrees to Vertigos Privacy Policy as found athttp://vertigo-games.com/vertigo-games-b-v-privacy-policy/\n\nNo Assignments\n\nUser may not assign or otherwise transfer any rights or obligations under this EULA.\n\nSeverability\n\nIf a court finds any provision of this EULA invalid or unenforceable, the remainder of this EULA shall not affect the validity and enforceability of any remaining provisions.\n\nNon-waiver\n\nThe failure to exercise any right provided in this EULA shall not be a waiver of prior or subsequent rights.\n\nGoverning Law\n\nThis EULA shall be governed in accordance with the laws of the country of The Netherlands. The parties consent to the exclusive jurisdiction and venue of the courts located inThe Netherlands in any action arising out of or relating to this EULA. The parties waive any other venue to which either party might be entitled by domicile or otherwise.\n\nAttorney Fees and Expenses\n\nIn a dispute arising out of or related to this EULA, the prevailing party shall have the right to collect from the other party its reasonable attorney fees and costs and necessary expenditures.\n\nModifications to the Services\n\nVertigo reserves the right to change, suspend, remove, discontinue or disable access to the Services or particular portions thereof, at any time and without notice. In no event will Vertigo be liable for the removal of or disabling of access to any portion or feature of the Services.\n\nTermination\n\nWe reserve the right to terminate your right to access and use the Services if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\nCopyright  2008  2018 | Vertigo Games B.V. & Vertigo Arcades B.V. All Rights Reserved | Privacy Policy\nHome\nAbout\nJobs\nContact\nPress Kits\nEULA\n Vertigo Games B.V. 2018", "Space Required": "1.22 GB"}



["5 stars\n55%\n4 stars\n22%\n3 stars\n11%\n2 stars\n6%\n1 star\n6%", "Keelan358Jun 10 at 5:41 PM\nGreat Idea\n\nAs someone who constantly plays Clash Royale on their phone this game was a must buy for me! If you like card battle games or even battle simulation games you will enjoy playing this game, and with it being in VR it definitely heightens the enjoyment. My one real problem with the game is that its hard for me to find online opponents but it might just be because Im at a beginner level right now. Other than that I would highly recommend this game to anyone, especially with it being only $10!\n\nHelpful | 40", "Nightflame456Jul 12 at 5:45 AM\nClash Royale in Person\n\nGraphics are very basic (I mean that as a good thing), dont take too much attention off of the game itself. I also really like how you have to play matches to buy newer and more powerful units.\n\nThe only bad thing is that the matchmaking takes forever, and Im pretty tired of battling the AI. But this isnt really the developers fault, because the matchmaking relies on other players to want to duel as well.\n\nOverall, the game itself is great, but the AI can become a little repetitive. Keep up the good work!\n\nHelpful | 4", "Dreadnor14 days ago\nVery fun but needs more work.\n\nGood job to the devs for making a fun and engaging game. This game pulled me in quickly with its fast combat style which is unusual to the game of this type but its awesome. I mix matched different cards and played alot of battles where I had to properly place units, time them right and propoerly match then against the enemy. Its fun.\nBut the thing is thats all there is too it. You have a pile of cards that you can choose from and then you battle against ai or player. What I am saying is the game needs more there is so much potential. For example add a system like clash of clans where you can build or make some kind of engaging game mode where you can become the general and actually go in. Or add a cool mechanic for example what if you could place your friends that are with you into battle as troops. Make co-op. I would love building and more activities. Or even add a tavern where people can talk and watch the match. Or add a custom map maker! Or add flares which allow you to tell units where to go instead. Please keep the game alive. Dont let it die on this. I am pretty sure there are ways you can get monitization for example by adding building time or or boxes idk but dont give up on this game you have a solid start. Keep working devs. Even tho you will probably not read this I hope you guys keep going and good luck.\n\nHelpful | 2", "Rage619 days ago\nEnjoyed it so far\n\nI am very pleased after my first run through tonight. It seems to be easy to learn, tough to master. The AI and its different difficulty levels was useful. It seems like your unit upgrades (which you can get with the gold that you earn each game) is the biggest factor. If youre starting with only beginner stuff, you are probably going to be the punching bag on that game. It doesnt take long to make the upgrades though. Wish I had more control of my units (as I reminisce about Age of Empires in my childhood, haha).\n\nHelpful | 1", "cobra0309Jun 1 at 6:12 AM\nGreat game, one flaw\n\nWhen I started playing this game I instantly got addicted to it. Its a very fun game and its like clash Royale. Only problem is there is not enough players so pvp takes forever. I understand that you cant control this, but you could maybe make the game cheaper or add more game modes so the player doesnt get bored of waiting and quit the game\n\nHelpful | 22", "ZaparitionJul 30 at 5:55 AM\nVery addictive game with great replay\n\nPros: Currently my favorite game on quest. It is extremely addicting if you enjoy strategy based / deck building games!\n\nCurrent cons: Wait time to be matched to an opponent (especially at lower levels).\nYou are sometimes very consistently matched to the same person even when you dont rematch them.\n\nI also hope more battle maps and units are added\n\nHelpful | 1", "JesusValentineJul 14 at 4:10 PM\nGreat game\n\nThis is what Ive always wanted ima card summoning game. Actual troops on a field battling each other. Yeah the cards could be more complicated to give it some more depth and I wish there was more players but I cant see any other games like this on the market\n\nHelpful | 2", "superEli7Jul 22 at 4:07 PM\nSuper good game I really recommend it\n\nAs I said in the title super good game has a few glitches but it is pretty good, there is a glitch where black pixels pop up but thats just a bug for the oculus quest but the annoying part about it is I have to wait 30 minutes until it stops and most the time is right in the middle of a match thats really it.\n\nHelpful | 0", "BouncinBob4223 days ago\nGreat game\n\nThis is a fantastic game and excactly what vr should be, but there just aren't enough people.\n\nHelpful | 1", "j_SembiApr 25 at 4:44 PM\nGreat game - Similar to clash of clans\n\nGreat game. Lots of different characters to choose. A very strategic game similar to clash of clans. I think it is a hot deal/bargain at the current price.\n\nNote to developers- please let us play with the AI while waiting for a PvP battle opponent. Also maybe make an hour (say 8pm gmt every night) double points so that more players will join at that time.\n\nHelpful | 24", "irdugdaleMay 26 at 3:38 AM\nGreat strategy game\n\nTook me a while get going I've finding it really addictive. Theres so many different combinations to experiment with.\nFinding someone to play with can be more miss than hit but playing against the AI bots is great to.\nHaven't been able to get screen share or audio between players working yet?..\n\nTip. Each game has two or three discs across the centre of the battle ground. The last characters to pass over them trigger floating guns that join your battle.\n\nHelpful | 5", "CaptainFandangoApr 30 at 4:31 PM\nUnderrated\n\nI got this game when it launched and really enjoyed it. Then for some reason I stopped playing it and it sat at the bottom of my list my for a few months, unplayed and unloved.\n\nI picked it up again recently and have put quite a bit of time into it again. This is a really great, cheap and wholly underrated game. For less than the cost of a movie this is definitely worth picking up.\n\nI doubt it will be your favourite, but it is definitely a unique and valuable addition to any Quest library.\n\nHelpful | 3", "KizuRaiFeb 22 at 11:32 AM\nWinding Down\n\nThis is a pretty good game to sit and wind down with. I'm awful at it btw, I can't seem to figure out the right combination of characters to use, but I'm okay with it because it's all for fun.\n\nI've met some fun people to match with, we wave and then get to battling, but there was one person that gave me a thumbs up after losing and I thought that was good sportsmanship and started doing that myself.\n\nIt is hard to match though, and if it takes too long I usually just fight AI battles which reduce the pressure. It takes forever for me to earn enough money to craft everything but again, that's probably because I'm awful at this game, but it does increase the longevity of it.\n\nThe graphics are good enough and the only lag spikes I've felt are from faulty internet connections.\n\nAnyway, after playing something intense like Beat Saber, it was nice to have an alternate game that lets me just sit down and play and barely move. I hope to see an actual RTS one day because I do favour RTS'.\n\nHelpful | 61", "1-VRMay 25 at 5:52 PM\nFun, but too simple\n\nIt's fine, but it is way too simple. There aren't enough unit types or maps, and your deck is too small. If the deck size could be greatly expanded and more units added it would be better, but as it is, you learn how to win, then just do that and never lose again.\n\nThere is not even a campaign mode, which I feel could have been added with little effort. Maybe 'defeat x many ai and get y unit' or something, because saving for units is a total grind. You also don't currently get more coins for defeating hard AI than you do for easy, which is kind of dumb.\n\nOnline play is non-existent, no one is ever online to play against.\n\nHelpful | 5", "Glass_breakerApr 2 at 1:32 PM\nGreat Game\n\nThis is a game that you can spend hours in. There is so much strategy, and once you have worked out your own deck that you think is killer someone elses strategy immediately pokes holes in yours. I have not found it difficult to find a match, but that being said it is not like there is always someone playing. I found that the AI is still enough to keep me entertained and help me refine my deck and my strategy.\n\nI think one way this game can really shine is if it looked into multiplayer with phones. Similar to how Acron or Recroom work. We need more games like that where we can play with our friends who dont have vr, and it would boost the amount of players in the game significantly, causing much lower wait times for matches.\n\nAlso please continue to update this game with different units and different abilities to customise them!\n\nHelpful | 22", "ZliciousJul 14 at 1:31 PM\nTotally Worth It!\n\nI've spent hundreds of hours on this game and I still keep going back for more. It is worth every penny.\n\nHelpful | 1", "JMDFJul 14 at 3:29 PM\nGreat game\n\nNice mix between card game and real time strategy. For that price a no brainer! :)\n\nHelpful | 1", "Ihrie3 days ago\nGreat game but huge flaw\n\nReally is a great game, however I had to replace my headset and after re-downloading and running on the same oculus account found out it doesnt cloud save any of your data or progress. Which is frankly ridiculous for a online centric competitive game such as this.\n\nEasily more stars if they fix that but until then Im gonna have to leave it at four, its a pretty glaring omission.\n\n*update Still no cloud save, But support will help you restore your account if you have to reset your headset (just remember your old player ID).\n\nAlso once youve unlocked everything there isnt a lot else to strive for beyond The leaderboard. Still fun though but hasnt had any meaningful updates since release.\n\nHelpful | 2", "J03K3RApr 19 at 2:37 AM\nTCG meets tower defense\n\nA perfect combination. Wonderfully animated and genuinely fun to play. I had trouble finding players to match with but even playing against the AI was fun.\n\nWould love to see persistent accounts as I lost my progress once I factory reset my quest.\n\nWould also like to see the game more populates. Perhaps releasing a mobile or regular desktop version which supports cross play with VR could help.\n\nHow about doing card packs like other TCGs which contains new units.\n\nThe Quest needs more games like this. Yeah smashing blocks and shooting stuff is fun but it's nice to just sit down and play a chilled game too.\n\nHelpful | 5", "junguyenJun 14 at 12:12 PM\nClash of clan like\n\nGood game but not enough\n\nHelpful | 0", "Incognito69Apr 25 at 6:15 AM\nI really enjoy playing\n\nI like skyworld and appreciate the cartoony medieval graphics but sometimes its hard to find a match and I often end up getting matched with the same person after in the next round, but overall a great game.\nIf you like strategic gameplay and Magic I think this is the game for you.\n\nHelpful | 2", "Trepict11 days ago\nAddictive Game!\n\nIf any of you guys love Clash Royale type games your gonna love this game! I wish I found out about this game sooner when I got my VR Headset. The price is so cheap and its worth buying! This game is easy to play as well and I got really good at it instantly! Buy the game and check it out because its worth the price!\n\nHelpful | 0", "DarkeisvoApr 9 at 2:49 AM\nGame review\n\nFirst I played this on steam and found it was such a cool game, then I bought on quest and quest version is rubbish its graphics are so bad and I have to say not even 80% of the game exists on quest version its like a pixalated phone game and yes I know it is actually a android version of the game but it's lacking everything it's boring and repetitive and for some reason I can't even get a refund.\n\nHelpful | 3", "incardoApr 7 at 1:42 PM\nClash Royale meets Yu-Gi-Oh dueling!\n\nIf you like games like Clash Royale youll love this game!\n\nYou feel like a Yu-Gi-Oh duelist with your deck on your arm and you get to place your cards on the map to summon your troops!\n\nIt also does take strategy to win you cant just randomly throw down cards. You get intense battles and will find yourself playing for hours.\n\nMy only complaints are match making does take awhile sometimes up to 15 mins and even if you dont select rematch you will often play the same people repetitively\n\nThe other issue is that it is too challenging to get sky coins to edit your avatar. There is no clear way to get them and I would prefer being able to save my coins to change my avatar as I am only level 13 and have been able to buy all the cards in the crafting section.\n\nThese complaints are overshadowed by great gameplay and a game I cant get enough really I just wanna play more games faster which will happen as the user base grows and be able to edit my avatar in an easier way.\n\nIm excited for the future of skyworld and the improvements to come!\n\nHelpful | 3", "Harcourt.MuddJun 8 at 12:19 PM\nIt should be fun but it just wastes time\n\nI was skeptical at first and waited until a sale to buy. This game is worth the full price! If you like card based games Kingdom Brawl does a great job of providing a rich in depth game experience. Only complaint is not enough players can result in being matched against players much higher than your own skill level. Maybe the developers could give the lower skill rated/level player a mana boost or something? Really sucks to wait 30 minutes for a human match only to be paired with someone twice your level- an all but guaranteed loss.\n\nPlaying the computer AI should be enjoyable but the AI gets to cast the same card twice in a row if it wants, and on the higher difficulties the AI gets way more mana than you do.\n\nThis game loses players faster than it gains new ones. This is most likely due to the poor design as outlined in this review.\n\nUpdate: I'm ranked in the 200's and keep getting matches with people in the top ten. I'm not good enough to compete with them and it makes me want to stop playing altogether. Hey Devs! Maybe addressing this would keep more players playing and it would be more fun! But you already have my money so I doubt you care. Lowering one star and deleting game. Not worth wasting my time anymore with so many fine games available to play. I wanted to love this game so bad!!!! Move on and don't waste your time and money.\n\nHelpful | 7", "Joshua_Knight27Feb 18 at 3:12 PM\nA very very fun game! But...\n\nThis game is essential clash royal but in vr and I love it!! Its soo much fun but you can barely find anyone to play with and thats bad considering its a PvP game. You can play against CPUs and choose your difficulty so it doesnt get stale but thats pretty much it. Its a fun game but theres hardly anyone ever on and if your just starting out you wont find any starting players.\n\nHelpful | 9", "TheFlacoFeb 7 at 9:34 PM\nI watched A whole movie without a match\n\nI love the game, but honestly... come on man!! I watch a whole movie without a match and thats a longgggg wait! At least let me play till I match with someone, dont let me just watch the the main Manu for an hour and half, thats a big NO!\nThere is no players at all? Maybe create a campaign or challenges so it wont be so repetitive with the AI opponent.\nMore creatures should be add it to, or some creatures should have especial abilities or something, like a +defense vs archers, or a + attack vs creatures with flying.\nGOLD... what do I do with 120,000 once I have all the creatures? I cant really spend it in anything else, let us upgrade the creatures with that gold, let us change the clothing, the color. LET US SPEND that money!\nLike I said, I love the game... but there is much more room for improvement.\n\nHelpful | 63", "luketcas11 days ago\nLeast favourite game so far.\n\nThe one positive I would have to say it's when the players are equal it is a fun game.\nNow you start off with their idea of the starter deck. You can play the easy way I. Within a short time you should be crushing them.\nYou move to the normal AI and they're throwing cards that you that you don't have.\nSo I guess they want you to just continue losing until you have the gold coins that they give you at the end of every game to buy more cards.\nI get having to grind through a game that you're not paying for. But I bought this game give me the cards.\nNow the best games I had were against other players. And a few of them we're against players my level. Those were great games.\nI got up to level six the last two times I played they threw me against a guy who is level 50.\nI'm sure it wasn't fun for either of us. I'm not going to delete the game or ask for a refund.\nI read the reviews. And I will give it another try at some point. Maybe they will make some fixes. The game has great potential.\nAnd like I said I did have some fun.\n\nHelpful | 0", "Rivaderci88May 15 at 7:21 PM\nRandomize deck\n\nAmazing game. Please add deck randomization to the next update, so that it evens playing field between friends doing friendly matches.\n\nHelpful | 0", "GabeDudeVideosApr 9 at 1:30 PM\nGood game but...\n\nI love everything about this game but I can never find a match\n\nHelpful | 1", "DelvinMCA day ago\nAdd me\n\nMy username is delvinmc#0\n\nHelpful | 0", "Lunartvr3Apr 16 at 4:55 AM\nThe tournament missing!\n\nIt's a simple, but good game. You can play with AI or with a random player. I really hate when the table switching before and after every game, it's make me dizzy. The other missing the tournaments with more difficult levels!\n\nHelpful | 0", "riccardo.biffi.91Apr 4 at 6:25 AM\nToo little players\n\nThe game seems good, but the lack of a player base makes this pvp based game worthless. Maybe you should review your business model and make it free with add-ons?\n\nHelpful | 5", "SweatSkinTTV10 days ago\nLove it!\n\nLove this game but hard to find people to play with.\n\nHelpful | 0", "MonsiniaApr 5 at 12:39 AM\nReally fun game!\n\nIm really enjoying this game, reminds me of the psychonauts level with the war game. Only problem is it needs more players. Hope you give this a try if youre reading this and Ill see you at war!\n\nHelpful | 1", "7yxsJul 12 at 3:53 PM\nThis game is like clash royal\n\nI like this game so much , you feel like a real king in this game an I recommend this game to all the people who play clash royal and the ones that likes kingdom and war games.\n\nHelpful | 0", "aaron.crouse.39Mar 16 at 11:40 AM\nI played this game on a friends vr\n\nIt takes a long time to find someone to play with. Perhaps you should make the game free so everyone can play. And offer in-game purchases. I do play a lot of virtual reality games and I wouldnt mind spending the money if the game had more people playing. This game reminds me of clash of clans and that is why I bought it. If you made that update your guaranteed to get my money :)\n\nHelpful | 1", "CobrasidFeb 4 at 6:09 PM\nGreat game\n\nAbsolutely love this game and could spend hours on it building my money to get better troops\nThe Stratergies required are immense\nWhich side to attack from\nShould you release many small troops or wait for more mana and release a hoard of dragons\nShould you use spells like fire and ice\nWould have been nice to have a campaign mode\nBut to be fair I cant fault this game hours of fun\nWELL WORTH THE MONEY ALL DAY LONG\n\nOh yeah please please please let us chat to each other by voice it would be great\n\nHelpful | 4", "dustinphillipsFeb 21 at 2:37 PM\nReally fun\n\nWould love to have more users to play against. Might be worth dropping the price to get more people. Although i believe its totally worth the price.\n\nits one of my current favorites.\n\nHelpful | 2", "jericho2005Apr 1 at 8:10 PM\nEh\n\nIt was hard to see your troops, you cant find real people to play against for an hour. Placing the stuff was hard to position, and I feel like the game shouldve been $5\n\nHelpful | 2", "rryder187Jul 23 at 6:02 AM\nAwesome game!\n\nThis game is awesome, after getting the controls down is great gameplay.\n\nHelpful | 0", "supermazinmanFeb 19 at 3:10 AM\nBrilliant game\n\nIt may be a brilliant game and the verity of Characters you can choose is amazing but you will have to wait along time to play a game with a real player but you can always do a AI match so you dont have to wait around\n\nHelpful | 0", "shaggyk9neMar 6 at 8:31 AM\nGood game...lacks content\n\nThis game is fun but gets old pretty quickly because of the lack of content. Matchmaking is also terrible. Other than that good concept and good game.\n\nHelpful | 3", "DJVader0911Apr 4 at 12:51 PM\nI wish\n\nI wish they would allow you to command your troops a little better\n\nHelpful | 1", "ImperatorNailyJan 18 at 10:08 AM\nBig fail\n\nThis Game is the biggest fail i have ever seen. First of all you cant play it at all becouse you wait 10 hours for an oponent. Then you cant give the game back, so the money is lost, you cant test it in 2 hours. the turnament funktion does not work, turnament start in 1 minute, then the minute is gone and turnament is over, there is no turnament, next turnament in xxxx days.\n\nHelpful | 13", "WawawitoJan 4 at 5:23 AM\nIncredible depth for such a low price\n\nI bought the game during the holiday sale, and it has become one of my most played games so far. This game is like a combination of Clash Royale and Clash of Clans but in VR, which works surprisingly well. There are a ton of cards and avatars to unlock too, so you can make numerous combinations and original decks. The game also has a tournament system, which I havent tried out yet but seems to be a lot of fun.\nRegarding the playerbase, the game seems to be quite active, but on less active days/hours I have noticed that the game often pairs you up with the same 1-5 people. On weekends, this is not an issue. I have no complaints about the game and am loving it thus far.\nJust a little suggestion, I think it would be great if there was a game mode with more than 2 people playing, so maybe a 2v2 team battle or even a 4 man free for all could work very well with the games mechanics.\n\nHelpful | 7", "OptionsTraderFeb 9 at 10:45 AM\nMust Play for Clash Fans\n\nThis game is AMAZING. There are a few things that the developer can take a hint from clash royale.\n\n2v2 Play and Spectator Mode. The main issue with the game is that it can take FOREVER to find a match. Adding these features might incline more people to buy it. Can't wait for more troops and powerup mods because the same few aren't that great. Overall a great addition to VR.\n\nHelpful | 0", "eddie.henderson.735Jan 6 at 8:11 PM\nWorth The Wait\n\nI was sorely dissatisfied when the game was pulled from the store approximately 1 hour prior to me purchasing it. Im a 99% offline gamer so this purchase was a big chance. Im very pleased that the game is back (and I purchased it finally). The offline AI opponents is such a fun addition. I was already a fan of Skyworld since I own it on the PSVR and it is one of my favorite VR games of all time hence, this adaptation is much welcomed.\n\nThank you to the developers and those who posted all of the positives that pushed me over the hill to make the purchase.\n\nHelpful | 17", "crimsonnightDec 2 at 5:42 AM\nNot Enough People Online\n\nWhich is a big issue for a pure PvP game. I've tried multiple different days/times, but haven't once been able to match with someone even close to my level (beginner). As the PvP relies on unlocks, it's literally impossible to win against someone a few levels higher than you in the early game making it super-frustrating.\n\nI'm guessing more players are on the Rift version, so simply making it cross-buy (and ideally cross-save) would fix this.\n\nLooks like it'll be fun once I'm able to fill my deck with unlocked cards, but it's going to be super-painful to get there ..\n\nHelpful | 62", "AnOnionDoesStuffJul 23 at 2:04 PM\nWaste of money\n\nIf I could rate negative one stars I would do that\n\nHelpful | 0", "TheRealAndrewDFeb 24 at 3:49 AM\nFun game\n\nBeing one who has never play any other part of this franchise, and new to VR this game was a great experience, fun and surprisingly addictive. And for 11.99 Cdn its a steal!\n\nHelpful | 0", "chaoswhistlerJan 3 at 5:55 AM\nA great idea lacking in execution\n\nThis is almost a great game. It's a good idea, and also the only RTS game on Quest. Standing at the edge of the huge game board across from your opponent and dropping your cards down onto the battlefield is a cool experience. The graphics aren't amazing, but they do have a distinct, clean style that is pleasant to look at and you can easily tell your units apart.\n\nUnfortunately there's not many people to play it with, and the matchmaking system makes that worse. You can click to find a match, but you just wait, and wait. A really useful addition would be if you could start an AI match while you're waiting for a multiplayer one so you don't have to just do nothing while you wait.\n\nIt could also use a single player campaign to introduce you to the different units and start you off slow, like the way StarCraft or most other RTS games do. After a few games still don't have much idea which units counter which, or which units I should craft. Some kind of story would be nice, in the absence of much of a multiplayer scene.\n\nSpeaking of crafting, I can't get it to happen at all, meaning I can't add any new units to my deck. It's either a bug or a UI failure. Here's a video of me trying to get it to work, in case the developers see this: https://vimeo.com/382592426\n\nHelpful | 5", "CJFireJan 28 at 12:10 AM\nAwesome\n\nI love sitting down to this game, I'm still not overly good yet, just trying to buy better weapons etc. But love it, I love watching the soldiers battle it out. I'm hoping for a chess version of this.... That would be wicked.\n\nHelpful | 7", "VIN7ERMay 3 at 9:30 AM\nVery good\n\nBut I cant figure out how to play competitive to get those blue coins. Do I have to wait for another tournament to start?\nthere should always be the possibility to get these coins ...\naside from that its a very good game. I can play with my friends and they also love it.\nHope theres more to come in the future\n\nHelpful | 0", "AwesomeIan24Apr 9 at 3:39 PM\nThis games is great\n\nThis game is wonderful its really easy to understand but there is a few things I dont like.\n\n1. The waiting time for a match its not terrible but it does take a minute or two\n\n2. How easy it is to get coins. After a week you could unlock all the cards and in my opinion it should take longer\n\n3. There are only so many cards and its to easy to get them\n\nAll in all this game is definitely worth the money\n\nHelpful | 0", "XD3SIGNMay 12 at 12:52 PM\nGreat game just lacking content\n\nThis game has some real potential once more cards and battlefields are added itherwiseba very fun game i look forward to updates :)\n\nHelpful | 0", "ommmmmnDec 20 at 12:57 PM\nNot a lot of gameplay available\n\nHonestly the game has potential but too few players and too few options makes this one lose out. Maybe add something to play it do while waiting for a match? The game is fun in the action but it doesn't feel like there is enough thought put into the strategy and units for it to truly be a good game. If there was a tower defence mode, just something more for the money it would feel better. Maybe if enough players end up playing the game it can develop but now I don't get enough joy out of the game to be able to recommend it. If you like me are thirsty for a strategy multiplayer title, this is not it. Still I am comfortable back to it which does say something.\n\nHelpful | 6", "XCGod8256Jun 24 at 7:08 PM\nMeh\n\nIts just ok\n\nHelpful | 0", "runnow89701Jan 18 at 11:18 AM\nLame sause\n\nPlayed for 20 minutes on fist day and now they will not give me a refund dont trust this developer! This seems to happen a lot with Oculus quest! Fix this problem Facebook!!!\n\nHelpful | 6", "Lord_Verinian_22Dec 16 at 10:18 AM\nControls are a bit wonky\n\nThe overall game is super fun and the idea of a VR Clash Royale card game is super awesome but the controls can be a little bit crazy most of the time when your trying to place your troops its hard to place them where you want them to go and the texts that describe the troops is a bit small to read but other than that Ive had no other issues.\n\nHelpful | 1", "Sir_Slaught3rMar 22 at 2:18 PM\nFun game - needs more content\n\nI enjoy this game, but feel there needs to be more content. You are not able to upgrade your cards, only unlock new ones. The matchmaking system can take up to 5-10 minutes to find another person to play against, which is tiresome. Would be nice if the AI gave you more rewards for beating higher difficulties. Good concept - will keep this game in my inventory, but could be much better with a few tweaks.\n\nHelpful | 0", "Justin1111089Feb 19 at 7:02 PM\nAwesome game\n\nReally fun and your should play it with your friends.\n\nHelpful | 0", "DuncanPeckApr 8 at 2:47 PM\nStrategize, plan, execute...\n\nOk so I watched the video trailer, umming and arring if it would be a game I'd play. Having bought it (thanks oculus/Facebook for the free $10 credit!) I bagged myself a bargain.\n\nI have to say this game is really up there as one of my favourites. It's strategic, it's fast paced, it's fun!\n\nI've been pretty glued to it since I acquired it. Although I tend to play fairly randomly with my choises at the moment, I feel I'm starting to to tinker with various strategic ideas.\n\nThere's lots for me to unlock still. I find it a very refreshing experience and it really showcases what a real time strategy game is like in a VR universe.\n\nThanks to the developers for making this game, no game lasts forever, but I'm sure I'll get many more hours of fun playing this game.\n\nThanks oculus for making the most amazing headset on the general consumer market today and thanks to the developers who spend many sleepless nights creating these wonderful experiences which we can play.\n\nI hope that long may it continue!!!\n\nHelpful | 0", "leastbadJan 5 at 10:06 PM\nBrutal long queues\n\nI want to love this game, but 10+ minute queue times between matches means I spend most of my game time watching your lobby never change. Why do I have to play the same guy 15x in a row when I can plainly see others advancing on the leaderboard? Even preventing the same matchup consecutively would be a huge improvement.\n\nHelpful | 1", "Caine3000Feb 14 at 12:48 PM\nGreat game\n\nDidnt think it would be so much fun.\n\nHelpful | 1", "PreclolDec 3 at 9:51 AM\nVery fun\n\nLots of cards. Lots of fun. Love the different environments. Just wish the text was a bit bigger. Definitely more to it than a standard tug-of-war card game. Powering up cards isnt pay to win. So there is decent customization without making it an endless grind. Does take a while to unlock some cards, but its just gold so you can choose what you want to get.\n\nHelpful | 0", "Pan_ZychJan 15 at 3:23 AM\nGreat game both single and multi player\n\nGame has some bad interface designs but besides that it's very good.\n\nHelpful | 1", "PurplemikeySep 5, 2019 at 7:55 PM\nFun game with a lot of depth\n\nI'd like to start by making it clear that this game had a bumpy start because of a bug. But I tried to look beyond this hug and ignore it since it is temporary (probably already fixed when you'll be reading that).\n\nThis game is one of a kind. Nothing compares to it on the Quest. The visuals are simple but gorgeous, the game itself have a lot of depth for dek creation, strategy, lots of options to counter, react, attack, try to turn the game your way... It's a game that you will need to play a lot to master but a simple round here and there will also be fun.\n\nGreat game. I will revisit my review later once the game is out and patched. Meanwhile - I'm going back in to unlock more units.\n\nHelpful | 43\nDeveloper ResponseSep 12, 2019 at 10:27 AM\n\nGlad you are enjoying the game. The bug you mention has been fixed, so it should be much easier to find PvP matches", "BLZDPraetorianNov 26 at 7:40 PM\nI want more! MINION MASTER!\n\nThis game is great! Its taken the rts title but only because there is not any others. This game is 3 lane card game, where your cards come to life and kill in your name! Watching them clash is cool to see but i want more! They have a good selection of cards but could have more to deepen the strategy. They have few maps, and its only 1v1. They still get 4 stars from me because this game is great, replay value is good. Multiplayer is a bit dead. You fight people close to your level, i had to factory reset so im now level 11, fighting mostly bots. Getting matched with a person is rare. I wish they had more! Il leave this last thought, that i hope skyworld 2 comes out, or this one is added to. I do like this game a lot! But it mostly has me yearning for more. Thanks to the devs for what we do have! And i hope to see a game similar to the grand card game MINION MASTERS. future is bright =)\n\nHelpful | 1", "GoldenHusky263Apr 1 at 9:19 PM\nAdd more but it gucci\n\nI love the game but Im trash but I think you should be allowed to be a charecter and go in the fight as a knight or in a large group an even make a tutorial for it\n\nHelpful | 0", "OmnicoreincFeb 9 at 10:47 AM\nExcellent graphics\n\nWould live a 2v2 game mode!\n\nHelpful | 0", "dblountJan 1 at 4:53 PM\nFun game\n\nOnly reason it's four star is the lack of people playing which has nothing to do with the game its self.\n\nHelpful | 0", "stijn.zaalbergDec 4 at 2:30 PM\nLike it, but small struggle\n\nI like the game so far. But it needs some adaptions. The placing of the cards is somewhat buggy sometimes and it could be me but I could not find a way to buy the cards.. I want the dragon and I'm dragging it to the right but nothing is happening. Further on you have kept it simple and clean and it looks cartoon-fun like. Some bug fixes will make this rating a 5 star! Can't wait for my brother to return from his holiday so I can ruin his Sunday!\n\n4th of December 2019:\nCurrently sometimes I still play this. But due the lack of diversity it gets repetitive. If the unlockable a would be easier to unlock I'd give it a chance.. but the new characters are pretty insane hard to get. You guys did a great job making a good simple RTS, the graphics are cool as well. But the repetitiveness kills it for me unfortunately. I have not ideas further of how to improve.. good luck!\n\nHelpful | 2\nDeveloper ResponseDec 5 at 3:03 AM\n\nHi, thanks for your review. Do you still have problems with buying cards? If so, could you send a support ticket on http://vertigo-games.com/contact/. Thanks!", "zack.slotkowskiJan 19 at 1:32 PM\nSo far so good!\n\nHave played for 1 hour and I love how it is not easy to gather coins. I keep coming back to playing this game and love it.\n\nHelpful | 0", "faraduckFeb 2 at 7:37 PM\n\nFun to play\n\nHelpful | 0", "Lazer241Dec 31 at 9:50 AM\nFun strategy game\n\nIts a fun strategy game and cool to see all the units in 3-D\n\nHelpful | 1", "DaxninjaDec 28 at 5:07 PM\nMultiplayer\n\nTrying to find people is hard but overall great game\n\nHelpful | 2", "RaKooNCiTyDec 7 at 4:19 AM\nThe Clash Royal / Hearthstone like game\n\nGame runs smooth, fast paced, and fun! Tutorial doesnt show you much but if youve played Clash Royal or Hearthstone than learning to play wont be a problem at all. Matchmaking is pretty slow especially the first games as there isnt many people playing the game yet. It does pick up though but most of the time youll be going up against a way higher lvl player and once you see that youll know defeat is in your hands. The game is great nonetheless and playing with friends is a blast. TIME is what the game needs to start getting better and Ill be looking forward for the great things to come.\n\nHelpful | 2", "UntoldSlaughtaSep 7, 2019 at 9:13 AM\nOutstanding strategy game for VR\n\nI was never into these types of games but bruh this has me addicted I do hope it gets fixed with the draws also implement something for when people force close out of anger when they're losing I'd like to still get my gold and experience when somone rage quits and leaves it would be great to have various maps and some way to get shards rather than just tourneys I'd gladly buy them if I could I look forward to updates to fix the glitches and the language that the tutorial is in other than that this game is epic ad only for 10 dollars easily worth more can't wait to play competitively\n\nHelpful | 70", "PlayerNoneSep 30 at 5:45 PM\nKingdom Brawl is VR Genius!\n\nSo remember that scene in Star Wars where Han Solo advises C3PO to let the Wookie win during a game where monsters come alive on a round board? Kingdom Brawl brings that idea to life and takes it to the next level through the magic of VR.\n\nIve never been attracted to battle card games in real life, but in VR, the gameplay is addictive. Out of all the Quest titles Ive enjoyeda significant numberKingdom Brawl is the one that Ive spent the most time playing.\n\nWhy? Kingdom Brawl has the most cerebral VR gameplay. You choose 8 cards from a huge assortment to enter a battle with. Selecting the right mix of characteristics is a challenge. If your deck spawns too slowly, your opponent will overwhelm you with speed. Come too quick and you wont be able to stop the heavy-hitting pieces. Add in the mix of air, land, range, damage, and magicand the possibilities become endless. Well done, developers!\n\nThe game mechanics are flawless and fun. As you strategically fling your cards into position on the battlefield, they come to life as you battle opponents.\n\nYes, you'll get creamed when you first enter PvP matches. Spend some time testing strategies against the AI. But, soon youll develop your own strategies with your favorite cards. Theres endless variety in this game because each person plays with different styles. Ive seen some creative ones.\n\nThe tournaments are a blast because each competition challenges you to use a specific character card in your deck. Just changing one card will force good players to rethink their entire hand.\n\nI recently finished 2nd and 1st in two tournaments I participated in (mission sniper and freeze). Note to the developers. Shorten the tournament times! I can give you a day, but I cant give you a whole weekend. I enjoy an opportunity to battle the most skilled players. I suspect more will keep coming back if the tournament time window were more condensed.\n\nThis game is brilliant. See you brawling in the sky.\n\nHelpful | 11", "ILLUMISNIPERNov 17 at 3:58 PM\nOne of the best VR games\n\nThe premise of the game is essentially clash royale in VR. It is executed extremely well. The gameplay is fast paced and fun. The cards are mostly balanced. I have participated in battles that turned around from being one fireball away from winning to losing. This is a skill based game the moment you start. There is no coddling. You will not win the first time you play. You start at 1500 ranks and have to go down until you have figured the game out.\nYou can play this while sitting down, though you might not be able to see everything. I play this while in bed.\nThe gameplay is the best part. The currency is fair. However, the game seems slightly unfinished. This, by no means, detracts from my enjoyment. Examples include cards that are blatant upgrades of other cards, either the same descriptions and everything.\nThe graphics look nice but are a bit blurry. This might be a me problem, but other games work fine. You dont notice it unless you pay attention to it. It shouldnt bother you much.\nGameplay - 5/5\nMechanics - 5/5\nGraphics - 4/5\nComfort - 5/5\nFinishing - 4/5\nOverall - 5/5\nSuggestions:\nCard upgrading. Right now its buy and get\nBeing able to compare things you want to buy with cards you already have. Right now you switch backs and forth\n\nHelpful | 4", "KloppisKoolNov 16 at 11:10 PM\nVrs version of Clash Royale\n\nFor $10 this game is a steal! Its Great fun, easy to use and so interactive. Normally I like games where you jump around and get moving but this game is an exception to that. Im still figuring out what card counters which card but I still absolutely love this game. There are people to play online most of the time and AIs can get really challenging. Well done to the creators, it was faultless!\n\nHelpful | 0", "alenonJan 9 at 12:13 PM\nExtremely fun game\n\nVery much liked\n\nHelpful | 1", "lairdapopkinOct 17 at 12:36 PM\nGreat game, terrible networking\n\nThe game is great fun, with some big problems:\n\n1) it constantly loses network connection and exits out of the combat.\n2) the player matches dont match me with comparable players, so I lose horribly every time because they have powerful units I dont have yet. Fighting AI I am fine, on the easier settings. If I got matched with other beginning players, it would be more fun.\n3) You cant pick between AI and player matches, you just start a match and it turns out to be a player or AI. Given (2) this is frustrating.\n\nHelpful | 5\nDeveloper ResponseOct 18 at 1:58 AM\n\nHi lairdapopkin, thanks for your review. Points (2) and (3) are fixed in the upcoming patch, which will come out soon. Network connection is specific to the Oculus Quest device. Try to play in an area with a strong WiFi connection.", "squiddy5Nov 3 at 7:23 PM\nGood game\n\nLike the game its like clash royal.\n\nThe nodes cause some death spiraling and there arent many rank I know of, but other than that its great.\n\nAlso food club if you read this I declare you my rival\n\nMaybe add voice chat\n\nHelpful | 1", "Le0n666Dec 27 at 1:51 PM\nGreat game.\n\nPvP online battles are great fun, but there aren't enough matches available. Otherwise 5 stars. No way to backup your progress, so have to start over after a factory reset.\n\nHelpful | 3", "przedimekOct 4 at 9:48 AM\nRecommended\n\nIt is a fast-paced strategy game where individual battles usually last no more (and often less) time than five minutes. The rather simplistic graphics and similar audio suit the game well, because the player is entirely pre-occupied with what is going on in the battlefield.\nHowever, the tutorial is insufficient and the impossibility to play against AI when online players are available resulted in my losing every initial brawl because I didn't understand the game's paper/rock/scissors mechanics. Playing against AI should be available. Additionally, I'd welcome being able to switch between, say, four deck designs.\nStill, no other game gave me that much fun when playing with friends.\n\nHelpful | 8", "lordofdoom97Oct 15 at 4:09 PM\nGreat game!!...but\n\nI really enjoy this game its a type of game ive been wanting to play ever since i got into card games as a kid. The only thing that bugs me from time to time is sometimes when i go to play against an ai it lunches a match befor i can hit ai match. Just wish there was a better way to choose. Other than that its a must buy for any top-down card game fan\n\nHelpful | 1\nDeveloper ResponseOct 16 at 5:37 AM\n\nThanks for your review! The next patch will include an option to play against AI from the deck menu.", "PGDVenomMar 17 at 2:32 PM\nGreat\n\nGreat game. Finding a match only takes a minute. Would appreciate some higher quality models and a little more depth but otherwise great\n\nHelpful | 0", "NexxTechOct 3 at 2:35 PM\n#1 Ranked Player Review\n\nI've enjoyed this game very much climbing my way to the top. Currently Rank 1 on the Global Leaderboard.\n\nGame is great and is my most played VR game for sure.\nLots of Pros not too many cons *( most of these cons are just a factor of a new game, and will be resolved with more cards, maps, and possibly additional markers or new mixes -cost 1 less to spawn etc.)\nFor now I'm pretty addicted and have 2 request I'd love to see in the game.\n#1 Voice chat in games so we can talk or mute, this is a must as for now it's so quiet.\n#2 The original tournament from VRL was WAY too soon and should have been held off to promote the quest and bring players in.\nIn addition to this you have a great game that is enjoyable but without any competition it doesnt allow for more gameplay.\nSee you on the battlefield, goodluck! - Northernhosp\n\nHelpful | 16", "BuddyweiserNov 17 at 11:34 PM\nHaving fund with this one!\n\nGreat value and replay .. been having fun.. kinda wish I would have bought sooner rather than later.. especially for the cost. Id love to see something more happen with this one as their is lots of potential.\n\nHelpful | 1", "ZoobleyOct 8 at 2:31 PM\nGreat game\n\nThis is a really good game. Basically takes the best part of rts games (the battling) and utilizes that as the sole game mechanic. I like unlocking new cards and building a deck is fun. Plus its nice the matches dont drag on (especially if you are a newbie).\nI deducted 1 star as I wish there was a bit more depth to the maps, meaning more varying map types and topography comes more into play strategy wise ( a hill give more attack vs a valley etc). This is a recommended buy from me.\n\nHelpful | 0", "ManBoyMonkeyMilkNov 6 at 12:53 PM\nGreat Game!\n\nThe game is very fun and as far as Ive played every unit has a counter. I hope that there will be more units in the future!\n\nHelpful | 1\nDeveloper ResponseNov 7 at 1:49 AM\n\nThanks for your review! There will indeed be new units (and maps). The first batch will be coming in the next content update!", "WineSteinSep 25, 2019 at 12:06 AM\nArguably one of my favorite games\n\nSky world is a blast to play and allows one to progress through the ranks pretty easily. Its fun, has some strategy to it, allows offline play, has numerous cards, and lots of maps.\n\nMy only complaints are the matchmaking and lack of bigger/longer matches. Matchmaking seems to pair me with the same person over and over again. This can make things relatively unfair and repetitive. I also wish the devs would add a coop mode. Would be a nice addition.\n\nFor $10, I think the content is more than fair. However, an improvement would be the inclusion of larger maps, say twice to three times as big, with different corridors (everything is a standard 3 corridor setup).\n\nOverall, I highly recommend.\n\nHelpful | 3", "Guidance777Nov 2 at 8:21 PM\nBring on the competition! A+++\n\nWas looking for a strategy game I could play while relaxing and found this epic battle game. Great concept for a game, very well thought out and the AI makes for great practice before playing competitively. A+++\n\nHelpful | 1", "JucumaSep 5, 2019 at 12:10 PM\nThis game is not ready yet\n\nThis game doesnt work how it is supposed to be. Some of the tutorial is written in Loren ipsum. The tutorial teaches you next to nothing about the game. Each match is supposed to be minutes long but every match glitches and ends in a draw after 45 seconds.\nTHIS GAME IS NOT READY TO BE RELEASED\n\nHelpful | 33\nDeveloper ResponseSep 12, 2019 at 9:17 AM\n\nThank you for your support of Skyworld: Kingdom Brawl. The issues that you mention here have been addressed in our updated build. Please jump in for a new battle.", "PersianMagicNov 29 at 7:24 PM\nAwesome\n\nLove the game, only issue I had is now working. Great game. Recommend 100%\n\nHelpful | 0\nDeveloper ResponseNov 29 at 3:05 AM\n\nHi, thanks for your review! Could you submit a support ticket at http://vertigo-games.com/contact? Thanks!", "juggie304Nov 26 at 2:51 PM\n\nGreat game fun to play but needs more cards im sure more will be added soon though\n\nHelpful | 0", "JohSm67Sep 24, 2019 at 1:21 PM\nNow it Rocks, After Update\n\nIt had some big issues when it was released on the Quest, but now multiplayer works fine!\nFun game that needs some training to master, graphics could be more polished for the Quest! Would be fun if you could watch others playing! Maybe something for the devs to work on.\nAs I love multiplayer games, I do recommend it!\n\nHelpful | 0", "RodingpovSep 12, 2019 at 9:24 AM\nThis is on another lvl, clash royal who?\n\nReally hyped to get this game.\nA slow start has led to magnificent regular on the quest for me, tired from a days work this is my armchair game, for 5 minutes, until I'm standing tring to pinpoint place a fireball as if my life depended on it.\n\nThe graphics serve a purpose and the gameplay is smooth, matchmaking is always gonna be tough early doors but seems to be getting better day by day\n\nIf the campaign mode is coming then this will be a definite recommend to my quest friends and my rating will change to 5*\n\nHelpful | 6", "SyberneticSep 5, 2019 at 1:54 PM\nfun+potential to be top game on quest\n\nGames needs a big update though to fix multiplayer because it keeps ending matches early. Also the tutorial is in some weird mumble language.\nLast thing is that the crafting doesnt seem to work, that or it isnt clear enough how to do it.\n\nThank you for this game though its dope! A few fixes and itd be perfect-for $9.99 too!\n\nHelpful | 9", "NPV2Sep 15, 2019 at 1:31 PM\nVery fun,just excited for whats to come\n\nIts very fun I really like the competitive nature of it and the customization you have to play with and figure out by yourself. I really want a 2v2 kinda gamemode that would include fun game chat with randoms and improve teams with friendships and see how high up the ladder you could get, cant wait to see more!!\n\nHelpful | 2", "BwadejsOct 15 at 9:29 AM\nGreat idea. Needs more players\n\nFrom the day I've got my quest I could workout why there's no magic or yu gi oh game. They even have xbox versions. This however is similar, albeit smaller. I enjoy the gameplay. Fun idea and you can play for quite a while... Although really it's an online only game and I can't ever seem to find a match. You can play the ai but you get minimal rewards. But you need rewards to get better cards or when you do find someone online they will obliterate you. Then you'll search and get paired with the same player again and again with no hope of winning. Maybe I got the game too late to play everyone online and they're all bored now? Big shame as it does ruin the game that no one is online.\n\nHelpful | 1", "SteelPandabearSep 20, 2019 at 9:54 PM\nGood but lacks balance\n\nA lot of the dark versions of the light cards are worse for some reason for example the snipers are the same in every way but the light one is better. And the spells aren't too great and the ice dudes do way to much damage to buildings. Everything else is great\n\nHelpful | 2", "SQU1NXXOct 2 at 8:27 PM\nFantastic RTS Game for VR\n\nJust brought this game and the Quest was literally glued to my face, only stopped playing to let it charge but oh man this is a MUST-BUY for anyone. Its simple and after a few matches you understand whats going on. Great game, look forward to whatever else they have planned for future updates :)\n\nHelpful | 2", "sstretchhOct 20 at 7:59 AM\nLove this game !\n\nThe concept of this game is great ! Really enjoy playing\n\nOne thing that would make this game better is when crafting cards if you could see the stats of your current Deck with out moving back and forth , super annoying\n\nHelpful | 1", "HERO128Sep 13, 2019 at 6:57 PM\nGood game but\n\nThis is a great game I love it yes it does need more characters. but overall it is good there just one thing that make me sad. this game does not use the 360 at all you just stand still I wish you could move around and see the characters fight but you cant you just stand still but overall good game 7/10\n\nHelpful | 1", "danielbloomSep 19, 2019 at 11:10 AM\nGreat RTS with card game elements\n\nThis game started with a buggy release and had some issues that made it unplayable. Since they pulled the game and fixed the issues, its now very stable. Matches take less than 15 seconds to get matched from the menu. There is deceptively a lot of depth to the game too. At first I wasnt doing too well and I thought you just threw down enemies as fast as possible. Now after learning more and refining my deck I havent lost over 10 consecutive matches. I hope that more people learn to play so it gets more challenging but its new so I understand that.\n\nThis said Id like to see some improvements in certain areas.\n\nAt the moment you cant communicate to your opponent. You cant easily add friends either. Youll have to know people in RL and get their name tag before you can add friends in VR. Id also like a second to talk to my opponent after a match before exiting as well. Then you could at least say gg and if you had questions ask them so you can improve or say good job doing blah howd you do that?\n\nYou cant save decks. I have some ideas for other decks but dont really want to make them because I like my current one. Dont want to erase it and make it again.\n\nThere needs to be more detail about game mechanics. The targets on the floor are important to understand, when you destroy towers your spawn distance increases, and listed unit counters would be useful too. Even adding details on their website could be extremely useful but there is no info there either.\n\nOther than this, i dont think the game will continue to gain popularity if the devs dont add more cards and update the game consistently. All card based games, regardless of this having RTS influences, rely on having new items, abilities, and units.\n\nIf this game continues to get support, I think the game is amazing if you take the time to learn it. At this current build the game is 5/5. Id love to learn more about what the devs have planned for the future with this one.\n\nHelpful | 8", "Aracnareaper007Sep 29, 2019 at 4:44 PM\nFun RTS\n\nThis is a fun RTS game. You play with a deck of cards and your troops will push towards the enemy base and engage any enemys they run into. Requires a lot of thinking and planing ahead. Playing agains AI is actually a challenge. At least for someone of my skill level in this game currently.\n\nHelpful | 3", "UltraParadigmNov 26 at 7:27 PM\nNice game, questionable choices\n\nPlease Google \"grand wizard\" and then consider renaming that avatar.\n\nHelpful | 3", "DiamondDutySep 13, 2019 at 2:04 AM\nQuite enjoyable. Recommended.\n\nThis game is pretty good, It has a real Clash Royale feel to it.\n\nOnly critique would be the awkwardness of twisting your wrist to get their pathing arc just right. I wish they would utilize the joysticks or make the motion less clumsy.\n\nOther than that, the game is very enjoyable.\n\nHelpful | 2", "OrdinaryWorldSep 14, 2019 at 2:15 PM\nA different kind of game\n\nI wasn't really sure what this game was, and perhaps it was fortunate that I didn't purchase at first release. When I saw it return to the store for $10, it seemed like a no-brainer. Really glad I tried this out. It's a fun game and completely different to anything else I own or have played before. I'm not sure how to describe it! It's almost like a simplified Command and Conquer or Age of Empires on a smaller field of play and without having to worry about resources. Playing against AI is good to learn the game but playing against other Questers keeps it real and varied. I also love that I can play while sitting without any detriment to the game play. A bargain for the price! I really hope some of the early reviewers of the bugged release revisit the game and update their reviews to reflect the fixed gameplay. After many hours of fun I just upped my rating from 4 to 5 stars!\n\nHelpful | 10", "BlazerDuckSep 18, 2019 at 10:31 PM\nGreat game for the price!\n\nI thought this game looked interesting, but I was hesitant to buy it after the initial issues. I am sure glad I did. I have been impressed with how many matches Ive been able to make PvP. There is no microphone in the game, so thats odd, but it is still fun. There is no single amazing thing about this game, but it does everything good enough that it is still really enjoyable. I could see myself playing this game a ton over a long course of time. Also, you earn everything, so you dont just get smashed by people who just buy everything you can in a game. For $10, I dont know how you can pass on this game if you like these types of games.\n\nHelpful | 5", "PinusSpSep 19, 2019 at 5:17 AM\nBiggest surprise so far!\n\nPicked this game up, as I wanted something easily playable sitting-down. Ive never cared much for RTS games, but this one is just so unique that I was instantly hooked. The game plays very intuitively and you can pick it up in minutes. Theres a decent amount of strategy involved already, but I really do hope that the developers keep working on adding more content, since the options seem close to limitless!\n\nTiny update: the Match! button should really lead you to two options - play vs. AI or search for opponents. Its a bit annoying trying to show the game to someone and they instantly get matched with another player.\n\nHelpful | 5\nDeveloper ResponseSep 19, 2019 at 5:08 AM\n\nAn option to test your deck against AI without forcing you to get in the matchmaking queue will be added in the next patch!", "Slam_MakanenOct 4 at 3:06 PM\nHas Potential\n\nOverall the game is lots of fun, but only in the right conditions. As many have said, the matchmaking is terrible and whatever recent update hasn't fixed it or there was only one other player in the world playing tonight. Oh, and as a level 2 against a level 10 I stood no chance. He'd unleash a couple of units that just bulldozed through my army and destroy my base.\n\nThe A.I is way overpowered. The 'easy' setting pits you against a level 20 with results similar to my aforementioned online one. No chance. You'll only be able to play on 'very easy' against a level 10 A.I.\n\nIn the crafting screen it's almost impossible to read the card descriptions. You have to keep moving your head to get the text to display in any readable way - it's weird.\n\nHelpful | 1\nDeveloper ResponseOct 15 at 5:11 AM\n\nHi, thanks for your review. Its possible to get matched against someone with a higher skill rating than you if there were no other players in the queue at that moment. Keep in mind that level is only an indication of amount of time played, not the actual skill rating of the player. AI levels are also artificial and only have a visual purpose. However, matchmaking for low level players (who just started playing and don't have that many cards yet) will be improved in the next patch!", "duckonentrySep 23, 2019 at 10:54 PM\nDam Good Stategy\n\nThis is the first game to really hook me after getting the Quest. The controls take a second to get used in terms of angling the units for optimal pathing but are otherwise quick and responsive. The gameplay is fun and the deck building is deep enough to keep me from getting bored. PvP games are a blast and its an easy recommendation for $10.\n\nHelpful | 1", "VRobbOct 21 at 12:05 PM\nLove this game\n\nIve played this game so much since getting it a couple weeks ago. Lots of fun building a deck and developing strategies. A definite must buy!\n\nHelpful | 3", "Azazel08Sep 13, 2019 at 10:16 AM\nJust one more round...\n\nVery addictive and a ton of fun. Easy to learn hard to master type game. I have been demolished a couple times by experienced players, but even that is fun in this game.\n\nHelpful | 6", "Richie5730Sep 13, 2019 at 4:06 AM\n\nLove this game, fun and interesting. Its a little annoying that you have to wait days for each tournament! I keep missing them . A larger selection of cars to craft would be nice. A war hammer themed version of this would be sick.\n\nHelpful | 2", "SKThunderSep 6, 2019 at 6:39 AM\nI want to love it, but it doesnt work\n\nThe one full match I managed to have in this game was a blast. After trying for almost an hour to get a second match that didnt end in a draw before it even started, Im close to giving up. This game has so much potential to be great, but as of right now the Quest version doesnt work.\n\nHelpful | 6\nDeveloper ResponseSep 12, 2019 at 9:15 AM\n\nThank you for your support of Skyworld: Kingdom Brawl. The issues that you mention here have been addressed in our updated build. Please jump in for a new battle.", "Philly267Oct 10 at 6:04 PM\nI like it but I wish it had campaign mod\n\nI like the game very much love to see the characters come to life but I would love it if it had the campaign mode like the other headsets i would like to move the pieces on the board but still a good game but I would like that turn style gameplay\n\nHelpful | 1", "Ozzyboi35Sep 24, 2019 at 3:22 PM\nWow\n\nWas not sure what to expect, wow to be fair this has been well thought out and a very good game, bought it tonight and spent about 5 hours on it.\n\nLooking forward to seeing new troops and what they can do.\n\nVery tactical lots to think about, the timing of each game is spot on.\n\nHelpful | 1", "Derek6SSep 15, 2019 at 1:56 AM\nIt is a playable game\n\nI think this game can play very long time since it is a great fun when fight to other people rather than computer. Here is some suggestion to this game:\n1. Deck Volume is too little, only ten cards allow in a set. Card is not enough to make the battle more diversification\n2. Add some communication function rather than just do some body language\n3. Add more game mode such as 2 Vs 2 and melee\n4. Add some simple command that after release the card to the field, player can control and change it, such as go ahead, stay and backwards\n\nHelpful | 4", "Rusty_bikeSep 15, 2019 at 5:23 AM\nAn amazing head scratching game\n\nThis game is absolutely amazing, if youve ever played a PvP fantasy card game (e.g. magic of the gathering ect) then this is a must have game. The gameplay is amazing and watching the battle play out, and thinking about what the next play should be,it is a extremely immersive experience.\nI would recommend this game to anyone with a interest in fantasy and table top card games.\n\nHelpful | 3", "Paine2236Sep 12, 2019 at 1:04 PM\nFun and easy\n\nA easy and fun game if nobody can be found you can pick a difficulty and go against a AI yea there was problems on launch but that's fixed now.\nA little side bonus to the Devs they were actually really nice enough to give a few of us codes for the game after the mishap on launch. Thanks devs\n\nHelpful | 5", "Tyrone-a-saurusNov 1 at 7:30 PM\nMeh. It was fun to play for a while...\n\n...but I got bored of it quickly I wish I returned it. Save your money so you can buy something better\n\nHelpful | 2", "MCRN-RyanOct 7 at 7:11 PM\nThis is my go-to game now.\n\nThis is the only really solid strategy game for Quest. The small number of cards and modifiers hide a deceptively deep strategy experience. And the ELO system seems better than most mobile games.\n\nHelpful | 0", "anthonshSep 17, 2019 at 9:03 PM\nUnbalanced Combat Ruins Game\n\nThe game only lets you play solo if an online match isn't available and there are certain strategies and units that must be used to be competitive. Some will enjoy but most will get their butt kicked and stop playing.\n\nHelpful | 6", "wh0empahSep 15, 2019 at 12:12 AM\n\nGame works very well now, online matchmaking when testing in the weekend was very fast. Would be nice if we could micro units after they have been placed on the field.\n\nWill be playing a lot more :-)\n\nHelpful | 1", "Emanuel20Sep 14, 2019 at 5:55 AM\nGreat strategy game\n\nThese strategy types of games are what I love playing. So much fun. It's all about the strategy and using the right type of army to beat your opponent. And it is very affordable. I would have paid more for this game, but I'll take it for $10.\n\nHelpful | 6", "jimmyjam5000Sep 22, 2019 at 4:56 PM\n\nThe game looks great. The card mechanics make sense and multiplayer only adds to the fun. Definitely worth the money.\n\nHowever, I wish I had more control over the type of game want to play. Its difficult to select between an AI match an an online match. You have to choose AI before youre matched with an online player and that could be no time at all. Also, the online matches dont feel ranked. I feel like Im always battling someone super more advanced than me. Wish theyd fix that. Otherwise really fun.\n\nHelpful | 0", "BrocktogonSep 15, 2019 at 8:43 PM\nThis was needed on Quest\n\nAs a fan of Clash, this really scratches that itch. It is really fun to build new decks and be able to fully watch the battle in VR as skirmishes happen all over the board. The depth and strategy in the game was surprising. Also, very active multiplayer.\n\nHelpful | 3", "Al2988Oct 15 at 3:15 PM\nExcellent\n\nI personally think one of the best games on the quest. For weeks this has been the only one I play.\nHowever needs more maps!\n\nHelpful | 1\nDeveloper ResponseOct 16 at 5:40 AM\n\nThanks for your review! More maps, units and features are planned!", "schuhbox20Sep 19, 2019 at 9:11 AM\nClash of Clans meets Wizards Chess\n\nWhat a fun game. If you've ever played a stamina-based tabletop combat game, this is absolutely for you. $10. No in app purchases. Complex and engaging meta. Quick and stable matchmaking. What more could you ask for?\n\nHelpful | 5", "Poppop1971Sep 25, 2019 at 5:44 PM\nFun quick games\n\nI wasnt sure I would like this kind of game. Its very enjoyable and runs great. I found myself thinking just one more game and realizing I said that many games ago. Matches are quick, entertaining, and easy to jump into.\n\nHelpful | 1", "space1213Sep 18, 2019 at 5:34 AM\nBalancing problems.\n\nI really wanted to like this, but when you get matched with someone several levels above you and get destroyed in under a minute because you get matched with someone who has been playing longer and you don't have anything to counter it kinda ruins the fun. Could be fixed if you were matched with someone near your level, but that is simply not the case.\n\nHelpful | 3\nDeveloper ResponseSep 19, 2019 at 5:18 AM\n\nHi space1213. The game tries to match you against people with similar skill rating. If there are none available at the time it will increase the skill rating range to find other players in the queue. So there is a possibility that you will be matched against players of higher or lower skill rating. This is the tradeoff we choose to ensure that you get to play against somebody without having to wait for a long period of time.", "MassDeathRayOct 8 at 5:59 PM\nClash Royale on Steroids in VR\n\nThis game has replaced my Clash Royale addiction. Utterly amazing. This is as good as it gets. Best tower defense card game ever! I kid you not.\n\nHelpful | 0", "gemini1976Sep 18, 2019 at 1:35 AM\nGood strategy game\n\nWould be 5 stars if support fot left hand and slight problem with units on side not always able to direct properly doesnt ruin game though still fun\n\nHelpful | 1", "SloppyJoesSep 12, 2019 at 12:18 PM\nFun game\n\nThanks for working out the bugs.... this game if fun and interactive. Will there be an chat with your opponent option and maybe a option to battle someone with a similar ranking in the future? Still a great game!\n\nHelpful | 5", "oVmajorSep 18, 2019 at 2:10 PM\nThe game is fun\n\nThe game is super strategic and entertaining + the devs are active and they take care when we call out glitch and stuff. I highly recommend to buy it ! 5/5 my user name ingame is (for the devs)oV major;)#0\n\nHelpful | 4\nDeveloper ResponseSep 19, 2019 at 5:06 AM\n\nGlad you like the game! Could your provide your in-game username to us (with the \"#\" at the end)? You can find it in the friends menu. We will look in to this and apply a fix for matchmaking and skill rating once we have identified the issue. (Thanks for the username, we will look in to this and apply a fix that should resolve this issue in the next patch)", "Dragonvang87Sep 6, 2019 at 3:45 AM\nGlitch\n\nThis game is kinda fun if you can actually finish a multiplayer match. Almost every time I play a multiplayer match it just automatically ends with a draw. This leaves both players in a wtf moment. Also the tutorial is trash it doesnt teach you anything. I kinda figured how to play on my own and this game seems really rushed and unfinished.\n\nHelpful | 8\nDeveloper ResponseSep 12, 2019 at 9:15 AM\n\nThank you for your support of Skyworld: Kingdom Brawl. The issues that you mention here have been addressed in our updated build. Please jump in for a new battle.", "Tekray187Sep 16, 2019 at 11:01 AM\nFace paced fun\n\nBought this after the launch debacle and was a touch hesitant. But rest assured the problems are fixed. Fast paced, frantic fun. The card aspect of the game allows for a certain level of customization. Good purchase.\n\nHelpful | 1", "mr.wayne323Sep 14, 2019 at 5:13 PM\nPlease make a left handed control !!!\n\nGame is great just please make the control left handed .\n\nHelpful | 5", "Freak5how232829Sep 12, 2019 at 6:04 PM\nGreat game\n\nPlayed for hours today. Alot if fun and I had no issues. Lost wifi connection a few times but do not think it's the games fault. Highly recommend this game.\n\nHelpful | 5", "Lord_DarkSep 5, 2019 at 12:48 PM\nGame is good but has some bugs\n\n80% of matches end in draw after less then a minute. Please fix it, seams really fun when it works.\n\nHelpful | 9\nDeveloper ResponseSep 12, 2019 at 9:16 AM\n\nThank you for your support of Skyworld: Kingdom Brawl. The issues that you mention here have been addressed in our updated build. Please jump in for a new battle.", "adam3iSep 14, 2019 at 5:40 PM\nOUTSTANDING!!!!\n\nSo much fun and soooooo addictive, just one more game, just one more, DAM IT!!! My headset need charging...\nI really hope we see more card sets in the future.\n10/10 from me,\nOUTSTANDING!!!!\n\nHelpful | 1", "superthunder485Sep 19, 2019 at 1:41 PM\nDidnt like it\n\nHonestly was hopeing for more of a action packed adventure or at least a system where when playing with another player who was at my lvl instead all matches where with people 10 lvl higher and destroyed me wish I could honestly get a refund\n\nHelpful | 3", "RickieBSep 12, 2019 at 9:55 PM\nReally Fun\n\nIm really enjoying myself, the strategy of trying to put together the best card deck and then being able to place the cards on the board in VR is a lot of fun.\n\nHelpful | 1", "RevenantFalloutSep 20, 2019 at 4:20 PM\nOne of the BEST FOR VR\n\nMy favorite game on Oculus Quest hands down! It has a lot of depth and details that need to be learned and lots of different strategies to be used.\n\nHelpful | 1", "PrettyMessSep 12, 2019 at 11:46 AM\nYay bugs fixed\n\nEnjoyed this game from day one, just had a rough start with all the bugs but now that they have fixed them its perfect.\n\nHelpful | 5", "danzhang2008Sep 15, 2019 at 10:31 PM\nToo engaging\n\nCouldnt stop myself playing. Really love this game. But have to figure out a way to get rid of it. Some minor issues, such as unexpected exiting\n\nHelpful | 0", "arad8522Sep 29, 2019 at 3:04 PM\nAmazing!\n\nGreat rts with an active player base. I would encourage you to get it\n\nHelpful | 1", "TuvivavalSep 14, 2019 at 6:28 AM\nVery good\n\nIf you like clash royale, you will love this game.\n\nHelpful | 2", "WARRLINGSep 17, 2019 at 6:43 PM\n\nThis game rocks! I have yet to win but it doesnt matter. The game is just well done!\n\nHelpful | 1", "JagatiabcSep 21, 2019 at 1:27 PM\nGood Fix!\n\nMatchmaking is extremely poor. It puts me with people in the top 10 global leaderboard. Im fairly new how can I compete with that?\nIm pretty disappointed about the matchmaking system.\n\nHelpful | 5\nDeveloper ResponseSep 25, 2019 at 1:11 AM\n\nHi Jagatiabc. The next patch will have adjustments to the matchmaking system which will benefit new players.", "Tenyears23Sep 27, 2019 at 5:33 PM\nI really really like it\n\nIt is fun and great\n\nHelpful | 2", "dotpegasoSep 13, 2019 at 2:51 PM\nAwesome!\n\nPlease, keep it up and don't turn it into a pay to win game!\n\nHelpful | 3"]