{"App Title": "Sling TV", "App description": "Sling TV is live TV, only better. The #1 live TV streaming service that lets you personalize your channel lineup and save. \n\nStart with the service best for you, then pick Extras in your favorite genres: Sports, Comedy, Kids, News, Movies, Lifestyle, Spanish, & more. Change your service online anytime.\n\nOver 100 live channels available to stream instantly on all of your favorite devices. Watch your favorite live sports like the NFL & college football, hit TV shows like Fear the Walking Dead, Better Call Saul, SportsCenter, plus 10,000+ hours of on-demand tv shows and movies.\n\nWith Sling TV you can get both TV and Cloud DVR on your terms - add it when you want and choose when you watch, for just $5\n\nThis is TV on your terms. No paying for useless channels, no long-term contracts, no hidden fees, easy online cancellation.\n\nThe Sling Orange service offers 30 channels for just $25/mo  including ESPN, Disney Channel, AMC, TNT, TBS, CNN, A&E, History, and many more.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Single User, Media", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Entertainment", "Genres": "Movie, News & Information, Sports", "Languages": "English, English (US)", "Version": "1.1.24", "Developer": "Sling TV, LLC", "Publisher": "Sling TV, LLC", "Website": "https://www.sling.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "LATINO\nINTERNATIONAL\nSIGN IN\n\nSling TV Privacy Notice\n\n\n\nThis Privacy Notice (this Notice) explains how Sling TV L.L.C. and its affiliates collect, use and share information about Sling subscribers and others who visit Slings websites, view Slings advertisements, or interact with Sling products or services. In this Notice, the terms Sling, we, us, and our refer to Sling TV L.L.C. and its affiliates, which collectively own and/or operate the Sling Television branded products and services including both websites and apps. The term you refers to you as a subscriber to or user of our services. Your use of our services constitutes your acceptance of this Notice.\n\nThis Notice does not apply to EchoStar Corporation or its subsidiaries or any other product or service provided by DISH Network that is covered by a separate privacy notice.\n\n\n\nQuick Guide to Contents\nWhat Information Do We Collect About You?\nHow Do We Use Information About You?\nWhat Information Do We Share with Others?\nHow Is Your Information Used for Advertising Purposes?\nWhat Choices Do You Have?\nYour California Consumer Privacy Act (CCPA) Rights\nYour Nevada Privacy Rights\nHow Do We Protect Your Personal Information?\nHow Long Do We Maintain Your Personal Information?\nWho Can You Contact with Any Questions or Concerns?\nWhat about Changes to This Notice?\n\n\n\n1. What Information Do We Collect About You?\n\n\nA. Account Information\n\nWe collect and keep personal information you give to us when you sign up for an account, including: your name, service address, billing address, e-mail address, telephone number, bank account and/or credit card number, logins and passwords to our websites and apps, security questions and codes, and other account information. We may also collect and keep other information about your account with us, such as billing and payment history, customer service interactions, and equipment and programming options. \n\n\n\nB. Usage Information\n\nWhen you use our services, our websites and apps automatically collect usage information. Usage information may include application usage data and logs, including device type and ID, IP address, and location information. This usage information may be in various formats (electronic, audio, and other), and may be collected through our website or through devices such as AirTV, third-party streaming devices, or applications provided through or used to access our services. Please see Third-Party Services and Websites below for more information.\n\n\n\nC. Viewership\n\nWhen you or someone in your household watches a video program, whether using the website or an app, we may collect a record of your viewing activity. This applies to live television programming as well as video on demand, pay per view, and DVR services.\n\n\n\nD. Third-Party Information\n\nWe also may receive information about you and your household from third parties such as programmers, business partners, consumer reporting agencies, and other data companies to enhance or supplement our records, products, or service offerings. This information may allow us to send you promotions that interest you or serve advertisements to you that match your interests and concerns. \n\n\n\nE. Third-Party Services and Websites\n\nWhen you use a third-party streaming device, you should review the privacy statements of the third party to understand what information they may collect and keep. We are not responsible for the practices of such third parties.\n\nYou may also choose, when available, to connect your account with third party accounts, including with third-party social networks. If you share information about your usage of or activities on our services with such third-party accounts, then the collection, use, and disclosure of such information will be subject to that third partys privacy policies, which may differ from our own. We are not responsible for the practices of such third parties.\n\n\n\nF. Cookies and Other Technologies\n\nWe and/or other companies we work with may use cookies, web beacons, tags, and similar technologies on websites, platforms, and in electronic communications to track users online and to collect certain information, including statistics about website and platform usage, broad demographic information, IP addresses, browser type, device type, Internet Service Provider, referring/exit pages, platform type, date/time stamp, number of clicks, and other similar information. You can access our services even when youve disabled certain cookies, but you may not be automatically recognized upon revisiting.\n\nPlease visit the What Choices Do You Have? section for further information, including about Do Not Track and how to disable cookies.\n\n\n\nG. Childrens Information\n\nAs required by our Terms of Use, you must be over the age of 18 to purchase our services, and you must be over the age of 13 and have obtained permission from your parent or your other legal guardian to create an account or otherwise access or use our services. Protecting childrens privacy is important to us. We do not direct the services to, nor do we knowingly collect any personal information from, children under the age of sixteen. If we learn that a child under the age of sixteen has provided personal information through the services, we will use reasonable efforts to remove such information from our files.\n\n\n\n2. How Do We Use Information About You?\n\n\nWe use information weve collected and received from and about you and your account (Information About You) primarily for business or commercial activities, which may include:\n\nproviding, operating, and maintaining our services;\nbilling and collections;\nconfirming that you are receiving the level(s) of service requested and are properly billed;\nidentifying when changes are made to your account or services;\ninforming you of products, programming, or services that may be of interest to you;\nmaking programming recommendations;\nunderstanding your use of our services in order to consider improving them;\nobtaining user surveys, recommendations and reviews;\nmarketing our services and those of select business partners;\ndelivering addressable or customized advertising, offers, and other services to you within the services, via email, or through other web sites and platforms (for more information see Section 4 below);\ndetecting fraud and unauthorized reception of our services;\ndetermining whether applicable policies and terms of service are being violated;\nperforming statistical or qualitative research and analysis;\nmaintaining our do not contact lists;\ncomplying with law; and\nother uses as necessary to provide our services.\n\n\n\nPersonal information and usage information may be aggregated and/or de-identified for other business and marketing uses by us. This aggregated and/or de-identified data may be used to improve our products and services, to measure and analyze use of our products and services, to provide more relevant marketing and advertising, to measure advertising effectiveness, to conduct market research, to report ratings and viewer measurement, and for other analytical and reporting purposes.\n\nWe may combine the various information we collect and receive from and about you, including account information, personal information, usage information, as well as information collected offline, across other computers or devices that you may use, and from third-party sources.\n\n\n\n3. What Information Do We Share with Others?\n\n\n\nSling treats information about you (including personal information) contained in our business records as confidential. We may share information about you with select partners in order to provide you with the best products and services. Our agreements with business partners and service providers that collect information limit the types and use of information shared with these companies.\n\n\n\nA. When May Sling Share Information about You\n\n1. With service providers in order to provide products and services to you\n\nWe may share information about you to companies that work for or provide services to us (but only as much as is necessary for them to perform the service), such as our:\n\nBilling processors;\nSubcontractors;\nSoftware providers;\nMarketing companies;\nOutside auditors and professional advisors;\nPotential business merger, acquisition, or sale partners;\nRegulators, government agencies; and\nCredit bureaus and collection agencies.\n\n\n\n2.As necessary to protect Sling and its employees\n\nWe may also share information about you (including personal information) to protect our customers, employees, or property; in emergency situations; and to enforce our rights under our terms of service and policies, in court or elsewhere.\n\n\n\n1.For mailing list purposes\n\nWe may share your name and address with others, such as charities, marketing organizations, or other businesses for mailing list purposes. Any such disclosure for mailing list purposes would be limited to subscriber names and addresses, and the disclosure does not reveal, directly or indirectly, (i) the extent of any subscribers viewing or use of a television service or other service provided by us; or (ii) the nature of any transaction made by the subscriber over any facilities used by us.\n\n\n\nB.When Sling Must Disclose Personal Information\n\nWe may be required by law to comply with a valid legal process, such as a subpoena, court order, or search warrant, or where there is a lawful request, to disclose information about you (including personal information) without your consent or notice. We may also be required to disclose personal information to a third party or governmental entity in response to a court order. If the court order is sought by a governmental entity, you should be afforded the opportunity to appear and contest in a court proceeding relevant to the court order any claims made in support of the court order.\n\n\n\nC. Sharing of Information that Is Not Personally Identifiable\n\n1.Aggregated and de-identified information\n\nWe may share information collected or received from or about you in de-identified and/or aggregate formats. We may share this with companies that collect and compile consumer data, including those that create reports about what programs people watch.\n\n2.To companies and networks that provide programming\n\nWe may share information with networks and other providers of programming about what packages our subscribers have purchased and what programs our subscribers watch. We may also share some demographic or usage information. This information is de-identified and/or aggregated, and Sling will not tell the programmer which the individuals or households watched the program.\n\n3.To advertisers and companies that provide advertising services\n\nWe may also share information with our advertisers and our advertising service providers about when, where, and how (streaming device, mobile device, or computer) an advertisement was viewed. We may also tell them certain pieces of demographic information about your household. This information is de-identified, and Sling will not tell the advertiser which individuals or households watched the advertisement. Advertisers, advertising technology companies, and service providers that perform advertising-related services for us and our business partners may use cookies, web beacons, tags, and other\n\n\n\n4. How Is Your Information Used for Advertising Purposes?\n\n\nSling may use information about you for marketing or advertising purposes in the following ways:\n\nTo provide you with more relevant TV advertising. We may use information we have collected or received from or about you through your use of the services or from third parties to show you advertisements that match your interests. We use information such as service packages purchased, pay-per-view purchases, and program viewing data. We may also use demographic and interest information (such as gender, family size, and hobbies) you provide or that we obtain from other companies. You may be able to opt out of this addressable advertising, as described below in the What Choices Do You Have? section.\nTo provide you with advertising for Sling products and services. We may use information we have collected or received from or about you through use of the service or from third parties to provide you with marketing information, offers and advertisements for Sling products and services or to exclude you from receiving certain marketing information, offers or advertisements. Our activities with respect to such marketing information, offers and advertisements may occur on Sling websites and platforms or websites and platforms operated by third parties.\nTo provide you with more relevant online advertising. We and our advertising partners may also useinformation obtained about you through your use of our website(s) or from third parties, or gathered through cookies and similar technologies, to deliver more relevant online advertising to you across other computers, devices, websites, and online services that you may use (interest-based advertising). Advertisers, advertising technology companies, and service providers that perform advertising-related services for us and our business partners may use cookies, web beacons, tags, and other technologies to collect information from or about you to tailor advertisements, measure advertising effectiveness, and enable other enhancements. You may be able to opt out of certain types of interest-based advertising as described below in the What Choices Do You Have? section.\nTo provide others with more relevant advertising. We and our advertising partners may also use information collected from or about you by us or our advertising partners and information we obtain about you from third parties to deliver advertising that is targeted for individuals with similar interests. We may combine aggregated and/or de-identified information to create groups based on actual or assumed shared interests and/or factual characteristics. We also combine information about the programming that our customers watch on the Service with their common interests to help us figure out what advertising may be most relevant.\n\n\n\n\n5. What Choices Do You Have?\n\n\nA. Cookies and California Do Not Track Disclosures\n\nCertain parts of our services require cookies. You may adjust your device or Internet browser settings to limit certain tracking or to decline cookies, but by doing so, you may not be automatically recognized upon revisiting and may not be able to use certain features of the Service or take full advantage of all of our offerings. Please refer to your devices settings or your Internet browsers Help section for more information on how to delete and/or disable your device or browser from receiving cookies or controlling your tracking preferences.\n\nSling might not recognize Do Not Track requests or headers from some or all Internet browsers. We may use cookies or other technologies to deliver more relevant advertising and to link data collected across other computers or devices that you may use.\n\n\n\nB. Interest-Based Advertising/Addressable Advertising Choices\n\nTo understand your choices for receiving more relevant online advertising, please review the information below:\n\nTo learn more about interest-based advertising, and to opt out of collection and use of information about your online activities for interest-based advertising by theDigital Advertising Alliance (DAA) participating companies, please visit http://www.aboutads.info/choices/. To opt out of targeted advertising through mobile applications, please visit https://youradchoices.com/appchoices.\nTo opt out of collection and use of information about your online activities for interest-based advertising byNetwork Advertising Initiative (NAI)member companies, please visit http://www.networkadvertising.org/choices/.\n\nEven if you opt out, you will still receive advertising from Sling and third parties. You may also still receive TV advertising from Sling or third parties that is customized based on information weve collected or received from or about you or on information about your online activities from third parties that are not DAA or NAI participating companies.\n\n\n6. Your California Consumer Privacy Act (CCPA) Rights\n\n\nCalifornia residents may also take advantage of the following rights:\n\nYou may request, up to two times each year, that we disclose to you the categories and specific pieces of personal information that we have collected about you, the categories of sources from which your personal information is collected, the business or commercial purpose for collecting your personal information, the categories of personal information that we disclosed for a business or commercial purpose, any categories of personal information that we sold about you, the categories of third parties with whom we have shared your personal information, and the business or commercial purpose for selling your personal information, if applicable.\nYou may request that we delete any personal information that we have collected from or about you. Note that there are some reasons we will not be able to fully address your request, such as if we need to complete a transaction for you, to detect and protect against fraudulent and illegal activity, for an internal business purpose, to exercise our rights, or to comply with a legal obligation.\nTo take advantage of any of these rights, please contact us at +1(866) 986-2391 or visit our Privacy Portal. We value your privacy and will not discriminate in response to your exercise of your privacy rights. We will respond to your access and deletion requests within 45 days of receipt of your request, after proper verification, unless we need additional time, in which case we will let you know. We will respond to your opt out of sale requests promptly.\n\n\n\nFor purposes of compliance with the CCPA, in addition to the further details as described throughout this Privacy Policy, we make the following disclosures:\n\nWe collect the following categories of personal information: Identifiers/Contact Information, Commercial information, Internet or other electronic network activity information, geolocation, visual and audio information, and inferences drawn from the above.\nWe sell the following categories of personal information: Identifiers/Contact Information, Internet or other electronic network activity information, and inferences drawn from the above.\nWe disclose the following categories of personal information for a business or commercial purpose: Identifiers/Contact Information, Commercial information, Internet or other electronic network activity information, geolocation, visual and audio information, and inferences drawn from the above.\n\n\n\n7. Your Nevada Privacy Rights\n\n\nNevada law permits Nevada residents to make certain requests about how their personal information is shared with third parties or affiliated companies. To make such a request, please visit our Privacy Portal.\n\n\n\n8. How Do We Protect Your Personal Information?\n\n\nSling takes information security seriously. We use commercially reasonable efforts to prevent unauthorized third-party access to information about you. However, we cannot guarantee that these practices will prevent every unauthorized attempt to access, use, or information about you.\n\n\n\n9. How Long Do We Maintain Your Personal Information?\n\n\nSling maintains personal information about you in our regular business records while you are a subscriber to any of our products or services. Sling also maintains personal information about you for a period of time after you are no longer a subscriber to satisfy legal or tax requirements, for fraud prevention, or for business purposes.\n\n\n\n10. Who Can You Contact with Any Questions or Concerns?\n\n\nIf you have any questions or concerns regarding this Notice, or our privacy practices, please contact us at privacy@sling.com, or you may write us at Sling TV L.L.C., 9601 South Meridian Blvd., Englewood, CO 80112, Attn: Office of the General Counsel  Sling Privacy Matters.\n\n\n\n11. What about Changes to This Notice?\n\n\nWe may modify this Notice at any time. We will notify you of any material changes through written, electronic, or other means as permitted by law.\n\n\n\nVersion: January 2020\n\nUse of the Sling TV services and this Website constitutes acceptance of ourTerms of UseandPrivacy Policy. See our Free Trial Offer Details, Credits, and DMCA Policy.\n\nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n\n 2020 Sling TV L.L.C. All rights reserved.\n\nU.S. Patent Nos. 7,818,444; 8,402,156; 8,612,624; 8,868,772; 9,071,668; 9,407,564; 9,571,551; 9,998,516; 10,225,304; 10,469,554; and 10,469,555\n\napply to Sling TVs streaming services offered through all available Sling TV applications and platforms.\n\nSling TV and the Sling TV Logo are Licensed Trademarks of Sling TV L.L.C.\n\nESPN and ESPN2 are registered trademarks of ESPN, Inc. Disney. All Rights Reserved.\n\nSEC ESPN Network is a trademark of ESPN, Inc. All rights reserved.\n\nEPIX is a registered trademark of Studio 3 Partners LLC.\n\nGoogle and Google Nest Hub are trademarks of Google LLC.\n\nAll trademarks are the property of their respective owners.", "Developer Terms of Service": "LATINO\nINTERNATIONAL\nSIGN IN\n\nSling TV Terms of Use\n\nEffective May 11, 2020\n\n\n\nWelcome to Sling TV! Our goal is to provide you with a variety of choice television content, including top childrens programs, live sporting events, a robust catalog of video-on-demand and much, much more.\n\nPlease note that the terms and conditions contained herein, together with any applicable promotional terms agreed to by you (Promotional Terms and together with thePrivacy PolicyandEnd User License Agreement(EULA) each of which is hereby incorporated in these Terms of Use by this reference in its entirety, collectively, these Terms of Use) include embedded hyperlinks that may only be accessed through our websites, and if you are reviewing these Terms of Use through certain applications or other platforms, then you may need to visit https://www.sling.com/offer-details/disclaimers/terms-of-usein your browser to review any hyperlinked terms incorporated herein. These Terms of Use set forth the terms and conditions pursuant to which Sling TV will agree to provide or otherwise make our Services available to you. Your access and use is conditioned on your acceptance of these Terms of Use and are effective until we change or replace them.\n\nSling TV L.L.C. and its affiliates (referred to as, we, us, our or Sling TV) endeavors to provide you and other users of our websites (Websites) and our applications (Apps) with access to a variety of content (such Websites and Apps together with any other Sling TV branded memberships, features, functionalities, products, services, and any and all content contained therein collectively referred to in these Terms of Use as, Services). You and other users of our Services are collectively referred to in these Terms of Use as you, your, and Users. Our Services, including transaction and subscription based Services, were designed to be accessed and used only by those Users intentionally authorized by us to receive such Services after registering with us and creating a membership account (Membership Account) to receive an assortment of audio, video, data, interactive, and other content available (each, an Authorized User). Notwithstanding anything to the contrary set forth in these Terms of Use. If you purchase our Services in Puerto Rico, \"we,\" \"us,\" \"our,\" or \"Sling TV\" refers to DISH Network Puerto Rico L.L.C.\n\nSUBJECT TO CERTAIN EXCEPTIONS SET FORTH BELOW INSECTION 11, THESE SLING TV TERMS OF USE REQUIRE THE USE OF MANDATORY AND BINDING ARBITRATION ON AN INDIVIDUAL BASIS TO RESOLVE DISPUTES (AS THAT TERM IS DEFINED INSECTION 11.A. BELOW, RATHER THAN, AMONG OTHER THINGS, JURY TRIALS OR CLASS ACTIONS (SEESECTION 11BELOW).\n\n\n\nTerms of Use: Table of Contents\nSection 1: ACCEPTANCE OF TERMS OF USE\nSection 2: OUR SERVICES\nSection 3: MEMBERSHIP ACCOUNTS\nSection 4: TRANSACTIONAL AND SUBSCRIPTION SERVICES; PACKAGES AND LEVELS; PROMOTIONS AND OTHER PACKAGES\nSection 5: BILLING\nSection 6: CUSTOMER SUPPORT SERVICES AND RELATED COMMUNICATIONS\nSection 7: INTELLECTUAL PROPERTY\nSection 8: DISCLAIMER OF WARRANTIES\nSection 9: LIMITATION OF LIABILITY\nSection 10: INDEMNIFICATION\nSection 11: DISPUTE RESOLUTION, ARBITRATION AGREEMENT AND CLASS ACTION WAIVER\nSection 12: MISCELLANEOUS\nPrivacy Policy:Click here.\nEnd-User License Agreement:Click here.\n\n\n\n\n\n\n\nSection 1: Acceptance of Terms of Use\n\nA. Acceptance.Our Services are not intended to be used by children without involvement and approval of a parent or other legal guardian. If you are under the age of 13, then you are not permitted to register with us or provide your personal information to us. If you are between the ages of 13 and 18, you may register with us only if your parent or legal guardian has read and agreed to these Terms of Use and you have the consent of your parent or legal guardian. These Terms of Use govern your use of all of our Services and your relationship with us. By accessing, visiting, downloading or using any of our Services (e.g., if you download any of our Apps onto any device) you confirm that you have read and agreed to these Terms of Use. If you do not agree to these Terms of Use, then do not access or use any of our Services. If you are an existing user and do not wish to accept any revised Terms of Use, then you must immediately stop using all of our Services (including, for clarity, permanently removing all Apps from your devices), except as set forth in Section 11 below. Certain of our Services may be made available without any requirement to pay a fee, and you hereby acknowledge and agree that any such access to or use are also governed by these Terms of Use.\n\nB. Changes to these Terms of Use.These Terms of Use are effective until we change them. Because we are continuously working to improve, enhance, expand, and modify our Services to provide you with the best experience, these Terms of Use will change from time to time, and we suggest that you check back regularly in order to understand our Services, including our practices related to personal information as described in the Privacy Policy, the rights and restrictions related to certain of our Services granted in the EULA, and all other terms and conditions governing your access and use of our Services. You acknowledge and agree that we may change all or any portion of these Terms of Use at any time and from time to time, in our sole and absolute discretion, by publishing a revised version of these Terms of Use at: https://www.sling.com/terms-of-use#membership. Any revised version of these Terms of Use will be effective immediately for new Users, and solely with respect to existing Users, such revised version will be effective 30 days following the day on which the revisions were first posted, unless expressly and specifically stated otherwise. Except as otherwise set forth in Section 2.E., in the event that you are an existing Sling TV customer and you do not wish to accept any revised version of the Terms of Use, then you must immediately send a notice to us at: Attn: General Counsels Office, 9601 S. Meridian Blvd., Englewood, CO 80112, and we will, at our option, either cancel your Membership Account at the end of the then-current billing period or allow you to continue to receive your Subscription Services under the previous version of these Terms of Use.\n\nCertain Restrictions on Use; Private and Personal Use Only.Some programming is the copyrighted material of the third party that supplies it, is protected by copyright and other applicable laws and may not be reproduced, published, rebroadcast, rewritten or redistributed without the written permission of the third party that supplied it (except as permitted by the fair use or other applicable provisions of the U.S. copyright laws) or by 1our agreements with such third parties. Our Services, including all content viewed through our Services, are solely for private, personal, non-commercial use, not for use in the operation of a business or service bureau, and not for any other public viewing, for profit or for the benefit or any person or entity other than the Authorized User; and your limited rights to use our Services as set forth in our EULA are subject to your understanding of, and agreement to, these Terms of Use in their entirety.\n\nSection 2: OUR SERVICES\n\nA. Our Services.By subscribing to our Services, you receive access to and use of: (i) certain software, technology and other intellectual property rights (including all functionality and data contained therein) (e.g., adaptive streaming and third-party platform authentication) owned or operated by us (regardless whether available for download directly or indirectly from Sling TV) (e.g., applications that are hosted or downloaded, accessories, tools, features and/or functionality related to and/or made available by us); (ii)websites owned, operated or otherwise controlled by, or on behalf of, us; (iii) the content accessible by you (e.g., any and all transaction and subscription video, audio, data, interactive, programming, advertising and other content); and (iv) any and all other products and/or services accessed, provided, used or otherwise made available to you, including to enhance past or then-current Services.\n\nB. Internet Connection. In order to access and use our Services, you must have a broadband, wireless or similar internet connection, and you will need to obtain such internet connection (including sufficient levels and required equipment related thereto) from a third-party internet or similar wireless service provider at your sole cost and expense (Internet Connectivity). It is your responsibility to obtain and maintain the Internet Connectivity necessary to access and use our Services. Sling TV is not responsible for your Internet Connectivity (or the amount of data consumed by you in connection with your use of any of our Services). The time it takes to access and use any of our Services (e.g., watching a movie or TV show) will vary based on a number of factors, including your location, your Internet Connectivity, the available bandwidth at the time of your request, the format of our Services you are attempting to access, the device(s) you use to access our Services and other factors outside of our control. Sling TV makes no representations or warranties about the speed or quality of your watching experience on your or any device, and reserves the right change our Services (e.g., the format) based on the specifications of your Internet Connectivity (e.g., if your Internet Connection or device do not meet our required standards for accessing and viewing high-definition (HD) content, then any HD content accessed by you may be automatically re-formatted by us in an attempt to improve your experience). We suggest that you ensure that your Internet Connectivity, Permitted Device(s) (as defined below) and configuration are compatible with our Services and the format thereof. You can review our minimum requirements and recommended levels for Internet Connectivity at:http://help.sling.com/articles/en_US/FAQ/What-do-I-need-to-get-started-with-Sling-TV/. By accessing or using our Services, you agree to look solely to the entity that provides your Internet Connection for any issues related to such connection and/or its compatibility with, or sufficiency for accessing and using, any of our Services.\n\nC. Devices.Not all devices are compatible, or permissible, for use with our Services. For a current list of devices permitted for use with our Services (Permitted Devices) please visit and review the devices listed at:www.sling.com/devices. Permitted Devices, including Permitted Cloud DVR Devices (as defined in Section 2.G.iii. below), are manufactured and sold by entities other than Sling TV. In order to use our Services, you must have a Permitted Device, and you will need to obtain such Permitted Device from a third-party provider of such device at your sole cost and expense. You may use more than one Permitted Device, but the number of Authorized User(s) concurrently accessing or using our Services may be limited to one (1) Permitted Device at any time. In addition, certain of our Services, or portions of the functionality thereof, may be blacked-out or not-available on certain Permitted Device(s). By accessing or using any of our Services, you agree to look solely to the third party that manufactured and/or sold you the device for any issues related to such device, the operating system thereon and/or its or their compatibility with any of our Services.\n\nD. Use of Adaptive Bitrate Streaming. Our audiovisual Services, including, without limitation, live TV channels and the Cloud DVR (as defined below), use adaptive bitrate streaming (ABS), which creates multiple versions of each program, recorded at different bitrates, to optimize playback of the applicable audiovisual content at any given time based upon the capabilities of the applicable playback device and available internet bandwidth. If you choose to use the Cloud DVR, you are directing that playback be provided using ABS.\n\nE. Service Changes; Packaging of Services.In addition to, and without limiting any other provisions in these Terms of Use, Sling TV may, permanently or temporarily, add, delete, rearrange, alter, interrupt, change, and/or eliminate: (i) any and all prices, fees and/or charges; (ii) packages, programming, programming suppliers, services offered by suppliers; (iii) availability of the Cloud DVR with respect to any particular programming and/or programming suppliers, (iv)software, applications, features and/or functionalities and technical and/or functional requirements, (v) Permitted Devices, (iv) compatible operating systems, (iiv) and/or minimum Internet Connectivity required to use the Services, from time to time and at any time. In the event that we add, alter and/or change any prices, fees and/or charges, then you agree to pay such added, altered, and/or changed prices, fees and/or charges. In the event that we add, delete, rearrange, alter, change and/or eliminate any packages, availability of the Cloud DVR with respect to any particular programming and/or programming suppliers, software, applications, features and/or functionalities, then you acknowledge and agree that (a) we have no obligation to replace or supplement such packages, availability of the Cloud DVR with respect to any particular programming and/or programming suppliers, software, applications, features and/or functionalities, and (b) you are not entitled to any credits, refunds, price reductions or any other form of compensation because of any such addition, deletion, rearrangement, alteration, change and/or elimination. You further acknowledge and agree that such additions, deletions, rearrangements, alterations, changes and/or eliminations are not a discretionary act by us if they are due, in whole or in part, to the termination, suspension or expiration of our legal right to provide such packages, availability of the Cloud DVR with respect to any particular programming and/or programming suppliers, software, applications, features and/or functionalities.\n\nF. Programming Content and Restrictions. Certain of our Services may be blacked out in your viewing area (e.g., local broadcast channels, sporting events and/or other content for which you do not have the rights to access); if you circumvent or attempt to circumvent any of these blackouts, then you may be subject to legal action brought by us or third parties. Certain of our Services may have additional restrictions and your access to such Services will be subject to those restrictions (e.g., you must be at least 18 years of age, or the applicable age of majority where you live, in order to access certain adult-oriented programming or similar Services).\n\nG. The Cloud DVR.\n\ni. Certain Cloud DVR subscribers are participating in the beta testing phase, which is only available to a limited number of subscribers. If you qualify and are selected to use the beta phase of the Cloud DVR, then we estimate that you will be able to record approximately 100 hours of video programming using the Cloud DVR during the beta testing period. Other Cloud DVR users are participating in the Cloud DVR general market product phase. If you have subscribed for use of the Cloud DVR general market product, then we estimate that you will be able to record approximately 50 hours of video programming using the Cloud DVR general market product. However, in any case, we do not guarantee any minimum amount of recording time and actual recording time may vary. The phrase Cloud DVR refers to both the Cloud DVR in the beta testing phase and the Cloud DVR general market product. We do not warrant or guarantee: (a) access to or recording of any particular programming; (b) the length of time any particular recorded program may remain available for your viewing; or (c) that the Cloud DVR (I) is error-free, (II) will not be interrupted, (III) will not erroneously delete programming that you record, or (IV) will not fail to schedule, make, store, or play back recordings. If you program the Cloud DVR to record more programming than it can hold in the space available, then some programs that you have previously recorded may be deleted. The Cloud DVR does not permit you to protect recordings from such deletion. We reserve the right to terminate the Cloud DVR (and/or all or any portion of your access to the Cloud DVR) at any time in our sole and absolute discretion and, for the avoidance of doubt, we may terminate the Cloud DVR (and/or all or any portion of your access to the Cloud DVR) even if you have not decided to cancel the Cloud DVR. In the event that the Cloud DVR (and/or your access to the Cloud DVR) is cancelled or terminated for any reason or no reason whatsoever, you will no longer have access to any recordings that you have made with the Cloud DVR. If your Membership Account is disconnected, suspended or terminated for non-payment, or for any other reason (or no reason) whatsoever (see, e.g., Section 5.E. below), then, even if you pay to restart your subscription(s) to our Services, recordings that you made with the Cloud DVR prior to such disconnection, suspension or termination may no longer be available.\n\nii. IN CONSIDERATION OF YOUR USE OF THE CLOUD DVR IN BETA TESTING PHASE OR THE CLOUD DVR GENERAL MARKET PRODUCT, AS APPLICABLE, YOU HEREBY RELEASE SLING TV FROM ANY AND ALL LIABILITY AND RESPONSIBILITY FOR ANY: (a) INABILITY TO ACCESS OR RECORD ANY PROGRAMMING; (b) ERRONEOUS OR INTENTIONAL DELETION OF ANY RECORDING AT ANY TIME; (c) FAILURES, ERRORS AND INTERRUPTIONS OF THE CLOUD DVR; AND/OR (d) FAILURE OR INABILITY TO SCHEDULE, MAKE, STORE, OR PLAY BACK ANY RECORDING.\n\niii. Not all devices are compatible or permissible for use with the Cloud DVR. Currently, the only devices that are compatible and permissible for use with the Cloud DVR are: devices that are Roku-branded and currently being supported by Roku, devices that are Amazon-branded and on which all other Sling TV Services may be accessed, devices that run on the Android operating system and on which all other Sling TV Services may be accessed, devices that are Windows 10-branded and on which all other Sling TV Services may be accessed, devices that are Xbox One-branded and on which all other Sling TV Services may be accessed, devices that are AirTV-branded and on which all other Sling TV Services may be accessed, devices that run on the TVOS operating system and on which all other Sling TV Services may be accessed, devices that run on the iOS operating system and on which all other Sling TV Services may be accessed, and devices that are Apple TV-branded and on which all other Sling TV Services may be accessed (Permitted Cloud DVR Devices). You may use more than one (1) Permitted Cloud DVR Device to access the Cloud DVR, but we may limit the number of Permitted Cloud DVR Devices that you may use concurrently to access or use the Cloud DVR at any time.\n\nH. Compliance with Law.You agree to use our Services, including all features and functionalities associated therewith, in accordance with all applicable laws (e.g., public performance limitations or other restrictions on any use of our Services or contents therein). You agree not to archive, download (other than through caching necessary for personal use), reproduce, distribute, modify, display, perform, publish, license, create derivative works from, offer for sale, or otherwise use or gain access to all or any portion of our Services, except as explicitly authorized in these Terms of Use, without express written permission from Sling TV. You also agree not to: circumvent, remove, alter, deactivate, degrade, thwart or otherwise interfere with any of our Services; use any robot, spider, scraper or other automated means to access our Services; decompile, reverse engineer or disassemble any of our Services (e.g., software or other products); insert any code or product, or otherwise manipulate or interfere with our Services (e.g., running any of our Services on a device not permitted for use by us); or, use any data mining, data gathering, or extraction method. In addition, you agree not to upload, post, e-mail, or otherwise send or transmit any material designed to interrupt, interfere with, destroy, or limit the functionality of any of our Services, or other software, hardware, or telecommunications equipment associated with our Services (e.g., any software viruses or any other computer code, files, or programs). In the event that we learn that you are using any Service in a manner that constitutes infringement of third-party intellectual property rights, including rights granted by U.S. copyright law, your Membership Account will be terminated.\n\nI. Multiple Services. Sling Orange + Sling Blue consists of two separate Sling TV servicesSling Orange and Sling Blueoffered together for a multi-service discount. By subscribing to both services in Sling Orange + Sling Blue, you acknowledge that you can watch only one stream at a time of any Sling Orange channel using your Sling Orange service. In addition, you can watch three streams of Sling Blue channels at the same time using your Sling Blue service. In total, you can watch up to four simultaneous streamsone stream via your Sling Orange service and three streams via your Sling Blue service.\n\nSection 3: MEMBERSHIP ACCOUNTS\n\nA. Membership Account; Login Credentials.Prior to accessing certain of our Services, you will be required to provide certain personal information determined by us as necessary to create a Membership Account. To become an Authorized User you must first register with us for a Membership Account. You will be required to create login credentials, comprised of a user name and password (Login Credentials) designed to enable access and use your Membership Account. You are responsible for any and all actions, omissions, or other activities related to your Membership Account, including any Authorized Users you permit to be linked to your Membership Account (if any, and only to the extent, permitted by us). The person in whose name any Membership Account is used for access to our Services, and whose payment method is charged, if any, is referred to as the Account Owner. As an Account Owner you may have access to and control over your Membership Account, any Authorized Users linked to your Membership Account, and the Services available in connection therewith. If you have a Membership Account, then your control of such Membership Account is exercised through your use and protection of your password. Please be aware that to maintain exclusive control and ensure compliance with these Terms of Use, you may not reveal or share your Login Credentials with anyone. In addition, if you would like to ensure that others cannot access your Membership Account by contacting our Customer Service (as defined in Section 6 below) and potentially altering your control, then you should take the necessary precautions not to reveal any personal or sensitive information used to identify yourself in connection with a lost password or user name (e.g., billing information, government issued IDs, or secret question answers). If you believe that your Membership Account has been accessed by anyone other than you or any Authorized Users you have permitted thereunder, or otherwise without permission or in any unauthorized manner, then you must contact us immediately at:1 (888)-309-0838. You are responsible for updating and maintaining the truth and accuracy of the information provided to us relating to your Membership Account (e.g., current billing information for Subscription Services (as defined below)). YOU UNDERSTAND THAT BY SHARING ACCESS TO OUR SERVICES OR YOUR LOGIN CREDENTIALS, OR BY OTHERWISE ALLOWING OTHERS TO ACCESS YOUR ACCOUNT, YOU AGREE TO BE RESPONSIBLE FOR ASSURING THAT ANY AND ALL SUCH USERS COMPLY WITH THESE TERMS OF USE AND THAT YOU OR THE NAMED PERSON ON THE APPLICABLE MEMBERSHIP ACCOUNT SHALL BE RESPONSIBLE FOR ANY AND ALL ACTIONS, OMISSIONS AND/OR OTHER USE ASSOCIATED WITH SUCH MEMBERSHIP ACCOUNT. PLEASE BE AWARE THAT IF YOU SHARE OR OTHERWISE MAKE YOUR ACCOUNT AVAILABLE TO ANY THIRD PARTY (E.G., FORGETTING TO LOG OUT OF YOUR MEMBERSHIP ACCOUNT ON A SHARED OR PUBLIC DEVICE), THEN SUCH THIRD PARTY(IES) MAY BE ABLE TO ACCESS ANY AND ALL INFORMATION CONTAINED IN YOUR MEMBERSHIP ACCOUNT (E.G., CERTAIN PERSONAL INFORMATION, BILLING INFORMATION, SETTINGS, VIDEO RENTAL AND VIEWING HISTORY AND OTHER RELATED VIEWING PREFERENCES (IF ANY) ASSOCIATED WITH YOUR ACCOUNT).\n\nB. Account Access; Cookies.In order to provide you with ease of access to your Membership Account and to help administer our Services, Sling TV uses technology that enables us to recognize you as an Authorized User and to provide you with direct access to your account without requiring you to retype any Login Credentials every time that you access, use, or otherwise revisit our Services, including via any Permitted Devices. For information about how cookies allow us to simplify the ease of access to your Membership Account, please review Cookies, Web Beacons, Tags, Other Technologies and Online Tracking section of ourPrivacy Policy.\n\nC. Logging in Through Third-Party Accounts; Third-Party Accounts.We may, but are not obligated, to permit you to elect to share certain information about your use of our Services (e.g., by posting what you watch or recommend with third-party accounts, on third-party platforms and such third parties you elect to connect to your Membership Account). Your use of any social features made available to you in connection with the Services is subject to the Social Terms section of our Privacy Policy. We suggest that you review ourPrivacy Policy, including the Social Terms, in its entirety before electing to connect your Membership Account, or otherwise share any information about you with any third party (e.g., by logging in via any social networking or other third-party account). We further suggest that you review thePrivacy Policyof any such third-party account or third-party platform in its entirety before making the same election to connect your Membership Account thereto.\n\nD. Requests for Information.You should be mindful of any communication requesting that you submit any personal or other sensitive information (e.g., your personal information, credit or debit card account information, Login Credentials, or secrets questions), and before confirming any such request, you should contact Customer Service immediately at:1 (888)-309-0838. Please be aware that providing your information in response to these types of communications can result in, among other things, identity theft or fraud. Always access your sensitive account information (e.g., your personal information, credit or debit card account information, Login Credentials, or secrets questions) via our Websites or Apps, or by contacting Customer Service directly at:1 (888)-309-0838. In order to protect Sling TV and its affiliates, media providers, device providers, business partners, or other service providers or licensors (collectively, Contributors), we reserve the right, and may, from time to time and at any time, without providing notice to you, place on hold (or otherwise suspend) your Membership Account in connection with any activity that we believe to be fraudulent, illegal, in violation of these Terms of Use, or otherwise suspicious. We may evaluate or elect to provide credits, refunds, price adjustments or other discounts, compensation or recompense, from time to time and at any time, in our sole and absolute discretion, BUT WE ARE NOT OBLIGATED, AND YOU ARE NOT ENTITLED AND HEREBY WAIVE ANY RIGHT, TO ANY CREDIT, REFUND, PRICE ADJUSTMENT OR ANY OTHER DISCOUNT, COMPENSATION OR RECOMPENSE FOR HOLDS PLACED ON YOUR ACCOUNT, IF ANY.\n\nE. Device Deactivation.If your device is transferred, lost, or stolen, then you must immediately call Customer Service at:1 (888)-309-0838. It is your sole responsibility to notify us of any transferred, lost, or stolen devices, and to prevent any unauthorized access to our Services and your Membership Account. Please review the risks and responsibilities of allowing third-party access to your Membership Account (see Section 3.A. above) that may result from your failure to notify us that your device was transferred, lost, or stolen.\n\nSection 4: TRANSACTIONAL AND SUBSCRIPTION SERVICES; PACKAGES AND LEVELS; PROMOTIONS AND OTHER PACKAGES\n\nA. Transactional Services.Certain of our Services may be made available by us without requiring any commitment from you to pay any fees or other amounts (e.g., use of our Websites and Apps, access to any available content therein, and video-on-demand libraries) (collectively, Transactional Services). Your access to, and use of, any Transactional Services are governed by these Terms of Use, and once you create or request a Membership Account to access certain of our Services, you will be a member until you or we permanently cancel your Membership Account and all Subscription Services with us. For example, you must abide by these Terms of Use in connection with your creation and use of any Membership Account used solely to access our Services, regardless of whether you ever provide payment information for any other paid Transactional Services. You may be required to provide a payment method and necessary billing information in order to receive certain other Transactional Services (e.g., certain paid a-la-carte video-on-demand rentals or pay-per-view offerings). Any and all users that create a Membership Account automatically enroll in membership to our Services UNLESS AND UNTIL YOU CONTACT US TO PERMANENTLY CANCEL AND DELETE INFORMATION RELATED TO YOUR MEMBERSHIP ACCOUNT BY CALLING CUSTOMER SERVICE AT1 (888)-309-0838, or until we elect to permanently cancel your Membership Account and Subscription Services (as defined below) for any purpose (e.g., in accordance with our standard information retention and destruction processes).\n\nB. Subscription Services.Certain of our Services may be made available by us solely in connection with your agreement to purchase a subscription to such Services for a set period (e.g., monthly or yearly subscription term) (collectively, Subscription Services). Regardless of the period for which you purchased any Subscription Services, following the completion of any such subscription period, your Subscription Services will automatically renew on a month-to-month basis at the then-current standard rates for monthly access to the same Subscription Services, unless and until they are cancelled or changed by you or Sling TV in accordance with these Terms of Use.\n\nC. Packages of Subscription Services.We may offer a number of different packages of Subscription Services, including special promotional packages, each governed by any supplemental Promotional Terms provided at the time of your first access or use of such Services. Some promotional packages may be offered by third parties in conjunction with the provision of their own products and services. We are not responsible for the products and services provided by such third parties. We reserve the right to modify, terminate, or otherwise amend the Subscription Services offered by us, and the contents of the packages and levels thereof.\n\nD. Minimum Requirements.Sling TV reserves the right to require and/or change minimum programming package requirements, from time to time and at any time, in its sole and absolute discretion. For example, Sling TV may require a minimum commitment term, or Sling TV may require you to subscribe to a minimum level or package of our Services in order to view certain content or obtain access to purchase additional levels or packages of Subscription Services. In order to purchase certain packages, you may be required to first subscribe to Services for a set term (e.g., a year-long subscription).\n\nE. Promotional Offers.You may initially accept a promotional offer for a certain package of Services that later becomes unavailable. Promotional offers do not automatically renew and may not be available at the end of, or during, the applicable promotional period, and following the completion of any such promotion, the Subscription Services will automatically renew on a month-to-month basis at the then-current standard rates for monthly access to the same Subscription Services, unless and until they are cancelled or changed by you or Sling TV, in accordance with these Terms of Use.\n\nF. Only One Promotion per Account Owner.Promotional offers may not be combined with other promotional offers associated with any account that you own, unless otherwise expressly permitted in the applicable Promotional Terms. Sling TV reserves the right, in its sole and absolute discretion, to determine your eligibility for any promotional offer pursuant to the applicable Promotional Terms. Sling TV reserves the right to change, amend and alter then-current promotional offers or Promotional Terms as well as institute new promotional offers, from time to time and at any time, in its sole and absolute discretion. We do not guarantee that any promotional offers are or will be available to you at all, or in connection with any Services desired by you.\n\nG. Cancellation Policies.Your Subscription Services are prepaid on a monthly billing period basis and you may contact us to cancel them at any time by visiting www.sling.com/account or by calling Customer Service at:1 (888)-309-0838. Cancellation requests are not accepted via email. Because charges are prepaid each billing period, when you call to cancel your Subscription Services, your subscription will continue, and you will be able to enjoy your Subscription Services through the end of, the then-current billing period (except as otherwise provided herein to the contrary (see Section 5.D.) or in any Promotional Terms). Refunds are not issued for a partial billing period. WE ARE NOT OBLIGATED, AND YOU ARE NOT ENTITLED AND HEREBY WAIVE ANY RIGHT, TO ANY CREDIT, REFUND, PRICE ADJUSTMENT OR ANY OTHER DISCOUNT, COMPENSATION OR RECOMPENSE FOR ANY PARTIAL-USE, EARLY CANCELATION OR UNWATCHED PRE-PAID SERVICES. When you cancel your Subscription Services, you may be subject to certain charges and fees as set forth in any applicable Promotional Terms, and if you have taken advantage of a promotional offer that required you to pre-pay for a minimum period of time (e.g., 3 months), then your cancellation will not become effective until the end of that minimum period of time, and in such case, for purposes of such promotional offer, your initial billing period will mean such minimum period of time. Your cancelation of Subscription Services does not automatically cancel your Membership Account or access to our Transactional Services. If you pay for the Services through your account with a third party (e.g., Amazon, Roku) and want to cancel your Membership Account or access to our other Services, then you may need to do so through your account with such third party.\n\nSection 5: BILLING\n\nA. Fees and Charges.We will bill you monthly in advance for your Subscription Services. Charges are billed to the credit or debit card you registered with your Membership Account. Sling TV may, from time to time and at any time, change the amount of or basis for determining any fees or charges, and/or institute new fees, surcharges, or other charges as determined by us (e.g., surcharges imposed for transmission of programming content in certain jurisdictions). You agree to pay all amounts billed for our Services, as well as all taxes, fees, and other charges, if any, that are now or may in the future be assessed in connection with any of our Services you access or use, and any other charges due and owing to us. We may apply interest and late fees for any amounts paid following the date when due, and we may terminate or suspend your account for any failure to timely pay any amounts or maintain up-to-date payment method information within your account. State and local taxes or reimbursement charges for gross earnings taxes in some states may apply.\n\nB. Registration of Credit or Debit Card.If you do not already have an account, you will be required to establish an account to access certain of our Services. To access certain Services (e.g., video-on-demand rentals), you will also be required to register a valid credit or debit card to process payments of the associated fees. When you register a credit or debit card for a new account, you authorize Sling TV to place a pending charge to your credit or debit card to verify your billing address and the validity of your credit or debit card; such pending charges are temporary and will not be converted into an actual charge to you. Pending charges, while pending, will, however, reduce the available amount of credit on your credit card or funds available to your debit card. You are solely responsible for any and all fees charged to your credit or debit card by the issuer, bank, or financial institution, including fees for membership, any overdraft or other insufficient funds, or for exceeding any applicable credit limit. Once your account is authenticated, the credit or debit card that you registered with your account will be charged for each transaction without having to reenter your credit or debit card information. You agree that the issuer of any credit or debit card you registered with your Membership Account will accept these Terms of Use as your authorization and pay all amounts billed in connection with use of your account without Sling TVs submitting a signed receipt.\n\nC. Billing Cycle.The fees for all Subscription Services and Transactional Services will be billed in advance. For Subscription Services, we automatically bill you each month on the calendar day corresponding to the date on which you first commenced payment for Subscription Services. Membership Account fees for Subscription Services and Transactional Services are fully earned upon payment. If your paid membership to any Subscription Service began on a day not contained in a given month, then we may bill you on a day in the applicable month or such other day as we deem appropriate (e.g., if you are regularly billed on the 31st, then we may bill you on the 28th or 30th of the calendar months that do not have 31 days). Although we endeavor to bill you as described in this paragraph, we reserve the right to change the timing of our billing as necessary, from time to time, and at any time. We may authorize your payment method in anticipation of membership or service-related charges. As used in these Terms of Use, billing shall indicate a charge, debit, or other payment clearance, as applicable, against your registered credit or debit card information. For the purposes of this paragraph, month or monthly refers to your billing cycle.\n\nD. No Returns, Credits or Refunds.YOU UNDERSTAND AND AGREE THAT PAYMENTS ARE NONREFUNDABLE. WE ARE NOT OBLIGATED, AND YOU ARE NOT ENTITLED AND HEREBY WAIVE ANY RIGHT, TO ANY CREDIT, REFUND, PRICE ADJUSTMENT OR ANY OTHER DISCOUNT, COMPENSATION OR RECOMPENSE FOR ANY PARTIALLY USED OR UNUSED SERVICE (E.G., SUBSCRIPTION SERVICES NOT USED OR TRANSACTIONAL SERVICES NOT DOWNLOADED OR FULLY VIEWED). Because charges are prepaid each billing period, following your cancellation of any of your Subscription Services or Transactional Services, you will continue to have access to any and all of such Services for which you have paid through the end of your then-current billing period, and to certain of our other Services that do not require any payment, including, access to and use of certain portions of our Websites and Apps. Notwithstanding the forgoing, although not required or obligated, we reserve the right to evaluate or elect to provide credits, refunds, price adjustments or other discount, compensation or recompense, from time to time, and at any time, in our sole and absolute discretion; provided that any such elections to offer any such credits, refund, price adjustment or other discount, compensation or recompense in one instance does not entitle you to the same or any such benefit in the future for similar or unrelated instances, nor does it create any obligation whatsoever for us to offer such benefit to you or any other user in connection with any past, present, or future request under any circumstance whatsoever.\n\nE. Restarting your Services.If you do not make timely payment for your Services, we may disconnect, suspend, limit, or terminate your access to such our Services, and in such event, we will be immediately and forever wholly relieved from any and all of our duties and obligations to you under these Terms of Use. If your Membership Account is disconnected for non-payment, or for any other reason whatsoever, then Sling TV may require that you pay, and you agree to pay, any amount due (regardless of how long outstanding, and including all past due charges and all outstanding balances accrued through the date of such disconnection) before we reconnect your access to any of our Services. We are not obligated to reconnect your access to any of our Services. If your Services are disconnected for non-payment, or for any other reason whatsoever, then you may no longer be eligible, even if you pay to restart your Subscription Services, to receive any remaining credits or promotional pricing that you would have been eligible to receive had your Subscription Services, or any of our other Services, not been disconnected, suspended, limited, or terminated. Unless required by applicable law, deposits will not be held segregated from other funds and will not earn or accrue interest. Promotional pricing is valid only at the time of initial purchase of such promotional Subscription Service or Transactional Service, and we reserve the right to stop any promotion at any time for any reason whatsoever.\n\nF. Attorneys Fees/ Collections.If we use an attorney or a collection agency to collect any money you owe us, or to assert any other right that we may have against you (e.g., any breach of any agreement you may have with Sling TV or any of our affiliates), then you hereby agree to pay the reasonable costs of such collection or other action. These costs may include the costs of a collection agency, reasonable attorneys fees, and court costs. If you believe you have been billed in error, you must contact our Customer Service immediately, and in no event more than 15 days following the date you receive any bill for which you are seeking correction. Failure to timely notify us of any dispute will constitute your acceptance of the corresponding billed amounts. You must pay undisputed portions of any billing statement when due, or, without limitation to any other rights or remedies available to Sling TV at law, in equity, under contract (including these Terms of Use), or otherwise, all of which are hereby expressly reserved (e.g., we may elect to suspend or terminate your Subscription Services or any of our Services), permanently or temporarily, in whole or in part. All payments for our Services must be made directly by you to us, unless we authorize otherwise; and except as otherwise authorized, Sling TV shall have no obligation to provide Services for which payment is made by you to a third party or for which payment is made by a third party on your behalf.\n\nG. Puerto Rico. If you reside in Puerto Rico, please note that the fees for all Subscription Services and Transactional Services will be billed to you by sling.com even though you are conducting business with DISH Network Puerto Rico L.L.C..\n\nSection 6: CUSTOMER SUPPORT SERVICES AND RELATED COMMUNICATIONS\n\nA. Customer Support Services.Sling TV may elect to provide Membership Account support services or other assistance in connection with your Membership Account (Customer Service(s)). The levels, methods, and availability of our Customer Service offered is determined by us, in our sole and absolute discretion; we have no obligation to provide any Customer Services whatsoever in connection with our Services. If we make available or otherwise provide Customer Services, then such Customer Services are considered part of our Services for purposes of these Terms of Use, including any and all restrictions, disclaimers, and limitations herein.\n\nB. Communications.By registering for a Membership Account, you hereby consent to receive electronic communications from us and other Contributors related to such account and our Services. These communications may involve sending emails to the email address you provided during registration, or delivering electronic communications via your Membership Account, and will include notices about your Membership Account (e.g., payment authorizations, password or payment method changes, confirmation e-mails, notices, and other similar or transactional information related to such account); these communications are part of our Services and your relationship with us. You agree that any notice, agreements, disclosures, or other communications that we send to you electronically, as described herein, will satisfy any legal communication requirements (e.g., that such communications be in writing and through an appropriate method). You also consent to receiving other electronic communications from us, such as newsletters about new Services features and content, special offers, promotional announcements, and customer surveys. If you no longer want to receive certain non-transactional communications via email, please contact Customer Service at1 (888)-309-0838, click on the Unsubscribe link contained in any email, or on any other link that indicates that you would like to be removed from future, similar non-transactional communications.\n\nC. Text Messages. By electing to receive text messages from us, you hereby consent to the following additional terms:\n\ni.  Message and data rates may apply depending on wireless carrier plan. See wireless plan or contact carrier for details.\n\nii. Your receipt of text messages from us is subject to carrier participation. Current participating carriers are as follows: AT&T, T-Mobile, Verizon Wireless, Sprint, Boost, U.S. Cellular, Cellular One, MetroPCS, Cellcom, Cellular South, Carolina West Wireless, Interop, ClearSky, nTelos, and Virgin Mobile.\n\niii. T-Mobile Liability Notice: T-Mobile does not guarantee that alerts will be delivered and will not be liable for delayed or undelivered messages.\n\nIn addition, upon receipt of a text message from us, you may reply via text with HELP for Help and STOP to request that you stop receiving such messages.\n\nSection 7: INTELLECTUAL PROPERTY\n\nA. Sling Property.The Sling TV Services, including any and all content made available in connection with your access and use of our Services, is protected by domestic and international copyright, trade secret, trademark, and other intellectual property laws. Sling Television, Sling and Sling TV are registered trademarks of Sling TV L.L.C., and Sling TV L.L.C. and its affiliates have patents that apply to our Services.Looking for Slingbox? Click here.\n\nB. End-User License Agreement.Our Websites, Apps, and other software and technologies are developed by, or for, us and are designed to enable our provision of certain content through Permitted Devices. Our Websites, Apps, and other software and technologies may vary by Permitted Device, operating system, or other medium and the functionalities thereof may also differ among Permitted Devices. BY USING ANY OF OUR SERVICES, YOU ACKNOWLEDGE AND AGREE TO OUREND USER LICENSE AGREEMENT(I.E., OUREULA) AND TO RECEIVE, WITHOUT FURTHER NOTICE OR PROMPTING, UPDATED VERSIONS OF OUR WEBSITES, APPS, AND OTHER SOFTWARE AND TECHNOLOGIES, INCLUDING RELATED THIRD-PARTY SOFTWARE. IF YOU DO NOT ACCEPT THESE TERMS AND CONDITIONS SET FORTH IN OUREULA, THEN DO NOT USE ANY OF OUR SERVICES.\n\nC. Reporting Claims.If you have a reasonable belief that your or any others protected works have been reproduced or distributed in a way that constitutes copyright infringement, or are otherwise aware of any content available in connection with the Services that may be infringing, violating, or otherwise misappropriating the your rights or such other partys rights, then please notify us immediately by sending us a written statement to the Notice Address set forth in Section 11.B. below, which written statement must set forth as much detail as is available, including, at a minimum: (i) your name; (ii) your address; (iii) your Membership Account number (if any); and (iv) a clear and detailed statement about the applicable concern of copyright infringement and/or related claim or by clicking on the DMCA Policy link at www.sling.com and providing us with notice of your claim and other information as instructed.\n\nD. Warning against Piracy and Infringement.Receiving any portion of the Services without paying for them, and/or any direct or indirect act or attempted act to engage or assist in any unauthorized interception, reception, display, or other transmission or access of any portion of our Services, is a violation of various U.S. federal and state laws and of these Terms of Use. The penalties for violating applicable laws can include imprisonment and civil damage awards of up to $110,000 per violation. Section 605(e)4 of Title 47 of the United States Code makes it a federal crime to modify your device or our Services to receive encrypted (scrambled) television programming without payment of required subscriptions (e.g., Subscription Services). Conviction can result in a fine of up to $500,000 and imprisonment for five years, or both. Any person who procures any hardware or software that has been so modified is an accessory to that offense and may be punished in the same manner. Investigative authority for violations lies with the Federal Bureau of Investigation. In the event that we learn that you are using any Service in a manner that constitutes infringement of third-party intellectual property rights, including rights granted by U.S. copyright law, your Membership Account will be terminated.\n\nSection 8: DISCLAIMER OF WARRANTIES\n\n\n\nYOU EXPRESSLY UNDERSTAND AND AGREE THAT:\n\nA.      YOUR USE OF OUR SERVICES IS AT YOUR SOLE RISK. OUR SERVICES ARE PROVIDED ON AN AS IS AND AS AVAILABLE BASIS. EXCEPT AS OTHERWISE SPECIFICALLY SET FORTH IN THESE TERMS OF USE, SLING TV (ON BEHALF OF ITSELF AND THE OTHER CONTRIBUTORS) HEREBY EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING THE IMPLIED WARRANTIES OF SATISFACTION, ENJOYMENT, QUALITY, TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. SLING TV DOES NOT TAKE ANY RESPONSIBILITY WHATSOEVER OR OTHERWISE WARRANT THE PERFORMANCE OF ANY DEVICE, INCLUDING THE CONTINUING COMPATIBILITY OF THE DEVICE (OR ITS OPERATING SYSTEM) WITH ANY OF OUR SERVICES, OR ANY INTERNET CONNECTION, INCLUDING ITS SPEED, BANDWIDTH OR COMPATIBILITY WITH ANY DEVICE OR SLING TV SERVICE. FURTHERMORE, WE DO NOT MAKE ANY PROMISES ON BEHALF OF ANY THIRD PARTY, INCLUDING THE OTHER CONTRIBUTORS, AND YOU ACKNOWLEDGE AND AGREE THAT YOU HAVE NOT RELIED ON ANY PROMISES MADE BY US RELATED TO SUCH PARTIES OR THE PRODUCTS AND SERVICES PROVIDED BY THEM. The disclaimers set forth in these Terms of Use expressly apply to any terms hyperlinked and incorporated herein, including any Promotional Terms, thePrivacy Policyand theEULA, and including the software contained in our Services and your use of such software. We do not warrant that any issues, errors, or other defects or failures in or related to the software or our Services will be corrected.\n\nB.      NEITHER SLING TV NOR ANY OTHER CONTRIBUTOR MAKES ANY WARRANTY WHATSOEVER THAT: (i) THE SERVICE WILL MEET YOUR REQUIREMENTS OR REASONABLE SATISFACTION; (ii) THE SERVICE WILL ALLOW YOU TO COPY, RECORD, VIEW, SKIP, OR TRANSFER ANY PARTICULAR MEDIA, PROGRAMMING, OR PART THEREOF, OR PROVIDE OR CONTINUE TO PROVIDE ANY OTHER PARTICULAR FUNCTIONALITY; (iii) THE SERVICE WILL PERFORM AT A PARTICULAR SPEED, BANDWIDTH, OR DATA-THROUGHPUT RATE, BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE; (iv) INFORMATION RELATED TO YOUR ACCOUNT OBTAINED FROM THE USE OF THE SERVICE WILL BE ACCURATE OR RELIABLE; OR (v) THE VARIETY, QUANTITY, OR QUALITY OF ANY MEDIA, PRODUCTS, SERVICES, ACCESSORIES, INFORMATION, OR OTHER MATERIAL RENTED OR OBTAINED BY YOU THROUGH OUR SERVICES WILL MEET YOUR EXPECTATIONS, OR ANY ERRORS IN THE SERVICE WILL BE CORRECTED.\n\nC.      SLING TV MAY RECOMMEND CERTAIN LEVELS OF INTERNET CONNECTION FOR USE WITH CERTAIN OF OUR SERVICES; PROVIDED, HOWEVER, THAT YOU HEREBY AGREE AND UNDERSTAND THAT SLING TV WILL HAVE NO RESPONSIBILITY WHATSOEVER FOR YOUR INTERNET CONNECTIVITY AND SLING TV DOES NOT WARRANT OR GUARANTEE THE AVAILABILITY OR PERFORMANCE OF ANY INTERNET CONNECTIVITY, INCLUDING THE SPEED, BANDWIDTH, COMPATIBILITY, SUFFICIENCY, EQUIPMENT, OR DELIVERY OF ANY INTERNET CONNECTION OR THAT ANY CERTAIN INTERNET CONNECTIVITY WILL IMPROVE OUR SERVICE(S). PLEASE BE AWARE THAT CERTAIN OF OUR SERVICES MAY REQUIRE THE USE OF ADDITIONAL DATA, AND THAT ANY INCREASED COSTS, FEES, OR OTHER AMOUNTS DUE TO BE PAID BY YOU AS A RESULT OF ANY INCREASE IN USAGE (E.G., USAGE OF DATA) IN CONNECTION WITH THE SERVICES WILL BE YOUR SOLE RESPONSIBILITY.\n\nD.      SLING TV MAY RECOMMEND OR LIST THE NAMES OF CERTAIN DEVICES PERMITTED FOR USE WITH CERTAIN OF OUR SERVICES, BUT YOU HEREBY AGREE AND UNDERSTAND THAT SLING TV DOES NOT TAKE ANY RESPONSIBILITY WHATSOEVER FOR AND SLING TV DOES NOT WARRANT THE PERFORMANCE OF ANY DEVICE OR GUARANTEE THAT SUCH DEVICE (OR THE APPLICABLE OPERATING SYSTEM OR VERSION) WILL BE (OR REMAIN) COMPATIBLE WITH ANY OF OUR SERVICES. YOU MAY ONLY USE OUR SERVICES ON PERMITTED DEVICES.\n\nE.      WE HEREBY DISCLAIM ANY, AND YOU AGREE THAT WE HAVE, NO OBLIGATION WHATSOEVER TO REPLACE OR SUPPLEMENT ANY SERVICES, PACKAGE OF SERVICES, OR PORTION OF ANY SERVICE(S) THAT WE CHANGE. WE ARE NOT OBLIGATED, AND YOU ARE NOT ENTITLED AND HEREBY WAIVE ANY RIGHT, TO ANY CREDIT, REFUND, PRICE ADJUSTMENT, OR ANY OTHER DISCOUNT, COMPENSATION OR RECOMPENSE FOR ANY AMOUNT PAID BY YOU TO RECEIVE REPLACEMENT, SUPPLEMENTAL OR ALTERNATE SERVICES, PACKAGES OF SERVICES AND/OR POTION OF SERVICES AS A RESULT OF ANY CHANGE.\n\nF.      ANY MEDIA, SOFTWARE, OR OTHER MATERIAL OR CONTENT DOWNLOADED, STREAMED OR OTHERWISE OBTAINED THROUGH USE OF OUR SERVICES IS DONE AT YOUR OWN DISCRETION AND RISK. YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR TELEVISION, RECEIVER, DEVICE OR OTHER HARDWARE, OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD, STREAMING OR OBTAINING OF ANY SUCH MEDIA, SOFTWARE OR OTHER MATERIAL OR CONTENT. NEITHER SLING TV NOR ANY OTHER CONTRIBUTOR ASSUMES ANY RESPONSIBILITY, AND WILL NOT BE LIABLE FOR ANY DAMAGES TO, OR VIRUSES THAT MAY INFECT, CORRUPT, OR OTHERWISE HARM ANY OF YOUR PROPERTY OR THE PROPERTY OF ANY THIRD PARTY, INCLUDING YOUR SOFTWARE, DEVICE OR OTHER HARDWARE.\n\nG.      NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM SLING TV OR THE OTHER CONTRIBUTORS, OR VIA YOUR MEMBERSHIP ACCOUNT OR USE OF THE SERVICES WILL CREATE ANY WARRANTY NOT EXPRESSLY STATED IN THESE TERMS OF USE.\n\n\n\nSection 9: LIMITATION OF LIABILITY\n\nA. Indirect Damages.YOU EXPRESSLY UNDERSTAND AND AGREE THAT NEITHER SLING TV NOR ANY OTHER CONTRIBUTORS WILL BE LIABLE TO YOU FOR ANY INDIRECT OR CONSEQUENTIAL DAMAGES (E.G., INCIDENTAL, SPECIAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY OR OTHER INDIRECT DAMAGES, DAMAGES FOR LOSS OF PROFITS, GOODWILL, USE, DATA, OR OTHER INTANGIBLE LOSSES EVEN IF SLING TV OR ANY OF SUCH OTHER CONTRIBUTORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES) ARISING FROM, OR OTHERWISE RESULTING DIRECTLY OR INDIRECTLY FROM: (i) USE OF ANY OF OUR SERVICES; (ii) ACTIONS, OMISSIONS, AND OTHER ACTIVITY UNDER YOUR MEMBERSHIP ACCOUNT (INCLUDING USE NOT AUTHORIZED BY US); (iii) THE PERFORMANCE OR NON-PERFORMANCE OF OUR SERVICES; OR (iv) THE INSTALLATION, MAINTENANCE, REMOVAL, OR TECHNICAL SUPPORT OF OUR SERVICES, EVEN IF SUCH DAMAGES RESULT FROM THE NEGLIGENCE OR GROSS NEGLIGENCE OF SLING TV OR THE OTHER CONTRIBUTORS.\n\nB. Force Majeure.NEITHER SLING TV NOR ANY OTHER CONTRIBUTORS WILL BE LIABLE TO YOU FOR ANY FAILURE TO PERFORM THAT IS CAUSED BY OR OTHERWISE RESULTS FROM ANY ACTS OF GOD, FIRES, EARTHQUAKES, FLOODS, POWER OR TECHNICAL FAILURE, SERVER, INTERNET, SATELLITE OR UPLINK FAILURE, ACTS OF ANY GOVERNMENTAL BODY, OR ANY OTHER CAUSE BEYOND OUR REASONABLE CONTROL.\n\nC. Limitation of Liability.IN ADDITION TO ANY OTHER LIMITATIONS SET FORTH IN THESE TERMS OF USE, NEITHER SLING TV NOR THE OTHER CONTRIBUTORS, WILL BE LIABLE FOR ANY ADDITION, DELETION, REARRANGEMENT, ALTERATION, INTERRUPTION, CHANGE AND/OR ELIMINATION IN ANY SERVICES OR FOR ANY DELAY, FOR THE AVOIDANCE OF DOUBT, INCLUDING: (i) IF SUCH ADDITION, DELETION, REARRANGEMENT, ALTERATION, INTERRUPTION, CHANGE AND/OR ELIMINATION, OR DELAY ARISES IN CONNECTION WITH THE TERMINATION OR SUSPENSION OF SLING TVS ACCESS TO ALL OR ANY PORTION OF OUR SERVICES FOR ANY REASON WHATSOEVER; (ii) THE RELOCATION OF ALL OR ANY PORTION OF OUR SERVICES TO DIFFERENT SERVER(S); (iii) ANY ADDITION, DELETION, REARRANGEMENT, ALTERATION, INTERRUPTION, CHANGE AND/OR ELIMINATION IN THE FEATURES AND/OR FUNCTIONALITY AVAILABLE WITH YOUR PERMITTED DEVICE(S) OR OUR SERVICES; (iv) ANY SOFTWARE OR OTHER DOWNLOADS INITIATED BY US OR OUR CONTRIBUTORS; OR (v) ISSUES RESULTING FROM YOUR DEVICE OR INTERNET CONNECTION, INCLUDING, LACK OF SUFFICIENT BANDWIDTH. FURTHERMORE, NONE OF SLING TV, ITS PROVIDERS, DEVICE PROVIDERS OR SERVICE PROVIDERS, OR ANY OF ITS OR THEIR THIRD-PARTY LICENSORS WILL BE LIABLE FOR ANY ADDITION, DELETION, REARRANGEMENT, ALTERATION, INTERRUPTION, CHANGE AND/OR ELIMINATION OF OR TO ANY DEVICE(S), FOR THE AVOIDANCE OF DOUBT, INCLUDING REMOVING OR DISABLING SOFTWARE, FEATURES AND/OR FUNCTIONALITY.\n\nD. Limitation of Direct Damages.EXCEPT AS SPECIFICALLY AND EXPRESSLY SET FORTH IN SECTION 11, THE MAXIMUM AGGREGATE LIABILITY OF SLING TV FOR ANY AND ALL CLAIMS UNDER OR RELATING TO EACH: (i) MEMBERSHIP ACCOUNT INCLUDING ALL AUTHORIZED USERS THERE UNDER (IF MORE THAN 1 IS PERMITTED BY US), or (ii) YOU ONLY, IF YOU ARE NOT AN AUTHORIZED USER UNDER ANY MEMBERSHIP ACCOUNT, IS LIMITED TO AN AMOUNT EQUAL TO THE AGGREGATE OF THE FEES THAT WERE PAID BY YOU UNDER THESE TERMS OF USE DURING THE 6 MONTHS BEFORE THE APPLICABLE CLAIM, OR IF DURING THE FIRST 6 MONTHS OF ANY ACCESS OR USAGE TERM, THEN THE FIXED FEES TO BE PAID BY YOU UNDER SUCH TERMS OF USE DURING THE FIRST 6 MONTHS OF SUCH USAGE TERM.\n\nE. Applicability.SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES OR THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES. ACCORDINGLY, SOME OF THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU, BUT ONLY TO THE EXTENT SUCH LIMITATIONS ARE EXPRESSLY DISALLOWED UNDER THE APPLICABLE LAW(S).\n\nSection 10: INDEMNIFICATION\n\nYou hereby agree to indemnify, defend and hold Sling TV and its parents and affiliates, each of its and their present and future media providers, device providers, business partners, service providers, licensors, contractors, subcontractors, authorized distributors, authorized subdistributors, authorized retailers, directors, members, managers, officers, agents, employees, and other Users, and each of their respective assigns, heirs, successors, and legal representatives (the Protected Group) harmless from, against and with respect to any and all actions, claims, disputes or demands, including reasonable attorneys fees and costs, that are incurred in connection with, arising out of or relating to access to or use of our Services by you or in connection with your Membership Account including any User thereof, your connection to our Services, your devices, your violation of these Terms of Use or your violation of any rights of another User.\n\n\n\nSection 11: DISPUTE RESOLUTION, ARBITRATION AGREEMENT AND CLASS ACTION WAIVER\n\nA. Mandatory Binding Arbitration and Class Action Waiver.Subject the provisions of this Section 11 below, if you access or use any of our Services, then you and Sling TV hereby agree that any and all past, present and future disputes, claims, actions or other controversies arising out of or relating in any way to our Services, these Terms of Use and/or your relationship with the Protected Group except any Dispute relating to the enforcement of Sling TVs, its affiliates or any of the Protected Groups intellectual property rights and without limiting our and your rights to resolve disputes using various informal dispute resolutions (e.g., pursuant to Section 5.E. above) (each, a Dispute) will be determined exclusively on an individual (non-class) basis by binding arbitration or, within the scope of its jurisdiction, in small claims court. Arbitration is more informal than a lawsuit in court. Arbitration uses a neutral arbitrator instead of a judge or jury, allows for more limited discovery than in court, and is subject to very limited review by courts under the U.S. Federal Arbitration Act (FAA). Use of a neutral arbitrator is designed to provide you and us with a fair proceeding. Arbitrators may award the same damages and relief that a court may award, and judgment on any such award may be entered in any court of competent jurisdiction. YOU HEREBY ACKNOWLEDGE YOUR UNDERSTANDING AND AGREE THAT BY ACCEPTING THESE TERMS OF USE AND THE ARBITRATION PROVISIONS HEREIN, THE FAA WILL GOVERN THE INTERPRETATION AND ENFORCEMENT OF THIS PROVISION, AND THAT YOU AND SLING TV AGREE THAT, BY ENTERING INTO THIS AGREEMENT, YOU AND SLING TV ARE EACH HEREBY IRREVOCABLY WAIVING THE RIGHT TO A TRIAL BY JURY AND THE RIGHT TO PARTICIPATE IN ANY CLASS OR REPRESENTATIVE ACTION IN CONNECTION WITH ANY DISPUTE BETWEEN US. YOU AND SLING TV ALSO AGREE THAT ANY ARBITRATION CONDUCTED HEREUNDER WILL BE BROUGHT ONLY ON AN INDIVIDUAL BASIS, AND WILL NOT BE BROUGHT OR PROCEED ON BEHALF OF A CLASS OR IN A REPRESENTATIVE CAPACITY. A Dispute includes those based in contract, any applicable current or future federal, state, local or international law, statute, rule, or government or quasi-government order or action or regulation, tort (including fraud, misrepresentation, fraudulent inducement, negligence, willful misconduct or any other intentional tort) or any other legal or equitable theory. The meaning of Dispute is to be interpreted to have the broadest possible meaning permitted by law, and will only be modified to the extent necessary to be legal, binding and no longer in conflict with any law as further provided in Section 11.B. below. For example only, Disputes also include your billing disputes, claims involving or relating to telephone calls, direct marketing, advertisements or electronic communications that you claim you received from Sling TV and/or a party acting on our behalf or any actions or other controversies in connection with our Privacy Policy.\n\nB. Dispute Resolution.If a Dispute arises and you or we wish to seek arbitration or file any action in small claims court, then the party wishing to seek arbitration or file an action must first send to the other party, by certified mail, notice of the applicable Dispute (Dispute Notice), and you and Sling TV hereby agree to attempt to resolve any such Dispute through informal dispute resolution for at least 60 days following the date on which the applicable Dispute Notice is properly sent. You and we must download or copy the form for yourDispute Notice by clicking here, which form of Dispute Notice must include a written statement that sets forth: (i)the name, address and preferred contact information of the party giving the notice; (ii) a description of the nature and basis of the applicable Dispute; (iii) the facts giving rise to such Dispute; and (iv) the specific relief sought by you in connection therewith. You must send, any and all Dispute Notice(s) to: Sling TV L.L.C., Attn: Office of the General Counsel, 9601 South Meridian Boulevard, Englewood, Colorado 80112 (Notice Address), by certified mail; and we must send any Dispute Notice to you at the contact information we have for you (e.g., to your Membership Account, the email address you provided to register your Membership Account or your billing address). If we and you do not agree to a resolution of a Dispute during the required informal dispute resolution period above, then either party may commence arbitration or a small claims court proceeding in accordance with this Section 11 to resolve such Dispute. To initiate arbitration proceedings the party seeking such arbitration must open a case by filing with the American Arbitration Association (AAA) a demand for such arbitration, paying the administrative filing fee and providing a copy of the applicable arbitration agreement (collectively, the Demand for Arbitration); you will only be responsible for paying an arbitration initiation fee equal to the amount that you would pay to file a lawsuit against us in the appropriate court of law in your state, not to exceed $125.00, and we will pay any excess fees or deposit(s) required to initiate such arbitration proceeding. If you are entitled to reimbursement pursuant to this Section 11 and would like us to reimburse you for the actual amount of fees paid by you to initiate an arbitration proceeding, then you must send written notice to Sling TV at the Notice Address, by certified mail, of: (a) the amount requested; (b) the name of the payee; (c) the return address for the payment; and (d) a copy of the receipt or other documentation evidencing the amount paid by you. You must download or copy a form to initiate arbitrationwww.adr.org. A Demand for Arbitration must be made through AAA WebFile, atwww.adr.org, or by filing such demand with any AAA office, regardless of the intended location of the requested proceeding. During the arbitration, the amount of any settlement offer made by us or you may not be disclosed until after the arbitrator determines the amount, if any, to which you or we are entitled in connection with the applicable Dispute.\n\nC. Arbitration Procedures and Forum.All arbitration proceedings will be administered by the AAA and governed under itsConsumer Arbitration Rules (including any amendments thereto or successor rules thereof published by the AAA) (collectively, the AAA Rules), as supplemented and modified by these Terms of Use. The AAA Rules are available online atwww.adr.org, by calling the AAA at1 (888)-309-0838, by clicking the hyperlinks above. The arbitrator will be bound by the terms and conditions of these Terms of Use. Subject only to the limited exceptions expressly set forth in this Section 11, the arbitrator, and not any federal, state or local court, agency or other authority, will have the exclusive authority to resolve any and all Disputes, including issues relating to the scope, interpretation, applicability and enforceability of this arbitration agreement (e.g., any claim that all or any part of these Terms of Use (including, for example, this Section 11) is void or voidable). Unless you and Sling TV agree otherwise, any arbitration hearing will be held in the county (or parish) of your billing address or if no billing address is provided, then of your primary residence.\n\nD. Costs of Arbitration; Compelling Arbitration.Subject to the exceptions expressly set forth in this Section 11, if you or we decide to initiate arbitration and seek less than $75,000 in damages, then we will pay all costs and fees of the applicable arbitration proceeding for any such proceeding initiated in accordance with the notice requirements unless the arbitrator finds that the arbitration was brought for an improper purpose; and if you or we initiate any arbitration proceeding seeking more than $75,000 in damages, then the payment of such costs and fees will be governed by the applicable AAA Rules. Except as otherwise expressly permitted pursuant to Section 11, if either party attempts to have a Dispute reviewed by a court (e.g., files a judicial or administrative action asserting a claim that is subject to arbitration), and the other party successfully compels arbitration of the applicable Dispute, then the party attempting (or that attempted) to have such Dispute reviewed by such court in violation of these Terms of Use must pay the other partys costs and expenses incurred in seeking to compel arbitration, including reasonable attorneys fees.\n\nE. Class Action Waiver.NEITHER YOU NOR WE SHALL BE ENTITLED TO JOIN OR CONSOLIDATE CLAIMS BY OR AGAINST OTHER INDIVIDUALS OR ENTITIES, OR ARBITRATE ANY CLAIM AS A REPRESENTATIVE MEMBER OF A CLASS OR IN A PRIVATE ATTORNEY GENERAL CAPACITY IN CONNECTION WITH ANY DISPUTE (AS DEFINED ABOVE). Further, unless both you and Sling TV specifically agree otherwise in writing, the arbitrator may not consolidate more than one persons claims, and may not otherwise preside over any form of a representative or class proceeding. The arbitrator may award relief only in favor of the individual party seeking relief and only to the extent necessary to provide relief warranted by that individual partys individual claim. In the event that this Section 11.E. or any other material provision of this Section 11 is held to be unenforceable, void or voidable, then Section 11 in its entirety will be void, ab initio.\n\nF. Rights to Opt-Out.If you do not wish to be bound to resolve all Disputes exclusively through arbitration proceedings and small claims courts as set forth in Section 11, then you must notify Sling TV in writing within 30 days following the date on which you initially accept our then-current terms of use for our Services (as further described in Section 1 above (e.g., upon creating a Membership Account)) by sending written notice to Sling TV at the Notice Address, by certified mail, of your election to reserve arbitration as a non-exclusive means of resolution of Disputes (Opt-Out Notice). You must download or copy a form for yourOpt-Out Notice by clicking here, which Opt-Out Notice must include a written statement that sets forth: (i) your name; (ii) your address; (iii) your Membership Account number (if any); and (iv) a clear statement that you do not wish to resolve all Disputes with Sling TV exclusively through arbitration. Please be aware that your decision to provide us with an Opt-Out Notice will automatically terminate any obligation that Sling TV would have had to resolve disputes exclusively through arbitration (i.e., any Opt-Out Notice will remove the applicable obligations from both parties), and constitutes a waiver of any financial amounts that would have been paid by us in connection with arbitration proceedings as provided in this Section 11. Your delivery of an Opt-Out Notice to us will not result in our termination of your access or use of our Services, and we will not provide you Services inferior to other Authorized Users, or otherwise adversely affect the Services we provide, as a result of our receipt of an Opt-Out Notice from you. Your right to reserve arbitration as an alternative means of resolution of Disputes rather than an exclusive one is limited; and any notice requesting to opt-out not received within 30 days following the date on which you first accept these Terms of Use will be void, ab initio, and will constitute your understanding and agreement to resolve all Disputes exclusively through arbitration or small claims court proceedings as described in Section 11.\n\nG. Miscellaneous.Notwithstanding our rights to make future changes to these Terms of Use, if any such future change made by us to the provisions in Section 11 materially limit or alter your then-current rights, then you may reject such changes by sending written notice to Sling TV at the Notice Address, by certified mail, of your rejection of the applicable changes: (i) within 30 days following the date on which we notify you of such modified Terms of Use; or (ii) in the event we do not provide notice of such future change, then within 30 days following the date on which you become aware of such modified Terms of Use. The dispute resolution, binding arbitration and class action waiver agreements and provisions will survive the expiration or earlier termination of your Membership Account, Subscription Services or other access to or use of our Services. Please be aware that this agreement does not preclude you from bringing issues to the attention of federal, state or local agencies, including the Federal Communications Commission, and such agencies can, if the law allows, seek relief against us on your behalf. We also each agree that this agreement evidences a transaction in interstate commerce, and thus the FAA governs the interpretation and enforcement of the provisions and agreements set forth in this Section 11.\n\nSection 12: MISCELLANEOUS\n\nA. Notice.Any notice required or permitted to be given by Sling TV under these Terms of Use may be provided by any reasonable means, including by mail, by publication on thewww.sling.comwebsite, via your Membership Account for our Services (e.g., by sending an electronic message to your Membership Account), by telephone or by e-mail. If we send you notice by mail, it will be considered given the day after it is deposited in the U.S. mail, addressed to you at your physical address of record as then-currently stated in our records. If we send you notice to your personal e-mail or through your Membership Account e-mail, including notice directing you to changes published on our Website, such notice will be considered given upon sending to your e-mail address of record as then-currently stated in our records and associated with your Membership Account or upon sending to your Membership Account. If we give you notice by telephone, it will be considered given when personally delivered to you or when left as a message at your phone number of record as then-currently stated in our records. Unless otherwise specified in these Terms of Use, any notice required or permitted to be given by you under these Terms of Use must be in writing and be sent to Sling TV at the Notice Address, by certified mail; and will be deemed given only when such notice is received by us at the Notice Address. If your name, contact information or other account information is no longer accurate or otherwise changes, then you must promptly access and correct such information associated with your Membership Account as further described under the Your Rights section of ourPrivacy Policy.\n\nB. Entire Agreement.These Terms of Use, including those terms hyperlinked and incorporated herein, constitute the entire agreement between Sling TV and you regarding the subject matter hereof. If you are an existing User of any websites, products or other services provided by our affiliates (e.g., direct broadcast satellite programming services), then your acceptance and agreement to these Terms of Use is independent of, and without modification to, any such other agreement and will not amend, modify or otherwise affect any such relationship governed thereby. With respect to any of our Services, these Terms of Use govern your use of such Services, and supersede any prior agreements or understandings between you and Sling TV with respect to the subject matter hereof. For clarity, if you access, use or purchase our Services from a third party or through any third-party platform (e.g., Services sold by our business partners) or use any third-party device (e.g., PC, Mac, Android, iPhone, Amazon Fire TV, Chromecast, Xbox, Roku or any combination thereof), then their terms and conditions (or other agreements agreed to by you) governing those devices will govern your use of such device and relationship with such third party.\n\nC. Applicable Law.These Terms of Use, including all matters relating to their validity, construction, performance and enforcement, and any claim, complaint or dispute arising out of or related to these Terms of Use, your relationship to Sling TV and/or otherwise related to our Services will be governed by the laws of the State of Colorado without giving effect to its conflict of law provisions. If any provision in these Terms of Use is declared to be illegal, invalid or is otherwise in conflict with any law, then such provision will automatically be considered modified to the minimum extent necessary to make such provision legal, binding and no longer in conflict with such law, without affecting the validity of any other provisions of such Terms of Use, and any and all other provisions will remain in full force and effect to the fullest extent permitted by law.\n\nD. Choice of Forum.You agree that any action at law, in equity, under contract (including under these Terms of Use) or otherwise that is excluded from, or otherwise not subject to arbitration or small claims court must be filed, and that venue properly lies, only in the state or federal courts located in the city and county of Denver, Colorado, United States of America and you hereby irrevocably consent and submit to the personal jurisdiction of such courts for the purpose of litigating such action.\n\nE. Assignment.You agree that Sling TV may assign or otherwise transfer (e.g., sell) your agreement to these Terms of Use with Sling TV to any third party without your prior consent. You may not assign or otherwise transfer (e.g., via the sale of any Permitted Device) any agreement(s) with us without first obtaining our prior written consent, which consent may be withheld, delayed or conditioned for any reason whatsoever (e.g., your Membership Account reflects an outstanding unpaid balance).\n\nF. No Waiver; Remedies Cumulative.Except as otherwise expressly provided in these Terms of Use, the failure of a party to exercise or enforce any right or provision of these Terms of Use will not constitute a waiver of such right or provision. The rights and remedies provided under these Terms of Use to Sling TV in case of your default or breach of these Terms of Use are cumulative and without prejudice to any other rights and remedies that Sling TV or you may have at law, in equity, under contract (including under these Terms of Use) or otherwise, all of which are hereby expressly reserved.\n\nG. No Third-Party Beneficiaries; Claim Limitation.You agree that, except as otherwise expressly provided in these Terms of Use, there are no third party beneficiaries to your agreement to these Terms of Use. You agree that regardless of any law to the contrary, any claim, Dispute or cause of action by you arising out of or related to our Services pursuant to these Terms of Use must be filed within 1 year following the date on which such claim, Dispute or cause of action arose; and if not filed within such 1-year period, then you hereby irrevocably waive any and all rights to pursue such claim(s), Disputes or other cause(s) of action.\n\nH. Headings.The section titles and paragraph headings in these Terms of Use are for convenience only and have no legal or contractual effect. Any and all examples or references to include, includes or including set forth in these Terms of Use are by way of example only and will be interpreted as non-limiting. Any reference in these Terms of Use to the singular form of a word will include the plural form of the word, if applicable, and any reference to the plural will include the singular, if applicable. In addition, the term days when used in these Terms of Use, unless specified as a business day means a calendar day. For the purposes of these Terms of Use, a business day means a weekday (other than a Saturday or a Sunday) excluding any national (United States) holiday.\n\nI. Survival.Any provision of these Terms of Use that logically would be expected to survive the suspension, completion, expiration or earlier termination of your Membership Account, Subscription Services and/or other Services or your agreement to these Terms of Use will survive such suspension, completion, expiration or earlier termination, including any and all representations and warranties contained in these Terms of Use and any and all provisions and agreements regarding indemnification obligations, confidentiality obligations, dispute resolution, binding arbitration and class action waivers, the Miscellaneous provisions in this Section 12, limitations of liability and disclaimers.\n\n* * * * * * *\n\n\n\nUse of the Sling TV services and this Website constitutes acceptance of ourTerms of UseandPrivacy Policy. See our Free Trial Offer Details, Credits, and DMCA Policy.\n\nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n \nSocial Media Icon\n\n 2020 Sling TV L.L.C. All rights reserved.\n\nU.S. Patent Nos. 7,818,444; 8,402,156; 8,612,624; 8,868,772; 9,071,668; 9,407,564; 9,571,551; 9,998,516; 10,225,304; 10,469,554; and 10,469,555\n\napply to Sling TVs streaming services offered through all available Sling TV applications and platforms.\n\nSling TV and the Sling TV Logo are Licensed Trademarks of Sling TV L.L.C.\n\nESPN and ESPN2 are registered trademarks of ESPN, Inc. Disney. All Rights Reserved.\n\nSEC ESPN Network is a trademark of ESPN, Inc. All rights reserved.\n\nEPIX is a registered trademark of Studio 3 Partners LLC.\n\nGoogle and Google Nest Hub are trademarks of Google LLC.\n\nAll trademarks are the property of their respective owners.", "Space Required": "49.3 MB"}



["5 stars\n19%\n4 stars\n0%\n3 stars\n14%\n2 stars\n5%\n1 star\n62%", "mgruenes9 hours ago\nDoesn't work\n\nCan't get past login screen\n\nHelpful | 0", "Gary9364Feb 27 at 9:47 PM\nAbsolute Junk\n\nWhat fool at Sling TV decided this should have been released? They should be ashamed. It doesn't even allow me to log in to my Sling account!!! I just get a message that says, \"Technical difficulties, please try again later.\"\n\nHelpful | 33", "MacedaRybalkaJan 30 at 7:20 PM\nDoesnt work at all!\n\nDoesnt work at all!\n\nHelpful | 8", "MrXiroOct 28 at 8:33 PM\nNever been updated\n\nThis app has not been updated since release and it has been broken since then too. Cant watch cloud DVR, cant record, barely functional. I love sling but this is unacceptable at this point. Why even release an app if youre going to abandon it immediately?\n\nHelpful | 39", "jbecknellAug 16, 2019 at 11:11 PM\nNot optimized\n\nLike that it's on the quest, but as the other reviewer said, it needs to be tweeked to be fully functional. I can't see my recorded shows yet on the dvr.\n\nHelpful | 11", "elimcewen23Aug 3, 2019 at 9:38 AM\nWorthless\n\nNothing is adjustable, no environments, ads galore that you can't skip for 20$ a month. Virtual desktop takes a giant 10 thousand pounds sht on this garbage\n\nHelpful | 9", "jojasJun 1, 2019 at 9:37 AM\nDoesn't work\n\nI followed all directions and can't save any favorite channels or shows. I keep getting error 9-300.\n\nHelpful | 13", "RobOh77May 21, 2019 at 8:41 PM\nErrors loading favorites and DVR shows\n\nI think Sling still has some tweaking to do, but upon sign in there were a few errors signing in and accessing favorites and my recordings. I really do like my Sling service, but the devs really need to tweak the app for better functionality.\n\nHelpful | 12", "darwins.lastMay 23, 2019 at 7:11 PM\nFlawless\n\nGreat definition and experience. My go to for watching now.\n\nHelpful | 4"]