{"App Title": "Space Pirate Trainer - Demo", "App description": "Space Pirate Trainer is the official trainer for wannabe space pirates. \n\nRemember those awesome classic arcade cabinets? Imagine if those were immersive... Space Pirate Trainer puts you in one of those; fighting off relentless waves of droids with all the weapons and gadgets you would ever need as a space pirate. You better dodge some of those incoming lasers, though, since just using your shields won't get you in the top rankings. Pick up your blasters, put on your sneakers, and dance your way into the Space Pirate Trainer hall of fame. \n\nTake a sneak peak of the gameplay with this demo experience.", "Purchase section": "FreeView Full VersionAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade", "Languages": "English", "Version": "1.62", "Developer": "I-Illusions", "Publisher": "I-Illusions", "Website": "http://spacepiratetrainer.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "1.02 GB"}



["5 stars\n79%\n4 stars\n14%\n3 stars\n0%\n2 stars\n7%\n1 star\n0%", "DuncstarJul 9 at 9:38 PM\nSuch an exciting game.\n\nIf you're gonna show off your Quest at work or to your mates this is the one. Easy arcade action, intuitive controls and no tricky learning curve - just instantly gets you ducking and shouting and sweating! I love it, my son loves it, all his mates love it. just so frikin fun! Best game on the Quest for me (I didn't enjoy Beat Sabre at all).\n\nHelpful | 0", "KeyboardDemonSep 1, 2019 at 4:18 AM\nA Must try Demo\n\nI got this Demo after I the full game and really got a lot from the tutorial in the Demo, it's a great way to learn about the full game and to try out some of the things that you can do in the full game. Even if you have the full game and haven't tried the demo, get this it's free, you can always get a refund if you don't like it as much as I do.\n\nHelpful | 2", "Ender772Jun 13, 2019 at 2:35 PM\nBest game on the quest\n\nI have played this game as much as beatsaber. We need more arcade style games such as these. The weapon selection really makes it worth while. I wish that when I change weapons time would slow down. But maybe they will read this review and add it in. But after playing it enough it becomes 2nd nature. Honestly after playing this that robot unplugged game looks too slow and boring....oh and guys you do realize you can change how the gun aims in the options.\n\nHelpful | 4", "toafJul 6, 2019 at 2:24 AM\njust BUY it\n\nthis game is one of coolest thing since sliced bread.. just make a guardian, start the game,and give the quest to a friend that doesn't have one. put the headset on them and tell them to walk into the fenced area.\n\nHelpful | 0", "TsuyoiRaionMay 26, 2019 at 10:32 PM\nBoom boom!\n\nAnother shooter game but this time, slow motion and shields! Was definitely cool to mix things up and start getting a challenge near the end of the demo but as someone else mentioned the gun firing is a bit off alignment.\n\nI think this is simply due to the gun design and where the bullets fire from, not actually the alignment itself, so it's somewhat understandable and not super hard to adjust to over time.\n\nEnticed enough to possibly check out the full version but hoping there's a bit more than just shoot shoot, block, shoot. Guess we shall see :D\n\nHelpful | 0", "el_jergasMay 24, 2019 at 7:41 PM\nFun\n\nIts the first time Im doing VR. I knew that Space Pirate was a game from the first beginnings of VR. It holds up well though. A lot of aliasing with the aircraft though.\n\nHelpful | 2", "inceptionalMay 23, 2019 at 5:57 AM\nThe guns are aligned totally incorrectly\n\nDudes, in real life hold your hand up in front of you as if you're firing an imaginary gun, then point your finger forward so it's aiming straight ahead exactly where you want to aim like it's the barrel of a gun. . . .\n\nNow go into your game, hold the virtual gun in the position/angle the game is forcing people to aim as \"straight ahead\", and then naturally stretch your index finger out in real life and check to see if it is in the same direction/alignment as your in-game gun barrel. . . .\n\nYou'll notice that what you think is aiming straight ahead in your game actually means your straightened out index finger in real life is pointing about 30 degrees higher than straight ahead.\n\nYou need to align your in-game gun barrel with where you would be pointing your imaginary gun index finger to aim straight ahead, which is also in line with where a real gun barrel would be when you hold it too (if you actually stretched your finger out to check).\n\nStop trying to align the virtual gun barrel with the physical grip/handle on the Touch controller or something like that, and actually align it with the controller's trigger and where your finger would naturally point straight ahead. Think of the Touch grip/handle as being more like the handle of a sawed-off shotgun* rather than a pistol, because it's at a much shallower angle than any pistol so can't be used as the way to check if you gun/barrel is aligned \"correctly\".\n\n*https://www.surplusstore.co.uk/media/catalog/product/cache/1/image/8e94b9347e01b77eb5544a09ce3e947a/m/a/mad-max-sawn-off-shotgun-1.jpg\n\nI really don't know how so many VR shooting games are getting this so wrong--but until they fix it I've decided I'm going to knock the score way down on any of them where I see this because it's literally one of thee most important things to get right in a shooting game.\n\nWhen you can close your eyes and aim naturally forward and your in-game gun matches exactly the same when you open your eyes again you've done it right. . . .\n\nHelpful | 4\nDeveloper ResponseMay 23, 2019 at 1:45 PM\n\nIn the full version there's an option to select your favorite handle to barrel angle."]