{"App Title": "Spaceteam VR", "App description": "A cooperative and chaotic party game that requires you to shout technobabble at your friends! Play with people on mobile/tablet and with other VR players online. You can also shout at yourself in practice mode. \n\nAttempt to follow randomly generated, incorrectly assigned instructions.\n\nIf your Spaceteam can complete enough instructions successfully in a sector you will progress to the next, each sector becomes increasingly difficult and as the ship becomes harder to control!\n\nFULL VR MULTIPLAYER\nUp to 6 players, connected to the internet, in any popular VR headset join in a coop game of trying to avoid their binding doom.\n\nFACE TO FACE\nUp to 6 players locally with at least one headset and connected smart devices, this offers an experience much like the original Spaceteam game.\n\nSINGLE PLAYER\nIn Practice Mode you will join 2 of our trusty robots!\n\nAnd remember to work together as a Spaceteam!", "Purchase section": "$19.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User, Co-op", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Social, Space/Universe", "Languages": "English", "Version + Release Notes": "1.0", "Developer": "Cooperative Innovations", "Publisher": "Cooperative Innovations", "Website": "http://spaceteamvr.com/", "Release Date": "May 21, 2020", "Developer Privacy Policy": "This website stores cookies on your computer. These cookies are used to collect information about how you interact with our website and allow us to remember you. We use this information in order to improve and customize your browsing experience and for analytics and metrics about our visitors both on this website and other media. To find out more about the cookies we use, see our Privacy Policy.\n\nIf you decline, your information wont be tracked when you visit this website. A single cookie will be used in your browser to remember your preference not to be tracked.\n\nAccept Decline\n\t\nABOUT\nSERVICES\nLICENSING\nIkabod\nVoluMetrics\nGAMES\nSpaceteam VR\nRaiders of Erda\nCAREERS\nSenior UE4 Developer\nQuality Assurance / Assistant Producer\nBLOG\nCONTACT\n\t\n\n\nPRIVACY AND DATA POLICY\n\nISSUED BY COOPERATIVE INNOVATIONS LTD\n\nLast Updated: 19 May 2020\n\n1) INTRODUCTION AND GENERAL TERMS\nThese terms apply to the use of games and other products developed and/or published by Cooperative Innovations Ltd. (Coop / we / us). Our office is at Platform, New Station Street, Leeds, England, LS1 4JB England.\n\n\n\nWe are a company registered in England, with company number 10494498.\n\n\n\nThis privacy and data policy (Privacy Policy) applies and has effect in respect of all games, related online services (including online network play connectivity and interactivity) and other software and products made available by us (together the Game(s)), as well as any other online features relating to the Games, our websites including without limitation, stvr.app, spaceteamvr.com and coopinnovations.co.uk (Website) and any of our online communities (Communities). Together the Game(s), the Website and Communities are referred to herein as the Online Services.\n\nLast Updated: 19 May 2020\n\nIf you have any questions or comments about this Privacy Policy, please contact us at info@coopinnovations.co.uk\n\nWe are committed to protecting and respecting your privacy. This Privacy Policy explains the basis on which personal information we collect from you will be processed by us. Where we decide the purpose or means for which personal data you supply through these Online Services is processed, we are the data controller. We will comply with all applicable data protection laws, including the General Data Protection Regulation 2016/679.\n\nPlease read this Privacy Policy carefully as it contains important information about the following:\n\nWhat information we may collect about you;\nHow we will use information we collect about you;\nWhether we will disclose your details to anyone else; and\nYour choices and rights regarding the personal information you have provided to us.\n\nThis Privacy Policy should be read in conjunction with any other terms which we may from time to time provide via our Website or as part of the Games as made available here: coopinnovations.co.uk/privacy.\n\nThe Online Services may contain hyperlinks to services owned and operated by third parties. These third party services may have their own privacy policies and we recommend that you review them. They will govern the use of personal information that you submit or which is collected by cookies and other tracking technologies whilst using these services. We do not accept any responsibility or liability for the privacy practices of such third party services and your use of these is at your own risk.\n\nWe may make changes to this Privacy Policy in future, which will be posted on this page. You should check this page from time to time to ensure you are aware of any changes. Where appropriate, we may notify you of changes by email or through the Game or Community.\n\n2) INFORMATION WE MAY COLLECT ABOUT YOU\n\nWe collect and process the following information, which may include your personal data.\n\nInformation provided by you when using an Online Service\n(Submitted Information)\nWe will collect personal information from you when you use our Online Service or when you contact us for support:\nThis may include:\n\nYour name;\nYour address, telephone number and email address; and\nYour Steam ID and Steam profile/display name and profile image.\nYour Oculus ID and Oculus profile/display name and profile image.\nYour PlayStation Network ID and profile/display name and profile image.\nYour HTC ID and profile/display name and profile image.\n\nInformation about your gaming and activity\n\n(Analytics)\n\nWe may collect technical information about your use of the Online Services through the use of tracking technologies and analytics.\n\nPersonal data we may collect includes the following:\n\nyour IP address and MAC address;\ndevice information (e.g. device identifier and browser)\ngame results, game activities, progress and timings; and\npage usage (e.g. buttons clicked, screens viewed).\n\nThis also includes the use of cookies more details of which can below.\n\nWe may also collect technical information to help us understand how you use our Online Services, and how often, so we can improve them to deliver a better experience for our users. To carry out research and statistical analysis to help improve our content, products and services.\n\nThe information we obtain from our use will not usually contain your personal data.\n\nAlthough we may obtain information about your device such as your IP address, your browser and/or other internet log information, this will not identify you personally.\n\nOur Online Services should display a notice alerting you to this use and requesting your acceptance. If you accept, you will be accepting our use of the Analytics or similar technologies for the purposes described in this privacy policy.\n\nPlease note that if you choose to disable Analytics on your device you may be unable to make full use of our Online Services.\n\nCookies\nA cookie is a text file placed onto your device when you access the Online Services or Website. We use cookies and other online tracking devices such as web beacons, and flash object storage to deliver, improve and monitor our Online Services, including in the following ways. Where you have opted out of cookies the only cookie we will place is one to remember you and that you have opted out.\n\nCookie Name\tDomain\tVendor\tPurpose\tCategory\nAWSELB\tapp.hubspot.com\tAmazon\tAWS Elastic Load Balancer\tPerformance\nFacebook Pixel\tFacebook.com\tFacebook\tMarketing\tTargeting\n__utma\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmb\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmc\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmz\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n_gauges_unique_hour\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_day\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_month\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_year\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique\thubspot.com\tGauges\tGauges Analytics\tPerformance\napex__product\thubspot.com\tSalesforce\tSalesforce Analytics\tStrictly Necessary\n__hstc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\n__hssrc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\n__hssc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\nhsPagesViewedThisSession\thubspot.com\tHubSpot\tHubSpot Analytics\tStrictly Necessary\nhubspotutk\thubspot.com\tHubSpot\tHubSpot Analytics\tStrictly Necessary\nhubspot.hub.id\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauth\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauthcms\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauthremember\thubspot.com\tHubSpot\tHubSpot Authentication\tFunctionality\n_hs_opt_out\thubspot.com\tHubSpot\tOpt out of HubSpot tracking\tStrictly Necessary\nhubspotutktzo\tacademy.hubspot.com\tHubSpot\tTime Zone Offset\tFunctionality\n__hluid\thubspot.com\tHubSpot\tIn-app usage tracking\tTargeting\nmp_id_mixpanel\thubspot.com\tMixpanel\tIn-app usage tracking\tTargeting\n__cfduid\thubspot.com\tCloudflare\tDetection of malicious actors\tStrictly Necessary\n__cfruid\thubspot.com\tCloudflare\tRate limiting policies\tStrictly Necessary\n\nInformation about you collected from third parties\n\n(Content Information)\n\nWe may collect information which you make available to us via your social media profiles, including your Steam account, your Oculus account, your PlayStation Network account, your HTC account, your Facebook account or other social media accounts.\n\n3) WHY WE COLLECT INFORMATION ABOUT YOU\n\nTo provide the Games to you\n\nTo enable operation of the Game\n\nWe will use information about you (including Submitted Information and Analytics) to deliver our Games to you under the terms of use agreed between us. The processing of information in this way is necessary for us to record your progress and current status within a Game, and to ensure the Games deliver the features promised and function properly.\n\nIn order to enable us to operate the Games in an effective manner we use a company called Playfab, Inc. to process your data and you can find out more about how Playfab processes personal information here.\n\nhttps://playfab.com/privacy/\n\nTo provide the Communities\n\nCertain Content Information and Submitted which you supply through our Online Service will be shared with other users of the Online Service. In some cases you may be able to select specific recipients (for example if you are sending a forum post, or a private message, to a particular forum or individual) then only those recipients will receive it, however in all other cases, your information may be made publically available.\n\nTo respond to your enquiries and requests for support\n\nWe may process Submitted Information and Content Information so that we are able to properly respond to your enquiries and support requests, in accordance with the terms of use agreed between us.\n\nTo keep you up to date\n\nWe use your Submitted Information to send you emails in order to keep you informed of news and products. To do these we use Mailchimp. You can find out more about how they process personal data here:\n\n\n\nhttps://mailchimp.com/legal/privacy/\n\n4) DATA SHARING\n\nWe will share your information with third parties only in the ways that are described in this Privacy Policy\n\nGroup members, personnel, suppliers or subcontractors: We keep your information confidential, but may disclose it to any member of our group (which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 of the Companies Act 2006), our personnel, suppliers or subcontractors insofar as it is reasonably necessary for the purposes set out in this Privacy Policy. However, this is on the basis that they do not make independent use of the information, and have agreed to safeguard it.\n\nMerger or acquisition: If we are involved in a merger, acquisition or sale of all or a portion of our assets, you will be notified via email, account message and/or a prominent notice on our website of any change in ownership or uses of this information, as well as any choices you may have regarding this information.\n\nRequired by law: In addition, we may disclose your information to the extent that we are required to do so by law (which may include to government bodies and law enforcement agencies); in connection with any legal proceedings or prospective legal proceedings; and in order to establish, exercise or defend our legal rights (including providing information to others for the purposes of fraud prevention).\n\nEnforcement: We may also disclose your personal information to third parties in order to enforce or apply the terms of agreements, to investigate potential breaches or to protect the rights, property or safety of Coop, our customers or others.\n\nDigital Content Stores: The Game is made available to download via Steam and we may disclose your personal information to Steam for the purposes of making the Game available and facilitating any in-Game payments made through Steam.\n\n5) CONSUMER CONTROL AND OPT-OUT OPTIONS\n\nWhere you have linked your Steam account to any of your social media accounts, you can unlink these at any time by adjusting your settings in Steam. You can also remove access in your social media settings. If you are using an iOS device, you can opt out of personalised adverts by visiting https://oo.apple.com\n\nWe will obtain your consent to collect your information to be used for marketing purposes. If you prefer that we do not use your data in this way, let us know by writing to info@coopinnovations.co.uk or by checking boxes on the forms we use to collect your data.\n\n6) YOUR RIGHTS IN RELATION TO PERSONAL DATA WHICH WE PROCESS RELATING TO YOU\n\nYou have the following rights over the way we process personal data relating to you, as set out in the table below. We aim to comply without undue delay and within one month at the latest.\n\nTo make a request, please let our Data Protection Officer know via info@coopinnovations.co.uk\n\nAsk for a copy of data we are processing about you and have inaccuracies corrected\n\nYou have the right to request a copy of the personal information we hold about you and to have any inaccuracies corrected.\n\nWe will use reasonable efforts to the extent required by law to supply, correct or delete personal information held about you on our files (and with any third parties to whom it has been disclosed to).\n\nObject to us processing data about you\n\nYou can ask us to restrict, stop processing or delete your personal data if:\n\nyou consented to our processing the personal data and have withdrawn that consent;\nwe no longer need to process that personal data for the reason it was collected;\nwe are processing that personal data because it is in the public interest or it is in order to pursue a legitimate interest of Coop or a third party, you dont agree with that processing and there is no overriding legitimate interest for us to continue processing it;\nthe personal data was unlawfully processed;\nyou need the personal data to be deleted in order to comply with legal obligations;\nthe personal data is processed in relation to the offer of a service to a child.\n\nYou can delete your accounts by following the instructions in your account settings.\n\nObtain a machine-readable copy of your personal data, which you can use with another service provider\n\nIf (i) we are processing data in order to perform our obligations to you or because you consented and (ii) that processing is carried out by automated means, we will help you to move, copy or transfer your personal data to other IT systems.\nIf you request, we will supply you with the relevant personal data in CSV format. Where it is technically feasible, you can ask us to send this information directly to another IT system provider if you prefer.\n\nMake a complaint to a Supervisory Authority\n\nIf you are unhappy with the way we are processing your personal data, please let us know by contacting us via the support services.\nIf you do not agree with the way we have processed your data or responded to your concerns, an alternative is to submit a complaint to a Data Protection Supervisory Authority.\n\n7) Data Retention\n\nWe will only retain your personal information for as long as necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, accounting or reporting requirements.\n\n8) CHILDREN\n\nWe do not use our Online Services to knowingly solicit information from, or market to, children under the age of 13. Our terms of use prohibit users aged under 13 years from accessing our Online Services. In the event that we learn that we have collected personal information from a child under 13 years of age, we will delete that information as quickly as possible. If you believe that we might have any information from or about a child under 13 years of age, please contact us at info@coopinnovations.co.uk\n\n9) Security\n\nOnce we have received your information, we will use strict procedures and security features to try to prevent unauthorised access. Unfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal data, we cannot guarantee the security of your data transmitted through our Online Services; any transmission is at your own risk\n\n10) INTERNATIONAL DATA TRANSFERS\n\nThe data we collect from you may be transferred to, and stored at, a destination outside the European Economic Area (EEA). It may also be processed by staff that operate outside the EEA and work for us or our suppliers. These staff may be engaged in the fulfilment of your orders, the processing of your payment details, the maintenance of the Service, and the provision of support services. By submitting your personal data, you agree to this transfer, storing or processing. We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy.\n\nCONTACT INFORMATION\n\nAll questions, comments or enquiries should be directed to Coop at info@coopinnovations.co.uk. We will endeavour to respond to any query or questions within two business days.\n\n 2020 Cooperative Innovations Ltd. All trade marks are the property of the relevant owners. All rights reserved.\n\n\n\n 2020 Cooperative Innovations. All rights reserved", "Developer Terms of Service": "This website stores cookies on your computer. These cookies are used to collect information about how you interact with our website and allow us to remember you. We use this information in order to improve and customize your browsing experience and for analytics and metrics about our visitors both on this website and other media. To find out more about the cookies we use, see our Privacy Policy.\n\nIf you decline, your information wont be tracked when you visit this website. A single cookie will be used in your browser to remember your preference not to be tracked.\n\nAccept Decline\n\t\nABOUT\nSERVICES\nLICENSING\nIkabod\nVoluMetrics\nGAMES\nSpaceteam VR\nRaiders of Erda\nCAREERS\nSenior UE4 Developer\nQuality Assurance / Assistant Producer\nBLOG\nCONTACT\n\t\n\n\nPRIVACY AND DATA POLICY\n\nISSUED BY COOPERATIVE INNOVATIONS LTD\n\nLast Updated: 19 May 2020\n\n1) INTRODUCTION AND GENERAL TERMS\nThese terms apply to the use of games and other products developed and/or published by Cooperative Innovations Ltd. (Coop / we / us). Our office is at Platform, New Station Street, Leeds, England, LS1 4JB England.\n\n\n\nWe are a company registered in England, with company number 10494498.\n\n\n\nThis privacy and data policy (Privacy Policy) applies and has effect in respect of all games, related online services (including online network play connectivity and interactivity) and other software and products made available by us (together the Game(s)), as well as any other online features relating to the Games, our websites including without limitation, stvr.app, spaceteamvr.com and coopinnovations.co.uk (Website) and any of our online communities (Communities). Together the Game(s), the Website and Communities are referred to herein as the Online Services.\n\nLast Updated: 19 May 2020\n\nIf you have any questions or comments about this Privacy Policy, please contact us at info@coopinnovations.co.uk\n\nWe are committed to protecting and respecting your privacy. This Privacy Policy explains the basis on which personal information we collect from you will be processed by us. Where we decide the purpose or means for which personal data you supply through these Online Services is processed, we are the data controller. We will comply with all applicable data protection laws, including the General Data Protection Regulation 2016/679.\n\nPlease read this Privacy Policy carefully as it contains important information about the following:\n\nWhat information we may collect about you;\nHow we will use information we collect about you;\nWhether we will disclose your details to anyone else; and\nYour choices and rights regarding the personal information you have provided to us.\n\nThis Privacy Policy should be read in conjunction with any other terms which we may from time to time provide via our Website or as part of the Games as made available here: coopinnovations.co.uk/privacy.\n\nThe Online Services may contain hyperlinks to services owned and operated by third parties. These third party services may have their own privacy policies and we recommend that you review them. They will govern the use of personal information that you submit or which is collected by cookies and other tracking technologies whilst using these services. We do not accept any responsibility or liability for the privacy practices of such third party services and your use of these is at your own risk.\n\nWe may make changes to this Privacy Policy in future, which will be posted on this page. You should check this page from time to time to ensure you are aware of any changes. Where appropriate, we may notify you of changes by email or through the Game or Community.\n\n2) INFORMATION WE MAY COLLECT ABOUT YOU\n\nWe collect and process the following information, which may include your personal data.\n\nInformation provided by you when using an Online Service\n(Submitted Information)\nWe will collect personal information from you when you use our Online Service or when you contact us for support:\nThis may include:\n\nYour name;\nYour address, telephone number and email address; and\nYour Steam ID and Steam profile/display name and profile image.\nYour Oculus ID and Oculus profile/display name and profile image.\nYour PlayStation Network ID and profile/display name and profile image.\nYour HTC ID and profile/display name and profile image.\n\nInformation about your gaming and activity\n\n(Analytics)\n\nWe may collect technical information about your use of the Online Services through the use of tracking technologies and analytics.\n\nPersonal data we may collect includes the following:\n\nyour IP address and MAC address;\ndevice information (e.g. device identifier and browser)\ngame results, game activities, progress and timings; and\npage usage (e.g. buttons clicked, screens viewed).\n\nThis also includes the use of cookies more details of which can below.\n\nWe may also collect technical information to help us understand how you use our Online Services, and how often, so we can improve them to deliver a better experience for our users. To carry out research and statistical analysis to help improve our content, products and services.\n\nThe information we obtain from our use will not usually contain your personal data.\n\nAlthough we may obtain information about your device such as your IP address, your browser and/or other internet log information, this will not identify you personally.\n\nOur Online Services should display a notice alerting you to this use and requesting your acceptance. If you accept, you will be accepting our use of the Analytics or similar technologies for the purposes described in this privacy policy.\n\nPlease note that if you choose to disable Analytics on your device you may be unable to make full use of our Online Services.\n\nCookies\nA cookie is a text file placed onto your device when you access the Online Services or Website. We use cookies and other online tracking devices such as web beacons, and flash object storage to deliver, improve and monitor our Online Services, including in the following ways. Where you have opted out of cookies the only cookie we will place is one to remember you and that you have opted out.\n\nCookie Name\tDomain\tVendor\tPurpose\tCategory\nAWSELB\tapp.hubspot.com\tAmazon\tAWS Elastic Load Balancer\tPerformance\nFacebook Pixel\tFacebook.com\tFacebook\tMarketing\tTargeting\n__utma\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmb\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmc\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n__utmz\thubspot.com\tGoogle\tGoogle Analytics\tTargeting\n_gauges_unique_hour\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_day\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_month\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique_year\thubspot.com\tGauges\tGauges Analytics\tPerformance\n_gauges_unique\thubspot.com\tGauges\tGauges Analytics\tPerformance\napex__product\thubspot.com\tSalesforce\tSalesforce Analytics\tStrictly Necessary\n__hstc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\n__hssrc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\n__hssc\thubspot.com\tHubSpot\tHubSpot Analytics\tTargeting\nhsPagesViewedThisSession\thubspot.com\tHubSpot\tHubSpot Analytics\tStrictly Necessary\nhubspotutk\thubspot.com\tHubSpot\tHubSpot Analytics\tStrictly Necessary\nhubspot.hub.id\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauth\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauthcms\thubspot.com\tHubSpot\tHubSpot Authentication\tStrictly Necessary\nhubspotauthremember\thubspot.com\tHubSpot\tHubSpot Authentication\tFunctionality\n_hs_opt_out\thubspot.com\tHubSpot\tOpt out of HubSpot tracking\tStrictly Necessary\nhubspotutktzo\tacademy.hubspot.com\tHubSpot\tTime Zone Offset\tFunctionality\n__hluid\thubspot.com\tHubSpot\tIn-app usage tracking\tTargeting\nmp_id_mixpanel\thubspot.com\tMixpanel\tIn-app usage tracking\tTargeting\n__cfduid\thubspot.com\tCloudflare\tDetection of malicious actors\tStrictly Necessary\n__cfruid\thubspot.com\tCloudflare\tRate limiting policies\tStrictly Necessary\n\nInformation about you collected from third parties\n\n(Content Information)\n\nWe may collect information which you make available to us via your social media profiles, including your Steam account, your Oculus account, your PlayStation Network account, your HTC account, your Facebook account or other social media accounts.\n\n3) WHY WE COLLECT INFORMATION ABOUT YOU\n\nTo provide the Games to you\n\nTo enable operation of the Game\n\nWe will use information about you (including Submitted Information and Analytics) to deliver our Games to you under the terms of use agreed between us. The processing of information in this way is necessary for us to record your progress and current status within a Game, and to ensure the Games deliver the features promised and function properly.\n\nIn order to enable us to operate the Games in an effective manner we use a company called Playfab, Inc. to process your data and you can find out more about how Playfab processes personal information here.\n\nhttps://playfab.com/privacy/\n\nTo provide the Communities\n\nCertain Content Information and Submitted which you supply through our Online Service will be shared with other users of the Online Service. In some cases you may be able to select specific recipients (for example if you are sending a forum post, or a private message, to a particular forum or individual) then only those recipients will receive it, however in all other cases, your information may be made publically available.\n\nTo respond to your enquiries and requests for support\n\nWe may process Submitted Information and Content Information so that we are able to properly respond to your enquiries and support requests, in accordance with the terms of use agreed between us.\n\nTo keep you up to date\n\nWe use your Submitted Information to send you emails in order to keep you informed of news and products. To do these we use Mailchimp. You can find out more about how they process personal data here:\n\n\n\nhttps://mailchimp.com/legal/privacy/\n\n4) DATA SHARING\n\nWe will share your information with third parties only in the ways that are described in this Privacy Policy\n\nGroup members, personnel, suppliers or subcontractors: We keep your information confidential, but may disclose it to any member of our group (which means our subsidiaries, our ultimate holding company and its subsidiaries, as defined in section 1159 of the Companies Act 2006), our personnel, suppliers or subcontractors insofar as it is reasonably necessary for the purposes set out in this Privacy Policy. However, this is on the basis that they do not make independent use of the information, and have agreed to safeguard it.\n\nMerger or acquisition: If we are involved in a merger, acquisition or sale of all or a portion of our assets, you will be notified via email, account message and/or a prominent notice on our website of any change in ownership or uses of this information, as well as any choices you may have regarding this information.\n\nRequired by law: In addition, we may disclose your information to the extent that we are required to do so by law (which may include to government bodies and law enforcement agencies); in connection with any legal proceedings or prospective legal proceedings; and in order to establish, exercise or defend our legal rights (including providing information to others for the purposes of fraud prevention).\n\nEnforcement: We may also disclose your personal information to third parties in order to enforce or apply the terms of agreements, to investigate potential breaches or to protect the rights, property or safety of Coop, our customers or others.\n\nDigital Content Stores: The Game is made available to download via Steam and we may disclose your personal information to Steam for the purposes of making the Game available and facilitating any in-Game payments made through Steam.\n\n5) CONSUMER CONTROL AND OPT-OUT OPTIONS\n\nWhere you have linked your Steam account to any of your social media accounts, you can unlink these at any time by adjusting your settings in Steam. You can also remove access in your social media settings. If you are using an iOS device, you can opt out of personalised adverts by visiting https://oo.apple.com\n\nWe will obtain your consent to collect your information to be used for marketing purposes. If you prefer that we do not use your data in this way, let us know by writing to info@coopinnovations.co.uk or by checking boxes on the forms we use to collect your data.\n\n6) YOUR RIGHTS IN RELATION TO PERSONAL DATA WHICH WE PROCESS RELATING TO YOU\n\nYou have the following rights over the way we process personal data relating to you, as set out in the table below. We aim to comply without undue delay and within one month at the latest.\n\nTo make a request, please let our Data Protection Officer know via info@coopinnovations.co.uk\n\nAsk for a copy of data we are processing about you and have inaccuracies corrected\n\nYou have the right to request a copy of the personal information we hold about you and to have any inaccuracies corrected.\n\nWe will use reasonable efforts to the extent required by law to supply, correct or delete personal information held about you on our files (and with any third parties to whom it has been disclosed to).\n\nObject to us processing data about you\n\nYou can ask us to restrict, stop processing or delete your personal data if:\n\nyou consented to our processing the personal data and have withdrawn that consent;\nwe no longer need to process that personal data for the reason it was collected;\nwe are processing that personal data because it is in the public interest or it is in order to pursue a legitimate interest of Coop or a third party, you dont agree with that processing and there is no overriding legitimate interest for us to continue processing it;\nthe personal data was unlawfully processed;\nyou need the personal data to be deleted in order to comply with legal obligations;\nthe personal data is processed in relation to the offer of a service to a child.\n\nYou can delete your accounts by following the instructions in your account settings.\n\nObtain a machine-readable copy of your personal data, which you can use with another service provider\n\nIf (i) we are processing data in order to perform our obligations to you or because you consented and (ii) that processing is carried out by automated means, we will help you to move, copy or transfer your personal data to other IT systems.\nIf you request, we will supply you with the relevant personal data in CSV format. Where it is technically feasible, you can ask us to send this information directly to another IT system provider if you prefer.\n\nMake a complaint to a Supervisory Authority\n\nIf you are unhappy with the way we are processing your personal data, please let us know by contacting us via the support services.\nIf you do not agree with the way we have processed your data or responded to your concerns, an alternative is to submit a complaint to a Data Protection Supervisory Authority.\n\n7) Data Retention\n\nWe will only retain your personal information for as long as necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, accounting or reporting requirements.\n\n8) CHILDREN\n\nWe do not use our Online Services to knowingly solicit information from, or market to, children under the age of 13. Our terms of use prohibit users aged under 13 years from accessing our Online Services. In the event that we learn that we have collected personal information from a child under 13 years of age, we will delete that information as quickly as possible. If you believe that we might have any information from or about a child under 13 years of age, please contact us at info@coopinnovations.co.uk\n\n9) Security\n\nOnce we have received your information, we will use strict procedures and security features to try to prevent unauthorised access. Unfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal data, we cannot guarantee the security of your data transmitted through our Online Services; any transmission is at your own risk\n\n10) INTERNATIONAL DATA TRANSFERS\n\nThe data we collect from you may be transferred to, and stored at, a destination outside the European Economic Area (EEA). It may also be processed by staff that operate outside the EEA and work for us or our suppliers. These staff may be engaged in the fulfilment of your orders, the processing of your payment details, the maintenance of the Service, and the provision of support services. By submitting your personal data, you agree to this transfer, storing or processing. We will take all steps reasonably necessary to ensure that your data is treated securely and in accordance with this privacy policy.\n\nCONTACT INFORMATION\n\nAll questions, comments or enquiries should be directed to Coop at info@coopinnovations.co.uk. We will endeavour to respond to any query or questions within two business days.\n\n 2020 Cooperative Innovations Ltd. All trade marks are the property of the relevant owners. All rights reserved.\n\n\n\n 2020 Cooperative Innovations. All rights reserved", "Space Required": "1.24 GB"}



["5 stars\n34%\n4 stars\n18%\n3 stars\n8%\n2 stars\n12%\n1 star\n27%", "powney1991May 22 at 4:15 PM\nA great game however...\n\nSo I had great fun creating my avatar at the start of the game. It gives you a lot of customisation options in terms of outfits, skin colour, space themed accessories you can wear. Also had an amazing time in the tutorial learning the ropes and got to about wave 9 in the practice round which followed with CPU characters before everything got out of hand.\n\nThis is a great game and was having real fun however... following the practice round, I was up for playing online but no players in sight. I then tried half an hour later, still nobody. I dont know if its just because this game is new, unpopular or what but after there was nobody there it automatically killed the game for me.\n\nI want to emphasise I am very open to making this review a 4 or 5 star review if the player base gets bigger and I do appreciate that to a degree is out the developers hands but for now it feels like a single player experience with a dead online lobby. I will give this another try in a few weeks or so and if I find the base has grown and I get to play some multiplayer I will most certainly improve the review because ita a great game!\n\nHelpful | 137\nDeveloper ResponseMay 22 at 4:53 PM\n\nGlad you enjoyed the practice and the avatar side of things! We launched less than 24 hours ago during a busy week on the store but your positive review will help others find and buy the title as we build the community and so it's appreciated! Thanks!", "polka_pandaJun 24 at 10:31 AM\nLots of potential\n\nIt was fun and each stage introduces new twists, but then we start from the beginning and that makes it hard to get better at the harder levels. We quickly got tired of doing the easy initial levels just so can have one more try at the super-hard later levels.\n\nI think it would be nice if the devs added a continue option so we can at least retry the last level once, or a way to pick the starting level.\n\nGet this game to play with friends.\n\nHelpful | 6\nDeveloper ResponseJul 8 at 2:27 PM\n\nHey! Thanks for the review and the suggestions! We've pushed a difficulty tweak in the update today and continue to add new content and updates to up the challenge :)", "BrassydragonJul 28 at 7:14 AM\nNobody around\n\nI was eager to buy this and following the practice there are never any games. I've had it for 2 months and there have never been any players around to play with. Waste of money, waste of time, and i cant even get a refund for it so its entirely useless.\n\nHelpful | 9\nDeveloper Response13 days ago\n\nHeya there! We are sorry you have had a bad experience with matchmaking other players. We are doing our best to support and grow our player base. We hold events on Thursdays that you can join via the Oculus Events system which gathers players between 7pm to 9pm in the BST and PDT times zones to play together. Hope to see you at one of these events!", "PurplemikeyMay 14 at 4:45 PM\nVR is a social platform here's the proof\n\nAmazing game for family, party, friends or even strangers. But the real party comes in when you play with family and friends IMO. I got to play with my gf and with my family (all in quarantine) over messenger voice chat (they were on their phone and computers and I was in VR). I wanted to play one game to see how it would perform and they were... Not really into it at first.\nOnce we got in the game they didn't wanted to stop. I actually had to leave because I thought we'd only play 20-30minutes and we ended up playing 2h.\n\nTime fly when you're having fun!\n\nHelpful | 80", "Tacocat.exeMay 31 at 9:31 PM\nFun, but multiplayer isn't there\n\nFun game, really good graphics and everything else, stressful, hard and fun.\n\nOn the other hand, if you don't have a party going or have anyone on phones with you, it is very hard to get into a game. I have only gotten into one, and there was also only one person there, who was also just surprised to see me. We started playing and then he froze mid-game and left. Idk if this is a game problem or just his computer. Also, it felt like the anomalies were a little lost in the VR version, but all in all, it is a good game if you already have people with you, or willing to play with bots.\n\nHelpful | 8", "MikeyMan5Jul 9 at 7:42 PM\nfun but....\n\nMultiplayer online is always completely dead with no games so you are pretty much stuck to being on your own or doing face to face mode unless you know others that play the game at the same time. Dont know if face to face counts towards the Thursday events but if not that's a bummer for those reliant on teaming up with people online. Definitely was not worth the money spent so far.\n\nHelpful | 3", "KnittelManMay 24 at 2:52 PM\nFun but not perfect\n\nI did not have any glitches or issues I saw other reviewers mention. I found this game extraordinarily fun. I do think it would be cool to have more customization with characters even though theres an eclectic assortment, of still feels limited.\n\nThis is the kinda game thats easy to learn but hard to master snd has lots of replay value which many games in VR dont have. My only real issue is the escalation of difficulty. I feel like it goes from being pretty easy to near impossible very quickly. So the problem is that while its fun, and replayable, I never play it for long at a given time.\n\nUnlike some games where I will play for hours until my headset dies, this is a game I found thats easy for new VR players to enjoy, definitely fun with friends, but also after failing a couple times, you wanna play something else.\n\nI think this could be fixed with more obvious goals. Like I know if I get to level 15, I earn ______? Maybe a hammer that fixes the ones faster, or a gun that shoots better, etc etc. like I wanna reach milestones that give me a reward that benefits future gameplay. This would keep me trying to play longer and longer and give me a reason to keep playing.\n\nHelpful | 10\nDeveloper ResponseMay 26 at 2:36 PM\n\nThanks for the review, we have the ability to dynamically tweak the difficulty and are planning to do that very soon based on the data from the early players. Having some form of enhanced tools is something we've been thinking about and will add a +1 to it on our roadmap :)", "TinyTexanJun 5 at 9:55 PM\nPretty fun\n\nThis is a good, fun, well built party game. That being said, I want to mention a single technical issue I found while playing. Upon trying to reset my position by holding down the oculus button, the game didnt know what to do. It chugged and has crashed on occasion, but if it doesnt crash it takes a solid 20 seconds for the game to fix itself. After this process, it still doesnt reset your position.\nOn another note, I would love some more info for the online part of Spaceteam. I see high potential in online for this game, but upon checking for a lobby almost 15 times with no results, it seems to be a cause soon to be lost. I would suggest asking for users to agree (if they want) to give you rights to record minor information such as when any VR player checks for an online lobby for Spaceteam. With this info, you could show a chart of most common times that players are on. This way, it would be easier to find a match over time.\n\nThank you for the game, and I hope you will continue listening to your community as you have before.\n\nHelpful | 3\nDeveloper ResponseJun 9 at 9:00 AM\n\nThanks for playing and be sure to check out our Thursday night play sessions we're organising in the events section of 'Social' to find more people online. We'll be making further adjustments and improvements and I'm sure you'll have lots of people to play with soon!", "Mark-Bliss7 days ago\nDo not buy\n\nThis game is a waste of money. User unfriendly and not fun. We enjoyed it for about 5 minutes. Confusing, uninteresting. Dont waste your time.\n\nHelpful | 0\nDeveloper Response5 days ago\n\nSorry you feel this way - please could you let us know what was user unfriendly about the experience as that isn't something we've heard before. Thank you!", "FirstStrikeADJun 27 at 9:09 PM\nSPACE TEAM \n\nI absolutely LOVE this game!!! Couple years ago we had about 6 of us playing a mobile version of this game for the holidays and had hours of fun and laughs!\n\nThe game is very creative. A whole lot more to do than the mobile game. I think I made it up to 19 on the practice mode.\n\nMy brother just got his oculus quest today and he already downloaded it. Early bday gift for him! Now theres at least 3 of us that will be on this game regularly. Im telling my other friends about space team as well. Keep up the great work! SPACE TEAM \n\nHelpful | 2", "aripolMay 22 at 1:34 PM\nSo much fun, but local is buggy\n\nThis is totally worth it to play with friends or family if they also have the VR game. However, there are a lot of issues in the web interface for local face-to-face players, and it's less fun for them than the regular Spaceteam game.\n- doesn't work on Firefox for Android\n- if you enter the wrong room code, sometimes it just kinda hangs without telling you what's wrong\n- on Chrome for Android, error message on enter-code screen is cut off with no way to scroll\n- sometimes the screen tells me to perform an instruction that's already reflected on the control\n- web client said \"game over\" and disconnected me while VR was still playing\n\nHelpful | 10\nDeveloper ResponseMay 24 at 10:44 AM\n\nHi! Thanks for the comment, we'll look into the compatibility on those browsers a bit further and the control issue you mentioned! We have just dropped a new update containing various fixes and improvements, we would love to know if this has improved your experience. Thank You!", "GalaxyEntity904Jun 18 at 1:05 PM\nGreat game, few players\n\nI had an amazing time with the tutorial but then when I wanted to play with actual people there was no one playing, not on the US server, not on the EU server, not on the Australia server. There was one time when there was someone playing but when I tryed to play i would press join and it would give me a black screen for a second then put me back in the home area.\n\nHelpful | 0\nDeveloper ResponseJun 18 at 2:45 PM\n\nHey! Thanks for the review, we're bringing new updates and organising events to bring more people together while we grow the userbase further! Be sure to check out the mobile crossplay also!", "lightsailvrMay 22 at 2:59 PM\nNeeds a lot of polish\n\nI would wait to buy until an update. Honestly I am surprised this passed Oculus content review as some basic game play seems unfinished and below average quality.\n\nI am playing on Quest.\n\nAt first, I couldnt get voice communication to work until I started a party with friends. Then it was fine.\n\nI found the physics to be pretty laggy when picking up objects or trying to move things. That kind of delay in a game thats about lightning quick reflexes is not fun. So some controls would take a few tries to hit correctly. My tools frequently got stuck in the panel. I couldnt figure out how to de slime as the sponge wasnt covered in the tutorial and also did nothing. But the worst offender by far is the failure to properly reorient the players. I would press reorient and it would place me far from the action station, requiring me to go to the edge of my play area. This happened for everybody in my game. At least add snap rotation or something!\n\nI want to love this so much, Im a huge fan of the mobile game. But this feels like a beta and certainly not worth $20. I hope they fix these issues quickly and will re-evaluate my review then.\n\nHelpful | 5\nDeveloper ResponseMay 24 at 10:45 AM\n\nHey, thanks for the review and sorry you had some issues! Please could you mail us at spaceteamvr@coopinnovations.co.uk about the voice communications issue as that's unusual unless you reject the voice permissions at install time (and you're using the 'Online' mode and not 'Face To Face' - which doesn't support VOIP) Also if you could check that you were assigned to the correct server region please as that could introduce some of the lag you mentioned perhaps? Our patch is now live that addresses the reorientation issues so please check that out and let us know if that fixes the issues for you! Sorry about those issues! Thanks!", "ScottyDean77May 22 at 1:33 PM\nNot feeling this one\n\nIt spawns you in random places and when you reset your view it still spawns you in the same place. The only way to get to the panel is to restart the game. And once you grab something and let it go it doesnt let it go. You have to press the grab button again. You cant just grab something and let it go when you release the button like normal. Very confusing.\n\nHelpful | 7\nDeveloper ResponseMay 24 at 10:43 AM\n\nSorry that you've been having issues, we've identified a reset view issue which has been fixed the latest update. We also found that on bad network conditions there is a 'grip toggle' type effect that can occur. We also have also fixed this issue in the latest update. We hope you come back to play again!", "Aaronb3434May 27 at 4:26 PM\nGood\n\nBut if possible can more environments/locations be added instead of being in one environment/location/spot to play the game and also can a whole single player adventure be added with avatar bots to help you? even though i know theres a single player practice mode, besides multiplayer etc. Thanks\n\nHelpful | 1\nDeveloper Response13 days ago\n\nFeedback noted! We 100% have plans to add more customisation to your SpaceteamVR experience in upcoming free content updates", "NammFamMay 28 at 6:25 PM\nNobodys ever playing\n\nI havent played one single game . Every time I try all it says is no games going . And to boot Oculus wont give me a refund as it says I played the game more than 2 hours ??? How I cant even find any games to join .\n\nHelpful | 10\nDeveloper Response13 days ago\n\nSorry that you've had a bad experience with matchmaking other players. We are doing our best to expand the player base so more people can get into Spaceteams. Try joining one of our Thursday Team Time events where we encourage players to hop onto Spaceteam VR between 7pm and 9pm BST and PDT", "corryrJun 6 at 10:10 AM\nOne of the best games on many platforms\n\nLoved the Android game, loved the card game, now I love the Oculus game!\nThe fact some players can join in at home on their phones is brilliant!!!\nSome suggestions...\nFull integration with the phone app... Instead of going to a website outside the app. The phone app needs more console stuff, it's too simplistic. Those in VR have fires to put out and aliens to fight so the phone app players need more challenge. This game is not about winning but dying.\nI also feel that the VR game also hasn't got the full feel of the panic and chaos the phone app has.\nI suspect it will be refined in time.\nGreat job to the company who developed this! I expect I will see more great things soon :-)\n\nHelpful | 1\nDeveloper ResponseJun 9 at 8:59 AM\n\nThanks for playing and be sure to check out our Thursday night play sessions we're organising in the events section of 'Social'. We'll be continuing to update the F2F and VR version :)", "KernowLegendMay 30 at 10:24 AM\nWasted money\n\nUnless you have friends who own this title to play with do not buy this title. I bought this on release and havent had a single game with any real people! Either theres a server issue or nobody is playing this game, I suspect its the latter, I played a couple of games with my son via my iPad but frankly the experience for the iPad user is horrible when playing with someone in VR as it takes you out of the app and to a website which is as basic and unstable as you will ever see, youre better off all playing locally on your mobile devices (for free too). There is a single player but its boring and thats not the experience youre looking for in a game like this, it relies on frantically shouting instructions to each other.\n\nHelpful | 3\nDeveloper ResponseJun 9 at 9:07 AM\n\nSorry that you feel the game was a waste of money - people are playing the game but unfortunately groups playing together won't show as games you can join once they've started the game or if they make it private. We're working on ideas to improve this as well as further improvements to Face To Face mode.", "ObsidianCinnaJun 3 at 12:40 AM\nWhere is everyone?!\n\nI have tried to do multiplayer on all the different servers and also tried quick play. The only time Ive been able to play is by myself. But what is the point of space team if I dont have a team?!\n\nIts funny that there are so many others experiencing the same issue I am so clearly its not for lack of trying. There are others who are trying to do multiplayer so where is the disconnect?\n\nIve had this game on my phone for years and still enjoy it with friends. When I saw that it launched in the oculus store I was uber surprised and super stoked, it was an instant buy! But if I cant play with other people in VR whats the point?!\n\nAlso could you make it so that I dont have to keep redoing the avatar. When I start the game up I want to see the same avatar that I had when I shut the game down.\n\nHelpful | 2\nDeveloper ResponseJun 4 at 8:43 AM\n\nHi! Sorry that you've not been able to play online with anyone - we do have people playing and loving the game in multiplayer as well as on their phones/tablets with friends. We're introducing some events soon so that people are online at the same time to play, we are also pushing the game to ensure there are more people who own it and playing it actively! The avatar issue you mention is not a bug we've seen before and will investigate - the game should be saving your preference, did you accept the permission request for the game to store data? Thanks! See you online soon!", "lotsagrayJun 23 at 12:18 AM\nLooks fun but won't connect\n\nBought the game as we really enjoyed Acron: Attach of the Squirrels playing with the quest and mobile apps.\n\nWhen we starts game the quest is online all on same WiFi but the code it gives for mobile phone players to join either says the code is wrong or sits on checking code for 10 minutes before disconnecting.\n\nAnyone else having this issue?\n\nHelpful | 1\nDeveloper ResponseJul 5 at 3:58 PM\n\nHi - thanks for the review, we had a bug causing this - apologies! It should now be fixed!", "err404May 23 at 8:55 AM\nGreat Spaceteam experience in VR\n\nThis is exactly what I hoped it would be. If you have played the phone versions, you have an idea of the gameplay. In fact you can play with other people on their phones. There is a solo component, but this is primarily a multiplayer game. Your enjoyment is highly dependent on the rest of your team.\n\nHelpful | 2", "derpysantaJun 15 at 3:06 PM\nDo not buy this trash\n\nAll you do is push buttons and lose your voice, no one I played with liked it. Not worth 20 at all. Should be 5 at most. All in all, this is a piece of trash. Didnt get a refund in time, so bad I completely uninstalled it. THIS IS TRASH!!!\n\nHelpful | 2", "teafunnystoneJun 9 at 9:08 AM\nGreat game but needs more people!\n\nThis game is so great and fun. It can get so hectic and confusing but its really all part of the fun. The only issue is that there isnt a lot of people online or playing the game and since this is mostly a cooperative game, it is an issue because then all you can play is a practice mode with AIs. A lot of people refund the game because of this but I really recommend the game. And if anyone wants to play and has no one to play with, please message me! I am always down to play. This is a cross platform game which just brings more opportunity to play with anyone who has a headset. There is also the ability to play with those who dont have a headset and its really just amazing. If you are reading this, add me as a friend and message me. My username is teafunnystone. Just message me and we can have lots of fun! I also wish there were more game modes or variety but the game is still great nonetheless.\n\nHelpful | 1\nDeveloper ResponseJun 9 at 8:59 AM\n\nThanks for playing and be sure to check out our Thursday night play sessions we're organising in the events section of 'Social'", "roy.cole.5891Jul 25 at 9:16 PM\nGreat fun!\n\nReally good game, especially when played with others!\n\nHelpful | 0\nDeveloper Response13 days ago\n\nGlad you are enjoying your experience as a Spaceteam member! Look out for upcoming updates including new panel controls, difficulty changes and character customisations!", "JourneyOnQuestMay 29 at 8:11 PM\nEh.\n\nThe game is good, love the concept. Its just nobody plays it, and I dont always have fun with solo mode. Id love to see more environments.\n\nHelpful | 0\nDeveloper ResponseJun 9 at 9:07 AM\n\nHi! Be sure to check out our Thursday Team Time events we have planned starting this week!", "KugalblitzaagaJun 1 at 9:11 AM\nLoved this game for years.\n\n...my main issue was the controls kept moving far away from my guardian space. In mid playing the game with others watching. Like I was put in the corner without notice. I had to restart the whole app to get me back in my seat...\n\nHelpful | 3\nDeveloper ResponseMay 26 at 2:34 PM\n\nHi, sorry for the issues you experienced - was this with the latest update and was this on Quest? We fixed some reset view issues that sneaked past QA but have another update coming later next week to iron out any further issues. Any information or videos you could provide to crew@spaceteamvr.com would be appreciated - thanks!", "Electromouse93May 26 at 11:14 PM\nFrantically Fun\n\nI absolutely love this game, the concept and style are fun but there are a few minor kinks to work out, mainly player accessibility settings like being able to change the difficulty of the game after a round has ended. My console and several others I have talked to have said they are unable to connect to active servers in the join game option, this really sucks because that means Im restricted to the quick play option which I have learned does not actually connect into servers available on the join game menu. Hopefully these issues will be patched but the core gameplay, concept, style, and player base has been nothing but entertaining! Thanks for making a truly unique VR experience\n\nHelpful | 0", "koolKatxxMay 29 at 1:01 AM\nFun and funny\n\nI had my doubts until I actually started to play this and played with other people. It got intense and funny watching people freak out and go insane trying to keep up and trying to listen over each other . I really enjoy this game and cant wait to play with more people!\n\nHelpful | 0", "car2nrMay 21 at 4:09 PM\nBest game in a group!\n\nThis game is so much fun but youll need to play with others. I promise youll laugh so much youll cry!\n\nHelpful | 4", "KillerQ20May 21 at 12:10 PM\nGame is soo good, but 1 problem\n\nI was very hyped for this release and I think the hype was worth it! It has awesome new features unlike the mobile game. The only thing that happens sometimes: crashes. Please fix that!\n\nHelpful | 2\nDeveloper ResponseMay 21 at 12:15 PM\n\nHello! Please could you let us know the details of the crash you experienced? If you email crew@spaceteamvr.com with details we can look into it! Thank you!", "SoMeOnE2701May 30 at 3:01 PM\nDont judge a book by its cover\n\nWhen I watched the trailer and thought is was not my type of game but then played it with my friend and was hooked.\n\nHelpful | 2", "DeepMellowJun 1 at 9:22 PM\nBuyer beware\n\nPlayed the game 15 minutes tops on day 1 and refund denied. I didnt like the game its too basic for me. Watch out people.\n\nHelpful | 2\nDeveloper ResponseJun 2 at 3:58 PM\n\nHi! Sorry to hear about your issues with the refund - we don't have any control of that as developers so please contact Oculus! I hope you can come back to try the multiplayer with other VR players or with friends using tablet/mobile! Take care!", "cheezeitsMay 29 at 7:58 PM\nAmazing for family game night!\n\nI have played Spaceteam on the phone before, but this is the game that none of us asked for, but we all needed it! Ive always wanted a single player mode, and this game delivered!\n\nHelpful | 1\nDeveloper ResponseJun 9 at 9:08 AM\n\nThanks for playing and the lovely review!", "logan.davis.7169Jun 9 at 8:59 PM\nno good dont buy\n\nwish I could put 0. I bought the game 2 weeks ago to play online. still nobody wish I could get a refund.\n\nHelpful | 1\nDeveloper ResponseJun 10 at 1:53 PM\n\nHi! Please join us this Thursday for our online event - we're working to coordinate the community as well as growing the number of players online at once with our updates!", "trpleedge1May 27 at 12:57 PM\nGood game\n\nIts very very fun and you should try it\n\nHelpful | 1", "starllama467670Jul 18 at 10:30 AM\n\nI love the game but the only issue I have is finding multiplayer games I cant even find any game of multiplayer and I still havent been able to play with another person yet\n\nHelpful | 0\nDeveloper Response13 days ago\n\nSorry you have had a bad experience with matchmaking other players. We are doing our best to support and grow the player base. We hold events on Thursdays (ThursdayTeamTime) that you can join via the Oculus Events system which gathers players between 7pm to 9pm in the BST and PDT times zones to play together. Hope to see you at one of these events!", "Ebcdic_FortranJun 22 at 4:54 PM\nGreat Game But!\n\nI have to say that I did enjoy playing this game. Specially when playing with a friend. There seems to be an option for playing from an IOS device however when joining a private VR game from an IOS device it gets stuck checking the code and never joins the game! Was disappointed in this as ai tried unsuccessfully to get some friend to join me form their phones! Developers any fix for this??\n\nHelpful | 0\nDeveloper ResponseJul 5 at 3:58 PM\n\nApologies for the slow reply - this bug was fixed last week! Please try again :)", "chase.bransonJul 23 at 4:27 PM\nEh\n\nVery linear and repetitive\n\nHelpful | 0\nDeveloper Response13 days ago\n\nIf you join our Discord at: discord.spaceteamvr.com We would love to hear some of your suggestions on how you think we can spice up the gameplay!", "GuondaviousJun 23 at 12:56 PM\nLove It\n\nI really enjoyed the original Space Team on mobile and in VR its even cooler! The face to face feature is also a great touch its a perfect party game! This is an updated review because when I originally downloaded it there was a bug that was causing the mobile app to get stuck however that has now been patched!\n\nHelpful | 0", "JoeGermanJun 26 at 5:48 PM\nA lot of fun.\n\nThe game is a lot of fun. Haven't tried playing with Randos online, but for having people was great. If I had one suggesting, it would be that the VR game should be able to link with the store app, which is superior to the website app.\n\nHelpful | 0", "oitbcMay 29 at 10:56 AM\nLove this app, but buggy in VR\n\nThis is our favourite iPhone app and we wile away train journeys with it. However a quest and iPhone are a pretty buggy set. The app opens a web page called stvr.com I think. Sometimes it crashes after 30 seconds, sometimes you get to sector 4 before it crashes and says the VR player ended the game, even when they havent and are still shouting things out to you in the living room.\n\nHopefully they iron out the bugs for multiplayer soon.\n\nSometimes VR handholds for twisting and turning are a bit laggy as well.\n\nSuper excited for when this works properly.\n\nHelpful | 0\nDeveloper ResponseMay 30 at 4:41 AM\n\nHi, thanks for the comment - we've had some rare reports of issues with the web play version - could you please drop us an email at crew@spaceteamvr.com with info on when you were playing and we'll try and check our logs for issues. Thanks!", "tomer6731Jun 15 at 11:31 AM\nwhy this game bad\n\nat first i toghot it's a good game, and dont' get me worng the concept it's cool but Control of the controller is so bad that I can code more good one and i just start learn how to\n\nHelpful | 0", "SarinillaJun 5 at 3:59 PM\nCrazy Fun\n\nThis game is a lot of crazy fun, like a 6-player round of Bop-it where the tool is actually changing in your hands as you play. I can't wait to see an active multiplayer lobby to fully crew this insane ship!\n\nHelpful | 1\nDeveloper ResponseJun 9 at 9:06 AM\n\nThanks for playing! Be sure to check out our Thursday night social events we have planned!"]