{"App Title": "Space Pirate Trainer", "App description": "Space Pirate Trainer is the official trainer for wannabe space pirates. \n\nRemember those awesome classic arcade cabinets? Imagine if those were immersive... Space Pirate Trainer puts you in one of those; fighting off relentless waves of droids with all the weapons and gadgets you would ever need as a Space Pirate. You better dodge some of those incoming lasers though, since just using your shields won't get you in the top rankings. Pick up your blasters, put on your sneakers, and dance your way into the Space Pirate Trainer hall of fame.\n\nNo real droids where harmed during the creation of this game. \nUse your straps and stay in your VR area to make sure no humans will be harmed.", "Purchase section": "$14.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Arcade, Shooter", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Spain)", "Version": "1.57", "Developer": "I-Illusions", "Publisher": "I-Illusions", "Website": "https://www.spacepiratetrainer.com/", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "1.12 GB"}



["5 stars\n79%\n4 stars\n16%\n3 stars\n3%\n2 stars\n1%\n1 star\n1%", "WyjoeJun 22 at 10:20 PM\nOne minor problem\n\nA must need for the quest! This game is one of the best representations of why the quest is great with no wires. The guns and shield you have make you be creative and careful, and the bullet time is also helpful. There is only one thing that is tough, and its the power ups. The idea is great, and has helped me on numerous occasions, however it gets hard when the enemy droids shoot the power ups when you didnt want them activated. This has happened to me on numerous occasions, and I think if this would be fixed, there would be no faults in the game. Hope this helped, and I hope that this can be changed sometime soon.\n\nHelpful | 154", "Quinns.Eye6 days ago\nYou Need This Title. Heres Why...\n\nI dont write reviews. My career requires me to write all day. So when I come home, I just want to unwind and playnot write. Then came Space Pirate Trainer. Im not doing anyone (especially the devs) justice by NOT writing a review on how immersive, amazing, stimulating and straight up AWESOME this gem is. Its Retro, but futuristic. Its fun, but unforgiving. Its adrenaline fueled and in your face. This game transforms your surroundings and tosses you inside an 80s shooter arcade cabinetcomplete with iconic sounds of alien blasters and explosions. Complete with a banging Euro drum and bass soundtrack that will have you bumpin your head as you dodge enemy lasers with your shield while blasting with your pistol. Simple yet challenging. This game was made just for me and the crazy imagination I had as kid in 1986 when I could only dream of something like this I-LOVE-THIS-GAME...Stop reading and buy now. Best title on Quest More Please...\n\nHelpful | 3\nDeveloper Response6 days ago\n\nThank you for doing some overtime writing work and supporting us!", "SuperBassOMatic76May 22 at 2:05 PM\nA blast to play!\n\nThis game is super awesome. A great stress relief. The save points make it possible to climb your way through the levels; so far the jump from level 25 to 35 had been the toughest but great fun. A few notes: the instructions aren't so hot so you learn things as you go. For example, they don't tell you if you are using the ray gun in both hands and you cross the streams, it becomes one mega blasting ray. That's how I got through the last ten or so levels. Also, you need the shield far less if you're willing to move around to dodge bullets.\n\nHelpful | 119", "ConnorkinnsJul 22 at 4:29 PM\nMust have game for the quest\n\nI got this as one of my first games on quest and is still one of the best games on my quest, especially with friends and family who are new to Vr. At first I thought it would be repetitive like all the 1star reviews on here say but as I progressed further in the levels I had a blast trying to push further. This game is perfect for beginner vr users or expert ones because just the other day I found you could have two laser guns, face them together, and get a mega laser for a bit. I'm still finding new ways to take down enemies and I'm loving this game 10/10 would reccomened to anyone with at least one working arm :)\n\nHelpful | 4", "Gonzales120Jun 26 at 6:44 AM\nQuick and easy to play and replay\n\nThe Demo was what sold me as I enjoy classical arcade shooters and I ultimately chose this over many other duel wielding gun games on the Quest.\n\nIn true coin-op fashion, its quick into the action of shooting drones, dodging lasers and surviving as many waves as possible before punching in your initials and starting over. Quick, simple and engaging enough to want to insert another coin.\n\nThank goodness for the Explorer Mode though, I dunno if I ever would have been able to unlock the later waves and gun skins without it or beat that final boss.\n\nOne small nitpick/suggestion/fix would be to the Radar. Enemies would attack from the left, right and even above you almost simultaneously, particularly after 'Old School Wave 25' which can make dodging or shielding impossible especially in a small guardian. Meanwhile the Radar is sitting in the centre of the platform and you can only shift a glance at it in the thick of the action or between waves.\nTherefore I would prefer to have the Radar integrated into the head's up display along with the life count and score, particularly when audio cues can be hard to concentrate on when focussing on the shooting without just loads of trial and error.\n\nOtherwise, this is my favourite 'Arcade' or 'Shooting' game on the Oculus Quest and I would certainly recommend it. If nothing else, the Demo definitely had a say in my decision.\n\nHelpful | 11", "WhyMMMcccas7 days ago\nBumpy ride\n\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI'm gonna pull you over, pull you under\nMake your body surrender to mine\nGirl you can make me suffer, do whatever\nCause I know you're one of a kind\nTell me who can love you, nobody\nHold you, nobody\nMake your body wind, like me\nYou will never find someone like me\nWho can love you, nobody\nHold you, nobody\nMake your body wind, like me\nYou will never find someone like me\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nImma spin you around, push your buttons\nBuy you plenty of stuff\nThen ill take you down, to the bottom\nWork you all the way to the top\nTell me who can love you, nobody\nHold you, nobody\nMake your body wind, like me\nYou will never find someone like me\nWho can love you, nobody\nHold you, nobody\nMake your body wind, like me\nYou will never find someone like me\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nOn top of my love gain and you're gonna get it tonight\nI'm focused I'm ready girl I'm gonna give it to you right\nI' gonna pull you over, pull you under\nMake your body surrender to mine\nGirl you can make me suffer, do whatever\nCause I know you're one of a kind\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\nI wanna boom bang bang with your body yo\nWere gonna rough it up before we take it slow\nGirl lemme rock you rock you like a rodeo\n(Its gonna be a bumpy ride)\n\nHelpful | 0", "atomicwaste13 days ago\nWorth your money\n\nI bought this as a duo pack with red matter and I thought this game would be boring I was wrong I played the demo and it was fun just pulling and slicing and even though you're limited with weapons it's great and the dogging mechanism is great and unlike in super hot you have to look to see if a bullet is coming your way the bullets make noise when they come to close the one thing I would love is if they a mode with more lives other then that everything is perfect.\n\nHelpful | 0", "blablargon14 days ago\nClassic Arcade\n\nI played this game in 2016 at the KOP Microsoft Store as a VR demo and it sold me years ago. Today this is still the first experience I put people into and the one I keep going back to play. The hardcore mode is my favorite because it takes true reflex and is very rewarding when you do well. I can't write enough good about this title. Thank you developers! I can't wait to see what's next\n\nHelpful | 1", "bartonian18Jun 20 at 9:00 AM\nSpace invaders 360\n\nSuperb, challenging. Addictive, love it.\nIts obvious what to do and very satisfying as you advance. Weapons are great, ergonomics are brilliant.\nI find it hard to stay in top 1000.\nI wish the scoring of the levels made more sense. Always playing it and quite right it is a good stress reliever.\nReally looking forward to any updates.\nAlso it looks like the very high scores are from years ago when some of the weapons were different and after watching YouTube the scoring seemed more generous. Can the scoreboard be reset from time to time especially if the game changes, maybe the high scorers could go into a hall of fame so their credit isn't lost. I'd love to know how recent those high scores were set.\nHave another scoreboard also for this month's high scores.\nLOVE THIS GAME THOUGH.\n\nHelpful | 16", "brandon.migliorisi15 days ago\nBEST GAME on Quest!\n\nNon stop fun! This game is still my favorite game on the quest. It was my first purchase and I bought the system mostly for this and super hot, but this game is by far my favorite.\n\nHelpful | 2", "BlazeScream711Jul 5 at 10:25 PM\nOh yeah, this is good.\n\nTraining to be a Space Pirate? Yes, please! This shooter is wave after wave of greatness. Repeatability to the max. Each time you play can be very different from the last time with all the weapon choices, combos, and your play strategy changes. This game let's you blast ever more difficult enemies with guns, turrets, power-ups, or even futuristic melee weapons that slice through metal like a hot knife through butter. You can duel wield and dodge in bullet-time or go with a shield and send your enemies fire right back at them. This game is just shoot-em-up fun at its finest. Buy it and never look back.\n\nHelpful | 4", "Ihrie4 days ago\nArcade fun\n\nA fun arcade shooter very much in the vein of sayGalaga and Galaxian perhaps. Its an early VR title but plays excellent on the quest.\n\nGet it if you want some arcade shoots high-score fun.\n\nHelpful | 0", "JstoxxJul 29 at 10:20 AM\nLove the game a must have shooter\n\nPlease buy this game I non stop play it, the waves get harder in difficulty, leading up to a big boi boss that stays for a few waves. Now I haven't beaten it yet, I keep having a problem with the shield switching back as I'm blocking and shooting opposite ways. If you could add like a squeeze of the grip trigger to initiate the switch I feel it would help. Also if you could add a feature to quickly switch to last shooting mode would make transition between favorite weapons much easier and fluid. Lastly, a lock on when you grapple so missiles grabbed can be precisely thrown or even enemies thrown at each other ( for example lock on would only show when something grappled went behind the back). Just a few ideas but over all my favorite game so far.\n\nHelpful | 1", "Nightflame45612 days ago\nExtremely High Quality\n\nSome may argue that $15 games are okay, but not as good, but Id say this game is worth the same as Beat Saber (maybe more!) because this game is extremely addictive and it is a joy to play with friends. Very easy gameplay and a wide variety of weapons and tactics to use to your advantage. Not much of a storyline, but because it is a wave game, it doesnt need one! The only real progression is reaching the boss, and that is only for the truly skilled. Excellent concept with amazing execution!\n\nHelpful | 2", "Mustacheman3916 days ago\nAmazing\n\nThis game is amazing. I would recommend it.there are people saying that there is not enough to do and that it gets boring. Not true you can beat the mothership you can get all the achievement you can do challenges and so much more.\n\nHelpful | 1", "hiramlennoxJul 26 at 4:39 AM\nOne of the funnest games on quest\n\nI am 6th place on the leaderboard of the brawlers and I play it every single day. My leaderboard is straight 100,000 to 141,000. The beats and music is super good, the way the robots look are just fire, the fact you can change the way your gun shoots and to change your brawler weapon to a shield and watch it happen is sick. The bosses look creative the armored circle, satellite one, upside down triangle guy, wave 20 boss wave 30 boss absolutely cool all the bosses look cool.mabye you can host cash cups for the people that play space pirate trainer\n\nHelpful | 0", "Doc_CrankensteinJul 26 at 2:11 PM\nQuest Essential\n\nA beautiful arcade shooter with smooth controls and a variety if guns (along with a sword and shield!) to mix and match to overcome the numerous encounters. Has a decent amount of enemy variety and larger than life bosses that make it a breathtaking experience that really makes you feel like a bada** when you get into a good flow.\n\nHelpful | 0", "phil.pickering.5033 days ago\nSpace Pirate Trainer\n\nOne of my faves, it can get intense. Get familiar with the weapons and don't forget your shields. Everyone we've shown it to loves it. 5 Stars from me!\n\nHelpful | 0", "Philligan81Jul 8 at 8:54 AM\nGreat Game! I only ask,...\n\nFirst let me say I Love this game. Good, simple, old fashioned space invaders style, arcade action. I love the leaderboards for entering your initials, its great for local competition among friends and family.\n\nMy only gripe is that I would like to see some more backgrounds instead of that same old ship dock over and over again.\nIt doesnt take away from the game or anything, but would spice it up a little.\n\nAgain GREAT GAME!\n\nHelpful | 2\nDeveloper ResponseJul 8 at 11:22 AM\n\nTry reaching wave 30, maybe you'll get your second background ;)", "stevehaynes1Jul 22 at 11:04 PM\nAwesome!\n\nI can move my recliner out so I can spin 360 when I'm being lazy,but I will say you're working it(the chair).\nBeautiful game that's concerned with the sheer fun as well as making the environments and visuals.\n\nWhen you want action and get it while in a chair is sometimes where I'm at!\n\nLOVE THIS GAME!!!!\n\nHelpful | 0", "AyaBr3a6 days ago\nLove it\n\nFun shooter. I love the different modes and the variety of gun ammunition. I wish you could choose different backgrounds or gun skins just to give it some variety.\n\nHelpful | 0", "CentralCoding6 days ago\nA must have\n\nReally simple and enjoyable to play. The fact that theres no wires makes it really free. Its also cool to show relatives who are trying out my quest.\n\nHelpful | 0", "zion42Jul 25 at 8:53 AM\nSure it is a good shooting game, BUT...\n\nBut:\n1. The grenade launcher and the booster laser gun seems useless, they can never destroy any enemy unless it was super close( at least in first 30 wave ,in my opinion)\n\n2. The big reinforce weapons are very hard to control, they are left-right reversed.\n\n3. It only has 2 scenes so it can be boring after played for 30 hours.\n\n\nThe rest are good, looking forward to fix the weapon problem.\n\n\n6\n\nHelpful | 4", "genivkay9 days ago\nArcade fun\n\nLove it. 1st person shooter. Easy controller use, very intuitive handling and options. Pacing myself so I don't burn out. Lol\n\nHelpful | 0", "ThomTom1Jul 25 at 7:39 PM\nAmazing Game\n\nOverall this is an amazing experience the variety of guns is awesome. The power ups are a nice touch and the different droids add a nice flare to the gameplay. Definitely a blast to play with family and friends.\n\nI highly recommend!\n\nHelpful | 0", "FatherClibzJul 27 at 7:55 AM\nJust play it.\n\nUse the power ups and turrets. Dont forget you have a shield. Your sword beam can pull the power ups to safe areas while you fight. Making it harder for your precious power ups to be mistakenly hit. Please make another.\n\nHelpful | 0", "OculusBurns10 days ago\nI need more games like this!!\n\nMy absolute favorite game. I want more!\nMore backgrounds, more enemies and more weapons! Im a Space Pirate!!\n\nHelpful | 0", "lowresferret11 days ago\nAmazing arcade style shooter\n\nThis is my my third fav game on quest cuz of just how action packed this game can get. It runs rly smooth even with all the particles on screen. I rly like the SUPERHOT esc bullet time and I like the shield feature if it gets too overwhelming so this is a great game for be veterans or vr newbies and all in between\n\nHelpful | 0", "Gannan14 days ago\nSo many ways to play\n\nIt seems like a simple game at first but when you learn the weapons it's amazing the different ways to play. Great game!\n\nHelpful | 0", "Darth_YorkieJul 3 at 3:57 AM\nBest VR game I own!\n\nThis game is TOO much fun. After doing Neo dodges and holding my arms up for several hours over the course of a day, this game has become my new workout routine.\n\nBecause of this game, I purchased a second Oculus Rift for my aging parents to help them stay active!\n\nHelpful | 5\nDeveloper ResponseJun 7 at 1:15 AM\n\nGreat to hear, thanks!", "Deluste5 days ago\nWorth buying\n\nThis is a staple to play when youre bored with a bit of space.\n\nHelpful | 0", "alexlicious24 days ago\nGreat arcade shooter for me and the wife\n\nDefinitely our current favorite arcade shooter on the quest. I recommend using a large guardian area to move around in. More games like this please\n\nHelpful | 0", "penguinfull24 days ago\nVery fun but....\n\nSo i just got the game and im on stage 25 but this is very hard if you like a challenge get this game\n\nBut other than that it is so good\n\nHelpful | 1", "MoldyLemonSayWhatJul 23 at 7:26 PM\nIt really gets you moving.\n\nI don't know how many times I found my self near the ground or the amount of times it took me to get to the first boss fight and win, it was physically exhausting and therefore it felt rewarding.\n\nHelpful | 0", "catguy13 days ago\nGreat!\n\nNot very good about writing reviews but liked the game so heres a review.\n\nHelpful | 1", "cRyOM1DKN1GHTJul 19 at 9:07 PM\nGreat game\n\nIn my opinion, this game is great. I catch myself everyday playing this game and Im tired of being asked to review it. The graphics arent as good as the rift version but it is still fun.\n\nHelpful | 0", "SJ11177 days ago\nAwesome\n\nVery fun and can play all day!\n\nHelpful | 0", "matthiasbrust14 days ago\nEnjoy this game the most\n\nI just love it. 5 min or 20 min game play. Anything is good.\n\nHelpful | 0", "messbrianMar 28 at 4:33 AM\nMess50727\n\nGreat game. The weapons and spaceships are very realistic. Switching between shield and weapon is easy. The different weapons add to the game too. I just cant figure out how to unlock the different scenes. I wish they had some bro on that either in the game or on the app.\n\nIve had lots of fun with this game and its a great way to unwind after a long day at work.\n\nInstructions on how to get unlocks would help greatly!\n\nHelpful | 102", "imperfect-key478Jun 28 at 9:36 AM\nSpace invader VR\n\nGreat game, just like classic arcade games with it being based in space. I can play for hours without stopping because Im tired of it. The final levels are a challenge but it is a great challenge.\n\nHelpful | 2", "NiceFluffyHatJul 21 at 8:00 AM\nSimply awesome!\n\nFun and challenging, variety in weapons. Extra cool when you play on the quest without wires. Satisfying to shoot stuff and overall awesome. A must have!\n\nHelpful | 0", "ttv.xXcaptainrex23Jul 22 at 5:12 PM\n\nGood game just wish that you can travel to different worlds in the ship that is behind you in the game. And I would be cooling you can do a space battle using your ship\n\nHelpful | 1", "Luk30714 days ago\nAMAZING!!!\n\nSuper replayable, a great game for the quest!\n\nHelpful | 0", "Ahonne24 days ago\nGet it!\n\nThe game is hard but the game Play is easy. Many hours of fun. And your puls will be going Up!\n\nHelpful | 0", "MaxGamerTV10May 3 at 7:07 PM\nAmazing!\n\nOne of the best games on oculus! This game is fun to just relax and smash robots with swords and guns! One wish though. Maybe a story mode or challenges like shield and sword only would give the game way more fun and would definitely add more to the game!\n\nHelpful | 14", "OnePerspectiveMay 2 at 3:19 PM\nSuperb weapon models!\n\nOverall the game is lots of fun. The weapon models and graphics are really detailed and the game is pretty polished. Im new to VR but I can tell this is one of the best arcade shooters in the store.\n\nCriticisms for devs:\nWhen enemies get close and start surrounding you, the limited Field Of View of the Quest makes it difficult to keep track of them and I end up laying on the floor trying to dodge 100 bullets. Not that its always bad! But it can get very hectic. Perhaps add an optional HUD for keeping track of enemies outside your FOV.\n\nHelpful | 11", "SurWillard11 days ago\nI love it\n\nBest game ever\n\nHelpful | 0", "gussetwookie25 days ago\nSo much fun\n\nMy family and I love Space Pirate Trainer, it is our go to 1st game on the Quest.\n\nHelpful | 1", "cyberXDJul 24 at 4:17 PM\nAmazing\n\nThis is game is really simple but super fun, could play for hours. Hands down one of the best games on the quest.\n\nHelpful | 0", "ToasterRosterJul 14 at 11:24 PM\nBest shooter ever!\n\nWhen I bought my Quest I wanted this game from the beginning I love it so much the only problem is that I cant stop playing. P.S. sorry for my bad punctuation\n\nHelpful | 1", "BigChorizo20Jun 2 at 3:53 PM\nIncredible, Mus Play Title\n\nThis game is incredible, its super fun and I really like the choice to start at a certain level that youve completed recently, because I know that it would be stressful to start from round one, the fact that you can shoot down robots with epic guns and dodge bullets in slow motion makes this game even funner, so all in all if youre looking for a good game to play for hours I HIGHLY Recommend buying this game for endless fun.\n\nHelpful | 2", "ShadyBradyAZJun 26 at 4:57 PM\nEpic Shooter\n\nLove this Game!!!!\nThis was my first VR experience over a year ago.\nI own almost Every Title on Quest now!\nThis is by far my favorite!!!\nLots of weapons and game play styles.\nLove the 3 Lives Arcade Mode.\nAlways trying to top my High score.\n\nHelpful | 0", "Stronglike_yOu14 days ago\nFantastic game\n\nLoving it.\n\nHelpful | 0", "JJBAD510 days ago\nHad it as a demo\n\nI got this game as a demo when I bought the Oculus Quest and I like it so I decided to buy it. To me It was not worth buying it because it was more of what you got on the demo. It was the same. It would be cool if you could hide behind the space ship that is behind you. If I would have known I would just stay with demo.\n\nHelpful | 1", "Vitamin_b13ach14 days ago\n\nLove this game\n\nHelpful | 0", "qyilJul 13 at 1:14 PM\nExciting!\n\nFast paced, exciting arcade shooter. I can't express how amazing it is to be INSIDE an arcade shooter. Very immersive and heart pounding. Well done!\n\nHelpful | 0", "djangelic16 days ago\nA lot of fun\n\nKeeps me playing\n\nHelpful | 0", "venkattejamakkena18 days ago\nGood one.\n\nNice one for the price.\n\nHelpful | 0", "GrimxxmastrJul 12 at 12:22 PM\nExcellent\n\nHaven't gotten very far ( 14 waves ) but I keep trying to play the the tazer/melee in both hands. Feels so good to yank one in and slice it in half with the other!!!\n\nHelpful | 0", "daddyobrownJul 6 at 1:36 PM\nA simple but engrossing game\n\nThis game seems simple, but has layers of complexity that leads to many hours of trying to improve your skill. I wish more games had this kind of scoring, leveling, and scaling\n\nHelpful | 1\nDeveloper ResponseJul 7 at 2:11 PM\n\nAlways great to read that people appreciate small but time-consuming subtleties in gameplay. thanks for this review!", "TacodestroyerJul 21 at 3:33 PM\nGalaga on steroids\n\nIf u like arcade shooters this one is perfect for you. Multiple weapons, bosses and great soundtrack.\n\nHelpful | 0", "Dark_BlossomJul 4 at 7:44 PM\nGreat game especially for the price.\n\nI recently got this game and it is phenomenal, I like the different weapons, (my favourite ones are the brawler and ion grenade) I recomento this game to anyone who enjoys a good FPS!\n\nHelpful | 1", "Ollinnature11 hours ago\nNice game to play during breaks\n\nI never go out of my way to play this game but it is nice to have it to play during a break between work. Its a very good shooter that resembles the 90s arcades so if that interests you then get it.\n\nHelpful | 0", "Fergus13Jul 15 at 12:49 PM\nAmazing!!!\n\nI would totally recommend this game to anyone an it is non violente and decently cheap for VR games, my favorite game so far.\n\nHelpful | 1", "alex1500Jul 23 at 2:25 PM\nAwesome\n\nThis game is exciting, thrilling, dangerous, and most importantly fun.My dad loves it\n\nHelpful | 0", "krisdestructionJul 25 at 10:26 PM\nNice, but want more modes\n\nNice, but want a few more modes and maybe a different waves or co-op\n\nHelpful | 0", "snailovercelloJul 17 at 5:26 PM\nArcade style shooter\n\nExcept... youre in the arcade. Like IN it ! One of the best experiences on the oculus. Worth every quarter.\n\nHelpful | 0", "RickK75Jul 24 at 6:12 PM\nEssential Quest game\n\nAmazing game for the price. A stunning port of the PC VR game.\n\nHelpful | 0", "Attikus760Jul 11 at 12:55 PM\nPretty Good\n\nThis is a training simulation.... but I keep playing. .. and playing. You basically go through a training module with the intentions of getting as far as you can. The controls are perfect and the graphics are top notch. There is no story as far as I can tell, but its still just fun to play.\n\nHelpful | 1", "wigginswadeApr 6 at 8:16 PM\nThe more I play the more fun it gets!\n\nYou think you know a game. Then you say to yourself, wonder how far I can go without guns. So I grab the shield in both hands and it turns into a completely different game! Slamming the robots to the ground and activating the three turrets to destroy my opponents for me.\n\nJust wow, a whole new different experience!\n\nHelpful | 16", "SpaceInsomniac24 days ago\nEpic\n\nFortnite\nYeah\n\nHelpful | 1", "Zack-de-la-rocha21 days ago\nsweet shooting game. needs campaing mode\n\nthis is one of the best shooting games I've played, the sheild and different ways to use the various weapons makes it stand out. very cool. itjusf gets repetitive and boring quick after an hour or two. needs a campaign mode to spice things up, maybe with a small story.\n\nHelpful | 1", "chad.hertlerJul 29 at 7:05 PM\nIf you were a Galicia fan... \n\nYou will be in heaven.\n\nHelpful | 0", "mindlugeJun 6 at 1:14 PM\ngreat game but let us play our own music\n\ni love this game, but the soundtrack gets tiresome. would really appreciate it if we could play our own music from mp3s or something. if you add that i'll change my rating to five stars. i want to keep playing this and not get tired of it. i know you can turn the music off, but that gets old too. thanks and i look forward to your other games.\n\nHelpful | 4", "roberthattonJul 17 at 7:28 AM\nSpace Pirate Trainer\n\nAwesome. You forget where you are and just become a space warrior. Must have.\n\nHelpful | 0", "SenSSi_Jun 27 at 7:32 AM\nInfinite replay value!\n\nNo cons, pure arcade Bad*ss shooter.\nBut, still would like if there was more scenes/maps 5/5\n\nHelpful | 2", "LangmowermanJul 18 at 1:52 PM\nSpace Pirate Snoozer\n\nYo ho, yo ho, a Space Pirates life for Zzzz...\nI made the mistake of keeping Space Pirate Snoozer, writing a review to hopefully save you a few hard earned doubloons. Its a borefest that only gets worse over time. Why does it suck so bad? Is it the overly repetitive gameplay? The lack of strategy? Or maybe its the laggy way the gun fires?\n\nBuy Pistol Whip and if you already have it and are thinking maybe this will be fun as well dont bother mateysunless you need help falling asleep. Zzzzzz...\n\nHelpful | 2", "Dojastylz1Jul 23 at 4:00 PM\nThis game is totally immersive!\n\nAwesome game, one of my favs on the quest!\n\nHelpful | 0", "Sydney_RobsterJul 26 at 1:55 AM\nA good looking 15 min filler game\n\nI got this game because it looks good and I thought it would great when I want to fill 15 mins with something fast and frantic. It doesn't disappoint there.\n\nHowever, it's not a game that I've feel compelled to play because it's really good. Actually, I don't find it as much fun as I thought it would be. Normally, when I do play it, I feel I've had enough after 3 rounds.\n\nHelpful | 0", "SerkesMay 10 at 7:39 AM\nA classic\n\nThis game is incredible and has been around since the early days of VR. This is a must-have for any oculus owner. I believe it will one day be considered one of the classic arcade games for VR.\n\nHelpful | 7\nDeveloper ResponseMay 10 at 8:46 AM\n\nAwwww shucks, thanks for the amazing review!", "obi2kenobiJul 3 at 12:24 PM\nUpdated for 2020 relevance\n\nOriginal review was at release and it was one of the best games in store.\n\nIt is still a fun game, and provides good immersion with the 6dof movement and dodging blaster fire non-stop or hiding behind force fields.\n\nHowever, in comparison to what is out in the store now, I can't call it a 5* game. I have gone back through all my reviews to scale them accordingly, and only the most polished and mindblowing titles will get 5*. This game is polished, just isn't mindblowing (simple point and shoot game).\n\n\nOriginal review:\nOne of my favorite games and the cheapest since I got it on sale! But it is definitely worth full price too. There is obviously a ton of replay value to this game. I will be coming back again and again. Dodging bullets and hiding behind forcefields or shields while blasting wave after wave of enemies is a blast. Both your guns have several different fire modes. I mainly stuck to one mode but it will be fun experimenting to see what works best.\n\nHelpful | 1", "basbunderJul 29 at 2:38 PM\nGame breaking bug NEED HELP\n\nDevs is need help. Every item including the guns are flickering with black boxes.\n\nI love the game and would like to continue but i can't play it like this\n\nPlease help\n\nHelpful | 0\nDeveloper ResponseJul 29 at 8:49 PM\n\nTry charging and restarting your Quest. This happens in a very rare case of Quests, and seems to be independent of the title being played. If you have any further issues contact us at support@i-illusions.com", "benjamin.thurman.0519 days ago\nFun but not much to do\n\nI really really like this game, there are a few modes, sure but It gets old after a while, great at parties and a fun family game.\n\nHelpful | 0", "eapleasantJul 9 at 3:56 PM\nLove it\n\nThis reminds me of a game I used to play on my fathers vectrex. Its definently one of favorites.\n\nHelpful | 0", "Hollister231Jun 27 at 7:26 AM\nLove this game!\n\nThis is one of the first games I officially purchased, it's perfect to jump in, shoot some stuff and feel good about it lol. Super fun and a nice challenge\n\nHelpful | 0", "Bukunara42Jul 7 at 10:15 PM\nAll you need\n\nI have had the oculus since February and havent really left SPT. love the training.\n\n\nI train hard\n\nHelpful | 0", "POW-PrisonerOfWhitesJul 23 at 1:44 PM\nAwesome. Worth half its price $6.99\n\nExcellent for exercise, full body\n\nPerfect for seatednot optimized\n\nPerfect for locomotivesnot optimized\n\nOverall so far the best game in Vr in my opinion not complete very short and room for growth however a stellar presentation of capabilities from a title that has already stood the test of time and will continue to. space pirate Trainer\n\nBUY IT IMO, even though I see it as over priced, compared to the clunkality of most other titles the extortion is tolerated to help the devs, locate someone with the vision to see what Im saying.\n\nHelpful | 0", "SullyRay14Jul 8 at 10:53 AM\nGood Times\n\nCool game. Good immersive experience. Not much to it, get in and get to work blasting alien balls.\n\nHelpful | 1", "veeseethreeJun 7 at 4:14 PM\nGreat visuals and features!\n\nLove this game! This point-and-shoot space adventure has a bunch of great features and weapons to combat space enemies and help you train to become the best Space Pirate in the galaxy!\n\nIf you like shooting games and space this ones for you!\n\nHelpful | 1", "The_radio_starJun 12 at 7:11 PM\nYes, its a blast!\n\nJust like the description says, its inspired by a classic arcade cabinet game. It a great way to unwind after work while were in a pandemic. These VR games are helping me adjust and resist the urge to socialize.\n\nHelpful | 0", "Littlenicky160Jul 14 at 3:36 PM\nGreat game for quest\n\nThe game is very addictive and has endless replay value.\n\nHelpful | 0", "sugaree28Jul 4 at 11:51 PM\n\nOne of the first games we bought and we keep going back to it. One really nice thing about it is that my husband can play it sitting down. He can't play any standing games. It definitely reminds me of old school arcade games, except now you're inside the game!\n\nHelpful | 0", "ToTalXSMay 31 at 6:55 AM\nHigh energy nonstop fun\n\nThis is just a great shooter that's straight forward and to the point...shoot and don't get shot..it's fun and never the same twice. Graphics are good and the environment puts you right there. Don't be surprised when you start all the matrix moves to avoid getting hit.\n\nHelpful | 1", "RCAcreeJul 4 at 8:02 PM\nDuck hunt, but they shoot back.\n\nIf you're itching to get some target practice in and blow some drones up this is the game for you.\n\nHelpful | 0", "OctoManUnoJun 27 at 8:53 AM\nSuggestion\n\nThis game is epic, but I was hoping for more content...\n\nHelpful | 2", "CynicalRaidJun 22 at 2:11 PM\nGreat app\n\nIt is a fun game to play there are a ton of weapons and modes to explore and it has a good challenge in it, so you will never get bored of this game!!!\n\nHelpful | 0", "HB3864Jul 5 at 6:39 AM\nspace trainer\n\nI like this game a lot its a game that can be played sitting down or standing\n\nHelpful | 0", "Starnight998Jul 18 at 12:20 AM\nEpic\n\nSwag\n\nHelpful | 0", "SicoSiberJun 26 at 10:55 AM\nGood for new users\n\nEven though I am newer than some to vr, I hit it pretty hard and began learning how to develop for it too. I have also tried oculus link and think that the quest is definitely the best headset out there right now. That said, this is a very repetitive arcade shooter where only room scale movement happens which means new users wont get dizzy. However, this game does get completely outshined by boneworks, half life alyx, lone echo, and pistol whip. As far as arcade style games go though, this one isnt number 1 but its pretty far up there. Cheers to everyone who worked on this game and made a fun, nostalgic and really immersive game. (Also I love the simple controls)\n\nHelpful | 1", "FireInTheBowlJul 5 at 11:59 AM\nAwaesome\n\nA lot of fun. You may need a decent amount of space to move around in to be better imo\n\nHelpful | 1", "tagzz_jack1469Jul 1 at 6:49 AM\nAMAZING GAME!!!!!\n\nI loved every second of this game. It is so well made and very fun for all ages.\n\nHelpful | 1\nDeveloper ResponseJul 1 at 7:52 AM\n\nThank you so much for the support and kind words!", "attimus02Jun 22 at 5:00 PM\nBest shooter on the oculus right now\n\nThis game is so much fun! It reminds me of old school games that get harder as you play until you cant beat it\n\nHelpful | 1", "Ash.JarboJul 12 at 1:26 PM\nWell done\n\nGreat and fun\n\nHelpful | 0", "jontygoodbloomFeb 11 at 8:29 AM\nArghhhhhh\n\nThis is the perfect trainer for aspiring space pirates, for years I dreamed of the endless void and all the plunder that lay within her and this application was the perfect introduction. In fact I would credit it with landing me my first commission aboard the Deep Void Explorer back before the Federation's expansion rendered space pirating almost impossible. I spent 7 fulfilling years plundering, burning and filleting until one day I took a miscalculated risk and ended up in space prison. It's easy to lose sight of ones goals whilst covered in space jewels, with a different girl in every space dock. Well, even in prison my Space Pirate Trainer training help me towards 2 close, but ultimately unsuccessful escape attempts. The second attempt involved the death of a much liked and notoriously fair space prison guard, Mallwok. After that the probing intensified, not everything you hear about aliens is true, but they do love to probe. They probed so much that I became accustomed to the nightly hum and the dull invasive sensation. Even now, years after my rehabilitation and eventual release (much to the credit of Tharog, a kindly space councillor) I still sleep with a long handled boom beside my bed. Please play this game, but don't be tempted into a life of blaggardary, it only brings space sadness.\n\nHelpful | 194", "Sky4FoxJun 28 at 7:05 AM\nLove the action\n\nI love think-fast games that are full of action and this one is really well made!\n\nHelpful | 1", "OllieBurallJul 9 at 9:19 AM\nGood game\n\nYou should buy this game\n\nHelpful | 0", "Woody1232123Jul 8 at 4:15 PM\nGreat game\n\nThis is a really simple but fun shooting game!!!\n\nHelpful | 1", "silverhand1121Jun 12 at 5:28 PM\nAmazing\n\nThe game is absolutely amazing, the graphics are great on the quest its replay value is through the roof and it honestly has amazing weapon combinations\n\nHelpful | 1", "TritonBossMay 8 at 3:54 PM\nBest 1-player shooter in the Oculus\n\nGet transported to a new immersive world and battle alien/robots. You can slow move when they are shooting you to avoid getting hit. It is like playing space invaders, but on VR. My favorite game in the store\n\nHelpful | 3", "PixxelldudeVR2 days ago\nBEST Game ever!\n\nBest game ever, don't get skeptical about it, just get it, then thank me later, its probably the best game on the oculus quest and is better than beat saber or superhot, I just wonder how do I get the golden gun skin? The other gun skins are easier to get, other than that, amazing game!\n\nHelpful | 0", "GalaxyDancer08Jul 2 at 1:54 PM\nFave\n\nGreat old style shoot em up. More like this please\n\nHelpful | 0", "george.patterson.4May 31 at 6:48 AM\nLOVE THIS GAME!\n\nNon-stop Action! Easy controls and a decent verity of weapons and upgrades. Gets challenging real quick. Great workout, dodging and veaving, the bots always have me pinned to the floor by the end of my lives.\n\nHelpful | 1", "nishruu2Jul 9 at 4:16 AM\nbest space shooter\n\na blast played demo too many times before buying\ngreat intense wave shooter\ngame is a blast.\n\nmy favorite ..kill it if you can ..;-}\nmore and more haaaaaaa\n\nHelpful | 1", "OmniChriosJul 3 at 7:25 PM\nGreat early purchase\n\nIf I had a bad thing to say about this game, it's that I can't seem to buy it twice. Great music, the game's scenery and art is imaginative, and it does well as a \"Just one quick round\" kinda game\n\nHelpful | 0", "airjajaJul 4 at 6:05 PM\nSmall bugs get annoying at later waves\n\nIt was surprisingly fun to play it and it was quite fulfillment after defeating the big boss after Wave 35. However, after that I started to find more and more often my weapon switching (especially the right hand) does not work (even the indicator shows the right weapon). And with so many enemies and laser beams flying in the air the time flow really gets bogged down . To some stage(>Wave45), the Quest will kind of crash (constantly flicking/blinking images, etc) during the game, which really sucks when I was try to finish the game. It seems that there is nothing new the programmer can throw out instead of tons of small buggy drones until the system/player is overwhelmed. This late stage really hurts the fun of the game.\n\nHelpful | 1", "CMac1717May 11 at 1:50 PM\nGreatest game ever!!!\n\nCan I give 10 stars?\n\nI'm completed addicted! I've been playing this game 6 days a week since I got my vr in mid dec, it's may now. I have a big room, I play an 1-1.5 hrs a day and I've lost 15 lbs... lol. I weigh what I weighed in university (2002).... thanks space pirate!!!\n\nAlso greatest game bc its one area, one platform, one room. You always know where you are in relation to your actual room, it's easier to run at full speed with confidence when your room in the game never changes... more games need to copy that.\n\nHelpful | 16", "joebossuprstarMay 21 at 3:27 PM\nA great wave shooter\n\nI normally dont write reviews even for games like beat saber or super hot but this game is just so good I thought I had to tel potential buyers to get this game\n\nHelpful | 2\nDeveloper ResponseMay 22 at 5:04 AM\n\nthanks for taking the time!!", "d3signmonk3yJun 15 at 11:24 AM\nGreat game\n\nReally enjoy this game. One of the most immersive fast paced games Ive tried. Super fluid and fun to play.\n\nHelpful | 1", "KrisVR6 days ago\nOne of the best VR game out there!\n\nI have orygina Pc version on Steam as well , this is one of THE BEST games VR so far in my opinion :) you will have 1:1 same expirence with Quest version compare to PC wireless experience with V.Desktop (graphics downgrade is no heart breaker )! highly recommend! :))) must have for every VR gamer !\n\nHelpful | 0\nDeveloper Response6 days ago\n\nThank YOU for your support!", "ShinZo702 days ago\nNew to the World of VR gaming..\n\nI'm new to the World of VR gaming. I thought I was getting something easy by choosing this game as my first purchase.  I was definitely wrong by thinking that. You definitely get a good workout with this game.  I give it 2 thumb up.\n\n\nHelpful | 0", "lgmarvalJun 29 at 5:05 AM\nAmazing game....\n\nIs very active and real....\n\nHelpful | 1", "bakasama333Jun 3 at 6:32 PM\nsimple but great\n\nthis is one of the first games I did in vr and I just keep coming back to this one.\n\nit's simple, there isn't much to it really, but I still love it\n\nHelpful | 1", "generic.fitMar 23 at 3:15 AM\nA no-brainer essential\n\nThis is a baseline essential game for the Quest. Its not a deep story or heavy strategy. Just quick, jump-in-at-any-time, arcade shooter immersion. Blasting robots and dodging lasers till you croak. Like Mrs. Pac Man for Atariyou return to it because it feels good to play (whether you just want to take a minute or two to smash robots or you actually get really good at it). Makes use of all that is great about virtual reality.\n\nHelpful | 8", "MarcusN8840May 27 at 9:48 PM\nFamily Rivalry for High Score\n\nThis game is great for getting family bragging rights. My wife and kids love it. Seems like anyone can pick up and play, but it is also deep enough for serious gamers to enjoy.\n\nHelpful | 1", "hannahb84May 5 at 5:19 PM\nFun game\n\nVery fun space shooting game. Lots of weapons and action and choices. Its very active, you have to move around a lot, I like it and see myself using it for awhile.\n\nHelpful | 3", "LadelyGooseMay 2 at 2:20 AM\nGood quality high score chasing shooter.\n\nAs with most games in the oculus store, this game achieves the standard high quality. If you are a fan of high score chasing shooters then this game is for you. Smooth organic feeling gameplay combined with addictive level hunting obsession. I would recommend, especially to those who clocked many hours on games like space invaders many years ago.\n\nHelpful | 1", "Nephalem_ReaperMay 2 at 9:52 AM\nFor devs and users\n\nFeedback for the potential buyer: This game is awesome. I bought it on a package along with Superhot and I ended leaving SHot and playing this game a few hours, every day. The graphics and the use of VR space to make you move to dodge bullets its awesome. If you play this game how its supposed to, you definitely tone up your legs.\n\nFeedbacks for the developers: I suggest this game keeps on being expanded. Make a story of the player, maybe walk around in different environments like arcade games, different dificulties to unlock, to buy or unlock more weapons (or styles for the gun, or for one style of each shooting type), to remove the first time tutorial big button from the main menu (put on one edge in a small button or something). A multi-player version of this game to play along or to challenge someone would be really awesome. I'm thinking in challenge that if you do a combo eliminating robots, your opponent receives extra higher difficulty and with more health robots (maybe red robots for easier identification) in that wave.\n\nEven when I think that this game can be much more, I think its really awesome, and doesn't deserve less than 5 stars.\n\nHelpful | 1", "puddlediver1May 26 at 9:04 PM\nWhat a workout\n\nI really love this. Excellent gameplay, graphics, music and total experience. Awesome. Thanks devs\n\nHelpful | 2\nDeveloper ResponseMay 27 at 9:16 AM\n\nYou're welcome! Thank you for playing and writing this review.", "Matt_Does_VRJun 14 at 7:34 PM\nMost fun Ive had in a VR game\n\nReally fun overall to play and has lots of replay value! Totally worth the $15\n\nHelpful | 0", "MisterfriteMay 15 at 6:18 AM\n\nThis is clearly space invader but in VR\nIf you like to shoot without thinking this game is made for you\nA classic game that you can come back at to play some more new games without being lost if you haven't played for months\n\nHelpful | 0", "Cat_ManJun 25 at 5:46 PM\nHa\n\nShoot shoot fun\n\nHelpful | 0", "DerekImmeJun 20 at 7:58 PM\nDecent\n\nThis is a classic game that is very fun. The game does get repetitive tho, especially because Ive already beaten the game. Its a nice game to have overall and is good to show to friends and family\n\nHelpful | 1", "jetsboy27May 3 at 9:54 AM\nCant put it down\n\nI heard a lot of good things from friends, having only recently gotten my own quest this is such a great game. The different modes and types of enemies are awesome, love being in VR space invaders!!!!\n\nHelpful | 2", "WINGWANG232Jul 19 at 8:47 PM\nLack of content, but very replayable\n\nNot much else to say. You get your moneys worth.\n\nHelpful | 0", "theVergeerJun 16 at 5:36 PM\nThis is the reason I bought the oculos\n\nSix stars.\nSeven if you let fly that d#mn ship\n\nHelpful | 1", "MaelwolfApr 19 at 10:59 PM\nAye Aye\n\nA very polished, visually impressive arcade shooter. Its straightforward without being overly simple. You have different fire modes, a shield, power ups, and more that you can gain or switch through as needed. This is the perfect drop in for a quick match type of game.\n\nHelpful | 2", "Dylan-Maximum46Jun 11 at 8:18 PM\nIt's fun but gets boring after a while\n\nI've played almost non-stop be for the last 3days and got this game cuz I tried the demo and it seemed fun but after like the 7th time fighting in the waves it hot boring\nI would love it if it wasn't always the same waves each time\n\nHelpful | 0", "Bigmike68ncJun 6 at 7:54 AM\nSpace pirate trainer is awesome\n\nMy fav game on the quest following after is pistol whip great work out for both games\n\nHelpful | 0", "jdechico93Apr 5 at 1:05 PM\nAmazing but repetitive.\n\nThis is a really fun game you can play for an hour or two before you get bored from the repetitiveness. I will say that I play everyday, but I wish there was something a little more. Something like challenges, co-op, or even a level where your guns change each round. You know, something to keep it fresh.\n\nHelpful | 11", "bemills86Jun 10 at 5:15 AM\nGreat game!\n\nThe gameplay is fun and entertaining! Everyone who trys my quest loves this game.\n\nHelpful | 0", "Luckymase616May 3 at 6:11 PM\nStory mode?\n\nSpace Pirate Trainer is a fun game that I would recommend for a first experience on Oculus Quest. Its pretty fun and I find myself playing it when I wanna get active on quest. But theres only four modes which all seem almost exactly the same. It would make it cool if there was a short 10-20 minute story mode that you can play through. I dont know how they would do that, but its something to look into. Then again, the game is $14.99 so you get what you pay for.\n\nHelpful | 3", "OutrageousOctoJul 6 at 3:28 PM\nMaybe try out the demo first\n\nThe demo contains most of the game, and there really isnt a story, but overall fun nonetheless.\n\nHelpful | 1", "mammothtrashMay 20 at 9:19 PM\nA Ton of Fun\n\nThis game is a lot of fun. The tutorials and training are lacking a bit but it is fairly intuitive. Time flys when playing, 30 minutes flew by before I realized it.\n\nHelpful | 1", "joann.dillon.92Mar 30 at 9:47 AM\nSpace Invaders epic battle\n\nI bought this game on a whim but it has been one of my favorite games! Im not really a gamer but having to kill these little space droids is awesome. They are shooting at you so you have to dodge their rays by leaning or moving a step or two. Its definitely worth a try. I love it!\n\nHelpful | 3", "poisonwolf911May 10 at 4:42 PM\nLove this game\n\nPlayed it on htc vive when it first came out, new changes have made it even more fun.\n\nHelpful | 3", "thirion0924Jun 12 at 9:17 PM\nSo fun!\n\nIt will make you feel like Star Lord.\n\nHelpful | 1", "Jsosa27Jun 18 at 12:02 PM\nNeeds a level editor\n\nIve been playing this game for a long time, I loved it. And I wondered if you devs could make a level maker. It sounds stupid but believe me, it is a arcade game but if people could do it the game would be good. Things for the editor: 1 the amount of droids you could put, 2 what power ups to put in the droids, 3 local high scores, 4 when putting a replay make the amount of little flying droids (the ones that appear in replay levels.) this was a idea, thank you for reading.\n\nHelpful | 3\nDeveloper ResponseApr 29 at 9:40 PM\n\nHi there Jsosa27, thanks for the great feedback!", "BigKingTMay 24 at 9:50 AM\nClassic arcade shooter in VR\n\nThis one of my most favorite games. Easy weapon swapping. Great graphics. So immersive too! This is definitely worth picking up.\n\nHelpful | 0", "cboliMay 19 at 5:36 PM\nZap em good\n\nA really fun game that plays on many different levels. You can just have fun or try out different weapons and strategies to get good.\n\nHelpful | 0", "jelwellMay 18 at 11:39 PM\nThis is the Game that made by buy VR\n\nThis game is the reason I bought a Quest. I tried it on an HTC Vive at mall rental space. Great game. I gave it only 4 stars because after a while I got bored of trying to beat the game. I feel like I might have been REALLY close to finishing all the levels, but my attention just went somewhere else.\n\nLove all the weapon options and all the movement I end up doing while playing. Thanks for making a great game.\n\nHelpful | 0\nDeveloper ResponseMay 19 at 1:31 AM\n\nThere are 99 levels, and then the game goes into algorithmic mode until either you or the Quest run out of energy :D", "KedishMay 31 at 7:11 PM\nGreat Game\n\nTried this on a friends oculus and had to have it. First game i bought.\n\nHelpful | 0", "JoelMagicalJul 17 at 9:44 AM\nMeh\n\nIts alright I guess... gets old.\n\nHelpful | 2", "Silicon_NationMay 12 at 2:03 AM\nVery fun for the price.\n\nYou fight waves of robots with cool weapons. Very neat feel to the game, very sci-fi.\n\nHelpful | 2", "DeepMellowJun 18 at 9:20 PM\nGame is ok for 5 minutes.\n\nTerrible boring shooter game. Ive played games that are more fun and look better on the Wii that came out 15 years ago. Phone app games are better than this. Very little content. Dont waste a refund trying it out. You could get stuck with it like I did. No updates, no new content. Just stand in one spot and shoot at the same type of robots. Duck hunt was more fun with better graphics than this.\n\nHelpful | 4\nDeveloper ResponseJun 25 at 1:51 AM\n\nSorry to hear Space Pirate Trainer wasn't for you, glad to hear Duck Hunt is scratching your itch though", "Dragon19802Jun 17 at 3:23 PM\nVR Space Invaders\n\nThis is a fun game to kill time it take me back to the late 80s space Invaders only in vr.\n\nHelpful | 2", "ThomasCross95Dec 22 at 4:52 PM\nFather has stolen my Quest\n\nAlways loved this game when I played on other peoples headsets. Bought it when I got the Oculus Quest. Still love it.\n\nOnly issue is this: my father, who is 58, and has never played VR before this instance, is completely addicted to this game. Its unbelievable. Let this be a testament to its intrinsic playability. Well done.\n\nHelpful | 379", "EdoSignaJun 9 at 8:54 PM\nSpace pirate trainer\n\nI have a couple complaints. switching weapons when you didnt want to can be an issue. Limit levels and music. But even that isnt enough to afford it less than four stars.\n\nHelpful | 0", "Kiblet5 days ago\nAmazing and perfect\n\nIf you havent played vr or you are showing be to somebody this is the perfect first game to show them. Also this game is perfect in general.\n\nHelpful | 0", "MeakaMay 4 at 12:37 PM\nAmazing. Great buy.\n\nThis is a great shooter. One of my favorite fps games on the quest. Challenging but not difficult to figure out or play. Controls are very intuitive and easy to figure out from the start.\n\nHelpful | 1", "Redwood1313Jun 7 at 2:48 PM\nSo cool\n\nLove this game.\n\nHelpful | 1", "BooallenMay 5 at 11:14 AM\nLove this game!!!\n\nI really have no clue how it all works, I havent even gotten of the first deck but I have a blast and it is a great work out!!\n\nHelpful | 2", "umuthiMar 31 at 5:51 PM\nIntro to VR\n\nThis game is a fantastic introduction to VR. You move in a relatively small space and without constraints, which increases immersion. It is very arcade-like and is great to show first time VR players. I have played it on both the rift and quest and this version amazes.\n\nHelpful | 2", "JettDelzerMay 9 at 8:50 PM\nAmazing game\n\nOne of the best I have played on the oculus quest especially for beginners\n\nHelpful | 2", "PerogyBoyMay 21 at 1:30 PM\nMy Favorite game\n\nFirst game I ever tried on the Quest, and one of my favorites so far. Great SciFi theme. Very immersive. Love how the weapons feel in your hands. I just wish the instructions were a bit better. I had to learn techniques via Youtube.\nHighly recommended.\n\nHelpful | 2", "ehsan.rastaghiFeb 20 at 12:08 PM\nWow basically space invaders vr.\n\nWow\n\nWhere to start! A very great game feels very much a remake of older ideas however this is not a bad thing.\n\nThe feeling of standing kn the platform looking out to space is actually incredible. The first time I fired the laser gun it gave me a feeling of the massive scale.\n\nGuns - they look great they are easy to use and switch between functions of modes. The projectiles look fantastic and the impact animations give a great satisfying feel when you hit enemies.\n\nEnemies - they look great and are varied. The enemies have different characteristics. They are all flying space ship type enemies however they fly differently and have different rates of fire and speed etc. Very much like space invaders.\n\nThere is no movement you are stationary however you can dodge and duck bullets. You have a choice of dual weapons, weapon and shield ot dual shields and you can swap these easily during game play.\n\nThe world look fantastic and give a great feeling of scale when faces with larger enemies.\n\nLots of replayability with high scores and varied modes of play.\n\nGreat game really am enjoying and look forward to.more from this dev team.\n\nBravo..\n\nHelpful | 9", "watchanishMay 9 at 12:42 AM\nDopest game on Oculus\n\nCrazy addictive! Just wish we could see how to unlock new arenas etc\n\nHelpful | 2", "EtanYTMay 12 at 7:40 AM\nAwesome\n\nAwesome\n\nHelpful | 3", "irchyboyApr 17 at 4:49 PM\nBest of Quest\n\nThis is the best shooter ever period. 3D Galaga. Ive never had so much fun with a gun. Great soundtracks. Fast and difficult shooter. Everything i think a vr shooter should be.\n\nHelpful | 2", "watchbradApr 7 at 3:59 PM\nOne word: addictive\n\nIf youre looking for a shooter game that feels like an old-school arcade game, and this is the experience for you. Its quite addictive and Im looking for other games with a similar feel. I find you can play this game sitting down if youd like, but I get my higher scores when standing up. A lot of good bullet dodging that way. Enjoy\n\nHelpful | 1", "TrappedInVRMay 2 at 11:59 AM\nPretty great\n\nI can spend hours mindlessly playing this game, the quest is perfect for arcade shooters like this.\n\nHelpful | 2", "RadicalRobMay 9 at 11:41 AM\nGood classic shooter\n\nVery immersive and simple gameplay. Does get a bit repetitive at time. Took a star off because I personally didnt get as much enjoyment as I'd had hoped. Would also recommend playing in a larger space to get the full experience.\n\nHelpful | 2", "ducky2020Apr 16 at 11:49 PM\nAwesomeness\n\nIt was scary at first seeing those BIG one eyed spaceships. Loved it! I'm glad I own a Quest. Never dreamed I would be in a space invaders game. Well sort of. Atari love.\n\nHelpful | 2", "DownvalleyJun 1 at 11:58 PM\nArcade action!\n\nTop Arcade spiel\n\nHelpful | 0", "ThepalehorseMay 24 at 4:59 PM\n5th demo, first purchase.\n\nI like it. It's a fun game. It's simple and challenging.\n\nHelpful | 0", "Happybullfrog25May 2 at 1:42 PM\nGreat visuals learning curve\n\nIt is fun if you play on explorer mode. Make sure to watch number 1 or high score players on YouTube first when you get frustrated. It will help you enjoy the game.\n\nHelpful | 1", "Quietsubset1452May 3 at 1:07 PM\nAwesome game!\n\nThis game is amazing!! You can Change all of your weapons and you get two of them!\n\nHelpful | 2\nDeveloper ResponseMay 3 at 9:50 AM\n\nThere are 99 hand programmed waves, and after that it goes into a never ending increasingly difficult algorithm", "erralbMay 12 at 12:55 PM\nGreat fun\n\nIt's good fun, definitely worth it!\n\nHelpful | 2", "TheWatcher84Jul 11 at 3:57 PM\nWorth Every Dimes!!\n\nOmg I was looking for a shooting game in Vr.. Im totally new at this whole VR thing .. and what my oculus came with as demos Ive tried them all out and came across this one last night so I decided to buy the whole gameS. I was looking for something relaxing not required other players or too much movements, dont get me wrong this game is definitely pretty active considering you can sit on a couch and do it. But the point is this game is awesome and it is everything I wanted.\nAlso does anyone know if theres a similar shooting game like the  first step  I can buy.? Thanks in advance.\n\nHelpful | 0", "jxbadwellMay 25 at 4:06 PM\nWorkout Trainer\n\nI do a lot of working out with this game\n\nHelpful | 0", "FraysureJun 20 at 8:08 PM\nFun game but\n\nAfter a while it gets kinda of repetitive though... still fun none the less\n\nHelpful | 1", "vernand1Mar 25 at 12:30 PM\nOne of VR best games\n\nI think this is one of my favorite games on the quest gives you good exercise yet quicken's your reflexes excellent and a lot of stages to get through it gets harder and harder and more fun all at the same time oh, you're absolutely cannot go wrong with this purchase\n\nHelpful | 2", "ItsRicoSuaveMay 25 at 8:06 PM\nFun but not long lasting\n\nThe price tag is about right. Its cool at first, but doesnt have much longevity. Its a good way to show off whats possible with your Quest, but you wont play it much once youve discovered better, more in-depth games.\n\nHelpful | 2", "CJFireApr 11 at 1:23 AM\nWicked\n\nAs far as shooting games go, I find this one very cool indeed.... It's great for all ages as there's not too much moving around and complicated controls, just shoot the robots as quick as you can without getting shot...... Wicked \n\nHelpful | 1", "MBruno37Mar 21 at 5:45 PM\nVery Fun Game!\n\nI recommend this game for anyone wants an amazing shooting game on the quest.\nThe game does get pretty difficult but as you play you find out new strategys and just get better. There are many different modes but I prefer the arcade wave style.\n\n\n~ Random VR Player\n\nHelpful | 2", "DzikulusApr 20 at 12:56 PM\nGreat game\n\nImmersive, great repeat value. Spend a lot of time in the game and Im still coming back to it. Highly recommended\n\nHelpful | 2", "noah.lugeonsMay 11 at 10:32 AM\nGets old quick\n\nIt's a fun game and for the price you get enough to justify buying it, but there's not much there. It makes for some fun moments here and there, but there are far better shooters available for the Quest that won't leave you longing for more game half an hour after you download them.\n\nHelpful | 2", "PrettyHateMachine76Apr 12 at 7:12 AM\nAmazing\n\nThis game is everything we wanted when VR starred... cant wait to see what else to come with this game updates. Maybe a co op ...\n\nHelpful | 2", "AngelosPikoulasMar 12 at 7:22 PM\nSix stars? This game rocks!\n\nI thought it would be just another senseless shooter, which I did enjoy since Space Invaders and 1942, but only for a bit.\n\nBut boy, this is different. The intensity is unreal, the exercise you get is immense, you realize why VR is so different to any previous game experiences. For its price of 11 pounds, it's a steal.\n\nYou will want to go back to it, again and again. It's so addictive, like nothing I've played. Never boring, cause the escalating challenges require you to act with full reflexes, to learn their formation, to be ruthless and fast to get to the next milestone. Oh boy, when you lose on the last one, it sucks!\n\nAt the end of the day, a shooter. But a super awesome one, even for non fans of the genre.\n\nHelpful | 2", "0neEyedSnakeJan 21 at 1:22 PM\nBest for the price\n\nThis game looks and plays great. At first it might seem too repetitive even though it does what it does very well, but as you get better there are new enemies to shoot that move quite differently, so the bar will get raised as you improve. Eventually there will be lazers coming at you from all angles and you will have nowhere to dodge...then you collapse, sweaty and laughing. Luckily the lazers don't hurt...yet.\n\nHelpful | 25", "GuacamoleKingMar 22 at 7:38 PM\nYeah you need this!\n\nIf you have VR you need this in your library. This is so much fun, and challenging, its worth the money! If you have just a few minutes and want to get out of your world for a bit, jump into this for a few! See how far you can get! Its Space Invaders on VR steroids.\n\nHelpful | 2", "thatguyiscool5May 20 at 2:23 PM\nyea\n\nyea, its yea, yea yea\n\nHelpful | 0", "RufflesFalcorApr 26 at 3:09 PM\nBest arcade shooter!\n\nCrazy fun. Super intuitive. Zero motion sickness. Very fun.\n\nHelpful | 2", "MuerdockJul 15 at 12:19 PM\nNO EXIT BUTTON\n\nThere is an exit button, i found it before they were very helpful and informed me of it. If you hold it down to long you just readjust your field of view. Im sorry. I really love this game otherwise. That is why I am so emotional.\n\nHelpful | 0\nDeveloper ResponseJul 16 at 12:27 AM\n\nThe exit button is on your right controller, just hit the 'Oculus' button and you will be taken to the Oculus menu. For further help with Space Pirate Trainer email us at support@i-illusions.com", "julian.robinsonwhiteApr 25 at 11:40 AM\nSuper Fun Game\n\nI really enjoy this game. I recommend before you purchase that you have plenty of room set up on your guardian to run around un obstructed or you wont get far. At a certain point in the game it becomes almost impossible to go any further but its fun trying anyway that fact that you are doomed to fail at some point regardless of skill is why i left out 1 Star.\n\nHelpful | 1", "FallenlineJul 4 at 4:53 AM\nBrilliant\n\nAmazing game, really gets you moving.\n\nWould recommend to any vr player.\n\nGets your virtual hand eye coordination going.\n\nDidn't know you could fire the shield for a good few levels.\n\nFound sticking close to your rear guardian bad idea. Keeping closer to front helped me alot.\n\nHelpful | 0", "larbarJun 1 at 3:22 PM\nFeel like Starlord meets Galaga\n\nVery engaging game, can get difficult very quickly, must use all your weapon options strategically to progress\n\nHelpful | 0", "Biohazard43May 16 at 8:12 PM\nGreat\n\nSpace invaders in VR\n\nHelpful | 0", "MLGCoachxXxFeb 11 at 4:30 PM\nDa best!\n\nI haven't played with the Oculus now for 6 months and I still return to this game all the time. I really do hope this is just training and a full-blown space pirate game comes out. I would love to be able to unload this arsenal of weapons. In a live world not just an arcade shooter. It is phenomenal though just as it is.\n\nHelpful | 6", "greenfutureApr 19 at 11:38 AM\nPerfect arcade game\n\nLove it, good music too, 90s arcade hall atmosphere , all I'm missing is some multiplayer and maybe like a campaign or an adventure thing to go with it\n\nHelpful | 1", "TransJenderGalMay 27 at 11:47 AM\n\nPure awesomeness. My favorite wave shooter. Feels sci fi. Feel arcade. Feels awesome. Too much fun at a great price.\nShould be one of the 1st aps purchased for VR imho\n\nHelpful | 1", "ImAllergyBoyApr 30 at 1:05 PM\nFantastic game\n\nREALLY REALLY FUN\n\nHelpful | 2", "Juan-117Apr 28 at 5:13 PM\nA Super Fun Shooter!!\n\nIt is a must have shooter game on the Oculus Quest! Definitely show it to your friends and family!\n\nHelpful | 1", "ItzYahBoyJJJun 25 at 11:57 AM\nAlmost a perfect game\n\nThis is one of, if not the best game I have. Its awesome trying to beat your high scores and play the 4 game modes. But it does go a little on the short side. If they added more game modes, more obstacles, and more customizations, then it would definitely be in the top 5 best oculus quest games.\n\nHelpful | 0", "ThatsALotOf_BeesApr 23 at 8:34 PM\n10/10\n\nThis game is action packed and lots of fun\n\nHelpful | 2", "dross_patriarch18 days ago\n\nI would like to see a story mode otherwise it's an awesome game\n\nHelpful | 0", "HazMatt3340Jul 8 at 10:53 AM\nGratifying feedback, good replay value\n\nSome of these VR games are a little fun and then done (e.g. plank experience). This game stays entertaining, with additions like competition and different level types. The demo doesnt do it justice!\n\nHelpful | 0", "philg7onr123Apr 1 at 1:31 AM\nGood fun !\n\nA very enjoyable game, takes me back to the old space invaders game, but light years ahead. I find it a great way to relax, enjoy the amazing effects whilst blasting away. Well worth the price !\n\nHelpful | 1", "nobleAlchemistMay 5 at 9:09 PM\nNot interesting\n\nThis is game is pretty simplistic but not easy. I did not really find it fun.You stay in the same place the whole time, which I knew going in, but still thought it could be fun. If you get hit 3 times you have to start over like an arcade game, or you can start from an unlocked level with some points(I don't completely get the system). Either way, the game wasn't fun enough to keep my interest, without a story or at least an interesting concept.\n\nHelpful | 1", "keisilApr 16 at 6:25 PM\nAmazing game\n\nI love this game. It is very entertaining and fun. I recommend it to all that like shooting games with a twist.\n\nHelpful | 1", "shortyj1976Mar 27 at 9:20 PM\n\nLove this game ..got introduced to it on windows mixed reality .it is soo much better with no wires to worry about ..It plays flawless.\n\nHelpful | 2", "dwoodsy90May 24 at 3:14 AM\nDecent, packing in content though.\n\nDecent game that's enjoyable, but it's lacking in content. At its price point its very much worth buying\n\nHelpful | 0", "MalequiFeb 21 at 11:59 PM\nDeserves every star\n\nThis was one of the first games that I bought after getting my Quest, and I find myself playing it every other day. I love everything about it. Im not good enough to beat certain waves, which can be frustrating but motivating. Its a well done game that I recommend to beginners and professionals alike.\n\nHelpful | 2", "jjeloApr 16 at 6:49 PM\nGreat game.\n\nThis game is awesome. My kids love it and keeps them occupied. Endless levels so they never get bored.\n\nHelpful | 1", "GreatKratosMar 17 at 2:38 AM\nThe open space\n\nThis game is fun to play when everything else fails you. It is also fast paced and challenging as the levels go on. Most definitely recommend it to play. Wish there was a campaign that was made with it, but the arcade mode is pretty fun by itself.\n\nHelpful | 0", "Bgamer001Jun 6 at 5:05 PM\nDemo is all you need\n\nThe demo is the entire game. It's just 3D Galaga. There is no story mode as it implied. It's just an arcade game. I want my money back. Crap game.\n\nHelpful | 2\nDeveloper ResponseJun 7 at 1:15 AM\n\nHere's the link with all info for a refund: https://support.oculus.com/964479930393572/", "p2johnstMar 6 at 2:23 PM\nSpace pirate trainer\n\nAmazing game! Got the quest for my 60th birthday, brilliant device and space pirate trainer is fantastic, coming from an older person perspective iv never really enjoyed playing video type games but this is totally different its like your inside another world and your not playing the game but rather actually taking part in it. For me its 10/10\n\nHelpful | 1", "lukas.lepine15 days ago\n\nGood game\n\nHelpful | 0", "tleedxMay 3 at 1:39 PM\nMore than \"Aaarrrgh-right\"\n\nGreat game, very addictive!  Some of the best fun I've had in VR recently. Could be 5 out of 5 stars, if there was a bit more variety, but for the price, this game rocks.\n\nHelpful | 1", "WaveTech325Mar 24 at 6:27 AM\nAMAZING\n\nThis game is pretty Awesome and I love how it keeps your data on one oculus quest for high scores. It is even cooler that their are turrets and different types of guns. This game is Galaga on Steroids. This game is AWESOME!!!\n\nHelpful | 0", "NicolettApr 27 at 7:16 PM\nworth\n\nexciting shooter arcade style game\n\nHelpful | 0", "KD-27Apr 29 at 2:20 AM\nExcellent concept - just a tech demo\n\nWave shooters are hardly new, however VR adds another dimension to the genre. While the game is good, it could be much, much more - it doesnt feel properly complete, just a good tech demo.\n\nThe game can be frustrating - certain game changes like turning off bullet time are locked to a completely seperate campaign - you literally have to start from scratch to try something slightly different, which is a drag after youve pushed through 35+ levels already with slightly different options. Instead, if these were customisable modifiers that changed your gameplay, they would be a much greater addition and increase the longevity of the game. Options are lacking - while the controls are intuitive, reaching for your shield behind your back will sometimes trigger accidentally and youll find yourself blocking shots with your gun instead, leading to accidental deaths - which leaves you restarting some five to ten levels prior - your games only save every five to ten level increments. Id prefer the option to make shield swapping a button on the controls, especially given the risk.\n\nOverall, a fun blast for an hour, but not a complete package. A bit more polish would make this game great.\n\nHelpful | 0", "Cauldron500May 23 at 1:10 PM\n\nI assumed that there would be more to it than just shooting. Like a story of some kind. Still fun, just disappointing on that end.\n\nHelpful | 2\nDeveloper ResponseMay 23 at 2:28 PM\n\nSounds like it's not your cup of tea. Feel free to ask for a refund!", "BenUSA1Apr 11 at 1:29 AM\nAlways wanted this game\n\nSince tried the HTC Vive demo 4 years ago. It is very good, you can break a sweat too. Love the roomscale.\n\nHelpful | 0", "CyberFernMar 3 at 7:38 AM\nSoooooooo Fun!! Plus demo combined!\n\nThis game has been a favorite during the VIVE's days. You can fight robots, slam robots down to the ground, use different guns, and BLOW UP THE MOTHERSHIP!!! I also liked that they combined the demo experience in this game too. For example, If you bought this game and installed it, and you never installed the demo, its going to show up in the menu. Would reccomend if you like space and pirates. Reccomended!\n\nHelpful | 0", "sisco30Apr 26 at 3:57 PM\n\nReally amazing and addicting\n\nHelpful | 0", "Naldo_Da_GreatMar 15 at 10:38 AM\nDa (grenade launcher) BOMB!!\n\nThis is what VR games are all about! The selection of guns and shields paired with auxiliary weapons is a perfect balance of non stop action and complete replayability!! By far my favorite game so far. I CAN NOT WAIT FOR SP ARENA!!!\n\nHelpful | 0", "Aiden5226Apr 9 at 12:53 PM\nThis game is very fun\n\nI played this first in Georgia visiting my uncle so when I got my quest I got it straight away very good game\n\nHelpful | 0", "sunwokungMay 6 at 2:30 AM\nNice, but low content.\n\nVery nice shooter. But low content. If they update and add some more backgrounds, weapons and environment interraction... would be super.\n\nHelpful | 0", "OtherbitsFeb 21 at 5:02 AM\nLacking in goals\n\nBeyond beating the first 30 or so waves and defeating the final boss, there is one and only one thing left to do in this game: get a high score.\n\nAnd thats not necessarily a bad thing. This is an old-school arcade shooter and proud of it. But the difference between old-school arcades and modern gaming is that the leaderboard is global. Your spot on the leaderboard might be, for instance, 50,000. Realistically, you're unlikely to get higher than about 5,000, because every one of those people devoted a ridiculous amount of their free time getting good. (Heck, in many online games - though hopefully not this one - its entirely possible to spoof high scores that would be humanly infeasible). So ultimately your only motivation to keep playing is... going up the leaderboard slightly?\n\nI think this is why people say the game is lacking in content. Honestly, the game has more than enough. There's powerups, environmental objects, 6 weapons, a shield, a lasso/lightsaber. There's a lot of creative styles of gameplay to explore and master. But what's your motivation? To go from spot 17,817 to spot 17,816? Players need a more interesting and achievable goal to work towards. For example, having ranks/medals for certain scoring milestones would do wonders for this games replayability, because its an objective that can realistically be achieved by anyone and everyone. Better still would be having them per weapon-specialisation, to encourage trying different play-styles. As it is though, I think after I beat the final boss in hardcore mode, I probably won't have any interest in continuing playing, because there's no other practical goals for me to achieve\n\nHelpful | 7", "pepeR0NiJul 11 at 1:42 AM\nLack of game mode\n\nThis game has some goods and some bads like every game, but this one is just lack a few thing to be perfect, I love shooting things and if you do too its the game, but.... no coop, only one map, and the same guns every time you play, the only thing changed is when you will lose, after some waves or some more, who knows. So to my opinion it worth 10 not a 15 but not less than a 10 this game is well built and graphics are good and guns are fun to shoot with.\n\nHelpful | 0", "nicholas.topferApr 23 at 2:05 PM\nGreat game\n\nHope for some additional content\n\nHelpful | 0", "t0mmy_LasagnaMar 4 at 10:10 AM\nSuper fun and challenging\n\nI wish there was a little more variety in environment, but so far I have been having endless fun just trying to survive arcade mode. The devs managed to pack a lot of fun weapons and abilities into this game, and so far it is my favorite game on here. A lot of others are fun, but short, or they get repetitive. Somehow in this game, the excitement persists, and it is well worth the money\n\nHelpful | 0", "algae_roosterJun 15 at 10:41 AM\nGood\n\nIts a good game but not a great game\n\nHelpful | 0", "SkysolsticeApr 5 at 5:32 PM\nLots of variation on how you play\n\nIt's exciting once you learn how to pull them in and slice them in one motion. The game is faithful to the original.\n\nHelpful | 0", "Alexl342Feb 26 at 5:43 PM\nImpressed Me\n\nI played this when I was ten at a Minecraft convention. VR was still fairly new, and there were tons of bugs. But I still thought it was amazing. Three years later, I bought the game on the Quest, and something amazing must have happened to VR since then, because this game is better than it has ever been. It has addicting gameplay, unique mechanics, and beautiful graphics. My only complaint is the unlockables, they give no description or clue on how to unlock new skins and environments. Other than that, this game is great. My standards for VR games are pretty high, and this definitely meets those standards.\n\nHelpful | 1", "aaron.crouse.39Mar 16 at 11:04 AM\nGreat game!!!\n\nFrom dodging bullets to using the turrets and your shield to destroy hoards of enemies. This is one of the best games available. I would like to see boss rounds. Like a large ship or monster to make it more exciting\n\nHelpful | 1", "up_in_smokeMar 29 at 4:39 PM\nLove it\n\nI feel like I'm in an old arcade game it's awsome especially for the price\n\nHelpful | 2", "DrFireBlasterMar 23 at 9:13 AM\nJump In and Blast Away\n\nYou got to love a game you can just jump in and start blasting stuff. Great variety of guns. Lots of levels and some gadgets. If you like shooting stuff this is a must have game.\n\nHelpful | 1", "devongiffordApr 26 at 6:58 PM\nNice\n\nNice\n\nHelpful | 0", "Void9810Jul 17 at 5:04 PM\nGreat game\n\nIts soo fun playing with family / friends trying to beat each other high score\n\nHelpful | 0", "tysontkokidJul 30 at 1:21 PM\nThe best\n\nGood value game\n\nHelpful | 0", "kellyzupanApr 14 at 11:13 AM\nAwesome game low price\n\nThis game has a really low price its an amazing game\n\nHelpful | 0", "SweendogeMar 10 at 5:13 AM\nMust have\n\nMy favorite game on the quest. My dad visited the other day and asked if I still had the pirate game and played it for an hour if that tells you how good it is. Immersive and great graphics. A must have on the quest\n\nHelpful | 0", "EispfogelDec 23 at 1:52 AM\nTHE reason i bought a VR Headset!\n\nSince i first saw Tribal Instincts play this on an HTC Vive, i knew i have to buy a VR Headset. I wasn't let down by SPT and it still is my go to game when ever i show someone what VR is all about. SPT also gotten better over time with nice and clear graphics, to weapons, enemies and effects and everything including the awesome music gets you pumping!\n\nYou will do Matrix style movements and just feels awesome when you shoot something while doing that.\nAfter a while you can even shoot things out of sight just by listening to the sound - it is that great! The devs are also still working on the game and get the performance up to speed and to implement some new stuff.\n\nYou need a headset with robust tracking though(had issues with PSV and WMR tracking), but gladly the Quest and Rift S do work fine. And speaking of the Quest - this is the definitive way to play SPT as you can move around freely without caring for that darn thether. Your only concern will be if you make it to the leaderboard and if your battery will last long enough ^^\n\nYou don't need other wave shooters - this is the mother shooter and other just tried to copy it but failed in one way or another.\n\nThe only thing i would like to see on Quest is a volume slider fo sound and music. The music is often too loud and the effects sound are too low. Something is off with the mixing there. Explosions like from enemies and grenades on the other hand blow out the internal speakers. I wish we could lower the bass on those effects while lifting up laser and other weapons.\n\nAnyways....if you wear headphones - this will be no issue so i still gave 5 stars and they are well deserved after playing it for 3 years :)\n\nHelpful | 21", "jar.chMay 21 at 1:03 PM\nA great game\n\nA nice wave shooting game.\n\nHelpful | 0", "gamingbigfootJul 14 at 12:56 AM\n\nSuper Duper fun I spent two hours playing this without realizing. Would recommend\n\nHelpful | 0", "vadimgtMar 30 at 12:00 PM\nPerfect\n\nGreat game i really enjoy it\nBut it really needs some kind of variety or missions\nThe replay-ability is pretty bad\n\nHelpful | 0", "DanaJoMar 27 at 9:13 AM\nOne of the best shooter games\n\nEveryone in my family enjoy this game on the quest.\n\nHelpful | 2", "PacDramJul 23 at 11:35 PM\nMore fun than a barrel of monkeys\n\nBetter replay value too.\n\nHelpful | 0", "JohnnyWLApr 3 at 2:42 PM\nA little blast form the past.\n\nI got this game when it first came out on the Vive. It was always my go to for quick VR sessions. This Quest version is not bad. There are obvious parts where corners were cut a little to make it work on the Quest, but it doesn't change my enjoyment of the game. There are a few hiccups when you first start, which kinda take me out of it a little bit though, and I do wish it was a little shinier, and I wish it showed the boundaries box on the ground like the desktop counterpart.\n\nHelpful | 0", "jpgeeApr 7 at 1:26 PM\ngreat, but needs better multiplayer!\n\nlove it would like to play with a friend somehow though same screen!\n\nHelpful | 0", "kaveh.farzinpourApr 20 at 11:04 AM\nAwesome game\n\nThis is a fun game. Really one of the most immersive VR games on the Quest! Could use some more variations in the form of upgrades or new arenas. But a very good game!\n\nHelpful | 0", "MicroChip4Apr 16 at 10:39 AM\nReally fun\n\nEasy to get lost in.\n\nHelpful | 0", "romanos.kazantzidisMar 26 at 5:13 PM\nExactly what I wanted from VR\n\nExactly what I wanted from VR\nVery nice game\n\nHelpful | 2", "jujuice1Jan 29 at 4:48 PM\nAmazing game!!\n\nAfter playing the preinstalled demo of Space Pirate Trainer on my quest, I knew that this was going to be one of the first games that I purchased. Whether unleashing a barrage of bullets, shooting and detonating grenades, or grabbing enemies with a laser beam and slicing them in half, the carnage and fun of blasting these bots to kingdom come is as fun as it gets! Space Pirate Trainer is my go to game when I put on my headset for a VR session. Challenging, fun, and I am always striving to get a new high score, rendering this game to be able to be played time and time again! I highly recommend this game to anyone that owns a VR set.\n\nHelpful | 10", "CJtheBossMar 19 at 7:38 AM\nAwesome game\n\nIm new to VR games. This was the first game I bought. Still blows me away. Be prepared to work on your matrix style moves to dodge incoming fire.\n\nHelpful | 1", "wilberto.floresMar 3 at 5:09 PM\nAstronaut Junior Training\n\nI participated in a Science Technology Engineering Art Mathematics (STEAM) event using the Oculus Quest headsets, the kids loved the Space Pirate app. Part of the Virtual Reality learning experience for the younger generation.\n\nHelpful | 0", "hans.geleijnsMay 21 at 9:14 AM\n\nTopgame shooting\n\nHelpful | 0", "macmcfaddenApr 11 at 7:40 PM\nAwesome\n\nThe game is very fun to play\n\nHelpful | 0", "dray_ukApr 10 at 6:53 AM\nVery fun\n\nAmazing, fun, arcade shooter!\n\nHelpful | 0", "sunwoodsnwaterMay 5 at 7:54 PM\nFun, but...\n\nYes it's fun, but could use more of a tutorial or a menu of tips for how to do things. Was better this evening for tips, but I only had two weapons and a shield - what happened?\n\nHelpful | 0", "Sp1dey128May 24 at 12:41 AM\nSimply Fun.\n\nSpace Pirate Trainer is just plain fun.\n\nThis game places you in a wave type game with sentinels that try to kill you. Defeat them with your weapons and shields. The different modes on your weapons gives hours upon hours of fun, and many that was so cooool! moments. There are different modes for different play styles. If you want to go yolo, you can or just play casually with health regeneration.\n\nThe only big con of this game is youre limited to the one area, not being able to move around the platform, but still, this doesnt really matter.\n\nIf youre into a wave type game, this is right up your alley!\n\nHelpful | 0", "alanwpatersonApr 8 at 10:00 AM\nReview\n\nGreat game and a few hours of fun.\n\nHelpful | 0", "shashking404Mar 15 at 6:41 AM\ngreat for playing in parks\n\ni had this game on wishlist on Steam for a great while. i knew that this Gem would launch on Quest and i (Spoiler Alert) bought it the day i got my Quest.\n\nHelpful | 1", "Casa-de-FishmanJul 17 at 10:08 AM\nSuper fun and exciting\n\nThis is so addicting and fun!\n\nHelpful | 0", "finnandscarletFeb 14 at 11:28 AM\nGreat just great\n\nGreat game fun and engaging. For people who are trying out vr for the first time to experienced players. Some people say that it is too hard or there is not enough but it has a lot of weapons and the round combinations are made right. Great game for having people over and for kids. Definitely try it out.\n\nHelpful | 0", "Whizzy79Feb 25 at 12:53 PM\nExcellent game\n\nThis game is awesome Simply amazing great game play with nice weapons Its one of the first games I bought still play it every day\nIts only missing one thing\nCo-op mode Would love to see co-op mode and Play this game with friends\n\nHelpful | 1", "UltraVioletRainMar 18 at 12:28 AM\nFun game\n\nThis game is really good and its really fun but it gets pretty boring after a while. Its very repetitive and there isnt much of a game structure to it. Basically just a fun arcade game, and I love it, it just needs more. (Honestly though this is an amazing game and I dont regret buying it at all 9.5/10 love it to bits, just want more)!\n\nHelpful | 0", "tsviperMar 26 at 6:43 PM\nGreat game!\n\nDefinitely one of the best games for the quest. Wish they would add more environments though.\n\nHelpful | 1", "GianLahnMar 29 at 4:33 PM\nGood game\n\nIts a good game, it is a little pricey but if you buy it when its on sale its for sure worth it\n\nHelpful | 0", "FalselyDevMar 30 at 1:03 PM\nlmao yeah\n\npretty good game, can get a bit repetitive, but fun to show people vr.\n\nHelpful | 0", "olascuaohanaMay 22 at 1:33 PM\nLoads of fun\n\nThis game is addictive for me and my family. We all try to beat one another's scores. The shield and weapons are easy to use and switch up. I could literally drain my battery just playing. This would be awesome if you could add another player with you. This was well worth the money spent for the game.\nTha\n\nHelpful | 0", "Bennett0325Jun 17 at 11:11 AM\nFun and action packed game\n\nThis game is surprisingly fun. All you do is shoot robots and dodge lasers but wow. My favorite thing is the lasso and the sword. I would recommend this game to anyone.\n\nHelpful | 0", "arkaybeeFeb 29 at 4:27 PM\nVery fun but does get old\n\nI've gotten all the way to level 45 or so and while this game is a blast, it does get old after a while. There's only like 4-5 different kinds of bots and a couple bosses. There's only so many configurations you can make before it becomes just an overwhelming wave of bots. Also, it doesn't appear to save progress past level 35 so it's frustrating to get so far and have to start all the way back there.\n\nI love the gun selections. The power balance is spot on. The power ups are fun but it would be nice to have power ups that aren't just OP versions of the guns you already have (aside from the rockets). The towers are almost useless because not only do they tie up an arm that could be shooting or blocking, they are also impossible to aim. Grappling the bots is only useful in the first 10 rounds. After that, again you are tying up an arm that could be doing something more important. Some suggestions for the devs:\n\nGrappling a bot should pull him toward me so I can use him like a shield while also giving me control of his gun.\nRethink the towers. Give me one that produces a shield. One that acts like an EMP, and one that can be aimed (or put on auto aim).\nThis game screams for a co-op mode.\nMore bots with more powers; shields, laser beams, a big bot turns into 3 smaller bots when it dies.\n\nHopefully, the devs are still making content updates (although it seems like they are focusing on Space Pirate Arena which hasn't seen an update since August). The longevity of this game could be greatly extended with new content and play styles.\n\nHelpful | 6", "Nottobe65Apr 2 at 11:30 AM\nVery fun, can be addictive\n\nAnd a moderate physical exercise too.... worth it\n\nHelpful | 0", "RockyandRamboMar 28 at 12:45 PM\nLove this game\n\nThis is a really fun game. Graphics are great and very responsive game play.\n\nHelpful | 1", "odedbendovMar 30 at 9:58 PM\nGreat game play\n\nVery engaging with multiple weapons and tactics to choose from\n\nHelpful | 0", "CaneFroApr 2 at 11:06 PM\nBest game ever!\n\nI can't express how great this game is.\n\nHelpful | 0", "dwsheltonFeb 8 at 3:51 PM\nVery very replayable. One of the best!\n\nIm not really all that much into shooting games but I love this one. Its honestly a big part of why I bought the quest. Such a great use of VR and so replayable. Absolutely worth the money.\n\nNow we just need the makers to come out with some new versions! Would love to see something like multiplayer or some other twist on it.\n\nHelpful | 1", "TwitchyTwistFeb 10 at 3:44 AM\nBest first game\n\nThis game gets played constantly. Its probably the best intro to VR. For 10 yr old to 60 +.\n\nIts comfortable, engaging and good value for money.\n\nThere is just enough variety in the blasters and shields that keep you trying new things. Personally I like dual wielding the most but dont seem to get as far unless you have a shield.\n\nStill havent clocked it. 10+ hours played.\n\nHelpful | 0", "TimdordiMar 28 at 4:05 PM\n\nI love it! I can spend hour after hour playing it i cant stop.\n\nHelpful | 1", "Drinkingjuice69Apr 2 at 1:52 PM\nSuper fun gam\n\nSuper fun game lots of possibilities\n\nHelpful | 0", "braygenzJul 12 at 7:22 AM\nFun\n\nI played it for so long.\n\nHelpful | 0", "reevsMay 8 at 2:56 PM\nSo confused\n\nSuch a great potential. Too many weapons, too many things to do, non effective weapons and a feel of total mess. No clear campaign, goals or any enjoyment.\n\nHelpful | 1\nDeveloper ResponseMay 8 at 9:42 PM\n\nSorry to hear Space Pirate Trainer wasnt for you, though maybe try again on Explorer mode and see how you go - the game really kicks in at wave 30 ;)", "mike.taumanFeb 8 at 3:41 PM\nFast paced fun shooter\n\nThis app is everything Id hoped for and more! I used to hate those arcade shooter games where the guns never quite aimed where they should. So frustrating. Not the case with this game the guns are spot on. Literally point and shoot at dozens of enemies at a time, ducking and dodging incoming blasts, several gun modes, a shield, lasso, and power ups. Only thing I wish is that I was 20 years younger when I was actually good at these games lol!!! Great game even better for the price point.\n\nHelpful | 0", "fatpolloApr 4 at 8:03 PM\nGreat Game\n\nI have lots of fun\n\nHelpful | 0", "Drewcifer68Feb 7 at 7:55 AM\nMore than meets the eye\n\nIm an older gamer and a bit old school in my tastes. I bought this because I love shooting games and being new to VR I wanted a relatively fixed perspective shooting gallery game as I get acclimated to the VR experience. I was concerned it might get boring but the more I play the more I discover about the numerous weapons and techniques available. Its a great arcade - like experience and I keep coming back for more. I hope they continue adding to it. Recommended!\n\nHelpful | 0", "SpuzzumJan 19 at 7:49 AM\nThis is by far my most favourite game!!\n\nI'm almost 53, and grew up with the Atari 2600. But before that, I spent way too much money in the arcades of the 80's. This game reminds me so much of Galaga, with the ships flying in line and looping all around, but it's so much better, as you're actually in the game! It starts off easy, then gets pretty crazy. They're coming at you from both sides, and as soon as you think you have it under control...they hit you from above! There's plenty of option variables, has a great soundtrack, as well as a world leader board, so you can try and beat the top scores, or just your own top score. There's plenty of replayability. It's so addictive!\n\nHelpful | 11", "BRC88Feb 6 at 6:38 AM\nMost fun Ive had in a while!\n\nThis game was my first title that I had bought for my new VR Headset. Honestly it was probably the best thing for me to get and be able to dip my toes into the world of VR. Its a very engaging game that makes you move and become aware of youre surroundings. The amount of times Ive accidentally jumped onto a wall because I had to dodge a laser is insane. Either way the game is very fun and engaging. The gameplay is like that of no other. Its a very fun game especially for the price.\n\nHelpful | 0", "VRSugarBabyMar 14 at 6:30 PM\nAwesome!\n\nExciting game play where you shoot down packs of killer drones ducking and dodging their gun fire all the while...\n\nHelpful | 1", "LDCO07Feb 5 at 8:31 AM\nJust wow\n\nThis is one of the most amazing shooter games Ive ever played I mean I love how you can swipe through your guns with the thumb sticks so easily. I also love that the game isnt easy its actually pretty hard, totally recommend it completely amazing and Ive gotten better at shooting Nerf guns\n\nHelpful | 0", "JensenLegacyJun 1 at 11:45 PM\nWell good demo to show other people a VR\n\nVery basic and limited\n\nHelpful | 0", "pekhoMar 22 at 11:26 AM\nSpace pirate\n\nA good way to spend your time in an arcade style shoot em up.\n\nHelpful | 0", "sarahdactyl830Feb 1 at 7:13 PM\nPermanent space cadet\n\nBasically bought a Quest for this game. First intro to VR, played it at a VR arcade and was instantly hooked. SO and I have literally done nothing else since purchasing our Quests. The aesthetics, graphics, blasters, all of it reminds of Galaga and I cant say enough how incredibly fun this game is. Definitely excited to see what the multi player is like when it comes out. Great workout and worth every penny. Dont miss out on this.\n\nHelpful | 1", "christopowerMay 1 at 3:34 AM\nGreat\n\nAn update is sure due tho\n\nHelpful | 0", "Wi11iamworld_9Jun 20 at 1:40 PM\nGreat game\n\nThats a great dame to play if your bored in quarantine it has action and even makes you move around\n\nHelpful | 0", "Bananamonkeyplayer17Feb 1 at 10:29 PM\nWhip em dead\n\nI saw this on my cousins oculus quest, he only had the demo but that was good enough for me. I had a blast on demo, so when I got my own I got it immediately. The variety of options to kill the bots made me so amazed. My favorite way to kill em is to throw em around with the electric whips. My mom also enjoys it, and she doesnt really understand video games. Its happy to see her like this\n\nHelpful | 0", "billy.boatmanFeb 23 at 2:53 PM\nHoly crap\n\nThis is absolutely an awesome game with superb graphics and detail. Try it with some quality headphones and youre in business for real. My first app purchase- and totally worth the 14.99!!!\n\nHelpful | 1", "MadwackerApr 4 at 6:44 PM\nFun Old School Arcade Game\n\nThis game is quite a bit of fun if youre into the old school arcade shooters. I wish there were more level environments and environment interactions.\n\nHelpful | 0", "GoldenTurtleFeb 1 at 7:45 AM\nFun\n\nJust finished my first 45 minutes of this. Only played the demo, then I realized I have so many more guns and turrets and power up and boom booms. Took me a few minutes to figure them all out. Now I look forward to figuring out how to combo them together. Very high activity rate in this game. You must use the 5 D's of dodge ball to succeed in this game.\n\nHelpful | 0", "777DinoMar 4 at 11:02 AM\nAwesome game!\n\nFun, fun, fun! Even 1st time players like my wife or children can start enjoying this right off the bat. Excellent graphics and game play!\n\nHelpful | 0", "SkynyrdFPVJan 23 at 2:31 PM\nWOW...\n\nPlayed the demo and thought i'd give the full version ago, its AWESOME, i love it, full on shoot em up, blast or use shield, easy enough to progress but hard enough to keep you interested....this is a great game if you want to play for a while or a quick blast. Highly recommend.\n\nHelpful | 6", "Momo_346Mar 22 at 12:07 PM\nVery good game\n\nThis game is a really fun arcade shooter game and really good for when family comes over but when you playing yourself after a while it gets boring. They should add a new map or reward for completing task.\n\nHelpful | 0", "wesley.hill.106Jun 21 at 7:29 AM\nGreat game!\n\nThis is the game that actually first got me hooked on VR!\nA lot of fun!\n\nHelpful | 0", "MartinsQuestFeb 1 at 9:06 AM\nLove it, never thought I would\n\nThis was my first buy for the quest. Have it since release. Its so easy and fun and I showed it to all my colleagues. Everyone is amazed of the abillity to move freely and the different guns.\n\nCould only be better if there would be different scenarios to stay in while shooting.\n\nHelpful | 0", "TheRainman1Feb 26 at 8:47 PM\nOld School Fun Meets New School VR\n\nOld School Fun Meets New School Entertainment via Virtual Reality! This game is a blast! Get together with a few friends and see who can get the high score.\n\nHelpful | 0", "mellowmelleMar 25 at 3:25 PM\nLove it\n\nReally good game\n\nHelpful | 1", "GratefuldeathJan 28 at 3:51 PM\nGreat immersive wave shooter\n\nI love the retro feel of a classic wave shooter without the linear restrictions of flat gaming and this game is it. Lots of weapon variations, shields, and laser blades to quickly swap out during play that allow for tons of variations in play style. There are actually helpful options in the settings menu to dial in your guns aim point and a few others. Unlockables to try for and a leaderboard 30 miles long; lots of replayability. Your legs are gonna get a workout\n\nHelpful | 0", "joshua.jamrozyMar 24 at 8:20 PM\nFun game, quick action\n\nWorth the purchase.\n\nHelpful | 0", "DarkAngel10614May 5 at 7:24 AM\nGreat for the 80s kids\n\nIf u like old arcade games, especially from the 80s, you'll love this thing. It's a good way for those with limited mobility, like me, to get moving a bit and get the blood pumping.\n\nPlay the demo FIRST, it teaches you how to play, tho game play is pretty simplistic. It almost feels like stepping into one of those old 80s arcade games. Some movement required to dodge incoming, but can easily be played sitting\n\nHelpful | 0", "LockBreakerMar 6 at 8:34 PM\nSlacks parts transition sinteration\n\nMe and my friends spend all our time fighting for the high score. I will beat you, Dylan. Mark my words.\n\nHelpful | 0", "ProsportMar 26 at 8:57 PM\nExcellent but could be better\n\nThe only thing this game needs is multiplayer. Its fun and exciting but if they add multiplayer/COOP it would be better. I will rate it 5 stars if this is added.\n\nHelpful | 0", "mrphilipjoelJan 26 at 5:14 PM\nThis is the game that got me to VR\n\nVirtual Reality has always intrigued me. But, I didn't completely understand the modern strides that had been made, until I demo'd this game at a mall kiosk. It blew my mind.\n\nI didn't have a PC capable of VR. I ended up getting the Oculus Go, and was very happy with the options I had there.\n\nWhen I finally ended up getting the Quest, this was one of the first games I purchased. And it was just as awesome as I remembered.\n\nThere doesn't seem to be a tutorial that teaches you when to use the various weapons. But, you start to learn different tricks and strategies. I'm sure you can google the game and find all sorts of tips and tricks. But, I haven't done that yet.\n\nThis game is absolutely amazing.\n\nHelpful | 1", "Mark-BlissJan 26 at 8:25 AM\nGreat game\n\nI bought this game because it offered a demo and if it had not I never wouldve purchased it and Im glad they offered the demo because its fabulous. More games should offer demos so people can try them out. I look forward to playing this game every single day. As soon as I turn on the quest its the first game I go to. If you dont purchase this game its a huge loss to your collection because it is seriously fun\n\nHelpful | 2", "justsaewhenApr 25 at 1:53 PM\nIt's good..\n\n.. but not great. Obviously I'm with the minority, but I find the game more aggravating than fun. Shooting feels like a chore.\n\nHelpful | 1", "dustin.gillMar 9 at 2:55 PM\nlove this game.\n\ni wish there was different levels but either way i keep playing this game, love it\n\nHelpful | 0", "SquirrelyEarleyJan 19 at 8:11 PM\nPretty sweet\n\nLet me start by saying Im one of the harshest critics out there. I bought this game because the demo seemed fun. I had a $5 off promo.\n\nThis game is the BEST game I have played on quest for the $15 you pay.\n\nIt is Galaga on steroids.\n\nWave on wave you have 6 settings of guns, a shield, a melee weapon, power ups, turrets, and a Tesla tower. I played this for 20 mins on my couch and had a blast til my son just had to have it. Standing and dodging was just another addition.\n\nDo you self a favor. If you even kinda like the demo, get this game. You can thank me later.\n\nHelpful | 3", "smackattack254Mar 8 at 3:25 AM\nAwesome\n\nReminds me of galaga except your the ship. This is easily in the top 3 best games.\n\nHelpful | 0", "The_AlgerianJan 22 at 8:11 PM\nMy #1 VR game.\n\nThis game made me buy my very first VR headset.\nIt's simple, intuitive but incredibly good at what it does, efficient and immersive.\nNot only that, it gets me off my behind and gives me the workout I so desperately need after years of gaming sitting down as I dodge and limbo away from laser shots like I'm in the Matrix.\n\nDo not expect some kind of singleplayer campaign, or multiplayer, for that matter, though. This is a pure arcade wave shooter, and the name of the game is beat your own scores (or if you're really good, the leaderboards folks' score).\n\nHelpful | 1", "Wildcardspade58Jan 22 at 9:44 AM\nGreat game!\n\nThis is a great game, it's simple and fun and works great. The tracking on it is amazing and increases it difficulty steadily. It's definitely a challenging game for VR and offers a great experience for those who are looking for an introductory experience. Beyond that I hope they improve the game at some point to include multiplayer options or more changes in stage look in appearance.\n\nHelpful | 1", "abhishek_666Mar 5 at 11:12 AM\nOne of the best games\n\nHighly addictive. Ideal for Arcade setup. Don't miss out the instructions about how to play!\n\nHelpful | 0", "shawnersFeb 28 at 6:29 PM\nSo much fun, I want to be a space pirate\n\nThis game is a blast. I can play it over and over again without getting bored. Great sound track, graphics and game play.\n\nHelpful | 0", "samtheman3Jun 14 at 7:33 AM\nA really great game\n\nThis was a blast to play and I had tons of fun just destroying robots and for a game where you just kill robots I found I can play this game all day and not get bored but I do wish it added multiplayer so you and a friend could blast away at the drones\n\nHelpful | 0", "jaydegeerJan 19 at 1:06 PM\nSuper fun\n\nGame is so much fun it's like a space invaders in vr, gets to be very challenging, the bigger the space to move around the more fun you'll have dodging bullets and deflecting with your shield, still far from mastering some of the techniques like using the elements as weapons, also different bullets or various modes to shoot, game is overall fun and perfectly priced. A must own if you enjoy shooter games.\n\nHelpful | 2", "HexBlehApr 30 at 2:12 PM\nexcellent game ! but one minor flaw...\n\nlet me start off by saying this game is WILD , if you haven't already and you've been holding off like I was , just go ahead and snag a copy you really won't regret it . all the mechanics are there and fully working how they should be , looks beautiful as well .\n\nmy only gripe is with the scoreboard. it seems a little strange that it'll eventually just get filled up with you , as every round you play it asks for a username for the scoreboard.\n\nI feel like if there are duplicate names on the scoreboard , then it should only display the top three scores of that name when entered. not only would this relive clutter of just one user on the scoreboard , but it would make those top three scores alot more significant than seeing the top 20 times you've played the game . seeing the clutter on the scoreboard gone would leave this game in perfect shape , but of course online multiplayer can always make it more fun\n\nHelpful | 0", "tneig00Feb 7 at 6:04 AM\nIts great.\n\nEarly stages and it keeps you hopping. What I like is theres a lot to learn and you can keep playing forever. Some games get boring after the first pass but this will keep you advancing. I yell ouch when I get hit.\n\nHelpful | 1", "a1platinum2Mar 16 at 3:19 PM\n\nAWESOME! JUST AWESOME!\n\nHelpful | 0", "Ultimablaze08Apr 3 at 5:57 PM\nFree on rift s\n\nI play on quest I payed and people on rift dont\nI am mad right now I would like this to change\n\nHelpful | 0\nDeveloper ResponseApr 3 at 7:18 PM\n\nThis is cross-buy, if you purchase the game on Oculus you have it for both Rift/Rift S and Oculus Quest.", "Catcher29Feb 10 at 8:59 PM\nGood for new users\n\nMy father is new to VR and he loves this game. It is really easy to get to know the controls. Perfect for new players. If you are on the border wether to get it or not, do it you wont regret it.\n\nHelpful | 0", "DMTurnerFeb 3 at 5:06 AM\nGreat game with stunning graphics\n\nI am a 60 year old gamer and thought I was pretty good until my daughter took this game and placed her name in all my high scores after a few hours of playing. Now I have to get better but dont mind when the game is this good.\n\nHelpful | 0", "Alphaplayer0Mar 8 at 4:45 PM\nSpace pirate trainee\n\nThis is a Fantastic go to  experience for immersive vr, get your friends to try this and watch how they cant believe what theyre seeing. This is a game /\nexperience that will have you returning again and again.\n\nHelpful | 0", "NyogthaMay 19 at 10:02 AM\nFun game with a classic arcade feel.\n\nLike being in a more action packed Space Invaders. The graphics look great and I like the controls and UI, switching between weapons is easy and so many different possibilities. A lot of fun!\n\nHelpful | 0", "hyrrokkin2020Jan 17 at 12:11 PM\nGreat Game\n\nThis is one of the first games I bought. After playing the demo and really having a lot of fun, kind of like space invaders bought to VR. Its a great game, energising sound track, simple concept and easy to pick up and play. there is a learning curve with the weapons, you get better the more you play. I havent unlocked any new skins yet, but will keep trying. Just waiting fir my son to knock me off the top of the score board.\n\nHelpful | 1", "the_infinite_gamerMar 9 at 6:25 PM\nAwesome\n\nIt is good, but it gets repetitive over time.\n\nHelpful | 0", "CoolHanMattApr 26 at 8:14 AM\nPretty Fun... Suggestions\n\nThis is pretty fun. One of the BEST features is that its nativly multiplayer. Like old school games after you play you type in your initials. Seems trivial, but since you have to take turns using the quest, it really helps to know what score your wife just put up so you can beat her.\n\nWould like to see more power-ups and bad guys die easier. Game gets kinda repetitive when I have to shoot the same Droid 5 times to kill him.\n\nLet them die easy so the waves are shorter and more plentiful.\n\nHelpful | 0", "Verbalicious79Jan 6 at 6:15 PM\nSpace Invaders on steroids\n\nThis is a top fave of VR games for me and my family. The immersion into the chaos of watching your back is awesome. You really feel like youre under attack and its quite a workout as well. Youll be dodging, whipping, gunning and monkey dancing all on the edge. The different strategies presented by the varied gun types, defensive equipment and external modes of annihilation make this a game you can play over and over without getting bored.\n\nBuy this game if you buy none others.\n\nHelpful | 5", "Mandalorian_wJan 14 at 9:50 AM\nOnce there was Space Invaders\n\nRemember when Space Invaders was everything. Addictive, fun and iconic. Now theres Space Pirates.\nAn really cool introduction to what VR can offer. Blast waves of robots from your space platform - multiple weapon choices, in play power upgrades and without in app purchases! A must for the experienced and novice VR gamer!\n\nHelpful | 1", "TypicalBobJun 23 at 6:34 PM\nNot enough\n\nI like the game in general but I wish there was a story mode I also wish that the sword thing would pull them close enough to slice with out having to have 2 swords\n\nHelpful | 0", "LinYao2008Feb 15 at 1:14 PM\nThe 2nd best game on quest\n\nThis is the 2nd funnest game on quest the reason I say its the 2nd is because the best is Vader Immortal because I mean its Vader Immortal\n\nHelpful | 1", "XaxznMar 7 at 4:17 PM\nGreat game\n\nThis game is fun and fantastic.But there should be some more bosses its cool but I really wish that there was like a multiplayer mode where u see how many drones u can destroy or something idk\n\nHelpful | 1", "aliendave51Mar 15 at 4:05 PM\nExcellent\n\nGreat game to play\n\nHelpful | 0", "HydraLDNJan 10 at 6:09 PM\nIts just like any other shooter\n\nBoy how that statement was so wrong... where do I begin. I love this game so much, you do the same thing every game but it almost feels like your doing something different every game. I never watched any videos on this game I just heard from a friend who told me its just like any other shooter WRONG. Its different to any other shooter Ive played before, its unique in it gameplay and the enemies as well. Please please please try this game if your thinking of getting it. I promise you wont regret it :D\n\nHelpful | 2\nDeveloper ResponseJan 12 at 3:00 AM\n\nWe've spent a lot of work on details and gameplay, so it's always great to hear when people notice and appreciate this. Thanks for this review!", "TR33TR33Jun 20 at 9:17 PM\nSUCH A GREAT GAME\n\nWow\n\nHelpful | 0", "dongdong369Jun 13 at 1:19 PM\nAwesome\n\nSuper fun. Can sit on chair and play.\n\nHelpful | 0", "candyflipqedJan 11 at 6:32 AM\nGreat fun and great workout!\n\nIt took me a couple of weeks before I fired up the demo of this, but decided to check it out two days ago, as I was looking for something fun and easy to get into, to buy in advance of looking after my girlfriend's kids last night. It was great fun immediately, so I bought the full version. I had a 4 bonus burning a hole in my virtual pocket, so it cost little more than a fiver. Bargain!\n\nIt's fast paced, immersive and incredible fun, and along with First Steps and the light saber dojos from Vader Immortal, it served its purpose of keeping a 7, 10 and 13 year old wowed and entertained brilliantly.\n\nAnd yet this was before I even knew you can select what gun your pistol works as, which I only just realised this afternoon! (At least we knew about the shield and brawler). It was tonnes of fun just with the pulse laser, and the odd accidental switch to shotgun, which I assumed was a power up ;), but finding this out, it just became even better!\n\nWhat's more, it is probably a great workout. The combination of the pumping heartbeat from the excitement, and all the movement to dodge enemy fire (feeling like Neo in the process) is likely the best exercise I've had in ages. I've even found myself laid on the floor to avoid a barrage of shots at times... but only for a moment before I had to leap back up and out of the way of more shots. At times, it's like the old Bullet Hell arcade shooters, only it's your body not a tiny ship that has to avoid a screenful of fire. And just the same, it feels amazing to get through these moments intact.\n\nThis is truly a great game. I'll be coming back to it, and showing it to newbies for a long time to come, I'm quite sure.\n\nHelpful | 1", "Cobra_Commander_216May 17 at 1:08 AM\nAmazing: Old School Arcade meets VR\n\nThis game is amazing. One of the first games I bought on here. A real gem. Game play is smooth and the different gun modes are a plus. Global leaderboards keep you going.\n\nHelpful | 0", "EZEDUZITFeb 18 at 5:11 PM\nForever Classic\n\nEverything you want a VR game to be. Great for adults to kids & Grandparents. Great way to introduce VR\n\nHelpful | 1", "wayne.brown.904108Mar 24 at 12:11 PM\nPretty cool game!\n\nThe graphics are pretty good and the gameplay is awesome! Surprising how much of a work out you get from it\n\nHelpful | 0", "GoodKidsWinJan 12 at 4:53 PM\nAmazing really fun cant stop playing\n\nI just cant get enough of this game so much fun to play with your family really hard when you get far which I love because you keep getting better at the game. You can also pick your modes and the levels you are stuck on which I love so that you dont have to get all the back to where you where stuck. Amazing this was my 1st game that I got and I will never delete this game that is how much I love Thais game!!!\n\nHelpful | 0", "PoloKnight1Nov 27 at 11:41 AM\nABSOLUTE. MUST. HAVE.\n\nEvery single person who has a [Q]uest, EVERY. SINGLE. F#<!^ one must have have this game in the library. Heck, people who dont even have a [Q]uest should buy it- just in case they ever do get a [Q]uest. I give 17 it stars! My favorite part is that EPSTEIN DIDNT KILL HIMSELF\n\nHelpful | 321", "a-soggy-biscuit-Mar 21 at 2:41 AM\nMeh\n\nThis game can get very boring very fast. Nice sound track though. The inclusion of the tesla and massive laser gun that can be activated by your cow prod is also a very cool idea, sadly the perfect opportunity to use them does last long. This game should be half the price\n\n\nEdit: was 3 star but changed it because of just how boring this game gets after such little play time.\n\nHelpful | 1\nDeveloper ResponseMar 22 at 12:46 AM\n\nSorry to hear Space Pirate Trainer wasn't the game for you. You can request a refund by following these steps https://support.oculus.com/275553640003957/ Please be considerate that reviews like this have a negative effect on small teams like ours.", "cspethMar 28 at 11:19 PM\nA lot of fun!\n\nI now know what its like to be inside of a galaga arcade machine!\n\nHelpful | 1", "JZee87Mar 8 at 7:48 PM\nAwesome game\n\nAwesome game\n\nHelpful | 0", "Death_Slicer082Feb 1 at 6:31 AM\nAmazing\n\nI just got my Oculus and this was the first game I got. I play it all the time and is a well thought out game. The mechanics of the lasso/pulse laser is outstanding and is my favorite weapon.\n\nHelpful | 0", "jozsef.csorba.108Apr 10 at 11:26 PM\nPirate space\n\nThis is a spectacular game.\n\nHelpful | 0", "Scottishfighter23Feb 10 at 3:28 PM\nA must buy for quest\n\nOh boy this game is the best game I have played on quest, second only to beat saber. I love the arcade style of the game, but I think that if the devs added a campaign it would be tied with beat saber. That is why I rated this game 4 stars so please devs if you see this please try to work on a campaign. But yeah this would be in the top 3 games if it was my opinion. This is a must buy for vr because it is entirely worth the price which is very good for vr games. Hope my review helps you with your choice and have a great day.\n\nHelpful | 1", "MutantRexFeb 24 at 4:42 AM\nGood game\n\nIt is a fun game, but the secrets are extremely hard!( for me at least )\n\nHelpful | 0", "ItsPronouncedOilerJan 24 at 12:32 PM\nA Quest must-have\n\nIf you could only pay for two games on the Quest, I would say to get this and Beat Saber. I believe it is essential to own both for its replay ability and its ease of sharing with people new to VR!\n\nHelpful | 3", "ConrdColetJan 23 at 4:48 PM\nGalaga on crack\n\nDodge! Jump! Shoot! Switch! This game gets ya pumping! But if I had to say one flaw, there is a bug that the Quest think I switched my gun/shield/sword and it kinda gets me killed time to time but overall it's great!\n\nHelpful | 1", "Troubleshoot_FoxFeb 12 at 5:11 PM\nSuper fun game\n\nMy family keeps taking my quest just to play this game, and thanks to my over exaggerated dodging, it's also great exercise.\n\nHelpful | 0", "basementjackJan 1 at 12:01 PM\nA game you can play every day\n\nThis has all the makings of a great game - simple to pick up, hard to master, ALWAYS fun for 15-30 minutes at a time.\n\nThis is a game you can play every day, forever, and it never gets old.\n\nA great example of \"simple to pickup, hard to master\": There are multiple weapons types and I found out after playing for months that if you pick the laser gun in both hands and 'cross the streams' you get an even more powerfull laser gun - it's little stuff like this that gives this game way more depth than it would appear to have by just looking at the screenshots.\n\nThis is a MUST HAVE title on the quest.\n\nHelpful | 3", "stealthmutantJan 18 at 7:20 AM\nExcellent game! Best one we have played\n\nI love the double guns, as well as the shield/grabber option you can use. So many configurations. And the bonus articles really enhance the game. I highly recommend this for the first game. We have only played the arcade mode at this point and it is so much fun.\n\nHelpful | 1", "Rick_R-347May 1 at 9:23 PM\nInfinite replayability\n\nThe only limit to this game is your cardio. I can't wait for the lasertag to come out, i really hope they put a future of work into the space pirate games, every time i code across even a new technique i get hyped.\n\nHelpful | 0", "NeelsMar 13 at 7:48 AM\nGreat game\n\nAAA quality game. Excellent game play. I like slow games, this is not but I still love it. Had it 1st on the PC, now on the Quest.\n\nHelpful | 1", "tony.peck.12Feb 9 at 11:19 AM\nADDICTED!!\n\nWorth the purchase! One of my favorite games to play. Learn something new on each game/level I play. Highly recommend this one!\n\nHelpful | 0", "FedexSpedFeb 13 at 2:08 PM\nFun game to just pick up and kill time\n\nThis reminds me of a new age VR Space invaders. A lot of fun and difficult enough that it is challenging.\n\nHelpful | 0", "BrickArmourFeb 7 at 5:35 PM\nSuper fun\n\nLove the weapons and game play. It just works so well. The feel of lasers flying past and enemies nearly crashing into me... fantastic.\n\nHelpful | 0", "catsfxJun 20 at 10:38 AM\nBest game ever\n\nBest vr game ever period\n\nHelpful | 0", "Coconut3451Feb 9 at 5:41 PM\nWay more fun than I thought it would be!\n\nHave had this game ( Space Pirate Trainer ) for quite awhile now on my Oculus Quest, it just doesn't get old, lots of fun!\n\nHelpful | 0", "memerminecraftFeb 9 at 11:49 AM\nNot Bad\n\nGameplay is mostly entertaining with a few inconsistencies. There are certain enemy units whose lasers move faster and often won't trigger bullet time. The game also might do with a more comprehensive tutorial. It was only recently that I found out how to cross the laser beams.\n\nHelpful | 1", "slipsour001Jan 20 at 10:36 AM\nSpace Invaders for a new generation\n\nI love this game. It was one of the first I purchased and the whole family has a blast competing for the high score. It is as simple or as complex as you want to make it. 5 years old to 35 years old, everyone loves it!\n\nHelpful | 1", "ShibashroomFeb 9 at 11:33 AM\nGood game, too expensive and not enough\n\nThis is a good game, dont let anybody tell you otherwise. But $25 for a bit of VR space invaders? Thats a bit much. Only 3 modes to play in and 6 weapon choices. Not enough. If you guys added in some fresh and fun content and allowed for multiple play types and/or a multiplayer function, this would be an amazing addition to my library.\n\nHelpful | 0", "JellyfishManiacMar 13 at 8:01 PM\nFun but hard after numerous waves.\n\nI try to play around with the types of guns and get strategies but I play around too much. Thats why hes hard!\n\nHelpful | 0", "Detective_SuperheroFeb 14 at 8:13 AM\nOne of my favorite titles\n\nI'm not very good, but it's fun at all levels of experience so I keep coming back to it.\n\nHelpful | 0", "KomischCommieFeb 15 at 4:57 PM\nA must purchase\n\nMy favorite game by far. Can hop in for a quick round or play for an hour or more.\n\nHelpful | 0", "grimmcowzJan 2 at 5:29 AM\nA favorite straight from the Demo\n\nThis game was one of the few quest games that I repeatedly played the Demo on. Space Pirate Trainer is one which gives an amazing experience that is infinitely replay able. From whipping out a shield in tense moments, to dodging lasers in bullet time, the game gives and experience unique to this game.\n\nHelpful | 0", "TheDarkSide519Jan 7 at 6:27 PM\nArcade shooting action\n\nThis is just fun you shoot things and get power ups it an arcade shooter in vr and its beautiful certainly one of my favorites you shoot robots endlessly and see what wave you can get to it's a good game to boot up when bored or when you want a challenge and dont need story\n\nHelpful | 0", "danvassalloApr 27 at 2:59 PM\nbad!!! too boring\n\na very repetitive game .... I got bored of it in 2 or 3 game\n\nHelpful | 1\nDeveloper ResponseApr 28 at 2:29 PM\n\nSorry to hear Space Pirate Trainer wasn't for you. You can apply for a refund by following the steps listed here: https://support.oculus.com/275553640003957/", "Dannycopo42Jan 1 at 6:24 AM\nPretty good\n\nA great little arcade shooter on the quest with a nice variety of weapons and things to try. It would be nice to have some sort of challenge system where you could earn points and unlock cosmetics. (e.g - 'get to wave 15 using only x weapon') Burt otherwise it feels great, has good polish and overall is a great time-killer.\n\nHelpful | 0", "Adam793Jan 1 at 11:00 AM\nReally fun!\n\nThis game is really great! Dont let the reviews that say the graphics are terrible scare you away from this game. THE GRAPHICS ARE NOT THAT BAD!!! Plus, this is a fast moving game so the graphics dont even matter that much. The concept of this game is fun, blasting flying robots out of the sky and dodging and blocking all the bullets they shoot. So much fun! My only recommendation is that the devs come out with a whole new game called Space Pirate where you finally finish your training and go out to space to fight enemies. That would be pretty fun. Overall though, this is a great game and will be fun for a long time. Thanks for a game that makes us feel like we are in an old school video game!!!\n\nHelpful | 0", "TonyMonTana106Feb 9 at 5:12 PM\nGreat VR shooter\n\nVery fun immersive game. Can get very tough to beat on the advanced levels but very fun nonetheless.\n\nHelpful | 0", "P0TAT0_Feb 10 at 12:08 PM\nBest game ever\n\nThis game is brilliant it's so addictive I love all the different types of weapons you can use.\n\nHelpful | 0", "XSpike_SpiegelCApr 7 at 5:33 AM\nSkeptical\n\nWhen I saw the videos of people playing this, I was a bit skeptical on how fun it would actually be. It is one of the coolest experiences of my gaming life.\n\nThe attention to hit box detail is amazing! Being able to hold your shield, shoot over the top, deflect the lasers, no look shoot a bot in the corner, grab your gun, blast away, dodge some incoming fire... Exhilarating\n\nHelpful | 0", "AutonomicNotionDec 28 at 11:26 AM\nIts great!\n\nThis game is deceptively simple, but gets exceedingly challenging with an old-school arcade shooter feel. I know some people are going to want more, but for the price point and the accessibility, Im not sure it can be beat.\n\nThis is also the first game I played on VR and its remained the one I go back to constantly.\n\nHelpful | 1", "TyrantTitanJun 5 at 12:49 PM\nGreat arcade like shooter\n\nGteat\n\nHelpful | 0", "KlapauziusMay 24 at 2:01 PM\nFun game.\n\nDefinitely a fun game. Space invaders on VR. Its even more fun if you have a large playing area to really appreciate the roomscale aspect.\n\nIts just a little short, only one endboss. It has different play modes but the main draw point is only to beat the highscore after you beat the endboss, what probably happens after two hours.\n\nThere are different weapons and you could transform your shield to a \"whip\" and even catch some enemies with it or activate the canon behind you, looks cool but seems unnecessary from a gameplay perspective. In 95% of the time the simple laser and shield does the job better.\n\nIts a relatively cheap game, but I would pay more for a full fledged game. Nonetheless its one of the better games on Quest.\n\nHelpful | 0", "Buchibo_Feb 1 at 8:52 PM\nAwesome! Just one problem.\n\nI LOVE this game! Its fun easy to understand, and action packed. One thing that can change my rating of a game in an instant is its length. This is why its a four instead of a five. Its just not long enough. But I often come back to play this game and enjoy it. If you are on edge about this game, you should for sure buy it.\n\nHelpful | 0", "Angie-yoyoMay 22 at 2:04 PM\nI love it \n\nI delete the game and i download it again it's work fine thxxx \n\nHelpful | 0\nDeveloper ResponseMay 22 at 1:57 PM\n\nSorry to hear you are having troubles launching your game. Please ensure your Quest is charged, then restart it, and try launching Space Pirate Trainer again, and then please reconsider this review.", "CapnAweFeb 19 at 9:45 AM\nPerfect arcade game\n\nFun for all ages. Two thumbs up.\n\nHelpful | 1", "Nateattack17Jan 24 at 9:02 PM\nAbsolutely amazing\n\nWhen I first saw this game I didn't think I would like it but I did and I enjoy the 4 gamemodes and the weapons. 10/10 would recommend if you like shooting games.\n\nHelpful | 1", "Sage0Jan 6 at 10:54 AM\nTahia\n\nHi, I bought this game but it's not installing on my Oculus quest. I keep getting the message, \"Update in progress please leave your device on, connected to Wifi and plugged into a power source until the update finishes.\" Everything is connected and my device has been on for about 2 hours. How can I get this game installed on my Quest? Please help.\n\nThank you so much for the response. I was able to update the Quest and I was able to install the game. I changed my ratings to 5 because this game is pretty cool and you were very prompt in responding, so Thank You!\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:55 PM\n\nHi Tahia, there is probably an Oculus update preventing Space Pirate Trainer from starting on your Oculus Quest. Can you make sure your Quest is connected to WiFi, restart the headset and then go to: Settings -> See All -> About -> Software update. There should be a button saying \"update available\", or better yet your Quest should be already updated by just restarting. Click on this, and then restart the Quest. If the issue persists can you email us at support@i-illusions.com? Any update?", "Teez333Dec 29 at 4:36 PM\nGreat old school fun\n\nWave after wave of assaults. Auto allows you to restart at levels of interval 5 once succeeded, so you can climb levels better. Also, lots of new never before seen enemies as you reach new levels. Lots of fun getting your butt kicked in the higher levels 19+. Waves dont last too long, so a perfect hame for quick fixes. Very immersive. Recommend.\n\nHelpful | 0", "dave.mullosJan 30 at 3:04 AM\nBest game to start vr with\n\nI basically bought the quest after trying this on an HTC vive. So many cool things to try. Perfectly achieves what it sets out to do.\n\nHelpful | 0", "Invalid_User_NamMay 28 at 4:56 PM\nSolid five\n\nIts really fun and challenging\n\nHelpful | 0", "Ezra2uMar 17 at 9:55 PM\nRemains One of my favorite games\n\nGets you moving... gets intense. Great graphics. Way to go devs.\n\nHelpful | 1", "Agent_TacoFeb 5 at 10:17 AM\nBest game ever\n\nThis game is the reason I bought the Oculus.\nThe graphics are fantastic and the strategy is amazing\n\nHelpful | 0", "Brogamer16Jan 12 at 11:51 PM\nWay better than footage suggests\n\nIt is amazing and way way better than the footage which looks kinda boring it has four modes arcade adventure hardcore and old school there are local and global leader boards which extends the re playability\n\nHelpful | 1", "PoconoPeteDec 27 at 1:00 PM\nOne of the Best Games I Own\n\nForget any negative reviews you might read here. This is a must buy. All the positive reviews are spot on. Read them and try the demo. I own all the best games and this is one of my favorites. If you like to shoot and blow things up then get it. Go to YouTube and watch the trailer its an awesome trailer. Pro tips: Learn what load outs work best for each level. You can chose two weapons to cycle between quickly using the buttons. Devs you should add a third or forth here to the cycling. Its just too hard to accurately switch weapons with the joystick in the heat of battle.\n\nHelpful | 0", "HunterofGrimmJan 12 at 8:19 PM\nPlay. Fail. Quit. Again.\n\nEach time you fail or come up close to your high then drop you wanna quit but this game lures you right back in. Its mindlessly fun and no matter what you come back. Id recommend this game to anyone within earshot.\n\nHelpful | 0", "prototizer3Feb 17 at 12:53 PM\nGreat game\n\nI really recommend this game\n\nHelpful | 1", "TapRack99Jan 27 at 10:34 AM\nLove This Game\n\nFor me its like being inside an old school arcade game thats got the graphics and feel of the 21st century if that makes any sense haha. Really enjoy it.\n\nHelpful | 0", "beach_flopDec 27 at 10:21 AM\nGreat game but needs more features\n\nThe game is great but I think it should be an adventure game. You shouldnt just stay in one place and try to get the high score. You should have to ride in a space ship then land somewhere and fight people. Maybe later into the game, you have drones coming after you from the back.\n\nHelpful | 1", "BEMunsonJan 19 at 11:57 AM\nAwesome\n\nI always wanted to try it on my psvr but I'm very glad I held out til I got my quest. The freedom to move and roomscale couldn't be this fun on anything other than the quest!!\n\nHelpful | 0", "ronster143Feb 9 at 10:35 PM\nSpace Pirate Trainer\n\nAwesome game. Great graphics. I play until the battery is dead!\n\nHelpful | 0", "HalliBalliJun 23 at 2:06 PM\nVery Good\n\nIts a very good game but it can get old quite fast.\n\nHelpful | 0", "ChargedVenxmDec 25 at 2:11 PM\nAWESOME\n\nIts really cool to dodge bullets and to shoot them back with your shield. Bringing enemies in and slicing them up feels amazing. Everyone should get this game if they like a good action game.only thing I would say they should add is a multiplayer mode to complete or shoot each other.\n\nHelpful | 1", "stevenangelavin1Feb 18 at 4:49 AM\nSpace pirate\n\nAwesome game\n\nHelpful | 1", "BlackysBroJan 20 at 7:46 AM\nVery good\n\nI got this game at 10 at night and I said I would only do play it for 30 minutes but it was so fun I ended up playing for an hour. Definitely worth it for 15 dollars.\n\nHelpful | 0", "Camax111Feb 6 at 10:41 AM\nExcellent\n\nAwesome old school arcade like game. Grind up, meet new enemies... If you can!\n\nHelpful | 0", "Exodus077Jan 11 at 10:32 PM\nWhy did I wait so long!\n\nThis has definitely become my new \"check out my awesome VR headset\" game. This game can be played for hours on end. Easy enough to keep it fun, hard enough to keep it challenging. Absolute most have game\n\nHelpful | 0", "LikjeeDec 19 at 12:06 PM\nAwesome\n\nJust a really fun arcade shooter, with classic space invader vibes. What I really like is that your guns can be set to different weapons at any time, according to your preferred playstyle. And it feels good to grab your shield just in time, or dodge a ton of bullets in slomo. Beating up robots and deflecting bullets with two lasersticks is also good fun. Great game!\n\nHelpful | 2", "secretkeeper21Feb 20 at 5:24 PM\nGood\n\nGood\n\nHelpful | 0", "RealRageFeb 12 at 2:23 PM\n\nSimple and competitive for the whole family\n\nHelpful | 0", "LittleMan186491Feb 15 at 9:12 AM\nGraft game\n\nI couldnt give a fault\n\nHelpful | 0", "northbandJan 12 at 8:02 PM\nSimply Awesome\n\nI recently got a Quest. I downloaded a lot of games and by far this the one I play daily. Its like being inside Galaga or Space Invaders. I also think it makes for a great work out.\n\nHelpful | 1", "vaderthedogFeb 9 at 9:47 AM\nThe big fun\n\nThis came has caught the big fun disease\n\nHelpful | 1", "billy.rockstar56Dec 26 at 7:55 PM\nSpace trainer\n\nAwesome game loved it soon as I got it so cool a game I'm 58 also and love the quest and all the great things it does hand tracking is going to be terrific! Cant wait for the games to be updated to except it ,great job to everyone involved in making it all happen Love it\n\nHelpful | 0", "ItsNotRipeJan 17 at 3:15 PM\nIt's Star Lord, maaan!\n\nA very good game. I think so need more playing space to advance because it get challenging and it's really fun. You really get into this game. Happy purchase\n\nHelpful | 0", "mcbobster600Feb 13 at 12:43 PM\nGreat game\n\nNothing more must be said\n\nHelpful | 0", "murmuzyFeb 10 at 9:51 PM\nAwesome game\n\nDon't let the weird title fool you, this game is fun!\n\nHelpful | 0", "MickDodsDec 5 at 4:09 PM\nAwesome\n\nThis game is so addictive in any mode you play. Chasing the point score is the only thing that matters. Plugged a power bank into my Oculus Quest and played for hours without getting bored. So many combinations of weapons and the ability to switch primary weapons using the A button on each gun gives you instant weapon changes. A must have for the Quest for any age and ability.\n\nHelpful | 7", "aaron.sommers.1253Mar 11 at 2:38 PM\nSpace Pirate Trainer\n\nThe best in space pirate training, in the galaxy.\n\nHelpful | 0", "VantaQuestJan 28 at 5:41 PM\nMy favorite but still says its updatin\n\nHow do I continue to play the game and get past the update??? Not sure if something is corrupted.\n\nHelpful | 0\nDeveloper ResponseJan 28 at 8:12 PM\n\nYou probably need to restart your Quest while it is connected to the internet. This will allow your Quest to update.", "Bazza68Jan 3 at 9:05 AM\nNot Expected Gem\n\nThis is an amazing game to add to your collection. A great throw back arcade feel but in up to date immersive VR. Dont even second guess this one well worth the money and no push over by any means. Ah ha me matey!\n\nHelpful | 0", "stardust418fFeb 13 at 7:54 AM\nAmazing\n\nVery nice.\n\nHelpful | 0", "UnusualthemedicNov 1 at 11:56 AM\nWhat vr was designed for\n\nHoly cow. Ok so I went into this game completely blind. I saw the trailer and everything but other than that I had no experience with this game whatsoever. So I pick up the demo to try it out and play it like 50 times, it was so good. And since the game is criminally cheap. I picked it up, and guys. This is the most epic game on the quest tied with superhot. You literally go through waves of unique robots and\ndrones with fuel laser pistols, grenade launchers, and laser whips. There are also unique modes for all types of players, but really if you're on the fence on getting this game. GET IT NOW\n\nHelpful | 23", "HighlandJohnsonDec 31 at 11:34 AM\nBest Quest Buy\n\nOne of the best, if not the best, games on Quest. Great fun and will get hours of game play from this one. Great for adults and kids (as another reviewer noted - the adults will take over the headset playing this game).\n\nHelpful | 1", "WhereIsTheExitFeb 7 at 5:02 PM\nUnlimited action\n\nNever had so much fun shooting things!\n\nHelpful | 0", "PhsyJan 4 at 6:16 PM\nMust have for the Quest\n\nWasnt expecting much, figured it was another shooter. Its basically the best VR game Ive played yet for full immersion! The diversity and complexity becomes a little chaotic and its super worth!\n\nHelpful | 0", "timbo1001Jan 31 at 9:43 AM\nExcellent\n\nAbsolutely love this game Super addictive only one gripe when it gets intense and your under heavy attack when using the shield during slow motion mode the shield seems to stick in mid air as if you've lost control leaving you exposed .\n\nHelpful | 0", "jaecre8sFeb 2 at 1:27 AM\nDope!\n\nI think that this game, even in demo version, is dope. So much fun to dodge the lasers they shoot at you and fire back. The levels in arcade version are perfect with their increase in toughness. Just an all around great game!\n\nHelpful | 0", "Venomous457281May 17 at 2:16 PM\nGreat game\n\nI rate this 4 stars because it does not reach my expectations. I was hoping for a story mode and more weapon selection. But if you like VR guns and like Galaga then this is a good game for you.\n\nHelpful | 0", "Memer-gamermanApr 28 at 1:54 PM\nGreat game\n\nIts a amazing game and hard once you get far enough but Ive died so many times because Ive switched from my shield or melee to my gun I wish they would add a setting where you could put your hand on your back and press the grip to switch weapons but other than that its great\n\nHelpful | 0", "donwrob317Jan 23 at 12:50 PM\nAddictive shooter\n\nHaving a blast with this one! Cool graphics, challenging and addictive shooter. Worth the price for sure!\n\nHelpful | 0", "idDogApr 4 at 4:10 AM\nNot bad made, but boring\n\nTried it, but it didnt get anywhere. It should be much cheaper.\n\nHelpful | 1", "Oculater01Feb 9 at 9:31 PM\n\nSuper Awesome.\n\nHelpful | 0", "stefan_schmidlinMar 11 at 7:02 AM\nReally cool but crashes a lot\n\nAbout 1 in 3 times I play it crashes, stutters or is otherwise buggy. Thats sad, because the game is the kind of simple but cool VR fun that I was expecting.\n\nHelpful | 0\nDeveloper ResponseMar 11 at 7:59 AM\n\nSorry to hear about the issues with your Quest :( We haven't had any reports of crashes or stuttery performance, so there might be something we can do to resolve your issue. Can you please send us an email to support@i-illusions.com and we will see what we can do.", "Red_655Jan 31 at 11:35 AM\nLove this\n\nI only wish the brawler was more accurate/effective\n\nHelpful | 1", "Etailer1Dec 12 at 7:43 PM\nOne of My Favorite Games\n\nSpace Pirate Trainer is a pretty simple shoot em up wave game that's lots of fun. It is really immersive and challenging trying to get high up on the leaderboard. This is a fast action game that's a blast to play. I first bought this for my Vive but when I saw it appear on the Quest I jumped on it.\n\nHelpful | 1", "HSGamer105Feb 5 at 5:36 PM\nVery fun\n\nVery interesting and interactive\n\nHelpful | 0", "amber.pace.921Jan 18 at 1:08 PM\nSuper fun!\n\nWe have played this game a lot! Its fun to battle the hubby and kids to see who can score the best! Its really fun!\n\nHelpful | 0", "skywalker404Mar 27 at 10:23 PM\nFun but very rote\n\nNo campaign at all, just waves of enemies. :(\n\nHelpful | 1", "PikabbageJan 5 at 2:29 AM\nVery good\n\nI tried once in a shop and was not fully convinced by this. But I really started to appreciate this game when I launch the demo on my personnal setup. I really recommand it.\n\nHelpful | 1", "Gremlin_gobJan 2 at 3:05 PM\nRe-playability\n\nThis game is great, not only because you can lasso robots, but also because you can just play and play and play. The game has so much re-playability. This game in general is a great game.\n\nHelpful | 1", "Happytex_112Dec 10 at 2:32 PM\nThank you!!\n\nBought a couple of games here based on the reviews the game/experience got. The thing with vr is that every game/experience is amazing If its the first game people try. Because VR is amazing. BUT this game deserves the high score. Amazing game that really gets you sucked in. Love the different guns, powerups, shields and the insane adrenalin rush when 15 robots shoots laserbeams targeted on you. You will get a good exercise trying to beat your own or friends record. This game is superfun.\n\nHelpful | 1", "EggyToastGamingJan 13 at 9:11 AM\nA must buy.\n\nIm not an active person, but when I got my quest this was the first game I got. It really draws you in and gets you sweating! A must have.\n\nHelpful | 0", "HardcoreHarlowDec 26 at 3:25 PM\nOMGWTFBBQ!!!111eleven!\n\nWow....yeah its like Galaga, kinda. Worth every penny. Be sure to stretch before playing, you WILL be dodging laser bullets. Im so sore from playing this yesterday lol. No regrats!\n\nHelpful | 4", "gamerman_123Feb 4 at 7:49 PM\nAmazing\n\nThis is an amazing app\n\nHelpful | 0", "jacobwesleysmithJan 26 at 11:37 AM\nFun, responsive shooter\n\nGreat balance of offensive and defensive weapons. The intro could use a little more of a tutorial - I didnt feel like I understood the game until 30 minutes in. Fun game, would love more levels or variety in some kind.\n\nHelpful | 1", "tony.gatley.5Jun 10 at 3:17 PM\nGreat Game\n\nGreat game, especially when the hordes attack!\n\nHelpful | 0", "Sir_ivancarsonDec 27 at 7:42 AM\nThis is my fave!\n\nI'm a 46 year old dad and I love this game. My kids make fun of me because I talk a lot of smack to the droids while I'm playing. But it is so much fun and the graphics are cool and its really immersive. I'm a fan!\n\nHelpful | 0", "alexsumJan 31 at 11:26 AM\nGame best\n\nThis am the the the am game good yssd\n\nHelpful | 0", "anthony.baccareMar 1 at 11:19 AM\nCool space game\n\nI really enjoy this game it is my favorite so far\n\nHelpful | 0", "HeisenBorsheNov 28 at 4:54 PM\nSo far this is my favorite game on Quest\n\nIve bought quite a few games on the Quest so far. All have been fun, some arent exactly what I was hoping for. But this is really awesome. Arcade style shooting game where each level gets tougher and tougher. It has been hours of fun so far. Great game to show your friends and cast to your tv for all to watch the person play. Multiplayer option would be great where you team up with a friend to play the levels!\n\nHelpful | 5", "Poovy23Jan 2 at 6:18 PM\nAmazing\n\nWhen first seeing this game I didnt think I would like it very much. But after playing the demo I fell in love this is one of my all time favorite vr games ever.\n\nHelpful | 1", "Corky1961Jan 16 at 12:47 PM\nRetro in a new way\n\nLove the game. Well done to the developers to bringing Galaxian to life again. Worth very penny \n\nHelpful | 0", "PH-FamJan 5 at 7:01 AM\nFun even sitting down\n\nI just had knee surgery and this is one of the few games I can comfortably play sitting down. I think it will be even better once I get my mobility back!\n\nHelpful | 0", "willow300231Jan 20 at 9:02 PM\nJust amazing!\n\nIf the shooting angle feels odd go into the settings. There's a slider for it\n\nHelpful | 0", "fishermanrichDec 20 at 4:11 PM\nBy far the best game so far on Quest\n\nThink space invaders, think matrix, think holy heck I actually need to move around!! This game is so all consuming that you cant help but play for longer than you intended! If you don't have this game, buy it immediately!\n\nHelpful | 1", "Fourteenset713Dec 26 at 6:27 PM\nNice game\n\nIts a nice game but I think it could have more weapons for example a mini gun or a SMG and more A new Milly weapon wold be nice to like a light saver or a throwing mode to thats all.\n\nHelpful | 1", "PauliuwJan 27 at 12:32 AM\nSuper fun!\n\nOne of my favourite games on the quest!\n\nHelpful | 0", "ZalainsDec 27 at 11:19 AM\nBreath taking\n\nThis is an amazing game that I seriously recommend. The only problem is that the music slows down when youre in the slo-mo dodges, and theres a lot. Anyway, buy it . Its AMAZING!!!!!\n\nHelpful | 0", "BMVR01Dec 1 at 2:44 AM\nThis one is a must have.\n\nNot sure why this isn't a constant top of the top rated and reviewed games. It's the one I always go back to for guaranteed VR fun, gotta believe anyone playing this feels the same? It's like what it might be like being inside a modern day Galaga game - it's cool - I'd certainly appreciate new power-ups with on going upgrades, *my only \"criticism.\" Hats off to the designers, you've made one of the best games on here.\n\nHelpful | 2", "merp.billDec 1 at 3:02 AM\nIf you like SHMUPS you should consider\n\nReally like the simplistic way of the game. Gets really intense as the levels progress\n\nPros\n-well make\n-vivid colours\n-easy to control\n-simple instructions\n\nCons\n- aiming can be difficult due to small targets\n- can benefit with some more level variety\n- you'll be listening to the same intense trance/EDM songs over and over\n\nOverall, a really great buy on the quest if you're looking to share the VR experience with a friend.\n\nHelpful | 2", "virtual_player_oneApr 10 at 7:02 PM\nMy Favorite Workout\n\nParticularly when untethered by the Quest, everyone can channel their inner space pirate to excellent music.\n\nMoving around definitely makes the game better\n\nHelpful | 0", "Graendal77Dec 27 at 7:54 AM\nPretty awesome\n\nIf you have any \"old school gamer\" in you, buy this game now. This is a great game, a lot of fun, and addictive. The price point on it is perfect. No excuse to pass this one up.\n\nHelpful | 0", "VazzarothJan 3 at 10:39 AM\nI only wish for more varied levels\n\nOtherwise it's perfect for the $10-15 tier.\n\nThe gun selections are varied, and there's even 2 melee options. There's physics differences between weapons, I don't know what else you could ask for. My only real complaint is that the powerups are kind of hard to tell apart in the heat of playing, AND I really wish for more level and enemy spawn pattern variety. Starting over every time makes it feel like a rogue-like with no random aspects, so it gets repetitive.\n\nIf you're just looking for a simple 10-30m experience to have fun with in VR, SPT is my #1 recommendation. I could always want more, but the low price point justifies the package.\n\nHelpful | 1", "Jimboski711Jan 18 at 4:43 PM\nIts the bomb\n\nSuper fun super cheap just buy it. Try the demo you will be hooked\n\nHelpful | 0", "charlotte2812Jan 2 at 2:25 PM\nSpace Pirates\n\nWow, fantastic game and perfect for the whole family!\nMy 67 year old dad loved it as did my 11 year old daughter..\nWell worth the money\n\nHelpful | 1", "LP64000Nov 20 at 6:47 AM\nHow is this so good? \n\nBought totally on a whim. As a true gamer of many years was concerned Oculus would be all gimmicks, and whilst you could say this is another simple shooter you would be so wrong. It is beyond utterly engrossing and the feeling of the guns and shield is to date on of my finest gaming experiences. Absolutely buy if you love proper gameplay!!   \n\nHelpful | 8", "easyEonJan 8 at 1:18 PM\n\nAbsolutely brilliant game, couldn't expect less, hours upon hours and hours playing. Would recommend to any gamers.\n\nHelpful | 0", "Rednick69Jan 24 at 3:48 PM\nFun\n\nThis is a fun stress free game.\n\nHelpful | 1", "DeMonsterAteThisDec 1 at 12:32 PM\nJust wow\n\nThis was my first game I played on VR and it blew my mind today I have tried many other games and SPT still blows my mind. The design, the ease of use is unlike anything else I let my 6y/o cousin play and watched her beat my high score in 10 min. This game is just pure fun. Exactly what a video game should be\n\nHelpful | 0", "LuckyLuke_Jan 16 at 4:34 PM\nGood\n\nI wasnt ready for the fun explorer mode even though I played the demo game and I have a lot of positive comments about the game but there is one negative and that is when Im using the electric wipe sometimes it switches to the gun\n\nHelpful | 0", "Reedman73Dec 22 at 9:15 AM\nSatisfying to Play and Easy to Use\n\nThis game is amazing with how smooth the movements are. Its amazing how easy it is to go from dodging bullets to pulling a sword from your back. Every minute is action packed and fun.\n\nHelpful | 1", "King_luliJan 16 at 7:42 PM\nAmazing\n\nThis game is so fun and challenging. Definitely one of my favorites.\n\nHelpful | 0", "DiamondSwordsHQApr 11 at 3:57 PM\nExtremely fun\n\nWhat can I say about this game it's a fantastic time killer super fun to play many modes to choose from It's fantastic for the price\n\nHelpful | 0", "Kym-HobbsDec 26 at 7:26 PM\nOne of my favourites.\n\nI bought this game day one. I have to say it one of my favourites and I often find myself coming back to it after playing any other recent games I have bought.\n\nHelpful | 1", "xGysaJan 17 at 7:02 PM\nCRAZY\n\nAmazing game you need to get this as your first experience\n\nHelpful | 0", "KnuckleE05Apr 22 at 8:22 AM\nExcellent game!\n\nKeeps you on your feet. Very addictive game! Challenging and addictive!\n\nHelpful | 0", "flashsheldon9Dec 27 at 12:12 AM\nFor next expansion pack or update\n\nGreat fast paced action game\nWould like some more modes(eg. Endless)and mabye a rifle or double handed machine gun and power to control the space ship\n\nHelpful | 1", "Docwiz2Nov 27 at 11:38 AM\nPlay the demo for free and BUY this game\n\nI played the demo for only like 10 minutes and I was hooked, bought the game immediately, it's not expensive at all. The Oculus Quest has some good games out there and this is one of them, the ability to move around freely without any cable being in the way is awesome and cross buy as well. If you like the old Arcade shoot-em ups, you are going to love this 21st century modern version and the shield option is awesome. Just put your arm behind your back and pull off the shield move, fantastic! Was really amazed how immersed this felt. I think that I am obsessed with this game and I love it. Buy it and enjoy it.\n\nHelpful | 1", "chinesetoesellerJan 26 at 12:37 AM\nI like it\n\nI like it\n\nHelpful | 0", "GreatGRAVITYMay 4 at 9:25 AM\nSpace pirate\n\nLove it.\n\nHelpful | 0", "colinonealApr 18 at 9:00 AM\nCool\n\nThis is a great game I played it for hours this is a great game the 15$ is worth it\n\nHelpful | 0", "CoryPrinkeyDec 21 at 3:06 PM\nIt is worth every penny!\n\nI never even considered this game when I first purchased the Oculus Quest. Fortunately it came with a demo! This is a fun, clean arcade shooter. It's great for the whole family!\n\nHelpful | 1", "GetSteinrockdApr 26 at 5:32 AM\nAmazing!\n\nFantastic quest game with hours of play time!\n\nHelpful | 0", "Mr.ComputerNov 19 at 11:38 PM\nHighly recommend this game\n\nI wasnt originally going to buy this game but I only bought it because I needed more games and this seemed okay. But this game turned out to be amazing game with great graphics and gameplay. I very much love the different weapons you get to choose from. My top two favorite weapons are the Iron Grenade and the laser gun.\n\nI do have one warning for everyone about this game.\nWatch out for the giant boss at round 25 because he is not easy to take down.\n\nHelpful | 4", "Ares8Jan 26 at 3:55 PM\n\nGood\n\nHelpful | 0", "everonwardsJan 12 at 7:11 AM\nExactly what it says on the tin\n\nShoot droids, slice them up or smash them on the ground. All great fun.\n\nHelpful | 0", "SocietykillsmeDec 1 at 2:54 AM\nYOU'LL BREAK FURNITURE!!!\n\nStraight forward, non stop action that's so addicting, you'd gladly give up sleep if not for the battery dying. Guardian zone? Forget it! Prepare for broken furniture and holes in your walls dodging the robot onslaught.\n\nHelpful | 6", "DaBigBoomJan 20 at 12:26 PM\nVery nice\n\nI just bought it and loved it\n\nHelpful | 0", "triplejay2013Dec 18 at 6:39 PM\nSounds like fun on a bun\n\nFun game. Didn't think it looked interesting based off of the description, but bought it anyways. Played til the quest died. Wish it had more than the arcade mode, but as is it is a great game.\n\nHelpful | 0", "PeteEnglish68Oct 13 at 11:08 AM\nWhy I love this game\n\nSpace Invaders was one of the 1st video games I played and enjoyed I'm older. playing Space pirate trainer Is Space Invaders Mixed with speed. I own every oculus quest title worth owning and space pirate Trainer is the one I play most frequent sometimes 4 nights per week good exercise really immersive a beautiful piece of work.\n\nHelpful | 26", "ccancellJan 2 at 8:27 AM\nGreat game\n\nThis game is tons of fun and is the go to when we have company over trying the oculus for the first time.\n\nHelpful | 1", "Joshy202Nov 24 at 5:10 PM\nAWESOME!\n\nI had previously plaid the game at a mall demo and enjoined the five minutes of it there, so i was excited to try it first hand. First thing i can say confedently is that everyone will like playing it. My whole family tried it and they all loved shooting robots out of the sky. Its also a great game to take turns on. The replayability is huge and still fun, i keep finding myself comparing scores and trying to beat my best.\nMUST BUY GAME!\n\nHelpful | 1", "CaptainFroglegsJan 2 at 10:08 PM\nFUN AF\n\nJust buy it, youll be glad you did. Always a go-to when youre feeling some action shooting VR\n\nHelpful | 1", "rensekurtJan 22 at 10:18 PM\n\nNice\n\nHelpful | 0", "cynonymDec 28 at 5:27 PM\n\nAfter playing the demo, we knew this would be the first game we bought for our Quest. It's a great arcade game that makes you dodge and weave and shoot and think and sometimes hide because omg too many!!\nMy one complaint is that you're surrounded by an amazing environment you can't interact with. I'll give it five stars when i can fly that ship on the landing.\nIt could also use some kind of plot/story, but it's fun enough without.\n\nHelpful | 0", "xfaze217Dec 27 at 11:54 AM\nIf you have a rift/quest, you MUST buy!\n\nWave after wave stronger droids appear, and the first nine waves are a blast. But as for waves 10-99, having a blast is an understatement. To put it simply, you havent seen fun until you pass wave 10. Who knew obliterating droids for no reason at all and wasting your trainers money was so much fun! The only reason I gave this 4 stars is because of a bug which makes enemies unable to attack, and instead floating around aimlessly and getting blown up. That really isnt a problem until wave 8, where a new type of droid is introduced. That new droid has loads of health and can only be damaged while attacking. But now he cant attack, and your stuck on wave 8 until you give up. The fix is easy, just restart the game. It gets really annoying though, and definitely needs a fix.\n\nEdit: Thanks for the reply! I never thought I would get one directly from a dev. Thanks for doing this, not just replying but also being willing to put in the time and try to fix this.\n\nHelpful | 0\nDeveloper ResponseDec 27 at 10:43 AM\n\nHmm, weird bug. I haven't seen it, but we'll go hunt it asap. Let us know if you find a way to reproduce it at support@i-illusions.com.", "SWEATYVRJan 3 at 9:46 PM\nReally time consuming\n\nI could play this all day... it does get repeated but there are a lot of game modes. Worth it\n\nHelpful | 0", "Sam_parryJan 5 at 4:53 PM\nAwesome game\n\nI loved the game it is an incredible experience and always makes you want to play again\n\nHelpful | 0", "EshrubsDec 24 at 6:42 AM\nGreat first purchase\n\nThis game is the perfect addition to any collection. Definitely breaking a sweat too keeping up with lasers coming from every direction!\n\nHelpful | 1", "KiwiDude94Nov 29 at 2:39 PM\nExactly what i wanted\n\nThis game blew my mind. I knew i was getting a good game because i tried the demo but this game is necessary for a good library of craft games. Sure there are some sacrifices in graphics but when you are blowing up space baddies you dont even notice. Would recommend!\n\nHelpful | 0", "Herobrinejosh07Apr 26 at 12:42 PM\nLoved it\n\nWas a fun adventure\n\nHelpful | 0", "Darkpassage101Dec 26 at 9:01 AM\nLove this game small port issue\n\nI have always loved this game, it's what got me into VR in the first place, very simple concept that knows what it wants to do and does it well. Only complaint about the quest port is that it doesn't always switch between the shield and gun when you want to which can be in annoying in the middle of an intense wave.\n\nHelpful | 0", "austin.houserJan 17 at 7:49 PM\nExtremely fun once you learn the game\n\nOnce you get the hang of the controls this is an extremely fun game. Could use a better tutorial, especially since its more of an arcade that would be fun to throw new-to-VR friends into.\n\nHelpful | 0", "MystereonDec 24 at 5:10 PM\n'Go to' for pick up and play\n\nUntil they remake ToeJam and Earl this is my go to game . I just wish they did an update with more amazing tunes . Ace work chaps :)\n\nHelpful | 1", "DenSnipes06Dec 28 at 1:29 AM\nUnbelievably addicting\n\nEvery time I play this game in there for at least an hour and I believe it's one of the best games for the oculus quest.\n\nHelpful | 0", "timowayApr 2 at 1:02 PM\nTraining for the Arena\n\nOne of the OG VR games is still one of the best. Easy to jump in, have fun, maybe even break a sweat, and destroy bots. Mandatory DL!\n\nHelpful | 0", "LanceVaderApr 3 at 5:46 PM\nGreat game.\n\nOne of the best shooter games in my opinion. Constant movement while shooting. Great that the further you go the harder it gets.\n\nHelpful | 0", "abelinkDec 31 at 11:07 PM\nFantastic shooter\n\nVery fun, still one of my favorites. Love trying to see how far I can get using the same weapon.\n\nHelpful | 0", "JuDg3_JacobJan 13 at 1:38 PM\nSpace Pirate Trainer\n\nAn Amazing game to start playing vr.\n\nHelpful | 0", "GodzillaE05Jan 4 at 1:58 AM\nDid not think it would be a wave based g\n\nFrom the demo I thought it would be a story game but its ok still a great game\n\nHelpful | 0", "fsp48Nov 6 at 8:02 AM\nClassic great first new to VR for WOW\n\nAfter being into VR since first Dev kit and finally CV1 and now quest, this game is still a go-to favorite to play with friends and demo to those new to VR. It's simple enough but really shows off the main coolness that make VR so fun... Holding the shield, laser lasso/sword and blasters in your hands and shooting down and dodging like you're really there is just such a quick get into fun game. A must have for the library even after it's been out for years now.\n\nHelpful | 2", "michael.mckimDec 24 at 3:21 PM\nBest friendly competition game.\n\nLove it. We have ran the battery down 3 times at the family Christmas gathering. Great fun, totally worth buying.\n\nHelpful | 2", "denniznDec 27 at 10:46 AM\nGreat game\n\nOne of my favourite games. Only one thing I wish dev to improve is to add multiplayer option and add more levels...\n\nHelpful | 0", "gen.gregorJan 12 at 12:22 PM\nAddicting\n\nGreat game with lots of challenge!\n\nHelpful | 0", "guysh123Jan 12 at 8:59 PM\nGreat my dad playing this all the time\n\nGreat he basically stole my quest\n\nHelpful | 0", "Filup06Jan 9 at 6:45 PM\nVery cool\n\nSpace pirate trainer is very cool but very cool\n\nHelpful | 0", "DeadlyVoltronApr 5 at 3:14 AM\nSkillfully\n\nI try it and it was very fun i feel like ive been teached for special skills...People rate this 5 today...!\n\nHelpful | 0\nDeveloper ResponseApr 5 at 4:02 AM\n\nGlad you enjoyed it! Happy Space Pirate Training", "BellringerQuinnDec 11 at 2:16 PM\nStill my favourite\n\nThis was the first VR game I purchased. It was my favourite game then, is my favourite game now (I own almost 10 games now), and probably will remain my favourite vr game for quite some time.\n\nHelpful | 0", "tristan.peavler.1Jan 11 at 9:53 PM\n\nReally fun game would recommend\n\nHelpful | 0", "jim2307Jan 13 at 4:06 PM\nAwesome\n\nA must have on the quest.\n\nHelpful | 0", "jamodvNov 19 at 4:05 AM\nReally good for 15 bucks!\n\nThis was the first game I played in VR (PC). Really glad they ported it to Quest and what a great port it is! Cheers to to the developers for their hard work on that. Game plays and looks great.\nWould be nice to see if they game is expanded to different environments and different enemies.\n\nHelpful | 3", "Craftzman7Dec 23 at 5:43 PM\nyes\n\nPlay this f-omg game I have played it for hours it is the BEST game that I own. I highly recommend this for the quest.\n\nHelpful | 1", "gtimrk3turboDec 29 at 4:17 AM\nMust have\n\nAwesome game I have played many hours now and am still loving it. A real must buy for quest users.\n\nHelpful | 0", "JojodunetDec 22 at 10:35 AM\nLoving it !\n\nI love this game, it's fun, the ranking with friends is great, we're always looking to improve our score.\nIt's a game you need to have in your library.\nI only put 4 stars out of 5 because I would have liked to test the full game on Steam with Oculus Link but I will not pay the game twice.\n\nHelpful | 1", "yxv08Dec 28 at 6:30 PM\n5 stars\n\nFam frickin loves it one of our fav games cant stop playing this game every night we play this game\n\nHelpful | 0", "CommanderDawg95Jan 26 at 11:28 AM\nAwesome!\n\nThis game is super cool! I really love the futuristic feeling this game has, and just the simplicity of the game is great.\n\nHelpful | 0", "Rudedog08Jan 15 at 7:12 PM\n\ngreat game\n\nHelpful | 0", "CrelsDec 23 at 11:11 AM\nAwesome\n\nThis game is just awesome. It's kind of like a space invaders on steroids in 3D. Matrix style dodging is a blast.\n\nHelpful | 1", "hightechfoolNov 29 at 12:10 AM\nBelieve the hype!\n\nWanted this for a while... and finally pulled the trigger. Infinite replayability + great techno music. Easy to learn, easy to play, more weapons than you'll ever need. An instant classic!!! Goes well with a few drinks also ;)\n\nHelpful | 1", "nicholas.payne.17May 1 at 8:46 AM\nSpace Invaders 2.0 in VR\n\nThis is exactly what it reminded me of. I really enjoyed that there are lots and lots of options, this will be a game I play alot!!\n\nHelpful | 0", "PoodsterNov 17 at 5:07 PM\nSuper Fun Arcade Shooter\n\nA great game if you love the classic arcade shooters. Endless playtime and several game modes gives this game a great bang per buck.\n\nThe soundtrack is awesome and it's a lot of fun to bring out the shield from behind your back. The graphics could be better compared to more recent games.\nGive the demo a try, and if you like it, definitely grab this game.\n\nHelpful | 0", "kwind4444Dec 26 at 8:36 PM\nFun, simple, yet challenging\n\nNearly flawless. My only complaint is that it does get mind numbing, but thats everything in life. Easy 5\n\nHelpful | 0", "gamerkingdomNov 16 at 7:30 AM\nSuper Fun!!\n\nIts nice to have some space when playing this game but they did a good job of making it really playable in a small space. I didn't think much of the game from the preview but not unlike most things on V.R it blew me away this is the perfect arcade shooter to play with friends to see who can dominate your personal leaderboard loads of fun and it doesn't get old like a regular arcade shooter. This game if fun everytime you play! If i were to say a couple things about it. I would like a couple more weapon skins, choices of colors for laser and projectiles themselves and maybe 2 or 3 more levels to choose from.\n\nHelpful | 0", "Queen37Feb 7 at 4:22 PM\nLOVE IT\n\nVery good game. Could use a story mode though.\n\nHelpful | 0", "Julian-DelphikiJan 11 at 2:18 PM\nGreat game\n\nIncredibly fun\n\nHelpful | 0", "Lewis719Jan 3 at 11:05 AM\nReally addictive and fun!\n\nSo many varying waves and weapons. So fun!\n\nHelpful | 1", "Silverraider420Dec 8 at 11:10 AM\nMINDBLOWN\n\nThis game is very well made when you play you feel like some kind superhero you defeating robots slow mo bullet dodging deflect lasers back a the enemy its just all around amazing\n\nHelpful | 0", "McSquigsJan 28 at 12:20 PM\nWicked cool\n\nBoth my husband and I love playing this game against each other. Definitely would recommend\n\nHelpful | 0", "Mr.SmooCDec 26 at 1:26 AM\ndemo misleading\n\ni played the demo of this game and it looked like it had a story mode and you were trying to destroy the mothership. not at all. its just a arcade game were there are waves.\n\nHelpful | 13\nDeveloper ResponseDec 26 at 1:40 AM\n\nMothership starts at wave 25... Feel free to ask for a refund: Open the Oculus companion app on your phone. Tap Settings from the bottom menu. Tap Purchase History under Payment. Tap on the content you want to request a refund for, then tap Request Refund. Follow the on-screen instructions to request your refund.", "suman.kc.3297Nov 12 at 4:47 AM\nBest game on Quest\n\nBest game for everyone is subjective but i haven't found anyone that hasn't fallen in love with this game. I just casually bought it to try and has been my favorite game ever. The moment you step into the game you enter an arena filled with enemy robots and you have to shoot them down. This game is 10 times more fun to play than to describe. Must buy for anyone. Only thing is the arena is the same. I want space pirate trainer 2 so bad \n\nHelpful | 1", "CoolcarlgamingNov 28 at 6:11 PM\nSolid game. Smooth mechanics\n\nThe game works flawlessly. Its a fun way to introduce people to VR at parties. My only complaint is that I wish there were more modes and ways to play. With its current mechanics and gameplay its still easily a 5 Star title\n\nHelpful | 0", "Archetype75Dec 20 at 12:09 AM\nNot a cross buy game\n\nThe game itself is not a bad game graphics are desent on the quest but better on the rift ,my problem is with Oculus claming its a cross buy game and not supporting this. Oculus support lets the whole community down with their lack of support which would be oherwise some of the best hardware money can buy in the VR world\n\nHelpful | 9\nDeveloper ResponseDec 20 at 12:44 AM\n\nSpace Pirate Trainer is a cross-buy compatible game, which means you can play it on either your Quest or Oculus Rift without having to buy a second time.", "CapnSotoDec 12 at 5:58 PM\nOld memories\n\nFeels like back in the old arcade but this time i akninside of it.\nNice shooter.\nTip: what about a galaga skin for the droids? That would a laugh.\n\nHelpful | 1", "hammerkingFeb 13 at 6:48 PM\nGreat game\n\nLoved it\n\nHelpful | 0", "FrenchnationalistJan 9 at 5:05 PM\nIntense and fun\n\nBless this game\n\nHelpful | 0", "SuperZooper3Dec 15 at 1:34 PM\nPerfect game for the quest.\n\nThis game is a must have and takes full advantage of the freadome the quest gives. Also has a good learning curve and lots of replayability.\n\nHelpful | 0", "CordlessOneDec 9 at 6:58 PM\nAll that. Probably more.\n\nThis is a great game to play. I haven't played enough to get familiar with every aspect, but I presume it can only get better. The best dodging exercise for Oculus Quest.\n\nHelpful | 0", "K9SHAWN16Dec 23 at 10:08 AM\nDrop dead\n\nWow, so much fun learning how to use all weapons, will wear you out, never a dull moment\n\nHelpful | 1", "WeepingSugar959Jan 1 at 6:19 PM\n\n\nIts a great game. Keeps me occupied and I have a great time doing it!\n\nHelpful | 0", "Mark7451964Jan 19 at 9:38 AM\nGreat fun & exercise\n\nThis game is a lot of fun. Reminds me of the old space video games, except your in it. Graphics are cool and game play is fun !!\n\nHelpful | 0", "ger87410Dec 22 at 11:13 AM\nOne of my favorites\n\nYou need some room to move around and dodge bullets.\nLots of fun.\nI love playing this game.\n\nHelpful | 1", "AClockworkAaronDec 1 at 11:37 AM\nLove it\n\nWave based shooting games are not the kind I would imagine myself playing.\nEven though I completely suck at this game I just love playing it.\n\nEvery time I get a game over I just say Ok 1 more round.\n\nHelpful | 0", "jamesmc0495Nov 12 at 1:23 PM\nI was so wrong about this game...\n\nNot gonna lie I was skeptical watching videos about this game thinking \"this looks pretty trash...\", but I decided to at least try the demo. Holy crap I couldn't have been more wrong. I had to have more. I had to try all the weapons. I've even gotten frisky having the shield in one hand and the melee weapon in the other lol. This game is so fun. It reminds me a little bit of space invaders with the arcade game Police 911. That being said holy crap does this game get pretty hard. Im relatively new to VR, so maybe I just suck that hard lol, but i get towards round 16 and start to fizzle out. Nonetheless I have such a blast with this game. I don't think I could have gone with a better choice for my first paid for VR game.\n\nHelpful | 0", "MaXiMuM-VDec 13 at 6:56 AM\nYeah this game is great.\n\nI am happy this game exists, its a good workout in its own right and keeps both hands busy. Its organic immersive and challenging. Good job!\n\nHelpful | 1", "Mans_McGeeDec 28 at 5:58 AM\nLove it\n\nAddictive, fast paced gameplay. Really feels like an arcade game.\n\nHelpful | 0", "MarkStirtonAberdeenDec 21 at 2:58 PM\nGreat fun.\n\nBasically a sci-fi arcade shooter from the 80s, only in VR. Wave after wave of fun. Recommended.\n\nHelpful | 1", "CocomojoepicoDec 27 at 9:04 AM\n5 stars\n\nThis game reminds me of Some old great games. This is in my top 3\n\nHelpful | 0", "RandomIsNameDec 27 at 9:37 PM\nYou shoot\n\nShoot robos get points what can I say? Its the perfect game\n\nHelpful | 0", "pikabombDec 29 at 3:18 PM\nSuper entertaining\n\nSimple concept, very cool visuals, really nice to play\n\nHelpful | 0", "radu1986Jan 31 at 4:12 AM\nCool but repetitive\n\nCool look and feel but very repetitive and ultimately boring. Could've done with a story or something.\nKinda sorry I got it and didn't ask for a refund. Oh, well...\n\nHelpful | 1", "ktulu037Dec 27 at 2:03 PM\nFantastic!\n\nThis game is very addictive. I completely recommend this game!\n\nHelpful | 0", "zainiazDec 29 at 5:04 PM\nGreat game\n\nSuch good fun, really recommend this game\n\nHelpful | 1", "rattleheadxyzJan 5 at 7:35 PM\nA Heckuva Lotta Fun!\n\nThis may be one of the more simplistic games on the Quest, but dont let that fool you. Its still a lot of fun to play. It puts up a good fight and makes you feel like a bad@ss!\n\nHelpful | 0", "craigbatesDec 16 at 7:00 AM\n\nFun game always trying to beat the high score play it most days it one of those games you will always come bk too.\n\nHelpful | 0", "DarklenHoganJan 4 at 5:09 PM\n\nBest game I have\n\nHelpful | 0", "GatadaNov 18 at 1:38 PM\nGreat Fun - close to perfect\n\nVery entertaining, perfect for VR. Exactly how you hope it will be! Look forward to playing again.\n\nWould have liked slightly higher resolution textures, and small improvements to the menu: eg. would love to simply have Replay when completing a game.\n\nHelpful | 0", "Chicken_LittleNov 26 at 9:38 PM\nLove the batons!\n\nI liked the guns, just felt a little repetitive, then I found out about the force-wielding laser batons. Perfect. I love melee and havent experienced the force in vr yet, so that made it so much better!\n\nHelpful | 0", "SeanMbryantDec 25 at 10:32 AM\n\nSpent more time on this than any other game so far!!! It's a 10\n\nHelpful | 1", "OK_Boomer_69Dec 16 at 5:56 PM\nAbsolutely must have\n\nfirst game i bought and it was totally a great purchase, from the graphics to the immersiveness it is amazing\n\nHelpful | 0", "andreatharmktDec 31 at 1:42 PM\nGreat game!\n\nThe game really worth it's money\n\nHelpful | 0", "steve.fuller.71619Jan 28 at 5:27 PM\nGets too hard too quickly\n\nI bought after playing the demo a few times after a couple of minutes it got much too difficult too quickly i am selecting the easy option but there must be something wrong as after 10 minutes i die every time as there are up to 20 enemy on screen?\n\nHelpful | 0\nDeveloper ResponseJan 12 at 5:31 AM\n\nTry playing on \"Explorer mode\" which refills your health every wave. Don't forget you can swap a blaster for a shield on your back, which can really help when there's a lot of laser fire. Above all make sure you dodge enemy fire by physically moving out of the way, Space Pirate Trainer was made to encourage you to move as much as possible! Have a play and here's hoping you reconsider your review of the game, Best regards and happy Space Pirate Training! Chris", "JuxtaposeDec 6 at 11:48 PM\nAn amazing arcade experience\n\nFantastic game to load up and just get right into the fast paced action. Music is awesome too! A shining example of how VR experiences rock!\n\nHelpful | 1", "Der3dApr 12 at 10:15 PM\nyes\n\ngood game\n\nHelpful | 0", "STALYMIDec 6 at 2:58 PM\nBest game on the Quest so far!\n\nI have a lot of games on this Quest but this is my favorite by far! Buy this game it is so worth it for the replay of all the modes and unlocks!\n\nHelpful | 1", "william.duckett.1460Jan 1 at 8:46 PM\nDecent\n\nI havent played a lot so I cant say Im an expert. I have played several rounds and from what I know to this point is basically its cool being VR, and the experience is fun etc. but this far the content is pretty limited and the gameplay seems fairly repetitive. Nothing really changes, just different levels of difficulty. The options seem pretty minimal as well. A lot of potential but seems to not use all of it. In all, I wasnt disappointed since it didnt cost too much. Right at that proper price point to avoid buyers remorse. As I opened with, Im no expert. Maybe Im overlooking something?! I hope so. Cuz I appreciate a great game and all the other reviews seemed to had a different experience. Please share ideas of Im missing something.\n\nHelpful | 0", "3.wavJan 21 at 4:24 PM\nOkay\n\nGreat when you first play it, but gets boring after a while. Would still recommend tho.\n\nHelpful | 0", "Recon0101Dec 21 at 8:41 PM\nAlot of fun!\n\nA wave based shooter with different \"firing modes\" to chose from!\n\nHelpful | 1", "DSpuds87Jan 2 at 5:44 PM\nKool\n\nThis game is simple, awesome, & to the point. It is challenging and immersive and is perfect for displaying to friends and family what VR is capable of. Well worth the $$.\n\nHelpful | 1", "KeithTheEditorNov 10 at 7:31 AM\nGreat game.\n\nI was lucky enough to purchase this for 7.99 in the rift store. Cross buy! This game is so much fun. I love looking at my weapons change in my hands and the laser club magnetic saber thing is an awesome tool. It's like being in an 80s arcade game. Oldy but goody!\n\nHelpful | 1", "RonieroneDec 11 at 8:28 PM\nThrilling Game\n\nI Love this Game! I can't stop playing! Protecting your space port on the ships launch bay. We need more games like this!\n\nHelpful | 0", "DalusionDec 23 at 8:45 PM\nExcellent VR experience\n\nThe music, the guns, the sheer badassery. Don't miss on this!\n\nHelpful | 1", "Slimeman07Dec 29 at 5:40 PM\nLove it\n\nVery intense and fun\n\nHelpful | 1", "romi.shahaf.5Dec 27 at 4:54 AM\nMy favorite game on the quest\n\nThis game is so good. You won't regret.\n\nHelpful | 0", "jakepop3Dec 26 at 6:42 AM\n\nAmazing and exilerating\n\nHelpful | 2", "swood420Dec 25 at 4:02 PM\n\nLots of fun. Very addicting\n\nHelpful | 2", "Sonictheboss8472Nov 9 at 3:53 AM\nMore than I couldve ever expected\n\nThis game is like Space Invaders meets the real world and it hits hard. Ive always wanted a bullet hell in vr and this is the perfect incarnation of it. Have had the most fun restricting myself to certain weapons to hit that scoreboard and I find it to be a fun challenge.\n\nHelpful | 0", "MDWZT25Dec 23 at 9:24 AM\nExcellent Game\n\nLove it. Love watching friends play as well.\n\nHelpful | 1", "Yobread21Dec 27 at 11:34 AM\nReally good game\n\nIts fun everyone should have it\n\nHelpful | 0", "DevoniamDec 28 at 8:35 PM\nY E S\n\nThis application is Y E S\n\nHelpful | 0", "bennybananabumDec 21 at 8:58 AM\nFandabbydozy!\n\nThis is soooooo much fun. Get it. Simple. Superb.\n\nHelpful | 1", "smashmouf412Dec 27 at 7:13 AM\n\nGreat fun..\nAwsome effects..\n\nHelpful | 0", "liw53Dec 23 at 8:28 PM\n\nAwesome game. One of the best here.\n\nHelpful | 1", "joe.rollinger.7Dec 21 at 8:57 PM\nMust buy\n\nGreat graphics,fun and challenging\n\nHelpful | 2", "jmgeroDec 27 at 10:03 AM\nOK Game\n\nThis is supposed to be one of the best shooter games for the Oculus Quest. If so, maybe the quest isn't meant for shooter games because it is very okay. It is not a bad game, I just expected more I guess. The difficulty level at first ramps up fairly quickly which kind of drains my enthusiasm to play this when I have other Quest games that have a much more even difficulty ramp that keeps me engaged. If you like shooters, I have played much better ones on the PC or the popular gaming consoles. I am guessing this is getting some rave reviews because not a lot of competition in this category yet on the Quest.\n\nHelpful | 0", "triggerpullerusmcNov 30 at 6:09 PM\nReally like this game\n\nSimply put first game I played and it worked flawlessly- so far only game Ive played that isnt at least a tad buddy and loads of simple fun- GET IT...\n\nHelpful | 0", "marc.merbergNov 5 at 4:28 AM\nMy First Game\n\nJust purchased the Quest, so i wanted a good action game. Was not disappointed. This game has u ducking and dodging. Depending on the mode and simulation u pick, you can be overwhelmed. It had my granddaughter dropping to the ground. Attacks come from all angles. Excellent\n\nHelpful | 0", "lordpuncake15Jan 29 at 1:46 PM\nPretty good\n\nrecommendation I think\n\nHelpful | 0", "SyronVDec 18 at 5:44 PM\nAwesome fun...\n\nWe play it everyday! Great game with plenty of weapon choices!!!\n\nHelpful | 0", "MerMan1170Dec 27 at 5:34 PM\nEnemy robots not working\n\nI tried the demo and it was great, decided to get the game and the first arcade match was fine but after losing and starting again the enemy robots were not shooting at me and the spherical ones that open up and shoot werent opening there for I couldnt kill them and made no progress and had to restart and it still didnt work.\n\nHelpful | 0\nDeveloper ResponseDec 27 at 10:46 AM\n\nCompletely exiting and restarting the game should do the trick, weird that it doesn't work for you. We're hunting for the bug now, so if you find any way to reproduce it, please contact us at support@i-illusions.com. Thanks!", "NocaedybotDec 25 at 8:06 AM\nBrilliant\n\nJust so satisfying\n\nHelpful | 1", "Nitrox72Nov 8 at 2:25 PM\nMy favourite VR game by far\n\nThere are loads of games that grab my attention but this is the one I just go back to over and over. Like a totally immersive version of Galaga where you're actually inside the game this has a \"just one more game\" hook to it that proves it's longevity. Love it!!\n\nHelpful | 0", "john.toland.10Nov 26 at 11:46 AM\nFUNTASTIC\n\nA great game. Simple, fun and addictive. You shoot, block, duck and dodge an oncomming storm of alien invaders. Controls are simple and reaching behind is a great touch.\n\nHelpful | 0", "Linkforce126Oct 29 at 12:56 PM\nOne of the Coolest Battle Arenas\n\nI bought this game purely because of the demo that came with the Oculus Quest.\nIt was one of the first things I tried in VR, and it blew my mind when I could switch between 6 types of weapons, and dual wield any of them simultaneously. The 2 types of shields are cool as well, but still doesn't feel anywhere near as cool as wielding 2 grenade launchers.\nThe game gets more and more intense as you go through the waves, and introduce new movement patterns to keep you on the edge.\nThe music is really great drum and bass, though it may be considered repetitive; you can turn it off, and play your own music in the background if you desire.\n\nAll in all, the game is well worth the price. It gives me a Ratchet & Clank vibe with the types of weapons and space theme. At the very least, I'd suggest playing an hour or two, and you'll find yourself getting a workout as you're trying to dodge bullets while also feeling really cool.\n\nHelpful | 1", "Tg9223Dec 2 at 7:09 PM\nGood Game\n\nMy son told me that I needed to buy this game. I had my reservations but from the first time I played it I found it was very enjoyable.\n\nHelpful | 0", "bretthebossDec 27 at 1:59 PM\n\nGreat game\n\nHelpful | 1", "PortlyPigletDec 16 at 6:05 PM\nVery little content\n\nThe gameplay and controls are great and it's fun for a while, but after a few levels the number of robots in each level just becomes impossible. I would like to see more different kinds of enemies instead of more of the same ones. Also it would be cool to be able to upgrade your weapons at the end of each round. Overall decent buy\n\nHelpful | 4\nDeveloper ResponseDec 16 at 6:23 PM\n\nTry getting to wave 25 and well talk content ;)", "PresidentDarkatshDec 28 at 11:59 AM\nSuper fun but...\n\nI LOVE IT!!!!!!! Shooting is amazing, but I with the gun would have some kind of animation when fired. Plus the graphics could be better. I highly recommend this game.\n\nHelpful | 0", "kivioDec 4 at 12:28 AM\nYarrr, me love this game!\n\nArcadey fast play goodness with many weapons to master. A good way to get active too. Highly recommend this.\n\nHelpful | 1", "BalooDaaBearApr 2 at 6:49 PM\nFun\n\nIt is good\n\nHelpful | 0", "KRAW2DEATH01Jan 19 at 6:24 AM\nPretty good\n\nI thought it had a campaign but it was pretty good\n\nHelpful | 0", "ANGERSNIPERMar 29 at 12:22 PM\nIts good, not great\n\nLooks good, feels good. Decent variety of guns, unfortunately most of which are redundant.\nNo idea how to unlock items or what the difference is between categories ie oldskool, arcade etc\nKinda given up after wave 20 because it gets too difficult. Discourages you from keep trying.\nSeriously would like to have a chance of finishing the game. Replay value would be in knowing you can have a good couple hours from start to finish without getting killed in 5 seconds.\n\nDifficulty curve spikes too soon on arcade. Reaching over your shoulder with a big electric stick to activate turrets is just silly and too interfering when theres bullets flying at you everywhere. But hey, what do i know!?\n\nHelpful | 0", "Nurley182Mar 29 at 1:36 AM\nJust Not Sure\n\nI have had a quest for 6 months now and from playing this demo it was a game that was on the top 5 titles I wanted to own!\n\nFrom purchasing I was left a bit disappointed! I found the game play just got pretty boring quickly. That being said I know the game developers are not major companies with endless resources and the quest has limitations through what it can do, not to mention this was one of the first titles available on the quest.\n\nIm also having some tracking issues all of a sudden with the quest which is not helping the experience!\n\nOverall it is low cost to own, harmless for kids to play and fun for a bit.\n\nHelpful | 0\nDeveloper ResponseMar 30 at 1:12 AM\n\nSorry to hear about your tracking issues, there might be some interference from direct sunlight or overhead lighting. If you'd like us to have a look at your issue can you contact us at support@i-illusions.com", "Chickenpox117Oct 22 at 8:11 AM\nSweet!!\n\nThis is really fun and intense.. I like the game play and the graphics are great! I played the demo and thought it could have like a story or like missions but it's like a survival kinda game where you have to see how long you last! It would be cool to have a multiplayer setting or co-op or something like that\n\nHelpful | 2", "b0nu5fr4gMar 15 at 9:08 AM\nFun casual game\n\nChallenging and neatly done. Repetitive at stages, but a good price for what is offered.\n\nHelpful | 0", "cadeparkerDec 7 at 7:37 PM\nThanks Devs\n\nAmazing shooting game. Period. Love the arm shield mechanic. Cant wait to play this on next gen hardware\n\nHelpful | 0", "akamaliOct 26 at 5:00 AM\nMy very first paid game on Oculus Quest!\n\nI really loved this game, I hope the developers consider adding the following:\nA. add different theme as we progress through different levels.\nB. would also be nice to have mini story line added to the game!\nC. Add option to request support from the machines behind me when it gets very tense.\n\nHelpful | 0", "kibawolfDec 27 at 2:56 PM\nBoring, stick with pistol whip\n\nIts a nice game, not worth the price at all. If you have played pistol whip or beat saber, prepare to be bored. You just stand still shotting drones. Thats it.\nNothing exciting. Wanted a refund but i had the game on pause for too long. Now the play time is over 2 hours.....\n\nHelpful | 2", "Kdubya1304Dec 11 at 3:28 PM\nSpace pirate trainer\n\nAddictive. Completely surprised how entertaining this game is.\n\nHelpful | 0", "AjorbOct 22 at 2:54 PM\nFantastic amazing love it\n\nJust like playing a classic arcade game but your in it!!\nLove the levels and wave jump options.\nAlso nice to see how you compare to other players scores.\n\nGive the Oculus battery time a run for its money.\nDivorce material, Ill just have 1/2 hr on the oculus love..... 3 hrs later....oops.....\n\nHelpful | 1", "jason6467Dec 7 at 6:46 PM\nClick click boom\n\nLove this game. It is excellent cause i am stationary and can not move around.\n\nHelpful | 0", "naXbaraNov 30 at 7:25 AM\nFun fun fun\n\nThis game is simple and complex, always fun! It's a great way to showcase VR because of how accessible is.\n\nHelpful | 0", "PiglameshDec 7 at 12:49 PM\nSick simple arcade shooter.\n\nBest 10 you will spend on a VR game, straight to point and great fun.\n\nHelpful | 0", "James04059Nov 23 at 11:18 PM\nPretty impressed but missing a somthing\n\nThis game is super fun really interesting and engaging. You could get a lot of time out of this game and for the most part there are no glitches for bugs. But I think that it could be added to overall if the mods actually see this good job I really like this game and I will and have reccoemended to my friends\n\nHelpful | 0", "jlorenzo986Dec 15 at 5:31 AM\n\nLove it. Its so much fun.\n\nHelpful | 0", "Nque12000Jan 13 at 10:55 PM\nGets you up and moving\n\nGreat game gets you up and out of your seat\n\nHelpful | 0", "HendryCzDec 13 at 11:08 AM\nSuper\n\nI really like this game!!\n\nHelpful | 1", "brian.mcphee.946Oct 21 at 3:04 PM\nRock and roll!\n\nThis has got to be one of the best games on the oculus quest. Anybody whos a fan of first person shooters gets really interested in this. My normally sedentary friend was almost doing gymnastics dodging the bullet time lasers firing at him! Its quite difficult and will give you many hours of playing time. Highly recommend it!\n\nHelpful | 0", "MereMortalsDec 2 at 12:00 AM\nIts a blast!\n\nIf you like laser pistols, space swords, and killer space droids, this shooter is a blast!\n\nHelpful | 0", "Perniacesar177Dec 8 at 10:36 PM\nAmazing game\n\nVery good game I like it very much one of my favorite!\n\nHelpful | 0", "BrickCannonDec 7 at 3:08 PM\nAwesome!\n\nReally fun, I live the mechanics and the flow of this game. It sets a good challenge and runs really smoothly. It actually becomes a workout, I started to sweat after about an hour of play. Overall a great experience!\n\nHelpful | 1", "przemek.wichurski.3Jan 1 at 11:03 PM\n\nBut tutorial not good a lot of things i learn from mistake what you cant see on tutorial but i can say is more fun then you can see on demo\n\nSo im happy from this game\nFor Sure will like it a lot of people\n\nHelpful | 0", "PeaceEnlightensErrApr 12 at 12:25 PM\nSpace Invaders for the current age\n\nA great price for a game that is easy to learn hard to master. An absolute must have!\n\nHelpful | 0", "Darren8818Dec 1 at 7:43 AM\nOutstanding game\n\nThis game is pretty addicting. Great weapon loadout and power ups! I highly recommend!!!\n\nHelpful | 0", "ZDuck72Nov 10 at 8:28 AM\nReal life Galaga\n\nGalaga is one of my all time arcade favorites and this puts you right in the game. Played this at a VR caffe and bought my quest just a couple days later. Totally sold me on the VR experience.\n\nHelpful | 0", "splappyDec 7 at 1:17 PM\n\nGreat replay value, lots of ways to use your weapons\n\nHelpful | 0", "joshchen322Nov 26 at 3:30 PM\nGreat visual on an arcade game\n\nThis is basically Alien invaders in 3D VR. It is a little bit one dimension-ed because every level is the same and your goal is trying to chase the highest point possible. It is a game that I play time to time when in the mood but won't want to keep on playing.\n\nHelpful | 1", "emptifulNov 15 at 4:08 PM\nAwesome arcade-style shooter!\n\nGets me moving, good amount of variety with the different weapon combos and game modes, as well as local and global leaderboards for some friendly competition!\n\nHelpful | 0", "Wolvesbane364Nov 20 at 6:46 PM\nI want to be a space pirate !\n\nGreat fun! I like different weapons and interactive surroundings with the cannons and beam weapons. Hooking the robots with a baton and slicing them in half is awesome. Now why four stars? Thats because I played the demo to death and had hoped the game would let me see where the demo left off. I actually wanted to see if you could earn your space pirate license, but it doesnt. However, this game does rock awesome weapons, waves of robots, varying levels of difficulty and is just fun! I recommend this game!\n\nHelpful | 0", "papabear_the_oldOct 26 at 10:41 AM\n#1 FAVORITE\n\nSo far, my favorite game on Quest and probably my favorite first person shooter ever. This is simple, pure FUN, based on the arcade shoot-em-ups of my youth, and a helluva workout at the same time. Outstanding in every way. Can't recommend enough! \n\nHelpful | 1", "endersuperOct 19 at 10:55 PM\nVery Enjoyable and Fun game\n\nIt is a very fun game with relatively simple and easy to learn controls and mechanics, to only problem is that it is so simple that I usually only play it for about 30 min- 1 hour before I get bored with it, other than that it is an amazing game worth giving a try\n\nHelpful | 2", "thefiendbraywyatt12Jan 1 at 9:00 PM\nVery Rigged\n\nLiterally like on wave 18 I think it is LITERALLY ALL OF THEM GO TO THE SIDES AND YOU LOSE DUCKING BS EVEN THE DAM DEMO IS BETTER very ducking bad do not waste your money on this crappy game go buy creed or bait or journey of the gods or job simulator or Vader immortal,they are way better than this garbage piece of crap game smh had revise cause profanity I tried explorer but still happens\n\nHelpful | 3\nDeveloper ResponseJan 2 at 2:54 PM\n\nI would suggest getting a refund, because it's clearly not your kind of game.", "GlassesBoiDec 25 at 3:06 PM\nPretty Good but gets old\n\nI really really like this game. It feels amazing pulling your shield out while shooting rapid fire at the droids. But after a couple rounds it starts to become less fun and repetitive. Maybe a story mode would be good?\n\nHelpful | 1", "grevaz174Dec 21 at 7:43 AM\n\nGreat game while it lasted. Enjoyed for about a week and then it keeps telling me to go to my game area. No way to proceed. It has nothing to do with the boundaries as all my other games work well. Would be happy to give five stars if the problem can be corrected.\n\nHelpful | 1\nDeveloper ResponseDec 21 at 9:06 AM\n\nHi there, it's better to contact us at support@i-illusions.com for support so we can help you out.", "Tacco_TUUURTLEDec 10 at 2:58 PM\nReally good app\n\nThis gsme was sooooo good\n\nHelpful | 0", "redalert33Oct 18 at 7:52 AM\nMust-have game for Quest.\n\nThis game is awesome! It's one of the must-buy games for Quest in my opinion, and one of the best to just hand someone and tell them to try out VR. It also has a bit of depth for being an arcade shooter in how you can choose different weapon types and modes. Great game if you only have a small amount of time to play. Very intuitive and tight controls as well.\n\nHelpful | 4", "killrate1Mar 10 at 8:48 AM\nFire\n\nThis game is fire  never going to stop playing this game\n\nHelpful | 0", "JD9880Dec 5 at 8:47 AM\n\nGreatest game Ive played on VR ever.\n\nHelpful | 1", "CrazyInk13Dec 1 at 10:47 AM\nSpace pirate trainer\n\nIt says device update in progress please leave your headset on connected to Wi-Fi and plug into a power source your headset will restart when the update is complete but it never changes it never completes it never updates what do I do\n\nHelpful | 5\nDeveloper ResponseDec 11 at 2:49 PM\n\nThere is an Oculus firmware update preventing Space Pirate Trainer from starting on CrazyInk13's Quest. Can you restart the headset and go to: Settings -> See All -> About -> Software update right section - install if available. If the issue persists can you email us at support@i-illusions.com?", "Digital_RichOct 30 at 4:33 PM\nUnbelievable!\n\nWhat can I say, I absolutely loved it. Took me a second to get used to the pace because its fast but wow, looks great, plays great and considering some of these games cost 30.00, a really good deal. My favorite shooter so far.\n\nHelpful | 0", "BigLobNov 24 at 7:01 PM\nA Must Buy game for Oculus Quest\n\nThe title says it all. If I could only have 5 games on my Oculus Quest, this would be one of them.\n\nHelpful | 0", "smithster4126Dec 5 at 12:58 PM\n\nWorth every penny. Brilliant game\n\nHelpful | 1", "Urdemize666Dec 5 at 1:31 PM\nSpace Pirate Trainer\n\nThis is a must have!!! Enjoy!!!\n\nHelpful | 1", "HandsomeSlobOct 2 at 2:12 PM\nAWESOME!!!\n\nThis game is so fun and addicting. Has that older arcade feel, like a mixture of Geometry wars and first person shooter. Multiple gun choices for both hands with power ups and bullet time. I had plans to buy other games, but I end up only wanting to play this one so I haven't bought many others. One of my favorites for sure.\n\nHelpful | 8", "SANEWBERRYNov 27 at 1:38 PM\n\nFast paced action with an awesome soundtrack. Whats not to like!\n\nHelpful | 1", "hking50Nov 30 at 4:16 AM\nGreat Arcade game!!\n\nI bought it for my Grandkids but I had a lot of fun playing!!\n\nHelpful | 0", "ShadyMagicianOct 21 at 6:54 AM\nBest investment on oculus so far\n\nI was skeptical about this game but after buying the full version, its definitely worth it. Ive spend hours playing this game with friends, and will most likely continue to do so. Simple, straightforward, and fun. Definitely a must have for quest owners.\n\nHelpful | 0", "BGPabloNov 4 at 6:53 PM\nVR arcade action\n\nSpace invaders+matrix+star wars+wild West shootout+arcade+happiness. It's wave after wave of robots bent on knocking you out, while you struggle to survive and get a high score. Best game on the Quest, especially if you can create a large Guardian, allowing to run around.\n\nHelpful | 0", "shad0wslayerDec 28 at 10:55 PM\nGreat game\n\nI tried the demo then knew I had to get this game, it is quite hard at times tho\n\nHelpful | 0", "CRJ2019Jan 4 at 7:16 PM\nGreat game\n\nExcellent arcade shooter but gets tiring quickly.\n\nHelpful | 0", "itsmattbowdenOct 23 at 4:43 PM\nAmazing Fun!\n\nDefinitely a must have! Great concept, keeps you immersed and strategizing. Once you get a hang of all the different weapons and how to use the shield to its potential, its a whole different game. Great soundtrack, too! Def one of my favorites!\n\nHelpful | 0", "TabbywarriorDec 9 at 7:56 AM\ngreat game\n\nlots of fun\n\nHelpful | 0", "Mozart08Dec 7 at 5:39 PM\nVery Fun!\n\nVery fun game!\n\nHelpful | 0", "RadeRadiatorNov 12 at 7:20 AM\n\nThis was the first game in vr I ever played and the reason I bought the quest. And with no cables is even better than ever. This is a must.\n\nHelpful | 0", "Landstorm5Nov 16 at 8:04 AM\nNice exercise and fun .\n\nReminds me of the older space shooters but in vr a lot better.....like it a lot.....good workout aswell...:-)\n\nHelpful | 1", "Thomas_KarMar 12 at 7:08 PM\nFavourite\n\nMy favourite game on this vr\n\nHelpful | 0", "pipyoung13Dec 1 at 3:12 AM\nMy best game on Oculus so far\n\nJust buy it....\nNuff said \n\nHelpful | 1", "rad1982Nov 29 at 6:30 PM\n\nAwesome game so addictive can stop playing love it\n\nHelpful | 0", "SynaptikReflexJan 6 at 10:27 AM\nAwesome\n\nFun game. Family loves it.\n\nHelpful | 0", "rhonda.buechlerDec 30 at 10:52 AM\n\nSooo much fun. Only downside is guns could be more powerful.\n\nHelpful | 0", "Brahma9Apr 1 at 3:02 PM\nGreat Game\n\nIt gets tough fast but worth the challenge! Fun Game! Cant go wrong with the price!\n\nHelpful | 0", "supergroulxOct 23 at 9:03 AM\nExtraordinary\n\nThis game is a tremendous amount of fun and since I purchased it over a year ago it is still tremendously enjoyable\n\nThe game plan is simple and intuitive and it has a deadly retro arcade vibe. This game is amazing for all ages\n\nHelpful | 0", "NPASQOct 2 at 6:23 PM\nExciting, Fun, Dynamic\n\nA great arcade style first person shooter game. Think Galaga in VR on steroids.\n\nSuper dynamic with power ups, slow mo when bullets are about to hit you (affording you the time to make some sick matrix moves to dodge the bullets), and seemingly endless levels.\n\nHighly recommend this one. I absolutely playing it and challenging my friends to beat my high score.\n\nHelpful | 3", "gboy006Nov 26 at 9:25 PM\nGood theme\n\nI love space I love pirates so it is great for me\n\nHelpful | 0", "beardedavguyNov 18 at 7:10 AM\nAwesome\n\nThis was one of the first games I started playing, and I still find myself going back to it.\n\nHelpful | 0", "luolin61Oct 15 at 7:53 AM\nEnjoyable\n\nI like this app. Its old school. Havent been through all the setting yet, but the two I have used are a lot of fun. This game is a quick game to learn, but will take some time to figure out the best strategy to achieved upper wave levels.\n\nHelpful | 1", "Shadow4601Oct 27 at 2:14 AM\nBest shooter game\n\nThis game was highly recommended by every single vr headset owner, and honestly it has not let me down. It starts with easy waves and makes it way to almost impossible but extremely fun to play.\n\nHelpful | 0", "scordcoolNov 15 at 2:55 PM\nSo much fun!\n\nI love playing this game! In fact, everyone in my house just take turns to play it! So many levels.\n\nHelpful | 0", "samnedaNov 27 at 2:46 PM\nGreat\n\nGood well worth the money\n\nHelpful | 1", "ibjimNov 14 at 12:23 PM\nTop games\n\nThis is a well written, captivating game, if you enjoy shooting and dodging alien spacecraft in 3-D\n\nHelpful | 0", "AsicfooSep 23, 2019 at 3:15 AM\nIve never written a review before, but.\n\nThis game is so amazing and fun I just had to spread the word. I first bough this on my\nVive and loved it. Loved it more when I made my Vive wireless, and love it the most on my Quest. I have a big setup for VR / Vive in my basement, but sometimes I just want to put it on and play quickly. I end up using my Quest much more than my Vive. Yes, if you stop and compare pixels the Vive looks a little better across the board, but I assure you during the game you wont notice. If I dropped you into one or the other mid-game and you had to pick based on movements and graphics youd never figure out which was which.\nAlso, in developer mode I increased the graphics settings on the quest so it looks better than the Vive, and at my current settings I see no change in response, so theres that, too.\nThis game has almost no story. Its just raw fun. A gun/shield/sword? In both hands, you pick the selection/configuration. Dodge lasers or use a handheld shield. Kill all the enemies before they kill you. Try the demo, you will be hooked. Other games come and go, but I always go back to this one, my all time favorite.\n\nHelpful | 6", "Leg0xyzDec 1 at 8:37 PM\nMUST HAVE!!!!\n\nSOLID GAME!!!!\n\nHelpful | 0", "anhaagNov 29 at 3:37 PM\nPretty fun\n\nTheres not really a story line to it, but it definitely gets you up and moving - and gets your heart racing! Im not usually a fan of shooter type games, but this one is super fun\n\nHelpful | 0", "jackjoneslabDec 22 at 4:49 PM\nMy kids love it\n\nFor some reason, I thought it was just ok, but my kids LOVE it, so 4 stars\n\nHelpful | 0", "LungssNov 24 at 2:45 PM\nGreat Game!\n\nIts a great game with plenty of replay ability.\n\nHelpful | 0", "andrej.fokin.92Dec 27 at 3:41 AM\nExpected more\n\nNot really much difference between the full game and the demo. It lacks content and is only a wave by wave shooter... its fun for some time, but not for long.\n\nHelpful | 0", "igorttomicNov 6 at 10:14 AM\nIt is a fun shooting game\n\nA fun game that you can play when you feel like shooting and don't have much time available. Good one to show friends who are new to VR.\n\nHelpful | 0", "EDENARCADEDec 1 at 9:23 AM\nPerfect\n\nInteractive\n\nHelpful | 0", "goodbyeDeskSep 24, 2019 at 11:53 AM\nA Real Joy to Play & to Demo the Quest\n\nIt's already been said, but stupidly fun to play. This game is even better if you have a large play area. Particularly great game to introduce people to Quest too. I stopped putting people through first steps and do this instead because its so simple its intuitive. Then as people get comfy you introduce new aspects and they love it.\n- It's great to play\n- It looks great\n- It sounds great\n- It's a great value overall\n\nHelpful | 5", "ZRealestDec 9 at 5:47 PM\n\nA pretty fun game but it, for some reason, couldn't handle the final boss fight and crashed on me when I was on the last stage. It also messed up my speakers when it crashed. They still work but certain sounds make a crackling noise now. Not happy about that.\n\nHelpful | 1\nDeveloper ResponseDec 27 at 1:33 AM\n\nWe have pushed an update that resolves this issue, if you have any problems with Space Pirate Trainer again please let us know via email support@i-illusions.com", "MagicCreationDec 8 at 7:22 PM\nReally fun and hard!\n\nSo far I can make it to round 28 with the health regen mode.I hope there are more updates to this game because it is quite enjoyable.\n\nHelpful | 0", "2Murlocs1FishNov 26 at 7:14 PM\n\nAmazingly fun game!\n\nHelpful | 0", "Static_JabNov 3 at 9:31 AM\nAmazing game\n\nThis game is awesome! That said I do wish there was a lil more substance. Maybe a story or different game modes.\n\nHelpful | 2", "ThescottishguySep 28, 2019 at 3:30 PM\nAwesome and replayable\n\nIf you like arcade shoot em ups this is the game for you. There is a wide variety of weapon types so you can really find a style that works for you. Do you want to be a dual wielding john woo style sharpshooter that ducks and dives around incoming shots like youre in the matrix? Or do you play like a live mortar launcher and duck behind a shield and lob grenades? Tons of fun any way you slice it.\n\nHelpful | 1", "SwiftDaGreatNov 25 at 3:54 PM\nNothing bad to say\n\nGreat experience\n\nHelpful | 0", "sword64Oct 14 at 5:14 PM\nAmazeing and a real challenge\n\nI love this game sooooo much because of its extreme difficulty. There is a easier game mode but that is still hard. The mechanics in this game are superb and the physics for the rapid fire gun are realistic. 5 stars\n\nHelpful | 1", "LiterallyGod_Nov 1 at 5:16 PM\nWoah\n\nThis thing was t r a n c e n d a n t. Ive never played anything like it before. It was really amazing. Really. Amazing.\n\nHelpful | 1", "2potatoman2Nov 21 at 8:31 PM\nSpace Pirates\n\nThe app is amazing still could add more weapons but over all the game is great a few bugs hear and there but I liked it and sometimes the bugs would make me laugh so great game \n\nHelpful | 0", "Morgan327Nov 3 at 2:33 PM\nReally fun but...\n\nIm just gonna say I love this game, but its lacking some stuff I think would really improve the game. I wish there was more customization like a sandbox mode where you can make custom waves. Also the tracking of pulling stuff behind your back isnt really that good.\n\nHelpful | 1", "mecalkanAug 28, 2019 at 7:45 PM\nAmazing!\n\nHonestly, I was not even going to buy this thinking I didn't need an arcade type game for VR. But then I bought because of good reviews and wanted something shooty. This game is very near perfect! One of the best arcade experiences and something you can only have in VR due to how refined it all feels around the headset and the controller. I just applaud the devs in their effort to make the game feel the best it could! Honestly, I just wish every game felt this spot on! I am having so much fun! The OST is pretty great too, wish here were more tracks. All in all, I cannot recommend this enough. Be cautioned though, I think this is a better experience standing and fully getting into it physically.\n\nHelpful | 4", "jake_poffNov 5 at 4:12 PM\nAmazing.\n\nOne of my first quest games and one of all time favorite games. Absolutely amazing in every way\n\nHelpful | 1", "VAMPTEKSep 27, 2019 at 3:50 PM\nBooom! Just like that!\n\nI found myself engaged at every second. Once I got the hang of the different guns I can use it was even better. Getting the hang of it was not hard at all. I had my father in law try it as his first gaming experience on VR and he would not put it down. He is not even into gaming. Oculus Quest reminds me when I purchased my first iPhone... life changing!\n\nHelpful | 0", "AviboyDec 3 at 4:13 AM\nGame stuck in Update\n\nJust recently on start, the game displays an update notification, but no update happens.\n\nSUPPORT please help?\n\nHelpful | 2", "CecilFamilyVROct 15 at 3:26 PM\n1st Purchase. Favorite Purchase.\n\nThere is a reason why it has a 97% positive rating. Its everything you wanted the Arcade to be 25 years ago. Simply fun and you work up a great sweat. The larger the play area, the better.\n\nHelpful | 2", "Schiller107Nov 9 at 8:02 PM\nReally fun!!\n\nI was surprised how much I loved this game !super fun and a great workout\n\nHelpful | 1", "DarkestRivalOct 23 at 6:15 AM\nOne bitter the rest is sweet\n\nLet me start by saying this game is fun. It is one of the most enjoyable experiences I have have in my entire time of VR. That being said I would like some kind of unlockable system. There are very few unlockables in the game making progression seem somewhat pointless. All the levels are set giving you a good chance to strategize and hone your skills wave after wave. All and all it's a great game and I would recommend\n\nHelpful | 3", "LegibleformulaDec 18 at 7:42 AM\nIt was good\n\nA lot of fun but not that many modes or gun types\n\nHelpful | 0", "MalteseDadOct 4 at 3:06 AM\nOne of the most engaging games on Quest\n\nA great 3D space arcade game that is fun and well suited to play when I have 5 to 10 minutes to spare. Addictive and engaging and in a strange way relaxing to kill a few baddies every day. Some of the best spent money on the Quest store.\n\nHelpful | 2", "XHalconNov 10 at 9:34 PM\nPlayed This At A Microsoft Store\n\nI first played this at a Microsoft store and fell in love with it.\n\nWhen I turned on my Oculus Quest I was glad to see they had it. This is a very simple shooting game that is a must have.\n\nIt could certainly be a classic.\n\nHelpful | 1", "IronSight44Sep 30, 2019 at 4:11 PM\nGotta love the simple things\n\nBasically Space Invaders VR. Amazing. Great game for room scale on the Quest. It would be even more addicting if I were good at it, but other than that, an incredible purchase at such a fair price. Looks great on the Quest too. Thanks to the developers!\n\nHelpful | 2", "DRexxisDec 20 at 10:50 PM\nCrash\n\nFor some reason when I get to the last level in in explorer mode. The game crashes out. I can't even finish level 35 without the game failing\n\nHelpful | 0\nDeveloper ResponseDec 21 at 12:31 AM\n\nhi there, we pushed an update this week to fix this issue. Make sure you have updated the game and are on version 1.54. (visible in the new version above the SPT logo). If you still experience problems, contact us at support@i-illusions.com", "DerpestRainbowOct 12 at 9:40 AM\nVery Fun! But very repetitive...\n\nI bought this game, expecting it to have a story, variety of gameplay, and more! But I was shocked how repetitive it was. Not even a story! Dont get me wrong, the game is fun, but very repetitive... Very. Be ready for a fun, immersive, but repetitive experience. 3 stars.\n\nHelpful | 7", "LamboTech11Mar 15 at 8:36 AM\n\nSuper fun game although there is no campaign. Other than that this game is worth every dollar.\n\nHelpful | 0", "jraff520Nov 8 at 8:06 AM\nGREAT GAME\n\nNice gameplay, good game to introduce new people to the world of VR.\n\nHelpful | 0", "magicmonster991Oct 25 at 3:42 PM\nAMAZING\n\nThis game is my favorite game of all the games I have ever played. It is so fun dodging the bullets and switching your weapon it is great.\n\nHelpful | 0", "shane.witt.96Nov 4 at 4:57 AM\nI thought it would be bad\n\nIt was one of the best games. I have played in a long time I recomend this game so much\n\nHelpful | 0", "Zackery129Mar 15 at 12:01 AM\nReminds me of a classic\n\nI Love this game. It's great. It does get a little repetitive but hey its def worth 14$\n\nHelpful | 0", "glenn.ratcliffe.961Aug 7, 2019 at 2:22 PM\n10/10\n\nAbsolutely the best game I've bought /played on my Quest.\nBest played with a large guardian, but workable with a small guardian. 4 different game style's to play, all are cool. Wave after wave of fun, that gets me sweating.\nGuess only one thing is on my mind: If this is 'Space Pirate Trainer \".... When dose' Space Pirates come out?\n\nHelpful | 23", "Roxtar73Sep 21, 2019 at 10:41 PM\nIt is what the demo is but more of it\n\nIf youve played the demo then you experienced everything this game has to offer on a small scale. The full game has several different modes each with their own thing. But you will be standing on the deck shooting robots just like the demo. Thats not a bad thing this game is fun and a blast(pun intended) to play. I would recommend it if youve ever wanted to play space invaders in VR.\n\nHelpful | 0", "RhylorOct 2 at 2:29 PM\nGreat game but...\n\nI would give 5 stars but I could not find where to activate muliplayer. This was the only raisin I got a VR headset and now I'm depressed and lonly because I can't find where to make friend in this virtual world. In the end we are all just in one big simulation. Over all great game. Would buy and play again. :)\n\nHelpful | 11", "CapemanNov 2 at 4:22 PM\nSuper fun!\n\nGreat game play and awesome music. Easy to lose yourself in the game. Highly recommend.\n\nHelpful | 0", "HywelBrombyDec 27 at 12:57 AM\nKeeps asking for system update\n\nWorked fine for a bit, now will not start, stating it needs a system upgrade... there is no upgrade ???? Help please\n\nHelpful | 0\nDeveloper ResponseJan 2 at 2:56 PM\n\nThere is an Oculus firmware update preventing Space Pirate Trainer from starting on your Oculus Quest. Can you make sure your Quest is connected to WiFi, restart the headset and then go to: Settings -> See All -> About -> Software update. There should be a button saying \"update available\". Click on this, and then restart the Quest. If the issue persists can you email us at support@i-illusions.com? Any update?", "K1_J0hnD03Nov 7 at 10:12 AM\nExercise with fun\n\nIt's a nice scenario to play without cables. I love it.\n\nHelpful | 0", "heyapple1998Dec 29 at 7:06 PM\nNot too bad\n\nI'd expect more movement for the price tbh but that's just my opinion.\n\nHelpful | 0", "crimsonbutterflyNov 5 at 6:30 AM\nPretty exciting shooting game\n\nThe mechanics and visuals are pretty good. It is very nice to play when you feel like shooting things out of the sky. I wish there are more gun options and more use is made of the freedom of movement and 360 range of the Quest.\n\nHelpful | 0", "ummwhatsureOct 3 at 10:17 AM\nReally great first experience.\n\nReally fun and looks great. If you want to show a friend how good a VR game could be this is the one. Controls are fun and easy to learn and the graphics are great. I always come back to this after playing a new game.\n\nHelpful | 1", "RogueOne007Nov 13 at 11:32 PM\n\nExcellent!\n\nHelpful | 0", "TheAtomicStoneSep 9, 2019 at 8:22 PM\nOH.EM.GEE!!!!\n\nLet me be honest, Im 52 but Ive been a gamer since the original Commodore 64. I lost the plot somewhere in my late 30s. When my son was old enough, we started playing LEGO video games, and a few non-bloody shooters, but the magic was gone, or at least that is what I thought. I downloaded this gem and from the first wave THE MAGIC IS BACK BABY!!! The weapons, the shields, the powerups, all reminiscent of the arcade games of my youth, but now I am INSIDE the game! Incredible!!!\n\nHelpful | 4", "lillostvdosOct 1 at 3:49 PM\nDidnt expect this\n\nThis game really made me duck and scream as I battle my way through each wave. I showed my dad this who, when he was little, owned an Atari and would play space invaders all the time. He absolutely loved it and so did I\n\nHelpful | 1", "Shelprock3000Mar 19 at 4:01 PM\n\nThis is a fun game. Definitely worth it.\n\nHelpful | 1", "rachel.lau.56863Dec 21 at 8:37 PM\nToo little story\n\nI expected more of a story line and less repetitiveness and I cant do a refund because dont know how. Please Help\n\nHelpful | 0\nDeveloper ResponseDec 21 at 11:17 PM\n\nRequesting a Refund: Open the Oculus companion app on your phone.Tap Settings from the bottom menu.Tap Purchase History under Payment.Tap on the content you want to request a refund for, then tap Request Refund.Follow the on-screen instructions to request your refund.", "jwilsonfamilyOct 29 at 4:20 PM\nReally good fun\n\nBought this after reading the reviews and was not disappointed. Great value for money.\n\nHelpful | 0", "DwhiteGuyOct 27 at 2:18 PM\nGreat game\n\nI dont what kind of space pirate fights off a robot hoard, but Im digging it.\n\nHelpful | 1", "SpicyStinkerDec 26 at 12:34 PM\nHow do I refund it?\n\nI liked the game for a little but it wasnt liken it to much. I deleted it, is that how you refund it?\n\nHelpful | 1\nDeveloper ResponseDec 26 at 1:18 PM\n\nFeel free to ask for a refund: Open the Oculus companion app on your phone. Tap Settings from the bottom menu. Tap Purchase History under Payment. Tap on the content you want to request a refund for, then tap Request Refund. Follow the on-screen instructions to request your refund.", "Mamapossumof3Oct 6 at 12:34 PM\nLove it\n\nI bought the Oculus for pain relief as my pain management dr uses the go. This game totally emerges me in the virtual reality and makes me stretch and move. Love how realistic it is! A must have!\n\nHelpful | 0", "Kiel.pepitoSep 28, 2019 at 2:12 PM\n\nThis is really an amazing experience for those who are new on vr. This is a must if you're into guns and shooting.the only thing that i wish tho they shoul've included multiplayer where you can partner up with someone and have fun\n\nHelpful | 0", "seong-won_hwangOct 14 at 2:00 PM\nI like this but\n\nI like this game very much, but the frozen background needs to be upgraded, and if I upgrade the graphics once again, the downloads will increase.\n\nHelpful | 0", "suebettyboopNov 7 at 10:57 AM\nSpace trainer\n\nAbsolutely love this game\n\nHelpful | 0", "COOPERDUDESSep 2, 2019 at 12:32 AM\nOne of the greatest at the moment\n\nFor anyone who likes space, guns, robots and Sci fi as a general, you will enjoy this. It's so fun to tear apart the drones using anything from a laser baton to a grenade launcher to a giant tesla cannon! Graphics are good, no tracking issues so far and the framer ate rarely suffers even with multiple drones flying around the screen.\n10/10\n\nHelpful | 5", "fmplayzSep 12, 2019 at 4:52 PM\nAwesomeness\n\nSpace Pirate trainer is the perfect game to either experience what VR is capable of or introduce friends and family to VR and wow them\n\nIts seems minimalist but its simplicity is its best quality\nI recommend it to everyone who likes shooters and who ever dreamed of being Han solo Boba Fett or Samus it will hook you for hours trying to best your or others high scores.\n\nIn my top ten quest games hands down\n\nHelpful | 0", "parzivalOct 24 at 3:32 PM\nAmazing\n\nSuch a great game! And amazing how close they were able to replicate the PCVR counterpart\n\nHelpful | 0", "gearsofwar5Nov 5 at 11:59 AM\n\nVery very good game\n\nHelpful | 1", "wo0shNov 7 at 11:05 PM\nBlack pixels while playing Space Pirate\n\nI bought this game and I really like it! But I have issues with black pixels imitating one shield while playing Space Pirate. Sometimes I see those pixels while playing and sometimes when I start your game. If I quit and start Space Pirate then those black pixels don't disappear. I have seen them for two-four times now. Black pixels disappear only when I reboot my oculus quest. With other games, I don't have this issue. Thanks!\n\nHelpful | 1", "sean.boguniaNov 3 at 1:22 AM\nReally fun\n\nA very fun game at a reasonable price\n\nHelpful | 0", "BallestrinqueDec 5 at 6:54 AM\nGreat game\n\nGames like this one gaves Virtual Reality make sense.\n\nHelpful | 2", "kalindejanDec 9 at 9:32 AM\nNice\n\nBut became boring soon\n\nHelpful | 0", "dramzyDec 6 at 6:56 PM\n\nGreat game but could use more content\n\nHelpful | 0", "GeraldlOct 14 at 6:50 AM\nFun Fun Fun\n\nLove this game. To me this is what VR gaming is all about. Shoot alien spacecraft and get a good workout at the same time. Perfect\n\nHelpful | 0", "tanner.mcenteeOct 26 at 9:18 AM\nGreat Game\n\nLove it, first thing I show to everyone. Great controls and immersion.\n\nHelpful | 0", "tzoldOct 7 at 6:26 PM\nAdequately Perfect\n\nIts a game that you can always jump in from time to time and have a blast. If youre expecting a long story driven play through look elsewhere. I wish there were more modes that made a bigger difference in the gameplay.Everything up until level 20 is pretty doable but then after that it is freakishly hard to dodge every bullet coming at you if youre in a small playing space. I got to level 30 but I had to find an area that was much larger so I could basically just keep moving to avoid all the incoming missiles and lasers. To say I did not enjoy it would be a fabrication of the truth.I just want some more option to progress without having a 50 x 50 play space. Overall it is a very fun game that anyone can jump into you and gain some satisfaction.\n\nHelpful | 3", "ScytheLuciferMar 18 at 6:31 AM\nGreat game, graphics are ok\n\nMust play\n\nHelpful | 0", "simon.milne2Oct 14 at 6:59 PM\nSimple and fun\n\nA great little arcade style game where you simply shoot waves of enemies. Simple to learn but mastery takes time.\n\nHelpful | 1", "zeroideOct 7 at 9:59 AM\n\nWhat a great game. My grandson aged 9 thinks it's fantastic, have to limit his time on the game as he would probably spend all day on it. Well worth the money.\n\nHelpful | 0", "gregory.haleyNov 9 at 12:11 PM\nGreat intro to vr\n\nLove seeing the interactivity possible with this game. I was hoping to be able to utilize the space even more- probably just the greedy in me. In time I am sure\n\nHelpful | 0", "MondsuchtOct 8 at 8:47 PM\nAwesome!\n\nThis is a real good arcade shooter. Graphics are good and the shooting feels very satisfying. Perfect to demo the quest in my opinion. Would buy again.\n\nHelpful | 0", "1ThoughtCriminalOct 27 at 7:37 PM\nOld meets New\n\nClassic arcade shooter action now so real you feel it.\n\nHelpful | 0", "BallerDerekDec 27 at 10:45 PM\nFun for less than an hour\n\nWon't play it after a couple days, waste of money\n\nHelpful | 1\nDeveloper ResponseDec 28 at 9:10 AM\n\nIf it's not your cup of tea, you can apply for a refund.", "blackhawk1081Oct 22 at 10:11 PM\nGood buy!\n\nGreat game lots of fun gets challenging as it progresses lots of replay value!\n\nHelpful | 0", "prestonator2005Nov 17 at 4:45 PM\nWas amazing but...\n\nI loved the game but one day the game just would not work correctly. When I start the game it is good but then when a black square thing is making were I cant see the flying robots. I cant injoy the game. Devs pls fix!\n\nHelpful | 0", "Gameblast3rOct 25 at 7:08 PM\nArcade\n\nPerfect example of what your first arcade experience was x100.\n\nHelpful | 0", "FeelThorsWrathOct 13 at 4:28 PM\nAwesome!!\n\nHours of fun for the entire family, classic arcade shooter in VR! Keep going back to the game every time I use the Quest!\n\nHelpful | 0", "Grave367Oct 5 at 3:03 PM\nFantastic!\n\nOne of the best, fantastic port to the quest, and one of the best experiences for a new user.\n\nThere's really no downside to getting this game, it's fantastic.\n\nHelpful | 0", "stevenhslvDec 1 at 2:37 AM\nNeed to allow for more movement\n\nAn even larger play area would be great.\n\nHelpful | 0", "Supervisor_DaleOct 5 at 7:08 AM\nGreat game like always\n\nThe port over of the game is fantastic its the same action and fun you got from the original. It runs well and now you can move like you've never moved before\n\nHelpful | 0", "yidanis.beltranOct 4 at 7:28 PM\nLove it\n\nI never expected this game to be so amazing. I love it!!!! The game really relieves a lot of stress and at the same time it's fun for the whole family.\n\nHelpful | 1", "williparrishOct 28 at 12:26 PM\n\nMy intro to vr and i think it is amazing\n\nHelpful | 0", "p.j.santryOct 3 at 12:23 AM\nAwesome game!!\n\nVery addicting! Would like to see new or easier unlockables though! Well worth the money, all my friends end up playing this for hours on end.\n\nHelpful | 2", "BiggieChonkNov 11 at 5:34 PM\n\nI love the game I just wish it had some more variety in game modes but I would still recommend to anyone who is just getting into vr\n\nHelpful | 0", "VoidChronosOct 24 at 12:33 AM\nA generic and bland arcade shooter\n\nI've picked up this game due to rave recommendations all over the internet, and mostly was disappointed. It is a generic space shooter, that rarely excites or provide \"cool\" feeling\n\nHelpful | 4", "mayhem117Oct 8 at 8:24 AM\n\nI absolutely love this game. There's a great selection of weapons. Lots of action. Time slowes so you can Dodge bullets. It's awesome.\n\nHelpful | 0", "NirzOct 16 at 2:09 PM\nGreat!\n\nFantastic introduction to be gaming. Quick and easy setup and a variety of weapon to explore.\n\nHelpful | 0", "HciprolaOct 31 at 12:23 PM\nA blast\n\nThis is crazy fun\n\nHelpful | 0", "merrickmacMar 28 at 7:57 AM\nIts definitely below average\n\nMost people arent gonna like me saying this but I didnt like it at all personally\n\nHelpful | 0\nDeveloper ResponseMar 30 at 1:14 AM\n\nSorry to hear Space Pirate Trainer wasn't the game for you. You can request a refund by following these steps https://support.oculus.com/275553640003957/", "JonesyRedOct 16 at 2:28 PM\nSuper fun game\n\nTotally hooked on this game. Great gameplay and graphics. Definitely recommend\n\nHelpful | 0", "slopylopOct 29 at 2:08 PM\nYes\n\nIt is awesome\n\nHelpful | 0", "FygarMay 21, 2019 at 3:44 PM\nExcellent Arcade Action\n\nPleasantly surprised with how solid this game is. I haven't played it on PCVR to compare graphics or anything, but the tracking is spot on and it's run at a consistent FPS and quality even when the screen is littered with flying baddies. It's not going to be everyone's cup of tea, but as a huge fan of arcade style shooting experiences, this is one of my favorite launch titles yet. Dodging bullets and spamming lasers to climb the leaderboards is just too addicting. The only thing I'll note is that the game doesn't take much advantage of the 360 wireless capabilities of the Quest--nothing comes from behind you, at least as far as I've played. But, the room scale 6dof elements feel great, and I found myself actually leaping out of the way to dodge rains of bullets.\n\nHelpful | 169", "ConmotodeveloperOct 17 at 6:50 PM\nMy Favorite Game\n\nThis game alone makes the Quest worthwhile. Its great fun.\n\nHelpful | 0", "dfnkliveOct 26 at 7:55 PM\nAwesome Fun\n\nAwesome Fun!!!\n\nHelpful | 0", "smudge710Mar 26 at 6:53 PM\nJoke\n\nPlayed demo, downloaded game and it was pixelated in front of my face\n\nHelpful | 0\nDeveloper ResponseMar 27 at 12:16 AM\n\nHi Smudge710 - a handful of players have had this issue on the very first play. Restarting your Quest by holding down the power button for 2 seconds and pushing 'Restart' will resolve it. Contact us at support@i-illusions.com if you're still having issues.", "leo_haunzOct 26 at 3:09 PM\n\nAmazing game\n\nHelpful | 0", "Hank_47Sep 8, 2019 at 5:43 AM\nJust buy this game right now\n\nBased off reviews, I recently purchased this game. Along with beatsaber, it is my first vr game and I was blown away. While the complexity isnt very high(which makes it a good game to show others who are new to vr) it is still fun and incredibly addicting. Switching between the different weapons types was fun, and the shield/brawler was also awesome. Each weapon had a use for different types of waves, i.e. ion grenades for lots of small baddies, shotworks for bosses. All in all, it is a great game, and one you should definitely purchase\n\nUpdate:there is a glitch where if you were using brawlers, you can get a droid stuck behind the big building behind you. I have only experienced this a couple times but it is really annoying as there is no way to kill it. Its just stuck behind there(I can see it on the map) and I can hear it shooting but the bullets never reach me. No matter what you use (your guns, the homing missile powerup, the friendly droid powerup, its impossible to reach. Thats really annoying since I have to reset that round. as I said, it happens very rarely so its not much of a problem, but it is still frustrating. Im on mobile so sorry about the spelling\n\nHelpful | 5", "causticjusticeOct 25 at 5:00 PM\n\nFantastic game\n\nHelpful | 0", "Cpt.LionnOct 26 at 11:26 AM\nGood\n\nGood\n\nHelpful | 0", "xxxjamesxxxOct 22 at 5:07 AM\nVery good game\n\nI was extremely pleased\n\nHelpful | 0", "glabadorDec 17 at 10:23 AM\n\nMust have\n\nHelpful | 1", "FlyingScotsman93Oct 5 at 7:47 PM\nThe best game Ive played\n\nThe graphics are awesome and it is just so satisfying hitting those snipes. Really well made for the quest.\n\nHelpful | 0", "WineSteinSep 25, 2019 at 12:10 AM\nStraightforward, Arcade Shooting Fun\n\nI absolutely love this game. In fact, it was the first Quest game I purchased. The action is fun, waves dont get too repetitive, and the mechanics are a blast (pun intended).\n\nMy 4 stars is due to the unlocks system and lack of diversity in levels. Ive been playing for a while and Ive made it to high round and high points, but I never seem to unlock anything. It doesnt even say whats required to unlock stuff. While the map is fun, it would be nice to have a couple more locations...\n\nOverall, I cant complain too much. I really love this game!! Just get ready to sweat and Olay as Neo!!\n\nHelpful | 2", "mogly.speixNov 28 at 11:50 AM\n\ngood but work more often without surprise and fun too old arcade game here it's new VR here wiz the Quest\n\nHelpful | 0", "DrumbriOct 11 at 12:50 PM\nLove this game!\n\nAwesome graphics fun fun fun gameplay.\nNeeds a multiplayer mode!\n\nHelpful | 0", "Digital_godOct 12 at 10:12 AM\nAwesome replayability\n\nI keep coming back to this game to try beat my high scores.\n\nHelpful | 0", "sohmerOct 12 at 9:52 AM\nJesus\n\nWhat I always wanted gaming to become. Amazing.\n\nHelpful | 0", "iBrutiiNov 17 at 3:32 AM\nGreat game\n\nPerfect game for a quick shooter.\n\nHelpful | 0", "robertcaliforniaOct 9 at 2:42 PM\nThe future of gaming\n\nWhat an amazing experience. Soooo fun. Loads of replay here.\n\nHelpful | 0", "ism1Jul 14, 2019 at 11:42 AM\nAbsolute must have\n\nI didnt buy this game initially because I thought Id get bored of it in 5 minutes. Ive perhaps never been more wrong. Among the most fun time Ive ever had playing a video game. Thats a statement. I dont know how much time passed while I played, but it went from light to dark outside.\n\nHelpful | 6", "CobraStrike_Oct 13 at 9:40 AM\nAwesome game!\n\nPeople hate on this game far too much! I love playing this game! Especially if i have a good amount of space to maneuver and dodge. I even got both my parents to play and they both loved it!!\n\nHelpful | 1", "meyouusOct 4 at 12:48 PM\n\nCor blimey I was flabagasted at what I was experiencing! It's the dogs dangles!\n\nHelpful | 0", "chipp624Oct 12 at 1:41 PM\nAmazing game\n\nGame is out standing and fun for hours\n\nHelpful | 0", "Estevan-SemoOct 4 at 11:22 AM\nBest game I ever play\n\nBest game what VR must make\nKeep going big like for you\n\nHelpful | 1", "12vdcOct 4 at 5:12 AM\n12VDC\n\nspace invaders on steroids but needs to be multiplayer\n\nHelpful | 1", "Jad.btwOct 5 at 1:36 PM\nSpace pirate trainer\n\nThis game is so much fun to play!I definitely recommend it.\n\nHelpful | 0", "PurplemikeyMay 21, 2019 at 3:52 PM\nI was not prepared\n\nI bought this game for no reasons... Based off recommendations. Never thought it would be my kind...\nBut to be honest it's one of my favorite and I just can't wait to get back in. It is so satisfying and you really feel great playing this game. Dodging bullets, pulling your shield off your back, ... It's just so great!\n\nGrab it! You won't regret it!\n\nHelpful | 641", "nikolai.volkoffSep 27, 2019 at 8:13 AM\nI own this game on Quest and PC.\n\nIts better on Quest! Wireless makes this game absolutely amazing, enough said. Buy it now!\n\nHelpful | 0", "gunn31Oct 3 at 1:12 AM\nBest game for spacious space playing\n\nBe carefull; you might end up rolling on ground.....\n\nHelpful | 1", "jeremymbrockSep 29, 2019 at 11:07 AM\nSpace trainer\n\nAmazing..1st played it at rental location.. now proud to call it my own\n\nHelpful | 1", "geothegeckoNov 27 at 8:20 PM\n8(&4$3!$:!8::$)/)&8!\n\nI updated my oculus and it STILL wants an update \n\nHelpful | 0\nDeveloper ResponseDec 7 at 5:44 AM\n\nSince we're using a new version of the Oculus SDK, it needs a system update. Can you restart the headset and go to: Settings -> See All -> About -> Software update right section - install if available. If the issue persists can you email us at support@i-illusions.com?", "mlclm.hallSep 30 at 9:27 PM\nSo good!\n\nSo good. Only sadness is that I'm not good enough to see the later bosses.\n\nHelpful | 0", "stelliohAug 17, 2019 at 9:05 AM\n\nDon't get me wrong, the game is super good, it's fun, it's challenging. There's just one huge problem that made me take away 2 stars. The controller batter consopution. The game uses the rumble feature so excessively that your batteries will run out of juice easily around 30 minutes of gameplay at full charge. Of course rechargable batteries exist but even then I don't want to be charging them almost daily. Please fix if possible.\n\nHelpful | 12", "MathholeSep 21, 2019 at 7:05 PM\nStill my favorite showcase\n\nI've been demoing VR to people since 2015, and Space Pirate Trainer has been my go-to demo app since it released to devs in February 2016. Now it's my go-to demo app on the Quest (after my own app of course :-P). I love it and everyone I show it to loves it too!\n\nHelpful | 0", "NikorasuAug 16, 2019 at 6:03 PM\nA perfect arcade style shooter!\n\nEdit: Having some audio issues, but i let the dev know.\n\nThis is one of my favorite VR games. It's perfect for showing VR to friends, and a great game to come back to for high-scoring!\nIt's one of my fav time wasters when I'm bored, and have time to shoot for a high score! lol\n\nThe music is a lot of fun and the gun sound effects are really satisfying and usually play well with the music. Tho at the moment I'm having issues with Quest's audio balance between the two, for some reason.\n\nHelpful | 0\nDeveloper ResponseAug 16, 2019 at 12:21 AM\n\nCan you restart your Quest and make sure the volume is turned up? The volume switches are on the bottom right hand side of the Quest.", "UnkemptHorizonSep 26, 2019 at 9:05 PM\nAmazing\n\nI didnt have a single problem while playing this game, this game is worth your money\n\nHelpful | 0", "pacomesAug 25, 2019 at 8:09 AM\nBest VR game\n\nI bought an HTC vive on the release day and the best game was Space Pirate. Now i just got an Oculus quest and the best game is : Space Pirate!!! But it get so much better without any cable. Full immersion.\n\nHelpful | 4", "HadesXISep 8, 2019 at 7:10 AM\nBeautiful game, but have 2 complaints.\n\nThis is a very fun arcade game, I found myself playing this for about 3 hours straight and the only 2 complaints I have are, 1: you only play on one map, and 2: I would like to play without having to pause so frequent to tell me the wave Im in. Other than that, I cannot recall if there is a different sound track you can play rather than the default. Regardless, overall this game is great and worth buying I enjoy the power ups and assists you can get and how creative you can get to destroy the enemies. It would be very nice if the creators added another map and different skin options for the guns\n\nHelpful | 4", "Emilian1978Aug 1, 2019 at 2:59 AM\nVery good game\n\nI love your title and for 3-4 days it was the only game I played on my Quest.\n\nI was hoping for a game like the retro Galaxian - this mod would be a BLAST !!! Anyway, even if I was expecting something else, I'm happy with my purchase.\n\nThen I started to get bored because everything keeps repeating. I don't have a large room to play your game so it's impossible to dodge the enemies on higher levels. Once I did a high score, I wasn't motivated to play it anymore, since everything identically repeats: number of opponents each stage, their direction, their strength, etc.\n\nYou should make the order of the enemies random. Some of the weapons are badly designed, specially the weapon that shoots once to destroy an enemy, so I don't feel stimulated to achieve higher scores with all the weapons.\n\nAnyway, the game is very good and it's a must buy for any older gamer :)\n\nYou should create a space sim shooter btw. Thank you !\n\nHelpful | 5", "deppnarenJul 28, 2019 at 5:34 PM\nIAM hooked and climbing the charts\n\nthis game is a gem . I bought it after trying the trial version . I had also bought super hot vr . and the number of hours u have logged in this game is humongous compared to superhot . how is this not in the top 5 list . it's simple . sexy adaptive interface . peppy music . and it had a 270 degree attack . yes attacks come from behind . someone said it's only from the front . no . it's amazing . in one of the stages I had to jump over the Lazer beam . excellent workout . in a day I have managed to get to 40 k with 2 hours if game play . addictive and immersive . superb job by the team . I love the 4 modes and the weapon selection . a feature I would suggest in update is I should be able to ride my support vehicle at least in the near vicinity . like a wildcard . flying it in VR and providing air support will be super awesome . thanks guys\n\nHelpful | 7", "JOCA-VROct 21 at 12:05 PM\nVery Nice Port\n\nyou will have the same awsome experience as you had on PC,\neven better considering the freedom of mobility with Quest!\n\nHelpful | 1", "sirchildsOct 8 at 2:10 AM\n\nLove it\n\nHelpful | 0", "heather7117Oct 7 at 10:50 AM\nFun\n\nTons of fun!\n\nHelpful | 0", "tworz78Oct 6 at 10:52 AM\nFirst game I bought!\n\nBest game I own!\n\nHelpful | 0", "DunspokenSep 30 at 6:50 PM\nMust have\n\nIf you just got your quest, get this app!!!\n\nHelpful | 0", "rozemarijnkSep 21, 2019 at 11:47 AM\nLove the game\n\nTotally love the game! Played it on the VR of a friend and I was sold. Next week bought my own VR so I could play this game.\nWould love if they could update the game with some more variety in modes. Different 'enemies' for example.\n\nHelpful | 2", "ChlasmaNov 5 at 10:41 PM\nBought it the seccond time\n\nHad it on psvr before and although the graphics where better its a way better game on the quest. Love it!!\nFor part two, please:\n- shared space local multiplayer\n- more boss battles\n- not all weapons available from the beginning (getting one after each other by defeating a boss which was characteristic for him- like in mega man or metroid)\n- enviroment changes\n-39.99 price tag\n\n...if this is space invaders...i CANT FREAKING WAIT FOR ESPGADLUDA!!!\n\nHelpful | 8", "jsmith72902Sep 1, 2019 at 8:26 AM\nSuggestion\n\nA friend of mine is thinking about saving up for the quest and I thought it be cool if there was a multiplayer option where you and a friend work together against waves\n\nHelpful | 1", "jaumemussons79Oct 20 at 11:36 PM\nGame is cool but too much repetitive\n\nThisbgame is overrated!!!\n\nToo expensive for that simple repetitive mechanics\n\nHelpful | 11", "Drzej3kAug 3, 2019 at 8:58 AM\nFuture Arcade Classic\n\nI have played Star Pirate Trainer on PSVR and was frustrated by the lacklustre tracking. After playing the game on the quest its great, I find it much easier to hit droids and tracking is spot on. Only downside is the visuals in PSVR have much more pop. But the game is more enjoyable on the Quest overall. Its a great game to introduce people to VR with, and even though the game is basic I find myself wanting to play it even though I have other technically better games. Its like the shooter version of Beatsabre\n\nHelpful | 2", "francustoddicusAug 5, 2019 at 9:09 AM\nExcellent!!\n\nI got this as it seemed interesting and the reviews were positive and I'm glad I did. I love this game! I think this will be a defining game for VR much like Galaga or Space Invaders was for video games in the 80's. This is so much better than a sit on the couch sort of game, it really gets your blood pumping.\n\nHelpful | 1", "stephen.hawker2Oct 1 at 3:32 PM\n\nBest game on oculus !\n\nHelpful | 0", "paddyaddySep 29, 2019 at 3:46 AM\nFun Game\n\nI enjoy this game it takes me back to the Space Invaders game, plenty of shooting with different gun choices , missiles coming at you from all angels which you can take cover with a shield .\n\nHelpful | 0", "Richie5730Sep 13, 2019 at 4:07 AM\n\nVery good very fun. Even my 52 year old dad had a go he was diving all over the place. Would recommend\n\nHelpful | 0", "timjrd86Sep 28, 2019 at 1:30 PM\n\nThis game is very addicting\n\nHelpful | 0", "Crazy_SaneSep 29, 2019 at 11:39 AM\nGet it\n\nIt's mad. Just get it.\n\nHelpful | 0", "BuddyweiserSep 23, 2019 at 9:16 PM\n\nWhat a fun arcade shooter! I must for the Quest IMO.\n\nHelpful | 0", "lucidbowl1627Sep 29, 2019 at 8:18 PM\nSPT\n\nGreat game its amazing\n\nHelpful | 0", "Big_Chungus_did_911Sep 27, 2019 at 12:09 AM\nGreasy\n\nSo greasy my asshol3 fell right out\nZuc is a robot\n\nHelpful | 0", "EnriqueMontabanSep 26, 2019 at 5:51 PM\nFeels like shooting in molassas\n\nWhen they say arcade style, think about a game with relatively slow bullets so it feels like a WWII anti-aircraft sensibility, even though the drones are dodging fast and getting right in your face. Yes, theres a choice of weapons, but generally your bullets will trail them as they dodge, and even the shotgun and grenade are frustrating. And yes theres a sword with a tractor beam and a shield. This makes the game much easier to survive. But still pretty clumsy.\nWhat I had envisioned was your bullets actually went fast and you had to shoot the drones very fast. Instead they dance around while you try to track them as they dodge. Feels more like whack-a-mole than gunslinging.\n\nHelpful | 4", "tommy.feuermanOct 8 at 1:17 PM\nNot Recomanded\n\nAfter 2 hours of playing, I got enough of it. Shooting is fun but this game offers you nothing more. No story no new levels not so many weapon choices... you will get bored very soon. Graphics are nice but overall, it is a very poor game.\n\nHelpful | 8", "Zenik77Sep 20, 2019 at 8:17 PM\nAmazing\n\nThis is an amazing game high replay value love dodging lasers.\n\nHelpful | 0", "geminimandyOct 6 at 1:46 PM\nMy favorable game so far\n\nThis game is so much fun and the a great game to showcase the freedom of movement the quest allows, a must have or any starter pack.\n\nHelpful | 1", "angel.frescasSep 26, 2019 at 10:42 PM\nGreat game\n\nLove to shoot space robots\n\nHelpful | 0", "psbAug 19, 2019 at 7:42 AM\nSuper fun\n\nFinding myself playing a round or two again and again when I want a quick game and another round of Beat Saber would just soak the Quest in sweat.\nThere would be more potential in a sometimes more exciting soundtrack.\n\nHelpful | 0", "Luggnutt612Aug 5, 2019 at 2:40 PM\nWell-executed shooter\n\nSmooth, polished experience. The gun variety is good and seems balanced. Everything about this game is pretty simple and obvious (exception: the grapple stick). Nothing too creative conceptually, which is fine...ideal, even, for VR novices. It does what you expect and does it very well.\n\nHelpful | 0", "brodytendlerSep 26, 2019 at 9:46 AM\nGreat game\n\nMy favourite game love it\n\nHelpful | 0", "morganderrickmiaAug 5, 2019 at 7:59 AM\nJust wow!\n\nThis is best game ive played yet. Ive already bought robo recall and superhot. I prefer this, because it cuts straight to he action. Its like the movie Oblivion combined with StarFox 64. I hope to see more games from this studio.\n\nHelpful | 1", "SaintTaintSep 23, 2019 at 7:20 PM\nRockin'\n\nSpace Invaders for 2019\n\nHelpful | 0", "EllouJul 22, 2019 at 1:11 AM\nGood as claimed!\n\nReally enjoyed the demo, so purchased the full game, and I'm not disappointed one bit. For sure, it's a bit repetitive as you are standing in same set (it can change a little bit when you unlock others scene variations) and shooting waves. But the different type of enemies (including some big bosses) and the many way to kill them leads to a lot of replayability.\nVery accessible for the beginners (instant fun for VR newcomers), but a lot of challenges as well if you go further in the game (final waves are pretty hard!)\n\nHelpful | 3", "jdpruittAug 31, 2019 at 9:41 PM\nGreat on rift and quest!\n\nI was blown away at how great this game is on Quest. Losing the cords made it a whole new level of fun. Absolutely love it\n\nHelpful | 1", "omrisimoSep 5, 2019 at 2:19 PM\nGreat game!!!!!!!!\n\nNothing more to add. Just buy and play, thats a game youre going to come back to.\n\nHelpful | 1", "clearrootAug 21, 2019 at 10:01 PM\nGo to game for people trying VR out\n\nThis game is my go to game for people who have never tried VR. Its simple, easy to navigate and play and the responsiveness is great. Graphics are also pretty cool too.\n\nHelpful | 0", "Ender772Jul 22, 2019 at 8:43 AM\nBest game\n\nOne of the best games on the quest. I wish it had more unlocks. Only bug is that the laser sight is still near invisible and thus almost impossible to use. And the voltrons are a bit weak and not viable late game. It needs a power upgrade or to be longer. Still 100s of hours of play and still not bored.\n\nHelpful | 2", "Witcher.IIIJul 29, 2019 at 5:25 PM\nA Killer App\n\nThis game can sell systems! I put this on for 3 friends today- two said they were going to buy a Quest and just play this game forever! It is incredible fun and the sense of 3D is so far unmatched. A great party game and solo experience! Must Buy Game.\n\nHelpful | 3", "dietzt2008Jul 25, 2019 at 8:31 PM\nAlmost as good as the PC version\n\nDevelopers did an excellent job with the graphics on the Quest. Its almost comparable in that regard to PCVR. The gameplay itself is almost identical minus some limitations of the Quest tracking system. I can no longer hold my shield up to protect my side while fighting enemies on the opposite side without losing tracking on the shield and getting hit. This is something I was able to do on my Vive with external base stations. Ultimately Ill just have to develop a new strategy to win.\n\nHelpful | 0", "iceyiceybabySep 13, 2019 at 10:29 PM\nNice\n\nShoot em up on steroids, good game 8)\n\nHelpful | 0", "Jack-SkoonOct 16 at 10:48 AM\n\nGood Game Klassik Arcade Shooter..\n\nHelpful | 0", "gideonstrangeOct 5 at 10:39 AM\n\nJust old school arcade fun. A must have for the library. Dont think, just play.\n\nHelpful | 0", "FinnyWiggenAug 13, 2019 at 6:46 PM\nDeceptively Fun\n\nIt is what it is. A low graphics game with one scene, and few enemy types. Yet, like flappy Bird, or other perfect games, there is something about it that is really fun.\n\nHelpful | 0", "FenneyZombiesJul 15, 2019 at 2:04 PM\nI love this game\n\nSo I bought on my rift 1st thinking and then I got on the Quest for free and I was super happy. I loved this game so much that I played it anywhere. I love this game and well optimized on the quest as well Ps4 so I give them my approval for this. Get this game when ever, you'll play it for hours on end.\n\nHelpful | 1", "antney007Oct 5 at 1:06 PM\nLove it\n\nUsed in the store. This game convince me to buy the whole Oculus.\n\nHelpful | 0", "YeetyBoi55Jul 14, 2019 at 5:28 AM\nStunning and challengeing!\n\nFor those looking for a challenge this game is for you! The gameplay has great mechanics for constant strategies, the many different ways to tackle a stage with shotguns, lasers, or grenade launchers.\nIn case you get get overwhelmed, pull your shields to block lasers, switch to the offensive mode to wipe enemies to the floor! (Literally!)\n\nHelpful | 1", "joeywoeydoeyJul 8, 2019 at 7:16 PM\nOne of the greatest vr games ever\n\nI have spent 2 1/2 hours in this game and I intend to spend more. This game uses the 6dof perfectly and dodging bullets feels so much cooler than on any platform. It makes you feel so cool and when Im playing it I find myself yelling nonsense quotes from movies that dont even fit the situation overall great game, five stars\n\nHelpful | 4", "doinyamom989Sep 23, 2019 at 6:00 AM\nMuch more playable than the psvr\n\nWhat the title says, I can actually\nPlay this without the tracking being bad and having to worry about hitting a wall.\n\nHelpful | 0", "loregnumOct 6 at 9:00 AM\nBest VR game, but...\n\nThis is my favourite VR game and I also think it is the best VR game and a must-have, with Racket NX being a close second. SPT is super fun, feels like you're inside an arcade shooter, and it is also deeper than it may seem because of the different ammo types, Voltron, and ways to defeat enemies. It's also even better on the Quest than on PC because of the freedom of being untethered and easily moving around the platform if one's play space is big enough.\n\nHaving said that, it's a bit disappointing that nothing gets added to it. I've owned this game since Dec 2016 and short of when it came out of early access 2 years ago, nothing has been added to it, at least nothing that I know of or that is significant. It's a bummer because you see many other games like Sairento or even RacketNX that are actively worked on to get better and they even get new modes and other 'stuff' while nothing to make this amazing game even better. Just wish SPT had that same level of dedication you see elsewhere.\n\nI know the devs are working on Space Pirate Arena which looks neat but it is also going to be very niche (also seemingly Quest only) since most don't have multiple local friends with Quests or the type of large space the game will require. It'd be great to see more focus on SPT or even a sequel to it.\n\nWhile I am guessing it won't ever happen, I'd love to see a co-op mode. I feel SPT would be perfect for co-op and the fun people could have working together (imagine the fun with one or both players using the Voltron at the same time...could toss droids to the other to slice in half) would be great. Doesn't even have to be a free update as I'd pay a bit extra for a co-op mode.\n\nHelpful | 0", "Megatron25Jul 4, 2019 at 7:39 AM\nBest arcade shooter\n\nI played this on the HTC vive for pc. Looks and feels the same on the quest. With the freedom of no wires to get tangled in. Definitely a must have if you are into shooters. Countless hours of replays to beat your high score or the leaderboards. This game is one of the reasons I bought the quest\n\nHelpful | 5", "ModernDayRumiJul 9, 2019 at 7:43 PM\nExcellent Arcade Fun \n\nThe fluid gameplay mechanics are what really makes this game shine. The arcade style is fun- waves of robots flying at you while you use your arsenal of ammo types and space bat/shield to destroy them all while dodging their lasers in slo-mo. Not too much to do progression wise, which Im hoping gets added soon, but you always feel like hopping back in for a quick game throughout the day. Worth the price just to have the ability to show this to family/friends. My girlfriend doesnt like space experiences or gaming in general, but shes hooked on this one. 5/5\n\nHelpful | 2", "exjraordinaryJun 25, 2019 at 6:53 AM\nThis may be the best vr shooter\n\nThis game is awesome ive owned on pc since vive came out and was blown away but now without wires this game is truly amazing i padded my floor and was rolling around grabbing the shield from my back. Its amazing how fatihful to pc this game is with how many enemies are on screen and at a fast framerate. I say this is a must own game cant wait for a sequel.\n\nHelpful | 2", "m7.briggsSep 28, 2019 at 4:33 AM\nNice shooting game\n\nAdd multiplayer co op and it will become 5 stars recommend\n\nHelpful | 0", "sinkkingOct 6 at 6:30 AM\nBeing stuck in one spot\n\nI prefer roaming\n\nHelpful | 0", "PhadesJun 21, 2019 at 11:28 PM\nCrazy fun and addictive\n\nI just love this game. I've played it on the Rift but on the Quest it's a whole new experience. I have a large area for playing (my garage) and it just makes this game amazing. Cross-buy support is just the icing on the cake but it would be worth grabbing even without that. Support this dev and grab it!!\n\nHelpful | 2", "DrColzaJul 5, 2019 at 4:14 AM\nVery happy with my purchase\n\nI bought this game after playing the demo and deciding it was worth a punt. I've never really played wave shooters before but I really enjoy this game.\n\nI feel fully immersed and being able to move about within the space really adds to it.\n\nThe weapon change mechanism of reaching behind your head is very clever.\n\nOverall this is a great game and one to help showcase VR to friends and family due to its ease of use and by the amount of fun it brings when playing.\n\nHelpful | 1", "beavis28Aug 22, 2019 at 9:54 AM\nThere is black flicker when starting\n\nJust now bought the app,, then after starting it,, I see black flickering in front of me,, so cannot play.. can you fix this?\n\n\nUpdate\n\nOk,, after restarting the device,, this was fixed.. thanks\n\nHelpful | 1\nDeveloper ResponseAug 22, 2019 at 9:19 AM\n\nHi there, we've heard of a few users who have issues starting Space Pirate Trainer for the first time when their Quests have low battery. Can you try charging your Quest, and then starting Space Pirate Trainer again?", "iamdrewanthonyJul 25, 2019 at 12:17 PM\nIT'S MY GO-TO GAME EVERY TIME\n\nThis game is amazing! Not because i'm #9 in old school, or #1 in brawler, but because it's super ADDICTIVE! Great detail. Great graphics. Great adversary robots!\n\nHelpful | 2", "CarcPazuJul 13, 2019 at 1:39 AM\nBest shoot em up game on the Quest.\n\nThis is the best game for partying and have non-gamers try and have quick blast. The price is fair and I totally got my money's worth with that game. We need more spin-offs like this game. It's pretty much a must buy imo.\n\nHelpful | 1", "GotSebAug 14, 2019 at 12:33 PM\nFun\n\nA lot of fun. Disappointed this was free on my Vive, but not Quest.\n\nHelpful | 0", "lm.cooper.3May 30, 2019 at 5:48 PM\nBest Game\n\nThis is the coolest game on quest so far. Having a great time playing it. I feel completely immersed in the game like Im standing on the platform. The gameplay is challenging, yet not so much that I dont keep coming back for more. The creators did an excellent job and I couldnt be happier. I also have to note the demo sold me on the game. I hope other creators do the same.\n\nHelpful | 14", "PicardMay 28, 2019 at 1:04 AM\nOutstanding\n\nHad Rift almost 2 years and never knew about it, bought on a whim for cross-buy. Now it's one of my favorite VR games with cool graphics, fast and tight gameplay and works well in a modest playspace. Nice mix of weapons and powerups to master, easy to pick up and play; duck, dodge and feel like a bad@ss on the way to a high score - think Space Invaders in real life!\n\nHelpful | 4", "JohanTEAAug 30, 2019 at 4:01 AM\nGreat arcade but short\n\nI thought this would be more of a story driven game, like Robo Recall, but it's a pure arcade game.\n\nIt's fun and all but gets boring quite quickly. But it's worth $15, no doubt about that.\n\nHelpful | 2", "YeahWowCoolJun 27, 2019 at 2:53 AM\nGame I always love to play\n\nNone of my Quest session would be complete without a few plays of SPT! It has great replayability value! Game itself is very intense and immersive. Well made with superb soundtrack. I was really surprised to see how great this game is! Worth every penny.\n\nHelpful | 3", "DetrimonyMay 25, 2019 at 12:56 PM\nBest game on quest so far\n\nThis game reminds me of an upgraded space invaders. I love playing it. It has so much more to it than I imagined with being able to change weapons and then using the shield stick to grab and power. Just a ton of fun. I was also trying to get my wife to try the quest and she finally said she would and thats the game I showed her. Now she loves it! This is cool because it helps her understand why Im playing so much. Great job on the game developers. I love it. If I could change anything about it Id say adding a third option to the shields and having it just be your hand to catch the lasers from enemys. Then maybe it charges up and gives you a super move! I just amazed myself!\n\nHelpful | 14", "yousafariJun 9, 2019 at 2:42 PM\nThe Best Launch Title For Quest\n\nThis game likely has more replay value than all of the other games that launched for Quest (maybe outside of a modded version of BeatSaber).\n\nThis game reminds me a bit of when I first played Rocket League. A relatively low budget/easy to play but hard to master game.\n\nThe controls are VERY tight and easy to learn. The action is super fast paced, and it's easy to just hop in and play. It's not for everyone, but if you have any interest in shooting games and are willing to take a chance on a $15 game, it's worth every penny.\n\nHelpful | 6", "milesp968Jun 24, 2019 at 1:49 PM\nAwesome!\n\nThis game is excellent, I've tried most of the quest titles so far and this is definitely one of the most fun. Well worth the price. Very simple and very much pick up and play but I keep coming back to beat my score. My little lads love it as well.\n\nHelpful | 3", "XxPriMa_NoCtAxXAug 4, 2019 at 8:47 AM\nFun but\n\nFun game but missing something, idk what. Weird that you can start at certain waves kinda defeats the points of waves\n\nHelpful | 3", "anthonybuiJul 30, 2019 at 2:19 AM\nGreat !!!\n\nThis game is amazing !! love it, but if you create a coop multi player, it will be wonderfull.\n\nHelpful | 1", "zbohlmanMay 29, 2019 at 10:49 AM\nWorth it!\n\nThis was my first game for the Quest as it was reasonably priced and I enjoyed the demo. Absolutely tons of fun and really explores some of the cool possibilities of VR. I will get TONS of enjoyment from this game. It does get challenging which means it'll have tons of replayability.\n\nHelpful | 3", "NightShade77Jun 12, 2019 at 10:10 AM\nMoney well spent!\n\nThis is a short arcade style game that I just keep coming back to. It is currently my favorite game available for the Quest. No real issues except I just need more practice! :)\n\nHelpful | 4", "HybridAlienJul 22, 2019 at 8:05 PM\nIncredible\n\nThis game is amazing and highly addictive. A must buy if you love classic arcade shooters. 360 view is incredible!\n\nHelpful | 1", "ThatParkerKidMay 28, 2019 at 1:29 PM\nExcellent VR FPS Action!\n\nI bought this after playing the demo on my Quest. I spent hours alone on the plain arcade mode it was that good. The variety of weapons is amazing too. Gunplay is really nice and using the iron sights feels really cool. I also spent a lot of time experimenting with the sword and shield. Dual swords is a unique challenge but it's a lot of fun and opens up cool opportunities. I haven't gotten too deep into the other modes past Arcade but so far this is one of my favorite Quest apps.\n\nHelpful | 9", "Azazel08May 22, 2019 at 2:48 PM\nTetherless SPT is the way to play\n\nIf you are a veteran SPT player you will notice the graphical difference right away, but after playing for 5 minutes you won't care. Quest is the best way to play this classic VR game. Wirelessly ducking and rolling adds another dimension to this excellent game.\n\nHelpful | 5", "matsterJul 6, 2019 at 5:19 PM\nMan ol man\n\nI know one thing I enjoyed playing this game but watching this put a smile on my dad's face was worth every penny. He was grinning from ear to ear thanks for a simple but awesome experience\n\nHelpful | 1", "robotMay 30, 2019 at 12:02 AM\nAblosute gem of a game\n\nVideos of this game simply don't do it justice. Incredibly fun, super immersive, plenty of variety in weapons, challenging gameplay and the music... oh boy the music! The soundtrack alone is worth the price! So glad I pulled the trigger (pun intended)\n\nHelpful | 3", "OpticEmperor365May 26, 2019 at 12:26 PM\nUnexpected Fun\n\nI didnt think I would really enjoy this game because it is not my type but I got it based on reviews and I have enjoyed each and every minute of it. Definitely worth $15 with all of the game modes and fun modifier things. When you are shooting down those robots it is so satisfying and gives you an adrenaline rush! I let my 3 family members try it and they all had lots of fun. Some used the sheid and one went guns only and really took an advantage of the quest being tetherless.\n\nHelpful | 8", "IRobot4EverJun 25, 2019 at 5:06 AM\nMy favorite game #1\n\nJust the best game on Quest so far, and it will stay #1 for a long tome !\n\nIf There's only one game to buy, this is the one, you won't regret it!\n\nHelpful | 3", "Scramble1981Jun 16, 2019 at 9:53 AM\nExcellent game\n\nLike being in a 1980s arcade shooter. Looking up as waves of aliens fly overhead never seems to grow old. Combined with movement and the tactical use of a shield this is a really good game. Ideal for Quest as it is no hassle for a quick 5 minute game.\n\nHelpful | 2", "muddywaterzzzJul 6, 2019 at 8:54 PM\nSpace Invaders on Steroids!\n\nJust insane...and a great workout. My thighs are still sore from ducking bullets and hiding behind hologram barricades. The battle gets pretty intense!\n\nHelpful | 2", "NVRflameJul 4, 2019 at 2:47 AM\nThe Truthful Review\n\nThe truth is this game just isnt that good. It keeps u interested for 20 mins and then youll never go back as its the same thing over and over. And oh yeah, the graphics are not what I want after investing so much money in a Quest.\n\nCmon developers, you can do much better than this. And reviewers you need to be giving truthful star scores so people dont spend money on games like this expecting something special when in reality its just a 3 star meh game.\n\nHelpful | 14", "bruce.coleroJul 21, 2019 at 7:01 PM\nAwesome game\n\nGreat game. No need to overstate everything. One of the top quest games out there.\n\nHelpful | 1", "rbgrnAug 6, 2019 at 1:22 PM\nAmazing\n\nA must try\n\nHelpful | 0", "AskadafJun 4, 2019 at 9:49 PM\nYou're actually in an arcade game\n\nThe ability to change weapons by moving your controller over the back is amazing. The different types of guns, all toggled with the movement of a joystick, allows players to spice up their gameplay in response to different enemies and situations. Using telekinesis to grab robots, then smash them with your shield or into the ground is very fun. This is THE perfect 3d arcade shooter.\n\nHelpful | 2", "ZuurstokAug 1, 2019 at 3:46 AM\nVery nice\n\nGreat fun\n\nHelpful | 2", "MTilleyMay 24, 2019 at 1:48 AM\nQuest version is so good!\n\nHad this for rift, so I was pleasantly surprised to find it through cross buy. (Thanks devs for enabling it!)\n\nI have to say, the Quest version is just the superior version. Ducking and diving around wirelessly is fantastic.\n\nDevs did such an amazing job porting this game. I got a GTX 1080 to run this a few years ago. Now it's all in the headset?! Honestly I can barely tell the difference in graphical fidelity.\n\nWould recommend to anyone looking for a simple, fun, arcade style shooter!\n\nHelpful | 9", "cowebberJun 2, 2019 at 10:58 PM\nBest Game on the Quest\n\nIll start by saying that this looked like some lame game I wouldnt really enjoy. Aesthetically I wasnt really sold and shooters are a dime a dozen right? So I figured Id give the demo a shot to see what the quest version had to offer. I was instantly hooked. This game is great. The immersion factor is unmatched, the game-feel is solid. The haptic feedback of the touch controllers enhances the already satisfying sound effects and visuals. I speak highly of this game because it immerses you. The pressure of the enemy waves force you to move around a lot. Youre aiming, leading targets and dodging lasers in a frantic ballet of neon explosions. You are encouraged to experiment and make strategic use of your shield & weapons. Its so easy to learn and difficult to master. Its intuitive and easy for anyone to pick up and play. I think this game showcases the potential of this platform, especially if you are able to set up a large play area and guardian boundary. Try the demo if youre skeptical. Currently my favorite game, the soundtrack is rad too. I could see this game being a great way to relieve stress after a long day. 10/10\n\nHelpful | 2", "ElyrthalJun 3, 2019 at 5:39 AM\nSimple concept, so addictive!\n\nAll other comments already said it: This is an absolute must have if you like to challenge yourself and push the score a little higher each time.\nWhile most of the games available day 1 have close to no replayability, I always come back to SPT to let off the steam in short sessions.\nOne of my last one was outdoor at night on a parking lot in the wind: A pure blast!!\n\nHelpful | 2", "CrazitomalirsJun 2, 2019 at 7:57 PM\nArcade Shooter Sessions!!!\n\nThis is a great game if you want to hop in and blast some space robots from a floating platform. It has a nice selection of weapon fire types. Recommend getting the demo first so you know exactly what you're getting. Recommended if you're looking for something to spend 30-90mins doing. In and out. Great time.\n\nHelpful | 2", "KC5000Jul 19, 2019 at 10:08 AM\nBest Game\n\nLove this game and i believe Quest needs more arcade games like this.\n\nHelpful | 1", "richards.113May 23, 2019 at 6:00 PM\nNext Level Space Invaders\n\nGreat pick up and play game for quick breaks. No narrative, instead you're simply supplied a bevy of weapons and a shield/electric whip to fend off waves of flying enemy droids. I prefer two weapons and having to dodge bullet-time enemy fire while shooting from all angles. It's perfect for a quick workout, a lot of fun, great value for the price, and as long as you don't expect a story, be prepared to revel in some arcade action.\n\nHelpful | 6", "skymakerMay 31, 2019 at 1:56 PM\nGreat Workout\n\nThis is a great game and will give you a great work. Its better if you have a lot of room. I used a big hall to get more than a 6 x 6 area to work in. The begged the area you play in the more fun you will have with the game. I was thinking if I had a 30 x 30 would I be on the edge of the ship. I will have to test that out. Love the game, only wish they had it for the Go as well.\n\nHelpful | 1", "YOUR-ARCH-ENEMYJun 28, 2019 at 11:36 PM\nBest played on the Quest!\n\nI have this game on the psvr and let me tell ya, it's so much better without a wire! Loads of arcade shooting madness! Must get for shooter fans!\n\nHelpful | 2", "Blakey89May 25, 2019 at 12:17 PM\nThe VR evolution of the arcade shooter\n\nI expected to have some fun with this game and purchased on sale but my expectations were absolutely blown away. Incredibly immersive, excellent controls and \"just one more game\" is something you will be saying to yourself a lot.\n\nThis is my quick go to game alongside Beat Saber and I would especially recommend it for someone who is new to VR.\n\nHelpful | 4", "geoffrey.milner.12Jun 1, 2019 at 2:40 AM\nAmazing\n\nThis is so much better on quest Iam loving it can't stop playing.i have it on psvr but can't get over 20000 because of not being able to move around.on quest I've more than doubled my score and will keep playing to get even better awesome game\n\nHelpful | 6", "CIPlayersJun 14, 2019 at 3:26 PM\nEssential VR Game\n\nWhile at its core this may just be another wave based shooter, it perfects the genre. Never making it seem impossible to improve your own skills and get further. It looks & sounds great and will even give you a proper workout!\n\nHelpful | 1", "wildBcatMay 28, 2019 at 7:37 AM\nMy childhood has come alive!\n\nI havent even scratched the surface of this game, and I already feel like giving it five stars. I want to say up front - the demo does not do it justice, and I even loved the demo! It is like Galaga or Space invaders, but on VR! When you buy the full version you get so much more. It is like being inside the arcade machine. It is super challenging and fun. I dont think I will get bored with this anytime soon. Arcade mode is so fun! There are a lot of leaderboards too. Definitely a must-have!\n\nHelpful | 2", "Socar360Jul 20, 2019 at 10:57 PM\nYes\n\nI bought the Quest for this game alone.\n\nHelpful | 1", "patter001Jun 3, 2019 at 11:01 AM\nEssential game for introducing VR\n\nAwesome game that is perfect for introducing folks to the fun and immersive VR. Awesome arcade type play for having family competitions of who can get the highest score\n\nHelpful | 3", "backpocketMay 25, 2019 at 12:05 PM\nA must have and a great first experience\n\nI love this game because it's so simple to explain to people and show them their first VR experience. I wish it had other environments and multiplayer tho. Hopefully it will get updates because it would be nice to have a more colorful experience and the ability to work as a team with someone else.\n\nThis game plays well and shows off VR in a way that is really simple. Point your gun and shoot. Dodge and block the laser. Simple.\n\nHave played on steam VR and now on the quest and it's every bit as good in mobile if not better.\n\nHelpful | 3", "psimaticMay 28, 2019 at 11:16 AM\nInstant buy! So happy I got this one.\n\nSo glad I grabbed this game. I was pleasantly surprised by the drum and bass track, as a huge dnb head, I loved the music choice. The game brings me back to one of the final scenes in Matrix Revolutions when the sentinels invade Zion and the humans are blasting the sentinels with their robotec armor suits. Yeah I totally feel awesome blasting my dual pistols even on the beginner waves! Might not be a game for everyone but this one definitely stoked the right chord for me. Thank you devs!\n\nHelpful | 1", "steve.weave.56Jun 6, 2019 at 1:17 PM\nAlmost Great\n\nA fun arcade shooter. I just wish it had upgradeable weapons or some sort of progression to keep your interest up. But if you just want to chase high scores this is a classy game. It helps if you have enough room to dodge about a bit, but is playable stationary if you use the shield in place of one of your guns.\n\nHelpful | 4", "Lamprey79Jun 13, 2019 at 6:28 AM\nSimple. Fun.\n\nThis game is about standing in one area, shooting waves of drones and dodging their shots in return.\n\nIt's very simple, but great fun to play in VR. Graphics are good enough to have fun with the game. Worth the money.\n\nHelpful | 1", "Eddy120876May 27, 2019 at 2:50 PM\nFun workout\n\nAfter trying the demo and loving it, I decided to purchase it . Once it was downloading I was thinking it will be a breeze boy was I wrong it was a total cardio workout. After my Quest battery ran out (2 hours 1/2) I was completely sweaty,higher heart rate and with a huge smile. This game is perfect for those that want a cardio workout + fun and wanting more and more fun. Great job guys\n\nHelpful | 1", "AshmanRoonzJun 17, 2019 at 8:14 PM\nGood game. Suggestions for devs:\n\nI love the game first of all. I wish there was an option to turn off vibration in the controllers. Also I wish there was a multiplayer mode to have a buddy standing virtually beside me.\n\nHelpful | 2", "BrofreshionalMay 25, 2019 at 12:25 AM\nPerfect Arcade Shooter\n\nThis game has the recipe down for a great arcade shooter. Its great for quick sessions or for groups of people to switch off. The price is also great for what you get. I feel no need to get any other shooter yet. This game will keep me busy for a long time.\n\nHelpful | 6", "JC007Jun 9, 2019 at 9:15 AM\nMy fave\n\nVery fun arcade style shooter. Perfect fit for the Quest, with just the right amount of mobility required. Very addictive and easy to break a sweat! Well done.\n\nHelpful | 2", "wolfthekitsuneMay 23, 2019 at 11:30 AM\nA must have!\n\nThis is a must have for any quest owner! I did not notice any lack of graphics from the PC version, the gameplay is well and works perfectly. It is so fun and you feel so cool using two blisters or a shield in a blaster or any combination you want. Ill found having the beams sword and the auto blast had to be the most funnest combination, I feel so cool using it as a sword to slice and to reflect blasters! I threw a VR party and this was one of the top three games that everyone had fun with!\n\nHelpful | 2", "wrxtc555Jul 21, 2019 at 4:14 PM\nModern day Space Invaders\n\n very good fun!\n\nHelpful | 1", "sebrkJun 22, 2019 at 5:19 AM\nSo amazing\n\nJust played out with a bigger play area. This game is insanely fun. A must for every Quest.\n\nHelpful | 2", "Abernus69May 26, 2019 at 2:28 AM\nSolid shooter and so much fun\n\nI have not played this on PC VR so I can't compare to that, but this is brilliant. It runs very smooth and the tracking is spot on. No matter how many drones are about it never stutters. For a quick first person shooter this is my go to game, and is addictive\n\nHelpful | 4", "DobbyTheDestroyerJun 25, 2019 at 4:29 PM\n\nGreat game for parties. You can complete with your friends to get the best score! And also a great take on classic wave-shooters!\n\nHelpful | 2", "Dragon222May 24, 2019 at 11:38 AM\nBetter then expected!!\n\nClose to 5 stars but I feel the Devs missed a great opportunity to make full use of the Oculus quest wireless capabilities. Enemies come at you from a 180 degree view and not 360 degrees, having that option would have been amazing!\n\nHelpful | 24", "brian.downey.334Jun 16, 2019 at 4:38 PM\nSo much fun!\n\nMy favorite Game on the Quest by a long shot (pun intended)! Great replayability, great challenge, great value. Give it a try, you wont be disappointed.\n\nHelpful | 2", "mdcwhitakerJun 8, 2019 at 3:16 AM\nGreat game\n\nA good option for a casual 10 minute session on the Quest. It's something you can turn too if time is tight, and let's be honest, most users are going to need an experience to fill those gaps.\n\nHelpful | 2", "Greekspartan121May 26, 2019 at 10:47 AM\nGreat Arcade Action\n\nGreat game,spot on tracking.Had some issues at first once I downloaded it.Had some large pixelated blocks in my vision,after quitting and restarting a few times it was fine,very strange.Everything is fine now.\nChoice of weapons is great.Recommended for a great blast.\n\nHelpful | 1", "KraznRaznMay 22, 2019 at 10:00 AM\nExcellence!\n\nI own this game on the Rift and always would go back to it. This version is outstanding! A must own for the Quest!!\n\nHelpful | 5", "sebastian.kurz.583May 26, 2019 at 11:42 AM\nAwesome space shooter\n\nThis is something you will come back so often. Intense, fast, satisfying, cooooool!! Although heavy fighting action is going on the screen the quest easily manages all without performance drops! Kudos for the skills of the devs with this awesome rift port!\n\nHelpful | 1", "HDAndyJun 22, 2019 at 9:26 AM\nAmazing\n\nSuper fun for a quick casual game, super fun to try to change things up with different weapons and strategies.\n\nHelpful | 2", "cgrinaldiJun 8, 2019 at 7:12 AM\nSimple and fun!\n\nThis is a fun and simple game. Great if you just want to jump in for a few minutes and see how far you go. The various bullets and weapons make it so you can vary up your strategy\n\nHelpful | 2", "YnGBL00DJun 11, 2019 at 5:27 AM\nAwesome\n\nJust awesome even though wave shooters do not seem to be my thing in VR.\n\nWould love Multiplayer support!!\n\nHelpful | 2", "XinkandAug 28, 2019 at 10:26 AM\n\nPretty repetitive, but it's better than nothing\n\nHelpful | 2", "JforssbladJul 5, 2019 at 3:35 PM\nTight\n\nThis game is tight! Everything works great!\n\nHelpful | 1", "DextirMay 30, 2019 at 2:32 PM\nAmazing!\n\nWe are finally taking our first steps toward the Oasis, this game more than anything FEELS awesome. The guns and the shield work so well, this game is a great pick for showing off VR to someone for the first time!\n\nHelpful | 2", "FamousManateeJun 2, 2019 at 11:53 AM\nAmazing!!\n\nThis game is truly amazing. It is extremely fun to play with a group of people when you are all trying to break someones high score. Makes any gathering extremely fun and a little competitive.\n\nHelpful | 2", "KeolaJun 18, 2019 at 3:06 AM\nBasic VR Fun!\n\nNo one in the history of this game has disliked this game\n\nHelpful | 2", "scifi_taoistJun 4, 2019 at 5:46 PM\nRidiculously Fun\n\nInsanely fun! Im generally not into shooters, but this is like Space Invaders in 3D! I often forget where I am and find myself rather vigorously ducking out of the way from blasts! Highly recommend!\n\nHelpful | 2", "CabronusMaximusJun 6, 2019 at 10:38 PM\nGreat Fun\n\nThis is brilliant fun. I'm not that great at it, but super action and very involving. You will look like a plonked to any guests in the room, but you will have lots of fun.\n\nHelpful | 1", "DAX_QcAug 30, 2019 at 10:50 AM\nFun\n\nBoth this on day one. Play from time to time.\n\nHelpful | 1", "Bock_BenMay 30, 2019 at 9:57 PM\nAwesome arcade action\n\nThis is truly a great game that will have you fully engaged the entire time. This was my first purchase and I would highly recommend it to anyone whos looking for a great arcade style game.\n\nHelpful | 2", "The_Guini_PiperJun 11, 2019 at 11:19 PM\nArcade shooter in VR\n\nIt's kinda like a classic arcade shooter reborn in vr. Amazing! Must have for any VR gamer. I've already purchased this on two platforms.\n\nHelpful | 1", "NeilSCJun 11, 2019 at 9:09 AM\nWow wow wow\n\nThis game is awesome. Feels slick fast and makes me wanna smile from ear to ear. It's playing 80s galaga and being in the game..hats of guys.\n\nHelpful | 1", "caublasianMay 23, 2019 at 9:23 PM\nIt'll leave you going: \"one more game\"\n\nThis is the game to have your friends play if they've never experienced VR before. I had everyone play it at work today and it was a hoot watching a bunch of older gents dicking and dodging and getting into it.\n\nHelpful | 3", "Torrit_BenJun 15, 2019 at 3:36 AM\nLoved it!\n\nSimple to play and great fun. It was so much better than I thought. Very good value and my 8 year old son loves it.\n\nHelpful | 1", "UsernamemarcJun 9, 2019 at 6:13 AM\nAnother worthy title for the quest\n\nMust buy for the price. Hours and hours of gameplay. Controls are easy to use and theres a variety of weapons to choose from.\n\nHelpful | 2", "ThreeJamesMay 22, 2019 at 7:29 PM\n\nHands down the most fun I've had in the first two days of owning a Quest. It's designed with a very simple arcade gameplay aesthetic in mind, and it absolutely nails it.\n\nHelpful | 7", "Spanky8237May 21, 2019 at 11:45 PM\nAwesome arcade style shooter!\n\nIf you like arcade games like galaga, space invaders, or just shooters in general, don't pass this up! Easily worth the $15 admission fee. Now I am a certified space pirate! Arrrrrrr!\n\nHelpful | 5", "DeeFarkJun 10, 2019 at 6:22 PM\nSimple but dope\n\nJust an all round super fun and simple game. No loading or waiting for storylines, just straight to blastin fools!\n\nHelpful | 2", "Milk_BoiMay 29, 2019 at 10:59 AM\nPolished\n\nPlaying on the quest is the best experience.\n\nHelpful | 4", "LamestGamrJun 14, 2019 at 11:56 AM\nPlays Great!\n\nLove how this plays on the Quest!\n\nHelpful | 2", "CrazyFinger4May 21, 2019 at 6:19 PM\nAmazeballs.\n\nI can't recommend this game more...when you get into the groove, it feels like your inside an arcade cabinet living out the ultimate power fantasy.\n\nHelpful | 8", "jimbos4Jun 12, 2019 at 6:52 AM\nSpace tastic\n\nGreat game, classic space invaders in vr.\n\nHelpful | 2", "Chamb0Jun 9, 2019 at 2:13 PM\nFantastic fun\n\nA really fun simple game! Can get a little slow down when to many enemies are on scree, but not enough to break emersion.\n\nHelpful | 1", "jaimerodMay 30, 2019 at 1:55 PM\nGreat Game\n\nSuch a great and exciting game. I think it's the best shooter for the platform right now. I would give it 6 stars if possible because it is cross buy!\n\nHelpful | 2", "shadester88May 26, 2019 at 12:19 AM\nA Must Have\n\nIt you like shooting games, this one is a must buy. So much fun!\n\nHelpful | 3", "BirdmanCooCooCachooMay 24, 2019 at 3:44 PM\nPerfect demo game\n\nVery consistent frame rate, able to handle a surprising number of enemies on screen at once. Plenty of different modes of play and multiple weapon variations.\n\nHelpful | 3", "MR.KING.KMay 24, 2019 at 7:19 AM\nPew pew\n\nOMG this game is just awesome and my favourite game so far \n\nHelpful | 3", "maxkillersJun 8, 2019 at 9:46 AM\nAwesome Arcade\n\nVery comfortable first person shooter with a choice off weapons to keep killing robots with\n\nHelpful | 2", "darwins.lastMay 23, 2019 at 7:14 PM\nWow\n\nSuper fun amazing game! Thank you!\n\nHelpful | 4", "mmehlbergMay 24, 2019 at 7:52 PM\nEpic. Fun.\n\nNothing compares to the feeling this game gives you. Full control. Fast paced. Amazing mechanics. THIS is what VR gaming is all about. Way, way awesome.\n\nHelpful | 2", "gemini1976May 22, 2019 at 12:09 PM\nGreat shooter\n\nAccurate and fast paced shooter\n\nHelpful | 4", "Rizzo09Jun 15, 2019 at 2:32 AM\n\nGreat game.Great to play of u have friends round\n\nHelpful | 1", "imhyattJul 18, 2019 at 6:58 PM\nAmazing\n\nI can't put this game down. This is a busy-have for the Quest.\n\nHelpful | 1", "geokalJun 16, 2019 at 5:17 AM\nExcellent\n\nYou never get bored of this one\n\nHelpful | 1", "SuperPukeJun 6, 2019 at 7:15 PM\nA classic\n\nJust get it\n\nHelpful | 2", "miguelangelnetMay 28, 2019 at 9:34 PM\nGood shooter\n\nIts based in waves. Good quality with a fair price.\n\nHelpful | 2", "roli_oliJun 7, 2019 at 8:49 AM\nEh\n\nIts spt for sure, I dont like it that much but its spt.\n\nHelpful | 1", "thomas.townsend.752Jun 4, 2019 at 1:21 PM\nOld Geezer\n\nGreat game to get your blood pumping. The only thing I wish is that we could intergrate our own music library. Just like saber beat, I would love to be able to syn my music with the game.\n\nHelpful | 6", "rob_CHJun 8, 2019 at 10:46 AM\nWill never be boring\n\nIf you like love, death, robots and gunfire.\n\nHelpful | 1", "AgniusmMay 29, 2019 at 6:50 AM\n\nThis game is challenging and has infinite replay-ability value.\n\nHelpful | 4", "ReBornTheFirstMay 23, 2019 at 1:38 PM\nReally bad resolution\n\nDon't get me wrong, I really like the game. But knowing how it can look, the wireless freedom doesn't justify the low resolution and jagged edges in the quest version.\n\nHelpful | 11", "ToguyJun 19, 2019 at 5:37 PM\nOk\n\nIt is a solid short game.. However, disappointing there is no story mode.\n\nHelpful | 6", "ScurrydogJun 4, 2019 at 11:45 PM\nFantastic\n\nBeing able to move freely really helps with the immersion. The tone of the graphics seem a little off, but I can deal with the small downgrade.\n\nHelpful | 2", "InspectaMay 24, 2019 at 4:02 PM\nGreat game for a large and small areas\n\nGreat graphics and fun galore. Never played it on PCVR, so Im not comparing it to anything.\n\nHelpful | 2", "steven.couture.5Jun 3, 2019 at 6:31 PM\nGood!!\n\nExcellent game, but it need multiplayer !\n\nHelpful | 2", "LifeAsKorleoneMay 31, 2019 at 3:42 PM\nAmazing Game\n\nFun, immersive, and entertaining definitely a must buy.\n\nHelpful | 2", "seloaceJun 10, 2019 at 5:37 AM\nFirst buy\n\nGreat game\n\nHelpful | 1", "L.E.D.BLUEJun 9, 2019 at 12:07 PM\nCross-buy\n\nThank You\n\nHelpful | 2", "ClomaJun 3, 2019 at 4:04 PM\nSo much fun!!!\n\nFast, fun and forever firing fun!!\n\nHelpful | 2", "MaimonidesMay 25, 2019 at 1:02 PM\nTry the demo\n\nI spent three minutes in the demo and purchased it five seconds flat.\n\nHelpful | 3", "lefoulkrodJun 1, 2019 at 9:17 AM\n\nFavorite vr game so far its wicked fun.\n\nHelpful | 2", "anthony.ditanoMay 22, 2019 at 1:56 PM\nContent\n\nHours of content with a great difficulty curve, cant wait for a sequel/update\n\nHelpful | 3", "ArkhamJokerJun 17, 2019 at 7:00 AM\nA solid choice\n\nA solid choice and a great example of how VR standing experiences should be... Would love more room scale though\n\nHelpful | 3", "Aqua-VRAug 26, 2019 at 3:10 PM\nOne of the Best on Quest so far\n\nSuper fun, worth every penny\n\nHelpful | 2", "KalEl8530Jun 7, 2019 at 6:10 AM\nGood game\n\nWorks great\n\nHelpful | 1\nDeveloper ResponseJun 6, 2019 at 6:20 AM\n\nThere are a couple of possibilities 1. Can you restart your Quest and then see if the issue persists? There might be a small memory leak from another game you've tried. To restart the Quest, hold down on the power menu for two seconds, and select the middle button \"Restart \" If restarting doesn't work:2. Are you able to tell me what percentage battery your Quest is running at? I've heard some issues when the battery gets below 20% there can be pixelated black squares on some units. If the Quest is low battery can you charge it back up to 50% and have another go? This shouldn't take longer than 30 minutes If charging your Quest doesn't work: 3. Can you try uninstalling and reinstalling Space Pirate Trainer? There might have been a fault in the downloading process from the Oculus Store.", "pedalpedalpedalMay 26, 2019 at 1:57 PM\nSurprisingly immersive\n\nCan easily play this until battery runs down.\n\nHelpful | 3", "VoltaiaMay 31, 2019 at 8:23 AM\nGood for introducing people to VR\n\nAaand that's about it. It's fun but that's what it's best for. If it had some more content that would be cool...\n\nHelpful | 7", "mhstnscMay 28, 2019 at 2:51 PM\nMost played so far\n\nMost played game for me so far\n\nHelpful | 3", "Tristan6776Jun 13, 2019 at 6:26 PM\nAwesome\n\nAwesome fun but frustrating in a good arcade way. Very fun and a good one to show to friends. Excellent graphics, guns, and style.\n\nHelpful | 1", "BigelowedJun 2, 2019 at 1:49 PM\nJust as good as on PC\n\nIf not better thanks to being free of that pesky cable!\n\nHelpful | 5", "flojim1Jun 11, 2019 at 2:00 PM\nAmazing\n\nnow we re talking ;sort of thanks a millions\n\nHelpful | 2"]