{"App Title": "Spice & Wolf VR", "App description": "Step into the world of Spice and Wolf, recreated in VR by the original creators of the popular anime and light novel series. \nAnime is now not just something you watchit's something you experience!\n\n# Story\nKraft Lawrence is a traveling merchant in a medieval world, who one day comes across Holo, a wolf deity taking the form of a girl. After a string of adventures, Holo decides to follow Lawrence along.\n\nHolo and Lawrence's journeys were not without troubles; one such case was when they were caught by surprise in a sudden thunderstorm. Running from the rain, the two find shelter in an abandoned water mill in the woods. As they gather around a small fire and wait for the sky to clear, a sweet and curious story unfolds...an all-new story that you will experience firsthand, from Lawrence's point of view.\n\n# Production Staff\nStory by Isuna Hasekura\nCharacter Design by Ju Ayakura\nVoice of Holo by Ami Koshimizu\nVoice of Lawrence by Jun Fukuyama", "Purchase section": "$24.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Casual, Narrative", "Languages": "English, Chinese (China), Chinese (Taiwan), Japanese", "Version": "1.04", "Developer": "SpicyTails", "Publisher": "SpicyTails", "Website": "http://spicy-tails.net/saw-vr/", "Release Date": "November 14, 2019", "Developer Privacy Policy": "None", "Space Required": "801.4 MB"}



["5 stars\n54%\n4 stars\n20%\n3 stars\n14%\n2 stars\n8%\n1 star\n4%", "TriAnarchyJun 25 at 7:51 PM\nNot a complete game\n\nThe game is cute, and I guess thats enough for me to give it 2 stars. But there is literally 1-hours worth of content here. There story is literally one conversation between the 2 characters inside a mill. Nothing else, no story to talk about.\n\nHelpful | 36", "RauelRualbeMar 5 at 2:32 AM\nQuite enjoyable BUT\n\nI really enjoyed the story but it is far too short. Frankly I don't understand the marketing? At a third of the price and a few people would still complain at that, but many more people would investigate it. The story is quite well performed so I have no doubt that many people would enjoy it. The developers would gain a following prepared to pay similarly for similar small novella like interludes. The interactive element is likewise underdeveloped and quickly becomes repetitious. But a few dialogue and interaction patterns could also be added with each of the new installments and it might really become something quite excellent over time??? This is not their first attempt at something like this either so they obviously want something like what I have described to happen? Shame they are undermining themselves because they obviously have a talent.\n\nHelpful | 87", "AFWumpJan 6 at 3:40 AM\nNot worth the price, but still enjoyable\n\nThis visual novel is very short, but I still want to see more Spice and Wolf titles. That isnt to say that the game is bad, but it progresses like a very short stage play. While Lawrence and Holo are present, Holo is really the star as she plays the adorable tsundare wolf goddess. She prances around the stage as the characters converse, but the dialogue is very light and unengaging.\n\nHelpful | 21", "Bigun89Feb 5 at 6:04 PM\nNot worth what they are asking\n\nMaybe worth $9.99, not much more.\n\nIt's a glorified 30 minute extension of an anime. The interaction afterwards was extremely limited and still managed to make me feel like I needed a shower afterwards, I don't even know how that's possible.\n\nI initially bought this with the intention of letting my wife play an extended story with some choices, what I got was way, WAY off.\n\nHelpful | 18", "FlixiSilversurferApr 6 at 10:35 AM\nit is not a game\n\nI expected a game. It is NOT a game. I'd like to get my money back, this is ridiculous.\n\nHelpful | 12", "agitokazuNov 15 at 8:31 AM\n$24 for a Short VN\n\nThe VN is way to short for that price point, yes the title was cute, but no interactions at all on story mode pretty disappointing. And then the interaction mode you unlock after the story is just not that well thought out. You are using an Oculus Go hand.. so no gripping or anything\n\nThere is not to grab function in the enviroment.\n\nThis title is not worth $24 maybe $5\n\nI won't ask for a refund since I want to support the Dev, but I now know not to buy titles so quickly next time\n\nHelpful | 237", "Scooter_Mar 6 at 9:35 PM\nHorrible\n\nThe game isn't what you expect, there's no game play and you sit there listening to them talk, it's not worth the money!\n\nHelpful | 5", "MultiDarkZenNov 16 at 8:51 PM\nNot worth it's price tag\n\nThis game is fairly short and I mean short, I thought it would be longer but guess not, this game isn't worth it's price tag, even the interactive mode is pretty lack luster, you can only have one hand at a time and they're a static hand where you can not bend the fingers, their is no locomotion to move around inside the building, there isn't much in terms of what to do, calling it \"interactive mode\" must be some kind of sick joke, because the only thing you can really do is pet Holo that's it, otherwise this mode is useless it would have been better if their were some sort of stats involved to increase holos affections/emotions make it to a small dating sim or something at least make it into some some sort of mini game, because you will get bored very quickly, the story is very short too, and I mean short. The animations were pretty nice along with the music but that's about it there really isn't much else to say about this other then wait for it to be on sale.\n\nHelpful | 48", "maruhatoDec 15 at 3:48 AM\nPlz watch the anime first\n\nTo enjoy this game, you must watch the animation \"\" first. I really loved the anime and waited to see Holo again for a long time. Want to say thank you to oculus for having this game on service\nand welcome back Holo.\n\nHelpful | 14", "WentlleNov 15 at 10:40 AM\nI understand\n\nI understand about people pissed about the price but honestly if your a spice and wolf fan, go for it. Please add more content tho\n\nHelpful | 27", "japanesegeekNov 16 at 6:52 AM\nStory fit for the manga and anime\n\nWas nervous this would be a poor quality VR experience that is just riding on the coattails of the superb manga and anime. But the dialogue and story were both excellent, and fit the characters. VR aspect is the worst, be nice if you can interact with the characters more at the end - it's just a fluff section, but having a great story more than made up for it. While short, one of my favorite VR experiences and shows how anime will fairly quickly be largely replaced in favor of VR experiences of the same stories.\n\nHelpful | 14", "ConePine115Nov 19 at 7:21 PM\nVery cute and good proof of concept.\n\nIt's a really cute visual novel that I quite enjoyed. It is a short maybe 10 or 20 min story but I don't mind the price if it encourages additions and or other more developed games. For the short experience that it was I enjoyed it greatly. It gave me a feeling that watching an anime or playing a game doesn't. It's interaction mode was really really cute although I think the trick to make this it's own genera would be to mix the story and interaction but I'm not expecting anything so daunting. If you like the anime or this kind of content I'd say get it to support the creators, and experience what they made for everyone. That being said it has some flaws that should be sorted out. Hands are static and you can only see them in interact mode and only one at a time. It feels like it was rushed out the door with misleading controls and odd scaling due to the fact that you are sitting and can't move around the scene. There are coins that seemingly do nothing but you can find them And stare at them to make them float. Eye tracking is an amazing way to be able to interact but it should be subtle such as a way to start her look at me animation but not the main way to interact. I had some subtitles disappear but only at like 2 or 3 lines but still. So there are things to improve but now that they have gotten this far there's only room for improvement.\nThank you.\n\nHelpful | 10", "kuraishi420Jan 26 at 12:31 PM\nshort\n\ni like the game but the story is really short and need interactions.\n\nHelpful | 1"]