{"App Title": "Sports Scramble – Demo", "App description": "Welcome to Sports Scramble! Take your favorite sports and mix them together! Play Tennis with a Golf Club. Bowl a strike with a Basketball. Smash a Home Run with a Hockey Stick! Each of the three main sports: Tennis, Bowling, and Baseball has their own Single-Player Training, QuickPlay, and Challenge Modes. Show off your skills competing against other players in online multiplayer matches.", "Purchase section": "FreeView Full VersionAdd to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Social, Sports", "Languages": "English", "Version + Release Notes": "1.0", "Developer": "Armature Studio", "Publisher": "Oculus", "Website": "http://armature.com/games/sports-scramble", "Release Date": "May 21, 2019", "Developer Privacy Policy": "None", "Space Required": "894.0 MB"}



["5 stars\n39%\n4 stars\n11%\n3 stars\n22%\n2 stars\n17%\n1 star\n11%", "Toeb13Jun 17 at 6:31 PM\nOnly one sport allowed?\n\nJust got the quest system and am trying out the demos. This demo allowed one bowling demo, and a few tennis, but I cant try the baseball demo. Everytime I go back to restart, it takes me directly to tennis mode. Looks fun, but I'm not convinced enough to buy it. Maybe later if support tells me whats wrong.\n\nHelpful | 0", "LonerBoyMay 7 at 9:05 AM\nWhole game for me\n\nthis game i think is very good. Even that good i dont need the normal version. I dont want to play online bots for me are fine! I love the bowling tennis is a bit meh because of unfair golf clubs and baseball i cant play. Overall for free this is a good option for people who like to stick to the bots!\n\nHelpful | 1", "Valiant-CuriosityJan 28 at 9:20 PM\n\nI'm a lot older than the typical Oculus Player. Maybe that is why I enjoy this game. It is great exercise. I have a large area to use when I use the Oculus. I don't play the scramble. Personally, I didn't care for it. I simply set the game up to play traditionally.\n\nThe Sports Scramble world is comical. You are placed in a tennis, bowling, or baseball cartoon. It is a happy place to go. You move around as you strike the balls. You also have the option to set the levels for play (easy, normal, expert).\n\nAs others have noted, the one fault of Sports Scramble is that it is a \"pain\" to have to set up the game to play traditional sports each time that you play. I wish the developers would give us an update to save the game settings automatically. That way, you could jump directly into the sports without having to fiddle around with the initial setup. That is the primary reason for my 4 rather than 5 star rating.\n\nThe game is similar to Wii Sports . I'd love to see more sports or an exercise camp added.\n\nIf you are like me, and you liked Wii Sports or if you would simply like a little exercise along with some fun in a 3d cartoon world, you might enjoy Sports Scramble.\n\nHelpful | 7", "TalvikMar 30 at 8:43 PM\nTerrible design\n\nFirst game that got me out of the barrier and got myself hurt.\nWhy design a full tennis court and send balls just outside the safe area?\n\nI played games like Thrill of the Fight jumping and running around and never had issues\n\nHelpful | 1", "shashking404Jan 17 at 5:54 AM\ni will buy the full game only if -\n\ncan i have a mode without the scramble? i don't want the tennis racket to turn into golf stick... already Oculus Quest can't track the controller moving beyond 200 degrees\n\nHelpful | 2", "AtrinaxDec 13 at 8:51 PM\nAudience booing at you\n\nAudience booing every time you miss made me uninstall the game.\nDon't care if other modes are better this is just discouraging and disgusting.\nHow about make the crowd sound like they are shocked or caring and supporting when you fail?\n\nHelpful | 3", "Ali_KittyNov 27 at 11:04 PM\nYou need a football field size barrier..\n\nThis started out fun, but I learned very fast that you need a large barrier for this game to work. The ball went very wide and before I could get it I not only stepped out of my barrier, I tripped over my couch and hurt myself because it didn't have time to shut the game down and warn me. Demo promptly deleted and here's a warning to anyone looking at this: Have a very large playable area.\n\nThe game should warn you if your barrier isn't big enough like Vader does. I have no problems in any other game I've tried yet but this one is a bust if you are in a somewhat confined space. Ouch.\n\nHelpful | 3", "MoxcrJul 19, 2019 at 12:49 AM\nBowling is the best\n\nI initially liked the tennis, but after a few plays a few major flaws began to really show. The ball changes are fun, but the racket changes are annoying and frequently put me at a disadvantage. I end almost every round with a ping pong paddle and my opponent has a pro racket. And they switch while the ball is coming your way so you don't have time to adjust your aim. Sometimes the opponent would knock the ball outside of the range I could reach it too, but maybe I have to be in stationary mode to fix that? Not sure if I was or not. The baseball bat switches are OK, but I couldn't figure out how to actually beat the CPU in baseball, it's like there was nothing you could do when pitching. Bowling, on the other hand, is a ton of fun, and what keeps bringing me back to this game.\n\nHelpful | 3", "FinnyWiggenMay 23, 2019 at 6:18 AM\nReally Fun, but some major flaws\n\nThis is one of the funnest games that I have played thus far on Quest. However it currently has some major flaws.\n\nFirstly it crashes roughly 1 out of 3 times that I try to start it. Usually requiring me to completely restart my Quest. Which is frustrating considering the second flaw. Which is that this program takes forever to startup. Then once it has started, you still have to go through multiple menus before you can even start playing the game. Some of these menus require you to pause and listen to a tip, or listen to the announcer say the same thing he says every time. There is no way to skip any of this.\n\nOne of the most powerful features of the Oculus Quest is how quickly you can start playing games as compared to the Rift. This is because you can just grab it, put it on, and start playing. Sadly, this game undoes all of those advantages.\n\nIf you are going to play you had better plan on three or four minutes before you can even start this game, and that is if it doesn't crash. If it crashes, then you will have an additional four or five minutes to restart the quest and then open the app again.\n\nHaving said that, this is a really fun and addictive game. One of the best on the platform. Hoping that they fix all the issues so that it can be truly great.\n\nHelpful | 2", "sdharrisJun 15, 2019 at 3:22 PM\nLove the idea, some bugs though\n\nBut too many issues with the game currently, on occasions I cannot even use the menu system. Looking forward to some fixes on the next update.\n\nHelpful | 2", "cruelladevilleJun 12, 2019 at 2:17 AM\nsports scramble\n\nthis is a very nice game that i woud like to have on the rift so i can play with other friends thanks alot and keep op the good work\n\nHelpful | 1", "PELAYOFCMay 24, 2019 at 3:51 PM\nVery Very funny\n\nGreat experience. Probably Will buy complete game.\n\nHelpful | 0"]