{"App Title": "Sports Scramble", "App description": "Welcome to Sports Scramble! Developed by Armature exclusively for the untethered freedom of Oculus Quest. \n\nTake your favorite sports and mix them together! Play Tennis with a Golf Club. Bowl a strike with a Basketball. Smash a Home Run with a Hockey Stick! Each of the three main sports: Tennis, Bowling, and Baseball has their own Single-Player Training, QuickPlay, and Challenge Modes. And don't forget to go online and compete against other Sports Scramblers in a myriad of multiplayer modes. Run around a large court in Tennis. Knock the pins down in a zany variety of lanes in Bowling. Show off your pitching and batting skills in Baseball. \n\nArmature Studio, the developer of Fail Factory! for the Gear VR, has created an accessible yet competitive multiplayer experience with lighthearted, meaningful changes to equipment and settings.", "Purchase section": "$29.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Social, Sports", "Languages": "English, French (France), German, Japanese, Korean, Spanish (Mexico)", "Version + Release Notes": "1.0", "Developer": "Armature Studio", "Publisher": "Oculus", "Website": "http://www.armature.com/games/sports-scramble", "Release Date": "May 21, 2019", "Developer Privacy Policy": "STUDIO\nGAMES\nCAREERS\nCurrent Openings\nAbout Austin\nCONTACT\n@2018 Armature Studio LLC. All Rights Reserved\nSTUDIO\nGAMES\nCAREERS\nCONTACT\nSPORTS SCRAMBLE PRIVACY POLICY\n\nEffective: March 21, 2018\n\nThis disclosure and Privacy Policy governs Armature Studios LLCs (we, us or Armature) treatment of personally identifiable and certain other information that Armature collects, or which may otherwise come into its possession, when you become a game player of Sports Scramble (the Game).\n\nThe Game is owned and operated by Armature. Armature values your privacy and is dedicated to protecting your personal information and providing you with:\n\nNotice\n\nWhat personally identifiable information we collect\n\nHow the information is used\n\nWith whom the information may be shared\n\nConsent\n\nWhat choices you have regarding collection, use and distribution of that information\n\nSecurity\n\nProcedures we use to protect against the loss, misuse or alteration of that information\n\nAccess\n\nHow you can correct any inaccuracies in the information we have collected from you\n\nINFORMATION WE COLLECT\n\nArmature collects basic user information, your user name and game score(s) from your Oculus account(s), but none of that information is retained by Armature. Nothing further is collected or retained by Armature.\n\nUSE OF THIS INFORMATION\n\nArmature makes no use of information it collects except in connection with providing your game playing experience. We do not store or retain in the normal course any personal information we gather, whether from Oculus or resulting from your playing the Game.\n\nExceptional Circumstances. If Armature or any of its lines of businesses or affiliated companies, is sold or disposed of as a going concern, whether by merger, sale of assets or otherwise, the relevant databases of Armature could, in whole or in part, be sold as part of that transaction. Therefore, any information about our game players that may be in our possession at the time, including personal information, will be disclosed as part of any merger or acquisition, creation of a separate business to provide the Game, or sale or pledge of our company assets, as well as in the event of an insolvency, bankruptcy or receivership in which personal information would be transferred as one of the business assets of the company. Information about our users in our possession, including personal information, may also need to be disclosed in connection with a commercial transaction where Armature seeks financing, investment, support or funding. We also may have to release personally identifying information when it is necessary to comply with judicial or other government subpoenas, warrants, orders, or to protect the rights, property, or safety of Armature or others.\n\nARMATURE ASSUMES NO RESPONSIBILITY OR LIABILITY WITH REGARD TO ANY THEFT, LOSS, ALTERATION OR MISUSE OF PERSONAL OR OTHER INFORMATION LAWFULLY PROVIDED BY ARMATURE TO THIRD PARTIES, OR WITH REGARD TO THE FAILURE OF ANY THIRD PARTY TO ABIDE BY THIS PRIVACY POLICY OR AGREEMENT BETWEEN THAT THIRD PARTY AND ARMATURE.\n\nACCESS TO YOUR INFORMATION\n\nIf for any reason you are concerned that the personal information in the possession of Armature is not correct, please contact info@armature.com. To the extent any information may then be in our possession, we will be happy to review, update or remove it as appropriate. We may still retain your information in our files, however, to resolve disputes, enforce our End User License Agreement or Terms of Service, and due to technical and legal requirements and constraints related to the security, integrity and operation of the Game.\n\n\n\nHOW ARMATURE PROTECTS YOUR INFORMATION\n\nWe have security procedures for the storage and disclosure of your personal information in order to prevent unauthorized access. Keep in mind however, that no method of transmission over the Internet, or method of electronic storage, is 100% secure. Therefore, while we strive to use commercially acceptable means to protect your personal information, we cannot guarantee its absolute security.\n\nIt is important for you to protect against unauthorized access to your user name and password and to your game system or computer.\n\nNOTIFICATION OF CHANGES\n\nThe Effective Date of this Privacy Policy is set forth above. Please make special note of the Effective Date of this Privacy Policy. We may revise and update this Privacy Policy if our practices change, as technology changes, or as we add new services or change existing ones. By using the Game after the then-current Effective Date, you are deemed to consent to our then-current privacy policy.\n\nIf you do not agree to the Privacy Policy at any time, you must discontinue use of the Game.\n\nDISPUTES\n\nIf you choose to load and play the Game, your visit and any dispute over privacy is subject to the Privacy Policy in effect on the date(s) of your visit, and our Terms of Service including limitations on damages, arbitration of disputes, and application of the laws of the State of Texas.\n\nHOW TO CONTACT US\n\nIf you have any questions about our privacy policy contact us at info@armature.com with a thorough description of your concerns or questions.\n\nPRIVACY POLICY/SUPPORT\n\n@2018 Armature Studio LLC. All Rights Reserved\n\nYou can opt out of Google Analytics tracking by clicking Here.", "Developer Terms of Service": "STUDIO\nGAMES\nCAREERS\nCurrent Openings\nAbout Austin\nCONTACT\n@2018 Armature Studio LLC. All Rights Reserved\nSTUDIO\nGAMES\nCAREERS\nCONTACT\nTerms of Service\n\nEnd User License Agreement & Terms of Service\n\n1. IMPORTANT READ CAREFULLY: This End User License Agreement (Agreement) is a legal and binding agreement between you (either an individual or a single entity) (you or your) and Armature Studio LLC (Owner). This Agreement sets the terms for your access, and/or use of Sports Scramble, an interactive game that is and remains, as between you and Owner, the sole and exclusive property of Owner, as well as any documentation and updates thereto provided by Owner (collectively, the Software).\n\n2. WHEN YOU LOG IN, INSTALL, ACCESS, OR OTHERWISE USE OR MAKE USE OF ANY PART OF THE SOFTWARE, YOU ARE CONSENTING TO BE BOUND BY, AND ARE BECOMING A PARTY TO THIS AGREEMENT. IF YOU DO NOT AGREE TO (OR CANNOT COMPLY WITH) ALL OF THE TERMS OF THIS AGREEMENT, YOU ARE NOT AUTHORIZED TO USE OR HAVE ANY LICENSE TO ANY PART OF THE SOFTWARE.\n\nWRITTEN APPROVAL OR CONSENT IS NOT A PREREQUISITE TO THE VALIDITY OR ENFORCEABILITY OF THIS AGREEMENT. IF THESE TERMS ARE CONSIDERED AN OFFER BY OWNER, ACCEPTANCE IS EXPRESSLY LIMITED TO THESE TERMS WHICH ARE NOT SUBJECT TO CHANGE WITHOUT THE EXPRESS WRITTEN CONSENT OF THE PRESIDENT OF OWNER.\n\nWHEN YOU LOG IN, INSTALL, ACCESS, OR OTHERWISE USE OR MAKE USE OF ANY PART OF THE SOFTWARE, YOU ARE REPRESENTING TO OWNER THAT YOU ARE OF LEGAL AGE TO ENTER INTO THIS AGREEMENT AND WILL FULLY COMPLY WITH ITS TERMS.\n\n3. GENERAL SOFTWARE LICENSE.\n\nThe Software is licensed, not sold. It is a material term of the license that the Software is intended solely for your personal non-commercial entertainment use. You are not permitted to sell, sublicense, share, or otherwise transfer rights to the Software to any third party. You may not, for example, and not in limitation, decompile, reverse engineer, or disassemble the Software, except as permitted by law. The Software, including, without limitation, all code, data structures, images, sounds, text, screens, interfaces, derivative works and all other elements of the Software may not be copied, shared resold, sublicensed, rented, leased, uploaded to any computer system and/or network, distributed (electronically or otherwise), or otherwise used except as expressly authorized hereunder. Owner retains all right, title and interest in and to the Software including all intellectual property rights embodied therein and derivatives thereof. As between you and Owner, the Software is and remains the exclusive property of Owner, and is licensed, not sold, to you for non-commercial entertainment use only as provided in this Agreement. All rights not expressly granted are reserved exclusively by Owner.\n\n4. LOGIN\n\nYou may establish a unique login and password that will be required for access and use of the Software. The login is personal to you and can not be shared. You are responsible for your login and use of the Software in accordance with this Agreement, whether such use is by you or by anyone using your login. Owner may cancel or restrict your login for any reason and will have no liability to you or to any third party for doing so.\n\n5. CONTINGENT LICENSE FEE\n\nThe license hereunder is granted in consideration of the purchase price of the Software.\n\nHowever, in the event the Software is used by you or by any third party with your authorization for any commercial purpose, you agree that you will pay Owner a one time license fee of one hundred thousand dollars ($100,000.00). This license fee is in addition to, and not in lieu, or other rights and remedies that may be available to Owner arising from your breach of the license in and to the software granted hereunder.\n\n6. YOUR CONDUCT WHEN INTERACTING WITH OTHER PLAYERS.\n\nYou are responsible for your conduct when interacting with others. As a material condition to being granted this license and being given access to the Software, you agree that you will not engage in conduct or communication (written, verbal, or nonverbal), either yourself, or by or through any avatar or alter ego, which:  is threatening, bullying, defamatory, abusive, obscene, pornographic, or which in any manner could give rise to any civil or criminal liability under applicable law;  could infringe or lead to infringement of any copyright, trademark, publicity or privacy right or any other personal or intellectual property right of any person or entity;  is or could be taken as threats, slurs, hate speech or attacks on individuals or group on the basis of race, color, gender, age, religion, national origin, sexual preferences, gender identity, or any other basis;  is a solicitation or advertisement for any commercial product or activity;  encourages or constitutes behavior that does not support a safe, welcoming, and comfortable environment for all users, which behavior includes but is not necessarily limited to bullying, vigilantism, engaging in any conduct or activity that is threatening, harmful, harassing, abusive, vulgar, hateful, defamatory, sexually explicit, inflammatory, profane, racially or ethnically objectionable, religious or political, or in any manner constitutes or encourages inappropriate, disrespectful, abusive, or unlawful conduct or otherwise makes the Software and the experience of enjoying the Software and the gameplay experience uncomfortable for anyone;  restricts, inhibits, or discourages any other user from enjoying the Software and the gameplay or any element, feature, or content of the Software;  violates any local, state, federal or international laws or gives rise to civil liability;  violates or infringes any rights of third parties (including but not limited to copyright, trademark, rights of privacy or publicity, defamation or any other proprietary right);  requests account login information from other players;  spoofs (using of any means to disguise your online identity or alter original attribute information);- uses or possesses programs to crack the Software or other Internet security tools. We may, at our sole discretion, immediately suspend or terminate your access to the Software should your conduct, in our sole determination, fail to conform to these standards.\n\n7. TERM AND TERMINATION\n\nThe license granted in this Agreement is effective until terminated hereunder. You may terminate the license at any time by notifying Owner in writing by email at: (add email address) and by removing any elements of the Software that reside in any form on your computer system(s). Owner may terminate the license granted herein immediately and without notice if you fail to comply with any term or condition of this Agreement. For example and not in limitation, the license granted herein will terminate automatically upon any breach of Section 3. Upon termination of the license for any reason, you shall immediately stop using the Software and shall destroy and remove from all computers, hard drives, networks, and other storage media all copies of the Software. Section 3 through 6, and Sections 8 through 12 shall survive termination of this Agreement.\n\n8. DISCLAIMER OF WARRANTY\n\nTHE SOFTWARE IS PROVIDED AS IS WITHOUT WARRANTIES OF ANY KIND. TO THE MAXIMUM EXTENT PERMITTED BY LAW, OWNER EXPRESSLY DISCLAIMS ALL WARRANTIES, INCLUDING WITHOUT LIMITATION, WARRANTIES OF CONTINUOUS PERFORMANCE, NONINFRINGEMENT, AND ANY IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE DISCLAIMER OF ALL WARRANTIES CONSTITUTES AN ESSENTIAL AND MATERIAL PART OF THIS AGREEMENT\n\nTHE ENTIRE RISK ARISING OUT OF THE USE OR PERFORMANCE OF THE SOFTWARE RESTS WITH YOU.\n\nIN NO EVENT WILL OWNER, ITS MEMBER(S), MANAGER(S), OFFICERS, DIRECTORS, AGENTS, AND/OR EMPLOYEES, BE LIABLE FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, SPECIAL, OR PUNITIVE DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, OPPORTUNITIES, OR OTHER PECUNIARY LOSS) ARISING OUT OF THIS AGREEMENT, THE LICENSE GRANTED HEREUNDER, THE SOFTWARE, AND/OR THE USE OF OR INABILITY TO USE THE SOFTWARE, EVEN IF OWNER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. BECAUSE SOME STATES/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\n9. INDEMNITY\n\nYou agree that Owner shall have no liability whatsoever for any use you make of the Software. You shall indemnify and hold harmless Owner from any third party claims, damages, liabilities, costs and fees (including reasonable attorney fees) arising from acts or omissions in connection with your use of the Software as well as claims that would not arise but for your failure to fully comply with any term of this Agreement.\n\n10. LIMITATION OF LIABILITY.\n\nUnder no circumstances and under no legal theory will Owners liability hereunder exceed one hundred dollars ($100.00)\n\n11. ASSIGNMENT; NO THIRD PARTY BENEFICIARIES\n\nThis Agreement is personal to you. You have no right to assign or otherwise transfer this Agreement and any action or conduct in violation of the foregoing shall be void and without effect. Owner expressly reserves the right to assign this Agreement and to delegate any of its obligations hereunder. The parties further intend that this Agreement is solely for the exclusive benefit of the parties and there are no third party beneficiaries hereunder.\n\n12. GENERAL\n\nThis Agreement represents the complete agreement concerning the subject matter between the parties and supersedes all prior agreements and representations between them. This Agreement may be amended only by a writing executed by both parties. If any provision of this Agreement is held to be unenforceable for any reason, such provision shall be reformed only to the extent necessary to make it enforceable. The failure of Owner to act with respect to a breach of this Agreement by You or others does not constitute a waiver and shall not limit Owners rights with respect to such breach or any subsequent breaches. This Agreement shall be governed by and construed under the State of Texas law (without regard to its conflicts of laws provisions) as such law applies to agreements between Texas residents entered into and to be performed within the State of Texas. The sole and exclusive jurisdiction and venue for actions arising under this Agreement shall be the State or federal courts located in Austin, TX. You hereby agree to service of process in accordance with the rules of such courts. The party prevailing in any dispute under this Agreement shall be entitled to its costs and legal fees.\n\nEach party recognizes and agrees that the warranty disclaimers and liability and remedy limitations in this Agreement are material bargained for bases of this Agreement and that they have been taken into account and reflected in determining the consideration to be given by each party under this Agreement and in the decision by each party to enter into this Agreement.\n\nQuestions concerning this Agreement should be sent to the address set forth below.\n\nAny notices or correspondences will only be effective if sent by prepaid Certified Mail, Return Receipt Requested, to such address.\n\n8310 N. Capital of Texas Hwy\n\nBuilding 2, Suite 100\n\nAustin, TX 78731\n\n13. COPYRIGHT AND TRADEMARK NOTICES\n\n Armature Studio LLC. All rights reserved.\n\nSports Scramble is a trademark (or registered trademark) of Armature Studio LLC. All rights reserved.\n\nPRIVACY POLICY/SUPPORT\n\n@2018 Armature Studio LLC. All Rights Reserved\n\nYou can opt out of Google Analytics tracking by clicking Here.", "Space Required": "1.16 GB"}



["5 stars\n50%\n4 stars\n29%\n3 stars\n9%\n2 stars\n4%\n1 star\n7%", "FilazaferJun 29 at 9:27 PM\nWorth the money, but missed opportunity\n\nThe Good: If this game was just tennis it would still be worth the $30. If you have a lot of room then it feels like you are playing real tennis. A great workout and lots of fun. The other sports are fun as well. Love the homerun derby challenges in baseball. I suggest buying the add on saber handles for the controllers that you can find online. Really adds to tennis and batting.\n\nThe Bad: It lets you play traditional tennis with just a tennis ball instead of the ball changing and that is a great option, but why, why, why isnt there an option to just play with other types of balls? Tennis with a birdie is a very different game. Baseball with a beach ball is very different. These would have been simple options to have and they would have added so much to replay value. A huge missed opportunity and really kind of baffling.\n\nIn tennis if you swing too hard the racquet flies out of your hand and it messes up your game. I dont get it, but it is a real bummer in an intense game.\n\nI couldnt find any online games in quick play which is unfortunate.\n\nBowling doesnt feel like real bowling as they dont even give you enough room to do a proper walk up as you will be walking thru the bell rack. I dont get that.\n\nThe games are sometimes slow to get going and there needs to be a skip for the instructions in things like challenges.\n\nOverall: Worth the money, but truly a bummer that you cant pick various balls in games.\n\nHelpful | 55", "BaileyFamily06Jul 28 at 8:51 PM\nYES\n\nthanks so much for adding\nthe ability to change from scramble to traditional! my favourite thing to do is tennis it's great and challenging. my only complaint is the number of sports. you could add vollyball, hockey(using joysticks). on baseball you could add the ability to switch between baseball and cricket. and on tennis you could add the ability to switch between tennis and badminton. but overall great game!\n\nHelpful | 9", "GaryE76Jun 11 at 4:11 AM\nFun game\n\nI wasnt sure if I would like this game, but I find myself coming back to it a lot. I used to pitch many moons ago and the first time I found myself on the mound in this game, I had some strong feelings of nostalgia. Sure the graphics are cartoonish, but being immersed in the game, getting to actually throw and my personal favorite, catching the ball all makes up for it. The feeling of catching the ball might be worth the price on its own. They nailed it. Tennis and bowling are fun too. If youre a traditionalist when it comes to these sports, you might hold off, but if you want to play a fun, entertaining VR sports game, I would recommend it.\n\nHelpful | 41", "Nick-_-25 days ago\nSome broken mechanics\n\nOverall fun game and has good challenges to play. Really fun with friends and family. 3 sports to choose from tennis, bowling, and baseball. You DO need a lot of room to play. Let me tell you some downfalls of the game tho. The computer system is absolutely unbalanced and horrible. When going for challenges baseball for example your computers vs the CPU (talking about outfielders) are in no comparison. You guys move slow and rng based. Taking this concept, its like that online. One game your outfields will hustle Olympic speed ever ball to get an out. Some games they will walk like they twisted both ankles and its a never ending inning. If someone pitches at your bat when you have a golden bat. It hits your hit box even if you dont swing and you get an out. Tennis and bowling have some problems like ball spinning on bowling or movement speed of these tennis players but its still not a bad game. Thanks for reading if you made it this far.\n\nHelpful | 3", "nicolebell928Jul 11 at 11:16 PM\nGreat game\n\nThis was one of my first games on vr and it is a great game, one you keep going back to over and over. I feel like it should be slightly cheaper though for what it is but thats just my opinion, would have given 5 stars if it was a little cheaper\n\nHelpful | 8", "CraigiscoolApr 17 at 10:52 AM\nGreat but...\n\nThis game is overall amazing with hitting a bowling ball with a fish, to playing tennis with a basketball. This game is just amazing for the whole family. Now what I dont like is how theres only 3 sports. (Bowling, basketball, tennis.) For a $30 game I would expect more like boxing, golf, etc. Maybe if this game was $15 dollars I would give it 5 stars. I still love all the current games but it would be better if there was more.\n\nHelpful | 351", "Bulldozer9818 days ago\nThis game deserves a higher rating score\n\nI delayed buying this game because the overall rating was hovering around 4. But this game should be at 4.5. It's excellent. The graphics are immersive. And the sports are engaging. So far, I feel like it's a bit \"too easy\" on me. But that may change as i progress. It is the only real tennis game on Quest right now. And it's simply fun to be able to switch rackets, balls, and conditions in such a whimsical yet immersive way. It does what VR. should: immerses you into another world, then breaks the rules ot make it fun. I hope the game continues to be updated with other sports. And I hope the sports are challenging so even people who play these sports in the real world can find some challenge in VR. This is the only game in the Quest store right now doing a decent job with tennis and baseball.\n\nHelpful | 2", "u_q6c4 days ago\nmy opinion\n\nyo this is actually really fun and cool the only thing i want if for them to add more sports to play\n\nHelpful | 1", "ParkBLunnJul 28 at 5:29 PM\nGreat game\n\nThis game is a fun game to play either scramble on and off. My one critic is to add more sports in the future like golf or knock out( because they cant do basketball because u will have to move.)\n\nHelpful | 0", "rogueatdy3 days ago\nGreat game!!!!!!!\n\nTennis is amazing and challenging. Although on hard tough to beat. Baseball is cool and bowling! If its the main game or the mini games its SOOOII worth it!\n\nHelpful | 0", "dulryckMay 25 at 9:30 AM\nLost dreams...\n\nI am giving 5 stars just for the fact this game gave me a taste of my long love baseball that I have not played since being disabled in the military.\n\nI know it is cartoon-like but they do the right things that connected the dots for my mind and I got this woosh of nostalgia of being on the field dreaming of the major leagues.\n\nI was literally tearing up like I saw a long lost friend that I thought had died and I would never see again.\n\nIf oculus reads these I would love an extended version of this baseball experience with a more realistic approach. A simple game of catch behind the garage, a practice game in the early morning light with the dew still on the grass, could even throw in the field of dreams park with the corn in the outfield.\n\nI could see a career mode where you start off in high school and get picked up by a scout, work your way through the minors and make your way to the majors.\n\nCould see the pitching different pitches by holding the trigger in different combinations and flicking your wrist differently.\n\nBatting the more physically accurate the better. If I hit the ball in on my hands I get a strong vibration and the ball pops up weakly. Maybe breaking the bat. If I hit the ball on the end of the bat, get an easy fly ball.\n\nCould play all positions. Use the analog stick or swing your arms like you are running to run to the ball. Button for slides and leaps.\n\nThis could be the chance for an amazing experience that could not only give broken people like me a chance to live a lifelong fantasy, but also a way to keep people active and fit.\n\nHelpful | 15", "Walrus15Apr 25 at 11:38 AM\nFun but confusing\n\nThis is one of the games that I first got on the quest because I have always wanted a good sports game in vr But this is a little confusing there is an option to turn off the scramble but in baseball you can not hit a home run with that but thats the only downside but overall this is a must have for the quest\n\nHelpful | 21", "LastTrueEvil10 days ago\nAwesome Time killer\n\nRecommend = baseball\nThe throw back from the catcher makes it feel so perfect. In a time of limited sports action, this is a breath of fresh cut turf.\n\nHelpful | 0", "chocolateyumJun 28 at 8:42 PM\nReally fun and worth every penny.\n\nSports scramble is a game that is super fun and has tremendous replay value. I'm not sure if it's just because of covid but I haven't had difficulties finding other players to match up with except during the most non-peak of hours.\n\nLike any other oculus exclusive, the graphics and controls are well polished. This game is definitely worth buying imo.\n\nHelpful | 3", "Zgamer198719 days ago\nGood game\n\nWorth the buy; would be nice to have had more sports to play; but not bad for what it is.\n\nHelpful | 1", "INDIESIDESMay 23 at 4:38 PM\nMixed feelings on this reflect score\n\nFirstly the negatives which unfortunately outweigh the positives. This is really more aimed at kids I feel. The delays between everything and repeating of commentary and terrible music make me just not want to bother playing it. It is a grind to get to do things and then change to another game or option. Just overall needs drastic improvement. Its expensive for what it is too. Considering it was one of my most wanted titles it really disappoints. Why cant I press a button and forward to serve in tennis or skip commentary. It would not take that much to fix this either. The scramble element just gets annoying too.\n\n\nI do love tennis, it doesnt quite work here though. Real shame. The difficulty levels are either too easy or hard and not enough variation. If you slice a serve its un-returnable most of the time. Trying to win some of the trophys is stupidly difficult and others way too easy. Mini games are not great either. The wait in between points and commentary is way to long as mentioned above but worth reiterating I think. So much potential wasted.\n\nThe bowling is good fun though, scramble adds variety, a good variety of mini games etc and the best by far. Its as if its not the same game at all.\n\nAlthough not played much baseball seems like it would be better than tennis too.\n\nLooking forward to some fixes for tennis as that is why I purchased this and will update my rating accordingly.\n\nHelpful | 16", "Initialhornet39Jul 12 at 8:59 PM\nPerfect for Completionist Players\n\nThe games concept is very simple, yet its very easy to get sucked in for hours on end. There are 60 achievements in the game, and a lot of them are very difficult to achieve. Its nice to see some challenge in a casual VR game like this one. I also love how you can invite friends into games. The multiplayer is smooth and doesnt feel that choppy. Only downside is that the AI difficulty is very annoying. In every sport, the only noticeable thing that changing difficulty does is make the balls the AI hits go faster. It feels too unfair and it makes playing on any difficulty other than standard feel like you arent playing against an actual person. The game is still great though, since I always play on standard anyway. Very much worth the price.\n\nHelpful | 0", "hansokarlssonMay 5 at 5:43 PM\nFinding friends only problem\n\nThis game is great for friends and family fun. My only gripe is that it is hard to find them in multiplayer. We tried yesterday with two Quests on the same local network. Does the game require Facebook friendship for this feature to work?\n\nHelpful | 12", "yeetboi20078 days ago\nTennis\n\nThe 6th challenge in tennis was made specifically for actual tennis players this game is garbage so I would like the developers to make all the challenges actually possible for people who do not play that sport\n\nHelpful | 0", "lovelegend08Jul 21 at 1:17 AM\nVery good game\n\nWorth the money and it was fun. I keep taking it to my grandparents so the Aldo can play. It was one of my first games after beat saber. But this was the funnest and i love sport so this game gets a 5/5 stars\n\nHelpful | 1", "OmniScott3 days ago\nLike the game but no one to play against\n\nLike the game in general. Wish there were more sports and every time I try to play multiplayer it can't find any players.\n\nHelpful | 0", "CBiddle1614 days ago\nA great workout and a challenging game\n\nThis app keeps me moving around and trying to earn challenge trophies. Entertaining for hours on end!\n\nHelpful | 0", "daniel.migotto23 days ago\nGood game\n\nIn general a very good game to occasionally come back to that you wont get sick of. Also very good game to show off your VR + fun multiplayer.\n\nHelpful | 0", "Mr.DILLIGAFJul 15 at 7:15 AM\nPricey, What Wii Sports Should Have Been\n\nIt takes the Wii Sports to the next level. Instead of tennis being just swinging at kind of the right time, the tennis requires moving slightly with your feet to the appropriate side and having your arm roughly in the right height and position. That's realistically as close as you'll get to playing the real sport in a 3D game.\n\nThe graphics are okay but still blocky like in Wii Sports (and over a decade old).\n\nIf this was $20 instead of $30 then I'd probably have no issue with it. As is, it's colorful and a whole lot of fun, but it's just not worth that price tag for 3 sports and upgraded Wii graphics.\n\nI also wish there was an option to play the sports pure. It would be fun to just bowl or play baseball without all the weird stuff.\n\nHelpful | 0", "GoovinGoovin69Jul 4 at 10:43 AM\nGreat Family Game\n\nIf you and another family member both have this game you wont be bored for hours!!! Me and my Brother have been playing this game and all the 3 of the game modes are unique and fun. Even if you have one Quest it is still fun to play solo or even take turns. This game is a the perfect Online Sport VR Game!!!!!!!\n\nHelpful | 0", "skipchicagoJul 11 at 5:58 PM\nNeeds an update\n\nHello all. I like this game and generally play it without scramble, but the scramble part can be fun. The big issue I have is with multi player. When my friend and I try to play its extremely difficult to get the connection. I can invite him and he gets a voice saying a game invitation was received, But theres nowhere for him to accept. The same thing happens to me. Theres nowhere for me to accept the game invitation. I just get a bright light and the game invitation voice, but I cant except it. If the developers would fix this problem, Id give it more stars. I play other multiplayer games and a game invitation usually pops up a note informing me of the invitation and allowing me to accept or decline. Thats definitely needed in this game.\n\nHelpful | 0", "rbarnesdafney7 days ago\nReal workout!\n\nMy favorite game! Real workout and lots of fun!\n\nHelpful | 0", "mr_ndJun 6 at 11:07 AM\n\nPretty cool set of of different sports games. Everyone will find someting interesting. Me personally dont care of baseball completely, indifferent to bowling and love tennis, so to me its 1.5 out of 3 :)\n\nGreat visuals, really nice and smooth animation. Believable physics in all three sports.\n\nAbility to switch off all fun modifiers is the best option for me. I like to play pure sports without fancy gear and weird ball substitutes but someone will def find this scramble stuff funny.\n\nThe only downside is pretty long blah blah and unnecessary pauses between games/sets/points. Too slow and rushing the games rhythm imho.\n\nOverall its a good set of funny mini games mixed with really nice and deep mechanics of pure tennis baseball and bowling. Not sure its worth $29.99 but if you see this game on sale - buy it immediately :)\n\nHelpful | 0", "Corky1961May 6 at 8:21 AM\nLove the game...\n\nThis is still my most played game. Ten pin is near perfect. Tennis is my most played game however I wished they gave me the option to change the colour of the tennis court. I never played on a blue court in my life, I would be more into it if they gave me a green court. Just a simple thing and then I would give it 5 stars.\n\nHelpful | 4", "Xentar13Mar 30 at 8:40 PM\nHilarious way to play sports!\n\nFun sports game to play with friends and family in mutiplayer mode. My only gripe is the price being too high for having only three types of available sports (Baseball, Bowling and Tennis). Hope the game will get future FREE updates to add more sports like Basketball, Pool, Volleyball, etc.\n\nHelpful | 18", "DG107Jul 18 at 4:26 PM\nFun but overpriced\n\nIt is fun but would be better if it was $20\n\nHelpful | 1", "fryguy224Jul 11 at 3:02 PM\nDanny F\n\nA lot of fun. The different bats and pitches makes it a challenge. There is nothing like hitting a grand slam with a fish. Especially fun when playing against friends.\n\nHelpful | 1", "friedeggrollApr 25 at 7:02 PM\nfun game, REALLY RECOMMEND!!\n\nhonest review, while being in quarantine i REALLY REALLY miss sports and this is so much fun to bring them back!! the one thing that annoys me though is that there are only 3 sports that you play: tennis, baseball, and bowling. if there were more sports i would give it 5 stars. overall i give this game an 8/10 since i really enjoy it! :)\n\nHelpful | 4", "Nanna42Jul 29 at 1:18 AM\nSports scramble\n\nBrilliant game,love all the games on it.well worth the money.\n\nHelpful | 0", "LOCO-TOTOJun 21 at 12:22 PM\nFun game but.....\n\nI mostly got this game for the tennis...\nWell i am a little disappointed....\nI was hoping to play a real tennis game but the max you can do is win 1 set.\nCan't go to the net....\nSo it's a great game for kids but if you are looking for something serious...\nWell this is not it....\nStill waiting for oculus to release a real tennis game on oculus.\n\nHelpful | 0", "ColethOfCambiaApr 8 at 5:27 PM\n\nI turn off most of the scramble elements (though they're cute for first time VRers), turn on traditional tennis serving and pro pitching style, and tennis/baseball are part of my exercise circuit during this pandemic! Developers might want to further highlight these more realistic aspects since the T-ball style of the out-of-box demo was originally a let down. I didn't realize you could change.\n\nHelpful | 17", "BigB0i99Jul 9 at 8:31 PM\nGreat Game\n\nI recommend this because it is easy to learn and enjoyable .\n\nHelpful | 0", "MaxTheCoolManFeb 10 at 9:04 PM\nCool game but..\n\nThe game currently has 3 sports, (tennis, bowling and baseball) and all are customizable, (the things that can be mixed up, amount of matches, and some more thing) but the game is a bit overpriced for a game with only three kinds of sports, wish there were some free/cheap DLCs to this so we could get some more games, but in general this is a really fun game that is really replayable.\n\nHelpful | 131", "godbarsJun 16 at 12:51 PM\nThey got 2/3 percent right\n\nTennis and bowling are great, I cant understand how they messed up so bad with baseball did they not test it enough or something? I started off doing an easy game against a cpu and it hit over 20 homeruns. When youre batting theyll be an assortment of balls and bats, the vast majority of which will be caught by an outfielder no matter how hard you hit it, especially with items like beach balls. When youre pitching despite there being targets with ball icons on them, the balls and bats never change except to give the cpu a stronger bat. The easy tennis and bowling cpus are actually pretty easy, so it makes no sense that the CPUs for baseball on your team always drop the ball or miss the catch, while the other team of CPUs make none of those mistakes. Seems like they figured out the mechanics then just decided it was good enough\n\nHelpful | 2", "ShezorayJun 26 at 12:33 AM\nAmazing\n\nThis is amazing I cant stop playing the tennis game I just wish there where more levels like professional.\nPlease please release a good professional tennis app on Quest as I just cant get enough. Thumbs up oculus.\n\nHelpful | 0", "hail2theking28May 25 at 1:56 PM\nAwesome\n\nGreat game! I have been holding off buying it due to the price,but now that own it and played all the sports,I can say it's worth it. I bought mostly for the tennis, but was surprised at how much I enjoyed the bowling. If your on the fence like I was, I would say just buy it already\n\nHelpful | 2", "Bubbles376621 days ago\n\nSuper fun\n\nHelpful | 0", "Gmoney8027Apr 25 at 11:03 PM\nREALLY FUN! But 30$ for only 3 sports\n\nThis game is really really fun. It has three sports Tennis, Bowling, and Baseball, which are all really fun! Its also very colorful and replay able, but sometimes I get bored of only the three sports. In my opinion this game should be either 20$ or 25$. If you could add either a free DLC or a cheep DLC. Other than that, I recommend this game if you like the three sports because its really fun.\n\nHelpful | 3", "lettucegyyMay 18 at 12:50 AM\nFun\n\nThis game is fun, thats for sure, but it only has 3 minigames and it gets bland after a while :(. If they were to add at least 2 or 3 more it would be a 5 star from me. The idea of the scramble is really good and entertaining though. Keeps the game from being too boring. If you have some free time to spare on your hands, give this game a download and play a couple games!\n\nHelpful | 0", "littlemanshrimp22 days ago\nThis sucks\n\nThis is not fun its very boring  and I WASTED 30 DOLLARS ON IT. I would like a refund and I suggest you not to buy it\n\nHelpful | 1", "april.wagner2May 21 at 3:44 PM\nAmazing game but has some issues\n\nThe game overall is amazing, great graphics, amazing gameplay, not alot of lag, and has alot of positive things about it, but, the intro is SO long, sometimes in tennis the racket has problems, but thats pretty much it for me, still the game is amazing and i love it\n\nHelpful | 0", "designbyshashaMay 14 at 3:26 PM\nLovely casual game, good multiplayer\n\nI absolutely love the tennis games, really hoping to see more challenges/modes added soon. Multiplayer is quite fun and can be a medium workout if you take it seriously. And of course we would love to see more sports, especially cricket for my Indian friends - I bet we would pay DLC for it too. Please Devs!\n\nHelpful | 0", "meduzoMay 27 at 2:48 PM\nPlease let me mute the announcer!\n\nThis game is awesome, the gameplay of all three games is flawless because of all the options it has (even if some of them are kind of hidden).\n\nBut I HATE the announcer, HATE HIM SOO MUCH! I want to mute him but my only two options are to either mute all game sounds, or mute the multiplayer voice chat. I find it super annoying that he just can't shut up: \"That's a Slice, THATS A SLICE, WHAT A SLICE\" I know it's a slice, there's a huge green trail behind the ball...\n\nAll the quirky comments saying \"you didn't see that coming\" makes the experience lackluster... if the announcer was not present I would play this game nonstop, but even when I win, I can't stand more than two games in a row...\n\nThis game deserves the 5 stars from gameplay alone, but the announcer takes 2 stars off the rating for me...\n\nIf you update the game to enable me to mute the announcer I will obviously change this review to a 5 star one.\n\nHelpful | 2", "calhan.laneMay 12 at 12:20 PM\nGood fun, not enough players\n\nGreat for a single player sports game but theres so little people playing multiplayer. Suppose this isnt a review on the game itself but dont bother if youre looking to play with other people only that arent friends. With friends, realllllllly good. But whos got friends?! We brought a headset to play in the virtual world!\n\nHelpful | 0", "sohappyJun 6 at 2:03 PM\nReally Fun\n\nI really like the game. It would be more appealing if there were more than 3 different games.\n\nHelpful | 2", "AyoungAPPAMay 8 at 12:55 PM\nGame is amazing, but...no online player\n\nIm really enjoying playing this game. Overall this game is great, but there is no online player I can play with. Ive tried to play multiplayer mode many times, but hasnt met anyone yet.\n\nHelpful | 3", "drraschJul 15 at 9:06 PM\nEmbarrassing for Oculus Studios\n\nMultiplayer baseball mislabels the players to the wrong team names on the scoreboard! Huge bug and super frustrating. Cant believe they a bug this huge go unfixed for so long and attach the Oculus name to this! This title has only THREE games and one of them doesnt even score correctly?\n\nAlso the game LITERALLY wont let you hit a home run in baseball ! How stupid is that??\n\nHelpful | 3", "Maverick0000006Jun 13 at 12:20 PM\nAwesome\n\nHonestly it is awesome but I wish there were more sports. It resembles wii sports but in a vr twist. I would highly recommend\n\nHelpful | 0", "Zeji2020May 9 at 4:29 AM\nGood game but disappointing physics\n\nThe game is overall pretty good but the physics is disappointing. Sensitivity to the angle and strength of a hit is low. The ball is also no longer intractable once touches the racket (so no holding the ball on the racket). Online multiplayer is also nonfunctional. Hope these problems can be improved!\n\nHelpful | 0", "Wes2256Apr 20 at 12:49 PM\nFun game\n\nLove playing tennis mostly because i can turn off the wacky stuff and play real tennis. I wish there was a way to save these changes for the next time instead of having to manually change every time.\n\nHelpful | 7", "BuddywudzynMay 27 at 7:57 PM\nMost fun since beat saber for quest\n\nIn terms of quest games, ive had the most fun with this second only to beat saber. Still loads of better games on PCVR if you have a computer and link up your headset but this is one of the best. That being said, it is too expensive so if youre on limited cash, i would say get beat saber instead\n\nHelpful | 0", "RoBudMay 27 at 8:30 PM\nAmazing fun\n\nI have been playing sports scramble demo since I got the Quest and love it. Finally, it was on sale on memorial day, 25% off, so it was a no brainer to get it.\n\nAbsolutely loved the tennis part. Did not care much about baseball or bowling. But spent several hours playing tennis at different levels.\n\nFor the price of a movie, had many more hours of Healthy fun. Sing how good it is, I would not have hesitated paying $30 just for tennis.\n\nUnfortunately, my forearms hurt from playing so much in the last 2 days but I cant stop playing. I may also have got a tiny bit of tennis elbow. And I cant stop. And I wasnt even a tennis player or a fan.\n\nSo remember this game can be so much fun, its addictive. If youre thinking about it, dont. Just buy it.\n\nHelpful | 1", "Vin1boyMay 30 at 7:21 AM\nAny wanna play\n\nAny wanna play add me?? This game is sick btw\n\nHelpful | 4", "beaupre.mathieuMay 9 at 8:19 AM\nLove playing with my dad\n\nThis game is really fun i convinced my dad to buy an oculus quest and this is the first game we played together its been a few weeks and we still love it.\n\nOne little thing is when playing baseball in multiplayer the names on the scoreboards seemed inverses. My dad and I were seeing opposite info.\n\nHelpful | 2", "WudixiaoguaiJun 20 at 11:49 AM\nWould you please cancel the intro\n\nThe intro is soooooo long, every time something crash I have to listen to the long intro again , make an option to skip, please!\n\nHelpful | 5", "janetann100Jun 19 at 2:55 PM\nFun game\n\nI do have fun playing this game. This is the first I've bought and it is a laugh. I think my favourite is the bowling alley. Love the changes of lane.\n\nHelpful | 0", "powney1991May 1 at 4:24 PM\nAlmost aced it!\n\nThere are three sports to choose from, bowling, baseball and tennis. Each of which have tutorials, challenges, single player and online multiplayer.\n\nThe concept behind each of these games is ingenious in the way in which it can create a lot of humour whereby it mixes up traditional tennis, bowling or baseball play with various surfaces, balls or rackets/equipment which are only activated if hit with a ball youre using. (For example hitting the box over the net in tennis to change yours or the opponents tennis racket to a golf club or something ridiculous like a giraffes head)\n\nTheres also a lot of colour in each sporting environment making it very easy on the eye to play.\n\nIve played a few matches now, mostly in multiplayer and I would give this game 5 stars if it wasnt for two things. Firstly I noticed when playing baseball the scores occasionally swap themselves around for each player which isnt ideal and need addressing and secondly I really do wish there was more people online. Playing multiplayer games on this title is super fun but sadly it never lasts long before you just end up waiting forever to link up with someone to play. At least in my experience anyway.\n\nOverall though a very good game and definitely recommend it.\n\nHelpful | 1", "KingHenry409Jul 8 at 8:48 PM\nGreat game\n\nI love sports scramble...period!\n\nHelpful | 0", "walkerismJun 18 at 5:10 PM\nCould be great\n\nMenus are awful but game play is good.\n\nHelpful | 0", "DonutandjavacopMay 19 at 4:47 PM\nFun games\n\nIts a real fun game but I wish there were more than three games.\n\nHelpful | 3", "King_Of_EgyptMar 27 at 2:32 PM\nAmazing\n\nIt is amazing game\nVery good graphics\nI enjoyed it sooooo much\nI just wish something\nI wish when I'm trying to find online match, I can play offline while the game trying to find online player and when it found someone gives me a notification with a choice to leave offline game to go to the online one\nIf you did that it will be the best game here\nThank you\n\nHelpful | 9", "transbenderMay 5 at 8:24 PM\nThis game is buggy as hell\n\nTo be honest, it was not worth $50AUD. There usnt much gameplay, it is buggy and \"rigged\" plus the added bonus of the super slow npc's. I timed it and the opponent took a minute to serve the ball this makes it infuriating in the timed challenges. This game is fun to play, I'm not denying that but if they fix these things then it might actually be a $50 game. This is probably a $30AUD game. Otherwise 5 stars. Also there are many mechanics that either aren't explianed properly, work when you don't want the to or are just plain useless. An example is the slice, it wont work with most of the bats and not only does it just give the ball to the opponent it activates at the worst times. Also the ball can be hit backwards accidentally or move around the ball. The rest of the games are fine.\n\nHelpful | 2", "lawlesslassMay 27 at 9:11 PM\nIts cute so far\n\nIts simple and basically easy. There is tennis, bowling and baseball....cute graphics ...All ages can play\n\nHelpful | 0", "jelwellMay 18 at 11:34 PM\nIt's like Wii Sports for VR\n\nIt's like Wii Sports but in VR. If you never played Wii Sports you are in for a super treat. A Five star game. But, if like me, youplayed Wii Sports over a decade ago - then you're wondering, did they add something new or novel to this game? The answer to that question is the scramble.\nIs the scramble interesting enough? Nah. I can't plan on having my tennis racket turn into a baseball bat, it's completely random. So it's not a skill based decision. Sure, I could miss the scramble but other than that it's out of my hands.\n\nIf you never played Wii Sports, buy this game, you'll love it.\nIf you have played Wii Sports, then pass on this one.\n\nHelpful | 1", "KillerRambo1616Apr 3 at 7:34 PM\nGreat game but few thimgs\n\nThe game is great! It has 3 sports (tennis, baseball, bowling). Graphics are good..\nRoom for improvement: needs more than 3 games, needs instead of multiplayer the ability for more than one to play. Hoping for some updates to come soon...\n\nHelpful | 3", "KingZurkothMay 25 at 12:09 PM\nNeeds hit box work, no real physics\n\nAt first I enjoyed the game (maybe I was just new to oculus as a whole) but playing a lot of this game really shows how flawed it truly is. Hop on easy mode , maybe do a few friend or online matches (if you can find one lol connecting is a joke in itself) and you will have a little fun and its enjoyable for a while , so you should purchase the game and have a great time if thats the case. Oh wait , if you want to challenge yourself and play pro matches using all the floor space you can for a good workout or realistic running back and forth , then expect your racket to not be there sometimes when making big swings, or when you are in a volley and you place a perfect back hand twice but the second goes out of bounds but you use the same swing and racket angle. The backhand hit box is laughable , and you better hope to the good lord himself you keep a racket as long as you can because once you get anything else (mainly the fish and golf club Ive seen are the worst) you will instantly turn from John McEnore to your middle school gym coach who hasnt hit a ball since his shoulder surgery that stopped him from making the French open. Id advise staying away , I wont ask for a refund because I did enjoy the early part of the game , but you have been warned.\n\nHelpful | 1", "Yankee_wit_no_brimApr 19 at 12:55 AM\nGreat game! Lots of replayability!\n\nIf you do not like bowling or tennis or baseball, you sure will after playing this. I wasnt keen on the sport bowling until I tried this. Its now my favourite VR activity. The physics of each ball are amazing! Hopefully an update to add another sport would arrive.\nThis game keeps you returning with challenges and online multiplayer. You get to collect trophies and view them in your very own trophy room! You also unlock different characters and character designs.\nIts a MUST HAVE for the quest!!!\n\nHelpful | 1", "Blackberry76Jun 1 at 7:21 AM\nLike But...\n\nI like playing it but I wish I could bypass that intro each time and go straight to multiplayer. It always thinks it is my first time playing. Such a nuisance. I also wish we could play four people at a time.\n\nHelpful | 1", "rowee270Feb 10 at 10:12 AM\nSolid game, lots of fun\n\nReally great game, with lots of replayability. Although there are only 3 sports, the scrambles and challenges as depth andreally keep gameplay interesting. I find myself spending more time on tennis than the other games so wish there were more challenges! My complaints are there being no one in multiplayer and the intros to each game take too long. It really needs a skip button to get straight to the action. Hearing the narrator say the same things gets old fast!\n\nHelpful | 18", "DAVIDGENEOHJun 17 at 8:34 PM\nCovid Smovid\n\nI can play with my friends on demand. No mask necessary.\n\nHelpful | 0", "mp3rdApr 27 at 5:53 PM\nGood game but unfair at times\n\nThis game is great but can be very unfair at times when playing tennis. Very hard to slice the ball too. Overall good game though\n\nHelpful | 2", "VirtuallyReallyMeApr 28 at 2:12 PM\nTennis great if it was more challenging.\n\nThis is a gentle workout but too easy even at the hard level for all 3 sports.There should be a higher level. Enjoyable anyway but best played without the scramble setting....novelty wears off quickly.\n\nHelpful | 1", "TheMeanAuntDec 14 at 9:56 AM\nLove it, but too much intro\n\nI really love this, it's fun, makes me laugh, and gets me moving. When you're playing tennis trying to hit a football with a clownfish, time just flies by! But... the intro is soooooooo long. Every time. I can understand it playing the first time you load the game, but every single time I load the game, I have to see the recommended button setting screen, long press a button, wait, long press the start button, wait, have the announcer pop up and welcome me to the game and tell me about the challenges I can play, wait until it finished its spiel, foldsits atm's and transforms back into a ball and flies away, then pick a game, and again get the ref telling me all about the game, and then I can finally play. So frustrating. I just want to load the game and play!\n\nHelpful | 365", "Faye326Mar 30 at 8:27 AM\nFun But Goofy\n\nLove playing the tennis game. Wish there was a game dedicated for just tennis lovers on Quest. Perfect Platform to do so. More people will probably buy A Quest just for that reason. Please bring a grown up Tennis game to Quest platform!!!!!\n\nHelpful | 10", "ralphaalpha325aMay 23 at 5:55 PM\nJust gonna point this out\n\nIn the description it says made exclusively for the untethered freedom of the oculus quest and its compatible with all headsets. Sowy its a rlly good game doe\n\nHelpful | 0", "EeveekittyJan 12 at 10:22 AM\nFun, but needs more sports\n\nThis game is fun and challenging and thank you for that, I just wish there were more sports other than bowling, baseball, and tennis. If you have so much balls and hitting stuff, why isnt there hockey, or table tennis, or even cricket? Why have the equipment but not the actual game? Thank you for this game, I enjoy it so.\n\nHelpful | 63", "chtoronto13 days ago\nFun and good workout\n\nOne of the best games available, entertaining, and it also gives you a little bit of a work out which we all need right now :-) graphics are amazing and its fun and absolutely the fact that you can play with multi players. You will not regret it ! happy\n\nHelpful | 0", "Pec64Apr 10 at 8:58 AM\nExcellent needs more events\n\nReally enjoying this game tennis, bowling and baseball all good but its really in need of more events. My biggest disappointment is I can never get a online multilayer game I don't no if a fault or there really is no one playing this game. If you haven't played it you really should\n\nHelpful | 1", "TySonic55Mar 13 at 4:44 AM\nNeeds more games\n\nI love sports scramble, its super Fun and Im glad I have it. But there should be more games. You have so many racquets or bats or balls or anything but you should add the games that all of those are from. I think every player would enjoy that and you would have a lot more players for multiplayer, which is also a problem people have. Overall, good game and very enjoyable!\n\nHelpful | 3", "petepete16May 3 at 6:59 PM\nBuggy\n\nEh, I like the premise but many aspects of it are frustrating.\n\nBaseball is probably the best mode of the game because its so stationary and simple. A lot of the crazy balls that you can use dont actually act any different than the regular ball, which is kind of a letdown. My biggest gripe is that they set up the batting area so close to the edge of my guardian that Im constantly seeing the warning signs. No matter how many times I try to use the re-center button to help, it keeps the stupid box in the same spot.\n\nTennis is a much more active game and because of that, there is even more of a need to be able to choose my center area within the guardian but again it wont let me. I hit my hand on the left wall within 5 minutes because of this issue.\n\nIts a decent tech demo, but thats about it. Dont bother spending the money.\n\nHelpful | 0", "kinyattaJun 5 at 12:23 PM\n\nOveralls, this is a great game! I just wish there were more sports added. Also, I'm still trying to learn the baseball game.\n\nHelpful | 1", "jennifershrvJun 13 at 5:24 PM\nAwesome\n\nVery fun\n\nHelpful | 0", "brysonmkeyMar 24 at 9:18 AM\nSo sad...it had so much potential :(\n\nI am so disappointed that I won't be able to play this with my kid unless I shell out another $30. I got this so he and I could play against each other. I had purchased it so that when he got his Oculus Quest for his birthday present we'd have a game we could play together on a shared account. Unfortunately, I didn't get to test this out with him until after the 20 day period so I'm out $30. For $30 and only 3 sports, it would have been worth it to be able to play with him but DEFINITELY not without multiplayer on the same account. It seems more like a kid's game so I'm not going to play it unless I can play with him. So sad because it had so much potential to be a great family game and looks really fun.\n\nHelpful | 8\nDeveloper ResponseMar 24 at 10:00 AM\n\nHello Brysonmkey, We're sorry you've had a bad experience with Sports Scramble, Please send in a ticket to our CS line at support@armature.zendesk.com. ~The Armature Team.", "Brayden4588Mar 24 at 2:45 PM\nIt is a great game needs more sports\n\nOverall the game is fun and great. I love to play it and so does my family. I just wish there were more options of sports and I realize some sports you have to move but they could add golf where you just automatically move to you ball. Like I said it is a great game and it deserves 5 stars but I have it 4 because it is need more stuff\n\nHelpful | 1", "KernalMcNuggetApr 26 at 12:13 PM\nScreen Door effect\n\nThe game is great, sort of expensive, but the biggest issue for me, is that this is the only game that I see the screen door effect\n\nHelpful | 1", "Crazyfur15 days ago\nA great game but...\n\nIts an amazing game! But when I opened it up on my Quest and went to multiplayer, it said I had no internet connection. So I exited the game but when I went to check what was wrong, it would glitch when I tried to turn my head. Then when I checked my internet, it said it was on and working. All sorts of glitches would happen and I was so confused. I was really sad because I love this game.\n\nHelpful | 0", "kjmsu1998May 11 at 4:17 PM\nGreat game.....\n\nI love the wackiness involved in the 3 sports, just wish it had more than 3. Add something like the Kinect sports has like track an field or golf.\n\nHelpful | 0", "chendrick2000Mar 19 at 12:27 PM\nAmazing Game but one problem\n\nThis game is awesome but there is only one problem. There should be more games, the three games are fun but do get boring after have it for a while. This game would but amazing if they added another sport or more options for the other sports.\n\nHelpful | 2", "bakosergeJun 2 at 5:38 PM\nBrillant\n\nI love it. Nice game and fun.\n\nHelpful | 0", "luolin61Apr 4 at 6:40 AM\n3 great games!\n\nFirst of all, if I like an app, I usually give it a 5 star rating. I know, a bit of inflation. I like the tennis specifically, and a like the challenge of hitting against the wall. I used to go to my elementary school and hit tennis balls against the brick wall. So I had that going for me in nostalgia. I am not that good at bowling and I have the same throw as a did in the real game. And baseball is great. Catching the ball from from the catcher feels real.\nI havent figured out all the settings yet and will update. I cannot figure out the bowling setting where I want the toughest opponent (cpu) and then the cpu will not bowl over a hundred. I thought I had it set up correctly. So I think there are two areas to set these games up and I think that is a bit convoluted.\nThe graphics are great, I am not a kid though so I can do without all that.\nI know some people complained about the price or not enough sports. I look at it for about $10 per sport. Thats ok. Maybe the devs can have in app purchases and add another game for a nice price, maybe basketball?\n\nHelpful | 1", "TripleBWIApr 4 at 8:26 AM\nGreat customizable fun\n\nThis was one of the first games I bought last May. It has been off and on a lot of fun to play. What I like is it can be as somewhat real as you want or as the name suggests, as scrambled as you want. The only thing I wish it had was a way to add different profiles as I am a southpaw and the rest of the family that uses the Quest are righties.\n\nOverall this game is a good amount of fun for the cost and I would love to see some more in-game development!\n\nHelpful | 1", "Joe_schmuckApr 14 at 9:17 PM\nFun but not enough content\n\nI love to play this game but it's not enough content to warrant the thirty dollar price,there are only three sports and the scramble and normal modes are fun but they are pretty short and are not compelling enough to play to get new trophies,the CPUs and intros can take a while,and not because of slow internet or anything ,the challenges are fun but I'm not interested enough to unlock them (same with the trophies),if this was a pack in title like Wii sports or something it would be fun enough but the price is not worth content that's short and has not a lot of replay value\n\nHelpful | 1", "Smokey9000Apr 6 at 6:43 PM\nLove it\n\nThis is my favorite sports game. The AI can be tough but it does a good job of matching level. Love the concept. I play this often. Could do with a skip the cheesy dialogue button though.\n\nHelpful | 1", "Maddocwaits3 days ago\nGood game but\n\nGood game I just think there should be more sports maybe table tennis, or Beer pong.\n\nHelpful | 0", "Big-Shrimp-Apr 9 at 12:40 PM\nNeeds more sports\n\nThe game content is great and funny to play with friends. Just they need to add more sports to be able to play inside the game. Overall good game just need more to do.\n\nHelpful | 0", "wag1mysonApr 27 at 1:11 PM\nGOOD FUN\n\nReminds me of the Wii, it is good updated version, using different objects makes you think. Definitely worth buying,.always something to go back and play again and again\n\nHelpful | 0", "mrb.jmbMay 11 at 11:30 AM\nMOOSE BANANA\n\nGORILLA OHOHOHOOHHOHO\n\nHelpful | 1", "KevcopoApr 7 at 5:55 PM\nOk\n\nIve played for around an hour and Im underwhelmed by the amount you can do. I wish in baseball you could catch the outs (an example of how to add dimension to the game). Its very basic and while the concept it fun I wish I didnt spend this much on it. Worth around $15 at best\n\nHelpful | 1", "MiniWhopperJrApr 1 at 6:37 PM\nGreat sports game\n\nSports Scramble really does a great job scrambling the tired and over done sports games of the past. Sometimes the game(or console) doesnt register a swing, not too often though.\n\nHelpful | 1", "VRMatrixMDMay 18 at 4:34 AM\nFun for everyone\n\nAccessible and fun. Everyone can enjoy this.\n\nHelpful | 0", "Evasen.ArcharyFeb 26 at 9:58 AM\nGreat Game\n\nI love this game. My only recommendation is that I would like more options for baseball and tennis playing in traditional mode like being able to play with a pro racquet in traditional tennis and a metal baseball bat option playing in traditional baseball mode. Also please make a cricket game!!!\n\nHelpful | 4", "RocFlanaganJan 25 at 2:05 PM\nlots of fun\n\nIt's a well done homage in style to the WII sports games. Which is great need more of that aren't a variation of playing with a light saber or target practice. This game could use more sporting events, Tennis, Baseball and bowling are nice. but 2 or 3 more sports would have added to the replayability. Hopefully, they are making additional game similar in style that focus on a different set of games. Also, do we really need to click start after launching the game, can it just go to the platform?\n\nHelpful | 6", "Evilninjaelf43Feb 25 at 12:07 AM\nSuperfun! Immersive. My arm hurts...lol\n\nI had only played the demo and wasn't sure if I wanted it without knowing what the other games were like. There are only 3 Tennis, Baseball and Bowling. But I am glad I have it. It kind of reminds me of Wii Sports but now it is 3D. And I am bowling with a wheel of cheese. My arm hurts from trying to play some tennis like it was real. Someone mentioned the long intro. You can turn it off in the settings. But having only played it for a short while It was a lot of fun and family friendly for showing off your Quest. I think they actually spent some time optimizing it for the Quest user so it makes it a much better experience. I hope they will add other games in the future.\n\nHelpful | 4", "TeddybearthugJan 24 at 2:59 PM\nAlright game that needs improvements\n\nUpdating review due to feedback. Will try those options out.\n\nTried the demo and liked it enough to buy. The power ups make it interesting enough to play but havent gotten a chance to play any mode other than tennis.\n\n\nWill there be any update to these two items?\n\nIt is also slow when you try to play with friends and invite them to your game.\n\nAlso unless my friend is on, I cannot find a match in multiplayer. No one seems to be on for multiplayer.\n\nAnother flawed design is it also makes you pick 2 games for multiplayer when you only want to play 1.\n\nHelpful | 7\nDeveloper ResponseJan 24 at 1:13 PM\n\nHello Teddybearthug, In order to skip the intro after the first launch, go into settings > Extras > and select Quick Start. Also, as you earn trophies in the game, you will unlock different Avatars, and Skin and Hair colors. ~The Armature Team", "emrikgrudJan 1 at 3:24 PM\nA lot of fun but a bit overpriced\n\nSport scramble is a perfect game if you are into arcade style games and its a good workout too. The tennis game mode is the most fun in my opinion although baseball and bowling are also good.\n\nOne thing that annoys me is the fact that the intro is so long and its unskippable so you have to wait through it every time you start the game.\nThe designated play area is unmovable for me and it can be a bit annoying not being able to center your play area\n\n\n30$ is a little expensive. I would say 25 fits it better\n\nIf you dont really care about those extra 5 bucks this game is a must have. Overall good experience and fun for the whole family\n\nHelpful | 20", "dnna2610Apr 16 at 7:17 PM\nLove it\n\nI spend a lot of time playing the baseball game, so fun. Hope they can add more stuffs later.\n\nHelpful | 1", "SterohoApr 29 at 4:38 PM\nA must have for the oculus\n\nNot your average sports game. Imagine if you mixed and mashed up different wii sports games. Now imagine theyre in vr.\n\nHelpful | 1", "TheDestroyer3113Mar 28 at 11:59 AM\n\nIt was fun to try out all its options and the mechanics are great I would recommend this to anyone because I get sick and this does not make you sick and has lots of content enjoy\n\nHelpful | 1", "smsme2222Apr 20 at 10:27 PM\nExcellent game! You can never get board\n\nThis game in amazing. You can never get board the graphics are fantastic and I highly recommend this one for the kids as it provides hours of fun!\n\nHelpful | 0", "MikeAndTheMouseMar 4 at 6:39 PM\nGreat fun!\n\nI was very happy to see this title go free late last week. I liked the demo, but was hesitant to spend the money, because I wasnt sure how many different types of games were on there. I am extremely pleased with this game, and probably wouldve felt it was worth the money spent. But glad I got it for free! I think I like the bowling the best. Great job gang!\n\n\nHelpful | 1", "generalgauJul 23 at 10:03 AM\nLove this game\n\nMe and my kiddo have been playing this for a couple days now. Super fun game. Not serious obviously, cartoon graphics and funny premise - but game play is awesome.\n\nHelpful | 0", "HfieldsMar 25 at 1:49 PM\nVery good but...\n\nThe game is very good, very easy to pick up and also easy to play with friends. But there are only 3 games so far. They did do very well on the games they do have so far.\n\nHelpful | 0", "boris_belovApr 10 at 11:34 AM\nGreat Game\n\nAmazing game but I would like to see more sports. Maybe Golf or something else.\n\nHelpful | 1", "wMartialwMay 17 at 4:56 PM\nNeeds improvement\n\nGame is too repetitive with only bowling, baseball, and tennis. You get bored of it real quick.\n\nHelpful | 0", "fishi21Feb 11 at 11:18 AM\nIt needs a bit more content\n\nI love this game I find it amazing I find the graphics are adorable and I think that it needs more then 3 sports so I may as well give the producers some ideas fencing, basketball, table tennis, darts so I will be very happy if you make these sports\n\nHelpful | 3", "linkinprkmxFeb 4 at 5:02 AM\nLove this game, should be options\n\nI really enjoy playing this game, makes me sweet is good fitness game, but I am sure the developer can add a function to turn off the intros, as we play more of this fantastic title, this one has 3 games, tennis, bowling, and beisbol, that is fine I am guessing it can be room for more, the price is ok but not many people are getting the game for the games with friends, so that part of the game is unplayable yet, might be an option in the future, but right now no one is opening that option, maybe making a version of the game to let other people demo on the version and play on to that area of the game, but I am guessing the developer already moved in to newer stuff.\n\nHelpful | 3", "Mark-BlissMar 9 at 8:28 AM\nDont buy\n\nThis game is a real mess. It can be fun when it works but there is so many problems getting friends invited. You invite them and it says connection lost over and over. Out of about 50 times in a few days trying to connect it only worked maybe 5 times. The announcer at the beginning babbles on for so long its frustration. Same thing over and over. Load time and announcer time is ridiculous. I had written a review earlier complaining about scramble mode then I realized I could turn it off. Scramble mode in bowling can be fun but on the lane change version only. For the most part its a decent game if they could just work out the bugs. In order to invite a friend you have to start over many times and still get a connection lost screen. Restarting the headset gets old fast. We have attempted to connect as long as 15 minutes and then gave up. Many times you will be taken out of the game and a screen comes up saying your opponent has left the game and they get the same message when youre both there. Its a good game with serious connection flaws.\n\nHelpful | 5\nDeveloper ResponseMar 9 at 4:50 AM\n\nHello Mark-Bliss, For the connection lost issue, have both players try restarting their headsets, and for the long announcer dialog, you can turn that off after listening to it the first time be going into the extras menu in the options and selecting \"Quick Start\". You can also toggle the scramble options on or off during the setup of each game if you do not want to play with them. ~The Armature Team.", "matthew.chan.71210 days ago\nNeeds more sports\n\nFun but needs more sports , something like fencing would be really awesome( wouldn't mind paying a dlc for more sports)\n\nHelpful | 5", "sevenlocksMar 30 at 4:21 PM\nFun stuff\n\nSports scramble is a great casual game. It was one of our first games for our oculus and it remains one of our favorites.\n\nHelpful | 2", "GilManeaJul 14 at 10:53 AM\nNice Game\n\nThe Game is better than demo!\nPrice is a little bit to high.\n\nHelpful | 0", "RockSocksFeb 18 at 6:03 PM\nGood game to start off with.\n\nIve only played an hour of this game so I dont have a full view of the game, but the game so far is pretty good. The achievement system lets have something to work towards instead of this just being more of an experience of a few sports. Its an online game so you dont need another headset and someone else to play with, and you can always play with computers. There are only three games though; tennis, bowling, and baseball. All of these experiences are fantastic, but I wish we got a few more sports to play. But overall, definitely worth the $30 if you have the money for it, and its also great for beginners of VR, as its not too intense of a game.\n\nHelpful | 0", "oVer_RatedMar 15 at 1:11 PM\nThumbs up\n\nAbsolute amazing game maybe needs some new sports but other than that great job\n\nHelpful | 2", "AimathyMar 21 at 5:11 PM\nMultiplayer rarely works\n\nWe have nothing but trouble playing in the multiplayer area and usually just give up. It is very glitchy and we have excellent fiber optic WIFI.\n\nHelpful | 6", "quirkityyMar 1 at 10:11 PM\nAwesome!\n\nThe only problem, well the two problems is that, 1. I lose tracking a lot, and 2. Not many sports, I really want them to add a football game where you can throw something random. But overall it is a really good game! BUY IT!\n\nHelpful | 2", "shashking404May 25 at 10:31 AM\nGod this game is Slow. Needs SKIP button\n\nThe presentation is good but it is so slow. The opponents have Second Thoughts before serving the ball. The Host globe thing animation eats away my precious time.\nGames like Pistol Whip and Beat Saber are pick up and play because they don't have this animation nonsense.\nEVERYTHING about the third have is designed to be slow, the selecting of buttons is by Holding down the button to fill a meter, wow, i wasted half a minute going through 3 screens holding down a button to fill a meter to tell the game that i REALLY DEADLY want to select the only button present in the screen to go to next screen...this is bad pacing in 2020\nI would like that More games are included to the list but first deva sould fix the delay within between screens, all winning screens animations should be skipped by pressing any button. All these animations and winning screens should be skippable with a button - any button\n\nHelpful | 3", "shoken2020Apr 6 at 3:01 PM\nExciting and challenging...\n\nA twist from the original sports as we know them. Great app/game to buy, just wished there were more games...\n\nHelpful | 0", "Auckey702Feb 27 at 6:50 PM\nGreat Game but...\n\nI love this game so much and I really love the multiplayer and challenge mode but... I cant seem to figure out the menu. You are supposed to point and the option you selected pops up. For me however, I cant figure out where to point to make it pop up consistently. I either wave my controller around until it comes up or I hold my controller there for a while until it pops. Developers please make this easier or tell me how to do this. Thank you.\n\nHelpful | 0\nDeveloper ResponseFeb 28 at 9:58 AM\n\nHello Auckey702, The Menus in the main sports complex are operated by looking at the beacon above each stadium, simply turning your head and aligning it with the beacon should display the pop-out menu. ~The Armature Team.", "tresmonkeysApr 23 at 6:39 AM\nTennis\n\nOur favorite\n\nHelpful | 0", "vrfamily118Jul 14 at 8:34 AM\nSooooo fun\n\nI just got this yesterday and have only played the demo but is still so much fun\n\nHelpful | 0", "Chonster-Jun 5 at 11:54 AM\nGreat\n\nI would have rated 5 stars, but my controllers randomly would glitch out, and i would miss a swing. Nothing like this happens to me in beat saber or super hot, or anything like that. Otherwise, great game and theres the baseball challenge 2 that is very hard to do\n\nHelpful | 0", "MarkyB911Mar 8 at 10:58 AM\nVery fun!\n\nVery fun. Too much talking before games. Hopefully will be updated with more games like archery and skeet shooting among other events.\n\nHelpful | 1", "snandacaJul 2 at 11:24 AM\nAwesome needs more games\n\nGreat games but needs more than 3 games for $30\n\nHelpful | 0", "ashman257Mar 14 at 2:36 PM\nWay to long intro\n\nThe game is really fun and is a good way to spend your free time, but the intro needs to be cut down\n\nHelpful | 1", "NuhbhadiiMar 24 at 7:48 PM\nGreat game but..\n\nOnly 3 sports? Wii sports had a better line up.\n\nHelpful | 0", "Twizzle75Mar 17 at 9:07 PM\nIt cool I guess\n\nIs cool but it needs more sports like basketball football soccer and more\n\nHelpful | 1", "CompleteMemeMar 17 at 6:29 AM\nIts a Very Smooth and Fun Game!\n\nThe game is smooth and all the sports are really fun! The multiplayer isnt laggy, and it is super easy to join your friends. Overall and amazing game for someone looking for some fun.\n\nHelpful | 1", "ken.hutchJan 30 at 11:55 AM\nBad Physics\n\nI am not a Pro bowler, or Pro Tennis player, or a Pro Baseball player, but I do play them all. I typically bowl between 180-220, I played tennis is high school and the Navy, and I have always played baseball.\n\nThe bowling on this game seems to be inconsistent and does not read power or spin correctly. Spins either barely work, or they work to much. While there is a connection in real bowling between speed and the spins effect (the curvature), this game either under or over exaggerates that effect 90% of the time.\n\nThe baseball seems random in the hitting direction. Early swings should go left for right handed batters...but it does not seem to matter. Early swings can go right, straight, or left. I am not sure if this is even being measured and used in this game.\n\nThe tennis also has a problem with direction and rarely if ever allows you to hit the ball away from where your opponent is standing.\n\nDont even get me started on the stupid 'scrambled' part of this game. I never play with that stuff turned on, I just play with the basic settings of no ball changes or lane changes or racquet changes.\n\nHelpful | 4", "JellyfishManiacMar 13 at 8:00 PM\nPlenty fun game.\n\nIt is plenty fun. Maybe more sports? Seemed like something was missing. How about golf?\n\nHelpful | 1", "EC4Mar 16 at 4:28 PM\nGreat game to launch with\n\nFun, easy, simple to figure out and can get harder the further you get. I wish you could play without the scramble of you so chose. Otherwise great game.\n\nHelpful | 0", "abelunicornioMar 17 at 11:59 AM\nMultiplayer issues\n\nI like this game . But its frustrating how hard its to play online . Im always get a connection fail message when trying to play a multiplayer match although I can play other multiplayer games.\n\nHelpful | 0", "ChalkyPuma23Mar 31 at 5:12 PM\ngud\n\nit gud\n\nHelpful | 2", "Da_Bear_F11Mar 30 at 6:02 PM\nGood\n\nGood\n\nHelpful | 2", "jaydegeerFeb 12 at 8:33 PM\nLove it, they fixed the issue by the way\n\nSo I played the demo and couldn't resist to get the full game, I read the reviews and was kind of scared reading how long the intro was...but I ordered it anyhow and rolled the dice. Let me first tell you I am super happy I did. So they fixed the beginning or long wait everytime everyone was talking about, I mean you have to sit through the opening once...(not a big deal) so I immediately wemt through the instructions on baseball which I suggest then played a game of baseball and loved it, been busy with that, will update later on bowling and tennis but I'm very sure I'll be impressed, I like the fact you can either switch up the balls,bats for a fun game or just play regular baseball with a ball and bat and pick how many innings difficulty etc... Once I went back to play a game today the introduction was fast and I was able to have an option to play right away or review the first introductions I went through. All in all it's worth the bucks to me. Haven't played multi so I'll be updating this later once that and other games are played. But to be honest I'm already impressed. Thanks for the fun game gamemakers. I'll gladly add this game to my collection.\n\nHelpful | 3", "Powersr033Feb 14 at 11:13 AM\nSooooo fun\n\nIt has sorts that in general are very fun to play with scramble. You can test just do quick play with scrambling and if you want remove the scramble and just play the sport. The challenge and training modes for each sport are also entertaining, and keeping track of trophies is a good challenge.\n\nHelpful | 0", "tim.pinkard.5Feb 6 at 8:49 PM\nLiked, good replay ability\n\nGood fun game, only problem is hard to find opponents to play online. Like that you can play standard games without fish for bats etc.. would be much better if more people online playing but single player plenty of fun.\n\nHelpful | 2", "GravityMxNov 30 at 3:27 PM\nAwesome gameplay!\n\n-Summary-\nSports Scramble is a fun collection of sport games that has been remixed by mixing Sports together. The threes sports are tennis, bowling and baseball. And for each of the sports they come with remotes, training, quickplay and challenge mode. The game also has online multiplayer as well as an achievement system.\n\n-Here are my thoughts-\n\n-What it did well-\nThe game is equipped with Stellar gameplay. All of the different sports are simple and fun while also being very accurate. If you go into the options on the main menu, you will find an option to turn on basic, traditional or Pro mode. And while I find it very strange that these still apply during challenge mode, they allow players of all skill levels to enjoy this great game. I especially love to play quick matches of tennis with Pro mode on in a large play space because of how active you are when playing and how realistic it feels. (I play a lot of tennis in real life). In addition to the game's great gameplay, the game is paired with some very nice looking graphics. (For the quest) the whole game looks bright and colorful with lots of movement which is a nice contrast as a lot of games on the Oculus Quest usually have fairly static settings.\n\n-What it could have done better-\nIn my personal opinion, the game has two main issues. Multiplayer and content.\n\nStarting with talking about the multiplayer, I have only played multiplayer with three people total. This is because no one seems to ever be online. And while this does have a lot to do with how many people on the game, I still feel like they should have some way to notify players when someone is playing the game as well. What if anytime another player started up Sports scramble at the at the same time as you, both players would get notified of each other. That way you could play sport scramble solo until someone else joins. Or, maybe they could do what the game wands does and it set up an event calendar. Once a month they could have some kind of scramble tournament, maybe with in game notifications and an in-game sign up to ensure players attend.\n\nAnd second is content. So, when I say content, I I am referring to any kind of progression or things you inquire as you play more. This game has a Mode called challenge mode. In this mode, you complete challenges one after the other. I found some of these to be the highlights of my experience. But, these moments are cut short buy a few of the challenges where you just play a quick match with a pre-set difficulty. He's kind of killed the fun for me. When I'm able to consistently when against CPUs and quick matches on hard, it becomes such a drag to be forced to play on easy mode, it feels like everything moves in slow motion. I feel like the missions should be organized like a mission tree, rather than a mission checklist. I kind of have a similar issue with training mode as well, rather than letting you pick what you want to train to do from the very start, I have to first learn how to hit a ball forehand, then backhand, then t-ball serve, then traditional serve, until I finally get to the lesson where I learn how to hit a slice. But even with all of those changes, I still do not feel like it would be enough to save it from the fact that the game has a low amount of content all around. This wouldn't be an issue if the game had good multiplayer, but that isn't the case. I actually think that if the game had more stuff to keep the players in the game, then the game would have better multiplayer as well.\n\n-My wishlist for the game-\nIt would be nice if the game had some kind of randomize challenge structure. They could just be quick matches but with random changes, maybe you would play tennis, but it would be in the challenge mode Arena and the net is always up. Or mabey bowling but you play in a new environment and you can only use the shuffle board slider. The combination possibilities are endless, so you could just randomize them. And maybe the players could earn some kind of in-game currency from doing these challenges like scramble tokens. And mabey you can use those tokens to use a big prize capsule machine that could get maybe some small aesthetic changes to some of the arenas, rakets, balls, etc. They wouldn't have to be very big, just big enough to be fun and satisfying to attain. In the randomness of it all would only add to the excitement.\n\n-My conclusion-\nOverall, Sports scramble is for anyone who wants fun and exciting experience inside a colorful and vibrant package.\n\nHelpful | 12", "SammyTheKatNov 7 at 12:03 AM\nGreat pick up game\n\nI loved the demo so much that I actually shelled out the quiche for the full game. After that I was a little disappointed that it was only three games, and the bowling game doesn't really resemble a bowling game...the baseball takes a little bit to get used to, but all in all it's a four and five for sure. If they decide to and other sports later on down the line it's totally worth it.\n\nHelpful | 68", "elmacho28Mar 31 at 10:09 AM\nGreat game\n\nGreat game for the family. Hope they add more options\n\nHelpful | 1", "Spikey_MikeyJan 23 at 3:25 PM\nLet this review speak for itself.\n\nThe demo of this game was probably the most fun Ive ever had in a demo. I bought this $30 game thinking I would actually get some decent gameplay, but instead I found the exact same game except with two more game modes that are literally no fun. The tracking is garbage, and there are no added items or anything besides the bowling mode. I know they were going for goofy sports game, but this was just downright awful. I tried to get myself to like it, but in the process realized two things: 1. I blew the timespan I had to refund it, and 2. This game is garbage. Thats all I have to say, and I DO NOT RECOMMEND unless you love wasting money, or are just downright stupid.\n\nHelpful | 9\nDeveloper ResponseJan 20 at 4:52 AM\n\nHello Spikey_Mikey, We're sorry you did not enjoy Sports Scramble, if you would like to request a refund, you may do so by following this link. https://tickets.oculusvr.com/hc/en-us/requests/new ~The Armatue Team.", "jsivonenMar 4 at 2:06 AM\nMake it possible to skip intros etc\n\nFun, but I don't want to waste my time and battery to wait EVERY TIME these intros, cutscenes etc... Make it FAST to jump into the game itself!\n\nThat's the sole reason my kid plays Vacation and Job Simulator every time instead of this game.\n\nHelpful | 1\nDeveloper ResponseMar 9 at 4:51 AM\n\nHello Jsivonen, You can disable the announcer by going into the Extras Menu in the options and selecting Quick Start. ~The Armature Team.", "iFEARTHISiMar 15 at 9:41 PM\nIt fu!!ing sucks\n\nThe game is horrible I want a refund its just bad who can ever like this game its soo glitchy every time you try to hit the dam!ball with any thing the dam!\nball goes through the Rakit\n\noculus\n\ndeclined me refund I want a refund\n\nHelpful | 1", "Benclan000Mar 14 at 12:16 AM\nNot too many sports\n\nThis game is really fun and all, but there isnt that much content. There are only 3 sports and they are kind of basic. Can you please update the game so that there are more sports? Thanks.\n\nHelpful | 0", "darwins.lastApr 23 at 10:14 PM\nVery Fun\n\nWell made. Fun to play.\n\nHelpful | 0", "NebbiaNeraFeb 21 at 4:34 PM\nNice\n\nNice but I do prefer standard sport. I don't like too much hit tennis balls with fish or so...\nBut the game itself is nice to play.\n\nHelpful | 1", "paul.scullyJul 6 at 7:16 AM\nSports scramble\n\nExcellent game very addictive and a great workout\n\nHelpful | 0", "AlynnfarrellyFeb 25 at 6:45 PM\nGreat family game!\n\nGreatly enjoyed playing baseball and bowling w/my 13yo and 11yo sons. Excellent fun, quirkiness for the whole family.\n\nHelpful | 0", "TrinircmodelsFeb 24 at 5:01 PM\nAwesomeness\n\nThis game is so much fun especially for workout  I use Yur app to track calories burn it work great baby rn like 400 calories every day \n\nHelpful | 1", "cphillips76Apr 17 at 12:24 PM\nSports scramble\n\nAll I get is a black screen, want my money back.\n\nHelpful | 0", "Beastry11Jan 11 at 4:51 AM\nReally fun bad online\n\nThis game is a great game and I think everyone should have it with beet saber and super hot. I enjoy every thing and the scramble part is my favorite. But the reason that it doesnt have 5 stars is the Seavers for the online first you have to choose at least 2 out of three sports which is annoying and then there games take so long to just find someone. But besides the online I really recommend it and it is a great party game to pass around.\n\nHelpful | 2", "Emonkey058Mar 31 at 7:07 AM\n\nGreat game\n\nHelpful | 1", "JulieCusimanoWallJan 31 at 5:57 PM\nWTH? \n\nI love this game! I was a huge fan of bowling, tennis and baseball on our Wii back in the day. This puts a whole new spin on I it (no pun intended), lol.\n\nI use this as a cool-down after my higher heart rate VR games. Its fun, the announcer nails it every danged time. That is awesome, until I miss something obvious, lol!\n\nSeriously, though, this game is a lot of fun! You havent played tennis until youve had Nemo as the ball. \n\nHelpful | 1", "milesvs0524Jul 1 at 5:29 AM\nAmazing\n\nThis is like the Wii sports of VR but better.\n\nHelpful | 0", "dancejohndanceJun 24 at 10:30 AM\nLove it\n\nI like the baseball the best, but all 3 sports are awesome! Get this game now!\n\nHelpful | 0", "GangStar645Feb 23 at 12:42 PM\nGood idea, but not enough content\n\nI love all of the game modes, but for 30 dollars this game is not worth it at all. There are only three sports to choose from. Tennis, baseball, and bowling. They NEED to add more sports for it to be worth the price. Maybe something like golf(which would be a great idea for competition), or basketball. I really hope that there is more to come in the future, but right now its not looking so good.\n\nHelpful | 0", "keyaluve1122Jan 20 at 8:39 AM\nLoved but....\n\nI love all the games it's different and gives excitement to games that we learned as children. My main issue is that this games has multiple glitches and i keep having to reset it. Other than that it would be 5 stars.\n\nHelpful | 4", "wildianaMar 8 at 4:15 PM\nGreat\n\nMy son loves it!\n\nHelpful | 0", "WaveTech325Mar 7 at 7:41 AM\nMost fun game ever but my controls kept\n\nThis game was an awesome but sometimes my bat or racket dissapeared and I couldnt play. Please fix this\n\nHelpful | 0\nDeveloper ResponseMar 9 at 4:52 AM\n\nHello WaveTech325, This usually happens when there is a tracking issue, try adjusting the lighting in the room you're playing in and see if that helps. ~The Armature Team.", "ibindigoFeb 13 at 7:31 PM\nNot enough adverts..\n\nThis game is super fun and one can break a sweat if playing long enough. Although I do miss a good ad for guns of glory every 30 seconds...\n\nHelpful | 2", "outtoplayFeb 18 at 6:31 PM\nFun game, but still no updates.\n\nBe nice to see the dev's expand on this. But it is well executed\n\nHelpful | 2", "Bearf23Feb 23 at 1:43 PM\nVery fun and engaging\n\nI loved this game but I just wish there were more sports.\n\nHelpful | 0", "natnam96Jun 21 at 2:36 PM\nKeeps my on my feet\n\nPhysics are a bit off, but it keeps me on my feet\n\nHelpful | 0", "HelpMe2004Jul 13 at 7:59 AM\nIt's good\n\nIt's good\n\nHelpful | 0", "SamuelRowanFeb 16 at 5:58 PM\nGood but expensive\n\nIt is a lot of fun but I'm not sure if it's worth the price they're asking.\n\nHelpful | 1", "LastShonobiFeb 13 at 2:42 PM\nGreat game needs more sports\n\nThis game is great I enjoy a easily 5 hours of this game but seem to get burnt out pretty quickly.\n\nHelpful | 0", "HotBushMeatJan 31 at 3:29 AM\nFun for an hour\n\nI loved the demo, so I purchased the game. I wish that I knew about the 14 day refund policy back when I bought the game. I played for a total of about an hour, then got bored, and havent really played much since. Ive picked it up here and there, but I just couldnt get into it. Maybe add a game or two. Three just isnt enough here.\n\nHelpful | 1", "FTB_Desert_14Mar 17 at 2:53 PM\nFun\n\nIt's the Wii sports of vr\n\nHelpful | 0", "losito326Mar 20 at 9:46 AM\nSports Scramble\n\nLove it!\n\nHelpful | 1", "DirtyDumplingsFeb 26 at 6:37 AM\nFun game\n\nFun game to pick up and play\n\nHelpful | 0", "cjkorek2Feb 4 at 5:11 AM\nSo much fun for all ages\n\nTons of fun. Love how you can play each game either traditionally or scramble way. So easy to play. Everything works correctly. From swinging a bat to rolling a ball. My only wish is that they add even more sports lol.\n\nHelpful | 1", "hunter53006Mar 15 at 7:47 PM\nFun\n\nI had fun with this game.\n\nHelpful | 0", "OatMeal47Jan 27 at 7:26 PM\nIts pretty good\n\nIt epic but theres not a lot of sports I want fencing and more would I get it out of all the other games yes would I get bored of it in 2 months yes its great\n\nHelpful | 0", "LeakyCauldronMar 16 at 7:21 PM\nGood\n\nIt cah makes\n\nHelpful | 0", "Dan.TinkelJan 7 at 3:38 PM\nGets me moving\n\nI enjoy the variety of activities & the sudden change up of equipment.\n\nIm 51yrs old & not someone who likes to go to the gym. However, I keep coming back to this again & again. Keeps me motivated to get my steps in & burn calories.\n\nThe colorful environment & fun characters also keep my grandkids involved too.\n\nHelpful | 5", "DeepMellowJun 2 at 6:26 AM\nAwful. Wii type graphics and gameplay\n\nGameplay is terrible and boring. Ive played wii games that were more fun. Not worth the price. Its about 1/10 the content of any regular game. Gets boring real fast.\n\nHelpful | 2", "Jethroblack962Jan 9 at 8:42 PM\nGood game,too long intros\n\nI love this game its fun and gets me moving but the only thing i dont like about it is the unnecessary intros before every game. I understand when they do it at the time you first use it but its every time and it gets annoying.\n\nHelpful | 1", "BowlerboyyyyyJan 31 at 6:32 PM\nGreat game but...\n\nI love this game but when I play quick play the npcs are complete trash even on hard mode they need an expert mode with pro on. I might just be really good but it should have an expert mode\n\nHelpful | 1", "FHL720972Jan 21 at 10:57 AM\n\nGreat realism. I do play tennis ,so I can compare,and it's pretty close, I was engrossed and ended up doing a 1hr work out ,playing on rally mode .not played the other games yet!!\n\nHelpful | 0", "BBcool1435Mar 7 at 8:00 PM\nUnt\n\nFun sport me playyyyyyyyyyyyu\n\nHelpful | 0", "hedhntressDec 31 at 5:20 PM\nThis is really fun\n\nYou will have fun with this one, some say that they dont like the Replay Intro you can avoid this when you click Start you will see the menu with 3 selections. Replay Intro Options and Quit Instead of clicking menu with 3 selections. Click Tennis or baseball or bowling you will automatically go into the game and avoid the Intro. Once in the game select Quick Play\nI love the challenges, you get up to 8 and once you win the Challenge you get a trophy and you can go to the next Challenge. You can replay the challenges too. Im completely addicted to this. I wish they could add  Fitbit so see the workout on your Fitbit. This definitely can fit in with fitness apps. Just wish this would sync with Fitbit. Developers I hope youre reading this, UP YOUR GAME so it syncs with Fitbit You can end up spending more then hour easy. Highly recommend this if you want to have a lot of fun and get a good sweat. \n\nHelpful | 6", "c2w247Feb 11 at 1:11 PM\nFun for the family!\n\nGood game reminds me of Wii sports a little\n\nHelpful | 1", "Not-DB-CooperDec 22 at 4:27 PM\nSilly fun game\n\nThis game plays pretty well and is probably the best title currently available for the quest for playing with the whole family. If you have kids that you share your headset with, this is a must-have. Many would call it a must-have anyway. I gave it 4 instead of 5 because it's not a serious sports game and I think most adults would find it losing its entertainment value after a while. Buy it anyway though. You'll get your money's worth out of it before that happens.\n\nHelpful | 1", "floopychickien69Jan 13 at 5:34 PM\n\nThis gam is outstanding but there are very little things wrong the bay in base ball will hit the ball sometimes even though you holding it back and the multiplayer needs some more work\n\nHelpful | 1", "JaCTVRJan 11 at 1:37 PM\nOne of the best VR sports games ever!\n\nI actually play sports, more specifically tennis. This game is super immersive and will have sweating. It gets you involved when playing and is a great game to cast and take turns playing games of any of the three sports with friends or family! Highly recommend this game for anyone who wants to have some fun!\n\nHelpful | 1", "BousArconeDec 29 at 2:00 PM\nStill playing after 6 months\n\nThis is a game that I still find myself coming back to, even after owning it for half a year. It's both fun and a light workout. Would be nice to have more sports but the three provided are unique enough to keep things entertaining.\n\nFor solo players there are challenges that help you perfect your game and adds to the longevity. It was a great sense of accomplishment when I finally got that last trophy.\n\nAlso, for those looking for something more serious you can set the scramble option off for these games for a more \"pure\" experience. And if you have a lot of room the playspace does adjust, if anyone wanted a full court tennis match.\n\nOverall this is my favorite Quest game still after owning the game and system since they came out. Highly recommended.\n\nHelpful | 5", "Zach224Feb 22 at 8:27 AM\nGreat\n\nIts a great game and you will be playing for hours at a time.\n\nHelpful | 1", "GreyGazelleJan 17 at 5:34 PM\nPretty good\n\nThis game is pretty good but there are some issues like the loading time and how long it takes to start up a match but never the lest this game is fun\n\nHelpful | 1", "DonjuanmatusJun 13 at 10:55 AM\n\nWowww\n\nHelpful | 0", "panthemusicalgoatDec 17 at 9:46 AM\nReally fun but multiplayer is iffy\n\nGame is fun but multiplayer needs an overhaul. It seems like 50% of the time me and my gf try to connect it causes some sort of bug where neither of us can connect anymore even in other games that were working fine previously. Restarting entire quest headset usully works but even then it's still a random chance. If you're buying the multiplayer maybe wait till they fix it\n\nHelpful | 1", "Mr.Beast600Feb 18 at 1:14 PM\nReally fun but gets boring\n\nA really fun game but after a while it gets boring just wish it had more sports\n\nHelpful | 0", "HaneyfambamJan 23 at 3:05 PM\nFun\n\nDont like having to start with instructions every time but the game is overall fun\nEasy for kids.\n\nHelpful | 1", "Steven-SMay 26 at 11:27 AM\nLove the bowling game!\n\nI love the Bowling game! Cant stop playing. The other games are great too!\n\nHelpful | 0", "cdlondonJan 17 at 5:39 AM\nLove this game!\n\nWe havent had any problems with this game so far and love. The only issue we have is the difficulty. Even when the computer is on easy it is challenging for us to win but we still love it and we just need to practice some more!\n\nHelpful | 0", "tcarter61Jan 8 at 3:01 PM\nGood game, BUT........\n\nThis is really a fun game I like it a lot!! But the game only gives you one options to start playing which is \"Start Intro\". This means you have to sit through the initial game introduction EVERY SINGLE TIME, this it's ridiculous. I can see forcing you to watch it the first time but that should be enough, after seeing that ONCE you should have an option to simply start the game.......... But you don't.\nCome on developers, I challenge you to develop a patch that fixes this problem then you would have a fricking awesome game. I'd jump to 5 stars for that fix!\n\nHelpful | 3\nDeveloper ResponseJan 9 at 2:25 PM\n\nHello TCarter61, You can turn on \"Quick Start\" mode in the options menu under \"Extras\" to skip the intro when loading into the game. ~The Armature Team.", "siwkoJan 27 at 3:33 PM\nSo Much Fun!!\n\nI had a fantastic time playing this, it's a little tough and the explanations can get a little tedious on some levels but otherwise a solid purchase and good for multiplayer.\n\nHelpful | 1", "Joshiek009Jan 23 at 1:12 PM\nGood environment\n\nVery good game. You can do training,challenges and quick play for every level!!! Theres bowling,baseball,and tennis.I recommend it to people that like muddled up games and a bit crazy too!!!\n\nHelpful | 0", "CarlaJoanieFeb 1 at 9:03 AM\nOkay\n\nToo long long tutorials. Fun time after you get started. Have had it for one month. Already bored with it. Hoping for more games to be added soon. Would like to see pickel ball added. Thanks\n\nHelpful | 1", "mhenry8910Dec 11 at 12:31 PM\nTerrible mechanics\n\nIn the baseball there is not rewarding for anything, any pitch you throw is just as likely to be a homerun as a swing and miss. You cant win in quick play baseball. There is no reward for pulling pitches and swinging at strikes. It doesnt matter if you swing early or late it doesnt affect the direction it is hit. The mechanics are terrible. I want refund\n\nHelpful | 12\nDeveloper ResponseDec 13 at 8:08 AM\n\nHello Mhenry8910, We're sorry you didn't enjoy Sports Scramble, If you are within the return period, you can visit this link and request a refund, https://support.oculus.com/964479930393572/ ~The Armature Team.", "ViolletteFeb 21 at 9:12 PM\nGreat game! Hope to see a sequel!\n\nGreat game! Play it every day!\n\nHelpful | 1", "gleep52Dec 3 at 12:40 PM\nPrice is too high!!! :(\n\nI have waited for this app to go on sale. And finally it was at least in the multiplayer bundle. I bought it for quest and would love to play against my son on our Rift CV1, but I cant justify another 30 dollars for that experience. The game content is probably 10 dollars but its VERY well polished. The polished play and well thought out gaming mechanics probably push it to a 20 dollar game before a sale price and thats being generous. The intro game/event talking takes up a lot of time and isnt really necessary all the time. At least let us play or do something while we are forced to listen to the giant ball talk to us. My kids (and myself) have time limits when playing, so getting right into the game is important to us. The gameplay and mechanics of the game are very well thought out and a lot of fun- and I mean a LOT of fun. Even normal bowling has great tracking (except the spinning - I got stuck on that tutorial for a while - just doesnt track well) and the normal play vs scramble mode is great. The achievements are great and my son loves unlocking things, but wish there was more player customization for the in game avatar. Since it costs so much, I doubt Ill really get to experience the game in multiplayer much though.\n\nI sure wish Oculus had some kind of family sharing stuff like Apple does. Id be way more likely to buy multiplayer games like this one in a heartbeat if I knew I could share it with my kids with a single purchase.\n\nHelpful | 4\nDeveloper ResponseDec 4 at 9:03 AM\n\nHellow Gleep52, We're very happy you're enjoying sports scramble, please contact our customer support at support@armature.zendesk.com, we would love to get your feedback on the game. ~The Armature Team", "daniel.faust.33Dec 31 at 4:13 AM\nGood title that will become great\n\nFun to play, interactive, and immersive. Two things that will make it great. More sports to choose from and adapting game to hands free or interactive sports controller like a bat or tennis racket.\n\nHelpful | 0", "Jake.70Apr 28 at 6:56 PM\nWii sports but scrambled\n\nThis game I 200% recommend one of the best games on the quest and they have an amazing customer service team. I cannot recommend you get this game enough. Its awsome just absolutely amazing\n\nHelpful | 0", "tonyhaydarDec 7 at 10:57 AM\nGreat game but...\n\nGreat game! Very polished, colourful, good controls but in your next update (like tomorrow, if possible) could you please add an option for those who want to play regular, classic tennis game (with no ball or racket turning into something else, no walls objects! Best of 3 or 5 sets?).\nBy doing so we may finally have a decent tennis game on Quest. There is none at the moment.\nThank you!\nUpdate: Thanks, it worked but it only took the objects away but it has a weird points system, service changing sides at 30?? It still feels like its made for youngsters though. Your developers now have a solid, good engine; it should not be difficult for them to make a good tennis game for adults (with the choice of clay, grass court, umpires, ball boys/girls etc). I wouldnt mind paying top $ for it and I am sure there would be many more. There is no tennis game on Quest as it is now and of course eventually there will be one, why not it be you?\nThank you and Happy Holidays!\n\nHelpful | 3\nDeveloper ResponseDec 4 at 10:50 AM\n\nHello TonyHaydar, We're glad you're enjoying Sports Scramble! You can switch to Traditional Tennis modes in the setup menu before the game. Press the Edit button at the bottom of Match setup and then either uncheck the options on the left hand side, or toggle the match from \"Scramble\" to \"Traditional\". Those options control the type of match and which scramble options are enabled. ~The Armature Team.", "brodyapter4Feb 5 at 11:48 AM\nAmassing but to long intro like 5 minute\n\nOverall amazing\n\nHelpful | 0\nDeveloper ResponseFeb 7 at 10:37 AM\n\nHello Brodyapter4, You can disable the intro after you've watched it once by going into the options, selecting Extras and turning on quick start. ~The Armature Team.", "Only_FibrzDec 25 at 2:33 PM\nThe games good but theres one problem..\n\nI had a lot of fun playing this game and I love it, but the only problem is that its nearly impossible to find opponents on the multiplayer mode which is kind of disappointing, but otherwise the game is great!\n\nHelpful | 1", "capeb16204Jan 26 at 9:31 PM\nNot what I was expecting\n\nI was expecting a real sports game not you now have a pool noodle as your bowling ball or throw the cheese through the correct hole when Im just trying to play classic 10 pin bowling. Does anyone know how to return games. I was extremely mislead when the game had sports in the title and I got a kids imagination simulator.\n\nHelpful | 1\nDeveloper ResponseJan 27 at 5:48 AM\n\nHello Capeb16204, Please follow the instructions found at https://support.oculus.com/275553640003957/ for details on how to request an Oculus Refund. ~The Armature Team.", "iLuvAssDec 29 at 11:56 AM\nSuch an awesome game and experience!\n\nComing from a die hard sports fan in general, this is by far the best money spent by a mile! Extremely immersive and each time I get on, I get so sidetracked that hours fly by. Trust me Im extremely skeptical of some games with price tags like this but in my opinion, this is a must buy!!!!\n\nHelpful | 0", "Ducky25Feb 23 at 5:02 PM\nEpic\n\nBe wii sports\n\nHelpful | 0", "julia.sixsmithJan 4 at 2:33 PM\nGreat fun\n\nGreat fun, but not fun when it freezes. When I set it to Tennis only and I'm waiting for the service, it freezes and I have to come out of the game altogether.\n\nHelpful | 1", "OvrKillsFeb 6 at 3:00 AM\nLove this game.\n\nThis game is fun, interesting, and can easily be played for hours. I highly recommend.\n\nHelpful | 1", "ZombieCrawler99Feb 14 at 6:14 AM\nTotally Worth It\n\nI got this game and immediately loved it. Great game.\n\nHelpful | 0", "SoulcuneDec 27 at 3:03 PM\nGreat, but needs more playable sports.\n\nReally addictive, replayable and fun! But needs more playable sports, like maybe Basketball, Soccer, and Golf! I would pay money for dlc including more sports! But, is very fun anyway!\n\nHelpful | 2", "Lily_RodriguezFeb 9 at 12:46 PM\nFun\n\nI love it and the challenges you\nIts Lina stressful but sooooo fun!!!!\n\nHelpful | 0", "beach_flopJan 19 at 10:48 PM\nGreat game!\n\nGreat game but there are only three sports. I would love some new additions such as volleyball, basketball, or even football. These would add so much to the game.\n\nHelpful | 1", "andreas.kodratJan 10 at 3:49 AM\ngood game play with friend but...\n\ni tried to play online with other player but always not found, i live in SEA. is the MM based on country or what?\n\nHelpful | 1\nDeveloper ResponseJan 13 at 5:31 AM\n\nHello Andreas.Kodrat, Its possible that there are less people playing at the times you are trying to connect to Multiplayer due to differences in timezones. ~the Armature Team.", "GirlGeek101May 3 at 9:41 PM\nLoads of fun!\n\nThis is loads of fun and multiplayer enabled me too meet up with friends dispute COVID. Thanks for making this available in French too!\n\nHelpful | 0", "ozzie5335Dec 21 at 9:38 AM\nAmazing game\n\nThis an a amazing game all around. Good workout as well. Very rarely will something go wrong and the one time it did go wrong my lights went off so that was the problem I believe. But this game is amazing I would really recommend this game to new people to vr its not to uncomfortable but still very interactive.\n\nHelpful | 1", "EndejesseFeb 9 at 10:29 AM\nCould use more sports\n\nIts super fun but I think it could use a few more sports\n\nHelpful | 0", "Jpag13Nov 16 at 5:58 PM\nGreat Title Just wish More Multiplayer\n\nThis Is A Must Family/party Title. Using your Chromecast will Allow others to Feel as they are Engaged as well. I wish there was either more people playing this online, or maybe the Devs Need to Have a better Matchmaking ALGORITHM?? Anyways this Is A Great Game no matter how your CUT IT . THE REPLAY VALUE IS ENDLESS\n\nHelpful | 9", "kriegen.thainJan 6 at 11:47 AM\nGreat but...\n\nGreat game very challenging at times but wish there were more modes. Golf... Netball... Table tennis there's loads to chose from\n\nHelpful | 0", "paul.rederJan 9 at 8:54 PM\nSuper Fun\n\nThis game is awesome! Very unique twist on baseball, tennis, and bowling. Never gets boring, great graphics, and amazing tutorials that train you how to be a great player. Highly recommend.\n\n\nHelpful | 1", "ChickenNoodlezDec 17 at 4:52 AM\nBest game ever\n\nI originally got this game through the oculus quest demo. I liked the game so much that I bought the full game. I really like every thing it has to offer although the bowling is a little to easy even with pro on. Its a great game to play with friends and a great game to play alone.\n\nHelpful | 3", "IZK415Jan 7 at 9:42 AM\nFun\n\nThey should come out with a basketball and other games version. But overall a really fun and silly game. Doesnt fee like it gets old. Been playing for hours and both my wife and I really enjoy it.\n\nHelpful | 1", "billthakid77Jan 16 at 5:25 AM\n\nSolid game but I wish it had more different sports to choose from\n\nHelpful | 0", "junk14_Jan 10 at 6:51 AM\nIts pretty good\n\nIts pretty fun but itll get boring after a while. Wish there were more sports to play.\n\nHelpful | 0", "Jayce131Feb 8 at 1:59 PM\nTons of fun\n\nThis is a fun game that is easy to use!!\n\nHelpful | 0", "JNicksonFeb 10 at 2:59 PM\nGood fun\n\nIts fun easy game to play\n\nHelpful | 0", "stromer16Nov 28 at 7:25 PM\nSuper fun!\n\nAwesome game, great for when you just want to throw on your headset and have some fun. The scramble aspect of the game really keeps it interesting. This is kind of like the Wii Sports of VR. I did run into an issue finding players online to play against, which really limits the fun to some degree. I dont know if the online is already dead for this game or its just that my internet wasnt great at the time, but hopefully I can find some other players next time I give it a try.\n\nHelpful | 0", "SwordboyDec 16 at 1:05 PM\nSuper fun! Best pvp to start with :)\n\nThis game is silly, crazy and one that both the kids and grandparents will enjoy. With three different sports to choose from and different ways to play, you won't get board. You can be super active or even just slightly active to make this a work out or just a casual time game. The physic in the baseball game is a little wonky though and kinda wish there was at least one more sport, but don't get me wrong, you will love batting with a foam finger and hitting a fish back a fourth. Bowling is so crazy, you won't want to stop playing it. Buy the full version and get ready for family fun!\n\nHelpful | 0", "gramma77Jan 28 at 7:40 PM\nGreat Fun!\n\nLove playing all the games and all the varieties of scramble sports. Great fun!\n\nHelpful | 0", "P_Star_7Jan 13 at 1:24 PM\nI do be enjoying doe \n\nThis game is very fun. I only wish there was more to do.\n\nHelpful | 0", "jon.johnson.26499Nov 30 at 5:08 PM\nWii on steroids\n\nI love this title. It's my standard for fun and actually getting up and sweating a little for the day. I hope the come up with more sports. I've seen complaints , I have to say mine never crashes. The boot time is normal for any game and of you cant wait a couple mins to play one of the best quest games then it's your loss. My family loves it.\n\nHelpful | 6", "dcallearyDec 11 at 11:35 AM\nGood Game\n\nI tried the demo but I really wanted the other sports so I paid for the full game. I was a little disappointed because there is only three games. I would give five stars if there was basketball\n\nHelpful | 1", "NiceVanLifeJan 12 at 11:13 PM\nOnly three games\n\nI think in the preview it looks like there are more than three games, and I was really looking forward to playing American football, but there is only bowling, baseball and tennis...\n\nHelpful | 0", "Destroyer2550Jan 4 at 10:20 PM\nOne of my favorites!\n\nThis was one of my first games on the Quest. And after many new games it is still one of my favorites! This is a great game and a great family experience.\n\nHelpful | 1", "BLTDog15_27Nov 30 at 12:54 PM\nGreat Game\n\nSports scramble is a great way to show off you r skills in VR but I wish there was a couple more games like archery,maybe basketball and other fun sports.Its still a fun game even without those so I think its a four to four and a half\n\nHelpful | 1", "VenomGanosJan 17 at 6:34 PM\nThis game is amazing\n\nI live this game so much, the baseball is fantastic and bowling is great fun. Tennis is good too\n\nHelpful | 0", "CraaaaaaaGDec 30 at 2:02 PM\nWorst game I have ever bought\n\nThis claims to be an equivalent to Wii sport but is truly terrible, unskipable cut scenes and truly awful games. Sad I wasted my money...\n\nHelpful | 6", "archermancoolJan 31 at 1:47 PM\nMy rating\n\n10/10 awesome game\n\nHelpful | 0", "joehenry11Jan 3 at 7:28 AM\nGood not great\n\nThe kids love it definitely worth buying as an extra game\n\nHelpful | 0", "KylecoolkyDec 25 at 2:59 PM\nFun but the announcer gets annoying\n\nIts fun but I wish there was a way to skip the announcer sometimes. He talks a lot with no way of skipping. Other than that, its super fun and is a great game to show my friends.\n\nHelpful | 1", "clevelandb0y216Jan 1 at 7:14 PM\nVery good game\n\nI love this game but I was playing baseball and the pitcher threw it at my head and I flinched and my oculus quest flew off my head but its all good\n\nHelpful | 0", "daniel.garabedianNov 9 at 2:17 PM\nThere's alot more than what demo shows\n\nThere's bowling and baseball, you can mix at all up with crazy sports mixing or you can play a normal game. You pitch and bat in baseball and even have to catch the ball, but only as the pitcher. There's challenges to each sport which are like minigames. The colors can be a bit overwhelming and my head did hurt until I turned night mode on at the occulus menu. Playing the sports games is much like wii sports except greatly improved.\n\nHelpful | 3", "PerefinDec 3 at 9:24 AM\nGreat VR mechanics and UX!\n\nThis game is really fun, looks great on the quest and clearly has a team behind it capable of making some thoughtful design choices that really maximize the use of the medium for fun gameplay, including the menu system, loading screens and angry birds style leveling and star systems. Highly recommended!\n\nHelpful | 0", "BuckeyeGuy2014Jan 16 at 10:39 AM\nFun, but...\n\ntheres not that much to do, the intro takes like 5 mins, and after playing each game once I really have no plan to play them again.\n\nHelpful | 0", "NitemareTrainerDec 30 at 11:00 AM\nAccessing Online Multiplayer\n\nI just bought the game and maybe I am missing it, but I do not see an option for the online multiplayer. If someone could help me, I would appreciate it.\n\nHelpful | 0", "Prez_MaloneJan 27 at 1:28 PM\nOk but not what I expected\n\nThis game is decently fun but nothing I would spend $30 for, it has very low replay value and it gets really boring.\n\nHelpful | 0\nDeveloper ResponseJan 28 at 4:40 AM\n\nHello Prez_Malone, We're sorry you didn't enjoy Sports Scramble, If you're still within the Refund window, Please follow the instructions found at https://support.oculus.com/275553640003957/ for details on how to request an Oculus Refund. ~The Armature Team.", "debksurJan 25 at 7:04 AM\nDon't like the mixing up.\n\nI like this game but only like to play the normal games the right way.\n\nHelpful | 0", "SlimRobinHoodDec 1 at 4:08 PM\nGreat Game\n\nI played the demo and had tons of fun but eventually found myself dying to try the bowling and baseball portions of the game and when i did i was incredibly surprised at how fun bowling and baseball are in vr. I recommend this game to everybody with the spare money to buy it.\n\nHelpful | 1", "Dakota315Dec 30 at 5:37 PM\nGreat game\n\nI have been playing sports scramble for a few days now and it is very entertaining, there are many different challenges that keep me playing.\n\nHelpful | 0", "Captain-Av8rJan 13 at 7:32 PM\nLike wii sports\n\nIts fun, definitely a learning curve in order to get good\n\nHelpful | 1", "seanbob360Jan 8 at 8:02 PM\nReally fun, needs more sports!\n\nGame is great fun especially to play with a friend that has a quest but it needs more sports.\n\nHelpful | 0", "louie.thedudeJan 9 at 1:47 PM\nAmazing game\n\nThis was my first experience on the Oculus quest, and its still one of my favorites.\n\nHelpful | 0", "jestr999Dec 31 at 1:43 PM\nGreat game!\n\nBowling is Great! I really enjoy the different lanes and challenges that are thrown at you. Nothing else like it on the Quest!\n\nHelpful | 0", "lonepotato36Jan 13 at 1:55 PM\nReally good\n\nI think this was a really good game to play when I get bored\n\nHelpful | 0", "brian.taylor.5099Jan 11 at 1:36 PM\nGreat time\n\nThis is a family friendly game that can leave you winded. Great fun.\n\nHelpful | 0", "epandOct 28 at 10:49 PM\nMore detailed info/help for players\n\nI still require some simplifying the start up process. We have to go through the boring process of all steps before we start again. I would rather have a play button also at the beginning. I removed the scramble option, but it comes up again we start again. Cant we save our favourite options? instead of tweaking again?\n\nHelpful | 7\nDeveloper ResponseOct 23 at 1:28 PM\n\nHello Epand, You can disable scramble options when setting up a game by selecting \"Edit\" at the bottom of the screen, and then either changing \"Scramble\" to \"traditional\" or by unchecking the Scramble Icons on the left side of the screen. ~The Armature Team.", "lastexplorerNov 22 at 3:19 PM\nEnjoy but navigation difficult\n\nTutorials are great for how to play and drills to practice the skill set. Like all the Quest games I have great difficulty getting in and out of the games and switching to games within the game. Its not intuitive to me and an exit, pause and menu buttons would help. The game is fun and great exercise. It is a lot of money for only 3 sports: tennis, bowling and baseball.\n\nHelpful | 1", "kalsolarNov 5 at 10:58 PM\nA novel approach that really works!\n\nA fun and entertaining sports title that really keeps you on you toes with it's wacky mash-up of ever-changing in-game sports equipment and your need to keep adapting how you play with what you have.\n\nYou can play more traditionally by changing the settings but the scramble element really is more fun and enjoyable than I initially expected it to be. It certainly gives the game more legs in the long run.\n\nThe commentary does grate over time and the baseball element is probably the least satisfying of the three games on offer but it's a great title with lots of challenges and trophies to be won.\n\nI haven't been able to find anyone online to play against in multiplayer mode yet but hopefully time will remedy that. Fingers crossed!\n\nHelpful | 0", "ZekeBrancoNov 28 at 3:10 AM\nIts boring\n\nTheres literally 3 things to do and i dont know if its just me but baseball impossible to win when your batting and I was contemplating getting creed but I got this and I regret it. now its probably been past 14 days so I cant refund it.\n\nHelpful | 4\nDeveloper ResponseDec 2 at 6:43 AM\n\nHello ZekeBranco, We're sorry you didn't enjoy Sports Scramble, If you are within the return period, you can visit this link and request a refund, https://support.oculus.com/964479930393572/ ~The Armature Team.", "JsboxerDec 26 at 8:08 PM\nGreat, but frustrating\n\nThis game is very delightful and fun, but there are issues that come with it. First, online is broken, second its nothing like the demo, and third the achievements are impossible to get.\n\nHelpful | 0", "herculanonetoDec 22 at 4:16 PM\nNot Happy at All\n\nLot of Introduction and I brought to play with my wife, (we brought two Oculus Quest too) and the game had a lot of bugs into calibration and into time to play, I'm very disappointed, waiting a message Tha they are improving the game and fixing those bugs.\n\nHelpful | 0\nDeveloper ResponseJan 6 at 5:16 AM\n\nHello Herculanoneto, Please let us know what issues you encountered by sending an email to support@armature.zendesk.com and we will troubleshoot and look into the issues. ~The Armature Team.", "watsonfam08Dec 25 at 7:17 PM\nYep\n\nSon loves it\n\nHelpful | 2", "digitaldoccNov 22 at 4:37 PM\nBest Tennis in VR\n\nFinally a game that lets players run around our room scale play spaces. This is better than all other VR tennis games out there.\n\nHope the devs make a racketball court next.\n\nHelpful | 2", "Raptor102Nov 27 at 10:34 PM\nGood Game, Except For Baseball\n\nTennis and bowling are a lot of fun, but baseball has some flaws. Both tennis and bowling offer a lot of challenges and fun gameplay with the changing balls and rackets. The baseball mode is disappointing due to some gameplay issues and how it relates to actual baseball. Too many errors by the fielders. Unrealistic triples to left field. Pitches that are literally behind me or hit me as the batter get counted as a foul ball or hit into play without swinging the bat. Please adjust for check swings. I can barely swing the bat on pitches outside the strike zone and it gets counted as a full swing. Fix the baseball mode and this would be a five star game.\n\nHelpful | 10", "HOODININAME1Dec 25 at 5:15 PM\nIt be goodz\n\nThe game is like actual sports just messed up but you can just play normal sports if you turn of scramble mode\n\nHelpful | 2", "burkedaDec 20 at 1:59 AM\nId give this 10 stars if i could\n\nPlaying tennis in the living room? Hell yeah!\n\nI dont know how, but it feels real.\n\nOnly downside is waking up with sore arms every day \n\nHelpful | 0", "E2_ERROR12Nov 21 at 5:09 AM\nAmazing but\n\nI think it would be really cool if yall added like golf into the game yall have tennis baseball and bowling golf would just make the game complete this is just a auggestion\n\nHelpful | 0", "Manor222Jan 6 at 3:34 PM\nWont download\n\nI can not get this to download can someone help my son wont quit bugging me\n\nHelpful | 0\nDeveloper ResponseJan 6 at 5:14 AM\n\nHello Manor222, Please verify you have enough space on your Quest, also try rebooting your Headset and then try downloading directly from the store in the headset. If that does not work, please contact us at support@armature.zendesk.com and we will be happy to troubleshoot the issue with you. ~The Armature Team.", "lorne.quaneyApr 15 at 6:59 PM\nFun game\n\nVery interactive , great graphics.\n\nHelpful | 0", "JuankcubaDec 1 at 1:45 PM\nAwesome\n\nNice game,is a lot a fun inside this section,I would like a basketball game with this amazing app,would be great,thanks\n\nHelpful | 0", "WingZero312Jan 10 at 6:43 PM\nno instructions, no way to navigate...\n\ni can't find instructions anywhere. no idea how to navigate from the main menu. can't figure out how to add a friend in game as a result.\n\nHelpful | 1\nDeveloper ResponseJan 13 at 5:28 AM\n\nHello WingZero312, Navigating the main menu is as simple as looking at the sport icon (which is hovering above each stadium in the sports complex) you wish to play and waiting for the menu item to pop out, then using the controller's laser pointer and trigger to select the option. For Multiplayer turn to the VS stadium and select that icon. ~The Armature Team.", "bongolongoJan 1 at 10:21 AM\nHard to find opponent multiplayer\n\nFun game for sure, would have loved some tournaments in multiplayer.\nIts hard to find someone to play with\n\nHelpful | 0", "omg_florianaDec 2 at 2:11 PM\nAmazing!\n\nI have no problem with this game! It is kinda like a workout and has 3 different sports you can play. This is by far my favorite game on my Oculus quest! I really recommend it!!\n\nHelpful | 2", "jay0702Apr 18 at 1:05 AM\nI like it\n\nGood\n\nHelpful | 0", "Ryan_Percussion1234Jan 7 at 6:33 AM\nThis is epic\n\nThis is epic\n\nHelpful | 0", "Slimmz843Dec 12 at 5:51 PM\n\nCan you add a basketball category on the update\n\nHelpful | 0", "GomakisDec 7 at 11:38 AM\nA lot of fun\n\nI have been enjoying this game a lot. The mixed up sports are fun and the game is really immersive. Has a lot to offer with challenges and just playing the unpredictable sports games.\n\nHelpful | 0", "MinikManNov 3 at 8:04 PM\nCould be better\n\nThe scramble idea is gimmicky. You can turn it off and the game gets better. The maddening music though is ever present. I wish you could turn the music off. Terrible. If you are 10 years old you will love this game. Unfortunately the oculus wont fit your head so you cant play anyway.\n\nThis game could be fantastic if it was made for adults.\n\nHelpful | 3", "OculusWoahOct 30 at 3:50 PM\nAwesome! But could get better.\n\nI love this game! This is one of my top 3 favorite games ever! The baseball couldnt get better. LOVE the bowling, and I think the tennis is cool. But what would be REALLY cool would be if we had games like basketball, football and more. Considering that this is one of if not the only sports related game on the Oculus Quest, I think these sports would be awesome and would definitely have me typing in Sports Scramble more often! However I still love this game and definitely enjoy it how it is.\n\nHelpful | 3", "ZcheeseJan 2 at 12:21 PM\nHello\n\nGood game\n\nHelpful | 0", "pdoculusvrMar 26 at 2:10 PM\nGreat game\n\nBrilliant game, but be careful with your surroundings. Easy to forget where you are.\n\nHelpful | 0", "MareCatNov 19 at 8:36 AM\nGood workout\n\nYou have the option to put the game in standard tennis mode. I didn't care for the silliness but once i played in standard tennis mode the feel was great! Worked fine no issues. Reccomend for anyone wanting a tennis workout.\n\nHelpful | 0", "amy.saylorjoslinDec 31 at 2:23 PM\n\nThis game is ok at best the multiplayer  mode does not work and it takes forever to start playing\n\nHelpful | 2", "c_m_harrisNov 10 at 2:21 PM\nFun...But not Traditional Sports\n\nDont expect a true sports game and youll have a lot of fun. Bowling is very addictive and tons of fun. Baseball and Tennis are also fun, but bowling shines\n\nHelpful | 1", "Lazygamer557Dec 31 at 4:08 PM\nHi\n\nGreat game\n\nHelpful | 0", "KingshooterUk101Dec 26 at 10:26 AM\nYes\n\nYes\n\nHelpful | 2", "Avatar1975Dec 21 at 12:30 AM\nMissing Golf\n\nThe only thing missing for me is Golf\n\nHelpful | 1", "thesimonatorOct 24 at 8:14 PM\nMagnificent\n\nThis game isnt only fun and addicting, its healthful. Itll make you move and sweat! My favorite is the tennis, but the bowling is pretty close.\n\nThe tennis part is utterly amazing in its realism. The physics of hitting the tennis ball back and forth just FEELS SO REAL!!!\n\nHelpful | 5", "CJM60Nov 23 at 10:27 PM\nTennis anyone?\n\nThis is fun, sports with a twist and plenty of training modes...very entertaining\n\nHelpful | 1", "andrew03251985Dec 16 at 3:27 PM\nFun and Interesting\n\nFun playing the sport while silly equipment change in the process.\n\nHelpful | 0", "old_qwertyNov 27 at 3:50 PM\nMultiplayer broken\n\nTried to play multiplayer with a friend and it crashed every time within 2 minutes. Also took about ten attempts to start a game. The game thought my friend was offline despite hearing him on the party chat. Both on very strong internet so it doesnt make sense...\n\nHelpful | 2\nDeveloper ResponseDec 2 at 6:42 AM\n\nHello Old_Qwerty, We're sorry you're experiencing issues with Multiplayer in Sports Scramble. If this occurs, please have both players reboot their headsets and try again, and make sure that both headsets and games are up to date with the latest versions. ~The Armature Team.", "Grey888Oct 26 at 3:22 PM\nGood overall\n\nThis game is well developed and the art style is cool but I can see how this would have Lower replay ability unless you where playing with a friend or passing the headset around the living room well streaming to a tv or phone\n\nHelpful | 0", "ummwhatsureOct 3 at 10:23 AM\nReally great. A must own game.\n\nThis game is a lot of fun and a great game if you want to show your family what VR is. My only complaint is I have never been successful at playing this against anyone online yet. I think this is due to not enough people playing it regularly. Maybe a scheduled tournament would be a good idea. But as of now each time I try there is no one to play with which is my only reason I didnt give it 5 stars. Having said that I think this is a must own.\n\nHelpful | 3", "nathanz48Dec 2 at 2:59 PM\nGREAT GAME\n\n4 stars. Worth the purchase!\n\nHelpful | 0", "Estes1Oct 25 at 1:24 AM\nSports Scramble\n\nI really love this game. Especially the tennis and the bowling which seems to be a lot of other people's favorite as well. The only flaw I have is sometimes I have issues with the rackets sometimes the glitch will cause them to fade in and out and I will have to wave my arms a few times to get it to reappear. And yes, the batteries are fully charged. But other than that, I really enjoy the game and I also get a great workout. I've lost about eight pounds since I've started playing a month ago. It would be nice if we can get more games added. Maybe some table tennis, golf. One more thing, on the training-practice section of baseball, I have an issue with the ball. Setup would ask me if I was a left or right handed batter. When the balls hit the bat, the ball always goes in the same direction, no matter which way I swing the bat. I hit the ball to the left it goes right; I hit the ball up in the air, it goes right. It's like the program is set to have the ball go in the same direction all the time depending on which hand you swing with . That is another glitch. P.S. still dropping pounds\n\nHelpful | 1\nDeveloper ResponseOct 28 at 12:21 PM\n\nHello Estes1, For the issue with the racket disappearing, try changing up the lighting in your play space, this usually happens when the headset is having trouble tracking the controllers. For the baseball issue, try swinging the bat earlier or later, this will have drastically different results when the ball is hit. It takes some practice to get it to go just where you want it. Glad you're enjoying Sports Scramble! ~The Armature Team.", "belltekNov 16 at 2:33 PM\nMeh\n\nIts fun but you have to keep your hands in front of you and sometimes your racket disappears causing a missed shot. Also, you need a fairly roomy space. Fully extend your arm in front of you and take 2 steps forward. Thats how much room you need. Ive smacked a wall more than once. I probably wont play much but I passed the 30 minute refund mark.\n\nHelpful | 0", "CookieCat112Dec 20 at 11:38 AM\nIt didnt approve of the refund\n\nI tried to refund this game, but they didnt approve of it, and only notified me today when it just got out of the refund range\n\nHelpful | 4\nDeveloper ResponseDec 20 at 1:13 PM\n\nHello CookieCat112, Please contact the Oculus Customer Service Team directly, they should be able to take care of that issue for you. https://tickets.oculusvr.com/hc/en-us/requests/new", "zekeymanDec 21 at 7:52 PM\nThe price just, yeah no\n\nI love the gameplay, have a blast with tennis but. 30$ for tennis. Lets be honest, tennis is the only good mode\n\nHelpful | 0", "robin.kellywilliamsMar 14 at 12:17 PM\nNa'Na'\n\nI love this one ,how cool it had so many different ways to Bowl...just awesome!!!\n\nHelpful | 0", "johnathon.cox.1253Dec 17 at 8:12 AM\nTerrible\n\nNo Multiplayer waste of money waited for a half hour just for a online match and didnt get one\n\nHelpful | 3\nDeveloper ResponseDec 17 at 1:59 PM\n\nHello Johnathon.cox.1253, We're sorry you didn't enjoy Sports Scramble, If you are within the return period, you can visit this link and request a refund, https://support.oculus.com/964479930393572/ ~The Armature Team.", "Maura1129Nov 21 at 7:55 AM\nGreat game!\n\nTons of fun for Granmas and Grandkids alike. Helps get my daily exercise in.\nFrom my grandson: helps me learn to play sports while having fun.\n\nHelpful | 0", "abelistanowSep 20, 2019 at 12:48 PM\nBaseball: Fish and Pool Noodle issues\n\nIve noticed that theres a bug lately when I have the Fish as a bat. Even if I tuck it away to NOT hit the ball or whatever is thrown.. it hits it!! And obviously is the weakest way that it results in an out  - not cool! I love the game but this has started to happen this week and its a bummer.\n\nPlease try to improve the targets so that is obvious when users with a fish or pool noodle dont hit the ball even when they have their bats tucked away form the pitch\n\nHelpful | 4", "Drb.danielDec 6 at 8:38 AM\nFun\n\nLots of fun , especially playing with a friend !\n\nHelpful | 0", "Aracnareaper007Oct 17 at 10:01 PM\nA favorite for my wife and me\n\nBoth my wife and myself have quests and this is our favorite game to play together. We have tons of fun playing both scramble and traditional game modes. Our two favorites are tennis and bowling. Im hoping to see more sports added in the future but as is its worth it.\n\nHelpful | 2", "Malice44322Oct 22 at 5:36 PM\nFun, but has one major issue.\n\nThere's a lot of fun to be had with this game. You can spends hours upon hours playing each mode. The main issue is that not many people play it so matchmaking is hard.\n\nHelpful | 0", "Mentu_RaDec 8 at 7:25 PM\nExciting!\n\nThis game is a lot of fun!\n\nHelpful | 0", "BallisticbirdDec 28 at 10:33 PM\nAwful\n\nRepetitive, boring, online servers would never connect.\n\nHelpful | 1", "Zenik77Sep 28, 2019 at 10:14 PM\nReally fun\n\nIf you have a big space to play in it's really fun. The demo only shows a little of what u can do. I like bowling and tennis batting is really cool too. There are challenges and you can also turn off the scramble mode so it's just the normal sports. Hope they add pool, mini golf and ping pong.\n\nHelpful | 8", "bamakeith20Nov 9 at 9:37 PM\nLike the game but .....\n\nlike the game lots of fun. But how do you turn off that music???!!!!\n\nHelpful | 0", "cshix11Nov 9 at 8:14 AM\nBest Sports Game Ever\n\nI played it and the first time it was amazing. The view from when you first started was great and all the sports our fun to play. You will love it if u buy it.\n\nHelpful | 0", "8_BittOct 5 at 12:21 PM\nGreat Game\n\nFinding multiplayer in the game can be a little hit or miss, but the experience is great. Just wish there were a skip intro function; you can only hear most funnest so many times before you start cringing a little imo.\n\nHelpful | 0\nDeveloper ResponseOct 7 at 12:39 PM\n\nHello 8Bit_Domination, You can toggle the intro on/off by going into the options menu while in the sports complex and then visiting \"Extras\" and turning \"Quick Start\" on. I hope that helps! ~the Armature Team.", "flomoxDec 6 at 11:11 AM\nThere are some great sport games......\n\n....out there, but this is none of them! A game where only the computer decides if you win or not. Totally needless!!\n\nHelpful | 2\nDeveloper ResponseDec 6 at 1:14 PM\n\nHello Flomox, We're sorry you didn't enjoy Sports Scramble, If you are within the return period, you can visit this link and request a refund, https://support.oculus.com/964479930393572/ ~The Armature Team.", "Rubyroo276Nov 13 at 11:35 PM\n\nThis game is super fun!! Addicted....i should be sleeping but this games too fun. Great job dev's and oculus\n\nHelpful | 1", "aaron.sommers.1253Jun 22 at 7:27 PM\nSo much fun.\n\nI love this game, play it almost every day. The graphics are bright and colorful, and the games are amazing.\n\nHelpful | 3", "Brex007Oct 8 at 7:10 PM\nBlew my mind\n\nThis game is a thrill to play, whether your into sports or not.I love how this game is jam packed with many activities, and it is well worth 30 dollars, probley even 40!Anyway I love the game always play it, and it would be cool to have more sports added in the future!\n\nHelpful | 0", "ratonmaloOct 6 at 10:11 PM\nGreat fun game, recommend the full game.\n\nThe tutorial is very intuitive and easy to follow, the 3 sports in the game are fun, s bit repetitive after play 4 hours.\nI hope they add more sports such Golf, Ping Pong or Billiar.\n\nHelpful | 0", "PhillipmbaDec 13 at 8:03 PM\nFrustrating\n\nCant see fast tennis balls\n\nHelpful | 1\nDeveloper ResponseDec 18 at 2:33 PM\n\nHello Phillipmba, the speed of the balls is directly related to the difficulty setting. If they are too fast, you can try lowering the difficulty in the options menu, that may help out. ~The Armature Team.", "KloppisKoolNov 16 at 11:24 PM\nPoor and pretty boring\n\nI really wanted to enjoy this game but there isnt much to it. There is no one to play multiplayer and the AI is either really easy or really hard. Really Disappointed\n\nHelpful | 2", "brett.ruteckyOct 19 at 8:38 AM\nGreat game\n\nGreat game lots if fun. I don't really care for bowling but tennis and baseball are great.\n\nHelpful | 0", "unomatoNov 4 at 10:45 AM\nSports scramble\n\nTennis was fun pretty good I like it that the games social and Hall of Fame is useless but its probably worth about 20 bucks not 29\n\nHelpful | 2", "JennyLynnxJul 22 at 5:54 PM\nDONT BUY\n\nits so buggy and no one is ever online worst experience ever!!!\n\nHelpful | 1", "suebettyboopOct 21 at 12:04 AM\n\nReally funny game hitting a ping pong ball with a fish hahaha bit laggy tho\n\nHelpful | 0", "brycegarrett32Nov 2 at 6:50 PM\nGreat but more sports\n\nIts awesome but only three sports I know their more creative. I definitely suggest it tho.\n\nHelpful | 0", "cfultzSep 30, 2019 at 3:57 PM\nFirst purchased title\n\nAfter playing the demo for Scrambled Sports, I decided to purchase the full version. Although it does seem like a short title, it does fill that Wii Sports hole in my heart. Would recommend picking this up if you were a fan of that title.\n\nHelpful | 2", "richblackhatNov 26 at 7:13 PM\nTime waste\n\nI purchased this\nTested 10 minutes, it sucks . I asked for refund but says not available ? I only played 10 minutes and I asked for refund same day, what happen?\n\nHelpful | 3\nDeveloper ResponseDec 2 at 6:39 AM\n\nHello Richblackhat, We're sorry that you didn't enjoy sports scramble, you can attempt a refund through the following link. https://support.oculus.com/964479930393572/ and speak with a customer service representative at Oculus, who may be able to help. ~The Armature Team.", "GetVRFitOct 17 at 2:40 PM\nIt's fun and you can burn calories!\n\nI purchased this for my first Oculus Quest game and I really enjoy it. Tennis is my favorite and you can really get a \"good\" workout if that is your goal.\n\nHelpful | 1", "dnizzlenizzleOct 27 at 7:35 AM\n\nPretty disappointed, but I should have seen it coming. I thought Id have the basics that any baseball game has had since RBI Baseball, like steals and holding runners on or even which base to throw the ball to, but nope.\n\nHelpful | 0", "FriendCalledFiveJul 3, 2019 at 8:51 AM\nFun since the update\n\nThis is an update to my previously negative review which I will leave below. From my complaints in the review and that of lots of other players, the devs have cut out a lot of the waffle that you had to stand watching while waiting to play. There is a bit further they could go, but it is a massive improvement. Thanks devs.\n\nThe game is very casual fun, there is a lot of autoaim so isn't really and serious skill level involved, but if you just want something fun to play, this does the job nicely.\n\n---\n\nThe concept of this is great, but the presentation between games or points is just tortuous, they have over engineered the presentation which is fine the first game you play, but it just gets in the way after that. All the fluff between points needs culling to make it snappier and more fun.\n\nAlso I mainly got it for the tennis, there is little skill involved, there is a huge amount of auto aim that you have minimal control over. I play for fun and a bit of light exercise, nothing skill based.\n\nAnother gripe is that in the tennis cross court challenge, the colours are reversed from Beat Saber? Really?\n\nBaseball says \"press grip button to catch\" and uses the trigger button.\n\nIt has dumb menu system where you have to turn 180 to select baseball, then when you get in there, all your play space is turned 180. So if you need to be standing in your play space somewhere you can swing your arm, you have to go back to Quest menu and recenter your view.\n\nWill happily update review when devs make the game respect the time and playspace of the gamer.\n\nHelpful | 16\nDeveloper ResponseJul 8, 2019 at 5:39 AM\n\nTry changing to \"Pro\" mode in each sport, that will remove much of the auto-aim and make it much more skill based. ~The Armature Team.", "smpjlp60Nov 3 at 1:00 PM\nSo much fun\n\nI love this game. I play the tennis game everyday and I get a great workout.\n\nHelpful | 0", "megamatt79Oct 1 at 12:06 AM\nFun when it doesnt crash\n\nThis app crashes a lot please fix it and then Ill update the review with five stars other than the crashing the game is really really fun great to play multiplayer against friends I play with friends all over the United States and in Europe as well and its like we are playing in the same room together\nand its a lot of fun\n\nHelpful | 0\nDeveloper ResponseOct 2 at 6:49 AM\n\nHello MegaMatt79, We're sorry to hear you're having issues with Sports Scramble crashing. Please make sure to reboot your Quest and that your Quest is updated to the latest Oculus Firmware. If that doesn't resolve the issue, you should try uninstalling and reinstalling the application, as there could be some corruption during the install process. If none of those work, please send in an email ticket to support@armature.zendesk.com and we can help troubleshoot the issue further. Thanks! ~The Armature Team.", "SquishidOct 6 at 5:22 PM\nAmazing!\n\nOne of the best games that I have ever played on vr. The graphics were neer perfect to what I expected and it was a interactive and fun game. This game has made me reconsider playing any other game on my oculus.\n\nHelpful | 0", "EPICSEALOct 25 at 6:40 PM\nTHIS SUCKS\n\nI SWEAR THIS GAME IS SO LUCK BASED AND I BROKE MY R CONTROLLER PLAYING IT DO NOT GET IT UNLESS U HAVE A BIG PLAYSPACE BC OTHERWISE RHIS GAME IS LITERALLY THE WORST CHOICE TO BUY IN THE LIBRARY CONSIDERING ITS ALSO ONE OF THE MORE EXPENSIVE ONES SO JUST I HATE THIS GAME WITH A PASSION.\n\nHelpful | 1", "Mike1982Oct 27 at 2:57 PM\nVery Fun!\n\nTennis and bowling both are great fun! I love how realistic tennis feels when you're playing.\n\nHelpful | 1", "SoundlessDropOct 16 at 1:02 AM\nFun game!\n\nI like this game a lot. It's fun and it's good exercise.\n\nHelpful | 1", "Virtual_PaulAug 25, 2019 at 2:16 PM\nBest Wii Sports alternative ever!\n\nI absolutely love this game.\n\nEDIT: Updated my review. Still having issues caused by the firmware (that lots of people are having with lots of games), but I won't punish the review score for something that's not your fault.\n\nI'll add the fifth star if the firmware issues ever get straightened out.\n\nHelpful | 1\nDeveloper ResponseAug 27, 2019 at 7:49 AM\n\nHello Virtual_Paul, Would you mind filing a support ticket at support@armature.zendesk.com and let us know the issues that you're encountering? We would love to see if it is something that we're able to resolve without a firmware update. Thanks! ~The Armature Team.", "DJEmergencyAug 16, 2019 at 4:00 PM\nWii Sports in VR with a twist!\n\nSports Scramble is a game that reminds us of this times when we would get together in front of our TV and play some Wii Sports, but this time its in VR with a twist! There are currently 3 different sports you can play in single player mode, with a friend, or matchmaking. Tennis, bowling, and baseball in one package for a price of $29.99 is not bad. The demo they have available doesnt give you the proper justice for what this game offers. When you play you will see small power ups that will change up the game from your tennis racket changing into a fish to your bat in baseball turning into a golf club. The more you play you will notice theres achievements that gets you to unlock trophies and extra perks for your avatar. Each sport has settings for you to mess with.. and yes you can turn off the scrambling if you rather play the sports normally. Bowling is probably the best game available on here and its addicting when you have the scramble option enabled. The ally flips to different ways to bowl including changing your ball to other objects to keep it interesting. Tennis is another one that was good, but it was a bit irritating when the ball turned into a disc. As for baseball I found it to be broken.. my friend would toss me a ball and I only needed to wave the bat up and down rapidly for almost every hit to be a home run. This leaves it impossible for the other player to get their turn and it can go on forever.\n\nI gave the game 4 stars because its fun for what it is and also the developer updates it frequently.. the price for this is a little steep.. $20 would be a better price for you to spend your money on this. Also.. Where is my golf?! Lol please add golf to your collections of sports!\n\nHelpful | 5", "Killbot4of1May 21, 2019 at 6:25 PM\nCrazy and Really Fun\n\nMy favorite launch title. It's so much fun and beautiful. Only complaint is the match making when you are trying to just find a random person to play against. Not enough people playing matches yet. Plus if they would add some type of mini game or activity while you are searching for an opponent that would make the waiting less noticable.\n\nHelpful | 204", "Uccello19Nov 2 at 6:40 AM\n\nThis game is so FUN! Keeps you wanting to play more!\n\nHelpful | 0", "vickyvaleAug 23, 2019 at 3:45 PM\nGreat Fun\n\nHave just updated this review from 4 stars to 5. This game runs so smoothly now (had a few crashes initially). This is a fabulous game that is a lot of fun and has a great atmosphere that puts you in a good mood, and gets you moving. Can highly recommend. The tennis is awesome and has me jumping around and laughing out loud - where else can you play tennis with a pool noodle or a fish as your racket? A fun, terrific way to burn calories and get fit. Would love to see more sports added in the future. Great job devs!\n\nHelpful | 10", "pilotman21Nov 2 at 5:39 AM\nAwesome\n\nIm dumb wheres online if there is any\n\nHelpful | 0", "nils.andrae.7Oct 11 at 7:15 AM\nLove it!\n\nOne of my best games on the Oculus!\nIts contans three sports thats realy fun and lots of options to choose from.\nAbsolutely worth the money!\n\nHelpful | 0", "sandigreenawaltNov 1 at 4:17 PM\n\nI got a win 12-39 in baseball\n\nHelpful | 0", "small3r1talianSep 24, 2019 at 8:25 PM\nFun game\n\nI play this game a lot. I like that you dont have to play the scramble mode. Its great. I dont like the tennis because it seems too hard and unfair, but its worth the price. Countless hours of fun.\n\nHelpful | 1", "fordasinNov 20 at 7:07 AM\nFound bug on Tennis\n\nWaiting opponent serve tennis and his do nothing.\n\nHelpful | 0\nDeveloper ResponseNov 20 at 1:43 PM\n\nHello TpTech123, Please make sure you're standing in the hexigon on the floor, inside the saftey area, that will tell the AI that you're ready to play. If that doesn't work, please send in a description of what you were doing at the time when this occurred to support@armature.zendesk.com and we will be happy to look into it. Thanks! ~The Armature Team", "VaporyBeatOct 8 at 12:17 AM\nGreat game\n\nSports Scramble is a great game and experience to play on the quest, the\nmechanics are great and a nice concept in general. I would 100% recommend\n\nHelpful | 5\nDeveloper ResponseOct 7 at 12:41 PM\n\nHello VaportBeat, You can toggle the intro on/off by going into the options menu while in the sports complex and then visiting \"Extras\" and turning \"Quick Start\" on. I hope that helps! ~the Armature Team.", "AllotaFaginaOct 7 at 10:18 AM\nOne dominoes large pizza\n\nPepperoni with extra cheese\n2 Lt sprite\nAnd cinnamon twist\n\n\nAlso the game is pretty fun first thing I wanted since I got the quest\n\nHelpful | 0\nDeveloper ResponseOct 25 at 3:46 PM\n\nYour pizza is on its way! Thanks for the order.", "NovelMakerAug 25, 2019 at 7:48 AM\nLove it\n\nIt was fun to play tennis with my boyfriend on Sheep's Meadow in Central Park on the day the Oculus Quest was released (May 21st, 2019, a date I may never forget). I loved the fact that we played tennis against each other with an invisible racquet and an invisible ball. A few people watched us. Not enough, in my opinion. :) I assumed there'd be lots of other people doing this in the park on May 21st, but we were the only ones, as far as I could see, which must mean I was officially the most excited person in Manhattan over the release of the Quest.\n\nHelpful | 4", "yudelthOct 10 at 6:27 PM\nGood app\n\nThis is the app I use the most. Tennis is very good designed. Baseball has some little details, but it's ok.\n\nHelpful | 0", "creftOct 14 at 5:43 AM\nFun\n\nReally fun game.I especially like the accelerator tennis challenge.\n\nHelpful | 1", "cigasdnaSep 10, 2019 at 10:25 AM\nFun game with major flaw\n\nThis is a really fun and immersive game! One of the best visually, and an all around fun game. But Ive had the game for about two months and never successfully entered s multiplayer game. VERY frustrating. Especially when you waste 15 minutes every time you try.\n\nHelpful | 3", "Emanuel20Aug 2, 2019 at 11:11 AM\n\nGreat game, I love playing tennis and baseball. I haven't even tried the multiplayer mode, but in general this game is a lot of fun. And I get a little bit of an exercise out of it. Highly recommend purchasing this game.\n\nThey should consider adding a couple more games to it (if possible), such as golf or basketball or hockey, etc.\n\nHelpful | 4", "roymuqAug 24, 2019 at 6:04 AM\nBest on Quest by far\n\nThis is one of the most complete and funnest game on Quest. The game was my most anticipated one before I bought the Quest, and with the high expectation still my favourite after I actually handed on it, and I play it at least the 90% of the time on Quest.\n\nThe only thing that I wish is that the developer would add a little more modes in the tennis game, it's soooo fun but meanwhile so basic, a campaign mode or something like personal advanced gear as a prize also would be perfect.\nAlso the multiplayer mode, to be honest... I have never successfully connected to anyone...lol\n\nAnyway, big thanks to the developers! Personally I feel like this game already made the purchase of the Quest worth the price, the game reminds me so much of the first time I handed on the Wii but the experience is sooo much better now with the Quest.\n\nHelpful | 2", "groovi12Nov 5 at 3:15 AM\nGood\n\nGood fun but would really want to play a proper tennis game !\n\nHelpful | 0\nDeveloper ResponseNov 7 at 1:14 PM\n\nHey groovi12: You can disable scramble options when setting up a game by selecting \"Edit\" at the bottom of the screen, and then either changing \"Scramble\" to \"traditional\" or by unchecking the Scramble Icons on the left side of the screen. ~The Armature Team.", "mckeller12Nov 10 at 12:25 PM\nMore games\n\nWill there be more game modes coming out\n\nHelpful | 1", "FinnyWiggenMay 23, 2019 at 6:19 AM\nReally Fun, But Some Major Flaws\n\nThis is one of the funnest games that I have played thus far on Quest. However it currently has some major flaws.\n\nFirstly it crashes roughly 1 out of 3 times that I try to start it. Usually requiring me to completely restart my Quest. Which is frustrating considering the second flaw. Which is that this program takes forever to startup. Then once it has started, you still have to go through multiple menus before you can even start playing the game. Some of these menus require you to pause and listen to a tip, or listen to the announcer say the same thing he says every time. There is no way to skip any of this.\n\nOne of the most powerful features of the Oculus Quest is how quickly you can start playing games as compared to the Rift. This is because you can just grab it, put it on, and start playing. Sadly, this game undoes all of those advantages.\n\nIf you are going to play you had better plan on three or four minutes before you can even start this game, and that is if it doesn't crash. If it crashes, then you will have an additional four or five minutes to restart the quest and then open the app again.\n\nHaving said that, this is a really fun and addictive game. One of the best on the platform. Hoping that they fix all the issues so that it can be truly great.\n\nHelpful | 278\nDeveloper ResponseMay 23, 2019 at 7:29 AM\n\nHey FinnyWiggen, This is Mark Pacini, Game Director of Sports Scramble. Sorry you seem to be having crash issues with Sports Scramble. We are always trying to make the game better, so if you have a moment can you please describe (in as much detail as possible) what lead to the events of your crashes, and post them here: support@armature.zendesk.com Thanks again for supporting Sports Scramble as we continue to compile and address feedback/issues from good folks like yourself. Best Regards, Armature Studio", "brodytendlerSep 30, 2019 at 5:03 AM\nGood game\n\nBut I needs more games\n\nHelpful | 1", "dingoflingAug 22, 2019 at 3:25 PM\nWii Sports, Sort of.\n\nGreat game for a workout. Try not to hurt yourself playing like I did by having the boundary system off on my Oculus Quest, Something I would only really recommend if you have a huge empty room, outside at the right time so the tracking works and your HMD lens are not at risk, an auditorium maybe. I digress, its a fun game that isn't simple versions of games such as, Tennis. Its like Tennis but zanier, using a cricket bat to rally with a Ping pong ball feels as good in game as it does in real life. Because of this game. I no longer need to play Tennis with my Pogo stick as a racket , or a 'birdie' (shuttlecock) when I lose them all when i bring them to bowl with. I can simply use a volley ball. Im hopeful for updates maybe more modes, items but its great as is. Thanks for making this game and putting this much effort into it. You guys are fantastic devs.\n\nHelpful | 0", "jimmy.bryant1Nov 7 at 9:30 AM\nNo sound\n\nNo sound and impossible to play\n\nHelpful | 0\nDeveloper ResponseNov 7 at 1:13 PM\n\nHey jimmy.bryant1. Sorry to hear you are having issues with Sports Scramble. This happens to be an issue that no users have experienced yet, but we would recommend trying the following: First try to reboot your headset. This usually helps with any odd issues that happen after a fresh install. If that does not help, please delete and then reinstall the game from the store. As far as the 'game is impossible to play', it would be great to get more information on this if the above recommendations do not work.", "tamaratbSep 1, 2019 at 12:19 PM\nTotally Fun and Sweat Inducing\n\nWhat a great way to get a little exercise on a rainy day or any day. This game has lots of variations and games within it, to keep boredom at bay. It looks great, and depending how you use it, it can give you a pretty good workout.\n\nHelpful | 0", "AymanjanAug 29, 2019 at 10:03 AM\nGreat\n\nThis game is engaging fun and easy, my only problem is online matchmaking, as nobody ever plays online and so I might wanna recommend a small little mini game to play while it loads to practice. Other than that, everythings good and all! Cheers\n\nHelpful | 0", "AuldstockSep 22, 2019 at 12:23 AM\nMultiplayer doesn't work\n\nThis would be getting 5stars if not for the truly awful multiplayer. It doesn't work like other games. It forces you to stand there looking at the load bar for a minute before telling you that no match can be found, want to try again and wait another minute? Almost every other game will allow you to play solo while searching for a game. Not this one. And I can honestly say after trying dozens of times to find a match, (nearly every day for 2 months) I've matched up once!!!! And that person lost connection halfway through. Great single player game but know what you want before you buy\n\nHelpful | 2", "pandroidJun 26, 2019 at 4:57 PM\nAlmost Great!\n\nThis is such a fun game. Kids and and adults both love it. What's stopping me from giving 5 stars is the intro and the difficulty. I don't know why it has to take that long with the announcer and tips that we cannot skip, and instead of skip button we get a replay intro button. Who actually wants to watch the intro? Second, I think the difficulty is too hard even on easy. I gave the tennis quickplay a try with many many different kids. None has ever won. Oh and sometimes it crashes too. I hope in the next update, these will be fixed.\n\nHelpful | 5\nDeveloper ResponseJul 3, 2019 at 1:09 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "rionoirbleAug 16, 2019 at 2:39 PM\nFun but no one to play with?\n\nI really enjoy multiplayer games but this one has had a hard time finding matches unfortunately. I really dont like playing such an obscure random game against the computer.\n\nHelpful | 2", "judyy19Aug 8, 2019 at 2:36 PM\nFun but lack of games\n\nThis is a very fun game. Has 3 amazing games, however, this gets boring sometimes. 3 games is just not enough. I would like to see more games added. But overall, very fun. The price is a little too much though.\n\nHelpful | 2", "The_RandomizerSep 19, 2019 at 10:05 PM\nmore sports?\n\nPlease add in golf as a sport and add stuff to do if u are waiting for a rare online match\n\nHelpful | 1", "MrFrankFontaineJul 6, 2019 at 8:43 PM\n\nUpdated my review as they released a patch and It hasnt been crashing. Two things keeping this from being 5 stars. Needs some more sports and you should be able to recenter yourself like you can in every other game. Sports Scramble likes to control your play space. I get it from a safety perspective, but if I have a generous play space, let me recenter myself as I want.\n\nAnyways, this game with the last update is great otherwise. Really feels like an evolution on Wii Sports. A lot of fun and really shows the strength of tether-less VR. Will recommend to friends.\n\nHelpful | 8", "endsequenceAug 8, 2019 at 5:13 AM\nWhere's the haptics?\n\nLove this game, especially when it's on traditional modes. But it has one major flaw imo, zero haptic feedback. A game like this needs it desperately! You need to feel like your hitting the ball or its just weird...\n\nHelpful | 0\nDeveloper ResponseAug 8, 2019 at 8:53 AM\n\nHey resequence, sorry to hear you are having problems with the haptics, as this is the first we are hearing of an issue like this. A suggestion would be to first confirm that you are getting haptics in the Sports Scramble UI. Simply go to any UI screen (like the 'Start' button in the HUB) and roll over it with controller pointer. If you are getting haptics there, we at least know that it is working. If you are not getting haptics there, take the batteries out of your controllers and put them back in. (or change your batteries) The next thing to try is go into Tennis or Baseball and stick the racquet out to the side when a ball is coming to you. Don't swing, just let the ball hit the racquet. Are haptics activating? If yes, then the haptics are working. It may be that the haptics are activating for too brief a duration during a swing, making it hard for them to be noticed. If that is the case, we can look into issues like that in a future update. Again, thanks for checking out Sports Scramble and reaching out with your valuable feedback. ~ the Armature Team", "AnnenoukJul 15, 2019 at 2:05 PM\nNice little game\n\nIt's a nice little game with some things to improve and one major annoyance. If you don't want the default tennis settings you have to adjust them every single time you want to play. Do a challenge and go back to playing a match? Yes, again you have to change them. You should be able to save them. For the rest it's a nice, simple and colorful game. Nothing special but enjoyable. The hard mode is still way too easy though.\n\nHelpful | 2\nDeveloper ResponseJul 16, 2019 at 5:09 AM\n\nHello Annenouk, I'm sorry you're having issues saving your Sport Spacific settings. Please try to set the settings you want in the options menu in the Scramble Complex. If that doesn't work, please send a report to support@armature.zendesk.com and we can troubleshoot with you. ~The Armature Team.", "cccha2Jul 3, 2019 at 9:56 PM\nBest 5 minutes of VR so far!\n\nSports Scramble Tennis is the best experience so far on the Oculus Quest. The level of immersion and polish is perfect to impress first timers. The 3 stars is because unfortunately, the game shuts off after 4-5 minutes and returns to the Oculus home page. This happens pretty randomly. Please fix this!!!\n\n***The New Update addresses the previous issue with stability. Hasn't crashed yet.\n\nHelpful | 4", "VRBabe14Jul 14, 2019 at 1:07 AM\nGood game for fitness minus the bugs\n\nI used to be able to find other people in multiplayer but not anymore. I have a friends list and sports scramble still says no friends found. It takes ages to search for other players too. I'm sure I'm not the only one that plays this game. It needs a lobby area where players can meet up and start matches.\n\nHelpful | 0\nDeveloper ResponseJul 15, 2019 at 9:58 AM\n\nHello VRBabe14, Please send in a ticket to Support@armature.zendesk.com and we will be happy to help try to troubleshoot the issue you're having. ~The Armature Team.", "FlyinAndyJul 27, 2019 at 3:54 PM\nSo far it's great! (Updated review)\n\nTurns out I was being an idiot. I couldn't get the game to work (see old review below), so I contacted the developer. They wrote back to me in about 10 minutes (on a Saturday!) and explained how to switch racket hands. Turns out you have to hold the controllers close together and angle them just right, like you would switch hands in reality reality (RR?), while pressing the grab button (or trigger button if you have it set that way in the options). That is great customer support! Normally I'm not this bad at games. LOL\n\nThe demo of this game is great, so am looking forward to playing the full game with the option to change settings (scramble, pro mode, etc.)\n\n---- Old review ----\nStarted tennis training and the game gets stuck on the first training session where it asks you to switch racket hands by pressing the grab button. No matter how long you press and hold the button it doesn't do anything. Tried switching to the trigger button and it still doesn't work. My controllers work fine in other games so it's not that. I really wanted to play this game!\n\nHelpful | 2", "R1PFakeJul 5, 2019 at 1:13 AM\n\nUpdate: The recent patch added a new option to skip the \"ball buy\"\n\nThe game itself is fun, BUT it takes forever to load and after the game finally loaded you have to listen to the \"hints\" of the \"ball guy\" every time, so it takes even longer until you can finally play. I would like a option to skip the \"hints\" and a option for faster loading times (maybe with a simple 2d menu instead of the 3d overview if this helps with the loading times).\nAlso multiplayer (quick play) is only possible if you pick at least 2 modes. I wanted to play tennis, but I couldn't start until I picked an additional mode and the game picked bowling all the time. Why do I have to pick 2 modes when I want to search a tennis match?\n\nUpdate: Changed from 3 starts down to 2. Like I already said the loading time is too long and there is no way to skip the annoying dialog of the \"ball guy\" everytime you start. At this point I almost don't want to start the game anymore, because it's just too anoying after a few days. Which is sad, because the game itself is fun, once you are finally able to play after waiting for several minutes.\n\nHelpful | 4\nDeveloper ResponseJul 5, 2019 at 2:56 PM\n\nhey R1PFake. once you get into the game, you can go to the options and turn on quick start. this will allow you to skip the tips. let us know if that helps. the Armature team", "mossioboyAug 28, 2019 at 8:39 AM\nEntertaining fun\n\nIf you love baseball, bowling and tennis you got to buy this. I am hoping the developer will add more sports like football, hockey and golf. =)\n\nHelpful | 1", "brian.walsh.142Jul 26, 2019 at 10:13 AM\nWhat a fun Sport Game.\n\nIm not into the realistic sports games that come out every year. So when I saw that this arcadeish sports game was one of the go-to launch games for the Quest. It had my eye, and I am not disappointed. I love the way the sports are unconventional yet still keep the same rules (with Bowling being my favorite.) Its also as good of a workout as Beat Saber. If the game is planning on DLC or a sequel, I would love to see what they can do with Water Polo or Fencing. My only nitpick is that I wish I could play with other people, but I understand that this isnt the games fault but I just wish someone else was playing the same time I am. Other than that I am still having a blast.\n\nHelpful | 3", "chaypaltonJun 24, 2019 at 2:18 PM\nSuper fun game\n\nThis game really show the Quest off to its best, the graphics are great and the playability is even better.\n\nYou feel like youre really playing tennis which is by far the best sport in the game, however bowling and baseball are fun.\n\nWhat interesting and impressive about the VR tennis is how the area you can move around in adapts to the guardian area you have setup, it also adapt the location your opponent serves too, so you dont have to go outside your guardian safe area to return serves.\n\nThe larger your room the more you will need to run around the tennis court to return serves.\n\nThe Scrabble part of the game is a great twist on each sport, it basically mixes up the element used to play that sport with (wacky) crazy alternatives, so with tennis the type of bat will change to; baseball bat, pool noodle, golf club, a fish and more, the ball changes to; baseball, beach ball, golf ball, fish ball, etc.\n\nThe Scrabbling is really fun, but its possible to switch part or all of the scrabble off so you can play the normal sport.\n\nReally fun and good exercise.\n\nHelpful | 5", "Robert-LMay 30, 2019 at 4:51 AM\nGreat family fub but with frustrations\n\nWhen playing a game, its super fun. Graphics are immersive, game play is intuitive yet challenging, good customization options, and unique twists on typical sports games. Great game for all ages. My kids love playing tennis with a fish :)\n\nIm not sure why the comfort rating on this is yellow instead of green. It plays well in small spaces, even better in large spaces where you can run around.\n\nId like to give this 5 stars but...\n\nIt crashes a fair amount, more than any other Quest title Ive tried. Hopefully the devs are getting diagnostics to fix this.\n\nAnd the verbose announcer cant be skipped so takes way longer than it should to get into actually playing. I appreciated the detailed explanations the first time but afterwards they are just in the way.\n\nAnd one last minor nitpick: on the Challenge menu, you cant tell what each challenge is without clicking into it. When looking for a particular challenge, this is frustrating because its extra steps. A redesign here would be good or at least speed up the pretty menu animations.\n\nHelpful | 19", "noozledMay 21, 2019 at 7:04 PM\nLots of Fun!\n\nSports Scramble is one of the few games I purchased at launch, and that was a great decision. Sports Scramble is a game that will get you up and moving, and you wont want to stop. It is super addictive, and the variety each game has to offer is great! I love the entire scramble aspect and I feel the game would much more easily turn boring without it. I am sure this game will be tired out eventually but it is definitely is well made, and a great first game to have your friends and family try out for their first time in VR.\n\nHelpful | 20", "pabe05Jun 2, 2019 at 5:31 AM\nBaseballs a home run. Best vr BB so far\n\nThe game out of the three I enjoy most is the one you heard the least of before launch. Baseball. Pitching batting and auto fielding.\nYou can turn off the crazy part of all three games to have a more realistic game if you prefer. Each takes some practice and each have many achievements that keep you coming back.\nBowling and Tennis are really fun too. Bowling got things right, a lot of stand alone games could not. { Side Note: I played on a 1/4 of a real basketball court in a school. On larger area's you need to work around the perimeter to set your boundaries. Smaller area's you can stand still and point } Have never had a crash or issue with this great game. Looking forward to other good games from this developer.\n\nHelpful | 17", "RedlineHellcatOct 11 at 9:34 PM\nMultiplayer seems not to work\n\nTried multiple times\n\nHelpful | 0\nDeveloper ResponseOct 28 at 12:25 PM\n\nHello RedlineHellCat, We're sorry to hear you're having issues with Multiplayer. If you're unable to get a match, try adjusting your playtime if you can. The amount of people playing can vary greatly depending on the time your playing. ~The Armature Team.", "appliedkibbleAug 30, 2019 at 10:34 AM\n\nMy partner and I have been enjoying playing this against each other. The multiplayer is legit\n\nHelpful | 0", "Gobs54Jul 10, 2019 at 7:20 PM\nFavorite Game on Quest\n\nI absolutely love this game. Ive always wanted a VR baseball game, so I spend most of the time playing baseball. Its a lot like Wii Sports baseball with the obvious twists. Its a ton of fun! My only minor complaint (and by no means does this make the game any less worth it) but the strike zone when batting can be really inconsistent. I got struck out on a pitch that bounced and one that went through my player. But again, amazing game!\n\nHelpful | 2", "VRBikerMay 22, 2019 at 3:34 PM\nSoooo much fun!\n\nThe scrambled tennis game is a blast. I purchased the full version and was blown away how much fun all the other games are. Surprisingly the bowling was also really fun. The best part is you dont have to wait for your turn as both players bowl simultaneously while competing for a high score while voice chatting.\n\nHelpful | 10", "vgregory6Jul 9, 2019 at 10:16 AM\nAwesome game, that no one is playing?\n\nI've had the game a few days now and have only played two games online. I wait forever while it try's to find someone else to play and it's just eating my battery up.\nIf you could come up with a way to say \"yes I want a multi player game\" then go off and play solo, until another player becomes available. Or a lobby to find other people to play with like in rec room.\nOr at least stop making me refresh every minute to find someone. I dont mind so much just sitting and waiting for someone. But if I have to keep hitting retry, it's just going to annoy me and I'm going to play something else.\n\nHelpful | 6", "Dporto18Jun 18, 2019 at 6:01 PM\nGreat game, multiplayer could use work\n\nMe and my husband bought 2 Vrs so we can play together. But when we pair to a game, we are never able to complete it. It always says one of us has been kicked out and we have to start over. And after the first time it kicks us out it takes FOREVER for us to reconnect with each other. I absolutely love this game, but I wish that worked better\n\nHelpful | 1", "mcoops26Jul 15, 2019 at 7:50 AM\nVery awesome, except for multiplayer\n\nGameplay is fast and intense very enjoyable. There are lots of challenges to take on and trophies to collect. Only con is that it is impossible to fina a multiplayer match\n\nHelpful | 0", "AlexLenJul 22, 2019 at 12:00 PM\nTo high price for the simple experience\n\nThe acuracy of hitting the ball is pretty low, you have the feeling that you hit it when it is behind you and not even close it is nowhere near realistic compared to racket fury table tenis and other similar. The expriences are to few and very plain and short for the high price.\n\nHelpful | 0\nDeveloper ResponseJul 22, 2019 at 4:05 PM\n\nHey AlexLen: Sorry to hear your experience with Sports Scramble hasn't been a great one. However, there are many other things to check out in the game - like 21 unique challenges, 60 trophies to collect, Traditional modes for all sports, as well as online multiplayer. If you are ultimately unhappy with your purchase, we encourage you to utilize the Quest content return program, information for which can be found here: https://www.oculus.com/legal/quest-rift-content-refund-policy/?locale=en_US Again, thanks for checking out the game, as well as your honest assessment. ~ The Armature Team", "manbearpig7777Jun 24, 2019 at 2:57 AM\n\nReally cool thought it was going to be a Wii sports like but way more the balls change into other objects and have different outcomes I'm a rift owner too so I'm picky about the games and this one really delivers only 1 issue you will need space to play the tennis but not really an issue\n\nHelpful | 2", "EgyptianPhoenixJul 9, 2019 at 9:28 AM\nFun\n\nIts so much fun when. I played the demo but now that I bought the real version Im having problems figuring out how to grab objects. How do you do that so I can play tennis and so on?\n\nHelpful | 0\nDeveloper ResponseJul 12, 2019 at 5:48 AM\n\nHello EgyptianPhoenix, If you're still encountering problems, please send in a customer service ticket to support@armature.zendesk.com and we will be happy to help you troubleshoot the trouble you're having! ~The Armature Team.", "BobbiHereJul 5, 2019 at 4:39 PM\nThank you! & Excellent game!\n\nupdate:\nThank you so much for your prompt response! Working perfectly now, as before. Thanks for such a fun game!\n\nPrior:\nPLEASE HELP! When I clicked update, it constantly says download failed. Then, I uninstalled and reinstalled and it still will not download; Continues to say download fail. Ive only had a chance to play it a couple times. Five star game. I look forward to your help. I could not find help online. I hope you respond right away. Thank you.\n\nHelpful | 1\nDeveloper ResponseJul 3, 2019 at 2:01 PM\n\nHello BobbiHere, Currently there are some issues impacting Oculus and Facebook, Please try again in a couple hours. If you are still unable to download the game / update after that, please send in a report to support@armature.zendesk.com and we can begin troubleshooting with you. ~The Armature Team.", "SirRealDealMay 23, 2019 at 9:46 PM\nDo Traditional\n\nThis game is much more than what you see on the surface. You will have much fun playing the game the way it's presented to you.\n\nBut wait.. there's more... they've included exceptionally good bowling & tennis simulators if you go to options & set it to traditional & hard modes.\n\nAMAZING.\n\nEspecially bowling.\n\nI haven't tried the baseball in those modes but I already gave the five stars so no need to update review later on. \n\nIf developers are paying attention, please bring us golf. I have the utmost faith in your abilities to make it so.\n\nThanks in advance!\n\nHelpful | 21", "Fix_QUESTMay 26, 2019 at 6:38 AM\nFantastic but underplayed\n\nThis game brings memories of Wii Sports with it's cute and really fun gameplay. Many people don't realize that you can play both Arcade mode and Standard where the sport is played with original rules. Also challenges are mega fun and that's my favourite thing about this game for sure.\n\nThe only downside as other people says is starting the game takes a bit too long.\n\nHelpful | 6", "treemlJun 14, 2019 at 2:39 PM\nCould be great\n\n*update Devs are listening, three stars for now, if they fix the common complaints 4 stars, IF they fix the physics, it's a five star experience!\n\nThe main problem with the game is the incredibly annoying and repetitive voice over robot ball thing that can't be dismissed or turned off. I don't need a running commentary on the game play, sure it was funny the first game I ever played. Then it became boring, then annoying as hell. The time you spend waiting for the ball robot speeches is almost as long as the actual game play. You should be able to disable this.\n\nAlso I can't find a single person so play multi player with, there doesn't seem to be anyone online to play with at all. Does the game not support random matches??\n\nThe game also doesn't let you reorientate your play forward facing position so sometimes you end up with a very small box around you.\n\nHelpful | 4\nDeveloper ResponseJul 3, 2019 at 1:10 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "JellowMyElbowJul 27, 2019 at 9:26 AM\nGood but...\n\nThere should be a home run derby mode for baseball and more sports\n\nHelpful | 1\nDeveloper ResponseJul 29, 2019 at 5:08 AM\n\nHello JellowMyElbow, You should try out Baseball Challenge 1, that is our version of Home Run Derby. ~The Armature Team", "iainmclJul 15, 2019 at 9:36 AM\nGreat and funny game\n\nHi can anyone help can play tennis and ten pin bowling but cant get to play baseball.dont know what Im doing wrong\n\nHelpful | 1\nDeveloper ResponseJul 15, 2019 at 9:57 AM\n\nHello Ianimcl, Please send a ticket in to support@armature.zendesk.com and we will be glad to help you troubleshoot your problem. ~The Armature Team.", "scintillaaJun 9, 2019 at 10:59 AM\nGood, but needs more options\n\nSo, as far as a sports game goes, Im pretty happy with this. I havent had the functionality issues some others have. Im not one much for the scrambles  I prefer a more straight forward game where if I want to play tennis, I can just play tennisand THANKFULLY you actually do have that option. You can opt for traditional game play. However, I wish there were also different options for scenery during game play. I am pretty low key, so even though I enjoy a crowd of screaming cartoons and super bright colors sometimes, I really wouldnt mind having the ability to make the court and playing fields....more traditional as well on occasionmaybe not all screaming bright colors, maybe even have a twilight or night mode? Its just all those bright colors for an extended period of time give me a headache. The training modes are good for that, but I also want to play a real game too without feeling like Im doing it at McDonalds, which is what the set reminds me of: a play-place, Which is awesome! sometimes. But sometimes you just want to focus on what youre doing and not the distractions around you.\n\nHelpful | 0", "tinfoil_unicornJun 25, 2019 at 2:03 PM\nGreat fun game\n\nThis game has a few problems with gameplay but over all it is brilliant fun. Occasionally the ball physics doesn't quite work, and the baseball bat is not satisfying to hold as you feel as if you are holding the very end rather than the bat itself. Generally it's a great experience though. Well done!\n\nHelpful | 1", "tripleh3lixJun 8, 2019 at 5:33 PM\nOverpriced, but really fun\n\nGame is a bit overpriced for what it is. Seems like something that would come with your Wii. However if youre dying to go bowling, play baseball, or tennis.. youll love it. The game is incredibly sharp.\n\nHowever more game modes like Basketball, and one or two other sports would make this game worth the purchase with a small price reduction in the near future.\n\nHelpful | 0", "brittany.cain.Aug 2, 2019 at 8:30 AM\n\n\nI love this game it got a fun twist to it that you don't really see in most games that's why I love it \n\nHelpful | 1", "Echo007Jun 20, 2019 at 9:23 AM\nVR Fun at Its Best!!!\n\nI love the fact that this game offers both a FUN Scramble version of Baseball, Tennis, and Bowling yet offers you the ability to also play traditional as well! The colors are crisp and clear and gameplay is completely immersive (so much so that one tends to disregard the guardian from time to time!!! ) The multiplayer mode is great fun!!! Im so impressed with this game and its become my absolute favorite to play with my kids who live far away. Keep up the fantastic work!!!! This is a MUST HAVE for Questers!!!\n\nHelpful | 3", "mikaserlaJun 1, 2019 at 4:32 AM\nMost of this game works.\n\nThis game is good but not great. The base ball works well but it would have been better if you could manually catch the ball in the outfield. The tennis is good. The bowling has some problems because the ball sometimes curves when you don't want it to and sometimes doesn't curve when you want it to. I eventually figured out that if I set the game to casual mode and \"keep the trigger held in\" the ball shoots straight most of the time. The online portion of the game doesn't always work well. Due to the fact that it is difficult to make VR games, overall (in its current condition), I give this game an 82  rating.\n\nHelpful | 3\nDeveloper ResponseJul 3, 2019 at 1:12 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "The_Quest_GuyAug 8, 2019 at 2:06 PM\nGreat game\n\nNothing wrong about it one of my favourite games on the quest\n\nHelpful | 1", "Holy4DJun 29, 2019 at 10:29 PM\nFun, but bouncing blob theme =(\n\nI really like this game, I feel its very unique and fun. The overall theme is my biggest problem. The player characters & background characters are colored blobs. Yes thats right, bouncing blobs. You are surrounded by a bunch of blobs. I understand wanting to limit whats in game to increase stability but, lets just do with out all the blobs in the stands and around the play area so you can create something with maybe a nose or an arm.I really hope they come out with an update to enhance the game with a theme change, there is a lot of potential here.\n\nHelpful | 2", "toaster52Aug 11, 2019 at 9:56 PM\n\nFun, but gets very repetitive very quickly. You start to see a lot of the same thing.\n\nHelpful | 2", "johndotpizzaMay 25, 2019 at 9:34 PM\nVery fun but dead multiplayer\n\nThis game is a lot of fun and plays great however it has two big flaws.\n\nMy first issue has to do with the sluggish menus. The startup is very slow with 3 studio logos, then you have to listen to the tennis ball guy talk to you for a moment, then you have to select your game and wait for another load, then you select your mode, etc. It's just too much waiting. This game deserves a snappy interface.\n\nSecond off, the multiplayer is effectively dead. After searching about a dozen times over the past 4 days for a game I've found a single match. Such a bummer because this game would shine with a thriving multiplayer.\n\nHelpful | 6", "glnpwlJun 3, 2019 at 12:08 AM\nMy Go To Game On Quest\n\nIt's a very polished game, with bowling, tennis, and baseball. The scramble part is they mix up the balls and how you play the game expected in the sport. It would be 5 stars except I find it takes forever to connect to someone in multiplayer, not sure if it's a lack of players or what. Letting us play a mini activity of some kind while waiting would be a much-appreciated feature. That said, if you're looking for a fun game with good physics, graphics, and challenges on your quest this is for you. I would say the game may be slightly overpriced, I would expect this experience to be closer to $20 than $30, but I'm playing the game enough that I feel like I'm getting my money's worth out of it. I don't think you will regret buying this game, its super fun.\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:12 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "CrispyCabotJun 25, 2019 at 11:46 AM\nNo where close to real sports\n\nI know it's sports scramble and it's supposed to 'scramble' the sports but I was doing the baseball, and it is just so awful. I'm pretty sure when you swing, it randomly picks a spot anywhere on the field for the ball to go, no matter how hard or how timed the swing is. Pitching is also ridiculous. The CPU was hitting home runs every time so I started not throwing strikes. Now they just swing and miss, but then the ball goes over the fence anyways. Doesn't really make sense. Overall I guess this would be a fun little game to fool around on but it is no where close to accurately reflecting aspects of the sports it tries to incorporate\n\nHelpful | 3", "thomas.townsend.752Jun 4, 2019 at 1:26 PM\nOld Geezer\n\nWe love this game. The whole reason for getting a second. So me and the misses can play together...or she can whoop me, as I stand there looking smashing as she does it, lol. Seriously, really fun, just wish they hadn't teased me with the football avatar...then no football....\n\nHelpful | 1", "TomatenmannMay 28, 2019 at 7:13 AM\nSurprisingly good\n\nReally enjoyed all of the three sports, though Tennis is probably my favourite. There's also a certain amount of depth to each discipline in terms of gameplay.\n\nYou can also remove all of the scramble stuff and play a more realistic version of each mode. At least in single player.\n\nOverall the game looks polished and has a very charming colorful style. Really impressive. One of the coolest effects for me were the various transformations of the bowling lane.\n\nFew negative points:\n\n- It takes a bit too long to just jump into a quick match. The intro is too long and the developers should cut a few menu screens and ok buttons. Make it a bit slicker.\n\n- Right now you can't choose a single sport for matchmaking in the online multiplayer. Minimum is 2 sports. Likely due to the low player base. Hope this will change soon.\n\nHelpful | 2", "Godislove4uJul 17, 2019 at 5:31 AM\nLike wii sports and in vr\n\nIt's more fun than I expected.I think they should add golf and basketball.Jesus is my Lord and Savior !\n\nHelpful | 2", "MalikartJun 20, 2019 at 4:20 PM\nVery nice, but has some issues\n\n1. crashes very often since i updated my quest to the newest firmware\n2. why cant i just pick Tennis alone when searching for multiplayer games?\n3. ball tracking could be better @ Bowling\n\nHelpful | 1", "stoli471May 26, 2019 at 8:54 AM\nGreat game but multiplayer is glitchy\n\nLove this game but multiplayer are glitchy and if your already in a party with a friend you exit the game and reload and if your not in a party the voice chat doesn't work. So painful. When multiplayer works it's a lot of fun.\nThere are only 3 sports and tennis is the best. The mix-up of balls and racquets at first was annoying but it really grows on you especially when you get a sport match. Also it's very hard to win a point in multiplayer tennis without using a slice and getting the right angle is not consistant. It would also be great to be abledisable the annoncer, loved him at first but it would be nice to turn him off.\n\nHelpful | 3\nDeveloper ResponseMay 24, 2019 at 11:31 PM\n\nHi stoli! Glad you like it! You don't need to leave the game to accept invitations - you can also accept them within the in-game multiplayer menu or the options menu. Keep scramblin'! Steve/Armature", "Real-SlimShadyAug 4, 2019 at 11:46 AM\nWhy arent people online?\n\nI like the idea. But i dont like that i cant connect to anyone playing online\n\nHelpful | 4", "Skaven7Jun 9, 2019 at 6:23 AM\nA lot of fun and a good work out!\n\nSports Scramble is the second game I've bought since getting the Quest and is worth every penny. It's fun and gives you a work out as well. I've actually slept better at night since buying this. Tennis without the scramble options is great and works perfectly. Would love to see a league mode added even if it's only against computer bots.\n\nHelpful | 4", "vinh.ungJul 4, 2019 at 11:08 AM\nNot much depth\n\nThis game is great for hopping in and playing for 30 mins but there isn't much to it. Additional games would easily remedy this. Since the recent update, loading times have decreased. Otherwise, don't expect too much and you'll enjoy the game for what it is.\n\nHelpful | 1", "ToxZecJul 3, 2019 at 1:46 AM\n\nVery fun game. The game had some long loading times when it first came out, but this has since been updated in the newest patch, and now also allowing you to skip certain unnecessary intros and messages.\n\nHelpful | 1", "m.olivianpJul 3, 2019 at 7:18 AM\nSorry:3\n\nsorry for that assessment, it was my mother who wrote. I liked the game, kind of crazy? Obvious but very funny, I do not know will do it or not, but have you ever thought about putting golf?\n\nHelpful | 2", "bhatia.rishitJun 6, 2019 at 10:45 PM\nAlmost There!\n\nReally fun, awesome gameplay. This is a game that made me want to buy the Quest the first time I tried at OC5. One of the best modes is multiplayer but unfortunately crashes sometimes once a user invite is accepted. Hoping more sports are added!\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:12 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "LightninXJun 25, 2019 at 6:31 PM\nMultiplayer issues fixed!\n\nUpdate: Big thanks to the Dev that helped me get the multiplayer working! I did not know there is a Friends Activity setting that has to be enabled in the Oculus App. Once we both turned it on, we had no problems playing games together.\n\nHelpful | 1\nDeveloper ResponseJun 24, 2019 at 9:21 AM\n\nHello LightninX, We're sorry you're having issues with multiplayer. If you are able, please email a support ticket to support@armature.zendesk.com and we can work on troubleshooting your multiplayer issues with you. ~ The Armature Team.", "daveeychillJul 15, 2019 at 5:43 PM\nGame wont load\n\nJust paid for this game and I am very frustrated as it wont even turn on. The demo works great and it seems like an awesome game. However, every time I load it, it just shows 3 dots and never turns on. I hope they fix this ASAP because its extremely frustrating!\n\nHelpful | 1\nDeveloper ResponseJul 16, 2019 at 5:06 AM\n\nHello Daveeychill, Generally when this type of issue occurs its due to a failed installation. Please uninstall and reinstall the game and try again. That should solve your issue. If you're still experiencing problems after that, please submit a ticket to support@armature.zendesk.com ~The Armature Team.", "RomeoSquareJun 28, 2019 at 6:32 AM\nFun, challenging and original\n\nMy favorite game at this moment. It looks really good, plays really well and the scramble gameplay actually adds something to the game. Only downside is that I cant find any other players for multiplayer.\n\nHelpful | 1", "backpocketMay 27, 2019 at 12:23 PM\nHard to track on quest\n\nI notice while playing that because of the inside out tracking it isnt uncommon for the balls to go all crazy because it picks up tracking at the last second and sends the ball anyways but straight.\n\nBesides that seems like a great game. Just don't take it to seriously.\n\nHelpful | 1", "surfacenormalMay 31, 2019 at 9:51 AM\nSports good! Scramble less good.\n\nVisually polished, and generally feels good to play. Wish I could remove all of the scramble nonsense and just play a simpler wii-sports-ish game of tennis or bowling with my friends.\n\nAlso wish there was an option to disable the announcer completely. It gets old fast.\n\nI really just want to jump in and play a simple, fluid game with friends, and theres a lot of small bits of friction (listening to the announcer, wading though menus, pausing the ball mid-game to switch out balls/rackets) to get there. Wish theyd take a page from Nintendo make nav/gameplay as simple and fluid as possible.\n\nPerhaps this could be an additional/alt mode? Maybe Im missing it somewhere?\n\nHelpful | 4\nDeveloper ResponseMay 31, 2019 at 11:56 AM\n\nYes, you can play traditional versions of all 3 sports in Single player 'Quickplay', or 'Play with Friends' in multiplayer. You can do things like turn off individual items like Scramble racquets in Tennis, or disable all scramble gameplay and enable traditional tennis rules. It is totally up to you. As far as quickly jumping into a game, we are working on that and should have improvements in future updates.", "SleepSmasherMay 25, 2019 at 5:58 AM\nMy new Mario 64 moment\n\nI have to say - when I first tried the Quest and the Sports Scramble demo, I had a pretty fun time but was still on the fence about a purchase. Fast forward 2 days, and I realised I could try the demo again in the buildings garage, where I could max out the room scale boundaries.\n\nHoly moly. The immersion is something else. I was running left and right trying to keep up with the AI player, simply ignoring hitting something since my play area was big enough. I got tired, exhausted - after playing the demo quick play match at least 20 times in a row. Then I went back to my apartment, bought the game straight away just to realize that I completely forgot that there are 2 extra sports as fun as Tennis, that you can customize everything and even disable the scramble mechanic, that the game is insanely fun and has a great replay value for the price. Dont sleep on this one ladies and gents - this is one of the best games of the Quest launch line-up and an amazing demonstration of how disruptive VR can be.\n\nHelpful | 8", "bstenzel85Jun 14, 2019 at 9:20 AM\nAddicting and Fun!!!\n\nLove this game, endless fun! Very quirky sports title. However i've been experiencing the occasional crash i've been reading about, which can suck sometimes because of the longer start time. Not a huge deal, I know they'll fix it. Otherwise, an awesome title!!\n\nHelpful | 1", "Spanky8237Jun 3, 2019 at 9:15 AM\nSo much fun! And a great workout!\n\nI was a little reluctant to purchase sports scramble at first. But after playing through most of the other launch titles I decided to go ahead and buy it. I wish I bought it sooner! You get to play 3 games, tennis, bowling, and baseball. These are all alot of fun to play solo, but multiplayer is where this title really\nshines. Every match I have entered almost instantly finds another player, then it's a battle to see who's the best. The tracking works great! Haven't had any issues yet. This will be my go to game for a while. Awesome job ob this one devs!\n\nHelpful | 2", "jhouffJun 2, 2019 at 6:26 AM\nWii Sportsmove over!\n\nThere is a new champion in the family friendly / easy pick up and play arena and its Sports Scramble! Honestly this is what I dreamt Wii Sports could be in VR but mixed with the power ups that constantly keep the matches unpredictable and engaging! Currently this is the best multiplayer title on the Questwith virtually unlimited replay ability. Even if you arent into sportsgive Scramble a go!\n\nHelpful | 2", "TeeJayComboMay 24, 2019 at 9:33 AM\nYES you can play standard sports too!\n\nThis is pretty much a more accurate and immersive Wii Sports with extra silly features that you can turn on or off. If you want standard bowling, baseball, and tennis, you can have it. If you want a bunch of crazy balls, lanes, bats, and rackets, you can have that too. Well worth the 30 bucks!\n\nHelpful | 9", "IfhyMay 22, 2019 at 10:06 AM\nBest experience in VR to date\n\nThis was so cool and different. I was able to set up a huge area in about 30 seconds outside in the office parking lot and played a legitimate, well paced tennis-like match. I never write reviews, but this whole experience was just nuts to me. The game looks fantastic and has an arcadey feel all around, but the hardware is just absolutely perfect for this game. A true must have for Quest in my opinion\n\nHelpful | 7", "michaelhughes355May 23, 2019 at 7:59 PM\nFun but more needed\n\nThis game is very fun to play and watch your friends play. However I believe that a couple of more sports or game modes should be added to be truly worth the price tag. Also the multiplayer is #broke\n\nHelpful | 7", "AKnightToDismemberJun 10, 2019 at 9:34 AM\nFun when it works but deeply flawed\n\nFirst off, the game is fun, but it only worth $10-15 unless they add in some additional sports and fix some bugs.\n\nIt's just 3 \"mixed up\" sports. The game seems polished when you first start playing, but then you start noticing all the stupid little problems. (Bowling pins that have fallen but not registered, baseballs hit without a swing, hard swung bat that barely moves the ball, errant tennis shots, goofy physics in bowling, etc.)\n\nOn top of the bugs, the game insists on stacking the odds against you by making your \"team\" commit ridiculously stupid errors that hand the CPU the advantage. (Easy pop-up to the infield? Dropped. Pop up right to an outfielder... dropped! And it does this pretty regularly.)\n\nAnd on top of all of THAT, we have the crashes. If you leave the app open for too long and come back, it'll crash and won't boot. You have to reset your quest to get it running again and then it will occasionally crash mid-game for no apparent reason. And when you restart the game, you can't skip through ANY of the unnecessarily long startup/intro sequence.\n\nDevs: Please fix this and make the price reasonable or add some new content to justify the ridiculous asking price.\n\nHelpful | 2", "LordVOLCANOJun 20, 2019 at 5:50 PM\nAmazing\n\nExcellent in a big area really feeling in a tennis court and giving good calories...Only i hope multiplayer mode will be more active...\n\nHelpful | 2", "ReDeR6Jun 4, 2019 at 2:37 PM\nThey can do better\n\nI'd like to give this game more stars, don't get me wrong - the game in itself is great. But the horribly long loading screen + stupid talking robot whenever you lunch the game that talks for unnecessarily long about stuff you don't care about + the crashes that make you go through the whole process of waiting from the start again + the fact that when you pause the app and go back it will reset and put you AGAIN on the loading screen from the beginning... it's just too much. The Quest is supposed to be \"put on and play\" headset. Not \"put on then wait 10 years to play a game that will crash so you can wait 10 years more\" headset.\n\nHelpful | 4\nDeveloper ResponseJul 3, 2019 at 1:12 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "bodlonMay 28, 2019 at 1:05 PM\nOutdoor play is mind blowing\n\nInitially I was skeptical that this would be too arcade-y and superficial but I was pleased to see it's easy to turn off the power ups and make the game feel more realistic (pro mode - not quite a \"physics\" mode but close enough). Then I tried playing it outdoors on a cloudy evening with the guardian setup to the maximum I could get it (about 7 sq.m) I was able to run around my half of the tennis court, which transported me to a level of immersion I'd never experienced in my 2+ years of playing on a Rift\n\nOnly downside so far is the slowdown when casting or recording gameplay and the occasional crashing back to the home screen\n\nHelpful | 2", "ManMythLegendMay 24, 2019 at 8:38 PM\nI hate sports. I love sports scramble!\n\nWhen the Quest launch list was announced I excitedly read up and started selecting ones to buy. Very last on that list was a sports game. But after trying the demo and hearing good things online I made the purchase.\n\nFrankly, this game is like if Nintendo made a wacky sports game. It oozes polish. Has too many modes to count. Has multiplayer. But it is also just a jaw dropping game to look at. Each night Ive come back to try something new and left smiling.\n\nWhat a delight!\n\nHelpful | 4", "Stormwalker626May 25, 2019 at 12:13 PM\nTop notch FUN\n\nI reccomend this to one of the first you play games with your quest reasons because honestly the fun and joy of having to use a tennis ball to bowl a strike really brought me back to my youth of just wanting a fun game no sense just pure fun. So if your interested in a game that you can play on hours on end this is your game.\n\nHelpful | 3", "x18percentMay 21, 2019 at 1:49 PM\nPerfect Mix\n\nIt has a weird mix of sports or just sports on their own and its perfect\n\nHelpful | 15", "ninjamasterdaveJun 8, 2019 at 8:01 PM\nFun for kicks and giggles\n\nThis game def has a very young demographic in mind. I think after playing this I really want more realistic versions of the sports rather than a mix and match sort of scenario. Fun to mess around with the baseball, tennis is ok, but the bowling is a hard pass. The lanes switch around, flipping over giving varied courses to throw the ball. But you also start throwing tennis balls, beachballs, etc. Just gets a little too wacky for my taste. If youre looking for wii sports oculus, this aint it. If you want a fun sports game for kids this might be perfect.\n\nHelpful | 1", "arthur2089May 24, 2019 at 1:22 PM\nWii Sports on Steroids\n\nThis is a great game to play with a friend. I love how you can remove the scrambled part from the game, and that it allows you to select pro mode, giving you more input on your motions. Iv played this game a bunch with my friend, and its a great time talking game to one another and seeing your friends movements articulated on a cartoon is well done.\n\nHelpful | 3", "steven.dandarawJun 16, 2019 at 10:21 PM\n\nCant get game to start. I open the game and it shows the three dots as if its loading. But, I wait and wait and the game never starts. Not happy!!! So I reinstalled the game and now it works fine. Thanks!!\n\nHelpful | 2\nDeveloper ResponseJun 13, 2019 at 10:43 AM\n\nHello steven.dadaraw, Thank you for your interest in Sports Scramble. The problem you're experiencing sounds like a failed or interrupted installation. Please uninstall Sports Scramble and then reinstall, this should resolve this problem. If it doesn't, please submit a report at support@armature.zendesk.com and we can help work through the issue. - The Armature Team", "ThundaGunExpressJun 16, 2019 at 9:12 PM\nOnline mode is broken\n\nI have tried several times over the course of the week to play a match online, and it can never find an opponent, even when checking off all games as an option. Hopefully this gets fixed soon!\n\nHelpful | 3", "twelveprawn93Jul 15, 2019 at 4:09 PM\nCant even load\n\nJust bought the game and tried starting it up but its stuck loading. I would love to play the game but the only thing that is preventing me to play is how ridiculous the load time is.\n\nHelpful | 1\nDeveloper ResponseJul 16, 2019 at 5:06 AM\n\nHello Twelveprawn93, Generally when this type of issue occurs its due to a failed installation. Please uninstall and reinstall the game and try again. That should solve your issue. If you're still experiencing problems after that, please submit a ticket to support@armature.zendesk.com ~The Armature Team.", "sean-lloydMay 30, 2019 at 6:37 AM\nAbsolutely Insane\n\nThis was one of the first games I bought, after playing the demo, and to be honest the demo does not do it justice. Already spent hours manically throwing wheels of cheese down bowling alleys. Would like to see more sports, but still worth every penny.\n\nHelpful | 2", "esengieMay 28, 2019 at 2:33 PM\nGetting the game started is a pain\n\nOnly two problems: starting is incredibly long, do long that I play it much less than I would otherwise.\n\nAlso crashes sometimes. Both are weird for Mario Tennis like game\n\nHelpful | 1\nDeveloper ResponseJul 3, 2019 at 1:13 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "Tarek_2020Jun 1, 2019 at 11:41 AM\nReally enjoyed it!\n\nReally enjoyed playing the game specially in multiplayer mode with friends .. if it just having more sports that would be awsome, currently its having (tennis, bowling & baseball) which could be played in single or multiplayer modes\n\nHelpful | 2", "LiquidmurrMay 25, 2019 at 4:48 PM\nGreat replay value\n\nReally deserves to be on everyones device. The demo should give you a good idea of the gameplay, my only gripe is that Id like the option to turn off scramble mode in multiplayer if both players agree.\n\nHelpful | 2", "ManochangJun 12, 2019 at 3:11 PM\nOk game. Relentless voiceover is bad\n\nThe game is fun once you get into it. However before you actually get into a game you have to sit through the same tedious voice over robot again and again. This game needs an and option to turn it off. It really prevents me from turning it on.\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:10 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "STZMay 31, 2019 at 6:06 PM\nGood .. but Crashes often/Screen tearing\n\nSo far it is lots of fun. playing tennis on pro mode is great.. in a large play space. There is lots movement and immersion.\n\nBad stuff-\nI have lots of issues with it crashing, and major screen tearing.\nScreen tearing at the main select area with the stadiums. If you turn around 360 degrees it will cause screen tearing. If you spin around in game i.e 360.. it will cause a black screen and crash to the home screen. There is no lost tracking warning, it just black screen crashes to the desktop. Hopefully this gets fixed with an update to the game or the Quest itself.\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:13 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "abdalla.alzaabi.7May 22, 2019 at 3:31 AM\nFun but no much contents\n\nThe game play is so fun but no much single player contents to justify the price. Hopefully there will be update to add tournaments as quick play get boring with time. Waited too long in multiplayer mode and nobody was playing\n\nHelpful | 12", "plofkonijnMay 23, 2019 at 2:56 PM\nPlays verry well!\n\nNice game! Looks stunning on the quest and plays well!! Nice launch title, hope they stay supporting thise game, like some online events?\n\nAdd me for some matches :)\n\nHelpful | 3", "checkminerJun 10, 2019 at 12:16 AM\nGreat game, but loading takes so long.\n\nThe loading takes around 2 minutes... And the talking tennis ball always talks whenever you enter the game\n\nHelpful | 0", "Luggnutt612Jun 1, 2019 at 10:59 PM\nCute and fun, bad as a sport simulator\n\nThe game is fun when you are up and running, despite bad physics, occasional bugs, and constant annoyances. Fine for a quick party game, bad for a sports simulator.\n\nThe accuracy of the sports interactions is poor. Honestly, it was better in Wii Sports. Throwing a ball where you want is extremely difficult unless you give up and use the auto-target, which takes all the fun out. (I can get through the challenges using a dart-throw or overhand axe-throw motion.) Tennis hits are much too forgiving, it is difficult to make a bad shot. Baseball batting feels ok sometimes, but almost arbitrary other times. I had a pitch hit my bat when I didn't swing and it went to the wall. It is difficult to hit a ground ball. You can bunt a home run.\n\nCompared to Racket Fury (ping pong), the accuracy of the sports actions are a joke. This game is more suited to kids who want to hit a great shot or a home run every time without really paying attention.\n\nStill, it is fun to be out on the diamond smacking dingers. The environments and characters are cute and fun.\n\nMenus are too large and proximal, so you need to crane your head around to read things or find the buttons you want. It's like being in the front row of a big movie theater. They seem to have made this bad choice to enable players to physically push menu buttons, a cute novelty that is impractical and clumsy. (You can switch to pointing to menu objects, but still the menus are in your face.)\n\nThere are a lot of interface animations and voiceovers that are cute but become tiresome almost immediately. Navigation is SLOW.\n\nGame crashes every couple hours, especially when you near the guardian boundaries. Bugs are present: I hit a home run that froze the game for five seconds then registered as a foul; the tutorial tells you that you can change options in the menus while those options are still locked.\n\nHelpful | 6\nDeveloper ResponseMay 29, 2019 at 12:11 PM\n\nHey Luggnutt612: We're sorry that your experience with Sports Scramble hasn't been a good one. If you are ultimately unhappy with your purchase, we encourage you to utilize the Quest content return program, information for which can be found here: https://www.oculus.com/legal/quest-rift-content-refund-policy/?locale=en_US Again, thanks for checking out the game, as well as your honest assessment. Armature", "MrBojangIesJul 27, 2019 at 10:39 AM\nAbsolutely no one plays multiplayer\n\nI bought this hoping for a fun multiplayer game and I have yet to find a single match online.\n\nHelpful | 1", "Freshjazz49May 31, 2019 at 6:26 AM\nPerfect\n\nJust perfect. Fun arcade game and simulation game ... I love to play some serious tennis matches ... In between I change to scramble mode to have some fun.\n\nHelpful | 2", "ponzumomoJun 10, 2019 at 12:04 AM\nFun, but..\n\nAlmost a perfect sport game, the only issue that hard to find other player with quick match.\n\nHelpful | 0", "toafJul 6, 2019 at 2:29 AM\nfun game but...\n\nload times, sometimes odds crashes, and a shame single player racket ball isn't in the tennis zone.\n\nHelpful | 0\nDeveloper ResponseJul 8, 2019 at 10:19 AM\n\nHey toaf, To help alleviate some of the loading wait time, you can go to the options and turn on quick start. This will allow you to skip the music build up and the tips.(and shaves off around 12 seconds from the start up) let us know if that helps. As far as the crashes, first try and reset the headset, as the latest patch should have fixed those issues. If you are still having crash issues, please submit a ticket to support@armature.zendesk.com if you have time. We'd really appreciate it ~ the Armature team", "PrimeTQuest4Jun 19, 2019 at 6:30 AM\nOne of my favorites\n\nI love all the games. And I can see that they are working on adding new stuff and Im excited for it. So a must buy\n\nHelpful | 1", "GearknightJun 6, 2019 at 7:15 PM\nYou don't know how baseball works!\n\nOk whoever you hired to make this game clearly does not know how to play baseball. When it comes to grounders when it actually hit the ground and someone catches it IT DOES NOT COUNT AS AN OUT! But somehow in your game it does. And every baseball game I play is somehow rigged for me to lose. My players seam to go slow when they are supposed to catch the ball. And the other teams npcs go faster than mine. How is that even fair?! So either you have someone fix it and/or fire the guy responsible, Or I'm not playing and demand a refund. SO FIX YOUR GAME!\n\nHelpful | 0\nDeveloper ResponseJun 7, 2019 at 7:41 AM\n\nHey Gearknight. We're sorry that your experience with Sports Scramble baseball hasn't been a good one. Some clarification - A fielded ground ball in the infield was purposely counted as an out to help speed up the pacing of our version of Baseball. (as well as make it less complex) Regarding the speed of the outfielders, we do have a system in place where an outfielder's run speed will increase if the current batter gets successful hits back-to-back. However, the speed should reset to normal after the next out is made. If you are ultimately unhappy with your purchase, we encourage you to utilize the Quest content return program, information for which can be found here: https://www.oculus.com/legal/quest-rift-content-refund-policy/?locale=en_US Again, thanks for checking out the game, as well as your honest assessment. Armature", "EvanboiJun 13, 2019 at 5:22 PM\nWont install\n\nI heard really good things about this game and I tried to install it but when I pressed the button it wouldnt install so I pressed the button again and again and I restarted my quest but it wouldnt work. If\nthe devs could please help because Ive been looking forward to playing this game\n\nHelpful | 0\nDeveloper ResponseJun 14, 2019 at 7:16 AM\n\nHello Evanboi, Thank you for your interest in Sports Scramble! Typically how you would resolve an issue of this kind is by uninstalling and then reinstalling. However, if it's giving you trouble simply installing the game in the first place, please email us a report at support@armature.zendesk.com and we can help troubleshoot, and reach out to Oculus if necessary for their assistance. Thanks! The Armature Team", "LamestGamrJun 14, 2019 at 12:00 PM\nGreat Sports Title\n\nThis title does a lot. You can play the wacky \"scramble\" modes as well as traditional modes. I especially like the traditional tennis and bowling.\n\nHelpful | 1", "ImakidMay 21, 2019 at 10:09 PM\nCant get enough!!\n\nOmg! We just received our Quest today, and though we are all busy with work or HW, the kids (13&14) & us parents just cant get enough!! We keep straying from our work/hw to play. So much fun!!!\n\nHelpful | 9", "mjeremy.millerJun 3, 2019 at 9:15 PM\nMust have but...\n\nI love everything but every inning i have go back to set it to throw with right hand option. Help please\n\nHelpful | 0", "richoskiJun 10, 2019 at 11:45 AM\nSlight annoyance\n\nLovely game but there is one thing that bothers me. The controller does not vibrate when you hit the ball in tennis, but it vibrates when you make a menu choice. Need feedback in the game to maintain immersion.\n\nHelpful | 1\nDeveloper ResponseJun 10, 2019 at 1:50 PM\n\nHey, richoski. Thanks for checking out Sports Scramble. This is the first we are hearing an issue like this from a user, as the game does have haptics (rumble) when balls are hit in Tennis. Can you try rebooting your headset and/or make sure there are fresh batteries in your controllers. If the problem continues to persist, would you mind putting in a bug ticket here: support@armature.zendesk.com Best regards, the Armature Team.", "Spamcan01May 22, 2019 at 7:41 PM\nThe ball is now a fish\n\nThe ball is now a fish, I have no explanation for this but the ball is now a fish. Five stars.\n\nHelpful | 15", "DosCompMay 26, 2019 at 7:25 AM\nIts fun but it crashes too many times\n\nThe game is super fun but for me it crashes every 5-20 min especially when playing bowling.. It just goes back to the homescreen and then I have to restart the whole game.. hope you guys fix that soon!\n\nHelpful | 2\nDeveloper ResponseJul 3, 2019 at 1:13 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "SoapySonJun 9, 2019 at 12:23 PM\nVery Good\n\nA great addition to the portfolio plenty of content and good controls. Hope they bring a basketball one in the future\n\nHelpful | 3", "Ajmods02May 29, 2019 at 9:33 PM\nAmazing!!\n\nThis is the first game I bought for the quest and it is one of the best sports games ever! It beats out wii sports! The fun I have had with the sports switching in game is one of a kind!!\n\nA+\n\nHelpful | 1", "posthuman87Jun 11, 2019 at 9:07 PM\nWorth it\n\nIts wonderful. Love the bowling mode with scramble off.\n\nHelpful | 2", "NoOneExistsMay 26, 2019 at 6:34 AM\nReally fun!\n\nAll 3 sports are a blast to play! They are very engaging, scrambled and traditional. The concept of the different ways to play with different equipment is great. Performance is also top notch.\n\nHelpful | 2", "poetic_is_hereJun 2, 2019 at 3:09 PM\nGreat VR Fun\n\nSolid game, graphics, and just enough content.\n\nHelpful | 3", "longsydneyJun 3, 2019 at 5:40 AM\nOriginal and whacky fun!\n\nLove the game and how original and funny it is! Addictive and has enough variety. Didn't have any issues with game crashing.\n\nHelpful | 2", "KnyghtJun 11, 2019 at 7:46 PM\nAwful loading time\n\nGame takes way too long to load at start up and between game selections. Not much content either. Just bowling, baseball, and tennis. Otherwise it's an ok game if not short.\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:11 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "ScurrydogMay 30, 2019 at 6:04 AM\nFantastic\n\nPro mode is worth it alone and the extra scramble modes are just icing on the cake.\n\nHelpful | 1", "OMGnexusMay 24, 2019 at 8:46 PM\nAmazing!!!\n\nThis is the best game Ive ever played on oculus quest ,there are so many different things to do. I would say its a must have for oculus quest.\n\nHelpful | 3", "LionolJun 26, 2019 at 4:38 PM\nAwesome\n\nThis game is great Ive been playing this for five minutes per day\n\nHelpful | 3\nDeveloper ResponseJul 3, 2019 at 1:10 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "ArinarJun 7, 2019 at 7:58 AM\nAwesome\n\nEveryone should by this masterpiece. So I can play with more people online :D\n\nHelpful | 2", "ChildashMay 26, 2019 at 8:15 AM\nTHIS GAME IS AWESOME!\n\nDefinitely the best sports car game and by far my favorite game thats exclusively on quest. I really hope that this comes to rift tho\n\nHelpful | 2", "glomc133Jun 15, 2019 at 7:55 AM\nmad game\n\nlov this game so much fun more like this pleeeease\n\nHelpful | 1", "Patrice_VRJun 3, 2019 at 4:56 PM\nAwesome\n\nIf you like wii sport or Mario sport style. Go get it ! Worth every penny !!!\n\nHelpful | 1", "popa.keith.7Jun 12, 2019 at 12:24 AM\nNeeds major update\n\nTo many glitches and really long load times. Multiplayer makes you reload the whole game\n\nHelpful | 0\nDeveloper ResponseJul 3, 2019 at 1:11 PM\n\nOur patch is live! It addresses several Quality of Life improvements and Player Feedback. You can find out more at http://www.armature.com/games/sports-scramble/updates ~The Armature Team", "RaycheruMay 29, 2019 at 8:20 AM\nTennis is my favorite!\n\nI love working out with this app!\n\nHelpful | 1", "irolagMay 25, 2019 at 9:53 AM\nSo much fun!\n\nBe ready to sweat, it's a great game.\n\nHelpful | 2", "fa5amatJun 12, 2019 at 9:10 AM\nNot work\n\nNot working\n\nHelpful | 2\nDeveloper ResponseJun 13, 2019 at 10:05 AM\n\nhey fa5amat. Can you describe a little more detail about this? What isn't working? Is the game not loading for you? Please try uninstalling Sports Scramble and then reinstalling. And if you can spare a minute, can you please send in a report with any sport of detail to: support@armature.zendesk.com Thanks - The Armature Team"]