{"App Title": "St. Jude Hall of Heroes", "App description": "Heroism in battle is traditionally celebrated with a statue. Every day, the staff at St. Jude Childrens Research Hospital witness extraordinary bravery from kids battling cancer and other life-threatening diseases. Yet these unsung heroes havent been celebrated at the scale they deserve.\nNow, thanks to virtual reality, weve changed that.\nThe St. Jude Hall of Heroes is a celebration to the inspiring strength of its young patients  by turning them into 60 feet tall statues.\nThe Hall of Heroes is a magical world consisting of floating islands connected by portals.  Each island contains statues that represents a story, a battle, a team, and at the center a young patient. You can wander freely among the statues, jump up for a closer look, and hear the inspirational stories behind each one, narrated by those closest to them.", "Purchase section": "FreeAdd to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not required", "Game Modes": "Single User", "Supported Player Modes": "Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Documentary & History, Educational, Narrative", "Languages": "English", "Version": "0.2", "Developer": "Flight School Studio", "Publisher": "St. Jude Children's Research Hospital", "Website": "http://stjudehallofheroes.com/", "Developer Privacy Policy": "None", "Space Required": "460.5 MB"}



["5 stars\n62%\n4 stars\n6%\n3 stars\n9%\n2 stars\n3%\n1 star\n21%", "Puerto-the-RicoJun 26 at 10:01 AM\nInspiring\n\nVery well executed but much more than that it inspires and restores hope. Countless stories I found myself fighting back tears. Im not typically a big softy but it touched my heart to hear the story of these children and their battles, but more importantly their victories. I personally feel we at least owe both them and ourselves a moment to hear their tales. To the developers, youve done a stellar job on the execution and breath taking environment.\n\nTo saint Jude: keep fighting the good fight!\n\nHelpful | 13", "GherronJun 25 at 2:21 PM\nVery Humbling\n\nThis is one of the sweetest, most poignant apps I have seen in VR yet. I dare any parent to listen to these stories and not get emotional. I like to imagine these kids reactions when they get to see a statue of themselves as heroes and hear their own story.\nGreat job (again) St. Judes!\n\nHelpful | 3", "Brock1985Apr 22 at 11:45 PM\nShort but VERY Sweet! \n\nVery cool and emotional way to tell their story!\n\nHelpful | 47", "malcriado9 days ago\nInspirational Journey!\n\nCongrats to all creators involved in making this experince and showing us how vittual reality can make us closer to stories we coudn't know about...keep them coming!\n\nHelpful | 0"]