{"App Title": "Star Chart", "App description": "Explore our Solar System, view constellations and meteor showers in your night sky, stand in the footsteps of Neil Armstrong & Buzz Aldrin on the Moon, explore Mars with the Curiosity Rover, and hold planets, moons, asteroids and even stars in palm of your hand.\n\nExplore the solar system, from the Sun to the moons of Saturn and out to the farthest reaches of Pluto. Gaze down and marvel at our solar system from above. Look up in wonder at the rings of Uranus. Feel the awe of floating in space around worlds no human has yet set foot on. See how the constellations of our night sky are made up of stars distant to each other in both space and time. Embrace the impossible distances and the inordinate scale of our universe.\n\nStar Chart currently includes:\n- An accurate real-time simulation of the night sky.\n- A 3D solar system to explore.\n- Orrery tour and exploration \n- Moments in Time: set foot on the Moon and Mars, explore the ISS Cupola & visit the New Horizons probe.", "Purchase section": "$9.99Add to WishlistShareComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Apps", "Genres": "Documentary & History, Educational, Simulation, Space/Universe", "Languages": "English, Chinese (China), Chinese (Taiwan), Danish, French (France), German, Italian, Japanese, Korean, Norwegian (Nynorsk), Russian, Spanish (Spain)", "Version": "1.7.7", "Developer": "Escapist Games Ltd", "Publisher": "Escapist Games Ltd", "Website": "http://www.escapistgames.com/", "Release Date": "August 22, 2019", "Developer Privacy Policy": "Star Chart: Privacy Policy\n\nOur privacy policy and more can now be found on our Permissions & Privacy section of our online Star Chart User Guide.\n\n\n\nEscapist Games Limited\n1st Floor\n16 Haydon Place\nGU1 4LL\nGuildford\nUK\nReg: 06814245\nHOME\nGAMES\nAPPS\nABOUT US\nCONTACT\nLINKS\n\tEscapist Games Facebook page\t\tEscapist Games YouTube Channel", "Developer Terms of Service": "Home\nLearn more\nSitemap\nPrivacy Statement & Usage of Requested Permissions\nPrivacy Policy - the REALLY simple version:\n\n\nWe respect your privacy. We don't do anything dodgy. You can relax. ;)\n\n\nNothing is as simple as we would like in the digital world, and even though we are upright people, some data is requested and used by us. But don't worry - it's all above board. If you're interested in exactly what we do and why, read on. If you just want to know that we don't sell your data or track you, then you can relax and stop reading.\n\n\n\n\nPrivacy Policy - the simple version:\n\n\nAny and all data we retrieve from your device through our apps are intended to ensure anonymity and to be used in aggregated form or to track specific issues and / or bugs (for example personal information like location data, IP addresses, etc.).\n\n\nAt the time of writing this (June 2018), although limited user data is collected by our apps, we do not actively disseminate nor trade this data.\n\n\nFor example, all GPS data is only used internally by our Star Chart apps to calculate information required to show you a representation of the night sky. Star Chart does nottransmit nor sharewith 3rd parties yourlocation information. If in the futurethis changes, wewill update this page and our privacy policy. We also acknowledge thatif we do change our policies on the collection of user data, we will do so in strict compliance with local laws - e.g. EU's GDPR laws.\n\n\nA detailed privacy policy is present at the bottom of this page.\n\n\nHowever, the following points are worth noting:\nWe use 3rd Party technologies to distribute our apps - for example; Google Play, Apple App Store, Amazon App Store, Oculus App Store, etc. Information on your usage of our app is often tracked by these companies and made available to us. Please review the privacy policy of these companies for information on your data usage.\nSome services in our apps - eg Voice Commands - may use the internet to send data back to the provider of these services - eg voice recognition service.In the example of voice recognition, companies like Google & Microsoft receive data to interpret your commands. These commands are then sent back to Star Chart in the form of text that we use to determine the action to take. Most companies that provide voice recognition services, store data received to help facilitate improvements of their voice recognition services.\nWhen you use the support email function we collect and receive data on your device and its location, this data is sent to us and linked to your email. This information is only used by us to narrow down any bugs you may be experiencing which are related to GPS coordinates, and reply to you with our help. We do not compile, track nor trade this non-anonymous data.\nSome of our apps - specifically the Mountain Biker game - have online cooperative game-play elements that require a small amount of tracked user data - specifically high scores and trail creation data on our servers. This data is used by us in two forms: to provide in-game social experiences to friends and other players & to understand usage of and improve the game - specifically what works and what doesn't. ie we use this data to hunt for bugs and to discover what people enjoy doing. To properly facilitate gameplay, the personal data tracked includes the above game-play data as well as IP addresses and user account IDs. This data is not traded, distributed nor available outside of our game servers and is only used by us to improve the game experience.\n\n\n\n\nRequested Permissions:\n\n\nDepending on your device and OS version, our apps may request you to approve certain permissions. Below is a list of these permissions and info on why our apps - eg Star Chart - ask for these permissions.\n\n\nLocation data:\n\n\nStar Chart needs access to your device's location data (GPS data) tocalculate a visual representation of the night sky. Wedetermine where on Earth you are located and therefore what night sky objects are visible to you from your current location. Denying access to location data means that you will not get an accurate reading of the night sky unless you manually set your location data in some other way. To calculate a visual representation of the night sky / celestial objects based on your current location we require access to some form of GPS data. If none is provided, the representation of the night sky will be incorrect.\n\n\nInternet access:\nOn some OS versions, Star Chart asks for permission to use the Internet so that it can, amongst other things:\nDownload updated information on the solar system, satellite and night sky bodies, including trajectories and general data.\nConnect to servers for access to purchasing and downloading in-app upgrades.\nConnect to our support page.\nSend a support email.\nLink to your own or our Social Media sites.\nAccess net-based APIs (egVoice Controls).\n\n\nRecord Audio:\n\n\nOn some platforms, Star Chart allows English speaking users to control Star Chart with Voice Commands. These voice commands areinterpretedby the OS's Voice API. On Android, using the Voice API for voice commands requires us to ask all users in all territories to give permission for Star Chart to 'Record Audio'.\n\n\nWe do not collect any audio from your device unless you specifically trigger the voice command function, and we do not share that data with anyone else other than as required by the API to interpret the audio commands. For example, some voice command software sends audio command snippets to a server where they are analysed & interpretedbefore the results are returned to the app so that your commands can be actioned. The companies we currently use for voice recognition are Google and Microsoft - details on how these companies treat your voice data will have to be reviewed on their own sites.\n\n\n\n\nPrivacy Policy - In Detail:\n\n\nThe UK companyEscape Velocity Ltd is the publisher and UK companyEscapist Games Ltd is the developer of various FREE, FREEMIUM and PREMIUM apps available on app stores including but not limited to Apple's App Store, Google Play, Amazon App Store, Oculus, Windows App Store, etc.:\nStar Chart and associated branded apps:Star Chart Infinite /Star Chart AR /Star Chart VR /Star Chart Cardboard / etc.\nNuclear\nMountain Biker\n\n\nThese SERVICES provided by Escape Velocity Ltd & Escapist Games Ltd are intended for use as is.\n\n\nIf you choose to use our Service, then you agree to the collection and use of information in relation to this policy. The Personal Information that we collect is used for providing and improving the Service. We will not knowingly use or share your information with anyone except as described in this Privacy Policy.\n\n\nInformation Collection and Use:\n\n\n\nFor a better experience, while using our Service, we may require you to provide us with certain personally identifiable information. The information that we request is retained by us and used as described in this privacy policy.\n\n\nThe app does use third party services that may collect information used to identify you. For your convenience, we have listed links to the privacy policies of some of the major third party service providers used by the app (however we recommend that you search for updated policies and review these policies with these sites yourself):\nGoogle\nApple\nOculus\nAmazon\nWindows\n\nLog Data\n\nWhenever you use our Service, in a case of an error in the app we collect data and information (through third party products) on your phone called Log Data. This Log Data may include information such as your device Internet Protocol (IP) address, device name, operating system version, the configuration of the app when utilisingour Service, the time and date of your use of the Service, and other statistics.\n\nCookies\n\nCookies are files with a small amount of data that are commonly used as anonymous unique identifiers. These are sent to your browser from the websites that you visit and are stored on your device's internal memory.\n\nThis Service does not use these cookies explicitly. However, the app may use third party code and libraries that use cookies to collect information and improve their services. You have the option to either accept or refuse these cookies and know when a cookie is being sent to your device. If you choose to refuse our cookies, you may not be able to use some portions of this Service.\n\nLocation Data:\n\nYou have the option to either accept or refuse our apps having access to your location data, and you can most often opt in / out of allowing our app to access your data in the settings of your device. If you choose to refuse allowing our apps to access your location data, you may not be able to use some portions of this Service, or some portions of the Service may not work as intended. For example, our Star Chart range of apps uses your location data to render an accurate picture of the night sky. Without this location data, the night sky images we render will be inaccurate.\n\nService Providers\n\nWe may employ third-party companies and individuals due to the following reasons:\n\nTo facilitate our Service;\nTo provide the Service on our behalf;\nTo perform Service-related services; or\nTo assist us in analysinghow our Service is used.\n\nWe want to inform users of this Service that these third parties have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose.\n\nSecurity\n\nWe value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, although we take reasonable measures to ensure it, we cannot guarantee absolute security.\n\nLinks to Other Sites\n\nThis Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are may not be operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.\n\nChildrens Privacy\n\nThese Services do not address anyone under the age of 13. We do not knowingly collect personally identifiable information from children under 13. In the case we discover that a child under 13 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us so that we will be able to do necessary actions.\n\nChanges to This Privacy Policy\n\nWe may update our Privacy Policy from time to time. Thus, you are advised to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately after they are posted on this page.\n\nContact Us\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us on: privacy@escapistgames.com\n\nComments\nYou do not have permission to add comments.\nDesigned by ARC Templates\n\nSign in|Report Abuse|Print Page|Powered By Google Sites", "Space Required": "414.1 MB"}



["5 stars\n44%\n4 stars\n19%\n3 stars\n18%\n2 stars\n9%\n1 star\n10%", "martin.mienczakowskiJun 17 at 2:03 AM\nNeeds some tweaks\n\nLooks really nice and has some powerful stuff going on but...\n\nIt would be lovely if you could edit date and time for the star chart. Id love to be able to preview what I can see at night or go to my favourite time of year.\n\nThe controls are confusing, one wrong press of a button and youre in the menu again!\n\nIf those two things were fixed it would be more than worth the cost, as it is Im glad I got an oculus voucher!\n\nHelpful | 7", "HiiragiDionMay 1 at 11:54 AM\nBeautiful\n\nThis app is gorgeous. The navigation is simple and it allows you to see models of stars and plants. I would give it 5 stars if you could search to find specific stars and constellations like you can for the planets. Otherwise perfect app.\n\nHelpful | 26", "joro0414Feb 17 at 12:28 PM\nI worked with Kepler data...\n\nOk. My review, I never leave them anywhere but this is up my alley. For what this is, its not bad. I worked with data from Kepler, so this obviously caught my attention. Saw an old review that AUs where off, theyre fixed now. Could not find anything out of the ordinary, at least from what I saw, but Im only 30 minutes in.\nSaw another review that stars in background look cartoonish. Ok, I get what your saying, I see it too, but the quest is built on a snapdragon 835, level of detail is limited, come on, this is irrelevant. Click on those stars and you get a great star class view in the palm of your hand, with basic info.\nI did notice, somehow when I clicked on Earth, I got population info on US cities. While impressed, this info was off. Boston dose not have 4.8 million. I live in the Philadelphia area now, and while that was correct, I think Philly is 6th in US cities, I clicked on at least 20 US cities that had more. Not really important for something titled Star Chart, but I see how some info could be off.\nControls while simple are annoying at first until you get a hang of them. Hit the wrong button just once and you come all the way out to the main menu, and have to start all over agin. This is the only reason I didnt give it a full five stars.\nAgain for what it is and what your working with, Star Chart is pretty impressive on the Quest, at 30 minutes max at a time. After 30 minutes, I needed to quit, but its definitely an app Ill come back to again and again. Definitely worth the $9.99 price.\n\nHelpful | 50", "jamesmwaddingtonApr 16 at 2:29 AM\n\nGreat app,was wondering though if it might be possible at some point to see descriptions of nebulae not seen from my home town eg magallenic clouds .\nI live in the U.K. and it is great that it shows the night sky at my location.\nThe extras are interesting too\n\nHelpful | 3", "patri.laJan 11 at 6:42 AM\nVery very beautiful... but....\n\nthe app is done very well and it is a wonderful experience to \"catch\" the stars or galaxies, nebulae, planets and sun, see them up close! The solar system is also well done even though I haven't been able to see all the satellites of Jupiter or Saturn.\nBut some values of LY or AU are wrong, please correct them! Also, I'd like a better definition of the stars, for example Betelgeuse is a red giant, others are white or brown dwarfs, etc. Still, some stars are binary or multiple systems, around Sirius A orbit a white dwarf called Sirius B, which makes its revolution around the primary. Albireo is a stellar system in which the primary is orange while the secondary is white-blue. It would be fantastic to also have these images where B revolves around A !!\nI have not found a search to be able to choose the objects to see. Maybe my mistake?\nHowever, I repeat the app is fantastic both in the idea and in the graphics. Congratulations, good !!!\n\nHelpful | 75", "barbara.leptig.7May 9 at 7:31 PM\nEducational\n\nGreat app if youre interested in astronomy. Ill show the grandchildren as they may find it informative for a school project. But for me not so interesting.\n\nHelpful | 2", "BloomieBloom1May 11 at 8:42 AM\nTrippy beyond belief\n\nI simply cant believe this doesnt have a 4.5 or higher average. You get to see what God would do if he had ice-skates. Ive instantly bought it for my Mum and my children will get the app too soon. Too amazing for words.\n\nHelpful | 3", "RossTrex1Feb 22 at 2:15 PM\nA dream realized\n\nWe live in wonderful times. Times where you can enjoy VR software that takes you places you could not physically go now. The graphics and controls are very good. However I have to say that the controls do take some getting used to and can be annoying at first. I really like the Orrery tour and the ability to walk our solar system. I have had a telescope since I was very young and have always loved planetary astronomy. This is really what I have always wanted. The ability to see our solar system and understand it in a new way through this wonderful VR experience. I will still use my telescope though this does not change or detract from the real thing.\n\nHelpful | 3", "divineassassinFeb 9 at 12:29 AM\nStars look cartoony.\n\nSo much potential wasted! The \"night sky\" is so bright and blue its like a cartoon caricature of space! The only way to view the stars is if you zoom into a planet, then star rotating yourself around the planet. Then the sky darkens and you can see the sky like it would look in real-life. But I'm not going to do that just to see the stars. Why would they do this???? I can't believe it!\n\nHelpful | 9", "tanner.johnson.7121Mar 30 at 11:03 PM\nReally enjoy!\n\nIm learning the constellations now and this app is a fantastic way to identify objects in solar system, really cool!\n\nHelpful | 2", "Fmagurno87Feb 23 at 4:12 PM\nNice but could be better!\n\nIts a nice app and the images are awesome... But, I would like to see more interaction like using the the remotes like hands to grab the planets and move it, turn it, zoom it etc....\n\nHelpful | 3", "IHATEEVERONEBUTMay 10 at 1:30 AM\nSucks\n\nNo I dont want this anymore\n\nHelpful | 0", "TheBirdeeJun 15 at 7:06 AM\nSpace in your hands\n\nI love space and space travel. I often keep the space station up on my laptop for the beautiful scenery and amazing technology. This app shows our solar system and moments in space exploration history. Just what I expected from the description. Recommend.\n\nHelpful | 0", "bowling45Jul 17 at 5:20 PM\n\nThis app is amazing!! I really like the graphics it looks so real!!\n\nHelpful | 0", "Rgraff406Feb 5 at 7:13 AM\nStar Chart\n\nIf you are into science and exploration this game is for you.\nNot only is it informative as a learning aid\nBut it lets you see and experience the wonder and beauty of the world and universe we live in.\nIt describes planets, asteroids, and constellations And allows you to interact with each area.\nAs kids move forward in school and are\nExposed to science classes, this year is a must see!\n\nHelpful | 2", "Lukasz_TMar 1 at 3:36 PM\nI love this Star Chart\n\nThe Graphics are amazing, please add search option so you can search for like M 101, Or other Deep Sky Objects\n\nHelpful | 3", "PrografFeb 21 at 2:57 PM\nAlways crashes\n\nThis is a very cool app. But it crashes all the time. Too frustrating to use.\n\nHelpful | 2", "CrystalinvirginiaJan 23 at 5:27 PM\nDont bother - 1st graders only\n\nDont bother. I was looking to travel through the stars...this app is for first graders.\n\nHelpful | 6", "Crazy_SaneOct 8 at 5:37 AM\nFull of misinformation, but looks nice\n\nHalf an hour into exploring this app I noticed lots of incorrect information in the orrery. Earth is not 2.4 au from the Sun and Mars' moons aren't 40,000,000 kms away from Mars. I wasn't even looking for errors, so I can only assume there are lots of mistakes. For an educational app, this isn't good enough.\nI sent an email to these guys 2 weeks ago and still haven't heard back, nor have the mistakes been fixed. I gave them the chance to avoid a negative review, but wasn't even acknowledged.\nAside from that, I actually like this app. The graphics are nice and the overall UX is good. Just don't use it as a resource for a school project.\n\nUpdate: A month later and the simple mistakes still aren't fixed. And I haven't heard any sort of response from the dev, even though they have replied to some reviews. I was hoping to increase my rating by now, but instead I'm decreasing it.\n\nA simple Google search and changing some numbers is all it would take. If the information was accurate, I might rate this app 4 stars.\n\nHelpful | 252", "CaptainFrostOct 20 at 7:49 PM\nAn interesting app, but needs work\n\nFirst off, I think this is a neat app. But it could really be so much better. Here's things I like about it: I especially like the presentation of information, and how you can have models of the planets in your hands. I like the different modes. I like the concept of a virtual planetarium.\n\nThings I don't like: The controls are unintuitive. You press the grip button or the a/y button and it goes back and even exists the app instead of the Oculus home button being the only button that exits the app. You do get used to that, but it's just a bit jarring when you accidentally do it. The Sky View mode is disorienting because there's no option to have some kind of land environment to block the lower half of the horizon. You can't choose a location to see the night sky at--it sets it for you based on your location. It's a nice feature but it'd be really great to choose your location. There's a sun glare which is really annoying and changes the brightness of the environment, makes it a bit hard to see.\n\nOverall, I'm thinking that I do like the app. I'm not completely satisfied with it, but it does fill a niche we don't have on the Quest yet.\n\nI do think it's a nice app but to me it definitely needs improvements.\n\nHelpful | 112\nDeveloper ResponseAug 23, 2019 at 12:21 AM\n\nThanks for the feedback. We'll review and see what we can do.", "shaun.walmsley1Nov 30 at 6:33 PM\nGreat app\n\nGreat app but the controls could be more intuitive, i keep on swithing the app off by mistake. I love the app though, beautifull graphics, informative too , a great educational tool !\n\nHelpful | 0", "charcharman2012May 9 at 5:04 PM\nSo fun\n\nId say it was so fun\n\nHelpful | 0", "FinnyWiggenAug 22, 2019 at 5:22 PM\nGood, But Could Be So Much Better\n\nThe port from Gear / Go leaves a lot wanting. It is basically a Gear / Go quality app, and not really ready for Quest yet. A great example of this is that you can only ever use one controller at a time. When you look at your controller, it actually looks like a Go controller in your view, rather than a quest controller. The buttons are all mislabeled as a result, and in the wrong places.\n\nThis could be so much better, if it took advantage of Quest's features. Why not let me grab objects and pan, spin, expand, in a natural way, instead of in the awkward way I currently have to do it using only one controller that doesn't even use all the buttons on that controller.\n\nAnother complaint is how fake the night sky looks. This is VR! Why not give users a place to go to see the night sky as it really looks, instead of making it look so small, confining, and fake. I would love to stand in a fake field or mountain somewhere and look at the sky, then fly out and explore, using the full power that Quest offers developers. This app puts you in a small globe that feels like it only extends out a few feet around you.\n\nI have used some amazing space apps in VR. Both in Rift and Vive. They could teach this company a lot.\n\nHaving said all of this, there are pros as well. It is the only app like it currently available. It does have some (though not very good) options for teaching my kids the constellations. It does let you travel through space, (though not very convincingly, and using awkward controls). However it is a good first step.\n\nHoping they put out a redo, after this first to market launch, and not simply port their Gear / Go app, but actually create a much more immersive experience.\n\nHelpful | 68\nDeveloper ResponseAug 26, 2019 at 5:58 PM\n\nThanks for the feedback. We'll review and see what we can do. Couple of notes - the controller is the Quest controller, but we've removed the sensor ring to stop it interfering with the UI of objects on your controller. The app isn't a Gear / Go port, but rather a \"port\" of the Rift version - pretty much includes everything there is from that version. We do have use a fully realistic & real-time 3D model of the solar system so when you travel to another planet, you are actually travelling the full distance - at faster than light speeds. But space is *big* (and mostly empty), so although we've found that free navigation is a great idea, it doesn't work well when done to scale - as our app is. Having said that, we appreciate your feedback and will look into what we can do to address these issues.", "philg7onr123Nov 2 at 7:31 AM\nAmazing !\n\nCan I just say how much I am surprised by this amazing app. I can't understand the people that moan about it. The graphics, the planet's, the detail, all are amazing. Being a long time astronomy fan, this is a dream come true. When I was a kid at school all we had was pictures in books of the planet's, very drab and dull. But this app takes you out there, floating over each selected planet. Thanks for making this such an amazing experience, well worth the money, very well done Sir !\n\nHelpful | 14\nDeveloper ResponseNov 15 at 3:48 AM\n\nHi philg7onr123, Thanks for your kind words, and so glad to hear that you're enjoying the app. All the best, the Star Chart Team.", "MichaelSanFranciscoNov 22 at 12:59 PM\nI Love These Educational Apps / Programs\n\nWhile I am a BIG fan of Pistol Whip, Star Wars and FPS games, I also immensely enjoy educational apps, games, and documentaries. E.g. Apollo 11 VR is fantastic .\n\nI would class Star Chart as educational VR. For me, the thrill is enjoying educational programs in VR, which adds to the thrill of seeing the subject matter in this one-of-kind medium.\n\nStar Chart does not disappoint; a testament to the quality of the program is it causing me to sit in space for 30 minutes taking in the universe, and marveling at all the sights.\n\nIf your thing is space exploration and filling your head with knowledge, press the \"Purchase\" icon immediately, if not sooner. If you change the TV channel past educational programs, move along here too, there's no zombies to kill, no opponents to blow up or shoot.\n\nP.S. This program is nicey done all things considered, including the low price point. It provides a lot of information in a fun and interesting way.\n\nThe choice is yours, have fun filling your head with data so you can be the life of your high school reunion party, or be the guy on the outside looking in at all the merriment.\n\nHelpful | 1", "CuivOct 1 at 5:06 PM\nFor an app named Star Chart...\n\n...it's not very good at star charts. It's great for the orrery and stuff (Aughra would approve), but the star Chart functionality is weak.\nThe stars are too big and bright, the Milky Way doesn't look remotely real, the background is too bright, you can't change time or location. It makes it very difficult to plan an observing session, or to just relax and pretend to be looking up at the stars. If anything Google Earth VR provides a better stargazing experience unfortunately.\nThere has obviously been a lot of love put into this app, but most of it in the flashy, toy-ish, game-ish department. This is all well and good, but I wish the dev would spend more time in making the star chart look more like a real night sky...\n\nThanks for making this though, it really the only app available for the Quest that remotely caters to stargazers.\n\nHelpful | 6", "k405wizardDec 3 at 12:51 PM\nInteresting experience\n\nThis is an interesting experience if you like watching the stars. I bought this for my wife, because watching stars is exactly what she loves. It was her first experience on the Quest and it has totally blown her away.\n\nHelpful | 0", "NewLebanonLibraryDec 6 at 10:49 AM\nAn Amazing App\n\nWe just tried it out and were amazed! The details for celestial objects, the ability to see planetary positions by date and the abundance of constellations made for a fun experience.\n\nHelpful | 1", "SpaceCapsAug 23, 2019 at 10:28 PM\nNot quite there...\n\nHey guys, thanks for porting this app over. I was crazy excited for this, but after about 30 minutes I was left a little disappointed. Just writing a review to point out the improvements I would like to see before purchasing again.\n\n1) scale\nI want the plants to be planet sized and the sun to be sun sized... Especially in the explore mode. Why is there no control over the altitude that we orbit the planet? The distance does NOT need to scale with sizes of celestial bodies. Just make distance scale properly with other distances, and size scale proportionately to other sizes. For example, the sun can look like it's close to the earth, but the earth should look tiny compared to the sun, and the distance from the sun to earth should be about 0.65 the distance from sun to Mars.\n\n2) free flight\nCan we have free flight through the solar system? It doesn't of have to be perfectly to scale (that would be ridiculous), but I'm sure you can implement some kind of free movement. Even in the orrery it would be nice to use thumbsticks to move around. Everything feel so restricted, but an app like this should make you feel free.\n\n3) sky box\nWhat's going on here? Why is it so blue instead of a deep black? Each star is so big, it's hard to even see what's going on, and tell significant stars from insure ones. Really difficult to see constellations without putting the cursor on them. I wish the stars looked how they look in a 12k 360 video of space!\n\n4) controls\nThe grip button takes you back to the menu? Trigger is a generic \"ok\" button, and the usual \"ok\" button (A or X) opens a menu? I want to grab that planet with the grip and throw myself around it! Please make the controls intuitive!\n\n5) orbit\nWhy is the orbiting either vertical or horizontal? Why cant it orbit in both axes, at any altitude? It feels locked into rails.\n\n6) Explore mode\nI want to zoom through the stars and see black holes (or at least the effects of them), nebulas, comets and neighboring stars. I want to hold both grip buttons and change the scale in an instant, and then push the thumbsticks forward to travel warp speed to other stars, and stop when and where I want. Why is it so restricted? The size to distance doesn't have to be to scale, just make distance scale with all distance and size scale with the other sizes.\n\n\nI wrote this review because I really want your app to do well. Take it with a grain of salt and keep up the hard work!\n\nHelpful | 16\nDeveloper ResponseAug 24, 2019 at 4:28 AM\n\nHi SpaceCaps. Thanks for your (brutal) feedback, and although we care a lot, and a review like this hurts us to our core... don't worry. We'll take it with a grain of salt ;) - not to say that we don't want to address your issues. We honestly only want to see good reviews and happy users. Having said that there are a ton of reasons that the app is as \"restricted\" as you say, too many to go into here, but something I'll gladly discuss with you in a social app or other forum. Again, just because we have reasons for doing what we've done, doesn't mean we won't take your feedback seriously and consider ways to resolve the issues. The controls are something we'll definitely review, as you're not the only person to mention them, and obviously we'd love to have the ability to make more of nebula, comets, black holes, etc. All the best, the Star Chart Team.", "TheMrChrisOct 17 at 7:44 AM\nMy 4 year olds like it.\n\nI bought this to let my young 4 year old kids discover the solar system. They loved walking around it.\n\nI'd like to give them a touch controller so they can discover more, but the controls are so weird that I know they'd instantly quit back to the main menu, like I did many times.\n\nI would give this app more stars if the controls were simplified.\n\nHelpful | 2", "Pyroclastic_SnowNov 7 at 12:16 AM\nEh....\n\nThis app isn't bad for something you'd use to stargaze but the control scheme really sucks. The grip button is used to move location most of the time but here it's the back button which is extremely unintuitive, not to mention jarring if you don't do the tutorials. The real pictures of galaxies are....fine...but when you click to look at a galaxy you don't really expect a flat picture. Even an artist interpretation is nice for that kind of thing, and I know the devs do artist interpretations because one of the asteroids in the orrary is done as an artist interpretation. If they do continue with the artist interpretation, at least make it a picture that you can look closer at that isn't see through. Additionally, the ability to turn planets to look at the tops and bottoms would be suuuper helpful because it's really sucky with the one light source to try and see those places.\n\nLastly, and this is just personal preference, throwing mechanics for when you're done looking at an object. It's my fav thing about vr personally to just chuck whatever it is out of sight. Not a necessity, but just something I would get a kick out of.\n\nOverall, not bad if you wanna use it for stargazing. The music is super creepy though, fair warning\n\nHelpful | 1\nDeveloper ResponseNov 15 at 3:51 AM\n\nHi Pyroclastic_Snow, Thanks for your feedback. We're looking into the controls. We very much want to create 3D replicas of nebula and galaxies. Hopefully we'll be able to do that at some point. Chucking planets... yeah that's definitely on the list ;). All the best, the Star Chart Team.", "izzatzubirOct 23 at 4:05 AM\nGreat for families and friends\n\nThis app is very easy to use and navigate. Exploring Solar System is awesome. And the sky view is very helpful during astronomy outreach in light polluted cities to show people on how the night sky would be.\n\nSince I do outreach on Astronomy, I would love to show to everyone especially teenagers on the secrets of the heaven. This app assissted me a LOT.\n\nFor the developers, thank you so much. You have helped many young people to pursue their careers in astronomy.\nFeatures that I think will be a great addition:\n1. Exploration on major exoplanetary systems\n2. Gravitational waves from colliding BH/NS.\n3. Manipulating time in skyview (fast forward, speed up, choosing a specific date)\n\nThanks so much. I hope your team will continue this great effort.\n\nHelpful | 1\nDeveloper ResponseOct 24 at 5:52 AM\n\nHi izzatzubir. Thanks for your kind words and feedback. We'll see what we can do about implementing your ideas.", "BennyBlaze776Nov 20 at 7:30 AM\nExcellent Environment.\n\nLove the Environment, Interface is Great, Love the Way it Warps from One Area to Another. Great Application to Explore the Universe in VR.\n\nHelpful | 0", "beachteen1Nov 29 at 7:48 AM\nBoring\n\nNot much to do, and the stuff that there is to do is just boring. Pretty to look at but boring.\n\nHelpful | 0", "Shane.allen09Dec 2 at 10:09 PM\nAmazing\n\nThis app is breathtaking\n\nHelpful | 0", "mark.burton22Aug 24, 2019 at 8:41 AM\n\nI think it is a good app for the money. A good tool for viewing before you go out to observe the real sky. Would be good to be able to put in a date and time so you can see what's up in the sky before you go and view in a few hours or days ahead. Many thanks for the hard work so far \n\nHelpful | 5\nDeveloper ResponseAug 24, 2019 at 9:18 AM\n\nHi Mark. Thanks for your kind review. We'll see what we can do about adding that feature. All the best, The Star Chart Team.", "andyphillips99Oct 16 at 12:58 PM\nHmm\n\nWas hoping for a kind of guided tour but it's very much \"click on these things - if you're not having fun you're not clicking on all the things\"\n\nThe apollo experience was honestly way better and cheaper too!\n\nHelpful | 1\nDeveloper ResponseNov 15 at 4:00 AM\n\nHi andyphillips99. Sorry to hear you're not enjoying the app. Have you tried the Orrery Tour of the Solar System? This gives you a 7 minute tour of the solar system. If you haven't tried it, please do. Kind regards, the Star Chart team.", "QuestFractalAug 23, 2019 at 8:46 PM\nNot realistic and limited\n\nWhat disappoints me the most is that it is not possible to see the planets with a real scale. I wanted to feel the immensity of the solar system and the planets. They appear like big balloons. I also wish I could rotate and move closer to the planets freely using both controllers. I asked for a refund.\n\nHelpful | 5\nDeveloper ResponseAug 24, 2019 at 4:19 AM\n\nHi QuestFractal. Thanks for your feedback and sorry to hear that you are disappointed. The issue with real scale is that the planets are sooo big when made to scale, and the user would be sooo far away you would get no sense of 3D - believe me, we've tried! :) . As a result, a flat texture would achieve the same result. However we'll continue to evaluate options for attempting to resolve this. All the best, the Star Chart Team.", "DoctorWhoInTardisSep 23, 2019 at 9:21 PM\ngood for doctor who fan\n\nit works perfectly for me now, but I wonder is there a way to turn off text on the planet... I want to record a video without text on\n\nHelpful | 0", "carlos_laOct 3 at 6:27 PM\nDecent visualizer, not very immersive\n\nIt feels like \"here's a thing, look at it. Here's another thing\", rather than \"you're in space now, have fun\"\n\nHelpful | 3", "glassneedlesAug 26, 2019 at 9:29 AM\nA promising start\n\nI bought this after using an app on my phone (Solar Walker 2) on my phone for years when I needed to check out something about the solar system (more common than you might think!) and this app sadly doesnt have the same level of features and polish as that.\n\nMy main complaint was around how hard it is to look at dwarf planets and asteroids. If you want to look at a planet (even Pluto even though it shouldnt be there) there is a dedicated submenu to get you over to it and subsequently you can find moons that way but despite searching for 20 or so minutes I couldnt find a way to do this with dwarf planets and asteroids. I was able to look at Ceres and Eros but only because I could work out where they were approximately and then spent a while pixel hunting. There are a lot of awesome things in our solar system outside of planets and moons and it should be easier to find them.\n\nI also couldnt find any artificial satellites that you could view either. One of my favourite things to do in Solar Walker is follow along with the stuff weve launched. If you could see where stuff like the Tesla or Voyager probes were currently that would be great and even better would be a mode that follows their journey through the system. Also having a toggle to view artificial satellites around planet systems would be interesting even if you couldnt zoom in for a full 3D model (Im aware that suggesting modelling even a few dozen significant satellites that we have put up would be quite expensive to do model wise).\n\nI did the tutorials for all modes and kept having to remember that the trip button was back and would take me back to the main menu. Perhaps to leave to the main menu requires holding it down for a few seconds might alleviate some of accidental returns to the main menu.\n\nOnce again veering into expensive territory but Id appreciate a bit more information on something when you go into a close up view. The information that is there is nice (oh though I didnt see indication of gravity levels on it) but a summary paragraph saying why this thing is cool could go a long way. Stuff like how Io is the most volcanic place in the solar system or how Titan is the only moon with a dense atmosphere. Some narration would be nice but I can see that getting annoying. Similarly I would love an option for Holsts Planets to play when on the respective body but I know thats a long shot.\n\nIf there was also a way to move around the planets differently that would be great too. The orbiting around is great but I would prefer more of a free form camera so you can properly view the poles.\n\n\nNow Ive mainly mentioned issues with the app so far but it is just such a kick flying around a giant solar system. Unlike others who mentioned that the flying doesnt give a sense of movement I dont agree with this. Yes it may seem like you are staying still relative to the stars around you but that just shows how big space is! I also loved how as you got closer to an object it slowly faded from being an extremely bright star to the familiar bodies we are used to.\n\nI look forward to future updates on this!\n\nHelpful | 2\nDeveloper ResponseAug 26, 2019 at 5:52 PM\n\nHi Glassneedles. Thanks for using Star Chart, and thanks for your honest feedback - we really do appreciate it, and we'll take it into consideration. All the best, The Star Chart Team.", "john.michael.5895Aug 24, 2019 at 12:59 PM\nGreat .. If u know how!!!\n\nGuys.. Just point with left controller and pull left trigger twice on explorer mode.\nDeveloper... Have you ever sought feedback.?\nIs it possible to include Halleys comet?\nIs it possible not to blackout or fade when rotating?\nIs it possible to put the name and location of artifical satellite?\nIs it possible you could put the location of Tabby star... The possible location of an alien mega structure that we are currently watching?\nIs it possible to include location of Fast Radio Burst?\nWill you be upgrading?\n\nHelpful | 9", "JohSm67Sep 26, 2019 at 2:11 PM\nCross Buy - Potential\n\nNeeds to be enhanced with some more stuff to be really spacey! Some more exploration of planets and stars and animations flying thru space would be cool!\n\nHelpful | 1", "Studly_McSexfireAug 23, 2019 at 7:35 AM\nPretty cool\n\nI like it. Cant be easy trying to model the solar system in scale. I think it does a great job giving you an idea how vast these distances and sizes get. On thing is when traveling it appears as though stars are wizzing by in between the planets. Would make more sense if they were asteroids . Maybe Im misinterpreting what they are. Over all awesome app\n\nHelpful | 6\nDeveloper ResponseAug 24, 2019 at 4:15 AM\n\nThanks for the kind feedback - the \"stars\" are dust / asteroids - without them travelling through space seems very very very empty ;) and no sense of movement is present.", "elsitherinoAug 29, 2019 at 6:45 AM\nStellar Cartography\n\nThis is exactly the kind of app I've been wanting, just a simple journey through the COSMOS where I can feel like I'm a junior Science Officer in Starfleet, tending to the Stellar Cartography records. I do hope controls are improved, made more intuitive, and that in time we can get more optimized, higher definition textures to take advantage of the capabilities of the Quest.\n\nAdditionally if a Wikipedia like data entry option were available for lesser detailed sites I believe that would really add to the sense of interactivity and help fill out the gaps in presented data on hand.\n\nThat said, it fulfills what is needed and does its job well without noticeable issues.\n\nHelpful | 0\nDeveloper ResponseAug 31, 2019 at 11:29 PM\n\nHi Elsitherino, Thanks for your kind words and we are looking into the control scheme. The Star Chart Team.", "roberto.feliciSep 19, 2019 at 3:02 AM\nInteresting concept, but too basic\n\nConcept is interesting, yet implementation is too basic. Little more than a demo. Should be free, or very low price.\n\nHelpful | 2", "i.maloufSep 28, 2019 at 6:13 PM\nGreat app!\n\nI love it :-)\n\nHelpful | 0"]