{"App Title": "SWORDS of GARGANTUA", "App description": "Swords of Gargantua is a VR sword-action game you can experience in single-player mode or online co-op with up to 3 other players.\n\nTraverse through the Tesseract Abyss floors with the aim of taking down the giant Gargantua in its deepest layer, Floor 101. \n\nMake use of various weapons and abilities which you earn with every attempt, and take on difficult battles along your journey. A wide variety of weapons are available, allowing you to pursue your own virtual reality action (one and two-handed swords, axes, maces, boomerangs, shields, etc.)\n\nWhile playing, you can use voice chat to communicate with your fellow warriors while taking on the enemies in Tesseract Abyss or join up to 8 players in a lounge for pre or post-game hangouts.", "Purchase section": "$19.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection requiredOculus Refund Policy", "Game Modes": "Single User, Co-op, Multiplayer", "Supported Player Modes": "Sitting, Standing", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Action, Adventure, Fighting", "Languages": "English (US), Chinese (China), Japanese", "Version": "1.3.4.30457", "Developer": "Thirdverse", "Publisher": "Thirdverse", "Website": "https://www.gargantuavr.com/", "Release Date": "June 6, 2019", "Developer Privacy Policy": "/\nHome\nProduct\n/\nAdventure\n/\nFAQ\n\n\n\nPRIVACY POLICY\n\n\n(Effective Date: June 13, 2018)\n\n\n\n\n\nYomuneco Inc. (Company, we, us or our) maintains this Privacy Policy (Privacy Policy) that summarizes the treatment of information provided or collected on the sites and in connection with our various services (collectively, the Services) where this Privacy Policy is made available to you, including, without limitation: (1) our website(s) (our Sites), and (2) our applications and related services for Mobile and/or Stationary Devices (defined below), including those accessible through third-party social networking sites or platforms (SNS) (collectively, the Applications).\n\n\n\nBy accepting our Privacy Policy and the applicable Terms of Service you consent to our collection, storage, use and disclosure of your information as described in this Privacy Policy.\n\n\n\nA. Types and Collection of Information\n\n\nOur primary goal in collecting the information described below is to provide you, the user, with a customized experience on our Service and to deliver better service, products, and more relevant content to our customers, prospective customers, and visitors.\n\n\n1. Types of Information We Collect\n\n\n\nWe collect three basic types of information in connection with our Service: (a) Personal Information; (b) Anonymous Information; and (c) Aggregated Information. Personal Information, Anonymous Information and Aggregated Information as used in this Privacy Policy are defined below:\n\n\n\nPersonal Information means information that identifies (whether directly or indirectly) a particular individual, such as the individuals first and last name, home or other physical address, email address, telephone number. Personal Information also includes identifiers, such as cookies, IP addresses and Mobile and/or Stationary Device IDs that recognize individuals over time and across different websites or online services, where those identifiers can be reasonably linked to an identifiable individual.\n\n\n\nAnonymous Information means information that does not directly or indirectly identify, and cannot reasonably be used to identify, an individual person. When Anonymous Information is directly or indirectly associated with or combined with any Personal Information, such Anonymous Information will also be treated as Personal Information.\n\n\n\nAggregated Information means information about groups or categories of persons, which does not identify and cannot reasonably be used to identify an individual person.\n\n\n\n2. How We Collect Your Information\n\n\n\nInformation Collected Directly From You\n\n\n\nWhen you use the Service, we collect information (including Personal Information) you provide to us directly as described below:\n\n\n\nRegistration Information. When you register with us (including directly through a Site or your Mobile and/or Stationary Device, or indirectly through an SNS authentication or other similar option) to create an account or profile within the Service, you may be asked to provide: (i) your age or birthday; (ii) your first and last name; (iii) your e-mail and mailing address; (iv) username, nickname, or password; (v) language preferences and (vi) such other information (including Personal Information) that may be necessary to complete the registration process.\n\n\n\nInformation Through Mobile and/or Stationary Devices. When you access the Service (during the registration process or otherwise) through your PC, tablet, console, smart TV, headset, smartphone, mobile telephone or other mobile and/or stationary devices (collectively, Mobile and/or Stationary Device), we may collect: (i) Mobile and/or Stationary Device type and manufacturer; (ii) mobile carrier; (iii) Mobile and/or Stationary Device identifiers or advertising identifiers (Device ID); (iv) telephone number; (v) Internet Protocol address; (vi) geographic location/country/zip code; (vii) platform version; (viii) installation, navigation, access, interaction, impression and engagement information; (ix) network connection type (3G, 4G, WiFi, etc.); (x) browser type; (xi) Mac address; (xii) iOS advertiser ID; (xiii) user ID and (xiv) such other information you voluntarily provide to us. In addition, we collect information you provide when you sign up to have Short Message Service notifications sent directly to your Mobile and/or Stationary Device. We use your Device ID to verify, audit and analyze your use of the Services. Please note that the Device ID alone does not constitute Personal Information.\n\n\n\nPayment Information. If your use of our Services involves any purchase, we may collect the payment and billing information necessary to complete the transaction. Such information may include: (i) your first and last name; (ii) your valid e-mail address; (iii) credit and debit card numbers, PayPal account information, bank account and wire transfer information and other third-party payment processor information; (iv) billing address; and (v) such other information you choose to provide. We may also receive your payment and billing information that you provide when your purchase is processed by another party, such as an SNS, third-party platform (e.g., iTunes Store or Google Play) or third party payment vendors. Please note that payments handled through a third party payment processing service provider and Personal Information disclosed in connection therewith will be subject to the applicable privacy policies of such service provider. This Privacy Policy DOES NOT address the collection and use of your Personal Information by such service providers. Moreover, the purchase of third party credits or currencies such as Facebook Credits may also be subject to additional third-party privacy policies.\n\n\n\nCustomer Service and Technical Support. When you communicate with us in connection with customer service and technical support, we will collect and store your contact information (including, without limitation, name, telephone number and email address), information about your use of the Service, your user ID and such other information you voluntarily provide to us in connection with such inquiry.\n\n\n\nProfile Information. We provide areas on our Service where you can post information about yourself and others and communicate with others or upload content such as photographs. Such postings are governed by our applicable Terms of Service. In addition, such postings may appear on other websites or services, or when searches are executed on the subject of your posting. Also, whenever you voluntarily disclose Personal Information on publicly-viewable areas, that information will be publicly available and can be collected and used by others. For example, if you post your email address, you may receive unsolicited messages. We cannot control who reads your posting or what other users may do with the information you voluntarily post, so we encourage you to exercise discretion and caution with respect to your Personal Information.\n\n\n\nInformation Received from SNS and APIs. When you access an Application through an SNS, you allow us to access and obtain certain information from your profile through such SNS and the applicable SNS platform Application Programming Interface (API). The information we receive varies by the Application and by the privacy settings you choose for the SNS and may include Personal Information, including, without limitation, the following, as allowed by you, the SNS and your privacy preferences: (i) your first and last name; (ii) your profile picture or its URL; (iii) your user ID number; which is linked to publicly available information such as name and profile photo; (iv) the user ID numbers for your friends that are also connected to our Application(s); (v) login e-mail you provided to the SNS when you registered; (vi) your physical location and that of your access device(s) (vii) your password; and (viii) your gender. By using our Application(s) through an SNS, you are authorizing us to collect, store and use/disclose any and all information you agreed the SNS could disclose to us through the API, including Personal Information, in accordance with this Privacy Policy.\n\n\n\nInformation Disclosed on Forums. You may also choose to disclose information in our chat rooms, diaries, communities, blogs, web forums, message boards or other public forms in Applications and our Sites (collectively, the Forums). You acknowledge and agree that information you disclose in such Forums is public information, and there is no expectation of privacy or confidentiality. If you access our Services from an SNS, you should also read that social networks terms of service and privacy policy. If you are unclear about what information an SNS is sharing with us, please go to the SNS where you access our Service to find out more about their privacy settings.\n\n\n\nEmployment Opportunities. Parts of our Service may relate to employment opportunities. They usually will be captioned Career, Job Opening or other similar labels or captions clearly indicating the employment opportunity subject matter (the Career Pages). We will collect employment-related information that you submit to us, including through Careers Pages.\n\n\n\nOther Sources. We may collect your information from other sources, including, without limitation, other users of the Service and third party information providers and partners. For example, we collect information you provide to us or third party partners when you enter any promotions, sweepstakes and loyalty program. Such information may be used to supplement your account information and/or profile and may be combined with other information we collect from you.\n\n\n\nInformation Collected by Automated Technologies\n\n\n\nWhen you interact with the Service, we collect Anonymous Information through automated technologies as described below:\n\n\n\nCookies. A cookie is a small text file that is sent to your browser from a web server and stored on your computers hard drive or Mobile and/or Stationary Device. We may use cookies to track Anonymous Information about our users (e.g., user name, pages viewed, time spent on our Site(s), games, and the sites visited just before and just after our Service) for statistical and market research purposes.\n\n\n\nWe use cookies to gather information about our users browser activities. We may also use local shared objects also known as flash cookies to collect information from you.\n\n\n\nYou have choices with respect to cookies. By modifying your browser preferences, you have the option to reject all cookies or limit the type of cookies you allow. Flash cookies operate differently from browser cookies and cookie management tools available in a web browser will not remove flash cookies. To learn more about and manage flash cookies please go to the following: http://www.macromedia.com/support/documentation/en/flashplayer/help/settings_manager07.html Rejecting or limiting the type of cookies may, however, in limited instances prevent you from accessing certain features on our Service.\n\n\n\nLog Files. Like most Internet services, we may also use log files on the server side to collect information from you. Your information held in log files includes your computers or Mobile and/or Stationary Devices IP (Internet Protocol) address, browser type, browser language, e-mail application, Internet service provider, referring/exit Web pages, computer platform type, date/time stamp, and user activity. The software enabling our Services has associated log and temporary files that are stored on our servers. These files store your account information, preference settings, system notifications as well as other data necessary to enable you to use our Service. Your information may also be collected in connection with regularly performed server backups.\n\n\n\nTracking Technologies. We use a variety of tracking methods to collect information from you, including, without limitation web beacons (also known as Internet tags, pixel tags and clear GIFs). Web beacons are small pieces of data that are embedded in images on the pages of websites to analyze the traffic patterns, such as the frequency users visit various areas of our Services. Pixel tags may allow us to advertise more efficiently by excluding our current users from certain promotional messages or identifying the source of a new installation. These methods may involve collecting information directly from you or through another entity authorized by us to collect information on our behalf. We also use these methods in HTML e-mails that we send our guests to determine whether the recipients have opened those e-mails or clicked on links in those e-mails. The information that we collect through tracking technologies is Anonymous Information.\n\n\n\nThird Party Advertisers. Many advertisements may be managed and placed on the Service by third parties. These third party advertisers may use cookies, web beacons or similar automated information collection technologies on your computer or Mobile and/or Stationary Devices to collect Anonymous Information from you. In some cases, we may have access to information from cookies, web beacons and similar automated information collection technologies used by third party advertisers on our Services and this information may permit us to identify other sites or services that you have visited that are also associated with the third party advertiser.\n\n\nThe use of cookies,web beacons or similar automated information collection technologies by third-party advertisers is subject to their own privacy policies. Once you have clicked on an advertisement and have left the Service, our Privacy Policy no longer applies and you must read the privacy policy of the applicable third party advertiser to see how your information will be collected, stored and used as part of their service. Specifically, privacy choices you have made on the third party site or platform will not apply to our use of the information we have collected directly from you or through our automated technologies.\n\n\n\nClick Through URLs. Some of our Services, including email messages, use click-through URLs linked to other content on our Services. We track this click-through data to help us determine interest in topics and use of the Services.\n\n\n\nB.Use and Disclosure of Personal Information\n\n\n\nUnless otherwise described elsewhere in this Privacy Policy, we will not use or disclose any Personal Information collected from you. Your Personal Information may be used alone or in the aggregate with information collected from other users.\n\n\n\n1. Use by Company\n\n\n\nWe use your Personal Information for any one or more of the following purposes:\n\n\n\n(a)  to allow you to register with us to create an account or profile within the Service;\n\n(b) to operate, maintain and improve our Service;\n\n(c)  to conduct market research analyses, including, without limitation, to analyze user characteristics and usage patterns in order to better understand how our Services are used and market them more effectively and to optimize the display of advertisements;\n\n(d)  to communicate with you concerning your account or, with your explicit consent or as permitted by law, to send you announcements, newsletters, promotional materials and other information about our Services or offerings of our business partners, and to offer you opportunities to participate in surveys, campaigns, contests and sweepstakes;*\n\n(e)  to prevent or investigate actual or suspected fraud, hacking, infringement, or other misconduct involving our Service;\n\n(f) to respond to customer service and technical support inquiries, troubleshoot problems, investigate incidents, and handle complaints;\n\n(g)  to provide the Services to you and our customers;\n\n(h) to complete payment and billing transactions;\n\n(i) to comply with applicable laws, regulations, legal processes or enforceable government requests;\n\n(j) to send notices, such as communications about your purchases and changes to our Terms of Service, this Privacy Policy and other Service-specific policies, and to enforce applicable terms and conditions set forth in such policies;\n\n(k) to enable user-to-user communications and other in-service communications and interaction;\n\n(l) to enable us to link your game ID with other game platforms;\n\n(m) to enable us to deliver information to SNS when you use or access an Application through such SNS;\n\n(n) to evaluate your potential employment at the Company, and if you are offered a job or become employed by us, for purposes related to your employment; and\n\n(o) to protect against harm to the rights, property or safety of the Company, its users or the public as required or permitted by law.\n\n\n\n\n\n*Any promotional emails we send will identify us as the sender and will include our contact details. Moreover, such emails will provide for an unsubscribe option. In addition, your consent to receiving promotional emails will remain current for two years or until you advise us otherwise in writing.\n\n\n\n2. Disclosure to Third Parties\n\n\n\nThird Party Service Providers. We may disclose your Personal Information to third party service vendors and partners (including carriers and content providers) in connection with our provision of the Services. Such third party service vendors and partners may be located in countries other than your country of residence and provide such services as payment processing, data analysis, e-mail delivery, hosting, order fulfillment, infrastructure and network storage, customer service, technical support, auditing, content licensing and promotional services.\n\n\n\nAdvertising of Third Party Products and Services. We may share (i) Aggregated Information; (ii) Anonymous Information; and (iii) certain technical information with third party advertisers for their direct marketing purposes, including, without limitation, to develop and deliver targeted advertising in the Service and on the websites of third parties. \n\n\n\nAffiliates. We may disclose Personal Information to our Affiliates (which shall mean subsidiaries, parent companies, joint ventures and other corporate entities under common ownership located anywhere in the world) for the purpose of transferring and processing such Personal Information based on our instructions and such purposes as described in this Privacy Policy.\n\n\n\nOwnership Change. In the event Company combines with another company in the future through a corporate merger, sale, acquisition, liquidation or other similar process, your Personal Information may be transferred with the business or a part of it, or may be sold as an asset of the business, to the successor organization in such transaction. If material changes to the Companys privacy practices will occur as a result of such transaction, you will be notified via prominent notice in our Service of any change in ownership or uses of your Personal Information, as well as choices you may have regarding your Personal Information.\n\n\n\nTermination of License Arrangements. Upon the expiration or a termination of any third party license arrangements involving one or more parts of the Service, your Personal Information may be transferred to the subject third party licensor in accordance with the terms of the applicable license agreement. In advance of such transfer to a third party licensor, the Company will notify you and other users in writing in the manner described in this Privacy Policy.\n\n\n\n3. Safety, Security and Legally Required Disclosures\n\n\n\nYour Personal Information, and communications you make within the Service, may be accessed and disclosed if we believe that our Service is being used in the commission of a crime, when we believe in good faith that there is an emergency that poses a threat to the safety of you or another person and when necessary either to protect our rights or property including to enforce our Terms of Service, or for us to render the service you have requested.\n\n\n\nWe may also disclose Personal Information when required by law, regulation, court order, or in response to a subpoena or litigation discovery request, or in the good faith belief that such action is necessary in order to conform to the edicts of the law or comply with a legal process served on us. In addition, we will make any legally required disclosures to government authorities and provide notice to you of any breach of security, confidentiality or unauthorized release of personal or private data in accordance with applicable laws, rules and regulations.\n\n\n\nC. Storage of Information and Security\n\n\n\nWe employ reasonable measures (both online and offline) to protect the security of information we collect from you. Such information is housed in secure databases, equipment and servers located in Japan and/or in other countries. The databases, equipment and servers we utilize may be owned by third party providers. To prevent unauthorized access, loss, or misuse, maintain data accuracy, and ensure the appropriate use of information, we have put in place physical, electronic, and managerial procedures to safeguard and secure the information we maintain. We use industry-standard technology, such as firewalls, in an effort to protect the confidentiality of your Personal Information. Moreover, in addition to password protection offered in connection with your Service account, we encrypt your transmission of sensitive information to us (e.g., account passwords and payment-related identifiable information) via SSL (secured socket layer) protocol in the interest of heightened privacy protection and information integrity.\n\n\n\nAlthough we take reasonable precautions against possible security breaches of our Service, databases, equipment or servers, and records, we cannot guarantee that unauthorized access, hacking, data loss, or other security breaches and factors beyond our control will never take place and result in disclosure of your Personal Information. Accordingly, we disclaim any guarantees, warranties or representations relating to maintenance or nondisclosure of any Personal Information collected from you. We strongly urge you to take reasonable measures at all times (online and offline) to protect your Personal Information, including your password and other sensitive information.\n\n\n\nIn addition, while we strive to protect your Personal Information, you should know that information sent over the Internet, whether by e-mail or by using one of our on-line forms, is not necessarily secure against interception. Therefore, we cannot be responsible for such interception and cannot guarantee the security of such information.\n\n\n\nWe will investigate, attempt to resolve and take all reasonable steps necessary to ensure that your Personal Information and data is treated securely and in accordance with this Privacy Policy.\n\n\n\n\n\nSubject to your rights under Section D.2 (Review, Update, Correct or Delete Personal Information), we reserve the right to preserve your Personal Information for record and/or legal compliance purposes for a reasonable period of time and will delete your Personal Information in accordance with our document retention policy and applicable laws.\n\n\n\nAdditionally, we reserve the right to preserve and use Anonymous Information and Aggregated Information for statistical purposes without any restriction.\n\n\n\nD. Additional Privacy Policy Terms\n\n\n\n1. Opt-Out Provision\n\n\n\nYou may opt out of having your Personal Information used for the following purposes at any time by emailing us at privacy@yomune.co and include your user ID or registered email address so that we can confirm your identity. We will use our commercially reasonable efforts to comply with your request.\n\n\n\n(a) Receiving Marketing Communications from the Company. You may opt out of receiving marketing communications from us relating to our Services, including, without limitation, announcements, newsletters and promotional materials or offers to participate in surveys, campaigns, contests or sweepstakes, by choosing not to opt in when we ask for your prior consent to receive commercial electronic messages, including text and email messages, and direct social media messages.\n\n\n\n(b) Disclosing Personal Information to Affiliates. You may opt out of us disclosing your Personal Information to our Affiliates for marketing purposes by choosing not to opt in if we ask for your consent in advance or emailing us.\n\n\n\n(c) Disclosing Personal Information to Third Party Service Providers. You may opt out of us disclosing your Personal Information to authorized third party service providers for marketing purposes by choosing not to opt in if we ask for your consent in advance or emailing us.\n\n\n\n2. Access, Review, Update, Correct, or Delete Personal Information\n\n\n\nGenerally, you may access, review, update, correct or delete your Personal Information collected by or through our Service by logging into your account. You may also correct factual inaccuracies. Certain types of Personal Information that is necessary to check eligibility, such as birth date or age, cannot be deleted for active accounts, but may be modified with sufficient verification of the new information. Note that we reserve the right to terminate or delete any registration or promotional entry if we believe the Personal Information submitted was knowingly false or fraudulent. To delete your Personal Information, you may also contact us by email at privacy@yomune.co.We will use commercially reasonable efforts to honor your request.\n\n\nTo have access to your Personal Information, you must provide proof of identification such as full name, street address, city/state and zip/postal code, user ID, and/or information about your recent activity on our Service. We reserve the right to deny access to any user if we believe there is a question about your identity. In certain situations, we may be unable to provide you with access to all of the Personal Information that we hold about you. Exceptions may include information that is prohibitively costly to provide, information that contains references to other individuals, information that cannot be disclosed for legal, security or commercial proprietary reasons, and information that is subject to solicitor-client or litigation privilege. Moreover, we may still retain an archived copy of your Personal Information in our files as required by law or for legitimate business purposes, including, resolving disputes, enforcing the Terms of Service, and for other technical and legal requirements and constraints related to our Service.\n\n\n\nTo manage the information we receive about you from an SNS where you access our Service, you will need to follow the instructions at that SNS for updating your information and changing your privacy settings.\n\n\n\nPursuant to Section 1798.83 of the California Civil Code, customers, prospective customers, and visitors of our Service who are residents of the State of California have the right to request certain information regarding its disclosure of Personal Information to third parties for direct marketing purposes. Canadian federal and provincial laws provide a similar right of access. If you are a resident of California or Canada and wish to request such information, please email us at privacy@yomune.cowith California/Canada Privacy Rights in the subject line.\n\n\n\n3. Notification of Changes\n\nWe reserve the right to update and change the terms of this Privacy Policy at any time. Any changes to this Privacy Policy will become effective when the revised Privacy Policy is posted through the Services or otherwise made available to you. If we decide to update and materially change the terms of our Privacy Policy, we will post those changes in our Services and/or on the applicable Sites, and in the updated Privacy Policy. You should periodically check this Privacy Policy for updates. We will also keep prior versions of this Privacy Policy in an archive for your review.\n\n\n\nBy continuing to access or use the Services after we have posted an updated Privacy Policy or have provided you with notice of any material modifications to same, you are agreeing to be bound by the modified Privacy Policy. If the modified Privacy Policy is not acceptable to you, your only recourse is to cease using the Services.\n\n\n\n4. Links to Third Party Websites, Services and Offers\n\n\n\nOur Service may contain links to other websites, services and/or offers from third parties. We are not responsible for, nor will it be liable to you or any third party for, your interaction with such third parties or the information requests initiated by such third parties or the subsequent use, treatment or dissemination of the information (including any Personal Information) you voluntarily chose to provide to them. You should review the applicable privacy policies and information practices of such third parties carefully before providing Personal Information to them. Moreover, if you have any questions or concerns, you should contact the third party directly.\n\n\n\n5. Protection of Childrens Privacy\n\n\nIf you reside in the United States, the following applies: Company is committed to providing special protection for the privacy of children who may use our Service. The Service is not intended for nor directed to children under the age of 13 and we do not knowingly collect, use or retain Personal Information from such children. If we discover that we have inadvertently collected Personal Information from children under the age of 13, we will take all reasonable measures to delete any records of such Personal Information that come to our attention.\n\n\nIf you reside in a country within the European Economic Area (EEA), the following applies: We do not knowingly collect Personal Information from children under 13. When our Services request information and users identify themselves as being under 13 or the equivalent minimum age in the relevant jurisdiction, the Applications may block such users from providing personal information. We strongly recommend that the parents and legal guardians of children using our Services actively monitor their childrens use of the same. If we find children under 13 or the equivalent minimum age in the relevant jurisdiction using our Services, we will ensure that consent is obtained from their parents or legal guardians for processing of the children's Personal Information. The parents or legal guardians can review, edit, request the deletion, or prevent further collection or use of their children's Personal Information or make inquiries regarding this Privacy Policy by sending an email to privacy@yomune.co.\n\n\n\n6. Special Note to Parents\n\n\nIf you become aware that your child has provided us with Personal Information without your consent, please notify us so that we may delete such information from our records and discontinue any related features or services (see Opt-Out Provision above). We also urge parents to instruct their children never to give out their real names, addresses or phone numbers without parental permission when using the Internet. We appreciate your cooperation in assisting us to provide a safe and enjoyable online experience for your children.\n\n\n7. Users Outside Japan\n\n\n\nThe Company is a Japanese company and Companys business operations are primarily conducted in Japan. We operate our company and administer this Privacy Policy under the applicable laws and regulations of Japan. If you use our Service from outside Japan, you are thereby consenting for your Personal Information to be transferred to, stored in and be processed in Japan and/or other countries by the Company and/or its Affiliates in the manner described in this Privacy Policy. Your consent to this Privacy Policy followed by your submission of your Personal Information represents your agreement to such transfer, storage, and processing of your Personal Information. Furthermore, you acknowledge that the privacy laws of Japan may differ from the laws in the country where you are located and may not provide you the same rights or protections for your Personal Information as those laws.\n\n\n\nAs described elsewhere in this Privacy Policy, when you submit Personal Information to us, the information is housed in secure databases, equipment, and servers located in Japan. The databases, equipment, and servers we utilize may be owned by third party providers.\n\n\n\nUsers in certain jurisdictions may have a right to access his/her Personal Information held by the Company, its Affiliates or authorized third-party service providers. Your right of access to such Personal Information can be exercised in accordance with applicable laws, rules, and regulations. Please submit any requests for such access by email at privacy@yomune.co.\n\n\n\nIf you reside in a country within the EEA, the following applies: The Personal Information that we collect from you may be transferred to and stored in a country outside EEA. The Personal Information collected may also be processed by our employees or contractors outside the EEA for payment processing, data analysis, e-mail delivery, hosting, order fulfillment, infrastructure and network storage, customer service, technical support, auditing, content licensing and promotional services. By submitting your Personal Information, you are deemed to have agreed on the transfer of your Personal Information to the outside of the EEA for such purposes. We will take all steps reasonably necessary to ensure that your Personal Information is treated securely in accordance with this Privacy Policy.\n\n\n\n8. Language\n\n\n\nThe controlling language of this Privacy Policy is English. If you have received a translation into any other language, it has been provided for your convenience only. The English version of this Privacy Policy shall govern to the extent of any inconsistency between the English version and any translated version.\n\n\n\n9. Do Not Track. We do not respond to DNT (Do Not Track) signals.\n\n\n\n10. Contact Us\n\n\n\nIf you have any questions, inquiries, requests, complaints, or comments regarding this Privacy Policy, or have other questions or suggestions about our information practices, please contact us by email at privacy@yomune.co.\n\n\n\n\n\nCopyright  2020 Thirdverse, Inc. All rights reserved.\n\nAbout SWORDS OF GARGANTUA\n- Price: $19.99, Playstation VR version $29.99\n- Available languages: Japanese / English / Chinese\n- Genre: VR online arena-combat action\n- Players: 1-4\n- Supported systems: Oculus QuestOculus Rift SOculus RiftHTC VIVEWindows Mixed RealityPlayStation VRLate summer\n\nRequirement Specs\n\nRecommended Specs\nOS: Windows 10\nCPU: Intel Core i5-4590\n\n    AMD Ryzen 5 1500X\n    or greater\n\nGraphics Card\n\nNVIDIA GTX 1060 / GTX 970\n\nAMD Radeon RX 480 /R9 290\nor greater\n\nMinimum Specs\nOS: Windows 10\nCPU: Intel Core i3-6100\n    AMD Ryzen 3 1200\n\n    or greater\n\nGraphics Card:\nNVIDIA GTX 1050Ti /GTX 960\n\nAMD Radeon RX 470 / R9 290\nor greater\n\nPrivacy Policy\nTerms of Servise\n\n2020 Thirdverse, Inc. All Rights Reserved.", "Developer Terms of Service": "/\nHome\nProduct\n/\nAdventure\n/\nFAQ\n\nEnd User License Agreement\n\nThis End User License Agreement (EULA) is an agreement between you and\n\nYomuneco Inc., seated in Japan (Yomuneco) This License governs your use of\n\nthis beta software product and all related documentation (manuals) either\n\nprinted or files, downloaded or accessed on-line, as well as updates and\n\nupgrades that replace or supplement the software and are not distributed with a\n\nseparate license (hereinafter collectively referred to as the (\"Software\").\n\nThe Software is licensed for free of charge and not sold. By installing or using\n\nthe Software, you confirm to have read the EULA and consent to be bound by\n\nthe terms and conditions defined herein. If you do not agree to the terms of this\n\nEULA, you are not permitted to install or use the Software.\n\nThe Software is protected by national copyright laws as well as by international\n\nintellectual property treaties.\n\n1.\n\nEligibility\n\nThe Software is made available to individuals aged 13 or older. If you are aged\n\n13 but under 12 years of age, you and your parent or guardian must review this\n\nAgreement and the Privacy Policy together.\n\n2.\n\nAccess and Costs\n\nYou acknowledge and agree that you will provide at your own cost and expense\n\nthe equipment, Internet or other connection charges, required to access and\n\nuse the Product.\n\n3.\n\nThe License\n\nSubject to this EULA Yomuneco grants you a non-exclusive and limited license to\n\ninstall and use one copy of the Software on a single computer or other gaming\n\nunit (depending on the type of the operating system which the Software is\n\ndesigned for), only for personal, non  commercial purposes. The Software\n\ncannot be shared, installed simultaneously on more than one computer or\n\ngaming unit or installed in the network.\n\nYomuneco only licenses the Software and you hereby acknowledge that no\n\nintellectual property rights, title or ownership of the Software is being\n\ntransferred or assigned to you. Yomuneco retains all rights ( including, but not\n\nlimited to copyright, other intellectual property rights, as trademarks) to the\n\nSoftware, any part of it, in particular the parts of the Software that may be\n\nregarded as independent work (e.g. themes, sounds, soundtracks, graphics,\n\nartworks, characters, descriptions, dialogues, etc.) and all related materials. Any\n\nrights not expressly granted to you by this EULA are retained by Yomuneco.\n\nThis EULA terminates immediately if you attempt to circumvent technical\n\nprotection measures used in connection with the Software. Your rights with\n\nrespect to the Beta Software Test Program will terminate upon based on the\n\nsystem data.\n\n4.\n\nUSE of DATA\n\nFor more information about how Yomuneco collects, stores and uses personal\n\nand other information, please see Yomuneco Privacy Policy available at\n\nURL: https://www.gargantuavr.com/privacy-policy\n\nYou are responsible for reviewing, and agree to review, Yomunecos Privacy\n\nPolicy and the privacy policies listed in the Yomuneco Privacy Policy. If you do\n\nnot wish to review those privacy policies or if you are concerned about the\n\ninformation Yomuneco may collect, please do not use the Software.\n\n5.\n\nEvaluation Feedback\n\nThe purpose of this limited license is the testing and evaluation of the Beta\n\nSoftware and Documentation and developed by Licensee of Licensee products\n\nthe interoperate with the Beta Software. In furtherance of this purpose. Licensee\n\nshall provide feedback to Yomuneco concerning the functionality and\n\nperformance of the Beta Software from time to time as reasonably requested by\n\nYomuneco, including, without limitation, identifying potential errors and\n\nimprovements (collectively the Feedback). Licensee will provide Feedback in a\n\nmanner that is mutually agreeable to the the parties. Yomuneco may use\n\nFeedback, without restriction in any manner now known or in the future\n\nconceived, to improve or enhance its software and , accordingly, and you\n\nhereby grant to Yomuneco a non-exclusive, perpetual, irrevocable, royalty-free,\n\ntransferable, worldwide right and license, with the right to sublicense (i) to use,\n\nreproduce, disclose, distribute, modify, prepare derivative works of and\n\notherwise exploit the Feedback and other information you provide to Yomuneco\n\nunder this Agreement, and (ii) to make, use, sell, offer to sell, import and export\n\nany product or service that incorporates the Feedback and other information\n\nyou provide to Yomuneco under this Agreement.\n\n6.\n\nConsumer Rights\n\nLocal legislations may grant you certain consumer rights that cannot be\n\nexcluded by the provisions of this EULA. In the event of discrepancy between\n\nthis EULA and statutory consumer rights, such rights shall prevail, subject to the\n\nfollowing limitation: You accept and acknowledge that you are responsible for\n\nthe safety of the data stored on your computer. You should regularly make\n\nbackup copies of your essential data and do not simultaneously launch many\n\nprograms because the potential interference between such programs may\n\neffect in data loss or loss of the effect of your work. Due to this fact Yomuneco\n\nshall not be liable for the data loss.\n\n7.\n\nFinal Provisions\n\nThis EULA shall be governed by the Japanese law.\n\nThis Agreement constitutes the entire understanding between the parties which\n\nsupersedes any prior agreements, written or oral, within the scope of the object\n\nof this agreement.\n\n8.\n\nContact Information\n\nIf you have any questions about this Agreement, please direct all\n\ncorrespondence to: info@yomune.co\n\nAbout SWORDS OF GARGANTUA\n- Price: $19.99, Playstation VR version $29.99\n- Available languages: Japanese / English / Chinese\n- Genre: VR online arena-combat action\n- Players: 1-4\n- Supported systems: Oculus QuestOculus Rift SOculus RiftHTC VIVEWindows Mixed RealityPlayStation VRLate summer\n\nRequirement Specs\n\nRecommended Specs\nOS: Windows 10\nCPU: Intel Core i5-4590\n\n    AMD Ryzen 5 1500X\n    or greater\n\nGraphics Card\n\nNVIDIA GTX 1060 / GTX 970\n\nAMD Radeon RX 480 /R9 290\nor greater\n\nMinimum Specs\nOS: Windows 10\nCPU: Intel Core i3-6100\n    AMD Ryzen 3 1200\n\n    or greater\n\nGraphics Card:\nNVIDIA GTX 1050Ti /GTX 960\n\nAMD Radeon RX 470 / R9 290\nor greater\n\nPrivacy Policy\nTerms of Servise\n\n2020 Thirdverse, Inc. All Rights Reserved.", "Space Required": "2.07 GB"}



["5 stars\n55%\n4 stars\n21%\n3 stars\n9%\n2 stars\n7%\n1 star\n9%", "Ex00penguin20 days ago\nLag and Crashed\n\nThis game is truly a work of art and the mechanics are great. The only problem with this game on oculus quest is that around floor 90-100 it starts to lag and crash. Ive experienced multiple occurrences of crashing and have even seen other users crash mid\ngame! All I ask is to please add some kind of bug fix, it would be greatly appreciated \n\nHelpful | 14\nDeveloper Response19 days ago\n\nThanks for the kind review. This issue is a high-priority fix for us and we're investigating in order to get a fix asap. Very sorry for the inconveniences caused.", "samheaton12 days ago\nIts worth the time and money\n\nIt is an amazing game and a great campaign. It is also co op which is my favorite. It is a game you would come back to after times but the one thing is that didnt give it a 5 star is because if your are in a oculus party your mic will bug a lot. Overall it is an amazing game and you should get it\n\nHelpful | 2", "Almghandi82Jun 20 at 10:24 PM\nGood Game with Bugs\n\nI Like this game. But sadly i cant play 30 min. without some bugs. In a Multiplayer match after +- 30 min. i have no audio. When i return to menu or lobby the sound returns.\nI too had some crashes and freezes that forced me to restart the headset.\nSo i give this game a 2 star atm. but if the devs fix the isuess, its a 4 star game for me.\n\nUpdate\nSometime i Love this Game and Sometime i Hate it^^\nThe Sound Bug that still happens is realy the bigest Downer of the Game.\nAnd the Fact that if you join a ongoing Multiplayer Adventure you get all the Debuffs but no Buffs is realy Bad.\nOn the Big Plus side are the Awesom Fighting. Its Realy a Pleasure to get Better in your own skills in using the Full range of aviabile Weapons. And also can give you a nice Workout,\nI hope That you guys can fix the Bugs. I rly want to give this Game more Stars.\n\nYou Made it. After the Updates that have eliminated the Mayor Bugs this is one of my favorite Games. Nice to see you work on your Game.\n\nHelpful | 18", "BeesInTheTrapApr 30 at 9:07 AM\nBasically Sword Art Online\n\nAmazing game, parrys and strikes feel very smooth, except for the occasional missed blocked that Im pretty sure I had? Anyways all combat is very good, blocking and countering is very well done even accompanied with crit areas and even a boss fight every now and again, which are very hard and make the quests always repeatable. Not only are the areas diverse, the weapons are to, basically unlocking new blades every time I play. The game gives of a hard SAO vibe, and is very well done, I heavily recommend to any sword enthusiasts\n\nHelpful | 178", "LadyDanielaJul 9 at 3:05 PM\nIt is a cool idea ,but it has some bugs\n\nI like the idea behind the game, but when we play Multiplayer modus After ~30 min i get bugs. From nowhere begins all to spin ,like the whole picture stucks and then comes the blackscreen, it doesnt answer when i want to turn Vr off. I must always wait. And when i want to come back again i can not enter the room , i must always try again.\n\nAll 3 of us get different bugs , for example my Husband cant move his vr, (Shortly put away ) because then he is out of a game.\n\n\nBut still all this complications we are playing this game and enjoing .\n\nI recommend this game because i believe that this all will be fixed and its Important to be patient.\n\nHelpful | 5\nDeveloper ResponseJul 9 at 5:28 PM\n\nThanks for the kind review! We do have some know crash issues as you have described above and we're working with Oculus to get them fixed asap!", "Benjamin.LammertzJul 15 at 12:07 PM\nGreat but dragged down by forced online.\n\nThe game itself is awesome once you get the hang of it.\n\nThe one thing dragging this game down is the fact that i have to be online to play. Even for single player mode.\n\nI don't see why this is necessary.\n\nHelpful | 7\nDeveloper ResponseJul 16 at 5:35 PM\n\nThanks for the review. Save data is cloud-based on servers and therefore it's a necessity. That said, it's not the first time someone has shared this comment and therefore we'll bring it up with the dev team.", "energybot5 days ago\nGreat game but a gargantuan problem\n\nThe game likes to crash and when you start the game back again you cant rejoin the game you were last in so you have to start farther back then you were\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThanks for the message. The crash issue is something we are aware of and working on a fix as a priority for us. We hope to have updates soon which help resolve this issue. We're very sorry for the inconvenience of it.", "Zyros_Kami13 days ago\nBest multiplayer co-op in vr by far\n\nif you are looking for a game that you can play with your friends and have a real fun time battling waves of enemies, look no further. theres a plethora of types of weapons, great physics, and exciting features that make the game super enjoyable. the devs are really open and do their best to keep pushing out content and updates regularly. great game!!! \n\nHelpful | 1", "blibyblobJun 7 at 2:12 AM\nHelp\n\nIt is a great game but I only played the quest gamemode where you could access all your weapons and they were always in the inventory even if they broke. And now I can't access that gamemode to play how I like. Idk if it's just me or if it's been removed but I would play for hours to upgrade a good weapon and I lost them all because I can't play the gamemode!\n\nHelpful | 7\nDeveloper ResponseJun 7 at 4:20 PM\n\nThanks for the review. We don't unlock game modes, only timed events. If you missed out on the event this time, don't worry! We bring events back from time to time so everyone gets the chance for rare swords!", "LoneWaffle1Jun 27 at 8:55 AM\nGreat but feels unfinished\n\nSOG is a good game but it feels unfinished, more like a tech demo. It has great combat mechanics that feel pretty smooth. The online feature is pretty fun too. The problem for me is the environment, you fight the same few enimes in the same three rooms.\n\nFor the devs, just add a few new enimes and rooms and you'll get a five star from me.\n\nHelpful | 2\nDeveloper ResponseJun 27 at 7:40 PM\n\nThanks for the great review. Right now we're doing a fair bit of polish to iron out some bugs in the game but also working on content updates for down the line!", "zoiks_ruhrohJul 17 at 12:30 PM\nGreat game!\n\nI haven't had a good experience in group play, most don't attack and just like to goof around. Solo play though i just love the feel of this game and the realism I feel while fighting. This game alone should be the platform for future games to improve on. As one of the first of its kind, I'm glad I gave it chance! If you don't learn the moves, you won't progress very far. Learn to dash, learn to dodge, learn to lock-in, all of it...you need these to beat the later levels.\n\nHelpful | 2", "hellboy42094Jul 27 at 3:37 AM\n\nI don't know if I'm playing wrong but I leveled up to lv5 quit the game went to bed woke up and I'm lv 1 fun game just wish I could lv up\n\nHelpful | 2", "hazyinseptember25 days ago\nBrilliant but ruined by constan crashing\n\nI love this game so much, so it pains me to give it such a low rating.\n\nThis has to be the MOST unstable game I own on quest. I cant get by 20-30 min of playing without it crashing me out of the game... which is appalling to be honest.  after my fourth crash today Im writing this review.\n\nPlease fix this\n\nHelpful | 2\nDeveloper Response25 days ago\n\nThanks for the review. Very sorry to read you're having the same crashing issue as report by many people here. It is a major priority for us to find the cause of this and resolve it asap. Many apologies for the inconvenience caused. - Thirdverse Team", "1-Brian-Pop-Pop13 days ago\nFun playing\n\nI enjoy playing this game but it tends to crash at the upper levels. Not sure if the Oculus quest is overheating or not.\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThanks for the review! The crash issue is something we are aware of and working on a fix as a priority for us. We hope to have updates soon which help resolve this issue. We're very sorry for the inconvenience of it.", "fisher.deason.715 days ago\nGreat game but almost impossible to beat\n\nThe game is great, its fluent it has okay response time, and good swordplay, but once you reach floors near the 90s it just Crashes you cant beat it unless you get super lucky and get to a match that is already at gargantua, pleas try to fix this\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThis crash bug is affecting many people and we are working hard on a fix asap. We hope to have something soon so that your experience is much better. Very sorry for the inconvenience!", "paulbastionJul 26 at 2:08 PM\nCrashing at loading to lvl 102\n\nThis is a amazing game, I would recommend to everyone it has awesome gameplay cool mechanics and over a really fun and enjoyable experience with new struggles each time you play and adapting to the way other people play so the players can best achieve to the boss level, Ive encountered one issue during my 1 year of playing this game crashing, while yes its inevitable it really sucks when you get all the way to level 101 beat it go to 102 and have it crash and be unable to go back into the group the player ie me was in and having to start over wish there was a system that allows you to rejoin recently left groups if you did it by mistake or have the game crash, in the end it probably wont happen cause the dev teams are probably working real hard on fixing the crashes and bugs\n\n\n\nOverAll this game is an awesome experience to meet new people and to test your skills while yeah it has a few hiccups with bugs and crashing the dev team has done a great job with this game and the game has a lot of potential, and is one of my favorite games to play on my free time get this game you wont regret it\n\nHelpful | 0\nDeveloper ResponseJul 26 at 8:26 PM\n\nThank you for the feedback, we are happy to know that you are having a fun time with the game! We are aware of the crashing issue and are currently investigating to fix it as soon as possible.", "DefendYourBaseApr 4 at 7:44 PM\nReally neat game. Worth the price.\n\nThe developers really crafted something cool here. Love the concept of advancing through levels as rounds like a arcade game. And being able to play COOP with random people or friends is just plain fun. The weapons are all unique and each one has its perks and down sides. CROSSPLAY is a HUUUGE plus. More games need this. Owning HTC VIVE and Oculus Quest i can play with friends.\n\nI really hope the developers dont stop making this game better. Oh my gosh could this thing be like the best game ever. Dont kill this baby, I hope it matures and grows old!\n\nThe game does have some issues like the already mentioned audio cutting in and out randomly, sometimes you lose ability to pick up items, some crashes which even actually shut down the oculus itself. And the graphics are blurry at any distance and really pixelated but closer up things look well. Hope the developers can nail these issues down. Otherwise this would be a 5/5 game.\n\nHelpful | 74\nDeveloper ResponseApr 5 at 6:46 PM\n\nMany thanks for the super-thoughtful review. We ARE continuing support and are making some great updates for the game. Regarding the audio we are hoping for Oculus and the third party sounds software company to get a fix out to Oculus Quests ASAP. Please bear with us until it's resolved! Regarding the graphics issue, we have some limitations due to the required specs of the Quest but we're always trying to provide a better experience of all our users. <3", "Danteinferno9182Jul 23 at 5:50 PM\nLove it\n\nOne of my favorite sword combat games I have played yet, I own this game for quite awhile and yeah on occasion there is a bug but not hard to close app and reopen. But by far most solid combat experience youll on quest so far so if your on the edge about buying it, do your self a favor and just go for it you wont regret it  keep up the good work \n\nHelpful | 0", "Duncun_McOkiner14 days ago\nGreat Game Horrible Lag\n\nIve been playing for 3 weeks now and I have not beaten the final boss for no reason other than I lag out every game. Between floors 50-80 every time when its the most important for leveling up. Also I am sick of getting 150k plus coins and the game giving me zero shops for 20+ floors until I either die or crash. It makes it extremely difficult to level up especially because I see so many shops on the early floors where you dont even have enough money to buy stuff. It would be a lot better if the shops were on designated floor numbers. The game has a lot of potential but a lot of bugs to figure out. Dont think Ill play for much longer my patience is getting thin.\n\nHelpful | 1\nDeveloper Response4 days ago\n\nThanks for the feedback, very sorry to read the inconvenience that have caused you to be unable to enjoy the game. The crashing issue is something we are working hard to find a fix asap. It' s a big priority for us as it has affected quite a few people. Regarding shop generation, we're taken the feedback and shared it with the devs for consideration.", "SuperShadow1Jul 20 at 1:05 PM\n\nCan somebody please fix this problem. I getting thrown out after getting some popping sound and freezing\n\nHelpful | 2\nDeveloper ResponseJul 20 at 4:35 PM\n\nThank you for the review, we know there is a crashing issue with many players right now and we're looking into a fix asap. Very sorry for the inconvenience caused.", "AlkrasnovJun 25 at 10:11 PM\nThis game is not getting enough love!\n\nThis is the game I put the most of my time in on the Quest, and I have a bunch of games! I absolutely love collecting new weapons and upgrading them, and becoming a Great Sword wielding machine of destruction! I specifically think the multi-player mode is the one that should be the centerpiece of the game. It completely wipes out the single player campaigns in its joy value, in my opinion.\n\nBe aware, the game is sometimes still a bit buggy (we had one time when we reached level 51, and no enemies spawned, so we were kinda stuck there), and it would be great if the microphone worked better (you can hear some people, but not often), but overall I like this game so much better than other alternatives due to its selection of weapons, RPG-style leveling up and it's physics (exploding weapons like in Ironlights is a big NO from me - I think the developers in Gargantua did a better job in making sure different weapons move differently).\n\nSome things I hope to see more of in the future:\n1. More multi-player centered games\n2. More variety in levels (there are only 3 types of arenas currently)\n3. More customization of the looks of the players and maybe even ability to Friend certain players to know when they are playing and join them\n\nIf you like sword fighting games, role playing games and physics based games, this is an absolute gem!\nHighly recommended!\n\nHelpful | 1\nDeveloper ResponseJun 26 at 6:12 PM\n\nThanks for the great review! The microphone sound is an issue but it's on the Oculus side and they are working on a fix. If we get a fix we'll be sure to be in touch!", "ManboySpartanJun 11 at 2:34 PM\nGREAT GAME!!....buuut\n\nIf you are wondering whether or not to buy it on quest because the in game photos look bad,have no fear the game looks great once you get into the game physically.....Now to address every thing els....its a classic tower of 100 floors situation by yourself or with up to 3 buddies. The sword play feels great with excellent use of haptics....not to mention Ive already put 12 hours into the game and Ive still not seen all the weapons....The variety of weapons is amazing as well. Short swords, long swords, wakizashis, katanas, tontos, morning stars, daggers,lightsaber-ish, flails, Hunga Munga(boomerang swords) and muuuuuuch more. Not to mention all the variants of every weapon.....you can have 2 shoulder holstered weapons along with 2 hip holstered weapons along with two arm mounted throwing knifes that regenerate....The dudes you fight will also get progressively harder as you move up the floors getting faster and faster until your fighting at a ridiculous speed parrying attacks blocking and countering yourself to victory....the amazing combat and great mechanics that reward you for treating the weapons like real swords also help the game pull you into its immersive atmosphere...this is a must have at only 20 bucks.....the replay value alone is mind blowing.....Oh did I forget to mention that there is more than the one game mode!!!! Yea great game for you and a bud to buy and play together! My advice is for a good time just load up with one buddy and play private its more fun with just two!\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\nNow this last part is for the devs the only reason this perfict game doesnt get 5 stars is because of a sierious problem I have with floor 96+.....every time I get to this floor with more than two others the game lags so badly I get dropped every time....I have one or two suggestions....I know the lagg is caused by how many entities my quest has to render.....so my first proposal is give players the option to cap the public games to anything from 2-4 players on the server....the second is an option to turn on simplified health orbs....maybe something without a active animation that way it has a less of an effect on the gameplay.....because it really starts to chug along at like 4 frames sometimes.....if you took the time to read my review thank you keep up the good work guys!\nP.s. I do want to make it a 5 star....and will make it one... I just want to make sure you are made aware of this issue.\n\nHelpful | 5\nDeveloper ResponseJun 11 at 4:15 PM\n\nAppreciate the upgrade to 5 stars and right now we're looking into the lag you've reported (as there have been one or two others who reported the same thing).", "friendlygiantMay 9 at 1:15 PM\nI love this game\n\nI love this game. The sword physics are amazing it really makes you feel like a bad**s I truly recommend this game. The only thing I would change is I would make an option to turn on blood. Because even just throwing in a bucket of blood would make my rating 5 stars. The game devs really made a great game I applaud you. So again this is a great game and I truly recommend it.\n\nHelpful | 8\nDeveloper ResponseMay 10 at 4:00 PM\n\nThanks for the great review! RE: blood, we hear you, however, it would limit our audience quite a bit on most of the platforms, so it's difficult for us to focus on that option right now T_T maybe an option in the future for consideration!", "Deacon5881Jun 28 at 8:00 PM\nSweet game\n\nThis game is well done the developers seem to take feedback into account it appears they are working very hard to handle issues with technical support and technical aspects of the game I like it it feels very real and balanced great work to the devs keep up the good work\n\nHelpful | 1", "SenkinkaMay 23 at 4:58 AM\nNo Offline Mode?\n\nIt's a pretty fantastic game for what it is. There's all sorts of things I'd want this game to be, but the Nier vibes really resonated with me.\n\nThe one downside so far is that it doesn't seem to have an option to play offline. My connection keeps cutting out and it boots me to the title screen and I can't even play. I was going in for a single player experience and the game actually doesn't provide this. I can't find any info within the games options or any other sources for an offline mode.\n\nNo internet, no game; that's unacceptable.\n\nHelpful | 16", "marcour12Jul 12 at 12:36 AM\nGREAT GAME!\n\nThis game is ... A MUST for the quest.\nif you love medieval fights and fantasy.\n-many melee weapons\n- big ennemys\n- great fight system\n\nbut there is one problem on the quest, the game got many bugs and by bugs i mean crash and audio bug. The game gonna crash many time specially on the loading screen when you go in another level.\nAnd that is the main problem for me.\n\nthe game is great but as long as there are crash, i can't recommend to buy it.\ndon't worry i'm sure the dev can fix this with a update........... or it's time to change my \"Quest\" ?!\n\nEDIT: the crash is fixed with some update from my quest and from the game.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 5:33 PM\n\nGlad to hear the crash issues have stopped for you.", "InnerScriptJul 20 at 5:12 PM\n\nI can't play this game, couldn't even complete the tutorial.\n\nFirstly, the the game has terrible anti aliasing, is non existent. This isn't just menus, but every element in the game\n\nSecondly, I wasn't presented with any option for moving in a comfortable manner. The locomotion is by thumb stick and has very little to accommodate those prone to simulator sickness\n\nBoth combined: Vom machine\n\nAnother note, don't let go of your sword. It falls to the ground and the hand doesn't move far enough to pick it up\n\nHelpful | 3\nDeveloper ResponseJul 20 at 5:49 PM\n\nVery sorry to hear that your experience of the game was not satisfactory. I'll share it with the team and hopefully you'll consider coming back to us in future updates.", "Declan52Jun 18 at 7:32 PM\nAmazing, however...\n\nThis is an amazing game, the sword fighting is good, but its hard to block. A few changes I would make is to it is 1, make it so when you move the lights dont flicker. 2, make the daggers on your arms easier to reach. 3, have a setting where you can customize your arm length. 4, faster backwards walking speed. 5, fix the selling, if you sell an item, you dont get money. 6, sometimes when you are playing, the game freezes, replaces all sounds with a annoying buzz, and then crashes. And finally I cant open the game anymore, every time I try nothing loads, and it leaves me with a black screen. All bugs aside, I love this game, and want to play more. If/when you fix the bugs I will be playing again faster than you can say swords of gargantua!\n\nHelpful | 1\nDeveloper ResponseJun 21 at 4:32 PM\n\nThanks for the review! Regarding the crash issue, that is something we are aware of an are investigating right now. Glad to hear you're enjoying the game!", "TheGreatGoobisJun 18 at 11:18 PM\nI am Guts\n\nThis game is probably my favorite VR title as of right now, mainly because I love the sword play and the community. Graphics are a big meh, but the gameplay more than covers for it! I have only got to floor 50, but I really hope they add more enemy types, they get repetitive. I would also like some form of PvP!\n\nHelpful | 0", "SlppJun 30 at 3:01 PM\nFun\n\nThis was a great experience for me parrying was so fun and dashing to and murdering some one with a potion was super funny and reminded me of anime with the concept and play style i recommend this game to anyone who likes sword fighting and people who like dark souls\n\nHelpful | 2", "RollerGalaxyJun 7 at 7:41 PM\nReally good game\n\nThis game is so much fun, and has a lot of replay value. When I got a suzaku (it might be suzoku) I felt extremely powerful at the start of any adventure, but as I slowly worked my was up to the higher floors my previous skills wouldnt cut it. So I had to farm enough suzakus to eventually get my original suzaku to plus 2. Love the mechanics. The height thing is a bit glitchy, because if you sit down while you load into a level and then, after loading in, you stand up, your head is almost dislocated from your body, but still a small, simple glitch that can be fixed by not sitting down. All in all, a fun rouge-like that I personally think everyone with a headset should try.\n\nHelpful | 4\nDeveloper ResponseJun 7 at 10:46 PM\n\nThank you for the deep review! Appreciate the experience share too, we'll have more incoming later this year. Looking forward to you trying it out!", "RappWill121122 days ago\nGood game, a lot of bugs\n\nThere are lots of bugs but overall its a great concept.\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThanks for the great review. We're working hard on cleaning those bugs up so that we can get that fifth star from you!!!!", "ChocoAdictJun 8 at 11:33 PM\nDo Not Waste Your Money\n\nI do not know how or why people are enjoying this game when it is quite literally unplayable. Let me explain:\n\nI bought this game in a bundle with wands. When I loaded up this game there was a fantastic cutscene that explained the setting of the game and I loved it. I was really excited to start playing. I was first sent into the tutorial, which is basically how every adventure you play is going to be like. So right from the get go, one can see the issues this game has:\n\n* Body too large and makes weapon sheathing or grabbing almost impossible. There is no way to adjust this.\n* The floor does not really match with guardian floor.\n* Sword gameplay is weird. It doesnt really connect with enemy swords and therefore blocking isnt really a thing.\n* The weapons themeselves can sometimes be weird to use, like the shuriken, although this one may be just me.\n* The visor thingy that overlays the eyes when moving is clunky and very uncomfortable, and as far as I saw, there were no setting regarding it.\n* Activating the special power is difficult due to the tracking for some reason.\n\nI hate to give bad reviews, especially when a game holds promise and when it seems the developer(s) worked hard. But this game, as it is, is horrible. I cant play it. I really just cannot play it.\n\nHelpful | 13", "Delirick101Jul 19 at 3:45 PM\nSatisfying and fun!\n\nGame is as advertised, simply vr sword fighting. Block system is effective and rewarding, with a wide variety of weapons and some sheild options. I found the co op mode the most enjoyable aspect of the game. Well worth the price.\n\nHelpful | 1", "Yaming615Jul 19 at 6:58 PM\nGreat game, closest game to SAO on Quest\n\nThe game is pretty fun, sadly the lounge is dead and the item system is wierd as I listed all my swords after the update.\n\nHelpful | 0\nDeveloper ResponseJul 20 at 12:16 AM\n\nThanks for the review! The lounge does depend on the timing of the day, etc, but keep looking around and you're bound to run into new friends. Regarding there second point we're not too sure what you mean but if you can clarify on our discord if you need further support. https://discord.gg/XT2fKYk", "TwoHamburgersJul 15 at 7:41 PM\nGreat combat but buggy\n\nPros: really fun sword and shield combat mechanics\n\nCons: game always crashes after about 30 mins of play, which is really frustrating and makes it very difficult to make progress in Adventure mode. Resolution on Quest is really low, everything is pixelated.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 5:39 PM\n\nThanks for the review. The crash issue is something we are working hard on a fix for. We're really sorry about the inconvenience it has caused.", "one_eye_corpJul 19 at 5:40 AM\nDont sleep on it\n\nThis is probably one of my most played besides beat saber when it works it works so going at it solo is fun and dominating with friends is even better the dodge mechanic is odd at first but soon it feels natural\n\nHelpful | 0", "Glitzy6910 days ago\nPretty good\n\nNice combat physics and sword types good job game check it out it's worth it\n\nHelpful | 0", "KattMann67Jun 5 at 5:23 PM\nSome Suggestions, but Great Game\n\nThe gameplay is honestly super tight. Theres a few things when it comes to combat that could be improved. for instance having the body armor visible in 1st person makes the POV very crowded. Also, the fact that your own sheild can get in the way of the weapon is slightly annoying, especially when you already feel crowded due to the body armor, but i feel like that might be a bit nit picky and something that will resolve itself once im better at the game. same statement goes for weapons getting stuck on enemies if youre too close. some more movement options would also be nice. smooth turning and removing the dark moving outline as options would be really nice to have, especially for those who no longer get motion sick in VR. Other than that really tight game. I feel like oculus should seriously consider small but heavier sword/sheild style controllers to help add some weight to the combat.\n\nHelpful | 1\nDeveloper ResponseJun 7 at 4:19 PM\n\nAppreciate the great score and constructive feedback! And yes, some weapons based controller would be awesome.", "XardielJul 26 at 11:53 AM\n\nTotally agree with one of the previous opinions. Lack of anti-aliasing, everything looks grainy and no teleportation makes a hard pass for me, game has it's potential but I'm not going to torment myself with it, unfortunately asking for refund.\n\nHelpful | 0\nDeveloper ResponseJul 26 at 8:23 PM\n\nSorry to hear you didn't have a good experience with the game. Our team is constantly working hard to deliver the best experience possible, so we appreciate and will take your feedback in consideration.", "TheRealScooter3 days ago\nYes\n\nYes\n\nHelpful | 0", "mc.miles26Jul 26 at 3:17 PM\nits to buggy\n\nive had it for a week now and its bugged out so many time. sometimes it will just freeze and id have to restart my quest. very annoying\n\nHelpful | 0\nDeveloper ResponseJul 26 at 8:34 PM\n\nHi, thank you for the review! Sorry to hear that you are having troubles with the game. We are currently investigating this issue and trying to fix it asap.", "avacanisJul 6 at 6:07 AM\nGood game, annoying bug\n\nI was really looking forward to play this game, especially adventure mode...everything looked fine but somehow I cannot play with my left hand :/ one of the things I was hoping for was 2 hand fighting and when I try to play this way I am \"teleporting\" from side to side. It makes it unable to play...\nI keep playing with my right hand and it works fine this way, but takes away all the fun I expected!\n\nEDIT: Thanks for the answer! Yes, it is possible to switch the main hand (btw nice thing for the lefties). I mean I cannot use BOTH hands. My main is right and when I have sth ONLY in my right hand then everything works fine. When I have sth in my left hand (or both hands) then I'm moving like crazy on all the arena. I cannot hit anything because suddenly I am in a totally different place than a second ago...\nOtherwise I think that you made a great game with diverse opponents and weapons, just inability to play with both hands makes it annoying for me especially. I'm the only one having this issue? For a moment I thought this is what you planned - to fight with one hand only.\n\nHelpful | 0\nDeveloper ResponseJul 5 at 5:55 PM\n\nHi there. Thanks for the review, however, I'm a little confused by what you're reporting. If you mean the main hand for attacks, it's possible through the options to switch from right to left. Regarding general controls such as movement, that's not an option, but we'll for sure take it into consideration. - Thirdverse Team", "Mr.Clean.WooshJul 6 at 6:51 AM\nSecond review.\n\nSorry but I just had to give 2 stars. I love the concept,combat,swords everything is good. But the crashing its so frustrating! I have to be scared that I will crash everytime. I cant get above floor 50! I hate that bug. And everytime it crashes I have to restart my oculus quest. And the if system doesnt work. I memorize the id. Sometimes even write it down. And it just says room doesnt exists or something like that. You dont even know how triggered I was when I crashed on floor 92. Ive never been so angry in my life! I dont think this is how a 20 dollar game should play like. As I said I love it but if you could fix the crashing bug I would be forever thankful. Sadly I have to give it 2 stars at the current rate. But its 5 stars if it wouldnt crash. As far as I know the crashing glitch has been here for a while. Im taking a wild guess here but I think you will fix it that soon. Thanks for reading\n\nHelpful | 0\nDeveloper ResponseJul 9 at 5:38 PM\n\nWe understand your frustration on this and we're working hard with Oculus to get this resolved. We appreciate the honest review, and hope you'll stick around!", "RipHimHeDeadJun 17 at 4:17 AM\nLove the game, I only have one complain.\n\nI really do enjoy this game, its honestly a great experience. The combat feels good, the difficulty feels balanced, and progressing through each floor with friends is tons of fun. The only complaint I have, is that the game keeps crashing around the higher floors (60 and up). This happens no matter what mode I choose (Solo and Multiplayer). It didnt happen before and Im really not sure whats causing this, I even tried deleting the game and reinstalling, it still crashes.\n\nPlease look into this, it really sucks that I cant even get to the final floor anymore.\n\nHelpful | 0\nDeveloper ResponseJun 17 at 4:09 PM\n\nThanks for the great review! Regarding the crashes. It's something we are aware of and we're working on a fix asap. Apologies for the effect on your experience.", "Z31f4h4mJul 3 at 9:10 PM\nNot worth it\n\nThrough my experience of playing this game it was very fun but then the controls started to get buggy as an I would slash the sword onto someone and it would literally tap them and I would also hold out my whole hand to block an attack yet it still wouldnt register the block the game just feels very buggy ugly and a waste of time and money\n\nHelpful | 0\nDeveloper ResponseJul 5 at 5:34 PM\n\nVery sorry to read you didn't enjoy the game. We're in the middle of cleaning up a lot of issues related to the game and hope down the line you'll try us out again. - Thirdverse Team", "LemonNitrateJun 19 at 9:31 PM\nSO CLOSE to being good\n\nLast time I reviewed this game I talked about how voice chat wasnt a thing, well now it is! And thats fantastic! Now while Im climbing the floors I can talk to people and having different people to talk to for different games is a nice experience that adds some replay value the game. It feels nice to be able to climb the floors with some chill people and fight gargantua with them! That would be if you could ever GET to gargantua without the game crashing. Every single time Ive gotten to the higher floors (90s or 100), the game has crashed on me. Every. Single. Time. And I crash on floor 100 if I get LUCKY enough not to crash on some other floor. I understand its not intentional, but I personally feel like this should be at the TOP of the game devs to-do list, other people I play with have told me that they have crashed several times as well, and its usually up on the higher floors (70-100). Its infuriating and it makes me not want to play the game when I know Im just gonna crash again. This game is SO CLOSE to being in my top favorite games for quest, because when I do get to play it I usually have a good time. Like I said in my last review, the game is a blast, the sword mechanics are fun and the enemies are pretty engaging to fight. However, I do have a short list of things that would make the game better aside from fixing the rampant crashing...\n1) CUSTOMIZABLE ARM LENGTH (or just customizable characters in general) it looks really weird and takes away from immersion when my weapon sticks out 6 inches away from my arm when its fully extended\n\n2) Better explaining the game mechanics. I didnt know that you combined weapons to upgrade them until someone told me, would loved to have heard that in a tutorial or something before I sold off all my duplicate weapons.\n\n3) Blocking and parrying need to be more consistent and reliable. Its annoying to have your weapon blocking the attack but still take the full amount of damage, I understand not being able to block big attacks like the tanks axe but being hit by a Small One when my shield was clearly blocking her blade is a bit of a smack in the face.\n\nAll these things aside, these problems could all fixed with a few small updates, then I could feel confident giving this game a 5 stars. Buy this game, then wait, itll definitely get better in the future I know it.\n\nHelpful | 0\nDeveloper ResponseJun 21 at 4:38 PM\n\nThanks for the updated review! The crashing issue is a problem, but we're looking into it right now, and is on the top of our to-do list. Appreciate the other feedback too and will take it into consideration.", "soupisgood20Jun 12 at 5:26 PM\nMust have game\n\nIve always hesitated to buy this for some reason, I would decide I wanted some other game more, but this game is 100% worth it. This is now one of my favorite games on quest, the weapons are really cool, you can play modded, multiplayer, or not, its up to you. But I have one request when it comes to the game, theres no mic system, which is okay, but I sometimes cant quite get across that I need to disconnect from the game with my arms, but dont add a bad system, a work in progress system with random players who might scream without end is worse than no mic system. A fully made system with muting options and things like that would be very good and add something new to a great game.\n\nHelpful | 1", "Texanboy06May 17 at 2:00 PM\nReview\n\nHeres my review  this is my choice\n\nGraphics\n\nBest graphics ever\n\nGood enough\n\n Meh\n\nAbsolute trash\n\n\nPrice\n\nToo much\n\nA bit pricy\n\n Fair enough for a fair game\n\nFree\n\n\nStory\n\nToo fast\n\n Depending on how you play\n\nNo story\n\nWay too long\n\nSuggestions\n\nAdd bows so that way we can take out enemys from a distance.\n\nAlso add a difficulty option because I believe certain people have trouble with certain parts of the game.\n\nAlso add bashing where when you charge someone with your shield they will get knocked out for 5 seconds.\n\nAnd last add a character customization option because everyone looks the exact same except for different colors.\n\n\nAnd that is my review maybe if you do all of these things your game will become more popular than ever.\n\nHelpful | 5\nDeveloper ResponseMay 17 at 4:03 PM\n\nThanks for the constructive feedback and the great score! - Yomuneco Team", "WildpandadJul 29 at 3:12 PM\nVery fun\n\nLove this game but the blocking needs some adjustments\n\nHelpful | 0", "Digital_PhoenixxJul 13 at 8:02 AM\nCrashes way too easily\n\nSeveral times I have gotten good allies, items, blessings, etc; very good runs ruined by the game crashing and resetting. This even happened during the boss fight once, which we were good on the path of winning that battle.\n\nHelpful | 1\nDeveloper ResponseJul 16 at 5:34 PM\n\nThanks for the review. This is something we are aware of and are working to get a fix asap. Very sorry for any inconvenience it's caused you.", "aaron.sommers.1253May 20 at 8:38 PM\nSwords\n\nI Love this game, I own almost everything on the Glorious Quest, and Swords is the game I play the most. The sword play is really good, the enemy ai is also really good. If I could add anything, I would like something other then just arena, like a full rogue mode. Any way Great game, give it a go.\n\nHelpful | 3", "WurmpleJun 26 at 7:43 PM\nVery great\n\nI think this is very great, I love the swords, enemies, and the blocking is great. Its almost the same thing as sword art online. I love it and I think thats its my favorite game on the Oculus Quest.\n\nHelpful | 0", "tom.florentin.frMay 22 at 6:33 AM\nGraphics ?!\n\nUgliest game on the quest.\nThere are only 2 maps, and one game mode, with infinite enemies that spawns around you.\n\nPhysics are very great.\nDo not downscale sampling like that !\n\n\n\n\n\nEDIT :\n\nThanks for you reply. I add 2 more stars, to encourage you to keep working on the game :)\n\nHelpful | 1\nDeveloper ResponseMay 21 at 4:37 PM\n\nVery sorry to hear that we couldn't meet your standard. For what it's worth, we have more content incoming later this year that adds more replayability for the game: https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "w_e_e_bJul 22 at 1:26 PM\nIts fun\n\n10/10 would bash a golden soldier to death with an anime shield again\n\nHelpful | 1\nDeveloper ResponseJul 26 at 8:20 PM\n\nGlad you are enjoying the anime shield! We have some new shield patterns coming soon, so stay tuned :)", "BlackysBroMay 23 at 5:35 PM\nActually pretty good.\n\nSeen a lot of bad reviews but this game is actually pretty fun. The sword fighting is amazing and the rougelike elements help make it less repetitive instead of just fighting constantly. Overall is pretty fun but some people may not like some of the repetition.\n\nHelpful | 1", "AwesomeIan24May 1 at 10:42 PM\nGood but...\n\nSo I got this game in a bundle and I like the game but I have 2 problems\n\n\nFirst problem is the movement blur I dont really get Motion sickness so I dont need the blur affect when walking so I wish there was a way to remove it\n\nSecond problem is sometimes my body is faced the wrong way so I cant grab my sword\n\nHelpful | 7\nDeveloper ResponseMay 4 at 4:04 PM\n\nThank you for the review. You can switch off motion when walking by heading into the Options -> Misc menu menu while in the main area (after game launch). You can switch off the tunnel effect and hopefully, this should help you with the motion sickness. We also have a re-alignment option you can utilize by clicking thr rightstick on your quest if your character model is all twisted. Hope this helps!", "T0pdogZJun 30 at 7:33 PM\nLag\n\nGreat but I lost tracking a lot and got kicked from the game\n\nHelpful | 0\nDeveloper ResponseJun 30 at 7:35 PM\n\nHi there, thanks for the good score. There is a known issue regarding game crashes which we're currently looking into and want to get a fix out as soon as possible. Very sorry for the inconvenience!", "NSP_FlyJun 26 at 7:38 PM\n\nThis game is great but sometimes the game lags.overall I love the game and game concept. It is just like sword art online. That is why I got the game and I have loved it.\n\nHelpful | 0", "mark.testaseccaJun 3 at 10:16 PM\nNeeds work\n\nOne of the most virtually impressive games on the quest but the controls needs work the sword glitches a lot and its not all Syncedto your movements really disappointing because its a fun game but it needs work on the controls!\n\nHelpful | 2\nDeveloper ResponseJun 4 at 12:04 AM\n\nThanks for the feedback and the review. Regarding the sword glitching, it shouldn't be doing so much and should be relatively synched so if you think it a bug please do feel free to reach out to us at cs@yomune.co - Yomuneco Team", "BersteakMay 12 at 5:34 AM\nBeta ?\n\nI really want to like this game but... There is too many flaws...\nFirst it's really ugly but it's ok, it's a quest game.\nThe game is not stable... It's my first quest game which crashes everytime i play.\nBut my main complain is that this game is really boring and buggy.\nIt is so slow, you can't run or dash. There is a strange mechanism where you turn your head to dash but it is so painful to use. Why not something easier to use ?\nThe parying is really annoying, why the ennemy always hits my legs ??? And it works 1 time on 2. A lot of time, i see the mobs leaving his sword to put a hit from the top, i put my sword... But i take the hit...\nThe evolution on the adventure mode is so slow too... When i see the price of the diverse amelioration... It's not giving me the desire to play again...\nI don't know how this game can have a good rating but i also see a lot of people complaining about it. (10% 1 star... it's a lot...)\nIf you are interested by this game be careful and read all the bad review.\n\nSorry for my bad english.\n\nHelpful | 6\nDeveloper ResponseMay 12 at 4:05 PM\n\nVery sorry to hear your experience with Gargantua hasn't been satisfactory. We're always appreciative of players' feedback and we'll take what you've shared into consideration moving forward.", "lawsondakota1Mar 2 at 5:58 AM\nGreat game play\n\nThe game is great. Love the floor clearing style. Kinda like SAO. Only complaint is special weapons. Like i got the anime sheild from a even and it said could use in quest and multiplayer. Only place i can use it is main menu and single events\nKinda bummer want to show off what u earned in multiplayer\n\nHelpful | 22\nDeveloper ResponseMar 3 at 4:47 PM\n\nThanks for the kind review. We'll do better at making it clear how to obtain weapons in the future! For Single player they are unlocked through the Event mode. For Adventure mode they are unlocked through purchasing in Adventure mode's in-game shop (in-game coin is earned through playing adventure mode, no IRL purchasing happens FYI)", "dylanmcgrawMar 31 at 9:27 PM\nVery good game\n\nVery good game I like it the only problem I have with it Is the fact that you can't stab with the actual end of the sword obviously I don't know how to make a game so i don't know if this is possible but if it is, it would be a very good addition to the already great game\n\nHelpful | 7\nDeveloper ResponseApr 5 at 6:40 PM\n\nThanks for the great feedback! We want to make the game experience as fun and as real as possible and a stabbing function for all swords would be really cool. Feedback will be given to the team!", "Qed00May 4 at 6:04 AM\nThis is an Alpha at best\n\nI am surprised that this game passed the Oculus store high quality content bar.\n\nThe game has some cool ideas on how to implement sword combat. However, it is unpolished and clunky.\n\nThe content is very limited and more in line with what you would find in a tech demo; you are in grey room with 5-10 different type of enemies.\n\nGraphics a bad to the point that it completely breach any kind of immersion.\n\nHelpful | 9\nDeveloper ResponseMay 4 at 4:10 PM\n\nSorry sorry to hear you didn't have a great experience with the game. We' always working on new content, and will have some significant updates this year. Hopefully, you'll come back and give it a try later on down the line! https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "dafradyJun 7 at 12:47 PM\nEerr\n\nThis is great, anyone who likes Sao might like this game\n\nHelpful | 4\nDeveloper ResponseJun 7 at 4:21 PM\n\nThank you!", "KujikenMay 2 at 10:41 PM\nFun, arcade style combat!\n\nThis game is a lot of fun cooperatively played with friends, although the voice chat does not seem to function reliably. The sword fighting is great, with a good selection of weaponry to suit your taste. It would really have been nice to customize your Avatar with unique looks or at least colors, and hopefully they can add that with an update.\n\nHelpful | 1\nDeveloper ResponseMay 4 at 4:07 PM\n\nThanks for the great review! Regarding the sound issues, right now Quest HMDs are having compatibility issues with sound software that SoG utilizes. Unfortunately, it's out of our hands but we do know that Oculus are aware of it and working on a fix!", "flimsyJun 5 at 5:59 AM\nDoesn't launch without internet\n\nThe game doesn't get past the initial loading screen if you aren't connected to the internet. It's a shame, because the singleplayer mode seemed fun. But we need to stop supporting games that won't let you play them after their service goes offline.\n\nHelpful | 2\nDeveloper ResponseJun 7 at 4:17 PM\n\nThanks for the review. We do require users to be connected to the internet. We'll take your feedback into consideration as it's not the first time we've read something like this", "BlazeCraze12822 days ago\nGood game to play with friends\n\nThe idea of this game is similar to sword art online and I think thats what theyre going for but there are some aspects in game play that can be improved.\n\nThis game is hard and not very enjoyable or fun if your playing alone but for me, its a blast to play together with other people.\n\nThere are some bugs but if they fix it and update it more it would be a better/amazing game\n\nIm giving this a 4 star because I think that they can make this game better than it already is be and hasnt reached its full potential so I give it a 4 star \n\nHelpful | 0", "RhaimonJun 10 at 8:27 PM\nFun game\n\nReally fun game, great game to go life for life with the family if you only have one headset too. The Developer's genuinely seem to care about their creation and improvements.\n\nHelpful | 1", "willkayakMay 8 at 9:43 PM\nNot perfect but very close!\n\nThis game is one of the best sword based VR combat games I have ever tried. It causes my quest to crash sometimes but that is my only complaint. The combat is fast paced and challenging at each level, gives off SAO vibes.\n\nHelpful | 1\nDeveloper ResponseMay 10 at 3:59 PM\n\nThanks for the review. Very sorry regarding the crash issues, if you need support you can reach out at cs@yomune.co and we will see what we can do!", "BriWifiMay 19 at 1:31 AM\nNeeds a lot of work\n\nI really want to love this game, I really do. I'm a huuuuuge roguelite/like fan. Unfortunately the upgrades cost an INSANE amount of gold which would take days and days and days to get anywhere, making it feel like you're going nowhere even after completing several \"levels\". After completing 10 or so levels I come out with about 1500 gold... the lowest possible tier upgrades cost 10,000 gold, and it all grows in cost exponentially from there. The blocking is *incredibly* fickle and feels unfair, especially coming from games like Sairento and Ninja Legends where every hit and missed block feels fair and I can humbly accept responsibility. Map and enemy variety are pretty much nonexistent. I have taken a look at the road map and I'm hoping that once ranged weapons (ESPECIALLY MAGIC!!) and the procedurally generated labyrinth come in that I'll actually enjoy the game more.\n\nHelpful | 0\nDeveloper ResponseMay 19 at 4:01 PM\n\nThanks for leaving the review, appreciate you taking the time to share your thoughts. We're excited about the updates incoming, which will give you more variety in gameplay!", "KeyBladeLegendsMay 21 at 9:09 PM\nFun, but somthing is off...\n\nI have to say first and foremost that I have had this game since I have owned the quest. Most problems I had since starting the game have been fixed but the big one hasn't. The combat sometimes just doesn't flow. When I try to parry/block it almost always fails. I dont know if it's just on my end but I know im doing a perfectly reasonable party and it goes wrong. I like this game a lot but I hope the developers keep consistently updating this game because I feel if they do it could be one of the best on the quest!\n\nHelpful | 1", "VerselDarastrixMar 8 at 9:59 PM\nThis game is amazing\n\n20$? For this level of quality?! This is amazing! I never thought it could be this good.\n1. The graphics are great\n2. Multiplayer is really fun expect servers lag sometimes (happened twice)\n3. Enemies are cool and the fighting isn't just swing the sword around.\n4. Despite what others say the weapons are creative.\n5. Blocks and parry's make the game so much more \"I need to defend myself\" instead of being a crazy barbarian\n\n10/10 would buy for 30$\n\nHelpful | 19\nDeveloper ResponseMar 9 at 5:45 PM\n\nMany thanks for the glowing review! <3", "ExwerksJun 9 at 4:17 PM\nGreat game\n\nHonestly, I was playing this because rec room completely screwed up their wall running mechanic. I forgot how fun this game is especially with voice chat.\n\nHelpful | 1\nDeveloper ResponseJun 9 at 6:20 PM\n\nThank you!", "Neon_DynamiteApr 19 at 11:35 PM\nAmazing. Definetly worth at least $20.\n\nI love this game. The grind is really fun to getting strong enough to defeat the final floor. My only problem is the lag, my wifi isn't the best but usually games don't lag on VR for me. I'm not a developer and I don't know how hard it is to make collaborations but I think this game would be 3x better if you had some weapons from IronLights, you should have an Ironlights weapon event and maybe work on the graphics in the future, again like IronLights graphics the armor and terrain looks so crisp and clean. Maybe just spend more devolopment on graphics and lag. I personally have enough gameplay to go without a gameplay update while you fix that stuff.\n\nSome examples of minor glitches that I haven't seen on other reviews are\n\n (not really a glitch but a mess up) When you hit quit on adventure mode remain is spelled \"remin\".\n (don't know of this is a feature but if it is Remove It) The shield with the gold outline and grey art doesn't let you enchant your weapon while holding it.\n\nHelpful | 1\nDeveloper ResponseApr 21 at 4:09 PM\n\nThanks for the kind review and the report at the end. We'll check it out!", "youheiXDMay 14 at 2:32 PM\nawsome game\n\ni like the game and so far the only issue i have is when i get a request from in game help it crashes my quest but other then that its an awsome game and hope to see what comes to it in the future\n\nHelpful | 2", "Nightflame4565 days ago\nGood, But a Bit Confusing...\n\nI love sword-fighting games, even more so when they are immersive, but this game isnt quite what I had in mind.\n\nThis is a good game, I wont lie. But the floor system and the enemies are a bit repetitive, though they are progressive for the story.\n\nPretty good game, but nevertheless, still contains its flaws...\n\nHelpful | 0\nDeveloper Response4 days ago\n\nThanks for the honest review. We'll share it with the team for consideration.", "cosic100Jun 10 at 6:16 PM\nAwsome game\n\nThe best fighting game that is available on quest you can play with friends and solo.it is cool and challenging and I recommend it\n\nHelpful | 1", "eddiegarouJun 9 at 6:31 PM\nFreezes on higher levels\n\nEver since the last update, the game freezes as you go up to higher floors. Eventually, it totally crashes, usually around floor 90 or so. Cant recommend this game as is, which is a shame because I like it otherwise.\n\nHelpful | 1\nDeveloper ResponseJun 11 at 4:10 PM\n\nThanks for letting us know. We're looking into it right now. Very sorry to read that this is preventing you from enjoying the game.", "SwahnMar 29 at 7:01 AM\nAmazing game!\n\nReally fun and addicting! I dont fully agree with the parrying being useless as some people says, if you get to close, it does not work and that feels legit to me. for some attacks tho, like when they stab from far away, you should be able to block if you ask me but right now its kinda 40/60. 5 stars if thats fixed!\n\nHelpful | 2\nDeveloper ResponseMar 29 at 6:22 PM\n\nThanks for the great review Swahn, and appreciate the honest feedback regarding parrying. It's something we need to improve upon and hopefully with our regular updates you should feel a difference as we move forward!", "gerblooshMay 2 at 3:51 PM\nWow what the hell is this\n\nThis game is just a mess of what the developers wanted but had little effort put in.it has 2 rooms for the exploring part and then the weapons feel floaty and clumsy.if your looking for a quality game for 20 bucks just get something else.\n\nHelpful | 5\nDeveloper ResponseMay 3 at 4:18 PM\n\nVery sorry to hear your experiences with the game are not so good. We are always adding more content so we hope maybe down the line you'll try it out again. - Yomuneco Team.", "Jahryder1984May 6 at 5:15 AM\nGood Game, Could be better\n\nI was hoping that the adventure mode would allow for a story and an actual adventure instead of semi-connected arena battles. I like the defend the \"Column\"Mode, its a lot of fun, however its been gliching so some of the hits have not been registering. I love the concept, though. Nonetheless, fighting in a arena can get boring arfter a while. If you give the character a door to walk through maybe it will feel less like a repetitive game and more like I'm walking into an adventure. Maybe, you can add villains to the lobby area sceneries. What I'm saying is you can mix it up a little to make the game more interesting. Thanks for a pretty good game\n\nHelpful | 1\nDeveloper ResponseMay 7 at 6:59 PM\n\nThanks for the message, and the review. We're always collecting feedback and have a bunch of plans for the next step with the game which we've shared online here: https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/ thanks again for the review and we hope you'll stick around.", "RaccoonLairJun 7 at 12:25 PM\nIts pretty good\n\nYa I mean I like it its fun\n\nHelpful | 2\nDeveloper ResponseJun 7 at 4:20 PM\n\nThanks!", "jeb.gamingApr 16 at 2:30 AM\nRealistic physics (kinda)\n\nYou can wave your sword around like a maniac in this game, yeah, but it punishes you for it. If you just flail around a heavy weapon at unrealistic speeds it goes all floppy and does minimal damage, the game literally penalizes you for not using the weapons in a realistic manner and I love it.\n\nHelpful | 2\nDeveloper ResponseApr 16 at 4:17 PM\n\nThanks for the great review and we appreciate your feedback on the combat! <3", "DoomSlayrMan04Jun 12 at 8:00 PM\nAmazing Game\n\nthis game was so fun and a really cool idea with the weapon degradation system\n\nHelpful | 0", "BenUSA1May 20 at 4:40 PM\nPlease Update ASAP per your 2020 Plan\n\nUPDATE to 2 stars for Developer Reply.\n\nNeed Update Badly !\nAs of now, it is Boring.\nNeed followings ASAP.\n\n1)More Multiplayer maps.\n(Need this First !!!)\n2) Please get rid of GREEN GLOW weak spot indicator, it shows up randomly and doesn't make sense. Looks childish. By logic weak spots are head, neck, armored joints, etc no Green indicator needed. Some RED Blood shows weak point.\n3)Level of Difficulties, opponent is too easy, one wack and they die.\n4)Different Environment, Characters, at each levels and Story in Adventure Mode.\n5)PVP.\n\nGUESS WHAT, I WON'T RETURN THE GAME TO SUPPORT THE DEVELOPERS FOR THE UPDATE.\n\nBUT, If there is no update soon, I will NEVER, EVER buy a game from YOMUNEGO !!!\n\nHelpful | 1\nDeveloper ResponseMay 10 at 4:02 PM\n\nThanks for the message, we hear you on the need for additional content and we shared a roadmap last month with all the updates coming this year. We help you'll reconsider coming back to us once these updates come. - Youneco Team https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "godyuJun 3 at 5:26 PM\nGraphics are jagged\n\nRich in content and great for wielding swords, but the graphics are jagged, I hope to optimize in the future\n\nHelpful | 1", "risadorkJun 7 at 7:31 PM\nGreat game\n\nI love the swordplay and slowly but surely fell in love with it.\n\nHelpful | 1\nDeveloper ResponseJun 7 at 7:45 PM\n\nThanks a mil, we spent a lot of time building and rebuilding the combat, so it means a lot!", "BloonixJun 8 at 9:08 AM\nSuch a great game\n\nI like the game mechanics and the multi-player is so fun!\n\nHelpful | 1\nDeveloper ResponseJun 8 at 4:04 PM\n\nThank you!", "Frankie2tymes2May 26 at 4:28 PM\nWaste!\n\nAbsolutely useless! Stay in one room and fight the same 2 characters! Not for me I want a refund.\n\nHelpful | 4\nDeveloper ResponseMay 28 at 12:35 AM\n\nVery sorry to hear you didn't enjoy the game. We have some updates coming this year and would love it if you would consider checking it out before requesting your refund! https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "P4tr0ll3rMar 16 at 7:28 AM\nAn awesome game, but the GLITCHES!\n\nThis game is such an amazing one, but the reason its only three stars is the GLITCHES! There are three that Ive found that not only break the immersion, but also break the game itself. There would be times when the audio/music would completely cut out, leaving you in complete silence thats a bit weird to say the least. Then theres times when you would completely lose the ability to pick up your weapons and items. This would not only break the immersion but also force you to quit the game to reset it. This is especially annoying when youre on an incredibly high floor. The last glitch isnt that bad but still breaks your immersion. Sometimes while playing your player model would rotate, allowing you to see your shoulder while facing completely forward. This doesnt break the game but is still really tedious and I hope it gets fixed, if these glitches are fixed this game would be a guaranteed FIVE STAR GAME!\n\nHelpful | 5\nDeveloper ResponseMar 17 at 3:48 PM\n\nThanks fort taking the time to write the review. Unfortunately, audio issue is out of our control right now until Oculus provide an update which fixes some back-end connection between our game and the hardware. Regarding the last issue, that is something we are aware and hope you have a fix in the future.", "popdude1089May 7 at 5:38 PM\nVery fun multiplayer\n\nIf you're looking for a medieval style multiplayer game buy this\n\nHelpful | 0", "john.longjohn.35Apr 19 at 9:06 AM\nLittle things\n\nLoving the game! Its fun I enjoy it. Its fun role playing in it and getting lost in this world. Somethings that kinda get in the way is how the body is anchored and when using the quest it leans in a weird angle and I find myself always holding the home button to re-centre myself. Also the distance the emu use fight you at feels way to close Im always walking back just to have them step right in my face and make me feel like I have to pull my arm into my chest to get the sword past there body to block there incoming blow. But still live the game maybe try make the dash a button cause I find myself jilting my back sometimes just trying to activate it\n\nHelpful | 0", "wearethechampionApr 6 at 7:21 PM\nHow is this not a solid 5 stars\n\nMe and my friends have been looking for multiplayer games and I found this I started this game expecting a somewhat story but I got something ten times better the floor mode the dojo mode and my favorite the mods I havent unlocked them yet but I cant wait I love this game and dont understand how people rate this one stars. The only thing I think you should add is a small story or something that would make this game even better\n\nHelpful | 0\nDeveloper ResponseApr 6 at 11:40 PM\n\nMany thanks for the glowing review! We're blushing! While we're a bit light on the story we have some cun content to play with incoming very soon! Keep an eye for details!!!", "dj_heeroDec 18 at 4:40 PM\nSword wielding action\n\nI love the swordplay in this game, the co-OP function makes this game more fun... and then the adventure mode adds good replay value along with occasion events. The bbn only gripe I have is, while I'm not sure it's just me or it's a common problem, the audio cuts off overtime during gameplay... then comes back only once in return to the main hub. I wanna give this 5 stars but the audio issues holds that back.\n\nHelpful | 69", "Kaden0102May 20 at 2:52 PM\nRefund\n\nI changed my review after playing more time and actually enjoyed the game so thank you for making me keep\n\nHelpful | 0\nDeveloper ResponseMay 20 at 3:53 PM\n\nGlad to hear it! Stay tuned for more awesome updates coming very soon! :)", "theEnforcersApr 12 at 12:06 PM\nGreat game few issues\n\nThis is truly a great game but it needs more maps and a few audio issues. Its truly fun watch a video and the game play stands out. Worth the money.\n\nHelpful | 0\nDeveloper ResponseApr 12 at 4:12 PM\n\nThanks for the review. We hear you on the new maps and with the up[dates coming later this year, we hope to address those issues. Regarding the sound, unfortunately, that is out of our hands right now and we're waiting on a fix from the Oculus side which we know they are working hard on! https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "TKBlackout1Jun 20 at 12:31 PM\n\nLove the game played hours of it but I dont like how you can see your character makes movement and dodging a little slow and you cant reach out to your waist for the sword cause your bodys clogging up the area and changing where your belt is one thing is that it should show where you got what sword and you should be able to auto clear and fast forward to levels youve already done also when in multiplayer if your swords are the weakest they should be auto upgraded one level for just that match overall amazing game just need to fix some ideas that werent executed correctly and change level up aystem\n\nHelpful | 0", "Sanmoon89Mar 15 at 8:02 PM\nGreat game, but makes you sick\n\nThis game is really fun. The swordplay is as satisfying as it should be, and the graphics are stellar. However, the game does not have movement blinders, making it hard to play for more than 15 minutes at a time. If they were added, the game would be a perfect five. Until then, four stars.\n\nHelpful | 1\nDeveloper ResponseMar 17 at 3:45 PM\n\nThanks for the review! Sorry to hear about the dizzy issue, we'll share the feedback with the team!", "DiscopigsMay 23 at 10:17 AM\nGreat\n\nBuy the game, you wont regret it.\n\nHelpful | 1", "brenden55Mar 3 at 10:35 AM\nGreat game but not what I expected\n\nThe game is fun. the movement is smooth. and I very much enjoy playing it. but I wish there be some kind of free play were you have all the weapons you can spawn in enemies and you can just fight them like that. other then that the game is amazing.\n\nHelpful | 2\nDeveloper ResponseMar 3 at 4:50 PM\n\nMany thanks for the great review! We're working on some great features for 2020 so keep an eye and an ear out for updates! :)", "InsideTheSoundJul 9 at 8:34 PM\nI like the concept but it needs changes\n\nI have just started playing and I am feeling motion sickness. This is the first VR game ever causing me that. And I tried very intense games.\n\nThe game is quite buggy, particularly during ht battles. If you hold only one weapon it works fine, but when you hold two, it moves chaotically.\n\nAlso, there are some light flashes in the game in some dark scenarios that make no sense.\n\nI think the idea of the game is quite interesting and it feels like a decent battling game for medical style lovers mixed with some magic. However, I though it was going to be a bit more like SAO based on the reviews. It is not at all like SAO. You have a very limited area to move in and it is always the same but with different decoration and enemy. It doesn't feel immersive enough. Movement across large areas that connect each other would make the experience much nicer.\n\nOverall, not bad but highly improvable.\n\nHelpful | 0\nDeveloper ResponseJul 16 at 5:32 PM\n\nThanks for the review. We'll take what you have shared into consideration for future updates.", "Will_wrwr55Apr 17 at 10:33 AM\nGood potential but THE GAME CRASHS A LOT\n\nGame would be fun if it didnt crash every time I play. Fun for a while but it lacks in important areas. It crashes easy to often and should crash at all. The game would be worthy of my 5 stars if it had gore or a rag doll animation. Also a vs mode would be great with a 1v1 or 2v2. Plus if we could edit our avatars and weapons would\nbe amazing. Lastly, I sincerely hope that the developers take my advice because it DEFINITELY boast the play count and the fun.\n\nHelpful | 1\nDeveloper ResponseApr 16 at 4:19 PM\n\nThanks for the great feedback. We've started adding mods to the PC versions of the game but hope to bring it to Quest at a later date. We only announced our road map for 2020 and there'll be a little bit of customization to come later this year! Stay tuned!", "Lord.StrykerJan 17 at 12:13 PM\nOnly have one complaint\n\nSo off the bat I have a lot of trouble parrying enemy strikes. It seems like the collision detection for this doesnt always work.\n\nNow the good stuff.\nI like being able to dual wield any weapon and the shield is great. The knives on your shoulder plates are fun. Though throwing them took me a lot of practice.\nOverall I enjoy the arena style combat\n\nHelpful | 9\nDeveloper ResponseJan 19 at 3:19 PM\n\nThanks for taking the time to post a review! We're always fine tuning combat so parrying and collision will get better!", "ShadowScryFeb 27 at 11:56 AM\nHas the potential to be a great game!!!\n\nThe game is overall very good. Combat feels good and it's challenging. With some more optimization and twerking it can be even better. The issue I've encountered is that some time the character starts to move backwards on its own in weird/buggy way. I've tested other games to make sure it's not the controller. It happens randomly and then it stops on its own. Overall the game has lots of potential.\n\nHelpful | 1\nDeveloper ResponseFeb 27 at 3:33 PM\n\nThanks for the great feedback. We're always making adjustments in our weekly patches so stay with us for some great things in 2020! :)", "yesman23Jun 25 at 7:34 PM\nLove it\n\nSorry if I spell something wrong. This game is amazing. You can play with others, you can use shields which is really cool, and you can upgrade you abilitys. One of the best things in the game is if you have enough mana, you can make your weapons do more damage for some time. Best game I have ever downloaded. Quick tip: My favorite weapon is the ax. It is easy to use and does a lot of damage.\n\nHelpful | 0", "Connor287817 days ago\nAMAZING!\n\nTruly an amazing game with the framework for an even better game down the line.\n\nHelpful | 0", "wafflesnosyrupMar 24 at 1:26 AM\nJust buy it!\n\nVery immersive, combat is good and feels like im hitting them with something solid. Multiplayer is fun also, met some really cool people. Would be great if added different environments! Reaching the end is very rewarding. Other than that, great game! Hope the devs read this, yall did a good job and hope u guys keep updating the game :)\n\nHelpful | 1\nDeveloper ResponseMar 17 at 3:48 PM\n\nThanks for the great review!", "ttoille123May 26 at 10:28 AM\nIt is good but I doesnt work\n\nWhen I start the game It crashes it just turns black the I have to restart the quest\n\nHelpful | 1\nDeveloper ResponseMay 7 at 7:00 PM\n\nSorry to hear you're having issues with the game. If you could send us an email at cs@yomune.co, we could look into the issue further. - Yomune.co", "bencharlton20May 9 at 1:08 AM\n\nGreat game\n\nHelpful | 0", "Some.Weird.BoiMay 9 at 4:40 PM\nREAD\n\nyes\n\nHelpful | 0", "SlimeWand644023Jul 23 at 6:22 PM\n\nPretty good bru\n\nHelpful | 0", "AviPrimo11Mar 20 at 5:40 PM\nAmazing\n\nThis game is great for its price and a lot of fun but is there no voice chat because when I got to audio it says voice chat but when I go into multiplayer I never hear a word and my audio tends to cut out very often but nonetheless great game\n\nHelpful | 1\nDeveloper ResponseMar 22 at 8:06 PM\n\nThanks for the great review. Regarding the sound issues, it's an issue related to some back-end compatibility with Oculus firmware and some sound software so once they have it patched up we'll let you know and then there shouldn't be any more issues.", "KPH38Jun 16 at 3:18 PM\nAddicting and super fun with friends\n\nI was wondering weather I should buy this game because all the reviews on YouTube didn't give much gameplay but I can tell you that this game is insanely fun you can repair and level up and get new weapons and the higher level weapons you have the cooler it looks you can sink hours into this game and the graphics look stunning you will not regret buying this game if your considering buying it BUY IT NOW !\n\nHelpful | 0", "Zero_VRFeb 7 at 2:06 AM\nAwesome gameplay\n\nThe game is a ton of fun, and the swordplay is exciting. I also really like the enchanting and dodging mechanics.\n\nAn issue I have is that I'm basically forced to use a shield because parrying sometimes won't work and isn't very reliable. Shields seem to also have that problem on very rare occasions, or it might just be me.\n\nAnother issue I have is that the audio cuts out from time to time, and never works when casting. There's just a constant static sound.\n\nOverall, this game provides an amazing sword fighting experience and is definitely worth buying.\n\nAlso, after reading other reviews, I'd like to mention that I appreciate how the developers respond to them so often.\n\nHelpful | 4\nDeveloper ResponseFeb 9 at 3:11 PM\n\nThanks for the review. Agree that there are issues with the parry and we're looking to improve this aspect of the game. The audio is a known issue we're looking into and many apologies if it's impeding your enjoyment of the game. As for responses, we enjoy talking to players so no problems! <3", "SquaIFeb 9 at 2:18 PM\nGood gameplay, but makes me motion sick.\n\nI'm enjoying the game so far as a sorta roguelite game where I get some exercise in.\nOnly real issue I have is that it gives me motion sickness so I have to limit how long I play at a time.\nI've yet to try the seated mode but I'm sure that'll help me play for longer.\nOverall it's a pretty fun vr game\n\nHelpful | 2\nDeveloper ResponseFeb 9 at 3:15 PM\n\nThanks for the nice review. I hear you on the motion sickness. Sitting will no doubt help and we're rooting for your ability to adjust over time!", "eman1002Jul 15 at 5:57 PM\nFrequent crashing\n\nAs the title says, this game crashes almost consistently when you get to later levels making it just about unplayable, well no it actually does become unplayable. I think I'm too far gone to request a refund on time but fix your game!!!\n\nHelpful | 0\nDeveloper ResponseJul 16 at 5:36 PM\n\nVery sorry that you are experience the crash issues. This is something we are working on a fix for asap. Very sorry for any inconvenience caused by it.", "PandaDragon2020Mar 7 at 6:59 AM\nGreat game,but what it needs...\n\nThis game is great what would be great if it had a blood and gore dlc (not too gory, but just enough). This would be great for the game in my opinion and not have numbers coming out of nowhere.thank you for your time.EDIT: can you add a stabbing feature and not only swinging?\n\nHelpful | 1\nDeveloper ResponseMar 8 at 4:39 PM\n\nThanks for the great review! Blood, etc would be a great addition but we do need to consider ratings, as that will push up ratings, and limit the amount of people we can sell the game to! Stabbing is in the game but we're still fine tuning it to feel much better.", "gottenknight058Mar 26 at 7:36 PM\n\nIt is a great game but it would be better if it had different maps\n\nHelpful | 0\nDeveloper ResponseMar 29 at 6:21 PM\n\nThanks for the review and the feedback. We do have some exciting updates incoming in 2020 which we think will address your feedback regarding levels, so do keep an eye out on our social media! https://twitter.com/gargantuavr", "Drace.SinnovaFeb 29 at 10:56 PM\nFantastic\n\nI have to say I was surprised at this, its better then I expected and if you enjoy arena combat area style combat its definitely a game to own. I would love to see certain things added to the game though. A single player non online mode and character customization would make this game much better. But if you enjoy arena combat definitely give it a shot.\n\nHelpful | 0\nDeveloper ResponseMar 1 at 3:17 PM\n\nMany thanks for the review and your comments! We are adding some extra stuff into the game moving forward which we think will mix up the gameplay! Keep an eye for updates!", "EintauMar 17 at 2:13 AM\nFun game!\n\nAdventure mode is definitely the best mode. Leveling up gear is cool. It'd be cooler if you could fuse level 1 stuff into higher grades, but not a big thing. Keeps you grinding for more. Definitely a good workout too.\n\nHelpful | 1\nDeveloper ResponseMar 17 at 3:49 PM\n\nThanks for the review. Happy to hear you're getting a great workout form it! :)", "meme_good_for_you420Jul 2 at 2:32 PM\nGood game with bug\n\nOver all this game runs great on the quest the ranking up system is really nice the only thing that is bad is the quality but overall this game is really fun to play\n\nHelpful | 0", "SunkmanituTankaFeb 10 at 6:53 PM\nFun\n\nI really enjoy this game and the various combatants. Gets my heart racing. If only Blades and Sorcery was available for Quest, Id buy it the moment it came out...love the blood and limbs in the arena, not just a disappearing body as this game does. Im spoiled on Blades.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 2:36 PM\n\nThanks for the feedback and noted on the gore! We have fans for B&S here too! <3", "wendlandApr 2 at 8:47 PM\nSword of gargantua\n\nThis game is amazing. I just love it more and more. I think that this is a must get game if you want sword combat\n\nHelpful | 1\nDeveloper ResponseApr 5 at 6:40 PM\n\nThanks for the great review! <3", "Billshoto749rApr 8 at 10:53 AM\nIt was worth it\n\nThe game is really detailed and realistic about how swords are supposed to be held\n\nHelpful | 0\nDeveloper ResponseApr 8 at 5:38 PM\n\nThank you so much. Very happy to hear you enjoy the swordsmanship.", "EscapeFromFeelsFeb 22 at 10:32 PM\nA Must get and very very enjoyable\n\nI recently got a quest and there have 2 types types of titles. Ones which are story driven or wave shooters. This game gives you waves, is fair about them, combat is a little difficult but its amazing. If youre looking for an SAO style game with sword combat which is engaging highly recommend!\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 3:36 PM\n\nMany thanks for the great review! We're bringing more cool things in 2020 so stay with us!!! <3", "JessieIsRawrFeb 6 at 5:37 PM\nPretty good!\n\nIt's really fun, and pretty good! I'm having a great time swinging around short swords as fast as I can to win. I just wish there was an indicator to the current durability of weapons. Also I haven't been experiencing any voice chat stuff at all, so I don't know if its a big or what\n\nHelpful | 1\nDeveloper ResponseFeb 9 at 3:09 PM\n\nThanks for the review! Our indicator regarding the degradation of weapons are the little green cracks you can see in the weapons themselves, so do be wary of weapon durability! Regarding the sound issues, this is something we are aware of and working to fix asap!", "Elliott731Jan 23 at 12:50 PM\nGreat gameplay!\n\nThe base gameplay is really fun ad I have no problems with it. The only complaint I have is that it seems like no one is online. I think Im just playing with bots judging by the movements but it might be online players. I doubt that, though. So my question is: How do I play online with others and how can I tell?\n\nHelpful | 9\nDeveloper ResponseJan 26 at 3:21 PM\n\nThanks for the review! There's multi-player options in both Quest and Adventure modes, in which you can join other players. If you find yourself stuck at any point feel free to find players at our official discord: https://discord.gg/aqSkvES", "HalfCountDec 16 at 5:18 AM\nGreat game but...\n\nI just got this game yesterday and I have already fell in love with it, but... blocks are hard to achieve. Most of the time I do a block I ended up just getting hit and its really frustrating. Also, while I was playing today, the soldier general kept thrusting at me and I kept falling down... except, he did it all within a few seconds of each other and by the time I was standing up again he had already hit me. That was annoying because I died because of it. And one question: Is this game inspired by SAO in any way?\n\nHelpful | 24\nDeveloper ResponseDec 18 at 6:59 PM\n\nThanks for the nice review. We're consistently improving game play accuracy to help ensure players are successful in blocking with precision. The game has taken inspiration from a number of places including SAO's online live world. :)", "kkuzma1982Feb 7 at 3:37 AM\nBest swords mechanics with real physics\n\nThe recent adventure update made this game a great roguelite game with outstanding sword mechanics. The evading system when you need to evade with the whole body is something that makes every fight a challenge. I really recommend this title. Only drawback for me is that even for single player games there is a need to be connected to the Internet, maybe it can be changed in some patch?\n\nHelpful | 2\nDeveloper ResponseFeb 9 at 3:13 PM\n\nMany thanks for the 5 stars! <3 Honestly it's not a major priority for us at this very moment but removing online requirement from single player is on our to-do list!", "KosmoriMay 29 at 9:50 AM\nOne small complaint!\n\nTotally awesome, the learning curve isn't too steep and I love the heart pounding thrill of \"NONONO\" when I make a mistake. There is a way to win every fight if you remain cool and calm, but man is it hard sometimes!\n\nI tried it at a VRcade and loved it so much I had to pick up a personal system and give it a go on my own, so I must say I thoroughly enjoy the fun and challenge it presents to the normal gaming environment many of us are used to!\n\nAs for the single, tiny complaint I have... I think it would be neat to be able to change up the character/avatars armor, to give you a different look. While the different colors DOES help, I personally feel like it is the only thing I need added to it!\n\nHelpful | 0", "SwordboyDec 16 at 12:56 PM\nReally cool! Loved it, but..\n\nOkay, I absolutely love the feel and functionality of this game. Walking around using hands on sword and shield tactics is great. Love the update too. But you definitely want a little extra space in your play area if you buy this one. Already punch slot things around the house getting carried away during combat. Wish there was a little bit more free roaming for this and don't understand why I need internet connectivity to play solo player on this. Otherwise this is a perfect sword swinging game for you action buffs out there. Give this game a try, I'm sure you'll have fun.\n\nHelpful | 18\nDeveloper ResponseDec 18 at 7:01 PM\n\nthanks for the score and the great feedback. Sharing with the team for consideration. Glad you enjoyed! <3", "ErWolfonsioFeb 10 at 9:00 PM\nGood...?\n\nIs a good game, and a nice idea, but desperately need maps that are not just an arena\n\nA dungeon created procedurally with previously placed enemies, free to explore, can be a good idea.\n\nHelpful | 1\nDeveloper ResponseFeb 11 at 2:37 PM\n\nThanks for the kind score, and for the great suggestion. We have some cool things coming this year so keep an eye out! :)", "mberg2007Feb 20 at 9:32 AM\nI suppose this is what one can expect..\n\n..of a sword playing game for the Oculus Quest. It's quite fun but also very monotonous during PvE play. For some reason I also found it quite hard to holster and unholster swords. Overall I have to say I was slightly underwhelmed, if not in fact disappointed by this title.\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 3:34 PM\n\nThanks for your honest review. The holstering thing is something we have heard quite a bit about recently and the team is looking to make it a better experience overall. We do have regular updates so please keep an eye on our discord and twitter (@gargantuavr)", "brolylssjJan 17 at 4:00 PM\nIts fun to play\n\nTheres a couple of bugs like how your arms can twist unnaturally far, even if you set your size you still fell like your stubby, weapons are a little hard to grab every now and then but all and all this game is really fun! The combat is fun and the weapons you unlock feel rewarding to use. I hope to see further developments in this game like sword techniques or different sword skills. Very fun game would buy again!\n\nHelpful | 1\nDeveloper ResponseJan 19 at 3:21 PM\n\nThanks for the review! Noted on some of the awkwardness you've experienced with the game. Will share with the devs!", "SoccerSheep16Mar 4 at 2:00 PM\nPretty good\n\nLove this game! Its a must have for an oculus player and is fun to delve into every day. It does get repetitive, though, but with the variety of weapons it makes the time go by.\n\nHelpful | 0\nDeveloper ResponseMar 4 at 3:09 PM\n\nThanks for the great review! We hear you on the repetitive comment, but stick with us as we'll have some great things coming in 2020!", "GraveUKFeb 13 at 3:21 AM\nSword art online meets dark souls!\n\nMajorly addicting. Floor based levels scaling in difficulty but the more you play the better your weapons get. When you die the floors reset but the loot and character level stay the same!\n\nAlso throw potions On the floor to get them to work. Took me ages and a google to figure out!\n\nHelpful | 1\nDeveloper ResponseFeb 13 at 5:26 PM\n\nMany thanks for the great review. And thanks for the feedback RE: Artifacts/Potions. Will be sure the team is aware of the confusion!", "Krimion13Feb 5 at 6:40 PM\nI should've bought this a LONG time ago!\n\nSo for the longest time I held out on buying this, because the videos just didn't sell it for me, but I recently decided to just buy it and see for myself, and OHH MAN!\n\nI'm a huge fan of melee combat, coming from games like For Honor, Mordhau, KC:D, ect. So I've been wanting to play something of that style, and I'll tell you what, this game is a MUST if you enjoy those things.\n\nThe only cons I really have, is like others stated, collisions can be a bit wack at times, but it's not bad.\nAnd then occasionally the sound will cut out.\n\nOther than that, I'm excited for what's to come!\nI look forward to seeing what more you guys add, and I hope you don't stop anytime soon!\n\nHelpful | 1\nDeveloper ResponseFeb 9 at 3:07 PM\n\nThank you very much for the great review. The sound issue is one we're aware of and doing our best to fix. We have some cool stuff incoming in 2020 so be sure to keep an eye out!", "FlipperToast367May 16 at 7:57 PM\nAmazing\n\nI went into this game expecting a fair bit of motion sickness, but was I wrong! I really love the fact that I was able to play this for a really long time and never felt queasy once.\nThe combat was amazing as well. The swords feel really fluid and the shields feel like they actually protect. Hitting enemies with the swords also feels really great as well.\nThe multiplayer is great since its seamless and is great fun to join other players.\nA few drawbacks are present but very minor. Like many other people have brought up there is quite a bit of pixelization from a distance but it isnt really noticed unless you are looking at the score board which requires you to be really close in order to read it. I also wish non mic communication could be improved through the use of possible index fingers and thumbs which would help greatly when decide which gate to go to. It would also be helpful to see damage values from the weapon selection screen (like a base damage of when it is dealing normal damage). It would also be really cool if we could hold swords backwards.\nOverall amazing game with great combat and immensely fun.\n\nHelpful | 0", "Hellspawn4000Jan 24 at 3:21 AM\nSwords of gargantua\n\nGreat game, lots of fun to play and a fair bit to do in comparison of other oculus games and probably one of my favourite sword experience on quest. Bit buggy still with sword play sometimes lagging behind but none the less a great buy.\n\nHelpful | 2\nDeveloper ResponseJan 26 at 3:23 PM\n\nThanks for leaving a great review! Really appreciate you taking the time to play the game and let us know what you think! <3", "RattleKatFeb 6 at 5:13 AM\nGreat but some problems.\n\nI love the fighting mechanics in this game. The sense of weight is amazing; you really feel your weapons connect and dodging works surprisingly well. I don't even mind that it's difficult to block as it adds to tention and makes it more satisfying when you get good. The enemy variety is enough to keep you on your toes too. The problem I'm having though is with thr game freezing and jumping. I'm up to level 41 and the stuttering means I can't progress further as constant freezing makes me feel VR sick in no time. It also becomes impossible to strike or dodge as these game freezes mess with the timing. Such a shame as I'd really love to finish the game.\n\nHelpful | 2\nDeveloper ResponseFeb 9 at 3:08 PM\n\nThanks for the review, and glad to hear you enjoyed the combat. Regarding the stuttering, that's not normal, so if you continue to have issues reach out to us at cs@yomune.co and we'll do our best to help resolve the issue.", "Oculus_SamuraiFeb 2 at 2:13 PM\nBrilliant\n\nYou go through countless dungeons and you can co-op. There are also events and quests. As you level up you can upgrade your stats as well as your weapons with coins. There are many close range weapons to choose from there are also throwables as well as buff potions. Highly recommend to purchase I had a blast\n\nHelpful | 0\nDeveloper ResponseFeb 2 at 4:09 PM\n\nThanks a lot for the great review. Glad you enjoyed the game so much!", "Tesla_CoilMay 11 at 5:33 PM\nKeep playing\n\nFor this game you want to grind a little before judging it or you wont have the full experience and I didnt have too many bugs. The combat is really cool but could use some magic weapons like a healing staff that you have to enchant to use... ima msg the devs about that... or a mace or whip to grab enemies and disable the spinning dudes but weak against tanks. I really need to get a game developing job.\nGreat game but needs like bosses probably.\n\nHelpful | 0", "jackieboi123Jun 26 at 5:33 PM\nReally good\n\nThe games a nice sword fighting game with a built in modding hub.\n\nHelpful | 0", "WestCoast2005Jan 21 at 6:49 PM\nIt reminds me of SAO\n\nThis game is so much fun I love it and it really reminds me of the show Sword Art Online with how amazing the mechanics are and how lifelike the combat is but the best part is it really gives me a workout when I try to use SAO sword skills in it. It would be awesome if their was a multiplayer open world area to explore and meet up with people in and maybe that is where the events could happen in also maybe you can have open world floors that you host the events in each event has a area dedicated for each event.\n\nEdit: To the devs that took the time to read my feed back and even send a link to a website that had lots of cool info I thank you I love your drive I honestly think that by 2022 your game will be as good as the show SAO makes their game seem minus the death part it is people like you that gives me hope for the future of games.\n\nHelpful | 6\nDeveloper ResponseJan 21 at 4:42 PM\n\nThanks for the nice review! We're big fans for the idea of an immersive world like SAO. Something for us to research down the line! Check this interview about the potential of our project! https://venturebeat.com/2019/10/05/gumi-ceo-believes-vr-and-blockchain-are-key-to-connected-worlds/", "Chayko2Feb 23 at 10:16 AM\nIf I could give no stars I would.\n\nI bought this game thinking it would be loads of fun with a lot of people to play with to find out after days of searching it wasnt me having an issue to find anyone to play with its that the servers have no one on them. I kept the game waiting for my friends to buy it but none of them liked it so now I cant get a refund because I sadly had hope for your game. Thanks a lot for wasting my money.\n\nHelpful | 1\nDeveloper ResponseFeb 24 at 3:39 PM\n\nVery sorry to hear that your experience with Gargantua was not good. Depending on your location there may be specific peak times where you're more likely to get into a game with other. Adventure mode does carry a call for help feature which improves the changes of match-making. We hope you'll give it another chance in the future!", "Ray_StarlingMar 8 at 6:20 PM\nSO FUN!!!\n\nAll I really have to complain about to the devs is not making an infinite world... I WANNA PLAY FOREVER!\n\nHelpful | 1\nDeveloper ResponseMar 8 at 7:54 PM\n\nMany thanks for the great review! Check out this article from our CEO because I think it really matches what you want in the loooong run! :) https://venturebeat.com/2019/10/05/gumi-ceo-believes-vr-and-blockchain-are-key-to-connected-worlds/", "DreamReaper600Feb 4 at 11:02 AM\nAmazing but one problem...\n\nIm only a few levels in and I cant stop playing, but its so hard to parry the swords, and Im always dying when I lose my shield. But overall Awesome!\n\nHelpful | 0\nDeveloper ResponseFeb 4 at 3:25 PM\n\nThanks for the review, really appreciate the stars, and yes, there are people having some issues with parrying. Finding the sweet spot can be difficult for people and we're always looking at ways to improve that so everyone has a challenging yet fun experience with the game.", "Drake_NobleOct 28 at 10:51 AM\nFull review\n\nThis game is a sword fighting game with some lore!\nNow it shows you combat and how to be a skilled fighter, now as someone with sword fighting experience and shield usage exp I know there is no hit box issues!\nYou can't put a object between you and a heavy/sharp fast moving object n expect it to block.. you need to really parry... Meaning put force into flicking that wepon back or off its normal course.\nI would love more variety of wepons and skill setting to make it impossible as I want that challenge and work out.\n\nThis games fun. Treats you nice and shows you some fairly basic sword play people don't actually know!\nIt has great promise... But I see the game and for the 5 star price I want more... I want variety in wepons n maps.\n\nThat all said. It's worth the money as it's potentially able to easily go to five stars I'd want a little more.\n\nLast words... Fun n leaves you wanting more.\n\nNecessary upgrades, variety on shields n swords.\nThe ability to parry by using the flat part of the sword and not the edge to make enemies knock back further or even drop their sword (doesn't work against heavy rated swords and maces etc) doing this with a two handed sword or mace/hammer etc lose less durability or stamina drop when parrying an attack\nEnemy weak points being added (not including the ones already) but with stabbing between the bridges of individual armour sets\nInstant kill moments but hear me out. When you are in a battle, if you are knocked to the ground samurai would circle and stab you at these moments so it should be something you can do to an enemy.\nImpossibly hard stages not as waves but better implemented as (let's just say) fallen teachers of your in game character (this also builds to the story)\nAnd please let this game as it claims so real, I would like to grab an enemy wepon while they are stunned or knocked over (notice the size of the enemy are much bigger or smaller and more nimble they can easily take them back)\n\nAll these things would mean adding a lot more scripting and animations and much more, hey I do what you do just not in VR.\n\nTHESE ARE JUST SOME SUGGESTIONS FROM AN EXPERIENCED SWORD FIGHTER\n(I have had duels with real blades and shields and know much of samurai tactics and moves used so please consider it ^_^)\n\nHelpful | 40", "JakePro66Mar 2 at 11:38 AM\nPretty good excellent idea\n\nThe major con to it,is that it doesnt take into account the person having muscle. I reach for my throwing knives and it grabs my sword.\n\nHelpful | 0\nDeveloper ResponseMar 3 at 4:48 PM\n\nThanks for the feedback. We're always providing quality of life updates to the game, so I'll be sure to pass on your review so that the team can take your feedback into consideration!", "SaladBoyCCJun 12 at 12:12 PM\nPre-Teen thinks its AMAZING!\n\nAmazing! Best quality. Great customization and graphics. Skill level is right now for a pre-teen.\n\nHelpful | 0", "spriggen_theifFeb 28 at 3:41 PM\nAmazing sao\n\nIm a huge sword art online fan and this the closest thing Ive found to it Ive found and I absolutely love it.\n\nHelpful | 1\nDeveloper ResponseMar 1 at 3:15 PM\n\nThanks for the great review! Glad you have been enjoying! :D", "Philbin421Mar 6 at 4:03 PM\nDecent\n\nDecent game, kind of repetitive. Not much of a tutorial. Cool to just hack and slash enemys\n\nHelpful | 0\nDeveloper ResponseMar 8 at 4:37 PM\n\nThanks for the review. We're adding more features this year to mix up additional gameplay elements, like what we did with the Tesseract Abyss update. Keep an eye out for when we share details!", "Mdempsey228Feb 5 at 2:25 PM\nBad game dont buy\n\nBought the game a while ago, but just recently starting playing it. Its horrible. Amazing idea, great graphics, good physics, and overall very well done. But the game is almost unplayable because of blocking. You cant block. The game refuses to let you block for no reason. Like I said amazing idea and amazing execution. But fix your game before you sell it. Waste of time and money.\n\nHelpful | 0\nDeveloper ResponseFeb 5 at 2:51 PM\n\nVery sorry you had a bad experience with Gargantua. We understand that the parry is not as clear as intended and we're consistently looking at how it make it accessible to everyone. Please feel free to keep an eye on our updates and you're always welcome in-game.", "PostokonJan 25 at 2:49 PM\nMust Buy\n\nThere's always room for improvement so 4 stars is the best I give. I love RPG games and anything to do with knights and warriors. This game absolutely delivers\n\nHelpful | 0\nDeveloper ResponseJan 26 at 3:25 PM\n\nThanks a lot for leaving us this review. Glad to hear your having a great time with the game!", "LuvTEA_XDJan 16 at 3:11 PM\nHonestly another must have\n\nThis alongside beatsaber should be up there on anyones top 5 list. Since there isnt a true blade and sorcery on Quest, I feel this fills that niche. In addition, it has many modes and a seemingly endless multiplayer mode where you start with mediocre weapons but slowly rank up and get more powerful.\n\nThe physics in this game are definitely a little weird, considering that it must be dumbed down to allow the phone processor to run it. However, the sword fighting feels very natural, and parrying is actually a thing now, with blade collision.\n\nHowever I do have one gripe: at around 50 levels in for the adventure mode, my audio shuts off and there is no guaranteed way to turn it back on unless you get lucky and it turns on by itself. This is not extremely annoying, but its easier to die as you cant hear a snipers shots flying at you or a blade about to connect with your torso from behind.\n\nHelpful | 1\nDeveloper ResponseJan 16 at 3:10 PM\n\nThanks for the kind words! We're doing our best to make a great sword fighting game and your review helps us stay motivated to fine craft to make an even better experience. The audio issue IS an issue and we're currently investigating the cause. Hoping to get that fixed ASAP.", "CaminoDiabloJan 28 at 3:45 PM\nAwesome\n\nDont really like these types of games but let me tell you, worth every penny. Takes getting used too, getting your gear where you want it and figuring out the flow of fighting but, if you want to feel like a gladiator, this is the game.\n\nHelpful | 0\nDeveloper ResponseJan 28 at 10:47 PM\n\nThanks a lot for the great review. Very happy you are enjoying the game and hope you'll enjoy the awesome features incoming in 2020 :D", "TheBunnyGamerJan 14 at 12:22 PM\nAmazing swordsmanship\n\nI'm in love with the sword mechanics of this game, especially the use of multiple weapons in combat. However, the whole game feels a little underdone, like it could've added more. Especially the story. Also, where is the PvP option? That'd be a great addition to this game. The only other thing I could suggest is a little character customisation.\nThanks!\n\nHelpful | 0\nDeveloper ResponseJan 14 at 3:16 PM\n\nThank you very much for the positive comments! Makes our day! PvP is current in investigation mode and we wanna make sure that it s right before we move forward with implementing it into the game! Character customization is also something we're looking at but it's at a much earlier stage than the PvP right now.", "RicksharMay 8 at 6:23 PM\nSwords of Gargantuan\n\nJust played this game and it's worth the price. Just wish I could talk to the other players. Maybe I can but haven't figured it out yet. Can't wait to see what's next. I will be playing this game more.\n\nHelpful | 0", "vrabbitsDec 25 at 2:33 PM\n4 stars is the most I can go.\n\nNot a,bad game don't get me wrong it's decently fun I recommend it. Just not for me. The graphics are fine and the storyline is great. However the controls are pretty bad. Swords are clunky and hard to sheath. You can't sprint which drives me mad however you can dash with feels awkward. Hard to enchant any weapon takes multiple tries to get it to fully register. No idea how to use any consumables. I grab them and its just a long tube I've clicked every button I know of and nothing works ( I'm sure they do work just can't figure it out). Shields kinda suck because the AI stands so close their sword almost always hits me even though I feel as if I blocked it. Throwables is a good idea but since I can't sprint not very practical. Sometimes my sword just stops working and I start only doing one damage no matter where I hit. As of now theirs plenty of more cons I could add,but I feel,as,if,the game creators are trying to make this a good game. It is decently fun and ill love playing it with buddy's for sure. I recommend you get the game and try for yourself.\n\nDevs if you read this check out ninja legends and sairento and try to get the feel of their sword styles.\n\n\nUpdate keeps crashing and black screens. Event makes 0 sense sorry but I'm refunding.\n\nHelpful | 5\nDeveloper ResponseJan 5 at 5:49 PM\n\nHi, very sorry to hear you're having some issues with the game. If you could send us some more info at cs@yomune.co, we could help find these issues. Other than that we appreciate your feedback on the game and hope we can sort out this problem.", "BeerussssssJan 21 at 4:18 PM\nSuper fun!\n\nThis game is really fun to play with a friend or even by yourself because it has a small farming game and weapon upgrades which I know I love to do. I play this game daily and I recommend other to give it a try.\n\nHelpful | 2\nDeveloper ResponseJan 21 at 4:44 PM\n\nMany thanks for the awesome review. Glad to hear your having a great experience!", "Kawii_SenpaiDec 29 at 9:35 PM\nPoor game\n\nThis game is a nice concept on paper but it gives you minimal arm length and the controls are terrible. Even with a sword and shield theres a high chance that their attack will just go through it anyways, regardless of how well you pary, ontop of all that the graphics are mar to look like 90s doom causing massive motion sickness\n\nHelpful | 4\nDeveloper ResponseJan 5 at 7:48 PM\n\nSorry to hear you didn't have a good experience with the game. Will be sure to share you comments with the team.", "SeniorApollo93Apr 3 at 8:01 PM\nGood game but\n\nFor starters this is a great game, but what I hate is that when you are on multiplayer all the knights look the same. I know they have separate colors but it would be nice to customize your armor. Even make a cluster avatar for the game would be cool to.\n\nHelpful | 0\nDeveloper ResponseApr 5 at 6:42 PM\n\nWe hear you on the enemy variety and we're working on more updates for 2020 which will be really nice! Keep an eye out on our social for updates! https://twitter.com/GargantuaVR", "Sniper-447May 29 at 7:07 PM\nBad settings\n\nIm some one who likes to mess around with the settings a lot and this doesnt have any, at all no settings for anything even thought its such a niche game.\n\nHelpful | 0\nDeveloper ResponseMay 31 at 5:10 PM\n\nThanks for the review and the feedback. By settings do you mean game modes? Regarding actual settings, they can be accessed in the main area, for new player modes, we have a bunch of stuff coming this year so feel free to check out the link below: https://www.vrfocus.com/2020/04/swords-of-gargantua-road-map-reveals-upcoming-pvp-battles-and-ooparts-labyrinth-quest/", "psully4114Jan 8 at 2:30 AM\nIts janky but it has potential\n\nI see what they were going for but the game is hard. Not challenging. Its hard because the game is slow and janky and unresponsive. The game is not lazy. It clearly has a vision that in my opinion just hasn't been fully realized.\n\nPro-good variety of weapons\n\nThe level, character design is interesting\n\nThere seems to be a good deal of content available\n\nCoop Multiplayer is definitely a plus\n\nThe game is a bit janky but I haven't really seen any bugs so thats good.\n\n\nCons- the games graphics are somewhere between ps2 and ps3 but its a quest title so I give that a pass if the art direction is interesting and it is so this is a really minor nitpick\n\nThis is the big one for me...\nThe blocking almost never works. The game spawns dudes periodically without doing anything notify the player. The AI will cause enemies to flank behind players and just barrage the player with a flurry of attacks which makes them nearly unavoidable.\n\nPlayer speed is a crawl. There is a feature that allows players to do a quick dodge which relies on me holding a trigger and nodding my head in the direction i want to dodge but again its janky, so I spend a good deal of time banging my head with a 3 lb headset on hoping that it does what I want it to do. It will interpret very slight head movements as an attempt to dodge and ignore obvious attempts which is just no. I hate this feature.\n\nAll in all I can see this being a great game but for me its just not there yet. I'll update my review as patches drop for it and take another crack at it. I don't remember how much they charged for it but I'd say its worth $10 or $15 but if its $20 I gotta give it a pass until the iron out a few of the details.\n\nHelpful | 2\nDeveloper ResponseJan 8 at 3:25 PM\n\nHi there, it's pretty clear you had issues with our dash system and movement in general and we appreciate the candid feedback. We are doing regular updates from content, events and quality of life patches, so please do keep an eye out for updates (as you've said) and feel free to jump in at a later point!", "singer.vincentDec 28 at 4:14 AM\nAddictive.\n\nI love this game. Ive gotten more hours out of it than any other quest title so far and its easily one of my favorite games. It is HARD. I got all of the medals on each of the 100 single player missions and that is a testament to how addictive this game can be (it would be really nice if there was a reward for doing that, like a special weapon or some kind of badge to let people know as youre playing online). Speaking of online, thats great too! I have yet to get to the boss and its another very intense challenge to make that happen.\n\nI do have a couple of issues for the developer that I think really need to be fixed. The sound and music cuts out quite frequently. Also the game crashes when you quit single player missions and even makes the quest randomly lose its guardian system forcing you to reset the quest. These issues are very annoying.\n\nIn terms of the mechanics of the game, it would be nice if you could equip items in single player missions before the quest which would prevent you from having to quit (and potentially have the game crash).\n\nAlso, the throwing knives are kind of annoying. They are very hard to aim and do almost no damage. Worst of all is that when Im trying to grab weapons off my back I very frequently pull throwing knives by accident. Urgh!\n\nThose issues aside, this game is incredible. I hope they continue releasing more content because its incredibly engaging. My first impressions were ok but once I gave it a real chance I was completely hooked.\n\nHelpful | 5\nDeveloper ResponseJan 5 at 7:40 PM\n\nThanks for the positive comments and the feedback on how we can improve the game, we really appreciate it! We know about the sound issue, and are working on a fix for it. As well as the crashing issues. We're gonna continue supporting Gargantua in 2020 so looking forward to seeing you in-game!", "GameFoxxoFeb 6 at 7:22 PM\nLove at first swipe\n\nI really like how the weapons work. I especially like how the two handed swords handle. i really recommend it, alone or with others.\n\nHelpful | 1\nDeveloper ResponseFeb 9 at 3:09 PM\n\nMany thanks for the great review!!!", "alex_rognJan 23 at 1:07 PM\nRealy good\n\nLove the game and playing it hours after hours. There is a little problem with that the sound sometimes pops, meaning it will not work for maybe 1 minute, but thats only in co-op beside that the game is amazing\n\nHelpful | 0\nDeveloper ResponseJan 26 at 3:22 PM\n\nThanks for the 5 stars! The sound issue is something we're currently aware of and are working to find a fix asap! Once we get it done we'll be sure to let everyone know through our social media channels.", "firecatgamingJan 13 at 1:22 PM\nThe online is awsome\n\nThe online reminds me of sao sword art online going floor to floor clearing the enemies. This game also has an amazing story mode with bosses that are giant the weapon though they could use some more long swords but the game is awsome\n\nHelpful | 2\nDeveloper ResponseJan 13 at 5:26 PM\n\nThanks for the glowing review. More looooooong swords! Understood!", "Four20frazedFeb 29 at 11:35 PM\nLaggy\n\nThe game lags bad when I move around especially when I'm holding two swords. The enemies sometimes go through your blocking\n\nHelpful | 0\nDeveloper ResponseMar 1 at 3:20 PM\n\nVery sorry to read your experience of Gargantua was unsatisfactory. The delay in two-handed sword is to simulate the heaviness of 2-handed swords. Regarding the blocking issue. We've had a few reports of this and are continuously trying to improve the experience for everyone. We hope you'll keep an eye out for future updates and give us another try in the future.", "BLZDPraetorianDec 23 at 1:13 PM\nDESTROYER SWORD KING SLAYER\n\nI had tried this game early on. But passed on it from not really getting into it. NO IDEA how i slept on it this long. Its the BEST sword game we have. AMAZING co op adventures! Once you learn to play along with the worlds laws (Physics, mechanics, gameplay) you will be so much better off! Lots of weapons, decent mix of enemies. Great great game! Hope to see more content!\n\nHelpful | 5", "GhystJan 29 at 4:54 PM\nGreat game worth the money\n\nLooking forward to seeing where this game goes.\n\nHelpful | 0", "Chickens365Dec 18 at 7:41 PM\nDam hit boxes\n\nIts alot of fun, but you need a large play area I bumped into my wall countless times. Hit boxes are not great with the mace it looks like I hit but is just flails around doing no damage.\n\nHelpful | 7", "Agent_MimeJan 26 at 11:48 AM\nOne of the most underrated VR game\n\nThis game is a killer I love the Luigis mansion type adventure mode along with the huge verities of weapons I hope they add more in the future.\n\nHelpful | 2\nDeveloper ResponseJan 26 at 3:34 PM\n\nAppreciate the wonderful words. I think this is the first time we've been compared to Luigi's mansion <3 Love it!", "Yuki_NagatoDec 26 at 3:03 PM\nAn amazing multiplayer experience\n\nThe sense of progression of the recent patch really added a lot to the enjoyment of the game. Me and my friends play this game quite a bit now.\nJust grinding through multiple floors and progressing our characters base strength and the levels you get temporarily as you go into the dungeon. Depending on the run and the buffs and debuffs you get, the optimal weapon and tactic to use subtly changes.\nThere are multiple melee weapon types as well, each of them having a unique way of using them with strengths and weaknesses. It's really finely crafted.\n\nAnd the dev team even adds more and more as time goes on. Really excited to play it more once they add more enemy types!\n\nHelpful | 2\nDeveloper ResponseJan 5 at 5:49 PM\n\nThanks for the glowing review. Appreciate you taking the time to play our game!", "SaxomophonistSep 22, 2019 at 3:30 AM\nPros, Cons & Improvements\n\nFirst off, I really enjoy the crazy hectic sword battles I quite often find myself in in this game. Trying to parry, block, dodge and counterattack against multiple enemies is incredibly fun! I would recommend having a textile surface in the middle of your playspace, with enough space to swing your arms around crazily as you WILL lose track of your positioning otherwise (punched my wall a few times haha)\n\n\nPros:\n\n- Sword play is engaging and fun, with a decent learning curve involved for both the fight mechanics and the enemy movements.\n- Single Player progression is satisfying, with a good tutorial process, which initially tells you all you need to know without making it too easy\n- Multiplayer is fun when you can find teammates to join up with and is a necessary element when trying to play the higher levels\n- Sword physics are progressively improving, so it's nice the Devs are still actively working on it\n- Events organised by the Devs occur regularly in-game and on social media which can reward players with new and unique weapons to use\n- Voice chat works well and as of yet I've had no issues communicating with other players (although better hand gestures would be nice)\n\n\nCons:\n\n- Only one weapon can be equipped at a time, meaning no personalised builds such as dual wielding or shield & sword\n- Weapons and shields picked up during gameplay have no visible health bar and cannot be attached to your avatar or repaired\n- Cannot customise your in-game avatar or armour design/colour\n- Sword physics are decent, but will often get caught and stuck on objects or just not track very well. I find myself just doing overhead downward hammer swings most of the time\n- Enemy attacks will often ignore your blocks because of how close they position themselves to you (unless you spend the entire game moving backwards during fights)\n- Projectiles are not easy to master or even understand. Some throws feel auto-locked whereas others go off at random tangents\n- AI teammates are completely useless in end-game because they have no ability to dodge unblockable attacks, revive other AI, utilise power ups or prioritise objectives\n- Picking up items is frustrating and not at all intuitive, as the line projecting from your hand does so at an awkward angle and also disappears immediately from sight\n- Not many multiplayer levels to play through yet\n\nImprovements:\n\n- Improve weapon tracking to allow for faster/more intricate combat when up against multiple combatants\n- Add an additional weapon slot over our shoulder for off-hand weapons such as shields/shuriken/nunchuks, even if these weapons aren't repaired while holstered it would nice\n- Let us choose from a select number of colour options for our avatar's armour\n- Program the AI to not actively move into the path of unblockable attacks (such as Gargantua ground slams) and to also revive other AI\n- More multiplayer events as opposed to single player, as matchmaking is always an issue. Having more people actively engaged in the servers would be nice\n- Map finger tracking to the controllers so that the use of more hand gestures is possible\n\n\nHopefully more people get into this game, as it's best enjoyed with teammates you can communicate/coordinate with.\n\nHelpful | 113\nDeveloper ResponseSep 30 at 5:25 PM\n\nI replied to your thread over on Reddit but thanks again for the comprehensive feedback! We'll utilize it to make a better experience for everyone!", "WeebMaster13Feb 17 at 2:59 PM\nIt don't work\n\nIt says that it's not connected and when i check the connection it's has all bars i terd to resting it and all the ather games work please fix it\n\nHelpful | 1\nDeveloper ResponseFeb 18 at 2:32 PM\n\nHi there, sorry to hear you're having connection issues. Pleas make sure you are connected to the internet when playing as it is a requirement of playing Swords of Gargantua. If you are connected please pop us a mail at cs@yomune.co and we'll help find a resolution asap.", "Skeletor628Dec 21 at 11:57 AM\nWow\n\nI bought this game because I wanted another multiplayer game. It exceeded my expectations. I can not express how enjoyable the gameplay is. Before adventure mode was introduced this game was probably a solid 3 stars, but now with adventure mode the game has been taken to a whole new level. The only problem I have is that their is basically no story. Just some narration at the beginning, but otherwise one of my favorite games on the Quest right now.\n\nHelpful | 3", "shiggydiggy96Nov 24 at 11:32 AM\nBetter than expected but a little flawed\n\nI've been playing for about a month or so and I absolutely love it everything about this game from the setting to the graphics to the fact that you get a full player model instead of just a pair of hands is absolutely amazing to me for the quest. my only gripe is that for some reason my player model seems to glitch out for no reason during combat every now and then. And the tracking on the body needs a bit of polish. Other than that it's a great game and I definitely recommend it.\n\nHelpful | 5", "VrlizardFeb 20 at 9:00 PM\n\nBest game\n\nHelpful | 0\nDeveloper ResponseFeb 24 at 3:35 PM\n\nThanks very much!!!!", "Zackary07Apr 7 at 12:28 PM\nBest game ever\n\nThis game is amazing worth every cent of the 20 dollars. Reminds me of sword art online (sadly full dive headsets arent a thing yet) seriously though the realistic swords play is wonderful. Basically if you like this style of game prepare to be amazed!\n\nHelpful | 0\nDeveloper ResponseApr 8 at 5:37 PM\n\nThank you for the great review!", "TheSage44May 3 at 4:20 PM\nPrity dope.\n\nWorth the money\n\nHelpful | 0", "steamingpiranhaFeb 9 at 11:34 AM\nPhysics\n\nThe physics is amazing and I love it\n\nHelpful | 1\nDeveloper ResponseFeb 9 at 3:13 PM\n\nThanks for the great review! Very happy your enjoying the game!", "BigBeerusJan 23 at 9:51 AM\n\nOverall its a solid and good game the swords just swink kinda rubbery and im very disappointed that stabbing doesnt really work\n\nHelpful | 1\nDeveloper ResponseJan 26 at 3:17 PM\n\nThanks for the review. Sorry to hear you didn't find the sword physics satisfactory, but we're continuously trying to improve their feel. We're looking more into stabbing and thrusts so keep an eye out at future updates!", "BobbydabrickJan 20 at 8:49 AM\nOUTSTANDING IMMERSION\n\nI love this game it is SOOo addicting one more thing can you maybe add impalement if you stab with your sword hard enough?\n\nHelpful | 0\nDeveloper ResponseJan 21 at 4:43 PM\n\nThanks for the wonderful review! I'll send your suggestion to the team. <3", "MrMan0715May 1 at 5:28 PM\nThis game is pretty gopd\n\nYep worth the money! Even if the graphics arent that good it is still a fun game. :)\n\nHelpful | 0", "Hodor69Jan 5 at 9:32 AM\nGood\n\nIts fun but its gets hard fast and it glitches a lot\n\nHelpful | 1\nDeveloper ResponseJan 5 at 7:55 PM\n\nThanks for the feedback!", "IWillGuideTheeApr 23 at 11:55 PM\nWow\n\nOne of my personal top 10. Deceptively simple but very solid gameplay. Multiplayer is a riot, in the best way\n\nHelpful | 0\nDeveloper ResponseApr 27 at 4:01 PM\n\nThank you!", "rapterdabterJan 27 at 3:56 PM\nGood game\n\nI found the multiplayer fun and me replaying it\n\nHelpful | 0\nDeveloper ResponseJan 27 at 6:51 PM\n\nThanks for leaving a great score! Very happy that you enjoyed the multiplayer!", "CerasobilNov 6 at 9:39 PM\nA good game that still needs some work.\n\nThis game is fun as all hell. Easily the most played game on my quest. But, it is definitely buggy and frustrating. While it had an awesome progression, where you level up weapon types and have to complete levels in different ways, the tracking and physics and be infuriating. It had a tendcy to lose track of the sword or worse in close wuarters, blocks get clipped through. As in I can watch the enemys sword clip through mine to hit me, But thats rare. I love the multiplayer levels, but if you cant find people to play with, you wont make it past maybe the second or third level. Mainly because the AI is completely useless. They dont revive each other, you cant command them to certain tasks, such as guarding the objective, or revive fallen team mate. My absolute biggest complaint is when plowing through solo levels, Atleast once per session, my game glitches, and when I switch weapons in the main menu area or between levels, it will show Ive changed weapons, I can see Ive changed weapons, but when it loads the next level, my weapons just gone, and it reverts to my old weapon. Extremely frustrating because I have to kill the entire game to fix. The location of your arms/shoulders is a bit weird, but you get used to it. My main point is this game is a ridiculous amount of fun. And while it has some bugs, the developers are actively trying to repair and progress this wonderful game.\n\nHelpful | 5", "VEEQ_TARQDec 13 at 6:27 PM\nGreat game!\n\nThis game has almost life like sword fighting and good leveling system but the reason why i put it as 4 stars is because u can get motion sick after a while\n\nHelpful | 2", "william.mcknight828Dec 9 at 1:08 PM\nMaybe its just me...\n\nAs a huge fan of Sword Master (on my Vive), and pretty big fan of Ninja Legend, somehow I just dont get it with this game. Its the locomotion. With the games I mentioned, you are stationary in one spot except for the ability to move around in your guardian. In this game you have to use your joystick to pursue enemies, which is only a slight negative as the thumb manipulation takes your concentration away from attack and defense, but for some reason as I pursue an enemy this game keeps pushing me back over and over and over and over. It takes forever to arrive at the enemy to engage in combat, which is why I play, and when I finally get there Im too frustrated to concentrate on the task at hand. Im hoping theres just something I havent figured out yet, but for now I wish Id never bought this game.\n\nHelpful | 2\nDeveloper ResponseDec 9 at 5:22 PM\n\nVery sorry to hear you haven't had a great experience with Sword of Gargantua. One of the key skill points of Gargantua is trying to evade push back through the dash mechanic. If you're having issues it might be that we haven't explained it well enough and it's something for us to investigate. Appreciate your time playing with us and hopefully you'll consider giving us another go down the line. - Yomuneco Team", "CrazyPolakJan 28 at 7:02 PM\nIf youre here for multiplayer\n\nIf you are buying this game to play with friends, dont.\n\nHelpful | 0\nDeveloper ResponseJan 28 at 10:46 PM\n\nHi there, while we appreciate your leaving a review, it might be more constructive to share your reasons as to why you had such a negative online experience. That way we can maybe help resolve your personal issue with the game, or at least highlight any potential detriments to the community to our development team.", "LowTierNinjaJan 3 at 5:26 AM\n\nA VR Dark Souls lol\nFreaking awesome !\n\nHelpful | 2\nDeveloper ResponseJan 5 at 7:50 PM\n\nThanks! :D", "TristanDmarcoJan 14 at 2:24 PM\nNot very fun.\n\nGame is very repetitive with the same levels and the same enemies throughout the game.\n\nHelpful | 0\nDeveloper ResponseJan 14 at 3:08 PM\n\nVery sorry to hear that you didn't enjoy the game. Just to confirm you tried the Adventure mode right? There's a bit more variation compared to the traditional single player experience. There's more to it like leveling up, weapon crafting and different boost and challenges. You can also take on Gargantua as well which for solo players is a first.", "RedGreenWildOct 4 at 12:49 AM\nRepetitive and unrealistic\n\nThis game has the same boring plot, imagine taking out three waves of enemies, while defending a tower, although its the same map every time and every sword strike just bounces off the enemy, stabbing isnt useful, it just bounces off, although a stab is an instant kill in any situation. There needs to be human enemies, different maps, and realistic sword to body mechanics. Otherwise this game is garbage. Dont buy it, wasting your money.\n\nHelpful | 14", "phil.wessonNov 8 at 1:44 PM\nA fun but lonely time\n\nI really enjoy this title. The movement and combat (provided you take the time to learn), is very good. However, Ive had a hard time finding people to play with.\n\nHelpful | 1", "GayBarJesusNov 29 at 12:29 PM\nFeels brilliant to play\n\nHavnt even played coop and i love the combat and weapon selection\n\nHelpful | 5", "ThedubyahOct 14 at 12:01 PM\nAn actual sword fighting game!\n\nThis is one of the only sword fighting games that I know of. It had cool mechanics parrying and they dont just go flying every time you hit them. It still has some things to work out but overall an amazing game!\n\nHelpful | 0", "B_Alexander5Mar 22 at 2:19 PM\nNot very good\n\nI would block or parry an attack and they dont work!fix this stupid problem\n\nHelpful | 0\nDeveloper ResponseMar 22 at 8:11 PM\n\nThanks for the feedback. We know there are some issues with blocking and parrying for people. Do consider your spacing against the enemy and check out the following videos: Defense: https://www.youtube.com/watch?v=nsXbKEbLJ34 Lock-on and Dash: https://www.youtube.com/watch?v=5DJBAbylGik", "Llenn-Oct 5 at 9:15 AM\nNice game\n\nGood game really like it but when I try to get my sword I accidentally get my knife also if you dont like swords or just combat may not be the game for you but if you love swords and combat you will enjoy\n\nHelpful | 1", "FourFor4Jun 7, 2019 at 7:16 AM\nRough around the edges but fun.\n\nThe collision contact of weapons is something that needs to be worked on a bit more. When in a battle you sword often gets caught up a bit so its kinda of a learning curve to fight in the way the game is made. And another issue I have is that the vest is HUGE and seems more in the way than anything. All that being said you get an amazing sword combat experience especially when its multiplayer! The price point seems fair enough due to the vast amount of content stored in this game.\n\nHelpful | 55", "tyler.yeet.942Jan 11 at 7:28 PM\nPp\n\nPp\n\nHelpful | 1\nDeveloper ResponseJan 13 at 5:14 PM\n\nVery sorry you didn't have a great experience with the game . If you could let us know how we can make it better don't hesitate to share your thoughts!", "IndigoSabreOct 21 at 4:34 PM\nWorst game ever\n\nThis game has the worst sword physics in the world. Parrying doesnt even work unless your standing still for three seconds and it still doesnt even work half of the time. This game should be 10 bucks because of its lack of stuff to do you got multiplayer and single and thats it. Multi player is super easy and is no fun after two rounds and single get to hard to play if you cant block anything. You should be looking at better games and not this junk.\n\nHelpful | 4\nDeveloper ResponseOct 22 at 4:20 PM\n\nHi IndigoSaber, thanks for the message. Sorry to hear that your experience was not good. We are continuously working on improving the combat and have a considerable update coming within the next few months. We hope you'll return and have a better experience by then - Yomuneco Team", "Blackhole777Oct 14 at 6:43 AM\nTrue sword fighting\n\nBest sword combat and tracking. Seems hard until you get the rhythm of combat sorted. Excellent.\nI need to try this with no guardian on a field. Environment graphics seem plain but I don't get motion sickness in this game. I think it's due to the plain backgrounds. Character models of enemies are great.\n\nHelpful | 0", "Bag4LifeOct 12 at 3:05 PM\nThe sword physics need a serious upgrade\n\nThis game is fun, but the physics and tracking of the sword let it down massively! They both need a serious upgrade! Rapid swings of the sword turn into a disaster very quickly and it slows the entire pace of the fights you have down significantly! A one handed sword should not be so slow.\n\nWith all that said, the game does rapidly become very repetitive too.\n\nI'd say in its current form, this game should be valued more around the 10 mark. Which doesn't seem like a drastic change, but considering the market of VR games and there prices on the Oculus Quest, there are better more diverse games out there for a lesser cost.\n\nHelpful | 4", "C2H4OWARRIORNov 12 at 2:52 AM\nGreat game \n\nMe and my son's love it that's all I can say about it. One of the best games I've ever played\n\nHelpful | 1", "Neomorf03Sep 12, 2019 at 4:45 PM\nLike Blade and Sorcery..\n\nI am thoroughly enjoying this game. It's as close to Blade and Sorcery you can get on the Quest. The physics are good, but parrying can be a bit buggy. I frequently fail to parry, though I can't figure out why. The progression is a little slow and not clearly explained. It's great fun though.\n\nHelpful | 1", "Cowb0yNov 3 at 3:02 PM\nWOW!\n\nThis game exceeded my expectations truly it is a great sword fighting games and its just overall great I cant find any bugs\n\nHelpful | 0", "SilverRankedNov 23 at 8:34 PM\nYes\n\nYes\n\nHelpful | 1", "Lady_MadelineOct 6 at 7:29 AM\nLove it\n\nThis is an amazing game and very long and I'm not even close to half way yet despite playing it every day the levels get harder as you progress which I think adds more immersion due to the NPCs being more and more human like I love it so far and rate it 5/5\n\nHelpful | 0", "HijackjakeOct 8 at 5:34 PM\nIts not that good\n\nYou cant stab you can only cut people. And the throwing system is super janky. And some of the challenges to get to the next weapon are impossibly hard. The whole game needs a lot of polish I hope they keep expanding the game and make it better. The whole game just left me unsatisfied. If I had the option of refund I would take the option. And Ive unlocked three pages of weapons.\n\nHelpful | 0\nDeveloper ResponseOct 8 at 5:57 PM\n\nThanks for leeting us know what you thought of Gargantua. Just wanted to note that blade-based weapns like the swords and rapier can stab, but the blunter weapons don't have that option (like mace, etc). Maybe we need to make that more clear in the game so we appreciate you sharing your thoughts. We do have some big updates incoming and are always trying to improve the play experience, so do keep an eye out for future updates. - Yomuneco Team", "Cable312Jun 6, 2019 at 12:06 PM\nFinally True co-op!!\n\nBeen waiting for a true co-op game getting my brother and cousin to download it right now feel so immersive graphics feels great run smooth if you like taking your anger out on a few enemies with your fellow friends in this game is definitely for you so excited see what devs do keep it going definitely in my top three vr quest apps well hopefully I dont break any furniture in the room swinging my sword :)\n\nHelpful | 174", "Awesome-giyNov 8 at 5:01 AM\nGame fun\n\nYes buy Best Buy yes\n\nHelpful | 1", "MarkBurns86Sep 30, 2019 at 3:47 PM\nWaist of money\n\nI didnt play this game past the intro and will never play it again. Graphics and story were bad from the start. Id play my N64 over this any day. The previews made it look more interesting then it really is. Dont waist your money.\n\nHelpful | 3", "painxkonanAug 12, 2019 at 3:20 AM\nGreat but needs work\n\nI love the intro. theres needs to be somewhat of a story. The fighting is nice, although i feel the characters move too quickly and choppy. The sword is fun to use but if you move it too much, it freezes alot. The major issue i have in this game is the blocking. It seems like half of the time i block, i either get hit or i block and still get damage somehow. I really hope the developers look into this.\n\nHelpful | 1", "bob-digiSep 20, 2019 at 8:13 PM\nFinally free movement\n\nThis game is seriously fun! Its not a point and move game. Free moving and 360 degree fun. Make sure you have the energy to keep swinging those weapons!\n\nHelpful | 0", "BetruetJun 7, 2019 at 7:01 PM\nReally Enjoyable\n\nlike many have said content is lacking. If this was an MMO I'd be convincing my friends to buy a Quest. So much I like about this game but really needs some kind of depth and goals.\nI really like that swinging properly gives more damage than that little wrist wiggle people usually do in VR sword games. Mechanics are great.\nTook a bit of practice to get the muscle memory down. Like beat saber \"look like an idiot but feel like a hero\"\n\nHelpful | 10", "yanoty3DJun 6, 2019 at 5:10 PM\nA sports game with swords\n\nThis game is all about sword fighting and makes the best of the physicality of VR. It works exceptionally well with Quest, because you don't have to worry about cables when you are brandishing your swords against multiple enemies. Be aware that this is not an RPG. This is a sports game, and as a sports game, this is super fun to play.\n\nHelpful | 26", "madturtle84Jul 31, 2019 at 4:15 AM\nBetter than Light Saber Dojo\n\nI was afraid this would become a \"parry game\", but it actually strikes a good balance between offense and defense. You swing harder to do more damage so \"Hand Wiggling\" won't works here. Enemies telegraph their attacks very clearly, so you know when to step back into defense. Developing a tactic for attack and parry bring depth into the experience.\n\nAfter successful parrying enemy exposes \"weak point\", but the window for riposte is pretty short, so determine between rapid riposte or aiming for weak point create another healthy skill ceiling. However the parry hitbox is confusing sometimes, especially for lower attacks. It's hard to tell why my parry fail. Maybe it's a bug, or maybe it's just a tricky action to perform in real world as well.\n\nOne unique mechanic in this game is to use your full body to dodge. It has a cooldown so you can't spam it by jumping back and forth. This is just enough to make me engage with full body movement but not too exhaustive like some boxing game.\n\nThe game loop is very simple. You enter a level and enemies spawn in pre-determined patterns, and you kill them all and go to the next level. There are currently 100 levels. This is simple yet very effective, as new weapons unlock with later level, and the \"Star\" system increase replayability.\n\nThe weapon breaking system, however, is a questionable design choice. It's a way to force player to try out different weapons, but other than that I don't find it add anything to the experience. Having a broken weapon without substitute nearby is not fun at all. You have to run around the map to find other weapon or wait for your default one to restore. This is not a difficult task but just impair the pacing.\n\nHelpful | 5\nDeveloper ResponseJul 31, 2019 at 5:06 PM\n\nThanks so much for the glowing review! You also gave us some great feedback for consideration, and we really appreciate that. Looking forward to having you try out future content! <3", "Nix0327Jul 31, 2019 at 3:37 AM\nUltra repetitive boring\n\nThis game looks so good in the trailer, but in reality this game is very basic. The lack of content really hurts this game. After playing a few rounds in multiplayer ibget bored and play a different game. Single player sucks. No bosses, just a wash rinse repeat as you progress through the levels. Game needs a massive update for content and multiplayer to bring me back playing, as i haven't played this in over a month and do not intented to any time soon!\n\nHelpful | 14\nDeveloper ResponseJul 31, 2019 at 5:05 PM\n\nHi Nix, Sorry to hear your experince with th game was not great. We do have a roadmap for future content which I'd love for you to check out. Hopefully we can deliver something which will encourage you to come back and try the game at a later time! https://www.reddit.com/r/OculusQuest/comments/cc5bjh/swords_of_gargantua_future_content_road_map/", "casey.graves.1018Jun 19, 2019 at 12:18 PM\nPLEEEASE FIX THE DASH SYSTEM\n\nEvery other aspect of this game is amazing! I am absolutely sick and tired of feeling like I'm giving a blowjob anythime I have to forward though! On top of that it only seems to actually work about half the time. Please there are two joysticks. For christ sake just make one of them for dashing and one for movement. Hell even just the normal movement stick with the dash trigger at the same time. Literally ANYTHING asides from what it is now\n\nHelpful | 25\nDeveloper ResponseJun 21, 2019 at 12:42 AM\n\nHi Casey, thanks for your feedback on the dash system. I've shared it with the team (in a less graphic way) so that they are aware.", "GrimNinja88811Jul 1, 2019 at 2:39 PM\nGreat Title! Yet buggy on Quest\n\nI love this game on Quest! Multiplayer is great fun as well.\nI'm just having a hard time with alot of solo mission bugs that happen frequently. Alot has to do with main weapon randomly disappearing and input lockups to where I can't use anything nor the menu to leave I have to close app entirely. Lastly game crashes randomly while in mid battle, (solo mostly) but not too often. I hope they keep patching these main issues and I'll give it a 5 star it's a great battle simulator with alot of potential for future titles to inspire from.\n\nHelpful | 3", "darwins.lastJun 6, 2019 at 2:44 PM\nCan be a Workout!\n\nI like the group/co-op mode a lot. Lots if fun battling it out with others. Single mode... well, I kind of jumped out and into multiplayer. The battle mechanics are very good and graphics of the enemies and players are very good. Can definitely leave you tired after three or more rounds with friends.\n\nHelpful | 15", "Rocky2234Jul 20, 2019 at 6:01 AM\nUltra realistic\n\nSeriously realistic sword fighting game Ive spent the last few days playing this game only and Ive got to say Im really enjoying it! sure its quite rough around the edges in places and doesnt offer to much in the way of verity at the moment but the sword fighting is the best ever in any game its just so realistic and how Id imagine it to be in real life battle and you can actually improve the more you play the game its like real life so for me its a 5 star game the multiplayer is very fun also! I really hope this game continues to grow in the future with updates adding more arenas and weapons etc.\n\nHelpful | 3", "NikaDuelistJun 21, 2019 at 5:06 PM\nTerrific game but need some improvements\n\nIm updating this because i have played a lot more, and well it get so stale. Let tell you what to expect. Waves of enemies your size with simple attacks, and special moves that seem to be there just for the trailer. The enemies look the same but to keep it fresh they have more hp, new fighting styles, and of course this guys gold, but i hear you say what about the gaint bosses, and multiplayer, well im almost at level 70 out of 100 and i have yet to see a boss. I would love a Unique!!! Boss every twenty levels with fighting patterns you have to learn, and weak spots you have to hit. I have tried multiplayer cus I thought i would find a boss, but after an hour of the same map, enemies, waves, fighting style, and lack there of bosses i got so bored i quit. Last but most importantly the fighting. At first its sooo fun, but you get into the rhythm and pretty much just go with sword and shield, because everything else is worth, because blocking with weapons is stupid. Then you see a bigger guy(not a boos) and its hard the first time until you realize you can just swing you sword VERY fast(not caring about hitting the weak spot), and it just dies. No special way to defeat it no, and just repeat that for 70+ levels.\n\n\nThis game is super fun but as it is right now I would hold off until a good amount of updates or if the price goes down to 10$.\n\nHelpful | 5", "TopoSolitarioJun 7, 2019 at 10:22 AM\nSolid 4* waiting for content\n\nGame is a solid four star. On Quest you can run into fight and phisically dodge the blows. Solo play feels like a tutorial and levels are a bit repetitive, solo has a lot of room for improvement, some sword oriented questing dungeon crawler could work well enough.\nMultiplayer is good but relies on a good player base, again some variety could be nice, target oriented missions are a must have.\nAbout the sword play it is solid and well implemted, the best of the game no doubt. Throwing objects is not so... It relies on the orientation of the hand at the moment you release instead of the vector of your hand movement, it acts weird and unrealistic... But this game is all about swords... Not knives.\nIt gets 4 stars becouse there are plenty of things to improve.\n\nHelpful | 9", "finniegJun 6, 2019 at 7:53 PM\n\nFrom a graphical standpoint this game exceeded my expectations for oculus quest. The basic game mechanics work well and seems to have plenty of depth.Hopefully the devs continue push out new content for this game. If so The future looks bright!\n\nHelpful | 10", "NeildaLikeZeldaJun 9, 2019 at 8:51 PM\nI got carried away\n\nI channeled my inner warrior woman to play this game. It was so fun that I lost track of time. I didnt realize how much I was working out until I took off my headset and noticed all the sweat on my face. Fortunately no one was around me, otherwise I couldve hurt them as I battled the enemies in the game. I truly recommend it.\n\nHelpful | 5", "VARK-kunJun 6, 2019 at 10:04 PM\nThe SAO experience I've been waiting for\n\nI was waiting for this game since I tried the beta test!\n\nThere has been many games that had sword fighting in it, but no game got it quite right.\nThis one, however, truly knocks it out of the park.\n\nParrying and cutting down foes is deeply satisfying.\nIf you have ever aspired to be in the world of SAO, give this game a try!\n\nHelpful | 18", "the.kanerSep 7, 2019 at 3:56 PM\nReally bad\n\nAvoid at all cost. If you want a good sword melee game, move along.\n\nHelpful | 5", "MockingbirdWizardJun 18, 2019 at 8:55 PM\nNot a game\n\nThis is a very good demo of sword fighting mechanics, but I'd struggle calling it a game. All the levels are basically hacking at very similar monsters, in the same bland room. No exploration, no real advancement, level 1 is pretty much the same as all the rest. Neat demo, but not a game, in my assessment.\n\nHelpful | 9", "SoapySonJun 9, 2019 at 12:46 PM\nAs advertised\n\nDoes everything advertised well, great fun co-op sword fighter with many enemies, a need to block, hit, dodge. Def need to play solo first to learn how to avoid big hits, and to unlock better weapons to use in the co-ops.\n\n5 stars would be given if they added more levels, even some different colours with the same level design would give the illusion of new levels\n\nHelpful | 4", "MARINaRaSUacEAug 6, 2019 at 4:05 PM\nGreat game but...\n\nThis game has almost anything I could ask for but could be better one of the things that would make this game better is better graphics and rendering\n\nHelpful | 3", "VisnoskyJun 16, 2019 at 9:15 AM\nOculus Quest started out kind of dry\n\nThank you for an amazing experience. Free fighting with hand weapons feels amazing. Also dumb in some ways lol. Still cool. Add more please. Like bows? Better practice arena? Power ups. Great game. Will play for many hours and die. Like Skyrim with Guns\n\nHelpful | 3", "tomfr38Jun 26, 2019 at 12:53 AM\nGets more intense and fun with time\n\nSo my 1st impression was that this is fun for a few minutes but that's it. Then I started to unlock weapons and battle against red/gold armored enemies, who have more attack pattern and skills. That's when this game became the best vr experience on the Quest to me! (I've tried all action games). Developers are responsive on Discord and they're already fixing some of the small issues so this one is a keeper.\n\nHelpful | 3", "GangsterwumboJun 7, 2019 at 7:52 AM\nDeceitfully awesome!!!\n\nDO NOT jump right into multiplayer right away!!! Spend time learning skills and controls in single player and itll make the game more challenging as you attempt to defeat your enemies with help of course...\n\nHelpful | 7", "PlatMan17Jun 7, 2019 at 4:03 PM\nClunky and Bare-bones\n\nThe environment and enemy design will drive you insane in less than an hour. Multiplayer is fun for three matches until you realize there is only one mode you will ever play, and I barely saw any difference in enemy types.\nHolding a shield is the most uncomfortable feeling.\n90% of the time I hit the enemy in the green point it never gives good damage, but when I hit a tiny part of the enemies leg it does 55 damage I hate random crits.\nFinally, not being able to smoothly turn my head with the analog stick, and not have the option to change that is nauseating.\n\nHelpful | 18\nDeveloper ResponseJun 8, 2019 at 2:21 AM\n\nWe will continue to update. You mention about smoothly turn, we will release next update with changing it. Enemy looks like the same, but each color enemy has different attack style. Please keep interesting for our game. Thanks!", "LeoSaysNOJun 22, 2019 at 3:02 AM\nBest sword fighting on the rift\n\nThe game feels a bit bare bones in terms of arena and levels especially after an epic cut scene in the beginning. But there is nothing like true melee combat on the oculus quest. Dashing feels awesome and everything is done with movement. Also the lack of cords makes this a truly freeing experience\n\nHelpful | 1", "matteo311Jun 27, 2019 at 7:39 AM\nExcellent VR Melee Combat\n\nThe game gets a bit too repetitive but it has excellent combat. You can check out my full review and PC VR comparison here https://www.youtube.com/watch?v=kWOmYr4A-aA\n\nHelpful | 0", "Fruitloop800Jun 8, 2019 at 10:36 AM\n\nThe combat is great fun, and different weapon types actually feel different. There just needs to be more variety in stages! Also a PvP mode would be amazing. but for the $20 pricetag, I'd say it's definitely worth it.\n\nHelpful | 4", "MelloStonerJul 12, 2019 at 7:29 AM\nDoesn't work! Oculus Quest.\n\nI can't get passed the title screen, it keeps saying there's a communication error and that I need to check my connection, however every other online game I have or youtube or anything still works perfectly fine, this application in particular WILL NOT CONNECT. I feel like I just threw $20 into the wind and I want a refund\n\nHelpful | 2\nDeveloper ResponseJul 15, 2019 at 7:30 PM\n\nHi there. Sorry to hear you're having connection issues. We have a FAQ on our official website which provide some recommendation in order to help with connection errors. If you're still having issues we also have a contact form on that same page! https://www.gargantuavr.com/faq-jp", "MagranonAug 12, 2019 at 7:59 AM\n\nReminds me of the fight caves\n\nHelpful | 1", "Scramble1981Jun 17, 2019 at 10:34 AM\nVery good game\n\nThis game seems to really divide players. I really like it as I had read a few reviews and saw it as a sword fighting game, where you just took on increasingly difficult players. There would be limited venues and no real story mode.\nThis suits me as the challenge is in the sword play and it is very good. Fighting increasingly difficult opponents.\nSo a possible cult classic in the making.\n\nHelpful | 1", "lennieplopJun 8, 2019 at 11:41 AM\nVery enjoyable combat-focused game\n\nSo far, gargantua has one of the best combat systems in a vr-game I've played. It feels very real, visceral and responsive. The multiplayer mode is great fun, although most people prefer to stay silent. As of now, the game can be slightly repetitive, as far as enemy variety and environments go, but with the promise of future updates, this is a great game to buy!\n\nHelpful | 5", "Boogieman011Jun 11, 2019 at 12:47 PM\nDefinitely a wireless must have\n\nI've just gotten started in the Quest and it's a lot of fun. Mechanics in view are flawless and pretty good when not. Progression of difficulty and movent complexity ramp up nicely at least for the single player.\n\nHelpful | 3", "xXDestrucsionXxJun 12, 2019 at 12:36 AM\nFor the Inner Sword fighter\n\nThis game is amazing , let me start with saying that, earning weapons seems easy at first but as levels progress they get harder, the multiplayer community is awesome lots of team work and awesome challenges to overcome as a team,The mechanics are sweet sometimes the get buggy is you try to be all fantasy swordsman style otherwise your golden , the animations and tracking are on point, no lag issues to date for me or crashes , , the throwing knives are a good addition to your weapon set when you need to recharge weapons and the enemies seem smart when you seem to be on a rampage. I must add to your collection of games trust me.\n\nHelpful | 3", "PurplemikeyJun 7, 2019 at 7:02 AM\nSo immersive my wall felt it\n\nVisuals : 5*\nGameplay mechanics : 5*\nSounds : 5*\nContent : 3*\n\nWill write a detailed review tonight after I played 3-4 more hours to unlock content and test replayability.\n\nHelpful | 20", "JJZabaJun 12, 2019 at 12:03 PM\nOK but gets boring\n\nIt's fun at the start, sword play works well with ability to block and slash and it can get quite frantic when you have multiple enemies coming at you. Trouble is it gets very repetitive with the same arena and same enemies and gameplay. You also need plenty of room unless you want to smash your hand into various bits of furniture. It's okay, would recommend a buy if on sale but not worth full price in my view. Only tried single player so co-op may be better.\n\nHelpful | 4", "FluffyFuryJun 16, 2019 at 10:32 PM\nA sword combat simulator\n\nThats basically what this is, story is non existing, but the gameplay is great, i really enjoy the single player, however the multiplayer is rather barebone... a guard mission with 4 others, you cant be only 2 , it will add bots to ur party...u do get a pretty nice amount of weapons to play with... all in all if you are looking for a sword combat simulation this game is for u\n\nHelpful | 2", "yotuba_Jun 11, 2019 at 6:31 PM\n\nThe reality of the sword is great. The battle with the enemy and the sword is purely fun.\nI want more weapons.\nI want more game rules.\nI look forward to future developments.\n\nHelpful | 4", "LoukasGrJun 8, 2019 at 12:27 PM\nGood game but a little to do\n\nVery good game and nice graphics really smouth and much realistic but in the multiplayer is just one stage to play for kinda 4 min at maximum and at the single after a few missions it getting bored. I think it would be better with 10. Anyway for those that like a relay sword fight totally recommended\n\nHelpful | 3", "Ascended_MasterJun 9, 2019 at 7:38 PM\nNeed a smooth turning option\n\nThis game is pretty fun alone, and better with a few comrades, loved that you could get rid of the blinders, but I would really like a smooth turning option as well!\n\nHelpful | 3", "Firesnake45Jun 7, 2019 at 10:05 AM\nHow Accurate How Awesome Finally!!\n\nI have just retired two past systems. This is what I have been waiting for as a swords game/trainer/creative release..with its selective targeting on the feudal era zombies...retired, ok mayb resting. Looking for 10K first;)\nAnyway an awesome game Thank you and much respect to the creators!! Btw, it was good to get a couple weeks down in vr first for the newvrist. Still buy either way no regrets and I would buy the system for this game.\n\nHelpful | 1", "ItalianStallyonJun 12, 2019 at 6:41 PM\nMultiple design flaws\n\nBasically this game should not have been released with this many bugs. And definitely not at this price point. Tracking overall on quest has been outstanding except on this game. You constantly lose orientation, your armor is buggy as hell, and it just feels extremely clunky while in combat. Get the new wizard game instead, it's much better. Refund please......\n\nHelpful | 6", "TchaymutukikaariJun 18, 2019 at 10:14 PM\nMultiplayer Opinion\n\nI was looking forward to that game, after seeing it in the \"Coming soon\" section. My brother and I bought it after release and started the game.\n\nWe realy liked the tutorial and the overall experience. The weapons you hold can colide and prevent your swings, if you place them wrong.\n\nBut I bought the game, because I thought that it was a co-op based game. It only has 4 levels, which increases in difficulty, for multiplayer. Unlocking weapons and having 100 different levels, are only available in the singleplayer.\n\nSo thats a big bummer for me.\n\nHelpful | 3", "gzmaskJun 12, 2019 at 8:24 AM\nAlmost there, Just need more contents\n\nThis is the kind of game which will be greatly benifit fr procedure generative levels. Will come back to give 5 once more contents!\n\nHelpful | 1", "canalaizJun 19, 2019 at 1:19 AM\nChallenging but rewarding experience!\n\nThe extremely polished sword mechanics makes this a unique game.\nChallenging and rewarding, with aesthetically pleasing visuals this is really a little gem you should not pass on.\n\nHelpful | 0", "patuxent78Jun 22, 2019 at 12:50 PM\nGood Start But Not Worth It\n\nConsidering how much you spend on the game, youd expect more than what you get. It gets old very quickly. Theres no story, theres not a refined fighting mechanics.\n\nHelpful | 1", "zaeraiphel78Jun 9, 2019 at 1:06 PM\nAmazing gameplay\n\nI havent dedicated a whole lot of time on this game but so far I am very impressed. The game play is smooth. The walls of my house arent liking it very much. You need a good open space to play this game.\n\nHelpful | 1", "IGotNoLIfeJun 11, 2019 at 4:30 AM\n\ngame is fun but all i know how to do is the horde mode where do tou fight gargantua\n\nHelpful | 1\nDeveloper ResponseJun 11, 2019 at 6:16 PM\n\nHi there, thanks for the review! To fight the Gargantua you need t progress through the multiplayer mode. You can unlock Gargantua difficulty by clearing the Hard mode in multiplayer a number of times!", "DAX_QcJun 6, 2019 at 2:59 PM\nMeh.\n\nIts save itself with the multiplayer. Very repetitive. No campaign.\n\nHelpful | 16", "GearknightJun 28, 2019 at 11:20 AM\nNot opening\n\nWhen I updated the game something went wrong. And now it won't open and got stuck on a loading screen. Please fix this\n\nHelpful | 2\nDeveloper ResponseJun 30, 2019 at 5:29 PM\n\nSorry to hear you're having issues since the update. Could you send us an email to cs@yomune.co and we can see if we can find a resolution?", "careless425Jun 9, 2019 at 12:06 PM\nGood but needs a lot of work\n\nThe gameplay is okay at its solid but can we be buggy and the graphics are pretty trash and everything looks fuzzy not worth $20 Id pay $15 at the most for this game\n\nHelpful | 3", "zootbooJun 20, 2019 at 11:34 PM\nWont work for quest\n\nBought it...downloaded it...Had to restart system since it tried to mess up the tracking system...loaded past startup icon...wont connect to network...requesting refund\n\nHelpful | 2\nDeveloper ResponseJun 21, 2019 at 12:37 AM\n\nHi Zoobot, very sorry to hear that you are having issues. Could you reach out to us at cs@yomune.co and we can find a resolution. Thanks - Yomuneco Team", "rollkofferJun 30, 2019 at 4:44 PM\nNeeds better matchmaking and gamemodes\n\nSword fighting is fun, but needs more content or online modes or progress to keep engaged\n\nHelpful | 0", "TohbiasJun 6, 2019 at 12:14 PM\nBricked my device\n\nSo i played the beta seemed cool so i bought it on my quest the game wont get past loading screen and since installing my quest can no longer use the internet so use its guardian system basicly this game cost me 420 bucks and i never got to play\n\nHelpful | 38\nDeveloper ResponseJun 8, 2019 at 2:16 AM\n\nI am developer of Swords of Gargantua. Could you try restart Quest and set guardian again? I guess your situation can be solved. We can help to move game correctly. If you cannot fix, please send mail to info@yomune.", "Echo_TangoJun 18, 2019 at 8:01 AM\nSo much of nothing\n\nIt have a great potential, but has no in depth that keeps you interested. Cost to mutch to be like a incomplete game. Dont waste your money on it...\n\nHelpful | 3", "Hush_MoneyJun 8, 2019 at 5:55 PM\nCommunications Error\n\nHaving a bit of trouble even starting the game on my Quest. Keeps telling me Communication Error, and Ive uninstalled the game, restarted my Quest and router. Any help would be appreciated.\n\nHelpful | 2\nDeveloper ResponseJun 9, 2019 at 7:21 PM\n\nSorry to hear that you are having issues connecting. Could you send us an email at info@yomune.co? We can see if we can resolve the communication error.", "SomeluJun 10, 2019 at 12:29 AM\nGreat experience of battle with a sword\n\nI cleared stage 18. The feeling of the swords is so great. The visuals are beautiful. It's also good for fitness.\n\nHelpful | 1", "billy.bang.9Jun 17, 2019 at 7:46 PM\nFantastic!\n\nI had a fantastic experience. The VR world is finally starting to open!\n\nHelpful | 0", "vrbear1977Jun 12, 2019 at 11:05 AM\n\nThank you for this great titel\n\nHelpful | 0", "aWaRLoCKJun 13, 2019 at 5:52 PM\n\nOK, I have this on both the Rift S and Quest. So, I try to play the Quest version first and the game just loads and loads and never progresses to actually play the game. I just get the (3) loading balls and that is it. I mean I have stood there for several minutes, maybe 5 mins. and nothing ever progresses. I have not tried to play the Rift S version yet but so far the Quest version sucks. Any suggestions, please let me know. Thxs.\n\nHelpful | 5\nDeveloper ResponseJun 13, 2019 at 8:56 PM\n\nWe have confirmed with some people that this is happening and are investigating.There are reports that it worked after reinstalling, so please try it. If it still doesn't work, please contact cs@yomune.co for more information.", "oscar8012Jun 8, 2019 at 8:59 AM\nIntense and super fun if you like Melee\n\nIts fun in single player mode. And its MORE fun if you play in multiplayer mode. I think Ive lost at least 4LB by playing this game with my friends!   \n\nHelpful | 5"]