{"App Title": "Synth Riders", "App description": "Synth Riders is your freestyle dancing VR rhythm alternative. Lose yourself in the incredible music, enjoy the unique rail system, meet friends in the multiplayer, and become a part of the VR rhythm revolution!\n\n\n Dance to 45 Songs and Enjoy Official Custom Song Support\n\n Experience \"Spin Mode\" with 90, 180, and 360 Spins in Every Song\n\n Meet up to 10 Players in Cross-Platform Multiplayer\n\n Burn Those Calories with In-game YUR.watch Fitness Tracker\n\n Play with Friends and Family in \"Party Mode\" Local Leaderboards\n\n Explore \"Cyberpunk Essentials\" EDM Pack feat. Tokyo Machine, Pegboard Nerds, RIOT, MUZZ, Au5\n\n And \"Electroswing Essentials\" feat. Parov Stelar and Jamie Berry", "Purchase section": "$24.99Add to WishlistShareOffers In-App PurchasesComfortableSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User, Multiplayer", "Supported Player Modes": "Roomscale, Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Casual, Music, Sports", "Languages": "English", "Version + Release Notes": "2.3.0.8.rc3", "Developer": "Kluge Interactive", "Publisher": "Kluge Interactive", "Website": "https://www.synthridersvr.com/", "Release Date": "October 31, 2019", "Developer Privacy Policy": "None", "Developer Terms of Service": "Your connection is not private\n\nAttackers might be trying to steal your information from www.synthridersvr.com (for example, passwords, messages, or credit cards). Learn more\n\nNET::ERR_CERT_COMMON_NAME_INVALID\nBack to safety\nAdvanced", "Space Required": "979.4 MB"}



["5 stars\n76%\n4 stars\n13%\n3 stars\n6%\n2 stars\n2%\n1 star\n3%", "Skelly50Jul 10 at 6:09 AM\nTime to Boogie\n\nSince purchasing the Quest I have purchased & played the majority of games. I particularly favor music & dance games & Synth Riders is at the top of my list as one of the more energetic & beat worthy games, especially the ElectroSwing collection. Utilizing rhythms that maintain BPM in the range of 122 to 130 BPM is perfect for a good aerobic workout that is fun & dancing to the rhythms even makes it better. Although I really dig Beat Saber it's aerobic workout is limited to the upper body. Synth Riders gets your entire body involved. For me the only other game that involves that much movement is Audio Trip, except it doesn't have the number and range of rhythms like Synth Riders. Synth Riders' Boogie on.\n\nHelpful | 61", "johickmnJul 19 at 6:08 AM\nWow. Just great.\n\nI *love* the new 360+ update. Its almost like a whole new game. Put an enormous smile on my face.\n\nIt took me a little while before I really got into this game, but its just great. Probably my favorite overall. The trick to having a ton of fun with this is to get yourself dancing, and make the arm movements secondary to your central groove, as it were (though parts of these maps will all but force you to dance). Im the rare quest owner who doesnt have beat saber, but in contrast to Oh Shape (also fun but not *as* fun) and boxvr (workout), synth riders has a lot of music I actually dont hate, at least in the synth wave and electro swing collections. It also supports custom mods with no side loading, and there are a few very good ones, though the majority dont manage the quality that the official ones do. . yet. And I think the devs maps have only gotten betterthe free electro swing maps are really wonderfully done with a great rhythm to them that hits the sweet spot of fun+satisfaction. I was never a dance dance revolution player, but it seems like synth riders is a bit like DDR, just focused on your arms instead of your legs.\n\nIf you dont love it from the get-go, find a song you like, and try playing it a few times, focusing less on targeting everything thats flying towards you, and making your goal shaking your booty to the rhythm. Theres a no fail mode if you need it, too.\n\nThe graphic design in this game is very well doneprobably my favorite quest environment.\n\nSo what would be on my wish list? More synth wave songs and maps, please! And  if it works aesthetically maybe a new environment with a more daytime vibe? And personally Ill love some old school discohow great would it be to feel like Larry Levan or Francois K is spinning? Ill tell you how great: Very great.\n\nHelpful | 19", "Darfka6 days ago\nBest VR music game I played yet\n\nI played some other games like boxvr and Beat Saber (which I played a lot) but since I started playing this game, I don't feel the need to go back to Beat Saber at all. The movements are more natural and you feel like you are dancing compared to Beat Saber where you only feel like you are playing fruit Ninja with good music. The song that already come with the games are quite good (if you like electro music) and it's so easy to add custom songs. The only thing still missing is the speed control (being able to play the song up to two times or half the speed like in Beat Saber).\n\nHelpful | 4", "farbeyJul 23 at 1:59 PM\nWay better than Beatsaber\n\nI don't know where to begin, there are so many positives about this game. The stock tracks are leaps and bounds better then the lazy junk Beatsaber slapped together. Yeah there are custom songs but it is difficult on the quest with all the modding required. Spin mode pretty much reinvented this already amazing game. Only thing I would like to see in the future is when you get the highest multiplier and you get that really satisfying multiplier sound it would be great if it were coupled with some kind of visual effect like flames in the corners( yeah I know could be distracting, but leave it as an optional setting). Other than that perfect game. Thanks Devs you guys are amazing keep pumping out those music packs so I can give you more money!!!\n\nHelpful | 11", "nr654216 days ago\nTHIS is what I expected Beat Saber to be\n\nI usually don't want to stop playing. Just one more song.\n\nGranted, a big part of that is up to one's taste in music.\nDo you love EDM and Pop music? Can't wait for what'll be hot in the charts next week? Don't enjoy anything else? Then any OTHER VR music game is more suitable for you. But literally ANY.\nI have found it very frustrating to have all of those games that seem interesting gameplay-wise but essentially only feature that kind of music.\nWith Synth Riders on the other hand, it's a slightly broader mix. They of course somewhat stick to the Synth theme but have quite some variety within that. There actually are a few sort of EDM tracks but then also Synthwave, Electro/Industrial/Metal blends, Indie Pop (think Chrvches but less well-known) and Electro Swing.\n\nBut their gameplay is also much better in my opinion. For one thing because direction doesn't matter. \"Just\" hit the orbs. Not necessarily simple though, as they can be at more different positions than with Beat Saber, there are those lines to follow too and accuracy still matters for score hunts. Speaking about which - there are separate leaderboards for each option that you switch on, such as 360 mode. How awesome is that?!\n\nAnd speaking about the 360 mode - contrary to Beat Saber's, the one of Synth Rider doesn't make me motion sick because you can always see the whole environment. But they still have awesome ways to guide the player to where they need to turn. Even better with 360+, where you even to look up.\n\nThere are a ton of options in terms of difficulty and modifiers. \"Force\" mode - where you need to punch orbs to get a higher score - is great if you want one hell of a workout!\n\nThere used to be some minor downsides but every time I take a break for a few weeks, they've improved things quite a bit. They're clearly a dedicated bunch, I just hope that they'll publish some more song packs to buy!\n\nHelpful | 3"]