{"App Title": "Tetris® Effect", "App description": "Winner of over 50 awards, including Giant Bomb and Eurogamer 2018 Game of the Year!\n\nTetris Effect is Tetris like you've never seen it, or heard it, or felt it beforea breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines.\n\nMusic, backgrounds, sounds, special effectseverything, down to the Tetriminos themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again.\n\nAll-new Zone mechanic: Players can stop time (and Tetriminos falling) by entering the Zone and either get out of a sticky situation that could otherwise lead to Game Over, or rack up extra Line Clears for bonus scoring rewards.\n\nTetris  &  1985~2020 Tetris Holding.", "Purchase section": "$29.99Add to WishlistShareComfortableSupports QuestSupports GamepadSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Sitting", "Supported Controllers": "Gamepad, Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Puzzle, Relaxation/Meditation", "Languages": "English, Chinese (China), Chinese (Hong Kong), Chinese (Taiwan), French (France), German, Italian, Japanese, Spanish (Spain)", "Version + Release Notes": "1.0", "Developer": "Monstars Inc. and Resonair", "Publisher": "Enhance", "Website": "http://tetriseffect.game/", "Release Date": "May 14, 2020", "Developer Privacy Policy": "TETRIS EFFECT: CONNECTED\nNEWS\nABOUT US\nBUY\nLANGUAGE\nPRIVACY POLICY\n\nWe here at Enhance value your privacy.\n\nEnhance pledges to respect and protect your privacy regarding any information we collect while operating our website and games.\n\nAccordingly, we have developed this privacy policy in order to be transparent in how we collect, use, communicate, disclose and otherwise make use of personal information:\n\nEnhance will only collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nBefore or at the time of collecting personal information, we will identify the purposes for which that information is being collected.\nEnhance will only collect and use personal information in order to fulfill purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make information about our policies and practices relating to the management of personal information readily available to our customers.\nWe will only retain personal information for as long as its necessary for the fulfillment of those purposes.\nWe will collect behavior and gameplay information only for non-nefarious purposes.\n\nEnhance is committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. Please note that Enhance may also change this privacy policy from time to time at Enhances sole discretion.\n\nEND USER LICENSE AGREEMENT\n\nThis End User License Agreement (Agreement) is a binding agreement between you (End User or you) and Enhance (Company). This Agreement governs your use of Tetris Effect (including all related documentation, the Game). The Game is licensed, not sold, to you.\n\nBY USING THE GAME, YOU (A) ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTAND THIS AGREEMENT; (B) REPRESENT THAT YOU ARE OF LEGAL AGE TO ENTER INTO A BINDING AGREEMENT; AND (C) ACCEPT THIS AGREEMENT AND AGREE THAT YOU ARE LEGALLY BOUND BY ITS TERMS. IF YOU DO NOT AGREE TO THESE TERMS, DO NOT USE THE GAME.\n\nLicense Grant. Subject to the terms of this Agreement, Company grants you a limited, non-exclusive, and nontransferable license to:\ndownload, install, and use the Game for your personal, non-commercial use on a device owned or otherwise controlled by you (Device) strictly in accordance with the Games documentation.\nLicense Restrictions. Licensee shall not:\ncopy the Game, except as expressly permitted by this license;\nmodify, translate, adapt, or otherwise create derivative works or improvements, whether or not patentable, of the Game;\nreverse engineer, disassemble, decompile, decode, or otherwise attempt to derive or gain access to the source code of the Game or any part thereof;\nremove, delete, alter, or obscure any trademarks or any copyright, trademark, patent, or other intellectual property or proprietary rights notices from the Game, including any copy thereof;\nrent, lease, lend, sell, sublicense, assign, distribute, publish, transfer, or otherwise make available the Game, or any features or functionality of the Game, to any third party for any reason, including by making the Game available on a network where it is capable of being accessed by more than one device at any time; or\nremove, disable, circumvent, or otherwise create or implement any workaround to any copy protection, rights management, or security features in or protecting the Game.\nReservation of Rights. You acknowledge and agree that the Game is provided under license, and not sold, to you. You do not acquire any ownership interest in the Game under this Agreement, or any other rights thereto other than to use the Game in accordance with the license granted, and subject to all terms, conditions, and restrictions, under this Agreement. Company and its licensors and service providers reserve and shall retain their entire right, title, and interest in and to the Game, including all copyrights, trademarks, and other intellectual property rights therein or relating thereto, except as expressly granted to you in this Agreement.\nCollection and Use of Your Information. You acknowledge that when you download, install, or use the Game, Company may use automatic means (including, for example, cookies and web beacons) to collect information about your Device and about your use of the Game. You also may be required to provide certain information about yourself as a condition to downloading, installing, or using the Game or certain of its features or functionality, and the Game may provide you with opportunities to share information about yourself with others. All information we collect through or in connection with this Game is subject to our Privacy Policy. By downloading, installing, using, and providing information to or through this Game, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy.\nUpdates. Company may from time to time in its sole discretion develop and provide Game updates, which may include upgrades, bug fixes, patches, other error corrections, and/or new features (collectively, including related documentation, Updates). Updates may also modify or delete in their entirety certain features and functionality. You agree that Company has no obligation to provide any Updates or to continue to provide or enable any particular features or functionality. Based on your Device settings, when your Device is connected to the internet either:\nthe Game will automatically download and install all available Updates; or\nyou may receive notice of or be prompted to download and install available Updates.\n\nYou shall promptly download and install all Updates and acknowledge and agree that the Game or portions thereof may not properly operate should you fail to do so. You further agree that all Updates will be deemed part of the Game and be subject to all terms and conditions of this Agreement.\n\nThird-Party Materials. The Game may display, include, or make available third-party content (including data, information, Games, and other products, services, and/or materials) or provide links to third-party websites or services, including through third-party advertising (Third-Party Materials). You acknowledge and agree that Company is not responsible for Third-Party Materials, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality, or any other aspect thereof. Company does not assume and will not have any liability or responsibility to you or any other person or entity for any Third-Party Materials. Third-Party Materials and links thereto are provided solely as a convenience to you, and you access and use them entirely at your own risk and subject to such third parties terms and conditions.\nTerm and Termination.\nThe term of Agreement commences when you use the Game and will continue in effect until terminated by you or Company as set forth in this Section7.\nYou may terminate this Agreement by deleting the Game and all copies thereof from your Device.\nCompany may terminate this Agreement at any time without notice if it ceases to support the Game, which Company may do in its sole discretion. In addition, this Agreement will terminate immediately and automatically without any notice if you violate any of the terms and conditions of this Agreement.\nUpon termination:\nall rights granted to you under this Agreement will also terminate; and\nyou must cease all use of the Game and delete all copies of the Game from your Device and account.\nTermination will not limit any of Companys rights or remedies at law or in equity.\nDisclaimer of Warranties. THE GAME IS PROVIDED TO LICENSEE AS IS AND WITH ALL FAULTS AND DEFECTS WITHOUT WARRANTY OF ANY KIND. TO THE MAXIMUM EXTENT PERMITTED UNDER APPLICABLE LAW, COMPANY, ON ITS OWN BEHALF AND ON BEHALF OF ITS AFFILIATES AND ITS AND THEIR RESPECTIVE LICENSORS AND SERVICE PROVIDERS, EXPRESSLY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH RESPECT TO THE GAME, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND WARRANTIES THAT MAY ARISE OUT OF COURSE OF DEALING, COURSE OF PERFORMANCE, USAGE, OR TRADE PRACTICE. WITHOUT LIMITATION TO THE FOREGOING, COMPANY PROVIDES NO WARRANTY OR UNDERTAKING, AND MAKES NO REPRESENTATION OF ANY KIND THAT THE GAME WILL MEET YOUR REQUIREMENTS, ACHIEVE ANY INTENDED RESULTS, BE COMPATIBLE, OR WORK WITH ANY OTHER SOFTWARE, GAMES, SYSTEMS, OR SERVICES, OPERATE WITHOUT INTERRUPTION, MEET ANY PERFORMANCE OR RELIABILITY STANDARDS OR BE ERROR-FREE, OR THAT ANY ERRORS OR DEFECTS CAN OR WILL BE CORRECTED.\n\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF OR LIMITATIONS ON IMPLIED WARRANTIES OR THE LIMITATIONS ON THE APPLICABLE STATUTORY RIGHTS OF A CONSUMER, SO SOME OR ALL OF THE ABOVE EXCLUSIONS AND LIMITATIONS MAY NOT APPLY TO YOU.\n\nLimitation of Liability. TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL COMPANY OR ITS AFFILIATES, OR ANY OF ITS OR THEIR RESPECTIVE LICENSORS OR SERVICE PROVIDERS, HAVE ANY LIABILITY ARISING FROM OR RELATED TO YOUR USE OF OR INABILITY TO USE THE GAME OR THE CONTENT AND SERVICES FOR:\nPERSONAL INJURY, PROPERTY DAMAGE, LOST PROFITS, COST OF SUBSTITUTE GOODS OR SERVICES, LOSS OF DATA, LOSS OF GOODWILL, BUSINESS INTERRUPTION, COMPUTER FAILURE OR MALFUNCTION, OR ANY OTHER CONSEQUENTIAL, INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, OR PUNITIVE DAMAGES.\nDIRECT DAMAGES IN AMOUNTS THAT IN THE AGGREGATE EXCEED THE AMOUNT ACTUALLY PAID BY YOU FOR THE GAME.\n\nTHE FOREGOING LIMITATIONS WILL APPLY WHETHER SUCH DAMAGES ARISE OUT OF BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE AND REGARDLESS OF WHETHER SUCH DAMAGES WERE FORESEEABLE OR COMPANY WAS ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS DO NOT ALLOW CERTAIN LIMITATIONS OF LIABILITY SO SOME OR ALL OF THE ABOVE LIMITATIONS OF LIABILITY MAY NOT APPLY TO YOU.\n\nExport Regulation. The Game may be subject to export control laws. You shall not, directly or indirectly, export, re-export, or release the Game to, or make the Game accessible from, any jurisdiction or country to which export, re-export, or release is prohibited by law, rule, or regulation. You shall comply with all applicable laws, regulations, and rules, and complete all required undertakings (including obtaining any necessary export license or other governmental approval), prior to exporting, re-exporting, releasing, or otherwise making the Game available outside your jurisdiction or country.\nSeverability. If any provision of this Agreement is illegal or unenforceable under applicable law, the remainder of the provision will be amended to achieve as closely as possible the effect of the original term and all other provisions of this Agreement will continue in full force and effect.\nGoverning Law. This Agreement is governed by and construed in accordance with the internal laws of Japan without giving effect to any choice or conflict of law provision or rule. Any legal suit, action, or proceeding arising out of or related to this Agreement or the Game shall be instituted exclusively in the Tokyo District Court for the first instance. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.\nEntire Agreement. This Agreement and our Privacy Policy constitute the entire agreement between you and Company with respect to the Game and supersede all prior or contemporaneous understandings and agreements, whether written or oral, with respect to the Game.\n\nWaiver. No failure to exercise, and no delay in exercising, on the part of either party, any right or any power hereunder shall operate as a waiver thereof, nor shall any single or partial exercise of any right or power hereunder preclude further exercise of that or any other right hereunder. In the event of a conflict between this Agreement and any applicable purchase or other terms, the terms of this Agreement shall govern.\n\nFOLLOW US\nCONTACT US\nsupport@enhance-experience.com\nenhance-experience.com\nPRESS INQUIRIES\npress@enhance-experience.com\n\nTetris Effect Press Kit\n\nPrivacy Policy and User Agreement\n\nTETRIS EFFECT RATING INFORMATION\n\nUSA/CANADA\n\nEUROPE\n\nJAPAN\n\nTetris  &  1985~2020 Tetris Holding. Tetris logos, Tetris theme song and Tetriminos are trademarks of Tetris Holding. The Tetris trade dress is owned by Tetris Holding. Licensed to The Tetris Company. Tetris Game Design by Alexey Pajitnov. Tetris Logo Design by Roger Dean. Tetris Effect produced and published by Enhance Experience, Inc. Developed by Resonair, Monstars Inc. and Stage Games. All Rights Reserved. Unreal, Unreal Engine and the circle-U logo are trademarks or registered trademarks of Epic Games, Inc. in the United States and elsewhere. All other copyrights and trademarks are the property of their respective owners.", "Developer Terms of Service": "TETRIS EFFECT: CONNECTED\nNEWS\nABOUT US\nBUY\nLANGUAGE\nPRIVACY POLICY\n\nWe here at Enhance value your privacy.\n\nEnhance pledges to respect and protect your privacy regarding any information we collect while operating our website and games.\n\nAccordingly, we have developed this privacy policy in order to be transparent in how we collect, use, communicate, disclose and otherwise make use of personal information:\n\nEnhance will only collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.\nBefore or at the time of collecting personal information, we will identify the purposes for which that information is being collected.\nEnhance will only collect and use personal information in order to fulfill purposes specified by us and for other ancillary purposes, unless we obtain the consent of the individual concerned or as required by law.\nPersonal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.\nWe will protect personal information by using reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.\nWe will make information about our policies and practices relating to the management of personal information readily available to our customers.\nWe will only retain personal information for as long as its necessary for the fulfillment of those purposes.\nWe will collect behavior and gameplay information only for non-nefarious purposes.\n\nEnhance is committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained. Please note that Enhance may also change this privacy policy from time to time at Enhances sole discretion.\n\nEND USER LICENSE AGREEMENT\n\nThis End User License Agreement (Agreement) is a binding agreement between you (End User or you) and Enhance (Company). This Agreement governs your use of Tetris Effect (including all related documentation, the Game). The Game is licensed, not sold, to you.\n\nBY USING THE GAME, YOU (A) ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTAND THIS AGREEMENT; (B) REPRESENT THAT YOU ARE OF LEGAL AGE TO ENTER INTO A BINDING AGREEMENT; AND (C) ACCEPT THIS AGREEMENT AND AGREE THAT YOU ARE LEGALLY BOUND BY ITS TERMS. IF YOU DO NOT AGREE TO THESE TERMS, DO NOT USE THE GAME.\n\nLicense Grant. Subject to the terms of this Agreement, Company grants you a limited, non-exclusive, and nontransferable license to:\ndownload, install, and use the Game for your personal, non-commercial use on a device owned or otherwise controlled by you (Device) strictly in accordance with the Games documentation.\nLicense Restrictions. Licensee shall not:\ncopy the Game, except as expressly permitted by this license;\nmodify, translate, adapt, or otherwise create derivative works or improvements, whether or not patentable, of the Game;\nreverse engineer, disassemble, decompile, decode, or otherwise attempt to derive or gain access to the source code of the Game or any part thereof;\nremove, delete, alter, or obscure any trademarks or any copyright, trademark, patent, or other intellectual property or proprietary rights notices from the Game, including any copy thereof;\nrent, lease, lend, sell, sublicense, assign, distribute, publish, transfer, or otherwise make available the Game, or any features or functionality of the Game, to any third party for any reason, including by making the Game available on a network where it is capable of being accessed by more than one device at any time; or\nremove, disable, circumvent, or otherwise create or implement any workaround to any copy protection, rights management, or security features in or protecting the Game.\nReservation of Rights. You acknowledge and agree that the Game is provided under license, and not sold, to you. You do not acquire any ownership interest in the Game under this Agreement, or any other rights thereto other than to use the Game in accordance with the license granted, and subject to all terms, conditions, and restrictions, under this Agreement. Company and its licensors and service providers reserve and shall retain their entire right, title, and interest in and to the Game, including all copyrights, trademarks, and other intellectual property rights therein or relating thereto, except as expressly granted to you in this Agreement.\nCollection and Use of Your Information. You acknowledge that when you download, install, or use the Game, Company may use automatic means (including, for example, cookies and web beacons) to collect information about your Device and about your use of the Game. You also may be required to provide certain information about yourself as a condition to downloading, installing, or using the Game or certain of its features or functionality, and the Game may provide you with opportunities to share information about yourself with others. All information we collect through or in connection with this Game is subject to our Privacy Policy. By downloading, installing, using, and providing information to or through this Game, you consent to all actions taken by us with respect to your information in compliance with the Privacy Policy.\nUpdates. Company may from time to time in its sole discretion develop and provide Game updates, which may include upgrades, bug fixes, patches, other error corrections, and/or new features (collectively, including related documentation, Updates). Updates may also modify or delete in their entirety certain features and functionality. You agree that Company has no obligation to provide any Updates or to continue to provide or enable any particular features or functionality. Based on your Device settings, when your Device is connected to the internet either:\nthe Game will automatically download and install all available Updates; or\nyou may receive notice of or be prompted to download and install available Updates.\n\nYou shall promptly download and install all Updates and acknowledge and agree that the Game or portions thereof may not properly operate should you fail to do so. You further agree that all Updates will be deemed part of the Game and be subject to all terms and conditions of this Agreement.\n\nThird-Party Materials. The Game may display, include, or make available third-party content (including data, information, Games, and other products, services, and/or materials) or provide links to third-party websites or services, including through third-party advertising (Third-Party Materials). You acknowledge and agree that Company is not responsible for Third-Party Materials, including their accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality, or any other aspect thereof. Company does not assume and will not have any liability or responsibility to you or any other person or entity for any Third-Party Materials. Third-Party Materials and links thereto are provided solely as a convenience to you, and you access and use them entirely at your own risk and subject to such third parties terms and conditions.\nTerm and Termination.\nThe term of Agreement commences when you use the Game and will continue in effect until terminated by you or Company as set forth in this Section7.\nYou may terminate this Agreement by deleting the Game and all copies thereof from your Device.\nCompany may terminate this Agreement at any time without notice if it ceases to support the Game, which Company may do in its sole discretion. In addition, this Agreement will terminate immediately and automatically without any notice if you violate any of the terms and conditions of this Agreement.\nUpon termination:\nall rights granted to you under this Agreement will also terminate; and\nyou must cease all use of the Game and delete all copies of the Game from your Device and account.\nTermination will not limit any of Companys rights or remedies at law or in equity.\nDisclaimer of Warranties. THE GAME IS PROVIDED TO LICENSEE AS IS AND WITH ALL FAULTS AND DEFECTS WITHOUT WARRANTY OF ANY KIND. TO THE MAXIMUM EXTENT PERMITTED UNDER APPLICABLE LAW, COMPANY, ON ITS OWN BEHALF AND ON BEHALF OF ITS AFFILIATES AND ITS AND THEIR RESPECTIVE LICENSORS AND SERVICE PROVIDERS, EXPRESSLY DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH RESPECT TO THE GAME, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT, AND WARRANTIES THAT MAY ARISE OUT OF COURSE OF DEALING, COURSE OF PERFORMANCE, USAGE, OR TRADE PRACTICE. WITHOUT LIMITATION TO THE FOREGOING, COMPANY PROVIDES NO WARRANTY OR UNDERTAKING, AND MAKES NO REPRESENTATION OF ANY KIND THAT THE GAME WILL MEET YOUR REQUIREMENTS, ACHIEVE ANY INTENDED RESULTS, BE COMPATIBLE, OR WORK WITH ANY OTHER SOFTWARE, GAMES, SYSTEMS, OR SERVICES, OPERATE WITHOUT INTERRUPTION, MEET ANY PERFORMANCE OR RELIABILITY STANDARDS OR BE ERROR-FREE, OR THAT ANY ERRORS OR DEFECTS CAN OR WILL BE CORRECTED.\n\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF OR LIMITATIONS ON IMPLIED WARRANTIES OR THE LIMITATIONS ON THE APPLICABLE STATUTORY RIGHTS OF A CONSUMER, SO SOME OR ALL OF THE ABOVE EXCLUSIONS AND LIMITATIONS MAY NOT APPLY TO YOU.\n\nLimitation of Liability. TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL COMPANY OR ITS AFFILIATES, OR ANY OF ITS OR THEIR RESPECTIVE LICENSORS OR SERVICE PROVIDERS, HAVE ANY LIABILITY ARISING FROM OR RELATED TO YOUR USE OF OR INABILITY TO USE THE GAME OR THE CONTENT AND SERVICES FOR:\nPERSONAL INJURY, PROPERTY DAMAGE, LOST PROFITS, COST OF SUBSTITUTE GOODS OR SERVICES, LOSS OF DATA, LOSS OF GOODWILL, BUSINESS INTERRUPTION, COMPUTER FAILURE OR MALFUNCTION, OR ANY OTHER CONSEQUENTIAL, INCIDENTAL, INDIRECT, EXEMPLARY, SPECIAL, OR PUNITIVE DAMAGES.\nDIRECT DAMAGES IN AMOUNTS THAT IN THE AGGREGATE EXCEED THE AMOUNT ACTUALLY PAID BY YOU FOR THE GAME.\n\nTHE FOREGOING LIMITATIONS WILL APPLY WHETHER SUCH DAMAGES ARISE OUT OF BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE AND REGARDLESS OF WHETHER SUCH DAMAGES WERE FORESEEABLE OR COMPANY WAS ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS DO NOT ALLOW CERTAIN LIMITATIONS OF LIABILITY SO SOME OR ALL OF THE ABOVE LIMITATIONS OF LIABILITY MAY NOT APPLY TO YOU.\n\nExport Regulation. The Game may be subject to export control laws. You shall not, directly or indirectly, export, re-export, or release the Game to, or make the Game accessible from, any jurisdiction or country to which export, re-export, or release is prohibited by law, rule, or regulation. You shall comply with all applicable laws, regulations, and rules, and complete all required undertakings (including obtaining any necessary export license or other governmental approval), prior to exporting, re-exporting, releasing, or otherwise making the Game available outside your jurisdiction or country.\nSeverability. If any provision of this Agreement is illegal or unenforceable under applicable law, the remainder of the provision will be amended to achieve as closely as possible the effect of the original term and all other provisions of this Agreement will continue in full force and effect.\nGoverning Law. This Agreement is governed by and construed in accordance with the internal laws of Japan without giving effect to any choice or conflict of law provision or rule. Any legal suit, action, or proceeding arising out of or related to this Agreement or the Game shall be instituted exclusively in the Tokyo District Court for the first instance. You waive any and all objections to the exercise of jurisdiction over you by such courts and to venue in such courts.\nEntire Agreement. This Agreement and our Privacy Policy constitute the entire agreement between you and Company with respect to the Game and supersede all prior or contemporaneous understandings and agreements, whether written or oral, with respect to the Game.\n\nWaiver. No failure to exercise, and no delay in exercising, on the part of either party, any right or any power hereunder shall operate as a waiver thereof, nor shall any single or partial exercise of any right or power hereunder preclude further exercise of that or any other right hereunder. In the event of a conflict between this Agreement and any applicable purchase or other terms, the terms of this Agreement shall govern.\n\nFOLLOW US\nCONTACT US\nsupport@enhance-experience.com\nenhance-experience.com\nPRESS INQUIRIES\npress@enhance-experience.com\n\nTetris Effect Press Kit\n\nPrivacy Policy and User Agreement\n\nTETRIS EFFECT RATING INFORMATION\n\nUSA/CANADA\n\nEUROPE\n\nJAPAN\n\nTetris  &  1985~2020 Tetris Holding. Tetris logos, Tetris theme song and Tetriminos are trademarks of Tetris Holding. The Tetris trade dress is owned by Tetris Holding. Licensed to The Tetris Company. Tetris Game Design by Alexey Pajitnov. Tetris Logo Design by Roger Dean. Tetris Effect produced and published by Enhance Experience, Inc. Developed by Resonair, Monstars Inc. and Stage Games. All Rights Reserved. Unreal, Unreal Engine and the circle-U logo are trademarks or registered trademarks of Epic Games, Inc. in the United States and elsewhere. All other copyrights and trademarks are the property of their respective owners.", "Space Required": "2.95 GB"}



["5 stars\n83%\n4 stars\n9%\n3 stars\n3%\n2 stars\n1%\n1 star\n3%", "IamStorm23 days ago\nLove this game! Get it!\n\nI never ever thought Id buy Tetris for VR. Ive never been a big fan of the game or played it much growing up.\n\nI took a chance after reading some reviews and bought this game, and I am blown away! I love the music, the visuals, and everything about it. Its incredibly fun to play and the music is really good! I dont like every song, but theres like 25 to choose from, and different difficulty settings. Im actually getting pretty good at the game after a week of playing.\n\nIf youre on the fence, like the music (Hydelic on Spotify) and want to have a great game experience... Try this game out! Worth the price.\n\nHelpful | 19", "PilotFawn10 days ago\nSo much more than Tetris\n\nMy hubby has had a vive and a quest for some time & having tried it I suffer awful vertigo & was limited to just one game.\n\nLoved Tetris years ago but when he downloaded Tetris effect I fell in love with it. Its more than just a Tetris game, it is a beautiful experience.\n\nThe light shows and music is awesome to the point I often play the soundtrack outside VR but it also spurred me to buy my very own Quest because finally I have a game for me!\n\nI love journey mode but great to just dip in for the effects mode & take part in the weekly ritual.\n\nThis is way more than Tetris & the perfect way to wind down after a tough day. Seriously give it a try!\n\nHelpful | 7", "pgf7383Jul 12 at 4:40 AM\nTetris..just not as we know it\n\nI was a bit sceptical before buying this as I thought its just Tetris right? But I was wrong.\nThis is Tetris but also something more. Its ethereal, psychedelic, otherworldly and emotional. The music, the sound effects and the imagery enhance each level in ways that make each block placement all the more fun. Once the music really kicks in and you start building up a rhythm, it gets very very good. I love this game. Its the perfect way of using VR to enhance a classic game.\n\nHelpful | 10", "thegoldengooberMay 14 at 2:37 PM\nMore than just Tetris\n\nAs a very seasoned VR player, this is the first VR game that has brought me to tears. The gameplay is just Tetris, yes, but the way the game ties the sound effects of to the music, as well as the dynamic and beautiful environments, makes for a profoundly touching experience you just have to play to understand. 5 out of 5, 10 out of 10, the team behind this deserve an award.\n\nHelpful | 509", "gfxblit15 days ago\nOne of the best VR experiences!\n\nJust finished on normal mode and what an amazing experience! Intellectually challenging, 360 visuals that synergizes with the game, amazing sound effects and music -- all combine to create a truly immersive experience. Very zen-like, with ties to the planet. This should be the token app to share with friends (that don't want to play the-next-FPS-shooter-military-sim).\n\nHelpful | 2", "Elwinbu19 days ago\nBest single player Tetris experience\n\nAs title says. This is the best Tetris game I've played, but do take note there is no multiplayer mode as of now (should be added next year).\n\nVR adds to the immersion and experience, coupled with an excellent soundtrack that synergizes with the gameplay and controllers vibration. But at its core you are still looking at a modern tetris take, although extremely refined.\n\nHighly recommended even if you like Tetris by just a tiny bit.\n\nHelpful | 2", "McFluffyKitten21 days ago\nGreat, Even If You're Bad At Tetris\n\nI bought this game on a whim and looking for something new to play and I was not disappointed in Tetris Effect.\nI find myself fully immersed in the blocky puzzles with the music and sounds reflecting my current gameplay.\nYou're not just playing Tetris here, this is a whole experience and one worth your time, even if you're terrible at tetris like I am.\n\nHelpful | 2", "Dawntree8 days ago\nBeyond Tetris, it's a new experience\n\nLike many I was so curious why everyone loved it and in a boring evening I bought it. OH. MY. GOD. It's like living in another dimension traveling through space and time. The visuals, the music, the sound effects...\nThe gameplay is the classic Tetris (mostly) but the experience you live is just mystic. I always play until I ran out of battery on my Quest.\n\nMany suggest to use a gamepad, but since I don't own a BT one I had to use the Touch controllers and tbh I've found them extremely comfortable (since I can sit with my arms open and not reaching for the gamepad) and precise enough.\n\nHelpful | 1", "Citadel17May 14 at 10:48 PM\nThis is, without a doubt, a masterpiece.\n\nTetris games aren't meant to be considered high art.\n\nTetris games aren't meant to make you lose your sense of place.\n\nTetris games aren't meant to make you feel at one with humanity and the universe.\n\nAnd Tetris games especially aren't meant to make you tear up.\n\nBut here's Tetris Effect, a Tetris game that fits all of these categories.\n\nThis is a work of art, and I encourage anybody to get it. You know how to play it. It's Tetris. But it's Tetris that will make you lost in the gameplay and cause you to feel at peace within the world. Absolute 10/10, please experience this.\n\nHelpful | 86", "AzulRoyalJul 3 at 6:59 AM\nTetris. AMPLIFIED.\n\nTo call this just simple Tetris is a frickin' understatement. Oh it's definitely still Tetris, but with all the intricate worlds literally coming to life around you as you play it's very much a mega glorified version of it. The visuals are amazingly pretty and the music is riveting. Literally every move you make, the turning of your blocks and crashing them down, builds upon the music and sound effects literally becomes the music. You essentially use your moves to get the music going. It's very easy to get swept away in it all. It's therapeutic, hypnotic, just EPIC. Very, VERY pleased with this purchase.\n\nNote: There's lots of light effects in this game, so it may not be suitable for certain folks out there.\n\nHelpful | 6", "SubjectDelta11Jul 17 at 1:00 PM\nAmazing experience\n\n after putting at least 150 hours into the oculus quest experience in many different games I must say this game was absolutely amazing I would recommend it to anyone that has purchased a VR headset in general and has made my VR experience just that much better.\n\nThis game has such a weird way of making you feel like youre really in the experience and the audio and visual effects are absolutely top-notch and all of the different game modes as well as the newly implemented zone feature makes me strive to get extremely high score.\n\nIf you like the Vr if you like Tetris get this game now\n\nEven if you dont like Tetris this game will make you want to play Tetris\n\nHelpful | 3", "aaron.sommers.1253May 14 at 10:39 AM\nTetris Effect\n\nOh wow, was not expecting this today. Smiles all day long, I just LOVE  this app. If you like Tetris, you will love this, its Tetris on high. It also gives a great sense of connection, I just love it \n\nHelpful | 234", "ChillahGorillaJul 20 at 8:22 AM\nSurprising\n\nI'm usually not a big fan of puzzle games, so it took me a while to try this. Tetris would be pretty low on my list of \"things to play in VR\", but there were so many positive reviews that I had to try it. Honestly, I was planning to get it just to see what everybody liked about it and then get a refund.\nI never did get that refund. I'm going to assume everyone is familiar with the gameplay of Tetris, so I'm just going to mention what sets this version apart. The music and visuals are beautiful and I cannot overstate how much they add to the game. How they integrate everything together makes the game feel fresh and immersive and each stage feel unique. This game was designed to be played in VR with good headphones, it really is amazing what they were able to do with a simple concept.\nI was caught completely off guard by how much I like this game, I now think it is completely worth getting and worth the price. If you're a sceptic like I was you might be surprised.\n\nHelpful | 2", "RickK75May 14 at 3:01 PM\nA nice port but don't expect the PC/PSVR\n\nA fairly good port of the PSVR/PC classic...\n\nPros:\nPSVR/PC VR gameplay intact.\nMusic is a real showcase for how good the Quest in-built audio can be.\nSome effort has been made to preserve the visual effects that underpin this title.\n\nCons:\nReduced effects. Inevitably the Quest can't throw as many particles around.\nSome objects on levels which looked sharp and rendered from many tiny dots on the PC instead look like meshes with low res, blurry \"dot textures\" on the Quest.\nI don't think every drop of performance was painstakingly squeezed out of the Quest like it was with Superhot or Space Pirate Trainer.\n\nVerdict:\nFor a title that is very much about it's visual effects and music, the music survives and surprisingly sounds stunning on the Quest but the visual effects are inevitably turned down from 11 to 7 vs PS4/PC.\nThe visual fidelity retained is just enough to warrant the title Tetris Effect on Quest without the need for an \"Unplugged\" subtitle. Any more compromise and it would be TE:Light.\n\nIf you've never played the original on PC/PSVR it's an absolute must as you won't notice any of the above compromise.\n\nAnd, I'd buy it anyway as it's a brave effort at a portable version of the classic!\n\nHelpful | 119", "Winter.Wolf21A day ago\nDidnt expect to enjoy this...\n\nIf youre thinking, should I really spend money on Tetris? I was like you. I was definitely happy with the way the game was done. The Tetris board is about 10 feet in front of you  but the music, sounds and the environment around you is what really made this a fun VR experience. As you play you can play through various environments that have colors, animations and sounds that evolve as you progress. Would give it a 5 if there were more experiences available but a great game to have as most VR games are a play through once type this is something you can always go back to. Worth full price for sure but if its ever on sale you would be losing out on not getting it.\n\nHelpful | 1", "kennyM4h4May 18 at 7:09 AM\nBelieve the hype...\n\nWhen this came out on other VR platforms a year or so ago, I couldnt understand why there was any need to play Tetris in VR, or why it should be so expensive for a 35 year game which you can effectively play for free on your phone. When it came out on Quest and the 5 star reviews kept rolling in I decided to bite the bullet and see what all the fuss was about.\n\nNow I get it! Firstly, it just works in VR - even back when I played on by gameboy years ago, you only really played well when you got into a sort of flow state where you immersed into the game, playing VR enhances your ability to do that as you are entirely encompassed by the experience.\n\nNext the quality and scale of the different levels, you can totally see how much effort and though has gone into the game, and there for how the cost is justified. From amazing backgrounds that develop as you work through the level to beautiful sound tracks that somehow are able to incorporate your tile movements in harmony with the music, it all feels to polished and immersive.\n\nOne piece of advise I would give, Tetris purists may prefer using the A and B buttons to rotate the pieces, but I found it much more intuitive once I swapped out the buttons (which Im pleased to say are completely configurable) so that the left and right triggers turned the pieces anti-clockwise and clockwise respectively. Down to individual preference but it helped me a lot.\n\nAs other reviews have said, it needs to be played to fully appreciate it, also, make sure you stick at it, if like me you will probably be terrible at first till you get back into the mechanics of it all again, dont be afraid to swap out pieces regularly, and happy gaming!\n\nHelpful | 31", "Banja78Jun 17 at 10:14 AM\nTrippy\n\nThis is probably one of the best gaming experience ever.\n\nI will not do a detail review. I just want to mention that if you like to play Tetris and if you like the previous work of developers (especially Rez) then you are very lucky, no hesitation, just go get it. The price seems high to play Tetris but it definitely worth it.\n\nThis is a game that you play with headset after turning your phone off, closing the door and telling your family you do not want to be disturbed for one hour. After the hour you wake up as a new person, washed from the inside.\n\nOf course if you feel Tetris is not your kind of game because all you like in video game is shooting, then please walk away.\n\nHelpful | 7", "UBSERDJul 26 at 1:25 PM\nGreat Tetris game from a great creator.\n\nIf you were to add one thing to Tetris and make it perfect it would be the interactive musicial direction of Tetsuya Mizuguchi. In addition to the musical aspect, the visual effects and sounds of you moving and placing the blocks will vary the score and is very kinetic to what happens around you. If youve ever played Luminez or Child of Eden and love them, you cant go wrong here. Be warned this is not an easy Tetris game, but if you like a good challenge its a definite buy. The challenge keeps me coming back for more to get better scores and to attempt to climb the leader boards.\n\nIts fantastic and now my favorite version of Tetris!\n\nHelpful | 1", "r4ndomalexJul 24 at 12:20 PM\nA masterpiece\n\nDid you ever get that strange feeling, when something really emotional happens in a movie and you get that tingle down your spine and you feel like you might either laugh or cry with joy, like the ending of Toy Story 3? Welcome to Tetris Effect, an experience that cannot be explained only experienced.\n\nBeautiful images, beautiful music and hypnotic gameplay take you through a medative journey that's indescribable. I actually use this as part of my mindfulness routine, playing in the evening before bed and whenever I feel a bit anxious. It's both calming, stimulating and elative.\n\nI played this on the PSVR first, and while yes, the quest version is slightly less particle-y than the PS4 version as others have mentioned, it doesn't take away from the overall experience and feelings, it's exactly the same experience, if you haven't played it before you won't know and you won't be missing out on anything. Buy it.\n\nHelpful | 1", "aaronhowe788 days ago\nIgnore the hyperbole\n\nThis isn't a transcendental spiritual experience, it's Tetris. There are some pretty graphics and some decent musical effects but ultimately it's a 2D board and a regular Tetris game.\n\nIt's fun, it is definitely immersive but it's not worth 23: especially as even in beginner mode the learning curve is stupid - after several sedate levels you'll reach \"Celebration\" which goes from level 1 to 6 to 9 very quickly and then ultimately requires luck to complete. Subsequent levels are just as badly designed, and I expect will be fixed in a later patch.\n\nHelpful | 1", "pineappo9 days ago\nBeautiful, but lack customizations\n\nThis is a new spin on tetris . It's the best single player guideline tetris to date with beautiful music and visual effects. My favourite mode is the purify mode (or cheese/downstack mode), as it's rare to have in official tetris games.\n\nThe game is also compatible with other Bluetooth controllers like a Xbox controller to allow for faster game play. I would've love to see more customization options with piece delays (e.g., DAS, ARR, line clear customization) and more pieces in preview.\n\nI would also love to see multi-player in a sequel from the makers. They did a fantastic job with all the classic single player modes. A must have for all tetris enthusiasts!\n\nHelpful | 1", "Get_To_Da_Choppa_VRJul 7 at 1:20 PM\nThis is more than just a game\n\nThis transcends being a game a becomes something truly amazing. No one can describe accurately how entrancing it is to play this game in a VR headset and have your senses be overcome with excitement and wonder at the amazing audio and visual stimulus whilst playing one of the most timeless games ever created. My most played game on Quest for sure\n\nHelpful | 2", "Gamertag_VRMay 18 at 4:55 AM\nThe welcomed evolution of Tetris\n\nLIVE OCULUS QUEST GAMEPLAY CAN BE FOUND ON MY CHANNEL. JUST SEARCH GAMERTAG VR\n\nI remember playing Tetris back on the gameboy. Loved the music, the progression and the simplicity at the beginning that soon becomes quite the addiction to get further with each play. I personally dont know anyone who is gamer and hasnt had a small love affair with Tetris at some point.\n\nSo here we are in 2020 with Tetris Effect for the oculus quest and let tell you, this version of tetris in Virtual Reality is the ULTIMATE way to experience this game.\n\nBeautiful visuals, fantastic music and every single level is individual in taste and presentation. Its feels like your on a journey which can be inspiring but also make you feel like your in a meditative state.\n\nThe Tetris effect is when you play so much that you see tetris blocks as mental images, and in your dreams. Now I know that may sound far fetched and personally I havent experienced that level but I have reached a mental state of autopilot. Your playing the game which now feels like an extension of yourself. Your there not on the outside but on INside of the game. You can see blocks fitting that you couldnt before and I can only put this as a feeling of meditation.\n\nRegardless of all that magical stuff the game is sublime with very memorable music and me and my wife love playing it on PSVR and but even now more so on the quest due to take anywhere magic of quest\n\nThanks for reading and remember you have the oculus 2 hour refund policy. If your on the fence, please I really recommend this 1 game you should make use of it\n\nHelpful | 25", "thechrisstreet10 days ago\nBeautiful. Elegant. Refined. Yet...\n\nI'd spent numerous days during lockdown debating on whether or not to buy an Oculus Quest. I kept weighing up the pros and cons, wanting to justify its purchase.\n\nThen, Tetris Effect was announced - a game I had already experienced and loved, for the Playstation 4. Suddenly I found myself buying the Quest and downloading the game.\n\nComparisons to the PS4 version are inevitable. The Quest is vastly underpowered compared to home consoles, and I was expecting a massive drop in visual fidelity. After all, I had read numerous reviews beforehand stating that there were fewer special effects, but it was still worth a purchase.\n\nLet me just say right now, I do like Tetris Effect a lot. But I don't love it like I do on PS4. That sense of... immersion... isn't quite there for me, even with headphones. I never felt like I was \"in the zone\" as I was on PS4 and I kept on thinking I'd rather be playing that instead.\n\nAnd yet, I keep coming back for more. It's a beautiful game, fantastically put together, held back by lengthy loading times at the start of the game, and in-between cleared areas.\n\nThe game controls are easy to pick up, but perhaps a little twitchy - inevitably the downside of using an analogue stick. Too many times I accidentally placed a block by pressing down when I meant to move it left or right. But then I started to get used to it, with only the occasional error on my part.\n\nThere are many, many stages. Perhaps, my biggest gripe of all (and this applies to the PS4 version) is that there's no way to have a zen-like experience by practicing ALL the stages in Practice mode... you can only play about half of them, which is a shame. Perhaps this will be addressed in an update.\n\nOverall, do I recommend Tetris Effect? Wholeheartedly... Yes. You'll love it even more if you've never played the PS4 version as you won't have anything to compare it to. It's a very good game. But not a brilliant game.\n\nHelpful | 1", "drp2412208 days ago\nBreathtaking\n\nThis is art disguised as a game. Its Tetris at its core, which is fun and addicting already. Combined with breathtaking audio and visual techniques, this is a must buy\n\nHelpful | 0", "GuentherTheGeek18 days ago\nGreat game but not worth $30\n\nIt's your normal Tetris game but things flying around you. I love it and you go into it knowing what you're going to get. It's a bit over priced a bit. Maybe if it was $20 it would be a go to but for $30 IDK\n\nHelpful | 3", "Robertobob100Jul 18 at 5:42 PM\nWow!\n\nAmazing game totally deserves 5 stars. I just have an idea to make it way better. Its still 2d tetris in vr. I wish there could be a more 3d aspect to the game. Like maybe when you clear rows the blocks could fly or fall out towards you. Or maybe \"the zone\" could cause different random effects like one could be a meteor shoots into it and knocks blocks out towards you, and scrambles the board a bit.\n\nThese are just ideas to make this 5/5 star game 6/5 stars :)\n\nHelpful | 0", "nickbloorukJul 16 at 2:31 AM\nBreathtaking\n\nAll this chat regarding 'Tetris Effect', made me think it must be an amazing game. So I bought it. I'm not a huge Tetris fan, but this is by far the best, most beautiful game I have ever played on the Quest, and perhaps the best game I have ever played.\n\nThe game itself is a small but vital part of the experience. The levels are breath taking and the most emotionally immersive experience, invoking all kind of memories, like being on the Glade & Green Fields at Glastonbury festival. Skiing on a beautiful mountain. Walking in a forest.\n\nThe game interacts with the experience differently depending on the level. Every 10 lines causes the background to build somehow, bringing you deeper into the immersive world.\n\nI haven't even mentioned the music / audio experience which pulls it all together. No game is everybody's cup of tea. Some people will hate it, but this is no average game.\n\nHelpful | 1", "djnoelbJul 20 at 8:47 PM\nStunning\n\nSimply a beautiful game. Takes you on a journey for sure and definitely reached flow state many times. Love the music and the visuals and find myself coming back to this game over and over. Forgot how much I loved playing Tetris and this just takes it to the next level!\n\nHelpful | 0", "DtcvJohnKimbleMay 22 at 7:12 AM\nChase the dragon\n\nA week ago you couldn't have convinced me that I would be hooked on Tetris, much less pay $30 to play it again. 15+ hours in, I can't help but feel this might be the most addictive game I've ever played.\n\nThe combination of ever-scaling difficulty, music and visuals puts you into a hypnotic state. It induces relaxation but demands your constant attention. Time will speed up and you will take off the headset and swear you only played for an hour. The game is equal parts a drug, time machine, stress reliever and serotonin pump and I cannot recommend it enough.\n\nHelpful | 12", "Monkey5223 days ago\nMind blowing\n\nIve always loved tetris but this one brings it to a whole other level. Love the backgrounds. So beautiful.\n\nHelpful | 1", "anderpianoandyJul 21 at 2:08 PM\nAmazing For All Players\n\nI really love this app! I have been playing Tetris since I was four and was so excited to see it on the quest. I bought it immediately and do not regret it in the slightest. It is worth every single penny! My mom loves it as well! She plays it all the time!\n\nHelpful | 0", "kire42May 15 at 6:06 PM\nBest version of Tetris ever\n\nSo this game has absolutely breathtaking music and visuals. The gameplay is basically the same Tetris game that you've probably played a thousand times before, but it just feels so much more immersive in VR. There are a few new gameplay features that add an additional degree of strategy, such as being able to swap pieces and go into time-dilation mode.\n\nIf you enjoy Tetris or highly immersive VR experiences, you can't go wrong with this game.\n\nHelpful | 13", "BagreTechJul 9 at 4:13 AM\nShould become an Oculus Essential\n\nIm a big fan of Tetris, but to this day I havent tried effect. The visuals are not as good as in PC or PSVR (according to others) but they are still good, and thy will keep improving as they optimize the game more to the platform. Ive played for around an hour now, and its a must buy. Its up there in the list with Superhot VR, Beat Saber, and The Climb.\n\nYou wont regret this buy.\n\nHelpful | 1", "Danster197725 days ago\nGreat music and effects\n\nI Just bought this game and i must say that the music and effects are amazing. I love the game again after 30 years. I also have the album on Spotify so i can enjoy the music in the train:-)\n\nHelpful | 0", "IAmOnCloud9May 29 at 2:59 PM\nDon't read further! Just buy it now :)\n\nJust don't read any further & buy. But if you want some explanation: If you have any remote interest in puzzles (also best Tetris ver. IMHO), good challenge, gorgeous visuals (yes, even with some sacrifices), great music (play with headphones!), & insane replay value, this is it. I bought it as soon as I saw that this was on Oculus store - so should you ;)\n\nHelpful | 18", "GJCorban9 days ago\nIt's just Tetris, but in VR\n\n- It's literally just Tetris\n- The music and environments are near hypnotizing\n- Crazy immersive, puts you in a zen-like state\n- It's Tetris\n\nHelpful | 0", "slamberhamMay 19 at 7:55 PM\nBeen DREAMING of TE Quest\n\nThird time buying this game. Great on psvr and rift, but even better cable free. It's a blissed out, get in the zone , immerse yourself game and what a nice quarantine surprise for it to pop into the shop today. (If you are reading this Enhanced I'll buy Rez for the 5th time if you release a Quest version)\n\nHelpful | 10", "oculuslover2000Jul 2 at 5:13 PM\nBest tetris game so far\n\nI have been playing tetris for a long time, and at the thought of being able to play it in VR got me really excited, but made me a bit confused on how it was going to work. I had sone high expectations from all of the trailers I have seen, but all doubt was erased from my mind as soon as I played my first round. The rumble was a bit over the top, and they could have used the hold feature like in tetris 99, but I loved the huge selection of different modes and maps for just a single 20 dollar game. The audio and video capability on the oculus was pushed to its limits, and it shows. The only reason that Im giving 5/5 stars is that I cant do 10/5 stars. Best game ever, hands down.\n\nHelpful | 0", "ChozoCraigMay 14 at 1:21 PM\nTetris Synethesia\n\nTetris Effect is a FANTASTIC version of Tetris and perfect in VR. No multiplayer, but still worthy of 5 stars for an amazing audiovisual experience. Tetsuya Mizuguchi is an incredible developer and his attention to the synesthesia experience shines through here. Now we need Rez on Oculus Quest!\n\nTL; DR: Buy Tetris Effect...you wont regret it!\n\nHelpful | 11", "tony2134616 days ago\n\nbought oculus and high end games kind of dissapoint. now off to play tetris and have fun lol unbelievable\n\nHelpful | 1", "atriaventricaJul 13 at 5:39 PM\nVery good until the end\n\nNot through the end. Just until the end.\n\nI'm salty because this is an incredible experience. I had an amazing time with the visuals and songs on almost every level. I force this game into the hands of people who don't understand the value or experience of VR. It is immersive and beautiful.\n\nAnd then it's ruined by difficulty.\n\nI understand the idea of escalating difficulty. I understand the idea of matching the tempo of the game to the tempo of the song. But having the speed of the game wildly fluctuate with no warning when the song changes is a very very bad thing. Particularly when the speed hits 9 or 10 like it does on the last levels because at that point I'm not enjoying this cool space I get to play a game in, I'm just panicking as all my work slips away. And then I lose. I cannot beat the last part of the last song no matter how I try. Just 30 lines at full speed is not something I can do or enjoy.\n\nAnd that's on the beginner setting.\n\nThere's a reason I'm playing this and not Tetris 99 or something competitive.\n\nIt's still worth it but I'm soured a bit by the fluctuations in difficulty. I'll keep playing. I'll keep showing it to people. I just wish I had more control over my own gaming experience.\n\nHelpful | 2", "DakkardMay 14 at 4:18 PM\nSo relaxing.\n\nI've never thought Tetris could be relaxing until I played Tetris EFFECT.\n\nThe calm upbeat music with the eye candy visuals help you slip deep into the 'zone' as you play the Excellent journey mode or any of the other modes in the game.\n\nThe plan was just to quickly jump in and have a go but that ended up with me playing until the battery low warnings popped up.\n\nHighly recommended!\n\nHelpful | 9", "MinisterofDOOMJul 23 at 6:35 PM\nOne of the best Tetris variants.\n\nOf all the many attempts to modernize Tetris in the last decade or so, this feels by far the most cohesive. It just clicks. Rather than trying to shake up gameplay that was never broken, it adds a new layer of atmosphere to it, syncs up the gameplay, adds evolving visuals, and doubles-down on Tetris as relaxation.\n\nHelpful | 0", "DigitalNinjaLeeJun 29 at 10:34 PM\nGreat, but not PSVR replacement\n\nI have countless hours in the psvr version of Tetris Effect and this is no replacement. HOWEVER, it is not bad either. The same gameplay and basic visual/audio effects are there, just not as grand or jaw dropping? At least in my experience going through this. I bought this bc I wanted Tetris VR on the go and I have no complaints there.\n\nHelpful | 0", "VrGoldenJun 28 at 10:55 AM\nA Must Play VR Experience\n\nI've been a casual tetris player for around 8 years now. I always found tetris interesting and I play it on some of my freetime. I heard of this game back when it was first announced, but it was only on the playstation. After 2 years, it finally reached the oculus quest, one of the two vr headsets I have. I played this game for the first time and it brought a tear to my eye. The music and visuals were so beautiful that I could not shed a tear or two. Even for people that never played tetris before, this game, no, this experience is a must buy and you will never forget what you got out of this experience.\n\nHelpful | 1", "sipie27Jun 28 at 8:07 PM\nTetris better than ever!\n\nThis game is absolutely amazing! I enjoyed tetris 99 and I saw that this was coming to quest and I decided to buy it. I was expecting tetris but in cool vr environments but it is so much more. The second I started playing I was amazed and now it has taken over hours of my life. It is incredibly addictive and deserves your attention. So if you like tetris at all than you should totally buy this game!\n\nHelpful | 1", "peteclarkelondonMay 23 at 9:17 PM\nIve hated Tetris for 35 years!!!\n\nI dont like puzzle games. Normally the thought of Tetris leaves me cold. I hate puzzle games, just not my thing as it always feels like work to me. From the moment it came out until the moment before I played Tetris Effect I despised Tetris.\n\nNow, Im really still not sure if I like Tetris. But I love Tetris Effect. The audio visual experience, the goosebumps, the beauty of the moment. Its breathtaking at times. So simple and yet so beautifully immersive with a decent sent of headphones. And most importantly for a puzzle chump like me, there are enough modes that are designed for chilling / idiots like me that allow me to just enjoy and play the game without fear of failure.\n\nThe sound design is just perfect. Would love to see some DLC although there are a generous amount of stages for sure.\n\nI sat on the fence for this thinking I would almost certainly return, but in the end I realize how much I love Rez and other games that feature synesthesia so figured it was worth a shot. And Im so glad I tried it as, well, its just genius and makes me smile from ear to ear when I play.\n\nNo idea how it compares to PSVR and PC visually but for something like this I really dont think it matters too much for the overall experience as the port seems extremely polished and so far has run flawlessly.\n\nBrilliant. Bravo.\n\nHelpful | 5", "AMsMayhemMay 25 at 10:07 AM\nEveryone Need To Experience\n\nTetsuya Mizuguchi is a genius and master of the art of synaesthesiafrom Rez, to Lumines, Child of Eden, E3, E4, etc.\nJust as those games, this will invoke intense and wildly varying emotions typical emotions than most other pieces of media / art are capable of.\n\nIts impossible to articulate and predict what one will experience and feel.\n\nSimply put:\nIts a rollercoaster. Its a trip. Its Tetris.\n\nHelpful | 7", "LinguaProfJun 25 at 11:37 AM\nPart of my meditation routine\n\nTantalizing. Im not a snowflake full of tears but neither do I like Beat Saber nor Superhot. Im happy Ive finally found a game in which I can sit in my massage chair and lose track of time and space. It is eerily voyeuristic to see all of the Tetris users represented in lights on a globe and then to see who is actually playing the game in your vicinity at the moment represented by ethereal floaty thingies. Im only slightly annoyed that I receive an actual letter grade for each of my efforts but its easily ignorable. My new evening routine is to first play 15 min of this game (Tetris Effects Relax mode) followed by a sleep preparation meditation session in Tripp. Its not a meditation app but with the music, effects and gameplay it forces to focus on this and not think about anything else. In Tetris world there is no pandemic, no looting and no problems. What more do you want? Well, maybe multiplayer....\n\nHelpful | 1", "LokiLit420May 22 at 4:57 AM\nThe most emersive game I've ever played\n\nWhile VR has upgraded Emersion into video games, you might think Asgard a wrath, or echo arena, as games that take you out of this world, but only this game has really made me leave my body, the music and Harmony with the movement of blocks puts you in a zen state.\n\nI've been playing tetris before bed almost every night for over 13 years. And while on the phone, Tetris could distract me and maybe calm me down if I'm stressed, only this version has managed to truly lift my spirits.\n\nThis game is not only fun and visually stunning, it takes you on a ride. Raises your heart rate, and surprises you with the power of music. I look forward to my over ear quest headphones to be delivered so I can enjoy this game to its fullest extent.\n\nHelpful | 5", "EispfogelMay 17 at 9:49 PM\nTetris - PERFECTION\n\nYes the price is high for..JUST Tetris, but this is only at first glance.\nThey made sure that everything feels right to play, from the visuals, to the sounds to the perfect usage of the Touch Controllers. You can use an XBOX Pad, or a SN/SF30 Pro and they are OK, but really...give the touch controls a shot! I was never THIS fast in Tetris and i stopped thinking about the controls in no time and it feels incredible good to play the game with the Touch Controllers.\n\nI played through the campaign and had 2 Perfectris along the way - i never achieved this on PS4, because i was too slow. This is no problem anymore.\n\nPros:\n- Motivating music, sound and visuals\n- There is an event every Weekend and the Community tries to complete it - this lured me back to Tetris several times now, so it is a good idea ^^\n- Touch Controllers feel PERFECT. This is just like Quake 3 Arena - perfection\n- Enough gamemodes to keep you engaged for a long time\n- Global Highscores\n\nCons:\n- The game is blurry :/\n- Performance on some stages is impacted :/\n- Some stages have a bad contrast and it is hard to see something(like Ritual for example)\n- NO MULTIPLAYER MODES. Something like Puyo puyo Tetris, or Tetris99 would have been great!\n\nBesides those Pros and Cons - this makes the Quest library complete for me! This is why i bought a Quest!\nBesides Moss, Space Pirate Trainer and Beat Saber - this made the Quest the best purchase i made in years. Amazing how this device evolved within a year and Tetris never felt better to play :)\n\nHelpful | 6", "ScottusMaximusJun 9 at 2:45 PM\nMore than I expected\n\nFirst of all, the music is unreal! I bought the soundtrack off iTunes after playing. Its that good. Definitely a good zen vibe. Love the 3D effects that change based on how you play. How you play also determines some of the beats in the music. The zone is a great feature. Its more than a Tetris I played before. Would love a sequel. I can see lots of potential in this with VR. Im listening to the soundtrack while writing this! A good buy.\n\nHelpful | 2", "gaviidaeJul 7 at 10:04 AM\nI dont even like Tetris\n\nI was very hesitant to buy this because of the price and that I dont really care for the game of Tetris. But eventually I broke down and got it and I was surprised to really enjoy it. Its a nice way to spend some time chilling.\n\nHelpful | 1", "staceycavJul 4 at 4:27 AM\nHallucinogenic Tetris!\n\nThis is my favourite seated game on the Quest. Its immersive, well designed and the music is just phenomenal.\n\nIts pretty much taking a classic puzzle game and bringing it right up to speed for a completely worthwhile VR experience.\n\nExcellent.\n\nHelpful | 1", "TanSeekerMay 20 at 3:41 AM\nBetter than you expect!\n\nEven with all the rave reviews I went in thinking the hype was a bit more than deserved. It really is a solid effort and I have had a good couple hours fun already. They really nailed bringing a classic to life in VR with a lot of visual variety and surprises that really brings a fresh feel to it. Games like this in a static environment are so good for quests abilities. Along with Space Pirate Trainer and Zen Pinball, this is one of my new favourites. Good work! Highly recommend!\n\nHelpful | 5", "Smash10101May 15 at 3:01 PM\nBuy this now\n\nI never liked Tetris that much. I was never good at it and I thought it was boring. After playing Tetris effect; convinces to by the amazing reviews, I immediately fell in love. This isnt a game, its an experience. Some of the locations and songs can literally bring you to tears and well the gameplay, its Tetris. One of the best puzzle games ever made. You need to buy this now, even if you think you dont like Tetris.\n\nHelpful | 6", "vavavannJul 18 at 2:33 PM\nGreat game\n\nThis isnt anything revolutionary, but its very addictive. The music and those falling blocks will put you in a trance-like state thats worth the price of admission\n\nHelpful | 0", "FinnyWiggenMay 22 at 6:06 PM\nMore Games Like This Please!\n\nTo those who have complained that this doesn't take advantage of VR fully, can I just say to you how happy I am that that is the case! One of the biggest shortcomings of the Quest (as opposed to the Go) is that almost every single game requires standing up and moving around. That is all well and good when you are in a room... but pretty terrible when you are on an airplane! I want games that require movement, but I also want games that I can interact with from a chair!\n\nThis game is phenomenal in that regard! Absolutely beautiful! Fun, and a great way to pass the time while in a place where your movement is restricted. Thank you for NOT making a game that requires movement!\n\n(We need these kinds of games too!)\n\nHelpful | 4", "daspotjoelJul 27 at 5:25 PM\nSpiritual successor to Lumines\n\nIf you love Tetris and Lumines, you'll love Tetris effect! It's like I'm getting the best of both worlds. Plus, VR makes it so much better!\n\nHelpful | 0", "kkuzma1982Jun 5 at 11:25 AM\nBest game on Quest!\n\nI can't stop playing this game over and over, its so addictive. The challenges gives the game variety, so don't be fooled that this is only simple tetris.\nI would pay even full price for a DLC with additional maps although there are much of them already.\n\nP.S. I only hope that developers can add the option to have supersampling implemented for users to choose even if sacrificing slight FPS drop. People proved that the title can run pretty ok with increased texture renderer resolution. Please consider the option. Thank You\n\nHelpful | 2", "GrahamB101Jun 20 at 1:05 PM\nTetris Effect\n\nI have owned the Quest since Christmas and this is certainly my most played game already, what cant you like about it, ok not so immersive as other titles but it just gets you coming back for more and more challenges, the simple controls are very responsive the music and wider graphics drag you in,\nYes its Tetris but Tetris with all the bells and whistles, fortunately due so social distancing I am unable to share the experience with others their loss my gain. It will certainly help absorb some hours of my current free time, This is just one of those games you need to have in your library.\n\nHelpful | 0", "KnittelManMay 16 at 10:12 PM\nREPLAY value!!\n\nWhile the Tetris game itself is... well... Tetris, its not your grandpas Tetris!\n\nFinally a game that you can have, keep playing, introduce friends to with ease, and just get sucked in over and over!\n\nMany VR games have a small story and its a one and done game. This is a game that everyone knows how to play, and you can always play it without it getting old. If you just have a few minutes you can do a quick game, and if you have time you can basically have a meditation moment!\n\nWhat I love is how the music, gameplay, and environment, are all connected so seamlessly! It might start dark and simple and as you finish more lines the beat picks up, and each move you make contributes to the music, and then you are traveling through an environment or its moving around you! It can be very relaxing and peaceful and pick up and be very intense and difficult!\n\nDefinitely worth checking out and buying!\n\nHelpful | 5", "Awestin74May 20 at 8:37 PM\nHeat pounding, beautiful, and emotional\n\nReading reviews I was confused because everyone was talking about how it moved them to tears. After playing I understand why. You owe it to yourself to experience this. Ive never been in to Tetris before but this game just put me in this zen state and flow until my battery died. I cant wait to show this to people!\n\nHelpful | 4", "xxxXaLiVeXxxxJul 12 at 2:24 PM\nClassic Tetris Feel\n\nThe music the visuals and the gameplay make this game worthy of 5 stars. Classic Tetris Feel with the new VR twist. This is one of the best games on quest ; purchase with confidence.\n\nHelpful | 0", "Chubozuma21 days ago\nBEST TETRIS GAME EVER\n\nIf you love tetris games, don't even think it, buy it, period.\n\nHelpful | 0", "evandaganMay 18 at 8:02 PM\nWhy would I need Tetris in VR?\n\nSo here's what this is: it's Tetris, with a variety of animated 3D backgrounds.\n\nThat's pretty much it, but the backgrounds are beautiful works of art, and the music is fantastic, ranging from ambient electronic to jazz and mixed with more traditional \"world music\" styles. The music and animated backgrounds are not just simple loops, but evolve and change as you play, apparently taking cues from your actions and progress in the game. This adds up to a whole lot more than the sum of its parts, and really is a great experience. It's almost a rhythm game: you'll find yourself moving pieces in time with the music and getting into the flow.\n\nIt can be relaxing/meditative on slower levels, but the faster levels get pretty hectic, but there after time of settings and different modes so you can pick and choose based on your current mood.\n\nSo yeah, it's just Tetris, but the VR environments and music really do add something new and it's much more than the sum of its parts.\n\nDocked one star for the price - this would be an easier buy at $15 or $20.\n\nHelpful | 11", "david508Jul 24 at 1:00 PM\nNot what I expect from a VR perspective\n\nYou can definitely get your zen on with this game I suppose. I've been a huge tetris fan since its been released back in the '80s. My favorite was Tetrinet, where you can play online (irc) as teams or play against all, a true multiplayer game.\n\nThe graphics is decent, but thats it. There is nothing VR about it. I thought you can use your hands to manipulate the blocks, do hard drops by throwing it down, basically all hand/controller gestures to play this game in its VR form, but sadly not even close. Its all with the thumb sticks and buttons, not exciting to say the least. This could of been so much more from a VR stand point, the only advantage is the graphics surrounding the game board itself.\nSo disappointing, even when you start the game for the first time, you have to navigate to figure things out, find the demos and instructions yourself since it doesn't present itself from the beginning or go thru anything for that matter.\n\nHelpful | 2", "SambaQJun 17 at 11:09 PM\nChallenging and amazing fun game\n\nIts so beautiful, sometimes I cant concentrate on the game I just want to watch the VR world. Its so beautiful and breathtaking! The music follows your controls as the level go on, things are happening and developing around you. Totally worth the money and magical experience!\n\nHelpful | 0", "hieroaplusMay 28 at 8:18 PM\nFirst Review Ever\n\nI just got a Quest for my birthday this past April. I only have a few games so far. End Space, Rush, The Climb, Vader Immortal, Super Hot, Racket Nx and Space Pirate Trainer. And a few others. I just bought Tetris and it is easily my favorite game. Yea its pricey but its worth it. If you like Tetris you should love this. I wasnt a crazed Tetris fan myself. But this game is worth every penny IMO. Buy it. You wont be disappointed. If you dont like it, get a refund. Great job devs.\n\nHelpful | 2", "siobhan7225 days ago\nJust love this game\n\nWorth every penny. Cannot wait for the multi players.\n\nHelpful | 0", "Roxtar73Jul 4 at 5:20 AM\nTetris in 3D\n\nThis is an interesting game no doubt and if you are a Tetris fan then get it as its Tetris.\n\nThe good.\n\nBeautiful visuals\nAudio space is well put together\nVery zen while still challenging you. Its hard to explain, it sort of feels like an anxious meditation.\nTetris in 3D you stand in front of the well watching the pieces come in. You can move closer or farther from the well for your own comfort level.\n\nThe bad\n\nIts Tetris weve all played it and there isnt anything new here other than the visual presentation that would compel one to believe this is a must have game. Only the Tetris fan or first time player will really find this experience something to behold. Its good but not must have great. Still if you like Tetris get it its Tetris.\n\nThats all the bad I can really think of. Its an old game and has been on everything almost. So its no surprise it made it to the VR platform. Its fun its uniquely presented and for that I will give it a whole four stars. I like it and would discourage anyone from trying it at least. If Im the first hour of play you decide you do t like it you can refund it. So you really cant lose either way. You get a fun game or you get your money back.\n\nViva la Tetris!\n\nHelpful | 1", "SeVenDeAdLyS1n5Jul 25 at 8:29 AM\nAmazing and addictive\n\nThis is definitely a must play for VR, it is quite an amazing game.\n\nHelpful | 0", "MrChalfantVRMay 24 at 9:17 AM\nTetris in VR but not VR Tetris\n\nThis could have been so much more. It's just Tetris on a flat surface with a tiny bit of 3d parallax, some great music and environment effects, all with a 30dollar price tag. This is a super popular old game that has been re-skinned for VR to help drive sales on this platform. It could have been so much more. How bout making it immersive! How bout making the pieces fall around you in a curved play area! How bout letting me grab and spin the pieces with my controllers! Come on devs grow some VR cahones and make this a real VR Tetris. What's next centipede VR? Pacman VR? Just put all these old games in a 360 environment on a flat surface and hit us dummies in the face with a fat price tag!\n\nHelpful | 32", "Cottleston_PieJul 9 at 6:38 PM\nLove this game\n\nThe more I played it, the more I loved it. Perfect for sitting and relaxing. The music is great and integrates seamlessly with the game play.\n\nHelpful | 0", "eclipse1099Jun 7 at 11:27 AM\nThis is awesome\n\nI just bought this yesterday but didnt play till today and I want to say this is now my favorite game on oculus quest. The levels are so vibrant and the atmosphere I feel like I could just feel if I was in the game. Got a little nauseous but thats just me. Each level felt like composing a music track for some lofi or calm music track, and honestly the sounds alone are the best part. 20/10 would recommend and a must have for the oculus.\n\nHelpful | 0", "Chunk-EJun 8 at 7:50 AM\nTetris goes Pyschadelic\n\nThis is one trip of a game, i literally felt like it was an out of mind and body experience playing this talk about zoned out , its like a kaliedoscope of colours mixed with edm Beats and tetris on top.. Mind blowing game 10/10 for creativity... Wow wow wow.... Well done on creating this masterpiece of brilliance...  Now can someone do the same for space invaders and galaxia? Possibly pacman?\n\nHelpful | 1", "westley93Jun 7 at 7:36 PM\nEverything I had hoped for and more\n\nFor starters I shall inform yee that I have been playing Tetris on my phone for what feels like my entire life, then they took Tetris away recently leaving me and my wife wondering if our son one years now would ever get to play Tetris well low and behold the Oculus comes through to save the day and it gets better this Tetris is way more insane and challenging than previous forms I've experienced, perfect game to get someone who isn't sure of vr to try it out and see just how very cool this entire experience is as well as it being in something as timeless as tetris. Bravo development and friends, I sure would love to see more classics done in this manner, with that said 5 star all day worth every cent, can anyone in charge of knowing people who make games let someone know snowboarding game would be awesome like amped3 remastered Oculus edition, I feel like this is the perfect platform to have games like ssx or amped or even say Toni Hawks pro skater in first person vr thanks for listening.\n\nHelpful | 0", "CJayYGMay 15 at 3:29 AM\nFirst things first....\n\nI NEVER write reviews for any type of games or game systems. I HAD TO PAUSE THE GAME TO WRITE THIS!!!! I love Oculus Quest, and a lot of the games that are available. But this, THIS TETRIS, is beyond words for me. The graphics, the music that becomes in sync with the block placement and movement. The way the background changes the further you make it into the current level. I have always loved Tetris and this version just made my top 3 favorite games to play every day.\n\n\nSafe to say, Im impressed.\n\nPeace.\n\nHelpful | 3", "CURTROCKJun 6 at 9:14 PM\nThis experience is SUBLIME!\n\nIve never played Tetris b4, as it never interested me on any level. In VR, this game is exceptional. Its chess. Its checkers. Its meditation. Its a rave. Its a smorgasbord of sounds, visuals, and tastes of culture. Its like a rabbit hole; the deeper you go, the more fantastical it gets. Im pleasantly surprised at how good this is. An excellent VR experience. Well worth the premium price.\n\nHelpful | 1", "HotSauce1515 days ago\nGood but one issue\n\nIts good but I have an issue with it requiring tracking when it really shouldnt require it\n\nHelpful | 0", "erasmushurtMay 14 at 10:13 PM\n\nSeriously at the time I bought this it was all five star reviews and I thought hmm a VR twist on Tetris? I'll try it. This just looks like vanilla tetris to me. It's played on a flat 2d board. With new background effects? What exactly is VR about it? And it's $30?\n\nSave yourself some money and play a browser version for free. It's pretty much the same experience.\n\nHelpful | 193", "J007sJun 28 at 9:32 AM\nA brilliant one player but no social\n\nThis is the most beautiful and hypnotic version of Tetris ever. It contains loads of great modes and you become immersed in this Tetris more than any other version.\n\nHowever, the lack of multiplay and social element is a real let down. Friends of mine have brought this seen I showed them it but we all feel it's such a shame we cannot do anything together on it. It would be the perfect version !\n\nHelpful | 0", "BristolVRMay 19 at 6:37 AM\nGame or Therapy?\n\nIn my case both. Its the only oculus experience I can spend a significant amount of time in and get to that state of flow with incredibly well thought out visuals and music. Its awesome, I just want to savor it!\n\nHelpful | 4", "mccarthy99Jun 28 at 5:35 PM\nMy favorite Quest game\n\nIve been playing through this over and over. Its surprisingly fun. The varied levels, and the way the music syncs to what youre doing is just so rewarding.\n\nHelpful | 0", "jremelinJul 24 at 7:32 AM\n\nReally nice music. Nice vr feeling\n\nHelpful | 0", "Robbity-BobJun 15 at 10:29 AM\nFantastic!\n\nNot played Tetris for years and when I did I got bored quite quickly, Tetris effect got me hooked from the start, fantastic immersive gameplay, I still have a long way to go but this is now my favourite app on the quest.\n\nHelpful | 0", "JTubbrittJun 11 at 5:31 PM\nAbsolutely outstanding.\n\nMy first time playing Tetris was on the original gameboy when it came out. Never in my wildest dreams could I have imagined how astonishing this game would become. The team behind this edition have done an outstanding job. Congratulations.\n\nHelpful | 0", "HinkenborpMay 29 at 8:53 PM\nGorgeous\n\nThe first time I've ever given any care to a Tetris game and what a title to get into. Tetris Effect makes Tetris a much more enticing experience for a good price and frankly I've become addicted. I have never enjoyed Tetris before, but this version adds so much to the basic experience that even regular Tetris has become fun now.\n\nHelpful | 1", "jster213Jun 25 at 9:30 PM\nWorth it!\n\nPrice seems pretty steep at first for what you would think is a basic game but was well worth it for what is a reimagined and highly visualized version of a classic.\n\nHelpful | 0", "PickleBoss08Jun 4 at 9:10 PM\nI didnt think Tetris was this immersive\n\nNot gonna lie, didnt think this Tetris was going to work in be, but I was totally wrong. This game is very immersive and is a good game to just sit back and relax. I even showed this game to my family who doesnt play vr, and they all enjoyed it.\n\nHelpful | 0", "TheDaddyToeMay 14 at 7:03 PM\nIts tetris\n\nWith all the rave reviews I was expecting something more. I tried to enjoy it. Music is okay. This game is for tetris fans. If you never were much of a fan like me you might not get anything out of this version. I submitted for refund.\n\nHelpful | 58", "sheLiebJun 7 at 3:16 PM\nSo amazing - Im hooked!!!\n\nThis goes well beyond playing Tetris decades ago - its not a game, but an experience! I am totally addicted!!! The music and graphics make it relaxing and stimulating and there are endless ways to play and enjoy! I love this app!!!\n\nHelpful | 0", "intothebreachMay 26 at 2:12 PM\nAbsolutely spiffing!\n\nTremendous entertainment, I loved the bit with the blocks and the music, I found that bit especially compelling. Lots of blocks, lots of music, altogether resulting in a splendid combination of top drawer fun. Do consider a purchase, I believe you would be most likely to thoroughly enjoy it!\n\nHelpful | 0", "GlassArtGirlJun 10 at 7:31 AM\nIf you love Tetris youll love this!\n\nI wasnt sure how Tetris would translate to VR, but I really like how they incorporated music and graphics into the game. Its a cool experience. Its nice to have a game I can continue to play instead of just once.\n\nHelpful | 0", "pondfrogsMay 24 at 5:12 PM\nwhat an experience!\n\nI havent played tetris in a very long time and didnt know if id like this...but so glad i got it! love it!!! sure the game concept is the same but with all the special effects like floating sparkly creatures...fireworks exploding and upbeat music i feel like im in a fantasy world. its a game im sure i will play often. only complaint is id like to be able to adjust the game board placement and be able to move it where i want it...it feels to low like im looking down and my neck gets tired.\nwell worth the $$\n\nHelpful | 0", "fwpxJul 22 at 12:03 PM\nAwesome\n\nWas blown away. Awesome.\n\nHelpful | 0", "VoltaiaJun 10 at 5:06 PM\nI bought it thinking I would refund\n\nBut this game is actually awesome. I've never really been into Tetris before, but I guess spazm lights is the cure to that weakness. Super fun, only complaint is that the menu UI is eh. Seriously buy it though.\n\nHelpful | 0", "ba5_icJul 18 at 7:56 PM\nTetris effect\n\nAwesome game 10/10\n\nHelpful | 0", "Lazius001May 23 at 3:06 AM\nGame of the year on the Oculus Quest\n\n\"Game of the year on the Oculus Quest this year 2020\" VR Essentials.\n\nThis is absolutely incredible experience. Tetris Effect is not only excellent for making people smarter by enhancing cognitive abilities, but it also transcends you into a world of Music Art voyaging through many different cultures. It is a time-traveling puzzle musical experience.\n\nHelpful | 1", "maren.frohlickJul 18 at 5:03 PM\nThis game is incredible\n\n10/10 recommend\n\nHelpful | 0", "SuaveQMay 21 at 3:59 PM\nAmazing\n\nSince I have first purchase my Quest, each game purchase has been played no more then once or twice. Attention spent has to be impressive in order for me to justify spending time in the VR then from the real world. This is the first game that I can truly say Im finally in live with my quest. Gameplay , graphics, music , all intense. Big Up to the creators, A MUST BUY.\n\nHelpful | 1", "hyperbunnyMay 21 at 9:48 AM\nWhat an experience! Classic game + extra\n\nThis is Tetris on steroids! The gameplay itself hasn't changed all that much, they've added this ZONE power up type of feature that allows you to slow things down to help get you out of sticky situations or multiply your line scoring.\n\nThere is a campaign mode and a jump in and play mode.\n\nThe visuals and music respond to everything you do, it's extremely immersive & fun, I just wish I wasn't trying to not die to enjoy everything going on around me in Tetris Effect lol\n\nIf you love Tetris, there is no reason you wouldn't love this. The extra price tag is all the fun that comes with it! You can really get into a flow state and get lost in here. There are different backgrounds and sounds on each level as well so you're constantly stimulated.\n\nI made a small review & gameplay here\nhttps://www.youtube.com/watch?v=CtkKBkJxwzU\n\nHelpful | 1", "PalikoalaJun 10 at 5:34 PM\nAmazing\n\nTetris was to me a game about speed, accuracy, and engagement. This was a game about beauty, I didn't think it'd fit but it did, beautifly. It's like a tetris rythm game. I love it, a vr must have\n\nHelpful | 0", "oitbcJun 12 at 10:18 AM\nPoor game, not worth the money\n\nReally disappointed with this. The Tetris game looks like it belongs on an early game boy and the effects around it all are ok but nothing spectacular. At least a solid colour decent game board would have been a benefit. Feel a bit robbed for what I got. Should be 2.99 instead.\n\nHelpful | 8", "pharoahdanaMay 15 at 4:56 PM\nUnsure and pricey\n\nThe music track displayed on the demo video for this game is the only thing that made me buy it, I gave it 90 minutes of play and decided if I didn't hear that track or better I'll ask for a refund, I didn't hear that track or better. Don't get me wrong tetris is a great game and even more so on the vr but 23 quid for a 36 year old pretty basic game is a little but on the high side\n\nHelpful | 11", "PetayFireMay 19 at 12:33 PM\nThe best sitting VR game I've played\n\nThis game is great. There is something so otherworldly about the visuals and how the music and sound interact with the surroundings. You're playing normal Tetris but the world around you is warping and shifting in really trippy ways. Regularly find my jaw dropping at some amazing new effect. The quest version is also cheaper than the PC version, which is brilliant.\n\nHelpful | 1", "shlipperyJun 27 at 3:01 AM\nWhat a sensory experience.\n\nTetris, one of my all time top vr experiences. What a crazy statement.\n\nSound design and visuals are insane!\n\nHelpful | 1", "Viking4455May 15 at 9:00 AM\n30 Bucks for this?\n\nSo far my only regretted game purchase on the quest. Graphics are meh and their is nothing special about the tetris board. One of the levels the blocks are nasty looking Pixelated gears. Most of the particle effects are subpar. The only redeeming quality is the music and the way it builds and transforms as you complete lines. WATCH PLAY FOOTAGE before knee jerk buying like I did.\n\nHelpful | 20", "steve.shotonwaMay 18 at 1:04 PM\nWow! What more can I say?\n\nI said I'd never bother writing a review for any game, but this one just blew me away. The experience is so immersive, the sound of your interraction makes musical notes that blend with the key of the music playing. Game play enthralling, the scenery and movement around you is breathtaking but not to the point of distracting you from the game. The music I found so moving; I am not really a fan of electronic dance music but the melodies were beautifully composed and the quality of the mastering superlative. Be sure to wear headphones for the best results. I felt like I'd embarked on an interdimentional journey. Just buy it, you will not regret it one bit. Awesome!! So much effort went into this one, I honestly, for the life of me, cannot find any cons.\n\nHelpful | 0", "Bmaine98May 19 at 1:40 AM\nDefinitely One of my Favorites!!\n\nI suck at Tetris, but that didn't stop me from getting this game. If you love music games and pretty graphics, then this is the game is for you. Its a sweet game. You honestly can't go wrong unless you're really bad at Tetris. Shoot, i couldn't even beat the first level, but i taught myself.\n\nNow if only Enhance could release a streamable OST for this game....probably the best music I've heard in a game. Period.\n\nHelpful | 0", "NightHawk668May 19 at 5:23 AM\nWOW!\n\nI've always been a huge tetris fan, ever since I picked up a Nintendo controller for the first time, I was hooked. Needless to say I was super skeptical on how this would turn out on VR. This turned out way better than I could've possibly hoped. Thank you for revitalizing an important game from my early childhood. The game that started it all\n\nHelpful | 1", "djblondonMay 18 at 3:13 PM\nVery pleasantly surprised!\n\nWasn't sure whether this could live up to the hype and reviews - this is just Tetris, right? I was right to trust the reviews - very immersive (must wear headphones!) with superb audio and graphics (though most of the good stuff is happening all around you) and very addictive. Above all this transports you to somewhere else and feels almost therapeutic. Love playing this!\n\nHelpful | 1", "GraphicsMonkeyJun 6 at 2:52 PM\nExpected Tetris... Got an EXPERIENCE!\n\nTotally blown away!\n\nPut your headphones on FULL and sit back and get in the zone! Cast to your TV and the family will be griped also!\n\nTotally amazing game, last level is HARD when you get to 60 lines!!\n\nHelpful | 0", "lokerasJul 12 at 2:28 PM\nBest game ever\n\nOne of the best games in the System\n\nHelpful | 0", "Grid80May 23 at 5:29 AM\nA feast for the eyes and ears\n\nAn excellent addition to the Tetris family of games, and an absolute treat for the eyes and ears. It doesnt do anything gimmicky with VR, and is best played with a Bluetooth controller but is very playable with the stock Touch controls that come with the Quest.\n\nHelpful | 0", "TheBigLebootskiMay 16 at 11:31 AM\nAmazing\n\nAs a longtime fan of Tetris, I was interested in playing this game since it hearing of it on PS4, figured it would look and sound cool, but thought it would be somewhat gimmicky as a VR game. After playing a few hours, I'm happy to say I was wrong, the brilliant immersive audio/visual elements turns Tetris into a surreal experience that words can't describe. On top of this, there are plenty of extra modes to sink your teeth into, with leaderboards, to satisfy the most hardcore Tetris fans. I can't recommend this game enough, I wish I could give 6 stars, just buy it!\n\nHelpful | 0", "WillyWantsMoreA day ago\nSome of the best!!\n\nShort answer: Games great would recommend\nDetailed answer: The game is absolutely amazing from the graphics to the gameplay. The feeling you get when you land 4 rows at the same time and the feeling when you pass the level that you have been trying to hard to pass. I didnt have any issues and it feels like the sounds go along with the music and it is just a relaxing game that I could play for hours on end. If you dont enjoy a good game that requires patience though then dont get this. This game takes a lot of time and effort but it is worth it. I grew up playing Tetris and even making new high scores with all my friends watching at school. This is the future of vr and Tetris. I am beyond impressed\n\nHelpful | 1", "Parzival-oneMay 27 at 2:45 PM\nA great game to pass the time away.\n\nFabulous game with amazing soundtrack.\nAnd pack with tons of nostalgia.\nThe devs should be proud of what they have achieved its truly mind blowing love it.\nOnce you start you get lost in the world of Tetris till you Quest Is out of juice 5*****\n\nHelpful | 0", "AxidoJul 8 at 12:21 PM\nWorst port of an otherwise great game\n\nI was astonished when I saw that Tetris Effect finally came to the Quest and I was curious, since I hadn't gotten the game on any platform yet. I'm a huge fan of the Tetris franchise and I'm starting to become considerably good at the game. So this was a must buy for me.\n\nThe good stuff\nThis game is full of content, especially for seasoned players. The different Effect Modes sure could teach me a few more skills. Coming from Puyo Puyo Tetris I enjoyed its non-compatitive equivalent of Big Bang mode (a mode in which you need to clear your entire field with a given set of tetrominos).\n\nThe not so good stuff\nLet's face it. The visuals could be better. The particle effects look washed out and even though they are still kind of nice to look at, I imagine the PSVR and PCVR versions are far superior in this department.\nWhat's more important (to me) is that the game tends to lag, sometimes for no apparent reason. As a player striving for highscores and SS ranks I feel like unnecessarily hindered by the occasional lag to the point where I get uncomfortable with playing the game (not in a nausea-induced way, though).Sadly, I couldn't find an option to turn down effects in order to make the game run smoothly all the time.\n\nI really would love to incorporate Tetris Effect into my Tetris Training routine, but as it stands I rather feel ripped off 30 for an inferior port and I don't want to spend money twice in order to get the real deal. So, please, dear developers, I ask you to patch the game so that it becomes the best it could be.\n\nHelpful | 1", "FatSheamusMay 15 at 10:36 PM\nAn amazing experience of light and sound\n\nDo not be mistaken, this is not just a game. Its a spiritual awakening! Tetris remakes over the years have ranged from overblown, to gimmicky, to just plain boring. This masterpiece blows them all away and transports you to another state of being. Definitely worth the purchase well beyond its listed price.\n\nHelpful | 0", "JMarchnerMay 15 at 6:05 PM\nA visual and audio trip\n\nSure Tetris is a fun time killer but 30 dollars for a VR version? Holy crap yes! This game is mesmorizing; the audio and visuals are synchronized so well with your gameplay that I couldn't put it down. I should note I never played the PC version so I don't have a comparison but I can definitely say if you haven't played this game it is worth the 30 dollars whether you love Tetris or just find it to be a fine old game.\n\nHelpful | 1", "h2okevMay 16 at 5:43 PM\nA trippy ride.\n\nIt's pretty breathtaking. It's a very simple no frills tetris game but the background and music are a very unique plus. I've failed levels due to looking around at the environment and the changes as you play. Would love a multiplayer mode but this has taken my breath away. It's as close to a psychedelic trip as you can take without the good stuff.\n\nHelpful | 4", "lanrusmarMay 15 at 6:49 AM\nNot the game you remember\n\nI remember playing this game years ago and enjoyed it. Although I debated spending the 30 dollars to get it... Glad I did!!\n\nIts not about the normal game functions, its all about the effects, sounds and music. Its like this game is a new concept and you're seeing if for the first time.\n\nDon't debate... Just get it..\n\nHelpful | 3", "bladestorm123Jul 14 at 1:47 AM\nTetris\n\nYes\n\nHelpful | 1", "lauratyrieMay 16 at 1:31 PM\nFantastic Game but\n\nSo I think this is fantastic game, used to play this all the time years ago.\n\nSo bought it and played it well omg the graphics are fantastic the game is brilliant I love it.\n\nOnly thing is when the graphics change and move so it gives me motion sickness so I can't play the game too long.\n\nHelpful | 2", "luvlee.tanyac927Jun 4 at 7:50 PM\nFor all players\n\nI enjoyed this game to the point I lost track of time. I had different family members, who liked way different genres of games. Every person enjoyed the game. I and my family have no complaints.\n\nHelpful | 0", "sundrytimesJun 12 at 10:02 PM\nBeautiful , Fun, and Reply Value!\n\nWhat a great addition to Quest library. We love this game and have played it constantly since getting it. So many ways to have fun and challenge yourself.\n\nHelpful | 0", "AquareonMay 19 at 12:19 AM\nWhy is this game rated so highly?\n\nI had to sit through a sixty second loading meter the first time. For Tetris. Let that sink in for a moment. Tetris, a thirty six year old game that originally ran on cold war era microcomputers, now runs on the Unreal engine and takes sixty seconds to load initially, then fifteen seconds every time after that. FOR TETRIS. Why? It's not loading from a disc. This isn't the 5th console gen. This isn't Lumines on PSP. It's loading from fast, solid state memory. How can TETRIS have a loading meter? AND I HAVE TO CLICK THROUGH FOUR SCREENS OF LOGOS BEFORE I EVEN GET TO THE MENU.\n\nI digress. The next sin is that it's thirty dollars. I wanted to put some choice words in here but I'm trying not to give any excuses to take the review down. Thirty dollars for Tetris? Why? Because there's distracting visual fluff littering your peripheral vision, while you play a game about falling blocks? Yes, I bought it, because Quest is starved for content and I like Tetris. When it's cheap, starts instantly and controls properly. Which brings me to complaint number three.\n\nThere appears to be no insta-drop button. Maybe I'm a big dummy and somehow overlooked it? Maybe it's a button combo for some reason? I can understand the desire to prevent people generally unfamiliar with VR controls from accidentally dropping pieces, but then why not give us the ability to turn that feature on or off in the menu? I shouldn't have to sit here like a dink holding down on the analogue stick to drop pieces if I know where I want them to go and have them vertically aligned within a second of their appearance at the top of the playfield.\n\nWho is rating this garbage five stars? Were you dropped on your head? Do you clap and giggle at any flashing colored lights brought within your field of view? Does generic mall music enhance a falling blocks game THAT MUCH for you? I feel as if you'd get just as much joy from jangly keys and I'd do that for free. One star.\n\nHelpful | 26\nDeveloper ResponseMay 19 at 12:06 PM\n\nHi! Thanks for your feedback. To Hard Drop (insta-drop), press up on the left joystick. Controls can also be mapped to your liking in the options (and the game is gamepad-compatible)!", "Samurai2011May 23 at 11:49 AM\nPure Rectal Garbage\n\nWhat is this Garbage? So much potential and you put out a 2D version of Tetris with special fish sound effects? Theres loops that run and freeze the game for Petes sake! Its 2D in a VR environment. Is this amateur hour? Why not 3D blocks that we need to plug into concave wall around us? Why not filling out creatively shaped frames with the traditional block arraignments? Mine craft accomplishes stacking 3D blocks with the crappiest graphics since commodore64. This is a revenue play and they tarnished the name and the classic game. The developers should be ashamed to put this out. Enjoy your gimmick money for capitalizing on a name and a loyal fan base. You wont sell a second version unless youre selling it to the half-wits that rated it 5 stars. Who are those people anyway? Was this offered as a free trial in the brain injury ward? Oh if you program any of my ideas from here into the game without paying me royalties Im suing you losers. If youre incapable of generating a decent idea to make this game worthy of its name on a VR platform at least contact me for help. Lucky for you con-artists I may be willing to work for pennies on the dollar just to salvage the reputation of the game. This was more disappointing than catching my grandmother wanking with my toothbrush. Id rather rinse my mouth with whale ejaculate that start this application again.\n\nHelpful | 20", "MyChaelGMay 18 at 12:06 AM\nGreat addition\n\nThe only thing I couldnt see is a way for multiple profiles. So many of these games lack it. I have 4 other people in the house that play this and not tracking each persons progress is a flaw of the system not this game but I hope the dev see this and add profiles.\n\nHelpful | 0", "thewilsonixJul 24 at 10:04 AM\nGood job\n\nIt is a beautiful game and I love the music\n\nHelpful | 0", "john.ebs9 days ago\nThis is a great TETRIS revival\n\nIncredibly beautiful and immersive TETRIS experience like no other. Plug in the VR and suddenly hours have passed while playing the game.\n\nMusic is incredible, visuals are incredible, VR effects are incredible. For once the HYPE was real.\n\nMy only complaint is the initial loading which takes quite a while to get started. Good that after the initial loading there is no more loading.\n\nIf (when) I finally get the PSVR (v2) this is a game I would definitely buy again.\n\nHelpful | 0", "Vonnie09Jun 29 at 12:37 PM\nTetris\n\nReally good game and effects are brilliant\n\nHelpful | 0", "awesomepeterMay 21 at 3:39 PM\nWtf are these reviews?\n\nI enjoy Tetris, and this game is ok made. But the raving reviews HAVE to be paid. It's really mostly a well made Tetris in VR, don't think it's some amazing hidden gem. Also very overpriced for what it is imo. For $15 maybe it would be really neat..\n\nHelpful | 8", "CandicePayne22May 20 at 1:35 PM\nLife long Tetris fan!\n\nIve been playing this game for over 25+ years and for the first time since the first time, the game feels so new and reinvented. I own almost every version and knock off version of Tetris and now Tetris Effect is now one of my favorites.\n\nHelpful | 0", "HariKhariMay 20 at 4:06 PM\nBeautiful for a Tetris game\n\nI don't normally write reviews but this game is 100% worth it. At its surface, it's just Tetris but the effects and sounds turn this into one amazing experience. It's really something when you're inside and everything is moving around you.\n\nHelpful | 0", "Ghostlo90May 18 at 4:35 AM\nGreat but disagree with the price tag\n\nGood old Tetris with nice trippy visuals, some music are great and some sounded more like noise to me which i dont really like it.\nGot this game due to all the great reviews but i still don't agree with the price tag $29.90 for this game. $20 should be fair enough\n\nHelpful | 8", "the-orange-guyJul 4 at 10:04 AM\nBuy it\n\nJust do it\n\nHelpful | 0", "adloroMay 30 at 5:58 PM\nLove the game, but gamepad does not work\n\nReally love the game.. but the oculus touch controls are not the best with it. Tetris really needs a d-pad. I connected the 8BitDo Bluetooth controller I have. It paired with the quest fine. Some of the buttons work on Tetris effect, but for some reason the D-pad does not register in the game.\n\nI went I reddit to find that other users have the same issue with other Bluetooth controllers.. so it seems like the game that is the issue.\n\nGet this working and it will be the perfect game!\n\nHelpful | 0", "S_N_TMay 30 at 7:45 PM\nFantastic game but...\n\nFreaking amazing! I have always loved Tetris but this new version; absolutely mind-blowing. It has a whole other level of difficulty that you won't expect from one level to the next. The visuals of the game are stunning and part of the challenge. However, The last challenge on the beginners level is incredibly difficult. I've been playing the last challenge for a week straight and no matter what I do I cannot win it. It's really starting to take away some of the fun. I like a challenge but eventually I'd like to win.\n\nHelpful | 0", "johnkramer42May 16 at 11:46 AM\nGreat port, some levels not comfortable\n\nI love it, its great that controls are not locked in. Some levels are making ke very sick thought, like the one with cogwheel tetraminos. The spinning motion background almost made me sick, and I am very accustomed to intense vr games. Please add option to disable background effects. Also it is a bit pricey for tetris, but i understand that all other platform versions have the same price.\n\nHelpful | 2", "xenos713May 19 at 11:44 PM\nAmazingly Zen experience!\n\nLove this purchase so much, my only issue I have is that it requires tracking to play but you don't actually need it in game, just menu selection. I would really like to lay down in my bed at night, turn off tracking, and Zen out. Other than that though I highly recommend!\n\nHelpful | 2", "eddiegarouJun 14 at 8:35 AM\nThe best version of Tetris!\n\nThis is probably the best version of Tetris Ive ever seen! Totally revitalized this classic game!\n\nHelpful | 0", "tarturoJul 1 at 4:53 AM\nTotally worth it\n\nReally compelling\n\nHelpful | 0", "SouthcatJul 2 at 10:22 PM\nGud Gume\n\nIt gud\n\nHelpful | 1", "ctrl.flirt.delJun 3 at 10:54 AM\nDisconnected\n\nFor $30. I would want immediate access to different level visuals. This is like a meditation app with Tetris, which doesn't work for me as Tetris is not relaxing. Someone wrote about the drops syncing with music and that really didn't do anything for me. It's hard to not like this classic game, but there is no added extra or oomph to this game. It's just so expensive for what you get. (Now, maybe it's priced appropriately for the hard work of the devs in regards to visuals and sound, but for a consumer, not worth it.) Unfortunately missed the time to refund it. I'll let other non-VR gamers play it, maybe they'll like it more. But for just a bit more money, I'd buy a used gameboy and Tetris classic.\n\nChanges that would improve my opinions is more variety of environments that are fun and different, not just environmental, under water stuff. Not sure if there was a zen mode for play, but I'd like that too. The map from around the world is a nice concept but not well executed.\n\nOverall, it is a pretty game visually, it just doesn't exactly merry well with theme and classic Tetris. Nor does it build up to something new.\n\nHelpful | 3", "LemonBurritoMay 28 at 11:52 AM\nTetris effect but awesome\n\nI have Tetris effect on my pc but it needed internet to access but when I bought it for the oculus quest, I found out that I can play the game offline. This game is awesome!!\n\nHelpful | 0", "ZedisnotdeadMay 19 at 8:04 PM\nAmazing game.\n\nThis is an amazing game. Well worth the asking price. Purely addictive ....you will put it down but keep wanting to come back. This game is alot of fun. If you even semi - like old school Tetris this will give you joy\n\nHelpful | 0", "stedizzleMay 16 at 9:54 PM\nWorth it\n\nIf you like Tetris, this game is totally worth it.\n\nMinor critiques: I would love to see a slightly higher resolution on the Tetris board and UI if at all possible. In some environments like Fire, the pieces can be hard to see.\n\nHelpful | 1", "godexsoftMay 17 at 1:16 PM\nAbsolutely amazing\n\nThis game is probably the most polished and enjoyable game on the quest at least from what Ive played. I already loved tetris before but Im falling in love with it all over again thanks to this unbelievable game \n\nHelpful | 0", "Lint01May 29 at 7:44 AM\nIncredible\n\nTetris Effect is an incredible experience. I had the PS4 version, which was also excellent but hampered by the hassle of the PS4 VR wires. On the Quest the game shines.\n\nHelpful | 0", "AlabasterSlimMay 19 at 10:56 AM\nI don't even like Tetris\n\nI'm not even a fan of Tetris but I picked this up due to the review. Wow! What a completely magical experience! The visuals, the music, the entire feel was such an emotional ride. I was completely blown away!\n\nHelpful | 1", "MrUnboxerManYTJun 11 at 3:44 PM\nIts a trip, a experience.\n\nJust bc its tetris doesn't mean its not worth $30, I know its more expensive than most games and maybe it doesn't have a greater value proposition. But it is fun! and that's all that matters.\n\nHelpful | 0", "PhantomBoiTW11 days ago\nThis game is worth it!\n\nAt first I was very skeptical about getting this game. I was thinking, \"Why would anyone want to play Tetris in VR?\", and now I know why. The art in this game is absolutely stunning and the controls are easy to get used to. If you are a Tetris fan, you need to get this game.\n\nHelpful | 0", "learningtoflyMay 25 at 4:35 AM\nGreat VR Tetris but...\n\nThis is a great way to play Tetris but for the cost (up there I will say) I think that the developers are missing an awesome opportunity to take advantage of the new hand tracking features of Quest, along with using body movement to slide pieces, etc...VR is more than the visual experience! Fingers crossed that theyre already working on an update!\n\nHelpful | 0", "RepulsivewolfMay 14 at 7:57 PM\nAn enchanting twist on a classic game!\n\nIf you remotely like Tetris this game is a must buy. This is relaxing, challenging, and just simple fun jumping from level to level. The visuals are stunning and the music moves right along with the game. If you think Tetris is boring think again!\n\nHelpful | 1", "anotherdanMay 17 at 11:47 PM\nPerfect Port\n\nI have the PC VR version of this as well and hesitated to buy a Quest port thinking it would be lacking. Instead I now have a portable version that looks every bit as good and plays great. A very welcome addition to my library!\n\nHelpful | 0", "jabrown41May 21 at 4:55 PM\nGood game\n\nI bought this. Played it for a few minutes. Then thought maybe Ill return it. The next day I played it more and thought ah what the heck. Its a keeper. Good to kill time and fun as Tetris can be. Its one to have when you dont feel like standing and playing games such as beat saber. Addictive.\n\nHelpful | 0", "butterham7Jun 1 at 7:35 PM\nBest game on the store\n\nWhat did you expect a in depth review just play the 2 best vr ever made so far\nThe first is half life Alex\nStill get this game\n\nHelpful | 0", "divineinterjectionMay 16 at 3:30 PM\nThoroughly enjoy this game\n\nI dont even play Tetris nor have I ever played it more then a few times in my life and this game has me playing everyday. The immersive tunes and visuals make the game exciting and enjoyable. Love it !\n\nHelpful | 0", "Holmes02May 20 at 11:23 AM\nA true masterpiece and a must buy VRgame\n\nI cant recommend you this game enough. It truly is spectacular and as a tetris fan i couldnt wish to have a better experience with a tetris game on any other tetris version than this one especially since its in virtual reality. The only reason i wont put this game on a 5 out of 5 star pedestal is because the game doesnt have that many environment or at least i wish it had more and is quite pricey for a VRgame. But i can promise you that you wont regret spending those 40 bucks once you start playing. This game, beat saber, echo vr, superhot and the upcoming fnaf help wanted are all must have games and you shouldnt hesitate to buy them\n\nHelpful | 0", "DarknautMay 25 at 6:19 AM\nBliss\n\nJust finished journey mode and what a sublime experience experience that was... i never thought a Tetris game would be my favorite VR experience. Worth every penny\n\nHelpful | 0", "VkingssJun 17 at 2:36 PM\nYou have to be a huge tetris fan\n\nYou have to be a huge tetris fan if your going to get the most out of it, this is simply due to for example all the particle effects that go on and the backgrounds that you see are hard to look at if you consentrating intently on the blocks trying to put them in the correct place and yes the music is OK but again hard to appreciate, in total don't get this if you think \"oh tetris I'm not bad at it let's play it\" as after a few levels it's just all the same\nAlso one of the levils you end up moving so a little motion sickness warning as there's not much of it\n\nHelpful | 1", "wookrottMay 16 at 5:30 AM\nbetter than I remember by far!\n\nI grew up at a seaside town with plenty of arcades and used to find tetris abit boring so never really played now I'm older I think I've found an appreciation for the game either that or the lights are just hypnotizing me lol\n\nHelpful | 0", "ap.talyaJun 1 at 8:45 PM\nGood tetris, fair VR, luck of controls\n\nI love tetris a lot, however the UX on this one is not really good and was definitely designed for console. 3d floating objects and music really nice, but controls are so uncomfortable and no way to through item all the way down, only speed it up. Even in learning curve there is no learning on controls build in. When you play you just stay statically which really removes all the fun of VR. Maybe I didnt play long enough to reach some meat, but its definitely not VR oriented. Returning this one and looking for same one on console.\n\nHelpful | 2", "ParadiseDecayMay 15 at 1:53 PM\nThe BEST version is on Quest!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=AXfQWm5t9OA\n\nMy Initial Thoughts:\nTetris has now found its perfect home... on the Oculus Quest in Virtual Reality.\nWhat a blast!\n\nHelpful | 1", "GaryAlfonsoMay 14 at 4:33 PM\nThe music is awful\n\nI never write reviews, but I had to let it be known. Tetris is a great game. The visuals here are okay - not that immersive because you're literally playing Tetris with some mildly cool stuff going on. No real criticisms there.\n\nHowever, the music is so awful in this game that I immediately had to request a refund. It's that bad. Tetris used to have good music. That is no longer the case.\n\nHelpful | 34", "PhorusMay 19 at 8:24 PM\nIncredible\n\nI was never much of a tetris fan but this game is absolutely beautiful. I would recommend this game to anybody who needs an escape from reality ... just let it take you away\n\nHelpful | 1", "AmberAmber12May 18 at 8:42 AM\nNot worth the grind\n\nThe music and effects are cool as you progress through stages if you are skilled enough to actually advance. Not a Tetris player here but it is annoying and just straight up hard. It has taken me over 10 hours just to get a B rating. There is some lag and on top of the crazy speeds it causes you to misplace blocks. It needs some kind of tutorial with difficulty lessons or a way to just turn off ranks at the end of a stage.\n\nHelpful | 3", "GamersEvilMay 22 at 11:44 AM\nA must have\n\nI strongly recommend this game to anyone with a quest. I bought this game in PSVR and loved it. But the ease of playing it on quest is something else.\n\nHelpful | 0", "Draek2017May 16 at 10:56 AM\nAmazing game\n\nThe way the audio and visuals react to your game play makes this game come alive.\n\nI love how they didn't mess with Tetris and they just enhanced it with VR. Perfect balance.\n\nHelpful | 0", "KeithmarJun 28 at 3:15 PM\nHate it!\n\nJust a beginer, I dont want to have to play forever to unlock the second level. Got bored after 15 minutes.Tried app support. Completely worthless. I wanted to check out the whole experience but cant bypass the first underwater level!! After 40 min trying to bypass I gave up.\n\nHelpful | 0", "signineMay 20 at 10:30 PM\nIts tetris...but with distractions\n\nIts like playing tetris in a rave.\n\nGreat except the da vinci level gives me a migraine.\n\nHelpful | 2", "vbeansJun 6 at 7:45 PM\nMore of a one time thing: it's short\n\nTetris is one of my favorite games, and this felt short. There's only a Journey and Effects mode to choose between. Most levels are not very interesting. I enjoyed the credits more than the levels themselves. Theatre mode is a nice addition.\n\nHelpful | 3", "nicholas.dalbeyMay 18 at 8:08 AM\nConcerned Customer\n\nSo, it is unclear when purchasing what you are going to experience. It is a clever way to push an agenda via the music and images presented. Im waiting for the Christian level. So far, every other religion is represented. Only played for a little bit so far. If you want to experience a journey to the dark side, buy it. Im regretting that I did. Waiting Unfortunate, since I have been playing Tetris for so long.\n\nHelpful | 9", "JohSm67Jun 5 at 11:04 AM\nGot it for the PC and now the Quest\n\nWhile playing this on a PC with a 77 16:9 or a 49 32:9 screen its a fantastic experience!\nAlot of effects and pumping sound tracks.\n\nI got hooked, so I went for the Quest version as well even if it was quite expensive.\n\nNow to the Quest version,\n\nIts ok, but it feels very lowres compared to the PC version, also you are way to close to the play area and do not get that surround feeling in your HMD! (Maybe a possibility to adjust distance within the VR version would help.)\n\nThe Quest version need some more optimization and love to deliver that great PC experience!\n\nHelpful | 1", "MisterPrangeJun 22 at 8:42 PM\nPlayed this on acid\n\nIt was awesome\n\nHelpful | 2", "henry.delaneyJun 6 at 10:22 PM\nBest game on the oculus\n\nJust a beautiful rendition of the game. Love it.\n\nHelpful | 0", "meduzoJun 3 at 11:30 AM\nThey threw money at Tetris\n\nThe guys behind this just threw lots of money to a simple idea, making it a completely new journey with simple mechanics. They play with how Tetris affects your anxiety level and create a unique array of feelings through just blocks.\n\nThis game should have the \"no tracking mode\" enabled so we can play in the dark, thing that cannot be done right now.\n\nI hope it gets a bit more updates since once you finish it... the discovery part is over and you just have Tetris with cool skins...\n\nHelpful | 0", "bradneubergJun 1 at 11:06 PM\nIts VR Tetris!\n\nBeautiful and immersive, with great art and music. Its VR Tetris!\n\nHelpful | 0", "GMo4824May 23 at 2:56 PM\nTetris is my happy place\n\nThis is an awesome version of Tetris! When I realized my flipping the prices changed the music it got even better\n\nHelpful | 0", "MaximuM.JayJun 2 at 10:05 PM\nJeez this is chill\n\nSo zen, so pretty. Tetris meets EDC minus the smell. \n\nHelpful | 0", "rabbitovskyMay 22 at 11:06 PM\nSurreal, Addicting and Emotional\n\nThey knocked it out of the park. I am tempted to buy it again for the PC, but taking it anywhere I like a huge perk.\n\nHelpful | 0", "circlekenJun 6 at 7:17 PM\nGood game very relaxing\n\nI enjoy this game but think price could be lower...\n\nHelpful | 0", "darkcloud117Jul 21 at 10:15 PM\nTetris at it's best...so far.\n\nAwesome awesome awesome..if you're thinking about trying this new way to tetris , do it. Everything about this experience is amazing...I've been a VR user for about a year now and this is probably the best experience I've had yet...I know right tetris wow!!!!! Beautifully executed, hats off to the devs.\n\nHelpful | 0", "Ex_ExMay 28 at 9:42 AM\nLove this version of Tetris\n\nVery immersive. I start plaing and then an hour has magically disappeared\n\nHelpful | 0", "YEETEVERYTHOTMay 19 at 10:32 PM\nI love this game\n\nEver since I got my quest I've been waiting for it to come out, and it's better than expected and I love it so much.\n\nHelpful | 0", "lolroflbbqMay 14 at 10:42 AM\nWow, blew my expectations out ofthewater\n\nI've played Tetris since I was kid and in many different forms. But I have to say this is the coolest and most engaged I've EVER felt playing a Tetris game. The visualizations, the music omg it goes so well with the game. If you like Tetris go buy this now.\n\nHelpful | 39", "OzakiOkotteMay 30 at 12:26 AM\nIt's Tetris\n\nMaybe the hype got to me, but after hearing how amazing this game was for over a year waiting for it to leave Sony and Epic's exclusivity and after hearing how similar it was to Rez, I think I found myself very disappointed by what I ended up receiving. It's just Tetris, with a minor bit of VR depth backgrounds. The actual play field is flat, nothing different about it or the special effects of th blocks that you'd honestly find in any other Tetris game. I didn't find the backgrounds to be that amazing compared to everyone's reactions of them. It's not bad, don't get me wrong. I just don't understand why people have lost their minds of this. I didn't even think the music was memorable, unlike Rez that it's been compared to so much. It's a very modernly styled Tetris. Nothing more, nothing less. Go in with tempered expectations and you may be more impressed.\n\nHelpful | 1", "arczi79May 23 at 10:27 AM\nGreat game.\n\nNice graphics, good sound and very relaxing gameplay. Very good product. My recommendation.\n\nHelpful | 0", "jacob.wulff6 days ago\nFantastic Game\n\nThe whole family loves it. Tetris is my all time favorite fame and playing it in VR with this music and environment is incredible. Highly recommended.\n\nHelpful | 0", "kevink808May 25 at 9:46 PM\nBest version of Tetris yet!\n\nGreat, but not perfect. Some of the music is really indie and not A list material, but its still a great game and a feast for the eyes. Imagine how great it could have been with licensed music!\n\nHelpful | 0", "Crimson.AshuRAMay 28 at 7:40 AM\nAwesome VR experience\n\nIf this does'nt bring a smile to your face Ibdon't know what will\n\nHelpful | 0", "cbrady2kJun 1 at 12:07 AM\nDisappointing at the moment\n\nI've played this on desktop VR, and on that platform it's amazing -- but on the Quest it's so downgraded visually it really does impact the game. What I don't understand is why it's so downgraded - you go and play games like Beat Saber and Pistol Whip and Star Wars and they look amazing. But this game, which doesn't push the limits of anything, is running at a fairly low resolution -- at least compared to desktop. I normally wouldn't care, but the entire appeal of this game is the amazing visuals, it really makes you feel like you're playing something special on desktop. But on the Quest, it's just sort of, well, Tetris -- the same Tetris you've played a million times. That isn't necessarily a bad thing, I like Tetris which is why I bought this, but the downgrade here is extensive, and I don't know why. Hopefully they patch this and improve the resolution and effects so people know why this game was so insanely highly rated on PSVR. But currently, after playing it on the Quest, I now totally understand people saying they don't get why this is special. Also the fact this isn't crossbuy, they want me to buy this again to pay another $30 to play it on my Rift, that is nonsense.\n\nHelpful | 1", "CosmicRatioMay 18 at 10:49 AM\nBreathtaking\n\nThis is an wonderfully transcendent experience. Its really not what I expected, in such an awesome way!\n\nHelpful | 0", "okgoldMay 17 at 12:24 AM\nPoor visuals, moderate gameplay\n\nGame does little to differentiate itself from tryical Tetris. The backgrounds are usually distracting or underwhelming. Game does little to take advantage of vr. The text and menus have been poorly ported and look pixelated compared to other quest games.\n\nHelpful | 4", "CugalMay 30 at 5:13 AM\nAmazing\n\nConsole quality game on the Quest....10 out of 10!\n\nHelpful | 0", "JohnReeseEMay 28 at 3:23 PM\nGreat effects but it gets tiring\n\nFor the price, I expected a bit more from the effects.\n\nHelpful | 1", "cara_amiraJun 5 at 8:51 AM\nToo hard, too scary themes\n\nJust played for a while to realize, how hard it is to play even on easy. The other thing that bothers me even more, is the atmosphere of the game, which I found very scary and disturbing. Seeing the names of the coming levels, I knew this isn't a game for me - too much \"dark side\". Expectations were to play in a lovely nature environments which I know this game also includes, but you would just need to play through all these mystical levels. Very disappointed.. I would like to ask for a refund - game is and will be unistalled for these reasons, even though it otherwise has beautiful graphichs and music. And Tetris. Sigh.. :(\n\nHelpful | 1", "covidnineteenMay 29 at 11:50 PM\nThe Gem\n\nAbsolutely the best experience in my life other than sex.\n\nHelpful | 0", "ducky2020May 28 at 8:04 AM\nCreeeepy!!!\n\nThe designer of this game must of been on acid and from the 60s. The music and sound effects scare me. It's too busy and too distorted for my taste. It's kind like the app Tripp I dont like that one either.\n\nHelpful | 3", "UDontHaveMyNameMay 17 at 7:15 PM\nWow... this is THE way to play Tetris\n\nIf youre on the fence dont hesitate. Now THIS is what im talking about - its great!\n\nHelpful | 0", "BossierSage7786Jun 2 at 6:31 PM\nVery nice\n\nVery nice\n\nHelpful | 0", "Willis-ErsonMay 19 at 10:32 AM\nWow Tetris is going to make so much mone\n\nFall into a world of Tetris. A world of Tetris? Who would of thought?\n\nHelpful | 0", "hypoboxerMay 22 at 4:22 AM\nSuoerb\n\nBeautiful game. One of my all time favorite VR experiences\n\nHelpful | 0", "SpazzyMageeMay 20 at 4:45 PM\nBest Tetris ever created\n\nSo good, its psychedelic. Do yourself a favour and buy it\n\nHelpful | 0", "GOD_DAMJul 25 at 7:07 AM\nAmazing\n\nI saw this game when it came out and I knew I had to have some form of VR so that I could play it.\n\nLet me just say I am not disappointed. This game is pure meditation.\n\nI think my mental health had improved just downloading it.\n\nHelpful | 0", "TakeMeAsUrCourageMay 22 at 11:23 PM\nAmazing!!!\n\nIf you like tetris then your going to love this:)\n\nHelpful | 0", "sagi77May 19 at 9:06 AM\nBeautiful\n\nAll I have to say is that the game is breathtakingly beautiful\n\nHelpful | 0", "hontywMay 14 at 4:50 PM\nYes\n\nYes yes yes\n\nHelpful | 2", "Panic_07May 16 at 3:42 PM\nSuch A Great Game\n\nIf you like Tetris and even if you dont you NEED to pick this game up\n\nHelpful | 1", "CloudTurtle27May 19 at 1:24 AM\nNot the same magical experience\n\nWhen I played Tetris Effect for the first time on pc via oculus link it was a magical experience. I then went on to play it on PSVR, same magic. On the quest, not so much. Don't get me wrong its still a good experience and a decent port, but graphics have been scaled back big time. Some levels don't even feel the same. Audio is still fantastic though and gameplay is smooth. If you have never played TE before and your only option is the quest then buy it, its still a beautiful experience even on the quest. If you have something more powerful to play it on (rift, oculus link, psvr etc) then definitely buy it for that platform.\n\nHelpful | 1", "bryan.schmidtMay 16 at 7:22 PM\nNot bad at all\n\nI was around when the first tetris ever came out and when i got this one it took me back lol graphics are great I just wished they kind of kept it the same as the original in my opinion\n\nHelpful | 1", "DirtDiver419May 28 at 2:54 PM\nVR Tetris is still Tetris\n\nIs it beautiful? Most certainly. Is it immersive? You bet. I actually find it rather relaxing. However, I hardly think its worth the $30 price tag. Its just Tetris with fancy effects. I can only buy this game some many time in my life time.\n\nHelpful | 1", "jon.floyd.334May 17 at 10:02 AM\nOk Tetris\n\nThis game is ok fun with visuals and music but I discovered Tetris originally on game boy and became a master at it. Spent hours learning to flip the pieces and slide them left and right and fill the slots as you hit the bottom. Now this game will NOT let slide left or right to fill the spaces. It goes up and over the space leaving a gap you could have filled. This pisses me off. For everybody else this is probably ok but it seriously affects the scoring. I could achieve a much higher score if you could fill spaced sideways. I jumped at this game when I saw it only to be disappointed because you did not stay true to the original GameBoy Tetris. Every time I play I am reminded that you cannot do what the original game does. This is not the game that Mr. Pazhitnov originally built but have at it. You changed the rules fix this and you get a couple of stars from me. Fix it. Bait and switch for real.\n\nHelpful | 1", "lunt77May 23 at 4:57 AM\nLove it\n\nReally awesome, loads of fun\n\nHelpful | 0", "germdog53May 25 at 3:49 PM\nUnintuitive controls\n\nI did not enjoy this version of Tetris. This may be the worst version of Tetris I have ever played. The controls are horrid and the music doesn't add anything to the Tetris experience. Requesting refund now.\n\nHelpful | 3", "TheJBOSSJun 6 at 12:13 AM\nOk Tetris game v expensive\n\nThis is just Tetris with some music and effects. Very bloody expensive for what it is.\n\nHelpful | 3", "williambwb75May 14 at 11:13 PM\nEpic\n\nMenus a bit clunky but the gameplay makes up for it\n\nHelpful | 3", "sassymom848613May 21 at 7:05 AM\nLove it\n\nVery amazing game\n\nHelpful | 1", "Drokz6Jun 1 at 3:40 PM\n\nAn enjoyable VR version of a classic game. Fun and worth the money.\n\nHelpful | 0", "raymarkableJun 30 at 6:29 PM\nA visual experience that is masterful\n\nHaving played this on PSVR at launch, I always hoped this game would come to a platform that has higher fidelity graphics. This game is beautiful on Oculus, and the gameplay is the best incarnation of Tetris I have experienced. I recommend that you play this wearing headphones, after a few minutes this game becomes more reminiscent of the best rhythm games more than just a puzzle game.\n\nHelpful | 0", "MR-VR_SamMay 14 at 11:53 PM\nHappy Days\n\nSimply the best Tetris now on Quest\n\nHelpful | 1", "NightOwIJun 28 at 10:30 PM\nhighest quality quest experience\n\nI haven't used headphones but still without it is still one of the best put together and best looking Oculus quest experiences. The experience brought me to tears, not because I kept forgetting to blink it was so imerssive. And when I quit the game I actually felt sad to put my headset down which is a dealing a game hasen't given me in a while.\n\nCan't wait to try it with some nice headphones and see just how more imerssive the game is.\n\nHelpful | 0", "getdavemJun 29 at 3:59 PM\nIncredible visual sync with soundtrack\n\nVery clever music sync with gameplay and absolutely stunning graphics. The beat of the music vibrates the controllers and the on screen graphics pulse with the music, with the sound track shifting every 10 rows cleared. Awesome idea and brilliantly executed. And I totally get the reviews of people saying they had emotional tears playing this. With headphones, the music is utterly utterly deep and powerful. Almost tribal. Deserves every award it's received and more.\n\nHelpful | 0", "BeezlebufoMay 18 at 2:44 PM\nTetris\n\nIt gud\n\nHelpful | 1", "MistrylJun 27 at 1:42 PM\nMuch much more than just a VR game...\n\nI've played countless VR games. Some have excited me, some have got my adrenaline pumping, some are just meh. But Tetris Effects, in my view, stands above them all in terms of just sheer immersive wonder. The game of Tetris itself is pretty much what you would expect, after all its Tetris! But the jaw dropping beauty of the worlds you inhabit whilst playing, the pure rhythms and soundscapes that rise and fall, pulsating with your every move is just breathtaking. Absolutely stunning work!\n\nHelpful | 1", "jamiejohn187Jun 27 at 1:43 PM\nTetris has never been so amazing\n\nI never thought I'd need Tetris as a VR game. But a mere 5 minutes into my experience I realised that I had been moved so emotionally that I needed to tell everyone I know about the joys of Tetris Effect in VR. My smile was constant throughout my initial play, and still on every play it remains as such. What a wonderful experience. The development team have pulled out all the stops and created an experience that will live with me for many years to come.\n\nHelpful | 1", "chris.kinnick.0611May 16 at 1:54 PM\n\nA must buy\n\nHelpful | 1", "toddhebert1975May 14 at 9:31 PM\nWow what an awesome twist to this game\n\nWow\n\nHelpful | 1", "covid7722 days ago\nWhoa!\n\nThis is amazing!!!! Great music and graphics, super fun and all around incredible. I love it.\n\nHelpful | 0", "BobbyLight50Jun 6 at 9:05 PM\nBunk\n\nDont waste your money. Neckache. Headache. Not impressive. Would love a refund\n\nHelpful | 3", "Capt_Quint620Jun 21 at 2:39 PM\nI'm impressed (thought it'd be meh)\n\nI love Tetris, watch Tetris on YouTube, but this name has been regurgitated so many times that the bar is set for this to be more than just VR and some flashy images.\n\nIt actually delivered. I admittedly only bought because my wife wanted it, but the 30 dollars stretches well. Lot of modes, unlockables, and I guess you can get the nostalgic classic music with a certain achievement.\n\nSo, there's a lot of content to keep it fresh. Okay. But, I think what makes this cool, aside from flashy VR scenes, is the choreography of sounds and music and images. The buildup of each scene, the unique juxtaposition of shape sounds and actual music, makes this a pretty serene experience. It actually is engrossing and captivating. So, it really is a neat Tetris experience and makes it seem fresh once again.\n\nIt would be nice to see future implementation of battle royale or versus. Or new content. I am not sure if any of that is on the horizon.\n\nWorth a purchase, to you skeptics.\n\nHelpful | 0", "Deano177Jun 20 at 4:10 PM\nThe best game Ive played.\n\nIve played on pc and Xbox for several years and then I got my vr and then this game and it is by far the best game Ive played and it is very fun and very addictive, but one down side if you started by playing on your phone the controls will be a bit wonky at first but once you learn them its a blast.\n\nHelpful | 0", "4TonHammerMay 15 at 7:04 PM\nHad no idea......\n\nI like Tetris. Tetris is ok. Been playing it for over 20 years once in a while. Mostly have played the battle Royale Tetris on the Nintendo switch. Watched some reviews on this. 30+bucks!? Nahhh watched more reviews, read reviews. Ok I'll try it. Usually for VR I play games like Arizona sunshine, shooters, pistol whip, things like that. I had zero expectations for this other then I would try it and probably refund it. No I'm not refunding this. I'm paying every last cent because THIS little gem is absolutely outstanding! Every move u make, every little thing u do does something. The first hour or two I kinda said to myself ya ok oooooo such flare but whatever..... kept playing. Suddenly it's like my brain kicked in and realized your controlling your entire space. It's just absolutely fantastic. The music at first I shake my head at..... but as u go..... it just grows on you and more and more your engrossed in this world of your own doing. Hours and hours will go by. I'm telling you this game is absolutely fantastic, just a superb game. Years ago I liked a game on PSP called luminous or something like that. This is like that, but with VR and the ....... just buy it. Support these guys. The world needs more games like this. It's outstanding. Truly outstanding.\n\nHelpful | 5", "onmymama334Jun 23 at 11:42 PM\nvery comfortable and Addictive\n\nThis game is very relaxing and addictive a must have . Speaking from my POV after a long day of hard work I get myself together. Then its on! propping up my legs up. And letting it take me on a outside of unforgettable experience feel like youre playing in haven.\n\nHelpful | 0", "KittyHall19 days ago\nFredricahall76\n\nGreat graphics and music a good way to relax.\n\nHelpful | 0", "NoelSaJul 29 at 4:31 AM\nYes\n\nFinally. Tetris with more stuff to distract you.\n\nJokes aside, this is art, download it.\n\nHelpful | 0", "darwins.lastMay 15 at 6:00 PM\nAddictive As Always\n\nWell-rendered. Gorgeous and inspiring. Even if Tetris isn't you're thing, this is still amazing to play.\n\nHelpful | 1", "VinziusMay 31 at 2:36 AM\nOkay\n\nGame is good, but not that relaxing (try vr fishing for something relaxing)\n\n-1 for the price (probably more worth 15/20)\n\nHelpful | 1", "SwagcityUSAJun 15 at 10:09 AM\nWow Just Fantastic\n\nI always loved the simplicity and competition of Tetris, the fact that u could always do better would push me to play better and better. So when I saw Tetris effect I knew it was gonna be fun and visually spectacular, but wow it is SOOO much more. The way the levels look, interact, and change is just insane, the music choice and the very cool SFX add SO much to the game, this game isnt just your run of the line basic Tetris it is so much more but it still feels like Tetris, with the way levels are played and just playing the level and experiencing it just opens your mind and really gets u to think without being over whelming and taking your mind off the game itself, one of the best sitting and Atmospheric games I have ever played.\n\nHelpful | 0", "Shifter2001Jun 16 at 6:06 AM\nBest Tetris Experience\n\nI'm very much a Tetris person and love to play the game. However, I always find that the game becomes boring after a few goes at playing. Tetris Effect is probably the first time I've played and this hasn't happened. The combination of the unique music tracks and visuals alongside the gameplay makes a very detailed and beautiful experience that anyone would love. Even if Tetris isn't your strong point, I highly recommend this to you anyway. Easy 5 stars. Well worth the purchase \n\nHelpful | 0", "Bobross513800813 days ago\nReally nice\n\nReally nice\n\nHelpful | 0", "noneedtotalkMay 16 at 1:59 AM\nThe beginner mode is way too difficult\n\nI play dark souls for god sakes and I can't beat the 4th level in Tetris on the easiest difficulty I'm returning this game\n\nHelpful | 5", "lars.bahnerMay 20 at 6:11 PM\nVery disappointing\n\nThere's no VR capability added. Just VR backgrounds added to the same old.\n\nHelpful | 12", "TransJenderGalMay 14 at 10:29 AM\n\nPure brilliance. Just pure VR brilliance. Beautiful, peaceful, challenging. Must buy. Must play. So nice to see this finally available on all headsets!!!\n\nHelpful | 17", "FayettePhantomJun 12 at 5:53 AM\nTetris taken to another level\n\nIve been avidly playing Tetris for as long as I can remember and have had many encounters with the actual Tetris Effect, where your thoughts are patterned around the game. This game exceeded my expectations dramatically, and is now one of my favorite games in my VR library. The only issue Ive ran into is long save periods after completely a level, but it only happens the first time you complete a level. Would highly recommend to anyone who enjoys Tetris or simply has very good visual/spatial awareness\n\nHelpful | 0", "jpsmithdesignMay 14 at 3:15 PM\nExpected a good game...\n\n...but got a breathtaking one. The visuals are stunning, and its an odd mix of calming and pulse racing. I tried this on PC in 2D, but the jump to VR makes this game one which I can see great longevity with.\n\nHelpful | 8", "MkLab1May 22 at 7:46 AM\nSorry... just a tetris... too expensive.\n\nRefunding...\n\nHelpful | 4", "DiggyP89Jul 2 at 7:47 PM\nAmazing game even for 30$\n\nGet a pair of head phones and this game is even better. Youll realize once you play the game it really is an experience. Plus its easy to jump in and out of so it has replayability\n\nHelpful | 0", "Wal_NutJul 2 at 2:41 PM\nReally fun but I have one big problem\n\nThe game is a lot of fun looks amazing and just adds more to the original game but I have on big problem when I try to move the shape to the left of the screen by taping the thumb stick left will go back to were it was to the right when it happens it messes up most of the level I think this may be may controllers fault but right and left both do it so I tried to connect a ps4 controller and a switch pro controller but they are really delayed and when I try to connect thru the app it always says something went wrong please try again  so I dont know what to but besides that the game is so much but frustrating when my controller mess up\n\nHelpful | 0", "mantisaliveJun 8 at 2:17 AM\nStunned\n\nPlayed Tetris on the original Game Boy 20+ years ago non stop. Havent played it again until this version & it has completely blown me away! I thought this would be quite boring, just the same old game. But they have truly made a special game here,it has an incredible feel to it, the music choices are brilliant & somehow it does evoke an emotional response. Not just a game but a really cool experience!!\n\nHelpful | 0", "SheepismMay 14 at 3:53 PM\nIncredible\n\nThis is an amazing game. It's worth the price completely with it's great visuals music sound design and gameplay. With a normal tetris game it takes a while for me to get in the zone but with effect it happened in less then 10 seconds. This is the first vr game to make me cry just buy it please it's the best tetris and I'm normally a purist but this game is too good. And normally I cant play tetris with a dpad or thumbstick but this game is so well designed that I could.\n\nHelpful | 3", "JCC08Jun 5 at 10:57 AM\nWas hesitant to purchase...\n\nNot a fan of mainstream tetris, find it boring and repetitive. However, this VR version has been an amazing stress reliever these past few days.\n\nThe music and visuals really takes your mind off of things. AND I am getting better with practice haha.\n\nThe only thing I recommend for newbies is to adjust the controllers so you dont have the hard drop on an easy-to-hit setting. I was frustrated in the beginning because I accidentally kept hitting the fast drop so I moved it to a different controller.\n\nGreat job to the devs - no complaints, just wish the main menu was a tad bit more user-friendly.\n\nAlso, I know some people have complained that it's not immersive because you cant use your body to manipulate the blocks, but I think VR needs games like these where you can just sit back and relax on the couch (ie Thumper, VR Fishing, & Moss come to mind too). Especially for those of us who use VR as our sole gaming tech.\n\nHelpful | 0", "DrewTKJun 5 at 11:55 PM\nGreat Game, way more than Tetris, a must\n\nThe best games are the ones that you end up playing more than you thought you would, this is a good example. I was unsure weather I wanted this or not, I figured that if I didn't like it I could always return it (within 14 days and less than 2 hours played) but I ended up playing for a good hour on my first play session. I ended up spending 4 of the first 5 hours after my purchase playing it. This game if great because the music makes you want to play that price asap and it works with the beat of the music. My only complaint is the lack of the original Tetris theme, but that makes sense given the style of the game.\n\nHelpful | 1", "PickleProjectJun 5 at 7:28 PM\nBeyond Tetris\n\nIve only played the classic Tetris and some other one I dont remember the name but all I can say is this is just astounding, the visuals are great and the graphics are amazing even for the quest, this game is for anyone, whether youre new to Tetris or an old player, youll love what this game has to offer.\n\nHelpful | 0", "yungessenceMay 20 at 6:13 PM\nAbsolutely stunning\n\nI dont ever write reviews, but this game has just left me in awe. The way the notes from each song on each level are coordinated to the tile movements and the way it sets up the immersion in each fascinating world which changes per level is absolutely amazing. I have spent a countless number of hours playing video games like Im sure most of you have from playstation1 to the 360 and now being on the Vr this has to be in my top 10 games EVER. If youre thinking of getting this just do it its well worth the $30. As far as a Tetris fan I like it but my liking for this app stems from the way it was put together into the beautiful masterpiece it is. Everyone has to experience this!\n\nHelpful | 2", "mdjunia17Jul 10 at 11:11 AM\nNothing like it\n\nI bought this game out of spite for the reviews. Nothing can be that good right? I was wrong it is that good and better.\n\nHelpful | 0", "anthony.morales92Jun 3 at 11:12 PM\nBest game Ive played on VR\n\nProbably a biased review on my part because Ive loved Tetris my whole life but this game is so fun and so addictive, I absolutely love it. This is the most fun Ive ever had playing Tetris absolutely recommend to anyone that loves this classic game, the VR version is not a gimmick, its revolutionary.\n\nHelpful | 0", "alecsteven6May 14 at 7:59 PM\nBreathtaking Tetris Experience\n\nThis game is absolutely incredible. It's the same Tetris that you know and love, but turned up to 11. The music and graphics are awe-inspring. It's the first time I've been ever moved to tears by the sheer beauty of a VR game. If you like Tetris at all, this is an essential game.\n\nHelpful | 3", "m0r73mJul 20 at 8:37 AM\nBelieve the other review\n\nI don't really call games art but this, this masterpiece is art.\n\nHelpful | 0", "NappySlapsMay 14 at 4:40 PM\nMy fastest purchase ever...\n\nShut up and take my money, and thank you for releasing this on the quest , played this on the psvr, so happy I can now take this game with me and in vr! Best thing since Tetris on the Gameboy\n\nHelpful | 6", "Grod2001May 18 at 1:12 AM\nA masterpiece of Gameplay, Sight & Sound\n\nPeople generally tend to dismiss this game, seeing it as another version of Tetris. And from the trailers it's hard to showcase exactly how VR could make this different, but when the entire scenery envelops your vision and you're focused on the gameplay, the vibration on your controllers syncing to every movement you do, and the beat of the song thumping and gradually speeding up to match the Rhythm and flow of the game, you find yourself naturally getting better at the at the game making split-second decisions without a thought just because of how in the zone you are.\nCalling this just another version of tetris is a disservice to everything these developers worked hard to do. they created a spiritual journey in this game, while that might sound silly it's the plain truth. I've been driven to Tears by this game in it's previous release, and it's done so again in this version. If there ever was a game that can embody Euphoria, this is it.\nThe price tag might seem steep, but after you find yourself draining the quest is battery in a single session, you won't doubt that it's worth its price twice over.\nAny visual downgrade from its previous versions are hardly noticeable while playing, the only major problem I would find with this is that the Oculus touch thumbsticks are not really ideal for the Tetris gameplay, they could be a bit sensitive and I found myself accidentally hard dropping every once in awhile. Tetris is more suited for a d-pad, but you can get used to it or use a third-party gamepad. And trust me when I say you'll have plenty to do in this game, so don't worry about it lacking content.\n\nHelpful | 2", "thanatopsis70May 16 at 4:15 PM\nWell worth the price\n\nWhile the Quest version of Tetris Effect doesn't have quite the particle effects of the PC and PSVR versions, it is still great. I have all 3 versions. Now I can easily take it on the go. I never liked Tetris until Tetris Effect came along. With 30 different levels, each with its own song/soundscape and graphics, it doesn't get old. It is mesmerizing, addicting, and oddly soothing. They did a really good job with the Quest port. Watching the demo on a flat screen doesn't do it justice.\n\nHelpful | 2", "flippababyMay 17 at 8:20 AM\nTriiiiipy....\n\nLove this! Have it on PSVR, loved it, but rarely played it because I couldnt be bothered to set-up the psvr. When I saw it was available on the quest, I purchased it again.\nIts just brilliant. Tough to explain, but it has a meditative effect on me. It literally makes me feel like Ive been spirited away. It has environments that you dont even get close to in real-life (which to me, is what VR should be all about!).\nEach level is so, so different from the last - and looks beautiful/cosmic ;)\nI think it was slightly more expensive on the psvr (as far as I can recall) - but to me its well worth the price - but be warned... once youre in this addictive and beautiful world - it can be quite a rude awaking to come back to the real world!\nSo cool on the quest! :)\n\nHelpful | 2", "Aleeab3678Jun 1 at 6:36 AM\nWorth full price.\n\nI bought this on epic games store a few weeks ago at discount and played via link initially. It's so good that I couldn't not have it available in a more mobile setting so I also bought it full price on the quest store. Worth every penny. Whether you're new to tetris or not it's a marvel and makes an old game feel fresh.\n\nHelpful | 0", "KGTATTOOMay 18 at 12:48 AM\nMeditative state\n\nThis is just beautiful. The music and visuals are spot on! Your movements in the game create the music and atmosphere! Its so zen and gripping at the same time.\nIts truly an emotional experience and its nice to have a vr game where youre not trying to be killed all the time. \n\nHelpful | 2", "justin.brouwer.58May 14 at 10:14 AM\nBest tetris!\n\nGreat game! I have it on the playstation and it is\nabsolutely an amazing game! Must buy for tetris lovers\n\nHelpful | 15", "NatesaninjaMay 30 at 4:45 PM\nMeh.... it tetris\n\nNothing really blew me away its tetris\n\nHelpful | 1", "TravisGernandJul 6 at 5:08 PM\n\nIf you enjoy TETRIS you'll enjoy the hell out of this game. As for me I am very satisfied with my purchase.\n\nHelpful | 0", "ThatGreenGuyMay 26 at 10:42 AM\nYet another amazed user.\n\nI've read some 5-star reviews as well as 1-star reviews. I have to say that the gameplay is just Tetris, but this game is about visuals. Tetris knows what it does right, which is the gameplay. The visuals, however, are so good that I litterally started to cry because I forgot to blink. This is definitely a must-buy for anyone that wants a relaxing and completely immersive game.\n\nHelpful | 1", "Wolfy_WhitefoxMay 26 at 1:19 PM\nBest game ever\n\nThis was and still is the best game I bought to relax i love it with all my heart, except when I was streaming on Facebook I got a copyright strike for Sony multimedia entertainment by Britains got talent. the developer of the game developer responded to me fairly quickly with saying they I was allowed to stream the game I even sent pictures on my wall and message to Facebook and oculus I was easily scared if I might be banned due to I suffer from ptsd but when I played this game for the first time as I was streaming i was crying as it touched my heart deeply as It made me see deeper in the geometry of life and even I tho I got very scared for my livestream this was a silly experience thank you for making such a beautiful game and available on the oculus quest\n\nHelpful | 0", "DsDogmanMay 23 at 12:21 AM\nPlease add the original music\n\nMost of the new songs are awful. I just want the classic Tetris theme song to play Tetris.\n\nHelpful | 1", "Liamsquirrell21May 22 at 7:24 AM\nUnbelievably endulging\n\nThis game releasing was the only reason i pulled my quest off the shelf. I purchased on the psvr and fell in love. Unfortunately, the game crashed on my ps4 and haven't been able to play it since. Now that this is out, i haven't put my quest down. You sit and play a session and before you realise, hours have gone by. Honestly, one of the greatest experiences and greatest purchases I've ever made.\n\nHelpful | 1", "b12landonMay 14 at 8:36 PM\n4 stars for tetris?\n\nYes I give this game a 4 star rating. The gameplay well its Tetris there it is perfection for a simple game. I am very impressed with the graphics although some effects can sometimes look cheap and slightly take you out of the emersion. The only other problem O have is the controls if you are using a gamepad. On some occasions on the playstation 4 version there would be some instances where the controls would \"lag\" to where the input wouldn't be recognized causing you to misplace the piece that is in play. This problem pursists in this port for both game pad and touch controller. If you are using a gamepad wirlessly than expect a much larger degree of lag compared to a wired or touch controller experience.\n\nHelpful | 4", "NinjaChurchJul 11 at 9:26 PM\nFantastic Tetris Experience\n\nEngaging modes with excellent presentation.\n\nHelpful | 0", "DonskibearMay 29 at 4:02 PM\nWow Tetris on acid :)\n\nStunning and addictive and Christine and the Queens soundtrack blew me away. I am the worlds worse Tetris player and yet after some practice I am managing to work my way through the journey. After VR Fishing this is now my second go to stress buster.\n\nHelpful | 0", "crashedcowufoJun 12 at 10:14 PM\nTetris, in vr\n\nThat's it. It's just tetris in VR. If you think its anything more than, your mistaken. But that doesn't mean its bad, in fact its way more immersive than regular tetris, and the songs are really good. My one major \"criticism\" is that its hard to enjoy your surroundings when I'm focusing on not losing in tetris.\n\nHelpful | 1", "2BcarefreeJul 9 at 11:28 AM\nLove it!!!\n\nTetris on steroids!! I like the music with it!\n\nHelpful | 0", "Kye18282May 19 at 8:28 PM\nThis is just amazing!\n\nThis game is just.. incredible! The music and effects amaze me and it is also very relaxing! I love this game so much! Sadly, there is one thing that kinda annoys me. When using a XBOX controller, you can't use the second joystick to rotate the blocks. If you try setting your key binds with the second joystick, it will give you a error sound. I don't know why. Maybe the dev's will change that. Anyways, great game! If you are thinking of buying this game, it is definitely worth the money!\n\nHelpful | 1", "BLAPGamingJul 4 at 2:20 AM\nDon't Overlook This One\n\nAbsolutely phenomenal experience. Most relaxation I've gotten in a while.\n\nHelpful | 0", "thetallsiMay 17 at 3:22 PM\nmind quietening & beautiful\n\nA pleasant surprise! I happily admit I went in a little\nskeptical. How good can an immersive Tetris VR experience really be? haha how wrong i was. The music is not to my usual tastes at all but i soon got over that. I can see how some Napalm death or Dj hell would not work here! Credit to all involved in this beautiful project! Thank you!\n\nHelpful | 0", "Marcel2020May 18 at 11:40 AM\nMarvelous\n\nI used to play Tetris over the years on several devices, starting with a Gameboy. I was very curious how Tetris on the Quest would be/ I've read many reviews about it on internet, and was mixed in my opinion, but decided to give it a try. I can be very short, this is the most overwhelming experience on the Oculus Quest for me, and maybe overall on my gaming life (starting with an Atari 2600 in 1978 ;-) .\nThe way to play is superb, but the audio and visual aspect adds soooo much to it. At some point I felt really emotional. I hope that there will come more games like to this, it gives a total new dimension to VR Gaming\n\nHelpful | 0", "worpt1May 17 at 9:34 AM\nAmazing\n\nWell, there's the aspect of original terms where you put the shapes together, then there's about 50 other aspects. The turns of every shape are in tune with the music of the game. Line clears change the environment and sounds. The music, while nothing I'd ever seek out, fits and is nice to listen to. The visuals are amazing.\nAfter I beat journey mode I used theater mode to just watch the show, still amazing.\nI do wish there was some element of multi-player, but I'd still buy this game again knowing what I do now.\n\nHelpful | 1", "OlliebeaniMay 17 at 1:33 PM\nSimply beautiful\n\nWords cannot describe the amazing ness and the beauty of this game the graphics are perhaps the best on quest and this is no ordinary Tetris game this is a game where you lose yourself so deep that you forget about everything ever this game solves the worlds problems it is amazing and a must have it tells a story so in depth and complex through the songs and tetrominoes that is unforgettable stop reading this review and spend the 22.99 on it this game proves that vr doesnt have to be about violence death and rage all the time and we can just have a relaxing game that is enjoyable BUY IT NOW the only thing this game could benefit from is a Tetris 99 style mode and a 1v1 mode but it is a perfect game\n\nHelpful | 1", "t-corleoneMay 17 at 8:28 AM\nIf youre on the fence...\n\nJust get it. If you think theres even a chance this game is for you, its pretty certain it is. At first I thought it may be a tad expensive, but the feeling this game gives is honestly worth it, and because the gameplay is perfection, its going to get lots of continuous use. The way it connects with the music and visuals got me in a way Id always wanted with Rez on PSVR, but never did. People would talk about an emotional experience and with this game I kinda get it. Just fantastic.\n\nHelpful | 0", "theoryofeverywhereMay 17 at 1:54 PM\nTranscendent\n\nIts crazy to think that what has quickly become one of my favorite games in VR is, at least on the surface, a 30 year old game with a fancy screensaver. In reality, it is so much more though. While the gameplay really is, for the most part, just Tetris, the way the music and visuals change as you move the tetrominos and progress through the levels is absolutely hypnotic and utterly captivating. This is a game you just have to experience, preferably with no distractions and some great headphones. This not a typical VR game; no 6DOF freedom or hand movements. Its just you and one of the best games ever in a totally engrossing and magical experience.\n\nHelpful | 0", "realshamburglarMay 14 at 2:49 PM\nTranscendent\n\nIts Tetris but in the style of Tetsuya Mizuguchis games like Lumines and Rez. If that sounds appealing to you it doesnt get much better than this for that kind of thing. Its beautiful. Buy it and disappear for a little while.\n\nHelpful | 2", "alberto.labarberaMay 17 at 1:54 AM\nWhere's the multiplayer online?\n\nIt is Tetris but not the usual one. There's interaction with music and the controllers vibrate according to game action and music. All is superb but where the heck is the online multiplayer option? There is a chart but this is just not enough. Coming from Tetris 99 (switch) it feels like this is a HUGE limitation. Playing against other human beings is the fun part. Please implement online features.\n\nHelpful | 3", "shanandmegJun 20 at 5:44 PM\nAmazing\n\nAbsolutely worth it- the visuals and experience are breathtaking. This game will take you away into an amazing world and levels.\n\nHelpful | 0", "mase123987May 16 at 6:54 PM\nTetris with mood!\n\nI'm not going to say anything new that other reviewers that I haven't mentioned already but this game is just awesome. It is easily my favorite puzzle game in years. I never thought that a 2D tetris game would be awesome in VR but it is! Music and visuals are absolutely top notch. I was hesitant on paying $30 for a Tetris but it is 100% worth it!\n\nHelpful | 0", "Dbix11May 16 at 4:13 PM\nJust feels right\n\nThe aesthetic, feedback just feel so right. There was a podcast that featured how tetris is the perfect game for humans because it fulfills us at some deep level.\n\nThis experience allows you to go even deeper into that feeling.\n\nSome music isn't necessarily for me but it's not too excessive, looking forward to unlocking more and maybe down the road side quest will feature custom maps and tunes.\n\nHelpful | 0", "NobecauseyesMay 17 at 2:30 PM\nA masterpiece but could be better\n\nFirst I just want to say that I really enjoyed this game it was amazing how the gameplay affect the music and environment but I wish there was more. I still recommend it but I would love if there was some future dlc content with more stages and songs. I would gladly pay extra money for that.\n\nHelpful | 1", "Baldyboy007May 14 at 11:13 AM\nGreat surprise!!\n\nOne of my all time favourite PSVR game's was such a great surprise to see this today! No sleep for me tonight!!\n\nHelpful | 6", "LastActionGameHeroMay 15 at 10:49 AM\nGreat port - minor letdown on controls\n\nThis is a great port of Tetris Effect - everything that you expect is here albeit with minor graphical downgrades which do not hinder the great gameplay.\nHowever with all the praise comes a hardware limitation - the precise d-pad control is now replaced with the Oculus touch controllers that are sometimes a tad too sensitive and get you sometimes out of the \"flow\".\nStill a huge recommendation for this masterpiece.\n\nHelpful | 0", "littleone501Jun 2 at 7:53 AM\nTetris\n\nI was hesitant in purchasing this game. But am glad I did. You really feel like your in a different world all together. Its amazing! I kind of get bored on the Tetrus but this brings a whole new aspect to the game.\n\nHelpful | 0", "TampaDudeMay 15 at 1:17 PM\nMezmorizing\n\nI had to finally come out of lurk mode and write a review. I have only played a few levels in practice mode so far, but I am blown away. After a few levels I noticed that my movements were actually adding to the soundtrack of the game. The music and game play are relaxing. Thank you for this game, I have been waiting for a game like this. I am hoping for some new levels and music tracks in future releases. My hats off to the devs.\n\nHelpful | 0", "TriquehMay 15 at 4:55 PM\nI have no Words Other Than Perfect\n\nThis is by far the best Oculus Quest game Ive purchased so far. I grew up loving Tetris and I have to say this game is extremely satisfying. Now Ive read reviews and before you buy the game, the music is kind of different so Id look it up and see for yourself if you like it. That being said I personally love the music in this game. Its definitely different but Im a fan of it. I love the style of this game and if you want a different take on a classic game I highly recommend this game!\n\nHelpful | 0", "dvwalkerMay 15 at 1:21 PM\nVibing\n\nI wanted tetris effect when it came out earlier, but I didnt have anything to play it on. I saw it was out for Oculus and immediately bought it. I had been told the graphics were reduced, but I couldnt really tell. The music and gameplay are amazing. The controls are all little hard to get used to, but after an hour or two I was going along just fine. An amazing game.\n\nHelpful | 0", "mcpishMay 16 at 1:56 AM\nFantastic\n\nI'm really happy with this. I was on the fence about it but decided to give it a go. It's the kind of spaced-out/LSD-trip vibe I'd been hoping to find on Quest. It helps if you're into minimal electronic music (I am) and the associated imagery/culture of that whole scene. If so, you'll get what this game is trying to do (and succeeds) by being the sort of trance-inducing/hallucinogenic experience. Every time you move a piece around or rotate it you're essentially composing a layer of the background music that's unique each time. It's pretty amazing that it always sounds good (always in key), and that's a big part of the appeal. There's actually more to the new mechanics as it's now possible to score even more than a Tetris at a time (Octris, and even higher). Using the new mechanic adds a new layer of strategy to classic Tetris. Highly Recommended\n\nHelpful | 1", "aegis2kMay 16 at 4:31 AM\nOne of the best games of all time\n\nTetris Effect is simply the best iteration of the classic game. Its controls, mechanics, the way it feels is just perfection. There have been several attempts of updating old games into a modern era and few manage to become better, in fact is usually the oposite. This game does it, it becomes better in every way while remaining pure to its simple essence. This is Tetris dam! The VR is top notch, it immerses you in a transe state where you sit down to play and time disappears. Seriously, first time I sat down and could not believe I was there 2 hours. Gameplay is a great combination of Zen and excitement. You release endorphins and adrenaline at the same time, like during love making! Yes, I said it: Tetris Effect is as good as sex!\n\nOn the Quest is even better than all previous versions because of the versatility of it. The Gameboy Tetris was a smash hit cause of the same reason, it was easy to pick and play anywhere anytime. This is the new modern equivalent. Sure, there are people who stops to count how many particles there are on the screen and say with a dumb voice tha PC varsion haz 357,421 particklez on screen and this haz 318,911 but these people dont get it  you get the full experience here: the music, the feel, the perfect controls, the magical trip.\n\nBuy this game. Ps: for the record I only played this game with a game pad connected. Cant be sure of the quest controller here.\n\nHelpful | 0", "sfex3championMay 16 at 8:21 AM\nJUST RELAX AND TETRIS EFFECT!\n\nThis is a GOD tier VR title get it now!\n\nYes this game is absolutely amazing a mesmerizing experience played it to death on the psvr and then played it to death on pcvr. Now it's available on the go this is the best zone out game ever made. Just relax and tetris effect this game is phenomenonal.\n\nHelpful | 0", "TheMAXXoutMay 14 at 7:49 PM\nTetris Fantasy\n\nI was so envious of the PlayStation VR version of this game and I never thought I would see it on Oculus Quest. Then suddenly I see it in the store and without hesitation I purchased it. Worth every penny of my impulse buy. Great graphics and amazing sound and music. This is truly an experience for any fan of Tetris. I thought a game controller was necessary, but the Oculus controls make it fun to dance around with. Lots of fun.\n\nHelpful | 1", "AnimeSageMay 14 at 9:12 PM\nOMG!!! ITS ON THE QUEST TOO!?!?\n\nFull disclosure: Im not a Tetris fan, Im an RPG fan. Its one of the first games I played as a child and it gets boring really fast. But then I played Tetris Effect on the PS4 and had my mind blown.\n\nIm a musician by trade and the mix of interactive, mood altering music, gameplay graphics, and the Tetris game itself takes you to an amazing place. I havent even played it on the Quest yet and I can recommend it because the experience will DEFINITELY be better here than the PS4 because was a GREAT experience there.\n\nTotally worth the $30; I would have paid $40. If its on sale, immediately snatch it up.\n\nTLDR Its Tetris...but modernized with amazing, interactive music that will make you want to play more JUST to hear the entire soundtrack.\n\nHelpful | 1", "FygarMay 14 at 7:53 PM\nTranscendent\n\nWho would have thought Tetris would be the thing keeping me in my headset for hours? An absolutely transcendent zen experience, plus all the classic modes you'd expect and leaderboards. THE definitive Tetris. My only problem at all is there's a bug on the leaderboards for Sprint where they're displayed backwards, and longer times are ranked higher.\n\nHelpful | 1", "nastyjmanMay 14 at 7:54 PM\nA downgrade from PCVR, but worth it!\n\nI've played the PCVR version, and it doesn't get much play time since I enjoy FPS on the Rift. So Tetris Effect gets snubbed everytime I go into PCVR.\n\nSo when Tetris Effect is finally released in Quest, I didn't think twice. This game is fit for the mobility and ease of the Quest. Despite the downgraded visuals, it is secondary to the auditory trip and the meditative flow of Tetris Effect.\n\nIt is a great addition to a chill rhythm game where you just sit and relax.\n\nGet it. You won't regret it.\n\nHelpful | 1", "Stackingchips74May 15 at 7:14 AM\nWow dont think about it just buy it!\n\nWow. I didnt expect what I got by the time I finished playing I had tears on my face. This game punched me in the guts and it was amazing! The visuals, music and gameplay are outstanding! You can even play in relaxing game mode where you just play for fun but can enjoy the environment. I was fully immersed with headphones on in another world. Im 45 and I played the original Tetris on the original game boy this new release is like that on STEROIDSx10! I bough let this because the reviews said I had to and I have Zero regrets. With the 14 day return policy how could you not at least try it?? A+! One of my top games for the Quest with so much replay value. Watch some videos and see what you can have its amazing!\n\nHelpful | 1", "GaryGoodJobMay 15 at 12:06 AM\nRandom surprise release\n\nI literally just checked the store the other day after I got my Quest to see if this was here and was bummed it wasnt. And now it is! Had the game for PSVR and its amazing. Its the most chill experience ever. The way the blocks turn to the beat of the music with the effects flying around you... Its awesome and a must buy.\n\nHelpful | 1", "ScaredyCatGamingJun 24 at 4:39 PM\nAmazing and trippy experience\n\nIf you love Tetris or good music or trippy visual or non of those this is the game for you.\n\nHelpful | 0", "caley.phillipsJun 27 at 8:32 PM\nAlmost perfect\n\nNeeds to support gamepad better due to tetris needing refined controls, also why does this need tracking? Please emae trackerless and thr ability to reposition the screen so I can play in bed!\n\nHelpful | 0", "VioletGravesJun 8 at 12:46 PM\nMind Blown\n\nThis game is a work of art. A unique experience with every single move. A soundtrack that joyfully plays with you. Sublime. Intense. Delightful. The artistry is wondrous.\n\nHelpful | 0", "gmillardMay 16 at 2:21 AM\nAmazing update to a classic game\n\nLoved Tetris on the original Gameboy way too many years ago but the 22 price tag of this 21st century version initially held me back. Bought it last night and enjoyed four hours of amazing gameplay, sprinkled with nostalgic memories of link cables with friends and Lumins on PSP. Awesome.\n\nHelpful | 0", "JamescsmithMay 16 at 6:12 AM\nGreat way to experience flow\n\nYou get in the zone and survive seemingly impossible situations. You fingers react faster than you can think and it actually works out. (Most of the time). The music and effects go well with the gameplay to help you zone out. I have always loved Tetris is this is my new favorite version.\n\nHelpful | 0", "craigbritMay 16 at 3:22 PM\nStunning Tetris\n\njust the soundtrack alone is beautiful the visuals are playing Tetris is amazing most of all I quite enjoyed playing it and it was well worth the  you want to look at things but you're too busy playing with the tetris and then you get to glance at big giant whale next to you lol\n\nHelpful | 0", "VascadeMay 15 at 11:27 AM\nIts an Amazing Game!\n\nThis game quickly became my favorite! The way the music blends with the visuals just puts you in the \"zone\". Its tricky to play fast with the touch controllers, so I recommend using a separate wireless controller.\nIts an amazing game and definitely worth your time!\n\nHelpful | 0", "BDogg1024May 16 at 9:04 AM\nSo Relaxing\n\nVisually stunning. Pretty cool chill music. Its just a relaxing and calming game. In fact, I like the visual mode better than game mode. You can choose the type of experience you want have depending on you mood. If you liked Tetris before, youll love this game.\n\nHelpful | 0", "Lukasz_TJun 3 at 3:55 PM\nBrings Back A lot OF Memories\n\nThe Effects look amazing, just started playing it :) The Developers did amazing job. I love this game. You need two controllers for this game that came with Oculus Quest\n\nHelpful | 0", "andrelosierMay 17 at 1:58 AM\nMind blown, nuff said...\n\nAs an older player, this appealed to me but I wasnt expecting this masterpiece. I thought it was a bit more expensive than normal for a game I have played under dozens of different formats.... but not like this! Just wonderful, I am happy I took a chance.\n\nHelpful | 0", "Alabar3000May 15 at 5:06 PM\nSpectacular trip but short\n\nTetris Effect is a wonderfully visual game and offers amazing audio alongside it.\n\nFor the mostpart your focus will be on the board so the reduced resolution of the elements isnt something you notice much however thin lines like that of text or some of the environments is pretty hard hit, looking rather grainy.\n\nThe gamelength of the journey mode, which takes you through all the different stages will take about 2 hours.\n\nAs for replay value, its tetris. If you like to play tetris, this game is good for short, relaxing play sessions while seated.\n\nI recommend this game if you are content with playing many many games of tetris. If you aren't the biggest fan of tetris, maybe wait till this is on sale.\n\nHelpful | 2", "atellez08May 17 at 8:09 PM\nMasterpiece\n\nI've been longing for this game to come to.the quest since I tried it in PSVR and is as amazing if not more than I expected. I love the music and effects generation. It is a truly wonderful experience, be sure to use headphones to enjoy it fully.\n\nHelpful | 0", "JeywigMay 30 at 7:54 AM\nPSVR USER\n\nI will get to the point...this is fun and still has the magic of the other vr versions but it is somewhat toned down . It doesnt pop and dazzle like the other versions but if you never played those versions this is more than serviceable. The backgrounds arent as captivating because it lacks the extra effects that previous users may be accustomed to. Still, that didnt ruin my excitement or enjoyment of this iteration. Portability is the key here because what good is a great game if you never play it? I loved the psvr version but I stopped playing it due to the setup process....with the quest version I may actually be able to sink hours into it now. I wont overhype this...its a great, trippy experience and worthy of your consideration.\n\nAgain, I am tempted to do a rap up on this one if I can capture quality footage and find time to create it:\n\nhttps://youtu.be/QoYkKgC2_M8\n\nHelpful | 1", "Cryptic_DiamondMay 14 at 12:01 PM\nCouldnt ask for better\n\nI dont have a PlayStation, so I couldnt play Tetris Effect, but when I heard this was on Oculus, I couldnt wait to buy it. The experience is great, gameplay is good, and if you are a die hard Tetris fan, I think you would be pleased with this game\n\nHelpful | 0", "NachoGuyMay 20 at 3:18 PM\nTetris Love Letter\n\nI love playing Tetris and absolutely zoning out to the feeling of organization. Tetris Effect brings that feeling to life and gives an experience of absolute relaxation, focus, exc. Made the Tetris experience that much better.\n\nHelpful | 0", "SpikedAsp47Jun 16 at 2:00 AM\nExcellent\n\nI'm a big tetris fan and this is such a great game, takes me away from everything, everytime\n\nHelpful | 0", "thechrishurstMay 14 at 7:00 PM\nAbsolutely beautiful\n\nI had this game hyped for me and tried to temper my expectations, but honestly it deserves the praise. Beautiful, polished, extremely relaxing. If you like immersive psychedelic games and can get hooked on Tetris, this is an easy recommendation for me.\n\nHelpful | 0", "scertelMay 22 at 11:08 AM\nAstonishing!\n\nIve been wanting to play this game for so long it may have been a near two year wait, but it was worth it. This is both Tetris and VR perfection. Also is 10 dollars cheaper on quests o thats another plus.\n\nHelpful | 0", "PinkSaberMay 15 at 3:09 PM\nNo 3Dof mode\n\nAn absolute amazing game which unfortunately forces you to play in 6dof mode, so no playing in the dark in bed or other dark environments, this would be an amazing addition especially for a game which doesn't really need positional tracking.\n\nHelpful | 1", "DevintherealistMay 31 at 1:18 AM\nAmazing game so far\n\nI've gotten to try a few of the levels, and I must say I love the musical atmosphere along the visualizer. If and when I full play this game to the end or however long I play it. I will try and post a more thoughtful, worded out post about how I feel about this so far amazing game.\n\nHelpful | 0", "cantennaMay 14 at 8:27 PM\n......\n\n(I really like my Quest.....and now a little bit more)\n\nHard to put into words this one... It's such a beautiful game in so many ways...\n\nI reckon if I were to die, go to Heaven and then fancy a game if Tetris this would be it! Wait... What!?\n\nHelpful | 1", "garlicloafMay 14 at 11:55 AM\n\nlit\n\nHelpful | 9", "joefro92Jun 21 at 3:33 PM\nTetris 2.0\n\nFirst game bought on my Quest. Highly recommended!\n\nHelpful | 0", "MythicalwolfMay 18 at 4:31 PM\nLOVE THIS GAME!!!!!!!\n\nThe art in this game is fantastic and mix music with it that just makes it even better. Also I messed up a couple of times because I was looking at the beautiful scenes but this is definitely worth it for the money\n\nHelpful | 0", "TwiflyJun 7 at 3:54 AM\nI usually dont like Tetris\n\nI never really cared to much for Tetris until I played this game its just the best way you can play it in my opinion\n\nHelpful | 0", "Dadof562May 25 at 7:23 AM\nFun Tetris Experience\n\n1st of all you really should enjoy tetris if you are going to spend $30 on this game. Because essentially this is just a tetris game with some very attractive visuals and an excellent soundtrack. Others have commented on the graphics not being as good as other versions but I have not played them and was impressed with the environments I have seen so far. There is only one flaw that I have encountered but it is a significant 1 in my opinion. It much too easy to flick the thumb stick upward and have the block positioned in a space where you did not want it. This is so frustrating when it prevent you from Completing a level you might have otherwise. I wish there was an option to turn off the instant drop because it really is not necessary to enjoy the game.\n\nHelpful | 0", "DosickJun 23 at 8:24 PM\n\nThe music is A1. Love this game\n\nHelpful | 0", "Azazel08May 14 at 9:08 PM\nSo many wonderful Tetris modes\n\nThis game will put you in a Tetris flow state like no other. It looks, sounds and plays beautiful. I absolutely love having this on Quest. What a great way to relax on my lunch break and go back to work refreshed and ready.\n\nHelpful | 1", "MicoreplsMay 14 at 10:43 PM\nI am so happy now!\n\nI don't think I've ever run to my quest so fast when I saw the notification that this game was out. To no surprise it doesn't look as good as the psvr version but still dang good and well worth the money for any Tetris fan.\n\nHelpful | 1", "jstarrdewarMay 23 at 1:15 AM\nTranscendent\n\nReally beautiful. Wonderful soundscape. You have to focus so much on the blocks that it doesnt seem like you are losing too much value from the lower graphical fidelity on Quest.\n\nHelpful | 0", "quaireMay 14 at 10:29 PM\nAwesome game\n\nThis game its a work of art, its so wonderful, with superb images, amazing colors, relaxing music.\nI have been on it for 7 hours straight, and I think Im going for more.\nI have done all the levels in one shoot\n\nHelpful | 0", "guillermotJun 21 at 8:55 AM\nGreat app\n\nRelaxing but challenging fun\n\nHelpful | 0", "EnekoNekobanMay 17 at 2:05 PM\nBest Tetris\n\nControls take a bit getting used to but otherwise its a nice port! Expect graphics quality to be a little lower but its still amazing to have available!\n\nHeadphones most definitely recommended.\n\nHelpful | 0", "DelEnterJun 24 at 5:58 AM\nTetris effect\n\nBest bed game\n\nHelpful | 0", "D4NJ4Jun 29 at 6:48 PM\nBest Tetris version by far\n\nOnly one star deducted for high price. Ive bought this game twice though, once here and on PSVR.\n\nHelpful | 0", "sheila.m.eschenbachMay 22 at 12:16 PM\nWorth the money\n\nI purchased several apps off the oculus store but this one has kept my attention for hours now. It's highly addicting, and relaxing! Worth checking out in my opinion!\n\nHelpful | 0", "Sterben420May 14 at 4:14 PM\nWhy are you looking at the reviews\n\nThis game is awesome the soundtrack is breathtaking, the gameplay is as smooth as ever and the visuals are absolutely stunning\n\nHelpful | 1", "buffster69May 31 at 8:42 PM\nSo far so good\n\nOnly played for s little while so far bit is pretty darn amazing. I like how everything is linked together. Pushing a button to change aspect of the piece affects the music and lights and things jump out at you. It is pretty amazing\n\nHelpful | 0", "mattboomMay 17 at 12:29 PM\nFun for the immersion levels\n\nThe reason to buy this version of Tetris is for the graphics, sounds and whole immersion and how it all fits along with you placing the pieces. Its got me hooked, and the levels keep me coming back to see what the theme of the next one will be.\nI assume Ill get tired of it after a while, but its always going to be a fun game to start playing when you dont want to move around, and you just want to sit and play a pretty mindless game and immerse yourself in VR.\n\nHelpful | 0", "BlTEYMay 15 at 3:32 AM\nAlmost bought it on Epic store.\n\nI was sooooo close to buying it on Epic store as it was an exclusive, so happy it was ported to Quest.\nLaunched the game, and was just blown away. I never thought someone could do tetris this good.\n\nHelpful | 0", "DJandyrMay 14 at 1:45 PM\nAmazing!\n\nI loved tetris on the game boy but the price of this game put me off......but I couldn't be more wrong. Its a amazing experience and worth every penny! Definitely a must buy for quest owners\n\nHelpful | 1", "CoopthenintendonerdMay 26 at 1:10 PM\namazing.\n\neven though i only played for 20 minutes, i was constantly asking myself \"did i take drugs?\"\n\none of my top 5 games ever honestly\n\nHelpful | 0", "vincenzothegreatMay 17 at 1:54 PM\nWow, it's as if you discovered God!!!\n\nI don't know how else to say this, but whenbthd music and surprising graphics, you feel like you transcended to another dimension, this was my first review for any game.\n\nHelpful | 1", "thatsmytrunksMay 14 at 1:20 PM\nMeditative Tetris in VR\n\nTetris Effect is one of the best ways to experience Tetris, and VR is the best way to experience Tetris Effect.\n\nAlso you can pair a gamepad to your quest to play with more precision.\n\nHelpful | 0", "dave.loveless.9May 18 at 1:06 PM\nPerfect Tetris Game\n\nWant to chill and play? Want to set up a fast paced game? Whatever type of Tetris you want to play....you can! Great visuals, music, gameplay....just fantastic!\n\nHelpful | 0", "HarvizalMay 14 at 3:30 PM\nAnother fantastic retro game!\n\nAmazing! Yes, its Tetris, but wow!! The music, the ambience is just perfect!\n\nI adjusted the controller setup to my liking & lost an hour or so straight away! So immersive.\n\nEnjoy!\n\nHelpful | 1", "Sportsrock03May 14 at 1:49 PM\nBest way to experience Tetris\n\nAbsolutely amazing control and sound wise. Definitely should be on your must buy list. Do recommend using a Xbox or PS4 blue tooth controller just because its easier to play with.\n\nHelpful | 1", "the_3kMay 15 at 1:14 PM\nBlew my mind\n\nAmazing game and sound design with more then enough content to keep you coming back. $30 is a lot for a VR game and especially a Tetris game but I think its well worth it.\n\nHelpful | 0", "xxvauprisingxxMay 20 at 7:56 AM\nGameplay\\Graphics\n\nRuns extremely well gameplay & graphics are amazing never thought in my lifetime I would be able to be virtually immersed in the Tetris world \n\nHelpful | 0", "NelsonakamentorMay 26 at 8:48 PM\nAmazing !!!\n\nIm not gonna wrote a long review because its not needed. Pure Zen ..Im shocked how good Tetris feels now!!\n\nHelpful | 0", "PosidenxnMay 17 at 1:47 PM\nA classic made better\n\nThis game is an all time favorite of mine and it just keeps on getting better and betterZ nothing bad to say about this game at all! Amazing with a new twist\n\nHelpful | 0", "mirthy-pMay 25 at 7:18 PM\nQuintessential Tetris, here\n\nNo other version compares. Youll love being whisked about various VR scenes that are in sync with your play.\n\nHelpful | 0", "boltsbearsjoshJun 6 at 10:30 PM\nJust awesome\n\nMy new favorite game on Quest. Sublime and surreal.\n\nHelpful | 0", "j70610May 14 at 6:51 PM\nThe best oculus quest game ever\n\nI was a bit skeptical about this game but when I played it I was super impressed I not a huge fan of Tetris but all of the special effects made It fun for everyone.\n\nHelpful | 1", "RashadGloverMay 31 at 6:16 PM\nThe best VR game ever!\n\nIm so at happy i bought this. Im at peace playing. Worth every penny.\n\nHelpful | 0", "anthonshMay 29 at 11:54 AM\nI'm very impressed!\n\nBetter than I expected. Each level progresses through a set of story-like animations.\n\nHelpful | 0", "Doc-RevelatorMay 16 at 10:59 AM\nThe Ultimate Trip\n\nA visionary take on a classic game. The perfect version of Tetris, and mind-blowing in VR. The Quest version is beautifully done, and worth the money.\n\nHelpful | 0", "XanderBossMay 14 at 9:35 PM\nMost calming game yet...\n\nBefore I go to bed, I play a round or two of this game. Makes me fall asleep 10 times faster. With all the different levels and areas, definitely worth a buy\n\nHelpful | 0", "kelvincmillsMay 15 at 12:35 PM\nAmazing throwback! Try\n\nThis iteration of Tetris is amazing and beautiful. Its a must have in my opinion and the visual art and amazing music makes this classic even better.\n\nHelpful | 1", "mrdigMay 14 at 5:41 PM\nAwesome so far!\n\nPlayed it for an hour or so, feels the same as the PS4 version but I had never tried it in VR. Great experience!! If you like tetris, you cant go wrong.\n\nHelpful | 0", "joekinney100May 15 at 8:43 AM\nGreat\n\nIts a great game. They have done such a good job making this game from the music to the graphics. Not as good as psvr but it still looks pretty good.\n\nHelpful | 0", "EeveeInVRMay 15 at 12:29 AM\n\nIt's like the classic gameplay of Tetris but with an infusion of Lumines in the way your moves interact with the environment and music. Visually stunning.\n\nHelpful | 0", "liamdamlg123May 17 at 6:00 PM\nIts pretty good\n\nThere was a lot of fire people worshipping my Tetris screen and chanting jeb. So it's a pretty good game\n\nHelpful | 0", "JesiahNewtonMay 15 at 5:57 AM\nMy Fav Game on VR. PERIOD!\n\nI originally owned this game on PSVR and now the Quest. This game is the perfect game to just relax and unwind from any kind of stress. I LOVE IT!!!!!\n\nHelpful | 1", "gcmj122345May 30 at 12:56 PM\nDope\n\nYes played for like 2 hours first go stopping definitely immersive\n\nHelpful | 0", "NobleThiefMay 28 at 2:28 PM\nTetris+\n\nEver play lumines? Its that but with Tetris and VR. So its perfect\n\nHelpful | 0", "TimLee1223May 14 at 3:02 PM\nThis is the beauty of Tetris\n\nThe music is so awesome, the background is so beautious controls are actually just like a Tetris game!!! Thank you for the game developers!!\n\nHelpful | 1", "derekwaynecarrJun 6 at 9:38 AM\nAwesome\n\nBest version of Tetris.\n\nHelpful | 0", "fauxedoMay 22 at 4:12 PM\nEngrossing\n\nI just cant think of another word to describe this. The game is totally engrossing. Must play.\n\nHelpful | 0", "dgorman78May 24 at 8:36 PM\nWas a skeptic\n\nBut it does live up to the hype. If you like Tetris the overall experience is sublime\n\nHelpful | 0", "sevros13May 23 at 1:29 AM\noh my word\n\nthis is the closest my cold dead soul has felt to god. please play it. you wont regret it.\n\nHelpful | 0", "allenwrench59May 15 at 4:22 AM\nGorgeous !\n\nIf you like Tetris you will LOVE this one !! I picked it up and was it hard to put down !! Beautiful game and graphics!!\n\nHelpful | 0", "PhantomAltoidMay 16 at 4:41 PM\nBeautiful\n\nJust, beautiful. Only gripe is that I cant find a way to turn on zone in effect mode. Still great though!\n\nHelpful | 0", "eabairMay 16 at 7:46 PM\n\nLove the game, wonderful aesthetic and amazing sounds and music. Only problem is the loading times when playing in Effects mode. The T tetrimino spins for like 3 minutes after each marathon, it's annoying AF and ruins the vibe.\n\nHelpful | 3", "VertigeVMay 14 at 4:14 PM\nI'm speechless..\n\nI didn't expect to like this game so much. It's like it puts you in a trance in minutes.. HIGHLY recommended!!\n\nHelpful | 1", "brian.cupp.355May 16 at 4:38 PM\nLoved it completely!\n\nAs an avid tetris player and nes tetris competitor getting lost in this game really helps you focus!\n\nHelpful | 0", "agentreedMay 17 at 5:19 PM\nI know what youre thinking\n\nIts just Tetris in VR , its kind of expensive, and its just Tetris..SHUT UP! Buy it.\n\nHelpful | 0", "nickotoMay 30 at 2:52 PM\nBest with a game pad\n\nPretty and lots of variety!\n\nHelpful | 1", "BenturkeyMay 16 at 1:00 PM\nGet baked.\n\n5/5 would recommend.\n\nHelpful | 2", "shrierfueznuMay 14 at 3:38 PM\n\nBest tetris I've ever played\n\nHelpful | 1", "fellegMay 15 at 2:31 PM\nEssential VR game\n\nIf you enjoy Tetris, this is the most \"into the game\" you will ever be. Wow, what an experience.\n\nHelpful | 0", "Mike.denverMay 14 at 2:53 PM\nAmazing game.\n\nCombination between music, image and visual effect make a unique experience. Highly recommended .\n\nHelpful | 1", "aboveplanet88May 15 at 11:43 AM\nBeautiful game! Needs multiplayer.\n\nI really enjoy this game. It's beautiful and high quality. Only quip is no multiplayer.\n\nHelpful | 3", "teruki9886May 16 at 6:11 PM\nBest Tetris game\n\nBest Tetris game, and great for vr. But need a co op mode, wanna play with friends!\n\nHelpful | 1", "stevostrifeMay 19 at 11:52 AM\nAmazing \"Spin\" on a Classic Experience\n\nIt's Tetris but you can't stop crying for some reason.\n\nBuy this.\n\nHelpful | 0", "ColdiiMay 14 at 1:44 PM\nSuper duper epic dawg.\n\nYo this game is epic, so glad it's out for quest, takes ya on a visual journey, epic game.\n\nHelpful | 0", "PhillQuestMay 15 at 12:51 PM\nGreat great game\n\nI loved this on PSVR and love it on Quest. It's crisper, but not as bright so you don't quite get the same immersion, hence 4 stars, if you haven't played it before though then you are in for a treat!\n\nHelpful | 0", "64BitLoverMay 14 at 4:23 PM\nYou Should Buy Right Now\n\nThis is the best game on the oculus yet.\nTetris Effect is amazing and worth every cent.\n\nHelpful | 1", "piggypeoplepersonMay 18 at 11:22 AM\nTetris!!!!!\n\nIt is better than normal Tetris, but you need to edit the controlls\n\nHelpful | 0", "dante.cerasuoloMay 14 at 5:05 PM\nGreat game!\n\nIf your on the edge of buying this and you like Tetris you will love this game 10/10\n\nHelpful | 0", "duanewoodsMay 16 at 5:58 PM\nExcellent game\n\nI was surprised how addictive this game is in VR. Im really impressed!\n\nHelpful | 0", "MuressMay 14 at 2:17 PM\nA must for any quest owner\n\nI could happily play this all day, what a game! You will not regret buying this\n\nHelpful | 0", "GrandpaFranky82May 17 at 8:27 PM\nLiterally one of my new favorites.\n\nThis is honestly one of the best games Ive ever played.\n\nHelpful | 0", "ThatLukeDevMay 20 at 4:29 AM\nLoved it\n\nI can't describe it, play it for yourself.\n\nHelpful | 1", "BallpointPenMay 14 at 10:25 PM\nMust-buy for Tetris fans\n\nIf you like Tetris, please just buy this game its worth it\n\nHelpful | 0", "arunasmessoMay 14 at 9:52 PM\nArunas D\n\nNever play on psvr but allways want it. Is amazing. 10/10\n\nHelpful | 0", "Klaatu98May 15 at 1:07 PM\nMesmerizing\n\nAbsolutely beautiful. Super immersive, lots of fun!\n\nHelpful | 0", "ericsggMay 23 at 6:38 PM\nIt is cool\n\nI have always loved Tetris. Fun game to play. Gets addicting. I would LOVE to see Tetrisphere on Oculus. That would be AWESOME!\n\nHelpful | 0", "paul.mckendreyMay 15 at 1:52 AM\nTetris Effect\n\nMy first ever review on here. One word Brilliant\n\nHelpful | 0", "HeyItsFinnMay 15 at 8:24 AM\nJust... WOW!\n\nNo words is the best was to describe this game\n\nHelpful | 0", "Richard_q8May 16 at 9:11 PM\nAmazing\n\nWanted this since i saw it on PSVR\n\nHelpful | 0", "Aaronw85May 18 at 4:38 AM\nWhy are you reading this?\n\nJust go buy it. BUY IT NOW!\n\nHelpful | 1", "crb3dMay 14 at 8:59 PM\nCrb3d\n\nAwesome!!!!!! \n\nHelpful | 0", "Anubis_egyMay 15 at 5:09 AM\nAwesome\n\nThanks guys for the memories , Big fan\n\nHelpful | 0", "speeddimonrobertMay 15 at 4:25 AM\nIt is stuning\n\nIt is super amazeing and butiful.\n\nHelpful | 0", "ratchetmonkey88May 14 at 9:49 PM\nbuy it now\n\nBeat Tetris game since worlds.\n\nHelpful | 0", "DigelMay 16 at 6:02 AM\nExcellent\n\nTrancelike and so great\n\nHelpful | 0", "I_Am_SpiffMay 14 at 11:17 PM\n5 Stars!\n\nTetris taken to the max!\n\nHelpful | 0"]