{"App Title": "The Climb", "App description": "Feel the exhilaration of extreme free solo climbing. Experience the adrenaline rush as you ascend to epic heights, explore caves, and find shortcuts. Race against your friends routes to compete for the fastest times on leaderboards. Navigate and enjoy stunning landscapes from around the world, including the Alps, Southeast Asia, and the American Southwest. \n\nFeatures: \n- Free solo climbing:  Ascend to epic heights, explore caves, and find shortcuts\n- Multiplayer and achievements: Race other players ghosts, rise up leaderboards and earn over 100 achievements to unlock gear.\n- Bouldering: Beat intense routes that demand perfect technique.\n- Tourist mode: Climb with simplified mechanics, ideal for introducing your friends to VR.\n- Outstanding environments: Enjoy three beautiful, immersive locations by day or night.\n\nDeveloped by Crytek and achieved with CRYENGINE.", "Purchase section": "$29.99Add to WishlistShareComfort: ModerateSupports QuestSupports Oculus TouchInternet connection not requiredOculus Refund Policy", "Game Modes": "Single User", "Supported Player Modes": "Standing, Sitting", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Arcade, Exploration, Sports", "Languages": "English, French (France), German, Korean, Spanish (Spain)", "Version": "612.0", "Developer": "Crytek", "Publisher": "Crytek", "Website": "http://www.theclimbgame.com/", "Release Date": "December 3, 2019", "Developer Privacy Policy": "THE CLIMB\n\n BLOG    \nPURCHASE FOR QUEST PURCHASE FOR RIFT\nPRIVACY POLICY THE CLIMB\n\nCrytek respects your privacy and understands the importance of protecting your personal data. We will only collect personal data that we need to in order to fulfill your requests and/or our contractual obligations. If we change our Privacy Policywhich you will find in full detail belowwe will post those changes here so that you always know what personal data we collect, how we use it, and under what circumstances, if any, we disclose that personal data.\n\nWe reserve the right to modify this Privacy Policy at any time, but if we make material or significant changes to this Privacy Policy, we will notify you. Revisions to terms affecting existing Crytek services shall be effective thirty (30) days after publishing. Your continued use of The Climb signifies your acceptance of the changes to our Privacy Policy.\n\n\n\nI. Controller\n\nController in Terms of Art. 4No. 7 General Data Protection Regulation (GDPR) is: Crytek GmbH, Hugo-Junkers-Str. 3, 60386 Frankfurt am Main, Germany, Managing Directors: Avni Yerli, Faruk Yerli, Ahmet Sahin, phone number available on request, Fax: 00 49 69 - 219 7766  99, http://www.crytek.com, info@crytek.com.\n\nII. Personal Data Collected By Crytek\n\nIn terms of Art. 4 No. 1 GDPR Personal data includes any information relating to an identified or identifiable natural person (data subject); an identifiable natural person is one who can be identified, directly or indirectly, in particular by reference to an identifier such as a name, an identification number, location data, an online identifier, or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural, or social identity of that natural person. When you choose to participate in the online functions of The Climb:\n\nOculus ID\nProfile ID\nGhost race data, in-game movement\nIII. How Crytek Uses Your personal data\n\nCrytek uses your personal data to operate certain features of The Climb. Mostly the personal data mentioned above is necessary to perform our contracts with you and Oculus in terms of Art. 6 (1) lit. b GDPR. Other personal data is used to improve the user experience within The Climb and therefore a legitimate interest in terms of Art. 6 (1) lit. f GDPR.\n\nIV. Will Crytek transmit my personal data to third parties?\n\nCrytek will not transmit your personal data to third parties unless it is necessary according to the law or in order to fulfill your contract or based on your consent. If you choose to use the online functions of The Climb you give your consent that your user name is displayed in the leaderboards provided by Oculus and that your movement data are transmitted to the user(s) which want to compete youre your achievements. In that case personal data is transmitted to the following external service provider: Oculus), and hosting service providers. In that case, the scope of the transmitted data is always restricted to the necessary minimum. Any service providers that come in contact with your personal data are required to comply with the same relevant data protection regulations. Upon request we may provide copies of relevant contract unless it is prohibited by contractual obligations and/or applicable law.\n\nV. Where is the Personal data held?\n\nOur game servers are run by our hosting providers: LeaseWeb Deutschland GmbH, Kleyerstrae 75-87, 60326, Frankfurt am Main and your personal data is stored in Frankfurt am Main/Germany\n\nVI. How long is your personal data stored?\n\nFor as long as you own and can play The Climb we will store your data.\n\nVII. Your Rights\n\nAt any time you have the right to:\n\nRequest a copy of the data we have stored for your person, for the receiver or category of receivers of your transmitted personal for the purpose of storing.\nRequest that your data be deleted or corrected, in the case that you have changed your mind or the data is incorrect (as far as possible according to applicable law).\nObject to the further processing or demand a restriction concerning the processing of your personal data - Request to port your personal data.\nLodge a complaint with a supervisory authority.\n\nTo contact us about any of these things, please email our Data Protection Officer: privacy@crytek.de PLEASE NOTE: If you object, restrict, or otherwise refuse the processing of your personal data mentioned above and/or ask us for a deletion, you will not be able to use the online features of The Climb.\n\nVIII. Contact Information\n\nIf you have questions or concerns regarding this statement, please contact the Crytek Data Protection Officer at privacy[at]crytek.de. \n\nWe use cookies to ensure the best experience on all Crytek websites. By using this website, you consent to the use of cookies. More information on our use of cookies you can find in our Privacy Policy.\n\nACCEPT COOKIES\n\n 2020 Crytek GmbH ('Crytek'). All Rights Reserved. Crytek, CRYENGINE, The CLIMB and their respective logos are trademarks or registered trademarks of Crytek in the EU, the USA & other territories. All other trademarks are the property of their respective owners.\n\nPRIVACY THE CLIMB TERMS OF SERVICE WEBSITE PRIVACY POLICY EULA THE CLIMB\n\nCRYTEK CRYENGINE OCULUS", "Developer Terms of Service": "THE CLIMB\n\n BLOG    \nPURCHASE FOR QUEST PURCHASE FOR RIFT\nEULA THE CLIMB\n\nLIMITED LICENSE AGREEMENT for the use of the software game The Climb (\"THE CLIMB\")\n\n1. Subject of the Agreement\n\nThis limited license agreement for the use of the computer game THE CLIMB on the PC/Windows/Oculus Rift and on the Oculus Quest/Android platform (this \"Agreement\") is entered into between Crytek GmbH (\"CRYTEK\") and you, the end-user (the \"Licensee\" or \"You\"). The Agreement is made effective beginning on the date on which you, the Licensee, first download, install, load or otherwise use THE CLIMB.\n\n\n\nBy downloading, installing, loading or otherwise using THE CLIMB you, the Licensee, agree to all terms and conditions of this Agreement or in the accompanying documentation. You should read this Agreement carefully before downloading, installing, loading or otherwise using THE CLIMB. If you do not agree with the terms and conditions set forth in this Agreement you are not authorized to use THE CLIMB.\n\n2. Grant of Limited License\n\nSubject to your agreement to, and full compliance with, the terms and provisions of this Agreement, CRYTEK hereby grants to Licensee a limited, personal, revocable, non-transferable and non-exclusive right (the \"License\") during the Term, as defined below, to use THE CLIMB in accordance with the instructions provided in the manual or on the packaging of THE CLIMB or indicated during the download process. Unless set forth otherwise in the manual or on the packaging or during the download process you are allowed to install and use THE CLIMB on one (1) computer or device at the same time only.\n\n3. Intellectual Property Rights\n\nTHE CLIMB is licensed, not sold. THE CLIMB and all copyrights, trademarks, and all other intellectual property rights related thereto are owned by CRYTEK (or its licensors, as applicable) and are protected by German and international copyright law and other applicable law. Licensee shall have no ownership or intellectual property rights in or to THE CLIMB, including, without limitation, all copyrights related thereto.\n\n4. Reservation of Rights\n\nCRYTEK (or its licensors, as applicable) expressly reserves all rights not granted in this Agreement. You are not receiving any right or license hereunder to copy, distribute, publicly perform, display or make any other use of the THE CLIMB, or any element thereof, or the trademarks CRYTEK, THE CLIMB, CRYENGINE, or any other trademark of CRYTEK or any other company.\n\n5. Software Use Restrictions\n\nAny use by Licensee of THE CLIMB not expressly permitted in Section 2 above is expressly prohibited and any such unauthorized use shall constitute a material breach of this Agreement by Licensee.\n\n\n\nThis prohibition includes (but is not limited to):\n\n\n\nto copy, reproduce, manufacture or distribute (free of charge or otherwise) THE CLIMB, in whole or in part, in any media;\nto transfer, sell, sublicense or lease any rights in and to THE CLIMB to third parties;\nto use THE CLIMB contrary to morality or applicable law;\nto modify THE CLIMB or create any derived work;\ndecompile, reverse engineer or disassemble THE CLIMB.\n\n\n\nLicensee shall not alter or remove any legal notices, such as trademark and copyright notices, affixed by CRYTEK on or within THE CLIMB.\n\n6. Digital Rights Management (DRM)\n\nTHE CLIMB uses Denuvo Anti-Tamper, a digital rights management technology. This digital rights managament technology does not require a separate installation. For more information about Denuvo Anti-Tamper, visit www.denuvo.com. You are not allowed to disable Denuvo Anti-Tamper. If you disable or otherwise tamper with the technical protection measures, THE CLIMB may not function properly and you will have materially breached this Agreement. Upon deinstallation of THE CLIMB the Denuvo Anti-Tamper technology associated with THE CLIMB will be removed from your machine.\n\n7. Support\n\nCRYTEK shall not be obliged to provide any support for THE CLIMB. Any support render by Crytek is subject to its sole discretion and may be terminated at any time.\n\n8. Term and Termination\n\nThe term of this Agreement and the license granted herein begin on the date on which you first download, install, load or otherwise use THE CLIMB and shall continue in perpetuity until terminated in accordance with this Agreement.\n\n\n\nCRYTEK reserves the right to terminate the online features of THE CLIMB with 30 days notice to be announced on CRYTEKs websites.\n\n\n\nNotwithstanding anything to the contrary herein this Agreement and the License granted to you herein shall immediately terminate, without the requirement of any notice from CRYTEK to Licensee, upon Licensee's failure to comply with or breach of any term or provision of this Agreement.\n\n\n\nUpon the termination or expiration of this Agreement, any and all rights of Licensee hereunder shall terminate without prejudice to any rights or claims Licensee shall have no right to use THE CLIMB in any manner. Licensee shall immediately destroy all copies of THE CLIMB in its possession, custody or control, and all rights granted hereunder shall revert, without notice, to and be vested in CRYTEK.\n\n\n\nTermination of this Agreement shall not create any liability against CRYTEK and shall not relieve Licensee from any liability which arises prior to termination. The provisions of this Agreement which by their terms or sense are intended to survive shall survive cancellation, expiration or termination of this Agreement.\n\n9. Limitation of CRYTEKs Warranty\n\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, YOU EXPRESSLY AGREE THAT THE USE OF CRYTEK SERVICES, CRYTEK SOFTWARE, AND THE INTERNET IS AT YOUR SOLE RISK. CRYTEK SERVICES, CRYTEK SOFTWARE, CRYTEK'S PRODUCTS AND THIRD-PARTY SERVICES AND PRODUCTS ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS FOR YOUR USE, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, UNLESS SUCH WARRANTIES ARE LEGALLY INCAPABLE OF EXCLUSION. CRYTEK PROVIDES CRYTEK SERVICES ON A COMMERCIALLY REASONABLE BASIS AND DOES NOT GUARANTEE THAT YOU WILL BE ABLE TO ACCESS OR USE CRYTEK SERVICES AT TIMES OR LOCATIONS OF YOUR CHOOSING, OR THAT CRYTEK WILL HAVE ADEQUATE CAPACITY FOR CRYTEK SERVICES AS A WHOLE OR IN ANY SPECIFIC GEOGRAPHIC AREA.\n\n10. Limitation of CRYTEKs Liability\n\nTO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, YOU ACKNOWLEDGE AND AGREE THAT YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY DISPUTE WITH CRYTEK OR ITS LICENSORS IS TO STOP USING CRYTEK SERVICES, AND TO CANCEL YOUR CRYTEK ACCOUNT. YOU ACKNOWLEDGE AND AGREE THAT CRYTEK, ITS LICENSORS AND AFFILIATES ARE NOT LIABLE FOR ANY ACT OR FAILURE TO ACT BY THEM OR ANY OTHER PERSON REGARDING CONDUCT, COMMUNICATION OR CONTENT ON CRYTEK SERVICES OR USE OF CRYTEK SOFTWARE. IN NO CASE SHALL CRYTEK OR ITS LICENSORS, AFFILIATES', EMPLOYEES', OFFICERS', OR DIRECTORS' (COLLECTIVELY, \" CRYTEK AFFILIATES\") LIABILITY TO YOU EXCEED THE AMOUNT THAT YOU PAID TO CRYTEK FOR CRYTEK SERVICES. IN NO CASE SHALL CRYTEK OR CRYTEK AFFILIATES BE LIABLE FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM YOUR USE OF CRYTEK SERVICES, CRYTEK SOFTWARE, THE INTERNET OR FOR ANY OTHER CLAIM RELATED IN ANY WAY TO YOUR USE OF CRYTEK SERVICES OR ACCOUNTS. BECAUSE SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR THE LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, IN SUCH STATES OR JURISDICTIONS, CRYTEK'S AND CRYTEK AFFILIATES' LIABILITY SHALL BE LIMITED TO THE FULL EXTENT PERMITTED BY LAW. CRYTEK DOES NOT ENDORSE, WARRANT OR GUARANTEE ANY THIRD PARTY PRODUCT OR SERVICE OFFERED THROUGH CRYTEK AND WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES.\n\nNotwithstanding the foregoing, nothing contained in this Terms of Service limits Crytek's liability to you for fraudulent misrepresentations, death or personal injury caused by Crytek's negligence, or any other liability to the extent such liability cannot be excluded or limited as a matter of applicable law.\n\n11. Licensee's Warranties and Indemnification\n\nLicensee warrants and represents that:\n\n\n\na) Licensee has full legal rights and authority to enter into and become bound by the terms of this Agreement;\n\n\n\nb) Licensee has full legal rights and authority to exercise Licensee's rights granted herein and to comply with Licensee's obligations hereunder;\n\n\n\nc) Licensee will comply, at all times during the Term, with all applicable laws.\n\n\n\nLicensee hereby agrees to indemnify, defend, and hold harmless CRYTEK and/or their successors, assigns, officers, directors, employees, agents, representatives and licensees (but not including Licensee) from and against all damages, claims, losses, causes of action and lawsuits arising from and/or relating to a breach of this Agreement by Licensee.\n\n12. Breach of the Agreement\n\nIn the event of a breach of this Agreement by CRYTEK, Licensee's sole remedy shall be to terminate this Agreement by delivering written notice of termination to CRYTEK.\n\n\n\nIn the event of a breach by Licensee of this Agreement, CRYTEK (and its licensors, as applicable) may pursue all remedies to which CRYTEK is entitled under applicable law and/or this Agreement, including without limitation the compensation for any and all damages which may arise in connection with such breach.\n\n\n\nLicensee agrees that Licensee's unauthorized use of THE CLIMB, or any part thereof, may immediately and irreparably damage CRYTEK such that CRYTEK could not be adequately compensated by a monetary award, and in such event, and at CRYTEK's option, CRYTEK shall be entitled to an injunctive order, in addition to all other remedies available including a monetary award, to prohibit such unauthorized use, without the necessity of CRYTEK posting bond or other security.\n\n13. General Provisions\nEntire Agreement: This Agreement (including the CRYTEK Privacy Policy, the manual and other supplemental terms provided by CRYTEK) and any posted rules or instructions regarding THE CLIMB constitute the entire agreement between you and CRYTEK relating to your rights and obligations in the use of THE CLIMB. This Agreement completely replaces older versions of this Agreement. If there is any conflict between this Agreement and any other rules or instructions posted by CRYTEK, such other rules or instructions shall prevail.\nRemedies. You agree that this Agreement are not intended to confer and does not confer any rights or remedies upon any person other than the parties to this Agreement. You also understand and agree that this Agreement, the CRYTEK Privacy Policy and the supplemental terms, are not intended to confer, and do not confer, any rights or remedies upon any person.\nTransfer of Rights. Crytek shall be entitled to transfer any rights and obligations under this Agreement or the whole Agreement to third parties. Licensee shall not transfer any rights and obligations under this Agreement without Crytek's prior written approval.\nSeverability. If any part of this Agreement is held invalid or unenforceable, that portion shall be interpreted in a manner consistent with applicable law to reflect, as nearly as possible, the original intentions of CRYTEK, and the remaining portions shall remain in full force and effect.\nWaiver. The failure of CRYTEK to exercise or enforce any right or provision of this Agreement will not constitute waiver of such right or provision. Any waiver of any provision of this Agreement will be effective only if in a writing signed by CRYTEK.\nGoverning Law. (i) The laws of Germany, excluding its conflicts-of-law rules, govern this Agreement; and (ii) if Licensee is defendant, CRYTEK might, if admissible, determine as court of jurisdiction the court where the Licensee is resident or the court competent for the corporate domicile of CRYTEK which currently is in Frankfurt a.M. (Germany). If CRYTEK is the defendant the parties expressively agree on the exclusive jurisdiction of the courts of Frankfurt a.M. This Agreement on jurisdiction applies to all claims, be they based on contract, on tort or on any other legal basis, arising under or in connection with this agreement.\nCryteks licensors shall be third-party beneficiaries under this Agreement and shall have the express right to enforce its provisions and to enjoy the benefits of its protections.\nTHE CLIMB may include third party code provided under different license. Please check the credits for further information.\n14. Users Subject to the Jurisdiction of Germany\n\nFor Users subject to German law the following shall apply:\n\n\n\nInstead of Sec. 10 \"Limitation of Crytek's Liability\" the following shall apply:\n\n\n\nLimitation of Crytek's Liability\n\n\n\nCrytek is liable for damages, regardless on which legal basis (be it contract, tort or otherwise), only if\nsuch damages are cause by violation of essential obligations of these Terms of Service (Kardinalpflichten) for Crytek's negligence or intent (Verschulden) which endangers the purpose of the Agreement; or\nsuch damages are caused by Cryteks gross negligence or intent.\nIn case that Crytek is liable for the violation of an essential obligation of these Terms of Service (Kardinalpflicht) without acting with gross negligence or intent then the liability is limited to amount of payments received from the respective User.\nIf Crytek is liable for damages pursuant to Section (a) above for gross negligence or intent of Crytek staff other than the managing directors then the liability is also limited to the amount set forth in Section (b).\nCrytek is not liable for indirect or consequential damages (Mangelfolgeschden), loss of profits or frustrated costs if such damages are not a result of gross negligence or intent of Crytek's managing directors.\nThe exclusion or limitation of liability pursuant to this Sec. 23 also applies with respect to claims against Cryteks staff or contractors.\nThe liability of Crytek with respect to death, bodily injury or health, a guarantee by Crytek (if any) or pursuant to the Product Liability Act (Produkthaftungsgesetz) shall remain unaffected.\nIf the User is also liable for certain damages then Crytek shall bear an amount of such damages in accordance to its contributory negligence (Mitverschulden). With respect to the Users responsibility for reduction of damages (Schadensminderungsobligenheit) the User is responsible for regular back-ups of its data and in case of an assumed bug shall take all further reasonable measures. In case of loss of data Crytek is thus liable only to the extent that such loss of data would have occurred in case of a due data back-up as well.\n\nWe use cookies to ensure the best experience on all Crytek websites. By using this website, you consent to the use of cookies. More information on our use of cookies you can find in our Privacy Policy.\n\nACCEPT COOKIES\n\n 2020 Crytek GmbH ('Crytek'). All Rights Reserved. Crytek, CRYENGINE, The CLIMB and their respective logos are trademarks or registered trademarks of Crytek in the EU, the USA & other territories. All other trademarks are the property of their respective owners.\n\nPRIVACY THE CLIMB TERMS OF SERVICE WEBSITE PRIVACY POLICY EULA THE CLIMB\n\nCRYTEK CRYENGINE OCULUS", "Space Required": "1.64 GB"}



["5 stars\n73%\n4 stars\n17%\n3 stars\n5%\n2 stars\n2%\n1 star\n4%", "Sydney_RobsterJul 29 at 8:46 PM\nJust WOW!\n\nI was put off getting this at release because alot of reviews were talking about the downgrade in graphics. It must be really good on PC, because I find the Quest graphics to be perfectly acceptable when playing (the distant views have got the painted backdrop look you see in older movies) and are sufficient for the experience to be immersive. I feel like I'm climbing on the side of a mountain! I have never experienced sweaty palms before, ever, until playing this game. I love this game because of that deep immersion.The view when you reach the top is breathtaking, even on return visits.\n\nThere are 3 different environments/mountains and each has a easy, medium and hard difficulty level, but more importantly, a different route (i.e. you aren't repeating the same area). There are also two sets of 'boulders'. Ppl say about 4 hours to complete everything. I've done the hard levels, so this seems about right.\n\nThe ghost feature lets you select a friend's or random's score or points and race them. The ability to challenge has been the main driver for me when playing the entire game. This is a game changer for me. I see myself playing this game long into the future. Just firing this game up, selecting someone several notches up on the leaderboard and having a go for 20 mins.\n\nNow the stuff I wish they improved upon because it's not so good;\n\n(1) If your head clips inside the rock face, or the rope of the save point, or a railway beam that you monkey walking underneth, etc, then you see just blackness. Nothing but BLACKNESS.This presents a big problem because often when it happens, I'm holding on by one hand, then BLACKNESS, then I plummet to my death because I can't see my next hand hold and my stania faips after several seconds. Sometimes I can move my head so Its not clipping, others times I can't and then plummet.\n\n(2) Jumping and grabbing your next hand hold is an important part of the game. Prepare to die while jumping, over and over and over ... the tutorial tells you to push the jump button, and grab again when reaching the new hand hold. This is much easier said than done. The issue is that it all happens very quick and it's in first person view, so hard to see what's going down, therefore, know what you're doing wrong, and how to correct it, i.e. \"Those who do not learn history are doomed to repeat it.\"\n\nHelpful | 52", "BaileyFamily06Jul 13 at 9:06 PM\nMake it scarier\n\nI love this game and I play it a lot but I just wish that instead of the screen going black after you fall a few feet I wish that you fell all the way down so that it would make you really want to hold on. Other than that maybe add a few more levels or make the game cheaper. But overall its a great game with great replayability and I would\ndefinitely recommend it\n\nHelpful | 35", "thechrisstreetMay 23 at 8:10 AM\nA true standout gaming experience\n\nThere are many gaming events in my life that have awed me. Playing Mario 64 in 3D for the first time. Leaving the sewers in Elder Scrolls: Oblivion. Playing Animal Crossing on Gamecube and being wowed by its syncing of real-world time. Discovering Hyrule Field for the first time in Zelda: OOT.\n\nI have now just experienced another - The Climb, on Oculus Quest.\n\nDeveloped using the Cry-engine, this is the most graphically impressive Quest game I've played so far. And the immersion is unparalleled. I truly felt that I was there. I admit to not fully experiencing all modes and levels, but I was in awe of this experience which is easily worth the asking price.\n\nThe Climb initiates you with a virtual climbing wall - an interactive tutorial, which teaches you what you need to know. The controls are very easy to grasp.\n\nIt's also fairly physical, if you are trying to climb at speed. The first few goes I had, I definitely worked up a sweat and my arms and shoulders were feeling it. It's definitely an enjoyable way to get exercise especially in lockdown.\n\nText alone cannot explain the feeling of immersion and the euphoria of completing a climb. I actually sat down and felt an array of emotions while admiring the beautiful view.\n\nThe Climb has given me one of the greatest experiences of my life so far. If you have an Oculus Quest and haven't tried it, you really really should.\n\nHelpful | 203", "Laura223_DCJul 25 at 12:41 PM\nVery challenging, but fun!\n\nThis game is actually very entertaining, the levels are challenging, but they are fun! Sometimes I have difficulties when I have to jump or remove tiny rocks from places where I have to grip. The graphics in this game are fantastic, it looks so realistic, the places and even the hands! :O Also in this game you can practice your climbing skills on Practice wall :) There's also tourist mode, where you can climb without worrying about stamina and doing chalk ups.\n\nHelpful | 5", "DiscMasterChamp13 days ago\nMy Hands are still shaking!\n\nYes , I know it's a game, but when you're faced with a jump from one rock to another, and you look down first.... your heart races and your palms get sweaty.\n\nThere's really no other way to explain this game then \" It's Intense\"! I just finished the Alps medium climb and I literally had to sit down afterwards. My palms were sweaty, my calves hurt (no clue why) and my heart was racing. It was awesome!\n\nThis game removes you from reality and actually makes you think you're hundreds of feet high...pure adrenaline!\n\nI HIGHLY recommend\n\nHelpful | 2", "Yzz13 days ago\nI am in love with this game\n\nIt's far more thrilling than I thought and the sceneries surpassed my expectations. The climbing itself is very satisfying and I get almost out of breath or dizzy at more dangerous moves or when I stop from time to time to look down and around.\n\nThe views are amazing, I can just stand for a long time and simply look around. I have so many screenshots xD One time after reaching the top I gave the headset to my sister who has a slight fear of heights and she got paralised from amazement (and fear xd) then kept looking around for quite some time (but not down), openly gaping. It really makes you feel as if you're there.\n\nI'm happy I decided to give this game a try and I'm definitely showing it to my friends :)\n\nHelpful | 2", "seanrgJun 19 at 5:01 PM\nPerfectly fulfills promise of VR!\n\nI've built a solid Oculus library over the last few months, but this experience blows me away - you can get lost in the full promise of VR. It's a great stationary workout, and there's also a very mindful and meditative component to it. Superb attention to detail and rendering, and natural and smooth mechanics. It took me a while to purchase due to the price, but I'd buy it or experiences like this again in a second.\n\nHelpful | 22", "Droculah22 days ago\nFun, but Overpriced\n\nI have been wanting this game for a while now, but was not sure if the gameplay was worth the price. Finally decided to get it. The game looks decent, and is fun to play. However, I do not feel the height at all, so there's really no sense of climbing as far as the thrill of being so high up. Additionally, even though it's fun...it's not $30 fun. There are only 3 locations, with a couple of maps in each. This gets 3 stars because I don't feel the price is balanced with the gameplay. Had this been a cheaper game or had more content, it would have gotten 4+ rating.\n\nHelpful | 18", "M6Tina12 days ago\nYep\n\nI have an intense fear of heights. I was very skeptical about this game as I also get motion sickness. I am OBSESSED with this game! My shoulders are sore! My abs are sore! My legs are sore! If I lose a hold and fall, Im just that much more determined to get it the next time. I end up sweating like a pig until I complete a climb! Love it! So glad I got it!\n\nHelpful | 0", "irishmickey4414 days ago\nGood graphics and customizable\n\nThis game about climbing boulders and mountains is very fun. I use this app every day. I had no lag or glitches yet, probably because my router is in the next room, but this game has stamina, gloves, and wristbands. My favorite wristband are the hand cuffs.\nAnd I like the canyon biome the most.\n5 stars\n\nHelpful | 0", "IainEverettJul 5 at 6:57 AM\nBrilliant and immersive experience\n\nI was hesitant at first spending 20+ on a game but this was definitely worth it. The quick intro teaches you the controls and how to climb and you can quickly start one of the easy levels. As you complete climbs you unlock harder levels and I must say the difficulty is perfectly tailored. As an experienced gamer I managed to complete the easy, medium and finally hard climbs but the boulder problems (6 in total, 2 for each area) are on another level. I love the fact they are challenging and after many attempts I've completed 1 of them. You feel totally immersed in each environment, the breathing of the climber, the sound of the wind and other visual and audio effects really make you feel like you are climbing a mountain. It's also a great workout for your shoulders by keeping your arms elevated and moving for an extended amount of time. When you summit there is a huge sense of relief and achievement. Once you have completed the main levels you can revisit to improve your score if you want to see your overall worldwide ranking improve. A must have game in my opinion and I hope they add more levels eventually!\n\nHelpful | 5", "udo.nink12 days ago\nAwesome, best of the best\n\nThis is a vreal experience. What an idea, What an implementation. So smooth, so different. Definitely not only for climbers. So very cool what you can do with your hands in vr in front of a piece of rock or much more interesting obstacles. That's one of the games or rather simulations I won't ever forget - thank you so much for this!\n\nHelpful | 0", "hyperbunny10 days ago\nSo relaxing, it's like meditating\n\nMy arms actually get tired playing lol I don't know what that says about my fitness level or the game.\n\nI like doing deep breathing regularly to relax, it's easy to do this in the game cuz your character actually does breathe vocally in the game. It relaxes me personally. It's almost like guided breathing. The game is fun of course, climbing challenging levels in beautiful settings. Some eagles flying by and all.\n\nWhen the character gets to the top she gets super excited and I also did as well and the first time I found it funny cuz we were both just cheering together in my living room.\n\nI really love it, I see what the fuss is about.\n\nHelpful | 0", "GabrielartgJul 27 at 5:03 AM\nVery nice\n\nIt makes me very nauseous when \"I\" fall so I always close my eyes. But the rest is fantastic.\nI have an issue with the little rocks as they don't go away and I sometimes have to spend a few minutes going back an forth to clean it before I can use it but it's very immersive! I really like it.\n\nHelpful | 2", "Brainiac2080Jun 14 at 10:56 AM\nEssential!\n\nThis game is awesome! There are 3 types of levels, each having 5 inside of them making a total of 15 challenges, you get stars which adds a bit of replay value. I like the chalk mechanic, its really cool! There are also challenges so that you dont get bored of the game! Great game. Maybe lower the price a bit.\n\nHelpful | 11", "jonrahoiJul 12 at 1:25 AM\nThrilling, absolutely terrifying\n\nAs a game, its rather simple: climb to the top. But the implementation is so well done, the experience so engrossing, that my knees shake and I have a moment of whoa! Or oh sh*t! Every minute or more.\n\nIts genuinely scary for me, and Im an avid rock climber. Ignoring the feet (strange feeling for climbers) feels alien at first but youll almost instantly get it. The mechanics are super simple.\n\nWhen i finish a level, I often yell with the avatar, and share in his sense of accomplishment. Its challenging physically and mentally just like real climbing.\n\nI also spend a chunk of time every climb thinking I could never free solo in the real world. Way too scary. Super enjoyable game. Super scary, and realistic, too.\n\nHelpful | 3", "snaket20037 days ago\nGreat game! Just a bit uncomfortable\n\nI love this game! I think its so well done. Unfortunately, I guess I dont have my VR legs yet and it makes me very dizzy. I can only play about 10 mins at a time. I really hope it will get better with time but its tough to play it if I will just feel sick for the rest of the night :(\n\nHelpful | 0", "butterscottJul 17 at 4:29 PM\nOutstanding game but 3 problems\n\nI think this is an amazing, must buy, immersive game. One of my personal favorites but I wish there were more locations, actual multiplayer to race your friends, and better ways of keeping your head from if it hits a rock, you have to figure out how to move your hands and head to get out of it. But my biggest problem is no multiplayer\n\nHelpful | 3", "LeafySpace1323 days ago\nPretty immersive\n\nThis game is perfect for if you want to have an immersive experience of climbing the alps or even a canyon. The only thing I would suggest is making it so when you fall it doesnt just cut to black but you see the full fall. Also make turning round a corner smoother\n\nHelpful | 0", "No3vA8 days ago\nGood buy!\n\nThe gamplay 10/10\nThe graphics 6/10\nThe replayability 10/10\n\nThe graphics are overated... they are just baisic potato quest game graphics.\nWHOLEY HECC the price tho. My standards are peaty low for quest games but the gameplay trumps all would reccomend if you have 30 dollars to spend.\n\nHelpful | 0", "estwick10jrjrJul 30 at 9:26 AM\nBreathtaking game\n\nThis is one of the best VR games I have ever played and if you are wondering if you should get i would definitely do it. The game is a piece of art and its very fun. Right now I am still trying to beat some of the first levels because they are challenging (in my opinion) so if you are wondering whether you buy you definitely should.\n\nHelpful | 1", "Mr.Waffles123413 days ago\nGreat overall\n\nIts a really good game but I have one problem with it. It is a bit overpriced, some other people said it should be like $5 but I think it should be around 10-25. The fact that your head just goes into the wall and the game tells you to move it also is not the best but there isnt much you can do besides that. The rest of the game is pretty fast but also really good. You can pick a lot of exciting paths and do them your own way (usually). A lot of people also say the graphics are trash but when you have a really small box to play real video and track controllers it cant even see without external cameras or wires, it is pretty hard to make the graphics perfect. So I think they are pretty good.\n\nHelpful | 0", "Robertobob100Jul 18 at 5:45 PM\nBlows me away!!! But could use more...\n\nThis game absolutely blows me away!!! Literally! I turned on our ceiling fan to make it more relistic, then I got dizzy and fell down...\n\nAyway, the graphics are amazing and the controls are easy, with different difficulty levels. The game takes place on different mountains that you can just climb for hours and enjoy. One of my favorite parts is the scenery to look at and the high quality graphics of the mountains.\n\nThere are enough courses but in my opinion I feel like there needs to be more of a variety of mountains, for example: snowy mountains, jungle hills, volcano. Right now they look too similar. I know those kind of thing take a lot of work to program (being a programmer myself).\n\nThis is an amazing game that makes you feel like your really climbing a mountain in real life. Anyone reading this, don't let that suggestion stop you from getting the game because is still definitely worth it!\n\nHelpful | 190", "MiningMine0Jul 27 at 2:49 AM\nGreat game, Great workout, Great Fun!\n\nDespite this game being a little bit annoying (hard) at sometimes, this is an incredible VR achievement. Whilst climbing, you can look behind you and take in the beautiful sights and sound of the world below you. There's all sorts of techniques to learn too. You can also customise your character through unlocking different achievements (they don't count as actual achievements) that also price together a nine by nine puzzle to make the climb logo in different variations, which I think is cool. You can also play with friends and the game is very easy to learn. If you're afraid of buying 22 games, don't worry, they're really good and this one in particular is amazing. And after a long, long climb, you make it to the top and get to take in an absolute show and look around the environment you have overcome.\nAmazing.\n\nHelpful | 1", "junger20006 days ago\nGreat scenery, realistic climb\n\nWas debating buying this and Im so glad I did. Its a realistic climbing experience. The environment is beautifully rendered and makes the climb a wonderful experience.\n\nHelpful | 0", "Alaskuenzis16 days ago\nThe best.\n\nThis was the reason I got the quest. Great mild workout during the work day so I don't sit at the computer all day. Game mechanics are simple. Great range in climb difficulty too so the game doesn't get full too quick.\n\nHelpful | 1", "SuperBuddy0512Jul 16 at 10:08 AM\nOne of the best games I have ever played\n\nI was coming into this completely unprepared, I played this game on the rift a few years ago and I thought the views were stunning. I immediately put this game on my wishlist when I saw it. I didn't believe the quest could be able to run it as well as the rift, but I was completely wrong. The views are stunning the climbing is immersive and the graphics are great. The greatest thing of all was the cross-buy I spent a lot of money on games and I didn't know if I would be able to buy it but it was a cross-buy game. Completely free! Overall this is one of the best games I have ever played on the quest. (Im talking about games just on the quest)\n\nHelpful | 1", "ToochmangNS6 days ago\nFun\n\nFun game. Beautiful scenery, mechanics are pretty spot on. I find it kind of relaxing. Could use a few more locations though!\n\nHelpful | 0", "Rayla8406 days ago\nGreat Game!!\n\nI love this game. So glad I bought it. It's challenging, and rewarding when you reach your destination. I highly recommend it \n\nHelpful | 0", "WheepingJul 12 at 7:57 PM\nUnique and fun\n\nI havent played a whole lot of the game so far. Im still on the first map set. I highly recommend this game, just be logical about it. If youre afraid of heights, this can be a good way to help you overcome that or terrify you forever. I do get slightly motion sick if I start moving too quickly. The only downside I have to the game and the reason I have it at 4 stars, is because your head can go through the wall and that can cause everything to mess up. I dont intentionally try to do it, but if I try to stretch too far or make a weird reach, I will sometimes glitch in the wall. This makes your character fall, so its very disorienting when it happens. Otherwise, so far a fantastic game.\n\nHelpful | 2", "PhilDchamp14 days ago\nLove the game , hate the black screen\n\nThis game is truly beautiful, when playing I feel completely immersed, then my head intersect with polygon and I get a frustration black screen.. would give a 5/5, but this feature is frustrating AF especially with the boulder levels\n\nHelpful | 1", "Good.At.The.MemesJun 4 at 9:41 AM\nA feat of game design\n\nThis game just feels so good, and it makes! Sense! My cousin who lives with us is a rock climber, and he says everything in it is something that you actually do in climbing. Chalking your hands for a better grip and stamina, not overgripping to save stamina, having separate stamina bars per hand, it all makes sense in the real climbing world! And that transfers over to be great game mechanics. The only downsides I have is that its a bit short, clocking in at about 4-5 hours if you do every course once, and that it seems a bit jittery at times. Though, it has fantastic replayability, which buffers out that playtime. Despite those problems, theres nothing else like getting to the top of the climb, and seeing the jets fly above, or the people flying by you in wingsuits, or the hundreds of flying lanterns being set off. Its an amazing feeling that Ive only felt in a couple other games, like breath of the wild. Man. This game is so good.\n\nHelpful | 6", "sirhc.ekralc7 days ago\nGood idea but glitchy\n\nWanted this game for a while and finally purchased. I climb IRL, I love the idea of a VR component like this but like many people have said, the Head intersection warning that is frequent kills this game. Im a designer and I propose a better method, blur the foreground object when your head intersects to simulate an object being to close. Or use the last known colour palette. Going straight to black is too abrupt.\n\nAlso, the price is too expensive for only three courses. A European style bouldering grotto over light blue water would be nice, or a night climb with head torch. Or more bouldering levels.\n\nHelpful | 4", "vik.sharma.128 days ago\nAmazing\n\nThis game is so fun and exhilarating!! Plus lots of replayability trying to beat your scores or race against others.\n\nHelpful | 0", "Bigbossgamer36516 days ago\nFabulous!\n\nI've always enjoyed the climbing mechanics in games like Empire and Vader Immortal and so when i found this game it was like a match made in heaven!\n\nHelpful | 0", "b_e_m4 days ago\nStunning\n\nbeautiful graphics combined with thrilling gameplay makes this game a solid 5 stars for me\n\nHelpful | 0", "OllieBurallJun 26 at 2:16 PM\nGood game but...\n\nI got this game yesterday and when I tried it out I had an absolutely blast. I the views are beautiful, the climbing is not easy but also not impossible, and the frame rate is high. However after half an hour of my eyes telling my brain that I was climbing up a cliff and the rest of my body telling it that I wasnt moving, I felt like I was being turned inside out. I stopped playing but I still felt motion sick for two hours. Today I tried it again but I sat down. This worked much better. It had a bit of an impact on gameplay. Because my arms sometimes bumped into my chair, but after 45 minutes of playing it I barely felt motion sick at all. I really recommend this game, and if you do get it, in my opinion, sitting down makes it much better. This could be a weird thing about me and for other people they get less motion sick standing up, I dont know, I am not a neuroscientist, but in my experience, it is better to sit down.\n\nHelpful | 4", "Danloki14 days ago\nGreat fun for the sale price.\n\nSo was reluctant to buy full price but picked up on sale , and my what fun. Most of the pro reviews are spot on about this but gfx are good don't listen to others, for a quest. And can have fun climbing. Would suggest playing this for short sessions at a time. Rather than blast the lot in one sitting. Overall good fun game and is a challenge.\n\nAlso you do have a sense of height in this, yes you don't fall all the way which is a shame but yea yea.\n\nWould love few more mountains though!\n\nHelpful | 0", "Cla_TronixJul 7 at 10:59 AM\nOne Of The Best I Ever Played\n\nThis game is by far one of the best games I have ever played. At times its calm, and relaxing, and sometimes youre climbing as fast as you can to get off of crumbling grips. This game isnt only just a climbing simulator though, it incorporates an interesting workout from holding your arms at different positions. Theres even times where you have to drop to a lower ledge or jump over a deep gap. 10/10 would recommend to anyone with a compatible headset.\n\nHelpful | 1", "AntiSoldier76422 days ago\nI like it\n\nBut I wish I would have spent my money on something else\n\nHelpful | 5", "ansonort22 days ago\nReally disappointed\n\nI was so looking forward to this game as one of the stand-outs on the Quest.\n\nUnfortunately the opening scenes were you set up, practice and choose your climb are an expanse of whiteness and polygons, completely unresponsive. Ive gone into the game itself and the graphics are fantastic but in the words of the song, I want it all.\n\nIve contacted the developers and so far nothing. Im hoping for some form of resolution because its heartbreaking to have to apply for a refund on a game that has so much promise.\n\nLooking for help with this particular problem on the internet yields no results and, yes, Ive tried uninstalling and reinstalling - six times!\n\nVery sad.\n\nHelpful | 3", "Pixelhunter3323 days ago\nIts a good game if you have the space..\n\nThe game plays really good but the only issue is this game wont really work if you dont have the space I encountered many issues with collision of rocks that weren't near me the rope climbing only works on one side.. And the game overall seems to be fun but flawed I personally liked the game. But if you dont have a lot of space you might want to wait on this one..\n\nHelpful | 2", "betonosMar 7 at 8:46 AM\nGreat fun!\n\nGreat fun. I climb also IRL and this stuff is obviously no simultor but pretty close in terms of giving you the emotiojs and pleasures of climbing.\n\nOne thing that annoys me is that if your head goes into the rock or other obstacle, its automatically blackouted and paused. Id suggest doing the trick that oculus does when you leave safe zone - wireframe the rock and allow player to get back to unblocked position.\n\nHelpful | 208", "darkendlight1234Jul 21 at 10:44 AM\nGood game I love it just a few issues\n\n1st thing is more levels, or something that keeps you playing, I personally enjoy the rush of trying to make risky jumps and shortcuts which is fun for me but ik alot of people may not enjoy it to the point that it's worth the money, I'd say it's more of a 20$ game, it's good just not the same level of replayability that something else for the same price could get you. Dont get me wrong it's a excellent game and if you have the money spare to spend then go for it, you'll have a blast no doubt, and especially if you wanna take turns with friends irl trying to get good scores, but for a single player experience should be more of a 20$ game then a 30$ one, also wanna point out that the canyon levels are way to hard it ruined the vibe of the game for me when I went from semi challenging levels to extreme mode with a little bit of hell on earth mixed in, I've beaten every level besides the boulders on canyon cause they are way to difficult it kinda killed the pace and fun of the game for me. Like I get a challenge but that's like playing on you must die mode it's not fun and is honestly more frustrating then enjoyable.\n\nHelpful | 4", "TJDawg07Jul 21 at 6:20 PM\n\nThis game is great! I bought it when I first got my quest. I see a lot of the 1 star comments are just people who dont want to learn games play mechanics and then call the game boring.\n\nHelpful | 1", "FuegoSetsunaJun 14 at 11:13 PM\nGreat game\n\nI was a bit sceptical about the game at first, since u just climb but it quickly changed my mind, its good for relaxing. It is also not as easy as i first thought, its not overwhelmingly hard but it makes you feel like you accomplished something. 10/10\n\nHelpful | 3", "Hoggle87Jun 28 at 7:18 AM\nThe Climb\n\nFirstly great game but Im getting really frustrated the I only can complete Zen Bay and practice and on tourist but offers me nothing else to climb all locked out Ive climbed it a dozen times why am I not able to get new climbs like Alps or change difficulty to medium. No disrespect but I didnt pay for a game where i seem to be permanently stuck on one level and one mountain its becoming a bind and boring not being able to unlock anything please help.\n\nHelpful | 1", "Whipped_CreamiousMay 18 at 5:16 PM\nGreat game, 1 major flaw\n\nThis game is awesome. If has plenty of content and I often play this until my head set dies. The only problem with this game is when you put your head inside objects, it displays a message saying that your head is inside something. It totally blackens the screen. When Im falling down to get to another grip, this often appears. It makes it so I cant grab anything. This is super frustrating and it happens very often. Other than that one problem, this is an amazing game. 10/10 would buy again.\n\nHelpful | 12", "dale.new.5Jul 2 at 12:51 AM\nActually makes me scared\n\nI have a fear of heights and this actually triggers it... and helps it.. helps me get past it and it is an amazingly made game!\n\nHelpful | 4", "Mbrown22172Jul 9 at 11:46 AM\nIt's amazing! But...\n\nI love this game its fun, challenging, and overall a good experience(if you don't have a fear of hights).But there is one problem there are some faulty grab points in the game and they have killed me most of the time, i think you should still buy it just take your time whey you are climbing on curved ledges and you jump on one and try to grab on to the closest side of the wall.I would happily rate this game 5 stars if there weren't so many un-grab able grab points!\n\nHelpful | 1", "ironpic_aiden_yt16 days ago\nI like it but...\n\nThe game is very good,very fun. The graphics are great. But it makes me very motion sick and i have to stop. I can't really play the game because of the motion sickness.\n\nHelpful | 0", "hmenglandJun 6 at 10:39 AM\nFun, actually a pretty good arm workout\n\nThe game is simple but very fun for just exploring and finding new routes. I like how chill it is while still giving me just a bit of an adrenaline rush. Reaching the top feels great. Finding secrets and new things not found in the tutorials is fun. The gnomes scream.\n\nHelpful | 3", "minnegaby16 days ago\n\namazing game wish there was more maps but really well done\n\nHelpful | 0", "GeeeBenjaApr 17 at 7:19 PM\nLoving this!\n\nFirst off, some of the best graphics ive seen in a Quest game so far (its powered by CryEngine). This game is quickly becoming an integral part of my daily VR-workout regimen. The realism is crazy- hanging off the side of a mountain over beautiful vistas youll find your heart rate spiking, palms sweaty, moms spaghetti. Cant wait to dive in further!!\n\nHelpful | 22", "Mr_Weeman9 days ago\n\nBetter then fartnite\n\nHelpful | 1", "ajaswinski10 days ago\nAN EXCELLENT EXPERIENCE\n\nIt gives the solitude and feel of climbing. One of the best. Finally found a perfect home on Quest because you never get screwed on the sensors.\n\nHelpful | 0", "i-Zzz16 days ago\nFantastic\n\nDon't miss the summer sale on this game\n\nHelpful | 0", "Hinate2423 days ago\nAwesome game\n\nTruly one of the best games on the quest. Really love it. Give it a try!\n\nHelpful | 1", "ABunchOHippies13 days ago\nGreat game\n\nReally fun. Must have\n\nHelpful | 0", "RangerJahJul 24 at 5:10 PM\nI love this game so much\n\nI really love this game so much. But I do wish there were more levels. Other than that the game looks so realistic.\n\nHelpful | 0", "JoeIsRealPers0nJul 3 at 5:19 PM\nShows off what vr can do\n\nThis is such a great game, the controls are flawless, the graphics are some of the best Ive seen on the quest, and its immersive, too immersive I broke a light. But dont let that deter you its amazing!\n\nHelpful | 0", "scotty341Jul 7 at 3:02 AM\nGreat but the graphics need improvement.\n\nI'm aware the hardware of the quest makes this virtually impossible but I would prefer the game much more if the landscape you could look out over once you finish the level was nicer.\n\nHelpful | 2", "DexevadeJul 2 at 9:51 PM\nEpic\n\nIt's very good and challenging.\nI really like there are always different routes you can take on each course, to make it more diverse.\n\nHelpful | 2", "bassowApr 30 at 6:58 AM\nMake space around you\n\nThis high production value game sits right on the fine line between being too arcadey on one side and being a boring sim on the other. You can play it as a seated experience, but make sure you have a lot of room around you. You will lean out and swing your arms in ways your furniture can't imagine right now.\n\nHelpful | 11", "RandysharkJul 26 at 8:42 PM\nGood game\n\nI love the game its a great climbing game. Im very happy with my purchase\n\nHelpful | 0", "Jesseingram423Jul 8 at 1:56 PM\nThe Climb game\n\nVery nice game . Really fun without overly complicated controls. Perfect for a first VR game!\n\nHelpful | 2", "jaakko.talvitie24 days ago\nVery immersive\n\nI just only hope that there would be more levels.\n\nHelpful | 1", "AzMaN_Jun 4 at 5:39 AM\nNorthen expasion?\n\nI love this game, every second of it but im dying to see if the northen expansion will come to the quest. Comon oculus! If you can get the climb on to the quest from the rift then you can do the same with the expansion!\n\nHelpful | 3", "eddy.hristova14 days ago\n\nAmazing game really realistic recommend buying it\n\nHelpful | 0", "mikedown22 days ago\nGreat\n\nGreat game kids love it\n\nHelpful | 0", "Eriko021 days ago\nChill game\n\nChill \n\nHelpful | 1", "Ravious15Mar 31 at 10:44 PM\nA must buy. I play this daily.\n\nThe Climb provided a experience like none other. I am impressed with the various ways you are able to climb and use the controllers. I am finding daily game play trying to beat my previous scores. The leaderboards system is good, and allows you to race the ghost of other climbers. Really helped me advance my skills, and find hidden paths. Great value. I really hope the developers ad more content.\n\nHelpful | 20", "GorgTheSpiderMay 13 at 6:13 AM\nHi\n\nI live in a box.\nMy life is made out of cardboard.\n\nDid you find this helpful?\n\nHelpful | 56", "PokemohamaJul 26 at 6:49 PM\nWorkout Certified\n\nLegit makes you feel like a legend.\n\nHelpful | 0", "Alpha_Wolf_2629Jul 26 at 12:51 PM\nGreat game\n\nTruly immersive and great looking game\n\nHelpful | 1", "theJAZzGeJul 20 at 10:53 AM\nFun game, but serious motion sickness\n\nThe climb is a lot of fun to play, but it can get frustrating. Sometimes it doesnt register the grip and I fall to my death, even though I would have caught myself, and after playing for sometime I always start to get real bad motion sickness.\nInnig very sensitive when it comes to motion sickness but I always am after playing the climb and Idont know if it got something to do with the movements. The checkpoints also sometimes get activated even though Im not near them, making the second levels challenge harder than necessary. Like, I can deal with falling to my death and having to start all over again, but if the checkpoints activate even though I try everything to avoid them is discouraging.\nOtherwise the game has nice scenerys and is a lot of fun.\n\nHelpful | 1", "imperfect-key478Jul 24 at 4:48 PM\n...\n\nThis is amazing. Stress filled fun.\n\nHelpful | 0", "Codey2007Jul 1 at 1:44 PM\nAmazing!\n\nGreat game great graphics good controls and the only thing I would change is the chalk mechanism you have to chalk your hands a lot\n\nHelpful | 2", "Ilovefatgirls92May 4 at 6:58 PM\nIt just needs one thing\n\nOverall this game has beautiful graphics, probably even the best for any games that are available on the quest to this date. Its very challenging and keeps you wanting to try again and again. Even my mother loves this game and its her first VR experience ever.\n\nThe only thing I could ask for to be added is to have live multiplayer. Now I understand you can play against ghosts of friends that have been already recorded, but live interaction would be so fun.\n\nIn conclusion this is a must have for all VR users\n\nHelpful | 6", "andy.davies.3367174Jun 23 at 4:42 PM\nMore awkward than fun\n\nI guess if you're really into climbing then this is could be considered ok but for me this just isn't fun. I don't really get where the fitness aspect cubes into it either, you're basically reaching up and grabbing holds and then hanging round while you chalk your hands. There's no load on your fingers and unless you struggle like a Trump to drink a glass of water then putting your hands up in the air shouldn't really be to much hassle.\n\nIt is annoying however and that's probably down to how technical it is. And this is the thing about this \"experience\", it's more of a simulator than a game, your hand fatigues whilst the other is trying to grab a hold, you need to chalk your hands (one at a time) to maintain your grip.\n\nThe controls are elaborate and unintuitive, and I very much doubt that the game would improve my climbing skills.\n\nMaybe it's just that it's not for me but I really can't see how this is touted as a fitness app.\n\nThere's nothing in this \"experience\" which drives me forwards and makes me want to get better at it. There's no cardiovascular benefit and no strength to be gained, possibly some mobility aspects but if you're not struggling to lift your hands over your head then this isn't an issue either.\n\nI bought this on the strength of the other reviews, I hope they're all genuine because I feel like I've been really let down with this.\n\nHelpful | 5", "stevestrawbsJul 6 at 4:38 PM\nSuperb\n\nMy favourite game\n\nI'm not into climbing but wow what great game 100% a must buy for the Oculas \n\nHelpful | 1", "JsKs1234Jun 9 at 8:11 AM\nI fell a lot\n\nIts a great game its easy levels are easy and hard levels hard just right for a game and dont get me started on the amount of ways to go overall great game\n\nHelpful | 2", "REC09Jul 21 at 10:58 AM\nIts really good!\n\nThis game is really fun. The leveling up system is good. The whole climbing part is fantastic!\n\nHelpful | 0", "Jmar25Jul 5 at 6:17 AM\n\nLove this game.\nI'm new to VR and managed to give myself RSI though so best to warm up hands first.\n\nHelpful | 0", "DepressedSockJun 1 at 7:14 AM\nTHIS GAME IS AWSOME!!!\n\nTHIS GAME IS AWSOME!!! But it needs more\nlevels I completed all of them in 2 days and now there is nothing to do except the infinite training wall. But on the plus side the game is really good and anyone should try it because its a good experience for a first VR game.\n\nHelpful | 0", "StabbiJun 3 at 4:19 PM\nIntroduced to VR with climb\n\nI managed to get the hang of climb as a first time VR experience. So beautiful- a great way to show off the graphics to newbies. Get your body into it!\n\nHelpful | 2", "Kelp_ChipzMay 21 at 6:30 PM\nGreat Game but can be clunky\n\nWhen I was playing I was immediately blown away by the environments and creative aspects, but I do have to say. The mechanics can still be slightly hard to master, especially on the bouldering walls. Still is a great game though and I wake up everyday wanting to play more.\n\nHelpful | 0", "HKnudsenJul 28 at 4:45 AM\nOkey i guess.\n\nThe game is good. No doubt. Not my type og game. It gets boring after 10 minutes. What i like about it is that it is a great game to intruduce people to VR with. All out OK\n\nHelpful | 1", "midway1972Jul 15 at 2:59 AM\n\nI love the game its a lot of fun and the mechanics are so good\n\nHelpful | 0", "dancing_parrotsJul 5 at 9:21 PM\nvery surreal\n\nfeels so cool and has interactive levels\n\nHelpful | 1", "Co0pJul 15 at 1:19 PM\nFun\n\nPerfect\n\nHelpful | 0", "Ciph3r_mvpJul 2 at 6:49 PM\nAmazing game\n\nGraphically amazing and the gameplay js great too.\n\nHelpful | 1", "msilentApr 5 at 3:07 AM\nBest Game on Oclus till yet\n\nThis is the best simulator for climb lovers. It is amazing to see developers have put so much effort in making this game work on oculus quest.\n\nThe only issue is the graphics, i know it is heavy game and developers give more importance to the performance lovers with 0 frame rate drops. But i am using it by supersampling it to 2048 and its work amazing in that its so clear and graphic is so amazing. I just love it.\n\nThe only thing i wish is developer find a way to add the resolution settings in the menu itself from where we can increase or decrease the resolution accordingly to our taste, coz for supersampling we need to connect to the computer every time before we want to play it.\n\nThank you the best purchase for me till Oculus came out.\n\nHelpful | 6", "pfc88mikeApr 19 at 7:11 PM\nGreat fun\n\nThis was my first game in Quest. Its probably the one I keep coming back to the most. Lots of fun and being able to go multiple paths to achieve the climb is fun. Waiting for my wife and brother in law to download it so i can try multiplayer.\n\nHelpful | 3", "letschat69 days ago\nAbsolutely Love It\n\nThis game is amazing! I put it off way too long because of the high price tag, but wound up getting a $10 store credit plus this went on sale. Would I pay full price looking back? Absolutely. This game seems simple, but you really work up a sweat by bending and twisting your body to reach the different grab points. Pick this game up ASAP!\n\nHelpful | 0", "Goatbro77Jul 1 at 6:33 PM\n\nHighly Recommend playing\n\nHelpful | 0", "dancejohndanceJun 25 at 10:01 PM\nIt grows on you\n\nGuess you could say it's climbing up my rankings. \n\nHelpful | 0", "bennett.christiansonJun 27 at 6:10 PM\nGreat Game\n\nBuy this game right now it is awesome!\n\nHelpful | 0", "FishyMcPhishJun 5 at 1:47 PM\nFrustrating and not fun\n\nI bought this game on its launch day, with high hopes. I got so bored with it and its frustrating lack of direction that I havent figured out how to do anything but climb the first rock. Guests also have no interest. Bored with this and I dont feel like committing any time to learn how to advance. \n\nHelpful | 3", "howard.amberMar 2 at 5:08 AM\nThe best game so far\n\nIve had my quest for 3-4 months now and The Climb is one game that keeps me coming back again and again. The visuals are stunning and combined with the sound make it the most realistic VR game Ive seen. Play with your windows open and a fan and you could be there. I love the little extras at the top especially the airplanes.\nI wish the designers would make more games like this. Im thinking mountain biking or surfing.\n\nHelpful | 17", "Nightflame45616 days ago\nClimbing Experience is Mind-Boggling\n\nThe mechanics, the graphics, the different level difficulties. Even the tutorial is high-quality, and thats just the introduction!\n\nI must say that this game is different from a majority of the games that I have downloaded (TOTF, FNaF: Help Wanted, SuperHot), and I made the amazing choice of broadening my spectrum with this. The climbing is very similar to that of Espire 1: VR Operative, so I wasnt walking into this unprepared.\n\nHonestly, an essential for Quest users. The only flaw is that I didnt purchase this sooner...\n\nHelpful | 1", "mr_g-forceMar 27 at 9:09 AM\nGreat but short\n\nListen this game is wonderful its immersive and great to play all around but dang its short I bought the game and the next day I finished every level but I didnt unlock everything though but since I knew the path of every level and my way to do it it was well not really Re-playable. Not saying the game was bad but short but this game is amazing and fun to play if you have a party over or even if your alone. So if you want to get this game I say get it youll enjoy it I promise\n\nHelpful | 9", "SomeFlamingRockMay 29 at 3:26 PM\nGreat game! Great graphics!\n\nThe graphics blew my mind! Its an amazing experience and can be slightly scary too! Definitely try if you like slight thrill and adventure.\n\nHelpful | 0", "MeiicaMay 13 at 1:01 PM\nFun but Best to get on sale\n\nThe game is initially very fun and can leave a sense of accomplishment getting to the top. There is a suggested route to take if you are unsure where to go as well as others routes you could potentially take which is a nice touch.\n\nHowever, the limited number of locations doesn't warrant the price tag, once you have climbed the 3 mountains (each has 3 climbs + 2 shorter challege climbs) you will start feeling a bit bored especially if you don't want to try racing up them which brings me to my next problem area.\n\nJumping, its just frustrating. The majority of the time it jumps a distance or a direction I was not expecting, then your head will be in a wall which blacks out the screen as your hoping you grabbed something while trying to find the way to move your head out of the rock so you can see again. Which makes racing just a pain since the hardest challenge is if the jump will work correctly. Then restarting all over if it doesn't to try and beat the time.\n\nChalk mechanic: You chalk your hands to have more stamina, this mechanic is alright, just feels like the chalk runs out to fast so your constantly rechalking. Easiest way I found was to just chalk your free hand as you keep moving, but even doing that I wish there were no-chalk ghosts and chalked ghosts because I don't really want to bother with it but that's just me.\n\nSpeaking of stamina.. you can grab half way on the triggers to preserve stamina. The idea of it is good but needs to be more advanced to be functional as you might as well climb the entire mounting pretending your triggers don't press in more than 1/2 way. A way to fix it would be to have it cause negative stamina on big surface grippy let areas but give an advantage on finger grips or something like that.\n\nThe game's visuals are downgraded from the PC as expected, personally that didn't take away from the experience for me. However, the gam IS crossbuy so you get both versions and can stream to the quest from the computer. One review said streaming it over heated the quest but I didn't have this issue when I tried but just thought I'd mention it because it may be an issue.\n\nDo I recommend? YES, despite its shortcomings I absolutely recommend the game, it can be really enjoyable, what you see is what you get kind of gamellay so the choice shouldn't be to hard to make. Just know the locations are very limited so I would advise picking it up in sale instead of full price.\n\nHelpful | 4", "Ryan.eneverJun 6 at 9:20 AM\nTHE CLIMB\n\nBest game I have ever played it could be better if it had more levels but it is a good game\n\nHelpful | 0", "B-NITEJul 2 at 7:15 PM\nWell it looked cool\n\nI climb semi professionally but cant now because corona. The game is fine but the mechanics are kinda glitchy.\n\nHelpful | 2", "alexsumJun 16 at 12:13 PM\nGame 100\n\ngood gam but fall dowm me scared\n\nHelpful | 0", "Yobro04Feb 7 at 10:08 PM\nGood graphics but add extra mountain\n\nThe views are awsomme and Im so amazed at what they have achieved Im so glad they let it cook in the oven a bit longer because those graphics are insane for the quest also when are you guys gonna add an extra mountain the pc version has 1 mountain more then the quest version Id like that you guys ad this mountain to the quest version\n\nHelpful | 35", "whitepaw.auApr 29 at 6:25 PM\nLoved the game years ago still the quest\n\nPlayed this game on a friends system years ago and It was a great experience, now VR has come a long way and the freedom the Quest gives just makes it feel like your free(which is why I rock climb in real life)\n\nHelpful | 3", "Ommmm_2486A day ago\nVR at its Best!!!\n\nI love VR that allows me to be somewhere or do something I would never do in real life. The game makes me feel peaceful, afraid and queezy all at the same time. I love this game!!!\n\nHelpful | 0", "Ray_RomanoMay 10 at 7:38 AM\nGreat game, needs more\n\nThis is definitely a must have for all quest owners. However, this game does end much too quickly. If there was an infinite mode where the climb is computer generated, that would really seal the deal.\n\nHelpful | 2", "BtracchiasJun 14 at 5:26 PM\nPretty good\n\nGreat exercise plus its fun a few glitches and it gets hard sometimes but worth the money\n\nHelpful | 1", "HexxxSixApr 2 at 4:57 PM\nGreat\n\nI have a decent computer and tried this game via oculus link. After trying it on the quest itself, I have to say its surprisingly good. Its close to matching my computers graphics. However, the backgrounds were blurry meaning when you climb to the top theres not much of a view. And the textures on the rocks looked stretched. Overall this was fun however the pc version had an extra level which in my opinion was my favourite one. There are many challenges and depending on the difficulty of the course, you play on a completely different area/map but with the same theme. On the pc version the sun has a large glow to it which makes the game look gross and is very eye sore so I prefer the quest in terms of graphics. Sometimes the game can be buggy for example you often get caught on rocks thats you shouldve easily been able to go around and fall to your death. Ive also seen many reviews saying this game makes you feel scared the first few times you fall but I did not experience this. Overall it was a great game and I keep coming back to it. I would recommend it to anyone who wants a relaxing scenic experience or anyone who wants a thrilling challenge!\n\nHelpful | 4", "MuddyBudMay 4 at 10:26 PM\nReally good\n\nInteresting game with good atmosphere and look. Work on when a player is getting onto a platform not having to make them swing their arms with the might of Zeus past their hips to get on there. Otherwise, amazing game.\n\nHelpful | 0", "KurutApr 24 at 12:05 PM\nBest ave Climing game ever\n\nSuper glad I got this game for $30 it was super duper worth it. If you just got a quest I would recommend this game as your first game.super good!!!!!!!!\n\nHelpful | 0", "jeansobieskiJul 11 at 6:04 AM\nClimb\n\nTerrible game every time you arrive on the red platform nothing to do you just fell i tried many timeswith my two hands on the red plarform then i Fell for me the worst application on oculus of course i advise all my friends to do not buy it\n\nHelpful | 0", "SpidermanFeckingDiesApr 29 at 7:52 PM\nGreat game\n\nThe game is fun. The mechanics of the climbing combine real world and video game elements to create a great experience. My only complaint is that the game is lacking in total content. A couple extra areas would help the game tremendously. I am also having a bug with the title screen freezing, although this has no effect on gameplay or visuals.\n\nHelpful | 0", "Golden_bread1776May 18 at 4:21 PM\nFun for a week\n\nI played and enjoyed this game, and i found it fun, although it could be a short game if youre not into replaying for challenges\n\nHelpful | 0", "robyescombeMay 27 at 12:29 AM\nI slept on this game for too long!\n\nFantastic artwork, cleverly designed. I just wish there were more medium/hard levels.\n\nHelpful | 0", "FU2_SucMySideJun 8 at 6:51 PM\nWowzers\n\nLit crap my dude\n\nHelpful | 0", "collin.breckenridgeApr 1 at 8:53 AM\nFantastic game if youre into climbing!\n\nBeen playing for a few weeks now and I have absolutely no regrets. If youre not into climbing (nor the sensation of it), I can see the game getting slightly tedious after a few rounds. However, if you are into climbing then this is one of the few games that combines amazing graphics with a fantastic sense of immersion. Good for players whore new to VR and arent looking for anything too upbeat. ONLY issue I have is that the jumping feature is a little glitchy at times but by no means is this a dealbreaker; highly recommended game.\n\nHelpful | 3", "toastdeMay 28 at 4:51 AM\nPretty Good.\n\nI had a problem for the first 20 minutes, I guess I pressed a button or something and it reset the practice level over and over, so that was pretty exhausting, but later in the game, I like the details, the light, the reflections, and the little bells, I appreciate the time you guys put in but if Im being brutally honest, some rocks look a little out of place, and a smidge off, and the whole chalking thing can get really annoying after a while, but overall its a great game from what Ive played. Also, is it just me or are the hands, in game GIANT? I have small hands and I just look like a Goliath to myself, but hey, thats just me.\n\n\nEdit: Ive come to notice after a long time of playing and without even knowing. Achievements, at least for me, dont seem to work at all, havent got a single achievement neither and in game item like a bracelet, watch or glove, meaning that I can barely progress at all, and on top of this I cannot find the multiplayer ghost option, I have friends and people who play this game but Ive had this game for 3+ months and can still not find it to this day, for right now Im leaving 3 stars so far, but if anyone can help me with these problems Id be glad to change it to 4 or 5 stars!\n\nHelpful | 1", "SplenicMay 12 at 2:43 PM\nNerve wracking and relaxing\n\nHeights get my blood pressure up but the wind and scenery keep it down. Probably stresses my heart out in the long run but I love it.\n\nHelpful | 1", "FRUSTR4TEDMay 11 at 1:29 PM\n\n\n\nHelpful | 2", "SolvinterApr 29 at 3:19 AM\nAlmost perfect\n\nI love it. I just have some issues when it comes to recognise that I'm scratching gravel away from walls, and when I'm on vertical ladders, the game takes the straps of my controllers for obstacles on my head! This is frustrating. Otherwise it's brilliant!\n\nHelpful | 0", "nnsense14 days ago\nSome bugs on Quest but extremely addicti\n\nI love this game, sometimes it shows some bug, once I couldnt complete the stage because it wasnt getting I was on the top, for example but it is still enjoyable.\n\nHelpful | 0", "dannyman1403May 14 at 6:21 PM\nBy far one of the best!\n\nSuch an auxilirating experience! Never get tired of playing it. Great views and all around fun experience!\n\nHelpful | 1", "bparker7684May 12 at 9:22 PM\nHoly crap this is awsome\n\nThis is a very adrenaline inducing game and the view at the end of each climb feels like its own reward\n\nHelpful | 0", "CRS-19762 days ago\nWOW\n\nJust AMAZING the graphics are beautiful would really recommend to any adventures person\n\nHelpful | 0", "SubnateicaMay 9 at 3:31 PM\nLots of fun\n\nIts super fun, the climbing feels good and fluid but I hate how when your head goes in to a wall this black screen appears, interrupting my view and has caused multiple unneeded deaths\n\nHelpful | 0", "chad.hertlerJul 29 at 7:28 PM\nIt will never get old!\n\nThe best adventure experience I have had in a long time.\n\nHelpful | 0", "Play_InApr 24 at 10:34 PM\nStunning and fun\n\nTruly one of my favorite games so far on VR, it's absolutely stunning too, looking downwards gave me a quaking in my body, and trying to transverse the terrain is difficult and fun.\n\nHelpful | 0", "erodrigues241Mar 16 at 11:51 PM\nLove this experience!\n\nThis realistic experience of solo climbing with its beautiful scenery is very awesome to play. The game makes you feel like youre truly achieving new highs on top of Mount Everest or scaling the rocky cliff of a small lagoon village. Your heart race increases as you reach higher altitudes and look at the view beyond. Never climbing outdoors before, this game is a very fun, exhilarating and realistic experience to enjoy!\n\nHelpful | 2", "hightechfoolMar 8 at 12:25 AM\nA little exercise, a lot of fun!\n\nThis game is the perfect balance of meditation and recreation. It's easy to get the 'hang' of, but it's got plenty of challenge to make it hard to master. I can imagine climbing pretty fast once you get better at it. It would be nice to have more maps, but I'm VERY happy with the gorgeous ones available right now. Wonder if I'll be sore tomorrow... definitely a slight workout\n\nHelpful | 3", "HephestusMay 19 at 2:24 PM\n\nAmazing game sucks you right in and keeps you playing!\n\nHelpful | 0", "WaffleDoggoApr 17 at 4:14 PM\nReally good game but..\n\nThis game is awesome, I love climbing the mountains and looking down to see the world below me, but I have a problem with it. When you get to close to the wall and you good inside of it, it would turn the screen black so you can see where you're going. But still, this game is really good, I suggest getting this game right away!\n\nHelpful | 0", "paul.horton.568Apr 21 at 5:39 AM\nOne of the best games on the Quest!\n\nAwesome experience. Wonderful graphics, superb sense of height, great climbing mechanics. If you have a fear of heights, this is the game for you. I hope we get some DLC soon. Recommended.\n\nHelpful | 0", "Shopliftersunite18 days ago\nSome immersive-breaking game choices\n\nIts a good climbing experience but I was a bit disappointed by the immersive breaking game choices such as that when starting on a ledge or some planks, any start point, you can just walk off them and  walk  on the air without falling. This immediately tells your brain that youre safe anyway, also you dont experience falling all the way down because when you collide with any object the screen goes black. Theres definitely room for improvement, also graphically while nice and the hands are very well done, the environment is not always very realistic and some levels tend a bit towards the cartoonish imo. But thats maybe the limitations of the Oculus not sure. Still real in a way that it gets you exhausted and that there are some dizzy inducing heights and moments in-game.\n\nHelpful | 2", "Gamerkid2009Apr 23 at 11:28 PM\n\nOne of the best games ever when you first start playing it feels pretty real also its a fun family game to see who gets the best score and to challenge each other\n\nHelpful | 0", "RetrospektusApr 8 at 6:45 PM\nI love it but\n\nSo long story short, I bought this game and I'm loving it. My only complaint would be the grips, I was playing and was close to the end of one level but I fell and died and messed up my challenge because I had room to grab and it wouldn't let me. Aside from the grips issue, I also want to address the hand tracking and not being able to grab things I should be able to all because of the controllers, problems aside I still think it's a great game\n\nHelpful | 1", "Drugged_Cat66May 5 at 10:46 PM\nGreat game but....\n\nThe game is Really fun and it's nice to be able to do something challenging, I wish the graphics were a little better but other than that the game is pretty great.\n\nHelpful | 1", "AZ_Desert_AngelApr 18 at 12:11 AM\nGetting in the game\n\nI purchased the game hoping I would enjoy playing it. I now wish I would have requested a refund. It is not fun at all it is actually a pain and you may just quit playing not even making it through the intro thats where I am at. I actually like these type of games but this one you have no option but to be stuck in the intro over and over and cant skip anything cant move forward. The  jump move is really really bad and it puts you right back where you started intro lol so nope I highly do not recommend this game.\n\nHelpful | 5", "EcopianApr 4 at 9:12 AM\nGorgeous\n\nObviously this game isnt quite like the real thing, but truly spectacular views when you reach the top of each climb is worth it.\n\nHelpful | 3", "YouareJoarJul 2 at 2:31 AM\nAbsolutely amazing!\n\nThis game is great. It absolutely exceeded my expectations with its game mechanics and visuals. For being a game on quest the graphics and design is great and the menus are easily navigated. There are plenty of maps and challenges to keep you occupied for plenty of time and the game can get quite challenging at times. Overall a great experience and a lot of fun.\n\nHelpful | 1", "GArilla32119 days ago\nNot Worth the Price\n\nOverall The Climb is a pretty good game its just not worth the price if the game was 20 dollars or less this would be a better review.\n\nHelpful | 3", "ThatGreenGuyDec 3 at 12:57 PM\nWow. Just wow.\n\nBeing a hobby rock/climbing hall climber I have enough experience to compare this to the real deal. Here's my review:\n\nFrom the moment I heard the Oculus Quest was coming out back in may, I couldn't wait to buy The Climb for it. I've seen some video's about it and I personally absolutely love climbing in real life. The minute this game came out I bought it, and it has already changed my life. I've been playing for 2 hours before my battery almost died, and after that I could play while charging - the cord is not a problem.\n\nAfter I was done playing, my mind felt almost.. reset. Like all of my worries were just wiped away. I felt calm and serene, almost as if I had just been meditating for hours.\n\nThe game itself also blew me away. The graphics are way better than I expected and the gameplay is really intuitive. It's an amazing game for VR newcomers and VR vets. Sometimes when making a risky jump when you look down it also gets some adrenaline flowing. Ofcourse, you won't really feel any muscle soreness, and your legs don't really do much. But climbing consists of two main parts: muscles and puzzles. Rock climbing is usually one big puzzle, and this game really simulates that perfectly.\n\nOverall opinion: this is just the perfect game. A perfect balance between puzzles, calmth and scenery. Playing is like a smoothie of every good feeling ever. I give this a solid 5/5 and if I could, even a 6/5. A better game than this does not exist.\n\nHelpful | 359", "Andres55101Dec 30 at 11:20 AM\nAMAZING but.....\n\nI honestly love this game with the good graphics and my families funny reactions to the game. All in all its one of my favorites but I think it needs more maps or maybe you can also put a map creator where users create their own maps and share them and also try other user created maps\n\nHelpful | 78", "Abuanas2018May 12 at 2:34 AM\nMore realistic\n\nMy dear\ncan you make it more realistic for mountain, trees and the hole environment I recommend this .\n\nHelpful | 0", "Zank_May 12 at 9:59 AM\nGood game could yse some work\n\nOverall good game but the stamina consumption is just too overwhelming but the game is still enjoyable\n\nHelpful | 0", "SnowflokeApr 28 at 1:12 AM\nNot worth your money @full price\n\nGraphics are nice. Controls lay out are kinda nice. Overall its OK.\n\nBut this game. Its really not worth the full price. Kinda regret it that I bought it at full price because after 5 minutes i was done with the game. I can see why other people like these kind of games but if you like more action driven games with full immersion. This game is not for you.\n\nHelpful | 3", "Andrew_BatesMar 31 at 10:02 PM\nEh, it's ok I guess\n\nIts buggy and unimmerisve, it has ok graphics. You should only play this if you are completely obsessed with rock climbing, the veiws get old and the game if short, the price is much to high and should be lowered because this game isnt reaching the bar that the price set.\n\nHelpful | 9", "chris.wicker.5Jun 27 at 6:37 PM\nGood from the start\n\nIm not a gamer, so this is an amateur writing. This was a fun game from the start. Easy for beginners and increasingly difficult as you learn. Lots of random challenges to overcome, so I havent gotten bored, and my teenager likes it (and hes the gamer, so that says a lot).\n\nHelpful | 0", "JaxxterDKApr 29 at 10:51 AM\nFavorite game\n\nGreat fun and use of 3D. I would love more mountains to climb or a sequel though.\n\nHelpful | 0", "MiniSequenceMay 18 at 8:19 AM\nAmazing but\n\nI got all the maps already its very short but fun. Needs more maps and I think its good on realistic and maybe just add seasons to the maps to make it more challenging where bugs  and snow or breaking lines or zip lines. Or even more moving logs to scare us and slow us down or even the planes crashing or the ski lift breaking slowly. I have had no glitches its a great game but I want more challenges in it\n\nThen a 5 star\n\nHelpful | 0", "LeewingzzMay 1 at 7:32 AM\nMay I ask how to save the top scenery!\n\nWhether to save the Top Scenery, so that I can just relax in the beautiful scene and need not to climb again\n\nHelpful | 0", "johnnylag422 days ago\nGreat game, some problems\n\nMy brother loves this game and always plays it but I have different thoughts, The controls are great and its fun to climb but Id rather get onward or something else because you will get bored quickly after playing for a couple of minutes. If you like climbing or relaxing games you should get this\n\nHelpful | 0", "FrenZ_JRApr 18 at 4:07 PM\nIts amazing in many ways!\n\nIts graphics, concept, and overall the game itself is great! Highly recommend buying this game!!\n\nHelpful | 1", "c-crs18 days ago\nWow\n\nLove this game, challenging and beautiful\n\nHelpful | 0", "HDMilesFeb 21 at 4:47 AM\nWonderful with some remarks\n\nI have downloaded this app on my oculus quest and Im here to complain about the rapidly occurrence of audio quality. I will be right in the middle of a pitch and the audio will just sound something like a dialup remix.\n\nBut overall this game is a great joy. Cry engine, please continue to create these wonderful games I appreciate them dearly.\n\n\n-with hope\n\nHarper\n\nHelpful | 2", "CugalMar 19 at 1:31 PM\nDont look down!\n\nI am in the process of recovering from a frozen shoulder. I wish this had been available months ago. My shoulder is noticeably better only after a few weeks. I can not recommend this game enough for fellow sufferers. Even without the therapeutic benefits this is one of the very best games currently available. Thanks to the devs for creating such a brilliant game. Cant wait for any DLC.\n\nHelpful | 0", "djeli1Mar 17 at 5:00 AM\nLove it\n\nI would not do this in real life becaues it not my thing i want to do in real life but in vr wow it great feel real and when you fall wow it crazy try save yourself heart beat fast to try get it right great game must get ppl 10 out 10 for me\n\nHelpful | 0", "sgwigglysquidJun 27 at 2:13 PM\nAmazing game but 1 issue\n\nThis is by far a really good game but the only issue thst needs to be fixed is the message thst pops up when your head goes inside an object. There is a glitch with that as well where the message would pop up but stay there and would cause me to have to recalibrate the game. But rather than that the gsme is pretty good\n\nHelpful | 0", "Levatron25Apr 15 at 2:00 PM\nGreat but scary\n\nThis game is great and some parts are scary because ima chicken and Im afraid of heights.\n9.9/10\n\nHelpful | 1", "ToxicLack2315 days ago\nTutorial\n\nThis game is good for those who are fitness people, but I unfortunately couldn't get through the tutorial before requesting a refund. The pacing of the tutorial narrator is very slow and the application repeatedly lost tracking of my touch controller.\n(Its an application issue, as it does not occur in any other game I've played, even those with parkour/climbing segments or features)\n\nHelpful | 0", "MrDannypigMar 5 at 2:35 AM\nJUST SENSATIONAL\n\nIf your the kinda person thats love tomb raider games then this is the game for you. Not because you explore tombs or fight but you do climb like you are in the eye of Lara Croft\n\nI love how you can race people around the world and compete with their time record! The graphics are amazing. Its a game where you have to move fast and think quick, not only to you grab on to rock, but you do grab on too other objects that may break or fall that may Take you with it, so think fast of you next step of survival\n\nTotally a game Id never thought Id love and especially to be my favourite on quest.\nI 100% recommend this game\n\nHelpful | 0", "devon_michaelApr 12 at 6:16 AM\nTry to aim high above the ground\n\nIts really entertaining, just dont look down. My children cant stop shouting amd really enjoy watching them.\n\nHelpful | 1", "SithLuApr 21 at 12:50 PM\nGreat Game\n\nI love this so much because it feels like Im outside\n\nHelpful | 0", "Adi272862Feb 21 at 8:28 PM\nYes\n\nAmazing game it truly is, I have a lot of fun playing it and feel muscle soreness because you have your arms in the air a lot, the only problem is you complete all the stages and there is nothing else to do other than replay them and try and get quicker time/higher score, or race other people\n\nHelpful | 3", "Gamertag_VRDec 3 at 11:26 AM\nThe Climb remains a fantastic experience\n\nMy video on which my option is based is available on YouTube, Facebook and twitch. Please search Gamertag VR.\nI have played The Climb on PCVR a couple of times & it is graphically superb, when compared to the oculus quest the quest is a low-medium setting version at best.. BUT when in the headset the graphics are enough to transport you to the game locations & it fully retains the gameplay & sense of physical presence while scaling the varying surfaces. I was impressed and continue to be impressed by what developers can achieve with the quest. Racing your friends online is great and this is definitely a game/experience that will create many great moments at parties and social gatherings. Good work Crytek and I look forward to seeing more oculus quest titles\n\nHelpful | 57", "felix.degrossMar 2 at 2:42 PM\nGets climbing just right\n\nIt is a great Game. It makes you stretch out your hands like you normally would not do in your everyday life, so it is a good workout. While the first map is not that challanging, the later levels give you a great sense of height. Of course you can not use your foots like you do in real climbing, but this game gets the feeling of climbing quite well.\nIn the menu, you select with the A button instead of the trigger like you normally do, witch is not a problem, but irritating, hope they fix that.\nAnd i hope for more maps :-)\n\nHelpful | 0", "SomeNolanJul 3 at 10:44 AM\nMust have!!!\n\nOne of my personal favorite games on the oculus quest,this game is amazing the graphics are stunningly realistic.You havent experienced VR until you have tried this game.\n\nHelpful | 0", "paulohotlineDec 3 at 11:40 AM\nThe Climb on Quest and Cross-Buy Too!\n\nThank you Oculus for forking over the buckaroos to make this 2 year old game cross-buy on your shiniest newest toy! At 1.5GB download the footprint is small and I cannot wait to try it out and show the wifey! Will update once I have climbed for a few hours and died about 20 times :) UPDATE: I have played the tutorial and climbed the first 2 routes on the first baby mountain and THIS GAME FRICKEN ROCKS! Holy crap, Crytek did it, they made this game beautiful and playable on an 835 processor. Did Carmack consult on this game? Still 10/10 Free Solos!\n\nHelpful | 176", "JcPeacemakerFeb 29 at 2:38 AM\nWhat a rush.\n\nThe landscapes are both beautiful and challenging. Take your time in tourist mode and enjoy the incredable views or challenge yourself and the leaderboards and race to the top but try not to fall. (The first time is the worst). Findin new paths and short cut or just taking a leap of faith and shaving big chunks of time is so rewarding a must have quest game.\n\nHelpful | 0", "insufferable_eggMar 28 at 6:53 PM\nAstonishing however\n\nThe game is amazing graphics are good and endings put on a spectacular show however if you are prone to motion sickness be careful with it. I don't get motion sickness but when I took off my headset it felt really sick\n\nHelpful | 1", "AuroraSky9394Apr 13 at 6:17 PM\nIce climbing please!\n\nAbsolutely love this game but Id love to have more areas to climb!\n\nHelpful | 0", "ClarkMooreJul 6 at 8:35 AM\nGreat.\n\nI if'd and butted about getting this game. I'm glad I did. I can see myself playing this a lot. Great mild workout to.\n\nReally well put together.\n\nHelpful | 0", "mike.donahue.1460Jul 23 at 2:51 PM\n\nI love how realistic it is I feel like Im actually there\n\nHelpful | 1", "bobby.narramoreJun 21 at 12:59 PM\nOne of my favorites\n\nPlenty of challenges, doing the boulders is hard af. Great shoulder workout without putting shoulders at risk, i have two bad shoulders and only feel burn. Great visuals and crossbuy is a great value. Love this game\n\nHelpful | 0", "brandip3Mar 23 at 12:39 PM\nhelp\n\nhelp me please\n\nHelpful | 4", "Thebomber61Apr 23 at 4:48 PM\nWow\n\nJust wow dont look down\n\nHelpful | 1", "thejuggsterApr 14 at 11:56 PM\nNice\n\nFun game but i think its more worth like 15-20\n\nHelpful | 1", "Alzir74Apr 9 at 4:46 AM\n\nMy favourite game on the quest. Gives a real feeling of vertigo that makes me sweat in places. The climbing mechanics are intuitive and simple to pick up but take a while to master. A great game to showcase VR, I have yet to meet anyone who wasn't impressed. A must have game..\n\nHelpful | 5", "Chet152Mar 25 at 5:40 PM\nUnderwhelmed\n\nThe visuals let it down for me. I just wanted to jump in and experience some vertigo and get that feeling in my stomach, I thought it may be a good first experience for friends trying it out\n\nThe graphics are toned down a lot for the quest and you don't really get a sense of height with the cartoony backgrounds.\n\nYou also have to climb quite a way to get to any kind of view and I get motion sickness before then.\n\nDoesn't make me want to get back on it\n\nHelpful | 2", "jbalslyMar 4 at 4:05 AM\nAmazing game\n\nGot this based on the reviews, so far I have unlocked all 3 mountains but have not progressed to the hard/expert levels of them. This game has not let me down so far, lots of wow moments in it! Only reason I didnt give five stars is bc of the limited variation. Would like way more than just 3 levels, hopefully they release more in the future!! Overall highly recommend to add to your VR library.\n\nHelpful | 1", "VirtualDanTheGammerFeb 21 at 2:57 PM\nIm not disappointed, Great game\n\nThis game is very good, I highly recommend more people play this. Its fun to repeat climbs and get faster times. There where many times when some of the climbs made my heart stop. It a very fun and simple game with great graphics. Although there is only 15 trails, its very fun and even the infinite wall is good.\n\nOverall, great game.\n\nHelpful | 0", "joe.tromblee.2005Apr 6 at 11:33 PM\nBeautiful\n\nLoved the views challenges character customization and the mechanics\n\nHelpful | 0", "Oliver2222Jan 27 at 8:26 AM\nOculus quest the climb\n\nHi\n\nDevs\n\nThis game is really fun and gives plenty of exercise. I really like the Graphics really well down and the tracking work well when climbing on the rocks. Hope you guys have more levels? Because I think this one of the best I played on the Quest. Like all the features such as chalking And even the falling off is fun band the dark levels \n\nHelpful | 3", "Acid_GlowxMar 29 at 4:47 PM\nOk game\n\nThis climbing game is pretty good but I do hope the resolution was better and there were more levels\n\nHelpful | 2", "yuki.yokoyama1Feb 9 at 6:00 AM\nGreat game!\n\nI highly recommend this game.\n\nThe reason why I bought my oculus quest was that I just wanted to play some immersive FPS games. I was just waiting for the game to be released, and buying the Climb was simply to kill some time.\n\nWhat a pleasant surprise!\n\nThe first time I played this game, I nearly drained all the juice out of the quest console (for the first time!) I almost grabbed the power cable so that I can keep playing but I figured I should take a break.\n\nIt takes me to places where I would never be able to (unless I tried really, really hard) and gives me a sense of accomplishment after I complete the climb.\n\nIt doesnt replace physical workouts, but at least my arms get tired after keeping my arms raised for a long time.\n\nI gave 4 stars only because I wished I could climb some boulders and try rope climbing. I think bouldering would be a good place to start. Also, it would be great to have an AI spotter during the tutorial. That way, instead of pushing the button to find the route, I can use voice command to ask for advice. Plus, it would be great if I could examine a map of the rock face so that I can plan a route beforehand.\n\nAnyway, thanks for developing such a great game!\n\nHelpful | 3", "heythere6Jul 25 at 11:41 PM\nSo beautifully breath taking\n\nAmazing\n\nHelpful | 0", "beanburglarApr 13 at 7:31 PM\nAwesome\n\nBest game on the platform\n\nHelpful | 0", "CarolanneeMar 29 at 10:09 AM\nClimbing left trigger wont work\n\nI just bought the game and cannot play it.\nMy controllers have been paired and repaired to no avail. Ive restarted the game and the console and its still not working. My right trigger to climb works perfectly where I can climb with the right hand but the left just wont work. My left controller works fine in other games. The batteries are also new. Its frustrating since the game seems awesome.\nI hope something can be done to fix this.\n\nHelpful | 4", "Springboi23Apr 9 at 7:30 AM\nY E S\n\nI always love climbing features in VR games\n\nHelpful | 0", "redalert33Feb 26 at 11:51 AM\nLives up to the hype\n\nAwesome rock climbing simulation. There's a slight learning curve, but once you get use to the controls, stamina management, jumping, etc. you'll feel like your actually rock climbing. The main maps are great, and the additional boulder challenges are really fun (and tough!). I took off one star because there are some bugs... for instance you will often be told you're inside an object when you're not, and that can very quickly cause you to fall, which gets really frustrating. Also, for some reason my kids have a hard time get the \"pull yourself up\" mechanic working (like pulling yourself up on one of the platform checkpoints.) Maybe they need to adjust the height sensitivity... I don't know, but it's frustrating. Otherwise, great game. These are minor gripes overall.\n\nHelpful | 2", "Logan378Mar 28 at 2:20 PM\nI LOVE CLIMBING\n\nVR Climbing is the best experience you can have. I play this game a few times a day and I love it.\n\nHelpful | 0", "jMowerMar 30 at 4:43 PM\nAMAZING GAME!!!\n\nThis game has the BEST graphics and gameplay quality I have ever seen on a very game.\n\nHelpful | 0", "idlepigApr 17 at 3:02 AM\nGood fun\n\nThis is about  way between simulation and arcade.\n\nHelpful | 0", "Dilpickle0327Jul 14 at 6:41 PM\nAmazing game\n\nBest climbing game in the world.\n\nHelpful | 0", "brogers101704Jan 26 at 11:03 AM\n\nThe Climb is a really fun and cool game, though there are a few reasons it deserves a 4 star. The main reason is that it simply isnt just as fun as some other games like super hot or thrill of the fight. It can be really hard or relaxing at times, but the premise of just simply climbing up isnt as fun as I though it would be. The other reasons are consistently getting your head stuck in the wall and unimpressive graphics. But all around this is a really great game and I would recommend it, but definitely not as one of your first 2 or 3 games because there are def a few better options.\n\nHelpful | 4", "NovuzMar 7 at 9:07 PM\nNice game\n\nIts a pretty nice game its fun to play if you dont spam through it the regular levels are fun and mostly easy and the boulder levels are really challenging so 10/10\n\nHelpful | 0", "whoknowsmediaApr 14 at 7:12 AM\nFrustrating\n\nI'm enjoying the act of climbing, but the game play is frustrating.\n\nHelpful | 0", "TOBIAHJETTFeb 9 at 3:23 PM\nBest Of The Best\n\nThis game is amazing. The developers did a good job. The graphics are Nice and the gameplay is good. They even have a beginner mode that you dont have to worry about chalking your hands. Just climb. this game is a must have whether youre an experienced VR player or a beginner. If you go on the rift/riftS page there is craytech bundle for 26$. Since this game is cross by you basically get this game and one other for $26 if you buy now. You can only play the other game on rift.\n\nHelpful | 1", "BreadVr000Jun 28 at 1:47 PM\nFun but hard\n\nThis game is a must have but I dont recommend it if you dont like calming games because its very hard but I truly recommend this to a strong Person with Vr.\n\nHelpful | 0", "FlamingIcecream64315 days ago\nGreat game gives me no fear\n\nIts fun but hard to do I have to do it and I fall ALOT its okay cause Im learning but overall iTS REALLY GOOD\n\nHelpful | 0", "vrmicahApr 19 at 7:31 AM\nSuperb but kept loosing tracking\n\nAmazing graphics.\n\nHelpful | 0", "JohaylieMar 11 at 9:33 PM\nBest game ever!\n\nI would definitely recommend this game to anyone who enjoys nature and wants a good challenge! Absolutely an amazing game! Amazing graphics!\n\nHelpful | 0", "eightlinesJul 11 at 8:24 AM\nSemi fun experience\n\nStutters on the Quest. Repeatedly tells me my head is stuck in an object and wants me to move it, then I fall off the wall. Won't jump up on final stage platforms. Still, the reset position is quick and I can redo a section. Usually works the second or third time. The game is fun, so I do find myself playing again despite the frustration.\n\nHelpful | 0", "jaquony_boiMay 15 at 7:30 PM\nImmersive and stunning!\n\nI have been the owner of an oculus quest for about a year now, typically I wont be able to get into the game to much because I can address my surroundings, but this game had such good graphics that it made you not want to take the headset off, the only thing holding you back is the size of your room, this game is amazing, and I highly recommend it!\n\nHelpful | 0", "Herobrinejosh07Apr 2 at 10:48 AM\nLove to climb\n\nIt is fun and adventurous\n\nHelpful | 0", "Samaritan316May 15 at 7:04 AM\nGreat fun\n\nI really enjoy the feeling this game generates, you actually get a similar adrenaline buzz playing this as you would experience on a controlled wall, the felling of being high up and the risk of falling is pretty great. I also like the competitive scoreboards and timers etc which drive you harder!\n\nHelpful | 0", "MeowMayaJun 27 at 9:01 PM\nWow\n\nI just got this game today and its amazing. Fun challenging and exiting!!!\n\nHelpful | 0", "007ODIN007Feb 3 at 7:28 PM\nNot for beginners\n\nThis game is very well made . ....\nAmazing experienceof rock climbing , but the point system and game controls are extremely advanced for the average player , there is an option to tour maps but only maps u have unlocked -\n\nwould be fun if there was like an arcade mode less technical and more about the rhythm and speed- maybe add some cool music that goes to the players climbing speed and stuff . But great game all around !!\n\nHelpful | 0", "icetraighFeb 1 at 8:05 AM\nReally fun! My LEGS are tired!\n\nYeah, my legs and feet are tired. You can tell a good VR game when your body tries to compensate for what it's seeing. The graphics in this are good enough that when I'm hanging from a ledge, my body tries to balance itself, resulting in my feet trying to compensate. That's awesome! I'd recommend sitting, but that will limit your reach a bit.\n\nHelpful | 1", "andrea.edwards.9862Jun 26 at 2:31 AM\nAmazing\n\nIt is so realistic that I have fallen over! It is also really fun to play.\n\nHelpful | 1", "RichiChillJun 1 at 1:10 PM\nSo cool\n\nThis app is really cool when I first got into it I didnt know what to do but it got me into a training thing and I felt really at home\nThe only downside is that I feel really achy afterwards\n\nHelpful | 0", "ashtonmiller11Feb 2 at 3:06 PM\nGreat game!\n\nI love this game! I always wanted to play a VR game that centered around climbing. The game does have some problems though. The controls are little weird and even when I go to the controls and try to change them, I couldnt press any of the buttons. This game is fun, exhilarating and an overall good game to play. I recommend this game for anyone who reads this.\n\nHelpful | 0", "7amnerFeb 2 at 9:15 AM\nWOW, best VR game yet.\n\nThe mechanics in this game are absolutely stunning! Very different feeling than other VR games like beat saber or pistol whip. Definitely lacking feet interaction like real climbing but still amazing! I would recommend to buy try out, and refund if its not for you. But I can almost guarantee your gonna love it! Have fun fellow questers.\n\nHelpful | 0", "OrcusMaximusApr 26 at 3:26 AM\nBetter controls needed\n\nGreat views in the game itself.\n\nTrying to change equipment is infuriating though. Better controls needed here.\n\nHelpful | 0", "BobKermanJan 31 at 8:50 PM\nBlown Away\n\nThis game is really a great game. The climbing mechanisms work great, and there really is that sense of fear and adrenaline while youre hanging on with a finger, applying chalk or jumping across a gap. The developers did a great job with it, and its super fun to play. A bit exhausting, but it gives you a feel for what real solo climbing is like.\n\nHelpful | 0", "SyplusMar 20 at 4:50 PM\nThis game I garbage\n\nDont wasnt you money on this dumb game, its absolute garbage so many bugs and its just janky. If the developers have even touched the game since release Id be surprised because Im sure they havent gotten anywhere close fixing it.\n\nHelpful | 4", "TNTTimJan 26 at 2:52 AM\nFun, beautiful and a Climb to the top!\n\nAbsolutely phenomenal, the game looks stunning and really shows what the Quest is capable of. The Climb really shines when you get to the hard levels, the darkness of the night and the small lights from the villages and towns really adds to the visually pleasing graphics. The gameplay is phenomenal and I have never had issues with it, sometimes I'm honestly afraid of the long drops and ravines you need to cross. The Climb is a must-play for the Oculus Quest!\n\nHelpful | 2", "HinokamiFeb 27 at 7:54 PM\nGreat game\n\nThis game is fun and interactive and could play forever. They just need to add more mountains to climb eventually but its still well worth playing\n\nHelpful | 0", "Tonker_chonkerMar 21 at 7:47 PM\nAmazing game\n\nVery good I just wanted to write a\n\nHelpful | 1", "cheetah125Mar 12 at 11:53 AM\nA serious workout\n\nThis game is exhausting both physically and mentally but its a breathtaking game\n\nHelpful | 0", "booboocachooFeb 25 at 5:45 AM\nOther reviews must be paid.\n\nThis game is just very, very boring. I did 2 tutorials and 2 levels. It's not immersive at all, your head will frequently go through walls causing the game to bug. Falling and dying is annoying not because this game is challenging, but bc the falling sound of the man or woman screaming is just stupid. Don't get this game. My little brothers found this game boring, all my friends found this game boring. It's such a bad basic vr game and 30.00 aint it chief\n\nHelpful | 10", "GinaozFeb 28 at 8:03 PM\nFantastic\n\nLove this experience. It took awhile before I could learn basic moves but once I did wow what fun. Highly recommend just give yourself time.\n\nHelpful | 0", "ttv.kurk-ulasMar 24 at 10:41 AM\nGreat game for the family\n\nThis is a great game for the family but over time it becomes more of a slow pace game\n\nHelpful | 0", "charlievr420Feb 16 at 2:02 PM\nAmazing game\n\nOutstanding graphics and amazing gameplay but you could make it a little easier to scrape the stones if someone me of the holds as sometimes it takes like 2 muinits of trying to get it to work\n\nHelpful | 0", "tomflemonsJan 25 at 8:23 AM\nAmazing!\n\nAfter Moss this is my top title for the Quest. The graphics are excellent and to do it on the Quest without loosing much of the quality (I believe it is even better on tethered VR) is amazing. I am scared of heights, despite having done some moderate via ferrata in the Alps and steep scrambles in the UK's Lake District and Snowdonia. Still every time I open up The Climb my knees go weak. That makes extra exciting and enjoyable for me and it is probably the game that will take the longest and that I'll get most out of. But it's not really a game, like really climbing it is more of a personal challenge, despite the leaderboards etc.\nMy only complaint is that I'm not very competitive and would like the tourist option to be open on all levels, as it is the views and exploration I enjoy most.\n\nHelpful | 0", "PurplemikeyDec 3 at 6:57 PM\nGreat game - some major flaws\n\nI first tried the climb in 2016. It was on the rift... With the newly released touch controllers. I didn't noticed the weird control scheme because it was my first time playing VR... But I did noticed the amazing visuals!\n\nI decided to wait till VR would go mobile. Here we are. Never thought this game would be that gorgeous on the Quest... The game runs and feel great. The maps, the unlocks, the hidden stuff, ... This game have a lot to offer! But the most rewarding climbs comes at the hard levels.\n\nCombine many mechanics to get to the summit and enjoy the view!.. but make sure to change the controls settings. Here comes the negatives... Default controls are killing the immersion. Pinch to grab... Grab to chalk... Why?! Bad decision. Changing the setting is easy though.. but it won't save your preferences! I had to do this every time I went back in the game. The texture on the surrounding environment is not high quality enough to deliver a good view when reaching the top. Less noticeable on night scenes but day scenes can be ugly to stare at. One last point is the fact that streaming the game will make the headset overheat. We're really at the limit of the Quest...\n\nBut overall it is a very solid experience! Glad I bought it. Thanks for porting.\n\nHelpful | 92", "kkuzma1982Feb 7 at 4:27 AM\nOutstanding show of what Quest can do\n\nOutstanding title that shows of what the Quest is capable of. I only wish the blurry background can be somehow exchanged to more high resolution one. Other than that there are only positive sides. Great gameplay and replayability.\n\nHelpful | 0", "incompletegeekFeb 4 at 1:55 PM\nThis is awesome!\n\nI am really enjoying The Climb! Its exhausting which I didnt expect but I think thats the immersive environments you climb in and the real anticipation and concern about falling thats causing me to lock up my arms! \n\nIt took me a while to work out why the screen was going black (my head was intercepting the scenery) and this was causing me to lose stamina and fall. Now Im aware of it I can usually work out where to move my head to get out but I feel theres a better way to handle this? Maybe an arrow or description to show you which way to move? Apologies if Ive missed this in the game.\n\nHelpful | 1", "SoapychipMar 9 at 7:09 PM\nGood but some problomes\n\nIts really good it has a good amount of levels and there pretty fun. The only reason its not a 5 or 4 star is because the race mode isnt working and me and my friends really want to race. Ill probably change it to 5 star if someone tells me how to do it because its not working for me.\n\nHelpful | 0", "nozzac2001Mar 13 at 5:50 AM\nGood for a bit of fun\n\nIt's OK. Once you've got over the general sense of amazement of VR world's, you're left with a fairly basic, mechanical game requiring eeking out stamina, a bit of planning and some timing skills. A few hours fun tops I'd say. After which it becomes boring. I got mild nausea from it.\n\nHelpful | 1", "ParadoxPlate_4DMar 15 at 9:41 AM\nGood\n\nVery good\nHe her \n\nHelpful | 0", "stormshadow612Jan 21 at 4:37 PM\nIncredible and terrorizing game\n\nIm incredibly afraid of heights and yet I play this game.\nI can only last one climb and I need a break the only game on VR that has me saying holly crap this is insane. For some reason Im stuck on level 7 I cant rank up past it and Ive climbed all the mediums levels over and over.\n\nHelpful | 1", "evans191118 days ago\nNo\n\nControls are very wonky the grabbing sucks and the menu controls sucks (the graphics are good\n\nHelpful | 0", "TallyMarkJan 8 at 7:31 PM\n5/5 for sure\n\nIt is a little buggy when jumping from one ledge to another at times but it honestly just adds to the difficulty level, which Isnt a bad thing, youd expect to some times get caught up on a rock when jumping. I honestly just cant believe that the quest can run this game this smoothly. IMPRESSED IMPRESSED IMPRESSED IMPRESSED\n\nHelpful | 8", "DonskibearJan 19 at 2:50 PM\nAwesome\n\nSo nice to play a totally different kind of game. As a vertigo sufferer I took the plunge (literally) but was glad I did. Beautiful to look at, fairly physical which gets you off the couch. Totally scary at times but this makes it exhilarating and strangely addictive. My aching arms was the only thing that finally made me quit playing today. Love it.. but it .. simples!\n\nHelpful | 1", "SloppyJoe2008Jan 20 at 2:58 PM\nBeautiful! Stressful! Awesome!\n\nIf you have ever played Breath Of The Wild of Red Dead Redemption 2 youll know about the ambient melody whenever you discover something beautiful, that combination of beauty and melody is this game in a nutshell, its beautiful every time you get to stop at a checkpoint. The climbing of this game is stressful yes, but once you get past that its fun and awesome. Great game, beautiful.\n\nHelpful | 1", "PaleoFossil254 hours ago\nKinda what you'd expect\n\nReally fun game. Only gets 3 stars because 1) It's a game abot scaling a mountain and, though the scenery is cool, a rock wall can only get so interesting and 2) I don't like how if you move your head into an object the screen completely blacks out. If the game really wanted me to move my head out of the way it would let me see so I could reposition myself, and there are parts of certain climbs where this feels unavoidable. Other than that it's well made and fun for about an hour before your arms get tired.\n\nHelpful | 1", "joe.hoffman.701Mar 18 at 5:15 PM\nGreat game\n\nAwesome\n\nHelpful | 0", "sketchrexFeb 11 at 10:30 AM\nAbsolutely love it!\n\nSo much fun! Can be exhilarating or relaxing, depending on what youre looking for. I recommend this to anyone just picking up the Quest. Its a wonderful introductory experience.\n\nHelpful | 1", "dprocsrealityMar 4 at 7:36 PM\nGood\n\nIts a really good game with a little challenge. Sometimes I dont know where to go next but I always figure it out in the end.\n\nHelpful | 0", "StixAhoyJan 30 at 11:36 AM\nI love the game!\n\nI love The Climb. I play it any chance I can and have a blast on it. Dont get me wrong I would really want to rate it 5 stars, but there are some bugs that need to be fixed. Whenever I go into a race, it always lags out and has temporary pauses which annoy me. Also, when I go into different matches, the music and sound static a little bit. I dont know if its my headset or the game but whatever it is, just fix it. Thank you for reading this.\n\nHelpful | 0", "Lil_GabieBabyFeb 17 at 8:18 AM\nGreat game\n\nIts a wonderful game, couldnt put it down when I bought it. Every time I hop on my quest, I end up playing it for 40 minutes to an hour.\n\nHelpful | 0", "PotatoBatmnJan 15 at 9:51 PM\nTruly Amazing\n\nIn all honesty, this game is amazing. Im not an type of rock climber in real life but this game is still so good to play. It looks and feels amazing even with the Quests slightly downgraded graphics. The change in graphics is not noticeable unless your looking to criticise it because the views in this game are amazing. Definitely get this game, its worth the money.\n\nHelpful | 0", "amraKarmaApr 25 at 7:32 PM\nAgoraphobic's Unite!\n\nThis is my first review for a Quest game. My 2nd purchase. Short and sweet, if you like climbing (get it). I'm a former rock climber. If you're slightly agoraphobic (like me), take your time & use it to conquer your fear. More on the extreme fear of heights side, ya might poop. 5 Stars.\n\nHelpful | 0", "OniumFeb 18 at 11:43 AM\n\nHighly recommend. Tricks your mind into really thinking you are off the ground which is a fantastic sensation to experience in VR.\n\nHelpful | 0", "ISI98Jan 15 at 1:44 PM\nOne of my favorite...\n\nThe Climb is not only amazing, because of the graphic. I love it also, because you have many levels, each with 3 steps (easy, middle, hard), you can climb, for fun, you can climb to search something hidden or you can climb as fast as you can, and get new highscores.\nIt's one of this games, that is always cool to play and it's never ending.\nSome games have 60 levels and after that, the game is over, climb will never be boring and I would say the price is perfect for what you get.\n\nOne thing also might be interesting.... I'm very scared of high, but the more often I play, the less I'm scared. It doesn't mean I would climb in real life like this, never, but your head gets more comfort with VR high (of this game).\n\nHelpful | 0", "FinnyWiggenDec 10 at 5:14 PM\nWith all due respect...\n\nWhat kind of insane people do this in real life! After fifteen minutes into a climb, my brain forgets that I am in my living room, nice and safe, and I get much more nervous / cautious. Jumping from a cliff face to a metal cable, then from the cable to a gondola... then standing on top of the gondola hundreds of feet in the air! Seriously, I know real mountain climbers don't jump to gondolas, but what kind of an insane person goes up a mountain for no reason...\n\nOkay, that rant behind me, this app is fantastic. A lot of fun. Though I need time after to decompress a bit, as it is very intense.\n\nA lot of fun. Highly recommended.\n\nHelpful | 5", "Venom211Apr 11 at 10:56 PM\nGlitchtastic!\n\nRestarted 3 times in 30 mins. Kept freezing losing all of my progress. Then failed again two more times in the next 45 mins. Not happy.\n\nHelpful | 0", "EvieXboxFeb 29 at 10:30 AM\nSsssoooo scary and fun !!!\n\nIve never been more scared in my life. Its such an amazing game\n\nHelpful | 0", "cookiemonster18Jan 17 at 5:55 PM\nAmazing\n\nYou can read all of these reviews and Im sure they will be more helpful, but I just want to appreciate how amazing this game is. From the scenery to the actual climbing this game hits everything. Im not going to elaborate because again you can read all other reviews.Just wanted to say this is an excellent game to play.\n\nHelpful | 0", "GPMOX365Jan 13 at 2:38 PM\nVery good\n\nAt first I was thinking this or beat saber Im glad I bought this game the views are stunning mechanics are awesome, you could not possibly get bored of this game. But also the climb is very motivational and encourages you to get out there and start to try things no matter the fear. What a good game\n\nHelpful | 0", "xxpeterxx33Jun 17 at 11:42 AM\nThe climb\n\nThis is amazing\n\nHelpful | 0", "crawfoooooordJan 5 at 7:04 PM\nClimber aproved\n\nIm a rock climbing in real life and its been pretty fun so far. I think its a great way to get more people interested in climbing and Ive even made plans to take some of my friends climbing after they played it. I absolutely recommend this Game to anyone whether they have never climbed a day in their life or have been climbing since birth it provides a challenge for all.\n\nHelpful | 3", "OwOTrainJan 25 at 4:02 PM\nClimb\n\nI love it!! I am obsessed. My kid doesnt like it as much, I think he has a hard time reaching and ducking with his short arms, who knows. As an adult, this game is so cool and is a pretty good workout. Awesome awesome game\n\nHelpful | 1", "RogueCeeday58Feb 26 at 6:37 PM\nThe Climb\n\nIt is a great game and good for excersizing.Keep up the good work!\n\nHelpful | 0", "DickDastardlyDec 3 at 2:19 PM\nGreat port of a standout game\n\nAfter getting through the tutorial and into the actual game environments, I was blown away by how close Crytek have managed to get the Quest version's graphics to those I remember from the Rift years ago.\n\nOnce you look a bit closer you start to see some of the differences, the gorgeous animated skyboxes are now static (albeit still gorgeous), textures are a little less crisp, and there's a bit of foveated rendering in play, but none of this really matters as the experience itself is largely unchanged. I still found my hands sweating copiously as I inched my way up the cliffs and felt my knees sagging with relief when I hauled myself onto the platform at the top and wooped with delight (virtually and IRL).\n\nIt was only after a few climbs that I also noticed that I'd not had any tracking issues despite frequently moving my hands outside the Quest's tracking volume. It would seem that at such times the IMU's do a great job of filling in the gaps (which bodes really well for Echo Arena).\n\nOne issue I did see, however, was with the foveated rendering. It looks like the cameras which render the lower detail outer edges of your view are sometimes misaligned with those which render the higher detail inner part. If you slowly turn your head and watch the border area, objects seem to move slightly upward as they enter the lower detail region. This can be quite distracting, but should hopefully be easy to fix.\n\nThere's a decent amount of content here and quite a lot of replayability as you try and beat your own and friends' times on multiple routes in 3 environments (Alps, Bay & Canyon), although \"North\" which was added to PC as free DLC appears to be missing. Hopefully it'll be added soon, and I'd also love to see paid DLC after that. After getting this version for free thanks to cross-buy, I'm more than happy to pay for more environments!\n\nOverall then, an essential purchase - what other game (and HMD) lets you carry several mountains around with you wherever you go?\n\nHelpful | 6", "cortlin411May 22 at 8:35 AM\nGreat game\n\nFun! Best climbing game I have planned. Keeps my interest while playing without getting bored. Its exciting and thrilling to play.\n\nHelpful | 1", "MegazardMar 5 at 9:01 AM\nDank.\n\nThat's all there is to it.\n\nHelpful | 0", "TheZestyLimeFeb 18 at 11:18 AM\nAmazing\n\nJust amazing\nEven on the quest the graphics are amazing and the gameplay is perfect I highly recommend it!\n\nHelpful | 0", "MahouAizakkuJan 8 at 2:15 PM\nExcellent Port!\n\nIve played this game quite a bit on PC, and I was super happy to see that it plays just as well on Quest. The mechanics work the same and the maps are exactly the same as well, which is quite impressive considering the size of some of them.\n\nPretty much all of the cool lighting effects like sun glare and the headlight in dark levels are gone, but the experience is still there and the game looks quite good despite that. Kudos to the developers, and also being considerate enough to make it cross-buy after so many years. I wouldve paid for it again.\n\nHelpful | 1", "Shilly-ShallyDec 3 at 10:40 AM\nMy new favorite Quest/Rift S game!\n\nI played it on the Rift S and after that with my Quest via link mode and NOW finally wireless on the Quest without issues compared to using Virtual Desktop or ALVR.\nAnd it is a crossbuy title - you get the both version no matter which you buy!\nCompared to the Rift S version the graphics are downgraded by a margin BUT it still looks good annd performs well. Everything else seems to be as good as in the Rift S version.\nGetting rid of that cable and moving free in all directions really adds to the immersion. The tracking is really good - i had no issues or anything on my first 30 minutes.\nI am a person that really suffers from motion sickness and nausea but The Climb is one of those games with MODERATE comfort level and i can play it a lot longer than other games with COMFORTABLE rating!\nFor me a 5/5 stars game and a must-have title!\n\nHelpful | 19", "WilliamGbossMay 11 at 12:57 PM\nAmazing game\n\nAt first I thought it looked like a bit of a ripoff but after playing it is one of my favourite games to play\n\nHelpful | 1", "poyrazzzaa12Mar 3 at 12:36 PM\nGood For Quest\n\nGraphics very good and game too!\n\nHelpful | 0", "Last_PlaceJan 2 at 7:01 PM\nToo Good; Needs More\n\nI played through this too fast. Theres several levels and hours of gameplay, but it can be done faster than you would expect from a game this expensive. I still give it 5 stars, because I hope there will be new content, and because all of my friends also say the game is amazing when they play it.\n\nHelpful | 3", "ZaessMar 10 at 11:14 AM\nNice\n\nVery good, and balanced but we need more level (pls 4 free)\n\nHelpful | 0", "YG_TrippieFeb 26 at 8:59 PM\n\nWould have got four stars but it glitches when i jump sometimes other then that its a great game I highly recommend it\n\nHelpful | 0", "VR_MartinJan 27 at 8:35 AM\nFantastic\n\nI watched my friends on YouTube play this . So when I saw it was out on the Quest it had to be bought straight away .\nThis is one of the most emersive games I have ever played in VR .\nThis is a must have for a VR enthusiast .\n\nHelpful | 0", "Zzippy77Jan 22 at 6:17 PM\nGreat game!\n\nIm very new to the vr world and Ive only played a few games. This is my third one and its taking up all of my time! Excellent design, perfect way to lose yourself, peaceful, and just amazing. Definitely worth the money\n\nHelpful | 0", "SdempseyDec 3 at 11:51 AM\nThis is VR is all about!!!\n\nIve played VR since development kit days, and this game made me jump when falling. Its surreal, heart pounding fun! Climb your way to higher scores, take risks by jumping from ledges, enjoy the scenic views!! Do NOT miss out on this masterpiece.\nWell done Crytek! 5 stars!!!!!\n\nHelpful | 6", "T-CroJan 5 at 7:41 PM\nI dont like heights\n\nSteven Wright said A lot of people are afraid of heights. Not me. Im afraid of widths. I do not fall in that category. I HATE heights! This game is terrifying at times. It really puts me in the moment and I feel like Im climbing a mountain. I dont know if it will be the same experience for someone that is comfortable with heights, but I can tell you I find myself hugging the side of the mountain during the climb. I am afraid to look down. I have to close my eyes when I inevitably fall to my VR death. I recommend you buy this game. It is a truly immersive, although limited, VR experience.\n\nHelpful | 1", "cara_amiraFeb 22 at 4:50 AM\nPretty ok, really hard\n\nBeautiful, great exercise.\nAllso REALLY frustrating, 'cause every locations two last tracks are just impossible. I'm quite sure not being only one who feels the same. This takes almost immedietly the joy out of achieving those 13 stars you need to be able to unlock the last tracks. :(\nSo please!! take away the demanding not to chalk your hands to get points.\nIt is nice to catch yourself thinking when high above in the air, that is this really the same mountain I have climbed before. So having different routes is nice add.\nAll and all quite versatile game with all little tasks to achieve, BUT really hard.\n\nHelpful | 1", "CrylogermFeb 28 at 7:30 AM\nGood\n\nGood. gaMe. Buy it yes , VErybn\n\n-GhanaMaN\n\nHelpful | 0", "CaptZaneBaldorJan 20 at 12:39 PM\nAmazing gameplay and graphics\n\nThe steep price can be intimidating but this game is awesome. You can climb and jump from rock to rock. The graphics are great for chill climbing but can be intense and competitive trying to beat your time and unlock achievements. I love it I just wish there were a few more climbs available.\n\nHelpful | 1", "Rouge0070Apr 10 at 4:11 PM\nHi\n\nGood but after I play all the levels there is not much else to do\n\nHelpful | 1", "ScorpionQueen51Mar 20 at 7:27 PM\nIts okay-ish\n\nThis game is great love it but the thing is all u do is climb I have not seen any multiplayer games at all this game is not the game for people who get tired very quickly if you get the game then...Good Luck\n\nHelpful | 0", "NerfensteinJan 5 at 3:15 AM\nWell that was exhilarating...\n\nI was new to The Climb, having watched and read many reviews in the lead up to its release. Dubious as to how a game could make you feel like youre climbing, when youre standing in roughly one spot. Well, bravo developers, amazing work.\n\nBeautiful visuals, simple controls and an amazing sense of actually being there. Its a must buy game, just for the WOOHOO buzz you get when you make it to the top.\n\nHelpful | 1", "Nost343Feb 8 at 3:07 PM\nSeems neat, has issues\n\nWell...yeah. So. This seems like a cool game, but I'm 45 minutes in and it's already had enough problems that I put it down for the evening. Note: playing on a brand new Quest.\n\nMinor issues:\n-the loading screens all stutter and glitch--frankly just looks like it's a port that's straining the Quest to the limit. The fact that one of the glitch-wipes was the Cryengjne splash was darkly amusing to me. I think it was created by someone who hated graphics drivers and wanted to punish them.\n\n-the \"jump\" mechanic keeps putting my head through objects, which blanks out all your visuals until you physically move...except you're not sure where the problem is because you just went flying through the air before being struck blind by the cruel and capricious god of misfortune, so you just flail around blindly looking for that precise handhold you were reaching for until you hear yourself fall to death behind the \"I can't let you do that Dave\" screen. Which is fun and all, but SOME people might call it \"some bullshorts.\" I call it a minor issue because restarting is instant and fairly painless.\n\nAnnoying design gripe:\n-Apparently you're stuck with one map until you hit Arbitrary Video Game Player Level 10, so I hope you like it for at least a couple runs. How many? I have no idea, because...\n\nMajor issue:\n-my daggum game locked up. The Quest is a standalone console, so....needless to say, I found this surprising. I got stuck in a sickening loop where my player and the world froze, but the audio glitch-repeated and the camera controls went haywire (moving in exact opposite to my physical motion). I don't get motion sick, even in the heavier VR titles, but...yeah, that came pretty close. The whole system froze, too--no retreating back to the Quest menu to stop the app. It finally self-killed, I think as a delayed reaction to me hitting the power button minutes earlier.\n\nBottom line, this seems like a pretty neat game that I'm not sure works very well. I'll probably pick it up and give it another shot in the future...but not today.\n\nHelpful | 2", "tobisluDec 3 at 12:50 PM\nPlaying since the Touch update on PC\n\nMasterpiece gaming. My only complaint on PC was how the wire reduces immersion; my only concern for Quest is load time and the quality of tracking when turning your head away from your hands, but even if those are major issues, this -still- deserves 5 stars.\n\nJust hearing the climbers' voices; seeing the climbers' hands... It's so engaging; especially as a trans woman! This game really pulls off embodiment, and I would go so far as to say that this game is therapeutic for those with gender dysphoria (admittedly, I can't even play as the male avatar anymore!) I've played through each of these levels dozens of times, and I plan to return on a daily basis!\n\nThis is my desert island VR game.\n\nHelpful | 5", "Wfg51963Jan 28 at 12:17 AM\n\nI love the Graphics everything about it what's good is extremely meditating and it takes me away not being able to walk good I can go to different locations its therapy.\nLike getting fresh air.\n\nHelpful | 1", "DigitalClutterJan 8 at 4:15 PM\nWell crafted simulation\n\nI love The Climb it absolutely gives me every inch of immersion I would expect from Quest capabilities. A very fun and well mapped out game. Solid physics!! 10 stars coming from someone that climbed every morning in gym class. If you climb, and you miss it. Dont think about it. Try it ..you will absolutely love it!!!\n\nHelpful | 1", "ElizaHammond12Feb 4 at 11:15 PM\nAbsolutely brilliant !!!!!\n\nI cannot day how HAPPY  I am with this game! My whole family LOVES to play it! Thank you so much for making this its just what oculus needed !!\n\nHelpful | 0", "RJ-D3Jan 2 at 10:12 AM\nAlmost the perfect game\n\nI love games like this. Climbing is one of the best mechanics in vr. I was glad to hear there was a climbing game in vr but when I got it I beat it in only a couple of hours. Now they have the endless climb mod which is good but it would be nice to see that with the alps, canyon, or zen theme. I am not a climber in real life so I have no idea how much you have to chalk your hands, but in this game I feel like I sped more Tim chalking my hands then climbing. Other than that this game is great. I would recommend.\n\nHelpful | 2", "MagicMedleyJan 13 at 4:25 AM\n\nVery excellent game, I much enjoy the graphics and how immersive this game is. One thing I have to say is when you accidentally move you head into the cliff you completely black out, it would be better if it just didnt let you enter the cliff in the first place\n\nHelpful | 4", "finnandscarletFeb 10 at 6:08 AM\nGood game\n\nIn general it is a nice relaxing game with amazing views. But I have to say that there are not a lot of different places and the game is $30. Otherwise I would recommend this game.\n\nHelpful | 1", "musse477Mar 2 at 8:04 AM\nVery fun!\n\nEnjoyed it plenty.\n\nHelpful | 0", "Earthmagician47Feb 25 at 2:51 PM\nGood game\n\nIts just a good game to be completely honest\n\nHelpful | 0", "Stoplight001Jan 6 at 8:27 PM\nHOLY COW\n\nOk so I'm not afraid of heights and this game makes me nervous. It dosent have any help guiding you to each stone which I like so you literally have to find your way around mountain cliffs. Graphics are one of the best I have seen. The powdering hands are tricky and challenging and when you fall the person screaming actually sounds like your falling makes it even more intense and real. Amazing job developers. But it is a must have for those thrill seekers! I have fixed my review as they have fixed all the issues I had with it earlier! Now its practically perfect.\n\nHelpful | 4", "basementjackJan 1 at 11:39 AM\nTHIS IS WHAT VR IS FOR!!!\n\nUnbelievable.\n\nPart game, part 'interactive experience'\n\nSupports cross buy so you can use it on PC or Quest\nThe quest actually looks pretty good.\n\nI played on the quest today and was shocked when it said I'd been playing for 30 minutes - it felt like 5.\n\nI will say you have to put a solid 15 minutes into it and understand both tutorials (basic and advanced) Like others, I had \"tried\" it before on the wired oculus Rift and while I thought it was \"neat\" but I haddn't really spent enough time with it - didn't even get to the top of the first climb.\n\nRight now I'm charging my quest and I really can't wait to get back - this is fantastic.\n\nHelpful | 2", "Pheonix55Mar 15 at 7:13 PM\nGood game\n\nGood game\n\nHelpful | 0", "Mortal66Jan 26 at 6:39 PM\nI am a rock climber and this is amazing!\n\nI am a rock climber and when I bought this game I knew it was going to be amazing! I was right! The graphics are truly amazing. When I fall I have to stabilize my self! VERY immersive.\n\nHelpful | 0", "HeadInTheClouds7Feb 26 at 3:37 PM\nAwesome Game (:\n\nTons of fun and Stunning graphics\n\nHelpful | 0", "lynne.fasoneJan 31 at 7:16 AM\nBest Game Ever\n\nThe Climb is a very unique game. And it feels so real. Also I like the replay ability and the ability to have different difficulties. This is truly best game ever\n\nHelpful | 0", "Tigerlilly346Jan 26 at 1:04 PM\nGreat Game very realistic\n\nI really like this game and found it exciting and challenging. My only wish is that they would add the North as they gave for the Rift version. I really hope to see more additions added.\n\nHelpful | 0", "RowdyRocketDec 19 at 8:53 AM\nBrilliant!\n\nI had my hesitations about whether or not this would port well to the Quest. The original was very demanding on my system even though I had above the recommended setup. The downgrade to make this work seemed like it would suffer greatly.\n\nI installed it as soon as it was released and was disappointed as expected for the lack of ambience that was in the original. The game place was wonderful but I just really enjoyed the exploration and surprises of nature that would pop up.\n\nBUT NOW... The latest patch had brought the ambience! What a surprise! As good as this plays and looks I am curious as to why the original was so demanding. I'm loving it and wishing they would tweak the original to bring down the system load a bit.\n\nNow I'm just waiting for the \"North\" location to be added. Exciting times we live in! \n\nHelpful | 2", "SquishyPancake9Jan 3 at 3:48 PM\nAbsolutely Stunning\n\nAs a new virtual reality user this game is fun and challenging. You will never get out of it easy. It always keeps me interested in the game play. Definitely a must get for any virtual reality user. The scenery shocks me every time I reach the top the mountain. All and all this is definitely worth more than the price tag.\n\nHelpful | 0", "KittenPugJan 24 at 7:51 PM\nGreatest game ever\n\nThis was possibly one of the best games I have ever played. The graphics are amazing, the gameplay is on point, and the levels range from fairly easy to brutally hard. 10/10 would recommend.\n\nHelpful | 0", "HighMartinFeb 26 at 12:50 AM\nNice\n\nReally good climb experience.\n\nHelpful | 0", "clintlandonJan 18 at 6:16 AM\nBetter on Quest Than a $1100 Computer\n\nIf youre getting this for Quest, its surprisingly great in its look and feel. By comparison, the PC version is shockingly poorly optimized.\n\nIt defaults to graphics so low I could only tell what I was looking at because I saw the same assets on Quest first. If you want it to look better, enjoy spending a half hour tweaking settings to figure out how to make it look even close to acceptable compared to a MOBILE HEADSET.\n\nI could probably get the PC version to an acceptable point, but its clear they gave up on modernizing this game and I dont care enough to brute force an acceptable experience.\n\nAlso this is a minor thing but it bugs me, the PC hands are COMICALLY HUGE! Seriously, they look realistic but are at least twice the size of human hands and its very unsettling.\n\nHelpful | 1", "Tr3yNy3Feb 23 at 1:50 PM\nGreat game\n\nIf you are contemplating getting it just get it\n\nHelpful | 0", "just_another_90s_kidFeb 18 at 1:36 PM\nlevel 2 seems broken?\n\nThe first level of the game looks stunning and was really fun to play,\n\nbut for some reason the second level (orange rocks) the geometry,textures and lighting is really bad its such a shame as the first is beautiful and easy to forget its a game but the second level breaks that illusion very fast \n\nHelpful | 2", "exjraordinaryDec 3 at 4:47 PM\nAAA gaming\n\nCrytek did a phenomenal job feels like a full AAA game with high production values and great graphics on quest. this is such a workout just did three climbs and both tutorials and it reminds me of that movie Cliffhanger so intense and really immerses you of being there. Having to stretch your arms and make that next jump is intense easy a top 5 quest experience.\n\nHelpful | 4", "BillyBruh41Mar 8 at 7:56 PM\nYes\n\nGood but not as good \n\nHelpful | 0", "CASEACE79Jan 22 at 8:32 PM\nAwesome but\n\nThis game is beautiful but beware if you dont have your VR legs yet. The vertigo is something you need to get used to. But dont let that turn you off. Its certainly worth the effort.\n\nHelpful | 0", "pacxx03Feb 20 at 1:01 AM\nWOW!\n\nWOW WOW WOW. Pleeease give us more maps!\n\nHelpful | 1", "GALGOOLJun 17 at 9:31 PM\n\nNeed more levels\n\nHelpful | 0", "AntinowhereJan 18 at 12:10 AM\nMust have\n\nIncredible game, beautiful scenery, loads of replayability. Overall exciting and fabulous looking game that has kept me interested for hours on hours and I havent even gotten close to finishing the campaign!\n\nHelpful | 0", "Arcyst19 days ago\nThe Best Vr title\n\nI felt a connection with this game because I hike and climb in ril. This game is not a ordinary VR game this is a masterpiece because of how nice it looks and how it plays. I rate this game 5/5 and it is truly a epic game. ;)\n\nHelpful | 0", "CryspycreamDec 3 at 7:34 PM\nAMAZING GAME EVER\n\njust played this for 15 mins and already im moving fast with climbing they even have a free style mode with no chalk or stamina if you wanted to climb free but its worth it with the chalk because it feels like a challenge and the view is amazing! the graphics like real vr fishing too worth the money and the maps have great quality too i recommend getting this game i cant wait to see updates in the future\n\nHelpful | 4", "vandezumaDec 28 at 3:02 PM\nCant stop playing!\n\nThis is the first game on the Quest that makes me want to keep coming back over and over. The realism, gorgeous scenery, the physicality of the gameplay, plus cool unexpected elements like zip lines, cable cars and Easter eggs. And new levels dont unlock too quickly - this forces you to try alternate routes on levels youve done before, resulting in major replayability. 10/10 would recommend.\n\nHelpful | 1", "jacobphilliDec 26 at 6:38 AM\nGraphically awesome, intuitive\n\nThis is one of the best looking games on the quest. You really feel immersed in the different environments (three major areas). Each area has three different climbs for a total of nine climbs in the game, and they do get more challenging as you progress. The trick to make it feel realistic is to not press the grip button all the way down, but to instead have finesse and hold so the indicator is blue instead of white. This actually requires focus and a steady grip, and risks being too soft and slipping off. Not too hard but not too light with your grip. Additionally, you can chalk your hands to increase the stamina of that hand for difficult sections that force you to reach farther or hang from one hand. The jumps are pretty challenging at first, especially if you use the natural method of physically pushing off a wall with hand motion instead of the jump button.\n\nTheres also an endless wall mode in a digital-looking environment.\n\nYou earn rewards for various achievements or finding things on your climbs to unlock new gear for your hands (watches, gloves, wristbands).\n\nEach climb takes 15-20 minutes if youre moving thoughtfully, so about 3 hours of game time first time through. Then many more for achievements.\n\nThis is a great game for showing people VR for the first time. Theres a tourist mode for every level so that stamina and chalking your hands is disabled allowing new people to have an easy time and jump in.\n\nHelpful | 2", "JustaIndianDec 30 at 6:22 AM\nPure immersion\n\nWhile the price might seem to high it is definitely worth it. First of all its cross buy so if you arent satisfied with the quest graphics just jump into the rift version with a link. While there arent many maps each level can take a long time for the unskilled so there is a good amount of gameplay. BUT once you do best all the maps, you are encouraged to do them again since all the maps have multiple routes to the end, ways you can cut off time. Best of all you can race against your past self with virtual hands climbing with you, or race any of the top Scorers.\n\nNot a competitive person? No worries you can go into tourist mode to just enjoy the scenery and climb without any worries. Can be a meditation game if you want it to.\n\nLastly the gameplay is tough yet fun. You have to watch your stamina, your amount of grip, you gotta put chalk on if you want to keep stamina, brush off rocks, do jumps with two hands.\n\nDefinitely worth it! Hoping more maps would come out in the future!\n\nHelpful | 0", "ben.povall.142Dec 28 at 2:47 PM\nA must have\n\nI got a quest for Christmas and immediately bought this game. I made a great decision it is easily my favourite game on the quest and the best looking by miles.\nGameplay is immersive and extremely fun when going for high scores. Although it can be relaxing in tourist mode/Just taking things slow, if you have money for one game or wanna see what your quest can do. this game is perfect please buy!\n\nHelpful | 1", "SouthernSniper-13Apr 19 at 8:56 AM\nDetails, Details, Details\n\nThis game is by far one of the most detailed games on the Oculus Quest. I very much enjoy this game but I was surprised to see it listed as one of the five most immersive games on the Quest. In games such as SuperHot and Beat Saber I lose myself in the complete immersion that these games offer. Unfortunately, I did not feel the same way about this game as I felt that I could just tell that I was in a game and was not lost in the immersion as I was in the other games. But saying that, I do love the game and what it has to offer. The tracking in this game is exception and I like how the game is simple in a sense but it is so hard to complete. As I just payed $400 for the Quest, I expected the games to be a bit cheaper than what the games are listed at and there is not exception for this game. I was not filled with joy when I saw this title listed at $30. But other than that, this game has so much to offer and it is a great overall experience. Another thing I will mention is that the duration of this game is great. In the Vader Immortal games, the only thing that I was dissapointed in is that I finished the whole series in around 3-4 hours. I also would not recommend this game to a beginner who just got the Oculus Quest as it requires a decent amount of skill.\n\nOVERALL = I LOVE THE CLIMB\n\nHelpful | 2", "noozledDec 3 at 12:51 PM\nIts Finally Here!! CROSS-BUY!\n\nI have waited and waited and waited for this app to finally come to the Oculus Quest. As a previous Rift Owner, The Climb was always one of the most beautiful and immersive games around, also being a great demo to show friends whove never used VR before (its just so easy to catch on!). The Rift version was applauded not only for its gameplay but it was highly praised for the graphics. Coming to the Quest everyone was a little worried about the graphics taking a hit, which was a completely valid concern, but Crytek clearly took the time to please us. Yes, the graphics will not match the Rift perfectly, but theyre still pretty darn good. The Bay setting looked amazing, and near exact to what the Rift brought. The textures were maybe just a little smoother (just the smallest bit), but the lighting was still stunning and compensated for the slight downgrade. However Im not sure why, but I feel like the Alps have been downgraded slightly more. The textures just didnt seem right in some places, though it still does surpass expectations. I am yet to try the Canyon maps. I also am so pleased they have cross-buy enabled because I probably would not have spent $30 on this game a second time so Im very thankful I installed it free. If you havent played the Rift version before you will be absolutely stunned, and if you have, this game really still holds up on the new hardware.\n\nThanks Crytek!\n\nHelpful | 4", "louis.castricatoDec 3 at 11:10 AM\nReally good! Minor issues\n\nThe foveated rendering does not lend itself well to the vistas. It needs to be tuned back a bit when youre just getting a view of the landscape.\n\nIs it bad that I find the screaming sound effect hilarious? It just sounds so fake....\n\nBesides that the game is honestly amazing and an absolute must buy.\n\nHelpful | 13", "SilverVampire42Dec 27 at 1:20 PM\nOne of the best for new players\n\nI got this game because it looked awesome to show the family for Christmas with good amount of play time for myself. I lost the headset to my dad for a few hours because he loved this game so much. It even was able to make my mom (who hates games) able to understand the appeal of VR. Definitely a must to show off to family and friends while still having a ton of fun yourself\n\nHelpful | 1", "catmaster675May 30 at 6:51 AM\nAmazing\n\nBlew me away how great it was\n\nHelpful | 0", "Johnny_AJan 10 at 8:41 PM\nNice game, just needs some tweaking.\n\nGreat/helpful tutorials suit the dynamic of the game and the scenery could be absolutely stunning... with the exception of the darkness and lack of sun and distancing quality. The only other (minor) issue I had was an issue in the more advanced levels where you had to brush off pebbles from some of the grips which was a bit dysfunctional. Very fun and thrilling over all, though. Almost fell over a few times lol.\n\nHelpful | 0", "deeptech_incMay 22 at 6:37 PM\nAHHHH!!!\n\nI didnt know I was scared of heights until I played this!\n\nHelpful | 0", "hubbleHQMay 24 at 8:02 PM\nGood game\n\nLove the graphics and decently long levels.\n\nHelpful | 0", "Highlander2020Dec 28 at 8:11 PM\nWow!!!\n\nTried this out after going through tutorial and setting up my guardian area. What fun! Literally a minute in I was hooked and couldnt tell you where items were outside of guardian zone. Completely immersive. Visually stunning and I get a little exercise in the shoulders as well.\n\nHelpful | 1", "ShadyDaniFeb 12 at 4:28 AM\nBest game I ever played\n\nIt's a good game and you can play it again how many times you want\n\nHelpful | 0", "ben.dorningDec 27 at 11:56 AM\nGreat game\n\nPeople moaning about lack of content need to get a grip. Plenty to be getting on with here for people who like to better their scores or to find more difficult challenging ways to finish a climb. If you bomb through from start to finish then yes it is a quick game. There is plenty re-playability especially on the bouldering levels as they are very difficult and get you thinking about every move.\n\nHelpful | 0", "evandaganDec 5 at 11:07 PM\nOnly in VR\n\nNever played this on Rift, and never climbed anything more challenging than a staircase in real life, but this is an amazingly fun and physically challenging game. The touch controllers really put you in the game, as you need to be constantly reaching out in space to find your way through each course, twisting and turning your body to get into position to progress. I can't imagine how this ever worked with a gamepad, since the 6dof hand tracking seems so essential to the gameplay.\n\nEach course/level seems to have multiple routes to the finish, and some easter eggs and trophies, which bodes well for replay, but in three days / two hours of play time I managed to complete all the easy and medium courses. The hard and boulder levels seem to be a big jump (no pun intended) in difficulty, so I expect it'll take me a few more hours to complete all the courses, let alone find all the alternate routes and secrets. It's a good value compared to other Quest games at a similar price point.\n\nThis seems popular with VR fitness enthusiasts, and while there is definitely a lot of motion and contortion involved, I wouldn't count this as a workout, it's more of a stretching exercise: lots of reaching and twisting, and precision positioning, but nothing that would really get your heart rate up unless/until you know the courses well and can race through them at speed. That said, you're going to move a lot more than you would with a puzzle game, but don't expect a cardio workout on the level of Beat Saber, or Synth Riders, for example.\n\nThe graphics are fine. Compared to something like Red Matter, the textures are pretty flat, and it's clear that the background renders are 2D, 360 renders, not 3D geometry. The climbable objects/surfaces are kind of blocky/polygonal when you look close, but it ultimately doesn't matter because the gameplay mechanic/immersion is close to perfect.\n\nHead-clash blackout is too sensitive, and the jump mechanic is wonky, but otherwise an amazing game.\n\nHelpful | 10", "rjohn275Dec 26 at 2:36 PM\n\nWe played the tutorial and were already hooked! My son said it was Awesome - I said thats just the practice bit. We have now both attempted the first easy climb which was stunning to look at and challenging to complete.\n\nThe gameplay is very intuitive. Very quick to pick up the basic moves. Some of the more complex moves will take time to practice, much like real life l suppose but with less messy consequences when you lose your grip!\n\nCannot wait to explore the rest of the climbs.\n\nWatch out for your light fittings reaching up at 61 has had its issues, though I have found it comfortable to play on my knees!!\n\nHelpful | 0", "severnsfam30Jan 2 at 7:21 PM\nOMG!!!\n\nTalk about feeling like your high! This VR game brings you so close to fear of heights! Stand in the platform and you can feel yourself trying to it get to close to the edge! Love it!\nOnly wish the jump feature was easier!\nOther than that its a great buy!!\n\nHelpful | 0", "Stryder121Dec 3 at 11:13 AM\nTHE CLIMB IS HERE\n\nThis is the game that i wanted the quest for.. I am not disappointed, this is every bit as good as i had hoped. Great graphics and great controls make this a joy to behold. My arms are aching but i love it.\n\nHelpful | 8", "GraphicsMonkeyDec 3 at 12:21 PM\nExpected Less\n\nWhen I heard it was a cross-buy I brought the rift version to play with the link cable and Wow!\n\nI guessed the quest version would be a huge drop in quality but I was very surprised that its actually a really really good port.\n\nAs soon as my dinner goes down I will be back in game again!\n\nHelpful | 3", "werdoeApr 12 at 9:15 AM\nChanges the way I play\n\nI decided to try this game because people are saying that its really good when I did the first tutorial I didnt get it at first I thought it was a waste of money then when I started doing more levels I loved it this changes the way I think of vr\n\nHelpful | 1", "aba55May 1 at 12:09 PM\nIncredible\n\nMy feet and hands are dripping in sweat every time I play this game. So realistic I imagine (never having free climbed 1000s of feet up!) Absolute must buy!\n\nHelpful | 0", "jeremi.lucioJan 6 at 9:56 PM\n\nThis gam is amazing. I have played it with so many people and they love it as well. Im scared of heights so I love that I can play the game and have the adrenaline of beings scared but know that Im still safe at home. Love it.\n\nHelpful | 0", "keith.owens.37454Jan 28 at 9:05 AM\nMind Blowing\n\nTotal experience- most recent climb had me clambering over a cable car - shades of \"Where Eagles Dare\" - something new each climb\n\nHelpful | 0", "wiggy-tiggyMay 30 at 11:00 AM\nFells real!!\n\nSo good\n\nHelpful | 0", "ChikapacooJan 27 at 4:10 PM\nWow\n\nWhat an incredible experience!!!!!! Wasn't expecting that kind of physical work out. Far more real than I thought it woul be\n\nHelpful | 1", "WarnDizzlesJan 4 at 7:31 PM\nRealistic Chalking\n\nUpdate possibilities?? Maybe consider a slight shake with appropriate hand while behind the back or waist as that is usually where a true chalk bag would be. Also a vigorous shake in front of body should give a bit more grip strength back quicker to allow true blood flow back into fingers.\n\nHelpful | 1", "ParadiseDecayDec 3 at 12:15 PM\nOne of my TOP rated VR games + Crossbuy!\n\nMy Initial Thoughts:\nThe Climb is one of my all time favorite VR games on the Rift, I was shocked and stunned to see the Quest version looked almost the same as LOW settings on the Rift.\nThe Quest version is missing the animated backgrounds and wildlife, but the concept and close up views still look incredible on the Quest.\nCrytek have done an AMAZING job on this port.\nI can see lots of new VR players trying this and being blown away.\nThis is now my NEW goto game to introduce new people to VR and the Quest.\n\nQuest Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=HKvzeq07RTM\n(Please Note: Links might not work from Oculus, so please search YouTube for 'Paradise Decay VR The Climb'\n\nHelpful | 14", "OtherbitsJan 24 at 12:15 AM\nGreat game, terrible camera\n\nI loved this game when it first came out for the Rift, but honestly playing it for the first time with touch controllers, I like it much less.\n\nThe camera jumps around, sometimes alarmingly fast, every time you grab a handhold - making the game far more sicknesses inducing than it needed to be. It also constantly auto-rotates as you grab handholds at different angles. Usually this is just mildly annoying and a little nauseating, but its so much worse when jumping off a wall to grab something behind you. Since the camera rotates 180 degrees, you are now suddenly holding behind you a grip thats supposed to be in front of you, instantly forcing the camera to clip through the mountain until you rotate your head and hand back around to the front. I genuinely cannot work out a way to do it that doesn't involve momentarily sticking my body through the terrain, but I can't believe thats actually how it's intended to work.\n\nIts horribly broken, and really didn't have to be. If the camera rotated based on the rotation of the controllers, it would be far more natural. Heck, on Quest you could just not rotate at all and let people turn around themselves. Bottom line, the extremely awkward controls seriously get in the way of what would otherwise be one of the best games on the system\n\nHelpful | 2", "MikeTheNewfirJan 10 at 11:01 AM\nGreat\n\nI love this game. First couple times I was like cool but feel like I shouldve brought a different game. Now, I love it the more I play and experience climbing the mountains. Feels great tackling the climb!\n\nHelpful | 0", "TheBrickHakerFeb 19 at 5:39 AM\namazing\n\namazing\n\nHelpful | 0", "natrat4Feb 15 at 11:44 AM\nLove it\n\n5/5 amazing game\n\nHelpful | 1", "agge95Feb 14 at 3:54 PM\nTotal immersion\n\nBuy it, you wont regret it.\n\nHelpful | 0", "sashababyDec 22 at 12:48 PM\nLoved it\n\nThe climb is a 5/5 because it makes you actually feel like your climbing on the other hand I wish that you didnt have to chalk your hands every two seconds. I also wish that you had a harness and were roped to a tether so when you let go you wont die (witch to me happens every five minutes) although all the bad it is still an amazing game.\n\nHelpful | 1", "EthandabossFeb 7 at 11:32 PM\nGREAT GAME\n\nWonderful graphics beautiful Scenery and great interface!\n\nHelpful | 0", "maximus5232Jan 31 at 3:08 AM\nGreat game\n\nIts my favorite game on the quest. I wish there were more levels but its still really good.\n\nHelpful | 0", "powney1991Dec 3 at 3:15 PM\nIN AWE!! NEW FAVOURITE VR GAME! \n\nOk so Ive just spent over an hour and a half on the climb.. how can I put this mildly? THERE ARE NO WORDS to describe what Ive just experienced on a mobile tetherless VR headset! WOW WOW AND WOW!!! \n!! THIS amazing, superb, picturesque masterpiece of a climbing game has just blown any other game for me Ive played on the quest straight out of the water and Im not talking lightly here! \n\nYou have a canyon, alps and bay stage which are ALL beautiful and a marvel to experience and its actually baffling how theyve made it look THIS good on the quest!! Its literally beautiful!  But it doesnt stop there! You have online leaderboards for each of these stages as well as different difficulty modes on each stage where you experience a different and harder climb in each of these different environments!\n\nAnd again it doesnt stop there! You have a LOT of challenges you can target which makes the game that much more replayable over so much time!l and as you complete each challenge you unlock accessories like wristbands, watches and gloves! Im still in awe about what Ive just played and witnessed and am absolutely in LOVE with this title!\n\nMy new favourite VR game has just been crowned and its THE CLIMB! WOOO! (Anybody whos played this already will get the woo bit. )\n\nFor anybody sitting on the fence THIS IS A MUST BUY! Super WOW!\n\nHelpful | 9", "MichaelSanFranciscoDec 16 at 10:35 PM\nOy Vey! This Game Is Scary Realistic.\n\nIf you like the concept of climbing, but don't have a death wish, buy this game immediately, if not sooner.\n\nI don't know nuttin bout climbing, but I do know what's fun, which is what this game is.\n\nThe only con of this game is that it makes my manly parts shrivel and tingle in FRIGHT. You know that feeling guys. A man can take only so much frught induced quivering, as opposed to quivering in anticipation. I digress, forgive me.\n\nSuffice it to say, this game is worth every penny of its purchase price. And as a bonus, all that quivering is a good workout.\n\nHelpful | 2", "bocaajMay 16 at 5:18 PM\nGreat game! \n\nGreat game you should try it out. (Quite a bit of money tho)\n\nHelpful | 0", "FerristroopersFeb 12 at 7:32 AM\nThe climb\n\nOne of the best gams I ever played\n\nHelpful | 0", "aizen.uchihaFeb 11 at 11:05 AM\nJust wow\n\nOmg wow oh wow its amazing 6 ******\n\nHelpful | 0", "chris.sanders.399Feb 1 at 4:41 PM\n\nTerrifying and awesome! Just checking out the scenery blew me away. But then the part with the jets! Wow! Oh yeah, and the climbing is pretty cool too lol. I love it! Great game!\n\nHelpful | 0", "ValboxJan 22 at 1:30 PM\nAMAZING\n\nThis game is just amazing, but one problem. Sometimes I spawn weird and it says my head is in something. That might be my problem though.\n\nHelpful | 0", "WhiteThanosJan 2 at 11:35 AM\nAmazing and Terrifying\n\nI love this game. Its amazing. Would totally recommend. The only thing is I have an extreme fear of Heights. Like I hate heights. But Im trying to overcome my fear and this game is 100% helping with that. Just a great game overall\n\nHelpful | 0", "DatOneBoiJan 29 at 7:07 AM\nGreat game\n\nI love this game and Ive been wanting it for a while it was definitely what I expected.\n\nHelpful | 1", "roger.herndonJan 7 at 4:11 PM\nBeautiful and Immersive\n\nPurchased this because Ive had a lot of friends tell me that they loved it. I feel the same way. Great views and realistic climbing make for one great game. Hard to believe its being played on the Quest.\n\nHelpful | 0", "HighlandJohnsonJan 19 at 6:51 PM\nVery good\n\nReally good game but one thing wrong is when you finish the level, it sometimes throws you off the platform. Other than that, great game.\n\nHelpful | 0", "laurie.robertnFeb 16 at 7:26 PM\nfun\n\n:)\n\nHelpful | 0", "N30N_ChairJan 16 at 11:34 PM\nScary But Amazing\n\nThe views are absolutely beautiful but I gotta say I have a huge fear of heights so the crumbling ledges got me so scared but overall its an amazing game\n\nHelpful | 0", "KokiruDec 26 at 2:26 PM\nOpinions and annoying feature\n\nSo far in my experience with it it has been quite fun and a very chill game to just relax in. However the racing feature of racing ghosts? Good idea but... I would prefer live racing against 25+ people where you can invite friends into the brawl and race for he top for rewards to the top 5 (like cosmetics or gadgets.) With this you could do so much from adding pushing to adding gadgets used to help stamina or even like a punching glove that could hit at an opponents hand (just a thought.) With these additions i feel like it would get better and better offering opportunities of adding guild type of deals where you could do climb fights vs other guilds for prestige/levels. I would also enjoy a coop mode where you and a friend could do climbing together and even use a tether system or something to swing your friend if he fall (the stamina would drain 2x as fast unless you added a perk system.) And finally a current annoyance that really takes me out of the game is getting flipped when jumping and landing on a wall. If i have turned around IRL why do I have to get my head slammed into a black barrier of not being able to see? Another way to solve this would be to add a transparency if stuck into the wall by a few feet so you can still see where to gab to regain stamina. All in all i think this is a great buy for anyone who is just playing solo although If you added the race type of deal thats more aggressive I feel like alot more people would come just for that. Thanks for reading and if any of these get added Ill be extremely grateful. And if anyone thinks that these would be great additions/you have the same issue hit the heart! :) Bye\n\nHelpful | 3", "i-stole-a-cabbageFeb 15 at 7:28 AM\nGud\n\nIt gud\n\nHelpful | 0", "ResegenDec 3 at 4:33 PM\nMy favorite game for VR.\n\nI remember playing this game on the CV1 the first Rift at a Best Buy demo, ever since. I was hooked on VR. Playing it again on the Quest was amazing! I love it and I almost fell over, I'm pretty used to VR but when I jumped from ledge to ledge and missed got me yelling out loud and almost fell over. I understand why people play it seated haha. The graphics compared to the PC version is a difference, not horrible, it didn't ruin my immersion at all.\n\n\nDo I recommend this title, hell yes! Try it for yourself, it's amazing for what it is.\n\nHelpful | 2", "stachowiDec 4 at 4:28 PM\nHow is this possible?\n\nSo my first experience with VR was a CV1 demo at Best Buy... the climb using the Xbox controller.\n\nThat experience convinced me I wanted to have a VR setup.\n\nBut... the cost. The rift, touch controllers, and a high end PC. Were talking $2500 in 2016.\n\nSo I did some homework and found out the Quest (eg Santa Cruz) was coming, then it was announced and with it the climb.\n\nMay 2019 couldnt come soon enough... the quest arrives and I buy it day one.\n\nThe Climb is nowhere in sight... out of sight for the next 6 months.\n\nI thought the game I wanted to buy the quest for was cancelled.\n\nThen it was announced and I literally bought it minutes after release.\n\nSo the first thing, the controllers track perfectly AND no wires!\n\nThis game is beautifully ported to the quest and it so relaxing and the experience I was looking for.\n\nHere are the gotchas. Yes the graphics are turned down, but not as much as youd think considering the quest is a mobile chipset!!!\n\nMy only feedback to the dev... if possible try to improve the resolution of the background images (The backgrounds in the distance), theyre way too degraded and actually break immersion.\n\nOtherwise, amazing experience and was worth the wait!\n\nHelpful | 7", "Przemo-cDec 3 at 10:58 AM\nFun game with minor issues\n\nClimbing locomotion is so much fun in vr and the climb does it justice.\nFor a port from PC it's pretty sharp and heavy foveation is there but it's not distracting.\nSolid performance with no hiccups when climbing.\n\nOne flaw inherited from PC version is head collision with objects with immediate fade to black with no indication of where to move away and just black no internal grid or anything like that. They there's autorotation works well when following a curve in the wall but jarring when going around corner. Please allow us to move around corners.\n\nOverall a fun good looking game with satisfying vr climbing!\nWell worth trying out!\nAlso major props to devs / publishers for doing crossbuy. It's great for people who already had the climb but also with advent of Oculus Link and Virtual Desktop VR Streaming important for quest users that want to play the climb in a richer PC edition of The Climb\n\nHelpful | 16", "epicsquirrel123Feb 26 at 10:20 AM\nAwesome\n\nI love this game it is brilliant.\n\nHelpful | 0", "derek.cool1Jan 24 at 1:35 PM\nTop game\n\nI think this game is very very good and really does set the atmosphere one of my favourites of all times so far\n\nHelpful | 0", "harrison.knoxFeb 12 at 8:34 PM\n\nGreat game!\n\nHelpful | 0", "SinfreeAleXDec 17 at 10:13 AM\nFun and a must own title.\n\nLet me start by saying I am afraid of heights and get vertigo looking off a balcony on the 4th floor of a building or higher. I don't experience that here for some reason.\nSuch a fun time and brings me back to my free climbing years of my youth before my vertigo kicked in. I had trouble in the Tutorial but after completing it and switching the controls around I am having so much with this game. The graphics, music, and overall sound of the game is nice and relaxing.\nI would recommend this to anyone who owns a Quest as a fun experience that is much different from what else is out there.\n\nHelpful | 0", "NicoTSMJan 24 at 12:52 PM\nBest game on vr!!!!!!!\n\nThis game has the most stunning visuals and the most immersive experience that I have ever experienced in vr.\n\nHelpful | 0", "GrapesEatPeopleDec 12 at 4:15 AM\nA near perfect game.\n\nTo keep this short, this game is near perfect the only problem is that I have an intense fear of heights. If I spend more than 5 minutes climbing, my brain kicks in and I start getting shaky and nervous. This doesn't stop me from playing (to be honest, its really rewarding finishing a climb that I struggle with).\nBut for anyone who can't bare the fear of heights this game might not be for you.\nBut this game is one of the most immersive games I have ever played.\n\nHelpful | 2", "PeoriwriDec 18 at 7:49 AM\nAmazing except...\n\nThis game is amazing except one thing. When your head goes into a wall it makes everything pitch black until you move it. Well alot of times that will happen even when I'm not near a wall or anything. Especially when I'm climbing on the wood beams I put my head over the beam and it says that I need to move my head. Another thing that would be awesome is more online interaction. Like one game mode where it is a really difficult cliff and you and someone else climbs the cliff and you have to help each other. Or one where your against them and you can like sabotage them but breaking all the crumbly grips or grabbing onto them and dragging then off the cliff. But overall this game is amazing! :)\n\nHelpful | 1", "UBSERDDec 4 at 2:43 PM\nNot as perfect as people say.\n\nIts almost exactly the same experience as its big brother but at a cost. As I played the first level everything was smooth, very smooth. As a progressed through the level though, the performance started to take a dip and continued for the rest of the level. I understand this is a mobile chipset, but if a game like Red Matter can pull off exceptional graphics with smooth movement and hardly any dips, this game has no excuses for the stuttering especially with 3D yet static backgrounds. Im not talking subtle either, the reprojection is very noticeable and jarring to me. Once this gets addressed I will update my score.\n\nHelpful | 15", "jonnyvodkaJan 2 at 7:39 AM\nGreat game\n\nOnly played this a handful of times so far as theres so many games to play but already its becoming addictive, easy to get used too and the views are awesome! Looking forward to really getting into the game!\n\nHelpful | 0", "SpooderPugDec 21 at 10:00 PM\nOutstanding\n\nNot only is this game incredibly fun, but the views are spectacular. Half of the time Im playing this Im just looking at my surroundings to see everything I can. It is phenomenal and while it is relatively short, I can replay the levels and still enjoy them.\n\nHelpful | 0", "MikeyDidItDec 13 at 3:53 AM\nWow and worth the Price\n\nI feel most of the games on the Oculus store are not worth the price. The only other game I have bought at this price point is Beat Saber. I feel anything over $15 and pushing the $20 limit must have not just a substantial polished look to it but must also have amazing gameplay and replay value. This Climb definitely fits the bill.\n\nHelpful | 1", "HaroldDec 3 at 12:21 PM\nWow what a game!\n\nI really love the Quest version. Its almost a good as the Rift version. Only the far views are a bit less detailed. The mountain look really amazing.\n\nI also love it that is a cross buy game. So for me it was free because I bought the original version on the Rift a few years ago.\n\nHelpful | 2", "GrandadmiralBDec 24 at 4:31 AM\nA MUST BUY!! But not perfect\n\nThe Good: The game is truly fun and addicting. Its challenging, the easy levels are fun and the hard levels are difficult without being impossible. It also really gives you a sense of climbing in the open, can make you sweat a bit, in a good way.\n\nThe Bad: For some reason whoever programmed this game made it that if your holding on and move to the wrong angle the screen turns black and says your body is intersecting with the wall. It takes away from the experience of actually being on a wall. This cant be hard to figure out and fix. Its the reason I didnt give this game 5 stars. Please fix this issue, it seems like its a bizarre issue to have.\n\nThe only other downfall is the game is short, but I wouldnt hold that against them as all VR games are short and Im sure they will ad to it eventually.\n\nHelpful | 2", "K1llerdj123Dec 4 at 2:21 PM\nTop quality!\n\nI took the plunge and bought this and I'm very glad I did.\nVery immersive, very nice graphics and gameplay, the PC version has a few more things like butterflies and bugs flying around but graphically there's not that much difference!\nIn the future it'd be nice to see some well known landmarks added like Big Ben or The Statue Of Liberty.\n\nHelpful | 3", "lewdogmanJan 10 at 7:14 AM\nA must-have game\n\ngraphics were amazing and it was when you get to the top of the Mountain you feel so you feel accomplished\nthere's not a lot of mountains except from that is amazing\n\nHelpful | 0", "CeltenDec 4 at 1:20 PM\nNot for the faint of heart\n\nA nice add for the quest. 3 levels of every difficulty and 6 challenges, total of 15 maps.\n\nAnd a nice race mode where you can follow other climbrers path.\n\nA few more maps and competitive challenges would be nice.\n\nLike least number of grips, shortest time, shortest path, longest none lethal fall and so on\n\nHelpful | 5", "DTuckerbendDec 11 at 9:28 PM\nAll achievements accomplished glitch\n\nI love this game and its really fun but something really weird just happened. I was playing it and took it off for a little while. After I put it back on I went into the achievements section and I had every single one completed. Personally I was really looking forward to doing those and am kind of bummed. Please patch or add a way to restart the achievements or the game or something. Thanks\n\nHelpful | 1", "goose0708Jan 26 at 2:37 PM\nGreat game\n\nImmersive and detailed. Props for the great views and graphics throughout the game.\n\nHelpful | 0", "ImNotTheBestOnAQuestFeb 9 at 11:33 AM\nGood game\n\n:)\n\nHelpful | 1", "The_WerdolfDec 11 at 9:23 AM\nAlready played for hours\n\nThis is really amazing, even though I've bought it just a few days ago, I've already played many many hours. This is the game that keeps you moving in a more gentle style, at least in the beginning. This game feels like a real game, not like a demo and it has tons of replayability. The quest needs more games like this, many thanks to the developers. Technically the cry engine does a good job on the quest hardware (maybe there's room for improvement later?) and even better I read it's cross buy. Can't wait to get my link cable.\n\nHelpful | 1", "FlubbyDub70Dec 16 at 9:05 PM\nAmazing\n\nVery relaxing and these are legit reviews. For the quest at the beginning it can be a bit strange and glitchy but by the time you start the tutorial things are smooth sailing. Levels are way longer than I thought so its a real workout moving my arms but its super fun and recommend this to everyone although it does get tiring on your arms after a while so arm or shoulder pain is a big no no to play this but everybody else is fine.\n\nHelpful | 0", "davereynoldsDec 3 at 7:11 PM\nThis is a must have\n\nIm just now downloading this game and I cant wait to play. I played this in the store a couple years ago on the Rift and fell in love with it. Man I cant believe that now Im going to be able to play anytime I want to now. One million thumbs up for creating this game. My wishlist is now complete,well untill the next big game comes out, so once again thank you soo very much for releasing this for the Quest. Im now the coolest grown child on the block,lol.\n\nHelpful | 4", "DurvnDec 10 at 2:02 AM\nBeautiful and smooth\n\nI really dont normally right reviews unless its amazing or really bad. This is the former, the game is one of the most beautiful Ive played so far on the Quest. And is as smooth as any. Ive had minimal issues with my only complaint being how easy it is to sometimes get the black screen warning when youre face is in an object (ie. Cliffside, zip line, broken wood) I would give it 4.5 for that reason but its worth the money spent. Ive only had it for a couple of days so the replay ability of it isnt something Ive had an issue with so far. Much more customization than I expected and an awesome race feature to beat other players scores. TLDR  Amazing, 10/10 would recommend for parties or solo climbers. Safe climbing Questers.\n\nHelpful | 1", "Tack527Jan 23 at 6:13 PM\nVery much good.\n\nIt was very much fun for my human likeness to enjoy humanly.\nSincerely fellow human.\n\nHelpful | 0", "hunter.bischoffJan 17 at 8:34 PM\nGreat game\n\nGreat game overall from the graphics to the mechanics only ran into one problem whenever I would try and jump to a wall I would sometimes get stuck inside of it and have to restart\n\nHelpful | 0", "jenny.copeland.587Jan 27 at 11:26 AM\nFun and fit\n\nIm loving climbing the mountains.\n\nGreat workout and good fun x\n\nHelpful | 0", "VRPhantomDec 8 at 6:30 PM\nA Really Amazing Experience\n\nI'd purchased The Climb for the Rift S several months ago and I was curious as to how it would look and play on the Quest. Thanks to cross-buy support I was able to get the game and I've already gone on several climbs. I am simply amazed at how close this is to the original PC version. Other than ever so slightly softer graphics the entire game has been successfully ported with nothing lost. Visually, the game does an outstanding job of tricking the senses into thinking you are climbing mountains hundreds of feet tall and the game has successfully triggered my discomfort with heights on several occasions. Control is very easy to learn and makes the act of mimicking climbing movements a lot of fun; the Touch controllers are very responsive, tracking is excellent and the untethered design of the headset adds a liberating feeling to the gameplay. The game has climbs of varying difficulty and a \"tourist\" mode that disables the game's stamina system, allowing you to just climb away and enjoy the views at the cost of not having scores upload to leaderboards. If the subject matter interest you, definitely check this one out, it's one of the best games to come to the Quest so far.\n\nHelpful | 1", "NinjaXMJan 23 at 6:32 AM\nAlmost refunded but then\n\nI tried the advanced training then one advanced level, and that changed everything.\n\nHelpful | 0", "PapaOboJan 24 at 9:10 PM\nGood game\n\nVery fun game and is a great timewaister. Also fun to play with friends.\n\nHelpful | 0", "Hotshot80sDec 4 at 11:52 AM\nI didn't realize it would be this good!\n\nWas expecting a mundane climbing experience with nice visuals, what I got was an in depth climbing game with clever mechanics and sheer drops that make you nauseous it's that realistic.\nAlong with the realtime lighting and shadows plus really good textures for the quest, this game will have you coming back until you've mastered the hard levels.\nPlenty on offer here, a good game for everyone.\nWell worth the dough.\n\nPs: where's crysis 4?\n\nHelpful | 3", "mekyG813Dec 9 at 5:19 PM\nGREAT GAME!!!\n\nOverall I think it's a great game! Gameplay is great and very immersive, the environments themselves are high quality and I couldn't expect better from the quest, not having tried the PC version. I had very high Hope's for the game a d for the most part, it delivered. The only things I would appreciate changed/enhanced is 1: the background images are a little too low res and sorta break up the beautiful moments. 2: I noticed almost immediately that the edges of the screen have a cutoff between normal and dumbed-down graphics. When I'm playing I dont always pay attention to it but it can be very distracting at times. 3: the menus could be a little spruced up, the plain white isn't very awe-inspiring for first-timers/returning to the game. Maybe a white polygonal mountain landscape of sorts? Remember that these arent complaints, I still love the game, just some advice the devs could take into account!\n\nHelpful | 0", "TwinTurbo74Dec 19 at 4:17 AM\nAwesome game! One complaint\n\nI love how immersive this game feels and jumping from ledges, great fun! Looks great, sounds great, but my only issue is when the screen goes black if your head is close to something...makes some of the areas very difficult and cumbersome to traverse... If it weren't for that I would easily give it 5 stars\n\nUPDATE: Latest update added more environmental elements, like dragon flies buzzing around. Still issue with screen going black\n\nHelpful | 2", "BadLarryNYDec 19 at 2:35 PM\nWorthwhile with a couple small gripes\n\nSo far Ive enjoyed this game. The interface works well and gives you a unique experience thats really separate from the other stuff on the Quest. One minor gripe that I have is the backdrop on levels is too low res and static. The blurry background stays perfectly still when you move so the overall effect is that youre moving the mountain around instead of moving yourself. Still, totally enjoyable.\n\nHelpful | 2", "SincereNononononoDec 11 at 4:42 PM\nAmazing\n\nAfter waiting a long time for the climb to release I wondered if they would even port it to quest. However they totally made up for it with the games graphics and overall amazing port. Of corse it is not as graphically stunning as the pc version but the quest port has definitely impressed me.\n\nHelpful | 0", "MERTZ21Jan 10 at 4:13 PM\nHebclimb\n\nThis game was one of the best game I have ever tried. Even though I played the game on the quest the gratify for the game are still really good\n\nHelpful | 0", "IAmOnCloud9Dec 9 at 12:40 PM\nThis is rock solid! (no surprise)\n\nI have many titles for Oculus platform (Rift, Quest, Go, Samsung) but I have never reviewed any, until now, & it deserve it! And thanks for making this a cross-buy :) I got this since launch, but didn't get to play it until today., & it's great.\n\nI have this for Rift ver (since sold), but havent tried it with link yet (sense a theme?) so I can't compare with it, but the graphics is enough for me to use it as standalone, period. Of course it cant exactly replicate the rock climbing workout, as this seems to workout my shoulders more, than my fingers (most important, imho). All positives, ambient appropriate sound, especially with gameplay, making you feel as if your actually kind of rock climbing. Jump was iffy few times, but got used to it real quick, upon many death ;) Kudos for releasing this - been waiting this for a long while & it's worth the wait!\n\nHelpful | 0", "Zenn69Dec 9 at 2:59 PM\nBest game Ive played on the Quest\n\nPros: great graphics that give you the feeling your really up high. Controls are superb and easy to learn.\nCons: the only drawback is you cant compete against your friends. I hope the Dev updates this.\nOverall: if you want a to experience climbing without the cost of equipment and risk, this is the ultimate experience and the price point is awesome for what you get\n:)\n\nHelpful | 0", "mountveggieDec 4 at 5:58 PM\nThank you for making this cross-buy\n\nIm leaving this review specifically to thank the devs for making this a cross-buy title.\n\nI purchased the climb when it was first released on the Rift and it was loads of fun. And the freedom of the Quest makes a fantastic game even better.\n\nKudos to you guys, I hope more developers offer the same support to their loyal customers :)\n\nHelpful | 2", "RoJoCoDec 4 at 6:43 PM\nMore Than I Ever Expected\n\nThis game is such an incredible experience. From the stunning backdrops, to the amazing sounds, this game engulfs you into the atmosphere. The controls are simple. The game rewards you for exploring and taking chances in leaderboards. I hope this is just the beginning of what can happen for games like this!\n\nHelpful | 2", "Skyhawk613Dec 3 at 2:33 PM\nAmazing!\n\nThis game is Amazing as it is right now!\nAmazing graphics and fantastic gameplay!\nDon't think just buy it!\n\nI was hoping the developers may add missions to photograph animals and birds nest as a climing target and maybe even having to overcome attackes by eagles.\n\nWhen you fall it would be great if you could open a parachute and get additional score by gliding to a land target etc.\n\nHowever as I said above this game is amazing as it is. Thank you developers!\n\nHelpful | 3", "DakkardDec 5 at 2:49 PM\nPerfect....ish\n\nThe controls, menu layout, most of the graphics are incredible.\n\nReally enjoying playing this game, I have spent hours already and I keep coming back for more.\n\nHope they bring the PCVR DLC to the quest version.\n\nThe only thing, which is a small negative is that the background image is a bit blurry and static, would like if the developers could improve them but I still happy with my purchase.\n\nHighly recommended.\n\nHelpful | 2", "lennieplopDec 7 at 10:35 AM\nThe best VR game I've ever played\n\nThe climb is an amazing VR experience in every way. Firstly, it looks truly breathtaking. I thought the screenshots in the store were from the pc version, but they're not. Probably the best looking title on quest. The game also sounds great, with its directional audio giving you an immense sense of immersion and realism. Of course, the levels are also memorable, polished and pretty long for a VR game, and really make you feel like a rock climber.\n\nAll in all, if you have a quest, there's no good reason not to pick this up.\n\nHelpful | 1", "CrustyPocketsDec 3 at 4:36 PM\nAAA Quest game!\n\nThis feels like the first true killer app since Beat Saber.\nI've never been happier than I have when playing this game and the replay value feels like it could be endless as you try to beat your scores by doing speed runs.\n\nJumping feels incredible! I personally switched the ledge grab to the grab button as all the other games I've played with climbing mechanics use this and the triggers felt too weird for grabbing.\n\nIf I could hug the devs I would! Bravo for pulling off this port, bravo!\n\nHelpful | 3", "MikeVonMatterhornDec 3 at 3:33 PM\nA new graphics standard\n\nWhat Crytek accomplished here is very remarkable, they've managed to put awesome graphics and the CryEngine on a mobile standalone headset - props guys, that's why i call you the Graphics Gods. ;)\n\nWhat to expect? You have 3 very different mountains with multiple levels and difficulties, achievements and unlockables, endless climbing, challenges to beat other players highscores, cross-buy if you have a VR capable PC and have i mentioned the graphics?\n5/5\n\nHelpful | 3", "Lurchman_VRDec 9 at 12:27 PM\nOutstanding experience\n\nWaited for this game for half a year and it was worth to wait. I know some will complain about the blurry images of the background (country side etc) but imagine what Oculus Quest can display from resolution and in my opinion Crytek made an excellent job. The feeling to hang over nothing under your legs is even better then richie's plank experience. Well done guys\n\nHelpful | 0", "UwwBlakeDec 9 at 7:26 AM\nSuper fun experience\n\nI was hesitant to spend $30 on a climbing simulator but let me tell you, I am so glad that I did. The climbs are really fun and immersive. Countless times have I gotten lost in the world and its nature like views. Really worth the money as it really shows off what VR can do. The fact that you can climb anywhere with no wires is fantastic. Did I mention that it is also cross-buy? Pick up this game, you won't be disappointed!\n\nHelpful | 0", "ramuzonaJan 23 at 2:12 PM\nEh\n\nSo to start off, this isnt a bad game by any means. its probably one of the best exploration games on the vr market right now, so you may be wondering whats the problem? the controls. the controls for this game are so bad that they have broken all leaps for vr interaction physics set over the last few years, i mean, the grip button is there for a reason. if the controls are fixed this game will be awesome but at its current state it is ruined by this minor feature.\n\nHelpful | 1", "Fizzy_2010Dec 4 at 5:47 AM\nAwesome\n\nEver since I tried the demo on a rift years ago I have been waiting. I have a nice surface pro but it does not have the power for the rift. I picked up the quest after the climb was announced 8 months ago. Finally the wait is over. Lmfao with the two star comment, of course one gets motion sick when hanging off a cliff, duh.\n\nHelpful | 2", "JATTACKPOHLDec 4 at 6:58 AM\nFantastic polished port of s great game\n\nThe Climb was one of the first games I purchased for my Rift a couple of years ago. I absolutely loved it. Now playing it on my Quest feels just as good! I'm about 5 climbs into the Quest version and I'm blown away by the graphics. Never dreamed they could be so good on a portable. The gameplay and tracking are spot on. Tons to do and see! I love the sense of scale. Unique gameplay, easy to learn and for me it's a game I will keep going back to.\n\nHelpful | 2", "philg7onr123Dec 7 at 8:17 PM\nVery immersive\n\nI am very happy that I bought this game.\nTotally pleased with this purchase. There are aspects with the graphics that are a little disappointing, but overall A very absorbing and immersive VR experience. Found it very difficult to put down, this is only just in to the first level, so very much looking forward to the rest of the game.\nI think this is what VR is all about, and I think very few will regret buying this game.\nKeep em coming !\nFurther update.\nAm bowled over by this game, stunning views, runs as smooth as silk, graphics are amazing.\nWhat a fantastic addition to the quest. This really sets a new bench mark in VR.\nIt just doesn't get better than climb, so looking forward to playing more.\n\nHelpful | 3", "Greekspartan121Dec 4 at 12:56 AM\nThe Climb,Just amazing\n\nWhat can I say,I was sceptical about buying this type of game.\nMust say I don't regret it at all.\nJust breathtaking scenery and the game play and controls are really good.\nHad a few little glitches but I think it was my lighting conditions,will update again.\n\nSo far this is a must buy.I have a fear of highs,my knees went a bit wobbly at times but held on in there.\nChalk up and get climbing.\nBig difference in download GB from the two versions.2GB compared to 11GB, curious on the difference.\n\nHelpful | 2", "InstaVR-Player1Dec 8 at 11:08 AM\nA suggestion\n\nVery decent game and feels really immersive\nHowever, how about showing the foot during climb. I believe this will improve the immersion and allow players to actually place their legs in the position of the VR legs\nThe foot may either be hanging or dangling along as you move or clamping to the rocks as you move..\nI hope you consider this in one of your updates or maybe in a particular stage of the game\n\nHelpful | 0", "HitsauceDec 4 at 6:04 AM\nTruly An Amazing Experience!\n\nOverall gameplay is amazing! Graphics obviously arent as good on quest as on the rift, but its still one of the most fun games Ive ever played. The way you climb is really immersive, but theres one thing that breaks that immersion. When you jump onto the other side of a rock wall, it will often glitch you into the wall. Despite that one glitch its definitively still worth getting, money well spent for me.\n\nHelpful | 2", "Raemon777Jan 22 at 1:20 PM\nGreat, but starts getting buggy\n\nI'd love to give this game 5 stars  it's amazing. But, starting on the medium difficulty levels, I've started into places where my hands won't grip the wall-grips properly.\n\nI'm noticing this so far on:\n\n1) the medium difficulty Alps map, one the wire that you have to grip to cross the chasm. First, I can only grip the wire from one side (where my natural instinct is to be alternating which hand is gripping in which direction). Second, once I get halfway across (to the big red/white orbs), there just isn't a spot I can grip\n\n2) the first hard difficulty Canyon level (similar problems with the cable-grip, and then I just have a hard time gripping various normal rock handholds)\n\nHelpful | 1", "Big_FurryJan 22 at 4:40 PM\nAmazing\n\nAmazing this game have amazing graphics gameplay and it is worth the money\n\nHelpful | 0", "TaunHawkMay 23 at 2:33 PM\nGood game except for annoying issue\n\nGraphics and the feeling of climbing was really nice. Sadly had to return the game because of the very annoying and immersive breaking move out of area black pause screen comes up way too often.\n\nHelpful | 0", "vanfanelDec 7 at 3:26 PM\nGreat port!\n\nI was extremely skeptical when I heard this was coming to the quest considering it was one of the best looking games in rift. But somehow they managed to keep its beauty while maintaining its gameplay. It was a graphical masterpiece in the rift and on the quest its among the best looking games there is.\n\nHelpful | 0", "Tek120Dec 3 at 3:49 PM\nFantastic!! Crossbuy\n\nI originally bought this for the Rift CV1, I also own a Quest!!! Thank you for making this crossbuy!!! I was surprised to find it in my Quest library!! Such a pleasant surprise lol! The graphics are fantastic on both ports!! Being able to play this outside without being tethered is great and adds to the immersion!\n\nHelpful | 4", "chettawanDec 5 at 6:23 AM\nNo climb like this!\n\nThis game is out for PCVR for a long time ago and some of us, VR newcomers may thought climbing in VR is outdated so many game have it. Yes at first I thought that too but for the sake of CryTek I give it a try and...This is how VR climbing really is!\n\nNot amazing but stunning visual, climbing mechanic is great and fun. The only think I dont like is sometimes the game black out and said your head hit the object. It ruin most some good time up there. There should be other better way to implement this.\n\nHelpful | 1", "DiamondgamerkingJan 7 at 5:51 PM\nBeautiful\n\nThis game is beautiful with its scenery and it really makes you feel like you are in the game. This is one of my favorite games on the quest\n\nHelpful | 0", "psully4114Dec 5 at 4:23 AM\nAbsolutely amazing\n\nGreat great game! Tons of fun! The scenery is stellar. I do wish there was more variety. For the first hour or so its pretty freaky to climb and fall but once you get into I was hopping up the hard ones in like 5 minutes just to see the view at the end so I saw most of the content in the game pretty quickly but getting to look around at the environment from on top of a mountain is breathtaking. I've been waiting for this one for a while and this team did not disappoint. 5 out of 5. Can't wait to see whats next.\n---disclaimer this game is not completely free of bugs. There is the odd frame drop or hand tracking issue but its pretty negligible. The only place I encountered the tracking bug was the wire section on the medium Alp level. There is also occasional frustration with game turning black to tell me my head is inside something but I can usually address it pretty quickly by recalibrating the headset by holding the oculus button. Its also not uncommon since motion is pretty much exclusively done by grabbing ledges and jumping when I reach the top of a platform for the next ledge to be slightly out of reach and I dont appear to be able to jump unless I'm holding something.\n\nHelpful | 1", "JCTHELADIESMANApr 24 at 11:44 AM\nVery beautiful\n\nThis game is crazy good and the graphics are unbelievable the people who made this game props to you\n\nHelpful | 0", "DrayveDec 7 at 4:09 PM\nNew Favorite\n\nCompletely worth every penny. The amount of detail put into this game took me by surprise. As a new player to this type of game I am very impressed with the feel and sense of accomplishment after a climb. Very awesome feeling falling off the cliff for the first time. My neighbors felt my fall for sure. Will be playing this on the regular for a while. Would recommend to anyone seeking thrills and or a challenging yet rewarding game.\n\nHelpful | 1", "mjg298Dec 4 at 2:41 AM\nGreat game but frustrating design\n\nFirst of all this is visually a great engaging game with simple controls and really gives your arms a good work out. Climbs often have multiple routes to pick from increasing replayability as you seek to discover the fastest route or just want to explore. Graphics are stunning.\nHowever there are two very annoying frustrations I've found after a few hours gameplay: 1) the FFR (fixed foveated rendering) effect is sometimes really prominent, especially on the left side, which does somewhat ruin emersion; 2) collision with the walls where your head passes through the cliff and screen tells you to return to 'pull back' - often occurs after a jump meaning you are somewhat disorientated and will often fall from the cliff as you cannot see another hand grab (or anything) before stamina expires and you crash to the ground.\n\nHelpful | 10", "08loudelkDec 28 at 4:44 PM\nGood game overall\n\nThe game runs smoothly and is very immersive. And when youre in the thick of it, it feels real. It does bug out a bit but I think the developer(s) will fix that later on.\n\nHelpful | 2", "Decoy_ElementZDec 26 at 10:40 AM\nIt Deserves the Award\n\nI got this game because I love good views and thought it would be cool to try it out. I saw that it got best fitness game award of the year, correct me if I'm wrong, and thought that I might as well get it. The tracking is a bit off but it is an amazing game overall.\n\nHelpful | 0", "Lazius001Dec 4 at 6:57 AM\nHope this fix this soon!\n\nSo disappointed with a title that is so expensive! What is the point of a climb if the view is so blurry at the top? Why not get rid of the dragonflies, birds and other artifacts and just make the graphics sharp instead? you can add those later...the blurry parts also make it very uncomfortable and are prone to Motion Sickness...the management of the game should have waited for its release, or sacrifice other items which are less of a priority..not sacrifice graphics..will be getting a refund if I can and re-download next time round....PS I would also suggest the option to have in-game music whilst climbing as no music for me makes the experience a little empty...but this is not part of my review, I am mainly very disappointed on the Graphics and the fact is so blurry..the rest would just be nice to have,\n\nHelpful | 20", "duke1231Dec 3 at 7:22 PM\nFinally!\n\nThis game is amazing! So excited it came to the Quest! Always has my hands sweating! The wait was worth it! Thank you so much! Cant beat cross buy either!\n\nHelpful | 4", "E-TanDec 5 at 2:45 PM\nHighly Suggested! Great Game!\n\nHoly cow! I dont was like okay okay, this is a climbing game, this might not be for me buy Ill get it anyways. But oh my gosh! This game is a MUST HAVE this game is stunning, and has great controls and mechanics! It is also soooo fun! I love it so much! I highly recommend it!\n\nHelpful | 2", "michael.leskowDec 31 at 9:25 PM\nClimbing game\n\nThis is as expected. Seriously, you feel like you are on a cliff. I stand when I play and have actually had to regain my balance as my balance shifted and almost fell over. Kind of funny. You may want to sit while playing.\n\nHelpful | 1", "BenduckJan 17 at 3:55 PM\n\nAbsolutely breath taking. Gives you a good workout. Not good if you afraid of heights.\n\nHelpful | 0", "Lucifer2005Dec 24 at 11:35 PM\nAmazing game\n\nIt's tricky to get the hang of bit once you've got the controls down your set for anything,it's literally just a climbing game so don't expect any action other than jumping from one point to the other.\n\nHelpful | 0", "aaron.sommers.1253Dec 3 at 10:36 AM\nThe Climb\n\nThe climb on the Quest, it's the only way to climb. Great graphics, awesome game play, soar arms coming your way :)\n\nHelpful | 6", "tx_brandonDec 3 at 8:17 PM\nabsolutely amazing thorough experience!\n\nThe mechanics are fun and simple to learn. The unlockables are overflowing and the ability to race any friend or anyone on the leaderboard is awesome! There's a lot more excellent about the game so pick it up if you can afford it!\n\nHelpful | 2", "vrv.exeDec 4 at 9:45 PM\nGreat game!\n\nThis is a great game I play this game while Im on my spin bike getting exercise and it really adds to the experience because it is very physically strenuous. The game is really good because it knows how to balance challenge with fun and the level design is great. I dont know if it would be all that fun if I wasnt on a spin bike actually getting my heart rate up however it is definitely a polish game that is worth the money.\n\nHelpful | 0", "HanedogDec 5 at 6:53 AM\nGreat Game\n\nIm really enjoying this game so far. The graphics arent perfect and are a little fuzzy in areas, but overall its still beautiful and impressive for the Quest. The climbing controls are excellent and the multiple maps will keep you busy for a long time. There are also different difficulty levels along with a practice mode. Though Im not entirely sure yet, I do see this game as having good replay value as you can try to beat high scores, complete challenges to unlock new items, etc.\n\nI have also been impressed with the depth of the game. In terms of the overall menu options and general navigation, it is one of the most in-depth games Ive played on the Quest and truly feels like something youd see on a console.\n\nHelpful | 0", "barjdudeMar 13 at 12:56 PM\nNot what I thought\n\nSo when I got this Game, I originally thought it was just gonna be your basic rockclimbing game, but whenever I figured out the different mechanics of the game it felt like a very different game than what I originally thought before its actually longer than I thought Even though it has three main levels and then three objectives in those levels\n\nHelpful | 0", "lettucegyyDec 12 at 6:21 AM\nGreat game\n\nThis game is perfect for people who like exploring and climbing. End of every level you get a beautiful location you can observe and admire. Loads of things and missions to complete, so you wont get bored or finish the game really quickly. 10/10 would reccomend.\n\nHelpful | 1", "NooootDec 6 at 9:23 PM\nFun mechanics, great game\n\nIm coming from Rec Room climbing games and this is SO MUCH BETTER. The controls are nice, the graphics are nice, and the gameplay is nice. Theres a few minor issues but they barely affect gameplay. I highly recommend this if you enjoy the climbing in Rec Room.\n\nHelpful | 2", "mark.wolden.7Dec 4 at 4:36 AM\nIncredible\n\nI am not a climber but absolutely love this. Great graphics for the Quest and for me a great immersive experience. The dev team have done an\namazing job of this port and if they support with additional purchasable or free dlc all the better. All in all highly recommended, even if like me you dont do real climbing!\n\nHelpful | 0", "judefosterFeb 9 at 1:03 AM\n\n\nAlibaba\nDear dear have a cookie\n\nHelpful | 0", "Kevin_BrookDec 3 at 1:00 PM\nSolid port, very playable\n\nThe Climb was one of the first VR games I ever bought, and one of my favourites. The combination of stellar visuals, novel locomotion mechanics and the intensity of height presence made for a compelling experience. Even now, almost three years later it remains an essential PC VR purchase and one of the prettiest.\n\nI was delighted to see it come to Quest. The game has translated very well. It retains the same sense of presence and scale, the Quest tracking handles the movement just fine, and the graphics are great for a mobile VR game.\n\nHowever the sheer beauty of the full PC experience does make this feel like a noticeable visual drop. Nothing can be helped about that however.\n\nI love that the game is crossbuy but I am disappointed that the North levels do not seem to be included. The North was a series of new levels set in the frozen artic that released as a free update to the PC version way back in 2017 so not sure why they aren't included here. With only three of the environments available on Quest it means that compared to its PC counterpart there is 25% less content here. Hopefully they add it in to the game in the near future, in which case I'll bump this back up to 5 stars.\n\nIf you haven't played the PC version you won't likely care about this and if you're a Quester who is considering using Link, this game is a prime candidate to tip you over the edge and make that purchase, just as it will attempt to throw you over the edge in game!\n\n8/10 definitely recommended!\n\nHelpful | 7", "AwareKoraxApr 14 at 9:00 PM\nGreat Game\n\nThe mechanics of the game are super easy to understand so you dont have to think about which buttons to press while climbing!\n\nHelpful | 0", "CongratulationsDec 3 at 11:33 AM\nGood as PC\n\nPlay this on the rift, if your into VR Fitness games this is a must buy. Playing this on a quest is good the graphical downgrade is not much lower than PC as I though it would be this should be one of the first games you should buy if your new to VR.\n\nHelpful | 5", "KENNYVALENTINEMay 2 at 12:00 AM\nClimb\n\nSuper awesome...a must have!\n\nHelpful | 0", "ocularity99Jan 1 at 10:15 AM\nFun!\n\nSurprisingly involving and inuiative climbing experience, with plenty of engaging routes to do, and plenty of challenges to keep involved for a long time.\n\nHelpful | 1", "rcmagrawJan 23 at 5:56 PM\nWorth every penny\n\nVery immersive, fun and a good work out\n\nHelpful | 0", "msweat2018Dec 12 at 7:46 AM\nAddicting but need more ranges\n\nGets addicting. I enjoy it very much but only three ranges to choose with a few routes to go through. For $30, was hoping for more content. Would be great to add ice climbs, lengthier climbs, or even random things like sky scrapers. Overall it is one of the better games that have been out on Quest. Gets a little cardio work out for the arms. Would be 5 stars with more content.\n\nHelpful | 2", "THEB00GI3MANDec 14 at 11:17 AM\nAwesome game, just one small thing\n\nIm going to start this off by saying that this is currently my favorite game on the quest. I would 100% recommend this game to anyone who is thinking of buying it. The only bad thing is when your head interacts with an object. The screen turns black and You will usually fall as you cant see. Other than that, its a great game with great graphics.\n\nHelpful | 2", "Timo_WDec 10 at 7:46 PM\nBUY NOW!!!!!\n\nThis is the most amazing game I have played. Racing against your friends ghosts is so fun even though you know they are too slow for you. Sound design is amazing and the views are breathtaking. You must buy this game immediately. It is well worth the price.\n\nHelpful | 0", "atirathaDec 18 at 12:00 AM\nLove it!\n\nOne of my favourite parts of Vader Immortal Ep. 1 were the climbing sequences and this game consists just of them! Beautiful vistas, challenging puzzles and amazing that this is actually run by mobile hardware!\n\nHelpful | 1", "DdracoDec 15 at 12:55 PM\nGive Us A Free for all mode\n\nLove the game, gives me a REALLY thrilling experience. One comment is that I would like to see is a mode where you don't have to worry about stamina or chalk. My family wanting to play this, it was just to much for them to think about and not focusing on the climbing experience. PLEASE PLEASE PLEASE make this happen!!!\n\nHelpful | 1", "YochananTeomaHalldorDec 14 at 7:12 PM\nGreat game.\n\nAs a climber in real life, I was skeptical of how they could make this into a challenging game. But they did it. The only reason I don't give it five stars is because the game is a little glitchy sometimes. Namely if anything intersects your head in the slightest bit, the entire screen goes black. Also, there control scheme uses the trigger instead of the grip to grip the holds. This can be changed in the settings. But it automatically changes back without warning sometimes. I can't wait to see dlc on this game.\n\nHelpful | 0", "UmbrinoxDec 12 at 8:46 AM\nGreat climb, but not perfect\n\nOk, Im really desperate to give this a 5 star as the game is incredible! Holding your breath and heart racing as you jump from cliff face to cliff face and then onto a cable car and back onto the cliff as the cable car moves!!!\n\nFor me however, there are two fundamental flaws:\n\n1. When climbing, the rockface isnt solid. This results in your head going through it, resulting in a black screen where you cant see what you are doing, especially when climbing below a ledge. When this happened to me and my friends it was impossible to know where to put our hands.\n\n2. The controls in the menu are not well instructed and it took me three days to figure out that the joystick is used to go through options like gear. I was pointing and clicking thinking the app was broken.\n\nNow given the tech in a quest, other than above, I think the developers have made a masterpiece of a game. Im an ex climber and this has brought back a lot of good memories.\n\nThe graphics arent perfect but enough to give you the feeling of a realistic climb and my shoulders were soon hurting in a good way (try playing it with weighted wrist bands!).\n\nI like the fact you have a realistic mode with chalk but a relaxing free climb option too, which is great when showing off the quest to friends and colleagues.\n\nPersonally I hope the developers can take on board my feedback and cant wait for new updated content and areas to climb.\n\nHelpful | 2", "SJB255Dec 3 at 4:10 PM\nGreat game with major flaw\n\nThe content and graphics of the climb are both amazing and well worth 23, the scenery looks great and the climbing feels very good.\n\nHowever, there are some issues which can really affect your game. The screen goes black whenever your head goes into a wall, which would be fair enough if it worked. But it doesn't, the screen goes black for a fair while after you've moved your head away, and your grip is still dropping so this leads to lots of deaths, especially when jumping or moving under an overhang.\n\nAn even bigger issue is that this also counts for beams, wire or checkpoints, and the screen seems to go black if you put your head anywhere near these. This is a major issue when your hanging under the wire and makes some levels just infuriating where you keep dying because your screen blacks out.\n\nOne more small thing is that sometimes the grabbing doesn't work, usually when your falling, which makes dropping down to a lower ledge much more difficult because sometimes it just doesn't connect even if you grab it.\n\nBut with all this said, it's still a great game, but could use some patches then it would be an easy 5 stars.\n\nHelpful | 6", "lee838316Apr 27 at 12:02 AM\nPretty and immersive\n\nVery nice game, kinda bugs out and keeps setting the new hand placements outside of my boundaries. Overall pretty good game\n\nHelpful | 0", "shkirkJan 19 at 5:09 PM\nFantastic game\n\nReally good game. Great graphics and responsiveness\n\nHelpful | 0", "bigbow21Mar 29 at 7:30 AM\nLove it\n\nGreat game... I've tried this on the rift and it was the same feel with the quest. I was scared that the graphics weren't going to be good but they are. Buy there is a lack of maps but it's still fun\n\nHelpful | 1", "SlashAndBurnDec 13 at 9:14 PM\nI like it, but some gripes\n\nThe game is fun, once you figure it out, but some of the hard levels are going a bit to far, intentional falls to grab and wires that don't always work. But if I had a wish-list item it would be an option to turn off checkpoints, or disable the ones that are not tied to an achievement. Because if I get near the thing it attaches, even though i'm trying to avoid it.\n\nHelpful | 0", "aghkoDec 6 at 4:20 AM\nA bit too Hyped\n\nThe game looks great, best graphics I have seen in Quest so far.\nI got this game cause I read some review of other climber fellows telling that was a good simulation and gave 5 stars. Then got disappointed.\n\nWhat this game is: An immersive and great looking puzzle game with a climbing fantasy setup.\n\nWhat this game is not: A Climbing simulator\n\nHelpful | 4", "XtopheDeeJan 2 at 9:51 PM\nImmersive & stunning\n\nGreat visuals, immersive gameplay. Only completed 4 climbs plus tutorials so far but all are great. Some small issues: out of screen issue when u grab under an overhang can be disorienting at times.\n\nHelpful | 0", "100guldenDec 7 at 2:22 PM\nOne of the best games on the quest\n\nVery impressive graphics for the quest. Also nice details to make the environment more lively ( birds, insects and leprechauns).\nThe climbing in the game can be very challenging but rewarding.\nI hope Crytek will make more games for the quest. Good job on this one.\n\nHelpful | 0", "Will_I_AintDec 4 at 3:24 AM\nStill the most immersive VR game\n\nThe Climb was the first VR game I had ever tried back on the original Rift, and every time I go back to it, its still as incredible as the first time.\n\nHaving this experience available on the Quest only improves on the immersion, with the bonus of now being able to show the game to new first time VR users.\n\nMassive thanks to whoever decided to have the game available on cross play as well!\n\nHelpful | 0", "davel33123Dec 7 at 5:39 PM\nBest Quest game\n\nI have played them all from day one and this takes the crown ! Pure immersion exquisitely detailed from the world right down to its mechanics !\nDangling at these heights and having to make a jump is the greatest feeling on earth !\nWell done Crytek\n\nHelpful | 1", "Boba194230Dec 14 at 8:57 PM\nGreat game needs control fix\n\nThis game is so great! It is pretty terrifying when you look down or fall but so worth it. The only problem is the control preferences dont save so the much better alternate control scheme needs to be selected every time.\n\nHelpful | 0", "infinity3755Apr 22 at 6:52 PM\nVery fun\n\nI cant stop playing this game. Very fun to play against friends.\n\nHelpful | 0", "nate.lystJan 11 at 7:36 PM\nThis is one great game\n\nClimbing is the best part of VR in my opinion and this game makes it even better\n\nHelpful | 0", "venom2992Jan 6 at 4:25 AM\n\nThe game is amazing. The scenery is beautiful the gameplay is immersive and it's an all around enjoyable game\n\nHelpful | 0", "OrdinaryWorldDec 8 at 7:30 PM\nGood looking game but...\n\nI first tried The Climb on friend's Rift a couple of years ago and found it quite unnerving. It was my first VR experience, and indeed my last, until I bought the Quest at launch. I was looking forward to trying it again but having played so many VR titles in recent months, this game failed to have the same wow factor as when I was a VR virgin. That said, from what I recall, the Quest version certainly doesn't do the Rift version much disservice at all. In fact, the early gameplay is near identical and graphically, it didn't strike me as significantly inferior even though it must be? I did find the experience a little repetitive at times but then it's VR rock-climbing, so how varied can it be? I gave 4 stars, the 5th star being lost for a couple of quality issues. Firstly, I experienced some clunkiness in the control mechanics, like when jumping, sticking the landing and then falling for no apparent reason. I also got some weird graphical issues, one major \"big blinking blocks\" screen when starting the first level that forced me to restart the game. The biggest immersion killer is the \"your head is sticking through the scenery, please remove it\" warning, especially when it isn't and there are times when no amount of moving my head gets rid of the message. Another annoyance is that the \"tips\" on the load screen are out of my FoV so I can read them! I'm sure these will get ironed out soon enough though.\n\nHelpful | 2", "MissionReneJan 17 at 11:03 PM\nHands down amazing\n\nOne of the best games I ever played.\n\nHelpful | 1", "RunForrestRun72Apr 10 at 9:39 PM\nGreat graphics\n\nThis game is stunning even though it came out 4 years ago it is amazing, everything thing is realistic. It's a must play\n\nHelpful | 0", "TastyZombieSnackDec 11 at 5:33 AM\nRather good\n\nFun climbing game, beautiful views, real sense of exposure, and great feeling of routes I would never attempt in real life. Never played the Rift version, so the graphics look okay to me.\n\nCouple of things I would change if possible- when you fall, you fall all the way. Would be nice to have the fall arrested by your last anchor in the animation, or have the option to make it less screaming/traumatic. Also a way to plot a common route in advance would be nice. Plenty of climbers have been there judging by all the chalk, so probably there would be a lot of beta for that route.\n\nHelpful | 0", "kem423Dec 11 at 1:39 PM\nFantastic experience! Fix the blackouts\n\nThis is a great experience. Better than I expected. My heart actually would start beating harder, my toes would curl and my butt clench as I stretched through a technical section or jumped through the air trying to grasp for a finger hold. It really is a great immersive experience. The views a very pretty. The night climbs are pretty amazing.\nMy only complaint is when your head goes into the rocks or other objects the screen goes completely black usually causing death since you cant see where to grab. There really needs to be a way to stop the clipping of objects. Developers please dont allow the head to go into objects. Push the head away or something...please please something as this is the only thing that causes the immersion to break for me.\nIt would also be great to not have to keep changing the controls. Right now I have to change the controller to use the grip button for grip instead of chalk everytime I start the game. It would be wonderful if it would remember my settings.\nIf the clipping and blackouts could be eliminated I would give this game five stars.\n\nHelpful | 0", "robashcorlettDec 9 at 9:04 AM\nSweaty Palms!!!\n\nHave wanted to play this ever since I have saw the trailer on the Quest pre-release info. It has been a long wait but well worth it!! I havent got too far in yet but what I have done is stunning!! The Bay i on easy is only really a taster! The canyon section is something else!!! More challenging climbing and really stomach churning hand over hand across the wire with a straight down drop to the river below. When I got to the top my vertigo really kicked in and I had to exit fairly quickly to the menu screen!!!Looking forward to developing my skills and earning the achievements. My only criticism is that black screen when your head is too close to the rocks above. It really takes you out of the immersion of the game. Also I cant seem to be able to push off and jump??\n\nGoing to the Alps next and not having to spend a fortune to get there!!\n\nHelpful | 1", "Flitch_1989Dec 11 at 2:03 AM\nA very pretty game, but has its issues.\n\nA lovely game, the graphics are amazing and the climbs are challenging enough for plenty of replayability. It does have a tendency to crash mid game, and can glitch out when you fall (you don't respawn, you just hear the character heavy breathing in pitch black, not realy my thing ;P ) the only real thing I find hard to deal with is the forced perspective when it recenters you on the cliff. So you don't so much climb around the mountain as it movies around you. Plus it can start juddering when you grab the wall, but usually after moving through part of the wall quickly, so proud bs just struggles to keep up. But I would still recommend it.\n\nHelpful | 0", "KeyRatioJan 26 at 10:09 AM\nFun\n\nFun\n\nHelpful | 0", "caleb.daviesgrayJan 16 at 6:29 PM\nGreat Game, bit expensive\n\nI love The Climb, and play it quite a bit, but I dont think that the price tag suits what the game has to offer.\n\nHelpful | 0", "LazyActivistDec 3 at 2:44 PM\nBest on quest invest.\n\nThis looks fantastic on the quest and with the free movement makes this possibly the most immersive experience available on this fantastic bit of kit. Well worth the cost - must buy.\nThe more I play this the more I love it, Im in the middle of Asgards Wrath but thought Id give this a quick try, it may be weeks before I get back to any other games.\n+ Crossplay too, cant wait to try out on the link too for visuals but I think wireless will remain the best way to play, thanks devs you rock!\n\nHelpful | 7", "Bam_Bam12345Jan 6 at 4:16 PM\nVery good\n\nWas very entertaining, I showed this to my dad and he was very amazed by the graphics and controls.\n\nHelpful | 0", "ludusvrDec 8 at 1:05 AM\nGreat game, but...\n\nThis a great game.\nI was so happy and intrigued that it came to the Quest it was an instant purchase.\n\nBut.. there are some downsides.\n\nThis game recently came out so you should expect bugs and glitches, due to being a downgrade of the original.\nThe game looks good, but the graphics need improving. Some glitches like falling off a cliff out of the ordinary.\n\nIt most probably will be improved, but dont expect major graphics and super smooth gameplay.\n\nIt will improve, I hope.\n\nHelpful | 1", "spartansk1Dec 3 at 11:30 PM\nSolid game, more depth than youd think\n\nGreat game. There is actually a lot more strategy involved than I thought, which makes the game more challenging (in a good way) instead of just a sight seeing tour. Though I wish there were more than 9 levels (3 areas with 3 levels each) Im sure there will be DLC in the future. The game looks about just as good as you could expect out of the quest. Really rewarding experience, Id suggest checking it out - good workout too!\n\nRemoving one star however for the poor tracking when in contact with a surface within the game (itll fade to black with no warning, and often causes you to die)\n\nHelpful | 3", "TheRikes2019Dec 10 at 6:36 AM\nGreat Game\n\nStunning views and graphics but still a little glitchy. So I used to have a rift and we purchased the game on that. Unfortunately it never worked, when you would load it up everything would look like its working on the computer but in the actual head set all you could see was darkness. This was really disappointing for a 30 dollar game so when I saw it on the quest I was hesitant to buy it. I convinced myself to get it and it worked! The game is really fun to play and I have only run into a few glitches but its still a relatively new game to the quest so its OK. Great Game.\n\nHelpful | 0", "DrewTheDude123Jan 30 at 12:47 PM\nGreat game\n\nFun\n\nHelpful | 0", "jericho2005Feb 7 at 9:21 PM\nEh...\n\nIts the same thing time and time again. But I liked the concept and it was visually amazing. Maybe its just me, but I felt that there wasnt a whole lot to do\n\nHelpful | 0", "Alpha_JayMar 15 at 2:04 PM\nFive stars. :)\n\nThis game is a very fun and easy way to have the thrill of climbing right inside your home. Whether its relaxing and taking you time, or vs racing, its always going to be a good time. Worth the money spent. Recommended to any new players.\n\nHelpful | 0", "vrabbitsDec 3 at 3:15 PM\nAmazing\n\nWhat a cool game. This game is perfect in every way. The look and feel are spot on. Wish they added the north update but since it just now arrived in,fine with what I have. Ive seen many people play this on their rifts and finally I can too. Highly recommend it.\n\nHelpful | 1", "AmberAmber12May 18 at 8:52 AM\nNice graphics but can get boring\n\nAfter playing Echo the movement and climbing makes this game feel simple.\n\nHelpful | 3", "sara.thompson1997Jan 26 at 10:56 AM\nBeautiful game\n\nVery immersive. My only problem is that I get very motion sick from this game.\n\nHelpful | 0", "SethPoseyDec 8 at 3:01 PM\nCONTENT\n\nWorth the bucks. I haven't experinced any of the negative comments and I belive it lives up to the hype. I would like to see a save feautre for the controls and I expect there to be add on maps, would love to see those free.\n\nHelpful | 1", "Gary00Dec 4 at 2:41 AM\nIts okay\n\nThe game is well made and polished but I just dont find it that fun to play.\n\nIve tried it a few times both on rift and now on quest and I just cant get into it.\n\nGood for those who enjoy it but I have to give it 3 stars.\n\nI feel a little sick after playing so I might try it again tomorrow sitting down.\n\nHelpful | 7", "RoomyPuppet4033Jan 17 at 7:11 PM\nIts a great game, played it for hours\n\nOk it's a great game but theirs some levels missing on the pcvr version theirs a category called North why is that not in the quest version?\n\nHelpful | 0", "Juggo85Dec 21 at 3:22 PM\nGood but could be better\n\nGameplay is awesome however immersion is ruined by the poor rendering of the scenic space you are climbing in. Wish the graphics could be better when I reach the top and look around. Seems worse on the left hand side when looking around\n\nHelpful | 0", "MutantbroomDec 4 at 12:17 AM\nA must-buy for the quest\n\nThis game is the whole package: amazing graphics, fun and challenging gameplay, top notch level design, plenty of content with tons of replayability, a solid progression system, and the best part: its cross-buy.\n\nHelpful | 4", "Mad_AM_SkyDec 5 at 6:55 AM\nAmazing!\n\nThis game is super epic! I was worried about the environments on the quest but this game did not disappoint! I found myself still getting nervous as I climbed higher and higher and the views at the top are completely worth it! 10/10 would recommend.\n\nHelpful | 0", "mattshawDec 8 at 6:02 AM\nSo far pretty decent\n\nI thought the gameplay would be fairly limited but Ive just got to maps that include poisonous plants, breaking platforms, zip wires and ridiculous jumps so - pretty surprised at what is on offer.\n\nThere are free climbing modes, modes where you need to race too and - for the most part - you actually feel like youre getting a work out. My only nit pick is falling isnt scary. If you have played The Plank Experience, THAT game makes my stomach go when I drop. Had it been like this for The Climb, it would have been a five star game because, despite the feeling of height here, it doesnt feel as though you have much to lose if you fall. Had the element been there to make your legs go, every time you did, you would certainly think twice about the more risky move.\n\nA good game nonetheless and a fair price. A worthy edition to your library and something different to the normal gun games.\n\nHelpful | 1", "AM800MatsDec 4 at 11:03 AM\nGreat game with a few problems\n\nI love the games graphics! But I don't understand why the grip button isn't actually gripping! In all other games the grip button is used to pick things up and climb. Maybe an option to change this? Also had a few small hickups and random black screens when getting close to walls and it's very hard to get back out since there are no directions. Other than that the game is great! Just a few early build issues!\n\nHelpful | 2", "cncn60Dec 4 at 4:41 PM\nCool atmosphere and gameplay, but...\n\nId honestly give this 5 stars, except for some reason sometimes when I grab onto grips my head snaps a bit which is kind of jarring and takes you out of it. I wish it would just leave your head where it was when you grab things. Other than that though, this game is really cool, and so far Im definitely enjoying it a lot\n\nHelpful | 2", "xXkermitdafr0gXxDec 27 at 11:54 AM\nBreathtaking\n\nI really enjoy this game. The breathtaking views are one thing but the actual game mechanics are fun and is a workout in itself.\n\nHelpful | 1", "DogeMan207Jan 11 at 6:13 PM\nNice\n\nIdk what to say but its fun and does not look that bad\n\nHelpful | 0", "DavisMDeanDec 4 at 8:14 AM\nNew First Demo\n\nThis absolutely soars to the top of my try this one first list for demoing to new users, so informative, so beautiful, but completely bails the purpose of VR and definitely even better now that it is wire free with the quest!\n\nHelpful | 2", "agitokazuDec 4 at 9:24 AM\nAmazing Title\n\nUpdate: lowered it by one star.. occasional crashes by apparently loosing tracking after 2 or more hours of extended play..\nThat reason alone can be quite annoying\n\n\nJust updating my review of this game\n- visuals are pretty good for a mobile VR title\n- quality a straight port of the Rift version\n\nWhat else is there to say lol\nIt's Crossbuy as well\n\nHelpful | 2", "KeithTheEditorDec 6 at 5:52 PM\nFun unique and entertaining title!\n\nMonths ago, I took a risk and bought this on sale in the rift store. I read on uploadVR that it would be crossbuy, and the gamble paid off! Got it for 19.99! Game so far has been fun. Unique gameplay to keep you from just hanging around. Fun environments and interactions. Clever gameplay. I'm almost 41, and I get a little queezy after playing this for too long. Probably worth it for 29.00 but amazing for 19.99! I did have issues with headspace, as other reviewers have mentioned. Also kind of strange you use the back button as select versus the trigger. Also very odd they never tell.you that you have to take the advanced tutorial before moving on after completing three stars in \"bay\". So odd and confusing. I kept playing over and over to unlock the new maps and it wasn't letting me until I.took advanced tutorial.\n\nHelpful | 2", "pgc77Dec 5 at 6:41 AM\nLoving it so far\n\nThe exhilaration you get to the top is amazing and the visuals are beautiful as well. Climbing is spot on and all and all an amazing experience. Dying is a lot of fun too. If they inserted the Wilhelm scream I would be in heaven. I had never played it before so I dont know what I am missing graphically. There is a little bit of defracting when you turn your head looking around which is slightly distracting from the overall feeling and it is annoying when your head gets stuck inside a rock and you cant find your way out. If they fix these two issues it gets five stars! Very fun game overall!\n\nHelpful | 1", "PizzaIzBaeDec 21 at 2:50 PM\nYeos\n\nThis is a great game but its a little too expensive for not much gameplay. I finished the game the day I got it. Is there gonna be more gameplay? I love this game and it feels real but where are the levels??\n\nHelpful | 2", "tofasttokevinDec 6 at 1:01 PM\nThe whole reason I bought the quest\n\nWhen I first heard about the quest and all the games that were coming this is the game I was most excited about. Took a while to come out but Im glad its as good as I thought it was going to be! Itll make you sweat immediately!!\n\nHelpful | 1", "CreativeBansheeDec 8 at 12:50 PM\nHonestly so good\n\nEven though theres 15 levels, you can race yourself and friends too. There is also the endless wall thats really fun. Must have game when you get your quest. Some more levels would be greatly appreciated though\n\nHelpful | 1", "satellytesDec 22 at 12:02 PM\nGreat gameplay\n\nI didnt know how this could be fun. Especially without feet. But the gameplay is super challenging, love to detail, great level design. Superb immersion.\n\nHelpful | 0", "LSUCoatesDec 26 at 11:26 AM\nAmazing\n\nTHIS GAME IS AMAZING. i really think that all of this cool stuff is just amazing and i really like the animations and the view\n\nHelpful | 1", "candromDec 27 at 6:07 AM\nExciting game!\n\nDidnt know what to expect! Havent tried it beforehand, and my only VR experience stems from my quest.\nIm in love with this game! Its challenging, immersive and has got beautiful views!\n\nHelpful | 0", "Sniperwolf64Jan 5 at 9:19 PM\nInsanely incredible\n\nThe climb is A perfect game for all it is amazing for views its like movies\n\nHelpful | 0", "jobbie1kinobiDec 5 at 12:46 PM\nThis is it!!\n\nAmazing game, the background graphics are a little low res which slightly detracts from the scenery and the immersion but I guess thats just the limitations of the Quest, its impressive that they have managed to get it on the platform Im the first place. Having said that, the actual climb and the mechanics of climbing are superb, the immediate graphics, ie the hands, the rocks and the obstacles are brilliantly realised and you really do engage with it. I genuinely whooped on the death slide. My arms hurt after playing this but that can only be a good thing, right? Love it and cant recommend it highly enough. If I could improve one thing I would want the scenery in the distance to be clearer but I understand that this was probably the compromise to get it on Quest.\n\nHelpful | 0", "linkinprkmxDec 5 at 9:59 AM\nI am still not sure\n\nI am still not sure every time I enter the oculus store the app is pushing me to rate it I have just played for like 30 minutes in 2 days, the game looks interesting but I really need more time to make my mind, in graphics look awesome but In the 30 minutes I have played this is one of the only games I get dizzy and is why I havent played more, I have Oculus Quest, and I am 47 years old, probably is because I am old, but this is why I give it a 4 stars\n\nHelpful | 0", "slickwilly1021Dec 10 at 9:00 PM\nGood so far !\n\nTough choice between this or A. Sunshine , I chose this because of the great reviews ( although that has good reviews too ) so far I'm really impressed with this game. Looks fantastic as well .\n\nHelpful | 1", "cbain75Dec 26 at 6:37 AM\nSuch a breathtaking experience\n\nThis game is so good!!! Literally I just actually thought I was climbing. Definitely get this game!! It is so fun and worth it.\n\nHelpful | 0", "Shan0122Jan 13 at 12:11 PM\nAwesome!\n\nIt is really life like!! I love it!\n\nHelpful | 0", "JoeCoastie22Jan 5 at 8:04 AM\nThe climb\n\nI absolutely love this game. Its fun, challenging and a all out blast!\n\nHelpful | 0", "GrimmcragDec 26 at 1:09 PM\nBrilliant\n\nExtremely immersive and tons of fun. You sometimes find yourself just stopping halfway up a cliff just to admire the view.\n\nHelpful | 0", "kawaiilemon-21Jan 4 at 11:14 PM\nAmazing\n\nThis game by far is my favorite game. Its exciting and action packed.\n\nHelpful | 0", "davykatJan 16 at 6:39 PM\n\nAwesome\n\nHelpful | 0", "MinskyBooJan 17 at 7:48 PM\nPretty Cool Game So far\n\nIts pretty cool. I dont know if its worth the money though.\n\nHelpful | 0", "Ali-A92Jan 12 at 9:20 AM\n\nThis game is Amazing\n\nHelpful | 1", "dcallearyDec 27 at 1:04 PM\nAmazing\n\nGreat food if its what youre looking for. Amazing graphics make you feel like youre there.\n\nHelpful | 1", "Jeroen74Dec 3 at 1:54 PM\nDon't look down \n\nI bought the game in 2016 for my cv1, today I tried it on my Quest, I love it, visuals are stunning and gameplay is the same as on pcvr. Will I play it on my rift again? Not sure...\n\nHelpful | 4", "SwurvDec 25 at 3:06 PM\nOverall Good Game!\n\nA part from the tutorial which was confusing and difficult to maneuver (especially with a tight play place). Overall the levels are beautiful and include extraordinary graphics.\n\nHelpful | 0", "Sweaty_Steve007Jan 11 at 10:32 AM\nIncredible graphics\n\nI screamed when I fell...\n\nHelpful | 0", "friedgoldmoleDec 5 at 12:09 PM\nAlmost the full PC experience\n\nI am actually amazed what they pulled off with this port, graphics are very impressive for the limited specs that the quest have. The gameplay is full intact and it's a great, challenging and fun game to play.\n\nHelpful | 1", "Stimul8UrSensesDec 31 at 9:53 PM\nLOVE ITTTT\n\nBought it a few days ago DEFINITELY worth the money!!\n\nHelpful | 2", "isv911Dec 4 at 2:52 PM\nAmazing game. Big comprimises\n\nAfter seeing what was capable on the quest with Moss and Vader immortal, I had high hopes for this game. What we got is a graphical mess of a brilliant game. Good gameplay experience once you learn to accept the graphics for what they are.\n\nHelpful | 4", "BurritoMaster32Dec 20 at 4:45 AM\nBreathtaking\n\nThis game is absolutely beautiful, it is also extremely scary. You can feel the floor below you but falling feels so real\n\nHelpful | 1", "Wayned45Dec 3 at 2:29 PM\nJust Brilliant\n\nThis is what VR experiences should be, its just so immersive. The developers deserve such praise for doing a an absolutely fabulous job. Well done lads... it was worth waiting for!\n\nHelpful | 3", "WolverineHobbitDec 7 at 4:24 AM\nWorth the wait\n\nI have been trying to get the climb for years but I didnt have a computer to get an oculus until the quest and this game is awesome please get this game you wont regret buying it\n\nHelpful | 1", "treemlDec 3 at 2:14 PM\nCrossbuy, thankyou for not being greedy!\n\nlooking at you. Job simulator people.\n\nHelpful | 5", "Bub4allJan 3 at 12:52 PM\n\nGreat fun. You can actually feel like youre falling.\n\nHelpful | 0", "Silent-GreenJan 12 at 6:08 AM\nFun\n\nIts fun\n\nHelpful | 0", "oysterassassinJan 1 at 8:04 AM\nGood and bad\n\nGood graphics but lots and lots of program glitches. Great climbs all throughout and none overly difficult UNTIL you get to the boulder climbs, then virtually impossible and I stopped playing. The scoring system is absolutely a nightmare of chaos. Absolutely no clue what the scores mean, which was another reason to stop playing.\n\nHelpful | 2", "That_Guy_25Jan 16 at 1:25 PM\nCan Not Proceed\n\nAfter finishing the tutorial, it doesnt register myself pulling my hands up to complete the level, instead I keep sliding off and dying, restarting and coming back the next day does not fix this and Im just barely able to play the game, if we are counting the tutorial which isnt that hard.\n\nHelpful | 0", "BlkGTR33Dec 25 at 4:07 PM\n\nAmazzzzing... Please make a spiderman game. I think you guys would pull it off.. the PS4 is behind.\n\nHelpful | 0", "BubbaOGDec 27 at 2:01 PM\nGreat\n\nVery exhilarating. Very great game good to start off with the Quest.\n\nHelpful | 2", "crazyjandro1007Jan 9 at 4:26 AM\nGreat game\n\nJust amazing\n\nHelpful | 1", "zologamerJan 23 at 9:13 PM\n\nFun\n\nHelpful | 1", "cercataDec 4 at 12:27 PM\nTotally awesome, the best version\n\nBoth graphics & tracking were better than my expectations.\nBecause of it's freedom, i prefer this version to the Rift version, and in most games I prefer the Rift version.\n\nHelpful | 3", "cuc304Dec 16 at 4:51 PM\nGreatness Awaits\n\nGreatest VR game I have ever played. If you dont own this game there is seriously something wrong with you. Why do you even own a VR then?\n\nHelpful | 0", "okeyoneDec 3 at 4:32 PM\nScared of being to High.\n\nIf you got all fuzzy watching the movie \"Free Solo\" you'll love this game. Get a new HIGH and start The Climb! So far lots of fun. I recommend giving it a try. See you on top.\n\nHelpful | 3", "Parzival-oneDec 4 at 3:39 PM\nA Must But Makes Untethered VR *****\n\nA must buy amazing visual and flawless game play 5***** all the way best played on quest for untethered and cross buy for all you oculus link junkies \n\nHelpful | 2", "thorganDec 5 at 4:57 AM\nGreat relaxing game\n\nThe Climb was already a great game, theres been a noticeable graphical trade off on this quest version but it doesnt stop from enjoying it.\n\nI think its a zen experience.\n\nIf you want to stretch, work on your balance, you will be having a great time.\n\nHelpful | 0", "jamesgroteDec 26 at 11:25 AM\nMenu too bright.\n\nThe game is instantly blinding bright white. The tutorial is all white and unplayable. Please do dark mode.\nAfter playing more I found the actual climbs to be quite impressive.\n\nHelpful | 1", "DaPugE1Dec 31 at 3:32 AM\nGreat game, lots to do\n\nAmazing game. A must buy on the quest\n\nHelpful | 2", "FatalSaintNeoDec 5 at 10:43 AM\nLove The Climb\n\nThis is one of my favorite games for VR games/experiences for sure. I loved it on the Rift and love it on the Quest. My only complaint is that it didnt come out on Quest sooner!\n\nHelpful | 0", "Generalconquer5Jan 1 at 2:38 PM\nThis should be Game of the Year\n\nThis game is awesome and addictive\n\nHelpful | 1", "eggtophatJan 9 at 4:47 PM\nyeah\n\ngood\n\nHelpful | 0", "alfie.wilding.75Dec 26 at 6:23 AM\nVery good\n\nVery realistic,love the stamina feature and the choking feature\n\nHelpful | 1", "LlamaaceJan 6 at 2:08 PM\nGood\n\nIt was super good\n\nHelpful | 0", "Maverick-007Jan 25 at 5:33 PM\nIt was of my money.\n\nEvery time I was starting and tutorial wasnt going away and starting from all over again.\n\nI didnt enjoy it at all. I hope they refund my money.\n\nHelpful | 2", "MoonDaSpoonDec 10 at 3:19 PM\nFantastic game\n\nThis game is beautiful and very immersive. I climbed for hours until my back started to hurt  anyways the game is super fun and well worth my $30\n\nHelpful | 0", "GamersEvilDec 4 at 10:44 AM\nA great port to quest\n\nWow! I couldnt believe they did it this good. The game is perfect. A must have for everyone. It gives you a good workout, too.\n\nHelpful | 5", "SwaggybaggyboiiDec 31 at 12:02 PM\nBruh\n\nThis game is a must buy\n\nHelpful | 2", "realmeagleDec 31 at 10:03 PM\nIncredible\n\nSimply INCREDIBLE\n\nHelpful | 2", "ReviloaDec 3 at 4:20 PM\nThe wait is over\n\nPlayed for half hr. Plays great, looks great. Got some motion sickness from falling / jumping. Taking a break to type this review. Overall hopefully wonderful if no more motion sickness as one gets better with the climbing techniques.\n\nHelpful | 3", "GabeG888Dec 25 at 8:17 AM\n\nGreat game\nDoesn't meet the grab button vrc by default though\n\nHelpful | 1", "PamptaFeb 4 at 3:43 PM\nTitle\n\nUh so I accidentally put 1 star but its a good game\n\nHelpful | 58", "Stormbringer323Dec 14 at 11:52 PM\nTruly breathtaking\n\nThis game is outstanding from the wonderful visuals to the little sounds that make it so realistic. The hands to the rocks all look straight from real life\n\nHelpful | 0", "GetVRFitJan 4 at 4:27 PM\nNot sure yet\n\nIve been playing this game for a month and am still stuck on the first level (easy zen). All I see is stamina challenge on the bottom and dont know what that means. I think i have climbed all I can in the level. Any help would be nice. I'm sure I'm not the only one with this issue.\n\nHelpful | 1", "srt23Dec 7 at 5:27 AM\nGreat game\n\nGreat game both on rift and quest! The graphics are of course downgraded a lot on the quest. But the gameplay is still the same highscore chasing one. Love it!\n\nHelpful | 0", "yasinusta40Dec 11 at 11:38 AM\nPlease make more games!\n\nThis game is awesome and I liked a lot. I feel the adrenaline in my body. Please add next time some mini games or jumping with parachute...\n\nHelpful | 0", "meatymarleyJan 7 at 3:59 PM\nYeet\n\nEpic\n\nHelpful | 0", "tripptrevJan 3 at 6:36 PM\nGreat game\n\nIt's very replyable\n\nHelpful | 0", "CrispyCrabDec 25 at 11:49 AM\nMy personal favorite\n\nI love this game. All I need to know is how to download the north dlc\n\nHelpful | 0", "BazooGamingDec 4 at 4:43 AM\nAmazing\n\nThe graphics look amazing. Almost real at some points! The gameplay is fun and there are loads of maps and things to do. If you have the money, buy it!\n\nHelpful | 2", "TripleBWIDec 4 at 7:51 PM\nOne of the best simulations Ive seen\n\nThis game has realism and strategy all wrapped into a beautiful environment. Too bad it took so long but glad they took their time developing it.\n\nHelpful | 2", "ThunderAmigoDec 25 at 7:46 PM\nBest Game\n\nThis is the best game I have ever played on a VR\n\nHelpful | 1", "niglu100Dec 9 at 12:02 PM\n\nThe graphics are really good for quest game. One of the best games what i have ever played on quest. The game doesnt run perfectly but good enough for snapdragon 835 processor. Great job devs \n\nHelpful | 0", "steve.j.dunnDec 15 at 2:50 PM\nGlitchy\n\nDownloaded it as soon as it came out , first 15 minutes I knew this game wasn't for me , way to many glitches to the point it becomes annoying, it doesn't give you that feeling like you're actually claiming a cliff ,I requested a refund but of course I wasn't approved.\n\nHelpful | 7", "tcmgamingDec 19 at 9:38 AM\nGreat for anyone with arms\n\nFirst off all I would like to mention how incredible it feels to play this game and even thought people complain about the graphics of the landscape not being very good its hard to notice as you spend most your time focusing on climbing. This is a must buy as it has tons of replay ability:)\n\nI do have a small question for the deveopers which is will the environment: north be coming to quest? Thanks a lot for making such a great game and hope to get a response \n\nHelpful | 2", "McWaluigiDec 5 at 4:27 PM\nDisappointing\n\nI was looking forward to when it would finally come out on the Quest, and I bought it immediately when it did. The thing is, though it is fun at first, it contains a lot of glitches. For example, when you need to clean ledges with rocks, sometimes it just doesnt work and you fall to your death. Also, your arms can just stop moving while youre climbing. Lastly, it didnt contain the map I was most excited about: North. That was the one map not included. It can be fun, but overall disappointing\n\nHelpful | 9", "redrum033Dec 12 at 11:27 AM\nBest game ever\n\nThis is definitely the best game I have played on the oculus so far its so smooth and realistic you forget ur in vr\n\nHelpful | 0", "Bud_DevDec 25 at 7:42 PM\nNot as good as it seems\n\nPeople say this game was Really good and the views are stunning. 1:The views are NOT GOOD they look like they are 8 bit and made horrible! 2:They dont really say much a lot about what the controls are about! 3:THIS GAME IS SO OVER PRICED!!!! I would say it would be about 7$ compared to 30$\n\nHelpful | 3", "OkmijnuhbygvJan 8 at 4:52 PM\nGreat\n\nFavorite game other than beat saber\n\nHelpful | 1", "CEOofGooseFeb 29 at 2:14 PM\nNot that good\n\nNot that good\n\nHelpful | 2", "aliali1712Dec 18 at 12:06 AM\nVery good game\n\nI would have said the best bit but all of is. I like that wristbands is a handcuff.\n\nHelpful | 0", "DerekImmeDec 7 at 6:46 AM\nUnbelievable!\n\nGraphics are great and there is soooo many challenges! I could go on for hours and hours! Amazing game, and super fun\n\nHelpful | 2", "TumichnixDec 8 at 11:28 AM\nawesome\n\nreally cool\n\nHelpful | 3", "CatWithAJetpackDec 8 at 12:01 PM\nWow\n\nThis game is just amazing! The graphics are great, the gameplay is great, but its not for people who get motion sick.\n\nHelpful | 1", "EpicGamer58Jan 17 at 8:38 AM\nWhy???\n\nOkay, so this game was ok, quite fun as a matter of fact, I mean, sure, the challenges can kiss my @$$, but I was planning on dropping it to only 3 because of that. But, I dropped it down the rest of the way because I was doing well on one of the hard challenges (which are absolute crap by the way), and then I ended up being led to think that checkpoint B was but a few grips from checkpoint A, where checkpoint A was long and tedious. I was then presented with a jump that looked potentially doable, I then figured out the hard way that it wasn't. Turns out there were 2 breakable ledges below an appealing looking safe ledge, and it's set up so you just BARELY miss it and fall down onto the breakable ledges, and, as you guys likely know, breakable ledges break as soon as you land on them after a fall or jump, so you can likely imagine what comes next. I very unfortunately enjoyed the game up to this point, so I can't refund it. Well, guess this will just gather dust for a couple weeks or so before I inevitably come back and end up tossing my headset once more. Oh ya, and one more thing before I end it. You can't chalk on the hard challenges. So I also had to go through it like there was a boulder loosely taped to my back. I can't reccomend this to anyone looking for a decent challenge.\n\nHelpful | 3", "The_SingularityDec 27 at 11:19 AM\nGreat\n\nIt looks very nice and works well.\n\nHelpful | 0", "Lazer241Dec 25 at 8:48 AM\nGreat game\n\nThis is a great game and is super detailed!\n\nHelpful | 0", "Zensix6Dec 23 at 3:28 PM\nAmazing experience !\n\nWould be even better if they manage to make the background sharper in a future dynamic fixed fovet rendering update,...\n\nHelpful | 0", "masonromanowski69Dec 27 at 1:04 PM\nAmazing game\n\nVery cool. Must buy.\n\nHelpful | 1", "Celeritas808Dec 11 at 11:32 AM\nGood but one issue\n\nOk Ill make this short. Basically the climb is a very good game however Ive found there is a lack of content. If you are new to vr however I cannot recommend this enough\n\nHelpful | 0", "SlapHappy54Dec 6 at 5:46 PM\nAmazing Game\n\nBest Game Ive ever played on the quest. Would be worth 60$!!! A steal at 30$ and the first game you should buy on the Quest.\n\nHelpful | 0", "Dexter1258Dec 9 at 4:03 PM\nAwesome game\n\nAmazing experience. Only feedback Id give is to indicate how you can unlock higher difficulty levels.\n\nHelpful | 1", "kevink808Dec 12 at 8:45 PM\nGood on Rift, GREAT on Quest!!\n\nFinally! Free if the tether like it was meant to be. So much more immersive and good exercise!\n\nHelpful | 0", "Nebulousbelt97Dec 25 at 9:06 PM\nBest vr game\n\nThis game is really realistic\n\nHelpful | 0", "MilkToast_415313Dec 14 at 11:45 AM\nSo immersive\n\nWow! Im afraid of heights. This game is so fun and terrifying lol\n\nHelpful | 2", "Ace288Dec 5 at 1:10 PM\nClimb\n\nI really like this game you lots of achievement todo and game play excellent. I recommend this game and its a great buy \n\nHelpful | 0", "sunandsnow24Dec 3 at 2:08 PM\nFantastic game\n\nAmazing game! The visuals are stunning. I love the feeling of doing something new, this is what VR is all about.\n\nHelpful | 3", "4rft5Jan 8 at 8:41 AM\nThis game is both fun, relaxing\n\nI loved playing this game.\n\nHelpful | 0", "obi2kenobiDec 3 at 7:50 PM\nDid not translate to VR for me\n\nThis game is a technical marvel with the usage of Vulkan API for rendering, but for me i just did not get the thrill of climbing. i think there are several reasons for this.\n\n1. no usage of feet, which are important in climbing and can even let you rest both hands simultaneously at times\n\n2. when climbing you generally keep your arms straight while moving around so you dont wear out your arms. that isn't necessary here and my arms typically rested right in front of me below my face which was just weird. straightening my arms like real life is possible but feels unnatural since im not actually hanging\n\nSo for me the experience just doesn't translate at all. i wanted to give it a try since it received so much hype and rave reviews, and i do believe it is well executed technically. but the concept just doesn't work for me.\n\ni give it 3 stars as a well made game, but can't justify a thumbs up for something i didn't enjoy.\n\nHelpful | 11", "Cowb0yDec 11 at 7:35 PM\nWOW!\n\nThis game is definitely a must buy.It has stunning graphics ,replay ability,and is so fun.\n\nHelpful | 0", "beauregardenerDec 27 at 10:52 AM\nPretty amazing\n\nPretty amazing\n\nHelpful | 0", "jeremiah.jones.86Apr 5 at 1:12 PM\nGreat so far!\n\nJust fun!\n\nHelpful | 0", "BunchyGem53487Dec 26 at 10:49 AM\nAmazing\n\nAmazing\n\nHelpful | 1", "GTHobbesDec 3 at 11:22 AM\nAwesome game\n\nGreat graphics and tracking + no cords = Fantastic game\n\nA+\n\nHelpful | 7", "barber_cavarderApr 3 at 11:11 PM\nPretty good\n\nI like it\n\nHelpful | 0", "BO0PDec 26 at 8:01 AM\nGood\n\nGood\n\nHelpful | 1", "blanca.narvaez1Dec 9 at 4:52 PM\n\nIts a work out on my arms love it .. looks so real oculus quest is awesome glad I bought this..\n\nHelpful | 0", "amschulze79Dec 5 at 1:47 PM\nPerfect game for the Quest\n\nPerfect game for the quest. No disturbing cable. Like the feeling of height and the effects (e.g sunshine).\n\nHelpful | 1", "ReBornTheFirstDec 8 at 2:32 AM\nCross-buy\n\nLoved this game on the cv1\n\nHelpful | 2", "YTLIMITLESs13Jan 5 at 11:01 AM\nFun\n\nIts a fun game\n\nHelpful | 1", "LittleGideonDec 7 at 5:47 AM\nAmazing\n\nFeels so real at times and the views are stunning\nI hope they can make more maps in the future\n\nHelpful | 1", "i_that_potato_guyMar 26 at 9:30 PM\nAmazing game\n\nIt looks realistic and includes real features\n\nHelpful | 0", "QuestboymanDec 20 at 5:32 AM\nOne that deserves hand tracking\n\nPerfect game.\n\nHelpful | 3", "tfh74Dec 23 at 3:38 AM\nGood game\n\nIt's a decent game but need more content will there be any DLC in the future?\n\nHelpful | 1", "Wario_FartsDec 15 at 9:09 AM\nVery Fun\n\nThis game looks beautiful and the climbing is exhilarating.\n\nHelpful | 0", "Perry2J1Dec 4 at 9:39 AM\nBad Port Job\n\nThe Quest while not very powerful at all, given the right engine and dev team using every bit of power it does have can produce exceptional games/ports, but this is not the case, while the game is the same and functions the same, the framerate takes a hit as expected but its noticeable enough to point out, graphics should be the star of the show but surprisingly Crytek has not delivered, muddy textures even the chalk marks are muddy, not the short ones but longer chalk marks are which sounds petty but in the canyon area the path ahead is rarely clear because of this,\n\nTheres also no feeling of depth/distance, if you look to the distance its just a picture paste job which makes sense but if you look out in the distance and turn your head semi quick and look to the edge of the lens left or right you can see the bad clipping of the picture paste job that was done, it breaks the emersion and made me not want to look out nd enjoy the view because ironically it wasn't good,\n\nThere also seems to be slight imput lag with the controllers, only slight but it shouldn't be there and might annoy some people, all in all given the time this port has taken and the devs being Crytek its a bad port but i suspect they was working on a more important AAA game at the same time which results in this half okay half shoddy port, the game is crossbuy and thats a Pluss, however this Wireless version should of been The Version to play, its a missed opportunity and honestly another stain on Cryteks Rep, if you commit to making/porting a game then put your best foot forward,\n\nIf you bought the Rift Version long ago then its worth a try atleast but if you are new and looking to buy, i recommend the Rift Version, however if your set on this Version then wait for Deep Discount\n\nHelpful | 13", "darceyderosaDec 4 at 6:52 PM\nLove this\n\nGlad to get the Climb, but slow download ruined my fun. Had to wait 2 days before it downloaded!!\n\nHelpful | 1", "ChtulhufJan 10 at 1:53 AM\nIt's not as engaging as I expected\n\nI didn't really feel immersed. The climbing got repetitive quite fast and while it was initially quite fun, but eventually started to feel like a chore.\n\nHelpful | 1", "Blasting_Bj0rnDec 7 at 6:48 PM\nLove It!\n\nI waited for this game on quest ever since I got it and it is amazing!\n\nHelpful | 2", "colezilla74Dec 3 at 7:02 PM\nGreat VR Title\n\nSimple concept turned into a beautiful and challenging experience. Great job.\n\nHelpful | 3", "SunshineNurseDec 6 at 8:15 PM\n\nOh my god this was an awesome game. Totally makes you feel like youre actually doing some work.\n\nHelpful | 1", "SebinkaDec 3 at 2:01 PM\nGreat with the quest!\n\nMy new favourite game! I recommend this to anyone but it is a bit scary at times\n\nHelpful | 3", "dado001Dec 3 at 11:33 AM\nFinally\n\nI was waiting forever for this game, no longer!!! The one!!\n\nHelpful | 5", "insecuritiesDec 6 at 12:16 PM\nBest Game Ever!\n\nThe graphics look as good at the PCVR version and is just fun in general. This is a must buy.\n\nHelpful | 0", "ParteeWithMeDec 10 at 10:12 PM\nSICKYSICKYGNAR\n\nKiller game, wicked pump, just made it to level 3 straight sendin it\n\nHelpful | 0", "Scarletwolf-77Dec 23 at 7:06 AM\nFun, but mechanics need work\n\nClimbing up the at the end of a run is practically broken. Pushing the hand controls all the way to the ground works about half the time and what should be the simplest part of the climb is where I end up falling the most.\n\nHelpful | 2", "PronzyDec 19 at 6:53 PM\nGreat\n\nAmazing \n\nHelpful | 1", "Jdevlin-Dec 3 at 1:51 PM\nAmazing!\n\nThis is what VR is all about\n\nHelpful | 2", "alekspashkov86Dec 7 at 11:42 AM\n\nIts one of the best games. All my family playing in this game.\n\nHelpful | 2", "effifuksDec 15 at 11:12 AM\nThe best game on the quest so far\n\nHard. Very fun. Great graphics.\n\nHelpful | 1", "Mr_Wig_SplitterDec 3 at 8:23 PM\nThe climb\n\nThis game looks great and plays great . no issues worth the money\n\nHelpful | 3", "nickthompson35Dec 7 at 7:22 AM\nReally fun\n\nOne of the best games on the Oculus Quest at the moment, in my opinion.\n\nHelpful | 1", "AlexPrinzoDec 5 at 9:24 AM\nWhat everyone else said....\n\nYes this game is THAT good. Thought this was going to be pretty simplistic but its actually a really fun game. Great for new comers, and veterans.\n\nHelpful | 0", "chirag1982Dec 15 at 4:17 PM\nAmazing\n\nAwesome game\n\nHelpful | 2", "mathue.volpe.7Dec 25 at 5:46 PM\n\nSolid game but it lags on occasion when mounting the platforms.\n\nHelpful | 0", "JacksongamezMar 13 at 5:50 PM\nAmazing\n\nAwesome experience cant wait until my headset recharges so I can play more\n\nHelpful | 0", "OmegaBeastDec 4 at 5:02 PM\nWow\n\nLooks amazing. Don't look down.\n\nHelpful | 5", "diac2000Dec 4 at 3:17 AM\nl m happy i can Cross buy !\n\nl m happy i can Cross buy !far panorama is blur,but its good game in mobile vr !\n\nHelpful | 1", "darwins.lastDec 3 at 3:56 PM\nLooks Incredible\n\nMaybe more devs should use Cryengine... impressive stuff.\n\nHelpful | 3", "guozhongyanDec 17 at 10:07 PM\nGreat experience\n\nI like it!\n\nHelpful | 0", "whiffenDec 12 at 10:15 PM\nAmazing game\n\nOne of the best oculus quest game!\n\nHelpful | 0", "treill2Dec 8 at 9:07 AM\nIt is a good game but\n\nThe idea of the game will s good but it just is so bugey and it ruined the game when your in the middle you f a climb and the game puts you to the main menu with no saving out any thing just to start from the beginning\n\nHelpful | 2", "drpug77Dec 4 at 7:52 PM\nIf it's free it's fine for me\n\nI got it full price on the rift and now free on quest\n\nHelpful | 2", "EllynnDec 6 at 11:45 AM\nGiant Hands\n\nIf you can't get the hands adjusted at first, you will be able to do so after the training. Excellent game.\n\nHelpful | 2", "leif_blondellDec 3 at 11:16 AM\nAmazing game!!!\n\nI havent played this before and now I have. Now I know what all the fuzz was about. Incredible to play this untethered. Good work Crytek.\n\nHelpful | 5", "Estevan-SemoDec 3 at 10:14 AM\nwooooooow\n\nthanks oculus for this great game realy woooooow\n\nHelpful | 7", "larsonmattrDec 6 at 6:16 PM\nGreat performance\n\nReally enjoying the climb. It runs beautiful on the Quest\n\nHelpful | 0", "vrgamer228Dec 15 at 8:38 AM\nAmazing graphics\n\nBruh\n\nHelpful | 1", "bikervet101stDec 4 at 11:32 AM\n\nBest game Ive played in a while !!!!\n\nHelpful | 2", "925aonraDec 5 at 4:31 PM\nToo expensive for what you get\n\nThe graphics are just too much of a compromise to pay this much. I'm also not a fan of games with locked areas. How would they like it if I pay 1/3 now and then unlock the rest when I reach those levels? I pay full price, I want the whole thing!!!\n\nHelpful | 8", "Sir_VivalDec 4 at 4:13 PM\nIt is okay\n\nIt's a nice game. But nothing more. For what it offers I find 30 Euro too expensive. The user interface is absolutely creepy. You confirm in the ui via the back button. Not with the trigger as usual. This is not explained to you. You have to try it out. If you want to change the language to German you have to restart the whole game. WTF.\n\nHelpful | 3", "Builderexpert07Dec 3 at 10:55 AM\nAmazing!\n\nAmazing!\n\nHelpful | 5", "jimmysoculus123Dec 5 at 3:16 PM\nAwesome.\n\nGraphics look just like the rift!\n\nHelpful | 1", "ItsKerriganDec 8 at 6:33 PM\n\nVery fun and realistic\n\nHelpful | 0", "0mzyDec 5 at 8:22 PM\nVery good, but be cautious people!\n\nAlthough the views are good and all, i would not buy this game if you are scared of heights.\n\nHelpful | 1", "ultraraiDec 10 at 11:58 AM\nThree Words\n\nJust buy it.\n\nHelpful | 0", "Milk-_Dec 11 at 2:37 PM\nVery good.\n\nI like\n\nHelpful | 0", "adam.farnsworth.58Dec 5 at 12:14 PM\nAwesome\n\nGreat game on the oculus!\n\nHelpful | 0", "torstenvrDec 8 at 4:43 AM\nCrossbuy....very nice move\n\nNuff said\n\nHelpful | 1", "Reptilioansage9Dec 3 at 3:20 PM\nNice\n\nI was sweating in 10 minutes\n\nHelpful | 2", "barzattacksDec 12 at 9:41 AM\nTired of really dying while climbing?\n\nWell now you do not have to die. You can enjoy a decent arm/shoulder workout while you Zen your mind. This game is very calming and visually decent. This is for the type of person that enjoys \"the climb\" and not rushing to the top. There are a few ways to climb the mountain before they let you move on to the next one so prepare to hit the same mountain a few times before unlocking anything else.\n\nHelpful | 2", "spidey_kidApr 26 at 5:13 PM\ngood\n\nits a good game but refund.\n\nHelpful | 0", "wavymamal8069Dec 13 at 10:00 AM\nGood however...\n\nCan be tedious unlocking other levels\n\nHelpful | 0", "jay.uppalDec 4 at 7:43 AM\nCant play this game\n\nJust doesnt open. Keep getting the update warning saying keep connected to WiFi and charge. Game has been installed and connected for about 3 hours now and still same message.\n\nHelpful | 8", "headbore4Jan 3 at 7:50 PM\nThe Hardest Game Ive ever played\n\nHarder than ghostn goblins.Harder than cup head.Some ledges are near impossible to reach and the worst of all the characters run out of stamina in about 5 seconds.\n\nHelpful | 3", "GorrilaburritoDec 4 at 7:24 AM\n\nAmazing\n\nHelpful | 1", "AtrussDec 15 at 12:39 PM\nNice, very nice porting, but booiring\n\nI really find the game boring and it is the first game after several years that gave me motion sickness. I hope pc version is better at least in immersion thanks to better graphics.\n\nHelpful | 1", "nathan.thiele.420Dec 24 at 8:03 AM\n\nIs the first level really that hard to beat? Been stuck on the first map the whole time Ive had the game. Starting to really get annoying. Good game but cmon\n\nHelpful | 0", "tristan116Dec 5 at 2:46 PM\nIssues with advanced levels\n\nGame looks and plays great until you try to do the advanced tutorial don't know if it's a glitch or bad design but clearing away dirt from grip holds just does not work like it should hand animation plays but nothing happens tried everything I could think of incase was doing it wrong but wasent doing anything different when it did decide to work if a patch fixes this I would give the game nothing but praise but with that issue games unplayable after a certain point\n\nHelpful | 9", "NDKruegerDec 5 at 4:58 PM\nFun game but a few things\n\nI was very excited for the launch of this. The graphics are not as good as I expected their are a few bugs and the vanilla game really is kinda repetitive.\n\nHelpful | 7", "AlecZ2Dec 29 at 10:43 AM\nHELP\n\nIdk whats happening. This is not a review on the game, its on downloading it. My personal hotspot and phone are connected to the VR but it wont let me download the game. It says its downloading on my phone but when I go In VR it hasnt started and if I go in VR and click download it tells me that I can still browse around while its downloading although it hasnt started yet. HELP!!!!\n\nHelpful | 7", "VrenchieDec 30 at 6:00 PM\nCan't change the language\n\nI put 4 stars when we can.\n\nHelpful | 0", "DJH82Feb 1 at 7:17 AM\nApplication wont start.\n\nThis game literally will not run. I have installed and uninstalled several times now and Im just so beyond frustrated.\n\nHelpful | 2", "88KKDec 3 at 10:35 PM\nmotion sickness\n\nthe game is cool, it feels like you are actually climbing, but it creates motion sickness, which would make this game unplayable for me.\n\nHelpful | 7", "fortniteboii22Dec 6 at 12:50 PM\nGraphics\n\nThe graphics are really bad plz make them better I know the quest can do better take red matter as an example\n\nHelpful | 1", "SinOfGreed_Jan 1 at 10:08 AM\n\nIts ok\n\nHelpful | 1", "DeeplightenedDec 14 at 1:05 AM\nThank you so much Crytek !\n\nThank you for the development for Quest, and thank you for the cross-buy ! It is one of the best game i've played on rift and i'm so excited to play it without wires now :) !\n\nHelpful | 1"]