{"App Title": "The Under Presents", "App description": "Welcome to The Under: a time and mind bending immersive theater experience!\n**Now with free demo: over 30 minutes of single player mysteries to discover**\n\nFor a limited time [to end of September], get a ticket to TEMPEST, a theatrical adventure led by live professional actors! Perform magic with our actor Prospero, and together create this timeless tale of love and revenge. Daily showtimes through September! Tickets ($14.99 USD) available at the in-app box office. \n\nFor single-player fun, try out TIMEBOAT! Board a research vessel lost in the Arctic ice, doomed to shipwreck. Follow the crew and an unusual dolphin, unlock hidden mysteries, and manipulate time to alter their fates! Available as in-app purchase ($11.99 USD). \n\nTEMPEST or TIMEBOAT tickets also unlock access to THE UNDER, our otherworldly multiplayer hub! Have chance encounters and perform magic rituals with other players and performers to unlock and discover the secrets buried beneath the sands.", "Purchase section": "FreeAdd to WishlistShareOffers In-App PurchasesComfort: ModerateSupports QuestSupports Oculus TouchInternet connection required", "Game Modes": "Multiplayer, Single User", "Supported Player Modes": "Sitting, Standing, Roomscale", "Supported Controllers": "Oculus Touch", "Supported Platforms": "Quest", "Category": "Games", "Genres": "Adventure, Exploration, Narrative", "Languages": "English", "Version": "1.436", "Developer": "Tender Claws", "Publisher": "Tender Claws", "Website": "https://tenderclaws.com/", "Release Date": "November 19, 2019", "Developer Privacy Policy": "TENDER CLAWS PRIVACY POLICY\n\nLast Updated:April 25th, 2018\n\nTender Claws, LLC (\"we\" or \"us\") makes interactive products for personal entertainment. Collectively, we describe our products and servicesincluding our websites, content, and software productsas our \"Services.\" This Privacy Policy explains how we treat information from or about our users, including how we collect, use, and share information in connection with our Services.\n\nBy visiting or using our Services, you consent to the practices described in this Privacy Policy. If you have questions about this Privacy Policy, please contact us at info@tenderclaws.com\n\nPlease be advised that your use of our Services may also be subject to additional privacy policies created by the software platform (the Software Platform) that you use to access our Services, which could include, without limitation, any of the following policies:\n\nThe Oculus Privacy Policy: https://www.oculus.com/legal/privacy-policy/\n\nThe Steam Privacy Policy Agreement: http://store.steampowered.com/privacy_agreement/\n\nThe Google Privacy Policy: https://www.google.com/policies/privacy/\n\nThe Samsung Privacy Policy: http://www.samsung.com/us/common/privacy.html\n\nNOTICE: If you are curious about our privacy policy with respect to our project Tendar, please click here.\n\nI. What kind of information is collected?\n\nDepending on which Services you use, we collect different kinds of information from or about you, such as:\n\nInformation You Give Us. We collect the information you give us when using our Services. For example:\n\nWhen you start using our Services, we may gather information that you provide to the applicable Software Platform in accordance with that Software Platforms privacy policies.\nIf you buy something on or through our Services, we will connect you directly to our payment gateway.While we dont have access to the information you provide for that transaction, we might serve as a conduit of that information through our Software Products and servers.\nWhen you communicate with us, you may provide us with information that you voluntarily provide, like your email address.\n\nInformation Automatically Collected About You When You Use Our Services. We also collect information automatically when you use our Services. Depending on how you access and use our Services, we may collect information such as:\n\nInformation about your interactions with our Services, like the duration of a session;\nInformation about how you access our Services, including information about the type of device you're using (such as a headset, PC, or mobile device), your browser or operating system, your Internet Protocol (\"IP\") address, and certain device identifiers that may be unique to your device;\nInformation about content or other apps installed on your device or provided through our Services;\nLocation information, which can be derived from information such as your device's IP addressand device settings;\nInformation about your physical movements and dimensions when you use a virtual reality headset; and\nInformation collected by third-party service providers and Software Platformsabout you through the Services, as described elsewhere in this Privacy Policy.\n\nInformation from other sources. We may also receive additional information about you from third parties, including partners that provide us information that is publicly or commercially available, and may combine that information with the other information we collect about you.\n\nII. How do we use information?\n\nWe use the information to do a number of things that help us provide our Services to you and our partners. Here are some examples:\n\nTo provide our Services. We use the information we collect to provide you with the Services you use or request. For example, we use this information to:\n\nProvide you with content, games, apps, and other experiences;\nCreate accounts and user profiles;\nCommunicate with you about our Services, including updates and new Services;\nEnable user-to-user communications;\nProvide technical support;\nNotify you about updates to our Services;\nCustomize your experiences based on your online activities, including the content, games, apps, and other experiences you interact with; the other online services you use; and other information we collect; and\nImprove and develop your experience.\n\nWe also use the information we collect to understand and improve our Services and to develop content for virtual reality, augmented reality, and mixed reality. For example, we may use the information to:\n\nSolicit and analyze input and feedback about our Services;\nIdentify and address technical issues on our Services; and\nConduct and learn from research about the ways in which people use our Services.\n\nTo promote safety and security. We use the information we collect to help promote safety and security, such as by investigating suspicious activity or violations of our terms or policies and protecting our or others' rights or property.\n\nIII. Who can get information about me?\n\nOur Services help you engage with the content in virtual reality, augmented reality, and mixed reality and others that interact with that content. To provide and support our Services, information we have about you may be shared in certain circumstances. Here is who can see information about you when you and others use our Services.\n\nPublic Information. Certain information you post to our servers or in a profile hosted by the applicable Software Platform, such as your username and avatar, will be public and visible to people on and potentially off our Services.\n\nService providers. We may share the information we collect with vendors, service providers, researchers and other partners (including the applicable Software Platform), who work in partnership with us to support the Services (such as hosting our Services, analyzing the way people use our Services, providing customer service, or sending electronic communications for us).\n\nOther parties in connection with certain business transactions. In the event that the ownership of Tender Claws, LLC (or any portion of our assets) changes as a result of a merger, acquisition, or in the event of a bankruptcy, information from or about you or your device may be transferred to another company.\n\nConsent. We may share information about you for any other purpose for which you give us your consent.\n\nWe may also share de-identified or aggregate data with others for any purpose. De-identified data means information where we have removed your name or contact information. Aggregate data is data that has been combined with other data so that it doesn't identify any specific person.\n\nResponding to legal requests and preventing harm. We may access, preserve and share information in response to a legal request (like a search warrant, court order or subpoena) if we have a good faith belief that the law requires us to do so. This may include responding to legal requests from jurisdictions outside of the United States where we have a good faith belief that the response is required by law in that jurisdiction, affects users in that jurisdiction, and is consistent with internationally recognized standards. We may also access, preserve and share information when we have a good faith belief it is necessary to: detect, prevent and address fraud or other illegal activity; to protect us, our Services, you and others, including as part of investigations; or to prevent death or imminent bodily harm. Information we receive about you, including financial transaction data related to purchases made on or through our Services, may be accessed, processed and retained for an extended period of time when it is the subject of a legal request or obligation, governmental investigation, or investigations concerning possible violations of our terms or policies, or otherwise to prevent harm. We also may retain information from accounts disabled for violations of our terms for at least a year to prevent repeat abuse or other violations of our terms.\n\nThird Parties that Provide Content, Marketing, or Functionality on Our Services. Some of the content, marketing, and functionality on our Services may be provided by third parties that are not affiliated with us. For example, we work with companies that help us understand how people use our Services.\n\nOther companies may collect information on or through our Services to market to you on or off of our Services. These and other third parties may collect information about your use of our Services, including through the use of cookies, device IDs, local storage, pixels and other technologies, and this information may be collected over time and combined with information collected on different websites and online services.\n\nIV. Security\n\nPlease note that no data transmission or storage can be guaranteed to be 100% secure. As a result, while we strive to protect the information we maintain, we cannot guarantee or warrant the security of any information you disclose or transmit to our Services and cannot be responsible for the theft, destruction, or inadvertent disclosure of information.\n\nV. International Users\n\nWe are based in the United States, and, regardless of where you use our Services or otherwise provide information to us, the information may be transferred to and maintained on servers located in the U.S. or other countries. Note that the laws, regulations and standards of the country in which this information is stored may be different from your own country. By using our Services, you consent to this collection, transfer, storage, and processing of information to and in the U.S. and other countries.\n\nVI. Changes to this Privacy Policy\n\nIf we make changes to this Privacy Policy, we will provide notice of such changes as appropriate, such as by sending you an email notification to the address you've provided, providing notice through the Services, and/or updating the \"Last Updated\" date at the top of these Terms.\n\nVII. Contacting Us; Data Access and Deletion\n\nIf you have any questions about this Privacy Policy, or if you would like to deactivate or delete your account or access data associated with it, please contact us at info@tenderclaws.com. Content deleted from the Services may remain in backup copies and logs for a period of time.", "Developer Terms of Service": "END USER LICENSE AGREEMENT\n\nLast Updated: April 25th, 2018\n\nBy installing, copying, or otherwise using a software product (a Software Product) developed by Tender Claws, LLC (Developer, we, or us), you are accepting the terms of this End User License Agreement (this EULA or these Terms) in connection with that Software Product. We are delighted to provide you access to the Software Product you downloaded for your personal use. Before installing a Software Product, please make sure that your computer meets the minimum technical specifications for the proper operation of the Software Product.\n\nYour use of a Software Product is also subject to the applicable terms of use and privacy policies for the platform or store where you downloaded the Software Product (the Software Platform), which could include, without limitation, any of the followingagreements:\n\nThe Oculus Terms of Service: https://www.oculus.com/legal/terms-of-service/;\n\nThe Steam Subscriber Agreement: http://store.steampowered.com/subscriber_agreement/;\n\nThe Google Terms of Service: https://www.google.com/intl/en/policies/terms/; and\n\nThe Samsung VR Terms of Service: https://samsungvr.com/portal/content/tos.\n\nThis EULA does not modify the applicable terms and conditions of using the Software Platform.\n\nBY ACCEPTING THIS EULA, YOU UNDERSTAND THAT THIS IS A LEGALLY BINDING INSTRUMENT AND AGREE TO BE BOUND BY THE TERMS AND CONDITIONS HEREIN. PLEASE READ THIS EULA IN ITS ENTIRETY.\n\nTHIS EULA CONTAINS IMPORTANT TERMS AND CONDITIONS THAT AFFECT YOU AND YOUR USE OF THE SOFTWARE PRODUCT, INCLUDING, UNLESS YOU CHOOSE TO OPT OUT, A PROVISION REGARDING BINDING ARBITRATION OF DISPUTES (OTHER THAN CERTAIN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) AND A WAIVER OF CERTAIN RIGHTS TO JURY TRIALS AND/OR CLASS ACTIONS.\n\nYOU CERTIFY THAT YOU ARE OF THE LEGAL AGE OF MAJORITY IN THE JURISDICTION IN WHICH YOU RESIDE OR, IF YOU ARE BETWEEN THE AGES OF 13AND THE LEGAL AGE OF MAJORITY, THAT YOU ARE USING THE SOFTWARE PRODUCT WITH THE SUPERVISION OF YOUR PARENT OR LEGAL GUARDIAN WHO AGREES TO BE BOUND BY THIS EULA. MAKE SURE TO REVIEW THIS EULA WITH YOUR PARENT OR GUARDIAN SO THAT YOU BOTH UNDERSTAND ALL OF YOUR RIGHTS AND OBLIGATIONS.\n\nWe reserve the right to change or modify this EULA on a going-forward basis at any time and in our sole discretion. If we make changes to this EULA, we will provide notice of such changes as appropriate, such as by sending an email notification to the address youve provided, providing notice through the Software Product and/or updating the \"Last Updated\" date at the top of these Terms. Your continued use of the Software Product will confirm your acceptance of the revised EULA. If you do not agree to the revised EULA, you must stop using the Software Product. We encourage you to review this EULA from time to time to ensure you understand the terms and conditions that apply to your access to, and use of, the Software Product.\n\nThis agreement was written in English (US). To the extent any translated version of this agreement conflicts with the English version, the English version controls.\n\n1. Your Use of the Software Product\n\n1.1Software Product License. We hereby grant you a limited, non-exclusive, non-sublicensable license to access, install, and use the Software Product solely for personal and noncommercial purposes, conditioned on your compliance with these Terms. You will not use, copy, adapt, modify, decompile, reverse engineer, disassemble, decrypt, attempt to derive the source code of, prepare derivative works based upon, distribute, license, sell, rent, transfer, publicly display, publicly perform, transmit, stream, broadcast or otherwise exploit the Software, except as expressly permitted by Developer or as permitted under applicable law. Any unauthorized use of the Software Product is strictly prohibited and will terminate the license granted in these Terms. No licenses or rights are granted to you by implication or otherwise, except for the licenses and rights expressly granted to you.\n\n1.2Third-Party Content. Your use of services, applications, or content provided by third parties made available through the Software Product (Third Party Content) may be subject to additional end user agreements. Developer has no responsibility or liability with respect to your access to or use of the Third Party Content, or any content or functionality contained in such Third Party Content, your rights to which are solely provided pursuant to a license between you and the provider of such Third Party Content. In no event shall Developer or the applicable Software Platform be considered the licensor of the Third Party Content, to have granted any rights to use the Third Party Content, to have assumed any obligations with respect to the Third Party Content, or to have made any representations or warranties with respect to the Third Party Content.\n\nIf you are not presented with an end user license agreement when you acquire access to Third Party Content, the following license terms apply to your use of such Third Party Content: (a) the third party providing the Third Party Content (and not Developer or the Software Platform) is the licensor of such Third Party Content; (b) such party grants you a limited, nontransferable license to access and use the Third Party Content only for your personal and noncommercial purposes; and (c) you may not modify, reproduce, decompile or disassemble the Third Party Content in whole or in part, or create any derivative works from or sublicense any rights in or to the Third Party Content, unless otherwise expressly authorized by the third party or as permitted under applicable law.\n\n1.3Trial Access to Software Product. We may offer free trials or other limited versions of the Software Product so you can preview the Software Product before you purchase the full version. These versions may have limited features, restrict permitted time of use and contain other limitations.\n\n1.4Availability of Software Product after Purchase; Updates. The Software Product may rely on services provided by third parties for some or all of its functionality. The Software Product may not function properly or may become inoperable if these third parties discontinue their services.\n\n1.5Support. The Software Platform, and not Developer, will be responsible for all billing questions related to the purchase of the Software Product and for support with respect to the Software Platform. Developer, and the not the Software Platform, will be responsible for all support obligations relating to the Software Product, including but not limited to customer support, bug fixes, live operations support, and general technical support. Neither Developer nor the Software Platform is obligated to provide support for Third Party Content. You acknowledge that we are under no obligation to update or patch a Software Product.\n\n1.6Network Costs. You may be charged by your network provider for data services or any other third party charges as may arise while using the Software Product, and you accept responsibility for such charges. If you are not the bill payer, we will assume that you have received permission from the bill payer.\n\n2. Software Product Purchases\n\n2.1Purchasing Software Product from Software Platform. If the Software Product is a paid product, the license granted to you under this EULA is conditioned upon your valid purchase of the Software Product pursuant to the applicable Software Platform terms and conditions of purchase.\n\n2.2Content Transactions. You may have the ability to purchase digital content through the Software Product. You also may have the ability to purchase additional or enhanced functionality or media content within a Software Product (collectively, In-App Purchases). Any content developed by us that we provide through In-App Purchases is subject to the licenses, terms, and conditions stated in this EULA. Except as described in these Terms, we have no responsibility for any transactions you enter into with a third party for Third Party Content and assume no liability for Third Party Content.\n\n2.3Virtual Items. Your purchase of a virtual item or in-game currency within the Software Product is a payment for a limited, non-assignable license to access and use such content or functionality in the Software Product. Virtual items (including characters and character names) or in-game currency purchased or available to you in the Software Product can only be used in connection with the Software Product where you obtained them or where they were developed by you as a result of game play. These items are not redeemable or subject to refund and cannot be traded outside of the Software Product for money or other items for value. We may modify or discontinue virtual items or in-game currency at any time.\n\n3. Acceptable Use\n\nBy accessing or using the Software Product, you agree that you will not: (a) access or use the Software Product in any manner that could interfere with, disrupt, negatively affect or inhibit anyone from fully enjoying the Software Product, including, but not limited to, defamatory, harassing, threatening, bigoted, hateful, vulgar, obscene, pornographic, or otherwise offensive behavior or content; (b) damage, disable, overburden or impair the functionality of the Software Product in any manner; (c) access or use the Software Product for any illegal or unauthorized purpose or engage in, encourage, or promote any illegal activity, or any activity that violates these Terms, community standards or any other terms or policies provided in connection with the Software Product; (d) use or attempt to use another users account without authorization from such user; (e) modify, adapt, hack or emulate the Software Product; (f) use any robot, spider, crawler, scraper or other automated means or interface not provided or authorized by us to access the Software Product or to extract data; (g) circumvent or attempt to circumvent any filtering, security measures or other features designed to protect the Software Product, or third parties; and (h) infringe upon or violate the rights of Developer, our users, or any third party. Notwithstanding the foregoing, we reserve the right to revoke or reduce your access to any multiplayer functionality in our Software Products at any time, with or without cause.\n\n4. User Content\n\nOur Software Product may include interactive features and areas where you may submit, post, upload, publish, email, send, or otherwise transmit content, including, but not limited to, text, images, photos, videos, sounds, virtual reality environments or features, software and other information and materials (collectively, User Content). Unless otherwise agreed to, we do not claim any ownership rights in or to your User Content. By submitting User Content through the Software Product, you grant Developer a worldwide, irrevocable, perpetual (i.e. lasting forever), non-exclusive, transferable, royalty-free and fully sublicensable (i.e. we can grant this right to others) right to use, copy, display, store, adapt, publicly perform and distribute such User Content in connection with the Software Product. You irrevocably consent to any and all acts or omissions by us or persons authorized by us that may infringe any moral right (or analogous right) in your User Content.\n\nYou are solely responsible for the User Content you make available through the Software Product and you represent and warrant that (a) you either are the sole and exclusive rights owner of all User Content that you provide, or you have obtained all rights, licenses, permissions, consents and releases that are necessary to grant to Developer the rights specified in this section; and (b) the provision of your User Content, and our subsequent use of such User Content, will not infringe, misappropriate or violate any third partys patent, copyright, trademark, trade secret, moral rights or other proprietary or intellectual property rights, or rights of publicity or privacy, or result in the violation of any applicable laws or regulations.\n\nDeveloper does not endorse or guarantee the opinions, views, advice, or recommendations posted or sent by users. Developer has no responsibility or liability for User Content made available through the Software Product, and we have no obligation to screen, edit or monitor such content. However, we do reserve the right, and have absolute discretion, to remove, screen or edit User Content at any time and for any reason.\n\n5. Privacy Policy\n\nOur Privacy Policy, which is available at http://tenderclaws.com/privacy/PrivacyPolicy.htmlis incorporated into these Terms and sets forth how we treat data, including how we collect, use and disclose information.\n\nIn addition, certain third parties (such as the applicable Software Platform, developers of Third Party Content, and the manufacturers of your computer, mobile phone or other devices) may collect information about you when you use the Software Product. These third parties have their own privacy policies and will treat the information they collect about you according to these policies. We encourage you to review these privacy policies before providing any information to third parties. We are not responsible for the accuracy of any third partys privacy policy or for ensuring that third parties comply with their privacy policies.\n\n6. Ownership and Intellectual Property\n\nUnless otherwise indicated, the Software Product is the property of Developer or its licensors and is protected by copyright, trademark and other laws of the United States and foreign countries. You will not remove, alter or obscure any copyright, trademark, service mark, or other proprietary rights notices incorporated in or accompanying the Software Product.\n\nTender Claws and the Tender Claws logo (the \"Developer Marks\") are trademarks or registered trademarks of Tender Claws, LLC. The Developer Marks and those of its affiliates may not be copied, imitated or used, in whole or in part, without prior written permission, including as authorized by any applicable brand guidelines. All other trademarks, service marks, logos, trade names and any other proprietary designations are the trademarks or registered trademarks of their respective owners and may not be used without permission of the applicable trademark holder.\n\n7. Feedback\n\nSeparate and apart from User Content, you may submit questions, comments, suggestions, ideas, plans, notes, drawings, original or creative materials, or other information about Developer and our Software Products (collectively, Feedback). You agree that Developer and its affiliates shall be able to use the Feedback in any way it may choose without any obligation to you.\n\n8. Copyright Complaints\n\nIn accordance with the Digital Millennium Copyright Act (DMCA) and other applicable laws, we have adopted a policy of terminating, in appropriate circumstances and in our sole discretion, accounts of users who are deemed to be repeat infringers. We may also, in our sole discretion, limit access to the Software Product and/or terminate the accounts of any users who infringe any intellectual property rights of others, whether or not there is any repeat infringement.\n\nIf you believe that anything on or available through the Software Product infringes upon any copyright which you own or control, you may file a notification of such infringement with our Designated Agent as set forth below:\n\nPhilip F Weiss PLLC\n\nphil@philweisslaw.com\n\nPlease see 17 U.S.C. 512(c)(3) (available athttp://www.copyright.gov/title17/92chap5.html#512) for the requirements of a proper notification. If you knowingly misrepresent in your notification that the material or activity is infringing, you will be liable for any damages, including costs and attorneys' fees, incurred by us or the alleged infringer as the result of our relying upon such misrepresentation in removing or disabling access to the material or activity claimed to be infringing.\n\n9. Disclaimers\n\n15.1 WE MAY PROVIDE HEALTH AND SAFETY WARNINGS IN CONNECTION WITH A SOFTWARE PRODUCT. YOU REPRESENT AND WARRANT THAT YOU WILL READ ALL HEALTH AND SAFETY WARNINGS AND INSTRUCTIONS WE PROVIDE BEFORE USING THE SOFTWARE PRODUCT.\n\n15.2 YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT YOUR ACCESS TO AND USE OF THE SOFTWARE PRODUCT IS AT YOUR SOLE RISK. AS BETWEEN YOU AND DEVELOPER, TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS AND DEVELOPER EXPRESSLY DISCLAIMS ALL REPRESENTATIONS, WARRANTIES, AND CONDITIONS (EXPRESS OR IMPLIED, ORAL OR WRITTEN), INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. IN ADDITION, DEVELOPER DOES NOT REPRESENT OR WARRANT THAT (A) THE FUNCTIONS CONTAINED IN THE SERVICES WILL BE ACCURATE OR MEET YOUR REQUIREMENTS; (B) THE OPERATION OF THE SERVICES WILL BE SECURE, UNINTERRUPTED, ERROR-FREE OR VIRUS-FREE, OR (C) ANY DEFECTS IN THE SERVICES WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION, GUIDELINES OR ADVICE GIVEN BY DEVELOPER WILL CREATE A WARRANTY. THE FOREGOING DISCLAIMER OF WARRANTIES WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE DISCLAIMER OF IMPLIED WARRANTIES, SO SOME OR ALL OF THE DISCLAIMERS IN THIS SECTION MAY NOT APPLY TO YOU.\n\n10. Indemnification\n\nYou agree to defend, indemnify and hold harmless Developer and our affiliates, independent contractors and service providers, and each of our respective directors, officers, employees and agents (collectively, Developer Parties) from and against all third-party claims, damages, costs, liabilities and expenses (including, but not limited to, reasonable attorneys fees) caused by, arising out of or related to (a) your purchase or use of, or inability to use, the Software Product; (b) your violation of these Terms or any other applicable terms, policies, warnings or instructions provided by Developer, the Software Platform, or a third party in relation to the Software Product, (c) your violation of any applicable law or any rights of any third party; or (d) any User Content or Feedback you provide.\n\n11. Limitation of Liability\n\nTHE DEVELOPER PARTIES SHALL HAVE NO LIABILITY FOR ANY LOST PROFITS OR OTHER CONSEQUENTIAL, SPECIAL, PUNITIVE, INDIRECT, OR INCIDENTAL DAMAGES, ARISING FROM OR RELATED TO YOUR USE OR INABILITY TO USE THE SOFTWARE PRODUCT, EVEN IF A DEVELOPER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL THE AGGREGATE LIABILITY OF THE DEVELOPER PARTIES ARISING OUT OF OR RELATING TO THE USE OF OR INABILITY TO USE THE SOFTWARE PRODUCT EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU PAID US TO USE OUR SOFTWARE PRODUCT. THE FOREGOING DISCLAIMER OF CERTAIN DAMAGES AND LIMITATION OF LIABILITY WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. THE LAWS OF SOME STATES OR JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OR ALL OF THE EXCLUSIONS AND LIMITATIONS SET FORTH ABOVE MAY NOT APPLY TO YOU. NOTWITHSTANDING ANYTHING TO THE CONTRARY IN THESE TERMS, NOTHING IN THESE TERMS EXCLUDES OR LIMITS OUR LIABILITY FOR FRAUD OR FOR DEATH OR PERSONAL INJURY CAUSED BY OUR NEGLIGENCE.\n\n12. Dispute Resolution\n\nPLEASE READ THE FOLLOWING SECTION CAREFULLY BECAUSE IT REQUIRES YOU TO SUBMIT TO BINDING ARBITRATION (JURY TRIAL WAIVER) OF ANY AND ALL DISPUTES (OTHER THAN SPECIFIED INTELLECTUAL PROPERTY CLAIMS AND SMALL CLAIMS) WITH DEVELOPER AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM DEVELOPER (NO CLASS ARBITRATIONS, CLASS ACTIONS OR REPRESENTATIVE ACTIONS OR ARBITRATIONS).\n\n12.1Binding Arbitration; Disputes; Small Claims.You and Developer agree to waive any right to a jury trial, or the right to have any Dispute resolved in any court, and instead accept the use of binding arbitration (which is the referral of a Dispute to one or more impartial persons for a final and binding determination); provided, however, that you have the right to litigate any Dispute in small claims court, if all the requirements of the small claims court, including any limitations on jurisdiction and the amount at issue in the Dispute, are satisfied. You agree to bring a Dispute in small claims court in Los Angeles County, California. Dispute as used in this Section 12means any dispute, cause of action, claim, or controversy arising out of or in any way related to Developer, these Terms, the subject matter of these Terms, or access to and use of the Software Product, including but not limited to contract, personal injury, tort, warranty, statute or regulation, or other legal or equitable basis and disputes that involve third parties (such as developers of Third Party Content), except any dispute, cause of action, claim, or controversy relating to Developers intellectual property (such as trademarks, trade dress, domain names, trade secrets, copyrights, and/or patents). You and Developer empower the arbitrator with the exclusive authority to resolve any dispute relating to the interpretation, applicability or enforceability of these terms or formation of this contract, including the arbitrability of any dispute and any claim that all or any part of these terms are void or voidable.\n\n12.2No Class Arbitrations, Class Actions or Representative Actions.You and Developer agree that any Dispute is personal to you and Developer, and that any Dispute shall only be resolved by an individual arbitration and shall not be brought as a class arbitration, a class action, or any other representative proceeding. Neither party agrees to class arbitration, or an arbitration where a person brings a Dispute as a representative of any other person or persons. Neither you nor Developer agree that a Dispute can be brought as a class or representative action whether inside or outside of arbitration, or on behalf of any other person or persons.\n\n12.3Federal Arbitration Act. You and Developer agree that these Terms affect interstate commerce and that the enforceability of this Section 12shall be governed by, construed, and enforced, both substantively and procedurally, by the Federal Arbitration Act, 9 U.S.C.  1 et seq. (FAA) to the maximum extent permitted by applicable law.\n\n12.4Confidentiality. The arbitrator, Developer, and you shall maintain the confidentiality of any proceedings, including but not limited to, any and all information gathered, prepared, and presented for purposes of the arbitration or related to the Dispute(s) therein. The arbitrator shall have the authority to make appropriate rulings to safeguard that confidentiality, unless the law provides to the contrary.\n\n12.5Process. Our goal is to resolve claims fairly and quickly. Accordingly, for any Dispute that you have against Developer, you agree to first contact Developer and attempt to resolve the claim informally by sending a written notice of your claim (Notice) to Developer. The Notice to Developer must be sent by certified mail addressed to: 4111 W Sunset Blvd #550 Los Angeles, CA 90029. The Notice must (a) include your name, residence address, and the email address and/or mobile telephone number associated with your account; (b) describe the nature and basis of the claim; and (c) set forth the specific relief sought. If you and Developer cannot reach an agreement to resolve the claim within 30 days after such Notice is received, then either party may, as appropriate in accordance with this Section 12, commence an arbitration proceeding or file a claim in court. You and Developer agree that any Dispute must be commenced or filed within one (1) year after such claim arose; otherwise, the Dispute is permanently barred.\n\nIn the event that you and Developer cannot resolve a Dispute and you do not pursue your claims through small claims court, you or Developer shall promptly submit the Dispute to binding arbitration at the office of the American Arbitration Association (AAA). In the event AAA declines or is unable to administer the arbitration, you and Developer agree to use an arbitration forum or arbitrator that you and Developer mutually agree upon. If, after making a reasonable effort, you and Developer are not able to agree upon an arbitration forum or arbitrator, AAA or a court having proper jurisdiction will appoint an arbitration forum or arbitrator. The arbitration will be conducted in accordance with the AAA Consumer Arbitration Rules (AAA Rules) then in effect. The AAA Rules and other information about AAA and arbitration are readily available athttp://www.adr.org, by calling 1-800-778-7879, or by mail at 120 Broadway, Floor 21, New York, NY 10271. By entering into these Terms, you either (1) acknowledge that you have read and understand the AAA Rules or (2) waive reading the AAA Rules and waive any claim that the AAA Rules are unfair in any way. You and Developer agree that these Terms govern the arbitration, and that the applicable AAA Rules shall be subject to changes in procedures that AAA may make from time to time.\n\nAs limited by the FAA, these Terms, and the applicable AAA Rules, the arbitrator will have the exclusive power and jurisdiction to make all procedural and substantive decisions concerning the Dispute; provided, however, that this power does not include the power to conduct a class arbitration or a representative action, which is prohibited by these Terms (as stated above). The arbitrator may only conduct an individual arbitration, and may not consolidate more than one persons claims and may not preside over any form of representative or class proceeding, or any proceeding on behalf of or involving more than one person or persons.\n\nUnless the arbitrator finds the arbitration was frivolous or brought for an improper purpose, you and Developer will equally share in all filing, AAA, and arbitrators fees and expenses.\n\n12.6Right to Opt Out. You may opt out of this agreement to arbitrate. If you do so, neither you nor Developer can require the other to participate in an arbitration proceeding. To opt out, you must notify us in writing within thirty (30) days of the date that you first became subject to this arbitration provision, and must include your name and residence address, and a clear statement that you want to opt out of this arbitration agreement. Any requests to opt out must be sent to: 4111 W Sunset Blvd #550 Los Angeles, CA 90029.\n\nUnless you choose to opt out, this dispute resolution provision in Section 12shall survive termination of these Terms.\n\n13. Governing Law\n\n13.1 Developer is based in the United States and our Software Products are subject to U.S. law. We make no representations or warranties that the Software Product is appropriate or available for use in other locations.\n\n13.2 The laws of the State of California, excluding its conflicts of law rules, govern your access to and use of the Software Product. Your access to and use of the Software Product may also be subject to other local, state, national or international laws.\n\n13.3 To the extent the provisions in Section 12do not apply, you further agree that all disputes, causes of action, claims, or controversies arising under these Terms that cannot be settled through informal negotiation will be resolved exclusively in the state and federal courts located in Los Angeles County, and you agree to submit to the personal jurisdiction of such courts for the purposes of litigating all such claims.\n\n14. Modifications to the Software Product\n\nDeveloper reserves the right to change, suspend, remove, discontinue or disable access to the Software Product or particular portions thereof, at any time and without notice. In no event will Developer be liable for the removal of or disabling of access to any portion or feature of the Software Product.\n\n15. Termination\n\nWe reserve the right to terminate your right to access and use the Software Product if you violate these Terms or any other terms or policies referenced herein, or if you otherwise create risk or possible legal exposure for us.\n\n16. Severability\n\nIf any provision of these Terms shall be deemed unlawful, void or for any reason unenforceable, then that provision shall be deemed severable from these Terms and shall not affect the validity and enforceability of any remaining provisions.\n\n17. Assignment\n\nYou may not assign these Terms or any of the rights granted hereunder without the prior written consent of Developer, and any attempted assignment without such consent shall be void. Subject to the foregoing restriction, these Terms will be fully binding upon, inure to the benefit of, and be enforceable by us and our respective successors and assigns.\n\n18. Nonwaiver\n\nAny failure by Developer to insist upon or enforce performance by you of any of the provisions of these Terms or to exercise any rights or remedies under these Terms or otherwise by law will not be construed as a waiver or relinquishment of any right to assert or rely upon the provision, right or remedy in that or any other instance; rather, the provision, right or remedy will be and remain in full force and effect.", "Space Required": "3.53 GB"}



["5 stars\n81%\n4 stars\n5%\n3 stars\n5%\n2 stars\n3%\n1 star\n7%", "wtfbroJun 9 at 9:41 PM\nThis thing is weird\n\nAnd I like it that way. So weird! Just finally found the list of accomplishments in the mask and realized I haven't even scratched the surface even though I somehow made it into Act II.\n\nNo clue wtf is going on but I am figuring it out. I think. Highly bizarre and enjoyable. More like this please. Worlds within worlds within worlds, etc., and so on, ad infinitim (or whatever the budget allows).\n\nUPDATE: OMG this...exoerience?...is SO RAD.\n\nI just had someone help me to cast spells and to find vast, hidden, comolex worlds! The story aboard the ship barely scratches the surface! There IS SO MUCH MORE!!\n\nI just gave it another star. I WAS BLIND BUT NOW I SEE.\n\nHuzzah, team! Well done.\n\nHelpful | 302", "CookieSquidJul 7 at 7:11 PM\nProof that VR can break the rules\n\nThis is one of the most novel concepts for a game I have seen yet. This is a game which creates a new type of world, seperate from time and space, and yet makes it feel very real. It creates both a video game and an interactive play, with real live actors. Do not 'expect' in this game - merely watch. Even hanging out in the multiplayer hub is spectacular, due to the many hidden secrets, pretty appealing graphics, great performances both live and recorded, as well as one of the healthiest communities I have ever seen. This game deserves so much more attention. And if you're wondering if this is one of those beautiful but short games, don't worry - you will spend over 7 hours on the main story, and a very long time in the multiplayer hub, if you love this game like I, and many others, do.\n\nHelpful | 66", "ANicePieceOfToastJul 9 at 6:03 PM\nWow\n\nI havent even bought timeboat and multiplayer yet which Im about to but my favorite moment in VR just came from this game. Ok so basically I play through the beginning part and he says help is on the way! And theres a new player but they arent responding to my movements and Im just thinking- am I invisible? A few more minutes go by and at this point nobodys responding I see another person trying to get someone else to respond but nothing. Someone eventually waved at me and I wqs like oh finally (it was because I waved earlier) nobody was helping me with the puzzle. Finally I get to this one room and I look and then it resets me, and then it hits me- these are not players, theyre me? And I was in SHOCK I was so surprised it was amazing I knew it couldnt have been AI It was too lifelike. It was me!\n\nHelpful | 41", "Presidentwolf200715 days ago\nGreatest game Ive ever played!\n\nI played the game A LOT around when I got it, which was near when this game released, got it December 2019 and I could not stop playing it! The style of graphics was amazing and I even got to see some live actors, which I didnt know if they were real people or not! The community is so friendly, some guy helped me get the onion mask and told me to help spread it on to others and tell them about it, I was able to help a lot of people out and Im pretty sure I got one person to tell about me in their review! I know how to get every mask in the game, even though its hard to remember it all, and I give masks to anyone who asks. And now, I started playing the game again because one of my friends had recently gotten it when I realized about the tempest. Let me tell you, IT IS WORTH THE MONEY! Even though I didnt play a big role in it, I still really enjoyed how cool and beautiful it was, get tickets while you still can and dont worry about not being able to get the tempest mask, anyone who participates in the show gets one, and you can switch between the tempest and your regular mask! The only bad thing I dont like about the game is trying to get into your friends servers, its difficult to do, and takes a while to get into the same one, but other than that, I give this game a 10/10, the community is great, and the live actors are still around, so see them while you can. This is possibly the greatest game Ive ever played in VR, so give it a try!\n\nEdit: So the new update adds more you can do, even though they only added hats! It adds more roleplay potential and gives others a chance to show off what they know to others! I just had it happen to me right now. Spreading spells you know to others is one of the biggest reasons I play this game, to spread spells to others and see how others react to each other! Again, I highly recommend you try this game.\n\nHelpful | 4", "MonkeySkunk4 days ago\nBEST EXPERIENCE EVER!!!!\n\nThis is an amazing game and worth every penny spent. The way you can interact with almost anything around you, meet live actors, watch a story of a boat that goes off course and you need to solve the mystery of the aickman, and travel around the huge open map is amazing and perfect for VR. I love checking the game to find wonky live actors like giant crabs, tiny drunk skeletons, Trash kitty and Vicky the cat, Tumbleweed farmer with dont push the button and a king of wet food. Its now like my dream to be an actor in this game, I imagine it being so fun!!! I love this game and am excited for Tender Claws and Pie Hole to throw us a new story or update for the Under Presents. This game has SO much potential and I absolutely love it!\n\n-\n\nI honestly wish there was a way to become an actor or just try the experience. Like I wouldnt even wanna act for money, just to make people happy and show the magic to other people of what VR and The Under can do.\n\nHelpful | 4", "achra6 hours ago\nThe Tempest is amazing!\n\nI have attended the Tempest 5 times, so far. Every time was different and I learned something new about the Tempest each time. This is one of the very best experiences in VR right now. This is really something special. The experience with the live paid actors has been fantastic. Be careful not to book back to back tickets ahead of time, sometimes the sessions run long and there are multiple instances.\n\nHelpful | 0", "TruShadoeJul 12 at 2:17 AM\nWhat the actual cuck\n\nThis game is really weird yet it doesnt overdose on it so much while sacrificing a story. The way masks work is unique and (as the kids say) epic.\n\nThe Under multiplayer experience is full of secrets and you can use magic so thats pretty (as the kids say) lit\n\nThe time boat single player experience is almost a completely different world to the under. The only links being the mask and a character(kind of)\n\nIt would be more convenient if there was a way to open a inventory that shows different masks that you can get while also allowing for the player to switch between them at will\n\nHelpful | 6", "bleepinboopA day ago\nYestest of good\n\nBestest of the bestest, better then better, omega good lol\n\nThis is a good game with a cool open world and a nice social community and a really cool cast of people anyway its just super super omeger good and a cool thing is that not everybody needs to buy timeboat\n\nHelpful | 0", "jokerface206 days ago\nThe tempest is well worth the money!\n\nI just did the 12pm tempest it just finished and the tour guide lady was absolutely fantastic!!! I enjoyed every second. And recommended anyone to definitely go see it before it ends. It is so fun and the maps and detail are awesome! Thankyou for making an awesome story production!\n\nHelpful | 1", "Jorge_ClooneyJul 10 at 4:44 PM\nNothing else like it\n\nThis game has blown my mind. Everything about it is brilliant. Ill never forget the first time I came across one of the live actors, I didnt know it was a real person, I was like wow this programming is impressive the way they interact and respond to people I was so impressed I tweeted Tender Claws to let them know, and they informed me that it was indeed one of their live actors! I also loved the special Variety Hours they recently had and now The Tempest! This is one of my most treasured apps on my Quests. Bravo to everyone involved.\n\nHelpful | 5\nDeveloper ResponseJul 10 at 4:59 PM\n\naww! Thank you!", "zlandaelMay 29 at 3:15 PM\nAn unexpected encounter almost everyday!\n\nI've played a LOT of this for a while and here's the thing: You WILL have no idea what's going on. Yes you can do the singleplayer campaign, which contains acts that you can play multiple times in order to understand the full story and see where each character travels around the setting, but the multiplayer is what makes this worth purchasing. Think of the game Journey, but in Disneyland.\n\nI get pretty nervous talking to people in multiplayer, so luckily there is NO voice chat...until you discover these \"characters\" who don't look or act like you. They sing, they dance, and suddenly, people around you are throwing roses at them. Then you may ask yourself, \"where do they get those from?\". Suddenly you're whisked away on an adventure through the desert, or viewing an interactive live show at the stage.\n\nSo many questions, yet the only answer is to play and figure it out yourself. If you favor exploration, puzzle-solving, and expecting the unexpected, you'll definitely love this game.\n\nHelpful | 30", "Mega-OrbJul 11 at 7:27 AM\nWhat is happening?\n\nSo this is only the third full experience I have played on the quest and I don't really just know what just happened to me!\n\nAfter playing through the interesting opening to the game which introduces you to the 'mechanic', I found myself in the seemingly empty venue. I thought I saw another version of myself but was soon whisked off to the ship, and found myself enjoying the experience of listening in to the crews conversations, motivations secrets etc.\n\nI actually left the boat by mistake and boy am I glad I did, as I soon found myself part of a intimate gig/lecture by a very interesting tiny skeleton. He talked to us very passionately about the concept of time and how our behaviour has ripples through time, all this alongside some great musical numbers and jokes galore. He was even gracious enough to accept our gifts!\n\nHe mentioned something about having to clean up the place on his way out, so I hope to see the little skeleton again.\n\nWhat an experience, buy it now!\n\nHelpful | 4", "LesterFreamon11 days ago\nBrilliant innovative ideas!\n\nLet me preface by saying I have not seen The Tempest. I personally cannot pay the $15 to see the show, but if I had a lot of money, arts and theatre in VR is something I would support. Might I suggest to the developers a work for your ticket option. Affiliate/referral points that could be used for free entries. Social media posts that bring in new viewers could be rewarded. Volunteer ushers; users inworld present to help new arrivals, could earn free tickets too.\n\nThe cost of $15 feels high, but in actuality, you are paying live actors to perform and a production team to run the shows. Lowering the cost of the show would diminish the value of the show, but itd be great if there were a few for the community shows where tickets are raffled out.\n\nIm looking forward to various future free content and lower cost content; I can tell The Under Presents is going to have a lot of unique content that includes the cheapskates\n\nHelpful | 0", "FlukeAUSJul 17 at 8:38 PM\nWeird & wonderful\n\nI was sort of underwhelmed when I first tried it because I just didn't understand what was happening, but when you meet other players and you take each other on journeys and find secrets you had no idea about, it blows your mind! Add to that live actors and The Tempest (absolutely worth the money, so unique!) and this game is extremely easy to recommend!\n\nHelpful | 3", "ChemicallyBlueGreenJul 17 at 8:14 PM\nGood Almost great.\n\nPros,\nCool Atmosphere.\nMusic is awesome.\nTrippy effects.\nGreat Single player.\n\nCons.\n14 dollar multiplayer, and its only 45 mins.\n\nListen, i didnt hate the ticket thing but please label what each shows are. I suspect theyre each different. If im wrong im sorry.\nMy issue was, my show seemed un focused and kinda light. One live person was there, and to be honest i expected 2 or more. Not the games fault. But\nId very much like it if more ticket booths are added in a similar vain to the boat game. Id love to see another gift shop. Maybe a scifi or horror themed one? Id love to be able to walk in a Noir themed area. Overall its good but it feels like we need to wait for Dlc before its perfect\n\nHelpful | 4", "ummwhatsureJul 11 at 5:17 PM\nNothing like it\n\nTender claws is always incredible and I've loved every second of the under presents. Having said that, The Tempest is one of the most unique experiences I've ever had. Please everyone do yourself a favor and buy a ticket to this show while they last. My show I was in was hosted by Deirdre who did a phenomenal job, was a joy to hang out with and made an experience like none other.\n\nWhat you guys are doing is nothing short of magic.\n\nHelpful | 4", "tomflemons20 days ago\nThe Tempest an excellent VR experience\n\nReading the reviews I get the impression some people were disappointed because they were expecting a game. The Tempest is not a game, it its an experimental theatre experience that you buy a ticket for just as you would in a normal theatre. You will be in a small group led by a real actor and go through a very cut down version of Shakespeare's Tempest. For me the experience was one of the most original and interesting experiences I have had in VR. The problems of putting something like this on in real time are enormous, and sadly I have heard some shows have been spoiled by disruptive behaviour from those who could not understand what it was all about. Unless you like theatre or the experimental arts then don't waste your money but if you do you will find it amazing. If you are in doubt I recommend this review https://youtu.be/fSQD8DBLODE\nThanks to all involved for the work you put into this and am looking forward to your next production.\n\nHelpful | 1", "kieran75320 days ago\nBuy it now\n\nLive actors are only through September, so get the game now to experience something incredible! (Live actors appear from 5 - 7 in California, 8 - 10 on the east coast.)\n\nOh yeah timeboat and the under themselves are pretty cool too.\n\nPeople also say good things about Tempest, but I havent seen it.\n\nAlso devs: will live actors return after September (like will there just be a break in live actors appearing [probably for a few months] or is this it?)\n\nHelpful | 1", "SFMikeJul 16 at 6:01 PM\nReally Enjoyed \"The Tempest\" Production\n\nI have been enjoying The Under for awhile and thought I would give \"The Tempest\" production a try and found it an amazing good time in VR. Interacting with a talented live perfomer makes for an exciting and enjoyable event. Definitely worth the price of admission. Keep the unusual unique content coming.!\n\nHelpful | 2", "CacatuidaeJul 7 at 12:16 PM\nThe best vr game Ive ever played\n\nI got my quest a month or so ago using my stimulus check. I had seen virtual virtual reality play throughs and loved the story. When I was shopping for games I might buy, I saw this one. Im not a fan of third person games and saw a review saying it was third person, and almost didnt buy it. Im so glad I did. I will split my review into four parts: The Intro, The Time Boat, The Under, and The Actors.\n\nThe Intro had me enthralled from the start. I wasnt sure if I should trust this strange being or if he was malicious. It was about 30 minutes long for me, but if you struggle with the puzzles more than I do it may take longer. If I understand correctly, this section of the game (which is replayable at anytime) is considered a demo and is now free, sans the rest of the game. As someone who was new to VR and did little research beyond reading reviews, it was stunning.\n\nThe Time Boat was the original show of the game. Youre on a boat and have control of time, and your goal is to experience every scene and interaction, then eventually save all the people on the boat. This took me 8+ hours and I still havent unlocked all the scenes, just saved all the characters. You can only interact directly with one character, but you save the others by following them to where they die and solving puzzles that help process their lives and deaths.\n\nThe Under is perhaps the most magical part of the game. Its the lobby and the only multiplayer area (not counting Tempest, which as of yet I have not attended). Up to 8 players can be in one instance at a time. No one can speak and there are no real goals (unless an actor is one, but thats for the next part). Everyone wears masks and can perform magic, but there is little in the way of tutorials for said magic. Players have to discover the majority of spells for themselves unless taught by another player. You can create everything from golden salt shakers to giant Keytars (the golden salt shaker is the symbol of the discord, which I strongly recommend you join) and it somehow makes the lack of objective activities in the lobby a moot point. Theres little in the way of toxic players and everyone feels like friends.\n\nThe actors are what keep you coming back. Tender Claws hired real actors, who go onto the Under in Vr themselves to entertain and interact with the players. They have their own drama, their own stories. You can attend a wedding between an actor and a player, say goodbye to a skeleton as she leaves forever, or listen to a giant crab tell you a story. Her mother will meditate with you and give out healthy snacks. Attend a birthday party on the main stage, go on a game show, or attend a rave. The actors are the only people in the Under who can speak, and they make the multiplayer part of the game. Theyll remember you and bring up old jokes, further the lore of the game, and make new players feel welcome.\n\n\nIf youre on the fence, at least try it. TUP is a fantastic game, unlike any other. And for so cheap, the hundreds of hours You can put into this game are worth every penny.\n\nHelpful | 3", "Kennylex25 days ago\nAmazing\n\nI am a first time VR user and found this whatever it is as a demo, suddenly transported to a strange world, intrigued, confused and amused I bought what I thought should be a game, The Time Boat.\nIt was a story, several stories, where I was just a spectator. Then after failing the first time I was sent back to a place with other players, communicating with snapping, gestures and magic. Went back to the story and saw that I had misunderstood it, I could change the story.\nI'm still a bit confused, I love this.\n\nHelpful | 1", "kiwisoupJul 13 at 1:35 PM\n\nWow...that's all I can say about this \"game\". It's so hard to even describe what this game even is and before playing it didn't really sound like a game and I was already confused and I regret putting playing it off for so long when I could have been playing it this whole time. Thankfully the new timed demo was enough of a taste for me to pull the trigger and buy it. If one good thing came out of the situation everyone is going through right now is that we now have until September to enjoy the live actors featured in the game...otherwise I would have completely missed the experience altogether which would have been sad for me!\n\nHelpful | 2", "BEBOP001Jul 12 at 2:07 PM\nAbsolutely genius! Loving this!\n\nAbsolutely loving this game/adventure/experience. I love to wander the surreal open world landscape and interact with other players.\n\nYou also bump into real live actors playing the part of wonderfully strange characters, who play games with you and give you gifts and secrets.\n\nI cant wait to see any updates to this game, I think this could go far.\n\nHelpful | 2", "liottaJul 11 at 4:17 PM\nThe Tempest is brilliant.\n\nThe live actors are what makes this game so unique. The introduction of the tempest and live scheduled shows is exactly what Ive been waiting for and it has not disappointed. A very special mention to G one of the actors who was involved with two of the shows Ive experienced already, shes been phenomenal, and a part of what makes this experience so incredible. Do yourself a favor and buy a ticket, take advantage of this absolutely amazing experience. I will be purchasing more shows in the future without question!!!\n\nHelpful | 2", "felixableJul 27 at 9:58 PM\nMust Try For An Innovative Theatre Exp.\n\nThe Tempest is one of the best examples of what a brand new experience for watching stage drama would look like.\n\nYou are interacting with a LIVE actor who walked your through a story you would never experience in a traditional stage drama provides.\n\nWords won't explain in, go experience it.\n\nHelpful | 1", "Helmy366Jul 10 at 6:57 AM\nAmazing! More?\n\nHaving VVR as my favourite virtual reality game I had high expectations for The Under Presents, and I am glad to say that those expectations were met! I enjoyed it so much in fact that I was trying to search around for more to do but as I think I am a bit late to live actors thing I was unable to find it. I did find immense enjoyment out of watching the performances that would show up on stage and the MC ( I think his name is, a he one that guides you around and hosts the whole show) seems to be a very likeable character. I also think that the Time Boat is a very creative and fun idea.\nMy only negative is that I do not really understand if there is an aim to this game and what it might be, but if there is not one then I suppose that adds to the experience, I guess I am just used to games with endings, I dont know.\nOther than that it was great and a possible contender for my favourite Virtual Reality game, we will have to see!\nThank you very much Tender Claws for this fun and creative experience. For anyone interested in this game or looking for a new game to play, I highly recommend this game, maybe for Christmas that is coming or just GET IT NOW! And to Tender Claws, if you make another game similar to this and VVR, with a confusing and somewhat eerie atmosphere then I would definitely play it! Please?!\nThanks again:)\n\nHelpful | 2", "blobvis0802Jul 11 at 4:06 PM\nIn my top 2 of official oculus games\n\nWel its amazing that you can only comunicate with hand guestures but i would like a setting where you can enable your mic and if you enable it you join a new server with people that turned on that setting so you would not have people that just stay quiet in a lobby with people talking but this game is my #1 this game is a gem in the oculus store and the live performances are great its amazing how this is possible and keep up the good work\n\nHelpful | 2", "HockshankJul 22 at 7:18 PM\nI am fresh from a session of The Tempest\n\nAnd I am psyched. I feel like this is the kind of experience that is nearly impossible to describe to someone who hasn't tried VR. Absolutely unique and cool. There were 4 of us \"masks\" and The Actor and everyone was onboard to play along. Great group whoever you were! There was drama, dancing, magic, peeing in the bushes and a wedding. Well worth the price of admission. Thank you The Under for coming up with this whack idea and making it happen. Encore!\n\nHelpful | 1", "fondu3Jul 10 at 7:56 AM\nMagical, whimsical, such a treat\n\nI'm new to the VR experiance. I'm a visual artist and absolutely love this game. It's so magical and mysterious. It won't hit you over the head with explanations or narrative so the story to some extent is yours to make. It's a triumph in VR mechanics, story telling and the sheer bliss of exploration and wonder. Hats off to the team and all the actors. Bravo keep it up and I'll be back for more Tender Claws productions. What a joy.\n\nHelpful | 2", "kaynewestJul 20 at 12:08 PM\nSo amazing\n\nI am a 33 year old male. I am shy in nature. But the actor got me out of me shell and i was so into it. She was amazing with how she gets you to interact and work with other people. The worlds were amazing. I had a blast. Worth the money. I highly suggest this to anyone thinking about doing this. Im not sure how many actors are part of this but the lady i got was amazing. :).\n\nHelpful | 1", "ChiliMangoJul 30 at 12:48 PM\nUnique. Breakout. Puzzling. Deep.\n\nWelcome to The Under. What is The Under? The fun is in figuring that out so of course I can't say. This is certainly the most innovative VR game/experience/world I've come across and the creators should be very proud of what they've made. Kudos.\n\nHelpful | 1", "HighShroomJul 19 at 8:30 AM\nThe best kind of weird\n\nThis game is so much fun! I'm still relatively new to the game, but I've already purchased Timeboat and I just saw a showing of The Tempest the other night. Learning how to communicate without voice chat and hanging out in the hub world watching the acts on stage is a fun, casual, and joyful experience that I would recommend to anyone who enjoys theater!\n\nHelpful | 1", "EmpressbJul 30 at 10:41 AM\n\nso far I am loving this game. This is incredible. The storyline is great. However I can't figure out how to get to the end. It seems to be all over the place. . Right now I'm only giving it four stars. And when I completed I will come back either upgrade or downgrade my review\n\nHelpful | 1", "lily125May 24 at 12:25 PM\none of the best games i have ever played\n\nthis game is truly amazing. in it, it takes the player through all different sorts of adventures and puzzles that they call time boat where you have to save all of the characters in order to win the game and unlock the fully lit mask. all of the stories are amazing and well put together, and personally, the chefs one is my favorite. if you finish the story and get he mask, you can always hang out in the lobby... at least thats what i think i should call it. the lobby is the under itself, and theres many discoveries to be had there, too. you can discover secret things about the world, how to get different masks, you can meet other players, you can also meet live actors, who are these characters who look different from other people. usually they are able to talk, but some characters choose not to, like wiel. (i think thats how you spell his name) each character is different and unique, and mostly they will pop up when theres groups of at least 4 people. they like to get everybody in on the experience. they take you on all sorts of adventures around the world, sometimes to perform, sometimes to get you a mask, or just tell a story, either way, its always really fun, and pretty much everybody who has ever played this game has met a live actor before. i met one on my second day. also, if im ever bored or just need to relax, i come here. the design of this game really is beautiful, and it always makes me want to come back. this truly is one of the best games i have ever played, and i highly reccomend it to people who like magic, puzzles, and just having a good time. the developers have truly showed in this game what vr is capable of, and thats what makes it such a great game.\n\nHelpful | 11", "Baked_Beans.69Jul 14 at 7:23 PM\nAmazing\n\nI dont often write reviews but I felt I needed to share my opinion. The show was absolutely amazing. The actor brings the audience together in a way that makes a sense of community. By the end of it we were hugging each other goodbye. The story doesnt make a lot of sense if you have not heard it before but that does not matter. It is so fun and interactive that what you can make of the story is enough. Definitely worth $15. Would highly recommend\n\nHelpful | 1", "SocksInABucketJul 15 at 7:48 PM\nExtremely fun\n\nI love this game so much just chilling in the under. There's so much to do and something's always happening on stage and all that. Definitely worth 12 dollars to play timeboat and the under. Just I'm general incredibly fun. While not so much ways to communicate with people it's still fun.\n\nHelpful | 0", "EdmCaperJul 12 at 3:19 PM\nUnique in every sense of the word\n\nI was waiting to do this review because I really wanted to review the new Tempest show. I was delightfully shocked in kind of a bitter sweet moment that while trying to purchase tickets for the show, it was sold out today, tomorrow and the next day . So ya that was a bummer but makes me happy to see that it's gaining popularity and people are purchasing their tickets sometimes days in advance . Makes me want to watch it more . However, since I could not commit to a date to purchase advance tickets, instead I tried my luck out on timeboat. I'm still not exactly sure what I'm doing in this story after well over an hour of play. I see I have goals and a checklist but definitely struggle to get anything crossed off of it , expect for witnessing a few convos between characters . Part of the beauty is how clueless I really am in trying to figure this out. It's making me constantly rewind time and try to figure out exactly what's happening.. which is adding a lot of gameplay . (Sure I guess there could be an option that if you're stuck for a long time then to offer assistance, but I typically always turn off hints in every game because a lot of the fun and frustrations come from trying to solve these things out). As a side note.. I'm definitely not a fan of snap rotation and wish smooth turning could be turned on. Maybe someday tho. For now, I simple turn in real life to counter having to use snap rotation.\nDownloading this for free just to play the opening scenario is worth the time for anybody. It will sell you or not on whether you wish to purchase new content. Prices inside the app are also in US dollars . I'm not sure if it specifically says so while purchasing, but I was somewhat surprised when I purchased timeboat for $11.99 , only to see it cost $17.00 in real life in my bank account (I'm in Canada). Whereas Oculus store defaults all of my other purchases in Canadian dollars.\nYou literally have nothing to lose by downloading for free and getting a taste of the game. Great job I think by the development team.\nI definitely look forward to live action theater to continue on this app.\n\nHelpful | 1", "Max.LeyoNeJul 11 at 12:20 PM\nThe Tempest\n\nWow, that was truly breathtaking. I just watched the show, and it was well worth the money. Experiencing the play in such an amazing and interactive way was truly innovative, can't wait to see more shows in the future! Buying a ticket also gives you access to multiplayer, and a nice bonus. Highly recommend\n\nHelpful | 1", "OonaLeFaeJul 14 at 3:21 PM\nVery unique and creative!\n\nSo far, I love this. If you're not the type that likes exploration and and need constant guidance, this might not be the game for you. I love all the little discoveries and interesting concepts. The live actors are a big draw for me so I'm not sure I'll like it as much when that goes away in September. It would be awesome if that could continue, even if there was some sort of subscription fee. I'd pay it. :)\n\nHelpful | 1", "OlRoodyJul 5 at 10:02 AM\nA mind bending game\n\nI really love this game for many reasons. And I have said \"wow\" more in this game than any other games in my library combined. Its just such a unique experience compared to the other games and I only wished I got it sooner. I still have yet to run into the actors, but I have run into other players a lot. Its fun to try to communicate with them with just your hands and head hehe. My only wish would be that they add more experiences and things to find throughout the map, or other campaigns to do besides the time boat. Its just so fun and the time travel in this game is super sick.\n\nIf you enjoy time travel, definitely pick this one up\n\nHelpful | 1", "Jragan646Jul 9 at 4:00 PM\nFeel taken\n\nI don't usually write reviews one way or another but I felt this recent change in pricing structure needed to be addressed for all of the people that had purchased this game previously. It now appears that purchasing Time Boat for $12 gives you access to the entire game and the people that paid $20 get no additional content? Unless I'm missing something in the fine print, this just seems like bad business.\n\nHelpful | 11\nDeveloper ResponseJul 9 at 4:54 PM\n\nHi, thanks for playing the Under! The game has been out almost a year and we felt like it was at a good time to lower the price and get some new players into the experience for the benefit of multiplayer as a whole. Many of our players who purchased the app in the past have enjoyed months of live actor encounters and shows, which will be ending in September.", "JoePancakesMar 30 at 2:10 PM\nMade VR worth it.\n\nAfter a few months and a few games, I started to get pretty bored of VR. It was a fun novelty but nothing of real replay value after you see it. This game totally changed that. This game doesn't rely on gimmicks to \"seem\" VR, it utilizes brand new mechanics in fun and creative ways. Scrunching, time loops, spells, they all just suck you in and keep you coming back. The story is a wonderful new take on puzzle game genres, especially for VR, combining the 1st person and 3rd person \"god mode\" into a seamless unit. And the live actors are amazing! I went in blind, and when I was approached by a talking cat, it blew my mind. If you only buy one VR game, this needs to be the one.\n\nHelpful | 81", "f1shb0wlJul 10 at 7:09 PM\nGreat game\n\nWhen I played it for the first time I was a little scared of what was going to happen but it turned out to be fun to explore but I'm a little bummed out that you half to pay for the rest of the game. P. S. If you like virtual virtual reality and mind show you are going to enjoy this.\n\nHelpful | 1\nDeveloper ResponseJul 10 at 8:38 PM\n\nThanks for playing! The Under Presents offers a free demo, as mentioned in Oculus store text with info on different shows available. Purchasing \"Timeboat\" after free demo helps or buying a ticket to \"Tempest\" helps support our cast and will also give you access to the multiplayer hub world with secrets to explore, recorded acts, magic spells and other possible actor encounters.", "lawlesslassMay 11 at 1:49 PM\nSo this game is weird\n\nI started this game because it has good reviews that suggested you can be social without actually having to be social. I have a tough time launching in to vr social apps where people can just start talking to you especially if their crowd base is on the younger side. The mother in me lives this game because you absolutely can interact with the community but you cant use your voice.\n\nIm still not sure what the object of the game part of the game is....or even if there is an object or if there is any game beyond the 3 chapters and epilogue that I know about and have played some of.\n\nWhat I am sure of is its crazy weird when an npc can sometimes be an actual actor who can speak and involve people in their skits and activities.\n\nThe one thing I would recommend....and actually I wish oculus I general would do this so every game doesnt have to....make it possible to have more than one profile or save slot. As it stands, you can reset the game to the start but this doesnt solve the fact that Id rather my daughter stay the hell off my ship \n\nHelpful | 11", "CloudTurtle27Jun 16 at 10:35 PM\nFavorite VR experience EVER!\n\nAfter playing this game over the weekend I can say without a doubt this is my favorite VR experience EVER. The graphics are gorgeous, content is unique, immersive movement controls and there is a multitude of things to do in this breath taking open world.Just the other day I came across a live actor who hosted a game show for us, learned some new magic tricks from other players and discovered a hidden beach by eating a poisonous tomato. I haven't even touched the main story yet because I keep getting sidetracked with other things. At the current price this game is an amazing value with high replay value and a one of a kind experience that has blown my mind. Kudos to the team who made this game possible.\n\nHelpful | 2", "InterleapJul 25 at 12:20 PM\nTempest and The Under are incredible\n\nI have so far experienced the Tempest show twice. There is so much to explore in the under post show that after 4 hours I have barely scratched the surface.\n\nHelpful | 0", "DtcvJohnKimbleApr 27 at 7:44 AM\nNo other game like this\n\nIn all of my years of gaming I have never experienced something like this. This game urges you only to explore and go at your own pace. The community is quick to help you learn spells, discover new locations and unlock \"easter eggs\". I recommend this game to anyone that enjoys a lightly structured yet incredibly deep experience. I found myself getting absorbed so quickly into this game, spending hours learning about the Under and it's lore... and feel I've only grazed the surface. The experience will net you 8-10 hours but could last much longer. Highly recommended.\n\nHelpful | 15", "buffaloquickJul 20 at 11:59 PM\nBeautiful, bizarre, heartwarming\n\nThis game is so cool. Tender Claws knows what VR is all about. The games within games, performances, next level meta blasting concepts. Just buy it. The future is now.\n\nHelpful | 1", "demianstine123Jul 9 at 11:22 PM\nInteresting\n\nSneaky money stuff.\nI don't mind paying for what I get, but I do seriously mind for it to say free and mean trial or sample. The game might have gotten five stars for me had they played straight. And the in-game movie theater at 14 bucks a ticket and you have to watch at the right time or lose your viewing, I think not, I think never, never.\n\nHelpful | 4\nDeveloper ResponseJul 10 at 10:52 AM\n\nWe know that this is a unique model for games! The Under Presents is a larger game world with a free intro and multiple hours of content, this demo is explicitly explained on our store page. Buying a ticket to the Tempest will give you access to the multiplayer hub world and potential further actor encounters. Tempest itself is a completely optional DLC option within The Under app. Think of Tempest like buying a ticket to a live show, theater event or movie, except you are able to actively participate and shape the experience. Tickets represent a parallel experience to IRL immersive theater while helping to support our cast and reflect the value of a sustained performance led by a professional immersive actor. Tickets for Immersive theater shows for small audiences have high value in the real world, sometimes hundreds of dollars. We realize this may be uncommon for virtual audiences, as such we have worked to make this experience more accessible for wider remote attendance.", "LunarranJun 22 at 1:52 AM\nHaven't even played the main story yet\n\n...and Im in love! Nothing makes sense but that's perfect. Learning and using non verbal communication with the community in the lobby is insane! Keep finding new things to see and do and learning from other players. Once again thats not even the actual game! This game seems like it has so much more than $20 worth! Get it. You won't be dissapointed.\n\nHelpful | 1", "sister_angelinaJul 20 at 12:38 AM\nAmazing at first but then disappointing\n\nI loved when I first opened the game. The style, the movement method and the fact that it just sent you right in there. BUT... Then it asks you to pay for the accrual game in game. It got me all hyped for the rest of the story but then smacked me in the face. I was so sad, thinking that the whole game was free.\n\nHelpful | 2", "LerkscoreJul 10 at 8:28 PM\nAn incredible unique experience!\n\nI just got done playing the Tempest for the first time and i loved it! It was unlike anything i ever experienced in virtual reality before and i highly recommend buying a ticket and trying it out!\n\nHelpful | 1", "leoncooke08Jul 13 at 2:13 AM\nI really wish I could play this\n\nI got VR for my kids. I cant play it. It makes me sick. But I started playing this game and I love it. The whole concept is amazing! I got sick half way through. And for the first time Im gutted I cant play the vr\n\nHelpful | 1\nDeveloper ResponseJul 13 at 1:38 PM\n\nThanks so much for checking out the Under! There are options you can toggle in-game that will help reduce motion sickness - \"Enable Teleport\" and \"Disable Strafe\" which can be accessed by pressing the left hand menu button while in the Under. These options will change the way your character moves to a way that is more friendly to players sensitive to motion sickness. Sitting down while playing can also help lessen motion sickness!", "Smokey9000Jul 25 at 3:01 PM\nThis was awesome!\n\nI wasnt sure what to expect in the show but the live actor combined with worlds you can only create in VR made for a really fun experience. Highly recommended!\n\nHelpful | 0", "DoctorPhoenixJul 19 at 4:00 PM\nEarly adopters\n\nI was so excited for this I have followed immersive theatre for a long time and was blown away that pie hole was involved in this...the experience was good the live theatre was great but to make it free now and not at least offer tickets to tempest for those who bought it right when it came out seems a bit disrespectful....\n\nHelpful | 2\nDeveloper ResponseJul 20 at 10:36 AM\n\nThanks for playing and for supporting us! We know this is a unique model for games, but like any irl theater we are only able to continue providing experiences like Tempest. Thanks to player support, we were able to extend our live actors over half a year longer than initially intended, and creating Tempest is another way for us to support our cast in a time where most live theaters are closed!", "hopeartzJul 11 at 9:23 AM\nPaywall garbage\n\n(Responding to the dev: no where on the store does it say this is a demo. Label it as such. There is nothing free, besides the little intro, to this game. It's a demo. Label it.) Dont bother unless you want to spend money every time you jump in. Really bad attempt at a paywall game.\n\nHelpful | 6\nDeveloper ResponseJul 11 at 9:17 AM\n\nWe know that this is a unique model for games! The Under Presents is a larger game world with a free intro and multiple hours of content, this demo is explicitly explained on our store page. Buying a ticket to the Tempest, our live show, will give you permanent access to the multiplayer hub world and potential further actor encounters. Tempest itself is a completely optional DLC option within The Under app. Think of Tempest like buying a ticket to a live show, theater event or movie, except you are able to actively participate and shape the experience. Tickets represent a parallel experience to IRL immersive theater while helping to support our cast and reflect the value of a sustained performance led by a professional immersive actor. Tickets for Immersive theater shows for small audiences have high value in the real world, sometimes hundreds of dollars. If you would prefer to not experience Tempest, we have a multi-hour singleplayer experience called \"Timeboat\" also available. This is a single purchase and also gives permanent access to the multiplayer hub world.", "AidenaiterVRMay 22 at 1:10 PM\nWhat in the World Is this\n\nWhen you begin this game you will start confused and end confused. This game is head spinning. The entire time your trying to figure things out and win the game except its hard to tell if this a game let alone one you can win. Though I will say this game is worth the money. I cant explain it. The world and the way this game presents itself is like no other. This game evolves not just VR but also story telling.\n\nHelpful | 3", "ommmmmnMay 15 at 1:32 PM\nMy favorite VR experience so far\n\nI mostly play multiplayer, but of all the experiences that I have had in VR, except for certain multiplayer moments, this is a clear favorite. I love Virtual virtual reality, Accounting+, Moss, Kingspray, Shadow Point, Superhot. The Under Presents is better than all of them and more innovative. I HOPE this is the future of VR. I would buy a new experience in the same style in a heartbeat. And I am poor af.\n\nHelpful | 4", "P4tr0ll3rJun 17 at 12:45 PM\nTHE PERFECT GAME\n\nEverything about this game makes me giddy, from the magic to the performances its amazing. While its confusing when you first start, it becomes one of the best games on the quest once you start playing!!\n\nHelpful | 2", "SergiopesqueraJul 24 at 8:29 AM\nAmazing but...\n\nWhen does the live actors will appear on the multiplayer hub, I was trying to see if there any indication of the live actors appearing, like a clock or specific time that you must appear, please explain.\n\nUpdate: I checked the clock on the hub and displays real time instead of when the live actors will appear.\n\nHelpful | 0\nDeveloper ResponseJul 24 at 10:03 AM\n\nThanks for playing! We have our live actors roam the multiplayer hub all throughout the day. They may hang out by the bar, find players exploring the desert, or perhaps perform on the stage. Keep your eyes peeled! And be sure to be nice to any skeletons you see...", "edshigakiMay 8 at 6:09 AM\nAmazing!\n\nThe live actors and the shows! OMG! I've never seen anything like that! It's AMAZING!!! Really, the world HAVE to discover this game! And the players community is not toxic, everyone is kind and wants to help you with the side quests! It's really powerful and funny the way we communicate with each other thought mimic, snaps and magic!\n\nDevelopers, PLEASE keep the actors! The show must go on!!!\n\nHelpful | 5", "Devil8404DocJul 29 at 10:49 PM\nVery Dissatisfied\n\nI was extremely excited when I read the reviews on Tempest. Even buying my tickets and wearing the mask during the initial part of the game felt magical. But, wow, what a disappointment when I finally got to experience the play or show. Images were choppy, the story teller had the most annoying voice, I think others along with myself were completely lost in what we were supposed to be doing or witnessing.\n\nI want to say that maybe buying tickets on a Monday night for the 9pm show was maybe not a good idea. Perhaps the weekend shows are better, but then again, if Im paying $15 as much as the weekend shows are worth shouldnt I get the same quality in a weekday experience?\n\nIm extremely annoyed because I expected to much more according to the reviews. I hope Im the only one feeling this way and may other people continent to have enjoyable experiences.\n\nHelpful | 1", "isaacandalexJun 18 at 11:57 AM\nDelightfully Weird\n\nA game that encourages cooperation and fosters creative ways to have fun. It is always a treat when the actors show up to orchestrate some comedic interactions.\n\nHelpful | 2", "SUPERHOT.exe.gamerJul 17 at 7:57 PM\nA great experience\n\nThis is really fun to play and the virtual play/show thing was also really fun to do!\n\nHelpful | 1", "fresh_sombreroMay 31 at 9:28 AM\nUnique mix\n\nAt first I expected something like Virtual Virtual Reality, and there really are some subtle references and similiraties to it.\n\nBut in many ways Tender Claws break a lot of usual mechanics in this game, and create new interesting ones. The result is really fun to explore.\n\nMusic, game objects, actors - everything just pulls you into this world.\nMultiplayer introduction is very subtle, it's not out of place and I think that omission of voice chat was a correct decision. I've had several amazing interactions with other people, where I learned from them and teached them.\n\nI hope that Tender Claws will continue to update the game with new content!\n\nHelpful | 1", "Fletcher2020Jul 8 at 1:13 PM\nDon't get it\n\nSo confused. I feel I'm quite clever and if I've missed somthing please let me know and IL amend my review.\n\nIt's slow, the controls are werid. The analog stick moves you too slow, the other way of moving strea he's the screen and zaps you to far forward.\n\nDon't get why you wait around for ages doing nothing and no idea what the point in the game is.\n\nHelpful | 3\nDeveloper ResponseJul 9 at 11:08 AM\n\nHey! We have a few different movement styles to suit player preference. I would suggest trying teleportation if you dislike the default! You can switch to this by pressing the menu button on your left controller (the three horizontal lines at the bottom) and, using your hand, pressing the option to switch to teleportation. The game is narrative with lots to explore, puzzles and magic to uncover, and other players and actors to engage with. Just open the door to \"The Under\" to start your journey!", "WamblyGoblinJul 12 at 11:07 AM\nIm just confused\n\nControls are clunky, although I like how the teleport looks, its still just not fun. In the hour I spent playing this I was sent back to the same spots over and over like the whole game was on a timer and I kept messing up. I like to think Im pretty open minded and decent at figuring games out, but this game has zero hand holding and not in the good way. The whole purpose of the first hour or so of gameplay is to advertise the shows you have to pay for, thats fine in most circumstances but its so explicitly just to advertise that nothing makes sense at all so its almost pushing you to buy the show in order to even comprehend half of whats happening. Ive enjoyed just about every game Ive played on oculus thus far, but this is the one game I absolutely disliked. I gave three stars because although I hated it, it was well polished and looked nice, and that takes a lot of work and I respect that.\n\nHelpful | 0\nDeveloper ResponseJul 12 at 11:21 AM\n\nHey, thanks for playing! Those rooms are a puzzle, and you may have to use your past selves to help make things happen! Which is why you get sent back to where you started. If you still are stuck shoot an email to info@tenderclaws.com, we'll help you out! This introductory sequence is the demo for the game and offers a taste of the singleplayer mode, as described on our oculus store page. For movement, you can use the joystick for strafing if you dislike the teleport and \"scrunch\" pulling movement styles.", "JoshuaAnimationsJul 16 at 8:01 PM\nThoughts on their The Tempest\n\nIts a great game but Im giving it a 1 because I want the developers to see this. I got a ticket for The Tempest and was really exited for it. Today I just got to experience it. It was very cool, but I believe it definitely needs some major improvements. First of all very cool host, and some very cool visuals. In the end of the play, spoilers, when Ferdinand and Miranda got married it was at a place that the game already had while the other places were all brand new, so I think it would have been better if that was also a brand new place meant for the play as well. Another problem with it was that the story was told too short. We didnt get to experience the whole thing, it was like some parts of the beginning and then married in the end. If I hadnt read the book already Id be very confused. We only got one scene with the bad guys which was a little weird to me, and just two scenes with Ferdinand and Miranda, it just didnt feel complete. I think for later shows you just got to tell the whole story, you dont have to do the whole script of the original because that could take pretty long, but just a complete story. And I think maybe have a whole crew of actors to do it and the people who attend the shows can just do some things to help around. I know this is just the beginning of doing these VR plays and it was cool, I can definitely see this getting better and better over the years, good job with it and I hope to see improvements for the next play.\n\nHelpful | 1\nDeveloper ResponseJul 19 at 11:34 AM\n\nHey! Thanks so much for going through Tempest! We really appreciate hearing your thoughts about the experience and what you felt landed/didn't. In putting on this production we focused a lot on making it more accessible to a gaming audience which led to some interesting decisions in what to include/exclude and actually have players do. It was a big first step. Thank you for supporting us!", "scrawlonJul 13 at 4:24 AM\nI must be missing something...\n\nThe game appears to be empty, except for a box office to buy tickets to Tempest. I see the app is free now, but I paid $20 for it in June. I just finally got around to trying it... What did I pay for?\n\nUPDATE:\nThanks for responding. Following your tip, I was able to get started in \"The Under\", and it's really interesting so far. I appreciate the help. I'll be sure to leave a full review once I've played through.\n\nHelpful | 0\nDeveloper ResponseJul 12 at 11:17 AM\n\nThanks for playing! Tempest is a new, totally optional, purchase for a ticketed show (like a theater show or movie that you can participate in) with one of our live actors. Since you bought the game, you still own all of the content that you originally paid for, including the multiplayer hub world and the \"Timeboat\" singleplayer. For new players, those are available to purchase. If you'd like to explore the singleplayer and multiplayer, head over to \"The Under\" building after grabbing your mask in the opening screen! After playing through the game's introduction you can enter the singleplayer and multiplayer spaces.", "WabznasmMay 22 at 7:24 PM\nAmazing game AND live theater\n\nThis unique game is a blast. It is unlike any other game out there so be open to a completely new kind of gameplay experience. There are also times when live actors appear in the game and will interact with your character, which is a most excellent addition to the world of The Under. Get this game.\n\nHelpful | 1", "Son-of-a-GunJul 7 at 6:11 PM\nI already paid for this\n\nI paid for this game and played it for hours. Now when I try to play I have to buy a ticket? Seriously? I wish I could get my money back but it's been too long\n\nEdit: I couldn't figure out how to play at all without paying for a ticket. Nothing else was available. What am I doing wrong? I'll change the rating if I can still play like I used to. Thanks\n\nHelpful | 1\nDeveloper ResponseJul 9 at 11:09 AM\n\nHello, reach out to tempest@tenderclaws.com with your oculus username and we can help get you sorted. thanks. Tempest is an entirely new ticketed experience within the app. Think of it similar to an intimate theater show, you're paying for the actor's time. The single player and multiplayer game you purchased is still yours and available for to you to play within the app!", "andy587Feb 23 at 10:56 AM\nLeading the way\n\nThere are a lot of games for the quest now (thankfully). Some fall into fairly standard categories but are still excellent games.\n\nThis falls into a whole new realm, and in my view the developers are defining what vr can be. Huge congratulations; theres a lot of thought that has gone into this and it shows. Just dont expect instant gratification or to understand what is going on the for first hour or so...patience will be rewarded\n\nHelpful | 50", "dcx28Jul 23 at 9:38 AM\nWtf?\n\nI paid to see the live performance and after being transported to the lobby spent over an hour trying to find the show, which I never did. :( Would love to left a go review but sadly paid to watch nothing\n\nHelpful | 0\nDeveloper ResponseJul 23 at 10:18 AM\n\nHey! Thanks for letting us know about your issue. If youd like, email us at tempest@tenderclaws.com with your oculus username and we will help fix things!", "DJacob1300May 26 at 9:44 PM\n\nOriginally, this review was supposed to warn about a glitch that I found. I later found out that it was just a mechanic that I was unaware of. In certain parts of the story, whatever you do will be copied into a clone. That clone does whatever you did before it was copied. The way it works in the intro, is you have a clone turn the video player thing, while you go to the middle of the room. Again, my review on the game itself is either similar, or simultaneous to other 5 star reviews.\n\nHelpful | 0", "TwerpsterJul 15 at 8:23 PM\nShould Say DEMO\n\nDescription was a little misleading, at least to me. Thought you could play one show & buy additional. You can only play 30 minutes then have to pay. That is exactly what a DEMO game is!\n\nHelpful | 2\nDeveloper ResponseJul 16 at 10:10 AM\n\nHi! The Under Presents offers a free ~45 minute demo to give users a taste of the game. This demo is explicitly explained in our Oculus description with additional info on different prices and content available. Purchasing \"Timeboat\" after the free demo or buying a ticket to the \"Tempest\" live show helps support our cast and will also give you access to the multiplayer hub world with secrets to explore, recorded acts, magic spells and our NPCs played by live actors!", "timmah75Apr 30 at 9:34 PM\nWhat can Vr be?\n\nIve been following vr since the mid 2000s, and TUP was the first experience to truly blow my mind. As other reviewers have said, it expanded my idea of what vr could be.\n\nIm just sad I solved the time ship. I hope Tender Claws gets supported to add another bottle sometime, and generally keep building out the world.\n\nDont read more reviews: Its better to go in and just find out for yourself.\n\nHelpful | 2", "xSICAPxMay 13 at 5:49 AM\nPerfect\n\nSo far, the perfect game I found in the quest, definitely worth the money.\nI think that maybe you could add a mission log in the main world or different unlockable mask colours/materials and maybe some accessories (hats, shirts ect.)\nI'm probably asking for too much by now, but I will be happy if only 1 gets added to this amazing game.\nThis game is my favourite on the quest so far and has an amazing tutorial, too!\nGet this game, you will NOT be disappointed.\n\nHelpful | 1", "andrewsouthworth5 days ago\nTempest\n\nJust did the Tempest show and WOW, awesome experience. The actor did a fantastic job at keeping the pace and making sure everyone was engaged. Her jokes and and between-story comments were timely and the personalization throughout the show constantly reminds you that this is a performance.\n\nThe way that they involve you in the show is the perfect balance between having you do something, and not feeling any kind of pressure. Everyone is anonymous and there is no speaking - you can move around, gesture and snap your fingers. Not gonna lie its a bit silly at times, but if you embrace it you'll have a great experience.\n\nHelpful | 0", "devongiffordJul 13 at 3:55 PM\nPoop\n\nNot dodo\n\nHelpful | 1", "SolonariFeb 27 at 10:10 AM\nSnap it up\n\nWith no chat and no voice, it is surprising how you start listening for those snaps that tell you someone needs help or wants to teach you something. It starts out confusing and frustrating for a few minutes and then you start running into other players and people who really make the game fun. The entertainment factor is awesome. I was pulled up on stage and stuck in blackness until the hostess laughed and said over here! ... I wished someone a happy birthday by gesticulating meaningfully with my hands, and the hostess ad-libbed a hilarious speech for me. Gave her a beer and she stopped in mid-speech to thank me. Its wonderfully abstract and fantastical, yet has that personal touch. Time flies by in this game and I find myself laughing out loud and goofing around with the other people. Not sure if Im playing the game or simply part of it at this point.\n\nHelpful | 31", "TheLemming19Apr 17 at 7:14 PM\nRidiculesly cool\n\nIt is unbelievable how good this game is. Theres the main attraction of the time boat, and once you uncover all those secrets, theres way more in the under. Dont even get me started on how cool the live acters are because HOLY CRAP! This is the only game you need to own on the quest to be infactuated and entertained the whole time.\n\nHelpful | 3", "Fulaingt12 days ago\nAwesome, but...\n\nI loved the demo, was a bit miffed when I got to the end of the demo unexpectedly where it asked me to setup my payment details. I closed it, and set up the payment method, but don't want to restart the whole thing to get there again, how do I purchase it outside of the game?\n\nBut this is the sort of thing I've been looking for. twisted, demented, surreal.. and relatively intuitive! Wish there were more things like this for VR. So.... where's the purchase button??\n\nHelpful | 0\nDeveloper Response6 days ago\n\nHello! Your progress is saved after completing the demo, so you'll be able to walk to the purchase screen shortly after starting up the game. Just proceed through the starting area and you will be able to access the purchase options!", "Mrduck219 days ago\nHorible\n\nWhy do u have to pay at the end\n\nHelpful | 0\nDeveloper Response6 days ago\n\nHello! Your purchase goes toward supporting our live actors, server upkeep for multiplayer, and many other important aspects of the Under's development. If you enjoyed the free demo, you'll enjoy the full version as well!", "MrDonnieXMar 26 at 10:40 PM\nWeirdest Game I've ever played!\n\nThere's sort of a story to it, but after you finish the story .... ish... there's so much to explore. I'm still finding new areas that pops up even though it looks limited to the desert area, and other players can teach you new things like snaps and mask spell combinations. There's no tutorials, you just figure things out as you go. Like real life. The stage shows are entertaining but weird. I don't know if I love it or hate it but I'll keep going because it's a weird new experience for me. Let's go!\n\nHelpful | 6", "Mattattack242Jun 8 at 3:30 AM\nNot Worth your Time\n\nThe game starts off with an interesting tutorial, but after that the game just becomes bland. The idea of a vr movie where you can travel where you wish is interesting. However, that idea is ruined since the movie itself is basically a bunch of people running around a ship until they all die. There could be some hidden levels or secrets to this game that I havent found, but the story isnt interesting enough for me to look for them. Im sure there are a few people that enjoy the basic storyline, but overall, I dont find it interesting, since there seems to be no point to anything in this game. Since the basic gameplay is interesting, but overall, the game is bland, Im giving this game 2/5 stars.\n\nHelpful | 2", "fathomableApr 23 at 7:08 PM\nAchievement\n\nMuch more impressed with titles like this than the conventional, same-old same-old revelations of HL:Alyx and the like. This game/experience/piece is a) a technical achievement b) narrative marvel c) aesthetically wondrous VR environment. Beautiful work Tender Claw/Piehole!\n\nHelpful | 2", "LeggoMyMeggo1924May 3 at 1:27 AM\nBlown Away\n\nI absolutely LOVE this game! I'm constantly surprised, and that is amazing by itself. The first time I played, I was a bit lost and confused, but that kind of goes away after a time. By no means have I \"figured\" everything out... There's A LOT going on here. Amazing. You will not regret buying this game.\n\nHelpful | 1", "Alternate-May 14 at 8:53 PM\nOne of the best experiences on the quest\n\nThe game makes you explore not only the world but also the mechanics, interaction with other people feels unique and cosy, and live performances fill my evenings with pure joy. 10/10 definitely a must have game on the quest.\n\nHelpful | 1", "HAMYgamerFeb 29 at 7:16 AM\nIve truely become a part of this world\n\nIve been playing this game since the day it was released and there hasnt been a single day where it hasnt put a smile on my face! Ive been lucky enough to meet so many of the amazing characters of the under from the chair lady who was the first person I met, Vicky and Nicky the cats who have the best duo Ive ever seen, and Bernice the skeleton leader of the sweeper union who is always there to make your day and mine, I guarantee it. Now sadly at the time of writing this review it sounds like we wont be seeing them as often or at least theres a lower chance. This is such a shame because theres still so many people Ive heard about and never seen or heard from. Regardless of how often theyll be around it is still undeniable that this story is just beginning and I cant wait to walk into that old ship and see whats next! Thank you everyone of the under for giving us this amazing world!\n\nHelpful | 12", "ian.shaffettApr 22 at 10:30 PM\nWow! Live actors\n\nI want to begin by saying how helpful everyone is in this experience. I walked right into this game all confused on what to do and what there was to do. Then I saw this cat and I waved and the cat told me hello, I heard about the live actors in the game but I didnt know it would be this fun. She showed me how to get masks and all the places I could go! We even did the makarana. I think Ive been to all the places and I wish there was more. More worlds, more things to do, and more live actors.\n\nHelpful | 0", "treethoughtApr 30 at 8:36 PM\nAmazing experience\n\nA beautifully designed and thoughtfully created experience. I am quite a few hours into it and I'm still on awe of how much there is too experience and how unique this game. Honestly one of the most beautiful and artistic things I have experienced, VR or not.\n\nHelpful | 0", "Ghostlo90Apr 20 at 11:47 AM\nGood place to hang out\n\nGreat introduction to the world and once you are done you will be together with the community.\nAppreciate the live actor that is always there to guide us, entertain us. This game will be very dull without you guys/ladies.\nGreat stage shows and live entertainment from time to time, keep it coming!\nOnly live actor are able to talk which make it unique from other social app but it also means you guys need to be there for us to keep the vibe up.\nLastly hope to see new environment like a lounge where shows are more suitable to be in.\nKudos to the team!\n\nHelpful | 0", "Olliesub103Mar 26 at 2:41 PM\nWHOA\n\nI LOVE this game! I have a lot of games (ALOT) And this is by FAR the GREATEST ONE EVER!! I only Wish that There Was some sort of ritual or thing to do that summons a live actor or something special you need to do so you can place a request for them to come and that will came as fast as they can. THANK YOU SO MUCH TENDER CLAWS. There is not a SINGLE day that this game hasnt brought a smile to my face (AND I PLAY IT EVERYDAY)!!! Welp, yah so bye.\n\nHelpful | 3", "jedfryJul 16 at 7:27 AM\n?\n\nWhy would it be listed as free when you have to pay to do everything?\n\nHelpful | 2\nDeveloper ResponseJul 16 at 10:10 AM\n\nHi! The Under Presents offers a free ~45 minute demo to give users a taste of the game. This demo is explicitly explained in our Oculus description with additional info on different prices and content available. Purchasing \"Timeboat\" after the free demo or buying a ticket to the \"Tempest\" live show helps support our cast and will also give you access to the multiplayer hub world with secrets to explore, recorded acts, magic spells and our NPCs played by live actors!", "WDG_dahdumbguyApr 20 at 7:42 PM\nThe moderators are too strict.\n\nDon't get me wrong, I love this game. I just can't stand the presenters, let me explain. I joined a random lobby today expecting to just explore and find some new masks with strangers online. I love the multiplayer in this game, its what turns it from a good game into an amazing game. I see a presenter and I threw an onion at him just to poke fun at him. I was not expecting the reaction he gave me to say the least. He looked at me and said \"I warned you not to do that any more\" (I never did anything of the sorts) and then he PERM BANNED ME. so uh it would be a five star game if their first reaction wasn't an instant ban, atleast give me some sort of warning! I feel like I've been scammed and I cant refund the game after my 5 hours on it. Very disappointed.\n\nHelpful | 15\nDeveloper ResponseApr 20 at 7:16 PM\n\nHi Sorry to hear. Since disrespectful behavior in the community is disruptive to other players and actors, actors are able to help moderate the community; however, banning is not overused in general. Since we are a staff run by real/life people, perhaps there was a mix-up with another player. You should be able to get back into the game, if not please write support@tenderclaws.com thanks", "udo.nink12 days ago\nWeird rare special\n\nIt is somehow hard to describe, a somewhat weird but rare and very special vreal experience. Really good. Clever move control, different again, but feels very natural in a minute. Cool stuff.\n\nHelpful | 0", "Corky1961May 21 at 3:01 PM\nLovely game\n\nFound it brilliant during the lockdown. Very atmospheric and strange. A get away from the reality experience.\n\nHelpful | 1", "Shadowflame9Apr 18 at 8:09 PM\nAmazing Game!!\n\nI love this game! I got it yesterday as a birthday present from my friend, im loving the story and when you hang out with other people theyre always so nice! I actually convinced my friend to get this game so im looking forward to see his response. 5/5 stars!\n\nHelpful | 1", "phiam.ashMay 29 at 11:00 AM\nA strange, fun performance puzzle\n\nFantastic setting, playful mechanics. I felt swept away\n\nHelpful | 0", "moocow359Mar 7 at 12:10 AM\nIncredible.. and utterly unique\n\nThis is where VR should be heading!!!\nI begin to think I have seen all that this game has to offer, then a character takes me on an adventure and Im again left in wondrous awe of everything I see. And then left with a feeling that I have so much more to discover.. This is such a lovely experience. Thank you devs and actors alike... please keep the actors in place for a bit longer..\n\nHelpful | 5", "Ender772Jul 16 at 8:05 AM\nThere is no free time!\n\nApp says 45 minutes free..but that is not the case. Nothing is free and shows only start at specific times for some reason\n\nHelpful | 1\nDeveloper ResponseJul 16 at 10:09 AM\n\nWe know that this is a unique model for games! The Under Presents is a larger game world with a free intro and multiple hours of content, this demo is explicitly explained on our store page. Buying a ticket to the Tempest, our live show, will give you permanent access to the multiplayer hub world and potential further live actor encounters. Tempest itself is a completely optional DLC option within The Under app. Think of Tempest like buying a ticket to a live show, theater event or movie, except you are able to actively participate and shape the experience as one of our live actors performs. Tickets represent a parallel experience to IRL immersive reflect the value of a sustained performance led by a professional immersive actor, thus specific times for shows. If you would prefer to not experience Tempest, we have a multi-hour singleplayer experience called \"Timeboat\" also available. This is a single purchase and also gives permanent access to the multiplayer hub world.", "ashen83May 6 at 10:57 PM\nNot for me.\n\nI got this based on other reviews.. I figured out the first part quite quickly, but even in doing that I didnt have verbal-less friends helping me try to figure anything out.. just other people who looked as lost as I was, picking things up and throwing them.. I got through to the stage and then I was taken to bottles with things in them.. I was thrown into a bottle with a ship in it and couldnt for the life of me figure out what to do in there, I couldnt interact with anything.. I couldnt get out, so I ended up restarting.. I wanted to try to see these live shows, I went through the same steps as before, only this time I couldnt get in the back door.. The weird masked dude was stuck in perpetual swirly-ness. Idk if it glitched or if I missed something, but I got frustrated. Am returning the game.\n\nHelpful | 3", "HeroRykerMay 6 at 5:54 PM\nBest game ever\n\nBest game ever. It was all good and happy then one day I got on and saw new performances but some were really weird best game ever though aside from V-VR.\n\nHelpful | 0", "CarmioApr 9 at 1:59 PM\nToo much man!\n\nI was only playing today for maybe two hours, but during that time i rebuilt the stonehedge in the middle of the desert, snapped alot, did some magic, and had a dance party with a live actor! That wasnt even the main story either! Playing this game wont leave you disappointed\n\nHelpful | 0", "Skyhawk613Jul 13 at 2:05 AM\nBrilliant!\n\nWorlds within worlds brilliantly put together! This is a weird yet fascinating arty-farty interactive experiance one must download! How this is free is beyond me, but I really do appreciate the time and effort the developers put in to this wonderful creation!\n\nThing is, one has to be in the mood for this kind of stuff and right now I just feel like shooting orcs in the head on Elven Assassin, I'll continue with Tempest later lol\n(Don't judge me).\n\nHelpful | 0", "AndrooJul 11 at 2:47 PM\nGroundbreaking - yet polished.\n\nHonestly. One of the best locomotion systems in this sort of game. The characters, the world building is astonishing.\n\nIf YOU were transported to another dimension you wouldnt expect stuff to make sense straight away,right? But when it clicks OMG. This is innovative and clever on levels I have never seen before and ohhhhhh so polished. Get it plus get the free version and play the first 30 mins. Hint yo can always sneak through the back door of the green room ;)\n\nHelpful | 1", "PandaDragon2020Apr 15 at 12:55 PM\nHow does one become an actor??\n\nI get that we have an entire pandemic but. What if we could pay so that we could be actors. And so it doesnt get out of hand, we will be scheduled a time for acting. I would like to become an actor for this game and happily pay. How do we become actors?\n\nHelpful | 1", "BobbiHereMar 9 at 6:30 PM\nVery interesting !\n\nStill trying to figure it out.. meanwhile, enjoying the challenge of understanding. Very different, but entertaining & fun. Im amazed at how & what the developers can create. Looking forward to figuring out this game. From the other reviews sounds like Im on the right track... & more fun & challenges ahead.\n\nHelpful | 3", "KjelltringFeb 22 at 9:31 AM\nTalking broom, time and onions\n\nI dont know where to start, no play session is the same. Make stuff, learn from others, roleplay with a skeleton and a broom, become friends with talking broom or maybe play the single player part \"time boat\". I just jump in to the Under and let the world take me on a trip. Yes, it's a trip on all levels of the word.\n\nHelpful | 6", "eastwicksmadmanFeb 25 at 4:23 PM\nOne of the best Oculus games!\n\nThis game is beyond amazing! It literally takes you to another world. The fact that there is non verbal interaction with other characters makes it all the better. You enter a world where at first you think youre alone until you meet others who through non verbal communication teach you how to perform magic tricks. This game is by far one of the best games Ive ever played on my device. It literally shows the potential of VR and gives us a glimpse at what can be possible using this technology. Highly recommend everyone give this game a try. Youll love it and be completely immersed in its amazing world.\n\nHelpful | 5", "RainorRunamukJul 15 at 2:00 PM\nFree to only install\n\nShould be listed other than free I mean what a gimmick\n\nHelpful | 1\nDeveloper ResponseJul 15 at 3:40 PM\n\nHi! The Under Presents offers a free ~45 minute demo to give users a taste of the game. This is explicitly explained in our Oculus description with additional info on different prices and content available. Purchasing \"Timeboat\" after the free demo or buying a ticket to the \"Tempest\" live show helps support our cast and will also give you access to the multiplayer hub world with secrets to explore, recorded acts, magic spells and our NPCs played by live actors!", "BlkWildFLOWERJun 20 at 11:54 AM\nWtf??\n\nStrangely weird ..I still don't know wtf is going on here lol...my head is spinning \n\nHelpful | 0", "Pootpooot45Jul 13 at 3:36 PM\nDidn't know it was a demo\n\nIt didn't work the first time I opened the app so I had to do it again. The beginning was pretty cool until you have to buy the full game. This was probably my fault for not knowing I had to buy it but oh well. The full game is pretty cheap so most likely going to buy it.\n\nHelpful | 0", "IttykittyFeb 16 at 8:52 AM\nMy son and I both love this game!\n\nMy 9-year-old son is playing this as I type and this is the only game out of many that Ive seen him play for this long, and he keeps going back to play more.\n\nIve been playing it when hes let me, haha, and it is incredibly imaginative! Im really bummed to hear that the live actors will be going away at the end of March since it has been really fun to find and interact with them.\n\nThis is definitely the most fun and interesting game weve tried yet. It did not disappoint.\n\nHelpful | 4", "noozledNov 19 at 1:28 PM\nA VR Experience Like no Other\n\nSo Ive spent about an hour and a half playing this game so far and wow I am already so impressed. The first 20 minutes or so had me very confused, but every time I found myself this way, I realized I was supposed to feel that way, so get ready to be confused. But moving past that, Ive spent some time wandering around the bar curiously trying to figure out if people around me were live players or actors, and at first led me to believe I was surrounded only by NPCs. Eventually however, some older woman looking character starts talking to me and who seemed to be another player offering us martinis. The other player didnt seem to care, accepting the martini but continuing to mind their own business. I however wanted to mess around with this person to see if they seemed to respond consciously which they absolutely did. I waved hello and got a hello back, I accidentally dropped the first martini which she made fun of me for, etc. Eventually she offered to take me somewhere special so I nodded my head, and we both teleported to some food top where she taught me magic tricks, and helped me out when I struggled. This absolutely blew me away, and this isnt even the actual story mode yet! After I felt satisfied with my actor encounter I only recently began the games story mode, which is so far very reminiscent of Invisible Hours. You feel godlike with the ability to control time, make yourself a giant, and see everything as it happens. I love this game!\n\nHelpful | 333", "duckbill_Apr 26 at 6:23 PM\nIMPECCABLE AND AMAZING\n\nDense atmosphere, huge potential, and a DEEPLY intriguing world. PURCHASE THIS GAME!!!!!\n\nHelpful | 0", "Mr.ScrubanatorMar 13 at 10:48 PM\n\nI thought this game was just amazing, I like be the whole thing, there are so many things to mess around and do while you are in here and you hardly ever run out of stuff to do, even doing the same things again is still somehow fun because you feel amazing casting spells with your own hands! There are like two parts to the game and depending on what type of thing you like to do they are awesome. I am pretty sure that one is like a mystery kind of thing but I have spent most of my time in the open world hub, I love messing around and one time I accidentally travelled to another world, the whole game is absolutely amazing l. And it has got pretty good graphics as well, like there are really pleasing, and kind of smooth, I love them. but overall the it is an absolute blast!\n\nHelpful | 1", "TeonisApr 24 at 4:40 AM\nSooo unique!\n\nYes, this is not for everyone, but if it is, then this will be one of Your favourite!\n\nHelpful | 0", "Jupex92Jul 25 at 4:15 PM\nWierdly awesome.\n\nI have no idea what's going on, bit I love it. Kind of like a jazzy \"Spirited Away\" type vibe. Give it a go and explore.\n\nHelpful | 0", "carterguillonApr 22 at 6:30 AM\nThe best vr game ever\n\nI love the unders developers there are so good at there jobs go give them a raise sorry for attacking the cat lady\n\nHelpful | 0", "JoshymoeMar 6 at 12:25 PM\nFavorite game on VR\n\nThis game is fun asked full of fun and never runs out of things to do. The sort mode is fun but the game shines with the multiplayer exploration aspect. Discovering new locations, learning new spells, and unlocking new masks. Amazing game! 5 stars!\n\nHelpful | 2", "DeepMellowJun 18 at 9:52 PM\nBoring and lame\n\nWorst game Ive ever played. Bad graphics and sound. Glitchy with no updates.\n\nHelpful | 1", "v._.keyFeb 22 at 12:02 PM\nTheyve done it again\n\nYou know what... from now on, whatever tender claws releases, YOU BLIMMIN KNOW IMMA BE BUYIN IT! This game is beautiful. The story is sad, mystifying, scary and incredibly crafted. I was lucky enough to come across a live actor today and I made him a onion... he started coughing and told me he hated onions... so I made him a cake (using magic Id learnt from other players) which he loved and thanked me for. You may be thinking this was a normal person... no... the live actor was a small cat with a plant on its head and a crab claw as one of its hands...\n\nIve learnt so many skills / magic tricks that I can use my mask for and have made my way through the complex but fascinating story called the time boat. You honestly need this game... tender claws has obviously come to realise the magic of vr like no other game developer.\n\nJust buy this please. Its amazing.\n\nAlso, people saying that youre doomed when the live actors leave left are wrong... players who have played a lot always love to help. Ive just helped a new player today learn many tricks and get a new mask. The live actors just add another level of comedy.\n\nAlso, the concert music is pretty banging\n\nHelpful | 2", "MissDefyApr 26 at 7:02 PM\nI wish I hadn't bought it\n\nThe actors harass you to move into different areas, ultimately leading to Timeboat. Timeboat causes me horrible VR sickness. I just want to explore the open world areas.\n\nHelpful | 3", "LIGamer8 days ago\n\nIts not loading\n\nHelpful | 0\nDeveloper Response7 days ago\n\nHey! Email us at tempest@tenderclaws.com with your oculus username and well help fix things! :)", "strangeEvidence16Apr 25 at 1:20 PM\nBoring\n\nUhm weird there is no description and it is dark and honestly scary. Im going to try and get a refund. Not worth it honestly. Boring, no tutorial. No way to know whats going on.\n\nHelpful | 4", "LavaFrog12Feb 21 at 2:54 PM\nGreat!\n\nI've had over 10 hours playing on this game, and it still has new and interesting interactions happening all the time, even after you've completed the story. It's a game like no other, and I highly recommend it. It comes from the people who made Virtual Virtual reality, so it can't be bad, lol\n\nHelpful | 2", "skavankDec 22 at 4:17 PM\nIn complete awe\n\nI was introduced to this mysterious wasteland, not knowing what to expect. Trying to figure out if the masked shadows around me are scripted entities or other players, when one of them points at me to follow them. As I followed behind, they kept looking back and snapping their fingers. As we walked I was baffled by the scale of the place. They took me someplace hidden, showed me how to do magic, and craft something amazing. My mind was blown, and I just wanted to learn more.\n\nI completely forgot about the time, and 6 hours later I was still playing, still exploring, having to utilize teamwork to uncover mysteries with my newfound voiceless friends.\n\nI was just about to put my headset down when suddenly a cat lady appears and starts addressing all of us. Talking about wet food, commenting on everything we do, and encouraging shenanigans.\n\nI have never been so immersed and filled with awe. The voiceless communication leads to some fantastically wholesome interactions between players and adds to the mystery of every situation.\n\nThis is VR at its most amazing.\nI cannot wait to return.\n\nHelpful | 29", "WhoIsEddJonesMar 11 at 3:50 PM\nNever mind.\n\nA game where you learn things about the world silently from other players, and you might spend more time in the hub world than actually playing the single player plot, Timeboat.\nThere is a stage where it cycles through pre-recorded performances from in game characters, except once in a while you'll be listening to one and realize that it's not pre-recorded; it's a real person. The line between live experience and game is completely blurred and this game is something I think everyone should see. It's like nothing I've played before.\n\nUpdate: This run is coming to an end and we got one singular update. Besides that, Tender Claws has built an extensive and beautiful lore that is projected by actors in-game... And the only way you will ever see it is if you spend all of your free time with your headset on in game, just in the very very off chance that an actor appears with something useful to say instead of telling everyone to make everything tiny and/or gold for the 50th time. Oh do you have a full time job? Too bad you'll never see any of the actors, as they are only on during the day.\n\nThis had a great start and a lot of potential, but Tender Claws really botched this one. I was so incredibly inspired at first and now towards the end, I'm only disappointed.\n\nHelpful | 8\nDeveloper ResponseApr 1 at 3:20 PM\n\nThanks for playing, sorry to hear that you feel let down. We do consider the anchor point of the world as the longer single player campaign where players can explore and discover on their own time. This core aspect will continue to run indefinitely and exist long after our actors eventually end. The multiplayer element will also continue. Live actors are a special bonus to the game and may be encountered serendipitously from early morning too late night. They are meant to enhance the experience with activities and occasionally lore that extends the single player experience. Due to the flexibility of this format, we encourage players to come and go as they please! Though, of course we welcome different play styles and people to hang out enjoying The Under as long as they like.", "Onodrim10May 20 at 3:32 PM\nGood, but actors not at all\n\nIts a good game but the first actress i meet banned me, and i dont know why, if u work in a game with people dont be a as* h*le...\n\nHelpful | 0", "GannanApr 24 at 6:38 PM\nVery nice break from reality!\n\nYep, that pretty much sums it up!\n\nHelpful | 1", "B1llC1ph3rJul 6 at 8:12 PM\nMy favorite game so far\n\nI absolutely love the 20s feel, I love the ability to fix things with the mask, I love how the game controls, and the acts are a little ridiculous but funny\n\nHelpful | 0", "nozooNov 19 at 11:39 AM\nThank you Tender Claws!\n\nI love those developers! They are the ones who give us Virtual Virtual Reality (if you havent try it, go for it). They seems to have deeply understood what VR can bring to you as magical and new experience. I still have to fully immerse in this title, but already thank you so much for coming up with it. Its just amazing how surprising and immersive are the world you create for us.\n\nHelpful | 120\nDeveloper ResponseNov 19 at 12:46 PM\n\nThanks for playing! and glad you're enjoying the Under, we've put a lot of love into this new world and are excited for players to finally be able to check it out.", "JustN3k0Mar 30 at 10:39 AM\nAmazing non-standard gameplay\n\nYou guys rock it, I enjoy every game that you make. The mechanics, the story, the atmosphere - everything is just superb!\n\nHelpful | 0", "IninjahoundApr 2 at 1:34 PM\nWell talking\n\nI cant say bad things about it but how you cant talk to friends or the ai friends they're are some fun things but then you cant figure out the secrets or masks and is no real way to become an actor and nothing to talk not even a piece of paper to write on I cant say bad things about the game but let us talk in game\nand make the secrets easier\n\nHelpful | 0", "davidsweltJan 27 at 8:26 PM\nA new genre?\n\nThis was the most remarkable experience I've had with a game. Is this a game? Or an art installation? A theater piece? The graphic design, the story, the soundtrack come together to create an ominous, sad, exciting experience. We are in the midst of it, a voyeur in a Hitchcockian play, finding our fears in the characters and the unknown, dealing with a situation that is, by and large, out of our control. Execution was amazing: a good story, the right audio, and each character's finale in the strangest dream-like environments.\n\nI feel this new genre has much more to give. I'm looking forward to seeing more.\n\nHelpful | 3", "JhoooonJul 11 at 1:19 PM\nNo clue what just happened but five star\n\nIts free. just download it. I cant explain this in a way it would make sense.\n\nHelpful | 0", "obi2kenobiJul 10 at 12:09 PM\nI do not have the patience for this\n\nIt started out okay. Then it kept just resetting my progress and playing back recordings of me going through the room. There were a bunch of doors and none of them led to anywhere. Sorry guys, I just don't get it.\n\nI did like the mask dude and the environments were very interesting.\n\nHelpful | 0\nDeveloper ResponseJul 10 at 1:17 PM\n\nHey, thanks for playing! This room is a puzzle, and you may have to use your past selves to help make things happen! I'd recommend opening just a few more doors... If you still are stuck shoot an email to info@tenderclaws.com, we'll help you out!", "JuneBuneFeb 3 at 9:59 PM\nI met a cat king\n\nHere i am sitting inside the mask workshop that a fellow player guided me to, sitting in the middle of the floor trying to figure out how to make a mask. After a while of me sitting and thinking i hear a hissing sound in the corner of the room, I look and there is a cat with a crown on his head.\n\nThis cat taught me the art of dance and so he seen i was worthy of the dance and made me a Knight, and gave me a golden sword then showed me around the workshop.\n\nHe sent me on a mission to the time boat and we parted ways. This Cat King was an actor, an actual person in game that responds to me. Ive never had a more greater vr experience and i have zero regret for getting this game and you may be confused at first but thats why they have these actors to help guide you if they see that you are in need. 5 stars\n\nHelpful | 2", "DirtySkundyMar 25 at 9:34 PM\nLove this concept!\n\nIm about an hour or two in and Ill say this game is incredible. Really unique use of VR that is very engaging\n\nHelpful | 0", "hazzarolfeyFeb 1 at 3:51 AM\nThe best vr game I have ever played!\n\nThis game is amazing and if you havent tried it what are you doing with your life!! From the social side to the single player story it doesnt get old.\n\nThis game is so good that I would play my quest until it runs out of charge so I wait until that sweet sweet light turns green so I can enter this magical world again and again!\n\nThe magic of using the mask is so satisfying as well and the community is one of the nicest I have been in so I can just jump in and ask a question and people would help me find the answer with no worries!\n\nSo if your debating on spending money on a game that your no sure of then this is the choice!\n\nHelpful | 2", "WoodsTheRookieFeb 16 at 9:44 PM\nGreat fun, even without speach!\n\nI got lucky enough on my first entry into the Under to have a small group of people show me how to use the magic with the masks and such. I got even luckier to just happen to stumble upon one of the live performances, which came as a huge shock at first, but was honestly great. Being able to interact with the performer and join along in the show was a blast, and id like to think i helped to further the story a little. The only thing i have yet to learn is how to change the masks if possible! Have hardly played the main part of the game yet, mainly because i have been so entertained with The Under that i just dont want to leave to play the single player! But i have high hopes!\n\nHelpful | 1", "NighfireJan 29 at 4:00 PM\nAmazing Interactive Experience!\n\nJust entered this for the first time and had an AMAZING interaction with other players! First they showed me how to use the magic system to craft a sword, which took me some time to follow since it was a multistep crafting recipe (got it after I noticed clockwise & counter clockwise rotation are different when crafting).\n\nAfter I crafted the sword, one of the other players then took me on a tour of restoring the world, brought me to the Workshop, and taught me how to craft new masks that replace your default mask. Truly amazing!\n\nFun to learn how to communicate using non-verbal means. You can only gesture with your hands and head in addition to snapping your fingers. Despite this, we eventually communicated enough to go on our journey and for me to learn the game's magic crafting mechanics. I have to say, the other player guiding me had quite a bit of patience, for which I am truly grateful.\n\nThe player also gave me a map while we were in the workshop, which btw is a magic map - showing our positions as we journeyed across the barren desert overworld. I held onto the magic map through our travels, which eventually ended at Stonehenge.\n\nIn the end, we both ran into low batteries (I know I did, I can only assume my guide did as well). My guide waved goodbye, gave me a hug, and was gone. Then I stood there alone for a bit, stifled with amazement... filled with a sense of wonder and gratitude for my new friend who I would never see again but would always remember when I looked at the mask she helped me craft.\n\n...all this, and I have only barely touched the \"main game,\" which starts on a boat where you control the flow of time. I have already seen so much, yet I haven't even begun to enjoy the main content.\n\nI can't recommend this \"game\" enough. I have never experienced anything so amazing in VR. Please, do yourself a favor and immerse yourself in this strange, beautiful world.\n\nHelpful | 2", "MikeVonMatterhornNov 19 at 2:20 PM\nI've only scratched the surface\n\nI've never heard of this game before and i did not know much about it or what to expect, but i thought \"well, i'll give it a try\"... and i'm not disappointed.\n\nI was playing the game and suddenly i see that my quest is running out of power and it seems that i've just spend 2.5 hours in \"The Under\" without realizing how fast the time went by and so far i've only enjoyed the show aspect of the game and not even touched the single player component.\n\nGreat game, give it a try, i will now grab a drink and enjoy the show a bit more.\n\nHelpful | 47", "thezachbrandonFeb 27 at 7:11 PM\nAn honest, personal review\n\nMany people love this game because it is abstract and fun to look at and is immersive. I enjoy games that are more straightforward, being required to go exploring just to accomplish simple tasks and having to figure everything out on my own, its not extremely difficult but it can be very confusing, was not how I prefer spending my time. I get a headache every single time I play this game even after I changed from warp to teleport, because the style and just type of game that this is really bothers me.\n\nSome people enjoy when developers are seemingly screwing with them, personally, I find this extremely annoying because youre left on your own to figure everything out, most things which are not extremely obvious. I like puzzle games but not this type where you dont even have an objective half the time and you have no idea whats going on or what youre supposed to do.\n\nWith that said, I regret giving this a one star because I applaud the creativity of the developers, however it isnt the game for me and perhaps it may not be the game for you either.\n\nHelpful | 5", "derek.brown.754Mar 29 at 1:57 PM\nOdd in a good way.\n\nThe live actors make this game so cool and diffrent.\n\nHelpful | 0", "atirathaJan 24 at 11:50 AM\nExperimental, unique, wow\n\nThis experience (it's unfair to call it a game) is truly an exploration in what can be done in VR. A blend of singleplayer and multiplayer with very little explanation as to what is going on, but I believe that's the point, to explore, what is possible. Also, communication with other participants is entirely voiceless and boy did I have fun interacting by gestures and conjuring objects only. There are secrets and layers to this and I've barely scratched the surface. I can't wait to discover it all.\n\nHelpful | 2", "yuukikicoMay 5 at 4:39 AM\nPlease support Japanese.\n\nThis game is awesome.\nBut,I want to play this game in Japanese.\n\nHelpful | 0", "mason.jamison.752Jul 11 at 2:04 PM\n\nAmazing game\n\nHelpful | 0", "snow0x00Nov 19 at 4:00 PM\nLive Actors\n\nAt the time I write this there are live actors interacting with you, at first you think they're an NPC doing a scripted scene and then bam they call you out or interact with you and that's magical.\n\nThere's also a lot of game here and a lot of mystery. Can't wait to jump back in.\n\nHelpful | 44", "ClayKrayFeb 5 at 10:12 PM\nStunning\n\nRather than just being a social game this is an entire virtual theater filled with real live actors that are so good you most of the time don't even know that they are real until they start interacting with you personally. One experience of mine was I was just walking around by the stage and I found a cat she had a massive smile on her face and was ranting on about having to find her sister she gave me a message to tell her sister if I ever was to find her before she did and then went on stage to perform this cat was accompanied by a crab wearing a top hat and monocle that could change its size at will.but there is still a story and it's not entirely dependent on the theatrical appearances despite it being very fun. I could not recommend this game more\n\nHelpful | 1", "DGTec14Mar 24 at 8:24 AM\nShockingly amazing game\n\nThere is nothing more to say, go check it out for yourself\n\nHelpful | 0", "captain_meow-velJul 7 at 1:09 PM\nPp\n\nHappy cake day\n\nHelpful | 0", "SmeliotDec 31 at 1:15 PM\nAbsolute magic\n\nIve been playing for a while now, and I can hardly put into words the feeling this game gives me. Going in I had no idea what to expect other than knowing its from the same studio as VVR (my previous favorite game), Ive played through Virtual Virtual Reality a few times all the way, very fun, but The Unser Presents is so much bigger.\n\nThe way you do magic is unique and weird but slowly it becomes more intuitive, kind of like the wobbly stretchy movement. Unlike anything Ive seen in a game so far.\n\nThe storyline for the one-player TimeBoat is awesome and unexpected, Im still not through with that, Im stretching it out best I can. It sucks you in.\n\nWhats so insanely unique about this game is the multiplayer component. When I was first thrusted into The Under I was met by other players, it took me a minute to figure out they were actual players and not just NPCs. They taught me how to do some magic, we partied to a few acts by the stage, then all went exploring the vast sandy expanses. Theres something really nice and surreal about communicating with other players only through snaps and gestures, and the more you play the better you become at the silent language.\n\nIve met a few different live actor NPCs so far these few days: had a one on one experience with Sweeper in the workshop that made me feel special, ran into those two skeleton buddies and played some games, a silent skeleton who I can only assume to be Tina, quality control lady (super funny and nice), and just today got to go on stage and play a round of Dont Press The Button!\n\nIts all super cool. This has become my game of choice, and I dont think Im gonna stop any time soon.\n\nHelpful | 5", "DAMfalconJan 31 at 9:49 PM\nAnd I thought the story play was great\n\nI cannot say enough good things about this game. Ive played a significant amount of the story already but today was the first time I checked out the sand box area. I was apparently lucky enough to run into one of the actors that took me on quite the adventure!\nI think its really awesome what the production team has done with this game. Its going to be unfortunate when the live actors are no longer available cause there is no way I could have struggled through all the secrets (thus far) without them.\nGet this game now before its too late, you wont regret it!\n\nHelpful | 0", "welshboy1971Nov 19 at 3:39 PM\nWhat a game !!\n\nI have to say thank you to the developers and I can only assume the live actor I came across in game. The game is outstanding anyway , but the few minutes I spent interacting with a cat lady on the slide practising songs and dance moves , well I dont think I have ever experienced anything like it before in a game EVER !.\nThe game seems to be ( at least the beginning ) like VVReality on mind bending steroids interacting with yourself and I cannot wait to dive deeper into the ship story.\nAmazing game , amazing concept and just what I experienced this evening made the purchase so worth while.\nCongrats and if someone from Tender Claws sees this , pass on a big round of applause to those involved tonight if there were indeed real people making me dance on a slide and laughing like a madman.\n\nHelpful | 28", "flippababyJan 30 at 10:17 AM\nIve been sucked into the matrix!\n\nWell - what to say? Ive only played this for around 90 mins. Im still rather confused, but loving it!\n\nThe same team made virtual virtual reality, which was one of the 1st games I purchased - and although bizarre at first, it was one of my best vr experiences on the quest so far - so I have high hopes for this!\n\nLove the whacky style - one of those games that wouldnt be able exist on a flat screen.\n\nCant wait to play more, as Ive clearly just scratched the surface.\n\nI made an emergency purchase of this game when I read that the live actors will be departing at the end of March - so I will see it at its best for a couple of months.\n\nIll endeavour to update this when Ive finished the game :)\n\nHelpful | 0", "ellidnFeb 8 at 7:07 AM\nSo disappointed.\n\nWas so excited for this game - absolutely loved VVR. And the reviews were glowing. But I feel so disappointed and let down, maybe Im doing it wrong.\n\nThe initial start of the game is amazing, all the way up until you get to this theater in the desert. From there, everything goes downhill very very fast. There is literally NOTHING to do but wander around aimlessly, clicking your fingers to turn random objects into food that doesnt do anything when you eat it but have a chomping sound effect. There are these Timeboat booths that are the only things to do anything with. Everything in the game basically is pushing you to go to the Timeboat booth and then you basically are trying to solve a mystery by running around clicking your fingers whenever you see a glitch. This is so absolutely boring. You cant interact with any of the Timeboat characters, you literally are just the fly on the wall.\n\nBack at the bar  Ive interacted with maybe 4 other masked players in total. No other characters whatsoever, the place is totally empty. Im in medical school so the hours I use my quest in arent exactly business hours - seems like the live actors that everyone raves about are missing ingredient.\n\n\nJust really sad, honestly was so excited and loved the beginning up until the bar, and then it got so repetitive and boring and frustrating. I tried so hard to love it, but its just not happening. Will still look forward to the next Tender Claws game, VVR is my #1 game by far.\n\nHelpful | 6", "MycroftsbrotherJul 28 at 4:22 PM\nMade me sick\n\nThis was the first VR experience that gave me motion sickness. I had to quick the midway through. Definitely not moderate.\n\nHelpful | 0\nDeveloper ResponseJul 28 at 6:23 PM\n\nHey, thanks for playing! We have several different movement styles to account for varying levels of motion sickness. You may prefer the \"teleport\" style. You can switch to this by pressing the bottom button on your left controller to bring up the games menu, then pushing \"enable teleport.\"", "Will_TXMar 8 at 8:29 PM\nbest\n\nthe best game ever\n\nHelpful | 2", "PANDA_MONIUMDec 27 at 11:02 AM\nHaters like to claim these are fake\n\nTo all those one star review people trying to say that the 5 star reviews are fake. Ya'll are petty and really kind of stupid. This game, and yes it is a game, is fantastic! It takes a very curious mind to try and touch and play with everything to understand the puzzles. If you're \"wandering around a desert\" try picking something up instead of just walking around aimlessly. This game is great if given a proper chance. I played for only a couple hours at first and was amazed by the story telling and surrealism of it all. Don't listen to the haters, this game is well worth the $!\n\nIf you want a thoughtful, rewarding experience, go with this title. But if you're looking for something that won't make you think, best to avoid this one.\n\nHelpful | 4", "WordpassManJan 26 at 8:32 AM\nAn exceptional experience\n\nThis game, I can officially say is my favourite game on the quest. The multiplayer can be slightly daunting sat first but once you find your bearings it is an awesome adventure with silly actors/characters to speak and interact with along the way.\n\nThe time boat game/mini game is easily one of the best single player experiences I ever had. It makes for a very engaging 5+ hour story with innovative mechanics and puzzles. A must buy for all quest owners and a wise purchase for rift/ rift s users.\n\nHelpful | 0", "alon.shimonyJan 13 at 10:30 AM\nOne of its kind !!!\n\nThis is like no other game. Live! Actors just blow my mind away! This is absolutely brilliant!! The possibilities in this game are endless and the developers keep creating more and more content.\nThis is a MUST have game for all ages! It completely cut you off the real world.\nI can sum it in one word: WOW!\n\nHelpful | 6", "KyekPaJan 1 at 3:30 PM\nBest game on the Quest\n\nWant a game with clear and obvious goals, instructions, and a storyline spelled out for you? Turn back now. The Under drops you into a world you dont understand, in a body you dont understand, and sets you to work untangling all the threads. If youre looking for a game with minimal hand-holding and lots of thinking, grab this now.\n\nYoull do magic with an innovative recipe system, youll control time, youll play a single player game thats completely different with separate mechanics from the multi-player side of the game, and your mind will reel when you start to realize how the two are related. Youll encounter live actors ranging from helpful to hysterical. Youll begin to find relationships with the real world and stare at photos on Wikipedia in awe of how spectacularly conceptualized this whole game is. Youll get updates that reveal more of the story that actors have been dropping hints about, youll spend hours helping new friends  who you cant even talk to  create new masks for themselves, and youll conjure beers and fireworks when they succeed.\n\nThis is unlike any other VR game youve ever played. Get comfortable with being out-of-your-mind confused, and pay atoll to join this nuclear experience.\n\nHelpful | 3", "bramblevertigenJan 1 at 2:43 PM\nSublime, Unique, Wonderous, Stunning.\n\nWhat can i say that hasn't been said already? Tenderclaw's Masterpiece is something everybody should play: A surreal, humorous, interactive, wonderful hybrid of theatre, psychedelic trip and mystery game . Every time I play it, something mind-boggling happens. The In-game venue (\" The Under\" itself ) is worth the admission alone : A pan-dimensional, time warping, multi-galactic Weimar caberet club where visitors can watch a variety of incredibly enertaining performers, and sometimes indulge in hallucinatory magic games and Carrolian journeys with live actors, other players and, on occasion a giant crab... OR simply relax and enjoy a virtual martini or two. But this isn't enough for tenderclaws: Every time you enter a photo-booth, you can take part in something even odder... and put to use the reality and time-bending powers taught to you by this most esteemed theatre troupe, whilst you solve the mystery of a ship in a bottle and the fate of it's crew. I really can't praise this game enough: all of it is just so unique and delightful: there really isn't anything like it in existence. The makers of the excellent \" Virtual-Virtual Reality\" have considerably upped the ante here, anybody who enjoyed said game should enjoy this even more, anybody who didn't will doubtless enjoy it anyway....Unless that is, you came to this place looking for generic computer game experiences. Nobody in V.R today is making anything as remarkable as Tenderclaws, their vision is utterly unique, their art is cutting edge and evocative, their execution is flawless. Woefully underpriced, with considerable longevity and actual live actors for you to interact with, I would be very surprised if i didn't see you there soon... After all. it IS the invitation of a lifetime. I'll be waiting at the bar with a martini and a little bottle with a skull and crossbones on it. You can have either. Or both.\n\nHelpful | 3", "DarthMuddFeb 15 at 9:16 AM\nAmazing game\n\nThis game is amazing I highly recommend it to anyone who likes magic and mystery. My first 30 minutes some one took me and taught me magic and a secret place on the map and I made my own mask!\n\nHelpful | 0", "terman80rFeb 18 at 11:19 AM\nOutstanding game\n\nThe actors are incredible people and the community is good. I find myself coming back to this game over and over again. Thank you Tender Claws for such a phenomenal experience\n\nHelpful | 1", "DavelovesyouFeb 16 at 10:48 AM\nBoring, pointless and nauseous inducing\n\nIve played this game twice now and on both occasions it has left me feeling bad with motion sickness. It also makes me feel bad that I wasted my money on this. Its just pointless. I havent got the patience, or the time before I feel sick, to find out what to do next, and I also found out that it didnt save any progress after the first time I tried it, so you have to start all over again. I wouldnt recommend this game at all....in case you were in any doubt.\n\nHelpful | 5\nDeveloper ResponseApr 1 at 3:23 PM\n\nThanks for playing. We are sorry you feel that way. At any time you are welcome to change the teleport mode in the game menu to a standard VR comfort mode. Progress will also save after you completed the onboarding.", "evandaganJan 17 at 1:38 PM\nIndescribable...\n\nFirst of all - just know that this is a great example of an experience that could only exist in VR, and if you take the time to learn the learn the rules it'll give you hours of entertainment. It's best to start with as little information as possible, as half the fun is working your way through the initial confusion....\n\nIf you need a little more information; SPOILERS ahead:\nThe game is split into two basic modes, one is a time-loop narrative puzzle, the other is a multi-player mystery based on exploration and cooperation. There's a clear goal for the first (single-player) mode, but the multi-player mode is more open-ended. The two may be more closely linked than it seems, however, and there seems to be some kind of underlying mystery that relates the two modes, which is being gradually unveiled via live actors who occasionally appear in the game and via interactive elements and 'secret' areas of the map that have been gradually uncovered by players.\n\nThere is a growing online community around the game, and promises of future content updates from the developers, so it seems likely that the multi-player aspects will remain \"fresh\" for a long while, even if you manage to complete the (fairly difficult) single player mode.\n\nIt should be noted that the multi-player mode limits player-to-player interaction to finger snaps and gestures - which adds to the air of mystery, and may reveal something about the developers' philosophical outlook....\n\nEdit, after a few months:\nI'm on the fence about it now. I was initially amazed, once I figured out the basics of both the single player and multiplayer aspects of the game, and have had some really hilarious, entertaining, touching experiences, that could only have happened in VR, and probably put in more than 20 hours or so overall.\n\nBut... after a while it all just seems kind of tedious: logging in just to see if there happens to be a live actor around (extremely rare, at least at the times I'm in the have); rewatching the single player narrative over and over again in order to trigger certain events, getting aggravated trying to remember all the magic spells, or wasting a lot of time moving across the multiplayer hub area to see what's new after updates.\n\nIt's one of the most unique experiences I've had in VR, but it does get old after a while. I still think it's worth the price of admission, and keep hope alive for interesting future updates!\n\nHelpful | 2", "zappndusterDec 28 at 12:57 PM\nFantastic!\n\nOh boy, what a trip. Takes vr - storytelling to the next level. Devs must have seen a lot of pills - how else could they come up with those superbe hypercreative worlds and great timebending navigation-elements?! Thanks guys, love your work, virtualvirtualreality was great but this exeeds expectations !\n\nkudos from hamburg, germany\n\nKai\n\nHelpful | 3", "splattydoestuffJan 27 at 11:10 AM\nThe under presents the best game!\n\nThis game is like nothing before! The story and meaning of this game has had an effect on my thinking of the game. Being a very, should I say, big gamer myself I believe that this is an evolution in game culture and it should have an aspect on future video gaming.\n\nHelpful | 1", "kristin.sherwood5Jan 20 at 12:42 AM\nFascinating!\n\nI got this game based on the excellent reviews, even though it didn't look like much from the screenshots. So glad I did!! I've been immersed in this world for days and it fascinates me each time I go back. It's impossible to describe in a way that will make sense if you haven't played the game. Just get it. And prepare to do magic tricks with your face.\n\nHelpful | 0", "LQbanoJan 18 at 2:43 PM\nOMG!\n\nWOW, just WOW. I've just started the game and I'm blown away with the amazing creativity from the Developers. This title show the true capability of VR. I got this after their amazing previous title expecting another great experience but I just couldn't imagine it would be this way. We all get confused and first then quickly are thrown such a big surprise with the first of the \"others\" that just made me very happy to be able to live in these times.\n\nIn years where there's nothing but disappointments from AAA devs, I'm happy to see small studios bring on top notch quality products. I'll support these developers all the way. Thank you, thank you, thank you. Please keep going, we need more amazing titles from you.\n\nHelpful | 1", "BansTTFeb 13 at 1:27 PM\nThis is easily the best game in VR\n\nYou are thrown in to a mysterious world with a mask that allows you to cast spells,craft object and even manipulate time. The rest is for you to discover as you play!\n\nHelpful | 0", "washinmachinJan 15 at 1:57 PM\nMy favorite vr game\n\nWhen I first started playing this, I was incredibly confused. It took me about 6 tries to figure out the first puzzle, and since then it has become my favorite vr game. The puzzles are challenging, but not so much so that it hurts the experience. The combination of the way they tell the story, the trippy nature of everything, and the interactions with other players/live actors make this an incredibly special experience, unlike any other that I have played. I want more. The latest update was great, but so short.\n\nHelpful | 1", "rikibaJan 17 at 4:47 PM\nAmazing!\n\nI've only just finished act 2 in the single player story and am loving taking it slow, but I have spent hours in the multiplayer which is so unlike me. Its just a fun place to hang out. I have so many more magic recipes to learn but just love getting distracted watching the other players, the occasional actor and the pretty great live show that is on repeat at the bar. I can't recommend this enough.\n\nHelpful | 0", "BradenDec 24 at 12:15 PM\nA game like no other, stick with it\n\nThe Under Presents is like nothing I've ever played, an experience best gone into blind which could be accurately described as equal parts Journey, Sleep No More and existential fever dream. Without spoiling too much, it introduced certain gameplay mechanics which feel like the future, things which will undoubtedly become the new standard in many games and experiences going forward.\n\nJust know that as soon as you feel like you \"get\" the game, hold onto your seat because it's likely you've only just peeled back the first layer of the onion. This game goes some places, and almost never in the direction you first expect.\n\nHelpful | 3", "TheBunnyGamerFeb 23 at 9:15 AM\nNothing like VVR\n\nIf you came here looking for something like Virtual Virtual Reality, then look away. This is the first purchase on the Oculus Quest I have physically regretted purchasing. There's no storyline, no hints and doesn't even save properly. I am shocked that a company who made such a good game before can release this garbage and charge 15 for it. DON'T BUY THIS.\n\nHelpful | 2", "joeMacNov 20 at 7:54 PM\nBest $20 game on Quest by FAR\n\nI've tried most games on the Quest, and returned quite a few. This game easily beats out others in the $40+ range. So far it's This, Moss, Vader and Gun Club. Thank you Tender Claws for reminding me why I spent so much money on the Quest; this is the escape that $20 wouldn't get me very far in otherwise, and this is much better for my health.\n\nHelpful | 14", "PsychogenicJan 16 at 11:54 AM\nMy #1 favorite Quest game (out of ~45)\n\n The Under Presents is a game of delightfully having the rug pulled out from under you, then the hardwood floor is revealed to be another rug, then you realize you're standing on the wall and not the floor, etc. TUP features the best social interactions I've had in VR, secrets to discover, assorted magick recipes, live lore-spattered actor encounters, puzzles, and more - and that's just the multiplayer part. Add in a single player immersive theater experience and you've got a sparkling cocktail of wonder and positive weirdness.\n\nNot a lot of hand-holding on the part of the game, so if you're brand-new to VR, it may take some getting used to. But the playerbase features some of the nicest people you'll meet - they'll show you the secrets of the world and help you discover your own magic powers.\n\nAnd a protip: don't stab or poison the actors - it's rude and may result in the actor leaving or in you in a cage. \n\nAlso, don't mind the MC - you should definitely do ritual magic on the crobs. \n\nHelpful | 0", "trefleenorJan 16 at 8:13 AM\nA Most Wonderful Experience\n\nThe beauty of this game is that you don't know what you're getting into. This is the type of VR experience I love, exploring the bizarre and unknown, with the distortion of time and space.\n\nLast night, a live actor showed up and made it a most memorable encounter with others around.\n\nMight be everyone's cup of tea, but if you're into exploration in a trippy David Lynch-like dimension, this game delivers!\n\nHelpful | 1", "JohnReeseEFeb 10 at 6:15 AM\nDESPISE THIS GAME\n\nIve been playing this game for over three months and quite frankly I hate it. The boat story was a waste of time IMO and killed my remote batteries bc of all the vibration. Ive been stuck in the dining room lobby level for over two months. Why make a game so complicated and not include hints? Or Information? What a stupid approach. Visuals are cool though. Aesthetic.....not so much. I personally DO NOT RECOMMEND this game\n\nHelpful | 4", "helta1Jan 10 at 3:35 PM\nNot sure if my review will make sense\n\nThis is like an actual place where you can go, although virtual it feels like a real place ,Like you were genuinely there and you can go back. I know what you think I mean but it's not that. It's not a level or an area of a video game, it feels like it exists outside of that.\n\nHelpful | 2", "kkuzma1982Feb 7 at 3:58 AM\nA gem that is a work of art within games\n\nIt is hard to describe how magical the experience is without spoiling anything. The graphics are super sharp, the whole world to explore is both interesting and amazing with the ideas. Real gem!\n\nHelpful | 0", "PieVlaJun 6 at 1:36 PM\nMind-boggling!\n\nWhen you think you have seen everything in VR ... what a trip!\n\nHelpful | 0", "CriptoNoobFeb 15 at 6:52 PM\nOne of the best vr games for the Quest\n\nThis experience is unique , impresive , and inmersive , note if you are sensitive to motion sickness use the teleport function\n\nHelpful | 0", "andyphillips99Nov 20 at 11:48 PM\nI just had the craziest dream..\n\nThis is like stepping into a surreal lucid dream - it wont make sense but its a dream.\n\nAbsolutely blown away\n\nNOTE TO DEVELOPERS : locomotion is great but the ability to strafe would make it perfect, eg/ snap turn with one thumb stick and move in any direction with the other.. this would allow us to look to the side whilst moving forward\n\nHelpful | 28", "Spike3o0oFeb 3 at 1:57 PM\nA unique experience hampered by design\n\nWhile the idea of a live performance stage to interact with other players and live actors is a fantastic concept it's unfortunately brought down by a downright pathetic excuse for a game. The core of the story mode essentially has you wondering around this ship following passengers and trying to save them from their utter demise. There is literally almost no interactions of any kind with the exception of a few puzzles and the ability to manipulate time. I just couldn't get into the gameplay or lack there of for that matter. It's unfortunate because the opening was so great and the concept is really fascinating but there's such a lack of really any structure that brings this game down. I can't in any shape or form Recommended this game.\n\nHelpful | 3", "SuperCat125Jan 28 at 3:35 AM\nThis is the greatest Quest game Availabl\n\nThis game is about time and education ( not a educational game) but this is a game about teaching new players the basics so they can teach new players as theres nothing on the internet about this game.\n\nHelpful | 1", "fernando.vazquezjrJan 22 at 6:53 PM\nInteresting confusing strange and funny\n\nStill trying to figure out what the game is besides the boat time travel thing.. well really trying to figure out the Time boat thing too.. lol... Cool graphics cool mechanics but in reality not sure if this could be considered a game or just an experience.. so far I haven't really seen no gameplay... Do magic you hang out with people you see a couple of actors talk to you and you have a couple laughs.. looking for serious gameplay like red matter and moss this is not for you.. this is laid-back can see myself getting bored within a matter of a week..\n\nHelpful | 3", "RatedO4UFeb 9 at 7:36 PM\nConfusing fun\n\nThe whole game you're pretty much just confused but you learn things as time goes on. Super fun and different than anything else.\n\nHelpful | 1", "Strife2310Feb 2 at 11:15 AM\nWild\n\nThe concept is great it's fun hanging around snapping at people and just general Tom foolery. Most of my in game time has been at the bar and exploring the desert.\n\nHelpful | 0", "qweytrJan 5 at 10:46 AM\nOne of my favorite vr games!\n\nI absolutely love this game and i really like the way you interact with other players and live actors. I think the game is really fun if you have the patience and just explore you can really get into this! This game has many secrets to discover and is very entertaining. The art style is also nice. It is simple but nice to look at. And even if you dont feel like doing anything the live actors are very fun and even just that will keep you playing!\n\nHelpful | 0", "theshinymonkDec 29 at 7:30 PM\nI love crabs\n\nThank you for making this game. I purchased it within the first few days of release, and I have the hardest time not picking it as my title to play when I start up my quest. I love random unique experiences and I love crabs and this game delivers all those things in bucket loads. I love when I get the chance to see an actor and those little moments will stick with me due to the unpredictable personal aspects of them. I love messing around and discovering things in this game. I honestly still haven't beaten it as I get so preoccupied in the under that it's hard to pull myself to do the main story instead lol. Once again thank you for this game, and if anyone is on the fence about this then please do yourself a favor grab this game asap you will not be disappointed.\n\nHelpful | 3", "Clemonade_Feb 2 at 1:01 PM\nBest Fever dream ever\n\nThe under presents a really beautiful game with so many details that show how much the creators cared. Something about the idea of an underlying plot told through live actors is just so interesting to me. Having to express yourself to other players without speaking and exploring the vast under are exciting and fun. If you get this game and happen to meet a skeleton with a sun hat, let her know you like to sweep\n\nHelpful | 0", "miles.sandiferJan 11 at 6:37 AM\n\ntotallly unique; pushes the limits of narrative Im VR. The locomotion system\nIs compelling and really adds to\nThe atmosphere. The puzzles can be a bit obtuse, but the amount of confusion is measured, and actually contributes very positively to the experience.\n\nHelpful | 0", "EwebechaJan 6 at 4:12 AM\nBest Game on Quest\n\nWow!!! I can see how much time, ingenuity, creativity and hard work went into creating this game!\nI wont go on and on because others have described it so well. I do appreciate a multiplayer game where everyone is not trying to kill each other.... but in fact working together and in some cases must work together. I am nowhere close to being done with this game but while my Quest is recharging I thought Id come here to say Kudos and thank you to the developers and live actors. I cant wait to see what you do next!\n\nHelpful | 0", "dwsheltonJan 12 at 7:21 PM\nLots of potential but too little guidanc\n\nThis is a really amazing approach to structuring a game. And I dont mind having to Google a game occasionally to figure out how to pass some particularly tough level. But even after lots of Googling and checking Reddit this game is still too frustrating. I dont even know how to START playing, really. Time Boat (a game within the game) has a lot of potential but with no guidance I cant seem to find a way to influence ANYTHING, which means, Im just watching. I understand that theres a lot more going on here, but I dont have months to figure out how to even begin really playing the game. Lots of potential, but the execution leaves something to be desired.\n\nHelpful | 4", "JJZabaJan 9 at 1:00 AM\nMost Original VR Game I've Played\n\nLet's start by saying this game will not be for everyone. If you like simple shoot at something or obvious puzzles to solve you may not like this at all. You spend a lot of time wondering what is going on but when you get it it's the most mind blowing feeling. You can spend hours in this crazy world and the live actors are revolutionary and I hope we see more of this in the future. Great stuff!\n\nHelpful | 0", "jeffhigginsFeb 5 at 7:04 PM\nA gem of VR\n\nIve easily spent more time playing The Under than any other VR release. Its a multi-layered delight, and worth every penny.\n\nHelpful | 0", "GcromFeb 4 at 6:11 PM\nHard to describe\n\nMy favorite game on the quest by far, the mystery in the game leaves room for a lot of fun discovery and teamwork with random people.\n\nHelpful | 0", "straycat7Jan 12 at 1:19 PM\namazing! love the live actors\n\ni love this i would not call this a game but an amazing experience the only thing i would want different is some way for players to camuncate but i fully understand not adding talking or texting also more \"spells\" and way to track spells you learn would be good to\n\nHelpful | 0", "TheOverdogJan 14 at 3:26 PM\nOne of my top 3's\n\nThis game is fun to explore the open world and hang out with live actors and people are super helpful and time boat is a really cool story, act 1 is kinda boring but act 2 is were it gets good. Get this game NOW!\n\nHelpful | 1", "BernieLawrenceBrownJan 7 at 5:24 PM\nWhat the hell is supposed to happen?\n\nI just went through the entire story line. Maybe I'm stupid, but I have no idea what just happened. I'm really into weird and thinking outside the box, but this was just a time waster. All I did was float around and listen to rather poor dialogue and figure that there's some kind of time warp going on. What' else is supposed to happen? I just kept waiting for something to do.\n\nHelpful | 6\nDeveloper ResponseJan 10 at 8:15 AM\n\nWhile most of the timeboat is fixed looping play the MC puts on for his patrons' amusement, try following Sara the first mate in Act 2 or Chef in Act 3 and see if you can find a way into their memories to subtly alter their fates. Most all characters will have one such moment you can find and twist.", "FruvDec 24 at 12:40 PM\nUtterly Spectacular\n\nI got this game on a whim,but I cant stop playing it,discussing it,and theorizing about the story.The Under Presents,in my opinion,is a must have for the Quest.The community is fantastic,filled with great people,most of which are very understanding to the new players,who may not know as much about the game.Its an overall amazing game.\n\nHelpful | 2", "SJK1980Dec 18 at 11:09 AM\nUniquely awesome\n\nThe under presents is an experience like no other Ive had in vr or otherwise. Mysterious and surreal. The single player component is good. But the game really shines in multiplayer. Trying to discover new spells. Rebuilding ruins. Wondering what lies behind the crab door. Players giving hugs. And live actors make spontaneous original experiences. The choice to not include voice was brilliant. Creating interesting communication between players and interacting with actors. Im sure there is more to discover and I really hope there is more to come. But if not, this has already been a highlight experience.\n\nHelpful | 5", "EyeAmDioFeb 16 at 7:37 PM\namazing\n\nhonestly one of the best experiences ive had\n\nHelpful | 0", "MakididnothingwrongDec 27 at 10:23 AM\nWords cant describe this game fully\n\nThe first 20 minutes hooked me in, the way I could see my past selves trying to find which door to enter and how to sort everything out was a treat, then came the boat, oh my god I love the characters, I did get a bit sad when I saw a certain ending (when you go to the marine biologists room as a certain event occurs in chapter 3) I love that at certain points as you insert your mask into the machine the walls fall off and you get a nice bit of dialogue to put you in a good mood, seriously, tender claws, you can suck my wallet dry at the rate of these amazing games you made, first VVR hooked me, now this?!? You have severely outdone yourself and I hope you continue to do so!!\n\nHelpful | 1", "trobe211Jan 12 at 10:28 PM\nMost Unique Game\n\nOne of the most strange and amazing game I have played. Played with a couple of live actors who were hilarious and brilliant. Already spent a couple hours in the multiplayer area without doing much of the singleplayer.\n\nHelpful | 0", "PiR8_BTYDec 20 at 12:32 PM\nA Master Class of Video Game Design\n\nThis game is exactly what the majority of video games should comprise of: Turning your pre-conceived notions of the world and flipping it on it's head. It's witty, intelligent and isnt afraid of taking itself too seriously. The video game industry as a medium has been stagnant for quite some time and this game helped restore my faith in a more creative future.\n\nHelpful | 3", "james.mendrick.7Jan 2 at 4:11 PM\nGreat game but wheres the multiplayer ?\n\nThis is a great game with lavish visual effects and impressive environments. The level of detail and interaction is top notch. I bought 2copies for my son and myself since the advertisement said it was multiplayer. Weve both been playing for a few hours and cant find any friend invite button. Other than that, this game is a very enjoyable experience.\n\nHelpful | 0\nDeveloper ResponseJan 4 at 11:10 AM\n\nThanks for playing! The Under's multiplayer is more of the anonymous Journey style multiplayer where you are paired with other players across the world. That said, If you and your son both enter the desert space around the stage venue at similar times there's a decent chance you'll be paired into the same instance of the experience.", "Blitz_kriegJan 2 at 9:57 PM\nOutstanding Experience\n\nThis game is incredible. When I first played I saw an oldish lady with a cat in her lap and she was sitting on a wheelchair. She told me to feed her cat and then other people started surrounding us and we played baseball and I batted with a giant broomstick. After that i tried out the story mode and it was a very interesting story, nothing like i had ever experienced before. After playing the story for a while I got a little bored and went back to the main area and went to the bar area. I wandered around and watched performances etc. then got bored again.\nThe only reason I'm giving this game a four star is because I found myself getting bored a lot. Once you beat the story the live actors are really the main focus of the game. Dont get me wrong, this game is well worth the price. I just dont think its a game you'll play for hours on end.\n\nHelpful | 0", "NokkturnalNov 19 at 2:19 PM\nWow, Just wow\n\nI have only played an hour and a half give or take so far. I ran into what I could only assume were other people and had some fun interactions as we explored the dream like place we were in. I also encountered an actor which was absolutely amazing. She felt like an npc but reacted to everything I did. This is what VR is about. The most immersive I've been in a VR title bar none! I really hope the live actors stick around or appear on certain occasions. Easy 5 star game from me! I can't wait to dig in even more very soon!\n\nHelpful | 18", "Adam793Feb 2 at 8:02 PM\nHold up, what?!\n\nThis game is just so mind blowing! I have played for about an hour and I have no idea what is happening, but I love it! I love the movement options, the teleportation technique is very interesting, but I definitely love it more than others. I cant say much about this game because I havent played a lot, but its a really good game so far and Im looking forward to playing some more. I can tell there is a lot of depth, and prepare to have your mind blown! Dont play this game if you want to unwind and relax after a long day of school/work because it wont help! One thing Im confused in though is are the other people that are with you when you are following the onion spirit, are those actors or other people playing? Or both because some of them look like me ( I think) and some look different. Someone tell me whats going on please lol\n\nUpdate: I moved down to 4* because I have been kind of bored on the time boat section because I can not do anything but watch the people and move around. When the play is finished, do I get to go back to doing magic and having fun? Will update when I finish, but Im having trouble going back in because I am bored with it.\n\nHelpful | 0", "epicsquirrel123Feb 18 at 7:37 AM\nGood but weird\n\nVery good game but weird\n\nHelpful | 1", "iBrewsNov 19 at 7:31 PM\nThis is so so good\n\nI'm having an absolute blast in here and can already tell I'll be spending hundreds of hours here, both for live performers and the premade content. The locomotion mechanic alone is worth the price of admission, then add an incredible world, art style, live performers, puzzles and mysteries to solve, well, you got yourself quite a few reasons to keep coming back. A+++\n\nHelpful | 5", "PicklecatpersonFeb 15 at 10:36 PM\nOne of the best VR games I have played\n\nAddicting, Amazing, and Awesome\n\nHelpful | 0", "CarpeDmtNov 23 at 1:38 PM\nI cried, I laughed, I lost my mind\n\nThe medium of virtual reality was made for this. I am floored. You owe it to yourself to experience this, and do yourself a favor and experienced it soon. Some of the best parts of this may not last very long. I'm astounded that something like this could exist. I'm shaking right now. Please buy this. Support these people, these artisans\n\nHelpful | 4", "TrevambeYTDec 23 at 5:02 PM\nA Pleasant Surprise\n\nHonestly didnt know what to expect going into this game. I had read some reviews and was rather confused and curious. Its now one of my most played games by far. Its full of puzzles and fun. Despite the lack of microphones there are alternate ways to communicate which can assist you in learning throughout the game. Overall a great game that keeps me coming back for more.\n\nHelpful | 0", "LJtheMinerDec 26 at 7:25 PM\nAmazing game with a creative art style.\n\nNo bug or glitch in this game could pull me away from it but there are none anyways. This game completely blows me away. Sometimes its scary, creepy, disorienting and spooky but other times its fun, amazing, silly and all out beautiful. I loved the art style of my first VR game called virtual virtual reality and this completely extends the way that art style is used. I would recommend it to everyone though if you have some issues involving motion sickness it may take some getting used to. I love the in-game musicians that preform in the game. I would like to point out that the intro to the game can be a little confusing but you will eventually get through it if your stuck. If I could rate this game a 6/5 I totally would.\n\nHelpful | 0", "CaminoDiabloFeb 2 at 1:42 PM\nTerrible\n\nPlayed for awhile, confused as hell but guess thats what is supposed to be. Stopped and started again a few days later. Started me off in the beginning. I went through many points that the game could have saved but it didnt . Done with it. Not going through the same confusing stuff just to get back to where I was to start at the beginning again. Not my cup of tea. So money spent and money lost. Hope you do enjoy the game. The graphics are really good but myself I couldnt get into it\n\nHelpful | 2\nDeveloper ResponseFeb 3 at 10:35 AM\n\nThe game begins in the same Mud Desert scene every launch, but once you get to the Under itself (after a 10-25 minute on-boarding sequence), The game saves your progress and the initial mask will bring you straight back to the Under from then on. All progress in the TimeBoat experience is saved continuously.", "CasualPlayDec 21 at 9:06 AM\nOne of the best games I've played\n\nThis game is absolutely amazing! The story mode constantly kept me wanting to know what was next and listening to all the characters conversations to get to know them better was intriguing. The story has many secrets for you to discover and it was a joy finding all of them. My mine gripe with the game right now is sometimes a bug occurs where you may hear one side of a conversation which can be annoying when trying to understand the story better. The main hub area of the game is stunning as well. There you meet other players and get enjoy different performances from the actors. Sometimes live actors can occur as well which caught me by surprise! I definitely recommend this game, it's a must buy.\n\nHelpful | 0", "QuestVROneNov 19 at 5:04 PM\nAn Afterlife More Alive Than Anything!\n\nAfter playing for a few hours (nowhere near finished) I can say this game is one of a kind, it is a story of the after life, the story of the lives of passengers on a ship and a story that seamlessly combines multiplayer and live performances with real interactions. This is an experience like no other. Be confused, be amazed, take the tour and enjoy the show. Don't forget to click and wave!\n\nHelpful | 16", "BurritoGlassesDec 21 at 8:23 AM\nVery interesting\n\nThis is the most interesting concept for a game I've played on my Oculus quest so far. Its a bit confusing at first, but once you understand how certain things work, it gets easier. The ability to grab the world and bend it to move yourself is by far one of the coolest VR movement systems I've seen.\n\nThis game makes you feel like you're peeking into another dimension, and although it feels weird and kinds creepy, it's too interesting to look away.\n\nHelpful | 1", "MilezPerHourDec 20 at 3:52 PM\nPlanned lunacy\n\nGenerally confusing with actual entertainment. The music so far is great. Sometimes instead of slicing the game its nice to just hang out in the bar listening. Dont rush through this game ... take time and experiment. There is lots of content that has nothing to do with the main story... just random strangeness\n\nHelpful | 0", "12vdcJan 22 at 2:53 PM\n12VDC Approved\n\ndiverse endless incredible creative magical Mystikal dark light Aerie one of the most artistic and developed games I have ever seen\n\nHelpful | 0", "JimZMDec 19 at 11:07 AM\nVery unique, but sickening locomotion\n\nThe game is very weird and interesting, even weirder than Virtual Virtual Reality. The main locomotion method is also very unique but hard to control, which made me sick after 30 minutes, while VVR's teleportation method didn't make me sick.\n\nUpdate:\nI prefer the default mode to the teleport mode, because it's more fun and less awkward (because the teleport mode's aiming is linear rather than parabolic like VVR). It's still a little sickening, but moving my arms slower and more carefully helps. I've upgraded this game to 5 stars because it's just too interesting.\n\nHelpful | 0", "EdgarAllenHoDec 19 at 2:06 PM\nStrange in the best way possible\n\nTo date this has been my best VR experince . Rather than talking to other players, you will be relying on hand gestures. It just adds to the magical and mysterious vibe of the whole experience. Towards the end of a hectic day at work all I could think about is escaping to the under. I've been playing a couple weeks, and I'm always in anticipation of what new lores and secrets I will stumble upon or be taught from an actor or another player. If your looking for something quirky and unique, this game is a must have. Bravo to the developers, no doubt they poured a lot of thought and love into this one. Can't wait for the next game these guys make. See u in the under!\n\nHelpful | 1", "S_an_DApr 8 at 7:07 PM\nMore than a game, it's an Experience!\n\nThere are so many aspects to this game, that it's hard to call it a game. There's the single-player aspect of the game, but then there's this whole other world with live actors and other players! It's incredible, you got to give it a try!\n\nHelpful | 0", "dingoflingDec 14 at 10:43 AM\nAlice's Adventures In Wonderland\n\nThis game is great on every level I can think of. Sound, voice acting, understanding(or purposeful not so understood, look, controls. It's all so well done and you see the love in every little detail.\n\nAt first like lost people I was confused, i was on break from work, (working remote for company when i so choose,I usually choose to) decided to use my headset and give the game a try and instantly got vibes from when I worked with Hideo Kojima on Death Stranding, reading GYO. .\nI took more than a 30min break when I played I was so enthralled and \"in it\".\nThe thing is it is so smart about starting you off confused and in the dark, even the controls threw me at first, but when I like a few others I've heard from said;\nYou are supposed to be confused. But when the things that make sense start to play a role, you kinda figure it out with reasonable deduction and ya brain. I won't talk anymore potential spoilers, but don't give up if it seems too odd at first.\n\nThe design they went with, to me is art. Its a great style that even in 10 years won't look 'bad' the design of masks... For example seem something from a time gone by, something sacred and ancient. Its impossible to explain VR let alone these things but it is just, gorgeous.\n\nI have so much appreciation and respect for development teams like this one. This game/experience/connection is art you engage in. Thank you for creating such a great and wonderful game. Its like putting yourself in the mind of a creative and I can go on and on. It isn't easy making a game so 'this' style game, let alone make it feel like it was made without the intention on just making a buck , it was obviously made because a team had heart.\n\nThank you for putting this into the world. As well as other creations you grabbed me into.\n\nHelpful | 2", "wescotteDec 1 at 11:24 AM\n\nThis game has a lot of depth and replay value. If you're the type of gamer who enjoys exploration and minimal direction this is your game. The atmosphere and art direction is among the best you'll find in a Quest game.\n\nThere are really three main parts to this game. An \"introduction\" that is more linear puzzle solving, The \"Time Boat\" which is like a immersive theater experience. The multiplayer component that involves watching prerecorded and live skits and total exploration.\n\nThe introduction will take you anywhere form 15 minutes to an hour. The time boat will probably take you 5-10 hours and the multiplayer... Well, I'm about 5 hours in and not sure if I'm just getting started or close to uncovering most of it's secrets.\n\nMultiplayer is interesting in that you randomly encounter other players and sometimes live performances. You can't talk (the actors can though) so you have to be creative with your communication.\n\nThe lighting and atmosphere is top notch for a Quest game and gave me a sense of presence I've only experience on PCVR thus far. I'm really really really impressed with this game.\n\nMy only disappointment is the lack of facial animation during the time boat. The MC has some elaborate scenes when you enter the time boat but after you do it a dozen times they just run out of material. I wish they were used more sparingly so it didn't feel like they just ran out of content. Lastly, some of the puzzle mechanics of the introduction were not really given a proper evolution when revisited throughout the \"Time Boat\" portion of the game.\n\nHowever for the price of this game I'm really just nitpicking. There is an amazing world and an insane amount of content here. One of the most unique gaming (VR or otherwise) I've had in a long time.\n\nHelpful | 3", "mrharbFeb 1 at 12:45 PM\nExcellent\n\nFirst VR game I played where I got totally immersed. Highly recommend.\n\nHelpful | 0", "daniel.landa.737Dec 17 at 6:53 PM\nWasnt sure if it would be worth it\n\nThis game is VR at its very best. Every moment was eye candy, every interaction was one ill remember forever.\nSTOP READING THESE REVIEWS! BUY THE GAME.\nMy one complaint would be that i went on a tour and maybe it was a system issue but i was asked to rate 1-3 snaps. I snapped a million times and the actor only heard 2! I was so sad after how hard he worked and how much i was in tears from the laughs. 10/10 experience. A huge bow to everyone that made this and you have my money guaranteed when your next project releases.\n\nHelpful | 0", "RageCage312Dec 26 at 11:06 AM\nWow\n\nIve been digging and digging in this game and I have finally saved Gerald (thank me later time)! Honestly this game is great if you get play for an hour you are going to be confused but please play for an hour! Heres a tip look at the menu when your picking an act! Have fun!\n\nHelpful | 0", "NickMajoraJan 2 at 10:19 AM\nNo strafe? (Updated)\n\nI've been waiting for this game for a while, it seems very intriguing. Why does my left stick snap turn instead of strafe? It's making me very unwell between habitually triggering it when trying to strafe and also accidentally activating when trying to walk forwards.\n\nI couldn't find an option to change it. I'd love for you to fix it or at least add it as an option so I can comfortably play the game. I'm very interested in this new type of experience.\n\nEdit: So I've checked back in to the game and strafe has been added! It makes for a much more comfortable experience, thank you devs for listening. My updated impressions are that I really appreciate everything that this game is trying to do; theatre, real-life actors, multiplayer, mystery, puzzles etc and how different and unique of an experience it's trying to be.\n\nBut I just don't get it. It seems a lot a people do and maybe the game is perfect the way it is but if I could change one thing it would be to allow there to be an obvious core game of objectives the player could work their way through in the beginning. This would pull people into the game world while allowing the mystery of it all to exist in the background until mid to endgame once players have gotten the hang of things. As it stands now it just all feels too obtuse.\n\nHelpful | 3", "KaspizauslJan 8 at 12:57 PM\nComplete waste of time and money\n\nGo outside and meet real people. Stay in your room and play vr games. Watch vr youtube videos. But do not buy The Under and stay there too long. Nothing really interesting will happen. I do not know what the 5 star voters had in mind but I am very happy I escaped this \"experience\". The very first money I regret having spent on vr.\n\nHelpful | 4", "kilo247365Dec 14 at 5:59 PM\nThe Under Presents...\n\n...The Twilight Zone. Rod Serling would be impressed; I know I am. Yet another mind bending experience from the creators of Virtual Virtual Reality. Time-warping, creepy, exhilarating, immersive, and clever beyond compare. No need to read reviews of the next Tender Claws release, I'm just buying it. Fork over the $20 and dive in, you won't regret it.\n\nHelpful | 1", "SnoopwinkleDec 18 at 5:14 AM\nLovely!\n\nEver since i first played Virtual virtual reality I wanted to see more of what this development team can do. As soon as i noticed this game for Quest I bought it and didn't regret it. It's a great, magical and surreal game with an art style and atmosphere that made me think of Grim Fandango a little. And that is by no means a bad thing. I also encountered 2 live actors already which is really something special! Highly recommended! Thanks Tender Claws!\n\nHelpful | 0", "yeboi22Feb 10 at 9:31 AM\nIncredible\n\nJust awesome Bruh\n\nHelpful | 1", "akeslerNov 30 at 10:01 PM\nInnovative Title Worth Checking Out\n\nThis game has a lot going on that, after figuring out what it was all about, I'm still not sure if I really enjoy some aspects. So, I can't speak a great deal about the single player mode, as I have yet to sink my teeth in too deeply to the time boat. It appears to be, a limited interactive play with a few puzzles and some neat mechanics sprinkled in. Obviously, as many in the reviews have mentioned, the real visceral fun is to be had in the lobby with the other players. The live actors, special events, and what I assume are non actors in varying skins bring a great deal of life to this world the devs have created. I'm grateful to have gotten the opportunity to experience this title and I commend the devs for their bravery and creativity in going into this untraditional project wholeheartedly. Thanks guys!\n\nHelpful | 2", "FenyrirMar 23 at 5:34 AM\nYet to finish\n\nI haven't finished it yet but it's already loads of fun, interacting with randos in the under sandbox area is really amusing. The main story is engaging though I still don't understand the point of picking up objects, I'm sure there's a way to interact with the npc's but have yet to learn that. This game reminded me i wish the quest had some kind of trackable belt so as to show my hips moving, imagine dancing in game where people can really see your moves. Sorry just keep hoping for more stuff like that.\n\nHelpful | 0", "RealityKing11Feb 7 at 4:15 AM\nLoveee it\n\nInteresting little mystery\n\nHelpful | 0", "MeowformebabyNov 19 at 11:01 AM\n\n\nMagical experience. Ill be back to write more after I complete it completely.\n\nHelpful | 24", "dparis3Dec 12 at 5:11 PM\nWonderfully Weird\n\nThe game is just obviously made for VR. It takes you to a totally different world in a way another game wouldn't be effective at. Its got two different sides: one part for just exploring and enjoying the environment with some interaction with other players and another that's an interesting look into a weird and compelling story. Get this game.\n\nHelpful | 1", "hargisssDec 12 at 4:22 PM\nA True Adventure\n\nI love how The Under Presents takes things slow. It's got an incredible amount of content and plenty to show you (for it's a game about showing not telling), but it has plenty of quiet moments of mystery to take it all in and contemplate the games enigmatic world. The Under Presents starts cold with little explanation, and has a great deal of respect for my intelligence and imagination. Playing it, no matter how lost I am, I feel I'm in very good hands. One of the select few games that leaves a sincere and lasting smile on my face, a quality more common in books than games. Playing it is truly an adventure. It's now one of my all time favorites, and I'm nowhere near finished.\n\nHelpful | 2", "bmkippNov 27 at 4:58 AM\nAmazed\n\nI dont usually review games but this one deserves it. It's a huge game that is extremely well done. Unique is an understatement and you'll feel yourself enveloped in this surreal world in no time. Not going into details but just wanted to give a big appreciation to the developers and thank them for making what very quickly became my favorite game in this genre, on the quest.\n\nHelpful | 2", "EnchillamaDec 6 at 11:13 AM\nOMG...\n\nThis is the strangest, and most awesome experience Ive had in VR. Met up with some fellow players, who with all of our help, opened up a secret tunnel. After going through the tunnel where there a bunch of trees and a wishing well, one of the people appeared in our world and started talking to us. We said a big wish together, gave hugs, listened to her talk about the world. Totally unscripted. Blew my mind! Highly recommend for someone who likes to get lost in a VR world, and uncover secrets.\n\nHelpful | 3", "kem423Dec 11 at 5:47 PM\nTheater, television, charades, FUN\n\nThis is such a great, kwirky, strange, magical and creative experience.\nThe mixture of watching a show from multiple vantage points, interacting with live players through pantomime and snapping of fingers as well as the interjection of the occasional live actor, makes this a truly enjoyable experience.\nHours and hours of gameplay. It is so fun to just wander and experience the environment. Its easy to lose track of time teaching others what I have learned as well as learning from them all through snapping of fingers and creative communication.\nThe main story is soooo odd and engaging.\nGet this game if you want a truly unique experience that currently you cant get anywhere else.\n\nHelpful | 1", "BroMeisterGeneralJan 20 at 3:14 PM\nCunfuzled\n\nVery confusing. I didnt even know what I was doing. It was a recommendation from a friend but i didnt even know it was multiplayer until what i thought was an npc started acting strange. Dont know how I feel about it yet.\n\nHelpful | 3", "parrott1963Jan 4 at 6:53 AM\nTotally confused\n\nIve read the reviews and thought I would try this game , like other players I was totally confused for the first 20 mins and now Im even more lost and have been wandering around in rooms for hours with nothing happening or just reproducing /spawning\nIm obviously doing something completely wrong any suggestions welcome .\n\nHelpful | 3\nDeveloper ResponseJan 4 at 11:07 AM\n\nHave you made it onto the ship yet? Send us an email with more info on where you're at to info@tenderclaws.com and we can happily point you in the right direction", "Sketchy_AnonDec 5 at 2:54 AM\nLive Acting!?\n\nTender Claw, you have thrown me way off! I didn't expect live actors and actresses to appear in the game! That is absolutely incredible. Not only that, but since the players don't have access to voice chat it gives me an opportunity to flex my charades ability and I love it! This is amazing! You guys are amazing! The ones behind the scenes are amazing! You all deserve a round of applause for this amazing work!\n\nHelpful | 3", "panthemusicalgoatDec 11 at 12:45 PM\nAmbitious Masterpiece\n\nUnbelievable. I was hesitant this would be a gimmick game but it's genuinely both an incredibly unique game and art piece all at once. Has aspects that remind me of David Lynch film or just dream logic. Seems reasonably long as well compared to other games and the sense of live presence with actors and other people adds so much to an already incredible experience\n\nHelpful | 0", "jackaboi.taysirtmDec 30 at 3:55 AM\nBest experience in VR\n\nI was entranced the moment the game started up. I've spent around 5 hours in the game already, and haven't even started single player mode. My only regret is not getting this sooner!\n\nHelpful | 2", "ken.hutchJan 30 at 12:16 PM\nFeels like a thrown together mess\n\nWhen I try this game again, maybe something will change. My experience was playing for a few hours that were odd but enjoyable and then being on some stupid ship game where nothing made much sense. I look up what I should be doing on youtube and reddit for that part of the game and realize just how tediously stupid and boring this game is going to be. The point is going all over the ship rewinding and rewatching crap over and over again to find a handful of things to change to correct the end output so the least amount if people die. Hours of watching the same crap dialogue is extremely boring. I see nothing that makes me think there are real actors here either, I think people are getting a bit delusional on that aspect.\n\nI enjoyed Virtual Virtual, but this one seems like the game is a bit to conceptual and not really all that fun.\n\nHelpful | 1", "patrick.abadiDec 22 at 2:18 PM\nJust magical\n\nI cannot say enough about this game. There are so many layers to uncover and enjoy but you need patience and a playfully curious mind. Time shifts, live actors, puzzles, and multiplayer. Thank you for this amazing VR experience.\n\nHelpful | 1", "coolgatorJan 11 at 7:36 PM\nA fantastic hard to explain game\n\nIntriguing story, fantastical and surreal world, and an amazing aesthetic. Really makes you realize how much humans can express purely through body language \n\nHelpful | 0", "PunisherDec 8 at 8:10 PM\nLoved it\n\nBought the game after getting a good vibe from reading some reviews. Figured I could always refund if it wasn't for me.\n\nDecided to keep it and have probably enjoyed it for like 20 hours up till this point. I can see how this game wouldn't appeal to everyone but when it does to you, this is a great game at a great price!\n\nHelpful | 1", "claude.midgleyDec 8 at 4:12 PM\nSo much depth\n\nI wont ramble on too long, because youre going to need the time to purchase and install this (game) world asap!\nEvery time I play The Under, I find new places, learn new tricks and figure out new details. It seems like the developers are working on additional games within the game too, so it can only going to get better as more people buy it and fund the updates / upgrades.\n\nHelpful | 0", "Ommmm_2486Jan 23 at 11:36 AM\nGreat experiment\n\nWas definitely impressed with the live actors and performances. But to me, the world and story were confusing and boring. Not my thing, but I am excited about how Tender Claws is expanding the boundaries of VR story telling. I dont think anyone has figured it out yet\n\nHelpful | 1", "Bizzy-LizzyDec 24 at 10:47 PM\nBest and weirdest game\n\nI'm not sure if I can call it a game. Its more of an experience. There are live actors that interact with you and put on shows. It does take time to understand what is happening but once you do then the magic starts.\n\nHelpful | 2", "ZMan9Dec 9 at 3:37 PM\nThe Most Ambitious Crossover in VR\n\nThis game is a crossover of the peace and quiet of single player games, the interactions of a multiplayer game, and the fun of a live performance (in which you participate). I love the storyline, it is filled with twists and turns. And you never know what happens next.\n\nHelpful | 2", "scott_totsDec 31 at 8:38 AM\nAbsolutely insane\n\nThis is the most mind boggling game Ive ever played. Its very confusing but in a way that makes the game incredibly fun and extremely immersive. Highly recommend.\n\nHelpful | 1", "Awesomefox555Dec 4 at 8:16 PM\nA barren wasteland pulsating with life\n\nThis game is so cool! Every movement, game mechanic and thing you are able to do is both amazing and confusing, every character is entertaining to watch and the multiplayer thing is awesome and in line with this inter dimensional bar, I recommend it to the moon and back, great job tender claws! (And pie hole)\n\nHelpful | 1", "skinnyt695Dec 4 at 5:02 PM\n\"A MUST HAVE VR PUZZLE AND ADVENTURE\"\n\nAbsolutely  Love this Game! It's so full of Mind- bending, Funny Confusing Twists, Hidden Clues and Amazing Graphics, plus it's Multiplayer! So you're not alone feeling lost in a World of AI Bots that are limited to their response due to code! You could literally spend hours upon hours playing this game! A Must Have VR Experience that you won't regret buying! \n\nHelpful | 1", "tuismNov 20 at 7:19 AM\nLove it!\n\nTender Claws, the dev of The Under Presents, are masters of narrative VR experiences. They break the head with each release (Virtual Virtual Reality before this) and they're all not to be missed if you like existential, weird experiences unlike the run of the mill wave shooters and action games that dominate the mainstream. Heck, I hope this kind of stuff (along with quality) start dominating the mainstream!\n\nHelpful | 2", "AidanTargaryenNov 19 at 6:04 PM\nImmersive theatre meets VR\n\nAs a lover of immersive theatre and VR storytelling, I've been waiting for something like this, and in my first hour or two it definitely delivered what I was hoping for. I've already had several WTF moments, and can't wait to keep exploring. The narrative is fascinating to go through, and the experience I had with a live performer and a few other participants felt so live and unpredictable. Highly recommended.\n\nHelpful | 8", "Jza16Nov 19 at 9:55 PM\nWow.. just wow.\n\nThis is just something you have to experience for yourself. You are going to be confused at first... but that's ok, you're supposed to be. The moment I realized what was happening a few times you get that \"a-ha\" feeling like I've never felt before. And the fact that you can actually BE part of the show with other players and live actors performing is just unbelievable. I suggest getting to this game quickly as the live actors are only supposed to be around for the first 4 months after release. I have a feeling they'll bring a new group in at some point but the interactions with the actors is a must- experience kind of thing and they are only guaranteed to be around for those first 4 months like I said. Great job on this one guys... the most unique VR experience to date as far as I'm concerned.\n\nHelpful | 8", "STL.ShooterNov 19 at 5:47 PM\nPure Magic\n\nTender claws has done it again with a true spiritual successor to my favorite VR title VVR. This game melds rich story telling with live actors who guide you on little adventures, while inside a larger wonderland. Interaction and exploration with other players while meeting real actors and discovering new experiences around every corner has redefined what VR can and should be. This game alone will sell more quests, it's the killer app we've been waiting for. Tender claws, thank you so much for bringing such a joy into existence!\n\nHelpful | 8", "Dominator740Jan 10 at 9:52 AM\nAmazing and unique game\n\nI love this game Ive spent about 3 hours in it and I love the puzzles and community that has formed around this game\n\nHelpful | 0", "engxyoojDec 11 at 10:33 AM\n\nThe puzzles are pretty clever. Especially that first one, it makes you think youre playing with other people but I liked it. The developers just gotta make sure their app doesnt crash. I did have a white screen and it froze. This was during the photo booth part\n\nHelpful | 0", "diiiiiiiiiingJan 17 at 8:50 PM\nBest VR game on Quest\n\nHands down the best immersive experience on Quest, if not VR as a medium. Get it.\n\nHelpful | 0", "edeeteeDec 3 at 12:06 AM\nKeeps on expanding\n\nA surreal experience with a story and layers on top. A masterclass in vr tutorialization.\n\nI've only touched the surface of the game. Exploring around you start to see the depth that exists. Amazing learning from other players and from myself. Absolutely psychedelic experience. Keeping a close eye on this studio.\n\nHelpful | 1", "Dittoman17Dec 4 at 1:15 PM\nKeeping the magic in VR\n\nLeave it to this company to find the most quirkiest way to make things amazing. Snapping your fingers to communicate with other people rather than allowing voice chat is by far the most unique thing they could have done in that aspect. No toxicness or flamming only snapping lol. And the secrets/story mode are amazing. Only thing i would change is add more interactables and maybe just maybe some hidden secrets or tasks you could do to get different masks besides beating story mode : )\n\nHelpful | 0", "justmarion18Dec 17 at 7:08 PM\nLove it!\n\nI honestly still have no idea what Im supposed to be doing, or the overall story for that matter, but I cant put this game down! This game is one of the most intriguing & entertaining games Ive played on the Quest! Thanks!\n\nHelpful | 0", "Twilight_ZoneMar 21 at 2:51 PM\nSeriously, Just Do It\n\nThe totally mysterious lure of this game has me smiling every time I put on my headset. This is my first review and rightfully so, because this game deserves an amazing rating. Great job to the developers on this one! Just keeps me excited about VR.\n\nHelpful | 0", "nate.hoodsieNov 19 at 5:14 PM\nIf youre hesistant, buy.\n\nOh my god, I was excited to hear that it popped up out of nowhere on the oculus store and bought ASAP. When I got in, I was super confused. What am I supposed to do in this weird area? I here people and music but theres no opening to this bar. Once I found everything out, I just sat in the live/pre-recorded music area and chilled. I met some awesome people who taught me some mask tricks and the actors were on point (though I hoped for more human interaction). A great concept worked out into a great game.\n\nHelpful | 7", "wozzy72Nov 22 at 12:39 PM\nDisappointing\n\nI would have rated this 5 stars my first hour or so of playing, just for being very very unique. Now after 3 or 4 hours I kinda wish I could get my money back. Areas to explore, with absolutely nothing going on. I don't need \" actors\" hounding me to take my mask off and make onions appear. I was expecting entertainment in the bar area but it's just a few loops and people making onions.. I went from thinking it was one of the most amazing experiences to thinking it's incredibly stupid and an utter waste of a great concept.\n\nHelpful | 17", "lemon222Jan 4 at 2:28 PM\nThis is amazing\n\nI love this game so much life met so many people on this and can spend hours apon hours in this game and have only scratched the service\n\nHelpful | 0", "JustAnimatorNov 28 at 4:01 PM\nIm filled with awe\n\nThis game is absolutely amazing, its hard to explain why its so amazing, its got a big story, and a multiplayer hub. I would love if they made more shows alongside time boat in the future. There are a few glitches related to the captain, but if I say anymore I could spoil the game for someone else. This game is a must have, anyone with a quest should have this game! Thank you tender claws!\n\nHelpful | 2", "Copenhagen_Nov 30 at 1:55 PM\nGet it\n\nMultiplayer is so much fun. Communicating through hand motions and snaps is a blast, and meeting REAL actors is really cool. The story is pretty good. It's not as great as Virtual Virtual reality, but it has its own spin. Just get the game. I'm really hoping that it gets updates and new masks are added. There's just so much potential.\n\nHelpful | 1", "BLZDPraetorianNov 20 at 6:29 PM\nTHE UNDER PRESENTS!\n\nA happy customer! Haha. My first interaction was very immersive! The bar is a real nice touch as i can take a break from the story and just goof around with everyone! The story is amazing! Like im watching a show, reading a book, and being a god! Haha! Its truly amazing how this team of devs brings magic to the VR world. Im truly thankful for there efforts, and i will easily rate this a 5 star experience as i have had so much fun already, but barely gotten into it. Easy! 5 STARS!  \n\nHelpful | 6", "PW15UzDec 3 at 1:15 PM\n\nTried this only because of good reviews\nSo far 2-3 hours playing still waiting to be amazed am totally at a loss as to why has received such high ratings\nMaybe it is amazing but if after couple of hours of pointless wandering around and clicking fingers still waiting for a wow moment maybe I am missing something?\nSeems totally pointless\nMaybe if something incredible happens will update reveiw but think will have lost the will to live by then\n\nIf a game cannot grab you in the first hour seems to be a loser\n\nHelpful | 10", "larsonmattrNov 28 at 8:42 PM\nI love the Under Presents\n\nIve played this for about a week and it is probably the most original VR game I have played. I really love this game and as a developer appreciate all the details. Particularly I like the animations and the new method of locomotion, but also like how the game feels deep with surprises.\n\nHelpful | 2", "mayacowanDec 1 at 11:15 PM\nNot that far but it's the best\n\nThis is my favourite VR experience since virtual virtual reality. The first little but confused me, but once getting past that im enthralled. It doesnt hold your hand as much as VVR (in that it truly just throws you in with no concept of what's going on, and you have to figure it out), but it's totally as much fun, if not moreso.\n\nHelpful | 0", "jeremy.holbrook.925Nov 21 at 10:07 AM\nOut of hand!\n\nFirst off let me Begin by saying that I have played a lot a VR games. I can only say that out of 50 or 60 titles, only three or four (including virtual virtual reality) I could truly call an unbelievably magical experience. I've spent three intervals over three days of approximately 2 hours a piece in The Under, and I have to admit that each time was entirely unique from the last. The live acting at times and random other users wondering about trying to figure out the mysteries of the under, is a touch that makes the game. Beautifully rendered, and as many Easter eggs if you care to search for! Thank you Dev's for this game! So much love!\n\nHelpful | 5", "GooblyMcfryNov 22 at 8:33 AM\nGreat\n\nAs others have stated more than I ever could this game is great. Ive only faced some minor problems such as no strafe and after using poison to get to the island and go back to the desert the world is at a tilt but those are just small problems. This is the first social experience Ive loved with all my heart. The lack of talking and trying to communicate with snaps and movements is really great. The way of movement is so fun it feels great. And I loved the live interactions Ive only had one so far and my WiFi cut out during it but it was a great experience. If your looking for a fun and at some times confusing time get this game.\n\nHelpful | 4", "CasualCheetahNov 27 at 8:31 AM\nWonderfully and Intensely Bizarre\n\nIn magical sense, it's easy to get lost in the puzzle that is trying to understand this game and the flurry of secrets it holds. The Under Presents is quite the curiousity and it's offered me plenty of unforgettable moments that are impossible to explain to non-VR people.\nGood stuff Tender Claws \n\nHelpful | 1", "oliactivateNov 29 at 3:12 PM\nMy favourite game so far\n\nIve played this game 4 times now and each time has been a completely different experience. Just when I think Ive discovered everything some other player or actor takes me on another journey. My girlfriend gets annoyed because she can hear me laughing so much. My favourite game so far. It reminds me of immersive theatre.\n\nHelpful | 0", "JeffisdeafNov 27 at 6:57 PM\nAmazing on all parts.\n\nThe actors and the developers deserve so much more praise than theyre already getting. Taking the time out of their day to help players or give them a genuine experience is phenomenal and Ive never heard of a game that would do that. Thank you everyone who was/is involved, you make the magic happen almost effortlessly.\n\nHelpful | 1", "InUrDeadSpaceNov 30 at 7:32 AM\nStop Reading NOW! A must experience!\n\nThis is seriously the most revolutionary innovative VR experience you have ever tried. They took the idea of immersive theatre and delivered a VR experience that could not exist any other way AND added a whole multiplayer emergent play experience with live actors and other players.\n\nHelpful | 1", "boroboymattNov 26 at 5:50 AM\nMind=blown\n\nIt's funny, because I've mostly played this with other random players. I've only experienced one actor, but it seems that the players are starting to fill that role already in their own silent way, and I wonder, if that was the intent of the developers all along. It's like stepping into the afterlife and meeting others in the same difficult spot or like meeting your spirit guide for the first time in a new dimension...this game leaves me lacking words to describe the feelings it imparts to its players. If this is where VR is heading, I dare say we are all in for a wild ride!\n\nHelpful | 1", "Chicken_Of_EggNov 28 at 3:58 PM\nMy new favorite Quest game\n\nHad this game just have been a visual novel, I still would be giving it 5 stars, because it was just that well done. Every puzzle that comes up is something I had never seen done before. Ive spent hours in the multiplayer lobby alone because even that it full of things to do. For only 20 dollars, this is the most value I have ever gotten out of a vr game.\n\nHelpful | 0", "CommanderGoblinNov 20 at 5:49 AM\nIf Tacoma and journey had a vr baby.\n\nIf you loved Tacoma and journey, you will love everything about this game. The actors did an incredible job with Time Boat. I do wish I could change my position when I find a conversation I wanna watch instead of navigating the entire ship on foot. But other than that its perfect. The area where you meet others is set up like a bar theater. It loops some prerecorded songs and dancers and I even saw a live actor! Definitely worth the price.\n\nHelpful | 4", "DickDastardlyDec 5 at 9:25 AM\nWorthy successor to VVR, awful controls\n\nThe Under Presents retains a very similar dreamlike art style to Tender Claw's previous title, the fantastic Virtual Virtual Reality. Environments and characters are excellent and there's an intriguing story with great dialogue and some wonderfully bizarre acts.\n\nHowever, all this is marred by a truly awful control scheme. There's a technique they call \"scrunching\" which basically involves reaching out and grabbing the world (with the A button) and pulling it towards you. The warping graphical effect which accompanies this is very cool, but as a movement method, it's imprecise, unsuited to small movements and immersion killing.\n\nThere's also stick locomotion, but the worst implementation I've seen since Oculus Home. Instead of strafing, pressing left or right on your left stick rotates you so every time you press that stick sideways to sidestep round something (as you've been conditioned to do by decades of ingrained muscle memory) you instead get a sickening unwanted rotation of your view. (And having rotation on both sticks is totally redundant).\n\nAt least forward and backward on the left stick (kinda) work. Unfortunately they're head rather than controller relative so if you walk forward and glance around whilst doing so your avatar will stagger drunkenly from side to side.\n\nThere's also no option for smooth turning (or even true snap turning). Instead there's a hybrid system which combines the worst of both. Moving either stick to the side turns you a fixed 45 degrees (at a fixed speed) so you don't have the full control and immersion smooth turning gives you (where you dictate exactly how fast and how much you turn) but you still have the mismatch between the lateral visual flow you're seeing and your inner ear (which snap turning eliminates).\n\nLast but not least, there's no seated mode, so if you play seated you'll do so as a midget.\n\nPlease fix this, devs! I want to enjoy your awesome experience (while the live actors are in it) but the controls just ruin it.\n\nHelpful | 1\nDeveloper ResponseDec 11 at 2:06 PM\n\nHi, glad you're enjoying the game! We put a lot of thought and design into a unique locomotion and prefer the default mix of scrunch and non strafing joystiq. We realize that's not everyone's cup of tea, however, so feel free to use VVR style teleportation, or newly adding strafing both found in the left controller menu button.", "CreamOfYeetNov 19 at 1:29 PM\nAn experience unlike any other!\n\nI just finished my first session with this game, lasting about 3 hours. I have only begun to crack the surface of this enormous game. This is a steal at 20$, do yourself a favor and dive into something brand new!\n\nHelpful | 13", "rossbaronukDec 24 at 9:39 AM\nStand out VR experience\n\nI bought this on a whim on Christmas eve. It's a stand out VR experience and exactly the kind of game I love. Thanks for the awesome creative ideas! Truly original.\n\nHelpful | 0", "ArnookieNov 21 at 8:27 AM\nThe most intriguing game available!\n\nThe creators of this game have really outdone themselves. The interactions and live actors make this game a real gem. Get confused you are supposed to! The confusion is what makes this game. Entering a world were everything seems so twisted and fun in such a way that you will just want to keep coming back. A real vr gem that I can say will give you hours and hours of gameplay and re-playability. You really need to experience this to know what I mean. The developers have thought long and hard about what has been put into this game and it just works so well. So far this has been the ultimate VR experience for me and I could not rate this game any higher. 5 stars plus all the way. The live actors add to the experience and although at times it's hard to tell who is a live actor and what is Ai is just incredible. If you buy just one game make it this! An incredible experience with dream like interactions and excellent gameplay. You have to grab this game! Well done to the developers. \nReviewed by ArnookieVR. \n\nHelpful | 3", "4RT1F1C1ALNov 23 at 7:29 AM\nUnique VR Experience\n\nTender Claws blows my mind every time. VVR was one of my first VR Experiences and I thought nothing could have topped it. I was wrong, The Under Presents is very different from VVR, but it still has mind blowing experiences. The live actors make this game very memorable to me and keeps me coming back to this game. I find myself thinking about The Under whenever I'm not in VR. This game is going to be very memorable for me.\n\nHelpful | 2", "Soupdogg22Nov 25 at 9:32 PM\nundeniable masterpiece\n\nthis game will actually blow your mind, with all the dream like imagery and unfolding storytelling you'll get lost and completely immersed in this reality that you don't quite know the rules of. The main story requires multiple playthroughs to understand the full story and by following certain characters you'll be whisked away into another unexpected realm. an absolute must buy for any theater fan or those who like unique storytelling.\n\nHelpful | 1", "Studly_McSexfireNov 23 at 4:37 AM\nThe most amazing and unique vr experienc\n\nIve never experienced anything like this in vr or anywhere else. I didnt even know I was communicating with real people at first. The whole game is brilliantly made. The combination of non linear exploration and connection you have with people is unmatched by anything else Ive played and such a personal emotional journey. I find it really hard to explain why its so good. Thanks for this.\n\nHelpful | 2", "nathon.brumleyNov 19 at 8:06 PM\n\nThis is the only kind of story that can be told through VR. Wow what a great job at the story telling, art, dialogue... The travel mechanism to \"pull\" yourself through the world. So much more but I don't wanna spoil anything. I've played for 2.5 hrs only made it through the episode 1 part. Can't wait to play over the next couple of days.\n\nHelpful | 4", "Wynot3Nov 25 at 11:47 PM\nReality crack up\n\nWhen was the last time you made an NPC totally break character and start laughing? The ability to do that alone makes this a 5 star experience. I met a skeleton in the desert and tried to open a GIANT tin can with a GIANT can opener. I failed, the skeleton lost it. The NPCs make me laugh too. I just lost an impromptu dance contest at The Under, the live host was hilarious. When she casually hopped down off the stage in her rolling desk chair I couldnt stop laughing. Pie Hole 4 Eva!\n\nHelpful | 1", "Virtual-LifeNov 27 at 9:38 AM\nAmazing\n\nI've finally completed the game which is surprisingly long if you want to unlock everything. It gives a good sense of exploration and a desire to uncover the secrets the game has to offer. It had an amazing social experience which has other players meeting in a hub that has secrets to uncover, music and on occasion live actors. It's a very ambitious game that has succeed on all counts and is a must buy.\n\nHelpful | 0", "zack.slotkowskiJan 27 at 5:49 PM\nDid not like much\n\nSuper confusing and to be honest, it gets really boring. I dont know what all the hype is about. Most the time it is just me walking around aimlessly.\n\nHelpful | 2", "SaebnockDec 11 at 3:19 PM\nWhat an experience\n\nI've just met a live actor with 3 other players and I can't stop thinking about it. This game is magical and it's such a joy to interact with other players.\n\nThank you for showing us what a VR game can be capable of.\n\nHelpful | 1", "JioxxNov 24 at 6:59 AM\nThe Strangest Experience\n\nI never write reviews shortly after getting a game, but I have to make an exception for this one.\n\nI just bought it this morning and I spent about a half hour in it so far. It was the strangest half hour of my life.\n\nI'm in love. :)\n\nIf being tossed into a mad world to be mesmerized and baffled sounds like something you'd like, I know of no better way to accomplish it than The Under Presents. Prepare yourself to go through the Looking Glass, buy this, then step through.\n\nI probably won't expand on this review later since explaining the game would destroy some of the discovery.\n\nHelpful | 1", "Dryce5Nov 22 at 11:22 AM\nMystery and magic.\n\nThis game is such Mystery. The good kind of mystery. I've played for around two hours and still don't know what I'm doing: this could easily be a negative, but no, this is a very big positive in the game. The atmosphere is so unique, and the interactions with the actors and other players make it a wonder to explore. The magic system in the game is so subtle that it makes you want to learn with others new magic tricks.\nBuy it and get lost in this world, you won't regret it.\n\nHelpful | 2", "PulverToastDec 2 at 12:49 PM\nTruly a Masterpiece\n\nI'm a gamer since at least 20 years. There are not many games that realy stick with you (Undertale, the journey, Limbo, Factorio, ...) . But the under presents is definetly one of them.\n\nWhen you are on the fence, go for it! And don't spoil yourself! Just go for it!\n\nHelpful | 0", "VirishiiDec 11 at 4:52 PM\nInventive and detailed\n\nThere are tons of interactions, live events, secrets to discover and elements of social interaction that make this game truly unique. The mechanics of the game are without a doubt the most unique experience I've had in VR\n\nHelpful | 0", "NinjatogoNov 27 at 9:21 PM\nABSOLUTELY AMAZING PRESENTATION\n\nI had no idea what to expect since everyone said to just go in blind, but I'm very glad I did. I've barely played it, but after just 30 minutes of play, I felt like I experienced something really special. This one is going to stick with me for a long time. Thank you Tender Claws!\n\nHelpful | 1", "CentimillionsNov 23 at 10:22 PM\nSo impressive\n\nWhat a great game! After 10 minutes of playing me and a few people found a ghost actor and it was great! We walked around a garden and skipped rocks at a lake. So beautiful, the actors are amazing. I also did this when it was 11 PM so I can not wait to see everything in the active day! Love the game.\n\nHelpful | 1", "spierceocNov 24 at 12:11 PM\nBaffling\n\nUpdate- To give it a chance I played right through to the end of the epilogue. i must say it was a massive waste of time. Nothing cool happens, its a poorly animated 'play' which you observe like a ghost, you take no part in it. The time thing hardly matters, in fact it doesnt. The story is banal, the characters faceless, literally.... its not a puzzle game. The theater section doesnt develop, you essentially pointlessly conjure onions and try to work out if the conjuring plays any meaningful part in the game,,, it doesnt. The only money ive spent on teh Quest that I regret.\n\nI bought this slightly on a whim as I read a couple of rather high minded intellectual reviews. Im a bout 3 hours in I suppose. The theater portion of the game is actually crap. the most fun being myself and another player (real person) simply throwing stuff at the stages in a attempt to make it even vaguelly interesting... it didnt. It would be better and funnier if the real world players could speak to each other and actually be able to discuss how awful it all is. The ship section seems to be where the 'game' itself is. Which seems to be made up of poor cut scenes that you click your fingers to materialise. Its quite hard to hear what they are saying so you cant really follow what is going on. The dolphin seems idiotic to say the least..... I tried to get a refund but couldnt as id probably missed the window. I will give it another go for a couple of hours but I fear I wont get much back,,, other than watching despondent audience members conjuring pointless onions and throwing chairs at the dreadful acts.\n\nHelpful | 22\nDeveloper ResponseNov 30 at 12:36 PM\n\nThanks for playing, sorry it's not living up to your expectations. Wanted to point out one thing, while you can choose to observe the play passively, It's more fun if you attempt to intervene, if you dig deeper, each of the characters can be saved. Also, Gerald is a highly intelligent dolphin, able to recognize and communicate with a wide range of symbols.", "itsbubblessDec 21 at 3:20 PM\nHoly crap\n\nThis is the best game on quest. Hands down. No contest. This is the only review I've ever written for a quest game, and I think it's the only one I need to. Just wow.\n\nHelpful | 0", "KnittelManNov 23 at 1:40 AM\nWow!!! So creative!!\n\nPros:\n-I love the way you move around in here. You can use the joystick or grab and pull (makes sense when you play). Thats the first Ive seen that and I really like it.\n-I love the weird factor. This game starts off super weird and confusing but then you start to get it. And its like OHHHHHH.\n-love how you can choose to interact with online players or not. Ive seen some very funny moments.\n-the whole game feels like a weird dream. I found myself doing the lamest dumbest stuff for super long just because I was having fun or watching random conversations.\n-the team behind this is the definition of creative. We need more people like this making new ideas\n\nCons\n-the graphics are terrible. When there are people they literally have no faces. Everything is very.. bland.\n-even though I had fun playing this, it never really felt like much was happening. Like I didnt feel like I was accomplishing any big goals really. Felt like a time waster game.\n\n\nAll in all its a very fun game. I havent finished it yet but I can tell Im going to. Its creative and unique beyond belief, but I wasnt blown away visually or story wise. Just loved it for the interesting gameplay mechanics really.\n\nHelpful | 8", "Angry_SpiderNov 24 at 4:38 PM\nDont sleep on this game, you deserve it.\n\nwithout saying too much, this game is a truly magical experience. the level of social interaction is absolutely perfect- the players are all so fun to hang out with and the 'others' are a treat. EVERY SINGLE TIME one of them shows up I have had wonderful fun- even when going through the same routine for a second time. This game is a gift and I dont know if I have ever been so thankful that a singular piece of art could exist.\n\nThank you Tender Claws, and thank you Oculus for supporting them. Thank you so much.\n\nHelpful | 1", "LHatzNov 20 at 3:42 PM\nTotally Unexpected!!!\n\nIdk what I expected from this title, but this wasnt it. I just spent over 4 hours in this game and only maybe 20min of that was in story driven gameplay. The rest was spent exploring the desert and miming discoveries with other players. The strange nonverbal social aspect of this game was a great surprise. And the depths that the devs went to in designing this world and everything in it blew me away. A truly trippy experience!\n\nHelpful | 2", "tommy_kNov 22 at 3:01 PM\nAmazing VR Experience\n\nAs a theatre and video game enthusiast this game combines everything I love into one. It is the most unique and interesting VR experience I have ever played and it deserves everyone's attention! Thank you devs for creating something so amazing and I look forward to spending many hours exploring this highly detailed and perplexing world!!!\n\nHelpful | 1", "lewisross421Nov 29 at 5:53 PM\nHonest Review\n\nSo Im a little bit torn about this game because its such an expansive game, and really entertains me for hours, but its also somewhat frustrating. On the plus side, its made by the creators of Virtual Virtual Reality, which is hands down the best vr game ive ever played. They really know what theyre doing. On the minus side, I had really high hopes for this game because of how much I loved VVR, and I cant figure out if its living up to my expectations.\nI dont need a game that holds my hand through every little thing. But I think they may have went too far the other way, with such little guidance, you often wonder if youre even doing what youre supposed to be doing, what youre missing, and if youre on the right track. Having said that, the gameplay is really unique, and engaging, and setting is incredible. Basically my one complaint is that I think they need a little but more walkthrough assistance, or at least access to that for players like me, who probably are dumber than the average gamer.\n\nHelpful | 1\nDeveloper ResponseNov 30 at 12:25 PM\n\nThanks for the feedback! and feel free to reach out if you get stuck or have any questions to info@tenderclaws.com", "mockbulletDec 17 at 8:54 PM\nBlown away\n\nAt first I thought that the actors on stage were AI but when I looked a bit closer I found out that they were phenomenal actors and it just blew me away and can't wait to play again.\n\nHelpful | 0", "FlodahahnJan 25 at 7:23 AM\nNice idea but poor gameplay\n\nYou feel being part of strange disturbing dream. But storyline and gameplay only keeps you excited for 30 min. max... unfortunately.\n\nHelpful | 1", "newrealityNov 30 at 9:21 AM\nNot a game!\n\nI feel deceived by this game. VVR is one of my favorite games and I bought this knowing as little as possible which was recommended. There is no game here, it's some kind of experience. It missed the mark with me and unfortunately it took so long to figure out it was a gimmick I can no longer refund it. I have not refunded a game yet and this one just left me feeling disappointed. Tender claws should be more upfront about what this is. Theres no spoiler by letting people know this isn't a game. It feels like your tricking people into trying to appreciate bad theatre.\n\nHelpful | 8\nDeveloper ResponseNov 30 at 5:31 PM\n\nHi, sorry you're not enjoying the Under. We'd definitely consider it to be a game (It has time puzzles, mazes, exploration, mysteries to uncover, characters to save, multiplayer spells etc.) But our focus with the project was to make something unique that wasn't quite like other experiences, something that blended theater and more traditional exploratory Journey like gameplay. If you're still poking around I'd recommend trying to save all the characters on the ship, each one disappears in the later acts, but can be rescued in what we call their memory labyrinths.", "FuzeMacJan 5 at 10:36 AM\nOne of a kind\n\nAt first I wasnt sure. But this is definitely my favorite and the best game Ive played yet.\n\nHelpful | 3", "KillYourTvNowNov 22 at 10:04 PM\nMust have !\n\nThis game is an amazingly unexplainable experience. If your not into puzzles and feeling confused, or get frustrated easily, then this game probably isn't for you. If you have some time to spare and are wanting to experience something absolutely amazing, get this game. Yes there really are LIVE actors that randomly appear in game. My personal experience was of a customer experience in the gift shop of all places. It was a great scrip with amazing interactions between the 3 of us involved. This game seems to get deep, and I can't wait fo play more. Would give it 10 stars if i could! This is what VR is all about!\n\nHelpful | 1", "doinyamom989Nov 26 at 2:06 PM\nGood game but\n\nOk so I bought virtual virtual reality but refunded it cause I was salty of how short it was and felt as tho it didnt deserve my money cause of how short it was but I did love the game and I enjoy your games and if there are only 3 chapters in the under and NOTHING extra I dont think Ill buy any more of your games because So far theyre always soooo short. Please make them longer, I always feel a little ripped off because of how short they are. Even if there only are 3 chapters in the under I wont refund cause I feel a little bad about refunding virtual virtual reality because I enjoyed that game a lot and felt like I could play it again (which isnt often for me).\n\nHelpful | 0", "lucasbazeNov 20 at 8:07 PM\nI have no idea whats going on\n\nExpect to be extremely confused in the beginning. The game is setup to deliberately for you to try everything you can to figure out whats happening. There are moments in the experience where I dont quite know what I should be doing or how to do it, but dont give up... its worth it.\n\nHelpful | 1", "cmunchkinJan 4 at 7:25 PM\nQuick question\n\nHow do you continue past the epilogue of Timeboat like how do you continue the games story? p:s good game\n\nHelpful | 1\nDeveloper ResponseJan 10 at 8:12 AM\n\nBeyond the epilogue, you can save most of the characters aboard the ship in Acts 2 + 3, save enough and see how the timeloop and epilogue subtly shifts. Or dig into the mysteries of the MC and venue itself by exploring the backstage and desert areas with other players in the Under", "wes.osborne.98Nov 22 at 6:15 AM\nCan only be done in vr ...a masterpiece\n\nThis is an experience unlike anyother you could dream up or write about. It is unique and wonderful and unmatched. Only got through act 1 so far but i can tell you act 1 is worth the cost of admission. There are 3 or 4 acts in this game i think. But it goes so much deeper than that.\n\nHelpful | 2", "HudmasterNov 29 at 5:08 PM\nConfusing, painful and no refund - Avoid\n\nA weird, confusing and painful game. I foolishly believed the reviews about the game, and was very disappointed when I bought the game. I strongly suspect that many of the 5 star reviews are faked. Wanting to get my money back, I requested a refund. The refund request took more than two days to process, and then came back as refused.\nI strongly suggest you don't buy this game.\n\nHelpful | 8\nDeveloper ResponseNov 30 at 12:20 PM\n\nSorry, it's not your cup of tea. We're a small team of independent devs who put a lot of love into our projects and definitely don't fake any reviews. If you get stuck at any point feel free to reach out to info@tenderclaws.com and we're happy to point you in the right direction. All refunds are handled by the Oculus store so please reach out to them for assistance in that department.", "diomarkNov 21 at 8:25 AM\nwow, super-unique\n\nthis game is on a league of it's own.. You can see some of the same art-style as Virtual Virtual reality (which, I loved, btw) - but - they do a good job of confusing you/allowing you to figure things out on your own/etc. I'm still not sure if the others that were around me were my own past replays, or other people...\n\nThe one request I would have to the dev's though is to add a starfing option.\n\nHelpful | 1", "ilanit.ouzielDec 6 at 7:58 AM\nStory is not interesting enough\n\nFor some reason the gameplay didnt draw me to keep playing or return to play.. my guess is that the story is just not interesting. Most of the things are untouchable which is very frustrating to guess which ones matter or not . There are more games that are worth spending our money on\n\nHelpful | 5", "Ex-ParrotNov 21 at 8:09 PM\nNot saving?\n\nGame seems interesting but I am having to start completely over each time I go back in. Shouldn't it save my progress. I am really tired of the intro. Thanks! I am pretty new to VR and was playing for very short times due to motion sickness so I hadn't made it to the under. All good now!\n\nHelpful | 1\nDeveloper ResponseNov 21 at 9:09 PM\n\nThe game should definitely be saving your progress, though each play session will begin in the muddy area by creating your bracelets. After you get to the Under Stage area once, putting on the mask will skip you directly back. Glad to hear it's working! You might also be interested in trying our teleportation mode for less motion(its an option on the menu which you can open with the menu button on the left controller)", "LordSnurtDec 7 at 9:49 AM\nIncredible\n\nLots to explore, discover, and imagine. This is a game, but also an experience. It is what you make it. Creative minds will have a blast- but if youre looking for an on-rails adventure, look elsewhere.\n\nHelpful | 1", "eddiegarouDec 1 at 12:51 PM\nCaught by Surprise\n\nI really wasnt sure what to expect out of this title. But I decided to give it a try and I really enjoyed it! Theres a lot more content in this title than I expected. It was totally worth it, and I even snagged myself a new mask! \n\nHelpful | 0", "FatSheamusDec 12 at 8:18 AM\nGet lost in the art\n\nFrom start to finish, this is a wildly mind bending, and beautiful adventure. Very stylized and filled with secrets just waiting to be discovered.\nThis is no game, its an experience.\n\nHelpful | 0", "chezcatDec 29 at 5:01 PM\nBy FAR the greatest VR game\n\nThis game is By FAR the greatest VR game and in my opinion video game I have ever played.\n\nHelpful | 1", "hansokarlssonDec 12 at 12:35 AM\nMy cup of tea\n\nThis is my cup of tea, great to be lost, confused and thrilled at the same time. I haven't met any real people, that's the only disappointment. Maybe because my time zone is Japan... \n\nHelpful | 0", "Roxtar73Dec 5 at 6:40 PM\nWeird and fun\n\nThis is one of those games that start you off at a loss leaving you to put the pieces together to discover the story and what a story it is. An amazing and fascinating take on the live theater VR experience.\n\nHelpful | 1", "BeanPoleFattyNov 22 at 8:17 PM\nCraziest best game ever!!!!\n\nThis is a ride, so buckle up for a head trip in one of the best and craziest game I have played!!! Key phrases for the game I said a lot was : what? , wow, no way, are you seeing this. My head is blown by this game!!! Must have adventure through an insane journey. WOW!!!\n\nHelpful | 1", "Alex128803Jan 13 at 3:42 PM\nBest game ever\n\nIts a must play\n\nHelpful | 0", "DusitaNov 22 at 1:52 AM\nAmazing!\n\nJust an amazingly unique and fun game. Please make other series too, the idea of an interactive theatre where you can control time and some elements is awesome! Please do more and longer series, maybe something godlike/sandbox-ish stuff? Anyways keep up the great work love it!\n\nHelpful | 0", "nickladdNov 30 at 7:09 PM\nOne of my new favourite games EVER\n\nThis is the game I've played the most of on quest. It doesn't hold your hand and really forces you to explore and experience this magical world. I've never been more immersed in VR before and I hope they continue to add to the world and lore going forward!\n\nHelpful | 1", "nathan.fairbanksNov 21 at 11:18 PM\nUm what?\n\nIt started out cool and eye catching then started getting to a certain point and not seeing a actual objective it feels like a story telling game and your just there to listen and watch and idunno maybe it's just not for me I've spent about 2 hours playing and I am just lost\n\nHelpful | 8", "jimmysoculus123Nov 19 at 8:59 PM\nSeriously awesome!\n\nBy far the best vr game I have ever played! When I got into the theater...\nIt was so darn cool! I've been a part of the vr community since 2014. Played just about everything! This is just incredible! Good job devs!\n\nHelpful | 7", "MaypohlNov 23 at 10:09 PM\nSnap snap\n\nOhh wow I wasnt sure what to expect going in to this game, but after playing the single player aspect and spending a great deal of time in the multiplayer area I can say without a shadow of a doubt The Under Presents is one of my favorite vr games I have played.\n\nHelpful | 0", "ParadiseDecayNov 23 at 6:41 AM\nI never knew this had LIVE performances!\n\nMy Initial Impressions:\nFrom the creative minds of the VR game Virtual Virtual Reality, comes another masterpiece of unique storytelling.\nI never even knew this game had random LIVE actors and performances, there was a character walking around and I just assumed it was an AI controlled character.\nIf you want a clever game to mess with your mind, then this is for you!\nAmazing stuff!\n\n1st Impressions Video with Commentary:\nhttps://www.youtube.com/watch?v=BswmgR18tZ8\n(Please Note: Links might not work from Oculus so please search YouTube for 'Paradise Decay VR The Under Presents')\n\nHelpful | 2", "Minch73Nov 22 at 12:21 AM\nMind-altering Wonderment!\n\nI loved my first hour in this experience (I wouldn't call it a game!) but I did find a bug I think - I got stuck in the \"being a giant\"/boat scene. I wind back and forwards and zoom in and out but could not replace my mask and no buttons or combination thereof could get me past this scene. I had to exit the app completely. Shame as I was completely loving it!\n\nHelpful | 1", "lemonbread095Dec 20 at 7:38 PM\nBeautiful Gameplay Experience\n\nIt's unlike any other game, packed with amazing things to do. There's no exact way to explain it. It's just a great experience!\n\nHelpful | 0", "mateo0Dec 30 at 6:30 AM\nLike no other experience!\n\nThis game is so strange that it isnt descriptible...\n\nHelpful | 2", "TigerTerritoryDec 18 at 4:33 AM\nFantastic\n\nI absolutely loved this game. The graphics and locomotion are phenomenal - I love the teleportation method! Fantastic job developers!\n\nHelpful | 0", "SoulkonnNov 24 at 10:38 PM\nWOW!\n\nI never write reviews. I hate games with no combat.... But this game... It's an amazing experience. I was blown away right from the beginning. The mystery, the atmosphere. The time concept. I am really enjoying it and I can't wait to finish! Great job!\n\nHelpful | 0", "Emily55555Nov 19 at 8:57 PM\nTender Claws, you've done it again!\n\nVirtual Virtual Reality was the first VR game I truly loved.\nThis game is giving me similar feels. It's truly unique and makes you feel like you are in another world. The live actors really take the experience to the next level.\n\nHelpful | 4", "yuriy.galanterNov 24 at 4:09 PM\nThis game is freaking amazing!\n\nI rarely if ever write reviews, but in this case I must. You can really tell this masterpiece came from. Virtual Virtual Reality guys. It's like a Russian nested doll reality with reality within reality. You forget what's real and what's not.\n\nHelpful | 0", "MODPEdeveloperDec 1 at 10:16 PM\nThis is the VR we all dreamed of. 10/10\n\nThis is the best game Ive played, VR or otherwise. The mechanics are amazing, and are by fr the best mechanics Ive used in VR date, the art style is beautiful, I could go on and on... and the STORY.\n\nHelpful | 0", "CassieshldsNov 20 at 8:53 PM\nObsessed !\n\nIve been playing a few hours now and love it! You NEVER know what to expect! Just when you think you dont know what to do, something clicks and you figure it out! It just brings you into another world! Definitely need to experience!\n\nHelpful | 2", "joncoloursDec 1 at 1:29 PM\nSleep No More in VR\n\nIf you love Sleep No More, and other immersive Theatre concepts, then you will likely love this. This has been my favorite VR experience to date. I'm blown away! So much love to the creators \n\nHelpful | 0", "L3nnyJan 4 at 2:54 PM\nBlown away\n\nDmt,acid,f88ked up,love it\n\nHelpful | 1", "ReBornTheFirstDec 16 at 3:41 AM\nMaybe I just don't get it\n\nI played for a while... Tried to understand what the time boat is about but hadn't any fun watching the boring story.. I did read about live actors an peaple in the game. I was completely alone and had absolutely no fun.\n\nHelpful | 5", "cenoquestNov 19 at 2:51 PM\nSpeechless\n\nThere has never been a VR game like this before. When what I thought was an NPC turned out not to be... it was seriously one of the most exhilarating moments Ive had in VR\n\nHelpful | 8", "ArthurjiNov 21 at 8:59 PM\nLike a shared dreamspace\n\nTHE UNDER PRESENTS is like being in Linklater's lucid dream-themed movie WAKING LIFE. If you like the idea of exploring a shared hallucinatory dreamspace, this game was made for you! Highly recommended.\n\nHelpful | 4", "dajakestaNov 23 at 3:36 PM\nUN F'in Real.. UN-REAL.\n\nI can't get over it. This is the most amazing VR experience ever, and in my life. The utter confusion and the ah-ha moments. Legit creative geniuses whoever made this.\n\nStick through this. It's so confusing at first but so amazing.\n\nHelpful | 0", "HalfCountNov 30 at 5:39 PM\nGreat Experience\n\nOverall I would definitely recommend this app, but the TimeBoat is just kinda dull. You cant do anything except watch. I dont know what happens in the epilogue but Acts 1-3 are boring and I wish there was more to it.\n\nHelpful | 1\nDeveloper ResponseNov 30 at 6:15 PM\n\nHey thanks for playing! Keep exploring the TimeBoat, each of the characters in Acts 2 + 3 can be saved if you intervene at the time of their disappearances", "Jagtiguar27Nov 21 at 9:39 PM\nPure art\n\nYou won't know what to expect. And it kinda makes you hope and wonder; what if this is what happens when you die and I'm really diggin this afterlife vibe full of beautiful confusion. If only I had a chance to be one of the actors.\n\nHelpful | 1", "FlamingsnowmanNov 20 at 1:44 AM\nWow, what a gift\n\nIf you want to experience something unlike anything else, and become more present to your impact as a living, rippling being, try this game on for twenty minutes. Very high expected value if you're a satisficer.\n\nHelpful | 3", "Taco.flakesDec 17 at 7:05 PM\nBest experience on the Quest right now!\n\nCan't ruin the game by saying much. Just know it's more than you think. Best experience on Quest so far.\n\nHelpful | 0", "adamraraNov 25 at 9:49 PM\nWe need more content like this.\n\nThe art style is phenomenal. The interactions are great. The locomotion is so unique. The originality is 100. It's artsy, it's immersive, it's amazing. I wish I could be one of those actors!\n\nHelpful | 2", "AlabasterSlimNov 28 at 5:33 AM\nLove it\n\nI still dont really understand it and I love it for that. Its like a mystery, the whole game is some mind bending puzzle trying to figure out what is going on and where you are.\n\nHelpful | 1", "TartanstormNov 29 at 6:20 PM\nPure magic - VR and art at thier best\n\nFirst of all dont read too much of the reviews this is an experience best experienced with no prior knowledge of what is to come.\n\nAt first you are confused , then you are intrigued and then you are amazed!\n\nHelpful | 1", "MasterFGHJan 4 at 1:21 PM\nVery good\n\nPlay it, very good\n\nHelpful | 1", "DeadlyDestroyerNov 30 at 1:24 PM\nOne of a kind.\n\nThis may be one of the most unusual experiences I've had in VR. This game truly shows off the unique possibilities that VR is capable of. A must have for any Quest owner.\n\nHelpful | 0", "CatsHDec 13 at 9:37 PM\nPURELY FASCINATING!\n\nI HAVE NO IDEA WHAT THIS GAME IS BUT I LIVE INTERACTING WITH PEOPLE AND THE LIVE ACTORS THERE!\n\nHelpful | 1", "darwins.lastNov 21 at 6:25 PM\nMind blowing\n\nThis is what virtual reality should be about. Not realism but hyper abstract expressionism.\n\nHelpful | 3", "rcounts00Dec 24 at 12:57 AM\nThe under is good\n\nI spent a good portion of time on this game. Its very good.\n\nHelpful | 0", "SirRealDealNov 20 at 5:23 AM\nSNAP!\n\nI'd say it's a one of a kind VR experience but we've already played Virtual Virtual Reality.\n\nThe two are similar in a WTF kinda way.\n\nAnd that's a good thing. A very, very good thing.\n\nHelpful | 2", "josh98125Nov 23 at 11:19 AM\nA unique experience\n\nMy wife and I have been enjoying this unique Oculus experience. Very much recommended.\n\nWe both feel like it has a lot of similarities to the play \"Sleep no more\" in NYC.\n\nHelpful | 2", "DefectusDec 19 at 5:55 AM\nDelightful game\n\nSolid game with interesting story and innovative features\n\nHelpful | 1", "PinkGreaseNov 20 at 8:10 AM\nIf David Lynch would make a vr game...\n\nThis game is what I imagine a game from David Lynch would be like. + a kick in the nuts (just felt inspired by all the absurdities)\n\nHelpful | 7", "rbgbNov 23 at 1:23 PM\nSo weird and good\n\nOnly two hours in but already I love it. This is what it looks like to create something new in the way that only VR can. The same left-field wit that I loved in virtual virtual reality\n\nHelpful | 0", "AlecxsmcinNov 21 at 5:39 PM\nAmazing\n\nVery surreal experience. I was only able to play for a short time, but I cant wait to get back in!\n\nI am absolutely amazed at what these devs have pulled off. This game is a must buy.\n\nHelpful | 0", "NVRflameNov 30 at 10:03 PM\nGreat game!\n\nIts an awesome game and their staff was very helpful when I made contact with them too.\n\nIf you only buy one game, make it this one! :)\n\nHelpful | 5\nDeveloper ResponseNov 30 at 12:23 PM\n\nThanks for playing! if you liked the intro style gameplay keep digging in and following the characters in the later acts, One by one as they get devoured by the time mists you'll have the opportunity to save them with a looping ghost puzzle similar to the intro doors section.", "YusifSDec 11 at 2:13 PM\nDont be tricked by the five star review\n\nThe five and four star reviews are faked by the creators to trick you into buying this game. They tell you its a puzzle game when all you do is watch random musicians that are irrelevant and watch a boring story. There is no puzzles, no entertainment, and no satisfaction.\n\nHelpful | 7", "louis.castricatoNov 22 at 9:06 PM\nGame breaking bugs\n\nMy entire screen is filled with black boxes and I cannot progress any further.\n\nThe game is good, but I keep running into bugs.\n\nUpdate: everything seems to be in working order. I highly recommend this game.\n\nHelpful | 10\nDeveloper ResponseNov 19 at 3:05 PM\n\nHi, we're looking into this, seems to be a rare shader glitch. For now hit the power button to put headset to sleep and hit it again to wake it up and it should go away. If not that restarting headset does the trick. Also if you hit any other bugs please do let us know at info@tenderclaws.com so we can get them fixed asap!", "Doom6197Nov 21 at 8:44 AM\nUnique experience\n\nLess you know the better\n\nHelpful | 4", "resresNov 25 at 1:54 PM\nIndescribably amazing\n\nI just had a 1 on 1 moment with a live actor. This VR experience is easily the best piece of interactive theatre/art/VR I've ever experienced.\n\nHelpful | 1", "RockingSummerNov 22 at 12:35 PM\nMy Pre-Review\n\nI havent even played it yet and Im already excited, VVR was so bloody good Ive been waiting for a new tender claws project for ages, full review tommorow after Ive played it!\n\nHelpful | 0", "DirectorWillNov 25 at 7:50 AM\nInsanely fun but story was confusing\n\nIm not sure if Im suppose to just keep playing it over and over again. But the entire time I was confused if I was playing in chronological order or out of order and the end I felt like my mind was suppose to be blown but I didnt. I feel like I missed a lot of steps and I dont even understand why. It upsets me cause I was genuinely looking forward to this game. Will play again later but Im hoping this isnt the way it was intended to be played. Really sad this didnt give me the experience VVR gave me. Also when it forces you to work with other players that is the worst. I was so confused as was everyone else. We could try so many times it makes you lose your mind. Some of the puzzles are INSANELY confusing with no proper hints or direction. Ill keep a look out for the next game from the developers but this one was sadly not for me I guess. :(\n\nHelpful | 7", "KeithTheEditorNov 19 at 6:35 PM\nCan't wait!\n\nI just bought this because I was very impressed with VVR, and the developers seem dedicated. Live actors!? O man! I can't wait to experience this! Will update asap\n\nHelpful | 1", "SoakingRichNov 20 at 12:07 AM\n\nHigh art in gamemaking.\n\nHelpful | 4", "huggsbosonNov 25 at 7:06 PM\nDeeply engaging and mysterious\n\nMost fun I think I've had in VR. Super reminds me of a showing of sleep no more, from the styling to the cool lost feeling you get.\n\nHelpful | 1", "calforbNov 22 at 11:08 AM\nWeird, wacky and wonderful\n\nWeird, wacky and wonderful. The ability to interact with characters being played by real actors is just surreal. Definitely worth experiencing.\n\nHelpful | 1", "MVRhodesNov 20 at 12:19 PM\n\nWhat a beautiful experience here. Thank you Lady Skeleton for our encounter on the roof today. Might need a bigger broom for all this sand ;)\n\nHelpful | 2", "TheMortalCoil82Nov 21 at 7:45 AM\nRefreshing !\n\nThis game is pretty awesome! Ive only spent an hour or so in the game, but from what Ive seen, I cant wait to jump back in and play more.\n\nHelpful | 1", "cwmassey9Nov 23 at 8:24 PM\nFun\n\nI havent finished the game but its fun and smart just as virtual virtual reality! Im excited to see why the creators do next!\n\nHelpful | 1", "kgpaintsNov 28 at 8:30 PM\nExcellent!\n\nA big main storyline, secrets, magic spells to learn, and lots to explore. The live actors are super fun too!\n\nHelpful | 1", "hsoj39Nov 22 at 10:16 PM\nIncredible\n\nSuper immersive super funny super awesome I can't articulate how incredible this game is it's just something you have to experience for yourself\n\nHelpful | 0", "LolyJrDec 13 at 6:01 PM\nAmazing game\n\nBeautiful, but puzzling story!\n\nHelpful | 1", "PreetonNov 23 at 8:16 PM\nBest game\n\n10/10\n\n( updated) just finished the whole story game and what a game it is, this is a must have game to experience.\n\nHelpful | 3", "derrickbailey4Nov 21 at 8:41 PM\n100 Stars\n\nI Give This Game 100 Stars It Is A Must Buy Trust Me I Love It\n\nHelpful | 2", "claret1882Nov 21 at 1:52 PM\nOne word\n\nIncredible!\n\nHelpful | 3", "DJUrban89Nov 27 at 12:14 PM\nAn amazing expierence\n\nThe mystery, the real life actors, the story, it all comes together for one amazing expierence.\n\nHelpful | 1", "JoeyGalloNov 23 at 10:40 PM\nComing back for more and more\n\nWhen Im not playing I miss visiting.\n\nHelpful | 2", "HedonXNov 29 at 5:54 AM\ngood\n\ngood\n\nHelpful | 2", "MrDoloresNov 30 at 11:19 AM\nBrilliant\n\nThe first game I have played that truly takes advantage of virtual reality\n\nHelpful | 1", "dark_entityNov 24 at 3:21 PM\nPure class\n\nWhat an amazing use of VR, it's so refreshing playing something original in an unoriginal gaming world\n\nHelpful | 0", "skm2Dec 8 at 10:24 PM\nSickmode\n\nHi. Question to the developer : is there a mode to avoid motion sickness ?\nGame is awesome otherwise !\n\nHelpful | 2\nDeveloper ResponseDec 11 at 2:02 PM\n\nHey, yes there is! By hitting the menu button on your left controller you can bring up a menu with the option to enable a teleport style locomotion.", "snipeasy69Nov 24 at 2:49 PM\nA Worthy Trip\n\nThis was a surprisingly great trip, gameplay was something else and makes you use your brain. Definitely recommend\n\nHelpful | 0", "TidyWhiteeNov 21 at 7:14 AM\nIt's the under where\n\nDrop trousers and give it a gough you might like it.\n\nHelpful | 2", "UhluhtkNov 24 at 6:46 AM\nFavorite quest game\n\n10/5 I dont want to write a whole essay about why this game is amazing so, just get it.\n\nHelpful | 0", "AltVRatDec 6 at 10:47 PM\nLove it but...\n\nCan't play piano and keep getting stuck in the \"stock room\". Theater: yes please! Escape room: no thanks!\n\nHelpful | 0\nDeveloper ResponseDec 11 at 2:03 PM\n\nHa, sorry about the lack of piano fidelity. Please feel free to reach out to info@tenderclaws.com with where you're stuck and we'll be happy to help.", "Slo-Nov 30 at 8:16 AM\nGood\n\nPretty hecking magical m8\n\n\n\nTry it, youll see\n\nHelpful | 1", "djnes267Dec 1 at 12:50 PM\nWaste of money\n\nMakes no sense! You just wander around a dessert and nothing happens and you cant do anything!\n\nHelpful | 9", "Occy999Nov 19 at 11:46 PM\nCreative and brilliant.\n\nWhen the creators of VVR put out their first Quest game, it's a buy-first-questions-later situation for me.\n\nHelpful | 1", "magicbandzNov 24 at 1:41 PM\nMysterious\n\nTheres a lot to be discovered in this game. Worth taking your time with.\n\nHelpful | 0", "jonnyKAEDec 1 at 10:21 AM\nThe Under Presents is like a dream\n\nThis is worth your time.\n\nHelpful | 1", "ZedisnotdeadNov 20 at 8:39 AM\n\nThis game is amazing!!!!! Lots of hard work went into this and it shows. I am stunned!!!!\n\nHelpful | 0", "Luf0uNov 26 at 12:39 AM\nMust buy!\n\nIve only scratched the surface and I cant stop playing!\n\nHelpful | 0", "rubico36Nov 22 at 4:45 PM\nAmazing\n\nGreat game, hope it will keep growing and we will see more puzzles, mini games and content. The way to go!\n\nHelpful | 0", "Xer0PixelNov 20 at 4:04 PM\nAmazing\n\nA great place and an amazing experience every time. You'll never want to leave!\n\nHelpful | 1", "MarkazieNov 20 at 7:23 AM\nGreat fun!\n\nIve had a lot of interactions with live actors its very fun!\n\nHelpful | 1", "Goofy_IvanNov 19 at 7:41 PM\nAmazing\n\nGreat voice actors The game feels smooth, and I love the mechanics\n\nHelpful | 1", "RiersonL19Nov 28 at 5:09 PM\nNot worth playing. Spend your $ elsewher\n\nIf you're on the fence don't buy. Another confusing puzzle vr game. Too similar to their other game virtual virtual reality.\n\nHelpful | 6", "AaxanosNov 20 at 4:10 PM\nAmazing.\n\nThis game is so good. The devs are particularly great and funny.\n\nHelpful | 0", "1018KathyDec 1 at 11:39 AM\n:-)\n\n:-)\n\nHelpful | 1", "Jo-JoelNov 25 at 5:32 PM\nGood\n\nCool low key gives me head aches\n\nHelpful | 1", "aaron.sommers.1253Nov 25 at 11:55 AM\nThe Under\n\n33rd parallel.\n\nHelpful | 0", "sinkkingNov 20 at 6:24 PM\nSeemed liked it might be fun until..\n\nGlitching all over the screen\n\nHelpful | 6\nDeveloper ResponseNov 20 at 6:31 PM\n\nHi, thanks for playing. we're looking into this. For now if you see this hit the power button to put your headset to sleep and then hit it again to resume and it will go away."]